{
  "id": "43997",
  "title": "Fontstruct",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all came across this today  \n [http://fontstruct.fontshop.com/](http://web.archive.org/web/20080706172244/http:/fontstruct.fontshop.com/ \"http://fontstruct.fontshop.com/\")\n\n [‹ 100 years of...](http://web.archive.org/web/20080706172244/http:/www.typophile.com/node/44375 \"Go to previous forum topic\") [Typowiki How-To ›](http://web.archive.org/web/20080706172244/http:/www.typophile.com/node/44394 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706172244/http://www.typophile.com/user/26106\" title=\"View user profile.\">concrete</a>",
  "time": "<br>",
  "uid": "26106",
  "comments": [
    {
      "time": " 7.Apr.2008 4.21pm",
      "content": "Yea, I found that yesterday on stumble upon I’ve yet to try it out. Let me know what you think about it.\n\n"
    },
    {
      "time": " 7.Apr.2008 5.20pm",
      "content": "I love it, so simple and so fast. I’m about to use FontLab for the first time next monday and this looks so much more simple than everything I’ve been reading up on FontLab. This is like Paint! Wicked!\n\n"
    },
    {
      "time": " 7.Apr.2008 11.31pm",
      "content": "Tom, I too love FontStruct, but it is limited to modular fonts. Even FontShop acknowledges this at the bottom of each page in the Gallery (“Some fonts you can’t FontStruct.”) Don’t miss out on the chance to learn or use FontLab; I’m sure you won’t regret it.\n\n"
    },
    {
      "time": " 8.Apr.2008 6.36am",
      "content": "It’s neat. But, yea, not a replacement as much as just another option in the toolbox.\n\n"
    },
    {
      "time": " 8.Apr.2008 7.03am",
      "content": "I’ve been playing with it for a while now, and it’s definitely fun. It’s also more robust than I expected. However, it’s a modular font builder, so you have to think on a grid. Fontstruct’s font exporting is very easy, so you could whip up a simple all caps font in a few days and then wrap it into a project (which is nice for those of us without FontLab).\n\nI’m playing with a blackletter for fun. It’s called [Faketur](http://web.archive.org/web/20080706172244/http:/fontstruct.fontshop.com/fontstructions/show/faketur). Very much a work-in-progress, but I’m getting a kick out of working within the constraints of the grid. The only thing I haven’t figured out yet is controlling the spacing.\n\n"
    },
    {
      "time": " 8.Apr.2008 7.16am",
      "content": "Here is another similar tool... been around for years at this point:\n\n[http://www.pentacom.jp/soft/ex/font/edit.html](http://web.archive.org/web/20080706172244/http:/www.pentacom.jp/soft/ex/font/edit.html \"http://www.pentacom.jp/soft/ex/font/edit.html\")\n\n"
    },
    {
      "time": " 8.Apr.2008 9.38am",
      "content": "_The only thing I haven’t figured out yet is controlling the spacing._\n\nChris, I’m not sure you can control the spacing (between letters as well as between words), but I think Rob Meek and Co. might be working on improving it — I read a comment somewhere to that effect, but I can’t remember for which font. :-/\n\nBy the way, I love Faketur!\n\n"
    },
    {
      "time": " 8.Apr.2008 12.09pm",
      "content": "Yeah Chris your font is awesome!  \nI’ve been playing with it this morning as well. I like it, but wish for a little more freedom. It’s in beta so I assume they’ll make some improvements.\n\n"
    },
    {
      "time": " 8.Apr.2008 3.23pm",
      "content": "man the voting is nasty tho! seems people vote your stuff down just so they can get ahead of you in the ratings. \\>^p\n\n"
    },
    {
      "time": " 8.Apr.2008 3.34pm",
      "content": "I played around with Fontstruct when it was in beta and did [Boxy 1](http://web.archive.org/web/20080706172244/http:/fontstruct.fontshop.com/fontstructions/show/162) and [Boxy 2](http://web.archive.org/web/20080706172244/http:/fontstruct.fontshop.com/fontstructions/show/171), which are both based on “fonts” I designed in college (about 1975) on graph paper. It’s really a lot of fun. Reminds me of making bitmap fonts with Altsys’ Fontastic, but with the twist that the bits don’t have to be squares or fill the grid spaces.\n\n"
    },
    {
      "time": " 8.Apr.2008 3.42pm",
      "content": "It looks like a potentially useful tool for making pixel fonts. I haven’t tried it yet, because one aspect makes me uneasy. Even after reading the relevant documents over again, it’s not entirely clear to me, but it looks as if using this tool to execute a design means giving up the rights to the design. There are some vague suggestions that a “fontstructed” font belongs to its creator, yet FontShop appears to claim the right to dictate what kind of license the creator may and may not choose to distribute it with, which means it does not.\n\n"
    },
    {
      "time": " 8.Apr.2008 3.54pm",
      "content": "i didn’t get that impression. following is from the site:\n\n<cite>An Overview of Licensing</cite>\n\nWhen you, as a designer, share your FontStructions you can choose from a number of different Creative Commons licenses.\n\nThese licenses are displayed on the web page of each FontStruction, they are embedded in the digital font files, and they are included as a text file as part of each download.\n\nand just for fun: [I ❤ FontStruct](http://web.archive.org/web/20080706172244/http:/www.pilcrowtype.com/blog/archives/15).\n\n"
    },
    {
      "time": " 8.Apr.2008 4.18pm",
      "content": "here is mine. feel free to suggest improvements or ideas.\n\n[http://fontstruct.fontshop.com/fontstructions/show/exp1\\_not\\_complete](http://web.archive.org/web/20080706172244/http:/fontstruct.fontshop.com/fontstructions/show/exp1_not_complete \"http://fontstruct.fontshop.com/fontstructions/show/exp1\\_not\\_complete\")\n\n"
    },
    {
      "time": " 8.Apr.2008 5.28pm",
      "content": "The new Type Battle announced today utilizes FontStruct! Put your skills to the test, think inside the grid.\n\n[http://www.typophile.com/battle21](http://web.archive.org/web/20080706172244/http:/www.typophile.com/battle21 \"http://www.typophile.com/battle21\")\n\n"
    },
    {
      "time": " 9.Apr.2008 7.47am",
      "content": "I spent my afternoon at work, not working, and playing with the program. Evidently I only hit ’save’ after the capital J and when I got to the end and pressed save it asked me to sign in again and promptly lost everything I’d done after the J. I was so bummed.\n\nI guess that’s what I get for pretending to work.\n\nhonk if you love the status quo\n\n"
    },
    {
      "time": " 9.Apr.2008 10.06am",
      "content": "I’ve played around with it now, and it’s nice. But I think my concerns are still valid. If I put a lot of work into something really useful, it doesn’t look like I’d be allowed to try to sell it, or even to distribute it free myself without advertising FontShop. They’ve effectively decided for the whole world that any creativity that goes into a bitmap or modular font is valueless. Is that their call to make?\n\nSure, I could load my “FontStruction” into Typetool to add some much-needed kerning pairs and strip out all the info that says my font was made by FontShop. But I get the impression that this is a civil infraction. And if I _don’t_ do this and instead rebuild the font the hard way, the very fact that I now have a FontStruct account means I can’t prove I didn’t.\n\n"
    },
    {
      "time": " 9.Apr.2008 10.21am",
      "content": "Kevin, I’m not sure where you’re getting your information from. If you could point me in the proper direction...\n\nFrom the FontStruct website:\n\n<cite>When you, as a designer, share your FontStructions you can choose from a number of different Creative Commons licenses.</cite>\n\n<cite>These licenses are displayed on the web page of each FontStruction, they are embedded in the digital font files, and they are included as a text file as part of each download.</cite>\n\n<cite>To learn more about what Creative Commons is, and what it offers you, please visit the <a href=\"http://web.archive.org/web/20080706172244/http:/creativecommons.org/\">Creative Commons website</a>.</cite>\n\nAs stated, these licenses apply only if you share your FontStructions. You can, of course, keep them private so only you can download them. presumably, if you do this, none of the licenses apply. I tried this last night and the font file I downloaded cited me (as my username) as the copyright holder.\n\nOf course it would be excellent to hear from the FontShop folks for further clarification tho...\n\n"
    },
    {
      "time": " 9.Apr.2008 10.34am",
      "content": "Saying you ’can choose’ from a CC license doesn’t seem to imply you must. Even if you must, CC licenses are non-exclusive, meaning you can apply additional licenses as you see fit (including commercial licenses involving sales).\n\n"
    },
    {
      "time": " 10.Apr.2008 2.09am",
      "content": "Paul and Aluminum got it right. Your work is your own and FontShop claims no rights to it beyond what you allow with your Creative Commons license.\n\n\\> They’ve effectively decided for the whole world that any creativity that goes into a bitmap or modular font is valueless.\n\nI’m not sure what you mean here. Could you clarify?\n\n\\> strip out all the info that says my font was made by FontShop.\n\nThe only reference to FontShop in the font data is:\n\nDescription: This font was created using FontStruct ( [http://fontstruct.fontshop.com](http://web.archive.org/web/20080706172244/http:/fontstruct.fontshop.com/ \"http://fontstruct.fontshop.com\"))  \nDesigner: [Your Name Here]  \nManufacturer: [http://fontstruct.fontshop.com](http://web.archive.org/web/20080706172244/http:/fontstruct.fontshop.com/ \"http://fontstruct.fontshop.com\")  \nTrademark: FontStruct is a trademark of FSI FontShop International GmbH\n\n"
    },
    {
      "time": " 10.Apr.2008 2.56am",
      "content": "\\> Your work is your own and FontShop claims no rights to it beyond what you allow with your Creative Commons license\n\nI’ve been curious about Fontstruct, but haven’t had a chance to set up an account and noodle with it. (I’m never good at early adopting.)\n\ncouple of questions, Stephen, if you don’t mind.\n\n• Does FontShop allow the creators to:  \n • distribute their work elsewhere?  \n• sell their work via a competitor?  \n• strip out any FontShop ID in the font data?\n\n• Does FontShop plan to refine any of these fonts and sell them, with royalties to the creators? (What exactly are the plans with this?)\n\n• Can you tell us who built the actual app? And are there any future expansion plans (kerning, for example)?\n\n• Can you tell us whose idea this was, and how long the site has been in develoment?\n\n• If a big corporation wants to license a more professional version of a Fontstruct font, and they contact FontShop, what does FontShop do?\n\n• For purposes of copyright (or not), does the font creation happen in the country of creation, or is the country of creation the place where FontShop’s servers reside?\n\njust a wonderin’.\n\nthanks in advance.\n\n"
    },
    {
      "time": " 10.Apr.2008 7.10am",
      "content": "Damn good questions, bj. I’ve been a-wonderin’ about some of those meself.\n\n"
    },
    {
      "time": " 10.Apr.2008 12.51pm",
      "content": "_“I’m not sure what you mean here. Could you clarify?”_\n\nWell, it’s obviously targeted at font users rather than font designers. It’s like, “Looking for a font? Great! If you want a pixel font, play with this toy, because anyone can design a pixel font. Or use one that someone else made; they’re all free. And if you want a _real_ font, buy it from us.”\n\nWhen I download my font (not having shared it), it comes in a zip with a read-me file all about FontStruct and FontShop that ends:  \n_“LEGAL NOTICE:  \nIn using this font you must comply with the licensing terms described in the  \nfile “license.txt” included with this archive.  \nIf you redistribute the font file in this archive, it must be accompanied by  \nall the other files from this archive, including this one.”_    \nMaybe I’m overcautious, but I feel like it would be foolish upon reading this to assume “you” doesn’t mean me.\n\n"
    },
    {
      "time": " 10.Apr.2008 1.41pm",
      "content": "_\\> Does FontShop allow the creators to:  \n• distribute their work elsewhere?  \n• sell their work via a competitor?  \n• strip out any FontShop ID in the font data?_\n\n**Designers own their FontStructions and can either keep them private or choose to share them publicly under a Creative Commons license.** So the answer to all of these would be _yes_. There are references to FontStruct in the font data but these do not effect the copyright of the designer. The only reference to FontShop is the FontStruct URL and trademark for FontStruct. If a user generates a font with FontStruct and then works on it with another tool, it makes sense that this info may be replaced.\n\n_\\> Does FontShop plan to refine any of these fonts and sell them, with royalties to the creators?_\n\nWe have no specific plans in this area, but we’d certainly be in touch with the creators themselves if we did. We also welcome font submissions to the FontFont library and foundry submissions to FontShop, as usual, whether created with FontStruct or not.\n\n_\\> Can you tell us who built the actual app? And are there any future expansion plans (kerning, for example)?_\n\nAs alluded in the site footer, Rob Meek created the concept and developed the site and application in collaboration with FontShop. We certainly have enhancements planned, and because this is a web app, things can be added on the fly. We’ve received some excellent suggestions from users and encourage more feedback.\n\n_\\> Can you tell us whose idea this was, and how long the site has been in develoment?_\n\nFontStruct is Rob Meek’s idea and we’ve been working together on it for several months.\n\n_\\> If a big corporation wants to license a more professional version of a Fontstruct font, and they contact FontShop, what does FontShop do?_\n\nWe would naturally comply by the Creative Commons license applied to that particular FontStruction.\n\n_\\> For purposes of copyright (or not), does the font creation happen in the country of creation, or is the country of creation the place where FontShop’s servers reside?_\n\nWithout being a lawyer, I can’t give a categorical answer, but it seems to us that the font creation happens in the country where the creator (FontStruct user) is located.\n\nI hope that clarifies things. It’s probably helpful to know that the idea behind FontStruct is to cultivate a font-building community where modular fonts are created, shared, and discussed freely. There is absolutely no intent to exploit designers or their work. The Creative Commons licensing options and the privacy options are included to give designers complete control over their creations and what they do with them. This is the same model used by other creative sharing sites like Flickr.\n\nFontShop’s commercial interest in the project is in reinforcing our brand’s commitment to creativity and directing people to quality typefaces that can’t be made with a modular tool.\n\n"
    },
    {
      "time": " 10.Apr.2008 2.28pm",
      "content": "Another question for you, Stephen:\n\nSome commercial fonts are already quite modular in their design - how would you react to FontStructed versions of existing commercial fonts?\n\nLegally they would probably be OK, as they undeniably are made from scratch, and as long they don’t use registered names they should go clear of those kind of infringements as well. And the technical quality would not be as good as the originals (at least not until you implement spacing and kerning ;) so they wouldn’t really compete.  \nBut still...\n\n"
    },
    {
      "time": " 10.Apr.2008 2.58pm",
      "content": "thanks for the thorough reply.\n\noops, missed Rob Meek’s name, but I definitely recognize his work.\n\n[http://www.robmeek.com/](http://web.archive.org/web/20080706172244/http:/www.robmeek.com/ \"http://www.robmeek.com/\")\n\n\\> it makes sense that this info may be replaced.\n\njust a humble suggestion, but from a creator point-of-view, more of these questions ought to be answered on the site, with more specific language.\n\nre: modular vs. non-modular\n\nI got a similar feeling as Kevin’s, when I visited a week ago, and it seems that the verbiage has been softened since then. It didn’t bother me too much, because the term, modular font, is already a pejorative as it relates to type. But what’s interesting is seeing faces like Cholla Slab pop up as non-modular, when it clearly is modular with some finish. And don’t most typefaces have modular underpinnings? — shapes/units repeat, and type designers use the repeating shapes for other letters. Really, what is the determinant as to what constitutes a modular font, just out of curiosity?\n\nmodular: Designed with standardized units or dimensions, as for easy assembly and repair or flexible arrangement and use.\n\nIt’s an interesting conflict for Fontshop. If you are opening up type design to the masses with a clever app, and you want to build a crowdsourced community and serve advertising, wouldn’t it make sense to point out how the creations can never be as good as a real FontShop typeface from a real type designer? And actually keep Rob’s application from getting too advanced?\n\nBut then are they truly serving this new community, and the needs of the new community?\n\nFontstruct, and a crowdsourced type design community — these are such landscape changers in terms of innovation ... but maybe it really won’t have much affect on the ’regular’ type industry, perception of type designers, etc. But it sure does raise a lot of questions. :)\n\n"
    },
    {
      "time": " 10.Apr.2008 3.02pm",
      "content": "_Some commercial fonts are already quite modular in their design - how would you react to FontStructed versions of existing commercial fonts?_\n\nRoger, I believe there is already an example of that: user mattmc created [a FontStruct version of Wim Crouwel’s New Alphabet](http://web.archive.org/web/20080706172244/http:/fontstruct.fontshop.com/fontstructions/show/1533), and there is [an existing commercial version](http://web.archive.org/web/20080706172244/http:/www.foundrytypes.co.uk/foundry_architype_3/archi_3_new_alpha3.html) made by [The Foundry](http://web.archive.org/web/20080706172244/http:/www.foundrytypes.co.uk/).\n\n"
    },
    {
      "time": " 10.Apr.2008 3.47pm",
      "content": "_\\> wouldn’t it make sense to point out how the creations can never be as good as a real FontShop typeface from a real type designer?_\n\n“Good” is subjective. ;) Seriously, I believe the contrast is already made clear in the differences between the FontStructions and the FontShop fonts featured at the bottom of the Gallery pages.\n\nThe enhancements we plan to add are focused on community, discussion, and sharing more than on creating the next Garamond, Helvetica, or even Cholla.\n\n"
    },
    {
      "time": " 10.Apr.2008 5.17pm",
      "content": "I want to say I appreciate that you’ve answered these questions clearly, and would have appreciated it equally even if the answers had not been the ones I hoped for.\n\nI apologize if I seemed confrontational. It’s just easy to become gun-shy in regard to services that handle member-generated content and have ambiguous terms of use. Many companies, from Café Press to Six Apart, have repeatedly stumbled into these problems, whether through accidental misunderstandings, casual disregard, or deliberate greed. An artist has to be careful these days lest he jump onto what looks like a great resource and find he’s given all his work away.\n\nEven though trying to ascribe value to raster font design may indeed be a lost cause at this point, and even though it’s clear now that I’m welcome to try on my own while still availing myself of this nice free tool you’ve provided, consider this suggestion: I would happily pay a small sum of money for a special account with which I could offer a particularly elaborate FontStruction through the FontStruct site for a dollar, which people may pay just for the convenience of not constructing it themselves... Not a trivial thing to implement, I know, what with processing payments and sending out checks and all, but it could be worthwhile.\n\n"
    },
    {
      "time": " 17.Apr.2008 7.01pm",
      "content": "Hmmm Me too. And actually having kerned my little font battler I wouldn’t mind if I could somehow post it especially if it could be sold for $2-3 or something. Putting that infrastructure in is not a minor task though - i bet.\n\n"
    },
    {
      "time": " 18.Apr.2008 8.33am",
      "content": "Your typeface rocks, Eben. Very cool work!\n\n"
    }
  ]
}
