{
  "id": "43992",
  "title": "FontXChange",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi has anyone tested/tried/demo’d FontXChange by Morrison SoftDesign  \n [http://www.morrisonsoftdesign.com](http://web.archive.org/web/20080828110539/http:/www.morrisonsoftdesign.com/ \"http://www.morrisonsoftdesign.com\")\n\njust wondering what you think, thanks\n\n [‹ \"Procedural Typography\"](http://web.archive.org/web/20080828110539/http:/www.typophile.com/node/43979 \"Go to previous forum topic\") [Linotype FontExplorer for Windows... When? ›](http://web.archive.org/web/20080828110539/http:/www.typophile.com/node/44035 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828110539/http://www.typophile.com/user/26106\" title=\"View user profile.\">concrete</a>",
  "time": "<br>",
  "uid": "26106",
  "comments": [
    {
      "time": " 7.Apr.2008 4.13pm",
      "content": "I recently bought it. It works very well. I wanted to change some of my library over to OT, and it went very smoothly.\n\nMy only disappointment is that you have no control of the font’s metadata(?). I was spoiled trying out TransType Pro, which allows you to fine tune some things (family, etc). FXC doesn’t have anything extra. It just does a straight conversion, albeit excellently.\n\nGo ahead and demo it. You may love it!\n\n"
    },
    {
      "time": " 7.Apr.2008 4.54pm",
      "content": "Hi I purchased it a while back. I posted this a I have not seen 1 review anywhere, I was wondering if it was being avoided.\n\n"
    },
    {
      "time": " 7.Apr.2008 5.09pm",
      "content": "One reason could be the nefarious use of such software like FontXChange. Maybe nefarious is too strong a word. Anyway, most EULAs (for most foundries) do not allow modifications of any kind to their fonts.\n\n"
    },
    {
      "time": " 8.Apr.2008 7.10am",
      "content": "Ouch! Tiffany, I saw this as a convenient tool for a file format change. I respectfully ask (out of ignorance, not pointed sarcasm), is this really akin to EULA-specified modifications like changing font outlines and other data? Do you see FontLab’s TransType Pro as nefarious, or is it legitimate because it is from a respected, well-established company? If the use of TTP is more legit, what makes it so? (especially considering the moderately extended editing capabilities it has.)\n\nThanks!\n\n"
    },
    {
      "time": " 8.Apr.2008 9.15am",
      "content": "<cite>Do you see FontLab’s TransType Pro as nefarious, or is it legitimate because it is from a respected, well-established company?</cite>\n\nMy hope with TransType is that it is based off of the same code base as the FontLab products. As such, they may have a genuine advantage in terms of standards compliance. It’s far from clear where Morrison is getting their conversion technology. When a font is converted, it goes from being a known, tested component to being, effectively a beta version. This is one reason that font vendors do not like conversion software. It might be more appropriate if the conversion software always added some sort of name-modification to the font... For example, “Futura” could be renamed as “Futura-CONVERTED” so that end users could easily determine that the font was not in the condition provided by the foundry.\n\nIf I were to try to think of the feature that is most often screwed up in conversion, I would have say it’s style-linking. The reason is that there are certain aspects to setting up cross-platform style linking that require specific decisions on the part of the font vendor. There’s no one, correct way of linking font families, so there’s no conversion software that can always get it right.\n\n"
    },
    {
      "time": " 8.Apr.2008 9.54am",
      "content": "Ouch? I wasn’t trying to bite. ;^) Like I said “maybe nefarious is too strong a word”.\n\nBut, the only people who can validly use this software are (a) foundries and/or type designers looking for a quick way to convert their own fonts and (b) those people who license fonts from the very few (if any?) foundries that allow modifications. It really is looked upon as modifying the font. And no, TTP is not more legit. Neither are not legit either. It just depends upon who is using it and for what purpose.\n\n"
    },
    {
      "time": " 8.Apr.2008 1.35pm",
      "content": "For personal only, though did have a font that was corrupting and just was not playing nice, so tested with Font Dr, no joy, then FontXChange to see if it could help the situation, which it did. Again personal use only.\n\n"
    },
    {
      "time": " 8.Apr.2008 2.07pm",
      "content": "I’m splitting hairs, but personal use is still disregarding the EULA. But, I will say if the foundry cannot help you then to each there own. ;^)\n\n"
    },
    {
      "time": " 8.Apr.2008 2.44pm",
      "content": "The font I fixed I was surprised that the font was released in such a state. If splitting hairs, I split a few when I approached ’the foundry’ suggesting they check ’that’ corrupted font, I got a new one it is still dodgy... what is a person to do: not buy any fonts from that particular font designer. I easily bore of babysitting people through how to fix things. The font was dropping in and out of Indesign like a guest appearance on Mork and Mindy.\n\nBy the personal only I mean grabbing a good typeface, converting it, checking it, saying to myself out-loud “nice” and “wow!”, then deleting the converted font.\n\nUpfront, I only have used FontXChange twice, once for a temporary fix, the other to see how it worked (both deleted). Thought I would use FontXChange for something of my own, have yet to do that.\n\n"
    },
    {
      "time": " 8.Apr.2008 3.26pm",
      "content": "If someone has licensed a font and then cannot get the fix they need from the foundry I have to concede that this sort of software is useful. But, how often does that happen? I’ve never had a foundry tell me they couldn’t fix the problem I found. In addition, any font which has been updated I’ve usually been able to get that update; whether the foundry gave me the update or I licensed the upgrade.\n\n"
    }
  ]
}
