{
  "id": "44002",
  "title": "Is there a normal difference between normal weight and bold?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m looking at one typeface where the bold is 44% thinker in a vertical stroke on an uppercase letter that the same stroke on the regular weight and another where the difference is 5%. At 5% of difference between the bold and regular, it’s hard to tell they are different when they aren’t next to each other.\n\nIs there a _normal_ range of difference between a weight called “regular” and one called “bold”?\n\nthanks.\n\n [‹ RISD vs SVA for graduate program?](http://web.archive.org/web/20080708211657/http:/www.typophile.com/node/44071 \"Go to previous forum topic\") [Which is dis logo...............? ›](http://web.archive.org/web/20080708211657/http:/www.typophile.com/node/44006 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080708211657/http://www.typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": " 7.Apr.2008 7.41pm",
      "content": "Things vary dramatically from one typeface to another. About double the stroke thickness seems to be the average.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 7.Apr.2008 8.25pm",
      "content": "Oops edit, left a tag open. I also described the amount of difference in stroke weights more clearly.\n\nThanks, Thomas.\n\n-=®=-\n\n"
    },
    {
      "time": " 7.Apr.2008 8.55pm",
      "content": "When I checked a number of different seriffed fonts, [Briem’s number](http://web.archive.org/web/20080708211657/http:/briem.ismennt.is/2/2.3.4a/2.3.4.21.exercise2.htm) of “usually between two-fifths and two-thirds heavier” seemed to be on target.\n\n"
    },
    {
      "time": " 8.Apr.2008 6.47am",
      "content": "Thomas — did you misspeak? “Double the stroke” seems more like an upper extreme to me, not the average. I would say that one-and-a-half times the normal is probably closer to average.\n\nBut really, as you say, things vary dramatically.\n\n— K.\n\n"
    },
    {
      "time": " 8.Apr.2008 11.13am",
      "content": " Consider the [Gentium Basic](http://web.archive.org/web/20080708211657/http:/scripts.sil.org/Gentium_basic) font family: the “Book” weight is heavier than the regular, but in no wise as heavy as the “Bold”—and then there’s the “Bold Book” weight too.  \n (Actually, I’ve used the regular bold, scaled down, to get faked small-capitals. The image below doesn’t quite show how well it works; try it yourselves: Gentium Book Basic at 10pt with all-caps Gentium Basic Bold at 7.4pt for small-caps—though the tracking may have to be played with for best effect.)  \n—Joel\n\n ![](http://web.archive.org/web/20080708211657im_/http:/www.typophile.com/files/gentium%20fake%20small-caps_6614.GIF)\n\n"
    },
    {
      "time": " 8.Apr.2008 12.38pm",
      "content": "Joel, your constructed small caps are a bit heavier than would be done normally in a type design; the idea is for the small cap stem to closely match the lower case stem in weight. Where you could work from a ’semibold’ your procedure would probably match better.\n\nIn Slimbach’s seriffed faces generally have both a ’semi-bold’ at the lower end of Briem’s range, and a ’Bold’ at the upper end. For example, Minion semibold is 36% larger than the regular, and the bold is 58% larger.\n\n"
    },
    {
      "time": " 9.Apr.2008 5.43pm",
      "content": " I know it looks too heavy in the image I posted, but give it a try and look at the print-out. I’ll post a scan tomorrow to compare.  \nETA: I tried it at a bunch of text sizes and can’t actually get it to look right. Oh, well. According to [http://scripts.sil.org/Gentium\\_status](http://web.archive.org/web/20080708211657/http:/scripts.sil.org/Gentium_status), true small-caps are in the pipeline, so I’ll wait a while longer.  \n—Joel\n\n"
    },
    {
      "time": " 10.Apr.2008 6.47pm",
      "content": "For an example of bold that isn’t bold enough, check out Tim Rolands’ Envoy at MyFonts...that’s my cautionary example for all type designers. If you can’t tell weights apart at 8pt at the merest glance, you need to re-draft, as Rolands certainly should.\n\n"
    },
    {
      "time": " 13.Apr.2008 1.30am",
      "content": "I got the “double” idea from Karow’s book “Typeface Statistics.” But when a stat contradicts your prior knowledge, it’s a good idea to look at it carefully. On further thought, I realize that this book looked at average stroke thickness for “regular” fonts and for “bold” fonts, but:\n\n- those were not necessarily “bold” fonts that were style-linked to any regular (and vice versa)\n\n- sometimes a “regular” is style-linked to a “semibold” instead.\n\n- And who knows how many wacky display faces were in that sample?\n\nAnyway, Briem’s advice seems fairly sound (as it usually is), for a bold that it style linked to a regular.\n\nCheers,\n\nT\n\n"
    }
  ]
}
