{
  "id": "44006",
  "title": "Which is dis logo...............?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Anyone know wht is this logo...it is just like embossing work. may i get solid colors clipart work ........or anything more information about it\n\n ![](http://web.archive.org/web/20131019231500im_/http:/typophile.com/files/858-4078CHA_5416.jpg)\n\n",
  "author": "artslons",
  "time": "7 Apr 2008 — 10:58pm",
  "uid": "27176",
  "comments": [
    {
      "time": "7 Apr 2008 — 11:10pm",
      "content": "Technically this is actually a coat of arms. I myself am not familiar with this one. Where did you get this image?\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:13pm",
      "content": "Not exactly a logo, it's a seal/coat of arms. It seems to consist of at least four themes, which could represent families or cities.  \nI'm no expert on heraldry, so can't really help you there.  \nWhere is it from? Country of origin might help those who know more.\n\n[edit] Ah, Miss T. got there before me!\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:22pm",
      "content": "Well i got this to make vector art from my customer...........and bad news is that nothing else information or image i m getting from him or else. so looking for help from u guys.....\n\n"
    },
    {
      "time": "7 Apr 2008 — 11:30pm",
      "content": "This is probably a specific families coat of arms. If you knew where the photo was taken that would be a good clue. It might also be good to know if it is your client's family's coat of arms. If it is a families coat of arms chances are that you are going to have to draw it. You'd save time by just re-drawing it yourself.\n\n"
    },
    {
      "time": "8 Apr 2008 — 12:01am",
      "content": "[http://www.t26.com/fonts/Heraldry](http://web.archive.org/web/20131019231500/http:/www.t26.com/fonts/Heraldry \"http://www.t26.com/fonts/Heraldry\")\n\nIt's cheap. Buy it.\n\n"
    },
    {
      "time": "8 Apr 2008 — 12:42am",
      "content": "Probably an ornamental fence, gate and alike. See, for example, the brown paint/spray.\n\n"
    },
    {
      "time": "8 Apr 2008 — 1:10am",
      "content": "The picture is an ornamental keystone. It marks the apax at the crown of a vault or arch (I don't dare to say which). A keystone locks the other pieces of a vault or arch into position.\n\nThis is one coat of arms (one family). The shield is made out of two 'important' families (the red and white) because of a marriage between the two (red and white) creating one family thus one shield (one coat of arms).\n\nIf the vector art is going to be in black and white there are rules how to represent the colors (the color silver is a doted pattern etc.). You can look it up in a book or ask your local genealogy society (you can ask your local city/village museum if there are any or at city hall).\n\nThe helm and mantling are also significant, but I can't recall why.\n\nBest of luck.\n\n"
    },
    {
      "time": "8 Apr 2008 — 10:24am",
      "content": "There is a great Wikipedia article on ways of identifying and representing tinctures (heraldry colors).  \n [http://en.wikipedia.org/wiki/Tincture\\_%28heraldry%29](http://web.archive.org/web/20131019231500/http:/en.wikipedia.org/wiki/Tincture_%28heraldry%29 \"http://en.wikipedia.org/wiki/Tincture\\_%28heraldry%29\")\n\nWe might be of a bit more help if you mentioned the country of origin.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131019231500/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "11 Apr 2008 — 8:07am",
      "content": "Hi friends  \n i have made this logo vectorised. I want to know your comments on this. Attached image of the vextorised file...... If you thimk is there any suggestion pls let me know..........\n\n ![](http://web.archive.org/web/20131019231500im_/http:/typophile.com/files/858_4078CHA_6454.jpg)\n\n"
    },
    {
      "time": "11 Apr 2008 — 6:08pm",
      "content": "I think It's an italian coat of arms. It's also related to Venice. That lion at the bottom is the protector of the city.\n\n"
    },
    {
      "time": "11 Apr 2008 — 8:31pm",
      "content": "Lion is associated with Saint Mark, that's the Venice connection. But something tells me that's not the only association.\n\nThat lion needs some work. I just watched the South Park episode with Mr. Garrison and the mouse and the genetic experiment escape. I'm having flashbacks.\n\n"
    },
    {
      "time": "12 Apr 2008 — 11:31am",
      "content": "The helm needs more detail, it's getting lost in the mantling.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131019231500/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    }
  ]
}
