{
  "id": "44015",
  "title": "Help needed. Picking fonts for Spa magazine",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all,\n\nnewbie here.\n\nI have been asked to do a rapid redesign on a UK Spa magazine. The main thing I want to get right is the fonts. The images used will be mainly from PR’s so to make it stand out from the rest of these magazines, I need to consider my type very carefully.\n\nI was wondering if anyone had any suggestions for headline & body fonts. I’m open to try both Serif and Sans Serif for both (more than likely use 2 header fonts throughout if they compliment each other).\n\nI’ve been drawn to Adobe Caslon and Arno so far (body), but any other suggestions would be most welcome.\n\nThe client really liked Avant Garde as a header, but I’m aware that its been everywhere recently so would like to come up with an alternative.\n\nThe magazine is aimed at (and I quote): “Yummy mummy’s, high end consumers, Harrods shopper, general managers and spa directors”. I think this translates as they want a sophisticated, luxurious feel. That’s my aim when choosing fonts.\n\nThanks in advance\n\n [‹ InDesign CS3 styles](http://web.archive.org/web/20080720062350/http:/www.typophile.com/node/43972 \"Go to previous forum topic\") [Bring out your ligatures. ›](http://web.archive.org/web/20080720062350/http:/www.typophile.com/node/43879 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080720062350/http://www.typophile.com/user/29303\" title=\"View user profile.\">Gav_B</a>",
  "time": "<br>",
  "uid": "29303",
  "comments": [
    {
      "time": " 8.Apr.2008 5.23am",
      "content": "See the new [Rising Stars newsletter](http://web.archive.org/web/20080720062350/http:/www.myfonts.com/newsletters/rs/200804.html) I think the brandnew Museo from Jos Buivenga, Bree from typetogether and Haptic from Henning Skibbe could fit your needs.\n\n"
    },
    {
      "time": " 8.Apr.2008 5.45am",
      "content": "Thanks for putting me on to the Renko, I’m particularly interested in Museo, I’ll give it a try. I haven’t got a massive budget so would struggle to justify anything excessive. I do have a lot of fonts available to me though, just not uploaded on my system, so I’m looking for recommendations first to see if I already have them, before uploading any.\n\nAny other suggestions appreciated.\n\nG\\*\n\n"
    }
  ]
}
