{
  "id": "4403",
  "title": "Workhorse Serif Suggestions",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm interested in your opinions/recommendations for complete, hard-working serif 'faces. I've been using Mrs. Eaves too much these days. I've been looking at Walbaum from Storm. Doesn't seem to be a huge family, but the characters seem really solid, pure, straightforward. Your thoughts?\\</font\\>\n\n",
  "author": "dylan",
  "time": "21 Apr 2004 — 6:50pm",
  "uid": "1022",
  "comments": [
    {
      "time": "21 Apr 2004 — 9:04pm",
      "content": "Adobe Jenson is good.\n\n"
    },
    {
      "time": "21 Apr 2004 — 9:48pm",
      "content": "If you like Walbaums, check out Kepler. But if you really want purity and honesty, try a wedge serif, like Swift, or Foundry Form Serif, or FF Zine.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Apr 2004 — 3:14am",
      "content": "Good stuff all around. Swift is my second favorite. Thanks, Chris and Hrant. I see that Gerard pairs Vesta with his Swift. What sans face would you pair with Storm's Walbaum?\n\n"
    },
    {
      "time": "22 Apr 2004 — 10:36am",
      "content": "Good lord, I must be addicted to type... I can't decide. Stephen: Verdigris is lovely. I can understand why you're enjoying it, at least as a voyeur. I was slobbering over the Storm release Andulka this morning, but it's... too sharp/angular if that makes any sense. Maybe the softness of Walbaum is what appeals to me. And then Verdigris enters, stage left.   \n   \nGeesh, I feel like a flake.   \n   \nDecisions, decisions... Thanks for the input. I'm open for more feedback, opinion, and typographic crack rocks.\n\n"
    },
    {
      "time": "22 Apr 2004 — 10:47am",
      "content": "If you like Walbaum, take a look at [FF Acanthus Text](http://web.archive.org/web/20131018075036/http:/www.myfonts.com/fonts/fontfont/ff-acanthus-copy/) by Kobayashi too.\n\n"
    },
    {
      "time": "22 Apr 2004 — 11:09am",
      "content": "Check out [FF Atma](http://web.archive.org/web/20131018075036/http:/www.myfonts.com/fonts/fontfont/atma-serif/), too. It has a feel similar to Walbaum Text. I saw this in an Ansel Adams book -- really nice.\n\n"
    },
    {
      "time": "22 Apr 2004 — 11:10am",
      "content": "How about using FF Seria which I tend to use a lot; Clarendon is making the rounds again as a solid cut, maybe a tad heavy; or perhaps a look at Fournier from Monotype. Coranto is very nice and is being used by ID magazine at the moment to good effect.\n\n"
    },
    {
      "time": "22 Apr 2004 — 11:23am",
      "content": "Storm Walbaum is very solid in text.   \n   \nHowever, I doubt you will find it a good \\*alternative\\* to Mrs. Eaves. It doesn't look obviously contemporary in the way that the Mrs does. If you're looking for fresh, Hrant's suggestions may be better. STF Walbaum is a workhorse, but very mild mannered. I imagine Verdigris is similarly mild, yes?   \n   \nUnderware's Dolly?   \n [This](http://web.archive.org/web/20131018075036/http:/www.stormtype.com/andulka.html) is interesting.   \nDefinitly funky STF Lexon & Lexon Gothic.   \n   \nAs far as pairing it with a sans, here are some classics:   \n ![](http://web.archive.org/web/20131018075036im_/http:/www.typophile.com/forums/messages/4100/34079.gif)   \nHow about Shinntype Brown Gothic? (Maybe the best!)   \nSTF Dyna Grotesk   \nSTF John Sans\n\n"
    },
    {
      "time": "22 Apr 2004 — 11:26am",
      "content": "A great alternative to Mrs Eaves is TheFoundry's Wilson.   \n   \nBTW, of those pairings I like the Univers and the Scala.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Apr 2004 — 11:29am",
      "content": "Fuel on the fire eh? He he he.   \nJust thought of FF Eureka   \nIt has a similar Mrs. Eavesian freshness in text.\n\n"
    },
    {
      "time": "22 Apr 2004 — 4:23pm",
      "content": "Does anyone know how I can get a decent PDF of Verdigris samples? I can't find any contact info at the MVB site. Frustrating. Again, thank you for feeding my addiction. I'm stacking up my final contenders as we 'speak' (and I'd really like to get a better view of Verdigris).\n\n"
    },
    {
      "time": "22 Apr 2004 — 4:42pm",
      "content": "Oh, I'm also looking at Kent's Whitman family. Very complete. Really digging the serifs. What's a boy t' do?\n\n"
    },
    {
      "time": "22 Apr 2004 — 7:10pm",
      "content": "Thanks, Stephen.\n\n"
    },
    {
      "time": "22 Apr 2004 — 8:35pm",
      "content": "Oooh...Walbaum looks good with Univers Condensed.\n\n"
    },
    {
      "time": "22 Apr 2004 — 10:02pm",
      "content": "\"Mark's a good guy. I'm sure he'll hook you up with a PDF.\"   \n   \nyou should ask about the fantastic booklet he produced. I haven't found the right client yet, but I keep the specimen close by as a reminder. it'd make a nice birthday gift to myself...\n\n"
    },
    {
      "time": "23 Apr 2004 — 5:38am",
      "content": "Dylan --   \n   \nThanks for your private message asking about a sans complement for Whitman. I'm pleased that you're considering it. I thought I'd reply on the forum, since I get this question frequently.   \n   \nPairing sans and serif is, I think, one of the most basic ways to create a sense of typographic style; and as such, it can be very much a matter of personal taste. So, don't take anything I say about this with any more weight than anyone else just because I designed Whitman.   \n   \nNevertheless, here are some pairings that I've seen or tried myself:   \n   \nWill Powers paired Whitman with Franklin Gothic Condensed in a book he did for MnHS Press. In general, I think anything along these lines -- Franklin Gothic, FB's Benton Gothic/Sans, Nick Shinn's Brown Gothic -- makes a solid companion.   \n   \nIn my own work, I've paired Whitman with Vectora -- one of my favorite sans. It's a tricky combo if you mix them in line, since the x-heights are vastly different. But I like the forms together.   \n   \nI'm working on a how-to book right now for which I'm using Whitman paired with Gotham. I rather like it. I've also seen this combo used pretty well in a small startup magazine called _Revenue._   \n   \n_The Virginia Quarterly Review_ pairs Whitman with Bliss to great success.   \n   \nA more unusual combo is Whitman with Cyrus Highsmith's Relay, used by a Finnish young women's style magazine, _Trendi_.   \n   \nI've also wanted to try pairing Whitman with FF Kievit. I think the neutrality of both would make a nice combination where transparency is desired. But I haven't found the right opportunity yet.   \n   \n ![Whitman Pairings](http://web.archive.org/web/20131018075036im_/http:/www.typophile.com/forums/messages/4100/34154.gif)   \n   \nHTH   \n   \n-- K.\n\n"
    },
    {
      "time": "23 Apr 2004 — 6:41am",
      "content": "Well, I'm working backwards. I've just picked up Gotham Complete. Kent, thanks for being my pimp.   \n   \n- Fadeproof the Font Ho\n\n"
    },
    {
      "time": "23 Apr 2004 — 7:48am",
      "content": "I've decided on a marriage of Whitman and Gotham, everyone. Kent's PDF (his own, not the one on Font Bureau's site) did a lot to convince me that Whitman was the 'face I wanted. And his suggestion of Gotham was a one-two punch. Both of these fine 'faces \"feel\" like me. Their shapes and details are what I'm looking for. A sincere thank you **everyone** for your prompt, honest input. Y'all ROCK.   \n   \nCheers,   \n   \nDylan\n\n"
    },
    {
      "time": "23 Apr 2004 — 1:57pm",
      "content": "Dylan --   \n   \nNaturally, I'm pleased with your choice. I hope Whitman behaves well and performs to your expectations.   \n   \nIncidentally, if you are still working in Quark, I have customized suitcases that I'd be happy to give you. They are modified to allow Quark to do its auto fi- and fl-lig substitution. They are also combined into two suitcases -- one for LF and the other for OsF -- and are style-linked for Bold and Italic.   \n   \nLet me know and I'll send you copies.   \n   \n(That's one downside of the FB model which allows you to purchase individual styles and weights -- it means that you get delivered all these individual suitcases. As opposed to the very nicely combined and linked families from HTF, for instance.)   \n   \nIf you're working in InDesign, then it's moot -- Indy will do f-lig subs anyway (but not the ff-ligs, because they're nonstandard FB encoding). And style-linking is screwed in Indy. It's a known bug. I don't know if they fixed it for CS. (Thomas?)   \n   \n-- K.\n\n"
    },
    {
      "time": "23 Apr 2004 — 2:08pm",
      "content": "I'm an InDesign convert. Don't care if I ever open Quark again.   \n   \nThis style-linking issue - I'm not aware of it, but I'm curious. Any links to more info would be great, if you have time.   \n   \nSo, I've got my new type. Gonna be a nice weekend... (smiles, cracks beer)\n\n"
    },
    {
      "time": "23 Apr 2004 — 2:33pm",
      "content": "It's a little better in CS. We hope to fix it completely in the future.   \n   \nT\n\n"
    },
    {
      "time": "23 Apr 2004 — 7:20pm",
      "content": "FF Acanthus is a good suggestion: one of the undeservedly overlooked and underused typefaces.   \n   \nPersonally, for a work horse typeface I would go for a Dutch oldstyle, not a German romantic like Walbaum. Fred Smeijer's [Arnhem](http://web.archive.org/web/20131018075036/http:/www.ourtype.com/) is one of my current favourites, and seems less pricey than many of the recent Dutch fonts.\n\n"
    },
    {
      "time": "24 Apr 2004 — 5:38am",
      "content": "_\\>This style-linking issue - I'm not aware of it, but I'm curious._   \n   \nIn Indy, you can only style type italic or bold (i.e., from the keyboard) when there is an actual designed version. This is, in general, a good thing -- no faked obliques or smeared bolds.   \n   \nBut the bug is that with nonstandard family structures, Indy makes some weird decisions. So, for instance, with Whitman, if you're working with text in RomanOsF and then style a word to italic, Indy will make it ItalicLF. Then if you unstyle it by repeating the italic command, you'll get RomanLF. Or, under certain circumstances, you'll go back to SmallCapsLF. This sort of thing.   \n   \nI seem to remember that which fonts change to which varies depending upon how you have your fonts loaded (font management vs. system vs. Adobe app folders). Mark Record (FB tech guy) and I spent a bit of time trying to troubleshoot this until we finally realized it was a bug that we couldn't do anything about.   \n   \nAnd it's not just Whitman. I experienced the same problem with Frutiger (from Adobe). IIRC, Frutiger 45 (Light) went to 56 (Italic), then back to 55 (Roman) -- or something similar.   \n   \nBottom-line: the style-linking is screwy. Which is a pain for someone who does a lot of formatting from the keyboard or with tagged text.   \n   \nThomas, glad to hear it's better in CS. I'll have to upgrade one of these days (just too lazy) and try it out.   \n   \n-- K.\n\n"
    },
    {
      "time": "24 Apr 2004 — 5:44am",
      "content": "Cool. Thanks, Kent and Thomas for weighing in on this. I need to upgrade to CS also, now that most of the local print shops are using it.\n\n"
    },
    {
      "time": "24 Apr 2004 — 7:46am",
      "content": "Well, it's a \\*little\\* better in InDesign CS. Needs a complete fix in some future version. I would not buy CS expecting or even really hoping that one's particular case of this is fixed.   \n   \n ![:-(](http://web.archive.org/web/20131018075036im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nT\n\n"
    },
    {
      "time": "24 Apr 2004 — 7:49am",
      "content": "Kent:   \nYou should just add duplicates of the ff ligs in your fonts, named as InD expects, i.e. \"ff\", \"ffi\", and \"ffl\". I'm pretty sure InD will use them then. I don't think they have to be encoded, and you can leave the ligs in the FB positions as well for the unconverted Quarkers.\n\n"
    },
    {
      "time": "24 Apr 2004 — 8:45am",
      "content": "Yes, John, Thomas has told me about this. The downside is that there won't be any kerning for these ligs (which would really only affect the ff-lig, actually).   \n   \nThis would really come down to FB, and I don't see them taking the time to do this. Better to lobby for a full OT version.   \n   \nBut thanks for the suggestion.   \n   \n-- K.\n\n"
    },
    {
      "time": "24 Apr 2004 — 9:30am",
      "content": "The OT reference reminded me of something -- I was really surprised to receive archives that were not OS X compatible when I downloaded both Gotham and Whitman. I wiped system 9 from my main machine about a year ago. Having options for both OS 9 and X would be a nice touch. I'll be sure to forward the idea to both Font Bureau and Hoefler.\n\n"
    },
    {
      "time": "24 Apr 2004 — 11:57am",
      "content": "They were .sea files, stuffed for OS 9. Fortunately, I was at my day job so Classic kicked in and did the unstuffing. Just seemed odd to me that FB and Hoefler are holding back on X compatible archives. I was also surprised (just a little, anyway) that neither 'face is in Open Type. Believe me, I'm not complaining. Just being a picky geek, I s'pose.   \n   \n ![:-)](http://web.archive.org/web/20131018075036im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 Apr 2004 — 2:49pm",
      "content": "Bling Bling Bling Bling Bling. You just got a 5 star vote for that hot tip. Thanks, Stephen!\n\n"
    },
    {
      "time": "22 Apr 2004 — 10:15am",
      "content": "I've really been enjoying MVB Verdigris.\n\n"
    },
    {
      "time": "22 Apr 2004 — 7:00pm",
      "content": "[MVB contact info](http://web.archive.org/web/20131018075036/http:/www.mvbfonts.com/html/info/contents/terms_of_use.htm#privacy)   \n   \nMark's a good guy. I'm sure he'll hook you up with a PDF.\n\n"
    },
    {
      "time": "24 Apr 2004 — 9:43am",
      "content": "That's odd, Dylan. What format were they in?\n\n"
    },
    {
      "time": "24 Apr 2004 — 2:19pm",
      "content": "In my experience you can drop an .sea file onto Stuffit Expander   \nin OSX and it will unstuff.\n\n"
    },
    {
      "time": "25 Apr 2004 — 1:32pm",
      "content": "Haha. Sweet of you. Glad it worked. It doesn't excuse HTF and FB   \nfrom not providing more thorough instructions though.\n\n"
    }
  ]
}
