{
  "id": "44056",
  "title": "Which font would you use for a Book/PhD thesis within science",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI have alreday asked this question in a \"dead\" forum (which wasn't entirely related with this topic), so I decided to repost it.\n\nSo, I am bout to finnish my thesis within physical chemistry that contains a couple of mathematical equations with greek characters in them. Everyone uses times new roman and i' trying to stay out of that as far as possible. So far I just have minion in my mind...maybe together with myriad.\n\nAnd as a general question, which font would you pick for a informal science newsletter/book?\n\nThanks,  \nvasco\n\n",
  "author": "vascoprt",
  "time": "9 Apr 2008 — 5:57am",
  "uid": "29160",
  "comments": [
    {
      "time": "9 Apr 2008 — 6:25am",
      "content": "Yep, Minion's good. You could try Stone (serif for the body text, sans for the headings, tables etc.)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "9 Apr 2008 — 7:49am",
      "content": "I use Minion for almost all of my academic work (with Myriad for footnotes). I've also used Hoefler with Gill Sans Light for footnotes to great effect.\n\n"
    },
    {
      "time": "9 Apr 2008 — 12:35pm",
      "content": "Congrats in finishing your thesis.\n\nSome universities dictate what fonts/sizes are acceptable (and will summarily reject others), so be sure your institution doesn't have specific rules already. (Went through this with mine -- our faculty could do what it wanted, but everyone else governed by the Faculty of Grad Studies had to use Courier. Go figure.)\n\nMinion/Myriad, Stone Serif/Sans, and Hoefler/GSL would all make fine match-ups, and would add Centaur and Helvetica as well -- I've seen a number of academic/science papers set with that combo that were quite fetching.\n\n"
    },
    {
      "time": "13 Apr 2008 — 3:13pm",
      "content": "I might try Gentium, as well, if you're a starving student and don't need bold/bold italic for your Greek.\n\n"
    }
  ]
}
