{
  "id": "44060",
  "title": "Most Distinguished Serif Font",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What ideas come to mind. Very distinguished looking...in caps and lowercase.\n\n",
  "author": "serge4",
  "time": "9 Apr 2008 — 9:14am",
  "uid": "15224",
  "comments": [
    {
      "time": "9 Apr 2008 — 10:06am",
      "content": "How about our Featured Face, Moderno?\n\n"
    },
    {
      "time": "9 Apr 2008 — 10:31am",
      "content": "Baskerville, not too Modern and not too Old Style.\n\n"
    },
    {
      "time": "10 Apr 2008 — 6:39pm",
      "content": "Many would say that Linotype Sabon with oldstyle figures is the closest to perfect among serif text faces. Hands down the finest for book texts.\n\nSome runners up: Plantin Light at 11pt or above, also with oldstyle figures...I chose this for a series of poetry books I'm doing and I've fallen in love with it all over again. Requiem would be up there too if only the foundry added bold and bold italic, although I still think that italic wandered in from another family. Arno Pro italics match up better, but Arno lacks Requiem's superior details, such as the oldstyle figure for five. And I'm increasingly impressed with Adobe's Warnock, something of a dark horse on the type market. If you're choosing by point size, the best serif text family at 9pt is Stone Serif...horsey if it gets much larger, but at 9pt, simply peerless, and the three italics look even better than the romans. The finest Baskerville is certainly ITC New Baskerville, which works well everywhere. If you like your letterforms a little condensed, then Esta is right up there with Minion. If you choose by personality, and want something warm and intimate, Ludwig Übele's new Marat family is very appealing indeed. If it ever bothered you that Fournier never got bold and bold italics, you can switch to Josh Darden's Corundum instead, a real instant classic. And I would issue a shout-out for Haarlemmer, a little-known but really beautiful family with much the same appeal as Sabon; Storm's Regent II; and FF Scala, especially good in books, right up there with Janson Text.\n\nDon't get me started !!\n\n"
    },
    {
      "time": "10 Apr 2008 — 7:27pm",
      "content": "So what's the difference between Regent and Regent II?\n\n"
    },
    {
      "time": "10 Apr 2008 — 8:35pm",
      "content": "Galliard\n\n"
    },
    {
      "time": "11 Apr 2008 — 6:29am",
      "content": "\"Most Distinguished Serif Font. Very distinguished looking...\"\n\nFor a hat? A cat? A bar of chocolate?  \nA chat? A newspaper in North Platte?  \nA book that's fat? A magazine that's actually a rat?  \nA baseball bat? Or a menu in Katmandu?\n\ni think the fact there is more than one distinguished serif font in the world indicates that more information would help.\n\nCheers!\n\n"
    },
    {
      "time": "11 Apr 2008 — 7:33am",
      "content": "\"So what’s the difference between Regent and Regent II?\"\n\nI'm guessing number one wound up in Frankie Storm's waste basket, because his foundry does not offer it...plenty of examples there of reworkings, Pentagramme vs Pentagraf for instance...but whatever FS changed was for the better, because Regent II is a real classic for its look...keystroke-linked and affordable, God bless 'em.\n\n"
    },
    {
      "time": "11 Apr 2008 — 8:12am",
      "content": "David, I don't believe there are any distinguished newspapers in North Platte . . .\n\n"
    },
    {
      "time": "11 Apr 2008 — 9:44am",
      "content": "<cite>I’m guessing number one wound up in Frankie Storm’s waste basket, because his foundry does not offer it...plenty of examples there of reworkings, Pentagramme vs Pentagraf for instance...but whatever FS changed was for the better, because Regent II is a real classic for its look...keystroke-linked and affordable, God bless ’em.</cite>\n\nNo, I have a <cite>Regent Pro</cite> that is part of the library. It is OpenType and looks identical on screen. Tyfa is another that got a makeover for ITC release, but I'm really still evaluating many of the faces and was interested to know if the one I have has any know deficiencies.\n\n"
    }
  ]
}
