{
  "id": "44068",
  "title": "textedit & Indesign",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is their a way to import text with formatting (such as bold and Italic) from textedit into indesign?  \nor do you have recommendations on the best way to receive formatted text from a client?  \nthank you\n\n",
  "author": "PL",
  "time": "9 Apr 2008 — 10:52am",
  "uid": "11199",
  "comments": [
    {
      "time": "9 Apr 2008 — 11:23am",
      "content": "What format is the file you open in TextEdit?\n\nIf it’s something like RTF, you can simply place the .rtf file into an InDesign document. It will preserve (as well as it can) formatting.\n\n"
    },
    {
      "time": "9 Apr 2008 — 11:25am",
      "content": "Hi Psachyah,\n\nyes, you can save your file as a Word Document (.doc) in TextEdit. That should do the trick.  \nMake sure to check the import options when placing your text in InDesign (‘keep formatting’ etc).  \nF\n\n"
    },
    {
      "time": "9 Apr 2008 — 1:16pm",
      "content": "Is their a way to have it create style sheets based on the imported formatting?\n\n"
    },
    {
      "time": "9 Apr 2008 — 2:26pm",
      "content": "Yes, via scripts.  \nCheck out [Peter Kahrel’s CharStyle](http://web.archive.org/web/20150227021557/http:/www.hilfdirselbst.ch/foren/Mapping_mit_CS3_%28Win%29_P339435.html#339435), [Dave Saunders’ PreserveLocalFormatting.jsx](http://web.archive.org/web/20150227021557/http:/indesignsecrets.com/plug-ins-and-scripts/) or something similar.\n\n<cite>Preserve Local Formatting: Dave Saunders wrote this cross-platform Javascript that can run through a selection of text (or the whole document, if nothing is selected) and replace locally-formatted bolds and italics (among others) with equivalent Character styles. The script adds the styles to the Character Styles palettes on its own,no need to create them yourself. Works in CS1 (change extension to .js), CS2, and CS3.</cite> — [InDesign Secrets.com](http://web.archive.org/web/20150227021557/http:/indesignsecrets.com/)\n\n"
    }
  ]
}
