{
  "id": "44086",
  "title": "Opinions on tombstone font and/or design?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Perhaps this is the wrong forum, but it's a follow up to [this thread about designing my father's gravestone](http://web.archive.org/web/20100327090604/http:/typophile.com/node/39537) that was originally in general discussion. The urgency of a font selection froze along with the earth, so I've been able to obsess far too long on this decision. I need fresh eyes.\n\nDue to family vetoes, these are the only two approved typefaces; Aichel or Neutra Text. Opinions? Kerning issues? Aghast for any reason? Feedback of any kind is welcome. It would be great to hear from an actual stonecarver, if there's one here. The stone itself is a mock-up, but it is nearly identical to the gravestone my mother chose.\n\nThanks,  \n Eileen\n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/Burke-gravestone-NEUTRA-550px_5736.jpg)\n  \n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/Burke-gravestone-AICHEL-550px_4513.jpg)\n\n",
  "author": "<a href=\"/web/20100327090604/http://typophile.com/user/21709\" title=\"View user profile.\">EileenB</a>",
  "time": "<br>",
  "uid": "21709",
  "comments": [
    {
      "time": "",
      "content": "The Neutra version needs lining figures.\n\n"
    },
    {
      "time": "",
      "content": "Yeah? I have a weakness for old style figures, but I'd really like to hear the reason you think lining figures are more appropriate.\n\n"
    },
    {
      "time": "",
      "content": "Because the letters are going to be sand blasted rather than carved I think the Neutra is better. It matches the method/spirit of production better. I might look at a wider spacing to make it more monumental is spirit. That would also let you have a wider space between Francis & Mary which would look more relaxed and be slightly clearer. Also moving the cross over to the left a bit more would put the emphasis on the name which is to be fair the right emphasis. And a good clear hierarchy is also more relaxing/comfortable.\n\n"
    },
    {
      "time": "",
      "content": "What Eileen said. Especially in an uber-modern face like Neutra!\n\n"
    },
    {
      "time": "",
      "content": "By the way, Nick, Oneleigh was on my short list. It's just gorgeous.\n\n"
    },
    {
      "time": "",
      "content": "I like the serif-version better, i think it works better with the traditional form and material of the gravestone. Is the cross there a glyph of this font? This disturbes me somehow. And in Germany you would use a dash instead of a hyphen to connect your numbers.\n\n"
    },
    {
      "time": "",
      "content": "poms - I agree, the cross isn't quite right to my eye, either. I keep tweaking it. It started as a glyph from Aichel, but the stem is added on. I think it needs more work.\n\nEben - you're right. I knew the layout was off somehow but I couldn't pinpoint what it was exactly. Is this getting better?\n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/Burke-gravestone-Neutra-2_5694.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Oh, and thanks, poms. I fixed the hyphens. Duh.\n\n"
    },
    {
      "time": "",
      "content": "What Eben said.  \nA detail: I find the dashes too short. To indicate a range, better use a three-to-em dash (or an en-dash at least), not a hyphen. [edit: too late. ;-)]\n\n"
    },
    {
      "time": "",
      "content": "Yes. It feels like the stone is owned by the type now not the other way around.\n\nGlad to be of service. :-)\n\n"
    },
    {
      "time": "",
      "content": "Do you think that \"content\" cants to the right side a little bit also? Even in the last layout?\n\n"
    },
    {
      "time": "",
      "content": "I would echo Florian — of all the possible dashes & hyphens, the one that belongs in the middle of a range (this year to that year) is an en-dash, with half spaces to a full space before and after. I'm not sure if you're in the States, but that's the convention here.\n\nI personally prefer the Neutra, with perhaps more tracking on the first names.\n\nIt looks like, when the time comes, 4 digits for a death year won't fit under Mary E and still align right — not sure if you want to adjust for that.\n\n"
    },
    {
      "time": "",
      "content": "I like it in Neutraface, but I would use lining figures because that’s how people are used to seeing that style of numbering when they’re used in architecture. Old-style geometric numbers on stone just feel off.\n\nI think the cross would work better if it were shorter. Try leaving the top where it is and terminating the bottom at the baseline of the names. It might also be nice if it were al little taller.\n\n"
    },
    {
      "time": "",
      "content": "Like I said, the hyphens are fixed. They're en-dashes now. It was just a goofy 3am mistake. /end hyphen debate\n\nYes, I've been concerned about adding my mom's death year and having it be too long to align properly, so I've told her she can't die in a fat-numbered year. I've tweaked that block of text a million times, testing dates, but the problem is that _it just looks awkward_ with her short name and the empty death year space, no matter what I do.\n\nJames, you confuse me. You say shorten the cross ... but then you add _it might also be nice if it were a little taller?_ Huh?\n\npoms - it looks like it cants to the right because of the background photo, which the stone carver will never see. It's just there for reference.\n\n"
    },
    {
      "time": "",
      "content": "Sorry Eileen, I meant to say if it were a little farther up in the corner. My thesis is eating my brain and I can’t think straight lately.\n\n"
    },
    {
      "time": "",
      "content": "Based on the simple shape of the stone I like how still the Neutraface looks. I would break the space up methodically and be more specific with the sizes and placement, maybe using Villard’s diagram to set baselines and points of intersection.\n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/Burke_6080.jpg)\n\n"
    },
    {
      "time": "",
      "content": "why not center & stack the dates?\n\n"
    },
    {
      "time": "",
      "content": "I like the idea, whether intended or not, that they might be together, side by side in death, just as they were in life.\n\n"
    },
    {
      "time": "",
      "content": "I must be missing something.\n\nWhen, hopefully never, Mary E dies, the text setting indicates (at least to me) when completed, is intended to be justified? You must be planning a smaller point size, or condensed version for figures noting her final passing date? Novel idea but old school advises against that.\n\nTwo cents.\n\nGiampa\n\n"
    },
    {
      "time": "",
      "content": "Go with the sans design. On a recent trip through Sicily there were lots of \"modern\" looking grave markers.\n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/PalermoGrave_4406.jpg)\n\n"
    },
    {
      "time": "",
      "content": "terminaldesign  \n\"Go with the sans design. On a recent trip through Sicily there were lots of “modern” looking grave markers.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\"Modern\", there is nothing modern about \"sans\".\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nA suggestion for the second date of \"grief\".\n\nTypeset an arbitrary date for your mother's departure, \"right, ragged left\". This will counter balance your father's day of grief of \"left, ragged right\".\n\nNaturally don't forget to remove the arbitrary date and make sure you have pin pointed the location for the year of your mother's birth.\n\nFour cents.\n\nGiampa\n\n"
    },
    {
      "time": "",
      "content": "Miss Tiffany: You nailed it. My parents were a team, married 40 years (and 4 months) when dad died, and the gravestone is meant to reflect that. Giving one name top billing could imply otherwise, and that's just not the kind of marriage they had.\n\nGiampa: The date of death under Mary E does pose a problem, but it's not \"intended to be justified\" at all. It's just a short name, and I'm trying to somehow make it fit in the layout. The numbers can't go smaller, so I think I'll need to track out the names.\n\nJupiterboy: I agree the layout needs more precision. I really appreciate to advice to look to Villard's diagram. I'll post more pictures later. You guys are so helpful!\n\nEileen\n\n"
    },
    {
      "time": "",
      "content": "terminaldesign: That's just beautiful. Do you have more pictures? I may talk to my stonecarver about the possibility of doing reversed blocks for the first names and dates. Hmm. I'm off to photoshop! This idea may solve the Mary E balance problem I'm having.\n\n"
    },
    {
      "time": "",
      "content": "One of Pagemaker's tutorials suggests \"turn off tracking\". Tracking victimizes the typeface. Please try my suggestion first.\n\nGiampa\n\n"
    },
    {
      "time": "",
      "content": "I haven't used PageMaker since 1994. I simply meant I would spread out the letters without adjusting the optical kerning.\n\n"
    },
    {
      "time": "",
      "content": "<cite>“Modern”, there is nothing modern about “sans”.</cite>\n\nI'm laughing so much about this that I can't even comment.\n\nEileenB, here is another one, not as Deco as the previous one\n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/Palermo2_5033.jpg)\n\nThis is my favorite, but no type is visible\n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/Palermo3_3544.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Ok, so I've done a lot of adjusting. I think it's on the right track now, but not quite there yet. Obviously the death date for Mary E is just a place holder. Opinions?\n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/Burke-gravestone3_3678.jpg)\n\n"
    },
    {
      "time": "",
      "content": "James\n\n“Modern”, there is nothing modern about “sans”.\n\nI’m laughing so much about this that I can’t even comment.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nAs my grandmother always said. \"He who laughs last, laughs best\" Your homework assignment is \"report on ancient Greek numerals\".\n\nGiampa  \nEducation department\n\n"
    },
    {
      "time": "",
      "content": "_I’d really like to hear the reason you think lining figures are more appropriate._\n\nThere are many reasons, despite which it is still possible to get away with mixing caps and old-style figures.  \nHowever, in this instance, a lot depends on the particular numerals, and it just looks like a bit is missing from the \"one\", followed as it is by three numerals which could quite easily pass for lining figures.\n\nPerhaps raise the dashes a little.\n\n"
    },
    {
      "time": "",
      "content": "\"FRANCIS\" looks tighter than \"MARY\" (because more letters)\n\nCould everything shift a tad higher? Seems to be falling off a bit.\n\n"
    },
    {
      "time": "",
      "content": "It all looks just fine to me except I would position the text a little higher on the stone. It feels like it's being a bit oppressed to me now.\n\n"
    },
    {
      "time": "",
      "content": "James, those photos are wonderful. Thanks for sharing them.\n\n"
    },
    {
      "time": "",
      "content": "James,\n\nI suppose Goudy was right. \"The old guys stole our best ideas\". Or the old maxim, \"Nothing is new under the sun\".\n\n[http://en.wikipedia.org/wiki/Stoichedon](http://web.archive.org/web/20100327090604/http:/en.wikipedia.org/wiki/Stoichedon \"http://en.wikipedia.org/wiki/Stoichedon\")  \n [http://en.wikipedia.org/wiki/Image:EPMA-6794-IGI%283%2948-Sacred\\_law-3.JPG](http://web.archive.org/web/20100327090604/http:/en.wikipedia.org/wiki/Image:EPMA-6794-IGI%283%2948-Sacred_law-3.JPG \"http://en.wikipedia.org/wiki/Image:EPMA-6794-IGI%283%2948-Sacred\\_law-3.JPG\")\n\nI know I am not teaching you anything you don't already know. I am not that comfortable with your concept of \"modern\". Such is the way of skirts. No BD (big deal). Good typography is good typography. Design is something else.\n\nYour pictures are very nice.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThe tombstone seems to be coming along nicely. The comment about moving the setting higher (optical centre) on the stone makes sense. Or, lower.\n\nGiampa\n\n"
    },
    {
      "time": "",
      "content": "I did not think I was proposing a definition of modern. All I did was put modern between quotes.\n\n"
    },
    {
      "time": "",
      "content": "James,\n\nI am glad we cleared that up. Loved the black cat picture.\n\nGiampa\n\n"
    },
    {
      "time": "",
      "content": "So here's the draft I submitted to the carver, and next week I'll receive a full size proof. A proof I'll obsess over before approving, no doubt. What does everyone think? (keep in mind the background photo is just a sample image)\n\n ![](http://web.archive.org/web/20100327090604im_/http:/typophile.com/files/Burke-gravestone-mockup_5370.jpg)\n\n"
    },
    {
      "time": "",
      "content": "It seems good. Actual positioning on the object & scale are the factors that remain for you to check.\n\n"
    }
  ]
}
