{
  "id": "44083",
  "title": "laser printer.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hey, guys.\n\ni’m kinda new to printing en masse. but i had a quick question. i’m about to start a small Zine for my enjoyment. I will probably use newsprint, and i dont need it super-high Rolling Stone quality AT ALL, but my question is this: is it possible for a laser printer to print on newsprint? or would i have to go elsewhere for that? should i just use plain printing paper? or is there another medium like newsprint that i havent come across? i want to keep it as simple as possible, and it just has to be readable. maybe even enjoyable. thanks for your help, guys.  \nJ\n\n [‹ Lo Spirito Moderno](http://web.archive.org/web/20080411063512/http:/typophile.com/node/44007 \"Go to previous forum topic\") [RE: ch & ck in German : please enlighten me! ›](http://web.archive.org/web/20080411063512/http:/typophile.com/node/43911 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080411063512/http://typophile.com/user/29400\" title=\"View user profile.\">dance and jab</a>",
  "time": "<br>",
  "uid": "29400",
  "comments": [
    {
      "time": " 9.Apr.2008 9.09pm",
      "content": "I almost think it would be cheaper to buy a ream of paper from staples than to find 8 1/2 by 11 newsprint. Someone feel free to correct me if I’m wrong. However, I’ve run newsprint through a laser before (b&w at least) with no problems.\n\n"
    },
    {
      "time": " 10.Apr.2008 6.26am",
      "content": "True newspaper paper can’t even go though an offset press, let alone a laserprinter. Alternatives are some heavier stock of recycled paper that can look like news stock. The only way to do small runs is to gently silkscreen on news stock, but ink will seep through the paper to the other side.\n\n"
    },
    {
      "time": " 10.Apr.2008 7.13am",
      "content": "There are ways you could pull this off, but it would be a PITA and rack up nasty repair bills if anything went wrong. Your best bet is to just have a copy-shop print it out on bond.\n\n"
    }
  ]
}
