{
  "id": "44121",
  "title": "Hate on \"smart quotes\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Look at this as a reminder of what you're up against, when fighting the good fight for good design.\n\nThis entertainment site, Quick Stop Entertainment, posted an item looking for some coding help with two \"improvements\" they'd like to make on their site. On the following page, look at item #2 (about 6 paragraphs down)\n\n[Fancy quotes. We hate them.](http://web.archive.org/web/20130824050654/http:/www.quickstopentertainment.com/2008/04/10/think-tank/)\n\nto quote some of the highlights:  \n<cite>Fancy quotes. Whether you call them fancy or smart ... We hate them ... Trouble is, having to do a find and replace all for smart quotes to regular quotes is a pain in the ... We know Wordpress has the ability to “fancy-ize” regular quotes, but how can we get Wordpress to “unfancy-ize” smart quotes? In other words, anytime there’s a smart quote in a post, we want it to automagically change it whenever the post is generated on the site and viewed by you, the lovely public.<br>\n</cite>\n\nUggh. Luckily these guys aren't clients, but if they were - where do you even start?\n\nJason C\n\n",
  "author": "jasonc",
  "time": "10 Apr 2008 — 5:58pm",
  "uid": "9636",
  "comments": [
    {
      "time": "10 Apr 2008 — 6:02pm",
      "content": "Typophile can 'do it' - almost!\n\n"
    },
    {
      "time": "10 Apr 2008 — 6:40pm",
      "content": "<cite>Luckily these guys aren’t clients, but if they were - where do you even start?</cite>\n\nGive them what they want. There are technical reasons why having real quotes in web sites can be a PITA, and things can look like crap when some people are using them and some aren’t. People got by just fine not having access to smart quotes outside of books and magazines for what, a century-plus? It’s a bit much to expect everybody to start caring about them.\n\n"
    },
    {
      "time": "10 Apr 2008 — 7:30pm",
      "content": "These kind of threads are why I lurk here so often!\n\nI can see how copy editors could hate on smart quotes. It's their job to make sure that no \"daggers\" appear on their page -- lest at least one angry letter to the editor about how the quality is plummeting.\n\n"
    },
    {
      "time": "11 Apr 2008 — 4:58am",
      "content": "Gmail does what they want. I'd been using the Alt+0_xxx_ method to enter various symbols under Windows, and Gmail puts nearly everything through as entered—except that I get \"straight quotes\" no matter what I enter. It's reasonable, I suppose, if the rest of the text can be straight-up ASCII, to make this change: some older mail-readers have trouble with non-ASCII symbols. But Google really should leave the curly quotes alone if the rest of the message requires Unicode anyhow…  \n—Joel\n\n"
    },
    {
      "time": "11 Apr 2008 — 6:23am",
      "content": "At the risk of being publicly stoned for saying it--and even knowing how typographically wrong it is--I dislike smart quotes online as well. Perhaps it's less of an aesthetic choice and more of a \"it's what we're used to\" thing.\n\n"
    },
    {
      "time": "11 Apr 2008 — 6:31am",
      "content": "<cite>People got by just fine not having access to smart quotes outside of books and magazines for what, a century-plus? </cite>\n\nNot really. They got by when typewriting letters, since the typewriter only contained prime marks. But typewritten paper was not the bulk of most people's reading. Most of their reading would have been typeset, in books and magazines.\n\nJason C\n\n"
    },
    {
      "time": "11 Apr 2008 — 6:40am",
      "content": "It's funny: if the people at Quick Stop had phrased their request slightly differently, focusing more on the \"for whatever reason, smart quotes screw up something in our system, so we'd rather it stuck to straight ones\", we'd all (I expect) have gone \"shame, but fair enough\". Instead, because they said \"Smart quotes! We hate ’em!\", the typophile's natural response is \"philistines!\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "11 Apr 2008 — 7:52am",
      "content": "\"Typewriter quotes\" are ASCII quotes. \"Smart quotes\" are the raised comma and the turned comma. And by the way, the raised comma is also the apostrophe.\n\nIt does matter when you use the Latin alphabet for some transliterated languages. Look at how Omniglot shows Apache:\n\n[http://www.omniglot.com/writing/apache.htm](http://web.archive.org/web/20130824050654/http:/www.omniglot.com/writing/apache.htm \"http://www.omniglot.com/writing/apache.htm\")\n\nNow in Apache, that ASCII apostrophe should be a raised comma to signal a glottal stop. But not all orthographies use the raised comma for the glottal stop; for whatever reason, Polynesian uses a turned comma for just the same purpose.\n\nThe confusion between ASCII apostrophe & raised & turned commas has let some web sites who fail to notice the distinction to make errors, and some publishers look at sites such as Omniglot to request the ASCII apostrophe to signal a glottal stop in some Native American languages -- which is flat out wrong.\n\nThe typewriter is pretty dead. The ASCII apostrophe & quotes should die with it.\n\n"
    },
    {
      "time": "12 Apr 2008 — 6:56am",
      "content": "Memo to James Puckett and everyone else who reiterates the same half-truth: If smart quotes are borking on your Web site, then what’s borked is your character encoding, not your smart quotes. There are enough Web sites you could Google on this topic to understand it. (Hint: The word “Unicode”&nbsp;is involved.)\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20130824050654/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    }
  ]
}
