{
  "id": "44130",
  "title": "First post. First Font.",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello typophiles!\n\nI've been lurking around the website for a while now, and I finally decided to jump into the pool. I think it's still to early to post a font design (especially since I only made the caps so far), but I can't resist the urge to hear some of your oppinions.\n\nAs stated in the title of the thread, this is my first attempt at creating letters and the design was guided mostly by intuition (and a book). The general, yet vague idea behind the design is creating a functional and somewhat corporate sans (I work in the shady area of B2B design).\n\nSo, what do you think?\n\nAll the best,  \nCristian.\n\n**Updated**\n\n| Attachment | Size |\n| --- | --- |\n| [boldcapsone\\_3.pdf](http://web.archive.org/web/20130819233913/http:/typophile.com/files/boldcapsone_3.pdf) | 18 KB |\n\n",
  "author": "Cristian Loghin",
  "time": "11 Apr 2008 — 6:35am",
  "uid": "29467",
  "comments": [
    {
      "time": "11 Apr 2008 — 6:56am",
      "content": "Nice work. I few things I noticed:\n\n1. The vertical stroke on the G seems too thick\n\n2. The bottom right of the S seems too fat\n\n3. The curve on the top of the B, P and R seems a little off somehow. Maybe it's angling downward too soon?\n\nJonathan\n\n"
    },
    {
      "time": "11 Apr 2008 — 9:50am",
      "content": "I would say the \"W\" has a strange contrast.  \nI would thicken the 3rd stroke of \"W\".  \nW contrast = 1st stroke thick 2nd thin 3 thick 4 thin again. As a rough explanation!  \nTo have a changing contrast with up- and downgoing strokes -  \nas you have at \"M\" \"N\" \"X\" \"Y\".  \nCompare changing contrast of M with W...\n\n"
    },
    {
      "time": "12 Apr 2008 — 1:53am",
      "content": "Thank you very much for your advice guys!\n\nI made the suggested changes, and I updated my first post with a new pdf file.  \nI'm working on the lc now, I will post them as soon as they're done. Meanwhile, keep the crits coming, I'm sure that with your help I can do a much better job.\n\nAll the best,  \nCristian.\n\n"
    }
  ]
}
