{
  "id": "44140",
  "title": "Nastaliq fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nThis is my first post to this forum. I have already appreciated some of the wealth of information experience available here.\n\nPresently I am doing some research into software and fonts capable of authentically handling Urdu ( [Nastaliq](http://web.archive.org/web/20150124010937/http:/typophile.com/wiki/Nastaliq)) typesetting work (long books). I have come across a package called InPage, bundled together with a family of fonts called simply \"Noori Nastaliq\" by Kamal Mansour.\n\nIdeally, I am hoping to find an OpenType font solution which will function well within InDesign CS/CS3 ME (where my experience lies). Does anyone here know where the Noori Nastaliq fonts might be found? I have been looking around on the Internet for a bit without success. Also, does anyone here have a success story of working with Urdu text within InDesign ME. If so, are there particular fonts which are recommended?\n\nI'd be grateful for any good advice.\n\nJeff\n\n",
  "author": "jklassen",
  "time": "11 Apr 2008 — 11:26am",
  "uid": "26441",
  "comments": [
    {
      "time": "11 Apr 2008 — 2:20pm",
      "content": "Hi; the Noori Nastaliq font is from Monotype:  \n [http://www.monotypeimaging.com/ProductsServices/wt\\_fontsample.aspx?type=Arabic](http://web.archive.org/web/20150124010937/http:/www.monotypeimaging.com/ProductsServices/wt_fontsample.aspx?type=Arabic)\n\nJason C\n\n"
    },
    {
      "time": "10 May 2008 — 6:24am",
      "content": "Hi Jason,\n\nMy further comment here is rather delayed. Just wanted to mention that I did contact Monotype and was able to purchase the font from them (Noori Nastaliq). The rendering for Unicode Urdu text under Windows XP/Uniscribe is quite good with this font. Unfortunately, InDesign ME (CS2) does not fair nearly so well. The text is all squashed together -- have tried numerous style options to see if some configuration exists in InDesign which would help .. but nothing. The text renders OK in InDesign ME in many common Arabic Unicode fonts, with the exception of some missing characters in most fonts (esp. 06BE: ARABIC LETTER HEH DOACHASHMEE).\n\nThe Noori Nastaliq font contains all the required shapes. In fact, I am working at conversion of documents from InPage to Unicode. I hoped that the Noori font would be the best bet, since it seems to be the Unicode equivalent of the InPage legacy fonts. The font does work well, just not in InDesign ME.\n\nSo... just wondering still whether anyone here has a story to tell about working with Urdu text in InDesign ME, Nastaliq style? Any successes?\n\nJeff\n\n"
    },
    {
      "time": "11 May 2008 — 2:16am",
      "content": "[double post]\n\n"
    },
    {
      "time": "11 May 2008 — 2:15am",
      "content": "Since you asked about '_software_ and fonts', you might have a look at the [Tasmeem](http://web.archive.org/web/20150124010937/http:/www.winsoft.eu/www/eng/products_solutions/WinSoft-Tasmeem.php) plug-in for InDesign ME. There's a lively discussion about it on [Pascal Zoghbi's blog](http://web.archive.org/web/20150124010937/http:/29letters.wordpress.com/2007/01/15/arabic-calligraphy-written-by-hand-or-type-set-on-the-computer/), with contributions by its inventor and news in the last comments.  \n(To be a bit more precise, at the heart of it there is a layout engine called ACE which interacts with fonts of a special format, and the Tasmeem plug-in gives InDesign ME access to both.)  \nI should emphasize that I do not know Arabic. My interest is in technology, and this is the best thing I have seen in years.\n\nKarsten\n\n"
    },
    {
      "time": "11 May 2008 — 3:34am",
      "content": "Mr Klassen, you might contact Thomas Milo, the man behind ACE and Tasmeem, at tmilo[AT]decotype[DOT]com\n\n"
    },
    {
      "time": "11 May 2008 — 9:11am",
      "content": "Karsten,\n\nThank you for taking the time to reply. I have seen Tasmeem, and must agree that it appears to be a significantly and uniquely powerful addition to InDesign ME. However, I am working with long documents and would require the features to be enabled for more than 2 pages -- i.e Tasmeem \"Publisher Edition\" needed. The price of that edition was a bit \"frightening\" the first time I looked ($12,500). That said, I acknowledge the significant amount of development that must have gone into this product (InDesign additions and fonts). I was still hoping that some success for Nastaliq style might be possible in a somewhat less expensive product (the Noori font looks OK in Word -- any Uniscribe aware application really). Perhaps InDesign ME does not implement as much of OpenType glyph positioning (or other) as provided through many Uniscribe aware applications.\n\nI should still give Tasmeem a try, as there is a 45 day trial available. The cost is a bit of a hurdle.\n\nJeff\n\n"
    },
    {
      "time": "29 May 2008 — 6:29am",
      "content": "Hi Jeff, was that Monotype in the US where you bought the Noori font? I'm surprised as they told me before it was not available.  \nFor quality I think Inpage is impossible to improve on, as every possible combination is a separately designed glyph.\n\n"
    },
    {
      "time": "29 May 2008 — 6:52am",
      "content": "\\> i.e Tasmeem “Publisher Edition” needed. The price of that edition was a bit “frightening” the first time I looked ($12,500).\n\nMirEmad from:  \n [www.maryamsoft.com](http://web.archive.org/web/20150124010937/http:/www.maryamsoft.com/ \"www.maryamsoft.com\")  \nworth downloading and the price not “frightening”.  \nA bundle of fonts for less than 20U$.  \nAll the Best + Flowers\n\n"
    },
    {
      "time": "2 Jun 2008 — 7:33pm",
      "content": "Worth Watching:  \n [http://www.inpage.com/noori.htm](http://web.archive.org/web/20150124010937/http:/www.inpage.com/noori.htm \"http://www.inpage.com/noori.htm\")  \nHappy exploring with Flowers\n\n"
    },
    {
      "time": "5 Jun 2008 — 11:00am",
      "content": "Beachmat,\n\nSorry about the delayed reply. Yes it was Monotype in the U.S.\n\nI originally contacted them using a contact form on the monotypeimaging website  \n [http://www.monotypeimaging.com/contact/](http://web.archive.org/web/20150124010937/http:/www.monotypeimaging.com/contact/ \"http://www.monotypeimaging.com/contact/\")\n\nI had selected the Graphic Design Professions contact form. A salesperson wrote back to me straight away and was able to process the order over the phone.\n\nJeff\n\n"
    },
    {
      "time": "6 Jun 2008 — 2:21am",
      "content": "Thanks Jeff.\n\nTo the best of my knowledge, Tasmeem does not generate Nastaliq.\n\nAlso I wouldn't describe Inpage as legacy. It's just a different approach. The fonts may be application-based, rather than Opentype, but the end results are actually better than Opentype.\n\n"
    },
    {
      "time": "6 Jun 2008 — 6:41am",
      "content": "Thanks for the information on Tasmeem.  \n(If I have spare time, I'd still like to explore the software demo. The features look tremendous)\n\nMy need is for a solution that will 1) work with Unicode data, and 2) ideally, was hoping for a solution which would work within InDesign ME. The organization I work with has developed additional automation software for InDesign which greatly assists the efficiency of our work.\n\n(The Unicode issue is important due to the fact that we wish to maintain our text sources in other editing applications, and feel strongly that the long term archivability of text that we are working with is only reasonable in a globally understood and widely implemented encoding system.)\n\nI sincerely appreciate the communication, everyone. I find that this forum has some very insightful and helpful communication.\n\nJeff\n\n"
    },
    {
      "time": "10 Nov 2008 — 9:04am",
      "content": "Jeff i have a question: How much it costs that noori nastaliq opentype u purchased?\n\n"
    },
    {
      "time": "10 Nov 2008 — 8:49pm",
      "content": "[http://alvi.urdushare.net/blog/200811/download-alvi-nastaleeq](http://web.archive.org/web/20150124010937/http:/alvi.urdushare.net/blog/200811/download-alvi-nastaleeq \"http://alvi.urdushare.net/blog/200811/download-alvi-nastaleeq\")  \nFree of Charge with Flowers\n\n"
    },
    {
      "time": "10 Nov 2008 — 9:44pm",
      "content": "Looks like they replaced the latins ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": "11 Nov 2008 — 3:01pm",
      "content": "i know all about alvi nastaleeq.... my question regardwd the price of monotypes noori nastaliq!\n\n"
    },
    {
      "time": "12 Nov 2008 — 6:45am",
      "content": "i'm curious too about the noori nastaliq price -- it doesn't seem to be listed for sale anywhere online. Is it only available by direct request?\n\n"
    },
    {
      "time": "15 Apr 2009 — 2:46pm",
      "content": "I noticed the concerns above about the price of Tasmeem. I have some good news. Our partners WinSoft have drastically changed course and made Tasmeem affordable for the general public - and we just completed a new DecoType Nastaliq. It is language-configurable so that it can be set to follow Urdu, Persian, Ottoman or Arabic practice - as well as free-style.\n\nNastaliq is the core script of the Persian writing tradition, and equally important in the areas under its cultural influence. Notably the languages of Afghanistan (Dari, Baluchi, Uzbek, Turkmen, etc.), Pakistan (Punjabi, Urdu, Saraiki, etc.), India (Urdu, Rekhta, Kashmiri), and the Turkic Uyghur language of the Chinese province of Xinjiang, rely on Nastaliq. Under the name Taʿliq has also been beloved by Ottoman calligraphers who developed the Diwani and Ruqah styles from it.\n\nThe new DecoType Nastaliq for the first time in the history of typography covers all the orthographies concerned. Since the whole Unicode Arabic block is supported, even Pashtu and Sindhi can be handled, even though these languages traditionally did not use Nastaliq.\n\nThe font offers all attested variant letter shapes and swashes, presented to the user through the Tasmeem WordShaper and TextShaper interfaces. It has around 300 glyphs and weighs around 140Kb. Word-shaping integrity has been tested on 27 billion letter blocks.\n\nHere's a sample:  \n [www.decotype.com/Tasmeem/rawae\\_l-Hasanu\\_Embossed.pdf](http://web.archive.org/web/20150124010937/http:/www.decotype.com/Tasmeem/rawae_l-Hasanu_Embossed.pdf \"www.decotype.com/Tasmeem/rawae\\_l-Hasanu\\_Embossed.pdf\")\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "15 Apr 2009 — 4:28pm",
      "content": "<cite>It has around 300 glyphs and weighs around 140Kb. Word-shaping integrity has been tested on 27 billion letter blocks.</cite>\n\nIt does all that with only 300 glyphs? o.O\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "15 Apr 2009 — 9:16pm",
      "content": "Yep. It's DecoType - not OpenType. BTW, there's no longer a page limit in Tasmeem other than that of InDesign. I'll post some more samples later today.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "16 Apr 2009 — 10:54am",
      "content": "As promised, a specimen booklet, designed by Titus Nemeth. The last two pages show Nastaliq:\n\n[www.decotype.com/Tasmeem/DecoType\\_Classics.pdf](http://web.archive.org/web/20150124010937/http:/www.decotype.com/Tasmeem/DecoType_Classics.pdf \"www.decotype.com/Tasmeem/DecoType\\_Classics.pdf\")\n\nThe second example is a bit rough, but it is kind of wonderful. It is my pet project: Persian in two totally different scripts and spelling methods:\n\n[www.decotype.com/Tasmeem/persian\\_cyrillic\\_nastaliq.pdf](http://web.archive.org/web/20150124010937/http:/www.decotype.com/Tasmeem/persian_cyrillic_nastaliq.pdf \"www.decotype.com/Tasmeem/persian\\_cyrillic\\_nastaliq.pdf\")\n\nOne Arabic-based (language=Farsi, script=Nastaliq) and one Cyrillic-based (language=Tajiki, script=Adobe Minion). Please notice that this material, which was found on the BBC World website, uses basic Cyrillic, stripped of diacritics required for correct Tajiki spelling, ignoring all the specialized Cyrillic letters defined for this in the Unicode Standard. The reason is of course obvious: the BBC must have been confident that none of you computer typographers would have bothered to support Tajiki :-)\n\nThe contents in both columns are practically identical, which make this a fascinating semi-bilingue. As said, the typography is a bit rough, with time I will upload smoother versions. The point I want to make now is that Tasmeem can handle many pages of complex text involving Nastaliq.\n\nI like this sample particularly because from 1988-91, I was involved in developing the Cyrillic portion of Robert Slimbach's Adobe Minion. We were all pioneers, back then. Together with David Birnbaum, we defined the Cyrillic character set. Prof Birnbaum took care of most of the Slavic, I supported the Slavic and worked out all the other orthographies of mainly Turkic Central Asian languages. Our work laid the basis for Unicode's Cyrillic Block. At the time I only did it to speed up Adobe's interest in Arabic. Boy was I wrong. It took another two decades.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "16 Apr 2009 — 3:00pm",
      "content": "I figured you'd end up with less than an Opentype one but 300 glyphs is less than the Extended A and B pages. Just a bit surprising. Does the DecoType format encode the morphs within a single glyph? Although I guess a lot are composed so if you just define where to put one, two, three, or four dots etc . Just curious since I'm working on my first Arabic font myself (though not a calligraphical one) and trying to learn as much as possible about how people go about making their fonts.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "16 Apr 2009 — 3:51pm",
      "content": "Kudos to Thomas and his crew for what surely must count as a milestone achievement.\n\nI haven't looked closely yet, but I would be interested to find out more about how the DecoType format and Tasmeem work and what the implications might be concerning the possibility of more efficient fonts or design processes for hangul (Korean alphabet) or Chinese logographs. These also involve combining a relatively small number of elements into innumerable arrays of forms, and in hangul's case at least, simple repetition of the exact same shapes won't do—finer control of the shaping is required. I wonder if the solution used by DecoType can handle this sort of thing.\n\n"
    },
    {
      "time": "16 Apr 2009 — 3:56pm",
      "content": "Your question how we handled the Extended A and B pages is based on a common misunderstanding regarding the purpose of Unicode. It's explained more elaborately here:  \n [http://www.forensicswiki.org/wiki/Arabic\\_PDFs](http://web.archive.org/web/20150124010937/http:/www.forensicswiki.org/wiki/Arabic_PDFs \"http://www.forensicswiki.org/wiki/Arabic\\_PDFs\")\n\nACE handles the Unicode blocks 06XX and 07XX. The Extended A and B pages are legacy font pages that put designers on the wrong footing: it's old fashioned legacy stuff. With a few Koranic exceptions all of it can be ignored. The so-called \"ligatures\" can be substituted with the corresponding characters the 06XX block, i.e., the nominal characters of - extended - Arabic. How to build a font for Arabic is really outside the domain of the Unicode Standard. As for computer typography, it has authority over _what_ to render, not over _how_ to render.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "16 Apr 2009 — 4:02pm",
      "content": "Regarding ACE for other scripts, that's a new direction that we are investigating. But the strength of our approach is the balance between artistic, linguistic and technical competence. That's also our limitation. But we are open for any suggestions.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "17 Apr 2009 — 12:49am",
      "content": "Sorry for not answering yout question about the structure of DecoType fonts. Instead I was carried away by the Extended A and B pages of the Unicode Standard. They keep having the effect on me of a red flag on a bull - I am sure you get the picture. They are monuments of bureaucratic stupidity. Character codes can be standardized, typography can't. It's a highly individualistic activity that cannot be nailed down by international negociations - which was exactly how it happened in the case of the Arabic Presentation Forms.\n\nFor familiarization, however a template may help. We are developing a series of them, the first two of which are introduced and explained by Titus Nementh and can be downloaded here:\n\n[http://sehstoerung.sonance.net/pdfs/T\\_Nemeth%20-%20A%20primer%20for%20Ar...](http://web.archive.org/web/20150124010937/http:/sehstoerung.sonance.net/pdfs/T_Nemeth%20-%20A%20primer%20for%20Arabic%20Typeface%20Design_web.pdf \"http://sehstoerung.sonance.net/pdfs/T\\_Nemeth%20-%20A%20primer%20for%20Arabic%20Typeface%20Design\\_web.pdf\")\n\nPlease beware that this is only the tip of the iceberg, and not a recipe for DecoType design. It is just a first acquaintance, but they do guide one through the steps to produce a correctly structured Tasmeem compatible typeface.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "17 Apr 2009 — 8:32am",
      "content": "I pretty much used them as an abbreviation for \"each and every final init medial isol form\" of a letter.\n\nI'm still reading through the primer and the format, but just to see if I'm understanding your approach,\n\nBecause Unicode for Arabic treats the base (skeletal) letters and those with marks as separate letters (‹ح› ,‹ج› and ‹خ›) this requires in normal OT fonts that the glyphs be repeated for all morphs, differencing for example the two letters n and ñ, the letter of which has a preferred encoding of ‹n› + ‹~›.\n\nSo DecoType essentially performs an internal decomposition of ‹ز› into ‹ر› + ‹·› which allows the base form to have the same advantages that Latin/Cryillic/Greek has with the combining diacritics, since ‹a›, if it's been encoding with all its combining marks can have a hundred or so variations with a single diacritic and limitless if the mark-to-mark has been added? (given our recent discussion on the ¿ mark in another thread I'd like to note the previous sentence is one that could have greatly benefited from its use in English).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "17 Apr 2009 — 1:24pm",
      "content": "I prefer to discuss details off-line. You can Skype me at t.milo\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "17 Apr 2009 — 1:45pm",
      "content": "Or send an electronic male to my initial plus last name, together 5 letters, at my company as below, less three whiskeys - to mislead address prowlers :-)\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "17 Apr 2009 — 2:10pm",
      "content": "Okay added, see you \"offline\" on Skype ;-)\n\n"
    },
    {
      "time": "17 Apr 2009 — 2:25pm",
      "content": "Hi, Thomas,  \nIts an honour for me writing to u here :)  \nFor the first: Receive congrats for accomplishing this wonderful nastaliq font. Believe me it was my childhood dream. Especially its kerning and perfect character based joints makes it the first of its kind. It looks like hand written calligraphy on machine! I would request ur team to release this software at low prices for people of Pakistan also. Cause we are too tired of Inpage crap. LOL!\n\n"
    },
    {
      "time": "18 Apr 2009 — 3:28pm",
      "content": "Hi Arif,\n\nFor us it is an honour to get your compliments. Digging into the \"nastaliqistan\" was a great adventure. In fact our new Nastaliq is done by my partner Mirjam Somers, on the basis of the techniques and technologies we developed over the years. But in the end of the day, what counts is the result. And for us the fact that you consider this a serious nastaliq is very gratifying indeed.\n\nThe pricing of the end product is not in our hands, but if this approach is a viable solution for Arabic script I am confident that it will be affordable in due time.\n\nCheers,\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "29 Apr 2009 — 9:16pm",
      "content": "Type Nastaliq in Wordpad and Notepad as easy as typing ABC.  \nNo addional software is needed?!  \n [http://typophile.com/node/48495#comment-307558](http://web.archive.org/web/20150124010937/http:/typophile.com/node/48495#comment-307558 \"http://typophile.com/node/48495#comment-307558\")  \n [http://www.maryamsoft.com/Download/MirEmad%20Sample.pdf](http://web.archive.org/web/20150124010937/http:/www.maryamsoft.com/Download/MirEmad%20Sample.pdf \"http://www.maryamsoft.com/Download/MirEmad%20Sample.pdf\")  \nAll the best for all with Flowers\n\n"
    },
    {
      "time": "30 Apr 2009 — 1:03am",
      "content": "I looked at it, thanks. The shapes are beautiful. Very impressive. Congratulions!\n\nIn comparison the Linotype and Monotype Nastaliq look uninteresting.\n\nTo come back to this thread, do you have examples with Urdu?\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "6 May 2009 — 8:46pm",
      "content": "<cite>No addional software is needed?!</cite>\n\nIs this a question or a statement?&nbsp;&nbsp;;-)  \nThere is additional software needed, as far as I see.\n\n"
    },
    {
      "time": "8 May 2009 — 10:46am",
      "content": "This font is driven by additional software that deeply penetrates into the Windows system. Please check out my full comment here:  \n [http://typophile.com/node/48495#comment-345968](http://web.archive.org/web/20150124010937/http:/typophile.com/node/48495#comment-345968 \"http://typophile.com/node/48495#comment-345968\")\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "8 May 2009 — 1:31pm",
      "content": "_In comparison the Linotype and Monotype Nastaliq look uninteresting._\n\nLinotype's nasta'liq typeface, Qalmi, has not been available for many years. There is no OpenType version of it. It relied on custom software not unlike, in some respects, ACE/Tasmeem. I have a copy of the Linotype nasta'liq layout patent documentation, and it's a very clever system: miminal glyph set, dynamic positioning and connections, contextual offset of dots relative to adjacent shapes, etc.\n\nThe design of Qalmi was specifically targeted at Urdu newspaper production, so should be judged in that context, not against fine calligraphy: the hairline strokes are heavier than one would expect in classical nasta'liq, and the design is more horizontal, although vertical mim and jim shape connections still create some very tall letter groups: this feature of the script is not sacrificed to the technology. The professor responsible for national examinations in Urdu in the UK still considers it the best nasta'liq typeface he ever worked with and bemoans its unavailability.\n\nThe Monotype approach to nasta'liq was always very different. They took the ligation approach, with \\>20,000 ligature glyphs, some for whole words. Inspired, I believe, by Tom's ACE approach, Monotype more recently revised their nasta'liq OpenType approach and massively reduced the number of ligatures, but it is still a hybrid system using ligatures for some combinations.\n\nIn response to the original message: InDesign CS4 ME supports the OpenType cursive attachment positioning, which CS3 did not, so it is likely that Noori Nastaliq and similar fonts may work better in this version. I have not tested this with a nasta'liq font, but have with naskh fonts that use this feature.\n\nTom, the new DecoType nasta'liq looks very good, as I would expect.\n\n"
    },
    {
      "time": "8 May 2009 — 2:12pm",
      "content": "<cite>In comparison the Linotype and Monotype Nastaliq look uninteresting.</cite>\n\nHi John\n\nI meant the shapes, not the technologies. I'll pass on the compliment to Mirjam!\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "14 Jun 2009 — 11:07pm",
      "content": "Tom, John, and others,\n\nI had met you, Tom, a few years back at a Unicode conference (28th).\n\nI have been distracted with a variety of other tasks recently, and had not seen the further communication here. I was quite delighted to see the new information, and to find out that so much progress is being made. I am just looking at the Winsoft website, and the Nastaliq font looks beautiful (but I must admit to a fairly untrained eye). Would anyone know when it will be available to purchase? (Says \"soon available\"). I guess I'll write to Winsoft about that.\n\nJohn.. I did work with some Nastaliq text in CS4, and although it renders fairly will with Noori, and Alvi, and a couple other fonts -- more than a page of text causes an application crash -- I have tried over and over again on an otherwise stable system (in a clean virtual machine). So... something still not completely ready within \"native\" InDesign CS4 ME. I did interact for some time with a person from Winsoft about this.\n\nIf Tasmeem and this new font work well for long books, I believe this will be a good solution for our needs.\n\nBTW: For those who asked about the Noori OpenType font... I believe that it is no longer available -- Monotype has stopped selling it. Not certain, but I believe that the original designer is now under control of the font software.\n\nThere is one other OpenType font I stumbled across which has produced nice looking results, but I have been unable to determine who the author is -- that is \"Jameel Noori Nastaleeq\" (one source is [http://urdu.ca/1](http://web.archive.org/web/20150124010937/http:/urdu.ca/1 \"http://urdu.ca/1\")). Does anyone know any further details about this font?\n\nThanks again for the discussion.\n\nJeff\n\n"
    },
    {
      "time": "15 Jun 2009 — 2:41am",
      "content": "Jameel Noori Nastaliq has the same glyphs as Alvi Nastaliq, however, as OT font it behaves differently.\n\nWill you be at the upcoming Unicode Conference?\n\nCheers,\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "19 Jun 2009 — 12:31pm",
      "content": "Tom,\n\nI did not have plans to be at the Conference at this point. I'm looking at the IUC 33 website, and no details about tutorial or conference agenda yet. Topics dealing with Urdu typography would be of interest (and also Mongolian, but that's a whole other thread or two for sure).\n\nJeff\n\n"
    },
    {
      "time": "21 Jun 2009 — 12:44am",
      "content": "I have two contributions again: I will do a tutorial this time with special attention to Nastaliq and a technical talk about the nitty gritty of encoding and rendering the Koran.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "21 Jun 2009 — 12:45am",
      "content": ""
    },
    {
      "time": "11 Jul 2009 — 1:41pm",
      "content": "Dear Thomas Milo,\n\nI would like to extend sincere thanks and appreciations on behalf of all Omani people for the efforts and valuable contributions you have made to Arabic computer typography. I knew that our Ministry of religious affairs has commissioned Decotype to work on an electronic copy of the 'Omani Mushaf' that was celebrated last September in the Grand Holy Mosque. Please I am very interested to know more details about how you are approaching this problem and difficulties encountered so far.\n\nI wish I can attend one of your technical talks about that subject but obviously due to the distance separating us it would be very hard.\n\nThe field of computer typography is totally new to me and recently I have developed special interest to study computational problems faced with the Arabic script. Typography in my point of view is among the most demanding nowadays.\n\nRegrads,\n\nakalabdul\n\n"
    },
    {
      "time": "20 Jul 2009 — 5:13am",
      "content": "WinSoft is excited to announce the release of [Nastaliq](http://web.archive.org/web/20150124010937/http:/www.winsoft-international.com/en/products/tasmeem-fonts-nastaliq.html). You can read our press release here: [http://www.winsoft-international.com/en/press/tasmeem-nastaliq.html](http://web.archive.org/web/20150124010937/http:/www.winsoft-international.com/en/press/tasmeem-nastaliq.html \"http://www.winsoft-international.com/en/press/tasmeem-nastaliq.html\").\n\nWinSoft  \nPress & Public relation department  \n [contactpresse@winsoft.fr](mailto:contactpresse@winsoft.fr)  \n [http://www.winsoft-international.com/](http://web.archive.org/web/20150124010937/http:/www.winsoft-international.com/ \"http://www.winsoft-international.com/\")\n\n"
    },
    {
      "time": "20 Jul 2009 — 9:07am",
      "content": "Dear akalabdul,\n\nThank you for your kind message. It is a great honour to be entrusted with this responsible task by the Government of Oman. I am preparing an internal report about the peculiarities that we encounter and solve regarding unusual spellings and consequent exceptional calligraphic constructions. Please send me privately your email address so that I can send you a copy of the report. (to avoid spam I am not posting my address here, but in case you don't have it, please contact MARA)\n\nWith best regards,\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150124010937/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "3 Aug 2009 — 1:26am",
      "content": "Here's a good Naskh font, having good kerning pairs & Diacritics placement.\n\n[http://fonts.qurancomplex.gov.sa/download/KFGQPC%20Arabic%20Keyboard%20l...](http://web.archive.org/web/20150124010937/http:/fonts.qurancomplex.gov.sa/download/KFGQPC%20Arabic%20Keyboard%20layout.zip \"http://fonts.qurancomplex.gov.sa/download/KFGQPC%20Arabic%20Keyboard%20layout.zip\")\n\nCheck it, its free for all.\n\nYou will also find its bold version very soon.\n\n"
    },
    {
      "time": "13 May 2010 — 12:48pm",
      "content": "Indesign CS5 ME now also supports Jameel and Alvi. So, lol for all tasmeem and mir emad like products :D\n\n"
    },
    {
      "time": "17 May 2010 — 1:34am",
      "content": "Reading [http://typophile.com/node/70474](http://web.archive.org/web/20150124010937/http:/typophile.com/node/70474 \"http://typophile.com/node/70474\") and [http://typophile.com/node/70395](http://web.archive.org/web/20150124010937/http:/typophile.com/node/70395 \"http://typophile.com/node/70395\"), I assume that you already discovered that your LOL was far from being justified ...\n\n"
    },
    {
      "time": "22 May 2010 — 5:41pm",
      "content": "@kl  \nYeah, look them again. They are lolling back to you! :D\n\n"
    }
  ]
}
