{
  "id": "44141",
  "title": "Where are the Web 2.0 fonts?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "OK, I’ve been hearing about Web 2.0 and AJAX and Ruby on Rails and Amazon web services etc for too long now. And every one of these new sites I view all still use Arial and Verdana and Times and Georgia to display their text. Boring. These are the same fonts that were around at the [start of the web](http://web.archive.org/web/20081029024036/http:/www.google.com/search?hl=en&q=Internet%20Tidal%20Wave%20memo) (or very soon after). Microsoft released their suite of core web fonts and that was it. No more progress on the typography front.\n\nI’m not saying Microsoft has to step up again. In fact it’s unlikely they will. They’ve got some [beautiful new fonts](http://web.archive.org/web/20081029024036/http:/www.ascendercorp.com/ctfonts.html) that shipped with Vista (and to the consternation of the Vista product managers, the latest version of Office as well). But while one can [get these fonts freely on the web](http://web.archive.org/web/20081029024036/http:/www.microsoft.com/downloads/details.aspx?familyid=048DC840-14E1-467D-8DCA-19D2A8FD7485&displaylang=en), they will never be widely licensed for distribution.\n\nBut what I don’t understand is why others haven’t picked up the slack here. There are some really nice free fonts out there (many of which have been featured on [Smashing Magazine](http://web.archive.org/web/20081029024036/http:/www.smashingmagazine.com/category/fonts/)) that could easily be included in the Firefox distribution—like [these for example](http://web.archive.org/web/20081029024036/http:/www.kpao.org/2007/12/best-free-fonts.html).\n\nOr how about Adobe? They have amazing reach with both Flash and Acrobat Reader, and they also have [an amazing library of typefaces](http://web.archive.org/web/20081029024036/http:/www.adobe.com/type/). How about it Adobe? How about picking up the slack here and giving a bit back to the Internet community that made you the powerhouse you are today?\n\nOr Google? They licensed the [Droid fonts](http://web.archive.org/web/20081029024036/http:/www.ascendercorp.com/pr/pr2007_11_12.html) for their Android phone platform. How about extending use of these fonts to computers as well? They’ve got plenty of client installs (Google Desktop, Toolbar, Talk, Pack...) they could bundle fonts with.Ah well, I’m not holding my breath. I’m still going to use [SIFR](http://web.archive.org/web/20081029024036/http:/novemberborn.net/sifr3) for my designs. And for the love of everything that is beautifully designed, I encourage you all too as well.\n\n_[Originally posted here](http://web.archive.org/web/20081029024036/http:/www.kpao.org/2008/04/where-are-the-web-20-fonts.html)._\n\n [‹ True or False?](http://web.archive.org/web/20081029024036/http:/typophile.com/node/44131 \"Go to previous forum topic\") [pfb & pfm fonts? ›](http://web.archive.org/web/20081029024036/http:/typophile.com/node/30208 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081029024036/http://typophile.com/user/29180\" title=\"View user profile.\">davidc</a>",
  "time": "<br>",
  "uid": "29180",
  "comments": [
    {
      "time": " 11.Apr.2008 12.08pm",
      "content": "\\>they will never be widely licensed for distribution.\n\nWhy do you say that? To date had one OS maker inquire and I think there are mechanisms in place to satisfy them. The ClearType Collection fonts might never be released under an open-source license, but more than happy to work with anyone who’s interested in a license.\n\n"
    },
    {
      "time": " 11.Apr.2008 12.20pm",
      "content": "We’ll never have proper web 2.0 fonts until we have the technology to make them look like black, shiny plastic.\n\n"
    },
    {
      "time": " 11.Apr.2008 12.38pm",
      "content": "Perhaps a pipe dream, but it’d be nice if Apple, Microsoft, and the major Linux UI distros got together to share system font licensing.\n\nI’m sure to do that would involve major political and legal hurdles.\n\nBut it would be nice.\n\nAlso, ’web 2.0’ really doesn’t have much to do with fonts, though it’s certainly an overused/abused term these days.\n\n"
    },
    {
      "time": " 11.Apr.2008 1.34pm",
      "content": "[http://www.typophile.com/node/43971](http://web.archive.org/web/20081029024036/http:/www.typophile.com/node/43971 \"http://www.typophile.com/node/43971\")\n\nThe solution to Web fonts isn’t relying on people to have fonts pre-installed, it’s having fonts linked to Web pages. The question is, will it be native fonts (already supported by Safari 3.1) or some modified format such as EOT?\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 11.Apr.2008 1.46pm",
      "content": "<cite>We’ll never have proper web 2.0 fonts until we have the technology to make them look like black, shiny plastic.</cite>\n\nNo, no, no. Web 2.0 fonts won’t all look like plastic, they’ll just do some minor thing incapable of generating anything of value every five minutes.\n\n"
    },
    {
      "time": " 11.Apr.2008 2.24pm",
      "content": "<cite><br>\nWe’ll never have proper web 2.0 fonts until we have the technology to make them look like black, shiny plastic.</cite>\n\nNo, no, no. Web 2.0 fonts won’t all look like plastic, they’ll just do some minor thing incapable of generating anything of value every five minutes.\n\nthey’ll have ads embedded in them, probably featuring Flash animation\n\n"
    },
    {
      "time": " 11.Apr.2008 3.17pm",
      "content": "We’ll start seeing good fonts on the Internet when Mozilla 2 finally supports embedded fonts. Safari 3.1 doesn’t have influence over Microsoft’s IE like what FireFox does.\n\n"
    },
    {
      "time": " 12.Apr.2008 1.05am",
      "content": "<cite>How about picking up the slack here and giving a bit back to the Internet community that made you the powerhouse you are today?</cite>\n\nRemember this one?  \n [http://www.designbyfire.com/?p=30](http://web.archive.org/web/20081029024036/http:/www.designbyfire.com/?p=30 \"http://www.designbyfire.com/?p=30\")\n\nEven if one of the companies you mentioned would release some fonts for free, not everyone would download them. You would need to bundle them with the operation systems and wait several years before everyone runs the new version.\n\nIt’s much more likely that coming browser versions will support webfonts and then we don’t have to care anymore about pre-installed fonts.\n\n"
    },
    {
      "time": " 12.Apr.2008 4.50am",
      "content": "“The solution to Web fonts isn’t relying on people to have fonts pre-installed, it’s having fonts linked to Web pages.”  \nReplacemnts for the pre-installed, speciallized type for text, are not replaceable by linking, if all one can call is a file name – good luck 2.0!\n\nCheers!\n\n"
    },
    {
      "time": " 12.Apr.2008 5.49pm",
      "content": "<cite>How about it Adobe? How about picking up the slack here and giving a bit back to the Internet community that made you the powerhouse you are today?</cite>\n\nI missed this somehow the first time. But I agree wholeheartedly with Ralf. Further, for that to work, the OS vendors have to actually be interested in bundling your fonts....\n\nBut that really doesn’t solve the problem faced by Web designers. What most of them really want is not just to have a few more good fonts, but to be able to use essentially arbitrary fonts - well, actually, the fonts already being used in the visual identity for the person/group/organization the site is for.\n\nPlus, as we see more mobile devices used for surfing the Web, you get even more vendors in play, and it becomes less practical to bundle gobs of fonts with the device/OS.\n\nWhich brings us back to font embedding/linking.\n\n(Side note: although the Internet may be the engine of Adobe’s growth today, IMO it’s not what made Adobe a “powerhouse.”)\n\nCheers,\n\nT\n\n"
    }
  ]
}
