{
  "id": "44144",
  "title": "[Help] Microsoft Word & faux italic/bold/bold italic",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi all.\n\nWe bought MetaOT and MetaSerifOT on behalf of a client from the good folks at FontShop. Our client uses PCs and executes their daily tasks using Microsoft Office applications such as Word. We followed the installation instructions on FontShop’s website, so I’m pretty sure both are installed correctly.\n\nThe issue we have is that our client has to go to the font menu each time they need to apply _italics_, **bold** and **_bold italics_**. They are not the type of client that would easily grasp the importance of this and, without doubt, will be hitting those italic/bold buttons to emphasise their text, resulting in faux italics/bold.\n\nMy question is this: is their a way that they can hit the italic/bold buttons and get the true MetaOT-Bold, MetaOT-Italic and MetaOT-BoldItalic?\n\nAny help would be greatly appreciated.\n\nTa.  \nConor\n\n",
  "author": "Conor",
  "time": "11 Apr 2008 — 12:55pm",
  "uid": "12639",
  "comments": [
    {
      "time": "11 Apr 2008 — 1:30pm",
      "content": "Those aren't faux bold and italic buttons. They're just buttons. If the typeface has the styles, and they are set up in the standard Windows fashion, the links will work fine from using the buttons, and they will get the true styles.\n\nIf the fonts are \\*not\\* properly style linked as they probably should be, there is nothing the client can do to change that.\n\nIf the Bold and Italic fonts show up separately in the font menu in Word, then they're not style linked. If they don't show up separately, then everything is presumably fine.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "11 Apr 2008 — 1:43pm",
      "content": "Hi Thomas.\n\nThe fonts are showing up separately in Word, so they are not style linked. Any idea of how I would go about fixing this?\n\n"
    },
    {
      "time": "11 Apr 2008 — 2:09pm",
      "content": "Why not talk to the people you bought the fonts from?\n\n"
    },
    {
      "time": "11 Apr 2008 — 2:18pm",
      "content": "Will do.\n\n"
    },
    {
      "time": "11 Apr 2008 — 2:33pm",
      "content": "Yup. I doubt FontShop's licensing terms allow end-user modification of fonts. If not, they would need to do the changes themselves.\n\nT\n\n"
    },
    {
      "time": "11 Apr 2008 — 11:21pm",
      "content": "Conor - FontShop should be able to address that for you. Give us a shout.\n\n"
    },
    {
      "time": "12 Apr 2008 — 12:41am",
      "content": "Thanks Stephen. I filled in the contact form. Fingers crossed.\n\n"
    },
    {
      "time": "5 May 2008 — 3:57pm",
      "content": "In Word, you can add buttons to the Formatting toolbar (or any other toolbar) for any installed font. Right click anywhere in any toolbar and select **Customize**. Select the **Command** tab. In the **Categories** pane, scroll down to and select **Fonts**. In the **Commands** pane, you should see all your fonts. Click and hold the left mouse button on a font name, drag it to wherever you want it on the toolbar, and release the mouse button.\n\nWhile you're in the **Customize** dialog, you can also remove the Bold, Italic, and Underline buttons from the Formatting toolbar. Just click, hold, and drag the appropriate button well away from the toolbar area.\n\nWhen you close Word, you'll probably be prompted to save changes to the normal.dot template.\n\n"
    },
    {
      "time": "5 May 2008 — 6:00pm",
      "content": "Forgot to mention that if you don't want to mess with the existing toolbars, you can create a new toolbar ( **Customize \\> Toolbars \\> New** ), name it something like \"Fonts,\" and drag your font buttons to that.\n\n"
    },
    {
      "time": "7 May 2008 — 9:13pm",
      "content": "<cite>While you’re in the Customize dialog, you can also remove the Bold, Italic, and Underline buttons from the Formatting toolbar.</cite>\n\nWhich you would do why? We're talking Windows here, where that would be nuts.\n\nUnless of course you _only_ used wacky un-style-linked fonts. But as all the common Windows system fonts are style-linked, and so are the overwhelming majority of 3rd party fonts, it seems unlikely....\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "8 May 2008 — 7:44am",
      "content": "I mentioned taking the standard bold, italic, and underline buttons off the Formatting toolbar in the very specific context of Conor's problem. Taking the buttons off the Formatting toolbar would prevent his client from creating \"faux\" Metaserif bold, italic, or bold italic and ensure that they have to use the buttons on the created-for-the-purpose \"Font\" toolbar. For the general 99.999999999% of Word users who aren't concerned about faux Metaserif bold or italic, of course there's no reason to take the buttons off the standard Formatting toolbar.\n\n"
    },
    {
      "time": "10 May 2008 — 4:36am",
      "content": "Right, but... my point is that presumably those are not the only fonts that person is using, so even though they're using MetaSerif, removing the buttons probably isn't a reasonable option.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "11 May 2008 — 8:12pm",
      "content": "I don't disagree with you, but as I said, I only _mentioned_ it, not _recommended_ it. Information is good, right?\n\nTwo other considerations:\n\n1. The buttons on the Format toolbar (or any toolbar) are only shortcuts. You can always format text using Ctrl-b, Ctrl-i, or Ctrl-u, or by going to Format \\> Font.\n\n2. Perhaps Meta is only used for a few specific kinds of documents, not everything. You can create a special template (e.g., \"meta.dot\") and store the customized toolbars in that. Normal.dot would have an untouched Format toolbar and no custom \"Font\" toolbar.\n\n"
    }
  ]
}
