{
  "id": "44163",
  "title": "list of pronouns",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi guys,\n\ni was wondering if people could help me compile a list of common words/pronouns from as many languages as people know. Kind of like Bello words but not just English, words that would be useful for a range of languages.\n\nSome examples:\n\nEnglish: the, and, it, you, who, he, she, why\n\nFrench: le, la, les, que, qui,\n\ncheers.\n\n",
  "author": "cuttin shapes",
  "time": "12 Apr 2008 — 5:22am",
  "uid": "16450",
  "comments": [
    {
      "time": "12 Apr 2008 — 5:40am",
      "content": "Wikipedia can surely help with ponouns for many languages –  \nfor example German (Deutsch)  \n [http://de.wikipedia.org/wiki/Pronomen](http://web.archive.org/web/20130822055028/http:/de.wikipedia.org/wiki/Pronomen \"http://de.wikipedia.org/wiki/Pronomen\") -\\> scroll to _Klassifikation_\n\n"
    },
    {
      "time": "12 Apr 2008 — 8:24am",
      "content": "are you asking for pronouns, or all simple words, or both, or is it any simple common words, including prepositions, verbs, pronouns, and articles ?  \n(\"the\" is an article, not a pronoun, but you must know more about grammar than i do.)\n\nwords which could be fun and playfully meaningful to visually emphasize ?\n\nthis. that. them. they. those. these. what. is. was. will. be. am. would. should. could. he. she. it. his. hers. their. theirs. you. your. yours. i. me. my. oh. not. but. a. an. and. any. ever. never. all. some. few. none. soon. later. now. yes. no. maybe. who. when. why. whom. which. of. in. on. by. into. onto. up. down. over. under. before. after. etc.\n\n"
    },
    {
      "time": "12 Apr 2008 — 9:02am",
      "content": "yeah it more along the lines of what Ch is describing, its for a script font so common words that could be substituted with something a little special. I didn't just want to add a bunch of english words, thought it would be better to add a mixture from other languages.\n\n"
    },
    {
      "time": "12 Apr 2008 — 9:47am",
      "content": "Dutch:\n\n_Articles:_ de, het, een\n\n_Pronouns:_ ik, mij, me, jij, je, u, hij, zij, ze, het, hem, haar, het, wij, we, ons, jullie, hen, hun.\n\n_Possessive pronouns:_ mijn, jouw, zijn, haar, ons, onze, jullie, uw, hun\n\nAnd some of the ones that Ch added for English also in Dutch:\n\n_Prepositions:_ bij, tot, op, om, in, uit, door, naar, voor, achter, boven, onder, naast, langs, tegen (just a selection)\n\n_Conjunctions:_ al, als, behalve, dan, dat, doch, doordat, dus, evenals, hoewel, maar, mits, nadat, nu, of, om, omdat, tenzij, toen, tot, want (just a selection)\n\nIf you want to know what some of them are in English, let me know. :)\n\n"
    }
  ]
}
