{
  "id": "44164",
  "title": "TechNumbers",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This started out as some numbers for a project at work. I decided to add an alphabet. Any feedback would be appreciated. Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [technumbers.gif](http://web.archive.org/web/20150417183453/http:/typophile.com/files/technumbers.gif) | 10.38 KB |\n| [technumbers.pdf](http://web.archive.org/web/20150417183453/http:/typophile.com/files/technumbers.pdf) | 38.47 KB |\n| [technumbers2.pdf](http://web.archive.org/web/20150417183453/http:/typophile.com/files/technumbers2.pdf) | 38.2 KB |\n| [technumbers3.pdf](http://web.archive.org/web/20150417183453/http:/typophile.com/files/technumbers3.pdf) | 38.24 KB |\n\n",
  "author": "russ_mcmullin",
  "time": "12 Apr 2008 — 7:32am",
  "uid": "18019",
  "comments": [
    {
      "time": "12 Apr 2008 — 10:45am",
      "content": "It's good. I like it.\n\nI don't understand why certain vertical strokes, the H in particular, overshoot the top and baseline so much.\n\nYou might want to revisit a few of the numbers now that you've developed a style with the letters: the only square corners in the whole face are in 2 and 5.\n\n"
    },
    {
      "time": "12 Apr 2008 — 12:27pm",
      "content": "I think something that strikes me as odd is that the only letter that is not monospaced (save the I) is the W. If the M isn't wider than the rest of the letterforms, I don't think the W should be either (even though Ws are usually a little bigger than the Ms). I think it throws off the rhythm of the rest of the letters, although I find it's shape the most interesting of all. The short vertical stubs atop the arm of the K and the X don't seem to match the other diagonal strokes. The terminus of the J has an angle on it that I don't se on any of the other letters/numbers.\n\nWhat Kevin mentioned about the H \"overshooting\" the cap height and baseline; Did you draw these with a stroke with the points on baseline/cap-height (perhaps in illustrator)? If you have the rounded edges attribute on the stroke, it will stick out past the endpoint to whatever point size that the stroke is set to.\n\n"
    },
    {
      "time": "12 Apr 2008 — 7:27pm",
      "content": "Thanks very much for the critiques. I agree with everything. It helps to have someone else take a look when you've been staring at something too long. The W has really been bugging me, but I haven't solved it yet. I tried several other options, but they all looked forced. I'll keep looking.\n\n"
    },
    {
      "time": "12 Apr 2008 — 7:45pm",
      "content": "I added an update PDF under the original post.\n\n"
    },
    {
      "time": "12 Apr 2008 — 10:37pm",
      "content": "You've made them look a lot more consistent. Something about the upper bowl of the B doesn't seem right, as well as the bowl of the D. I know you're trying to make them not look like the 8 or the O, but do you have any alternates? I'm also not sure if its a screen resolution thing, or an optical issue to correct, but the small crossbars on the uppercase I look really thick. I think it's just because they're so short that there is too much black space. I'd be interested to see what it would look like to have those bars non-existent or elongated.\n\n"
    },
    {
      "time": "13 Apr 2008 — 11:44am",
      "content": "Goodness, don't change the B and D, they give the face much of its identity. Well, maybe the top curve join of the D could be smoothed out a little.\n\nThe 2 and 5 have lost some distinction now. Try using a diagonal (like in 4) for the lower left of the 2. The 5 may need a compromise, like a smaller turn radius on that corner.\n\n4 is still reaching below the baseline. I think you got all the others.\n\n"
    },
    {
      "time": "13 Apr 2008 — 2:14pm",
      "content": "Thanks again for the comments. I actually like the B, so I decided not to change it. I made a tiny tweak to the D, but it may not even be detectable. I also made changes to 2,4, and 5.\n\n"
    }
  ]
}
