{
  "id": "44173",
  "title": "The Creative Process",
  "forum": "Design",
  "tags": [

  ],
  "content": "I worked for a small graphic design firm for a little less than three years. I was laid off last week due to lack of work in the studio and I was the only employee. While working for this studio my main focus was print production.  \nThe few times I was allowed to take a stab at designing something, the two creative directors shot it down or made drastic changes to my designs.\n\nSo, I’m basically going back in time and need to sell myself again, and like before my last job I have only a very small portfolio. I’ve been struggling with re-creating my stationary/portfolio package for a couple days now.\n\nI’m trying to make the ultimate new resume to start, but I have designers block.  \nI have some stuff I started, but it doesn’t look great right off and that discourages me very badly.\n\nI just sit and stare at the screen and freeze up. Then I look at other designers online and see their awesome stuff and then I look at mine and it looks so flaccid and lacking.  \nI just keep thinking “maybe I just suck at design...maybe I should just be a secretary...”\n\nBut in my heart I want to be a designer. My boyfriend reminds me that I have a talent for art and that I have made cool designs in the past. But hearing it from him over and over is hard to believe after a while. So he pointed me to this site and said that he had seen some respectable people here that could give it to me straight.\n\nSo finally, please help, if you could, to get me out of this rut.  \nAny info, stories, etc. you guys could contribute is greatly appreciated.\n\nThanks, and hope to talk here often.\n\n [‹ Type Battle 21: FontStruct](http://web.archive.org/web/20080705155345/http:/www.typophile.com/battle21 \"Go to previous forum topic\") [Good typography, interfering designers, or just dumbing down? ›](http://web.archive.org/web/20080705155345/http:/www.typophile.com/node/44134 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705155345/http://www.typophile.com/user/29524\" title=\"View user profile.\">darmock</a>",
  "time": "<br>",
  "uid": "29524",
  "comments": [
    {
      "time": " 12.Apr.2008 8.50pm",
      "content": "<cite><br>\nI just sit and stare at the screen and freeze up.<br>\n</cite>\n\nI know exactly what you mean, I’ve been there many times.  \nAt the risk of sounding trite, I’d suggest that you don’t sit at the screen at all. For a lot of us that can end up either shutting down all creativity, or steering us towards creating something stale.\n\nInstead - sit down at a table with a sketch pad and pencil and just draw, doodle, scribble, etc. Even if you’re “not an illustrator”, the act of making marks on blank paper can stimulate creativity. Just try to push yourself to make marks on the paper, no matter how “outside the envelope” they seem, and see what you end up with. You may end up with beginnings of ideas you didn’t know you had, or it may even put ideas in your head that you can then jump on the computer to execute.\n\nDon’t give up, good luck.\n\nJason C\n\n"
    },
    {
      "time": " 12.Apr.2008 8.51pm",
      "content": "oh and I forgot to ask - “darmock?”  \nIs this an obscure Star Trek TNG reference?\n\nexcuse me while I go hide my inner geek again.\n\nJason C\n\n"
    },
    {
      "time": " 12.Apr.2008 9.02pm",
      "content": "Thanks, I’ll give it a shot.\n\nSokath, his eyes uncovered\n\n"
    },
    {
      "time": " 12.Apr.2008 9.16pm",
      "content": "Hi Darmock,\n\nThe danger with sitting solely in front of a computer is that what you make is very heavily influenced by the computer’s capabilities. We end up being restricted by the way computers work. I’m not saying that there’s stuff you can’t do on the computer, but certain things are more difficult to do than others, and as a result these things come less fluidly when you are trying to be nothing but fluid whilst coming up with ideas. Pen and paper remove so many barriers when pouring the contents of your quivering brain out into the world.\n\nI can’t draw for peanuts but the beginning stages are meant to find good ideas, and not necessarily look good. So I suppose you just have to look past the appearance to begin with if it looks crud, and focus on the idea behind it.\n\n-Rafe\n\n"
    },
    {
      "time": " 12.Apr.2008 10.04pm",
      "content": "Are ’ideas’, or the lack thereof, the problem? Or, is the problem how to visually ’voice’ an idea?\n\n"
    },
    {
      "time": " 13.Apr.2008 7.24am",
      "content": "Hi Harmock,\n\nI second Jasonc: Just seat down and draw something and it will get you thinking. I too worked for many other people that would change and contract and stretch and flip my designs, and they all got changed by the unexkilled supervisor or the client. Sometimes I have a impression that graphic design is the big BULL of all arts; nonetheless you, “we” chosen it to be our craft. Don’t give up, just keep on going, just try to do something genuine. I do look at other peoples designs sometimes when I need a idea, and I realized that when you do look at others designs, the best is look back to the ’old guys’.\n\nI suppose you got laid off because the biggest BULL of all times is just upon us: I too god laid off, but this time around I chose to go back to letterpress, cause it reminds me the kid fun of getting the little blocks together to produce a mould.\n\nI am sure you will get your stuff together and move on: Have you considered going ’solo’?\n\nCheers\n\nAndré\n\n"
    },
    {
      "time": " 13.Apr.2008 8.15am",
      "content": "Hiroshige,\n\nI have had only a couple ideas, but mostly its been straight designers block. I’m trying the working away from the computer idea now.\n\nAGL,\n\nYes, the downturn in the economy is the reason for the “Reduction in Force” that the design firm had to do. I was assured that it was not my print production work that was the reason, but the lack of clients and inability to continue paying me.\n\nI will go back and look at some of the “old guys” and see if they give me inspiration.\n\nI don’t have a client base to be able to go solo and I have no idea how I would begin to market to start getting clients. I think I know enough good printers in the area who know my quality production work and would be happy to work with me if I had clients, but this is an area I’m not sure I’m ready to explore.\n\n"
    },
    {
      "time": " 13.Apr.2008 9.20am",
      "content": "Forget the paper. Do some thinking before that. Formulate some kind of design brief for yourself, stop obsessing on this project and then let the incubation period do it’s work. Then sit down with paper, or the computer or whatever you are comfortable with and execute that great idea that just came from nowhere…\n\nAt least that’s how it works for me.\n\nBest of Luck!\n\npbc\n\n"
    },
    {
      "time": " 13.Apr.2008 9.20am",
      "content": "Explore. You will be surprised that in fact it IS possible. Be yourself. It os OK to work for someone else, but: the pay has to be good. These days it seems impossible, living you with the solo option. Good Luck!\n\n"
    },
    {
      "time": " 13.Apr.2008 12.58pm",
      "content": "I’m a hypocrite for giving advice.... But as a freelancer who’s been agonizing over Making An Awesome Website since last August and still has nothing presentable online: don’t be too much of a perfectionist! It’s easier to work with something than a blank piece of paper or a blank screen.\n\nNow maybe I’ll go take my own advice....\n\nGood luck!  \nBeth\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 13.Apr.2008 1.07pm",
      "content": "If the design is stuck, work on the writing.\n\n"
    },
    {
      "time": " 13.Apr.2008 1.36pm",
      "content": "You’re giving yourself a pretty hard time about your own stationery/identity.\n\nAs a project, this is probably the hardest one to undertake, even when you’re totally killing briefs day to day. Designing stuff for yourself is always a nightmare, the client is really fussy, never 100% happy, and will probably decide they hate it once it’s back from the printers.\n\nSeriously though - i would write yourself a brief, a really structured one, and tackle the project as if it were for a client. Set out key objectives, define the target audience, set a budget etc. then use this brief as a benchmark to judge your designs against, as opposed to just asking yourself wether you think they’re good or not.\n\nA great book for someone in your position is ’How To Be A Graphic Designer Without Losing Your Soul’ by Adrian Shaughnessy. (amazon will sell it) - don’t be put off by the title, it really is an inspirational read (as well as a beautifully designed book)\n\nGood luck\n\nJ\n\n"
    },
    {
      "time": " 13.Apr.2008 10.01pm",
      "content": "Iam confused.\n\nYour trying to create an identity system for your portfolio?\n\nIs this necessary even. Keep it simple. Pick a typeface you used a lot in the past three years and show how you mastered it. Apply this to your resume and portfolio. Dont try to come up w/ a whole new identity for your interviewer. That could take months and may not be your best work.\n\nSince you were working for the last three years you should have enough work and experience to easily get a job. If you were doing ad resizes and stuff like that just include them in your portfolio talk about how you were able to fit the copy and imagery in. This is important thing to learn and important for future employers to see. Your usually going to be interviewed by the art director so he/she isnt going to expect you to be creating everything for them. Thats what they are for and your going to make your way up just pay your dues. Your developing your decision making skills. Its like a game of tetris. You know!\n\nDont be so down on yourself. It will only make design harder. Believe in yourself. We all doubt our skills, its why people get so insecure and competitive in this field.\n\nYou can DO IT!\n\n"
    },
    {
      "time": " 13.Apr.2008 11.52pm",
      "content": "_I have had only a couple ideas, but mostly its been straight designers block. I’m trying the working away from the computer idea now._\n\nIdeas are cool, they’re such a groove aren’t they? I believe ideas, and the pursuit there of, define the individual and underpin a democracy. They’re something which comes up from within. They’re born through inspiration. And to be inspired is a powerful thang.\n\nUnfortunately, I’m on the other side of the coin darmock. My life is utterly bombarded by ideas. I can’t seem to keep up, I’ve come to a point where I just jot them down, number them, and move on to the next one. It feels like I’m being pushed - driven by the idea.  \nMost anything can trigger ’inspiration’, and if you want to push yourself, and force inspiration, then try to think of a subject matter and what form that that subject matter could take. And that form could be anything from elegant to crude - think in terms of texture and relationships.\n\nI’m beginning to ramble...\n\n"
    },
    {
      "time": " 14.Apr.2008 6.45am",
      "content": "Design is not just about about the end product.  \nTaking many of the biggest names be they contemporary or historical most of them were not technical perfectionists or masters of the art.\n\nWhat defines good work is beyond the appealing side of the eye candy which may be laid out before us.\n\nThis could all be seen as a bit too much of a brainiac approach and the debate theory versus practice is neverending in itself; but one must do research before going to the drawing board.\n\nNot to give you a lesson in the basics of creative design but it’s primordial to generate ideas before you can lay them out. Some go by it by keyword searching, looking at other peoples work, doodling etc.  \nThere are so many ways, some are good for x and others for y. You need to find yours.  \nPersonally I do a lot of background research when working on projects, and most of my “key” ideas come when I’m not in the process ( often in the evening or middle of the night ... sometimes when out shopping etc) ... so writing material is with me at all times.\n\nSorry if I am off track in my comment.\n\n"
    },
    {
      "time": " 14.Apr.2008 8.27pm",
      "content": "Thanks everyone! You’re comments and insight have been very helpful.\n\n"
    },
    {
      "time": " 15.Apr.2008 10.20am",
      "content": "Admitted, it’s a bit of a mechanical style, but usually take a some pieces of millimeter paper and start writing out the main paragraphs on it, while rotating the paper 90 degrees every now and then. After a few tries, i’ve usually come up with a grid that’s worth drawing a wireframe on top of it. Then i take it from there. It’s a nice exercise that gets me going whenever i am “blocked”.  \nMaybe i am getting too close to the creativity vs. technique discussion here, but whenever i find myself saying i am “blocked”, i am often just procrastinating —ignoring my very own skills.\n\n"
    }
  ]
}
