{
  "id": "44174",
  "title": "Fresh Dog food logo...",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello,  \nFirst of all I am an absolute newbie to logo-design...or any kind of design.  \nI do have some basic AI skills and I’m trying to help my younger brother design a logo for his small business; A fresh dog-food delivery that he wants to start this summer.  \nI decided not to use an image of an actual dog because A: I don’t know to draw one and B: It wouldn’t be very original. So I’ve decided to go with the bowl instead.  \nI have an idea of making it look like retro-50’s logo and this is what I came up with so far:  \nI would really appreciate your input...keep in mind I am not a designer, just trying.  \nThank you.\n\n ![](http://web.archive.org/web/20081011042521im_/http:/www.typophile.com/files/cb_3493.jpg)\n\n [‹ Interior Design Logo Critique](http://web.archive.org/web/20081011042521/http:/www.typophile.com/node/44558 \"Go to previous forum topic\") [Logo for German Job Agency ›](http://web.archive.org/web/20081011042521/http:/www.typophile.com/node/44307 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011042521/http://www.typophile.com/user/29526\" title=\"View user profile.\">YuriP</a>",
  "time": "<br>",
  "uid": "29526",
  "comments": [
    {
      "time": " 12.Apr.2008 9.15pm",
      "content": "Is that supposed to read “Central Bark”? If Cetral is actually the name, it just comes across as a typo - kinda like Banknorth naming a division of their company Bancnorth. It just looks like a giant mistake.\n\n"
    },
    {
      "time": " 12.Apr.2008 9.38pm",
      "content": "EileenB , you’re right. It’s late...and after stearing at it for so long I didn’t even notice :) got it fixed now. thanks.\n\n"
    },
    {
      "time": " 13.Apr.2008 3.39am",
      "content": "doesn’t really scream “fresh” to me.\n\n—————  \n**Paul Ducco**  \n [Brand Design Melbourne](http://web.archive.org/web/20081011042521/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 13.Apr.2008 6.36am",
      "content": "It makes me think of the Warner Brothers logo.\n\n"
    },
    {
      "time": " 13.Apr.2008 6.50am",
      "content": "Yah...ok, colors definitely need to change. What about the whole whole concept? Basically I want the bowl to radiate, but perhaps that’s a bad idea on itself.\n\n"
    },
    {
      "time": " 13.Apr.2008 8.19am",
      "content": "If the lines coming from the bowl are intended as “radiant,” they shouldn’t have shadows. Kinda get a “fang” feel from them now.\n\nThe whole thing looks faded - more contrast in value and/or hue is needed.\n\nSeems like the space shapes you’ve created for the text will make fitting text nicely very difficult.\n\n"
    },
    {
      "time": " 13.Apr.2008 9.07am",
      "content": "Ok, so I scrapped the whole vintage look. How about this.  \nMy idea is to use rays coming from the bowl, as space for text (website, motto, etc).  \nI am not sure about the font though. Should it be thicker?  \nAlso the paws, are supposed to represent that dog licked the bowl clean and walked away...am I trying too much here?  \nThanks again for everyone’s input. Much appreciated.\n\n ![](http://web.archive.org/web/20081011042521im_/http:/www.typophile.com/files/SunBurst_4489.jpg)\n\n"
    },
    {
      "time": " 13.Apr.2008 1.49pm",
      "content": "A logo is not a template for other text. A logo is needs to be static and scalable, and this is neither. I think you were closer to a logo with the first one, but why don’t you start by going to your local pet supply store and looking at all the logos.\n\nNotice the simplicity of the logos you find, and the way they could appear comfortably at the top of and invoice, a small product label, or on a poster, and still be legible. Like most company identities, [this Iams logo consists of three parts.](http://web.archive.org/web/20081011042521/http:/spcacincinnati.org/pages/images/iams_logo_web.jpg) The paw print is the logo, the word IAMS is the logotype, and “Good for Life” is their tag line.\n\nNotice, in your green sample, that the paw prints would become blobs if you printed them any smaller? And the website would be a blur? That’s a huge problem.\n\nI like the retro idea, and for what it’s worth, I also liked your original color pallet. The font and the “rays” don’t work at all, though.\n\n"
    },
    {
      "time": " 13.Apr.2008 3.57pm",
      "content": "EileenB, thanks for the insight. As I said, I’m learning as I go, so this is really helpful. Here is my latest attempt. A friend of mine was kind enough to draw a dog..now I just need to figure out how to use it best.\n\n ![](http://web.archive.org/web/20081011042521im_/http:/www.typophile.com/files/vault_5949.jpg)\n\n"
    },
    {
      "time": " 14.Apr.2008 9.49am",
      "content": "Make it even simplier, Just use a dog face, have “Central” above the head and “Bark” below. Go to a local pet store and buy a publication about dogs and you will get an idea for your dog head,\n\n"
    },
    {
      "time": " 15.Apr.2008 11.44am",
      "content": "I like the idea of a bowl. I think that’s something good to work with.\n\nStandard logo advice:  \nTake a pencil to paper and draw some ideas before getting on the computer.  \nFocus more on the form and the text without worrying about color. Use only black first and then add color later.\n\nhonk if you love the status quo\n\n"
    },
    {
      "time": " 15.Apr.2008 3.42pm",
      "content": "honk\n\n"
    },
    {
      "time": " 22.Apr.2008 6.01am",
      "content": "_“honk”_\n\nseen the bumper sticker?\n\nback on topic ... how’s it going?\n\n—————  \n**Paul Ducco**  \n [Design Studio Melbourne](http://web.archive.org/web/20081011042521/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
