{
  "id": "44189",
  "title": "Information Design Graduate Degree Programs",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello, I am currently in the process of applying for Information Design Graduate programs for the Fall of 2008. The main institute I am looking at right now is the University of Reading in England. Thoughts on this school? Any other suggestions?\n\nI’m also wondering what people’s opinions on taking a Graduate program for a subject you’re interested and fluent in vs taking a program you are interested in but not overly fluent.\n\nThanks for all your help! I sincerely appreciate any input you have.\n\n [‹ Chevin companion](http://web.archive.org/web/20080907032242/http:/www.typophile.com/node/44294 \"Go to previous forum topic\") [pictogram for the interwebs? ›](http://web.archive.org/web/20080907032242/http:/www.typophile.com/node/44396 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907032242/http://www.typophile.com/user/17134\" title=\"View user profile.\">cmcd</a>",
  "time": "<br>",
  "uid": "17134",
  "comments": [
    {
      "time": " 16.Apr.2008 7.12am",
      "content": "\\> I’m also wondering what people’s opinions on taking a Graduate program for a subject you’re interested and fluent in vs taking a program you are interested in but not overly fluent.\n\nI can’t opine on the Reading program, but for your quoted question: I think that a graduate program is considered a master-y level, and this suggests a solid basis of knowledge in the field. Most masters programs require a considerable amount of prior knowledge, generally acquired through an undergraduate degree.\n\n"
    },
    {
      "time": " 20.Apr.2008 4.51am",
      "content": "The London College of Communication runs a Graduate course specifically aimed at people who have a passion for info/graphic design but who have a degree which is not necessarily in a related feel. They aim not only to train you in the requires skills and harness your passion but also to allow you to bring new thoughts and approaches from your old discipline. LCC has an excellent reputation and my personal experience of it was very good.\n\nWill\n\n"
    }
  ]
}
