{
  "id": "44180",
  "title": "Ethics & Teaching Fontlab",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello all, first-time poster, though I’ve been a subscriber for awhile. I am teaching my Typography II class FontLab basics in order to create their own typeface. A student asked if they could start from an existing typeface and make changes to create their own font. I didn’t have an answer to this ethical dilemma so I’m turning to you for help. What do you say, Typophiles?\n\nMany thanks for your feedback!\n\n [‹ Typography for furiture store ads](http://web.archive.org/web/20081205192934/http:/typophile.com/node/44292 \"Go to previous forum topic\") [Engraved Patterns (Banknotes & Stocks) ›](http://web.archive.org/web/20081205192934/http:/typophile.com/node/20517 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205192934/http://typophile.com/user/9059\" title=\"View user profile.\">jevans4</a>",
  "time": "<br>",
  "uid": "9059",
  "comments": [
    {
      "time": " 13.Apr.2008 11.25am",
      "content": "1. Legally, check the font licence (EULA) to see what is permissable, as this varies with different foundries.\n\n2. From an educational perspective, the merit of mashing up other people’s work into something you can call your own is somewhat dubious. Sure, cut and paste is a bona fide part of digital media, and has been canonized in faces such as Dead History, Fudoni, etc., but it’s not the best place to start when you’re learning. Drawing glyphs in a BCP application is the basic skill of font making.\n\n"
    },
    {
      "time": " 13.Apr.2008 11.31am",
      "content": "Nick, thanks for your input. The class has been working with hand-drawn type as well as characters drawn in Illustrator so I was hoping the students would opt for creating something of their own design. I will dissuade them from the “cut and paste” strategy for this project, thanks.\n\n"
    },
    {
      "time": " 13.Apr.2008 11.44am",
      "content": "There is also this AIGA [.pdf](http://web.archive.org/web/20081205192934/http:/www.aiga.org/resources/content/3/5/9/6/documents/aiga_2fonts_07.pdf) resource available.\n\n"
    },
    {
      "time": " 13.Apr.2008 11.50am",
      "content": "Thanks AS, this is a great resource!\n\n"
    },
    {
      "time": " 13.Apr.2008 11.53am",
      "content": "Julie,  \nI think it would send the wrong message to your students to allow them to start with another persons work. It also does not teach them much about drawing type. It might be more instructive for them if they were to try making a FontLab drawing of their own hand drawn type to see how different the tools feel?\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2008 12.31pm",
      "content": "Thanks Chris. The work we’ve done up to this point in the class has been experimental and they’ve really flexed their creative muscles so I was a bit sad when posed with the question of whether this student could start from an existing face. My gut instinct was, “Absolutely not! Are you a designer or what? What do you think we’ve been working toward all this time?” (smack upside the head) I do not want to send that message. Good suggestion, thanks!\n\n"
    },
    {
      "time": " 13.Apr.2008 1.47pm",
      "content": "Font making applications can blend two fonts to come up with a “tween”.  \nThis may be considered a surreptitious form of “point piracy”, which is forbidden by font EULAs.  \nHowever, it is also a use of digital media that creates new ways of designing to emerge, and is “true to materials”, a central principle of many traditional art forms, so the issue is more complex than if tweening were just a cheat.\n\nThere are some fonts available online, eg. Bitstream Vera, which have licences permitting modifications.\n\nSo perhaps if a student were to come up with a novel and meaningful idea involving transforming an exisiting font, and it wasn’t just a lazy gloss, that would be worth considering?\n\n"
    },
    {
      "time": " 13.Apr.2008 2.00pm",
      "content": "I am in complete disagreement here.\n\nThis project is for a class, not for sale. A class is a learning environment. There is no way better way to truly understand the effectiveness of a typeface than to tear it apart into it’s root elements and rebuild it from your own perspective. Questions abound about why one typeface is more effective than another. What angles are used, and why? What is the rational behind the length of ascenders and descenders? What curves are chosen? Are the curves derived from circles or compound curves? How are the serifs constructed? Would a non serif approach work with the rest of the face? What elements place the typeface in a historical context? How did a type designer learn and feed on the work of others? These are all questions that can be explored through taking an existing typeface and reworking it.\n\nThe whole concept of plagiarism has been completely distorted over the last few decades. We live in a world consisting of billions of people, and the past is filled with more billions. It is egotistical to an extreme to think that you can always come up with a new work that doesn’t owe a debt to the past. Over the millennia the greatest artists have studied, appropriated and built upon the work of others. This is how they learned, this is how they grew, and with growth came wisdom and the ability to transform the borrowed work into something greater.\n\nBesides the obvious example of Shakespeare, who didn’t write an original plot line in his life, there are myriad other examples:\n\n- We can say nothing but what hath been said . . . Our poets steal from Homer . . . . Our storydressers do as much; he that comes last is commonly best.  \nRobert Burton\n- Copy from one, it’s plagiarism; copy from two, it’s research.  \nJohn Milton\n- Take the whole range of imaginative literature, and we are all wholesale borrowers. In every matter that relates to invention, to use, or beauty or form, we are borrowers.  \nWendell Phillips\n- And what there is to conquer  \nBy strength and submission, has already been discovered  \nOnce or twice, or several times, by men whom one cannot hope  \nTo emulate—but there is no competition—  \nThere is only the fight to recover what has been lost  \nAnd found and lost again and again: and now, under conditions  \nThat seem unpropitious. But perhaps neither gain nor loss.  \nFor us, there is only the trying. The rest is not our business.  \nTS Eliot\n- If you refuse to study anatomy, the art of drawing and perspective, the mathematics of aesthetics, and the science of colors, let me tell you it is more a sign of laziness than of genius!  \nSalvador Dali\n\nIt is not plagiarism for a student to learn from those who came before. To always insist that a student must concentrate on “originality” is not an asset. It is not an ethical dilemma to see how something works and what you might change, and hopefully, improve on it.\n\nYour dilemma as a teacher is to determine if the student is actually thinking and learning about something. Are your students growing in their understanding of the past and making their way into the future? If they are, then they deserve praise. If the student is merely parroting something back, that is plagiarism. It is thought that counts.\n\n"
    },
    {
      "time": " 13.Apr.2008 3.10pm",
      "content": "<cite>So perhaps if a student were to come up with a novel and meaningful idea involving transforming an exisiting font, and it wasn’t just a lazy gloss, that would be worth considering?</cite>\n\nThat might be appropriate if the a project’s goal is simply to produce a working font, but I think that it falls short if the goal of the project is to learn to design type. One learns a hell of a lot about the design of a letter by drawing it, even if the drawing process is just a digital tracing. But when an existing font is modified, all of the hard work is done; one need only apply a new idea. Such a project might be appropriate if the goal is to explore mashing up ideas, but that doe not appear to be the case here.\n\nAs a student working on a new typeface based on an existing design, my working process has always been to redraw the existing letters myself and build on that. I constantly check my work against a digital version of the font I am using as a basis, which allows me to spot a lot of mistakes and answers many of my questions about why a font is put together the way it is. I could have saved myself a lot of time by just loading up the original and modifying it, but I wouldn’t have learned a thing about drawing letterforms, or proportions, or spacing or kerning. I would only have learned to dump my design ideas on top of anothers.\n\nI’ll now attack on Mr. Goen’s arguments for why the student should be allowed to do this: Picasso learned to draw in his father’s teaching method: copy from drawings, then draw sculpture, then draw from life. Would he have have ever made it to step two if he had simply fired up Photoshop, plugged in a Wacom tablet, and started scribbling over scans of old master drawings?\n\n"
    },
    {
      "time": " 13.Apr.2008 3.14pm",
      "content": "David, I agree with your principles, but think that you have the means backwards.\n\nYes, it is good to analyze and re-use the past, but “start[ing from] from an existing typeface and mak[ing] changes to create their own font” is not the way to do it.\n\nMost of the things you cite as worth knowing about the mechanics of a font can be best determined by measuring: if one merely cuts and pastes or uses transform tools, one will remain oblivious to such qualia, except perhaps in a very intuitive sense.\n\nThe way to learn a skill is by practicing it oneself. If for instance, one copies the metrics of one’s typeface from those of another face, what does one learn about metrics? If, however, one measures the sidebearings for “v”, “l” and “o” in several established faces, and notes the relative proportions, and deduces the strategy behind this, and applies it to one’s own font, then one learns something.\n\n"
    },
    {
      "time": " 13.Apr.2008 7.22pm",
      "content": "There’s nothing ethically wrong with modifying someone else’s typeface unless that person has some stupid exclusive “right” to its modification. Unfortunately, most people here won’t agree with me about how copyright is obselete.\n\nPlaying with existing fonts as David suggests would be much more interesting and probably more educational than starting from scratch, but it probably wouldn’t lead directly to the creation of a new typeface.\n\nIt would be great if students didn’t have to make their own typefaces so soon.\n\n"
    },
    {
      "time": " 13.Apr.2008 7.33pm",
      "content": "Nick,  \nI don’t understand your objection, as I believe we are saying the same thing. “if ... one measures the sidebearings ... and deduces the strategy behind this” is exactly what I was suggesting. That’s what I meant by “tearing it apart.” I said nothing about cut and paste, I said to rework the typeface, analyze and transform it.\n\nI think a fairly useless exercise would be to ask a student to create the metrics for a new font without first understanding how metrics came to be and were used in the past. Therefore, you deduce the strategy and learn from it. Even if what you learn is that you don’t agree with the strategy.\n\nMr Puckett,  \nSimilarly, I never said anything about “scribbling all over” anything. How does “copy from drawings” differ from what I was suggesting as a beginning point?\n\n"
    },
    {
      "time": " 13.Apr.2008 8.12pm",
      "content": "If the class is on type design, they probably should not start from something that already exists.\n\nBut <cite>typography</cite> includes more than type design. There have been a lot of times in my work where I had to draw up some characters for a font that didn’t have them — anything from a set of old-style numbers, small capitals in italic, Old English sorts — eng, yogh, Carolingian et, etc, Yoruba and Pan-Nigerian characters, and on & on.\n\nSome foundries allow the end user to modify fonts — Adobe is an obvious example — and it is a useful skill to have.\n\nSo I’d say it depends on what you lump into <cite>typography</cite>\n\n"
    },
    {
      "time": " 13.Apr.2008 8.16pm",
      "content": "If you want to learn to swim, you have to get into the water. It won’t help to just try on someone else’s wet bathing suit.\n\nChrisL\n\n"
    },
    {
      "time": " 14.Apr.2008 1.56am",
      "content": "dsgoen — <cite>This project is for a class, not for sale. A class is a learning environment. There is no way better way to truly understand the effectiveness of a typeface than to tear it apart into it’s root elements and rebuild it from your own perspective.</cite>\n\nThis would be an interesting project indeed — but a research project, not a creative one. The student should be made aware of the difference. For example, the student could do this kind of research _and_ design something original, non-derivative. Finally she/he would present the design together with the research results (maybe a booklet with text and illustrations), and be able to explain why she/he made this or that decision in her/his original design.\n\n<cite>Your dilemma as a teacher is to determine if the student is actually thinking and learning about something. ... It is thought that counts.</cite>\n\nFully agreed. My conclusion would be a different one, though.  \nSince we cannot read otherones’ thoughts, they need to leave some marks from which we can infer that something happened in their minds. And derivative work makes it hard for the teacher to judge whether its qualities stem from the work from which it was derived, or if they represent the students’ own insights.\n\n"
    },
    {
      "time": " 14.Apr.2008 3.18am",
      "content": "What is wrong with the fonts in the AIGA pdf? Is this some kind of a type joke?\n\nJanic\n\n"
    },
    {
      "time": " 14.Apr.2008 6.31am",
      "content": "When I taught Fontographer I never let students just open a font and mess with the points - no learning in that. On the other hand, I let them use printout of a font or a xerox copy of a specimen from a book as a starting point to alter, improve(?) or adapt. They then had to scan back in and work in Illustrator and import or trace in Fontographer. Much like making a digital version of a lead font but the original might actually be another digital font that has been altered.\n\n"
    },
    {
      "time": " 14.Apr.2008 6.39am",
      "content": "@jevans4: A student asked if they could start from an existing typeface and make changes to create their own font.\n\nThis would be a bit like starting from an existing novel and making changes to create your own novel. You might learn something from this exercise (perhaps mechanical editing skills), but I don’t think it would teach you much about how to write a novel.\n\n"
    },
    {
      "time": " 14.Apr.2008 7.48am",
      "content": "From Wikipedia:\n\n[http://en.wikipedia.org/wiki/Typography](http://web.archive.org/web/20081205192934/http:/en.wikipedia.org/wiki/Typography \"http://en.wikipedia.org/wiki/Typography\")\n\n<cite>Typography is the art and techniques of type design, modifying type glyphs, and arranging type. Type glyphs (characters) are created and modified using a variety of illustration techniques. The arrangement of type is the selection of typefaces, point size, line length, leading (line spacing) and letter spacing.</cite>\n\n<cite>Typography is performed by typesetters, compositors, typographers, graphic artists, art directors, and clerical workers. Until the Digital Age, typography was a specialized occupation. Digitization opened up typography to new generations of visual designers and lay users.</cite>\n\nOnce again, it depends on what the class is about; \\*typography\\* is not synonymous with \\*type design\\*\n\n"
    },
    {
      "time": " 14.Apr.2008 8.37am",
      "content": "I think the objection of experienced type designers here is not to learning from existing fonts, but rather to what kind of exercise is likely to be most instructive.\n\nJust taking the digital glyphs from an existing font, and eg, changing the serifs, is not the most instructive exercise. This is because there is so much ’DNA’ in the font that the student is not going to become aware of in this way.\n\nA more instructive exercise would be to take a good font that is not shown to the students, and giving them some control characters: o n O H. Then have them try to draw three or four other characters in the font consistent with the style. Enough that they can set a few words—you could try ’sex me’ (and in caps) just to get their attention :) Then compare words set in their newly drawn characters with the original good, professional font. And do this for a few varied styles. Now that is going to be a lot more instructive, I think, than the ’Frankenstein’ exercise.\n\n"
    },
    {
      "time": " 14.Apr.2008 11.59am",
      "content": "When I took type design in college I found it very useful to study existing characters to learn the general rules about glyph design. I don’t think I would have gotten the same knowledge from starting with existing characters in fontlab.\n\n"
    },
    {
      "time": " 14.Apr.2008 6.35pm",
      "content": "“Unfortunately, most people here won’t agree with me about how copyright is obselete.”\n\nNeither will most courts of law. Certainly not US ones.\n\nIn any case, I would echo a few things people have said earlier, and add a couple of thoughts.\n\n1) Modifying an existing digital font is not actually a very educational experiene.\n\n2) Opening and \\*studying\\* existing well-made fonts is a useful learning exercise (assuming it’s permitted by the font license).\n\nIndeed, I’d suggest a good exercise being to point students at two well-done fonts and one poorly-done one, and try to analyze what is wrong with the bad one. Some people will say there’s no such thing as a bad font. They’re wrong.\n\nIf it were permitted by license, you could give them a poorly executed font and ask them to “fix” it. You could even point at what’s not done correctly (e.g. bad spacing, improperly made outlines, poor kerning, whatever). That seems like it might be a useful educational experiene.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 15.Apr.2008 4.35am",
      "content": "Licensing, copyright and fair use issues aside, I think students, not to mention everyone else on the planet, have opportunity their whole lives to open up a font and alter it if they choose. In an educational situation, I’ve always told the students this, and then made sure they learned how the fonts got there by compelling them to make their own from scratch. This being the only chance they are likely to have supervision of such an effort, I wouldn’t waste the opportunity.\n\nCheers!\n\n"
    },
    {
      "time": " 15.Apr.2008 7.46am",
      "content": "Instead of relying on the fonts of others I have students appropriate working methods and begin by drawing fundamental characters (HOV hov) while using established fonts as a means of controlling basic proportional relationships. Seeing these relationships among characters and understanding how to apply them to their own work is an essential component of education in graphic design. But they cannot modify another’s work whether that other is a professional designer or another student. Appropriating another’s working method is fine but appropriation of another’s work is grounds for dismissal.\n\n"
    },
    {
      "time": " 15.Apr.2008 10.30am",
      "content": "<cite> 2) Opening and *studying* existing well-made fonts is a useful learning exercise (assuming it’s permitted by the font license). <cite></cite></cite>\n\nFortunately, if copyright law gives you the right, the restriction in the font license is probably unenforceable.\n\nThis thread began with ethics. Would you consider a prohibition on study ethical (keeping in mind “the Progress of Science and useful Arts”)? If your answer is yes, is it applicable to all intellectual property, or just to fonts?\n\n"
    },
    {
      "time": " 15.Apr.2008 11.37am",
      "content": "_Would you consider a prohibition on study ethical?_\n\nYes, if it contravenes the terms by which the study material is made available to students.\n\n"
    },
    {
      "time": " 15.Apr.2008 12.03pm",
      "content": "<cite> Yes, if it contravenes the terms by which the study material is made available to students. <cite></cite></cite>\n\nYou cannot contravene illegal terms.\n\n"
    },
    {
      "time": " 15.Apr.2008 1.50pm",
      "content": "As I understand it (and I’m not a lawyer) the person who writes a contract can put any conditions they want into it, no matter how seemingly absurd, and if someone else agrees to the contract (in order to acquire access to the property), then they are bound by the terms.\n\nIf they think the terms are unreasonable, then they shouldn’t agree to the contract—in which case they won’t get the property and won’t be able to study it.\n\nIf the terms are illegal, in the sense that the licensor claims rights which they don’t possess, that’s another matter.\n\nBut in that case, wouldn’t you consider it unethical of the licensee to agree to the contract in order to gain access to the property, knowing that he/she was going to ignore the terms of the contract?\n\n"
    },
    {
      "time": " 15.Apr.2008 3.06pm",
      "content": "Hey, I agreed with Nick on something! :)\n\nI’m not a lawyer, and anyone looking to violate a contract they’ve agreed to (such as their font license terms) on the grounds that they think it’s illegal should definitely consult a lawyer first.\n\nBasic info on the subject is here:  \n [http://en.wikipedia.org/wiki/Illegal\\_agreement](http://web.archive.org/web/20081205192934/http:/en.wikipedia.org/wiki/Illegal_agreement \"http://en.wikipedia.org/wiki/Illegal\\_agreement\")\n\nOther reasons a contract may not stand up:  \n [http://en.wikipedia.org/wiki/Contract#Setting\\_aside\\_the\\_contract](http://web.archive.org/web/20081205192934/http:/en.wikipedia.org/wiki/Contract#Setting_aside_the_contract \"http://en.wikipedia.org/wiki/Contract#Setting\\_aside\\_the\\_contract\")\n\nNote that the relevant law presumably differs from one country to another....\n\nT\n\n"
    },
    {
      "time": " 15.Apr.2008 3.11pm",
      "content": "There are several theories of contracts that explain why agreements must be honoured. Some are based on autonomy, some on efficiency, some on “ethics”. But consumer contracts are different in many respects. The state (without which there would be no copyright) can intervene where it sees fit and alter the terms of the contract. For example, your relationship with your bank is governed by regulations, your “agreement” notwithstanding. When you buy your gym membership, you might “agree” to waive certain liabilities, yet the law does not give effect to your “consent”. Similarly, it is wrong to assume that a student who acquires a font, or borrows materials from a library, or purchases a CD at the store, has only those rights stipulated in some “license”. Sometimes the license is effective, sometimes it isn’t.\n\n"
    },
    {
      "time": " 16.Apr.2008 7.10am",
      "content": "\\> There is no way better way to truly understand the effectiveness of a typeface than to tear it apart into it’s root elements and rebuild it from your own perspective.\n\nI will not dispute that there is some benefit to this practice. It is partially how I would teach typography (if I were skilled enough in the field to consider myself as teaching material). But the tearing apart and rebuilding should only be considered as a learning step, probably with a limited number of glyphs from any one font, and covering a wide range of fonts: a comparison of seven different ’a’ glyphs from different fonts in different categories, for instance.\n\nWhen the students are skilled to the point of creating a first complete typeface, then they should be producing original creations, or if copying, then copying from an out of copyright printed document, the way a revival face might be created. Copying from a modern computer font is problematic in two ways: ethics, plus how do you know they created all the glyphs, and didn’t just steal some.\n\n"
    },
    {
      "time": " 16.Apr.2008 8.20am",
      "content": "There is only one chance to approach something naively and discover the thinking process that is truly you and not someone else. The point is that you will truly learn more by making what you may deem “mistakes” than you will by doing it what others consider the “Right Way”. Don’t throw away this chance by picking apart someone else’s journey. There is no shortcut path so when you get “stuck” for a time, you will invent a unique path for yourself rather than go running back to see what that other guy did. If you do, you find a specific solution, not the path to all answers.\n\nChrisL\n\n"
    },
    {
      "time": " 16.Apr.2008 2.24pm",
      "content": "“Unfortunately, most people here won’t agree with me about how copyright is obselete.”\n\nThomas - I do not know what your profession is or what your skillset is, but presuming it is somewhat creative, how can you say that copyright is obsolete?! Copyright is the little protection that intellectual property or creative work has to protect it from all out plagiarism.\n\n"
    },
    {
      "time": " 16.Apr.2008 2.43pm",
      "content": "Thomas is a high school student.\n\n"
    },
    {
      "time": " 16.Apr.2008 4.02pm",
      "content": "Copyright and moral issues aside, the students should draw fresh outlines. Even if they started with someone else’s work (which is not uncommon in the industry), they should look at prints, and draw it from scratch. Otherwise they won’t be any closer to being type designers than when they started.\n\n"
    },
    {
      "time": " 16.Apr.2008 4.16pm",
      "content": "Locks on doors and EULA are for honest people. Pulling a watch apart at home and finding out how it works and not telling anyone, then everyone is happy. Pulling it apart then copying it or using the technology for your own profit... then you can expect a letter in the mail.\n\nFor a design student to pull a font apart at home, take notes and just observe.. depends on how it is pulled apart, typing in Illustrator then converting to paths...? Or opening in a font design package to evaluate. Though to build onto an existing font without approval is wrong.\n\nThough in this case if all of the ’Typography II class’ are creating their own ’an original?’, and the student in question is not, then that is cheating right?\n\n"
    },
    {
      "time": " 17.Apr.2008 1.13pm",
      "content": "In my experience the question your student raised usually comes up when the students feel insecure about their own ability to design type. When the task seems to daunting students seem to think that starting with a working set of characters will make their own design decisions easier. I have seen what happens next and strongly disagree. However, instead of even entering the discussion wether reverse engineering and plagiarizing other designers work is a creative, honorable and useful enterprise to boot I would suggest to react by making the whole undertaking more accessible. Prepare smaller bites for the students and guide them through the process. Have them draw one character, then the next. In the critique discuss how the letterforms interact. If guided through the alphabet this way, digitizing the drawings will be a relatively small step and nobody will even think to start with stolen outlines.\n\nIf learning FontLab and the principles of type design at the same time seems too complex for that particular class I recommend using FontConstructor ( [http://www.fontconstructor.com/](http://web.archive.org/web/20081205192934/http:/www.fontconstructor.com/ \"http://www.fontconstructor.com/\")) for their first project and then transitioning to Fontlab with the next assignment. This application is way easier to master, it’s free and encourages modular, object oriented design.\n\nDiscourage plagiarism by snubbing the very notion as below par for any designer. Shoplifting outlines is shameful and will be punished harshly.\n\n"
    },
    {
      "time": " 17.Apr.2008 6.41pm",
      "content": "Hannes, thanks for your suggestion. I’ll check out FontConstructor. Thanks to those who thoughtfully responded.\n\n"
    }
  ]
}
