{
  "id": "44199",
  "title": "Google funny, or Google Ha Ha?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I search google on ’safari font embedding’ and get 1 (one) find, of a German language link...\n\nI search google on ’safari font embeding’ (and it asks me if I mean ’safari font embedding’), but in any case, it gives me 360,000 matches, or 359,999 more on the wrong spelling.\n\nHmmmmm.....\n\nCheers!\n\n [‹ Mardersteig](http://web.archive.org/web/20080905035419/http:/www.typophile.com/node/43401 \"Go to previous forum topic\") [white (or light coloured) text on a dark background ›](http://web.archive.org/web/20080905035419/http:/www.typophile.com/node/44117 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905035419/http://www.typophile.com/user/2969\" title=\"View user profile.\">dberlow</a>",
  "time": "<br>",
  "uid": "2969",
  "comments": [
    {
      "time": " 14.Apr.2008 7.22am",
      "content": "For me the figures are more like 38.000 vs. 380.000, but yeah, you’ve got a valid point there.\n\n[edit: typo]\n\n"
    },
    {
      "time": " 14.Apr.2008 7.30am",
      "content": "Probably has a lot to do with people’s typo’s and not a google error.\n\n"
    },
    {
      "time": " 14.Apr.2008 8.45am",
      "content": "What kind of idiot misspells font?\n\n"
    },
    {
      "time": " 14.Apr.2008 9.09am",
      "content": "Perhaps Google assigns less “weight” to a term when it thinks it is misspelled. Searching “safari font” brings back 600K results. In this case, it’s actually finding lots of cases where the word is misspelled within the indexed pages. That somehow complicates the matter.\n\n"
    },
    {
      "time": " 14.Apr.2008 9.54am",
      "content": "If you put the terms in quotes, you will get the same results as David did (except now there are two results returned — this one and the German one).\n\n"
    },
    {
      "time": " 14.Apr.2008 10.18am",
      "content": "But if you put “Safari font embeding” in quotes, you get only one result: this page.\n\nIt seems David was comparing the correct spelling in quotes to the incorrect spelling without quotes. Not so strange things looked odd, then.\n\nSearching for both strings without quotes gives me 310,000 results for the correct spelling, and only 1,360 results for the incorrect spelling, which seems more reasonable.\n\n"
    },
    {
      "time": " 15.Apr.2008 1.20am",
      "content": "Oisín, my quoted results were without quotes as well... Well, Google does some very weird stuff, I guess also your personal settings (as e.g. preferred language setting in your browser) will have an influence on the result as well.\n\n"
    }
  ]
}
