{
  "id": "44204",
  "title": "Arial in Movie Poster Typography?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Why must we be seeing more and more Arial in big-budget advertising and promotion? I see it more and more, and every time I do, a part of me dies. In some instances its small-time studios who don’t know better so I lay off a bit, but in many cases with big-budget studios like New Line Cinema doing this example of \"Pride and Glory\" I just don’t get why the desecration?\n\n[http://www.worstpreviews.com/images/posters/prideandglory/prideandglory1...](http://web.archive.org/web/20111229210728/http:/www.worstpreviews.com/images/posters/prideandglory/prideandglory1_large.jpg \"http://www.worstpreviews.com/images/posters/prideandglory/prideandglory1\\_large.jpg\")\n\n",
  "author": "<a href=\"/web/20111229210728/http://typophile.com/user/13429\" title=\"View user profile.\">wesmo</a>",
  "time": "<br>",
  "uid": "13429",
  "comments": [
    {
      "time": "",
      "content": "<cite>Why must we be seeing more and more Arial</cite>\n\nIt starts with \"A\"  \nYou have to scoll all the way to the \"T\"s to find Trajan.\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "<cite>Why must we be seeing more and more Arial in big-budget advertising and promotion?</cite>?\n\nBecause designers in California have better things to do than listen to pretentious designers who think it’s a crime to use Arial because Arial is just a modified Helvetica while using Helvetica is classic because Helvetica even tho Helvetica is just a modified Akzidenz.\n\nGet over it. Arial may not be great, but it isn’t the worst typeface out there, no matter how many times Erik Spiekermann and Ellen Lupton say so.\n\n"
    },
    {
      "time": "",
      "content": "Russell, nice :-)\n\n\\> I just don’t get why the desecration?\n\nPerhaps 3% of graphic designers know the history of Arial (at least ES's version as described in Helvetica), and of these maybe 4% care. So statistically no one cares.\n\nIn this case I think the poster works (the W-A spacing seems a bit off). I'd rank it in the top 5% of student work I've seen recently.\n\n"
    },
    {
      "time": "",
      "content": "Hi all...\n\nOn a design level, I personally think your linked example looks shocking! Not that there isnt a time and place for Arial i.e. Bloody UK based councils!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nRez\n\n"
    },
    {
      "time": "",
      "content": "Get over it. Arial may not be great, but it isn’t the worst typeface out there, no matter how many times Erik Spiekermann and Ellen Lupton say so.\n\nJames, there is a reason they say that. Open your eyes, and you'll understand as well.\n\n<cite>Perhaps 3% of graphic designers know the history of Arial (at least ES’s version as described in Helvetica), and of these maybe 4% care. So statistically no one cares.</cite>\n\nSii, This is exactly what is alarming. Young inexperienced designers are one thing, but who accounts for the experienced Creative Directors who approve them?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Open your eyes, and you’ll understand as well.</cite>\n\nNo, really, they’re just being elitist and pretentious. Knowing a little of the type industrys dirty laundry doesn’t make anybody special, and people with nothing better to do than get snotty about designers who use Arial really need to find something better to do.\n\n"
    },
    {
      "time": "",
      "content": "As we watched the latest Seinfeld movie, Bee, yesterday, it was fun to pick out all of the system fonts they used for different bits. In none of the instances did I think, \"eww, gross\", but more, \"hey that is fun\". I think it is always a matter of appropriate, and even then that in itself is subjective.\n\n"
    },
    {
      "time": "",
      "content": "To me, Arial represents a lack of thought. Why go with Arial (or Helvetica for that matter) when there is an abundance of typefaces that can actually complement the mood of the design.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "James, it just suggests poor craftsmanship (IMHO). There is nothing especially elitist or pretentious about not liking Arial. Sure, there could be a good case for using it sometimes, but generally that reason is that it's a bundled typeface that starts with \"A\". When I was a welder, I used to get a little snotting (in the nicest way of course) about other welders who couldn't weld a straight and even bead, or warped the piece they were working on. As a Screen printer I got a little snotty about sloppy registration, bad colour matches, improper squeegee pressure and so on. As a craftsman myself, I would rather be challenged to do a better job than be given a little slack for not trying very hard.\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "Very good observations Russell. I would also liken it to blowing your nose with diamond chain mail--- sure it will work in place of tissue, but it wont feel too good when ts done. It's hard to defend Arial and I dont know why anyone would, and for the creative gatekeepers to allow it, just really boggles me. Ignorance is bliss they say!\n\n"
    },
    {
      "time": "",
      "content": "\\>When I was a welder, I used to get a little snotting (in the nicest way of course) about other welders who couldn’t weld a straight and even bead, or warped the piece they were working on.\n\nI think the \"engineers\" responsible for hinting Arial in the early 90's probably felt the same way when looking at the hinting of Apple's TrueType Helvetica? Maybe? I recall early Web-design advice to avoid the italics in particular.\n\n"
    },
    {
      "time": "",
      "content": "I'm an equal opportunity hater.\n\nI don't much like Arial, but I actually like Helvetica even less. Univers and Akzidenz Grotesk I like a better than Arial, but they're not favorites, either.\n\n:P\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "The older I get the more astonished I am that everything—and I mean everything—isn't a whole lot worse than it is. The real question here is why didn't they use Sand or Blood of Dracula or Katfish or Jawbreaker? Honestly, I just can't understand it.\n\n"
    },
    {
      "time": "",
      "content": "Everything isn’t worse than it is? Huh?\n\nWhatever. The poster isn’t all that great. And that’s not just the choice of type but the typography in general.\n\n"
    },
    {
      "time": "",
      "content": "what bothers more is the use of three or four different typefaces for the same movie — absolutely  \ndifferent fonts in the trailer(s), the title sequence, the movie poster(s), the newspaper ads, and finally, the movie box.\n\n---\n\ncan you post some other movie posters that use Arial?\n\n ![](http://web.archive.org/web/20111229210728im_/http:/typophile.com/files/pride_5299.jpg)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20111229210728im_/http:/typophile.com/files/TheStrand_3595.jpg)\n\nSomeone once made a case that The Strand bookstore in NYC made a strong anti-design statement with Arial. In that case I was willing to be convinced. But not in this case.\n\nArial is a like margarine. No self respecting chef cooks with it even though it's widely accepted everywhere else. Arial is not just an evolution of Helvetica the way Helvetica is an evolution of Akzidenz. Arial is a sloppy copy of Helvetica, a poor counterfeit that has fooled a generation of PC users.\n\n"
    },
    {
      "time": "",
      "content": "This thread needs better crawlable keywords for posterity...\n\n**Tags:**  \n[] movie poster  \n[] pride and glory  \n[] edward norton  \n[] colin farrel  \n[] hollywood  \n[] needs to  \n[] fire  \n[] all the  \n[] art directors  \n[] immediately  \n[] oh wait, they already have\n\n"
    }
  ]
}
