{
  "id": "44215",
  "title": "This glyph: ~",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This thing makes me nuts: ~.\n\nThis “sort” was never a part of the ol’ California job case, and I’m wondering where it came from, what it represents, and whether or not it should ever be employed as an alternative for a hyphen, en, or em dash.\n\nI see it (mis?)-used more than I’d like to see it (at all), and I’d love to have some ammunition to stop the madness.\n\nPlease excuse me for not investigating this elsewhere (Chicago Manual of Style?) and taking the easy way out by asking the ’philes.\n\n [‹ A new Paradigm](http://web.archive.org/web/20080706083144/http:/www.typophile.com/node/44237 \"Go to previous forum topic\") [Californian | Expert font | Text figures vs. lining figures ›](http://web.archive.org/web/20080706083144/http:/www.typophile.com/node/44269 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706083144/http://www.typophile.com/user/18852\" title=\"View user profile.\">Koppa</a>",
  "time": "<br>",
  "uid": "18852",
  "comments": [
    {
      "time": " 14.Apr.2008 12.12pm",
      "content": "It can be used as sign for baptism like the asterisk for birth.\n\n— [astype.de](http://web.archive.org/web/20080706083144/http:/www.astype.de/)—\n\n"
    },
    {
      "time": " 14.Apr.2008 12.23pm",
      "content": "search - tilde wiki ...\n\nHit #1 [http://en.wikipedia.org/wiki/Tilde](http://web.archive.org/web/20080706083144/http:/en.wikipedia.org/wiki/Tilde \"http://en.wikipedia.org/wiki/Tilde\")\n\n"
    },
    {
      "time": " 14.Apr.2008 12.26pm",
      "content": "Bringhurst has it as a _swung dash_, despite it being named _asciitilde_ in a digital font. He says,\n\n“A stock keyboard character used in mathematics as the sign of similarity (a ~ b) and lexicography as a sign of repetition. [...] Not to be confused with the tilde.”\n\n"
    },
    {
      "time": " 14.Apr.2008 12.29pm",
      "content": "Also... [http://typophile.com/node/43305](http://web.archive.org/web/20080706083144/http:/typophile.com/node/43305 \"http://typophile.com/node/43305\")\n\n"
    },
    {
      "time": " 14.Apr.2008 12.51pm",
      "content": "It ain’t a tilde! A tilde is a diacritic.\n\n"
    },
    {
      "time": " 14.Apr.2008 1.00pm",
      "content": "Right. Not a tilde. That’s what I was thinking. I recognize it now as a mathematical symbol for similarity. In fact, I feel sort of dumb for not recognizing that without posting this post. I can also imagine it used as a symbol of repetition. Certainly not a hyphen, dash, or worst of all, a bullet. Thanks for answers.\n\n"
    },
    {
      "time": " 14.Apr.2008 1.22pm",
      "content": "In informal contexts I use it for approximately.\n\n(If that’s wrong, I don’t wanna be right.)\n\n"
    },
    {
      "time": " 14.Apr.2008 1.30pm",
      "content": "similarity ~ approximately ~ roughly ~\n\n"
    },
    {
      "time": " 14.Apr.2008 1.54pm",
      "content": "Absolutely ~ certainly ~ definitely. You’re swinging that swung dash now!\n\n"
    },
    {
      "time": " 14.Apr.2008 3.35pm",
      "content": "Koppa:\n\nYou are right: it never was in the California case, nor in any other case that had a “codified” layout, for those cases had space for far fewer sorts than digital fonts have. In a good book typography shop, though, you’d have found that swung dash in a “pi case” or a “math case” or a “side sorts” case. & each of those cases would have had its own layout, devised for the particular shop. The Linotype guy or the hand comp would know where to go get them.\n\nI doubt you will “stop the madness.” As people find cute little sorts like this one lurking in fonts, they’ll find ways to “decorate” work with them. Good luck.\n\npowers\n\n"
    },
    {
      "time": " 14.Apr.2008 3.49pm",
      "content": "My favourite use of the swung dash:\n\n:-O~~~\n\n- Lex\n\n"
    },
    {
      "time": " 14.Apr.2008 4.34pm",
      "content": "It is used in some computer programming languages, which is why it not only occurs in the ASCII character set, and hence almost all fonts, but also appears on the keyboard along with ^\n\n"
    },
    {
      "time": " 14.Apr.2008 4.48pm",
      "content": "I often see the swung dash used in dictionaries to stand in for the entry word in an example text.\n\nIn Korean, the swung dash is called “mulgyeolpyo (물결표; _wave mark_)”, and it is part of the standard set of punctuation defined in the standard orthography. It is mainly used to indicate a range of values, much like the en dash is used in English.\n\n1월 25일 ~ 2월 25일 (25 January – 25 February)\n\nLess frequently, it is also used to stand in for part of a text which is missing. In the following example, the swung dash functions as a “blank” in a multiple-choice question.\n\n우리는 ~를 탈 것이다.  \n1. 기차  \n2. 버스  \n3. 비행기\n\nWe will take \\_\\_\\_\\_.  \n1. the train  \n2. the bus  \n3. the plane\n\nOne of the frequent mistakes made by Koreans when writing in English (and I imagine other languages as well) is to use the swung dash as they are used to when writing Korean. It comes up all the time when I proofread English documents prepared by Koreans.\n\n"
    },
    {
      "time": " 14.Apr.2008 5.07pm",
      "content": "~ is handy for making things jump to the front of the cue in an alphabetical list for people who employ the AAAAAAAAAAAAAAAA Towing Co. filing method.\n\n-=®=-\n\n"
    },
    {
      "time": " 14.Apr.2008 7.01pm",
      "content": "It isn’t too far off what we use to use for negation in symbolic logic. And when I was in school, one ~ was never used for “approximately equal.” That can be found in the Unicode mathematical symbols area. And even one of them isn’t the same as an ACII tilde (& so is - the same as equals? - is half of =, after all).\n\nI suppose there is a term approximating “orthography” for symbols?\n\n(BTW, I think the question should be about the character, not the glyph. The question about ~ would be the same, whether in Helvetica or Minion.)\n\n"
    },
    {
      "time": " 14.Apr.2008 8.23pm",
      "content": "My sympathies Koppa, it must be galling to see this usage spread if you dislike it so. I myself like the curve itself and often use it in my paintings. Mathematically it could be a sine or cosine curve which outlines one wavelength of a wave function in physics. William Hogarth championed the curve in his 1753 book “An Analysis of Beauty” a treatise to fix “the fluctuating ideas of Taste”. According to this theory, S-Shaped curved lines signify liveliness and activity and excite the attention of the viewer as contrasted with straight lines. Hogarth’s term Line of Beauty has recently cropped up as the title of a novel, and is also called the Curve of Beauty in metal smith work.\n\nThe Victorians had another alliterative compound-name for the S-curve that I once knew but have since forgotten- anybody recall that?\n\nBy the way, isn’t it possible that its use as a substitute dash may have started in California, considering the question-like intonation some natives there use to end their sentences ? ~ perfectly mimicked by, er, the glyph in question.\n\n"
    },
    {
      "time": " 15.Apr.2008 2.03am",
      "content": "In some European linguistic texts its used to denote “vs.” or “cf.” or “relates to” between two linguistic examples (e.g. words; then usually set in italics) pretty loosly semantically, if you as me.\n\nAnd of course in dictionaries instead of writing the word discussed again, as already noted above.\n\nThough it seems to me, that dictionaries usually use a shorter “swung hyphen” sized sign, while those linguistic texts rather a longer “swung n-(or m) dash)”.\n\n"
    },
    {
      "time": " 15.Apr.2008 9.19am",
      "content": "Lots of good info. Wow and thanks.\n\nI stand corrected...I should have referred to it as a character, and not a glyph. (Transparently, I am more a typesetter than a typographer.)\n\nAs far as it being a pi character and not found in the CA job case...right. That comment wasn’t intended to disqualify the character completely...lots of the characters on our keyboards aren’t in that case...mostly the mathematical ones. Rereading my initial post, I can see how that may have been misunderstood. I was just trying to stir things up ~ have a little fun.\n\nAlso, am now wondering about the validity of it’s use to represent similarity, as Mr. Ellertson points out in his comments above.\n\nThanks again to all for contributing.\n\n"
    },
    {
      "time": " 15.Apr.2008 10.04am",
      "content": "The ~ is commonly used in mathematics to mean “equivalent to” or “similar to” (see for example the [wikipedia entry](http://web.archive.org/web/20080706083144/http:/en.wikipedia.org/wiki/Tilde#Mathematics) or olho’s comment above).\n\n"
    },
    {
      "time": " 16.Apr.2008 12.14pm",
      "content": "In some \\*nix system, the swung dash is used to denote the “home” folder of the current user, e.g. ~/myfile.txt.\n\n"
    }
  ]
}
