{
  "id": "44221",
  "title": "AS Level Graphics Exam Review",
  "forum": "Design",
  "tags": [

  ],
  "content": "Here goes, In a rather brief previous post i explained my situation. Im a 17 year old student that probably makes me quite young to be on his site (or so i imagine), and as i said in other post i needed help on books to read to influence/help me !  \nI got 1 reply and followed up on it, and from then i have had a strange sort of faith in this forum and community (brown nosing is over)\n\n[http://www.mediafire.com/?32zuxrlz3h6](http://web.archive.org/web/20080829235638/http:/www.mediafire.com/?32zuxrlz3h6 \"http://www.mediafire.com/?32zuxrlz3h6\")\n\nIn the above link is a pdf file to my Final Piece, its meant to be an example of a magazine, based on the likes of GQ and G2 (that rather useless pullout in The Guardian.) It would mean alot to me if any of you could look over this and guide me/tell me how to do better and produce better works, and work more efficiently.\n\nAlso at this time i find it quite fitting to raise the issue of piracy, im not proud but the software i produced my work on was a pirate version of InDesign CS3. Apparently i can be disqualified from my exam for using a pirated version of software ?\n\nAny help/answers would be greatly appreciated guys.Also at this point id like to point out the text in the ’cars’ pages is lifted and edited. Im not claiming it to be my own. Thanks\n\n:)\n\nAlso, please remember im only 17. I’m no design pro\n\n [‹ I Need Help Creating My First Font](http://web.archive.org/web/20080829235638/http:/typophile.com/node/44245 \"Go to previous forum topic\") [Font help for Interiors/Homes magazine ›](http://web.archive.org/web/20080829235638/http:/typophile.com/node/44291 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829235638/http://typophile.com/user/27035\" title=\"View user profile.\">steve.balderson</a>",
  "time": "<br>",
  "uid": "27035",
  "comments": [
    {
      "time": " 14.Apr.2008 2.01pm",
      "content": "The layout is nice, better than a lot of what I see from college students. That said, a little white space would be nice. I realize that these jam-packed layouts are common in men’s magazines (even moreso in the UK!) but really, give the reader a spot to rest.\n\nBut your details are horrible. I have no idea what you’re doing with the beginnings of paragraphs, because it changes for every paragraph.Punctuation is missing all over the place. You aren’t aligning the baselines of your columns of type across the pages. There isn’t enough space around the drop caps. You random shift between justified and ragged type. You have no drop cap or other indication that the section about the Mariner is a new section, breaking the form established on the previous page. You aren’t using lining figures. You probably don’t need to indicate the source of your text and images on the page unless your instructor is demanding it, and if you do, don’t call it out, make it smaller and unobtrusive. On the cover, get that giant price out of the dot and tuck it somewhere less annoying. Move the bar code, too. And get all of the type away from the edges.\n\nYou really need to learn to self-edit. Print it out, sit down with a red pen and circle everything that’s incorrect or inconsistent. Then fix it all and do it again and again until there’s nothing to circle.\n\nAs for your software situation, either buy Indesign or keep quiet about it. You aren’t doing yourself any favors by discussing it online.\n\n"
    },
    {
      "time": " 14.Apr.2008 2.07pm",
      "content": "James, it helps alot. Ill do as you recommend here then ill re-upload what ive done.\n\nThanks\n\n"
    },
    {
      "time": " 14.Apr.2008 6.16pm",
      "content": "The cover is a bit heavy on top. If you really want to put that much text on the cover, try photoshop the photo and put the text “underneath” the model(I assume you know how to do that?).  \nOther than the beginnings of paragraphs, I’m also seeing a lot rivers. It doesn’t look very attractive.  \nJust my 2 cents.  \nbtw, just say you used your school’s indesign.\n\n"
    },
    {
      "time": " 15.Apr.2008 12.40am",
      "content": "Thanks Marcia, i like that idea of putting the text behind the cover girl, so im masking that all in now !\n\n"
    },
    {
      "time": " 15.Apr.2008 1.23am",
      "content": "“You aren’t aligning the baselines of your columns of type across the pages.” Problem one, watch that.\n\nTry more space around the photos.\n\nOn the cars, using the type on top (sparingly/partly) of the photos is used often in mens mags.\n\ntry some color. a red box with white type. Some red type on the cover.\n\nSome line elements would be nice. something heavier than the ONE you have.\n\nI like the contents page. You spent some time on that.\n\nline up the Hollywood with the type below it, or don’t. but not in between. look at all the alignment on that page. but good use of hierarchy.\n\nalso most mens mags use MULTIPLE typefaces(like you did on the cover) try mixing it up a bit. Larger Point size and random serif to sans serif to grunge in your titles.\n\ntry something other than grey on the cover.\n\nsorry if that was too much.\n\n"
    },
    {
      "time": " 15.Apr.2008 6.46am",
      "content": "No,nothing is too much. I like all the input i can get.  \nHowever, i disagree with you saying to put red type on the front cover, it just stands out like a sore thumb and looks out of place. BEcause the cover girl is the first thing you see i dont think i could still keep the amount of text there and hide it behind her, as this just distorts the text and makes it illegible.\n\nI’ll get some more space in around the pictures, and im editing and re-writing the articles now. Ill upload another copy when i’ve finished my modifications. Thanks also for bringing my baseline problem to my attention, i hit my head as i read it !\n\nSteve\n\n"
    },
    {
      "time": " 16.Apr.2008 7.25am",
      "content": "In addition to what was already said, your type needs room to breath. I notice that the spacing between elements is often cramped. In some cases there is more space between adjacent letters than between adjacent lines.\n\n"
    }
  ]
}
