{
  "id": "44245",
  "title": "I Need Help Creating My First Font",
  "forum": "Design",
  "tags": [

  ],
  "content": "So I am sure that a topic like this already exists. I just can’t find it so I am posting it again.\n\nI am Working on my first (full) font in my third year of graphic design studies. I can’t seem to find any examples of x height in relation to uppercase L serifs. I’m creating very thick title face with hairline terminals and large hairline serifs, huge “balls” ie r a j f y etc.\n\nBut I’m having trouble finding a resource for em square examples. I need to see some letters (like L in relation to x height) on a proper em square and can’t find one. I should have a book but I don’t. So does anyone know of any? am I gonna have to pony up and buy a book?\n\nSecond question. Is there a basic free/shareware fontlab type program? There is one classroom at my school that is in use basically all the time and I will need many hours (as I’m sure you know) once I have finished all my drawings. And once I am done I am gonna repost all of them in the critique section for a good old fashion ass kicking.\n\nthank you.\n\n [‹ Looking for Lucina](http://web.archive.org/web/20080828113538/http:/www.typophile.com/node/44321 \"Go to previous forum topic\") [AS Level Graphics Exam Review ›](http://web.archive.org/web/20080828113538/http:/www.typophile.com/node/44221 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828113538/http://www.typophile.com/user/23967\" title=\"View user profile.\">Alex Jones</a>",
  "time": "<br>",
  "uid": "23967",
  "comments": [
    {
      "time": " 15.Apr.2008 12.58am",
      "content": "Also I’m afraid my type might be boring/already done/average. I’m kinda freakin out. Is it acceptable to scan some of my sketches and post them in the critique section, or should I at least pen them first?\n\n"
    },
    {
      "time": " 15.Apr.2008 4.24am",
      "content": "” I need to see some letters (like L in relation to x height)”  \nAny normal application that composes type can show you how the “L” is sized to the em, by setting the L in consecutive lines with zero leading. The relative size of L to x is as easy as setting them at the same point size beside each other.\n\nI might be missing the true question, but I don’t think one needs a book to learn about sizing a font to the em, or l.c. to uppercase.\n\nAlso, this is hardly the time to be “freakin’ out” if you have only drawn them on paper so far. I.E. give your freak some time to grow to the out stage as you computerize the font. :-)\n\nCheers!\n\n"
    },
    {
      "time": " 15.Apr.2008 5.39am",
      "content": "David’s right: the proper time to freak out about how boring you think your design is is when you’re just about finished and getting set to release it. ;-)\n\n"
    },
    {
      "time": " 15.Apr.2008 11.03am",
      "content": "[http://fontforge.sourceforge.net](http://web.archive.org/web/20080828113538/http:/fontforge.sourceforge.net/ \"http://fontforge.sourceforge.net\")\n\nExtremely free. It’s not a drop-in-place substitute for FontLab, however—it has its own way of doing things—and runs poorly on MS Windows (solution being not to use MS Windows).\n\n"
    },
    {
      "time": " 15.Apr.2008 9.19pm",
      "content": "TypeTool is $99, and has versions for both PC and Mac.\n\n"
    },
    {
      "time": " 16.Apr.2008 10.00am",
      "content": "A typical cap height is about 70% of an em. For a 1000-unit em square, that would be something in the vicinity of 700 units.\n\nCheers,\n\nT\n\n"
    }
  ]
}
