{
  "id": "44243",
  "title": "Seattle Splash & Dash",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Being that it doesn’t rain enough over here, and being that said celestial aqua clearly has some impact on quality font development (how else to explain that Adobe and MS live there?) I’ve decided to take a trip up to Seattle, imminently. Actually my reasons are largely non-typographic, but of course any significant travel calls for the rousing of the local font freaks, so I’m hoping that some of you... Seattlenos are game. I will be free\\* at least this coming Friday night, probably Sunday morning, as well as possibly late Saturday night. And just maybe Thursday night, if you promise not to overly frighten the non—type-geeks (non-type—geeks?) I’ll be hanging out with at that time. Right. As you were.\n\n\\* Requisite asterisk.\n\nhhp\n\n [‹ TypeCon2008](http://web.archive.org/web/20080704191436/http:/www.typophile.com/node/44645 \"Go to previous forum topic\") [Ticks ›](http://web.archive.org/web/20080704191436/http:/www.typophile.com/node/44606 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704191436/http://www.typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": " 14.Apr.2008 11.30pm",
      "content": "I don’t know about this. You think you can disappear for all of this time and then just pop back in thinking you’ll still have friends here? ;^)\n\n"
    },
    {
      "time": " 15.Apr.2008 12.46pm",
      "content": " ![](http://web.archive.org/web/20080704191436im_/http:/www.typophile.com/files/troll_4085.jpg)\n\n"
    },
    {
      "time": " 15.Apr.2008 12.53pm",
      "content": "Seattle is my favorite city in the US. If I didn’t have adorable nephews in this area then I’d live there in a heartbeat.  \nUntil I get over my need to be near my family I’ll have to settle for visits a few times a year.\n\nHave fun.\n\nhonk if you love the status quo\n\n"
    },
    {
      "time": " 15.Apr.2008 1.44pm",
      "content": "Where are you staying wheile in town? I can probably break free for a pint (or four) Friday night.\n\nCheers, Si\n\n"
    },
    {
      "time": " 15.Apr.2008 9.41pm",
      "content": "Katherine, it will be my first time there, and my only worry -being an Angeleno- is that the apparent fixture of rain will damped my experience. Otherwise I have high expectations, especially since apparently even New Englanders seem to think the seafood there has no equal. Well, except maybe Japan.\n\nSimon, if I tell you too much, I will have to kill you. Actually I’ll be staying in... Redmond (major hint) on Wednesday and Thursday nights, while Friday and Saturday are still open. I might actually end up over the border on Saturday. What number can I call you at? Please email me if you like: hpapazian\\_at\\_gmail\\_dot\\_com. And that goes for anybody else who’d like to hook up.\n\nhhp\n\n"
    },
    {
      "time": " 15.Apr.2008 10.38pm",
      "content": "Alas, I am too far away to get mixed in. Send me some email! Bring me up to date. I suggest you eat at Nishino. Or possibly the Harvest Vine. I think they are both still upholding their high standards. Si, have you been?\n\n"
    },
    {
      "time": " 16.Apr.2008 6.45am",
      "content": "You’re not picking a good weekend weather-wise to be here sadly. I’ll mail you my #’s but I’m going to be away until Friday afternoon - so will also check back here when i get back.\n\nCheers, Si\n\n\\>Si, have you been?\n\nNot recently. :-(\n\n"
    },
    {
      "time": " 16.Apr.2008 9.02am",
      "content": "Simon, I’ll call you Friday PM.\n\nBTW, I’ll be in Vancouver on Saturday night (hopefully in  \nthe company of Jim Rimmer) so that’s another city to rouse...\n\nhhp\n\n"
    },
    {
      "time": " 16.Apr.2008 10.06am",
      "content": "Tell Jim I said “hi” — he’s a real sweetheart.... ;-)\n\n"
    },
    {
      "time": " 16.Apr.2008 10.21am",
      "content": "<cite> &gt; (hopefully in the company of Jim Rimmer)</cite>\n\nThat should be a real treat. Enjoy.\n\nThe key to dealing with the Pacific NW weather is to have decent rain gear. Once you get accustomed to wearing plenty of Goretex®, you’ll be fine.\n\n— K.\n\n"
    },
    {
      "time": " 16.Apr.2008 10.57am",
      "content": "I think all that rain stuff is a big hoax used to scare away Californians. When I was there last Summer for TypeCon the weather was sunny and delightful everyday without a drop of rain!  \nEnjoy your visit, Hrant :-)\n\nChrisL\n\n"
    },
    {
      "time": " 26.Apr.2008 8.21am",
      "content": "Eben, thanks to your Harvest Vine recommendation Simon and I ended up at Txori\\*, the more casual sister. The portion sizes were like footnotes, but the tastes were like... Raffia Initials.\n\n\\* [http://www.txoribar.com/](http://web.archive.org/web/20080704191436/http:/www.txoribar.com/ \"http://www.txoribar.com/\")\n\nOn Saturday morning I drove up to New Westminster (through a freak snow storm - very pretty though) and although I was prepared to be impressed by Jim, I was still impressed. We spent an intense five hours using the pantograph (actually two of them), casting type, and punchcutting. Rarefied experiences that I might never again have; lessons that will stay with me for a long time. Some photos:\n\nFirst, Jim, in one corner of his workshop. On the left side of the photo is one pantograph, for going from a cardboard inset drawing of about 9 inches to a lead plate of about 3; on the right side is the other pantograph, for going from the lead plate to an actual-size matrix.\n\n ![](http://web.archive.org/web/20080704191436im_/http:/www.typophile.com/files/Jim_4852.jpg)\n\nThe lead plate, from a wonderful drawing by Jim. You should see the “g”!\n\n ![](http://web.archive.org/web/20080704191436im_/http:/www.typophile.com/files/plate_5793.jpg)\n\nThe matrix (16 pt):\n\n ![](http://web.archive.org/web/20080704191436im_/http:/www.typophile.com/files/mat1_5231.jpg)\n\nAnd finally the cast type!\n\n ![](http://web.archive.org/web/20080704191436im_/http:/www.typophile.com/files/cast_4413.jpg)\n\nPart 2.  \nA punch of a “J” that I made. Puts Neuland to shame! :-/\n\n ![](http://web.archive.org/web/20080704191436im_/http:/www.typophile.com/files/punch_4532.jpg)\n\nAnd the matrix struck from it:\n\n ![](http://web.archive.org/web/20080704191436im_/http:/www.typophile.com/files/mat2_6690.jpg)\n\nSomething funny happened to the punch, and the resultant matrix impression, upon striking, probably due to the punch being not fully hardened. In the end my “J” had become italic! Two glyphs with one stone, eh? Enjoy.\n\nhhp\n\n"
    },
    {
      "time": " 26.Apr.2008 10.59am",
      "content": "Hey! I didn’t know that Jim made punches too!\n\nI’m glad you got some good eats. :-)\n\n"
    },
    {
      "time": " 26.Apr.2008 11.24am",
      "content": "AFAIK he doesn’t cut punches in his usual production process, but he does know how it’s done. My impression is that a combination of pantography and the burin can often make the most sense.\n\nhhp\n\n"
    },
    {
      "time": " 26.Apr.2008 10.30pm",
      "content": "What about the old fashioned punch made with the counter punch then? I am thinking of the Van Krimpen argument here BTW.\n\nThose are great images. Was that made with a point and shoot or a dedicated lens? Or a fancy gizmo?\n\n"
    },
    {
      "time": " 27.Apr.2008 8.02am",
      "content": "Well, some purists think even the counterpunch is blasphemous! They say the file and burin are all you should use. I’m no fan of the pantograph-only approach (even though even that can make sense sometimes) but type design is a craft, and as such needs to serve people more than serve one’s own artistic urges, so efficiency is very important. The pantograph, in a hybrid process with manual “post-processing” can be a great contributor to optimal results. In the wrong hands however it can debase type design, like how optical scaling went out the window pretty quickly.\n\nAs for the photos, it’s amusing -and gratifying- that you’re reading so much into my camera setup! :-) They were taken with my lowly Ricoh RDC-7\\*, no tripod, lousy lighting. On a wooden tray in my lap. The secret is the RDC-7’s amazing macro, which can get as close as 1 cm (less than 1/2 an inch). Even with it’s very modest 3.7 megapixel resolution that translates to over 2000 dpi. With a tripod and proper lighting it can do quite an amazing job, especially for its age. And it has some other unique features. I love the little thing, although it’s getting a bit ragged.\n\n\\* [http://www.ricoh.com/r\\_dc/past/rdc/7/img/index\\_1.jpg](http://web.archive.org/web/20080704191436/http:/www.ricoh.com/r_dc/past/rdc/7/img/index_1.jpg \"http://www.ricoh.com/r\\_dc/past/rdc/7/img/index\\_1.jpg\")\n\nhhp\n\n"
    }
  ]
}
