{
  "id": "44256",
  "title": "Help me protect vintage Blackletter tile on building front.",
  "forum": "Blackletter",
  "tags": [
    "Blackletter"
  ],
  "content": "I work as a graphic designer for a small publisher in a historic building in downtown Richmond, Virginia. The original occupant was The Dietz Press—a book printer that got its start in 1890. The building may actually be the same age or close. And the building still has the original ceramic tile sign lettering on the front. The typeface is a charming blackletter glazed in black on a warm yellow. If you Google this address: 145 E. Cary St., Richmond, VA, and switch to \"Street View,\" you'll see the building and the blackletter (Zoom in). (that address isn't actually ours, but it's the one that takes you directly to the building image in Street View.\n\nThe publisher loves the building's historic charm but he is also looking for a way to get the company's name on the front. He's considering having a sign created that would cover the blackletter. He doesn't plan to destroy the old tile, just have it covered with our name so as not to confuse patrons and passers by.\n\nI feel there must be a way to get our name on the front but still keep the vintage tile. So I'm looking to propose an alternative sign idea. If our sign doesn't go directly in front of the tile, it probably shouldn't be close—otherwise the message would get muddled. I'd love some feedback on how to gracefully incorporate a new sign with the building front. Past occupants have settled with window clings. Perhaps that's good enough, but I have a feeling my publisher won't just settle.\n\n",
  "author": "seventy7",
  "time": "15 Apr 2008 — 6:50am",
  "uid": "10355",
  "comments": [
    {
      "time": "15 Apr 2008 — 8:04am",
      "content": "Greetings seventy7. I am a type and graphic designer living in, of all places, right here in Richmond. Can I be of assistance. I would hate to see the beautiful “wall,” as I called it, covered up. I have a number of Dietz letterpress publications from way back when and they even did some letterpress for me in the 80's. I used to stop and look at it on my way to Poor Richard's for Friday libations, probably before your time. It is a great typographic landmark here in Richmond. Go take a look at the Farmer's Market if you want to be upset... had wrought iron letters done and put the “A's” up backwards... dim wits! Let me know. Michael\n\n"
    },
    {
      "time": "15 Apr 2008 — 8:51am",
      "content": "A fellow Richmonder! I feel like I've heard your name before. Do you know Tyler with Virginia Living magazine\\> That's where I work...\n\nAnyway, I am certainly interested in your thoughts on how to design a sign we could add to our building while not disturbing the tile. Would you be willing to consult with us? Here's my email: [roywilhelm@capefear.com](mailto:roywilhelm@capefear.com)\n\n"
    },
    {
      "time": "15 Apr 2008 — 9:10am",
      "content": "Hi seventy7, an option you guys might want to keep in mind while laying out your new design is to make use of a laser cutting technology.\n\nI just bought a new toy. It's a Gravograph laser cutter/engraver. Sweet little thing :) So far, I've been cutting up some acrylic and mylar. I've cut 1/2\" acrylic no probs.\n\nHope that helps in some way.\n\n"
    },
    {
      "time": "15 Apr 2008 — 9:22am",
      "content": "Thanks, Hiroshige. I'll check them out.\n\n"
    }
  ]
}
