{
  "id": "44260",
  "title": "Can you help? I need a specialist typeface.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m about to have a large amount of text laser cut from plastic. Problem is when i create an outline from any font i have in illustrator the outline is too detailed for the cutter size (0.5mm). The solution would be a single stroke typeface that when i convert to outline would be just 1 line so the laser would only have to cut a single line. Does a font like this exist or how can i convert my type into a single stroke graphic.  \nCheers.\n\n [‹ Does everyone come across font file \"sharing\" like this often?](http://web.archive.org/web/20080905210413/http:/www.typophile.com/node/44278 \"Go to previous forum topic\") [Guttenberg - BBC 4 ›](http://web.archive.org/web/20080905210413/http:/www.typophile.com/node/44252 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905210413/http://www.typophile.com/user/29629\" title=\"View user profile.\">RobertJones</a>",
  "time": "<br>",
  "uid": "29629",
  "comments": [
    {
      "time": " 15.Apr.2008 9.01am",
      "content": "Do you mean that a single character has too many points when you outline it? What font are you using? How detailed is too detailed?\n\n"
    },
    {
      "time": " 15.Apr.2008 9.10am",
      "content": "Would these [monoline](http://web.archive.org/web/20080905210413/http:/www.myfonts.com/browse/keyword/monoline/) fonts help?\n\n"
    },
    {
      "time": " 16.Apr.2008 4.29am",
      "content": "I need a font that when converted into outline in illustrator will it be a single path through the centre of the letter rather than the path being an outline? Will monoline do this? Is there software to do this? Or a function in Illustrator?  \nThanks\n\n"
    },
    {
      "time": " 16.Apr.2008 9.40am",
      "content": "_... outline ... will ... be a single path_\n\nThat’s impossible.  \nHowever, the “hairline” weight of many typefaces were most likely created by “stroking” or “parallel pathing” such a path, so you could contact foundries with that kind of type, and see if they can help.\n\n"
    },
    {
      "time": " 16.Apr.2008 9.49am",
      "content": "“rather than the path being an outline”\n\nThis is confusing. A path is an outline.\n\n"
    },
    {
      "time": " 16.Apr.2008 9.59am",
      "content": "A path is only an outline if its ends connect (and it isn’t straight).\n\n"
    },
    {
      "time": " 16.Apr.2008 10.00am",
      "content": "Is this what you mean by outline vs path?\n\nI think AutoCad uses some fonts that are just lines that can be easily read by a laser. But they generally have a very mechanical appearance.\n\n ![](http://web.archive.org/web/20080905210413im_/http:/www.typophile.com/files/stroked_4700.gif)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080905210413/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    },
    {
      "time": " 16.Apr.2008 10.15am",
      "content": "I was thinking the same thing Ivan. Perhaps a plotter font. It’s the same concept, just a plotter uses a marker and not a laser.\n\nAnyway, I assumed most cnc machines or laser cutters were programmed based off an autocad mechanical. I guess I’m wrong.\n\n"
    },
    {
      "time": " 16.Apr.2008 10.18am",
      "content": "I think the poster is looking for something that would be akin to a stencil sort of approach where the counters were handled in such a way that the entire outline for each glyph was but a single _path_.\n\nNot strictly “stencil,” since that design approach often includes multiple paths, but that idea. The bridges could conceivably be of negligible width, so as to be invisible, but still meet the technical requirement being described.\n\nThat’s how I read this.\n\nBut I’m not aware of any existing font of this nature.\n\n"
    },
    {
      "time": " 17.Apr.2008 7.15am",
      "content": "Thanks for all the help. I’m talking to laser cutting technicians as we speak.\n\n"
    }
  ]
}
