{
  "id": "44278",
  "title": "Does everyone come across font file \"sharing\" like this often?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was for one reason or other lead to a message board for the band Muse, wherein the discussion was someone asking for the font Muse uses for their logotype, which is frutiger:\n\n[http://board.muse.mu/showthread.php?t=2591](http://web.archive.org/web/20131012183252/http:/board.muse.mu/showthread.php?t=2591 \"http://board.muse.mu/showthread.php?t=2591\")\n\nThe conversation quickly turns to people requesting / offering to share the font files with others. This prompted me to sign up for the message board just so I could post a little comment (at the end) about font awareness. I was rather disturbed by such a blatant violation (especially by the second to last poster who seems to have posted it Frutiger for download). Has anyone come across stuff like this before? It would seem to me that it's like trying to bail the titanic out with a teaspoon. If so, what measures do you usually take?\n\nAnyway, none of these people will be likely to read (or care about) my comment because the thread is from a while ago.\n\n",
  "author": "Chipman223",
  "time": "15 Apr 2008 — 12:05pm",
  "uid": "26908",
  "comments": [
    {
      "time": "15 Apr 2008 — 12:11pm",
      "content": "<cite><br>\nI was rather disturbed by such a blatant violation (especially by the second to last poster who seems to have posted it Frutiger for download).<br>\n</cite>\n\nI'm sure this happens in lots of places, and you're right that its tough to fight against.  \nI'd think that if the font file was actually posted on the boards, depending on the site, you could report that post as abuse and ask the administrators to take it down, since it's essentially promoting software theft.\n\nJason c\n\n"
    },
    {
      "time": "15 Apr 2008 — 1:43pm",
      "content": "Yes, it's all over the place. At the same time, it appears to be kids wanting to decorate their own fan sites. So, it's wrong, but probably not the biggest fish to go after.\n\n"
    },
    {
      "time": "15 Apr 2008 — 4:26pm",
      "content": "I agree it's not the worst case scenario, and i know we can't go around finding all the cases of this, but it's just a real annoyance. Just seeing each instance of even asking for a single font from a typeface, you just tally in your head: there's $29, there's another $29.\n\nI guess you instill respect for digital media when you can download a song of itunes for a dollar. To the uninformed, it's not so far fetched to not understand type costs a lot more. I guess the number of replies to this thread suggests that nobody here is all that surprised.\n\n"
    },
    {
      "time": "16 Apr 2008 — 5:07pm",
      "content": "Those are just teeny weenies designing sigs. They can't even afford Photoshop so what make s you think they would have bought that font?\n\n"
    },
    {
      "time": "17 Apr 2008 — 6:27am",
      "content": "\\> I guess you instill respect for digital media when you can download a song of itunes for a dollar.\n\nDownloading a song for a dollar is not a problem. The problem is that most music is downloaded free. I asked my college class of 30 students on Tuesday if anyone had ever downloaded and paid for a song. They acted like I was crazy. To them songs are free and only crazy people would pay for them.\n\nAll iTunes does is allow those people who don't want to steal music a chance to do so.\n\n"
    },
    {
      "time": "17 Apr 2008 — 6:49am",
      "content": "I wasn't really saying that Itunes is a problem. Itunes is my sole source of music purchases. Logically, a thirteen dollar with thirteen tracks comes out to about that. I was more or less saying (albeit unclearly) that if the maximum you would ever pay for a song was a dollar, it's hard to see a teenager willing to pay even $20 for one weight. I mean to say, that they probably have no indication of the work that goes into a typeface, or it's net worth (i mean OBVIOUSLY a single song by My Chemical Romance is worth more than a \"stupid\" font).\n\nPlease read that sentence with a sarcastic tone.\n\nThe node recently created about Letterhead Fonts indirectly leads to this instance, which is a much worse violation than I seem to have found:  \n [http://www.gfxworld.org/fonts/new\\_fonts\\_5.html](http://web.archive.org/web/20131012183252/http:/www.gfxworld.org/fonts/new_fonts_5.html \"http://www.gfxworld.org/fonts/new\\_fonts\\_5.html\")\n\nI guess the summation of this thread is: They're kids, and what harm can they really do? There are bigger fish to fry. Okay, I agree, but i think it's still death by 1,000 cuts to some degree.\n\n"
    },
    {
      "time": "17 Apr 2008 — 7:03am",
      "content": "The same kids who share the fonts are also giving each other music. The font is then used to make their own cd covers, badges etc.\n\nI've tried to give a lecture or two on fonts on those sites and give a link to a foundry, but there's never any reaction.\n\n"
    },
    {
      "time": "17 Apr 2008 — 9:24am",
      "content": "\"Just seeing each instance of even asking for a single font from a typeface, you just tally in your head: there’s $29, there’s another $29.\"\n\nExcept that it's not. Maybe 1 in 50 folks would have paid for the font had there been no other way to get it.\n\nI understand the reaction, but one needs to realize that it's rarely, if ever, a direct 1 to 1 correlation between lost sales.\n\n\"Itunes is my sole source of music purchases.\"\n\nEww. DRM is bad. ;o)\n\niTunes is my last resort only if eMusic and Amazon don't have the DRM free version.\n\n"
    }
  ]
}
