{
  "id": "44284",
  "title": "Gourmet Restaurant - Menu Design",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "So I've been commissioned to design a series of promotional pieces for a local gastro-pub for their new endeavour in the form of a gourmet burger service. The brief was to be posh, intelligent and inviting - I hope I've delivered.\n\nRegards,\n\nPaul\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.png](http://web.archive.org/web/20130803195033/http:/typophile.com/files/Picture%202_70.png) | 194 KB |\n| [Picture 2.png](http://web.archive.org/web/20130803195033/http:/typophile.com/files/Picture%202_71.png) | 726.87 KB |\n\n",
  "author": "paul.w",
  "time": "15 Apr 2008 — 2:16pm",
  "uid": "21493",
  "comments": [
    {
      "time": "15 Apr 2008 — 3:13pm",
      "content": "I'm just wondering, with such an elegant background, if you haven't left the words a bit bereft of the same treatment. Certainly within the chosen family there are variations to spice, sorry for the pun, it up. I would lean towards a supple serifed font with a complimentary sans for annotation.\n\n"
    },
    {
      "time": "15 Apr 2008 — 3:32pm",
      "content": "Yes, I second typerror, ad serifs so it is elegant. Justify the first two first paragraphs. From the line \"goods\" align on at left with top paragraphs. Ad a 3rd column for the price, and make the description in two lines, maybe italic. Heavy brown. Maybe a lighter background and darker color for the text, but that is your choice.\n\n"
    },
    {
      "time": "15 Apr 2008 — 5:50pm",
      "content": "I dont think I would set the menu itself in such a thin italic, especially white on a dark background. Maybe it would be better in print than on screen, although there could possibly be some minor ink bleed (or an optical effect with the same result). That would probably be bad for such thin type. Maybe a slightly heavier weight would be safer.\n\nAnd why not just regular with italics to emphasize certain things? Or the names in regular and the description in italics, or vice versa?\n\nBut I dont think you need a serif for it to look elegant or 'posh'. This looks elegant and modern at the same time, while a serif might quickly look cliché-elegant.\n\n"
    },
    {
      "time": "15 Apr 2008 — 6:06pm",
      "content": "The idea behind the typeface choice was probably to avoid being too old fashioned, right? And I have to say, I like it. I'd be there. I'm hungry already.  \nBut using an oblique… that's just a shame (as you probably know). On the front page, with the uppercase, that's okay. It's chic, but it isn't classical chic, which you got from the thin sans. But using an oblique (for so much text) should be avoided. Although hey, I know it's a type-sin, but I don't hate it. (OMG, what am I saying!?)  \nThat said, I think I'd lose the oblique altogether and get a thin sans with a real italic, though. And probably let the type and the ornaments breathe a little on the front page. I have no problem with the inexistence of serifs on this.\n\nI agree with adding a 3rd column for prices (and with dropping them! €7 for a burger?!), which will make all the descriptions fit two lines (to get some cadence, which I think is nice on a list), but I wouldn't think justifying the first paragraphs is really necessary. And I think it's possible that you'll have a hard time printing (and then reading) that thin sans in white with such a dark background, but that all depends.  \nNot that I know anything, mind you!\n\nOh, and typerror: that's \"complementary\". You'll get hell with that mistake around here! :P\n\n"
    },
    {
      "time": "15 Apr 2008 — 6:07pm",
      "content": "Quincunx, you beat me to it! xD High five. :P\n\nruD\n\n"
    },
    {
      "time": "15 Apr 2008 — 6:57pm",
      "content": "I meant it as I spelled it. Webster's...an expression of, or, token of esteem to the first!.\n\n"
    },
    {
      "time": "15 Apr 2008 — 7:07pm",
      "content": "You are thinking contrast!\n\n"
    },
    {
      "time": "15 Apr 2008 — 7:18pm",
      "content": "Well............. still a mistake? I tkae my splelnig as sireuosly as my cohcie of wrods.\n\n;) Michael\n\n"
    },
    {
      "time": "16 Apr 2008 — 3:10am",
      "content": "Once again I'm reminded how lucky I am to have found such a fantastic design community.\n\nThanks Typophiles, your input is always greatly appreciated, and I'll definately be taking on board your considerations - the chosen typeface is currently Gotham, which pairs famously with Didot - I'll experiment with that.\n\nAlso, considering I'm a mere mortal student, how much would you recommend I charge for menu \"case\" (i.e folder) and the menu design itself? The chef wants to be able to change the menu on a whim considering the content, so he's requested an A3 setup which will be folded, and A4 insets with the actual menu.\n\nI've always been taught \"get what you can\" - \"scale your price with the client's abiity to pay\" by both my internship employers and my self-employed bricklayer father, but I'm finding the pricing process difficult for 'our thing'\n\nRegards,\n\nPaul\n\n"
    },
    {
      "time": "20 May 2008 — 9:57pm",
      "content": "this is just a quickie:\n\nto me, the fancy doo-dad underneath Hamburger looks off-centre. And I know it's not, but it looks that way because of the odd letter you've had to work with.\n\nfirst idea that pops into my head:\n\nwhat if you eliminated the bottom doo-dad and just had a straight line, then emphasized the top one a little more?\n\nhope this helps, I'm not wide and experienced, but how it is now would bother me ever so slightly if I popped in for some lunch.\n\n"
    }
  ]
}
