{
  "id": "44292",
  "title": "Typography for furiture store ads",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m working on ads for a furniture store. I’m a little helpless what to do with the typography on the ads. The typefaces I’m using right now are Farnham Italic Swash for the headline and Dolly Regular for the subheadline and with the logo as a tagline. I think it’s really boring looking. Do you have any suggestions for me what to do typographically?\n\nthanks for any response!\n\n| Attachment | Size |\n| --- | --- |\n| [truck\\_billboard2.jpg](http://web.archive.org/web/20081011053020/http:/typophile.com/files/truck_billboard2.jpg) | 177.96 KB |\n| [boot.jpg](http://web.archive.org/web/20081011053020/http:/typophile.com/files/boot.jpg) | 142.7 KB |\n\n [‹ Muscle car typeface](http://web.archive.org/web/20081011053020/http:/www.typophile.com/node/44391 \"Go to previous forum topic\") [Ethics & Teaching Fontlab ›](http://web.archive.org/web/20081011053020/http:/www.typophile.com/node/44180 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011053020/http://www.typophile.com/user/29527\" title=\"View user profile.\">annette_jacobs</a>",
  "time": "<br>",
  "uid": "29527",
  "comments": [
    {
      "time": " 15.Apr.2008 11.48pm",
      "content": "Hello.\n\nHas the client seen this yet?\n\nthe image/concept is a little lame and there are spelling mistakes.\n\nI would try something completely different, use one typeface and try not to to anything cliche.\n\n"
    },
    {
      "time": " 16.Apr.2008 2.07am",
      "content": "Thanks for your response. the client has not seen it yet because it’s actually a school project. but my teacher isn’t a big help. i changed the spelling mistakes (sorry, it’s not my native language).  \ndo you have any ideas for “complete different”? do you think typographically I should go more scripty or sans serif? how can i make that concept work?\n\n"
    },
    {
      "time": " 16.Apr.2008 5.45am",
      "content": "Be sure you’re using the right character for punctuation (apostrophe, not single-open-quote).\n\n"
    },
    {
      "time": " 16.Apr.2008 6.35am",
      "content": "“do you have any ideas for “complete different”? do you think typographically I should go more scripty or sans serif? how can i make that concept work?”\n\nIf the teacher has given you a brief including the intended market of the product, you should use whatever type and imagery you think suits that market. If you are free to invent that intended market, then, again, use whatever type and imagery you can defend as appropriate.\n\nIn this case, if you were told, or decided you were marketing to an older, perhaps retired design esthetic, that is still looking for exotic offerings of that old style. Except for the spelling, grammar (it is redundant to say “...to find you...”, and “...for your home), and the carpet that obscures the furniture truck at any distance, I’d say go with it.\n\nCheers!\n\n"
    },
    {
      "time": " 16.Apr.2008 6.44am",
      "content": "I like them.\n\n"
    },
    {
      "time": " 16.Apr.2008 7.18am",
      "content": "They strike me as ads aimed at winning a design competition, not ones aimed at selling furniture. This has high marks for creativity and practically 0 for effectiveness.\n\nSince your professor clearly isn’t doing his/her job, I will offer this. Before even starting to design a furniture ad, go to a library that has consumer magazines on file, and go through some for at least three hours. You should be able to find hundreds of furniture ads. Sketch the ones you like, or take cell phone pix of them (please don’t tear the magazines).\n\nThen take a look at ads for a half hour each from magazines from the 80s, 60s, 40s and 20s.\n\nAfter this five hours of research you will know what you want to do in an advertisement.\n\n"
    },
    {
      "time": " 16.Apr.2008 9.01am",
      "content": "I liked the artwork. It made me stop and examine the ads. I wasn’t to wild about the phrases eclectic delivery and exotic treasures. I think you need to rethink the wording of those.\n\nThe furniture truck and lampshade boat are great!\n\nSharon\n\n"
    },
    {
      "time": " 16.Apr.2008 1.20pm",
      "content": "Thank you all for response. I still don’t have any ideas what to do about the typograhy. For me the type seems too boring because it is pretty much the same style than the furniture and that adds the oldstyle feel.\n\nI want it to be a younger feel because my target audience are people (mainly women) from 20 to 40 years that love the victorian style and also forign furniture. It’s kind of a mix between urban outfitters and an antique store.\n\nI’m thinking of a sans serif to give it a younger feel but sans serif is always assosiated with modern furniture for me and i don’t know how to bring it together with this advertising imagery and what typefaces i should try out.\n\nmaybe you could give me some type ideas.\n\nthank you. a\n\n"
    },
    {
      "time": " 17.Apr.2008 5.27am",
      "content": "A question from an absolute dilettante: Are you happy with the look of the word “nest”? The letters look incongruous to me.\n\n"
    },
    {
      "time": " 17.Apr.2008 9.45am",
      "content": "I think I would look around this site for a while for ideas. They seem to like eclectic yet youthful design.\n\n[http://www.designspongeonline.com/](http://web.archive.org/web/20081011053020/http:/www.designspongeonline.com/ \"http://www.designspongeonline.com/\")\n\n"
    },
    {
      "time": " 17.Apr.2008 4.56pm",
      "content": "sharon, thanks for the link. it’s a really nice website. they have exactly the kind of interior that nest is going for.\n\nkatharina, why does the logo look incongruous to you? i’m actually really happy with the logo including the logotype. it’s an expressive logo that means it’s all handrendered. i might work on the n a little thoug. i choose to go this direction because the handmade feel fits with the furniture style that nest is selling and the unperfectness is perfect because it makes it more personal and charming.\n\nafter a long time struggeling with the typography i finally found a solution. i found it much more difficult to deal with type on an illustration than on photography.\n\nthanks for all your critique.\n\n"
    },
    {
      "time": " 18.Apr.2008 4.32am",
      "content": "Hi, Annette, first of all: I like the picture.\n\nNow for the nest. Maybe I am compulsory, but I like the type to took tidy. So the intentional imperfections of the handmade “nest” next to a digital antiqua seem to clash. - By imperfections I mean for instance the first stem of the n is lower than the curve, it looks chopped. The fat parts of various stems are unequal. But keep in mind I am not a typographer, so this is what the eventual consumers might feel.\n\nGood luck to you!\n\n"
    }
  ]
}
