{
  "id": "44307",
  "title": "Logo for German Job Agency",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,\n\nMy client is a job agency named “TimeZeit”, a hybrid of the English “time” and its German equivalent “zeit”.\n\nThe two founders want a solution that appeals to corporate clients but looks fashionable and stylish as well.\n\nThe first draft of their new website can be accessed [here](http://web.archive.org/web/20081210163256/http:/timezeit.designbits.de/).\n\nAnd this is the first two logo drafts I came up with:\n\n ![](http://web.archive.org/web/20081210163256im_/http:/www.typophile.com/files/logo_uhr_1_6467.png)\n\n ![](http://web.archive.org/web/20081210163256im_/http:/www.typophile.com/files/logo_uhr_2_6644.png)\n\nPlease let me know which solution you think is better and how it might be improved. Thanks!!\n\n [‹ Fresh Dog food logo...](http://web.archive.org/web/20081210163256/http:/www.typophile.com/node/44174 \"Go to previous forum topic\") [opinion needed :-) ›](http://web.archive.org/web/20081210163256/http:/www.typophile.com/node/44308 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081210163256/http://www.typophile.com/user/19464\" title=\"View user profile.\">Tintin81</a>",
  "time": "<br>",
  "uid": "19464",
  "comments": [
    {
      "time": " 16.Apr.2008 6.32am",
      "content": "I do like the first logo for the font choice, the person though is not doing much for me.  \nHave you attempted to use the top typeface and clock hands in the same format as the second logo?\n\n"
    },
    {
      "time": " 16.Apr.2008 6.32am",
      "content": "Tintin,\n\nFirst off I think the logos look good but I do have a few suggestions.\n\nThe first logo looks a bit more playful and less upscale than the latter. I don’t know the client like you so it may work for them. It feels like it’s trying to look balanced on either side but it feels like there’s a bit more optical space on the left.\n\nThe second logo has a more corporate feel like either the clock is too heavy or the type is too light. I like what you did for the hands on the clock but they may not really mesh with the serif.\n\nGreat work so far.\n\n"
    },
    {
      "time": " 16.Apr.2008 6.35am",
      "content": "I guess you didn’t picked the name, did you? It’s horrible.  \nIf you have “time” already two times in the name, I wouln’t put an image of a clock on top of that …\n\nAlso, be careful publishing those comp images on timezeit.designbits.de:  \n [http://www.spiegel.de/netzwelt/web/0,1518,547234,00.html](http://web.archive.org/web/20081210163256/http:/www.spiegel.de/netzwelt/web/0,1518,547234,00.html \"http://www.spiegel.de/netzwelt/web/0,1518,547234,00.html\")\n\n"
    },
    {
      "time": " 16.Apr.2008 6.51am",
      "content": "What’s with the hands of the clock? They look like sawn-off drumsticks.\n\nI echo Ralf’s sentiments – I think involving a person or at least some human element in the logo would be suitable.\n\nRoss\n\n"
    },
    {
      "time": " 16.Apr.2008 8.14am",
      "content": "why all lower case?  \nMore pattern possibilities with caps—not a curve in the house.\n\n ![](http://web.archive.org/web/20081210163256im_/http:/www.typophile.com/files/TZ_3523.jpg)\n\n"
    },
    {
      "time": " 16.Apr.2008 8.18am",
      "content": "Tintin,\n\nI agree with the previous comments, especially about the icon not being centered. Visually I think it needs to be either dead on or purposely off center.\n\nI don’t understand the name either... time time? A logo should immediately convey what the product is it’s selling or promoting. Adding a clock is so literal and I think only serves to describe the name, not the profile of the company. It takes on the air of a watch repair company instead of a job placement agency... which I think is what the website appears to indicate. Perhaps a “time card” concept would be appropriate? Or if they really like the clock perhaps use the two words as arms of a clock? Don’t give up yet, you’ve got a great start.\n\nd\n\n"
    },
    {
      "time": " 16.Apr.2008 8.56am",
      "content": "Hey,\n\nThanks for your comments and thoughts, very much appreciated!\n\n@Ralf: Don’t worry, I am holding a license for every single one of those images. I’ve got them from [iStockphoto.com](http://web.archive.org/web/20081210163256/http:/www.istockphoto.com/) which gives you far better value for money than Getty images.\n\nWhat’s so bad about the name? I didn’t come up with it but I like the sound of it and find it quite memorable.\n\n[Webdesign Portfolio](http://web.archive.org/web/20081210163256/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 17.Apr.2008 2.27am",
      "content": "Getty owns iStockphoto now, incidently.\n\nI guess the name might be a cultural thing… it’s not unusual to see English words smattered throughout German, especially in a commercial context. Maybe the name sounds fine in Germany; it seems a little odd outside though.\n\nRoss\n\n"
    },
    {
      "time": " 17.Apr.2008 5.51am",
      "content": "Yes, you see a lot of English words in Germany. But mixed German and English in one Name, especially when the two components have the same meaning, does seem a bit odd.\n\nJens\n\n"
    },
    {
      "time": " 20.Apr.2008 4.08pm",
      "content": "perhaps it’s deeper than simply this logo, but it seems very regimented.\n\nI think there might be something in exploring the concept of time further - absolute clocks etc ... do they need to be shown?\n\nright now it’s certainly not stylish, nor does it really have any corporate appeal/trust.\n\n—————  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20081210163256/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 21.Apr.2008 9.21pm",
      "content": "Hello TinTin81,\n\nI hope you don’t mind, but I took a stab at the logo... I think there’s great possibilities to create the “clock” with the letters “I” of both words.\n\nI hope this helps. It’s nowhere near finish product, but it may give you a good direction.\n\n- Manuel\n\n“less is more”\n\n ![](http://web.archive.org/web/20081210163256im_/http:/www.typophile.com/files/timezeit_6441.jpg)\n\n"
    }
  ]
}
