{
  "id": "44338",
  "title": "true cut small caps?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "On page 75 of _American Metal Typefaces_, Mac McGrew lists “What’s in a font” and includes Small Caps, and later in the list “Typographic Refinements... ’true-cut’ small caps.” What are these “true-cut small caps” as distinct from the small caps he’s already listed?\n\n(Note that this is about metal type, not computer “faux small caps” a la Microsoft Word.)\n\n [‹ Tables of Contents](http://web.archive.org/web/20080706172406/http:/www.typophile.com/node/45280 \"Go to previous forum topic\") [Safari release version supporting downloadable web fonts... ›](http://web.archive.org/web/20080706172406/http:/www.typophile.com/node/43312 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706172406/http://www.typophile.com/user/3254\" title=\"View user profile.\">eliason</a>",
  "time": "<br>",
  "uid": "3254",
  "comments": [
    {
      "time": " 17.Apr.2008 4.29am",
      "content": "I’m not absolutely positive this is how McGrew uses the term, but, it has been possible since the metal age to trace the drawings of the Caps with a machine that would shrink them at different factors in x and y to make small caps, cheaply. This was done to give the small caps wider bodies relative to the shortened height and prevent them from ending up weaker than the lowercase. Today, this can be done by scaling the uppercase by different factors to create small caps (“faux small caps”).\n\nBut these techniques do not produce the best results which involve handwork, either from the beginning, or after the mechanical scale. It is this work, correcting the diagonals, vertical serifs and more, (much more in an italic), that produces what I think McGrew calls ’true-cut’ small caps. Anyone know different?\n\nCheers!\n\n"
    },
    {
      "time": " 17.Apr.2008 4.54am",
      "content": "David, What you describe was certainly true for Monotype, & I guess Linotype — obviously you would know.\n\nBut\n\n<cite>This was done to give the small caps wider bodies relative to the shortened height and prevent them from ending up weaker than the lowercase.</cite>\n\nDoesn’t quite work, in that even non-porportional scaling doesn’t give the stem weight increase, so they wind up looking weaker anyway.\n\nYou’re right about the handwork required — I’ve had to do it too many times.\n\nThe other possibility was that with some metal composition, you could always use, say, 8-point full caps mixed in with 10-point U&lc. Leading could be a problem, but there were ways around that, too. Still, that’s a \\*compositors\\* solution rather than a font property, so he probably didn’t meant that.\n\n"
    },
    {
      "time": " 18.Apr.2008 7.01am",
      "content": "My guess is that McGrew was using the two terms to describe the same thing. & that thing is as described by David & Charles: fonts of small capitals drawn & then cut to blend seamlessly with both upper case and lower case sorts of the same face and size. Stem weights, character widths, all proportions were worked to make the smalls “true-cut.”\n\nThe term “true-cut” was also used by the Ludlow Typograph Company to describe some of its faces. I think they had a “True-Cut” Caslon and a “True-Cut” Bodoni. Yet another attempt by a typecasting company to claim their faces were closest to the “originals.” I’ll have to look at my Ludlow books over the weekend to see if those faces had smalls.\n\npowers\n\n"
    },
    {
      "time": " 13.May.2008 4.14am",
      "content": "Me:This was done to give the small caps wider bodies relative to the shortened height and prevent them from ending up weaker than the lowercase.\n\nCharles: Doesn’t quite work, in that even non-porportional scaling doesn’t give the stem weight increase, so they wind up looking weaker anyway.\n\n...so, one does the handwork I describe in the very next paragraph.\n\nCheers!\n\n"
    }
  ]
}
