{
  "id": "44330",
  "title": "Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Needs some input on these logos. Spinadex is an online work-reference site for stay-at-home moms/dads who wish to continue building/working trusted work networks. Your thoughts are greatly appreciated.\n\n ![](http://web.archive.org/web/20081012143151im_/http:/www.typophile.com/files/spin1_3678.jpg)\n\n ![](http://web.archive.org/web/20081012143151im_/http:/www.typophile.com/files/spin2_5376.jpg)\n\n [‹ Logotype for fashion label](http://web.archive.org/web/20081012143151/http:/www.typophile.com/node/44477 \"Go to previous forum topic\") [Interior Design Logo Critique ›](http://web.archive.org/web/20081012143151/http:/www.typophile.com/node/44558 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012143151/http://www.typophile.com/user/19546\" title=\"View user profile.\">hola</a>",
  "time": "<br>",
  "uid": "19546",
  "comments": [
    {
      "time": " 16.Apr.2008 12.45pm",
      "content": "Both are beatiful, but I like the below version most.\n\nWhy do you remove the dot of ’i’ on the above version?\n\n"
    },
    {
      "time": " 16.Apr.2008 1.11pm",
      "content": "The beveled termini on the first option look a little odd to me. I like the rounded type on the bottom more, but there’s a lot of focus on the a. Is there a reason for that? I would also keep the circles around the a separated like in the black and white version so it will hold up if someone photocopies /faxes it. I also think the white between the circles is nicer.\n\n"
    },
    {
      "time": " 16.Apr.2008 1.23pm",
      "content": "I like the green and blue version.\n\n"
    },
    {
      "time": " 16.Apr.2008 1.42pm",
      "content": "I get a bit of a washing-machine feeling from the lower ones.  \nI think Chipman223’s comments are right on.\n\n"
    },
    {
      "time": " 16.Apr.2008 2.17pm",
      "content": "MK2 - I removed the ’dot’ because it kinda looked out of place and I wanted a cleaner look while holding readability.\n\nChipman223 - I wanted to make sure people read it “Spin-A-Dex”.\n\nEliason - Yes, motion was the intended objective. As in looking/searching for something.\n\nthanks everyone. hope to hear some more.\n\n"
    },
    {
      "time": " 16.Apr.2008 3.18pm",
      "content": "In your first version, I really want to delete the logo, and instead, make that e look like it’s spinning somehow. I don’t know exactly how, but it’s just begging to be spun like the wheel of fortune.\n\nThe last two versions don’t work for me. The A is far too important, IMO.\n\n"
    },
    {
      "time": " 16.Apr.2008 3.34pm",
      "content": "Hmmm, spinning E. Might have to think about that for a bit. Wouldn’t that make the E more important? I’ll kick the idea around. Thanks EileenB.\n\n"
    },
    {
      "time": " 16.Apr.2008 3.43pm",
      "content": "The a of the top design might have some loop-the-loop possibilities.\n\n"
    },
    {
      "time": " 16.Apr.2008 8.37pm",
      "content": "I really like the first two, and the alternating colors of the second round graphic. I’m not sure about the color choice, maybe if you did the first one, but alternate the round graphic black and white, with the white ones being outlined with black, or just black and gray. The “i” not having the dot doesn’t bother me, I didn’t even notice until mk2 mentioned it.\n\n"
    },
    {
      "time": " 17.Apr.2008 9.59am",
      "content": "I like the last two. I think you need to make the spin sound as spin. The first could read spina as in spina bifida.\n\nSharon\n\n"
    },
    {
      "time": " 17.Apr.2008 10.19am",
      "content": "Yeah, I agree. I’ve been debating about that for a while. thanks.\n\n"
    },
    {
      "time": " 17.Apr.2008 11.20am",
      "content": "In #2, What about expanding the two rings so that they extend to the P and E, and keeping the a a different color\\> Where the rings meet the other letters, there could be a thin white gap.\n\nI’m not a huge fan of arial rounded, there’s certain spots where the letterforms have odd curves. Have you tried any others (i do like the choice of a rounded terminus)?\n\n"
    },
    {
      "time": " 17.Apr.2008 12.01pm",
      "content": "Good point Chipman223, I’m actually looking for a font that has a closed “a” but rounded terminals. VAG Rounded is one I’m looking at at using instead of the current one. I like how the ’a’ is closed. I’ll have to see how it looks. thanks.\n\n ![](http://web.archive.org/web/20081012143151im_/http:/www.typophile.com/files/Picture-1_5876.jpg)\n\n"
    },
    {
      "time": " 19.Apr.2008 3.36pm",
      "content": "Yeah ... as seems to be the consensus thus far, am really liking no.2 - that said though ... it has a “cheaper” feel than option 1, maybe it’s the Arial rounded, or maybe it’s the colours.\n\nthe ’a’ in the circle also seems visually off centre/balance - which is distracting.\n\nkerning needs work particularly on ’dex’.\n\nlooking forward to see where this goes.\n\n—————  \n**Paul Ducco**  \n [Creative Agency Melbourne](http://web.archive.org/web/20081012143151/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 19.Apr.2008 8.05pm",
      "content": "What about a simpler logotype - pick a face with a nice “a” and then tilt the a. It will set it apart, imply motion....\n\nYour logo drafts look a lot nicer than most website logos out there, but it seems like you might want to play around with pen and paper a bit more. (If you do, I’d love to see the sketches!)\n\nGood luck!\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 20.Apr.2008 5.48pm",
      "content": "Thanks everyone. Working on a revised version.\n\n"
    },
    {
      "time": " 21.Apr.2008 12.03pm",
      "content": "How married is your client to the name? It doesn’t make any sense to me. Maybe you could come up with a better name. It needs to be more direct to its audience. I wouldn’t want to work this hard to make the connection. I assume your client doesn’t have unlimited resources to promote their site. So it should have a in you face name.\n\n"
    },
    {
      "time": " 21.Apr.2008 1.39pm",
      "content": "Client loves the name. I kinda agree. I like it too. Do you have any suggestions?\n\n"
    },
    {
      "time": " 21.Apr.2008 4.10pm",
      "content": "makes sense to me ...\n\ntel-a-dex\n\nspin-a dex\n\nspin being close to swing ... so it’s a swingers site.\n\nright?\n\n;)\n\n—————  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20081012143151/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 21.Apr.2008 10.51pm",
      "content": "=)\n\n"
    },
    {
      "time": " 22.Apr.2008 9.09pm",
      "content": "I like spin-a-dex. Didn’t exactly sound like a swingers site to me - sounded like a fun take on a rolodex.\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 22.Apr.2008 11.43pm",
      "content": "but you saw a rainbow sphincter in another logo.\n\n\\*massive shrug\\*\n\nhehehe.\n\nand d’oh ... meant Rolodex/Teladex\n\n—————  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20081012143151/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 23.Apr.2008 5.49am",
      "content": "Forget ink blots, they should use abstract logos for Rorschach tests. :P\n\n"
    },
    {
      "time": " 23.Apr.2008 3.24pm",
      "content": "Damn, I was hoping no one would call me on that. You’re a bunch of anal-retentive.....\n\nHeh.\n\nWhat does the Nike swoosh mean to \\*you\\*?\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 23.Apr.2008 4.15pm",
      "content": "a swoosh ... speed.\n\na line of \\*insert drug of choice here\\*.\n\n—————  \n**Paul Ducco**  \n [Design Studio](http://web.archive.org/web/20081012143151/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
