{
  "id": "44344",
  "title": "Legal issues with using fonts?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I'm trying to understand the legal issues in using fonts in logo designs and in other ways. I tried searching the forums (and Google) but can't seem to find anything definitive about this.\n\nI read that \"fonts cannot be copyrighted\" (meaning the letterforms themselves) but that the \"programs\" (the actual font files) used to control them can. I also read that if you convert a font to outlines, there are no copyright issues at all and the outlines can be used freely since the actual letterforms can't be copyrighted. This sounds a bit bizarre to me. Is it true?\n\nIf this is the case, does that mean the paradigm is that you (as a designer) purchase a font so that you can legally use it to create a document (a newsletter for example), then render the letterforms (by printing the document, converting the letters to outlines, rasterizing the document, etc.) so the document doesn't contain the actual font \"program\" itself so you can freely distribute the document without paying the font's owner any licensing fees?\n\nFrom what I've read of the court rulings on this issue, it seems the intention was to avoid a situation where a fontmaker could require that a reader purchase a font themselves and own a license to it before they can legally obtain a copy of a document set in it, since that would mean for example that anyone who wanted to read a magazine would have to buy licenses to all the fonts used in it first. That makes sense - if a font owner could do that, it would be like Berol \"copyrighting\" their colored pencils and saying that anyone who wanted to buy a drawing made with them would have to buy a license to the pencils themselves first. So the letterforms in a font would be like the pigmented \"lead\" and the font file would be like the wood tube that it comes in. (Hopefully that makes sense.)\n\nSo, is this actually true? If it is, does it extend to using fonts in logo designs as well? And if the situation doesn't work this way, how does it work? There seems to be a lot of confusion on this based on the message threads I've been reading.\n\n",
  "author": "lourettab",
  "time": "16 Apr 2008 — 7:18pm",
  "uid": "29708",
  "comments": [
    {
      "time": "16 Apr 2008 — 7:42pm",
      "content": "Your understanding is essentially correct in the USA. The actual software (the font file) is protected by copyright, so everyone who uses the font on their computer needs to buy a copy or have a license. But the visual image of the font and the outlines generated by Illustrator to be used in a logo have no protection whatsoever.\n\nThe legal reasoning is that the alphabet itself is purely functional, but the software that makes up a complete font is a creative work.\n\nSimilarly, the information printed in the phone book is factual and anyone can reproduce it, but the phone book itself is protected by copyright because that particular chosen arrangement of the collection of facts is a creative work.\n\n"
    },
    {
      "time": "16 Apr 2008 — 8:47pm",
      "content": "Thanks nmerriam\n\nI had no idea that the legalities of typefaces were so...strange? I always assumed that typefaces were copyrightable and that in order to use a typeface for something you had to have a specific license to use it in that way. Personally I don't see how anyone can say \"that drawing of a cat is copyrightable but that drawing of the letter 'A' isn't\", but I'm sure I'm not the only person who disagrees with the way the court handle this. :-)\n\nI don't mean to explicitly lay out all the ways in which people can legally steal font creators' work, but I want to understand the situation as well as possible so I thought of some examples.\n\nSay you purchase a font from a foundry with different licensing agreements based on the way you're going to use the font. For example, they have a \"basic\" license that lets you use the font for setting general type like body copy, then a more-expensive license that that you must purchase to use the font to create a logo design. Since the letterforms aren't copyrightable, does that mean you can legally purchase the less expensive license, type out all the letters in the font in Illustrator, convert them to outlines, and then use the outlines to create a logo design without having to pay for the other license? If this is the case, why do they even have a license like that in the first place? It seems like this is an instance of someone essentially trying to \"trick\" people into thinking they have to purchase licenses they can can legally avoid purchasing, which seems about as unethical as stealing letterform designs. Shouldn't font creators be trying to change the laws by suing people? I know it's not that easy, and I'm not saying people should be expected to create designs and just let people do whatever they want to with them without paying them. I just want to know what the \"courts\" say about it, whether it makes sense or not.\n\nAlso, doesn't this mean that you can alter the letterforms in a font without permission even if the license agreement specifically says you can't create \"derivative works\" or \"manipulate\" the letterforms? As long as you're not altering the font program itself, there's no legal issue, right? For example, say I use a font I've purchased to create a logo of the word \"Forkz\", but I want to change the K so it joins up with the Z. This is legal as long as I convert the letters to outlines (which you would have to do anyway) even if the license says I can't alter the letterforms, right? Having a general stipulation like that in a font license would be invalid to begin with, right?\n\nI guess what I'm trying to ask is, does the license for a font only extend to the program and not in any way to the letterforms contained in it? If this is the case, why don't people just make new fonts using the letterforms contained in existing fonts? Once again, let me say that I don't think this is \"right\" in any way, and I would never do that myself. I'm just trying to understands the situation.\n\nOne more example. Say you've purchased a font that contains the usual tyopgraphic symbols, plus a drawing of a monkey that was created by the font creator. The tyopgraphic symbols would be uncopyrightable, but since the money isn't a letterform, it would be protected by copyright, right? The font creator wouldn't have to have a \"design patent\" for that symbol in order to lay claim to the design, right? So, for instance, the designs in a font of \"dingbats\" WOULD be protected as long as they were unique enough to be copyrighted? Like, a generic five-pointed star wouldn't be protected, but a five-pointed star with a human face drawn inside would be?\n\nSorry about the length of this post, I'm just interested in the intricacies of this.\n\n"
    },
    {
      "time": "17 Apr 2008 — 3:16am",
      "content": "No worries on the detail, I actually started mentioning some of those points in my earlier response but didn't want to muddy the issue :)\n\nYou understand pretty much everything. Fonts can certainly contain objects that aren't letterforms, and any of those could be protected as images by copyright because they aren't functional (your contrasting star examples are perfect). There's no easy way to know at what point a court would consider an image an original creative work.\n\nIn terms of licensing and limitations on use, the only way to enforce a restriction would be through contract law, not copyright. Whether or not (and in what ways) a standard EULA can restrict use can be a contentious issue around here, so I won't give you a simple answer, but in terms of copyright law, once you have the shape of the letter, you can quite literally do whatever you want with it.\n\nYou can indeed drop your type into Illustrator, convert to outlines, and then adjust whatever you like in order to make a logotype fit together better. You could also, as you suggest, convert or scan every letter in a face and then make your own font out of it and resell it. But you'll have to go through and do all the hinting, all the kerning, all the testing and balancing over again, which is a lot of time-consuming skilled work. If you remember those CDs that were popular in the 90s with 5,000 fonts for $49, generally they were filled with fonts that were made in just that way (except without all the care!). The quality of a font made that way is not very high -- its one of those things that sounds a lot easier than it really is :)\n\n"
    },
    {
      "time": "17 Apr 2008 — 3:38am",
      "content": "_For example, they have a “basic” license that lets you use the font for setting general type like body copy, then a more-expensive license that that you must purchase to use the font to create a logo design. Since the letterforms aren’t copyrightable, does that mean you can legally purchase the less expensive license, type out all the letters in the font in Illustrator, convert them to outlines, and then use the outlines to create a logo design without having to pay for the other license?_\n\n_Also, doesn’t this mean that you can alter the letterforms in a font without permission even if the license agreement specifically says you can’t create “derivative works” or “manipulate” the letterforms?_\n\nAs I understand it: No, you're not allowed to do this. Because you licenced the font you are bound by the licence agreement. Copyright laws don't apply unless there are any illegal licence terms in the EULA, in which case only these terms would be void and legal restrictions or permissions determined by copyright laws would replace them.\n\nThere are, however, certain conditions in which a licence agreement is not effective. For example, in Germany, if you purchase software on a physical medium, your right to use the software comes from the possession of the medium, so any licence agreements you have to accept later (e.g. when installing the software) are void. Then your use of the software would only be bound by copyright laws.\n\nThat being said, I'm not a lawyer.\n\nJens\n\n"
    },
    {
      "time": "17 Apr 2008 — 10:04am",
      "content": "This is fascinating, and a very much needed topic for discussion.\n\nIn the spirit of continuing the discussion, I'd like to postulate a hypothetical: As we've seen here a few days ago, web browsers (particularly WebKit/Safari) are starting to correctly parse CSS3, including the 'embedded fonts' feature. This conflicts sharply with most foundry's EULAs regarding uage of their font files. From what I'm reading here, would it not be an acceptable (in a practical sense-ethics aside) end run around this issue to take the font you want to use, create outlines in Illustrator, create your own font file from these outlines (hopefully with attention paid to kerning tables, hinting, etc., of course!), and use that as the embedded font in your website?\n\nWhile it would seem to me that the foundry's EULAs are in sore need of rewording in order to reflect current and future usage practices, this would seem, at face value, as an alternative to exposing yourself to litigation, while still enjoying the new typographical features available on modern browsers.\n\nAny thoughts?\n\n"
    },
    {
      "time": "17 Apr 2008 — 6:47pm",
      "content": "Pabla -- your situation is certainly possible (again, in terms of copyright -- whether or not the license prohibits it and is binding in your jurisdiction is a totally separate issue). But like I said, the quality of such a project is generally not going to match up with expectations. You'd certainly get a much better looking site by using well-designed, professionally optimized fonts that are allowed to be downloaded, or are widely distributed, than trying to hack out look-alikes of some offbeat face. It's much simpler to use existing image replacement techniques for headings and other small blocks where a really unique face needs to be used.\n\n"
    },
    {
      "time": "18 Apr 2008 — 2:42am",
      "content": "I'm not a lawyer, and this is a legal question for which you really ought to consult a lawyer.\n\nThat being said.... At least in the USA, the outlines from the font software ARE protected by copyright. At least, that's how I as a non-lawyer read Judge Whyte's summary judgment ruling in the Adobe vs SSI case.\n\n\"Adobe claims there is some creativity involved in the manipulation and editing of the on-curve and off-curve reference points. Defendants claim there is no protectable creativity contributed by the editor in determining the desired character outline for each font.\"  \n...  \n\"The evidence presented shows that there is some creativity in designing the font software programs. While the glyph dictates to a certain extent what points the editor must choose, it does not dictate every point that must be chosen. Adobe has shown that font editors make creative choices as to what points to select based on the image in front of them on the computer screen. The code is determined directly from the selection of the points. Thus, any copying of the points is copying of literal expression, that is, in essence, copying of the computer code itself.\"\n\nFull decision here: [http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4](http://web.archive.org/web/20150414121813/http:/directory.serifmagazine.com/Ethics_and_Law/Copyright/judgement.php4 \"http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4\")\n\nNow, most licensing of fonts seems to allow you to use the outlines for things like logos. But that doesn't mean there's no copyright inherent in the outlines.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "18 Apr 2008 — 7:00am",
      "content": "@ nmerriam,\n\nOh, don't get me wrong: I agree wholeheartedly—a lot of work goes into a good, quality professional font, and it would be bad craftsmanship to use anything other than that. I was just postulating the situation as a hypothetical, concentrating on the legal issues involved, to the exclusion of all else.\n\n"
    },
    {
      "time": "18 Apr 2008 — 10:13pm",
      "content": "Just to clarify what seems to be a contradiction between what I've said and what Thomas is talking about -- while the shapes of the letters are not protected, the specific selection of points and curves that the creator uses to accomplish that shape is protected by copyright. Anyone who works with bezier curves knows that you can create the same shape a thousand different ways, and doing a literal point-for-point, curve-for-curve duplication or derivation of someone else's choices isn't allowed (much like the phone book case, where the arrangement itself is a creative work).\n\n"
    },
    {
      "time": "2 Jun 2008 — 10:51am",
      "content": "similar question, which may be already answered here, but if someone can confirm...\n\nif i draw a new version of Century (for example), which i create by making outlines of an existing licensed century in illustrator, but i alter every letter, and hire someone to rekern and program into a newly named century, could i be sued?\n\n"
    },
    {
      "time": "2 Jun 2008 — 11:34am",
      "content": "\"could i be sued\"\n\nYou can always be sued.\n\n"
    },
    {
      "time": "2 Jun 2008 — 2:12pm",
      "content": "@joslog -- Why would you do that to begin with?\n\n"
    },
    {
      "time": "2 Jun 2008 — 3:53pm",
      "content": "miss tiffany: i would do it because i want a custom version with thinner serifs, for example, and couldn't find anything like this already in existence\n\n"
    },
    {
      "time": "2 Jun 2008 — 5:51pm",
      "content": "Oh. For internal use only. I was thinking you'd be selling it again.\n\nWell the problem really is then does the EULA allow modifications? And, do you care?\n\n"
    },
    {
      "time": "5 Jun 2008 — 12:20pm",
      "content": "Thomas: _Now, most licensing of fonts seems to allow you to use the outlines for things like logos. But that doesn’t mean there’s no copyright inherent in the outlines._\n\nThat is correct. And thanks for making the reality of copyright and intellectual property so plain and clear.\n\nMy latest creation, [Pyke's Peak](http://web.archive.org/web/20150414121813/http:/typophile.com/node/46088), comes in two versions, the commercially licensed Pyke's Peak, and the \"zero cost\" version, Pyke's Peak Zero. PP Zero has an internal EULA text built into the OTF font file. The font file's header copyright notice clearly states in summary:\n\n\"Copyright (c) 2007 - 2008 Typeface designed by James Arboghast. Published by Sentinel Type. All rights reserved worldwide. This is the \"zero cost\" version of Pyke's Peak, meaning you may posess and use the digital font file for zero cash outlay, but the commercial rights to the font data & intellectual property contained in it are not free in any way. You may distribute this font without permission on internet font archive sites and other media provided you do not charge money for it or try to pass it off as your own work. Please read the End User License Agreement embedded in this font file for details.\"\n\nPP Zero is a significant release, as the zero cost license allows personal as well as commercial use and \"embedding\" using the CSS @font-face property. The integral EULA text:\n\n\"S E N T I N E L T Y P E End User License Agreement\n\nYour use of this digital typeface is conditional upon on your acceptance, without modification, of the terms and conditions expressed herein. Your use of the typeface is deemed to indicate your acceptance of all such terms and conditions. If you do not agree to the terms, promptly destroy all materials.\n\nSentinel Type is:  \nJames Arboghast  \n7a Belford Road  \nKew East 3102, Victoria  \nAUSTRALIA  \nEmail: [arboghast@hotmail.com](mailto:arboghast@hotmail.com)\n\n1. USE  \n(i) Sentinel Type grants to you only, the User, the non-exclusive, non-transferable right to use and display the font for personal and commercial purposes. The font may be used on an unlimited number of CPUs and other computers and connected to any number of printers or other image producing devices at your site.\n\n(ii) You may send a copy of the font with your documents to a commercial printer or other service bureau to enable editing or printing of a document, provided such party has informed you that it acknowledges this license agreement.\n\n(iii) You may embed fonts within documents such as .DOC and .PDF for the viewing and printing of those documents. You also may use the font on webpages posted on the World Wide Web by linking to a copy of the font file on a web server by using the @font-face CSS property.\n\n(iv) You may distribute this font without permission provided the .ZIP package with EULA text, documentation and accompanying materials remains intact. You may upload the font file to bulletin boards, archive sites and include it on CD ROM collections, but you may not modify or rename it, claim it as your own work or charge money for it. The font data and artwork design are protected by this End User License Agreement and by U.S and international copyright laws.\n\n(v) You agree to use this font for lawful purposes only, and not to modify, adapt, translate, publish, reverse engineer, decompile, disassemble, create derivative works of, licence or sell the font without Sentinel Type's prior written consent.\n\n2. COPYRIGHT  \n(i) Rights: this font file and the artwork, typeface design and data are protected by this agreement and by international copyright law. These rights are valid and protected in all media and technologies existing now or later developed. Except as explicitly provided otherwise, this agreement, applicable copyright and other laws regulate your use of the font. At a minimum Sentinel Type asserts its right of ownership of the intellectual property contained in the typeface and accompanying materials.\n\n(ii) Proprietary Rights: All contents of the Sentinel typeface are (c) copyright Sentinel Type/James Arboghast 2004. All rights reserved. All rights not expressly granted here are reserved.\n\n(iii) Copying and Backups: You may make as many copies of the font file for backup purposes as you see fit, provided the copyright and trademark notices and accompanying materials are reproduced in their entirety in the backup copy.\n\n(iv) Infringement: You may be held legally responsible for any infringement of Sentinel Type's intellectual property rights caused or encouraged by your failure to abide by the terms of this agreement.\n\n3. DISCLAIMER and WARRANTY  \n(i) Sentinel Type warrants this font to be free from reasonable defects in materials and workmanship under normal use for a period of 90 (ninety) days from the date of acquisition.\n\n(ii) Each user must evaluate and bear the risk inherent in any reliance on the accuracy, completeness or usefulness of the font. The font and its content are provided \"as is\" and \"as available\" without warranty of any kind, either express or implied, including warranty of merchantability or fitness for a particular pupose, unless such warranties are legally incapable of exclusion. In no event shall Sentinel Type be liable for any direct, indirect, punitive, incidential, special or consequential damages arising out of the use of or inability to use this font, even if Sentinel Type has been advised of the possibility of such damages. In states that do not allow limitation of liability for incidental damages ST's liability shall be limited to the extent permitted by law.\n\nShould you have any questions concerning this End User License Agreement, or if you desire to contact ST for any reason, please contact Sentinel Type in writing.\"\n\nAs far as creating derivative outlines and using them in a logo or a webpage, the EULA specifically prohibits that:\n\n\"(v) You agree to use this font for lawful purposes only, and not to modify, adapt, translate, publish, reverse engineer, decompile, disassemble, create derivative works of, licence or sell the font without Sentinel Type's prior written consent.\"\n\nAnd as the EULA text states, the user's use of the font is conditional upon their \"acceptance, without modification, of the terms and conditions expressed herein.\"\n\nEnd of story.\n\nBut PP Zero remedies that with its generous licensing terms for CSS webpage embedding and no logo fee, so users _don't need to_ create derrivative works from it. They can simply use the font instead and be happy :^)\n\nj a m e s\n\n"
    },
    {
      "time": "20 Jun 2008 — 8:51am",
      "content": "This is the best thread i have found on the topic.  \nso james, when you say commercial use (as in the paid licensing), do you mean redistribution? I'm trying to get a grip on what exactly commercial use is, and frankly most eulas are very very muddy (or they seem so to me). AND, the times that i have called to find out specifically if my use was covered, i got a runaround (ambiguous answers and no returned phonecalls or emails ) go figure.  \nAnyway, i have no interest in creating derivitives or redistribution, my use is solely as a designer. I understand that all tou's/eula's are going to have different intents, but i thought i'd pick your brain for some insight. :-)  \nTIA\n\n"
    },
    {
      "time": "20 Jun 2008 — 11:29am",
      "content": "The best way to discuss a specific part of a EULA is to have a specific EULA in mind. Do you have a specific foundry you are curious about?\n\n[P22](http://web.archive.org/web/20150414121813/http:/www.p22.com/comlicensing.html), for instance, does a very good job in explaining their [EULA](http://web.archive.org/web/20150414121813/http:/www.p22.com/support/license.html).\n\n"
    },
    {
      "time": "20 Jun 2008 — 1:37pm",
      "content": "@JosafeenGrey: _...so james, when you say commercial use (as in the paid licensing), do you mean redistribution?_\n\nFor Pyke's Peak Zero and its Zero Cost EULA, users may distribute (redistribute) the font file on an unlimited number of web servers as a download for redistribution provided they don't charge money for it or claim it as their own work. PP Zero may also be \"embedded\" on webpages using the CSS @font-face property which requires the font to be installed on a web server as a live webpage resource, in unlimited fashion.\n\nThat means PP Zero may not be redistributed on a commercial basis, ie: distributed \"for profit\" by charging money for it.\n\n_I’m trying to get a grip on what exactly commercial use is..._\n\nI define \"commercial use\" as; Use of the font for the purpose of promoting a commercial product, goods sold, or a service that makes its proprietor a monetary profit. That definition is not in my Zero Cost EULA, but the term \"commercial use\" is adequately defined by common commercial law in most countries. My commercial rights and \"right to profit from my invention\" are guaranteed by common commercial law, just as they are for any other merchant or entrepreneur.\n\nj a m e s\n\n"
    },
    {
      "time": "20 Jun 2008 — 2:50pm",
      "content": "Arbo: _That means PP Zero may not be redistributed on a commercial basis, ie: distributed “for profit” by charging money for it._\n\nBut the font may certainly be used for commercial purposes, ie: for making a profit out of—whatever you can think of as long as the profit-making is legal. PP Zero may also be used for personal purposes, ie: non-profit activities.\n\nThese license conditions do not apply to the commercial version of the font, Pyke's Peak, which has strict license conditions on distribution, ie: no, it cannot be freely distributed or used on webpages with the CSS @font-face rule as PP Zero can be.\n\nj a m e s\n\n"
    },
    {
      "time": "24 May 2009 — 9:50am",
      "content": "So can I throw an ethics question into this one (although I think I may know the answer)?\n\nI am designing a new mark for myself. I have not found the typeface I find suitable, although I have found one that is nearly there, but needs manipulation of its outlines in order to behave the way I would like it to.\n\nQuestions:  \na) Do I need to purchase that face in order to legally manipulate it? (process would be: A screen capture of the typeface, trace the letters I am interested in changing by creating my own curves in Illustrator, and then manipulate the forms to my liking.  \nb) Do I have the legal right to manipulate that typeface in the first place? or is that dependent on the user license agreement?\n\nRegards  \nOkay\n\n"
    },
    {
      "time": "25 May 2009 — 2:43pm",
      "content": "There are several aspects to this. I'll point out that I'm not a lawyer, and you're really wanting legal advice, so you might be best off talking to a lawyer. Frank Martinez is knowledgeable in this area, for instance.\n\na) do you need to purchase it first? The common wisdom in the type design community is that the usage you describe would not violate US copyright law. (Your user profile says you're in the US, so we'll assume this is the relevant question.) However, the recent paper by J.D. Lipton suggests that the matter isn't completely certain. I'd add that it would presumably violate a design patent, if one existed for the typeface. But if there's no design patent, and you trust the \"common wisdom,\" then no, you don't need to license it to do the usage you describe.\n\nb) If you do license it, then it becomes dependent on the license agreement in addition to other restrictions due to copyright or design patent.\n\nThe simplest thing might be to identify the font, and ask the folks who sell it.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "25 May 2009 — 3:54pm",
      "content": "Thanks Thomas, I'll follow your advice.\n\nOkay\n\n"
    },
    {
      "time": "28 May 2009 — 7:30pm",
      "content": "Dear Okay:\n\nWhat you are describing is a creative act, and you violate no copyright agreements by manipulating the character(s) in this manner. You make decisions about where to place your control points, orientation of the handles, etc., so you are creating a new, copyrightable work of art. It's not much different than my taking a photograph of a sculpture in a public plaza; while the sculptor may own the rights to his work, my photo is a creation in and of itself; I must make decisions about composition, exposure, lighting, and so forth. Note, however, that the sculpture is in a _public_ plaza; artist’s works in museums are usually protected from being photographed without express permission.\n\nIt gets a bit murkier when one creates outlines from an existing typeface, and then modifies them; one would then be using the control points determined by the original creator, arguably a violation of the EULA. But if one creates outlines, rasterizes them, and then uses the rasterized file as a reference to create new vectors, that would be a new creation. The law, at least, seems to be even more arcane than typography.\n\n"
    },
    {
      "time": "2 Jul 2009 — 3:31am",
      "content": "Not to make a complex subject simple, but if I look at a font's properties and find no copyright notice, am I in the clear to use the font? I am designing a book cover for a book to self-publish, and I'm also designing my own logo.\n\nThanks!\n\n"
    },
    {
      "time": "3 Jul 2009 — 8:07pm",
      "content": "Kari - No. All font usage should be based on the license with which the font was received. If you're not sure, use a web search (or even post on Typophile) to find the correct copyright holder and ask them specifically about your particular use case. Even if there is no posted copyright, the fact that the item \"exists\" means whoever originally created it has some form of rights ownership on that particular item.\n\nAt any rate, your question should be directed towards the creator of the particular font about what is or isn't allowed with their creation.\n\nI am not a lawyer and this should not be construed as legal advice. Hire a lawyer if you have legal questions etc.\n\n"
    },
    {
      "time": "4 Jul 2009 — 1:57pm",
      "content": "Since 1968 the use of a copyright notice (including that nice ©) is not mandatory. Copyright is establiched by default thru the first publication, which in the case of a computerfile could be the first transfer from one directory to the other.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "11 Jul 2009 — 12:24pm",
      "content": "Hopefully this question is on topic enough:\n\nIf I have fonts that were already on my Mac when I bought it, and came with Adobe's Creative Suite, I have the rights to use those fonts, yes? I've already effectively paid for their licensing. Do I have the right to use them on invitations or greeting cards I design and may sell?\n\nI assume the answer is yes, but this seemed the best place to clarify.\n\nThanks for any help.\n\n"
    },
    {
      "time": "11 Jul 2009 — 12:39pm",
      "content": "As always, it depends on what the license terms say. You should read the licenses for Mac OS and for the Adobe software the fonts came with. If anything is unclear, in principle you ought to consult a lawyer. Not that anybody usually does, but that's the theory.\n\nIf you want a non-legally-useful opinion? For these two sources (Apple and Adobe), I'm pretty sure you're fine designing and selling greeting cards or making invitations using the fonts. However, there are some foundries that have additional requirements, such as crediting the foundry on the card or some such. Some require additional licensing fees when the font makes up the primary element of the item you are making, such as magnetic letters for a fridge. But AFAIK Apple and Adobe have no such interesting issues.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "11 Jul 2009 — 5:15pm",
      "content": "If you bought the Mac new, and bought the Adobe CS new with it, then IMO you are entitled to use them for anything commercial (allowing for the same disclaimer as in the preceding post). If you bought the Mac second hand and Adobe CS was on it, that might be an altogether different matter ...\n\n"
    },
    {
      "time": "13 Jul 2009 — 7:07am",
      "content": "I bought both of them new.\n\nAny idea where I'd begin looking for the license info?\n\n"
    },
    {
      "time": "13 Jul 2009 — 10:46am",
      "content": "Try [this first](http://web.archive.org/web/20150414121813/http:/www.adobe.com/aboutadobe/antipiracy/ff_faq.html), perhaps.\n\n"
    },
    {
      "time": "8 Aug 2009 — 10:11pm",
      "content": "There are a couple of fonts on the Veer website that I really want to use in logos, but this is what the license agreement says:\n\n------  \nYou may not:\n\nuse a font and/or pictoral elements such as dingbats as part of a copyrighted logo, trademark or service mark. For example, you cannot copyright a specific glyph or multiple glyphs from a font when you copyright your logo, trademark or service mark;  \n------\n\nThis is really lame. Does this absolutely mean there is no way I can use ANY letters from these fonts in any logo designs?\n\n"
    },
    {
      "time": "8 Aug 2009 — 10:31pm",
      "content": "Re: My last post. It looks like this agreement clause is specific to Veer. Other websites selling the same fonts do not have this clause in their license agreement. Interesting.\n\n"
    },
    {
      "time": "10 Aug 2009 — 8:42pm",
      "content": "\\> This is really lame.\n\nAbsolutely. One does not copyright a trademark! One registers a logo, picture or likeness as a trademark. Leastways, that's my understanding.\n\nI know, not the point you're addressing, but it's odd seeing something like that in a supposed legal agreement.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "2 Dec 2009 — 6:09am",
      "content": "I've got to agree, the issue TraceElements brings up is really confusing. Veer puts designers in a very uncomfortable situation. I wish there was clarification on whether Veer really does disallow you to use type purchased from their website in logos that you wish to protect.\n\n"
    },
    {
      "time": "3 Mar 2010 — 4:22am",
      "content": "Just wondering specifically on the use of font elements/characters or even whole individual characters in the creation of logos.\n\nThat is, if as many logos go, they comprise of two elements: An image/logo and type (Or even wholly one or the other). Is it then therefore legal to use certain characters in a type-face to create a logo image in it's entirety. Could one say, take the 'O' from the Arial font and form a logo out of it? As an example, maybe having the O's overlapping each other to form a chain.\n\nOr, does this fall under the idea that it is not fair use unless the logo in question has been created entirely from scratch, or as someone mentioned above, inspired by the initial font design, rather than making direct use of the design from the get go.\n\nI guess: Is it okay to use letter based fonts in this way and not image based ones such as dingbats etc., or, does it simply fall foul of copyright either way?\n\nI've a feeling it'll be the latter ^^', but, just needed a clarification all the same.\n\n"
    },
    {
      "time": "11 Mar 2010 — 9:07am",
      "content": "I'm new to this game, and much of the thread has been confusing (I imagine because there are so many gray areas), but it does sound like many of you know what you are talking about. I have a real scenario:\n\nI am starting my own company, and am in the process of creating a new logo, business cards, website, maybe even a marketing brochure. The company logo will have a design element, along with the name of the company. I really like the Clarendon family of fonts for this logo, and specifically want to use the condensed font in the logo, and the other font family members in various text for the other materials. I have two questions:\n\n1) When I surf the web, I can find sites where I can download the family for free, and others where I have to pay for it. If I could find it for free and download, why wouldn't I just go ahead and do that, and am I violating any laws by doing that (and how would I know?)\n\n2) Assuming I can either download for free or buy it for a \"reasonable\" price, can I use the typeface in my logo and in my other business-related material (I am not looking to resell the font in any way) without any additional cost or legal issues?\n\nI want to do the right thing, but I don't want to overcomplicate it either. Other people I know who have started their own companies and did their own graphics paid absolutely no attention to any of this...\n\nI'm looking for very specific next steps so I can get this venture up and running asap.\n\nThoughts?\n\nThanks all!\n\n"
    },
    {
      "time": "11 Mar 2010 — 9:23am",
      "content": ".\n\n"
    },
    {
      "time": "11 Mar 2010 — 10:02am",
      "content": "<cite>If I could find it for free and download, why wouldn't I just go ahead and do that, and am I violating any laws by doing that (and how would I know?)</cite>\n\nOne of the biggest problems with free font sites is that some of the fonts are commercial fonts. In some cases this is the entire point of the site, but even on sites that do not allow pirate fonts users rename commercial fonts and upload them. If you don’t do enough design work to know which is which just buy a font. Really, they’re not that expensive.\n\n<cite>can I use the typeface in my logo and in my other business-related material</cite>\n\nYou need to read the license of a font before you buy it. Few font licenses will prevent you from using the the font in your day-to-day business materials or logos, but they are out there.\n\n"
    },
    {
      "time": "11 Mar 2010 — 10:58am",
      "content": "Thanks for the response & advice, James!\n\n"
    },
    {
      "time": "22 Sep 2010 — 3:31pm",
      "content": "Is it legal for a school to put a legally purchased font onto a central server and have the computers that are connected through its network use that font for school related projects?\n\n"
    },
    {
      "time": "24 Sep 2010 — 3:44am",
      "content": "It depends on the EULA of course. One can purchase broad licenses from some foundries.\n\nBut this use would be outside the use allowed by most \"off the shelf\" EULAs.\n\n"
    },
    {
      "time": "16 Nov 2010 — 11:46am",
      "content": "Also, just to clarify, one can definitely get a design patent, which will protect the design itself completely, for 14 years. A copyright offers a far longer term of protection, but the patent is a good start. The name of the font can also be trademarked, so that if you develop recognition of the name, even if someone steals the design, you'd still have the advantage of the naming rights.\n\n"
    },
    {
      "time": "20 Jan 2011 — 1:23am",
      "content": "Okay, so I'm the editor and (given the size of the staff) designer for my school newspaper. We reach maybe 220 people max, and print 125 copies. I was looking for a way to get Poynter Agate for free one day and I stumbled upon a Yahoo! Answers page that had a guy giving a link to Font Bureaus fonts. Like, at least one hundred fonts. Not the newest stuff, but a ton of stuff that would have cost thousands of dollars if I had bought all the licenses.\n\nThen, I found a BitTorrent file that had 65k fonts on it. Mostly they're junk but it probably has several hundred commercial fonts.\n\nI really don't like using these fonts illegally. However, there is no way in the world that my school newspaper would ever in a million years be able to pay like $600 to use each of the fonts. We're not making any money off of this, and in the future if I ever worked at a real newspaper of any kind (including college papers for example), I wouldn't use these \"bootlegged\" fonts.\n\nNow my question is, in essence, what are the ethics of this, and what are the actual legal issues in doing this. Are the font companies going to sue my school, sue me? And basically, since I assume the answer to that is no, since they probably have no clue I exist, and are probably more focused on serious abuses of their copyrights, what do you guys think of me doing this?\n\nI would ideally like reassurance that while what I'm doing may not be strictly kosher, it's not horrible either. I am open however, to being shamed into deleting these font files from my computer and going back to producing a paper consisting 90% of Georgia.\n\nThe reason I use the commercial fonts is because, obviously, they make the people look 1000 times better, which makes people read it. And in an age in which nobody reads the paper, especially teenagers, I feel like anything I can do to attract readers is worthwhile.\n\nThoughts?\n\n"
    },
    {
      "time": "20 Jan 2011 — 4:15pm",
      "content": "There are good fonts available for free, and the advice would be to go for that!\n\nFor example the Russian Paratype foundry has issued free fonts paid for by the Russian government which supports Latis script and every script used in Russia itself. PT Serif and PT Sans. The Serif is a bit squared, slightly condensed, tall x-hight, fresh and modern font, which could be easily used as a newspaper font. It is slightly more condensed than Utopia for example, which is a classic for newspapers.\n\nPT Sans is pretty useful, there is as well a condensed version, which could substitute Poynter Agate, as there are 2 Caption (small text) weights, 4 normal weights and 2 condensed weights.\n\n[http://www.paratype.com/public/](http://web.archive.org/web/20150414121813/http:/www.paratype.com/public/ \"http://www.paratype.com/public/\")\n\nUtopia itself comes for free too, in an older version. A classic newspaper Serif  \n [http://www.ctan.org/tex-archive/fonts/utopia/](http://web.archive.org/web/20150414121813/http:/www.ctan.org/tex-archive/fonts/utopia/ \"http://www.ctan.org/tex-archive/fonts/utopia/\")\n\nOther free serifs, maybe not for newspaper, but good quality and several weights (regular, bold, italics) are  \nBergamo, Gentium, Droid Serif, all on [http://www.fontsquirrel.com](http://web.archive.org/web/20150414121813/http:/www.fontsquirrel.com/ \"http://www.fontsquirrel.com\") Gentium and Droid could be useable.\n\nJunicode, a text face following the English tradition, condensed, but long descenders and ascenders, so it would be only so so for newspaper. [http://junicode.sourceforge.net/](http://web.archive.org/web/20150414121813/http:/junicode.sourceforge.net/ \"http://junicode.sourceforge.net/\")\n\nThere is a free Garamond version, again maybe not that suitable for newspaper, as it has a rather small x-height and more wide characters. Garamond 8 from URW: [http://www.artifex.com/downloads/](http://web.archive.org/web/20150414121813/http:/www.artifex.com/downloads/ \"http://www.artifex.com/downloads/\")\n\nAnother useful sans is aller in 7 weights  \n [http://www.fontsquirrel.com/fonts/Aller](http://web.archive.org/web/20150414121813/http:/www.fontsquirrel.com/fonts/Aller \"http://www.fontsquirrel.com/fonts/Aller\")\n\nAnd Lato - a sans in 10 weights  \n [http://www.fontsquirrel.com/fonts/lato](http://web.archive.org/web/20150414121813/http:/www.fontsquirrel.com/fonts/lato \"http://www.fontsquirrel.com/fonts/lato\")\n\nReally, with this choices, you do not need to steel others work, if there are some people giving away their work for free.\n\nI did not check any of their licences for your specific use, so do this please before using them.\n\nbest\n\n"
    },
    {
      "time": "21 Jan 2011 — 3:16am",
      "content": "In addition (newsletter mileage varies):\n\nTypes from the [Arkandis Digital Foundry](http://web.archive.org/web/20150414121813/http:/arkandis.tuxfamily.org/).  \n [Linux Libertine/Biolinum](http://web.archive.org/web/20150414121813/http:/www.linuxlibertine.org/).  \nVarious classics from [AIM](http://web.archive.org/web/20150414121813/http:/www.aimwell.org/Fonts/fonts.html).  \nLido STF, a [Stormtype](http://web.archive.org/web/20150414121813/http:/www.stormtype.com/) giveaway.  \nNeat display types, the [Kingthings](http://web.archive.org/web/20150414121813/http:/www.kingthingsfonts.co.uk/).\n\n"
    },
    {
      "time": "21 Jan 2011 — 9:34am",
      "content": "@paragraph\n\nThe Adobe \"Anti-Piracy\" FAQ says:  \n\"Generally, font software is copyrightable.\"  \nWell, how about ungenerally, then? Really, this seems like a weasel. It made me laugh.\n\n"
    },
    {
      "time": "21 Jan 2011 — 10:34am",
      "content": "@Louretta: _I feel like anything I can do to attract readers is worthwhile._\n\nOnce you start to believe that the end justifies the means, you’re on a slippery slope.\n\n> Alack, when once our grace we have forgot,  \n> Nothing goes right! we would, and we would not.  \n> —Shakespeare (Measure for Measure)\n"
    },
    {
      "time": "21 Jan 2011 — 1:42pm",
      "content": "Nick, why'd you have to quote that slimeball pirate Shakespeare?\n\nFrom [The David Mellinkoff Lecture: 8 February 2007, UCLA Law School](http://web.archive.org/web/20150414121813/http:/www.rhetoricainc.com/MellinkoffLecture.html) by Professor of Rhetoric Richard Lanham, also of UCLA.\n\n\"It is no exaggeration to say that Chaucer could not have put forth most of his work had he worked under current copyright law. One can easily imagine the letters of warning he would have gotten from agents and copyright lawyers and the permissions he would have had to pay, if he had been lucky enough to be allowed to pay them—and could have found the money.\n\n\"But Chaucer’s difficulties would have seemed trifling to a later pillar of English literature, **William Shakespeare** , had he lived in our current copyright world. Almost all his plays have sources, some of them very close. Take, for example Romeo and Juliet. Shakespeare’s immediate source was a poem by Arthur Brooke, The Tragicall Historye of Romeus and Juliet, published in 1562, some 35 or 40 years before Shakespeare’s version. Shakespeare’s play follows Brooke’s poem in embarrassing detail, everything almost, except poetic quality. Brooke’s poem is excruciatingly dull, Shakespeare’s play has given love its native language. This huge difference, this unbridgeable gulf, would not have protected Shakespeare from Brooke’s wrath, had they both lived in the present climate, however, because artistic quality is not allowed as a criterion in copyright cases. But Shakespeare could have pointed out, in self-defense, where Brooke stole the story from. It was not theft, Brooke might have replied, but honest borrowing since his (that is, Brooke’s) title page says “written first in Italian by Bandell” (a short-story writer named Bandello, whose stuff was often “adapted” into French by someone named Belleforet) and his (again Brooke’s) “To the Reader” preface mentions a play on the same subject “lately set forth on stage.”\n\n"
    },
    {
      "time": "21 Jan 2011 — 1:30pm",
      "content": "Not to forget Malory's definitive compilation _Le Morte D'Arthur_\n\n> …which copy Sir Thomas Malorye did take out of certain books of French, and reduced it into English. And I, according to my copy, have done set it in imprint, to the intent that noble men may see and learn the noble acts of chivalry, the gentle and virtuous deeds that some knights used in those days, &c., &c…\"\n\n—according to Caxton's preface (1485).\n\nI wouldn't say that Caxton was attempting to justify Malory's appropriation of foreign texts by the virtue of his disseminating their nobility, because nobody then would have seen anything wrong in Malory's modus operandi.\n\nThe ethics of copyright, and the laws, have evolved over time.  \nBut Shakespeare's observation (via the role of Angelo) holds up.\n\n"
    }
  ]
}
