{
  "id": "44358",
  "title": "Gill Sans Light",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "80 years after its initial release, it seems I can't walk 100 metres without seeing something set in [Gill Sans](http://web.archive.org/web/20140727161430/http:/typophile.com/wiki/Gill%20Sans). But can anybody provide any info on the fantastic light weight – like who designed it? Linotype, MyFonts and the other usual sources simply state 'by Eric Gill', but I doubt it's quite as simple as that! Thanks, Lir\n\n",
  "author": "lirmac",
  "time": "17 Apr 2008 — 3:10am",
  "uid": "22331",
  "comments": [
    {
      "time": "17 Apr 2008 — 3:26am",
      "content": "Typowiki-Entry of [Eric Gill](http://web.archive.org/web/20140727161430/http:/typophile.com/node/12115)  \nWikipedia-Entry of [Eric Gill](http://web.archive.org/web/20140727161430/http:/en.wikipedia.org/wiki/Eric_Gill).  \nWikipedia-Entry of [Gill Sans](http://web.archive.org/web/20140727161430/http:/en.wikipedia.org/wiki/Gill_Sans).\n\n"
    },
    {
      "time": "17 Apr 2008 — 4:06am",
      "content": "Thanks for the links. Unfortunately, while information on Eric Gill is plentiful, there is no info on who designed the _Light_ weight of Gill Sans. As far as I know, Eric Gill just designed the original roman and italic faces; the Light weight (in the Adobe set) appears to be far more recent. I'd love it if someone could clarify this.\n\n"
    },
    {
      "time": "17 Apr 2008 — 5:40am",
      "content": "That would be new for me. AFAIK he did create every weight singularily, but not in a mechanical way from one master-weight, but gave each weight its special character. That reflects his sense of manufacturing. Rough translation from [100besteschriften](http://web.archive.org/web/20140727161430/http:/www.100besteschriften.de/9_Gill+Sans+%5BUpdate%5D.html#a9).\n\n"
    },
    {
      "time": "17 Apr 2008 — 6:15am",
      "content": "Most likely, Gill Sans Light was \"designed\" by some team working for Monotype, then approved by a committee before being cut.\n\nAnd the specifics of a \"design\" usually changed from metal to photocomp to digital. Usually not for the best, though sometimes fonts were improved. Gill died around 1940, before photocomp.\n\nBTW, Gill's best text font was probably Pilgrim, which to my knowledge, has never been digitized. There was a photocomp version, not too successful because the setwidths were poorly done. With a lot of work on the kerning, it was quite nice. We use to set the <cite>South Atlantic Quarterly</cite> in Pilgrim, but had to change to different fonts when PostScript & PDF files became the norm.\n\n"
    },
    {
      "time": "17 Apr 2008 — 6:39am",
      "content": "<cite>Most likely, Gill Sans Light was “designed” by some team working for Monotype, then approved by a committee before being cut.</cite>\n\nI was guessing something like that had happened. It looks to me like the Light face is too thin for use in metal, so I had guessed it was developed as an addition to the Adobe Gill suite, but I'm perfectly willing to accept that it was cut for photocomp. It's a shame that history doesn't record Gill's posthumous 'collaborator', Gill Sans Light is something to be proud of, IMHO.\n\nIncidentally, Linotype offers a version of Pilgrim here: [http://www.linotype.com/57933/pilgrim-family.html](http://web.archive.org/web/20140727161430/http:/www.linotype.com/57933/pilgrim-family.html \"http://www.linotype.com/57933/pilgrim-family.html\")\n\n"
    },
    {
      "time": "17 Apr 2008 — 8:28am",
      "content": "Ah, thank you. It seems like the conglomerate finally got around offering it in PostScript. Unfortunately, no old-style figures or small caps; without them, it is useless to me (& should be useless to everybody). Looking at it, I suspect that all they did was re-digitize the Linotron 202 font, which had such a bad character fit.\n\nThe basis for Pilgrim was Bunyan, a private press font. I believe Bunyan never had an italic -- I use to know what Linotype did for an italic, but have forgotten. It would be nice if the new Linotype/Monotype conglomerate had gone back to the metal fonts & done it right. Pilgrim was a better text font than Joanna & far better than Perpetua.\n\n\\* \\* \\*\n\nI just went & looked, Gill Sans Light was available for the Linotron 202, a photocomp machine. Linotype & Monotype cross-licensed fonts in those days, since fonts were proprietary to the typesetting machine.\n\n"
    },
    {
      "time": "17 Apr 2008 — 10:07am",
      "content": "The identity of the \"collaborators\" in the drawing offices of both Monotype and Linotype are generally obscured in the mists of time. You have to remember that up until recently the manufacture of type was viewed as just that: manufacturing. Type design was essentially an industrial art. There were scores of folks working in the drawing office dutifully drawing out all the characters for each size of any given design. They were not generally acknowledged individually.\n\nSome of these identities can be recovered, at least for Linotype, by searching the archive of drawings at the Museum of Printing in North Andover. Linotype drawings used a format similar to industrial or architectural drawings, with title boxes listing all the pertinent manufacturing information, project number, date, etc., including the worker who did the drawing and approval signatures from the chain of approval. (I not familiar with the Monotype drawing practices.)\n\n-- Kent.\n\n"
    },
    {
      "time": "17 Apr 2008 — 6:39pm",
      "content": "And then there are the painfully thin versions of Gill that used to be commissioned by women's magazines in the late 90s and early 00s. Our contribution to the genre, as painful as it is\n\n[Skinny Eric](http://web.archive.org/web/20140727161430/http:/www.terminaldesign.com/CustomFonts/Fonts/SkinnyEric/)\n\n"
    },
    {
      "time": "17 Apr 2008 — 9:44pm",
      "content": "- _It looks to me like the Light face is too thin for use in metal, so I had guessed it was developed as an addition to the Adobe Gill suite, but I’m perfectly willing to accept that it was cut for photocomp._ \n\nThere are grounds to believe that Gill Sans Light was developed before the advent of phototypesetting.\n\n_‘Monotype’ Book of Information: New Enlarged Edition_ (London & Salfords: The Monotype Corporation Limited, [1959]) shows Gill Sans Light (Series 362) on pp. 104 and 116.\n\n_Specimen Book of ‘Monotype’ Non-Latin Faces_ (London & Salfords: The Monotype Corporation Limited, [1963]) shows the Cyrillic and the Greek versions of Gill Sans Light (series 362 and 672).\n\nBoth titles were printed letterpress, quite neatly.\n\n_A Book of Type and Design_ by Oldřich Hlavsa (New York: Tudor Publishing Co., 1960) says, on p. 220, ‘Gill Sans was produced in 1927, and between 1928 and 1930 was gradually introduced to the market in the light, medium, bold and bold condensed weights mostly with italics, in sizes from 5 to 72 points.’\n\nFWIW.\n\n"
    },
    {
      "time": "18 Apr 2008 — 5:57am",
      "content": "<cite>It looks to me like the Light face is too thin for use in metal . . .</cite>\n\nAs a rule of thumb, you can use a lighter typeface with letterpress than with offset. The ink spread will make the type appear a little heavier in letterpress. This happens with all papers, even coated stocks, though the amount of spread will vary with the paper. Usually the center of the stroke is lighter with letterpress -- the ink is pushed out -- but the edge heavier, so the general appearance is of a little more weight, and better definition.\n\n"
    },
    {
      "time": "18 Apr 2008 — 7:09am",
      "content": "Back in the day I printed a lot of Gill Sans Light in metal. It is gorgeous on the right paper, with the right ink, the right impression, and the right design.\n\nGo here to see more about Gill:\n\n[http://www.typotheque.com/articles/re-evaluation\\_of\\_gill\\_sans/](http://web.archive.org/web/20140727161430/http:/www.typotheque.com/articles/re-evaluation_of_gill_sans/ \"http://www.typotheque.com/articles/re-evaluation\\_of\\_gill\\_sans/\")\n\npowers\n\n"
    },
    {
      "time": "18 Apr 2008 — 8:36am",
      "content": "A few notes on the Gill article by Ben Archer in Wills link\n\n<cite> There are three developmental forms of the Gill Sans lowercase ‘a’ on record; revisions were made at the Monotype drawing office and passed back to Gill for approval. The original design for ‘a’ is strikingly similar to Johnston’s (as might be expected), followed by a second attempt which was put into production and can be seen on early specimen sheets. The third and least satisfactory character is seen in all versions of Gill Sans since the early 1930s</cite>  \nI have seen the second version in logos and signs dating from at least the mid eighties, so at least in photo comp & display it must have survived much longer.\n\n<cite> Gill obliterated the terminus endings of the vertical stroke in ‘b’, ‘d’, ‘p’ and ‘q’; the Monotype drawing office again came to his assistance and revised the forms so that they were preserved in the medium weight (this can be seen on early samples of the series 262). Today however, this feature only persists in the lightest weight of the digital GillSans.</cite>\n\nThese details have survived in the regular cut of Bitstreams version.\n\n"
    },
    {
      "time": "18 Apr 2008 — 9:51am",
      "content": " ![](http://web.archive.org/web/20140727161430im_/http:/typophile.com/files/GillGerman_4324.jpg)\n\nFrom an undated Monotype specimen (probably early 1950s), Belserdruck, Stuttgart.  \n\"M 10, Serie 262-11, Durchschuß 2\"  \nThere is also Bold, but no Light shown.\n\n"
    },
    {
      "time": "18 Apr 2008 — 10:25am",
      "content": "James, that's a great example of what you mentioned at the conference at Kean, how every women's magazine has to have an \"ultra-skinny\" typeface somewhere.\n\n"
    },
    {
      "time": "18 Apr 2008 — 11:00am",
      "content": "I understand how in Britain you could get thoroughly sick of Gill Sans' eccentricities, from overexposure to it. But I don't agree with much of Archer's sour analysis of it.\n\nYes, you can argue about the \"a\" tail being too small, but it is in character with the two-weight or relatively highly modulated g and e, and does have a flavor and way of spacing that is a different and arguably good solution.\n\nThere are to me a lot of virtues in Gill's design, and shortcomings in Johnston's that Archer doesn't note.\n\nThe biggest defect in Johnston's Underground is that the lower case has clotted joins. This is a fundamental defect that needed to be remedied somehow. It is still that way in P22 London Underground, which I think is a pretty faithful revival. Others under the influence of Johnston's none the less still great type face have fixed it in different ways.\n\nStill, Gill's ideas are by and large very good and to me work visually. The two-weight a is a way of getting all those stacked strokes into the space without being clotted. The g does the same and I think beautifully.\n\nThe spurless b d p q are also ways of reducing clotting in the joins, and add interest to the face, as well as solving a problem. I don't think they are a defect at all. Jeremy Tankard's beautiful Bliss follows Gill here, with characters that I personally like better than Gill's, but draw on his ideas. Tankard's g also follows Gill's lead, again with a different solution, though in this case not superior to Gill's.\n\nGill's face, with its modulations in key spots, overall gives a clean confident impression. Its sharp t and other details make it a bit too aggressive for my taste, which is why I prefer the softer and more elegant Bliss.\n\nStill there are occasions on which Gill's more assertive look will do better. It may be way over exposed in Britian, but it was and still is a good typeface. I really can't see the lower case of Johnston's face being well used \"as is\" for text at all. I fondly remember Johnston's caps on Underground stations from my years in England, and I hope they never change them. The lower case is not so bad on big signage, but still not so great either.\n\nFor all its eccentricities, Gill Sans is still a great face for print. I can't say that for Johnston's lower case.\n\n"
    },
    {
      "time": "18 Apr 2008 — 2:02pm",
      "content": "- _From an undated Monotype specimen (probably early 1950s), Belserdruck, Stuttgart._ \n\nNick, I am sure you know that what you show here is the _custom version_ of Gill Sans created for the continental/international market. It is an imitation of Futura commented on by Walter Tracy in his _Letters of Credit_ (p. 95). Its alternates — AJMNQRWW and abdgpqstuw (roman), and JMQ and aaefgptu (italic) — are set in a separate line in the _‘Monotype’ Book of Information_. The figures look especially unauthentic...\n\n"
    },
    {
      "time": "18 Apr 2008 — 3:08pm",
      "content": "William:  \n<cite> But I don’t agree with much of Archer’s sour analysis of it.</cite>\n\nNeither do I. And what about Pierpont, eh?\n\n"
    },
    {
      "time": "18 Apr 2008 — 6:12pm",
      "content": "\\>what about Pierpont, eh?\n\nI guess you are talking about this quote, from MyFonts:\n\n\\*  \n“I can see nothing in this design to recommend it and much that is objectionable” — Frank Pierpont’s first impressions of Gill’s drawings of Gill Sans, in a letter to fellow Monotype manager William Burch, 1927  \n\\*\n\nGiven what Pierpont did at Monotype, I'm sure he was a good craftsman. I wonder what his objections were, and why. I have a feeling they were different than Ben Archer's, as presumably Pierpont was involved in getting the final version of the a, with the small tail.\n\n"
    },
    {
      "time": "18 Apr 2008 — 6:18pm",
      "content": "I'll make a wild guess that he was still very much of the \"type for book typography\" mindset and couldn't wrap his head around what all the young kids, like Stanley Morison, were hip to at the time.\n\n"
    },
    {
      "time": "18 Apr 2008 — 9:28pm",
      "content": " ![](http://web.archive.org/web/20140727161430im_/http:/typophile.com/files/GillSDS_4805.jpg)\n\nFrom _A Book of Typefaces Rules And Ornaments,_ used by Brown, Knight and Truscott Ltd., London, 1961.  \nNote how the design of \"a\" is different at 36 and 30 pt., and the \"_a_\" at 36, 30, and 24 pt.\n\n"
    },
    {
      "time": "19 Apr 2008 — 4:05am",
      "content": "never seen that cursive italic e before, either!\n\n"
    },
    {
      "time": "19 Apr 2008 — 5:27am",
      "content": "<cite> &gt; I guess you are talking about this quote, from MyFonts:</cite>\n\nActually, what I had in mind was, despite Pierponts reservations he and his crew made Gill Sans into a good and proper typeface. He was much more than a gifted craftsman, just look at Plantin!\n\n"
    },
    {
      "time": "22 Apr 2008 — 6:07pm",
      "content": "Doesn't anyone from Monotype frequent this board? There is plenty of info on the origins of all the Gill cuts in the Monotype archives.\n\n"
    }
  ]
}
