{
  "id": "44367",
  "title": "Which Stempel Garamond?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all:\n\nWhich is better, Linotype’s Stempel Garamond or Bitstream’s Original Garamond?\n\nI’m referring to kerning and “technical polish”.\n\nThank you guys,\n\nMike Diaz\n\n",
  "author": "<a href=\"/web/20101017014458/http://www.typophile.com/user/12479\" title=\"View user profile.\">SuperUltraFabulous</a>",
  "time": "<br>",
  "uid": "12479",
  "comments": [
    {
      "time": "",
      "content": "More choices for Stempel Garamond are\n\n[http://www.myfonts.com/fonts/efscangraphic/garamond-sb/rom/](http://web.archive.org/web/20101017014458/http:/www.myfonts.com/fonts/efscangraphic/garamond-sb/rom/ \"http://www.myfonts.com/fonts/efscangraphic/garamond-sb/rom/\")\n\n[http://www.urwpp.de/cgi-bin1/dalcgi/source/fontliste0.htd?sprache=deutsc...](http://web.archive.org/web/20101017014458/http:/www.urwpp.de/cgi-bin1/dalcgi/source/fontliste0.htd?sprache=deutsch&auswahl=-1&fontnummer=g043003t&djpb-id=wddfb314733e98bd289987dbeae12bccd5a861fbdec \"http://www.urwpp.de/cgi-bin1/dalcgi/source/fontliste0.htd?sprache=deutsch&auswahl=-1&fontnummer=g043003t&djpb-id=wddfb314733e98bd289987dbeae12bccd5a861fbdec\")\n\nThis does not answer your question, of course.\n\n"
    },
    {
      "time": "",
      "content": "AFAIK, Linotype's version is the only one including Small Caps, if that's of any importance to you.\n\n"
    },
    {
      "time": "",
      "content": "Scangraphic version has Small Caps too as well as Paratype version of Original Garamond ( [http://www.myfonts.com/fonts/paratype/original-garamond-bt/](http://web.archive.org/web/20101017014458/http:/www.myfonts.com/fonts/paratype/original-garamond-bt/ \"http://www.myfonts.com/fonts/paratype/original-garamond-bt/\"))\n\nHere's a sample of LT vs. BT:\n\n ![](http://web.archive.org/web/20101017014458im_/http:/typophile.com/files/sg_3614.jpg)\n\n"
    },
    {
      "time": "",
      "content": "The letterfit in the Linotype PostScript (circa 1995 anyway) was atrocious. Unless it has been reworked, best to look elsewhere.\n\n"
    },
    {
      "time": "",
      "content": "The Linotype/Adobe Stempel G has oldstyle figures either default-loaded (Linotype) or globally switchable in OpenType (Adobe OT); Bitstream has long been indifferent to oldstyle figures (Iowan and Arrus were given them only recently). That's the clincher for me; I would never use liner figures with any Garamond if I could help it.\n\n"
    },
    {
      "time": "",
      "content": "<cite> &gt; (Iowan and Arrus were given them only recently). </cite>\n\nThat may or may not be true for Arrus, but Iowan Old Style had oldstyle figures from the very start. Granted, they were not default in the U&lc fonts, being included in the Small Caps fonts instead. But this was a common enough arrangement in the days of its release, along the Adobe Expert model.\n\nJohn was very thorough in this design, including many characters that the old formats couldn't adequately accommodate (like Catalan l-dot-l, fully-composed Polish ogonek characters, Croatian dyet) and which all had to be off-loaded to an \"extension\" font. All available in the 2001 release. John and Dennis were ahead of the curve.\n\nYou may feel that Bitstream is \"indifferent\" to oldstyle figures, but you can't use Iowan Old Style as an example.\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "That wasn't my experience Kent...I got Iowan when new and only liner figures were default-loaded:\n\n ![](http://web.archive.org/web/20101017014458im_/http:/typophile.com/files/iowanA_4975.png)\n\nand there were no small caps/expert fonts in my family where oldstyle figures might have been found:\n\n ![](http://web.archive.org/web/20101017014458im_/http:/typophile.com/files/IowanB_6141.png)\n\nThat oldstyle figures were long a rarity for Bitstream is well known to anyone who shopped and bought from them, and this certainly applies to their versions of Garamond.\n\n"
    },
    {
      "time": "",
      "content": "Well, John, all I can say is that when I licensed them (and I thought that was when they were first released -- my font files are dated Aug 2000, Sept 2000, Jan 2001, and Feb 2001 for various styles), I got the whole shebang. Along with a nice copy of a specimen booklet which shows all the goodies and beautiful examples of use.\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Bitstream Iowan Old Style, originally published in 1991, is John Downer's debut text family. […] Expert font sets, including small caps, extensions and alternates, as well as old style figure fonts, were added in 2000.</cite> — [Bitstream press release](http://web.archive.org/web/20101017014458/http:/www.bitstream.com/corporate/news/press_2002/type_020313_iowan.html)\n\n"
    },
    {
      "time": "",
      "content": "Ah, thanks Florian. I guess I'm not the early-adopter I thought I was.\n\n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Thank you guys for all you comments. Unfortunately after going through all the Stempel Garamonds (and ilk) I found all digitizations to be poor (Linotype) or incomplete (Bitstream). Most of the fonts I looked at had serious lapses in kerning. My favorite— “ara” as in garamond looks “gar” and “amond”.\n\nI wanted something designed for text but crisp and “sculptural” enough to be used for occasional light-duty display work.\n\nI’ve narrowed it down to Merlo, with Rongel and Verdigris also right there. I already have Minion and I’m not a Sabon person.\n\nDid I miss anything?\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "Janson/Kis? Clifford? Freight Text? Corundum Text?\n\n"
    },
    {
      "time": "",
      "content": "Loremipsum\\> Thank you again for your suggestions. Although I’m even more sure than ever about going with Merlo, I’m putting Corundum on my shopping list because its also super crisp, very well honed, and is an excellent value.\n\nFreight is also on my list but not anytime soon.\n\nClifford; I love, not crisp, but I love that one too. Akira Kobayashi said he would release an opentype version. I’m waiting for that one.\n\nI’m waiting for someone to do a serious learned reinterpretation of Kis. I like Tyrnavia very much. I just wish Gabor Kothay would come back to it and refine the kerning and perhaps the lowercase italic w. Also, improve diacritic placement.  \nFont Bureau (Studio) has an interpretation of Kis. Very nice, but definitely suited to newspapers it doesn’t have the left handed swashes in the lowercase italics (that I like) that would make it feel more literary.\n\nNexus is also on my list. Very crisp and kinda funky.\n\nBut Merlo for sure is happening. Although, I wish it had a bold.\n\nThank you all for your responses. This was helpful.\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20101017014458im_/http:/typophile.com/files/Merlo2_6273.png)\n\nI bought this one. Whoooo hooooo!\n\nI like Merlo so much better than Stempel by leaps and bounds.\n\nThe kerning rocks. I love the crisp details. It sparkles to me.\n\nPick up the phone and tell a friend !\n\nMikey :O)\n\n"
    }
  ]
}
