{
  "id": "44363",
  "title": "[Ray Fenwick Newsletter] I burst forth from the vortex, it closes behind me, I take off my \"shades\" and say:",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20080421215146/http:/typophile.com/user/7006 \"View user profile.\") : 17.Apr.2008 6.26am \n\nHAVE I GOT NEWWWWS FOR YOU!\n\nThat’s what I say when I step out of the above mentioned vortex, and I’m wearing cooler clothes than the last time we spoke and you’re like wow, I thought he was dead but he was just in the future and he has newwwwws for ME! And this isn’t some lame “Back to the Future” thing with stupid flying cars, no, it’s vortexes, cool clothes, cool new ideas and a pair of shades that are either perched on my head or covering my eyes. It is the Electric Light Orchestra album “Time”, which is a real mind-blower, by the way.  \nHAVE I GOT NEWWWWS FOR YOU!\n\nHall of Best Knowledge Book  \nLook, I am gonna be talking about this book for a while, as it’s just coming out and I am proud of it, so be prepared for this section to appear in every newsletter for the next while. I’m just sayin’ is all. Here are some HOBK related bits:\n\n- Early reviews are amazing! This is not me gloating, this is me relieved. People have ACTUALLY said the following things (except for one, can YOU pick the false one?)  \n“This is a life-passage story that reveals itself as such so slyly that the joy and loving humility it evokes at the end are breathtaking.”\n\n”...may best be described as the world’s funniest dictionary”\n\n“I tried to pet it and it bit me, it f\\*\\*\\*king BIT me, I mean, I paid through the nose for the thing and fed it and all that s\\*\\*t and it f\\*\\*\\*ing bites me?”\n\n“A tremendously engaging work.. filtered through a dry sense of humor, an unusual set of narrative techniques and a surprisingly cohesive story in the end.”\n\n- The amazing people at Tiny Showcase are going to be doing a special secret promo for HOBK very soon. They’ll be selling a limited edition run that comes with something special that they commissioned from me. More info on that soon!\n\n- There was an article in yesterday’s National Post about HOBK.\n\n- The official launch for HOBK is here in Halifax on May 14th—also happens to be the birthday when I turn SUPREME ANCIENT years old.  \n- I’ll be doing a mini micro tour to a couple cities for it in june, I think. Montreal, Toronto, NYC? More info on that later.\n\nCOMICZS [sic]\n\n- I continue to have comics and art in Fantagraphics’ MOME Anthology. In the forthcoming Summer 2008 issue I start my Truth Bear comic, which I am already well into and will be serializing over issues to come. Oh, and in the very same issue there’s an interview I did with Gary Groth that contains all eight of my darkest secrets.  \nHere is a loong link to that issue: [http://www.fantagraphics.com/index.php?page=shop.product\\_details&flypage...](http://web.archive.org/web/20080421215146/http:/www.fantagraphics.com/index.php?page=shop.product_details&flypage=shop.flypage&product_id=1459&category_id=152&manufacturer_id=0&option=com_virtuemart&Itemid=62 \"http://www.fantagraphics.com/index.php?page=shop.product\\_details&flypage=shop.flypage&product\\_id=1459&category\\_id=152&manufacturer\\_id=0&option=com\\_virtuemart&Itemid=62\")\n\n- I am doing something that is like a comic, as a special commission for Tiny Showcase. This is something separate from the HOBK promo, and if it’s half as good as it is fun to work on then it’s going to be so outrageous that it will shoot a beam of light into space. That’s more “fantastic” than “outrageous” but I’m already on the next sentence and can’t go back.\n\nART  \n- I have recently been drawing friendship bracelets, and plan to draw about 30 more.  \nSee: [http://www.flickr.com/photos/rayfenwick/sets/72157604576020105/show/](http://web.archive.org/web/20080421215146/http:/www.flickr.com/photos/rayfenwick/sets/72157604576020105/show/ \"http://www.flickr.com/photos/rayfenwick/sets/72157604576020105/show/\")\n\nILLUSTRATION  \n- I am totally doing that! [http://www.coandco.ca/ray/#id=illustration&num=1](http://web.archive.org/web/20080421215146/http:/www.coandco.ca/ray/#id=illustration&num=1 \"http://www.coandco.ca/ray/#id=illustration&num=1\")\n\nVIDEO  \n- I am totally sort of doing that! [http://www.flickr.com/photos/rayfenwick/2402991621/](http://web.archive.org/web/20080421215146/http:/www.flickr.com/photos/rayfenwick/2402991621/ \"http://www.flickr.com/photos/rayfenwick/2402991621/\")\n\nOkay. I am, right now, late to meet a friend for the first skate(board) of the season, so I’ll leave things there. Don’t forget about the free stuff!\n\nGetting rad,  \nEventually,  \nRay\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080421215146/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 17.Apr.2008 6.26am",
  "uid": "7006",
  "comments": [

  ]
}
