{
  "id": "44364",
  "title": "Blur effect in corel",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,  \n This is jagannath from Mumbai(India). I m working as a graphic designer from last 2 years. I m working on Adobe illustratorCS2 & Coreldraw13. Want to share with u all of designers one problem that I face allways. If u know illustrator u may know that u can aply blur effect to vector object without converting it to bitmap or raster image. Can we do it the same in coreldraw? I dont want to convert vector object into raster or bitmap image. If yes then how? It doesnot matter how i just want it look like blurish.....  \n is it right forum where i m putting this topic?  \nlooking for the reply........\n\n",
  "author": "artslons",
  "time": "17 Apr 2008 — 6:32am",
  "uid": "27176",
  "comments": [
    {
      "time": "17 Apr 2008 — 7:02am",
      "content": "Hi; [I only have Corel X4 (14), but I think most of what I'll say is true in 13]  \nthe actual \"blur\" effect is only available for bitmap images in CorelDraw, but dependign on what you want it to look like you might get something from other vector effects. The closest vector effect I can think of is the \"distort\" tool, available from the fly-out of the blend tool. you can see the tool here:\n\n ![](http://web.archive.org/web/20141122090447im_/http:/typophile.com/files/Untitled_3639.jpg)\n\nIn this graphic you can see the unaltered text, and effect caused by the distort tool:\n\n ![](http://web.archive.org/web/20141122090447im_/http:/typophile.com/files/Graphic1_5893.jpg)\n\nthanks,\n\nJason C\n\n"
    },
    {
      "time": "17 Apr 2008 — 7:33am",
      "content": "No man its not what i m looking for.....May be u r right that \"blur effect is only available for bitmap images in CorelDraw\". I have attached 2 images. look at firs image of snowboard image. Specially that \"red round\" see the bevel or emboss effect of that red roud. also chk that white shining effect on red round. If i want to make as it in corel is it possible? ITS ok if i convert it in bitmap.  \nAlso chk the 2nd image. See the top section of flame. Is it possible to make it in corel? doesnot matter any how........  \nAlso still want to be sure that is it possible to make bluer effect to vector objects in corel without converting it into bimap......\n\n ![](http://web.archive.org/web/20141122090447im_/http:/typophile.com/files/15588-Melbourne%20Snowboards%20Logo%20for%20Parkside_6532.JPG)\n  \n\n ![](http://web.archive.org/web/20141122090447im_/http:/typophile.com/files/Graphic1_5092.jpg)\n\n"
    },
    {
      "time": "17 Apr 2008 — 8:36am",
      "content": "Oh, OK. You can do that in Corel with a Blend effect.  \n(when you said \"blur\" I assumed you were trying to get the effect of an object being blurred, as if it was moving past the viewer very quickly.)\n\nWith the blend effect, you can draw the lightest part of the highlight you want to apply, then \"blend\" it into the base object, with as many steps as you'd like. Note that because you're working with vectors, this can be complicated. You're essentially creating lot of concentric contours, each slightly lighter than the previous one. The number of contours you use will determine how smooth the transition is, and it may take changing some of the nodes.\n\nI'm not sure what you're doing in the second image, it's too large for me to get what you're trying for.\n\nJason C\n\n"
    },
    {
      "time": "17 Apr 2008 — 11:18am",
      "content": " ![](http://web.archive.org/web/20141122090447im_/http:/typophile.com/files/flame_3887.jpg)\n\nblend\n\n-=®=-\n\n"
    }
  ]
}
