{
  "id": "44411",
  "title": "Non-Extractable Outlines in PDF",
  "forum": "Build",
  "tags": [

  ],
  "content": "Is there a way to create a PDF and not have the outlines extractable? I’m not too worried about it because extracting and composing back into a workable font would be alot of work, I’m just curious about this, I’m sure it’s been discussed before.\n\n [‹ OT Font Naming](http://web.archive.org/web/20080821152840/http:/www.typophile.com/node/44316 \"Go to previous forum topic\") [Conceptual Typeface Help ›](http://web.archive.org/web/20080821152840/http:/www.typophile.com/node/44399 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821152840/http://www.typophile.com/user/17099\" title=\"View user profile.\">Mike Jarboe</a>",
  "time": "<br>",
  "uid": "17099",
  "comments": [
    {
      "time": " 18.Apr.2008 2.08pm",
      "content": "One sure way is to turn the pdf into a picture (in Photoshop) and then save it as a pdf. It’ll lose some sharpness in the process.\n\n"
    },
    {
      "time": " 18.Apr.2008 2.24pm",
      "content": "You will lose the “font” and it will become “image”. At that point you are no longer showing your font.\n\n"
    },
    {
      "time": " 18.Apr.2008 4.16pm",
      "content": "Thats what I figured… to have a nice pdf that allows you to zoom in and see the characters clearly (one character filling the entire screen) the characters are extractable. If it’s turned into a picture you lose the clarity and the file size increases at higher resolutions (allowing enough room to zoom in and see full characters).\n\n"
    },
    {
      "time": " 18.Apr.2008 4.55pm",
      "content": "Yup, that’s about it.\n\nT\n\n"
    },
    {
      "time": " 19.Apr.2008 5.38am",
      "content": "The rule of thumb, actually quite logical one is: if the computer can take some vectors and turn them into bitmaps so they can be shown on screen, then there are some vectors there. If they are there, they can be transformed into other vector forms.\n\nIt’s a question of cost and effort. As far as I know, there still is no “out of the box” software for exctracting fonts out of PDF files. There are some semi-manual methods but they’re good for kids who have lots of spare time on their hands, and will end up with incomplete character sets and zero kerning tables anyway.\n\nA.\n\n"
    }
  ]
}
