{
  "id": "44421",
  "title": "(x) Beautiful Didone on Klas Ernflo rejected book covers - ITC Didi {Ben P}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello,\n\nCan someone please identify this beautiful font ?\n\n ![](http://web.archive.org/web/20100107130454im_/http:/typophile.com/files/22_vgogh_4338.jpg)\n\nmore views at [http://www.klasherbert.com/index.php?/rejected-book-covers/](http://web.archive.org/web/20100107130454/http:/www.klasherbert.com/index.php?/rejected-book-covers/ \"http://www.klasherbert.com/index.php?/rejected-book-covers/\")\n\nCheers\n\n",
  "author": "<a href=\"/web/20100107130454/http://typophile.com/user/17803\" title=\"View user profile.\">john good</a>",
  "time": "<br>",
  "uid": "17803",
  "comments": [
    {
      "time": " 19.Apr.2008 12.18am",
      "content": "The closest I came up with is Viola from Berthold but that’s not it. Carousel is also close, but again no cigar.\n\nMikey :-)\n\n"
    },
    {
      "time": " 19.Apr.2008 3.52pm",
      "content": "Yes, I saw those book covers too and wondered the same thing. I just e-mailed the designer and will post back here if he replies :-)\n\n"
    },
    {
      "time": " 19.Apr.2008 7.36pm",
      "content": "Looks like it’s already been answered about a year ago on this very forum:  \n**ITC Didi!** [http://www.typophile.com/node/33641](http://web.archive.org/web/20100107130454/http:/www.typophile.com/node/33641)\n\n"
    },
    {
      "time": " 19.Apr.2008 11.30pm",
      "content": "I’ve never heard of ITC Didi!\n\nNo one seems to be selling it.\n\nWhere can we buy it?\n\nMikey :-)\n\n"
    },
    {
      "time": " 20.Apr.2008 12.23am",
      "content": "I looked around more and ParaType Didoni is supposed to be Didi, but it’s not close enough- it’s optimized for text not display work like Didi is.\n\nPS... I think Didi is a really cute name for a font.\n\nMikey :-)\n\n"
    },
    {
      "time": " 20.Apr.2008 12.26am",
      "content": "URW DIDONI is as close as we are gonna get. But funny, in the connecting thread by goglu, the designer of Fluxism said he used Didi not Didoni. Where can we get a digitization of Didi?\n\nMikey :-)\n\n"
    },
    {
      "time": " 21.Apr.2008 6.59pm",
      "content": "Image Club Graphics digitized a version of ITC Didi from large format Velox masters back in 1989. When Image Club was part of Adobe Systems (c. 1998), several hundred typeafces (including our ITC Didi) were discontinued. It was determined that the quality of the outlines and metrics in those faces were simply not up to our upgraded technical and aesthetic standards at the time. Due to a lack of resources, ITC Didi was never redigitized.\n\nIf your are able to locate an older copy of one of Image Club’s Letterpress CDs, ITC Didi will be part of it. Unfortunately, my stash of those old discs has long since been exhausted.\n\ng.\n\n"
    },
    {
      "time": " 21.Apr.2008 7.46pm",
      "content": "Thanks for the annual Image Club insider info update, Grant.\n\nIt’s certainly not the same, but Paratype’s [Didona](http://web.archive.org/web/20100107130454/http:/www.fontshop.com/fonts/singles/paratype/didona_book_ot/?sample_text=Sagra&sample_size=144) is another high contrast didone alt. For more, see [this list](http://web.archive.org/web/20100107130454/http:/www.fontshop.com/fontfeed/archives/extra-bold-ultra-black-fonts/#didone).\n\n"
    },
    {
      "time": " 21.Apr.2008 8.06pm",
      "content": "A clarification: Didoni was a Phil Martin face very similar to Pistilli Roman, but with a lot of swash alternates (ironically missing from the digital version). ITC Didi and Didoni are only generally similar.\n\n"
    },
    {
      "time": " 21.Apr.2008 8.39pm",
      "content": "Well, it would be nice for someone to revisit Didi.\n\nThanks Grant for the info. I remember I saw Craw in an ImageClub catalog when I was a kid and thought it was the coolest thing in the world. Thank goodness that one survived.\n\nMikey :0)\n\n"
    },
    {
      "time": " 28.Apr.2008 3.41am",
      "content": "What a mess !\n\nthanks all\n\n+\n\n"
    },
    {
      "time": " 25.Jul.2008 12.45pm",
      "content": "if anyone’s still looking for ITC Didi i know where you can find it.\n\n"
    },
    {
      "time": " 25.Jul.2008 12.49pm",
      "content": "where?\n\n"
    },
    {
      "time": " 25.Jul.2008 1.48pm",
      "content": "[LINK REMOVED BY MODERATOR - TYPOPHILE.COM DOES NOT ALLOW LINKS TO PIRACY SITES]\n\n"
    },
    {
      "time": " 26.Jul.2008 3.22pm",
      "content": "“contact” me if you would like to know where to find it.\n\n"
    },
    {
      "time": " 27.Jul.2008 12.11am",
      "content": "Are you trying to be funny, Penn? :-{  \nYou just have been told via a moderator that sharing pirated fonts (or information where to find them) is not okay on Typophile.\n\n<cite>Such behavior is not looked upon kindly by those of us who make a living designing type or those of us who support the work of talented type designers.</cite> — from the [Forum Posting Guidelines](http://web.archive.org/web/20100107130454/http:/www.typophile.com/readme)\n\n"
    },
    {
      "time": " 27.Jul.2008 2.46am",
      "content": "I thought It was a hard typeface to find or something... _I thought it was never digitised_. I just wanted information... didn’t mean I wanted to download it... Sorry for causing any confusion by saying _where?_\n\n"
    },
    {
      "time": " 28.Jul.2008 7.43am",
      "content": "No Florian, I’m not trying to be funny. Since you can’t buy it or get it ANYWHERE other than a “piracy forum” I’d think it’d be okay since the survival of such a great font would be more important to me than simply letting it die out of respect for the original designer, OR simply because like many people have pointed out, it’s simply been overlooked. In any case . . . I’ll adhere to the posting guidelines and no longer seek to share this font with anyone.\n\n"
    },
    {
      "time": " 28.Jul.2008 7.56am",
      "content": "Well, someone (Imageclub) owns the rights. Still a legal matter.\n\n"
    },
    {
      "time": " 28.Jul.2008 9.24am",
      "content": "\\> letting it die out of respect for the original designer\n\nI’m all for keeping type alive, but distributing work without acknowledging royalties is no way to respect the designer.\n\n"
    },
    {
      "time": " 19.Sep.2008 3.50pm",
      "content": "Another alternative: [Moderno](http://web.archive.org/web/20100107130454/http:/www.fontshop.com/fonts/downloads/font_bureau/moderno_fb_normal/?sample_text=Temple%20Sagrada%20Familia)\n\n"
    }
  ]
}
