{
  "id": "44441",
  "title": "Un-needed Fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,\n\nI copied a bunch of fonts from Monotype and Adobe into my WINDOWS\\fonts folder. Even after deleting many of them, there’s still about 3,000. They seem to be slowing my computer down a bit. I installed them because I kept getting missing-font errors when using InDesign, Publisher, and Acrobat. A lot of them appear to be duplicates, but I’m not sure which version to keep. For example, there’s CaslonFiveForty. Then there’s Clarendon (a Type 1 font) and ClarendonMTStd. If I were to delete ClarendonMTStd, is there a chance I would get a missing-font error in Acrobat or InDesign for it, or would Windows automatically substitute the latter? Others look more different, like Century Light, even though I already have Century. I ran the dir command in the folder and saved the output in a text file. I attached it to this message. I was hoping to delete about 500 to 1000 of them.\n\nThank you for any help,\n\nRichard\n\n| Attachment | Size |\n| --- | --- |\n| [dir.txt](http://web.archive.org/web/20080421215158/http:/typophile.com/files/dir.txt) | 245.22 KB |\n\n [‹ ministry script](http://web.archive.org/web/20080421215158/http:/typophile.com/node/44440 \"Go to previous forum topic\") [What is the best font making software? ›](http://web.archive.org/web/20080421215158/http:/typophile.com/node/44457 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080421215158/http://typophile.com/user/29860\" title=\"View user profile.\">Richard.Maxwell</a>",
  "time": "<br>",
  "uid": "29860",
  "comments": [
    {
      "time": " 20.Apr.2008 1.03am",
      "content": "Get a font manager program. I’m a Mac person myself, but I think the problem is much the same. There is a manager where I work (also named Richard) who has the same problem on his Mac. Every time he opens FreeHand it runs slow as can be. His fonts are all installed in his Home/Library/Fonts folder which makes them all activated all the time. If you put them somewhere where they aren’t automatically activated and use a font manager program you should be able to solve that problem.\n\nLinotype has a free one you can try called Font Explorer. Most font managers will detect duplicates and other problem fonts for you and allow you to create sets of fonts to activate that you frequently use. The only fonts you really need to have activated all the time are your system fonts.\n\nStephen\n\n"
    },
    {
      "time": " 20.Apr.2008 9.39am",
      "content": "I agree with Stephen about using a font manager but I wouldn’t use Linotype’s manager for Windows if it is still in beta. It crashed my machine hard. There are several good, inexpensive options for Windows. I use Typograf which is only $35 and there are other good options for less than $100.\n\nSharon\n\n"
    },
    {
      "time": " 20.Apr.2008 3.09pm",
      "content": "Thanks Sharon and Stephen for the replies. I’ve been experimenting with FontExpert to browse them. I don’t know if it’s because I didn’t activate them to begin with, but when I right-click to deactivate them in FontExpert, it just deletes them. It does create backups, though. So at the moment I’m moving the font files to a backup folder. Fingers crossed... :)\n\n"
    }
  ]
}
