{
  "id": "44444",
  "title": "Sand Saref!?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Has this come up before?\n\n[http://www.cinematical.com/2008/04/19/the-spirit-gets-two-posters/](http://web.archive.org/web/20130216003636/http:/www.cinematical.com/2008/04/19/the-spirit-gets-two-posters/ \"http://www.cinematical.com/2008/04/19/the-spirit-gets-two-posters/\")\n\n",
  "author": "Si_Daniels",
  "time": "19 Apr 2008 — 10:44pm",
  "uid": "1049",
  "comments": [
    {
      "time": "20 Apr 2008 — 4:32am",
      "content": "So forties! Aside from this fanciful usage, lettering made of bricks has an ancient heritage in Chinese and Islamic architecture. Bricks of different colors or in relief would form the outline of square-shaped letters in a frieze. Here is a an example  \n [http://www.flickr.com/photos/youngrobv/884594610/](http://web.archive.org/web/20130216003636/http:/www.flickr.com/photos/youngrobv/884594610/ \"http://www.flickr.com/photos/youngrobv/884594610/\")  \nThis style later evolved into an Arabic lettering - and now font - style called square kufic.  \nSorry sii if this is not exactly the intended direction for this thread!\n\n"
    },
    {
      "time": "20 Apr 2008 — 4:42am",
      "content": "My guess was the Sand Saref - Sans Serif \"coincidence\"\n\n"
    },
    {
      "time": "20 Apr 2008 — 7:46am",
      "content": "\\>My guess was the Sand Saref - Sans Serif “coincidence”\n\nThat's a shame. :-(\n\nI'm not really into graphic novels, I've lived most of my life sans comics.\n\n"
    },
    {
      "time": "20 Apr 2008 — 12:22pm",
      "content": "I strongly doubt the name \"Sand Saref\" is a coincidence. Punny names are not uncommon in The Spirit comics.\n\nThe poster with the buildings turned into letters is very much in keeping with the graphic style of The Spirit. Eisner often worked the title of the strip graphically into the opening \"splash panel\" of his comics like that. The poster may even be based on one of them.\n\n"
    },
    {
      "time": "20 Apr 2008 — 5:25pm",
      "content": "As to Sand Serif herself, one must admit she is a very modern type with an extra bold character...  \n [http://www.comicbookbrain.com/\\_large\\_spirit\\_darwyn\\_cooke\\_no\\_12.php](http://web.archive.org/web/20130216003636/http:/www.comicbookbrain.com/_large_spirit_darwyn_cooke_no_12.php \"http://www.comicbookbrain.com/\\_large\\_spirit\\_darwyn\\_cooke\\_no\\_12.php\")\n\n"
    },
    {
      "time": "21 Apr 2008 — 6:16am",
      "content": "Phew, for a second I thought this was going to be about something else ...\n\n ![](http://web.archive.org/web/20130216003636im_/http:/typophile.com/files/Picture-1-copy_5312.gif)\n\n"
    },
    {
      "time": "21 Apr 2008 — 8:53am",
      "content": "Wow - Frank Miller is directing The Spirit movie?\n\nGreat!\n\nWatching Eva Mendes in that costume is probably already worth it.\n\n"
    },
    {
      "time": "21 Apr 2008 — 8:58am",
      "content": "Nice Beziers.\n\n"
    },
    {
      "time": "21 Apr 2008 — 9:16am",
      "content": "Now that is a film I will have to see just for the character's name alone! Although Si is right about the skillful rendition of curves. She may even deserve a TDC award as in \"Too Damn Curvacious\" :-)\n\nWas that story cooked up in a FontLab, BTW?\n\nChrisL\n\n"
    },
    {
      "time": "21 Apr 2008 — 6:12pm",
      "content": "Lovely i's\n\n"
    },
    {
      "time": "23 Apr 2008 — 9:59am",
      "content": "Is she from San Serriffe?  \n [http://typophile.com/node/43808](http://web.archive.org/web/20130216003636/http:/typophile.com/node/43808 \"http://typophile.com/node/43808\")\n\n"
    },
    {
      "time": "23 Apr 2008 — 8:41pm",
      "content": "Wow... I guess Frank Miller got a taste for directing when he did the Sin City flick with Robert Rodriguez! That first poster is way cool... The second poster is very hot, but doesn't really look like it's part of the same series... :-)\n\n"
    },
    {
      "time": "25 Apr 2008 — 5:11pm",
      "content": "This thread now has a female poster.\n\nI preferred the typographic poster, myself.\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:30pm",
      "content": "Me too, Eeblet.\n\nThis evening I saw a triptych poster for the film in midtown New York, but it's not like either of the posters linked above. I'll see if I can take some pictures over the weekend (if the posters are still there, that is).\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:35pm",
      "content": "Oh, by the way, [here are some images of The Spirit and Sand Saref](http://web.archive.org/web/20130216003636/http:/www.angelfire.com/art/wildwood/gizeh.html), as drawn by Will Eisner.\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:46pm",
      "content": "[More on Sand Saref](http://web.archive.org/web/20130216003636/http:/filingcabinetofthedamned.blogspot.com/2006/04/beauty-of-rough-edges-women-of-spirit.html), the character (comic book character, that is).\n\nInterestingly, the site mentions that \"Eisner patterned many of his women on movie stars of his day. (...) Silk Satin was Katharine Hepburn; Sand Saref was Lauren Bacall...\"\n\nTry to live up to **that** , Eva Mendes!\n\n"
    },
    {
      "time": "25 Apr 2008 — 9:39pm",
      "content": "Nice links, Ricardo - I don't care much for Will Eisner's comics, but his approach was brilliant and influential on almost anything interesting or good being done today in comics.\n\nIt seems there should be a huge crossover between fans of type and fans of comics/graphic novels... of all the art forms, comics takes its lettering most seriously. (Daniel Clowes & Chris Ware are not my faves - but, oh, they can letter! So can Crumb. Damn.)\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "25 Apr 2008 — 9:51pm",
      "content": "You know, speaking of R. Crumb, I believe Steven Heller dedicated the book [_Handwritten_](http://web.archive.org/web/20130216003636/http:/www.stoutbooks.com/cgi-bin/stoutbooks.cgi/69003.html) to him, with an introduction that displayed many examples of Crumb's lettering over the years. (I don't have a copy of the book now, but I once borrowed it from the Brooklyn Public Library.)\n\n[EDIT] And yeah, I agree -- those guys (Ware, Crumb, and others) are damn good when it comes to lettering, titling, etc.\n\n"
    },
    {
      "time": "3 Dec 2008 — 9:30pm",
      "content": "The trailer and the website of the movie are up:\n\n[http://www.mycityscreams.com/](http://web.archive.org/web/20130216003636/http:/www.mycityscreams.com/ \"http://www.mycityscreams.com/\")\n\nCheckout the \"Downloads\" section for wallpapers that use some of the elements from the posters.\n\n"
    }
  ]
}
