{
  "id": "44443",
  "title": "So I want to buy The Fleuron",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I want to pick up _The Flueron_ but don’t really want to spent somewhere between $500 and $1000 to put a set together. I’m interested in picking up a reproduction/facsimile. Are some better than others? And is the quality of the reproductions good, or is it on the level of the low-budget Dover stuff?\n\n [‹ What is the best font making software?](http://web.archive.org/web/20081011041241/http:/typophile.com/node/44457 \"Go to previous forum topic\") [M with single left facing serif ›](http://web.archive.org/web/20081011041241/http:/typophile.com/node/44422 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011041241/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 20.Apr.2008 1.14am",
      "content": "I got a hard bound edition of the Fleuron from Inter Library Loan & it was very nicely bound & printed. You might want to get a few from the Library before you plunk down the $. Not because it’s unworthy, it was really really great actually, but just so you have a good idea of what it is & how you feel about it.\n\n"
    },
    {
      "time": " 20.Apr.2008 1.49am",
      "content": "I have an excellent quality reprint (I think) - hardbound - the one with the Beatrice Warde article on Garamont (d) from 1928 and don’t think I paid more than 100 euros at the time maxi. I’ll look it up\n\nThere are specialists in typography books of course (Oak Knoll in the US and Wakeman, Collinge and Clark and Barry McKay in the UK etc)... I guess if you look up in ADDALL (amalgam of several sites) you’ll see tons of copies\n\nthey are damned heavy so prepare to pay mega postage if you find a set out of the US  \nand you have to insure as so much gets stolen by the postal services these days (in my experience!)\n\n"
    },
    {
      "time": " 20.Apr.2008 12.27pm",
      "content": "correction: I actually have a thing called the Fleuron Anthology; selecting v best articles to appear in Fleuron - it is in same format as original - pblsr Univ Toronto Press and Ernest Benn in 1973 and beautifully done in letterpress and offset for the repros... it cost me about £40 some eight years back...un bel objet !\n\n"
    },
    {
      "time": " 20.Apr.2008 1.36pm",
      "content": "_I want to pick up The Flueron but don’t really want to spent somewhere between $500 and $1000 to put a set together._\n\nIf you can find a full set of The Fleuron for $500, you have found a bargain. Grab it.\n\n"
    },
    {
      "time": " 20.Apr.2008 1.58pm",
      "content": "<cite>If you can find a full set of The Fleuron for $500, you have found a bargain. Grab it.</cite>\n\nI should be so lucky. Unfortunately that’s just what I would expect the minimal cost to be if I buy individual issues in shabby condition.\n\n"
    }
  ]
}
