{
  "id": "44456",
  "title": "Logo for fictional political magazine.",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all,\n\nI’m working on a magazine spread project to bolster my portfolio for an upcoming portfolio scholarship exhibition. I settled on desiging a political magazine that is aimed at college aged young adults and more creative types. I settled on the name Ars Politica (our politics) and right now im testing out different fonts for the header/logo. I’m trying to create some typographic contrast by using two different font styles because i want the header to feel political yet youthful and fresh at the same time. As of now i have about a dozen or so options but im none of them are particularly jumping out at me. So i could really use any suggestions/comments on whichs ones work/don’t work and what other layouts or fonts might be good to use.\n\n| Attachment | Size |\n| --- | --- |\n| [logo\\_comps.jpg](http://web.archive.org/web/20081007164311/http:/typophile.com/files/logo_comps.jpg) | 275.17 KB |\n\n [‹ Company Name](http://web.archive.org/web/20081007164311/http:/www.typophile.com/node/45587 \"Go to previous forum topic\") [Retaurant Logo ›](http://web.archive.org/web/20081007164311/http:/www.typophile.com/node/45325 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007164311/http://www.typophile.com/user/17485\" title=\"View user profile.\">brokedesigner</a>",
  "time": "<br>",
  "uid": "17485",
  "comments": [
    {
      "time": " 20.Apr.2008 12.48pm",
      "content": "Hi.\n\nI’d stay away from the dot matrix stuff..\n\nif i had your brief, id be considering Gotham, by Hoefler & Frere Jones - also they have some other really nice fonts that Gotham combines well with, such as Mercury. that combo would give you a great starting point...\n\ncheck their site out at typography.com\n\njust a thought.\n\n"
    },
    {
      "time": " 20.Apr.2008 12.49pm",
      "content": ""
    },
    {
      "time": " 20.Apr.2008 3.56pm",
      "content": "Agree about Gotham (as a starting point at least)\n\nthe square batrix type makes me think stock exchange not (immediate) politics.\n\n ![](http://web.archive.org/web/20081007164311im_/http:/www.typophile.com/files/monthlyMark_4834.png)\n\n—————  \n**Paul Ducco**  \n [Creative Design Australia](http://web.archive.org/web/20081007164311/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 28.Apr.2008 11.57pm",
      "content": "I thought “Ars” was “art” in Latin. (“Arse Politica” seems more fun.)\n\nFor politics, I’d definitely avoid Gotham - right now, it’s strongly associated with Obama. Unless that’s what you’d want, in which case great!\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 19.May.2008 4.56pm",
      "content": "well, lets see, I have to agree, looking at your logos didn’t inspire ’political magazine’ they were more like ’website’ to me.\n\nTake a look though political magazines at the bookstore.\n\nFrom what I’ve been able to tell, most successful and long-term magazines use simple beautiful typography, and don’t rely on imagery or new typefaces.\n\nThink of Esquire, Time, and Harpers (the oldest magazine, and still in regular print)\n\nI think you can pull off something that hits the mark better than your current concepts because of the skill you’ve already shown.\n\nbest of luck, and remember, like copmany logos, sometimes the best and most recognizable are the simplest (Sony, Panasonic, Toshiba, Microsoft, IBM, Yale)\n\n"
    },
    {
      "time": " 21.May.2008 12.39pm",
      "content": "Just a heads-up, you are aware of Ars Technica right? [http://arstechnica.com/index.ars](http://web.archive.org/web/20081007164311/http:/arstechnica.com/index.ars \"http://arstechnica.com/index.ars\")\n\n"
    }
  ]
}
