{
  "id": "44466",
  "title": "Regional music magazine, feedback please",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Not too sure if this is in the right forum, but here goes anyway.\n\nI’ve been given a University brief to design or re-design a magazine of my choice.\n\nI chose to re-design a regional Music magazine, please find attached my first attempts of the redesign.\n\nAny feedback, good or bad is greatly appreciated.\n\nThanks, RDC\n\n| Attachment | Size |\n| --- | --- |\n| [narc\\_1.pdf](http://web.archive.org/web/20080821154154/http:/typophile.com/files/narc_1.pdf) | 387.13 KB |\n\n [‹ Typecase questions](http://web.archive.org/web/20080821154154/http:/www.typophile.com/node/44480 \"Go to previous forum topic\") [Paradigm ›](http://web.archive.org/web/20080821154154/http:/www.typophile.com/node/44400 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821154154/http://www.typophile.com/user/29461\" title=\"View user profile.\">rdc_1985</a>",
  "time": "<br>",
  "uid": "29461",
  "comments": [
    {
      "time": " 20.Apr.2008 6.38pm",
      "content": "First, save this with spreads and re-upload it.\n\nYou can’t think of any better way to handle the headlines than to just use all caps in a chunky display face? And why is your masthead just a rehash of the headlines? Why does the cover look like an amateur magazine likely to be printed at a copy shop?\n\n"
    },
    {
      "time": " 20.Apr.2008 8.49pm",
      "content": "I like it. It certainly is not good glossy magazine design if that’s what you’re trying to achieve. I don’t really like standard magazine design and I like the spareness of this, especially the Vampire Weekend page, although you slightly blew the crop of the photo.\n\nWhat I like about the cover is what James doesn’t, but I always preferred fanzines to gloss.\n\nYour professor almost surely wants more “design” than this, but I don’t…\n\npbc\n\n"
    },
    {
      "time": " 21.Apr.2008 3.46am",
      "content": "There are some basic typographic issues I found with your new design.  \nFor example:  \nI found few Widows in your text.\n\n ![](http://web.archive.org/web/20080821154154im_/http:/www.typophile.com/files/a_5261.jpg)\n\nYour text blocks has some poor rags as well. These creates disturbing white shapes on the margins. Turning off the Hyphenation is not enough, you need some manual lines breaks and the paragraph returns where needed.\n\n ![](http://web.archive.org/web/20080821154154im_/http:/www.typophile.com/files/B_6695.jpg)\n\nHave you followed any grid in your layout?\n\n"
    },
    {
      "time": " 21.Apr.2008 7.32am",
      "content": "Thanks for the feedback, its really helpful. I will be taking your feedback into consideration and hopefully this will result in a better magazine being produced.\n\nsatya - I’ve been using a 12 x 12 modular grid, set within margins.\n\n"
    },
    {
      "time": " 21.Apr.2008 9.17am",
      "content": "This looks to me like a rough start... basic elements placed where they need to go, but not much design per se. A music magazine is a great opportunity to really push the design... this looks too sparse and corporate for a music mag. I would take a trip to your local book shop or newsstand, and have a look at music mags... they usually are much more interesting. You need more color, graphics, backgrounds. Mix up the typefaces. Tweak the photos... mix it up. It’s too static. Good luck!\n\n"
    },
    {
      "time": " 21.Apr.2008 9.19am",
      "content": "Just reading through the other comments, I think you can still keep a fanzine look while pushing it more... fun assignment...\n\n"
    },
    {
      "time": " 21.Apr.2008 10.22am",
      "content": "hang that punctuation!\n\n"
    }
  ]
}
