{
  "id": "44477",
  "title": "Logotype for fashion label",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I would appreciate some critique on this logotype. Especially on the kerning, i know its not perfect, but kerning script fonts like this can be a bit tricky. The face is Emily, and it was going to be used for a female fashion label.  \nCheers\n\n ![](http://web.archive.org/web/20110101140236im_/http:/typophile.com/files/Birgull_Web_5491.jpg)\n\n",
  "author": "<a href=\"/web/20110101140236/http://www.typophile.com/user/23280\" title=\"View user profile.\">Gregers™</a>",
  "time": "<br>",
  "uid": "23280",
  "comments": [
    {
      "time": "",
      "content": "The U looks a bit like an A in my opinion, maybe the left stroke should echo the right? But thats to do with the face im guessing.\n\nAlso think the U has too much space, perhaps straightening the strokes will help to judge the kerning better, especially in proportion to the Ls and G?\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the advice.  \nI straightened the stroke of the u, and it worked out quite all right. I also closed the counter of the g.  \nIt still needs a lot of cleaning up though.\n\n ![](http://web.archive.org/web/20110101140236im_/http:/typophile.com/files/birgull_Web02_5149.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I would like you to look at making the graphic underline a heavier or lighter weight. You need some separation from the name. You have made the graphic as important as the name, Not a great idea. Think about it.\n\n"
    },
    {
      "time": "",
      "content": "Cheers Dan.  \nI'll give that a go. Initially I went for a kind of monoline feel, but I see what you mean and I believe it would improve it.\n\n"
    },
    {
      "time": "",
      "content": "...On second thought, Uhmm??\n\n ![](http://web.archive.org/web/20110101140236im_/http:/typophile.com/files/birgull_Web03_3973.jpg)\n\n"
    },
    {
      "time": "",
      "content": "imo the original weight was better. i'm going back and forth on the simplicity of the stroke or the extra swirl. I might go without it.\n\n"
    },
    {
      "time": "",
      "content": "I think it's the B ... but the whole thing seems to be swaying right.\n\nnot sure the descenders of the B and g being different heights and counter sizes is helping.\n\nlike the direction though.\n\n----------  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20110101140236/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "I like the original, but see the the 'u' is a little off. What about making the curl tighter? (I also like the second.) I do like the new resolve on the 'rg' pair though.\n\nThe first solution, with the large exiting swash balances the B. This is a logotype, no? Don't box it in too much if it is screaming to be free.\n\n"
    },
    {
      "time": "",
      "content": "IMO, the ascender of the B should follow the shape of the L.\n\nI hope this helps.\n\n- Manuel\n\n"
    },
    {
      "time": "",
      "content": "Thanks a lot everyone. :-)  \nYes Miss Tiffany, it is a logotype. Do you reckon it would be better to drop the underline??\n\n"
    },
    {
      "time": "",
      "content": "I liked the underline as you had it to begin. The swash was a nice way to finish the underline and balance the B.\n\n"
    },
    {
      "time": "",
      "content": "The way the underline is broken by the g bothers me. This is a quick and (very) dirty example, but maybe the idea is worth exploring?\n\n ![](http://web.archive.org/web/20110101140236im_/http:/typophile.com/files/Birgull_Web_5491%20copy_5262.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I like where this is going. Keep it up!\n\n"
    },
    {
      "time": "",
      "content": "I was going to comment along the lines of Eileen. Right now the bottom of the B and g are too close. There needs to be more of a difference (ala Eileen's suggestion)\n\n"
    },
    {
      "time": "",
      "content": "But I think have the underline intersect with the g breaks the shape.\n\n"
    },
    {
      "time": "",
      "content": "The second one you did is the one I like best. The only thing that bugs me is the shape of the scroll underneath. I started wondering if the scroll itself could be the underline and did some experimenting:\n\n ![](http://web.archive.org/web/20110101140236im_/http:/typophile.com/files/birgull_fun_6642.gif)\n\n"
    },
    {
      "time": "",
      "content": "Very nice, Russ, I really like your improvements! It has a much more cohesive feel.\n\n"
    },
    {
      "time": "",
      "content": "brilliant work Russ\n\njust the rg thing nowme thinks\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20110101140236/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "That is nice. I still think the underline should be swashy. But, don't you feel that now you've added weight the bottom bowl of the g? You've basically filled it with white. Or am I thinking too much?\n\n"
    },
    {
      "time": "",
      "content": "First I would like to say the development of this logo on the thread is very interesting.\n\nThe only concern is how this will look on a reduced on a fabric label, will it be too thin?\n\n"
    },
    {
      "time": "",
      "content": "sorry to butt in with questions but fashion label is very vague.\n\nCould you give us anymore details about it?\n\nHigh street, female/male, street, plain etc ...\n\n"
    },
    {
      "time": "",
      "content": "The way the underline is broken by the g bothers me.\n\nHei Eileen, This is very nice. I really like the way this is going. Nice solution.  \nCheers.\n\n"
    },
    {
      "time": "",
      "content": "Also A big thanks to everyone who have picked up on this thread.  \nI am really busy at the moment, but will try to keep you posted as development progress.  \nShould say that this is still not a live brief yet(kind of a pitch at this stage), however with your help i believe it might go live.  \nCheers everyone\n\n"
    },
    {
      "time": "",
      "content": "The second one you did is the one I like best.\n\nHey Russ  \nI really do like your way as well, I am thinking now of something between yours and Eileens.\n\n"
    }
  ]
}
