{
  "id": "44487",
  "title": "Arial vs Verdana on the web- how to convince a marketing manager?",
  "forum": "Redemption\\_seeking\\_sheep\\_thief's blog",
  "tags": [

  ],
  "content": "We are currently revising our website, which uses Verdana for most of the body copy and navigation etc. My boss thinks that using arial instead is a great idea, and despite my protestations that Verdana was designed for the web and screen and arial is a dirty Microsoft knock-off, designed only to save money, he needs some convincing. Put on the spot I mumbled something about Verdana being more accessible and legible on screen and more efficient, but as I'm not a typographer I thought I'd ask for help from the real experts.\n\nCan someone help me out with some solid reasons that might convince a typographically illiterate person that the choice of font for the web IS important, and that Verdana is preferable to Arial in this case?\n\nOf course if people agree with him I'll shut my mouth and never give an opinion on typographical matters again.\n\ncheers.\n\n",
  "author": "Redemption_seek...",
  "time": "21 Apr 2008 — 10:02am",
  "uid": "29624",
  "comments": [
    {
      "time": "21 Apr 2008 — 10:20am",
      "content": "Find your AD's machine, uninstall Verdana, change the CSS to:\n\nbody {font-family: verdana, arial}\n\nEveryone is happy!\n\n;o)\n\nTo be fair, Arial isn't THAT bad on screen...in fact it's arguably better than Helvetica. That said, Verdana was specifically designed for the web, has a large x-height, and is pretty much ubiquitous and therefor, one could argue, 'friedlier' to the average web reader.\n\n"
    },
    {
      "time": "21 Apr 2008 — 10:40am",
      "content": "In small textsizes Verdana wins over Arial.\n\n"
    },
    {
      "time": "21 Apr 2008 — 1:38pm",
      "content": "Like Helvetica, Arial is a godawful nightmare at small sizes—at least in print where it can’t be saved by hinting. If customers will be printing off big chunks of text, it would make sense to use a font with fabulous outlines by Matthew Carter.\n\n"
    },
    {
      "time": "22 Apr 2008 — 2:24am",
      "content": "Thanks for the comments, the effect when printing from the web is a big consideration for us, so I will certainly pass this info on.\n\n"
    },
    {
      "time": "22 Apr 2008 — 3:22am",
      "content": "Arial imho too can be pretty good for the web. Depends all on what you want to achieve. Small print works better in Verdana though. Some time ago I had a small but really classy page designed in Arial and Arial Narrow (for intranet use; Arial Narrow is not available everywhere).\n\n"
    },
    {
      "time": "22 Apr 2008 — 6:55am",
      "content": "\"the effect when printing from the web\"\n\nIf the issue is print, then you can resolve that via print CSS separate from what you see on screen.\n\n"
    },
    {
      "time": "22 Apr 2008 — 9:06am",
      "content": "Neither Helvetica or Arial are really good for extended text. Not because they are sans but because of nuances of their design. Verdana holds up far better for that purpose. And has been mentioned, is quite screen oriented whereas Arial is less so. You might also consider coding your CSS for Candara which is also a MS font. It has been specially hinted for screen as well and is a sans like Araila & Verdana. Keep in mind that 11pt Verdana and 12pt Candara have similar apparent sizes - not 12 & 12.\n\n"
    },
    {
      "time": "23 Apr 2008 — 12:01am",
      "content": "Is \"Candara\" a Vista font? I have never heard of it. If it \\_is\\_ then it cannot be considered a \"standard\" font _yet_.\n\n"
    },
    {
      "time": "23 Apr 2008 — 4:19am",
      "content": "There isn't really much difference between Arial and Verdana \\*on screen\\* once you've compensated for optical size for a given height, and tracking (which can be done in CSS)\n\nYou can use this tool to compare:\n\n[http://typetester.maratz.com/](http://web.archive.org/web/20150220005710/http:/typetester.maratz.com/ \"http://typetester.maratz.com/\")\n\n"
    },
    {
      "time": "23 Apr 2008 — 6:59am",
      "content": "\"If it \\_is\\_ then it cannot be considered a “standard” font yet.\"\n\nNo, but it doesn't preclude one from spec'ing it anyways.\n\nAnyone know if MS has/will bundle their vista fonts with Office Mac?\n\n"
    },
    {
      "time": "23 Apr 2008 — 8:58am",
      "content": "\"Araila\"? :-P Man, I was typing way too fast.\n\n"
    }
  ]
}
