{
  "id": "44501",
  "title": "College project, could do with some inspiration",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi, I’m just starting my final major project in my art and design course at college and I’m at a blank for ideas. Everyones work is gong to be put up for exhibition in a few months time and I would really like to do something that is eye catching and interesting even to people that don’t really have an interest in typography. If anybody could give me some ideas it would be greatly appreciated as I’m really struggling and I’ve got to send off a statement of intent in a few days. Thankyou in advance to anyone that replies.\n\n [‹ ADVICE: Good Magazine Faces](http://web.archive.org/web/20080906123915/http:/typophile.com/node/44646 \"Go to previous forum topic\") [Korean Fonts ›](http://web.archive.org/web/20080906123915/http:/typophile.com/node/44631 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906123915/http://typophile.com/user/29956\" title=\"View user profile.\">tatemze</a>",
  "time": "<br>",
  "uid": "29956",
  "comments": [
    {
      "time": " 21.Apr.2008 5.05pm",
      "content": "Well, I just sent the [typeface specimen I did for my typeface design thesis](http://web.archive.org/web/20080906123915/http:/www.jpad.biz/lavinia_sans.html) to print. Nothing drops jaws like a new typeface.\n\n"
    },
    {
      "time": " 21.Apr.2008 7.37pm",
      "content": "Oh noes! Your ’y’ hasn’t fully descended!\n\n"
    },
    {
      "time": " 21.Apr.2008 9.58pm",
      "content": "Why do something you are not interested in?\n\n"
    },
    {
      "time": " 22.Apr.2008 4.56am",
      "content": "If you want to show off both your own skill and the potential for good typography you could work on existing, well known, but poor examples of typography and improve them.\n\nThis would serve to both to be interesting in it’s own right and to be accessible to non-typographers as they would have a point of reference from which to start.\n\n"
    },
    {
      "time": " 22.Apr.2008 1.50pm",
      "content": "sorry I dont think I explained myself properly. In reply to kidcranium, I am interested in typography but I’m doing an art and design course, so people who look at the work wont neccesarily have an interest in typography. Also I’m looking for a project that uses type, a poster for instance, or making pictures with type, more along the graphic design\\text art idea but im struggling for a subject matter.Heres some links and images of pieces I’ve found interesting(all from deviant art users) but I think I’ve been looking at so many mages my brains mashed.  \n [http://sugasuga42.deviantart.com/art/Say-it-While-You-Can-75084237](http://web.archive.org/web/20080906123915/http:/sugasuga42.deviantart.com/art/Say-it-While-You-Can-75084237 \"http://sugasuga42.deviantart.com/art/Say-it-While-You-Can-75084237\")  \n [http://treekin.deviantart.com/art/Taonga-Something-Precious-52010683](http://web.archive.org/web/20080906123915/http:/treekin.deviantart.com/art/Taonga-Something-Precious-52010683 \"http://treekin.deviantart.com/art/Taonga-Something-Precious-52010683\")  \n [http://outrospective.deviantart.com/art/cynical-33644232](http://web.archive.org/web/20080906123915/http:/outrospective.deviantart.com/art/cynical-33644232 \"http://outrospective.deviantart.com/art/cynical-33644232\")  \n [http://mistie.deviantart.com/art/Angels-of-the-dark-57568392](http://web.archive.org/web/20080906123915/http:/mistie.deviantart.com/art/Angels-of-the-dark-57568392 \"http://mistie.deviantart.com/art/Angels-of-the-dark-57568392\")  \nhttp://jazzbass26.deviantart.com/art/typography-II-49426352\n\n ![](http://web.archive.org/web/20080906123915im_/http:/typophile.com/files/bloody_type_by_tasteofpain_4051.jpg)\n \n ![](http://web.archive.org/web/20080906123915im_/http:/typophile.com/files/Gestalt___The_Principles_by_krystle_tears_4530.jpg)\n\n ![](http://web.archive.org/web/20080906123915im_/http:/typophile.com/files/vis_po_by_xscarredxeyesx_4353.jpg)\n\n"
    },
    {
      "time": " 23.Apr.2008 6.45am",
      "content": "Start with something that is personally interesting to you. What are your hobbies? Other things do you enjoy? Music, books, films... Don’t look for inspiration in these images... you should start with the subject matter, that will dictate the form your project takes.\n\n"
    },
    {
      "time": " 23.Apr.2008 2.05pm",
      "content": "Thankyou, that’s what I thought, every idea that I’m really interested in gets discarded by my teacher before I even start, he keeps telling me to concentrate on planning layout and design before I settle on a subject matter, which I find impossible, that’s part of the reason why I’ve got distracted by so many things.\n\n"
    },
    {
      "time": " 23.Apr.2008 2.19pm",
      "content": "“he keeps telling me to concentrate on planning layout and design before I settle on a subject matter”\n\nWhat? That’s absurd.\n\n"
    },
    {
      "time": " 23.Apr.2008 3.43pm",
      "content": "I second aluminum - it’s a lot easier to do layout and design when, you know, you have a message to convey or content to present! What in the hell is the point of layout and design without content? :)\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 23.Apr.2008 4.44pm",
      "content": "Tatemze,\n\nDon’t listen to what your teacher says, because obviously he hasn’t a clue. Your subject matter will ultimately determine what your design becomes.\n\nYou’ll find inspiration in the most unlikely places. Take a walk and observe your surroundings, look to literature, go to the library and read up on a subject unrelated to typography or design. Look at images of nebulas, sports cars and architecture. All of these things can create a spark that may lead your imagination in the right direction.\n\nIs there a message you want to convey? Something you feel strongly about? Start with politics perhaps, after all, don’t students always have some sort of opinion or cause they want to fight for? ;)\n\nBegin with a strong statement that you can use as your foundation [typographically as well as conceptually] and it may help you focus on where you’ll want to start your search for inspiration.\n\n"
    },
    {
      "time": " 23.Apr.2008 5.58pm",
      "content": "Tat, I agree with the others, your professor is clearly inept if he wants you to focus on design before choosing a subject. Pick your subject and just manipulate your teacher into going along.\n\n"
    },
    {
      "time": " 24.Apr.2008 5.04am",
      "content": "\\>Thankyou, that’s what I thought, every idea that I’m really interested in gets discarded by my teacher before I even start, he keeps telling me to concentrate on planning layout and design before I settle on a subject matter, which I find impossible, that’s part of the reason why I’ve got distracted by so many things.\n\nNot bad, for example your “pseudo subject” would be an orange or a refrigerator or a horse. You could illustrate, talk, photograph, etc. this subject in “100 styles”. You decide on one and get deep with this style. Show how you can transform your pseudo-object to this certain style you’ve choosen (do you know what i’m trying to say?).  \nSay you go the russian constructivist way, get informed about the original stuff /its history, the followers/new interpreters and what can come out now of this “genre and your orange” from your own skills.\n\n"
    },
    {
      "time": " 24.Apr.2008 5.34pm",
      "content": "Find a problem - and solve it in a visual form.\n\nI noticed you said you would like to do a poster of some kind. I know in london, and all over the world there is a big problem at the moment with people carrying weapons to course harm to others. How about an Ad campaign to stop people carrying weapons.\n\nYou could play on typographic treatment. In a real sense your design could save life’s, and of course will be good for the old portfolio to show that you have addressed real life issue through design.\n\n"
    }
  ]
}
