{
  "id": "44509",
  "title": "Recommended books for design classes",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "Hey everyone,  \nI'm looking for some input on good books, and not just text books (I get frustrated with \"traditional\" text books sometimes, for a variety of reasons). The class I'm wondering about specifically is called Print Based Media. The course description: _Principles and processes of visual communication in digital print; may include typography, image/text relationships, layout design and book arts._\n\nI've only taught it one time before, but didn't require a book. Since it's a pretty basic class the projects stay pretty basic—event posters, redesign book covers, one color, etc. I think the students would benefit from having a book to reference, especially since they generally haven't had much conscious exposure to design yet. Last time I taught it they were screaming for Photoshop tricks and computer gizmos, so a book that has some historical leanings might be nice.\n\nI probably haven't been very clear, so I apologize. Any input is appreciated.\n\n",
  "author": "Isaac",
  "time": "21 Apr 2008 — 9:59pm",
  "uid": "540",
  "comments": [
    {
      "time": "21 Apr 2008 — 11:36pm",
      "content": "This list seemed interesting:\n\n[Type Books for the well-read typographer](http://web.archive.org/web/20150417031102/http:/www.typebooks.org/topten-ndx.htm)\n\n"
    },
    {
      "time": "22 Apr 2008 — 1:12am",
      "content": "Good list. Just by browsing through the links I added a few books to my ever-expanding wish list.\n\nFor this particular class though, I need to stay less type focused (so why am I posting on typophile if I'm looking for general design books? Because there are a lot of smart people here, that's why). Amazingly, this school has exactly zero typography classes, so the students are not up to speed in that area. And a few other areas as well, but that's another issue. I just need them to go from the basic basics (form, line, etc, etc) to the mid-basics, like compositional basics.\n\nAs a side track, you wouldn't believe how many students are just not interested in anything off-screen. \"Can we use Photoshop for this?\" \"When can we learn Dreamweaver?\" Depressing.\n\nGood night.\n\n"
    },
    {
      "time": "25 Apr 2008 — 11:28am",
      "content": "Are you looking for stuff on printing technologies? That is the route I would take a print-based course. It is impossible to design for print without understanding paper and ink, things like traps and dot gain ... etc.\n\n"
    },
    {
      "time": "27 Apr 2008 — 10:47pm",
      "content": "Some info on technology and process would be good, and I agree a designer should know something about it, but I fear a massive mutiny if I make these people \"bored.\" I don't want to bore you with a list of my complaints and problems (kids these days!), so I'll just say that [the program itself](http://web.archive.org/web/20150417031102/http:/www.tricity.wsu.edu/dtc/) is not a regular graphic design program. Most of the projects will undoubtedly be output on the laser printers available at the school or on home printers. It's not bad to learn how to make something turn out good on a cheap ink jet printer, but some higher end or out of the ordinary stuff would be good as well. Lead type is definitely out. Boo-hoo.\n\nAnyway, any suggestions---no matter how technical or off-beat---are welcome and appreciated.\n\n"
    },
    {
      "time": "28 Apr 2008 — 1:04am",
      "content": "I've read a lot of Type & Design books this year, and the one that made the biggest impression on me was Jan White's Graphic Idea Notebook. It's just so weird and cool and inspiring, while at the same time reviewing the nuts and bolts of graphic communication (mostly in the context of pre-Photoshop magazine art direction). To be fair, the version I read was the 1980 edition and not the more recent 2004 edition. I'd love to take a look at that... although I prefer the older cover (the bigger img).\n\n ![](http://web.archive.org/web/20150417031102im_/http:/typophile.com/files/1-58115-354-6-2T_5116.jpg)\n\n ![](http://web.archive.org/web/20150417031102im_/http:/typophile.com/files/1600_1_4112.JPG)\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "28 Apr 2008 — 8:32am",
      "content": "Well, if you aren't going to bore them, where are you going to find your fun? :)\n\nA couple printing technology things that worked for me were: tearing apart an old hard cover book ($1 at a flea market) to see how it work, especially how the pages were imposed.\n\nGetting a piece of newspaper (this might cost more than the book) and having everyone tear out an ad or article. Great teaching moment on paper grain, and why you can tear easily one way, and not the other. Follow up with folding a piece of bond paper with and against the grain to see the difference. Finally, show the wrapper from the ream of bond (hopefully it will show the grain direction with an underline).\n\nLess exciting stuff involved looking at colored halftones with a loupe to see the angles of the halftone screens. Looking at black and white halftones to find the shape of the dots and the angle.\n\nMy students hated my course while they were taking it, but tended to rave over it when they got a job and found out that this boring stuff was important, and they moved ahead quicker than the students from other schools who didn't know it.\n\n"
    },
    {
      "time": "28 Apr 2008 — 9:04pm",
      "content": "\\<\\< Less exciting stuff involved looking at colored halftones with a loupe to see the angles of the halftone screens. Looking at black and white halftones to find the shape of the dots and the angle. \\>\\>\n\nI can see the looks of astonishment and hear the tortured bellows now. I love it. \"I thought we were gonna learn Photoshop! Wahhhhhh!\" I usually have a running assignment for students to bring something they found to class that they like or hate, and then I make them tell me why it's bad or good design. After about the third week of bringing things in they stop because they hate having to explain the coolness of a magazine cover to a geezer like me. ;)\n\neeblet: I'll do a little research on that book. It sounds interesting.\n\nThanks all.\n\n"
    },
    {
      "time": "28 Apr 2008 — 11:26pm",
      "content": "Isaac,\n\nWill you be teaching your students the difference between RGB colors and CMYK colors? I'm not kidding -- it seems that lots of practitioners don't know something as basic as that these days...\n\nAt the risk of boring your students **even more** , when I went to design school in the 80s one of the first books we had to read for design class was [_A Primer of Visual Literacy_](http://web.archive.org/web/20150417031102/http:/mitpress.mit.edu/catalog/item/default.asp?ttype=2&tid=7264), by Donis A. Dondis. It covers the basic elements of visual communication (dot, line, shape, direction, tone, color, texture, scale, dimension, movement), the dynamics of contrast, visual techniques (i.e., balance-instability, symmetry-asymmetry, regularity-irregularity, neutrality-accent, etc.), and so on. I think that 99% percent of my class complained about how boring it was, but one of my friends later admitted that he'd learned quite a bit by reading it. This book is mostly text with a few simple diagrams, but there are two alternative titles that have more graphics (and have more recent publication dates): [_Visual Grammar_](http://web.archive.org/web/20150417031102/http:/www.papress.com/bookpage.tpl?cart=110&isbn=1568985819), by Christian Leborg, and [_Graphic Design: The New Basics_](http://web.archive.org/web/20150417031102/http:/www.viget.com/inspire/graphic-design-the-new-basics/), by Ellen Lupton and Jennifer Cole Phillips.\n\nAnd Eeblet mentions Jan White! I borrowed some of his books from the library when I was just out of school; he has a few (one of them was called _Editing By Design_... it was for newspaper editors, but had a great chapter on design and layout). I think they are great for beginners -- they aren't densely packed with text or theory. Just what your action-seeking students might be into. :-)\n\n[EDIT] And wait a minute, beyond books, is there any way you can make a field trip to a local print or letterpress shop? How about a local magazine or newspaper? Those things are usually eye-opening experiences when you are still in school.\n\n"
    },
    {
      "time": "28 Apr 2008 — 11:29pm",
      "content": "I think they are great for beginners — they aren’t densely packed with text or theory.\n\nI think the non-linear approach isn't just good for beginners - it's the sort of thing that can bump you out of a rut when you're feeling uninspired. :) I'm speaking specifically of his notebook - the Editing by Design book isn't quite the same jolt of design bits.\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "28 Apr 2008 — 11:41pm",
      "content": "_I think the non-linear approach isn’t just good for beginners - it’s the sort of thing that can bump you out of a rut when you’re feeling uninspired. :)_\n\nOh, I absolutely agree, Beth! (And I didn't meant to offer up _Editing By Design_ as an example of his non-linear books... just praising the man's books in general. But he does have at least one or two more books done in the style of _Graphic Idea Notebook_... [This might be one of them](http://web.archive.org/web/20150417031102/http:/www.amazon.com/Using-Charts-Graphs-Thousand-Attention/dp/0835218945/ref=sr_1_7?ie=UTF8&s=books&qid=1209451121&sr=1-7).)\n\n"
    },
    {
      "time": "30 Apr 2008 — 6:56am",
      "content": "I always cover CMYK vs RGB, regardless of the class. And I always throw in as much typography material as I can since they haven't had any. The other thing I try to work in is chapter four from the Dondis book. Such great stuff, and it is dry and difficult to read, but great anyway (I love Univers generally, but the use of it in PoVL is not that great. It's very fatiguing).\n\nSome of the books I've been looking at from Amazon are poster collections (handmade and otherwise), books about how to use grids, and album cover design collections. I finally realized that I was looking for books to inspire rather than instruct, like eeblet mentioned. [Flatnessisgod](http://web.archive.org/web/20150417031102/http:/www.amazon.com/flatnessisgod-Ryan-McGinness/dp/1887128344/ref=wl_it_dp?ie=UTF8&coliid=I2MKO87R3L1KLP&colid=1PX0QJ3CQTQI9) by Ryan McGinness did that for me a few years ago, but unfortunately it isn't widely available.\n\nField trips are difficult since all of my classes start at 6PM.\n\nOff topic: Ricardo, are you a Boca fan? My son is nuts about the team. He wears his official Boca Juniors socks any time he gets a chance, and is constantly kicking a ball around the yard pretending to score goals against River. Everything has to be blue and yellow.\n\n"
    },
    {
      "time": "30 Apr 2008 — 8:28am",
      "content": "_Off topic: Ricardo, are you a Boca fan?_\n\nThat's a dang funny question, Isaac! No, I'm not, but my father was. I have a funny story about this. We moved to the States when I was 3 years old, then moved back to Buenos Aires when I was in third grade. I had no idea my dad was a Boca fan. So on my first day of class in Buenos Aires all these kids ask me what soccer team I am a fan of, and I don't know any teams. A bunch of them, obvious River fans, start shouting \"River! River!\" Next thing you know, I am at home having dinner with my folks and I tell them how I've become a fan of River. My dad's jaw drops, and after a beat he says, \"But I'm a Boca fan!\" Poor dad... I'm sure that was harder for him than when I told him I wanted to study graphic design. :-D\n\nSo anyway, for a while I was a River fan. My little brothers became fans of Racing. I have to say, though, I'm not much of a soccer fanatic.\n\n"
    }
  ]
}
