{
  "id": "44517",
  "title": "Clifford...Really??",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "If you would like to acquire a font family designed primarily for book design yet be able to use it for wider editorial design, especially the collateral for your books, Clifford poses real problems. Yes, it has a beautiful oldstyle look without hitting you over the head, but none of its optical weights comes with bold or bold italic, and you know that your book manuscript (especially nonfiction) will require one or both somewhere, and that your collateral pieces certainly will.\n\nDeep in the bowels of Linotype, I have discovered a text family that solves those problems: LINOTYPE REALLY at $126 for a four-font family, all of which are keystroke-linked, unlike Clifford's fonts.\n\n ![](http://web.archive.org/web/20131018223841im_/http:/typophile.com/files/LTReally_6200.png)\n\n ![](http://web.archive.org/web/20131018223841im_/http:/typophile.com/files/clifford18_5101.png)\n\n ![](http://web.archive.org/web/20131018223841im_/http:/typophile.com/files/cliffordnine_3864.png)\n\nLinotype Really has the same subtle oldstyle feel as Clifford eighteen or nine, and it's clean and large. Really's letter proportions are nice and wide whereas Clifford forces you to choose between the cleaner but more condensed eighteen versus the wider but blacker/clunkier nine optical weight.\n\nWhile Really's italics are not as funky as Clifford's, Really's oldstyle figures are much more stylish, especially the one and four. An undiscovered gem: Linotype Really. Try it!\n\n",
  "author": "mondoB",
  "time": "22 Apr 2008 — 3:37am",
  "uid": "14529",
  "comments": [
    {
      "time": "22 Apr 2008 — 3:58am",
      "content": "And here’s a link:  \n [Linotype Really™](http://web.archive.org/web/20131018223841/http:/www.linotype.com/13950/linotypereallymedium-font.html#info) by [Gary Munch](http://web.archive.org/web/20131018223841/http:/www.munchfonts.com/) (a [typophile member](http://web.archive.org/web/20131018223841/http:/www.typophile.com/user/4152), btw – though not that active lately)\n\n"
    }
  ]
}
