{
  "id": "44515",
  "title": "numbers in font names",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "is it legitimate to use numbers in font names? e.g.: \"Fontname2008\"  \nI suppose there shouldn't be since Frutiger used his number system with his fonts, but just to make sure is why i am asking here.\n\ncould there be problems with apps that wont accept this?  \nthanks for any replies  \nHenning\n\n",
  "author": "dehac",
  "time": "22 Apr 2008 — 2:34am",
  "uid": "15122",
  "comments": [
    {
      "time": "22 Apr 2008 — 3:00am",
      "content": "It's perfectly legitimate to use numerals in font names, and you shouldn't experience any problems when doing so.\n\nPostScript allows font names to contain any printable non-space ASCII character (character codes 33 to 126, inclusive), except for the following 10 characters: \"[\", \"]\", \"(\", \")\", \"{\", \"}\", \"\\<\", \"\\>\", \"/\", \"%\".\n\nTrueType is even more permissive than that.\n\n"
    },
    {
      "time": "22 Apr 2008 — 5:12am",
      "content": "There may be some constraints. If I recall correctly, the PostScript naming convention for printer files is the first five characters for the first part of a font name, but the first three for every subsequent part. For instance, the printer font for Fontname Extra Bold Condensed would be FontnExtBolCon.\n\nIf you had two fonts called Fontname2008 and Fontname2007, the printer font files would get the same name Fontn200. That would cause problems.\n\nI don't believe that OpenType has any of these restrictions.\n\nI'll leave it to Thomas or Karsten or someone else who understands naming issues much better than me to provide any correction or elaboration.\n\n-- K.\n\n"
    },
    {
      "time": "22 Apr 2008 — 10:00am",
      "content": "What Kent just described is true, as a restriction on Mac OS Type 1 fonts. AFAIK there is no issue for Windows Type 1 or OpenType.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "22 Apr 2008 — 12:58pm",
      "content": "If you use a numeral in the PS Font Name and run a name audit in FontLab, it will give you an error alert.\n\nJames\n\n"
    },
    {
      "time": "23 Apr 2008 — 10:26am",
      "content": "This is then a bug in FontLab. There have always been examples of fonts with numbers in the PostScript FontName. The document \"Adobe Technical Note #5088 Font Naming Issues\" at:  \n [http://www.adobe.com/devnet/font/](http://web.archive.org/web/20150322041553/http:/www.adobe.com/devnet/font/ \"http://www.adobe.com/devnet/font/\")  \nlists the real PS name restrictions. Note, however, that this 1993 document covers a lot of issues that are not now a problem. The limit of 28 characters for Mac OS 7 is no longer a constraint, and I would no longer worry about whether the 5-3-3 naming rule for Mac OS 9 Type 1 printer (aka LWFN) files is sure to to generate a unique file name.\n\nRead\n\n"
    }
  ]
}
