{
  "id": "44567",
  "title": "Help! I need advise please",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am currently wanting to do an editorial piece, but in a typographic form. I am having problems with the subject to base it on. I have thought of the following themes I thought would help using experimental typographic layouts.\n\n\\* Conversations on something controversial  \n\\* Art movements  \n\\* The word 'black'  \n\\* The word '1st'  \n\\* Film posters but typographically  \n\\* The letter G  \n\\* Funny useless facts  \n\\* Fonts (but developing a humorous story behind them all and creating pretentious character etc)  \n\\* Numbers\n\nI'm having problems. It's making me crazy. Any feedback and advice welcome. Thanks.\n\n",
  "author": "missgiggles",
  "time": "23 Apr 2008 — 3:03am",
  "uid": "14600",
  "comments": [
    {
      "time": "23 Apr 2008 — 5:24am",
      "content": "Hmm...i'm asking for advise. How to go about it. Nothing more.\n\n"
    },
    {
      "time": "23 Apr 2008 — 5:32am",
      "content": "It's a very broad request. Shouldn't you be asking about typography once you've chosen your subject, and not asking for advice on editorial content?\n\nI'm sure you could make an excellent piece from any one of those topics, but I think you ought to be the one to choose it.\n\nRoss\n\n"
    },
    {
      "time": "23 Apr 2008 — 5:34am",
      "content": "Tell something about your experimental layout ideas.  \nFonts, fonts, fonts?  \nPositioning/reversing/upsidedowning?  \nColouring?  \nSizing?  \nAll of the above?\n\nWith some effort, I could write a short about just any of your subjects. Making it typographically appealing (or appalling) takes some lateral thought. I think I would do the actual writing of text in a layout program (perhaps even Illustrator), so I could mix in the typography \"live\" whenever I want.\n\n"
    },
    {
      "time": "23 Apr 2008 — 7:41am",
      "content": "The thing that springs to mind when looking at your list is to do something on the typography of posters, perhaps use the grid or layout from the poster to form the basis of the text concerning it.  \nGood luck.\n\n"
    },
    {
      "time": "23 Apr 2008 — 8:46am",
      "content": "How about focusing on the advertising efforts of blaxploitation cinema in the USA.\n\n"
    },
    {
      "time": "23 Apr 2008 — 3:44pm",
      "content": "I think I'll be working on conversations, dialogues, accent, tones of voice etc on controversial topics. What do you think  \nGood idea or bad?\n\nRoss: I'mm choosing a topic before I think of type.  \nWill: Good idea. I shall keep that in mind.  \nJames: How do you mean by 'blaxploitation'? Would that some how link in with expressing with type and letterforms?\n\n"
    },
    {
      "time": "28 Apr 2008 — 3:51pm",
      "content": "Can someone please help me? If i was to do an editorial piece using experimental typography, what theme would appeal most for that type of work from the following?\n\n\\* An A-Z of me and my personality, work and attitude. The phrases I use etc  \n\\* Conversations on controversial issues  \n\\* On the word '1st/First' so spreads on the 1st beginnings, 1st day at school, No 1 etc\n\nWhich do you think has more scope? I need to choose 1 out of 3 above. What would you advise? Thanks\n\n"
    },
    {
      "time": "29 Apr 2008 — 2:58am",
      "content": "Probably not the second one, I'd say its of a lesser typographic relevance than the other two.\n\nId' probably choose the A-Z one, you would enjoy it more.\n\nThe 3rd one seems very broad.\n\nI think with type its better to be specific. Go with No. 1..\n\nUp to you tho ha..\n\n"
    },
    {
      "time": "30 Apr 2008 — 6:53am",
      "content": "Yes, I've gone with the number 1, only because it's safe for me at this moment in time having 7 weeks to do this project and possibly posters etc. I'm doing an editorial piece of the work and making it into book but I have no clue how to decide on what size to work on. How do I choose? Please help. I've thought of making the book into a number 1 shape but it won't give me enough space to work with my words and image...or will it? Hmm...any ideas? All feedback welcome.\n\n"
    },
    {
      "time": "30 Apr 2008 — 8:31am",
      "content": "I'd make a square shaped book. And probably at a normal size.\n\nMaking a book shaped like a 1 sounds more like art than design.\n\n"
    },
    {
      "time": "30 Apr 2008 — 8:55am",
      "content": "I was thinking possibly an A1 book that folds back into an A5 possibly. This way, I would have 1 paper, 1 book full of number 1's. What do you think?  \nAluminum: I thought it should be square too but wasn't sure, rather than a rectangular one like a magazine.\n\n"
    },
    {
      "time": "9 May 2008 — 7:04am",
      "content": "Why don't you make your editorial about being confused and going crazy about it? Find that feeling again from the first thing you wrote? That would make and interresting type editorial.. would love to see that. Please post your result whatever you choose\n\nGood luck\n\n"
    },
    {
      "time": "9 May 2008 — 7:30am",
      "content": "I shall. I WAS doing conversations as my main theme but i was told it was too vast. Oh well...I decided on doing it on number 1, First instead. It's proving difficult to come up with clever editorial. I know I am able to perform well doing editorial, but a clever piece...oh no. It's hard.\n\n"
    }
  ]
}
