{
  "id": "44578",
  "title": "University Oldstyle free download",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "In 1938 Frederic W. Goudy designed a text family for the University of California called University Old Style. It was redrawn and digitized in 1994 by Richard Beatty and is now the exclusive typeface for the University of California, Berkeley. Monotype released this font in 1956 under the name Californian and later Tony Stan designed the ITC version, Berkeley Oldstyle. The UC makes it available for free download (subject to their standard EULA) at\n\nLINK REMOVED\n\nOldstyle figures are default-loaded in some fonts, and many variables are available, including weights specific to signage.\n\n ![](http://web.archive.org/web/20131015000628im_/http:/typophile.com/files/UniversityOldstyle_5093.png)\n\n",
  "author": "mondoB",
  "time": "23 Apr 2008 — 8:12am",
  "uid": "14529",
  "comments": [
    {
      "time": "23 Apr 2008 — 9:27am",
      "content": "I have to assume this is a 'free download' only for Berkeley staff.\n\n"
    },
    {
      "time": "23 Apr 2008 — 10:20am",
      "content": "Did you read the EULA?\n\nI removed the link. Sorry to be a party pooper.\n\nThe EULA clearly states:\n\n_You may download the UC Berkeley IP only for official UC Berkeley campus use, or if such use is subject to a fully executed Trademark License Agreement, Sponsorship Agreement, or personal use subject to the terms of this License and where such use would not be commercial or infringe on the rights of others. You may not transmit the UC Berkeley IP to any party without express written permission by the Office of Marketing & Management of Trademarks (herein after “OMMT”)._\n\nEven though it says \"personal use\" I think this is some sort of mistake and am going to check on this. Gray area is where everyone gets into trouble and I think it is best to err on the side of safe.\n\n"
    },
    {
      "time": "23 Apr 2008 — 10:37am",
      "content": "_You may download the UC Berkeley IP only for [...] personal use subject to the terms of this License and where such use would not be commercial or infringe on the rights of others._\n\nI don't see the problem, I read this as allowing for personal use ... ? I mean, you can even find the download links from the Berkeley home page if you know where to look.\n\nJens\n\n"
    },
    {
      "time": "23 Apr 2008 — 11:22am",
      "content": "I'm happy to have them tell me I was wrong. In which case I will restore the link. The problem being that I've had people tell me they didn't mean for the personal use to go beyond certain areas. If they reply to my email telling me that it is for anyone's personal use then I'll restore the link.\n\n"
    },
    {
      "time": "23 Apr 2008 — 11:42am",
      "content": "Not sure why you need to remove the link in this case, Tiffany. It's not like this is an illegal/clandestine/'pirate' web site or anything.\n\nYour call, of course.\n\n"
    },
    {
      "time": "23 Apr 2008 — 12:46pm",
      "content": "Maybe I'm being over protective. :^} But until I hear word saying that link is for the public then I don't think it belongs here. Simple as that.\n\n"
    },
    {
      "time": "23 Apr 2008 — 1:52pm",
      "content": "Tiff, be sure to leave word as to what they say about public use.\n\nMikey :-)\n\n"
    },
    {
      "time": "29 Apr 2008 — 12:41pm",
      "content": "I am surprised that you can't give the link to a clearly public page (the one ending with .edu/downloads.html), which would allow anyone to read the \"terms of use\" BEFORE downloading.\n\nHaving said that, it appears from the terms of use that downloading would be quite useless:\n\n<cite> You agree not to use the UC Berkeley IP in any manner: <cite><br>\n...<br>\n<cite> 2.3 To violate any patent, trademark, trade secret, copyright or other proprietary rights of any party;<cite> </cite></cite></cite></cite>\n\n<cite> 2.4 To intentionally or unintentionally violate any ... University of California or University of California, Berkeley policies;<cite> </cite></cite>\n\n<cite> 2.7 Except as expressly permitted in this License, you agree not to reverse engineer, de-compile, disassemble, alter, duplicate, modify, rent, lease, loan, sublicense, make copies, create derivative works from, distribute or provide others with the UC Berkeley IP in whole or part or transmit the material over a network, without express permission of the OMMT. <cite></cite></cite>\n\n"
    }
  ]
}
