{
  "id": "44585",
  "title": "Armenian on Mac",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello.\n\n\\> Is there a way to view Armenian websites on a Mac?  \nI use firefox as my browser.\n\n\\> I have already bought Hrant's Maral from Linotype, and I have Arasan.  \nAm sure there are other Armenian typefaces that I can buy for a Mac, but I couldn't find any for sale. Can anyone help me out in this?\n\nCheers\n\n",
  "author": "kj",
  "time": "23 Apr 2008 — 10:50am",
  "uid": "23870",
  "comments": [
    {
      "time": "23 Apr 2008 — 11:04am",
      "content": "Two fonts with Armenian support should be already included on your Mac (at least in Mac OS X 10.5), Mshtakan and Arial Unicode. If one of them is installed, Armenian websites should be displayed properly.\n\nJens\n\n"
    },
    {
      "time": "23 Apr 2008 — 11:11am",
      "content": "I have a Mac OSX 10.4 and it didnt come with either :S  \nIs there a way to solve this?\n\n"
    },
    {
      "time": "23 Apr 2008 — 11:39am",
      "content": "Go to this menu in your Font Book:\n\n ![](http://web.archive.org/web/20131019150041im_/http:/typophile.com/files/menu_3555.png)\n\nMikey :-)\n\n"
    },
    {
      "time": "23 Apr 2008 — 12:44pm",
      "content": "Use your OS X installer CDs/DVD to install the additional fonts.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "23 Apr 2008 — 1:06pm",
      "content": "_Use your OS X installer CDs/DVD to install the additional fonts._\n\ngulp... this reminds me, I scratched mine all up... double gulp\n\n"
    },
    {
      "time": "23 Apr 2008 — 10:34pm",
      "content": "umm...mind my ignorance... never thought of doing that...\n\nThanks guys... most of the sites are working now.  \nexcept this one though \\>\\>\\> [http://www.aztagdaily.com/DisplayPage.php](http://web.archive.org/web/20131019150041/http:/www.aztagdaily.com/DisplayPage.php \"http://www.aztagdaily.com/DisplayPage.php\")\n\nUmm... what about Armenian typefaces for sale? Anyone can help in that?\n\n"
    },
    {
      "time": "23 Apr 2008 — 10:40pm",
      "content": "Btw... Mateo I got the first part of the quote \"the future is a thin line...\" but didnt get the rest. Can u translate please?\n\nYo comenzaré a aprender español pronto :) :)\n\n"
    },
    {
      "time": "23 Apr 2008 — 11:00pm",
      "content": "Aztag Daily doesn't work for me either. You may need to play around with the text encoding. Armenian isn't on my list of encodings to switch to so I couldn't test this morning (gotta head off to work in a sec).\n\nThe quote says, \"The future is a line so fine that we barely realize that we ourselves draw it\"\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "23 Apr 2008 — 11:34pm",
      "content": "Have a nice day Mateo.  \nBut may i ask why the interest in Armenian?\n\n"
    },
    {
      "time": "24 Apr 2008 — 3:04am",
      "content": "I plan to make a mono one of these days ( madness I expect ) but in reality you will be waiting for a few years.\n\n"
    },
    {
      "time": "24 Apr 2008 — 4:28am",
      "content": "Yeah, that Newspaper page is ARMSCII-8 encoded, not Unicode. (That's like pages still encoded Latin-1, Latin-2, etc. instead of Unicode: very common).\n\nYou have to change the Encoding in your browser, something like: View \\> Encodings \\> [Other \\> SE and SW Asia] \\> Armenian (ARMSCII-8).\n\nThen it works fine.  \nI'm such in love with the looks of the Armenian script!\n\n"
    },
    {
      "time": "24 Apr 2008 — 4:57am",
      "content": "Hey 'aszszelp' thanks for the help.  \nI'm Happy ur in love with the looks of the Armenian script.  \nBeing an Armenian and knowing that is flattering, tnx.\n\n"
    },
    {
      "time": "24 Apr 2008 — 5:41am",
      "content": "Hm, something like that would flatter me too in a reciprocal situation...\n\nbut then again: the script is not your achievment, but St. Mesrop's, so that feeling is somewhat out of place **;-)**\n\n"
    },
    {
      "time": "24 Apr 2008 — 6:51am",
      "content": "Thank you for the Info :) :P 'aszszelp'  \nWe have been studying about St. Mesrop Mashtots ever since kindergarten.  \nSo maybe I misused the word 'flattered'.\n\n"
    },
    {
      "time": "24 Apr 2008 — 9:12am",
      "content": "No, no, as I already put it: it's a _natural_ feeling even in such cases... it's just not _rational_.\n\nBut the human existence as such is not rational, so...\n\n"
    },
    {
      "time": "24 Apr 2008 — 9:43am",
      "content": "Ahh... Armenia... this brings back memories. Probably the most hospitable place in the world.  \nI wish I took pictures of the church walls, beautifully carved with the Armenian characters.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131019150041/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "24 Apr 2008 — 12:14pm",
      "content": "ARMSCII-8... I don’t seem to have access to this on the mac.\n\n"
    },
    {
      "time": "24 Apr 2008 — 12:41pm",
      "content": "Firefox has it. Firefox is available for Mac. When saying, \"I don't seem to have access to this on the mac.\" do you mean Safari?\n\nIt's not much supported (as I'm just reading on Wikipedia) as it was started being developed in 1991 (till 1999).\n\nUnicode also supported Armenian since the 1.0.0st version (published October 1991), so that's why the 256-char encoding did not catch on much, I guess.\n\n"
    },
    {
      "time": "24 Apr 2008 — 2:11pm",
      "content": "Yes, I meant Safari.\n\nI put ARMSCII-8 into Firefox and I got garbled text.\n\nMikey :-)\n\n"
    },
    {
      "time": "24 Apr 2008 — 3:47pm",
      "content": "No Firefox is working very well with me Mike.  \nGo to View \\>\\> Character Encoding \\>\\> More Encodings \\>\\> SE & SW Asian \\>\\> Armenian (ARMSCII-8)\n\nThats wat i did and it worked properly.\n\nDo u guys read Armenian?\n\nYeah I read the same article A. apparently the Unicode concept hasn't well spread in the Armenian based websites. I know a couple of people in Aztag Daily, maybe i should tell them about this.\n\nGuys no one still told me about Armenian typefaces for sale? no clue?\n\n"
    },
    {
      "time": "24 Apr 2008 — 3:48pm",
      "content": "Oh and Ivan you should definitely go there again to take pictures :)\n\n"
    },
    {
      "time": "24 Apr 2008 — 4:01pm",
      "content": "I did that\n\n ![](http://web.archive.org/web/20131019150041im_/http:/typophile.com/files/2_6169.png)\n\nand i still get question marks\n\nhmm...\n\n"
    },
    {
      "time": "24 Apr 2008 — 4:18pm",
      "content": "Hmmm... Maybe you also need to activate the Armenian in the system preferences.\n\n"
    },
    {
      "time": "24 Apr 2008 — 5:03pm",
      "content": "how do I that?\n\n"
    },
    {
      "time": "24 Apr 2008 — 5:34pm",
      "content": "It works for me with Firefox/MacOS 10.5 without doing anything special, other than choosing the character encoding.\n\n"
    },
    {
      "time": "25 Apr 2008 — 12:19am",
      "content": "KJ: maybe this ressource helps:\n\n[http://cg.scs.carleton.ca/~luc/armenia.html](http://web.archive.org/web/20131019150041/http:/cg.scs.carleton.ca/~luc/armenia.html \"http://cg.scs.carleton.ca/~luc/armenia.html\")\n\n"
    },
    {
      "time": "25 Apr 2008 — 12:37am",
      "content": "I have 10.4, perhaps that’s why its not working.\n\n"
    },
    {
      "time": "25 Apr 2008 — 2:21am",
      "content": "the fact that you see ?s and not garbled text lets me assume that you simply don't have fonts installed that support armenian.\n\nif it was an encoding issue, you'd see garbled \"latin\" text (as you do when you open up the page initially).\n\n"
    },
    {
      "time": "26 Apr 2008 — 4:17am",
      "content": "Look at the [MyFonts results for the search term \"Unicode\".](http://web.archive.org/web/20131019150041/http:/www.myfonts.com/search?search%5Btext%5D=unicode) You can find Armenian in many of the fonts that try to cover as much of the entire world as possible. If one of the little blue icons beside each font shows a capital To, it has Armenian in it. Check the codepages to see what it looks like -- sometimes the style is completely different from the other alphabets in the font!\n\n"
    },
    {
      "time": "26 Apr 2008 — 7:21pm",
      "content": "I downloaded the font \"Arial AM\" on a PC and then installed it on my mac. Here is what I can see with Safari on OS X 10.4.11. Since I don't read Armenian, I can't be sure this is right. In any case, my guess is that you should find answer to your question [here](http://web.archive.org/web/20131019150041/http:/www.tarumian.am/).\n\nMichel\n\n ![](http://web.archive.org/web/20131019150041im_/http:/typophile.com/files/aztag_6003.jpg)\n\n"
    },
    {
      "time": "26 Apr 2008 — 10:19pm",
      "content": "Hey Michel, thanks a lot.  \nThis is Armenian allright.\n\nK J\n\n"
    },
    {
      "time": "27 Apr 2008 — 2:01pm",
      "content": "(Even though I'm not Armenian) I'm working on new OpenType fonts with Armenian and Latin characters, using the latest Unicode version.  \nI've recently finished 'Lagoon' - which is based on the type found in an antique book printed in Venice.  \nIt has very many ligatures - a lot of work! At the moment I'm giving away a few CDs of fonts (fully compatible with Mac/PC).  \nKJ - email your postal address and I will send you a CD with this and other Armenian/Latin fonts. All I ask is that you let me know what you think of my work. Thank you.\n\nCarolyn P\n\n"
    },
    {
      "time": "28 Apr 2008 — 12:52am",
      "content": "Hey Carolyn, I will be happy to receive and check your work.  \nHere's my postal address:  \n\\>  \n\\>  \n\\>  \n Khajag Meguerditch Apelian  \n P.O.Box 150 850  \n Sharjah UAE.  \n\\>  \n\\>  \n\\>\n\nK J\n\n"
    },
    {
      "time": "10 Oct 2008 — 10:02am",
      "content": "Khajag, as you've probably noticed, Arasan is not Unicode. As you've found out however Mshtagan (which is Unicode) does come with OSX. It's decent. But don't use Arial-Unicode's Armenian - it's quite horrid, and full of structural mistakes.\n\n\\> what about Armenian typefaces for sale?\n\nIronically enough it's hard to find an Armenian font for sale; people who design Armenian fonts don't expect to get any money for them! So they just give them away. This is of course why most Armenian fonts are so crappy.\n\nBesides the great classicist work done by Carolyn, I have a font called Nour (in four weights) which has won two competitions (one by the UK magazine Creative Review, the other by the government of Armenia). It attempts to be highly authentic but equally readable, and has a somewhat elaborate relationship with a Latin counterpart (called Patria). It's all Unicode (although I have it in other encodings too). Please feel free to contact me: hpapazian at gmail dot com.\n\n\\> ARMSCII-8 [is] like pages still encoded Latin-1, Latin-2\n\nIt's certainly worse than that. ArmSCII-8 is one of two quasi-standard 8-bit encodings; the other is mine (the one in Arasan).\n\n\\> the script is not your achievment\n\nWell, we all participate. In fact some scholars think what Saint Mesrop invented looked quite different originally, and it's when the scribes started using the new script at speed that it started looking a bit Greek.\n\nhhp\n\n"
    },
    {
      "time": "10 Oct 2008 — 12:33pm",
      "content": "\\> _Mshtagan (which is Unicode) does come with OSX. It’s decent._\n\nDecent?! That's a gross overstatement, to say the least. Mshtakan is neither decent, appealing or even well executed. Having it as a system font is a disservice to the improvement of contemporary Armenian typography. There are free Armenian fonts out there that are \\*way\\* better than Mshtakan. I have nothing against Michael Everson, but the design of Mshtakan is simply too poor to fit the bill of a system font. I mean, have you tried to read a webpage with that thing?\n\nSeriously, can this be called \"decent\"?\n\n ![](http://web.archive.org/web/20131019150041im_/http:/typophile.com/files/Mshtakan_4740.png)\n\nEven people that never saw a ja (ձ) and have no clue of what it's supposed to look like will say it was drawn by a child..\n\n"
    },
    {
      "time": "10 Oct 2008 — 12:55pm",
      "content": "I hereby stand accused of being too nice.  \nLet the court records show this. :-)\n\nI once consulted casually on the font (in fact I came up with the name - it means \"eternal\" - Everson, get it?) but if I ever saw that \"ja\" I'm sure I told Michael that it's a disaster!! Puke freely, man. In fact the version I saw might have had a decent one. I'll have to check my old (pre-Gmail) emails.\n\nSo: I retract my positive comment - thank you Miguel. Also: Sylfaen (which comes with Windows) has a pretty good Armenian component (but the Georgian is a caricature). Another bit of evidence (as if we needed more) that Microsoft cares more about type than Apple. Apple certainly cares about buffing titanium though.\n\nhhp\n\n"
    },
    {
      "time": "11 Oct 2008 — 10:51am",
      "content": "So I went back and checked my emails from that time (from 12/2002 to 2/2003) and it looks like I warned him on at least four occasions that the \"ja\" was no good. Here's an example of what I wrote:\n\n\"  \nThe ja totally doesn't work... :-( That squiggle  \nlooks like a diacritic. And none of the three in your  \nsequence are usable. Try making the ascender part of  \nthe righthand stroke of the base.  \n\"\n\nThe thing is, later on he showed me some alternates, one of which was decent, and I told him so. So I sort of assumed he used that one (or a better one) in the end. I guess not.\n\nAlso, I had helped him out more than I remembered, and seem to have asked him for some crediting, but never got confirmation of that. Is there any crediting in Mshtakan (not Mshtagan BTW) that anybody can see? I don't have a Mac handy.\n\nhhp\n\n"
    },
    {
      "time": "11 Oct 2008 — 3:24pm",
      "content": "Hrant, there either is no crediting to you, or I am too stupid to find it.\n\n ![](http://web.archive.org/web/20131019150041im_/http:/typophile.com/files/mshtakan_5213.png)\n\n"
    },
    {
      "time": "11 Oct 2008 — 4:03pm",
      "content": "Thanks for checking.\n\nhhp\n\n"
    },
    {
      "time": "11 Oct 2008 — 8:23pm",
      "content": "I was looking through my fonts I have for armenian and might have found part of the problem. While all the rest of the (granted, rather limited) Armenian fonts I have tend to have quite varied metrics, Mshtakan shares more than a few similarities with another font that I presume is well distributed (if not, as already noted by hrant, well designed). Mshtakan is black, Arial Unicode is blue.\n\n ![](http://web.archive.org/web/20131019150041im_/http:/typophile.com/files/armenian_comparison_5905.png)\n\nThe metrics are nearly identical, although Mshtakan (which as far as I know was designed to be more of a screen font) is bolder. But the x-heights, ascender and descender height are nearly identical. Some of the more unique letters seem to be almost traced out of Arial Unicode. Specifically, է, ժ, ծ, ձ, ճ, մ, ւ, and ֆ. I'm not saying he copied it of course, but he has a very clear influence (although, to his credit, he did go for what, if I've learned well from hrant and I'm sure he'll correct me if I be wrong, is a far better and more authentic հ and ն, and actually got the ք correct).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n[side note: hrant, within about a week or two once I'll have an interesting setup for the italic of Coruña with regards to Armenian]\n\n"
    },
    {
      "time": "12 Oct 2008 — 9:02am",
      "content": "Nice investigation.\n\nI'm not sure what Michael would have gained by copying the metrics from Arial. Arial's Armenian is neither passable nor in much use AFAIK. Tracing\\* on the other hand is advantageous - but of course not OK, at least not without permission and crediting.\n\n\\* By which I have to ask what exactly you mean.\n\n\\> the x-heights, ascender and descender height are nearly identical.\n\nHow nearly? Because in the past I've been surprised at how close I've come on occasion myself. After I made Patria I was curious to compare it against two highly reputable fonts: Times and Georgia. To my shock all three were quite close in vertical proportions! Plus as with the metrics, I can't think of a good reason to copy it. That is, unless Arial was in fact a direct source for the outlines (at least some of them) in which case it would be natural to keep the vertical proportions (and maybe change them a hair to divert suspicion).\n\nConcerning the \"ho\", IIRC\\* he asked me about which form to use and I strongly recommended what I consider to be the authentic form (especially since his design is classicist) and he used that. The \"now\" is the good form too (although the rendering is cruddy). Here BTW is a collage of the evolution of the \"h\", from the original capital, to the superb classical lc form, to the sad, Latinized junk from the 70s:\n\n\\_\n\n ![](http://web.archive.org/web/20131019150041im_/http:/typophile.com/files/ho_evolv_3601.gif)\n  \n\\_\n\n\\* I really don't want to go back and read those disheartening emails again...\n\nLastly, the Arial \"keh\" is Latinized and not to my liking, but it is in fact a valid historic form, so not totally off the wall. The Arial \"sha\" however, even though it does have some precedent from the 20th century, is almost as bad as the \"ja\" (that in fact Michael seems to have sadly used as a model).\n\nhhp\n\n"
    },
    {
      "time": "12 Oct 2008 — 4:53pm",
      "content": "When I said traced I didn't mean it quite so literally. But, ժ, ծ, and է seem to curve virtually identically (cf to the letter f or ð, which start their curves at different points in different fonts, and varies its degree of overhang and level and angle of cross bars). I'm not suggesting he intentionally copied Arial, but just might have thought of Arial too closely as a model. I can't remember who said it on here, but I remember someone mentioning that the biggest problem Latin-native designers have with something like Cyrillic is that we tend to be at times too conservative as a sort of crutch. Maybe that was part of the case.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "12 Oct 2008 — 5:33pm",
      "content": "Well, conservatism is highly recommended for non-natives! It's pretty much impossible to truly innovate in a script without a feeling for the intangibles, something that can only be acquired informally over many years, preferably before a certain age (like 10). The thing is, even conservatism requires finding good models to emulate, and this is best done by asking natives. And then listening to them.\n\nhhp\n\n"
    },
    {
      "time": "15 Dec 2008 — 3:12am",
      "content": "My stars, Hrant. The mails you wrote me in 2002 were a lot more encouraging: <cite>So I took a look at your revised font: Wow, what a difference! I think the slant is a good amount. For the spacing you might consider making it even slightly looser. Don't worry about the liwn, it's pretty normal that way. Some people would call this very old-fashioned, but in the conext of all the contemporary crap that passes for Armenian fonts these days, I think this is a worthwhile effort. The main thing now would be to polish the forms. As for the name, maybe call it \"Mshtakan\", which means perpetual: it plays well with your last name, as well as the design's \"old\" nature.</cite>\n\nI never looked at Arial Unicode. My source for shapes was font showings in Darbinyan 1965 and Gorcakalyan 1973. I sent you a copy of Darbinyan.\n\nI remember (six years on) some of the discussion we had about ho and ja and so on. I checked to see what ja variants I had, and it seems that you didn't like any of them. I'd be happy to improve the ja. I have a chance to do a update on the font just now. Perhaps there is no redeeming it in your eyes, Hrant, but if ja and anything else wrong with it can be corrected, I'll be happy to do so with your advice, which I respect.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "31 Aug 2010 — 7:16am",
      "content": "Michael, I've been meaning to reply all this time (I wasn't  \nbeing courteously quiet or dismissive anything) and I'd like  \nto get this off my shoulders before ATypI-Dublin...\n\n(BTW, did you edit your post at some time? Because I have this  \nmemory of it being more... defensive. Or maybe I'm getting old.)\n\nThe operative thing here is \\*2002\\*. Back then things were much  \nbleaker in the Armenian type design scene, and your design was  \nrefreshing in its conservative stylistic authenticity. Since then  \nit's improved quite a bit, so things are more competitive. But really  \nI think Mshtakan is still pretty usable... EXCEPT for the \"ja\". :-/\n\nAlso, once again about the crediting: it would be nice to see my  \nname mentioned somewhere (in passing, nothing major) as an  \nadvisor or consultant or some such thing.\n\nhhp\n\n"
    },
    {
      "time": "13 Sep 2010 — 8:13am",
      "content": "I read this only now, after we met at ATypI... so for the purposes of the list… There is in fact scope for a revision of the font and I should be delighted to fix the loathesome ja (and the black star which oodles of people bemoaned), and to include crediting, because you did offer plenty of good advice in 2002.\n\n(My own records don't show any discussion about crediting for what that is worth. Maybe not much. Anyway now is now.)\n\n"
    },
    {
      "time": "13 Sep 2010 — 8:02pm",
      "content": "Sounds good.  \nAnd it was a distinct pleasure meeting you in person!\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2012 — 9:25am",
      "content": "Hello everyone... joining quite late this discussion, however I know I am not the only one who is trying to replace the disastrous Mshtakan on Lion. I still cannot find a way to do it. Can someone recommend if that can be done at all and if yes, then how?\n\nMany thanks,\n\nRuben\n\nps. BTW, you are welcome to take a look at my calligraphy works, if interested ... [http://15levels.com/art/armeniancalligraphy](http://web.archive.org/web/20131019150041/http:/15levels.com/art/armeniancalligraphy \"http://15levels.com/art/armeniancalligraphy\")\n\n"
    },
    {
      "time": "7 Feb 2012 — 6:14am",
      "content": "@Ruben Could you explain in more detail what your problem is? Can't you just remove it and replace it with the font of your choice?\n\n"
    },
    {
      "time": "18 Feb 2012 — 9:53am",
      "content": "Tom, I cannot find a way to define a default Armenian font in Mac OSX Lion. Will it work if I rename another Armenian font \"Mshtakan\" and delete the original one?\n\n"
    }
  ]
}
