{
  "id": "44599",
  "title": "Italic vs. italic",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone  \nI've read a certain number of times (<cite>chez</cite> Morison, Bringhurst, etc.) that there were two main styles of Renaissance italics, the Aldine style and the later “fully formed” kind demonstrated by Arrighi, Tagliente and Palatino. Bringhurst in particular complains of the lack of good digital versions of the Aldine model, since many twentieth-century revivals (even those using Alde/Griffo roman models, like Monotype Bembo or Monotype Poliphilus) were released with italic versions based on the later style.  \nI have two questions here :  \n1. How does one differentiate the Aldine kind of italic type from the Arrighi <cite>et al.</cite> style ?  \n2. Has the situation changed since 1992 (when Bringhurst made the above complaint) and are there now good digital versions of the Aldine italic out there ?  \nThank you very much.\n\n",
  "author": "Celeste",
  "time": "23 Apr 2008 — 2:56pm",
  "uid": "11083",
  "comments": [
    {
      "time": "23 Apr 2008 — 3:01pm",
      "content": "[Adobe Jenson's italic](http://web.archive.org/web/20130315120637/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1715) is said to be based on Arrighi. It's one of the best as far as being both beautiful and readable, I think.\n\n"
    },
    {
      "time": "24 Apr 2008 — 3:20pm",
      "content": "I agree with you on Adobe Jenson’s beautiful italic, William — but I also hoped someone would be able to answer my two questions.\n\n"
    },
    {
      "time": "24 Apr 2008 — 7:29pm",
      "content": "Scans from Nesbitt's History and Technique of Lettering:\n\n[Arrighi's italic, visibly superior to that cut by Griffo for Aldus Manuzio](http://web.archive.org/web/20130315120637/http:/en.wikipedia.org/wiki/Image:Arrighi_italic.png). Arrighi perfected his design by penmanship and had the medalist Lauticio di Bartolomeo dei Rotelli cut the punches.\n\n ![](http://web.archive.org/web/20130315120637im_/http:/typophile.com/files/griffo_italic_4112.png)\n  \nItalic cut by Francesco Griffo de Bologna\n\nAlso try: [http://en.wikipedia.org/wiki/History\\_of\\_western\\_typography](http://web.archive.org/web/20130315120637/http:/en.wikipedia.org/wiki/History_of_western_typography \"http://en.wikipedia.org/wiki/History\\_of\\_western\\_typography\")\n\nBye, Jimi still holidaying on the Ivory Coast.\n\nj a m e s\n\n"
    },
    {
      "time": "24 Apr 2008 — 8:27pm",
      "content": "\\>I also hoped someone would be able to answer my two questions.\n\nSo do I.\n\nI have not studied the renaissance writing masters, nor the successive italics. I have read, but not carefully, what Harry Carter says about them in \"A View of Early Typography.\" I haven't seen anywhere the kind of detailed analysis of italics such as Tracy does for Romans in \"Letters of Credit\".\n\nIt would be great if someone could give a brief explanation of the differences, with some insight on the differences in concept.\n\nJames's examples are useful, but I would like a lot more analysis of what the two were doing.\n\nOne important point is mentioned by Harry Carter: the model most widely used, that coming from Garamond and Granjon, shows influence of both the Aldine italics and the italics of Arrighi.\n\n"
    },
    {
      "time": "24 Apr 2008 — 10:06pm",
      "content": "_Arrighi’s italic, visibly superior to that cut by Griffo_\n\nThat's assuming they had the same goal, and Arrighi just did a better job.  \nBut is that really what's going on?  \nFrom these two samples, it appears that Griffo is trying to capture the quality of writing, with plenty of ligatures and lots of bounce, whereas Arrighi is after a slick upscale formality, with a high-tech look of mechanical regularity.\n\n"
    },
    {
      "time": "25 Apr 2008 — 3:56am",
      "content": "That was my assumption--that the two men had much the same goal. Like all assumptions, that's not cut and dried. We don't _know_ that they had the same goal. By 'visibly superior\" I'm hedging at the preconception we in our time take for granted; that a text typeface design is meant to be slick and tightly integrated. That's just my view.\n\nAltho Alexander Nesbitt notes that Stanley Morison thought Arrighi's italic was \"...a much better design...\" he goes on to say, \"The later design (Arrighi's) avoided almost all ligatures; used a slightly taller capital; and was really worked worked out in the type medium---it was not a copy of the pen letter. This is an elegant letter, with long ascenders and descenders; in this elegance it has the effect of the written style.\"\n\nSo Nick's view, \"...it appears that Griffo is trying to capture the quality of writing, with plenty of ligatures and lots of bounce...\" seems a fair assumption.\n\nFor Wikipedia I had to write about the Griffo italic from a neutral viewpoint: _The \"Aldino\" italic type, commissioned by Manutius and cut by Franceso Griffo in 1499, was a closely-spaced condensed type. Griffo's punches are a delicate translation of the Italian cursive hand, featuring letters of irregular slant angle and uneven height and vertical position, with some connected pairs (ligatures), and unslanted small roman capitals the height of the lower case t. The fame of Aldus Manutius and his editions made the Griffo italic widely copied and influential, although it was not the finest of the pioneer italics._\n\n\"...not the finest of the pioneer italics.\" only just meets Wikipedia's requirement for neutral point of view. By \"finest\" I meant the Griffo was not as refined as the Arrighi.\n\nj a m e s\n\n"
    },
    {
      "time": "25 Apr 2008 — 9:53am",
      "content": "They also were designing to fit in small books used to travel. During that day entire books were done using the italic. (IIRC)\n\n"
    },
    {
      "time": "25 Apr 2008 — 10:08am",
      "content": "Thanks Nick, nice insight on the difference in goals between the two designers. An interesting thing to me would be what Garamond and Granjon took from Griffo and from Arrighi.\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:08pm",
      "content": "Nick\n\nIf I am not mistaken... was not La Operina intended to be a copy book?\n\nTo quote Ludovico, “I have endeavored to study these recently discovered letters and convey them to print... they approach handwriting as much as it was in my ability to compose.... excuse me inasmuch as the printed word cannot in everything reproduce the living handwriting... hope that you yourself will be able to attain your goal by the copying of my hand.”\n\nI am not sure that he was after slick but rather a conveyance of the spirit of the Cancellaresca Corsiva.\n\nMichael\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:45pm",
      "content": "The type however varied greatly. Notice the transition from the branching to the stem on the right sides of the m, n, h. They are almost Textus precissus in nature (they have a terminal angle alien to “Italic (45 degree pen angle).” Plus... notice the compression of forms in the book... If that is the slick some are referring to then I understand, but the “Genesis,” La Operina, was in no way slick but rather homey. Sorry homey! :)\n\nBefore I hang myself, you must disassociate the book from the type!\n\nDoes this make sense?\n\nMichael\n\n"
    },
    {
      "time": "29 Apr 2008 — 12:53am",
      "content": "The problem with Nesbitt's book is that his images are his drawings. Inevitably he put's his own spin on the images. Seeing the real thing & then Nesbitt's image makes you laugh. It's not that he did a poor job. It's that it just isn't good enough. The truth is I am not so hot on his text either.\n\nAnd of course there is Cresci ( Thanks James Mosley! )\n\n[http://photos1.blogger.com/blogger/888/2073/1600/Essemplare%201560%203%2...](http://web.archive.org/web/20130315120637/http:/photos1.blogger.com/blogger/888/2073/1600/Essemplare%201560%203%20a.0.jpg \"http://photos1.blogger.com/blogger/888/2073/1600/Essemplare%201560%203%20a.0.jpg\")\n\nSome of it isn't usable to my way of looking at it. But some of it is wonderful.\n\n"
    },
    {
      "time": "29 Apr 2008 — 9:01am",
      "content": "<cite>Bringhurst in particular complains</cite>\n\nBut this is essentially what Bringhurst does regarding most modern typography. It is a mystery why anyone pays much attention to his ramblings.\n\n"
    },
    {
      "time": "30 Apr 2008 — 2:01am",
      "content": "@Eben: \"The problem with Nesbitt’s book is that his images are his drawings. Inevitably he put’s his own spin on the images. Seeing the real thing & then Nesbitt’s image makes you laugh. It’s not that he did a poor job. It’s that it just isn’t good enough. The truth is I am not so hot on his text either.\"\n\nSome of the images in the _History and Technique_ are Nesbitt's own drawings, and some are not. The images of the Griffo and Arrighi italic types are authentic. Sure he puts his own spin on them, but so does everybody else who writes about aesthetics. His writing is pedantic and condescending, but then so is Bringhurst's. Seeing the real thing & then Nesbitt’s image makes Eben laugh. The point is, his images are accurate enuff to tell basic truths. The spirit, not the letter, my friend, is what counts.\n\n@terminaldesign  \nYepp. I don't understand why so many typophiles regard his book as \"the bible\". As long as they insist on calling _Elements_ that, uninformed followers of fashion will tend to swallow suit.\n\nNick Shinn---I would like nothing more than to see you write a successor to both Elements and Nesbitt's book. You're preeminent, qualified, a good wordsmith. Put me down for a copy of the first edition.\n\nj a m e s\n\n"
    },
    {
      "time": "30 Apr 2008 — 10:46am",
      "content": "Thanks for the props James. I have been working on a type book intermittently (a history, not a style guide), but making OpenType fonts keeps getting in the way.  \nI did put a brief style guide together in 2001, piggy-backing work that Rod MacDonald had done for the Type Club of Toronto.  \n [http://www.shinntype.com/Writing/DigginIt.pdf](http://web.archive.org/web/20130315120637/http:/www.shinntype.com/Writing/DigginIt.pdf \"http://www.shinntype.com/Writing/DigginIt.pdf\")  \nI added a section on \"Expert Fonts\" (this was shortly before OpenType) that is now completely obsolete.  \nFor the cause of fine typography, and in lieu of another style guide to rival Bringhurst, it would be nice to see a general compendium of OpenType fonts and features. Perhaps someone is working on that right now, but it would be a stretch for a writer/designer or publisher to produce.  \nHow about Scott Citron's _Effective Typography with Adobe Creative Suite 3?_\n\nBased on his Typophile posts, Charles Ellertson would make a promising style guide author :-)\n\n"
    },
    {
      "time": "30 Apr 2008 — 10:53am",
      "content": "@Nick: The impression I get is that anyone really qualified to put that book together is probably spending most of his time trying to build Opentype fonts.\n\n"
    },
    {
      "time": "30 Apr 2008 — 11:44am",
      "content": "Nick: \"I have been working on a type book intermittently (a history, not a style guide), but making OpenType fonts keeps getting in the way.\"\n\nThe first bit is really good news. The second bit---\"Misery's the river of the world, Misery's the river of the world, Everybody row, Ev-ry-bod-y row!\" -- words by Tom Waits.\n\nThanks for all the other snippets and news. It's all news to me. That's because I'm primarily a stylist, busy hatching new ideas and not paying a lot of attention to old ones.\n\nJamesP---probably the companion/successor to Elements will be wiki-authored. The problem with most wikis is they're too open. That History of Western Type I wrote for Wikipedia is compromised by WP's insistence on paraphrasing published sources only. I had little choice but to parrot existing \"reliables\".\n\nIf we set up a wiki dedicated to producing a new typography style guide with two basic editorial stipulations: 1) Only practicing typographers, type designers and students of type can contribute, 2) Original research (read: writing) is encouraged, if not the main goal. By degrees, in between making opentype fonts, with many of us working on it, maybe it can be done that way. Wikimedia software is free. Just add hosting resources, stir gently.\n\nj a m e s\n\n"
    },
    {
      "time": "30 Apr 2008 — 12:15pm",
      "content": "Bringhurst's Elements is a wonderful book, but it reflects his classical tastes in type, and it leaves out a lot of issues in graphic design, and type for other purposes than books.\n\nI treasure it for what it is, and don't lament it what it's not. I don't think it's a sin and a crime for anyone to say something I don't agree with!\n\nMitchell & Wightman's \"Book Typography\" is in some ways more complete and useful on its subject than Bringhurst.\n\nI too am looking forward to Nick's history of type & graphic design!\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:08pm",
      "content": "James don't get me wrong, I think Nesbitt probably had very good reasons for doing what he did. Dover editions are often the same way - a piece of line art is made because the photo they have isn't clean or clear enough ( or for whatever reason ). But the fact remains that in type design especially the little unintended liberties do matter. And it's not the middle of the 20th c. anymore. In fact looking again I would have to say that even the stuff that is supposedly straight from the source is too monkeyed with. I am not saying \"don't anyone buy the book\". I am saying as a visual reference it is a deeply flawed.\n\nThis BTW has nothing to do with his aesthetic ideas. I am also not suggesting that the images were altered to fit his ideas - even if it is possible. I haven't dug into it deeply enough to have an opinion about that.\n\nIn terms of the text : Pedantic and condescending I can deal with. And actually he refrains from the all to common \"casual honest\" but overly opinionated and intellectually squishy prose style common books from the period to a degree which is very gratifying. I would say the text is a decent overview but maybe it wouldn't be my 1st choice.\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:12pm",
      "content": "Also, maybe somebody should take a stab at the question Celeste asked above\n\n<cite><br>\n2. Has the situation changed since 1992 (when Bringhurst made the above complaint) and are there now good digital versions of the Aldine italic out there ?<br>\n</cite>\n\n"
    },
    {
      "time": "30 Apr 2008 — 11:51pm",
      "content": "William: \"I don’t think it’s a sin and a crime for anyone to say something I don’t agree with!\"\n\nNeither do I, and I don't think anybody else here is suggesting the same.\n\nEben: \"I am saying as a visual reference it is a deeply flawed.\"\n\nI don't agreee it's that bad. You could be accused of hyperbole. But if you think it's so flawed you could put some of your scanned samples of printed books to good use by publishing them, not with Flickr, but in print.\n\n\"Also, maybe somebody should take a stab at the question Celeste asked above\"\n\nApparently nobody here knows the answer.\n\nj a m e s\n\n"
    },
    {
      "time": "1 May 2008 — 2:09am",
      "content": "\"I don’t think it’s a sin and a crime for anyone to say something I don’t agree with!\"\n\nWhere did you get that from? Reading between the lines? I only said \"pedantic and condescending\". Terminaldesign said, \"...a mystery why anyone pays much attention to his ramblings.\" No mention of sin or crime.\n\nEdit: Someone posted a recent thread in General Discussions titled \"I hate Microsoft Word\". I stenuously avoid the word \"hate\" because it's poisonous.\n\nj a m e s\n\n"
    },
    {
      "time": "1 May 2008 — 2:05am",
      "content": "I am not sure why print is so much better than flickr when it comes to showing these kinds of images. The one is searchable and the other is not. Also publishing of the kind you mean would take a publisher willing to pay the Libraries their fees. And a publisher. Did you have one in mind? Still, maybe it will happen one day. I wouldn' mind at all. Especially if I could take \\*really\\* good images.\n\nThe thing about this \"hyperbole\" of mine is that if you are trying to study this kind of thing as a type designer your needs are different than a person who want a survey of the big ideas - a sort of 100 level class kind of thing. To say that it's no good for the survey might possibly be hyperbole. To say that it falls far short for a type designer is simply accurate. Feel free to claim otherwise but that's definitely what I think.\n\nIn the mean time have some Hypnerotomachia!\n\n[http://www.flickr.com/photos/ebensorkin/sets/72157604825884265/](http://web.archive.org/web/20130315120637/http:/www.flickr.com/photos/ebensorkin/sets/72157604825884265/ \"http://www.flickr.com/photos/ebensorkin/sets/72157604825884265/\")\n\n<cite>Apparently nobody here knows the answer.</cite>\n\nQuite! Or hasn't taken the time to work it out yet. I wonder if Stephen or Yves would be good at answering this.\n\n"
    },
    {
      "time": "1 May 2008 — 2:27am",
      "content": "\"I am not sure why print is so much better than flickr when it comes to showing these kinds of images. The one is searchable and the other is not.\"\n\nWhat about the much higher resolution of print compared to the computer screen? Does that count? We're talking about type samples. You yourself insist that detail is paramount.\n\nAlso context. Flickr is a free image hosting service that offers very limited ways of adding context---users can label their images and add notes and comments, which spectators read on low resolution computer screens. That seems like a poor context for type samples. Companion text printed in a book would be much more comfortable to read, and a more relevant context for the subject of type.\n\nAbout hyperbole---oh forget it. You obviously don't understand what I mean.\n\nEdit: \"Feel free to claim otherwise but that’s definitely what I think.\"\n\nThis is a discussion thread and I am not prepared to sit here bickering.\n\nj a m e s\n\n"
    },
    {
      "time": "1 May 2008 — 3:47am",
      "content": "For those folk who are unimpressed with Bringhurst's _Elements of Typographic Style_, please suggest an alternative of comparable breadth and depth. If there isn't one (I can't think of one myself), consider writing it.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "1 May 2008 — 4:22am",
      "content": "<cite> The much higher resolution of print compared to the computer screen? </cite>  \nMy images are not so good that they could be used at a large size in print or on a screen. Talking about computer screens vs print isn't maybe relevant. The question is how big & good is the file? As to what is most comfortable, again it depends on the person I think - I can't quite agree that print is the more relevant context in some blanket sense. There is a great deal of reading being done on screens. But if you are print-centric I won't deny you your choice/preference!\n\n,cite\\> You yourself insist that detail is paramount.   \nAlso it isn't that I think an infinite quality of detail is paramount - a great deal of detail is wonderful of course - it's that in the case of the nesbitt examples there is an inevitable if subtle amount of interpretation (or put harshly corruption or spin) going on. I would rather have a lower rez image but what without spin given the choice. Put another way if you are trying to figure out what the original might have been like Nesbitt's overlay of interpretation must naturally be in the way.\n\nBut even a perfect photo however fantastic it might be, and in print or on screen - is not an identical experience to clapping your eyes on the original. Or seeing the type at the actual size it is intended to be seen at. That is by far & away the more profound and surprising distinction in my experience. Perhaps through the factor of scale that I can best see and sympathize with your argument for print over screen.\n\n<cite> bickering </cite>  \nI didn't think we were. I thought it was just a debate/conversation.\n\n<cite> oh forget it. You obviously don’t understand what I mean. </cite>  \nOkay. Or you could find a different way of stating your case. Maybe I would understand your idea better then.\n\n<cite> For those folk who are unimpressed </cite>  \nThomas, I asked James what he meant by that BTW and he said that he thought people relied on Bringhurst far too automatically and unquestioningly. So in some ways I think his critique is more with that kind of behavior and thought process than with the man or his ideas per se. This isn't at all obvious from the post itself. James if I am putting words in your mouth or speaking out of turn feel free to correct me.\n\n"
    },
    {
      "time": "1 May 2008 — 5:15am",
      "content": "<cite>What about the much higher resolution of print compared to the computer screen? Does that count? We’re talking about type samples. You yourself insist that detail is paramount.</cite>\n\nJames, one thing about Flickr you probably don’t know:  \nIf you’d get yourself an account (free one will do), you’ll get access to ‘all sizes’ of a photograph. In this case, you can see the [original full-resolution file](http://web.archive.org/web/20130315120637/http:/www.flickr.com/photos/ebensorkin/2455717847/sizes/o/in/set-72157604825884265/), and not only the downsized 500×375px preview.  \nOf course, the available size for various pictures varies, depending on what the author has decided to publish and share. But basically, one can post the very same files to Flickr that one would use for a book layout and send to a printer.\n\n<cite>Also context. Flickr is a free image hosting service that offers very limited ways of adding context—-users can label their images and add notes and comments</cite>\n\nYes, it is different from a book. Of course. I think they both have their pros and cons. One thing I like about the web (not limited to Flickr, that is) is the fact that spectators (readers) can also contribute context, via noted, comments and hyper-references – in a quick and convenient way, at that. The length of both descriptions and comments on Flickr seems to be unlimited. I just checked: Adding a 10,000 words essay with paragraphs, blockquoted, emphasized passages &c to your picture is no problem.\n\n"
    },
    {
      "time": "1 May 2008 — 5:43am",
      "content": "James A, I was responding to James M's dismissal of Bringhurst, but also to the general tendency on the internet to exaggerate on the negative side. Not this thread, so maybe it is off point--and evidently I'm guilty of what I'm complaining about!\n\n"
    },
    {
      "time": "1 May 2008 — 8:00am",
      "content": "Eben correctly communicated our discussion. There is too much genuflecting to Mr Bringhurst's book. It makes me uncomfortable. Referring to it as \"the Bible\" and that sort of thing. I think the book fairly narrow in its focus and the last time I looked it had very little to say about real commercial typography. To me, it lives in the world of type and book as precious object, and that world makes me ill. I come from a very different background. Just my opinion.\n\nJamesM\n\n"
    },
    {
      "time": "1 May 2008 — 11:07am",
      "content": "\\>real commercial typography\n\nJames, you are entitled to your opinion, but I think your analysis is off the mark.\n\nAccording to [this information from publishers weekly](http://web.archive.org/web/20130315120637/http:/www.parapublishing.com/sites/para/resources/statistics.cfm) most revenue estimates for the book industry in the US put the total revenue at 23 to 28 billion dollars, and probably 14 billion more that hasn't been counted from smaller publishers.\n\nAccording to [this source](http://web.archive.org/web/20130315120637/http:/members.whattheythink.com/news/newslink.cfm?id=29245) magazine revenue from advertising was 18 billion.\n\nSo book publishing is at least a serious commercial venture as magazine publishing.\n\nAs to \"the world of type and book as precious object,\" that applies to a miniscule proportion of book publishing. As as far as I'm concerned 'the book as art' is a legitimate pursuit, though not a very commercial one.\n\nAs to Bringhurst's book being a \"Bible,\" it was Hermann Zapf who said that he would like to see it become the \"Typographer's Bible\".\n\nAnd if you look at the eight page summary of guidelines at the end, I think at least 90% of them are good for the setting of any text.\n\nBringhurst combines eloquence and passion for his subject and by and large good judgment. When the introducer of Bringhurst at TypeCon last summer asked how many of the audience had \"Elements,\" so far as I could see every single hand in the room when up.\n\nIt is very true that type for advertising, signage, product packaging, and so on is a different animal than what Bringhurst addresses, and outside his concerns. That is a serious shortcoming, but the book is still outstanding--in my view.\n\n"
    },
    {
      "time": "1 May 2008 — 12:06pm",
      "content": "Bill, I think James' criticism really has to do with a \"received wisdom vs the evidence of your own eyes/experience\" argument. I am deeply sympathetic to that argument. Leaning into any authority as a justification isn't strong reasoning as such : eg <cite> it was Hermann Zapf who said that he would like to see it become the “Typographer’s Bible”</cite> it's just a way of bludgeoning the debater opposite with the possible fear that they might be in contradiction with a well respected point of view eg the received wisdom. eg \"Who are you to contradict Zapf?\" It may have rhetorical power for some but it isn't an argument as such.\n\nIt is certainly true that received wisdom is something we can't quite do without! So please don't take me as against it in some kind of over-arching or blanket sense. However, it is an important distinction. And it is useful to note that the closer you get to mastery in a given area the less useful received wisdom often becomes. I think that this is what would account for all those hands.\n\nNick Shinn in his argument with me about Science & type made the point that as soon as you do typographic research the results are easy to enshrine and can severely limit the thinking of clients who are far far too eager for some received wisdom to lean on. I didn't agree with his idea that this means research was a problem in and of itself. But I did agree that this tendency to lazily lean is not at all healthy.\n\n"
    },
    {
      "time": "1 May 2008 — 12:07pm",
      "content": "BTW I also think the book is outstanding.\n\n"
    },
    {
      "time": "1 May 2008 — 1:04pm",
      "content": "William,\n\nI'm happy you find the book outstanding. I do not. Nor do I care what Zapf thinks about it either. And did you hear that talk Bringhurst gave at TypeCon? I thought it was terrible. Quantum Physics my arse. I 'd rather see typographers, young and old, work out their own aesthetics rather than go running to see what Bringhurst says about the matter before making a move.\n\nAnd I wouldn't put too much stock in those publishing figures.\n\n"
    },
    {
      "time": "1 May 2008 — 2:34pm",
      "content": "Eben,\n\nI quoted Zapf not to say that he must be right, but just to indicate that someone who has been regarded as a leading type designer really admired the book. To me that does say that the book has some merit.\n\nJames,\n\nI think you are forgetting that its title is \"Elements.\" For someone who was an accomplished professional before it was published, such as yourself, I understand that it wouldn't have much to offer. As an introductory work, I do think it is outstanding.\n\nAs to his talk at TypeCon, my reaction was pretty much the same as yours. As I admired his book so much, I was shocked by his pompousness and the malarkey in his talk. I am of the \"be what you are\" school of thought, so this old European guy wearing a sort of kimono jacket full of Chinese characters put me off. Then the BS about quantuum theory. Then he didn't pronounce some of the Chinese with the right tones; evidently my Chinese is better than his--which isn't saying a lot, as mine is pretty elementary.\n\nI admit that if the first I knew of Bringhurst was that talk, I'd be chiming right in with the negativity. But I do think the book is wonderful. My conclusion is that pompousness is not the greatest sin in the world, though it is pretty irritating :)\n\n"
    },
    {
      "time": "1 May 2008 — 3:19pm",
      "content": "Gentlemen, in short---  \nI don't mind Bringhurst or any other author on typography in particular. I think Elements is a great book and we're fortunate to have it as a solid foundation of the mainstream. For better or worse, a mainstream is neccessary and our world would be very unbalanced without it. At the same time I'm critical of conservative writings.\n\nI _love_ classicism. I've paid more attention to it in architecture than in typography, but that balance will be reversed with time.\n\nEben---sorry, but continued debate on 'hyperbole' seems like topic drift to me.\n\nFlorian---I do have a Flickr account and have access to the 'all sizes' extras. Of course users \"...can post the very same files to Flickr that one would use for a book layout and send to a printer...\" but viewing them on a computer screen has its foibles compared to viewing the same resolution images in print.\n\n\"The length of both descriptions and comments on Flickr seems to be unlimited. I just checked: Adding a 10,000 words essay with paragraphs, blockquoted, emphasized passages &c to your picture is no problem.\"\n\nCertainly, but the eye-straining prospect of reading 10,000 word essays on a computer screen doesn't make much sense.\n\nWilliam---that's no problem at all. Common misunderstanding.\n\nThomas---thanks for echoing the idea of writing an alternative to Elements.\n\nj a m e s\n\n"
    },
    {
      "time": "1 May 2008 — 9:18pm",
      "content": "_Then the BS about quantuum theory._\n\nNo longer theory, apparently:  \n [http://www.quantuumep.com/](http://web.archive.org/web/20130315120637/http:/www.quantuumep.com/ \"http://www.quantuumep.com/\")\n\n"
    },
    {
      "time": "1 May 2008 — 10:55pm",
      "content": "Quite a range of reactions! Personally I don't care very much if a person's delivery is ponderous or they wear clothes that don't match their ethnicity - or they have pink hair or whatever. It takes more ( or maybe something else ) to irritate me. And to further disagree - not out of perversity or purpose but just as a matter of actual opinion, I thought the Bringhurst talk was very very interesting, and to me more useful than than his book. Not because it related in any way to physics ( or didn't ) but just because I enjoyed seeing all the powerfully contextual stuff going on in the written & visual life of so many diverse cultures. I guess it takes all kinds.\n\n<cite> seems like topic drift to me </cite> If you say so...\n\n<cite> To me that does say that the book has some merit </cite> It is suggestive of course. But as a rhetorical form it is a soft or better put perhaps - imprecise way of mounting an argument because you invoke the unquestionable authority of the 3rd party ( or too often God/gods) which avoids the necessity of establishing your own criteria.\n\n<cite> ... but the eye-straining prospect of reading 10,000 word essays on a computer screen doesn’t make much sense. </cite> For now, yes. But this might change. I don't think that 10,000 word essays are read all that often anyway.\n\nCertainly it is important to try to stand on the shoulders of giants rather than to simply admire how tall they are. Even if you may fail.\n\n"
    },
    {
      "time": "2 May 2008 — 3:37am",
      "content": "\\>you invoke the unquestionable authority of the 3rd party\n\nEben, you are imputing to me stuff I never said or meant, which is not fair. The \"typographers bible\" stuff probably started with Zapf's 'blurb' on the cover, and that's partly why I quoted it. Also to indicate that a very knowledgeable and respected person said it. Experience and esteem don't make a person right, but they do mean his opinion has some weight, and is worthy of consideration. That's why authors and publishers seek out the opinion of esteemed people in the field of the book. Their opinion has weight, even though no \"unquestionable authority\" exists.\n\nOh, and there was interesting content in Bringhurst's talk, though I remember thinking it thin--and right now I can't now remember what it was.\n\n"
    },
    {
      "time": "2 May 2008 — 5:57am",
      "content": "Eben: \"_seems like topic drift to me_ If you say so...\"\n\nAlso try: semantic quibbling. Call a spade a spade. Even when you call it a shovel, it's still a spade.\n\nj a m e s\n\n"
    },
    {
      "time": "2 May 2008 — 11:58am",
      "content": "<cite> semantic quibbling </cite>\n\nSo you disagree that there is a difference between the needs of type maker and somebody making a survey or the topic then? Just spades & shovels? \"A rose by any other name wold smells as sweet\" doesn't quite address the question - I think.\n\nWhen I said \"if you say so\" I was agreeing not to keep digging into what you could possibly mean by spades & spirit. I can still do that. Let it go that is. But I still can't fathom what you mean. And you have interesting ideas so I would just assume know if it's okay with you. Or not.\n\nIn terms of topic drift: If you mean that we are still not talking about the italics then you are 100% correct. I plan to look into it myself so I understand it better and ask Stephen & Yves what they think as well.\n\n<cite> which is not fair.</cite>\n\nI'm sorry. Maybe that's right. It would be too easy to think from what I wrote that I was saying you were invoking \"( or too often God/gods)\" or had done so in the past. Or possibly other things. What I do mean is that the form an argument takes has qualities and characteristics. Your rhetoric called for respect for the received wisdom of Hermann Zapf. Who, in fairness and candor I do respect more & more. And it's an effective argument as far as it goes. So no harm so far - correct? What I am saying also though is that it is an oblique strategy. It doesn't deal with the statement ( in this case James') in a direct or detailed manner. None of this is as far as I can see, personal. It doesn't deal with what you are or may be but rather with how you have made your case with James. If I have missed something please let me know because i don't want to put words in your mouth you would prefer not be there or to irritate you etc.\n\n"
    },
    {
      "time": "2 May 2008 — 3:19pm",
      "content": "Eben: \"So you disagree that there is a difference between the needs of type maker and somebody making a survey or the topic then?\"\n\nNo (calmly).\n\n\"Just spades & shovels? “A rose by any other name wold smells as sweet” doesn’t quite address the question - I think.\"\n\nIf you have a spade, and you call it a spade, it's a spade. If you call the same object a shovel, the object does not change to reflect its new name. When I said \"hyperbole\" I meant that your description of the images in Nesbitt's book was hyperbolic in being _\"a figure of speech consisting in exaggerated statement, used to express strong feeling...\"_ -- definition from the Shorter Oxford English Dictionary. I called it hyperbole because at the time of writing it you omitted to explain \"To say that it falls far short for a type designer is simply accurate.\" as you later did explain.\n\nBy \"continued debate on ’hyperbole’ seems like topic drift to me\" I meant mainly that quibbling about whether your description of \"deeply flawed\" was hyperbole or not would be of minimal value to the discussion (drift). That's why I later said, \"this is a discussion thread and I am not prepared to sit here bickering\" because sidetracks like that one are, in my book of semantics, bickering and not really discussion.\n\n\"When I said “if you say so” I was agreeing not to keep digging into what you could possibly mean by spades & spirit. I can still do that. Let it go that is. But I still can’t fathom what you mean. And you have interesting ideas so I would just assume know if it’s okay with you. Or not.\"\n\nIf you were agreeing not to keep digging into what I could possibly mean by \"spades and shovels\" then why did you say anything at all? Saying \"If you say so\" was a confrontational way of stating your neutral position. If you agree not to keep digging into what a person meant by what they said, then don't say anything about it. Just let it stand and go on with the debate proper.\n\n\"In terms of topic drift: If you mean that we are still not talking about the italics then you are 100% correct. I plan to look into it myself so I understand it better and ask Stephen & Yves what they think as well.\"\n\nThis is good. This whole thread could have been much shorter and easier to decipher had you concentrated on that and not quibbled (bickered) about mere words.\n\nWords are cheap man. Don't ever let another person's words get your goat or distract you from the true purpose of the day.\n\nj a m e s\n\n"
    },
    {
      "time": "2 May 2008 — 4:28pm",
      "content": "\\>It doesn’t deal with the statement ( in this case James’) in a direct or detailed manner. ...if I have missed something please let me know\n\nI also noted in that post that book typography--the focus of Bringhurst's interest--is also commercial, and gave the numbers. And I argued that 90% of Bringhurst's guidelines apply to all typography. It seems to me that a good counter argument would address these.\n\n"
    },
    {
      "time": "2 May 2008 — 6:33pm",
      "content": "Book typography is book typography. Traditionally commercial typography is everything else. Magazines, advertising, collateral etc. I disagree that Bringhurst covers 90 percent of all typography. He covers book typography, and has no advice to give on many of the problems faced by typographers working in magazines, advertisements and the like.\n\nWilliam have you ever worked as a commercial typographer? Ever fought with an editor to get them to change a bit of copy to a good rag on a magazine article?\n\nAlso the numbers you quote from Publishers Weekly are from the AAP. They under report in some cases and over report in others. Not the best source.\n\nOn another note, Publishers Weekly has lost more than a step in the years since my wife was the editor-in-chief. (my personal bias is clearly obvious on this point)\n\n"
    },
    {
      "time": "2 May 2008 — 9:35pm",
      "content": "\\>I disagree that Bringhurst covers 90 percent of all typography.\n\nI wrote:\n\n\"90% of Bringhurst’s guidelines apply to all typography.\"\n\nYour paraphrase of what I wrote garbles my meaning. What I wrote I think is true and what you wrongly impute to me is false.\n\nThe exact revenue numbers are not important to my argument. My point was that books in the US are a major industry on the order of magnitude of magazine publishing--tens of billions of dollars. If you have other better numbers which would change that picture please let us know.\n\n"
    },
    {
      "time": "2 May 2008 — 11:10pm",
      "content": "William what distinctions do you draw between \"90% of Bringhurst’s guidelines apply to all typography.\"and \"Bringhurst covers 90 percent of all typography\". Honestly they sound very much the same. What's all this imputing? As I said I have no special beef with the \"big B\" as it were, but I think the idea that his Elements book covers 90% of all typographic tasks is simply mistaken. Total Glyph's processed is a silly way to prove such an idea. Time spent on tasks is likelier in my view.\n\n"
    },
    {
      "time": "3 May 2008 — 5:02am",
      "content": "Bill -- James's quibble with the publishing numbers is a red herring. I believe his main point is that book typography and \"commercial\" typography are two different things. Financial numbers that you provided to prove that book publishing is as large a commercial endeavor as other forms is not the issue, since \"commercial\" in this instance is not referring to the financial magnitude or viability of the enterprise.\n\nI believe what James is asserting is that there is a large arena of typography (under his rubric of \"commercial\") that operates under different demands (these being generally the commercial aspect) and holds to different standards than that of book composition. Further, he is arguing that many of Bringhurst's guidelines do not adequately address these sorts of typography and their situations, or they provide unrealistic (and not even necessarily desirable) objectives for this class of typography.\n\nI think I see his point. And I can see how this, exacerbated by an overly reverent attitude towards Bringhurst as a one-size-fits-all \"bible\" of typography to be turned to for a definitive answer to every typographical conundrum, could be grating. (Not you, personally, Bill; but a general attitude.)\n\n-- K.\n\n"
    },
    {
      "time": "3 May 2008 — 5:51am",
      "content": "_Honestly they sound very much the same._\n\nLet's say I have a very detailed and helpful recipe for making blueberry muffins.\n\nIf I say \"80% of this recipe applies to all muffins,\" that's probably true. No matter what kind of muffins I'm making, I'll probably want to grease the muffin tins, mix the wet ingredients first, preheat the oven, use flour, eggs, sugar, etc. Obviously the blueberries would be a part of the other 20%, replaced by shredded carrots or bran or orange zest or whatever depending on the muffin desired.\n\nIf I say \"this recipe applies to 80% of all muffins,\" that's probably false, as blueberry muffins do not make up 4/5 of all muffins.\n\nDoes that help?\n\nOn this whole \"appeal to authority\" conversation: is it absurd, or merely apropos, that we'd debate whether Bill's invocation of Zapf was an appeal to authority, when Zapf's statement in question (calling something a \"bible\") is itself the ultimate appeal to authority?!\n\nI thought the epic [rule or law thread](http://web.archive.org/web/20130315120637/http:/www.typophile.com/node/37310) was helpful in discerning the different effects of how direction in typography is worded.\n\nI have the sense that, generations ago, one learned the \"rules\" of typography from one's mentor, and the question of competing \"authorities\" on correctness was rare.\n\n"
    },
    {
      "time": "3 May 2008 — 11:14am",
      "content": "\\>Honestly they sound very much the same.\n\nEben, a statement and its converse generally don't have the same meaning.\n\n\"90% of Americans drink Starbucks Coffee\" and \"Americans drink 90% of Starbucks Coffee\" don't mean the same thing. The first can be true and the second false, if a lot of Starbucks coffee is drunk outside the United states.\n\nDo I need to do a picture for you with a map and little people and cups of coffee, or do you get it now?\n\nWhat I was saying before I was so misunderstood is that 90% of Bringhurst's rules apply to all typography. That's why it's called \"Elements of Typographic Style\" and not \"The Complete Typographer.\"\n\nLet's take a couple of rules: \"Read text before designing it\" and \"Avoid overpunctuating lists.\" I may be wrong, but it seems to me like these are also good guidelines for setting text in advertising as well, or for magazine articles. Of course the designer doesn't have to read all the text, but if he or she doesn't read enough to get its flavor it seems to me not so good a start for the design. If he or she is designing a template for a periodical, then reading some of the articles will be important to getting the flavor of the publication. So that's a little different, but the general principle seems to me clear and pretty good.\n\nNow there are a lot of additional considerations for each kind of publication: if you are designing an advertisement, a poster, a magazine, a newspaper, a blog, I think there are a lot of special considerations that apply to these that are different from books. How many additional considerations? I don't know, but a lot more than 10% additional guidelines. That's why it's not true that Bringhurst covers 90% of typography--nor does he claim to.\n\nKent,\n\nI agree with part of what James M. has been writing, and I don't understand why he is taking issue when I agree with him. Indeed in [this review of Bringhurst](http://web.archive.org/web/20130315120637/http:/www.typophile.com/books/essentials) that I wrote for Typophile I criticized the book for its narrowly classical taste, and its neglect of the often very different demands of advertising and other kinds of publication outside books. And I wrote this I think three years ago, at a time I hadn't read anybody else criticizing Bringhurst at all. But I still think it's a wonderful book in spite of its shortcomings.\n\nThe part of what James M has said I indeed have not agreed with. It is, as you say, that Bringhurst's rules are actually bad for commercial typography. If you remove those that are obviously book specific, such as guidelines for title pages, then I still think that 90% are good for all text. I would also take out the preference for English rules on quotetation marks and dashes. I actually agree with Bringhurst in preferring these, but it is generally not realistic to go against American custom in America.\n\nI confess I haven't gone through all 129 rules (I just counted them) to see if you'd have to throw out more than 10%, after removing obviously book specific. But my feeling is that 90% would still hold up. Oh, and by the way most of Bringhurst's advice can be found scattered in other, earlier books as well.\n\nI'm here to learn, so I'd be glad to ready why some of his rules are wrong for magazines or other publications.\n\nI'd been even happier to read guidelines for varied kinds of publication beyond books that are as good and as informative as Bringhurst's general rules.\n\n"
    },
    {
      "time": "3 May 2008 — 2:05pm",
      "content": "Kent, extremely well put!\n\n<cite> Does that help?</cite>\n\nYes it does.\n\nBill that was the sort of post I was hoping to read. It clarified a lot about your position for me. Thanks.\n\nBut what I think is missing from the muffin analogy and also from Bill's more type oriented statements is that while 90% of may have some application to some magazine and other commercial work - the world of commercial work extends vastly beyond the scope of Bringhurst's book. Which means that even assuming that the idea that 90% of Elements is applicable to commercial work ( which I am not quite ready to concede yet - but I will admit is possible ) that still doesn't mean that Elements is applicable to even 20% of commercial work. Again I make no special claim either way. I am just pointing out the distinction.\n\nTo be able to make the claim in a serious way you would have to break it down to a degree I am unwilling to do.\n\nWilliam, I am in agreement with you about it being a wonderful book not because I am certain I agree with all the ideas in it but because it is a serious attempt to grip a complex subject. I have said this kind of thing before: it's valuable because it is an example of how to try to get your head around the subject. But that doesn't Jams' point about the book having a bit of a dangerous allure isn't also so.\n\n<cite> to read guidelines for varied kinds of publication </cite>\n\nMe too by Gum! I have an idea ( hopefully false ) that that world is a bit more cut-throat than books. Not that books is somehow a picnic. So getting folks to give out their tricks and insights might be tough.\n\n<cite> I have the sense that, generations ago, one learned the “rules” of typography from one’s mentor, and the question of competing “authorities” on correctness was rare. </cite>\n\nA state I resolutely wish to avoid! Please don't tell that sounds good to you. Or, are you making some other point?\n\n<cite> actually bad for </cite>\n\nYou could say \"not applicable\" or \"different from\" too. They carry less baggage.\n\n<cite> this whole “appeal to authority” conversation </cite>\n\nI will admit that I was too harsh with Bill about that. But that was my tone. Again Sorry. But at the same time I do think that that the form an argument takes is important to note and is in fact utterly fair; and more than that, often necessary.\n\n"
    },
    {
      "time": "3 May 2008 — 4:32pm",
      "content": "_Please don’t tell that sounds good to you. Or, are you making some other point?_\n\nOh no, I'm not pining for a return to that. I just find it interesting. It seems to me that typography is a world in which there is lots of longing on the part of student-types for authorities to deliver the rules of correctness, and a fair amount of longing on the part of mentor-types to deliver some rules with authority. And my picture of the history of typography (undocumented, so I welcome correction) is that for most of that history, those longings were met by the apprenticeship structure unproblematically (at least when locally considered). Now we have a world of competing authorities available to beginners - that's to the good (when globally considered) as you mention. But I find it interesting that the longing doesn't go away in these changed circumstances. I think there are structures of authority in the world of typography that it would be interesting to dissect.\n\n"
    },
    {
      "time": "3 May 2008 — 5:23pm",
      "content": "Those are good points to be sure. I think it's also true that part of what creates this longing is the fact that in type ( or even just letter work) so much just depends\\* that it is very easy to feel lost or at least insecure. That along with the fact that some insights can suddenly make things seem so much clearer - like learning about overshoots for instance - combine to create a hunger for authority and the seeming instant magic \"rightness\". But part of what's great about letter design, and font design as a subset of that; is that not only is it a hard nut to crack properly, but I it can be cracked very very well in more than one way. So this longing is unhealthy. I am not trying to convince you but just writing down what your post made me think of.\n\n\\* on the purpose, the medium, the culture, the paper, the size, and so on\n\n"
    }
  ]
}
