{
  "id": "44605",
  "title": "What does ...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "...water mean to you? How do you relate to it? What does it make you think of?\n\nJust wanted to get some additional thoughts for some current research.\n\nany and all thoughts appreciated.\n\ncheers.\n\n",
  "author": "Ratbaggy",
  "time": "23 Apr 2008 — 5:27pm",
  "uid": "13171",
  "comments": [
    {
      "time": "23 Apr 2008 — 5:59pm",
      "content": "Privilege. Because most of the world doesn’t get enough clean water to waste time contemplating it.\n\n"
    },
    {
      "time": "23 Apr 2008 — 6:20pm",
      "content": "Clean. Rain. Blue. Fear in deep water. Mother Earth crying for all those who are sad (the rain). The beginning of life. What the world really looks like is when you see it reflected off water, for everything is actually upside down and this world is dynamic, not static, symbolized by the ripples or waves.\n\nI have meditated on water, specifically the rain more than any other subject.\n\nThat was a fun waste of time.\n\npbc\n\n"
    },
    {
      "time": "23 Apr 2008 — 6:23pm",
      "content": "Calm. Peace. Clean.\n\nI also thought of Lake Powell. Although it isn't the cleanest place on the planet it is peaceful and calm.  \n [http://www.flickr.com/photos/typegirl/6627749/in/set-165339/](http://web.archive.org/web/20120624053943/http:/www.flickr.com/photos/typegirl/6627749/in/set-165339/ \"http://www.flickr.com/photos/typegirl/6627749/in/set-165339/\")\n\n"
    },
    {
      "time": "23 Apr 2008 — 6:24pm",
      "content": "I will tell you a water story: I was at Echo Park Lake and I saw a dead duck floating in the lake. There were no ripples coming from it. Then I walked over to the bridge and I saw a duck sleeping. There were ripples. My conclusion: that's how life is, while we're alive we generate endless ripples, once we pass those ripples begin to subside.\n\nDucks bob on liquid glass.\n\npbc\n\n"
    },
    {
      "time": "23 Apr 2008 — 7:12pm",
      "content": "You might look at the elemental aspects. It is changeable like air in that it can conform to any shape or space. It can also be solid like earth as in a tsunami or a fast impact against the surface of water. It is cooling, as mentioned above. It is the nemesis of fire, able to mix with earth and air.\n\nYou might look at the physics of it in that it has three very common states—gas, liquid and solid.\n\nI believe the Chinese represent it as two solid lines with a dashed line between, as a river might create a barier of motion that separates masses on land.\n\nNot to be too crunchy, but these are very old ideas.\n\nI took a canyoneering trek through the virgin river narrows one time. Spent about 48 hours floating or walking through a river with vertical canyon walls on either side. Two German tourists died a month before on the same route as a flash flood came through and essentially obliterated them. Nothing was ever found. That gave me a real sense for the absolute force of water.\n\n"
    },
    {
      "time": "23 Apr 2008 — 7:45pm",
      "content": "\\>...for some current research\n\nwhat's the subject? flowing scripts? :)\n\n"
    },
    {
      "time": "23 Apr 2008 — 8:50pm",
      "content": "We used to do this thing with smooth flat rocks. \"cut the devil's throat\". The object was to throw a stone as high and far as you could, but it has to hit the water without a splash. You'd watch the rock sail through the air in a smooth, predictable arc. Spinning, it turned on its side and would drop quickly, piercing the surface with the merest \"thp\" and hardly a ripple and be gone. As if from the face of the earth. Which in a way, it was. The fall to the deep and murky bottom of the lake was out of sight and mind. Like everything else down there.\n\n-=®=-\n\n"
    },
    {
      "time": "27 Apr 2008 — 6:00pm",
      "content": "excellent. thansk all.\n\nnope ... no flowing scripts to be seen.\n\n:)\n\nfilm festival theme. just wanted to make sure I had most bases covered.\n\n:)  \nCheers\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20120624053943/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
