{
  "id": "44627",
  "title": "What font formats do you include in your downloads for sale?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "We're at a point as foundries that sell fonts primarily where it's reasonable to only offer OpenType PS fonts for download to customers but there are some that say we must also include TrueType as well since so many older apps don't support loading OT fonts so, faced with the prospect of updating my entire library in OT, do I cover all bases and include OpenType PS, Mac/Win PS, and Mac/Win TT for the respective buyers? Do I only over OpenType PS? Do I offer OpenType PS AND Mac/Win TT?\n\nThe problem is, if I only offer OpenType PS, I'm likely to get e-mails from customers who can't use this format BUT if I offer all three I'm likely to get the same amount of folks who think nothing of dragging and dropping a single folder with all three font formats into Suitcase and none of 'em working so I'm trying to mitigate the difference.\n\nI'd like as many different perspectives on this as the group can muster so please share this thread around because I don't feel I'm the first foundry to have this concern.\n\nThanks,  \nStuart :D\n\n",
  "author": "Diner",
  "time": "24 Apr 2008 — 7:25am",
  "uid": "1226",
  "comments": [
    {
      "time": "24 Apr 2008 — 8:21am",
      "content": "I had the exact same concerns when deciding what to do for my site. But I have the luxury of not having any \"baggage\" in that I started fresh without any previously made fonts...\n\nAs my speciality is multilingual fonts I needed Unicode support, so Postscript was out of the question. Yay!\n\nAt first I though about only offering OpenType PS (the \"professional\" format of choice ;), but soon decided that this would leave out too many customers - you need TrueTypes for \"Office\" users (especially Powerpoint is finicky with fonts ;)\n\nFinally I decided to sell the the two formats separately - to prevent customers from installing both formats on the same computer and ending up with conflicts.\n\nAn added bonus is that both formats can be used on both Mac & Windows...\n\nSo far it has worked out fine.  \n:)\n\nRoger\n\n"
    },
    {
      "time": "24 Apr 2008 — 9:01am",
      "content": "Well, I think old Type1 and old TT formats are mostly obsolete.  \nHowever, I'd offer both PS and TT flavour OpenType fonts.\n\nI have already experienced in some apps, which with some other fonts worked with either, for one specific font they'd accept only the TT-flavour OT font. That is, they were fine on screen, both could be used, but when printing, the PS-flavour OT font was messed up.\n\nI have never found out why. Other PS-flavour OTs worked well.\n\n"
    },
    {
      "time": "24 Apr 2008 — 12:30pm",
      "content": "My present plan for future releases is to offer a basic .ttf font (with Latin Extended encoding) at low cost, and a full-featured .otf at higher price.\n\nIt's a way of tagging different product versions without giving them different names\n\nThe .ttf fonts aren't strictly speaking OpenType, but the difference is moot, as many .otf fonts don't have OpenType features!\n\n(When OS X was introduced, with functionality for Windows TrueType fonts, the benefit of OpenType in providing cross-platform compatability was considerably lessened; subsequently, the benefit of OpenType has come to be more associated with substitution features.)\n\n"
    },
    {
      "time": "24 Apr 2008 — 12:40pm",
      "content": "Thanks so far for the responses . . . Please keep 'em coming!\n\nThat said, the question remains, if the OpenType font contains alternates and ligatures, as a courtesy do we need to offer the basic TrueType folks these extra glyphs in the form of an alternate font where they live in the roman slots or do we say, sorry, upgrade and you'll see the features in the OT version?\n\nStuart\n\nPS: I agree with you Nick that OpenType of itself is now a non-feature but it's been well marketed to convince folks if they aren't using OT fonts they are dinosaurs and so all fonts that aren't OT are also dinosaurs . . .\n\n"
    },
    {
      "time": "24 Apr 2008 — 2:43pm",
      "content": "_\"That said, the question remains, if the OpenType font contains alternates and ligatures, as a courtesy do we need to offer the basic TrueType folks these extra glyphs in the form of an alternate font where they live in the roman slots or do we say, sorry, upgrade and you’ll see the features in the OT version?\"_\n\nDepends on your target group.\n\n"
    },
    {
      "time": "24 Apr 2008 — 5:06pm",
      "content": "Freelance Designers, Scrapbooking Moms, Advertising Agency Art Directors . . . It's a total shotgun which begs the question that I started the thread with . . . Anybody with a computer who wants to buy fonts is a potential customer so I think I've got all walks of life out there in my customer base . . .\n\nStuart\n\n"
    },
    {
      "time": "25 Apr 2008 — 12:23am",
      "content": "I believe you can count with the fact that in the western hemisphere everyone (i.e.99.99%+) of the users who own a computer and have internet access (so that they can buy your fonts online/download them) will have software that works fine with OT, so no need for 256-character fonts there.\n\nOn the other hand, for those users that live in the other part of the world and where probably still most, but by no means that high percentage has OT-aware swoftware, you Latin-1 encoded 8-bit font won't provide the necessary characters. Basically then you'd have to start building fonts for every arcane 8-bit encoding. No?\n\nJust philosophing.\n\n"
    },
    {
      "time": "25 Apr 2008 — 5:24am",
      "content": "I'm just wondering about the same at the moment.\n\nAnother point to consider: if you are selling opentype fonts: do you use encoded or unencoded \"special\" glyphs (like Smallcaps, alternate figures, ligatures, etc.)?  \nFor really opentype-savvy applications, no encoding may be better (no chaos with manually inserted characters and changing fonts), but for everything else, which may support unicode, but almost no typographic features, it would be better to encode this characters to make them available at all...\n\nDo you just decide which may be better for most of the customers?  \nOr do you provide two different versions?\n\n"
    },
    {
      "time": "28 Apr 2008 — 12:44am",
      "content": "I think it's good practice to have the glyph variants available in PUA. Exactly because of the OpenType-unaware programs. Those people, who have OpenType features-capable programs AND know about OpenType features and how to activate them won't insert those glyphs manually any way. For all the other people, I think, it is unethical to barr access to the glyphs they have paid for.\n\nIt's not our job to \\*enforce\\* properly encoded text.\n\n"
    },
    {
      "time": "28 Apr 2008 — 4:24am",
      "content": "Yes, but...  \n [http://blogs.adobe.com/typblography/2006/05/eliminate\\_priva.html](http://web.archive.org/web/20131014231917/http:/blogs.adobe.com/typblography/2006/05/eliminate_priva.html \"http://blogs.adobe.com/typblography/2006/05/eliminate\\_priva.html\")\n\nAnd: It's also not our job to motivate software companies to support opentype features, but we could...\n\nBut as I said: I'm not sure what would be better.\n\n"
    },
    {
      "time": "28 Apr 2008 — 5:42am",
      "content": "And no. We cannot make user software producing elephants move. Only if \\_users\\_ (not font designers) demand it (and only if very strongly) will they dignify themselves to make a step. If you don't make them aware of the possibility (and for thoset who don't know about OT features \"by profession\" what is better than to show them what \\_would\\_ be possible) they won't start to demand.\n\nMy view anyway.\n\n"
    },
    {
      "time": "28 Apr 2008 — 7:55am",
      "content": "In some cases where there are only a handful of alternates or ligatures, it would seem wasteful to create a separate font in multiple flavors just for cases of substitutions . . . Any yet if you throw them in unused slots in the font, they are never truly accessible via the Character Map applications on Mac and Windows . . .\n\nStuart\n\n"
    },
    {
      "time": "12 May 2008 — 10:19pm",
      "content": "We supply TTFs and PS-flavored OTFs at TypeTrust. We charge a service fee for anything else. It's more of a deterrent than a money grab, but I do break out any Opentype features into separate fonts if need be. There is some work involved.\n\nIn 3 years of business we've only had one customer request Mac PostScript files.\n\n"
    },
    {
      "time": "13 May 2008 — 11:12am",
      "content": "S.N. -- <cite>And: It's also not our job to motivate software companies to support opentype features, but we could</cite>\n\nWell, it's not _our_ job to address _their_ applications' shortcomings. We do our job. They please do their job. And if users cannot access certain glyphs, we should be as helpful as possible and refer them to the according feature-request forms of whichever company you may be speaking of.&nbsp;&nbsp;;-)\n\n"
    },
    {
      "time": "27 May 2008 — 8:48am",
      "content": "if youre client doesn't have the means to use opentype fonts they aren't really neededing the quality you're putting into the fonts.\n\n"
    }
  ]
}
