{
  "id": "44631",
  "title": "Korean Fonts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Looking for a source for Korean fonts, specifically Sandol-Gothic. Havent found anything great in all my googling efforts. Anyone know where to look?\n\n",
  "author": "brendandev",
  "time": "24 Apr 2008 — 8:58am",
  "uid": "30112",
  "comments": [
    {
      "time": "24 Apr 2008 — 9:30am",
      "content": "The link for Sandoll Gothic is here: [https://www.sandoll.co.kr/SandollWeb/shop/product\\_down\\_read.asp?idx=187&listType=2](http://web.archive.org/web/20120415204315/https:/www.sandoll.co.kr/SandollWeb/shop/product_down_read.asp?idx=187&listType=2)\n\nHowever, purchasing the font is extremely convoluted for a non-Korean, mainly because the site is only available in Korean. You have to become a member, which requires you to e-mail or fax them a copy of your passport or driver's licence unless you're Korean and have a national identification number. Unless you have a working knowledge of Korean, you'll need a Korean speaker to guide you through the steps. The situation will be similar with other Korean foundries. You have South Korea's excessive regulation of internet commerce to thank...\n\nThere is a vendor I found whose page is in English offering mostly Yoon Design fonts: [http://asiasoft.com/bin/category/?mainCatID=2&subCatID=9](http://web.archive.org/web/20120415204315/http:/asiasoft.com/bin/category/?mainCatID=2&subCatID=9)\n\nAlternatively, if you have $1585 to spare, [the Korean version of Adobe InDesign CS2](http://web.archive.org/web/20120415204315/http:/asiasoft.com/bin/product/?itemCode=ADDW2K&search=) comes bundled with an impressive range of releases by all the major Korean foundries...\n\n"
    },
    {
      "time": "24 Apr 2008 — 10:28am",
      "content": "Slightly off-topic:  \nThere’s an exhibition about ‘Ahn Sang Soo. The Beauty of Hangul’ at [Klingspor Museum](http://web.archive.org/web/20120415204315/http:/www.typophile.com/wiki/Klingspor%20Museum) in Offenbach, Germany. [More information](http://web.archive.org/web/20120415204315/http:/www.klingspor-museum.de/).\n\n"
    },
    {
      "time": "23 May 2009 — 10:05pm",
      "content": "Looking for a source for Korean fonts, specifically Sandol-Gothic. Havent found anything great in all my googling efforts. Anyone know where to look?\n\nHi branden have u got the font for u if yes can u send to [epaysunil@gmail.com](mailto:epaysunil@gmail.com). Thanks in advance\n\n"
    },
    {
      "time": "24 May 2009 — 3:14am",
      "content": "Sunil, I'm pretty sure that the EULA of Sandoll Gothic prevents one from sending it to someone else who hasn't bought the licence. In general, you can't just ask someone to send you a commercial font.\n\nIf you are not willing to pay for commercial fonts, then try to look for free alternatives, at least. Here is a link where you can download two quality free fonts, including Nanum Gothic, also from Sandoll:\n\n[http://hangeul.naver.com/index.nhn?goto=fonts#fonts](http://web.archive.org/web/20120415204315/http:/hangeul.naver.com/index.nhn?goto=fonts#fonts \"http://hangeul.naver.com/index.nhn?goto=fonts#fonts\")\n\n"
    },
    {
      "time": "24 May 2009 — 4:29am",
      "content": "Hi Jongseong, thanks for your link, but i am looking for sandol-gothic only and no alternative. Suggest if there is a way to get the font free or any other site where i can get it.\n\nThanks in advance\n\nregards  \nsunil\n\n"
    },
    {
      "time": "24 May 2009 — 1:59pm",
      "content": "Write to Sandoll directly and explain why you need the font for free. I'm serious. If you make your case convincingly, they might be open to granting you the licence for free. I know Sandoll has done promotions of this sort where they encourage those who can't afford their library, like cash-strapped NGOs for example, to explain why they need Sandoll fonts, and selected entrants can get the fonts for free.\n\nI've heard an anecdote about a penniless graphic designer writing to Process Type Foundry with a similar request, and he was also granted the fonts for free.\n\nI hope this helps. If this doesn't work, and you absolutely need Sandoll Gothic, then be prepared to pay for it, because it's a commercial product that some people spent years developing, and they are well within their rights to charge people for the licence to use it.\n\n"
    }
  ]
}
