{
  "id": "44645",
  "title": "TypeCon2008",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Haven't been around these parts in a while, but with the academic year winding down I'm beginning to feel human again. At the moment I'm finalizing plans to head to Buffalo in July for my first TypeCon. Anyone else going?\n\n",
  "author": "jason",
  "time": "24 Apr 2008 — 2:54pm",
  "uid": "3771",
  "comments": [
    {
      "time": "24 Apr 2008 — 3:06pm",
      "content": "I'm going and it will be my first. I'm waiting for a few details to pull the trigger on the hotel and tickets.\n\n"
    },
    {
      "time": "24 Apr 2008 — 3:16pm",
      "content": "Jason -- Glad to hear that you're planning to come this year. That's great. I'll be there, of course.\n\nWe're a little bit behind schedule getting the full TypeCon website up and running ( [www.typecon.com](http://web.archive.org/web/20130823150306/http:/www.typecon.com/ \"www.typecon.com\")). There have been some structural overhauls behind the scenes and the web wonks (all generous volunteers!) are working hard to get everything buttoned down. Hopefully soon.\n\nNaturally, the early registration cut-off has been adjusted accordingly.\n\nAlso, Tamye is still fielding those last-minute proposals and juggling everything to put together another dynamite program.\n\nBut the hotel is already taking reservations and Tamye negotiated the room rate down even further than first announced -- another $15/night slashed. So, if you know you're coming, you might go ahead and reserve the room even before we get the registration up and live.\n\n-- Kent.\n\n"
    },
    {
      "time": "24 Apr 2008 — 3:21pm",
      "content": "I'll be there.\n\nKent, will we see a final line-up of speakers before the early bird date has flown?\n\n"
    },
    {
      "time": "24 Apr 2008 — 3:25pm",
      "content": "I’ll be there. Given the way the job market is going, I’ll certainly have the free time.\n\n"
    },
    {
      "time": "24 Apr 2008 — 3:53pm",
      "content": "Ah, Tiff, finally I'll have a chance to say hello in person. Looking forward to seeing who else is planning on attending so that I might connect face to face with some of the gang I've interacted with around here over the past few years.\n\nI'm going to spend the entire week in Buffalo (15-21), then head off for a week in NY, with a day at the NY Center for Book Arts, an afternoon each at the Grolier Club and the NYPL Rare Books Division, an afternoon at Poets House (browsing their over 8,000 poetry chapbooks), and then a couple of days visiting galleries & book stores.\n\nAs a tangent to this thread, anyone know of any book shops in NY similar to [Wessel & Lieberman](http://web.archive.org/web/20130823150306/http:/www.wlbooks.com/cgi-bin/wlb455.cgi/index.html) in Seattle (with dedicated sections of typography & fine-press books)? I'll spend some time at Strand, of course, but I'm looking for small-/fine-press stuff that might be done letterpress.\n\n"
    },
    {
      "time": "24 Apr 2008 — 4:10pm",
      "content": "Yay, TypeCon! I can't wait. The program is coming together, and it's going to be an amazing lineup. The website is so close - our wonderful volunteers are building a better one, and it always takes more time than we think. We changed the early bird registration deadline so you'll all have plenty of time to register at the lowest rate once the website goes live.\n\nDo book hotel fast, no matter what. We contracted for a very large block of rooms at the Hyatt for our group, but the super low rate of $109 per night means more of our attendees than ever will stay at the conference hotel. We have always sold out our room block in the past, and it looks like we will sell out a lot quicker this year.\n\nI'm headed back to Buffalo for more planning meetings and to finalize special events and such, just in time for Cinco de Mayo. The weather is wonderful, and everyone in Buff is so excited that we're coming!\n\n"
    },
    {
      "time": "24 Apr 2008 — 5:19pm",
      "content": "Looks like the only rooms available now are two double beds. I asked for a single queen or king but I guess those are all gone. :^(\n\n"
    },
    {
      "time": "24 Apr 2008 — 9:28pm",
      "content": "I will be there with bells on. Okay. Not really with bells.\n\n"
    },
    {
      "time": "24 Apr 2008 — 10:08pm",
      "content": "I am booked into the Hyatt ( 15th-20th BTW ), and now I have decide if I should fly in direct or drive there from somewhere else... So many Libraries! So little time!\n\n"
    },
    {
      "time": "24 Apr 2008 — 10:12pm",
      "content": "I got a single BTW. Maybe you should try back!\n\n"
    },
    {
      "time": "24 Apr 2008 — 10:40pm",
      "content": "Unfortunately I will miss it.\n\nWe have a bit of a budget problem in California & there's no travel money this year, and i gotta save every penny for the new baby.\n\nsorry! i'll miss you guys.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20130823150306/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\")\n\n"
    },
    {
      "time": "24 Apr 2008 — 11:18pm",
      "content": "While we're at it, anyone from Buffalo have suggestions for good book stores? Is anyone from Buffalo?\n\n"
    },
    {
      "time": "24 Apr 2008 — 11:32pm",
      "content": "Hey, Jupiterboy (a.k.a. James), me too! I was only able to choose a room with two double beds -- so if you want to be my roommate, just say the word! The only caveat is that I asked for a Non-Smoking room. I'll arrive on a Monday evening (July 14) and leave on a Monday morning (July 21).\n\nJoshua, sorry to hear you can't make it, but congrats on the arriving baby!\n\n"
    },
    {
      "time": "25 Apr 2008 — 3:18am",
      "content": "<cite>I got a single BTW. Maybe you should try back!</cite>\n\nWorking hypothesis is that if you book for two you can only choose a double bed because it is a conference rate?\n\n<cite>Hey, Jupiterboy (a.k.a. James), me too! I was only able to choose a room with two double beds — so if you want to be my roommate, just say the word! The only caveat is that I asked for a Non-Smoking room.</cite>\n\n(a.k.a. Mark BTW) That's a great idea and a smart offer however Pam will be with me (hooray!) so I was more interested in avoiding the Dick Van Dyke arrangements. After calling the hotel I believe it will be a matter of availability on arrival.\n\n<cite>While we’re at it, anyone from Buffalo have suggestions for good book stores? Is anyone from Buffalo?</cite> Paul Hunt and Richard Kegler are the go to guys on this. I suspect some of the Toronto peeps know their way around too.\n\n"
    },
    {
      "time": "25 Apr 2008 — 3:57am",
      "content": "I am currently not planning on making it to TypeCon. First time I'll have missed it since the third one, I think.\n\n"
    },
    {
      "time": "25 Apr 2008 — 4:40am",
      "content": "Tiff -- Only Tamye can tell us for sure when the final line-up will be settled. You know how it goes.\n\nJoshua, Thomas -- I'm really bummed that you guys won't make it this year. It won't quite be the same without you.\n\n-- K.\n\n"
    },
    {
      "time": "25 Apr 2008 — 5:48am",
      "content": "_I’m going and it will be my first._  \nLikewise. I'm looking forward to it!\n\n"
    },
    {
      "time": "25 Apr 2008 — 6:45am",
      "content": "_While we’re at it, anyone from Buffalo have suggestions for good book stores?_\n\nThere are a few \"antiquarian\" bookshops. One of the largest is conveniently located a very short walk from the conference hotel.  \n [http://www.oldeditions.com/](http://web.archive.org/web/20130823150306/http:/www.oldeditions.com/ \"http://www.oldeditions.com/\")  \nA google earth map is being prepared that has local points of interest related to the conference including bookshops. I believe this should be made available when the website goes live.\n\n"
    },
    {
      "time": "25 Apr 2008 — 6:56am",
      "content": "I guess there's no excuse for me not to go, as it's just down the road :-)\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:15am",
      "content": "Nick,  \nYou could drive from Toronto and be home for lunch :-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:20am",
      "content": "<cite>There are a few “antiquarian” bookshops.</cite>\n\nPlease keep these secret. This trip is going to cost me enough as it is, I don’t want to end up buying a bunch of old books and shipping them home!\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:30am",
      "content": "_After calling the hotel I believe it will be a matter of availability on arrival._\n\nMark, just be sure to book a room now, while they are still available! TypeCon rooms tend to go fast.\n\nOK folks, my offer still stands -- if anybody wants to share a (non-smoking) room with me, just let me know. I will be at the hotel from July 14-20.\n\n"
    },
    {
      "time": "25 Apr 2008 — 9:39am",
      "content": "\\> You could drive from Toronto and be home for lunch :-)\n\nNot if crossing the border in Buffalo or the Falls is as troublesome as it can be here in Sarnia.\n\nI hope to get there as well. (I was at Toronto, but that was prior to becoming a regular here.)\n\n"
    },
    {
      "time": "25 Apr 2008 — 10:10am",
      "content": "I'll be there. I live in Buffalo, and I look forward to seeing Tamye and everyone again at the meeting on May 6.\n\n"
    },
    {
      "time": "25 Apr 2008 — 10:18am",
      "content": "There may be an obvious answer to this question...  \nTypecon has always interested me, but lack of funds has kept me away in the past. But providing that I can afford it this year, would this be beneficial to someone who isn't a type designer? Granted I am a graphic designer with an interest in type.\n\nI just didn't know if I should continue on going to HOW like I have in the past or make a change.\n\nWould be nice if I could get my company would pay, but I know that won't happen.\n\n"
    },
    {
      "time": "25 Apr 2008 — 10:28am",
      "content": "Katherine, I'm a graphic designer too. TypeCon hits a nice cross-section. We all love type, that's where the cross-section meets.\n\n"
    },
    {
      "time": "25 Apr 2008 — 10:43am",
      "content": "Katherine --\n\nI don't know what would qualify as beneficial for you. But the truth of the matter is that TypeCon is expressly for people who have an interest in type. It's only incidentally useful for type designers per se.\n\nTypeCon got its start as a get-together of typophiles (lowercase 't') who just wanted to hang out and indulge/share their love of all things typographic. It just so happens that Bob Colby (the guy who started it, who isn't even a designer at all) convinced Matthew Carter to come and talk. Chank was at the first couple too. And so was David Berlow.\n\nSo, before you know it typophiles of all stripes -- graphic designers, type designers, letterpress printers, non-design-related aficionados: users _and_ makers -- were all congregating together and having a good ol' time.\n\nThe presentations range from historical to technical, from fanciful to practical, from making to using, and everything in between. There's a lot of overlap with design issues and interests -- like past presentations by Kit Hinrichs (SF) or Paula Scher (NY). (And have you heard: Stefan Sagmeister is speaking this year at the Wednesday pre-conference talk.)\n\nOne of the great benefits of TypeCon (compared to conferences like AIGA or HOW or even ATypI) is that it is pretty small and informal, so there is a lot of mixing and mingling -- very little (if any) of that cliquishness that you can find at larger gatherings.\n\nIt really isn't out of the question, for instance, to end up at a coffee break sitting on a bench next to Matthew Carter, James Montalbano, John Downer, or Akira Kobayashi (or even all four!). Plus, type designers get to interact directly with users and hear what they're liking and not liking, etc.\n\nIt's really beneficial for anyone who is interested in type.\n\nNow, whether or not you can make that case to your boss . . . that's another matter. I suppose it just depends.\n\n-- K.\n\n"
    },
    {
      "time": "25 Apr 2008 — 10:52am",
      "content": "All the graphic designers I talked to at the last two seemed very pleased they went. It's definitely not just for type makers!\n\n"
    },
    {
      "time": "25 Apr 2008 — 12:49pm",
      "content": "Thanks for the information. It sounds great, especially the fact that it's intimate and informal.  \nNow I fear I'd be quite out of my league. We'll see.\n\n"
    },
    {
      "time": "25 Apr 2008 — 1:03pm",
      "content": "<cite>Now I fear I’d be quite out of my league. We’ll see.</cite>\n\nIt’s really not that bad—type geeks are a very mellow/egalitarian crowd. Although the thought of thinking up something worthwhile to say scared the crap out of me every time I got on an elevator with Matthew Carter or Akira Kobayashi at Typecon 2007.\n\n"
    },
    {
      "time": "25 Apr 2008 — 1:18pm",
      "content": "_thought of thinking up something worthwhile to say_\n\njust have your PDA set to  \n [http://www.typophile.com/smalltalk/](http://web.archive.org/web/20130823150306/http:/www.typophile.com/smalltalk/ \"http://www.typophile.com/smalltalk/\")  \nat all times\n\n\"I love what you've done in the field of referencing your machine-driven letterspacing.\"\n\n"
    },
    {
      "time": "25 Apr 2008 — 2:20pm",
      "content": "I ll be there too!\n\n"
    },
    {
      "time": "25 Apr 2008 — 2:23pm",
      "content": "\"Thanks for the loaner copy of <cite>Arrival</cite> Keith. I didn't realize the client's intent was to <cite>cause</cite> traffic accidents when I bid on the job.\"\n\n"
    },
    {
      "time": "25 Apr 2008 — 2:28pm",
      "content": "Katherine,\n\nHave you compared the cost of attending TypeCon with the same costs for HOW? Seems to me HOW is an order of magnitude more pricey. TypeCon is remarkably affordable.\n\n"
    },
    {
      "time": "25 Apr 2008 — 2:57pm",
      "content": "Very much looking forward to seeing the full schedule, and also to the Education forum. The college I teach at is launching a new Writing & Publishing diploma this fall, with 6 typography & publication design courses that I've developed, so I'm eager to hear what others have worked up during curriculum development at various institutions.\n\nAlso just looking forward to workshops and meeting like-minded type people. I moved to a rather small town last April. 'Nuff said.\n\n"
    },
    {
      "time": "25 Apr 2008 — 3:29pm",
      "content": "I was in an elevator with Matthew Carter at one of the TypeCons and found him to be quite easy to talk to. He is not the least bit pretentious nor is Akira. Type people don't tend to be so stuck with there own egos that they can't be human and cordial. Fear not, we don't bite but we may obsess over a well fitted typeface. :-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Apr 2008 — 5:45pm",
      "content": "As far as newbies going to TypeCon - I knew nothing about type (other than liking it a lot) when I went to TypeCon in 2006. I still know little about it compared to the typ-0-graphers who hang out here, but my eye for design has benefited greatly. And it's fun! I've now read all the books about typography at my city library, and I've yet to be bored.\n\nI'm on a tight budget this year (last time, my company payed - and I'm freelance now), so if any other women are interested in sharing a hotel room, let me know. I haven't yet decided if I can go... I hope so!\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "25 Apr 2008 — 6:34pm",
      "content": "OK, friends, the hotel situation is sorted out. I called our contact at the Hyatt, and we have indeed been filling our room block so availability was tight on some days. The Hyatt was gracious enough to give us a few more rooms at the cheap TypeCon rate, and fixed a glitch in the system that didn't allow singles or kings to be specified on some dates. So if you booked a double and want a king, if you go back now and amend your reservation, you'll be able to fix it. We are going to be short on doubles this year, so please do give up your double if you have one and won't need the extra bed.\n\nThat said, book your rooms fast. They are going quicker than in past years, and more people are coming in early and staying late. We will sell out well in advance of our cut-off, and you don't want to miss being in the conference hotel (especially at such a bargain price).\n\nI can wholeheartedly echo the sentiments about the lack of pretension and ego in the type community. After admiring the work of people like Matthew Carter and Erik Spiekermann from afar for years, I was so pleasantly surprised to find out what lovely people they are. We are very lucky to have such a welcoming community, and newcomers should never fear - it's easy to make friends at TypeCon.\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:26pm",
      "content": "Thanks Tamye! I called and they made the change and now it says king online.\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:45pm",
      "content": "<cite>He is not the least bit pretentious nor is Akira.</cite>\n\nThey might not be pretentious, but I sure am and I would hate to look like a doofus!\n\n"
    },
    {
      "time": "25 Apr 2008 — 8:01pm",
      "content": "They both would be happy to talk to you, James.\n\nChrisL\n\n"
    },
    {
      "time": "25 Apr 2008 — 9:57pm",
      "content": "Maybe James should sign up for the typeface critique session, Chris. He could show his [thesis project](http://web.archive.org/web/20130823150306/http:/typophile.com/node/44612).\n\n"
    },
    {
      "time": "26 Apr 2008 — 7:00am",
      "content": "I'll be there for sure! :)\n\n"
    },
    {
      "time": "26 Apr 2008 — 8:15am",
      "content": "Don’t jinx it! The printer—who doesn’t work weekends—just slipped the ship date of my “five-day-turnaround” to Monday.\n\n"
    },
    {
      "time": "26 Apr 2008 — 8:31am",
      "content": "Yes, Ricardo, James should definitely sign up for the critique!\n\nChrisL\n\n"
    },
    {
      "time": "26 Apr 2008 — 9:45am",
      "content": "I'll be there are well.\n\nAnd Frederico you're coming!!!?? Awesome!!\n\n"
    },
    {
      "time": "26 Apr 2008 — 11:57am",
      "content": "Yes Haley, guess we'll meet there! ;)\n\n"
    },
    {
      "time": "26 Apr 2008 — 12:55pm",
      "content": "I'll be there. This will be my sixth.\n\n"
    },
    {
      "time": "26 Apr 2008 — 1:48pm",
      "content": "and this will be my 4th :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Apr 2008 — 5:04pm",
      "content": "Frederico, that is one kick-ass splashpage you have on your [website](http://web.archive.org/web/20130823150306/http:/www.chibachiba.com/)!\n\n"
    }
  ]
}
