{
  "id": "44667",
  "title": "Is that a logo in your pocket...",
  "forum": "Design",
  "tags": [

  ],
  "content": "[http://www.dailymail.co.uk/pages/live/articles/news/news.html?in\\_article...](http://web.archive.org/web/20081121153653/http:/www.dailymail.co.uk/pages/live/articles/news/news.html?in_article_id=561977&in_page_id=1770 \"http://www.dailymail.co.uk/pages/live/articles/news/news.html?in\\_article\\_id=561977&in\\_page\\_id=1770\")\n\n [‹ Browser substitution of old style figs and modern figs with Corbel](http://web.archive.org/web/20081121153653/http:/www.typophile.com/node/44542 \"Go to previous forum topic\") [Firestoneish Font ›](http://web.archive.org/web/20081121153653/http:/www.typophile.com/node/44641 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121153653/http://www.typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 25.Apr.2008 9.36am",
      "content": "At this point I have to believe this was done completely intentionally given all the press it’s gotten. ;o)\n\n"
    },
    {
      "time": " 25.Apr.2008 12.29pm",
      "content": "Years ago, a friend of mine designed a logo for a large regional bank. In the course of designing it, he mocked up a couple as a joke between himself and another designer, and set them aside. The presentation was moved up while he was on vacation (holiday), and a nitwit account executive dug around in his drawer, finding one of the joke designs, and presented it. The client chose it. When you looked at it sideways, it was clearly a masked robber. The design firm was sued after signs were made, stationery printed, etc.\n\n"
    },
    {
      "time": " 25.Apr.2008 2.21pm",
      "content": "I remember someone commenting that the new USA network logo looked like two guys, um, “embracing” a girl in between them. It took me a minute to see what they were talking about. It took me a minute with this one too. I think some people are more prone to noticing the sexual side than others.\n\nIt reminds me of a joke from the movie “What About Bob.” The Bob character played by Bill Murray is telling a joke in the cafeteria of a psychiatric hospital. It was something about a psychiatrist interviewing a patient and giving him a Rorschach ink blot test. For every ink blot the doctor holds up, the guy relates it to something sexual. The doctor finally gives up and tells the patient that he’s obsessed with sex. The patient says “but wait a minute doc, you’re the one with all the dirty pictures.”\n\n"
    },
    {
      "time": " 25.Apr.2008 3.35pm",
      "content": "“Happiness is a warm gun—yes it is”\n\nChrisL\n\n"
    },
    {
      "time": " 25.Apr.2008 4.42pm",
      "content": "_... some people are more prone to noticing the sexual side than others._\n\nNonetheless, bold rounded sans is particularly suggestive.  \nThank goodness the dieresis is at the top of Ï.\n\n"
    },
    {
      "time": " 25.Apr.2008 6.07pm",
      "content": "<cite>I think some people are more prone to noticing the sexual side than others.</cite>\n\nYeah, but it’s worse in Europe. I think it has something to do with late-night German television.\n\n"
    }
  ]
}
