{
  "id": "44661",
  "title": "Podcasting Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m helping a friend out with his new website that focuses on helping users discover new podcasts (audio and video) as well as roll all your subscriptions into one feed address. This is the current logo.\n\n ![](http://web.archive.org/web/20080502161151im_/http:/www.typophile.com/files/cr_5618.png)\n\nI’m trying to take this into a more appropriate direction for a technology and media related company. So far I’ve sketched out some ideas, and put some into illustrator, but I’m not sure if a solution is comming forth. Here is where I am now, typeface and colours are not necessarily what I’ll go with, I just used whatever to show a proof of concept. Ideas, comments?\n\n ![](http://web.archive.org/web/20080502161151im_/http:/www.typophile.com/files/fIRE%20001_3663.jpg)\n  \n\n ![](http://web.archive.org/web/20080502161151im_/http:/www.typophile.com/files/CR2_5305.jpg)\n  \n\n ![](http://web.archive.org/web/20080502161151im_/http:/www.typophile.com/files/cr3_3989.jpg)\n\n [‹ AC/DC - kinda](http://web.archive.org/web/20080502161151/http:/www.typophile.com/node/44416 \"Go to previous forum topic\") [Magazine Logo ›](http://web.archive.org/web/20080502161151/http:/www.typophile.com/node/44825 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080502161151/http://www.typophile.com/user/16279\" title=\"View user profile.\">picard102</a>",
  "time": "<br>",
  "uid": "16279",
  "comments": [
    {
      "time": " 25.Apr.2008 5.55am",
      "content": "Your teal/yellow logo is definitely the strongest, but the letter forms look a little live-trace-esque. especially for a technology company, i think a less hand-lettered look is appropriate. That said, i wouldn’t say you should modify some geometric sans serif either. A little character is nice, but I would like to see it with some of those curves cleaned up. The direction that the mark is going in is nice. A little freedom from ipod/itunes shapes and icons seems like a good idea to me.\n\n"
    },
    {
      "time": " 25.Apr.2008 6.29am",
      "content": "I really like the direction of the current logo.\n\nit’s character has an “on the go” feel, which is great for podcasting ... some of the letter forms could definitely do with a freshen up though.\n\n—————  \n**Paul Ducco**  \n [Design Studio](http://web.archive.org/web/20080502161151/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 25.Apr.2008 10.06am",
      "content": "I would definitely capitalize the “R” so you can distinguish between the two words, otherwise it reads as one slightly confusing word.\n\n"
    },
    {
      "time": " 25.Apr.2008 10.46am",
      "content": "Nice. I like the current approach as well. Different is good. Just some cleaning up of the curves and you got something worthwhile.\n\n"
    },
    {
      "time": " 25.Apr.2008 2.46pm",
      "content": "Really?\n\nThat’s the first I’ve heard from other designers that they think the current logo is appropriate. And I agree with them, it’s far too granola bar for a tech company.\n\n"
    },
    {
      "time": " 25.Apr.2008 5.13pm",
      "content": "The current approach does have a touch of timbuk2 bag logo feel to it, but I think it’s fun and inviting. It embodies a human element that reminds the viewer that podcasts are about connecting with other people and their interests, views and opinions. None of the other treatments give me that sense.\n\nYou seem surprised that so many of us like the current logo. What are some concrete reasons besides “granola bar” that make you think it’s a bad direction?\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 28.Apr.2008 11.18pm",
      "content": "It’s a technology company, dealing with new media. The humanistic approach doesn’t fit. Not only does it bring strong comparisons to every other spiral logo, it smacks of a free font found somewhere with a spiral for an O so it was used.\n\n"
    },
    {
      "time": " 29.Apr.2008 3.52am",
      "content": "I don’t think it was the spiral people were commenting on/connecting with ... more the feeling the existing mark gave.\n\nWhat you explained above is NOT a technology company ... it is - in your words - _“helping users discover new podcasts (audio and video) as well as roll all your subscriptions into one feed address.”_\n\nThat seems more about people, connecting people, and making life simple rather than technology to me.\n\nNew media is not technology, it’s interaction. My thoughts anyway.\n\n—————  \n**Paul Ducco**  \n [Communication Design](http://web.archive.org/web/20080502161151/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 29.Apr.2008 5.37am",
      "content": "I wouldn’t say that a humanistic approach doesn’t work for this. Yes Podcasting is a technology, but it’s still personal for of communication.\n\n"
    },
    {
      "time": " 29.Apr.2008 7.45am",
      "content": "Yes, Paul summed it up nicely. Compared to your treatments, the original logo had a personal feel to it that yours lack. So ditch the spiral, but keep the sense of informality and ease that the original logo has.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 29.Apr.2008 10.13pm",
      "content": "Any suggestions as to what typeface to use then? A brush script?\n\n"
    },
    {
      "time": " 30.Apr.2008 3.27am",
      "content": "custom no good?\n\n—————  \n**Paul Ducco**  \n [Logo Design](http://web.archive.org/web/20080502161151/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": " 30.Apr.2008 3.45am",
      "content": "I’ve never done a face from scratch actually. Something I’ll do one day, but I don’t think I have the time to do it properly for this project.\n\n"
    },
    {
      "time": " 30.Apr.2008 3.36pm",
      "content": "Well, if you’re only doing the word “castroller,” why not try writing it yourself and then scanning it in?\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 30.Apr.2008 5.38pm",
      "content": "You saw my drawing ability above right? lol  \nI’ll give it a try.\n\n"
    }
  ]
}
