{
  "id": "44677",
  "title": "The most powerful script ever made.",
  "forum": "michielterpelle's blog",
  "tags": [

  ],
  "content": "Im pretty new at this site, but I believe the members of this site are very aware of the new fonts that come out. Although I haven’t found a topic about this particulair font. It’s the most powerful script ever made. It has 2 weights, 4280 glyps per font and 27 pro features.\n\nThe font I am talking about is: PF Champion Script Pro!\n\n ![](http://web.archive.org/web/20080706084037im_/http:/www.typophile.com/files/4878_PRO_sample_0_6059.jpg)\n\nand fror your information... I love this font!!!\n\nActually, I love almost every script font that is made. This is just the best that I have ever seen and all the things you can do with it is amazing. Just look at the swashes.\n\n ![](http://web.archive.org/web/20080706084037im_/http:/www.typophile.com/files/4878_PRO_sample_4_3_5176.gif)\n\nI’ve got just one word for it... PERFECTION.\n\n",
  "author": "<a href=\"/web/20080706084037/http://www.typophile.com/user/25755\" title=\"View user profile.\">michielterpelle</a>",
  "time": "<br>",
  "uid": "25755",
  "comments": [
    {
      "time": " 25.Apr.2008 3.27pm",
      "content": "That is nice.\n\nLike you I love script fonts, Feel Script by Alejandro Paul is a favourite of mine.\n\nI’m currently working on my own but it doesn’t even come close to his quality.\n\nThanks for posting this.\n\n"
    },
    {
      "time": " 25.Apr.2008 3.35pm",
      "content": "This one is DICEY!!!!!! I will just direct you to Adobe’s Bickham Script... 1997, Richard Lipton. PF is, at minimum, a day late and a dollar short IMHO. There have been WORDS exchanged over this one.\n\nMichael\n\n"
    },
    {
      "time": " 25.Apr.2008 4.19pm",
      "content": "Right, this essentially repeats what was already done expertly by Lipton with Bickham Script. In fact I would say, this Champion wouldn’t even exist without the example of Bickham Script. Check out the [character set from Bickham Pro.](http://web.archive.org/web/20080706084037/http:/store1.adobe.com/type/browser/pdfs/1736.pdf) The Pro version is a recent re-release with advanced OpenType features to use all these extras.\n\n"
    },
    {
      "time": " 25.Apr.2008 4.52pm",
      "content": "Heads up for an e-mail Carl!\n\n"
    },
    {
      "time": " 25.Apr.2008 9.54pm",
      "content": "Pretty high praise from someone who does not want to pay for it on Fonts101. This is a reasonably serious group here.\n\n"
    },
    {
      "time": " 26.Apr.2008 12.13am",
      "content": "Look at these two:\n\n[http://www.fontbureau.com/fonts/Meno](http://web.archive.org/web/20080706084037/http:/www.fontbureau.com/fonts/Meno \"http://www.fontbureau.com/fonts/Meno\")\n\n[http://www.fontshop.com/fonts/downloads/carter\\_cone/itc\\_galliard\\_cc/](http://web.archive.org/web/20080706084037/http:/www.fontshop.com/fonts/downloads/carter_cone/itc_galliard_cc/ \"http://www.fontshop.com/fonts/downloads/carter\\_cone/itc\\_galliard\\_cc/\")\n\nSimilar source material, different results because each designer put their own touches to the face. This I appreciate.\n\nBut why make something that has the same result as someone else? Why did they bother with Champion? It accomplishes nothing new and feels derivative of Adobes offering.\n\nWelcome to Typophile.\n\nMike Diaz :-)\n\n"
    },
    {
      "time": " 26.Apr.2008 4.18am",
      "content": "@ Weeman: Feel script is one of my favorites to! Just like Burgues Script and Affair. I’m trying to work on a script font also, so maybe you could show me yours sometime?\n\n@ Typerror: Bickham Script Pro is indeed a lot like Champion Script Pro, but I think this one is just a little more perfect. And although I download fonts at fonts101, I never use fonts I haven’t pay for in my commercial work! I’m a student you know...\n\n@ Mike Diaz: Those fonts could be identical twins. That’s right, but I (beïng such a script-o-holic) love the little details that Champion Script has different with Bickham Script.\n\n"
    },
    {
      "time": " 26.Apr.2008 4.45am",
      "content": "Champion Script has Greek and Cyrillic coverage, too. Bickham Script Pro is just Latin, right?\n\n"
    },
    {
      "time": " 26.Apr.2008 8.19am",
      "content": "It’s amazing. Makes me wish I was a wedding invite designer.\n\n"
    },
    {
      "time": " 27.Apr.2008 9.28am",
      "content": "Or a feminine hygiene products/bouquet company’s in-house designer.\n\nWhile swashes do have their place, I am so sick of the overuse of swash fonts. I weep for Adam Twardoch when I see Zapfino with all swashes in place, squished into unreadably tight leading on the back of high-end potato chips at Whole Foods.\n\n—-  \neeblet.com\n\n"
    }
  ]
}
