{
  "id": "44681",
  "title": "Joanna - Where is it used?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Could anyone tell me where Gill's typeface 'Joanna' has been seen before? Publications, advertisements, identities...anything would be helpful! Thanks!\n\n",
  "author": "vwhiffen",
  "time": "25 Apr 2008 — 2:58pm",
  "uid": "30163",
  "comments": [
    {
      "time": "25 Apr 2008 — 3:05pm",
      "content": "If i remember correctly Gill set a book of his in it. And it's used by Obama currently.\n\n"
    },
    {
      "time": "25 Apr 2008 — 3:20pm",
      "content": "I think Obama uses Perpetua, not Joanna.\n\nTravel + Leisure magazine used Joanna as their text face a few years ago (2005 or 2006)\n\nDavid\n\n"
    },
    {
      "time": "25 Apr 2008 — 4:08pm",
      "content": "_If i remember correctly Gill set a book of his in it_.  \n [here's an example](http://web.archive.org/web/20141122183737/http:/www.amazon.com/gp/reader/0879239506/ref=sib_dp_pt#reader-link) (a reprint, but remains faithful in type choice)\n\n"
    },
    {
      "time": "25 Apr 2008 — 4:16pm",
      "content": "In my job I run into it as the official typeface of the Department of Homeland Security. It's on all of their branded materials.\n\n"
    },
    {
      "time": "25 Apr 2008 — 4:26pm",
      "content": "Think of your favorite Eric Gill - Homeland Security ironic comment.\n\n"
    },
    {
      "time": "25 Apr 2008 — 4:35pm",
      "content": "\"Heckuva job, Gillie. Heckuva job.\"\n\nI love Joanna (so fresh and classic at once, so refined, such beautiful details)...it's almost too nice for DHS.\n\nCheers from inside the beltway =)\n\n"
    },
    {
      "time": "25 Apr 2008 — 6:29pm",
      "content": "The Swedish Harry Potter books use Joanna.\n\n ![](http://web.archive.org/web/20141122183737im_/http:/typophile.com/files/Harry_Potter_och_De_Vises_S_3873.png)\n\n"
    },
    {
      "time": "25 Apr 2008 — 7:56pm",
      "content": "The paperback edition of Gill's [_An Essay on Typography_](http://web.archive.org/web/20141122183737/http:/godine.com/isbn.asp?isbn=0879239506), published Stateside by David R. Godine, is set in Joanna. The colophon even mentions that Joanna is one of Gill's least used typefaces.\n\n"
    },
    {
      "time": "25 Apr 2008 — 8:12pm",
      "content": "Joanna has been used a number of times with University Press books -- I designed a book for the University of Illinois Press, set using Linotron 202 Joanna. I forget the title, but can look it up if you really need it.\n\nIn spite of that, Gill's best text font available in major foundry form (i.e., Linotype, Monotype) was probably Pilgrim. I remember a lecture by Ron Costley where he remarked that none of Gill's fonts was a very good for setting book-length text. Afterwards, I asked him about Pilgrim, & as I remember, he did allow it could be quite good for text, just damaged by the poor character fit in the Linotron 202 offering. With PostScript, that could be easily fixed.\n\nFWIW\n\n"
    },
    {
      "time": "25 Apr 2008 — 8:36pm",
      "content": "Here is a corporate use:\n\n[http://www.altria.com/media/](http://web.archive.org/web/20141122183737/http:/www.altria.com/media/ \"http://www.altria.com/media/\")\n\n"
    },
    {
      "time": "26 Apr 2008 — 12:17am",
      "content": "Jcrew.com\n\n"
    },
    {
      "time": "26 Apr 2008 — 12:20am",
      "content": "well I can’t seem to find example online but for sure they do use it for signage.\n\n"
    },
    {
      "time": "27 Apr 2008 — 5:57am",
      "content": "_Martha Stewart Living_ used it for a number of years, up until about 2002 when it was replaced by Archer. They did not use the Joanna italic, however, substituting Perpetua Italic (Felicity) instead.\n\n-- K.\n\n"
    },
    {
      "time": "27 Apr 2008 — 8:45am",
      "content": "_“Heckuva job, Gillie. Heckuva job.”_\n\nHA!\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "27 Apr 2008 — 10:24am",
      "content": "Here we are:\n\n ![](http://web.archive.org/web/20141122183737im_/http:/typophile.com/files/jcrw_5512.gif)\n\nMikey :-)\n\n"
    },
    {
      "time": "27 Apr 2008 — 11:45am",
      "content": "Get those people an \"fi\" ligature!\n\n"
    },
    {
      "time": "28 Apr 2008 — 1:36am",
      "content": "http://www.realcrisps.com/REAL-(Potato-Chips)/REAL-Words.html\n\n"
    },
    {
      "time": "28 Apr 2008 — 6:22am",
      "content": "thank you!!\n\n"
    },
    {
      "time": "28 Apr 2008 — 7:34am",
      "content": "\"Think of your favorite Eric Gill - Homeland Security ironic comment.\"\n\nIt is \"Bring Your Daughter to Work Week\" in the office of Homeland Security.\n\nChrisL\n\n"
    },
    {
      "time": "28 Apr 2008 — 7:56am",
      "content": "more examples from typophile: [http://www.google.com/search?q=site:typophile.com%20joanna](http://web.archive.org/web/20141122183737/http:/www.google.com/search?q=site:typophile.com%20joanna \"http://www.google.com/search?q=site:typophile.com%20joanna\")\n\nI used it for the running text in a book called The Downtown Book but not on the cover (that was AG)\n\n[http://www.amazon.com/Downtown-Book-York-Scene-1974-1984/dp/0691122865/r...](http://web.archive.org/web/20141122183737/http:/www.amazon.com/Downtown-Book-York-Scene-1974-1984/dp/0691122865/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1209394554&sr=1-1 \"http://www.amazon.com/Downtown-Book-York-Scene-1974-1984/dp/0691122865/ref=pd\\_bbs\\_sr\\_1?ie=UTF8&s=books&qid=1209394554&sr=1-1\")\n\n"
    },
    {
      "time": "28 Apr 2008 — 10:49am",
      "content": "I've used it for a redesign of an academic journal called _Victorian Review_. Both the client and their readers have been pleased with the font, which both enacts the restrained pomp of the Victorian period and yet allows for a comfortable read.\n\n ![](http://web.archive.org/web/20141122183737im_/http:/typophile.com/files/Joanna1_3489.jpg)\n\n ![](http://web.archive.org/web/20141122183737im_/http:/typophile.com/files/Joanna2_6319.jpg)\n\n"
    },
    {
      "time": "28 Apr 2008 — 11:24am",
      "content": "Thanks Jason for showing – i really like what you did, especially how you elaborated the regular | italic contrast! Suspenseful.\n\n"
    },
    {
      "time": "28 Apr 2008 — 1:33pm",
      "content": "They set the commencement program at Emerson College in Joanna the year I graduated. It was a neat coincidence, since I have a sort of esoteric connection to it by name (it was designed by Eric Gill and René Hague).\n\n"
    },
    {
      "time": "28 Apr 2008 — 4:05pm",
      "content": "I believe Fortress Press set several books in Joanna in the late 80's, early 90's. A <cite>Festschrift</cite> for Hans Frei stands out in my recollection; the italics in the footnotes were awfully tight.\n\n"
    },
    {
      "time": "29 Apr 2008 — 3:32pm",
      "content": "The new(ish) Routledge Classic edition of CG Jung's <cite>Four Archetypes: Mother, Rebirth, Spirit, Trickster</cite> uses it, but it's not set as nicely as Jason's example above.\n\n"
    },
    {
      "time": "29 Apr 2008 — 7:58pm",
      "content": "Would it be fair to say Whitman is Joanna without what some consider the mismatched italics?\n\n ![](http://web.archive.org/web/20141122183737im_/http:/typophile.com/files/JoannaWhitman_4129.png)\n\n"
    },
    {
      "time": "29 Apr 2008 — 9:05pm",
      "content": "Kent has written that he drew inspiration for Whitman from both Caledonia and Joanna.\n\n"
    },
    {
      "time": "30 Apr 2008 — 6:53am",
      "content": "Kent's improvements on Joanna are very subtle; I admire his work here very much, especially the larger counter for the lower case a, which sets a tone of clarity and balance throughout all Whitman usage. For me, the Joanna italics, which seem to belong to another family, serve as an unwelcome speed-bump for the reader, though others love them for precisely that effect...also Joanna's figures seem crude, whereas Whitman's figures look right to the point of transparency.\n\nAll in all, the appearance of Whitman allowed me to get the Joanna roman look without the Joanna problems. Whitman seems so right it achieves transparency.\n\n"
    },
    {
      "time": "30 Apr 2008 — 10:35am",
      "content": "Further (okay, much further) afield I would also put the Martin Majoor’s work (Seria, Scala, Nexus) as inspired from Eric Gill’s work.\n\nI see a little Joanna in Odile too.\n\nMikey :-)\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:45pm",
      "content": "@mondoB  \nNonsense :) Look at the example Jongseong posted – \"Tromdomskonstens …\". The italics might be unusual, but come up beautifully and in an effective contrast to the text set in regular.\n\nBTW. I love the richness of existing typefaces, i'm looking forward to new typefaces to come. I don't look for an \"ideal typeface fits all\"-thing!\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:54pm",
      "content": "_Look at the example Jongseong posted – “Tromdomskonstens …”. The italics might be unusual, but come up beautifully and in an effective contrast to the text set in regular._  \nThough, to be fair, it's a bit of a loaded-dice example since those italicized words happen to be much longer than the roman words on the page.\n\n"
    },
    {
      "time": "1 May 2008 — 6:48am",
      "content": "From the sublimity of \"Victorian Review,\" I take you to what many consider the height of ridiculousity: ice fishing. Book designer Brian Donahue has submitted sample pages for a photo book on that subject, and he's used Joanna as his text face:\n\n ![](http://web.archive.org/web/20141122183737im_/http:/typophile.com/files/Joannaicefishing_6688.jpg)\n\nI was not thrilled when I read his note before opening the file, for Joanna has never been a favorite of mine. I like the \"idea\" of Joanna, but have rarely seen it used well. But this book may help me appreciate the face. It is well suited to the matter. Its overall sharpness evokes that first great lungfull of cold winter air. Its \"f\" looks like something one could catch an eelpout on. I'm really happy with the choice.\n\nMy dislike of Joanna goes back to metal days. Few USA Monotype houses had mats for Joanna, so if one wanted Joanna, choice was limited. Los Angeles Typefounders set a lot of horrendous Joanna for me once. It appeared that sorts had been cast on wrong set widths, and the line composition had to be re-worked by hand.\n\n& the first versions I saw for photo and digital also had major problems. So I just put it out of mind. \"Victorian Review\" and this ice fishing book suggest I should re-look at the face.\n\nAt times in the past when I wanted the \"feel\" of Joanna I used Chaparral. Whitman is, of course, a much better face for text setting.\n\npowers\n\n"
    }
  ]
}
