{
  "id": "44693",
  "title": "THE Observer's Book of Mad Roman Emperors",
  "forum": "James Arboghast's blog",
  "tags": [

  ],
  "content": "It’s THE book, according to the title.  \nTHE book of mad roman emperors.\n\n ![](http://web.archive.org/web/20081012144852im_/http:/www.typophile.com/files/mademperors_5520.gif)\n\nAs you can see this is a barking mad font I’m working on. Bar-bark, woof.\n\nj a m e s\n\n",
  "author": "<a href=\"/web/20081012144852/http://www.typophile.com/user/9349\" title=\"View user profile.\">James Arboghast</a>",
  "time": "<br>",
  "uid": "9349",
  "comments": [
    {
      "time": " 26.Apr.2008 1.35pm",
      "content": "¡ hail !\n\n"
    },
    {
      "time": " 26.Apr.2008 1.43pm",
      "content": "Now that looks like fun!\n\nChrisL\n\n"
    },
    {
      "time": " 27.Apr.2008 3.49am",
      "content": "Cheers guys. This font is plenty heap ’o fun. It’s a Roman inscriptional kind of thing, but not inscribed as such. A synthetic technical pen tool is the basis for the stroke design and finish.\n\nIt has Ar’deco-influenced Trajanesque capitals with several twists, quite a few phantom letters, a wacky lower case, and a contextual alternates feature that swaps in a more text-friendly (read: more readable) character set.\n\nWhat else? Oh, a proper Lining Numbers feature: turn on the lining numeral set and all the math and currency symbols are positioned to suit. Luxury! What else? A supporting cast of 590 extras—-stacks of stylistic alternates and a staggering array of ligatures. Some of the ligature pairs are fitted like the THE word lig.\n\nI’ve completed testing all the OT features, and now I’m finishing kerning.\n\nj a m e s\n\n"
    },
    {
      "time": " 27.Apr.2008 6.29am",
      "content": "Sounds like a winner! and different than the average bear.\n\nChrisL\n\n"
    },
    {
      "time": " 27.Apr.2008 8.34am",
      "content": "It’s a bit of a scary bear, old Pykie needs lots of tender loving kerning. Creating kerning pairs in the font for all possible combinations—-even half of them—-creates a class-based proliferation reaching into tens of thousands pairs. Users will have to manually kern in some situations.\n\nPyke’s Peak requires its users to be lettering artists. You could say it’s a demanding font.\n\nWhat the capitals get up to:\n\n ![](http://web.archive.org/web/20081012144852im_/http:/www.typophile.com/files/mad_emperors_6425.gif)\n\nMirror-pair ligs:\n\n ![](http://web.archive.org/web/20081012144852im_/http:/www.typophile.com/files/bring_babbage_3902.gif)\n\n ![](http://web.archive.org/web/20081012144852im_/http:/www.typophile.com/files/with_mirrors_4867.gif)\n\nMore craziness:\n\n ![](http://web.archive.org/web/20081012144852im_/http:/www.typophile.com/files/barsackwards_4269.gif)\n\nDigital letraset:\n\n ![](http://web.archive.org/web/20081012144852im_/http:/www.typophile.com/files/chest_wig_4777.gif)\n\nj a m e s\n\n"
    },
    {
      "time": " 27.Apr.2008 8.37am",
      "content": "WOW - I love those mirror ligs. Wow wow wow. (Hmmm, I wonder how many designers will invent a project as an excuse to use this face....)\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 27.Apr.2008 3.08pm",
      "content": "After looking at the pixtures in your Flickr photostream I can see why you appreciate the mirror ligs Beth. You’re just the kind of designer I’m looking for to be a Pyke’s Peak owner.\n\nHere’s a quiz. I’m looking for candid and original answers. You’ve already won a copy of the font, but do the quiz anyway :^)\n\n**Pyke’s Peak Quiz**  \n1) Pyke’s Peak is named after which well-known mountain in the Colorado Rockies?\n\n2) Pyke’s Peak sports a bristling array of glyph types & letter structures. Forms include phantoms, dot phantoms, mirror glyphs, fitted pairs and superposed ligatures (ligs formed by letters eating into & growing out of each other.) The question is, w h y ?  \na) To keep designers off the streets  \nb) To create an enigmatic type effect reminiscent of hand-lettering  \nc) To give credence to the word “Arboghastian”  \nd) To create a big scary opentype monster\n\n3) Looking at these Pykie type samples makes you feel—-  \na) Excited  \nb) Strange  \nc) Sharp & furry  \nc) By degrees terrified\n\n4) There is an annual race up Pike’s Peak mountain in a special breed of supercharged cars known as Pike’s Peak racers. What’s the all-time record for getting to the top?\n\n5) James Pike was the Episcopal bishop of which Diocese?\n\n6) Bishop James Pike officiated at the wedding of Nancy Hackett to which highly-regarded American science fiction writer? Clue—-he lived in Oakland, California. No really.\n\n7) Backwards-facing capital letters are—-  \na) Capitals that fell into a time mirror in ancient Roma and came out on our side reversed  \nb) A neat-if-vexing method of solving certain kinds of ligatures, eg: Em, EE, ER, RB etc.  \nc) Fascinating but I’m glad I’m not having lunch with them  \nd) Too disturbing even for pretend consideration\n\n8) Which one-liner best describes Pyke’s Peak?  \na) Cryptomagmous barking-mad bannana fritters  \nb) The work of several seditious scribes from Ceaserea  \nc) Trippy rub-down Arcadian magic  \nd) The System of Professor Tar & Doctor Feather\n\n9) Name three kinds of material you would use Pyke’s Peak on.\n\n10) True of false? A copy of Pyke’s Peak will be gifted to Typophiles who submit the most candid and original answers.\n\nj a m e s\n\n"
    },
    {
      "time": " 28.Apr.2008 3.00pm",
      "content": "You’ve picqued my interested with this quiz... it’s taking me a while to answer it because I’m peaked. I took a peek at a certain wikipedia page, though.\n\nI’d write the name of the mountain, but I’m concerned about the suicidal nature of the third letter in the name.\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 28.Apr.2008 10.13pm",
      "content": "Hee! I like me the Budwig. Don’t pay no mind of pointy diagonals. Take as much time as you need with the quiz. Meanwhile, here’s a vizzy to de-pique your frazziness. I give you, smoking kid—-\n\n ![](http://web.archive.org/web/20081012144852im_/http:/www.typophile.com/files/smkid_5209.jpg)\n\nj a m e s\n\n"
    },
    {
      "time": " 28.Apr.2008 11.31pm",
      "content": "Wow, that was a j - before the scroll-down. I thought maybe he had smeared Twinkies all over himself.\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 29.Apr.2008 12.01am",
      "content": "What a wonderful piece of art! How skillful!\n\n((sometimes I have hard times reading the lowercase w (and slightly also the uppercase version) because of its disjoint left stroke; similar to the EE ligature, if the left side had just a dot instead of the stroke, like all other mirrored E’s I’ve seen, it might be easier. But you have finished your glyphs and are only working on kerning, so I’ll shut up.))\n\n"
    },
    {
      "time": " 29.Apr.2008 1.58am",
      "content": "It l o o k s like a j doesn’t it? Makes you wonder.\n\nHey Brian. Yes w-W are a legiblity challenge but users can replace all instances of w, e and g with non-gapped alternates all at once by turning on the CALT feature. The CALT character set includes a normal **s** too.\n\nThat dot phantom EM lig is a second variety. Default E, including all ligs and mirror ligs, has the stroke. And for people who are getting really bored there’s the cursive E, which I made out of the B. I tried to think of everything.\n\nKeep coming with the feedback. The glyphs are finalized but it’s still good to get opinions.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Apr.2008 3.01pm",
      "content": "1) Pyke’s Peak is named after which well-known mountain in the Colorado Rockies?\n\nThe one with the volcano on South Park.\n\n2) Pyke’s Peak sports a bristling array of glyph types & letter structures. Forms include phantoms, dot phantoms, mirror glyphs, fitted pairs and superposed ligatures (ligs formed by letters eating into & growing out of each other.) The question is, w h y ?  \na) To keep designers off the streets  \nb) To create an enigmatic type effect reminiscent of hand-lettering  \nc) To give credence to the word “Arboghastian”  \nd) To create a big scary opentype monster\n\nc - obviously\n\n3) Looking at these Pykie type samples makes you feel—-  \na) Excited  \nb) Strange  \nc) Sharp & furry  \nc) By degrees terrified\n\nc\n\n4) There is an annual race up Pike’s Peak mountain in a special breed of supercharged cars known as Pike’s Peak racers. What’s the all-time record for getting to the top?\n\nWithout Googling: 12 minutes, 21 seconds.\n\n5) James Pike was the Episcopal bishop of which Diocese?\n\nThe little-known Ultramormons (top secret)\n\n6) Bishop James Pike officiated at the wedding of Nancy Hackett to which highly-regarded American science fiction writer? Clue—-he lived in Oakland, California. No really.\n\nL. Ron Hubbard?\n\n7) Backwards-facing capital letters are—-  \na) Capitals that fell into a time mirror in ancient Roma and came out on our side reversed  \nb) A neat-if-vexing method of solving certain kinds of ligatures, eg: Em, EE, ER, RB etc.  \nc) Fascinating but I’m glad I’m not having lunch with them  \nd) Too disturbing even for pretend consideration\n\nc\n\n8) Which one-liner best describes Pyke’s Peak?  \na) Cryptomagmous barking-mad bannana fritters  \nb) The work of several seditious scribes from Ceaserea  \nc) Trippy rub-down Arcadian magic  \nd) The System of Professor Tar & Doctor Feather\n\nd\n\n9) Name three kinds of material you would use Pyke’s Peak on.\n\nA spider’s carapace  \nCigarettes  \nPaper stolen from a photocopier\n\n10) True of false? A copy of Pyke’s Peak will be gifted to Typophiles who submit the most candid and original answers.\n\nSomewhat true.\n\n"
    },
    {
      "time": " 7.May.2008 6.33am",
      "content": "Ray’s score.\n\n1) Pyke’s Peak is named after the mountain with the volcano on South Park is good answer.\n\n2) To give credence to the word “Arboghastian” is the answer I was hoping for.\n\n3) Looking at these Pykie type samples makes you feel Sharp & Furry is the answer I was hoping for.\n\n4) “Without Googling: 12 minutes, 21 seconds.” is a good guess and close to the ’correct’ answer. According to Wikipedia the all-time record is 10:01.408, set by Nobuhiro Tajima “in a Suzuki XL7 Hill Climb Special while racing the Unlimited category. He beat the previous record set by Rod Millen set 13 years before in 1994 of 10:04.06. “\n\n5) James Pike was the Episcopal bishop of California.\n\n6) Bishop James Pike officiated at the wedding of Nancy Hackett to Philip K. Dick. But the image of L. Ron Hubbard as a highly-respected sci-fi writer is suitably comical.\n\n7) Backwards-facing capital letters are “Fascinating but I’m glad I’m not having lunch with them” is a good answer. I was plumping for the time scoop theory.\n\n8) The System of Professor Tar & Doctor Feather is a good answer, but I prefer to think of it as Trippy rub-down Arcadian magic.\n\n9) Three kinds of material you would use Pyke’s Peak on.\n\nA spider’s carapace  \nCigarettes  \nPaper stolen from a photocopier\n\nAll good answers man.\n\n10) True of false? A copy of Pyke’s Peak will be gifted to Typophiles who submit the most candid and original answers. “Somewhat true.”\n\nAw heck, it was a trick question, and a dumb one at that.\n\nj a m e s\n\n"
    }
  ]
}
