{
  "id": "4470",
  "title": "InDesign ME - your experiences",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello - I'm new to this forum having discovered it while searching for information on InDesign ME.   \n   \nI do a large amount of non-English setting work including a fair amount oof Arabic and Hebrew. Until now I have used Quark and the Phonyx XTension, as well as a similar self-built system for Hebrew, using mirrored fonts and a lot of faffing around dealing with reveresed character sequences for Left-Right reading text.   \n   \nInDesign has gradually been building up on my worklist and I've been half dreading the first Hebrew job and half looking forward to it. I've considered using similar mirrored fonts and mirrored text boxes for a forthcoming job, but I have a little lead time and would really like to start doing it properly, so I'm considering purchasing InDesign ME.   \n   \nI'd like to know what other users have experienced with this program, especially with regards to its directional behaviour and what methods of input can be used (both typing and pulling in external files).   \n   \nAre there any gotchas which I may not have considered?   \nAll opinions gratefully received.\n\n",
  "author": "tim_osmond",
  "time": "26 Apr 2004 — 1:48pm",
  "uid": "3571",
  "comments": [
    {
      "time": "26 Apr 2004 — 4:52pm",
      "content": "I have been using InDesign ME for a little more than a year, and enthusiastically recommend it. The bidirectional text controls are very good, and -- on Windows at least -- a variety of input methods are well supported including system keyboards, import from Office docs and other text formats, and copy-paste (the latter may not always work, but seems more reliable for non-Western text than regular InDesign. The WinSoft developers have also gone to great lengths to ensure that a wide varuety of legacy 8-bit encodings for Arabic are supported, as well as the preferred Unicode encoding.   \n   \nOpenType GPOS mark positioning is supported -- in addition to a couple of other, cruder methods --, and you can also manually adjust the position of marks. The program has the best control I've seen for Arabic and Hebrew vowel marking.   \n   \nMy only real complaint is that the current releases do not support contextual mark positioning, which means that I can't use it for Biblical Hebrew without a lot of manual positioning adjustment.\n\n"
    },
    {
      "time": "26 Apr 2004 — 5:02pm",
      "content": "\\>=20 \\>=20 \\>=20 \\> Thanks for that, John =AD it does look like it does what=B9s needed and in th= e \\> proper way. \\>=20 \\> Of course, I forgot entirely to mention that I=B9m operating on Mac OS X =AD = but \\> the coding support looks good to me. \\>=20 \\> Out of interest, what happens when a standard copy of InDesign is used to= open \\> an ME files with bi-directional content? \\>=20 \\> ... And is it right that the current version number stands at 2, rather t= han \\> CS? =20 \\>=20 \\>=20 \\>=20\n\n"
    },
    {
      "time": "26 Apr 2004 — 7:24pm",
      "content": "If you open an ID ME file with bidi text in regular InDesign, you get a warning message that the file contains material associated with the ME text layout plugin. If I remember correctly, you have the option to remove the association and open the file anyway, in which case I presume the text order is messed up.   \n   \nYes, I think ID ME is still at version 2.0. The CS version was being beta tested very recently -- I was unable to take part because I didn't have time -- so it is presumably fairly close to release.\n\n"
    },
    {
      "time": "17 Mar 2006 — 5:21am",
      "content": "Does anyone know if the problem with the \"contextual mark positioning\" for Biblical Hebrew has been solved or if there are any other solutions?\n\n"
    },
    {
      "time": "17 Mar 2006 — 8:00am",
      "content": "InDesign CS2 ME:\n\n[http://www.fontworld.com/me/indesignme.html](http://web.archive.org/web/20131019091449/http:/www.fontworld.com/me/indesignme.html \"http://www.fontworld.com/me/indesignme.html\")\n\n"
    }
  ]
}
