{
  "id": "44702",
  "title": "Design for yourself...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all.\n\nBeen away a while. I have the hardest time designing for myself. Does anyone else have that problem? I'll like it, for like 2 seconds, and it's gone. The creative juices flow when I'm working on project for other people, just not myself, to show my work (ie a portfolio site showcasing my work).\n\nWhat's your secrets? Fellow designers...\n\n",
  "author": "Eric_West",
  "time": "26 Apr 2008 — 6:12pm",
  "uid": "6194",
  "comments": [
    {
      "time": "26 Apr 2008 — 6:20pm",
      "content": "I'm working on a photography portfolio for myself, Eric. (Not a site but a bound portfolio.) To make it harder, I've added typographic elements on an 11x17 inch page. I think I'll end up liking it, but it is hard. I want to be creative but I'm worried about looking hokey.\n\nI'll be interested in seeing what others say on this topic.\n\nSharon\n\n"
    },
    {
      "time": "26 Apr 2008 — 9:52pm",
      "content": "My design is much better when I work for—and with—others. That’s something that’s always hurt me in school; I probably should not have enrolled at a fine art school where so much revolves around individual “genius” and the students have little interest in working together. It doesn’t help that I have little interest in editorial matters or self expression; if I wanted to collect piles of text and image to arrange I’d be in journalism, if I wanted my feelings on a canvas I’d paint. I’m looking forward to getting back into a studio where I can brainstorm with people who aren’t convinced that their minds are the fount from which will spring human reality.\n\nInterestingly, though, I have no trouble doing type or lettering for myself. I can sit around drawing letters all day and not even notice the time slipping by, and I have plenty of ideas to keep me busy when I’m job hunting in the next few months.\n\n"
    },
    {
      "time": "26 Apr 2008 — 10:10pm",
      "content": "This topic has been on my mind a lot lately. I've been trying to come up with a new identity for my company for the last two or three months now. I'll get a new logo I like, design business cards, website, etc., and then a week later I'm not happy with it. I think I've probably come up with 3 or 4 new looks for myself, but nothing sticks. I'm working on a new one now and I think I'm just going to draw the line here and go ahead with it. It sure is frustrating though...\n\n"
    },
    {
      "time": "27 Apr 2008 — 4:23am",
      "content": "Firstly, excuse for my poor English but here is what I have to say.\n\nI think it's easy to analyze and give solutions for someone else's project than ones' own to design. Usually you are your own worst critic or client. When a client may reject your idea or have a different point of view, you usually can back up with good reason from principles and reasons that is the basis of your idea. It's hard to do it for yourself because the dialog is less back and forth, it's more jumbled in your head as both personalities in your mind come from the same person.\n\nI have had many problems trying to do my own site and it is embarrassing to tell people. My site hasn't been updated for the last 7 years, and it's beginning to hurt now in my freelance. I have been lucky that I get referrals so delaying my own promotions was too easy to push aside.\n\nWith the recent lack of clients in the last few months it's been a very good lesson for me. It's very humbling to look back and know how lucky I have been and appreciate security when I had it.\n\nSo finally, I have pushed myself to \"define\" myself through a website, a new business card because I just moved and all this worry and small pain has been humbling...\n\nMaybe all this delay is that I am don't have the personality to promote myself. I always believed that my work says more than what I have to say for myself to new clients and friends. However when you don't have work coming through you realize it is not about being brave to let the work speak for itself... it's more about getting people's attention that you are around in their minds.\n\n1. List the reasons why you are doing what you \"need\" to do for yourself in order to get your work out there..  \n2. Stick to that agenda and give yourself a deadline.  \n3. Promise yourself a reward if you do complete it on time.\n\nWe are all perfectionists but how perfect can we be when it never gets done?\n\n"
    },
    {
      "time": "27 Apr 2008 — 8:40am",
      "content": "I think you are not alone, Eric. Most of my design school buddies, and even some designers I worked for after I graduated, either had the same problem or made knowing jokes about it. For example, there is an old Spanish saying, \"En casa de herrero, cuchillo de palo.\" An English equivalent would be, \"The mechanic's car never runs.\" (The Spanish phrase translates as \"In the blacksmith's home, the knives are made of wood.\")\n\nIt took me forever to come up with my own letterhead and business cards, after many false starts. And like other designers, I was never happy with the solutions I came up with for myself!\n\nThere's a lot of truth in everything kidcranium says... Approach the problem as if it were for a third party -- list the clients' objectives, try to put down in writing what \"their\" design philosophy is, etc. Giving myself a deadline has worked for me as well. Also, I show my comps to fellow designers, to try to get some objective criticism. You will always have blind spots when you design for yourself... It's good to have another designer look at things with a cold eye.\n\n"
    },
    {
      "time": "27 Apr 2008 — 10:24am",
      "content": "I don't like designing for myself, and I'm rarely happy with the result for more than two weeks, if even that long.\n\nThe Finnish proverb related to those mentioned by Ricardo is \"Suutarin lapsilla ei ole kenkiä.\" That is Cobbler's (Shoemaker's) children don't have shoes. I've heard it so many times by various designers, they just say \"shoemaker's children...\" and shrug their shoulders and roll their eyes.\n\nI try to have a fairly strict colour and font system and do something that feels right and maybe looks like me. I ask my family's opinion and if possible, some other designers' thoughts. Christmas cards are usually done in last minute, so there's no time to dwell on them too long.\n\n"
    },
    {
      "time": "27 Apr 2008 — 3:14pm",
      "content": "_I’ve heard it so many times by various designers, they just say “shoemaker’s children...” and shrug their shoulders and roll their eyes._\n\nThat's so funny, Mili! In Spanish people do the same -- they just say, \"In the blacksmith's home...\" and everyone knows what they mean. :-)\n\n"
    },
    {
      "time": "27 Apr 2008 — 4:08pm",
      "content": "I have to inflate the importance of some imagined deadline then also tell myself it is only temporary (which is always true anyway). Then I try not to fixate on some perception of audience and try and please myself. But then my issue is that most of my work is horribly compromised in some fatal way so that I'm not so into it either.\n\n"
    },
    {
      "time": "27 Apr 2008 — 5:38pm",
      "content": "Try to make it real. Write a design brief for starters. Try to approach it like another job. It is very hard indeed but if you just start messing around you won't get there. The brief will inform you, just like any other job.\n\npbc\n\n"
    },
    {
      "time": "28 Apr 2008 — 6:56am",
      "content": "\"What’s your secrets?\"\n\nAim for 'sufficiently adequate'. Otherwise, it becomes impossible. Graphic Design depends on constraints, and it's really hard, when you are the client, to enforce any constraints.\n\nThere's a reason a lot of big design firms have their logo as a name set in a typeface. ;0)\n\n"
    },
    {
      "time": "28 Apr 2008 — 7:27am",
      "content": "I am also a member of the shoemaker/blacksmith/automechanic club. I tend to make it like the Sistine Chapel and never finish (not Finnish, Mili :-)\n\nI think we have such expectations for ourselves that we can never meet. (Even Paul Rand had just a simple type business card and no logo.) We want to make the holy grail of design and are frustrated that we just end up with a coffee cup. I have had my web site in a constant state of construction for years and loathe the thought of working on it.\n\nI don't have any good advice since I have failed at completing self-promotion for years. I feel your pain though. I can only say \"just do it\" but can't even take my own advice.\n\nChrisL\n\n"
    },
    {
      "time": "28 Apr 2008 — 2:20pm",
      "content": "<cite>We want to make the holy grail of design and are frustrated that we just end up with a coffee cup. </cite>\n\n ![](http://web.archive.org/web/20150414223641im_/http:/typophile.com/files/thcups_3582.jpg)\n\nhow true.  \n-=®=-\n\n"
    },
    {
      "time": "28 Apr 2008 — 3:29pm",
      "content": "I see Russ has been there a few times :-)\n\nChrisL\n\n"
    },
    {
      "time": "28 Apr 2008 — 7:18pm",
      "content": "<cite>I see Russ has been there a few times :-)</cite> ... & I've had the caffeine hangovers to prove it.\n\nWell, this thread makes me realize I'm in good company when it comes to falling down on the self-promo front.\n\nI've found it oddly encouraging and have actually started editing some code on my site once again. (delete, delete, delete...) (less is more)\n\n-=®=-\n\n"
    },
    {
      "time": "28 Apr 2008 — 7:28pm",
      "content": "I am very surprised that I am not the only one in the same boat. I think designers rarely admit to this so it's opened my eyes. Also I have been more motivated of late to do my own promotions, but it's not any easier.\n\n"
    },
    {
      "time": "29 Apr 2008 — 3:00am",
      "content": "I love designing for myself, I consider it more self expressive art as apposed to design having a purpose.\n\n"
    },
    {
      "time": "29 Apr 2008 — 3:33am",
      "content": "Self satisfaction is the hardest thing to achieve, due to us all imagining ourselves better than we actually are, and so perfection can never be achieved, as someone will always do the same project better than the next person, whether it be the idea or the practical side of the project. However, since we're in an industry which is all about opinions, and nothing really is 'right', this isn't always a worry.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nRez\n\n"
    },
    {
      "time": "29 Apr 2008 — 7:32am",
      "content": "I've found you have to work twice as hard if not more, and twice the timeframe. It helps to step away from your work and give yourself distance and time for reflection, more so than with typical client work. It does help to give yourself the same style of brief a client would give yourself and treat the process similarly. Clear objectives, a list of key attributes to define, an outline and some level of constraints are important to consider as well. (Although it's easy to abandon any structure when it's your own work/project)\n\n"
    },
    {
      "time": "29 Apr 2008 — 7:32am",
      "content": "I've found you have to work twice as hard if not more, with twice the timeframe. It helps to step away from your work and give yourself distance and time for reflection, more so than with typical client work. It does help to give yourself the same style of brief a client would give yourself and treat the process similarly. Clear objectives, a list of key attributes to define, an outline and some level of constraints are important to consider as well. (Although it's easy to abandon any structure when it's your own work/project)\n\n"
    },
    {
      "time": "29 Apr 2008 — 1:58pm",
      "content": "Another secret is to do duplicate posts when replying to threads.\n\n"
    },
    {
      "time": "29 Apr 2008 — 2:29pm",
      "content": "Yes, Mike, I thought there was an echo in here :-)\n\nChrisL\n\n"
    },
    {
      "time": "29 Apr 2008 — 3:15pm",
      "content": "Design is always easier when you know who you're talking to. So imagine a scenario whereby Prospective Client A says to Delegating Authority B, \"I think I've found a designer.\" Delegating Authority B is going to say, \"Oh really? Who?\" Design all of your own materials to impress Delegating Authority B.  \nOr, said another way, every prospective client has somebody they want/need to impress; when you are designing your own identity that somebody is your real target audience.  \nAnd knowing that you are addressing a fictitious, harried, socially higher-ranking third party who is responsible for the decisions and actions of subordinates and who's daily function is to stand as a symbol of their own skills in coordinating the work of others should make things a whole lot easier.\n\n"
    },
    {
      "time": "29 Apr 2008 — 4:16pm",
      "content": "I like designing for myself but I agree that it's a challenge. Being your own client means that you have no one to blame if the result is not as good as you want it to be. A few times I have designed the logo and the corporate identity for the design studio where I have been employed. It's a good opportunity to push yourself forward and to show your clients how great a designer you are, but at the same time it's a place you really don't want to do something mediocre. For a graphic designer the business card has a quite unique marketing value. A space where you can and should show what you can do. That is probably why so many designers think it's difficult and a bit scary.  \nHere is the logo and the business card I did for Melkeveien where i work today.\n\n ![](http://web.archive.org/web/20150414223641im_/http:/typophile.com/files/selfpromotion_melkeveien_5003.jpg)\n\n"
    },
    {
      "time": "29 Apr 2008 — 5:12pm",
      "content": "I am redesigning my business cards now. I had an idea where I will show a bit of my work on each card, a total of 5 or 6. The reason is that I have had some nice clients (well known) and some less known but I was able to be more creative. I am weighing up whether to do a unique card with graphics, or show my past work. The reason is that I illustrate as well as design, so I have some collage work, vector cartoons, and fashion illustrations. I also caption each side with small sized type to say who the client is and which country the project is from...\n\nWhat is your view on this?\n\n"
    },
    {
      "time": "29 Apr 2008 — 5:20pm",
      "content": "I had a client that grew up under me and really dominated my time. That went on for many years (like eight!) and nothing I did for them really was interesting—blah, blah, blah. When it came time to do cards and web and all the pieces associated I did some illustration just to inject a bit of myself and add some flavor to the whole thing. It was my attempt to say, yes I've helped these clients achieve what they wanted, but I am capable to doing something more interesting as well.\n\nI've always avoided having a signature look or style because I thought it would be in and then go away. I also see so much same. Now I really question that. Who knows? Looks like I'm about to move so I'll have a chance to rethink everything again.\n\n"
    },
    {
      "time": "29 Apr 2008 — 5:24pm",
      "content": "When designing for oneself. . .\n\n\"Things should be made as simple as possible, but not any simpler\"  \nAlbert Einstein 1879 - 1955\n\nIf only it was that simple!\n\n"
    },
    {
      "time": "29 Apr 2008 — 10:34pm",
      "content": "Ya, I think everyone has this problem. I recently did myself a new logo and website and a week latter I was ready to change it. Never mind that I'm still in the process of adding my work into the new site.  \nIt's hard to be objective even when I set my own brief. Add to that my usual neurotic perspective while working on client work and it's a bit silly. So I just do myself \"good enough\" and call it a day.\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:15am",
      "content": "I agree. There has to be a cut off point when working with projects for yourself. Where you have to say 'it'll do!'. Otherwise you end up working with your name set in the finest characters, or so you think at the time, and move it about for an hour to find the place where you think it works, only to want to move it a week later...\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nRez\n\n"
    },
    {
      "time": "30 Apr 2008 — 8:35am",
      "content": "Same here. I agree totally or even more so. You know you HAVE to get it right for the client but for yourself...well...you could be happy with as much or as little work you do for yourself as you aren't doing it for others. You could be easily satisfied haha. OI changed things over night. I'm in my bed, about to go to sleep and i'll have another idea. I'll wake up in the middle of the night to go to the loo and i'll have a better idea just sitting on the loo. Haha. Even funnier! That's the time when I'm ACTUALLY really thinking straight. How weird and wonderful.\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:55pm",
      "content": "Who is your target audience? You are not designing for yourself, you are designing for them.\n\n"
    },
    {
      "time": "1 May 2008 — 7:52am",
      "content": "Thanks for your thoughts everyone. Magnus, those business cards are hot.  \nChristian, my target audience could be someone from any industry that utilizes designers.\n\nI've recently started some sketches of something that may have potential, so maybe I'll post when I have something substantial to show...\n\n"
    },
    {
      "time": "3 May 2008 — 4:16pm",
      "content": "@Ricardo & mili: same in portuguese! We say “em casa de ferreiro, espeto de pau”, which means “at a blacksmith's house, the spit is wooden”, but since it's understood, we end up just saying the first part, “em casa de ferreiro…”. That's pretty interesting! Though probably it shouldn't be that amazing; it would probably be really amazing if we found something similar in an asian or african culture.\n\nAnyways, yes, definitely, totally, designing for ourselves is tough. I have no suggestions and I like – and have tried – some of these, but they're really hard to follow. As a designer, we kind of have the totally unrealistic job of summarizing entire personalities into one little piece. We rarely fully achieve that, but we still keep on doing it.  \nIt's a lot easier when it's all about someone else, as it is a lot easier to give advice to others than to make decisions about our own lives. It's a bit about perspective. It's also about us not wanting to oversimplify ourselves and our lives – as someone already mentioned –, since we, human beings, like to think of ourselves as quite complex, and that's really a good thing. I think that we should probably try working for ourselves much more often, and I think that the day you fully understand yourself, your own thoughts and ideas, your personality, what you think matters, what you really want… that day you become a MUCH better designer and, more importantly, a much better YOU (in a sense that you'll probably become much more yourself than ever). Which I think is also rare. :P  \nI think that's the ultimate challenge. This is actually an internal fight between the person we truly are and the person we would like to be and/or the person we would like others to think we are. It's really us trying to choose what's more important: appearances or true essence. And that's probably the only time we realize that, when we do stuff for other people, we are, in fact, putting this dilemma aside in exchange for money.\n\nSo, heck! This should be hard! No suggestions for you! :P\n\nruD\n\n"
    },
    {
      "time": "4 May 2008 — 3:08pm",
      "content": "It's my first post here on Typophile so hello to everyone.\n\nI'm really glad I stumbled upon this topic cause I've been thinking and discussing it a lot with my friends lately. I have rather web-design background so some of the stuff I'll say may seem irrelevant to some of you. I've been struggling to come up with a good logotype and portfolio design for a few months now. I finally made it—at least I hope so—but the whole process was a pain in the neck. Here is what I realized:\n\n**Have a clear idea of what you're design should be like**  \nIt may be so obvious, but many people find themselves acting to make a design not having even a slightly organized thoughts on it.. I see a lot of guys launching their design tools and trying to come up with some cool instant prototypes. Seeking inspiration is crucial here.\n\n**Make no deadlines**  \nOf course, you have to have a deadline when delivering a project, but if you can afford to wait—do so, don't rush it. Bad, fast decisions can cost you a lot.\n\n**Stick to the idea, but starting from scratch isn't always that bad**  \nInitially I wanted to design myself a nice graphic/web-design portfolio with some extensive usage of Helvetica, somehow I ended up having a vintage-like design full of sans-serif typefaces. I'm glad I changed my mind in the middle of the designing process cause I'm pretty much satisfied with the result, but abandoning work on half-finished project is not what everyone can do.\n\n**It's awful unless you really think it's beautiful**  \nIf your not satisfied with a button or a small element of the whole you may want to work on it but if you're having second thoughts on the whole design line you should consider changing it. That's what I did with the Helvetica-based theme.\n\nI hope you'll find some of these useful if not obvious.\n\nKind regards,\n\nPiotr\n\n"
    }
  ]
}
