{
  "id": "44714",
  "title": "Web Embedding Questions",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I apologize if I’m missing something major, but I’ve spent the night searching Google and this forum and haven’t really felt like I’ve found the information to satisfy my questions.\n\nFirst, I’m a design student currently, so I’m working on drinking up as much information as I can now, but I may be drowning — please educate me! I’ve come from a web design background, and now as I learn more about typography, I want to apply that knowledge back to the web by way of embedded fonts.\n\nI’m really interested by the idea, which technically isn’t provided by many browsers at this point (I can only find Safari and older versions of MS Internet Explorer supporting it. I’m not sure if IE has continued support of embedding) but I’m also concerned with the legality of it. I’ve found many fonts that I’ve found have provisions for embedding in their licenses, but they tend to refer to PDF and Flash embedding. The only typeface I’ve found (that I would use) that specifically mentions embedding on the web in it’s license is [Gentium](http://web.archive.org/web/20080708213942/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium), which looks like a decent serif, when your choices are between Times New Roman and Georgia.\n\nWhere I get confused is things like [Myriad Web](http://web.archive.org/web/20080708213942/https:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFont&code=MYRW10005000) (It looks like that link needs an Adobe account to access) and a few other fonts Adobe sells with a “Web” suffix. I understand that the embedding policy on that font is listed as “Editable,” which is generally pretty open, but I’ve yet to find a definitive answer as to whether that allows web embedding.\n\nI assume — it does say “web” in it’s name — that web embedding is allowed, but when I assume, I tend to be wrong. So, somebody please educate me on the legalities of embedding.\n\n [‹ What does ...](http://web.archive.org/web/20080708213942/http:/www.typophile.com/node/44605 \"Go to previous forum topic\") [TypeCon2008 ›](http://web.archive.org/web/20080708213942/http:/www.typophile.com/node/44645 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080708213942/http://www.typophile.com/user/27574\" title=\"View user profile.\">alexkeeny</a>",
  "time": "<br>",
  "uid": "27574",
  "comments": [
    {
      "time": " 27.Apr.2008 1.29am",
      "content": "“Web” in “Myriad Web” means those fonts are TrueType fonts optimized of screen use. The way font embedding works in Safari is not allowed for commercial fonts, since you need to upload the fonts on a public server.\n\n"
    },
    {
      "time": " 27.Apr.2008 9.17am",
      "content": "Ralf, am I correct that [server-side image generation](http://web.archive.org/web/20080708213942/http:/www.joaomak.net/util/dtr/) from a font is kosher?\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 27.Apr.2008 10.15am",
      "content": "Alex, really the only advice anyone can say with any certainty is “read the license” - some font embedding applications and tools respect embedding permissions encoded within OpenType and TrueType fonts, others ignore these permissions. However the permission bits only talk about embedding the font within a document file, and don’t talk about what you can do with that document - only the EULA can give a full picture. If the EULA isn’t clear ask the designer/foundry.\n\nBeth, some EULAs prohibit server based rendering where the user interacts indirectly with the font.\n\n"
    },
    {
      "time": " 27.Apr.2008 11.17am",
      "content": "<cite>Ralf, am I correct that server-side image generation from a font is kosher?</cite>\n\nA typical EULA is based on the assumtion the font is used by a limited number of users on local machines. Web uses are always a different thing. Some vendors don’t allow such uses at all, some require an additional web license. So most of the time, it is not kosher.\n\n"
    },
    {
      "time": " 27.Apr.2008 11.42am",
      "content": "I see, thanks! Although it seems bizarre that identical PNGs, one created on my own computer by hand, and one created on the fly by a php script on a server, would be subject to different rules. Or am I misunderstanding?\n\n—-  \neeblet.com\n\n"
    },
    {
      "time": " 27.Apr.2008 12.58pm",
      "content": "<cite>Or am I misunderstanding?</cite>\n\nNo, you don’t.  \nThe problem is where to draw the line. The images could be created by dozens of users in the backend of content management system. Or every page request by thousands of users could create new images (with dynamic texts). Or the server could be used to create high-res images, for example for an online t-shirt printing service. These are things the that can’t be covered with a typical license for 20 bucks. That’s why many foundries rather prohibit server use alltogether in their standard EULA.\n\n"
    },
    {
      "time": " 27.Apr.2008 2.03pm",
      "content": "Thanks for the explanation, Ralf.\n\n"
    }
  ]
}
