{
  "id": "44723",
  "title": "George Lois' Esquire Covers at MoMA",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I wish I were going to be in NY sometime soon, this looks cool: [http://www.nytimes.com/2008/04/27/arts/design/27mcgr.html](http://web.archive.org/web/20131020190327/http:/www.nytimes.com/2008/04/27/arts/design/27mcgr.html).\n\n",
  "author": "eeblet",
  "time": "27 Apr 2008 — 8:28am",
  "uid": "14287",
  "comments": [
    {
      "time": "27 Apr 2008 — 8:47am",
      "content": "Nice article by Charles McGrath... I had no idea what George Lois was up to these days!\n\n"
    },
    {
      "time": "27 Apr 2008 — 11:24am",
      "content": "_Nice article by Charles McGrath_\n\nVW's \"Think Small\" layout was created by Helmut Krone, art director, and the headline was written by Julian Koenig.  \nMcGrath's attribution to Lois is interesting, a result of the passage of time and the way that famous names scoop up historical accreditations for the famous stuff? Or the way that internet-era research generates factoids?\n\n"
    },
    {
      "time": "27 Apr 2008 — 11:51am",
      "content": "Among the first few Google results for 'VW \"think small\"' is [this](http://web.archive.org/web/20131020190327/http:/adage.com/century/campaigns.html), which includes this:\n\n----\n\n> First of all, our thanks to Kurt Kroner, the man behind the defining example of the greatest advertising campaign of the century.\n> \n> He wasn't the copywriter. That was Julian Koenig. Nor was he the art director. That was Helmut Krone. Nor was he elsewhere employed by Doyle Dane Bernbach, the agency that stormed the confining Bastille of advertising orthodoxy to ignite the \"creative revolution.\"\n> \n> Actually, our hero wasn't in advertising at all. Kurt Kroner was the one, among 3,389 Wolfsburg, Germany, assembly plant workers, to flag a blemished chrome strip on the glove compartment of a 1961 Volkswagen Beetle and reject the vehicle for delivery. Yes, if we are to believe Koenig's copy, Herr Kroner gave us the famously failed and fabulously forlorn. . . \"Lemon.\"\n\n----\n\nSo even internet-era research isn't an excuse for this misattribution! Thanks for the catch, Nick.\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "27 Apr 2008 — 3:04pm",
      "content": "Wow, Nick, great catch! My excuse for missing that one is that I was still having my coffee as I read the article this morning...\n\n[EDIT] And hang on, I've looked further into this... George Lois was indeed employed at DDB at the time of the Think Small ad... I looked it up in Clive Challis' book on Helmut Krone. Lois is quoted as saying, \"We have to sell a Nazi car in a Jewish town.\" But the book only mentions Koenig and Krone as the people responsible for \"Think Small.\" and \"Lemon.\" (There were many other ads, and the book shows them all.)\n\n"
    },
    {
      "time": "7 Jul 2008 — 7:25am",
      "content": "Update: The _New York Times_ article [has been corrected](http://web.archive.org/web/20131020190327/http:/www.nytimes.com/2008/04/27/arts/design/27mcgr.htm?_r=1&oref=slogin).\n\nAlso, see [\"The Passion of George Lois\"](http://web.archive.org/web/20131020190327/http:/www.designobserver.com/archives/entry.html?id=35864) on Design Observer.\n\n"
    },
    {
      "time": "7 Jul 2008 — 9:03am",
      "content": "_famous names scoop up historical accreditations_\n\nAlso, the boss gets the credit.  \n\"The Giant\" has recently been attributed to one of Goya's employees: [http://www.msnbc.msn.com/id/25394622/](http://web.archive.org/web/20131020190327/http:/www.msnbc.msn.com/id/25394622/ \"http://www.msnbc.msn.com/id/25394622/\")  \nAnd in type...\n\n"
    }
  ]
}
