{
  "id": "44737",
  "title": "New release: Flama mega family / 2008.04.22",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20110524202525/http:/typophile.com/user/7006 \"View user profile.\") : 28.Apr.2008 3.00am \n\nHi!  \nGreen greetings from springlike New York City.\n\n/ / / / /\n\nNew release: Flama mega family by Mario Feliciano\n\nOne of the maiden releases when Village launched in 2005, and still one of our most popular offerings, the Flama family has been expanded and improved. Mario Feliciano, the great Portuguese designer, has added three additional widths and some extra weights to this eminently useful sans.\n\nThe \"standard\" Flama family now comprises 10 weights from Thin through Black in both roman and italic with all accents needed for setting western and eastern European languages. Also new for 2008 are Semicondensed, Condensed and Ultracondensed widths of Flama.\n\nThe type family will soon be seen everywhere (in Europe, at least) for a major car company.\n\nThe Flama family of 20 fonts is US$450.  \nThe Flama Semicondensed family of 9 fonts is US$225.  \nThe Flama Condensed family of 8 fonts is US$180.  \nThe Flama Ultracondensed family of 8 fonts is US$180.  \nThe Flama Superset of all 45 fonts in all widths is US$750, a savings of over 25%.\n\nSingle weights of all types are available, and are covered by the Taste Test program.\n\n[http://vllg.com/Feliciano/](http://web.archive.org/web/20110524202525/http:/vllg.com/Feliciano/ \"http://vllg.com/Feliciano/\")\n\n/ / / / /\n\nSpeaking of the Taste Test program...\n\nDon't forget that all fonts offered on vllg.com are in our Taste Test program. If you license a single weight of a family, and then come back later to get the full family, your original purchase amount will be returned to you. Details and examples are at [http://vllg.com/tastetest.php](http://web.archive.org/web/20110524202525/http:/vllg.com/tastetest.php \"http://vllg.com/tastetest.php\")\n\n/ / / / /\n\nRecession, anyone?\n\nThe US economy is on a rocky path and our dollar keeps losing value, which is great for our friends in foreign countries. We've said it before, and we'll say it again: Our dollar is weak but our types are strong!\n\nSome examples...  \nThe new Flama Superset is US$750, or around 470 euros.  \nThe Stag Superset from Schwartzco is US$500, or around 315 euros.  \nOur most popular family, Apex New, is US$249, or around 155 euros.\n\n/ / / / /\n\nComing soon: debut releases from Jeremy Mickel and Jordi Embodas; Galaxie Polaris Condensed; Apex Compact; updates galore...\n\n/ / / / /\n\nThanks again from DUMBO / Vinegar Hill.\n\nChester & Tracy Jenkins  \nVillage  \n206 Front Street #4A  \nBrooklyn, NY 11201\n\ntelephone ++1 718 852 1005  \nfax ++1 718 852 1006\n\n[http://vllg.com/](http://web.archive.org/web/20110524202525/http:/vllg.com/ \"http://vllg.com/\") / / / / / / / / / / / / / / / / / / / / / /\n\n",
  "author": "<a href=\"http://web.archive.org/web/20110524202525/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 28.Apr.2008 3.00am",
  "uid": "7006",
  "comments": [

  ]
}
