{
  "id": "44756",
  "title": "type/letterhead design",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nIs it a typecrime to use the same face on letterhead text as you used for logo? Meaning address, phone, website copy.\n\nAny recommendations on current fav book on typography?\n\nThanks in advance.\n\n [‹ National Geographic Redesign](http://web.archive.org/web/20080502183025/http:/www.typophile.com/node/44506 \"Go to previous forum topic\") [On rags and writing styles ›](http://web.archive.org/web/20080502183025/http:/www.typophile.com/node/44789 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080502183025/http://www.typophile.com/user/17954\" title=\"View user profile.\">cpeace</a>",
  "time": "<br>",
  "uid": "17954",
  "comments": [
    {
      "time": " 28.Apr.2008 11.56am",
      "content": "I’d say that it rather depends on what type the logo is set in. If your logo is say ..._yawn_... Helvetica, you are probably ok to set the other text in it. Anything with a bit more character may lead you into criminality. In general though, it’s probably best to find a complimentary face to set the other bits in. If it’s the typeface that the actual letter writers will eventually set their words in you’ll possibly achieve even greater harmony. Or, at the very least you won’t have three typefaces on the one document.\n\nWhat typeface is the logo set in?\n\n"
    },
    {
      "time": " 28.Apr.2008 12.26pm",
      "content": "Esta...\n\nmy next qt was going to be...if I do set copy and logo in same face, what to recommend for body. my concern was exactly that, three faces on one page.\n\n"
    },
    {
      "time": " 29.Apr.2008 2.51am",
      "content": "Keen to know what typeface it is in.\n\nIf its a plain and less decorative one then yes absolutely fine, the typeface becomes part of the company’s identity.\n\nCreates consistency too.\n\n"
    },
    {
      "time": " 29.Apr.2008 10.11am",
      "content": "It’s in Esta.....\n\n"
    },
    {
      "time": " 29.Apr.2008 10.18am",
      "content": "if really shouldn’t use Esta for ancillary copy, a suggestion for a serif (w/small caps option)?  \nalso, any current book suggestions?\n\n"
    }
  ]
}
