{
  "id": "44759",
  "title": "Boom logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI'm working on a logo for a communications company called boom, they do PR etc.\n\nWould appreciate any suggestions,\n\nThanks\n\n ![](http://web.archive.org/web/20131108204346im_/http:/typophile.com/files/boom_5096.jpg)\n\n",
  "author": "PointDexter",
  "time": "28 Apr 2008 — 12:24pm",
  "uid": "29991",
  "comments": [
    {
      "time": "28 Apr 2008 — 1:36pm",
      "content": "What's the black version like?\n\n"
    },
    {
      "time": "28 Apr 2008 — 2:02pm",
      "content": "Hi, here it is...\n\n ![](http://web.archive.org/web/20131108204346im_/http:/typophile.com/files/boom_b_w_5665.jpg)\n\n"
    },
    {
      "time": "28 Apr 2008 — 2:56pm",
      "content": "To both of us here, it said hooters.\n\n"
    },
    {
      "time": "28 Apr 2008 — 3:07pm",
      "content": "Unfortunately bosoms and eyeballs may be the initial association. Have you tried making the circle of the \"b\" and the two o's progressively larger? I see the explosion you're going for, but it took me a couple times to get it.\n\n"
    },
    {
      "time": "28 Apr 2008 — 3:15pm",
      "content": "You could also try showing the progression you have with the circles, by slowly increasing the size of each letter.\n\nFor example: b @ 25%, o @ 50%, o @ 75%, m @ 100%\n\nJust an idea to play with...\n\n"
    },
    {
      "time": "28 Apr 2008 — 3:41pm",
      "content": "Yeah, lop off that 'm' and let an errant 'b' into the room and you're in mamaland.\n\nBesides the mammary associations, I'm not getting a real sense that anything is \"booming\" in this logo. It's fairly static. You need some motion in it.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "28 Apr 2008 — 4:44pm",
      "content": "PR is also a pretty big area ... WHO are they talking to?\n\nHOW will they talk?\n\n----------  \n**Paul Ducco**  \n [Identity Design](http://web.archive.org/web/20131108204346/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": "28 Apr 2008 — 11:36pm",
      "content": "I'd like to see some circleness breaking out of the type - perhaps on the upper right, outside the m. It might demammarize, too. My first reaction was quite positive.\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "29 Apr 2008 — 3:36am",
      "content": "I think all our responses were positive ... are there negative responses to mammaries? - within reason.\n\nBoom - signifies shaking things up ... show it in your logo (concepts.)\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20131108204346/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "29 Apr 2008 — 11:17am",
      "content": "Hi all,\n\nThanks for your comments.\n\nI didn't notice the hooters until they were pointed out (hee hee!). But yep, I see them now. I was trying to get the impression of amplification across and thought the circles looked a bit like speakers.\n\nI agree that it's quite static looking, I think I'll go back to the drawing board and see what I can come up with.\n\nWill post the results,\n\nThanks.\n\n"
    },
    {
      "time": "29 Apr 2008 — 12:35pm",
      "content": "I imagined something more energetic and maybe with a reference to cartoon lettering like the example below.  \nWith the right treatment this could be very hip. :)\n\n ![](http://web.archive.org/web/20131108204346im_/http:/typophile.com/files/Bild1_5221.png)\n\n"
    },
    {
      "time": "2 May 2008 — 8:28am",
      "content": "For such an explosive word (pun intended) I'd personally like to see the work less rigid and locked down. While your version is clean and well constructed, it doesn't convey any energy, fun or excitement that could come with a moniker like Boom.\n\nI might be repeating what a lot of others have said, but this is one of those projects that people love to get. It allows them to explore the less confining guidelines in logo design. Get creative and throw some passion into this less than stellar first attempt.\n\n"
    },
    {
      "time": "8 May 2008 — 11:29am",
      "content": "cute but its not pushed 100% all the way right. Simplify the elements a bit more. Cut out more of the waste colors. Try to cut it down to 1 color if you can.\n\n"
    },
    {
      "time": "9 May 2008 — 1:20pm",
      "content": "Hi,\n\nThanks for your comments.\n\nThe client works with a broad range of companies including theatre, medical, beauty and business. They would like the logo to show amplification.\n\nHere are some changes to the first attempt and some very rough other ideas.\n\nI know the speech bubble is used a lot but I think it gets the idea of amplification across and I like the circular look.\n\nI guess the lower left looks too like the more4 logo.\n\nAppreciate any thoughts.\n\n ![](http://web.archive.org/web/20131108204346im_/http:/typophile.com/files/option3_6413.jpg)\n\n"
    },
    {
      "time": "9 May 2008 — 3:49pm",
      "content": "#1 has potential. I might suggest not making the 'm' so thick and making it more like the 'b' to show a progression of sound.\n\n"
    },
    {
      "time": "10 May 2008 — 9:49am",
      "content": "#1, #2 and #3 are the only ones that I find fresh and exciting. But you're having problems with letters. M is problematic on all of them. Ditch #3. Dead end. Ideally the logo is between #1 and #2 with changed m.\n\nIt will probably be the easiest to make m bigger in 1, which will emphasize every letter (otherwise it's also reading boo m - are you scared?)\n\nCOmpletely forget about 6 because it looks like clip-art logo.\n\n"
    },
    {
      "time": "22 May 2008 — 2:55pm",
      "content": "Those o's in the first couple look almost like the surprise/fear conveyed in comics by having two wide eyes, one wider than the other. You could totally go there!\n\n---  \neeblet.com\n\n"
    },
    {
      "time": "23 May 2008 — 2:46am",
      "content": "I really like #1. It definitely conveys a kinetic transfer of energy, as though the sound is passing through each letter and is just about to move into the 'm'.\n\nI don't actually mind #4, though it is a bit more static. #5 reminds me of the more 4 logo.\n\n ![](http://web.archive.org/web/20131108204346im_/http:/typophile.com/files/more4_144x134_5668.gif)\n\nYou're definitely on the right track with #1 though. Stick at it.\n\n"
    },
    {
      "time": "23 May 2008 — 7:18am",
      "content": "I'm not a big fan of changing the weight of letters progressively within a word, because i always hits a breaking spot where it just looks hokey.\n\nIt's like that Coca Cola product 'Zero'. Yeah, it has a very very very nasty type treatment hat I think originally was supposed to indicate weight loss, but I won't touch the stuff because it's such an abonimation of type.\n\nI really strongly second 'all about seb's suggestion, having a fun vector comic-book boom would be wonderful.\n\nYou could also look at colouring treatments like comic book titles, big letters with half-tine gradients in them (which still hold up in B&W)\n\nmy first thought when I saw your rounded sansserif was intense sadness. It looks like it's trying to be too cliché, or too trendy, but I'm not certain of the freshness or longevity of a trend like that. Best of luck!\n\n"
    },
    {
      "time": "24 May 2008 — 8:24am",
      "content": "intense sadness?\n\n"
    },
    {
      "time": "25 May 2008 — 9:45pm",
      "content": "@ theemeraldchild:\n\nIntense sadness:\n\nyou get a cute puppy for your birthday, but he puppy is dead.\n\n"
    }
  ]
}
