{
  "id": "44755",
  "title": "Pixel (Flash) Fonts VS Illustrator CS",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello!\n\nPixel fonts are blurry in all of the CS versions of Illustrator, even if placed at full x/y values. Seems like the only Illustrator versions that shows pixel fonts the crispy way are Illustrator 10 and below. (I wrote to Adobe about it last year [2007, or even 2006], and I still didn’t get an answer [surprise!].)\n\nDoes anyone know the trick for crispy looking pixel fonts in any of the CS versions? I’d like to design my Websites in Illustrator CS... I’m done with 10!\n\nThanks.\n\n",
  "author": "<a href=\"/web/20091218080739/http://www.typophile.com/user/16932\" title=\"View user profile.\">krissserz</a>",
  "time": "<br>",
  "uid": "16932",
  "comments": [
    {
      "time": " 28.Apr.2008 10.38am",
      "content": "You can’t blame Adobe for using Illustrator in such a strange way. Illustrator isn’t based on pixels, so how should the pixel fonts be rendered in a good quality? You need an app that is based on a pixel grid and you need to set the view to 100% (1 pixel on the screens equals 1 pixel of your design).\n\n"
    },
    {
      "time": " 28.Apr.2008 11.35am",
      "content": "Yes. Thank you: I design my Flash Websites at 100%.\n\nI’ve been working with Illustrator 10 to design my Flash Websites for five years. (Designing a Flash Website in Photoshop is completely inappropriate knowing that Flash is vector-based.)\n\nBut it’s frustrating to witness that Flash fonts have always looked great in the previous versions of Illustrator (10 and below), but not in the actual CS versions.\n\nThis means I’ll eventually have to design directly in Flash, but I’m so much more comfortable designing in Illustrator!\n\nThat’s why I’m trying to know if anyone is aware of the following:\n\n1) How to make Flash fonts look good in the CS versions of Illustrator;  \n2) If this is not possible, WHY did Illustrator change that? I’m sure I’m not the only one cursing.\n\nThanks!\n\n"
    },
    {
      "time": " 28.Apr.2008 11.52am",
      "content": "When you export to flash though you don’t have problems then - do you? It’s just while you are in Illustrator itself, correct?\n\nI suspect it has something to do with a change to the rendering engine. I wonder if they could give you a choice about that like they do in photoshop. Actually I should check to see if there is one...\n\n"
    },
    {
      "time": " 28.Apr.2008 11.59am",
      "content": "You can turn off anti-aliasing in the preferences. This will stop the “blurring”. But like I said: this will only give you a nice looking pixel font if the grid of the font and the grid of the Illustrator view will match coincidentally.  \nIf you just do your layout in Illustrator and then move it to Flash, why do you care about the appearance of the fonts in Illustrator?\n\n"
    },
    {
      "time": " 28.Apr.2008 12.01pm",
      "content": " **Exactly!**\n\nBut no... There doesn’t seem to have a «crisp/smooth» choice in the Type palette like in Photoshop.\n\nThanks again!\n\n"
    },
    {
      "time": " 28.Apr.2008 12.05pm",
      "content": "In reply to Ralph:\n\n_You can turn off anti-aliasing in the preferences. This will stop the “blurring”._  \n- - This will make all of the other items on the artboard aliased as well.\n\n_If you just do your layout in Illustrator and then move it to Flash, why do you care about the appearance of the fonts in Illustrator?_  \n- - Because the look and feel isn’t the same at all. Therefore, the design process isn’t the same, and the presentation process isn’t the same either...\n\nThanks again.\n\n"
    },
    {
      "time": " 28.Apr.2008 12.20pm",
      "content": "Effect \\> Rasterize  \n [Here](http://web.archive.org/web/20091218080739/http:/veerle.duoh.com/blog/comments/the_rasterize_effect_on_text_in_illustrator/) is a tutorial.\n\n"
    },
    {
      "time": " 28.Apr.2008 12.33pm",
      "content": "Thanks.\n\nThis seems to be the solution.\n\nI still find it weird that I’ll need to do that extra step everytime I’ll create another text box, but if it works, ok then! (It probably would’ve been better to have a “crisp/smooth” option in the Type palette like in Photoshop, but still...)\n\nSeems like this is it! Peace!\n\n"
    },
    {
      "time": " 28.Apr.2008 1.13pm",
      "content": "You can save a little time by saving the effect as a graphic style, which is very simple to do: Select one of your already-rasterized text boxes and drag it to the graphic styles palette. This will create a blank white icon in the graphic styles palette. When you select a text box and click on the icon, the same rasterize effect settings will be applied. Since a blank white icon is not very identifiable, it helps to give it a name (double click on it) and set the graphic styles palette to one of the list views.\n\n"
    },
    {
      "time": " 28.Apr.2008 1.14pm",
      "content": "(I didn’t know about this rasterize effect, either, until now. Pretty neat.)\n\n"
    },
    {
      "time": " 28.Apr.2008 2.33pm",
      "content": "Great! I’ll try that!\n\nMuch appreciated. Thanks!\n\n"
    },
    {
      "time": " 28.Apr.2008 3.15pm",
      "content": "I don’t want to kill the spirit, but if you’re using Illustrator to design your sites there’s a good chance you don’t really need Flash. One can remake any AI with just plain old html/css – if you care about usability, that is.\n\n"
    },
    {
      "time": " 29.Apr.2008 12.24am",
      "content": "Frode, what’s all this “if you care about usability, that is” stuff? Much as I venerate usability ( and I do you know...) the world is not made of usability alone. Not all individuals or business’ want or would even benefit from usability alone.\n\n"
    },
    {
      "time": " 29.Apr.2008 7.30am",
      "content": "I’m no evangelists on these matters, but I find it good to take use of the internet’s possibilities. Flash is, btw, an amazing tool.\n\n"
    },
    {
      "time": " 29.Apr.2008 1.06pm",
      "content": "To be frank, I really don’t think this is the matter of the subject here, but I’ll still take time to answer.\n\nIt’s simple: I’m used to Illustrator to design with. I don’t want to waste too much time having to get used to Flash’s tools. I work on a MAC, and my programmer works on a PC. So I have to break apart the fonts anyway when I give him the Flash docs. (Please don’t ask anymore questions relating to our/my method of work... It would be too long and not on the subject. Thanks. We all have our own ways of working for a lot of different reasons. That’s it, that’s all.)\n\nIllustrator is vector-based, and so is Flash. I think it’s logical.\n\nWhat wouldn’t be logical, would be to design the interior of a novel with Photoshop for obvious reasons.\n\nThanks.\n\n"
    },
    {
      "time": " 29.Apr.2008 10.25pm",
      "content": "Please forgive me if I came across harsh. Good luck with your work, Krissserz!\n\n"
    },
    {
      "time": " 30.Apr.2008 1.32pm",
      "content": "No problem!\n\nPeace to all!\n\n"
    },
    {
      "time": " 30.Apr.2008 1.32pm",
      "content": "No problem!\n\nPeace, and thanks again to all!\n\n"
    },
    {
      "time": " 1.May.2008 8.51am",
      "content": "Something else that may be useful: In Indy you should use a full point–grid & lock/place all elements on this. Makes for more consistent anti-aliasing when rendering to pixels.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 1.May.2008 12.37pm",
      "content": "I would think that would work - \\*if\\* your output resolution was a multiple of your grid resolution. So for example if your grid is point-based, and you export at 100 ppi, the grid won’t help. But if you export at 72 ppi, it would.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 6.Aug.2008 12.02pm",
      "content": "In Illustrator CS3, you select the option View \\> Pixel preview. And everything placed in an exact o half pixel (,5) in the X an Y axis gets rendered sharp and crisp.\n\n"
    }
  ]
}
