{
  "id": "44791",
  "title": "The new BBC website",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "[http://www.bbc.co.uk/](http://web.archive.org/web/20130516060849/http:/www.bbc.co.uk/ \"http://www.bbc.co.uk/\")\n\nFirstly a bit of a general thought on the BBC and their website. I don't know this for sure, but it has to be one of the most used, if not THE most used websites in the UK. Whenever I want to find out about something, be it weather, news, or sport, this is where I go. I guess overall people respect the BBC. They assume content both in web editorial and television is more honorable than television or news companies that generate their revenue solely from advertising. There is little doubt that the BBC is one of the most recognized.\n\nSecondly, this site has a massive amount of information on it. It has reviews of all kinds, news, games, video...basically you name it and it is a surprise if the BBC don’t feature it. So obviously usability is a massive issue here. It needs to be kept simple, and easy to navigate.\n\nSo why the new site. Actually I should probably clarify that a little. It is not technically a new site. Yet more, in the words of the designers a “site refresh…like gardeners doing a bit of pruning and weeding, but not digging it up and starting from scratch\". A lot of the site is infact pretty much the same as the old one. And why not? In my opinion it was always quite a good site in terms of usability. So the site is more just updated visually, to look a bit more modern.\n\nSo my thoughts. Well, I like it. Its simple, and it certainly looks more modern. It also has a lighter feel, which makes it seem more accessible. I am not sure if this is the case or not, but the text feels larger, maybe this is just good visual design, but it certainly has a more readable feel to it.\n\nAnd of course, it still has its usability. I always think with websites of this magnitude, you need to clearly separate the sections and the BBC does this with simple colour. And I think it works. I have certainly found it quite easy to use. I guess sometimes a site like this needs to be got used to a little to get used to it, but it generally works. Lots of information is available on the front page, and you can also click the headers such as news or sport which take you through to the relevant sections. Some discussion forums have suggested it is too crowded on the front page, making it difficult. But I think its ok. I mean you need to present the information, right? So the viewers can see what options they have.\n\nIt is also consistent. Each section looks pretty much the same with the header consistent. Some do change, such as the main front page and the news section, but again it is consistent enough to keep pushing its own style recognisability.\n\nIt also has massive improved features of user-interactivity, which I think is awesome. You can customize the colour, and also information can be customized depending on the user. The local news and weather is displayed when the user types in his or her postcode.\n\nSo overall, yeah I like it. But I will say this. For me, so many websites begin to look the same now. They all seem to use a kind of gradient glass like effect, and follow suit of sites such as apple. Also this shine is used on buttons. I guess we maybe have an obsession to bringing some 3d-ness to websites. This gives the impression that the light is reflecting, or that the site has actual ‘real buttons’. For me its too much like just throwing a load of gloss on something, or chucking a load of photoshop filters s on to bring it to life. The design fundamentals are all there, its simple and elegant, so maybe they could hold back on the gloss. Perhaps we need to embrace the web for what it is rather than attempting to make it look like its not the web!\n\nSo what are your thoughts? I would love to hear what you guys make of the BBC site, or just of my article. What can I do to make it better?\n\n[http://www.freddesign.co.uk](http://web.archive.org/web/20130516060849/http:/www.freddesign.co.uk/ \"http://www.freddesign.co.uk\")  \n [http://www.freddesign.co.uk/2008/04/archive/the-new-look-bbc-website/](http://web.archive.org/web/20130516060849/http:/www.freddesign.co.uk/2008/04/archive/the-new-look-bbc-website/ \"http://www.freddesign.co.uk/2008/04/archive/the-new-look-bbc-website/\")\n\n",
  "author": "chasteauneuf",
  "time": "29 Apr 2008 — 8:55am",
  "uid": "29870",
  "comments": [
    {
      "time": "29 Apr 2008 — 3:44pm",
      "content": "The main page is nice, but as soon as I jump away I’m in blahville. The designers appear to be balancing between a branded network site and a very neutral news site, and in the process it seems like a whole lot of images just aren’t loading or something. The negative space needs to feel more purposeful, even if it’s just hit with a light gray, err, grey, fill.\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:05am",
      "content": "Thanks for the comment James. I know what you mean, it al,most defaults back to its old format after the front page doesnt it. I find a few websites tend to do that.\n\n"
    },
    {
      "time": "30 Apr 2008 — 5:46am",
      "content": "It's odd that clicking on different tabs within the \"feature\" area - top right of page [http://www.bbc.co.uk/home/](http://web.archive.org/web/20130516060849/http:/www.bbc.co.uk/home/ \"http://www.bbc.co.uk/home/\") changes the overall colour scheme.\n\n"
    }
  ]
}
