{
  "id": "44825",
  "title": "Magazine Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I am totally and completely stuck! I’m launching a magazine (RSVPerfect) in a few months and am trying to create a logo for it. It is a party planning and event design magazine. I’m including a mock-up below. I wanted to create an elegant look that reflected class, however, I wanted it to stand out in the midst of the many magazines that are already on the news shelves. Any font ideas?\n\nTwo questions... what do you think of the logo? I know that “St. Louis” looks too small and poorly placed. And what do you think of the name RSVPerfect? Do you think that the general public will understand it or is it too abstract?\n\nAny feedback would be GREATLY appreciated.\n\n ![](http://web.archive.org/web/20080907053142im_/http:/www.typophile.com/files/magazine_5097.jpg)\n\n [‹ Designing in The Corporate Environment](http://web.archive.org/web/20080907053142/http:/www.typophile.com/node/44800 \"Go to previous forum topic\") [NHPA Critique ›](http://web.archive.org/web/20080907053142/http:/www.typophile.com/node/44507 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907053142/http://www.typophile.com/user/30327\" title=\"View user profile.\">houseofdesign</a>",
  "time": "<br>",
  "uid": "30327",
  "comments": [
    {
      "time": " 29.Apr.2008 9.27pm",
      "content": "I can honestly say I have no idea why you tacked “erfect” on the end. Why not just RSVP St Louis? I worked in the wedding industry for 12 years, and I have no idea what R.S.V.Perfect means, abstract or not. “répondez s’il vous plaît ... erfect”? Huh? I’m just being honest, sorry if it sounds harsh.\n\nTo my eye, the logotype is just a headline made up of three totally unrelated parts. Have you worked out the logotype by itself, using black on white only? I’d love to see some of those sketches. I think you could find a really lovely typeface to work with, but the name makes it hard to picture with this combination of all uppercase, a lowercase orphan, and an italic hat. Are you open to dropping the “perfect”?\n\n"
    },
    {
      "time": " 29.Apr.2008 10.56pm",
      "content": "Thanks so much for your feedback. I TRULY appreciate it! The person that came up with the name was a brand specialist, apparently he came up with John Deer identity and slogan. He was in the branding business for a long time and I was excited to hire him. Unfortunately, RSVPerfect was the best name that he came up with. For copyright purposes, we thought the “erfect” was, clever... but I can definitely see your point. I really like RSVP St. Louis, but unfortunately, there is another company here that has the RSVP name and they send out coupon postcards from various businesses. I guess their idea is that you are suppose to “respond” to the promotional postcards.\n\nThe logo was originally designed by a graphic artist who claimed that she was a font guru. I am attaching her original design. I wasn’t crazy about it, but I had so much going on during the time when we finalized the logo, I just wanted to move on.\n\nSo, now I am resurrecting everything and ready to go to print, but I realized that I am struggling with the logo... so I am tweeking and playing with what she had done. So I have no sketches. Do you think I should go back to the drawing board? What do you think of her original design?\n\n ![](http://web.archive.org/web/20080907053142im_/http:/www.typophile.com/files/rsvperfectlogo_3540.jpg)\n\n"
    },
    {
      "time": " 30.Apr.2008 3.34am",
      "content": "First off I would slim down the leg of the R and bring the double line to the end of the stroke. As it is it sort of resembles an errant Versal. Also you need to equalize the weights of the heavy strokes, the S and the V look a bit light... might be my screen. The “er” and “ct” are a bit loose compared to the “rfec.” Maybe the diamonds could be a tad larger?\n\nDoes that help?  \nMichael\n\n"
    },
    {
      "time": " 30.Apr.2008 3.47am",
      "content": "Rob Leuschke is down in St. Louis. He could do your revisions in no time flat. Great guy and knows his stuff.\n\n"
    },
    {
      "time": " 30.Apr.2008 7.52am",
      "content": "THANK YOU! I will try making the revisions. I looked up Rob Leuschke but his web site is under construction so I could not find his contact information. Is there anyone else who would recommend? Or, do you know Rob’s contact info?\n\n"
    },
    {
      "time": " 30.Apr.2008 8.10am",
      "content": "Left you a message!\n\nMichael\n\n"
    }
  ]
}
