{
  "id": "44845",
  "title": "Web Typography: Tell Me What You Want",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We all know that [Web typography sucks](http://web.archive.org/web/20080704191728/http:/webtypography.net/sxsw2007/), but it’s like the weather: everybody complains, but nobody does anything about it. Well, now _you_ can. As a member of the World Wide Web Consortium’s CSS Work Group (the group the defines how styles work in Web pages), I recently took on the duty of advocate and editor for [CSS Fonts](http://web.archive.org/web/20080704191728/http:/www.w3.org/Style/CSS/current-work#fonts) (how fonts are displayed) and [CSS Web Fonts](http://web.archive.org/web/20080704191728/http:/www.w3.org/Style/CSS/current-work#webfonts) (downloadable fonts). These specifications define the core styles for Web typography.\n\nBy and large the CSS specifications have not had a lot of input from designers, the very people who use them every day. Let’s change that! I’m working on the revised specifications to present at a CSS Work Group meeting in August, and I want your ideas on what we can do to improve typography on the Web.\n\nTo participate, read my [blog entry on webbedENVIRONMENTS calling for feedback](http://web.archive.org/web/20080704191728/http:/www.webbedenvironments.com/blog/index.php/2008/04/29/web-typography-tell-me-what-you-want/) and then post your ideas on my blog or here in this Typophile Forum thread.\n\nHelp me Typophile, you’re my only hope!\n\n [‹ I hate Microsoft Word](http://web.archive.org/web/20080704191728/http:/www.typophile.com/node/44804 \"Go to previous forum topic\") [typefaces for children's art camps... ›](http://web.archive.org/web/20080704191728/http:/www.typophile.com/node/44754 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704191728/http://www.typophile.com/user/29941\" title=\"View user profile.\">JCranfordTeague</a>",
  "time": "<br>",
  "uid": "29941",
  "comments": [
    {
      "time": " 30.Apr.2008 11.08am",
      "content": "I’m pretty happy with the CSS3 Web Fonts draft. If only browsers would start to support it.\n\nWishlist:  \n-automatic hyphenation (something like »language:de-at« in a CSS rule.The browser would then do the hyphenation according to the specified language)  \n-a CSS-based system for protecting commercial webfonts (limiting the use of a font to a certain domain)\n\nfont-size-adjust, font-stretch, and font-smooth are very good additions. For example, it’s almost impossible to mix the ClearType fonts with the older core fonts in smaller sizes. font-size-adjust could fix that.\n\nBTW: I just did a survey about webfonts among webdesigners: [http://opentype.info/blog/2008/04/19/font-face-survey-results/](http://web.archive.org/web/20080704191728/http:/opentype.info/blog/2008/04/19/font-face-survey-results/ \"http://opentype.info/blog/2008/04/19/font-face-survey-results/\")\n\n"
    },
    {
      "time": " 30.Apr.2008 1.30pm",
      "content": "3 naive expectations:  \n-Looking good on screen (Win OS, Mac OS) and looking acceptable, if printed with a user’s printer  \n-Having similar design to typefaces used in print, s.th. like webversions of them  \n-Easy (intuitive) to work with (CSS, Javascript) …\n\nThink corporate design; you want colors, layout, typefaces, etc. in all media looking similar, or if it’s possible, the same. Okay, most of the people are far from expecting the clone, but as more it can get derived from existing print layouts, the better – we want consistency, the client wants it also. Don’t get me wrong, i don’t expect a 7- columns in a mobile phone browser :)\n\nWe need more Arial/Helvetica (or compareable Grotesks with the same first impression), Georgia/Miller, etc., which are easy to use. The money thing wouldn’t really matter (if “reasonable prices” were demanded), if i can tell (and show live on the monitor) the client the big advantage consistency can bring.\n\nIt gets difficult, if the designer wants to get off the beaten track – The only way open to us is pictures, sIFR for headlines, Flash (.swf-Format) now. Maybe you are a part of the “change”.\n\nGood luck (for all of us)\n\nBTW I did the 4th project within 6 months using Verdana as a textface for websites. Germany is a “sans land” so i can only go with Verdana, Arial, Tahoma, Lucida Sans to replace a decent sans-design we’re using in print.\n\n"
    },
    {
      "time": " 30.Apr.2008 2.10pm",
      "content": "Seems like a lot of these requests really fall outsize of the W3C and web specifications. These seems issues closer to DRM, browser rendering engines, etc.\n\nAs for CSS specific requests:\n\n- more specific/narrow generic font families (beyond sans, serif, etc.)  \n - do NOT include some effects (stretching type...3-d...etc.)  \n - concept of columns (I think that’s already in the queue)\n\n"
    },
    {
      "time": " 30.Apr.2008 4.37pm",
      "content": "I have many interests and concerns around web fonts. I did a survey of designers as well.\n\n[http://blogs.adobe.com/typblography/2007/11/web\\_fonts\\_1.html](http://web.archive.org/web/20080704191728/http:/blogs.adobe.com/typblography/2007/11/web_fonts_1.html \"http://blogs.adobe.com/typblography/2007/11/web\\_fonts\\_1.html\")\n\n[http://blogs.adobe.com/typblography/2007/11/web\\_user\\_survey\\_results.html](http://web.archive.org/web/20080704191728/http:/blogs.adobe.com/typblography/2007/11/web_user_survey_results.html \"http://blogs.adobe.com/typblography/2007/11/web\\_user\\_survey\\_results.html\")  \n(I eventually got over 300 answers, but that didn’t change the stats much.)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 30.Apr.2008 8.43pm",
      "content": "Not a CSS request, but an HTML one - a caption tag that applies not just to tables, but can be used for image captions; one of the tags I wish for most. For CSS, I’d like the ability to associate various font properties with a given family, such that I could list something like:\n\nfont: Myriad bold 1em, Univers 300 1.2em, Verdana normal .88em, normal sans .8em\n\nThis is clearly problematic syntax, but I hope it demonstrates the sort of behavior I’d like to see... I assume it’s too far out there, though. ;)\n\n—-  \neeblet.com\n\n"
    }
  ]
}
