{
  "id": "44844",
  "title": "Editorial- What does it mean?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What formats could it mean? It just doesn't mean a book or magazine does it? Enlighten me please. WHat other forms could it take place in?\n\n",
  "author": "missgiggles",
  "time": "30 Apr 2008 — 8:58am",
  "uid": "14600",
  "comments": [
    {
      "time": "30 Apr 2008 — 12:11pm",
      "content": " **edi·to·ri·al |ˌediˈtôrēəl|**\n\nadjective  \n1 of or relating to the commissioning or preparing of material for publication _: a pillar of scholarly publishing and editorial excellence._  \n· of or relating to the part of a newspaper or magazine that contains news, information, or comment as opposed to advertising.  \n2 of or relating to a section in a newspaper, often written by the editor, that expresses an opinion _: buoyed by yesterday's editorial endorsement._\n\nnoun  \na newspaper article written by or on behalf of an editor that gives an opinion on a topical issue.  \n· the parts of a newspaper or magazine that are not advertising.\n\nDictionaries are useful. ;)\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:01pm",
      "content": "The term editorial generally refers to the content. It can include books, periodicals (mags and newspapers) and even web sites. Promotional materials - brochures, ads, posters - are not editorial.\n\n"
    },
    {
      "time": "30 Apr 2008 — 1:10pm",
      "content": "Advertorial, infotainment--these are good words too.\n\n"
    },
    {
      "time": "30 Apr 2008 — 5:35pm",
      "content": "Hmm...okay. SO I heard editorial can be anything. I sure heard right but it's wrong. Thank you.\n\nOlho: I know dictionaries are good but I needed a broader view on it in forms of mediums.  \nPatty: Do you mean certain websites i.e The Sunday Times or the Guardian or ANY website?\n\n"
    },
    {
      "time": "30 Apr 2008 — 5:55pm",
      "content": "Editorial content in magazines refers to the part of the magazine the editor is responsible for. It's the portion of content that isn't advertising. It's the part of the magazine that is meant to attract readers who, presumably, will also look at the ads. From the point of view of the editorial staff, the ads only exist to support the editorial content. From the point of view of the advertisers, the editorial content only exists to attract potential customers to see their ads. There is usully some antagonism between the two. ;-)\n\n"
    },
    {
      "time": "30 Apr 2008 — 6:36pm",
      "content": "Or in a news sense, it is the opinion writing rather than the \"factual reporting\", cough cough.\n\n"
    },
    {
      "time": "30 Apr 2008 — 7:22pm",
      "content": "It's kind of a jargon thing. When a designer says they prefer to work on \"editorial\" projects, they don't mean the opinion page in the newspaper. It means they don't want to work in advertising or marketing.\n\n"
    },
    {
      "time": "1 May 2008 — 8:33am",
      "content": "missgiggles, yes obviously on a newpaper or magazine's web site the same distinction (editorial vs promotional) would apply. But IMHO it could also apply to a web site such as Design Observer which has written articles.\n\nI would not apply the term \"editorial\" to just any web site, certainly not to social networking sites like Facebook, portals such as Yahoo, or utterly inane sites like Twitter. Definitely not to commerce sites, altho Amazon contains some editorial content (the reviews), as do sites that review, say, digital cameras. Those sites probably have staff editors working specifically on editorial content.\n\n"
    }
  ]
}
