{
  "id": "4486",
  "title": "The Real Kilbirnie Serif",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Ha. Woah, what about that previous Kilbirnie   \nserif post. Email me a gun and I will shoot   \nmyself in the foot for that abomination.   \nSincere apologies. Note to self: don't post   \nmalformed concepts. This is what I was trying   \nto say- it just came right today after literally   \nmonths of toying with the idea.   \n   \n ![](http://web.archive.org/web/20130818211058im_/http:/www.typophile.com/forums/messages/29/34381.gif)\n\n",
  "author": "kris",
  "time": "27 Apr 2004 — 3:52am",
  "uid": "1519",
  "comments": [
    {
      "time": "27 Apr 2004 — 7:22am",
      "content": "Your font is very good,i remember some draws of Times or Gerard Unger... I dont know.   \n   \nbut, i cant understand your obsession in use this \"a\",this \"g\", or this \"u\".   \n   \nCreo que caracteres extra\n\n"
    },
    {
      "time": "27 Apr 2004 — 7:56am",
      "content": "Very nice!   \n- color problems: see the arches of 'hmn';   \n- overshoots: see how 'g' looks big next to 'h';   \n- 'v' is light;   \n- 'z' is too sharp (see for example how soft is your 'c'), doesn't fit the style;   \n- tail of 'j' needs work;   \n- IMHO: close the bowl of the 'q' (the bowl seems a bit light too);   \n- 'a' doesn't need such a big counter (compare it to 'e'); the stress on the bowl could be improved too, I think.\n\n"
    },
    {
      "time": "27 Apr 2004 — 1:18pm",
      "content": "Is this crisp or what? Wow.   \nIn some places it does seem too have to much Times in it, but that might in fact be unavoidable here to some extent. And the numerals you have are _really_ nice.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Apr 2004 — 5:58pm",
      "content": "Hi kris.   \n   \nLooks good. But I find the 'e' distracting - the top half seems to be leaing forward too much. I think it's the shape of the eye, and the shape of the exterior of the eye at the top left.   \n   \ncamille\n\n"
    },
    {
      "time": "28 Apr 2004 — 9:53pm",
      "content": "Your b and q look a bit bulbous, and e leans a touch to the right. C is okay because of the terminal, but I agree with Camille\n\n"
    },
    {
      "time": "2 May 2004 — 12:22pm",
      "content": "Very promising, dynamic. I think the issues of consistency, which are important, might await until you've finished a complete draft of the lower case.   \n   \nWhat I notice as out of character is the terminal of the r, which seems soft compared to the other letters. I also think the issue of the balance of the counter & width of the g in relation to other letters - an issue also in your Kilburnie sans - isn't fully solved.\n\n"
    },
    {
      "time": "12 Jun 2004 — 5:26pm",
      "content": "Been a While, as per usual. Had shuckster non   \npaying client-weasels to deal with and moved   \nhouse. I printed out the top version, revised it,   \nprinted, looked again and it was just strange.   \nThe forms of the a,g,p,u,d were too hard to get   \n'right'. I will leave these particular forms until I   \ncan bend them to my will. Too stylish right now,   \nnot natural enough.   \n   \nOn the other hand, it evolved into this, which is   \nmuch better for readability at this stage:   \n   \n ![](http://web.archive.org/web/20130818211058im_/http:/www.typophile.com/forums/messages/29/38219.gif)\n\n"
    },
    {
      "time": "12 Jun 2004 — 5:32pm",
      "content": "Looks solid.   \nYour \"g\"s need help though. For the Roman, I'd suggest giving it a bigger head and cramping the bottom (natural in a text face). But for the Italic I'm at a loss. Plus the Italic needs help elsewhere too, like the \"b\" looks confused.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jun 2004 — 6:49pm",
      "content": "I don't know if the soft terminals on the a, r and g and italic v will conflict with the really nice sleek top serifs you have going on in the other letters. I would think that something more sleek and pointy would go better even if it isn't your original.   \n   \nI feel like it will be more evident how well it is working when you have more letters and a pdf text setting.\n\n"
    },
    {
      "time": "13 Jun 2004 — 7:50pm",
      "content": "I know what you were doing earlier was a tough assinment and I hope you will find a way to go back and work through it.   \nThis latest font is very nice, clean, and craftsmanlike. I am sure it is very usable and sellable but it is unremarkable compared to your earlier venture. Perhaps after a break, it will seize you from within again and we can see the resolution of your struggle with it. Please don't let it die in you.   \n   \nChrisL\n\n"
    },
    {
      "time": "13 Jun 2004 — 9:12pm",
      "content": "\\>Please don't let it die in you.   \n   \nWell said. I agree.\n\n"
    },
    {
      "time": "29 Jun 2004 — 3:10am",
      "content": "Yeah, I agree. Here is what has happened:   \none soft, one sharp. I think they will be related   \nin the end, like brother and sister. But they   \nhave to grow up a bit more.   \n   \n ![](http://web.archive.org/web/20130818211058im_/http:/www.typophile.com/forums/messages/29/39479.gif)\n\n"
    },
    {
      "time": "30 Jun 2004 — 4:31pm",
      "content": "Looking good! The top one has real promise.\n\n"
    },
    {
      "time": "1 Jul 2004 — 5:30pm",
      "content": "Overall, I think an important issue is whether you want this to be a text type. If you do see how the curves and spurs and relative widths are affected by being 12 pt and below. I think if you put readability at small sizes as your goal, it will help decide what direction you want to go with it, and get one font design.   \n   \nOn the other hand if you go for a maybe different or related display type, you will be more free to be expressive and innovative.   \n   \nGenerally your letters are really beautiful, but it is said that a text type is 'not a collection of beautiful letters but a beautiful collection of letters' (Walter Tracy?) So if you go in the text direction, the main issue will be making everything fit and read well. I'm sure you will keep them elegant.   \n   \nOn the question of the original sharp terminal on the a, you might compare Kent Lew's Whitman, at FontBureau and his own site kentlew.com. I don't like the sharp a terminal on Perpetua, but Kent Lew made it work beautifully on his Whitman. It is sheared off rather than totally pointed though and the c s and r are also sharp in different ways.   \n   \nYour original had this kind of race car look and excitement about it, which would be a pity to lose at least for a display type...\n\n"
    },
    {
      "time": "4 Jul 2004 — 1:34am",
      "content": "\"not a collection of beautiful letters but a beautiful collection of letters\"   \n   \nIndeed. So I printed out both side by side, and the softer one   \nread much more easily. I am tentavily naming it Feijoa. Have   \na look at the sample pdf of the softy. That sharp bugger is   \ngiving me no end of trouble, but I might have a solution.   \n   \nThanks for the feedback. I will be interested to know what   \nyou all think of the readability of Feijoa, and her italic.\n\n<!--attachment: Feijoa-39916.pdf*mime_pdf.gif*application/pdf*51.6 **Feijoa%2epdf --><!--attachment: Feijoa-39916.pdf*mime_pdf.gif*application/pdf*51.6** Feijoa%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20130818211058im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20130818211058/http:/www.typophile.com/forums/messages/29/Feijoa-39916.pdf\" target=\"_blank\"><b>Feijoa.pdf</b></a> (51.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "4 Jul 2004 — 12:52pm",
      "content": "Hi Kris,   \n   \nThis is beautiful.   \nHere are some thoughts on your recent pdf.   \n   \nCaps:   \nU: Seems out of character IMHO. Yes with the sharp version, no with this version   \nR: The leg may want to extend a bit farther below the baseline. Right now it's looking raised off.   \nX: Consider moving the lower whole left leg a bit to the left. It will better balance, and optically allign them.   \nC: A little narrow?   \nf: Not sure about the bracketing on the bottom left of the crossbar.   \n   \nThere are a few places where the flowing bracketing (which I like) seems dark to me:   \nThe join in the T,   \nThe inside of the E and F (more like the B,P)   \n   \nLike the italic very much! Only thought there is to make sure the dots on the i and j are fare enough from the accute accent.   \n   \nCongratulations. This is nice!   \n   \nRandy\n\n"
    },
    {
      "time": "8 Jul 2004 — 10:53am",
      "content": "I am just now doing my first face, a text face, and you are now at a point where the mysteries - to me - of spacing, relative widths, and thick thin contract become very important. One thing I have found is that the thickness of the horizontal part of round letters is very important, and that the thins get visually get thinner faster than the fats as you print out in text size. Thus for text faces the horzontals in my opinion shouldn't be too thin.   \n   \nI would try reducing the contrast, and see how it looks in text sizes.   \n   \nAlso, I think the spacing needs work. It looks tight to me, but this might just be some letters. Also to me 9 point and 12 point are different animals. I believe that at 8 point the Adobe opticals 'caption size' generally are wider, looser and bolder.   \n   \nThe subtlety of the soft curves you have drawn get lost in small sizes, but this isn't necessarily a disaster, as people will see them more clearly in titles.   \n   \nAlso, I would say with the problems you say you are having with the sharp version, to try also reducing the contrast. This will mean changing the look of the terminals, but you might find a good solution.   \n   \nOne more issue that I don't understand is whether you have to do hinting first to get a decent read on the print out at 1200 dpi on a laser printer. Are you PDF's hinted? Are PDFs in general hinted?   \n   \nOh also the italic is great.\n\n"
    },
    {
      "time": "9 Oct 2004 — 12:14am",
      "content": ""
    },
    {
      "time": "9 Oct 2004 — 10:30am",
      "content": "It's getting a little too conventional for my taste.   \n   \nText vs Display:   \nThe contrast difference is smart, but just as important is the spacing: text cuts need to be looser, not tighter! Othe stuff is important too, like vertical proportions, width, color, etc.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Oct 2004 — 1:28pm",
      "content": "I really like both of your latest. I don't think they are too conventional. They are familiar enough to become invisible, but have a freshness and elegance. Both the ability to be come invisible and the freshness are big plusses.   \n   \nI will be interested to see what sizes you want them for, and how they look in PDF. Keep up the good work!\n\n"
    },
    {
      "time": "10 Oct 2004 — 5:36pm",
      "content": "Two very interesting comments. I don't really mind if it is getting too conventional, at this stage I am still very much learning. They aren't spaced properly yet either, but I will get around to it! Both of your comments are helpful indeed.   \n   \nI think I have to show the following, as it is the concept that started this thread. There is a sans and a serif, both of which evolved from the very first posting. I was told to not let the idea die, which I haven't. I just want it to grow up a little, we're taking baby steps now!   \n   \n ![](http://web.archive.org/web/20130818211058im_/http:/www.typophile.com/forums/messages/29/50934.gif)\n\n"
    },
    {
      "time": "13 Oct 2004 — 5:15pm",
      "content": "Is it a bit rude to post more than one 'concept' in a thread?\n\n"
    },
    {
      "time": "13 Oct 2004 — 5:54pm",
      "content": "Kris,   \nTerrific work! I am glad it still lives within you.   \nMy only question is the text face of your Oct. 9th post. Why close the lower loop of the \"g\"? It works well open and befits the rest better that way.   \n   \nChrisL\n\n"
    },
    {
      "time": "13 Oct 2004 — 5:56pm",
      "content": "\\>a bit rude   \n   \nNo, of course not. But the reason for not more commentary is probably that it is not very clear where you want go with this.   \n   \nI went last week for the first time to a type event, the 'Making Faces' seminar in New York. The two from House Industries, Font Bureau's David Berlow, Matthew Carter, and Hoefler & Frere-Jones.   \n   \nWhat I was really struck by in these folks who are producing and selling a lot of fonts is that the 'brief' for the font was critical. In the case of House Industries, it was more aesthetic: they wanted to take lettering they admired, and make functional type from it. For the others, it was producing fonts for specific purposes within a publication.   \n   \nYou have a lot of good ideas here and elsewhere, and a gift for elegant shapes, but I think you may be helped by a more clear brief for these fonts - either your own, or some one else's. For example, with your 'Eliza', you had a clear brief, and just produced the thing.   \n   \nThe scientist Michael Faraday kept a slip of paper in his top desk drawer. It said 'work, finish, publish.' I wish I always took this advice, but I think it's good. You will have chances to revisit old ideas once you do them for one purpose.\n\n"
    },
    {
      "time": "13 Oct 2004 — 6:21pm",
      "content": "Why close the loop? I thought it was a bit showy to have it open, so I kept it closed for the smaller sizes. Then again, many good text fonts have 'open' g's don't they? Hmmmn. I'll have to ponder that one.   \n   \nA brief is exactly what I need but don't have. I start with one thing and it evolves into two other things! Ye gad, even I have trouble keeping up with myself sometimes.   \n   \nBoth of your suggestions shall get me thinking. I know what I mostly want to do with Feijoa: a sturdy and readable typeface with curves. Why curves? I like curves, I like subtle softness without being cutesy about it. Seems to make it more human for me.   \n   \nI also know what I want to do with the sans in the Oct 10 posting. I think it has a lot of promise, clean and precise\n\n"
    },
    {
      "time": "13 Oct 2004 — 6:34pm",
      "content": "The open binocular \"g\" is the best for readability. But way too few \"serious\" fonts feature it. The weight of convention is hard to escape, unless you can muster a healthy disrespect for precedent - then it's easy as pi.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Oct 2004 — 6:51pm",
      "content": ""
    },
    {
      "time": "13 Oct 2004 — 7:24pm",
      "content": "(Caveat: there is no \"Proof\" of the following. Its only merit is making sense.)   \n   \nThe monocular form is too modular with respect to the rest of the alphabet. It is very legible, but does not contribute much divergence to boumas. The conventional, closed binocular form is richly divergent, but it's way too complex - it violates the \"rules of belonging\" of the Latin alpahabet too strongly. Topologically only the \"B\" (which is way less frequent, and bowl-adjacent) is equal to it, and then there's the ear on top of that! Giving it an open bottom -especially with a diagonal join that swells- ties it nicely into shapes like the \"s\", while reducing \"alien\" complexity. The best example of this form is B&R#2/Oxford/Monticello; another good example is Patria.   \n   \nThat said, there might very well be other structures that nobody's even thought of yet (or at least that haven't been promulgated adequately) that are even better than the open binocular. I just haven't been able to think of any do far.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Oct 2004 — 8:02pm",
      "content": "I had a gut feeling that is what you would say. The open form is more distinctive, more in keeping with the construction of other forms.\n\n"
    },
    {
      "time": "13 Oct 2004 — 8:02pm",
      "content": "I agree with Hrant that the binocular g is the most out-of-place character in the alphabet, but I don't buy the binocular g with open loop being necessarily better.   \n   \nAmong classic faces, Baskerville has it, but the loop is nearly closed. The slightly open loop - as in your face above also - I think is fine, but I find when faces try to open it more, it most often looks awkward. For example, the open binocular g I think mars Meta, which is otherwise great. I notice that in Unit, Spiekerman has the closed loop.   \n   \nI also do agree with Hrant that it is a letter where there is scope for new ideas. I just don't usually find the binocular loop opened a lot works well. The monocular g you have been experimenting with here is very interesting, for example, though I think it is not fully solved yet.   \n   \nBy the way, Kabel is one of the few that has a really different g that works well.\n\n"
    },
    {
      "time": "13 Oct 2004 — 10:36pm",
      "content": "![goodgs](http://web.archive.org/web/20130818211058im_/http:/www.typophile.com/forums/messages/29/51183.gif)   \n   \nLeft-to-right:   \n- Scan of Oxford from Updike's \"Printing Types\".   \n- Digitization (by a third party).   \n- Patria (Regular).   \n   \n\\> Baskerville has it, but the loop is nearly closed.   \n   \nYes, Baskerville's is sort of \"apologetic\". So is Meta's.   \nPlus the delicacy of their gaps is technically brittle.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Oct 2004 — 11:00pm",
      "content": "This is very interesting indeed. I can now see how the terminal of my g can proceed to take it's place within the others. Will post soon.\n\n"
    },
    {
      "time": "14 Oct 2004 — 7:00am",
      "content": "Oh, you might be interested in the [Houston](http://web.archive.org/web/20130818211058/http:/typographi.com/000876.php#000876) face, which Christian Schwartz produced recently for a newspaper. It has a tamer text version, and a more lively display, with two italics, one more expressive than the other. This should assure you that what you are doing with Feijoa can really work in a practical way within a publication.\n\n"
    },
    {
      "time": "25 Oct 2004 — 2:17am",
      "content": "Here is Feijoa 0.3.3. I have given it such a stupidly long numbering system so I can keep track with it all. This is the book version, for text. Fire away as you see fit.\n\n<!--attachment: Feijoa0_3_3-51989.pdf*mime_pdf.gif*application/pdf*29.7*feijoa0%2e3%2e3*Feijoa0%2e3%2e3%2epdf --><!--attachment: Feijoa0_3_3-51989.pdf*mime_pdf.gif*application/pdf*29.7*feijoa0%2e3%2e3*Feijoa0%2e3%2e3%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20130818211058im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">feijoa0.3.3<br><a href=\"http://web.archive.org/web/20130818211058/http:/www.typophile.com/forums/messages/29/Feijoa0_3_3-51989.pdf\" target=\"_blank\"><b>Feijoa0.3.3.pdf</b></a> (29.7 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "25 Oct 2004 — 5:31am",
      "content": "I'm seeing a couple of technical glitches (when I print it out, not in Preview.app). The part where the arms of the x cross comes out white, and there are also white rectangles where the arm of the H overlaps the verticals.   \n   \nOtherwise it's looking very nice! I like the subtly calligraphic parens, though they seem faintly incongruous?\n\n"
    },
    {
      "time": "25 Oct 2004 — 6:12am",
      "content": "I think it works extremely well - very readable and a nice look - at these sizes. My only question would be about normal text sizes, which I guess is 10-12 point. Adobe calls 8 pt and below 'caption' size, and has a different weight. I would suspect that some changes - such as longer ascenders? - will help are normal text size. My feeling is that the spacing can be improved also, but I can't tell you how.   \n   \nOverall, I think it is an outstanding effort.   \n   \nOn my PDF (I am viewing on a PC), the H and x have white gaps, but the print-out is ok, without gaps.\n\n"
    },
    {
      "time": "25 Oct 2004 — 7:12am",
      "content": "Very nice.   \n- figures: slightly increase the sidebearings, making their spacing a bit looser;   \n- C: it looks a bit out of place, especially when compared to G and O;   \n- K/R: give their legs a little more space.\n\n"
    },
    {
      "time": "25 Oct 2004 — 8:34am",
      "content": "Beauty. Well done Kris. I'd gladly read a book set in Feijoa.   \nGive us the phonetic way to say this properly!   \n   \nOne random thought: take another look at the modulation on the   \nquestion mark. It seems a little too monoline to me.   \n   \n\\> Little white bits   \nThese are no problem, just need to merge the shapes before   \noutputting the final font. There are other spots, w and x for example.   \n   \nWill this be opentype? (how will you be handling your ligs?)\n\n"
    },
    {
      "time": "25 Oct 2004 — 11:36am",
      "content": ""
    },
    {
      "time": "25 Oct 2004 — 12:16pm",
      "content": "Looks very professional.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Oct 2004 — 3:02pm",
      "content": ""
    },
    {
      "time": "26 Oct 2004 — 3:36am",
      "content": ""
    },
    {
      "time": "26 Oct 2004 — 6:47am",
      "content": "\\>sounds like a lot to start with   \n   \nAt the 'Making Faces' seminar a few weeks ago in New York, when someone asked about the proliferation of styles and weights in type face families, David Berlow of the Font Bureau said \"You know, we didn't start this.\" In other words, the demand came from clients.   \n   \nI really think that having a variety of weights and styles, as well as optical variations, as Adobe has done, gives a face an edge over others for designers, as it becomes so adaptable to different challenges. So I think the variety you talk about is a good idea.   \n   \nAlso by all means complete and include your display version, which you have already. Having this for subtitles to titles and even 'poster' is great, and gives you an edge, particularly because the display is so good.   \n   \nAs to what to do first, and how to market it, I think this is something that a font publisher can tell you best, because they know the market. Maybe the best thing is to approach them with what you've got, and see what they suggest.   \n   \nI agree with Aaron about the top of the g being slightly too heavy, but not about the k. When I printed it out (1200 dpi laser printer), the gap actually closed in the text size, and in any case it harmonizes with your other opened letters, bpq.\n\n"
    },
    {
      "time": "23 Jan 2005 — 1:05am",
      "content": "Well folks, I am just about to move to another city, so now is a great time to post the latest Feijoa. I have loosened the spacing overall, redesigned some of the caps: K, R revised some of the lc, especially k, x. The numerals have been redesigned, some ampersands added, and the small caps fixed. This version is for text/reading, 12pt and below. All of the weirdness that used to be in it has been saved and juiced up for the display version. I am yet to finish the display, as well as the italics and bold. One day, one day.\n\n<!--attachment: Feijoa0_4_1-63510.pdf*mime_pdf.gif*application/pdf*51.2 **Feijoa0%2e4%2e1%2epdf --><!--attachment: Feijoa0_4_1-63510.pdf*mime_pdf.gif*application/pdf*51.2** Feijoa0%2e4%2e1%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20130818211058im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20130818211058/http:/www.typophile.com/forums/messages/29/Feijoa0_4_1-63510.pdf\" target=\"_blank\"><b>Feijoa0.4.1.pdf</b></a> (51.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "23 Jan 2005 — 3:36am",
      "content": "Kris, excellent work; you''re really going places with this one.   \n   \nthis may just be kerning issues, but look for the word \"unserviceable\". It seems to have some difficulties towards the end of the word, specifically between the a and b, especially after the \"cea\" combo.   \n   \nThe sticky-outy-bit (enlight me, please!) of your lc r seems a bit dark. perhaps changing the angle at the top-right of the sten may fix that...   \n   \nWell, there are my two cents. They might be those old ones you can't use anymore, or be like 1 yens which aren't really worth anything. Yeah.   \n   \nanywya, looking good bro. There is an ocean or jungle or top desk drawer or something of detail going on in there. :-)   \n   \n- Chris\n\n"
    },
    {
      "time": "24 Jan 2005 — 10:31am",
      "content": "The body of the \"b\" is too large.   \nThe \"g\" and \"t\" seem too plain.   \nSome of the ampersands are malformed.   \nThe \"?\" needs more stroke contrast.   \nI think those deep descenders on the smallcaps could spell trouble.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jan 2005 — 7:41am",
      "content": "I think I prefer the lesser contrast on your earlier PDF, but I am relying on my laser printer. Probably you ought to get a printer to do an offset version to see it under the real conditions, and make your decisions accordingly.\n\n"
    },
    {
      "time": "19 Aug 2005 — 3:33am",
      "content": "\"The monocular form is too modular with respect to the rest of the alphabet. It is very legible, but does not contribute much divergence to boumas. The conventional, closed binocular form is richly divergent, but it's way too complex - it violates the \"rules of belonging\" of the Latin alpahabet too strongly\"\n\n:) that's one way of putting it. And another is that the older form has a unique x-height area and a unique descender form and this \"divergence\" breeds readability...\"violates the \"rules of belonging\"...not.\n\n"
    },
    {
      "time": "19 Aug 2005 — 10:01am",
      "content": "People can get used to anything. But that doesn't mean it doesn't affect them. I'm used to the traditional closed-bottom binocular \"g\" myself, and didn't realize there was anything wrong with it until I started seriously thinking about the Latin alphabet. But just look at it. It's almost an oriental logograph. Formally, I would point out that its topology is way more complex than any other lc letter; and in the entire alphanumerics only the \"B\" matches it, and at least the \"B\" has the two counters abutting - the \"g\" has a link on top of everything. Anecdotally, I would point out that this \"unnatural\" complexity is what makes it so hard to draw well, with many competent designers failing when they come to it (eg Matrix). It's especially hard to get a double-\"g\" not to form too strong a pattern that ruins the texture (affecting immersive reading). So it's not a legibility issue (almost anything is legible) it's an issue of standing out too much, and by itself. Don't get me wrong, I think complexity is da bomb - but it has to be balanced - and I feel that the open-bottom binocular form is the ideal (general) balance.\n\nhhp\n\n"
    },
    {
      "time": "13 Apr 2006 — 4:37pm",
      "content": "What's the current state of Feijoa? The preview of the display cut [over here](http://web.archive.org/web/20130818211058/http:/www.klim.co.nz/content/type/feijoa_01.html) looks really great. I have a number of uses I can think of for Feijoa so I'm hoping that it'll be released someday a licensable set of fonts.\n\n"
    }
  ]
}
