{
  "id": "44878",
  "title": "experience with Baskerville Book?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Can anyone tell me about the differences (if any) between the Adobe version of Berthold Baskerville Book and the BQ version? I'm currently using the Adobe (for book text, 11/15), but I need OsF and real small caps, so I want to buy the expert fonts that include them. I'm wondering if I should just buy the expert add-ons, or whether the BQ version of the rest of the font would be worth it, too. I'm wondering, is the kerning any better? Are there additional ligatures? Also, I find the em-dash on this font to be quite small. My proofreaders mistake it for an en-dash, and I've had to swap out the em-dash for another font. I wonder if it's any bigger in the BQ version.\n\nI tried emailing the US Berthold vendor, but they don't respond.\n\nMany thanks!  \nHeather\n\n",
  "author": "metroave",
  "time": "1 May 2008 — 5:38am",
  "uid": "30384",
  "comments": [
    {
      "time": "3 May 2008 — 1:41pm",
      "content": "I actually think the BQ version's emdash is shorter than Adobe's. If you're shopping for Baskervilles, I recommend taking a serious look at Stormtype's [Baskerville](http://web.archive.org/web/20131017110851/http:/www.stormtype.com/typefaces-fonts-shop/families-22-baskerville-original) and [Baskerville 10](http://web.archive.org/web/20131017110851/http:/www.stormtype.com/typefaces-fonts-shop/families-77-baskerville-10-cyrillics).\n\n"
    },
    {
      "time": "3 May 2008 — 7:34pm",
      "content": "What about Adobe's OpenType version of ITC New Baskerville?...crisper, bigger, more contrasted, and thus more legible than the lower-contrast Baskervilles from Storm, fine as those families are. And the Adobe OT version gives you full glyph coverage, including OSFs, and better kerning, on the whole. I've always preferred the more contrasted Baskervilles over the less contrasted ones...just wears better for reading.\n\n"
    }
  ]
}
