{
  "id": "44904",
  "title": "Typography for the older folks",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Imagine yourself in a mediocre retirement community surrounded by peeling pastel wallpaper enjoying a game of bridge with a tall, cold \"pink lady\" (a mixture of orange and cranberry juice). Picture painted?\n\nI am trying to find a typeface to communicate that you're not throwing in the towel or losing your self-worth when entering a retirement community but simplifying your lifestyle and joining a support system. Currently, most retirement home identities resemble a combination between a funeral home and a suburban subdivision. It should be comforting and inviting and maybe even a bit exciting. these are human beings with life in them, not beige cookie-cutter ranch houses with 2 door garages.\n\nOne thing that I am hung up on is generational differences. In this tough decision making process, what speaks to baby-boomers opposed to generation x? is there a timeless answer?\n\nJust keep in mind that old people can't read. Kidding, I love you granny.\n\nAny ideas?\n\n",
  "author": "papercoversrock",
  "time": "1 May 2008 — 3:05pm",
  "uid": "30407",
  "comments": [
    {
      "time": "6 May 2008 — 6:44am",
      "content": "First, lose the condescending attempts at wit, whippersnapper.\n\nMake sure you don't fall in the pithole of using type in too small a size. Older people will want bigger text, online and in print. This doesn't mean 24 point like in large-type books, but keep away from the very small type.\n\nDon't design for end of life ... design for ease of life ... retirement is payback for the hard work of 40 years. Keep it clean and open, show some quality, but not wanton wasteful luxury.\n\n"
    },
    {
      "time": "6 May 2008 — 8:38am",
      "content": "\"I am trying to find a typeface to communicate that you’re not throwing in the towel or losing your self-worth when entering a retirement community but simplifying your lifestyle and joining a support system\"\n\nMethinks you're maybe putting way too much pressure on a typeface to carry that message by itself.\n\n"
    },
    {
      "time": "6 May 2008 — 9:56am",
      "content": "I am not in retirement yet, but I noticed very recently that my eyes are giving up... If I put myself in the shoes of these folks you mentioned, I suppose - it happens to me - people don't want to pick the glasses when playing cards, but some would pick up the glasses to read.\n\nIf you can, make the smaller type to 10 pt, the smallest... and use antiques, you know, Windsor or so...\n\n"
    },
    {
      "time": "8 May 2008 — 5:05am",
      "content": "I agree with Darrell that you probably are relying on the typography too much and neglecting the other aspects of design - we all know that the feel is determined by the sum of all elements combined.\n\nThat beeing said I agree with the points on typesize and legibility. I would probably suggest a Scotch for its large x heights which in my view results in an easier read (ps: I'm dyslexic). One example of a nice Scotch is H&FJ Chronicle.\n\n"
    },
    {
      "time": "8 May 2008 — 5:20am",
      "content": "As an old fart myself, I find it odd that we are suddenly dumped into a catagory that erases all former appreciation for typography. I don't think there is such a thing as a geezer font. Make a decent layout with good type. Perhaps avoid the grunge stuff or anything stressed out but any reputable text face should work.\n\nChrisL\n\n"
    }
  ]
}
