{
  "id": "44909",
  "title": "Funky Sans - up for crit",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi everyone,\n\nThis is my very first attempt at a typeface, and it was inspired by some hand lettering I did for a logo. I know there's still a lot of tweaking to do, and I would love love love any feedback!\n\nThanks in advance!\n\nCassie\n\n ![](http://web.archive.org/web/20130819220241im_/http:/typophile.com/files/Picture44_3560.gif)\n\n ![](http://web.archive.org/web/20130819220241im_/http:/typophile.com/files/Picture45_5918.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 45.png](http://web.archive.org/web/20130819220241/http:/typophile.com/files/Picture%2045.png) | 50.41 KB |\n| [Picture 44.png](http://web.archive.org/web/20130819220241/http:/typophile.com/files/Picture%2044.png) | 108.99 KB |\n\n",
  "author": "Cassie",
  "time": "1 May 2008 — 8:45pm",
  "uid": "20665",
  "comments": [
    {
      "time": "1 May 2008 — 10:56pm",
      "content": "PS one of the things I'm having an issue with is the g. The y is also a little wierd in that its descender is not as long as it should be. Would it make sense to have the g and y have one descender length and the p, q and j have another?\n\n"
    },
    {
      "time": "2 May 2008 — 11:46am",
      "content": "I think you have a really nice start. Just a few things I really noticed:\n\n- the e, k, o, v, w, x, z are the same thickness throughout the letter, and the other letters have some variations. They seem to be from a different typefaces, at least to me.\n\n- the w also seems a little wide and leaves a really bad space in the word \"anyway\" that I do not believe you could fix with kerning pairs.\n\n- maybe the t works better at smaller sizes but at the size you provided it seems to drop below the baseline too much.\n\n- the fl ligature looks odd where the ball in the f and the l collide. The purpose of ligatures is to really make the transition smooth and elegant.\n\n"
    },
    {
      "time": "2 May 2008 — 2:20pm",
      "content": "The bottom of the y seems a little clunky.\n\nCan you show us how you see this being used? Intended use will have a great deal of impact on the direction you would want to take this. The clearer you are about this the better the face will be.\n\n"
    },
    {
      "time": "2 May 2008 — 6:28pm",
      "content": "Thanks for the feedback.\n\nHere's the original logo (color) that I did, and then a version of what it would look like now that I've actually spent time on the letterforms (b & w). It would also be used as a display type on stationery and collateral. I'd really like it to be legible/readable at text sizes, although I know it won't be able to get too small since it is a little funky.\n\nMichael: I know, I really struggled with that fl ligature. But I looked at a lot of other fonts with ball terminals, and that seems to be how the fl is treated. Any suggestions?\n\nThanks again.\n\n ![](http://web.archive.org/web/20130819220241im_/http:/typophile.com/files/Picture46_5980.png)\n\n"
    },
    {
      "time": "4 May 2008 — 8:36am",
      "content": "I'm not sure the angled terminals on bdhklmnpqru go with the bouncy feel of the rest - it's like a combination of X-Acto blades and bubbles - but the difference I suppose adds to the liveliness. I would experiment with the m, n, and r at least.\n\nIf y is giving you trouble: did you consider doing a y that is u-shaped with a curving descender instead of the diagonal form?\n\nI agree that the fl ligature isn't working - I would abandon the idea of a ball terminal on a line that's not actually terminal.\n\nI think all of your ligatures need to be spaced out more.\n\nI like this font - it's fun. It says to me: Las Vegas, The Price is Right, Sherwood Schwartz shows, 60s stewardesses, Acapulco honeymoons.\n\n"
    },
    {
      "time": "4 May 2008 — 2:30pm",
      "content": "Below is an image from Gerrit Noordzij's \"the stroke\". The purpose of the image is to show how easy it is to break up a word and make it hard to read by making the space between letters stop relating to the counter-space or space inside letters. I suggest that you look at the white spaces and get them to start to balance. In general your interletter space is too small to be comfortable. As letters get physicaly ( optically really ) larger you can let them come together a bit more and you might need to add space at very small sizes. But in even in these cases this 'rule' still applies just to a different degree. You might have to make your counters smaller ( they are very big) as well as adding space between letters. Doing this will make the massive gap between y+w less bad but you should also fix that - probably by making the angles of the diagonal steeper.\n\n ![](http://web.archive.org/web/20130819220241im_/http:/typophile.com/files/whitespace_6611.jpg)\n\n"
    },
    {
      "time": "28 May 2008 — 4:18pm",
      "content": "I've made some progress, and put together a specimen sheet. I don't have any time to change the letterforms for now, but do you see anything I could change about the specimen to really improve it?\n\nThanks for all the feedback!\n\nCassie\n\n ![](http://web.archive.org/web/20130819220241im_/http:/typophile.com/files/Picture28_3627.gif)\n\n"
    },
    {
      "time": "29 May 2008 — 9:56am",
      "content": "Sometimes, in words such as \"exotic\", there isn't enough flavor to carry the word. I wonder if this isn't one of those times where more is better. For instance, should the o have a tiny loop? Should the n have a tail? Should the b and d have curls? I guess why not a little more character on all the blank letters?\n\nThe it ligature isn't working for me. It looks almost like an ampersand when small.  \nThe ri ligature isn't working for me either.\n\n"
    }
  ]
}
