{
  "id": "4493",
  "title": "Western / Circus & Kill Bill V.2",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I saw Kill Bill 2 tonight and noticed during the film, a font on a set of outdoor chairs which said \"SOL\".   \n   \nThe font in particular was a beautiful circus/western blend - I undertand this would have been hand rendered, and I am unable to find an example.   \n   \nIf anybody does have any shots from this film, of this type - could you please respond.   \n   \nI would like to use the same style for a logo I am working on. Once I saw it, I knew it would be perfect.   \n   \nWhile on the subject of fonts used for circus's. Does anybody know the historical information behind the use of fonts used for circus's?   \n   \nmwah\n\n",
  "author": "gareth",
  "time": "Tue, 2004-04-27 08:52",
  "uid": "3514",
  "comments": [
    {
      "time": " Tue, 2004-04-27 09:05",
      "content": "What scene were the chairs featured in?\n\n"
    },
    {
      "time": " Tue, 2004-04-27 17:14",
      "content": "\\> When Uma goes to the brothel, not to give away too much.\n\n"
    },
    {
      "time": " Tue, 2004-04-27 17:29",
      "content": "damn that tarantino. he should include font designs in his credits!\n\n"
    },
    {
      "time": " Tue, 2004-04-27 17:44",
      "content": "I have to say, though I liked both volumes of Kill Bill, I thought the typography was a disaster. I understand he's trying to evoke the flavor of various film influences, as he does in making the movies themselves. But to the filmmaking end, with the exception of one segment, he uses the influence and makes a better scene than what inspired him.   \n   \nNot so the type. Rather than create a pastiche of typefaces inspired by his source material -- and subtly improve on the originals -- he's created a mishmash. I cringed every time type showed up. The end credits at least had something of a classic look, but he didn't even do those well (hello, megadots!), and it was right on the heels of another credit sequence that used a completely different typeface.   \n   \nI don't know how he managed to use a typeface we couldn't identify, though. Maybe it's a Corel font.\n\n"
    },
    {
      "time": " Tue, 2004-04-27 19:31",
      "content": "Yes indeed, the font (written as SOL) features in the scene when Uma visits the brothel in Mexico. The chairs are scattered around the place, all with the same word \"SOL\" written on them.   \n   \nSo if you have a digital camera and go see it. If you take a shot of this font and post it, I will be ever so happy.   \n   \nI think that maybe the font choices Tarintino made throughout KILL BILL were meant to be schitzophrenic and badly done. And were not meant to distract from the cinematography - the same way type used to be treated in film - badly.   \n   \nmwah\n\n"
    },
    {
      "time": " Tue, 2004-04-27 20:33",
      "content": "The same way the films were made, badly...   \n   \nthe guy is washed up. All he can come up with these days is lame pastiche, typographically or otherwise.\n\n"
    },
    {
      "time": " Tue, 2004-04-27 21:04",
      "content": "I thought I'd include pictures from the first movie here since we're discussing type in Kill Bill. I would have liked to have included them in the last thread on the titles but that thread is already archived. (Yves, please move this somewhere else if it's inappropriate here). I hope they will help visualize the type for those who have not seen the movie or do not plan to. ![:-)](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nThese opening credits switched from on typeface to another and back again.   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34505.jpg)   \n  \nShaw Brother's Logo. Lifted directly from these old films. Probably custom.   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34506.jpg)   \n   \nTo me that looks like Century Gothic   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34507.jpg)   \n   \nBusorama   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34508.jpg)   \n   \nFritz Quadrata Bold ?   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34509.jpg)   \n   \nNo Idea   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34510.jpg)   \n   \nPalatino   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34511.jpg)   \n   \nCentury Gothic Bold (?)   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34512.jpg)   \n   \nCan't make it out. Maybe Palatino Bold\n\n"
    },
    {
      "time": " Wed, 2004-04-28 00:26",
      "content": "The \"Kill Bill\" in nasty small caps looks like Bookman (although the weight looks somewhere between ITC's Demi and Bold weights). I'd bet that your last sample is also Bookman.   \n   \nKeepin' it old school with type straight outta the original LaserWriter 35, yo...\n\n"
    },
    {
      "time": " Wed, 2004-04-28 00:34",
      "content": "Well, as someone who knows little about film and directing, I will refrain from commenting on the ability of Tarantino as a director.   \n   \nmwah\n\n"
    },
    {
      "time": " Wed, 2004-04-28 08:27",
      "content": "I have found the source of the font I am looking for. It is from a Mexican Beer called \"SOL\".   \n   \n [www.sol-beer.de/](http://web.archive.org/web/20050516143301/http:/www.sol-beer.de/)   \n   \nmwah\n\n"
    },
    {
      "time": " Wed, 2004-04-28 11:01",
      "content": "I think Avant Garde (yuk) for the sans serif   \n   \n [http://www.myfonts.com/fonts/ef/itc-avant-garde-gothic/avant-garde-ef-book/testdrive.html?s=Revenge+is+a+dish+best+served+cold.&p=48](http://web.archive.org/web/20050516143301/http:/www.myfonts.com/fonts/ef/itc-avant-garde-gothic/avant-garde-ef-book/testdrive.html?s=Revenge%2Bis%2Ba%2Bdish%2Bbest%2Bserved%2Bcold.&p=48)\n\n"
    },
    {
      "time": " Wed, 2004-04-28 17:12",
      "content": "I guessed Avant Garde, too, in that original post last month. But I think James is right with Century Gothic. The closed 'R' and the circular dot on the 'i' give it away. From what I recall, Monotype made Century Gothic to match the look and metrics of Avant Garde, much as they did with Arial to match Helvetica.\n\n"
    },
    {
      "time": " Wed, 2004-04-28 18:07",
      "content": "IIRC, Century Gothic is Monotype's [Twentieth Century](http://web.archive.org/web/20050516143301/http:/www.myfonts.com/fonts/agfa/twentieth-century-mt/) [itself a knockoff (or close-to-knockoff) of Futura] redrawn to match the metrics of [ITC Avant Garde Gothic](http://web.archive.org/web/20050516143301/http:/www.myfonts.com/fonts/linotype/itc-avant-garde-gothic/).\n\n"
    },
    {
      "time": " Thu, 2004-04-29 06:16",
      "content": "I'd say the font treatment is deliberate. The horrible spacing of the title, the use of multiple fonts... the B movies he loves probably did the same thing.\n\n"
    },
    {
      "time": " Sat, 2004-05-01 01:01",
      "content": "While we're on the subject of Kill Bill type, I'm wondering whether anyone reading this thread can pick the font from the credits at the end of Kill Bill 2...   \n   \nbtw, I already asked this in a previous post. Tiffany suggested Emigre's Arbitrary as similar (although not the same), and I'm intrigued by the similarity also to Busorama. Any new-fangled Art Decophiles out there??\n\n"
    },
    {
      "time": " Sat, 2004-05-01 01:04",
      "content": "Hmm, let me try that attachment again...   \n   \n ![Kill Bill 2 End Credits](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34845.jpg)\n\n"
    },
    {
      "time": " Sat, 2004-05-01 04:08",
      "content": "i love those \"L\"s in the image above that says \"KILL BILL\"\n\n"
    },
    {
      "time": " Sat, 2004-05-01 06:21",
      "content": "Bodega Sans gets you close...   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34854.jpg)\n\n"
    },
    {
      "time": " Sat, 2004-05-01 10:26",
      "content": "Let me point out the sample from Vol. 2 above seems to be the wrong aspect ratio, and seems unnaturally compressed. I don't remember it being so compressed when I saw the film. This better approximates what I saw.   \n   \n ![](http://web.archive.org/web/20050516143301im_/http:/www.typophile.com/forums/messages/83/34857.jpg)   \n   \nA more detailed analysis (with better screenshots) of Kill Bill Vol. 2 type will likely only be possible with better screenshots with the release of the Vol.2 DVD.   \n   \nAs for the sample, it's strange. It has the flavor of a Florentine inspired face like Ghiberti or URW Florentine. Neither match though even when modified.\n\n"
    }
  ]
}
