{
  "id": "44930",
  "title": "Logo for Advertising, PR Agency",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I work at an agency that has been around for over 21 years. The current logo was developed 12 years ago. The logo fits with our semi slogan \"Juggling Experts\" as we explain to our clients how we help them juggle the 4 P's of marketing. This serves as an excellent metaphor and selling tool for our sales leads.\n\nWe feel like the current logo does a decent job of conveying our whimsical/creative yet organized environment (e.g. our employees bring their dogs to work, and the dogs are free to roam the office, we're a little different from your typical agency). However, we are currently reviewing our logo to determine if an update is needed, considering the cost (easily $10K) to convert all of our material (business cards, web site, letterheads, etc.) to a new logo.\n\nWe would like some more outside, honest opinions and reactions to our logo.\n\nDoes it make you want to know more about our company?  \nIf you didn't know what we do, what industry would you think we were in?  \nWhat does it remind you of initially?  \nDoes it seem up to date?  \nDoes it convey what we do?  \nDoes it inspire intrigue or confusion?  \nIs it too simple, silly, serious, corporate, common, or complicated?  \nWould it look better with a simple change in font or color scheme?\n\nWe would love your thoughts, suggestions, and criticisms. Should we keep it the same and save some serious cash?\n\n ![](http://web.archive.org/web/20140829053213im_/http:/typophile.com/files/dca_logo_5911.jpg)\n\n",
  "author": "ColtonMul",
  "time": "2 May 2008 — 2:22pm",
  "uid": "30442",
  "comments": [
    {
      "time": "2 May 2008 — 2:38pm",
      "content": "Just as a quick gut-reaction, I'd say the name is the bigger issue. I read DCA/DCPR as the focus which means absolutely nothing to me nor is it very memorable.\n\nI like the ball. Maybe emphasize that while downplaying the big acronym:\n\n ![](http://web.archive.org/web/20140829053213im_/http:/typophile.com/files/dc_5725.gif)\n\nThe sample is just to show scale (ie, type was just slapped on there).\n\nThat said, I have no idea how much name recognition/equity you might already have in that acronym.\n\n"
    },
    {
      "time": "2 May 2008 — 3:44pm",
      "content": "I agree that the acronym is a bit long, but I bet the clients, in and around his locale, have taken care of that. I.e. they probably have shortened it to DCA when they talk of their agency. When I started at a type house in 1981 the names we called customers did not even resemble their real identity. WE know, but how forthcoming is DA Design. It certainly is not obvious to the casual onlooker who DA is on first blush.\n\nThe bottom line for me is the letterforms. They are fun, but maybe a bit too fun. About 3 hours on the board, I am old fashioned, and you could lend some credibility to the forms and keep the playfulness but at the same time add some integrity to them. The colors... well the beach ball kind of dictates that unless you went with more mature colors... but does that defeat the purpose of the youth ethos?\n\nI am so tired of Agencies who use letterspaced, boring, tried and trued, over-used fonts for their ID. Have some fun if it is called for. That is my calligraphic slant coming out! But make it above reproach!  \nMichael\n\n"
    },
    {
      "time": "2 May 2008 — 4:35pm",
      "content": "A question worth considering: Are the hand-scrawled letters AND the bright colors AND the ball trying TOO hard to say \"playful\"?\n\n"
    },
    {
      "time": "2 May 2008 — 5:30pm",
      "content": "Yup... that was what I was trying to say. Hence the restructuring of the letters & possibly changing the colors. I would keep the ball!\n\nMichael\n\n"
    },
    {
      "time": "2 May 2008 — 6:33pm",
      "content": "The ball looks great, but the type needs to change. Keep the fun, of course, but juxtapose with a little mullet principle: business up front, party in the back.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "5 May 2008 — 6:23am",
      "content": "Thanks for the comments folks, keep the them coming, we really appreciate your input!\n\n"
    },
    {
      "time": "5 May 2008 — 6:43am",
      "content": "Do the A and PR stand for Advertising and Public Relations? If so, the taglines underneath seem redundant.\n\nIn other words, if DCA means DC Advertising, looking at it now it reads as DC Advertising Advertising.\n\n"
    },
    {
      "time": "5 May 2008 — 3:41pm",
      "content": "Yeah, its advertising and public relations. I see what you mean. Thanks for the input.\n\n"
    },
    {
      "time": "6 May 2008 — 4:32pm",
      "content": "any progress?\n\n----------  \n**Paul Ducco**  \n [Motion Graphics](http://web.archive.org/web/20140829053213/http:/www.solid-creative.com/motion.htm)\n\n"
    },
    {
      "time": "8 May 2008 — 9:31am",
      "content": "Does your company do anything international? Are your current colors perceived in a positive or negative manner in different countries? At first glance, this logo looks like it would belong to a Jamaican beach resort. I like Aluminum's idea of downplaying the dated acronym and putting more emphasis on the ball.\n\n"
    },
    {
      "time": "8 May 2008 — 11:28am",
      "content": "I hate to say it it seems educational and way tooo young.\n\n"
    }
  ]
}
