{
  "id": "44944",
  "title": "Agate lines",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Anyone know why Mac apps don’t allow you to spec vertical layouts in agate lines? I’m doing a gig that involves making up a lot of newspaper ads, and I’m constantly having to translate them into inches or picas. Made a slip the other day that could’ve been a big deal if I hadn’t caught it.\n\n [‹ Typeface design education](http://web.archive.org/web/20081007001909/http:/www.typophile.com/node/44922 \"Go to previous forum topic\") [How my friends found out about my acceptance to college ›](http://web.archive.org/web/20081007001909/http:/www.typophile.com/node/40224 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007001909/http://www.typophile.com/user/13035\" title=\"View user profile.\">elzadra</a>",
  "time": "<br>",
  "uid": "13035",
  "comments": [
    {
      "time": " 3.May.2008 12.00pm",
      "content": "Quark XPress does allow the use of agate lines on the Mac, but Adobe apps don’t use it anywhere, and I can’t think of any other apps that do off the top of my head.\n\nIn the US, newspapers or magazines don’t still spec agate lines exclusive of any other measurement, and it’s certainly a unit (like most typesetting-specific terms) that has been in decline ever since DTP started taking off in the 80s.\n\nConsumer classifieds use per-word or per-character charges, and commercial space is generally specced by specific dimensions that are a fraction of the page or of a column (and specced primarily as inches or metric on the rate sheet), rather than allowing advertisers to buy arbitrary numbers of agate lines or column inches. That makes it easier to swap ads around on the newspaper’s side, and to drop in preexisting PSAs or in-house ads for any unsold space at the very last second.\n\n"
    },
    {
      "time": " 3.May.2008 12.15pm",
      "content": "Hm. I’m not working in the U.S., so maybe that accounts for it. Montreal papers, both English and French, still use agates. I imagine I’ll be converting them yet for awhile.\n\n"
    },
    {
      "time": " 3.May.2008 1.28pm",
      "content": "Interesting, they use agates but don’t even have a metric equivalent already listed? That’s amazing, how do they deal with all the small businesses out there that create their own ads and don’t have any idea what an agate is?\n\nI’m surprised Adobe hasn’t supported agate as a unit if its still commonly used anywhere, particularly Canada which is such a huge market. I know they support custom units, have you tried that?\n\nOh, wait, I just checked and it seems agate units were added in InDesign CS3! I was trying to see how the custom units were specced and there it was, and google confirmed agates were just added in CS3, so now you have an excuse to upgrade :D\n\n"
    },
    {
      "time": " 3.May.2008 5.37pm",
      "content": "Hi there\n\nNat’s absolutely right about this. Yet another reason to go CS3. It came up in class the other week, and I admit I was suprised to see agates there in the measurement preferences – none of the current students seem to have the slightest interest in newspaper work.\n\n ![](http://web.archive.org/web/20081007001909im_/http:/www.typophile.com/files/Picture-2_6088.jpg)\n\n"
    },
    {
      "time": " 3.May.2008 9.14pm",
      "content": "Do they still use agates much in NZ, Ben?\n\nI loved working on newspapers, but that was my first job. It was great to see results the next morning, plus there was such a huge volume that I could experiment and play around a lot. Some of that coolness has probably been replaced for students by the instant gratification of the Web, but there’s something special about being able to hold it in your hand.\n\nThere’s certainly no faster way to learn about dot gain and ink behavior than on high-speed newsprint :)\n\n"
    }
  ]
}
