{
  "id": "44987",
  "title": "squaresoft/square co logo font?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20150421234922im_/http:/typophile.com/files/squaresoft_2_3578.png)\n\nhi there. square-enix (japan-based videogame company) used to be known as square co, producing games primary under the label \"squaresoft\" (most of the time logo's on one line).\n\nwhat is the font used for this logo? the logo for \"square\" is the same minus the \"soft;\" both had the triangle area under the 'A' filled with red. if this is a completely custom font, who designed it and where can i buy it? if this is a modification of an existing font, what was the base font? if it was simply some vector/postscript logo made in illustrator, coreldraw, or some other vector art app, i'd be disappointed but at least i'll be glad to find out from where this logo came. i personally think it started out NOT italicized, but that's just my opinion...\n\n(the intended usage is for one of my logos)\n\n",
  "author": "neologix",
  "time": "5 May 2008 — 9:05am",
  "uid": "30561",
  "comments": [
    {
      "time": "5 May 2008 — 9:49am",
      "content": "First off this is a hideous logo.\n\nThat aside, it's obviously a mangled font, a bold geometric sans probably. I suspect along the lines of Trade Gothic, Franklin Gothic, News Gothic or Basic Commercial. It's hard to say exactly since every letter was altered, then skewed and smooshed. It's also possible that the Q and O are just circles and the A a triangle, all of which were not part of the base font.\n\nAside from the atrocities this poor font was put through, I'm impressed a game developing powerhouse would have kept and continued to use this logo for any amount of time. Then again, it was probably made by the president's daughter.\n\n"
    },
    {
      "time": "5 May 2008 — 3:13pm",
      "content": "to be fair, the image was created by myself using a fan-made font (NOT made by myself) that only had the letters contained in \"Squaresoft\" for lowercase and a mangled runic mt condensed for the uppers. that being said, yes, the O and Q are supposed to be circular, but the fan font was apparently made more poorly than i had anticipated. the actual logo that appears on their graphical materials is so much cleaner than this.\n\nunfortunately, none of the fonts you suggested quite match up to the 'R,' 'E,' and 'F' that to me is probably the visual trademark of the font. my very first research long ago turned up one of the \"futura\" family as a possible base, but that was a dead end as well.\n\n"
    },
    {
      "time": "6 May 2008 — 3:26pm",
      "content": "The real logo:\n\n[http://slogo.ffsky.cn/squaresoft.gif](http://web.archive.org/web/20150421234922/http:/slogo.ffsky.cn/squaresoft.gif \"http://slogo.ffsky.cn/squaresoft.gif\")\n\n- Lex\n\n"
    },
    {
      "time": "12 May 2008 — 11:05am",
      "content": "thanks lex for finding the actual logo. hopefully ppl will be able to get a better idea of what square originally intended (i guess).\n\nan update on my latest research into it: i contacted square-enix usa's marketing dept to see if they could point me to the original designer. the woman i spoke to said the japanese office might know. given that i neither speak nor understand even close to enough japanese to carry on a convo w/SE japan, i asked her to forward my request and contact info to them. i have yet to hear back from either office.\n\nas for the current square-enix logo, after WhatTheFont-ing it, i found out it's basically a mod of either bank gothic bt or banque gothique rr (either way, it's a mod; the Q and the E are the proof). i'm not really in the mood to use bank gothic for anything special, but still, one down, one to go...\n\nalex.rosario  \napollolux.digital.designs\n\n"
    }
  ]
}
