{
  "id": "44981",
  "title": "Monoxil Outliner",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20130820021555im_/http:/typophile.com/files/outliner_5725.png)\n\nhello. this is Monoxil Outliner, one of three font from my diploma project (along with [Klimax](http://web.archive.org/web/20130820021555/http:/typophile.com/node/44668) and Kakao). its design is based on the original [Monoxil](http://web.archive.org/web/20130820021555/http:/typophile.com/node/33307), which i made last year. i used that font only twice or so because it somehow didn't fit into anything :), but it worked quite [nice](http://web.archive.org/web/20130820021555/http:/www.urbanclash.sk/) with various outlines applied to it.\n\nso i decided to design a new font, especialy for use with outlines.  \n1. i changed the proportions a bit (the white spaces in B, E, F, P, R and S are the same size, so they close at the same time when you increase the thickness of the outline)  \n2. the ends of strokes are rounded  \n3. all sharp connections have a very small rounded curve in the corner, so there don't appear any ugly triangles sticking out ot the shape when the letter has a thick outline. (because it is not possible to choose the type of the connections of the outline for text in indesign)\n\nthank you for your comments. ondrej\n\n| Attachment | Size |\n| --- | --- |\n| [monoxil-outliner.pdf](http://web.archive.org/web/20130820021555/http:/typophile.com/files/monoxil-outliner.pdf) | 625.39 KB |\n\n",
  "author": "urtd",
  "time": "5 May 2008 — 6:44am",
  "uid": "17806",
  "comments": [
    {
      "time": "20 May 2008 — 2:31pm",
      "content": "This reminds me of neon tubes, and i like the way you've included in the font a solution to the InDesign stroke corners. It's clever to make a font with considerations for stroke width, closing up the counters evenly across different letters. I like the gap in the R and the wide m, s and c. Your o is refreshing. Good stuff! :)\n\n"
    }
  ]
}
