{
  "id": "45027",
  "title": "New and Improved Fonts! Font Diner Update!",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20110402213145/http:/typophile.com/user/7006 \"View user profile.\") : 6.May.2008 5.11am \n\nNew AND Improved? How can that be you say?\n\nFirst, what's New? . . .\n\nA few years ago we discovered that there was such an amazing variety of lettering artists who didn't know how to make fonts that we decided to start Sideshow, an offshoot boutique type foundry dedicated to releasing new exclusive display typefaces and collaborative type designs with talented lettering artists the world over.\n\nThis month, the Font Diner is pleased to announce these new exclusive faces just for you lucky mass e-mail subsciber pal! The first is called Coffee Service and whether you prefer Drip or Automatic, there is nothing quite like quality Coffee Service! This speedy retro script has a generous x-height and is Chock Full 'o OpenType automatic ligatures so it sets perfectly every time! One sip and you'll agree, there's nothing finer than Coffee Service! Check it out at: [http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-COSE](http://web.archive.org/web/20110402213145/http:/www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-COSE \"http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-COSE\")\n\nWe were also lucky to be flipping through the pages of one of our favorite books on the fine art of pinstriping called Pinstripe Planet when we discovered Tom Plate, Germany's own Von Dutch! He came up with a very slick and playful pinstriping inspired typeface called Savage Hipsters which is chock full of charm and retro slickness! Check it out at: [http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-SAHI](http://web.archive.org/web/20110402213145/http:/www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-SAHI \"http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-SAHI\")\n\nAnd finally no font collection would be complete without one Goofball in the bunch or perhaps TWO! Goofball is yet another wacky decorative typeface from our friend Squid. As with most of his art and font design, Goofball is derived from Squid's cluttered childhood recollections of greeting card and advertising lettering. Somehow it got all mushed together in his noggin and out came Goofball! Check out Goofball at: [http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-GOOF](http://web.archive.org/web/20110402213145/http:/www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-GOOF \"http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-GOOF\") and it's wacky offshoot Goofball Alernate at: [http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-GOAL](http://web.archive.org/web/20110402213145/http:/www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-GOAL \"http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=SIDE-GOAL\")\n\nOf course we're busy adding fonts to our Sideshow foundry all the time so be sure to check out the complete and ever growing library of these faces at: [http://www.fontbros.com/sideshow.php](http://web.archive.org/web/20110402213145/http:/www.fontbros.com/sideshow.php \"http://www.fontbros.com/sideshow.php\")\n\nNext, what's Improved? . . .\n\nWe've gone OpenType baby and we're not looking back!\n\nAs operating systems and design applications continue to be updated, the need for rock solid fonts that support these updated systems go hand-in-hand. Finally after years of requests, the Font Diner is happy to heed that call and has updated our entire font library to include the OpenType font format!\n\nWe knew you'd want to use the very latest font format available but you still wanted to be able to access classic versions of your favorite fonts for applications that aren't so kind to this new format, so we've included three versions of every font in one handy download. When you purchase any individual Silverware font or Font Set from us, you'll receive the platform specific versions of the fonts in Postscript, TrueType and OpenType format!\n\nAnd in case you're wondering, while we've finally updated the technical aspects of our fonts, no new fancy OpenType features have been added to them.\n\nSo there you have it! New fonts! Improved Fonts! And a chock full of news and new Homemade Specialties for you to sink your teeth into!\n\nCheck it all out at: [http://www.fontdiner.com](http://web.archive.org/web/20110402213145/http:/www.fontdiner.com/ \"http://www.fontdiner.com\")\n\nWarmly,  \nStuart\n\n",
  "author": "<a href=\"http://web.archive.org/web/20110402213145/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 6.May.2008 5.11am",
  "uid": "7006",
  "comments": [

  ]
}
