{
  "id": "45046",
  "title": "Table of Contents middots",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am setting up a table of contents that will have middots connecting items and page numbers (with apologies to Bringhurst); I’m wondering if there is some method I am not aware of that would allow me to have all of the dots set with perfectly consistent spacing, rather than doing it by hand (which yields imperfect results in addition to being intensely laborious). To further complicate matters, there will be, in some cases, a third column inserted into the center of the middots, which makes doing it by hand nearly impossible to do without creating a bunch of separate text boxes. Any ideas?\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.png](http://web.archive.org/web/20080704192831/http:/typophile.com/files/Picture%202_77.png) | 4.4 KB |\n\n [‹ Font recommandation, magazine design](http://web.archive.org/web/20080704192831/http:/www.typophile.com/node/45025 \"Go to previous forum topic\") [typewriter touch fonts ›](http://web.archive.org/web/20080704192831/http:/www.typophile.com/node/45069 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080704192831/http://www.typophile.com/user/25732\" title=\"View user profile.\">The Don Killuminati</a>",
  "time": "<br>",
  "uid": "25732",
  "comments": [
    {
      "time": " 6.May.2008 5.36pm",
      "content": "What application are you using?\n\n"
    },
    {
      "time": " 6.May.2008 5.52pm",
      "content": "InDesign.\n\n"
    },
    {
      "time": " 6.May.2008 6.01pm",
      "content": "Can’t you use tabs and assign tabular figures?\n\n"
    },
    {
      "time": " 6.May.2008 6.27pm",
      "content": "In InDesign, you can assign tab leaders to your line/paragraph. Using tab leaders make the characters that you “fill” space with set independently of the text... though I prefer to use TWO characters for my tabs, one period and one space (“. “) - makes the leader dots less dense (you can also track the letterspace on the tabs, but this is a little more work to keep consistent).\n\n ![](http://web.archive.org/web/20080704192831im_/http:/www.typophile.com/files/inD_5232.gif)\n\n"
    },
    {
      "time": " 6.May.2008 6.32pm",
      "content": "Tiff’s halfway there. What you want to do is create a tab and assign a “fill character”.\n\n"
    },
    {
      "time": " 6.May.2008 6.33pm",
      "content": "OK, missed Scott’s post. That’s it.\n\n"
    },
    {
      "time": " 6.May.2008 9.50pm",
      "content": "I meant that, I just didn’t finish my thought. By tabular figures I suggested this just if he really wanted the figures to line up perfectly.\n\n"
    },
    {
      "time": " 7.May.2008 9.21am",
      "content": "Got it. That makes a lot of sense. I was entirely unaware of the feature, but it’s certainly the right tool for the job. With both tabular figures and patience everything should fall into place.\n\nThanks so much.\n\n"
    },
    {
      "time": " 7.May.2008 9.35am",
      "content": "<cite>To further complicate matters, there will be, in some cases, a third column inserted into the center of the middots</cite>\n\nI guess you now got the general idea anyway, so just for the record:  \nThis is how one could set up the middle column.\n\n ![](http://web.archive.org/web/20080704192831im_/http:/www.typophile.com/files/tabs_4999.png)\n  \nThe first tab isn’t really necessary, but with that, you can easily control where the dots should begin. (You can do that by adding spaces, too – also for the two other tabs)\n\nThe ‘fill character’ is called exactly like that in the German version: ‘Füllzeichen’. In the English one, it’s ‘leader’. You can insert more than just one character, e.g. middot+space for a wider spacing.\n\nOf course, the second and the third tab can be left-aligned, too – as you please.  \nF\n\n"
    },
    {
      "time": " 7.May.2008 9.56am",
      "content": "That’s great — thank you. That is just the layout I’m looking to build, and I doubt I would have come up with that first tab on my own. Both section numbers on the left and page numbers on the right will have points/periods amidst the numbers, so that will also give me the opportunity to master the “align on” feature. It is still a bit cumbersome going, but I’m optimistic.\n\n"
    },
    {
      "time": " 7.May.2008 5.19pm",
      "content": "Don’t add spaces. Use a character style for your dot leader. I increase the tracking and the size slightly. If you use a character style for your dot leader, then you can play with it very easily until you get it “just right”. You can watch a video on this at lynda.com (InDesign Style Sheets). You can get a free trial subscription by going to lynda.com/deke. If you use InDesign extensively, the entire style sheet video is really good information.\n\n"
    }
  ]
}
