{
  "id": "45057",
  "title": "Generating opentype-font...",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello,\n\nWhen I generate a opentype-font, I get this alert (please look at the attached document).  \nWhy? How can I avoid that?\n\nThanks,  \nMorten\n\n| Attachment | Size |\n| --- | --- |\n| [alert, opentype font.png](http://web.archive.org/web/20140807065830/http:/typophile.com/files/alert,%20opentype%20font.png) | 91.17 KB |\n\n",
  "author": "morten",
  "time": "7 May 2008 — 1:45am",
  "uid": "2642",
  "comments": [
    {
      "time": "7 May 2008 — 4:11am",
      "content": "You probably have some errors in your kerning classes, is my guess. Check your left and right classes and see that there is no duplicates or errors.\n\n"
    },
    {
      "time": "7 May 2008 — 4:40am",
      "content": "Hey Goran,\n\nThanks. I have now tried to remove two kerningclasses, and now it works correctly!  \nBut: I need this two class-pairs. Must I rename them, or what??\n\nBest,  \nMorten\n\n ![](http://web.archive.org/web/20140807065830im_/http:/typophile.com/files/classes_5790.png)\n\n"
    },
    {
      "time": "7 May 2008 — 7:20am",
      "content": "You can't put the same glyph in two (or more) different kerning classes that are intended for the same kern pair position (i.e., left, right or both, as indicated with the check marks).\n\nIt seems like it would be much more helpful if FontLab gave you an alert immediately when you do this, rather than waiting until you have done it perhaps dozens of times and try to generate a font. My strategy is to be very deliberate and organized in the way I set up my kerning classes, which has other benefits as well.\n\n"
    },
    {
      "time": "7 May 2008 — 1:04pm",
      "content": "Morten,\n\nIn your example, you need to uncheck the right-side checkbox of the \\_kernA class. Then copy the contents of \\_kernA, paste them in the \\_A2 class, and add the AE glyph name to it. This will take care of half of the warning messages. To get rid of the other half you need to edit the classes \\_kernE and \\_E2 in a similar (though inverse) way.\n\nTo check for kerning classes' overlaps, you may want to use Karsten's [KLTF Check Kern Classes](http://web.archive.org/web/20140807065830/http:/www.kltf.de/kltf_otproduction.htm) macro, or try the button with a yin-yang sign in the Kerning Assistance dialogue.\n\n ![](http://web.archive.org/web/20140807065830im_/http:/typophile.com/files/kerning_assistance_5593.png)\n\n"
    },
    {
      "time": "9 May 2008 — 11:16pm",
      "content": "Hey Miguel,\n\nthanks a lot for your good instructions – I have now control  \nwith the stuff!  \nThanks again.\n\nBest,  \nMorten\n\n"
    }
  ]
}
