{
  "id": "4505",
  "title": "Typesetting mathematical formulas, fonts equiped with math symbols, and text figures versus titling figures",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all,   \n   \nI'm looking for fonts with extensive sets of mathematical notation. Know of any?   \n   \nAlso, I've been trying to decide if text figures are a good choice for mathematical/technical texts. For example:   \n   \ny = 3x   \n   \nI'm so used to seeing titling figures used in this situation that when I try using text figures, it looks very strange. I think having a height difference between numbers and variables is a good way to visually distinguish them. Also, the convention is to seperate mathematical formulas from the rest of the text, sort of the way you would a block quote. If you accept that convention, none of the arguments about titling figures disrupting the even texture of a block of text apply.   \n   \nThis leads me to consider mixing text figures and titling figures; test figures for numbers in blocks of text, and titling figures for formulas, but this looks inconsistent. How do others deal with this issue?   \n   \nAny good texts that cover mathematical typography?   \n   \nMatt\n\n",
  "author": "mattgilbert",
  "time": "27 Apr 2004 — 6:41pm",
  "uid": "3591",
  "comments": [
    {
      "time": "27 Apr 2004 — 10:06pm",
      "content": "Hi Matt,   \n   \nThere are not many choices for fonts with loads of mathematical symbols. Check these (TeX oriented) for some discussions:   \n   \n [http://www.ntg.nl/maps/pdf/21\\_18.pdf](http://web.archive.org/web/20131019055558/http:/www.ntg.nl/maps/pdf/21_18.pdf)   \n [http://home.vr-web.de/was/mathfonts.html](http://web.archive.org/web/20131019055558/http:/home.vr-web.de/was/mathfonts.html)   \n [http://www.yandy.com/products.htm#fonts](http://web.archive.org/web/20131019055558/http:/www.yandy.com/products.htm#fonts)   \n [http://www.micropress-inc.com/fonts.htm](http://web.archive.org/web/20131019055558/http:/www.micropress-inc.com/fonts.htm)   \n   \nThierry Bouche had some examples of using text figures in maths here:   \n   \n [http://tex.loria.fr/fontes/maths/cartan-english.html](http://web.archive.org/web/20131019055558/http:/tex.loria.fr/fontes/maths/cartan-english.html)   \n   \nIt's an attemp to reproduce the look of an older mathematical book which was set in Baskerville with text figures. Donald E. Knuth's _Concrete Mathematics_ was also set with a mixture of text figures and lining figures for different purpose. The other bit was that DEK used different fonts: his CM Concrete for text and Zapf's Euler for maths. Yannis Haralambous wrote an artilce (in French) on how he used Baskerville for maths -- the like is currently down for me, cannot confirm.   \n   \nI have started trying to set my current writing with text figures. The pages look quite nice with Minion, New Baskerville, and Euler in different run of course. Cronos+Euler looks quite handsome on a projector.\n\n"
    },
    {
      "time": "28 Apr 2004 — 5:35am",
      "content": "Here is a link to Yannis's Baskerville article:   \n   \n [http://omega.enstb.org/yannis/pdf/article-gut99.pdf](http://web.archive.org/web/20131019055558/http:/omega.enstb.org/yannis/pdf/article-gut99.pdf)   \n   \nHe used text figures in text as well as in maths. Flipping through a copy of _G. Polya'_s famous book -- _How to Solve It_ -- also shows that Baskerville with text figures was used; my copy was the Princeton University Press version from '88.   \n   \nMy question is: Does anyone know why Baskerville was used quite frequently in older textbooks in mathematics?\n\n"
    },
    {
      "time": "28 Apr 2004 — 2:44pm",
      "content": "\\> Does anyone know why Baskerville was used quite   \n\\> frequently in older textbooks in mathematics?   \n   \nMaybe there's a French connection? The French have always liked Baskerville, and for a while they were doyens of Math in the west.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Apr 2004 — 10:50am",
      "content": "Thanks for all your info. You've been really helpful.   \n   \nI'm still debating the virtues of text and titling figures in this context. I supposed there are no real rules to follow, only what works for the job.   \n   \nMatt\n\n"
    }
  ]
}
