{
  "id": "45061",
  "title": "1978 - please comment!",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "After doing some pixel typefaces (that I still need to post here) I wanted to do another display font. The idea behind it was to make a bubblegum version of Babyteeth. Since I decided to make it a monotype font there are also some Mojo influences - although less obvious. So far I've done both a regular and a highlighted version with accompanying dingbats. Since it's named after my birthyear, I've tried to use dingbats that represent that time (the 'pacman-ghost' is obviously ahead of its time ;-p ) although I'm not too sure whether I succeeded at that. Either way, I'm quite pleased with the outcome & I hope you'll enjoy it!\n\n| Attachment | Size |\n| --- | --- |\n| [1978.gif](http://web.archive.org/web/20150417132128/http:/typophile.com/files/1978.gif) | 51.73 KB |\n\n",
  "author": "ill sans",
  "time": "7 May 2008 — 3:35am",
  "uid": "13099",
  "comments": [
    {
      "time": "29 May 2008 — 9:18pm",
      "content": "After reading what influenced you I did not think I would like this face at all, but it is really nice.\n\nObviously, as the typeface shrinks there will be some legability issues, but it wouldn't be used very small. My guess is that the E, N, Q and T are going to give you the most difficulty (I thought the T was a Q at first glance).\n\nI like the bottom set of letters a lot better, they seem much more bubblegummy.\n\nThe Super Mario Bros. flowers are really nice touch.\n\n"
    },
    {
      "time": "31 May 2008 — 5:15am",
      "content": "Oops, I guess it shows I played Mario Bros one too many times ;-)  \nI can imagine my inspiration sources are not the best description for the font, but they did play a large part in designing it.  \nI totally agree with you on the bubblegum comment although I do like some dingbats better in the 'normal' version (e.g. the 8- & 12-pointed star). I think this version also solves a little of the legibility issue. But like you said; the font is only to be used for large texts and preferably even only for single words.  \nThe problem with distinguishing several letters prompted me to make a different Y. I actually prefer the alternative Y (which is closed at the top), but realize it might get easily confused with the T. I'll probably end up using the 'closed' Y anyway in the assumption most letters will be recognized within the words they spell.  \nOh, and thanks for your comment, I've been waiting a while now to get my first comment on this font ;-)\n\n"
    }
  ]
}
