{
  "id": "45062",
  "title": "which of these you think work best with garamond",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hello everybody,\n\ni have a litl question , i'm making a book for typografie class and i decided to use adobe garamond,for the headings i'd like to use annother font than adobe garamond, but i'm kind of looking for some advice / opinions on what you fine people think works best.\n\ni'm sort of limited with my licensed fonts to choose from but here are some options:\n\n-ITC franklin gothic  \n-Syntax  \n-Walbaum  \n-Univers  \n-Clarendon\n\ni'd really appreciate all the help everyone\n\nhave a nice day\n\n",
  "author": "omar",
  "time": "7 May 2008 — 4:05am",
  "uid": "25150",
  "comments": [
    {
      "time": "7 May 2008 — 4:39am",
      "content": "Univers for me... But to be honest, all you'll get is opinions here, it'll be down to you to make the decision in the end, as its your project.\n\n\\_\\_  \nRez\n\n"
    },
    {
      "time": "7 May 2008 — 5:44am",
      "content": "Syntax for me … Why? Because it shares the humanist character of A. Garamond and the x-height is comparable, you could use the combi in one line of text also. But i would prefer Gill Sans over Syntax aesthetically, if we speak of classics.\n\nPS  \n2 designers, 3 opinions :)\n\n"
    },
    {
      "time": "7 May 2008 — 5:53am",
      "content": "\"Because it shares the humanist character of A. Garamond and the x-height is comparable, you could use the combi in one line of text also...\" Thats a fair point, as we now have reasons coming into play. Gives the 'opinion' more substance. : )\n\n\\_\\_  \nRez\n\n"
    },
    {
      "time": "7 May 2008 — 5:58am",
      "content": "I'd say definitely NOT Walbaum or Clarendon. Using those will put you in the dangerous territory of mixing serifed typefaces on the same page. You need something to contrast with Garamond, and Clarendon and especially Walbaum are too close.\n\nAnd I'm going to have to give yet another differing opinion and suggest Franklin Gothic. For no other reason than I really like Frankoin Gothic, and I think it goes nicely with Garamond (in particular, Adobe Garamond).\n\n"
    },
    {
      "time": "7 May 2008 — 6:09am",
      "content": "Franklin Gothic will sit very well with Adobe Garamond; they both have the classic feel that lends credibility to a piece. Syntax could work, but Myriad/Fruitiger would be a better humanist to go with as they have a little less personality on their own. IMHO Syntax works best on its own; that way it doesn’t distract from the copy, and there’s enough contrast in the weights that it makes a fine all-around book face.\n\n"
    },
    {
      "time": "7 May 2008 — 1:35pm",
      "content": "thanks for all the tips guys, i'm going to give some of you're sugestions a try an maybe i could post some examples of the different combinations here, annyway thanks again, appreciate the help!\n\n"
    }
  ]
}
