{
  "id": "45089",
  "title": "how does font get rendered?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hi folks,\n\nit’s my first post here. i tried to use the search tool but as my questions are so general, it couldn’t return good answers.\n\nI am trying to create few fonts and see how it comes on a webpage. In this process, i have couple of questions... basic ones!!\n\n1. say I created fonts in a non-english language and used this font to develop a webpage. Now, when another person opens up this page, how will it be rendered on his machine? does he need to install this font?\n\n2. is there any association between a font and unicode characters? if yes, can you explain how are they related.\n\n3. Is my understanding correct here? Browsers don’t need any font installed on local machine to render unicode fonts? is it correct?\n\nBy asking all these questions, i am trying to understand how this font gets rendered on local user’s machine if used in a webpage to increase the usability of fonts.\n\nplease let me know. i may have asked wrong or a noob like questions but i hope it’d be fine.\n\nthanks in advance\n\n [‹ LOLZ](http://web.archive.org/web/20080706174708/http:/www.typophile.com/node/45139 \"Go to previous forum topic\") [Anybody got info on the metal font Subiaco? (metal & contextual) ›](http://web.archive.org/web/20080706174708/http:/www.typophile.com/node/43615 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706174708/http://www.typophile.com/user/30610\" title=\"View user profile.\">badmad</a>",
  "time": "<br>",
  "uid": "30610",
  "comments": [
    {
      "time": " 7.May.2008 3.27pm",
      "content": "1. Not necessarily — see 2.\n\n2. The font’s creator is responsible for assigning character codes to each of the images (“glyphs”). Although this can be in any number of different encodings, typically they get Unicodes as well. The [Unicode](http://web.archive.org/web/20080706174708/http:/www.typophile.com/wiki/href%25253D%252522www.unicode.org) of each character is used by almost every, if not every, program to distinguish between characters. While it’s perfectly possible to draw an ’A’ character in your font and assign it the Unicode value for, say, ’1’ (U+0030), this will make your font unusable in all programs: everywhere the character ’1’ is drawn, the end user sees an ’A’...\n\n3. Why’d you think that? Browsers on common systems (Mac OS X and Windows) don’t draw fonts themselves. They rely on the system and on the fonts installed on this system. It’s quite rare to see a font unique to a browser. I think Safari on Windows may be an exception — I heard it comes with its own default font, Lucida Grande.  \nThe situation is slightly different for Linux boxes, because these do not have a dedicated font drawing module. (But I suspect every current KDE and Gnome distribution works the same as Windows/OS X. Why would one include a font drawing module if the system already provides one?)\n\nBack to 1. If your font is just for looks, it can safely be replaced by (almost) any system font the user has. The exception is, of course, if your font provides characters that _are_ defined in the Unicode set, but are not available in the commonly distributed fonts. You might use a nice Cherokee font on your site, but if the user has no font at all with these characters, she can’t see them.\n\n"
    },
    {
      "time": " 7.May.2008 3.33pm",
      "content": "Hi. Perhaps you should read through these primers on Web typography — they will give you some answers and basic information.\n\n[http://webstyleguide.com/type/character.html](http://web.archive.org/web/20080706174708/http:/webstyleguide.com/type/character.html \"http://webstyleguide.com/type/character.html\")\n\n[http://www.efuse.com/Design/web\\_fonts\\_basics.html](http://web.archive.org/web/20080706174708/http:/www.efuse.com/Design/web_fonts_basics.html \"http://www.efuse.com/Design/web\\_fonts\\_basics.html\")\n\n[EDIT] Ah — Theunis beat me to it, and answered your queries point by point!\n\n"
    },
    {
      "time": " 7.May.2008 4.23pm",
      "content": "thanks to both Theunis and Ricardo.\n\nI get what Theunis said. I’ll first go through the references Ricardo sent and then pose any further questions. let me do some homework...\n\nthanks again...\n\n"
    },
    {
      "time": " 8.May.2008 6.40am",
      "content": "Actually, a great deal depends on how you design your web page.\n\nIf it’s to be all in a “weird” character set, one not commonly supported, you’re in trouble...  \nOn the other hand, if it’s mainly Latin text, with _some_ parts in your special font, you might be able to insert these as images.\n\nAnother option is to start by saying “You will need this-and-this font to view the page”, and put it up for download. I guess a Windows TTF format is supported by the majority of OS systems — Windows, of course, but also Mac OS X, as well as any FreeType based Linux browser.\n\n"
    },
    {
      "time": " 8.May.2008 4.45pm",
      "content": "yeah, thats my worry. i plan to create font for a non-english language (Hindi, devnagari script). I think it’s the only solution I have.\n\n"
    }
  ]
}
