{
  "id": "45090",
  "title": "Resume Crit.",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Please feel free to provide feedback. The resume is for general purpose. No target as of yet.\n\nCheers,\n\nByron\n\n",
  "author": "Byron",
  "time": "7 May 2008 — 4:56pm",
  "uid": "29968",
  "comments": [
    {
      "time": "7 May 2008 — 7:51pm",
      "content": "My 2 cents:\n\n- Overall it's a bit dense and clunky. Try reducing the font sizes and increasing your margins.  \n- To open some whitespace you could easily move your dates inline with either your job title or company  \n- month abbreviations should be consistent (Sep Jun Mar) and use an en dash between dates instead of a hyphen  \n- Don't think the one instance of Frutiger Extra Black works. I think Futura Medium at that size would work or you could pick a more complimentary typeface.  \n- I think your email and phone number should be the same size and weight. Could also go on the same line with some sort of separator (bar or bullet).  \n- Not a fan of the oblique style of Futura.\n\n"
    },
    {
      "time": "7 May 2008 — 8:19pm",
      "content": "Byron,  \nGeneral advice before the typographic composition critique:  \nDepending on your choice of career, I would thin out this resume to the three or four jobs that will mean anything at all to your next employer (or maybe just two jobs and really emphasize your education). Your employer needs to see that you are capable of choosing only the elements that are most pertinent before beginning a composition. Keep in mind also that intelligent use of negative space is important and will really set your resume apart from the rest.  \nThe typography:  \nfirst impressions—you need more margins. The difference between the bold and the regular is too much; find and use a middle weight. Use leading more generously between lines.  \nIf you're wanting to make a statement with Futura then make it loud and clear—including your name at the top. Otherwise, choose something else that fits you better.  \nSuggestions:  \nTry making the type a little smaller. Instead of explicitly using dark black rules all the way across the page, consider something implicit that fulfills the same task. As I write this I get the feeling that you should be spending the majority of your resume telling the story of your education. I would also suggest creating a book PDF or website and linking your resume to it.  \nBest Regards  \nDavid\n\n"
    },
    {
      "time": "7 May 2008 — 9:38pm",
      "content": "I am brimming with enthusiasm! Thanks for the great feedback. I was struggling to put this one together. I suffer from perfectionism. Ha! Seriously.\n\nI will edit and post again.\n\nThanks Again!\n\n"
    }
  ]
}
