{
  "id": "45116",
  "title": "the elusive circle (p) symbol!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anyone here know the keystroke for the (p) publisher symbol?  \nIn the past I have always \"created\" the symbol, but I know there is a keystroke for it..  \nsimilar to...  \nalt+0169 is ©  \nalt+ 0153 is T  \nalt+ 0174 is ®  \netc.,\n\nWhat should have been a quick find has now turned into a 2 day delay...  \neric  \n(my first post)\n\n",
  "author": "seventhform",
  "time": "8 May 2008 — 9:33am",
  "uid": "30705",
  "comments": [
    {
      "time": "8 May 2008 — 9:39am",
      "content": "There is no shortcut for this symbol.  \nYou can use the charmap or the Unicode hex input.\n\n"
    },
    {
      "time": "8 May 2008 — 9:48am",
      "content": "[http://tlt.its.psu.edu/suggestions/international/accents/charmap.html](http://web.archive.org/web/20150223075808/http:/tlt.its.psu.edu/suggestions/international/accents/charmap.html \"http://tlt.its.psu.edu/suggestions/international/accents/charmap.html\")\n\n[http://www.fileformat.info/tip/microsoft/enter\\_unicode.htm](http://web.archive.org/web/20150223075808/http:/www.fileformat.info/tip/microsoft/enter_unicode.htm \"http://www.fileformat.info/tip/microsoft/enter\\_unicode.htm\")\n\n"
    },
    {
      "time": "8 May 2008 — 10:20am",
      "content": " ![](http://web.archive.org/web/20150223075808im_/http:/typophile.com/files/Capture_4270.JPG)\n\n"
    },
    {
      "time": "8 May 2008 — 2:09pm",
      "content": "I think Font Bureau regularly includes this character in their Postscript Type 1 fonts in the \"pi\" character slot (opt-p). But this is an old hack and by no means a standard.\n\n-- K.\n\n"
    },
    {
      "time": "8 May 2008 — 6:11pm",
      "content": "There is a circled capital \"P\" in Unicode, but it is for \"musical copyright.\" Also not in most fonts (yet another reason not to purchase any fonts that don't allow end user modification). I'm at home now without my Unicode book, but if this is the character you want, post that, & I'll look it up tomorrow. It is somewhere around the 2000 block BTW -- maybe in letter-like symbols?\n\n"
    },
    {
      "time": "8 May 2008 — 6:21pm",
      "content": "\\>Also not in most fonts (yet another reason not to purchase any fonts that don’t allow end user modification).\n\nSeems a bit silly - it's not in most fonts because most people don't need it - it is in some common system fonts and is generic and rare enough not to worry about a font-specific version (in most cases).\n\nIt's U+2117 - as my screen shot (two posts above) shows.\n\n[http://www.myfonts.com/unicode/2117/](http://web.archive.org/web/20150223075808/http:/www.myfonts.com/unicode/2117/ \"http://www.myfonts.com/unicode/2117/\")\n\nCheers, Si\n\n"
    },
    {
      "time": "8 May 2008 — 6:56pm",
      "content": "<cite>Seems a bit silly - it’s not in most fonts because most people don’t need it</cite>\n\nNot to be too sarcastic, but we're in a bad situation if we depend on the foundry to determine what we (the end user) will need. I suppose when we need characters not in a font, we should just set those in Ariel?\n\nFor example, ours is a small shop, but at least once a month, I need characters not in most foundry releases. Not sexy things like swash small caps, but regular Latin characters with non-European diacriticals -- or even just all the combining diacriticals & space modifying characters.\n\n"
    },
    {
      "time": "8 May 2008 — 7:05pm",
      "content": "Hypatia Sans has this character. It will be in all Adobe's more extensive Latin-based typefaces in the future, as well.\n\nBut of course it just isn't practical for every single font to have every plausible character. The aforementioned Hypatia Sans has \\>3000 glyphs per font. That's not a reasonable level to expect from \"all fonts.\" Not unless you want to see 1/6 as many new fonts being released.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "8 May 2008 — 7:09pm",
      "content": "Charles your point is valid - I was commenting that hanging this crusade on the case of circle P is silly.\n\n"
    },
    {
      "time": "8 May 2008 — 7:32pm",
      "content": "And the small circled p ⓟ is 24DF [http://www.myfonts.com/unicode/24DF/](http://web.archive.org/web/20150223075808/http:/www.myfonts.com/unicode/24DF/ \"http://www.myfonts.com/unicode/24DF/\") (9439 in decimal)\n\n"
    },
    {
      "time": "8 May 2008 — 7:32pm",
      "content": "<cite>Not unless you want to see 1/6 as many new fonts being released.</cite>\n\nNow there's a thought.\n\n\\* \\* \\*\n\nBack in 2005, I was on a 4-man team at a national competition. Somebody named it \"The good, the bad, and the grumpy\" -- never mind there were four of us. The other three were pretty sure who grumpy was . . . (& yes, we won).\n\n"
    },
    {
      "time": "8 May 2008 — 10:17pm",
      "content": "I include the circle P character in many of my fonts. In older fonts, I put it in the Pi slot like Font Bureau, and in newer ones in the proper Unicode slot. My reason for including it was that I used to need it when I was designing audiobook packaging.\n\n"
    },
    {
      "time": "9 May 2008 — 2:00am",
      "content": "re: I put it in the Pi slot like Font Bureau\n\num, what does that mean exactly? I cannot believe how difficult this is; I cut and pasted the ⓟ from Michel Boyers post-- it worked in Outlook but didn't in IndesignCS3 nor notepad where I'm collecting the 35 individual publishing credits! urg.\n\n"
    },
    {
      "time": "9 May 2008 — 3:50am",
      "content": "Switch to a font that has the sign, and copy&paste should work.\n\n"
    },
    {
      "time": "9 May 2008 — 4:53am",
      "content": "\" - it’s (the p in a circle) not in most fonts because most people don’t need it - \"\n\nLaugh to self. But when one wants to set p in a circle, one should not have to wait for it to snow at the equator.\n\nre: I put it in the Pi slot like Font Bureau — \"um, what does that mean exactly?\"\n\nIt means that we @ FB understand how users work, and so we put the p in a circle, a \"must-have\" glyph that is very difficult for a user to make on the fly, in the slot of a glyph (math pi) that most people _really don't need_ (because even if they do, it's in the symbol font on every single computer on earth).\n\nConsidering the fact that there are applications out there now that simply will not allow the inclusion of un-encoded glyphs in the document, we might be forced, by the overwhelming desire to please our users, to keep doing that.\n\nCheers!\n\n"
    },
    {
      "time": "9 May 2008 — 5:23am",
      "content": "all of the new ClearType fonts have this glyph.\n\n"
    },
    {
      "time": "9 May 2008 — 6:15am",
      "content": "_Seems a bit silly - it’s not in most fonts because most people don’t need it - it is in some common system fonts and is generic and rare enough not to worry about a font-specific version (in most cases)._\n\nHow many people have used the per-thousands symbol or logical not from any font? I think many more people have designed CD packaging that have had to hack their own publish symbol than have used many other \"core\" characters. But now that no one buys CDs anymore, I suppose is a moot point.\n\nThe metal foundries sold diacritics as generic sorts and did not worry about font-specific versions.\n\nWe have been putting that character in all P22 fonts for about 10 years (also in the pi slot for TT/PS and unicode for OT).\n\n"
    },
    {
      "time": "9 May 2008 — 10:27am",
      "content": "I've used this font in the past when doing CDs:\n\n[http://www.masterstech-home.com/The\\_Library/FONT\\_Samples/Font\\_Indices/Im...](http://web.archive.org/web/20150223075808/http:/www.masterstech-home.com/The_Library/FONT_Samples/Font_Indices/Image_Pages/T/TrademarkSymbols.html \"http://www.masterstech-home.com/The\\_Library/FONT\\_Samples/Font\\_Indices/Image\\_Pages/T/TrademarkSymbols.html\")\n\n"
    },
    {
      "time": "9 May 2008 — 11:27am",
      "content": "I stand corrected, this is the single most important overlooked character, and I will make sure it's added to every new font my company procures.\n\n\\>How many people have used the per-thousands symbol or logical not from any font?\n\nI think it's a lot easier to uncover why obscure and silly characters are included in character sets and code-pages, than why important characters like (P) are not. It's probably related to these char sets being defined by tech, scientific and banking communities rather than music publishers.\n\n"
    },
    {
      "time": "9 May 2008 — 11:28am",
      "content": "Duplicate\n\n"
    },
    {
      "time": "9 May 2008 — 2:03pm",
      "content": "tried Jonathans suggestion:  \n( [http://www.masterstech-home.com/The\\_Library/FONT\\_Samples/Font\\_Indices/Im](http://web.archive.org/web/20150223075808/http:/www.masterstech-home.com/The_Library/FONT_Samples/Font_Indices/Im \"http://www.masterstech-home.com/The\\_Library/FONT\\_Samples/Font\\_Indices/Im\")...)\n\nso I clicked on the (p)  \nand..NO (p) in the character map!  \n [http://www.myfonts.com/fonts/microsoft/arial/unicode-ms/charmap.html?cps...](http://web.archive.org/web/20150223075808/http:/www.myfonts.com/fonts/microsoft/arial/unicode-ms/charmap.html?cpselect=&page= \"http://www.myfonts.com/fonts/microsoft/arial/unicode-ms/charmap.html?cpselect=&page=\")\n\ntried Ralfs suggestion:  \n\"Switch to a font that has the sign, and copy&paste should work.\"\n\ntried that, nope, all it gave me was a BOX shape...\n\nso...I guess I'm retarded. or the (p)gods are bound and determined that I do not access the elsusive (p) symbol (thunder from above)\n\n"
    },
    {
      "time": "9 May 2008 — 2:36pm",
      "content": "You're probably on a Mac. But if it is a PC, select the font that has the character -- Ariel Unicode seems to be about the only one. Make sure the \\*num lock\\* toggle is on. Hold down the \\*alt\\* key, then using the numeric keypad, press \\*plus\\* & the digits (2117). If an alpha character is needed (as with \\*24DF\\* for the lower-case circled p), use the regular keyboard for the alphas, but the number must be from the keypad. When you've entered the Unicode string, let go of the \\*alt\\* key.\n\nThere is probably a similar way on a Mac, but I don't know it.\n\n ![](http://web.archive.org/web/20150223075808im_/http:/typophile.com/files/circp_4021.gif)\n\n"
    },
    {
      "time": "9 May 2008 — 2:45pm",
      "content": "On my Mac, the capital (P) 0x2117 ℗ can be found in Calibri, Cambria, Candara, CMU Bright, Consolas, Constantia, Corbel, DejaVu Sans, Lucida Grande, Lucida Sans, MS Gothic Regular, Apple Symbols Regular, MS PGothic, MS PMincho, MS Reference Sans Serif.\n\n"
    },
    {
      "time": "9 May 2008 — 4:45pm",
      "content": "I'll confess that I've never heard of using the circled p as as symbol for \"publisher.\" Since the circled capital P does have meaning (sound recording copyright), I wonder if it isn't the lower-case p Eric's talking about. Anyway, that's why I suggested Ariel Unicode. As for Bitstream Cyberbit, hasn't it been withdrawn?\n\n"
    },
    {
      "time": "9 May 2008 — 5:01pm",
      "content": "<cite>I’ll confess that I’ve never heard of using the circled p as as symbol for “publisher.” </cite>\n\nHere is a grab from [http://www.unicode.org/charts/PDF/U2100.pdf](http://web.archive.org/web/20150223075808/http:/www.unicode.org/charts/PDF/U2100.pdf \"http://www.unicode.org/charts/PDF/U2100.pdf\") (unicode chart); they write \"published\" ; they say nothing special for 24DF\n\n ![](http://web.archive.org/web/20150223075808im_/http:/typophile.com/files/2117_4566.jpg)\n\n"
    },
    {
      "time": "9 May 2008 — 5:31pm",
      "content": "<cite>As for Bitstream Cyberbit, hasn’t it been withdrawn?</cite>\n\nI just downleaded [TITUS Cyberbit](http://web.archive.org/web/20150223075808/http:/en.wikipedia.org/wiki/Cyberbit) and it contains 24DF (CIRCLED LATIN SMALL LETTER P) but not 2117 (nor 24C5).\n\n[added] Here are two related links: [http://www.fileformat.info/info/unicode/char/24df/fontsupport.htm](http://web.archive.org/web/20150223075808/http:/www.fileformat.info/info/unicode/char/24df/fontsupport.htm \"http://www.fileformat.info/info/unicode/char/24df/fontsupport.htm\") and [http://www.fileformat.info/info/unicode/char/2117/fontsupport.htm](http://web.archive.org/web/20150223075808/http:/www.fileformat.info/info/unicode/char/2117/fontsupport.htm \"http://www.fileformat.info/info/unicode/char/2117/fontsupport.htm\").\n\n"
    },
    {
      "time": "10 May 2008 — 11:27am",
      "content": "not to beat this topic to death (though I wish I could, literally..) I switched my font to ARIEL UNICODE MS in my new Word document, cut and pasted Michels ⓟ and it worked...\n\nprior to that I tried Charles\\_e suggestion (the Ariel Unicode alt+2117 shortcut) but it just gave me a capitol \"E\" (??)  \nso I still don't know how to access the ⓟ ouside of this cut-and-paste method.\n\nSo, it worked (kinda.) and I THANK YOU all for your insight.  \neric\n\n\\*PC user, BTW. XP, Indesign CS3 and Office 2000 professional Edition\n\n"
    },
    {
      "time": "10 May 2008 — 11:35am",
      "content": " ![](http://web.archive.org/web/20150223075808im_/http:/typophile.com/files/circlePinsky_3982.jpg)\n\n"
    },
    {
      "time": "10 May 2008 — 8:32pm",
      "content": "<cite> I still don’t know how to access the ⓟ ouside of this cut-and-paste method.</cite>\n\nAccording to [http://www.fileformat.info/info/unicode/char/24df/index.htm](http://web.archive.org/web/20150223075808/http:/www.fileformat.info/info/unicode/char/24df/index.htm \"http://www.fileformat.info/info/unicode/char/24df/index.htm\") you type Alt +24DF but they also say (if you follow the link giving the shortcut which gets you [here](http://web.archive.org/web/20150223075808/http:/www.fileformat.info/tip/microsoft/enter_unicode.htm)) that you need to have your numeric keypad set to hexadecimal (HKEY\\_Current\\_User/Control Panel/Input Method, set EnableHexNumpad to \"1\"). Since your examples above (copyright etc) are in decimal, I would try Alt +9439 (because the number that writes 24DF in hexadecimal notation is nothing but the decimal integer 9439).\n\n"
    },
    {
      "time": "10 May 2008 — 9:24pm",
      "content": "When I look more carefully at their input methods, I start having doubts about Alt +9439. Their universal method when the keypad is set to hexa is\n\n(1) Press and hold down the Alt key.  \n(2) Press the + (plus) key on the numeric keypad.  \n(3) Type the hexidecimal unicode value.  \n(4) Release the Alt key.\n\nand the codes you used above simply correspond to another input method.\n\n"
    },
    {
      "time": "11 May 2008 — 5:08am",
      "content": "Michel . . . just about. As I said in my post:\n\n(1) num lock must be \"on\"\n\nand\n\n(2) A-F are typed from the regular keyboard; it is just the digits that must be entered via the keypad.\n\n"
    },
    {
      "time": "11 May 2008 — 8:38am",
      "content": "\"I think it’s a lot easier to uncover why obscure and silly characters are included in character sets and code-pages, than why important characters like (P) are not.\"\n\nIt's only one reason for both situations, isn't it now.\n\n\"I will make sure it’s added to every new font my company procures.\"\n\nThat's overreacting. Your market needs a serif and sans available from a system utility like Apple's Type Palette, Letterlike Symbols. Is there something like this in XP? With only 1% of your market moving by choice to Vista (default CT), I don't think it's helping just to put them in CT fonts.\n\nCheers.\n\n"
    },
    {
      "time": "11 May 2008 — 2:40pm",
      "content": "another annoying issue:\n\nⓟ©\n\nlook inconsistent? these are BOTH set at 10pt ARIAL UNICODE MS and the character spacing is uneven!  \nhaven't imported this into CS3 yet, but this is what occurs when setting the type in Word.\n\nThis looks particularly bad when: ⓟ&© or ⓟ+©  \nand...  \nⓟsixth form music/BMI ©projekt records\n\nbumping up the pt in the © doesn't help either...\n\n"
    },
    {
      "time": "11 May 2008 — 3:37pm",
      "content": "Well, you can probably fool around with the size & position in InDesign to get them close, but I think the core of your problem is your insistence on using the lower-case p. The lower-case circled-p (Unicode 24DF) come from a different set, namely, circled alpha characters. There may a circled capital C in that set (U+24\\_\\_); you could look for it. But the Sound Recording copyright symbol has always been the circled capital P -- Unicode 2117. Now if that is sized differently than the copyright symbol (circled capital C), you'd have a legitimate complaint.\n\n"
    },
    {
      "time": "12 May 2008 — 12:20pm",
      "content": "\"...these are BOTH set at 10pt ARIAL UNICODE MS and the character spacing is uneven!\"\n\nAre those serif designs in a sans, or is that my ke-warts rendering acting up?\n\nCheers!\n\n"
    },
    {
      "time": "12 May 2008 — 3:48pm",
      "content": "<cite>another annoying issue:</cite>\n\nAs Charles says, if you want satisfaction, you most probably need to use the character 0x2117 and moreover, if you want everything to be nicely aligned, you need both the copyright and 0x2117 to be taken from the same font (and also from the font with the + and/or the &). Here are two examples (a grab in Microsoft Word 2008 for Mac).\n\n ![](http://web.archive.org/web/20150223075808im_/http:/typophile.com/files/elusivecirclep_4802.jpg)\n\nIn my opinion, if you don't have a font containing a glyph for 0x2117, the easiest thing to do is either to buy one or to choose a font whose EULA allows you to modify it and add to it the glyph for 0x2117.\n\nMichel\n\n"
    },
    {
      "time": "12 May 2008 — 7:50pm",
      "content": "Correction: `s/Hypathia/Hypatia/`  \nor better `s/Hypathia/Hypatia Sans Pro/`\n\n"
    },
    {
      "time": "13 May 2008 — 7:49am",
      "content": "To tackle the comment \"I still don’t know how to access the ⓟ ouside of this cut-and-paste method.\": In more recent versions of Word, you can get a character by typing its 4-digit Unicode, er, code and then hitting Alt+X immediately after; so in this case I type 2117 and then hit Alt+X. I'd left the font at the default TNR. Word switched to MS Mincho and dropped in the character. Setting the font to Trebuchet and trying the same thing resulted in Word switching to MS Gothic and dropping in the correct character. Dunno if this helps.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "2 Jun 2009 — 9:37pm",
      "content": "aia if this is redundant. I found this info elsewhere when stumped by the problem under discussion.\n\nMac Menu Bar \\> Flag near clock \\> Show Character Palette (can be enabled in System Preferences)\n\nIn the palette there is a search field at the bottom. Type in unicode - 2117\n\nIn the Collections area: select \"Containing selected character\" - it returns all the active fonts in your system containing the glyph.\n\nhth\n\n"
    },
    {
      "time": "22 Aug 2010 — 6:08pm",
      "content": "Hi all. Just to chime in on the end of this thread, I made a dedicated circle-p font ages ago, containing the symbol in a variety of styles. It's $5 buy-Jon-a-drink-ware... You may grab it from....http://www.artisan.pwp.blueyonder.co.uk/studio/pfont.html  \nJon\n\n"
    }
  ]
}
