{
  "id": "45114",
  "title": "Photo Mural Resolution",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am working on a project for a retail space that requires large format photo murals. I have lots of high-res royalty free stock that is suitable but obviously none of it is the size I need. The images I have are 8\" x 5\" at 300dpi - how big can these go without really looking poorly?\n\nThe highest any site seems to offer is roughly 17\" x 11\" at 300dpi.\n\n",
  "author": "jayyy",
  "time": "8 May 2008 — 9:31am",
  "uid": "4974",
  "comments": [
    {
      "time": "8 May 2008 — 9:57am",
      "content": "The really large inkjet printed banners are usually between 10 and 20 dpi.\n\n"
    },
    {
      "time": "8 May 2008 — 10:13am",
      "content": "Locate the vendor and see what the specific output requires. You could also vectorize them.\n\n[http://vectormagic.com/](http://web.archive.org/web/20150105012652/http:/vectormagic.com/ \"http://vectormagic.com/\")\n\n"
    },
    {
      "time": "8 May 2008 — 11:38am",
      "content": "thanks guys for all the help. much appreciated.\n\n"
    },
    {
      "time": "8 May 2008 — 12:03pm",
      "content": "Probably wouldn't go with vectorising large detailed imagery!?!?\n\nThe resolution that is needed to look good all depends on how close the viewer will be.  \n10-20dpi is for the large bilboardlike banners on top of buildings etc. If you are going to have people close to the subject matter like inside a retail space I probably wouldn't go any lower than 70dpi.\n\nAn alternative solution to vectorising them is to interpolate them at 300dpi in sclae 1:1 and make a halftone bitmap with circles (freq:1 angle:45 for example).  \nThis will give you an Lichtenstein feel up close but and a true image far away. This could again be vectorised but you will need a pretty powerfull computer and heaps of slices in your image.\n\n"
    },
    {
      "time": "8 May 2008 — 12:26pm",
      "content": "Alien Skin makes a plugin for Photoshop called Blow Up that can help you get better results when scaling up photos. At extreme settings, it can look a little weird (curves get flattened out into a series of straight lines, and color gradients near edges can also get flattened out), but it generally does a good job, and it's not too expensive.\n\n"
    },
    {
      "time": "8 May 2008 — 12:35pm",
      "content": "I've used images at 50 dpi for large trade show banners. More important than our experience...You need to talk to the vendor who will be printing the banner. Talk to their pre-press department.\n\nHere's a handy PDF. The second page is especially useful. But, again, talk to your vendor:  \n [http://www.johnevanscompany.com/specs.pdf](http://web.archive.org/web/20150105012652/http:/www.johnevanscompany.com/specs.pdf \"http://www.johnevanscompany.com/specs.pdf\")\n\n"
    },
    {
      "time": "8 May 2008 — 11:59pm",
      "content": "There has to be some conventional rules in the billboard industry, yet upon searching I get various answers.  \nI worked in grand format printing for a while, and we had no inhouse set of rules to hand out to customers because most of them were just not willing to cooperate or technically savvy enough ( makes you wonder ... ).\n\nA lot of the old rules for billboard are based on the idea that screens are going to be used, but with digital printing, usage of pixels, the conception has to be seen from a different angle.  \n15 dpi far viewing, 72+ dpi close viewing.\n\nPersonally whenever I had to make some designing with images, depending on available files etc, I aimed for a 72~150 dpi final output resolution. If the supplied file didn't fit from a size or resolution perspective ( which they NEVER do ) I would do upscaling using Genuine Fractals.  \nThis does involve using some pricey software but the output is simply amazing.  \nIn one case I ran a series of 4x3meter banners which were exclusively pictures and the customer supplied files were .....240 dpi ... 100ko, 500ko and the likes ..... 10x20cm etc .... pure rubbish files which I thankfully could use because of said software.\n\nIt's tricky being in situations like this. Best of luck.\n\n"
    },
    {
      "time": "9 May 2008 — 6:04am",
      "content": "I've always used Genuine Fractals and used a 150 dpi target.\n\n"
    },
    {
      "time": "9 May 2008 — 10:59am",
      "content": "For large-scale graphics from poor-res sources, I usually enlarge the images to the final size, at a 100-150dpi, then add a little grain the hide the artifacts. In my experience, it also helps if the pictures are gray-scale or duotone.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20150105012652/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    }
  ]
}
