{
  "id": "45126",
  "title": "G-Type releases Houschka Rounded",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20101106014353/http:/typophile.com/user/108 \"View user profile.\") : 8.May.2008 1.35pm \n\nFontworks Press Release - For immediate release  \n8th May 2008  \nHouschka Rounded:  the brand new OpenType release from G-Type \n\nThe new rounded version of the classic Houschka font family by Nick Cooke • 4 fonts in 1: standard set & 3 additional stylistic sets, modern, art deco & unicase • discretionary ligatures, contextual alternates, small caps & 4 sets of figures • extensive language coverage including Central European, Turkish and Cyrillic\n\nHouschka Rounded, Stylistic Set 1 with Contextual Alternates\n\n ![](http://web.archive.org/web/20101106014353im_/http:/typophile.com/files/houschka_5690.gif)\n\nHouschka Rounded, Stylistic Set 2 with Contextual Alternates\n\n ![](http://web.archive.org/web/20101106014353im_/http:/typophile.com/files/houschka-alts_4752.gif)\n\nAcclaimed type designer Nick Cooke (Olicana, Chevin, Precious) has completed his long-awaited Houschka Rounded typeface, a softer new companion to the original Houschka family launched in 1999. The new 6 weight family (Thin, Light, Medium, DemiBold, Bold, ExtraBold) retains the same humanist qualities of the original typeface, a design which is elegant, clean, effortlessly legible and yet full of character. Houschka has already branded the likes of Cadbury Schweppes and Tesco; Houschka Rounded’s smooth curves, range of weights, multi-lingual coverage and impressive repertoire of OpenType features will undoubtedly create a whole new buzz.\n\nThe typeface has been thoughtfully designed using OpenType technology to give users a choice of additional styles within the same font; a modern contemporary vibe, decorative art deco feel or a quirky ‘mixed caps’ unicase appearance can be achieved without ever having to switch fonts. The contextual alternates and discretionary ligatures can also be used in conjunction with any of the 4 stylistic sets for maximum versatility.\n\nSays Cooke: “After the release of the original Houschka I discovered that many users liked the font, but were ‘uncomfortable’ with the rounded style of the A, W and w; straight versions have been incorporated into Houschka Rounded and are accessed by selecting ‘Contextual Alternates’. I also thought it would be good to offer a little more variety, so there are 3 extra stylistic sets which are easy to use; just scroll over the text and, using the pop-up OpenType menu in the character palette, select stylistic set 1, 2 or 3. It couldn’t be simpler.”\n\nHouschka Rounded is available from Fontworks UK Ltd and online at [www.type.co.uk](http://web.archive.org/web/20101106014353/http:/www.type.co.uk/ \"www.type.co.uk\")  \n For more information, samples or to discuss editorial opportunities please contact Joe Graham ( [mailto:joe@type.co.uk](mailto:joe@type.co.uk \"mailto:joe@type.co.uk\")) at Fontworks. Please refer to the accompanying type specimen sheets for more information on how best to use these magnificent OpenType (.otf / PS flavour) fonts.\n\nFontworks UK Ltd  \nNew North House  \n202-208 New North Road  \nLondon&nbsp; N1 7BJ  \n [www.type.co.uk](http://web.archive.org/web/20101106014353/http:/www.type.co.uk/ \"www.type.co.uk\")  \nt: +44 (0)20 7226 4411  \nf: +44 (0)20 7226 4422\n\n| Attachment | Size |\n| --- | --- |\n| [Houschka Rounded PR 8-5-08.pdf](http://web.archive.org/web/20101106014353/http:/typophile.com/files/Houschka%20Rounded%20PR%208-5-08.pdf) | 283.78 KB |\n\n",
  "author": "<a href=\"http://web.archive.org/web/20101106014353/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 8.May.2008 1.35pm",
  "uid": "108",
  "comments": [

  ]
}
