{
  "id": "45125",
  "title": "Font from printer's 1830 archive",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I went to visit a printer in Nottingham and came across this font in his archive. Would you be able to help me and tell me what it is? It looks a bit like Caslon, but the the c and s have details which I can't find in any Caslon I have – and the g is quite peculiar too. Thank you for your help!\n\n| Attachment | Size |\n| --- | --- |\n| [cuthberts.gif](http://web.archive.org/web/20120730130648/http:/typophile.com/files/cuthberts.gif) | 727.72 KB |\n\n",
  "author": "Suzy",
  "time": "8 May 2008 — 1:35pm",
  "uid": "30710",
  "comments": [
    {
      "time": "8 May 2008 — 8:04pm",
      "content": "De Vinne Condensed.\n\nElzevir, originally designed in the late 18th century, was revived in France in the 1880s and enjoyed a return to popularity in the USA, inspiring Gustav Schroeder's \"De Vinne\" of 1893 (Elzevir Bold, really), and this became the most popular typeface of the 1890s. It was named after Theodore De Vinne, the leading figure in American typography. He was a printer in the wide sense of the term as it was then employed, a publisher of books and magazines, instigator of coated paper, co-founder of the Grolier Club for bibliophiles, and an authority on typography who wrote extensively on the subject. Of the eponymous face, DeVinne said, “This face is the outcome of correspondence (1888-90) between the senior of the De Vinne Press [meaning himself] and Mr. J. A. St. John of the Central Type Foundry of St. Louis, concerning the need of plainer types of display, to replace the profusely ornamented types in fashion, of which the printers of that time had a surfeit. The DeVinne Press suggested a return to the simplicity of the true old-style character, but with the added features of thicker lines and adjusted proportion in shapes of letters. Mr. St. John approved, but insisted on grotesques to some capital letters in the belief that they would meet a general desire for more quaintness. Mr. Werner of the Central Type Foundry was instructed to draw and cut the proposed face in all sizes from 6- to 72-point, which task he executed with great ability. [Theodore De Vinne was mistaken on this.] The name given to this face by Mr. St. John is purely complimentary, for no member of the De Vinne Press has any claim on the style as inventor or designer. Its merits are largely due to Mr. Werner; its few faults of uncouth capitals show a desire to please eccentric tastes and to conform to old usage. The new face found welcome here and abroad; no advertising face of recent production had a greater sale.”\n\n"
    },
    {
      "time": "9 May 2008 — 5:58am",
      "content": "Wow, thank you so much! At least now I know where to start looking for it.\n\n"
    },
    {
      "time": "9 May 2008 — 8:50am",
      "content": "What seems unusual is that it's an American design being used in the UK.  \nI'm more familiar with things going the other way at that time, in particular the influence of William Morris.\n\n"
    },
    {
      "time": "12 May 2008 — 10:42am",
      "content": "Yes, i was a bit surprised about that too.\n\nHere is the entire image, and another one that looks a bit similar I think.\n\n ![](http://web.archive.org/web/20120730130648im_/http:/typophile.com/files/DSC02066_4934.jpg)\n\n ![](http://web.archive.org/web/20120730130648im_/http:/typophile.com/files/DSC02112_3756.jpg)\n\nI'm continuing my quest and will let you know if I find out anything else!  \nDo you know of any nice digitised versions of it?  \nThis one is the only one I could find so far. [http://www.myfonts.com/fonts/woodentypefonts/de-vinne/](http://web.archive.org/web/20120730130648/http:/www.myfonts.com/fonts/woodentypefonts/de-vinne/ \"http://www.myfonts.com/fonts/woodentypefonts/de-vinne/\")\n\n"
    },
    {
      "time": "23 Feb 2012 — 2:44am",
      "content": "Curious, does this have anything to do with the De Vinne typeface? [http://typophile.com/node/90328](http://web.archive.org/web/20120730130648/http:/typophile.com/node/90328 \"http://typophile.com/node/90328\")\n\n"
    }
  ]
}
