{
  "id": "45151",
  "title": "Character Spacing",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello All,\n\nI am new to font design and I have designed the characters and I am now working on the character spacing. Can anyone list the character combinations I need to use to help me to workout the spacing between all the characters. Or can anyone post any links to sites which has this information.\n\nThanks.\n\n [‹ Shaker type](http://web.archive.org/web/20080924161657/http:/typophile.com/node/45082 \"Go to previous forum topic\") [Huge window lettering? ›](http://web.archive.org/web/20080924161657/http:/typophile.com/node/44953 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924161657/http://typophile.com/user/30344\" title=\"View user profile.\">Emma Ford</a>",
  "time": "<br>",
  "uid": "30344",
  "comments": [
    {
      "time": " 9.May.2008 6.20am",
      "content": "On the internet [Briem’s site is excellent as a start.](http://web.archive.org/web/20080924161657/http:/briem.ismennt.is/2/2.3.5a/2.3.5.01.spacing.htm) Then check out the links in [here in the Typowiki](http://web.archive.org/web/20080924161657/http:/typophile.com/node/27804).\n\n"
    },
    {
      "time": " 10.May.2008 5.14am",
      "content": "HHOOHOH nnoonon\n\nIs as good a place to start as any.  \nAlso I would think that until you are satisfied with the character spacing, the character drawing is not finished.\n\n"
    },
    {
      "time": " 10.May.2008 6.39am",
      "content": "[Karen Cheng’s book Designing Type](http://web.archive.org/web/20080924161657/http:/www.amazon.co.uk/Designing-Type-Karen-Cheng/dp/1856694453/ref=sr_1_1?ie=UTF8&s=books&qid=1210426620&sr=8-1) has a great, step-by-step guide for basic letterspacing. She takes you from O then H, then HOH, then rules for the sides of other letters, caps and lower case. Well worth getting it just for that.\n\nShe also provides a good starter on kerning pairs and suitable test words for the next stage.\n\n"
    },
    {
      "time": " 10.May.2008 8.20am",
      "content": "Both the Briem site and Karen Cheng’s book derive their method from Walter Tracy’s “Letters of Credit,” And it starts with the “control” letters James mentions. I don’t think you’ll get much more from Cheng than from Briem. Tracy’s original account is definitely worth reading, though.\n\n"
    },
    {
      "time": " 11.May.2008 5.03am",
      "content": "While Tracy does a good job of writing about spacing, I think the aspiring type designer should explore spacing on their own, and not give so much weight to these mighty tomes. Straight-to -straight, round-to-round, and straight-to-round values are established first and then after that, it really depends on the type design. Never use kerning to fix anything until you have exhausted all your options with metrics.\n\nI’m currently working on a set of fonts that were done as a custom project for a major magazine by a very reputable foundry. The AD was complaining about the kerning, and after many years of living with it they hired me to fix it. (among other things)\n\nIt was amazing how poorly thought out the spacing and kerning was. Overly tight round-to-round combinations were adjusted with positive kerning. Straight-to-round combinations were similarly adjusted via kerning. Just one of the messiest fonts I had ever encountered. No wonder they had problems. After stripping the kerning out of the font. It was a simple matter to readjust the straight-to-straight and round-to-round values so that the fit needed no positive kerning. A few hours of work and it was done.\n\n"
    },
    {
      "time": " 11.May.2008 7.47am",
      "content": "James’ advice is mighty solid. This might also be helpful:\n\n[http://www.typophile.com/node/30960](http://web.archive.org/web/20080924161657/http:/www.typophile.com/node/30960 \"http://www.typophile.com/node/30960\")\n\nMost people find it is the diagonals that are especially hard. vwx and sometimes r depending on how it’s designed. You may want to leave those for last.\n\nI also recommend watching your counterspaces vs. letterspaces. You may find it’s hard to kern a design where those are not considered together. I often see new designs with really enormous counters and smaller than needed spaces between letters. The scale the type will be used also has an impact but a more subtle one.\n\n"
    },
    {
      "time": " 11.May.2008 8.14am",
      "content": "The combinations: nn nu un on no vn give you the groundwork if you ballance the counter space with the sidebearings. Don’t get all hung up on exact numerical formulae since there is much variation depending on how round or flat your curves are, how bold your strokes are, how much contrast there is in your strokes and the serif size and form if they exist. Give yourself some time to space properly and don’t be surprised if you have to do some redrawing of your glyphs to get it all to work out.\n\nChrisL\n\n"
    },
    {
      "time": " 11.May.2008 8.42am",
      "content": "One thing I would love to see in writing about type design is an examination of good spacing in existing type, explaining why a well-spaced typeface actually does work well. I have at least half-a-dozen books that repeat the Tracy formula or some variation, and that’s a waste of paper given that its on the internet anyway. Type design can be very counter-intuitive, and while I have figured out plenty of this stuff on my own, spacing is one area that really drives me nuts.\n\n"
    },
    {
      "time": " 11.May.2008 12.22pm",
      "content": "This could be interesting, yet I think this is something which every type designer needs to do for himself.  \nFor example, you might analyze typefaces by different designers or foundries in search for some common spacing laws — to find that there are none. There is nothing like good-spacing-per-se, everybody has a different approach. At least this was my conclusion so far. The differences might be minute since most people seem to start with strings like the ones sketched above, but the differences are still there. For my taste (obviously Mr Montalbano’s too), it is a frequent mistake that round letterforms get too little space and then need positive kerning. On the other hand, one could regard this as a special method.&nbsp;&nbsp;;-)&nbsp;&nbsp;For my taste, people tend to space uppercase letters (sometimes lowercase letters too) too tight and then end up with need for an endless list of kerning pairs. &c.  \nI bet that such an analysis reveals more about the judge than about the analyzed typeface’s spacing/kerning.\n\nKarsten\n\n"
    },
    {
      "time": " 11.May.2008 12.34pm",
      "content": "I would add to the excellent comments so far a couple of things.\n\nFirst, in Tracy’s defense he does say that getting the control characters spaced right is difficult and worth taking time over. He never says that there is a mechanical rule.\n\nSecond, I would add that when you are doing your first fonts, you are likely to have to revise your initial work several times.\n\nTo get the balance right between control characters right I had to do more characters and check the affect on words, and re-adjust. In the characters that don’t echo the shapes of the control characters—s, g, t, etc., I had to redraw several times to get them to space properly. And the italic was even more difficult in terms of spacing and redrawing. Hopefully, as you gain experience there is less need to do such re-working, but expect it in your first efforts.\n\nFinally, I note that there are different philosophies for handling the diagonal characters in digital type. It seems that some prefer to space them with negative side bearings, and kern them out more widely as needed. Others prefer to space them positively and kern them in negatively as needed.\n\n"
    }
  ]
}
