{
  "id": "4517",
  "title": "Quark 6 & OS X & Lions & Tigers & Bears (oh my!)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Oy vey!   \n   \nPardon me while I whine. If whining is something you find intolerable, please head to another thread. Thank you, kindly.   \n   \nFor those who've stayed, some virtual latte and croissants are on the sideboard for your enjoyment.   \n   \nGigantacorp has just made the leap to both Quark 6 and OX 10 (from Quark 4.4 and OS 9) and we are experiencing a frightening amount of glitches.   \n   \nThe main one is disappearing type when updating Quark 4 files to Quark 6.   \n   \nBefore I bore you with details, I'm curious whether anyone else has had this problem. All the type in text boxes will jump as if it overflows (with little red warning box) and thereafter be completely inaccessible.   \n   \nWe have a work-around for this, but I was hoping some type wonk could tell me what the heck is causing this and/or their own work arounds.   \n   \nThanks!\n\n",
  "author": "kristin",
  "time": "Wed, 2004-04-28 13:21",
  "uid": "1553",
  "comments": [
    {
      "time": " Wed, 2004-04-28 13:45",
      "content": "Kristin, the problem is you are still using that disaster (Quark). Save yourself and switch to InDesign CS, your Quark 4 files will translate and you'll discover something called typography.\n\n"
    },
    {
      "time": " Wed, 2004-04-28 13:52",
      "content": "Oh that I could, Daniel. I love InDesign and would prefer it. But Tar-giganti-get-saurus is a slow, lumbering dinosaur dragging its huge corpus into yesterday's technologies. InDesign is just too \"new-fangled\" for this creature! ![:-(](http://web.archive.org/web/20050516051200im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": " Wed, 2004-04-28 15:56",
      "content": "Although it's always nice to hear problems with QuarkXPress, I do feel sorry for the users who are stuck with it, particularly when it wasn't their decision.   \n   \nOn the other hand, I'm still jazzed from hearing about the recent InDesign switch party thrown by a major NYC publisher -- they were so excited about it that they rented Madison Square Gardens. Really. We didn't even put them up to it or anything, although I gather they invited some Adobe folks.   \n   \nGood luck with it, Kristen.   \n   \nT\n\n"
    },
    {
      "time": " Wed, 2004-04-28 16:32",
      "content": "Kristen,   \nOnce upon a time, I was the greatest Quark zealot ever known. After being shafted by them over many years, I have come to the opinion that their corporate stupidity is so ingrained that they can never change. I would be willing to bet that they will vanish as a company within 2 years. Maybe a developer who cares might buy XPress from them and make it good again but don't hold your breath. Your client will have to switch sooner or later. Until then, throw away 6 and go back to 4.11. You can ride 4.11 through Quark's stay in the Hospice. I bought the upgrade to 6 (like a fool) and have since dumped it in favor of InDesign when I can and Xpress 4.11 when I must.   \n   \nMy condolences,   \n   \nChris\n\n"
    },
    {
      "time": " Wed, 2004-04-28 17:43",
      "content": "Hi Tiffany! Good to see you and thanks for the links.   \n   \nThanks to the rest for your sympathy (and your use of the idiom is correct, Yves!).   \n   \nThe corp did consider InDesign and got lots of pressure from below to make the switch. Oddly enough, and as a huge surprise to our tech team, Quark actually sent a rep to headquarters to answer questions and push the upgrade.   \n   \nThe work around for the type problem is to work off-network, open the Quark 4 file and view each and every page (including master pages), THEN save the file, thus transforming the document to a Quark 6 file. Anything else will force the type outside the text boxes and into some kind of Twilight Zone.   \n   \nI'm fascinated that the act of viewing a page will save the type. It's as if each Quark 4 page wants me to say a personal goodbye before it gets absorbed into the Quark 6 (aka Borg) universe.   \n   \nIt's the kind of problem that would be fun to track down if I had tons of time and didn't have circulars and print ads and posters and brochures to produce on a deadline.   \n   \nI just can't imagine why displaying a document page on a computer screen somehow prevents the bug. For ex: we tried viewing different pages of a multiple page document and saving it in Quark 6. Each time, whichever page or pages we had not displayed was/were corrupted.   \n   \nDoes that stir any ideas among the more technically inclined typophiles? I'm mystified.\n\n"
    },
    {
      "time": " Wed, 2004-04-28 22:19",
      "content": "Who did Quark send over?   \n   \nI understand my old friend Shellie Hall has gone over to the Quark side (as an evangelist).   \n   \nT\n\n"
    },
    {
      "time": " Thu, 2004-04-29 03:51",
      "content": "Thomas,   \n   \nMadison Square Garden.\n\n"
    },
    {
      "time": " Thu, 2004-04-29 05:34",
      "content": "Thomas, I didn't meet with Quark rep, but I'm told it was a man. Probably not Shellie. ![:-)](http://web.archive.org/web/20050516051200im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " Thu, 2004-04-29 05:56",
      "content": "I'm using Quark 6 on Jaguar, and I haven't run into any bugs. I have come to the conclusion that the only reason there's such a thing as 6 is that they needed something to run on OSX... I haven't noticed any interesting differences. But then, I'm more of an Illustrator man.\n\n"
    },
    {
      "time": " Thu, 2004-04-29 09:13",
      "content": "Reminds me of a problem I had with Quark when Mac OS 7 came out -- which was solved by increasing the font cache size.   \n   \nBTW, I have been using InDesign for a couple of years, and still have not reached the level of skill which I have with Quark. Maybe I'm just hopelessly \"hard-wired\" to Quark, but I still have to look hard at the Character and Paragraph palettes in InDesign and think about what the little icons mean.   \n   \nI have the same problem with all the pretty \"icons\" in OS X, which all look the same, particularly so for Adobe CS.   \n   \nIt drives me up the  wall, like my home town has become a foreign country where I don't understand the lingo.   \n   \nHow I long for the days when my interface listed choices in plain text!   \n   \nI also had to get a new Wacom tablet for OS X, and the stylus has been redesigned with an uncomfortable bulbous head.   \n   \nApparently, I am no longer in the target market for which the tools I use have been designed.\n\n"
    },
    {
      "time": " Thu, 2004-04-29 10:31",
      "content": "Kristin, are you on Panther (10.3) or Jaguar (10.2)?\n\n"
    },
    {
      "time": " Thu, 2004-04-29 10:42",
      "content": "We just upgraded to 10.3.3 (Panther).\n\n"
    },
    {
      "time": " Thu, 2004-04-29 10:49",
      "content": "This is interesting, because I've run the demo without a hitch in Jaguar, and John B. says that he runs it fine in Jaguar as well.   \n   \nI wonder whether it's related to the OS, or QX 6's relationship to the OS. We're considering moving to QX 6 from QX 4 in a now-Jaguar, soon-to-be-Panther environment.   \n   \nPersonally, I'd rather have Panther than QX 6...\n\n"
    },
    {
      "time": " Thu, 2004-04-29 12:30",
      "content": "We use QuarkXPress 6 in Jaguar with a lot of bugs and a lot of workarounds, but I haven't seen text overflow in an old document.\n\n"
    },
    {
      "time": " Thu, 2004-04-29 12:58",
      "content": "LOL, Joseph!   \n   \nIt's good to know, via the MacMerc link posted by Tiffany, that we aren't the only people in the universe to have had this problem. I've spent my entire career using and creating work-arounds -- it's what separates the craftsperson from the neophyte.   \n   \nIt can be damn frustrating and/or intriguing depending on the proximity of the deadline!\n\n"
    }
  ]
}
