{
  "id": "45174",
  "title": "Logotype & graphical profile, need protip",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I’m applying to a school for digital media and would like to hear some professional opinion. The work sample is a logotype and a graphical profile (choice of colors and typefaces) for a digital media campaign aimed at young people (18—26). The purpose of the campaign is to improve the housing situation for young people in bigger cities through promoting community living in a fresh way.\n\nDoes it appeal to the target audience? Are the type choices appropriate?  \nAny other thoughts, opinions, ideas?\n\n ![](http://web.archive.org/web/20150425040819im_/http:/typophile.com/files/kollektiv_profile_4376.png)\n\n",
  "author": "jams",
  "time": "9 May 2008 — 11:57am",
  "uid": "30497",
  "comments": [
    {
      "time": "9 May 2008 — 12:04pm",
      "content": "Is that supposed to say “kollektiv?”\n\n"
    },
    {
      "time": "9 May 2008 — 12:13pm",
      "content": "You read well. I’ve been unsure about the legibility of the v, but found this to be the best solution for the overall appearance.\n\n"
    },
    {
      "time": "9 May 2008 — 12:25pm",
      "content": "Sun Serif is a proprietary typeface of Sun Microsystems, so not only is not free to use, but if you're not a Sun employee or partner you probably shouldn't let it be known that you have it. These are the pitfalls of acquiring fonts from scurrilous sources.\n\n"
    },
    {
      "time": "9 May 2008 — 12:37pm",
      "content": "I’ve read that Sun has moved away from sun serif, here:  \n [http://archive.netbsd.se/?ml=opensolaris-mktg&a=2006-04&t=1914706](http://web.archive.org/web/20150425040819/http:/archive.netbsd.se/?ml=opensolaris-mktg&a=2006-04&t=1914706 \"http://archive.netbsd.se/?ml=opensolaris-mktg&a=2006-04&t=1914706\")\n\nThis site states \"Sun offers two free font families by Luc(as) de Groot (1997): Sun Sans, Sun Serif.\":  \n [http://cg.scs.carleton.ca/~luc/math.html](http://web.archive.org/web/20150425040819/http:/cg.scs.carleton.ca/~luc/math.html \"http://cg.scs.carleton.ca/~luc/math.html\")\n\nSun Serif is also used in the Independet:  \n [http://www.independent.co.uk/news/media/a-new-look-for-the-original-qual...](http://web.archive.org/web/20150425040819/http:/www.independent.co.uk/news/media/a-new-look-for-the-original-quality-compact-newspaper-746159.html \"http://www.independent.co.uk/news/media/a-new-look-for-the-original-quality-compact-newspaper-746159.html\")\n\n"
    },
    {
      "time": "9 May 2008 — 12:40pm",
      "content": "<cite>This site states “Sun offers two free font families by Luc(as) de Groot (1997): Sun Sans, Sun Serif.”:</cite>\n\nDon’t believe everything you read on the internet. Especially on that page. That website is a resource for people working on Sun Microsystems branding, not people who want free fonts.\n\n"
    },
    {
      "time": "9 May 2008 — 12:54pm",
      "content": "I’m just confused about the availability of the font, as Sun has moved away from it and the Independent uses it. Of course I would purchase the appropriate licences if this was a real campaign and the font would not be free to use.\n\n"
    },
    {
      "time": "9 May 2008 — 1:25pm",
      "content": "AntiquaSun seems to be the commercial equivalent from Luasfonts. Should I go with that one, or choose something default like Georgia? Thank you for making this clear for me.\n\n[http://www.lucasfonts.com/cgi-bin/loadframe/lucasfnt/antisun/antisun-.html](http://web.archive.org/web/20150425040819/http:/www.lucasfonts.com/cgi-bin/loadframe/lucasfnt/antisun/antisun-.html \"http://www.lucasfonts.com/cgi-bin/loadframe/lucasfnt/antisun/antisun-.html\")\n\n"
    },
    {
      "time": "9 May 2008 — 1:39pm",
      "content": "Oh yes, that's the alternative for public licensing. I'm sorry I neglected to mention it.\n\n"
    },
    {
      "time": "9 May 2008 — 7:09pm",
      "content": "Jeg liker den Max, men jeg lurer på om logoen kanskje prøver litt for hardt å være kul.\n\n"
    },
    {
      "time": "9 May 2008 — 8:27pm",
      "content": "the \"t\" and \"v\" is very hard to read.\n\n"
    },
    {
      "time": "11 May 2008 — 4:44pm",
      "content": "I am 18-26 and I really like it.  \nI'm not sure if all those fonts really go together though. If you had picked Sun before I assume Georgia isn't your body copy web font? What's it for?\n\n"
    },
    {
      "time": "11 May 2008 — 6:55pm",
      "content": "I was thinking about using sun as the font for body copy in everything else, but the web. Georgia came just from my frustration, and the ease of use on the web. Maybe I should go with TheAntiquaSun. I think it is subtle, yet quite strict and massive, and it has the same x-height as the extra light.\n\n ![](http://web.archive.org/web/20150425040819im_/http:/typophile.com/files/fonts_4283.png)\n\n"
    },
    {
      "time": "11 May 2008 — 9:37pm",
      "content": "Yeah that would be a nice fit. Maybe just have to be careful with how prominent you make the logo compared with how big the body/header fonts are. There's a lot of style going on here.\n\n"
    }
  ]
}
