{
  "id": "45187",
  "title": "InDesign to Quark",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all, does anyone know why a InDesign document created on a PC does not open in InDesign on another PC or Mac and cannot be imported into Quark?? Quark is Version 7.01 Indesign is CS1 version 3. All the plug in updates have been done.  \nThanks Tony\n\n [‹ Very condensed font suggestions?](http://web.archive.org/web/20081102022605/http:/www.typophile.com/node/18248 \"Go to previous forum topic\") [Web Font equivalent to Vialog ›](http://web.archive.org/web/20081102022605/http:/www.typophile.com/node/45282 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081102022605/http://www.typophile.com/user/30793\" title=\"View user profile.\">tonygunn</a>",
  "time": "<br>",
  "uid": "30793",
  "comments": [
    {
      "time": " 10.May.2008 2.53am",
      "content": "I’m not sure, but firstly I don’t think Quark has the functionality to import Indesign files. Furthermore, even Indesign has problems importing Quark files unless they’re saved as version 4 files in Quark. Why an Indesign file won’t open from PC to Mac I can’t be certain other than with possible PC vs. Mac font issues. Are the two versions of Indesign on the Mac and PC the same?\n\nSorry I can’t shed any further light.\n\nJH\n\n"
    },
    {
      "time": " 10.May.2008 8.23am",
      "content": "I cannot shed any light on this either. I have enough headaches with InDesign - like it condensing graphics brought in - will not let me see whole graphic — too busy expanding it to fit area rather than give me my entire photo... etc. etc. - oh wait, my favorite - not allowing me to change color of type. Must quit out, wait about 10 minutes, go back in and then it allows it... very quirky - more so than Quark ever was.\n\nBut... if you need help right away maybe these time savers can help you: Could you try to save it as a PDF - and then open you can bring it to any computer - and import the “graphic” into Quark. If you have Acrobat or Illustrator on the other computers you can then edit it...\n\nSorry I can’t be more helpful. Have I told you lately: I don’t like InDesign? I think I’ve finally become an old dog that doesn’t want to learn a new trick.\n\n"
    },
    {
      "time": " 10.May.2008 12.25pm",
      "content": "Jackie, Never had any of those problems with InDesign - might try reinstalling the program, or could be a third party plug-in conflict. Tony, The Quark Version is way newer than the InDesign one - that might be the issue - back when I was on CS1 and Quark 4 you could open Quark files in InDesign.\n\n"
    },
    {
      "time": " 10.May.2008 4.33pm",
      "content": "Does it come up with an error?... or anything? It could be a CS2 or CS3 Indesign file?...  \nCS1 version 3? you will still need CS3\n\n"
    },
    {
      "time": " 11.May.2008 9.40am",
      "content": "<cite>back when I was on CS1 and Quark 4 you could open Quark files in InDesign.</cite>\n\nInDesign does not seem to have upgraded its ability to import Quark files, which is very frustrating. It was enormously helpful to me when I was learning InD that I could open Quark files into it. But alas no more.\n\nI have never known Quark to be able to import InDesign files. And Jackie, I haven’t had your sorts of problems with InDesign either. I have my own gripes with InD (lack of kerning tables, the fact that there is no key command for Text Frame Options as Quark has, the completely retarded Links pane - why do you have to manually update each image when they are all in the same folder???)\n\n"
    },
    {
      "time": " 11.May.2008 9.54am",
      "content": "As others have already said, QuarkXPress does not open Adobe InDesign files.\n\nMake sure you have the same versions of InDesign running on PC and Mac... I can’t think of any other reason it wouldn’t open. Jackie’s PDF suggestion is a good one.\n\n"
    },
    {
      "time": " 11.May.2008 3.36pm",
      "content": "Thanks Ricardo -\n\nAs the production side of my brain says “get the job out now” I always look for the route around - may not be the fastest — but it gets the job out. Then I’ll, if I get the breather, reinstall.\n\nIn the case of InDesign - I’m still on CS1 because I cannot justify spending money to upgrade. The client that insists I use it — has now found a new bone to pick... I wrote about it here earlier. Seems no one has noticed a “trapping” problem. I just received a printed proof — I hadn’t a clue what they were talking about — then hubby pulled out a loupe to show me. He also commented, “Do they give a loupe to every person who buys a book from this series.”\n\nSo first they picked on me to get InDesign, and now I think they are picking on me to give the work to the printer. Just my regular NY paranoia...\n\nand Ricardo, you should see me pick apart the RGB PDFs that come in for reproduction — fun fun!\n\n"
    },
    {
      "time": " 11.May.2008 10.29pm",
      "content": "\\> _the completely retarded Links pane - why do you have to manually update each image when they are all in the same folder???_\n\nI find that annoying too. If there are a lot of images to update which live in the same folder, what I usually do is update one of them, save the document, and close it. All the remaining links will be automatically updated once the document is reopened.\n\n"
    },
    {
      "time": " 12.May.2008 2.18am",
      "content": "Re the links pane:  \nI have to say that I don’t know what you’re talking about. That is, I vaguely recall some inconvenient behaviour in the past. But with ID CS3 (v5; on OSX.5), I haven’t experienced such problems:  \nWhen the .indd-document resides in the same folder as the linked files, I can move the folder and won’t have to update any broken links. When the .indd sits somewhere else and I have moved/renamed the links folder, I have to update merely _one_ link. The rest is fixed automatically. I don’t know how you can improve on that.\n\n<cite>the fact that there is no key command for Text Frame Options as Quark has</cite>\n\nWhat can you do via these Quark Text Frame Options? Just curious.  \nF\n\n"
    },
    {
      "time": " 12.May.2008 2.30am",
      "content": "@PattyFab: you can create your own shortcut keys... Indesign has the option to use the Quark shortcut key options...\n\nanyway without hijacking, Tony did you sort it out, what version of CS are you CS1, CS2 or CS3 indesign, not CS1 version 3... you could be trying to opening a CS3 Indesign file?... on a old version of Indesign?.\n\nAlso text frame options in Indesign shortcut is: ’command’ + ’b’ it is in the ’object’ menu called ’text frame options’\n\n"
    },
    {
      "time": " 12.May.2008 6.50am",
      "content": "Miguel, that’s a good tip, thanks.\n\nFlorian, maybe what you’re talking about is a feature of CS 3 which I have yet to install. I will be installing it soon tho, just ordered a new MacBook Pro! Quark’s equivalent of Text Frame Options is called Modify and it’s essentially the same thing, but accessible by a simple command + M, rather than going to a drop down.\n\nPaul - command B doesn’t give me the window I want. I am talking about the window “Text Frame Options” under Object. The pane that lets you make columns or center text in a window - or ignore text wrap. But yes, I do use the Quark key commands - that’s the only way I can work in InD. I used Quark for about 15 years before I learned InD and trying to un-learn it would have been a nightmare.\n\n"
    },
    {
      "time": " 12.May.2008 9.06am",
      "content": "Patty, what Paul said:  \nGo to _Edit \\> Keyboard Shortcuts ..._ . There, select _Object Menu_ in the drop-down list, scroll down to _Text Frame Options_, select it. Key in a new keyboard shortcut (Command-M, if you like so) and assign it.\n\nF\n\n"
    },
    {
      "time": " 12.May.2008 9.27am",
      "content": "Thanks - that was really helpful. I did make it command+M since I never ever ever use the “minimize” feature and get really annoyed when I hit that accidentally.\n\n"
    },
    {
      "time": " 12.May.2008 11.49am",
      "content": "You’re welcome! :—)  \nYep. No-one needs ‘minimize’ when there’s ⌘⇥, ⌘\\</\\> and Exposé!\n\n"
    },
    {
      "time": " 12.May.2008 12.09pm",
      "content": "My favorite is Hide (⌘H), which unfortunately doesn’t work that well on Leopard :^(\n\n"
    },
    {
      "time": " 12.May.2008 12.14pm",
      "content": "I just hit option and click outside the window and it goes away. That is a carry over from OS 9 even.\n\n"
    },
    {
      "time": " 12.May.2008 12.27pm",
      "content": "To import an InDesign file into an older version of InDesign, you must first EXPORT it to the INDESIGN INTERCHANGE format. This might also help resolve PC to Mac issues, although I have not tried it. Of course, any new functions not supported in the older version will be disabled and might mess up your files in surprising ways.  \nIn my opinion, InDesign CS3 is worth the money. It handles transparency much better. If you are still working with Illustrator CS, an upgrade to the new Creative Suite 3 will give you some amazing new color tools.\n\nI was a Quark user for many years too, but have happily made the switch.\n\n"
    },
    {
      "time": " 12.May.2008 9.50pm",
      "content": "For many years I struggled with Quark and after 4 versions of Indesign I would never go back to Quark. Each version of Indesign gets better while Quark tries to play catchup.\n\n"
    },
    {
      "time": " 13.May.2008 6.09am",
      "content": "If your looking for a plugin to convert InDesign to Quark and can justify the price tag (US$199) here you go:\n\n[www.markzware.com/id2q/](http://web.archive.org/web/20081102022605/http:/www.markzware.com/id2q/ \"www.markzware.com/id2q/\")\n\nI’ve only used the Quark to InDesign plugin in both CS2 & CS3 (Quark 6 originals), saved a lot of time on a certain project which out weighed the cost. Imports all style sheets, guides etc. As usual remember that nothing is perfect, you’ll definitely have to watch out for any manual kerning and double check that all styles sheets are working as intended. At the end of the day a lot quicker than recreating multiple documents.\n\nHope it helps.\n\n"
    },
    {
      "time": " 13.May.2008 8.33am",
      "content": "Wow, many good tips here. Adrian, it’s great to know that Markzware has such a thing.\n\nJackie said, _In the case of InDesign - I’m still on CS1 because I cannot justify spending money to upgrade._\n\nJackie, even I have to admit that Adobe has made many improvements to InDesign since CS1... On the other hand, if you’ve got XPress version 7, then I think you can live without InDesign. :-)\n\n"
    }
  ]
}
