{
  "id": "45196",
  "title": "Best School for Graphic Design in New York?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "It seems like Cooper Union is best for fine arts in many ways, and Parsons is up there for fashion.\n\nBut what is the best school for Graphic Design? Parsons? SVA?\n\n",
  "author": "evilfansanfran",
  "time": "10 May 2008 — 2:22pm",
  "uid": "8034",
  "comments": [
    {
      "time": "10 May 2008 — 2:37pm",
      "content": "Why incur all that debt for a graphic design education. Buy a computer, get some software and study like hell on your own. You'd probably end up ahead of the game in the long run. Do you really want to invest in $200,000.00 in an education that will prepare you to do classified ads on some Long Island newspaper for $12 per hour?\n\n"
    },
    {
      "time": "10 May 2008 — 2:49pm",
      "content": "Whoa. Bitter.\n\n"
    },
    {
      "time": "10 May 2008 — 4:25pm",
      "content": "James, are you going to hire all the uneducated wannabe designers with nothing more than a Mac and a bunch of back issues of _Computer Arts Projects_?\n\n"
    },
    {
      "time": "10 May 2008 — 4:52pm",
      "content": "I'm not gonna hire anyone. I'm a one person operation and will always be a one person shop.\n\nI just think one should think long and hard about plucking down their hard earned cash for an \"education\" in graphic design. That's all.\n\nAnd if you can come up with a killer portfolio without all the nonsense you go through in \"higher education\" good for you. There are certainly many more resources that the average person can take advantage of now, then when I was learning this stuff. And I learned this stuff on the job, cranking out work in a type shop with a studio manager screaming at me and all the other bull pen jockeys all day long. I came into the business knowing a lot about print production, showed an ok portfolio, lied to get the job, put my head down, made myself useful and learned all I could. I sort of look at it as \"lower education\". That was after my university and graduate school days. But I got an education at school, not vocational training. And believe me I know the difference since I have my B. A and my M.Ed. in Vocational Education.\n\nWhich leads me to another point that most designers who teach at design schools are terrible teachers, since they have never been trained to be teachers. But that is another thread on another day...\n\n"
    },
    {
      "time": "10 May 2008 — 4:57pm",
      "content": "Evilfansanfran,\n\nI'm not bitter at all. I have nothing to be bitter about. I have a great job and a great life. I'm just offering an opinion that you can take or leave. No sweat off my arse.\n\n"
    },
    {
      "time": "10 May 2008 — 5:56pm",
      "content": "I'd say SVA is the most commercial, in the sense that it is very career-oriented as opposed to theoretical (which makes sense, since it started as a trade school after WW2), and most of the instructors there are not professional teachers, they're professional designers who happen to teach a class or two a week (which James seems to think is a bad thing, but I couldn't disagree more). Every school in NYC has working artists teaching, though, it's just a matter of proportion and finding the faculty that you fit with best. In any other city you'd have to worry more about professional teachers with no real experience.\n\nThere's such a volume of talented artists there who enjoy teaching that you can find a good mentor at any school. And ultimately that's what it boils down to, and what you can never learn with practice or books or the web -- making connections, with both faculty and students. The best thing that can happen to you is that you have an instructor you get along with, you mentor with them and get help lining up those first few critical jobs.\n\nYou can also easily spend a ton of money and get nothing out of it -- the standards are pretty low at most schools, and you can easily go through four years and not improve or put any effort in. Successfully navigating through an art school is much, much more difficult than getting through a typical bachelor's program. You very much get out of it what you put into it.\n\n"
    },
    {
      "time": "10 May 2008 — 9:55pm",
      "content": " Well Cooper's free, so no $200,000 debt. Don't myself know about what the School of Art has to offer (I'm in Engineering), but there are Typophiles who there. I'll see if I get get someone to comment.  \n—Joel\n\n"
    },
    {
      "time": "10 May 2008 — 10:45pm",
      "content": "Hello,  \nI currently attend Cooper Union. I'm finishing up my sophomore year (3 days left!)  \nWe don't have declared majors, and you can only take a certain amount of credits each year in a certain field. Freshman year is foundation, sophomore you can take .. 6 credits per semester in graphic design junior year you can take 9 per semester, and senior year is unlimited). I don't know much about other schools' graphic design programs, and have only had so much experience here with design because I'm in my sophomore year. That said, I have already encountered some really great professors.. and some not-so-great. That'll occur anywhere, though, of course.\n\nProfessors I have had have been very supportive and excited to help me. I can't really comment on how commercially-geared the courses are. It really varies from professor to professor.\n\nThere seems.. at least in my year.. to be not a high interest in design here. I've heard the school goes through phases. For instance, there was a time when it was \"uncool\" to concentrate in painting. That may be the case with design now; who knows. A lot of my classes have people for whom graphic design is not a passion; they simply signed up for the class to fulfill a curiosity about graphic design. This, to me, is both a positive and negative thing in terms of class critiques..\n\nMy best advice would be to look at the websites of whatever schools you're interested in. Most have online galleries of student work.. and some even have faculty work.\n\nSorry this is such a poorly structured/written reply. My keyboard is messed up and I'm tired. Anyway, I'd be happy to answer any questions you may have!\n\nJohanna\n\n"
    },
    {
      "time": "11 May 2008 — 9:48am",
      "content": "<cite>For instance, there was a time when it was “uncool” to concentrate in painting.</cite>\n\nIf you spend your life worrying about things like that you'll never achieve anything.\n\nAre you looking for undergrad or graduate education? If the former I'd say don't focus too early - my best advice is to attend a liberal arts school with a strong art/graphic department and keep your options open until you are sure you want to be a designer. Your undergraduate education is the last real chance you get to explore like that, why go to trade school? If graduate school I'd say work a few years first, try to get an internship or entry level job at a design studio (picking up whatever small freelance projects you can along the way) and see where that gets you before you go into debt on a graduate program that has dubious career benefits.\n\nMeanwhile from what I understand your best best are probably SVA or Pratt. I have not heard great things about the student quality at Parsons - it seems the students there are trying to get good grades and not pushing themselves creatively. A friend of mine taught there and he got frustrated with the lack of curiosity and initiative among the students.\n\n"
    },
    {
      "time": "12 May 2008 — 9:32am",
      "content": "There's something to be said both for dropping $200,000 on an education, and for getting a BFA from the streets. A nice compromise would be to grab your degree at a less expensive place, such as a CUNY or SUNY school (I recommend SUNY Purchase as the IKEA to my alma mater's Crate & Barrel). I really don't think there's as much of a qualitative difference between institutions as there is between students.\n\nSeriously. Go cheaper. It's the best of both worlds.\n\n"
    },
    {
      "time": "12 May 2008 — 9:35am",
      "content": "I second Pattyfab's comments....\n\nDon't count out liberal arts schools. A good liberal arts school will teach you how to think critically, be curious and write well. All are needed skills for a graphic designer. I count my BA at a liberal arts school as important as my AAS in graphic design. I found the art school experience a bit too much of an insular, hot house environment. I missed meeting people from other studies, like science, history, math and political science. They showed me different perspectives of the world.\n\nAnd I would also heartily (bitterly?) second Pattyfab's other comment about Parsons.\n\n"
    },
    {
      "time": "12 May 2008 — 10:36am",
      "content": "I entered college an art major and graduated with a degree in art. However, the best classes I took were not necessarily art classes. I studied Philosophy, Astronomy, Dance, Psych, Dostoevsky, Evolution, the Atom Bomb (this was still the cold war) and the Old Testament among other subjects. I actually regret that I was so focused on art, art history and film - I could have broadened myself even further while I had the chance. My school had an amazing music department and I'm very sorry I didn't take advantage beyond going to a few gamelan concerts. There is plenty of time to focus after you graduate. Any future employer who would penalize you for not having a graphics degree from Cooper Union or SVA is probably not someone you want to work for anyway. One of best art directors I ever worked for had a literature degree from Skidmore.\n\nFor fashion, don't forget FIT.\n\n"
    },
    {
      "time": "12 May 2008 — 11:45am",
      "content": "<cite>I have not heard great things about the student quality at Parsons - it seems the students there are trying to get good grades and not pushing themselves creatively.</cite>\n\nI’ve known some Parsons students, and it seems like one huge problem there is the mandatory 6-class workload, which can really crush some people and pressure them into just getting stuff done.\n\n"
    },
    {
      "time": "12 May 2008 — 12:17pm",
      "content": "(Trying hard not to cause offense with this comment) my friend said a lot of his students at Parsons were Asian women, and they just did not talk in class. It may be something cultural. He felt like he couldn't tell if they were interested or not since they didn't contribute, just did the assignments.\n\n"
    },
    {
      "time": "12 May 2008 — 12:23pm",
      "content": "I found that problem with design students in general, regardless of gender of national origin. I’ve had plenty of classes in which the instructor either made everyone speak for a timed period, or simply did all of the critiques himself. And being the only person willing to say anything during a crit, I’m also the guy everyone can’t stand, because the last thing anyone wants to be told is that they just tossed a free grunge font over a cheap stock photo at 4am and used a diagonal baseline to try and pass the whole thing off as frenetic.\n\n"
    },
    {
      "time": "12 May 2008 — 1:27pm",
      "content": "I had a friend who studied Fashion Design at FIT. She paid a fraction of the tuition of Parsons, and most of her instructors taught at Parsons as well. In this world of designer-as-part-time instructor, getting to know who the part-time faculty are in the various schools around town, could save you a bunch on tuition.\n\n"
    },
    {
      "time": "12 May 2008 — 2:17pm",
      "content": "I had this issue with students when teaching design, and if they do not talk in class I make sure they talk to me, because if one doesn't get over isolation in a design class, one doesn't get a grade, from me. This is different from teaching art, I think. I also think this is a teaching issue, and not indicative of a single program's worthiness for GD teaching. And lastly, I think that going to design school or not, is an individual thing. James de Terminator is right, everyone can state their opinion, but I wonder if his is even the advice he'll have for his own young. In addition, on the same topic, once someone has appealed for advice after making the decision to, why not lighten up!? :)\n\nCheers!\n\n"
    },
    {
      "time": "12 May 2008 — 3:18pm",
      "content": "I have no young, David, so I guess I'm free to offer good or bad advice. Or both at the same time!\n\nOne year older, but not deeper in debt!\n\nPrego.\n\n"
    },
    {
      "time": "13 May 2008 — 9:08am",
      "content": "The best school anywhere for graphic design, or any other subject, is in one's skull. And only there.\n\nAside from the networking and resume advantages, schools offer no real advantages to folks who can generate the good ideas that are the core of our practice. Ultimately, craft and execution can be picked up anywhere, or delegated to those who can do them best. It's the ideas that matter and that ability can't really be taught. Practiced, yes. But frankly, some people are just good at coming up with ideas for visual communication and some aren't. A pricey school won't make you the former.\n\nPersonally, I didn't go to a brand school so I am biased against dropping a ton of money on a label. Just as going to Harvard Business School doesn't make you a genius entrepreneur (see: Bush, George ), so too going to any well-known NYC design institution doesn't necessarily make you anything more than another pixel pusher with a heavy debt load. At the end of it -- do you have any ideas worth communicating? That's what I want to know. Everything else can be taught and picked up. [Have you been to the \"graphic design\" section of book stores these days?] Including, yes, nazi-ish kerning.\n\nIf I had gone to a name school, it would have been an easier path for me -- I'm a senior designer at a major publisher here in New York -- but then I wouldn't have worked my butt off on a crazy project that ultimately landed me this job. Not the most linear way to go about a career but then, life is more interesting than straight lines. It's the work and ideas that ultimately matter, not the pedigree. Frankly, when I'm interviewing, I don't care where you're from. Could care less. Have some interesting ideas? That's what I want to see.\n\nIt is worth noting that many, many people don't have jobs in anything remotely related to what they went to college for. Myself included -- I have a degree in journalism (which is what I settled on after I stopped doing electrical engineering). So, I would say don't break the bank on a piece of paper -- it's the stuff in your head that really counts in this world.\n\n"
    },
    {
      "time": "13 May 2008 — 11:58am",
      "content": "I just finished up my sophomore year at SVA for graphic design. Sophomores are required to take seven classes (Basic Typography, Basic Graphic Design, Computers in the Studio, Drawing, Visual Literacy, History of Graphic Design and one Humanitiy class each semester)\n\nThe workload is huge, and sometimes feels unbearable, but I feel as though I got a LOT out of the classes I was required to take this year. SVA, like many other art schools, give you back what you put into it. Some students coast while others work their asses off.\n\nThe teachers at SVA are all working in the field they teach, so they are up-to-date with everything going on in the design world and they are also great for making connections and networking.\n\nI have not really had any bad experiences with my teachers at SVA, and I would recommend SVA to anyone searching for a great graphic design school.\n\n"
    },
    {
      "time": "13 May 2008 — 12:16pm",
      "content": "There are many good schools in New York City for Graphic Arts - it depends on which field you want to apply yourself in. I would have expected your question to raise a rivalry between the schools - instead I am very surprised at the type of answers you are receiving.\n\nFirstly, college gives you a few more years to grow up and mature in. For some students, this is all they are looking for, as they are too young to enter the marketplace.\n\nFor some, it's to acquire new skills or open their minds to new ideas. For some it means learning there is more to art than Madonna and Child. For others it means there is more to life than what transpired in their small home town. College/University can give you a chance to solve problems - to really think your thoughts through. So many think they can do that, surprise is on them. Well, that is -- if you are fortunate to have a true intellectual as a professor -- just takes one - so you don't have to worry about all the professors and student instructors that you may have to sit through. You can learn - yes, even in a fox hole -- you can learn.\n\nI don't know which schools you have looked into or which areas you may want to concentrate on. School of Visual Arts was always progressive (and from the readings above, I don't think that has changed, fortunately!). Pratt turns out excellent students, so does Cooper Union and the Fashion Institute. Also, not mentioned above are a few technical colleges around the city -- some of which specialize in the trades - such as printing. These too are graphic art schools, just maybe not what the above crowd is speaking of.\n\nIf you are in High School right now -- try to speak to 1) your art teacher and 2) your guidance counselor. Narrow down what field you might want to select, your art teacher should be a great help for that as well as steer you towards the right place. Make appointments to meet the admission staff of each of the schools you are interested in. Get the school tours -- see for yourself where you'd feel comfortable.\n\nGraphic Design artists have come from all walks. Yes several went to RISD or SCAD or SVA, etc. some just had the opportunity of training with art directors (whose credentials could make your head spin) in bullpens throughout the publishing and advertising worlds.\n\nGood luck - it's your future, I hope you decide wisely.\n\n"
    },
    {
      "time": "13 May 2008 — 2:33pm",
      "content": "I attended Pratt for two years. Do not even get me started!\n\nv\n\nps. jabzoog. do these four letters mean anything to you- r h m b?  \nhaha\n\n"
    },
    {
      "time": "13 May 2008 — 4:03pm",
      "content": "<cite>they’re professional designers who happen to teach a class or two a week (which James seems to think is a bad thing, but I couldn’t disagree more). </cite>\n\nI don't think this is by itself a bad thing. I just wanted to make the point that teaching is a skill unto itself. Just because someone is a great designer does not mean they are a great teacher.\n\n"
    },
    {
      "time": "13 May 2008 — 4:09pm",
      "content": "I got a four-year degree from an art school. Not a terribly well-known one, but I think everyone I graduated with in design is working in the industry in some capacity. That said, a lot of them are buried in debt, and might be working on the same level as someone with a 2-year AA who spent $4000 for their whole education. Or they might be working alongside someone who got an MFA from an expensive east coast school and is $100,000 in debt, and is making the same amount as them.\n\nWhat I think an expensive art school gives you is contacts: think of it as the George W. Bush model of success. The importance of knowing the right people in design can't be overstated. With some design schools pushing 40K/yr. now, a lot of design schools are going to need to start coming up with real statistics about the ROI you'll get for buying one of their expensive degrees, though.\n\n"
    },
    {
      "time": "13 May 2008 — 4:22pm",
      "content": "Get yourself a liberal arts education. Don't pigeonhole yourself. It's important to be well-rounded.\n\n"
    },
    {
      "time": "14 May 2008 — 5:22am",
      "content": "In two days, I will be graduating from SVA. I took a handful of humanities classes at FIT every summer (once enrolled you're allowed a total of 9 credits from another school) and every teacher I met at FIT was \"retired\" from SVA, in that they were no longer practicing professionals, but still in love with teaching, so they went to teach at FIT. I went to SVA directly from high school, thinking that deciding on design early on was a good thing. In retrospect, I think even a year at a liberal arts school may have paid off for me. I just didn't want to dilly dally for two years until I had to declare a major, I wanted to go in head first. That is not to say that the humanities department is lacking, we have amazing teachers which for some reason are usually ignored, because people choose the easy classes so they can focus on their studio classes, I chose the hard ones because I didn't want to waste my tuition money on a journal class (a mixture of writing in your dairy and show and tell).\n\nFly over here, tour the schools, see which facilities you can picture yourself working in for hours and days on end. I know SVA's computer labs were ridiculously packed this year, forcing me to work at home where I'm more likely to randomly get up and bake some zucchini bread instead of focusing.\n\nIt's too late for me to regret the amount of money spent on tuition, and I won't know if it was REALLY worth it for awhile. All I do know is that every single freelance job I've had in the last three years I have in some way met the person at or through SVA.\n\nFeel free to ask me anything!\n\n"
    },
    {
      "time": "14 May 2008 — 5:36am",
      "content": "<cite>Get yourself a liberal arts education. Don’t pigeonhole yourself. It’s important to be well-rounded.</cite>\n\nWell-rounded liberal arts educations are a wank. It’s just like high-school except that instead of learning lots of irrelevant factoids and taking an exam, one learns lots of irrelevant factoids and writes a term paper before taking an exam. There’s plenty of room for lit and philosophy in a good design program; but design offers the advantage of not wasting one’s time on phys ed. and fetal pig dissection labs.\n\nSomewhere or other I recently heard some business types pointing out that in today’s global economy smart educated people have become a dime a dozen. Real value is now in creative minds, and the men and women adept at thinking of new solutions to new problems will be the next generation of business leaders.\n\n"
    },
    {
      "time": "14 May 2008 — 6:12am",
      "content": "Just to get it straight, Cooper Union is free for New York residents only.\n\nAs an design educator at Buffalo State College, in Buffalo, NY, students will get out of their education what they put into it. My best students (and I would hold them up to any Parsons, Cooper Union, etc. student) are those who are have a driving curiosity to learn and experience design from many different perspectives. They are the students that go the extra mile to research techniques, paper, methods of execution, etc. that cannot be touched upon in the classroom. Why, because as educators we are trying to balance the need for technical instruction and design asthetics. In addition, you have a classroom of adult learners who are on all different levels and that takes lots of individual attention.\n\nMy advice is take tours of schools that interest you and talk to the students not administrators or even teachers. Have the department put you in touch with an alumni that can relate to you their after college experience. You will find out much more about an institution than any brochure or website can provide.\n\n"
    },
    {
      "time": "14 May 2008 — 6:31am",
      "content": "Design schools are not an injection mould where students are quick-formed into designers. There is plenty of work to be done by those with open minds and questioning spirits. If you want to learn, you will, if not stay home.\n\nChrisL\n\n"
    },
    {
      "time": "14 May 2008 — 7:20am",
      "content": "The best way to learn design skills is in a vocational school taught by professionals. The best way to get an appropiate education for a designer to put it all in contest is in culture & communication courses at university. I would say that hoolia\\_d has the right idea. That being said, pgariepy and dezcom make the best point; you get out of it what you put in.\n\n"
    },
    {
      "time": "14 May 2008 — 8:17am",
      "content": "\\>Well-rounded liberal arts educations are a wank. It’s just like high-school except that instead of learning lots of irrelevant factoids and taking an exam, one learns lots of irrelevant factoids and writes a term paper before taking an exam.\n\nJames, I think you are off the mark here. If the liberal arts education is good, it doesn't just give factoids. It teaches you critical thinking and gives you a framework and understanding to analyze problems in many fields.\n\nI have noticed on Typophile that in the field of type design many of the best designers have wide ranging knowledge and interests, and have something to say of interest in many subject areas. How much they are self-taught and what role formal education played I can't say, but their discussions do reflect a liberal education.\n\n"
    },
    {
      "time": "14 May 2008 — 8:44am",
      "content": "<cite>Somewhere or other I recently heard some business types pointing out that in today’s global economy smart educated people have become a dime a dozen. Real value is now in creative minds, and the men and women adept at thinking of new solutions to new problems will be the next generation of business leaders.</cite>\n\nBusiness Week ran a story last year touting that the MFA is the new MBA. (another excuse for designer graduates to put off the hard work of making a living)\n\nI went to a seminar on the subject, sponsored by the magazine, and while several of the speakers were entertaining, it was still the standard \"Business Speak\" with a few design terms thrown in. The one almost everyone was enthralled with was \"Innovation\". Innovate here, Innovate there. Team Innovation, Facilitating Innovation. Fostering Innovation, Rewarding Innovation.\n\nIt all reminded me of a advertising design director who commented on some test words that I sent him for a new font proposal for his latest campaign.\n\n\"I like it\", he said. \"But I was hoping for something more optimistic.\"\n\n\"Optimistic,\" I asked.\n\n\"Yes you know, like forward leaning.\"\n\n\"An Italic?\"\n\n\"Yes like and Italic, or maybe we could put some lines in to connote speed. What I'm saying to all the people working on this campaign, is that the solution should be musical, so why don't you do another round and this time listen to some good music while you are drawing the test word.\"\n\n"
    },
    {
      "time": "14 May 2008 — 8:54am",
      "content": "Wow James, you are awfully cranky lately! Final exams? Spring allergies? From whence stems your pronouncements on liberal arts educations - aren't you in design school?\n\nAny education necessarily depends on the quality of the teaching and the initiative of the student. A motivated student can get a great education at a crappy school, a lame student can graduate from Yale (c.f. George W) with a degree in partying his ass off. Another factor is the general quality of the student body. My university had a reputation for having a great art department. By and large that wasn't exactly true but it attracted very talented students and the dialogue was really interesting.\n\nThe debate on whether to get a design degree will no doubt rage on here at Typophile, but it is probably useful for an aspiring designer to learn what path other successful designers have taken and what they thought of their education.\n\n"
    },
    {
      "time": "14 May 2008 — 9:08am",
      "content": "terminaldesign, I think you should send that one to [http://adverbatims.blogspot.com/](http://web.archive.org/web/20150307043938/http:/adverbatims.blogspot.com/ \"http://adverbatims.blogspot.com/\")\n\nFrom the designers I've seen who get what you might call a \"liberal arts design degree\" (something like 2/3 liberal arts classes and 1/3 design), typically labeled as a BA, they don't exit with much of anything -- they need more time to develop their design skills & thinking, and they've taken a bunch of 100 level courses in anything and everything. I think getting a BFA (usually 2/3 art/design classes and 1/3 liberal arts) is much more successful at preparing you to be a professional designer, just because there's so much that has to be crammed into four years.\n\nThat said, I don't think everyone majoring in design is necessarily looking to work as a designer. It can be just another form of majoring in Spanish or International Studies -- something you're interested in when you're 20, and a stop along your path to getting a real estate license. I don't find anything wrong with this. Design is a great tool for self-discovery.\n\nI find it hard to believe designers will ever be business leaders, just because there's a certain type of person who's typically attracted to design, and they're not the Donald Trumps of the world. There's a certain type of person attracted to teaching, and a certain type attracted to the military, and they develop their own sort of culture, with rules and codes and self-imposed limitations. If design schools want to break free from this, they need to start requiring more business and marketing classes for their undergraduates.\n\n"
    },
    {
      "time": "14 May 2008 — 9:46am",
      "content": "<cite>in today’s global economy smart educated people have become a dime a dozen.</cite>\n\nThat's because people have redefined \"educated\" to the point of meaninglessness. Plenty of people are smart, but very few are adequately educated, especially in the United States. This is in part because large sectors of American society have become so narrow-minded and anti-intellectual that people actually think that learning things that aren't related to a specific trade is \"wank\".\n\n"
    },
    {
      "time": "14 May 2008 — 12:53pm",
      "content": "A wank? Really?\n\nI'd suggest getting your BA (or BFA), dabbling in other areas of academia that appeal to you, and designing as much as possible outside of the classroom.\n\nIt works for me.\n\n"
    },
    {
      "time": "14 May 2008 — 1:02pm",
      "content": "I just finished at Pratt. I almost certainly spent more money than was probably necessary, but the experience, IMHO, was totally worth it. It is true that you can gain a wealth of skill \"on the job\", as has been suggested. I've been working as a interactive design swiss army knife for the last 10 years, and I was way ahead of the curve compared to many of the students. But for all that on the job learning, there was still something I was lacking, and that's why I went back to school after so many years.\n\nAside from the contacts, which may ultimately be as valuable as my school debt, design education is about the problem solving process – about how to think about and create design. Anyone can operate a microscope, but it takes some learning to master microbiology. Poor analogy, maybe. But being able to stop traffic with Illustrator skill does not make you a good designer. Learning the process, learning how to address a design problem and apply my acquired skill (and practicing this process over and over) was very helpful to me. I also got work on the kind of projects that are rare in my day job, which was nice.\n\nIf I could offer 2 suggestions, they would be:\n\n(1) Check out FIT. I've heard lots of good things about it.\n\n(2) You will get out of it what you put into it. You have to believe that it's worth it and work to get your money's worth from the experience.\n\n"
    },
    {
      "time": "14 May 2008 — 2:29pm",
      "content": "Peter:  \n A bit of correction: Cooper Union is free to any resident of the U.S.A. It’s just that non-locals will have to find housing, which isn’t cheap anywhere in N.Y.C.  \n—Joel\n\n"
    },
    {
      "time": "14 May 2008 — 3:57pm",
      "content": "My dislike for educations that lean toward broadness is that I know a hell of a lot of people who went to school, learned a lot of little bits about this and that, and forgot it all, myself included. We have our entire lives to do that—at least those of us who actually try to learn things and don’t just get off work and watch TV. But for many people, those undergraduate years are the only time in their lives that they’ll have to put aside the distractions and really focus on something. That’s a great opportunity, and it would be a shame to miss it just for four years of dabbling about in a liberal arts program.\n\nMy design program was not a liberal arts program; it was a very focused design program. And it was great to be in a school where almost everyone wanted to be there, and really cared about the subject at hand. The first time I went to school I was focusing on a much broader program (liberal arts with a focus on anthropology), and about half the people in every class were only taking it because it was a required elective for whatever they were doing. That meant we got a lot of dumbed down curriculum, tedious discussions, and is why I dropped out to focus on work until my mid-twenties.\n\nA broad education may be a great thing for people who just don’t know where they want to go. But for someone like me, it’s like having teeth pulled. When I was in high school I never even knew what a design school was. If my asshole teachers and advisors had stopped their demagoguery about broad-mindedness for the ten minutes it would have taken to discuss art schools with the kid who was nearly failing classes for sitting around drawing custom letters all day I’d be ten years into a design career, instead of having to figure it all out myself at twenty nine.\n\n"
    },
    {
      "time": "14 May 2008 — 6:48pm",
      "content": "You were expecting a high school Guidance Counselor to actually offer you some useful advice on a career path?\n\n\"Hey, kid, I don't know what you expect me to do for you, if you can't get at least 1590 on your SATs what do you think I am a magician\"? \"Have you thought much about community college?\" \"I hear they have a good food service program, and they are hiring at the IHOP.\"\n\nI think we have all been disappointed by that group.\n\n"
    },
    {
      "time": "16 May 2008 — 11:34am",
      "content": "Since evilfans (the original poster) is asking about NYC, here is a possible course of action:  \nGet a 2-year undergraduate / liberal arts degree somewhere else, then move to NY and take all the continuing education design classes you can at SVA. Most of them are taught by the same instructors, follow similar curriculae, but cost a small fraction of actually being enrolled for a degree. I'm surprised more people don't do this, it seems like a great deal. You could work at the same time and go at your own pace (none of this 6-classes-at-a-time nonsense.)\n\nHaving said that, I will sort of disagree with myself with the following: I think the above posters who are minimizing the value of a design degree are probably right in regard to designers who are going to work on their own from the beginning. But IMO, to get a job, you need a degree. To get a good job, you need a degree from a good school. There's just too much competition.\n\nI graduated from Pratt a few years ago and the students in my program were almost all employed in design jobs before school even ended. Plus, if you love design, you'll love design school. It's a great way to spend a few years. I'll be paying off my loans for years, but I have a job I love going to every day -- it's a fair trade.\n\n"
    },
    {
      "time": "17 May 2008 — 9:05pm",
      "content": "Well, I don't know what it would cost you as an international student to study in Canada, but as a canadian I payed 3,500 per year, and the program I took is 3 years long. It covers typography, design history, art history, drawing, life drawing, design illustration, layout, branding, colour theory & perception, motion graphics, as well as tutorial classes for every piece of software we use.\n\nIt's worth a shot, but some of the other people here have nailed it almost dead on. Education helps you lay out a framework for personal study, but design education doesn't make you anywhere near ready for design. I'm going to say 70+% of design is learned outside of a classroom, and while I don't advocate forgoing education altogether, I don't depend on education alone to prepare me.\n\nIf it's your passion; if you truly live and breathe design, you can thrive in any environment.\n\n"
    },
    {
      "time": "18 May 2008 — 3:26am",
      "content": " **terminaldesign** _You were expecting a high school Guidance Counselor to actually offer you some useful advice on a career path?_\n\nI am sorry you didn't have a good guidance counselor. Come to think of it, I couldn't find one in my NYHS - we had 7,000 kids going through -- and not many teachers... but... in today's schools I am amazed at the guidance counselors - and not only do some give good advice, some actual have \"connections.\" I've learned that in NY they just don't slap a label on a whatever as a guidance counselor, there is now a curriculum they must get through - with a certificate and all at the end of it! Hopefully that can help some that may not have had the opportunity for help before. (College was a different story - amazing, the advice a College Guidance Counselor was allowed to give out - women, did you know you were there to find your spouse? I didn't.)\n\naaronpinero and innovati -- I just want to say to both of you -- very well said!\n\n"
    },
    {
      "time": "18 May 2008 — 4:24am",
      "content": "JackieT,\n\nI come from a family of Guidance Counselors, Teachers, Principals and School Administrators. My first job out of college was that of a public school teacher. I think GCs do a wonderful job in the early middle school grades, and may be even of some help in guiding students to more traditional fields, but anyone who falls out of the standard mold, like having an interest in design, will receive very little help.\n\nBut then modern secondary education, at least in America, was designed to prepare rural farm kids to work in factories. It is completely ill equipped to offer any preparation to a student entering the modern global economy. American drop out rates and high school graduation rates point to its failure.\n\nJames\n\n"
    }
  ]
}
