{
  "id": "4521",
  "title": "Making a living as a type designer",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hrant you are a complete jerk.   \n   \nObjectively the above does not mean that a small number of designers are getting all the money all the time, it means that the \"best selling\" designers are making more in some years, and less in others - it does not mean that there is a small hub of designers \"making a living\" (your mythical 10), it means that there are many, whose income may fluctuate over a period.   \n   \nIf you look at any best selling chart the work of Frutiger is always there, you'll note what professor Spiekermann wrote about the royalties Frutiger gets. ie even having a best seller may not do you any good.   \n   \nOr maybe you meant something else, you did not explaining either way. Usual m.o.\n\n",
  "author": "anonymous",
  "time": "10 Jan 2002 — 7:35pm",
  "uid": "1203",
  "comments": [
    {
      "time": "12 Jan 2002 — 12:58pm",
      "content": "Different opinions might lead to exited discussions, it could even lead to an argument, but on a forum like this the participants should stay professional or polite, never should they become hostile or uttering absurd personal attacks. Even when they have nothing to tell us.   \n   \nHrant: well answered.   \n   \nJacques\n\n"
    },
    {
      "time": "13 Jan 2002 — 5:57pm",
      "content": "\\> Your rantings bring nothing but disrepute to this discussion area.   \n   \nIf that's true, then it also seems equally true that this entire discussion area does not deserve your exalted attention... I'd say that we are all beyond your salvation, and since you have no way to shut me up (your powers of argument being almost as elevated as your regard for your own name), maybe \\*your\\* best course of action (read: coping mechanism) is to condemn this whole thing (along with any and all public discussion forums?...) as a festering hive of ignorants, and completely shun our voices.   \n   \nQuitting while not so far behind, eh? Of course, being anonymous means that you can sling mud instead of bothering to add anything of value without anybody (except the boys at Typophile who can trace your IP address...) knowing the identity of this dasdardly Masked Crusader - which however ignores the fact that the court of public opinion is nothing like a court of law (\"proof beyond a reasonable doubt\" being a non-issue), and:   \n   \n\\> a strong statement as to its origins   \n   \nAs if it was needed.   \nI would feel anger against you-know-who... if my pity for him wasn't overpowering.   \n   \n(But note this: any Masked Crusader needs a good sidekick...)   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2002 — 7:54pm",
      "content": "It'd be redundant to restate what I have already said about Hrant, but I cannot understand why anyone would have such animosity unless they are nursing a bad case of jealousy.   \n   \nAnybody with a degree in psychobabble can tell that this guy/gal has some deep-seated insecurities and is feeling inadequate each time he/she reads something deep from Hrant.   \n   \nHrant, the Masked Crusader name is inappropriate. It implies some kind of hero...but this person is not someone I want next to me in a bunker.   \n   \nbj\n\n"
    },
    {
      "time": "13 Jan 2002 — 8:20pm",
      "content": "Re: Making a living as a type designer.   \n   \nThe LA Times Magazine (Richard Cheverton) recently did a piece on Emigre, Licko and VanderLans.   \n   \nthe link:   \n   \n [http://latimes.com/features/printedition/magazine/la-000001337jan06.story?coll=la%2Dheadlines%2Dmagazine](http://web.archive.org/web/20150414144353/http:/latimes.com/features/printedition/magazine/la-000001337jan06.story?coll=la%2Dheadlines%2Dmagazine)   \n   \nsome highlights.   \n   \n\\* Licko, I didn't know, is pronounced Litch-ko.   \n   \n\\* \"We're not Steve Jobs, that's for sure, but we live a comfortable life,\" -- VanderLans.   \n   \n\\* Piracy is \"a huge, huge problem,\" according to VanderLans. \"We have done our own in-house, not very official research, [and] our findings are that one out of every two fonts that we see in use is obtained illegally.\"   \n   \n\\* \"You've got professional designers who send in their work to these design annuals,\" says VanderLans, \"and they win awards, and we see the work and we call these people up and we say, 'Listen, congratulations on winning these awards, but you're not registered to use our font.' I mean, we would be very wealthy people if we had gotten paid for every font that's out there in use. I kid you not.\"   \n   \n\\* VanderLans and Licko...sue the perps if they don't buy a license (Emigre's are the cheapest in the mainstream font business). They say they've never lost a case. Sighs VanderLans: \"And the lawyers are laughing all the way to the bank.\"   \n   \ninteresting   \n   \nbj\n\n"
    },
    {
      "time": "13 Jan 2002 — 8:27pm",
      "content": "Recently on Typo-L:   \n [http://listserv.heanet.ie/cgi-bin/wa?A2=ind0201&L=typo-l&D=0&P=12487](http://web.archive.org/web/20150414144353/http:/listserv.heanet.ie/cgi-bin/wa?A2=ind0201&L=typo-l&D=0&P=12487)   \n(Click Forward-Lightbulb to follow the thread.)   \n   \nhhp\n\n"
    },
    {
      "time": "14 Jan 2002 — 5:51pm",
      "content": "\\> These new \"comments\" should not reflect poorly upon or serve to invalidate the earlier anonymous posts.   \n   \nYes, they should not, but [to differing extents] they inescapably will, no? I for one can't help but think that \"annoying Anonymous\" is one of the anonymouses\\* from before.   \n   \n\\* Interesting how the plural makes it smell of a rat...   \n   \nWe can have no firm idea who's who. Anonymous is anonymous, with all the territory that comes with it - we really don't know that you're not him... BTW, \"annoying Anonymous\" could abruptly start using his real name (without admitting who he \\*was\\*), thus confusing things even more.   \n   \nYou might consider setting up a \"nom de plume\" (\"screen name\" in AOL-speak): Have a profile in Typophile, but use a fictitious (but preferably unused...) name, and a token anonymous email address, like [blahblah@webmail.com](mailto:blahblah@webmail.com) (I have a few of those myself). That way we can know that let's say \"Anonymous #2\" is you, even if we don't know who you are.   \n   \nAlso, there should preferably be a mechanism to block impostors.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2002 — 9:41am",
      "content": "Re: Making a living as a type designer.   \n   \nIf this \\*list\\* is as stated above, then ... Freelance, Employee, Employer, Contract or otherwise. Anyone talented enough to earn a livable sum deserves to be on this list.   \n   \nThat said maybe there should be splinter groups made. By this I mean a list for: foundries and individuals.   \n   \nHonestly. I tried to re-read this list of messages and it seems to me that this horse is dead. Stop kicking it.\n\n"
    },
    {
      "time": "15 Jan 2002 — 2:48pm",
      "content": "Not knowing which Anonymous you are, I'll humor you:   \n   \n\\> just put your hand up to it and admit you were wrong   \n   \nI think each of us is motivated to look at the truth from a different angle - and in large part see what he \\*wants\\* to see. I'm certainly not perfectly objective, but I can claim to have very little vested interest in putting a spin on things. (Also, my presence here is not motivated by a desire to strike anybody down...)   \n   \nAs for admitting to something, it's really more of a clarification (one that I wasn't bothering to give simply for the equine reason that Tiffany stated). Ignoring the fact that you're (conveniently?) forgetting that I abandoned the \"10\" a \\*long\\* time ago (as can be seen through some painful re-reading), I'll say this:   \n   \nI can't know the exact number, but using my definition of what \"making a living as a type designer\" means (a definition I've made clear - unlike most of my opponents; and more significantly a definition which I think is both reasonable and especially practical/useful) I can comfortably state:   \n   \n20 is an order of magnitude closer to the truth than 600.   \n   \nI can spend more time elaborating why I think this is the case, but the horse really \\*is\\* very sickly, if not completely dead.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2002 — 4:00pm",
      "content": "\\> Please humor me some more and show how the \"last few posts\" support your view   \n   \nAnd what have you done for me lately? :-)   \n   \nI don't mean to be cagey - I'm just not sure if it's productive for me to spend the time scrounging through the tatters and weaving together a nice enough quilt to [try to] convince you.   \n   \nSuggestion:   \nFor a moment, try to see things from my perspective, re-read the posts starting from Jonathan's, and try to critically extract what you need to feel comfortable that your hunch was right, and that 600 is \\*way\\* off (remember: using my definition). I think you will succeed.   \n   \n(BTW, this is not some rhetorical tactic. I'm not trying to diffuse the logic of this argument, honest. I resort to that sort of thing only in extreme situations. This is just play.)   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2002 — 5:22pm",
      "content": "Since I don't think you're just plain stupid, I have to conclude that you're trying to distort things to suit yourself (which only really works against stupid people - not me).   \n   \nAmong other things:   \n\\> Hrant:   \n\\> \"\"From what I know, about half of those 20 people seem to live too modestly for my tastes, so for me the list is actually around 10\"\"   \n   \nThat's totally out of context, and you know it.   \n   \n----   \n   \nIt seems that you want to see things as absolute wrong/right, and for me that's self-destructive: it's all about \\*learning\\*.   \n   \n\\> Hrant still insists there are ~20.   \n   \nWrong.   \n   \nLess than three hours ago I wrote:   \n\"20 is an order of magnitude closer to the truth than 600\". If you need help understanding what that means, ask, or look up some words.   \n   \nYes, I \\*was\\* wrong back when I wrote that there are \"way less than 20\". I'm willing (and possibly unlike you \\*able\\*) to learn, and I've found that going out on a limb is a great strategy in this respect (because too often people who have valuable information will only reveal it in some form of self-defense), as long as you can take the occasional slip (which I can). The problem is that some people here are not interested in learning, just yelling.   \n   \nIf we must focus on 20/600, I can safely say:   \nI was much less wrong than \\*you\\* still are now!   \n   \n\\> I think I would tend to side with someone like Erik Spiekermann   \n   \nI learned a lot from Spiekermann's post. And actually much of what he wrote (not the little snippets you wasted your time compiling, like some hapless lawyer, but the \\*good\\* stuff which is \\*always\\* between in lines) gave me more confidence that 600 was way off (again, remember: using my definition). I side with nobody, except what makes \\*sense\\*; no single person is omniscient, and certainly not 100% objective. If you could be just over 50% objective, you might get my point. But I think it might be too late for you.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2002 — 10:25pm",
      "content": "\\> no one ever wrote anywhere in this thread that there were 600 type designers \"making a living\".   \n   \nThis would be a case of selective memory, except it's in \\*writing\\*...   \n   \nBut in any case to me 300 is really not hugely more accurate than 600; a factor of two - big deal.   \n   \n\\> logarithmic, squared, what!?   \n   \nYou must be the same overly-literal guy from the \"When critiquing type\" thread... But since I enjoy Math and don't get to use it nearly enough these days, I'll fondle the poor beast yet more\\*:   \n   \nDecimal order, definitely. The question is, is \"closeness\" measured in terms of difference, or proportion? Let's just use both:   \n   \n1. Difference:   \n(x - 20) = (1 / 10) \\* (600 - x)   \nx - 20 = 60 - (x / 10)   \n11/10 \\* x = 80   \nx = 800 / 11 = ~73   \n   \n2. Proportion:   \n(x / 20) = (1 / 10) \\* (600 / x)   \nx / 20 = 60 / x   \nx^2 = 1200   \nx = ~35   \n   \nGiving the two equal weight, the answer is ~54! Yippee... :-/   \n   \n\\* But really, Tiffany's evaluation is increasingly true: this horse, who had such a tumultuous, eventful life, is now verily dead. So what are we now but bestial necrophiliacs? Sweet dreams.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2002 — 12:38am",
      "content": "\"New topic, anyone?\"   \n   \nA fine idea. (We've beat this dead horse so   \nhard and long we're seeing multiple Anonymi   \nand mathematical equations in ASCII.)   \n   \nI think I might have a topic. Watch this   \n\"General Discussions\" space for a new thread   \nwithin 24 hours.   \n   \nStephen\n\n"
    },
    {
      "time": "16 Jan 2002 — 7:53am",
      "content": "So, this carcass is too heavy for me - who's gonna help me dump it?   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2002 — 8:58am",
      "content": "Carry on, carrion.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2002 — 6:35pm",
      "content": "not to toot my own horn, but i've made a living purely on type design for the past three years - no freelance. the secret is to cut out the middleman and be your own foundry - i make 87% off each sale rather than 20-40% that other foundrys offer. i admit i'm in a niche market, but i net around $300 a day.\n\n"
    },
    {
      "time": "27 Jan 2002 — 2:23am",
      "content": "I was hoping Matthew would waltz in here and   \ntrump his earnings. His is the one story I heard last   \nyear that gave me hope for the type designer.   \n   \nHe caught sight of a trend, got to work creating   \nthe best fonts of the genre, erected a simple,   \nwell-designed site for a store front, and now it's   \npaying off. Damn, if the guy can sell $30 tee-shirts   \nfeaturing his foundry logo, it's a good sign for the   \nrest of fontdom. [http://www.atomicmedia.net/am/1links.htmlx](http://web.archive.org/web/20150414144353/http:/www.atomicmedia.net/am/1links.htmlx)   \n   \nMy question for you, Matthew - if you're willing   \nto divulge - is: how did you attract traffic to your   \nstorefront? As you look at your logs, where do   \nfolks link from and which do the buying?   \n   \nStephen\n\n"
    },
    {
      "time": "29 Jan 2002 — 10:26am",
      "content": "you can take a look for yourself....   \n   \n [http://s1.TheCounter.com/lastref.php?session=1&account=571911](http://web.archive.org/web/20150414144353/http:/s1.thecounter.com/lastref.php?session=1&account=571911)\n\n"
    },
    {
      "time": "29 Jan 2002 — 10:33am",
      "content": "Wow, thanks.   \n [http://jeff.cs.mcgill.ca/~luc/argentina.html](http://web.archive.org/web/20150414144353/http:/jeff.cs.mcgill.ca/~luc/argentina.html) ?!\n\n"
    },
    {
      "time": "29 Jan 2002 — 11:31am",
      "content": "Wow, how nice is that. Thanks, Matthew.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jun 2002 — 7:47am",
      "content": "Well ...   \nall of the comments I read here are interesting, some amusing, some not so. Erik Spiekermann's comments were obviously the most informed. Just my 2 cents, I think it about as likely to make a decent living these days from type design as it is from graphic design in general. The true \"democritization\" of design has happened, i.e., everyone with a computer is a designer. This subject has been touched upon by some in other venues. There can't be more than a very small number, 600 ? someone said, perhaps Erik, worldwide who make a living designing type fonts. But, I still do this stuff when I can and enjoy it.   \nJordan\n\n"
    },
    {
      "time": "17 Aug 2003 — 10:47am",
      "content": "I noticed that the discussion talks about type designers worldwide, but most, if not all the designers mentioned are from Western countries.   \n   \nOut of 1 300 000 000 people in China, I'd guess a few make a living from type design?\n\n"
    },
    {
      "time": "10 Jan 2002 — 9:52pm",
      "content": "Hmmm. To the best of my recollection, Hrant (whether one agrees with him or disagrees with him) has never resorted to name-calling (\"complete jerk\") to make his point.   \n   \nFurther, he is willing to put his opinion out there and sign his name to it. While this is not (and should not be) a requirement of this forum, this fact added to his civility does lend a certain degree of credibility to his posts and method of argument.   \n   \nAt very least, it adds to my respect for him (and others with a similar degree of civility), whether I agree with or disagree with the point he happens to be making.   \n   \nDavid\n\n"
    },
    {
      "time": "11 Jan 2002 — 8:14pm",
      "content": "No relly its okay Dafid, I yam a [compleat yerk]\n\n"
    },
    {
      "time": "11 Jan 2002 — 9:53pm",
      "content": "For those with a keen eye, you'll notice that the previous post was, in fact, NOT made by Hrant H Papazian. (At very least, not while he was signed in under his account....)   \n   \nI suspect there is some rule on this forum (written or unwritten) regarding the posting of fraudulent messages. There certainly should be, as well as a rule regarding inflammatory personal attacks.\n\n"
    },
    {
      "time": "12 Jan 2002 — 11:08am",
      "content": "Well said.   \n   \nDavid\n\n"
    },
    {
      "time": "13 Jan 2002 — 4:39pm",
      "content": "Hrant, the way forward would be for you to shut up. Your rantings bring nothing but disrepute to this discussion area.\n\n"
    },
    {
      "time": "13 Jan 2002 — 4:48pm",
      "content": "David, very astute. I would imagine that the \"Hrant H Papazian\" who did not post that message was probably making quite a strong statement as to its origins merely with the language used.   \n   \nNo?\n\n"
    },
    {
      "time": "13 Jan 2002 — 9:59pm",
      "content": "Mr hRant is of course right again - the quality of discourse proves it.\n\n"
    },
    {
      "time": "14 Jan 2002 — 12:44pm",
      "content": "Hrant's contributions are, at the very least, on-topic and civil. At their best, they've been constructively critical, provocative and a useful addition to the forum.   \n   \nAnonymous' posts of late have been little (if anything) more than childish name-calling and bashing -- hardly adding to the \"quality of discourse\".   \n   \nIt's unsettling that there are those who would abuse this forum in such a manner, and perhaps more unsettling that those who do seem to have no better way to spend their time.   \n   \nRegarding the LA Times Magazine article, it's interesting (and encouraging) to know that at least some type designers seem to be making a living (or, at least, a substantial contribution to their living) through their type design. It gives the rest of us encouragement, as well as something to shoot for.... ![:)](http://web.archive.org/web/20150414144353im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nDavid\n\n"
    },
    {
      "time": "14 Jan 2002 — 5:17pm",
      "content": "Please note that this new and annoying \"Anonymous\" is not the same as the earlier anonymous participants (at least not the earlier Anonymous #2, which is me). While we may often disagree with one another, name calling should not be tolerated and it only serves to throw the list off of the intended topic. These new \"comments\" should not reflect poorly upon or serve to invalidate the earlier anonymous posts. Ignore the pest and keep the discussion moving, I say.\n\n"
    },
    {
      "time": "14 Jan 2002 — 6:15pm",
      "content": "In the interest of keeping the forums as open as possible (and not wanting to create any official \"policies\"), I call upon all citizens of the Typophile community to show each other mutual respect.   \n   \nSave the personal flames for email. If you must, here's a link to an anonymous remailer:   \n   \n [http://www.gilc.org/speech/anonymous/remailer.html](http://web.archive.org/web/20150414144353/http:/www.gilc.org/speech/anonymous/remailer.html)   \n   \nThe forums \\*do\\* track posts by IP address, and, after some sleuthing, we know where the posts were coming from. There is a \"ban\" feature, but I really don't want to use it.   \n   \nWe hope the individual responsible has gotten things off his chest, and we can all get on with our lives.\n\n"
    },
    {
      "time": "15 Jan 2002 — 1:48pm",
      "content": "Anon:   \n\\> These new \"comments\" should not reflect   \n\\>poorly upon or serve to invalidate the   \n\\>earlier anonymous posts.   \n   \nThe hRant   \n\\>Yes, they should not, but [to differing extents]   \n\\> they inescapably will, no? I for one can't   \n\\>help but think that \"annoying Anonymous\" is   \n\\>one of the anonymouses\\* from before.   \n   \nThe distraction from the issues discussed and the proven conclusions is that you still insist that your original statement - that there were only 10 professional type designers in the world - is correct.   \n   \nHrant you are wrong, and have been proven to be so but:   \n   \n\\>If you read the last few posts critically,   \n\\>carefully, and objectively, you'll realize   \n\\>that my point has in effect been made!   \n   \nYou still won't admit it, you still want to insist that you are right even though you've had the word directly from the horses mouth(s) (apologies to Erik and Jonathan who certainly aren't horses) that is absolutely counter to your ongoing assertions.   \n   \nPlease, just put your hand up to it and admit you were wrong. Or is that just simply beneath you?\n\n"
    },
    {
      "time": "15 Jan 2002 — 3:18pm",
      "content": "\\>If you read the last few posts critically,   \n\\>carefully, and objectively, you'll realize   \n\\>that my point has in effect been made!   \n   \nYour point has been proven false. Please humor me some more and show how the \"last few posts\" support your view.\n\n"
    },
    {
      "time": "15 Jan 2002 — 4:47pm",
      "content": "References to 20:   \n   \nHrant:   \n\"Way less than 20\"   \n   \nMart:   \n\"Clearly there are less than 20 individuals (that we know about) who make enough money to call type design their sole profession.\"   \n   \nHrant:   \n\"\"From what I know, about half of those 20 people seem to live too modestly for my tastes, so for me the list is actually around 10\"\"   \n   \nHrant:   \n\"However, I no longer think 20 is too high. But 300 is completely lala-land.\"   \n   \nClive:   \n\"If I wanted to scour the rest of the UK I'm sure I could easily get up to 20 or 25.\"   \n   \nClive:   \n\"I stand by my previous assertions that there are \"way more\" people than 20\"   \n   \nStephen:   \n\"It is a market that is   \nin a very sad state, whether there are 20 or 200   \nfull-time designers.\"   \n   \nHrant:   \n\"20 is an order of magnitude closer to the truth than 600.\"   \n   \n   \nRefences to 600:   \nHrant as above.   \n   \nClive:   \n\"The 3-400 is probably comprised of 600 or so actual bodies who drift in and out over time or as they are completing other projects.\"   \n   \nErik Spiekermann:   \nAnd Clive is totall right with his estimate of maybe 600 people making a living out of font sales worldwide.   \n   \n   \nSo, Hrant says, latterly, that there are \\*not\\* way less than 20, but says he was right anyway.   \n   \nNo one says anywhere in this thread that there are \"600 type designers\" \"making a living\". Therefore Hrant's use of that figure as being incorrect would appear to have a high bogosity factor:   \n   \nHrant:   \n\"20 is an order of magnitude closer to the truth than 600\"   \n   \n   \nReferences to 300:   \n   \nClive:   \n\"I'd say that the type business supports around 3-400 people world wide on a full time basis, excluding those working in retail sales which probably comes to around another couple of hundred.\"   \n   \nHrant:   \n\"BTW, forget thousands: if it is/were even close to 300, I'd be happy.\"   \n   \nClive:   \n\"However they choose to go with the flow of work as it comes and goes. I do believe that there is enough work to keep 300+ people working full time, but as i wrote before, that's a subset of a group that's quite a bit larger.\"   \n   \nHrant:   \n\"But 300 is completely lala-land.\"   \n   \n   \nConclusion: Clive seems non-specific if these 300 are \"type designers\", so difficult to argue that his figure is wrong, though Erik's post indicates having read this and chooses not to counter it - in fact agreeing with the wider 600 figure.   \n   \nGiven that many people have given numbers far inexcess of 20, or around 20 for just 1 little country (how can there be that many just in England and not a \"magnitude\" greater than that worldwide!?).   \n   \nHrant still insists there are ~20.   \n   \nI think I would tend to side with someone like Erik Spiekermann, who clearly has a better understanding than most - being a type designer himself and having run a large foundry/reseller.   \n   \nSo, there are the tatters: your point seems to be proved wrong at worst and rhetoric at best.\n\n"
    },
    {
      "time": "15 Jan 2002 — 8:15pm",
      "content": "Hrant, no one ever wrote anywhere in this thread that there were 600 type designers \"making a living\". Therefore it is not obvious to a stupid person like me why you keep clinging to this figure?   \n   \nThe purpose of those I previously cited was to show this.   \n   \nSo in your \"order of magnitude\" (logarithmic, squared, what!?) you're somehow pinning your figure down to somewhere between 2 and 200 (or 400)!? But clearly 600 is right out the ballpark?   \n   \n600 \\* 10^-1 = 60 so please, some math to show that 20 is any more accurate than 600 (or even 1,000) in your world.   \n   \nEven if we went for a figure that was close to being cited, 300, this still, in \"orders of magnitude\" cannot be shown to be any less accurate than the figures you choose to cite.   \n   \nwhatis.techtarget.com/definition/0%2C,sid9\\_gci527311%2C00.html\n\n"
    },
    {
      "time": "16 Jan 2002 — 12:11am",
      "content": "Yawn.   \n   \nNew topic, anyone?\n\n"
    },
    {
      "time": "16 Jan 2002 — 12:23am",
      "content": "Heh. I'm laughing out loud. I wrote a fat reply   \nand David beats me to the post with 'yawn.'   \nMan, I can't follow that.   \n   \nJust turn the light off on the way out.   \n   \n//joe\n\n"
    },
    {
      "time": "16 Jan 2002 — 12:50am",
      "content": "Great Stephen, perhaps it would be a good idea to   \nenforce a two comment rule as well. Just to keep   \nthings interesting and civil.   \n   \nCheers,   \n   \n//joe\n\n"
    },
    {
      "time": "16 Jan 2002 — 1:02am",
      "content": "Joe: Do you think that ANY of us could honestly live with a two-comment rule? :D   \n   \nNow I'M laughing out loud! ;)   \n   \nDavid\n\n"
    },
    {
      "time": "16 Jan 2002 — 8:00am",
      "content": "Boring I know, but Hrant, you are wrong, no one wrote anywhere in this thread that there were \\*600\\* type designers \"making a living\".   \n   \nYou are just flat out wrong.   \n   \nIf I am wrong, just cite the text.   \n   \nYour muddling of \"order of magnitude\" is just more of your nonsense spouting.   \n   \nI think it's somewhat strange that there's a gathering here also that wants to \"laugh out loud\". I would suppose that some come here to learn, and to get information. At the same time there are fools like Papazian spreading myth and rumor in the name of truth (Rev P King anyone?), and then others follow-up essentially stating that it's wrong to point out what a fool he is.   \n   \nThe method used may be long-winded and out of place here, but the truth is clear, Papazian's continued nonsense-speak just muddies the water for everyone.\n\n"
    },
    {
      "time": "16 Jan 2002 — 11:53am",
      "content": "Maybe I could be accused of being a vulture, are you volunteering to be dinner?\n\n"
    },
    {
      "time": "12 Jan 2002 — 12:02am",
      "content": "\\> I suspect there is some rule on this forum (written or unwritten) regarding the posting of fraudulent messages.   \n   \nOr at least flatulent ones.   \n   \nBut to be fair, anybody who's clearly having so much fun being childish should not be expected to abide by mature rules of conduct. \"Awww, he's such a cute little rascal!\"   \n   \nMore seriously:   \nIt's up to the moderators of these forums to decide (perhaps considering what happened to the Type Design discussion list over the entire duration of 2001) how seriously to take personal attacks, especially when they cross the border into defamation campaigns, and \\*especially\\* when this is done anonymously. I personally think anonymous posting should be allowed (for reasons that Jared articulated), but clearly anonymous \\*attacks\\* (or worse yet, anonymous defamation campaigns) can cause severe damage to Typophile itself. From my experience, certain people have no qualms about trying to bring down an entire channel of discussion/communication if it happens not to be going their way; sabotage is justified for them simply because it serves their self-righteous (and very selfish) ideals.   \n   \nLogistically, there are no obvious/trivial solutions, but I'm not worried that the Typophile boys will do what's needed, when it's needed - which might [justifiably] include nipping this problem in the bud.   \n   \nhhp\n\n"
    }
  ]
}
