{
  "id": "45223",
  "title": "15th C Aldine Greek Ligature Question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I don’t expect anyone to know this, but if you have an idea abbout or know someone who might... when you look at the many many ’contextual/ligatured’ sorts ( in decreasing complexity over time ) used for Greek by Aldus, is it your impression that the ligatures and alt sorts are there only to emulate the style of writing they were aimed at ( perhaps similar to metal type that emulated copperplate connected script) or do you think they also improved fit? Not reading it or knowing the forms anywhere near well enough - it is impossible for me to guess.\n\nToughie no?\n\nAlso, for extra points: An example!\n\n [‹ Anyone else planning to drive from DC to Typecon?](http://web.archive.org/web/20080708212607/http:/www.typophile.com/node/45138 \"Go to previous forum topic\") [Font from printer's 1830 archive ›](http://web.archive.org/web/20080708212607/http:/www.typophile.com/node/45125 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080708212607/http://www.typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 12.May.2008 3.00am",
      "content": "(in haste)\n\nEben, the question is phrased misleadingly. The typefaces were intended to imitate handwriting, and typesetters were expected to make use of ligatures (and contractions and abbreviations built on a single sort) to achieve the appropriate texture. The same applies to the grec-du-roi. There is ample record of other (i.e. not Aldus, or Paulus M, or Estienne) using typefaces cut in the same style with fewer ligatures, and the texture in most cases breaks down (See, for example, small-format Wetstein books, 1700 onwards). In other words, most single-letter sorts were not intended to pair with other single-letter ones, if the writing model suggested a ligature and one was provided.\n\nThere’s some good attempts at “normalising” the typeforms to work without many ligatures n the Low Countries that John Lane has written about, and a key development in the Foulis Greek cut by Alexander Wilson (relatively easy to see examples of, from the middle of the eighteenth century).\n\nI think there should be some good relevant images on the MATD flickr site, from the Greek workshop.\n\n"
    },
    {
      "time": " 12.May.2008 3.44am",
      "content": "Indeed there are. Over the years we’ve had a slow accumulation of photos taken from Gerry’s collection, the books at the Plantin-Moretus Museum, and elsewhere: [Greek on the MATD Flickr pool](http://web.archive.org/web/20080708212607/http:/www.flickr.com/search/groups/?q=greek&w=92131314%40N00&m=pool)\n\n"
    },
    {
      "time": " 12.May.2008 12.05pm",
      "content": "Thanks very much for these rapid answers. And great new resources to follow up on.\n\nI wonder if I should try to clarify the distinction I have in mind because to my way of thinking it is still interesting. And if I am misunderstanding something I would like to know that too.\n\nI am going to use connected script as my analogy which in and of itself poses some problems but hopefully it will be a good vehicle to show the distinction I have in mind. When I look at connected latin I can see, among other things, if the script is connecting in a simple manner ( low connections ) or a more script like manner which would be a formally more accurate reproduction of the original written form. And then quite separate from that is the question of how well the glyphs fit. It’s true that inevitably there are some complex interactions between the two. I don’t deny this. But at the same time for me it is easy to imagine an old fashioned connected script that connects low and is better fitted than a more formally accurate set of connections that is less well fit.\n\nMaybe an even better example would be f ligatures. The f ligature can be formally correct in it’s construction ( or not ) and at the same time either be an improvement over the non-ligated forms ( or not ).\n\nWhen I think about the the complex metal fonts with their many ligatures it seems to me that they too might be judged in this way. But maybe this is a mistake.\n\nWhat do you think?\n\n"
    },
    {
      "time": " 12.May.2008 12.25pm",
      "content": "<cite>The typefaces were intended to imitate handwriting, and typesetters were expected to make use of ligatures (and contractions and abbreviations built on a single sort) to achieve the appropriate texture.</cite>\n\nSorry for hijacking, but is this the reason for the unneeded ligatures in so many old typefaces? I’m not referring to quaints, but to the crash ligatures like ff, fi,fl etc. when those letters don’t crash in the first place.\n\n"
    },
    {
      "time": " 12.May.2008 1.43pm",
      "content": "The top of the f can be drawn back to avoid all clashes a la metal Linotype but I think to they eye of many type people it is not an ideal form. People like the f to be fuller. Optically, a fuller f starts to suggest a ligature - or some other solution where fit is concerned. It is also true that type is in significant thrall to it’s history. Because f ligs were in the writing system that book faces come from ( significantly italian humanist manuscript styles ) they were brought into the early type. And then because they were in early type they were seen as a given. I think they were also associated with quality for some people- rightly or wrongly; or even for sophisticated reasons or naive ones. So while I think you can say “they don’t have to clash” - saying “they don’t” is not really accurate. There is plenty of room for multiple potentially successful approaches to the design of “f”.\n\n"
    }
  ]
}
