{
  "id": "45230",
  "title": "Illegible logo?",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Logo for a Business and Technology Expo. My boss is worried about the legibility (he’s not a designer). Any thoughts/suggestions?\n\n| Attachment | Size |\n| --- | --- |\n| [VF09\\_Logo.pdf](http://web.archive.org/web/20080706111733/http:/typophile.com/files/VF09_Logo.pdf) | 349.37 KB |\n\n [‹ Duban - A Corporate Communication Services Company](http://web.archive.org/web/20080706111733/http:/www.typophile.com/node/45464 \"Go to previous forum topic\") [ht logo ›](http://web.archive.org/web/20080706111733/http:/www.typophile.com/node/45266 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706111733/http://www.typophile.com/user/25558\" title=\"View user profile.\">pixelprank</a>",
  "time": "<br>",
  "uid": "25558",
  "comments": [
    {
      "time": " 12.May.2008 3.23am",
      "content": "This sure seems more of an illustration than a ’simple’ logo. And if it should spell out ’VentureFest’ I guess it still is legible. ;) _(Not too keen on the typeface, but that may be some personal preference.)_ It’s also ’quite’ colorful and ’playful’ for what it’s for, but maybe that was/is intended.\n\nDav\n\n"
    },
    {
      "time": " 12.May.2008 3.50am",
      "content": "Hey Dav,\n\nThanks for the response. The original concept was using the overlap of the letters to represent the networking of companies. The lines/flourish off the V is a refreshed device that has been used over the past 3 years. The typeface is a custom version of Wyld. Obviously going for the cutting edge technology look. The mix of colour’s is to show the diversity of business present at the event. The fact you could read it is the most important thing!! Thanks again for the comments.\n\nBen\n\n"
    },
    {
      "time": " 12.May.2008 4.09am",
      "content": "I quite like it, but to me eyes the problem with its readability is that the n is the only letter to actually loose some of its form as opposed to just being overlapped. If its downstroke was reintroduced the whole word would be much more understandable.\n\nWill\n\n"
    },
    {
      "time": " 12.May.2008 6.00am",
      "content": "it reads fine.\n\nits not as instant as it could be - but then you would lose the other elements you are trying to convey, with the style your bringing to the party, the least people can do is glance for more than 2 seconds.\n\nargue with your boss mate.. they love it really.\n\nif he really sticks- the e/s of fest are the biggest worry - as its a slightly unusual word so the brain doesn;t grab it as quickly as it does with venture - a colour tweak there might solve it\n\n"
    },
    {
      "time": " 12.May.2008 11.55am",
      "content": "I actually read it as “Lecture Fest”. I think the V should be tipped back to be more recognisable. I also think the lines coming out of it might flow a little better then. Apart from that I like it.\n\n"
    },
    {
      "time": " 12.May.2008 5.19pm",
      "content": "My thoughts ... you mention your boss isn’t a designer - which is an interesting point.\n\nAre the majority of people who will see the logo going to be designers?\n\nI don’t mind the idea overall ... but seriously are you absolutely SURE you overlapped the type to represent ’the networking of companies”? I’m tipping it was post-rationalisation. You’ve only overlapped some letters ... does that mean not all companies can network? (playing devil’s advocate.)\n\nI like the movement of the lines ... I’m just not feeling the relevance of the type.\n\nAnd ... as a logo -it’s not going to work at smaller sizes.\n\nAll that aside ... back to answering the question of legibility ...\n\nI can read it ... and I read VENTUREFEST but it took time.\n\nThe original logo represents the world I imagine is trying to be communicate more clearly than the proposal in this thread.\n\nA combination of both would be the killer outcome in this situation.\n\nThe fresh feel of the work you’ve presented mixed with the clarity of the existing mark ... working together to push both directions further = WIN!\n\njust thoughts anyway.\n\n—————  \n**Paul Ducco**  \n [Art Direction](http://web.archive.org/web/20080706111733/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 13.May.2008 9.22am",
      "content": "If the only problem is legibility... don’t worry i read venturefest quite easily!\n\n"
    },
    {
      "time": " 15.May.2008 8.48am",
      "content": "I read it easily too. It looks quite “now” with the colors and treatment. I would find it attractive if I saw it out randomly and be interested in more information.\n\n"
    },
    {
      "time": " 16.May.2008 1.06am",
      "content": "Hey guys!\n\nThanks for all your comments. Its a great help. Pitched to client yesterday and received a very positive response. We are hoping to attract some ’big’ sponsors to the event so hopefully the branding will have the gravitass to do that. We have produced some very innovative promotional print to accompany the brand which I will post later for your comments/reactions.\n\nThanks again!!\n\n"
    }
  ]
}
