{
  "id": "45254",
  "title": "Karel Martens to speak at St Bride Conference (Update)",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20080706173928/http:/www.typophile.com/user/108 \"View user profile.\") : 12.May.2008 1.12pm \n\nSeeking Inspiration: creative thinking around the design process  \n================================================================  \nSeventh annual St Bride Library conference  \n15-16 May 2008  \nAt St Bride Library, Bride Lane, Fleet St, London EC4Y 8EE\n\nThe greatly respected Dutch book designer Karel Martens will be speaking  \nat this year’s conference.\n\nKarel Martens: An error occurred  \n————————————————\n\nKarel will start by showing three (very) short films: ‘notforresale’, ‘lost  \nand found’, ‘homage to the alphabet’. This will lead on to a  \nconversation between Karel and Robin Kinross, with unpredictable results.\n\nKarel Martens is a graphic designer, specializing in typography. He has  \nwon numerous awards – a 1996 prize resulting in the publication of a  \nmonograph of his work Printed matter. He has taught graphic design for  \nover thirty years and is a much-revered mentor of Dutch Graphic Design  \ninspiring younger generations towards an approach to design which  \nprioritises intelligence and integrity. He is a co-founder of the  \nWerkplaats Typografie in Arnhem, a two-year workshop education which he  \nnow oversees with fellow designer Armand Mevis.\n\nRobin Kinross is a typographer and editor. He runs Hyphen Press, whose  \nauthors include Christopher Burke, Fred Smeijers, Gerrit Noordzij, Jost  \nHochuli, and David Wild. He has collaborated as writer and publisher  \nwith Karel Martens on the books Printed matter and Counterprint. A third  \nedition of Printed matter is in preparation now.\n\n[http://seekinginspiration2008.stbride.org/programme.html](http://web.archive.org/web/20080706173928/http:/seekinginspiration2008.stbride.org/programme.html \"http://seekinginspiration2008.stbride.org/programme.html\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080706173928/http:/www.typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 12.May.2008 1.12pm",
  "uid": "108",
  "comments": [

  ]
}
