{
  "id": "45278",
  "title": "LCD or CTR monitors?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi typophiles!\n\nLong time no see,  \nIm about to buy a new computer and was wondering about monitors.\n\nI actually have an 17’ CTR, cheap and “small” but good...\n\nWhat do you think? CTR or LCD?  \nI read that LCD monitors order pixels very different from CTR, for me is very important couse i work web, type design and other graphic activities.\n\nSmall plasma monitors exist? hehe\n\nSalutations  \nFerchules\n\n [‹ Editing posts](http://web.archive.org/web/20080708213340/http:/www.typophile.com/node/45186 \"Go to previous forum topic\") [NYC bookstores for typography and design, new books ›](http://web.archive.org/web/20080708213340/http:/www.typophile.com/node/45291 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080708213340/http://www.typophile.com/user/19457\" title=\"View user profile.\">strass</a>",
  "time": "<br>",
  "uid": "19457",
  "comments": [
    {
      "time": " 13.May.2008 6.18am",
      "content": "i’ve recently been in a large monitor spec’ing and ordering session for my current project - a CG animation rendering digital 4K frames for transfer to imax film format. the monitor color space management is a huge headache.\n\nhere’s a few things i’ve learned:\n\nthe industry is in transition from CRT’s to LCD’s and the options are not yet optimized. there’s a lot of groaning in the animation post-production industry these days on account of this netherzone we seem to be in between a clearly obsolete old standard and a not yet fully realized new one.\n\nLCD’s are replacing CRT’s industry wide. Sony, for example, is not even manufacturing their work horse CRT’s anymore, but they can be found on e-bay. unfortunately, any monitor over 4 years old of unknown provenance is somewhat suspect. it used to be that production companies would have a CRT as their “control” monitor for precise color, as CRT’s tend to be slightly more accurate and often more adjustable. as CRT’s go the way of the dinosaur, however, there has not been a clear frontrunner in the mid-price LCD market.\n\nto my eye, the Apple LCD’s look best out of the box, but offer very few calibration options. We have several cheap Samsungs at the office which are terrible. We make no critical decisions on those. avoid super cheap LCD’s for critical color.\n\nyour best bet is to keep the little CRT you have as a second monitor and purchase the best LCD you can afford as the primary monitor. Compare images on both frequently, and calibrate both frequently. Pantone makes a handy little calibration tool.  \nhave an image handy with which you are very familiar, including color bars, skin tones, sky, etc.\n\nas for the pixel order, your probably thinking of progressive scan (current) vs. interlaced (old school). progressive scan is the standard for computers, the web, and digital TV. Interlaced is a leftover artifact of NTSC video, and will soon be completely obsolete, although there will be some conversion compatibility in the appropriate hardware.\n\nthere’s lots more detailed information available on-line in various user forums, including apple & adobe sites and at Creative Cow, which i highly recommend:\n\n[http://cowcast.creativecow.net/](http://web.archive.org/web/20080708213340/http:/cowcast.creativecow.net/ \"http://cowcast.creativecow.net/\")\n\nthere are VERY expensive LCD’s out there for graphics specialists - i think Panasonic makes one, but if they are prohibitively expensive i’d shop around online and look for calibration capability.\n\nin general i would avoid plasma screens as they are environmentally far more costly and polluting than the other types.\n\n"
    },
    {
      "time": " 13.May.2008 6.42am",
      "content": "They still sell CRTs?\n\nHuh.\n\n"
    },
    {
      "time": " 13.May.2008 7.51am",
      "content": "Does anyone still make desks deep enough for a big CRT? I got rid of mine because I had the ass-end of the monitor sticking into a window well.\n\n"
    },
    {
      "time": " 13.May.2008 6.56pm",
      "content": "Thanks!\n\n[Tipografía-Montevideo](http://web.archive.org/web/20080708213340/http:/www.tipografia-montevideo.info/)\n\n"
    },
    {
      "time": " 13.May.2008 8.58pm",
      "content": "I’ve still got my 22” as long as I can calibrate it to spec. You’re right though, finding a desk to support it not easy.\n\n"
    }
  ]
}
