{
  "id": "45275",
  "title": "Numerals design and numbers only fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello typophiles,\n\nI’m an Honours student at Monash University, Melbourne, Australia and for my Honours project I’m creating a series of numbers only fonts. Project description below:\n\nMelbourne is not shy of its history. Supporting a diverse variety of architectural styles of the buildings, juxtaposed with the hip street culture of today and the yesteryears as depicted in faded murals and advertisements—Melbourne openly invites people to explore its layers of visual narratives. The accessibility of its roads and laneways give people, residents or visitors, the chance and pleasure to delve into it at their leisure. There is, however, a side of Melbourne that is forgotten, more often than not: the up side. I believe that this is merely because people are used to seeing things on their eye levels when walking around. By doing so, they are missing out on the beautiful architectural letterings mostly located on the face of the building, way above eye levels; the building names and the years they were built, most of which were done in a more subjective, expressive way.\n\nThis, in a way, mirrors how I see numerals in typeface design. In the past, “typefounders considered numbers separately from the provision of other printing types… Nineteenth century type specimen books often displayed a separate section containing fonts of numbers alone.”\\*. These days, however, I believe that numbers design is the black sheep of typeface design. It is as important as alphabet design but nowadays it is often not given as much care.\n\n3000 is an intertwining journey of these two interests. It is my attempt to create something concrete from my typographic exploration of Melbourne CBD—looking at vernacular typography and investigating the social history and typographic expression of Melbourne CBD through found architectural numerals. The outcome will be a series of fully working, numerals only digital fonts—as well as a type specimen book and a publication documenting the research process.\n\n\\*Jonathan Hoefler and Tobias Frere-Jones, [www.typography.com](http://web.archive.org/web/20080719173154/http:/www.typography.com/ \"www.typography.com\")\n\nThe specimen is here: [http://typophile.com/node/45274](http://web.archive.org/web/20080719173154/http:/typophile.com/node/45274 \"http://typophile.com/node/45274\")\n\nMy questions are:  \n1. What do you think of numbers only fonts?\n\n2. Is there any recommended books on numerals design? (I’m currently reading Walter Tracy’s Letters of Credit and also Bringhurst’s The Elements of Typographic Style)\n\n3. Regardless what H&FJ said, I can’t find any type specimen book with numbers-only sections,nineteenth century of otherwise. Has anyone come across any of these books?\n\nAny comment/feedback will be much appreciated. Thanks.\n\ncheers  \nChrista\n\n [‹ the elusive circle (p) symbol!](http://web.archive.org/web/20080719173154/http:/typophile.com/node/45116 \"Go to previous forum topic\") [St. John's Bible: beautiful calligraphy & illumination ›](http://web.archive.org/web/20080719173154/http:/typophile.com/node/45243 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080719173154/http://typophile.com/user/18991\" title=\"View user profile.\">christa</a>",
  "time": "<br>",
  "uid": "18991",
  "comments": [
    {
      "time": " 13.May.2008 3.09am",
      "content": "[http://typophile.com/node/38701](http://web.archive.org/web/20080719173154/http:/typophile.com/node/38701 \"http://typophile.com/node/38701\")  \n [http://www.ministryoftype.co.uk/words/wow\\_the\\_beauty\\_of\\_numbers/](http://web.archive.org/web/20080719173154/http:/www.ministryoftype.co.uk/words/wow_the_beauty_of_numbers/ \"http://www.ministryoftype.co.uk/words/wow\\_the\\_beauty\\_of\\_numbers/\")\n\n"
    },
    {
      "time": " 13.May.2008 5.00am",
      "content": "Several of the early-20th-century catalogs I have include some numbers-only sections.\n\n1926 Stephenson Blake & Co. : pp. 431441  \nc. 1925 Barnhart Brothers & Spindler : pp. 304308  \n1923 American Type Founders : pp. 602614  \nLinotype “Big Red” (c. 1930s) : pp. 906956\n\nUsually these are located in the “Typographic Accessories” section. They were generally geared toward advertisers or calendar producers.\n\n— Kent.\n\n"
    },
    {
      "time": " 13.May.2008 6.32am",
      "content": "Hi Alessandro,  \nThank you for the links! The animation is so beautiful.\n\nHi Kent,  \nthanks for your reply. I’ll try finding those books in the libraries.\n\ncheers  \nChrista\n\n"
    }
  ]
}
