{
  "id": "45274",
  "title": "A whole lot of numbers",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello typophiles,\n\n ![](http://web.archive.org/web/20080907171356im_/http:/typophile.com/files/numbers1_6672.jpg)\n\nI need your help in identifying each of these numbers. They are all architectural numbers and inscriptions found in Melbourne, Australia and are the source for my Honours project.\n\nI’m no expert in this, but I’m guessing that they’re all custom? (The ’83’ looks like an elongated, condensed Bodoni, though). I need to know if any of these has been revived or if there’s any similar font out there.\n\nAny help will be much appreciated. Thanks.\n\ncheers  \nChrista\n\np.s. Another thread regarding my project: [http://typophile.com/node/45275](http://web.archive.org/web/20080907171356/http:/typophile.com/node/45275 \"http://typophile.com/node/45275\")\n\n [‹ Marker type font](http://web.archive.org/web/20080907171356/http:/typophile.com/node/45639 \"Go to previous forum topic\") [\"executive\" typeface ›](http://web.archive.org/web/20080907171356/http:/typophile.com/node/45776 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907171356/http://typophile.com/user/18991\" title=\"View user profile.\">christa</a>",
  "time": "<br>",
  "uid": "18991",
  "comments": [
    {
      "time": " 12.May.2008 9.53pm",
      "content": "Architectural lettering, especially numbers like these are almost always custom. You could find vaguely similar typefaces, but these are not fonts, they are letters.\n\n"
    },
    {
      "time": " 13.May.2008 6.04am",
      "content": "Hi Christa. I’m one of Melbourne’s type designers, but I don’t take a lot of notice of architectural lettering, mainly because I’m kept indoors most hours by constant work.\n\nYour thesis project sounds like a good challenge and I hope it bears tasty fruit.\n\nTypophiles—-I don’t have time to pick fonts with numbers that more or less match the styles in Christa’s photos. It would be nice if you guys could help her out with such. You’rethe individual face experts, not I. Thanks!\n\nbest regards,  \nj a m e s\n\n"
    },
    {
      "time": " 13.May.2008 6.28am",
      "content": "Hi Stephen,  \nthanks for your reply. Yeah I’m pretty sure they’re custom, will go to the City Council tomorrow and see if I can find any information on the buildings.\n\nHi James,  \nthanks for taking the time to reply, nice to find a fellow Melburnian here. I, too, wouldn’t have noticed them if I hadn’t been running away from work and trying to clear my head by walking around the city.\n\ncheers  \nChrista\n\n"
    },
    {
      "time": " 13.May.2008 3.34pm",
      "content": "1904 — reminds me of [Gills Sans](http://web.archive.org/web/20080907171356/http:/www.fontshop.com/fonts/downloads/monotype/gill_sans_vp/?sample_text=1904)  \n83 — reminds me of [Bodoni Antiqua Compress Demi Bold](http://web.archive.org/web/20080907171356/http:/www.fontshop.com/fonts/singles/urw/bodoni_antiqua_compress_demi_bold/)\n\n"
    },
    {
      "time": " 13.May.2008 9.59pm",
      "content": "I found ten minutes hiding under the sofa again and I got one! The first 1904 in bronze (copper?), I’ll give it an 85% match for Trebuchet bold, if you lengthen the tail on the 9 and lop off the serif on the 1.\n\nThe other ones are much harder. You’d need a large catalog of ar’nouveau types to find matches.\n\nj a m e s\n\n"
    },
    {
      "time": " 20.May.2008 7.08am",
      "content": "Hi Tiffany,\n\nSorry for the late reply, uni has kept me really busy.\n\nI find it interesting that the 1904 has such striking resemblance with Gill Sans, given that Gill Sans was designed in 1927 and released in 1928. I thought it could be Johnston, but I checked around and found out that Johnston was designed in 1913. Even more intriguing since I found the numbers on a Federation Warehouse style building, with no significant history known about it.\n\nI concur, 83 is pretty much Bodoni Antiqua Compress Demi Bold.\n\nThanks for taking the time to reply!\n\nHi James,\n\nI’ve been flipping through Art Nouveau and display type specimens, there are some similar ones to the 1904 on the bottom right corner (found that one on Royal Arcade, btw). I think the rest is all custom.\n\nThanks again. I’ll send you an email soon.\n\nChrista\n\n"
    },
    {
      "time": " 20.May.2008 8.20am",
      "content": "_I find it interesting that the 1904 has such striking resemblance with Gill Sans, given that Gill Sans was designed in 1927 and released in 1928. I thought it could be Johnston, but I checked around and found out that Johnston was designed in 1913. Even more intriguing since I found the numbers on a Federation Warehouse style building, with no significant history known about it._\n\nAre you assuming that the numbers come from the year they say? I would bet just about anything that that 1904 plaque was not made in 1904.\n\n"
    },
    {
      "time": " 27.May.2008 10.55am",
      "content": "Hi Craig,\n\nIndeed, I was. Thank you for pointing that out.  \nI have also found out for the 1849 numbers — I’m still figuring out the correct architectural term for this kind of numbers, if there’s any — it was not the year in which the building was completed, but the year the Pharmacy company (that first owned it) was founded.\n\n<cite>I would bet just about anything that that 1904 plaque was not made in 1904.</cite>  \nThis might be a silly question, but would you care to elaborate why you think so? Again, I am no expert, and my research on this particular plaque hasn’t been exactly fruitful.\n\nAlso, this might be of interest to some of you —  \naccording to the records at Melbourne City Council, the 1932 was apparently Eric Gill’s.\n\ncheers  \nChrista\n\n"
    },
    {
      "time": " 27.May.2008 12.49pm",
      "content": "_would you care to elaborate why you think so?_\n\nOn stylistic grounds. Monoline sans serif types did exist at the turn of the century (though I do think this was based on the later Gill Sans as Tiffany said), but my understanding is that they were mostly used as a “jobbing” typefaces (for ads and other ephemera). So far as I know, they would not have been used to make something as permanent and serious as a building plaque. The uneven baseline seems stylistically out of character for premodernist design, too.\n\n_the 1932 was apparently Eric Gill’s_\n\nInteresting. That pentagonal 1 seems like a Gillish quirk.\n\n"
    }
  ]
}
