{
  "id": "45277",
  "title": "Why can't people educate themselves about ampersands?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Using c\\_t-ligature instead of an ampersand. Come on! (at “tips & examples” under query input field)\n\n ![](http://web.archive.org/web/20080924093146im_/http:/www.typophile.com/files/powerset_4909.JPG)\n\n(powerset.com)\n\n[minor edit]\n\n [‹ Teaching Typography](http://web.archive.org/web/20080924093146/http:/www.typophile.com/node/45430 \"Go to previous forum topic\") [Uses of Verlag from Hoefler & Frere-Jones ›](http://web.archive.org/web/20080924093146/http:/www.typophile.com/node/45381 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924093146/http://www.typophile.com/user/25546\" title=\"View user profile.\">aszszelp</a>",
  "time": "<br>",
  "uid": "25546",
  "comments": [
    {
      "time": " 13.May.2008 5.18am",
      "content": "It’s very small ... but to me it looks like Delicious (with the proper ampersand).\n\n ![](http://web.archive.org/web/20080924093146im_/http:/www.typophile.com/files/te_4634.png)\n\n"
    },
    {
      "time": " 13.May.2008 5.34am",
      "content": "Gotta love those gallic ampersands! YUM!\n\n"
    },
    {
      "time": " 13.May.2008 5.44am",
      "content": " ![](http://web.archive.org/web/20080924093146im_/http:/www.typophile.com/files/gallic_warrior_5376.png)\n\n"
    },
    {
      "time": " 13.May.2008 5.48am",
      "content": "“Why can’t people educate themselves about glyphs?”\n\nFirst of all, if you are talking about the ct-ligature in general, and the ampersand in general, they are not “glyphs” but “characters.” If you are talking about, say, the Garamond Premier Pro ct-ligature and ampersand, those are glyphs.\n\n"
    },
    {
      "time": " 13.May.2008 7.21am",
      "content": "J0s ßuivenga is r¡ght!\n\n"
    },
    {
      "time": " 13.May.2008 7.49am",
      "content": "You design type AND play MMOs AND decorate your avatar with your ampersand? Jos, you are the nerd KING!\n\n"
    },
    {
      "time": " 13.May.2008 8.05am",
      "content": ":-)\n\nBTW Have I already mentioned the eternal pleasure I get out of sleeping upside down in my wardrobe closet (a bit like a giant bat)?\n\n"
    },
    {
      "time": " 13.May.2008 8.45am",
      "content": "I must admit, I am baffled. I know that style of ampersands, that’s why I thought they mixed it up with the ct-lig. However, for me that glyph (which is in that particular font indeed the ampersand) for me looks more like a ct-lig than a script-capital-e\\_t-ligature formed ampersand.\n\nStill nice to learn (and not to be scorned immediately for being in this case stupidly mistaken). I like this community. :-)\n\n"
    },
    {
      "time": " 13.May.2008 9.32am",
      "content": "Don’t forger this wonderful contraption: 8c  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080924093146/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 13.May.2008 9.36am",
      "content": "At that size, it actually looks more like “Et” to me than a typical ampersand. There probably are ampersands that look much like the c\\_t lig.\n\n"
    },
    {
      "time": " 13.May.2008 10.42am",
      "content": "Personally, I think it’s a mistake to make the ampersand look too much like “Et,” the latin word for “and,” from which it derives. Recently a number of fonts have done it, but to me it’s distracting. The most of the old ampersands are notable in not ’reading’ as “et,” even though you can figure how they “got here from there” when you inspect them.\n\n"
    },
    {
      "time": " 13.May.2008 12.14pm",
      "content": "Good point. You don’t want people saying “et” when they read an ampersand. This may be a bit off topic, but does anyone know of an ampersand that uses shapes from a, n, and d? I guess that would be sort-of English only, and probably something lots of people would find distracting.\n\n"
    },
    {
      "time": " 13.May.2008 1.34pm",
      "content": "’Et’ vs ’ct’ vs the ’8x’ immm either-way I like Delicious ’Et’ ampersand certainly beats the ’8x’ or is it ’8c’ though nothing really beats the good old ’and’\n\n[http://en.wikipedia.org/wiki/Ampersand](http://web.archive.org/web/20080924093146/http:/en.wikipedia.org/wiki/Ampersand \"http://en.wikipedia.org/wiki/Ampersand\")\n\n"
    },
    {
      "time": " 13.May.2008 3.17pm",
      "content": "I like to see “&c.” used in lieu of “etc.”\n\n"
    },
    {
      "time": " 13.May.2008 5.54pm",
      "content": "You’re not the only one, Nick. I rarely use it myself (since I tend to spell it out as ‘et cetera’), but I do like it.\n\nIn my normal handwriting, I also write my ampersands as an Ɛ with a vertical line through it (like a ‘|’, but with higher ascender and lower descender), a self-invented evolvement of the _Et_ ampersand.\n\n"
    },
    {
      "time": " 13.May.2008 10.15pm",
      "content": " The “&c.” abbreviation for “et cetera” looks good with almost every style of ampersand other than the G-clef one. And it usually needs an italic _c_.  \n—Joel\n\n"
    },
    {
      "time": " 13.May.2008 10.36pm",
      "content": "And if you’re going old-school with the “&c”s, I hope you occasionally [double them up](http://web.archive.org/web/20080924093146/http:/www.nlm.nih.gov/exhibition/cholera/images/9602955.jpg) for effect!\n\n"
    },
    {
      "time": " 14.May.2008 1.50am",
      "content": "Actually, when etc. is at the end of a sentence or even more, at the end of a paragraph, I _do_ double it up — in speech.\n\n"
    },
    {
      "time": " 14.May.2008 4.19am",
      "content": "Hey guys, i’m brand spankin’ new! to the forum and like to point out an article i ran up against in the light of the discussion upstairs..  \n [www.typography.com](http://web.archive.org/web/20080924093146/http:/www.typography.com/ask/showBlog.php?blogID=98)\n\n"
    },
    {
      "time": " 14.May.2008 8.59am",
      "content": "This seems to be a classic case of a correction’s being itself incorrect. The sample shown is clearly the Rotis Et ampersand.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20080924093146/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 14.May.2008 9.14am",
      "content": "To me this seems to be a classic case of an incorrect correction on a correction that itself is correct.\n\n"
    },
    {
      "time": " 14.May.2008 11.02am",
      "content": "I think that the ampersand is one of those characters that has so many half-accepted forms that it has a wider spectrum of acceptable variations (with regard to basic legibility) than most characters. Maybe I’m off the mark, but I feel as if nearly any funky, pretzelish symbol interposed between two words will be read as “and.”\n\nMaybe lowercase g shares this distinction, too, to an extent.\n\n"
    },
    {
      "time": " 14.May.2008 11.18am",
      "content": "_feel as if nearly any funky, pretzelish symbol interposed between two words will be read as “and.”_\n\nMy favorite from [this thread](http://web.archive.org/web/20080924093146/http:/www.typophile.com/node/20998):\n\n ![](http://web.archive.org/web/20080924093146im_/http:/www.typophile.com/files/Picture_4666.jpg)\n\n"
    },
    {
      "time": " 14.May.2008 5.25pm",
      "content": "In Portuguese the word and is represented by the letter “e” so the & is rarely used as an alternative. Even so i use it as much as possible, mainly when i write &c.  \nI also must say that, personally, i don’t see any problem when the et ligature is really obvious... but then again Portuguese words will always have a close connection to their Latin predecessors. Et works perfectly on French as well, so i can see why some designers are making this ligature more obvious. I do understand that in English reading “et” may come out confusing but then again, in my opinion, the & has it’s own reading!\n\nSorry, if this post got confusing... is getting late here and I’m just too sleepy!\n\n"
    },
    {
      "time": " 15.May.2008 6.51am",
      "content": "Yeah, you would’nt use “&” much in languagees with single-lettered words for “and” like Portugues, Spanish, Italian, Russian...\n\n"
    },
    {
      "time": " 15.May.2008 8.32am",
      "content": "Don’t forget the\n\nY\n\n"
    },
    {
      "time": " 15.May.2008 10.47am",
      "content": "Hey, they still spelled “tips” and “facts” with a “z,” maybe that deserves some scolding.\n\n"
    },
    {
      "time": " 15.May.2008 2.13pm",
      "content": "Don´t forget the W and the K as well.\n\n"
    },
    {
      "time": " 16.May.2008 2.50am",
      "content": "I think they use the Z for branding.\n\n"
    },
    {
      "time": " 16.May.2008 5.35am",
      "content": "_I think they use the Z for branding._  \nRappers do the same, but it still looks/sounds ridiculous. I think that’s for another post though.\n\n"
    },
    {
      "time": " 16.May.2008 6.07am",
      "content": "As in\n\nPrestige Tatore y Hijos, sarl\n\n"
    },
    {
      "time": " 16.May.2008 6.47am",
      "content": "<cite>Personally, I think it’s a mistake to make the ampersand look too much like “Et,” the latin word for “and,” from which it derives. Recently a number of fonts have done it, but to me it’s distracting...</cite>\n\nIsn’t this rather undermined by your choice of profile image...?\n\nAdditionally, the single straight quote in place of the apostrophe in this thread title is somewhat ironic.\n\n"
    },
    {
      "time": " 16.May.2008 7.44am",
      "content": "An excerpt has been broadcast to the outside world via Twitter: [http://twitter.com/Typophile](http://web.archive.org/web/20080924093146/http:/twitter.com/Typophile \"http://twitter.com/Typophile\")\n\n"
    },
    {
      "time": " 16.May.2008 9.13am",
      "content": "\\>Isn’t this rather undermined by your choice of profile image...?\n\nI don’t think so. The E in the Caslon italic ampersand (in this case my version) is readable, but that swashy curly stuff on the right doesn’t “read” as a “t”. I think only if you know that the ampersand is derived from “et”, which most people don’t, would you puzzle out that the right part evolved from a “t”.\n\n"
    },
    {
      "time": " 16.May.2008 9.23am",
      "content": "You don’t think it’s a mistake to make it look too much like a swash E, then?\n\n"
    },
    {
      "time": " 16.May.2008 9.45am",
      "content": "Honestly, it’s a matter of what people are accustomed to seeing. So I don’t think people have a problem with the evident E in the Caslon (and some other old style) italics. The symbol as a whole doesn’t read as any word, and that I think is helpful. By the way, it was interesting to me that when I worked on my swash italic E, I couldn’t take it from the ampersand. I tried it and it wouldn’t work. I did use a curly E but had to change the form pretty completely. (Caslon himself never did a swash E. All those are Victorian and later.)\n\n"
    }
  ]
}
