{
  "id": "45281",
  "title": "Drop caps with \"snug\" first line",
  "forum": "Build",
  "tags": [

  ],
  "content": "At least in Scandinavian typography, the first line following a drop cap should be closer to the cap than the others, unless the drop cap constitutes a single letter word. Is there a way to do this in InDesign CS3? In the early nineties, in my student newspaper in Bergen, Norway, we used to do this in Quark 3.x by inserting two spaces between the drop cap and the next letter, and then kerning between the spaces. I’ve tried this in InDesign, but I can’t seem to make it work. Anyone?\n\n [‹ Computer generated text image](http://web.archive.org/web/20080708215738/http:/www.typophile.com/node/44982 \"Go to previous forum topic\") [how to select a unicode range using python ›](http://web.archive.org/web/20080708215738/http:/www.typophile.com/node/45222 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080708215738/http://www.typophile.com/user/30925\" title=\"View user profile.\">khomlong</a>",
  "time": "<br>",
  "uid": "30925",
  "comments": [
    {
      "time": " 13.May.2008 11.40pm",
      "content": "The heading should read: Drop caps with “snug” first line. Sorry!\n\n"
    },
    {
      "time": " 14.May.2008 3.32am",
      "content": "Apparently, InDesign tries to outsmart you when you insert two (or more) spaces directly after the cap. If you zoom in on the drop cap, with Hidden Characters on, you can see the spaces are discarded by the drop cap.\n\nHowever ... if you insert something _else_ than a space, your old trick works just fine. Insert a Hair Space — that’s the smallest one — and you can kern the first line as much to the left as you want.\n\nAlthough it does the trick, ID has a minimal amount of space between the ’cap and the text. It works much better if you set the amount of drop characters to “2”, insert a small space (hairy, thin, or whatever looks best for the _second line only_), and right after that another hair space, where you can adjust the position of the _first line only_.\n\n"
    },
    {
      "time": " 14.May.2008 5.26am",
      "content": "Brilliant, thanks! Hair turned out to be the right choice for the drop cap space following directly after the initial. For a three story A, I had to add another hair space (for a total of three) on the first line, kerning by the minimum value of –1000 between the 2nd and 3rd hair space and by –600 between the last hair space and the text. It looks right to me, thanks again!\n\n"
    },
    {
      "time": " 14.May.2008 3.22pm",
      "content": "<cite>Insert a Hair Space — that’s the smallest one — <cite></cite></cite>\n\nJust one more reason I put a zero-width space in my fonts. I believe it is U + 200B. This is also handy for kerning drop caps back in the margin, when you want optical alignment on the left edge of the characters.\n\n"
    }
  ]
}
