{
  "id": "45295",
  "title": "JetBlue is Back",
  "forum": "Joe Pemberton's blog",
  "tags": [

  ],
  "content": "[![](http://web.archive.org/web/20080907070849im_/http:/farm4.static.flickr.com/3190/2490596606_84e6746f8e.jpg)](http://web.archive.org/web/20080907070849/http:/www.happyjetting.com/)\n\nI love a compelling brand story. And before I jump in, I need to confess my ties to the JetBlue brand, having once designed the logo, identity and airplane graphics (ahem, the livery design to use industry parlance) while I was at [Merkeley and Partners](http://web.archive.org/web/20080907070849/http:/www.merkleyandpartners.com/).\n\nIn the original JetBlue style guide we listed Trade Gothic as the corporate typeface. After its initial run, and long after I was no longer involved with the brand it went through a seemingly endless stretch using Futura Bold and yellow (what were you guys thinking?!). Now, JetBlue is back to DIN and orange and their characteristic jab at the airline industry that I would like to think put them on the map. And no, I wasn't involved in the refresh, but I feel like JetBlue is somehow an offspring of mine and I so I'm compelled to keep an eye on it. [More after the bump.]\n\nI'm typically not in favor of a corporate identity that uses a typeface for its logo and the same typeface for all of its materials. This detracts from a logotype. When the type system is not distinct the logo can disappear. But, I'm even less in favor of Futura _anything_ and I also believe DIN works better for JetBlue than even Trade Gothic did.\n\nSo what's up now? When the rest of the airline industry is hunkering down, waiting for consolidation you have Virgin America making a splash and JetBlue trying to refresh their brand. Check a recent article at AdAge, [\"JetBlue Aims to Lift Fliers Above Industry's Hassles\"](http://web.archive.org/web/20080907070849/http:/adage.com/article.php?article_id=126890). JetBlue's wit is also back in full flavor. Check out the new [HappyJetting.com](http://web.archive.org/web/20080907070849/http:/www.happyjetting.com/)\n\n[![](http://web.archive.org/web/20080907070849im_/http:/farm3.static.flickr.com/2067/2490596428_75cfca659c.jpg)](http://web.archive.org/web/20080907070849/http:/www.happyjetting.com/)\n\n[![](http://web.archive.org/web/20080907070849im_/http:/farm4.static.flickr.com/3188/2489779217_ef6aa90cac.jpg)](http://web.archive.org/web/20080907070849/http:/www.happyjetting.com/)\n\n[![](http://web.archive.org/web/20080907070849im_/http:/farm3.static.flickr.com/2133/2490323020_48a7aa2be4.jpg)](http://web.archive.org/web/20080907070849/http:/www.happyjetting.com/)\n\n",
  "author": "<a href=\"/web/20080907070849/http://typophile.com/user/1160\" title=\"View user profile.\">Joe Pemberton</a>",
  "time": "<br>",
  "uid": "1160",
  "comments": [
    {
      "time": " 15.May.2008 9.28am",
      "content": "I read this yesterday afternoon, and this morning the Red Line (in Boston) was wall to wall with print versions of the Flash site.\n\n"
    }
  ]
}
