{
  "id": "4529",
  "title": "Critique Required Please",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "![SIM logo](http://web.archive.org/web/20131108143615im_/http:/www.typophile.com/forums/messages/29/34651.gif)   \nRebranding this mark for a small/regional company who are distributors of mid-range to high end office furniture. They've been in business since 1986. URL: [www.shaddy.com](http://web.archive.org/web/20131108143615/http:/www.shaddy.com/)  \n   \nThe toughest part was finding the right font for the word SIM. In these sketches, the word SIM uses Argus Extra Bold and for the tagline Eurostile or Helvetica Neue. I invite any suggestions and/or alternatives for font use, color scheme, and design.   \n   \nBest,   \nMJ\n\n",
  "author": "662",
  "time": "28 Apr 2004 — 10:51pm",
  "uid": "3605",
  "comments": [
    {
      "time": "29 Apr 2004 — 5:47am",
      "content": "I think 3 works, I'm not a fan of knocking out a logo out of a box. As for the colors I like the rich red but I like OFFICE FURNITURE in black. Its just my opinion\n\n"
    },
    {
      "time": "29 Apr 2004 — 5:56am",
      "content": "I like the Argus for the main logotype, but I'm not too keen on any of the others. Could be that it's too early in the am for lucidity ![:-)](http://web.archive.org/web/20131108143615im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nJust some notes: if you're doing the knockout thing, make sure the box is big enough (1, 5) as opposed to too tight (2, somewhat). Eurostile caption text flows well with their existing logo but not so well with the new.   \n   \nWhat about incorporating elements of this logo:   \nhttp://www.shaddy.furnishgroup.com/sw/themes/930/images/40004647\\_title.gif   \n   \nIt's part of the header inside their site and doesn't look too bad IMO.\n\n"
    },
    {
      "time": "29 Apr 2004 — 6:03am",
      "content": "Bugger, that's [existing logotype](http://web.archive.org/web/20131108143615/http:/www.shaddy.furnishgroup.com/sw/themes/930/images/40004647_title.gif).\n\n"
    },
    {
      "time": "29 Apr 2004 — 6:13am",
      "content": "Thanks for the feedback guys.   \n   \nI'll have to agree with both of you. I prefer the logos without a knockout, and i do not think the Eurostile font is appropriate for the caption text.   \n   \nI'm looking at option 4 at the moment; however, i'm still undecided if Helvetica Neue is appropropriate for the caption. In addition, would anyone suggest the use of ALL caps over lower case in this instance?   \n   \nCheers,   \nMJ\n\n"
    },
    {
      "time": "29 Apr 2004 — 2:02pm",
      "content": "I don't mind using all caps as long as you use small caps rather than titling caps. Something about a whole line of text in title caps just makes baby Jesus cry.   \n   \nWhat about mixed case? As long as you don't use Meta or something similarly high-tech looking, you won't risk a cliche logo.\n\n"
    }
  ]
}
