{
  "id": "45339",
  "title": "Need help finding the CMYK equivalent to PMS 296",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I’m having a bit of trouble finding the CMYK equivalent to PMS 296.  \nI have 4 different recipes.\n\n100 c 73 m 30 y 83 k (swatch pantone coated booklet 2005)  \n100 c 46 m 0 y 70 k (swatch pantone coated booklet 2002 & Indesign/Illustrator swatch charts)  \n92 c 75 m 54 y 66 k (Photoshop equivalent)  \n100 c 47 m 0 y 69 k (google search)\n\nCould some one give me the CMYK equivalent from a 2008 or 2007 Pantone Coated swatch booklet.\n\nThanks\n\n",
  "author": "ozcangirl",
  "time": "14 May 2008 — 8:46am",
  "uid": "31022",
  "comments": [
    {
      "time": "14 May 2008 — 10:42am",
      "content": "Most likely depends on which PMS 296 you mean. Coated, Uncoated, Matte, etc. I'd probably check with your printer for best results and keep the design file in PMS for them to separate.\n\nFrom Illustrator CS3\n\nSolid to Process - 100/46/0/70  \nCoated - 100/66/0/2  \nUncoated - 100/94/0/29  \nMatte - 100/46/0/70\n\n"
    },
    {
      "time": "14 May 2008 — 11:10am",
      "content": "Thanks for your answer.  \nIt's just that my client's version (recipe) of PMS 296 (solid to process) dates back to 2002.  \nI have a 2005 Pantone swatch book and the recipe isn't the same.  \nI just wanted to let them know that by declaring their logo PMS 296 they risk getting different shades of blue depending on which Pantone swatch book the designer has.  \nI also wanted to know if my 2005 recipe was the most recent. I know Pantone has released new swatch books but I don't have the latest version and was hoping to find someone with a more recent swatch book ie. 2006/2007 or 2008 to give me the recipe.\n\n"
    },
    {
      "time": "14 May 2008 — 1:08pm",
      "content": "My coated euroscale Pantone fan says 100c, 70m, 0y, 88k, but I can't remember when I bought this.\n\n"
    },
    {
      "time": "14 May 2008 — 1:26pm",
      "content": "Mine says 100c, 73m, 30y, 83k so it must be 2005 or later. It's the color bridge coated, first edition, and I think I got it within the last 2 years.\n\nI'd use the formula guide, not Illustrator equivalents.\n\nSome printers will charge extra if you have them separate the PMS colors for you, might want to check.\n\n"
    },
    {
      "time": "14 May 2008 — 1:39pm",
      "content": "Hi you also have to look at how it is printed, Pantone changes colours like the wind, at least we are now aware of it. The best way I have found is to cross check with a SWOP Spot to Process vs Euroscale Spot to Process and make a educated guess based on how your printer prints AND THE STOCK you are printing on and also what they match to ie your proof or theirs. The safest way it to get the printer to match... though this can have unexpected results... because printers can get spots wrong.\n\nMy first choice has always been Euroscale Spot to Process. With magazines I use SWOP, though I am using Quickprint and Pagestore to manage this.\n\n"
    },
    {
      "time": "14 May 2008 — 2:36pm",
      "content": "so for the grammar and spelling I was rushing to get this typed before taking off.\n\n"
    }
  ]
}
