{
  "id": "45343",
  "title": "Do you live in Athens or Barcelona?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "And do you like me? :)  \nI’ll be in those 2 cities next week and would love to meet up if anyone is around.\n\n [‹ Server for small office?](http://web.archive.org/web/20081014010939/http:/typophile.com/node/45385 \"Go to previous forum topic\") [Fighting typeface?? ›](http://web.archive.org/web/20081014010939/http:/typophile.com/node/45352 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081014010939/http://typophile.com/user/17709\" title=\"View user profile.\">HaleyFiege</a>",
  "time": "<br>",
  "uid": "17709",
  "comments": [
    {
      "time": " 14.May.2008 10.31am",
      "content": "I envy you, Haley! I wish I could see those places as well.  \nOh, and I am sure I would like you if I ever meet you :-)\n\nChrisL\n\n"
    },
    {
      "time": " 14.May.2008 4.59pm",
      "content": "That’s a shame you’re going to BCN. Madrid’s much better (and only 2.5 hours and 40€ by train away!).\n\nSeriously though, enjoy it. The architecture is the main draw of the city. What’s your primary reason to visit? Just vacation work or?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 14.May.2008 6.27pm",
      "content": "A little bit of both actually. We’re going to Athens to visit family and Barcelona to network.\n\n"
    },
    {
      "time": " 15.May.2008 12.24am",
      "content": "Too bad you dont pass by Istanbul.\n\ndr\n\n"
    },
    {
      "time": " 15.May.2008 4.40am",
      "content": "My family lived in Athens for a couple of years, but left just before the Olympics (the one in 2004, I mean)... It should be lovely this time of the year. I envy you, as I only got to visit during the hottest summer months.\n\n"
    },
    {
      "time": " 15.May.2008 7.51am",
      "content": "Go there!\n\n"
    },
    {
      "time": " 15.May.2008 8.54am",
      "content": "Hi Haley,  \nI’m a reluctant Barcelona-resident. The architecture here is... um.. well there’s Gaudi which is supposed to be fabulous. And it is I guess if your are interested in medieval-style production methods. Since architects and urban planners have forgotten that buildings and streets, and indeed cities are for people, Barcelona is like most larger city: a place you just want to get out of after a while.  \nBut sure, I’m always up for a coffee if you feel like ;)\n\n/Fredrik\n\n"
    }
  ]
}
