{
  "id": "45345",
  "title": "Linotype redoes and expands Meridien - now \"Frutiger Serif\"",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Yesterday, in the propaganda Linotype sends me monthly, in their “Adrian Frutiger’s 80th Birthday” stuff, I saw that they’ve redone Meridien; The new version is called “Frutiger Serif,” and has added more weights, a condensed version, lining and OSF, both proportional and tabular, small caps, extra characters, some revised characters, etc. Since Meridien has long been one of my favorites, I couldn’t resist buying a bunch of the weights, and discovered that they’ve somehow added a “private space” that makes everything accessible from Microsoft Word. Haven’t checked to see whether this screws up things in InDesign. The weights are slightly different than their previous Meridien (digital) equivalents, and they’ve futzed slightly with the spacing so that, for example, Frutiger Serif Medium now pretty much matches the old hot metal Meridien from D&P.\n\nI’ve only been playing around with Frutiger Serif for a couple of hours, but, so far, this looks to be a seriously nice revision that cures just about all of the flaws/weirdnesses/omissions that hurt the old Linotype Meridien and the extra weights and condensed version make it a lot more versatile. Check it out. They’ve even broadened out the lower-case “f” and provided a “normal” ampersand, although the original “gallic” ampersand is there as an alternative.\n\n [‹ Last word on a recto](http://web.archive.org/web/20081013102759/http:/www.typophile.com/node/45331 \"Go to previous forum topic\") [Fonts at the End of the Nazi Era ›](http://web.archive.org/web/20081013102759/http:/www.typophile.com/node/45328 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013102759/http://www.typophile.com/user/14764\" title=\"View user profile.\">Zivatar</a>",
  "time": "<br>",
  "uid": "14764",
  "comments": [
    {
      "time": " 14.May.2008 10.54am",
      "content": "Link: [http://www.linotype.com/5368/adrianfrutigersnewesttypefacefrutigerserif....](http://web.archive.org/web/20081013102759/http:/www.linotype.com/5368/adrianfrutigersnewesttypefacefrutigerserif.html \"http://www.linotype.com/5368/adrianfrutigersnewesttypefacefrutigerserif.html\")\n\n"
    }
  ]
}
