{
  "id": "45350",
  "title": "Is it worth it",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "This is a lettering job I did many years ago with a pointed pen. I am now thinking about digitizing it. It is quirky, with ornate caps, and has an exterior texture. Purely an antique titling font but not your typical Modern face. So I thought why not. Whatcha think and should I duck?\n\n ![](http://web.archive.org/web/20150417144329im_/http:/typophile.com/files/Rough_3547.jpg)\n\n",
  "author": "typerror",
  "time": "14 May 2008 — 12:52pm",
  "uid": "6065",
  "comments": [
    {
      "time": "14 May 2008 — 12:56pm",
      "content": "I think it is a very lovely take on this style. The one thing you might add are \"regular\" caps. I think this would make it more usable.\n\n"
    },
    {
      "time": "14 May 2008 — 12:58pm",
      "content": "Ditto Tiff. You can easily fit these deco caps in the OpenType Swash slots. If you'll pardon a little critique, I think the end stroke on your 'n's could use a little baseline overshoot.\n\nGet it out there, Michael. God knows we need more good alternatives to Papyrus.\n\n"
    },
    {
      "time": "14 May 2008 — 1:34pm",
      "content": "No speaky Papyrus! I did writey Peanut (P22)!\n\nMichael\n\n"
    },
    {
      "time": "14 May 2008 — 2:43pm",
      "content": "\"No speaky Papyrus!\"\n\nHa ha! Nice talk, folks!\n\nMichael, I like the roman, but I have to admit I don't see the swashy romantic caps going with it. I'd just focus on the scratchy modern. It's so informal already with italic outstrokes and ball terminals; The informality makes for an interesting feel. If there were a big loud bold to go with it I bet it would satisfy.\n\nLook at some of the informal copperplate styles in the old PLINC catalogs, at Akira Kobayashi's new Cosmiqua, which is sort of informal/modern, and the interesting, crumpled modern used in Martha Stewart Living, Surveyor. That has an informal quality as well. Yours, as display, could evoke everything from old gravestones to historic painted signs to certificates and deeds.\n\nAlso consider the intensity of the roughness. If it's kept at a certain level, it may scale better. Too rough and it will just look blurry at small sizes.\n\n"
    },
    {
      "time": "14 May 2008 — 3:05pm",
      "content": "The roughness is pretty similar to Peanut and it sets pretty well at smaller sizes. I always tell people that anything I design is not meant for small sizes, can't stop'em though. As to the caps I hear all of you loud and clear. A set of relative caps would be the best way to go but I want to keep the Script. This \"face\", and it is complete, was used in an annual report with swash caps and I kinda liked the secondary rhythm. Looking at this with fresh eyes you all have supplied me I feel the need for speed... some kick ass ligatures which I did not draw for this job. I knew it was a good idea to throw this up here and wait for the weigh in. Keep it coming. I will try and upload the lower case.\n\nBTW some of the weights are a tad off. The l.c. a is a bit heavy etc.\n\nMichael\n\n"
    },
    {
      "time": "14 May 2008 — 3:22pm",
      "content": "Here is the analog l.c.\n\nMichael\n\n ![](http://web.archive.org/web/20150417144329im_/http:/typophile.com/files/Italiano_5477.jpg)\n\n"
    },
    {
      "time": "14 May 2008 — 3:36pm",
      "content": "I love the details. That nib shape on the t really gets me.\n\nI don't think we were suggesting you lose the swash caps, but add standard caps to give it more opportunities for use.\n\n"
    },
    {
      "time": "14 May 2008 — 3:37pm",
      "content": "I love it! Make it or else!\n\nMikey :-)\n\nPS... You give Doyald Young a run for the money.\n\n"
    },
    {
      "time": "14 May 2008 — 3:40pm",
      "content": "Gotcha. Looking back you are very right. I tend to be eccentric sometimes, P22 Sting, a Blackletter, has Roman Capitals. But do not tell Kegler.\n\nMichael\n\n"
    },
    {
      "time": "14 May 2008 — 4:24pm",
      "content": "Doyald creates elegance... I leave chaos in the pen's wake! I love to design type but lettering lets you get away with murder!\n\n ![](http://web.archive.org/web/20150417144329im_/http:/typophile.com/files/Written_5716.jpg)\n\nMichael\n\n"
    },
    {
      "time": "14 May 2008 — 5:02pm",
      "content": "Well then, we need more blood in type! ;^)\n\n"
    },
    {
      "time": "14 May 2008 — 5:54pm",
      "content": "Yes it is worth it.. and do keep the swash Caps as an alternative.\n\n"
    },
    {
      "time": "14 May 2008 — 9:50pm",
      "content": "You definitely need to go ahead with this! To me the Swash caps do work well with the lower case, though I think I'd have alternate Roman caps as well.\n\n"
    },
    {
      "time": "14 May 2008 — 9:53pm",
      "content": "You know you could do mid-caps too. ;^)\n\n"
    },
    {
      "time": "15 May 2008 — 12:29am",
      "content": "<cite>I think the end stroke on your ’n’s could use a little baseline overshoot.</cite>\n\nI second this and with the new images I think the h and maybe m as well.\n\nIn addition I would maybe experiment with letting the top of the arch of the arm of the r go slightly higher as well.\n\nThe opening spaces of the diagonal letters might be a bit bigger than they need to be ( not the x ) but it's hard to say without seeing it set a bit more.\n\nAnd I agree, it does seem worthwhile.\n\n"
    },
    {
      "time": "18 May 2008 — 10:27am",
      "content": "I totally agree with the baseline overshot suggestion!\n\n"
    },
    {
      "time": "19 Jun 2008 — 7:19pm",
      "content": "The \"i\" is very sexy. :)\n\n"
    }
  ]
}
