{
  "id": "45353",
  "title": "Initial Drop Cap with Slant",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am setting a paragraph in Minion with an 8-line drop cap that happens to be an A. There is a lot of space between the right slant of the A and the left margin of the copy. Should I wrap the text so that the text margin follows the slant of the A? Same question for W. This is a relatively formal/traditional piece. Does anyone have an opinion?\n\nThanks\n\n [‹ Fighting typeface??](http://web.archive.org/web/20081014010944/http:/typophile.com/node/45352 \"Go to previous forum topic\") [words for ligatures... ›](http://web.archive.org/web/20081014010944/http:/typophile.com/node/45370 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081014010944/http://typophile.com/user/2101\" title=\"View user profile.\">nick</a>",
  "time": "<br>",
  "uid": "2101",
  "comments": [
    {
      "time": " 14.May.2008 2.01pm",
      "content": "Depends on the size of the A and the style of the piece. For an A that large I would probably follow its right stroke.\n\n"
    },
    {
      "time": " 14.May.2008 2.58pm",
      "content": "How about trying an italic A?\n\n"
    },
    {
      "time": " 15.May.2008 6.48am",
      "content": "The larger the initial letter, the more important it is to “shape” the text block to that initial. I almost always have text following a cap A slide at an angle down the right stroke. This allows you to make a more coherent form out of the first word.\n\nMany typographers tuck the first line into an L, and sometimes subsequent lines, depending on the size of the L and the nature of the design.\n\nIt depends on the shape of an O, but sometimes the first line needs to be drawn close to the cap to make the first word form up well. Also for Q and for R some times.\n\nIt is not often seen that text following W or V follows the right stroke to the left. But with really large caps the case can be made, especially in heavily designed matter.\n\nWith “straight” initial caps I often snug the first line to the cap and then insert an en space between cap and text in subsequent lines.\n\nHave fun.\n\npowers\n\n"
    }
  ]
}
