{
  "id": "45372",
  "title": "Cooper, tyke, sauna inspired new e.",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hello,\n\nI was just wondering... perhaps a bit early... what you think about my new letter e (my first self made letter e that is). A few months ago I worked quite a lot with the cooper, tyke and sauna typefaces and found myself drawing this e last week in the train.\n\nI used the little serif of the e to make the serifs of the other letters quickly in illustrator, but I was just wondering what you think of this e. =)))\n\nHmz.. knowing what other people post here I know this is not much... but I was just wondering if this would make a happy little alphabet that is worth pursuing further...\n\nThanks (as always) for your feedback! =)\n\nAve a nice day!\n\n| Attachment | Size |\n| --- | --- |\n| [appy-e.jpg](http://web.archive.org/web/20150417193233/http:/typophile.com/files/appy-e.jpg) | 25.67 KB |\n\n",
  "author": "skeetone",
  "time": "15 May 2008 — 2:03am",
  "uid": "11657",
  "comments": [
    {
      "time": "17 May 2008 — 6:00am",
      "content": "hmz... Is it really that bad or should i have made up a nicer story to go with the e to get some replies?\n\n"
    },
    {
      "time": "19 May 2008 — 8:18am",
      "content": "hmz... I'll continue with it a bit further and perhaps ask again at a later time. =)\n\nThink left.\n\n"
    },
    {
      "time": "19 May 2008 — 3:40pm",
      "content": "It's hard to tell the character of the alphabet from only a few letters, how the strokes vary and what the specific features of the font might be...maybe try a few more letters, then it will be easier to give suggestions.  \nIt looks like it might be suitable for cartoony computer games...was that the idea?\n\n"
    },
    {
      "time": "19 May 2008 — 3:44pm",
      "content": "It makes me think of chocolate cookies with jellowy stuff on them..it could be fun for a small cake shop, especially if you keep the weird blurby character of it.\n\n"
    },
    {
      "time": "27 Nov 2008 — 8:15am",
      "content": "Hi... sorry for the extremely late reply.  \nI haven't had time to work on it for a long time. So no updates for now. I thought I'd receive emails when people would reply, so I haven't checked this post anymore since I didn't get any updates in my mail.  \nBut it's nice to see that some people did reply to the post.\n\nVery much appreciated.  \nBendy I was just randomly drawing while sitting in the train to work and this letter was what I ended up with when I reached the last station. I didn't have any idea what to use it for (still don't)... I just thought that if I'd start drawing and making my own alphabet it would be a good learning curve to type design.\n\nThanks Flösser! Perhaps someday I will finish it and you never know... Maybe someday it might be used on something (although the company would have to be a \"good\" company... with good people and friendly animals and all that... I like those sorts of companies) =)\n\nanyway... sorry for the late reply.. and tnx for taking the time to write something about my e =)\n\nbye!\n\ndav2.\n\n"
    }
  ]
}
