{
  "id": "45385",
  "title": "Server for small office?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "**[Technical Post (not type related)]**\n\nOur office is small usually 3, sometimes 4 people. And I’m the designated IT person, even though I know zilch about it. Anyway, the office continues to plug along, connected locally via routers and ethernet cables and we had to recently buy another external harddrive.\n\nMy questions to the Typophiles are:\n\n1. Do any of you have a server for your small office?\n2. What made you decide to get one?\n3. Any suggestions/warnings about taking this road?\n\nI’m not sure if our office even needs a server. But, the network I’ve managed to just patch together, combined with the ever-increasing need for storing/backing up files, makes me think that _something_ needs to be done.\n\nI’d love to hear your experiences!\n\nThanks\n\n [‹ Georgian](http://web.archive.org/web/20080709020256/http:/www.typophile.com/node/45401 \"Go to previous forum topic\") [Font Explorer Problem - Can Somebody Help? ›](http://web.archive.org/web/20080709020256/http:/www.typophile.com/node/45393 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709020256/http://www.typophile.com/user/8098\" title=\"View user profile.\">mauphie</a>",
  "time": "<br>",
  "uid": "8098",
  "comments": [
    {
      "time": " 15.May.2008 8.22am",
      "content": "If all you need is more storage space, perhaps a NAS or a SAN would be easier to deal with than a server.\n\n"
    },
    {
      "time": " 15.May.2008 8.40am",
      "content": "The nice thing about a files server is that you can have everyone keep their job files on it—well, you can try to make them do it, anyway—and then have one centralized location for file storage and backup. Hard disks are so cheap that its often less expensive to buy more space than it is to pay an intern to clean up job directories and archive old files. Need more storage? Slap another firewire drive on the chain. Designer calls in sick? Great, just open the job files and work on it without having to dig around on his machines for files.\n\nJust make sure that you test your storage/backup/recover system often. Because this will also be a single point of failure!\n\n"
    },
    {
      "time": " 15.May.2008 10.24am",
      "content": "@Gus  \nI hadn’t considered a SAN, as that seemed more than we needed. And I had never heard of a NAS.  \nThanks for giving me other paths to investigate.\n\n@James  \nI thought file servers were less likely to fail (versus a regular old harddrive)? Right now we have a couple external harddrives that we back up old files, etc etc and I know that they won’t last forever. I though file servers had a longer life, right?\n\n"
    },
    {
      "time": " 15.May.2008 11.04am",
      "content": "I’m thinking of a SAN for home soon.\n\nEspecially since I have a few Windows boxes. I just got hit with a nasty virus and looks like I’m going to be reinstalling windows this weekend. Having my files on the C: Drive, in hindsight, is stupid. ;0)\n\nA file server is just a computer with hard drives in it, so it’s going to fail as often as any hard drive would. Remember, hard drives have a 100% failure rate, so the key is redundancy. Ideally, that’d be a RAID set up, with an off-site rotation of another backup (tape or external HD).\n\n"
    },
    {
      "time": " 15.May.2008 11.22am",
      "content": "Oh, all this makes my brain hurt. There are days when I miss being in a big corporate office, when I didn’t have to deal with any of this!\n\nSAN, RAID, NAS....time for me to do some research on these acronyms....\n\n"
    },
    {
      "time": " 15.May.2008 11.43am",
      "content": "<cite>I thought file servers were less likely to fail (versus a regular old harddrive)?</cite>\n\nServer-grade high speed hard drives are actually more prone to failure than consumer stuff because they use newer parts that haven’t had the kinks worked out (and because corporate clients buy expensive service contracts). But redundant arrays of drives can be put together to safeguard against a single drive failing. [These devices can be as simple as an external drive with two discs in a mirrored configuration, which is probably what you want.](http://web.archive.org/web/20080709020256/http:/www.lacie.com/us/products/product.htm?pid=10967)\n\nJust don’t count on this as a backup solution—99% of catastrophic data loss is a result of fire/flood/earthquake damage, and for a small office theft is next on the list. No matter how good the server is, keep a backup off site.\n\n"
    },
    {
      "time": " 15.May.2008 11.48am",
      "content": "\\> Oh, all this makes my brain hurt.\n\nGood thing I didn’t mention blade servers, then. ;-)\n\nFor network-attached storage (NAS), [this PC Magazine guide](http://web.archive.org/web/20080709020256/http:/www.pcmag.com/category2/0,1738,677853,00.asp) will get you started.\n\n"
    },
    {
      "time": " 15.May.2008 1.06pm",
      "content": "Thanks guys!  \nYou’ve given me some good options!\n\nBlade servers? I don’t wanna even know.\n\n"
    },
    {
      "time": " 15.May.2008 2.49pm",
      "content": "Hi I have this for backing up of old archived jobs that I end up needing daily... sort of use as a server...  \n [http://www.macpower.com.tw/products/hddmulti/taurus/pdd\\_lan](http://web.archive.org/web/20080709020256/http:/www.macpower.com.tw/products/hddmulti/taurus/pdd_lan \"http://www.macpower.com.tw/products/hddmulti/taurus/pdd\\_lan\")  \nalso see this one  \n [http://www.macpower.com.tw/products/hddmulti/hydra/hydra\\_lan](http://web.archive.org/web/20080709020256/http:/www.macpower.com.tw/products/hddmulti/hydra/hydra_lan \"http://www.macpower.com.tw/products/hddmulti/hydra/hydra\\_lan\")\n\nthough you have to be careful with naming of files, no crazy characters I use a freeware app Mac2Fat that sorts that.\n\nand this one for backing up to as a portable backup:  \n [http://www.macpower.com.tw/products/hdd3/pleiades/pd\\_scombo](http://web.archive.org/web/20080709020256/http:/www.macpower.com.tw/products/hdd3/pleiades/pd_scombo \"http://www.macpower.com.tw/products/hdd3/pleiades/pd\\_scombo\")\n\n"
    }
  ]
}
