{
  "id": "45393",
  "title": "Font Explorer Problem - Can Somebody Help?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi -\n\nI've used Font Explorer for a few years now without issue. But suddenly, If I go to activate my type, for example. Gotham, Gotham Italic, Gotham Light... They all show up as \"gotham\" in Font Explorer. So in a list it looks like\n\nGotham  \nGotham  \nGotham  \nGotham\n\nThen the style column on the far right, it simply says regular. The font files are all named according to the correct style of the typeface, but for whatever reason when they are n Font Explorer, they come up as the same thing. When I actually activate all of them, I do not get a conflict, but in my software they only come up as Gotham regular.  \nI've just upgraded my mac to 10.5.2. But I don't know if this problem was around before that.\n\nHas anybody else ran into anything like this before?\n\nThank you!\n\n",
  "author": "<a href=\"/web/20100927050045/http://www.typophile.com/user/28070\" title=\"View user profile.\">ClineCo</a>",
  "time": "<br>",
  "uid": "28070",
  "comments": [
    {
      "time": "",
      "content": "Hi Roger,\n\nhave you tried deleting the cache(s)?  \nYou could try asking them: [http://www.fontexplorerx-board.com/](http://web.archive.org/web/20100927050045/http:/www.fontexplorerx-board.com/ \"http://www.fontexplorerx-board.com/\")\n\nF\n\n"
    },
    {
      "time": "",
      "content": "Nice. Thank you! I'll check out the board.\n\n"
    },
    {
      "time": "",
      "content": "Figured it out. For whatever reason my type's styles were defined incorrectly. A couple of keystrokes in Fontlab and I'm taken care of. Thank you for the direction.\n\nRoger\n\n"
    },
    {
      "time": "",
      "content": "ClineCo - how exactly did you do that in FontLab? I'm new to the program, but have exacly the same problem as you described in the beginning of the thread.\n\nWeird + annoying.\n\nGot directions?\n\nThanks!\n\n"
    }
  ]
}
