{
  "id": "45400",
  "title": "ITC's Lame-o promotion",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So this is not a rant about free fonts or anything, but seriously? Does this promotion appeal to ANYONE?\n\n ![](http://web.archive.org/web/20081013104525im_/http:/www.typophile.com/files/Picture-1_6191.png)\n\n [‹ Postscript Fonts in Office 2008?](http://web.archive.org/web/20081013104525/http:/www.typophile.com/node/45602 \"Go to previous forum topic\") [Font Forge ›](http://web.archive.org/web/20081013104525/http:/www.typophile.com/node/42915 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013104525/http://www.typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 15.May.2008 1.19pm",
      "content": "Well, I guess University Roman better than when Linotype gives out one weight of a superfamily that’s of next to no use on its own. But Veer definitely does promos better.\n\n"
    },
    {
      "time": " 15.May.2008 2.54pm",
      "content": "It’s not even that. Who DOESN’T already have this font? I’m not saying who USES the font, I’m saying OWNS the font. It comes on every package of fonts ever created.\n\nAnd it has approximately 3 uses.\n\n"
    },
    {
      "time": " 15.May.2008 3.15pm",
      "content": "Good point.\n\n"
    },
    {
      "time": " 16.May.2008 3.37am",
      "content": "I think ITC did a very good promotion ... I like it.\n\n"
    },
    {
      "time": " 16.May.2008 5.35am",
      "content": "I’m not sure what all three uses of University Roman are. I know one is definitely Ice Cream Shoppe signage (it’s gotta have the “pe” on the end), but what are the other two? Community Theatre Winter Concert program? Tim machine operator’s manual? What else?\n\n"
    },
    {
      "time": " 16.May.2008 8.00am",
      "content": "I think the third use is “Advert for the font _University Roman_”, in which context it’s absolutely perfect...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 16.May.2008 6.52pm",
      "content": "University Roman was used for all the bronze monument signs at the gateways of the gated communities in Roseville, CA, until some were stolen for scrap value and the rest were removed to preclude their being stolen for scrap value.\n\n"
    },
    {
      "time": " 16.May.2008 7.57pm",
      "content": "Dan,  \nThey could always give away a free copy of Arial and TNR with every purchase :-)\n\nChrisL\n\n"
    },
    {
      "time": " 16.May.2008 9.14pm",
      "content": "People in Baltimore steal manhole covers to sell for scrap. But I bet they might not if they were set in University Roman.\n\n"
    },
    {
      "time": " 16.May.2008 11.17pm",
      "content": "This falls under the category of you shouldn’t have or thanks but no thanks.\n\nMikey :-/\n\n"
    },
    {
      "time": " 17.May.2008 12.10am",
      "content": "I would prefer Flash Dance leg warmers\n\n"
    },
    {
      "time": " 17.May.2008 2.13pm",
      "content": "University Roman is a rip-off from my font called Celtic roman. I originally found the alphabet in a speedball lettering book and made a light and bold version for photolettering.\n\n"
    },
    {
      "time": " 17.May.2008 7.20pm",
      "content": "wow... Celtic Roman is a much better name for it, and being ripped off... the 80’s must have been bad seeing the ripped off version everywhere.\n\nLove your other typefaces Robert\n\nNow a ripped off version, I really would prefer the Flash Dance leg warmers.... only the original ones ;)\n\n"
    },
    {
      "time": " 17.May.2008 9.10pm",
      "content": "haha the store next to mine [http://www.stefilara.com/](http://web.archive.org/web/20081013104525/http:/www.stefilara.com/ \"http://www.stefilara.com/\") uses this font for their sale signs and it’s got a nasty feel to it, like american-made mexican fast food. It just has that not-quite-real, yet not-quite-plastic either feel to it.\n\nand yet sadly, after a quick check of spotlight, it’s on my hard drive (not installed though). \\*whimper\\*\n\n"
    },
    {
      "time": " 18.May.2008 3.51am",
      "content": "ohhhh fun University Roman mixed with poorly kern Black Chancery — just what every fashion conscious ad person needs to get out there to the public!\n\n"
    },
    {
      "time": " 19.May.2008 5.24am",
      "content": "Well, it used to be [ITC Dave’s Raves Two](http://web.archive.org/web/20081013104525/http:/www.itcfonts.com/Fonts/detail.htm?pid=203666). ;•)\n\n"
    },
    {
      "time": " 19.May.2008 5.35am",
      "content": "I wonder if this is Celtic Roman, then, it doesn’t quite match the version I have of University Roman.\n\n ![](http://web.archive.org/web/20081013104525im_/http:/www.typophile.com/files/bethel2_3486.jpg)\n\n"
    },
    {
      "time": " 19.May.2008 5.36am",
      "content": "“I think the third use is “Advert for the font University Roman””\n\nHAHAHA. It’s like the Paris Hilton of typefaces. Its only purpose is promoting itself.\n\n"
    },
    {
      "time": " 19.May.2008 7.21am",
      "content": "Ouch. That Stefilara site is painful.\n\n"
    },
    {
      "time": " 19.May.2008 1.36pm",
      "content": "University Roman was extremely popular, right up there with Souvenir and Korinna, in the late 1970s.\n\n"
    },
    {
      "time": " 20.May.2008 9.38pm",
      "content": "@DanGayle: sorry, maybe I should have included a warning in the message ;)\n\n"
    },
    {
      "time": " 21.May.2008 8.55am",
      "content": "I saw this twice yesterday.  \nOnce at the city park entrance and once on a sign for a landscaper. Both signs were entirely University Roman.\n\n"
    },
    {
      "time": " 21.May.2008 2.39pm",
      "content": "This is how I decide if want to go to weddings, based on the the invite and if they used University Roman (or similar)... ;)  \nBrush Script or Mistral would could possibly top this... depending on if they use all uppercase. ;).... :] :)\n\n"
    }
  ]
}
