{
  "id": "45402",
  "title": "Subscript and Superscript in FontLab Metrics and Dimensions window",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Can anyone explain what these settings in the Font Info window control and how you determine what settings to use, especially if your font contains superscripts and subscript numerals? Neither the Fl manual nor Learn FL Fast addresses this.  \nThanks,  \nJuliet\n\n",
  "author": "jshen",
  "time": "15 May 2008 — 2:07pm",
  "uid": "24608",
  "comments": [
    {
      "time": "15 May 2008 — 4:08pm",
      "content": "Do you mean the numbers in Font Info -\\> Font Dimensions -\\> Subscript and Superscript?  \nThese don't have any relation to the actual glyphs in your font, they are merely suggestions for programs that synthesize (i.e. scale and position) super- and subscripts. And it's not even guaranteed all programs use these; InDesign, for example, uses its own default settings.  \nThe same goes for underline and strikeout thickness and position.\n\nNote that these numbers are in _design_ values; for a typical Type 1 font in 1000ths, for a TTF in 2048ths. Typically, they are in percents in any other program (hint towards FL).\n\n"
    },
    {
      "time": "15 May 2008 — 5:16pm",
      "content": "Yes I do mean the settings in the Font Info \\> Metrics and Dimensions \\> Subscript and Superscript window.\n\nI understand they have nothing to do with your glyphs and they may not be accessed by a lot of apps, but since they are in the font info I was just wondering if anyone has ever deliberately changed the values they found there, deleted all the values, or made an effort to put values that would be appropriate if they were accessed? Is it safe to ignore this window? Is that what most designers do?\n\n"
    },
    {
      "time": "18 May 2008 — 5:00am",
      "content": "Microsoft Word for Windows uses these, so it does make sense to put reasonable values in there. Ideally, the values should correspond to the actual sizes of your \"sups\" and \"sinf\" glyphs.\n\nAdam\n\n"
    },
    {
      "time": "18 May 2008 — 5:10am",
      "content": ".. so it's up to the designer. Thanks, Adam, sound advice.\n\nGiven that, would you consider ID at fault? They could have added an \"auto\" checkbox to the superscript/subscript preferences.\n\n"
    },
    {
      "time": "19 May 2008 — 11:43am",
      "content": "Adam,  \nFrom what point in the glyph window are xpos and ypos positions measured (left side-bearing and baseline)?  \nThanks,  \nJuliet\n\n"
    },
    {
      "time": "19 May 2008 — 12:47pm",
      "content": "<cite>Given that, would you consider ID at fault?</cite>\n\nID is OpenType-savvy which means that it gives access to especially designed superior/inferior numerals and (depends on the font) letters. Not only scaled, but also slightly bolder than merely scaled ones so they better fit with normal-sized letters.\n\n<cite>From what point in the glyph window are xpos and ypos positions measured</cite>\n\nThe official description is at [http://www.microsoft.com/OpenType/OTSpec/os2.htm](http://web.archive.org/web/20141020010159/http:/www.microsoft.com/OpenType/OTSpec/os2.htm \"http://www.microsoft.com/OpenType/OTSpec/os2.htm\")\n\n"
    },
    {
      "time": "21 May 2008 — 6:04am",
      "content": "\\> From what point in the glyph window  \n\\> are xpos and ypos positions measured\n\nFrom the 0,0 point, just like any other coordinate.\n\nA.\n\n"
    },
    {
      "time": "21 May 2008 — 8:28am",
      "content": "Ups, got the question completely wrong ...\n\n"
    }
  ]
}
