{
  "id": "45404",
  "title": "Least Favourite Letters",
  "forum": "Design",
  "tags": [

  ],
  "content": "This is a funny question, perhaps.  \nWhat are people’s least favourite letters to design when starting a font? Do they get left until last, or do you get them out of the way first? Are they the ones that are simple or complicated?  \nI’ve only started on one family but it seems my least favourites are left until last in all of the weights. I think I don’t like the ones that seem like their shapes can withstand less experimentation (like M, V or Y), or are similar to other shapes (P or Q), and love the freedom of experimentation with complicated curvy shapes (like a, g, e, s). I like designing x too.  \nI find number glyphs the hardest, but that’s probably because in my daily life I am subjected to more letters than numbers so they are more familiar.  \nDoes anyone else find the same thing?\n\n [‹ Suitable Greek and Hebrew letters to use with Bodoni](http://web.archive.org/web/20080709015416/http:/www.typophile.com/node/45567 \"Go to previous forum topic\") [Arrow Circle ›](http://web.archive.org/web/20080709015416/http:/www.typophile.com/node/35560 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080709015416/http://www.typophile.com/user/20652\" title=\"View user profile.\">Bendy</a>",
  "time": "<br>",
  "uid": "20652",
  "comments": [
    {
      "time": " 15.May.2008 3.11pm",
      "content": "Gosh! I forgot to mention o and O...they are very deceptive. To a novice they seem simple, but there’s a lot of things going on in that ellipse that need to be right. There isn’t the freedom...either it’s right or it’s wrong.\n\n"
    },
    {
      "time": " 15.May.2008 3.11pm",
      "content": "I struggle with x (and X). It’s a stealthy bugger. It’s a relatively simple beast to start with, but if it needs adjusting its simple demeanour hides a complex and time-consuming beast. Getting the optical compensation on the bottom-left to top-right stroke is a bugger to adjust if you need to flesh it out or slim it a bit. It being at the end of the alphabet doesn’t help either. You think you’re nearly there with your adjustments and x takes you an hour. The bastard!\n\noO0 are all a bit trecherous, but that’s probably down to the fact they are so fundamental. I mean, an o is primary, wheras an h falls out of an n.\n\n8 is a toughie too. But an enjoyable one. 4’s a stiff beast. 2 is quite gratifying. I like the numbers in general. As Jonathan Hoefler pointed out in a talk recently, their open sides are (mainly) opposite to the Roman alphabet: They open to the left. When you get on to them it makes for a refreshing change.\n\nI like g though. g’s a pleasure. Nicer than G, which I often have trouble disconnecting from the C. s & S are good too. Complex is often satisfying. Z, though simple, always comes out easily. It seems to sit more solidly than most. Sitting it back on its haunches is satisfying. I like the fact it’s ’backwards’ too — thick stroke on the ’wrong’ diagonal.\n\n"
    },
    {
      "time": " 15.May.2008 3.13pm",
      "content": "w is a real bugger; because it has to relate to well, so is v. I find most of the figures are downright nightmarish, but that’s probably because I do it so rarely.\n\n"
    },
    {
      "time": " 18.May.2008 7.15pm",
      "content": "L.\n\nYou would think a letter so minimal would be easy to design or set, but it is the complete opposite. I have always found that the lack of space, ends up “overshadowing” any sort of harmony or clarity. This is especially obvious when two lower case L ’s are together, or next to a lower case I.\n\n"
    },
    {
      "time": " 19.May.2008 3.39am",
      "content": "I find following letters hardest in Antiqua Roman: g, ʒ (that’s a long z, not an old-style 3), 8 and old-style (i.e. x-height) 2, though for different reasons. In the case of “g” I have trouble because of its form, I tend to want to play around with it, to innovate (a lot!) but then have to realise, that in a conventional font you might not be too far from designs known by the reader, and I find myself bound by tradition. I’d really love to conceptualise the g, but in non-display fonts, the strong deviation from readers’ expectation is a no-no. Actually, I blame the type designers of old, when they derived conceptual forms from calligraphic ones, they would not do so with g, even emphasising its calligraphic origins. The ʒ is troublesome, as I’d like it to harmonize well with both g and z. Most fonts use regular stroke width as defined by ductus for that letter, while z uses the reversed one. I dislike that. 8 makes most trouble in bold faces. But the book and light faces have to harmonise with the bold one within the family. Old-style 2 is a b\\*\\*\\*\\*, actually all figures make troubles, as they keep the ductus-induced stroke width, while in the case of the lc letters the pen-determined stroke width is overlayed by forms and ductus-considerations from the (epigraphic) capitals. A formalisation, that has never been done consequently historically, and now is “tradition”. The vertical stroke of old-style 5 in roman fonts is hard as well.\n\n"
    },
    {
      "time": " 19.May.2008 3.40am",
      "content": "But to come back to your question, they are not least favourite. It’s like asking, which is your least favourite child. I don’t think you have one. You love them all alike, even if some are more annoying :-)\n\n"
    },
    {
      "time": " 19.May.2008 4.08am",
      "content": " ![](http://web.archive.org/web/20080709015416im_/http:/www.typophile.com/files/least_3707.gif)\n\nin the real world you have to make more than A-Z and the worst historically have been ’fractions’ everyone in every technology always hated doing the production of fractions. The two others are in the image above and they need to be in every font now if you expect them to be considered professional. I hate currency symbols.\n\n"
    },
    {
      "time": " 19.May.2008 4.17am",
      "content": "I cringe whenever I know I have to make a san serif i-no-dot. Just makes me sick all over, fever, sniffles and aches due to cold... for 15-20 seconds, and then it’s over. I love all the rest.\n\nCheers!\n\n"
    },
    {
      "time": " 19.May.2008 7.48am",
      "content": "maybe you missed [this thread](http://web.archive.org/web/20080709015416/http:/www.typophile.com/node/18016), which induced one of the most sublime humorous moments here on typophile...\n\n"
    },
    {
      "time": " 19.May.2008 3.28pm",
      "content": "Wonderful thread there, Paul! This discussion is more interesting than I thought. Humm.  \nVince, yes, I should have said glyphs perhaps, but for now I’m working on the numbers and letters only...it’s an ultra black weight and gosh the W and w are difficult! I can’t seem to master 2 and 3 either, no matter whether lining or oldstyle!  \nI guess the challenge should makes you experiment more creatively how to resolve difficult shapes, so they should turn out more interesting.\n\n"
    },
    {
      "time": " 19.May.2008 7.27pm",
      "content": "I am speechless : I hate the G, the W along with the B ! Don’t know why...\n\n"
    },
    {
      "time": " 19.May.2008 8.18pm",
      "content": "“I cringe whenever I know I have to make a san serif i-no-dot.”\n\nAnd this from the former “Young Turk” of the type design world?\n\n"
    },
    {
      "time": " 21.May.2008 9.05am",
      "content": "I would have to say the icelandic lowercase ð (eth) is the most troublesome. Its intended design is often very difficult to implement in modular typefaces, in more regular typefaces it still has a very different form than most other letters, and the bowl almost always have to be smaller that the xheight to make space for the crossing bar. And then it has to be kerned separately. Argh! ;)\n\nAnd I’m always wondering where to put that circumflex on the lowercase h in Esperanto...\n\n"
    },
    {
      "time": " 21.May.2008 11.54am",
      "content": "Is it permissible to make the left leg of the circumflex shorter on a lowercase h?\n\n"
    },
    {
      "time": " 22.May.2008 3.26am",
      "content": "“And this from the former “Young Turk” of the type design world?”  \nYoung turks grow up and learn the horrible truth of composites;)\n\nCheers!\n\n"
    },
    {
      "time": " 22.May.2008 5.04am",
      "content": "Ww, Xx and §.\n\n"
    },
    {
      "time": " 22.May.2008 8.34am",
      "content": "Some of my least favorite letters are IRS and IOU\n\n"
    }
  ]
}
