{
  "id": "45416",
  "title": "Choose a typeface for an essay",
  "forum": "Design",
  "tags": [

  ],
  "content": "Dear,\n\nI’m going to compose the lay-out my first essay. It is as essay which concerns some authors of XVII century. Some parts will be in Italian, other ones in Latin and few paragraphs will be in hieroglyphics (I found a free set of hyero. on the Internet)!\n\nFor my past books I used Simoncini Garamond, New Baskerville, Sabon, but for this one I would like to use a new typeface set (or more than one).\n\nDo you have any suggestion?\n\nThanks\n\n [‹ stationery / letterheads books ?](http://web.archive.org/web/20080706174541/http:/www.typophile.com/node/42835 \"Go to previous forum topic\") [Request : Examples of FF Sanuk in use ›](http://web.archive.org/web/20080706174541/http:/www.typophile.com/node/45537 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080706174541/http://www.typophile.com/user/23002\" title=\"View user profile.\">technopaegnion</a>",
  "time": "<br>",
  "uid": "23002",
  "comments": [
    {
      "time": " 19.May.2008 5.20pm",
      "content": "well, you’d better find a classical typeface with great real-italics\n\n"
    },
    {
      "time": " 19.May.2008 5.31pm",
      "content": "I think a neo-classical typeface would work even better. But I think a better question is what do the hieroglyphics look like? If we could see a sample of those perhaps that would spark some conversation.\n\n"
    },
    {
      "time": " 20.May.2008 12.21am",
      "content": "Unfortunately,\n\nI just found one complete set of hieroglyphics. This set is quite modern...  \nAn image of this set\n\n ![](http://web.archive.org/web/20080706174541im_/http:/www.typophile.com/files/hgly_6348.jpg)\n\nI don’t know if to use a neo-classical typeface like Bodoni or Didot, because many people find these typefaces too tiring to read and maybe these neoclassical sets are not suitable for texts about XVII century.  \nI like Garamond from Adobe or New Baskerville, but I’m unsure yet...\n\nIf you know other complete set of hiero. feel free to advise me.\n\n"
    },
    {
      "time": " 20.May.2008 11.41am",
      "content": "This sample is begging for something more modern than Garamond, though I do understand your line of thinking. You could always use the optically correct size of Didot (Hoefler) or Bodoni (ITC) and it would be easier to read.\n\n"
    },
    {
      "time": " 20.May.2008 2.12pm",
      "content": "I’ll use Didot (from Hoefler)... Maybe...\n\n"
    }
  ]
}
