{
  "id": "45427",
  "title": "Ambigram logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI'm trying to create an ambigram for a logo for a bespoke, alternative wedding jewellery maker. The name of the company is 'Ivy Clara;.\n\nHere is what i've come up with so far, and unless I can fine tune this to read more clearly I think I'll abandon the ambigram approach. Before I do throw in the towel however, I thought I'd post it here to see if you intelligent people can help out at all.\n\nAny hints, or tips on general ambigram creation would be welcomed; as well as specific advice on the uploaded example.\n\nThank you,\n\nDavid\n\n| Attachment | Size |\n| --- | --- |\n| [ambigram.jpg](http://web.archive.org/web/20131021031456/http:/typophile.com/files/ambigram.jpg) | 32.67 KB |\n\n",
  "author": "WhitePepper",
  "time": "16 May 2008 — 8:51am",
  "uid": "9776",
  "comments": [
    {
      "time": "16 May 2008 — 9:08am",
      "content": "I think what's working against it is it's too stylized. It's hard to pick out the letterforms at all. I didn't notice any characters just a pattern.\n\nTry simplifying and smoothing out the character shapes. It's quite rigid.\n\n"
    },
    {
      "time": "16 May 2008 — 9:51am",
      "content": "yes, you do need to smooth out the shapes!Id start by reshaping the y... it's the harder to read.\n\n"
    },
    {
      "time": "16 May 2008 — 11:50am",
      "content": "For something as difficult as \"ivyclara\", I think you'll find that even if you work out a really good ambigram, a lot of people still won't be able to read it, making it ineffective as a logo. But if you want to keep trying, I suggest centering it on \"l\" and you'll probably find better solutions. The development of an ambigram generally requires sitting down with a pencil and paper and doodling out as many bare solutions as you can find first, and applying style comes afterwards.\n\n"
    },
    {
      "time": "16 May 2008 — 3:41pm",
      "content": "the type treatment looks very gothic and I can't seem to read it, I guess you gotta experiment some other gothic typefaces.\n\nChriswong\n\n"
    },
    {
      "time": "16 May 2008 — 4:30pm",
      "content": "It looks awesome, but I cannot read it at all. As Asvetic said, try simplifying, and try to make it more of a recognizable letter. For instance, when you separate the 'v' it looks like a stroke down that connects to 'i' to make an 'n' (make space between) and the right stem of 'v' looks like an 's'. Utilize spacing and don't disconnect letters. That should help with legibility. The style looks great, but it's a matter of refining, connecting, and shaping.\n\n"
    },
    {
      "time": "20 May 2008 — 5:49am",
      "content": "Thanks all for your comments so far. I agree that this looks too stylized so I've gone back to pen and paper to simplify. It still looks rather blocky and stylized but I think it is now easier to make out and will provide a better foundation to build upon and smooth out.\n\nI tried centering it around the 'l' but it just didn't seem to work. What I like about centering it round the 'Cl' combo is that i can make the C a capital letter and therefore help divide the word into 'ivy' and Clara'.\n\nThis is just a scan (with a bit of photoshop) so it's very rough around the edges, but do you think it's a better attempt?\n\nThanks,\n\nDave\n\n ![](http://web.archive.org/web/20131021031456im_/http:/typophile.com/files/ambigram-sketch-6_6414.jpg)\n\n"
    },
    {
      "time": "20 May 2008 — 6:10am",
      "content": "It's better than the previous, but could be simplified and cleaned up even more. ivy is still difficult to ready, and the Cl is slightly better but not much. ArA is the most readable.\n\nI think you might want to consider staying with all caps or all lower case. Also, use line weight to your benefit. Thick lines stand out, light lines disappear, this could help make certain character more obvious when in reverse.\n\n"
    },
    {
      "time": "20 May 2008 — 6:30am",
      "content": "Thanks Asvetic. you're right, I think line weight will make a big difference, and is what I will work on next, though I'm not sure all caps or all lowercase will be possible (nice though it would be!)\n\nI just showed this to someone and thought it said 'Wazzam' so I guess I've still got a long way to go.... :)\n\n"
    },
    {
      "time": "20 May 2008 — 6:32am",
      "content": "And someone else has read it as 'watlara'....\n\n"
    },
    {
      "time": "20 May 2008 — 6:58am",
      "content": "Why not play off of 'ivy' and try to emulate a more organic line rather than the geometric slabs?\n\n"
    },
    {
      "time": "20 May 2008 — 7:08am",
      "content": "I definitely intend to! In fact, the style of the jewellry is very organic and 'ivy like' so it makes perfect sense to do that. I just find it easier to start all blocky like this and then refine.\n\nThanks for the input!\n\n"
    },
    {
      "time": "20 May 2008 — 7:36am",
      "content": "Does anybody have any suggestions on how to make the 'iv' less like a 'w' without losing the clarity of the 'ra'?\n\n"
    },
    {
      "time": "20 May 2008 — 8:29am",
      "content": "The reason I suggested the all upper or lower case, was that I was thinking you might have more success with italic lowercase letters and double story a's. I can see the i flowing out of the stem of the a, and l out of the descender on the y.\n\nKeep pushing yourself.\n\n"
    },
    {
      "time": "20 May 2008 — 8:45am",
      "content": "Hmmmm, I see what you mean. I'll give it a go!\n\n"
    },
    {
      "time": "20 May 2008 — 9:52am",
      "content": "Okay, I've taken your advice Asvetic, and come up with this. Again, its a very hastily put together 'sketch', but it seems to be much more legible now. Also, the curves give me something to work with to get that more organic feel that I'm after. I feel this is moving in the right direction now.\n\n ![](http://web.archive.org/web/20131021031456im_/http:/typophile.com/files/ambigram-sketch_7_6372.jpg)\n\n"
    },
    {
      "time": "20 May 2008 — 10:17am",
      "content": "I love your ambigram concept for a wedding jewelery designer. Your design has improved nicely. The latest posting is the first one that I could read the name clearly and not have to stare at it a few minutes to figure it out. Moving from a gothic-type of letter form to a more humanistic/organic was an excellent suggestion by aluminum. The second a in Clara needs some tweaking. Nice work and it's been exciting to see your progress. Looking forward to seeing the final version.\n\n"
    },
    {
      "time": "20 May 2008 — 10:43am",
      "content": "Much much better!\n\nPerhaps to make the C standout more, instead of closing the top of the inside curve of the a, have it turn into a ball terminal like on the v.\n\n"
    },
    {
      "time": "20 May 2008 — 10:50am",
      "content": "Did that last suggestion make sense? I'm talking about the inside of the double story a, keep it a double story, just don't close the counter.\n\n"
    },
    {
      "time": "20 May 2008 — 4:00pm",
      "content": "Yes, I think that makes sense - like this?\n\nKirsten, I've looped the tail of the a/i back over to give an illusion of a stem for the 'a' - do you think this works any better or does it just confuse?\n\nThanks\n\n ![](http://web.archive.org/web/20131021031456im_/http:/typophile.com/files/Ambigram-sketch-7_5801.jpg)\n\n"
    },
    {
      "time": "20 May 2008 — 4:38pm",
      "content": "yeah, but don't just have it end and turn into a ball, curve it around alittle to indicate the start of a counter.\n\nAlso, open up the C/a more.\n\nAlso, the loop on the y/R extends quite far, if you make it more circular you could shrink it vertically.\n\n"
    },
    {
      "time": "21 May 2008 — 5:31am",
      "content": "Okay, I've made some changes and I think it's looking cleaner and easier to read. I'm also beginning to add some ornamental swashy bits to help convey the nature of the jewelery. My problem with version 2 is that the final 'a' can be read as 'w', but then in version 1 it could read as a 'u'.\n\nWhat does everybody else think?\n\n ![](http://web.archive.org/web/20131021031456im_/http:/typophile.com/files/ambigram-2-options_6199.jpg)\n\n"
    },
    {
      "time": "21 May 2008 — 5:53am",
      "content": "Make it a stand alone i, don't connect it to v, that'll break up the u/w that's forming. I'd even elongate the swash off the i pass the l, really embellish it.\n\nThe C is still lost to me. Take a look at Scala's double story a. Notice how open it appears... that's what I was trying to refer to in the last reply.\n\n[http://www.myfonts.com/fonts/fontfont/ff-scala/](http://web.archive.org/web/20131021031456/http:/www.myfonts.com/fonts/fontfont/ff-scala/ \"http://www.myfonts.com/fonts/fontfont/ff-scala/\")\n\n"
    },
    {
      "time": "21 May 2008 — 7:11am",
      "content": "I don't suppose they'd want an exclamation point at the end of their logo?! :-)\n\n"
    },
    {
      "time": "21 May 2008 — 7:22am",
      "content": "Craig what do you suggest then?\n\n"
    },
    {
      "time": "21 May 2008 — 7:54am",
      "content": "What about tightening up the space between the 'i' and the 'v' and making the dot of the 'i' more of a brush-stroke (thin getting thicker)?\n\n"
    },
    {
      "time": "21 May 2008 — 8:51am",
      "content": "the i and the v are very readable and would probably withstand a little additional abstraction to get the second a to read more like an a. I'm not sure the additional swoosh on the i and the second a is bringing anything to the table. It's a complex design as it is, additional embellishments that don't aid the readability start to distract from the message. (same for the swoosh attached to the y and r) However I do prefer the logo on the diagonal.\n\n"
    },
    {
      "time": "21 May 2008 — 8:59am",
      "content": "_Craig what do you suggest then?_\n\nI hope the tone of my post wasn't taken the wrong way - I meant it as a tongue-in-cheek comment on how a little leeway in adding punctuation would make it a heck of a lot easier.\n\nLike Kirsten, I'd suggest dropping the swashes. I think with that done you're very close.\n\nIt's been interesting to see this develop (and it's come a long way)!\n\n"
    },
    {
      "time": "21 May 2008 — 9:36am",
      "content": "Craig, I took it with a bit of sarcasism... like you were saying, \"I DON'T suppose they’d want an exclamation point at the end of their logo.\" as in no exclamation and the mere idea was ridiculous.\n\nI apologize for jumping down your throat.\n\n"
    },
    {
      "time": "21 May 2008 — 9:50am",
      "content": "No problem at all.\n\n"
    },
    {
      "time": "21 May 2008 — 10:49am",
      "content": "I really like the progression so far. It looks way better done in script. I am not too sure about the swoosh coming off the 'Y' and 'R'. To me it seems to be erroneous and just confuses. It looks nice, but a bit stuck on at the end.\n\n"
    },
    {
      "time": "22 May 2008 — 5:52am",
      "content": "I've tried the standalone 'i' and I don't think it looks too much like an exclamation mark at all - it just sort of turns into an embellishment which is fine. I've unjoined the rest of the letters too and it seems to read that little bit more clearly.\n\nI also like the idea of the brush-stroke dot on the 'i' which i have now implemented.\n\nFor the time being I have also deleted the swooshes to aid legibility, though I may want to incorporate some again later. We'll see how it goes :)\n\nThe whole thing certainly needs tidying up, smoothing out etc, but does this seem like a step in the right direction?\n\n ![](http://web.archive.org/web/20131021031456im_/http:/typophile.com/files/ambigram-sketch-12_5072.jpg)\n\n"
    },
    {
      "time": "22 May 2008 — 6:14am",
      "content": "By George, I think you've got it!\n\nVery nice indeed. The letterforms have all come together, now it's time to work on size and flow.\n\nI think the C/a could be larger, and the v/a smaller. the first part ivyC looks even, but inverted the R in laRa stands out. Adjusting the vertical alignment of the letter might de-emphasize this, but you'll have to play around till you get something that works.\n\nYou're in the home stretch, it's really just a clean up and adjustment procedure now. Nice work!\n\n"
    },
    {
      "time": "23 May 2008 — 12:10am",
      "content": "The i is starting to look a bit like a necklace with pendant. That would be good for the efficacy of the brand if you can subtly reinforce that resemblance as you refine the curves.\n\n"
    },
    {
      "time": "26 May 2008 — 11:44pm",
      "content": "Nice work! You've made excellent progress. The \"a\" and the \"c\" might benefit from being more rounded.\n\n"
    },
    {
      "time": "27 May 2008 — 1:36am",
      "content": "Yes, I think that may help. As it stands, I've shown the current variation to a few people and nobody has yet been able to read it, which renders it pretty much useless as a logo, so unless I can improve the readability soon, I'm going to to have to try leave the ambigram idea and move on!\n\nAny more comments or suggestions welcome!\n\n"
    },
    {
      "time": "4 Jun 2008 — 6:52pm",
      "content": "Great job - looks great since I last looked!\n\n"
    },
    {
      "time": "6 Jun 2008 — 4:36am",
      "content": "Thanks! I haven't had time to go back to this yet but it's on the cards. I'll let you all know how it turns out (even if it's not an ambigram!)\n\n"
    },
    {
      "time": "9 Jun 2008 — 8:31pm",
      "content": "I'm getting an h out of that r personaly.\n\n"
    }
  ]
}
