{
  "id": "45435",
  "title": "Pirate type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi Everybody,  \nI'm doing a project on pirate typography. I'm looking at type that has been copied or altered slightly by someone then re-distributed under a different name such as:\n\n[http://www.urbanfonts.com/fonts/Weezer.htm](http://web.archive.org/web/20150123045147/http:/www.urbanfonts.com/fonts/Weezer.htm \"http://www.urbanfonts.com/fonts/Weezer.htm\")\n\nWhen this is just a rip off.  \nI was wondering if anyone else knew of any other pirate typefaces.\n\nCheers  \nRob\n\n",
  "author": "dontbelievethetype",
  "time": "16 May 2008 — 2:56pm",
  "uid": "28615",
  "comments": [
    {
      "time": "16 May 2008 — 3:15pm",
      "content": "\"Fake\" isn't a well defined term - you might want to consider the definitions here... [http://www.emigre.com/Editorial.php?sect=2](http://web.archive.org/web/20150123045147/http:/www.emigre.com/Editorial.php?sect=2 \"http://www.emigre.com/Editorial.php?sect=2\")\n\n"
    },
    {
      "time": "16 May 2008 — 4:23pm",
      "content": "I initiated a battle with the illustrious Alexandra \"B\\*\\*\\*\\*\" from Russia who has renamed Pouty, FontBureau, and copyrighted Bolero. Her and her partner Anatoly sh\\*\\*head. Available on Fonts101.com for anyone who wants it free (you better not). The ass's site, Jagdesh, is in Pakistan and we cannot touch him. 260+ viewings and 140+ downloads. Let's see that is 1400$ I will never see! It seems nobody even gives a rat's butt over there and it it too small potatoes over here (but not to me). I believe I heard we only go after the big boys from somebody. And then there was Pooper Black that was ripped by a major office supply company who settled and I got squat from. Etc. etc.\n\nSo maybe I am not the best person to reply to this. Merry Christmas and have a wonderful weekend!\n\nMichael\n\n"
    },
    {
      "time": "16 May 2008 — 4:27pm",
      "content": "Thanks for your help Michael.\n\n"
    },
    {
      "time": "16 May 2008 — 4:32pm",
      "content": "Rob\n\nSee if you can find a copy of the PRINT magazine that has the article by HZ... No one will ever steal my apples again (or something like that).\n\nMichael\n\n"
    },
    {
      "time": "16 May 2008 — 4:37pm",
      "content": "Yves Peters, fellow moderator here, gave a talk on this exact topic at ATypI in Helsinki.\n\nI'd also suggest reading John Downer's article, [\"Call it what it is\"](http://web.archive.org/web/20150123045147/http:/www.emigre.com/Editorial.php?sect=2&id=1).\n\nDerivative is a better way to put it.\n\n"
    },
    {
      "time": "16 May 2008 — 5:02pm",
      "content": "Sorry Miss T for the bad language but this stuff really bothers me. When he said \"under a different name\" I immediately got my hackles up... let's call it what it is, theft (at least in my case). That is not derivative. I say make the pirates walk the plank!\n\nArrrrrggggg!\n\nOne eye open and the other watching. Tee hee!\n\n"
    },
    {
      "time": "16 May 2008 — 5:27pm",
      "content": "<cite>Arrrrrggggg!</cite>\n\n ![](http://web.archive.org/web/20150123045147im_/http:/typophile.com/files/piratical_r_5026.jpg)\n\n"
    },
    {
      "time": "16 May 2008 — 5:55pm",
      "content": "I knew I should've added that I was talking to Rob, not you Michael. You, and all the others who've had their work stolen, deserve to be upset.\n\nIf it is an unauthorized derivative it is stealing. I didn't mean to paint a pretty picture by suggesting a more politically correct term for it. Academically speaking Rob should use the term derivative work as it describes what is being done. That's also why I suggested John's article.\n\n"
    },
    {
      "time": "16 May 2008 — 6:30pm",
      "content": "Miss T  \nNo problem mate. Went and cooked some shrimp on the barbie. Looked at the skewer and thought... hmmm, sure would like to... well you get my drift. They will get theirs.\n\nI only hope that one day I will see a logo here queried for font ID (but I don't do sans) and I can respond that the font is not available, it is proprietary and I ain't gonna give it up. I now have over 11 analog fonts that I use in my own work and I will be damned if I am going to give them up for some value lacking, immoral font pirate. I need to get a beer and a blood pressure pill!!!!!!!!\n\nMichael\n\n"
    },
    {
      "time": "17 May 2008 — 12:38am",
      "content": "Another example of \"derivative\" work: [http://www.typophile.com/node/43240](http://web.archive.org/web/20150123045147/http:/www.typophile.com/node/43240 \"http://www.typophile.com/node/43240\")\n\n"
    },
    {
      "time": "17 May 2008 — 2:51am",
      "content": "I recently stumbled over [this Perperua ripp-off](http://web.archive.org/web/20150123045147/http:/www.dafont.com/riven.font). The R and V glyphs are mutilated so some might call it a derivative. If you look into the TTF file, It still has Monotype's copyright-notice (mentioning Perpetua) in it.\n\n"
    },
    {
      "time": "17 May 2008 — 5:24am",
      "content": "I work for a greeting card company where we have a lot of proprietary fonts. I've had to pursue issues with our fonts showing up all over. The usual thing is just where a freelancer has walked out with a disk full of fonts and they just get passed around.\n\nThe one case that really bugged me was a very well respected type designer had several of her own versions of our fonts that she had scanned off of cards apparently. The font was identical except for a few odd characters. On her website she had elaborate descriptions of how she got inspired to come up with the idea and even had a link on her site for typeright. After a few unanswered emails, one of my team members ( who's work she had copied) contacted MyFonts who promptly removed the 2 in question. Then they showed up on Fonts.com whom we contacted and were again removed. Since then I haven't seen them around. She copied a friends work from a book and is profiting well from that. All this and she's still a popular designer.\n\n"
    },
    {
      "time": "17 May 2008 — 8:13am",
      "content": "Ask your older professors and local libraries if they have any old metal or phototype specimen books by smaller type vendors or typesetting firms. Some of these books are infested with pirated designs resold under a new name. It was so common for vendors to pirate Zapf’s designs that at one point he nearly left the industry entirely.\n\n"
    },
    {
      "time": "17 May 2008 — 2:09pm",
      "content": "URW++ is the worst offender. In the old days CorelDraw used to change the name to keep from paying royalties. Zapf says that Palatino has at least 23 suedonyms.\n\n"
    },
    {
      "time": "17 May 2008 — 3:20pm",
      "content": "And sinces somebody brought up CorelDraw, don’t forget to look up Bitstream. [This thread has a partial list](http://web.archive.org/web/20150123045147/http:/www.typophile.com/node/38526), there are much longer ones out there.\n\nAlthough I have to admit, in Bitstream’s case I often prefer the Bitstream versions to the official foundry versions. Too bad most of the serif fonts lack old-style figures.\n\n"
    },
    {
      "time": "17 May 2008 — 3:45pm",
      "content": "I am going to place this link again.  \n [http://www.emigre.com/Editorial.php?sect=2](http://web.archive.org/web/20150123045147/http:/www.emigre.com/Editorial.php?sect=2 \"http://www.emigre.com/Editorial.php?sect=2\")\n\nOne thing I have seen a lot on this regard and one exemple is Times. Let's speculate: Timez, Thimes, Tymes, Timhes, Tines. Tenpos, Thenpos, Thempos, Temphos, Tempum, Tiempos, Thiempos, Thiemps, Tiemps... and so on. It can be interminable the obtainable list.\n\nI have a question, and it regards to the study of old metal type. What if, that's my case, someone wants to digitize metal type from proofs of the very type, but without optimizing or interpreting it; trying to reproduce it defects, even the kerning problems, like in \"We\", where the W has it's space, causing the extra white between both letters. There is no minus kern, the only way to kern is to add space between characters.  \nThis idea comes from a problem: metal type is gone, so, the only way to have it back to letterpress is by 'reviving' it. (After reading the essay now I am not sure if 'revival' make sense).  \nDoes that make any sense? Would anybody shine some light here, please?\n\n"
    },
    {
      "time": "18 May 2008 — 12:36am",
      "content": "Bitstream has long since worked through those issues.\n\n"
    },
    {
      "time": "18 May 2008 — 8:42am",
      "content": "\"Metal type has gone\"\n\nIt's still alive and breathing where I live.\n\n"
    },
    {
      "time": "19 May 2008 — 4:44am",
      "content": "Yes. Bitstream. Actually I love Stymie. They added (I think) a Bold with Condensed and Extra Bold to the family, and Piranesi Italic, and Devinne, and Della Robia, &c. That is cool stuff and I already have it. I went thru some old specimens I have and I [picked this](http://web.archive.org/web/20150123045147/http:/www.photoblog.com/storage001/2008/05/18/) to show. It is Pynson Oldstyle Italic and is found on the American Line Type Book, ATF (1907). It happen that I don't remember ever seeing this anywhere, maybe a similar one. The contours of this face actually waves and appears to not have a straight line contour in any character, which makes it suitable to work with.\n\nWell, the type is not dead per se, it just may be locked somewhere, unused, forgotten in a dark storage, or the printer who has it don't know where it is; or in the bottom of a lake, or covered by asbestos (as James said) and no one dare to approach it. One thing is certain: some types are really gone, melted to make new or become soldiers or fishing artifacts.  \nIt is reasonable to think that some is indeed dead. Question is, resuscitating some of them for personal or commercial use can bring trouble to your door? Even if the intention is to brink some back as ludic exercise. As for naming one could call it like... \"House Font N.o 2\", or simply \"N.o 2\" (as House is already existent), but not hiding its origin, mentioning where it comes from, who have cut it first time, the designer name (when possible, as it appears to me that some type just had a denomination as being from ATF or BB&S or Central Type Foundry, &c.\n\nWhat I have learned so far, most of it here following peoples links and opinions (not to mention English language too...) is that if the creator is dead before 1925 and there is no 'recut' done between 1985 and 1990, one can just 'recut' it and maybe, maybe, call it by its real name (after extensive research on it making sure of not hurting any sensibilities...) ?\n\nTo make it sort of different, one can use a character set old fashioned [California Job Case](http://web.archive.org/web/20150123045147/http:/www.typophile.com/node/1668), as to keep it in a letterpress perspective. Only letterpress people would appreciate it, as it is not Eastern European nor Unicode OT, don't have diacritics and can and will be called \"useless\".\n\nDoes it make more sense now?\n\n"
    },
    {
      "time": "19 May 2008 — 6:15am",
      "content": "Robert Trogman wrote:  \n<cite>URW++ is the worst offender.</cite>\n\nMike Yanega [wrote in an older thread](http://web.archive.org/web/20150123045147/http:/www.typophile.com/node/2320#comment-18650):\n\n<cite>My understanding of many of the URW fonts was that when they had one of the few (along with Bitstream) places where foundries could get typefaces digitized (with their tool Ikarus), they made a deal that they could sell every font they digitized as long as they changes the name (hence all the Latin-sounding names for familiar-looking fonts).<br>\nSo Bitstream and URW truly do not belong in the bucket with other 'cloners'.</cite>\n\nSo, is URW(++) really an ‘offender’?\n\nRobert also wrote:  \n<cite>In the old days CorelDraw used to change the name to keep from paying royalties.</cite>\n\nAdam Twardoch has explained the Bitstream/Corel story [in another old thread](http://web.archive.org/web/20150123045147/http:/www.typophile.com/node/3003#comment-23904):\n\n<cite>[…] in the 1980s, Linotype was […] not interested in making digital fonts for the slowly emerging DTP market. A group of type designers including Matthew Carter left Linotype and started Bitstream, which was to become the first digital type foundry in the world. They digitized original Linotype typefaces, but Linotype refused to license the original trademarks to them. So they used names derived from their own classification (Humanist 777 being Frutiger, Swiss 721 being Helvetica, etc.). Bitstream licensed the names from some other foundries, so some of the fonts used original names (e.g. Futura), but those copied from Linotype, Monotype and Berthold designs usually did not. However, these still were very faithful and high-quality digitizations, not cheap knock-offs like many many other companies offered them. […]</cite>\n\n<cite>[In 2003], Linotype and Bitstream signed an agreement which finally ended their dispute over the designs. Linotype officially \"licensed\" the designs to Bitstream (but not the trademarks). This means, that prior to that, Swiss 721 was an unlicensed clone of Helvetica, and now it's a licensed version of Helvetica, but sold under a different name. […] This is handy to know as this sort of confirms that the Bitstream versions really are derived from the same original sources.</cite>\n\nLater in this thread, others who (I believe) do know the ropes of digital type history, like John Hudson and Gerald Giampa, elaborate on this.\n\nThus, Corel neither did change the names (Bitstream did that) nor did they avoid paying royalties. They were just lucky to sign a deal with Bitstream – which was very advantageous for the CorelDraw users and quite disastrous for the font industry.\n\n"
    },
    {
      "time": "19 May 2008 — 7:09am",
      "content": "As I recall Corel shipped a different set of fonts prior to bundling the Bitstream fonts with Corel 4(?) maybe that's a source of confusion.\n\nCheers, Si\n\n"
    },
    {
      "time": "19 May 2008 — 11:15am",
      "content": "I should think the font that Rob originally linked to should also be a trademark issue with Weezer, after whom the pirate font is named. Futura was used in their [logotype](http://web.archive.org/web/20150123045147/http:/en.wikipedia.org/wiki/Weezer_%281994_album%29) (if it can be called that), at least for as long as I was paying attention to what the once-mighty Weez was up to.\n\n=w=\n\n"
    },
    {
      "time": "19 May 2008 — 12:36pm",
      "content": "I think its century gothic, well that's the typeface that the person has copied.\n\nI've found quite a few others that are rip offs such as\n\nOptimus Princeps - Trajan  \nYellow Submarine - Amelia  \nProtestant - Helvetica\n\nThe one that gets me is Trumania it must be a complete knock off of  \nGill Sans Ultra Bold and in the information about it it says\n\n\"Trumania EEN was created in December, 2000 by Aesthetix Graphic Design exclusively for Famous Fonts ( [www.eliteentertainment.net/famousfonts](http://web.archive.org/web/20150123045147/http:/www.eliteentertainment.net/famousfonts \"www.eliteentertainment.net/famousfonts\")). It is based on the typeface used on the title of the Jim Carey film \"The Truman Show\". As far as we could tell, a freeware version of this font was not available, so we made one. This is NOT a pirated or renamed font. True, it may look just like another or several other fonts out there (and may even have the same character set), but it is an original.\"\n\nBut surely if it looks like and is almost exact to the original then it must be classed as pirate.\n\nI've also looked at type that has just been altered compared to the originals.  \nWhether it be distressed , or just changed to an outline instead of filled.  \nfonts like Keeno Katana, Arialic Hollow.\n\nAgain just rip offs of fonts we all know.\n\n"
    },
    {
      "time": "19 May 2008 — 12:53pm",
      "content": "Have you had the chance to read John Downer's article yet?\n\n"
    },
    {
      "time": "19 May 2008 — 1:26pm",
      "content": "yeah i've just read it. So Yellow submarine, Optimus Princeps & Protestant would be classed as Cat. 1 Knockoffs/Clones/counterfeits  \nwhere as the other distressed ones are Cat 2. Extensions/spin offs.\n\nBut something like Trumania, where they have said there wasn't a freeware version available surely there shouldn't be one because it was designed using Gill Sans Ultra Bold. And that Trumania shouldn't exist. Just use the original font.\n\nIts like saying there isn't a free version of of a song so we'll copy it, call it something different, then put on the internet. and insist that it's not the original because it is 2 seconds longer. Just because they say it's not the original doesn't mean it isn't.\n\nAnd he mentions about designers having copywriters and publicists, most of the fonts I have found are free and probably people who don't make much or if not any money from them.\n\nSo how is something like this font allowed to stay on sites like urbanfonts for free?\n\n"
    },
    {
      "time": "19 May 2008 — 2:24pm",
      "content": "Yes Simon, I did. Thank you for pointing that up. And this thread is so far off it makes me laugh. Totally lacking from his speech/diatribe is a celebration or promotion of new/innovative/groundbreaking type. I think this is one of the problems with the current type scene, not enough innovation and a laziness that leads people back to the easy path... revision, revival ad nauseum. I was recently contacted about doing a corporate style for a company. They faxed me the bid from a North East company. It said... \"we will adapt any of our faces to accommodate your needs.\" How creative is that? First time digital work on a previously unexplored style is just great; but for us to work and rework and rework styles is just a self indulgent exercise that does nothing to create styles for our times.\n\nHow many variations of Helveticas or Garamonds do we need if there is not a spits bit of difference between them. Oh I forgot you can add a bunch of alternates and call it new. Hell, the new breed of designers cannot even use the available ones effectively! I once had a design student that told me the leading was AUTO... how dumb is that? He would have not made it out of one of my classes but we have idiots teaching idiots. Unfortunately I got him in his senior year. Maybe we should expend our efforts educating the next generation of designers and then get back to the business of type design.  \nMichael\n\n"
    },
    {
      "time": "19 May 2008 — 7:35pm",
      "content": "URW++ has been warned by me to stop selling typefaces I originally licensed to Berthold Fototype. Stempel, Bitstream, Mecanorma and Letraset. They have never responded to my accusation of piracy.\n\n"
    },
    {
      "time": "19 May 2008 — 8:03pm",
      "content": "<cite>So how is something like this font allowed to stay on sites like urbanfonts for free?</cite>\n\nDo you have a few hundred thousand dollars and a patient IP lawyer on retainer?\n\n"
    },
    {
      "time": "19 May 2008 — 11:35pm",
      "content": "_for us to work and rework and rework styles is just a self indulgent exercise that does nothing to create styles for our times._\n\nThat may be true in some cases, but in general you can't blame type foundries for meeting the needs of the market.  \nA sensible business model for foundries centres on custom work for publications and corporations, and that is how many retail faces are developed. So when those institutions ask for conservative, derivative designs, that's what many foundries will devote their efforts to.\n\nAnd if you're developing retail fonts, it's foolish (or high-minded!) not to have some grunge and retro scripts in your catalog.\n\nUltimately, history mining and derivative work _is_ representative of our time. One reason perhaps, other than any general conservative trend in society, is that digital culture focuses on the possibilities of the space between media, rather than originating fresh content.\n\nNonetheless, there are plenty of novel, experimental, and original typefaces available. Subsequent to decrying the hegemony of Helvetica, I took a more positive tack in a 2004 magazine article bigging up (big upping?) ten new faces. Since then, I'd have to say there are a lot more original faces being published (just ask Stephen Coles), and the market for fonts appears to be thriving.\n\n"
    },
    {
      "time": "20 May 2008 — 4:03am",
      "content": "is that digital culture focuses on the possibilities of the space between media, rather than originating fresh content.\n\nNever thought of it that way Nick.\n\nMichael\n\n"
    },
    {
      "time": "20 May 2008 — 4:44am",
      "content": "\"Ultimately, history mining and derivative work is representative of our time.\"\n\nFor me this hits the nail head right on. Like or not, what you know comes from the past and it is not only IN you, it is in ALL of us.\n\nI decided to post my questions here, as I have this questions since late 1990s when I first used Fontographer. Actually my decision on moving forward with this 'antique' obsession is more a necessity then a interest on becoming one more in the crowd.\n\nMy interest is more of a print making perspective then font making. I have a press to feed, and better be using my own renditions of the old. I sincerely love it, and if it wasn't the case that my Time machine moved by WILL has a broken amber (which I am unable to reproduce), I am unable to go back to 1845, and buy it from the lead guys.\n\nCheers\n\nAndre Galvao\n\n"
    },
    {
      "time": "20 May 2008 — 5:07am",
      "content": "\"[…] in the 1980s, Linotype was […] not interested in making digital fonts for the slowly emerging DTP market. \"\n\nNot surprisingly, this is not true, as is seen in Linotype's 1984 licensing deal with Adobe (a dtp company for sure), for names and designs and later, data. In the early 80's Linotype became disinterested in type design, cut the funding of that department by a 1/4 of a million dollars per year and opened the exit doors wide. This condition, funding for machines but not new type development, was one they never recovered from. Bitstream had to make nearly the same decision by 1994, and went the same way, i.e. money for technology, not for new type.\n\nCheers!\n\n"
    },
    {
      "time": "20 May 2008 — 5:45am",
      "content": "Thanks for sharing your knowledge. It’s not easy to wrap one’s mind around those rather recent things that can’t read in books.\n\n"
    },
    {
      "time": "20 May 2008 — 8:44am",
      "content": "See [http://www.sanskritweb.de/forgers.htm](http://web.archive.org/web/20150123045147/http:/www.sanskritweb.de/forgers.htm \"http://www.sanskritweb.de/forgers.htm\") for a very jaundiced view of the font industry. The author also provides a mass of font-related information, including an exhaustive guide to the fonts supplied with Corel packages.\n\nThanks for the interesting discussion.\n\n"
    },
    {
      "time": "20 May 2008 — 9:08am",
      "content": "[Trumania]  \n_So how is something like this font allowed to stay on sites like urbanfonts for free?_\n\n_Do you have a few hundred thousand dollars and a patient IP lawyer on retainer?_\n\nEven if you had, you could well save your money and effort.\n\nYou may be aware that typeface designs are generally not copyrightable. Even if Gill Sans would have been copyrighted – Eric Gill has been dead since 1940, which means all his work will be in the public domain in a mere two and a half years.\n\nBut don't confuse this with the digital data of the Gill Sans fonts. The author of \"Trumania\" didn't use them, as you can see when you superimpose it with Gill Sans. Trumania is badly drawn, and no-one looking for Gill Sans Ultrabold will come across it as a viable alternative, so all this makes this a non-issue in my opinion.\n\nJens\n\n"
    },
    {
      "time": "24 May 2008 — 3:10am",
      "content": "\"The ass’s site, Jagdesh, is in Pakistan...\"\n\nSo, maybe Pakistan is not a good place to host an ATypI conference either then, hu?\n\nCheers!\n\n"
    }
  ]
}
