{
  "id": "4544",
  "title": "Minion Pro \\> MM \\> CoolType",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Just a quickie. What is a suitable titling   \ncompanion (12-13pt) to go with Minion   \nPro? At the mo I am using Minion's SC,   \nbut I reckon it isn't really suitable because   \nthe are used extensively through the   \npublication. Body is 9.5/12. Publication   \nis a private school's annual magazine.   \n   \nThanks! kris.\n\n",
  "author": "kris",
  "time": "Thu, 2004-04-29 18:56",
  "uid": "1519",
  "comments": [
    {
      "time": " Fri, 2004-04-30 01:38",
      "content": "kris   \n   \nDo you have the PS1 version of Minion? Adobe had a display version of the font that does not seem to be carried over to OT.   \n   \nMy, my, all these lost dreams and false promises.   \n   \nWhat the heck... List at large... Typographically speaking, are we better off now than we were in 1994?   \n   \nGerald\n\n"
    },
    {
      "time": " Fri, 2004-04-30 03:27",
      "content": "Gerald,   \n   \nYou're mistaken about the optical size thing. The OpenType version of Minion Pro comes as a set of four different optical size variants, including one labeled \"display.\" This covers all the characters in the font, not just caps as in the original \"titling\" release. Indeed, the main type page on Adobe.com right now has a prominent billboard for an article on optical size in Adobe type: see [http://www.adobe.com/type/topics/opticalsize.html](http://web.archive.org/web/20050516051213/http:/www.adobe.com/type/topics/opticalsize.html)   \n   \nThat being said, in this case the \"titling\" companion would be used for 12-13 point text. The display and titling faces were designed for sizes \\>24 point. One could possibly use the subhead face, at a slight stretch.   \n   \nHowever, regardless of what optical size of type is in use, that alone does not create visual contrast given that they are being used at reasonably appropriate sizes. So I'd also think about using a heavier weight, or perhaps italics, to create that contrast.   \n   \nOne could of course also change to another type family. Some sort of humanist sans or classic grotesque would go well with Minion.\n\n"
    },
    {
      "time": " Fri, 2004-04-30 09:41",
      "content": "\\> Typographically speaking, are we better off now than we were in 1994?   \n   \nI think most people are (certainly non-Latiners), but not all. The sacrifice of MM technology (due to many things but not least pure old greed on the part of Adobe's owners) will go down in typographic infamy.   \n   \nhhp\n\n"
    },
    {
      "time": " Fri, 2004-04-30 09:57",
      "content": "I'm sad about the loss of MM technology myself. But....   \n   \n\\> The sacrifice of MM technology (due to many things but not least pure old greed on the part of Adobe's owners)   \n   \nWhat nonsense.   \n   \nAdobe's \"owners\" are and were stockholders, who do not participate directly in corporate decision-making. The people primarily making this decision were at a low enough level that none of them had particularly large amounts of stock. The amounts of money involved in making this decision either way would not have been large enough to have a noticeable impact on Adobe's stock price (though many such decisions do add up).   \n   \nI suppose you can put it down to \"greed\" if by that you mean that the people deciding to phase out MM technology came to the conclusion that the costs of keeping it were very large (true), and that the folks who buy fonts didn't care much (true for the overwhelming majority of font customers).   \n   \nAlthough I personally wish I could do MM OpenType fonts, I know that I'm in a minority. Although many people miss MM technology sort of \"in principle\" it seems very few folks outside of Adobe ever released MM fonts.   \n   \nT\n\n"
    },
    {
      "time": " Fri, 2004-04-30 10:27",
      "content": "You're not seeing the big picture.   \n   \n\\> the costs of keeping it were very large   \n   \nOnly because of the greed factor. You can't pretend that the overall desires of the stock owners don't affect the decisions of every manager and every programmer there. An employee is accountable for satisfying the owners, period. This isn't kindergarten. You as an employee are given some room to wiggle, but only to keep you a sane employee - if you diverge too much, you're outta there.   \n   \nThe reason MM died is that it was only seen as worthwhile if it could make tons of money, fast. The benfits to the craft of typography are totally irrelevant to capitalism. Stock owners want that yaght, and they want it NOW. They don't have time to wait - they have to gather as many toys as possible before they die. Stock owners don't give a rat's-arse about typography.   \n   \nWhen a company becomes public there is no way it can maintain overall quality - it's a simple fact of human nature - even if it's an overall macro direction and not micro guidelines - the micro stuff comes from the macro, obviously. Chuck and Biff either had too much faith in capitalism, or not enough concern for typography. Just like the Google boys now: to objective, high-quality internet searching, I say: \"Yallabye. It was great to have you for a few years - it's all downhill from here.\"   \n   \nWhat MM should have been is a niche product, priced much higher: you'd sell less (but only slightly, since low-end users rarely bought it anyway), and wouldn't make tons of money, but people like Gerald would have been happy, and you'd be helping the craft (after benefiting so much from the craftsmanship of your predecessors) and getting a good rep too. But the owners of Adobe just want the cash, and lots of it, or they'll move their business to an oil-drilling company or something.   \n   \n\\> very few folks outside of Adobe ever released MM fonts.   \n   \nPartly because Adobe failed to muster software support. Because of... greed!   \n   \nDon't conveniently underestimate the size and depth of the blemish of abandoning MM on Adobe.   \n   \nhhp\n\n"
    },
    {
      "time": " Fri, 2004-04-30 18:52",
      "content": "I think I will retire from this discussion. Almost all of what you (Hrant) assert about why MM has died is simply untrue. You weren't there, and I am pretty sure none of your information comes from people who were; it's just your creative supposition about the reasons.   \n   \nFWIW, I don't disagree very much about the broad issues of publicly held companies. They need to satisfy their shareholders by making a profit. Luckily, Adobe's primary means of making profits is to try to make software that our customers want. But there's no question that with publicly held companies the profit motive is often orthogonal and sometimes opposed to quality.   \n   \nLater,   \n   \nT\n\n"
    },
    {
      "time": " Fri, 2004-04-30 21:14",
      "content": "I'm sorry that Thomas has dropped out here. I really didn't mean to spark a ruckus. I'd done some beta testing for Adobe in the 90s and had visited the folks in the type dept a couple of times. I thought they were quite earnest and had a great deal of vision. I suspect that Adobe itself probably saw the type as more a very good way of putting their corporate face out there and so tolerated what was most likely not a very lucrative venture.   \n   \nBut I have a naive question or two here about MM technology. Wouldn't it be useful in creating the various instances required for optical sizing in OT? I guess I am thinking that the software is actually being used for that purpose. Adding it to OT products, however, I assume, would probably present a nightmare of incapability?   \n   \nI remember there were problems with MM at first but these were resolved quite well. My comment about 1995 was made because I am still using this stuff for my work. Mainly for letterpress configuration of digital type.   \n   \nI realize it is not completely gone as FontLab has the ability to generate MM fonts or at least to create interpolated instances. But I have not yet tried it.   \n   \nGerald\n\n"
    },
    {
      "time": " Sat, 2004-05-01 08:50",
      "content": "While I have purchased and used many of the MM fonts from Adobe since they were first introduced by Mr. Warnock at Seybold, I, in retrospect, realize that I almost never used them to create instances of my own and simply used their numeric equivalent of font variations for bold, light, etc., much like Adrian Frutiger used his numbering system in Univers (55, 75, 57, etc.).   \nTheir was something relavent and fasinating about the concept of MM but I never seemed to get it to fulfill its potential so I just used MM fonts like other font families.   \nThere was also something funny about the optical corrections (or rather lack-there-of) when going from weight to weight. I don't know if this was due to the nature of MM or just that the font designers were just too new to it to make it work better. An example is Myriad as opposed to Frutiger, Whatever was needed to corect the forms from weight to weight was done perfectly in Frutiger but there is something seemingly left undone in Myriad. This may be just my 60-year-old eyes (although I was much younger at the time).   \nI am sorry we have chased off Mr. Phinney from this thread since he may be the only one among us who can help clarify this. I for one promise to keep the discussion centered on typography and not on the failings or merits of Capitalism. I would hope that Thomas might either reconsider his departure from this topic or that he might send me his thoughts on the matter directly.   \n   \nChris L\n\n"
    },
    {
      "time": " Sat, 2004-05-01 09:17",
      "content": "Thomas, you're right that my conclusions about the unfolding of the MM \"saga\" are not based on direct insider knowledge. But to me it _makes sense_ based on what I _have_ heard, and based on the wider context of how insidiously software usually gets developed these days\\* and how little people who are simply after money care about typography. Let's not compartmentalize reality - that's how we become livestock.   \n   \n\\* Like there's no decent reason SW upgrades become available ten time more frequently than just a few years ago.   \n   \nOn the other hand, I do have to admit there's another possibility: that the Adobe type people honestly believed that droves of people would buy into MM, and everybody would be happy, and they convinced the owners of Adobe to authorize the move. It just seems unlikely that the type people at Adobe had so little business sense.   \n   \nSo with what I _do_ know, I choose to believe that Adobe's type people were instead cornered between the reality of the font market and the blind greed of the company's oweners, and they simply took a long-shot gamble to make MM happen.   \n   \nAnd then there's MS: some people say that when MS and Adobe started colluding in the new OT format, MS insisted that MM had to go. Their typical users are even denser than Adobe's, after all.   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-05-01 09:44",
      "content": "\"And then there's MS: some people say that when MS and Adobe started colluding in the new OT format, MS insisted that MM had to go. Their typical users are even denser than Adobe's, after all.\"   \n   \nHrant   \n   \nI had heard this as well from an Adobe insider so I believe it to be true. The early propaganda on OT did include multiple axis capability as well as a number of other quite desirable typographic bells and whistles. Most of which are no longer on the prospectus.   \n   \nI would think that Microsoft's main concern was to make it work and make it acceptable and get it the hell out there on the market. So, it happened, and up until about a year ago, when I stopped dropping in on the OT list, there was still argument about standardization of the tables. I never really liked TrueType, and I like it less with its new name.   \n   \nGerald\n\n"
    },
    {
      "time": " Sat, 2004-05-01 10:19",
      "content": "\\> The early propaganda on OT did include multiple axis capability   \n   \nIn fact from what I remember a certain early version of InDesign had an OpenType Tekton with axes.   \n   \nBut even if MS was largely responsible for axing MM, Adobe still set the stage with misguided product placement and weak support.   \n   \n\\> I never really liked TrueType   \n   \n1) TT still has hinting far superior to PS. The creators of PS had too much faith in the [potential] intelligence of automatic rendering algorithms, while the TT boys simply cut to the chase and gave designers full control. Although I still think embedded bitmaps are generally better.   \n2) OT fonts can be PS as well.   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-05-01 11:10",
      "content": "Yes, I am rather short-tempered with Hrant. His past history of gratuitous insults is pretty long. Given that, his most recent insinuations about what it's \"convenient\" for me to believe (in this and another thread) seem to be starting down that same path. I am not terribly interested in getting into a \"pissing match\" which is what it might start to come to if I actually dealt with his nonsense. What he chooses to believe, even in the face of contradictory statements from people who were actually there, is up to him.   \n   \nHowever, there's no reason to punish the discussion for my aggravation with Hrant. Perhaps we can try to talk about the design and technology issues, and even the reasons for MM's demise, and keep things away from the personal attacks--and away from presentations of complete speculation as if they were facts.   \n   \nChris's comments about his usage of MMs are right on the money. We did a survey of end users, and we discovered that very few of the people who had MM fonts ever made custom instances with them. Multiple masters were a technology that were very little used by end users. We've already talked about the reasons, which were nothing to do with capitalism per se but everything to do with insufficient evangelism both internally and externally.   \n   \nThat lack of MM evangelism came from a simple lack of understanding that such evangelism would be necessary. Yes, the reality is the scenario that Hrant dismisses as \"unlikely.\"   \n   \nMicrosoft's role in the demise of MMs was relatively minor, although I think some of us misunderstood it briefly at the time. Adobe supports MMs via ATM. Microsoft doesn't support MMs at the system level. For MM support to continue indefinitely without Microsoft support, Adobe would have to keep on making ATM forever and update it for every OS version. That's assuming it would even be possible as MS continues to increase the security of the OS.   \n   \nOriginally OpenType did have MM capability built in (for PostScript flavored OpenType only). But it was clear that it would be a very hard sell. Like Apple's AAT, why would vendors who had ignored MMs for almost a decade suddenly change their mind because of this repackaging? Adobe would have had to evangelize both technologies simultaneously. This concern about diluting our focus, given limited resources, was a major part of the decision to discontinue MMs.   \n   \nI'm not sure exactly which of several things Gerald is referring to about arguments regarding standardization of OpenType tables. It's certainly true that any font technology that offers decent support for complex scripts will itself be a complex technology (at least in that area), and have to be very clearly documented. Sometimes things are not well written and the spec must be made more clear. Also, people debate the addition of new layout feature tags occasionally, but that's a natural thing with an extensible font format. In both areas OpenType has advantages over both Type 1 and old-fashioned TrueType.   \n   \nHrant is not really getting the current situation with hinting and font rendering very well. The truth is, as the rendering technologies get more sophisticated, the hinting is largely just getting in the way. That's why traditional superhinted TrueType fonts don't work well with ClearType. I had once thought that TrueType's advantage in hinting would vanish when screen resolutions got high enough, maybe around 2015 or 2020. Instead, the rendering technologies and LCD screens are eliminating this advantage much quicker than that. Maybe cell phones and other portable and home devices will give traditional TrueType superhinting a niche for a while. But I wouldn't want to bet on it.   \n   \nT\n\n"
    },
    {
      "time": " Sat, 2004-05-01 11:35",
      "content": "\\> we discovered that very few of the people who had MM fonts ever made custom instances with them.   \n   \nWell of course, Thomas.   \nDid you do any market research _before_ launching MM? Maybe it's good that you didn't, otherwise we wouldn't have even had that short & sweet period! :-/   \n   \nThis is exactly why I say that MM should have been a niche product with a high price tag.   \n   \n\\> insufficient evangelism   \n   \n(I'll try not to get into why you believe this.)   \nTo me this was not the main reason for MM's \"failure\". In the way Adobe as a company defined success (ie gobs of cash), MM was doomed to fail because this very same materialistic attitude is exactly what makes a technology that only has cultural value unsellable. Just look at how seldom people use true smallcaps! Designers who bundle smallcaps with their fonts are being financially inefficient. And trying to sell MM to _everybody_ was deluded.   \n   \n\\> it would be a very hard sell   \n   \nBut to whom, exactly?   \n   \n\\> as the rendering technologies get more sophisticated   \n   \nThe rendering technologies are not getting sophisticated _enough_\\*. At current typical resolutions subpixel rendering is still not good enough\\*\\*. The only way what you're saying could make sense is if you pretend people like extremely blurry type - noting that apparently they hated it a couple of years ago... Adobe's CoolType is a bad joke, an escape from the rigorous requirements of onscreen readabillity. Same with the _parody_ of text rendering in Mac OSX.   \n   \n\\* And they probably never will because, again, there's not enough money in type.   \n   \n\\*\\* Even many technophiles have a problem with it. Some people think it's too blurry, some people hate the colors - there are many reasons not to like ClearType.   \n   \nIt should be obvious that superhinting can benefit subpixel rendering as well.   \n   \n\\> I wouldn't want to bet on it.   \n   \nWhile I wouldn't want to bet on resolutions increasing a lot any time soon!   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-05-01 12:58",
      "content": "\\> In the way Adobe as a company defined success (ie gobs of cash)....   \n   \nYour saying this over and over again doesn't make it true.   \n   \nAs for rendering technologies, typical resolutions continue to increase.   \n   \nHrant, have you turned on \"CoolType\" (here meaning color device-dependent rendering) in Acrobat 6 and used it on an LCD screen? If not, you don't have any basis to comment on current CoolType rendering.   \n   \nIt's not at all obvious that superhinting can benefit sub-pixel rendering, at the resolutions we've got today. It seems likely that Microsoft would have done it if it was so worthwhile, no? Instead, they do radically \\*less\\* hinting for their ClearType technology. I wish I could go into detail about Adobe's research in sub-pixel rendering, but of course I can't.   \n   \nAs for screen resolutions, they have been steadily increasing for the last few years, and there are numerous technologies in development that threaten to increase screen resolutions a lot more. It is inevitable that they will go up; it's just a matter of how quickly.   \n   \nT\n\n"
    },
    {
      "time": " Sat, 2004-05-01 15:07",
      "content": "\\> Your saying this over and over again doesn't make it true.   \n   \nWhat's the point of being a stockholder if you don't expect an above-average return on investment?   \n   \n\\> It is inevitable that they will go up   \n   \nOf course. But while they remain insufficiently high to preclude the necessity of \"intelligent\" rendering (ie NOT CoolType) we must continue to do the work by hand, through superhinting or hand-made bitmaps.   \n   \nAnd don't ask me to post-rationalize MS: one year they push superhinting as the best thing since sliced bread, the next year they pretend it's unnecessary.   \n   \nThe reason for such flip-flops should be obvious: managers need to \"innovate\" to justify their jobs! Gradual, thoughtful improvement has no place in an \"I want my new yaght yesterday\" environment.   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-05-01 17:33",
      "content": "Certainly one aspect that hurt MM is instances named MyriadMM\\_640%234.   \nI prefer Myriad Bold Condensed (or did I just make Myriad Light Extended � I honestly can't remember which is which!).   \n   \nHrant, you are a character! I'm afraid I don't follow though. It sounds like a fundamental hang up with capitalism. I will admit that it is frustrating that economics have to guide the time we spend on certain projects. If only I could dump website design and focus on type full time. Perhaps Adobe could have marketed better, could have named the instances better, could have made the application MM interface better i dunno. It sounds like there were other considerations, but even if economics were the only one, I think it unfair to criticize a company for cutting rather than subsidizing, an uprofitable area of their business.   \n   \nThat aside, as far as I can tell MM isn't dead. It lives on for the people who need it, want it, in FontLab. Kinda sheds some new light on this quote:   \n   \n_I say that MM should have been a niche product with a high price tag._   \n   \nRandy\n\n"
    },
    {
      "time": " Sat, 2004-05-01 18:40",
      "content": "\\> It sounds like a fundamental hang up with capitalism.   \n   \nYeah. And I also have a \"hang-up\" with torture and rape. I'm funny that way.   \n   \nBut even the staunchest partisans of capitalism think there should be limits to how pure a state it's allowed to exist in\\*. And pragmatically, I'm personally saying that if you must engage in capitalism, one limit that should definitely be imposed is public ownership of companies. There's no way you can maintain the integrity of the product when the people ultimately deciding the company's course simply don't care about the product - they only care about the money the product can bring them.   \n   \n\\* For example, even in the extreme form of capitalism in the US, there's something called price gauging: the last time we had a big earthquake some guy went to jail for selling water at $10 a gallon. The thing is, I firmly believe that Target for example could have pulled something like that off - they'd just need to bribe the right politicians in advance. And the few who complain would get a classic fallback like \"hey, this is a democracy - just write a letter to your congressman!\"   \n   \nMM couldn't live because you're not allowed to lose money in capitalism, no matter how great the cultural benefits. Materialism is clearly anti-cultural.   \n   \n\\> MM isn't dead.   \n   \nMM is a subset of interpolation (which is much older than MM). It it the subset that is under the control of the user (with no knowledge of the mechanics of interpolation). It's not just a matter of money, but expertise and analytical talents. We have trouble getting people to use relatively simple methods of creating instances, you want them to get into FontLab?!   \n   \nSo -using a sensical definition of MM- it is indeed dead, or at best dying.   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-05-01 18:45",
      "content": "Certainly multiple masters as an end user technology are dying. Adobe's stopped selling 'em.   \n   \nHowever, as a font development tool, I expect multiple master style interpolation to stick around for a long time. Certainly it is heavily used at Adobe, in almost all our new font development.   \n   \nI see Hrant is still putting down CoolType without actually answering my challenge as to whether he's actually looked at its current incarnation: Use Acrobat 6, turn on \"CoolType (color DDR) which is off by default, and view on an LCD screen.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " Sat, 2004-05-01 20:45",
      "content": "How could I criticize something I've never seen? Do you think I'm blindly intent on discrediting Adobe? Never. I might even take such a suggestion as a personal insult. But I won't. I am however intent on discrediting bad design, but only if I see it in person.   \n   \nI installed the Acrobat 6 reader a while back (if only because I was given a document that required it), and it took me seconds to confirm something that only makes sense: it's extremely hard to write an algorithm that can match what a human can do in tight situations. Hard enough that nobody would spend the money trying. And in fact Adobe wasn't trying: like I've stated, CoolType is an escape.   \n   \nBut just in case anybody is thinking CoolType makes a big difference, here's a collage of screen grabs:   \n   \n ![uncool](http://web.archive.org/web/20050516051213im_/http:/www.typophile.com/forums/messages/30/34889.jpg)   \n   \nI chose something easy, mind you: DIN. In fact it was the second document I tried; the first one, in Electra, was much worse.   \n   \nI looked at three different zooms, which translate here to 14, 12 and 9 PPEM.   \n   \nAll three sizes have that annoying color friging typical of subpixel rendering.   \nSome people don't mind - although you'd need to do a lot of field testing to gauge the true effects.   \n   \nThe large size has some obvious alignment problems like the bar of the \"t\" - something the most retarded form of hinting would fix. And what should we think of that \"s\"?   \n   \nThe medium size is better overall, although the \"s\" is still cruddy, and the spacing (and form) of the \"r\" is faulty.   \n   \nThe smallest size is surprisingly the best in some ways (still a bad \"s\" though), but the subpixeling is ruining its contrast, firmness, and grayness.   \n   \nLastly, all three show a lousy rendering of diagonals, which are coming out too dark, ruining readability.   \n   \nIf you think hinting (super or even \"plain\") couldn't improve the rendering here, I'm simply speechless.   \n   \n--   \n   \nBTW, I won't get into why I think you have trouble seeing the fatal flaw with CoolType, lest you misconstrue the well-intentioned candor of an objective third-party as a personal attack.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-05-02 01:04",
      "content": "How could you criticize something you've never seen? Well, probably the same way you could assert as \"fact\" information that was pure supposition, for which you had no personal or even direct second-hand knowledge of.   \n   \nBut that aside, you did not say whether you were referring to CoolType the DLL, which includes grey-scale only rendering, or CoolType the color device-dependent rendering technology. I wanted to specify that the latter shows the current limits of what Adobe has done with on-screen text rendering. So I wanted to make sure we were talking about the same thing.   \n   \nSeveral things to keep in mind:   \n   \n1) Everyone should remember that this is only intended to be viewed on an LCD screen. Anyone who is viewing it on a CRT will not see the intended effect; there's a reason it's off by default. (Hrant \\*still\\* hasn't said whether he's viewing this on an LCD screen.)   \n   \n2) Don't assume your personal experience of subpixel rendering is typical. As the research shows (c.f. Kevin's presentation at ATypI), different individuals have different responses, and they very widely. I can't recall the exact percentages, but I think it was on the order of 5-10% of viewers who are ultra-sensitive to color fringing in subpixel rendering, but again sensitivity was widely distributed.   \n   \nAs for this particular case, there are definitely some problems with the larger size being rendered there, such as the bar of the t as you note. I too hate the s as well. However, without examining the font in a font editor, I can't say whether those problems are due to an error in CoolType, odd letterforms, or bad hinting.   \n   \nYou don't say whether these are TrueType or PostScript outlines, by the way.   \n   \nBut in any case, without picking apart the actual font to see what the hinting was like, I can't say whether better hinting could improve the rendering. However, I can say that in most cases when starting with well-made fonts, better hinting within the limits of current hinting technology won't help all that much in either ClearType or CoolType. Adobe could improve on the current auto-hinting tech for PostScript outlines, but not immensely (and yes, we have looked into it pretty carefully).   \n   \nIf what you mean to say is that \\*not\\* using a sub-pixel rendering technology, simply using hinting alone, will produce better results on an LCD screen, the available research pretty consistently contradicts that assertion.   \n   \nIf you want to critique subpixel rendering technology, it's also best to show the alternative. Care to show the old-style system rendering of those same ppem sizes of FF Din?   \n   \nFinally, in regards to your parting shot, Hrant, you attack lots of people without acknowledging it, so I'm not special in this regard. The funny part is you calling yourself \"objective.\" I'm sure that a poll on this or any other forum of people who know you reasonably well would generate numerous positive adjectives to describe you, but I'd bet a very nice dinner that \"objective\" would make few if anybody's lists of your personality traits.   \n   \nT\n\n"
    },
    {
      "time": " Sun, 2004-05-02 01:28",
      "content": "It also occurs to me that Hrant seems to think we could have wonderfully sub-pixel optimized bitmaps, or sub-pixel hinting.   \n   \nThis is very unlikely. The one thing that could be done is starting a stem at other than a pixel boundary, but still having it be a pixel thick, as long as it is at least one pixel away from the next nearest stem.   \n   \nAnything more than that, and you run into the fundamental complication of sub-pixel rendering: the three sub-pixels have different brightness values, and create different levels of color fringing. So you can't create a single bitmap (or superhinted outline that is operating at the subpixel level) that works well regardless of phase relative to the sub-pixel grid.   \n   \nThat's why you need to start relying on the rasterizer instead.   \n   \nThere are separate questions about what levels of color fringing are acceptable and what the goals of the rasterization strategy are. But hinting is a bit of a dead end once you get into sub-pixel rendering.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " Sun, 2004-05-02 10:46",
      "content": "This animosity is misplaced, and not mutual.   \n   \n--   \n   \nWell OF COURSE I was looked at an LCD screen! Are you insinuating that I'm dumb, or that I'm trying to trick people? Should I have a hissy-fit about that?   \n   \nBut as far as that screen-grab collage I've done that doesn't even matter:   \n1) Most of the faults I cited are unrelated to the type of screen being used - they're obvious anywhere.   \n2) The sample's viewers (and not me) have to use an LCD screen to decide.   \n   \nThe font I showed is a legit PostScript DIN: there's no reason to believe there's a problem with the font instead of concluding the much more obvious reality: that CoolType sucks. And if you persist, I'll have to put up grabs of the crash-and-burn Electra rendering...   \n   \nAnd of course I'm not saying subpixel rendering is a bad idea, what I'm saying is that it doesn't eliminate the need for human input, at least not for the forseeable future. Again: you can't get the money to finance the writing of an algorithm that can match a human in such tight conditions.   \n   \nYour thoughts on the limits on subpixel rendering are completely blind to the possibilities. I could make subpixel bitmaps by hand that would blow away this mediocre escapism. BTW, I'm not the only person who thinks this should have been called CrapType. Even some people who dislike me as a person and disagree with much of what I think have a serious problem with the backwards (or at best sideways) step that this constitutes.   \n   \nSome people are so obsessed with automation that it becomes the objective instead of the means.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-05-02 12:57",
      "content": "Hrant, my psychic powers are lacking. I asked, you didn't answer part of the question. So I asked it again. Unlike you, I don't go around constantly implying things without coming out and saying them.   \n   \nI already made the comment that people viewing the samples need to use an LCD screen. So you're just repeating what I said, only claiming it's somehow a disagremeent or insight. Re-read my post above your last one.   \n   \nIf you had looked at as many defective Type 1 fonts as I have, you would not assume that just because it's from a reasonably reputable manufacturer there's nothing wrong with it. I've seen a font from an reasonably major vendor with a 1000-unit em that had a blue zone of something like 30K units in size. I've seen a font from a major vendor that had been scaled, but the hints hadn't been scaled with the outlines.   \n   \nOdds are excellent that DIN has no such major problems. But I'm not going to leap to assumptions about the cause of the problem without sufficient data.   \n   \nYou continue to place words into my mouth, and imply things that I neither said nor believe. I never said that one couldn't devise new technologies that take even better advantage of subpixel rendering. Indeed, I'm quite certain one can, and am kicking around some ideas in this area at Adobe. Nor did I say that sub-pixel rendering eliminates the need for human input. I merely stated that current TrueType super-hinting technology is rendered largely superfluous and obsolete by any sub-pixel rendering technology. I never said that sub-pixel rendering eliminates the need for human hinting, and I do not believe it to be true (at least, not for TrueType; PostScript outlines have always been more susceptible to decent auto-hinting, though a human clean-up afterwards is ideal).   \n   \nI don't see that this conversation is really going anywhere. If anybody other than Hrant has questions or comments, I'm happy to chat with them. I won't be replying to any more of Hrant's baiting in this thread, though.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " Sun, 2004-05-02 18:48",
      "content": "Who is baiting whom? And who is avoiding the necessary conclusion (that CoolType is not good enough)? This truth is right there for everybody to see. \"I too hate the s as well\"?! What kind of thing to say is that? Don't make it sound like this is about personal preference. That \"s\" simply SUCKS. Just admit it. And it's not DIN's fault. ClearType does a better job. And it's _still_ not good enough.   \n   \nAlso, TT superhinting is not rendered superfluous at all - it's simply that nobody has used it to improve subpixel rendering yet. And it's not nice of you to keep spinning the PS-versus-TT war to your favor: the latter format allows more control, hence better results. TT is a superior format. Period. The war is over. Don't be like those Japanese soldiers hiding in trees three decades after the horse is dead.   \n   \nBut ignoring all the diversions and attacks, let me ask this:   \nExactly how does CoolType use the hinting information (PS and/or TT) in a font?   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-05-02 19:52",
      "content": "_Also, TT superhinting is not rendered superfluous at all - it's simply that nobody has used it to improve subpixel rendering yet._   \n   \nThis is not true. As discussed in another thread, MS were hinting outlines to fall on specific sub-pixel boundaries for the first version of ClearType. This gave them better control over stroke contrast within the limitations of the early CT renderer. In more recent versions, they have improved the colour filtering to provide _the same quality of contrast without needing to hint to specific boundaries._ The only point of superhinting with current and future releases of ClearType would be to modify glyph shape at specific sizes, i.e. to deliberately make the screen rendering lower fidelity to the type design. In the case of some designs, there may be a good argument for that, but why not just design better typefaces for screen?\n\n"
    },
    {
      "time": " Sun, 2004-05-02 19:53",
      "content": "Duplicate post.\n\n"
    },
    {
      "time": " Sun, 2004-05-02 20:08",
      "content": "\\> The only point of superhinting with current and future releases   \n\\> of ClearType would be to modify glyph shape at specific sizes   \n   \nWell, duh. That's the whole point of superhinting anyway, subpixels or no.   \n   \n\\> to deliberately make the screen rendering lower fidelity to the type design.   \n   \nLike I've said a million times, WYSIWYG is an illusion anyway. Really _any_ form of hinting is anti-fidelity, and you _need_ that to improve onscreen reading. Persisting in thinking that there's a magical way to make an outline font look good onscreen without substantial human \"skewing\" is an outcome of taking WYSIWYG too seriously.   \n   \n\\> why not just design better typefaces for screen?   \n   \nThat too.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-05-02 23:17",
      "content": "This is all rather moot anyway, since ClearType deliberately ignores x-direction delta hints, which means you can't really do 'superhinting' for CT. Ironically, the reason for this is that existing superhinted fonts originally intended for b/w rendering, e.g. the MS core and web fonts, render better in ClearType if the x-direction deltas are ignored.   \n   \nI'm still not convinced that there is any significant gain to be had in trying to superhint in the x-direction for ClearType. That is to say, I'm not sure that the desired results would be appreciably different from what you get without such hinting, presuming of course that you are starting with a typeface that is suitable to the medium. Some typefaces are unlikely ever to be very readable on screen, regardless of how good the renderer gets, how high monitor resolutions get, or how much work is put into superhinting them. Some typefaces are also crap on paper. What I like about ClearType, and what I would think would appeal to you Hrant, is that it throws readability back to type designers; screen readability used to be almost completely a technical issue, now it is a design issue.\n\n"
    },
    {
      "time": " Mon, 2004-05-03 09:26",
      "content": "\\> ClearType deliberately ignores x-direction delta hints   \n   \nEvery time you repeat that I have to repeat my end: yes, but it doesn't _have_ to.   \n   \nIt's not surprising that fonts superhinted for 1-bit would backfire in grayscale (since they're \"distorting\" the original for a different medium), but that doesn't mean superhinting is useless in grayscale. In fact VTT allows separate superhints for 1-bit and grayscale, which kick in as needed. A question: does FontLab support this?   \n   \n\\> I'm still not convinced that there is any significant gain to be had   \n   \nI guess we'd have to define \"significant\"... Much of what we do in type design is \"insignificant\" for the layman anyway, but hopefully we don't do it simply because it's fun for us.   \n   \n\\> it throws readability back to type designers   \n   \nDoes this mean you think hinting is not type design? I think this is only true if you look at it purely from the print/outline angle, instead of the screen angle. Come to think of it, hinting is a part of design whenever the PPEM is small, like 6 point text on a laser printer.   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2004-05-03 12:26",
      "content": "No, FontLab does not support device exceptions in hinting.   \n   \n_Does this mean you think hinting is not type design?_   \n   \nNo, that is not what I said. We were talking about text on screen, presumably at typical reading size, under a specific rendering technology. Regardless of whether one views hinting as design or not -- and I think the degree of design involved in hinting depends on the typeface and on the particular ppem size --, type on screen used, necessarily to rely on hinting as a largely separate process from the design of outlines. One could optimise the outline design process to make hinting easier, e.g. by wrapping outlines to pixels at specific sizes, but making readable type meant distorting the outline to achieve something that may or may not actually look like the typeface in question. My point is that ClearType, by increasing effective resolution while drastically improving contrast over greyscale rendering, reduces the need for distortion of outlines to present clear, readable forms on screen at a wide range of sizes. If less distortion is necessary, screen readability can be addressed in outline design in ways that were previously impossible.\n\n"
    },
    {
      "time": " Mon, 2004-05-03 13:04",
      "content": "\\> ClearType ... reduces the need for distortion of outlines   \n   \nI see what you mean. Yes, it does allow better results with less effort (and less \"technical\" effort). But it also seems to \"truncate\" the top end: for those willing and able to push to the max, it's (relatively) more limiting than before.   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2004-05-03 21:34",
      "content": "Well, there's still quite a lot of minute fiddling you can do in ClearType if you want. Clarifying my comment above re. x-direction hints (thank you, Ross):   \n   \nx-direction DELTAP's (those applied to points) are processed in CT (at least in the current version of the rasterizer). DELTAC's, which are those applied to cvt values, are ignored along with the other horizontal cvts.   \n   \nI'm still not at all sure that the potential benefit is worth the effort, i.e. that what you would want to achieve by delta'ing points in CT as much as one used to for b/w is significantly different from what you get without so much extra work.   \n   \nWhat's 'significant'? A statistically significant measurable impact on reading speed and comprehension.\n\n"
    },
    {
      "time": " Tue, 2004-05-04 03:36",
      "content": "Only if you can give me a good companion!   \nSheesh. Ask a simple question and whaddya get?   \n   \n: )\n\n"
    },
    {
      "time": " Tue, 2004-05-04 04:06",
      "content": "Righto. Attached is a .pdf with a sample   \nof a spread. Scala Sans is the greyed type,   \nMinion Pro for the rest. I am looking for   \nsomething that would replace the words   \n\"Godwin\" and \"Valete.\" Or confirmation   \nthat what I have is appropriate.   \n   \ncheers Stephen.   \n   \n<!--attachment: Minion-35068.pdf*mime_pdf.gif*application/pdf*45.3**Minion%2epdf -->\n\n<center>\n<br>\n<table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20050516051213im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20050516051213/http:/www.typophile.com/forums/messages/30/Minion-35068.pdf\" target=\"_blank\"><b>Minion.pdf</b></a> (45.3 k)</td></tr></table>\n</center><!--/attachment-->\n"
    },
    {
      "time": " Tue, 2004-05-04 04:36",
      "content": "Thanks mate! So do you reckon I sparked off   \na CoolType fire without needing to? Ha! I   \nreally must find out more about this CoolType   \nbusiness though...   \n   \nkris.\n\n"
    },
    {
      "time": " Tue, 2004-05-04 05:17",
      "content": "Very nice to see that spread Mr. Kris Sowersby.\n\n"
    },
    {
      "time": " Tue, 2004-05-04 05:26",
      "content": "Why thank you, sir! You should have seen   \nall the copy I have been given. About fifty   \ndifferent Word Documents, and all had some   \ndegree of \"creativity\" involved. An absolute   \nriot of styles, fonts, spaces, formatting,   \ntables and billions of tabs! Not to mention   \nexceptionally poor quality jpegs and images   \ntaken off the net, the worst having the �   \ninformation still embossed over it. It is quite   \nfunny when it happens to someone else :�/   \n   \nkris.\n\n"
    },
    {
      "time": " Tue, 2004-05-04 05:40",
      "content": "Oh! Thnx dude.   \nJust a curiosity,   \nhave you tried in Swift,   \nI find it gorgeous. ![AS8 timbro](http://web.archive.org/web/20050516051213im_/http:/www.typophile.com/forums/messages/30/35072.gif)\n\n"
    },
    {
      "time": " Tue, 2004-05-04 05:54",
      "content": "Mate, the day I get Swift will be   \na very good day indeed! I reckon   \nit is a swell typeface.\n\n"
    },
    {
      "time": " Tue, 2004-05-04 08:23",
      "content": "Kris, I agree it looks fine. If you are doing large titles, above 36 pt, a possible alternative is Poetica's small caps, which are a bit lighter and more varied, but from the same hand and similar in design to Minion.\n\n"
    },
    {
      "time": " Wed, 2004-05-05 02:02",
      "content": "May I be so bald. He he! How long have   \nyou been waiting to pull that one out! ;�)   \n   \nI don't have any of those, and can't afford   \nthem. I like the look of Mr Parkinson's   \nRichmond, though. mmm.\n\n"
    }
  ]
}
