{
  "id": "45474",
  "title": "Train sketches",
  "forum": "David Sudweeks's blog",
  "tags": [

  ],
  "content": "I've taken this idea and sketched on it for the last two months, mornings and evenings. Here's a look at some digitized work from today.\n\n ![](http://web.archive.org/web/20150312053222im_/http:/typophile.com/files/Olives_taste_sweet_5327.png)\n\n",
  "author": "David Sudweeks",
  "time": "18 May 2008 — 4:24pm",
  "uid": "18989",
  "comments": [
    {
      "time": "18 May 2008 — 4:57pm",
      "content": "What a novel take on blackletter David. Could the bowls be a bit tighter horizontally? And has the O the same axis as the l.c. letters. Give us some more letters in context please! I am curious as to how you will resolve the x now that I have seen the s. Do not get me wrong the s is identifiable. I think you are off to a good start.\n\nMichael\n\n"
    },
    {
      "time": "19 May 2008 — 6:19am",
      "content": "I like it a lot, too, though I would also like the bowls to be tighter. Is the baseline purposefully irregular (especially in the \"s\" and \"w,\" but it occurs throughout)?\n\n"
    },
    {
      "time": "19 May 2008 — 8:37am",
      "content": "[Your post has been promoted to Handpicked.]\n\n"
    },
    {
      "time": "19 May 2008 — 10:16am",
      "content": "I'm still working out a lot of the most basic aspects of this face. There's no uniform axis or scale yet so what you're seeing is more or less a compilation of ever-so-slightly homogenized individual sketched letterforms. In creating a 'romanized' blackletter I've deliberately kept myself from moving in the direction of narrow counters because I feel like that's one of the main reasons why blackletter appears so formal and non-conversational. (So rather than tighten the bowls much, I'm working on seeing the rest of the glyphs expand slightly to accommodate.)  \nThis experiment started with the simple idea that suspended masses imply lines; but through the course of it I've been taken by the beauty of blackletter and have begun moving this project toward a more accessible blackletter roman. It's produced some pretty fun caps as well; on their way.\n\n"
    },
    {
      "time": "19 May 2008 — 12:50pm",
      "content": "I agree that Blackletter can be a bear to read. Keep experimenting... in a load of text it will be very apparent that the the bowls are in fact too wide (to intimate the join). As to the axis you can straighten it up later; (but) I try early on to do this because you have to reshape things when you skew. I had my own battles, see P22 Sting. I still want to know what you do with the x. ; )\n\nMichael\n\n"
    },
    {
      "time": "19 May 2008 — 3:39pm",
      "content": "It seems a really good start point. Would love to see the x as well.\n\n"
    },
    {
      "time": "19 May 2008 — 8:02pm",
      "content": " ![](http://web.archive.org/web/20150312053222im_/http:/typophile.com/files/Olives_taste_sweet_coexistence_5921.png)\n\nx.  \nRough still. I think I like the idea of the caps and lowercase on slightly different axes. Lined up, the caps tend to blend in a bit much.\n\n"
    },
    {
      "time": "19 May 2008 — 9:08pm",
      "content": "David\n\nIn calligraphic works, to create a bounce all you have to do is bump the letters up and down a tiny bit. Overkill is easy. Subtle is hard but effective.\n\nWhen I have to squint to identify the bowl letters or the n then you have gone too far. You will, I am sure, come to this conclusion in time. But you do not see it yet. Even in Blackletter the space between the forms is roughly equivalent to the counter space! That is where the term \"picket fence\" texture comes from! Kerning is a combination of both letter AND interior shape spacing. Look at coexistence... The wide open disruptive spaces are in fact your counters. As far as the Axis of the caps... either go parallel or diametrically opposed, i.e. vertical. Don't \\*\\*\\*\\* foot around.\n\nIt is all about subtle subtle subtle. Not what is said but what is not said. You're on your own!\n\nThis has potential. by the way you pulled off the x, a bit wide but identifiable.\n\nMichael\n\n"
    },
    {
      "time": "19 May 2008 — 10:19pm",
      "content": "Michael. Thanks; I really appreciate your criticism, and I agree that I've gone too far. Beyond legible. _Then why are you doing it?_ Because it makes sense to me—for some reason. Maybe I just like the idea that this type slows people down and makes him or her look at every letter. And I think you're right; that I'll grow out of it.  \nThe Xs really were difficult. What's been more difficult has been symbols. # and + are all about this idea of piercing planes, which I've nearly illegalized in my visual language.\n\n"
    },
    {
      "time": "20 May 2008 — 4:10am",
      "content": "My apologies Miss Tiffany. That is still an acceptable word here in the South, it has no derogatory connotations at all.\n\nDavid  \nBy the way, I like the way you have altered the terminal angles. It is a fresh take. I hope you saw the praise as well as the \"criticism.\" Did not mean to sound harsh if I did. Neugebauer used to do blackletter with a pointed brush and if I am not mistaken the terminals were opposite.\n\nMichael\n\n"
    },
    {
      "time": "20 May 2008 — 7:44am",
      "content": "I use the word criticism in the strictly positive sense. Yes, the praise is evident, and no, I didn't sense a harsh tone to your remarks at all. Thank you.\n\n"
    },
    {
      "time": "20 May 2008 — 8:58am",
      "content": "I didn't realize how regional that phrase was either. I read it as equivalent to don't \"fool around\". Interesting.\n\nIt seems like there is a wellspring of interest in design that takes a little from stencils and a little from black letter, and a little from an industrial aesthetic, and perhaps a bit from unger/noordzij/dutch style.\n\nI confess, I have something like this under wraps too. But now I have seen 2 other projects similar to mine. It's great fun to be able to see the ways in which this ( and they ) flow in and out of these influences.\n\nI really like the effective tension you have going on.\n\n"
    },
    {
      "time": "20 May 2008 — 10:13am",
      "content": "I sent a private apology to Miss Tiffany this a.m. It means to lolligag. My post graduate daughter uses it to chide her med student boyfriend into action. Ain't it cool that my daughter is a control freak like her daddy. Sigh! And she was sheltered.\n\nAny way here is something similar I did as a spoof 20 years ago.\n\n ![](http://web.archive.org/web/20150312053222im_/http:/typophile.com/files/randr_6061.jpg)\n\nMichael\n\n"
    },
    {
      "time": "20 May 2008 — 11:27am",
      "content": "Hi All. No need to apologize. I understand that phrase as \"don't fool around\" too. We just have a filter set up to catch certain words.\n\n"
    },
    {
      "time": "20 May 2008 — 2:27pm",
      "content": "That is pretty tasty looking as well Michael.\n\nDavid - you could use the same axis but condense the caps the gap use is more consistent. Or not.\n\n"
    }
  ]
}
