{
  "id": "45498",
  "title": "Modena Light",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Greetings forum members,  \nI've been working on the font for years, but it is the light weight that has suffered particularly from this stop/start process. I can't remember how many times I've wished I'd written concise notes so that I could pick up from where I left off.\n\nAnyhow, I would sincerely appreciate your comments, both on the forms and the spacing, since both require some work.\n\nthanks,\n\nMiles  \n [www.newlyn.com](http://web.archive.org/web/20150423151022/http:/www.newlyn.com/ \"www.newlyn.com\")\n\n| Attachment | Size |\n| --- | --- |\n| [Type specimen.pdf](http://web.archive.org/web/20150423151022/http:/typophile.com/files/Type%20specimen.pdf) | 121.64 KB |\n\n",
  "author": "miles",
  "time": "19 May 2008 — 9:45am",
  "uid": "967",
  "comments": [
    {
      "time": "19 May 2008 — 11:51am",
      "content": "This is really nice, Miles. Very current and versatile. It strikes me as a follower of Unger's sanses (though less modulated) and that's a good thing.\n\n- On your 'Kk' the thin connection of the diagonals to the vertical is a little awkward. I feel it should be heavier or not touch at all.\n\n- I think the 'y' tail is a little too long.\n\n- 'r' is excellent\n\n- The char set showing is missing an 'H'\n\n- A few of your mathematical symbols are too heavy (≤≥±)\n\n"
    },
    {
      "time": "20 May 2008 — 12:26pm",
      "content": "I'm pleased to see this. I think your Modena Condensed is outstanding, and in fact when choosing a mobile phone recently, the type design was the deciding factor...strange criterion I admit!  \nI've no expertise in these matters but it's instructive to try :\\>  \nI think the left sidebearing on the n, and/or u is slightly too wide. Or is it the right side on the a?  \nThere is something about the bowl on the a that doesn't quite flow...looks too wide or perhaps just needs a slightly different shoulder?  \nI agree about the y tail, perhaps the curve needs to start higher, like on the g?  \nThe curly brackets on p.5 need more breathing space.  \nThe idiaresis and odiaresis dots are low flying, and something funny with the contours of the question mark dot makes it disappear on small sizes (double contour?)  \nI love Q, R, S and the numbers.\n\n"
    },
    {
      "time": "20 May 2008 — 12:26pm",
      "content": "cheers Stephen, the Kk waists had troubled me too, I'll take a second look at those.  \nI remember looking at Foundry Form, which was released in the early stages of Modena's development.  \nCan't remember seeing any of Unger's types at the time, I must check them out.\n\n"
    },
    {
      "time": "20 May 2008 — 4:02pm",
      "content": "See [Vesta](http://web.archive.org/web/20150423151022/http:/www.gerardunger.com/fontstore/store-vesta.html).\n\n"
    },
    {
      "time": "22 May 2008 — 7:04am",
      "content": "I've updated the pdf, thanks for your comments.\n\n"
    },
    {
      "time": "22 May 2008 — 7:48am",
      "content": "I'd like to know what you think about the new K and k.\n\n"
    },
    {
      "time": "22 May 2008 — 9:35am",
      "content": "I understand why Stephen suggested pulling the legs away from the body on the Kk. But I, personally, don't like separation if I have to use in display work. I actually preferred the last version. But, they are working better for smaller size use. I wonder if the bottom bowl of the B and the bottom of the C aren't sticking out a hair too much? I really think this strikes a good balance in between something conservative like Myriad and more daring like Klavika.\n\n"
    },
    {
      "time": "22 May 2008 — 10:17am",
      "content": "Total novice at font criticism so take with a grain of salt:\n\nMy eye wants the second hump of the m to spring from a spot a bit lower.\n\nThe strokes really stick to the baseline/x-height line (e, c, r, a for example), which really keep it moving horizontally as you read (kind of like the old theory about how serifs speed reading by setting up \"tracks\").\n\n\"rv\" in \"observance\" (no easy pairing) becomes one glyph to me.\n\nI might try lowering the i's dot a touch to see how it looks.\n\n"
    },
    {
      "time": "22 May 2008 — 11:01am",
      "content": "I'm with Craig on the dot's being lowered, and your ligatures for fi and fl aren't really ligatures.\n\nThe overall color of the glyphs seems very light for a regular weight. I'd also like to see the ascenders for b,d,f,h,k,l shorted to the height of the t; there doesn't seem to be much difference between the Cap height and the lowercase ascender height.\n\nI'd love to see what the italics and old style figures will look like, and the bold weights too! I agree with Stephen, this is a very current. Parts of it remind me of [Klavika](http://web.archive.org/web/20150423151022/http:/www.processtypefoundry.com/typefaces/klavika/index.html).\n\n"
    },
    {
      "time": "22 May 2008 — 11:18am",
      "content": "Ligatures do not need to be necessarily touching or combined. I would pull the hook back a bit from the i and l though.\n\n"
    },
    {
      "time": "22 May 2008 — 11:29am",
      "content": "Yeah, but that seems like a crap-out ligature. Couldn't he just make a kerning par and be done with it, instead of making a separate glyph?\n\n"
    },
    {
      "time": "22 May 2008 — 2:37pm",
      "content": "The new a has a really good shape now. You might want to adjust the ae too.\n\nI definitely prefer the disconnected K and k. Somehow that seems more contemporary. For stability, the lower leg could move out two or three units I think.\n\nI think the dots on i and j are right to line up with the cap height, but that gap does look wide. Perhaps the cap height could be dropped ever so slightly to accommodate the i and j? I don't think it should go anywhere near the t height.\n\nTop of G could extend to two-thirds width of lower vertical stroke rather than halfway?\n\n"
    },
    {
      "time": "22 May 2008 — 3:09pm",
      "content": "Why a crap out? I think that is a little strong. Some typefaces do not needing, nor warrant, connected ligatures, but do need some slight modification to the f and or i to make a good pair.\n\n"
    },
    {
      "time": "23 May 2008 — 4:42am",
      "content": "okay, maybe it's not a crap out, but I like ligatures that flow together. When they don't, it's just seems like really tight kerning and you can do that with kerning pairs.\n\n"
    },
    {
      "time": "23 May 2008 — 8:27am",
      "content": "I agree with Tiffany, the ligatures don't need to connect in a modern sans face. The f and i are not interfering and look right without needing special attention.\n\n"
    },
    {
      "time": "23 May 2008 — 8:32am",
      "content": "I've dropped the dots on the i and j. Also lightened some of the punctuation, the quotes marks in particular.  \nAlso shortened the bottom bowl of the B and the lower hook of the C. extended the top arm of the G. All excellent suggestions, Thanks Miss Tiffany, Bendy and everyone, I really apppreciate them.\n\n"
    },
    {
      "time": "23 May 2008 — 10:15am",
      "content": "Just a humble opinion of a not-typedesigner.  \nThe \"M\" stands out a bit. Maybe offer an alternative \"M\" which is a bit more calm, static, something with straight lines on both sides (sorry i don't know the typographic term).\n\nPS I really like what i see!\n\n"
    },
    {
      "time": "23 May 2008 — 10:34am",
      "content": "The multiplication sign looks darker than the other math symbols. The equals sign (not on page 1, btw) looks to me like it needs more space between the lines.\n\n"
    },
    {
      "time": "23 May 2008 — 10:55am",
      "content": "If the M needs to be narrower, try bringing the middle off the baseline so the slant can stay the same. I suspect it's the upper counter that looks too big, compared to the lower counters. That said, it's probably a nice idea to include alternates.\n\n& looks small, perhaps because next to fi/fl, may be ok with lowercase but what about with caps?  \n× (multiply) looks dark next to +, but not sure how it looks between numbers.  \nµ may need work, I don't know much about its normal construction, perhaps somebody better qualified can comment.\n\nMiles, how did this font start out? What were your objectives or motivations? I'm interested to hear what a new font is based on.\n\n"
    },
    {
      "time": "23 May 2008 — 11:29pm",
      "content": "Daniele Arnaldi  \nHi everybody,  \nmiles, good typeface indeed; small adjustments here and there, but that's how it works :-)  \nA small question, expecially to Tiffany; why do you say that a ligature in modern typeface doesn't necessarily need to be connected?  \nI definitely prefer a link between the two letters, and besides, \"legatura\" in italian still means something really roped. But that's only my opinion... ;-)  \ncheers\n\n"
    },
    {
      "time": "24 May 2008 — 3:49am",
      "content": "It seems to me that there's a few people who see ligatures as stylistic novelties, rather than a solution spacing problems caused by the clashing of metal in times past, or the clashing of form in times present.\n\nSome forms clash: Garamonds, with their pronounced overhang, ball terminalled designs. ligatures solve these awkward situations.\n\nSome don't - if they don't then there's no need to design a ligature, removing the dot or shortening the f terminal may suffice. In some cases the f, i, and l sit together without issue.\n\n"
    },
    {
      "time": "16 Jun 2008 — 6:07am",
      "content": "I've added the Italic companion to the light on the pdf.  \nI have also narrowed the M a little on the Roman.\n\n"
    },
    {
      "time": "20 Jun 2008 — 3:40am",
      "content": "For me, the italic has an unexpected but interesting quality.  \nBecause the design has so few angles besides the horizontal and the 'slant' angle, this latter angle is uninterupted/very dynamic over a paragraph, and so more obvious than I'd expected.\n\nGiven this, is the slant angle too great?\n\n"
    },
    {
      "time": "20 Jun 2008 — 5:40am",
      "content": "I think it might be.\n\n"
    },
    {
      "time": "8 Jul 2008 — 1:21am",
      "content": "Since you have Š and Ž also include Č and some other eastern European language letters to make it more marketable.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "20 Aug 2008 — 6:08pm",
      "content": "Very attractive letters. I like the openness of the counters and how you terminate letters like the 'S' and 'C' with horizontal strokes—I'm attempting to bring similar elements into my own face. I think I came across another weight, or an earlier version of this, several months ago. I don't think I commented then because all I had to offer was unspecified praise. Now that I can put my finger on what strikes my fancy, I'll offer up my thoughts.\n\nMy eye is drawn to the contrasting forms on the terminals—how the interior is flat while the exterior is curved. I think this works best on the 'a', 'e', and '1'. The question mark is particularly attractive, as are the guillemettes and ampersand. It really gets under my skin when typefaces have weak, awkward, or otherwise bothersome punctuation (See: the question mark on Futura Medium).\n\nThere are a few places where the modulation of the stroke weight bothers me, particularly the 'r'. The fact that the arm of the 'r' is flat all the way across the bottom, which I absolutely love, makes the stroke noticeably thin where it joins the vertical stroke. Oddly enough, I first thought this was because the stroke of the arm was too heavy—making the joint look weak in comparison. It wasn't until I zoomed in closer that I realized that the joint was the problem and not the arm's weight. Also, the modulation on the Q feels a touch extreme. I could see tapering the tail more to give some room for the bowl to maintain a little more weight.\n\nQuite delicious all-in-all.\n\n"
    },
    {
      "time": "24 Aug 2008 — 11:21am",
      "content": "Miles, this seems like the long-awaited maturation of this highly  \ncontemporary style that's been brewing for a few years - good going!\n\nI haven't read all of the feedback from others in this thread, so I might be repeating things (or ignoring changes already made) but here is some feedback:\n\nI like the narrowness of the font - it seems essential in making this style sing.\n\nI would make the descenders a bit shorter.\n\nThe bowl of the \"a\" seems to need a little bit more modulation, to harmonize more with that funky characteristic thickening in this design (like at the top of the \"a\" itself).\n\nThe lefthand side of the bar of the \"f\" is sticking out a bit too much I think.\n\nTry your hand at a bi \"g\"?\n\nAs others seem to have opined, the tittle of the \"i\"/\"j\" isn't there yet. Often it's useful to align it with the top of the \"t\"; so in this case I might either raise the dot even higher\\* (aligning its bottom with the top of the \"t\", and its top with the full ascenders), or I might center the dot at the height of the \"t\" (in which case you could align its top with the caps, which is useful).\n\n\\* In fact such a -hopefully sufficiently gentle- idiosyncrasy might become the \"signature\" of this font.\n\nThe \"k\" might be fine, but it might be a bit narrow, and it might also need a hair more flair, like making the arms uneven somehow. Like Tiffany I'm ambivalent about separation in a \"k\", but I actually think it's usually better in display than text!\n\nThe \"r\" and \"s\" rule.\n\nThe bottom terminal of the \"y\" is a bit unconvincing (although there might not be much room for change; note that shortening the descenders would give more room).\n\nI would stagger the arms of the \"x\", even if it doesn't really need it optically - it would give the glyph more flavor, instead of looking like a math symbol.\n\nThe top join of the \"ae\" needs to be modulated lighter.\n\nThe ampersand is very nice, except for the top-right arm, which seems too straight and/or long.\n\nThe width and height of the caps is right on.\n\nI'd make the \"D\" slightly wider.\n\nWould the \"E\" look better with a shorter middle bar?\n\nThe bar in the \"G\" is distracting close-but-not-aligned with the bars of the \"E\", \"H\" etc. Since raising it might be too much, I'd probably lower it.\n\nThat wide \"J\" will give you trouble, especially in some parts of Eastern Europe...\n\nThe cap \"K\" seems OK as it is, even the separation.\n\nThe \"M\" is super.\n\nIf you keep the slight trapping in the \"N\" some other glyphs will need it too of course.\n\nThe \"Q\" is exceptional - although the tail is just a bit too heavy I think.\n\nThe curve of the \"U\" seems a bit light.\n\nThe \"X\" seems fine as is in the caps.\n\nThe vertical of the \"AE\" seems unsually thin.\n\nI would put small nicks at the top and bottom joins of the \"OE\". I've always liked that, and it's becoming more acceptable lately (especially in a sans).\n\nAlso: I like the cedilla; the tilde seems out of character; the eszet is too wide; the cap Thorn could have a larger bowl towards the bottom; the numerals are mostly nice, except the \"5\" is slightly narrow and the \"2\" need some sort of fix; the Pound could benefit from a shorter top; the Yen isn't happy - I'd lower the bar; can you make the Section not lean to the right?\n\nIs the Italic mechanical? If so that might be a good start, but the one thing that bothers me is the slant: way too much. I think contemporary fonts look much nicer with a gentle slant (although that does require the Italic to be pulled away from the Roman more in other ways).\n\nSpacing: since this a light font it will typically be used large, so the spacing probably needs to be a bit tighter.\n\nOverall very tantalizing - good luck finish it soon!\n\nhhp\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:17am",
      "content": "Thanks so much Jason & Hrant, but too late, the typeface is finished. I'm sure the design would have benefited from attention to the points you've raised, but I'm not going back to it now.\n\n"
    },
    {
      "time": "27 Aug 2008 — 7:49am",
      "content": "Sorry.  \nWell, if it was for a client, you could always charge them for an upgrade! :-)\n\nhhp\n\n"
    },
    {
      "time": "30 Sep 2008 — 4:49am",
      "content": "I've updated the pdf in the original post. It now shows the family.\n\n[www.newlyn.com](http://web.archive.org/web/20150423151022/http:/www.newlyn.com/ \"www.newlyn.com\")\n\n"
    }
  ]
}
