{
  "id": "45506",
  "title": "Old-style Figures",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Why do most Scotch Roman typefaces not have old-style figures? I've noticed that Miller has semi-OSF characters, like a cross-breed with normal lining figures (most noticeable in 7 and 9); whereas Mercury and Chronicle from H&FJ do not have OSF's. Freight, on the other hand, which strikes me as fairly Scotch in its design, DOES have them. Can anyone elucidate this for me? Is it a 19th-century thing? I want to use Mercury for an identity project which would involve not just a logo but a type system that can be used in-house for publications. I find it odd that such an extensive and well-drawn family doesn't have OSF.\n\nAlso, if anyone can suggest a good Scotch Roman that DOES have OSF, that would be wonderful. Thank you!\n\n",
  "author": "Matt Steel",
  "time": "19 May 2008 — 12:35pm",
  "uid": "30118",
  "comments": [
    {
      "time": "19 May 2008 — 1:10pm",
      "content": "More of a \"Fleischmann\" than a Scotch, but [Farnham](http://web.archive.org/web/20131014042749/http:/www.fontshop.com/fonts/downloads/font_bureau/farnham_text/) has text figures as default and [Arnhem](http://web.archive.org/web/20131014042749/http:/www.fontshop.com/fonts/singles/ourtype/arnhem_normal_ot/?acs_ss=2) does as well.\n\n"
    },
    {
      "time": "19 May 2008 — 1:13pm",
      "content": "It's a historical thing. When the scotch roman style was coming into play, oldstyle figures were no longer in vogue. Most of the original scotch romans didn't have them (or had hybrid figures instead), so most revivals or interpretations of the genre tend not to have them either.\n\nIt's not like there's a biblical law that says \"thou shalt not put oldstyle figures in a scotch roman\" or anything, it just wasn't common, historically.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "19 May 2008 — 1:21pm",
      "content": "What about Dwiggins' New Caledonia ?\n\n"
    },
    {
      "time": "19 May 2008 — 1:25pm",
      "content": "IIRC The original metal cut Caledonia did not have old style figures.\n\n"
    },
    {
      "time": "19 May 2008 — 2:58pm",
      "content": "Hi Stephen! I'm also known as gramme from NT/QBN, so thanks for the help as always. I really like both of those faces. Farnham might be more reasonable for the clients' budget.\n\nThis is for a Presbyterian church, so something Scotch Roman (or close to it) seems most appropriate to me.\n\nThomas, thanks for the help as well, that totally makes sense. I might petition H&FJ to add an alternate set for Mercury!\n\nCheers,  \nM@\n\n"
    },
    {
      "time": "20 May 2008 — 4:56am",
      "content": "Tiffany's quite right: the original release of Caledonia in 1939 did not include oldstyle figures. The Linotype supplement from 1948 still does not offer any oldstyle figures for the text sizes of Caledonia.\n\nOddly, however, it does show oldstyle figures as an alternate available for Caledonia Bold in sizes 1636. The Bold was originally produced on commission for headlines in a NY tabloid newspaper called <cite>P M</cite>. So perhaps the OsFs were part of the commission.\n\nBy 1962, in the tribute to WAD published by the original Typophiles, oldstyle figures appear in the showing for Caledonia.\n\nSo, there were OsF in metal eventually, but not until well after the original release.\n\n-- K.\n\n"
    }
  ]
}
