{
  "id": "45516",
  "title": "Super family with slab-serif and regular sans styles",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m sure they exist, but I’m blanking on their names.\n\nCheers, Si\n\n [‹ Please criticize this frontispiece of me](http://web.archive.org/web/20081011160932/http:/typophile.com/node/45570 \"Go to previous forum topic\") [Posters ›](http://web.archive.org/web/20081011160932/http:/typophile.com/node/45533 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011160932/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 19.May.2008 5.49pm",
      "content": "[Officina](http://web.archive.org/web/20081011160932/http:/www.myfonts.com/search?search%5Btext%5D=officina)  \n [TheSerif](http://web.archive.org/) and [TheSans](http://web.archive.org/web/20081011160932/http:/www.fontshop.com/search/?q=thesans)  \n [Vista Sans](http://web.archive.org/web/20081011160932/http:/www.emigre.com/EF.php?fid=200) and [Vista Slab](http://web.archive.org/web/20081011160932/http:/www.emigre.com/EF.php?fid=209)\n\n"
    },
    {
      "time": " 19.May.2008 6.37pm",
      "content": "Thanks I should have got Thesis at least, doh!\n\n"
    },
    {
      "time": " 19.May.2008 6.39pm",
      "content": "Not sure if this qualifies as a super family...  \n [Morgan Sans, Morgan Avec, Morgan Poster](http://web.archive.org/web/20081011160932/http:/www.vllg.com/Feliciano/Morgan/mudTyper+Weights/)\n\n"
    },
    {
      "time": " 19.May.2008 6.41pm",
      "content": "Another that fits the slab and sans bill, but maybe not the super...  \n [Stag Sans](http://web.archive.org/web/20081011160932/http:/www.vllg.com/Schwartzco/StagSans/mudTyper+Weights/)  \n [Stag](http://web.archive.org/web/20081011160932/http:/www.vllg.com/Schwartzco/Stag/mudTyper+Weights/)\n\n"
    },
    {
      "time": " 19.May.2008 11.39pm",
      "content": "[Panoptica](http://web.archive.org/web/20081011160932/http:/www.shinntype.com/panoptica.html)\n\n"
    },
    {
      "time": " 20.May.2008 12.38am",
      "content": "\\>Another that fits the slab and sans bill, but maybe not the super..\n\nFP Dancer Sans, FP Dancer Serif.  \n [http://www.fontshop.com/search/?q=FP+Dancer&x=16&y=13](http://web.archive.org/web/20081011160932/http:/www.fontshop.com/search/?q=FP+Dancer&x=16&y=13 \"http://www.fontshop.com/search/?q=FP+Dancer&x=16&y=13\")\n\n"
    },
    {
      "time": " 20.May.2008 2.02am",
      "content": "Not available in digital, AFAIK, but Nebiolo’s Forma and Linea can be considered a slab/sans superfamily combo.\n\n"
    },
    {
      "time": " 20.May.2008 2.56am",
      "content": "[Stainless](http://web.archive.org/web/20081011160932/http:/fontbureau.com/fonts/Stainless) + [Dispatch](http://web.archive.org/web/20081011160932/http:/fontbureau.com/fonts/Dispatch)  \n [United](http://web.archive.org/web/20081011160932/http:/www.houseind.com/index.php?page=showfont&id=531)  \n [The Guardian types](http://web.archive.org/web/20081011160932/http:/www.christianschwartz.com/guardian.shtml)  \n [FF Absara](http://web.archive.org/web/20081011160932/http:/www.fontshop.com/search/?q=absara&x=0&y=0)  \n [Soho](http://web.archive.org/web/20081011160932/http:/www.fonts.com/FindFonts/RecentReleases/2007/Soho.htm)\n\n"
    },
    {
      "time": " 20.May.2008 3.01am",
      "content": "[Prelo](http://web.archive.org/web/20081011160932/http:/www.typetrust.com/)  \n [Prelo Condensed](http://web.archive.org/web/20081011160932/http:/www.typetrust.com/)  \n [Prelo Slab](http://web.archive.org/web/20081011160932/http:/www.typetrust.com/)\n\n"
    },
    {
      "time": " 20.May.2008 3.09am",
      "content": "[FF Zine](http://web.archive.org/web/20081011160932/http:/www.fontshop.com/search/?q=zine)  \n [PTL Manual](http://web.archive.org/web/20081011160932/http:/www.primetype.com/faces_info.php?fid=2)  \n [Generis](http://web.archive.org/web/20081011160932/http:/www.linotype.com/184271/generis-clan.html) (though the Slab has no italics)  \n [Sansa & Sansa Slab](http://web.archive.org/web/20081011160932/http:/www.fontshop.com/search/?num=100&q=sansa&x=31&y=8)  \n [Parry & Parry Grotesque](http://web.archive.org/web/20081011160932/http:/www.fontshop.com/fonts/downloads/ourtype/parry_grotesque_professional_ot/) (rather a Clarendon?)  \n [Auto](http://web.archive.org/web/20081011160932/http:/www.underware.nl/site2/index.php?id1=auto&id2=overview) and [Chaparral](http://web.archive.org/web/20081011160932/http:/www.myfonts.com/fonts/adobe/chaparral/)?\n\nI guess [Lucida](http://web.archive.org/web/20081011160932/http:/www.myfonts.com/search?search%5Btext%5D=lucida&PREFS_TRIM=1&PREFS_SET%5Bipp%5D=96) _always_ kinda fits the bill. ;-)\n\n"
    },
    {
      "time": " 20.May.2008 4.53am",
      "content": "[Nexus](http://web.archive.org/web/20081011160932/http:/www.fontshop.com/search/?q=nexus&x=0&y=0)\n\n"
    },
    {
      "time": " 20.May.2008 5.20am",
      "content": "[Aptifer](http://web.archive.org/web/20081011160932/http:/www.linotype.com/137226/aptifersans-family.html).\n\n"
    },
    {
      "time": " 20.May.2008 10.26am",
      "content": "Thanks everyone!\n\nCheers, Si\n\n"
    },
    {
      "time": " 22.May.2008 6.21am",
      "content": "Would not Meta now be considered a super family?\n\n"
    },
    {
      "time": " 22.May.2008 12.26pm",
      "content": "This super-family thing, is, however, a hopeless and silly notion, isn’t it?\n\nCheers!\n\n"
    },
    {
      "time": " 22.May.2008 2.24pm",
      "content": "\\>Would not Meta now be considered a super family?\n\nAsk Erik...\n\n ![](http://web.archive.org/web/20081011160932im_/http:/typophile.com/files/S_4776.jpg)\n\n"
    },
    {
      "time": " 22.May.2008 2.32pm",
      "content": "David: a hopeless and silly notion because it is predicated on a theory rather than real typographic need (I am Guessing)?\n\n-e.\n\n"
    },
    {
      "time": " 22.May.2008 3.03pm",
      "content": "Related - [http://typophile.com/node/45614](http://web.archive.org/web/20081011160932/http:/typophile.com/node/45614 \"http://typophile.com/node/45614\")\n\n"
    },
    {
      "time": " 22.May.2008 3.15pm",
      "content": "What about [Productus](http://web.archive.org/web/20081011160932/http:/www.fontbureau.com/fonts/Productus) and [Proforma](http://web.archive.org/web/20081011160932/http:/www.fontbureau.com/fonts/Proforma) from Font Bureau? And the entire Poynter series too?\n\n"
    },
    {
      "time": " 22.May.2008 6.15pm",
      "content": "I don’t think Apex Serif and Apex New have been mentioned yet—from Village.\n\n"
    },
    {
      "time": " 23.May.2008 4.41am",
      "content": "Miss Tiffany, thanks for sure: Poynter is the name of a sponsor, and ties the series together for a particular document type, so it’s not named with all the same intentions of most super families. (It does share the shopping advantages of a single name). And the other example, it’s Petr’s nickname, “Pro”, so, that’ more of a super designer issue. In addition to which, “super” in style is not nearly as important, to most clients, as super in offering high quality and fidelity over a wide variety of documents, technologies, and often languages.\n\nTake a look from another angle — 99.99999% of the “compatible” families in the world are not “super”. So choosing a compatible set by name (or designer for that matter), is something not entirely different from most likely incorrectly coloring-by-number. Because, is using a matched serif and sans at the same sizes over a range of matched sizes effective, “optically”, without multiple masters? There’s more design complexity along that line as well. So maybe not silly, but, it has gotten that way with at least one super family I know, and I see a much more creative world in “the mixing” than anything that uses this kind of matching.\n\nAnd yet, another way of looking at it, historically, how old is the need to match fonts? Very. And how old is the super-family concept? Not so old. So this is, perhaps, an important shopping issue for what is a relatively new class of purchaser, the less experienced designing user. But I don’t think, in general, the best long term solution to this shopping issue is in the font name, though I’m not saying that you think so.\n\nCheers!\n\n"
    },
    {
      "time": " 23.May.2008 10.04am",
      "content": "To understand: “super” implies, to you, as a family of serif and sans derived from the same structure? And Poynter is only named for a client, but not named for the genes? Not like, say, Meta Sans and Meta Serif or the latest Frutiger [Sans] and Frutiger Serif.\n\nI think you’re right in that it is new for people to develop sans and serif from the same genes. And perhaps it is for a new kind of designer. But, I don’t think it is only for them. If a type designer has an idea to design a serif and a sans from the same gene pool why does it have to be somehow wrong or bad? Why does it have to make the graphic designer lazy for wanting them and using them? True, part of the fun of being a designer is finding those unexpected font combinations that work. I love it when I find a few seemingly incompatible fonts and get them to work together. But, on the other hand, and as I’ve stated on another thread just yesterday, typeface selection is only a small part of the designer’s battle. Even if a designer chooses to use a super family it doesn’t mean the design will be successful. They still have to wrestle those fonts into a another structure using column width, white space, point size, color, etc. The battle could still be lost even with a super family on their team.\n\n"
    },
    {
      "time": " 23.May.2008 10.51am",
      "content": " **Scala** is a super duper hyper family. It also has the slab serifs and regular sans that you need.  \n [Scala in FontShop](http://web.archive.org/web/20081011160932/http:/www.fontshop.com/search/?q=scala&x=0&y=0)\n\n"
    },
    {
      "time": " 23.May.2008 12.13pm",
      "content": "I think that there is something to the idea that the page is richer for having made a good match of distinctive faces. Otherwise this wouldn’t be the norm in magazines.\n\nBut that richness isn’t always called for or even helpful. Sometimes a simplicity is what you want and in those cases I thing a super family could be just the thing.\n\nBut I have heard and at this point agree with the people who have said that sometimes a super family is a solution without a problem having been made along too theoretical a line, and as such isn’t a good fit for much. Sorry I can’t recall who it was that said this. So perhaps it’s not a question of the SuperF per se, that can be less than ideal, so much as the process/thinking that went into it making it. Which, when I think about it seems like the old old story when it comes to type.\n\n"
    },
    {
      "time": " 24.May.2008 3.27am",
      "content": "“If a type designer has an idea to design a serif and a sans from the same gene pool why does it have to be somehow wrong or bad?”\n\nOoooopp. I didn’t say, nor mean to imply, “wrong” or “bad” of a font designed by the same jeans, or with the same genes. Nor did I say anyone who uses one is lazy or stupid. I want to be clear that I think super families are a great way for some to shop, but not for most to design. When I have time, I will make proof.\n\nIn the mean time, show me a page designed with a super family, that you really think is great, and I mean awardable.\n\nCheers!\n\n"
    },
    {
      "time": " 24.May.2008 4.12pm",
      "content": "_In the mean time, show me a page designed with a super family, that you really think is great, and I mean awardable._\n\nI was just thinking that. Apart from the Design/Writing/Reseach book that uses the Scala & Sans family well, I have never really seen any of the other super families used together. It’s usually part of it used with something entirely different. Perhaps the reason folks like to buy super families like Meta/Meta Serif is that the same (desired) design qualities are present in the sans and the serif, making it useful for a variety of applications. Also, purchasing the old super family together is generally cheaper than purchasing separately. Who knows!\n\nBesides the issue of super families is the ever-expanding ’single’ typeface, with a million weights and widths, like [Titling Gothic FB](http://web.archive.org/web/20081011160932/http:/www.fontbureau.com/fonts/TitlingGothicFB) or [Moderno.](http://web.archive.org/web/20081011160932/http:/www.fontbureau.com/fonts/serif/ModernoFB/styles) I suppose MM or Superpolator makes this easy, but is it desirable? Do your customers dig this sort of thing, David?\n\n—K\n\n"
    },
    {
      "time": " 24.May.2008 4.44pm",
      "content": "_In the mean time, show me a page designed with a super family, that you really think is great, and I mean awardable._\n\nThe Guardian.\n\n—K\n\n"
    },
    {
      "time": " 24.May.2008 4.54pm",
      "content": "A propo Kris’s observation, it is interesting that both the slab and sans of Scala and of the Guardian typefaces were designed at the same time to work with each other. I don’t think that’s true of most of the others.\n\n"
    },
    {
      "time": " 25.May.2008 4.06am",
      "content": "“The Guardian.”  \nExcellent. Now compare and contrast that publication, from begginning to end, with your average Joseph or Josephine sliding your average super family into their average shopping cart and using it for “whatever”, if they could.\n\n“Do your customers dig this sort of thing, David?”  \nDo customers dig having a dense array of styles of a single family to choose from? Absolutely. In fact, if I were a user needing fonts, knowing what I know about use, I would go for a double density array of a single family (for display), before a super family. Then, I’d buy something compatible that contained grades, for text.\n\nThis is not to say that there is no common use to be made of super families by the common user. I still think they are great for some purposes.\n\nCheers!\n\n"
    },
    {
      "time": " 25.May.2008 6.21am",
      "content": "When you say <cite>some purposes.</cite> What do you mean?\n\nWhen I think of places that an all super family approach makes sense I think of utility: way-finding, technical manuals, complex maps, and anything where a sense of flavor, entertainment or deliberate identity is dropped in favor of consistency to make the look itself a bit more self effacing. The same kind of urge that might have had a user reaching for a “standard” or very familiar font, but with an awareness that in some contexts the right weights do matter.\n\nIs that the kind of thing you mean?\n\n"
    },
    {
      "time": " 25.May.2008 4.32pm",
      "content": "It’s a question of harmony and contrast.  \nIf a super family just means tacking serifs onto a sans, then there may not be enough contrast.  \nBut it’s possible to create a “super family” where sans and serif have a more useful opposition, although I prefer to call it a “suite”.\n\n"
    },
    {
      "time": " 25.May.2008 5.12pm",
      "content": "We often see questions on Typophile along the lines of “Which Sans goes well with this Serif face?” It happens often enough to make me think there are folks out there who would benefit from either a well done super family or just pairings from the same designer that were marketed together as suited to eachother. The trick is to figure out what “suited to eachother” is all about. Sometimes, it means well contrasted rather than quite similar. The content should provide the clues for making the correct decision.\n\nChrisL\n\n"
    }
  ]
}
