{
  "id": "4551",
  "title": "Tecnolec logo development",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,   \n   \nI'm currently developping a logo for an association that gathers and   \nchannels information about new technologies and techniques to their   \naffiliated electricians.   \n   \nI started with the typography (the fun part) as the rhythm of the name   \nwas very inviting (I'll be adding an image or symbol to it later on}.   \nOne of the versions is a customized typeface, and I have three levels   \nof customization. I think I know which one to use, but am curious what   \nyou guys think of it.   \n   \n ![type treatment](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/messages/29/34772.gif)   \n   \nPS: I wouldn't be me if I didn't add: \"Extra points for who can guess which typeface!\" ![](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/clipart/bigsmile.gif)\n\n",
  "author": "Bald Condensed",
  "time": "30 Apr 2004 — 6:59am",
  "uid": "110",
  "comments": [
    {
      "time": "30 Apr 2004 — 9:26am",
      "content": "I love ligation, but you might have a problem with that \"no\" standing out - negative vibes.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Apr 2004 — 9:41am",
      "content": "I am enjoyng the 1st logo design. Perhaps joining most of the ligatures. All except the \"O\".   \n   \nBecause of the weight caused by the joins, the C, N, O and L would look best closer as suggested by Florian.   \n   \nThe idea of flow through the logo would be of great benefit.   \n   \ntake care\n\n"
    },
    {
      "time": "30 Apr 2004 — 9:52am",
      "content": "I like the direction of the first one also. Tighten the c-n, n-o, o-l, l-e. This is pretty strong stand alone type\n\n"
    },
    {
      "time": "30 Apr 2004 — 12:36pm",
      "content": "Ligate the topmost (left) serif on the N with a reverse taper to the C. Extend the serifs on the bottom of the N and the top of the L to 'frame' the O. Perhaps tighten up a bit, but not much\n\n"
    },
    {
      "time": "1 May 2004 — 5:53pm",
      "content": "Here's a quick comp of what I'd previously posted for clarity. I also included a modified part of the 'nol' as a marque/logo as you had mentioned.   \n   \n ![quick comp](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/messages/29/34882.gif)\n\n"
    },
    {
      "time": "3 May 2004 — 7:54am",
      "content": "Make the 'e' narrower.   \nThe ligatures give too much emphasis to the width difference between 'e' and 'c'.\n\n"
    },
    {
      "time": "3 May 2004 — 8:29am",
      "content": "You might try making the serif on the n not slab but angled (beginning lower), or have the serif slab but lower than the arch of the n. I don't know if either will work, but you might be able to discover a lighter link for the cn ligature by starting along these lines.\n\n"
    },
    {
      "time": "3 May 2004 — 10:39am",
      "content": "Yves, I like that face thing.   \n   \nhhp\n\n"
    },
    {
      "time": "3 May 2004 — 10:48am",
      "content": "Of the last three you posted I like the friggin' first iteration. That \"c-n\" lig seems to maintain the character of the logotype the best. The second iteration creates too long of a horizontal on the top edge of the lig, and the third iteration just doesn't make the cut. IMO.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "3 May 2004 — 11:32am",
      "content": "I like the standalone, and I agree with Scott that the first one is best. Maybe alter (sharpen, round?) the lower terminal on the C to play nicely with the ligature on top.\n\n"
    },
    {
      "time": "3 May 2004 — 7:07pm",
      "content": "hmmmm... but the first one looks like an open \"o\" to me. The sugestion posted by Chase looks best for my eyes, althought it will need more work.   \n   \ng\n\n"
    },
    {
      "time": "4 May 2004 — 11:21am",
      "content": "To my eye, only 2 & 4 look like eyes - 1 & 3 look like letter Rs   \n   \nI think 4 works best   \n   \ns\n\n"
    },
    {
      "time": "4 May 2004 — 2:46pm",
      "content": "I like option 4, and I don't think non-Typophiles will see an apostrophe as readily as we are.\n\n"
    },
    {
      "time": "30 Apr 2004 — 9:08am",
      "content": "Well the typeface is ChollaSlabBold. ;)   \n   \nThere's something nice about the idea of \"melding\", \"joining\" and \"fusing\" in regards to electricians. And the fact that they \"channel\" the information is along similar lines. Electrician weld and solder. When we pass or share information we become joined together. I can see this happening in your ligs. Maybe it would be a little too tricky (?) but I would be curious if you could \"solder\" all the letter together.\n\n"
    },
    {
      "time": "30 Apr 2004 — 2:58pm",
      "content": "Kewl, interesting suggestions. My idea was to go with   \nthe top design too. I'll tighten up the whole thing and   \nsee what it looks like.   \n   \n_\\> Ligate the topmost (left) serif on the N with a reverse   \ntaper to the C._      \nHeh, we've got a mindreader in our midst. I felt like   \ndoing that but hesitated because I feared it would harm   \nthe readability of the word. I think I will have a go at it.   \n   \n_\\> I love ligation, but you might have a problem with   \nthat \"no\" standing out - negative vibes._      \nIt's a bitch innit? That's why I started out with extending   \nthe tail on the \"n\", not only to achieve a symmetrical flip   \neffect but also to counter that problem. Maybe connecting   \nthe \"c\" with the \"n\" might de-emphasize that. Also keep in   \nmind this is for a non-English speaking target audience.   \n   \n_\\> This is pretty strong stand alone type_\n\n"
    },
    {
      "time": "3 May 2004 — 5:52am",
      "content": "I think you've got some major readability issues with that option,   \nChase.   \n   \nHere's the tightened logo, but the \"cn\" ligature is causing me   \nmajor headaches. I find the ligature you're suggesting is too   \nbusy BTW Chase.   \n   \n ![tecnolec_type2](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/messages/29/34979.gif)\n\n"
    },
    {
      "time": "3 May 2004 — 6:31am",
      "content": "Toying with the standalone graphic this is what I've come up with   \nas a possible add-on to the above.   \n   \n ![](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/messages/29/34982.gif)   \n   \nI guess it speaks for itself.\n\n"
    },
    {
      "time": "3 May 2004 — 8:16am",
      "content": "Well-spotted Eduardo, THX. ![:-)](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nNow if somebody can suggest which friggin' \"cn\" ligature to use,   \nI'll be completely satisfied...\n\n"
    },
    {
      "time": "3 May 2004 — 1:10pm",
      "content": "i also like the first. the \"melding\" of the letters follows that of the others, looks more authentic.   \n   \nwhat if ... for the stand alone ... they melded somehow?\n\n"
    },
    {
      "time": "4 May 2004 — 2:58am",
      "content": "Almost there. I wanna thank everyone for their insights, as this   \nhas helped me get the job done in about half the time (usually   \nI let each intermediary stage of a logo rest for a while to be able   \nto evaluate it with a fresh eye).   \n   \nI slightly narrowed the \"e\"s and tightened up the \"cn\" ligature.   \nLast thing to decide on is which stand-alone sign to present to   \nthe client (I'll save the other three as a back-up in case said   \nclient is not completely satisfied). Nr. 2 is a quite literal lift from   \nthe word mark, nrs. 1 and 3 are \"melded\" as per Tiff's suggestion   \nand nr. 4 is the most instantly recognizable. Whaddayathink?   \n   \n ![](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/messages/29/35064.gif)\n\n"
    },
    {
      "time": "4 May 2004 — 9:07am",
      "content": "Option 1 & 3 remind me of the logotype. Option 2 doesn't seem finessed or finished enough to be paired with the logotype. Option 4 is a little too typographic, but I'll admit this could be because all I see is an apostrophe.   \n   \n:D\n\n"
    },
    {
      "time": "25 Jun 2004 — 6:57am",
      "content": "Sometimes I wonder why I go through all the trouble. This   \nis what they selected. Thanks everyone for the input! ![:-)](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n ![](http://web.archive.org/web/20131020045539im_/http:/www.typophile.com/forums/messages/29/39205.jpg)\n\n"
    },
    {
      "time": "30 Apr 2004 — 9:08am",
      "content": "Well... the concept is interesting. The idea of \"gathering\" is suggested by the ligatures - that's nice. Personally I would reduce the distance between the letters, to keep the word more compact and the ligatures not so exaggerated.   \n   \nI would apply this suggestion to the 1st variant.   \n   \nKobe.\n\n"
    }
  ]
}
