{
  "id": "4553",
  "title": "Transitions from metal to digital",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Thomas,   \n   \nKerning on a Monotype Keyboard is a \"unit subtraction function\" which tells the mould to open up less when casting type. This causes the type to be under cut, or rather, under cast. Kerning metrics are completely an \"operator\" decision, nothing \"factory predetermined\", nothing included in \"font information\". I am not speaking of the italic lowercase y, j, or f etc. which \"is\" part of font metrics. In fact, genuine keyboard kerning procedure were a discovery, not an intended engineering feature. Although later included in the manuals. It is a myth that Monotype had specific hot metal kerning font metrics.   \n   \nI might add, there was a secondary method of kerning which required manual insertion. That method is the same but takes less skill and more labour.   \n   \n\"SPACING\" was \"variable\" unlike hand set types which has fixed units. For instance hand set type used quads, en quads, three to the em, four to the em five to the em, six then on to hair spaces, 1pt, 1/2 point, some shops such as ours cut papers for 1/4 point spacing. Monotypes were far finer.   \n   \nSpacing goes between the words to justify lines of type independent of specific font metrics although part of operator considerations. If you are seeing, as you say certain \"advance widths popping up\" they are a digital error. If in hot metal, they are an operator error, no fault of the system.   \n   \nNow I do not wish to give you a headache but there is a thing called \"fixed\" and \"variable\" spacing. Sometimes you would use one, sometime you would use the other and at others, good operators may choose to use both. This system should be included in modern day page layout procedures. If you call me I will give you an understanding of its advantages.   \n   \nLanston never had a photocomp system. Monotype England did. The keyboards were the same, the output device had negatives replacing the brass matrices. The system otherwise was based on the hot metal system.   \n   \nIf you are seeing something as you say you do it may be the following. As I remember Monotype England sold digital laser printers and systems to the newspaper industry. What you may be seeing is the evils of \"early digital technology\". And John and others are blaming it on \"hot metal technology\".   \n   \nI wish to avoid falsehoods getting foisted upon the unknowingly by pretenders.   \n   \nFurthermore I am not stupid, or \"commercially evil\" as one member has indicated. I know you and Adobe often suffer from similar abuse.   \n   \nBut before I go I must thank you for the opportunity to clarify matters about the Monotype System.\n\n",
  "author": "gerald_giampa",
  "time": "8 May 2004 — 1:45am",
  "uid": "2094",
  "comments": [
    {
      "time": "8 May 2004 — 9:36am",
      "content": "_But letterspacing \"requires individual attention\". Sorry that is just a fact. To presume the professional is incapable of fine tuning his or her display matter is rather more than a little arrogant._   \n   \nBut I _never_ -- not even once -- suggested that professionals were incapable of or should be prevented from fine tuning spacing. I value the precision of manual kerning options in professional page layout software very highly, and if I were handsetting metal type I'd probably be one of the guys getting in there with the file and the hair spacing. But the majority of text that is going to be set today is not being handled by professional typographers. As a maker of fonts, I see it as my contribution to ensure that as much of that text as possible looks decent and is readable. Since I can't rely on the average 'typesetter' to kern it well, I have to make sure that the factory kerning is as good as it can be.\n\n"
    },
    {
      "time": "8 May 2004 — 9:58am",
      "content": "Thomas wrote:   \n   \n_What we really want to do is make optically even spacing by roughly equalizing the total amount of space between letters. If you stick an envelope on a shape like \"O\" and you stick two O's together, they end up a little too far apart (at least in my experiments)._   \n   \nThat's not my experience. The edge of envelope closest to the horizontal extremes of the O would be the same distance as a typical straight sidebearing on the same letter, so why should the envelope space two Os any further apart than sidebearings?   \n   \nThe illustration below shows the relationship of outline and spacing envelope, and also the relationship of the latter to typical rectangle sidebearings for the same letter. There would be no difference between spacing two Os with sidebearings or with the envelope; the difference would be when you put O next to K,V,W,X,Y. Such combinations would need kerning in the sidebearing model, but not in the envelope model because it would conform to their shape and allow them to nestle closer to the O.   \n   \n ![Spacing envelope for O](http://web.archive.org/web/20131019042431im_/http:/www.typophile.com/forums/messages/30/35428.gif)   \n   \n[The terminology is awkward, because we're falsely distinguishing the sidebearing approach from the envelope approach; sidebearings define an envelope: a rectangular envelope. Laurence used the term 'spacing outline' for what I am calling the envelope; something like this might be better, because the envelope does not necessarily envelope the letter shape: if it produces good spacing, parts of the letter can extend beyond the envelope (the example I used above was the outer tips of the serifs on the v).]\n\n"
    },
    {
      "time": "8 May 2004 — 10:17am",
      "content": "Gerald L wrote, in response to my comment that 'fine typography can look after itself':   \n   \n_Not without the tools to do so. As much as I'd like to agree with the rationale of your argument I do believe that Gerald has a very strong point here._   \n   \nThis is perverse. I'm the one talking about the need to make fonts with good quality basic spacing _and_ with smallcaps, ligatures and other tools of textual articulation. Gerald G is the one saying that fonts for 'fine typography' don't need any kerning, because the fine typographer is obviously going to do all the spacing himself. Gerald G's definition of fine typography seems to be 'that which is made by fine typographers'. On this we basically agree, and my point is that fine typographers are going to do fine typography, one way or another, while everyone else is going to do the typography that you give them the tools to do, and most of the time the tools are going to remain on the 'factory settings'. Hence, if you care about anything other than what fine typographers get up to, those factory settings are important. Since I've only met a handful of fine typographers in my life, and many thousands of 'font users', I'm not inclined to trust that the majority of type is going to be finely set.\n\n"
    },
    {
      "time": "8 May 2004 — 10:50am",
      "content": "Righto. So the envelope approach is better than I was giving it credit for. I agree that it is superior, though it is still not perfect.   \n   \nSadly, I think my comment about not being able to make the paradigm shift very easily due to the entrenched legacy (of apps, OSes, and fonts) is still true.   \n   \nT\n\n"
    },
    {
      "time": "8 May 2004 — 11:55am",
      "content": "FYI, John:   \nCalamus fonts on the Atari ST used an \"envelope\" approach to sidebearings. A stair-step arrangement of, I think, six bars per side could be adjusted around the glyph.   \n   \nAlways seemed like a good idea to me, until I tried to get it to work...then it seem just as hard as any other means of spacing.\n\n"
    },
    {
      "time": "8 May 2004 — 1:09pm",
      "content": "Gerald Lange,   \n   \n_\"'Fine typography' can look after itself: it always has; that's what makes it fine.\"   \n   \nJohn   \n   \nNot without the tools to do so. As much as I'd like to agree with the rationale of your argument I do believe that Gerald has a very strong point here.   \n   \nLet's take Lanston as an example. Gerald didn't have to provide the typographic extras he gave us when he began digitizing the Lanston library. While I was swayed over to digital by Adobe's efforts (Expert fonts), it was the considered work of folks like Giampa (if I may) that were to show the way. This was when Emigre reigned supreme for god's sake and David Carson had just discovered that his own drops of blood on a page could be considered typography.   \n   \nHad not professional typographers got involved with digital type, and forced the way..._   \n     \n   \nThank you Gerald L, not all are so gracious.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "8 May 2004 — 2:40pm",
      "content": "John,   \n   \n_Since I've only met a handful of fine typographers in my life, and many thousands of 'font users', I'm not inclined to trust that the majority of type is going to be finely set._   \n   \nHow can I respond to this John, there are thousands of fine typographers? In fact you can not be, in my opinion, \"a typographer\", unless you are fine. Fine is the \"underpinnings\" of the definition.   \n   \nFurthermore if you treat your retail font buyers with such disdain I suggest they shop at a font manufacturer that does not trivialize their skills. _\"cows come home\"_\n\n"
    },
    {
      "time": "8 May 2004 — 2:42pm",
      "content": "_Had not professional typographers got involved with digital type, and forced the way..._   \n   \nYes, but again my point is that they did get involved, and their involvement isn't any kind of surprise. This is precisely what I mean by fine typography looking after itself or, less abstractly, fine typographers looking after fine typography. Gerald didn't wait for someone else to start making digital fonts the way he wanted them: he started making them himself. There is a DIY culture in fine printing that is very admirable, whether it is rebuilding presses from spare parts, machining new parts to repare casters, or hacking digital font layouts to include ligatures. Fine typographers generally need less help than the majority of font users.\n\n"
    },
    {
      "time": "8 May 2004 — 4:03pm",
      "content": "John,   \n   \n_Fine typographers generally need less help than the majority of font users._   \n   \nGenerally, but not always, that is why I have offered you my constructive criticism.   \n   \nThat, by the way, is a compliment.\n\n"
    },
    {
      "time": "11 May 2004 — 12:28pm",
      "content": "\\> Digital type/offset printing tends, as I see   \n\\> it, to accentuate contrast whereas the slight   \n\\> thickening of letterpress tended to reduce it.   \n   \nBut only for a given font. Meaning that you can design a font differently to get a (nearly) identical end-result in different media.   \n   \n----   \n   \n\\> we are still essentially treating type as   \n\\> sequences of rectangles, rather than as   \n\\> sequences of letterforms.   \n   \nEven better would be to treat them as sets (not sequences) of _boumas_.   \n   \n\\> We talk solemnly about how the design of white   \n\\> space between and within letters is as important   \n\\> as the design of the letters themselves, but we   \n\\> continue to   \n   \nRight on.   \nAnd to me the worst is people who don't even realize they're failing.   \n   \n\\> This is what I mean by 'envelope'   \n   \nThat's in effect the Kindersley approach.   \nBTW, there's no reason to do this manually.   \n   \n----   \n   \n\\> I hear this word softness of letterpress.   \n\\> Letterpress is the opposite.   \n   \nIncorrect.   \n1) I'm talking about the subvisible level. A finely printed letterpress piece would not be described as \"soft\" by a layman, but if you put it next to a good piece of offset work and ask \"Which is sharper?\" you get a vote for offsett 95% of the time.   \n2) Of course we don't read with a loupe, but the height of the frequency appreciated by the consciousness is inversely proportional to the immersion of a given act of reading; meaning that just because you can't point to details while reading doesn't mean they have no effect. Otherwise we wouldn't need any more revivals of Goudy fonts for example. (Maybe that's a contradictory example. ;-)   \n   \n\\> What was missing? Nothing important.   \n   \nThat's pure crap. The limitations of linotype were so serious that they had to rape the Arabic script to get it to work. And not suprisingly -since a script is a script- this sort of thing applies to Latin too. For example the fact that metal kerns could break off (causing expense) caused some people to make them more modest, or avoid them altogether.   \n   \n\\> Metal has been part of humanity for a long time.   \n   \nNot compared to wood it hasn't. So let's use wood instead. Or maybe bone.   \n   \n\\> Hrant feels calligraphers are inferior.   \n   \nPure distortion - although certainly a useful coping mechanism...   \n   \n\\> are they planning to make all type   \n\\> just one size in this new technology?   \n   \nWhat about you?   \n   \n--   \n   \nGerald, it strikes me that your main problem is that you're not separating fonts from their use, specifically by third-parties. Maybe because you are such a fine printer yourself, and you can use your own fonts to great effect - but as a rule a font isn't used by its creator (at least not for like 4 centuries now). Without this separation you can't think about this properly.   \n   \n----   \n   \n\\> please ignore Hrant's lies.   \n   \nYou seem like such a frustrated little boy.   \nIt would be useful if you apologized.   \n   \nhhp\n\n"
    },
    {
      "time": "11 May 2004 — 1:37pm",
      "content": "_That's in effect the Kindersley approach._   \n   \nThe idea of spacing envelopes that relate directly to the shape of the letter is not at all similar to Kindersley's approach. Kindersley's approach is based on identifying the optical centre of the letter and aligning to it the mathematical centre of what is still a rectangle. The sides esablished by Kindersley's method, as applied by him, are parallel, vertical sides. I'm not sure whether locating the optical centre is of practical use in defining a spacing envelope, but I suspect not. The purpose of a spacing envelope is to define the minimum distance between any given point on the outline and the nearest part of an adjacent glyph. This requires a different kind of analysis from that used by Kindersley to identify the optical centre and measure from it a fixed amount to a vertical sidebearing.\n\n"
    },
    {
      "time": "11 May 2004 — 2:27pm",
      "content": "Hrant,   \n   \n_That's pure crap. The limitations of linotype were so serious that they had to rape the Arabic script to get it to work._   \n   \n**Question:** Was the purpose of the invention of Linotype or Monotype to optimize the setting of Arabic?   \n   \n**ANSWER:** Not to my recollection.   \n   \nWhy didn't the Arabic users invent their own system? It was their problem.   \n   \n**Next point requires the entire statement.**   \n   \n_That's pure crap. The limitations of linotype were so serious that they had to rape the Arabic script to get it to work. And not suprisingly -since a script is a script- this sort of thing applies to Latin too. For example the fact that metal kerns could break off (causing expense) caused some people to make them more modest, or avoid them altogether._  \n   \n(1.) I was under the impression you thought Linotype could not kern?   \n   \n(2.) Kerning with a Linotype was possible, Jim Rimmer has corrected you several times, Kent Lew can confirm. In any event, they would \"not\" break off\n\n"
    },
    {
      "time": "11 May 2004 — 2:36pm",
      "content": "Hrant,   \n   \n_\\> Metal has been part of humanity for a long time.   \n   \nNot compared to wood it hasn't. So let's use wood instead. Or maybe bone._   \n      \n   \nI was just speaking of metal. You are speaking of type, but sure, wood is cool, but\n\n"
    },
    {
      "time": "11 May 2004 — 2:49pm",
      "content": "\\> Remember what I told you about wisdom?   \n   \nI generally remember anything notable, but I'm drawing a blank here...   \n   \nGerald, historical revisionism (not to mention jingoism) never cuts it with me.   \n   \nhhp\n\n"
    },
    {
      "time": "11 May 2004 — 3:38pm",
      "content": "Hrant,   \n   \n_Gerald, it strikes me that your main problem is that you're not separating fonts from their use, specifically by third-parties. Maybe because you are such a fine printer yourself, and you can use your own fonts to great effect - but as a rule a font isn't used by its creator (at least not for like 4 centuries now). Without this separation you can't think about this properly._  \n   \nThank you for the encore, however I must correct you. I designed two fonts, Bodoni 26 [http://lanstontype.com/Bodoni26.html](http://web.archive.org/web/20131019042431/http:/lanstontype.com/Bodoni26.html) and Water Garden Fleurons. [http://lanstontype.com/WaterGardenMulti.html](http://web.archive.org/web/20131019042431/http:/lanstontype.com/WaterGardenMulti.html)   \n   \nBoth Bodoni 26 and Water Garden Fleurons are digital, not hot metal. That aside, I have rarely used Bodoni 26, others have, and I must say, some of it is remarkable. Water Garden Fleurons, on the other hand, I have used to great advantage. But then again, I am   \n [http://lanstontype.com/GiampaIntroduction.html](http://web.archive.org/web/20131019042431/http:/lanstontype.com/GiampaIntroduction.html) \"The Fleuron Master\".   \n   \nSo in fact, I can think about this _\"more\"_ correctly. As, I can, think about it\n\n"
    },
    {
      "time": "11 May 2004 — 4:04pm",
      "content": "Hrant,   \n   \nJim Rimmer writes:   \n_About the \"bad\" fitting of Linotype: it was one of the best ways of getting type set quickly and economically in acommercial world, and refinement mats were made to overcome all of the problem pairs. The refinement matrices had to be placed in the assembler by the operator by hand, and if was not done it was simply for lack of caring or for lack of the special refinement mats._   \n   \nHrant writes:   \n_Gerald, historical revisionism (not to mention jingoism) never cuts it with me._   \n   \nWhat are you having trouble understanding?\n\n"
    },
    {
      "time": "11 May 2004 — 4:53pm",
      "content": "\\> I designed two fonts   \n   \nWow - impressive. :-/   \nI designed two fonts when I was 13, and they were more notable that your two. Big deal.   \n   \nAnyway, that's totally moot. Eric Gill designed a number of nice fonts, without doing the spacing; he got the Monotype works boys to do that. But we know that there is no Black without White (there's some _useful_ Zen for you), so was he really a type designers? I happen to think so, but only because of his immense _potential_.   \n   \nThe bottom line is that you don't really need to grasp the nature of type design to sell some.   \n   \n\\> Design a beautiful book with only one type size.   \n   \nWhy would I do such a boring thing? Designing type is magnitudes more challenging. But most of all, it's a matter of personal abilities and preferences. I'm not a poet, but I don't mind because I prefer what I am. Here we are talking about type design, not type use. Are you qualified? You don't have to be an expert (I'm not), but you do need to tame your artsy-fartsy chimeras.   \n   \nBTW, here's a simple challenge for you in turn: avoid spewing claptrap like \"If you don't like our Californian, you don't like Californian.\" Without something to make you stand apart (like optical scaling, hello?!), you're just another average designer in the wide sea.   \n   \nAs for Jim's quote, you're reading whatever you want into it (as you do with whatever anybody writes). Look at the \"f\"s in the crushing majority Linotype metal fonts (and I don't care about alternates and such, because virtually nobody uses them - it's a fact), and tell me why. Because they were all idiots? No, my explanation (which is that of most people) makes more sense, and is supported by evidence. There's a ton more examples like this. But you refuse to see it - because it violates your religion. Your holy land is limited to your head.   \n   \nJim also said the pantograph could not cut corners deeper than 1/1000 of an inch, and anybody with decent eyesight can in fact see the difference. But you choose to forget he said that...   \n   \nMetal is limiting. Half point sizes are useful. This is obvious to anybody with half a brain, and the objectivity to use that half properly. Face it, move on.   \n   \n(John, your post requires some thought, so I'll get to it soon.)   \n   \nhhp\n\n"
    },
    {
      "time": "11 May 2004 — 5:30pm",
      "content": "Hrant,   \n   \n_Wow - impressive. :-/   \nI designed two fonts when I was 13, and they were more notable that your two. Big deal._      \n   \nNotable\n\n"
    },
    {
      "time": "11 May 2004 — 5:35pm",
      "content": "\\> \"I do not pretend to be a type designer\"   \n   \nHogwash. Pretending is your forte.   \n   \nLet's see the goods from Vancouver on optical scaling, then you can talk with me about type design.   \n   \nhhp\n\n"
    },
    {
      "time": "11 May 2004 — 10:13pm",
      "content": "Hrant,   \n   \nLive with the fact that unless you beg you will have to do something about optical scaling on your own\n\n"
    },
    {
      "time": "11 May 2004 — 10:22pm",
      "content": "\\> digital type will always be inferior to metal type.   \n   \nEspecially revivals that are lacking a big chunk of the original...   \nI've done more about optical scaling in the past year than you've done in your whole life, apparently. And I'd personally be embarassed to issue Califiornian without it.   \n   \nhhp\n\n"
    },
    {
      "time": "11 May 2004 — 11:34pm",
      "content": "This is a deeply disfunctional exchange. Hrant, if you want to talk Kindersley at some point, please start a new thread. I'm not going to be reading this one.\n\n"
    },
    {
      "time": "14 May 2004 — 10:43am",
      "content": "_\\> digital type will always be inferior to metal type.   \n   \nEspecially revivals that are lacking a big chunk of the original...   \nI've done more about optical scaling in the past year than you've done in your whole life, apparently. And I'd personally be embarassed to issue Califiornian without it.   \n   \nhhp_\n\n"
    },
    {
      "time": "17 May 2004 — 11:11am",
      "content": "On the subject of kerning/spacing: three sytems have been discussed:   \n1. sidebearings   \n2. envelopes   \n3. optical centres   \n   \nNone of these are, when automated, sufficiently multivariant. Kerning (ie manual over-rides) is always necessary for the type designer/typographer to exercise a subtler understanding of the way the typeface works.   \n   \nThe first two propose that it is the purpose of spacing to create even color, and that this can be achieved by averaging out the contiguous white space between the perimeters of glyphs.   \n   \nThe idea of optical centres is slightly different, in that it takes account of the positive \"mass\" of the glyphs.   \n   \nHowever, in my experience designing type, there are many variants that have to be assessed:   \n   \n-The rhythm of vertical (and to a lesser extent diagonal) stems   \n-The closest distance between near-points of adjacent glyphs   \n-The amount of \"penetration\" a glyph makes of its neighbor's territory   \nand of course,   \n-The contiguous space between glyphs.   \n   \nThen, no matter how comprehensive the system in the font, it can never satisfy the demands of every setting. Type size and tracking affect kerning, as do the idiosyncracies of specific words.   \n   \nThese variant factors interact. Design is a discriminating process which makes judgements about how to balance their often conflicting demands.   \n   \nNo matter what technology is used to set type -- metal, photo, digital -- there must always be a place for \"manual kerning\" which over-rides the default, because spacing is a question of proportion, and there is no such thing as an ideal proportion that will please everybody.\n\n"
    },
    {
      "time": "17 May 2004 — 11:23am",
      "content": "_The first two propose that it is the purpose of spacing to create even color, and that this can be achieved by averaging out the contiguous white space between the perimeters of glyphs._   \n   \nActually, the envelope idea -- or 'spacing bubble' --, as I conceive it, does not presuppose a particular purpose in spacing: it is a mechanism to achieve spacing, not a model of how things should be spaced. The spacing that results is determined by the shape of the bubble, which in turn is determined by the designer, who may or may not focus on 'averaging out the contiguous white space'. What I like about the bubble idea is that the ability to control the shape of the bubble and, hence, the interaction of the bubbles of different letters allows one to directly address two of the crucial aspects of spacing that you identify: the closest distance between near-points of adjacent glyphs, and the amount of 'penetration' a glyph makes of its neighbor's territory. At the moment, these can only be addressed by kerning: effectively we have default spacing (rectangles) and exceptional spacing (overlapping or spaced-out rectangles). The bubble allows the designer to address what we now implement as kerning as an aspect of default spacing.   \n   \nRoss and I spent some time testing the bubble approach recently, and I'm very impressed by the results. The one area that is troublesome is when parallel diagonals are in proximity, e.g. VA, in which case there is a tendency for the spacing to be too tight unless the bubble includes non-intuitive spikes above the x-height. Such features are why I think this approach is only practical if a computer program handles the bubble definition algorithmincally while the designer simply spaces letters: actually designing optimal bubbles is difficult, although not impossible.\n\n"
    },
    {
      "time": "17 May 2004 — 1:47pm",
      "content": "\\>The bubble allows the designer to address what we now implement as kerning as an aspect of default spacing.   \n   \nSounds very impressive, John.   \n   \nI'd like to comment more, but it's a bit of a brain-boggler without actually trying it out!\n\n"
    },
    {
      "time": "17 May 2004 — 2:52pm",
      "content": "About Kindersley: I'd have to check, but from what I remember it only calculated an \"optical center\" of a letter to then apply it to calculate the weights of its outlying parts, if you know what I mean. But if not, I agree it wouldn't be good enough.   \n   \nAs for the idea that John has (via Laurence), I think it makes great sense (I had the idea myself on Typo-L around '98), but the trick of course is _implementing_ it... With InDesign sporting -what I consider to be- a pretty decent optical spacing algorithm (which can further be refined) it would be pretty hard raising the dough to fund development. But I hope I'm wrong.   \n   \nhhp\n\n"
    },
    {
      "time": "17 May 2004 — 6:31pm",
      "content": "John, your idea is very interesting, mathematically. I think of it as a contrained optimisation. Suppose you draw a rough intitial bubble -- optimisation needs something to start with -- for each character; and define contrains to be a well spaced set of words -- the more, the better, especially some tough pairs which I have only a slight idea of what they are. Then, plausible goals might be:   \n   \n 1. find an optimal (soft) bubble, given the contrains and inititials;   \n 2. optimal bubble defines basic spacing in that two bubbles sit touching each other; do I under you idea correctly?   \n 3. there are likely to be some conflicts, by nature, given constrained input, so a solution like kerning may still be needed;   \n 4. in any case, the result shall be transferable to ractangular box+kern paradigm.   \n   \nI was thinking of a soft bubble that can grow/shrink depending on size/tracking. It might be handy. The real difficulty, in my thinking, should be defining the representation of the bubble, and how two bubbles interact during the optimisation.   \n   \nWell, that's my perspective without any type design experiance.\n\n"
    },
    {
      "time": "17 May 2004 — 10:20pm",
      "content": "\\> a soft bubble that can grow/shrink depending on size/tracking.   \n   \nOr think of it as a fixed [repulsive] magnetic field, where the deeper you go into the \"bubble\" (more like \"halo\") the stronger the resistance.   \n   \nhhp\n\n"
    },
    {
      "time": "17 May 2004 — 11:05pm",
      "content": "Nick,   \n   \nThis thread has drifted off topic, so I feel free to ask a question.\n\n"
    },
    {
      "time": "18 May 2004 — 7:52am",
      "content": "Gerald,   \n   \nSorry, I don't know very much about 19th century typography, other than what I've deduced from looking at a few specimen books and popular magazines.   \n   \nFor the period you mention, I can suggest looking in the Penrose Annual, which began publishing c. 1895 and is full of technical printing information.\n\n"
    },
    {
      "time": "18 May 2004 — 11:22am",
      "content": "_1. find an optimal (soft) bubble, given the contrains and inititials;   \n2. optimal bubble defines basic spacing in that two bubbles sit touching each other; do I under you idea correctly?_      \n   \nYes, this is correct. When my computing capabilities are back to normal (recovering from a hard drive crash at the moment), I'll try to find time to post some examples.   \n   \n_3. there are likely to be some conflicts, by nature, given constrained input, so a solution like kerning may still be needed;_   \n   \nPossibly, although I'm not sure that there actually would be conflicts. Kerning already presupposes that there is an ideal, non-contextual relationship between pairs of letters. What I'm talking about is a different method at arriving at that relationship. Since the desired relationship is determined by the shape of the letters themselves, I have trouble imagining conflicts in a spacing system that is also based on the shape of the letters. The trickiest thing I've come up with so far is trying to make bubbles that ideally space both uppercase-to-lowercase and uppercase-to-uppercase, but then most default spacing/kerning for uppercase-to-uppercase is already a tight compromise, and with appropiate postive tracking I don't think the bubble spacing for uppercase sequences such as AV would be disproportionately tight.   \n   \n_4. in any case, the result shall be transferable to rectangular box+kern paradigm._   \n   \nYes, this is a thought I had a few days ago when looking at Ross' latest tests. The bubble approach doesn't necessarily have to be implemented in layout applications in order to be useful: it could represent a device- and format-independent way to specify and store desired spacing, which could then be optimally converted to sidebearings and kerning pairs by font software, as appropriate to particular formats.\n\n"
    },
    {
      "time": "18 May 2004 — 11:33am",
      "content": "\\> The bubble approach doesn't necessarily have to be implemented in layout applications   \n   \nTrue - even just a Python script for FontLab would be great - and that's plausible.   \n   \nhhp\n\n"
    },
    {
      "time": "19 May 2004 — 4:20am",
      "content": "Good afternoon   \nMr. Gerald Giampa, Mr. John Hudson, Mr. Thomas Phinney,   \nMr. Hrant Papazian, Mr. Nick Shinn, Mr. Gerald Lange   \n& the others partecipants to this\n\n"
    },
    {
      "time": "19 May 2004 — 7:54am",
      "content": "Alessandro,   \n   \nYou don't require permission to quote from entries to this thread. But thanks for asking.\n\n"
    },
    {
      "time": "19 May 2004 — 8:03am",
      "content": "Isn't that De Macchi's font Simona? I've only seen it one other place: an ATypI[-related] publication from some years ago.   \n   \n\\> You don't require permission to quote from entries to this thread.   \n   \nOr really any public discussion.   \n   \nBut yes, thank you! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "19 May 2004 — 8:41am",
      "content": "Sorry, Simona is Downer & Patterson's.   \nDe Macchi's is called Simon.   \n   \nhhp\n\n"
    },
    {
      "time": "19 May 2004 — 11:25am",
      "content": "I said \"brand new letter type,\" I ment for the mag.   \nThank you for reply. Maybe I wasn't pay attention   \nbeing here public. Thanks again. Regards, -AS\n\n"
    }
  ]
}
