{
  "id": "45542",
  "title": "Adobe Illustrator Update Wrecked Create Outlines Function???",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Has anyone else found that you can't create outlines anymore if you don't have the proper license? Or what Illustrator thinks is the license?\n\nAny ideas how to fix this?\n\nJessica\n\n",
  "author": "FMJessica",
  "time": "20 May 2008 — 9:17am",
  "uid": "31259",
  "comments": [
    {
      "time": "20 May 2008 — 9:37am",
      "content": "There are some problems with create outlines in CS3, but I’ve never had an error asking for a license to do it. Please post a screenshot of the error message you’re getting.\n\n"
    },
    {
      "time": "20 May 2008 — 9:41am",
      "content": "I have never seen this error message. Does it occur with all fonts or just certain ones?\n\nChrisL\n\n"
    },
    {
      "time": "20 May 2008 — 9:56am",
      "content": "Well it's not an error message. For some reason after shuffling my font files around, Illustrator doesn't like Avenir Book Oblique. It's fine with every other weight in the family, but it tells me that Avenir Book Oblique isn't licensed and then it won't create outlines. It literally disappears from the menu, and of course it gives me the standard thing about not saving it.\n\nIt's pretty weird.\n\nUp until just now it was doing it also with Avenir Heavy too....\n\nBut then it let me choose create outlines from the menu.\n\nKinda driving me nuts today!\n\n"
    },
    {
      "time": "20 May 2008 — 10:06am",
      "content": "Jessica,  \nTry cleaning out your font cache and rebooting. It may be looking where the font used to be but the cached font has no home to point to.\n\nChrisL\n\n"
    },
    {
      "time": "20 May 2008 — 7:39pm",
      "content": "I had a similar problem with Whitman Type 1. It was graciously upgraded to OT (thank you), and I moved the job along with outlines for all text. I have not been able to completely get it to work right though. Whitman SC Osf was the offender for me.\n\n"
    },
    {
      "time": "21 May 2008 — 8:38am",
      "content": "Some ancient Obliques are in reality Romans that get slanted by the system. Maybe that’s the case here too? If Indy can’t find a proper printer(outline)fontfile it will give you an error, I guess.\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
