{
  "id": "4556",
  "title": "Identity Help",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello...   \n   \nI'm working on a corporate identity for Microfluidic Applications, a group that is selling microfluidic technology for industrial applications. This is a new field of technology that uses alternating current in micropumps, and can be used for medical and industrial purposes, such as diagnostic home test kits...my apologies, this technology is rather esoteric.   \n   \nThe idea is a chip, one of the key components of their technology. I played around with using wells and other chip-like elements. I want to keep the letters are readable as possible, without the lines interfering. Please pass along any suggestions. Thanks.   \n   \n   \n   \n ![MFAlogo](http://web.archive.org/web/20050526115652im_/http:/www.typophile.com/forums/messages/29/34805.gif)\\</font\\>\n\n",
  "author": "allison9190",
  "time": "Fri, 2004-04-30 12:52",
  "uid": "3142",
  "comments": [
    {
      "time": " Fri, 2004-04-30 14:03",
      "content": "loose the 'chip' lines. Too literal and cliche. I think the type in a blue box is enough. Not terribly excitint, but this is microfluidics we're talking about ;o)   \n   \nIf you want to work with some visual metaphor, maybe play off the 'fluid'\n\n"
    },
    {
      "time": " Fri, 2004-04-30 15:03",
      "content": "Try FF Idetification:   \n [http://www.fontfont.com/shop/view\\_singles\\_main.ep?id=127249](http://web.archive.org/web/20050526115652/http:/www.fontfont.com/shop/view_singles_main.ep?id=127249)   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-05-01 17:39",
      "content": "Hrant, I like the concept of Identification, but I think an individual circle with its own ornaments might be a bit gimmicky.   \n   \nPerhaps use Identification, but edit it so that 'MFA' is enclosed within a single oval (or circle) rather than three. And I'm still not sold on that Morse code.\n\n"
    },
    {
      "time": " Thu, 2004-05-06 18:08",
      "content": "can't get any sketchier than this! i just wanted to play with connecting the letters... sorry, couldn't resist. (i know it looks bad; i did it in 45 seconds)   \n ![mfa sketch](http://web.archive.org/web/20050526115652im_/http:/www.typophile.com/forums/messages/29/35315.gif)\n\n"
    },
    {
      "time": " Thu, 2004-05-06 19:26",
      "content": "A great monogram for teen sex: a male pulling a female away from adolescence.   \n   \nhhp\n\n"
    }
  ]
}
