{
  "id": "45560",
  "title": "Orphan Works Copyright Bill",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[Design Observer](http://web.archive.org/web/20081011012618/http:/www.designobserver.com/) has been posting links about reactions to the Orphan Works bill now before Congress. This bill, if passed into law, would modify the existing copyright law.\n\nRead Lawrence Lessig’s Op-Ed piece, in today’s New York Times, [here](http://web.archive.org/web/20081011012618/http:/www.nytimes.com/2008/05/20/opinion/20lessig.html?_r=2&ref=opinion&oref=slogin&oref=slogin).\n\nHear illustrator Brad Holland talk about it [here](http://web.archive.org/web/20081011012618/http:/youtube.com/watch?v=CqBZd0cP5Yc).\n\nDetailed analysis [here](http://web.archive.org/web/20081011012618/http:/capwiz.com/illustratorspartnership/issues/bills/?billid=11320236) and [here](http://web.archive.org/web/20081011012618/http:/capwiz.com/illustratorspartnership/issues/bills/?bill=11322171).\n\nDo something [here](http://web.archive.org/web/20081011012618/http:/capwiz.com/illustratorspartnership/home/).\n\n [‹ Off to Typo Berlin 2008](http://web.archive.org/web/20081011012618/http:/www.typophile.com/node/45803 \"Go to previous forum topic\") [hey! Can u help me?! typophile question, please! ›](http://web.archive.org/web/20081011012618/http:/www.typophile.com/node/46110 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011012618/http://www.typophile.com/user/7716\" title=\"View user profile.\">Ricardo Cordoba</a>",
  "time": "<br>",
  "uid": "7716",
  "comments": [
    {
      "time": " 20.May.2008 5.52pm",
      "content": "This makes me sick. Literally. Another prime example of the government forcing us to pay to protect ourselves. Slowly, but surely, the government is no longer protecting us. They are, instead, continuing to line the pockets of the corporate world.\n\n"
    },
    {
      "time": " 20.May.2008 6.15pm",
      "content": "What’s particularly strange about the whole thing is that in many ways the gov’t has gone so far overboard in protecting copyright the past few years, with the DMCA and such. Then it comes out with the orphan works act, which I thought was a breath of fresh air (for them to recognize the problem of so many 20th century creative works being lost) until I actually read it.\n\nIt does nothing to clear up any of the rights on old material with uncertain ownership, and does plenty just to make creating new work a hassle.\n\n"
    },
    {
      "time": " 20.May.2008 8.39pm",
      "content": "Maybe this will at least wake up some designers to the biggest problem in American politics: the Democrats in Congress are rapidly proving themselves to be just as crooked and inept as the Republicans so many of us have been trying to kick out of Washington. Between this and the farm subsidies bill, I think it’s safe to say that the only people getting anything good out of Congress are the ones rich enough to not need it in the first place.\n\n"
    },
    {
      "time": " 21.May.2008 5.57am",
      "content": "I’ll add a link to an alternative take on this here:  \n [http://danheller.blogspot.com/2008/05/my-take-on-orphan-works-act-of-200...](http://web.archive.org/web/20081011012618/http:/danheller.blogspot.com/2008/05/my-take-on-orphan-works-act-of-2008.html \"http://danheller.blogspot.com/2008/05/my-take-on-orphan-works-act-of-2008.html\")\n\nAlso, remember that \\*currently\\* US law is such that \\*unless your work is registered you’re only entitled to actual loss\\*. No legal fees, no punitive damages. There’s more on this here:  \n [http://duncandavidson.com/2008/04/the-copyright-conspiracy.html](http://web.archive.org/web/20081011012618/http:/duncandavidson.com/2008/04/the-copyright-conspiracy.html \"http://duncandavidson.com/2008/04/the-copyright-conspiracy.html\")\n\nBoth of the links above relate to photography, but should be equally applicable to creative works in general.\n\n"
    },
    {
      "time": " 21.May.2008 10.45am",
      "content": "I’m not a lawyer, and perhaps I misunderstand something in the proposed new law.\n\nMy impression is that the prospective law makes it such that “even if your work is registered, you’re only entitled to actual loss.”\n\nIt seems like there is no incentive whatsoever under this would-be law for anybody to contact or pay a rights holder. After all, the worst thing that can happen is they will come after you, and then you can just offer them the usual reasonable payment, and they’ll just take it, because there are no additional penalties.\n\nOr am I misunderstanding something there?\n\nT\n\n"
    },
    {
      "time": " 21.May.2008 12.52pm",
      "content": "<cite>It seems like there is no incentive whatsoever under this would-be law for anybody to contact or pay a rights holder</cite>\n\nIf I understand it correctly this will all come down to what is eventually considered to be a “diligent effort” to find the rights holder. If the “diligent effort” is more expensive then just calling the rights holder to begin with, it will make sense, assuming that rights holders are actually able to track down and sure violators. Given how few creative types could actually afford the legal fees involved, you’re probably right…\n\n"
    },
    {
      "time": " 22.May.2008 3.55am",
      "content": "<cite>My impression is that the prospective law makes it such that “even if your work is registered, you’re only entitled to actual loss.”</cite>\n\nNo, that’s not right. There’s only a limitation on damages if the defendant proves they performed and documented a qualifying search and was unable to locate & identify an owner (amongst several other conditions they must meet). The onus is on the defendant to prove this, otherwise there’s no limitation on damages.\n\nIf they receive a claim of infringement notice \\*and\\* have already performed the above search plus other conditions, but then don’t pay reasonable compensation or don’t pay at all, the limitation is removed. If they didn’t perform a qualifying search to start with, there’s no limitation.\n\nProving you did an exhaustive search for the owner but couldn’t find them is no easy task, and if the plaintiff has registered their works this then becomes practically impossible (“You mean to say you did an exhaustive search, but didn’t bother to check with the Copyright Office? Excuse me while I laugh, then sue your ass off.”). As such, it will be cheaper to just pay the owner of the work in the first place rather than use it without authorisation and risk a lawsuit, hoping that your search stands up in court. Only if you can’t find them \\*and can prove this\\* do you stand a chance of limitation, and even then it’s a bit risky.\n\nRemember than if there’s no limitation you can claim punitive damages and legal fees, so if someone’s infringed your work you should be able to proceed without worrying about affording the costs. (If you win, they’ll pay them.)\n\nOf course, you can only punish infringement if you discover it, but this proposed Act is certainly not a carte blanche for anyone to start abusing copyrighted works without fear of recrimination. It seems well written to me.\n\nWhat I can see this creating is a thriving ’copyright registration & search services’ market, which would be no bad thing. Yes, it sucks that you have to register your work before it’s fully protected, but this is \\*already the case\\*. (See Duncan Davidson’s link above.) Anything that makes registration cheaper and easier is an improvement for the little guy as it’ll put you in a much stronger position to protect your work by providing a greater certainty of winning any legal action. If these registration services combine with automatic violation scanning and billing (say, 3x usual cost for infringements), and on the other side provide a service for consumers to search for registered works, perhaps along with liability insurance if the service’s search doesn’t work, it may actually make you more money and offer better protection than the current law provides.\n\n[Note: I am not a lawyer either.]\n\n"
    },
    {
      "time": " 22.May.2008 8.26am",
      "content": "“Democrats in Congress are rapidly proving themselves to be just as crooked and inept as the Republicans so many of us have been trying to kick out of Washington.”\n\nMaybe I’m naive, but I kind of give them the benefit of the doubt on IP law and Farm Subsidy regulations.\n\nBoth systems are so unnecessarily complex and muddied that I think it’s less conscious corruption and simply not understanding the actual intricacies of the programs.\n\nOf course, the big problem is that most IP laws are written by giant corporations that profit mainly from IP and farm bills are written mainly by Big Ag.\n\n"
    },
    {
      "time": " 23.May.2008 2.09pm",
      "content": "Congress supports those who influence them and only protects the little guy if he can make enough noise to be noticed and can make them look stupid.\n\nChrisL\n\n"
    },
    {
      "time": " 23.May.2008 2.21pm",
      "content": "Thanks to Ricardo for sending the email message about this and posting here and Facebook.\n\nChrisL\n\n"
    },
    {
      "time": " 23.May.2008 2.38pm",
      "content": "there’s a lot of misinformation and hysteria floating around about this bill.\n\none would think, on the face of it, that the digital libertarians would be howling in protest, but here is a statement from the EFF (electronic frontier foundation) explaining why they think this bill is A GOOD THING:\n\n[http://www.eff.org/deeplinks/2008/05/release-orphan-works](http://web.archive.org/web/20081011012618/http:/www.eff.org/deeplinks/2008/05/release-orphan-works \"http://www.eff.org/deeplinks/2008/05/release-orphan-works\")\n\nMay 16th, 2008  \nRelease the Orphan Works! - by Corynne McSherry  \nOrphan works legislation has returned to Congress, and the controversy surrounding the bill is just as heated as it was the last time around, in 2006. While a broad coalition of libraries, museums, independent filmmakers, public interest groups, and commercial arts organizations such as the RIAA and the MPAA back the bill, several prominent visual artists’ organizations have been rallying their members in opposition. (For a discussion about orphan works, listen to the latest episode of EFF’s Line Noise Podcast.)\n\nEFF strongly supports the legislation. Orphan works reform will dramatically expand the cultural commons, easing access to and use of a wealth of historical works that are presently locked away from public view. It should help create a system in which artists get paid, the public sees more works, and unlawful infringement continues to be punished. But the current legislation could be better, which is why we urge Congress to consider some small but significant changes that should alleviate the concerns of the visual arts community.\n\nFor those who haven’t been following this battle, here’s a quick primer on the problem that this legislation is trying to fix. Orphan works are those whose owner cannot be located. Others who would like to use and share these works may hesitate to do so out of fear that they could later be found liable for copyright infringement because they didn’t get permission. Consider the following examples:\n\nA library has a vast archive of photos and music from the Depression Era. It would like to put this archive online, so people who aren’t able to visit the library can use the works for pleasure, research, making art, etc. But the library is unable to locate owners for twenty percent of the works in the archive and is afraid that if it displays the works online without permission, it would be sued for copyright infringement if those owners emerged later.  \nA documentarian stumbles upon an album full of photographs from the 1960s and is keenly inspired — it’s a treasure trove of local history, with photos of politicians, celebrities, and events. He asks if the thrift store can identify the person who brought the photo album in, but they simply don’t remember. The documentarian wants to use some of the photos in a film, but he’s aware that use of the images could infringe someone’s copyright. By using the photos without permission, he could be opening himself up to thousands of dollars in damages, per photo, if the original photographer (or his or her estate, or any legitimate owner of the copyright) steps forward and sues him for copyright infringement.  \nThe Orphan Works legislation would help resolve those fears and, in the process, encourage the display and re-use of these “lost” works. Under the proposed law, individuals who would like to use an orphan work must put diligent effort into searching for the owner of the copyright in the work, based in part on best practices to be outlined by the Registrar of Copyright. If that search comes up empty, they can use that work. And, if at some future time the copyright owner comes forward to demand payment, the legislation requires the second author to negotiate with that owner in good faith to determine reasonable compensation for the use, and promptly pay that compensation.\n\nAnd if the second author doesn’t follow the new rules under the law and simply uses the work without making a diligent search? The copyright owner can sue them under the current rules and potentially obtain statutory damages of up to $150,000 per work — just as they can now.\n\nCongress also plans to certify searchable databases for visual works like photographs, graphic arts, and textile designs that will collect information about works and contact information for the related copyright owners. There are not “formalities” associated with these databases. No artist will be required to “register” with the databases, and failure to register will not result in it being considered “orphaned.”\n\nThe legislation prioritizes the search for the copyright owner. One of the proposed law’s strengths is that terms like “diligent effort” and “reasonable compensation” would allow the courts, the Copyright Office, and owner and user communities to adapt the requirements over time and address the needs and concerns of a variety of artists and rights holders. By providing guidelines for what constitutes a “qualifying search,” the legislation would have a positive effect on artists by helping to provide a legal standard that can be used to hold bad faith infringers accountable.\n\nWhile the legislation proposes changes that are sorely needed, some small but significant modifications would make the bill even more effective at enriching our culture. First, the copyright databases must be free for everyone to use. No one should be penalized for doing the right thing — namely copyright owners for making themselves easier to contact about works and artists seeking copyright owners before making use of orphan works. Second, the notice of use requirement included in the House version of the legislation should be jettisoned—it will add a layer of bureaucracy to the process, potentially invite “copyright trolls” and add an additional (possible prohibitive) expense to second users.\n\nUltimately, the Orphan Works legislation represents an extraordinary good faith effort on the part of the Copyright Office, technology policy groups, rights holders and our elected representatives. While some changes are in order, this legislation gives Congress a crucial opportunity to revise the copyright law enrich the community at large and providing avenues of revenue and inspiration to generations of artists to come. Here’s hoping our elected officials take advantage of it!\n\n"
    },
    {
      "time": " 23.May.2008 8.11pm",
      "content": "_Thanks to Ricardo for sending the email message about this and posting here and Facebook._\n\nChris, I sent out an e-mail and posted here on Typophile, but I don’t have a Facebook account (not that I know of, at least!). Maybe that was someone else?\n\n"
    },
    {
      "time": " 24.May.2008 10.36am",
      "content": "Ricardo,  \nPerhaps I assumed it was you because you had posted it elsewhere? Sorry for my bad but thanks anyway for your efforts!  \nYou are a good guy no-matter what George Bush says about you :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.May.2008 2.54pm",
      "content": "Chris, LOL!\n\n"
    },
    {
      "time": " 27.May.2008 2.01pm",
      "content": "BoingBoing has posted a pro-Orphan Works Bill argument [here](http://web.archive.org/web/20081011012618/http:/www.boingboing.net/2008/05/22/eff-on-why-artists-s.html), and the responses are pretty eloquent.\n\nAlso, Paul Stiff, of the University of Reading’s [Department of Typography & Graphic Communication](http://web.archive.org/web/20081011012618/http:/www.reading.ac.uk/Typography/), wrote me an e-mail suggesting that someone tell “Congress about these projects: WATCH (Writers artists and their copyright holders: a database of copyright contacts for writers, artists, and prominent figures in other creative fields) and FOB (Firms out of business: a database of publishing, literary and other firms out of business). They’re joint projects of the University of Reading and the University of Texas. Start [here](http://web.archive.org/web/20081011012618/http:/tyler.hrc.utexas.edu/).”\n\n"
    },
    {
      "time": " 27.May.2008 2.53pm",
      "content": "my post above is the text of the EFF argument in favor of this bill.\n\n"
    },
    {
      "time": " 27.May.2008 4.25pm",
      "content": "So it is, Ch, so it is. I posted my last comment in haste, and neglected to make mention of your earlier post.\n\n"
    },
    {
      "time": " 30.May.2008 11.26am",
      "content": "The Graphic Artists Guild has taken a stance on this issue, too:\n\n[http://www.gag.org/](http://web.archive.org/web/20081011012618/http:/www.gag.org/ \"http://www.gag.org/\")\n\n[http://www.gag.org/activities/Orphan\\_Works.php](http://web.archive.org/web/20081011012618/http:/www.gag.org/activities/Orphan_Works.php \"http://www.gag.org/activities/Orphan\\_Works.php\")\n\n(Thanks to [Karen Charatan](http://web.archive.org/web/20081011012618/http:/www.karencharatan.com/) for pointing this out.)\n\n"
    },
    {
      "time": " 6.Jun.2008 10.00am",
      "content": "AIGA has a good article by David Rhodes (former president of School of Visual Arts in NYC.) It was actually his 2008 commencement address at SVA.\n\n[http://aiga.org/content.cfm/the-orphan-work-you-save-could-be-your-own](http://web.archive.org/web/20081011012618/http:/aiga.org/content.cfm/the-orphan-work-you-save-could-be-your-own \"http://aiga.org/content.cfm/the-orphan-work-you-save-could-be-your-own\")\n\nWhile this could benefit non-profit operations like Project Gutenberg, it could also give corporate entities the right to simply use works at will, on the theory that it’s easier to obtain forgiveness than permission. It seems EFF is being more than a little disingenuous here in its assessment of potential negative impact on non-corporate rights holders.\n\n"
    }
  ]
}
