{
  "id": "45566",
  "title": "My first atempt to draw some characters!",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": " ![](http://web.archive.org/web/20150317221317im_/http:/typophile.com/files/black_4706.png)\n  \nCouldn't seep last night... so i decided to try and draw some characters! Would love to hear your opinion! \n",
  "author": "Pedro Leal",
  "time": "21 May 2008 — 1:24am",
  "uid": "30915",
  "comments": [
    {
      "time": "21 May 2008 — 3:03am",
      "content": "Pedro,\n\nGosto...  \ntranslation: I like it\n\nNuma primeira \"leitura\" acho que o Z não está bem conseguido. Podes melhorá-lo concerteza...  \ntranslation: In a first reading I think that the result of Z its not good. You can improve it for sure...\n\nO facto do U estar fechado tambem me incomoda...  \ntranslation: The close of the U also bother me...\n\nContinua o bom trabalho!  \ntranslation: Keep the good work!\n\nAntónio\n\n"
    },
    {
      "time": "21 May 2008 — 3:29am",
      "content": "Hi there,\n\nI second Afonseca, the closed \"u\" and the \"z\" doesn't work with the rest. What you are going to do is up to you.\n\nCheers\n\nAndré\n\n"
    },
    {
      "time": "21 May 2008 — 5:34am",
      "content": "António,\n\nantes de mais obrigado pela tua opinião!  \nTranslation:Thanks for you opinion!\n\nConcordo plenamente com o que disseste relativamente ao U e ao Z. Vou tentar corrigir essas letras e já as ponho aqui!  \nTranslation: I agree with the comments about the U and the Z. I'll redraw them and post it here for feedback!\n\n"
    },
    {
      "time": "21 May 2008 — 5:56am",
      "content": "I believe that I have solved the Z problem. the U/V one not so much, what do you think?\n\n ![](http://web.archive.org/web/20150317221317im_/http:/typophile.com/files/Black2_5442.png)\n\n"
    },
    {
      "time": "21 May 2008 — 6:03am",
      "content": "Perhaps more like this!\n\n ![](http://web.archive.org/web/20150317221317im_/http:/typophile.com/files/Black3_5963.png)\n\n"
    },
    {
      "time": "21 May 2008 — 7:44am",
      "content": "The attempt looks very good to me so far. I see it as a fresh approach to fraktur. Of course, capitals will be needed, and äöüß, and long s, to say nothing of ligatures [long s + t], ch, ck etc., and - since we're chatting in Portuguese - que tal incluir também áèîõüç e família?!\n\nRonald Kyrmse  \ngeocities.com/kyrmse & geocities.com/otsoandor\n\n"
    },
    {
      "time": "21 May 2008 — 9:58am",
      "content": "<cite>\"a fresh approach to fraktur\"</cite>\n\nThanks for the compliment kyrmse! Now I'm really into developing this font. And yeah, I'm thinking on doing all that stuff. Still don't know how the capitals are going to be but i have some ideas for the ligatures! I'll post it soon.\n\nPs: It's nice to see so many people talking Portuguese around here!\n\n"
    },
    {
      "time": "21 May 2008 — 10:35am",
      "content": "Hi Pedro!\n\nI like you U and V now...but the Z :-(...  \nI think it still looks an inverted S or 2...\n\nI dont know much about black letters and how to draw them but here is a (bad draw) ideia of the Z...\n\n ![](http://web.archive.org/web/20150317221317im_/http:/typophile.com/files/z_4999.jpg)\n\nAntónio\n\n"
    },
    {
      "time": "21 May 2008 — 10:47am",
      "content": "António,\n\nI can also see a crossed 0 sometimes when i look at my Z. I'll give your version a try to see how it fits along with the other letters. I'll post it along with the double s when i finish it! Once again thanks for the help!\n\n"
    },
    {
      "time": "21 May 2008 — 11:03am",
      "content": "This reminds me a bit of my unfinished [geogothic font on fontstruct](http://web.archive.org/web/20150317221317/http:/fontstruct.fontshop.com/fontstructions/show/geogothic). Since this is so modular, it looks a lot like a fontstruct font (or is that in fact how it was made?). Given that resemblance, you might look at blackletter fonts on that site to give you ideas on how to solve some of the trickier letters.\n\n"
    },
    {
      "time": "21 May 2008 — 11:09am",
      "content": "I tried the António suggestion for the Z, see what you think of it! I also tried to do a double s (just learned about it) but i think I've done it wrong!  \nDoes the S looking part need to be on the baseline? And should the f looking part be an ascendant?\n\n ![](http://web.archive.org/web/20150317221317im_/http:/typophile.com/files/black4_6227.png)\n\n"
    },
    {
      "time": "21 May 2008 — 11:14am",
      "content": "Eliasson... it isn't a fontstruct... but yes, i based my self on a modular scheme! I did the o as a start point and the adjusted the basic shapes to create the other characters!\n\nThanks for you suggestion I'll take a look.\n\n"
    },
    {
      "time": "23 May 2008 — 10:04pm",
      "content": "I like your work so far, however, sometimes you're using too many elements in order to achieve the shape. About the Z, IMHO the best Z is the first one and then the second one. This last Z doesn't resemble the overall look of the glyphs. I did this Z just for fun, using the idea of the 'x' glyph in your alphabet, you kept it clean, upside and down.\n\n ![](http://web.archive.org/web/20150317221317im_/http:/typophile.com/files/z_4572.gif)\n\nIt's just and idea, nothing else, but my point is that in the same way you worked with x, y, r, you should clean a bit some other glyphs. However, it's a great kickstart. Take a look at the free font [Metalista](http://web.archive.org/web/20150317221317/http:/www.suitcasetype.com/index.php?lmut=en&part=fonts&font=24) to see how they solved some other glyphs.  \nRegards.\n\n"
    },
    {
      "time": "25 May 2008 — 8:20am",
      "content": "Thanks ilovecolours!\n\nI agree with you wen you say I'm probably using too much elements... it´s a very modular design, and probably I should start adding some details that improve the letter legibility and simplify their shapes!\n\nIt's curious that you mention Metalista because that is the font that got me inspired!  \nOn a first stage I tried to abstract myself from that font, In order to try and create my own solutions, but I'll take a second look at it now and try to clean some of the shapes!\n\nRegards.\n\n"
    }
  ]
}
