{
  "id": "45571",
  "title": "New serif - 2 styles of g.",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "This is something I've been playing around with for a few days. After my last script font Olicana was so well received I started thinking about a calligraphically influenced serif - something with plenty of movement. What are your thoughts of it so far? Maybe I'll do an infant 'a' to go with the alternate 'g' for a different stylistic variation.\n\nIs it worth pursuing this? I have no idea if something like this exists already - does it? and is this different enough?\n\nThis is the Extra Black style, I've also done some Light glyphs. There will probably be 6 weights (if the response is fairly positive, otherwise I'll abandon it and come back to it when I've finished all my other half-finished projects).\n\n ![](http://web.archive.org/web/20150417143532im_/http:/typophile.com/files/Serifg's_4483.jpg)\n\n",
  "author": "Nick Cooke",
  "time": "21 May 2008 — 4:54am",
  "uid": "3834",
  "comments": [
    {
      "time": "21 May 2008 — 5:41am",
      "content": "I like it a lot. The serifs seem like an odd mixture at times, but I think both styles can plausibly work together. In the \"p' the mixture seems nice. I like the more structured looking 2 story g best. Also I think the single story g and 2 story a have a more cartoony look that make them stand out too much. I would imagine a solution for the a is not so simple in the bold weight. Overall though, I think its a very rich looking font. Great work!\n\nStephen\n\n"
    },
    {
      "time": "21 May 2008 — 6:01am",
      "content": "Very nice hand-molded feel.\n\nFor me, some of the joins are a bit painfully thin. This is especially true for the bowl of the a. Compare the join of the top of the p and of the r. To me the r is good and the p too thin.\n\nAlso given the rounded tops of the head serifs, it would seem to call for cupped foot serifs.\n\nBut overall the curves are very sweet, and this would be a very warm and attractive display face.\n\n"
    },
    {
      "time": "21 May 2008 — 6:27am",
      "content": "Thanks for the comments so far. I'll match the thickness of the 'r' thin stroke in the other characters William.\n\nThe serifs are cupped - they just don't show up at this size very well. There are many details that one can't see at this size, but can be seen on the new larger pic of an 'n'.\n\n ![](http://web.archive.org/web/20150417143532im_/http:/typophile.com/files/lcn_6086.jpg)\n\n"
    },
    {
      "time": "21 May 2008 — 10:15am",
      "content": "Nick this is really nice. I could absolutely see this in use. To drive yourself even more crazy you could think about how optical sizing might change the shapes. And you could always use stylistic sets or alternates to include both a and g alternate glyphs.\n\n"
    },
    {
      "time": "22 May 2008 — 9:17am",
      "content": "I think the double story g works best in your example. Although I could imagine a single story could work very well too, but your current incarnation might be a bit too 'freeform', so to speak. But I think you should definitely do both g's.\n\n"
    },
    {
      "time": "22 May 2008 — 11:40am",
      "content": "I think both kinds of g might work equally well although the double story is more what I would expect to see with serifs and modeling of the kind you have. That doesn't mean you have to cater though.\n\nI wonder if a big more weight to the ear would be good, maybe a higher arc on top - but that is partly an optical size question.\n\nThis design has the funk. ( a compliment )\n\n"
    },
    {
      "time": "27 May 2008 — 4:35am",
      "content": "Thats very nice Nick... I see elements of Acanthus within it... Especially Acanthus Extra Black Italic, which has the same 'calligraphic lines' which is what has influenced your ideas... It'll be nice to see the progression.\n\nBest Wishes.  \n\\_\\_  \nRez\n\n"
    },
    {
      "time": "30 May 2008 — 5:41am",
      "content": "Thanks for the feedback so far. OK, so now I've done a few more characters - and you can see it in 6 weights.\n\nI'm concentrating on the one 'g' at the moment, but will include the other as an extra alternate glyph.\n\nI've thickened the thin strokes, made the ear of the 'g' a bit more beefy and shortened the crossbar on the 't' to lessen the space between it and the following character. I also shortened the serifs on the 'y' for the same reason, but that isn't shown here.\n\n ![](http://web.archive.org/web/20150417143532im_/http:/typophile.com/files/J1_6715.jpg)\n\n"
    },
    {
      "time": "30 May 2008 — 3:11pm",
      "content": "I really like the irregular quality of it. The 'g' looks good. I think the underbelly curve at the top of the 'f' is a little soft in the lighter weights.\n\n"
    },
    {
      "time": "30 May 2008 — 4:07pm",
      "content": "I hesitate to mention this, as maybe it's the look you want, but you might try rounding the tops of the foot serifs to match the pattern of the head serifs.\n\nThe lightest weights are to me less successful than the heaviest. I don't know why--maybe higher contrast would help? Or maybe narrowing them a bit?\n\n"
    },
    {
      "time": "31 May 2008 — 10:00am",
      "content": "That g needs to be more kinky!\n\nThe horizontal stroke of the tail in the boldest weight has the flavor, but the lights are too regular. In general I think the light weights need more faceting in the round letters (o, e, g etc) to match the other letters (m,n,h,b,d,p...). I don't think contrast is the issue as William suggests. Get kinky with it!\n\n"
    },
    {
      "time": "4 Jun 2008 — 3:46am",
      "content": "Hi Nick,  \nGreat work, its looking really nice. I especially like the e, c and o. They have a really nice feeling cut. I also like the double story g, the y, the r and the f - although I find the g to be a little upright. I love the hard angled internal serif on the s - but maybe it needs to be accentuated further. Not a big fan of the serif on the top of the s.\n\nTo me the glyphs I've listed above seem to fit into a more harder chiseled face, which seems a little bit at odds with the other softer more hand-drawn characteristics. EG, the ear on the g, the underside of the e, the hard internal bowl of the o all work together, but don't really fit with the more fluid calligraphic style of the h, m, n, b, t, i, v. BTW, I love the variation in weights - its nice to see the skeleton underneath still holds up at light weights.\n\n"
    },
    {
      "time": "4 Jun 2008 — 3:52am",
      "content": "\"It is looking so nice\". It also works awesomely with [Olicana](http://web.archive.org/web/20150417143532/http:/typophile.com/node/16296) :-)\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:16am",
      "content": "Thanks everybody.\n\nI've been refining away for the past few days, and now I've done the complete lower case. I decided that the light weight was a bit too anorexic to get any decent bumps so I fattened it up. The heaviest weight is also a fair bit heavier, and looking pretty damn chunky!\n\nThis has been quite a learning process - there's a very fine line between good-looking curves with a few bumps and a bumpy mess. Some characters are more angular than the previous examples - c, e g (slightly) and s, and others have been made more substantial - a, the ear on the g (BTW - I like the top of the s, so I'll leave it). William - try rounding the tops of the foot serifs to match the pattern of the head serifs - What? like Cheltenham you mean? I'm not keen on that idea - I like the contrast between the top and bottom serifs.\n\nI'm pretty pleased with it so far - it has plenty of character but can be taken seriously, without straying into the 'cartoony' look.\n\nAny glaring errors I've missed?\n\nThanks in advance.\n\n ![](http://web.archive.org/web/20150417143532im_/http:/typophile.com/files/JX6_4753.jpg)\n\nNick Cooke\n\n"
    },
    {
      "time": "5 Jun 2008 — 4:16pm",
      "content": "Somehow this double story g seems to stand out a bit. At least to me. I guess because it has less angles than some/most of the other characters.  \nAnd is it me, or does it lean to the left a little bit? (especially in the lighter weight in the last image).\n\nApart from that, I think you're right; it does have alot of character, without getting cartoony.\n\n"
    },
    {
      "time": "7 Jun 2008 — 10:32pm",
      "content": "I think what's going on is the g is the most typical/normal of the glyphs. So it stands out. It doesn't have the same degree of kink in it. The double thinness of the a catches my a bit too much in the heavy weights too. The q is similar. What if the crossbar of the f was a little higher on the right? This is evolving really nicely.\n\n"
    },
    {
      "time": "9 Jun 2008 — 3:46pm",
      "content": "\\> _I think what’s going on is the g is the most typical/normal of the glyphs. So it stands out._\n\nYes, exactly; that's what I meant as well.\n\n"
    },
    {
      "time": "10 Jun 2008 — 3:31am",
      "content": "I can't see it myself. What about other 'normal' characters - f, i, j, k. l, r, v, w, x, y and z?\n\nYou have to look at how well the overall design works - not just focus on one letter. But I may have a look at making the top bowl more squarish like a squashed o.\n\n"
    },
    {
      "time": "10 Jun 2008 — 10:53am",
      "content": "Maybe people are tripping over the single glyphs because they aren't seen it in a paragraph.\n\n"
    },
    {
      "time": "10 Jun 2008 — 1:32pm",
      "content": "i like the feel of this a lot, especially with the asymmetry.  \nthe lowercase u looks too wide, and i wonder if the top left serif should be the same as the top serif on the n (beaky shape).  \nit's really nice :)\n\n"
    },
    {
      "time": "11 Jun 2008 — 5:07am",
      "content": "Maybe these new g's are better?\n\n ![](http://web.archive.org/web/20150417143532im_/http:/typophile.com/files/newg's_6311.jpg)\n\nThe new ones are on the right.\n\n ![](http://web.archive.org/web/20150417143532im_/http:/typophile.com/files/Newham_4151.jpg)\n\nI like the u as it is - it's not too wide, and the top serifs are OK - they fit in with k, v, w, x and y and add to the overall rhythm.\n\nNick Cooke\n\n"
    },
    {
      "time": "11 Jun 2008 — 10:06am",
      "content": "I don't understand what was wrong with the old 'g'. What am I not seeing?\n\nNick this is really wonderful. The more I see it the more I like it.\n\n"
    },
    {
      "time": "12 Jun 2008 — 12:41am",
      "content": "Neither do I Tiff, but what the hell? I like the new one as well. Thanks.\n\n"
    },
    {
      "time": "12 Jun 2008 — 5:46am",
      "content": "I think the (apparent) symmetrical regularity of the outside contour of the upper bowl of the g could be the culprit in making it look like it didn't belong.\n\n"
    },
    {
      "time": "12 Jun 2008 — 6:55pm",
      "content": "I think the new g has improved. Although I didn't think the other one was _wrong_ per se. But the less smooth oval fits better with the rest of the face, I think.\n\n"
    },
    {
      "time": "17 Jun 2008 — 3:18am",
      "content": "Looking forward to the release!\n\n"
    },
    {
      "time": "17 Jun 2008 — 9:56am",
      "content": "Don't hold your breath Katharina!\n\nNick Cooke\n\n"
    },
    {
      "time": "19 Jun 2008 — 5:24pm",
      "content": "These new g shapes will probably fit in with their family better because these have more of the funky stress' of the other letters. What Jelmar is saying about being less smooth is exactly right I think. It is hard to really know without seeing them set en masse but I think this seem promising indeed.\n\n"
    },
    {
      "time": "23 Jul 2008 — 7:40am",
      "content": "Thanks for the comments so far.\n\nNow I've done the caps, I've tried to inject as much character into them as possible - I think they work pretty well with the lower case.\n\n ![](http://web.archive.org/web/20150417143532im_/http:/typophile.com/files/Capslc_4375.jpg)\n\n"
    },
    {
      "time": "23 Jul 2008 — 8:13am",
      "content": "Hi Nick\n\nVery nice design, I bet you could be even harder on the shape of the lc g, it still looks 'a tad' soft compared to the other letters.\n\nAre you looking at this as a text design for use below 14pt? Some years ago I remember doing some work on a font with a similar shape lc u (flat top serifs) and it made some word shapes look a bit awkward in small sizes. I'll try and find some more detail of what it was.\n\n"
    },
    {
      "time": "23 Jul 2008 — 8:41am",
      "content": "Lovely matching caps.\n\nTo me the V and W feel too wide in relation to the rest of the caps, though.\n\n"
    },
    {
      "time": "1 Aug 2008 — 3:59am",
      "content": "I've narrowed the V and W - I had also thought they were too wide.\n\nNow the heaviest weight is UltraBlack. I've also altered the lower case s and u. There's almost a touch of Blackletter about this typeface, although it's not too Teutonic looking. Besides I think I'm too late to jump on that Blackletter bandwagon, it has already driven past.\n\n ![](http://web.archive.org/web/20150417143532im_/http:/typophile.com/files/Newchunky_6225.jpg)\n\nNick Cooke\n\n"
    },
    {
      "time": "1 Aug 2008 — 6:17am",
      "content": "I love this face. To me, the arm of the k looks a bit fragile, and the bowl counter of the a in the latest weight is too pinched.\n\n"
    },
    {
      "time": "1 Aug 2008 — 5:54pm",
      "content": "Wow, really nice...how much? I feel like using it to help me compose some poetry...\n\nPeace,  \nJT\n\n"
    }
  ]
}
