{
  "id": "45612",
  "title": "Typeface Naming Conflict",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just received a notification today from a type designer / foundry that one of our recent releases has the same name as a previous release from said designer / foundry. They are asking me to change the name of our release to avoid confusion.\n\nI’m not opposed to changing the name by any means and feel somewhat neutral towards this conflict at this point.\n\nIt seems that conflicts would happen somewhat frequently and I know that in other industries there are product naming overlaps as well.\n\nDoes anyone have any experience with this issue, I imagine some people have ran into this issue and have dealt with a variety of situations that are similar.\n\nThanks for your feedback.\n\n [‹ Perceptual Illusions](http://web.archive.org/web/20080905125313/http:/www.typophile.com/node/45663 \"Go to previous forum topic\") [Pirate type ›](http://web.archive.org/web/20080905125313/http:/www.typophile.com/node/45435 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905125313/http://www.typophile.com/user/17099\" title=\"View user profile.\">Mike Jarboe</a>",
  "time": "<br>",
  "uid": "17099",
  "comments": [
    {
      "time": " 21.May.2008 11.53pm",
      "content": "could you name and maybe give a link to the examples you are citing here?\n\ndr\n\n"
    },
    {
      "time": " 22.May.2008 11.47am",
      "content": "David, well the font(s) in question are titled ’Verse’, completely different fonts with the same name. Completely different foundries and styles. If you contact me I’ll forward you the links but I don’t want to post and reveal who I was contacted by just for reasons. Thanks for your response.\n\n"
    },
    {
      "time": " 22.May.2008 12.05pm",
      "content": "If we are ’talking’ about a German type designer here, please note that his typefaces released as ’Verse’ are actually named ’VerseSans’ and ’VerseSerif’, as it seems? _(Oh, And, Then there is ’ [Versa](http://web.archive.org/web/20080905125313/http:/www.ourtype.be/)’ and ’ [Verso](http://web.archive.org/web/20080905125313/http:/www.canadatype.com/)’, as well. ;)_\n\nDav\n\n"
    },
    {
      "time": " 22.May.2008 12.12pm",
      "content": "Other naming suggestions: ’Verze’, ’Mechanickel’, ’ExtraBolt’, ’Hexagone’, ’Technik’. ;)\n\nDav\n\n"
    },
    {
      "time": " 22.May.2008 12.39pm",
      "content": "Well, many foundries trademark their typeface names to try to avoid this problem. Of course you need to do a trademark search, and if you’re sane also an Internet search for just the name plus the word “font” to see if you find anything.\n\nTypical for Adobe typefaces is that the name we end up using is our second or third choice. But Brioso was Robert’s fifth choice name for that typeface! I forget the whole list, but “Roma” was the working name for a long time. In a similar vein, Arno was once “Sphere” and Hypatia Sans was originally “Geo” and then “Geode.”\n\nAdobe does protect its trademarks, and if we notice a font using the same name afterwards, we’ll politely ask them to change it.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 22.May.2008 8.36pm",
      "content": "Thanks for the feedback. What happens when all the good names are used up?\n\nI wonder how it works in the case of Designers Shock where all of their fonts were named with ’DS’ preceding the name. Is it still a conflict if, for arguments sake, Designers Shock (do they still exist?) created a font and titled it ’DS Garamond’?\n\nAnd oh yeah Dav your right, his font is named VerseSans and VerseSerif. I just finished a stencil version of Verse named Verse ST which hasn’t been released yet except for the regular weight which is a free download for our Facebook group members.\n\nBy the way that last sentence way above is missing ’privacy’, for privacy reasons… I wish the edit option was always available on comments.\n\n"
    },
    {
      "time": " 22.May.2008 9.48pm",
      "content": "I think with names it’s like with so many things in life — ’first come, first serve’. Be the first to use it \\> ’own’ at least some rights to it. _(Who’s late to the ’game’ may have to use either more original names — yes, please; or have to live with using 2nd hand, ’seen/read/used before’, names.)_\n\nAnd I am confident that it should be in the interest of every single type designer to find unique and at the same time at least quite memorable names for his/her typefaces. _(So, Actually, I think it’s not only a problem of legally ’sharing’ a name, but of getting your very own ’creations’ confused with someone elses work.)_\n\nStaying on the subject, DS may have another problem, if they are still ’in business’ for artsy, fartsy, trendy display type: The abbreviation ’DS’ is used by ’Designers Shock’ (DS) as well as ’Dino dos Santos’ (DS Type). ;)\n\nDav\n\n"
    },
    {
      "time": " 23.May.2008 5.22am",
      "content": "This all comes under the heading of Trademark. “Garamond” has become a generic description for a whole class of types and is no longer unique enough to be trademarked. So no one foundry can claim a right to it and protect against others using it. Foundries that wish to use the Garamond label come up with adjuncts in order to A) distinguish their Garamond from others, and B) make it trademarkable. “Adobe Garamond” can be trademarked. “Garamond” cannot.\n\nThe naming challenge faced by type designers and foundries is not significantly different from the same challenge in other commercial sectors — How to come up with something distinctive, appealing, memorable, descriptive or evocative, unique, trademarkable, etc. Naming products and brands is a business unto itself.\n\nThere is a whole hierarchy of characteristics that make a name more or less trademarkable (e.g., common descriptive terms are not generally trademarkable; completely invented words are highly trademarkable). You might familiarize yourself with some of the basics of trademark law by seeking out a good legal reference on the subject. Nolo Press publishes a good one. (You could check your local library.) They also provide some online FAQs at [www.nolopress.com](http://web.archive.org/web/20080905125313/http:/www.nolopress.com/ \"www.nolopress.com\").\n\n"
    },
    {
      "time": " 23.May.2008 7.13am",
      "content": "All of which doesn’t seem to prevent the existence of pairs such as “Liberty” (a light cursive scripty thing) and “Liberty” (a solid Copperplate-Gothic-y thing)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 23.May.2008 8.43am",
      "content": "<cite>All of which doesn’t seem to prevent the existence of pairs such as “Liberty” (a light cursive scripty thing) and “Liberty” (a solid Copperplate-Gothic-y thing)</cite>\n\nWhich probably means that neither designer trademarked the name. Either by choice or by rejection of the application of the word “Liberty” by the trademark office. It is up to the trademark holder to protect the trademark. We recently asked a font reseller to remove a font family due to its name conflicting with one of our trademarks.\n\nJamesM\n\n"
    },
    {
      "time": " 23.May.2008 10.56am",
      "content": "You may resolve conflicts within the realm of typeface names, only to have other problems. Michael Harvey ran up against the estate of at least one jazz musician with a distinctive name when he wanted to apply that name to one of his faces.\n\npowers\n\n"
    },
    {
      "time": " 23.May.2008 2.38pm",
      "content": "This is a really interesting topic, thanks for all the feedback.\n\nMike\n\n"
    },
    {
      "time": " 24.May.2008 4.46am",
      "content": "Yes, the famous name issue is a problem waiting to happen, and should be avoided if possible., and only done with permission.\n\nI remember, some years ago that one of the TDC Type Design Competition’s winning entries had the name Picasso attached to it. When the TDC found out that the designer had not received permission to use the name from the painter’s estate, the TDC required a change of name in order to list it in the annual. The club had learned from previous experience that it was not worth the legal headache to do otherwise.\n\nJamesM\n\n"
    }
  ]
}
