{
  "id": "45614",
  "title": "The \"new\" font of Adrian Frutiger: Frutiger Serif...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "... based on Meridien: [http://www.linotype.com/5368/adrianfrutigersnewesttypefacefrutigerserif....](http://web.archive.org/web/20080924093200/http:/www.linotype.com/5368/adrianfrutigersnewesttypefacefrutigerserif.html \"http://www.linotype.com/5368/adrianfrutigersnewesttypefacefrutigerserif.html\")\n\nopinions?\n\ndr\n\n [‹ Online Type Design Program](http://web.archive.org/web/20080924093200/http:/typophile.com/node/45423 \"Go to previous forum topic\") [Typefaces used by Banks ›](http://web.archive.org/web/20080924093200/http:/typophile.com/node/45725 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924093200/http://typophile.com/user/19074\" title=\"View user profile.\">David R</a>",
  "time": "<br>",
  "uid": "19074",
  "comments": [
    {
      "time": " 22.May.2008 12.42am",
      "content": "No real opinion until i see FS printed or a meaningful PDF is available.  \nBut at first sight, i don’t see the spirit of Frutiger (Sans) in it, which i expect from the naming Frutiger Serif.  \nOk, the marketing people could argue that it is based on a existing typeface (Meridien) of A. Frutiger, that’s why it is appropriate to call it this way …\n\n"
    },
    {
      "time": " 22.May.2008 2.13am",
      "content": "2 random thoughts:\n\neverybody else is doing it\n\nthe power of a brand\n\n"
    },
    {
      "time": " 22.May.2008 8.02am",
      "content": "I think it says a lot about how little thought a lot of designers put into their type selections. People don’t want to make the effort to pick really great fonts and learn to combine them. They would much rather just have a Palatino Sans, a Meta Serif, and so on. It’s sort of sad, but on the other hand, I guess that these brand families will increase the overall quality of design by reducing the number of really crappy pairing decisions.\n\n"
    },
    {
      "time": " 22.May.2008 7.17pm",
      "content": "_I think it says a lot about how little thought a lot of designers put into their type selections_\n\nGot any proof of this?\n\n_They would much rather just have a Palatino Sans, a Meta Serif, and so on._\n\nHave you at all considered that people may have actually asked for these?\n\n—K\n\n"
    },
    {
      "time": " 22.May.2008 7.56pm",
      "content": "Not feelin’ it.\n\nMaybe if it wasn’t called “Frutiger Serif” I’d appreciate it more as an original creation and not feel like it was piggy-backing on the brand success and innovation of Frutiger (sans).\n\nAlso, it’s too prickly for my taste in serifs. The sans is much friendlier on the eyes.\n\n"
    },
    {
      "time": " 22.May.2008 8.53pm",
      "content": "<cite>Have you at all considered that people may have actually asked for these?</cite>\n\nOf course—that was sort of my point. I feel like people just want an easy pairing and that just seems like its a lot less fun. It’s not that I think the fonts are bad, or that designing them was a bad idea, I’m just disappointed that some designers get hooked on easy type decisions. Maybe I’m just reading way too much into this.\n\n"
    },
    {
      "time": " 22.May.2008 9.47pm",
      "content": "I totally disagree. It has nothing to do with an easy pairing. You aren’t giving type designers any credit if you think that.\n\nI tend to use only a handful of foundries because I really trust their abilities. Does that make me lazy as a designer? I trust their designers to make the right choices about serif structure, encoding, kerning, etc. It is then up to me to choose. Sometimes I do choose a sans and a serif _because_ they were designed to be used together and sometimes I don’t. I think it makes a lot of sense to design these so-called super families and they fulfill an important niche.\n\n"
    },
    {
      "time": " 22.May.2008 10.07pm",
      "content": "I have not taken a very close look at the new ’Frutiger Serif’ but I’ve been a fan of Meridien for a long time. There was a brief period abut ten years ago when, by chance, several books that I read in succession were all set in Meridien. I think its unfortunate that Linotype felt the way to market the new weights and styles was to rename the type to exploit the better known Frutiger ’brand’, since Meridien is a nice name, but if it gets the types more widely used, I won’t complain.\n\nI read many years ago about a custom newspaper face based on Meridien, but I never saw it and I don’t know if it was legitimate. Maybe we can look forward to ’Frutiger News’ from Linotype in future?\n\n"
    },
    {
      "time": " 22.May.2008 10.15pm",
      "content": "To add to my initial line of thinking, we (designers) should think of type designers as being on our team and interested in helping us with our work. Deciding not to use a typeface because you think it is lazy is missing out on an opportunity. Just because typefaces may be designed to work as partners doesn’t mean what is designed will be easy. You still have to do the work, choose the point size, choose the column width, etc.\n\n"
    },
    {
      "time": " 22.May.2008 10.20pm",
      "content": "You say “lazy” like it’s a bad thing - lazy can be good. Didn’t Bruno say he wanted to make it easier to license fonts than find pirate versions on line? :-)\n\n"
    },
    {
      "time": " 22.May.2008 10.46pm",
      "content": "I agree about Frutiger Serif being too spikey. Amor is only more spikey. :-)\n\nIf Bruno said he wanted to make it _easier_ for designers to license fonts I’m not exactly getting it because Lino/Mono/ITC fonts have almost doubled in price recently.\n\nBohemia $29 to $54\n\nZaphino Pro $35 to $65\n\nDTL doesn’t look so expensive now does it.\n\nAnd you know its not like the quality is increasing either. This is why the indies get my biz.\n\nMikey :-|\n\n"
    },
    {
      "time": " 23.May.2008 1.18am",
      "content": "I think it says a lot about how little thought a lot of people put into their food. People don’t want to make the effort to pick really great ingredients and learn to cook them well. They would much rather just have a Big Mac, a Whopper, and so on. It’s sort of sad, but on the other hand, I guess that these brand families will increase the overall quality of food by reducing the number of really crappy meals. Or won’t they?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 23.May.2008 6.44am",
      "content": "Bert, I think a better analogy would be Porsche seeing all the demand for Luxury SUVs and releasing the Cayenne, increasing the overall quality of SUVs by reducing the number of Ford Explorers with $50,000 in options that end up on the road. Sure the Cayenne is awesome, but it feels forced.\n\n"
    },
    {
      "time": " 23.May.2008 7.10am",
      "content": "@ Tiffany: You’re right, and I was looking at this whole thing from a very backward and wrong-headed perspective.\n\n"
    },
    {
      "time": " 23.May.2008 9.07am",
      "content": "Hm, the Cayenne being commissioned by Volkswagen complicates your analogy a bit, doesn’t it? ; )  \nBTW I have SUV’s. And I love small type foundries.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 23.May.2008 9.32am",
      "content": "\\>If Bruno said he wanted to make it easier for designers to license fonts I’m not exactly getting it because Lino/Mono/ITC fonts have almost doubled in price recently.\n\na. Convenience has a price.  \nb. he made the comments at NYC Typecon, announcing Font Explorer X, a year pre-merger.\n\n"
    },
    {
      "time": " 23.May.2008 9.39am",
      "content": "<cite>…the Cayenne being commissioned by Volkswagen complicates your analogy a bit, doesn’t it?</cite>\n\nIt does, but the complex legal and financial dynamics of the Porsche/Volkswagen relationship and the related legal proceedings make it hard to go further without bringing in an economist and an antitrust attorney familiar with the whole mess ;)\n\n"
    },
    {
      "time": " 23.May.2008 10.30pm",
      "content": "My gut response was very similar to James’s. For the four years that I’ve been designing seriously and have had Meridien, I have been a huge fan of it. I have certainly enjoyed pairing it with Frutiger, and admittedly hold some pride in the fact that I know it makes a good pairing even though they aren’t branded as a Serif/Sans combo. So, it saddens me to see Meridien updated and renamed to follow the current trend for Serif/Sans super-families.\n\nBut, the logic of people like Miss Tiffany seems to prevail in the end. I’m sure many people in the industry had similar gut responses when italics were added to fonts like Centaur, which were not originally designed with italics but had well known italic counterparts. Now we don’t hesitate to use Centaur Italic instead of Arrighi.\n\nPersonally, I would have been more fond of carrying on the Meridien name, but as long as good type is proliferated and proper credit (and payment) is given where it belongs I have no problem with what the name is.\n\n"
    },
    {
      "time": " 24.May.2008 12.32pm",
      "content": "Posted ‘have’ — should be ‘hate’.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 24.May.2008 3.18pm",
      "content": "_So, it saddens me to see Meridien updated and renamed to follow the current trend for Serif/Sans super-families. (. . .) I’m sure many people in the industry had similar gut responses when italics were added to fonts like Centaur, which were not originally designed with italics but had well known italic counterparts. Now we don’t hesitate to use Centaur Italic instead of Arrighi._\n\nIt’s all [Morris Fuller Benton’s](http://web.archive.org/web/20080924093200/http:/www.identifont.com/show?16W) fault. ;-D\n\n"
    },
    {
      "time": " 26.May.2008 10.18am",
      "content": "At least they didn’t name it Myriad Serif.\n\n"
    },
    {
      "time": " 26.May.2008 12.37pm",
      "content": "The job is always about the content, not about the type designer or graphic designer. When looking for pairings, let the text be your teacher and your eyes be your judge. It is hard for a type designer to anticipate all needs of all text. Type designers do their best either on purpose as in a superfamily or by accident when 2 different families happen to suit the job together perfectly. The graphic designer is the vigilant watchmen who does his best to represent the text or content in a suitable way. At least now choices are not limited by the library of the compositor you were forced to choose.\n\nChrisL\n\n"
    }
  ]
}
