{
  "id": "45625",
  "title": "Museum of Contemporary Art Chicago - What's their gallery font?",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I visited the MCA the other day and was perplexed by the type they were using on the walls for their gallery descriptions. It looked distinct enough that I felt I should recognize it, but was unable to come up with a name. I have also been unable to find it in my rather limited collection.\n\nI wasn't able to snap an example, but I'm hoping maybe someone out there is familiar enough with the museum to know.\n\nThanks.\n\n",
  "author": "Jason Walley",
  "time": "22 May 2008 — 9:44am",
  "uid": "19575",
  "comments": [
    {
      "time": "22 May 2008 — 5:50pm",
      "content": "Is [this label](http://web.archive.org/web/20130311125823/http:/www.mcachicago.org/information/large_read_label.html) an example of the lettering you mean?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "22 May 2008 — 6:04pm",
      "content": "If this is the lettering you mean, it seems very close to Documenta Sans from the [Dutch Type Library](http://web.archive.org/web/20130311125823/http:/www.dutchtypelibrary.nl/). Look at the numerals, especially the 8, and the italic letters. The only disconnect seems to be the W, which looked like the legs crossed fully in the Museum sample. For some reason, the idea of further customizing what is already a very expensive font, seem like gilding the lily, but there must be some money there I'd guess.\n\nCan anyone find a better match?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "22 May 2008 — 7:19pm",
      "content": "Thanks Mike, that label is exactly what I'm referring too—I guess I didn't search hard enough on the museum website for an example to pull.\n\nIt was the lowercase 'w' and 't' that really caught my attention in the museum. In the regular Documenta Sans, neither seems to match, but the capital 'W' and the smallcaps 'w' do match the one from the museum. The lowercase 't' from the museum has a more aggressive upward flair to the tail. In fact, as I'm flipping back and forth between the label sample and the Documenta Sans sample I feel like the museum sample is slightly more angular and aggressive in general whereas Documenta carries more roundness—I'm seeing this in the connections for the 'n', 'm', and 'r'. But then other forms like the '8', 'g', and italic 'f' seem to be spot on.\n\nI guess I was wrong that I felt like I should recognize the type, which is a relief then to my pride since I couldn't. Of course, now my curiosity is in full strength and I absolutely have to know what they use.\n\n"
    },
    {
      "time": "23 May 2008 — 6:08am",
      "content": "Jason, the longer I look at the sample and the font, I agree there are differences, but I can't come up with anything closer. I also looked closely at Haarlemmer Sans, also from DTL, which is quite similar in some respects, including the 't', which seems to match the sample better. However, Haarlemmer's italic is quite different.\n\nIt's a mystery so far, and I love these kinds of challenges. I have written to the Museum via their web site to see if someone would tell us what typeface they used for their labeling. I will let you know if I get a reply.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "23 May 2008 — 12:12pm",
      "content": "Scala Sans I think.\n\n[http://www.fontshop.com/fonts/downloads/fontfont/ff\\_scala\\_sans\\_ot/](http://web.archive.org/web/20130311125823/http:/www.fontshop.com/fonts/downloads/fontfont/ff_scala_sans_ot/ \"http://www.fontshop.com/fonts/downloads/fontfont/ff\\_scala\\_sans\\_ot/\")\n\n"
    },
    {
      "time": "23 May 2008 — 12:45pm",
      "content": "Definitely Scala Sans.  \n... Funny how all mentioned fonts are Dutch! (I'm so proud.)\n\n"
    },
    {
      "time": "23 May 2008 — 9:55pm",
      "content": "Thanks guys, Scala Sans does look to be the one. And that would explain my feeling of familiarity. I had used it for a big project while on an internship, but being a good little boy didn't snag it for my own when heading back to school so it wasn't in my collection when I flipped through.\n\nI think I'll have to go purchase it so I can proliferate the application of quality Dutch type.\n\n"
    },
    {
      "time": "24 May 2008 — 10:11am",
      "content": "Well once again Angel comes through! Good work.\n\nI need to fix the Style Codes in my Sans Guide, because Scala was coded wrong -- so I missed it.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 May 2008 — 9:50am",
      "content": "It took a few days, but I did get a reply from the designer for the MCA, Jonathan Krohn, and he confirmed that the font used was Scala Sans. I added this just to show that sometimes asking questions from the source does get a reply.\n\n- Mike Yanega\n\n"
    }
  ]
}
