{
  "id": "45626",
  "title": "Pairing Type on a Mini Brochure",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "This small Z-fold brochure folds down to 3 x 4.25\" (with the cover title, \"The Unique Woman.\")  \nI've been trying to pair two complementary handwritten typefaces that work nicely with the brochure's artwork.  \nI've used Prater-script and Handsome-nib and like them both, but I'm not convinced they are the answer. I don't think the goal is for them to be written in the same \"hand,\" as much as it is for them to blend well with the free spirit of the piece and create an overall harmony.  \nAny feedback, suggestions or insight is appreciated—I've never been involved in a forum before and I miss being part of a critique.\n\n",
  "author": "MLucas",
  "time": "22 May 2008 — 9:53am",
  "uid": "31340",
  "comments": [
    {
      "time": "22 May 2008 — 9:56am",
      "content": "I guess it would help to provide the image. I'm still getting the hang of this.\n\n ![](http://web.archive.org/web/20130824183149im_/http:/typophile.com/files/woman_1_5482.jpg)\n\n"
    },
    {
      "time": "12 Jul 2008 — 10:33am",
      "content": "Not about the type-pairing:  \nNice drawings...  \nI would justify the text when you don't have square text-boxes... Are you going to replace the drawings with real footage? Will the text be inverted/negative?\n\n"
    },
    {
      "time": "16 Jul 2008 — 2:12pm",
      "content": "Instead of using a script font, why not just write the script text yourself...maybe get one other person to write the other script text and scan them both in? Possibly getting the client to write it? This will go along with the existing hand-drawn illustrations and pull everything together.\n\nOther than that, everything else looks great.\n\n"
    },
    {
      "time": "23 Jul 2008 — 2:30pm",
      "content": "I agree. Nothing says \"unique\" and \"one-of-a-kind\" like a hand-drawn script.\n\n- Lex\n\n"
    }
  ]
}
