{
  "id": "45629",
  "title": "TypeCon 2007 Typecrit video",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Finally... the first TypeCon 2007 Typecrit video is posted to Youtube. It showcases Kunihiko Okano's beautiful Italic font, Kunihino Okano ( Actually he provided the audio. Thanks Kunihiko-san! ), Matthew Carter, Akira Kobayashi, and John Downer. And a very packed room of avid typefolk.\n\n...and my mediocre ( at best) video making skills. The video is composed of an image of the font being critiqued and of still photos taken at the event. Still, I hope that what I lack, the subject matter more than makes up for.\n\nViva TypeCon!!!\n\nViva Typecrit!!!\n\n[http://www.youtube.com/watch?v=TfMxpxMpcTI](http://web.archive.org/web/20100525140040/http:/www.youtube.com/watch?v=TfMxpxMpcTI \"http://www.youtube.com/watch?v=TfMxpxMpcTI\")\n\nThis is part 1 of 4. I can't promise when parts 2-4 will show up. But I will do my best to make them ASAP.\n\n",
  "author": "<a href=\"/web/20100525140040/http://typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": "",
      "content": "BTW, I made this in part to encourage people who have a font design they are working on to come to TypeCon and have it critiqued. As you can see and hear, it's not too scary. :-)\n\n"
    },
    {
      "time": "",
      "content": "Thanks, that was interesting.\n\n"
    },
    {
      "time": "",
      "content": "Thanks! Not everybody can be there; but now you can learn from what is said. I think this is how you embed....\n\n<object width=\"425\" height=\"355\"><param name=\"movie\" value=\"http://www.youtube.com/v/TfMxpxMpcTI&amp;hl=en&amp;rel=0&amp;color1=0x5d1719&amp;color2=0xcd311b\">\n<param name=\"wmode\" value=\"transparent\">\n<embed src=\"/web/20100525140040oe_/http://www.youtube.com/v/TfMxpxMpcTI&amp;hl=en&amp;rel=0&amp;color1=0x5d1719&amp;color2=0xcd311b\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"425\" height=\"355\"></embed></object>\n"
    },
    {
      "time": "",
      "content": "Thanks... Very interesting... I have so much to learn :)\n\n"
    },
    {
      "time": "",
      "content": "Thanks so much for putting this together! Very interesting indeed. Let's video it this year... Hopefully they're doing it again this year. If so, any idea on who the panel might consist of?  \nthanks!\n\nJosh\n\n"
    },
    {
      "time": "",
      "content": "Probably the same 3 as last year will be on the panel.\n\nIt looks like I will not be able to make it to TypeCon this year after all and will sadly miss hearing from Matthew and the crits for the first time in 4 years. Part of my belly made it on to Eben's video though so I did belly-up to the bar last year :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris, that's terrible. We will all miss you!\n\nI encourage somebody to set up their cam and get this done. It would be better & easier that way. However, the panel should be asked ahead of time.\n\n"
    },
    {
      "time": "",
      "content": "No Dez at TypeCon!? That's just wrong.\n\n"
    },
    {
      "time": "",
      "content": "I will really miss seeing all you there and my annual type fix. :-(\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Me, too. My nephew inconsiderately decided to get married the same weekend as Typecon. I'll miss Chris and all the regulars.\n\n"
    },
    {
      "time": "",
      "content": "Double ouch!!!\n\n"
    },
    {
      "time": "",
      "content": "Thanks Eben! How have you been?  \nI appreciate you made this video and uploaded to YouTube.  \nI'm looking forward to seeing the other three parts of the 10 minutes critics.  \nThis event was really exciting and I was lucky to take this critic.  \nI'm going on designing my font and making another weight to complete this as a family font.  \nHow about your font, Eben?\n\nI also want to get everyone's opinion what you think about this type design.  \nAny comment would be appreciated.  \nThanks.\n\nK.O.\n\n"
    },
    {
      "time": "",
      "content": "Kunihiko Okano, it's great to see you Typophile!\n\nMy font is still in progress but I did incorporate the changes they suggested. They were quite good. Especially the idea of relenting, and letting the \"r\" have serifs. I may take up their idea of making a faux mono too. And finally, a proportionally spaced ( normal) font as well.\n\nHere is an example showing some easy letters ( fredo viola done) and a hard set (simply). The arc of the r is still to heavy. It is nearly done though. Next will be italic.\n\n ![](http://web.archive.org/web/20100525140040im_/http:/typophile.com/files/koexp_3624.jpg)\n\nI was wondering if there is a new version of your font we might see too. Certainly all of the advice they gave seemed sound to me. But you may have another idea in some cases. It would be very interesting to see it in a use or context. That would help me think about the design. It is very elegant.\n\n"
    },
    {
      "time": "",
      "content": "Your font looks really great and I think this is better than the previous one when I saw last year.  \nIs this fixed pitch font, isn't it?  \nThis seems to be really natural like a proportional font.\n\nHere is my font that is still in progress.  \nAs for Serif Italic, I think there is nothing much difference between this and the previous one.  \nI just expanded the other families, a little revised some character's forms and added some ligatures.\n\n ![](http://web.archive.org/web/20100525140040im_/http:/typophile.com/files/shotype_specimen_6248.gif)\n\n"
    },
    {
      "time": "",
      "content": "We are grateful to Eben for putting this piece together, and to Apple for donating the software to accomplish the mission. We are so pleased the participants in the crits allowed us to document their efforts in this way. Thanks, as always, to Matthew, John, and Akira, for doing these critiques. They generously give of their time and experience to help other type designers grow and learn. The three wise men will be back in Buffalo to do it once more. Can't wait to see the new types that come out of it.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Tamye!\n\n<cite>Is this fixed pitch font, isn’t it?</cite>  \nIt is. It's going to be fun to go proportional with it.\n\nThese new family members are very cool. I am very amazed at your ability to infuse a new sensibility into glyphs that seem like they would be especially resistant to it - like the m. I especially enjoy the y of your serif Italic.\n\nIt has been great reading your blog: [http://www.shotype.com/](http://web.archive.org/web/20100525140040/http:/www.shotype.com/ \"http://www.shotype.com/\")\n\nI hope you will keep us all up to date as you make new types available.\n\n"
    },
    {
      "time": "",
      "content": "Eben, thanks for this video--very well done!\n\n"
    }
  ]
}
