{
  "id": "45631",
  "title": "Old Style or Oldstyle",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m thinking [two words](http://web.archive.org/web/20080924092245/http:/search.live.com/results.aspx?q=oldstyle+font&src=IE-SearchBox) are better than [one](http://web.archive.org/web/20080924092245/http:/search.live.com/results.aspx?q=%2boldstyle+font&FORM=RCRE2)?\n\nCheers, Si\n\n [‹ Sans serif for IKEA packaging brandmark](http://web.archive.org/web/20080924092245/http:/www.typophile.com/node/45762 \"Go to previous forum topic\") [Futura alternatives ›](http://web.archive.org/web/20080924092245/http:/www.typophile.com/node/45739 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924092245/http://www.typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 22.May.2008 1.02pm",
      "content": "Maybe now, but oldstyle could be part of the modern trend of combining common word pairs into one. Does anyone say “web site” anymore?\n\n"
    },
    {
      "time": " 22.May.2008 1.22pm",
      "content": "I think that moving to one word makes sense. It fits with the OED trend toward turning common hyphenates and phrases into compound words, and it clarifies things for non-typographers, who may think old-style just means “in an older style”.\n\n"
    },
    {
      "time": " 22.May.2008 2.19pm",
      "content": "What would probably be even better is “lower case.” But maybe that should be “lowercase” . . .\n\n"
    },
    {
      "time": " 22.May.2008 2.23pm",
      "content": "I was thinking as part of a font style name, where title case would normally be used, and the hyphen normally wouldn’t.\n\nThanks for the input so far.\n\n"
    },
    {
      "time": " 22.May.2008 5.58pm",
      "content": "I think Charles is right. Oldstyle really isn’t relevant anymore as a description of figures meant for lowercase letters. “Text figures” is my preferred term.\n\n"
    },
    {
      "time": " 22.May.2008 11.08pm",
      "content": " ![](http://web.archive.org/web/20080924092245im_/http:/www.typophile.com/files/oldstyle705_6097.jpg)\n\n"
    },
    {
      "time": " 23.May.2008 10.07am",
      "content": "I like “text”. But what to call the others, “display”? I do still like “old style”. That is the historical curmudgeon in me. But when I can I use “ranging”.\n\nOld Style and ?  \nRanging and Lining  \nText and ?\n\nI’m drawing blanks for some reason.\n\n"
    },
    {
      "time": " 23.May.2008 10.36am",
      "content": "There is nothing wrong with either text or oldstyle to contrast with lining. It’s just terminology. (When you are a kid, you also have to memorize that cold /kold/ is the antonym of hot /hot/, and there is no obvious relationship between the two terms...)\n\n"
    },
    {
      "time": " 23.May.2008 10.47am",
      "content": "I have tried to get myself to use the terms “text” or “lowercase” for the figs formerly known as “oldstyle”. But I think I’m having the “old dog / new tricks” problem. I fear that for me the terms shall ever be “oldstyle” and “lining.” & I guess the figs in Miller & Bell will be known as “three-quarter” figs.\n\nI had not thought about Heileman’s for a long time, since I worked on their ads in an agency. I wish I had a cold quart right now, for the hours before shutting this machine down and heading off for the 3-day holiday weekend.\n\npowers\n\n"
    },
    {
      "time": " 23.May.2008 11.34am",
      "content": "I think the problem with calling oldstyle figures “text” is that 3/4 height proportional figures can fit pretty well in text.\n\nOh, and the hanging numerals are \\*are\\* old style figures. There’s nothing wrong with calling a thing what it is, I say. Maybe ’oldstyle’ is better as it indicates that it’s a label.\n\n"
    },
    {
      "time": " 23.May.2008 12.05pm",
      "content": "So the consensus is for “oldstyle” and not “old style”?\n\n"
    },
    {
      "time": " 23.May.2008 12.17pm",
      "content": "Well, the \\*really\\* old style numbers, let’s say, ancient numbers, looks more like lining figures :P  \n [Hindu-Arabic numbers · wikipedia](http://web.archive.org/web/20080924092245/http:/en.wikipedia.org/wiki/Hindu-Arabic_numeral_system)  \nOn the other hand, the Oldstyle numbers should be called text figures, ’cause that’s what their function is.  \nFinally, Adobe says Oldstyle, and given Adobe’s market share... :)\n\n"
    },
    {
      "time": " 23.May.2008 12.46pm",
      "content": "Ciao,  \nWhether the two words are concatenated or you “keep em separated”, at different times thruout history “old style” has been used to refer to so-called “hanging” figures as well as the typeface designs (styles) of men such as Francesco Griffo and Nicolas Jenson. From the potted history I wrote for Wikipedia:\n\n_In Italy the heavy gothic styles were soon displaced by Venetian or “old style” Latin types, also called antiqua._\n\n_The name “roman” is customarily applied uncapitalized to distinguish early Jenson and Aldine-derived types from classical Roman letters of antiquity. Some parts of Europe call roman “antiqua” from its connection with the humanistic “lettera antica”; “medieval” and “old-style” are also employed to indicate roman types dating from the late 15th century, especially those used by Aldus Manutius (Italian: Manuzio). Roman faces based on those of Speyer and Jenson are also called Venetian._\n\nSee also: Incunabulum\n\nI think lettera antica and Venetian are better terms for the type style formerly known as “old style”.\n\nAs for ’old style’ numerals:  \n**text** no, that could mean several different things  \n**old-style** no, anachronistic & outmoded, the game has moved on  \n**lower case** no, I can think of more telling nomenclature than that.\n\n**x-body** because these figures have x-height bodies. Some have extenders, and some, such as 1 and 2, are x-body only.\n\nCiao,  \nj a m e s\n\n"
    },
    {
      "time": " 23.May.2008 5.14pm",
      "content": "The problem with the term “text” is that is is just as opaque as the term “oldstyle.” If you use full caps in text, as some constructions seem to require, you should use lining figures. Whether or not one should ever use full caps in text is a different matter, but some editorial styles require it. And on balance (for instance), I think newspaper sections with page numbers (e.g., C2) do require full caps.\n\nIn any event, the advantage to “lowercase” and “uppercase” as terms is they do somewhat refer to what figures should be used in what contexts.\n\nHaving said that, I’m with Will. In informal conversations, I confess to still using the term “oldstyle.”\n\n"
    },
    {
      "time": " 23.May.2008 5.51pm",
      "content": "This seems a very interesting topic. I did some searching and found this results:\n\nOn Dictionary.com\n\nSearching for “oldstyle” = 1 result  \nThis 1 result points to “old style”  \n–noun  \n1.  \nAlso, oldstyle. Printing. a type style differentiated from modern by the more or less uniform thickness of all strokes and by slanted serifs.  \n2.  \n(initial capital letters) time reckoned according to the Julian calendar.  \n3.  \nAlso, old-style. Typography. noting or descriptive of a font of numerals of which some part extends below the baseline.\n\nSearching for “old style” = 4 results  \n–noun  \n1.  \nAlso, oldstyle. Printing. a type style differentiated from modern by the more or less uniform thickness of all strokes and by slanted serifs.  \n2.  \n(initial capital letters) time reckoned according to the Julian calendar.  \n3.  \nAlso, old-style. Typography. noting or descriptive of a font of numerals of which some part extends below the baseline.  \n—  \nAmerican Heritage Dictionary  \nold style&nbsp;&nbsp;  \nn.&nbsp;&nbsp;  \n 1. Printing A style of type originating in the 18th century and characterized by slight contrast between light and heavy strokes and slanting serifs.  \n 2. Old Style Abbr. OS or O/S The method of reckoning dates according to the Julian calendar.  \nWordNet - Cite This Source - Share This  \nold style\n\nnoun  \na typeface (based on an 18th century design) distinguished by irregularity and slanted ascender serifs and little contrast between light and heavy strokes&nbsp;[ant: bodoni]&nbsp;  \n—  \nEncyclopædia Britannica, Inc.  \nold style\n\nTo learn more about old style visit Britannica(dot)com  \n\\_\\_\\_\n\nOn the Oxford American Dictionaries, on the Mac OS X, when searching for “oldstyle” the result is none. Old Style is found.\n\nWe have:  \nOld Style  \nOldstyle  \nOld-Style\n\nI have a feeling that it could actually be said as: Oldestyle. Just a thought. All of this bring us to, not two options, but four. I could also suggest a way out, by opting for a ’quantum’ approach: There is four options, just shuffle them and pick one result. If after you pick one and you don’t like it, then you can repeat as many times as you want, until you are satisfied.  \nCheers :-)\n\n"
    },
    {
      "time": " 23.May.2008 8.55pm",
      "content": "“Oldstyle” is the name for the figures.\n\n“Old style” is the name for the classification of type style.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 23.May.2008 10.11pm",
      "content": "Nobody has suggested OldStyle yet?! :-)\n\nOnce this is sorted out, we can start on sans serif/sans-serif/sansserif/sanserif.\n\n"
    },
    {
      "time": " 24.May.2008 2.14am",
      "content": "That’s been started.\n\n"
    },
    {
      "time": " 26.May.2008 11.26pm",
      "content": "OldStyle looks like the name of a dot com.\n\nOldstyle feels right to me in any typographic reference.\n\n"
    },
    {
      "time": " 27.May.2008 2.18am",
      "content": "When I write or edit for Linotype, I always write “oldstyle.” But I’m sure that you’ll find “old style” in some of our publications (sorry!).\n\n"
    }
  ]
}
