{
  "id": "45669",
  "title": "Anivers family",
  "forum": "Jos Buivenga's blog",
  "tags": [

  ],
  "content": "[Anivers](http://web.archive.org/web/20080907171044/http:/www.josbuivenga.demon.nl/anivers.html) will get bold, italic and small caps. The release will be soon and (yes I’ve learned) sold via MyFonts.\n\n ![](http://web.archive.org/web/20080907171044im_/http:/www.typophile.com/files/aniv_1_3700.png)\n\n ![](http://web.archive.org/web/20080907171044im_/http:/www.typophile.com/files/aniv_2_5749.png)\n\n+++\n\n| Attachment | Size |\n| --- | --- |\n| [Anivers\\_sample.pdf](http://web.archive.org/web/20080907171044/http:/typophile.com/files/Anivers_sample.pdf) | 17.96 KB |\n\n",
  "author": "<a href=\"/web/20080907171044/http://www.typophile.com/user/10199\" title=\"View user profile.\">Jos Buivenga</a>",
  "time": "<br>",
  "uid": "10199",
  "comments": [
    {
      "time": " 23.May.2008 12.04pm",
      "content": "Jos, I can’t tell. Are all the corners rounded? Is there a PDF somewhere?\n\n"
    },
    {
      "time": " 23.May.2008 12.27pm",
      "content": "I’ve managed to attach a pdf. The corners are all squared.\n\n"
    },
    {
      "time": " 23.May.2008 12.28pm",
      "content": "Thanks. Nice attention to detail. Are you still interested in thoughts?\n\n"
    },
    {
      "time": " 23.May.2008 12.29pm",
      "content": "Always ;-) It’s not released yet.\n\n"
    },
    {
      "time": " 23.May.2008 12.37pm",
      "content": ":^)\n\nOk. Just thoughts:\n\nk — the top-right stroke would benefit from an angled terminal in the other direction. Would match the elegance of the bottom-right stroke.  \nn and r (italic) — the connection is too slim.  \ne — it appears upside-down, I think, because the eye is smaller than the open counter. Could be a personal taste issue. Note that the bold e doesn’t have the same issue for me.  \nW — again, a personal taste issue, but that middle bar seems odd to me. But not so much in the bold.\n\nI think the figures might be too wide.\n\n"
    },
    {
      "time": " 23.May.2008 1.11pm",
      "content": "Wow! Thanks very much! That is lightning swift. I’m still in the melting middle of changing all kinds of things foreseen and not foreseen. The things you mentioned are certainly more than worth considering ...\n\nk — still thinking of lowering the connection, not changing the terminal.  \nn/r italic — I’ll look into it  \ne/W — I wanted these to be odd shapes. I’ll take a closer look if I can refine them.  \nfigures — Do you mean the spacing or the numerals themeselves?\n\nIf you like I could send the (not finished) font files for a closer look. Let me know ...\n\n"
    },
    {
      "time": " 23.May.2008 4.02pm",
      "content": "Amazing Jos.\n\nI thought the dagger was an italic “f” at first glance.\n\nI guess it’s a matter of taste, but the open “tail” on your lowercase g really bugs me. Reminds me of Trebuchet.\n\n"
    },
    {
      "time": " 25.May.2008 7.58am",
      "content": "Thanks Frode. The dagger and italic f do have something in common :-)\n\nI’m not fond of the Trebuchet g either, but though there is a resemblance I really like the g’s of Anivers.\n\n ![](http://web.archive.org/web/20080907171044im_/http:/www.typophile.com/files/trebug_6645.png)\n\n"
    },
    {
      "time": " 25.May.2008 9.40am",
      "content": " ![](http://web.archive.org/web/20080907171044im_/http:/www.typophile.com/files/fff_4921.png)\n  \nThe f-thing in progress ...\n"
    },
    {
      "time": " 25.May.2008 12.14pm",
      "content": "Do not sleep or something? Where do you find the time? Great work, as always! ;o) ;o) ;o)\n\n"
    },
    {
      "time": " 25.May.2008 6.02pm",
      "content": "Feliz Anivers(ário). Happy Birthday. I said that I would use [Delicious](http://web.archive.org/web/20080907171044/http:/www.josbuivenga.demon.nl/delicious.html) on a bus card. This morning, after taking care of the boys I decided to work on a project for [Anivers Buivenga](http://web.archive.org/web/20080907171044/http:/www.photoblog.com/storage001/2008/05/25/) (as my wife went to visit her mother in Arkansas; as I did not want to waste my time watching vampire movies...). As you can see, this is indeed squared so that there is nothing flying around. The logo is a imitation I did off that gif on your website. I hope it’s not so out compared to the original, except that the F, is a extrapolation made from Anivers “F”. The card is based in a interesting measurement (point system?) : The Quadratim. It is, as far as I know, a scale used by typographers in the grande Lisbon area. I don’t know if the guys of Oporto use this measurement, or if it is a portuguese standard. Put plain and simple it is a 8 point square. The card measures 32x20 Qradratins, or Picas 21P4x13P4, Inches 3.55”x2.22”, 90.3x56.4 mm. The background is based on the photoshop background he seems to like; the color is a recipe of mine that resembles the color pearl. Red pms 202 U + Black or a dark cool gray.\n\nThe font is ANIVERS Regular. I did not started a tread with this cause I think it belongs here ;-)\n\nCheers\n\nAndré\n\n"
    },
    {
      "time": " 26.May.2008 3.00am",
      "content": "@ Darrel – lol ... I try to sleep as less as I can. Thanks for the compliment!\n\n@ André - Thanks for posting this. I surely looks that you had a nice time playing around with Anivers ;-) Interesting info on the Quadratim btw.\n\n"
    },
    {
      "time": " 26.May.2008 3.52pm",
      "content": "Was fun tho playing with your font. I don’t have bold and I did not want to change anything in the font, or ad artificial stroke. The kern is default, when possible. I find the regular weight kind a light. That’s good. Jos, the font that I downloaded don’t have readme file with it - I guess you could include some text in there. As for the Quadratim it is interesting; I will dig for more info and try to make more sense next time. Also, it is typical of hand setting type. You are conditioned to space everything within the square.  \nI can drop a pdf of the card for you (with crops and bleed, or the fh file) on the mail.\n\n"
    },
    {
      "time": " 26.May.2008 3.53pm",
      "content": "Wow. Looks like you have another winner on your hands, Jos.\n\n"
    },
    {
      "time": " 26.May.2008 5.14pm",
      "content": "André, I would very much like to recieve the pdf, but maybe it’s better to wait ’till the new release is ready. I’ll provide you with the finished font files. The weight of the regular is fairly standard —80 em for the vertical stems on a 500 em height for the lower case— but I’m pleased you find it good. I’ld like to know where you had to change the kerning/spacing ... maybe I can use that for my new release.\n\n@ Alex - Glad you like it ;-) I don’t think it will be as successful as Museo, but I hope it will hit the charts at some level.\n\n"
    },
    {
      "time": " 27.May.2008 2.10pm",
      "content": "Sure :-)\n\n"
    },
    {
      "time": " 1.Jun.2008 1.59pm",
      "content": "Anivers will be spaced and kerned (still in progress) with Igino Marini’s wonderful kerning software iKern.\n\n ![](http://web.archive.org/web/20080907171044im_/http:/www.typophile.com/files/honfleur_5803.png)\n\nAnd here’s a glyph overview ...\n\n ![](http://web.archive.org/web/20080907171044im_/http:/www.typophile.com/files/glyphs_4519.gif)\n\n"
    }
  ]
}
