{
  "id": "45678",
  "title": "Wikipedia's \"List of Typefaces\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Wikipedia has a \"list of typefaces,\" and it is disappointingly thin. The idea of having a comprehensive \"list of typefaces\" is laughable in and of itself, but there are some very notable omissions. Some of the particularly notable omissions:\n\nOfficina  \nInterstate  \nThesis  \nWalbaum  \nMeta (and Meta Serif)  \nDIN  \nArnhem  \nScala  \nGotham  \nArcher  \nDidot  \nDax  \nSwift  \nCopperplate  \nQuadraat  \nMrs. Eaves  \nTriplex  \nArno  \nChaparral\n\nIt seems like a lot of the omitted typefaces are those that don't come bundled with Windows, OS X, Adobe CS, or Office. Really, this thread is just intended to encourage discussion. Is it at all feasible to create a \"list of typefaces\" for a resource like Wikipedia? If so, how do you decide the criteria for which typefaces make the cut? But then, wouldn't it just be a somewhat objective \"best typefaces\" list, not unlike FontShop's? Are there any other typefaces that you feel were given a rather significant slight in this list? Discuss.\n\n",
  "author": "DrDoc",
  "time": "23 May 2008 — 8:39pm",
  "uid": "26018",
  "comments": [
    {
      "time": "23 May 2008 — 9:09pm",
      "content": "It's a pretty goofy concept to have such a Wikipedia entry. I'm inclined to use the Wikipedia process to nominate it for deletion, but that looks a bit involved for the time I have available right now.\n\nT\n\n"
    },
    {
      "time": "23 May 2008 — 9:20pm",
      "content": "Wikipedia also has other important lists, such as Star Trek races, characters on _The Simpsons_, fictional computers, members of the League of Superheroes, and “literature” about sadomasochism. Somehow I doubt that many people, authors aside, are taking these lists very seriously, and the best way to deal with them is the same as it is for the rest of Wikipedia: remind people what an unreliable mess the whole thing is.\n\n"
    },
    {
      "time": "23 May 2008 — 9:39pm",
      "content": "It's not that this list is unimportant, it's that it is not worth attempting because of the number of typefaces out there. All those other lists are likely to be shorter (except maybe the Simpsons characters, but even then one can imagine objective criteria for inclusion).\n\nAs for Wikipedia reliability, it's in the same league as any other encyclopedia.\n\nBTW, that's _Legion_ of Superheroes.... :)\n\nT\n\n"
    },
    {
      "time": "24 May 2008 — 2:57am",
      "content": "Wikipedia's official guidelines discourage the creation of lists in article format within the main encyclopedia namespace. Regardless, Wikipedia contains a plethora of such lists.\n\nThe established alternative to manually-created lists is [Categories](http://web.archive.org/web/20131015205112/http:/en.wikipedia.org/wiki/Portal:Contents/Categorical_index). Categories are self-building lists, built up automatically by placing Category tags in relevant articles.\n\n[A category for Typography exists](http://web.archive.org/web/20131015205112/http:/en.wikipedia.org/wiki/Portal:Contents/Categorical_index). At the top are sub-categories. No category called Font or Typeface exists yet. I can look into creating that if typophiles are interested.\n\nj a m e s\n\n"
    }
  ]
}
