{
  "id": "45682",
  "title": "Spacing Methods - H",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I've been following the spcacing method in \"Letters of Credit\" - Walter Tracey.\n\nThe spacing of the Uppercase H seems to be the most important glyph to space, but I'm slightly confused by the description in the book.\n\nThe way I understand it is :\n\n1. Measure the inside distance of the \"H\".  \n2. Half the number and place it on each side the \"H\".  \n3. Place 4 \"H\"'s next to each other to check the spacing.  \n4. The space on the inside and outside of the glyphs should be balanced, adjust spacing until the balance is correct.  \n5. When they are balanced I half the sidebearing to give me the correct sidebearing for the \"H\".\n\n ![](http://web.archive.org/web/20130823060446im_/http:/typophile.com/files/H_3921.gif)\n\n",
  "author": "ReginaldV",
  "time": "24 May 2008 — 2:59am",
  "uid": "29224",
  "comments": [
    {
      "time": "24 May 2008 — 3:54am",
      "content": "Reginald,\n\nYour sidebearing of 180 seems way to loose, 90 seems to tight. But hey, we are looking at an H spaced to itself here. How does the spacing appear if you add lowercase after the H? Try 'Hindi' for example.  \nOr is it just a series of capitals that you are working with?\n\nBest,  \nArtur\n\n"
    },
    {
      "time": "24 May 2008 — 4:52am",
      "content": "I'm just spacing the Uppercaes at the moment.\n\nThe 180 sidebearing wasn't an option for actual sidebearings for the H, it was part of the method in Letters of Credit - I was trying to balance the series of H's next to each other.\n\n"
    },
    {
      "time": "24 May 2008 — 4:57am",
      "content": "Some old similar threads worth having a look.  \n [1](http://web.archive.org/web/20130823060446/http:/www.typophile.com/node/15794) , [2](http://web.archive.org/web/20130823060446/http:/www.typophile.com/node/32294) and [3.](http://web.archive.org/web/20130823060446/http:/www.typophile.com/node/15849)\n\n"
    },
    {
      "time": "24 May 2008 — 6:53am",
      "content": "<cite>The 180 sidebearing wasn’t an option for actual sidebearings for the H, it was part of the method in Letters of Credit - I was trying to balance the series of H’s next to each other.</cite>\n\nYes, I understood, but still then even 157 is to loose. If a sidebearing of 157 gives you the same space between H's as within the H, there's also the horizontal bar within the H which to compensate for by slightly reducing the space between the H's. And from what I can see in your example 157 indeed seems a bit to loose.\n\nI think the last step in Tracey's method should be interpreted as:  \nMeasure the new space between H's (so after optically adjusting the space between H's), divide that by 2 and you have your new sidebearing.\n\nWhen I imagine Tracey shuffling around with H's on white sheets and a ruler, this seems like a logic interpretation of his method.\n\nBest,  \nArtur\n\n"
    },
    {
      "time": "24 May 2008 — 7:33am",
      "content": "<cite>I think the last step in Tracey’s method should be interpreted as:<br>\nMeasure the new space between H’s (so after optically adjusting the space between H’s), divide that by 2 and you have your new sidebearing.</cite>\n\nMeasuring the space between the two H's and dividing it will give you the sidebearing that you already have between the two H's\n\n"
    },
    {
      "time": "24 May 2008 — 7:48am",
      "content": "Keep in mind that Tracey is describing how to space a serif text font, not a sans serif. And that the next step in his method, spacing the H and the O together, will bring new adjustments.\n\n"
    },
    {
      "time": "24 May 2008 — 8:29am",
      "content": "<cite>Measuring the space between the two H’s and dividing it will give you the sidebearing that you already have between the two H’s</cite>\n\nNo, you _start_ with exactly the same space between H's as within the H, _then_ you adjust the spacing until you're satisfied, and _then_ you measure the space between H's again and divide by 2.\n\n"
    },
    {
      "time": "24 May 2008 — 8:49am",
      "content": "<cite>No, you start with exactly the same space between H’s as within the H, then you adjust the spacing until you’re satisfied, and then you measure the space between H’s again and divide by 2.</cite>\n\nThe space between the H's divide by 2 is the sidebearing it has, the space between the two H's is the two sidebearings together.\n\n"
    },
    {
      "time": "24 May 2008 — 8:50am",
      "content": "<cite>No, you start with exactly the same space between H’s as within the H, then you adjust the spacing until you’re satisfied, and then you measure the space between H’s again and divide by 2.</cite>\n\nThe space between the H's divide by 2 is the sidebearing it has. The space between the two H's is the two sidebearings together, so if you divde that space you will get just one of the sidebearings.\n\n"
    },
    {
      "time": "24 May 2008 — 9:12am",
      "content": "Reginald, Tracy says that half the width of the counter is the starting point for each sidebearing. He goes on to say that: 1. it generally has to be less to be balanced; and 2. generally with sans designs the side bearing of the has to be still less because of the lack of serifs.\n\nPersonally, I don't think you can tell what is 'balanced' the first time around just by looking at the H's. I think you will have to do a few other letters--including the O--and then look at them in words. It is really not obvious, and only with experience can you get a feel for what is a 'good' H spacing from that one letter--and even then there is not one 'right' solution. The other thing to do to gain a feel for what is 'good' is to look at the sidebearings in designs similar to yours that you like. There you will see a variety of treatments and their impact on text \"color\". For example, compare Helvetica and Univers. Also you have to consider intended default size, as that will affect what is best.\n\n"
    },
    {
      "time": "27 May 2008 — 7:29am",
      "content": "Tracy needs to be read carefully.  \nThere is no 'correct' spacing for a single character.  \nThe H is fit correctly when the D has balanced spacing in these combinations, HDH and ODO.  \nI know that's cryptic, to some, but if you read carefully, that is what is written.\n\nCheers!\n\n"
    },
    {
      "time": "27 May 2008 — 11:49pm",
      "content": "dberlow,\n\nDo you have any advise, tips, further reading or insights into spacing.\n\n"
    },
    {
      "time": "28 May 2008 — 3:53am",
      "content": "Well, look. There are 100's of fonts included with your computer, I'd guess, and none of them are likely to be terribly wrong.  \nThe only other tip I have is if the \"it\" you are trying to space is the same shape as something else, give it the same space.  \nIf it is different, how does that effect the space. Have a constant mental argument with yourself, and you'll see that help your spacing, (not to mention it being good practice for 'discussing' spacing with others).\n\nCheers!\n\n"
    }
  ]
}
