{
  "id": "45683",
  "title": "Korean typeface.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI'm new here. I'm trying locate typeface that resembles Korean chracters. There's Chinese, Japanese, Arab, Hebrew, Indonesian etc even Thai (and Vietnamese If I remember correctly). But not Korean's. Why is it so unpopular?  \nAny suggestions?\n\nThanks!\n\n",
  "author": "klueless",
  "time": "24 May 2008 — 3:05am",
  "uid": "31466",
  "comments": [
    {
      "time": "24 May 2008 — 3:21am",
      "content": "I assume you mean Latin-alphabet typefaces whose glyphs mimic the shapes of other scripts.\n\nI'm Korean and I find it very difficult to imagine a Latin typeface resembling the Korean script (an alphabet called hangul). At best you would merely be using elements of a typical hangul typeface such as the serif treatment, but the results would look nothing like the Korean script. Hangul has a specific look because of the way the alphabetic elements are arranged in syllabic blocks.\n\nWith Chinese (especially simplified Chinese), there are certain characters that have a low stroke count that bear a resemblance to letters of the Latin alphabet, and the same goes for letters in hiragana and katakana (Japanese) and indic-derived writing such as the Thai script. (I'm not sure what you mean by Indonesian and Vietnamese, as both use the Latin alphabet.) There is no obvious way you can apply this to hangul. Demonstrating why this is so would be a bit involved, but maybe you can try to look for samples of Korean writing and figure out for yourself why.\n\n"
    },
    {
      "time": "24 May 2008 — 10:02am",
      "content": "\"...but maybe you can try to look for samples of Korean writing and figure out for yourself why.\"\n\nThat's what I did, and that's why I'm here. With my finite 'creative-layman-talent' I'd probably need a couple of years to get that figure out, lol.  \nSo while I'm at it, I'm more interested in finding out how / where to get such typeface.\n\nBut I supposed you meant to say it doesn't exist coz of it's, uhmm...specific characteristics/elements? Yes?\n\n"
    },
    {
      "time": "24 May 2008 — 4:59pm",
      "content": "I don't even think I'm going out on a limb when I say that in all likelihood, the kind of typeface you're looking for does not exist. The difficulty level of assembling a faux-Korean Latin-alphabet typeface would be close to that of designing a Latin-alphabet typeface by picking flags of different nations to stand for each of the letters. To make it work, you would have to deconstruct the source material to the point that it would no longer be recognizable.\n\nNow, what you're looking for _might_ work with a very simple and short combination of letters, as for logos. The hangul glyph 티 could stand for 'El', perhaps, and 애 for 'OH'. But we are talking about a really, really limited application here, and I don't see how a whole typeface could come out of this.\n\n"
    }
  ]
}
