{
  "id": "45708",
  "title": "Stone on Type vs Writing",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The latest “Letterspace” newsletter of the TDC (Type Directors Club) has a fascinating piece on type history called “The Conceptual Basis of Type Design.”\n\nIn it Sumner Stone argues that the Jenson and Griffo made a fundamental break with scribal tradition, to letter designs that were critically dependent on the sculpting of metal, rather than on purely pen-written shapes. As this is what I was arguing in [the lengthy “rule or law” thread](http://web.archive.org/web/20081025052518/http:/www.typophile.com/node/37310), I was delighted to see strong support for this view.\n\nThe TDC is putting up past issues of Letterspace on its web site, so I suppose this essay will eventually be up.\n\nMeanwhile here is the argument in brief. In the early 15th century, scribe Poggio Bracciolini revived the Carolingian Miniscule (the basis of our lower case letters) and married it for the first time with Roman Capitals, rather than with Uncial or Rustic majuscules. However, Bracciolini did not do the Roman Capital style of serifs, following instead a style more natural to the pen, such as we see in the Lydian and Beorcana typefaces.\n\nLater in the century, other scribes tried to emulate the much admired Roman Capitals more closely, building the serifs with many strokes of the pen. They also sometimes put symmetrical serifs on the lower case letters, which had not been done previously.\n\nNow comes Stone’s new insight into the history. These later efforts were not really successful; they in fact were rather awkward. The reason is that the Roman Capitals, as Edward Catich showed, were originally painted—built up with a broad brush, not a pen—and then the painted part was carved out of the stone. Because the Capitals were really a painters’ and carvers’ style they couldn’t adapt very well to the fixed width pen.\n\nThis situation changed drastically with the introduction of printing and punch cut letters. Here the sculpting of letters in metal could emulate the fine, symmetric serifs of Roman Capitals, and put fine, tapering serifs on the lower case, to match the caps. Jenson started this and then Griffo completed the story with more fully symmetric serifs on the lower case. These styles more fully and successfully married upper and lower case letters.\n\nStone explains: “[The structure of the lower case] remained closely related to the pen-written letter, but thin, symmetric foot serifs replaced the thicker asymmetric pen versions and there was an increase in the overall formality of the miniscules.\n\n“Thus, unlike Gutenberg and other early printers who used blackletter forms, the designers of the first roman types did not directly imitate contemporary scribal models. They used the freedom inherent in the new process of engraving punches to construct a new design in which the forms of the Roman capitals were more closely based on Roman inscriptional models and the lower case, perhaps a bit grudgingly, was made to adopt some of the features of the new/old capitals.”\n\nIn that earlier thread, I was more concerned with modifications of writing for the sake of even color in type. However, in any case Stone’s argument here indicates that the influence of “The Stroke” of the pen, while still very important in the development of type, is somewhat less so than what G. Noordzij indicates in his book of that name, and painting and carving have had a larger influence on the evolution of type design.\n\n [‹ Serif that compliments Officina](http://web.archive.org/web/20081025052518/http:/typophile.com/node/46822 \"Go to previous forum topic\") [TypeCon Blogging ›](http://web.archive.org/web/20081025052518/http:/typophile.com/node/46774 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025052518/http://typophile.com/user/1551\" title=\"View user profile.\">William Berkson</a>",
  "time": "<br>",
  "uid": "1551",
  "comments": [
    {
      "time": " 25.May.2008 11.36am",
      "content": "Sounds fabulous, I’ll have to ask around and see if someone has an issue I can borrow.\n\n_However, in any case Stone’s argument here indicates that the influence of “The Stroke” of the pen, while still very important in the development of type, is somewhat less so than what G. Noordzij indicates in his book of that name…_\n\nWhen I read that section of _The Stroke_ I thought it seemed stretched pretty thin, a logical path carefully crafted only _after_ its destination was determined.\n\n"
    },
    {
      "time": " 25.May.2008 1.35pm",
      "content": "I suspect the reality is far more mushy.\n\nI have seen a reasonable amount of of pen based lowercase that looks quite a lot like Jenson and Griffo’s work.\n\nThis isn’t the only one or even the best example but it’s a start:\n\n[http://www.flickr.com/photos/ebensorkin/1553408656/in/set-72157601975232...](http://web.archive.org/web/20081025052518/http:/www.flickr.com/photos/ebensorkin/1553408656/in/set-72157601975232363/ \"http://www.flickr.com/photos/ebensorkin/1553408656/in/set-72157601975232363/\")  \n [http://www.flickr.com/photos/ebensorkin/1550029204/in/set-72157601975232...](http://web.archive.org/web/20081025052518/http:/www.flickr.com/photos/ebensorkin/1550029204/in/set-72157601975232363/ \"http://www.flickr.com/photos/ebensorkin/1550029204/in/set-72157601975232363/\")\n\nThe part of this post that seems somehow fishy to me is the idea that the Roman Capitals were really a problem for the pen. They were not made the same way by the pen exactly. And punchcut they are also not quite the same either. But I don’t get a sense of a problem in either case. The Roman caps of Jenson and Griffo maybe have been harmonized by sharing a technique of production as much or more than as a result of an intellectual or deliberate effort to harmonize somehow these forms that were especially hard to marry. So this heavy emphasis on models in all cases seems like a red herring to me - at least so far.\n\nMoreover the ideas of Edward Catich are ceratinly to accepted by everyone. In fact, James’ comment about the the ideas in ’the stroke’ “a logical path carefully crafted only after its destination was determined” seem to apply at least well in case of Catich. The opposite view being that in fact it is perfectly possible to arrive at the shapes of Roman letters simply by the application of a chisel. That you can after the fact create a representation with a brush proves little. In short, it’s a chicken or egg problem.\n\nMy take is that the break with the scribal was a slow process of letting go not sudden “fundamental break ” that shows up in the twinkling of an eye. Unless one man’s lifetime is seen as sudden.\n\nThe fundamental problem with these kinds of statements too is that the 15th & 16th century is have perhaps the very most diverse kinds of scribal hands in use of any period. This sheer diversity makes any simple or easy to understand narrative sound suspect from the outset.\n\nI may have the wrong end of the stick on this. But that’s how it looks to me just now.\n\n"
    },
    {
      "time": " 25.May.2008 2.26pm",
      "content": "Eben, just so you have what Stone actually says about the Roman inscriptions, here it is:\n\n“The tool for laying out inscriptions was a flexible flat brush, and the letters in inscriptions were both fewer and larger than those in manuscripts. Although the overall impression of the Imperial forms is that they were made with an edged tool, the details, like the serifs and the subtle changes in weights and connections of strokes clearly distinguish these stately letters from pen-written manuscript forms. The ancient letters were then carved into stone, a step which allowed for additional refinement”\n\nStone’s point I don’t think relies solely on Catich being right. It is rather the distinguishing features of the actual carved vs manuscript letters—and then those cut in metal. Stone’s article is copiously and aptly illustrated, and to me the illustrations make his case pretty convincing.\n\n"
    },
    {
      "time": " 25.May.2008 3.07pm",
      "content": "I had better read the original. You are right. I wonder if it’s something a library can get me.\n\n"
    },
    {
      "time": " 25.May.2008 5.35pm",
      "content": "William, or should I say Sumner\n\nWrong wrong wrong! The forms of the “brush” written caps are easily emulated by a pliable (quill) pens that are used with a pressure/release and angle manipulation techniques. Arthur Baker (and any calligrapher worth their salt) has spent a lifetime espousing this, AND proving it with both his original and fine art work. Yes the larger forms avail themselves to even finer nuances (with size) but the results are the same!!! All you have to do is watch Zapf work at small sizes and your mind would be changed.\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 5.47pm",
      "content": "Michael, didn’t the pointed, flexible tip pens come later? That is, they weren’t used by scribes in the 15th century, right? If so the point (!) holds.\n\n"
    },
    {
      "time": " 25.May.2008 6.06pm",
      "content": "Here are two examples of less that .5 inch lettering done with chisel edged pens with manipulation which rival the nuances of the LARGE Trajan caps. The pointed pen is irrelevant in the making of Roman Caps. The chisel edged pen was employed long before the 15th century(!)\n\nMichael\n\n ![](http://web.archive.org/web/20081025052518im_/http:/typophile.com/files/Caps_5676.jpg)\n\n"
    },
    {
      "time": " 25.May.2008 6.47pm",
      "content": "In actuality writing on a surface akin to paper occurred in the 3rd century before Christ. The Greeks had it all.\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 7.07pm",
      "content": "I’m confused - that (C)OUNTRYSID(E) example is clearly “filled in” areas with a small pen, no? That is, the “strokes” of the letters are not “strokes” of the writing tool; so really it’s more akin to the use of a brush that Sumner/Bill are writing about.\n\n"
    },
    {
      "time": " 25.May.2008 7.24pm",
      "content": "What I am fighting is the thought that the pre-brush/carved forms of the first century cannot be done in the manuscript tradition. THAT IS PURE B.S.\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 7.25pm",
      "content": "No it is writing with the lifting of the pen to create wells or blank spaces... in other words the etches are where the pen is lifted, more important is the modulation of the stems, waisting as in most Transitional faces or the Trajan Caps. The countrysides is straight out of the pen... there is no touch up! I.E. calligraphy as in manuscript! These are scans of original art. HEAVY pen manipulation. I.e. it can be done on a small scale!\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 7.27pm",
      "content": "Is the modulation in the letterforms not apparent?\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 7.43pm",
      "content": "Michael, I don’t think we’re on the same page here, because Stone and Noordzij are referring to the \\*writing\\* a scribe would do then, quickly and with the fixed width (not expansible) pen held at more or less a constant angle. They are not talking about built-up letters, as Eliason notes.\n\nBecause of the multi-colors it looks like your lovely “seasonings” is also built up, no? I am not a calligrapher, as you are, but I dare say that it is not possible to \\*write\\* in single strokes the ’seasonings’ letters even in one color with a fixed width pen held at a constant angle.\n\nYes, they did have a ’chisel’ or broad tip pen, going back in antiquity, but it was not particularly flexible until the 18th century, if I’ve got the history right.\n\nedit: I cross posted. I see that you made many strokes. Stone may be wrong, but I think you’re not getting the distinction between “writing” and built up letters, which is key for both Stone and Noordzij.\n\n"
    },
    {
      "time": " 25.May.2008 7.56pm",
      "content": "NO BUILD UP. The SEASONINGS was in fact done with a chisel edged pen and the colors were loaded as I progressed with the strokes, using both angle changes and pressure/release. Maybe you should avail yourself to the possibilities of the pen before you tell me I cannot do what I do..\n\nThe quill was used many centuries before and they were far more flexible than the NIBS of today!!! Compare the feather quill to metal and my point will be made.\n\nMichael\n\nP.S. They, the scribes did not use fixed pen angles. I will trot out the necessary info if I have to.\n\n"
    },
    {
      "time": " 25.May.2008 8.29pm",
      "content": "As far as the Countrysides\n\nI was merely trying to display a ductus OBVIOUS example of a titling piece that showed modulation and pen rotation (inherent in the piece) that, in fact, went beyond the brush inspired form of the Trajan caps. IT WAS DONE ALL AT ONCE with no going back. Original art! The incisions were an aside but pointed to the process of manipultion.\n\nI get tired of the banter that goes on about letterforms that is ill informed by people that have never picked up a pen, much less never made their living doing it!\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 9.07pm",
      "content": "I have a feeling that Sumner’s argument has a much deeper seeded meaning than is being glossed by most. After all he was a great calligrapher!\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 9.13pm",
      "content": "Michael, what is at issue here is Stone’s view that the letter forms of Jenson and Griffo reflect forms that are a product of built up letters, and not written letters. If you think the distinction between written and built-up is not valid, please explain.\n\nI admire your wonderful lettering and calligraphy, and calligraphic type faces. However, both Stone and Noordzij are also skilled calligraphers.\n\nIn “The Stroke” Noordzij says that rotation of the pen in writing only became into writing in 17th century “mannerism”.\n\nAlso the flexible, pointed split nib pen is said, for example [here in the Wikipedia article](http://web.archive.org/web/20081025052518/http:/en.wikipedia.org/wiki/Pen_nib) to have come into use only in the 17th century.\n\nBefore that the characteristic written letter forms, it is said in most histories that I have seen, were formed by a broad pen of fixed width moving at pretty much a constant angle.\n\nWith rotation and expansion of the nib of the pen—such as you are skilled at—you can get effects of built up letters, but neither were done until after the time of Jenson and Griffo, if these histories to believed.\n\nAre there histories which contradict these claims?\n\n"
    },
    {
      "time": " 25.May.2008 9.20pm",
      "content": "Wikepedia would not know its ass from a hole in the ground.\n\nI am not even talking about the split pointed pen.\n\nTHE CHISEL EDGED PEN The Roman Square Capitals of the 4th century!  \nIf these are not manipulated I am Santa Claus!\n\nRustic Capitals... ring a bell?\n\nYou want more.  \nMichael\n\n"
    },
    {
      "time": " 25.May.2008 9.26pm",
      "content": "In addition... How simple can I make it for you... I DID NOT BUILD UP THE LETTERS!\n\nWith skilled practice (which has been around since man picked up the pen) anyone can do it with varying degrees of success!\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 9.31pm",
      "content": "I am running out of beer so if you want to be right I am going to bed!\n\nShalom  \nMichael\n\n"
    },
    {
      "time": " 25.May.2008 9.43pm",
      "content": "Michael, I am just trying to communicate, and not doing a very good job, evidently.\n\nI don’t see in Rustic capitals any evidence of pen rotation. [Here is a Youtube video of writing Rustic Capitals](http://web.archive.org/web/20081025052518/http:/www.youtube.com/watch?v=8rtrfgSnGHw&fmt=18). The guy in this video holds his pen at a constant angle, never rotating at all that I can see.\n\nDo you mean something different about rotation of the angle of the pen?\n\nYou seem to think that rotation and expansion of pen tips has been around always as regular practice in writing. Everything I have read contradicts this. This is not a question of skill but of history.\n\n"
    },
    {
      "time": " 25.May.2008 9.54pm",
      "content": "If they were done with anything other than a Rotring pen and by someone who knew what they were doing with Rustic Caps the I would say you have a point. True Rustic Caps .... well these pale in comparison as far as the nuances. God bless the internet and its ability to spread ignorance.\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 10.07pm",
      "content": "Manipulation is the bedrock of letter forms. It is not a new thing! Please believe me. Whatever you are reading is so ridiculously wrong. Think about it, if you are doing Egyptian you have to turn the pen perpendicular to the stem to get a comparable weight serif. Hello. Pen manipulation!  \nIt has been around for at least 17 centuries!  \nBed... gone. Pick it up tomorrow.\n\nMichael\n\n"
    },
    {
      "time": " 25.May.2008 10.58pm",
      "content": "Bill, I have not read Sumner’s article (my copy of the newsletter has not arrived yet), but it seems to me that you are getting a little over excited when you say ’what is at issue here is Stone’s view that the letter forms of Jenson and Griffo reflect forms that are a product of built up letters, and not written letters’. At least, it seems that way from your summary of Sumner’s line of thought, because Sumner appears to be talking fairly specifically about serifs, i.e. stroke terminals, not ’letter forms’ in toto.\n\nI’ll just make a few very quick comments:\n\n1. The point about the difficulty of making classical Roman serif shapes with a pen — especially a reed or quill — is acceptable only within the context of scribal ’publishing’, i.e. document production, in which writing is expected to be fairly fast, even when the formal roman bookhand is being written. More slowly, and as often seen at larger sizes, such serifs can be formed with a pen, as countless calligraphers have demonstrated. So it is not a question of scribes being unable to make such forms with their pens, but of them typically making a different form in the humanist bookhand. In fact, I’d go so far as to say that the whole debate about whether this is possible is a red herring because what really matters is...\n\n2. ...the conscious decision by early type makers to model their serifs on the classical Roman forms rather than on the typical humanist bookhand serifs. I don’t think this is because there is anything specifically ’sculptural’ about these forms, though. I think they viewed these serifs as a classical ideal, something that resonated with the renaissance rediscovery of classical Roman literature and art and, as such, most appropriate to the subject matter of their books.\n\n3. But the letter forms themselves are still very much based around the stroke of the written forms, even as details become idealised. And it is interesting to note how this model persists: the structure of typographic letters and their characteristic contrast patterns continue to derive from written forms even as the tools of writing change (most dramatically in the 18th century), while terminals and serifs are subject to idealisation. So in the same way that we can observe someone like Griffo idealising the serifs while following the structure and ductus of the humanist bookhand, we can see Bodoni doing the same thing, three hundred years later, with a different writing model based on a different tool with a different ductus, treating terminals as balls and serifs as fine lines: the forms, in this case, suggested by the characteristics and abilities of the tool, but idealised in their typographic interpretation.\n\n"
    },
    {
      "time": " 26.May.2008 2.08am",
      "content": "I don’t know if it can be useful for your debate. I’ve found this example of capitals (from the Scuola Vaticana di Paleografia):\n\n ![](http://web.archive.org/web/20081025052518im_/http:/typophile.com/files/alcuin_5978.jpg)\n\nthis is from the ’Alcuin bible’ A.D. 800 circa.\n\n"
    },
    {
      "time": " 26.May.2008 5.11am",
      "content": "Thank you John!\n\n"
    },
    {
      "time": " 26.May.2008 7.11am",
      "content": "_I don’t think this is because there is anything specifically ’sculptural’ about these forms, though. I think they viewed these serifs as a classical ideal, something that resonated with the renaissance rediscovery of classical Roman literature and art and, as such, most appropriate to the subject matter of their books._\n\nOr they simply saw them as the nicest way to make letters, when the time factor of penning each one is annulled.\n\nInteresting pic, MiseEnAbime. The striking shift in style made me think at first that the title had to be a later addition! [Here’s another from the 9th c.](http://web.archive.org/web/20081025052518/http:/employees.oneonta.edu/farberas/ARTH/ARTH212/Carolingian_Culture/Caroline1.html).\n\n"
    },
    {
      "time": " 26.May.2008 7.23am",
      "content": "_In it Sumner Stone argues that the Jenson and Griffo made a fundamental break with scribal tradition, to letter designs that were critically dependent on the sculpting of metal, rather than on purely pen-written shapes._\n\nI would agree with Stone in the case of Griffo whose work clearly shows a sculptural sensibility, but not Jenson. His work is still tied to the idea of recreating a form rather than creating it. By that I mean that Jenson was looking at a pen letter model as a guide. Griffo was moving away from that idea as can be seen in De Aetna. There are variants of certain lowercase letters and some are — to my eye — sculptural and some still based on pen lettering. Griffo was apparently moving away from the pen model. The typeface of the Poliphili doesn’t have this same level of variance and the letters seem to me to be entirely sculptural. The difference is whether the letter is created positively as in pen lettering or negatively as in carving.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 26.May.2008 7.43am",
      "content": " **Michael** , when you write about my “telling you what you can do” you are completely misreading me. I am not talking about you as a contemporary calligrapher, but about historically what was actually done by scribes, not calligraphers—a category that I believe didn’t exist.\n\n[Here are actual Rustic Capitals](http://web.archive.org/web/20081025052518/http:/en.wikipedia.org/wiki/Image:RomanVirgilFolio014rVergilPortrait.jpg). To me they look like they were written with a broad pen, not particularly flexible, and with no rotation of the pen tip. Can you point me to where you think the pen must have been rotated?\n\nWere your “Countryside” letters made with a rapid zig-zag filling in the form of the letters? If so, that is exactly the kind of thing that Noordzij calls “building up” letters, and not writing. You keep not answering my question of whether the distinction between built up lettering and writing is a valid one. And you never give me any references to any historical facts that contradict what I have been reporting on my reading. After you answer, I think we can communicate better.\n\n**John** , I was focusing on the difference of Sumner Stone’s view from Noordzij’s. Stone still gives a big role to the influence of the written forms. But he does go beyond the serifs as part of the departure from writing. As I quoted earlier, he writes,\n\n“the details, like the serifs and the subtle changes in weights and connections of strokes clearly distinguish these stately letters from pen-written manuscript forms.”\n\nIn writing of the changes in weights and connections, I believe he is referring to the same factors that I argued in the earlier thread, which help even color and readability, as well as pleasing form.\n\nI thought you conceded that such manipulation was going on with Jenson and Griffo, and this did represent a change. Peter Enneson did write that perhaps Noordzij did err in not sufficiently such “feature manipulation.”\n\nAs to my excitement, that is just _joi de vivre_. Many of you English seem to think that enjoying yourself is _infra dig_ as English schoolboy slang has it, but I am unrepentant.\n\nThe question here is not whether the written forms were influential, which everyone agrees, but whether Jenson and Griffo made a fundamental change and advance. That Stone does seem to think so in the above quotation, and that the change was away from the written forms. Do you disagree?\n\n**George** , I cross-posted with you. I agree with you that Griffo is a more clear break, particularly on the serifs, but I think that Jenson has already headed that direction, though not so decisively. Both are, of course, still heavily influenced by the writting, as letters are still today.\n\n"
    },
    {
      "time": " 26.May.2008 7.58am",
      "content": "_Here are actual Rustic Capitals. To me they look like they were written with a broad pen, not particularly flexible, and with no rotation of the pen tip. Can you point me to where you think the pen must have been rotated?_\n\nDoes rotation have to occur during a stroke to count? The Rustic H’s I’ve seen have different thicknesses of their vertical strokes.\n\nEDIT: As [here, for example](http://web.archive.org/web/20081025052518/http:/www.ibiblio.org/expo/vatican.exhibit/exhibit/a-vatican_lib/images/vlib21.jpg).\n\n"
    },
    {
      "time": " 26.May.2008 9.05am",
      "content": "_Jenson and Griffo made a fundamental change_\n\nSweynheym and Pannartz made the first type based on humanist writing—Roman capitals plus Carolignian miniscules, after the Italian humanist style of writing.\n\nOne important innovation of Jenson’s lower case was the straight right side of the “h”. His contemporaries followed the scribal practice (both blackletter and humanist) of a curved right side.\n\n"
    },
    {
      "time": " 26.May.2008 9.33am",
      "content": "_I agree with you that Griffo is a more clear break, particularly on the serifs, but I think that Jenson has already headed that direction, though not so decisively. Both are, of course, still heavily influenced by the writting, as letters are still today._\n\nI don’t think that Jenson’s work was intentionally sculptural whereas Griffo’s clearly was. Griffo shows a much greater awareness of the interaction of positive-negative space than Jenson. Both were influenced by writing but ideas about form had changed between the time of Jenson — early High Renaissance — and Griffo — mid High Renaissance. Griffo was doing similar things with positive-negative space in his page layouts in the Poliphili and I think this came directly from his design practice.\n\nAnd I would disagree that letters today are “heavily” influenced by writing. Writing is about letter form and we’ve moved past designing typefaces based on form to a greater consideration of letter structure which has a much greater impact on contemporary design practice than writing does.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 26.May.2008 9.36am",
      "content": "The marriage of inscriptional capitals and pen-made small letters whether in handwriting or in type is not a perfectly happy one, and many of the artists who have turned their hands to designing typefaces have tried to undo it. At first there was doubt as to which should be the dominant partner and impose its idiom on the other. However, Jenson to a large extent and Aldus completely laid down a pattern of a consortium preserving the purity of the antique capitals and making the lower-case conform with them as best it could. Such was the prestige of Aldus and the skill of his punchcutter that this arrangement of the priorities has been the rule ever since.\n\nHarry Carter, _A view of early typography_ (1969), page 46.\n\n"
    },
    {
      "time": " 26.May.2008 9.57am",
      "content": "Eliason, Noordzij focuses on rotation within the stroke, which he says is mannerist, and not earlier. I don’t see a discussion of rotation between different strokes. Stone doesn’t discuss rotation.\n\nThe thicker right strokes of the H’s in your picture may be partly because they veer a bit to the diagonal, and perhaps are borne down on more. It looks like this is a deliberate effort to distinguish the H’s from two I’s or LI. The pen seems to be held at something like a 60 degree angle for this style of letters, (cf the Youtube video), so, contrary to the stone-inscribed Capitals, the verticals are generally lighter than the horizontals and diagonals also quite thick. I suspect rotation of the pen is not required.\n\nThanks, James, the quote from Harry Carter is apt. I would just expand on that by saying that the ’skill of his punchcutter’, apparently Griffo, is a mastery of design, as well manual dexterity. To cite just one example, the diagonals are lighter than they would be than if written by pen at a constant angle, and so more even color of the text is achieved.\n\n"
    },
    {
      "time": " 26.May.2008 3.41pm",
      "content": "I am going to respond to this and then I will have time with the family and get back on later!\n\nIT WAS ONE IN THE SAME. They too did titling, it was not about manuscripts totally. Proclamations, frontispieces, endispieces, etc, etc.\n\n"
    },
    {
      "time": " 26.May.2008 6.35pm",
      "content": "Dear William.\n\nAs I have said I think that the Stone argument has little to do with what we are discussing but you have a misguided sense of what is real and what is malarkey.\n\nWAISTING: in Transitional Roman this is achieved via pen manipulation, i.e. pressure at the beginning of a stem, release toward the center and pressure toward the end. Then you have a flattening of the pen angle in the exit... voila the serif. This has been around for umpteen centuries. It did not start in the 15th century. Throw away that research please.\n\nThe guy in the video. DO YOU WATCH NETWORK NEWS AND BELIEVE IT?\n\nHave you scrutinized his letterforms against the antiquities. I DON’T THINK SO, and neither did he! Because the forms(original) incorporate modulation, and have less staid nuances.\n\nAs to the Countryside... The letters were made in one continuous stroke, pen angle altered between between flat and 40 degrees which ultimately define serifs as well as the waisting in the stems. The incisions were achieved by rocking the pen during the process.\n\nYou need to get a pen and experiment... until you do you will sit and argue from an ivory tower position with no practical experience reading God knows who and I will keep banging my head against a wall.\n\nMichael\n\n"
    },
    {
      "time": " 26.May.2008 6.37pm",
      "content": "Bill: _The question here is not whether the written forms were influential, which everyone agrees, but whether Jenson and Griffo made a fundamental change and advance. That Stone does seem to think so in the above quotation, and that the change was away from the written forms. Do you disagree?_\n\nI don’t think the change was significantly ’away from the written forms’, at least not in terms of the text culture in which both print and manuscript, type and writing, were still very much in daily ’conversation’. As I wrote in the earlier discussion, I think the kind of features to which Sumner draws attention — treatment of serifs, of connection between strokes, of subtle variation in weight — are very important within a narrow history of typography and more specifically of typeface design. And perhaps they are most important in terms of being able to make letters _smaller_ while retaining open counters, clean connections and crotches, etc.. But the letter forms are still ’fundamentally’ the same as the written forms: the treatment of terminals are idealisations of the written terminals, the variations of weight are variations on a pattern established by the ductus of the pen, and the counters and crotches that are being given attention to survive the printing process as the same counters and crotches that result from the writing of the same letters. And I think one of the best ways to judge the significance of these innovations, in terms of moving away from the written forms, is to compare them to 19th century types that really do leave the chirographic models behind (and in many cases become ugly and difficult to read in the process).\n\n"
    },
    {
      "time": " 26.May.2008 7.13pm",
      "content": "I have seen so much disinformation in the past several decades. I was talking to a lettering buddy the other day and we got to giggling about how there has been much made of an album logo he did decades ago. Demonic it is said. He actually used some Bible pages as the inspiration! He said he finally went online to correct it but people would rather create false information than believe the truth.\n\n20/20 hindsight and critics. All BS.\n\nAs to the H. Could it be as simple as the H needed an entry serif on the left hence the lighter weight of the down stroke to compensate for that very serif. The right side was a more speeded up stroke and visually did not need a top serif so it was a simple “draw down” and manipulated to create weight at the base! Simple as that. Second nature to a calligrapher. No research needed. No need to spend millions of taxpayers money to figure it WORKED OUT JUST BEAUTIFUL. Just like using odd numbers in the garden.\n\nI have said 100000000000 times that the first stroke you lay down defines all the rest. Whether it is manuscript, logo or type design this is true.\n\nTo say that modulation has not had a place in letters since its genesis is just wrong! All you have to do is look at the development of the Aleph (Phonecian) to our current A, scratch to pen. Modulation all the way, and pen manipulation to boot, depending on the style.\n\nMichael\n\n"
    },
    {
      "time": " 26.May.2008 7.28pm",
      "content": "_19th century types that really do leave the chirographic models behind (and in many cases become ugly and difficult to read in the process)_\n\nWilling to name names? I’m curious as to what you have in mind with this.\n\n"
    },
    {
      "time": " 26.May.2008 10.52pm",
      "content": "_Willing to name names?_\n\nClarendon types are a good example of what I have in mind, while still being in the realm of ’normal’ typographic letters. Charles Ricketts’ Vale Press types are another, more extreme case.\n\n"
    },
    {
      "time": " 26.May.2008 11.41pm",
      "content": "Please, enough with the all caps already.\n\n"
    },
    {
      "time": " 27.May.2008 7.25am",
      "content": "\\>the treatment of terminals are idealisations of the written terminals\n\nSo you don’t agree with Stone, as I understand him.\n\nHe says that the symmetric serifs did not arise from any written form. It arose rather from painted and carved forms. If you accept that the distinctive treatment of serifs and weights in inscriptional characters doesn’t come from writing, then he has a strong argument, as the ideal wasn’t a written one, either ancient or medieval. Do you think that the distinctive features of the letters eg on the Trajan Column, that we don’t see in surviving writing, as I understand it, were actually written forms?\n\n\\>the variations of weight are variations on a pattern established by the ductus of the pen...\n\nI don’t want to quibble about what is ’fundamental’ or ’essential’, but what I do think is that Jenson and Griffo had a conscious goal of improving on their written predecessors, that they were willing to contradict the written models, and that they succeeded particularly in increasing readability.\n\nI do think that more upright forms with more even color, and at smaller size all increased readability. What you seem to be saying is that they were just trying to make letters that were just more perfect forms of written models. That I think flies in the face of the fact that they were willing to straighten eg the right stem of the n, as Nick points out, and systematically \\*contradict\\* the ’pen rules’ as far as the weight of diagonals.\n\nI am getting a deja vu experience here. When I studied history of science, I read how devoted Catholic Pierre Duhem argued strongly that modern science continuously evolved from medieval science. Alexander Koyré on the other side argued for the discontinuity of Galileo’s breakthroughs and the reality of revolution in science. I always thought that Koyré had the better of the argument. Jenson and Griffo’s innovations are no way as great as Copernicus and Galileo’s, but I still think there is a conscious and deliberate innovation going on.\n\n\\>To say that modulation has not had a place in letters since its genesis is just wrong!\n\nI never mentioned “modulation,” so I don’t know what you are talking about.\n\nNoordzij identifies three sources of modulation in the written stroke. First is “translation.” When a broad pen with fixed width and angle moves through a curve, the width of the stroke changes with the curve. This was always there. Second is “rotation,” when the pen is rotated on its axis, also changing the width of the stroke; he says historically this only came in a systematic way with mannerism. Third is “expansion,” where more pressure on the pen broadens the stroke, and which he says only came in a dramatic way with the pointed, more flexible pen tip. The pointed flexible tip pen culminated in the “copperplate” style of script, and influenced ’transitional’ style type design.\n\nIt seems you dismiss Noordzij as an ignoramus, as all of this went on since antiquity. I think you are flat wrong on that, but I am here to learn. If you can give some historical examples and analyze them concerning rotation and expansion, I’ll be happy to change my views.\n\n"
    },
    {
      "time": " 27.May.2008 9.29am",
      "content": "It seems you dismiss Noordzij as an ignoramus, as all of this went on since antiquity. I think you are flat wrong on that, but I am here to learn. If you can give some historical examples and analyze them concerning rotation and expansion, I’ll be happy to change my views.\n\nHOW DARE YOU PUT THOSE WORDS IN MY MOUTH! I have always been enamored with his work. One of the first books I bought was Lettering Today (USAF Library, DaNang AB) and his work is beautiful. You are not here “to learn.” You keep throwing this crap back in my face and misquoting me just to appear right... according to your readings!!!!!!\n\nAll three of the models you spoke of are examples of modulation! As to the third it is impossible to work with a quill and not avail yourself to the pliability of the tool. Why don’t you call it by the proper terms. Rotation is pen manipulation and expansion is pressure and release. Once again you have never used a pen!\n\nI am shaking the dust from my sandals buddy!\n\n"
    },
    {
      "time": " 27.May.2008 9.30am",
      "content": "Thank God. The angry calligrapher moves on to adorn some other blog comment section with all caps.\n\n"
    },
    {
      "time": " 27.May.2008 9.50am",
      "content": "Michael, Bill: As a moderator I think I see some smoke forming if not actual flames, so let’s keep the tone a bit more chill please.\n\nDon’t get me wrong, I am all for <cite> joie de vivre</cite> but...\n\nAs for my own view:\n\nI think that in the urge to make distinctions it is often the case that things are set out more starkly than reality offers them up to us. For instance I am recalling a presentation I saw at last year’s TypeCon where the fine art of the touch up or cheat in calligraphy was celebrated. Now at some point one of us might say, well that’s crossed the line! That’s not “pen formed”. But really it is. Just not in the “pure” sense. My point here is that there are distinctions to make, and they are important/meaningful. But what you call them, and here you make them is significantly up to you.\n\nAs for G Noordzij he definitely wasn’t interested in setting out anything hard & fast, just in offering a different lens, the lens of his practical physical observation. This is one of the reasons I like his work so much.\n\nMichael, keep in mind that while you <cite> can</cite> do nearly anything at all with a pen; I absolutely agree, the question of what was normally done by scribe in the 15th/16th century while hugely broad is not nearly <cite>so</cite> broad. There are distinctions to be had between that profoundly varied body of work and Jenson/Aldine type.\n\nNotice, also I am using cite tags to make italics not all caps.\n\nThe thing about the Jenson and Aldine letters are that they are a huge cultural touchstone. And what they did seems border on magic, partly because it was so influential, and partly because of the myth machines that have grown up around the actual work. And partly because it was a sort of visual genius. All this means that the urge to get in there and make your own interpretation is great. I should know. I am involved in that now too. But you have to be as skeptical and dispassionate as you can be. And show what you mean.\n\nBill, maybe you can show us what you mean by more even color in an example.\n\nWhat they did was complicated and changed over time. And just like you need to use a pen to get it - you need to see original Jenson & Aldine books to get a sense of them.\n\nAnd lastly, the simple distinctions of this is “pen based” and this is “typographic” and this is “carved” and so on are to my mind, growing less useful by the day. What I think would be more useful is to show the thing you mean, eg the visual distinction and avoid the urge to throw too much extra jargon over the top. Typographic and calligraphic jargon is mushy mushy stuff however much we may treasure it. And as such it has a wonderful use as grease to get conversations started - but not too much as grist with which to go deeper.\n\n"
    },
    {
      "time": " 27.May.2008 10.32am",
      "content": "Apologies to all parties for adding heat to the fire.\n\nGood observations from Mr. Sorkin, and since it is possible to add illustrations to these comments, by all means, please do — they would help much in a discussion such as this one.\n\nNow all I have to do is figure out which of the tags below produces italics.\n\n"
    },
    {
      "time": " 27.May.2008 10.54am",
      "content": "_which of the tags below produces italics_\n\nI use `<em>`.\n\n"
    },
    {
      "time": " 27.May.2008 11.37am",
      "content": "If you click on the link at the bottom of the page called “input format” it shows you the options.\n\n"
    },
    {
      "time": " 27.May.2008 1.27pm",
      "content": "\\>How dare you put those words in my mouth?\n\nMichael, this exchange has been disappointingly bizarre. I did not put those words in your mouth.\n\nYou said “Whatever you are reading is so ridiculously wrong.” I repeatedly said that I was reading Noordzij and Stone, and I kept asking you whether and where Noordzij had it wrong that in this period (Jenson and Griffo) writing was with a not very flexible broad nibbed pen held at a constant angle.\n\nYou kept not replying, and instead issuing tirades indicating that what I was saying was ignorant and absurd. So I just repeated and emphasized that as the views I reported were the views of Noordzij, and you were in effect dismissing Noordzij.\n\nPerhaps you will now respond to my questions, but I am not optimistic.\n\nEben, I have been very courteous in replying to Michael, whose work I respect. He has responded with tirades that have annoyed at least two people. When I point out that in dismissing what I have been reading he is dismissing Noordzij, you seem to find something improper in that. I don’t.\n\n"
    },
    {
      "time": " 27.May.2008 1.42pm",
      "content": "Bill, when you say “It seems you dismiss Noordzij as an ignoramus” it isn’t exactly inflammatory I suppose but it does seem like heavy rhetorical tactics. I am not interested in counting who is worse, or giving out black marks - just in encouraging all involved to have a little break and simmer down a bit.\n\n"
    },
    {
      "time": " 27.May.2008 3.04pm",
      "content": "Bill — I believe when Michael rails against some of your points, it is not Noordzij that he is dismissing (not always) but rather your very literal reading of some of Noordzij. I believe we all know that it helps sometimes to read GN with a grain of salt, because he has rhetorical devices of his own.\n\nSpecifically in this instance, I believe there is an inherent disconnect in yours and Michael’s discussion. When GN references the fixed-width pen, it is easy for many of us today to conjure an image of the stiff metal Speedball nib of our intro art classes. We therefore think of the fixed-width pen as “fixed” — i.e., inflexible.\n\nWhen Michael uses the term “quill,” instead, I believe he is doing it deliberately, because the fixed-nib pen of the era in question was in fact a prepared feather, a quill. As such, it is actually surprisingly flexible. Not nearly as flexible, and not in the same ways, as the later flexible, split-nib pen of the English writing masters. But more flexible than one might initially imagine.\n\nSo, it is not accurate (historically or otherwise) to assume that a fixed-nib pen has no flexion, no pressure-and-release, and that any waisting or other effects must necessarily be built-up and not written.\n\nI’m not reading back carefully over your statements to double-check that I am interpreting you correctly. If I haven’t been reading closely enough, forgive me.\n\nBut I hope this one observation might help bridge at least some of the gap.\n\n— Kent.\n\n"
    },
    {
      "time": " 27.May.2008 4.44pm",
      "content": "I never said Noordzij was an ignoramus. At least admit that.\n\nThe flexible pen did not cease to exist in Jenson’s time, and it existed for many centuries before his time. Manipulation was being practiced throughout this period.\n\nI said I was done if you got the Matthew reference.\n\nThank you Kent and Eben for your efforts. I said early on that there is more afoot than the literal reading of GN’s book, which I actually have in the first printing.\n\nAll the best  \nMichael\n\n"
    },
    {
      "time": " 27.May.2008 5.56pm",
      "content": "Kent, thanks for your post.\n\nI tried, though, to characterize Noordzij’s views accurately, not to endorse them without qualification.\n\nIn fact in my initial post here I said that Stone’s argument meant that Noordzij’s theories need qualification. I think Noordzij is open-minded in an unusual and to my mind good way. He is willing to make sweeping statements he thinks are right. But he invites discussion and contradiction, and welcomes it, thinking correction and progress will come that way. I invited Michael to explain where he disagrees with Noordzij—and with Stone—but he only responded with irrelevant personal attacks on my supposed state of abysmal ignorance.\n\nI also qualified my statement about the broad pen by saying it was ’relatively’ stiff. As I understand it, the feather quill pen cut to a relatively snub tip was much less flexible than the later pointed version, which was then replaced by highly flexible steel pens for the ’copperplate’ style.\n\nI was reporting on Stone’s views, which I quoted above. He I see was trained in calligraphy, as well as being the fine type designer we know. He says unequivocally that “This conscious departure [of Jenson and Griffo] from scribal models was a defining moment in the history of roman type design.” His view is that the characters, including serifs, of Jenson and Griffo depart from models of scribal pen strokes with the broad pen.\n\nAs I said, I have felt the same way for some time, though with no deep study of the issue. That’s why I was delighted to read Stone’s strong case for the ’revolutionary’ view. Now Stone and I may be wrong. But in Stone’s case if he is mistaken it is not for lack of knowledge of calligraphy, or, it seems, of history.\n\nedit: I cross posted with you, John. I’ll respond to your interesting post later.\n\n"
    },
    {
      "time": " 27.May.2008 5.58pm",
      "content": "Bill: _He says that the symmetric serifs did not arise from any written form. It arose rather from painted and carved forms._\n\nThey’re serifs. As such they are a standard feature of the humanist bookhand. They’re not something new, only something given an idealised treatment by making them closer to classical inscriptional form. Since the serif of the manuscript bookhand also owes its origin to the classical serif, I don’t think the detail of the treatment is very significant.\n\nAgain, what I think we need to remain conscious of is that we’re talking about a single text culture, with simultaneous and parallel manuscript and typographic forms. There’s a tendency to portray print media as revolutionary and progressive, but I think that is basically bad history and overlooks the degree to which the material form of that media is well established by the manuscript tradition.\n\n_I don’t want to quibble about what is ’fundamental’ or ’essential’, but what I do think is that Jenson and Griffo had a conscious goal of improving on their written predecessors, that they were willing to contradict the written models, and that they succeeded particularly in increasing readability._\n\nI think they had a conscious goal of producing books in a format and style suitable to the subject matter and tastes of Italian humanism. I’m not going to guess whether they ’increased readability’ because we don’t know very much about renaissance reading habits, in print or manuscript. What we can say is that succeeded in making the standard size of text smaller than it had generally been previously, because that is observable.\n\nRe. Noordzij and rotation:\n\nWhen Noordzij writes about rotation and the stroke he is talking about writing styles based around rotation, which is the characteristic development of mannerist writing. That is, he is not talking about rotation as a phenomenon within writing but as a strategy that is central to a particular kind of stroke and hence to a particular kind of writing. Noordzij is also talking about rotation _in the stroke,_ not rotation in the transition between strokes and not in the treatment of terminals.\n\nThere are three kinds of rotation that can occur during the act of writing: unconscious, deliberate and habitual. The importance of unconscious rotation can be demonstrated by having a robot write a translation based style such as the humanist bookhand with a broadnib pen, or using a fixed angle broad brush stroke in a computer drawing program. Even a strongly translation based style such as textura blackletter, written by a human with a handheld tool, is full of modulation caused by minor and largely unconscious rotation.\n\nDeliberate rotation involves consciously rotating the hand or arm during writing to achieve particular affects. One of the most obvious examples is the creation of a thin hanging terminal to a translated horizontal stroke or curve, e.g. at the top of an uppercase C G or S (as in the ’SEASONINGS’ example above). Note that the pen never leaves the page to create these forms: they are not ’built up’, but are true terminals to the stroke, made in a continuous movement.\n\nHabitual rotation is what happens when a scribe has internalised deliberate rotation as a feature of writing, so that it happens unconsciously as he or she writes, allowing speed and confidence.\n\nWe’re in an unfortunate situation in the West now, in that we don’t have a professional scribal class anymore. We have calligraphers, but calligraphy is really art made with letters and words, not text for reading of the kind that is produced on a quotidian basis in a manuscript society. This makes it somewhat difficult for us to judge what might be possible, or not possible, in the context of a formally written manuscript hand, produced by an experienced professional scribe who spends everyday producing text in this hand.\n\nBut we do have the recent evidence of one of the world’s last surviving major manuscript cultures, in Pakistan and India, where until recently many newspapers were produced by professional scribes in the Persian nasta’liq style of Arabic script. Now it happens that the nasta’liq script uses a fourth kind of stroke that Noordzij does not describe, presumably because it has not been a feature of European writing (although I fully expect that examples of it can be found in the work of European and American calligraphers, who have experimented with tools and techniques beyond the European scribal heritage). Nasta’liq is written with a broad nib reed, like other Arabic scripts, but one of the characteristics of the style is the systematic variation in weight between letters; the thinnest strokes are not achieved by either translation or rotation, but by lifting one corner of the nib. [If the characteristic stroke pattern of the European pointed split nib is called by Noordzij ’expansion’, perhaps the stroke model of nasta’liq might be called ’contraction’, because the fixed width of the broad nib is contracted by removing part of it from contact with the page.] In writing nasta’liq, the scribe must perform a number of extraordinary feats: writing starts above the baseline and letter clusters slope downward, so he must anticipate the depth of the full letter cluster as he starts to write it so as to end in the correct relationship to the baseline; alternating stroke weight is also reckoned backwards from the final letter, which is never thin, so he needs to determine the number of varying strokes across the letters in the cluster and start with the appropriate weight; as with all the major Arabic script styles, consistency is an expectation, so he must be able to produce the same shapes in exactly the same way, time after time, day after day.\\* And in the midst of this, he must perform one of the trickiest manipulations of the pen, lifting and lowering a corner of the nib repeatedly at just the right moments. In order to write with speed and confidence, all these things need to be internalised and habitual.\n\n\\*I have a splendid example of two _bismillah_ in nasta’liq style written by the Turkish calligrapher Kemal Batanay that demonstrate the virtue of consistency: they are written twenty-two years apart, and are all but identical. These are calligraphs, of course, not scribal text, but the consistency they demonstrate is an expectation of the style, not of the writer. In something like newspaper production, there is a secondary need for consistency, because the identities of the different scribes should not draw attention.\n\nSo I’m wary of making claims about what scribes, in renaissance Italy for instance, could and could not do. I think one needs to look at a lot of examples and then talk about what they _chose_ to do. The choice might well have been influenced by ease or efficiency, but that’s something different from manual or material restriction.\n\n"
    },
    {
      "time": " 27.May.2008 6.14pm",
      "content": "Holy smokes John... You must be a closet lettering artist!\n\nYou know that scribes, calligraphers or lettering artists are all the same. The defining factor is the length of the text. ; ) That was a super major wink!\n\nAs to the pliability of current pen nibs, the feather quill is so much more “pushable” than any metal pens of any era.\n\nThink about it... cartilage vs. metal\n\nKewl dude!\n\nMichael\n\n"
    },
    {
      "time": " 27.May.2008 8.45pm",
      "content": "Well William and I spent a good bit of time on the phone this evening and he agrees that I am opinionated, a curmudgeon and a hard person to get along with. Not only that but I was wrong about anything and everything, except the really important stuff or maybe it was everything!\n\nWe were talking at cross purposes which we will not tell any of you about. We have solved the world’s problems and will have a press release on the Today show tomorrow.\n\nGood night America!\n\nMichael\n\n"
    },
    {
      "time": " 27.May.2008 8.53pm",
      "content": "P.S\n\nWilliam, I am sorry.\n\nMichael\n\n"
    },
    {
      "time": " 27.May.2008 9.02pm",
      "content": "As usual, Michael gets it wrong. I said not that he was a hard person to get along with, but a sweet guy and very interesting—on the phone!\n\nMichael clearly does think that historically there was a lot more going on by way of rotation and expansion—aka manipulation and pressure-and-release—historically than in Noordzij’s schematic history.\n\nBut how much I am still left wondering.\n\nThe issue of how much Stone’s essay is right or wrong relates more to what scribes were actually doing in the 15th century, and how different and in what way were Jenson and Griffo.\n\n"
    },
    {
      "time": " 27.May.2008 9.13pm",
      "content": "You don’t think Griffo and Jenson had a thang goin’ on do ya?\n\n"
    },
    {
      "time": " 27.May.2008 10.10pm",
      "content": "thi  \nnger\n\n"
    },
    {
      "time": " 27.May.2008 11.43pm",
      "content": "Bill: _The issue of how much Stone’s essay is right or wrong relates more to what scribes were actually doing in the 15th century, and how different and in what way were Jenson and Griffo._\n\nAccording to your summary (still no sign of the newsletter in my mailbox), one of Sumner’s statements is that the classical form of serif could only awkwardly be made with the pen (which, by the way, may as often have been a reed as a quill; there is a famous portrait of [Erasmus by Holbein](http://web.archive.org/web/20081025052518/http:/www.abcgallery.com/H/holbein/holbein11.html), in which he is depicted holding a reed pen). If this is accurate reporting, then this is at issue, even if you don’t think it is the core of the matter. If this is at issue, then so is the notion that there is something ’critically dependent on the sculpting of metal’ in Jenson and Griffo’s innovations.\n\nI’m interested in the choices people made, and I’m interested in them because I think they were choices, not things that were materially dependent. In the case of serifs, I think we’re looking basically the same thing, regardless of whether were looking at manuscript or type: inclusion in the formal text style of these classical stroke terminations _which are not a feature of any preceding post-classical writing style._ In other words, they are as fresh and innovative in the humanist bookhand as they are in the humanist types. But the scribes want to be able to write quickly, and they make the serifs semi-bracketed and as a single movement perpendicular to the stroke, creating an asymmetrical form. The punch cutters have time on their side, since they making a single form to be reproduced many times, so can more closely follow the classical model. But the impetus is the same in both cases: to incorporate a feature of classical Roman lettering into their text style.\n\nI think we’re probably making a mistake if we try to make sense of this period in terms of type either copying writing or, alternatively, breaking away from writing. We’re talking about a relatively short period during which developments in writing and typography were happening almost simultaneously, and both were happening in a very specific literary context, in which makers of books — whether manuscript or print — were looking for appropriate forms for classical works and new texts inspired by encounter with those works.\n\n"
    },
    {
      "time": " 28.May.2008 6.27pm",
      "content": "John, you raise some interesting questions in your comment.\n\nFirst, what Stone actually says about the attempts at Imperial majuscules later in the century is: “if they are viewed as attempts at a faithful rendering of the inscribed Imperial forms we must judge them to be noble attempts, but in the end rather crude approximations [illustration]. ...The use of the file and graver combined with a considerably slower pace ...allowed the punch cutter to craft forms which imitated the original inscriptional letters more accurately...”\n\nHe doesn’t go into what was a limitation of the pen, of necessary speed of the scribe, etc.\n\nBut what I do think is worth mentioning here, and I suspect from what he writes that he would agree, is that the tradition in letters was not only a matter of pen writing by scribes. There was also a tradition of painted and stone incised letters. This I think is a point made by James Mosley with regard to the evolution of the sans serif: the sans came first with sign painters.\n\nThat’s one reason to think that Noordzij’s schematic history of the control of type forms by ’the stroke’ of the pen leaves out something important. Here what we see is the imitation of forms that likely evolved out of a display type with different different practical and aesthetic demands than the text letters of scribes.\n\nAs to what extent they thought they were breaking away from writing, I would guess that three things were going on.\n\nOne is that they wanted to capture the aesthetic of the Imperial Caps, with their great dignity and elegance. And they knew that they were not from any scribal hand that they knew about, though contemporary scribes were then trying to imitate them.\n\nThe other thing that was going on is that they felt, perhaps from the Roman incised models, that a different and superior look could be achieve by altering weights and connections from the normal pen forms. Whether they where thinking at first in terms of aesthetics only, or readability as well, I don’t know. But I do think they clearly knew they were not imitating writing, as I’m sure they could all write those formal hands, and knew their pen formed shapes intimately.\n\nFinally, as Peter Enneson argued in the other thread, once they started doing type, with its uniform repetition of shapes, issues of what modifications enhance readability, especially at small sizes, would have been thrust upon them, as we know from designing type ourselves. As Peter pointed out, if I remember rightly, the natural variability of hand writing doesn’t push forward issues of evenness of color in the same way as 26 endlessly repeated letter forms.\n\n"
    },
    {
      "time": " 29.May.2008 4.13pm",
      "content": "William, I wish you would rely more on your own observations of the visual evidence, and less on the great words of others.\n\nTo me this seems obvious: There isn’t (and wasn’t) a hard, binary distinction between brush, chisel-pen and other kinds of letters. As John points out, scribes, stonecarvers, and punchcutters all had choices about how to shape their letters. Various scribal styles emphasized certain features; Uncials were highly rounded with a flat pen angle (yet not a constant, fixed angle), Capitalis Quadrata was much like the inscriptional roman, but pen-written. Maybe not in very lengthy texts, but then again, very much developed as a repeatable, scribal hand. The serifs which appear in the now-eroded inscriptions as “sculptural” may indeed have been outgrowths of a highly developed scribal tradition. Where did those brush-written caps come from? They didn’t appear magically without precedent. These inscriptions aren’t divorced from this scribal tradition if the tool making the strokes happens to be a brush. The brush can have a chisel point. We also don’t know for sure that it was a brush. The smoking brushes have not been found. Maybe it was a big wide wooden chisel dip pen. Those Trajan caps exhibit a cornucopia of pen tricks.\n\nThe rustic capitals do indeed involve pen rotation; nearly any style of calligraphy/script/lettering will require pen modulation and/or rotation. Get clearer examples so these details can be discerned. Look at uncials, quadrata, rustic caps, textura, fraktur, etc. Even better would be to try to imitate great historic examples of them. Not easy getting those shapes just holding the pen at one angle is it? Certain styles demand it, others not at all. But it’s the chosen style that dictates, not the tool.\n\nNote that all these can be written (yes, like handwriting) using either a soft goose quill, a metal calligraphy nib, a fountain pen, and any number of other tools; since it isn’t the tool driving the style, stroke angle, pen rotation or stroke widths (see John’s discussion of Nastaliq, and even more, **look** at some Nastaliq writing), it must have been the writer’s choice that determined those shapes and the appearance of the writing.\n\nThe tools don’t enforce any kind of stylistic choices, certainly not pens of various materials or brushes. it’s the tools and materials of typefounding that we can regard as comparatively restrictive, and yet still a great spectrum of choices was available to early typefounders. From Gutenberg to Griffo we see this. They could choose to mimic scribal forms, which some of them clearly did, and they could choose to idealize or abstract scribal forms, which some also did.\n\n"
    },
    {
      "time": " 29.May.2008 8.35pm",
      "content": "Carl, I don’t have calligraphy experience, but I do use my eyes. I am generally fascinated with history of ideas and innovations, and my eyes tell me that Jenson and Griffo made an important advance. But what exactly the advance was, and how it came about is not so obvious. That’s why I’ve read with interest others who have studied this. I’m not relying on them alone, but I’m trying to learn from them.\n\n\\>tools don’t enforce any kind of stylistic choices, certainly not pens of various materials or brushes.\n\nI don’t really agree with the thrust of your argument, even though your statement here is probably strictly speaking correct: there is no strict “enforcement” of a style. Enforcement, no, but influence, even big influence, yes.\n\nMy eyes and experience do tell me that tools often have a big affect on style. If you are building with stone or wood it makes a difference how the structure is built, even though in theory you can make one look more like the other. The styles of building that evolve from one building material and another tend to be distinctive.\n\nIn the area of writing, when I visited China I saw the influence of the brush vs the pen quite dramatically. I saw hand painted signs all over the place. They were always competent, and often quite well done. The reason is that writing characters with the pointed brush is a traditionally important part of education in China—it goes together with brush painting. But when Roman characters were written with the pointed brush they almost always looked awkward and even childish. The pointed brush just doesn’t lend itself very well to writing Roman, which is mainly influenced by the broad pen. And the writers just didn’t know ’pen rules’ well enough to make the pointed brush to do what would indeed be quite difficult to do with it anyway.\n\nSo I do think that tools have an important impact on writing style. How much of a role they played here, I am not clear, but I tend to think from Stone’s illustrations that the use of brush painting and/or stone carving did have some influence.\n\n"
    },
    {
      "time": " 29.May.2008 9.56pm",
      "content": "My copy of the _Letterspace_ newsletter arrived today, and I have read Sumner’s article twice but want to read it a few more times before writing in response to it. I want to try to be very clear about how I agree with his analysis while still thinking that he overstates his conclusion.\n\nIn the meantime, here is something else I read today, from Gerard Unger’s recent little pamphlet _Typografiw als voertuig van de wetenschap_ (in Dutch and English):\n\n<cite>Letters and the ways in which they work together as words and texts have taken on their shapes in the hands and minds of sculptors, writers, and typographers essentially on the basis of ergonomic concerns. Prior to the development of typography, the shapes of letters and the basics of typography were largely fixed already in manuscripts. This pertains to type areas, type sizes, interlinear spaces, and many other conventions. During the subsequent period covering over five centuries the typographic system has been further refined and enriched.</cite>\n\nThis encapsulates nicely the context in which I believe the development of typography should be viewed: as part of a much larger and longer engagement between text and reader, in which the innovations of typography present media-specific refinements, but not revolutionary developments or ‘progress’. In a note to this paragraph, Gerard directs us back to J.P. Gumbert’s essay ‘“Typography” in the manuscript book’, in _The Journal of the Printing Historical Society_ No.22 (1993)\\*\n\n\\*This, to my mind, is a prize volume of this series, since it contains not only Gumbert’s fine essay but also Peggy Smith’s excellent work on ‘The pre-history of “Small Caps”’.\n\nMore in a couple of days...\n\n"
    },
    {
      "time": " 29.May.2008 11.26pm",
      "content": "Compared with what came before, typography was a very indirect way of making words.  \nSo a design space was opened up between punchcutter and printer, in which was considered how delicate shapes made in metal matrices morphed into smudges of ink on paper.  \nIn this design space it became apparent that the shapes of the smudges were to a large extent independent of the qualities of the tools previously used to make writing or lettering, and dependent more on the way that punchcut forms morphed during the founding process, and subsequently the way that the ink shapes that were created on the surface of type further morphed when pressed into paper.  \nSo what happened AFTER the punchcutter “sculpted” the letters in metal was the primary consideration.  \nWhat punchcut shapes would eventually produce the most legible, most readable pages?  \nThe punchcutter/engraver could imitate the characteristic letter forms of pen and brush (as John notes, fast writing) , chisel, and even the punchcut lettering of goldsmiths.  \nAnd he could also make new forms specifically geared to optimize printed text.  \nSo type making emerged as a synthetic skill, dependent on the punchcutter’s execution certainly, but also with a strong element of design, creating a tool for another, the printer, to use.\n\nIn a way, the process may be likened to the (hypothetical) job segregation of lapidary lettering, with one person lettering by brush, for another to carve.\n\nThe scultping of metal isn’t particularly relevant, any more than the sculpting that occurs when the scribe trims his quill. Both are making the tool that makes the letters.\n\n"
    },
    {
      "time": " 30.May.2008 12.55am",
      "content": "The most significant way in which design came to the fore in typography was in meeting the demands of a modular system of shapes, in which each letter form was required to fit nicely with every other, without the luxury available to scribes of contextual adjustment. This is particularly evident in Jenson’s serif shapes, for instance the way the ear of his r fits against the following n, a, and v.\n\nThat modularity was a defining issue is even more apparent in the work of other Venetians, such as Lauer, who practically did away with serifs on the outside of letters, to better allow them to combine, in the phrase of Fred Smeijers, “like children’s blocks”.\n\nMany of Jenson’s letters, while ostensibly having the smack of chirography, are in fact almost impossible to duplicate with a pen—abrupt stroke weight transitions that defy adjustments of rotation and pressure. The main curve of his p is particularly mysterious in this respect, of chirographic origin in its angled stress, but at the same time anti-chirographic. (This may be seen in comparing Bruce Rogers’ working drawings of Centaur, which play up the scribal quality of the type, against the original.)\n\n"
    },
    {
      "time": " 30.May.2008 1.37am",
      "content": "Nick, would you put comments on this p please? Then I can better see what you mean. My initial take on what you are saying has to do with the fact that the round part of the does not narrow at the lower right as much as you would expect it to with a straight forward ductal model. Is that what you mean?\n\n[http://www.flickr.com/photos/ebensorkin/2460450283/in/set-72157604858114...](http://web.archive.org/web/20081025052518/http:/www.flickr.com/photos/ebensorkin/2460450283/in/set-72157604858114211/ \"http://www.flickr.com/photos/ebensorkin/2460450283/in/set-72157604858114211/\")\n\nor this one\n\n[http://www.flickr.com/photos/ebensorkin/2461284238/in/set-72157604858114...](http://web.archive.org/web/20081025052518/http:/www.flickr.com/photos/ebensorkin/2461284238/in/set-72157604858114211/ \"http://www.flickr.com/photos/ebensorkin/2461284238/in/set-72157604858114211/\")\n\n"
    },
    {
      "time": " 30.May.2008 1.38am",
      "content": "BTW - How would I get a copy of Letterspace? I have not had time to research into the question this week.\n\n"
    },
    {
      "time": " 30.May.2008 2.28am",
      "content": "<cite>BTW - How would I get a copy of Letterspace? I have not had time to research into the question this week.</cite>\n\nEben,\n\nCall Carol Wahler at the TDC office and ask if she can send you one. Whether you join the club or not I’m sure she’ll send you a copy. But joining the club would be a nice way to guarantee it. And then there is the TYpography annual that comes with your membership as well. (Not to mention the discounted entry and hanging fees, when you decide to enter the competition).\n\nI’m currently out of town, otherwise I’d be happy to send you my copy and pick up another at the TDC office.\n\nJamesM\n\n"
    },
    {
      "time": " 30.May.2008 8.23am",
      "content": "John, Unger’s quote does highlight the fact that so much about text was already in place because of long scribal tradition. As I have already agreed with you, much in type is derived from past writing. The question is what was new in the creation of roman type, and how new it was.\n\nI am not clear what Unger means by ’ergonomic’ in this context. Is this about ease of writing or ease of reading? At one of the TDC events a calligrapher pointed out to me that it is easier to write with slanted stems, but easier to read with vertical ones. —And that was one of the changes to the lower case by Jenson and Griffo.\n\nNick, thanks for the insights on the changes of Jenson. Peter Enneson brought up in the other thread about how repetition of characters changed the challenge to type designers. I really like your term ’modularity’, which captures the essence of the challenge. It includes both the repetition of identical characters, and that each must fit with every other character.\n\nYou are no doubt right that the letter fitting demanded by modularity influenced letter forms. But I think that also evenness of color was, as Peter argued, pushed forward as a problem by modularity. Also readability at small size was another factor, as I argued in the earlier thread—and John agreed with me on that one.\n\n"
    },
    {
      "time": " 30.May.2008 9.26am",
      "content": "Thanks James!\n\n"
    },
    {
      "time": " 30.May.2008 11.44am",
      "content": " ![](http://web.archive.org/web/20081025052518im_/http:/typophile.com/files/pen_5931.jpg)\n  \nHere’s what I mean by Jenson being “anti-chirographic”.  \nConsider the nib angle at the top left joint (the start of the main curve) in these three letters.  \nIn the p it’s almost horizontal, in the n has more of a slant, and in the h is almost 45°.  \nThis creates an unevenness, with three curves that have different entry angles and tightness (i.e. length of radius).  \nIt differentiates the underlying shapes of these three letters, rather than repeating any consistency that would be caused by straightforward writing, or a reductive design approach that would emphasize geometrical similarities in the shape of the curve.  \nSo why does such a disruptive effect work in type?  \nBecause of the subtle adjustments with which the variety of serif shapes and stroke weights counteract the variety of curve shapes and angles of stress, within the context of even colour. For instance, note how the counter of the h is wider than the counter of the n, to accomodate the extra weight of the upward diagonal which intrudes into the internal area.\n"
    },
    {
      "time": " 30.May.2008 12.48pm",
      "content": "Bill,\n\nWood, stone, metal are materials that buildings are made out of; the building **is** the material. Printing, writing and calligraphy are all traces of the movement or application of unseen tools. Quite different.\n\nWriters, lettering artists and signpainters in China may not fare well in producing latin letterforms because those shapes are foreign, unfamiliar and uncomfortable for them, not because brushes intrinsically cannot produce them. Look at brush lettering from Latin-speaking countries. Similarly, an American signpainter will have a hard time producing Chinese characters even using a traditional brush. It’s not the tool in your example that limits, it’s the writer’s inexperience with the forms. I think you are seeing a causality that is not there.\n\nYou discuss dualities like pen **or** built-up, scribal **or** sculpted, and I fear there is a disconnect between what you have read, and the actual, material processes being discussed.\n\n"
    },
    {
      "time": " 30.May.2008 1.43pm",
      "content": "_The serifs which appear in the now-eroded inscriptions as “sculptural” may indeed have been outgrowths of a highly developed scribal tradition._\n\nJames Mosley posted a relevant [blog entry](http://web.archive.org/web/20081025052518/http:/typefoundry.blogspot.com/2008/05/roman-tragedy.html) today.\n\n"
    },
    {
      "time": " 30.May.2008 2.31pm",
      "content": "Carl, it is true that wood and stone are building materials rather than tools, so the analogy is inexact, though I think the point is right.\n\nThe pointed brush, which I also mentioned, is, however right on point, and I think you are mistaken about the capabilities and limitations of the stiff broad pen vs the limitations of the pointed brush. I have had both in my hands, and they are extremely different animals.\n\nThe pointed brush is great at doing extreme expansion and contraction of the stroke, but is unaffected as to direction, as it is round. The stiff broad pen held at constant angle varies width with the direction of the stroke, but is quite limited in expansion and contraction. I think even a very good calligrapher who was skilled in both instruments would be very hard put to reproduce the stroke of the other instrument. The pointed brush might do it with extreme skill and knowledge of roman lettering, but some build up would be necessary, I think. To get Chinese brush strokes with a pen would be nearly impossible, I think. I mean without doing build-up, of course. The ’ductus’ of these two writing instruments is just extremely different.\n\nTrying to do roman calligraphy with a Chinese pointed brush or Chinese brush style letters with broad pen would be basically an exercise in frustration. (There are other styles of Chinese characters influenced by other tools, but that is a different matter.)\n\nA broad brush is, of course, much closer to the pen than is the round, pointed brush.\n\n"
    },
    {
      "time": " 30.May.2008 2.56pm",
      "content": "Nobody is saying that the two instruments don’t have different qualities, tendencies etc. What they are saying is that even with these fully intact, acknowledged and so on, you still can’t rule out a clever knowledgable user pushing past this tool oriented envelope. And pushing very very far. This ability to push past the tool’s tendency blurs things considerably. Now if it blurs things to the point that Stone’s point ( at least as presented by yourself - I will read the article as soon as I can - it is on it’s way now - this is not a dig) is weakened just a little or quite a lot is a judgement call. But until you acknowledge this envelope pushing is the issue - not the inherent qualities of the tools ( potent though they may be ), we will go around & around.\n\n"
    },
    {
      "time": " 30.May.2008 3.06pm",
      "content": "“The pointed brush, which I also mentioned, is, however right on point, and I think you are mistaken about the capabilities and limitations of the stiff broad pen vs the limitations of the pointed brush. I have had both in my hands, and they are extremely different animals.”\n\nBill, I’m not at all mistaken about the capabilities of various tools. I’ve made and used goose quill pens, reed pens, bamboo pens, cardboard, plastic and metal pens. I’ve also made and used various brushes, with various lengths, shapes and stiffnesses. Not to mention cut stone, metal and wood letters. It’s my lifelong familiarity with these materials and with the processes behind scribal production and typefounding that make me skeptical of your theories.\n\n“He says that the symmetric serifs did not arise from any written form. It arose rather from painted and carved forms.”\n\nThis must be the source of your insistence on treating the various tools as oppositional, exclusionary. That alone tells me that you need to read less, and fiddle with materials more.\n\n"
    },
    {
      "time": " 30.May.2008 3.28pm",
      "content": "\\>This ability to push past the tool’s tendency blurs things considerably.\n\nEben, I think you are missing the point here. The point is that craftsmen are influenced by their instruments. With enough practice you can scratch your right ear with your left foot, but chances you’re going to your right hand. The question is not what people could conceivably do, but what they actually did.\n\nThe shape of the Chinese characters was influenced by the fact that they were written with a brush. When they were scraped on bones they looked quite different—the “seal style”. And when they were carved in wood they looked somewhat different again.\n\nAre you telling me that these obvious and systematic differences are just accidentally related to the writing medium?\n\nSimilarly, the shape of Roman letters has been influenced by the tool they were written with for thousands of years, the broad pen. Are you denying this?\n\nIf not, then the question is whether people using brushes and chisels to do inscriptional letters influenced the shape of the Imperial capitals.\n\nIt seems to me a pretty reasonable question, and Stone’s answer is ’yes’.\n\nWhy do you think that his answer is wrong? What is your story of why the carved capitals show a different pattern from any surviving ancient written capitals—but rather more similarity with the painted caps that survived Vesuvius, as shown in James Mosley’s blog—thanks Craig for the “heads up” on this interesting post.\n\n"
    },
    {
      "time": " 30.May.2008 7.51pm",
      "content": "<cite> Are you denying this? ... Are you telling me that these obvious and systematic differences are just accidentally related to the writing medium? </cite>\n\nNot at all. I mean: not so much as an iota. I get that idea. I support it, believe it, and am frankly, quite deeply impressed by it. As are we all from what I have read here.\n\nBut look at the chinese brush: chinese glyphs require nothing so much as being built up; albeit in a special way only possible with that brush. These is absolutely no way that you can make a formal chinese character without some expert tweaking - eg the reverses and lifts required. Again, I am in no way stating that any other tool could make chinese characters the way the chinese brush does. I am saying something different. I am saying that the brush is far from being the only factor in the shapes that are made with it. A calligraphic culture is at work there. Think too of the enormous array of styles that the chinese brush is used to make. Far larger than with any other calligraphic tool I would say. So it isn’t a single character or direction or fate that the chinese bush offers. Not at all, instead it offers a profound flexibility - and I would say a profound need for envelope pushing. You could try coming back with talk about the running hand style but I don’t know that I can believe that it’s all brush logic there either.\n\nSo back to the latin. Nobody, as I said before, is trying to deny that the tool/medium is powerful. What they are saying though is that it is not \\*all\\* powerful and utterly determanistic. And in that wiggle room there is room to question your assertion.\n\nNow it’s my turn, surely you are not denying that an expert letter maker can and will often go past the simple ’logical envelope’ of his tool...\n\n"
    },
    {
      "time": " 31.May.2008 10.53am",
      "content": "\\>chinese glyphs require nothing so much as being built up\n\nThis is not correct, if by ’built up’ you use the term the way Noordzij and others do. Each stroke is done as a continuous movement of the brush. It is not built up of many strokes to fill in an outline, mental or drawn. Of course there are many strokes usually in a single character, but they are clearly separate. In fact, the Chinese dictionary is partly arranged by number of strokes, showing how clear and fixed this is—both the number and order, by the way.\n\n\\>surely you are not denying that an expert letter maker can and will often go past the simple ’logical envelope’ of his tool...\n\nYes, I am denying that if you are talking about scribes. They have a priority on producing a lot of text, and cannot take time to do something that is unnatural to the tool and highly time consuming.\n\nIf you are talking about an illuminated cap, then yes, they had time to build up an elaborate picture that may involve build up and a lot of manipulation. They may well have done that with pen, though I don’t know. My impression is that brush work was also used.\n\n"
    },
    {
      "time": " 31.May.2008 12.15pm",
      "content": "<cite> Of course there are many strokes usually in characters, but they are clearly separate. </cite>\n\nYes, clearly. But that is once again, not to the point. The point is to look at an individual stroke. If you do, you will see that even the simplest most basic stroke in chinese the horizontal one for “1” requires several culture specific, envelope pushing moves to complete it.\n\nOne, you have to press down the right amount to form the initial head of the “bone”. then, two you must lift the right amount. So far that’s two manipulations outside the tool’s basic envelope. Then you change direction twice ( not outside the envelope ) but you must also change pressure which is a manipulation or outside the envelope. Three. Then you join the reverse carefully so as to hide what has happened. Hiding the stroke is the most obvious and hallmark quality of being “outside the envelope”. That’s 4 culture specific, envelope pushing moves.\n\nIf you want to use architectural analogies then I think the urge to hide how something is made with trim to cover nails or bolts etc. vs. letting the bolts be seen is the better comparison. But even that fails to take up the equally salient manipulations that are not hidden per se but which are nonetheless clearly manipulations and not part of the simple tool logic.\n\n<cite> to do something that is unnatural to the tool and highly time consuming </cite>\n\nNot if it becomes habit. Cultural habits are very powerful. In fact, look at Chinese & Japanese running hand. When it’s good, it is really incredible. A tour de force really. But of what? Tool logic? Not at all! It’s a tour de force of manipulation. And the whole point is what? Speed and expression. The same can be true of arabic, armenian, latin, or any other system. If it exists in writing depends not on the tool but on the scribe.\n\nDon’t get me wrong. There were plenty of so-so scribes too. I have seen their work. In it you can see plenty of tool logic. But it’s not all that there was all the time, even in longer texts.\n\n<cite>Yes, I am denying that if you are talking about scribes.</cite> It is true that you can do something just passable in latin writing without manipulation. Whereas in Chinese you have no hope whatsoever. That is a real difference. But I don’t think you will find a single scribal page that has no manipulations in it even if they are angle lapses or unintentional. People are not machines. So manipulation can’t be gotten rid of. Reality is not so pure as your idea. Influence is not destiny. This is a thing is grey.\n\n<cite> Why do you think that his answer is wrong?</cite>  \nI don’t. I haven’t read Stone’s piece. I am responding only to your ideas, and some some extent to your representation of Stone’s ideas so far. I might agree with Stone. It’s hard to say. The point is that there is some grayness here. Some blur. The role of manipulation is what causes it. But the point is, if I agree or disagree it won’t be some kind of black or white thing. It will a judgement call over a complex phenomena. My agreement or disagreement will accordingly be not absolute. It will be grey.\n\nThe reason I have disagreed with you as strongly in your thread as I have has to do with what I read as a pretty absolute notion on your part. It isn’t that what you are saying isn’t true. Far from it! It just isn’t the whole story. And that is even before anybody talks about punches and lead etc. Even before we talk about what sudden means. In short, this thing is grey.\n\nIn any event, there is a certain hubris in trying to convince you when John Hudson and Carl Crossgrove have not. So I will cease and desist. You can put me down as officially shrugging my shoulders. And most especially until I have read Stone’s article.\n\n"
    },
    {
      "time": " 31.May.2008 12.18pm",
      "content": "_They have a priority on producing a lot of text, and cannot take time to do something that is unnatural to the tool and highly time consuming._\n\nYes, as John said earlier, it’s a question of speed.  \nIf you’re writing briskly, you don’t have time to rotate the nib (which may result in reverting to a slightly different basic angle—and a sudden change of even a fraction of a degree would look bad), although there is time to do a little serif-like jiggle at the beginning and end of strokes, as Poggio did here:\n\n ![](http://web.archive.org/web/20081025052518im_/http:/typophile.com/files/Humanistica_5717.jpg)\n\n"
    },
    {
      "time": " 31.May.2008 12.57pm",
      "content": "\\>One, you have to press down the right amount to form the initial head of the “bone”. then, two you must lift the right amount. So far that’s two manipulations outside the tool’s basic envelope.\n\nEben, it’s not at all “outside the envelope” of what is natural to the brush. I really don’t see how you can say that the first thing every Chinese child is taught in brush writing is “outside the envelope.” It is one of the I think seven or eight strokes that all Chinese characters are made of.\n\nIf you look at [this video](http://web.archive.org/web/20081025052518/http:/www.youtube.com/watch?v=noBlKOw4OhA&feature=related) you will see two things.\n\nFirst the word “happiness” written with the round brush by a skilled Chinese calligrapher looks very clumsy, as I mentioned earlier is typical, as pen rules are violated.\n\nSecond, the writing of the first Chinese “Happiness” character begins with the “bone” stroke you write of, and is written like lightning, effortlessly with a flick of the brush. It is not some strain unnatural to the brush. The brush, being soft, has huge expansion and contraction natural to it. It does take a lot of practice to gain control of that expansion and contraction, but that is true whatever you want to do with a round brush. The bone stroke is not particularly more difficult than any other to gain control of.\n\nThe running ’grass script’ or cursive, also done with a brush I don’t see also violating the nature of the brush. None of it that I have seen done with the brush looks like the results of a pen or a chisel.\n\n"
    },
    {
      "time": " 1.Jun.2008 6.55am",
      "content": "I’m sorry to be a johnny-come-lately to this thread.\n\nHere is how I see the development I’m presuming Sumner seeks to narrate.\n\nAs a protoypical entity the serif is an arifact of the entrance and exit strokes of formal writing. Type designers from Jenson and Griffo on use it’s inscriptional manifestations in the Roman Inscriptional Capital as exemplars for their typographical fillings of the serif role.\n\nThe question: is what does this development signify?\n\nIs it fair to say it is a break with scribal tradition, or is it rather a break with the more literal paraphrase of scribal exemplars characterizing the work of their illustrious type design predecessors? Substituting instead an inscriptional paraphrase of an even earlier scribal tradition, mediated perhaps by the broad stiff brush, but formalized in sculptural terms beyond it. Even scribal tradition can be said to paraphrase when it sets out to adapt the form of the Roman inscriptional majuscule to the carolinian miniscule.\n\nIf his title is any indication, Sumner’s suggestion seems to be that the break away from literal paraphrase signifies a mental shift. This I can accept.\n\nI think Nick’s comment about matrix making opening up a space is essential, and John’s explorations of the force of the terms _fundamental_ and _critically dependant_ are very apt.\n\nNoordzij’s point is not a point about literal paraphrase but shape paradigms for contrast styling and construction. The contrast schemes and construction schemes imposed by writing with the broad-nibbed and later the straight pen remain fundamental in a paradigm-setting sense. In this sense a critical dependance on writing persists. [adding just after the fact] That a scultptural sensibility and a more acute awareness of the active significance and formal logic of negative space becomes apparent doesn’t undermine this critical dependance.\n\n"
    },
    {
      "time": " 1.Jun.2008 8.20am",
      "content": "Peter, in your post you don’t mention the subtle changes in weights and connections, as well as increased formality (verticality) that Stone mentions (quoted above). To me these are even more telling of a “mental shift”, which you say you can agree with Stone on. Using Imperial style serifs is only one of the features.\n\nThe historical point here, which I think some taking issue with Stone reject, is that the Imperial caps, done with brush and chisel, already showed a different approach than the pen written forms. These media, used with many fewer and also bigger letters had the freedom that the scribe didn’t have. And they altered the pen-natural weights, size and shape of serifs and connections to suit their aesthetic sensibilities. And that freedom was reborn in the punch cutting medium. That’s the new historical insight I found in Stone’s analysis.\n\nNick didn’t use the word “matrix”; are you speaking of his point that the “modularity” of type had a crucial affect on the designer? This was, as I mentioned, similar to a point you made in the earlier thread. I do think it is a second critical factor in the new approach to letters of Jenson and Griffo.\n\n"
    },
    {
      "time": " 1.Jun.2008 9.34am",
      "content": "_Nick didn’t use the word “matrix”_\n\n(He used “matrices” in the -29.May.2008 11.26pm- post.)\n\n"
    },
    {
      "time": " 1.Jun.2008 9.55am",
      "content": "The matrix is implicit when speaking of punchcutting.  \nI quoted Fred Smeijers, from his excellent book on the origins of type design, _Counterpunch._ (Hyphen, 1996)  \nHe mentions the broad reasons for the emergence of a synthetic typographic style of serif, but his main thesis concerns the role of the counterpunch. So, very “sculptural,” with the paradigmatic tool of the text medium changing from being a mark maker to a space maker.\n\n"
    },
    {
      "time": " 1.Jun.2008 11.44am",
      "content": "Bill, my suggestion is that the break Sumner documents is _ **not** _ **fundamentally** _ **away** _ from writing in the scribal tradition. A contrast scheme that it imposed remained in place and persists into the digital present.\n\nRather, the break is away from the earlier more literal paraphrase in type design of scribal exemplars. The development is augmentative, not radically transformative. The contrast scheme introduced by scribal writing persists but changes in weights and connections as well as increased formality are introduced, sometimes on the basis of historical precedents. The basic letterform is still critically dependant on writing in the scribal tradition. Nevertheless, the shift from strict paraphrase to feature-manipulative exploration atop a received contrast styling template is decisive — the flesh and blood of type design.\n\n"
    },
    {
      "time": " 1.Jun.2008 12.44pm",
      "content": "<cite> The development is augmentative, not radically transformative.... Nevertheless, the shift from strict paraphrase to feature-manipulative exploration atop a received contrast styling template is decisive — the flesh and blood of type design.</cite>\n\nReally well put.\n\n"
    },
    {
      "time": " 1.Jun.2008 1.48pm",
      "content": "\\>matrices  \nSorry, I did a search on ’matrix’ didn’t find it. Now I see that Nick was talking about the metal “mats,” the copper strips that had the punch driven into them. Yes, that makes sense. And I agree with you (and Smeijers)\n\n\\>The development is not fundamentally away ...is augmentative, not radically transformative.\n\nAgain, I don’t want to argue about ’radical’ which is hard to be clear about. But the change was, I think transformative, in the sense that it was conceptually significantly different than letter forms derived from writing with a pen.\n\n\\>The contrast scheme introduced by scribal writing persists\n\nThat’s what is mistaken, in my view.\n\nHere is an illustration of “pen rules” on an “A”: the thick-thin that results from a broad pen with no rotation or expansion.  \n.\n\n ![](http://web.archive.org/web/20081025052518im_/http:/typophile.com/files/Pen%20rules_3816.gif)\n  \n.\n\nNow look at the amazing painted letters buried at Vesuvius, posted by James Mosley on his blog.  \n.\n\n ![](http://web.archive.org/web/20081025052518im_/http:/typophile.com/files/Mosley%20Painted%20Letters_3796.gif)\n  \n.  \nNow notice how the pen rules are systematically changed, and the contrast pattern changed. The weight of the right diagonal of the A is the same as the bottom of the stem of the T. Pen rules would make it thicker. Note the cross bar of the A. It should be thicker than the left diagonal of the A following pen rules—it’s significantly thinner. But notice the graceful top of the T—it is thicker than all the other horizontals, violating the rules again. The diagonal of the R is, again, about the weight of the stem, not significantly thicker in its cross section, as it would be under pen rules. \n\nThis argues strongly, as Stone has written, that Jenson and Griffo were picking up a different way of looking at letters that comes not from directly from the pen, but from a significantly different tradition going back to antiquity, and derived from painted and carved letters.\n\n"
    },
    {
      "time": " 1.Jun.2008 2.06pm",
      "content": "Bill, you’re example doesn’t support the Stone thesis.  \nConsider blackletter, and in particular the _textus precissus_ style (with horizontal stem terminals on the lower case).  \nRatdolt’s specimen shows this (in fact, most of his fonts were blackletter or rotunda, not humanist: most incunabula printing was blackletter).  \nTo repeat, the more formal and slower the writing, the more scribes were inclined to invest time in pen rotation.\n\nThis shows a typical _rotunda_ hand with some lowercase vertical stems that have flat tops and bottoms:  \n [http://www.umilta.net/fege27.jpg](http://web.archive.org/web/20081025052518/http:/www.umilta.net/fege27.jpg \"http://www.umilta.net/fege27.jpg\")\n\n"
    },
    {
      "time": " 1.Jun.2008 2.56pm",
      "content": "Nick, you’re writing about the running text in black, not the illuminated caps, right?\n\nHow does the running text violate ’pen rules’? It looks to me similar to the illustrations by Noordzij of pen-made serifs on black letter, made without rotating the pen (in both the Stroke and Letterletter). The thick-thin patterns seem consistently following pen rules—thin lower left to upper right strokes, medium horizontals, heaviest, top left to bottom right diagonals, etc. Perhaps you could circle or highlight where you think rotation occurs. Some of the hair lines curve, but I am assuming that is drawing the pen barely touching the paper, right?\n\nIn the Vesuvius letters, advantage is taken of the brush not only to rotate a lot between strokes, but swell the stems, do sharp serifs (as pointed out by Stone), and the whole thing is upright, not slanted. Strokes, eg of the swelled stems, may be built up as well—I don’t know. I’d like to hear a sign painter like John Downer talk about how the Vesuvius painted letters were done.\n\n"
    },
    {
      "time": " 1.Jun.2008 7.08pm",
      "content": "Bill, are the Vesuvian painted letters you show part of Sumner’s argument?\n\nI’m not clear about what’s Bill and what’s Sumner in what you write.\n\n"
    },
    {
      "time": " 1.Jun.2008 8.10pm",
      "content": "Peter, in the beginning I tried to report accurately on Stone’s article, and quoted some bits.\n\nIn the course of the discussion I’ve added some of my own views, but tried to make clear when I was adding, or refering to Stone or Noordzij’s views.\n\nThe Vesuvian letters are not in Stone’s presentation, though he refers to the Imperial letters as laid out “by a flexible flat brush” followed by carving. I thought the graphic of the painted letters posted by James Mosley made the case even more strongly than the carved letters he shows, or those on the Trajan Column, which tend to have less thick-thin contrast than these painted letters, if I’m not mistaken.\n\nAs I quoted earlier Stone argues that “Although the overall impression of the Imperial forms is that they were made with an edged tool, the details, like the serifs and the subtle changes in the weights and connections of strokes clearly distinguish these stately letters from pen-written manuscript forms.”\n\nMy analysis of the differences between pen rules and the painted letters is intended to elucidate Stone’s point—using an illustration he doesn’t use—about the subtle changes in the Imperial letters that none the less show a conceptual difference from pen written letter forms. I could have taken a picture of inscribed letters, but I think the painted are even clearer.\n\n"
    },
    {
      "time": " 1.Jun.2008 8.18pm",
      "content": "Bill, as I understand it, a letter such as the lower case l (in the music sample I referenced) was made with a combination of rotation and pressure adjustment.  \nIt starts off at the top with the nib parallel to the baseline, but the pressure is not as great as those letters which begin with an angled stroke, therefore the width of the stroke is not as thick as it would be with the pen held at an angle and heavier pressure.  \nAt the bottom of the main stroke, the pen was rotated to the standard angle to finish the letter.\n\nOn the crossbar of the t, which ends with the terminal vertical, the pen was rotated from the standard angle to vertical, and eased up at the same time.\n\nHowever, I could be wrong about this, perhaps the scribe used a different technique, perhaps even two pens of different nib width.\n\nAt any rate, the flat-footed and perpendicular terminals of serif-less strokes cannot be made with a broad-nibbed pen held at a fixed angle.\n\nHowever they were made, they represent a technique of construction to achieve a design effect which is not a straightforward representation of “pen rules”, and so offer an obvious precedent—standard practice, in fact— for the inventions of 15th century type designers.\n\n"
    },
    {
      "time": " 2.Jun.2008 4.54am",
      "content": "Nick, I see what you mean now. Yes, it does seem there was pen rotation going on. This tends to confirm Michael Clark’s view that much more pen rotation was going on before the ’mannerist period’ where Noordzij puts it.\n\nWhat period is this manuscript from?\n\nThough pen rotation is used to get an effect here, I don’t think it is conceptually the same as the painted Imperial letters or the inscribed counter parts. There, what is happening, I tried to show, is a deliberate effort to get even color between letters, and balance within the letter, by pretty freely changing weights of strokes. The small serifs go together with the open feeling of the design as well. This aesthetic, which promote readability especially in small type, Jenson and Griffo applied and developed for the roman lower case in type.\n\n"
    },
    {
      "time": " 2.Jun.2008 5.26am",
      "content": "Bill, isn’t Sumner’s point that it is a lower case with a critical dependance on the contrast schemes of writing in the scribal tradition that is adjusted in that direction?\n\n"
    },
    {
      "time": " 2.Jun.2008 6.38am",
      "content": "Peter, I don’t think anyone disagrees, including me, that the Carolingian minuscule is a pen-developed script, and that it was the point of departure for Jenson and Griffo’s work.\n\nI think when you say “critical dependence on the contrast schemes” of the Carolingian minuscule I think you are overstating the case, as I think while the influence is clearly very important, the deliberate and systematic departures are there as well.\n\nThey were willing to do thinner serifs and thinner diagonals that change the contrast scheme of the pen drawn letters, and even completely reverse the contrast in the case of the z, if I remember rightly.\n\nI understand why John Hudson is unwilling to acknowledge how significant this change was, as he doesn’t accept any influence on readability beyond legibility of individual characters. However, as you do think the focus on rhythm and color are important for readability, I would think that you would also label this treatment of letters a “conceptual change”, as Sumner Stone does.\n\n"
    },
    {
      "time": " 2.Jun.2008 7.35am",
      "content": "In my opinion, while the thinning, straightening and reversals violate the natural tendencies of the actual or a virtual pen in translation at specific role-locations, they don’t destroy or reverse the dominant contrast scheme underlying the sculpting of role-defining components in the lower case letters as a set. This is why I say the fundamental break is not with writing, but with literal paraphrase.\n\n"
    },
    {
      "time": " 2.Jun.2008 7.57am",
      "content": "\\>fundamental break is not with writing, but with literal paraphrase.\n\nAgain, what one calls ’fundamental’ is somewhat subjective.\n\nThe questions to me are:\n\n1. Whether there is something conceptually different going on, not based on the pen? In other words, Jenson and Griffo were making their modifications not based on anything derived from the pen, but rather some different concepts: balance of characters, readability. They were willing to depart from the pen to serve these ideals, even though the pen formed characters were their starting point, and their changes were “conservative,” in that they only changed the written forms where they could see a gain from the point of view of these ideals.\n\n2. Whether these ideals already had their origins in antiquity, in painted and carved letters.\n\nI would say yes to both.\n\n"
    },
    {
      "time": " 2.Jun.2008 8.17am",
      "content": "Bill, my question is: what were the modifications to? not: what were they based on?\n\nThe changes are modifications to a formal grammer with a more originary debt. Classical ideals exerted a countervailing pressure. I don’t deny the existence of these countervailing pressures or their impact on the typographical letter.\n\n"
    },
    {
      "time": " 2.Jun.2008 9.09am",
      "content": "Bill, just to follow up, my impression is you want to tie structural dependance too closely to literal quotation.\n\n"
    },
    {
      "time": " 2.Jun.2008 12.54pm",
      "content": "\\>what were the modifications to? not: what were they based on?\n\nI think both are legitimate questions. I agree that the modifications were to the pen-based forms. But they were influenced by ideas that were not based on the pen.\n\nThe point that Stone makes, as I understand him, is that the new look, in so far as it was new, was not derivative from the pen. That’s why it was conceptually different. And the fact that the medium was single letters carved of metal, slowly, gave them the freedom to pursue this new look.\n\n"
    },
    {
      "time": " 2.Jun.2008 1.17pm",
      "content": "_the medium was single letters carved of metal,_\n\nThat line of thinking leads to over-simplification, in directly comparing pen with counterpunch.  \nThe new medium was a stretched-out industrial process involving more than one person— matrix-making, casting, composing, inking, making the impression, and re-using type.  \nAs with all mechanization, craft becomes production work, and artistry becomes design/management.  \nIt is this distancing of the decision-maker from the mark-maker which engenders abstraction, emphasizing the role of design.  \nAt this point, McLuhan’s laws of media become apparent, in particular #4 Retrieval: the content of any medium is an older medium.\n\nBut not necessarily any one medium; and so Incunabula type design was free to synthesize elements of pen, brush, and chisel media, as well as address issues specific to the new process. Retrieval was a traditional practice of page making, ensconced in the hierarchy of styles on the introductory page of manuscripts, starting with oldest (Roman capitals), below that Uncials, and then the most recent, Carolignian body text.\n\n"
    },
    {
      "time": " 2.Jun.2008 1.18pm",
      "content": "Yes, the answers to both questions are part of the story.\n\n"
    },
    {
      "time": " 2.Jun.2008 1.26pm",
      "content": "Nick, what, in the case of type, would you say the “heirarchy of retrieval” was?\n\n"
    },
    {
      "time": " 2.Jun.2008 2.02pm",
      "content": "Interesting post, Nick.\n\nI didn’t mean that cutting punches was the whole story, but it was the foundation of the rest. And those cutting the punches knew the rest of the process and designed in accord with that.\n\nYour post makes me think: as printing was the first mass production method, so Jenson and Griffo and some of their colleagues were perhaps the first designers. By that I mean they were not crafting individual items, but consciously producing templates for reproduction of identical items. The strict imitation of black letter makes that not quite design, as there was not conscious innovation for the purpose of reproduction, as there seems to be with Jenson and Griffo.\n\n"
    },
    {
      "time": " 2.Jun.2008 2.05pm",
      "content": "_what, in the case of type, would you say the “heirarchy of retrieval” was?_\n\nI couldn’t say.  \nI’ve seen work by Incunabula type designers other than Jenson, and it’s all over the place.  \nAnd yet he provided the definitive model, in the winnowing of history.  \nObviously, there was a huge scene in Venice, where new media people from all over Europe congregated and threw their stuff in the stew.  \nIn discussing typography and calligraphy, bear in mind that the Roman letter was in a decided minority of the books being published.\n\n"
    },
    {
      "time": " 2.Jun.2008 2.09pm",
      "content": "_printing was the first mass production method_\n\nIn Venice, boat building preceded it.  \nThe Arsenal was a production line.\n\n"
    },
    {
      "time": " 2.Jun.2008 4.51pm",
      "content": "<cite> And yet he provided the definitive model, in the winnowing of history. </cite>\n\nExactly. Which is why it’s so tempting/exciting to be able to say something new about it - if it’s accurate or not.\n\nLeaving the scribal aspects behind for now, I want to point out that there may be problem with Bill (& maybe Stone’s?) approach which is that it may rely on too few samples. When I look at Aldine & Jenson books I find that the forms vary from book to book. And sometime maybe in the book as well. In order to be convincing I think you would have to see if the idea holds true over multiple editions and show how it develops over time. It might be that this is not relevant because the essential aspect persists. But it might not too. Also, the impression they offer is soft because the paper is rough.\n\nNone of this means that Bill is mistaken it itself but it does legitimately throw some details/fuzz up that has to be dealt with.\n\n"
    },
    {
      "time": " 4.Jun.2008 11.18pm",
      "content": "I meant to say “in itself”. Sorry.\n\nI got the article today. The next article by Rod McDonald is pretty interesting too.\n\nI may chime in after I have a chance to re-read it all.\n\n"
    },
    {
      "time": " 21.Jun.2008 3.40pm",
      "content": "In his “Het primaat van de pen” (The primacy of the pen) Gerrit Noordzij formulates in a single sentence what he tries to maintain in Letterletter #11 (pages 96 to 105 of the Letterletter book) as follows: “Jenson’s roman follows the construction of the late-gothic textura.” [my translation] The section on page 104 and 105, along with the four-part illustration on page 103 — that in the original Letterletter edition went with it — makes a compelling case for this point of view.\n\nThe argument is mainly about the serifs.\n\nManuscript evidence Stone interperts as showing efforts to put Imperial capital-style serifs on the humanistic lower case, Noordzj interprets as showing assimilation of the construction principles of a late-gothic textura into the humanistic lower-case domain.\n\nJenson’s roman paraphrases. But what what his roman paraphrases represents is the issue.\n\nThis could make Jenson’s innovation seem progressive, not grudging, and remove the plebian stigma Stone places on the presumably now subdominant lower case. Progressive, because for centuries innovations leading to the late-gothic textura had made the medieval script-letter the training-ground for the consolidation of the word.\n\n"
    },
    {
      "time": " 21.Jun.2008 8.36pm",
      "content": "I recommend reading that GN passage. And re-reading that. He isn’t at his most accessible in that text. But he does make some compelling points that have the virtue of being much less mystical than the usual explanations.\n\n"
    },
    {
      "time": " 23.Jun.2008 7.40am",
      "content": "Peter, a key issue here is chronology.\n\nIf, as the Stone article says, first came the introduction of Imperial caps with lower case, and later came more symmetrical serifs, then Noordzij’s story doesn’t hold. If the symmetrical serifs were introduced earlier for different reasons, then he would have a case—though there are a lot of other reasons why I think his story misses out on important non-writing influences.\n\nNoordzij doesn’t give any dates on the “Burgundian” style of serif, so I can’t really evaluate his argument.\n\n"
    },
    {
      "time": " 23.Jun.2008 10.32am",
      "content": "Bill, I thnk the sequence Noordzij’s scheme suggests is first, the ‘phase-one’ adaption of the Imperial capitals to the Carolinian minuscules in manuscript writing that Stone associates with Poggio Bracciolini. The majuscules here “relied on thea stroke pattern derived from the pen-written minuscule.” Then there is an assimilation of a “late-gothic” textura construction into the humanistic lower-case domain. The key here is the figure 9 on Letterletter page 101. The serif here is not fully symmetrical per force of the tool, much like the terminals in figure 3 from page 103 and the serifs in Jenson’s type.\n\nI don’t know the date of the textura Noordzij shows in figure 2 of page 103, or figure 3 of the same page. I assume figure 3 is from the same pool of evidence Stone uses for his claim s about the the minuscules in the second phase of Imperial capitals to the Carolinian minuscules, where Stone says something closer to the Imperial caps takes the lead. I doubt Noordzij is playing with chronology here. Perhaps I’ll try to find out.\n\nMore likely the change to a retracting serif in the Carolinian-derived minuscule, based on an assimilation of construction principle drawn from textura, set up a dynamic in the development of the lower case which could then branch out, once the transition to type was made, into a more literal assimilation of the formal features of the Imperial Roman (than in Bracciolini’s case) and a subsequent feedback of those assimilations into a more formalized lower case such as occurs perhaps in Griffo.\n\nStone says that the construction of the Imperial Capital became more complex. It could well be that the innovation of using a textura-based construction to write the minuscule, carried over to the writing of Imperial Capital, led to the discovery that one could also come to a closer approximation of the formal features of the inscriptional Imperial Capital.\n\n"
    },
    {
      "time": " 25.Jun.2008 11.33am",
      "content": "Perhaps what I’m getting to is that remarks about what occupies the dominating position must be taken with a grain of salt.\n\nThe story might be a good deal more complex. Noordzij’s scheme raises the possibility that retroactive admiration for the Roman inscriptional capital _as well as, or simultaneous with_ a lateral (in time) application of aspects of a well-understood textura construction of exit strokes (at least) to the recently revived carolinian minuscule are both at work in the Florentine and Paduan writing after Bracciolini: the one offering a new solution to the writing of the carolinian minuscule and the other pressing for further exploration in the writing of the majuscule. I’m curious to know what the “more complex” (Sumner Stone) stroke patterns used in the Florentine and Paduan manuscripts (especially for the caps) were. New initiatives and existing admirations work in tandem.\n\nIn a recent lengthy essay by Kay Amert evaluating Stanley Morison’s “Aldine hypothesis” about influences on French roman types of the early sixteenth century (“Stanley Morison’s Aldine Hypothesis Revisited,” _Design Issues_: Volume 24, Number 2, Spring 2008), Kay Amert states: “The connoisseurship that led Stanley Morison to grasp the importance of the Aldine roman for later punchcutters is misplaced when imputed in a literal sense to the punchcutters themselves. Rather than suggesting the close copying that is the method of modern revivals, the approach to the romans produced by these punchcutters suggests, instead, the application of a _synthesizing intelligence, the exercise of a keen critical sensibility cultivated in the practice of the craft, and a desire for originality in its pursuit._” [my emphasis]\n\nI think “synthesizing intelligence” is apt, both in relation to the Florentine and Paduan writing and the Jenson type. Noordzij’s importance is to not let real developments in writing drop out of the equation in the hunger to insist on the autonomy of type in relation to writing.\n\n"
    },
    {
      "time": " 25.Jun.2008 1.06pm",
      "content": "Nicely put!\n\n"
    },
    {
      "time": " 25.Jun.2008 2.48pm",
      "content": "\\>to insist on the autonomy of type in relation to writing.\n\nI certainly haven’t said and don’t think that type is autonomous of earlier writing. I don’t think that Stone says that anywhere, either. What he says is that punch cutting added a \\*new\\* element, different from writing, to the design process, and that I find convincing.\n\nI would agree that Stone goes too far when he writes “Letterforms could no longer be viewed, even mentally, as a series of strokes with an edged tool.” I think that an “underlying force” of writing, to use van Krimpen’s phrase, remains there. Even though Stone’s statement is strictly speaking probably right—for real pens—I follow Noordzij in thinking that it is a very useful exercise to visualize what an edged tool would do, and then consider how what you want to do departs from it.\n\nBut if Stone goes a little farther than I am comfortable with, in my view Noordzij sometimes goes flying over the right balance in the other direction. I can’t find the quotes at the moment, but if I run across them I’ll add them to the thread.\n\n"
    }
  ]
}
