{
  "id": "45700",
  "title": "Theft?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Is this close enough to be considered theft? Or am I being anal?\n\nI created my first draft of the logo on the right in Feb 08, the one on the left appeared April 08. The designer responsible is a member of a blog community I posted early design drafts of the design too. So they in all likely hood saw it.\n\nI cant help but feel like they saw it, and decided to use the exact same concept for their school project.\n\n ![](http://web.archive.org/web/20131105064900im_/http:/typophile.com/files/theft_3526.jpg)\n\n",
  "author": "picard102",
  "time": "24 May 2008 — 10:27pm",
  "uid": "16279",
  "comments": [
    {
      "time": "25 May 2008 — 12:14am",
      "content": "If they only used it for a school project the only person being cheated is themselves.\n\n"
    },
    {
      "time": "25 May 2008 — 6:52am",
      "content": "It looks very similar but yours is way better!\n\n"
    },
    {
      "time": "25 May 2008 — 12:15pm",
      "content": "Yea, it's a rip-off. So, this was a logo for the same company you were working on? Did the client maybe show it to the other designer?\n\n"
    },
    {
      "time": "25 May 2008 — 1:42pm",
      "content": "Two different clients. Mine was for the municipality of London, hers was for a real estate firm in London. She goes to the collage here.\n\nI think hers was a collage assignment, as the phone numbers don't match the acctual company she used.\n\nI posted the design to a Livejournal community that she is a member of, so it would have been on her \"friends\" page, so I don't believe she came across my work by accident or by second hand.\n\n"
    },
    {
      "time": "25 May 2008 — 1:54pm",
      "content": "If it's a college project, you really should maybe contact her directly and/or the school. A decent college takes plagiarism fairly seriously.\n\n"
    },
    {
      "time": "25 May 2008 — 2:15pm",
      "content": "I was thinking of contacting the school. Though I don't want her expelled.\n\nThere is a creative networking event comming up on the 29th that she will probably be at, so I'll see what happens there and figure out if I want to pursue it further.\n\n"
    },
    {
      "time": "26 May 2008 — 6:14am",
      "content": "\\> I was thinking of contacting the school. Though I don’t want her expelled.\n\nShe probably won't be expelled, although she will certainly get a mark of 0 on the project and a good talking to.\n\nDo it. It will be the best favor you could do for her (although she won't think so.)\n\n(Rather sad that the stolen logo is not even as good as the original.)\n\n"
    },
    {
      "time": "26 May 2008 — 1:00pm",
      "content": "it's a tough place to be in, but just tell her professors the exact same info you told us here and they're the one that makes the call, after all, they know her better than you and this may not be the first thing she's borrowed either for projects from that same community.\n\nShe may not post everything she does on that board, but her teacher gets all her work and might see more stuff on the forums evidencing borrowed projects.\n\nBest of luck, do the right thing!\n\n(and your logo looks way better and is pretty great in my books for the record)\n\n"
    },
    {
      "time": "26 May 2008 — 1:11pm",
      "content": "Ya, I think I will stop by her school and talk to the program director about it tomorow. I might send her an invoice as well. ;)\n\n"
    },
    {
      "time": "26 May 2008 — 1:22pm",
      "content": "haha no, I know sometimes I've drawn something and later people have shown me a logo that I've no memory of ever seeing, but is in fact very similar, so I change it.\n\nI don't care whether I did see it or not, if they \\*had\\* the same idea first, they had it first even if I thought it up on my own - that's decency.\n\nBut, the timeframe and location of your logo and hers is too close to be an accident, and she needs to be confronted about it.\n\nThere are plenty of times I show up to class with a project almost the same as this guy Ben in my class. We get the same requirements and limitations, and our solutions are consistently very very similar - but we never talk outside of class so we both know we aren't ripping each other off. When something looks too close, we both change it a little bit and then it's okay.\n\nYet there are other people who go to google images and rip off other logos thinking \"oh this is obscure enough that no one will know\" and that's not a design issue, that's a character flaw. That's a choice, and the choice is an unethical one.\n\n"
    },
    {
      "time": "26 May 2008 — 5:07pm",
      "content": "It looks to me like there was a serious effort to change it on the student's part. Now, I do agree that it's too similar, but the student may not totally understand what constitutes plagiarism. Some may believe that changing the aesthetics and forms is enough for it to be considered different enough. If a student were to use stock vectors or imagery in their work, would this be considered cheating? It certainly wouldn't be helping to educate them, and in most cases would be fairly obvious to the professor (this student's logo looks like it was pieced together with istockphoto vectors), but where's the line? After all, you could consider fonts to be stock art.\n\n"
    },
    {
      "time": "26 May 2008 — 5:34pm",
      "content": "This isn't an issue of stock art.\n\nBut, if it were, yea, that wouldn't usually be kosher. Both in terms of not being terribly creative and a lot of EULAs would prohibit it.\n\n"
    },
    {
      "time": "26 May 2008 — 5:45pm",
      "content": "stock art isn't cheating because you pay to use it in your work. Do magazine commit copyright infringement when they pay photographers to take pictures and then use them? no, they have paid the copyright holder for licence to use the work in the pre-defined capacity.\n\nTaking another person's idea when you don't have licence to is the issue here, and there was no arrangement (free or otherwise) so she has plaigiarised him, as long as she hasn't given him credit for it.\n\nit's as clear as that.\n\n"
    },
    {
      "time": "27 May 2008 — 7:41am",
      "content": "Very funny that they placed the ® mark on their copycat logo.\n\n"
    },
    {
      "time": "27 May 2008 — 8:40am",
      "content": "well it is registered isn't it? I mean she did it for a school project so she's got like, copyrigh or patent on it by DEFAULT because she did it, doesn't she? I mean like, people can't just take her work now and like, steal it! cause that'd be wrong…\n\nI strongly dislike over-protective people especially on the web. My rule is: if you don't want people to see it, don't share it.\n\nI've had web designers come up to me saying: hey, you're kind of like a web-guru aren't you? I mean, being young and all. So I want to know how I can make it so nobody can see the source code to my website and steal my code, is there a way I can make it impossible to read?\n\nso I say: \"what you download is the code and the page is assembled on each computer, if you don't send the code, or mess it up so it's unreadable, then the browser won't display the page.\n\nhim: \"so is there a way I could stop it from sending the code at all?\"\n\nme: \"yes, if you don't want people looking at the code, don't put it on the internet\"\n\n"
    },
    {
      "time": "27 May 2008 — 10:39am",
      "content": "It is much too close. What fun is stealing if it _looks_ like you've stolen?\n\nMy avatar is a _satirical_ rip-off, so it doesn't fit into this rubric.\n\n"
    },
    {
      "time": "27 May 2008 — 12:00pm",
      "content": "I don't think anyone believes the student's logo is good, in terms of the benefit to her education, the quality of it, or its similarity to the one picard102 did. But I don't think the first step should be going to her professors or school's administration. I think most of us look at other designers' work for inspiration, but we've learned how to hide our sources, and how much we need to change something for it to look original. The student may not know where to draw the line yet. Very few design programs cover design ethics until fairly late in the game, if at all. I would give her the benefit of the doubt and talk to her one-on-one. Some schools take this kind of thing really seriously, and I don't think it's worth ruining her life for. If it was an exact replica, I might have a different opinion, but I just think she may not know what constitutes copying.\n\n"
    },
    {
      "time": "27 May 2008 — 12:44pm",
      "content": "I checked their policy on plagiarism, if it is her first offence at most she'd have to redo the class the assignment was for, and at the very least get a note on her transcript.  \nFrom the looks of it she is at least in her last year, putting together her portfolio and looking for work.\n\n"
    },
    {
      "time": "27 May 2008 — 11:07pm",
      "content": "Definitely ripped. You considered blackmail? for money? sex?\n\n:o)\n\n"
    },
    {
      "time": "28 May 2008 — 1:35am",
      "content": "yeah, she saw yours (which isn't to say that she stole yours -- its amazing how these things just lodge in the subconcious and then pop up later). I think it's worth telling her, just so she knows that it's worth \\_really\\_ thinking about your ideas (which, if she'd done, she'd probably remember seeing your logo at some point).\n\nOn the other hand, I don't think hers is any 'worse' at all. Nothing against yours, but it's a very dated look, and the typography is nothing to shout about. Hers is very self-conciously web 2.0 (think firefox/thunderbird), but not a bad bit of vector art all the same.\n\n"
    },
    {
      "time": "28 May 2008 — 4:36am",
      "content": "Not even close. A circle is hard to not copy. Is green below and blue above original? Is a low angle view of simplified buildings original? Even combining these elements, that differ substantially from work to work, is not original in ether case.\n\nLeave it alone or end up looking like a fool and ruining some poor students day (and that's all), in my opinion.\n\nCheers!\n\n"
    },
    {
      "time": "28 May 2008 — 8:21am",
      "content": "<cite>Not even close.</cite>\n\nDavid, I have to respectfully disagree. That leaf form is virtually identical - certainly in concept if not the details of execution. I think that there is a difference between taking inspiration from someone else's work (we have all done that either consciously or subconsciously) and completely lifting an element to use in your own design. If this were a professional designer I'd consider having a lawyer draft a cease and desist letter; since it's a student I think you should alert her professors. It's he only way she will learn that everything on the internet is not necessarily up for grabs.\n\nThere are pluses and minuses to internet exposure - on the one hand more people see our fine work; on the other we lose a certain control over it.\n\n"
    },
    {
      "time": "28 May 2008 — 10:07am",
      "content": "Being the non-confrontational person I am, the idea of contacting her first seems ideal to me. By the same token, I think everyone knows by their senior year what is or isn't plagiarism, especially when you're in such close proximity (digitally speaking) to this person via livejournal. I think in the long run, this person isn't doing herself any favors by cutting corners in class. Maybe some form of penalty will instill a deeper understanding and respect for intellectual property.\n\nI think the acid test would be if you were to think like the average person, and you saw these two logos in the same week, would the two images cause confusion as to what they stood for? Would one think that the companies / ideas were related? Now there are some obvious changes, but I think if I were the average consumer, I would just assume that the one on the left is a more colorful version of the one on the right. Ergo, they look way to similar to be mere coincidence.\n\n_On the other hand, I don’t think hers is any ’worse’ at all_  \nI'd love to see that one go through a black and white copier...\n\nwhat was the quote? \"good artists borrow, great artists steal\"\n\n"
    },
    {
      "time": "28 May 2008 — 11:21am",
      "content": "Well I emailed her programs coordinator yesterday after visiting the school.\n\nThe front desk staff looked shocked, almost turned white, when I said I suspected a student plagiarized a work of mine. They gave me a card with an email address on it and I sent off the info last night.\n\nIt's up to him now to decide if I'm crazy or not, and deal with her.\n\n"
    },
    {
      "time": "29 May 2008 — 12:53pm",
      "content": "If no theft took place in History, we would not have been to what we have been today?!  \nWith a cutting tooth I say:  \nAll of us owe thieves for their daringness to steal+distribute Robinhoodly?!  \nAnd I do not know what do you count a tpophile for improving Adobe Arabic:  \n [http://typophile.com/node/36706](http://web.archive.org/web/20131105064900/http:/typophile.com/node/36706 \"http://typophile.com/node/36706\")  \nthat has been up+downloaded in the W³ Paradise?!  \nFlowers4@ll\n\n"
    },
    {
      "time": "29 May 2008 — 2:50pm",
      "content": "When I was a student, I worked along a classmate. Another guy, borrowed from her an information design assignment, she kindly offered him it 'cause she thought he would be just taking some ideas, mainly in the content, not the design. However, I happened to walk out of the room where he was exposing it to the teachers and guess what, he took to the examination the work of my friend. Her work. Not something alike, very much like the same. I later told her and they had a bitter quarrel, dunno anything else. The point is that people like these doesn't deserve any mercy. In the same way they don't care copying your logo, you shouldn't care about them.  \nIt is obviously a lame rip-off, the marks are not only the leaf/building overlay, but the fact that she used buildings as well, instead of using house for example. The shape of the leaf is copied as well. Come on, she even added that inner glow to the leaf!\n\n"
    },
    {
      "time": "29 May 2008 — 3:45pm",
      "content": "Karma catches up with all people...sooner or later. I heard a story of a student who \"borrowed\" designs straight out of annuals for his student work. The teachers found out. He had to re-do all the work. At the time I thought he should've been kicked out, but he made up for his mistake and then some. Anyway, karma caught him and it will catch them.\n\n"
    },
    {
      "time": "29 May 2008 — 5:32pm",
      "content": "I think you should employ that student when they graduate, you could all laugh about it over the lunch room table, and she would be the best designer you have ever had the chance to work with...\n\nsomething good has to come from it, meet her have a chat, she obviously likes your work.\n\n"
    },
    {
      "time": "30 May 2008 — 1:55am",
      "content": "@dberlow:\n\n\"Not even close. A circle is hard to not copy. Is green below and blue above original? Is a low angle view of simplified buildings original? Even combining these elements, that differ substantially from work to work, is not original in ether case.\"\n\nI agree. If you open up one of those LogoLounge books, or any other logo book, there's pages and pages of leaf shapes, and there's pages of various buildings. The combination of buildings and organic foliage has been done a billion times by every non-profit, real estate firm, and eco-friendly organization out there.\n\nDid this student copy your logo? Probably, given the circumstances you described. But if she has any arguing skills whatsoever and holds her ground, I doubt she'll get in trouble. It's not the same as pointing to a paper that has a paragraph lifted verbatim from the internet -- you have to prove that she somehow stole something from your logo that was entirely original to your work.\n\nAside from all that, I don't really see why this is worth your time (said the guy writing his opinions on an online message board :) If it was a real company, I could see the point in alerting them that their logo might have been plagiarized from your work -- you're protecting your livelihood. I could see alerting the school if it was obviously traced. But the fact that you had to ask what you should do seems to say it's a gray area, and you should probably leave it alone.\n\n"
    },
    {
      "time": "30 May 2008 — 6:34am",
      "content": "_I don’t really see why this is worth your time_\n\nI think there's also another dimension to this that hasn't been mentioned. If this person in school is plagiarizing work and getting good marks (i guess we don't really know how she did), what happens to the students doing their own honest work? If i was a classmate, and had known all of the issues that John had mentioned, I would be infuriated knowing a copycat was being praised for her (or his) work while I actually took the time to make an original mark. I think it is grossly unfair to both John and this person's classmates for this to go unmentioned. It is entirely too close to the original given the circumstances, but I still think it would be rational to at least hear her defense.\n\n"
    },
    {
      "time": "30 May 2008 — 11:00am",
      "content": "What bothers me is there's no reason to believe it's an intentional rip off. Of course, it could be entirely intentional, and she just under-estimated how much she needed to change it, but she should be given the benefit of the doubt. It's totally possible that it stuck in her head, but she didn't realize that she was borrowing from a logo she had seen.\n\nThe notion that she's \"going to learn from this\" wreaks of the paternal morality police, too. I would have a different opinion if it was a direct copy, but the only thing that's obvious is it's a gray area, based on the differing opinions in this thread. I wouldn't be surprised if this girl goes out of her way to get back at you, either.\n\n"
    },
    {
      "time": "30 May 2008 — 11:41am",
      "content": "Asking what to do about theft means you shouldn't bother pursuing it? Defeatist attitude?\n\nWell the school is going to take disciplinary action, and she emailed me with an apology. So giving her the benefit of the doubt is out the window.\n\n@concrete: Agreed, I wouldn't mind chatting with her, or having her work with me if I needed the staff.\n\n"
    },
    {
      "time": "30 May 2008 — 1:25pm",
      "content": "\"Asking what to do about theft means you shouldn’t bother pursuing it? Defeatist attitude?\"\n\nWell good for you, if you feel like you did some good for the world. My point is if you felt the need to ask, then it probably wasn't totally clear to you what you should do. If it was an obvious case of plagiarism, you wouldn't have felt the need to ask people on a messageboard.\n\n\"I wouldn’t mind chatting with her, or having her work with me if I needed the staff.\"\n\nThis just sounds really paternal and smug and makes me want to throw up.\n\n"
    },
    {
      "time": "30 May 2008 — 2:32pm",
      "content": "\"If it was an obvious case of plagiarism, you wouldn’t have felt the need to ask people on a messageboard.\"\n\nI think it was an obvious case (as do most folks in here). The not-so-obvious part was what to do, hence the discussion.\n\n"
    },
    {
      "time": "30 May 2008 — 4:17pm",
      "content": "I think such cases, and the issues about them, do need to be discussed in public forums to discourage plagiarism - and show the culprits that they will often be caught. Earlier this week several designs (exact and \"borrowed\" concepts) by others (including myself) were found posted, by designers claiming the work as their own, on a so-called \"logo contest\" site. I've had to deal with other cases of my work being ripped-off as well. I appreciate others in the industry finding instances of my work being used inappropriately.\n\nJeff Fisher | Engineer of Creative Identity | [Jeff Fisher LogoMotives](http://web.archive.org/web/20131105064900/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": "30 May 2008 — 5:00pm",
      "content": "I'm all for rooting out out-and-out theft, and publicly identifying the culprits, but the original post's first sentence was \"Is this close enough to be considered theft? Or am I being anal?\" That shows there was some question in picard102's mind about if this was true plagiarism or not.\n\nI tend to agree with dberlow's thoughts on this, that there are a million and one logos out there combining a leaf with a building, so the \"original\" logo is not original, at least in its concept.\n\n"
    },
    {
      "time": "2 Jun 2008 — 4:49am",
      "content": "\"David, I have to respectfully disagree. That leaf form is virtually identical -...If this were a professional designer I’d consider having a lawyer draft a cease and desist letter...\"\n\nPatty, I re-respectively re-disagree. If everybody who thought their leaves'd been ripped off, went to a lawyer, they wouldn't have enough time for important things, like whiplash and lapped hot coffee.\n\n\"If it was an obvious case of plagiarism, you wouldn’t have felt the need to ask people on a message board.\"\n\nI hear you and completely understand your anger, but the case is simply not obvious enough, the damages unmeasurable and the defendant not worth targeting, all as far as can tell...\n\nMuted Cheers.\n\n"
    },
    {
      "time": "2 Jun 2008 — 7:02am",
      "content": "\"The “original” logo is not original, at least in its concept.\"\n\nConcepts are fairly gray, but this really isn't the case in this issue. We know the person looked at the original, and came up with a mark using the same elements, shape, colors, and, yes, leaf, so not quite so questionable in this case.\n\n\"but the case is simply not obvious enough, the damages unmeasurable and the defendant not worth targeting, all as far as can tell...\"\n\nI don't think it's an issue of damages. It's an issue of professionalism. I can't speak for the student, but I imagine the school certainly appreciates knowing about it. It's a reputation issue.\n\n"
    }
  ]
}
