{
  "id": "45719",
  "title": "HELP. Where can I find vintage style fonts?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey,\n\nAm trying to design a poster much like the Grand Prix poster style of the late 40s, early 50s. Been trying to find free font downloads that are in the style of that era, but not much luck. Have looked on dafont.com, but nothing sprung out, any suggestions anyone?\n\n:(\n\n [‹ Back to the Futura. The Devil Wears Kada. Etc.](http://web.archive.org/web/20081015213741/http:/www.typophile.com/node/45902 \"Go to previous forum topic\") [A Typographic Holiday ›](http://web.archive.org/web/20081015213741/http:/www.typophile.com/node/45892 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015213741/http://www.typophile.com/user/31555\" title=\"View user profile.\">ShortyAKNZ</a>",
  "time": "<br>",
  "uid": "31555",
  "comments": [
    {
      "time": " 25.May.2008 8.31pm",
      "content": "[http://images.google.co.nz/imgres?imgurl=http://www.urbanposters.com/Ima...](http://web.archive.org/web/20081015213741/http:/images.google.co.nz/imgres?imgurl=http://www.urbanposters.com/Images/splash_pages/vintage/0000-3923-6_sp.jpg&imgrefurl=http://www.urbanposters.com/vintage_posters_prints.htm&h=125&w=170&sz=31&hl=en&start=18&tbnid=cr69lF-_2u9LeM:&tbnh=73&tbnw=99&prev=/images%3Fq%3Dvintage%2Bcar%2Bposters%26gbv%3D2%26hl%3Den%26sa%3DG \"http://images.google.co.nz/imgres?imgurl=http://www.urbanposters.com/Images/splash\\_pages/vintage/0000-3923-6\\_sp.jpg&imgrefurl=http://www.urbanposters.com/vintage\\_posters\\_prints.htm&h=125&w=170&sz=31&hl=en&start=18&tbnid=cr69lF-\\_2u9LeM:&tbnh=73&tbnw=99&prev=/images%3Fq%3Dvintage%2Bcar%2Bposters%26gbv%3D2%26hl%3Den%26sa%3DG\")\n\n"
    },
    {
      "time": " 25.May.2008 10.39pm",
      "content": "[Fontdiner.com](http://web.archive.org/web/20081015213741/http:/www.fontdiner.com/) has lots of free retro fonts. They don’t have anything that matches that poster, but they definitely evoke the era.\n\n"
    },
    {
      "time": " 26.May.2008 12.33pm",
      "content": "I do hesitate:  \n [http://www.dafont.com/](http://web.archive.org/web/20081015213741/http:/www.dafont.com/ \"http://www.dafont.com/\")\n\n"
    },
    {
      "time": " 26.May.2008 1.23pm",
      "content": "“trying to find free font downloads”\n\nPerhaps you might consider actually paying for fonts? There are several foundries out there doing retro work who can help you.\n\nChrisL\n\n"
    },
    {
      "time": " 26.May.2008 2.18pm",
      "content": "Veer.com\n\nis best for what your looking for.\n\n"
    },
    {
      "time": " 26.May.2008 3.30pm",
      "content": "I have looked around and found good ones. My op it that the good ones are not free ;-)\n\n"
    },
    {
      "time": " 28.May.2008 10.08pm",
      "content": "Chris, if the project isn’t for anything professional, and the OP doesn’t think he’s going to ever use this font again, it probably isn’t worth it to buy a font, no matter how much better suited to the project it may be. Whenever someone says that they need a free font for a project, I generally assume that this is the case; their budget isn’t such that they can shell out $29 for a font that will only be used for this project.\n\n"
    },
    {
      "time": " 29.May.2008 4.57am",
      "content": "See, I don’t get this. Designers shell out, what?, $100$200 for a stock photo or stock illustration? — which, face it, you usually only use maybe once — but can’t part with a measly $29 for the font? Then just use Times or Arial.\n\nThis is like a painter saying, Yeah I don’t mind paying for the paint I need so I can get the colors I want, but do you know where I can get any free sable brushes?\n\n"
    },
    {
      "time": " 29.May.2008 7.43am",
      "content": "But you’re making the mistake of assuming that every single person on this site is a designer. What if this is someone just working on a personal project, and he decided to ask people who would be in the know where he can find fonts that work for his project? I’m not a designer by any means, but I still love use this site to educate myself on typography. However, I consistently get frustrated with some of the elitism on this site. You need to remember that even though this site is dominated by experienced professionals, a lot of the people on this site are new to the field of typography and are trying to cultivate their interests. They’ll get scared off if you tell them they don’t know anything or that they can’t do what they want without spending lots of money.\n\n"
    },
    {
      "time": " 29.May.2008 8.34am",
      "content": "Doc — Yeah, that’s fine. Sorry, I got up on the wrong side of grouchy this morning.\n\nI guess the difference is you assume that when someone is asking for a free font, they’re just a dabbler. You’re probably right. I assume they’re trying to make a go of things as a professional.\n\nI don’t mean to pick on this particular OP. And I don’t mean to be elitist. I guess I’m still not used to the idea that people \\*need\\* fonts, unless they’re professional designers.\n\nHey, even amateur painters and hobbyists pay for their tools and materials. I guess this whole “Everything is free on the internet” digital mindset may be a generational thing. Old dog/new tricks, you know. (Plus, I guess I’m still grouchy. ;-)\n\nBut, yeah, if you can find what you’re looking for for free, good for you. However, if you can’t, then consider paying. (Not \\*you\\* specifically, of course — “one,” generally.)\n\nOkay, done ranting. More caffeine must be in order.\n\n— K.\n\n"
    },
    {
      "time": " 29.May.2008 9.58am",
      "content": "My remark was prompted by the comment that a free font which fits the bill was not found by the requestor. If their is no freebee to be had, then purchase is still an option. Most fonts cost what you pay for a couple of beers at the local pub. The beers just get whizzed down the john in an hour but you get to use the type over and over again. Occasionally you get invited to a party that has free beer. It may not be your favorite brand and it may be flat or warm but it is free. Sure, you can ask your host for some fine imported German beer because that warm, flat Bud Light isn’t quite what you had in mind. You would never do that (I hope) because your host might think you were an elitist or an arrogant freeloader. I don’t understand why people are so surprised to find that the “good stuff” in type isn’t free. People have the free right to choose to purchase type or use what they find for free. You also have the right to walk into your local bar and ask the bartender for a free pint of Gröltsch on the grounds that you are not a professional beer drinker and that you will make no profit from drinking that beer but are just doing it for fun. He certainly has the right to refuse your request without payment. I guess you could just call him an elitist for having bills to pay. After all, you are only asking for a few free beers.\n\nKindest regards,\n\nChrisL\n\nYour Elitist Servant Bartender and Grouchy ill-mannered Type designer who gets so tired of hearing how type should be free\n\n"
    },
    {
      "time": " 29.May.2008 11.10am",
      "content": "Chris, you may have had the best intentions when you suggested that they “consider actually paying for fonts,” but regardless of your intent, the tone of the comment seemed standoffish and arrogant.\n\nI’m not saying that good fonts shouldn’t be paid for, nor am I defending this person if they are indeed asking where they can get a commercial font for free. I’m suggesting that you shouldn’t automatically dismiss someone because they are asking for a free font. Maybe in an ideal world this person would pay for a Grolsch, but because they can’t justify spending the money they’ll have to settle for a Keystone.\n\nInstead of being taken aback whenever someone doesn’t understand that fonts aren’t always free, maybe you should try to figure out why so many people don’t understand that fonts are a paid-for good just like anything else, and then try to educate them. If you wnt more people to be interested in and to understand type, then be friendly to them and help them kindly, instead of pointing out their ignorance.\n\nEdit: I just realized where the idea that I think paying for fonts constitutes elitism came from. That’s not at all what I am suggesting. I’m only suggesting that implying that someone is ignorant for not realizing that fonts are paid commodities without providing any help or explanation is counterproductive. You could have followed up your comment by directing them to a foundry that could help, like Veer. Instead you simply said, “pay for fonts,” without giving them any direction. There are lots of places you can pay for fonts, but only a few where you can find the kinds of typefaces you’re looking for.\n\n"
    },
    {
      "time": " 29.May.2008 4.09pm",
      "content": "eh, the problem I see with free fonts is lack of characters or kerning issues, but honestly if you’re going to set one word, once, any free font will suffice if you massage it enough…\n\n"
    },
    {
      "time": " 30.May.2008 7.37am",
      "content": "DINC type has some decent retro fonts, I believe they are shareware or freeware... [DINC Type](http://web.archive.org/web/20081015213741/http:/www.girlswhowearglasses.com/).\n\n"
    }
  ]
}
