{
  "id": "45740",
  "title": "logo critique",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi everyone. Just looking for any opinions on these logos I’ve recently come up with. Good or bad, I’d like to hear your thoughts. Oh, the logo is for a possible TV production company.\n\n ![](http://web.archive.org/web/20080907013020im_/http:/www.typophile.com/files/firecracka_ident_6183.png)\n\n [‹ Elegant and formal with distinctive touches](http://web.archive.org/web/20080907013020/http:/www.typophile.com/node/45673 \"Go to previous forum topic\") [Correct use of small caps at the beginning of a paragraph ›](http://web.archive.org/web/20080907013020/http:/www.typophile.com/node/17024 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907013020/http://www.typophile.com/user/23155\" title=\"View user profile.\">jazzhustler</a>",
  "time": "<br>",
  "uid": "23155",
  "comments": [
    {
      "time": " 26.May.2008 12.51pm",
      "content": "I’m feeling #3 with the stick of dynamite in the middle, but be careful, don’t make your design too phallic either (not that it is, but it’s easy enough to do)\n\n"
    },
    {
      "time": " 26.May.2008 1.00pm",
      "content": "Out of these I like the very first one (1). It’s simple, one color, and probably the most powerful, out of the shown ones. _(Version 3 and 4 just look a tad too ’clip arty’, for me. There is too much happening. Perspectives, outline type, very small type.)_\n\nDav\n\n"
    },
    {
      "time": " 26.May.2008 1.08pm",
      "content": "I’d say first one, maybe with some correction on the dynamite thread (a little thicker?)\n\n"
    },
    {
      "time": " 26.May.2008 1.23pm",
      "content": "I agree on #1, it’s the most professional and straightforward to me.\n\nThat said, I know video and web companies tend to prefer lots of color, 3D effects, etc because it looks “cool”. I suspect they’ll like #3 best, and animated it offers a lot of possibilities. I would definitely get rid of the clip art firecracker, though, it’s very, very clip art in feel and design. For one thing, replace the fuse since the current tone looks like a piece of rope from Home Depot (I’m guessing it was done by someone who’d never seen a fuse before), and light it.\n\n"
    },
    {
      "time": " 26.May.2008 1.26pm",
      "content": "well, with #1 you’d have to use that entire thing\n\nif you use #3 or #4 you could always use the dynamite alone as a logo for smaller applications where the entire logotype isn’t needed, solution #1 doesn’t allow for that.\n\n"
    },
    {
      "time": " 26.May.2008 1.40pm",
      "content": "I really like the #1 and #2, the #2 is even better ’cause you get rid of the bakground, besides, it will work great in two colors.  \nI’ve to disagree with innovati, ’cause you can always use the I with the thread for small applications of the logo.\n\n"
    },
    {
      "time": " 26.May.2008 2.11pm",
      "content": "with a TV production Company, I guess you’d get to add some animation?\n\n# 3 and 4 work well together for that, I think.\n\n#3 animated ... fuse burns down / dynamite blows up - letters all over the place / next screen in the credits, or what ever.\n\n#4 as a static version.\n\n#1 is nice and professional looking, and that may be why there are so many logos like that out there (grungy painted-with-a-roller background)\n\n#2 this one feels too corporate for the spelling of “Firecracka” and the use of such an industrial strength stencil font. But, that said, it’s just my two cents, #1 & #2 would also work together as dynamic and static versions of the same logo.\n\n-=®=-\n\n"
    },
    {
      "time": " 26.May.2008 3.03pm",
      "content": "Thanks for all the comments so far, it really makes contributing to these forums a joy, along with being a 2nd (3rd, 4th & 5th) opinion. It also helps to arm me with professional opinions with respective clients, as I’m sure you’re aware, a lot of the time they either don’t have the taste to tell good from bad, or don’t really know what they want!\n\nAnyway, I’ve got some more ideas to do, so thanks. I’d just like to address a couple of points made;\n\ninnovati - I’ll bear the ’phallic’ angle in mind!\n\nFormlos - granted, the stick of dynamite does look clip-arty, but that was sort of the intent, and for the record, I constructed it from scratch in illustrator.\n\nTezzutezzu - I think you’re right with the thickness of the thread - good call.\n\nnmerriam - you’re right about the fuse, so a change of colour should help. You’re right I’ve never lit a fuse before let alone handle a stick of dynamite, so no surprise I got it wrong really.\n\nSo far, #1 seems to be favoured by most people here, and that has also found some favour with the client, so with your help I can now carry on.\n\nThanks so much to all.\n\npeace\n\nSimon.\n\n"
    },
    {
      "time": " 26.May.2008 3.04pm",
      "content": "When you add a rim like in #3 and #4, make sure it looks good. Right now, #4 reads FIREC-RAC-K’A. Remove the white from between C and R and between C and K, and don’t let the white descend so far down like between the last two letters.\n\n"
    },
    {
      "time": " 26.May.2008 5.36pm",
      "content": "1\n\n"
    },
    {
      "time": " 26.May.2008 5.54pm",
      "content": "I like #1 as well. Graphic and simple. You could always have a 2nd reversed version - all red with no paint swash behind it.  \nI might also make the “I” a bit more like a firecracker, but you’ve probably already tried that....\n\n"
    },
    {
      "time": " 27.May.2008 6.36am",
      "content": "Thanks Rainer, aluminiium & TDF, I’ve added these comments to my list of things to look into.\n\nJH\n\n"
    },
    {
      "time": " 27.May.2008 11.26pm",
      "content": "1. without the fuse cord.\n\n"
    },
    {
      "time": " 28.May.2008 1.36am",
      "content": "Some variation on 2, bit colours need some work. Not too keen on the typeface either.\n\n"
    }
  ]
}
