{
  "id": "45743",
  "title": "Commercial use of lasercut outline",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Can someone advise me on the legality of using a type outline to lasercut an item for sale commercially? What issues are there that would effect this?\n\nThanks for your help!\n\n",
  "author": "cmoffett",
  "time": "26 May 2008 — 6:34pm",
  "uid": "31595",
  "comments": [
    {
      "time": "26 May 2008 — 6:36pm",
      "content": "Depends on the license. If you can tell me which foundry makes the font you're using I might be able to help you interpret the license.\n\n"
    },
    {
      "time": "26 May 2008 — 7:21pm",
      "content": "Thanks! I haven't decided on fonts yet. It will be several. Probably common ones, like Times New Roman, Helvetica, something from Adobe... But I'm somewhat flexible. Is there something I should be looking for in the license?\n\n"
    },
    {
      "time": "28 May 2008 — 8:45am",
      "content": "Is it a typeface you own yourself that you would like to use the outline to commercially lasercut? Sorry I seem to be misunderstanding something. \\*Me in your position... I want to laser cut the outline of Akkurat for say... a furniture manufacturer... and we own the typeface, then we would generally go ahead and do it. Is this what you mean?\n\nSorry if Im being slow. Long day.\n\n\\_\\_  \nRez\n\n"
    },
    {
      "time": "29 May 2008 — 4:36am",
      "content": "_using a type outline to lasercut an item for sale commercially? What issues are there that would effect this?_\n\nIt would depend on the foundry and their EULA. That is the contract between the foundry and the user.\n\nIt seems to me in general, that wall signage, alphabets made as stickers or the letterforms themselves as the object being resold with the font design being the only distinguishing factor from raw material (or unsellable without the font design): is a case of the type design being translated into another media and in need of additional licensing. The type design in .ttf, .otf, rub down transfer, or personal die cutting system is still the same type design, just another media.\n\nIf the commercial product being sold was a teak chair with a name engraved into the backrest, then the item being sold is not the font but the chair. The font is not the \"selling\" component of the chair but rather an incidental component.\n\n"
    }
  ]
}
