{
  "id": "45759",
  "title": "looking for 3 font combo (serif, sans serif, deco script)",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi. I am new to this forum, so please be patient with me. I am looking for a three font combination (maybe only two) for on-screen display.\n\nOne serif that has got a very old, original touch (like Garamond) that looks at 18px and up, white on dark background. I like something rather narrow, like the Apple Garamond, but I'm not sure about that.\n\nThen I need an \"Arial replacement\" font that works well with the serif font at 12px or maybe even 10px sizes.\n\nAnd once I've those two I would also like to find a decorative font to go with that. Something like a 17th century script that looks fine in 18px, haha.\n\n",
  "author": "Staublicht",
  "time": "27 May 2008 — 5:35am",
  "uid": "31611",
  "comments": [
    {
      "time": "27 May 2008 — 6:31am",
      "content": "For screen?\n\n"
    },
    {
      "time": "27 May 2008 — 2:40pm",
      "content": "Yes. This is for screen. I have got these fonts as placeholders currently: Apple Garamond, Arial, ITC Zapf Script. And I'm looking for fonts ot replace them.\n\nThe serif and the deco font should convey a feel of being very old. Tricorn hats and wigs :-).\n\n"
    },
    {
      "time": "28 May 2008 — 8:55am",
      "content": "I'm tending towards Caslon + Gill Sans now, with maybe Caslon Italic as alternative for some elements/headers.\n\n"
    },
    {
      "time": "28 May 2008 — 2:35pm",
      "content": "Could you give some more info on the project?\n\nAt small sizes I would use a screen hinted typeface. Maybe one of them websafe fonts might help you out. Verdana, or perhaps Geneva? Both differ quite a lot from Arial though.\n\nBoth Adobe Caslon Pro and Adobe Garamond Pro have swash italics, and both ship with Creative Suite!\n\n"
    },
    {
      "time": "29 May 2008 — 2:09am",
      "content": "Gill Sans MT and Gill Sans for Mac are very much screen safe I think. I won't be able to use Opentype swashes and ligatures. I will be happy, if I we are able to get those two standard fonts working properly in our project.\n\nAbout the project: Its a game project. :-)\n\n"
    }
  ]
}
