{
  "id": "45780",
  "title": "new logo critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,  \nI've been working on this logo concept for an estate agent company. I am very interested to get anyone's thoughts on it.  \nI could do with some fresh eyes really. I'm not sure about the type yet, whether it'll be all caps etc.\n\n ![](http://web.archive.org/web/20101017054858im_/http:/typophile.com/files/logo_4406.jpg)\n\n",
  "author": "<a href=\"/web/20101017054858/http://typophile.com/user/31622\" title=\"View user profile.\">toby1</a>",
  "time": "<br>",
  "uid": "31622",
  "comments": [
    {
      "time": "",
      "content": "I like how you've handled the wording, but the main logo seems lacking.\n\nIt looks half-way inbetween a blackletter 'r' and a house, and the ° symbol looks like a sun?\n\nI think you either need to make it a house with a ° symbol, or else make it an 'R'.\n\nThe thought of that symbol though, a house or R with a ° is a wonderful and genius idea, take it right to the bank, that's the money-maker right there.\n\nI wanna see more work on it and have it resolved better because it's not that often that a concept with that potential comes along.\n\nEDIT: it's very ‘paul rand’ in it's simplicity and clarity of message\n\n"
    },
    {
      "time": "",
      "content": "please post JPGs in RGB format so everyone can see it.\n\n"
    },
    {
      "time": "",
      "content": "Sorry about that, i thought it was RGB, hopefully it should work now.\n\nInnovati:  \nThanks very much for your quick comments. It started as just the 'R' with ˚ symbol, but I wasn't sure if when used on its own whether it would be relevant to property.  \nI'm glad you think it has potential to work, I was starting to wonder if the message was clear enough\n\n ![](http://web.archive.org/web/20101017054858im_/http:/typophile.com/files/logo_3828.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I'd make it the same 'R' as you have in the logotype, whatever you choose that to be.\n\nRight now if I just saw the house/R I wouldn't recognize it as either an 'r' or a house.\n\nIf you have a red R° I think people will see R....red degrees hot? oh, Redhot! of course!\n\nI think once they know the name there's enough information in R° to convey that whole thought.\n\nJust for fun though, had you at any point tried red° or Red°? I know it's close to that stupid retard(red) campaign, but I think it could work as a viable alternative to help you keep some options open - and who knows, maybe you can develop that too and see if that does allow you any freedom R°doesn't (although it might be more limited too, you never know)\n\nI wanna see more!\n\n"
    },
    {
      "time": "",
      "content": "Thannks for your feedback. I'm excited about the potential of it, hopefully i can get something out of it.  \nI'll get to work!\n\n"
    }
  ]
}
