{
  "id": "45803",
  "title": "Off to Typo Berlin 2008",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "First time & pretty excited. ; )\n\nI wonder who among my fellow Typophiles is going to be there too (Thomas P. I know about…)…\n\n+++  \nBert Vanderveen BNO\n\n [‹ Question about OT Scripting and file size](http://web.archive.org/web/20081123103013/http:/www.typophile.com/node/46034 \"Go to previous forum topic\") [Orphan Works Copyright Bill ›](http://web.archive.org/web/20081123103013/http:/www.typophile.com/node/45560 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081123103013/http://www.typophile.com/user/3972\" title=\"View user profile.\">bert_vanderveen</a>",
  "time": "<br>",
  "uid": "3972",
  "comments": [
    {
      "time": " 28.May.2008 8.14am",
      "content": "Have a great time!\n\n"
    },
    {
      "time": " 28.May.2008 10.19am",
      "content": "I’ll be there too ... don’t try to put all the interesting items on your schedule ... my annual failure ;-) Have a nice time!\n\n"
    },
    {
      "time": " 28.May.2008 11.44am",
      "content": "I hope you all take & post lots of great images/video for those of us that can’t go.\n\nHave a great time!\n\n"
    },
    {
      "time": " 29.May.2008 1.21am",
      "content": "There’s already a [flickr group for Typo 2008](http://web.archive.org/web/20081123103013/http:/flickr.com/groups/typo2008/).\n\n"
    },
    {
      "time": " 3.Jun.2008 11.30am",
      "content": "The most inspiring photos and resumes (but in german language only) you can find at HD’s Blog:  \n [http://www.hdschellnack.de/?p=2741](http://web.archive.org/web/20081123103013/http:/www.hdschellnack.de/?p=2741 \"http://www.hdschellnack.de/?p=2741\")\n\n"
    },
    {
      "time": " 3.Jun.2008 1.56pm",
      "content": "Aw shoot, just saw this thread now, and I never met up with Bert or Nora while I was there. Oh well, maybe next time?\n\nT\n\n"
    },
    {
      "time": " 4.Jun.2008 6.34am",
      "content": "Thomas, you know how it us — intimidated by the high and mighty ; ).  \nLiked your talk. Too bad about it being cut short to 45 minutes.  \nOh, def. next time (=third time, counting Utrecht last year and TypoBerlin this year).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 4.Jun.2008 9.54am",
      "content": "Bert —\n\nMaybe this is the year to come over to TypeCon, and you can meet everyone there!\n\nWe love having as many Dutch in attendance as possible. ;-)\n\n— Kent.\n\n"
    },
    {
      "time": " 5.Jun.2008 8.25am",
      "content": "Bert:\n\nIt wasn’t exactly cut short, it’s just that I had about an hour’s worth of content that I was trying to fit into 45 minutes.\n\nPlease do introduce yourself next time! Given that you’re in the Netherlands, perhaps you’ll consider coming to ATypI in St Petersburg this year? Registration and program info will be live in a few days.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 5.Jun.2008 8.35am",
      "content": "Thomas: one hour content trying to fit into 45 minutes is okay! But three hours content fitting in 60 minutes, as Rich Roat did was at the border of collapsing ;-) But great! I saw you talking with people but there was not enough room and time ... crowded in between more than thousand peoples, hurrying from one lecture to the other ... but perhaps we’ll get it next time!\n\n"
    },
    {
      "time": " 5.Jun.2008 10.40am",
      "content": "Kent, thanks for the invite… but I am still unworthy. I did a fast font in 1994 and nothing since then. This year I want to do a revival to learn FontLab and after that… who knows.  \nI might even go to TypeCon, next year.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 6.Jun.2008 5.33am",
      "content": "Unworthy?! Bert, the only qualifying characteristic for coming to TypeCon is that you love type. Or (in the case of spouses, I guess) be willing to hang out for long periods of time with obsessive people who love type ;-) Think of it as face-to-face Typophile for five days.\n\n— K.\n\n"
    },
    {
      "time": " 6.Jun.2008 9.46am",
      "content": "I think that’s true for ATypI as well. The prime requisite is that you love type.\n\nT\n\n"
    },
    {
      "time": " 6.Jun.2008 10.32am",
      "content": "Bert, I went to Typecon last year when I was a rising senior in design school who had designed one font and didn’t even have a specimen because my laptop had been stolen and it took me a few weeks to find it in my screwed-up backup archive. Everyone was friendly, people had tons of suggestions for my senior thesis, and I learned so much that I felt like I was on speed for the next three months.\n\n<cite>I think that’s true for ATypI as well. The prime requisite is that you love type.</cite>\n\nWell, that and having the money for St. Petersburg ;)\n\n"
    }
  ]
}
