{
  "id": "45837",
  "title": "TypeTogether Newsletter May 2008",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20080605055115/http:/typophile.com/user/7006 \"View user profile.\") : 29.May.2008 1.18am \n\nLatest news:\n\n**NEW RELEASE: Athelas**  \nAthelas is finally available at our online store. It is an elegant typeface intended for fine book printing, inspired in Britain’s literary classics. Athelas takes full advantage of the typographic silence, that white space in the margins, between the columns, the lines, the words, the lettershapes and finally, within the characters themselves.\n\n[See more of Athelas](http://web.archive.org/web/20080605055115/http:/www.type-together.com/ampl_font.php?idpuente=5)  \n [Buy Athelas](http://web.archive.org/web/20080605055115/http:/www.type-together.com/order_font.php?idpuente=5)\n\n**EXHIBITIONS: TypeTogether exhibit in Rosario**  \nOn Wednesday May 21st, TypeTogether opened its exhibition in Rosario Argentina. It presents some of the best known typefaces that TypeTogether has released and a few font families that are still under development. It also focuses on the design process for text typefaces, from conception to reader.\n\nGiven its high educational value, flexibility and portability, there are already plans for showing the exhibition in educational institutions and events around the globe.\n\n[Contact us to receive information about hosting the exhibition](http://web.archive.org/web/20080605055115/http:/www.type-together.com/contact.php)  \n [See some images of the exhibition](http://web.archive.org/web/20080605055115/http:/www.type-together.com/exhibit_news.php)\n\n**TYPE IN USE: Athelas**  \nThe Society of Argentinian Bibliophiles selected Athelas for the edition of a selection of works by Pastor Obligado: ’Tradiciones Argentinas’. The 70 copies of this limited edition were printed in letterpress and they show Athelas in use in a luxury book environment, with careful typesetting and printed over a fine handmade paper.\n\n[See the pictures](http://web.archive.org/web/20080605055115/http:/www.type-together.com/typeinuse.php)\n\n**EDUCATION: Workshops on type design**  \nVeronika Burian and José Scaglione presented their new workshop on type design in Colombia and Argentina. The workshop is designed to quickly introduce attendees to the problems and particularities of typeface design. Concepts as graphic coherence and ductus are tackled in a very practical way that allows students to acquire basic skills of type sketching in just a few hours.\n\nThe Workshop currently exists in two formats. In the 1-day workshop attendees work only with tracing paper and different sketching techniques while in the 2-day workshop they also incorporate computer tools for digitization.\n\n[Click here to see images of the workshops](http://web.archive.org/web/20080605055115/http:/www.type-together.com/workshop_news.php)  \n [Click here to learn more about hosting a workshop in your company or school](http://web.archive.org/web/20080605055115/http:/www.type-together.com/contact.php)\n\n**NEW RELEASE: Crete italic**  \nCrete has two new family members, Thin and Thick Italic, two very useful additions. They are true italics, with alternate letterforms, and therefore have, in some cases, different letter widths than the romans. However, they sit comfortably next to the uprights and are metrically interchangeable within themselves.\n\n[Click here to see more of Crete Italic](http://web.archive.org/web/20080605055115/http:/www.type-together.com/ampl_font.php?idpuente=9)\n\n**CALL FOR SUBMISSIONS: “Type in use”**  \nWe’d love to see samples of your work that use our typefaces. Please feel free to post us your work by email to info(at)type-together.com. Also, include appropiate credits and contact details for publishing.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080605055115/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 29.May.2008 1.18am",
  "uid": "7006",
  "comments": [

  ]
}
