{
  "id": "45845",
  "title": "Disable PDF Stripping",
  "forum": "Build",
  "tags": [

  ],
  "content": "Does anyone have any good tips to prevent fonts from being stripped from PDF’s?\n\n [‹ Preview in Fontmenues (MS Word)](http://web.archive.org/web/20080907165517/http:/www.typophile.com/node/45890 \"Go to previous forum topic\") [FontLab Question ›](http://web.archive.org/web/20080907165517/http:/www.typophile.com/node/45811 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907165517/http://www.typophile.com/user/3320\" title=\"View user profile.\">malcolm</a>",
  "time": "<br>",
  "uid": "3320",
  "comments": [
    {
      "time": " 29.May.2008 4.08am",
      "content": "converting text to outlines has got to be the simplest method, although with lots of text it will bump up the file size.\n\nJH\n\n"
    },
    {
      "time": " 29.May.2008 6.44am",
      "content": "don’t put your fonts in the PDF to begin with.\n\n"
    },
    {
      "time": " 29.May.2008 10.10am",
      "content": "Subset them.\n\nI’m assuming this is for a specimen. If you turn the fonts to outlines you are not showing the fonts in action. People will not be getting to see the actual fonts. Also, turning them to outlines gives anyone access to the outlines who wants them.\n\n"
    },
    {
      "time": " 29.May.2008 1.31pm",
      "content": "Hey Tiffany, just so I’m clear, what do you mean by “..you are not showing the fonts in action”? Also, just so I know for future reference, how does turning them to outlines give anyone access to them, assuming you lock the pdf in the first place? I’m genuinely asking - not being argumentative.\n\nJH\n\n"
    },
    {
      "time": " 29.May.2008 2.16pm",
      "content": "I just mean that turning them to outlines renders them as vector artwork and not font software with hinting intact.\n\nAlso, there are programs out there that can crack a PDF.\n\n"
    },
    {
      "time": " 30.May.2008 11.09pm",
      "content": "The only way to be sure no one can rip off a font is to make sure that no-one sees it.\n\n"
    },
    {
      "time": " 31.May.2008 2.27am",
      "content": " **“The only way to be sure no one can rip off a font is to make sure that no-one sees it.”**\n\nBy far the wisest comment ever seen on Typophile.\n\nThe same holds true for all sorts of works:\n\nUnpublished works have never been copied.\n\n"
    },
    {
      "time": " 31.May.2008 2.54am",
      "content": "On the face of it Christian’s comment might seem stupid, but I think what he’s really saying is there is no way to stop someone ripping your font. If they really want to get it, they’ll figure one way or another of getting in.\n\nUnhelpful comment if it’s not going to be qualified by an explanation though, I grant you.\n\nJH\n\n"
    }
  ]
}
