{
  "id": "45852",
  "title": "Magnolia - a modern italic",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi all\n\nI'd like to hear your comments on this typeface. I know it needs work, but I'm not exactly sure which quirks are \"features\" and which are \"bugs\".\n\nIt's opentype with a few ligatures (mostly ones needed to get this particular text looking OK) and a couple contextual alternates. It's my first attempt at OT.\n\nBTW, I just noticed the second attachment was marked 2 June 2007, which is impossible, so I fixed that.\n\n| Attachment | Size |\n| --- | --- |\n| [lathe.pdf](http://web.archive.org/web/20150417110141/http:/typophile.com/files/lathe.pdf) | 18.59 KB |\n| [lathe.pdf (2 June 2008)](http://web.archive.org/web/20150417110141/http:/typophile.com/files/lathe_0.pdf) | 18.71 KB |\n| [sample.pdf (7 April 2009)](http://web.archive.org/web/20150417110141/http:/typophile.com/files/sample_7.pdf) | 24.54 KB |\n| [sample.pdf (6 June 2009)](http://web.archive.org/web/20150417110141/http:/typophile.com/files/sample_8.pdf) | 24.34 KB |\n| [multilingual sample (6 June 2009)](http://web.archive.org/web/20150417110141/http:/typophile.com/files/pr-Magnolia.pdf) | 200.18 KB |\n\n",
  "author": "mr",
  "time": "29 May 2008 — 4:38am",
  "uid": "19503",
  "comments": [
    {
      "time": "29 May 2008 — 6:10am",
      "content": "To me, it almost seems as though the lowercase and uppercase are from two entirely different families. I really like the caps. They sort of have a feeling close to Filosofia Grand (albeit italic), looking classic and refined, while the lowwercase have this quirky, playful characteristic about them. I think the curved terminals and ball serifs are making the rest of the letterforms seem a little more whimsical, which is not necessarily a bad thing. The kerning on the lowercases seems a little tight in most cases too. Is the \"gg\" a ligature? It seems as though the overlap isn't quite right. The width of the bottom loop may require it to be ligated. The bottom of the bottom loop also looks a little dark to me, along with the first vertical stroke on the lowercase w. The tittles and punctuation seem a little heavy to me as well.\n\n"
    },
    {
      "time": "29 May 2008 — 6:54am",
      "content": "Hello Max, I like it very much, I hope you can work it out.  \nYes, the spacing is too tight now.  \nWhy did you call it \"Magnolia\" ?\n\n"
    },
    {
      "time": "29 May 2008 — 11:42pm",
      "content": "Chipman223:\n\nI see what you mean about the caps and lowercase. Maybe I'll separate the caps out and do something different with them. Whimsy was my intention, though, so I'll work on the lowercase for now.\n\nI'm going to work on spacing now.\n\nYou're right, the 'g' and 'w' do have weight issue. No, 'g' is not ligated -- that might change.\n\nThanks for your help.\n\nAlessandro: I'm glad you like it. I'm not entirely sure why I called it Magnolia. Perhaps I was aiming for the combination of lightness, neatness and prettiness that magnolias have.\n\n"
    },
    {
      "time": "30 May 2008 — 1:41pm",
      "content": "i like the contrast on the tail of g, it's attractive (maybe too attractive for body text though?) The word 'higher' looks lovely.  \nI might try making the t taller, k narrower on top arm (or waist more slanted), second arm of w starting a bit higher, and work on getting the shapes more even in colour and contrast.  \nthere's a lot of potential here i think, really nice.\n\n"
    },
    {
      "time": "2 Jun 2008 — 8:25am",
      "content": "I've respaced, adjusted k, t, q, tittles, and added an alternative g to substitute for the second one in \"gg\". I'm not sure if it's the right altervative, though.\n\n"
    },
    {
      "time": "7 Apr 2009 — 2:19pm",
      "content": "I've made dozens of tweaks since the last update (29 revisions recorded in version control). Highlights include: a complete set of numerals, an exclamation mark and a new question mark, improved spacing and a new 'w' (is this an improvement? I'm personally thrilled to be rid of the old one).\n\nIs this going somewhere? Am I on the right track with spacing? I can't bear to look at the original now, but I don't know if the current version is acceptable either.\n\nThe sample is here: [http://typophile.com/files/sample\\_7.pdf](http://web.archive.org/web/20150417110141/http:/typophile.com/files/sample_7.pdf)\n\n"
    },
    {
      "time": "8 Apr 2009 — 7:39am",
      "content": "\"Page not found\" - maybe try adding the pdf as an attachment to your top post.\n\n"
    },
    {
      "time": "10 Apr 2009 — 2:53am",
      "content": "Yeah, the attachment form wasn't working for me the other day. It's attached now.\n\n"
    },
    {
      "time": "18 May 2009 — 9:08am",
      "content": "All those tight curls are kind of too fiddly to my eye - I find it more attractive at small sizes where that detail drops out - but that's really a personal preference, not an objective flaw.\n\nShape of 'w' is improved, but its same-but-different top serifs make me do a double-take.\n\nSpacing is much improved.\n\nIs 'r' too wide? Should its arm branch out lower on the stem?\n\n'4' looks less like a four and more like Prince's next name! ;-)\n\nShould '6' and '9' have some kind of terminal on their loose ends?\n\nBeginning and end of '8''s stroke don't relate happily to each other in position.\n\nI think your ligatures are fantastic!\n\n"
    },
    {
      "time": "6 Jun 2009 — 5:44am",
      "content": "Thanks for the comments, Craig. I've changed the middle serif of the 'w' to match the left one (I think I was trying to compromise between the left and the right, but perhaps that was a bad idea). Thanks for the 'r' suggestion: I think that's a big improvement.\n\n_Beginning and end of 8's stroke don’t relate happily to each other in position._\n\nPersonally, the '8' is my favourite of the numerals; I agree that's \"fiddly\", but that's part of the look. Do you have any concrete suggestions on how the ends might meet more happily?\n\nOnce again, thanks for the comments.\n\nI now have Windows-1252 coverage, as well as Latin-3 (because I'm an Esperanto speaker)\n\n"
    },
    {
      "time": "5 Jul 2009 — 2:45am",
      "content": "I've been kinda dissatisfied with the _z_ for a while, so I'm trying yet another shape:\n\n ![](http://web.archive.org/web/20150417110141im_/http:/typophile.com/files/zeds_4197.png)\n\nDo typophiles have a preference? They both need work, but which one should I work on?\n\n"
    },
    {
      "time": "5 Jul 2009 — 6:27am",
      "content": "Still experimenting:\n\n ![](http://web.archive.org/web/20150417110141im_/http:/typophile.com/files/newz_6456.png)\n\n"
    }
  ]
}
