{
  "id": "45862",
  "title": "What font is this?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20131014053419im_/http:/typophile.com/files/downing_st_5358.png)\n\nWhat is this font? Is it Gill Sans but condensed? The R slightly curls at the bottom. Is it possible to estimate the leading, tracking and kerning of the type 'Downing Street'? What do you think?\n\n",
  "author": "missgiggles",
  "time": "29 May 2008 — 8:46am",
  "uid": "14600",
  "comments": [
    {
      "time": "29 May 2008 — 8:51am",
      "content": "I think it looks like Univers. (BTW, please use a more descriptive title for your posts, so that they are distinguishable in the list of threads. \"Downing Street sign\" would have been good for this one).\n\n- Mike Yanega\n\n"
    },
    {
      "time": "29 May 2008 — 8:58am",
      "content": "Univers condensed. By the way, the City of Westminster are cracking down hard on copyright infringements of their iconic street signs, so be warned if you are going to imitate ...\n\n"
    },
    {
      "time": "29 May 2008 — 1:08pm",
      "content": "Matthew, it's for a design project that HAS to portray 'politics', 'British' and '10 Downing Street'. I just have to. There isn't any other way. I've tried the British flag and colours etc. My tutor said as simple as possible so this is the way I am going. What do you think of the ones I have done so far? I have posted them on a separate thread. It would be nice to have opinions. Please visit the following link to my other thread:\n\n[http://typophile.com/node/45871](http://web.archive.org/web/20131014053419/http:/typophile.com/node/45871)\n\nPS Mike: Thank you. I shall keep that in mind.\n\n"
    },
    {
      "time": "29 May 2008 — 3:15pm",
      "content": "I do not know how IP law works in UK but in the US you would be exempt if under Fair Use, it was used in satire, artistic derivative work journalism or student academia.\n\n"
    },
    {
      "time": "31 May 2008 — 12:32pm",
      "content": "I think Westminster council's problem is street traders selling unlicensed souvenirs with Carnaby Street or Piccadilly Circus signs etc. I don't think homages to the style would worry them too much. Quite common on book jackets.\n\n ![](http://web.archive.org/web/20131014053419im_/http:/typophile.com/files/OnlyInLondon_6524.jpg)\n  \n(I'm not sure this particular example matched the type very accurately but it was the first one that came to mind.) \n"
    },
    {
      "time": "1 Jun 2008 — 10:29am",
      "content": "Justin: What type is that? It isn't the actual one is it? Close though, I think. I's still like to know though. Thanks.\n\n"
    }
  ]
}
