{
  "id": "4587",
  "title": "Monotype Typefaces Book",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was in a used-book store today and came across a cool and really old-looking \"Monotype Typefaces\" book from Lanston Monotype Machine Co. The only other info I could find on it was that it was printed in Philadelphia. I tried to buy it but the guy wanted to price it on the internet. I just did a quick search and only found something similar to the book on ebay, going for $6.50.   \n   \nMy question is, how much does a spec book like this go for? This one isn't in good shape, but it's cool nonetheless. Also, once I have this thing, what do I do with it? :^)\n\n",
  "author": "whoisdan",
  "time": "3 May, 2004 - 8:40pm",
  "uid": "2739",
  "comments": [
    {
      "time": " 4 May, 2004 - 12:07am",
      "content": "Daniel   \n   \nThere is currently a type specimen book mania among collectors on eBay. The book you were looking at might be worth $20 to $40, maybe a bit more. Much more to folks interested in metal Monotype and the code numbers etc. I have one. It is cool, not as cool as some, but not bad. Specimen books like this are often not in good shape (as they were often extensively used) and collectors seem to do an awful lot of upgrading.   \n   \nRecently on eBay there was a 1840s specimen book from the Bruce Type Foundry in abnormally excellent condition. Extraordinary rare. It was priced at $9.90 or something with no reserve and completely in the wrong category. The seller sold collector plates, not books. So... I thought, boy oh boy. I mean, boy oh boy. I even wrote to him to verify that it was the orginal and not a later reprint. Well, to make a long story short, \"they\" slowly found it. I believe it sold at $3,660. Probably what about it was worth to a university collection, which is where it should have gone. Can you imagine the party at the unsuspecting seller's home that night?   \n   \nGerald\n\n"
    },
    {
      "time": " 4 May, 2004 - 8:25am",
      "content": "Awesome info. There's currently a ton of smelly, old, beat up spec books at this shop. Do you have any idea when these Monotype spec books were made or where inside I can find a date?\n\n"
    },
    {
      "time": " 4 May, 2004 - 1:19pm",
      "content": "Gerald, what a story!   \nYou should have driven there and offered him $100 cash-on-the-barrelhead for it.   \n   \nDaniel, you can figure out the dates by looking at the fonts shown! :-)   \n   \nhhp\n\n"
    },
    {
      "time": " 4 May, 2004 - 1:50pm",
      "content": "Daniel   \n   \nType specimen books are not often dated I'm afraid to say. Sometimes you can find a code (that might indicate date) on the bottom of a page or there may be a letter or notice of date from the foundry early on in the book. Neither the Lanston nor the British Monotype books that I have are dated. There is a huge Monotype site in Switzerland that has tons of information of the most arcane sort. Might be worth a look see.   \n   \n [http://www.letterpress.ch/content.html](http://web.archive.org/web/20051111085146/http:/www.letterpress.ch/content.html)   \n   \nGerald\n\n"
    }
  ]
}
