{
  "id": "45883",
  "title": "Bonset, my latest FontStruction",
  "forum": "Ricardo Cordoba's blog",
  "tags": [

  ],
  "content": "[**Bonset**](http://web.archive.org/web/20081205015931/http:/fontstruct.fontshop.com/fontstructions/show/52799) is my latest FontStruction (now that I have OS X at home, I am spending way too much time at FontStruct!).\n\n ![](http://web.archive.org/web/20081205015931im_/http:/www.typophile.com/files/bonset_sample_4427.png)\n\nMy version deviates from van Doesburg’s tight grid — it’s condensed, and I changed some of the glyphs. I also added a lowercase, and I’m slowly building up the diacritics, with the help of the [Typo-cz](http://web.archive.org/web/20081205015931/http:/www.typo.cz/euro/index.html) website for the Central European characters.\n\nSo far, it’s been a lot of fun!\n\n",
  "author": "<a href=\"/web/20081205015931/http://www.typophile.com/user/7716\" title=\"View user profile.\">Ricardo Cordoba</a>",
  "time": "<br>",
  "uid": "7716",
  "comments": [
    {
      "time": " 29.May.2008 7.56pm",
      "content": "Looks like my trial version of Keynote has spellcheck turned on. :-D\n\n"
    },
    {
      "time": " 29.May.2008 8.16pm",
      "content": "Nice! Wait—you’re using Keynote to make type samples?\n\n"
    },
    {
      "time": " 29.May.2008 8.41pm",
      "content": "Thanks, Mark... And I can explain about using Keynote! I just got a new computer, and I barely have anything on my hard drive! I was planning to download trial versions of Adobe applications today, but because of a glitch in the code, their downloads are not available until July 1... By then I will have bought the CS3 design suite, anyway. Meanwhile, er.... there’s Keynote. :-/\n\n"
    },
    {
      "time": " 29.May.2008 9.38pm",
      "content": "I heard recently (I think on Mac Break Weekly podcast) of a designer who does everything in Keynote. I did a book in Illustrator once. Thirty-some pages on an giant grid. Dave Eggers (of McSweeny’s fame) does all his writing in Quark 4.\n\n"
    },
    {
      "time": " 29.May.2008 10.16pm",
      "content": "_I did a book in Illustrator once. Thirty-some pages on an giant grid._\n\nMy hat is off to you, sir. That must have been quite a task! But it’s much better to present a book created in Illustrator than in MS Word (I’ve heard horror stories from printers in that regard). I understand Chip Kidd writes in QuarkXPress, too, but that’s less surprising, coming from a graphic designer. (And heck, even QuarkXPress 3 worked well as a word processor.)\n\nBut, yeah, it’ll be nice to finally try FontTool and FontLab at home, now that I have the right OS...\n\n"
    },
    {
      "time": " 30.May.2008 9.25am",
      "content": "The book I did in Illustrator (3.0, I think) was very graphics-heavy. Part of it was a timeline that spread over many pages. The book’s pages were set up as tiles. It was actually kind of nice to see it all at once, from a bird’s-eye view, and then zoom in to a particular spot to work. It was also nice to be able to work directly and in-context with the graphics on each page (the main reason it was done this way). Overall, it felt like a very organic way to work, but I don’t think it would be practical for most books. Bleeds would be a problem, for instance.\n\n"
    }
  ]
}
