{
  "id": "45889",
  "title": "Balancing an inverted logotype.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am working on a logotype, that will be used both in black on white background and in white on a black background. I've heard that some designers make the inverted logo version a bit lighter to counter balance the optical illusion that makes it look bolder.  \nHow common is this? Is it really necessary or does it just complicate things? And how much lighter should it be. Are there any general rules? I have been trying this out so much that I have lost all judgement.\n\n",
  "author": "Thord",
  "time": "30 May 2008 — 4:34am",
  "uid": "12494",
  "comments": [
    {
      "time": "30 May 2008 — 6:07am",
      "content": "I guess that it makes sense. I work on a magazine and every time we have white lettering on a black background the rule is to 'go up' one weight on the letters (i.e. if you are using book you should go to medium). It does make a difference, if we let it stay in book it appears to be smaller then it is. All the best.\n\nPedro Monteiro  \n [http://whatype.wordpress.com/](http://web.archive.org/web/20150416173130/http:/whatype.wordpress.com/ \"http://whatype.wordpress.com/\")\n\n"
    },
    {
      "time": "30 May 2008 — 6:49am",
      "content": "Traditionally, reversed type would be slightly heavier for two reasons:\n\n- ink creep  \n - visual balance compared to the non-reversed type\n\nSo, in the case of your logo, it really just depends on how it's going to be used, sizes it will be printed at, etc.\n\n"
    },
    {
      "time": "30 May 2008 — 7:07am",
      "content": "What aluminum said. I learned about this in design school. If I'm not mistaken, Hoefler & Frere-Jones took this into account for one of their proprietary magazine fonts, making a slightly bolder version of a typeface for cases where it would be reversed out.\n\n"
    },
    {
      "time": "30 May 2008 — 7:29am",
      "content": "I see... So if I'm taking into consideration ink creep then there should be at least one bolder version for small print and one less so for larger sizes.\n\nSince it's a logo it will be used in several sizes, printed on different material and with different techniques, and I will not be able or present to adjust it every time.\n\nFurthermore I'm not sure my client will see the difference but instead be rather annoyed by the hassle of having a huge number of logo files. I should mention that this is a quite small business, so there will be no team of inhouse designers ready to assure that the logo is reproduced perfectly every time...\n\n"
    },
    {
      "time": "30 May 2008 — 9:46am",
      "content": "For a logo you could just make a second version, and increase the thickness by a small percentage... I wish I had an actual number to give you! I'm sure someone has worked it out before.\n\n"
    },
    {
      "time": "31 May 2008 — 8:20pm",
      "content": "It is perfectly acceptable to make a logo in multiple sizes and weights. All this together along with documentation for their appropriate use comprise a corporate identity system manual, which you can charge a lot more for than a single logo.\n\nBut for a small business, limit their choices as much as is practical, i.e.: direct them to use one most of the time, and the bolder one when reversed out or below a certain size. Clear simple rules, ne?\n\n"
    },
    {
      "time": "31 May 2008 — 8:48pm",
      "content": "Being able to judge the sophistication of a client and their desire to use a system well is a part of the design.\n\n"
    },
    {
      "time": "2 Jun 2008 — 10:55am",
      "content": "It may also depend on the sizes at which you're expecting the logo to be used. If it's small (reversed on a businesscard, say) then you might need to do it. If it's to be used at a larger size, then it might not really be noticable.\n\n"
    }
  ]
}
