{
  "id": "45894",
  "title": "Need to identify font, please",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "And also need to find out if anyone knows is best method to use to make color in letters fade and change as in sample, hopefully can be done in Photoshop\n\n| Attachment | Size |\n| --- | --- |\n| [2font I like.jpg](http://web.archive.org/web/20081203165417/http:/typophile.com/files/2font%20I%20like.jpg) | 43.65 KB |\n\n [‹ Postscript and Suitcase Expert Fonts and iMac Leopard](http://web.archive.org/web/20081203165417/http:/www.typophile.com/node/45356 \"Go to previous forum topic\") [Great Typefaces T-Shirt Series ›](http://web.archive.org/web/20081203165417/http:/www.typophile.com/node/32867 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203165417/http://www.typophile.com/user/31758\" title=\"View user profile.\">ballbea</a>",
  "time": "<br>",
  "uid": "31758",
  "comments": [
    {
      "time": " 30.May.2008 7.47am",
      "content": "Sorry, I can’t identify the particular font, but incase you don’t have any other help, you can try this font for similar fonts -\n\n[http://www.sudtipos.com](http://web.archive.org/web/20081203165417/http:/www.sudtipos.com/ \"http://www.sudtipos.com\")\n\nselect the Bluemlein Script collection on the right of the page and there are some great script fonts there.\n\nJH\n\n"
    },
    {
      "time": " 30.May.2008 8.04am",
      "content": "that picture isn’t clear enough to tell the colouring, but if you can see it, then it can surely be done in photoshop.\n\nGoing from 1 colour |———————————| to another is called a ’gradient’ or a colour gradation and is easily done in Photoshop and the GIMP (a free bitmap graphics editor)\n\nIf the colours are more than just one colour to another it’s still very easy to do, and possible, but you’ll likely have to learn how to use Photoshop or something like that first and get used to how it works.\n\n"
    },
    {
      "time": " 30.May.2008 12.35pm",
      "content": "Boy. Talk about a photo finish. I’m a lettering artist and type designer and to be quite honest... I could go either way - type or hand lettering. The lighting of the scan has blurred many of the clues as well as heavied up one side further confusing things. I would lean towards hand, 51%... type, 49%. How is that for confidence?\n\nMichael.\n\n"
    },
    {
      "time": " 30.May.2008 2.52pm",
      "content": "I believe that is Olicana.\n\n"
    },
    {
      "time": " 31.May.2008 4.58am",
      "content": "I believe you are be right Miss Tiffany. The t is an obvious identifier. I was concentrating too hard on the duplication of the e’s and s’s. The blurring really messes with the weights. No excuse, bad Michael!\n\nMichael\n\n"
    }
  ]
}
