{
  "id": "45930",
  "title": "Help! Question about typeface usage on Mac",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The company I work for recently purchased the fantastic typeface Freight ( [http://www.garagefonts.com/typespecimens\\_2.html?sku=GF060014X1P2&start=1](http://web.archive.org/web/20081007165057/http:/www.garagefonts.com/typespecimens_2.html?sku=GF060014X1P2&start=1 \"http://www.garagefonts.com/typespecimens\\_2.html?sku=GF060014X1P2&start=1\"))\n\nUnfortunately, we haven’t figured out how we can use it correctly on Macs (we don’t have any PCs so I’m not sure if they have a similar problem).\n\nBasically, the system seems to be handling every style and variation as a separate typeface. I’m sure there’s a great reason for this, but since it’s the base typeface for all of our corporate use, it’s really inconvenient to have to change fonts every time we want italics, bold, etc.\n\nIs there some way to merge the text, bold, italic, and bold-italic so that the system recognizes them as a single font, and we can then use the formatting features of applications such as Word, Pages, Photoshop, etc. to select the style?\n\nThis is getting more frustrating by the minute (I’m working on a large document with lots of bold and italics as I write this), so any advice is appreciated.\n\nThanks!\n\n [‹ Type design as a career](http://web.archive.org/web/20081007165057/http:/www.typophile.com/node/46095 \"Go to previous forum topic\") [Fun, female font for logo ›](http://web.archive.org/web/20081007165057/http:/www.typophile.com/node/46143 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007165057/http://www.typophile.com/user/31812\" title=\"View user profile.\">jamesarcher</a>",
  "time": "<br>",
  "uid": "31812",
  "comments": [
    {
      "time": " 1.Jun.2008 2.02am",
      "content": "Have you tried using a font management program, such as the Linotype’s free Font Explorer? I have Freight, and it works perfectly with Fex in Photoshop and other CS applications. It doesn’t help with Word, though, I don’t know if anything does.\n\n[http://www.linotype.com/2493/fontexplorerx.html](http://web.archive.org/web/20081007165057/http:/www.linotype.com/2493/fontexplorerx.html \"http://www.linotype.com/2493/fontexplorerx.html\")\n\n"
    },
    {
      "time": " 1.Jun.2008 6.11am",
      "content": "Hello. Do you mind sharing some fonts? I am really interested in Freight, and have many top quality ones to exchange information on. Thanks.\n\n"
    },
    {
      "time": " 1.Jun.2008 6.39am",
      "content": "I had the same problem with Freight Text on a PC, and I couldn’t live with it. The oddball naming convention sucked the usefulness out of an otherwise great font.\n\nI have a program that allows me to rename fonts, which is what I did, and I am living happily ever after. I don’t know the Mac, or programs that can rename fonts on the Mac.\n\nI’d love to know what Darden was thinking, and if he would consider renaming the fonts for the rest of the type world outside his circle.\n\nI consider this a major professional lapse, and was part of the reason for my post some time ago, [“Unprofessional Fonts from Professional Designers”](http://web.archive.org/web/20081007165057/http:/typophile.com/node/34310) although at the time I didn’t mention Freight by name.\n\n"
    },
    {
      "time": " 1.Jun.2008 6.57am",
      "content": "<cite>Hello. Do you mind sharing some fonts? I am really interested in Freight, and have many top quality ones to exchange information on. Thanks.</cite>\n\nDear Phoenix:\n\nLet’s see if I understand. You’ve gone to a website populated mainly by type designers. These are people whose income comes from selling fonts. So, on this forum, you ask if anybody is interested in subverting the process whereby they earn their living.\n\nThat about right, or am I missing something? Maybe it is just that Phoenixii like flames?\n\n"
    },
    {
      "time": " 1.Jun.2008 10.44am",
      "content": "Some fonts are [style-linked](http://web.archive.org/web/20081007165057/http:/typophile.com/node/33757), which means they are built so that consumer-level apps like Office can access the bold and italic styles through their basic formatting UI. Many fonts, particularly those made for professional designers, are not style-linked. To quote Chester of [Village](http://web.archive.org/web/20081007165057/http:/www.typophile.com/wiki/Village):\n\nAny family of types with more than 4 styles — Regular, Italic, Bold, Bold Italic — is poorly served by style-linking. If a family has (for example) 7 weights in roman and italic, no style-linking arrangement seems terribly comfortable or logical.\n\nAlso read: [http://www.typophile.com/node/38914](http://web.archive.org/web/20081007165057/http:/www.typophile.com/node/38914 \"http://www.typophile.com/node/38914\")\n\n"
    },
    {
      "time": " 1.Jun.2008 10.12pm",
      "content": "Hey guys, thanks for the feedback. I believe that the issue is that Freight comes with a metric crapton of weights/styles, so it doesn’t fit in a traditional font family (R, B, I, BI).\n\nHowever, it would still be nice if I could create a “Normal” font family in additional to having all the individual styles/weights, so that I’d still have them available, but would also have the “easy” version for use in basic text docs, etc.\n\nAny recommendations on software that might be able to help me put something like that together?\n\n"
    },
    {
      "time": " 2.Jun.2008 1.44pm",
      "content": "No apologies for using “consumer-level apps” or for not being a “professional designer.” I’m grateful for those apps that let me override the questionable choices of “professionals.” Effete type designers do themselves a disservice by dismissing users of consumer-level apps. All those type designers who disdain pirates, rip-offs, and free fonts because it keeps them from getting just rewards for their efforts would also do well to eschew snobbish attempts to exclude non-professionals. BTW, it sounds like James is a professional. Or is he and his company not “professional” enough?\n\nFWIW, this is how I renamed and style-linked my Freight Text family of fonts:\n\nLight (R, I)  \nLight SC (R, I)\n\nBook (R, I B, BI)  \nBook SC (R, I, B, BI)\n\nMedium/Black (R, I, B, BI)  \nMedium/Black SC (R, I, B, BI)\n\nInfinitely better (for me) then the original naming.\n\nMaybe some regulars can suggest a program that James can use to do the same on his Mac.\n\n"
    },
    {
      "time": " 2.Jun.2008 3.07pm",
      "content": "FontShop International (based in Berlin, Germany) will style-link fontfamilies for a very reasonable fee.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 2.Jun.2008 8.33pm",
      "content": "Basically, I’m with Ren on this one. Style linking is the established norm and is what most users expect. Adobe, Microsoft and Apple all style link their fonts. In recent years a few foundries and designers have decided to buck the trend in the belief that making every font completely independent is better.\n\nThis belief severely limits a user’s ability to effectively create “based-on” styles and change them later, in apps like Word. It also defies the basic conventions of the way fonts work on Windows in particular.\n\nI was surprised to learn that Linotype for one makes their fonts both ways! Doing it both ways means that the vendor has issued two incompatible sets of fonts, which seems to me like a Bad Idea.\n\nI just did a talk at Typo Berlin on font quality, and I didn’t include this issue. Then again, I was cutting things to fit the time constraints already.\n\nCheers.\n\nT\n\n"
    },
    {
      "time": " 3.Jun.2008 11.04am",
      "content": "Bert: Fonts should come the way you need to use them without charge. FontBureau will style-link (not already linked) fonts for free. Some vendors even include TT, PS, and Mac in their packages at no extra cost.\n\nWhen I said that professionals should “eschew snobbish attempts to exclude non-professionals,” that was partly because I want to be included, and partly because they are limiting the number of paying customers. Unless of course they want to exclude non-professionals; usually they do that by humongous bundles or outrageous prices.\n\nPart of the problem with [not] style-linking is that mere mortals have no way of knowing, before the purchase, if styles are linked or not. If some designers or vendors are adamant about not style-linking, at least they should have the decency to alert potential customers before the purchase.\n\nIt’s never my intention to irk professionals unless their practices or behavior impinge on my use of their product.\n\nThat makes Thomas’ comments all the more gratifying. Thank you, T.\n\n"
    },
    {
      "time": " 8.Jun.2008 3.47pm",
      "content": "Thanks for the feedback guys. Glad to know that my desire to actually use our corporate typeface (Freight) in corporate documents (usually not laid out in InDesign!) doesn’t immediately push me into the category of hopeless noob.\n\nSo, that said, does anyone have any idea how a non-typographer like me can style-link Freight (or a subset thereof) for the Mac?\n\nIt seems like there ought to be some little software utility that does this, but all my Googling has thus far been in vain.\n\n"
    }
  ]
}
