{
  "id": "4598",
  "title": "(x) The Saturday Evening Post masthead - Post Black Italic {Mike Y}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "does anyone know what font is used on the masthead for the post? or if there is a similiar font out there?   \n [http://www.satevepost.org/index2.shtml](http://web.archive.org/web/20111216182725/http:/www.satevepost.org/index2.shtml) ![post masthead logo](http://web.archive.org/web/20111216182725im_/http:/www.typophile.com/forums/messages/83/35107.gif)\n\n",
  "author": "<a href=\"/web/20111216182725/http://typophile.com/user/1203\" title=\"View user profile.\">anonymous</a>",
  "time": "<br>",
  "uid": "1203",
  "comments": [
    {
      "time": "",
      "content": "A Nick's Font adaptation is [Saturday Morning Toast](http://web.archive.org/web/20111216182725/http:/www.myfonts.com/fonts/nicksfonts/saturday-morning-toast), though it's not italicized and it doesn't contain swashes.   \n   \nBy the by, according to Nick, the original face was called Curtis Post Shaded.\n\n"
    },
    {
      "time": "",
      "content": "I think Scriptorium has a version of Blanchard they call [Ruffian](http://web.archive.org/web/20111216182725/http:/www.myfonts.com/fonts/scriptorium/ruffian/). It's not italic either.   \n   \nThe problem is that often if people do digitize a classic typeface, they are cautious about using the name, and so you need to know it when you see it. I have tried to 'decode' the Scriptorium collection because David Nalle does a great job of recapturing some of the old designs, but he almost always changes the names.   \n   \nSo I guess, unless someone knows of some more interpretations, the answer seems to be that they are mostly in books right now.\n\n"
    },
    {
      "time": "",
      "content": "thanks mike. scriptorium has some great font choices. i think we are even thinking about asking them to recreate the exact font for a book title i'm working on. lets hope that works out!   \n   \nthanks again!\n\n"
    },
    {
      "time": "",
      "content": "Glad to be of help. Good luck with your project!\n\n"
    },
    {
      "time": "",
      "content": "Thought I'd mention that [Keystrokes](http://web.archive.org/web/20111216182725/http:/olena.com/fontsfordesign/preview.html) long ago digitized Roycroft   \nas Raven Croft. Not really pertinent for this ID, though, as there's   \nno italic.\n\n"
    },
    {
      "time": "",
      "content": "Also found, in my search for something entirely different ...   \n   \nThe Solotype Catalog shows a limited sampling of a typeface called Post Oldstyle Italic. Here's a scan:   \n   \n ![](http://web.archive.org/web/20111216182725im_/http:/www.typophile.com/forums/messages/83/35544.gif)\n\n"
    },
    {
      "time": "",
      "content": "i can't find samples of post black italic or blanchard or roycroft or buffalo on the web.   \n   \nare these available in books only?   \n   \nthanks for the info!\n\n"
    },
    {
      "time": "",
      "content": "There's a lot of material in Mac McGrew's \"American Metal Typefaces of the Twentieth Century\", but the bottom line seems to be that Post Black Italic looks most like what your sample shows, although the R is not as 'swashed' as your sample. There are a number of other faces, like Blanchard, Roycroft, Buffalo and Ben Franklin that appear very similar. You are talking about original designs dating from the early 1900's, so they weren't fonts then (not digital ones, I mean). I don't know which have been digitized.\n\n"
    }
  ]
}
