{
  "id": "45991",
  "title": "Monopoly GO",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Does anyone know a typeface that has a complete alphabet that looks similar to the GO in Monopoly?\n\n ![](http://web.archive.org/web/20150328042311im_/http:/typophile.com/files/go_6249.gif)\n\nI know there's a stigma attached to free fonts on this site, but I really can't justify spending any money on this — if I can't find a free typeface, I'll find an alternate solution. I'm making a book for a Monopoly-themed event, and the splash page for each section is going to say \"Collect $200 as you pass [section],\" with the [section] looking like the GO from Monopoly. I've looked through the square fonts section on — dare I say it — DaFont, but everything is either way off or not quite right.\n\nThanks in advance.\n\n",
  "author": "DrDoc",
  "time": "2 Jun 2008 — 1:56pm",
  "uid": "26018",
  "comments": [
    {
      "time": "2 Jun 2008 — 2:07pm",
      "content": "You should check out dafont.com. They might have something over there. I can't think of anything free like this. On second thought check out fontstruct.com too.\n\n"
    },
    {
      "time": "2 Jun 2008 — 2:13pm",
      "content": "I thought about making my own Fontstruction, but the letters like R and V get tricky.\n\n"
    },
    {
      "time": "2 Jun 2008 — 2:39pm",
      "content": "Given that it's only those two letters, I doubt there ever was a full font designed specifically for that.\n\nAnd since it's only those to letters, I'm not sure how exact you really need it to be anyways. A red, square typeface with black strokes is probably enough to communicate the concept.\n\n"
    },
    {
      "time": "3 Jun 2008 — 11:50am",
      "content": "I always associate monopoly with an early 20th Century sans like Gill. At least the old London edition I remember from my childhood was that sort of look.\n\n"
    },
    {
      "time": "4 Jun 2008 — 11:34am",
      "content": "Monopoly actually uses Kabal, which we're using for the \"Collect $200 as you pass\" part, but we need something for the section headings that looks like GO. I ended up making my own font in Fontstruct. Some of the letters look a bit wonky (R in particular), but I'll fix the outlines in Illustrator when I make the images.\n\nThanks for all of your help, everyone!\n\n"
    }
  ]
}
