{
  "id": "46",
  "title": "Proliferating a bitmap font",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "When setting type on the web today, you have two basic sans-serif choices, based on what most platforms will support: Arial and Verdana.   \n   \nVerdana quickly proliferated throughout the computer world thanks to the company who commissioned its design from Matthew Carter: Microsoft.   \n   \nIs it possible to get that type of exposure without giving the typeface away for free?\n\n",
  "author": "Jared Benson",
  "time": "26 Mar 2002 — 11:52am",
  "uid": "3",
  "comments": [
    {
      "time": "27 Mar 2002 — 8:48am",
      "content": "A tangent:   \n   \nIf you make a font with outlines and bitmaps, you can give away the bitmap-only version, get people hooked, and charge for the version that has outlines with the bitmaps embedded.   \n   \nThis is yet another way that bitmaps are superior to [delta-]hinting.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Mar 2002 — 11:05am",
      "content": "I don't/can't know when Spiekermann had the idea, but I've been saying it on-and-off here-and-there for about 2 years now.   \n   \nThe impediments:   \n1. The main ground in bitmap font design is already saturated - innovations like Jens's NNF cannot have great penetration in the mainstream.   \n2. The next leap in bitmap design seems to still be unimplementable, technically - even BitFonter falters there.   \n   \n\\> only a font's outlines are propietary   \n   \nI'm not sure what you mean. Are bitmaps not legally protected, maybe because they're not \"software\", and for some strange reason outline fonts are? Not that our legal systems (especially the one in the US) make any sense, but I think at best this is a gray area, especially when you consider that increasingly just plain data (like in a database) is starting to be seen as Intellectual Property.   \n   \nIn any case, since the bitmaps in a font cannot be easily extracted (certainly not if it's done through delta-hinting), this is a moot point. There has to be a multiple-version scheme - and naming gets tricky there, btw.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Mar 2002 — 10:36am",
      "content": "Erik Spiekermann shared a similar insight with us recently- one that we had never heard before. Apparently only a font's outlines are propietary, where you can give away the bitmap for free.\n\n"
    },
    {
      "time": "27 Mar 2002 — 10:54am",
      "content": "To embellish Jared's point:   \n   \nErik mentioned the purpose of this was intended   \nto allow multiple people to work on a project   \n(e.g. editing or copy-fitting) without having to   \nprocure additional licenses.   \n   \nI hadn't thought of the potential application for   \nWeb use.   \n   \nI do think, however, that in order for mass   \nadoption (to the level of Verdana, Arial, Times   \nand Georgia) the font needs to come pre-installed   \non an OS or bundled with a browser.\n\n"
    },
    {
      "time": "26 Mar 2002 — 2:13pm",
      "content": "No.   \n   \nhhp\n\n"
    }
  ]
}
