{
  "id": "46012",
  "title": "'Panic Room' Question: New Yorkers needed",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,  \na friend of mine is writing an article about movie title sequences.  \nHe has a question concerning the famous typographic one from [‘Panic Room’](http://web.archive.org/web/20131022064656/http:/www.imdb.com/title/tt0258000/), that might best be answered by locals, or people being familiar with New York City.\n\nWhere exactly are the places shown in the opening credits? Is their sequence a logical one – like a flight through the city, along a certain line? Or is the camera rather randomly jumping from some location to the other?\n\nHere are 22 stills from the sequence, in order of appearance.\n\nThank you very much for your help!  \n[Bonus points if you can correctly identify Copperplate Gothic. :-)]\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-01_5046.jpg)\n1\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-02_4036.jpg)\n2\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-03_3441.jpg)\n3\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-04_4495.jpg)\n4\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-05_4869.jpg)\n5\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-06_3489.jpg)\n6\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-07_4482.jpg)\n7\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-08_6529.jpg)\n8\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-09_5338.jpg)\n9\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-10_5602.jpg)\n10\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-11_4645.jpg)\n11\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-12_5470.jpg)\n12\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-13_5677.jpg)\n13\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-14_3452.jpg)\n14\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-15_5640.jpg)\n15\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-16_4235.jpg)\n16\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-17_6242.jpg)\n17\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-18_5400.jpg)\n18\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-19_4512.jpg)\n19\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-20_3418.jpg)\n20\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-21_6139.jpg)\n21\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/pr-22_3563.jpg)\n22 \n",
  "author": "Florian Hardwig",
  "time": "3 Jun 2008 — 5:45am",
  "uid": "16911",
  "comments": [
    {
      "time": "3 Jun 2008 — 5:58am",
      "content": "I start myself: 11 is [Times Square](http://web.archive.org/web/20131022064656/http:/maps.google.com/maps?f=q&hl=de&geocode=&q=Times+Square+1567+Broadway+at+47th+Street&sll=40.808019,-73.963998&sspn=0.001054,0.001754&layer=c&ie=UTF8&ll=40.758778,-73.985871&spn=0.004218,0.010536&z=17&cbll=40.756664,-73.986355&panoid=rCOAwZspNeKQQHFQrM4j5Q&cbp=2,205.1479762482553,,0,-9.796971158500055), right?\n\n"
    },
    {
      "time": "3 Jun 2008 — 7:24am",
      "content": "I don't know New York very well, but yes they appear to be on a route or in a small area.\n\n4 is zoomed into the right centre of 3\n\n9, 10, 11 all feature Times Square\n\nThe building in 13 appears to be that in 12\n\n19 appears to be on the edge of Central Park in 20\n\n"
    },
    {
      "time": "3 Jun 2008 — 7:30am",
      "content": "I'm pretty sure they do not have a logic progression, you jump from upper east side to financial district to times square to central park... I think they are just randomly showing buidlings and iconic views of new york in a purely aesthetic way, in order to place the typeface the way they wanted to. these credits are very nice by the way, they actually appear in my upcoming book at the copperplate chapter. and I happen to have myself a very nice and big book about opening credits, which was released a short time ago; i dont have the title here, but maybe your pal should take a look, not to do the same one.\n\ndr\n\n"
    },
    {
      "time": "3 Jun 2008 — 7:37am",
      "content": "19 is the Plaza Hotel, which is on the SE corner of Central Park, in fact.\n\n20 is Sheep Meadow in CP, looking SW\n\n15 is midtown, as the Chrysler Building is centre left.\n\n14 is St. Patrick's Cathedral (Fifth Ave and 51 St.)\n\n3 is the Wall Street area\n\n2 is down near City Hall\n\nSo yes, it's pretty much a N-S trip over Manhattan.\n\n"
    },
    {
      "time": "3 Jun 2008 — 7:48am",
      "content": "You can watch the sequence here: [http://www.artofthetitle.com/tag/panic-room/](http://web.archive.org/web/20131022064656/http:/www.artofthetitle.com/tag/panic-room/ \"http://www.artofthetitle.com/tag/panic-room/\")\n\n"
    },
    {
      "time": "3 Jun 2008 — 8:02am",
      "content": "3 is the Municipal Building (foot of the Brooklyn Bridge); 4 detail of same\n\nthe building on the left in 6 looks like the Puck building which would mean it is the corner of Houston and Lafayette\n\n9, 10 and 11 definitely Times Square\n\n14 is the back of St. Pats, which means it's Madison Ave. I used to work in the building at the upper right!\n\n19 looks to me like the Dakota, not the Plaza (same architect)\n\nThe last two are either CPW, 5th Ave, or Central Park South - you can see the park wall at left.\n\nI think some of these look like CGI composites, though.\n\n"
    },
    {
      "time": "3 Jun 2008 — 8:03am",
      "content": "I was going to say the Dakota for 19, too.\n\n"
    },
    {
      "time": "3 Jun 2008 — 8:22am",
      "content": "from the website of the company who did the opening sequence:\n\n\"Panic Room’s slow moving, aerial opening title sequence features dramatic architectural shots above New York City. “The titles themselves are constructed and fit so that they appear to be real and near but not attached to building facades,” says CafeFX artist Akira Orikasa. “It was important to light and composite them so that the light shining on each title matches the lighting in the scene.”\n\n“We balanced photo-realism with readability, and to give the titles a sense of weight, we worked on font selection, avoided redundancy in plate selection and, especially, created a lighting pattern that insured that the light shining on the titles captured and reflected the light behind, below, and around it,” Orikasa explains. CafeFX employed Lightwave's radiosity rendering application to capture diffused lighting and color from the environment, and add a \"weighty\" dimensionality to the titles.\n\nCamera movement in the titles was captured, in part, using a method called Photogrammetry. &nbsp;\"(Director) David Fincher shot background plates of the city, then he wanted to alter the camera motion,” Orikasa explains. “We had to create 3D camera motion that did not exist in the real footage. Photogrammetry allows you to move a virtual camera freely by taking a still image--in this case from the architecture photo stills from a high-res Imax camera--model the geometry of each building in the plate to match the still, then move the camera around. The result is the original shot seen from a new camera angle or motion,” he says. Some shots we created using a mixture of several pieces of film and 3D textured objects.\"\n\nso actually, these are not video but animated stills... amazing.\n\ndr\n\n"
    },
    {
      "time": "3 Jun 2008 — 10:19am",
      "content": "Wow, you are amazing! Thank you all very much, that was very quick and very informative!\n\nOnce more the typophile community proved to be a fantastic help – even though this request was not 100% type related (apologies for that).\n\nHypothesis corroborated: It’s pretty much a travel across Manhattan, as Linda said; starting in the South at the Bay, going North via City Hall, Municipal Building and Puck Building, then passing Times Square and St. Patrick’s Cathedral, finally arriving at the Central Park area with Dakota and Sheep Meadow – where the further story of ‘Panic Room’ takes place. Great!\n\nAlso thanks to Mark & David for the additional information. Yes, he knows about this book, but he can’t recall its title either, right now.\n\n"
    },
    {
      "time": "3 Jun 2008 — 11:29am",
      "content": "The Book you're talking about, is it: Uncredited: Graphic Design & Opening Titles in Movies by Gemma Solana and Antonio Boneu  \nBig coffe-table-book with a lot of stills (really a lot of)\n\n ![](http://web.archive.org/web/20131022064656im_/http:/typophile.com/files/51IfvFFBGzL_4114._SL500_AA240_.jpg)\n\n"
    },
    {
      "time": "3 Jun 2008 — 2:40pm",
      "content": "What about the movie? Is it good?\n\nHéctor\n\n"
    },
    {
      "time": "3 Jun 2008 — 2:46pm",
      "content": "What a great link!  \nMy favourite is there as well: [Catch me if you can](http://web.archive.org/web/20131022064656/http:/www.artofthetitle.com/tag/catch-me-if-you-can/)\n\nFollow-up question: What Font?\n\n"
    },
    {
      "time": "3 Jun 2008 — 3:10pm",
      "content": "What's great with this book (yes, thas is this book by the way) is that it comes with a dvd of the credits...\n\nthe movie is not very good, imho. not the best fincher, which is either se7en or fight club.\n\nabout catch me if you can, it is really a nice piece of animation. it was done by a couple of french designers i've met some years ago while working on a project, kuntzel & deygas, and it sports the chalet typeface.\n\ndr\n\n"
    },
    {
      "time": "3 Jun 2008 — 7:27pm",
      "content": "Just a little nit to pick: The typeface used in the \"Catch Me If You Can\" titles isn't Chalet, but [Coolvetica](http://web.archive.org/web/20131022064656/http:/www.myfonts.com/fonts/larabie/coolvetica/coolvetica/).\n\n"
    },
    {
      "time": "4 Jun 2008 — 12:19am",
      "content": "my bad, mark, you're right.\n\ndr\n\n"
    }
  ]
}
