{
  "id": "46035",
  "title": "guardian front cover carved linoleum design",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hey, i just compleated a self negotiated brief i did.. i just felt like coming up with a pure typographical poster for a l=kind of front cover for the guardian newspaper... i know it wouldnt be used as a front cover!.. just fun really as i'm quite obsessed with making things out of linocutting.. like the linocut animations i have done..\n\nanyway i am wanting to send a print of this (a bit bigger then A0) poster to the guardian. I dont know if they would like it, but i want to send it, but on the website it says i think that they do not like receiving artworks.. so yea i dont think i can send it? what can i do? i dont even know if they would like it..\n\ncheers\n\nmy flickr that shows the carving itself is [http://www.flickr.com/photos/markandrewwebber/sets/72157603892334695/](http://web.archive.org/web/20131014225758/http:/www.flickr.com/photos/markandrewwebber/sets/72157603892334695/ \"http://www.flickr.com/photos/markandrewwebber/sets/72157603892334695/\")  \nat the bottom\n\n ![](http://web.archive.org/web/20131014225758im_/http:/typophile.com/files/2530477564_fbd34c58c8_3667.jpg)\n\n",
  "author": "dexter121uk",
  "time": "3 Jun 2008 — 2:36pm",
  "uid": "15464",
  "comments": [
    {
      "time": "4 Jun 2008 — 10:54am",
      "content": "If they say on the website that they don't want to receive artwork, I guess sending it would be a shame of that nice print. But if you have more than one print, I guess you don't lose much by sending it anyway! :)\n\n"
    },
    {
      "time": "7 Jun 2008 — 7:59am",
      "content": "Thats an amzing piece of work. what are the dimensions?\n\n"
    },
    {
      "time": "7 Jun 2008 — 9:23am",
      "content": "the dimentions.. a little bit bigger then A0 a bit bigger then... 841 × 1189mm or 33.1 × 46.8 inches not much, only a few inches!.. i have not measured it yet.. but yea need to... CHEERS!\n\nTYPOGRAPHY !!!!!!!!!!!  \nMark Webber ISTD  \n [www.markandrewwebber.com](http://web.archive.org/web/20131014225758/http:/www.markandrewwebber.com/ \"www.markandrewwebber.com\")\n\n"
    },
    {
      "time": "7 Jun 2008 — 10:59am",
      "content": "That is a awesome job.\n\n"
    },
    {
      "time": "8 Jun 2008 — 6:06pm",
      "content": "Cheers!... i am not sure how well i did with spacing!.. i tried my best with it.. but yea it was really hard fitting everything on with such a big G taking up all the room!... hmmmm.. im so glad i used a big G though as i love the shape!! and it realyl stands out from a distance toooo!\n\nTYPOGRAPHY !!!!!!!!!!!  \nMark Webber ISTD  \n [www.markandrewwebber.com](http://web.archive.org/web/20131014225758/http:/www.markandrewwebber.com/ \"www.markandrewwebber.com\")\n\n"
    }
  ]
}
