{
  "id": "46031",
  "title": "Logo Critique: Red Hot Property",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi everyone, I've been working on this logo for an estage agent company. I posted this the other day:  \n [http://typophile.com/node/45780](http://web.archive.org/web/20101015090110/http:/typophile.com/node/45780 \"http://typophile.com/node/45780\") and have made some changes and added some other ideas, I would be very grateful to see what anyone thinks. I really like the idea of just having a 'R' and degree symbol, but havn't really been able to make it work yet.  \nAny feedback would be very much appreciated,\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/logosample_3499.jpg)\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/iconsample_5605.jpg)\n\n",
  "author": "<a href=\"/web/20101015090110/http://typophile.com/user/31622\" title=\"View user profile.\">toby1</a>",
  "time": "<br>",
  "uid": "31622",
  "comments": [
    {
      "time": "",
      "content": "top right and bottom middle are the best to me\n\nTop Right:\n\nmy only worry is that the partially rounded trend might date this design as time goes on, but on the other hand, maybe it will becme more popular before it subsides:\n\n/me recalls the stupid 'techno' and 'matrix' styled designs from a few years ago with cut-off corners and concentric circles\n\nBottom Middle:\n\nSimple, clean, effective. It feels a touch empty or weak, but maybe it just needs more time to grow on me. I think this i the best or has the most potential of all of them!\n\nHope that helped!\n\n"
    },
    {
      "time": "",
      "content": "At first glance, I'd lean toward #7 (Column 1 row 3). The key hole versions (2, 8 & 9) are a little anachronistic these days, and the simple \"R\"s don't really mean anything on their own.\n\n"
    },
    {
      "time": "",
      "content": "One thing I'd watch out for, is not getting too close to the Realtor logo, especially given the business (#1 and #5 in your first column):\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/realtor-logo_6049.gif)\n\nAlso, I'd try taking the Degree sign out of a few, I don't think that they are all served best with them. Then again, a flaming house wouldn't be something you'd want either...\n\n"
    },
    {
      "time": "",
      "content": "I like the top right as well. I really like the type that you used for the wordmark, so I think keeping the logo simple would be good.\n\nThe cityscape in #7 won't read well at small sizes.\n\nWhat about making a keyhole that is also a thermometer to indicate \"red hot?\" Hmmm or maybe not, it's been a long day at work, so I can't tell how bad my ideas are at this point haha.\n\nI do, however, really like the idea of the keyhole representing the \"R\" but I agree with Scott Leyes that they are a little past their hey-day.\n\n"
    },
    {
      "time": "",
      "content": "with the keyhole I lose the 'R' completely. Not that it can't work as a mark, but it reminds me nothing of an 'R'\n\nI'd recommend the bottom middle again, as I think that's you're best bet, but it's certainly not solved yet.\n\nI'm excited about this, I wish every mark had this genius in this.\n\n"
    },
    {
      "time": "",
      "content": "I think top right and middle bottom also. They just read the strongest. I also feel that the keyhole may be a bit tired.\n\n"
    },
    {
      "time": "",
      "content": "_I’d recommend the bottom middle again_\n\n_I think top right and middle bottom also_\n\nI'm seeing Museo everywhere, and it looks good. I like the bottom middle the most as well. The top right looks good as well, but there's not much reason for the box around it, maybe a different shape?\n\n"
    },
    {
      "time": "",
      "content": "Thanks very much for all your comments. I think this is the way to go with it, but I agree there seems to be something missing at the moment.  \nMaybe the 'R' isn't strong enough...  \nI've been drawing custom letter R's but haven't come up with anthing I like  \nAny body got any suggestions for other type to use?\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/rhplogo_6098.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Not really type suggestions, but the word RED has much tighter kerning than HOT. I'd even them out. The first and last R° may be placed in the middle of their frames, but optically, I think they could be nudged towards the top. The space between the cap height and frame edge look a little big to me. You could try tweaking the type logo yourself (removing some of the curved ends while keeping others?) to fit your needs...\n\n"
    },
    {
      "time": "",
      "content": "I like the first one on the left but I would reverse it out like the one on the right.\n\n"
    },
    {
      "time": "",
      "content": "The key hole shape makes up one side of the R already ... !\n\nagree with Chipman about nudging up the R mark too\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20101015090110/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "agreed, the R's lok centred mechanically, not optically. human brains are silly things but in the horizontal alignment they look fine!\n\nI say the first two hold the most potential, the last one seems weaker and less direct.\n\nI played a little bit with the overlay here, I think you have a great thing going on, but for the overall shape of the mark, I'd seriously consider borrowing centuries of aesthetic development and make the overall shape of the thing more like the inverted profile of a princess cut diamond. It's sure to work well ad take the guesswork out out of the sizes.\n\nhere's your logo:\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/cut_3813.png)\n\nHere's a shape I'd love to see your logo fit inside, just to see if it improves it:\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/princess_4550.png)\n\n"
    },
    {
      "time": "",
      "content": "I think the word PROPERTY is crowding RED HOT. The word spacing in RED HOT is greater than the line spacing between the two lines. They need to at least be equal or a bit more.\n\n"
    },
    {
      "time": "",
      "content": "I really like the direction this is going I think you're getting really close. I wonder if you've considered using a different typeface for the mark itself? (I hope you don't mind me tweaking slightly – this is really quickly done, the spacing is out and in no way has the quality of your efforts!). I quickly dropped in a Diavlo R and flipped the shape so that the curves followed the shape of the R and degree symbol.\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/Untitled-1_5079.jpg)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/red_hot_5585.png)\n\nYou could consider Museo 900 for a bit more punch ...\n\n"
    },
    {
      "time": "",
      "content": "I've been meaning to buy Museo and your post reminded me to go do it. I LOVE it!\n\nSharon\n\n"
    },
    {
      "time": "",
      "content": "I wasn't promoting it ... honestly ;-)\n\nThanks very much Sharon!\n\n"
    },
    {
      "time": "",
      "content": "\" The key hole shape makes up one side of the R already ... ! \" That is a good idea.\n\n"
    },
    {
      "time": "",
      "content": "[www.breadmedia.com.sg](http://web.archive.org/web/20101015090110/http:/www.breadmedia.com.sg/ \"www.breadmedia.com.sg\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks everyone for all your comments and feedback.  \n@ Mathew Dixon: not at all, anyone's suggestions are very welcome.  \n@ keon: thanks for sharing the breadmedia logo, i hadnt seen that, its getting a bit close to that shape.  \nI've altered it abit to fit in the shape you suggested innovati, what do you think?\n\nI'm not sure the client is particularly liking it, don't think they got the idea, but I've gone this far with it, may aswell see it through to a conclusion...\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/redhotlogo_3446.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Just not feeling the degree symbol concept. When you take the degree symbol away from numbers, it becomes just a circle next to an R. Kind of meaningless.\n\nDavid\n\n"
    },
    {
      "time": "",
      "content": "This is a famous logo in Brasil, designed by Alexandre Wollner, important guy. Sorry for the small size, couldn't find any better.  \n [http://www.manil.com.br/image/logo/fechaduras\\_brasil.GIF](http://web.archive.org/web/20101015090110/http:/www.manil.com.br/image/logo/fechaduras_brasil.GIF \"http://www.manil.com.br/image/logo/fechaduras\\_brasil.GIF\")\n\nIt's a locks manufacturer.  \nCheers,  \nmn\n\n"
    },
    {
      "time": "",
      "content": "I like this concept. I think it works, but it's the client's opinion that matters. Did you consider animating a \"red hot\" candy? Some friendly candy figure? If this is a residential real estate company it might work.\n\nFeel free to snicker. (pun intended)\n\nSharon\n\n"
    },
    {
      "time": "",
      "content": "\\*snicker\\*\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20101015090110/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "Sometimes I get a little wacky. :-)\n\n"
    },
    {
      "time": "",
      "content": "\"...it's the client's opinion that matters\"\n\nUnfortunately.\n\n"
    },
    {
      "time": "",
      "content": "A few points and suggestions:\n\n1) I'm not inherently against using an initial as the basis of a mark, but in your current configuration, I don't think the logo is functioning well for these reasons:\n\nBecause both the R in the title and the R in the mark use the same typeface, the mark becomes superfluous. It seems like overkill - like I'm seeing the logo twice, especially because there's not really any separation or differentiation between the mark and the title. I would suggest using a different typeface for one of the components, or just integrating your idea into the title, as shown below. If you went that route, you could use the standalone R as an alternate logo.\n\n2) It is possible people won't get the thermometer symbolism, so why not embrace your idea more literally? Perhaps stylize the R more like a thermometer, or scrap the R all together, and create some type of real estate/thermometer symbol, something like what I've shown below.\n\nGood luck.\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/rh_01_4954.jpg)\n\n ![](http://web.archive.org/web/20101015090110im_/http:/typophile.com/files/rh_02_5361.jpg)\n\n"
    }
  ]
}
