{
  "id": "46055",
  "title": "PC MAC PDP-1",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[PDP-1](http://web.archive.org/web/20140629221852/http:/en.wikipedia.org/wiki/PDP-1) [MAC](http://web.archive.org/web/20140629221852/http:/en.wikipedia.org/wiki/IMac) [PC](http://web.archive.org/web/20140629221852/http:/en.wikipedia.org/wiki/IBM_PC)  \nPC MAC PDP-1\n\nPDP-1\n\nMAC - PC  \nPC - MAC\n\nMAC PC MAC PC  \nPC MAC PC MAC\n\nPDP-1 MAC  \nMAC PDP-1\n\nPC PDP-1  \nPDP-1 PC\n\nPC  \nMAC\n\nPC MAC MAC  \nMAC PC PC\n\nPC MAC PC MAC PC MAC  \nMAC PC MAC PC MAC P\\*\n\nMAC  \nPDP-1\n\nPDP-1 MAC PDP-1 MAC  \nMAC PDP-1 MAC PDP-1\n\nMAC  \nPDP-1\n\n",
  "author": "AGL",
  "time": "4 Jun 2008 — 3:44am",
  "uid": "27669",
  "comments": [
    {
      "time": "4 Jun 2008 — 3:53pm",
      "content": "...the hell is this?\n\n"
    },
    {
      "time": "4 Jun 2008 — 5:04pm",
      "content": "Lyrics to a Kraftwerk song?\n\n"
    },
    {
      "time": "4 Jun 2008 — 5:32pm",
      "content": "forget mac... I want one of those PDP-1.... now that is the future, space efficient... and forget iTunes when you have [this](http://web.archive.org/web/20140629221852/http:/video.google.com/videoplay?docid=-208308904239496440&q=computer+history+dec&total=5&start=0&num=10&so=0&type=search&plindex=4)\n\n"
    },
    {
      "time": "5 Jun 2008 — 5:07am",
      "content": "Thanks Concrete for the extra info on PDP-1, and for you guys for 'dropping' by.\n\nThe idea behind PDP-1, MAC and PC is that it is designed so that it conceals its real meaning, or the real names they (mis)represent.\n\nPDP-1 is the idea of a dinosauric ideology;  \nMAC is the fresh look it inspire and also a model that most of the 'computer word' would give anything to duplicate;  \nPC is the paradigm of a failed attempt to capitalize on the ignorance of non-computer users.\n\nWhen this first come to consideration, I researched for five minutes, looking for the desired hardware. My first option was:\n\nATARI - PC - MAC\n\nBut, the experiment required the use of only domestic brands, to be represented as 'icons' or pictograms. I also considered it would be best served as images, but that would take precious time to accomplish. That left me with a option which would make the experiment as fast as fast could be. Living me to the minimal approach: Georgia and Align to the left.\n\nThat has proven to be the fastest approach.\n\nAndré\n\n\\* The above description may change at any time with the reserved option to add a picture and color that could shine some light on this puzzle.\n\n"
    },
    {
      "time": "5 Jun 2008 — 6:41am",
      "content": "01010100 01101000 01101001 01110011 00100000 01100011 01101111 01101110 01110110 01100101 01110010 01110011 01100001 01110100 01101001 01101111 01101110 00100000 01101001 01110011 00100000 01110010 01100101 01100001 01101100 01101100 01111001 00100000 01101111 01100100 01100100 00101110\n\n"
    },
    {
      "time": "5 Jun 2008 — 6:54am",
      "content": "All I hear is a whooshing sound, likely caused by something flying over my head.\n\nTo translate for Darrel, \"This conversation is really odd.\"\n\n"
    },
    {
      "time": "5 Jun 2008 — 7:46am",
      "content": "I'm still lost.\n\nWhat?\n\n"
    },
    {
      "time": "5 Jun 2008 — 10:00am",
      "content": "I thought no one would 'drop' by to see this. The idea of sound did not occurred to me... that is a very good idea.  \nPicture PDP-1, MAC and PC as if they were interacting in a ascendent motion and, consequently producing the sounds which are perceived by the viewer. As PDP-1, MAC and PC interact, there could be the tek-tek-tek, just faster, like trreeehhhhhhhhhh produced by a dot matrix printer, which at some point produces the singularity that takes out or annihilate one of the elements of this experiment:\n\nPC\n\n"
    },
    {
      "time": "5 Jun 2008 — 11:37am",
      "content": "What experiment? This makes no sense. What are you trying to achieve here?\n\n"
    },
    {
      "time": "5 Jun 2008 — 12:34pm",
      "content": "I think this is some weird surrealist thread. I like it.\n\n"
    },
    {
      "time": "6 Jun 2008 — 2:44am",
      "content": "Have had no luck with this. Is \"drop(ping)\" a clue? Why domestic [US?] brands? What is the significance of the \"P\\*\"?\n\n"
    },
    {
      "time": "6 Jun 2008 — 5:39am",
      "content": " ![](http://web.archive.org/web/20140629221852im_/http:/typophile.com/files/3_4469.png)\n\nWell, \"if this make any sense\" is still to be determined by the imput-output  \nPDP-1, MAC and PC may or may not generate.  \nI would propose that the nuclear point or question is to determine what really happen to P\\* (PC) and for that I made a picture to depict the trajectory of\n\n[PDP-1](http://web.archive.org/web/20140629221852/http:/en.wikipedia.org/wiki/PDP-1) [MAC](http://web.archive.org/web/20140629221852/http:/en.wikipedia.org/wiki/IMac) [PC](http://web.archive.org/web/20140629221852/http:/en.wikipedia.org/wiki/IBM_PC)\n\nI have to point out that the order of appearance starts with PDP-1 and somewhat influences the implosion / disappearance or annihilation of PC, which from that point on becomes only a mirage of itself, which, on a attempt to represent and also with great use of XXI Century instrumentation I was able to magnify, the exact moment of the event, which is now known as\n\nP\\*\n\nYet the image or depiction is still too dimmed as to say with certainty what is going to happen in the near future.\n\nNote: \\* I guess I shouldn't have used the word \"Experiment\" because the word in itself would cause \"chills\", and for that I ask you to look at the word \"Experiment\" as if it was/is only a group of letters and not as secondary or tertiary meanings.\n\nFew free to ad more questions or comments. Please, I just ask of you to think in terms of PDP-1 MAC P\\*(PC) as elements composed of characters, refraining from connections to facts e/or persons.\n\nps.: I used familiar colors as to keep it in a domestic perspective\n\n"
    },
    {
      "time": "6 Jun 2008 — 6:56am",
      "content": "This conversation is pointless unless we ad a C=64 to the mix. ;o)\n\n"
    },
    {
      "time": "6 Jun 2008 — 8:41am",
      "content": "I notice that the visual manifestations of these various iconographies are mere shells of their connotative meanings. Each has a similar denotative meaning, that being a computational device meant to increase productivity, but as you mention above, the connotative meanings are greatly different.\n\nThis visual representation of reality is an interesting exploration of the postmodernist question of media; we see reality through various media, but reality in and of itself is a medium. The problem then becomes, what is \"real\" and what is real? How can we define reality, if we can never be sure what is real?\n\nThis brings us back to the idea of connotative and denotative meanings. In postmodernism, the denotative meaning of reality is void; we must rely on a connotative meaning. The problem with connotative definitions, however, is that each of us views reality from our own perspective and create our own connotative meanings, which are further distorted because of what we can call the \"frame of reference.\"\n\nWe then have to decide what we can define as absolute. Reality clearly is not; is truth? The answer is no; truth defines itself as the generally accepted happening. Truth and reality, then, are completely separate entities. But what about happening, or \"occurrence?\" We can agree that there is a such thing as absolute occurrence, though we may not agree upon that absolute.\n\nIn examining this enigmatic esoteric representation of a reality distinct from our own, we view it through different frames of reality. There is a visual element, but some instead may see (hear?) the auditory representation. The harsh consonant tones suggest a certain absoluteness and frankness in this expression, but then again almost nothing is absolute.\n\n"
    },
    {
      "time": "6 Jun 2008 — 11:53am",
      "content": "\\*Head explodes\\*\n\n"
    },
    {
      "time": "10 Jun 2008 — 6:41am",
      "content": "Due to ex-trim content, (PG RR) Parent Discretion is Advised:\n\n\\*\"\\* H e a d E x p l o d e s \\*\"\\*\n\n[deploying . . .](http://web.archive.org/web/20140629221852/http:/www.photoblog.com/storage001/2008/06/10/)\n\n\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\n\nPDP-1 MOTION\n\nFlip Switch. ON. Retrieve file. List. Result on screen in black and white. Take notes. Ponder. Course of action. Return . . . Result. Locate printing device. Printing device online. Hummm... hummm... Printing head routine done. Print. Return. Tek-tek-tek-tek-tek . . .  \nLocate main application. Run. Window pops up. Black and white. Load film cartridge; first, shut light bulbs. Loaded.  \nReload previous file. Hover pointer to the beginning. Ponder. Click. Imaging . . . . . . . . . Elapsed time... 00H00H00 24H11M58S. Blinking. End run.  \nFlip Switch. Bulbs ON. Check resulting celluloid against light background... Follow thru checklist. All checked. \"Positive\". Secure run.  \nTime check. 4:56pm. Remove armor. Flip switch. Bulbs OFF.\n\nNext morning.  \nFlip switch. Bulbs ON. Locate celluloid. Load onto device. Unlock safe pin. Pull lever slowly to engage. ON... Flip switch. Bulbs OFF.\n\n[Projection . . .](http://web.archive.org/web/20140629221852/http:/www.photoblog.com/storage001/2008/06/10/)\n\n\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\\*|\n\n"
    }
  ]
}
