{
  "id": "46064",
  "title": "Searching for historical Manchester (uk) typographers / type founders / faces",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "For a current client, I’m trying to research some typography historically appropriate to the city of Manchester (UK). Recent history is easy - Peter Saville etc, but I’ve drawn a blank with anything that might speak to the city’s Victorian and early c20th history -\n\nCould anyone suggest any typographers, typefaces, etc that might be relevant?\n\nMany thanks in advance!\n\n [‹ \"The Sans\" Condensed ?](http://web.archive.org/web/20081209045003/http:/www.typophile.com/node/47695 \"Go to previous forum topic\") [explain offset printing to me? ›](http://web.archive.org/web/20081209045003/http:/www.typophile.com/node/47298 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081209045003/http://www.typophile.com/user/11244\" title=\"View user profile.\">g.j.hilton</a>",
  "time": "<br>",
  "uid": "11244",
  "comments": [
    {
      "time": " 4.Jun.2008 1.21pm",
      "content": "GJ\n\nOne of the finest lettering artists and teachers from Manchester was Tony Forster. He also designed, as well as consulted on, type with the likes of Phill Grimshaw (deceased), also from Manchester and Colin Brignall with Letraset. Tony passed away only weeks ago, sadly. Many are indebted to Tony; and, his work is/was Brilliant, and not in the overused sense. You might wish to contact Timothy Donaldson who is also in the area.\n\nThis may not speak to the city’s Victorian ethos but he definitely was a Manchester titan. Thank you for posting this as it has suddenly helped me, as I am struggling with his obituary this week for an international publication... titan is appropriate.\n\nMichael\n\n"
    },
    {
      "time": " 5.Jun.2008 5.04am",
      "content": "Michael\n\nWhat sad timing. Sincere thanks for introducing me to Forster, and for the reminder of Grimshaw - it certainly seems appropriate to reference them in the work we’re doing. Willow is already a very familiar typeface to me as a resident of the city - I shall look for its unforced decorative sopistication particularly fondly in future.\n\nFor me of the great strengths of the city is the way it reconciles its heritage with a very modern attitude, so this kind of work is highly relevant... though I’m still very much hoping to dig up some earlier typographical reference as well.\n\nOne again, many thanks for your kind help\n\nGuy\n\n"
    },
    {
      "time": " 5.Jun.2008 7.14am",
      "content": "You may want to check out the Washington Calligraphers Guild. I did several editions of Scripsit and highlighted the work of Tony, Phill, Stephen Raw and Peter Horridge, Stayed with Tony a couple of years ago when I taught in the North and then went to Roehampton to lecture/teach. His studio was incredible. Six foot piles of paper and books everywhere and a tiny path to his table.\n\nHe was a wonderful man. After I did the article we became great friends and talked every other Saturday for 12 years. What a wealth of info he was and OH what a prankster!\n\nMichael\n\n"
    },
    {
      "time": " 6.Jun.2008 4.10am",
      "content": "Michael\n\nWhat a wonderful character, and more fuel for my pet theory about the close correlation between studios knee deep in \\*stuff\\* and genius...\n\nHe sounds like quite an inspiration. On the strength of your postings here, I don’t think you need worry that the obituary you’re writing will communicate the depth of your warmth and affection for him :-)\n\nvery best regards, condolences on the loss and thanks again\n\nguy\n\n"
    },
    {
      "time": " 23.Jul.2008 4.01pm",
      "content": "Hi I have just registered on this site and the first posting I see is that Tony Forster had passed away back in June. Is this the same Tony Forster who was from the UK, and taught at Bolton College of Art, Bolton, Greater Manchester UK starting back in the 70’s and then for 25 years?\n\nIf yes can someone confirm this for me as it would be greatly appreciated. Tony was my Tutor/Mentor at college between 77 - 81, and then in the early part of my career.\n\nIs there somewhere where I could send a message of condolence?\n\nThanks.\n\n"
    },
    {
      "time": " 24.Jul.2008 5.03am",
      "content": "Yes, sadly it is true.\n\nHe is survived by his wife Polly and two sons, Daniel and Simon.\n\nThe address is:  \n7 Stour Rd  \nTyldesley  \nManchester  \nM297HH\n\nI am sure they would appreciate your sentiment.\n\nMichael\n\n"
    }
  ]
}
