{
  "id": "46088",
  "title": "Pyke's Peak & Pyke's Peak Zero",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Finally, [Pyke's Peak is out.](http://web.archive.org/web/20150405123028/http:/www.myfonts.com/fonts/sentinel/pykes-peak/) It only costs $30 for a premium decorative display font loaded with OpenType features and a supporting cast of 590 extras. Or you can have the \"cut-down\" version—Pyke's Peak Zero—for zero cash outlay. On the Myfonts font family page, click on \"purchase options\", then download Pyke's Peak Zero for $0.\n\nFor an idea of what full kit and kanoodle can do, grab all the [samples of old Pykie](http://web.archive.org/web/20150405123028/http:/www.myfonts.com/fonts/sentinel/pykes-peak/gallery.html) and salivate at the extras sheet.\n\n**Q.** What's the deal with \"zero cost\"?  \n**A.** With the recent controversy over web font embedding using the CSS @font-face property, the associated problem of unauthorized distribution of fonts only licensed for private use, and the \"looming spectre\" of the great web \"fugly\", I decided to do as much as I could to help the situation with a single font release.\n\nPP Zero is licensed for:  \n\\* personal (non-profit) _and_ commercial use  \n\\* yes you read that right  \n\\* unlimited copying & distribution on font archive sites  \n\\* \"embedding\" on webpages using CSS @font-face property  \n\\* unlimited distribution on web servers  \n\\* no logo fee\n\nPP Zero plays with a full deck.  \n\\* ultra-complete Latin 1 & Latin 2 character set  \n\\* full outline quality of PP regular (outlines are not degraded in any way)  \n\\* OpenType with standard ligatures (LIGA) and fractions (FRAC)\n\nWhat you don't get with PP Zero [\\>———the extra 590 ligatures (DLIG), contextual alternates (CALT), lining numerals (LNUM) and stylistic alternate (SALT) bells and whistles of PP Regular———](http://web.archive.org/web/20150405123028/http:/www.flickr.com/photos/arboghast/2511483112/in/set-72157605345678800/)\n\nj a m e s\n\n",
  "author": "James Arboghast",
  "time": "5 Jun 2008 — 2:06am",
  "uid": "9349",
  "comments": [
    {
      "time": "5 Jun 2008 — 5:16am",
      "content": "That is sweet. I will get PP Zero. It will look good on a baby card. Thank You :-)\n\n"
    },
    {
      "time": "5 Jun 2008 — 6:52am",
      "content": "That is very kind of you to release this into the wild. It's a fun face!\n\n"
    },
    {
      "time": "6 Jun 2008 — 9:39pm",
      "content": "Yes, it is -- I was pleased to be a beta tester for Pyke's Peak and used it in a book that was tied for \"best original entry\" at its inaugural show.\n\nPix of it are [here](http://web.archive.org/web/20150405123028/http:/flickr.com/photos/lasquetipress/sets/72157603916183224/).\n\n"
    },
    {
      "time": "7 Jun 2008 — 2:50am",
      "content": "Congratulations James! This looks like a lot of fun.\n\n"
    },
    {
      "time": "7 Jun 2008 — 5:29am",
      "content": " ![](http://web.archive.org/web/20150405123028im_/http:/typophile.com/files/tworoads_3976.png)\n\nChrisL\n\n"
    },
    {
      "time": "7 Jun 2008 — 11:18am",
      "content": "Nicely done Chris!\n\n"
    },
    {
      "time": "7 Jun 2008 — 1:56pm",
      "content": "You know what I wish now? Wish I'd made the capital I with serifs. Wish I had 3 heads too.\n\nYou've got some choices going there Chris, which I would have qualms about using. The EL - ED combination in TRAVELLED could have had more grace, and the opposing F's in DIFFERENCE redefine \"awkward\". That's typical, I give you the keys to a Pyke's Peak racer with a 1000 Horsepower motor in it and you go tearing up the mountain and leave behind a big mess (;^) There's an art to driving this machine, and a zen to it as well.\n\nThanks Linda and Russell and Ray for beta testing old Pykie. Its \"casual wierdness\" works in a good way for _How to Make a Peacock Fly_ – a strange kind of erm, object in a box!. There are two kinds of comments I would dearly appreciate hearing about:\n\n1) How useful is the zero cost license, does that and the PP Zero font help address the looming spectre of web fugly?\n\n2) What would you use Pyke's Peak for (both the full retail version and PP Zero)?\n\nAnd the third thing\\*, how many web designers are you going to pass a copy of PP Zero on to? I will send a prize, a pair of uber-cool mirror aviator sunglasses like the unit being modeled here by Plush Jimi, to the person who gets PP Zero into the hands of three big-time kick-arse web designers.\n\n ![](http://web.archive.org/web/20150405123028im_/http:/typophile.com/files/plushjimi_6208.jpg)\n\n\\* I know I said two things, I lied\n\nj a m e s\n\n"
    },
    {
      "time": "7 Jun 2008 — 1:59pm",
      "content": "James has done something special here with this type design. Instead of filling a well-known and well populated type market sector with yet another version of a known quantity, he has opened a road to a place yet reached. That is why I chose Frost's verse as a sample to show his work. Someone has to take those first bold steps into the unknown and mark a path yet traveled. Here is a place where it can be celebrated to be dyslexic, not as a handicap but as a venue to read again in a new way. James has married the softness and warmth of written hand with crisp, defined anatomy of constructed type and in a playful way. Users can be children at heart with a naive smile and a tickle from a feather. It is fun again to put away the seriousness we all deal with daily and have a good therapeutic play session!  \nI am not saying Pyke's Peak is a finishing stroke and a completed journey. It is one small step taken in a new direction without fear and without a guided tour. Thanks, James! for giving us a peek at your yet to be defined path!\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2008 — 12:53am",
      "content": "Chris, well put! But do you mean literally dyslexic? Or are you just referring to the reversed forms?\n\n"
    },
    {
      "time": "8 Jun 2008 — 8:33am",
      "content": "\"do you mean literally dyslexic?\"\n\nNo, figuratively, as in turning a handicap into an advantage, celebrating what appears to be a negative by making it into a positive.\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2008 — 12:06pm",
      "content": "Aha! That makes sense.\n\n"
    },
    {
      "time": "9 Jun 2008 — 4:02am",
      "content": "Cheers Eben. Cheers Chris, you have a succinct way of describing these things. Turning a negative into a positive is very much part of what I set out to do with Pyke's Peak.\n\n@Chris: _No, figuratively, as in turning a handicap into an advantage, celebrating what appears to be a negative by making it into a positive._\n\n\"Figurative\" is the key word. Type is sculpture. It's all about carving up whitespace with figures and the task of on-going _figuration_. \"It helps that\" turning some letters around permits combinations heretofor-inconcievable.\n\nThe mirror ligs concept is a _trouble maker_—a device that multiplies possibilities. A backwards R is still an R and still functions as an R, with new semantic range.\n\nj a m e s\n\n"
    },
    {
      "time": "9 Jun 2008 — 1:27pm",
      "content": "_Its “casual wierdness” works in a good way for_ How to Make a Peacock Fly _– a strange kind of erm, object in a box!_\n\nIt's a box  \nIt's a book  \nIt's fishing tackle  \nIt's a felt liner  \nIt's _How to Make a Peacock Fly_\n\nI like the \"casual wierdness\" _(sic)_ bit....\n\n:-)\n\n"
    },
    {
      "time": "9 Jun 2008 — 6:54pm",
      "content": "_“casual wierdness”_ (sic)\n\nAww, I'm just casual about spelling when circumstances allow it. I know how to spell \"weird\" but prefer to spell it wierd. You know what I means. I love me the non-conformity.\n\nj a m e s\n\n"
    },
    {
      "time": "9 Jun 2008 — 7:04pm",
      "content": "Great work James—you’re really pushing letterforms and Opentype in great directions with this one!\n\nAnd Linda, that book is fab!\n\n"
    },
    {
      "time": "9 Jun 2008 — 8:24pm",
      "content": "Geez, Jimi, if I was a conformity kind of girl, I wouldn't be doing what I'm doing!\n\nThanks, James: I should probably take a picture of the text that the codex side of the book is done as well -- it's Vince's Magpie, which looks very kewl with Pyke's Peak....\n\n"
    },
    {
      "time": "9 Jun 2008 — 9:27pm",
      "content": "Yes do that, post pics of the text on your flickr photostream. Magpie is underexposed.\n\nj a m e s\n\n"
    },
    {
      "time": "10 Jun 2008 — 11:48am",
      "content": "Too dark (it's raining here) to take good pix of the flip of _Peacock_, but [here](http://web.archive.org/web/20150405123028/http:/flickr.com/photos/lasquetipress/1259346600/in/set-72157600251465925/) is a shot of Magpie in action in _What I Felt_ (the pre-covered text block version).\n\n"
    },
    {
      "time": "10 Jun 2008 — 12:26pm",
      "content": "Mew! Thanks. Artist's word of the decade -- \"lovely\"\n\nj a m e s\n\n"
    },
    {
      "time": "31 Jul 2008 — 4:56am",
      "content": "I just wanted to say thanks to everyone for being so appreciative. Thanks James Puckett, thanks Eben, thanks Chris, thanks Joe Pemberton and Punchcut for hosting the international typo community. I owe my whole type design career to Americans and Canadians.\n\nSorry if I seem ungrateful at times. I forget myself, I forget myself.\n\n(bump, bumpity-bump)\n\nj a m e s\n\n"
    }
  ]
}
