{
  "id": "46095",
  "title": "Type design as a career",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everybody.\n\nI've been wondering how possible it is to pursue type design as a career. Or more accurately; is it possible to earn a decent enough wage through designing type? If so would this only be if you worked for one of the major type foundries or is it possible through setting up your own tiny type studio? I know this sounds mercenary to ask only of the money, but it is a necessary part of living and I have to consider it.\n\nTo be honest I haven't designed a typeface so I'm not exactly actively pursuing this career path. I've started a few designs but have ended up losing faith in their potential or seeing some major problem in my understanding of typeface construction. Hence I'm also considering an MA course in the subject if nothing nothing else.\n\nI work in publishing and while I'm very lucky to be in a job that is largely creative I feel that it isn't necessarily what I'd REALLY like to be doing. I've been hanging around here (Typophile) for a coupla years now and the subject of type design i think appeals ot me a lot.\n\nAny information and experiences anyone could give me would be greatly appreciated.\n\nThanks,\n\nGT\n\n",
  "author": "G T",
  "time": "5 Jun 2008 — 5:44am",
  "uid": "11280",
  "comments": [
    {
      "time": "5 Jun 2008 — 6:14am",
      "content": "You and me both.\n\nI am pursuing a BFA in graphic design. A few weeks ago, I decided that type design is what I really want to do. I know that I have tons to learn, but I think I can do it.\n\nConsidering the money (and I have), my plan is do keep being a graphic designer, meanwhile I'll be drawing letterforms and compiling entire type faces, reading everything I can in all the free time I have, and soon I hope to start selling my typefaces to foundries and type-sellers. When things start looking good, I'll make the switch.\n\nI haven't talked to too many people about this plan, so I am also wondering how plausible this is. I guess the good news is that my wife doesn't seem to be worried .. haha!\n\nI guess at the end of the day, do what you love.\n\nGood luck  \nEvan  \n [evanmade.com](http://web.archive.org/web/20150323155558/http:/evanmade.com/)\n\n"
    },
    {
      "time": "5 Jun 2008 — 6:48am",
      "content": "I have a hunch it's like being a rock star. Everyone wants to do it, but only a select few make a living at it.\n\nBut even if you don't make a living at it, at least you're enjoying yourself. ;o)\n\n"
    },
    {
      "time": "5 Jun 2008 — 7:48am",
      "content": "Best advice would be to attend TypeCon or ATypI and talk to people in the biz. At these events you'll meet everyone from the Linotype Foundry People, through to one-man-outfits, through to hobbyists – and they’re often more than happy to talk about the pros and cons of a career in type.\n\n"
    },
    {
      "time": "5 Jun 2008 — 7:55am",
      "content": "I’ll second Simon about going to Typecon—I went last year and it really helped me think about type design career stuff.\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:05am",
      "content": "\"Linotype Foundry People\"… are we a band, with all words capitalized? In German, it might work, although you could combine two of the words, I guess.\n\nYes, it is possible, at least in my opinion. Everyone's path seems to be a bit different. But so far, I have no complaints. I also am a fan of MA courses, being on one myself, but I'd only recommend it for the knowledge and experience in and of itself, not because one'd hope that it would directly lead to a career or better career.\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:16am",
      "content": "Sorry about the capitalization. But I like the band idea! Maybe you could play the sitar?\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:18am",
      "content": "I've been following my heart for 11 years now and I say yes you can make a living from designing typefaces! It takes a huge amount of time and effort of course. But yes it can be done. ;-) I'll be showing up at TypCon, Buffalo in July. If anyone here have a bunch of questions and happen to be there. Do confront me and I'll try to answer your questions, the best way I can.\n\nCheers\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:18am",
      "content": "I'm always happy to chat with folks about the different paths for type design as a career. The rock star analogy is a good one, unfortunately.\n\nFor us Adobe folks, I probably won't be at TypeCon this year, but Miguel will be. I'll definitely be at ATypI, though.\n\nT\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:29am",
      "content": "Thanks everyone,\n\nI'm in London, and my funds are somewhat limited as far as travel is concerned so don't think I'd be able to get to the US anytime soon. Are there any type conventions in the UK? I vaguely remember one in Brighton?\n\n@dan; I would definitely do an MA for the purposes of knowledge and experience, but I'd hope that it would lead me into a slightly differing career. It would improve my design and understanding I'm sure - I just worry that I wouldn't want to go back to magazine publishing.\n\nMy housemate's trying to be a rockstar, though they dress a bit too much like 15 year old emo kids and their band name sucks.\n\nOh, and what sort of experimental music would the Linotype Foundry People play? Some sort of jazz/funk/gabba fusion? Soul-noise-kiddiepop?\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:42am",
      "content": "\\> Oh, and what sort of experimental music would the Linotype Foundry People play?\n\nLittle known fact – Linotype did have an in-house jazz band, and the reason Linotype adopted the “Home Of The Originals” tag line was because the band’s name was The Originals.\n\nThey met with limited commercial success because they refused to play covers, concentrating on original compositions.\n\nThis led to a dispute amongst the band members with a number breaking away to form The Cambridge Upstarts.\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:44am",
      "content": "Oh, the Linotype Foundry People (L.F.P., for short) play this music: [http://profile.myspace.com/index.cfm?fuseaction=user.viewprofile&friendI...](http://web.archive.org/web/20150323155558/http:/profile.myspace.com/index.cfm?fuseaction=user.viewprofile&friendID=111728591 \"http://profile.myspace.com/index.cfm?fuseaction=user.viewprofile&friendID=111728591\") (the second song there, \"am rand,\" is my favorite)\n\nThe Brighton conference last September was the annual ATypI conference, but that seems to come to the UK only once a decade. This year's ATypI conference will be in St. Petersburg (Russia) in September. There is a design conference in Birmingham in October, I think, and the St Bride Library in London just had their annual conference about two weeks ago.\n\nAs for MA programs, if you in the UK then you are very close to Reading. As a UK resident, you might also be eligible for all sorts of funding possibilities that might not apply as fully to other students.\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:48am",
      "content": "Cool,\n\nThanks very much.\n\n"
    },
    {
      "time": "5 Jun 2008 — 8:59am",
      "content": "Definitely look at Reading. If I were in the UK I’d have been banging on that door a long time ago!\n\n"
    },
    {
      "time": "5 Jun 2008 — 4:51pm",
      "content": "Gotta find a way to go to ATypI or TypeCon!!!\n\n"
    },
    {
      "time": "5 Jun 2008 — 5:43pm",
      "content": "Yep, and can't think TypeCon will _ever_ be any more affordable than it will this year.\n\n"
    },
    {
      "time": "5 Jun 2008 — 10:36pm",
      "content": "Mighty fine point Si.\n\n"
    },
    {
      "time": "6 Jun 2008 — 5:45am",
      "content": "I remember there was a conversation about this, in another place, at another time, (not on Typophile) and the consensus was that there were approximately 1000 people making a living via type design as a full time occupation. Defined a someone only doing type design and/or font development. My estimation is that it may be a little larger a universe than that, but probably not by much.\n\nSo, yes it is possible, yes it is fun, and yes, it is difficult to do. But there is money to be made if you can do it.\n\nI would also add that the majority of type designers working today are largely self-taught, but with the success of programs like Reading, that surely will change.\n\n"
    },
    {
      "time": "6 Jun 2008 — 6:54am",
      "content": "Also, \"making a living\" is relative to one's circumstances and standard of living -- Married or single? Urban apartment dweller or suburban/rural homeowner? Children or no? Saving for college or paying off student loans? Accustomed to the finer things or happy with deprivation?\n\n-- K.\n\n"
    },
    {
      "time": "6 Jun 2008 — 10:45am",
      "content": "Kent's comments are very true. It's one thing to scrape by, but another thing to earn a comfortable living to support a family, own a house, etc.\n\nI wonder of those 1000 people that James M (terminal design) estimates are doing full time type design, how many he imagines are earning USD $60,000 or better a year? My guess would be no more than 100, and probably a lot fewer.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "6 Jun 2008 — 11:01am",
      "content": "Even with the $60K (or locally adjusted equivalent) 1,000 world-wide doesn't seem too far-fetched.\n\nFull-time may be the catch. How many type designers are at it 100% full-time? Very few I think. And wouldn't they go nuts if all they did was draw letters? ;-)\n\n"
    },
    {
      "time": "6 Jun 2008 — 11:56am",
      "content": "When I'm not doing type design I'm drawing lettering for book jackets and brand identities. I spend my days drawing letters, and while I may be crazy, I haven't gone nuts yet.\n\n"
    },
    {
      "time": "6 Jun 2008 — 12:10pm",
      "content": "\"And wouldn’t they go nuts if all they did was draw letters?\"\n\nSi, you get a break when you kern letters and write opentype code :-)  \nFor a break, you get to go out and buy toner cartridges and paper!\n\nChrisL\n\n"
    },
    {
      "time": "6 Jun 2008 — 12:18pm",
      "content": "James, how much of the business come directly to you from the client and how much comes from designers who bring you in to do lettering for their jobs?\n\n"
    },
    {
      "time": "6 Jun 2008 — 12:59pm",
      "content": "JamesP,\n\nMy clients are designers and art directors. Rarely do I do any work that does not come from an AD or designer. In fact I can't remember ever doing a job like that.\n\nThey contact me to do the typographic/lettering component of their jobs.\n\nThis week I had a branding company asking for multiple versions of a logo for a product they were repositioning, along with a string of words they wanted to be rendered based on a piece of historical lettering associated with the brand (an upright connecting script). I created limited character set MM fonts in FL and offered them a cascade of weights to ponder.\n\nI also revised some book jacket lettering that I originally delivered to the client (and art director) last week. I also reviewed a bunch of old PS fonts for a Magazine that wants to update the kerning throughout their typographic palette. (again, an art director client)\n\nLast week, besides the jacket lettering I created a full-featured OT font from some old US Park Service photos I did that in 4 days, my record for Upper/lower/smallcaps/inferior/superior fonts with a few calts. Its a funky display design with some 30s overtones.\n\nBetween doing this, I've been slugging away at a bold display italic of a large Scotch/Modern/Didot family with Optical sizes. I finished the roman and text italic months ago, but the display italic had to wait while I did client work.\n\nThe week before that I was doing a OpenType conversion for a large collections of fonts associated with a California university, and just delivered the finals a few days ago.\n\nIt goes like that pretty much every week. Sometimes when it gets a bit slow I can focus more on my own font development, but I normally have to fit that font development in between my client work.\n\nAnd then there are the font sales from the website, and the customer service I provide when people who buy our font licensing need their hand held, or if a organization needs a formal proposal to be written so they can order our fonts.\n\nJamesM\n\n"
    },
    {
      "time": "6 Jun 2008 — 2:28pm",
      "content": "Most illuminating! James, the thing that strikes me is the marriage of virtuosity and efficiency required to do what you do. Aside from the issues of contacts, reputation, marketing etc, there is clearly a profound need to be a vigorous producer if you want to achieve in the way you have. Thanks for the post!\n\n"
    },
    {
      "time": "6 Jun 2008 — 9:23pm",
      "content": "Seconding Eben's comment... Thanks for posting a sample of your weekly TD activities in such detail, JamesM!\n\n"
    },
    {
      "time": "7 Jun 2008 — 3:30pm",
      "content": "Since you're nearby in London, GT, take a look at the TypeMedia program in The Hague, an intense course yielding impressive graduation projects from international students...at the very least, you benefit from being close to Dutch type designers.\n\n[http://new.typemedia.org/](http://web.archive.org/web/20150323155558/http:/new.typemedia.org/ \"http://new.typemedia.org/\")\n\nThe other point fascinating to me, as a type consumer, is how the logistics of launching a one-person foundry have changed: one master format, OpenType, and one very useful clearinghouse for marketing and sales, MyFonts. If you have high-quality goods it seems it's never been easier to bring them to an international market. Good current example: Ludwig Übele and his two serif families, Marat and Mokka, each launched on MyFonts recently as well as on his own site. Ludwig is a Type/Media grad; in fact Marat was his grad project there a year ago.\n\n"
    },
    {
      "time": "8 Jun 2008 — 4:56am",
      "content": "\"Best advice would be to attend TypeCon or ATypI and talk to people in the biz.\"\n\nLike, type design is a \"who you know\" occupation...I personally think of it as a \"what you know\" occupation, so conferencing would be somewhere between 20th and not at all on my \"Best Advice\" list. I could give you a lengthly list of top-notch designers who made it from 0-to-fully-functional without ever attending a single type con(ference), but that might raise even more of a hackle of hecklers, this time of year ;)\n\nCheers!\n\n"
    },
    {
      "time": "8 Jun 2008 — 8:05am",
      "content": "\\>Like, type design is a “who you know” occupation...I personally think of it as a “what you know” occupation,\n\nI wasn't suggesting a career of conference attendance - I was merely suggesting talking to type designers before embarking on a career in the field. Type designers tend to congregate at conferences.\n\n\\>on my “Best Advice” list.\n\nWhich you're keeping to yourself?\n\n"
    },
    {
      "time": "9 Jun 2008 — 3:10am",
      "content": "Thanks everyone. Some top notch discussion for me to ponder.\n\nI really appreciate the advice and help.\n\nThanks again,\n\nGT\n\n"
    },
    {
      "time": "11 Dec 2009 — 8:08am",
      "content": "This thread has been extremely useful to me, I too am considering a career in type design, but was having a hard time understanding what doing that full time would look like. JamesM, your insight was especially useful.\n\nI´ve designed the lowercase of one font (while I was still in school), which I aim to finish by next June. I´ve also done a fair amount of custom lettering for logos, etc. I´ll hopefully be enrolling in the new Master´s of Typography/Type Design at the Universidad de Buenos Aires in 2011 (fingers crossed!).\n\nSo I guess my biggest question now is how to get started as a professional typographer/type designer. I would imagine it would be similar to self-promotion as a graphic designer, but it seems that you work with a much smaller niche of people, as it is such a specialized field. I understand that going to conferences and just networking in general can be a great way to start, but there´s got to more to it than that.\n\nAny insight?\n\nThanks!\n\n"
    },
    {
      "time": "11 Dec 2009 — 9:02am",
      "content": "Cassandra,  \nOther than what you already said, starting type design is just that, starting. Make type long enough to get to know it as an ingrained, comfortable process and produce some work. You will grow by leaps with every new face produced.\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2009 — 7:55pm",
      "content": "GT, Cassandra, everyone. Firstly I question the 1,000 figure. Maybe 100 is close. I agree with Dezcom, work on type design a lot. Find what you like and do it and re-do it. I have been very fortunate in choosing to re-create type rather than strictly design it but then I always think of re-creation as legitimate as so many others have done it including Adobe, Bitstream, etc. Work from the original, re-create it, like Adobe Garamond for example, digitize it, and you have something essentially new. I have designed original fonts but have never been happy with them, although I have sold a few. I would certainly look at the school at the Hague as well as Reading. Read as much as you can, look at every type book you can, read, read and read some more. I have worked with and continue to use Fontographer, Type Tool, and FontLab Studio. I think I agree with Phinney, very few designers are making a median living, i.e., 60k. For me, type design or re-creation puts a loaf of bread on the table, not much more. But I love it. So do what you love. And yes, a plug from me for myfonts.\n\n"
    },
    {
      "time": "15 Dec 2009 — 1:00pm",
      "content": "<cite>Firstly I question the 1,000 figure. Maybe 100 is close.</cite>\n\nIt of course depends on the definition of what it is to make a living as a type designer, but consider who you may be leaving out. The world of type design is quite a bit bigger than what you may be able to sense through venues like Typophile or MyFonts. Custom type design is a world in itself that you don't hear often about.\n\nAnd don't forget other scripts. I don't have the numbers at hand, but as I recall there were around twenty type foundries in South Korea a few years ago. And you can bet that not all of them are single-designer outfits; these type foundries typically employ several people holding the title of type designers. The big three foundries employ huge teams of type designers to churn out fonts. Admittedly, the necessity of big teams is a feature unusually pronounced CJK type design, but that still means that the number of CJK type designers alone could easily be on the order of 100.\n\n"
    }
  ]
}
