{
  "id": "461",
  "title": "A question",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Can a designer that has designed an idendity for a company take ownership of that design? - and if the company wishes to change the idenity can the designer step in?   \n   \nI was always under the assumption that once the work was handed in - it was the companies property to do with as they wilt\n\n",
  "author": "anonymous",
  "time": "26 Jun 2003 — 8:48am",
  "uid": "1203",
  "comments": [
    {
      "time": "26 Jun 2003 — 11:02am",
      "content": "_\"Under copyright law, any exclusive use of a design or artwork licensed by a client must be transferred in writing.\"_ Get yourself a copy of the Graphic Artists Guild Handbook and read Chapter 13, Standard Contracts & Business Tools.   \n   \nWhat Sean states is true, but only because that is what has become the assumed method of business. For myself, I've made it a necessary evil to discuss usage and ownership with a client from the very beginning. I've only had a few horrible instances where I've handed over the actual artwork (digital files) to my clients, or rather long-since-fired to-live-a-much-happier-life clients. Yes, I fire my clients from time to time. Not a practice, nor habit. Just used to save my sanity.\n\n"
    },
    {
      "time": "26 Jun 2003 — 11:17am",
      "content": ""
    },
    {
      "time": "26 Jun 2003 — 12:55pm",
      "content": "\\> I fire my clients from time to time.   \n   \nGood for you!   \n   \nI've only done that once. But boy, you should have witnessed the 10-minute diatribe.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jun 2003 — 4:51pm",
      "content": "But if your work for a company as an employee, then all the work you do is owned by the company, true?\n\n"
    },
    {
      "time": "26 Jun 2003 — 5:04pm",
      "content": "True. Unless you were for an ad agency or design studio, then the above still applies. But, I would think the design studio wouldn't have a problem with you including the work you did in your own portfolio.\n\n"
    },
    {
      "time": "26 Jun 2003 — 10:52am",
      "content": "I can't think of a case where a designer would maintain that kind of ownership over an identity system, nearly 100% of design work in the US is done as \"work-for-hire\" meaning that all rights to the work belong to the company that paid for the work to be done.\n\n"
    }
  ]
}
