{
  "id": "4611",
  "title": "Rotring resources - back to basics",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Speaking as a former architectural draftsman:   \n   \n1. Pencil then ink. Pencil lightly, with sharp defined edges. You will need to see what you are going to ink. Erase carefully with a plastic eraser.   \n   \n2. Draw on onionskin or paper. If you draw on mylar your pens will die an early death. And you will need to spend more money relpacing the nibs more frequently. Mylar lasts longer than paper.   \n   \n3. If your straight edge and your french curves don't have a return on the edge or little feet or knobs on the bottom surface, raise the tool by taping small coins to the bottom. This prevents ink from becoming trapped under the edge. Trapped ink causes blobs and smudges and forces you to clean your edge. Keep these clean.   \n   \n4. Remember to keep your pens upright while drawing.   \n   \n5. If you are right handed, ink from the top left of the drawing, start top right if left handed.   \n   \n6. Make sure you have adequate room to work, move around the drawing, and place your tools for ready selection and use. Even lighting! The paper is reflecing light, not a light source so if you're used to drawing on a screen all the time then you need some lights that are adjustable as you move around and your outline develops.   \n   \n7. Draw a grid. If it's letters, draw guidelines for baseline, x-height, overshoots for both, ascender max height, Cap max height and overshoot, descender max depth AND LABEL THEM. If you know the widths of the things you are going to draw, in this case I would guess it's letters, then draw vertical guides: one left as the origin and the others at width of the letters. LABEL THEM.   \n   \nTape this down squarely on your drafting table.   \n   \nYou might want to paste this (or spraymount it) on a softer surface, whatever. You may find you like hard. Experiment before you get to this stage. I knew guys that taped thick corrugated cardboard to their tables and other guys that insisted on bare hard wood. I'm a 'just barely gives a little degree of soft' man myself, I used tag-board on my table.   \n   \nAlign your sheets over the grid when you draw. You can layer your sheets. on top of each other just like layers in a drawing program.   \n   \n8. Draw Large. Draw as large as is comfortable for you. Try drawing huge, though if you will be taking the drawings to the digital realm there might be a limit depending on your access to scanners or digitizing equipment.   \n   \n9. Take your time. **Enjoy** the feeling of pencil and pen on the surface of the paper. Study the way the ink lays on the page and how fast it dries and how black it is. As time passes you may want to try other inks so paying attention to this now is a good way to prepare and also enjoy the entire experience.   \n   \n10. You can extend the grid and draw elemental curves and parts that can be slid under the drawing as you go. I would tape the top of the paper hard and solid then just tack the corners down as I went. Sometimes you need to lift a page and do a little 'rotoscoping technique' to be sure you're drawing what you really want to be, compared to the underlying grid.   \n   \n11. I'll stop now and let you get on with it. This is an essay...sheesh   \n   \nHave fun! Maybe scan or photo your work and put it up for us to see?   \n   \nJon\n\n",
  "author": "Jon Whipple",
  "time": "5 May 2004 — 8:12am",
  "uid": "2332",
  "comments": [
    {
      "time": "11 May 2004 — 1:29am",
      "content": "An alternative to taping small coins under setsquares etc would be to find the small self-adhesive cork pads that some shops sell to stick under plates etc to stop them scratching polished furniture. These pads are thinner than coins, so will raise your drawing edges just enough to stop ink leaking under them, but not so much that you lose accuracy.   \n   \nAnd, if you can find them (they are long discontinued, but you can still come across them in suburban art materials shops), Graphos pens are better for drawing freehand than Rapidographs - there's a huge range of Graphos nibs, and it's well worth stocking up with them if you find a shop that still has any; I've got stocks that I bought for pennies (as the shop owners were basically glad to find someone mad enough to want this 'old' technology) that will probably last me until the day I die (or get too blind to draw any more).\n\n"
    }
  ]
}
