{
  "id": "4613",
  "title": "Late Nite Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I have been assigned to design 3 logo options (pro-bono) for a local college/young adult bible study group. The group meets in an intimate environment at a \"late\" time one night a week. Does anyone have any comments/suggestions for me?   \n ![Late Nite Logo](http://web.archive.org/web/20050526121941im_/http:/www.typophile.com/forums/messages/29/35167.jpg)\n\n",
  "author": "laimar",
  "time": "Wed, 2004-05-05 09:11",
  "uid": "3667",
  "comments": [
    {
      "time": " Wed, 2004-05-05 10:18",
      "content": "I like it sure doesn't look like bible though the first one looks more like a nightclub\n\n"
    },
    {
      "time": " Wed, 2004-05-05 10:36",
      "content": "I disagree, I haven't seen too many clubs with a Jesus fish in their logo. Maybe an upscale restaurant.   \n   \nThe second reminds me of a (good) talk-show logo, and I like the typography on #3 but the marque needs revision.   \n   \nDo you have to use that spelling of \"Night\"?\n\n"
    },
    {
      "time": " Wed, 2004-05-05 14:08",
      "content": "I disagree too. I think the jesus fish in the clock is an excellent concept although the logo ends up with the least interesting shape of the three. I think being a bit contemporary is good for the young target audience.   \n   \nMaybe try the dots without the background circle or break that circle up somehow...   \n   \nThe jesus fish reflected moon is aslo a good concept but I agree with Chase that it needs a bit of development   \n   \nDefinitely on the right track...keep going!   \n   \ns\n\n"
    },
    {
      "time": " Wed, 2004-05-05 14:22",
      "content": "Thanks for the feedback!   \n   \nThe reason I chose the black background circle on the first one is because the white on the black resembles night more. Also, without it, the fish looks less \"fishy\" and more like an X. But I do like the shape better and like that the viewer must look more without the circle. I don't know...what do you think?   \n   \n ![Black on White](http://web.archive.org/web/20050526121941im_/http:/www.typophile.com/forums/messages/29/35199.jpg)   \n   \nI do have to spell it \"nite.\"   \n   \nI agree that the third one might need some more development, but I am a little stuck. Does anyone have a suggestions on improving it?\n\n"
    },
    {
      "time": " Wed, 2004-05-05 14:25",
      "content": "Sorry for the double post! My browser told me it didn't work the first time ![:-)](http://web.archive.org/web/20050526121941im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " Wed, 2004-05-05 14:29",
      "content": "I think the fish is brilliant - much better than a cliche cross would be. The thing is, I couldn't see it until it was mentioned explicitly, but that's probably because I'm not in that mindframe.   \n   \nIt's nice to be a bit subtle, like I can see people thinking \"Oh, now I get it!\" about the logo _after_ having attended a session - that would give a warm feeling of being \"in\".   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2004-05-05 14:32",
      "content": "Not to put a damper on things, but I can't help but think of the breast cancer [\"pink ribbon\"](http://web.archive.org/web/20050526121941/http:/www.cancer.org/docroot/GI/gi_2.asp) instead of a fish--it may just be me. It's the modulated curves that that make it look ribbon-like.   \n   \nYou've got a great concept going. Have you tried incorporating a bible or cross?   \n   \n-Addison\n\n"
    },
    {
      "time": " Wed, 2004-05-05 22:10",
      "content": "You could always take the comic route and do a talk-show parody: \"Late Nite with Jesus Christ\" ![:-)](http://web.archive.org/web/20050526121941im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nWhat about making the crescent moon more 'crescent' (spans more degrees) and nesting the fish inside its bowl?   \n   \nAddison, I think it might be more unique not to use a cross/crucifix or bible, since many Christian outreach organizations already incorporate those motifs. The fish is a bit more subtle.\n\n"
    },
    {
      "time": " Thu, 2004-05-06 05:32",
      "content": "Laine, what is the logo being used for? Recruiting new members? Or is it just idenity for existing members. I think these questions, being answered, will go a long way to how subtle you can make the mark.\n\n"
    },
    {
      "time": " Thu, 2004-05-06 07:29",
      "content": "\"Late Nite with Jesus Christ\" -- I love it.   \n   \nYeah, the fish is a fresh approach. My mother is involved with a lot of breast cancer stuff, so that ribbon keeps popping up.   \n   \nHmmmm...\n\n"
    },
    {
      "time": " Thu, 2004-05-06 07:54",
      "content": "Didn't Jesus have a talk show on South Park?   \n   \n;o)   \n   \nI saw a ribbon at first, too, but now that I see the fish, i think the last option is quite nice. It was hard to see at first, but once I got the moon/fish reflection thing it was a really nice, clever, aha!\n\n"
    },
    {
      "time": " Thu, 2004-05-06 07:55",
      "content": "I think the reflection could work if it were more clearly defined, like if there were a groundline/horizon line between the moon and the fish that doubled as a faint underline for the \"Late Nite\" text.\n\n"
    },
    {
      "time": " Thu, 2004-05-06 11:15",
      "content": "The dual ribbon like swooshes reminds me of the ribbons affiliated with AIDS foundations. At first glance I thought this may be a night time Aids related benefit or awareness function.   \nBeing the heathen/gnostic that I am, it was disappointing to realize it was for bible studies.   \nPerhaps a worthy consideration?   \n   \nOtherwise it is strikingly beautiful and functional. Good job.\n\n"
    },
    {
      "time": " Thu, 2004-05-06 17:26",
      "content": "what's with swishes and curved lines in logos these days? i thought that fad was over!   \n   \nthe jesus fish doesn't look like a jesus fish to me. and the condensed typeface doesn't seem appropriate. i like the serif approach better (on the right)... but that needs way more development.\n\n"
    },
    {
      "time": " Mon, 2004-05-10 00:37",
      "content": "I see a ribbon before a fish. Except for the clock fish. I see the fish before the ribbon.   \n   \nBut the type does not say to me \"convesation\" \"discourse\". The current type makes it look like a LATENITE swingers christian club.   \n=)   \ntake care\n\n"
    }
  ]
}
