{
  "id": "46153",
  "title": "Project overhaul advice requested...",
  "forum": "Design",
  "tags": [

  ],
  "content": "I was recently hired by the American Lung Association of New England to overhaul the website for their great new campaign, Own Your Air. Despite being about two weeks old, the existing website (as of the time of this post) is quite dated, and lucky for me, ALA is unhappy with the results. The firm who designed the current site also did the identity (which will also be getting an overhaul), and used Helvetica (Swiss, actually) Black for the logo.\n\nI don’t believe Helvetica Black is an appropriate style face for a campaign about air quality (well, more than just that, but that’s the gist). To me, there’s nothing <cite>air-like</cite> about Helvetica Black whatsoever. It’s corporate, cold, bulky, blocky, and other objectionable adjectives from the beginning of the alphabet. The target audience is ages 25 to 45. I’m somewhere in the middle of this range, and I find its appearance absolutely unappealing. ALA wants cutting-edge, fresh, but the project managers (10+ years older than me) aren’t interested in any of the contemporary typefaces I have proposed.\n\nThe original (Helvetica/Swiss Black):\n\n ![](http://web.archive.org/web/20080821122623im_/http:/www.typophile.com/files/Picture-3_3925.png)\n\nCurrent proposal (Sauna Bold):\n\n ![](http://web.archive.org/web/20080821122623im_/http:/www.typophile.com/files/Picture-4_4172.png)\n\nAs appropriate as I feel the example above may be for this project, they want something “bigger,” “bolder,” “more forceful,” “less friendly,” “more empowering,” etc. I understand they’re looking for something that screams for a call to action (empowering people to take control of our air quality), but I also feel it should reflect the subject of the call to action itself.\n\nThey wish to keep it in title case, with the period. Other options are not an option.\n\nPart of me says, “Give ’em what they want,” but I happen to really believe in this campaign and wish to get it right. I also have a great relationship with these guys, and would like to maintain it.\n\nI’m not really sure how to proceed from here (both type-wise and politely educating the client any further). What are your thoughts? Any advice you may have would be quite appreciated.\n\n [‹ Best match sans serif/Trajan](http://web.archive.org/web/20080821122623/http:/www.typophile.com/node/46586 \"Go to previous forum topic\") [sandwich label ›](http://web.archive.org/web/20080821122623/http:/www.typophile.com/node/46565 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821122623/http://www.typophile.com/user/14473\" title=\"View user profile.\">microspective</a>",
  "time": "<br>",
  "uid": "14473",
  "comments": [
    {
      "time": " 6.Jun.2008 8.29am",
      "content": "Maybe focus on the Own rather than the Air. Have you looked at any Slabs? I like Sauna BTW.\n\n[Neo Retro](http://web.archive.org/web/20080821122623/http:/www.typografski.de/fontboutique/pages/e_free_neoretro.html), or even something by hand, particularly in the volumetric outline form might be interesting.\n\n"
    },
    {
      "time": " 6.Jun.2008 12.38pm",
      "content": "Based on what you’ve said, it sounds like the message they are trying to convey is, from their perspective, a serious issue (hence, the Helvetica Black, all caps, etc). The problem is you have a disagreement about the tone or feel of the design. It looks like you would prefer this campaign to have a friendlier feel, which they obviously don’t agree with. I would have to agree with them when it’s an issue of health. If you could work the blue in somewhere, and go with a strong typeface, other than Helvetica, that might be a good compromise. I would trust the client, and try to understand WHY they want these things they are asking for, then you can try and meet their objectives with a better design sense. They don’t know fonts, but they do know that what looks “serious” to them. I have always found that the more I try and understand the problem, and the message and intent of the project the better the solution will be. Good luck.\n\n"
    },
    {
      "time": " 6.Jun.2008 3.39pm",
      "content": "Sauna is pretty playful. Your gradients, color and outline had me thinking Orbitz.\n\nBrowse over at FontShop under “Condensed Black”, and it should turn up things such as:\n\nAbsara Headline Black  \nMeta Headline Black  \nSanuk Fat  \nBau Super  \nMundo Sans Super  \nNeo Sans Ultra  \nand on and on and on and on...\n\nIt should be possible to find a sans that will make both you and your client happy.\n\nSide note: What is the tone and voice of the campaign? Is it light and friendly, or more serious? Or is it like most website copy — ripped from a powerpoint and devoid of voice? (ahhhhh!) That to say, the success of this campaign is riding on the idea, not the font. Your font and design language should be appropriate and supportive to the message, not to the concept of “Air” or anything else.\n\nIn other words... You can shellac a turd, and it will be nice and shiny, but it will still stink. Good for your portfolio, bad for the air.\n\nEdit: Not saying the campaign or your work is a turd :-) Just checking to see if the horse is before the cart.\n\n"
    },
    {
      "time": " 6.Jun.2008 3.59pm",
      "content": "Another idea might be [Soho Gothic](http://web.archive.org/web/20080821122623/http:/www.fonts.com/findfonts/mondosearchresults.htm?st=12&kid=soho%20gothic). Lots of weights.\n\nFunny how we think of unhealthy air as being both thick and thin.\n\nSharon\n\n"
    },
    {
      "time": " 7.Jun.2008 11.39pm",
      "content": "Well, I can see why your client is unsatisfied with the website. It feels like the waiting room of the DMV.\n\nI think that Helvetica is versatile enough that it doesn’t necessarily have to be corporate and stodgy. Unfortunately, the designer before you has certainly given you evidence to set up against my claim.\n\nThere is an image of a senior citizen in the current site: would this change with your redesign? I’ve liked all the suggestions made so far for the varieties of type, but if the senior citizen audience will remain, it will certainly rule out selections like Neo Retro or Sauna Bold. I don’t see senior citizens taking that kind of type treatment seriously. In this case, “elegant” and “authoritative” certainly must play heavily into your design.\n\nI’ll hold off on any suggestions until I hear more about the audience or what else you hope to accomplish given the parameters of the project. I don’t want to waste your time with ideas that won’t help you.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 8.Jun.2008 8.34am",
      "content": "Hey everyone,\n\nThanks for the great feedback!\n\nRandy, no offense taken. ; ) And the FontShop idea was quite helpful.\n\nOthers, great advice about the “own” vs. “air.” Thanks.\n\nNick, DMV! Ha! The senior citizen is only one of several “teasers” (as they’ve been calling them). If you revisit the site (or click the ALA logo), it will reload to a different teaser (or it should, anyway). This site is more for a target audience of 25 to 45 year-olds, with a few of resources available for seniors.\n\nMore comments are encouraged...\n\n"
    },
    {
      "time": " 9.Jun.2008 3.40pm",
      "content": "I think the one with Sauna looks rather nice.\n\nAnother slightly rounded, yet strong typeface that might also is [FF Strada](http://web.archive.org/web/20080821122623/http:/www.fontshop.com/fonts/downloads/fontfont/ff_strada_ot/?sample_text=Own%20Your%20Air&sample_size=60). Which also works very well for text sizes.\n\n"
    },
    {
      "time": " 10.Jun.2008 10.39am",
      "content": "Well, I gave them a bunch of mock-ups with a dozen options. I asked them to pick their two favorites. They narrowed it down to Aachen, Vista black, and H&FJ Leviathan. Of the people who chose, the one they all had in common was Leviathan. Sweet.\n\nThanks for all your input, everyone.\n\n"
    },
    {
      "time": " 10.Jun.2008 10.26pm",
      "content": "Very cool. Leviathan is a great choice.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 18.Jun.2008 8.20pm",
      "content": "Crap! They changed their minds back to Helvetica Black.\n\n"
    },
    {
      "time": " 19.Jun.2008 1.57am",
      "content": "\\> Crap! They changed their minds back to Helvetica Black.\n\nVery good.\n\nI really don’t see why they should be forced to use such a fat, aged and ugly typeface like Leviathan. You might talk them into switching to the not so bulky Helvetica Heavy, however.\n\nFor some inspiration on using Helvetica why not take a look at some companies, that use it as their corpoarte typeface, like Lufthansa for instance (at least they deal with air, too ;))?  \n [http://www.lufthansa.com](http://web.archive.org/web/20080821122623/http:/www.lufthansa.com/ \"http://www.lufthansa.com\")\n\nIf you have not yet given up on your quest to avoid Helvetica at any price, this page with explicit alternatives might be of interest to you:  \n [http://www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-...](http://web.archive.org/web/20080821122623/http:/www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-helvetica/ \"http://www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-helvetica/\")\n\n"
    }
  ]
}
