{
  "id": "46196",
  "title": "Wax River - Type for Fabric",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello all, I'm a 3rd-year graphic design student from Wisconsin (UW-Stout), currently studying abroad at the Wanganui School of Design in Wanganui in New Zealand. Currently I'm creating a typeface for an installation that I'm also in the process of creating. The idea is that I stencil type onto fabric using water-resistant silicone spray (I originally used wax[hence the name], but that didn't work as well), and then let food coloring and water drip from a holding tank on to the fabric. As water soaks the fabric, the text is slowly revealed by the resistance of the silicone spray as the water (and dye) go around it. I guess it's sort of like a batik process.\n\nThe concept is to create a face that can withstand extreme distortion due to the highly variable context in which it will be used. They were originally drawn up at the size I intend to stencil them. I've separated out any intersection where the wax or spray would spread out too much.\n\nThe letterforms themselves aren't based on any particular face, though in retrospect that was what I should have done. As it is, they're based on mostly on my experience creating minscule-scale bitmap fonts back when I did pixel art in high school and middle school.\n\nIt loses most of its character when applied to fabric, but it remains fairly legible and overall I'm pleased with what I have. To give it some more appeal outside of its (very specific) intended use, I've done what I can to add interesting flourishes. The inconsistent baselines are an attempt to reconcile the fact that the \"serifs\" (which are actually intended to build up areas of water-resistant material to aid legibility once it goes onto the fabric—a sort of \"fail-safe\" measure in case water encroaches on a stem or crossbar somewhere and blots out part of a character) stick out beyond any other line that rests on the baseline or cap line.\n\nA sample of the typeface as I have it currently is attached. I'm open to any critique, but I'm most interested in proportion, stroke weight, and overall visual consistency (I think I might have a problem with the G, for instance). Thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [Picture-2.gif](http://web.archive.org/web/20150417203014/http:/typophile.com/files/Picture-2.gif) | 52.74 KB |\n\n",
  "author": "magic thread",
  "time": "8 Jun 2008 — 3:40am",
  "uid": "32199",
  "comments": [
    {
      "time": "8 Jun 2008 — 9:27am",
      "content": "Does your school have a textile or printmaking facility you can use? Your problem is mainly in your process. If you want to keep the details, I would suggest a different approach, maybe screenprinting. If you want it to have a washed-out, hombre-like feel to it, then I would recommend beefing up your typeface, increasing the space between shapes and accentuating the details.\n\n"
    },
    {
      "time": "8 Jun 2008 — 4:50pm",
      "content": "I'm placing priority on the idea that the text should be only revealed as the dye seeps down: silicone spray is almost completely invisible on the fabric. Screen printing would be easier and look nice (and also be more controllable), but it would run counter with what I'm trying to do with this installation. Thanks for the comment, though. How would I accentuate the details—increase the distance between the serifs? Make them larger?\n\n"
    },
    {
      "time": "13 Jun 2008 — 6:51pm",
      "content": "Make the serifs larger, beef up the space between shapes, increase the weight of the whole typeface. You might want to search on typophile for \"ink trap,\" the concept of ink traps is more or less the solution to making your typeface work on fabric.\n\n"
    }
  ]
}
