{
  "id": "46204",
  "title": "Latin typeface companion to Hadassah (Hebrew)",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey there,\n\nI’m designing a Hebrew book, and looking for some advice on what would be the best Latin typeface to go together with the Hebrew face Hadassah.  \nMost of the English appearances would appear in brackets or parenthesis, in the middle of Hebrew sentences\n\nAttached is a gif with my final option, from top to bottom -  \nLinoLetter, Dederon Serif, Raleigh, Chapparel, Excelsior, Officina Serif\n\nSo, any Typophile opinions?  \nwhich of these works best?\n\nMuch thanks in advance,  \nY.\n\n| Attachment | Size |\n| --- | --- |\n| [latin\\_hadassa2.gif](http://web.archive.org/web/20080821162018/http:/typophile.com/files/latin_hadassa2.gif) | 41.48 KB |\n\n [‹ Tropical type suggestions needed](http://web.archive.org/web/20080821162018/http:/www.typophile.com/node/46413 \"Go to previous forum topic\") [Complimentry Font Advice Needed ›](http://web.archive.org/web/20080821162018/http:/www.typophile.com/node/46415 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821162018/http://www.typophile.com/user/3259\" title=\"View user profile.\">Yotam</a>",
  "time": "<br>",
  "uid": "3259",
  "comments": [
    {
      "time": " 8.Jun.2008 2.04pm",
      "content": "Interesting one. . . from a display point of view, Excelsior sits quite comfortable amongst the Hebrew.\n\nwhen reduced to body text to me Chapparel reduces well and holds its clarity, and would seem slightly more legible on the eye.\n\n"
    },
    {
      "time": " 8.Jun.2008 4.01pm",
      "content": "This always brings up an interesting dilemma for me.\n\nComing from a calligraphic background I continually think contrast. In this interlinear translation piece I sparred with myself for days. What works and what doesn’t work.\n\nThis piece of course is not a book so maybe? the same rules do not apply. But... I always want to see a sparkle engendered by the interplay of two styles.\n\n ![](http://web.archive.org/web/20080821162018im_/http:/www.typophile.com/files/spirit_3454.jpg)\n\nDoes my questioning myself help you?\n\nMichael\n\n"
    },
    {
      "time": " 8.Jun.2008 4.14pm",
      "content": "Oh, and please don’t tell me I made a spelling mistake in the Hebrew. I would be devastated 16 years later to find it out.\n\nBringhusrt deals with duos very effectively. Check out his book, it may spur your thoughts.\n\nMichael\n\n"
    },
    {
      "time": " 8.Jun.2008 6.23pm",
      "content": "If I remember rightly, Henri Friedlaender designed Hadassa partly under the influence of Jenson. At any rate, I think Adobe Jenson goes pretty well with it.\n\nAs you know, the biggest problem with almost any Hebrew with roman is that the stress is opposite—thick horzontal vs thin vertical, rather than the other way around. Mixing them on the same line, as your text (a list of names) seems to require, is the most difficult thing, and the contrast approach, which otherwise can be very good, may be hard to bring off in that situation.\n\nSo if you are going to use Hadassa, I would experiment with different sizes, weights and optical sizes of Adobe Jenson and see what harmonizes best. There are a whole lot of options with Adobe Jenson Pro Opticals, so you can probably find something that works reasonably well. I suspect you can find a combination that will work better than any of the fonts you’ve tried so far.\n\n"
    },
    {
      "time": " 8.Jun.2008 6.43pm",
      "content": "Here are a couple for you William. Who’s Hebrew font is this. What is the underlying complexity of this piece that alludes to the split in East versus West writing, and (bonus points) what is the name of the ductus (best word I can come up with)?\n\nMichael\n\n"
    },
    {
      "time": " 8.Jun.2008 6.45pm",
      "content": "\\> Oh, and please don’t tell me I made a spelling mistake in the Hebrew\n\nYes :)\n\n\\> If I remember rightly, Henri Friedlaender designed Hadassa partly under the influence of Jenson.\n\nI’m not sure, but let me read his paper.again.  \n — The Making of Hadassah Hebrew (1967, written in German)\n\n"
    },
    {
      "time": " 8.Jun.2008 7.04pm",
      "content": "No way David... really???????? It took me months to find a New Testament Bible in Hebrew for the scripture of James. Finally a local Rabbi got me a copy of one and I matched letter for letter. Now I am devastated and will have to call my 86 year old friend and call him on it... for not pointing out my error(s)! I usually run these things by three people at least. Cannot remember on this one.\n\nA self flogging is in order\n\nMichael\n\n"
    },
    {
      "time": " 8.Jun.2008 7.55pm",
      "content": "Michael, you’ve got be stumped on all three.\n\nOn the Hebrew font, the square corner on the hey vs the round bet looks a little odd to me, but I’m sure David can give a more expert analysis. I’ll be daring and maybe make a fool of myself—not first time!—and guess that this font was not done by a Hebrew speaker.\n\nAlso for me, Latin, Hebrew and Arabic are all Western, so I’m not getting the West vs East thing.\n\nThe main thing that puzzles me about your piece is why the quote from the New Testament, which is originally in Greek, would be translated into both Hebrew and English. As neither is the original language, who is this for?\n\nedit: I cross posted. Guf(body) is with a gimmel, not a nun. Also maybe the Dalet should be a hey, so it would then read “haguf” (the body). Right David?\n\n"
    },
    {
      "time": " 8.Jun.2008 8.19pm",
      "content": "First off... leave it to a Gentile calligrapher to make a typo! :)\n\nIf I am not mistaken it was one of Ismar David’s faces. Phenomenal artist who made his way to NY via Germany and Israel. His sculpture is above reproach. Time dulls historical memories but google him.\n\nThe writing direction started to shift “back and forth” early on but was solidified in the sixth century B.C. Before that the writing, and, yes you are correct by the Greeks, was written boustrophedonically, as the oxen plows, literally reversing the non symmetric letters to suit the direction. Hence the multidirectional ethos of this piece. Subtle is always a plus in a design. I like the fact that most would not pick up on it.\n\nAs to Hebrew ... just a choice that would make my design point (and a bow to my father who was an Old Testament scholar)... Greek would not have worked. And english, well I grew up with the King James. Last time I looked, English was/is my first language... es la verdad!\n\nMichael\n\n"
    },
    {
      "time": " 8.Jun.2008 8.45pm",
      "content": "\\> so it would then read “haguf”\n\nRight Bill. Also about the bet (the square corner on the hey vs the round bet).  \n Around the 1930s & 1950s Isamr David developed a family of book, sans & cursive. Your sample is the sans, of course; far away from his original. Michael, this is your work (revival)?\n\n"
    },
    {
      "time": " 8.Jun.2008 8.46pm",
      "content": "Michael, I revised it a couple of times to be more concise.\n\nI at first discussed alternating lines (or pages) and your solution of contrast, which can work nicely, as in your example. But then I read the Hebrew of the first post and realized it was just a list of names, with the names also in roman. So it couldn’t work with the alternate line—or page—approach. The roman and Hebrew had to be mixed in the same line.\n\nWhen I realized that, I cut out the discussion of contrast as off point.\n\nReference to your example was cut along with the discussion, with no malice toward you, but because it was off point. Now here it is back, OK?\n\n"
    },
    {
      "time": " 8.Jun.2008 8.59pm",
      "content": "William\n\nNoticed you edited me out of your first post! Hmmmmm?\n\nAnd I am not sure I agree that Hebrew and Arabic would be considered Western by any calligrapher’s standards that I know. Totally different ethos. More of a painterly quality. Granted they are not pictographic but they are not Western. They are more, in my mind, Eastern in that they do not relate to the Latin. And the direction is a clear give away. The only common denominator is the type of pen but used in “your ways,” it is totally alien to Western scribes... even you admitted the vert vs. hor differences (that is a truly dramatic shift in the paradigm. I hate that word).\n\nDiametrically opposed take on forms. This is a very simplistic response, and I am sure not up to PHD standards, but I see the Middle Eastern as forms separate from both East and West while having characteristics of both.\n\nMichael\n\n"
    },
    {
      "time": " 8.Jun.2008 9.03pm",
      "content": "I edited my edit. Sorry\n\nMichael\n\n"
    },
    {
      "time": " 9.Jun.2008 7.27am",
      "content": "William\n\nMaybe what I am trying to say is I do not see the genetics. I do in Greek and Cyrillic.\n\nSo help me if you will to see what you are saying.\n\nMichael\n\n"
    },
    {
      "time": " 9.Jun.2008 8.04am",
      "content": "Visually, the Greek caps and Cyrillic are obviously closer to Roman than Hebrew or Arabic. When I said they are all Western, I was really thinking of cultural history, as before modern times there was a lot interaction and influence between all these cultures—more than there was with India, and particularly more than there was with China and the rest of the far east.\n\nAs far as the scripts, I don’t see Hebrew square script as painterly. It is also pen written—not brush like the Chinese—and very restrained and modular.\n\nArabic is also pen written, but it seems to be traditionally cursive and connected, unlike the traditional formal hands in the other scripts. I don’t know much about Arabic, but it seems to have a richer tradition of artistically expressive calligraphy than any of these other scripts. As I understand, the prohibition against representational images in Islam pushed artistic expression into calligraphy.\n\n"
    },
    {
      "time": " 9.Jun.2008 9.50am",
      "content": "I agree with the cultural aspect. I agree with the modular and restrained. But does that make them Western as opposed to Eastern?Ultimately I see a disconnect in form, character and most importantly writing direction, which allies the Hebraic more with the East.\n\nJust want you to know William I sat up a good part of the night reflecting on this. I have no “historical data”... it is just a gut reaction. Pure and simple.\n\nFrom the calligraphers standpoint, if I were to do a Ketubah (sp?) I would have to do it upside down and backwards. That is why I said what I said... about the disconnect from the West. Maybe this is similar to our last discussion. I am coming at this from a practitioners point of view.\n\nNot getting contentious just trying to understand. Maybe since they, the forms are alien to me, I perceive them differently than you. They are a bit abstract, almost painterly to me. Maybe even pictographic.\n\n ![](http://web.archive.org/web/20080821162018im_/http:/www.typophile.com/files/Beloved_5039.jpg)\n\nThis to me is what I see. Even though colors cloud the issue, I see different directions and non similar forms, and even though they are thick and thin they are that in completely different ways.\n\nMichael\n\n"
    },
    {
      "time": " 9.Jun.2008 11.01am",
      "content": "Hey William\n\nHave you noticed that you have to scroll from left to right on these jpgs.\n\nAs Arsenio Hall used to say... Hmmmmmm!\n\nMichael\n\n"
    },
    {
      "time": " 9.Jun.2008 11.30am",
      "content": "Michael, just checking I see that while Hebrew and Arabic are written right to left, Indic languages are written left to right. So I don’t see how you can call Arabic “Eastern” and then go farther East and have it become “Western”!\n\nI guess I just think it is simplistic to make a simple “east-west” divide on a lot of things. “Eastern” isn’t one thing.\n\nOn the ’painterly’ aspect of Hebrew vs Latin, I think you may see it this way because, I gather, you don’t read Hebrew. When you start to see the letters as letters rather than designs they look less exotic. If you flip eg a bold seriffed letter upside down or mirrored, it also looks very exotic and strange.\n\nIn its origins, European society has dual Hellenistic and Hebraic origins. That we ended up with Latin letters is because Rome was the most successful at imperialism. But culturally Athens and Jerusalem are more important. That English is the international language is also because England was the most successful modern imperialist power. It was culturally important also, though, being the origin of liberal representative democracy as well.\n\nThe big divide today is the extent to which societies have embraced Enlightenment Europe: science, liberal democracy, and women’s equality.\n\n"
    },
    {
      "time": " 10.Jun.2008 11.01am",
      "content": "Given the constraints others have mentioned, I wonder if a latin with a slight horizontal emphasis could work. What comes to mind immediately is the (awesome) work of Alejandro Lo Celso:\n\nI wonder if Quimera might work, especially since the latin is only for short bits:  \n [http://www.pampatype.com/php/2008/Especimen.php?&pag=pag\\_E\\_Quimera.html](http://web.archive.org/web/20080821162018/http:/www.pampatype.com/php/2008/Especimen.php?&pag=pag_E_Quimera.html \"http://www.pampatype.com/php/2008/Especimen.php?&pag=pag\\_E\\_Quimera.html\")\n\nBorges also has strong horizontal movement:  \n [http://www.pampatype.com/php/2008/Especimen.php?&pag=pag\\_E\\_Borges.html](http://web.archive.org/web/20080821162018/http:/www.pampatype.com/php/2008/Especimen.php?&pag=pag_E_Borges.html \"http://www.pampatype.com/php/2008/Especimen.php?&pag=pag\\_E\\_Borges.html\")\n\nAlso consider ITC Mendoza. Not so horizontal, but gut says it would work well with Hebrew.\n\n"
    },
    {
      "time": " 10.Jun.2008 11.19am",
      "content": "Interesting idea, Randy. I generally don’t like reversed contrast roman fonts, but it might work as a secondary roman to the Hebrew.\n\nYet another path is to use relatively monoline fonts. I’ve used David, a Hebrew face by the aforementioned Ismar David, with Friz Quadrata. Both are relatively mono line and with small pointed serifs.\n\nOh and Michael, that quote from song of songs is really beautifully done.\n\n"
    },
    {
      "time": " 10.Jun.2008 1.57pm",
      "content": "I’ve read this thread with interest. I think one of the major problems with matching Hebrew to Latin is that the printed Hebrew script is far more similar to the calligraphic script used for writing religious texts than the Roman forms are to their to calligraphic equivalents. Essentially, we are trying to match a blackletter face with a Roman.\n\nMichael, have you had a look at traditional Hebrew calligraphy? As with the Latin scripts, there are a number of different forms, ranging from the [|ornamented scripts](http://web.archive.org/web/20080821162018/http:/www.templesanjose.org/JudaismInfo/writing/Calligraphy.htm) used for writing religious texts, through less formal “Rashi Scripts”, to the cursive script which most people use for writing (and which looks nothing like the printed forms) and other modern variants. The traditional formal scripts, in particular, are very much based on pen-craft and can’t easily be realised in another way.\n\n-Jacob\n\n"
    },
    {
      "time": " 10.Jun.2008 2.09pm",
      "content": "Bill — I didn’t see anything about the influence of Jenson; Image 1 is the scroll of Esther, written c.1800 — that was the main influence:\n\n ![](http://web.archive.org/web/20080821162018im_/http:/www.typophile.com/files/Heb1_4681.jpg)\n  \nImage 2 — early Hadassah; punches cut by Paul Koch (1939):  \n\n ![](http://web.archive.org/web/20080821162018im_/http:/www.typophile.com/files/Heb2_5791.jpg)\n\n"
    },
    {
      "time": " 10.Jun.2008 4.48pm",
      "content": "David, I thought I read that he was influence by Jenson in [The Book of Hebrew Script](http://web.archive.org/web/20080821162018/http:/oakknoll.com/detail.php?d_booknr=71692&d_currency=) by Ada Yardeni. But I got it from a library, and my memory could be playing tricks on me.\n\n[Here in English](http://web.archive.org/web/20080821162018/http:/www.dartmouth.edu/~library/Library_Bulletin/Nov1991/LB-N91-Fontaine.html) is a fascinating account of the saga of the creation of Hadassah type face. It matches what you say about the influence of a manuscript of the scroll of Esther.\n\nIt also cast light on several issues mentioned here.\n\nFollowing what Michael has been saying, this account does say that “He realized that Hebrew letters, unlike Roman letters, do not consist of any completely straight lines.” However, this is not quite accurate. I just checked my “HadasaMFO” and it has straight and parallel \\*horizontal\\* lines, though not vertical ones. So I think that Michael’s impression of Hebrew as more ’painterly’ is because there is modulation in the Hebrew where an eye used to roman would see straight or nearly straight lines. But this is really a feature of the reversed contrast. In roman, much of the modulation is in horizontal strokes—the arches and serifs. Whereas in Hebrew more of it is vertical.\n\nThis article also touches in the issue of whether Hebrew is inherently more calligraphic. As we’ve been discussing at length [in another thread](http://web.archive.org/web/20080821162018/http:/typophile.com/node/45708), Sumner Stone just wrote an article about roman type becoming less calligraphic with Jenson and Griffo.\n\nFriedlaender was quite aware of this basic history, as he studied with the great Rudolph Koch. And according to the story he deliberately set about to make his font more tyopgraphic, not calligraphic. (Also my memory of the influence of Jenson is plausible, given this story.) Personally, I think he was pretty successful.\n\nHe also rejected the early versions of the font, such as, presumably, the one in David’s graphic.\n\nThe story is one of the more dramatic ones in the history of type, as he buried his drawings in 1942 and hid from the Nazis, emerged from the war alive in 1945 and dug them up. Then he was able in 1949 to convince the Lettergieterij Amsterdam to produce the type—I assume foundry type—and completed it while living in Israel.\n\nKinda make me feel small complaining about all those kerning pairs in digital type!\n\n"
    },
    {
      "time": " 10.Jun.2008 6.45pm",
      "content": "“Sumner Stone just wrote an article about roman type becoming less calligraphic with Jenson and Griffo.”\n\nWhoooooa! Did I in fact miss the point of the other thread???????????\n\nMichael\n\n"
    },
    {
      "time": " 10.Jun.2008 8.03pm",
      "content": "Pretty much :)\n\nStone: “They [the letters of Jenson and Griffo] were products of a new kind of design process—typographic instead of scribal.”\n\nFrom the article on Hadassah: “The main problem, according to Friedlaender’s research, was that the Hebrew alphabet never made an adequate transition from manuscript letter to typeface as had Roman letters.”\n\nSo Friedlaender was aware of the key transition that Jenson and Griffo made, and wanted to do the same for Hebrew.\n\n"
    },
    {
      "time": " 10.Jun.2008 8.12pm",
      "content": "I am sorry but they were typographic interpretations of written letters. You disavowed pen manipulation and pressure/release techniques prior to the 15th century.\n\nAm I missing something?\n\nMichael\n\n"
    },
    {
      "time": " 10.Jun.2008 8.14pm",
      "content": "\\> Following what Michael has been saying, this account does say that “He realized that Hebrew letters, unlike Roman letters, do not consist of any completely straight lines.”\n\nThis is part b of the story;\n\n\\> Then he was able in 1949 to convince the Lettergieterij Amsterdam to produce the type\n\nThis is part a of the story.\n\nFriedlaender wasn’t so happy with the results (part a, see image 1):\n\n“The text face had turned out to be too dark; it appeared to be hardly lighter than the commonly used Frank-Ruhl type, and we had hoped to be able to get away from its blackness. The contrast in weight between the text and the bold faces had become minimal; the difference between these two versions had almost disappeared. The straight downstrokes still appeared inane and stiff, a shortcoming that would become intolerable in larger sizes.....\n\n“The bold was now on the verge of looking spotty. Here the contrast between heavy and fine lines appeared even more exaggerated than in the text face. The stiffness of the downstrokes was even more disturbing....\n\n“It seemed inadvisable to try to correct the existing drawings. Instead, it was decided I should draw the whole set afresh with all the changes... [see image 2] I detest the use of ruler and French curves when drawing letters. Besides, in contrast to the Roman alphabet, Hebrew has no system of straight lines, circles, or 90° angles. It rather is made up from a variety of almost straight elements, elliptical curves, and angles that cannot be related to any simple geometrical system.”\n\nImage 1 — 1950:\n\n ![](http://web.archive.org/web/20080821162018im_/http:/www.typophile.com/files/Hads1_5021.jpg)\n\nImage 2 — 1958:\n\n ![](http://web.archive.org/web/20080821162018im_/http:/www.typophile.com/files/Hads2_5838.jpg)\n\n"
    },
    {
      "time": " 10.Jun.2008 9.02pm",
      "content": "\\>they were typographic interpretations of written letters.\n\nThe question Stone was addressing is whether there was something conceptually new in the typographic interpretations of Jenson and Griffo, something that was distinctive to designing type as opposed to writing. He thinks there was. I agree.\n\nThat same novelty it seems is what Friedlaender was working on. His priority that the letters had to have the “quality of transparency” (in my link above), and his deep concern about “color” that David quotes both I think reflect the specifically typographic approach.\n\nRemember, the essay reports that Friedlaender believed that existing Hebrew faces hadn’t introduced that key novelty of approach. That is Friedlaender—who had a scribal training also—and not me.\n\nMaybe there is no novelty of approach in type design by Jenson and Griffo, no difference from writing, but that evidently not the view of either Stone or of Friedlaender.\n\n"
    },
    {
      "time": " 10.Jun.2008 9.50pm",
      "content": "“they (there, I think is what you were trying to say) was something conceptually new in the typographic interpretations, something that was distinctive to designing type as opposed to writing.”\n\nYep. a lack of understanding of bowl letters that was exhibited in the jpg’s in the other thread! His forms were more old style than transitional (pen formed). Yet most of the other forms were transitional.\n\nMichael\n\n"
    },
    {
      "time": " 11.Jun.2008 7.52am",
      "content": "Michael, both old style and transitional roman are influenced by the pen, but different pens. The old style by the broad pen and the transitional by the pointed pen. Since “transitional” is over 200 years later than old style type, and is influenced by a later kind of pen, it is anachronistic to talk of transitional features in Jenson and Griffo. It is historically more accurate, I think, to write of them, as Stone does, as influenced by the painted and inscribed Imperial Roman capitals.\n\nAs I said in the earlier thread, Jenson and Griffo make the diagonals lighter than a broad pen would, and this was for typographic reasons of even color. Here (see my link to the Cornell essay) Friedlaender was complaining about the aleph—with its heavy diagonal stroke—being too dark. If you compare the aleph in the manuscript that David posted with the final version of Hadassah that he posted, you will see that the diagonal has become even thinner than the horizontals, in contrast to the pen written starting point for his work.\n\nAgain, this is an effort to be specifically typographic. You seem to deny that such a thing exists, but I think that this story vividly shows that it does exist. As the Cornell link explains, Friedlaender did a study of historical styles of Hebrew script, identifying the different pens that influenced the different styles. And then though strongly influenced by the pen forms, in the end he did something that none of the pens would have done.\n\nThanks David for the fascinating illustrations. I feel like with the Cornell link and your further words and images of Friedlaender’s story, I am starting to understand Hebrew type design a bit in this thread!\n\n"
    },
    {
      "time": " 11.Jun.2008 12.03pm",
      "content": "\\> Thanks David for the fascinating illustrations...\n\nYou’re welcome!\n\nAs Moshe Spitzer wrote: Henry Friedlaender’s Hadassah has proved to be highly successful face, well designed in the Ashkenazic tradition and elaborated with much sophistication (1952, Alei Ayin).\n\n"
    },
    {
      "time": " 11.Jun.2008 12.50pm",
      "content": "Granted, your definition and my definition of Old Style and Transitional differ. I in fact think these are terms that are fairly new and confusing. I have consulted 4 books and it is like trying to get 4 economists to agree. Classifications are as varied as authors. But the pointed pen was never used to make transitional unless it was used as a drawing tool for outlines and then the letters were filled in.\n\nThe pointed pen is the originator of the Copperplate and Spencerian scripts and not the Roman form!\n\nMichael\n\n"
    },
    {
      "time": " 11.Jun.2008 2.02pm",
      "content": "\\>But the pointed pen was never used to make transitional\n\nYeah, I tried to argue that the pointed pen was not so important to Baskerville until I was proven wrong, first by a bunch of illustrations from John Hudson and James Mosley, and then by my dipping a pointed pen in India ink and doing an “n”—and seeing the characteristic Baskerville arch emerge from the pen. Go about a third down [this thread](http://web.archive.org/web/20080821162018/http:/typophile.com/node/37310) and watch me crumble under the onslaught. You’ll enjoy it :)\n\n"
    },
    {
      "time": " 12.Jun.2008 8.21am",
      "content": "I’ve always thought that Hebrew looked rather rigid and chunky, when copmared to other modern branches of the proto-semetic language like arabic, which has stunning calligraphy and beautiful form.\n\nHaving said that I wonder which would be wiser:\n\n1) To mirror the sturdiness of Hebrew’s letterforms with a chunky thick slab-serifed typeface\n\n2) Or to contrast the solidity of the hebrew script with a fluid round text that has the retains the beauty of calligraphy and has both thicks and thins\n\nEither way, I’d love to see what you come up with!\n\n"
    },
    {
      "time": " 12.Jun.2008 12.47pm",
      "content": "David or William,\n\nYou better handle this one. I don’t want to be the one that bursts his bubble.\n\nChunky huh?\n\nMichael\n\n"
    },
    {
      "time": " 14.Jun.2008 8.41am",
      "content": "“Ki ka’asher” (כי כאשר) at the beginning of your translation isn’t strictly wrong, but it is awkward.\n\n"
    }
  ]
}
