{
  "id": "46200",
  "title": "Help with Logo Design",
  "forum": "Design",
  "tags": [

  ],
  "content": "Let me start off by saying I am in no way a graphic designer, although I do know what looks good and what doesn’t.\n\nBasically, the place where I live has a residents group (?!) and I am interested in designing a new logo for them, not that they have on e now.\n\nIt’s a very rural area, and the logo will have to reflect that (the current ’symbol’ is a Lapwing). As much as I would like, it can’t be too abstract.\n\nSo, has anyone any ideas for a logo concept?\n\nThanks,  \nTed\n\n [‹ Looking for Mrs Eaves alternative](http://web.archive.org/web/20081012145223/http:/www.typophile.com/node/46976 \"Go to previous forum topic\") [1960's timeline ›](http://web.archive.org/web/20081012145223/http:/www.typophile.com/node/47011 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012145223/http://www.typophile.com/user/30496\" title=\"View user profile.\">tedwinder</a>",
  "time": "<br>",
  "uid": "30496",
  "comments": [
    {
      "time": " 8.Jun.2008 9.55am",
      "content": "Hi Ted,\n\nI’m assuming that you have ruled out the idea of getting a designer to do this project, although you may want to consider it if it’s worth it to the residents’ group.\n\nGive us some more information:\n\n- What kind of residents’ group?\n- Who are members of the residents’ group? Give us some demographic information about the group.\n- What is the purpose of the residents’ group? What do they do?\n- Could we see the current logo?\n- What would you like to achieve with the logo? What does the current logo lack that would require a redesign?\n\nLet’s start there. If you’re willing to learn, then I’m sure people will be willing to help you.\n\nYours,  \nNick\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 8.Jun.2008 10.10am",
      "content": "Thanks for the reply!\n\n- The group was formed when our local council announced that they planned to quarry on fields very near the marsh/common where we live. Every year or so we get together and do events (garden openings etc.) to raise money to fight the quarrying.\n\n- Members are in the older half of life (40+), and are all friendly people (to use demographic terms :P), all married etc.\n\n- There isn’t really a logo now, apart from an image ( [http://www.rspb.org.uk/Images/lapwing\\_300\\_tcm9-139973.jpg](http://web.archive.org/web/20081012145223/http:/www.rspb.org.uk/Images/lapwing_300_tcm9-139973.jpg \"http://www.rspb.org.uk/Images/lapwing\\_300\\_tcm9-139973.jpg\")) with text underneath (NUTFIELD MARSH RESIDENTS GROUP)\n\n- The logo would appear on signs and promotional pieces etc. It doesn’t exactly need to be memorable as such, just a nice mark that isn’t too modern or fussy.\n\nHope that is enough to get started. :)\n\n"
    },
    {
      "time": " 8.Jun.2008 10.47am",
      "content": "I think you should post some of your ideas for everyone to comment on.\n\nSharon\n\n"
    },
    {
      "time": " 8.Jun.2008 11.05am",
      "content": "I am really not an ideas person - once I have a concept, I fine, but my mind blanks when it comes to thinking one up. Good job I’m not a designer, eh?\n\n"
    },
    {
      "time": " 8.Jun.2008 11.43am",
      "content": "Yep. You should probably hire one.\n\n"
    },
    {
      "time": " 8.Jun.2008 8.10pm",
      "content": "stylized Lapwing?\n\n"
    },
    {
      "time": " 8.Jun.2008 10.43pm",
      "content": "Hello again Ted,\n\nI would encourage you to research logos of conservation groups and find ones that you like. Then post links to them so that we can see what you like, and then offer advice on how you can develop your own idea. Be warned, however: if you want help with a logo design, then you will have to learn to be an “ideas person.” We can’t help you if you’re unable to come up with an idea that can be criticized and shaped by others’ opinions. Like I said before, by demonstrating a willingness to learn, people may be able to offer advice and direction on how you can gain the skills and perspectives to design your own logo.\n\nI’m getting a sense, however, that when you say, “Help with Logo Design,” you may actually mean that you want other people to come up with an idea for a logo and implement it for you. In this case, you’re effectively asking us to design a logo for you for free. If you want pro bono work for your organization, then just come out and ask for it. Notice, however, that people get paid for design work, and if you are not willing to hire a designer, then you must be willing to accept that there may or may not be people who are willing to do work for you for free.\n\nOnce you’ve clarified your intentions and what you’re willing and/or able to contribute to the development of your organization’s logo, then this will help us in how we can respond to your needs and expectations.\n\nYours,  \nNick\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 9.Jun.2008 12.44am",
      "content": "Let us also know how you propose to design the logo - as in what software you intend to use. If you’ve done any kind of design work before, then you’ll probably have some type of graphics package. I have to agree with Nick though; you need to be more transparent about what you actually want to get out of posting on these forums.\n\nJH\n\n"
    },
    {
      "time": " 10.Jun.2008 3.14am",
      "content": "So much for that then. Looks like Ted was looking for a ’Freebie’ after all.\n\nJH\n\n"
    },
    {
      "time": " 22.Jun.2008 2.25am",
      "content": "No, I’m not asking for a free logo design at all, I’ve just been away from this site for a while. :) I can see you don’t really understand my situation, so I will have a go myself.\n\n"
    },
    {
      "time": " 8.Jul.2008 2.26pm",
      "content": "Shutterstock has a Lapwing head, reminded me of Ducks Unlimited. I’m not saying to rip it, but it may give you a place to start.\n\n ![](http://web.archive.org/web/20081012145223im_/http:/www.typophile.com/files/lapwing_6622.gif)\n\n"
    }
  ]
}
