{
  "id": "4621",
  "title": "Critique on my restaurant logo plz",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey guys ... plz help me with some crit with my restaurant logo ... we are supposed to do this assignment to create the brand identity for a restaurant and i chose to create a swiss cafe... the cafe is called farb\n\n",
  "author": "digital_deejay",
  "time": "6 May 2004 — 2:22am",
  "uid": "3679",
  "comments": [
    {
      "time": "6 May 2004 — 4:11am",
      "content": "The \"a\" and \"b\" letters could suggest some cups of coffee. what do you think? Work harder on the \"F\" letter... it doesn't say too much.   \n   \nKobe.\n\n"
    },
    {
      "time": "6 May 2004 — 4:57am",
      "content": "Kia Ora Ritesh. I guess this is for Tanya eh?   \n(There is a definate spike of Wanganui   \ndesigner posting as of late!) How about   \nthinking about what food is ultra colourful,   \nand subtley suggesting that within the glyphs   \nof the word? I can see fruit in this, might be   \ndrops of fruit juice, or the suggestive umlaut   \nabove the a - like stylised leaves. I reckon   \nthe type is quite suitable.   \n   \ngood luck!   \n   \nkris\n\n"
    },
    {
      "time": "6 May 2004 — 5:18am",
      "content": "Ritesh, it looks nice but I don't get any sense of idenity. It could just as easily be a logo for a wood working company. You need to hit the consummer over the head alittle bit. How about a tagline \"a swiss cafe\" or cafe imagery. Don't be so subtile.\n\n"
    },
    {
      "time": "6 May 2004 — 6:01am",
      "content": "oki guys thanks for the comments... here is some quick changes i made.. 1 thing which is annoying me is the \"F\" in the bottom line.. i'm not sure about it.. also im not sure if the colour of the cheese is going with the logo... im also not sure if the cheese is recognised as the umlaut...do i have to have the cheese as yellow ? is the cheese becoming too dominant ?   \n   \ncomments plz   \nthanks   \n   \n ![farbacheese](http://web.archive.org/web/20131024012152im_/http:/www.typophile.com/forums/messages/29/35245.jpg)\n\n"
    },
    {
      "time": "6 May 2004 — 6:12am",
      "content": "sorry about so many of the sam msges guys just had some problems with this site and it decided to post my message and then gave me error that page not found\n\n"
    },
    {
      "time": "6 May 2004 — 7:53am",
      "content": "Yeah, it does that. I learned quickly that Typophile teaches you the Zen habit of expecting your post to go through ![:-)](http://web.archive.org/web/20131024012152im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI agree with Florian, the capital F in the main logo really isn't working for me. Try straightening the spine but keep that rounded upper-left corner. Also, the font you're using is very much a display face\n\n"
    },
    {
      "time": "6 May 2004 — 10:19am",
      "content": "Ritesh, here is what happens with the posting. About half the time you will receive that error message. Ignore it and go back. Go up to topics and you will see your name listed as the last posted message. Have faith it works.   \n   \nAs for the logo what is your primary audience? Think is it McDonalds or is it Starbucks? If its McDonalds keep the yellow marks. If its Starbucks make the whole logo more upscale. Maybe even a metallic look like a latte machine.\n\n"
    },
    {
      "time": "6 May 2004 — 11:04am",
      "content": "I see an issue with negative space.   \npartial solution- shorten center horizontal of F and R.   \nAs for being Swiss, consider black, red and white as colors.   \n ![](http://web.archive.org/web/20131024012152im_/http:/www.typophile.com/forums/messages/29/35283.jpg)\n\n"
    },
    {
      "time": "6 May 2004 — 3:43pm",
      "content": "hey guys here are some more changes to the logo... i didnt like the cheese coz it made it too \"cheezy\" .. and also i removed it coz i want my cafe to be like an u pmarket one but at the same time shows the funk with the colours played with the form of F in number 8 and 9 and im not quite sure which one to use really ... thanks for your comments and analysis OLE... helped a lot .. well thats from me for now ... and thanks to every1 for your comments!! cheers!   \n   \n ![](http://web.archive.org/web/20131024012152im_/http:/www.typophile.com/forums/messages/29/35301.jpg)\n\n"
    },
    {
      "time": "6 May 2004 — 4:58pm",
      "content": "Maybe use coffee beads for the umlaut, or it is too obvious?   \n   \ng\n\n"
    },
    {
      "time": "6 May 2004 — 6:05pm",
      "content": "here is another modification of my logo... i think im gonna use this one for my cafe because it looks refreshing and young and bright and bold which is what i want to show with my logo..... any comments for improving it are welcome.... thanks   \n   \n ![](http://web.archive.org/web/20131024012152im_/http:/www.typophile.com/forums/messages/29/35312.jpg)\n\n"
    },
    {
      "time": "7 May 2004 — 6:54am",
      "content": "Ritesh, the Fa combination needs to be tightened I could drive a truck between them, the same could be said for the rb combination. I like the new colors alot. I personally don't love floating type, I would tend to make the tagline a little larger (not alot) and tighten up the spacing.\n\n"
    },
    {
      "time": "7 May 2004 — 7:38am",
      "content": "well daniel thanks for the comments about the spacing between fa and rb... but about the taglinge... i want the spacing to be that way because im going for that kinda style and ya i will post the modified one tomorrow right now i better hit that sheets ... its almost 3 am .... thanks a lot again\n\n"
    },
    {
      "time": "7 May 2004 — 8:57am",
      "content": "I think the name is interesting enough. I used the shortened version of University from German and made it ooni for a project.   \n   \nThe issue comes with the umlaut at the end. Though I am not from Germany I do speak the language and it looks like a improper use for no purpose at all. You say it would say phontically \"farbay\" Even using the umlaut on the last a it would never phonetically say 'ay'.   \n   \nIt like the issue that people have with Haagen Dazs. Sort of evocative, completely incorrect in grammatic acknowledgement and cultural relvevance(the dutch use double vowel 'aa' and such but the Germans do not), but is a fairly strong brand once you get past the semantics.   \n   \nIn english and in german it would be 'far-bah'. I think the name is unique enough that it can use the original and implied pronounciaton better than just 'jazzin' it up.   \n   \nAs for the colors I would find two colors that share similar hues. Brown and darkening yellow. Orange and brown. Or go in a completely opposite direction if you so choose. It has got be true to form or a polar opposite. Depending on how you are interpreting the mood, location, price and products offered, etc.\n\n"
    },
    {
      "time": "6 May 2004 — 11:11am",
      "content": "Does the last 'a' have to be in red? Perhaps I'm missing something. It seems to me that there are too many different things, visually, going on: different colors, some with outlines, counters filled with different colors. and the typeface used for \"swiss cafe and bar\" should be complimentary, but not the same, unless of course this typeface is part of a greater family with smallcaps or somesuch.\n\n"
    }
  ]
}
