{
  "id": "4622",
  "title": "Archive through May 04, 2004",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Discuss some of the features of typeface that may have been lost in the transitions from metal to photosetting to digital ypesetting. what is being done in current font technology to remedy this loss?\n\n",
  "author": "<a href=\"/web/20101227161725/http://typophile.com/user/3572\" title=\"View user profile.\">foot_spa</a>",
  "time": "<br>",
  "uid": "3572",
  "comments": [
    {
      "time": "",
      "content": "Some argue that digitizations have been created from the metal types themselves instead of from the page on which they have been printed, resulting in a more fragile form. Types such as Monotype Bembo, Spectrum, and Centaur are victims of this (so I've read).   \n   \nAlso, in letterpress no two letters looked exactly alike because of the ink impression. [Beowolf](http://web.archive.org/web/20101227161725/http:/www.letterror.com/foundry/beowolf/index.html) from LettError is a response to that. The font is \"programmed\" to produce variations of the same letter in a sequence.   \n   \nThese are just a couple of things off the top of my head. I'm sure others here can give some good insight.   \n   \n-Addison\n\n"
    },
    {
      "time": "",
      "content": "Tobias Frere-Jones has some interesting things to say on this subject. Some info (there's much more than this, just do a search on him):   \n   \n [http://www.typography.com/profile/index.html](http://web.archive.org/web/20101227161725/http:/www.typography.com/profile/index.html)\n\n"
    },
    {
      "time": "",
      "content": "_Some argue that digitizations have been created from the metal types themselves instead of from the page on which they have been printed, resulting in a more fragile form._   \n   \n [http://lanstontype.com/CaslonATF.html](http://web.archive.org/web/20101227161725/http:/lanstontype.com/CaslonATF.html)\n\n"
    },
    {
      "time": "",
      "content": "Since processers are so much faster and memory so much cheaper than 20 years ago, Postscript Level 4 will have an option to consider supplied font outlines as metal punches and model the transfer of ink from punch to paper. It will be able to produce randomly distinct variations for each instance of a character on a page (optionally, since this is slower) and will have parameters corresponding (at least) to pressure and viscosity, while_where is that horrible beeping noise coming from oh hell is it morning already?_\n\n"
    },
    {
      "time": "",
      "content": "Kevin,   \n   \n_. . . where is that horrible beeping noise coming from oh hell is it morning already?_  \n   \nTime to wake up.\n\n"
    },
    {
      "time": "",
      "content": "During the revival period I believe many metal faces were redrawn from printed specimens sheets, but many, if not most, of the faces that are associated with the metal type libraries of Linotype, Monotype, Ludlow, have actually been digitized from photofilm versions. Um, with the notable exception of Lanston. And brilliant that was Gerald G.   \n   \nI know of a few exceptions with Monotype Typography as well. The digital Dante and, most likely the Pastonchi, were redrawn from master patterns of the metal type.   \n   \nI believe that at one point Ludlow UK was quite intent on buying up old Ludlow film from a source in Canada for their digitizations.   \n   \nBut to get more to the original question. You would not actually want to preserve a metal face per se for digital as you would not have wanted to for photofilm. The printing technologies associated with these type technologies have/had different needs and require/d different approaches.   \n   \nReversing the situation, printing digital type letterpress, is a whole other animal. There, yes, the considerations of the how and why of the design of a metal type face are quite crucial, and not easily replicated with the available tools.   \n   \nGerald\n\n"
    },
    {
      "time": "",
      "content": "Knuth illustrated a curious tendacy of type technologies replicating earlier type technologies. For reasons of no merit the new technologies never returned to source. The film fonts were bolder than letterpress, the digital fonts, bolder than film fonts.   \n   \nThe digital rendition I believe was the work of Autologic. The typface was Janson.   \n   \nI later noticed that even letterpress typefounders blackened their imitations of other founders typefaces. The Caslon Foundry blackened their own letterpress Caslon Oldstyle in the refitting in 1924(?).   \n   \nModern typographers would make great balloon blowers at childrens birthday parties. Eventually I predict type will be so inflated paper will be black.   \n   \nThankfully Gerald Lange and myself have avoided this disease by keeping several ounces of black ink under our fingernails.   \n   \nMost people never wish to shake our blackened hands which allows us great freedom in opinion, such as, \"light is bright, bold is black\", \"Lead is not dead\" and that is why \"letterpress printers rock\".   \n   \nI hope I made my point?\n\n"
    },
    {
      "time": "",
      "content": "Probably the biggest loss that comes to mind is optical scaling. In metal, each size was inherently different anyway, but when automatic scaling was introduced (way before phototype - I'm talking about the Benton pantograph) the desire to save money overpowered quality. The good news is that some designers are slowly coming back to optical scaling.   \n   \nAnother thing that was lost is the softness of the border between black and white. I think this might actually be the main reason letterpress is more readable (when done really well). I have a hunch that offset is simply too crisp, and our perceptive system cannot become very comfortable with such stark borders. I can think of one way to address this issue: unfocus the laser in an imagesetter (but microscopically). As an aside, I don't think either the randomness or the relief effect of letterpress are really important/positive. Randomness is lack of information, and we don't read with our fingers (unless it's Braille).   \n   \nAnd a third thing is trapping. In the metal days: a size couldn't be used larger, so traps would never become obvious/distracting; and bleed was greater, so trapping was more necessary. In digital, traps are still necessary much of the time, but not enough to \"register\" in the mind of most designers. Interestingly, phototype was really hazy so they actually used a lot of traps - and they even used thorns: the sharp protrusions at corners to help them keep their sharpness. Virtually nobody does thorns in digital type.   \n   \n--   \n   \nBut we've also gained a lot. Most of all _potential_, even though it remains largely unrealized.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant   \n   \nI've always been amazed by the lack of optical sizing in digital fonts. Not so much by the failure of most foundries to provide it, but in the failure of typographers to incorporate it in their routine design, especially so since the tools for creating even a basic rendering of optical scale by ranking weights was available quite early on. Fontographer was the most long lived of these, followed now by FontLab.   \n   \nIn regard to letterpress, hey!!! The relief effect is much more cherished today than it was during most of the history of printing. Printers would do anything to get rid of it, calendaring the paper after printing, dampening the paper afterward, etc. But on randomness I will have to disagree. You are speaking of distortion caused during printing I assume.   \n   \nDon't know if you knew this though. It has long been thought that randomness was deliberately incorporated into many of the typefaces of the early printers, up until the beginning of the type foundry and the standardization of casting production. New evidence on the DK-Type, attributed to Gutenberg, suggests that it is possible that the single letterforms may have been composites of variant letterform pieces put together in punch form and cast that way to mimick the natural variance of handwritten letterforms.   \n   \nDoes this effect readability? Certainly the earliest printers must have thought it crucial to the potential readers (buyers) of their time to simulate as much as possible the handwritten word. I don't want to go Emigre on you but...   \n   \nGerald\n\n"
    },
    {
      "time": "",
      "content": "\"Knuth illustrated a curious tendacy of type technologies replicating earlier type technologies\"   \n   \nGerald, I suspect all new technologies must retro-shield, if only to hide in the familiarity of the market. The typewriter keyboard is the infamous example. A badly flawed, in the first place, century old device/concept used to interface with a highly advanced number counting machine, the computer (with a half-century old television screen face). If computers could be bored they must certainly be most of the time.   \n   \nGerald\n\n"
    },
    {
      "time": "",
      "content": "_\\>Virtually nobody does thorns in digital type._   \n   \nBecause thorns are no longer necessary. Why would you want to preserve a compensation for a problem that no longer exists?   \n   \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Mr. Giampa,   \n   \nThanks for linking to that article--I had looked for it to link in my post.   \n   \nI'm not sure where I stand on the inkspread issue, but I've found it interesting. Perhaps it's personal preference, but I can certainly tell a difference between digital Bembo and the metal Monotype version in a copy of Fine Print (or one of Mr. Tufte's books) and I prefer the metal. Many foundries are now creating optical sizes, or at least text and display, as opposed to one homogenized font--a great improvment.   \n   \nI have a printed copy of your Caslon specimen and a copy of the 1924 G.W. Jones Caslon specimen. I'll have to take a closer look and compare the digital to metal. (Your Caslon specimen is very lovely, by the way.)   \n   \nTell me this, Mr. Giampa. Frederic Goudy cut his own type, right? Did he anticipate the finer execution of printing that you expect? In other words, do you feel your digital versions of his types live up to his (Goudy's) expectations of his metal types? And please, this is no attack--I just want to know your opinion.   \n   \nThanks,   \nAddison\n\n"
    },
    {
      "time": "",
      "content": "\\>thorns ... a problem that no longer exists   \n   \nI put both thorns and traps in Worldwide, a newspaper text face. Despite huge technical advances in prepress and printing, newsprint is still a crude medium (coarse grey paper, grey ink), and the microdetails really do work to sharpen the end result.\n\n"
    },
    {
      "time": "",
      "content": "Hrant,   \n   \n_I'm talking about the Benton pantograph) the desire to save money overpowered quality._   \n   \nHow did they save money?\n\n"
    },
    {
      "time": "",
      "content": "\\> randomness was deliberately incorporated   \n   \nSure, but only to closely mimic handwriting (which we're hopefully beyond now), not to improve readability. You could say the readers of that time were used to reading handwriting, so that would in fact make it more readable, but:   \n1) This is no longer the case now.   \n2) I would argue that immersive reading ignores such conscious factors, and randomness (at least true randomness) can only decrease functionality.   \n   \nThorns: they're _less_ necessary now, but still not useless. (Nick, great \"news\"! :-)   \n   \n\\> How did they save money?   \n   \nBy making one (or at least fewer\\*) set of drawings, of course. The pantograph didn't _force_ you to reduce quality, but in the context of capitalism it certainly encouraged it! To be fair, the Benton boys actually tried to get people to keep minding optical scaling (and their own scaling -like in ATF Garamond- is stratospheric), but it's always very hard to convince other people to not save money... Just ask PBS.   \n   \n\\* Monotype typically made four, I think.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Interestingly, there is almost no need for size-specific masters in sans serif typefaces, which have become far more popular, relative to serif faces, in the digital era.   \n   \nWhich makes me wonder about the terminals in Optima -- were the concavities scaled for size in metal?\n\n"
    },
    {
      "time": "",
      "content": "\\> there is almost no need for size-specific masters in sans serif typefaces   \n   \nNo way dude.   \n   \n\\> were the concavities scaled for size in metal?   \n   \nThat would be interesting to check. I'm actually working on that issue with Pascal, a much more relevant face to study. But if Zapf didn't exagerate the concavity (and really every other feature that deviates from the \"orthonormal\"\\*) then that just means he _should_ have! One interesting think about Optima is that it seems the concavity was originally a technical compensation (for fighting gain), and not a bone fide design feature! It's only when some boss at a font house liked the effect at large sizes that it became a \"feature\". Ironic, considering it's the font's main attraction.   \n   \n\\* For example, overshoots (like in the \"o\") have to increase the smaller the point size (I mean relatively, of course).   \n   \n\\*\\* As per Lawson's \"Anatomy\" (I think).   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "No take on the Goudy types? Am I getting off track?   \n   \nDid metal types incorporate thorns and traps?\n\n"
    },
    {
      "time": "",
      "content": "Thorns very rarely, if at all. They were de rigueur in phototype.   \nTraps though are probably at least as old as the 16th century.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant,   \n   \n_By making one (or at least fewer\\*) set of drawings, of course._   \n   \n\". . . of course\"   \n   \nWhat do you mean _of coarse?_ I assume you are speaking of Benton Pantographs vs hand punchcutters.   \n   \nThat been the case _of course_ is not an appropriate reply?\n\n"
    },
    {
      "time": "",
      "content": "Addison,   \n   \n_No take on the Goudy types? Am I getting off track?_    \n   \nThe short answer is that Goudy would approve. However the issue needs more exansion which I have begun to address. I am looking for a link. Later I will post.\n\n"
    },
    {
      "time": "",
      "content": "\"Of course\" because the whole point of the pantograph (eventually if not originally) was to make multiple sizes from one drawing.   \n   \nAddison: FYI, Gerald and I have had some tussles about the validity and historical existence of trapping. My impression is that he resists the idea (more like the _fact_, actually) essentially because he's a huge fan of the pantograph, but the pantograph couldn't do trapping... He's the type of person who has trouble seeing that his mother's nose is too big, and insists on entering her in Mrs Senior Universe competitions.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"Frederic Goudy cut his own type, right? Did he anticipate the finer execution of printing...\"   \n   \nAddison   \n   \nGoudy did cut punches from certain of his designs and cast, but not for production. Most of his commercial designs were cut and cast by foundries. Nevertheless he was not often happy with the cuttings and reworkings.   \n   \nOn the other hand, despite what he occasionally wrote about \"quality,\" Goudy is notorious for not really caring about the quality of the setting of his typefaces, just how well the foundries were able to render his designs. If you look closely at the typesetting of some of the books he printed you will notice they are often set far too tight. Not a fellow who was concerned with readability as much as a deligent follower of the Morris ethos.   \n   \nSome other items of possible interest here:   \n   \nHe felt optical scaling of typefaces was not a crucial consideration and was not interested in the effort involved in the creation of multiple master drawings.   \n   \nHe welcomed photofilm typesetting with open arms (most typographers did actually) even if it was to result in a decline in quality.   \n   \n   \nSorry to damage the myth.   \n   \nGerald Lange\n\n"
    },
    {
      "time": "",
      "content": "Thanks, guys.   \n   \nI've only seen facsimiles of Goudy's types printed, so I'm not sure what the actual quality was--or, more to the point, what the metal types should have looked like when printed. I'm much more familiar with his types in digital form, mainly Mr. Giampa's versions I suppose, in magazines and books and such. There seems to be such an anticipation for digital types to live up to their metal predecessors.\n\n"
    },
    {
      "time": "",
      "content": "Addison   \n   \nAnother very good source for Goudy renditions, other than Lanston, is Richard Beatty Designs. He did a lot of Goudy in the early to mid 90s. Quite good settings, and several work quite well in the transition to letterpress printing. I like his Californian better than any other digital renditions of it (Berkeley, etc).   \n   \nHard to find his stuff these days. Phil's Fonts, and a few of the lessor traveled vendors carry some but never all of this work. He even did a very good remaking of von Krimpen's Cancelleresca Bastarda (with all the bells and whistles) that I quite like.   \n   \nGerald Lange\n\n"
    },
    {
      "time": "",
      "content": "Probably the single best treatment of Goudy's oeuvre   \nis in Walter Tracy's justly famed \"Letters of Credit\".   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Gerald   \n   \n_He welcomed photofilm typesetting with open arms (most typographers did actually) even if it was to result in a decline in quality._   \n   \nThis contradicts historical memos I have read in the Lanston files where Goudy reports dismal failings. He was not in favour of Lanston following English Monotype's lead towards photocomp. Although English Monotype was certainly better than most.   \n   \nAlso it should be noted that photocomp did not have ink trapping, they had light trapping. Anyone who has worked in dark rooms would know why. (Nothing to do with ink trapping.) ![:-(](http://web.archive.org/web/20101227161725im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nHe hoped the problems would resolve in the future. They did not.   \n   \nMost typographers are terrible. So that gets lost on me, I am \"almost\" as good as you ![:-)](http://web.archive.org/web/20101227161725im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nHowever Goudy may have conveyed a different public persona about photocomp. After all, you will often see in the \"Forum\" designers sucking up to \"potential customers\".   \n   \nNaturally I am always interested in what Goudy had to say, I collect material on the man.   \n   \nCan you be so kind as to direct me to his exact wording of this \"welcoming\". ![:-)](http://web.archive.org/web/20101227161725im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "",
      "content": "\\> photocomp did not have ink trapping, they had light trapping.   \n   \nSame difference. That's why I just use \"trapping\".   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Addison,   \n   \nGerald Lange says this   \n   \n_. . . I like his Californian better than any other digital renditions of it (Berkeley, etc)._   \n   \nI would wait for ours, it is about to be released. Ours is produced using Goudy's \"own lead master patterns\" in his studio.   \n   \nIf you don't like ours, you don't like Californian.\n\n"
    },
    {
      "time": "",
      "content": "Hrant,   \n   \n_Same difference. That's why I just use \"trapping\"._   \n   \nWell maybe you want to show Addison your idea of ink trapping? That is a real yawner. You know what I am talking about. Give us the link? Also I would like to review with you the point sizes of the same face?\n\n"
    },
    {
      "time": "",
      "content": "Trapping: Addison can simply do some searches in Typophile, if he's interested. I'm not about to discuss your mother's nose again.   \n   \nCalifornian: Assuming Goudy (or Lanston) did implement optical scaling (maybe an unsafe assumption), and assuming you haven't (safer?), wouldn't you have to admit that your upcoming release is only really Californian at one size? In which case one could still like the original but not this latest digital iteration.   \n   \n--   \n   \nBTW, Gerald, what happened to the stuff from Vancouver? Kingsley, the maritime floppy, etc.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Ok, so what\n\n"
    },
    {
      "time": "",
      "content": "It's too thin.   \nBut printed letterpress it's much better, because of the gain.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Addison,   \n   \nBefore I accept opinions about type from people, not that I ever do, but before I consider them, I look at their work.   \n   \nMaybe you could compare Goudy's work with Hrant's. If you like Hrant's better stick with his opinion. If you like Goudy's well you can stick with your own.   \n   \nI think it unfair to speak so poorly of the dead. Especially when their work still lives so strongly in the faces of America. Goudy is to American Type Design what Frank Lloyd Wright or the Greene brothers are to American Architecture, or Starling Burgess to American Yacht Design. Goudy is perhaps the greatest type designer that ever lived.   \n   \nBut maybe your prefer Hrant? This is for you to decide [http://www.themicrofoundry.com/](http://web.archive.org/web/20101227161725/http:/www.themicrofoundry.com/)   \n   \nGoudy is great.   \n [http://lanstontype.com/jim-rimmer-typographer.html](http://web.archive.org/web/20101227161725/http:/lanstontype.com/jim-rimmer-typographer.html)   \n   \nPusillamonous professional jealousy by others is self explanatory.   \n   \nHis critics are his inferiors.\n\n"
    },
    {
      "time": "",
      "content": "There you go, taking objective criticism of a dead guy -with no real relation to you- as a personal attack. Let's agree to disagree when it comes to stuff like this. I think Goudy was a hack. I'm not going to hate you for liking his work - it's a matter of taste. But do stick to the discussion please, and don't let questions go unanswered.   \n   \nWill your Californian have optical scaling?   \n   \nWhat happened to the Vancouver stuff?   \n   \nAs for your point about comparing work, that's just dumb. A good critic is not necessarily a good maker. Harry Carter for example made virtually no type, but he still wrote stellar reviews of type and typography. And Tracy didn't like Goudy, but he produced far superior fonts.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant,   \n   \n_Californian at one size?_   \n   \nI believe that all renditions of Californian do not offer optical sizes? Am I wrong?   \n   \nYou comments may be confusing to some. For instance it should be pointed out that not one per cent of one per cent of digital offering offer optical point sizes.   \n   \nDo you confer?   \n   \nHector   \n   \nHrant says . . .   \n   \n_But printed letterpress it's much better, because of the gain._  \n   \nI say . . .   \n\"Knuth illustrated a curious tendacy of type technologies replicating earlier type technologies. For reasons of no merit the new technologies never returned to source. The film fonts were bolder than letterpress, the digital fonts, bolder than film fonts.\"\n\n"
    },
    {
      "time": "",
      "content": "\"This contradicts historical memos I have read in the Lanston files where Goudy reports dismal failings.\"   \n   \n   \nHey, Gerald, what do you think, that I make this  up? Unlike some, I don't have a hidden agenda here. Nothing to gain for old Ger.   \n   \nYou can find Goudy's thoughts on photofilm in the D.J.R. Bruckner biography.   \n   \nGerald lange\n\n"
    },
    {
      "time": "",
      "content": "\"I can certainly tell a difference between digital Bembo and the metal Monotype version in a copy of Fine Print (or one of Mr. Tufte's books) and I prefer the metal.\"   \n   \nAddison   \n   \nYou should be able to tell a difference as the digital typeface that was optimized and printed letterpress in Fine Print was Minion MM, not Bembo. Interestingly, none of the readers of Fine Print saw the difference in the typefaces until the publisher informed them in the next issue.   \n   \nFYI: An interesting anomaly with the digitized Bembo and Centaur is that when they are converted and printed letterpress with photopolymer plates, they have a great deal more structural strength than they ever had as metal faces. We were always ordering lowercase e sorts for Bembo because they wore out so fast. Not so with the dissimilar substructural integrity of photopolymer.   \n   \nGerald Lange\n\n"
    },
    {
      "time": "",
      "content": "\\> I believe that all renditions of Californian do not offer optical sizes?   \n   \nHey, you're \"Mr Lanston\"! So you tell me (I honestly don't know): Did the original metal Californian have optical scaling or not? Obviously I wasn't talking about the digital/photo derivatives. You said \"If you don't like ours, you don't like Californian\", and I'm trying to see if this makes sense or not.   \n   \nIf your stuff doesn't have optical scaling and you don't want to admit it, well don't get angry at me. Blame the paucity of the retail font market - that would be understandable.   \n   \n--   \n   \nIt's common knowledge that many digitizations of metal faces are too thin. Bembo is such a case; digital Bembo printed \"normally\" (offset) is anorexic compared to metal Bembo printed \"normally\" (letterpress). I'm not sure what Knuth was talking about, but if you really do believe that people should be listened to in proportion to the quality of the fonts they've actually produced, then all you have to do is look at Computer Modern to totally ignore Knuth. (But as I've said, I don't believe that myself.)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_\\>I put both thorns and traps in Worldwide, a newspaper text face._    \n   \nAnd well done, too, Nick.   \n   \nMy implied point still stands; for the most part, thorns in phototype were a compensation for a photo problem. That problem no longer exists, so the general need for thorns in digital type also no longer exists. (Hrant seems to be implying, above, that today's digital designers are somehow lazier than their forebears for not including thorns in their designs. Perhaps this is not what he meant.)   \n   \nNevertheless, there are specialized circumstances where they may still be of some value.   \n   \n_\\>\\> How did they save money?   \n\\>By making one (or at least fewer\\*) set of drawings, of course._      \n   \nIt should be noted that the initial impetus for the creation of the pantographic punchcutter was not to circumvent the process of optical scaling, as one might surmise from Hrant's rant.   \n   \nThe primary reason for the development of the pantographic punchcutter was to allow a person who was not necessarily trained or skilled at punchcutting, to cut a punch by directly following a [much larger] drawing. The device reduced the artistic and mechanical skills that were previously required to interpret a designer's design and cut it very small on the end of a piece of metal. This opened the doors to increased productivity in converting paper designs into metal fonts.   \n   \nThe fact that one could cut different sizes from the same master was a corollary efficiency that some foundries leapt at, while others did not. Linotype, for instance, created separate drawings for every size. M. F. Benton sometimes made different drawings for different sizes of certain letters -- those that could not be optically adapted by adjusting different parameters of the pantograph (or so I understand from conversations with Mike Parker, who studied Benton's drawings at the Smithsonian).   \n   \nSo although the demise of optical sizes can be traced to the invention of the pantographic cutter, that was not the goal of its invention.   \n   \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Gerald Lange, is there a \"benefic darkening\" of Bembo and Centaur along with it\n\n"
    },
    {
      "time": "",
      "content": "H\n\n"
    },
    {
      "time": "",
      "content": "Oh yeah, I forgot to mention this. Rialto Pressa's got ink traps in place, as well as some other technical tricks.   \n   \nGerald\n\n"
    },
    {
      "time": "",
      "content": "I love Goudy's types, and I'm eagerly waiting for the Lanston version of Californian. (BTW, FB Californian has 3 optical sizes). I will admit, however, that his types may not be ideal for extended reading, but I love 'em.   \n   \nConcerning trapping, I understand the concept, but I wasn't aware that it was implemented in metal types.   \n   \nMr. Lange,   \nThe Fine Print I'm speaking of was either set in Spectrum or Bembo -- I'm pretty sure. The issues credit Mackenzie-Harris for the type.   \n   \nSorry to have started a fire, but I am enjoying the information.   \n   \n-Addison\n\n"
    },
    {
      "time": "",
      "content": "Addison   \n   \nThe FB Californian is probably quite good. Their typefaces are usually of high technical merit. California is a great text face, one of Goudy's best.   \n   \nTrapping was implemented im metal faces. I have seen them. The question is when did this start? I have never seen mention of trapping as a term until about the late twenties or early thirties, as I recall.   \n   \nRe: Fine Print. I misinformed you completely. I was thinking of the journal that followed Fine Print. Bookways. The early issues of this were set in the metal Monotype Bembo. The journal switched to Minion MM at some point.   \n   \nI have a complete set of Fine Print and as I recall they probably switched around a bit in their selection of a text face. But yes, Fine Print, except for perhaps the earliest of issues, was completely set and printed from metal forms.   \n   \nGerald   \n   \nGerald\n\n"
    },
    {
      "time": "",
      "content": "Among the things lost:   \n   \n1. Poorly fitted slug-cast italics, and non-kerning f.   \n   \n2. Uncomfortable letterspacing caused by the very limited ability to kern letters easily, especially noticable at large sizes.   \n   \n3. The inordinate expense of purchasing a full font of type, and consequent limitation to a very limited range of text faces, resulting in over-use of a few faces. (Every generation has its Times / Helvetica / Gill Sans [insert your favourite bugbear here].)   \n   \n4. The frequent absence of decent heavy or bold designs for most typefaces (resulting in weird mixtures of incompatible typefaces long into the twentieth century).   \n   \n5. The high expense of cutting fonts at different sizes with the result that many fonts were available only at a restricted range of sizes, sometimes a very restricted range.   \n   \n6. A rich array of printing errors -- type that drops out, damaged type, inverted type, type with blocks around it, filled counters, warn type, overimpression.   \n   \nRIP\n\n"
    },
    {
      "time": "",
      "content": "Paul   \n   \nIndeed, and much more. Which is why digital type rendered letterpress with the photopolymer process was some form of divine grace.   \n   \nBut even with all these things you mention, a significant attribute of letterpress, WAS the hands on aspect. In the right hands, these problems can be dealt with or sidestepped, and in the right hands, the work, and the beauty of the letterpress printed page, can not be matched by any successive process.   \n   \nIt ain't dead yet, in fact, with the current revival, one could say letterpress is in a state of remission.   \n   \nGerald\n\n"
    },
    {
      "time": "",
      "content": "\\>thorns in phototype were a compensation for a photo problem.   \n   \nYou're right, Kent, and in fact thorns are very tiny \"ticks\" of a specific size that will disappear during the photo-reproduction process of photo-typesetting, leaving a sharp corner that would have otherwise become slightly rounded.   \n   \nThe point I was making about Worldwide as a news text face was that a similar erosion of detail occurs in the printing process, especially on newsprint, and can be mitigated by type design features that are similar to phototype thorns.   \n   \nUltimately, there is \"visual bleed\" in the act of seeing, hence serifs.   \n   \nThorns on serif type: kinda fractal, and on the back burner is a face with serifs on serifs on serifs...   \n   \nFYI, here are some scans of a phototype character (one high-contrast, the other showing the white opaque used to make negative thorns/ink-traps), artwork for N from Shinn Sans, which I did for Typsettra c.1985. It was used to make both a Diatronic font, and for 2\" phototypositor filmstrip. As you can see there is a thorn on the ink-trap! When Steve Jackaman digitized the face in 1992, he removed all the thorns and ink traps.   \n ![ShinnN](http://web.archive.org/web/20101227161725im_/http:/www.typophile.com/forums/messages/30/35096.jpg)   \n ![ShinnNcu](http://web.archive.org/web/20101227161725im_/http:/www.typophile.com/forums/messages/30/35097.jpg)\n\n"
    },
    {
      "time": "",
      "content": "BTW, the cap height N was drawn at 3 1/2\".\n\n"
    },
    {
      "time": "",
      "content": "Mr. Nick Shinn,   \ndo I understand right that the fact the cap height   \nN was drawn at 3 1/2\" is a smart & good thing?   \nIs Mr. Steve Jackaman the one of Roostertypes.com?\n\n"
    },
    {
      "time": "",
      "content": "Gerald,   \n   \n_Hey, Gerald, what do you think, that I make this_\n\n"
    },
    {
      "time": "",
      "content": "\\>N was drawn at 3 1/2\" is a smart & good thing?   \n   \nIt was the right size for the technology, and worth mentioning as images online have no absolute size.   \n   \nIs Mr. Steve Jackaman the one of Roostertypes.com?   \n   \nOne and the same.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the illustration, Mr. Shinn. Traps I understood, but I couldn't quite imagine what a thorn was.\n\n"
    },
    {
      "time": "",
      "content": "Kent, I did try to sort of hint that the Benton boys were great. And I'm a big fan of \"intent\". But to me the main relevance of the pantograph is its cultural \"contribution\": the de facto reduction of optical fidelity. I think the pantograph was a success because of its scaling more than anything else. The font houses that _didn't_ use the pantograph's money-saving scaling went under [first].   \n   \n\\> Hrant seems to be implying, above, that today's digital   \n\\> designers are somehow lazier than their forebears   \n   \nWell, I don't know if that would be fair to say of the overall, but certainly contemporary designers seem to _push the available potential_ less.   \n   \n--   \n   \n\\> a digital face will increase roughly 5%   \n   \nOnly for a specific size (12?), because the gain is actually _absolute_ (and typically on the order of one mil = 1/1000 inch).   \n   \n--   \n   \n\\> FB Californian has 3 optical sizes   \n   \nHuh.   \nGG, what about yours?   \n   \nBTW, Addison, this is just a little campfire - don't worry.   \n   \n--   \n   \n\\> when did [trapping] start?   \n   \nWell, I can tell you about the earliest one I [think I've] seen: in an \"R\" by Guillaume Le Be II.   \nI saw it in a promotional booklet done by a Famous Type Designer, but when I asked him if he could provide me with the original scan/source of the image -because I was interested in the history of trapping- he refused on the grounds that I was seeing things. Unsurprisingly, this FTD doesn't put traps in his fonts, and is against the practice. Maybe he didn't want me to find out that his original model used traps but his \"revival\" didn't? Or maybe I _was_ seeing things. He could have just shown me the original so we could figure it all out. Anyway, I'll find out eventually.   \n   \n--   \n   \nPaul: Right on! But photopolymer letterpress is sweeeet.   \n   \n--   \n   \nNick: U da man.   \n   \n\\> serifs on serifs on serifs   \n   \nScriptorium did an April Fools joke like that once.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Something else:   \n [http://www.urel.berkeley.edu/identity/style\\_dg\\_type.html](http://web.archive.org/web/20101227161725/http:/www.urel.berkeley.edu/identity/style_dg_type.html)   \nAn \"official\" -and free- University Old Style... with optical scaling!   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Gerald   \n   \n_Trapping was implemented im metal faces. I have seen them. The question is when did this start? I have never seen mention of trapping as a term until about the late twenties or early thirties, as I recall._\n\n"
    },
    {
      "time": "",
      "content": "Hrant   \n   \nThe 5% I was talking about was not during the letterpress printing process, but a gain from neg to plate during the platemaking process. I read a technical report where it was suggested as 5%. This would be across the board and have nothing to do with the type size, but rather WHATEVER imaging was being transformed.   \n   \nWhich brings up a question that perhaps both Nick and you can help me with. Since the film negative is photoexposed on to the plate material, would not a properly configured letterpress face not only have a weight reduction in its main strokes, stems, etc, the inclusion of ink traps, but but but, thorns as well? Or did the photofilm process require thorns because of camera distortion, different kind of lighting exposure, etc.?   \n   \n   \nGerald\n\n"
    },
    {
      "time": "",
      "content": "Her nose is too big - get over it.   \n   \n--   \n   \nAre you going to answer the questions or not?   \n   \n1) Does/will your Californian have optical scaling?   \n   \n2) What happened to the Vancouver stuff?   \n   \n--   \n   \n\\> but a gain from neg to plate during the platemaking process.   \n   \nOh. But does a relative amount make sense even there?   \n   \nAs for your question: it's out of my league.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Gerald,   \n   \nLight trapping is the problem. For instance when burning rule & step proceedures in photocomp the butt ends had to be thinned in image or they would thicken in reality.\n\n"
    }
  ]
}
