{
  "id": "46227",
  "title": "Arial Unicode BOLD",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi There,\n\nCan anyone help me find somewhere to find a bold version of Arial Unicode? I am trying to produce a multi-language toolkit for a channel brand and i need arial unicode both in regular and bold but after i bought it online (thinking it was a family) it only had one weight....\n\nAny help gratefully received,\n\nJohn\n\n",
  "author": "johnboymoulton",
  "time": "9 Jun 2008 — 2:34am",
  "uid": "32232",
  "comments": [
    {
      "time": "9 Jun 2008 — 3:28am",
      "content": "For regular multi-language work -- French, German, Dutch, Norwegian, Swedish, Danish, and a couple of other Western European languages, you only need a handful of accented characters. These appear in the majority of \"serious\" fonts -- we're talking Windows Western mapping here, \"ä\", \"é\", \"ñ\", \"þ\" and the like. Let's not mention the Microsoft invention \"ÿ\" :-)\n\nPlain Arial (the one that comes for free with Windows, in Regular Italic, Bold, and Bold Italic) has an extended character set, supporting Central-European languages, with characters such as \"ł\", \"ŗ\", \"ō\" (Polish, Slowak, Lithuanian -- anything not Cyrillic), but _also_ Greek (kathaverousa, not polytonic), Cyrillic, Turkish, Hebrew, and a smattering of Arabic -- of this last one, I'm not sure if it supports everything completely, i.e., with all initial, medial, and final forms.\n\nIf _that_ is still not enough for your multilingual needs, Arial Unicode adds characters for Ancient Greek, Japanese, Korean, Georgian and a whole lot of others, but surely you are not looking that far, are you? Perhaps you should list the languages (scripts) that you're interested in.\n\n"
    },
    {
      "time": "9 Jun 2008 — 7:34am",
      "content": "Arial (in Windows) includes full support for Unicode 4.1 Latin, Greek, Cyrillic, Arabic and Hebrew. And it comes in reg, bold, italic, bold italic.\n\nArial Unicode is really a fall-back font. I don't think it should be considered for brand use. However if you really want to use it you might want to contact Ascender or Monotype to see if they can produce a bold style for you.\n\nCheers, Si\n\n"
    },
    {
      "time": "9 Jun 2008 — 8:08am",
      "content": "An additional thought -- awaiting John's (hopefully) long list of wanted scripts -- is that, if a certain script can _not_ be found in bog standard Arial, it's most likely one of the more pictoral ones as found in the Far East (Hangul, Mongolian, Devanagari, Thai) or new orthographies (Cree comes to mind, although I don't know why).\n\nIt's a tall order to find a single font family for all these different writing systems. He'd better settle for \"a sort of sans look, but if there isn't one, no worries.\"\n\nIs this brand to target all of Western, Mongolian, Chinese and minority Aboriginal dialects? It must be the hottest thing since the iPod, then! How about calling it \"匣磬 ( xiá qìng qǐng)\", \"little music box\"?\n\n"
    },
    {
      "time": "9 Jun 2008 — 8:41am",
      "content": "I can't speak for the other scripts, but the hangul (Korean alphabet) component of Arial Unicode should absolutely not be used in any work where it is assumed that it will be seen by people who read Korean. I've said this before, but it is an atrocity. If the need ever arises for a typeface for setting Korean, use any of the hangul-dedicated system fonts that are widely bundled (okay, maybe avoid Gulim, but Dotum, Apple Gothic, etc. are great) but never Arial Unicode.\n\nBesides, these days Arial Unicode hangul is cropping up everywhere on the web on awkwardly 'localized' websites and banner ads complete with bad machine translations into Korean. Not a pleasant experience from a design point of view for the Korean web surfer.\n\n"
    },
    {
      "time": "9 Jun 2008 — 9:25am",
      "content": "Arial Unicode is indeed a fall-back font. But you can use it along with normal Arial Bold and normal Arial italic if you want.\n\nWindows Vista has five font families with a very large number of characters, almost every character in Unicode 5.0 found in the Latin character set.\n\nBut for free fonts or low-cost fonts, look in [http://www.alanwood.net/unicode/fonts.html](http://web.archive.org/web/20141108102549/http:/www.alanwood.net/unicode/fonts.html \"http://www.alanwood.net/unicode/fonts.html\") . The subsection “Large fonts” contains a number of fonts with many, many characters, though a lot of these don’t contain bold and italic versions.\n\nA good choice is the DejaVu family available at [http://dejavu.sourceforge.net/wiki/index.php/Main\\_Page](http://web.archive.org/web/20141108102549/http:/dejavu.sourceforge.net/wiki/index.php/Main_Page \"http://dejavu.sourceforge.net/wiki/index.php/Main\\_Page\") . Note that the fonts with LCG in their names are versions with contain only the Latin, Cyrillic and Greek character sets so you probably won’t want these. The regular versions also contain Hebrew, Arabic, and other goodies. The standard sans-serif also contains a lot of math symbols and pictures and so forth that normally would not be required in bold or italic versions. This font family is upgraded regularly.\n\nAs to Thomas de Jong’s quip: ‘Let’s not mention the Microsoft invention “ÿ”’ — this character is part of the ISO Latin 1 alphabet, and its inclusion in that character set has nothing whatosever to do with Microsoft. The character “ÿ” appears (though rarely) in French names, including some place names: Pierre Louÿs, Le Blanc de Nicolaÿ, rue des Cloÿs, L’Haÿ les Roses, Aÿ, Moÿ and so was sensibly and rightly included in the set.\n\nIt does not have an uppercase counterpart in the Latin 1 alphabet, because, at the time the Latin 1 alphabet was being created, it was generally thought to incorrect in French to normally place diacritics on capital letters. Since the committee involved was very pressed for space in creating this character set, it made perfect sense to omit “Ÿ”, as a character that could not exist in the scripts the Latin 1 set covered (ignoring Quebec French where omitting diacritics from capital letters was considered incorrect).\n\nOf course, nowadays it is usually considered incorrect to omit diacritics on capitals in French. And the Microsoft variant of the Latin 1 aphabet adds the missing “Ÿ”.\n\n"
    },
    {
      "time": "9 Jun 2008 — 1:13pm",
      "content": "<cite>[..] its inclusion in that character set has nothing whatosever to do with Microsoft [..]</cite>\n\n... There goes another one of my little MS bungle-up anecdotes! Oh well, it was hear-say after all.\n\nAll jokes asides, it still appears to me the OP (John) has overrated the importance of Arial Unicode, versus just about any serious font. I know _I_ wouldn't use it for anything but a last resort to finally insert that obscure mathematical character I was looking for, or as a handy repository for all kinds of dingbats.\n\nMy line of work is heavily geared towards multilingual typesetting, and, while the main bulk of text is in English or French, I've encountered snippets in more languages than I care to remember. My bread-and-butter font for just about all of them is Minion Pro, with a tasty side dish of hugely specialized characters for phonetics and accents, which my colleagues and me created in the semblance of that same Minion. For CJK I use the set of fonts that came with CS3, which are all drawn lovingly and carefully.\n\nThe only ones I really miss in my _répertoire_ are the RTL languages -- specifically Hebrew and Arabic, since standard IDCS _still_ does not support them natively, and I don't trust Word to do my shopping list with, let alone my typesetting.\n\n"
    },
    {
      "time": "11 Jun 2008 — 9:27am",
      "content": "Thank you all kindly!!\n\n"
    }
  ]
}
