{
  "id": "46243",
  "title": "Serif Pairing with Unit Black",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi everybody, I just wanted to tap in to Typophile’s incredible ability to suggest things that I would never think of on my own.\n\nAbout three years ago, I initiated a complete rebranding of my very small company. Along with updated colors and logos, I selected a sans and a serif typeface to use consistently in all our material. I ended up picking FF Unit as the sans and Dolly as the serif. Both of them are excellent faces.\n\nOver time, I’ve grown more comfortable with Unit and less so with Dolly. Dolly’s tone is a little too casual, and its overall color a little bit dark.\n\nI’m looking for something contemporary that is a little monolinear, and has some character without being too mannered, esp. at display sizes. Most of all, it needs to play well with Unit.\n\nCurrently, I’m leaning towards Chapparal. I also really liked Chronicle Text from Hoefler. Any other suggestions would be wonderful. Here is a little sample of Chapparal, too low-res to be that helpful, but it should give you a feel of the color:\n\n ![](http://web.archive.org/web/20081015211131im_/http:/www.typophile.com/files/chaparral_4290.gif)\n\n [‹ Help? Any suggestions for a sans serif to go with Zapf Elliptical/Melior?](http://web.archive.org/web/20081015211131/http:/www.typophile.com/node/46144 \"Go to previous forum topic\") [Chunky, Round fonts ›](http://web.archive.org/web/20081015211131/http:/www.typophile.com/node/46236 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015211131/http://www.typophile.com/user/16384\" title=\"View user profile.\">Daniel Mason</a>",
  "time": "<br>",
  "uid": "16384",
  "comments": [
    {
      "time": " 9.Jun.2008 4.00pm",
      "content": "Meta Serif?\n\n"
    },
    {
      "time": " 9.Jun.2008 4.11pm",
      "content": "That would definitely be the obvious choice, and would most likely work. I would go slightly for more of human/handwritten feel running through the serif... say Galliard could be nice (so a real contrast to Unit, but an underlaying concept they both have in common). You could go with a storm typeface, either something more conservative (baskerville) or more out there (serapion)\n\nH\n\n"
    },
    {
      "time": " 9.Jun.2008 5.25pm",
      "content": "or fresco?\n\n"
    }
  ]
}
