{
  "id": "4624",
  "title": "A substitute for FF Kievit?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I did a job last year, making new text-templates for a Norwegian publisher. I ended up using Minion and FF Kievit. It worked out just perfect, but now, one year later we're revising the templates cause we're having problems with Kievit.   \n   \nI had FF cut a special version with normal figures in Kievit Regular, and OSF in Kievit Caps. Mainly for practical usage. But ever since we started using the new templates, we've had postscript errors because of the typeface from here to eternity. ![:-(](http://web.archive.org/web/20150218044815im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nNow I have to find a substitute. Any suggestions. What I'm looking for is a legible OpenType font (Kievit is not OT), with true Caps and Italic. It has to be friends with Minion, and have atleast weights in regular, medium and bold.   \n   \nRune D\n\n",
  "author": "modest",
  "time": "6 May 2004 — 4:40am",
  "uid": "3683",
  "comments": [
    {
      "time": "6 May 2004 — 5:22am",
      "content": "I suppose Myriad is too obvious?\n\n"
    },
    {
      "time": "6 May 2004 — 5:41am",
      "content": "Have you contacted FF about the special verison they made and asked if it could be it that causes the problems?\n\n"
    },
    {
      "time": "6 May 2004 — 7:06am",
      "content": "Well, Myriad is too obvious! Only too bad it doesn't come with caps, and telling people how to work with a MM is just to hopeless.   \n   \nPeter: Have you contacted FF about the special verison they made and asked if it could be it that causes the problems?   \n   \nI had a lot back and forth with FF (FontShop is run by a company called Luth in Norway). They really didn't seem to know what was causing the problem. I suspect there's something fishy abot the version they sent back to us, and that's what makes this situation kinda hopless. Now I'm just looking for another way out. I'm hoping that a good OT will cure my problems, yet there's no guarantee! ![:-(](http://web.archive.org/web/20150218044815im_/http:/www.typophile.com/forums/clipart/sad.gif) Any other suggestions?\n\n"
    },
    {
      "time": "6 May 2004 — 7:21am",
      "content": "[Cronos](http://web.archive.org/web/20150218044815/http:/www.adobe.com/type/browser/P/P_1734.jhtml) is a nice humanist sans also by Slimbach that should mate well with Minion. It's also OpenType with small caps and a soft italic. I've always admired it, but I haven't seen it used much.\n\n"
    },
    {
      "time": "6 May 2004 — 9:27am",
      "content": "If you're considering Cronos, use TodaySans instead.   \n   \nhhp\n\n"
    },
    {
      "time": "6 May 2004 — 9:36am",
      "content": "Try Avenir Next in OpenType version just out this month (PS and TT also avaialble on request I think). Many weights (better than previous ones), SC, OsF condensed versions, etc.   \n   \nCheck [www.linotype.com](http://web.archive.org/web/20150218044815/http:/www.linotype.com/) website. Akira K. have done a pretty nice job.   \n   \nThis new Avenir is better choice that a boring tamdem such Minion Myriad. And Cronos is over designed to be a good Sans.\n\n"
    },
    {
      "time": "6 May 2004 — 10:24am",
      "content": "\"And Cronos is over designed to be a good Sans.\"   \n   \nHow do you mean over designed? Just curious.   \n   \n-Addison\n\n"
    },
    {
      "time": "6 May 2004 — 11:20am",
      "content": "\\>postscript errors   \n   \nThe fault may not be with the new font, per se.   \n   \nHaving done custom fonts, I am familiar with this problem: the client accumulates a lot of prototype fonts, with similar yet conflicting names and ID#s, that can screw up the System.   \n   \nIf you haven't done so, it's imperative to cleanse all your computers of every font version but the most recent.\n\n"
    },
    {
      "time": "6 May 2004 — 12:42pm",
      "content": "\"over designed\" I mean too much effect or too much flavour, too writing effect on it for a Sans as you can except usually in a Sans. Goudy Sans is a bit like that too. Obviously, I only refer to that specific case, for which Rune D\n\n"
    },
    {
      "time": "6 May 2004 — 2:33pm",
      "content": "I have never had any rip problems with FF Kievit. I find it to be an outstanding sans as well. It would be of value to pursue the problems withh FF who always seem to be helpful.\n\n"
    },
    {
      "time": "7 May 2004 — 12:18am",
      "content": "Thanks for all the replies.   \n   \nI had a look at Avenir Next, and most likely I'll recomend it for my client, even though I find it a little to geometrical for my taste. Personally I have no problems with Kievit. It's a great font, and I think Mike Abbink has done a wonderful job. I have never experienced the postscript errors myself (even though it might have seemed that way), but it seems to be a common problem among the others working for this publisher. This publisher produces in between 60 - 100 books a year.   \n   \nAs I mentioned I haven't experienced these problems myself. I work in InDesign 2/3, but I know that several others use Fram Maker for practical reasons. I've had plenty of discussions on why they still use FM. I would also like to mention that in saying 'the others', I'm talking about people who don't have any typographic education ... they just make books. What's a correct English term for this? They might be clever at using the programs, fast and cheap, but sadly no passion. But I guess that's a common problem. (Do I sound irritated?)   \n   \nAnyway ... I will also have a talk with FF in Germany to see if they know what's wrong, because the best would be to keep using Kievit.\n\n"
    },
    {
      "time": "7 May 2004 — 12:48am",
      "content": "\"I'm talking about people who don't have any typographic education ... they just make books.\"   \n   \nSound so strange! Does this kind of people still exist? Making books without any knowledge of what is typography? Perhaps they just do image books? ;-)\n\n"
    },
    {
      "time": "7 May 2004 — 4:44am",
      "content": "Perhaps these are options:   \n   \nSun - LucasFonts   \nCorpid - LucasFonts\n\n"
    },
    {
      "time": "7 May 2004 — 6:22am",
      "content": "i am a bit irritated about the FM bashing. of course it depends on the type of the books, but for more technical topics without the need for an extraordinairy design FM is IMHO the more appropriate tool to go than indesign.   \n   \nBut maybe version 3 has improved features for the handling of long texts, table of contents, indices, footnotes, diagram/equation numeration and things like that needed in book production -- i only tried out version 2 and missed some features (or didn't find them...)   \n   \nmarkus\n\n"
    },
    {
      "time": "7 May 2004 — 6:25am",
      "content": "just make books - I'm exaggerating. Cheap labor for greedy publishers! ![:-)](http://web.archive.org/web/20150218044815im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "7 May 2004 — 6:40am",
      "content": "I've only been using ID 3 for a couple of months, but it seems as though some of the more practical funktions that FM has, still are missing. I.e. generating several indexes in one document ... but I'm note sure of this. Another thing is that I don't know if ID3 has eased working with footnotes and sideheads. I suspect that FM is still a bit more practical for longer documents. I'm starting a 500 page book in ID next week, with sideheads. So I'll be back then to post reports.   \n   \nBut ... I've heard that Adobe will not be producing FM for Mac anymore, so I hope they will improve InDesigns practical functions (if needed, it might be me not finding these functions).\n\n"
    },
    {
      "time": "7 May 2004 — 6:48am",
      "content": "i also hope that adobe improves these features. indesign's typographical capabilities are of course far superior compared to FM's.   \n   \non the other hand, if indesign will be as good as FM for producing long documents, adobe has to ask, for what purpose FM is \\_the\\_ tool...\n\n"
    },
    {
      "time": "7 May 2004 — 10:32am",
      "content": "InDesign CS (3) has added some long-document features compared to InDesign 2, notably indexing and table of contents. I can't compare these function to FrameMaker since I never got that deep into FM, but I am not surprised if these functions are not yet as mature as FM's.   \n   \nInDesign does not yet support footnotes, and I don't think it does auto-numbering of equations and such. The new PageMaker plug-in does add numbered and bulleted lists, however.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "7 May 2004 — 10:35am",
      "content": "I should add that the problem with FrameMaker, at least from a Typophile perspective, is that its typography is quite primitive by comparison to InDesign. More at the QuarkXPress level, I'd say.   \n   \nBut it does have pretty awesome long document features.   \n   \nT\n\n"
    },
    {
      "time": "10 May 2004 — 12:24am",
      "content": "Thanks for the tips. I'll see what else I can find out when I start working. Interesting to see if I can get the sideheads to work out, but I can imagine that a practical function for sideheads would be alot like the footnotes. And since ID still doesn't support footnotes ...\n\n"
    },
    {
      "time": "10 May 2004 — 12:51am",
      "content": "Regarding the FF Kievit issue I've decided not to get involved. The publisher started this process without me, and I guess there's a reason.   \n   \nBut thanks for your help.\n\n"
    },
    {
      "time": "11 May 2004 — 8:08pm",
      "content": "Regarding the people who have no typographic education and do books, here's a whole country of 'em. My most recent/shocking finding was a novel set in sans (Frutiger, I suppose). The entire book! It was impossible to read. Such people should be punished.\n\n"
    },
    {
      "time": "11 May 2004 — 11:33pm",
      "content": "Three years ago Dantes 'The Divine Comedy' was   \npublished in Norwegian. The entire book was set   \nin ... guess what ... Helvetica.   \n   \nThat qualifies as the 8th Deadly Sin!\n\n"
    },
    {
      "time": "12 May 2004 — 12:38am",
      "content": "\"Sanserif complain desk is now open\" ;-)\n\n"
    },
    {
      "time": "12 May 2004 — 1:08am",
      "content": "tphinney wrote:   \nbegin\\_quote   \nInDesign CS (3) has added some long-document features compared to InDesign 2, notably indexing and table of contents. I can't compare these function to FrameMaker since I never got that deep into FM, but I am not surprised if these functions are not yet as mature as FM's.   \n   \nInDesign does not yet support footnotes, and I don't think it does auto-numbering of equations and such. The new PageMaker plug-in does add numbered and bulleted lists, however.   \nend\\_quote   \n   \nHow can someone use such a dumb software, paying so much for it, when there are other programs, free even since 1993? I was thinkin about TeX family (LaTeX, conTeXt etc).   \n   \nOK, i was a little harshy: i use InDesign for, let's say, poster work\n\n"
    },
    {
      "time": "12 May 2004 — 1:39pm",
      "content": "Yes, thereis some research suporting the use of serif type over sans serif for long texts but this is not a clear choice based on data of an entire set of typographic specs and there isn't that much difference in readability anyway. You find variances in the data based on where the testing was done and the backgrounds of the the people sampled. There are even cultural differences hinting at the possibility that you can read better that which you are more used to reading (people from countries where sans serif is prevalent read it better than people from countries where it is not).   \nI personally prefer sans serif for text so long as it is in a good typeface and set with good typography. I find Bodoni to be an incredible beautiful typeface which I use often when it can be set large enough but find it too difficult to read at smaller \"book sizes\".   \nOnce upon a time, books were set in blackletter (which is very hard to read for people today). There probably was some outcry when people first started using Roman type to set books.   \n   \nWhy do we need such absolute rules today when anything is possible? There always fas been good and bad in the design of everything. Time has a way of sorting it out but not always in the way we might predict. The paintings of the French Academy were the rage of their day and those of the Fauves were looked upon with disdain. Today the tables are turned. Let typgraphers use whatever types they deem best, serif, sans or mix. When done well, I welcome them all.   \n   \nThe world is a big place and technology has made it possible for us to do things quickly which were never possible before. We don't need to stymie typographers with iron-clad rules from previous generations. We should have open minds and let the talents of typgraphers now and in the future come to bear. Some will succeed and some will fail but none will succeed if we don't let them try.   \n   \nChris L\n\n"
    },
    {
      "time": "12 May 2004 — 2:00pm",
      "content": "Not absolute rules, but guidelines are helpful. One of them in fact is: all things being equal, serifs help readability. There is both empirical and anecdotal evidence to support this, and virtually none for sans fonts. Besides evidence, it also happens to make great sense once you get a grasp of how people actually read.   \n   \n [http://www.themicrofoundry.com/ss\\_read1.html](http://web.archive.org/web/20150218044815/http:/www.themicrofoundry.com/ss_read1.html)   \n   \nFurthermore, a text font is not like a painting: it's much more about our subconscious reading \"firmware\" and a lot less about fashion.   \n   \nAs for Familiarity, it is indeed important, but it's still only half the story (at most).   \n   \nhhp\n\n"
    },
    {
      "time": "14 May 2004 — 9:32am",
      "content": "FF Kievit issue in answer to Rune di.   \n   \nPlease do not confuse FF, which is the FontFont foundry in Berlin, with their distributors, the FontShops and others.   \n   \nIt is entirely the responsibility of the company that customizes the fonts, to make them work in your environment.   \nBut I'll be happy to take a look at the problems you experience with the fonts, just because we like to make things work around here.   \n   \nYou can contact me by email under [volker@fontshop.com](mailto:volker@fontshop.com)   \n   \nVolker   \nFontShop San Francisco\n\n"
    },
    {
      "time": "6 May 2004 — 8:21am",
      "content": "The FontFont headquarters are actually in Berlin. I would [contact](http://web.archive.org/web/20150218044815/http:/www.fontfont.com/contact.html)   \nthem for more assistance. They are very knowledgeable.\n\n"
    }
  ]
}
