{
  "id": "46257",
  "title": "Gótica para taller de tipografía virtual",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "Hola!\n\nMi nombre es Sebastián Salazar, tengo 19 años y estudió Diseño Gráfico en la ORT de Montevideo, Uruguay.\n\nEstoy creando una tipografía gótica bastarda para un taller de tipografía virtual dirigido por Cesar Puertas y coordinado por Vicente Lamónaca.\n\nNo tengo demasiada experiencia en la creación de fuentes así que deseaba recibir opiniones de gente más experiente que yo en el tema. Muchas gracias por su tiempo....\n\n\\*  \nHi!\n\nMy name is Sebastián Salazar, i´m 19 years old and i´m studing Graphic Design in the ORT University in Montevideo, Uruguay.\n\nI´m creating a gothic tiphography for a workshop of virtual tiphography directed by Cesar Puertas and coordinated by Vicente Lamónaca.\n\n| Attachment | Size |\n| --- | --- |\n| [Letras a, o, h H.pdf](http://web.archive.org/web/20150317234407/http:/typophile.com/files/Letras%20a,%20o,%20h%20H_0.pdf) | 192.18 KB |\n| [maldita bastarda! \\_ hamburgefontsiv.pdf](http://web.archive.org/web/20150317234407/http:/typophile.com/files/maldita%20bastarda!%20_%20hamburgefontsiv.pdf) | 185.43 KB |\n\n",
  "author": "sebotas",
  "time": "9 Jun 2008 — 6:45pm",
  "uid": "31774",
  "comments": [
    {
      "time": "10 Jun 2008 — 12:29am",
      "content": "You are here for type critique, so I'll bring some on:\n\nthe a's right stroke should not end in an abrupt upwards \"serif\", but in one more similar to the h's left stroke. Also, the a seems to go way to much below the baseline, much more than it would be expected for the sake of optical reasons of the curves.  \nThe capital H has several problems: the embellishments on the left have their contrast reversed, they do not really work, and generally, both the top swash, but even more so the left stroke of the H is not fractured (broken) enough for a \"gothic\", blackletter.\n\nActually the top abrupt serif on the h look also somewhat awkward, but I could accept that (as opposed to the a's bottom one).\n\nGenerally, I would advise you to have a look at a LOT of historical examples of blackletter, from a) different times and b) different regions of Europe. Only then will you get a real feeling of how blackletter works, and how it does not. There was a great variation in styles, so this does not so much bind you (as you might fear), but will even contribute inspiration, see (for you) new solutions. It's also good to look at the extremes, those styles which are not yet, or barely considered blackletter, but of which it evolved, and those which are already not, or barely considered still blackletter, but which stem from it (there, e.g. you can see how much and how you can combine rounded curves and flowing lines with broken elements: gothic cursive, bastarda, even the German script of the 16-18th century written towards the end with a pointy steel pen gives you a feel for hybrid ducti). The best would be to fly over here and have a look at manuscripts in archives, libraries, monasteries ;-) , but I guess that's out of option. Maybe you can find facsimiles, reproductions or albums dedicated to old manuscripts with good quality photos at the major Uruguayian libraries, even if you were not situated in the capital, use the inter-library-loan service.\n\nSzabolcs\n\n"
    },
    {
      "time": "14 Jun 2008 — 2:28pm",
      "content": "Thanks very much aszszelp for your quick answer. I´ll correct the main errors founded in this letters and create new ones to post here.\n\nMuchas gracias aszszelp por tu respuesta casi inmediata. Voy a corregir los principales errores de estas letras y crear nuevos caracteres para postear nuevamente.\n\nBotas!\n\n"
    },
    {
      "time": "24 Jun 2008 — 1:18pm",
      "content": "Botas!\n\n"
    },
    {
      "time": "24 Jun 2008 — 1:31pm",
      "content": "Hi! I recently atach a new file with the New version of this font. I already pick a name for it.... \"Maldita bastarda!\"....\n\nThe idea is to combine aspects from gothic letters and roman ones....\n\nThanks for your attention....\n\nBotas!\n\nHola! Hace poco subí otro archivo con la última versión de esta fuente. Ya elegí un nombre para la misma: \"Maldita batarda!\"\n\nLa idea es la de combinar distintos aspectos de las letras góticas (y específicamente las bastardas) con letras de carácter romano....\n\nGracias por su atención y agradezco sus comentarios...\n\nBotas!\n\n"
    }
  ]
}
