{
  "id": "46262",
  "title": "Curriculum Vitae",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I'll be going on the academic job market (in Philosophy) in the fall, and I'm in the process of putting together my CV. I was hoping that the experts here could take a few minutes to critique my design.\n\n(I'm just an amateur, so please be gentle!)\n\n",
  "author": "msilverz",
  "time": "9 Jun 2008 — 8:53pm",
  "uid": "3772",
  "comments": [
    {
      "time": "9 Jun 2008 — 8:59pm",
      "content": "Just a bit more information. I'm trying to design something different from the usual, boring outline-layout CV. Hence my two-column layout. (Of course I'm only aiming for something slightly different: philosophers are hardly a wild and wacky bunch). I've added a more standard-looking CV (that I typeset for a friend of mine) above for comparison.\n\n"
    },
    {
      "time": "10 Jun 2008 — 1:43am",
      "content": "I think you did a very nice typesetting job. But isn't that document way to long by all CV standards around?\n\nSzabolcs\n\n"
    },
    {
      "time": "10 Jun 2008 — 4:30am",
      "content": "Thanks!\n\nRegarding the length, academic CVs (at least in the Humanities) are generally several pages long, since they usually list all of one's publications and presentations. (This is one way in which they differ from résumés.) Here, for instance, is [the 11-page CV](http://web.archive.org/web/20140725205050/http:/www-personal.umich.edu/%7Esdarwall/Vitae.pdf) of one of the members of my dissertation committee.\n\n"
    },
    {
      "time": "10 Jun 2008 — 4:09pm",
      "content": "Looks sharp. I've set my fair share of CVs for academics. Yours has a very bookish feel without seeming overly stylized. You've done very well.\n\nI might place less emphasis on the words \"Curriculum Vitae\" on page one, but that's really a minor matter.\n\nGood job.\n\n"
    },
    {
      "time": "10 Jun 2008 — 9:02pm",
      "content": "Bookish but not overly stylized? That's pretty much perfect. Thanks for the kind words!\n\n"
    },
    {
      "time": "23 Jul 2008 — 12:31pm",
      "content": "does anyone else feel bothered by the combination of healthy letter spacing and the 'ae' ligature in the subtitle?  \nboth are great, but together they look a little odd\n\n"
    },
    {
      "time": "30 Jul 2008 — 7:47am",
      "content": "It doesn't look odd to me, but--as I said--I'm just an amateur!\n\n"
    },
    {
      "time": "31 Jul 2008 — 4:16pm",
      "content": "Good job, but... As dropkick wrote, it looks like a book, a novel which tells a story continuously. Your CV needs to present the hierarchy better. You need more contrast. The reader must see the headlines and different parts fast. Try to use bold weight as well. Use your better two column layout blended with better hierarchy of your friend's Cv.\n\n"
    },
    {
      "time": "31 Jul 2008 — 7:16pm",
      "content": "Given that it's for being on the academic market, I think it's fine -- and that the Æ adds a lot, it doesn't distract me at all (but then again, I use it too).\n\naszszelp, remember this is a CV, not a résumé, by definition it's supposed to include everything. Plus, I'm assuming he's going for a tenure-track position so they're going to want to know everything before they invite him for an interview.\n\nThe only thing that bothers me is that since a lot of times degrees are placed in small caps, I initially thought you had your universities out of order, since your bachelors was done in Massachusets, and I saw in order: DPhil, BPhil, MA. I saw Bachelor of Arts right under it but still, just thought I'd point that out. The only real solution of course would be writing out the names which if you're going for the US market would be akward, but if it's int'l I'd go ahead and write it out fully.\n\nGiven that most CVs are done in Word and full of typographic horrors thanks to autocorrect (even though you'd think folks applying for teaching positions would know better), this one will stand out for sure. (this is probably all preaching to the choir but just in case not)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "2 Aug 2008 — 12:44pm",
      "content": "Thanks for the comments, Matthew. When you say I should write out the names, I assume you mean the geographical abbreviations (e.g., MA and UK). Is that correct? There is plenty of room for \"Michigan\" and \"Massachusetts,\" but \"United Kingdom\" would cause the Oxford entry to spill over onto the next line. I suppose I could use \"England\" instead.\n\nMost of the jobs I'll be applying for are in North American.\n\n"
    },
    {
      "time": "10 Jan 2009 — 4:55am",
      "content": "Attachments deleted due to changes on CV.\n\n"
    }
  ]
}
