{
  "id": "46269",
  "title": "I am going to AtypI in St. Petersburg, Russia. Any advice?",
  "forum": "ebensorkin's blog",
  "tags": [

  ],
  "content": "I am going to AtypI in St. Petersburg, Russia to give my talk on Contextual Alternatives in roman text face design. I am very happy about this! :-)\n\nIn the meantime as I prepare, I wonder: do you have any advice for me about St. Petersburg? AtypI? Cusine? Pre-AtypI tourisim? Anything else?\n\nFeel free to reply here or to contact me privately.\n\nThanks!\n\n",
  "author": "ebensorkin",
  "time": "10 Jun 2008 — 1:05am",
  "uid": "2942",
  "comments": [
    {
      "time": "10 Jun 2008 — 3:57am",
      "content": "try to see the Spas na Krovi, my favorite cathedral in St. Petersburg.\n\n"
    },
    {
      "time": "10 Jun 2008 — 5:20am",
      "content": "herring, caviar, salmon, vodka... lol\n\n"
    },
    {
      "time": "10 Jun 2008 — 7:10am",
      "content": "Hm, is there any way of putting a \"bookmark\" on a thread so that it'll appear on your personal tracking page without posting?\n\nSzabolcs\n\n"
    },
    {
      "time": "10 Jun 2008 — 10:39am",
      "content": "Now that you've commented in the thread it will appear in your \"My Recent Posts\".\n\n"
    },
    {
      "time": "10 Jun 2008 — 11:25am",
      "content": "What Tiff said. But also, not that I know of. I have seen people make a post that just says \"bump\". But i don't know if tracking was key to that or if they just wanted to re-draw attention to the thread. In terms of a silent method - I don't think there is one. Maybe there can be in the future. Thanks Paul! Paul, can I assume you will be there too?\n\nMy current thinking is to add two or three extra days to the trip at the beginning to see the Hermitage and perhaps Spas na Krovi etc. Is anybody else thinking of doing this? Maybe I can get into the slipstream of Maxim's entourage...\n\n"
    },
    {
      "time": "10 Jun 2008 — 11:49am",
      "content": "i'm hoping to make to St. Petersburg, it's been almost 10 years since i was there last... The Hermitage is a very good choice. There are lots of amazing things to do in St. Petersburg. You can always IM me and I'll try to make recommendations for what you're interested in.\n\n"
    },
    {
      "time": "10 Jun 2008 — 12:19pm",
      "content": "\"...people make a post that just says “bump”.\"\n\nThat is usually to move a thread up on the recent posts list and give it some attention. I got in the habit of posting the word \"Tracking\" to tag a thread. This usually prompts David Berlow to make a humorous comment regarding typographic tracking so I kept doing it--hoping David would keep posting funny comments and he did! :-)\n\nChrisL\n\n"
    },
    {
      "time": "10 Jun 2008 — 5:35pm",
      "content": "What if the word \"Berlow\" is the new bump... I love to get dberlow going. In fact I would pay extra to DirecTV for a DBerlow channel.\n\nRegarding St. Petersburg, I'm trying to make a convincing case to go this year. It's a city I've always wanted to visit.\n\n"
    },
    {
      "time": "11 Jun 2008 — 12:21am",
      "content": "Tiff, I know, that's why I posted this question. (I actually wanted to track this thread).\n\nI just wasn't sure if it' alright according to Typophile etiquette to make a post containing of a single period or a single word just for tracking issues... I guess, I'll feel free to do so in future.\n\nSzabolcs\n\n"
    },
    {
      "time": "11 Jun 2008 — 12:35am",
      "content": "Here's hoping you make it Joe!\n\n"
    },
    {
      "time": "11 Jun 2008 — 5:43am",
      "content": "\"I would pay extra to DirecTV for a DBerlow channel.\"\n\nLOL! :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Jun 2008 — 6:09am",
      "content": "well i don't have DirectTV, but would gladly subscribe to the full season on iTunes (to watch on my iPhone).\n\n"
    },
    {
      "time": "13 Jun 2008 — 12:46pm",
      "content": "I have been checking around and it turns out that you can get ( barring a substantial currency exchange shift ) a room for AtypI for as little as $150 without going the full on hostel route. Now, can they get you the right paperwork for a visa?... that's a different question. I hope AtypI comes out with partner hotel info soon.\n\n"
    },
    {
      "time": "14 Jun 2008 — 5:35am",
      "content": "I'm getting going to please Joe, but I'm never talking about tracking again, Ever.:)\n\nI've been wisely advised: don't take any hardware you cannot afford to loose completely. Don't take any software you can't afford to turn over to a complete stranger, with all ownership rights, for free. Don't buy anything that looks old and try to bring it home; the customs chaps have a vague rule about antiquities export protection in their holsters and if they or their wife or mom want what you got, they enforce. Don't ever use credit cards or give anyone any numbers. Make sure a witness is with you if you ever need to give up your passport to anyone for any reason.\n\n.gov has much more to say, much of which is so diplomatically phrased, you might miss it.;)\n\nCheers!\n\n"
    },
    {
      "time": "14 Jun 2008 — 10:45am",
      "content": "David, Thanks for the advice and the link. Maybe I can bring my talk on a pair of jump drives rather than a full-on rig. Are you going BTW?\n\n"
    },
    {
      "time": "14 Jun 2008 — 10:57am",
      "content": "Thankfully, the dissertation deadline at Reading is just before the ATypI conference instead of just after it. I guess I'll take David's advice, and leave my laptop in England.\n\n"
    },
    {
      "time": "14 Jun 2008 — 11:21am",
      "content": "I will ask at the Dept of State and my insurance company to see what they think. It seem like there is often a presentation notebook at these things. If we can get a copy of Keynote on it then I will be happy, although maybe Keynote exports to PP format...\n\n"
    },
    {
      "time": "14 Jun 2008 — 3:03pm",
      "content": "Registration, hotel info, and visa info will all be posted within a few days.\n\n"
    },
    {
      "time": "14 Jun 2008 — 4:47pm",
      "content": "Thanks Thomas!\n\n"
    },
    {
      "time": "15 Jun 2008 — 5:38am",
      "content": "\" If we can get a copy of Keynote on it then I will be happy, although maybe Keynote exports to PP format...\"\n\nI cut my last keynote down to a 100 mb QT movie to get it to just fit on disposable usb media. It's the safe way.\n\nCheers\n\n"
    },
    {
      "time": "15 Jun 2008 — 11:36am",
      "content": "That's an interesting idea. And then you just worked within the pacing or you paused it here & there?\n\n"
    },
    {
      "time": "18 Jun 2008 — 11:38am",
      "content": " ![](http://web.archive.org/web/20120727062226im_/http:/typophile.com/files/Railroad_tracking_6103.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "18 Jun 2008 — 3:36pm",
      "content": "Chris? What's this about?\n\n"
    },
    {
      "time": "18 Jun 2008 — 5:01pm",
      "content": "Tracking :-)\n\nChrisL\n\n"
    },
    {
      "time": "18 Jun 2008 — 5:58pm",
      "content": "hahahahaa\n\n"
    },
    {
      "time": "18 Jun 2008 — 6:46pm",
      "content": "I was hoping Mr Berlow would have a visual since he was not \"talking about tracking ever again\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Jun 2008 — 3:45am",
      "content": "||, or | | is all I've got say. Meanwhile.\n\n\"That’s an interesting idea. And then you just worked within the pacing or you paused it here & there\"\n\nEben, in Keynote, one can output a QT movie that includes paws, awaiting a mouse...\n\nCheers!\n\n"
    },
    {
      "time": "19 Jun 2008 — 9:53am",
      "content": "Thanks very much, David!\n\n"
    }
  ]
}
