{
  "id": "46276",
  "title": "Humanist sanserif companion for Minion Pro",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi Typos,  \nI think of investing in a humanist sanserif font which I would use as a companion for Minion Pro (among other things), mainly for publications about linguistics. Apart from basic and extended Latin character set I also need Cyrillic and Greek, which limits the possibilities substantially. I am a big fan of [Scala Sans](http://web.archive.org/web/20120128095806/http:/www.fontfont.com/shop/view_product.ep?id=13665) (I know, it would be just imitating Bringhurst, but it really is a great font). Scala Sans doesn't include neither Cyrillic nor Greek, however.  \nRight now my favourite choice is [Kievit Pro](http://web.archive.org/web/20120128095806/http:/www.fontfont.com/shop/view_product.ep?id=10110) (I wouldn't know whether to pick [Regular](http://web.archive.org/web/20120128095806/http:/www.fontfont.com/shop/view_product.ep?id=10994) or [Book](http://web.archive.org/web/20120128095806/http:/www.fontfont.com/shop/view_product.ep?id=11011) as my point of departure, though).  \nAnother option is [Stormtype Anselm Sans Pro](http://web.archive.org/web/20120128095806/http:/www.stormtype.com/typefaces-fonts-shop/families-84-anselm-sans-pro).  \nBringhurst recommends Syntax with Minion - but as far as I can see, the Cyrillic version of Syntax, [Paratype Humanist 531](http://web.archive.org/web/20120128095806/http:/www.paratype.com/pstore/fonts/Humanist-531.htm), does not include an italic, which is crucial to my needs. And I don't know if there is a Greek version.  \nSuggestions are welcome!  \nCheers,  \nThomas\n\n",
  "author": "<a href=\"/web/20120128095806/http://www.typophile.com/user/13832\" title=\"View user profile.\">olander</a>",
  "time": "<br>",
  "uid": "13832",
  "comments": [
    {
      "time": "",
      "content": "Some might stone me, but I think Syntax reeks of the '80s. Kievit and Anselm are fine choices. [Myriad](http://web.archive.org/web/20120128095806/http:/www.fontshop.com/search/?q=myriad) is the obvious cmpanion and not necessarily the best, but it does include Greek and Cyrillic.\n\n"
    },
    {
      "time": "",
      "content": "Also not a fan of syntax. I am currently using URW Grotesk with Minion. URW Grotesk also includes Greek and Cyrillic.\n\n"
    },
    {
      "time": "",
      "content": "Don’t overlook FF Meta.\n\n"
    },
    {
      "time": "",
      "content": "Stephen, you're right, Myriad is a good idea. It's a pity there aren't any small caps, though - it's not that I _have_ to have small caps, it's just nice to have the possibility.  \nJessi, I wasn't able to find a Greek version of URW Grotesk. Where did you see that? It's really a very nice typeface. Do you think it goes well with Minion?  \nJames, thanks for drawing my attention to FF Meta. Like Kievit, Meta even seems to have Greek and Cyrillic small caps. But again, how would Meta go with Minion?  \n(I see that Syntax isn't as popular as it used to be, but I incidentally noticed that Linotype Syntax Com includes both Cyrillic and Greek versions, with italics.)  \nThanks a lot for your input!  \nCheers,  \nThomas\n\n"
    },
    {
      "time": "",
      "content": "Erik Spiekermann often [recommended Minion](http://web.archive.org/web/20120128095806/http:/www.fontshop.com/features/newsletters/nov2007_a/) as a Meta companion until Meta Serif came along.\n\n"
    },
    {
      "time": "",
      "content": "This might sound horrid. Especially coming from such a pedantic purist as myself. But, I have used Myriad as small caps. If you have the semi-extended variant of the family you can get away with scaling them ever-so-much, spacing them a hair, and squooshing them just a tittle. It works when you need the \"look\" of small caps and want to use Myriad.\n\n"
    },
    {
      "time": "",
      "content": "Well, I guess Spiekermann knew what he was talking about. Thanks for the link!  \nAs for the home-made small caps of Myriad, it sounds like a funny idea. I will try and see how it looks. But I don't think I have the typographical self-confidence to make a real publication with that kind of small caps.  \nThomas\n\n"
    },
    {
      "time": "",
      "content": "I'm pretty sure Bringhurst uses Scala Sans with Myriad in the elements of typographic style\n\n"
    },
    {
      "time": "",
      "content": "Right about the greek on URW grotesk, I don't know what I was reading.\n\nURW grotesk is the font our organization is tied to, so I have used minion as well as caslon with it. I think they are nice parings, although now I am questioning whether they are the best. For my questions, I wrote a new thread in the general discussions forum.\n\nI am questioning because I have heard the name Akzidenz Grotesk a lot more that URW Grotesk, but same there, you don't have the Greek. Hope you the face you need!\n\njessi.long\n\n"
    },
    {
      "time": "",
      "content": "Bringhurst uses Scala Sans with _Minion_.\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "Looking a little more closely into the Typophile archive ( [searching for \"Kievit\" and \"Cyrillic\"](http://web.archive.org/web/20120128095806/http:/www.google.com/search?q=site:typophile.com%20kievit%20cyrillic), for instance), I noticed that similar issues have been raised a couple of times before.  \nThe more I think about it, what I am looking for is Scala Sans with Cyrillic and Greek, which unfortunately doesn't exist. I think I'll end up with Kievit, although in my opinion it's a little too neutral.  \nThanks again for your help.  \nThomas\n\n"
    },
    {
      "time": "",
      "content": "You could always commission a Scala Sans Cyrillic and Greek. Get a quote from FontShop.\n\n"
    },
    {
      "time": "",
      "content": "haha mikey cheers. was quite late when i wrote that. blasphemy.\n\n"
    },
    {
      "time": "",
      "content": "If you are not bound to Minion: a true pair of sans serif and serif with a pretty extensive covering of multilingual characters is Fedra and Fedra Sans. Typophile has even a (serif only) matching IPA font, mono, condensed, and display variants, math character set etc. etc.\n\nNot really low-priced, but value for the money.\n\n"
    },
    {
      "time": "",
      "content": ":-)\n\n"
    },
    {
      "time": "",
      "content": "Stephen, I'll think about commisioning Scala Cyrillic and Greek from FontShop. I think it's going to be far too expensive for me (I'm just a poor academic who likes typography), but it would be interesting to hear what they say.  \nDr. Trinkwitz, thank you for the suggestion. I am wholly dependent on Minion, but for the record it is good to notice that the Fedra family covers both Cyrillic and Greek.  \nBy the way, I noticed that in [the Russian translation of _Elements_](http://web.archive.org/web/20120128095806/http:/www.aronov-books.ru/typo_1.html), Bringhurst uses Charter and Humanist 531 (Paratypes's version of Syntax). Interesting why he didn't use Minion as the serif font for that version of the book.  \nThomas\n\n"
    },
    {
      "time": "",
      "content": "BTW Thomas... Stephen Coles is the type director at Font Shop.\n\n"
    },
    {
      "time": "",
      "content": "Ha-ha, I wasn't aware of that - thanks for informing me! To me it sounded quite unrealistic to commission a new version of a font. Well, it still does, but it would be interesting to hear what they say anyway. Perhaps if enough people ask for Cyrillic and Greek versions of Scala Sans, in the end they will decide to design it.  \nThomas\n\n"
    },
    {
      "time": "",
      "content": "That's often the way it works.\n\n"
    },
    {
      "time": "",
      "content": "Minion Pro has added extra ligatures.\n\n"
    }
  ]
}
