{
  "id": "46291",
  "title": "Brick Supplier Logo…",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello,\n\nI am working on a logo for a brick and masonry supplier and was looking for some feedback.\n\nThe logo had to be in a round \"seal\" format to pay homage to the parent companies logo.\n\nIt has to convey tradition and history while having a modern touch to look to the future.\n\nThank you for taking time to look/comment.\n\n ![](http://web.archive.org/web/20131020055532im_/http:/typophile.com/files/LB_3532.jpg)\n\n",
  "author": "agency1",
  "time": "10 Jun 2008 — 11:45am",
  "uid": "7048",
  "comments": [
    {
      "time": "10 Jun 2008 — 1:08pm",
      "content": "\"Lawrenceville\" needs some room to breathe.\n\n"
    },
    {
      "time": "10 Jun 2008 — 2:53pm",
      "content": "Make it work in one color first. Also balance the weights of the strokes in relation to each other and the type weight.\n\nWatch out with beige and white together--they tend to blend together.\n\nI would also work on other versions with a seal with whatever icon you decide and keep the business name in straight text next to the seal. It will read better, because right now you are trying to squeeze a hell of a lot of text into the seal.\n\nDavid\n\n"
    },
    {
      "time": "10 Jun 2008 — 7:42pm",
      "content": "Ditto on one color. I'm liking the one on the left at this point. I'll be interested to see the development of this project.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "11 Jun 2008 — 6:05am",
      "content": "Thank you for all your comments so far!  \nClashmore I agree on Lawrenceville being a little tight in there, I will work on that.\n\nUnfortunately Adnix, while I can do versions of the logo with the logotype next to it, it would only be for fun. The client has requested a seal containing all of the information :(\n\n"
    },
    {
      "time": "14 Jun 2008 — 6:59am",
      "content": "I am not sure if the oblique \"SUPPLY\" (bottom) works on a round path.\n\n"
    },
    {
      "time": "14 Jun 2008 — 3:55pm",
      "content": "really liking the style.\n\nagree about space to breathe and comment about 'supply' though.\n\nnice one.\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20131020055532/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "14 Jun 2008 — 7:52pm",
      "content": "I could go either way. I like the modern feel of the right, but the left has a more antique feel too it which I like as well.\n\n"
    },
    {
      "time": "16 Jun 2008 — 3:03pm",
      "content": "VERSION ONE:\n\n'brick and masonry' does not curve enough with circle above. Too much red. I would (for now at least) work in black and white. I think the beige shadow in LAWRENCEVILLE is distracting. 'Supply' should not be oblique. Lines connecting 'SUPPLY' also do not match the seal outline.\n\nVERSION TWO:\n\n'LAURENCEVILLE' needs to be lower to give equal space on top and bottom.\n\nMy preference right now is version two but mainly due to the more balanced color pallete.\n\n"
    },
    {
      "time": "20 Jun 2008 — 8:04am",
      "content": "These look really striking. My initial criticism is towards the illustration of the brick and trowel. I think it's a little too soft, and almost reminds me of a icon instead of an illustration.\n\nPlsu, I agree with Robert... that text needs some breathing room. It's slammed into a space that's a little too tight. And I don't like how the Brick & Masonry sit so close to supply. Even bricks have a bed of mortar to keep thing spaced. Don't use an italics font along a curve either, it's a bad design choice.\n\nI do like the color palette, you have a solid foundation to build from with these first designs. It just needs some technical tweaking.\n\n"
    },
    {
      "time": "23 Jun 2008 — 5:41pm",
      "content": "\"You got to frame it just right and have some luck of course  \nAnd it helps to have a tall man sitting on the horse\"\n\n"
    }
  ]
}
