{
  "id": "463",
  "title": "Archive through June 23, 2003",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hrant,   \n   \nAre you sure you don't just like bolder types? John seems to.   \n   \nLetterpress has many examples of bold, Balloon comes to mind. It is not as if letterpress is unable to display heavy weights in ways other than . . . inferior presswork.   \n   \nI would like to suggest that Caslon is a light typeface. Looking at other historical \"letterpress\" models you will find that to be true. If Caslon wanted a bolder type he would have left more metal on the surface of the punch.   \n   \nCaslon's guide for his hands and eye were smoked proofs. \"A progression of smoked proofs.\" Not a \"singular proof\" after he had finished cutting the punch.   \n   \nIf he were using dampened papers with globules of ink as his proofing medium have you any idea how much work that would be? Caslon would still be cutting. That method would require many strikes, broken punches and a typeface inferior to the great type face he produced.   \n   \nProgressive proofs are essential. Think digital?   \n  \nCaslon was not \"retracting gain\" as he cut his punches. In other words, Caslon was not a prophet.   \n   \nTo borrow your words. That is reality!   \n   \nGerald Giampa\n\n",
  "author": "<a href=\"/web/20090917132819/http://typophile.com/user/1871\" title=\"View user profile.\">serafino</a>",
  "time": "<br>",
  "uid": "1871",
  "comments": [
    {
      "time": " 22.Jun.2003 8.10am",
      "content": "Well, I do like somewhat darkish weights in text faces - but I wouldn't call it \"Bold\". I'd point to Smeijers as to what I like myself (in terms of weight).   \n   \n\\> I would like to suggest that Caslon is a light typeface.   \n   \nAre you saying that the Caslon typeface \"ambiance\" requires a certain lightness? That's an interesting point, and actually something that's crossed my mind too. For example, I think a Garamond is only a Garamond if the x-height is small.   \n   \n\\> smoked proofs   \n   \nThe thing with smoke proofs is that they don't exhibit gain (because soot doesn't get absorbed into paper the way ink does, but also because the hand can't apply as much pressure as a press). The good thing is that you see what you're cutting very well, but it's not what the reader will see. Of course, any decent punchcutter knows this, and will account for it (including by introducing trapping).   \n   \n\\> Caslon was not \"retracting gain\" as he cut his punches.   \n   \nYou're not giving him enough credit. If he ignored the reality of gain in the end result, then he was not a good craftsman. And you don't need to be a prophet - it's just some ink on paper.   \n   \nOne way to find out how good Caslon was is to see if he put trapping in his punches.   \n   \nhhp\n\n"
    },
    {
      "time": " 22.Jun.2003 11.14am",
      "content": "\\> Caslon was not \"retracting gain\" as he cut his punches.   \n   \n\"You're not giving him enough credit. If he ignored the reality of gain in the end result, then he was not a good craftsman. And you don't need to be a prophet - it's just some ink on paper.   \n   \nOne way to find out how good Caslon was is to see if he put trapping in his punches.\"   \n   \nHrant   \n   \nIt doesn't necessarily follow that Caslon was allowing for gain. It may not have been a consideration. But a good question to ask here is when did these concerns begin? When specifically did trapping begin to be implemented?   \n   \n\"Readereship\" as a phenomenon is linked to the mid nineteenth century. The result of the expansion of the trade book industry because of significant mechanical advancements in the printing, papermaking, and bookmaking industries.   \n   \nI suspect concerns for the \"reader\" or \"reading\" are much later in terms of typographic consideration.\n\n"
    },
    {
      "time": " 22.Jun.2003 11.33am",
      "content": "\\> It doesn't necessarily follow that Caslon was allowing for gain.   \n   \nWhat other reason would there be to implement trapping?   \n   \nBut anyway, trapping is not the primary factor - increase in weight is. Do you think Caslon didn't care about that?   \n   \n\\> When specifically did trapping begin to be implemented?   \n   \nGood question - I'd be very interested to find out. The problem of course is that the further back you go the less chance you'll have the punches at hand to see the traps: they don't show up from the actual prints\\* (they're not supposed to). And procuring smoke proofs of old fonts is probably next to impossible. Who would have kept them?   \n   \n\\* Actually, there might be a way, by very carefully the rounding of outside versus inside corners... I'll have to figure that out.   \n   \nMy guess is that they started implementing trapping as soon as they -and society- got comfortable with printing as a technology, and could worry about the finer things. So maybe early in the 16th century?   \n   \n\\> I suspect concerns for the \"reader\" or \"reading\" are much later in terms of typographic consideration.   \n   \nIn terms of cultural trends, I have to trust you time-framing of this, since I know little about it. But I also think it's reasonable to believe that anybody making a font at any time wishes to serve his reader. That's the difference between Art and Craft.   \n   \nhhp\n\n"
    },
    {
      "time": " 22.Jun.2003 12.02pm",
      "content": "Yeah, Caslon and just about anyone else working prior to the nineteenth century. Not many examples of emboldened typefaces previous to the Industrial Revolution are there.   \n   \nMoxon's book of 1683 does not discuss trapping or any similar concerns in regard to punchcutting. Printing is an industrial practice. There certainly was a craft concern in the beginning of printing's history but this begins to erode once the ad hoc nature of printing enterprise disappears and it becomes regulated and specialized through guild practices. In terms of printing being an Art, these rarified discussions begin in the late nineteenth century.   \n   \nI don't believe you can apply the concept of readership or concern for the reader to late medieval/early Renaissance work but that is exactly what was done with the Revival(s), as a natural rationale. Something else WAS very much at play way back when, but it was not a consideration for the \"reader.\"\n\n"
    },
    {
      "time": " 22.Jun.2003 2.21pm",
      "content": "John,   \n   \nI am not sure your idea is unreasonable. Frankly my interest is \"fine printing\" or \"respectable typography\" at least. Not so much commmercial abuse. Our customers have similar \"lean\". However the Boston Globe was most happy to use our digital Calson 337 for their anniversary year.   \n   \nThe many dozens of cuttings attempting to achieve similar objectives as yours failed commerically. Certainly that would reduce the usefullness you are speaking of.   \n   \n\\>the Caslon Challenge   \nLet me understand: The bulk of the text was printed from digital direct to film, then offset, and the other was letterpress from monotype metal type to paper?   \n   \nNo, I set the original hot metal type. Pulled a reproduction proof. I output the digital page of type in positive, rather than negative. I pasted in the lines replacing the digital ones.   \n   \nI shot the page with new film, new chemicals for processing on a reproduction camera.   \n   \nThis was then printed.   \n   \n   \nHrant,   \n   \nCaslon did not use ink trapping! More later.\n\n"
    },
    {
      "time": " 22.Jun.2003 2.31pm",
      "content": "\\> \"fine printing\"   \n   \nIt would have the be the finest of the fine to alleviate the need for compensation on the part of the type designer... Even the hand of master printer Bram de Does hasn't reduced the necessity of Fleischmann's technical mastery, 250 years on!   \n   \n [http://www.atypi.org/news\\_tool/news\\_html?newsid=99&from=/](http://web.archive.org/web/20090917132819/http:/www.atypi.org/news_tool/news_html?newsid=99&from=/)   \n   \n\\> Caslon did not use ink trapping!   \n   \nI can believe that.   \nHe didn't even bother making the tail of his UC \"Q\"s even strucurally consistent across different sizes... of _display_.   \n   \n [http://www.hwcaslon.com/catp3.asp](http://web.archive.org/web/20090917132819/http:/www.hwcaslon.com/catp3.asp)   \n   \nhhp\n\n"
    },
    {
      "time": " 22.Jun.2003 2.36pm",
      "content": "\\> Caslon did not use ink trapping!   \n   \nBut just to check:   \nHow exactly do you know this?   \n   \nhhp\n\n"
    },
    {
      "time": " 22.Jun.2003 10.26pm",
      "content": "Hrant,   \n   \nI am certainly leaning (falling over) towards Gerald Lange's rational scepticism about your ink trapping theory.   \n   \nAlso I do not believe it is so easy to find \"a separation marker\" dividing art from craft.   \n   \nCertainly I will tell you how I know Caslon did not implement \"ink trapping\", but before that, out of my excitement to hear how you have arrived at this ink trapping theory in the first place keeps me from my keys?   \n   \nIf what you say was a common practitude, this discovery, if proven, would put you in an enviable historical elevation.   \n   \nThe concept of consistent design running though varying point sizes (also inconsistent from one foundry to the next) was not as rigidly fixed as it became later. Some would argue with measurable evidence of support that early founders designed types for point sizes. And even named them such.   \n   \nThe same can be said of Italics which were not considered ancillary alphabets. Bolds were often independent in design. Although design similarities could be found and expected to be found if the work originates from the \"same hand\". However, that is a looser capture of what moderns determine to be \"type style\".   \n   \nThis negated religious adherence to drawings which may not have even existed. You say Caslon's scaling is not linear, it could have been.   \n   \nBy the way do you see any evidence of ink trapping in the bowl of the smallest of the Q exemplars?   \n   \nIf so, I would say el pluggo!   \n   \nPlease tell me more of your theory. Is it merely speculative, or do you have proof?   \n   \nGerald Giampa\n\n"
    },
    {
      "time": " 22.Jun.2003 11.08pm",
      "content": "I think Gerald (Lange) is ambivalent about all this. He knows orders of magnitude more about metal type than I do, and has a practical, even pragmatic outlook that's highly valuable, but I will note that once or twice I've pointed out traps in metal fonts that he hadn't noticed were there. Without the benefit of zooming in on a digital outline until it fills your screen, you really have to be looking for the stuff to see it. Sometimes you even need a loupe.   \n   \n\\> scepticism about your ink trapping theory.   \n   \nTheory? It's more of a belief: that a good text face has some.   \n   \nI don't know how many people (in the past and today) put trapping in their designs, but that's really secondary.   \n   \n\\> \"a separation marker\" dividing art from craft.   \n   \nThere is no strict separation - nothing exists in a pure state. But Art is about self-expression, while Craft is about serving other people.   \n   \n\\> I will tell you how I know Caslon did not implement \"ink trapping\"   \n   \nWhen?   \n   \n\\> enviable historical elevation   \n   \n?   \n1) Like I said above, I have little grasp of how narrowly/widely trapping was used, especially not so far in the past, so I can't take credit for any kind of deep practical insight.   \n2) It's no secret that trapping was used way before the advent of phototype technology. It's just that people these days\\* don't think about it much, probably not least because digital type can be used much larger than its \"intended\" size, and traps can look ugly.   \n   \n\\* I shouldn't say that. Since more than a year now there seems to be a lot more interest.   \n   \n\\> This negated religious adherence to drawings which may not have even existed.   \n   \nWell, I can see how a lack of \"peer pressure\" back then caused Caslon not to care so much for consistency (culture is a huge guide - most design decisions in any age are based on what other people are doing), but if you believe that a font has a certain character, and certain types of consistency at least strengthen this character and make the design more focused/useful, then you don't vary things so much. Caslon is known for his wanton variance.   \n   \n\\> You say Caslon's scaling is not linear, it could have been.   \n   \nI'm not sure what you mean.   \n   \nWhen I called his UC italic \"Q\" non-linear I was perhaps using the term badly. I meant that the way that internal curl becomes less convolved in the smaller sizes cannot be interpolated along Cartesian axes - it's a polar thing.   \n   \n\\> do you see any evidence of ink trapping in the bowl of the smallest of the Q exemplars?   \n   \nLooking at Founders Caslon, which is based on prints, and trying to visualize how the designed shape looked like before it suffered gain, I'd have to say there's probably no trapping there - but that's not a reliable opinion.   \n   \nhhp\n\n"
    },
    {
      "time": " 22.Jun.2003 11.46pm",
      "content": "Hrant   \n   \nI'm guessing but I kind of doubt you will find evidence of trapping, as a theoretical design device, prior to the twentieth century. Given certain technological and cultural structures, I don't seen any reason for it to have existed prior.   \n   \nSome tricks, such as the use of the same counter punch for different sizes (punched deeper and thus wider) might have some optical consideration and some ranging consequences (the bowl of the Q).   \n   \nHowever, Justin Howes told me once there was a notable mid-nineteenth attempt to NOT provide scaling but an exact replication through the size line, so some thought was in place.   \n   \nPerhaps the key though is in Gerald's remark about the naming of sizes, which I had previously not considered (I like this). The point system is turn-of-the century in implementation. It is quite possible that without a structural mathematical form of codification, it simply was not in the cards for that kind of intellectual leap.\n\n"
    },
    {
      "time": " 23.Jun.2003 12.34am",
      "content": "Hrant,   \n   \nWould you not say the highly regarded Monotype libraries should have included a proactive directive in their cuttings to include ink trapping if this were a modern consideration? After all, did not Stanley Morison make mention of readability vs legibility?   \n   \nGerald Giampa\n\n"
    },
    {
      "time": " 23.Jun.2003 1.04am",
      "content": "Gerald   \n   \nStanley was in the business of selling machines was he not? Machines to anyone. Even to someone who would be running the worse conceivable mixture of type metal through it, who might not adjust it properly, be concerned about proper maintenance of matrices, etc.   \n   \nOn the other hand, Monotype did provide a certain level of optical sizing, if not trapping, even into the photofilm years.   \n   \nSo, having said this, and now posing a question in regard to your last post: why did you not?\n\n"
    },
    {
      "time": " 23.Jun.2003 3.02am",
      "content": "Gerald   \n   \nMorison sold\n\n"
    },
    {
      "time": " 23.Jun.2003 3.10am",
      "content": "Mr. Giampa:   \nThat reminds me: In _The Fount_ , Volume 1, number 1, you tell us that \"Lanston will follow with...Caslon 437, a companion display version...\" How's that coming along?\n\n"
    },
    {
      "time": " 23.Jun.2003 3.24am",
      "content": "Gerald   \n   \nMonotypes would not run long by an operator who did not know how to adjust his or her machine.   \n   \nHrant,   \n   \n\"Good question - I'd be very interested to find out. The problem of course is that the further back you go the less chance you'll have the punches at hand to see the traps: they don't show up from the actual prints\\* (they're not supposed to). And procuring smoke proofs of old fonts is probably next to impossible. Who would have kept them? \"   \n   \nYou won't be needing smoked proofs, punches, or the drawings. All you need is a specimen of the types. In instances such as Caslon they are available. Seek and ye shall not find.   \n   \nIf it is not in the type, they are not in the punches either. After all the only way for the mysterious \"ink trapping\" to have any effect is where the rubber meets the road.   \n   \nSo you see, the type will suffice, or patterns if the types were pantographic productions.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": " 23.Jun.2003 3.45am",
      "content": "Gerald,   \n   \nI am not sure I addressed your issue about Monotypes operators qualifications and working conditions.   \n   \nPerhaps I would have been clearer in pointing out that ink trapping is irrelavant to a Monotype operator. If it were \"lead trapping\" indeed he would have gone home scratching his head. All the maintenance in the world would not cure such a problem. If I were Warren Faust writing the manual I would have recommended a good stiff drink.   \n   \nI suspect I have missed something.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": " 23.Jun.2003 3.50am",
      "content": "John Nolan,   \n   \nPoorly, however after recent interest in Caslon, a surge in sales. I am considering re-scheduling. I do not know if you were aware but I had previously been fighting for my life with health issues. These seem to have come to pass.   \n   \nWhat are your thoughts. Caslon 337 was not offered in large point sizes. It was a text based series.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": " 23.Jun.2003 3.53am",
      "content": "John,   \n   \nIf you remember that, I suspect you may have a copy of The Fount with the \"Caslon Challenge\". I don't. Perhaps you could look for the issue and see if others can find the original lines from the digital?   \n   \nGerald Giampa\n\n"
    },
    {
      "time": " 23.Jun.2003 5.14am",
      "content": "Hrant --   \n   \nA couple of observations. First, I think the concept of   \na linear progression between type sizes is a twentieth-   \ncentury ideal. As both Geralds mentioned, prior to the   \nadoption of the point system, individual names were   \nused for type sizes -- you know this. Many of these   \nnames were commonly used, though the actual   \nmeasures would vary. (This is what the point system   \nsought to overcome.) But sometimes, I think, a new   \nname might be made up for a new font. I think Granjon   \nwas fond of this.   \n   \nThis suggests to me that these typefounders approached   \neach font as a new design, not necessarily a variation   \non an existing alphabet. Certainly there are remarkable   \nconsistencies between fonts from the same hand, to   \nthe degree that a punchcutter held a fixed ideal in his   \nhead about the shapes of letters. But I doubt that   \nGaramond, for instance, had in his head that he was   \ncreating the 24-point version of the \"Garamond\" typeface   \ndesign. Caslon wasn't setting out to make the 36-point   \nversion of \"Caslon.\" I doubt Caslon, the man, had the   \nconcept of Caslon, the typeface, which we have now.   \nThese men simply set out to make an alphabet of a   \nparticular size because it was needed. There was no   \nimperative for it to look necessarily like an enlargement   \nof what went before, certainly not a linear one. The   \nconcept of related type styles in one family did not   \nemerge until Morris Fuller Benton's work unifying the   \nATF library.   \n   \nSecondly, you must keep in mind that there was no   \nterm for (and perhaps no concept of) \"ink trap\" prior   \nto the 20th century. And, in fact, we are using the term   \nhere in almost the opposite sense of its original coinage.   \nThe term \"ink trap\" was originated in 1930 by the   \nprinter Henry A. Wise Wood. He used it to describe   \nareas of a letterform which, due to the circumstances   \nof the increasing acceleration of high-speed presses,   \nwould fill up with ink. He thought that types could be   \nimproved by eliminating these \"ink traps\" from the   \ndesign. Linotype's first approach to the problem was to   \nvary the structure of the letter design to eliminate these   \nproblem areas -- this was the aim of the Legibility Series   \nof newspaper types. Later approaches involved the   \nintroduction of nicks or notches to allow the collected   \nink to trap in controlled ways and preserve the desired   \noutline -- Bell Gothic being the most notable example.   \n   \nIt is only recently that we've co-opted the term to refer   \nto the nicks themselves and not the problem that they   \nwere trying to compensate for.   \n   \nAll this by way of suggesting that punchcutters did not   \nhave a term, and perhaps not even a concept (or even   \na need), for this kind of compensation and you might be   \nhard-pressed to find any examples.   \n   \n-- Kent.\n\n"
    },
    {
      "time": " 23.Jun.2003 5.19am",
      "content": "John --   \n   \nIf you have a copy of the Caslon challenge and you   \nare coming to TypeCon again this year, will you please   \nbring it?   \n   \n-- Kent.\n\n"
    },
    {
      "time": " 23.Jun.2003 5.31am",
      "content": "Gerald:   \nI didn't know about your health problems. I hope you're recovering in the healthy air of Finland (not to say PEI's air wasn't).   \n   \nI'd love to see 437 appear.   \n   \nI do have a copy of The Fount, which I often page through with admiration.   \n   \nI've never had the slightest luck trying to find where the metal setting might be.\n\n"
    },
    {
      "time": " 23.Jun.2003 9.25am",
      "content": "\\> I kind of doubt you will find evidence of trapping, as a theoretical design device, prior to the twentieth century.   \n   \nI think I've actually seen some very early examples (like in an UC \"R\" from Le Be II), but I admit I can't be sure. It would be a major project to track this stuff down.   \n   \n\\> Stanley Morrison   \n   \nMorrison was a ideologue, and he simply leveraged that to further his company's interests. His only use for legibility studies is if they helped promote his own pre-determined (highly traditionalist) stance. Any technical sensibility was only useful to him if it proved one of his points - note how he sidelined the much more knowledgable Pierpont, and like how he made a big deal about Cyril Burt's study (which turned out to be a sham).   \n   \nMonotype -being a corporation- was mostly about making money efficiently. Trapping being of obscure benefit\\* would have slowed them down. On the other hand, I'm not sure they didn't do it! Clearly, I have a lot of research work to conduct before I can have an opinion on that. Traps are sometimes tiny (I'll try to show an example soon), and you really do need to look very closely, and _not_ at printed sample (see below).   \n   \n\\* In fact, it's not even easy for me to justify it in terms of pure functionality. To me it's more a matter of preserving the design intent.   \n   \n\\> mistaken \"ink trapping\" for \"light trapping\"   \n   \nSame difference - just a matter of polarity and quantity.   \n   \n\\> \"ink trapping\" as spoken is a noticable abberations in design.   \n   \nAre you saying people implement trapping by mistake?   \n   \n\\> If it is not in the type, they are not in the punches either.   \n   \nOnly if the printing is perfectly gain-free, which is extremely rare. In practice, the entire point of trapping is for the end-result not to reveal it!   \n   \n\\> These men simply set out to make an alphabet of a particular size because it was needed.   \n   \nYes, that's certainly true.   \n   \n\\> there was no term for (and perhaps no concept of) \"ink trap\" prior to the 20th century.   \n   \nMaybe because things were insular and poorly documented back then? It's not like when Kis was apprenticed to Voskens he took notes and published them! Trapping is a technical thing that wouldn't have been publicized.   \n   \nOn the other hand, I'm not insisting they're a very old device - I need to delve much deeper. But I do remember John Downer mentioning (on the TD list\\*) that old punchcutters would have a small hard needle type thing they'd drive into tight corners, to (eventually) trap the ink, and I think I've spotted examples.   \n   \n\\* From about 2.5 years ago:   \n\"   \nThe so-called 'Trapping Flower' proposed, does have an advantage that the use of a tiny, calibrated, ball bearing -- as used to determine need for how to proceed with deepening a crotch -- doesn't have: it's digital. You don't need to be skilled with forceps or a graver to insert a tangent point and pull out BCPs.   \n....   \nA 'BB' (the little copper shot used in a BB gun) tells -- it likewise will give the precise placement & width of the mouth of a symmetrical (but only a symmetrical) trap. Still, the Papazian version of the 'BB Method' invented by punchcutters has little use outside the scenario illustrated   \n\"   \n   \nhhp\n\n"
    },
    {
      "time": " 23.Jun.2003 9.57am",
      "content": "Yes, documentation on punchcutting, at the theoretical level you are looking for, is fugitive but there are some bits here and there. Not enough to put something together with though.   \n   \nBut that little device of Downer's is a subsurface tool that would not show up on the face. This is for ink drain, providing a sharper inclination of slope at corners. Even Monotype castings will readily reveal this. Similar to a trap I suspect in function, but not applicable to digital obviously.   \n   \nI've wondered about the Trapping Flower's shape. Sounds like a possible solution if it could be scripted in some rationale fashion but would the rounded BB be the best solution? Deep traps seem to be cut with two angles to allow the ink to form its own curve?   \n   \nThe latter is also the technique implemented by Adobe as indicated in its [extreme series] monograph on trapping (trapping in regard to color application).\n\n"
    },
    {
      "time": " 23.Jun.2003 10.50am",
      "content": "\\> a subsurface tool that would not show up on the face.   \n   \nOh. Examples?   \n   \n\\> if it could be scripted   \n   \nWork-in-progess. FontLab/Python.   \n   \n\\> would the rounded BB be the best solution?   \n   \nNo, a uniform circle is very primitive. A Flower-made trap varies in size depending on the angle opening, and depth factor. Also, it doesn't have to act symetrically (neither with respect to the angle nor the Cartesian space).   \n   \n\\> the ink to form its own curve?   \n   \nI don't get it.   \n   \nThere's a relation to color trapping? Interesting...   \n   \nhhp\n\n"
    },
    {
      "time": " 23.Jun.2003 10.58am",
      "content": "_If you have a copy of the Caslon challenge and you are coming to TypeCon again this year, will you please bring it?_    \n   \nI probably do have a copy, but I probably don't know where it is. If I'm able to locate it before TypeCon, I'll certainly bring it.\n\n"
    },
    {
      "time": " 23.Jun.2003 10.59am",
      "content": "Hrant,   \n   \nI think you have misread my response to your statement.   \n   \n   \n\"Good question - I'd be very interested to find out. The problem of course is that the further back you go the less chance you'll have the punches at hand to see the traps: they don't show up from the actual prints\\* (they're not supposed to). And   \nprocuring smoke proofs of old fonts is probably next to impossible. Who would have kept them? \"\n\n"
    },
    {
      "time": " 23.Jun.2003 1.14pm",
      "content": "Kent:   \nIf you were talking to me, and not John Hudson:   \n   \nI'm sad to say I don't think I'm going to be able to get to Typecon this year. (I'm not quite ready to say I'm _definitely_ not coming yet.)   \n   \nIf Mr. Hudson doesn't show up with a copy, let me know.   \n   \n-John Nolan\n\n"
    },
    {
      "time": " 23.Jun.2003 1.41pm",
      "content": "Actually, I _was_ talking to John Nolan. We will miss you   \nif you are unable to attend. Maybe ATypI out on the left   \ncoast in fall?   \n   \nJohn Hudson, if you find your copy in time, that will be   \nswell. We can put our heads together on the challenge.   \nIf not, no matter. Another time, another place.   \n   \n-- K.\n\n"
    },
    {
      "time": " 23.Jun.2003 9.10pm",
      "content": "Kent,   \n   \nWhen looking for the original Caslon lines read the text first. There are clues.   \n   \nGerald,   \n   \nI am trying to remember if you are the person who prints beautiful \"works\". If so, what are you up to these days? In the way of printing I mean.   \n   \nHrant,   \n   \nI have a confession to make. I had many years ago \"ink trapped\" a digital private version of Lubalin Graph for high resolution at very small point sizes. The job was for Fletcher Challenge. God bless them, they gave the wrong point size to the sign painter which used them on the entire fleet of trucks. I cringed whenever I saw one of the trucks delivering paper to my shop. But it certainly did the job at very small point sizes. I must use the words \"extreme ink trapping\".   \n  \n   \nGerald Giampa\n\n"
    }
  ]
}
