{
  "id": "46304",
  "title": "Ruh, roh!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "\"The easiest to read is the Arial (font)\"\n\n[http://www.mlive.com/business/index.ssf/2008/06/study\\_by\\_university\\_of\\_m...](http://web.archive.org/web/20100825012921/http:/www.mlive.com/business/index.ssf/2008/06/study_by_university_of_michiga.html \"http://www.mlive.com/business/index.ssf/2008/06/study\\_by\\_university\\_of\\_michiga.html\")\n\n",
  "author": "<a href=\"/web/20100825012921/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": "",
      "content": "gag.\n\n"
    },
    {
      "time": "",
      "content": "Actually the study, when it comes out, might be worth a read - if using hard-to-read fonts on menus really makes customers more willing to pay more for their food we'll all be in for a fun ride. ;-)\n\n"
    },
    {
      "time": "",
      "content": "Maybe it's like the early days of medicine when a doctors would go from treating patients with horrid infectious diseases straight to delivering babies, until one day someone counted the bodies and said, \"say... Maybe hand washing business isn't such a daft idea after all.\" (first we go from terrible to mediocre, then it's all uphill from there.) ;o)\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "<cite>If marketers want to give the impression that products - like the furniture in IKEA - is easier to assemble, then they'd want to make the font deeper and easier to read.</cite>\n\nHow do I make a font deeper? Read it Noam Chomsky and teach it to smoke clove cigarettes?\n\n"
    },
    {
      "time": "",
      "content": "I read Chomsky and the American critic Roger Shattuck to my fonts. It seems to imbue them with a dash allure. I don't recommend the clove cigarettes tho, they will turn your fonts into hippies before you even know what's happened. Give them Cannabis Sativa man. The brilliant green adds a depth and shine so deep you can live your life in the reflection.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "[4:20 fonts](http://web.archive.org/web/20100825012921/http:/www.somethingawful.com/fakesa/fontsite/) anyone? ;-)\n\n"
    },
    {
      "time": "",
      "content": "Oh look, I just invented typography! Put me on the internet!\n\nBut set it in dingbats so I look sophisticated..\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100825012921im_/http:/typophile.com/files/IKEA_job_3480.gif)\n\n"
    },
    {
      "time": "",
      "content": "Actually, if the comparison was between Algerian, Linotext, and Arial, then it is true. Arial is the easiest to read.\n\n"
    },
    {
      "time": "",
      "content": "Referring to Arial by name was a mistake, she probably meant Sans-Serif fonts are easier to ready and convey a more simplistic ideal for instructions. Where as serifed fonts probably give that sense of challenge and would be more suitable for menus.\n\nKinda makes sense. She's not a typographer she's a social researcher with marketing interests. She's not looking at the fonts for all their charm and quirk she's doing blanket surveys.\n\nAs a designer, it's our job to convey the information she's collecting and use that information to make better design choices. We all know Arial bits the big one, but we might not have known that a grotesque sans-serif conveys the idea that these instructions are better and easier to understand.\n\n"
    },
    {
      "time": "",
      "content": "\"Arial bits the big one\"\n\nIs this a comment on the bi-level hints?\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "bites, I meant bites!\n\n"
    },
    {
      "time": "",
      "content": "I posted a comment explaining the faulty presentation of that statement with no context, then their silly commenting system dropped an error and ate it.\n\nFeh.\n\nI guess I can look forward to having this forwarded to me by a sadly mis-informed client sometime in the future...\n\n"
    },
    {
      "time": "",
      "content": "I think the researcher should be invited to TypeCon.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "<cite>I guess I can look forward to having this forwarded to me by a sadly mis-informed client sometime in the future...</cite>\n\nReason 101 that I’m thinking about giving up on graphic design and going to work at a PR firm.\n\n"
    },
    {
      "time": "",
      "content": "\"This study PROVES that Arial is the easiest to read! Here, read it! Now please set the entire book in Arial. Let's not waste any more time on this.\"\n\n"
    },
    {
      "time": "",
      "content": "research funded by microsoft perhaps?\n\n"
    },
    {
      "time": "",
      "content": "I can't rule it out, but this wasn't funded by the MS typography groups. That should be obvious as there's no mention of ClearType TM, and Arial was \"retired\" a year and a half ago. ;-)\n\n"
    },
    {
      "time": "",
      "content": "“ This study PROVES that Arial is the easiest to read! \". [Just a try with it.](http://web.archive.org/web/20100825012921/http:/www.photoblog.com/storage001/2008/06/11/)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100825012921im_/http:/typophile.com/files/fontdeeper_6115.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\"I think the researcher should be invited to TypeCon.\"\n\nCan she juggle pictures of kittens and/or bait 'n switch an audience like Kevin?  \nOtherwise, as I said at TypoBerlin, the only difference between these studies (MS, UM and Clearview), and a bucket of... s\\*\\*t, is the bucket, (unless it also has a handle).\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "I welcome the news that Arial is the easiest to read: at my old university, they used to print everything in Comic Sans, \"because it's the easiest to read\". Well, Arial'd be a step in the right direction!\n\n"
    },
    {
      "time": "",
      "content": "\\>Otherwise, as I said at TypoBerlin, the only difference between these studies\n\nSo, are you saying all research is a waste of time, or that studies financed by an interested party (Microsoft, Terminal etc.,) are going to be biased?\n\n"
    },
    {
      "time": "",
      "content": "I was wondering that as well. Just because DB's comment is witty doesn't make it true. (Doesn't make it false, either.) On what grounds do you dismiss all these different studies?\n\nT\n\n"
    },
    {
      "time": "",
      "content": "[Elvis](http://web.archive.org/web/20100825012921/http:/www.collingwoodelvisfestival.com/) is easiest to imitate.  \n(No studies on this yet, just a hunch.)\n\n"
    },
    {
      "time": "",
      "content": "\"So, are you saying all research is a waste of time\"  \nI was specific.\n\n\"On what grounds do you dismiss all these different studies?\"  \nA plague of all.\n\nI get samples used in studies, when I can (ahem). If I can't get samples, I decide right there.\n\nHave either of you (Sii or Thomas), studied any of these studies down to the exact type used to reach the results? Just curiouser.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "\\>Have either of you (Sii or Thomas), studied any of these studies down to the exact type used to reach the results? Just curiouser.\n\nTake Clearview for example. I've seen the pics. They seem to have constructed actual road signs using the fonts and actual reflective material used in real signs, and James, the actual type designer was involved. What was wrong with the \"exact type\" in that study?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Take Clearview for example…What was wrong with the “exact type” in that study?</cite>\n\nSeconded. The Clearview studies were hardly the kind of silly stuff that’s been done by some of the psychologists out there—what’s wrong with them?\n\n"
    },
    {
      "time": "",
      "content": "Their specificity.  \nReadability studies only have validity within narrow bounds.  \nClearview: great read for road signs, but how good for print text?  \nSo to say that a particular typeface is \"easiest to read\" as a blanket statement is just plain stupid.\n\nFor real typographers, \"Easiest to read?\" is not even a question.\n\n"
    },
    {
      "time": "",
      "content": "\\>For real typographers, “Easiest to read?” is not even a question.\n\nI don't agree. It's a good question, but it probably has different answers in different contexts. You can define these contexts with enough clarity--road signs for fast driving, reading a printed book, reading text on screen--to seek meaningful answers.\n\n"
    },
    {
      "time": "",
      "content": "\\>For real typographers, “Easiest to read?” is not even a question.\n\nNot sure I understand the criticism. The studies David is claiming are a bucket of shit (sans handle) don't ask that question. Ms Song's study apparently doesn't either. From the ATypI thread Tom Phinney wrote...\n\n\"Yes, they found that Arial was more readable than Mistral or Brush Script, but the point was \\*not\\* to find the most readable font possible.\"\n\n"
    },
    {
      "time": "",
      "content": "Nick, Bill, you are not really disagreeing. I agree too with what Nick said \"Readability studies only have validity within narrow bounds.\" It might be that broader finding could be made with enough highly specific research done. But we are no where near that point yet. One of the reasons broad theories in science are so celebrated is that they are rarely defendable. hey are very much the exception not the rule. So going on that I suspect that any research done will show over & over that what's needed for best readability in a given situation is specific to that situation. Which of course flows neatly with the experience of type designers.\n\nI did miss the kittens this year.\n\n"
    },
    {
      "time": "",
      "content": "Eben, you may be right, but my impression is that I go further than Nick in thinking that greater and lesser readability of text will be one day measurable.\n\nBy the way, all scientific theories are universal in logical form. In that sense, broad theories are not the exception, but the rule in science. It is true that many theories are qualified to apply to elastic objects, or liquids, etc., but that is a different matter. I agree with you that general theories are harder to come by, and more precious when we have them.\n\n"
    },
    {
      "time": "",
      "content": "You guys are just too funny - the tears are rolling down my eyes.\n\nWhat ever happened to the designers? You know, the ones who actually took their time to learn about type and understand the concept of when to use display, script, san serif, serif, roman, gothic, fancy, and on and on and on...\n\nAnd last time I check the IKEA catalog - is was in Helvetica. So does that mean that Arial is \"deeper\" than Helvetica? LOL\n\nI'm making my seat now....\n\n"
    },
    {
      "time": "",
      "content": "_...will be one day [be] measurable..._\n\nScience can't predict culture, because it's the business of culture to be dynamic and unpredictable, confounding analysis.  \nScientific method was first applied to advertising in the early 20th century (Starch, etc.), but it hasn't gotten any further traction than market research. There you have the tension between reason and intuition.\n\nIf it's assumed that someone is going to read the text, then going by the numbers may seem useful. Meanwhile, the reader has caught sight of a page of text and the conditioned response is, \"am I going to even bother reading this shit?\" (sorry, it's _le mot du jour_).\n\n"
    },
    {
      "time": "",
      "content": "Nick, I think that readability is part of what makes a text inviting, so it isn't a completely separate issue. Certainly there is a lot more to attracting a reader, and the design can contribute (or detract) greatly from whether people want to read something. Also of course how well written the stuff is makes a big difference as to whether they continue reading, once they start.\n\n"
    },
    {
      "time": "",
      "content": "\\>And last time I check the IKEA catalog - is was in Helvetica.\n\nYou're joking right? They use Ikea Sans a Futura derivative. ;-)\n\n"
    },
    {
      "time": "",
      "content": "And Century Schoolbook?\n\n"
    },
    {
      "time": "",
      "content": "_...readability is part of what makes a text inviting, so it isn’t a completely separate issue._\n\nExactly. But why are you assuming that it's only readability if it can be measured?\n\nThe readability of a document is dependent on many factors, mostly typographic (those that Jackie mentions), i.e. governed by the layout, not the typeface. In fact, the typography determines the readability of the text to such an extent that it can easily reverse the relative readability of fonts, as measured in the lab.\n\n"
    },
    {
      "time": "",
      "content": "I don't assume that anything exists only if it can be measured. That's a version of positivism, and I don't share it. If one were measuring readability of extended text, things like measure, typeface and leading would have to be included. I agree with you that these will prove important. But so will type design and letter spacing, IMHO.\n\n\"as measured in the lab\". Only some comparative tests have been done. I don't think there is as yet any real common measure of readability.\n\n"
    },
    {
      "time": "",
      "content": "Ah, studies… So called scientists doing what they have to do (publsih or be damned) — studies can deliver any answer needed. Or not. Studies have revealed a strong correllation of the birth rate and the presence of storks (Sweden), the fact that almost 100% of all murderers drank milk while young (makes you wonder!), and that smoking is not unhealthy (sponsored by a certain industry).\n\nNever trust studies — think for yourself.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Legalize Readability !\n\n"
    },
    {
      "time": "",
      "content": "\\>the fact that almost 100% of all murderers drank milk while young\n\nThat correlations are not proof of causality is in every text on the subject. Such conclusions are not accepted scientific method.\n\n\\>So called scientists doing what they have to do (publsih or be damned)...Never trust studies — think for yourself.\n\nOf course we should look at studies critically, but your post seems to indicate we should ignore all scientific research, because it is all corrupt. Is that what you are advocating?\n\n"
    },
    {
      "time": "",
      "content": "The credibility of the scientific method is damaged by typographic studies which produce results that ignore reality. Cultural, social, business, professional reality, that is, not reality as constructed in a laboratory.  \nWhen Arial is widely regarded as a 2nd-rate clone by professional typographers, who is going to take seriously a study which touts its readability? The marketing boffins who oversaw this project at Michigan should have been a little more circumspect about what they were getting into if they want to sell the relevance of their study. With a modicum of marketing savvy, or awareness of the culture of their subject, they would have hitched their research to the Helvetica bandwagon.\n\n"
    },
    {
      "time": "",
      "content": "\"What was wrong with the “exact type” in [the ClearView] study?\"  \nThe last time I asked, economics prevented anything but the most basic possible test of a single, basically handmade composition from a prototype font. A small group of drivers were then driven around the signs (the 'control of which was a particularly beat-up old Highway Gothic of PA), in a limited number, maybe even two conditions of light and weather, and asked questions. Does a huge x-ht help in all conditions? Is the tailed l always right in distant word shapes? Can and how will composers deal with an un-unitized product after all these years? Does Clearview actually work in all the layouts required with all the changes from Highway Gothic?\n\nSure something's been studied, but without having ever done anything even remotely similar to this, what makes you think either the studiers or the studyees were even on the right road, much less properly addressing fundamental issues of implementation? I take it then you agree on the MS studies.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "I don’t know. This just doesn’t seem constructive. I mean going to a designer/Mac-love-fest in Germany and criticizing Microsoft and the US Department of Transportation... Kind of like shooting fish in a barrel or wearing a Che Guevara t-shirt on a Cuban vacation. Is this what “conferencing” is all about?\n\n"
    },
    {
      "time": "",
      "content": "Thanks to Thomas for finding the actual study report. Unfortunately the popular press report missed the point of the study. Here is my summary:\n\nIn their first study the participants read instructions about an exercise program. The instructions were either written in an easy to read font (Arial 12) or a difficult to read font (Brush 12). The participants who read the instructions in the easy to read font reported that the exercise program would take less time and they would be more likely to take part in the program than the participants who read the instructions in the difficult to read font.\n\nIn their second study the participants read instructions about how to prepare a Japanese roll. The instructions were either written in an easy to read font (Arial 12) or a difficult to read font (Mistral 12). The participants who read the instructions in the easy to read font reported that the recipe would take less time to prepare and they would be more likely to try it than the participants who read the instructions in the difficult to read font.\n\n[http://sitemaker.umich.edu/norbert.schwarz/files/08\\_song\\_\\_\\_schwarz\\_effor...](http://web.archive.org/web/20100825012921/http:/sitemaker.umich.edu/norbert.schwarz/files/08_song___schwarz_effort_psychscie_in-press_30apr08.pdf \"http://sitemaker.umich.edu/norbert.schwarz/files/08\\_song\\_\\_\\_schwarz\\_effort\\_psychscie\\_in-press\\_30apr08.pdf\")\n\nTo me this is a perfectly reasonable demonstration that typeface selection is important. There isn’t anything to feel threatened by here.\n\nCheers, Kevin\n\n"
    },
    {
      "time": "",
      "content": "_...typeface selection is important...._\n\nThanks Kevin, that's good to know.\n\n"
    },
    {
      "time": "",
      "content": "_Elvis is easiest to imitate._\n\nBad journalism is easier to imitate.\n\n"
    },
    {
      "time": "",
      "content": "\"... criticizing Microsoft and the US Department of Transportation... \"  \nI don't criticize DOT(s), I use them too effectively  \n\"This just doesn’t seem constructive.\"  \nThen give it a rest, I'll take it from here.  \n\"Is this what “conferencing” is all about?\"  \nNot as far as I can tell. Most people seem to just want a \"get away\" to somewhere they can drink beer with fresh, like-minded beer drinkers, unless of course it is coffee time.\n\nWhich of the Microsoft type studies do you rank as the absolute 'top of the class'?\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "Does anybody actually \\*READ\\* these studies before criticizing them at great length based on bizarre snippets of media coverage? Have none of you been misquoted or had the media quote you oddly out of context?\n\nTo repeat what I posted on the ATypI list, with a couple of minor edits for clarity:\n\nIt turns out the actual studies (there were three related studies) are posted here:  \n [http://sitemaker.umich.edu/norbert.schwarz/files/08\\_song\\_\\_\\_schwarz\\_effor...](http://web.archive.org/web/20100825012921/http:/sitemaker.umich.edu/norbert.schwarz/files/08_song___schwarz_effort_psychscie_in-press_30apr08.pdf \"http://sitemaker.umich.edu/norbert.schwarz/files/08\\_song\\_\\_\\_schwarz\\_effort\\_psychscie\\_in-press\\_30apr08.pdf\")\n\nThe first study compared just Arial and Brush Script, used in restaurant menus. The second and third compared Arial and Mistral, used in recipes.\n\nYes, they found that Arial was more readable than Mistral or Brush Script, but the point was \\*not\\* to find the most readable font possible. They were trying to manipulate the readability as an independent variable, by using the font. That is, they needed a more readable font and a less readable font, in each study. The dependent variables were the conclusions people would draw about the content being changed by the ease of reading.\n\nSo, unless you think Mistral and/or Brush Script are in fact more readable than Arial, folks should not have problems with this study based on their beliefs about the legibility of different typefaces.\n\nHaving read the paper, I am reasonably convinced that they succeeded in measuring what they wanted to measure. The results of the first study would have been of dubious by itself, as one could argue that there were other plausible causes for the experimental outcome, which would be a result of the font but not based on simple difficulty of reading. But the second and third studies lead to a reasonably strong conclusion that their theory is correct.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "\"Does anybody actually \\*READ\\* these studies before criticizing them at great length based on bizarre snippets of media coverage?\"\n\nOf Course. Do you?\n\nKL: \"...typeface selection is important....  \nNS: Thanks Kevin, that’s good to know.\"\n\nBut it's not. Typeface selection is obviously an important subset of font specification but in this context can not be studied by itself toward any important goal. I could change one variable, (the sizes), and prove the Selection of Mistral over Arial. (I could also quite likely upset the results with exactly the same specimens they used.... by collecting a different extraordinarily small and narrowly aged audience!?\n\nAn upfront judgement of 'hard to read\" and \"easy to read\" was made, framed as a test, the results presented, and those who did the study proved that they could be slapped on the back by the subjects, for a well-done upfront judgement of 'hard to read\" and \"easy to read\". This study does not accomplish: more than proof of the (apparently not) obvious, or the education of those who study.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "_But it’s not._\n\nYou don't say.\n\n_unless you think Mistral and/or Brush Script are in fact more readable than Arial,_\n\nWhat David said.\n\n"
    },
    {
      "time": "",
      "content": "David, I haven't read the full studies on Clearview, but in the New York Times article they mention that they drove people toward the different signs in daylight and at night with headlights and noted at what distance they could read the names on the signs. And there were quite significant differences in the distances.\n\nI think I remember reading some report summaries also to this effect, but I don't have the links at the moment.\n\nThis kind of test seems pretty good to me, if carried out with proper controls.\n\n"
    },
    {
      "time": "",
      "content": "Actually, DB's comment is pretty meaningless.\n\nThe study was not trying to show that Arial was universally easier to read than (whichever script font). Just to study the effects of varying the ease of reading.\n\nIt's utterly irrelevant to these studies if one could vary other controlled variables, to make the script faces harder to read than the Arial. The question is, were they correct in their claim that under these particular conditions, Arial was easier to read? Their study seemed to show that was true, as a preparatory point towards looking at the effects of this.\n\nNow, there are other points of these studies worth critiquing. Could all the effects of the study been the effects of a more ornate/fancy typeface rather than ease of reading per se? If their conclusions were correct, one could repeat the study by using \\*only\\* Arial, and creating the \"harder to read\" condition by setting Arial at 6 or 7 point.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "\\>Actually, DB’s comment is pretty meaningless.\n\nIt pains me to see the help be rude to Berlow when he is the only person of real distinction in the type industry who contributes to Typophile. I'm a very rude person but I would never dare be rude to David. Admittedly he can be difficult to understand, but what sage isn't? Like many, every sentence he writes has got a whole paragraph, a whole page, a whole book behind it.\n\nAs far as I know, there has never in the entire history of type been a legibility study that would stand up to scientific scrutiny. The reason is that legibility problems have always been satisfactorily solved by people like Benton, Griffith, Carter, and Berlow.\n\n"
    },
    {
      "time": "",
      "content": "_Which of the Microsoft type studies do you rank as the absolute ’top of the class’?_  \nI’ll defend all of them if you’ll read them first.\n\n_I could change one variable, (the sizes), and prove the Selection of Mistral over Arial. (I could also quite likely upset the results with exactly the same specimens they used.... by collecting a different extraordinarily small and narrowly aged audience!?_\n\nFirst, Thomas’ comments are spot on that this is completely irrelevant to the point of Song & Schwarz's study. They were demonstrating that the perception of the font impacted the perception of the content. The specific fonts involved did not matter.\n\nSecond, you misunderstand how the scientific method works. Say for example that you’re right and you can change Mistral in some way, and you find that people thought that the exercise program would take less time. Does that invalidate the results? No. It extends the results and is exactly what should happen. Is there some narrowly aged audience that responds in a different way? That would be interesting to know too. That’s another extension.\n\nSong & Schwarz tested a theory and learned something about how readers respond under the specific conditions they defined. There is always more to be learned, and by writing a report about what they learned, they invited others to participate in the process. Everyone (including DB) is now welcome to run their own studies with 30 point Mistral on 14 year olds to better understand the reading experience.\n\n"
    },
    {
      "time": "",
      "content": "Bill, is it really required that you refer to somebody as the \"help\"? To me this denigrates whatever points you make afterwards.\n\nI make this point for a variety of reasons but the most important one is this: when a 3rd party has wades through Typophile discussions in search of an answer to a question they are interested in, or perhaps who thinks what on whatever topic, there ends up being a lot of chaff with the wheat when personal stuff is involved. Some of that is inevitable. But a lot of it isn't. I would sooner see Typophile be a more rather than less useful for us all.\n\nAnd really it would be good if we all kept that in mind - not just Bill.\n\nThanks!\n\n"
    },
    {
      "time": "",
      "content": "_Say for example that you’re right and you can change Mistral in some way, and you find that people thought that the exercise program would take less time. Does that invalidate the results?_\n\nPerhaps not, but it would still be a meaningless experiment.\n\nThis is a mistaken project from the get-go, designed to answer the question \"if we make something hard to read, will people think it describes something that's hard to do?\" But the actual test measures nothing of the sort.\n\nWhat if ease of \"legibility\" or \"readability\" has nothing to do with this? What if there is some other visual cue in typeface selection, such as, oh, I don't know, something a typographer might think of? Might it not be that a large x-height sans serif face communicates \"efficiency\", while a script type says \"slow down and smell the roses\"? What have these typographic qualities got to do with the \"ease with which...information can be processed\"?\n\n"
    },
    {
      "time": "",
      "content": "\"I’ll defend all of them if you’ll read them first.  \nI read plenty, but it's no longer on my agenda. With MS spending $1/2 billion to re-market Vista, I know.\n\n\"They were demonstrating that the perception of the font impacted the perception of the content. \"  \nThe perception of a child's _font specification_ impacted the perception of the content to children.\n\n\"Actually, DB’s comment is pretty meaningless.\"  \nAll of what you say goes on to more type specification, not selection. One is a subset of the other, and you cannot make a meaningful decision on style, without making a decision on size, (at LEAST).\n\nThis study made no meaningful contribution to what I know about type specification or selection. That being the case, I assure you anyone who learned from this is learning in the rong direction. Nothing personal, my mom went to Michigan, and I drew MS's Mistral.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "_Might it not be that a large x-height sans serif face communicates “efficiency”, while a script type says “slow down and smell the roses”?_\n\nExcellent, that’s another possible direction to extend these results. Thomas suggested comparing different sizes of Arial; or you could make two matching fonts that only differed in x-height. Either would be a way of looking at size differences without differences in type style. This extension does not make the original study mistaken or invalid in any way. If the extension provides a better interpretation of the results, people will adopt the better interpretation.\n\n_This study made no meaningful contribution to what I know about type specification or selection._\n\nGood, because this study was not about type specification or selection. This was about demonstrating that the perception of fonts impact the perception of content. I did find it surprising and interesting that people thought the same exercise program would be easier when they read about it Arial. Imagine that former Bush administration official is writing an autobiography and they want to appear more sympathetic and likable. Can a particular font choice help?\n\n"
    },
    {
      "time": "",
      "content": "What clearly dissatisfies some of us is how incremental and simple the results of these tests can be. We know the result before it's revealed. But there also seem to be a number of tests with flawed questions at their root, such as \"is my new font, designed specially for the blind, that I'm getting school credit for, more readable than an intricate, curlicued display font?\" The result might have integrity (why yes, this simple font based on Comic Sans is more readable than that scratchy, ambiguous display font), but the test itself doesn't; it's a foregone conclusion, and the design of the test is manipulated to give the desired result. Those tests are specious because they aren't objective, **and** they ask irrelevant questions.\n\nHowever, Nick and David, while I know what you know, and we know it, and it apparently is going to take until 2168 to accumulate enough empiric data to confirm it scientifically, what Kevin has said holds true: if an experiment asks a very simple question, and I'm sure you'll agree it's difficult to design these tests, we can actually get meaningful results. But the meaning and the import of the results is likely to be much more satisfying and consequential to someone who doesn't design type all day. It doesn't make the test false, or the question wrong, or the whole thing a load of poppycock, if we find the result boring or predictable.\n\nKevin is not disputing that it may be more interesting or revealing if we test other variables, like size and contrast and all the niceties that go into reading. But we're throwing the baby out with the bathwater if we dismiss every finding because it isn't sophisticated enough for us. Once a number of these results are assembled, a more nuanced and specific test can be designed that includes those parameters and takes into account the results already discovered. That's the scientific method. Reading is very complicated, and so many factors affect it, that of course it will take a long time for all those variables to be understood. Each one has to be isolated in a large testing situation and clear differences have to be demonstrated. Then there are the thousands of typefaces, the choice of which inevitably rubs people the wrong way.\n\nKevin, I think what is dissatisfying, over and above the slow, rudimentary progress in this area, is that here on Typophile, where type designers hang out, we often hear of these tests and ask, \"Why didn't they consult a typographer or type designer?\" Whether the testing is flawed or fierce, We hear about it after the fact. We can actually effect more speedy, substantial progress in this area if we are included in the process of designing these studies, but apparently we're invisible.\n\n"
    },
    {
      "time": "",
      "content": "_Can a particular font choice help?_\n\nThis is the kind of thing that graphic designers do for a living.  \nI'm shocked you have been working closely with type for several years and have no idea how it is used professionally.\n\n"
    },
    {
      "time": "",
      "content": "\"This was about demonstrating that the perception of fonts impact the perception of content.\"  \nOkay... name me the variables of how fonts impact the perception of content Kevlar.\n\nYou're seeing a demonstration that the use of bad selection and bad composition impacts the perception of content. The other comments that are made in the linked story, reinforce the bad turns/learns of this study.\n\nProper scientific method in type design, _gives you selection_, it's 'our' job to understand (and design) all the details involved in a careful dance with perception of content, including some that the guys and gals in the Michigan Business School might overlook from simple, honest, ignorance, **an excuse not available to professionals in the type business, _I'm afraid_**.\n\nThe type design method for developing the study we're discussing would be:  \n1. Compare Arian to Arial at the same size from the same device on the same paper. Skip the expected 50-50 results and change something.  \n2. Compare Arial to Mistral. Okay, you've made your one mistake, Arial has an inbred familiarity and Mistral not so much and definitely not for the desired perception of simplicity required of instructions for cooking or Ikea. If you make the mistake of not evening the x-heights, you are no longer testing perception of content. Period.  \n3. If you even out the x-heights, both fonts are legible, and you get correct results, (probably 70-30), and you learn\n\nFont selection impacts the perception of content, but if your composition has removed legibility. . . don't bother me with insisting on correctly testing perception of content.\n\nWhen one says something like this:  \n\"The easiest to read is the Arial (font),\" Song said.  \n...think on that: based on two fonts, and 25 or so late-teenage reactions, sound like type science to you?  \nI said before they learned nothing, what I should have said is they learned how to get attention at the expense of type and science in one swell foop.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "_Kevin, I think what is dissatisfying, over and above the slow, rudimentary progress in this area, is that here on Typophile, where type designers hang out, we often hear of these tests and ask, “Why didn’t they consult a typographer or type designer?” Whether the testing is flawed or fierce, We hear about it after the fact. We can actually effect more speedy, substantial progress in this area if we are included in the process of designing these studies, but apparently we’re invisible._\n\nI agree that this is a problem. Obviously whenever I talk to psychologists or anyone interested in studying typographic variables, I do my best to educate them about the field of typography and to get them to meet and talk to the typographers here (Mike Duggan and Geraldine Wade). But that is an incredibly small percentage of reading psychologists. Somehow we really need to get to a state where typographers and reading psychologists interact more frequently. Any ideas about how to make the field of typography less invisible?\n\n"
    },
    {
      "time": "",
      "content": "There's not much that will take the blinkers off the way scientists approach this subject.  \nIdeally, reading psychologists could learn typography.  \nHave you considered taking a degree in design?  \nThat would add an edge to your work, and set an example to your peers.\n\n"
    },
    {
      "time": "",
      "content": "Legibility problems are solved not by scientists, and certainly not by pseudo-scientists, but by a few genius type people who discover ways to put more words on less paper and still have most of us be able to read the stuff without noticing it. In the entire 20th century there were four or five such people, and that was enough. Who, now living, other than Berlow and Carter, has proven achievements in this field? And I'm sure Berlow would agree that Carter's grip on the mass vernacular is unrivalled. A font constructed by scientists for legibility would be one nobody would want to read. Legibility can't be separated from a panoply of factors of which style is not the least. To analyze this satisfactorily would cost a big chunk of the billion MS is investing in the Vista relaunching. Nobody's going to spend this because Carter and Berlow can be had for less.\n\n"
    },
    {
      "time": "",
      "content": "Bill, enough already with the Great Man theories.  \nNobody hits a home run every time they come to the plate.\n\n"
    },
    {
      "time": "",
      "content": "_This is the kind of thing that graphic designers do for a living.  \nI’m shocked you have been working closely with type for several years and have no idea how it is used professionally._\n\nImagine if you will that Dick Cheney is writing his autobiography, and he wants to appear as a likeable and sympathetic individual. Certainly he’s writing about all the good deeds he’s done in his life, like all the times he didn’t shoot someone in the face. When people are done reading his book, someone will go around asking the readers how sympathetic they are towards Dick Cheney.\n\nWhat specifically can be done with typography to make it so that more people are sympathetic towards him?\n\n"
    },
    {
      "time": "",
      "content": "<cite>What specifically can be done with typography to make it so that more people are sympathetic towards him?</cite>\n\nEducate the people that use it for a living. I am a graphic designer, and I will be the first to tell you that unless you have an honest interest in it, there isnt much obvious incentive to John Q Designer to learn. Personally, I am interested, and I strive to learn as much as I can to be a better typographer and in turn a better designer. Unfortunately, most designers coming out of school dont know the difference between Arial and Helvetica. You have no idea how many people I have worked with in my relatively short career who dont have the slightest clue what everyday glossary terms mean, like \"kern\", \"x-height\" and \"ligature\".\n\nLast year, we had a (short-lived) designer who thought it was appropriate to use \"Will & Grace\" for everything. Go ahead, say he was an idiot, we all think so. After he was let go, he got a job at MTV.\n\n"
    },
    {
      "time": "",
      "content": "<cite> enough already with the Great Man theories </cite>  \nI can't agree more. That they are great men I don't disagree about however. Different idea entirely!\n\nBill, the idea that scientists \\*want\\* to design a typeface is apocryphal. What they might do if we don't all scare them off is help us look into discrete issues one by one, with our help. I hope so anyway. Eventually I would like to see some testing to see if CALTs can help immersive reading. But before that can happen there are many other things that need to be tested so that protocols that we all\\* agree on can be in place. What DB is talking about is a good step. What I am not sure about is if like Nick, DB would prefer that science keep it's slimy finger out on principle or if he would like to see science done as long as it was grounded properly. What say you DB?\n\n\\* or enough of all of us...\n\nNick, for all I know Kevin has a degree in type design or Graphic design or some such thing. Have you read his CV? But even if he hasn't I have to take issue with the idea that that is the only measure. If Kevin gets it he does. Plenty of people with degrees don't...\n\n"
    },
    {
      "time": "",
      "content": "_What specifically can be done with typography to make it so that more people are sympathetic towards him?_\n\n ![](http://web.archive.org/web/20100825012921im_/http:/typophile.com/files/Rumsfeld_6643.jpg)\n  \nSomething like this, with gold embossing, captured the tone of a book one reviewer described as a \"doting paean\".  \nOr maybe that's where the reviewer got the idea.\n\nIn a book trashing the same subject, pretty much the same Garalde:\n\n ![](http://web.archive.org/web/20100825012921im_/http:/typophile.com/files/Rumsfeld2_6122.jpg)\n  \nIn fact, Garamond/Bembo seems to be some sort of Rumsfeld brand.  \n\n ![](http://web.archive.org/web/20100825012921im_/http:/typophile.com/files/Rumsfeld3_5736.jpg)\n\nIn the realm of affect, typeface choice is an artful business.  \nNot a direct correspondence, \"push typeface x to activate emotion y in citizen z\", but combining a typeface, with a picture, in a layout, with a type treatment, to create an overall impression.\n\n_\"...the perception of fonts impact[s] the perception of content\"_\n\nAs taught in first year Graphic Design. Spiekermann & Ginger's _Stop Stealing Sheep & find out how type works_ covers the same ground.\n\n"
    },
    {
      "time": "",
      "content": "Nick, this is an astonishing collection, I had no idea these books were being designed, or even written. I looked up the 2003(?) 'Pieces of Intelligence' and discovered to my surprise that its Amazon sales rank is appx 550,000. For control, I looked up my own 1998 'Film Developing Cookbook' which is years out of date and which I happen to know is only selling the merest trickle of 25-50 copies per month: its rank is appx 80,000. And it has a very ugly cover. If I think about the ultimate meaning of graphic design and type design and legibility design, I cannot avoid the weakly Marxist mindset that we are all the servants of economic or political lords who use us to maintain or increase their power. We, the servants (ich bin ein Diener, to echo Kafka) are a jolly people who seldom squabble except in places like Typophile, which is effectively our pub. The problem with the well-intentioned (well-intentioned, that is, if you are in the business of selling type) Stop Stealing Sheep is that layout -- as I think Berlow has hinted here -- is always more important than type itself. You could, in the end, achieve almost anything (effect or affect) with Times and Helvetica if you had to. You wouldn't want to. But a good layout person could. I wonder if Lissitzky was a nice guy? Ginger's business card, by the way, was set in metal Spectrum and contains a witty, lewd drawing of a Ginger-denominated 'girl editor'. I wish I had it handy to scan. It's by far the most artful business card I have ever seen.\n\nEben, how can CALT help immersive reading when it primarily seems to be used as a tool to justify poor reading ability in the US and UK at the very least? To what extent does the collapse of effective pedagogy represent the political will of these nations?\n\n"
    },
    {
      "time": "",
      "content": "Nick, if the title and content for those three books were the same, which would leave the readers most sympathetic towards Rumsfeld? The first one has the most sympathetic picture, but I don’t find the title typography to be sympathetic.\n\nSong & Schwarz’s study investigated body text. What can be done with the body text so people will report Rumsfeld as more sympathetic?\n\n"
    },
    {
      "time": "",
      "content": "\\>What can be done with the body text so people will report Rumsfeld as more sympathetic?\n\nSouvenir, Baby! Souvenir all the way! Despite its repugnance to typographers on grounds of taste, it's an incredibly well-designed typeface. Second choice, ITC Garamond MM, using an intermediate weight so you can get some meat on the text. ITC really had a feel for friendly. I don't believe it has been surpassed because few of us are willing to do anything so cringe-making. But they knew what they were doing - -\n\n"
    },
    {
      "time": "",
      "content": "The methodological weakness of the Song & Schwarz study is a weakness that is very common in the 'softer' sciences such as psychology and social science. It is that the theory they are testing is not well specified. And as a result it is not clear what lesson to take from the results.\n\nMy old teacher Popper used to say that an experiment is only as good as the theory that it is testing. If the theory that is being tested is not clearly and precisely specified, then the chances are that you don't learn a lot from the result.\n\nThe problem that typographers such as Nick Shinn and David Berlow are having here is that they know that there are so many more variables involved in readability than typeface. Since Song and Schwartz don't discuss these, it is not very clear what you can conclude from the study.\n\nAlso note that they asked about the readability of the typeface \\*after\\* they had done the reading and got answers on how difficult they expected the task specified would be. This is a problem. I know from doing simple surveys of satisfaction with courses I have taught that if a person likes the course, they are likely to be positive about everything, and if they are negative, negative about everything. The respondents can't necessarily separate out very well what they are responding to.\n\nAlso note that people may perceive 'readability' of the simplest sans forms as being most readable, but that perception may be based on impression of individual letters or words, and may not necessarily reflect actually readability of extended text as far as ease, speed and comprehension. The subject guessing is about readability, not giving an objective result.\n\nSo with these confounding factors, what they found is only this: post-hoc feelings about typefaces of these sizes, fonts and layout, and post-hoc feelings about ease of task described went together.\n\nSo is this a somewhat interesting confirmation that typography matters? Yes. Is it clear exactly what this study means? Not really. Not a great study, and not a dreadful one either. Just so-so.\n\n"
    },
    {
      "time": "",
      "content": "\\>but that perception does not necessarily reflect readability of extended text as far as ease, speed and comprehension.\n\nExactly, William. These people don't even distinguish between what I call legibility for the minute and legibility for the hour. William, did you really study with Popper? How fantastic! In London?\n\n"
    },
    {
      "time": "",
      "content": "I was fixing my sentences and my post got out of order with Bill Troop's. Yes I did my PhD in History & Philosophy of Science under Popper at the LSE from 1965-70.\n\n"
    },
    {
      "time": "",
      "content": "Kevin, no doubt you would like to find a simple cause and effect relationship between the elements of design and the reader, something that can be measured and turned into a formula. Push button A to trigger emotion B in citizen C. But graphic design doesn't work like. Science has been applied to print marketing since the early 20th century (eg Daniel Starch), but ad campaigns are still conceived by creatives, not \"suits\" or technicians. Yet scientists and engineers soldier on, under the assumption that their forbears just weren't good enough and the solution is just around the corner in our high tech world (as if every age is not high tech). But what if some things are just not susceptible to such means?\n\nThese Rumsfeld book covers show that the same typeface may be used to different ends, but not because the choice of typeface is immaterial. Whether something like the Decter cover comes across as a dignified celebration or a transparent puff piece is a complex issue.\n\n_What can be done with the body text so people will report Rumsfeld as more sympathetic?_\n\nWhy would you want to make typography such a direct tool of propaganda, even if it were possible?\n\n"
    },
    {
      "time": "",
      "content": "\\>Why would you want to make typography such a direct tool of propaganda, even if it were possible?\n\nBecause that is all that any of us in graphic design can do -- either directly or indirectly. Unless we're William Morris.\n\nWhat difference if we're controlled directly (a book about Rumsfeld) or indirectly (a book about flowers) (the book about flowers from the same conglomerate that publishes Rumsfeld; it's subsidized by Rumsfeld)\n\nAnything can be used by anybody for any purpose -- what is the point of worrying about it?\n\nA memorable illustration from the hand of the master of the double meaning occurs when Freud is permitted to leave Vienna for London in 1938. The Nazis require Freud to sign a document stating that he has been well treated by them. He signs it, adding, 'I can most highly recommend the Gestapo to everyone.' With one sentence Freud accomplishes the almost miraculous task of pleasing both the Nazis and posterity.\n\n"
    },
    {
      "time": "",
      "content": "Bill [Berkson] -- _Also note that they asked about the readability of the typeface \\*after\\* they had done the reading and got answers on how difficult they expected the task specified would be. This is a problem. [...] So with these confounding factors, what they found is only this: post-hoc feelings about typefaces of these sizes, fonts and layout, and post-hoc feelings about ease of task described went together._\n\nIn my reading, this was not a usual readability test (as is suggested by the unfortunate title). Rather, it aimed at demonstrating that human activities or judgement are influenced by minute aspects that are unrelated to the activity or subject-matter of the judgement and normally go unnoticed. In this case, demonstrate that choice of a typeface (which most of the time is something readers are not aware of) influences whether people consider a task described (recipe set in one or another typeface) as harder or easier to perform.  \nIn this respect, what you consider confounding is the strength of the test: It does _not_ make participants aware of the minute aspect. This is an essential part of the test. In my opinion, they should not have mentioned typefaces at all in their questions.  \nBut it would have been more interesting with a more subtle choice of typefaces. Arial and Mistral are so obviously different that participants may have noticed what the test was \"really\" about even without being told ...\n\n"
    },
    {
      "time": "",
      "content": "_Because that is all that any of us in graphic design can do — either directly or indirectly._\n\nNo, marketers don't carry out direct propaganda, technically executed, in the way that a doctor may effect a change in mental condition with a psychoactive pill, and that's certainly not the way that graphic design is taught or works professionally.\n\n"
    },
    {
      "time": "",
      "content": "Karsten, in order to do this right, you would have to test for readability independently from the question of difficulty of task.\n\nThe problem I mentioned is a genuine one. There would be others with asking before hand.\n\nThe fundamental thing is that you would need a more objective test of readability. Then the report of subjective experience of difficulty of the task would be more meaningful--you would know what it really indicates.\n\n"
    },
    {
      "time": "",
      "content": "So you mean, it would take at least two tests: one to determine which type is more readable than the other; another to apply this result to define the setting for the test we are talking about. (Rather than taking for granted Arial is \"easier to read\" than Mistral.)\n\n"
    },
    {
      "time": "",
      "content": "Yes, that's it. The problem is that a general test of readability of extended text that yields a good measure has not been done yet, to my knowledge.\n\n"
    },
    {
      "time": "",
      "content": "Nick let's discuss the politics of GD sometime else so we don't derail the readability topic. Though readability can get plenty political if you think of the transition away from Fraktur. Does anyone read Ovink anymore?\n\n"
    },
    {
      "time": "",
      "content": "What kind of CALT are you talking about Bill (T)? I was talking about contextual Alternatives in an Opentype font. Maybe opentype CALTS have been in some way associated by someone with \"poor reading ability\" but I've never heard of such a thing. I think we must have crossed wires.\n\n"
    },
    {
      "time": "",
      "content": "Bill, I'm not interested in talking about historical propaganda.  \nThe point I'm making is that graphic design and typography are merely persuasive, there is no hidden coercive mechanism as Kevin seems to think.\n\nWhen I was designing book covers, I would present a succession of comps to my client, a creative director at a publishing company. She would look at them for a split second: \"no, no, maybe, no, no, no, yes\". And when she presented comps to her boss, the process would be the same. She was not in the target market, yet she knew instinctively, through experience, what would work and what wouldn't. The sought-after reaction from book buyers was not something as vague and visceral as \"sympathy\", but \"this is the sort of book I'd like to read\", and that was a very specific promise which had to be kept. What we discussed was stuff like \"this book is a romantic whodunit set in a small town, does this design nail that genre?\"\n\n ![](http://web.archive.org/web/20100825012921im_/http:/typophile.com/files/Falls_4533.png)\n  \nThis concerns the suggestive powers of typography, or how \"the perception of fonts impacts the perception of content\". But what kind of cognitive science can explain why one of these type treatments conveys the genre and the other doesn't? (The one on the left is indeed the romantic whodunit set in a small town, as published.) How about memory theory, in particular the exemplar model of categorization, which I came across in chapter five of _This is Your Brain on Music._\n\nThe text of the _The Falls_ was set in Times, long a mainstay of trade paperbacks.\n\n"
    },
    {
      "time": "",
      "content": "When it comes to reading and interpreting the nexus between Type and the always shifting visual culture of the moment - that is at it's core a cultural job. You will get no argument from me about a role for science there. Maybe some polling. Or focus groups. But hopefully not. Those things are not so much science so much as they are a tool for getting some spare CYA.\n\n"
    },
    {
      "time": "",
      "content": "\"I do my best to educate them about the field of typography...\"  \nSo obviously you don't mind when I educate them on Science.\n\n\"...and to get them to meet and talk to the typographers here (Mike Duggan and Geraldine Wade).\"  \n... that's how all the specimens disappear in the end.\n\n\"Any ideas about how to make the field of typography less invisible?\"\n\nTo quote something Microsoft Word once said to me, \"We've reached and imp ass\".\n\nUntil the leaves change, So long!\n\n"
    }
  ]
}
