{
  "id": "4630",
  "title": "Wordspace v line length",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello, everyone. This is my first post, but   \nI thought I would kick off with something   \nthat I'm sure everyone has an opinion on.   \nI'm investgating type spaces for my MA, in   \nparticular the idea that longer lines of   \ntype need a bigger wordspace. Erik Spiekermann   \nadvances this idea in 'Stop Stealing Sheep',   \nbut doesn't really give a reason to back it   \nup. I feel as if it ought to be true, and can   \nsee it on a visceral level, but I wondered   \nif anyone had any empirical evidence or   \nreasons to support\n\n [‹ Arabic Fonts -- How To Make Them Work in Adobe Illustrator &amp; Photo-Editing Progs?](http://web.archive.org/web/20071103234432/http:/typophile.com/node/4661 \"Go to previous forum topic\") [BBC radio on UK traffic sign design ›](http://web.archive.org/web/20071103234432/http:/typophile.com/node/4638 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071103234432/http://typophile.com/user/3317\" title=\"View user profile.\">typofoto</a>",
  "time": "<br>",
  "uid": "3317",
  "comments": [
    {
      "time": " 6.May.2004 11.48am",
      "content": "There are so many variables involved, I don't think it's possible to isolate one. If you were to conduct a thoroughly empirical experiment, you would vary word space against each of these in multiple combinations:   \n   \n-line length   \n-type size   \n-type style   \n-type face   \n-type weight   \n-tracking (letterspacing)   \n-leading   \n-word length   \n-language   \n-ink color/paper stock   \n   \nand that's just in the type specs. You would also have to vary text, and readers' age, education, sex, etc.,, and the reading environment, if you wanted to come up with a legitimate general principle.   \n   \nYou could however focus on a specific relationship. One that concerns me as a type designer is the amount of contiguous white space in glyphs: for instance, consider a word ending in \"t\" and the following space: the \"t\" in Helvetica has two protusions on the right, the \"t\" in Futura just one. how does this affect the size of the following word space? The experiment would involve designing a typeface with alternate versions of the t, and seeing how that effected word space. Another thing to vary is the amount of protrusion of the crossbar in f, and t, and the arm in \"r\".\n\n"
    },
    {
      "time": " 7.May.2004 2.46am",
      "content": "Thanks Nick,   \nyou read my mind. I'm in the process of designing   \nsome sort of visual demonstration of typographic   \nvariables, comparing one against the other. I was   \nsticking to line length, wordspace, global letter-   \nspacing (tracking) and type size, although now   \nyou mention ink colour and paper stock, I wonder   \nif I can integrate that. Hum.   \n   \nYou mention word length, which is interesting.   \nI was assuming, because a word is usually   \nbigger than a wordspace, that as the length of   \na line increases, the amount of printed area   \nin the line increases more quickly than the   \nunprinted area, and this is why the wordspace   \nshould be increased. But this is a very   \ntentative supposition, and I've been trying   \nfruitlessly to prove it to myself mathematically.   \nI think I might be on a fool's errand ...   \n   \nThe wordspace in relation to specific glyphs   \nis also something I've been thinking about in   \na very fuzzy way. I tend to see it in relation   \nto the end of one sentence and a following   \nsentence starting with \"T\", which is pretty   \ncommon. Sometimes it can get quite gappy,   \ndepending on the font.   \n   \nThanks again for your help, you've made me   \nthink about the problem differently. I was   \ngetting pretty blinkered.\n\n"
    },
    {
      "time": " 7.May.2004 5.18am",
      "content": "\\>the amount of printed area   \nin the line increases more quickly than the   \nunprinted area, and this is why the wordspace   \nshould be increased.   \n   \nI don't know the answers here, but it seems to me more than one goal and standard is involved. For example, increasing word space in longer lines may help evenness of color, an aesthetic consideration, but may harm readability, which is influenced by consistency of rhythm of the letters and spaces.   \n   \nIn 'The Finer Points in Spacing' Dowding gives convincing examples of where excessive word spacing hurts readability, because the eye doesn't hold to the line of text as easily. On the other hand, his own word spaces to my eye are so pinched that they make reading more difficult.   \n   \nGood luck on your research & do post your results!\n\n"
    },
    {
      "time": " 7.May.2004 6.51am",
      "content": "\\> On the other hand, his own word spaces to my   \neye are so pinched that they make reading more   \ndifficult.   \n   \nAmen to that. I think his love of tight spacing   \nturned into a bit of a self-defeating fetish.   \n   \nWhen I have something worth looking at I'll   \npost them. This will probably take me a few   \nweeks though.\n\n"
    },
    {
      "time": " 7.May.2004 12.42pm",
      "content": "Your topic is very interesting. I'd love to read the final piece. My first attempt at an essay when working on my MA was about how space is used in typographic design. While the essay itself is absolutely full of flaws, perhaps my bibliography might lead in some new directions.   \n   \n---   \n   \nBibliography   \n   \nBringhurst, Robert _The Elements of Typographic Style._ 2nd edn.   \nCanada: Hartley & Marks, 1999.   \n   \nDowding, Geoffrey _Finer Points in the Spacing and Arranging of Type._ 2nd edn.   \n   \nGerstner, Karl _Compendium for Literates._   \n Cambridge, Massachusetts: MIT Press, 1974.   \n   \nGerstner, Karl _Designing Programmes._   \n London: Alec Tiranti Ltd., 1964.   \n   \nHartley, James i{Designing Instructional Text.} 3rd edn.   \n London: Kogan Page, 1994.   \n   \nKunz, Willi _Typography: Macro+ and Micro-aesthetics._   \n Switzerland: Verlag Niggli AG, 1998.   \n   \nMorison, Stanley _First Principles of Typography._ 2nd edn.   \n Leiden: Academic Press Leiden, 1996.   \n   \nSchriver, Karen A. _Dynamics in Document Design._   \n U.S.A.: Katherine Schowalter, 1997.   \n   \nSpencer, Herbert i{The Visable Word.} 2nd edn.   \n London: Lund Humphries, 1969.   \n   \nSpiekermann, Eric and Ginger, E.M. _Stop Stealing Sheep & find out how type works._   \n California: Adobe Press, 1993.   \n   \nSykes, J.B. ed. _The Concise Oxford Dictionary (of Current English)_ 7th edn.   \n Oxford: Oxford University Press, 1982.   \n   \nTschichold, Jan _Asymmetric Typography._ Trans. Ruari McLean.   \n London: Faber & Faber Limited, 1967.   \n   \nTwyman, Michael\n\n"
    },
    {
      "time": " 10.May.2004 3.56am",
      "content": "Thank you Tiffany. I love that Karl Gerstner.   \nAm I correct in thinking you went to Reading?   \nCos that's where I am.   \n   \nI realised over the weekend that my project   \nhas two threads, a theoretical one and a   \nmore practical one. I'm trying to design a   \nway of showing three type space variables   \nagainst one another. Wish me luck!   \n   \nYou're all invited to the graduation show,   \nby the way. It's in the middle of June.\n\n"
    },
    {
      "time": " 11.May.2004 10.47am",
      "content": "Alex, this is indeed a great topic.   \n   \nPatterson and Tinker did a lot of solid empirical research in the 50s and 60s, but I don't remember anything specific about word spaces (you might check). As Nick says, the massive inter-relation of variables is very daunting. And I agree with William too: I have my doubts about making word spaces longer in proportion to line length. It might actually do more harm, not just in the way William notes, but also because the longer the line the more you depend on the leading to find your way back to the beginning of the next line, and bigger word spaces make that harder. Lastly, the more horizontal room a line takes the slower the reading.   \n   \nIf Spiekermann would give a reason, we could analyze it - maybe there's something I'm missing?   \n   \nhhp\n\n"
    },
    {
      "time": " 11.May.2004 11.58am",
      "content": "Hello Hrant,   \n   \nthanks for the Patterson Tinker information, I'll   \ngo and have a look at that. As for the wordspace/   \nline length conundrum, maybe I'm looking at it in   \nthe wrong way. Perhaps it's more helpful to see it   \nas shorter lines having smaller wordspaces. I can   \nsee how this might be the case on a newspaper,   \nfor example, where short lines with minimal   \nleading necessitate tighter horizontal spacing to   \nmaintain a more coherent horizontality. Whether   \nthere's more to it than economic necessity though,   \nI don't know.   \n   \nI can't help wondering if Erik Spiekermann's   \nposition is one of principle rather than   \npracticality. Having said that, when I look at   \nthe end of my previous post and compare it to   \nthe longer lines of your post, my post seems more   \ngappy. I don't know anymore whether or not I'm   \nseeing things because I want them to be true.   \nI've spent too long thinking about this problem   \n : )\n\n"
    },
    {
      "time": " 11.May.2004 12.22pm",
      "content": "Alex, as you are doing research on this I think Erik Spiekermann would explain to you at greater length the reasons behind his views. This could well give you information that will help you in testing his idea. It can't hurt to e-mail him a request through his web site.\n\n"
    },
    {
      "time": " 11.May.2004 2.54pm",
      "content": "It recently occurred to me that there is another factor involved in word spacing: kerning.   \n   \nWhen you have a word starting with a \"needs kerning\" combination of characters, it requires a certain amount of word-space preceding it, in order that the first letter doesn't look like a single word. This is particularly apparent for the nasties: T,V,W and Y followed by a round lowercase letter.   \n   \nHence the huge spacing in 19thC typography.   \n   \nIn a tightly fitted and kerned face, you can even put kerning between the space character and letters such as A,T,W,W,Y, and period and comma.\n\n"
    },
    {
      "time": " 11.May.2004 9.43pm",
      "content": "\"Hence the huge spacing in 19thC typography.\"   \n   \nNick,   \n   \nI just saw notice of your Punch article on the SHARP-L list. Think it was SHARP. Skimmed it real quick and bookmarked it. But...   \n   \nMy understanding of the reason for hugh spacing in that very maligned and misunderstood century was that at some point comps were getting paid by the nut quad, therefore, more incentive to nut it out. Not really an aesthetic or technical choice. True or false? Or, you know, somewhere in between.   \n   \nGerald\n\n"
    },
    {
      "time": " 11.May.2004 11.21pm",
      "content": "I think if your line gets to the point that it needs additional word spacing to be legible your line is too long and you should redesign. Long lines, big word spacing = swiss cheese.\n\n"
    }
  ]
}
