{
  "id": "46317",
  "title": "Unsimplified Chinese",
  "forum": "Jongseong's blog",
  "tags": [

  ],
  "content": "I just came across the results of the 4th Founder Award Competition in Chinese type design, which can be seen [here (in Chinese)](http://web.archive.org/web/20111108075216/http:/www.foundertype.com.cn/ztds_4_zpzs.htm). There are also critiques in English by Akira Kobayashi on some of the entries.\n\nThere are lots of good entries, but one that caught my eye was this an effort by Wang Tianjia (王天甲), titled \"Chinese Characters Squared (汉字的平方)\". Or at least that's what I think it means; I don't speak Chinese, so I'm relying on my knowledge of Chinese characters and a dictionary.\n\n ![](http://web.archive.org/web/20111108075216im_/http:/typophile.com/files/4zpzs_yxj_13_3731.jpg)\n\nAt first glance, it seems pretty normal, having a somewhat complicated look, like a text set in traditional Chinese. But for those who can read Chinese, what's amazing about this is that it is in fact simplified Chinese, but many of the elements of the glyphs have been multiplied--two strokes where there should be one, three where there should be two. Wang has created something like the effects of double vision, but disguised in a way that still looks sensibly like regular Chinese characters. It's something like unsimplified Chinese. Quite imaginative.\n\nFor comparison, here is another entry for the competition showing how the same exact characters _should_ look.\n\n ![](http://web.archive.org/web/20111108075216im_/http:/typophile.com/files/4zpzs_11_4516.jpg)\n\n",
  "author": "<a href=\"/web/20111108075216/http://typophile.com/user/12009\" title=\"View user profile.\">Jongseong</a>",
  "time": "<br>",
  "uid": "12009",
  "comments": [
    {
      "time": "",
      "content": "Indeed very amazing!\n\nNot being trainedin Chinese, I wonder whether the letters, especially whole texts are immediately readable by a native reader of simplified Chinese, or would readability suffer, be reduced to \"being able to spell it out\" instead of reading it fluently.  \nSo would that qualify as a decorative font only, or also as text-font?\n\nSzabolcs\n\n"
    },
    {
      "time": "",
      "content": "Definitely a decorative font.\n\nBut it's surprisingly readable. At least, I don't think a native Chinese reader would have any trouble reading passages like this, any more than a native English reader would have any trouble reading something set in the more experimental but successful display faces. (It would really have to be a passage of more than just a couple of characters so that the concept of the design is apparent, since just a couple of characters in isolation would just puzzle the native Chinese reader.)\n\nBeing Korean, I myself don't read Chinese, but I'm familiar enough with the characters to recognize most and even to read a few. It would be nice to get an opinion from a native Chinese reader, though.\n\n"
    },
    {
      "time": "",
      "content": "Although it was in a very unrefined and “nervous” way (and some letters are not so good…), many years ago I did a Latin typeface with a similar treatment. It's called \"Inexpressed\":  \n [http://www.identifont.com/show?1B1](http://web.archive.org/web/20111108075216/http:/www.identifont.com/show?1B1 \"http://www.identifont.com/show?1B1\")  \nWang Tianjia's effort looks very good!\n\n"
    },
    {
      "time": "",
      "content": "I asked my wife, who reads Chinese, to look at this, and though she could read it she found it very disturbing, \"like seeing double\".\n\n"
    },
    {
      "time": "",
      "content": "Yes, it gave me motion sickness when I tried to read them. Not so cool if you can read the language…\n\n"
    },
    {
      "time": "",
      "content": "I think I see what you mean. It's like your brain is telling you that you're seeing afterimages of a violent shock, but it's settled that way permanently.\n\n"
    }
  ]
}
