{
  "id": "46367",
  "title": "Type and Grammar",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does a typographer _need_ to have a solid understanding of grammar?\n\nI think so. I used to work as an editorial assistant for a number of magazines, and now that I am doing graphic design, I am seeing the importance of marrying my knowledge of these two “elitist” trades.\n\nI am not a grammar pro, and I know I have lots to learn in regards to type; still I think that applying these knowledge bases in tandem makes one a better type user.\n\nWhat do you think??\n\nEvan  \n [evanmade.com](http://web.archive.org/web/20080907012623/http:/evanmade.com/)\n\n [‹ Letterpress Typeface Suggestions Needed](http://web.archive.org/web/20080907012623/http:/www.typophile.com/node/46368 \"Go to previous forum topic\") [iPhone/iPod Touch Typophile Icon? ›](http://web.archive.org/web/20080907012623/http:/www.typophile.com/node/46377 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907012623/http://www.typophile.com/user/31931\" title=\"View user profile.\">macursus</a>",
  "time": "<br>",
  "uid": "31931",
  "comments": [
    {
      "time": " 12.Jun.2008 10.35am",
      "content": "Historically, no. I’d guess the workflow would have been author - editor - typesetter - proofreader, with grammar checking being the job of the editor? These days I wonder how many clients would appreciate having their grammar corrected by a designer? Not none? ;-)\n\n"
    },
    {
      "time": " 12.Jun.2008 10.35am",
      "content": "“<cite>Need</cite>” have a solid understanding of grammar? Probably not, but editors and designers both make mistakes. Having a basic idea of what the other guy’s job is about can help keep them to a minimum. Having a CMS on hand is even better. Knowing it intimately is better still.\n\nAnd that being said, watch out for egos. No one likes to hear that they’ve contributed errors, even if there’s still time to fix them.\n\n"
    },
    {
      "time": " 12.Jun.2008 10.43am",
      "content": "It’s pretty helpful for not butchering copy when using it for pull quotes. Or if you write your own ad copy. Aside from that, I’ve grammar is best left to the editors so that they can deal with the authors.\n\n"
    },
    {
      "time": " 12.Jun.2008 10.45am",
      "content": "A good typographer should be able to spell, should be able to parse out a sentence, should know principles of punctuation and syntax. A good typographer needs to know how language works, not just what it looks like. If we know how words work, we can make them look better and allow people to read them with greater ease.\n\n& a good typographer also needs to know how far to push the points about grammar he or she wishes to make to editors or copywriters. Be straightforward and steadfast when suggesting changes. Have evidence to back you up. & know when to fold ’em. Nasty turf wars can ensue otherwise. We do not need that; our jobs are tough enough. If you know you have made a good case for good grammar you shall sleep the sleep of the blessed. Even if they reject your ideas and mutter behind your back.\n\n& don’t go around changing copy on your own. Always check.\n\npowers\n\n"
    },
    {
      "time": " 12.Jun.2008 11.13am",
      "content": "I echo what Will says. I think it is useful to be well acquainted with standards and techniques of good writing, as well as good typesetting.\n\nKnow your boundaries, however, and tread carefully into the editorial realm. Be sure of your footing. There is room to gain respect from editors, and that provides the currency for constructive conversations. But it has to be earned. You have to decide (or learn) if you have what it takes to play that game.\n\nBut I don’t feel it’s an absolute requirement for a good typographer.\n\nGenerally speaking, a helpful typographer will serve better as a proofreader (i.e. catching out-and-out mistakes and inconsistencies) rather than as a copyeditor (i.e., suggesting rewrites and changes). That said, I come from a family of writers and editors and sometimes engage my editorial colleagues at that level.\n\nOn the flip side of this coin, however, is learning to give respect to and accept feedback from editors who likewise choose to educate themselves on graphic and typographic issues. The shoe is sometimes on the other foot, remember.\n\n"
    },
    {
      "time": " 12.Jun.2008 2.27pm",
      "content": "Will, that’s an excellent description.\n\nJust today I checked on our intern’s progress on a poetry book, and, while he’s typographically well educated by now, I managed to point out a few errors — by the author. Pretty minor ones, though; things such as “the quote before _’Twas_ should be a closing one”. And “there should be three dots in an ellipsis — not two or four”.\n\nPretty basic stuff, which could and/or should be picked up by a text editor — if there is one! (There wasn’t for this project.)\n\n<cite>&amp; don’t go around changing copy on your own. Always check.</cite>\n\n— which I told him when he pointed out an error he saw all of his own, a misshapen sentence with dangling nouns and all. It being a poetry book, I tol’im, “You can’t always win. Leave that one to the author.”\n\nFor a scientific book, I don’t hesitate to correct all and any spelling and grammar errors I happen to notice. Those professors clearly had something else on their mind than proper spelling :-)  \nAnd for really rough cases, I draw a large red rectangle around the offending text, with a side note “Typesetter’s notice: please check”. At that point, it’s up to them to ignore.\n\nWhere can we download the [Design Police stickers](http://web.archive.org/web/20080907012623/http:/www.design-police.org/) as proper PDF stamps? At least the “Hire a copywriter” and “Run the spellcheck” ones!\n\n"
    },
    {
      "time": " 12.Jun.2008 2.51pm",
      "content": "It’s not essential but it sure helps. I’ve had many editors say they like working with me because I have a good editorial sense. That’s more than grammar of course, but I do pick stuff up and they appreciate that. Likewise I like working with editors who have a good visual sense.\n\n"
    },
    {
      "time": " 12.Jun.2008 3.04pm",
      "content": "Also, knowing editorial marks can’t be discounted. It is fairly specialized and most editors take serious time to clearly mark everything they need fixed. If you can pick up on a style and help with consistency all the better.\n\n"
    },
    {
      "time": " 12.Jun.2008 8.30pm",
      "content": "I think Will put it well.\n\nI suppose that in posting this I was referring to times when the type is linked to the grammar; ellipsis (3 periods with a space in between each one), an em dash (no spaces on each side like an en dash), rules of case, and so on.\n\nI think this is comparable to the benefit a graphic designer has when he/she knows something about photography. I am not a photographer [(sometimes I wish)](http://web.archive.org/web/20080907012623/http:/evanmade.com/visualart.asp \"some of my photography\"), but I know a little about it, and it helps.\n\nWill summed it up with, “A good typographer needs to know how language works, not just what it looks like.”\n\nGood thoughts overall.\n\nCheers  \nevan  \n [www.evanmade.com](http://web.archive.org/web/20080907012623/http:/evanmade.com/)\n\n"
    }
  ]
}
