{
  "id": "46370",
  "title": "Some questions about \"first\" uses",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "These might be slightly hard questions and prone for debate, but I just want to get a sense of years and designers involved.\n\nWhich were the first type families to formally and officially include **a)** bold weights **b)** italic versions and **c)** condensed and extended versions?\n\nHow groundbreaking was Univers in selling the packaged type family that included different weights and widths? Were there others before it?\n\nHopefully these are not too open-ended either.\n\n [‹ Article on Time about typefaces on restaurant Menus](http://web.archive.org/web/20081203163452/http:/www.typophile.com/node/46485 \"Go to previous forum topic\") [Fun New Typo term ›](http://web.archive.org/web/20081203163452/http:/www.typophile.com/node/46403 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203163452/http://www.typophile.com/user/1996\" title=\"View user profile.\">armin</a>",
  "time": "<br>",
  "uid": "1996",
  "comments": [
    {
      "time": " 12.Jun.2008 12.24pm",
      "content": "The first families were the work T. L. Devinne was doing around 1899, details are on pages 47 and 48 of Southall’s _Printer’s Type in the Twentieth Century_. IIRC Stanley Morrison was also grouping existing types around the same time. ATF started using the term family in the early 1900s, the oldest specimen I have verified this in was the 1912 book.\n\nRegarding Univers, what made the Univers package important was not what was offered, families like Cheltenham and Akzidenz were already doing that. What made Univers so special was that the whole family was planned from the start rather than releasing a few weights and later (inconsistently) designing more fonts based on demand from printers (although it did take several years for all of the fonts to hit the market, the release was not simultaneous). Univers was also released simultaneously for metal and photocomposition and available for license to anyone, another reason it was a big hit with designers. I think that Sebastian Carter wrote a detailed account in _Twentieth-Century Type Designers_, but my notes are missing so it might be elsewhere.\n\n"
    },
    {
      "time": " 12.Jun.2008 12.51pm",
      "content": "This from the Moore Type Foundry, Catalog No. 8, Toronto, 1929.\n\n ![](http://web.archive.org/web/20081203163452im_/http:/www.typophile.com/files/moore2_4148.jpg)\n\n"
    },
    {
      "time": " 12.Jun.2008 1.58pm",
      "content": "Here’s the Cheltenham family in use, 1905, one ad set in many styles.\n\n ![](http://web.archive.org/web/20081203163452im_/http:/www.typophile.com/files/fall1_5783.jpg)\n  \n\n ![](http://web.archive.org/web/20081203163452im_/http:/www.typophile.com/files/fall2_3844.jpg)\n\nConceptually, Clarendon had always been used as a bold modern. This from the 1870s (note the “ack” - “ack” in particular):\n\n ![](http://web.archive.org/web/20081203163452im_/http:/www.typophile.com/files/cadbury_5647.jpg)\n\n"
    },
    {
      "time": " 13.Jun.2008 6.33am",
      "content": "Thanks for the scans Nick.  \nAnd thanks for the info James.\n\nWhat about condensed fonts? The woodtypes of the 19th century are probably the earliest examples of typefaces with similar design traits produced in various widths to accommodate all those crazy type posters we love so much, but were those typefaces considered a family? Or just independent stacks of letters? Who was the first to, as you say James, plan a condensed version from the start?\n\n"
    },
    {
      "time": " 13.Jun.2008 8.16am",
      "content": "The first design with multiple widths (but only one weight) that Lawson mentions is Alternate Gothic. Linotype lists Alternate Gothic as dating to 1903, so it could be the one. Dates for what was going on in Europe at this time are murky at best, which is probably why they don’t get mentioned much, but it would be worth asking James Mosley if he knows of an earlier example from that side of the pond.\n\nIf you lump News Gothic and Lightline gothic together they might be the first example of a design being planned with a mix of weights and widths. New Gothic had one weight in three widths, lightline being the light weight in one width with a heavier all-caps titling font. These were introduced in 1908, and Linotype does not mention additions prior to 1958. I don’t know why Lightline wasn’t marketed as a light News Gothic, as there are only minor noticeable changes in a few minuscules.\n\n"
    },
    {
      "time": " 13.Jun.2008 8.21am",
      "content": "As for your question about the wood types of the 19th century, they weren’t being marketed as families. They would have been sold as Gothic No.1, Gothic No. 2, Caslon Uber-Sized, etc.. They were probably not designed together; display types were so popular with typefounders in this period not only because printers liked them but also because it was cheap to just design one font (with limited character sets) at a time.\n\n"
    },
    {
      "time": " 13.Jun.2008 8.50am",
      "content": "M.F. Benton’s original Franklin Gothic would have been around the same time as Alternate Gothic (Nos. 1, 2, & 3) and News Gothic/Lightline Gothic. The original three fonts were normal width, Condensed, and Extra Condensed (I think those were the designations — I don’t have my ATF with me right this minute). I’ll double-check dates later when I get home.\n\nAlso, the Cheltenham family, which James and Nick mentioned a couple times already, was designed and released with condensed widths integrated pretty much from the get-go. Also the same basic time period. Also ATF & MF Benton.\n\n— K.\n\n"
    },
    {
      "time": " 13.Jun.2008 10.07am",
      "content": "Franklin wasn’t designed in multiple weights, the ”regular” was drawn in 1902 and released in 1905, condensed drawn in 1905 and extended drawn in 1906, they were released in 1906 and 1953 respectively.\n\nEdit: Extra Condensed was 1906/1906\n\nThe Cheltenham condensed weights were not available from the start either. It was begun by Bertram Goodhue as a book face in 1894. Benton/ATF licensed in 1902 (Linotype did the same) and the additional designs from ATF trickled out between 1902 and 1913. I’m not sure what designs were in Goodhue’s original; Lawson shows an image of sketches of a regular and italic by Goodhue, but with no date. With a date this might contradict Southall’s notion that the De Vinne originated the design of an integrated family in 1899.\n\n"
    },
    {
      "time": " 13.Jun.2008 1.25pm",
      "content": "Cool. One more test... How about display styles? Like Hoefler&Frere-Jones’ Requiem that comes in Text, Display and Fine... I am guessing that this is a tradition from the good old days when each typeface was cast at different point sizes, so it was just a “default” to design the bigger font sizes so that the contrast stayed at a maximum.\n\n"
    },
    {
      "time": " 13.Jun.2008 1.45pm",
      "content": "I think I remember an historian saying that Caslon was the first to design in a full range of sizes—you can see these in his famous advertising broadsheet. His text and display are significantly different, so I don’t know whether you’d really want to call it one design.\n\n"
    },
    {
      "time": " 13.Jun.2008 3.41pm",
      "content": "As far as one design in a full range of different sizes is concerned, also Fleischman (1707–1768) somes to my mind. Stanley Morison wrote about Fleischman’s typefaces: ‘As a whole, Fleischman’s founts represent the first personal, individualist interpretation of Roman and Italic.’ (Stanley Morison: Letter Forms, p. 26)\n\nI think that Renaissance punchcutters simply would not have understood the notion or concept of a ‘personal style’ or ‘individualist interpretation’ in punchcutting, whereas in the times of Caslon, Fleischman, Rosart and Fournier this concept slowly started to make sense.\n\nThe concept of a typeface family came much later (when the pantograph had already won over the punchcutter), and it seems to me to be a concept driven almost entirely my marketing purposes.\n\nMichael Twyman wrote an interesting article about how the printers slowly figured out that they might probably need something like a bold typeface.  \nMichael Twyman: ‘The bold idea’, in: Journal of the Printing Historical Society, no 22, 1993, pp 107–143\n\nHarry Carter wrote about Francois Guyot (?–1570):  \n‘Guyot, as you see, matched his Double Pica and Pica Romans with Italics, evidently with an intention that they should work together: Nobody had done that before: Italic had been a text-letter alternative to Roman.’  \n(Harry Carter: A view of early typography, pp 96–97)  \nFor an illustration of Guyot’s Double Pica and Pica Romans with Italics see:  \nHarry Carter: A view of early typography, fig 67, or, even better:  \nJohn Dreyfus (ed.): Type Specimen Facsimiles 1–15, sheet 1 (facsimile of the Folger specimen)\n\n"
    },
    {
      "time": " 13.Jun.2008 4.19pm",
      "content": "That Twyman article on Bold sounds interesting.\n\nHere is D.B. Updike’s observation (_Printing Types_, 1922) of boldness in Bodoni; I think he assembled these samples from different pages of the _Manuale._\n\n ![](http://web.archive.org/web/20081203163452im_/http:/www.typophile.com/files/bodber_5324.jpg)\n\n"
    },
    {
      "time": " 16.Jun.2008 8.35am",
      "content": "James — I guess it depends upon what Armin’s looking for in terms of an “integrated” family. His initial request was <cite>Which were the first type families to formally and officially include a) bold weights b) italic versions and c) condensed and extended versions?</cite>\n\nFranklin Gothic and Cheltenham condensed versions were an integrated part of the families, rather than disparate designs that were assembled and renamed after the fact (as sometimes happened prior — not so much condensed, but bolds certainly).\n\nYou’re right, of course, about the sequential release, so bad use on my part of phrase “from the get-go”. If simultaneous release is a criteria, a lot of faces that we might otherwise consider as integrated families might have to be excluded.\n\n— K.\n\n"
    }
  ]
}
