{
  "id": "46387",
  "title": "\"Tate etc\" magazine - Body copy font",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello all,\n\nCan't seem to place this one, feels very much like a Garamond but can't find an exact match for the some of the characters - e.g the \"T\" \"g\" \"e\".\n\nAny help much appreciated\n\nTom\n\n| Attachment | Size |\n| --- | --- |\n| [tate sampn.jpg](http://web.archive.org/web/20100916191554/http:/typophile.com/files/tate%20sampn.jpg) | 526.77 KB |\n\n",
  "author": "<a href=\"/web/20100916191554/http://typophile.com/user/17886\" title=\"View user profile.\">tomdarra</a>",
  "time": "<br>",
  "uid": "17886",
  "comments": [
    {
      "time": "",
      "content": "I’m far from competitive in type ID, but my guess on this is that it is custom by Hoefler & Frere-Jones. It looks to me to have some of the DNA of Hoefler Text. It is really nice.\n\n"
    },
    {
      "time": "",
      "content": "I think it looks closer to Janson, but the R leg is not serifed. Gábor Kóthay's [Tyrnavia](http://web.archive.org/web/20100916191554/http:/www.myfonts.com/fonts/t26/tyrnavia/) is based on Kis's lettering, but has an R with a tapered leg, although it extends below the baseline. The other Janson problem is the M, which in most Jansons looks lopsided (including Tyrnavia).\n\nI think this might be a custom face designed for the Tate, but I haven't tried Googling this subject yet.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I may be barking up the wrong tree, depending on what this sample comes from, but [Gareth Hague](http://web.archive.org/web/20100916191554/http:/www.identifont.com/show?1YW) has done custom work for Tate Modern book projects.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Mike, you are quite right, it does indeed look closer to Janson. Tyrnavia is interesting, hadn't come across that one before.\n\nThe sample comes from the Tate's own magazine [http://www.tate.org.uk/tateetc/about/](http://web.archive.org/web/20100916191554/http:/www.tate.org.uk/tateetc/about/ \"http://www.tate.org.uk/tateetc/about/\") art directed by Cornel Windlin. In my view its the most well designed magazine around at the moment.\n\n"
    },
    {
      "time": "",
      "content": "Tom, it always surprises me how art-related publications so often fail to credit the typography they use. I presume they have no colophon attributing their typefaces, or we wouldn't be having this discussion.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Mike, I certainly get your point, but have heard it expressed in the exhibition catalogue world that it can seem improper to call attention to this aspect of the design. I think the sentiment might be that if the type is to serve the subject and the overall design it shouldn't call attention to itself and, in turn, shouldn't be called out by name.\n\nI can see both sides to the point.\n\nMaybe we will get a response from someone at the Tate on this question of the typeface.\n\n"
    },
    {
      "time": "",
      "content": "Mark, It seems to me that a small, inconspicuous colophon would not detract from the exhibition, any more than crediting the curators, art directors and others involved in presenting the show to the public detracts from the impact of the exhibition. I agree that may be their thinking, but it seems a disservice to the typography, in my opinion (of course, because type interests me).\n\n- Mike Yanega\n\n"
    }
  ]
}
