{
  "id": "46401",
  "title": "1930's Ex Libris",
  "forum": "mili's blog",
  "tags": [

  ],
  "content": "I found this Ex Libris in a book I bought from a high quality second hand bookshop in Helsinki. It's in an apparently second edition J. B. Priestley's Angel Pavement from 1930, published by William Heinemann Ltd, London. It was obviously purchased by Mr. Starck in 1932, and it was no. 604 in his library.\n\nMr. Starck seemed to have been Karelia minded, as the two swords suggest – eastern and western. The same theme is in a label of a popular Finnish beer, Karjala (Karelia).  \nKarelia is in the border of Finland and Russia, in 1930 it was still totally in Finland, now part of it belongs to Russia.\n\nThe K in Starck is pretty interesting as well as the Ö without proper umlauts.\n\n ![](http://web.archive.org/web/20120729145457im_/http:/typophile.com/files/Exlibris_3744.jpg)\n\n",
  "author": "mili",
  "time": "13 Jun 2008 — 10:02am",
  "uid": "7908",
  "comments": [
    {
      "time": "13 Jun 2008 — 10:03am",
      "content": "Here's the Karjala beer label\n\n ![](http://web.archive.org/web/20120729145457im_/http:/typophile.com/files/karjala_imago_200dpi_4952.jpg)\n\n"
    },
    {
      "time": "15 Jun 2008 — 9:05am",
      "content": "When I was learning Swedish, the textbook had examples of postcards and such as part of its illustrations. One feature I noticed about the mimicked handwriting on them was that the dots of the letters ä and ö were not properly separated but replaced with something resembling tildes, so that they looked more like ã and õ. So I figure the improper dots must be a feature of at least some Swedish handwriting or must have been at some point in time. After all, in Swedish there is no risk of confusion to be had by not indicating the dots properly.\n\nIs this something that's found in Finnish handwriting at all? Or have you seen it at all in Finland-Swedish handwriting? I have no idea how common this is.\n\nIt must be unusual to see such an informal feature associated with handwriting on a type/lettering design like on that Ex Libris.\n\n"
    },
    {
      "time": "15 Jun 2008 — 11:52am",
      "content": "When I was at school the handwriting ö/Ö would have a tilde-like line replacing dots. It was similar to this 1930's model.\n\n ![](http://web.archive.org/web/20120729145457im_/http:/typophile.com/files/ManuPropria_eBook-56_3648.jpg)\n\nActually, I replace dots with a line when writing something quickly by hand, you wouldn't think I started with the 1930's style handwriting, would you?  \nHere's Töölö and PÄÄ (sometimes I can't read my own writing…)\n\n ![](http://web.archive.org/web/20120729145457im_/http:/typophile.com/files/toolo_3634.jpg)\n\n"
    },
    {
      "time": "16 Jun 2008 — 12:51am",
      "content": "In languages where there is no danger of confusion, the double dots of the printed umlaut often look like double acute accents, tildes or macrons.\n\nThis is natural, just a question of writing economy :-)\n\nSome decorative typefaces take on this feature, however this limits their usability in other languages.\n\nSzabolcs\n\n"
    },
    {
      "time": "17 Jun 2008 — 12:49am",
      "content": "Look out for the new ‘Studio Lettering’ collection, soon to be released by [House Industries](http://web.archive.org/web/20120729145457/http:/typophile.com/wiki/House%20Industries)!\n\nIt consists of three styles, [Slant](http://web.archive.org/web/20120729145457/http:/www.tdc.org/news/2008Results/Slant.html), [Sable](http://web.archive.org/web/20120729145457/http:/www.tdc.org/news/2008Results/Sable.html), [Swing](http://web.archive.org/web/20120729145457/http:/www.tdc.org/news/2008Results/Swing.html).\n\nAll of them feature _vernacular alternates_, which can be toggled via stylistic subsets in OpenType. [Ken Barber](http://web.archive.org/web/20120729145457/http:/typophile.com/wiki/Ken%20Barber) got the idea to this when he saw the variation of the umlaut in Swedish sign-painting and handwriting. See also some photos by [Peter Bruhn](http://web.archive.org/web/20120729145457/http:/typophile.com/wiki/Peter%20Bruhn): [[1]](http://web.archive.org/web/20120729145457/http:/www.flickr.com/photos/fountaineer/1079101663/in/pool-779590@N22), [[2]](http://web.archive.org/web/20120729145457/http:/www.flickr.com/photos/fountaineer/446192970/in/pool-779590@N22).  \nF\n\n"
    },
    {
      "time": "17 Jun 2008 — 1:02am",
      "content": "Thanks, Florian! Interesting to see that kind of treatment in a font.\n\n"
    },
    {
      "time": "17 Jun 2008 — 4:06am",
      "content": "Addendum:\n\n<cite>The appearance of written language is often affected by regional customs, individual habits or simple matters of convenience. Studio Lettering fonts include culture-specific character sets that reflect stylistic preferences of native users. These “colloquial” forms are based on designer Ken Barber’s exhaustive research.</cite> — from the Studio Lettering poster by [House Industries](http://web.archive.org/web/20120729145457/http:/www.houseind.com/)\n\n"
    },
    {
      "time": "22 Jun 2008 — 6:36am",
      "content": "Thanks everyone. This has been really fun and informative, and it was great to discover the [Fancy Diacritics](http://web.archive.org/web/20120729145457/http:/www.flickr.com/groups/779590@N22/pool/) Flickr pool.\n\n"
    },
    {
      "time": "22 Jun 2008 — 7:13am",
      "content": "Great find, Mili! I love the K in Stark as well.\n\nChrisL\n\n"
    }
  ]
}
