{
  "id": "4640",
  "title": "GERMAN WWI typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm doing titles for a film set in World War I. Are there any good typefaces that approximate plane signage from the period? (Blackletter/gothic ones?) Thanks.\n\n",
  "author": "2030",
  "time": "6 May 2004 — 2:45pm",
  "uid": "3219",
  "comments": [
    {
      "time": "7 May 2004 — 12:50am",
      "content": "I have no idea what German Airplanes looked like during the first world war.   \n   \nHowever, I can think of a couple of typefaces for you to spec.   \n   \nFirst off is Fette Fraktur, from Linotype. Fette Fraktur is a \"typical\" victorian-era fraktur. Such typefaces were still in wide-spread use throughout Germany during the first World War.   \n   \nSecond should be akzidenz grotesk. This can be bought through Berthold or Adobe, at least. This is not a blackletter face, but it was used throughout Germany at the time.   \n   \nLastly, I would consider almost any typeface designed by Rudolf Koch. Most of his typefaces were designed after the first world war, but I would guess that this anacronysm could be forgiven. Koch also fought in the first world war (as did most other famous german designers from that time).\n\n"
    },
    {
      "time": "7 May 2004 — 2:06am",
      "content": "[http://www.myfonts.com/fonts/linotype/wilhelm-klingspor-gotisch/](http://web.archive.org/web/20130914150057/http:/www.myfonts.com/fonts/linotype/wilhelm-klingspor-gotisch/)   \nRudolf Koch did wilhelm klingspor gotisch (post WWI) amongst others   \n [http://www.wwi-models.org/Photos/Ger/Pfal\\_DXII/vh\\_pfalzxii\\_04.jpg](http://web.archive.org/web/20130914150057/http:/www.wwi-models.org/Photos/Ger/Pfal_DXII/vh_pfalzxii_04.jpg)   \nI also came across this rather interesting blackletter stencil which you could develop maybe? Although the sans serifs were available and widely used would an audience be aware of that?   \nTim\n\n"
    },
    {
      "time": "7 May 2004 — 2:59am",
      "content": "Chris, please don`t use Fraktur or Blackletter for titling. And please don`t use Kochs types. Koch was a very brave man, made his types for the holy word - so it would work for films like Luther. But if you want extend the clichee of the ugly German - Fette Fraktur & Co. will do this job. ;-)   \n   \nIn this time Fraktur was not so popular (especially for scientific things and advertising)- it became more popular in contrast to Bauhaus and Futura later.   \n   \nfonts match the timeline:   \n   \n- De Vinne Latin   \n [http://www.myfonts.com/fonts/bitstream/de-vinne/](http://web.archive.org/web/20130914150057/http:/www.myfonts.com/fonts/bitstream/de-vinne/)   \n   \n- Clarendon   \n [http://www.identifont.com/show?2SA](http://web.archive.org/web/20130914150057/http:/www.identifont.com/show?2SA)   \n   \n- Akzidenz Grotesk, right   \n   \nYou will find the above types in pre WWI Berthold specimens.   \n   \nAlso Ehmcke Antiqua - now marked as Carlton matches the time (published by Flinsch Foundry 1908 and very common till WWI for titlings)   \n   \n [http://www.myfonts.com/fonts/linotype/carlton/](http://web.archive.org/web/20130914150057/http:/www.myfonts.com/fonts/linotype/carlton/)   \n   \n- some bold oldstyle Egyptienne, Grotesk or Antiqua designs with the typical flavor of this time work too, but I miss the right ones in the digital age.   \n   \nfor plane signatures only, catch some historical sources of the german planes.   \n   \nSearch for MANFRED VON RICHTHOFEN / RED BARON or FOKKER.   \n   \nBTW: I think the iron cross was used only - no types.\n\n"
    },
    {
      "time": "7 May 2004 — 3:53am",
      "content": "I think that blackletters, even frakturs, are beautiful. I find it disparaging, as an American living in Germany, when Germans tell me that these letters are ugly and evil.   \n   \nAnyway, Tim might be right. If these planes didn't emply blackletter type on them, then you shouldn't use it in your film. That _would_ perpetuate a false stereotype. Since this is a documentary, you should show the truth (whatever that is!).\n\n"
    },
    {
      "time": "7 May 2004 — 5:18am",
      "content": "Actually I found a picture of a german biplane (Pfalz D-XII) that did employ the stencil blackletter and a 5 colour lozenge camouflage scheme. The markings seem to usually involve the maltese cross and/or a black cross of equal leg lengths with white outline, squadron markings and camouflage (although there were some personalised colour schemes\n\n"
    },
    {
      "time": "10 May 2004 — 10:22am",
      "content": "\\> Germans tell me that these letters are ugly and evil.   \n   \nIt's an economic measure: they are brainwashed by a system which is tired of making perpetual monetary reparations.   \n   \nhhp\n\n"
    }
  ]
}
