{
  "id": "46413",
  "title": "Tropical type suggestions needed",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Today I got this reaaalllllyyy crazy fun graphic design commish. The project is a complete graphic overhaul of a tropical supermarket. And this place is reaaallllyyy funky cool.\n\nThe supermarket shelves are stocked with all the usual products you'd expect to see coming from the tropics with one very cool exception.\n\nIsles are stocked with flour, rice, bulk stuff like that. Then come isles of canned goods like vegetables, beans, etc.. And then the very next isles are stocked with, fake hair. Yep, hair! Black hair, brown hair, tan hair, red hair - long hair, short hair, curly hair, - all sorts of hair!!! And the next isles have all the products to groom and shape the hair! What a store!\n\nWhat type is associated with the tropics?\n\nThx.\n\n",
  "author": "Hiroshige",
  "time": "13 Jun 2008 — 9:52pm",
  "uid": "9690",
  "comments": [
    {
      "time": "14 Jun 2008 — 1:31am",
      "content": "Hello Neil, can you post an image of the store ?\n\n"
    },
    {
      "time": "14 Jun 2008 — 8:03am",
      "content": "Check out [this site](http://web.archive.org/web/20131023164503/http:/www.arkivatropika.com/cgi-bin/tags.cgi?tags=%22illustration%22) for some cool 1950s retro tropical type inspiration. Warning: it takes forever to load.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "14 Jun 2008 — 8:20am",
      "content": "Who shops at this store? Canadians who will enjoy stereotypical tropical faces or carribean immigrants who would appreciate something more authentic?\n\n"
    },
    {
      "time": "14 Jun 2008 — 9:49am",
      "content": "Alesasandro, hi there. I'll post some shots in a couple of days. The store front windows are plastered floor to ceiling with dozens and dozens of head shots. Fashion photos of which have all faded.\n\nNick, thanks for the link. It gives me an idea of what's been used.\n\nJames, I hung out there for the entire day. Everybody who came into the store was black and these Canadians preferred to speak in their language of origin, of which I had no idea what they were saying. Very cool stuff indeed.  \nI spent my time gawking at produce, looking at lables and soaking up colour palettes of earth tones with vibrant hues of green, yellow, orange, red, and blue ...and of course all that hair!!\n\n"
    }
  ]
}
