{
  "id": "46412",
  "title": "Wiki Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi everyone,\n\nI discovered Typophile just recently, but was instantly charmed by it. I love the fact that a lot of people are so passionately engaged in discussions. For example, you can witness first hand how some logos have transformed and became 1000 times better thru comments and suggestions from numerous members.\n\nI haven’t contributed to this community yet, so it seams undeserving for me to ask for your help, but I really need it and it is for a good cause.\n\nI am trying to design a logo for a wiki called Green Hospital. The idea behind it is to provide relevant information to hospital decision makers which will allow them to transform their hospital into more environment and people friendly facilities.\n\nThank you for your time and critiques.\n\n ![](http://web.archive.org/web/20081023045546im_/http:/typophile.com/files/green_hospital_4029.png)\n\n| Attachment | Size |\n| --- | --- |\n| [green\\_hospital.png](http://web.archive.org/web/20081023045546/http:/typophile.com/files/green_hospital.png) | 20.15 KB |\n\n [‹ Graphic Design Logotype](http://web.archive.org/web/20081023045546/http:/typophile.com/node/41457 \"Go to previous forum topic\") [Logo Critique: NW Water Law Symposium ›](http://web.archive.org/web/20081023045546/http:/typophile.com/node/46471 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081023045546/http://typophile.com/user/32427\" title=\"View user profile.\">ikovic</a>",
  "time": "<br>",
  "uid": "32427",
  "comments": [
    {
      "time": " 14.Jun.2008 3.29am",
      "content": "Seems sort of arbitrary to me. What’s the significance of the n becoming the l? Why is one of the es backwards?\n\n"
    },
    {
      "time": " 14.Jun.2008 6.32am",
      "content": "Green n is becoming l (which is suppose to be black) to visualize something like green thinking pouring into hospital. Backward e in version 2 and 3 has no meaning. I was trying to avoid stuff like green leaves, water drops, trees and other thing so often used in this sort of logos.\n\n"
    },
    {
      "time": " 14.Jun.2008 8.38am",
      "content": "it reads ’Green Hospita’\n\n"
    },
    {
      "time": " 14.Jun.2008 12.41pm",
      "content": " ![](http://web.archive.org/web/20081023045546im_/http:/typophile.com/files/green_hospital3_4217.png)\n\n"
    },
    {
      "time": " 14.Jun.2008 9.29pm",
      "content": "In your top example here, shouldn’t “hospital” be green since, after all, you’re calling it green? Black hospital is just plain grim.\n\nHave you experimented with green medical ideas? A green “Red Cross” logo comes to mind.\n\n"
    },
    {
      "time": " 18.Jun.2008 8.52am",
      "content": "I’ve been working in the medical industry and know how wasteful it is, so kudos for the idea.\n\nYou said “green thinking pouring into hospital,” so why not play with the l as a droplet? I think you could customize the font a bit and this could work. Also a bit bolder weight might help. I like the n turning into an l, but the I think the whole logo should be the same color.\n\n"
    },
    {
      "time": " 19.Jun.2008 12.14am",
      "content": "Thanks for all your suggestions. I will get back to work and keep you updated.\n\n"
    }
  ]
}
