{
  "id": "46436",
  "title": "any fontlab training courses in Belgium?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hey everybody,\n\nI’m a graphic design student and this year i made my first font, since there’s nobody around at the academy where i study who knows or uses fontlab the learning process for me is verry slame as it is a verry complex program...i bought the book Leslie Cabarga’s book and its great but i was wondering if annyone over here knows if i could follow some fontlab courses/trainings over here in Belgium. fonts and font design is something that i’m really pasionate about and would really like to speed up the learning proces...it would also be grat to have people pointing me out the thing i’m doing wrong while working in photoshop and ofcourse a book doesn’t really do that.\n\nmaybe even if there are some people from Belgium over here whom work with fontlab and have some spare time to give some lessons...ofcourse i’ill pay for them, i’m not asking for a free ride in no way...just wanna learn :D\n\n [‹ Euro 2008 Uniform Fonts](http://web.archive.org/web/20080623194136/http:/typophile.com/node/46524 \"Go to previous forum topic\") [Pseudo-random 3.0 ›](http://web.archive.org/web/20080623194136/http:/typophile.com/node/46521 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080623194136/http://typophile.com/user/25150\" title=\"View user profile.\">omar</a>",
  "time": "<br>",
  "uid": "25150",
  "comments": [
    {
      "time": " 15.Jun.2008 12.46am",
      "content": "I’m going to ask around. Stay tuned.\n\n"
    },
    {
      "time": " 15.Jun.2008 2.35am",
      "content": "hey thanks Bald, appreciate it!\n\nby the way could it be that last year we met at the KASK /Gerard Unger lezing?\n\ncheers\n\n"
    },
    {
      "time": " 17.Jun.2008 4.54am",
      "content": "up\n\n"
    },
    {
      "time": " 17.Jun.2008 2.06pm",
      "content": "Yes, possibly, but I’m not sure. :^)\n\n"
    },
    {
      "time": " 17.Jun.2008 2.17pm",
      "content": "So I asked around and couldn’t find anyone yet who’s able to give private courses. And I don’t think there are any public courses (except in eductaional programmes like Type and Media at KABK and such).\n\n"
    }
  ]
}
