{
  "id": "46449",
  "title": "Comments on my logo?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Someone told me the graphics are cheesy, and that I should just go with straight text. I'd just like to get some other opinions. Any other thoughts would be appreciated as well.\n\nThanks,\n\n ![](http://web.archive.org/web/20131019111455im_/http:/typophile.com/files/Logoerellsworth_5857.gif)\n\n",
  "author": "erellsworth",
  "time": "15 Jun 2008 — 12:17pm",
  "uid": "32477",
  "comments": [
    {
      "time": "15 Jun 2008 — 12:18pm",
      "content": "Edward  \n [www.erellsworth.com](http://web.archive.org/web/20131019111455/http:/www.erellsworth.com/ \"www.erellsworth.com\")\n\n"
    },
    {
      "time": "15 Jun 2008 — 1:08pm",
      "content": "I don't think the illustration is cheesy. On the contrary - just the text would probably have difficulties standing out. I think you could even enlarge the illustration somewhat (and perhaps place the quill in the ink bottle) to give it increased emphasis.\n\nIs there a particular reason why you have chosen oblique Courier for the text? Given the style of your home page, I guess your intention might be to resemble typwriter text. In that case, it might be better to use an upright style. On the other hand, given the feather pen, a script style would perhaps be more suitable. Also, the text would probably be easier to read if the letters were not outlines.\n\nJust my two nickles.\n\n/Måns\n\n"
    },
    {
      "time": "19 Jun 2008 — 8:53pm",
      "content": "Seen in your post, it looks decent. Seen in context of your website, it falls a little flat. The separation between the first and second lines of text suit the placement of the quill but not the integrity of the interaction of the text. I'd like to see the quill interact with the well, and then those two elements correspond with your text. Furthermore, don't neglect to take Måns's suggestions into account.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "23 Jun 2008 — 10:27pm",
      "content": "Fonts should be changed. Outlines don't work in this context. They also have some sort of shadow that makes it blurred a bit.\n\nYour E.R. are also more slanted as ELSEWORTH. Looks like fake italics.\n\nAnyway. Fonts don't work. I also wouldn't combine text and imagery so close together. Especially when font style and image style don't match each other.\n\n"
    },
    {
      "time": "25 Jun 2008 — 9:08pm",
      "content": "Thanks for all the input! I'll be working up a new version when I can, and I'll be sure to post the results.\n\nEdward  \n [www.erellsworth.com](http://web.archive.org/web/20131019111455/http:/www.erellsworth.com/ \"www.erellsworth.com\")\n\n"
    },
    {
      "time": "10 Jul 2008 — 1:33pm",
      "content": "To me the graphics don't sit well with the text. I agree with mans, a quill leans more toward hand lettering. Pardon my rip, but I think it needs your own signature or something like Deadman.\n\n ![](http://web.archive.org/web/20131019111455im_/http:/typophile.com/files/Deadman_4946.gif)\n\n"
    }
  ]
}
