{
  "id": "4645",
  "title": "Kitschen restaurant",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi. This is a logo Im working on for a local restaurant. It specialises in dishes that seem a bit cliche and kitsch (hence the name), but are given a modern twist. To reflect this I am trying to create a 1950's reference in the identity i'm creating, but I don't really know if the logo is working at the moment... any suggestions? what do you make of it? ![kitschen logo](http://web.archive.org/web/20131023222854im_/http:/www.typophile.com/forums/messages/29/35329.gif)\n\n",
  "author": "roh",
  "time": "6 May 2004 — 8:49pm",
  "uid": "3696",
  "comments": [
    {
      "time": "7 May 2004 — 6:44am",
      "content": "Your trying to make the logo do all the branding. Sometimes its better to go simplier. No one is going to get cliche and kitsch from a logo. The whole environment has to create that atmostphere. I haven't a clue of what that blob is at the left of your name. Also if you are looking for retro (50s) looking stuff for reference go to Font Dinner. Great typefaces and retro stuff and some free fonts.\n\n"
    },
    {
      "time": "7 May 2004 — 6:45am",
      "content": "... To me it seems a bird with 3 legs that just got a bullet in the head (rage against the birds?).\n\n"
    },
    {
      "time": "7 May 2004 — 7:06am",
      "content": "What is it?   \n   \nAlso, what does 'contemprary traditional' mean? Seems rather vague.   \n   \nIt sounds like fun food. Make it fun.\n\n"
    },
    {
      "time": "7 May 2004 — 9:55am",
      "content": "I have to say, I am a bit confused. What would my motivation be to eat in a cliche trashy looking restaurant?   \n   \nPlease redefine if I missed your point.   \n   \nWhen I think of Kitsch, I think of Home Shopping Network collectibles from 15 years ago.   \n   \nI guess its a one-time curiousity thing, or for kitsch enthusiasts.   \n   \nAndrew\n\n"
    },
    {
      "time": "7 May 2004 — 9:55am",
      "content": "Double down\n\n"
    },
    {
      "time": "7 May 2004 — 10:27am",
      "content": "a bit phallic, perhaps a restaurant that serves roosters.\n\n"
    },
    {
      "time": "7 May 2004 — 10:42am",
      "content": "Shall I assume that the recent onslaught of restaurant logos are all from the same school assignment?   \n   \nRoh, in contrast to some of the other commentary on this thread, I kind of like the concept of a kitch restaurant, and further, I think the name is clever. Some restaurants have been bold enough to take the risk of exposing themselves for what they really are (eg. Fat Burger). I don't see any problem, or deterent, for a restaurant to serve ordinary, regular, uninteresting, \"cliche\" or \"kitche\" food, on kitche dishes in a kitche environment. I might even visit a few times on those days when I'm tired of everyone trying to keep up with the really cool trends and fads. It might be refreshing to experience honest poor quality\n\n"
    },
    {
      "time": "7 May 2004 — 11:20am",
      "content": "Oh yah, I almost forgot. Lose the mark and focus on the logotype. The title is making a statement in itself, so emphasize that. The graphic is unnecessary.\n\n"
    },
    {
      "time": "7 May 2004 — 2:30pm",
      "content": "Scot find a picture of that sign in Indiana. I once saw a neon sign with some of the lights out. During the day it said Rugs and Broadlooms at night it said Rugs and Badlooms.\n\n"
    }
  ]
}
