{
  "id": "46471",
  "title": "Logo Critique: NW Water Law Symposium",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Wrapping up this project for a water law conference in the pacific northwest. Going for a compass, native woodcarving look. I know the water drop is ubiquitous but, it is what the client wants. I have it down to these three designs. Input?\n\n[http://www.cjeder.com/nwl1.png](http://web.archive.org/web/20081023045552/http:/www.cjeder.com/nwl1.png)\n\n [‹ Wiki Logo Critique](http://web.archive.org/web/20081023045552/http:/typophile.com/node/46412 \"Go to previous forum topic\") [Real Estate appraiser logo ›](http://web.archive.org/web/20081023045552/http:/typophile.com/node/45816 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081023045552/http://typophile.com/user/24307\" title=\"View user profile.\">cjeder</a>",
  "time": "<br>",
  "uid": "24307",
  "comments": [
    {
      "time": " 16.Jun.2008 11.24am",
      "content": "That link isn’t working. You need the “www” first.\n\n ![](http://web.archive.org/web/20081023045552im_/http:/typophile.com/files/nwl1_4588.gif)\n\n"
    },
    {
      "time": " 16.Jun.2008 12.21pm",
      "content": "I like the second one. It’s simplistic and after reading your blurb, noticed the compass impression. Do you have to use the abbrevated NW instead of Northwest in the name?\n\nWhat’s the reasoning behind having a “native woodcarving look”?\n\n"
    },
    {
      "time": " 16.Jun.2008 1.06pm",
      "content": "NW vs. Northwest, I haven’t worked with the type enough to have an opinion. I’ll take it that you suggest “northwest”. As for the native woodcarving look. I want to reference the artwork of the pacific northwest Indians to keep the piece regional and highlight the cultural and environmental issues regarding the health of NW salmon fisheries (hence the orange color).\n\n"
    },
    {
      "time": " 16.Jun.2008 2.46pm",
      "content": "I like one and two. If you use one I would straighten the water drop like in two.\n\n"
    },
    {
      "time": " 16.Jun.2008 2.56pm",
      "content": "Isn’t salmon more of a peachy-pinkish color? As for the Native American angle, I don’t think it’s resolved in these marks, it’s almost too subtle. Perhaps instead of a style, you consider using a recognizable symbol... Off the top of my head, I see a simplified feather/compass illustration. Something three dimensional, but not overly detailed.\n\n"
    },
    {
      "time": " 16.Jun.2008 3.32pm",
      "content": " ![](http://web.archive.org/web/20081023045552im_/http:/typophile.com/files/water-worksheet_5021.png)\n\nI’ve updated the colors, and tossed in a couple of extra options. As for the native thing, here is the look I am going for\n\n[http://www.umilta.net/salmon1.jpg](http://web.archive.org/web/20081023045552/http:/www.umilta.net/salmon1.jpg)\n\n"
    },
    {
      "time": " 17.Jun.2008 7.09pm",
      "content": "I don’t even think that Indian salmon looks too much like a salmon. I imagine any reference you try to make to this style of art will be lost on most.\n\n"
    },
    {
      "time": " 18.Jun.2008 3.24am",
      "content": "I can’t help but notice Jayyy speaks from Florida. Native art is very much a part of northwestern (and southwestern) culture, and I don’t think the reference will be lost at all.\n\nThat said, I don’t think the logo is quite there yet. The top two are my favorites in this last set, but I think you need more organic, woodcut-style lines like the salmon has. The top left one is interesting, but it’s getting dangerously close to an 80’s paisley.\n\nThe middle two logos look like a cat’s head to me, and now I can’t see anything else. They’re just too symmetrical and sleek to look like Native art.\n\nOh, and not to sound hyper-pc, but I thought the label “Indian” was banished decades ago!? Where I grew up, it was just as bad as the horrific n-word!\n\n"
    },
    {
      "time": " 18.Jun.2008 8.45am",
      "content": "I like the top right one. It definitely reminds me of the Pacific Northwest Indian woodcarvings.\n\nThe top left looks like a heart to me (a real heart with valves and arteries).\n\nSomething about the “NWWaterLaw” text bothers me. Maybe it’s the typeface, maybe it’s the small caps...I can’t put my finger on it.\n\n"
    },
    {
      "time": " 18.Jun.2008 9.28am",
      "content": "<cite>Something about the “NWWaterLaw” text bothers me. Maybe it’s the typeface, maybe it’s the small caps...I can’t put my finger on it.</cite>\n\nThis caught my eye as well. I think it’s the absence of spacing between NW Water and Law. It’s a lot of mixing caps, smallcaps and lowercase without much breathing room.\n\nI also agree with Eileen that you need to vary your line weight to help emphasize the organic nature of wood-carving.\n\n"
    },
    {
      "time": " 18.Jun.2008 9.35am",
      "content": "I really like the top right one. It has a very cool pictograph look.\n\nSharon\n\n"
    },
    {
      "time": " 18.Jun.2008 12.59pm",
      "content": "For what it’s worth, I prefer the original orange you used. At least on my monitor, it’s much closer to the actual color of salmon on the plate, ready to eat. Additionally, by softening the color so much, the logo loses a lot of it’s original boldness and vibrancy.\n\nJust my two cents...\n\n"
    },
    {
      "time": " 18.Jun.2008 1.34pm",
      "content": "I think if you use real small caps instead of fake ones, the NW will look better and less faint.\n\nThat said, I think you need to bump up to a semi-bold or bold so the text will hold its own against the thickness of the icon.\n\nDavid\n\n"
    }
  ]
}
