{
  "id": "46485",
  "title": "Article on Time about typefaces on restaurant Menus",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I don’t know if anyone’s posted this, and it’s not even THAT interesting (most designers and type nerds would probably know all that intuitively), but there you go.  \nYou can see it [here](http://web.archive.org/web/20081015210631/http:/www.time.com/time/business/article/0,8599,1813950,00.html?xid=rss-business).\n\nOnce again, design and typography go mainstream for a little while. :P\n\nruD\n\n [‹ Shyfoundry now up and running...](http://web.archive.org/web/20081015210631/http:/www.typophile.com/node/46507 \"Go to previous forum topic\") [Some questions about \"first\" uses ›](http://web.archive.org/web/20081015210631/http:/www.typophile.com/node/46370 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015210631/http://www.typophile.com/user/12632\" title=\"View user profile.\">rubenDmarkes</a>",
  "time": "<br>",
  "uid": "12632",
  "comments": [
    {
      "time": " 16.Jun.2008 7.09pm",
      "content": "<cite>Song compared the responses of subjects exposed to menu descriptions typed in a simple Arial font with responses from those exposed to identical dish descriptions in a harder-to-read Mistral font.</cite>\n\nShe compared menus typeset in the cheap-vinyl-sign-font and the cover-of-every-bukkake-movie-font. Oy vey…\n\nSomeone has to get us an early copy of this paper to pass around at Typecon.\n\n"
    },
    {
      "time": " 16.Jun.2008 7.30pm",
      "content": "Si posted an article about the same study (different source, though) not too long ago. I think there are a few fatal flaws, chief among them that the researcher accepts that certain typefaces are more legible as a pre-accepted fact. I would have preferred they pick one or two defining typefaces for certain styles (Garamond and Centaur for oldstyle, Baskerville for transitional, Didot for modern, Futura and Century Gothic for geometric sans, Frutiger and Meta for humanist sans, etc.), then instead of evaluating readability vs. perceptions, only talk about the perceptions associated with each style. Then set those only in black-on white, all caps, small caps, no caps, and at different point sizes.\n\nThe study may have been that complex, but the article portrays it as very simplistic, especially talking about comparing an easy-to-read Arial with a more difficult Mistral. Under those criteria, Mistral falls into the same category as, say, 8 pt. Goudy or something since it’s harder to read than 12 pt. Arial.\n\nOh, well, I guess the fact that this is being researched is a step in the right direction.\n\nEDIT: I like the ending of the article, though. The best menus are those that have only the name of the dish with the price, preferably without a dollar sign or any change. The name of the dish can be as complex as you want, but descriptions under the dish detracts from the experience, in my opinion.\n\n"
    },
    {
      "time": " 16.Jun.2008 9.03pm",
      "content": "Well, apparently they didn’t bother to chime in on someone knowledgeable about the stuff. But then again, I think their focus was more superficial, so it’s understandable. I mean, their focus was more on the end-user, so they used an end-user “mental frame”. It may probably be considered not so scientific, but I think science is a lot more subjective than what is generally publicized.  \nAlso, someone knowledgeable would probably see no point in making such study… so, yeah, I guess the main thing is that some people tried to study this in some way (different from our own biased point of view), which, in the end and in more than one way, can only be seen as a good thing.\n\nruD\n\n"
    },
    {
      "time": " 16.Jun.2008 9.06pm",
      "content": "\\>Si posted an article about the same study\n\nYep, here - [http://typophile.com/node/46304](http://web.archive.org/web/20081015210631/http:/typophile.com/node/46304 \"http://typophile.com/node/46304\") - under the very descriptive title of “Ruh, roh!”\n\n"
    },
    {
      "time": " 16.Jun.2008 9.59pm",
      "content": "<cite> She compared menus typeset in the cheap-vinyl-sign-font and the cover-of-every-bukkake-movie-font. </cite>\n\nbest comment ever!!!\n\n"
    }
  ]
}
