{
  "id": "46490",
  "title": "Appropriate dash for a quote?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm doing some page layout for a book to be printed within the week and I need to know if there is a correct dash (en or em or something else) for quoting someone. For example:\n\n“A wonderful insight into one of the most competitive fields of photography, a must read for the aspiring photographer.”  \n-Marcus Bell, Wedding Photographer\n\nI know en dashes are used only for durations, and em dashes are primarily used in lieu of a colon. I've seen both used (and even hypens), but I can't figure out which os truly correct. So that's why I've come to THE source for all that is good and knowledgeable for typography.\n\nAny help is appreciated.\n\n",
  "author": "drewsal",
  "time": "16 Jun 2008 — 10:03pm",
  "uid": "19714",
  "comments": [
    {
      "time": "17 Jun 2008 — 3:33am",
      "content": "Many style guides these days don't recommend a dash at all: either put the attribution in parentheses after the quote, with an em space between; or without parentheses, right-aligned (in the same line as the quote if there's room, on the next line if there isn't).\n\nIf you _do_ want to use a dash though, I'd say an em dash close up to the right-aligned style of attribution...\n\nAnyone else?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "17 Jun 2008 — 4:23am",
      "content": "As Dave suggests, which dash to use is really a matter of editorial style, not typographic style.\n\nAs a guess, I would imagine that the use of the dash \"began\" when the attribution was run in, not taken down. eg,\n\n“A wonderful insight into one of the most competitive fields of photography, a must read for the aspiring photographer.”--Marcus Bell, Wedding Photographer\n\nIn that case, you would use whatever is conventional for the dash in text -- a word-spaced en-dash in the UK, a closed-up em-dash in the States.\n\nWhen you take the attribution down to a new line, you can either set it (on the quote block) flush left, flush right, centered, indented an em left or right, etc. Or even use a dash, though that tends to signal form without thought. So, there is no correct answer, but of course, there are \"less correct\" ones. If, for example, you center each line of the quote, it would be odd to set the attribution flush right.\n\n"
    },
    {
      "time": "17 Jun 2008 — 6:58am",
      "content": "I never use any kind of dash to signal an attribution, and when designers doing work for us use it, I ask them to get rid of it. There are many ways to signal the attribution without using this unnecessary sort (\"form without thought,\" indeed).\n\nDave and Charles mentioned alignments and spacing. Also think about changing the face, to small caps or itals or to a sans (if your quote is set in a serif face; or vice-versa). If you are working with color, change the color of the attribution.\n\nIf you use enough of these tactics (face, spacing, alignment, color) in the right combinations, you'll gain the distinction you are looking for between quote and attribution. Of course, if you use too many of them, or in \"wrong\" combinations, you may get a dog's breakfast.\n\nIt has long seemed to me that one goal of good typography might be to get rid of unnecessary characters on a page. Thus we see some typographers specify only spacing in telephone numbers, no dashes or hyphens between code elements. Thus I encourage editors to leave out the word \"Chapter\" and \"Part\" and use only numbers at the start of new chapters or parts. Let the typographers impart the signals through design, not un-needed words.\n\npowers\n\n"
    },
    {
      "time": "17 Jun 2008 — 12:01pm",
      "content": "<cite>Thus I encourage editors to leave out the word “Chapter” and “Part” and use only numbers at the start of new chapters or parts. . . </cite>\n\nWell, maybe. Fairly often, I use \"chapter one\" spelled out, in small caps & smallish size, to function something like a rule -- I have an aversion to rules, probably because I use them badly. You can use the color and spacing with this treatment (of a chapter number) to balance something else on the chapter opening page.\n\nBut we're wandering off topic (now that, I'm good at . . .)\n\n"
    },
    {
      "time": "18 Jun 2008 — 10:08am",
      "content": "Thanks for the help. I'd already designed the type with those style considerations, but I have a feeling the client will want the dashes. I'll discourage it, but you know clients.\n\nHere's an example of what I'd done with it... not the best, but keeps in line with the rest of the book...\n\n ![](http://web.archive.org/web/20150218044136im_/http:/typophile.com/files/IMG_quote_4674.png)\n\n"
    },
    {
      "time": "19 Jun 2008 — 5:28pm",
      "content": "Perhaps I am not the best person to listen to, as I'm fond of, to paraphrase Robert Bringhurst, Victorian egregiousness, but I think typographic characters can be beautiful for their own sake. I prefer the traditional right-hand side, or at least semi-centered, attribution, and a good long em-dash. I don't know, it distances the quote from the speaker to me; makes it more like its own proper line as opposed to a talking-head of sorts. I suppose for book reviews and the like, this could be opposite from the desired effect, and it would be more appropriate to have the name obvious and immediate. It's usually more important who says it than what is said in these cases.\n\n"
    },
    {
      "time": "22 Jun 2008 — 5:10am",
      "content": "\"Appropriate dash for a quote?\"  \nIf it's a long quote, then I suggest a 100 yard dash, if it's a short quote, then I'd do a 40. It all depends on whether you want the quote to last the entire dash, or to end the quote before or after the dash is completed. Do you have more details?\n\nCheers!\n\n"
    },
    {
      "time": "22 Jun 2008 — 1:20pm",
      "content": "Well I think this \"problem\" can be resolved subjectively. Yes one can follow the rules as stated in numerous style guides like the Chicago Manual of Style or as stated by Robert Bringhurst. But depending on the design itself, going away from the dash and opting for a more designed approach could also be the answer. Usually if the quote is clearly set apart from the text (ie: pull quote) I tend to use it as an opportunity to think of an elegant and creative solution that works with the overall content such as making the quote attribution in a smaller bold and uppercase variation of the actual quote itself. In this way it doesn't require a dash and at the same time (depending on the actual style formatting of the quote and the main body copy) it sets another level of typographic hierarchy within the entire piece.\n\nThe general rules are there to use as a guide to intelligently go away from them.\n\n"
    }
  ]
}
