{
  "id": "46503",
  "title": "Use less toledo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I am working on a logo (and possibly a mark) for a design workshop, and we’re calling the project Use less Toledo, but we are trying to play on the word useless. I was just wondering what you all would have to say.\n\nThanks for the feedback!\n\n [‹ Brick Supplier Logo…](http://web.archive.org/web/20081025043020/http:/typophile.com/node/46291 \"Go to previous forum topic\") [Logo Critique: Red Hot Property ›](http://web.archive.org/web/20081025043020/http:/typophile.com/node/46031 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025043020/http://typophile.com/user/16408\" title=\"View user profile.\">jschroc</a>",
  "time": "<br>",
  "uid": "16408",
  "comments": [
    {
      "time": " 17.Jun.2008 6.26am",
      "content": " ![](http://web.archive.org/web/20081025043020im_/http:/typophile.com/files/comps_6244.jpg)\n\n"
    },
    {
      "time": " 17.Jun.2008 7.00am",
      "content": "Not sure playing off the word ’useless’ is a good idea.\n\n"
    },
    {
      "time": " 17.Jun.2008 7.12am",
      "content": "Its because of the stereotype of Toledo, the project is showing Toledo how to be “green”\n\n"
    },
    {
      "time": " 17.Jun.2008 9.28am",
      "content": "I understand the green part. I’m saying ’useless’ is a rather dangerous word to be playing off of. If Toledo is worthless, why bother greening it?\n\n"
    },
    {
      "time": " 17.Jun.2008 9.36am",
      "content": "Shouldn’t it read “Use less, Toledo”?\n\n"
    },
    {
      "time": " 17.Jun.2008 12.11pm",
      "content": "agree. even if you use in that sense TDF it’s still a bit odd.\n\n"
    },
    {
      "time": " 19.Jun.2008 9.09pm",
      "content": "The concept is broken. Ergo, any logo inspired by it is useless. Nice attempt at cleverness, but overall the word “useless” has too much negative attached to it to be useful.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 20.Jun.2008 7.45pm",
      "content": "Just a thought, if you are hell bent on this phrasing:\n\nCould you not set USE and TOLEDO in caps and the “less” in lower case, possibly italicized. And just maybe drop the baseline of the less to give it a bit of separation from the rest. Not much, just a tad.\n\nMichael\n\n"
    },
    {
      "time": " 22.Jun.2008 9.47am",
      "content": "I like the “useless” connotations. If you saw a sign that said “Useless ” you would probably stop and look. I saw a similar campaign around my city last year called “FLICK OFF” (the LI combination was kerned just a little too tightly) and it made you do a double take.\n\nThat being said, the ’ul’ mark you’ve come up with doesn’t work. I would like to see a mark that really says “use less” of whatever you’re trying to get Toledo to use less of. That way the initial shock of having your city called “useless” is immediately replaced by the notion of using less.\n\n- Lex\n\n"
    },
    {
      "time": " 23.Jun.2008 5.25pm",
      "content": "i like the “use less toledo” name... perhaps a color change (like for the word “less”) would make it a tad more clear. or maybe the 3 words stacked on top of each other...  \neither way, i think since it is for a design workshop, it wont be too hard for the target audience to figure out.\n\n"
    }
  ]
}
