{
  "id": "46506",
  "title": "Switching from PC to Mac",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nI'm finally biting the bullet and buying a Mac.\n\nProblem: While I've slowly bought up quite a few OpenType fonts over the last couple of years, I still have a fair number of TrueType fonts that I'm quite fond of.\n\nI know there are a million threads and sites out there explaining the differences between PC and Mac fonts. I have actually tried to read as many of them as I can, but my brain is just overloaded right now. So, please, just pretend I'm a five-year-old and dumb it down for me! :)\n\n1. Is there a free way to continue using those TrueType fonts on a Mac? I read somewhere that if you rename TrueTypes as OpenType they'll keep working, but somehow that sounds too simple to be right...\n\n2. If not - what's the easiest solution? Use TransType pro to convert everything to a Mac format or OpenType?\n\nSorry if this is a 'dummies' level question - I have never been good at comprehending technical information and I'm feeling a bit lost at the moment, lol. Thanks. :)\n\n",
  "author": "lunasoleil",
  "time": "17 Jun 2008 — 6:50am",
  "uid": "30182",
  "comments": [
    {
      "time": "17 Jun 2008 — 6:53am",
      "content": "\"Is there a free way to continue using those TrueType fonts on a Mac?\"\n\nYep. Copy them over, and stick them in your FONTS folder in OSX.\n\nAren't Macs great? :o)\n\n"
    },
    {
      "time": "17 Jun 2008 — 7:06am",
      "content": "Now I feel like even more of a dummy than I did five minutes ago \\<\\_\\<\n\nI guess I always assumed there were options to download a font 'for Windows' and 'for Mac' for a reason, lol. Thank you for humouring clueless me :)\n\n"
    },
    {
      "time": "17 Jun 2008 — 7:13am",
      "content": "Yes, Mac OSX supports the following font types:\n\n\\* OpenType (both Mac and Windows formats)  \n \\* PostScript Type 1 (Mac only)  \n \\* PostScript Multiple Master (Mac only)  \n \\* TrueType (both Mac and Windows formats)  \n \\* dFont (data fork TrueType) (Mac only)\n\nOS9 did not support all of these, so you are now free to use your windows truetype files.\n\n"
    },
    {
      "time": "17 Jun 2008 — 7:15am",
      "content": "This page has some good basic info on the subject [http://www.myfonts.com/support/onepage.php?hc=5#hc5](http://web.archive.org/web/20140829233720/http:/www.myfonts.com/support/onepage.php?hc=5#hc5 \"http://www.myfonts.com/support/onepage.php?hc=5#hc5\")\n\n"
    },
    {
      "time": "17 Jun 2008 — 10:59am",
      "content": "<cite>I guess I always assumed there were options to download a font ’for Windows’ and ’for Mac’ for a reason, lol. Thank you for humouring clueless me :)</cite>  \nThis is not a dumb question. PostScript Type 1 fonts were for a long time, the industry standard for professional typesetting. These fonts were, and still are, platform specific. For example, a windows PostScript font uses two files with .pfm and .pfb extensions. This is the one format not currently supported by Mac OS at the system level.  \nThere is a way to get these fonts to show up in Adobe applications only, but I would only look into that if you have a real need. Also, to be clear about your first post, you should not rename anything. It probably wouldn't cause a problem, but it's certainly not necessary.\n\n"
    },
    {
      "time": "17 Jun 2008 — 4:12pm",
      "content": "Just to clarify, there do not exist separate Mac and Windows versions of OpenType fonts. There exist OpenType fonts with TrueType outlines, and OpenType fonts with PostScript style outlines; both flavors are cross-platform font files.\n\nAs a side note, the dividing line between OpenType fonts with TrueType outlines and Windows TrueType fonts is very thin indeed, and one often doesn't even need to make a distinction between the two.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "17 Jun 2008 — 9:01pm",
      "content": "Of course, if you have lots of fonts, font management software is very helpful, and a good choice is Linotype FontExplorer X, downloadable freeware for Mac OS X.\n\n"
    },
    {
      "time": "17 Jun 2008 — 10:55pm",
      "content": "Well, I do have a few Windows PostScript fonts, but I'm pretty sure they all came with my computer and I can't remember using any of them so I think I'll be okay. :)\n\nThanks for all the information and the tip on the software!\n\n"
    }
  ]
}
