{
  "id": "46508",
  "title": "InDesign Manual line break w Adobe Paragraph Composer",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi there,  \nWe keep having a problem when wanting to insert manual line breaks while using the Adobe Paragraph Composer setting (applied on a Paragraph Style). Are we missing some basic setting - is there a way to 'override' the Paraph Composer locally? I.e. applying a manual break without affecting the rest of the paragraph?  \nIn the following images you can first see a sample paragraph the way it is handled 'by default'. When trying to fix one of the lines, breaking before the word 'used', the whole paragraph gets shifted:\n\n ![](http://web.archive.org/web/20131019095647im_/http:/typophile.com/files/1_4096.png)\n\n ![](http://web.archive.org/web/20131019095647im_/http:/typophile.com/files/2_5362.png)\n\nIf you have any ideas or suggestions regarding this, we'd be more than happy. Or any advice on the hyphenation zone setting that we don't quite manage very well and might well have some impact on the problem we're having.  \nThank you,  \nFredrik, Nina\n\n",
  "author": "Fredrik",
  "time": "17 Jun 2008 — 7:27am",
  "uid": "7905",
  "comments": [
    {
      "time": "17 Jun 2008 — 8:06am",
      "content": "I suffer the same problem when applying manual line breaks.\n\nHéctor\n\n"
    },
    {
      "time": "17 Jun 2008 — 8:25am",
      "content": "So is this a limitation of the Paragraph Composer?\n\n"
    },
    {
      "time": "17 Jun 2008 — 8:29am",
      "content": "<cite>So is this a limitation of the Paragraph Composer?</cite>\n\nIt’s sort of the point of paragraph composer. Paragraph composer is not designed with much user intervention in mind, and works better for justified copy than ragged. If you want to start breaking stuff manually switch to single-line composer.\n\n"
    },
    {
      "time": "17 Jun 2008 — 8:36am",
      "content": "I would hardly call it a \"limitation\".\n\nWhat InDesign is trying to do, in Paragraph Composer mode, is to equalize the space widths of the _entire_ paragraph. That's best visible with justified text, but it also works with ragged-right text. It appears it works backwards from the manual line break for the first part, and forwards for the rest.\n\nPutting in manual line breaks should be a last resort, as these will always bite you back when editing the text afterwards. Try using \"No Break\" on just those words you want to keep together. That will allow ID to use its own judgement on where the exact line breaks will come. I use that function so much for these sort of manual tinkering, I've assigned a shortcut key to it.\n\nIf you intended to get rid of the \"used\" because it sticks out of the rest, you could try fiddling with the hyphenation settings. The \"Hyphenation Zone\" doesn't mean much to me, but you could try moving the \"Better spacing - Fewer hyphens\" slider either way.\n\nIf you desperately need _total_ control of the paragraph (all of them or just this one), switch to the Line Composer. That'll behave the way you are used of lesser programs (!)\n\n"
    },
    {
      "time": "17 Jun 2008 — 8:37am",
      "content": "Hi James,  \nYes, I did some further reading and discussion with people more experienced with inDesign and sort of came to the same conclusion.\n\nthanks,  \nFredrik\n\n"
    },
    {
      "time": "17 Jun 2008 — 8:48am",
      "content": "Hi Theunis,  \nThanks for your comments. I will try around with the \"No Break\" to get to know how that works.  \nAnd just for the record, I think InDesign is a great program ;)\n\nF.\n\n"
    },
    {
      "time": "17 Jun 2008 — 9:35am",
      "content": "An easy way to create a non breaking word is to insert a discretionary hyphen before the word.\n\n ![](http://web.archive.org/web/20131019095647im_/http:/typophile.com/files/disc_hyphen_3783.jpg)\n\n"
    },
    {
      "time": "17 Jun 2008 — 10:36am",
      "content": "This is just an observation, but why are you adding a break before \"used\"? Your rag in the original is nominal, and hyphenation is limited, but as soon as you force return, you get twice as many hyphens and the ragging seems to become more prevalent. And if you forced return because \"used\" was too close to the margin, you've now force \"found\" a few lines lower even closer.\n\nLike I said, just an observation.\n\nIt's paragraph specific (return to return), but you can switch between single-line and paragraph composer. So if you want to manipulate a single paragraph, this might lead to a more suitable solution.\n\n"
    },
    {
      "time": "17 Jun 2008 — 1:52pm",
      "content": "_as soon as you force return, you get twice as many hyphens and the ragging seems to become more prevalent_  \nWell, yes, that's the undesired effect of the manual line break that had me asking in the first place :)\n\nIn any case, for my purposes, I'll simply use the single-line composer and manually fix the rag.\n\n"
    },
    {
      "time": "17 Jun 2008 — 2:53pm",
      "content": "Fredrik,\n\nCould you post an image of the same paragraph with your manual tweaking? I'd love to compare the overall look of that against ID's automated (mathematically optimized) solution.\n\nFor justified paragraphs, I'm almost always satisfied with how ID handles it. Mainly I adjust by hand to avoid a bad break (a visual one, not technical), or to keep \"I\" or \"A\" and the next word on a single line -- just to be picky.\n\nRagged-right paragraphs are harder to judge, because of the big differences between two tries, but, while I don't always take ID's breaks for granted, I'm always struggling to get the overall look I want.\n\n"
    },
    {
      "time": "17 Jun 2008 — 3:51pm",
      "content": "Just use \"no break\" formatting and apply it to the word \"used\" and the following word. Then the paragraph composer can still work its magic on the rest of the paragraph.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "7 Nov 2008 — 8:53am",
      "content": "I'm struggling with paragraph composer as well. I appreciate the way it formats paragraphs, but bridle at losing control over the setting of type. I wish there were a happy medium between the two. In my opinion, paragraph composer could use some major improvements before it's ready for serious typesetting of text.\n\n"
    },
    {
      "time": "7 Nov 2008 — 10:26am",
      "content": "I am finishing a 900-page book, and am using Adobe InDesign CS3 for the layout. For the cases when I need to break lines at specific places, I am using Command-Return (Forced Line Break), and I am getting excellent results.\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    },
    {
      "time": "7 Nov 2008 — 2:59pm",
      "content": "Losing control? I see it as 'having less to worry about'. Yeah, if you are editing a book, it's irritating InDesign tries to make the very best of it with the word/letter spacing and hyphenation constraints you impose on it. Fortunately, Adobe foresaw that, so just select the Single Line composer to do your own thinking.\n\nKen: awww, do you _really_ favour manual line breaks (meaning: \"I want a line break HERE\") over No Break (meaning: \"I want this word/these words to be unbroken\")? I assigned a shortcut to No Break and apply it at will whenever I see something I don't like. For the rest, I let ID decide.\n\nOr perhaps that 900-page book has pages-long single paragraphs as well :-) that'd help a lot.\n\n"
    },
    {
      "time": "7 Nov 2008 — 3:18pm",
      "content": "My use of the Forced Line Break came as the result of the copyedit of the book. Almost all of these were to force a hyphenated word to the next line, particularly when it is the last word of the paragraph or is preceded by a hyphenated word.\n\nI am doing the index now. Suffice it to say, InDesign CS3's indexing capability is quite primitive compared to FrameMaker of ten years ago (which I used for typsetting First Edition of the same book).\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    }
  ]
}
