{
  "id": "46520",
  "title": "Your Favourite Bad Feature of Arial",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Arial seems to be one of the most widely hated typefaces. I'm not sure if it's because people regard it as a perversion of the holy Helvetica, or because of the intrinsic ugliness of the typeface.\n\nSo, we're gonna find out. Name your favourite bad feature of Arial!\n\n",
  "author": "maltelunden",
  "time": "17 Jun 2008 — 11:43am",
  "uid": "24816",
  "comments": [
    {
      "time": "17 Jun 2008 — 11:52am",
      "content": "My favorite (and by \"favorite\" I mean \"least favorite\") is the ridiculous leg on the uppercase R. It looks like it's doing the Hokey Pokey\n\nNow put your right foot in,  \nYour right foot out,  \nRight foot in  \nThen you shake it all about.  \nAnd then you do the Hokey Pokey  \nTurn yourself around,  \nThat's what it's all about.\n\n"
    },
    {
      "time": "17 Jun 2008 — 12:42pm",
      "content": "\\>Arial seems to be one of the most widely hated typefaces.\n\nNot for me, i think it's a useful, (very) good hinted, fully developed and adequate designed screenface. Big Problems occur when it set to small!  \nGenerally it looks disgusting, when printed out via \"print website\". Nothing more, nothing less. Aesthetically i prefer it over Helvetica on Win, even Cleartype enabled, say 5 times more!\n\n"
    },
    {
      "time": "17 Jun 2008 — 1:01pm",
      "content": "The fact that it (and Helvetica) get mentioned so frequently on Typophile.\n\n"
    },
    {
      "time": "17 Jun 2008 — 1:21pm",
      "content": "That it’s usually used by people who just don’t have a clue. When I notice Arial, it’s not because it’s a bad font, it’s because it’s been tracked in to produce lines of solid black copy, used in bold where it should be lighter, stretched or compressed by sign shops too cheap to buy type, and so on.\n\n"
    },
    {
      "time": "17 Jun 2008 — 1:43pm",
      "content": "I never have seen Arial used in professional printed material with a \"design aspect\". So what the \\*\\*\\*\\*?!\n\n"
    },
    {
      "time": "17 Jun 2008 — 2:21pm",
      "content": "Malte,\n\nDidn't realize that shooting fish in a barrel was a popular sport in Denmark. ;-)\n\n"
    },
    {
      "time": "17 Jun 2008 — 2:42pm",
      "content": "Yes, Arial may in some sense be seen as a perversion of Helvetica, but I think the primary reason there is so much rage against it is simply that it is a default, and therefore carries with it a sense of unprofessionalism. Whenever I see Arial or Arial Black used in a design, my initial thought is that the person designing it did it in PowerPoint and didn't bother to change the font from Arial.\n\nWould Arial attract so much designer rage if it hadn't been a default? Maybe, maybe not. I've seen Arial used effectively (usually with all-caps), but I've seen it used ineffectively and unprofessionally so many times that even a decent use of it sets off something in my head. There are very few times I see Arial where I don't think that Helvetica would have been a better choice (which is not to say that Helvetica would have been the best choice, but still better than Arial).\n\nWhat we need to ask ourselves is, what if Helvetica had been a default font in MS Office instead? What about Meta? Futura? Now that Verdana is a default in PowerPoint, whenever I see a presentation set in it I immediately think that it looks unprofessional, regardless of how well-designed the rest of the presentation is.\n\nI don't get this reaction to Cambria and Calibri yet, but I imagine that we'll start having similar feelings towards them about 10 years from now.\n\nThat said, the leg of the R in Arial is absurd and bothers me to no end. Also, the t and the r.\n\n"
    },
    {
      "time": "18 Jun 2008 — 12:42am",
      "content": "James, I was thinking something similar (that is, that the aversion may be caused by the frequent bad usage, not the badness of the type itself). DrDoc has the same point, and I think his question might be the right one to ask there: what if it hadn't been set as a default?\n\nPersonally, I don't get a very negative reaction when I see Arial – honestly, I might ignore a good part of those \"badly applied\" cases as well. I really do dislike the leg of the R though..\n\nA better example might have been Comic Sans actually. This typeface is another one of those widely hated typefaces (even in the non-design community). But this aversion may be connected primarily with the bad usage (at least, for me). Interestingly, I've read that it is very useable for dyslexics, because of the uniqueness of every letter. That might explain some of it's popularity, because it might be easier to distinguish each letter (not saying that the general public is dyslexic btw)\n\nSii, I didn't have the patience to learn the other kind of fishing. It's too ambigious and unpredictable. Plus, we have learned to dislike disagreements in my country. Very good for our NNP.\n\nMalte\n\n"
    },
    {
      "time": "18 Jun 2008 — 2:58am",
      "content": "Wasn't \"the most hated typeface\" used to be considered Comic Sans?\n\n;-)\n\nSzabolcs\n\n"
    },
    {
      "time": "18 Jun 2008 — 6:39am",
      "content": "Comic Sans is the font of choice for most non-typographic types (???) because they see most serif fonts as identical, and sans fonts as identical. CS is sufficiently different from other Sans that it gets chosen as \"something different\". We can all be happy that Algerian has not been adopted as a \"something different\" in the serif side.\n\n"
    },
    {
      "time": "18 Jun 2008 — 7:05am",
      "content": "Who's seen a whole book (not a kids' book, but a proper grown-up text) set in Comic Sans? ...  \nThe 2nd edition of \" [The Royal Road to Card Magic](http://web.archive.org/web/20150321004917/http:/www.amazon.co.uk/Royal-Road-Card-Magic/dp/0572029187/ref=sr_1_1?ie=UTF8&s=books&qid=1213797440&sr=8-1)\" uses CS throughout! Perhaps Vince C should have a quiet word with the people at Foulsham :-D\n\n(The first edition, BTW, used a more traditional book font!)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "18 Jun 2008 — 8:54am",
      "content": "<cite>Very good for our NNP.</cite>\n\nNNP? Net National Product? The total national annual production of goods and services, minus total bads and disservices?\n\n"
    },
    {
      "time": "18 Jun 2008 — 10:02am",
      "content": "Arial looks nice on the screen.\n\n"
    },
    {
      "time": "18 Jun 2008 — 11:52am",
      "content": "cuttlefish, yes that was what I meant. The joke might have been a bit too cryptic, on a second thought.\n\n"
    },
    {
      "time": "18 Jun 2008 — 11:58am",
      "content": "The price.\n\nIt's nice to have a free font that does the job on-screen. It's not so nice that this contributes to its use in print.\n\n"
    },
    {
      "time": "18 Jun 2008 — 1:31pm",
      "content": "I suppose Arial would get a little more respect if it wasn't generally the default font for many users. In that context, it has a lot going against it:\n\n• It's used in design settings by people who aren't designers\n\n• It's used by those same people in software that makes it very difficult to make anything look good. Word and Powerpoint don't have kerning turned on by default, so no matter what font you use, it's not going to be pretty.\n\nIt would never live down being thought of as a cheap knock-off, though.\n\n"
    },
    {
      "time": "18 Jun 2008 — 1:48pm",
      "content": "Yeah, the upcurl on the lc a bowl. That and of course the leg in the R and the overall slopiness on it's strokes.\n\nTiffany made a very funny graphic with the uc R of Arial and Helvetica a couple of years ago for Speakup.\n\nHéctor\n\n"
    },
    {
      "time": "18 Jun 2008 — 2:26pm",
      "content": "Did I?\n\n"
    },
    {
      "time": "18 Jun 2008 — 3:04pm",
      "content": "Any typesetter replaces Arial by Helvetica, that I know of. Most prints with Arial in it are products of MS Word and Publihser, along with Power Point. As for it being so hated, it may be because there will always be a copy of it somewhere, ready to print out.\n\n"
    },
    {
      "time": "18 Jun 2008 — 9:59pm",
      "content": "Tiff, I guess so... It looks like Arial was asking forgiveness to Helvetica. There is also a funny one on IBM ahead.\n\n[http://www.underconsideration.com/speakup/word\\_it/parody/parody.html](http://web.archive.org/web/20150321004917/http:/www.underconsideration.com/speakup/word_it/parody/parody.html \"http://www.underconsideration.com/speakup/word\\_it/parody/parody.html\")\n\nHéctor\n\n"
    },
    {
      "time": "18 Jun 2008 — 9:57pm",
      "content": "<cite>Any typesetter replaces Arial by Helvetica</cite>\n\nSounds reasonable, I read somewhere that Arial was designed to fit the same space that Helvetica.\n\nHéctor\n\n"
    },
    {
      "time": "19 Jun 2008 — 12:01am",
      "content": "The R leg and the sloped top of the t are the easiest ways to tell Arial from Helvetica, which I think is why many people have a negative reaction to them, because when you see them, that's usually the exact moment where you think \"ugh, that's Arial\". But I don't think those choices are inherently bad design. They would be fine choices for a typeface that isn't trying to knock off something else. In fact, if one could judge from a blank slate devoid of Helvetica's decades of cultural context, I would say the extreme squareness of Helvetica's R is the more dubious decision.\n\nHowever, in reality, Arial's R loses simply because it is part of Arial, which as a whole is inferior. Not merely because it isn't Helvetica, but because you can tell it was thrown together with very little care in regard to proportion.\n\n_My_ greatest peeve with Arial is the way the ends of such curves as c are _nearly, but not quite_ horizontal. You know how you can unbend a paper clip, but if you try to restore it to its original shape, you can't get it _exactly_ the way it was? For this reason, Arial looks like someone did that to it.\n\n"
    },
    {
      "time": "19 Jun 2008 — 12:03am",
      "content": "@Héctor I completely forgot about that. :^\\>\n\n"
    },
    {
      "time": "19 Jun 2008 — 4:14am",
      "content": "\" I read somewhere that Arial was designed to fit the same space that Helvetica. \"  \nPeople replace Arial by Helvetica, if it doesn't change the flow of text in subsequent pages. If am asked to replace Arial by Helvetica in a 64 page book, I will have to say, \"that is extra\". It doesn't occupy the exact same space in some cases.\n\n"
    },
    {
      "time": "19 Jun 2008 — 4:27am",
      "content": "\"Your Favourite Bad Feature of Arial\"  \nThat it exists.\n\n\" It doesn’t occupy the exact same space in some cases.\"  \nIt would need to duplicate Helvetica's kerning table to do so, which is, I think, one cleptocratic step too far for even Microsoftic Mankind.:)\n\nCheers!\n\n"
    },
    {
      "time": "19 Jun 2008 — 5:08am",
      "content": "_You know how you can unbend a paper clip,_  \nBrilliant metaphor!\n\n"
    },
    {
      "time": "19 Jun 2008 — 9:43am",
      "content": "Just for the record, I hate Bank Gothic more than Arial.\n\n"
    },
    {
      "time": "19 Jun 2008 — 10:33am",
      "content": "First posting - hello.\n\nI have \\_no\\_ typographic expertise, just an interest. Arial & Helvetica are of course ubiquitous but somehow as a layman I feel irritated by Arial but not Helvetica. Perhaps it's a learned \"type snobbery\"? The R bothers me also, not just the strange leg but the bowl seems too wide/elongated.  \nOf course here in the UK, Gill Sans is very widespread & has a \"quirky\" R, but I still like it. Don't know why. I acknowledge cerulean's point that Helvetica's R is out of keeping with the rest of the face. The BBC News mixes Helvetica & Gill Sans all the time, but I'm getting over it :)\n\nArial's a lacks something compared to Helv, but the ubiquity bothers me most. In the UK health service it is actually recommended for printed communications, which irks me.  \nBut the British Medical Association delivered a petition with 1M patient's signatures to the UK Parliament this month, and the front cover appeared to be printed in Comic Sans MS, which was about the design low point of the month for me.\n\nPaul\n\n"
    },
    {
      "time": "19 Jun 2008 — 4:39pm",
      "content": "I don't think kerning is the issue, as I understand Helvetica metrics were a moving target even back in 1991. And beyond the basic char-set no attempt was made to match Helvetica widths - in fact the version of Arial in Vista (and latest Mac OS) has many characters not in any version of Helvetica. And as mentioned elsewhere the target for metrically compatible fonts is now Arial, not Helvetica - Albany, Liberation Sans to name but two.\n\nBut the kerning issue does raise an interesting question as to if its legally possible to make a metrically compatible version of a modern multilingual OpenType font where metrics, class kerning and OpenType features would need to be matched.\n\n"
    },
    {
      "time": "19 Jun 2008 — 8:36pm",
      "content": "When I was in college, my favorite (bad) feature of Arial was its metrics: namely it could turn your 12 page paper typed in Garamond 12pt into the 15 page paper that the professor wanted. (I was a Classics major, and few, if any, profs cared about the font used.)\n\nTo weigh in on the discussion about why Arial is so hated, the lore, at least, is that Microsoft didn't want to pay royalties to Linotype like Apple did for Helvetica and so commissioned Arial. (Can anyone verify this?) The problem, of course, is that Arial is a poor replacement for Helvetica, hence, designers' white-hot ire.\n\nConsidered on its own, Arial is functional type. Granted, as many have said before, its 'R', 'C' and 't' are completely inadequate and unnerving. But it will do in a pinch. It has no place in a professional design, but for everyday tasks, it is not unacceptable.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "19 Jun 2008 — 9:41pm",
      "content": "\\>To weigh in on the discussion about why Arial is so hated\n\nI don't think that's the reason - after all metrically compatible fonts were/are nothing new. I think the problem people have is that Arial is far more popular/ubiquitous, to the extent that Apple of all people, licensed it from Microsoft.\n\n"
    },
    {
      "time": "20 Jun 2008 — 1:47am",
      "content": "For me, there are two big problems of Arial: kerning and diacritics.  \n**Kerning** There is no kerning of accented glyphs in Arial. It looks horrible when Arial is used for setting Czech language, for example the name TAŤÁNA looks like TA Ť ÁNA.  \n**Diacritics** The shape of several accents is very poor. The position of (comma-like) caron in the 'tcaron' glyph is not acceptable. It creates a big gap between 'tcaron' and next glyph.  \nYou can compare Arial with Linotype Helvetica CE. (Although not perfect, at least acceptable).\n\n ![](http://web.archive.org/web/20150321004917im_/http:/typophile.com/files/arial_5909.gif)\n\n"
    },
    {
      "time": "20 Jun 2008 — 6:12am",
      "content": "Sadly it's impossible to fix the most popular font in the world without breaking billions of documents. Best way to address this is start over - and you guys get to pick the name \"Arial Pro\" or \"Arial New\" - or should I just stick with Calibri?\n\n"
    },
    {
      "time": "20 Jun 2008 — 6:34am",
      "content": "<cite>you guys get to pick the name “Arial Pro” or “Arial New” - or should I just stick with Calibri?</cite>\n\n-with tongue planted firmly in cheek- Arial Neue.\n\n"
    },
    {
      "time": "20 Jun 2008 — 8:52am",
      "content": "Can I name a good feature as well?\n\n[Rails](http://web.archive.org/web/20150321004917/http:/www.rails.nl/new/index.php) uses Arial quite nicely.\n\n ![](http://web.archive.org/web/20150321004917im_/http:/typophile.com/files/R0012609_4253.JPG)\n\n ![](http://web.archive.org/web/20150321004917im_/http:/typophile.com/files/R0012610_4635.JPG)\n\n"
    },
    {
      "time": "20 Jun 2008 — 12:12pm",
      "content": " ![](http://web.archive.org/web/20150321004917im_/http:/typophile.com/files/Graphic1_5494.jpg)\n  \nArial Black has bad curves. \n\nOh, and name the new version Zarial, and that'll be the end of it.\n\n-=®=-\n\n"
    },
    {
      "time": "20 Jun 2008 — 3:20pm",
      "content": "I like it - I beleive there would be far more Zapfino abuse if it started with \"A\"\n\nCheers, Si\n\n"
    },
    {
      "time": "20 Jun 2008 — 4:31pm",
      "content": "Is it overkill to post a link to Mark Simonson's [\"The Scourge of Arial\"](http://web.archive.org/web/20150321004917/http:/www.ms-studio.com/articles.html) here?\n\nNo one's mentioned it so far, but it is a great essay on the typeface we love to hate. :-)\n\n"
    },
    {
      "time": "20 Jun 2008 — 5:34pm",
      "content": "<cite>No one’s mentioned it so far, but it is a great essay on the typeface we love to hate. :-)</cite>\n\nReally, cause I always thought Comic Sans was the one we hated. Boy, we're as bad as a bunch of politicians, flip-flopping back and forth.\n\nI think we admire Arial. Kinda like G.I. Joe admires Cobra Commander. It's his unflinching ability to pick himself (and his troops) back up time and time again, and continue to fight. Always with the eye on the prize.\n\nCourse, Arial succeeded where Cobra failed, what with it's near world domination and all.\n\n"
    },
    {
      "time": "20 Jun 2008 — 7:56pm",
      "content": "I think the key distinction between Comic Sans and Arial is that even laypeople (those not in the design community) love to hate Comic Sans. Most people outside of the design community can't tell the difference between one sans serif and another, let alone Helvetica and Arial. Almost everyone knows that Comic Sans is rarely a good choice; they don't know that about Arial.\n\n"
    },
    {
      "time": "20 Jun 2008 — 11:02pm",
      "content": "I had a boss once who fancied herself a graphic designer, and she made all the menus (it was a bowling alley) and gave each menu item its own Microsoft Clip Art of the product. So for a hot dog it would say HOT DOG (she didn't use lowercase, and she generally spoke in all caps too) and next to the words would be a helpful picture of what a hot dog looked like.\n\nNaturally, to give it more of a classy upscale look (she was always trying to \"trend up\" our brand image) she went for the all-business look of Times New Roman, with the bold button selected for emphasis. On the side she had a business making wedding picture montage DVDs set to oldies, complete with fades and wipes to cut from picture to picture.\n\nPeople like this need Arial when going for that more modern feel.\n\n"
    },
    {
      "time": "21 Jun 2008 — 8:23am",
      "content": "\\>laypeople (those not in the design community) love to hate Comic Sans.\n\nYou are joking, right?\n\n"
    },
    {
      "time": "21 Jun 2008 — 11:15am",
      "content": "Si: No, I'm not. I should probably have expressed myself better, though. I know people who can't tell you the difference between Arial and Helvetica who proudly sport \"ban comic sans\" shirts and hats and complain about its overuse and how terrible it is. I'm not saying that everyone hates Comic Sans; I'm saying that all sorts of people — not just those passionate about type — hate Comic Sans.\n\n"
    },
    {
      "time": "21 Jun 2008 — 11:42am",
      "content": "for sure. If you're saying that it's easy to identify and over-used - I can't disagree.\n\n"
    },
    {
      "time": "21 Jun 2008 — 12:14pm",
      "content": "Isn’t there some way that you guys can use all those crazy DRM systems in Windows to limit Arial use to only opening and printing existing documents?\n\nNeue Arial does sound fun, tho…\n\n"
    },
    {
      "time": "21 Jun 2008 — 1:26pm",
      "content": "This isn't the iPhone - you can't tell people what they can and can't do ;-)\n\nHowever the transition from Arial to Calibri isn't yet complete - still have some way to go and a few tricks up our sleeves.\n\n"
    },
    {
      "time": "21 Jun 2008 — 3:09pm",
      "content": "I bet if the MPAA lawyers claimed to own Arial it would get locked down in a jiff ;)\n\n"
    }
  ]
}
