{
  "id": "46533",
  "title": "What's Sagmeister using on his new book?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20081013103430im_/http:/www.typophile.com/files/Untitled-1_4572.jpg)\n\nStraight-forward one here I’d imagine, can someone ID this please.\n\nThanks\n\n [‹ On on Leaf logo](http://web.archive.org/web/20081013103430/http:/www.typophile.com/node/46571 \"Go to previous forum topic\") [Fergie's The Dutchess.. ›](http://web.archive.org/web/20081013103430/http:/www.typophile.com/node/46658 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013103430/http://www.typophile.com/user/25172\" title=\"View user profile.\">naoiseo</a>",
  "time": "<br>",
  "uid": "25172",
  "comments": [
    {
      "time": " 17.Jun.2008 9.14pm",
      "content": "hmmmm...most of the font looks like either\n\nArial Monospaced Bold\n\nor\n\nF2F OCR Alexczyk\n\nbut am totally foxed with the Y. The top edge turns vertical which none of the above fonts do...\n\n—  \narjun\n\n"
    },
    {
      "time": " 17.Jun.2008 9.46pm",
      "content": "He has been known to draw his own letters. No reason he couldn’t make his own font. But I think this has come up here before, maybe without an answer.\n\n"
    },
    {
      "time": " 18.Jun.2008 4.19am",
      "content": "Jaysus I thought this would be an open and shut case. It’s certainly not Arial Mono, as Arjun pointed out the leg of R turns vertical, and the X is the same (although it’s not in my sample). Another give-away is the leg on the G. This may well be Sagmeisters own creation as Stephen pointed out. I know for a fact that it this is a fully functioning (possibly upercase only) font as he was using it in a presentation he gave in Dublin about a week ago.\n\nSomebody must know more...!\n\nHere’s another sample to help:\n\n ![](http://web.archive.org/web/20081013103430im_/http:/www.typophile.com/files/thingsihavelearned_poster_5980.jpg)\n\n"
    },
    {
      "time": " 18.Jun.2008 4.26am",
      "content": "Looks like Lineto’s Lutz Headline with modifications\n\n"
    },
    {
      "time": " 18.Jun.2008 4.34am",
      "content": "I think Lutz Headline with alternates or modified is what Stephen suggested when this came up before.\n\n"
    },
    {
      "time": " 18.Jun.2008 6.33am",
      "content": "Its Pretty close to Alpha headline also, minus the S and minus the G also  \n [http://www.lineto.com/The+Fonts/Custom+Typefaces/Alpha+Headline/](http://web.archive.org/web/20081013103430/http:/www.lineto.com/The+Fonts/Custom+Typefaces/Alpha+Headline/ \"http://www.lineto.com/The+Fonts/Custom+Typefaces/Alpha+Headline/\")\n\n"
    },
    {
      "time": " 18.Jun.2008 6.36am",
      "content": "I have to apologise here. This is clearly Lutz Headline or a mod of it. I had been under the impression from a conversation I had with another Typophile member who will remain nameless! That this was not Lutz, I trusted his judgement and didnt bother to check!\n\nStephen/Jan or whoever, where do you think the letters have been modified?\n\n"
    },
    {
      "time": " 18.Jun.2008 7.10am",
      "content": "My guess is a custom font from Mr Windlin.\n\nClosest to Lutz, including all the numbers, with I, R, V from Alpha, J a mix of the two, and G from somewhere else!\n\nI wonder if there’a a clue on the lineto website:\n\n<cite>Lutz Headline isn’t exactly a «New Release» - it had been a favourite on the former incarnation of Lineto ever since its inception in 1998. When relaunching in the spring of 2004, the font was pulled from the library, overhauled slightly and is now being re-issued due to popular demand.<br>\nLike Alpha Headline, this headline typeface is derived from an anonymous design still in use today for the production of car registration plates in the United Kingdom.</cite>\n\nCould it be this original version of Lutz? (It isn’t very similar to UK plates, Alpha in its entirety is much closer).\n\n"
    },
    {
      "time": " 18.Jun.2008 8.54am",
      "content": "May I suggest a gang of heavily armed (with bananas) typophilers corner him during typecon and hold him hostage until the font name is revealed?\n\n"
    },
    {
      "time": " 18.Jun.2008 9.33pm",
      "content": "I’m getting very curious now as to what font that might be... I vouch for Sii’s idea!\n\n—  \narjun\n\n"
    },
    {
      "time": " 19.Jun.2008 4.56pm",
      "content": "what’s interesting is that he uses different versions of the same letter in different parts of the book – for example the ’i’ in ’in my life’ is different to the ’i’ in ’stefan sagmeister’, yet the typeface on the whole is the same. One ’i’ has slabs on top and bottom (not sure if that’s the best way of describing it but hopefully you get what I mean) whereas the other doesn’t.\n\n"
    },
    {
      "time": " 19.Jun.2008 7.06pm",
      "content": "Definitely Lutz Headline. That S is distinctive.\n\n"
    },
    {
      "time": " 21.Jun.2008 4.39am",
      "content": "its the original version of lutz headline,  \nwhich has lower and uppercase variants. the  \nfirst post (Things I Have Learned…) is the  \nuppercase.\n\n"
    }
  ]
}
