{
  "id": "46540",
  "title": "Language specific (German) use of ligatures",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I know that for some languages, there are specific rules as to when a ligature should be used. In German for instance it is said that ligatures should not be used for compounds or where a word’s stem and its prefix are connected. A common example would be the word “Auflauf”: no fl-ligature because it is a compound from “auf” and “lauf”.\n\nNevertheless, there are quite a few typefaces that would just look stupid if one wouldn’t use the ligatures as the spacing is set up in a way that assumes that whenever a ligature could be used it will be used - try to look at “Auflauf” in Minion-Itallic without the fl-ligature.\n\nMy personal assumption would be to just do away with the guideline that says to not use the ligature and use whatever looks best. Manually adjusting the kerning so that the characters do not clash looks even worst (at least in my experiments). How are others handling these situations?\n\n ![](http://web.archive.org/web/20090924021329im_/http:/www.typophile.com/files/auflauf_4400.jpg)\n\n",
  "author": "<a href=\"/web/20090924021329/http://www.typophile.com/user/30289\" title=\"View user profile.\">Lars Oppermann</a>",
  "time": "<br>",
  "uid": "30289",
  "comments": [
    {
      "time": " 18.Jun.2008 2.31am",
      "content": "<cite>This looks best but “they” say it’s wrong.</cite>\n\nIt not about looks! It’s about reading. Most Germans would read “Au-flauf” if you set it with a ligature.  \nYou are right, there are typefaces which create a huge gap if you don’t use the ligature. But that doesn’t change the rules. From the standpoint of the type designer it would be a good idea to include a language-specific fl-glyph or even better: a contextual (shorter) f.\n\nSince your German you might also checkout this discussion:  \n [http://www.typografie.info/typoforum/viewtopic.php?f=1&t=3050](http://web.archive.org/web/20090924021329/http:/www.typografie.info/typoforum/viewtopic.php?f=1&t=3050 \"http://www.typografie.info/typoforum/viewtopic.php?f=1&t=3050\")\n\n"
    },
    {
      "time": " 18.Jun.2008 3.04am",
      "content": "Thanks Ralf,. The discussion in the thread you pointed to was quite interesting.\n\nMy personal conclusion would be that the rule should be considered in the context of the type face to which it is being applied. There will be cases where the rule works just fine and where an adjustment of spacing yields good results. In other cases, not using ligatures may produce really ugly collisions (and thus negatively impact legibility) and (or) adjusted spacing may produce large gaps (which again would deter legibility). In such cases I’d say using the ligature and breaking the rule (or guideline) might be the lesser evil.\n\n"
    },
    {
      "time": " 18.Jun.2008 3.39am",
      "content": "Yeah. I actually DID read once (though that’s unique and anecdotal) Auflage as [ɔˈflaːʒ], “interpreting” it as a french loan-word because it employed a ligature where it should not have. I had to re-read the sentence thrice to get it right.\n\nIf you don’t like it, use a font that does not need ligatures and have a narrow f per se.\n\n"
    },
    {
      "time": " 18.Jun.2008 4.35am",
      "content": "fi & fl have been discussed at [http://www.typophile.com/node/19025](http://web.archive.org/web/20090924021329/http:/www.typophile.com/node/19025 \"http://www.typophile.com/node/19025\") (which originally was about long-s).  \n [http://www.typophile.com/node/43911](http://web.archive.org/web/20090924021329/http:/www.typophile.com/node/43911 \"http://www.typophile.com/node/43911\") is about ch & ck, related in a way.\n\n"
    },
    {
      "time": " 18.Jun.2008 11.52am",
      "content": "On the InDesign team, we discussed if we could use the hyphenation/spelling dictionary to determine where to apply ligatures in German, but we decided that the dictionaries would have to be modified and the designer is going to care one way or the other so nothing was done.\n\n"
    },
    {
      "time": " 18.Jun.2008 11.51pm",
      "content": "Also related: [f + umlauts](http://web.archive.org/web/20090924021329/http:/www.typophile.com/node/40439)\n\n"
    },
    {
      "time": " 19.Jun.2008 1.44am",
      "content": "Eric,\n\nI think you should consider it again. The problem of no dictionary support for ligatures in German language leads to the strategy of avoiding the usage of ligatures at all.\n\nBTW: Ligatures are no solution for fixing wrong designed or spaced base glyphs. This flaw makes a lot of fonts unuseable for good German typography.\n\n— [astype.de](http://web.archive.org/web/20090924021329/http:/www.astype.de/)—\n\n"
    },
    {
      "time": " 19.Jun.2008 11.00am",
      "content": "Andreas,  \nI agree that avoiding ligatures completely could be an unfortunate consequence of not having the correct ligatures for German in the first place. There were multiple issues that prevented us from just “doing it right” for German, including:  \n- Complexities around determining the correct solution for script faces or faces with many ligatures. Would some ligatures be considered part of the design and be wrong if disabled?  \n- Lack of dictionary support. We don’t have data to work from.\n\nHowever, I think that maybe some mechanism similar to adding custom words or custom hyphenation points to the user dictionaries could be considered here.\n\nIn the mean time, you can insert a _“non-joiner”_ (`U+200C`) between components. Not a great solution, but you can use find change and replace “`auflage`” with “`auf^jlage`” in this particular example. Menu: Type \\> Insert Special Character \\> Other.\n\n"
    },
    {
      "time": " 20.Jun.2008 1.29am",
      "content": "The technical possibilities aside, the fact remains that there are type faces, which are incompatible with the rules for ligature use in some languages (German in this case).\n\nI would argue, that this incompatibility does only exist in type face that are designed in a way where ligatures imply too strong a connection of the individual characters they are representing. After all, there is no implied semantic in a standard ligature related to the word of which it is a part. Thus, if we accept what is implied by this rule, namely that ligatures that connect characters very strongly imply additional semantic, this would mean that such type face, as beautiful as they may be (e.g. Garamond) are in some way flawed. At least if you follow the reasoning behind the German ligature rules.\n\nOf course, typography like language is part of cultural development and thus is is perfectly acceptable that typographers of different languages arrived at different conclusions concerning the question of how much semantic a standard ligature carries. It would also very much depend on the type-faces they looked at in order to form that conclusion. Nevertheless, now that typography is a much more globalized thing, it may indeed be time to re-evaluate such conclusions.\n\nIf you accept that a ligature implies semantic relationship, you can also find english examples that may be a problem. Examples I could come up with in short time are “elflike” and “selfless” (in Garamond Premiere):\n\n ![](http://web.archive.org/web/20090924021329im_/http:/www.typophile.com/files/liga_5602.jpg)\n\nThus whenever a type face’s ligatures make german “auflegen” “au flegen” or “aufl egen” they also make “selfless” into “sel fless” or “selfl ess”. Thus, you would have to conclude that such a type face isn’t fully usable in either language.\n\nI personally think the people that made the typefaces had a better understanding of how the characters and ligatures are perceived than the people that came up with the rules for ligature use (this is an assumption). Hence if in doubt, I’d rather trust the type.\n\n"
    },
    {
      "time": " 20.Jun.2008 1.42am",
      "content": "An alternate conclusion would of course be, that a contextual shorter “f” that does not connect up to the l would be of use in other languages too. Even if that language does not come with rules that disallow the use of ligatures in certain circumstances. I think I find this solution proposed by Ralf the most elegant one and I’d use it for the “elflike” and “selfless” cases too.\n\n"
    },
    {
      "time": " 20.Jun.2008 4.43am",
      "content": "The worst typographic (actually: type design) sin I know and hate is, when the basic design of the font has a narrow f _per se_ that would not collide with either i or l, and type designers fill the MacRoman’s fi/fl ligature slots with connected glyphs. ACK!\n\nThis is a perversion of the idea of ligatures where collision is remodelled. Here, naturally, if you don’t want to leave the encoding slot empty, just use a glyph composite of f and i, as if they would follow each other when set normally.\n\nThese forcedly connected f-i ligatures have usually an upper arc of the f which is -naturally- way to wide for the design idea of the whole alphabet and strikes the eye immediately. An other mistake is, though this happens with “legitimate” ligatures as well is when the stems of the f and the i the ligature do not fit the overall rythm of the font.\n\nSzabolcs\n\n"
    },
    {
      "time": " 20.Jun.2008 6.06am",
      "content": " ![](http://web.archive.org/web/20090924021329im_/http:/www.typophile.com/files/Courier_5963.png)\n\n"
    },
    {
      "time": " 20.Jun.2008 10.27am",
      "content": "<cite>Maybe in order to understand mankind, we have to look at the word itself. Basically, it’s made up of two separate words — “mank” and “ind.” What do these words mean? It’s a mystery, and that’s why so is mankind.</cite>\n\n—Jack Handey\n\n"
    },
    {
      "time": " 20.Jun.2008 10.47am",
      "content": "Andreas said: <cite>The problem of no dictionary support for ligatures in German language leads to the strategy of avoiding the usage of ligatures at all.</cite>\n\nTo speak from my experience, I think the opposite is true: fl/fi ligatures are switched on by default (in InDesign, that is). And people are lazy. Therefore, most of the time we’ll end up with ligatures for _all_ instances, whether correct or not.\n\nRalf said: <cite>Most Germans would read “Au-flauf” if you set it with a ligature.</cite>  \nI’m skeptic. Yes, it’s a problem. And yes, it’s not very nice. On the other hand, people are not stupid machines. I’ve read texts with incorrect ligatures without having serious difficulties. Admittedly, sometimes I get stuck. But I _always_ get stuck and have to read the line again when the typesetter wanted to do it overly correct and added (too much) extra white-space, like in Lars’ example #3.\n\nThe solution is having a ‘short f’, be it by default or as an alternate.\n\nAnd: there will always be ambiguous words, like be-inhalten [to contain] — bein-halten [to hold a leg], or the notorious Röſchenhof—Röschenhof. Or would you use a diaeresis for ‘beïnhalten’ and a long s for the latter? ;-)  \nF\n\n"
    },
    {
      "time": " 20.Jun.2008 11.32am",
      "content": "There was once a London comedian who took his name from the distribution of letters printed across two swing doors, Nosmo King. That doesn’t quite jive, as the letters should have been evenly distributed as NO SM|OKING, but I guess that Nosm Oking wasn’t such a snappy name.\n\n"
    },
    {
      "time": " 20.Jun.2008 11.53am",
      "content": "A quick interjection by a non-type designer: I have a theory about how one shouldn’t used ligatures beyond text size because they really do become too distracting. So, if the ligatures are designed well, and the typeface is spaced well, and we presume that we’re only using them at text sizes are they really a problem?\n\n"
    },
    {
      "time": " 20.Jun.2008 12.04pm",
      "content": "There is a clear distinction in InDesign betweeen _Ligatures_, which is on by default, and _Discretionary Ligatures_, which is off by default.\n\nTherefore it behooves German editors to be aware of the opportunity for confusion, and to mark words such as “auflauf” to the effect of “No Ligatures”, as the f ligatures are generally included as basic Ligatures, not Discretionary. Writers could pre-empt the situation, as Eric notes, with a “non-joiner”.\n\nBy the same token, type designers should make a clear distinction between their “f” ligatures and non-ligated “f” combinations, which should be designed and kerned to not overlap.\n\n"
    },
    {
      "time": " 20.Jun.2008 12.33pm",
      "content": "<cite> Lack of dictionary support. We don’t have data to work from.</cite> [Eric Menninga]\n\nI always thought that the rule is that you don’t make a ligature with two letters between which you are allowed to hyphenate. For instance, if I look at the German wiktionary [http://de.wiktionary.org/wiki/Auflauf](http://web.archive.org/web/20090924021329/http:/de.wiktionary.org/wiki/Auflauf \"http://de.wiktionary.org/wiki/Auflauf\"), I see:\n\n ![](http://web.archive.org/web/20090924021329im_/http:/www.typophile.com/files/auflauf_5982.jpg)\n\nand there is hyphenation between Auf and lauf. It seems to me the data is readily available. Am I mistaken?\n\nMichel\n\n"
    },
    {
      "time": " 20.Jun.2008 1.12pm",
      "content": "<cite>It seems to me the data is readily available.</cite>\n\nWhat about homographs, though, like “beinhalten.” That would probably be very difficult to code for.\n\nBut then don’t hyphenation engines have to compensate for homographs somehow?\n\n"
    },
    {
      "time": " 20.Jun.2008 1.20pm",
      "content": "<cite>Am I mistaken?</cite>\n\nMichel, I’m afraid it’s not as easy as that.  \nYou don’t use a ligature across _morpheme_ borders.\n\nIn a word like ‘treffen’ [to meet, to hit], you are allowed to hyphenate between the ‘f’s, but there may be a ligature, too.\n\n ![](http://web.archive.org/web/20090924021329im_/http:/www.typophile.com/files/treffen_3922.png)\n  \n [http://de.wiktionary.org/wiki/treffen](http://web.archive.org/web/20090924021329/http:/de.wiktionary.org/wiki/treffen \"http://de.wiktionary.org/wiki/treffen\")\n"
    },
    {
      "time": " 20.Jun.2008 1.32pm",
      "content": "A heuristic that could potentially work would be:  \n1) Get the hyphen points for a word. e.g. auf-lauf tref-fen  \n2) For each hyphen point, see if the letters before the break & the letters after the break constitute legal words (the spelling dictionary would be used here). e.g. ’auf’+’lauf’, ’tref’+’fen  \n3) If both parts are legal words, then assume that there shouldn’t be a ligature there.\n\nThis might be an example of the cure being worse than the disease...\n\n"
    },
    {
      "time": " 20.Jun.2008 1.47pm",
      "content": "<cite>Michel, I’m afraid it’s not as easy as that. You don’t use a ligature across morpheme borders.</cite>\n\nMakes sense. And I see that there is very recent research on the subject, without much results. Would there be a market for a good German morpheme analyser?\n\n"
    },
    {
      "time": " 20.Jun.2008 2.33pm",
      "content": "Given all that has been said in this and previous discussions, and especially Florian’s comment:  \n<cite>fl/fi ligatures are switched on by default (in InDesign, that is). And people are lazy. Therefore, most of the time we’ll end up with ligatures for all instances, whether correct or not</cite>,  \nthe suggested use of the _non-joiner_ character looks like a good solution: Apply ligatures globally, and manually deal with the few cases where no ligatures are desired. (And typographic “rules” are subject to change like everything.)\n\n"
    },
    {
      "time": " 25.Jun.2008 4.21am",
      "content": "In the daily business (magazines and dailies), no writer have the time to include non-joiners or to make special selections for ligatures. They work with pre defined styles at best. So the ligature feature is set by default to off by the informed “design” head. So its true, you can divide German publications into two main categories.\n\n1. no ligatures used at all  \n2. the lazy bones - ligatures used, right or wrong\n\nAnd some publishers use fonts with wrong\\* designed f base glyphs, what joins with most diacritics of the next letter.\n\n\\*wrong in the case the font is used for languages with lots of diacritics\n\n— [astype.de](http://web.archive.org/web/20090924021329/http:/www.astype.de/)—\n\n"
    }
  ]
}
