{
  "id": "46550",
  "title": "modifying existing font?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "am I allowed to modify a font I bought the license for?  \nA client chose a specific font for his house style but would like to have some tiny modifications.  \nhow do I deal with that?\n\nthanx a lot for help…\n\n [‹ What to teach in a first-year typography class?](http://web.archive.org/web/20081011012306/http:/www.typophile.com/node/46556 \"Go to previous forum topic\") [The Typographer's Library ›](http://web.archive.org/web/20081011012306/http:/www.typophile.com/node/46598 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011012306/http://www.typophile.com/user/32612\" title=\"View user profile.\">betterdesigners</a>",
  "time": "<br>",
  "uid": "32612",
  "comments": [
    {
      "time": " 18.Jun.2008 8.01am",
      "content": "Information on modification rights would be included in the license - if its not clear send us a pointer and we’ll take a look.\n\nWhat’s almost certain is that the client will need a separate license for the font.\n\nCheers, Si\n\n"
    },
    {
      "time": " 18.Jun.2008 11.02am",
      "content": "Here’s something I’ve always wondered, is it possible to transfer a font license to a client once you are done using it? For example, you purchase a typeface, and create the work, then supply it to your client along with the font license, and the delete the original from your machine.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20081011012306/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 18.Jun.2008 12.27pm",
      "content": "A search will identify threads on font license transfers but the scenario you describe seems a bit self defeating.\n\nA few weeks/months/years down the line when the client needs some more tweaks, do you ask them to stop using it and transfer the license back to you?\n\n"
    },
    {
      "time": " 18.Jun.2008 1.00pm",
      "content": "@betterdesigners It depends upon the foundry. Definitely review your EULA. Or you could tell us who the foundry is.\n\n@oprion Again. It depends upon the foundry. Definitely review your EULA. Or you could tell us who the foundry is.\n\n"
    },
    {
      "time": " 19.Jun.2008 6.42am",
      "content": "thx @ all…\n\nI am talking about the FF Unit from FontShop.  \nIf someone knows about the right of modifying them, I would be pleased\n\n"
    },
    {
      "time": " 19.Jun.2008 6.55am",
      "content": "<cite>2.6. You may not modify, adapt, translate, reverse engineer, decompile, disassemble, alter, or attempt to discover the source code of the Font Software. If you want to make modifications to the Font Software, you must obtain the prior written consent of FSI.</cite>\n\n[FontFont End-User License Agreement (](http://web.archive.org/web/20081011012306/http:/www.fontfont.com/support/licensing.ep) [EULA](http://web.archive.org/web/20081011012306/http:/www.typophile.com/wiki/EULA))\n\n"
    },
    {
      "time": " 19.Jun.2008 1.50pm",
      "content": "Depending upon the budget for the job you might call Fontshop and discuss pricing for having your modifications incorporated. They are very friendly and amenable folks.\n\n"
    }
  ]
}
