{
  "id": "46559",
  "title": "what font is this?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "i’m trying to impress my father-in-law with my font recognizing abilities but i can’t pinpoint this one. anybody?\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.jpg](http://web.archive.org/web/20080905085233/http:/typophile.com/files/Picture%201_55.jpg) | 13.35 KB |\n\n [‹ Font used in the Incredibles movie](http://web.archive.org/web/20080905085233/http:/www.typophile.com/node/46602 \"Go to previous forum topic\") [2 Fonts, any ideas? ›](http://web.archive.org/web/20080905085233/http:/www.typophile.com/node/46530 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905085233/http://www.typophile.com/user/32614\" title=\"View user profile.\">nopattern</a>",
  "time": "<br>",
  "uid": "32614",
  "comments": [
    {
      "time": " 18.Jun.2008 8.11am",
      "content": "Dunno. Bloody horrid though... ; )\n\n\\_\\_  \nRez\n\n"
    },
    {
      "time": " 18.Jun.2008 8.15am",
      "content": "Yeah, tell your father-in-law you can only id the good stuff.\n\n"
    },
    {
      "time": " 18.Jun.2008 8.23am",
      "content": "i never said it was good or worth using, but he needs it, and Oncology is the study of tumors and cancer. so im not about to poke fun... ha...\n\n"
    },
    {
      "time": " 18.Jun.2008 8.57am",
      "content": "myself and another designer have concluded it’s close enough to Abadi with some Faux Bold turned on to do the trick\n\n"
    },
    {
      "time": " 18.Jun.2008 8.58am",
      "content": "I would really like to see a well thought rationale why this type, not the logo, is so horrible. Just wondering.\n\nMichael\n\n"
    },
    {
      "time": " 19.Jun.2008 11.16am",
      "content": "Speaking for myself, and with no guarantee of well-thought rationality, what bothers me about the sample is its overhinting and the resulting damage to the letterforms and spacing, especially in the smaller size. Windows loves torturing letterforms like this, trading fidelity to form and spacing for an eerie oversharpness.\n\nMore subjectively, the caps seem too narrow, the descenders too long, and the spacing too loose and inconsistent. It seems like a font that had to conform to some earlier bitmap font, maybe, and suffered for it. Faux bolding and/or squooshing could also play a role.\n\n"
    }
  ]
}
