{
  "id": "46557",
  "title": "Need your opinion on my new logo/font",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,\n\nThe company is targeting the upper end of the luxury market, we will be offering a range of furniture for both residential and commercial clients, aswell as building services and personal services around the yorkshire area (UK)\n\nHave a look at the logo concept below and let me know your thoughts, the background and colour have not yet been finalised so throw in your ideas on that also, much appreciated,\n\nRichard\n\n| Attachment | Size |\n| --- | --- |\n| [adelto.JPG](http://web.archive.org/web/20080624181305/http:/typophile.com/files/adelto_0.JPG) | 11.64 KB |\n\n [‹ Could you help me to discover the name of this types?](http://web.archive.org/web/20080624181305/http:/typophile.com/node/46515 \"Go to previous forum topic\") [Black (Death) Metal typography ›](http://web.archive.org/web/20080624181305/http:/typophile.com/node/36731 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080624181305/http://typophile.com/user/30659\" title=\"View user profile.\">rbarker21</a>",
  "time": "<br>",
  "uid": "30659",
  "comments": [
    {
      "time": " 18.Jun.2008 8.10am",
      "content": "I like the overall look. Like you say, colours have to be finalised, but I like it. The only thing I would say, is that because of the modern look of the typeface it doesn’t give the immediate impression of “...the upper end of the luxury market”, but that’s solely based on the usual formulae that some high end companies tend to go for more austere serif fonts(in my experience) like Times New Roman etc. But then these conventions should be challenged from time to time. Like it!\n\nJH\n\n"
    },
    {
      "time": " 18.Jun.2008 11.30am",
      "content": "Hi JH,\n\nYeah i know what you mean about the usual look, but i just thought this font is something that other companies don‘t use, and hopefully it will make the company stand out more, have you any preferance on the colour of the font? I was thinking either black or red, if you have any friends on here, please let them know about the font, as i‘d love to hear more peoples opinions and suggestions, it all helps!!!\n\nthanks again,\n\nRichard\n\n[http://www.adelto.co.uk](http://web.archive.org/web/20080624181305/http:/www.adelto.co.uk/ \"http://www.adelto.co.uk\")\n\n"
    },
    {
      "time": " 18.Jun.2008 1.14pm",
      "content": "I clicked on the image link, before reading the post and tried to guess the type of company being promoted. My guess was services rather than high-end-furniture.\n\nVisually the “lt” combination is a bit troubling and visually the “e” looks wrong, maybe too small, too happy? Overall the letters look as if they’ve all been lined up against the wall.\n\n"
    },
    {
      "time": " 18.Jun.2008 1.55pm",
      "content": "Thanks for that, your point is appreciated, any opinion on a font that you think would look high end, i really like the font my developer chose, and think that it is modern, fresh and different, not the usual look, but i am open to suggestions.\n\nKeep them coming!!\n\n[http://www.adelto.co.uk](http://web.archive.org/web/20080624181305/http:/www.adelto.co.uk/ \"http://www.adelto.co.uk\")\n\n"
    },
    {
      "time": " 18.Jun.2008 2.39pm",
      "content": "First off, I’m so glad you didn’t go with Rotis or Helvetica. And I like this font choice, however it’s a very now style versus a timely style... but if the majority of your product is modern, I don’t think that’ll be much of an issue.\n\nHow does the logo look in simple 2D black and white, with out all the gradients. This should be the first step, making sure the silhouette and shapes are appealing before adding “style-effects”. You’ll get a lot of grief from the designers on this site for having gradients in your logo, so expect that. Also it’ll be easier to critic as far as letter spacing and kerning are concerned.\n\nAll in all, it’s nice and simple.\n\n"
    },
    {
      "time": " 18.Jun.2008 8.53pm",
      "content": "Definitely no Rotis, Trajan, or thin Helvetica for this project :) Although, I was quite tempted by some of the Egyptian serifs.\n\nI’m currently working on the Adelto branding project, and appreciate all of your comments/criticisms. I ended up deciding on FF Cocon for the type. I think it has great potential and is not used as often.\n\nThe colour scheme is indeed a work in progress. My first idea was the following:\n\n- Vivid aqua blues, samples taken from ocean shots\n- Aluminium metallic shades\n- Woody browns, more finished and polished\n- Charcoal greys and dark greys\n\nI’m now leaning more towards brighter reds as the highlight colour, but will need to do more basic mock-ups before finalising.\n\nThe range of products and services on offer is quite diverse, so I’d like to keep the palette fairly natural, with one main highlight colour.\n\nI’ll look forward to hearing more input from you guys as this progresses.\n\nCheers\n\nTrev\n\n"
    },
    {
      "time": " 18.Jun.2008 9.27pm",
      "content": "Here’s the same type without any gradients/shading applied:\n\n ![](http://web.archive.org/web/20080624181305im_/http:/typophile.com/files/adelto-03_3435.jpg)\n\n"
    },
    {
      "time": " 19.Jun.2008 1.26am",
      "content": "Appealing!  \nI suggest curving the t-horizontal short line upwards by bringing its left end downwards..  \nAnd better if the arch is replaced with a smart clockwise arrow.  \nGood Luck with Flowers!\n\n"
    }
  ]
}
