{
  "id": "46577",
  "title": "Unleashed - Please help me...",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m not a designer, as you’ll see. I’m opening a pet grooming salon and spa. (my second - sold my other one and moved.) It is called Unleashed Pet Salon. I designed the attached logo but now I don’t like it. It’s simply too busy, doesn’t work well small... I don’t know. I would really appreciate any help, suggestions, modifications, etc.\n\nI want the ’feel’ to be modern, upscale but still pet friendly. Not cutesy stuff. Simple. I really need some help here. I just can’t get it. I feel like I need to redo the entire thing. What really made me start looking at it again was getting ready to order window decals...they’re white and it just doesn’t seem to work.\n\nThoughts? Please! Thank you in advance!!\n\nErika\n\n ![](http://web.archive.org/web/20081024203602im_/http:/typophile.com/files/unleashed%20logo_3759.gif)\n\n [‹ MW Photography Logo](http://web.archive.org/web/20081024203602/http:/typophile.com/node/46487 \"Go to previous forum topic\") [Logo critique needed ASAP ›](http://web.archive.org/web/20081024203602/http:/typophile.com/node/47130 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081024203602/http://typophile.com/user/32637\" title=\"View user profile.\">ebreiner</a>",
  "time": "<br>",
  "uid": "32637",
  "comments": [
    {
      "time": " 18.Jun.2008 5.19pm",
      "content": "Oh - also, we sell high end pet foods and retail. We’re located in a very nice, new, modern building with high ceilings and bright colors - orange, green, yellow (which makes me now not like the red).\n\n"
    },
    {
      "time": " 18.Jun.2008 8.21pm",
      "content": "I’m truly not saying this to be bitchy, but it needs to be said: hire a professional. There’s just too much wrong here to even begin breaking it down.\n\nIf your target market is affluent clientèle, having a professional logo is crucial to your success. The affluent are impressed by elegance and class and distrustful of anything less.\n\nYou want your brand to be something they brag about to their friends, right? You want your cards to be on refrigerators, right? Then, it’s all about appearances. Your logo has to get their attention and fit into their world. What you have (so far) says appearances don’t matter. You NEED them to trust your aesthetic to even try you out - so your logo needs to be as gorgeous as (insert a fabulous dog here).\n\nYou wouldn’t do your own plastic surgery, right? You’d hire a pro, because it’s your appearance - your very identity, and you have to live with it forever. Your logo is the exact same thing.\n\nSorry if this sounds harsh, it’s just meant to be honest.\n\nEileen\n\n"
    },
    {
      "time": " 18.Jun.2008 11.43pm",
      "content": "Amen, sister.\n\nAlso... I’m available. Shoot me an e-mail at [robpmck@gmail.com](mailto:robpmck@gmail.com).\n\n"
    },
    {
      "time": " 19.Jun.2008 4.30am",
      "content": "Phew. No, I know that’s all true. Thanks though for not being mean about it. I needed the little kick! I do appreciate it. I’d all ready learned from viewing this site that there is a LOT more that goes into a logo than I had any idea. As an “outsider” I would strongly suggest to any logo designer they create something (website, brochure, etc) that shows the entire process of designing a logo. I saw it somewhere on this site. Maybe that’s something that’s all ready a norm... It’s like me and grooming dogs - people think it is easy and should only take an hour to bathe and groom their dogs...little do they know the process. Until I show it too them. And, I should have taken the same advice I give dog people - there are professionals that do this for a REASON!!!\n\nThanks again.\n\nI will look for a professional. Anyone else interested in working on this??\n\n"
    },
    {
      "time": " 19.Jun.2008 8.16am",
      "content": "Interested. Email me at [mauro@holadesignstudio.com](mailto:mauro@holadesignstudio.com).\n\n"
    },
    {
      "time": " 19.Jun.2008 10.30am",
      "content": "ebreiner,\n\nI understand what you are trying to say with the comment “create something (website, brochure, etc) that shows the entire process of designing a logo.”\n\nThe thing is, that “something” includes all the knowledge earned in a bachelors degree or the equivalent in self-study and apprenticeships, a ton of obsessive thinking on symbolism, focus groups and/or random opinions of strangers AND trained eyes, a couple grand worth of software and the years it takes to earn the skills to use it all properly, and a commitment to learn the details of each new business and THEN the ability to boil a whole company down into something about an eight of the size of a business card.\n\nIt’s so hard to explain to people that logo design is infinitely more complex than the final result, and that’s rather the point. Again, it’s like plastic surgery. The world sees the beautiful face, but only the surgeon truly knows the science that makes it beautiful.\n\nEileen\n\n"
    },
    {
      "time": " 8.Jul.2008 12.05am",
      "content": "You started the whole thing with the wrong sentence: I’m not a designer. Replies reflect that. Even though I think we may come to some sort of a logo for you. First of all you should post smaller images.\n\nFirst of all I would make a nice dog stylisation and not just a side outline. A semi front stylisation would probably work much better.\n\nBut before that you should think what’s more valuable to you: your time spent on this logo (based on your lack of knowledge it would be at least a month of full days of work) or a designer that will produce a nice contemporary logo for you. Maybe in the same time but may still be much cheaper. In the end you’ll also need collateral stuff that a designer will be able to produce much faster and better aligned with your logo than you. I guess.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
