{
  "id": "46593",
  "title": "Lost Fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Some time ago, I designed a letterhead for a local organization using CorelDRAW 11. The result has been used since as a .pdf file. Now I need to edit the letterhead and have discovered that I no longer have Kabel Bk BT and Kabel Ult BT on my computer system (Mac). It may be that the fonts resided on an earlier computer which crashed. The fonts may have originated from a set of disks that I loaned to a colleague (who claims he returned them), but I can no longer find them.\n\nNeedless to say, I assume I need to reinstate the fonts in order to edit the file (I don’t suppose I can edit the .pdf file). Could someone please advise me as to the simplest and cheapest method of achieving this?\n\nCheers,\n\nAnthony (Ottawa)\n\n [‹ The Typographer's Library](http://web.archive.org/web/20080623194154/http:/typophile.com/node/46598 \"Go to previous forum topic\") [Friendly Typeface Recommendations ›](http://web.archive.org/web/20080623194154/http:/typophile.com/node/46599 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080623194154/http://typophile.com/user/32659\" title=\"View user profile.\">Anthony Pearson</a>",
  "time": "<br>",
  "uid": "32659",
  "comments": [
    {
      "time": " 19.Jun.2008 8.19am",
      "content": "[http://www.myfonts.com/fonts/adobe/kabel/](http://web.archive.org/web/20080623194154/http:/www.myfonts.com/fonts/adobe/kabel/ \"http://www.myfonts.com/fonts/adobe/kabel/\")\n\n"
    },
    {
      "time": " 19.Jun.2008 8.21am",
      "content": "Thanks James but there are only four Kabel fonts listed and none are the specific two I need.\n\n"
    },
    {
      "time": " 19.Jun.2008 8.22am",
      "content": "Hi Anthony,\n\nhere are two links where you can purchase the fonts:  \n [Kabel Bk BT](http://web.archive.org/web/20080623194154/http:/www.myfonts.com/fonts/bitstream/itc-kabel/book/), [Kabel Ult BT](http://web.archive.org/web/20080623194154/http:/www.myfonts.com/fonts/bitstream/itc-kabel/ultra/). They both came with your Corel DRAW 11.  \nF\n\n"
    },
    {
      "time": " 19.Jun.2008 8.22am",
      "content": "You can edit the PDF file in Illustrator or similar programs assuming it’s not locked - or if it is, you have the password - but first off you’d will definitely need the fonts in question - and that’s assuming the text wasn’t converted to outlines at some point before making the PDF. So, the obvious thing you’re going to have to do s purchase those fonts again.\n\nI’ve looked on Linotype and if you just need the two weights, it’s not that expensive at all. The only other option if you don’t want to buy the fonts is to try and find a free similar looking font, but off hand I can’t suggest an alternative, sorry.\n\nJH\n\n"
    },
    {
      "time": " 19.Jun.2008 8.41am",
      "content": "Which, you should add, is _not_ the Bitstream (BT) version, which doesn’t seem to be available anymore.\n\nEdit: was a reply to James’ post.\n\n"
    },
    {
      "time": " 19.Jun.2008 1.09pm",
      "content": "Thanks everyone and particularly Florian. I purchased the fonts and they worked pretty well although I had to adjust the alignment. As Jens indicated, they weren’t named exactly the same as the originals (ITCKabelStd-Book versus Kabel Bk BT etc.). I’ll try to attach the image I was working with (the resolution isn’t quite right but you get the idea).\n\n ![](http://web.archive.org/web/20080623194154im_/http:/typophile.com/files/title_4960.jpg)\n\n"
    }
  ]
}
