{
  "id": "4661",
  "title": "Arabic Fonts -- How To Make Them Work in Adobe Illustrator & Photo-Editing Progs?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have Windows XP Home with Arabic Languge turned on, and thus can copy/paste Arabic words from an online English \\> Arabic word translation sites and see Arabic on websites via IE 6 browser, HTML files, and even Outlook Express.   \n  \nFor example, copy/pasted into Outlook Express, Arabic words show as being \"Arial\" font.   \n  \nBut if I change font, it all turns to \"?????? , ????????\".   \n  \nThe same thing happens when I copy words from where I can see the Arabic (such as \"Arial\" within Outlook Express), then paste them into Adobe Illustrator (8.x) or Corel PhotoPaint (7.x).   \n   \n[I know, I know... old versions of programs, but I live on a tight disability income and cannot afford to upgrade.]   \n  \nI DO have WP Arabic and one or more True Type Arabic fonts, but I still get the \"?????....\" etc.   \n  \nI only need to include a handful of Arabic words for a logo, not create documents or webpages in Arabic. I need to do this in Illustrator for I they have sit/be on the outline or spine of an invisible circle created with Bezier.   \n   \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_   \n  \n\\>\\>\\> Q: Is there any way to work around this obvious code problem, font language, or whatever without having to resort to buying software, expensive fonts, and so on? And which type of font types WOULD work in Illustrator (TT, PS, Open, or...?).   \n   \nI'd like to be able to also do such in PhotoPaint, but at worst, I can always rasterize the .bmp logo + type in Illustrator.   \n   \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_   \n  \nAny advice, suggestions, rand/or eferrals at earliest onvenience very much appreciated.\n\n",
  "author": "soniclight",
  "time": "7 May 2004 — 2:37pm",
  "uid": "3711",
  "comments": [
    {
      "time": "7 May 2004 — 5:43pm",
      "content": "Windows XP is handling Arabic as Unicode text, but it is possible that some of your applications are not. Question marks generally indicate that an application is unable to recognise the pasted character code.   \n   \nYou may also have another problem in that some of your Arabic fonts may not themselves use Unicode encoding. This would explain why changing fonts from Arial, which is a Unicode font, to another font might not work.   \n   \nIn order to handle Arabic in Illustrator, you would need the Middle East version of that application. The regular version does not support right-to-left text or Arabic script shaping.   \n   \nSince you don't need to handle text per se, one easy option might be to make a custom font using a hacked 8-bit encoding, e.g. putting Arabic glyphs in ANSI Latin decimal positions, and then enter the characters manually in Illustrator. You could do this with the relatively cheap TypeTool.\n\n"
    },
    {
      "time": "8 May 2004 — 5:51am",
      "content": "Thanks, John. A tad over my head ragarding ANSI and decimal points, etc. but perhaps I'll figure it out. In the mean time I'll try to find sme cheap font tool.   \n   \nAny suggestions? Freeware would be nice ![:-)](http://web.archive.org/web/20120415130533im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nAnd/or perhaps I'll go and Google around for some Unicode Arabic fonts.\n\n"
    },
    {
      "time": "8 May 2004 — 9:22am",
      "content": "Here are two freeware font tools:   \n   \n [http://fontforge.sourceforge.net/](http://web.archive.org/web/20120415130533/http:/fontforge.sourceforge.net/)   \n [http://www.high-logic.com/](http://web.archive.org/web/20120415130533/http:/www.high-logic.com/)   \n   \nI used the latter, Font Creator, for TT table editing before everything I needed was added to FontLab. I have not tried FontForge.\n\n"
    },
    {
      "time": "8 May 2004 — 10:48pm",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>Thanks. I checked out the developer's page for the app you use, and frankly, all of this is getting way to complex for me. Having to learn a whole new technology. Kind of like a total newbie starting to learn PhotoShop - LOL. I may have to change my strategy here and find some other solutiuon. But thanks to all for help. Ciao.\\</font\\>\n\n"
    },
    {
      "time": "9 May 2004 — 3:11am",
      "content": "Maybe you could just copy paste the outlines from the glyph windows into illustrator, and then just assemble the words there. You could typeset the text in Word just to see what it looks like (that is if you're not familiar with the language). You'll also need to watch out for the alignments of certain characters since some of them don't sit on the baseline.   \n   \nI think this would be simpler than building a new font but I wouldn't know if you would be violating any copyright laws with this or not. You will probably need to make certain adjustments to the outlines (especially the baseline strip) if you want the text to sit on a circle.\n\n"
    },
    {
      "time": "10 May 2004 — 10:47am",
      "content": "Philip, maybe you should subcontract?   \nBut if you're wary of spending $100 on TypeTool :-) you might have to resort to bartering.   \n   \nNadine, what you propose sounds totally legal - and ethical.   \n(BTW, please say hi to Beirut for me. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "11 May 2004 — 2:25am",
      "content": "Sure :-)   \nI'm spending 3 weeks there next month...\n\n"
    },
    {
      "time": "11 May 2004 — 10:27am",
      "content": "Then you'll be in the neighborhood of Thessaloniki?   \n [http://www.uom.gr/uompress/2nd\\_int\\_conference/](http://web.archive.org/web/20120415130533/http:/www.uom.gr/uompress/2nd_int_conference/)   \n   \nhhp\n\n"
    },
    {
      "time": "12 May 2004 — 4:41am",
      "content": "Yes definitely. I went to the first one and I'll attend this one as well. I'm looking forward to it. The program is very interesting and there's so many people from Reading. It brings back good memories :-)\n\n"
    }
  ]
}
