{
  "id": "46622",
  "title": "Designing cyrillic characters",
  "forum": "Design",
  "tags": [

  ],
  "content": "I don’t consider myself a typographer, but I’ve designed a few simple typefaces, and I do love to read and study everything type related.\n\nI am now in a bit of a dilemma:  \nA company has contacted me, because they want to use one of my handwritten fonts for their marketing materials. For this, they need support for hungarian, czech, and polish characters, which should not be too hard a problem to add to my font.  \nHowever, they also want support for cyrillic characters.\n\nI’m afraid of getting in over my head trying to accomodate this last request, as I really know nothing about Cyrillic.\n\nDo you think this is doable for a novice typographer? I’m willing to put in study and effort, but can I get good results with reasonable effort? Or is it better to refer them to someone who can do a more professional job of it?\n\n [‹ Word breaks, font suggestions...](http://web.archive.org/web/20080821164326/http:/www.typophile.com/node/46703 \"Go to previous forum topic\") [Appropriate dash for a quote? ›](http://web.archive.org/web/20080821164326/http:/www.typophile.com/node/46490 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821164326/http://www.typophile.com/user/951\" title=\"View user profile.\">spiral</a>",
  "time": "<br>",
  "uid": "951",
  "comments": [
    {
      "time": " 20.Jun.2008 6.22am",
      "content": "It’s doable but hard - for a contextual handwriting font we had made a few years ago, we had the type designer who’s handwriting formed the basis of the Latin study many Cyrillic and Greek handwriting samples, and basically learnt to write cursive Cyrillic - we had experts review the output and several rounds of refinements were needed.\n\nIncidentally for the Greek it was a bit easier as cursive Greek doesn’t tend to have a lot of joining characters. As I recall the initial feedback was that it looked like “Schoolboy Greek”, so that too required a few more rounds of refinement.\n\nWe did a TypeCon workshop on this - contact me off-list and I’ll see if I caa dig up the PDF.\n\nAs an alternative you could look at existing Cyrillic handwriting fonts (Paratype has a few) and recommend one that works well with your Latins.\n\n"
    },
    {
      "time": " 20.Jun.2008 10.00am",
      "content": "Can you post an example of what the Latin characters look like?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20080821164326/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 20.Jun.2008 10.44pm",
      "content": "If your handwriting font isn’t of the cursive, joined variety, that should make the job much simpler since you don’t have to worry too much about contextual alternates.\n\nYou can either study a lot of Cyrillic handwriting samples and teach yourself to write Cyrillic, as Sii mentioned, or work with a collaborator who knows Cyrillic design. People often hire consultants or additional designers for extension of existing fonts into Cyrillic or Greek, so there are a number of experts around who can help. You can also use the critique forum here.\n\nPersonally, I would recommend at least studying how to write Cyrillic first even if you end up using professional help later. You’ll find it really helpful and hopefully enjoyable.\n\n"
    },
    {
      "time": " 21.Jun.2008 8.18am",
      "content": "It’s not a joined script. This is a sample of the font:  \n [http://www.pixilate.com/\\_img/thumb\\_f\\_soli\\_char.gif](http://web.archive.org/web/20080821164326/http:/www.pixilate.com/_img/thumb_f_soli_char.gif \"http://www.pixilate.com/\\_img/thumb\\_f\\_soli\\_char.gif\")\n\nI’m leaning towards not taking this, at least not on my own. I think there’s a big risk that the result will be less than acceptable.\n\nCan anyone recommend someone who might be able to take on a project such as this?\n\n"
    },
    {
      "time": " 21.Jun.2008 9.30am",
      "content": "You may take look on Epsilon from ParaType [http://fonts.ru/pstore/sample.asp?scode=PT\\_EPS](http://web.archive.org/web/20080821164326/http:/fonts.ru/pstore/sample.asp?scode=PT_EPS \"http://fonts.ru/pstore/sample.asp?scode=PT\\_EPS\") — I think it’s similar ;)\n\n"
    },
    {
      "time": " 23.Jun.2008 9.23am",
      "content": "thanks for the suggestion! I’ll pass it along\n\n"
    }
  ]
}
