{
  "id": "46629",
  "title": "Featured Face",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is it just me, or does the current featured face ’Doublewide’ stink?\n\n",
  "author": "<a href=\"/web/20100103153736/http://typophile.com/user/28197\" title=\"View user profile.\">David</a>",
  "time": "<br>",
  "uid": "28197",
  "comments": [
    {
      "time": " 20.Jun.2008 8.56am",
      "content": "From the Veer site...\n\n_About this typeface:_\n\nDoublewide is an informal sans serif with lots of character, designed to withstand several percentage points of stretching either wider or narrower. Though it was designed as a display face, it can be useful for callouts and subheads as well. Doublewide is available in four weights: Bold, Medium, Regular, and Light with corresponding obliques.\n\nAbout the designer:\n\nChristian Robertson designed his first digital font in 1986 when he was in the fifth grade. It was aptly titled ‘Christian’. Since that first encounter with ResEdit, he has spent thousands of hours in the blue glow of the monitor tweaking type. When he’s not drawing type, Christian works designing/programming interfaces as a Senior Media Designer at **Punchcut** in San Francisco. Christian also operates Betatype, an independent, one-man type foundry. Betatype offers custom type design services as well as commercial fonts.\n\nThis package contains:\n\nDoublewide Light, Light Italic, Regular, Italic, Medium, Medium Italic, Bold, Bold Italic\n\nCopyright © Christian Robertson / Betatype\n\nNot suggesting your typophile account may start to get glitchy - but, you never know.\n\n"
    },
    {
      "time": " 20.Jun.2008 8.57am",
      "content": "well until you provide constructive criticism, its only a matter of opinion.  \ni must say i’m not a big fan of it either, but thats because I generally dislike wide type.  \nhowever I can see some potential uses for it.\n\n"
    },
    {
      "time": " 20.Jun.2008 9.21am",
      "content": "I don’t think it stinks at all! If I could buy one weight, I would already have bought the light one. I love the K and the M.\n\n ![](http://web.archive.org/web/20100103153736im_/http:/typophile.com/files/doublewide_5052.jpg)\n\nSharon\n\n"
    },
    {
      "time": " 20.Jun.2008 9.28am",
      "content": "Ah yes, the Light is good, elegant and balanced. Perhaps it’s just that in the heavier weights it looks, and I’m using a technical term here, squooshed. Purely subjective, I know.\n\n"
    },
    {
      "time": " 20.Jun.2008 11.22am",
      "content": "I don’t think it stinks either! In fact, I think it smells very good. :^/ If we’re using smell as an analogy.\n\nIt could be that we’ve not been seeing extra wide type used (1) very often lately and (2) as the header font here on Typophile. I think you need to head over to Veer and test somethings out and look at it from a different perspective before you make such a quick (and unwarranted) statement.\n\n"
    },
    {
      "time": " 20.Jun.2008 11.28am",
      "content": "Maybe someone should start a thread on why the Brits on typophile are so incredibly rude ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": " 20.Jun.2008 11.43am",
      "content": "My theory - not qualifying for Euro 2008.\n\n"
    },
    {
      "time": " 20.Jun.2008 11.55am",
      "content": "I didn’t mean to say “rude”.\n\nI completely understand having a knee-jerk reaction to something and judging it on my first view. But I’ve tried to learn from that and resist the urge to post (or say anything) until I’ve really thought about it.\n\nPerhaps for some Doublewide isn’t optimum as a header font, but then it might be really great used in an identity or something. No?\n\n"
    },
    {
      "time": " 20.Jun.2008 12.11pm",
      "content": "If I was specing a font for this site, I wouldn’t chose an extra wide! (Or, for that matter, a condensed, such as last week’s Featured Face.) Neither has a comfortable amount of characters, for the size and measure mandated.\n\nBut for advertising a font, such a mismatch may actually serve to focus more attention on the typeface, and get it noticed and remembered.\n\n"
    },
    {
      "time": " 20.Jun.2008 3.01pm",
      "content": "\\>I didn’t mean to say “rude”.\n\nUnderstood, and David’s comment wasn’t that out of order. But in general I feel the British on Typophile are rather badly behaved.\n\n"
    },
    {
      "time": " 20.Jun.2008 5.51pm",
      "content": "“The English love an insult. It’s their only test of a man’s sincerity.”\n\n—Benjamin Franklin.\n\nThat’s a quote from the recent “John Adams” HBO biography film. I assume it’s authentic, because I recognize a lot of the other dialogue as quotes from Franklin.\n\nAs a five year student of English manners, when I was there in London at the LSE, I can attest that this love of insult has survived the intervening 200 years. English manners are at once more civil and more rude than American manners. —Or is it civil and rude in different ways?\n\nEnglishmen—and I am writing of men here—as a rule wouldn’t dream of asking you a possibly embarrassing personal question, or even volunteering personal information. But many will take pleasure in insulting your politics, religion, abilities, nation or ethnic group at the earliest opportunity. And they expect it back. It was once called good natured “raillery”. I admit I still don’t quite get it.\n\nYou don’t play the game, Si, which makes me suspect that you are a Scotsman :)\n\n"
    },
    {
      "time": " 21.Jun.2008 8.43am",
      "content": "Could be? I do like the sound of the pipes, and people have claimed that I do exhibit a Scotch influence.\n\n"
    },
    {
      "time": " 21.Jun.2008 10.16am",
      "content": "“exhibit a Scotch influence”\n\nSi, perhaps that is then “under the influence of scotch” in your case? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 21.Jun.2008 10.24am",
      "content": "Everyone has a right to an opinion of a typeface and are entitled to dislike it as well as like it. I think the difference here is that David just said he thought it stunk without really explaining his reasoning. I think it was more his choice of words than opinion that can give a rude flavor even if that wasn’t intended.\n\nI don’t think the Brits have any more tendency to rudeness than any other nation. Perhaps it is the Simon Cowl influence where criticism is quick and sharp that colors the whole nation a bit nasty. It seems an unfair generalization though.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Jun.2008 11.11am",
      "content": "Chris, it is not that one is more rude than the other, but that the English and Americans are rude in different ways.\n\nNational characteristics are very tricky to talk about, because very many—perhaps even most—people in a country don’t fit the stereotypes. But it is equally true that these characteristics are very real and striking to anyone who spends time in another country.\n\nIn the case of Simon Cowl, vicious criticism is not at all unusual for those in the record business. The English flavor is that he finds his own viciousness highly amusing, and expects you to, because he views it as part of the ’raillery’ game. You may agree or not about his being witty, but that is the twist.\n\nI don’t approve of any variety of rudeness, but I confess that I can it amusing when I dislike the victim of the attack. I’m way less amused when I am the target :)\n\n"
    },
    {
      "time": " 22.Jun.2008 4.00am",
      "content": "Screw you Sii!\n\nYou can ram it!\n\nheh heh\n\nI think being out of the Euro’s has made them much more enjoyable to watch. We’ve got all the heartache out of the way already - and you gotta love Hollands choice of number for their kit.\n\n"
    },
    {
      "time": " 22.Jun.2008 10.29am",
      "content": "Interesting stuff. We’ve gone from discussing the design of type to racial stereotype in about two moves! And I’m the rude one?\n\nSii, you’re right of course. Doublewide Bold is from Veer, what was I thinking, it must be great. The last thing we need on a discussion forum is opinions. May I take this opportunity to apologise on behalf of all the ’British on Typophile’ for behaving badly. Everything is nice. Even Eras.\n\nNick, you hit the nail on the head. I was commenting on the current face not working particularly well in this context.  \nChrisL, you are correct sir.\n\n"
    },
    {
      "time": " 22.Jun.2008 11.46am",
      "content": "\\>racial stereotype\n\nThe English are not a race, but a culture. I don’t think it is rude to discuss the mores of different cultures. Anthropologists and sociologists do it as a legitimate subject of inquiry. It’s not “politically correct” to say that cultures have different strengths and weaknesses, but I think it is true, and we can learn temper our own various varieties of craziness by such comparison.\n\n"
    },
    {
      "time": " 22.Jun.2008 1.44pm",
      "content": "So, is there such a thing as a bold, wide font that doesn’t look squooshed?\n\n"
    },
    {
      "time": " 22.Jun.2008 2.16pm",
      "content": "\\>And I’m the rude one?\n\nWell, until I give up my passport and pledge allegiance to president Obama the 1st (and/or his robot overlords), I’m still a loyal expatriate, British subject of HRH Queen Elizabeth 2nd.\n\nSo I’d apply the rude comment equally to myself. However, as noted I changed my mind. We are badly behaved, not necessarily rude.\n\n"
    },
    {
      "time": " 23.Jun.2008 7.04am",
      "content": "I’m going to go out on a limb here and defend David the poster. What is the point of having and changing a featured face if not to get some feedback and opinion about it? Frankly, it’s the folks who got so excited about the opportunity to politely and righteously tell David to keep his subjective opinions to himself that...ah, nevermind. What the rule here? Don’t offer an opinion that might hurt someone’s feelings? Sorry, but that kind of dialogue makes me sick.\n\nMaybe every weight of Doublewide isn’t ugly, but the extra bold most definitely looks “squooshed,” or, more technically, ridiculously extended, and that’s the featured typeface. According to Veer’s marketing: “lots of character.” What a stupid way to talk about type. Someone define “character” for me and tell me what gives one typeface more character than another. Are they talking about character like a John Candy character, as in big, fat, and silly?” If that’s the case, then yes, this typeface has lots of character. But there are so many different kinds of character.\n\nI’ll also concur with Nick regarding the use of condensed or extended type in the featured spot here on Typophile. It doesn’t make good sense to me.\n\n"
    },
    {
      "time": " 23.Jun.2008 8.08am",
      "content": "I thought the point of the featured typefaces was to show that they exist. Nothing more.\n\nNo need for feedback.\n\nEveryone’s entitled to their opinion blah blah blah of course.\n\nI like food.\n\nTottenham Hotspur stinks.\n\nWhat worthy opinions those are, and completely justified I feel!\n\n"
    },
    {
      "time": " 23.Jun.2008 8.31am",
      "content": "<cite>No need for feedback.</cite>\n\nI would think it as open to discussion as, say, the design of this very website, the latest soccer results, and birthday greetings. You are not _required_ to comment on each and every featured font, but if one has strong feelings (pro or contra), why not share?\n\nAlso:\n\n“A free society is one where it’s safe to be unpopular.” — Adlai Stevenson\n\nso you’re entitled to an opinion such as “Helvetica **stinks** ”. (For now, at least.)\n\n"
    },
    {
      "time": " 23.Jun.2008 8.50am",
      "content": "Awwww I wasn’t saying don’t have an opinion and don’t voice it.\n\nIt was suggested that the point of the ’featured faces’ is to have feedback and I don’t think that’s the case. Typophile has text in the background showing the most recent post. It used to be just one typeface (I can’t remember exactly what it was) but due to requests from us peoples who frequent this lovely site they’ve changed it every so often.  \nThat’s all.\n\nPeople will of course talk about the type of choice, but to simply say it ’stinks’ is a bit lame seeing as this is a community interested in the in’s and out’s of typographic design.\n\nSo instead of being a thread about why doublewide stinks (if it does) its mostly been about how people are rude and how we should like have an opinion maaan and voice it.\n\nSo;  \nI think its a bit wide for me. Too thick in the verticals and thin in the horizontals so it looks a bit stretched like.\n\nI’d like to see a ornament font featured ;)\n\n"
    },
    {
      "time": " 23.Jun.2008 10.02am",
      "content": "<cite>Si, perhaps that is then “under the influence of scotch” in your case? :-)</cite>\n\nLOL!\n\nHéctor\n\n"
    },
    {
      "time": " 23.Jun.2008 11.23am",
      "content": "A case of scotch! Love it!\n\nTypeCon is going to be fun this year. ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": " 23.Jun.2008 12.47pm",
      "content": "When we chose to use Doublewide as the Featured Face (BTW Christian was not involved in the decision, we did it behind his back), we considered using a less obtrusive, more compressed style (existing only in-house I believe) but quickly realized the heavier wider wide would wreak havoc on the community and cause panic in the forums. From my point of view, this is always entertaining :) I especially love how sometimes the thread titles go outside of the bounding box :P\n\n"
    },
    {
      "time": " 23.Jun.2008 12.53pm",
      "content": "<cite>I’ll also concur with Nick regarding the use of condensed or extended type in the featured spot here on Typophile. It doesn’t make good sense to me.</cite>\n\nSometimes we do this intentionally. Of course, we think about the context and the quality of the design, whether or not it would make sense to use it on Typophile. However, it is also a unique opportunity to be playful and expressive through a variety of styles.\n\nPlus it causes controversy amongst the community and makes for interesting discussions :)\n\n<cite>It was suggested that the point of the ’featured faces’ is to have feedback and I don’t think that’s the case.</cite>\n\nNot necessarily. The intent is to show off type. Particularly, the designs of this community, the work that so many of you put blood, sweat and tears into. The fact that the Typophile community is seeing them, criticizing them, using them even, is a huge benefit for everyone. We encourage this kind of discussion, after all that is why Typophile exists. Ultimately, these designs will undergo the critical eyes of all Typophiles, something I’d be nervous about :)\n\n"
    },
    {
      "time": " 23.Jun.2008 1.01pm",
      "content": "There’s no such thing as bad publicity.\n\n"
    },
    {
      "time": " 23.Jun.2008 1.05pm",
      "content": "This thread is great! There is no question that Doublewide is a little obnoxious. When I first looked at using Doublewide on Typophile I concluded that it was, in fact too wide. When the gang put it up last week we laughed that only a couple words fit on each line. I’m mostly happy that the font evoked a response (good or bad). That’s way better than no response at all :)\n\nThanks for the input, David, and don’t worry about your Typophile account as Sii suggested. We love people with strong opinions (there are a few around here).\n\n"
    },
    {
      "time": " 23.Jun.2008 2.52pm",
      "content": "Thanks Koppa, thanks Christian, and thanks to everyone for all the lively feedback and discussion.  \nIsn’t it great that we all have such passionate feelings about this stuff.\n\nOh, and I’d just like to clear up one thing: I was just kidding about Eras.\n\n"
    },
    {
      "time": " 24.Jun.2008 8.30am",
      "content": "Interesting thread! Is the switch to Underground a sop to us Brits? :-D  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 24.Jun.2008 9.05am",
      "content": "Typophile really has gone down the tube! ;-)\n\n"
    },
    {
      "time": " 24.Jun.2008 1.07pm",
      "content": "Si can really keep a train of thought :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Jun.2008 6.56pm",
      "content": "If we are going to have a national rude-off then I think Nantucket in the summer is a sure winner. (There is a book called The Nation of Nantucket.) An unattractive air of entitlement comes over on the boat that stinks up the place pretty good. Yes, I used the stink word.\n\n"
    },
    {
      "time": " 24.Jun.2008 7.17pm",
      "content": "There once was a stink from Nantucket... :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Jun.2008 7.27pm",
      "content": "I resemble that remark...\n\n"
    }
  ]
}
