{
  "id": "46644",
  "title": "Self Promo Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Logo for self promotion materials. It’s a challenge to design for myself. Critique and suggestions would be very helpful.\n\n ![](http://web.archive.org/web/20080821165343im_/http:/www.typophile.com/files/davidpear_5503.gif)\n\n [‹ Design firm logotype refresh](http://web.archive.org/web/20080821165343/http:/www.typophile.com/node/47455 \"Go to previous forum topic\") [New logo advice and critique ›](http://web.archive.org/web/20080821165343/http:/www.typophile.com/node/47077 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821165343/http://www.typophile.com/user/29946\" title=\"View user profile.\">dwpear</a>",
  "time": "<br>",
  "uid": "29946",
  "comments": [
    {
      "time": " 20.Jun.2008 5.47pm",
      "content": "Initially, I want to recognize something in the pear, but I see a ’c’ and possibly an ’r’. Not knowing if that’s right or if I’m supposed to be seeing those letters, it’s a poor point of focus.\n\nI also think the position title face is unnecessarily busy.\n\nYou have a lot of conflicting parts and it’s making my eye jump all over the place. Remember the KISS system from school: “Keep it simple, students”.\n\n"
    },
    {
      "time": " 20.Jun.2008 10.36pm",
      "content": "I too want to find some sort of hidden shape. Is there one?\n\n"
    },
    {
      "time": " 21.Jun.2008 5.58am",
      "content": "Needs more work - or maybe less work. The pos/neg space is an eye. The other shape obvious. No c or r intended but I see it now. I admit it’s forced and confusing. I’m working with the pear shape and trying to turn it into something. Maybe I’ll stick with the starting point. Nothing conceptual about it, but here’s a simpler version:\n\n ![](http://web.archive.org/web/20080821165343im_/http:/www.typophile.com/files/davidpear2_6281.gif)\n\n"
    },
    {
      "time": " 21.Jun.2008 11.15am",
      "content": "Now it seems you have too many weights happening to my eye. I might try matching the outline of the pear to the weight of “pear,” and maybe outline the leaf to match the weight of “david”.\n\n"
    },
    {
      "time": " 21.Jun.2008 7.34pm",
      "content": "The second version is much better. The shape is compelling. I liked Century Gothic for your name in the first treatment better, however.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 22.Jun.2008 2.23pm",
      "content": "Leaf/stem from the first one, pear shape from the second one, name type from the first one, and I think find something else for “art direction”.\n\n"
    },
    {
      "time": " 23.Jun.2008 3.43pm",
      "content": "Nice shape, though it’s quite Apple-y.\n\n"
    },
    {
      "time": " 8.Jul.2008 12.09am",
      "content": "That’s why I like the first one better. It’s more distinct. Ok it does need a lot of work though, but it would make a much better logo I think.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 9.Jul.2008 7.39am",
      "content": "I like the leaf/stem from the first one too. I agree with Century Gothic for your name and something different for “art direction”. I’d keep it smaller, simple. I like the upper part of the pear from the first, maybe finish it out.\n\n"
    },
    {
      "time": " 9.Jul.2008 8.05am",
      "content": "Could you create a pear by stacking the d on the p?\n\n ![](http://web.archive.org/web/20080821165343im_/http:/www.typophile.com/files/DP2_6455.gif)\n\n"
    },
    {
      "time": " 16.Jul.2008 11.30am",
      "content": "How about cutting the right half of the pear image off to form a lowercase ’d’ (the left shape of the pear forming a lowercase ’d’) and put the leaf on the ascender of the ’d’...\n\n"
    },
    {
      "time": " 16.Jul.2008 11.38am",
      "content": "Example:\n\n ![](http://web.archive.org/web/20080821165343im_/http:/www.typophile.com/files/davidpear2_6281_3828.gif)\n\n"
    },
    {
      "time": " 16.Jul.2008 2.35pm",
      "content": "David, I like the form you’ve got working there with half the pear but I don’t feel like the type is doing it any favors at this point. I think I’d rather see the type a bit more uniform in weight/style, maybe breaking up the first and last with two different colors?\n\n"
    },
    {
      "time": " 17.Jul.2008 8.06am",
      "content": "Along the lines of Chrisfig thoughts, make the dark green leaf an outline with the weight of the “david” even with the veins of a leaf.\n\n"
    }
  ]
}
