{
  "id": "46643",
  "title": "4/4 Envelope Printing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm working on an envelope design that features the address on the front, and some text on the back flap that closes and seals the envelope. Does anyone know of a (inexpensive) printer that can so such a thing? I've done a lot of searching online, but have only come up with printers who print on the front.\n\nAny ideas are appreciated. Thanks!\n\nRobert\n\n",
  "author": "rdubois",
  "time": "20 Jun 2008 — 1:36pm",
  "uid": "31799",
  "comments": [
    {
      "time": "20 Jun 2008 — 1:58pm",
      "content": "I recall once talking to a printer about this sort of project. They told me they could print on the flap. But, they'd have to open the envelope to print on the flap and the front at the same time. In doing so they'd have to charge me extra for the time it takes to manually babysit the press (as it would probably cause more problems) as well as having to order more envelopes to keep from having too many unders.\n\n"
    },
    {
      "time": "23 Jun 2008 — 6:55pm",
      "content": "i did this also; similar to what miss tiffany described they printed 4/0 with the envelopes completely unfolded, folded after printing.\n\nthere was a slight increase in cost. unfortunately i worked thru a print broker and did not deal directly with the printer, who was far away. (i'm in new york, printer was in florida).\n\ni would not recommend that arrangement as it made on-press proofing impossible and we had to reprint once for color.  \n(i convinced the vendor to absorb the cost but that's another story).\n\nbut it is possible as a 4/0 job.\n\n"
    },
    {
      "time": "24 Jun 2008 — 9:50am",
      "content": "I've also printed on the flaps of envelopes, and as Miss Tiffany says, somebody has to manually open each envelope before it goes through the press. (And then close each flap again for delivery.) It's okay for a small print run. Larger quantities can make people unhappy.\n\nIf it's a very large or very complicated print run, the printer can print on flat stock and have the envelopes die-cut and made after printing.\n\n"
    },
    {
      "time": "24 Jun 2008 — 12:27pm",
      "content": "You're definitely best off printing flat, and having it converted into an envelop. It's more expensive, but the results will most likely look better. I once printed a large field of color on a folded envelope and the varying thickness on the back side (where the various flaps overlap) caused the color to print unevenly -- you could see the the impression of those thicker areas in the color field.\n\n"
    },
    {
      "time": "24 Jun 2008 — 12:27pm",
      "content": "You're definitely best off printing flat, and having it converted into an envelop. It's more expensive, but the results will most likely look better. I once printed a large field of color on a folded envelope and the varying thickness on the back side (where the various flaps overlap) caused the color to print unevenly -- you could see the the impression of those thicker areas in the color field.\n\n"
    },
    {
      "time": "25 Jun 2008 — 2:14pm",
      "content": "There is a safe way. The envelope is printed on flat, then die-cutting and transformation onto a envelope. As for costs I don't know much, just that there are big manufacturers with good prices. I guess you can look for a envelope maker over the internet.\n\n"
    },
    {
      "time": "27 Jun 2008 — 1:45am",
      "content": "Yea, I'd have to say your best bet for that might be an online printer. They tend to do decent jobs and have competitive pricing.\n\nI'd have to agree, if price is not an issue, print flat at a local printer and then have it converted into an envelope. Otherwise do some research and make a lot of phone calls.\n\n"
    },
    {
      "time": "27 Jun 2008 — 3:31am",
      "content": "You can find lots of information about all printing here:  \n [http://www.piworld.com/](http://web.archive.org/web/20131018130537/http:/www.piworld.com/ \"http://www.piworld.com/\")  \nYou can also subscribe to receive the magazine, and it is free.\n\n"
    }
  ]
}
