{
  "id": "46654",
  "title": "Pixel Font Guru Needed",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I need help identifying some fonts on this website:\n\n[Gridplane.com](http://web.archive.org/web/20081013110028/http:/gridplane.com/)\n\nI’m especially interested in finding out what the “WORK” font is at the top, and also the body copy type. The dates along the left that are set in white/light grey all caps seem very close to Arial but are slightly different, better.\n\nAnyway, I really like the look of these and would appreciate any help identifying them. Or even if someone could direct me to some pixel fonts that are different and more attractive than the average Arial, Helvetica, Verdana pixel sans serif fonts seen on the web. What font foundry out there makes beautiful, high-quality pixel fonts that could be incorporated into flash-based websites?\n\nThanks!\n\n [‹ DynameBlackSSK](http://web.archive.org/web/20081013110028/http:/www.typophile.com/node/46669 \"Go to previous forum topic\") [On on Leaf logo ›](http://web.archive.org/web/20081013110028/http:/www.typophile.com/node/46571 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013110028/http://www.typophile.com/user/32729\" title=\"View user profile.\">Alfred Milo</a>",
  "time": "<br>",
  "uid": "32729",
  "comments": [
    {
      "time": " 20.Jun.2008 11.53pm",
      "content": "As ’ [Miniml](http://web.archive.org/web/20081013110028/http:/miniml.com/)’ shows up as a side project of Gridplane, I am preeetty sure these types are either custom made, or available at [Miniml](http://web.archive.org/web/20081013110028/http:/miniml.com/). _(Which would of course be the source for most of the ’seen before’ pixel typefaces. ;)_\n\nDav\n\n"
    },
    {
      "time": " 21.Jun.2008 9.16am",
      "content": "Wow I should have looked at the site a little more closely, I totally missed that on the side projects page. Looks like a lot of well-designed fonts, thanks for pointing that out Dav.\n\n"
    }
  ]
}
