{
  "id": "46650",
  "title": "Is there a contemporary lettering and calligraphy magazine?",
  "forum": "James Puckett's blog",
  "tags": [

  ],
  "content": "Aside from the various society publications, are there any good magazines about lettering and calligraphy?\n\n",
  "author": "<a href=\"/web/20080907010131/http://www.typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 20.Jun.2008 4.25pm",
      "content": "Letter Arts Review, available through\n\n[www.johnnealbooks.com](http://web.archive.org/web/20080907010131/http:/www.johnnealbooks.com/ \"www.johnnealbooks.com\")\n\nI will bring some for the ride up to Buffalo if you want.\n\nMichael\n\n"
    },
    {
      "time": " 20.Jun.2008 7.42pm",
      "content": "Michael,  \nJohn was at the last Type Con that I went to in Boston. It might be worth asking him if he’ll be there. After all, there are 3 calligraphy teachers doing classes ( can’t imagine who the other 2 are?? ). Not like the calligraphy conference, but he carries a lot of type related books and such.  \nStephen\n\n"
    },
    {
      "time": " 20.Jun.2008 8.06pm",
      "content": "Have not talked to John since he ordered some more of my books a couple of weeks ago. That is going to pay for my trip! Tried to call you today, font looks good buddy!\n\nMichael\n\n"
    },
    {
      "time": " 20.Jun.2008 8.54pm",
      "content": "Letter Arts Review is pretty dang cool. You might want to see if any libraries carry it & if you are keen enough go ahead and start taking it.\n\n"
    },
    {
      "time": " 20.Jun.2008 8.59pm",
      "content": "Thanks.  \nAre you talking about Memoir (just recently released)? or did you see the not yet done Montague on this page:  \n [http://www.typophile.com/node/46452](http://web.archive.org/web/20080907010131/http:/www.typophile.com/node/46452 \"http://www.typophile.com/node/46452\")\n\nI named that after the town I lived in in Massachusetts before I started working for that design assembly line in Ohio. Hopefully in the next year I will move back and join the gainfully under-employed.\n\nIt will be fun seeing you at Typecon.  \nStephen\n\n"
    },
    {
      "time": " 21.Jun.2008 3.06pm",
      "content": "Michael, you bring those and I’ll bring my facsimile of the Theatrum Artis Scribendi.\n\n"
    },
    {
      "time": " 5.Jul.2008 11.11pm",
      "content": "[Publications](http://web.archive.org/web/20080907010131/http:/www.typophile.com/wiki/Publications)\n\n"
    }
  ]
}
