{
  "id": "46670",
  "title": "Anyone recognize this marker?",
  "forum": "James Puckett's blog",
  "tags": [

  ],
  "content": "Please ignore the awesomeness of this video and tell me what kind of marker the scribe is using—I’ve never seen one that writes so well!\n\nSorry, here’s the link: [http://youtube.com/watch?v=vw4nUdHYQ4E](http://web.archive.org/web/20080821130508/http:/youtube.com/watch?v=vw4nUdHYQ4E \"http://youtube.com/watch?v=vw4nUdHYQ4E\")\n\n",
  "author": "<a href=\"/web/20080821130508/http://www.typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 21.Jun.2008 2.11pm",
      "content": "Uhm, I’d love to ignore whatever, but I can’t see no video :(\n\n"
    },
    {
      "time": " 21.Jun.2008 9.13pm",
      "content": "Give it up James. You are just enamored of the fact that the artist is writing upside down and backwards! Common practice in my world!!\n\nI do not recognize the pen, send the video to John Neal and he will be able to tell you and probably sell you more than you need. There are a number of fiber pens that are really nice. I use the Speedball Elegant Writer all the time for roughs. I believe it is the toughest “point” going. Therein lies the rub. Most of the pens give up the ghost after a half an hour. They go mushy. Haven’t come up with Viagra for the bad ones.\n\nHey, I will be out of town for a while and won’t be able to access Typophile. I think I may be able to get e-mail in case you need to set up travel for TypeCon.\n\nSee ya soon. All the best.\n\nMichael\n\n"
    },
    {
      "time": " 21.Jun.2008 9.32pm",
      "content": "I just remembered... I designed P22 Sting with the Speedball Elegant Writer. Did the letters on tracing paper.\n\nMichael\n\n"
    },
    {
      "time": " 22.Jun.2008 12.50am",
      "content": "It’s an Artline Ergoline Calligraphy pen.\n\n"
    },
    {
      "time": " 22.Jun.2008 8.42am",
      "content": "Thanks guys! Looks like I’ll have to order them from Europe—no wonder I’ve never seen them here.\n\n"
    }
  ]
}
