{
  "id": "46672",
  "title": "Art Exhibits during Typecon",
  "forum": "SoTA & TypeCon",
  "tags": [
    "SoTA & TypeCon"
  ],
  "content": "Additional Exhibits in Buffalo during TypeCon at partner event sites\n\n**Hallwalls** (site of Tuesday’s Pecha Kucha Event)  \nJune 7 - July 18, 2008  \n**Critical Art Ensemble / Institute for Applied Autonomy: SEIZED**  \nFollowing the four year long ordeal of CAE founding member and University at Buffalo Art Professor Steve Kurtz—accused by the Justice Department of \"bio-terrorism\" and later indicted on charges of mail fraud for procuring harmless bacterial cultures for use in an educational art project—SEIZED presents the artworks behind this case which has attracted worldwide attention and propelled an international arts community to rally to Kurtz's support and on behalf of freedom of expression.  \n [http://www.hallwalls.org/visual\\_shows/2008/show\\_seized.html](http://web.archive.org/web/20150317153242/http:/www.hallwalls.org/visual_shows/2008/show_seized.html \"http://www.hallwalls.org/visual\\_shows/2008/show\\_seized.html\")\n\n**Karpeles Manuscript Musuem** (site of Wednesday’s Sefan Sagmeister talk)  \nMay 1, 2008 – September 1, 2008  \n**Star Trek Drawings**  \nStar Trek is one of the most successful TV series of all time. The production of the TV program requires the efforts of artists to model every aspect of the story and all the devises used. It is these artists sketches and drawings that we present in our exhibit \"Star Trek\". Drawings include designs for \"The Bridge\", \"The Engines\", \"Deck Plans\", \"Corridors\", \"Medical Instruments\". \"Phaser Guns\", \"Holodecks\", \"Alien Ships\" , and much more.\n\n**UB Art Gallery at the Center for the Arts** (site of Thursday’s NLXL event)  \nJuly 1 through July 25, 2008  \n**NLXL a design studio for visual communication and interaction**  \nNLXL experiments with the possibilities of combining visual and interactive elements within single design solutions. Content, form and technique are carefully considered in each and every solution. NLXL designs logos, corporate and visual identities, web sites and web-identities, event styles, forms, posters, animations, books, content management systems, digital presentations and other digital applications. The exhibition will feature graphic posters and an interactive, multimedia installation.  \n [http://ubartgalleries.buffalo.edu/pages/UBArtGallery/cfacurrent.shtml](http://web.archive.org/web/20150317153242/http:/ubartgalleries.buffalo.edu/pages/UBArtGallery/cfacurrent.shtml \"http://ubartgalleries.buffalo.edu/pages/UBArtGallery/cfacurrent.shtml\")\n\n**Albright-Knox Art Gallery** (site of Friday’s Eric Spiekermann talk)  \n**Op Art Revisited  \nSelections from the Albright-Knox Art Gallery**    \nJuly 18 – October 26, 2008  \nOp art, also know as “Optical art,” refers to the work of a group of abstract painters in the early 1960s who—under the direction of artists Richard Anuszkiewicz, Bridget Riley, Julian Stanczak, and Victor Vasarely—utilized parallel lines, concentric circles, and electric colors to create works that give the visual effect of afterimages and illusion of movement.\n\n(all events open to the general public)\n\n",
  "author": "kegler",
  "time": "21 Jun 2008 — 1:10pm",
  "uid": "1334",
  "comments": [

  ]
}
