{
  "id": "46680",
  "title": "PHP embedding",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Could embedding a font with the use of PHP be regarded as read-only?\n\n [‹ Font suggestion for visually impaired](http://web.archive.org/web/20080905212234/http:/www.typophile.com/node/46587 \"Go to previous forum topic\") [Font Suggestion ›](http://web.archive.org/web/20080905212234/http:/www.typophile.com/node/46603 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905212234/http://www.typophile.com/user/17101\" title=\"View user profile.\">frode frank</a>",
  "time": "<br>",
  "uid": "17101",
  "comments": [
    {
      "time": " 22.Jun.2008 3.13am",
      "content": "What do you mean be “PHP embedding”? Creating images on the fly? PDFs?  \nWhere? On a webserver?\n\n"
    },
    {
      "time": " 22.Jun.2008 3.34am",
      "content": "Only one way I know: PHP + gd (library) with enabled freetype and t1lib.  \nThe result is pixel image.\n\n"
    },
    {
      "time": " 22.Jun.2008 7.21am",
      "content": "Most font vendors wouldn’t consider Web server based rendering “embedding” as such, but it doesn’t fit into the normal/traditional EULA model either - where you’re counting users and maybe output devices. For this reason Ascender and others do licenses fonts under a per-Web-server license.\n\n"
    },
    {
      "time": " 22.Jun.2008 11.49am",
      "content": "PHP embedding is a bad term. I mean creating an image with text in it dynamically using PHP. To do so you need to have the font files on your web server. Could a skilled programmer find the files and download them?\n\n"
    },
    {
      "time": " 22.Jun.2008 12.24pm",
      "content": "You need to check the EULA for “server use” not “embedding”. As Sii already said this sort of use usually requires an additional server license.\n\n"
    },
    {
      "time": " 22.Jun.2008 2.24pm",
      "content": "\\>Could a skilled programmer find the files and download them?\n\nIf the server is pwned by a hacker - so are the fonts. But unless these are super secret proprietary fonts, that’s likely to be inconsequential. There are easier ways to steal fonts.\n\n"
    },
    {
      "time": " 22.Jun.2008 7.38pm",
      "content": "Why not use sIFR instead?\n\n"
    },
    {
      "time": " 23.Jun.2008 5.16am",
      "content": "In that case, I’d need to purchase an extra license. I might just have to anyway, cause PHP seems to mess up anti alias for dark coloured text.\n\n"
    }
  ]
}
