{
  "id": "46726",
  "title": "typesetting a book need some suggestions",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,  \nI’m typesetting my first book, and after a month of looking through books, found one set in a typeface that looked fantastic, and it was id’d as Bookman in the id forum. I believe it is Bookman oldstyle.\n\nThe book is a collecton of short horror stories, trade paperback. I’ve searched through suggestions for book fonts, but bookman old style is not on any of those list. Is there any drawbacks to using this font, or any reason it shouldn’t be used? I’ve only seen it used in the one book. I really seem to be attracted to thicker, chunkier fonts for long passages of text. Any other suggestions if this isnt a good one to use?\n\nI printed out a few pages, 10pt seemed too small and 11pt too big. 10.5 looked just right. Is it okay to use half sizes?\n\nAlso, I’d like a typeface suggestion for the story title pages that would compliment well. Probably somewhat condensed as some of the titles are long. I was thinking Bodoni condensed, but seems I’m always using that.\n\nThanks for any suggestions!\n\n [‹ Help locating this font...](http://web.archive.org/web/20081011161446/http:/typophile.com/node/46845 \"Go to previous forum topic\") [Typography & Semiotics ›](http://web.archive.org/web/20081011161446/http:/typophile.com/node/45231 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011161446/http://typophile.com/user/32733\" title=\"View user profile.\">blixen</a>",
  "time": "<br>",
  "uid": "32733",
  "comments": [
    {
      "time": " 25.Jun.2008 6.00am",
      "content": "Anybody?\n\nWell, my two-cents-worth would be:\n\n(a) If 10.5pt looks right, go with it. Nothing wrong with half sizes.  \n(b) Not sure that a Bodoni is gonna go well for the title pages: I’d have thought a low-contrast sans-serif, something with shortish ascenders/descenders will match Bookman OS better...\n\nI’m sure the pros will have something more specific to suggest. :-D  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 25.Jun.2008 4.08pm",
      "content": "Oh, hi! Wow, I was just starting to think what a loser I was for asking stupid questions :)\n\nSo, any specific suggestions for the titles? I’ve looked through several short story collections, but nothing has really struck me.\n\nI’m a little lost, since this is rather new to me.\n\n"
    },
    {
      "time": " 26.Jun.2008 3.43am",
      "content": "I say if half point looks good, then go for it. The problem with clunky fonts on large amounts of text is it becomes a little hard to read after a while, it’s almost like a workout. If you give enough space in between the lines maybe it will work better. Try checking out Baskerville.It’s still sort of thick but a well known good reader font.\n\nAs for titles...I’m partial to trade gothic or franklin gothic. They both have condensed versions and contrast well to the serif text fonts.\n\n"
    },
    {
      "time": " 26.Jun.2008 11.00am",
      "content": "I don’t think Bodoni would work with Bookman at all. I must confess to finding Bookman a little dated but what’s old always becomes new again. It is fine to use half sizes, I do it all the time.\n\nFor your headers, why not something more fun given it’s a horror book? House Industries Monster fonts is one way to go, or something spiky and gothic. If you don’t want to go campy with it, I agree that a sans serif is a better idea than trying to find another serif that works with Bookman.\n\n"
    }
  ]
}
