{
  "id": "46741",
  "title": "July 31 \"Ditch The Default Day\"",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "65% of UK office managers have never considered using anything other than TNR or Arial...\n\n[http://www.responsesource.com/releases/rel\\_display.php?relid=39828&hilit...](http://web.archive.org/web/20080907013211/http:/www.responsesource.com/releases/rel_display.php?relid=39828&hilite= \"http://www.responsesource.com/releases/rel\\_display.php?relid=39828&hilite=\")\n\n [‹ Dangerous Curves by Doyald Young](http://web.archive.org/web/20080907013211/http:/www.typophile.com/node/46862 \"Go to previous forum topic\") [Found the pefect typeface, but it's not for sale! ›](http://web.archive.org/web/20080907013211/http:/www.typophile.com/node/46736 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907013211/http://www.typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 24.Jun.2008 7.43am",
      "content": "_companies are failing to stand out from the crowd when it comes to day to day correspondence with clients by using the same tired default font settings on **emails** and documents._\n\nOh, I didn’t know there were e-mail clients supporting @font-face rules already :)\n\nJens\n\n"
    },
    {
      "time": " 24.Jun.2008 8.16am",
      "content": "Well, quite. Some marketing bod in our company wanted us to add a message to our sig blocks and told us to use the corporate font. I sent a reply pointing out that as soon as we sent these messages to anybody external, it’d most likely turn into Arial or Courier or God-knows-what...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 24.Jun.2008 8.17am",
      "content": "I’m not surprized 65% of UK office managers have never considered using anything other than TNR or Arial. They’re office managers, not designers, aesthetes or typographers.\n\nJens, your joke is in poor taste.\n\nj a m e s\n\n"
    },
    {
      "time": " 24.Jun.2008 8.25am",
      "content": "No reason why @font-face can’t work with HTML based email. There were some people who worked out how to do it using Outlook Express (HTML+EOT) five or six years ago.\n\n"
    },
    {
      "time": " 24.Jun.2008 8.34am",
      "content": "First day I met Robert Norton I was still working for Agfa in Wilmington MA and he said he would never see a business letter serious in anything other than in Courier. It was the proper way to write a serious business letter in England.\n\n"
    },
    {
      "time": " 24.Jun.2008 8.38am",
      "content": "@sii: I’m sure, but you can’t guarantee that the recipients will have HTML-based email, can you? I frequently send rich-text emails to authors, and then get their replies all “Courierized” in plain text...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 24.Jun.2008 8.44am",
      "content": "_Jens, your joke is in poor taste._\n\nFont awareness among business people - I’m all for it. But when someone seriously tells me to change the font in my e-mail client to communicate my corporate identity to others, it begins to smell of bullshit.\n\nI mean, if I get a mail in Arial, I don’t expect that to be their corporate font. If they changed it to anything other widely installed, like say, Century Gothic, I would think “my god, is that really their corporate font?” ...\n\nJens\n\n"
    },
    {
      "time": " 24.Jun.2008 9.01am",
      "content": "\\> I’m sure, but you can’t guarantee that the recipients will have HTML-based email, can you?\n\nI was commenting on Jens post - I doubt the old OE hacks even work anymore.\n\n"
    },
    {
      "time": " 24.Jun.2008 10.16am",
      "content": "Corporate font choices in email…BLEAH. I’m getting really, really tired of the notion that branding is the practice of ensuring that every single thing a company does looks exactly the same. Wretched corporate monoculture hackery…\n\n"
    },
    {
      "time": " 24.Jun.2008 10.48am",
      "content": "\\>I’m getting really, really tired of the notion that branding is the practice of ensuring that every single thing a company does looks exactly the same\n\nTotally agree, at least Apple uses a Myriad of different fonts.\n\n"
    },
    {
      "time": " 25.Jun.2008 2.50am",
      "content": "Surely if workers are encouraged to use something else in their correspondence they’re likely to choose something \\*\\*\\*\\* awful instead.\n\nPerhaps they should hire me to suggest what to use… yes, hire me big companies…\n\n"
    },
    {
      "time": " 25.Jun.2008 3.46am",
      "content": "...and if they’re made too familiar with the features of HTML email, they’re also likely to start using “stationery”, which results in you receiving messages with floral (or faux-ruled-notepaper) backgrounds :-#  \nEcch.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 25.Jun.2008 3.52am",
      "content": "sorry about the asterisks people, I forget that I can offend sometimes.\n\napologies.\n\n"
    },
    {
      "time": " 25.Jun.2008 3.59am",
      "content": "“I’ve been accused of vulgarity. I say that’s bull\\*\\*\\*\\*.”  \n—Mel Brooks  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 25.Jun.2008 5.51am",
      "content": "“Just one thing, dude… Do ya have to use so many cuss words?”  \n“What the \\*\\*\\*\\* you talking about, man?”  \n“Have it your way dude…”  \n– The Dude/Cowboy Narrator\n\n"
    },
    {
      "time": " 25.Jun.2008 8.00am",
      "content": "I prefer a generic default font for emails.\n\nThe “document” one is reading is not really a single letter, but the email application—and one is reading a succession of emails, often tracking a conversation that contains one’s own mailings. So to have a variety of fonts for different people is rather like quotations from different characters in a novel being set in different fonts. Too fussy.\n\nEmail letters become complex enough in an un-designed way, with multi-coloured “chevroned” pull-quotes from previous letters being batted back and forth, and links jumping out in underlined blue.\n\nBut a corporate text font for letters that come in envelopes — that can be nice and discreet.\n\n"
    },
    {
      "time": " 25.Jun.2008 8.19am",
      "content": "Amen. Email is garbage. It’s not designed to be designed.\n\n"
    },
    {
      "time": " 26.Jun.2008 2.50pm",
      "content": "Yes, I prefer default fonts over some of the personalized work emails I get. I just replied to a co-worker and my reply had the same damn cloud background that the original email had. And don’t talk to me about about “signatures” set in Papyrus or Comic Sans that come from the admin assistant to the president.\n\nI just set my emails in Georgia because I know everyone has it and it looks better than Arial and TNR.\n\nDavid\n\n"
    },
    {
      "time": " 26.Jun.2008 3.12pm",
      "content": "My default typing document (i.e Word) font is either Centaur or Adobe Caslon, depending on what type of document I am writing. However, since Windows users don’t usually have either font and Mac users only have Caslon pre-installed, I tend to use Times for personal emails.\n\nAt work, I use whatever the standard / default font is set on the email program, which happens to be Arial. I see no reason to try to use another font since either people don’t have the ability to see other fonts and frankly could care less about what font is being used. In business emails, its content that counts.\n\nJon.\n\n"
    },
    {
      "time": " 26.Jun.2008 4.07pm",
      "content": "G T:\n\n[The Big Lebowski](http://web.archive.org/web/20080907013211/http:/www.imdb.com/title/tt0118715/) is one of my favorite movies. Anyone here who has not seen it really should.\n\n"
    },
    {
      "time": " 27.Jun.2008 4.44am",
      "content": "“Corporate font choices in email…BLEAH.” & “Amen. Email is garbage. It’s not designed to be designed.”\n\nThe voices of typophiles in typographic tartarus.\n\nCorporate font choice = individual font choice. Choice, is choice.\n\nLetters were not designed to be designed either. But, people seem to like them that way.\n\nCheers!\n\n"
    },
    {
      "time": " 27.Jun.2008 7.35am",
      "content": "Taunting! :)\n\nOkay, then...IMO the best design for an email message is the least design. Come to think of it, I feel the same way about letters.\n\n"
    },
    {
      "time": " 27.Jun.2008 9.46am",
      "content": "I’d have to agree with a few on here that default font is preferred in emails. I have to read tons of emails each day, it’s easier if they all look the same, my eyes can just glide through and get them over with. Besides, imagine if there were so many options to non-designers out there...just imagine the horror.\n\n"
    },
    {
      "time": " 27.Jun.2008 6.20pm",
      "content": "The most you can do decently is having a very simple standar format for corporate emails with a default font and maybe a simple gif signature at the end.\n\nHéctor\n\n"
    }
  ]
}
