{
  "id": "46761",
  "title": "Wine label and type",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi Everyone.\n\nI would really appreciate your comments on these wine label ideas the type CDV I am working on. This is my first time working on a wine label. It’s lots of fun - and challenging too!!! However, I am having a tough time with the CDV type. Needs help, but at this point I am not sure how to help it. Any ideas?\n\nProject: Chateau de Vie wine label\n\nThis project I made up because I wanted to help this vineyard, and I thought it would be a good opportunity to get into the wine biz. These guys run a bed and breakfast in Napa, California USA, and they have a vineyard as well. Their BnB is very nice, sophisticated, warm and cozy (kind of like Pottery Barn farmhouse style).\n\nHere is a description of their CABERNET SAUVIGNON - ’Darkly fruity nose of brandied cherries, bouillon, vanilla and rich forest floor scents with peppery hints in the background. Somewhat fleshy on the palate, where it shows deeply ripe cherry fruit tied to lots of mocha, vanilla, baking spice and toasty flavors.’\n\nThey do a very limited run each year, and are on a modest budget. They charge about $35/40 us dollars per bottle. So, it is not a budget wine or a premium high end wine either.\n\nI tried to play around with different label shapes, a natural paper label and a colored label. Some with an image of the Chateau (this actual image in layout is FPO) and some without. From one perspective I wanted to use the bottle as a marketing tool for their BnB as well. That is why on some I used an image of the Chateau. However, on some concepts I tried a label without an image of the Chateau.? Some styles lean more toward classic, and some a little more colorful. Currently they use the acronym CDV. This is why I kept some with CDV, but I am wondering if my treatment of CDV is too simple.\n\nCan you guys tell what you think in general? Label shapes? Type? Color? More?\n\nI appreciate your help. Thank you!!!!\n\n ![](http://web.archive.org/web/20080705105827im_/http:/typophile.com/files/ChateauDeVie_Label_5743.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [ChateauDeVie\\_Label.jpg](http://web.archive.org/web/20080705105827/http:/typophile.com/files/ChateauDeVie_Label.jpg) | 132.91 KB |\n\n [‹ sandwich label/logo](http://web.archive.org/web/20080705105827/http:/typophile.com/node/46610 \"Go to previous forum topic\") [Comments on my logo? ›](http://web.archive.org/web/20080705105827/http:/typophile.com/node/46449 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705105827/http://typophile.com/user/32903\" title=\"View user profile.\">Dave M</a>",
  "time": "<br>",
  "uid": "32903",
  "comments": [
    {
      "time": " 24.Jun.2008 3.29pm",
      "content": "5B would be my choice as it is most memorable and incorporates the house which I believe should be included based on what you said. Wine is a tough market and the orange color in this label with the bold type, I think is most memorable.\n\nMy one big problem is I think you should use a small ’d’ as in ’CdV’ the way it would be written.\n\nJay\n\n"
    },
    {
      "time": " 25.Jun.2008 8.24am",
      "content": "Definitely 5B. I love the shape.\n\n"
    },
    {
      "time": " 25.Jun.2008 10.42pm",
      "content": "I live in California wine country, and 5B definitely stands out among the labels I’ve seen in my experience. It perfectly fits a modern California vibe, and also does a good job of rebuffing a lot of the snobbishness that is creeping into the wine making culture here. Good work.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 26.Jun.2008 3.30pm",
      "content": "Thanks everyone for offering your feedback. I really appreciate it! It is very informative to hear everyones opinion and tastes. I will take this all into account and move forward. Please if anyone has anymore ideas I would like to hear them. THANKS!\n\n"
    }
  ]
}
