{
  "id": "4678",
  "title": "Comments type SERIAL KILLER",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Make your comments on the type Serial Killer. ![](http://web.archive.org/web/20131018073736im_/http:/www.typophile.com/forums/messages/29/35463.jpg)\n\n",
  "author": "mhirosse",
  "time": "9 May 2004 — 8:55am",
  "uid": "3412",
  "comments": [
    {
      "time": "9 May 2004 — 9:46am",
      "content": "Taking Arial and adding dribbles is not type design.\n\n"
    },
    {
      "time": "9 May 2004 — 9:51am",
      "content": "I find rich your comment, however many other types are conceived in the same way.   \nI believe that the creation should not limit if.   \nOpen your thoughts.   \n   \nThanx   \n   \nMarcio\n\n"
    },
    {
      "time": "9 May 2004 — 10:09am",
      "content": "It's fine to do this treatment of Arial for a logo or something. But it's certainly unethical to use the Arial design without attribution, and in most countries illegal if you used the actual Arial outlines to create a derivative typeface.   \n   \nIt's true that many shareware and freeware typefaces are conceived this way. That's because it is easy to do -- much easier than designing a new typefaces from scratch. But it's much less common for retail typefaces, for the reasons I mention above.   \n   \nI am actually quite impressed with the type sample and presentation, by the way. It's very effective graphic design.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "9 May 2004 — 10:38am",
      "content": "Thank you for the comment.   \nYes I agree with you on creating sources the starting from small alterations in your form.   \nMore in the case of Serial Killer there were a development process and creation.   \nThe type was conceived by a printer mistake, we used several wrong impressions until arriving in that result.   \nEven with that result we tried to make photocopies to win still more the dirty aspect.   \nThank you once again for the comment.   \nExcuse me for my terrible English. hehehehe!!!! ![:-)](http://web.archive.org/web/20131018073736im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nThanx   \n   \n   \nMarcio\n\n"
    },
    {
      "time": "10 May 2004 — 11:10am",
      "content": "John, what about the entire 90s?! ;-)   \nIn fact my biggest complaint about Marcio's work\\* is that it's a decade late.   \n   \n\\* I mean his fonts - some of his compositions are great.   \n   \nAs for \"plagiarism\": pragmatically, I think it's not so bad if the font is modified enough that nobody would use the derivative instead of the original. On the other hand, revealing any \"effort-saving\" tactics are always in order, at least among fellow designers.   \n   \nhhp\n\n"
    },
    {
      "time": "10 May 2004 — 11:54am",
      "content": "SERIAL KILLER WAS CREATED IN 1998.   \nI DON'T THINK IS I PLAGIARIZE, BE THE WILL FOR YOU CRITIQUE   \n   \nTHANX   \n   \nMARCIO\n\n"
    },
    {
      "time": "10 May 2004 — 1:16pm",
      "content": "Is the idea to sell this font? If you started with the outlines from Arial, as certainly appears to be the case from the graphic above, it would be an infringement of copyright to sell the font. Serial Killer appears to be what is legally known as a derivative work. A derivative work can only be made, used and distributed with the permission of the original copyright holder, excepting as permitted by fair use laws in individual countries.   \n   \nA derivative work may involve considerable original work -- indeed, it may account for most of the 'new' font, and all of what makes it distinctive -- but so long as a font makes use of another copyrighted work, it is considered a derivative work.\n\n"
    },
    {
      "time": "10 May 2004 — 1:28pm",
      "content": "Thank you for the information, more I am not marketing any material that I present at this forum.   \nin any moment I published something to send sale.   \nSerial Killer is an experiment that I accomplished behind at times.   \nFinally it will please some and to displease others.   \n  \nThank you\n\n"
    },
    {
      "time": "11 May 2004 — 2:12pm",
      "content": "TIFFANY,   \n ALREADY WROTE SOMETIMES HERE AND THE PEOPLE DIDN'T STILL READ ME I WRITE AGAIN:   \n\" IN ANY MOMENT I SUGGESTED TO SELL THE SOURCES, I PUBLISHED TO RECEIVE YOU CRITICIZE AND SUGGESTIONS \".   \nMORE FOR THE THAN I SEE THIS HALF COMPLICATED ONE.   \nI THANK YOURS IT CRITICIZES, ALTHOUGH I HAD ALREADY RESEARCHED THAT.\n\n"
    },
    {
      "time": "11 May 2004 — 2:47pm",
      "content": "Tiffany,   \nThank you for the help it is that already sent me some emails informing that I cannot sell the font SERIAL KILLER.   \nI interpreted your suggestion badly, I'm sorry!!.   \nThank you\n\n"
    },
    {
      "time": "11 May 2004 — 1:26pm",
      "content": "Moved thread to CRITIQUE/DISPLAY\n\n"
    },
    {
      "time": "11 May 2004 — 1:36pm",
      "content": "For what it is worth, I did a search for the EULA associated with the fontpack from Microsoft and found the following:\n\n> * * *\n> **quote:**\n> \n> \\*\\*Restrictions on Alteration.\\* You may not rename, edit or create any derivative works from the SOFTWARE PRODUCT, other than subsetting when embedding them in documents.\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n\nMost (all) foundries prohibit modifications for resale purposes. Some (few) foundries allow modifications for internal use. Perhaps Simon (Daniels) could let us know if anything has changed.\n\n"
    },
    {
      "time": "11 May 2004 — 2:28pm",
      "content": "I did read what you wrote. That is why I added, \"for what it is worth\". I wasn't accusing you, I was only trying to help.\n\n"
    }
  ]
}
