{
  "id": "46781",
  "title": "Research for Hamilton Mfg. Co. (Pictutures added)",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "I have come upon 2 complete cabinets from Hamilton Mfg. co. Completely full of many different types and sizes of what appears to be steel lettering. Also have around 60- 70 picture plates from the late 1800’s to the 1960’s. Some with the articals to go with them. Also have printing letter box, and many extras to go with it. Including spare parts and several manuals and books for an intertype press. All were used in a small town newspaper. Newspaper is aprox. 130 years and still going. I am looking for a VERY knowlegable person to figure out what I have!!!  \nAll of this is for sale if you are interested...\n\n| Attachment | Size |\n| --- | --- |\n| [102\\_5333.JPG](http://web.archive.org/web/20150317162004/http:/typophile.com/files/102_5333.JPG) | 177.59 KB |\n| [102\\_5325.JPG](http://web.archive.org/web/20150317162004/http:/typophile.com/files/102_5325.JPG) | 144.7 KB |\n| [102\\_5361.JPG](http://web.archive.org/web/20150317162004/http:/typophile.com/files/102_5361.JPG) | 115.43 KB |\n| [102\\_5362.JPG](http://web.archive.org/web/20150317162004/http:/typophile.com/files/102_5362.JPG) | 118.34 KB |\n| [102\\_5398.JPG](http://web.archive.org/web/20150317162004/http:/typophile.com/files/102_5398.JPG) | 98.21 KB |\n| [102\\_5328.JPG](http://web.archive.org/web/20150317162004/http:/typophile.com/files/102_5328.JPG) | 179.73 KB |\n| [102\\_5378.JPG](http://web.archive.org/web/20150317162004/http:/typophile.com/files/102_5378.JPG) | 45.35 KB |\n\n",
  "author": "jonnybegood",
  "time": "25 Jun 2008 — 4:38am",
  "uid": "32736",
  "comments": [
    {
      "time": "25 Jun 2008 — 7:35am",
      "content": "I'm not positive, but I assume this would have been an offshoot/evolution of the Hamilton Wood Type company.\n\nAs such, I was going to point you at them directly:\n\n[http://www.woodtype.org/](http://web.archive.org/web/20150317162004/http:/www.woodtype.org/ \"http://www.woodtype.org/\")\n\nBut, alas, it looks like they let their domain name expire.\n\nIt looks like the remnants of the Mfg. Co are now part of Thermo Scientific:\n\n[http://www.hamiltonlab.com/fisherhamilton/about+us/company+history/defau...](http://web.archive.org/web/20150317162004/http:/www.hamiltonlab.com/fisherhamilton/about+us/company+history/default.asp \"http://www.hamiltonlab.com/fisherhamilton/about+us/company+history/default.asp\")\n\n(I'm basing that assumption on that they, too, are also in Two Rivers, WI)\n\n"
    },
    {
      "time": "3 Jul 2008 — 3:24pm",
      "content": "The cabinets were manufactured by Hamilton, but not the type. Look on the side of an individual letter sort and see if there is a small embedded symbol. This would tell you what foundry made the type.\n\n"
    },
    {
      "time": "17 Jul 2008 — 8:19am",
      "content": "I have new pics. up. All of this and more are for sale if you are interested...\n\n"
    },
    {
      "time": "20 Nov 2008 — 1:50pm",
      "content": "My friend has to large cabinets together as a bar table with these. all completely there, i was looking through them. she has different sizes and fonts, very beautiful i believe she said something about it being for a type writer, like those giant ones they used for posters and such you'd see as signs, before they ever had printers to do it for them.\n\n"
    },
    {
      "time": "9 Jan 2009 — 11:46pm",
      "content": "I'm the Faculty Advisor of the Shakespeare Press Museum on the campus of Cal Poly is San Luis Obispo, California.\n\nI realize that the post has been up a long time, but this information may be valuable:\n\nAll of this looks very familiar to me. The cases, as already noted, were made by Hamilton Mfg. in Two Rivers, Wisconsin. Those were made into the 1960s, and these look quite nice.\n\nThe cases you show open are called \"California Job Cases\" and they appear to be in good condition. The type is made (mostly) of lead, and depending on the machine that cast the type, small amounts of tin and antimony are added for hardness and shrink-prevention.\n\nThe labels on the faces of the cases should indicate what the fonts are.\n\nThe engravings you show are probably zinc or copper photoengravings. These were common up into the 1960s and early 1970s. There is nothing particularly valuable about them, except that they might have interesting images on them.\n\nThey make nice collector's items.\n\nThe type and the cases are quite valuable to any book arts printer, hobbyist printer or letterpress production printer. I recommend trying to sell them locally (or you could donate the entire thing to a museum in your area). Shipping lead is REALLY expensive, and it would be exceptionally difficult to pack the cabinet without taking the type out of the cases and packing it to prevent damage. The lead is quite soft, and will get hurt if it falls even a two inches to a hard surface.\n\nI suggest that it is much more valuable as a package of working type and cases. Don't sell it piece-meal, as that does no justice to the real value of a good collection of type in good condition. There are many people who would love to use this type!\n\nYour local historic museum might be interested in the engravings, as they may have local historic value. Otherwise the engravings are not worth much.\n\nBrian P. Lawler  \nTypographic Insomniac\n\n"
    },
    {
      "time": "6 Jan 2015 — 4:33pm",
      "content": "I guess you need a museum experts to put value on what you have. Since you hold the 1800's era of items, surely that is very rare and many collectors will be interested to that. I have seen cabinet with vintage type of door at [http://caldwells.com/](http://web.archive.org/web/20150317162004/http:/caldwells.com/), many have put interest on the door alone, and you know how much it is, it is a 5 figure stuff.\n\n"
    }
  ]
}
