{
  "id": "46795",
  "title": "Illustrator help, please re: Create Outlines \\> Add Stroke \\> Then...?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi. I need help. I'm designing a logotype in Illustrator CS3. Turned fonts to outlines. Added a slight stroke. How do I now simplify the path, that is merge the stroke with the body? Any help appreciated. I've tried Illustrator's help pages, but am still stuck.\n\nThank you!\n\nihoff\n\n",
  "author": "ihoff",
  "time": "25 Jun 2008 — 8:25am",
  "uid": "32136",
  "comments": [
    {
      "time": "25 Jun 2008 — 8:38am",
      "content": "Im not positive what you mean by \"merge the stroke with the body\" but I think the \"outline stroke\" command might be what you're looking for. Select your logo, then go to Object/Path/Outline Stroke.\n\n"
    },
    {
      "time": "25 Jun 2008 — 8:59am",
      "content": "Object \\> Path \\> Outline Stroke  \nthen  \nPathfinder Palette \\> Add to Shape, then Expand\n\nIf your outlines are complex or dashed, instead of Object \\> Path \\> Outline Stroke, you will need to use  \nObject \\> Flatten Transparency with Vector/Raster balance at 100, and Convert Strokes to Outlines checked.\n\n"
    },
    {
      "time": "25 Jun 2008 — 9:16am",
      "content": "Jonathan and Red – thanks very much for your suggestions!\n\nJonahtan: What I meant was turning a font to outline, then adding a stroke resulted in a letter that had too many points/paths. The stroke had a path and the main body had a path and I wanted to merge the two. The Pathfinder Add to Shape option wasn't working.\n\nRed: You're second suggestion solved my problem! Thank you!!!! I've spent hours trying to work this one out. I've learned something new today. :)\n\n"
    },
    {
      "time": "30 Jun 2008 — 11:48am",
      "content": "\"offset path\" will also accomplish this. you can choose the amount of offset to mimic the stroke weight you like, apply offset, then use pathfinder to merge. no strokes needed.\n\n"
    },
    {
      "time": "1 Jul 2008 — 9:10am",
      "content": "ihoff, if I understand you correctly, you are adding a stroke to your outlined text. This will eat into the characters and change the shape of the letters. The solution is to outline your text, copy it, and then use the \"paste in back\" command (I believe it's in the Edit menu). _That_ is the text you stroke. Does this explanation make sense?\n\n"
    },
    {
      "time": "1 Jul 2008 — 1:04pm",
      "content": "i do agree with Ricardo Cordoba you have to be careful not to lose the shape and the way you're doing i think you will lose... of course we are forgetting something... proportions! proportions from stroke to the outline and proportions of the final work to the paper.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": "1 Jul 2008 — 3:30pm",
      "content": "Off Topic:  \nJoel, when is your site going to be up? The link on MyFonts is no good…\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "1 Jul 2008 — 7:05pm",
      "content": "yes ricardo is correct, if you want to preserve the original shape perfectly.  \nmake the new one with whatever method, and paste behind.\n\n"
    },
    {
      "time": "2 Jul 2008 — 2:00am",
      "content": "bert, my website already has been up but now i'm having problems with my domain, i think i'll have to buy another one.  \ni don't have much about type on my website, just portfolio but you would like to see for any reason or just... to see ?\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": "2 Jul 2008 — 3:13pm",
      "content": "Thanks everyone, really appreciate the help. I've only added a very small stroke (I hope). I'll try the 'paste in back' option next time.\n\nThis is the logotype. It's a new company, so the client asked me to put accent in. In a year we'll drop it. Comments welcome. The client has signed off on it, so I can't make any major changes. ;)\n\n ![](http://web.archive.org/web/20150219144800im_/http:/typophile.com/files/dignite_6137.gif)\n\n"
    },
    {
      "time": "2 Jul 2008 — 3:34pm",
      "content": "Oh, I see. Your stroke is the same color as the fill. The method I mentioned is useful if the stroke and the fill are two different colors.\n\n"
    },
    {
      "time": "2 Jul 2008 — 7:22pm",
      "content": "yes, you didn't lose the properties of the type-face.  \nBy the way... why isnt the ´ blue too? i don't know but i don't like but the solution on the end of the logo...\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": "2 Jul 2008 — 10:43pm",
      "content": "The client asked for the accent in black. Didn't understand the last part of your coment, Joel.\n\n"
    },
    {
      "time": "3 Jul 2008 — 2:42am",
      "content": "the solution of the E with accent black but if the client asked... the client is the boss!\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": "5 Aug 2008 — 12:52pm",
      "content": "I came across this thread looking for a solution to the double stroke problem. Here's the solution that satisfied my needs, based on the techniques mentioned in this thread so far:\n\n1. Convert Text to Outlines (cmd + shift + o)  \n2. Object \\> Path \\> Offset Path. Set offset to the stroke you would like.  \n3. Object \\> Compound Path \\> Release  \n4. Ungroup. (cmd + shift + g)  \n5. Pathfinder \\> Add to Shape, then Expand.\n\nThe result is a shape that mimics a text stroke.\n\n"
    },
    {
      "time": "5 Aug 2008 — 4:25pm",
      "content": "This is what I do.\n\n ![](http://web.archive.org/web/20150219144800im_/http:/typophile.com/files/creatoutlines_4271.gif)\n\n"
    },
    {
      "time": "10 Aug 2008 — 2:35pm",
      "content": "Why do you need to put a stroke on it? Try doing a path-offset path (by the number of points you want) and it will create a separate shape behind the type that is slightly larger. That way, you aren't crowding the inner elements of the type: it stays completely intact, you are just building around it.\n\n"
    },
    {
      "time": "12 Aug 2008 — 3:24pm",
      "content": "Serif Sheriff, you are correct. Of course, there are multiple ways of executing the solution. One can also use the Appearance Palette to add a stroke and placing the \"Stroke\" layer behind the \"Fill\" layer. Add as many new layers you want using the Appearance Palette.\n\ndaniel\n\n"
    },
    {
      "time": "30 Aug 2008 — 9:49am",
      "content": "Thanks everybody - I've learned a few new tricks and shortcuts.\n\nnaoiseo – how did you create the fab walk-through movie? very impressive.\n\n"
    },
    {
      "time": "30 Aug 2008 — 12:05pm",
      "content": "Of course if you are doing this you'll need to fine tune the shape because now that a looks all wrong. Just sayin'.\n\n"
    }
  ]
}
