{
  "id": "46818",
  "title": "Where are the Opentype Pro and Standard specifications?",
  "forum": "James Puckett's blog",
  "tags": [

  ],
  "content": "Where can I find a list of the characters (and their unicode values) that go into Latin Opentype Standard and Opentype Pro fonts?\n\n",
  "author": "<a href=\"/web/20080908022605/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 25.Jun.2008 7.18pm",
      "content": "Unfortunately, there is no standard. Each foundry has their own definition.\n\nMany, including [FontFont](http://web.archive.org/web/20080908022605/http:/typophile.com/wiki/FontFont) share [Adobe](http://web.archive.org/web/20080908022605/http:/typophile.com/wiki/Adobe)’s definition ( [PDF](http://web.archive.org/web/20080908022605/http:/www.adobe.com/type/browser/pdfs/OTGuide.pdf)) in which the only difference is that Pro fonts feature expanded language support, such as CE, Turkish, Greek, and Cyrillic.\n\nOther foundries define their “Standard” OpenType fonts as a simple conversion from the legacy formats — no added features or bundled figure sets and small caps. Their “Pro” fonts have these extras.\n\n"
    },
    {
      "time": " 25.Jun.2008 7.23pm",
      "content": "More discussion [here](http://web.archive.org/web/20080908022605/http:/www.typophile.com/node/19012), including Thomas Phinney’s official Adobe designation:\n\n<dl>\n<dd>Adobe’s practice is to use “Pro” to designate (A) Latin fonts which have Adobe CE coverage in addition to the Adobe Western 2 character set, and (B) fonts with the Adobe-Japan1-5 or greater character set as opposed to fonts with the Adobe-Japan1-4 or lesser character set.\n<p>For case (A), these fonts may also have Greek and/or Cyrillic coverage, but it is not required.</p>\n<p>For OpenType fonts that do not have CE coverage, Adobe calls them “Standard” regardless of the number of features involved. For example, Poetica Standard is is the result of merging 17 Type 1 fonts and has quite a few OpenType features. Similarly, Utopia Standard has an awful lot of typographic extras, but no CE coverage.</p>\n</dd>\n</dl>\n"
    },
    {
      "time": " 25.Jun.2008 9.27pm",
      "content": "Thanks!\n\n"
    }
  ]
}
