{
  "id": "46824",
  "title": "School",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey I am about to become a senior in high school and i am looking for digital art schools to apply to. I am from UT and i keep a decent GPA and etc. my passion is for photoshop and vector design so i am having problems in choosing what school to goto to become a graphic designer hopefully at an amazing design studio. I am looking for any school anywhere i dont plan to stay in state by any means for the tech schools here are just barely par. If anyone has anything about some amazing school please tell i am very determined and want to go some where that i am able to learn as much as possible. costs dont matter though like everyone else i’d prefer an amazing school for an amazing price but if i am forced to take out a student loan or two i am willing.\n\n [‹ Wallpaper Magazine Redesign...](http://web.archive.org/web/20080907162535/http:/www.typophile.com/node/38022 \"Go to previous forum topic\") [Who is Charles Andermack? ›](http://web.archive.org/web/20080907162535/http:/www.typophile.com/node/46850 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907162535/http://www.typophile.com/user/32991\" title=\"View user profile.\">izacchemical</a>",
  "time": "<br>",
  "uid": "32991",
  "comments": [
    {
      "time": " 26.Jun.2008 3.57am",
      "content": "Ah, I remember those days. I’m actually graduating college this coming semester. As for looking for schools, it’s not as easy to say “if you want to be a great designer...go here” that’s sort of on you. Although, here are a few schools that tend to have good reputations.\n\nTyler School of Art  \n(Paula Scher went there and possibly still teaches there? not sure)\n\nKansas City Institute of Art  \n(Some famous people roll through there quite often, so it gets a good name)\n\nMaryland Institute College of Art  \n(Mostly fine arts, but has a really good design program and a great reputation)\n\nIf you happen to make it out of the states, I recommend the Basel School of Design in Switzerland. Wolfgang Weingart still teaches there as far as I am aware...and if you get in a class with him, I’m sure you won’t regret it.\n\nPersonally, I’d stay away from the art institutes or any school you see advertising you can become a designer in less than 2 years...they have bad reps and unless your portfolio is AMAZING after graduating, you risk being laughed at. This also stands for the Bradley Academy, which only gives you a 2 year degree anyway. (Even though I had one teacher from there at my school and he was amazing typographer)\n\nIn the end though pick a place where you feel like you fit in. You have to spend YEARS there, so mine as well have fun! I don’t want to act like I KNOW what I’m talking about, I’ve never went to any of these schools. I’m just basing my opinion on the schools I have heard over and over since I started college. Good LUCK!\n\n"
    },
    {
      "time": " 26.Jun.2008 2.11pm",
      "content": "I would look for a school with a good foundation program in design itself and not worry so much about digital art degrees, or their emphasis on technology. You’ve already learned photoshop and you can learn other programs at your local community college. What makes a good designer is their knowledge of design and its fundamentals, not their knowledge of the tools used to make it alone. While knowing how to manipulate the tools can make you very productive, it is nothing without knowledge of composition, color, etc.\n\nThe schools listed above are good, I would add Rhode Island School of Design in there, John Maeda is taking over as president and he is amazing. But it’s pricey... also look into Cooper Union and School of the Art Institute of Chicago. I hear the latter’s program is much more “hands off,” if exploring on your own is your thing.\n\nMy boyfriend studied art at University of Utah and is doing just fine now as a designer for video games, so, don’t discount it too much. Oh, and last I heard, Savannah College of Art and Design wasn’t accredited by the National Schools of Arts and Design, and I was warned way back when to stay away.\n\n"
    },
    {
      "time": " 27.Jun.2008 12.41am",
      "content": "thanx to both of you! I am actually into painting also so i wanted a good art based school but i was just see’n if certain schools are more known for digital arts and etc... and in the end if i make it into a school to where the teachers (some how) dont know much about photoshop and illustrator..etc the things ill learn from the painting and drawing classes will be a huge help either way since those programs are just tools that are supposed to simulate painting\n\none again THANX\n\nand if anyone knows how many pieces i should put into a portfolio that would be very appreciated.\n\n"
    },
    {
      "time": " 27.Jun.2008 1.36am",
      "content": "Well, the school you apply to will most likely give you a number of pieces they want to see as well as numerous guidelines, so just look into the school. It’s also a good idea to get a sense of whatever every school wants to see so you don’t spend too much time on other projects.\n\nMost art schools will want to see an example of hand drawing, some photography maybe...yea, I can’t get too specific, because each school will have their own guidelines.\n\n"
    },
    {
      "time": " 27.Jun.2008 9.45am",
      "content": "“my passion is for photoshop and vector design so i am having problems in choosing what school to goto to become a graphic designer”\n\nWell, it sounds like you’re hovering on the edge of fine arts vs. graphic design. Which is good. And that means you’re going to want to aim specifically for an art school. Something that has a strong fine arts and graphic design program.\n\n“Personally, I’d stay away from the art institutes or any school you see advertising”\n\nYep. Basically, any school that advertises on TV during the Price is Right or during the Cheers reruns after the 10pm news should be avoided at all costs ;o)\n\n"
    },
    {
      "time": " 27.Jun.2008 10.15am",
      "content": "You’re already in Utah, so take a look at BYU, it puts out great designers and has a strong reputation.\n\nStay away from “digital media design” programs at art colleges. From what I’ve seen the trade schools do these very well and have eaten up so much of the enrollment at art colleges that the art colleges are making promises they can’t keep about teaching students to design for video, film, and video games.\n\nFind a school that participates in foreign study programs. You’ll get a lot out of studying under designers in a different place.\n\nAs for your portfolio, what goes in will vary by where you apply. Some schools will send you a list of pieces to create, others will specify a range. One warning: most admissions departments don’t want to see anything that even resembles anime/manga fan art.\n\n"
    }
  ]
}
