{
  "id": "46820",
  "title": "To all New Yorkers ; libraries, bookshops ?...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello,\n\nI am a young french student and I’m spending a month in New York City... Although I’ve already done a bit of research, I don’t know where to find good bookshops (new or second-hand books) specialized in type or graphic design.  \nAlso, I have to research on Morris Fuller Benton, so I thought I might find some material here in college or public libraries, but I have no clue of where to look for that.\n\nSo, if any New Yorker could help me with this, I’d be very grateful!\n\nIf you can think of any event related to type/graphic design coming this month, please don’t hesitate to bring it up ...\n\n [‹ Alternatives to Skopex](http://web.archive.org/web/20081015114431/http:/typophile.com/node/46842 \"Go to previous forum topic\") [Adobe Support Issues... ›](http://web.archive.org/web/20081015114431/http:/typophile.com/node/46827 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015114431/http://typophile.com/user/12248\" title=\"View user profile.\">melinaa</a>",
  "time": "<br>",
  "uid": "12248",
  "comments": [
    {
      "time": " 25.Jun.2008 9.25pm",
      "content": "The [TDC](http://web.archive.org/web/20081015114431/http:/www.tdc.org/) has a library that’s rather nice. There’s also a [Taschen store](http://web.archive.org/web/20081015114431/http:/www.taschen.com/pages/en/company/contacts/823.htm) and a nice selection of design titles can be found at the MoMA bookstore. The various school libraries may have weird summer hours, so call ahead for those.\n\nOtherwise the New York bookstores aren’t very special, they’re just bigger and more expensive versions of the bookstores found everywhere else. New Yorkers rave to me about the gigantic Strand Books (which isn’t much bigger than a large suburban Barnes and Noble), but it’s really just a huge clearing house for remainders and discounted bombs dressed up with some stacks of discounted new stuff, and the rare books room is mix of junk and esoterica, almost none of which is of use to typographers. Don’t waste time there if you have serious research to get done. If you’re looking for special antique stuff I have the address of a by-appointment only place that does type books around here somewhere.\n\n"
    },
    {
      "time": " 26.Jun.2008 3.00am",
      "content": "The TDC is in the process of moving its office, so I think the library will be unavailable till September or so.\n\nColumbia University has a terrific rare books library, but I believe it is by appointment only. I remember seeing a great collection of type specimens at a private showing there.\n\n"
    },
    {
      "time": " 26.Jun.2008 9.15am",
      "content": "Check out the TypoWiki’s Bookstores listing:\n\n[http://typophile.com/node/30036](http://web.archive.org/web/20081015114431/http:/typophile.com/node/30036 \"http://typophile.com/node/30036\")?\n\n"
    },
    {
      "time": " 26.Jun.2008 9.25am",
      "content": "For research, try the [New York Public Library](http://web.archive.org/web/20081015114431/http:/www.nypl.org/index.html)’s [Humanities and Social Sciences branch](http://web.archive.org/web/20081015114431/http:/www.nypl.org/research/chss/), located at Fifth Avenue and 42nd Street... You can’t borrow their books, but they have a lot of hard-to-find volumes.\n\n[Here’s an online search I did for “american type founders”](http://web.archive.org/web/20081015114431/http:/catnyp.nypl.org/search/?searchtype=d&searcharg=american+type+founders&searchscope=2&SORT=D&extended=0&SUBMIT=Search&searchlimits=&searchorigarg=dfuller+benton%2C+morris).\n\n"
    },
    {
      "time": " 26.Jun.2008 10.49am",
      "content": "James, I know I’ve been out of NYC now for about 10 years, but please, I cannot believe the wonderful Strand Bookstore is no more than a dumping ground now for B&N...\n\nMeanwhile - how is Alabaster Bookshop for used & rare books these days? Also, one of my old favorites, I forgot the name was on 59th Street off of Lexington — are they even still there? They had a wonderful collection of rare maps as well?\n\nThe city never sleeps... it’s always tossing and turning.\n\n"
    },
    {
      "time": " 26.Jun.2008 10.56am",
      "content": "I recommend the Urban Center on Madison Ave. in the 50s.\n\n"
    },
    {
      "time": " 26.Jun.2008 3.23pm",
      "content": "You should check out Oaklander Books as well.\n\n[http://www.merchantcircle.com/business/Oaklander.Books.212-594-4210](http://web.archive.org/web/20081015114431/http:/www.merchantcircle.com/business/Oaklander.Books.212-594-4210 \"http://www.merchantcircle.com/business/Oaklander.Books.212-594-4210\")\n\n"
    },
    {
      "time": " 26.Jun.2008 6.31pm",
      "content": "I knew there was an older thread about this topic:\n\n[http://www.typophile.com/node/30021](http://web.archive.org/web/20081015114431/http:/www.typophile.com/node/30021 \"http://www.typophile.com/node/30021\")\n\n"
    }
  ]
}
