{
  "id": "46835",
  "title": "font that's kinda like Agency Gothic?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Any typophiles out there with a suggestion for another typeface that is similar to this one?\n\n ![](http://web.archive.org/web/20130622103418im_/http:/typophile.com/files/agencygothic_4348.png)\n\nI'm having a hard time committing to this one-- it's ALMOST working, but I'm interested in trying out a few substitutes...\n\nMany thanks!\n\n",
  "author": "fiftyfootgirl",
  "time": "26 Jun 2008 — 8:55am",
  "uid": "22264",
  "comments": [
    {
      "time": "26 Jun 2008 — 10:14am",
      "content": "You need something with a shadow, or just the base forms?\n\n"
    },
    {
      "time": "26 Jun 2008 — 10:49am",
      "content": "Well, the qualities I like with this font are tall, elongated, crisp + open, and I think it's the shadow that's giving me trouble, even though I like it too. When small on screen, it doesn't read, and in fact looks a little corrupted.\n\n"
    },
    {
      "time": "26 Jun 2008 — 10:52am",
      "content": "I always knew that one as Agency Open. Since we know not what your layout is - one thing I can see is that this face is \"weak.\" Perhaps it can work for you in the bold - that has more body to it... just a thought. Thank you.\n\n"
    },
    {
      "time": "26 Jun 2008 — 11:21am",
      "content": "Thanks, Jackie- I think you're right about it being Agency Open, though it's showing up in my library as AgencyGothic Plain.  \nAt any rate, here is the context (the version with Agency is third from the left; all are still in the \"puttering around\" phase.\n\n ![](http://web.archive.org/web/20130622103418im_/http:/typophile.com/files/first_love_4298.png)\n\nit's for a wedding photographer's website. Her style is cute and a little quirky, but also sophisticated and cosmopolitan.\n\n"
    },
    {
      "time": "26 Jun 2008 — 1:34pm",
      "content": "Missy - the Agency, IMHO, does not do the \"cute, quirky but cosmo\" kind of a look for you. I think your first \"comes\" (is that Caledonia?) would look nice replacing the Agency in the third sample (going left to right that is...)\n\nJust me...\n\n"
    },
    {
      "time": "26 Jun 2008 — 2:24pm",
      "content": "All of them work for me. I like how the agency gothic tones down the cute. for me that is quirky.\n\n"
    },
    {
      "time": "26 Jun 2008 — 2:32pm",
      "content": "Missy, someone should tell you this -- that name is dirty, especially with COMES broken out.  \nJust tell your client relax, don't do it.\n\n"
    },
    {
      "time": "26 Jun 2008 — 3:10pm",
      "content": "HA!  \nI know- I noticed how PRONOUNCED that word was when I returned to my desk after lunch, and I was like, \"WHOOPS!\" That's kind of the problem with that font- it got to that point because it only looks good big (when it's smaller, it contorts and degrades on screen thanks in part to the shadow, methinks. Thanks so much for the feedback, all- when I have it a little more nailed down I'll come back for a full critique (yes, I know, there were about 50 more double-entendres in this paragraph. Get back to work, you perverts!)\n\n"
    },
    {
      "time": "26 Jun 2008 — 3:27pm",
      "content": "Hmm. You know. I didn't read it that way until you pointed it out.\n\n"
    },
    {
      "time": "26 Jun 2008 — 5:59pm",
      "content": "Oh Miss Tiffany of purest mind :)\n\n"
    },
    {
      "time": "26 Jun 2008 — 6:44pm",
      "content": "Well I wasn't trying to say I'm an angel or anything. Simply that it didn't strike me like that. O:^)\n\n"
    },
    {
      "time": "26 Jun 2008 — 7:10pm",
      "content": "I'm with you Tiffany - I didn't see it that way at all! Maybe its the romanticist in me - I was paying attention to the fact its for a wedding photographer -- not a \\*\\*\\*\\* photographer - big difference :-)\n\n"
    },
    {
      "time": "26 Jun 2008 — 7:29pm",
      "content": "Exactly!\n\n"
    },
    {
      "time": "27 Jun 2008 — 3:19am",
      "content": "I saw it that way immediately. The design is ok as long as, ehm, that word isn't the largest and most prominent of the three, I think.\n\n"
    },
    {
      "time": "27 Jun 2008 — 2:19pm",
      "content": "Ok, here is a revised, hopefully G-rated version of the Agency, as well as some other options. Any suggestions or criticism is appreciated! Thanks!\n\n ![](http://web.archive.org/web/20130622103418im_/http:/typophile.com/files/love_5259.png)\n\n"
    },
    {
      "time": "27 Jun 2008 — 2:42pm",
      "content": "They are still cute. Do you have to use only one?\n\n2. The word spacing is far too great compared to the line spacing.\n\n3. Probably my least fave just because it doesn't mix it up as much.\n\n"
    },
    {
      "time": "28 Jun 2008 — 3:01am",
      "content": "exactly :)\n\nAlso, #2 if the wordspacing were fixed would be my choice - it speaks volumes and it tells me who they are. Now I know they do photography!\n\n"
    },
    {
      "time": "28 Jun 2008 — 12:42pm",
      "content": "very cute!!!! I like!\n\n"
    }
  ]
}
