{
  "id": "46841",
  "title": "Logo redesign for Pentecostal church",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m designing a website for a friend of mine who is a pastor of a Pentecostal church in my town. Although designing a logo is not part of the job, the logo that he gave me to work with is completely horrid. I think it’s one of those $99 for a church logo deals, where you select the logo and text you like and they come up with a “customized design” just for your church. I know: I should be careful doing this. Direct, positive and constructive criticism would be appreciated!\n\n ![](http://web.archive.org/web/20081013104815im_/http:/www.typophile.com/files/calvaryway_5025.png)\n\n [‹ Did I get too inspired by another artist's design?](http://web.archive.org/web/20081013104815/http:/www.typophile.com/node/47142 \"Go to previous forum topic\") [Nonprofit Logo Design ›](http://web.archive.org/web/20081013104815/http:/www.typophile.com/node/47082 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013104815/http://www.typophile.com/user/16005\" title=\"View user profile.\">nvhladek</a>",
  "time": "<br>",
  "uid": "16005",
  "comments": [
    {
      "time": " 26.Jun.2008 12.52pm",
      "content": "I don’t go to church, so this could be a complete generalization, but isn’t the pentacostal church more of an old-timey fire and brimstone kind of thing? That logo is very modern. Maybe they’re looking to attract a more modern audience, but it seems like that would be more appropriate for one of the new mega churches.\n\nAnyway, the kerning is uneven, and if those are flames, I’m not sure what they represent.\n\n"
    },
    {
      "time": " 26.Jun.2008 1.47pm",
      "content": "Thanks for the feedback. I’m particularly interested in the perspective of people who don’t go to church, since this will help me avoid churchy cliches.\n\nThis is not a final design, so I’ll work on the kerning later, but thanks for pointing that out.\n\nThe flames reference Pentecost, the Christian holiday that celebrates the coming of the Holy Spirit like tongues of fire to the disciples of Jesus (cf. Acts 2). Pentecostalism is a varied worldwide movement of Christianity, of which the old-time fire-and-brimstone style is only one type. This church does not fit that mold. Could a modern design fit a church that is neither fire-and-brimstone nor a mega-church?\n\nThe congregation is made up of a good number of families, but there is also a significant population of younger people, so I was thinking a modern direction would be more appropriate. The pastor is not your typical minister. He’s a 30-something guy who is into a lot of hardcore and rock music, and so I think it fits his personality as well. Thoughts?\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 26.Jun.2008 2.26pm",
      "content": "Here’s it a bit more refined:\n\n ![](http://web.archive.org/web/20081013104815im_/http:/www.typophile.com/files/calvaryway_5014.png)\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 26.Jun.2008 2.28pm",
      "content": "The flame curves need a lot of refining. The typeface doesn’t relate to the flames at all (too techy) and should be a heavier weight.\n\nDavid\n\n"
    },
    {
      "time": " 26.Jun.2008 3.55pm",
      "content": "Add a humanist sans and some sparkling colour to those flames and it’ll scream Web 2.0.\n\nPerhaps something like Akzidenz Grotesk could be fit for this job?  \n [http://www.linotype.com/261297/akzidenzgrotesk-family.html?subviewmode=F...](http://web.archive.org/web/20081013104815/http:/www.linotype.com/261297/akzidenzgrotesk-family.html?subviewmode=FONTS&samplestr=Calvary+Way+Church \"http://www.linotype.com/261297/akzidenzgrotesk-family.html?subviewmode=FONTS&samplestr=Calvary+Way+Church\")\n\nI just finished redesigning a church identity. It would be interesting to follow your process more closely. E-mail me if I can be of any help!\n\n"
    },
    {
      "time": " 26.Jun.2008 4.26pm",
      "content": "Thanks frode. I may take you up on that. What do people think about Gill Sans? Also, are those curves looking any better?\n\n ![](http://web.archive.org/web/20081013104815im_/http:/www.typophile.com/files/calvaryway2_5515.png)\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 26.Jun.2008 5.44pm",
      "content": "Much better. I still feel that flames for a church is an odd fit. I was baptized Roman Catholic so maybe it just the fear of God that was instilled in me ;0)\n\n"
    },
    {
      "time": " 27.Jun.2008 3.38am",
      "content": "I think that the typography, particularly the positioning and leading, is poor. The proportions (text V mark) seem wrong. I’d get out the pencil and start again to be honest.\n\nRoss\n\n"
    },
    {
      "time": " 27.Jun.2008 10.16am",
      "content": "Jay, flames are very appropriate for a pentecostal church. It is symbolism for the Holy Spirit, not hell. :-)\n\nSharon\n\n"
    },
    {
      "time": " 27.Jun.2008 11.24am",
      "content": "@Ross: Thanks for the critique about positioning and leading of the type. These seem like minor issues compared to your observation that the proportions between the text and mark seem wrong, however. Could you be a bit more specific about what is causing the lack of harmony? Also, are you suggesting I start over with my type treatment, or with the whole project?\n\n@Sharon: Yes, you hit the nail on the head. It sounds like people need to hear some teaching about grace. Anyway, for those who missed my explanation from before, read [this passage from Acts](http://web.archive.org/web/20081013104815/http:/www.biblegateway.com/passage/?search=acts%202:1-4;&version=51;) to see what I’m using as my material.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 27.Jun.2008 11.35am",
      "content": "Also, here it is with a vertical orientation and some more tweaks to the curves:\n\n ![](http://web.archive.org/web/20081013104815im_/http:/www.typophile.com/files/calvaryway3_6584.png)\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 27.Jun.2008 12.04pm",
      "content": "OK Sharon. I’m not scared any more :)\n\n"
    },
    {
      "time": " 27.Jun.2008 12.07pm",
      "content": "Jay, I had never considered before how the flames could be interpreted. I’m glad to know that. :-)\n\n"
    },
    {
      "time": " 27.Jun.2008 12.08pm",
      "content": "Nick, there is something discordant about your flames. I think the negative space between the left and middle one may be the source.\n\nSharon\n\n"
    },
    {
      "time": " 27.Jun.2008 12.22pm",
      "content": "OK. I think I’m seeing what you’re referring to. The negative space looks kind of like a lumpy flower vase, no? I’ll work on that ...\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 27.Jun.2008 12.31pm",
      "content": "Not that these flames should be overpowering, but I think the three flames should remain separate, but work as one. If you follow me. I agree with Nick about the negative space.\n\n"
    },
    {
      "time": " 27.Jun.2008 2.01pm",
      "content": "I think that part of the problem is what sharon mentioned about the left flame and the middle flame. also, i can imagine in your color solution having red or orange or yellow for the flames, but right now they feel heavy next to your selection of type. I would try outlining the flames. This would add an interesting image to type relation, especially if they weren’t treated with an even line weight, but more organic feeling.\n\nalso, i would think about putting that type all on one line, it doesn’t look good broken up right now, at least the way you are doing it with all lower case letters.\n\n"
    },
    {
      "time": " 27.Jun.2008 2.23pm",
      "content": "Draw one shape for the entire flame, then draw shapes for the negative areas and punch those out of the flame shape. You will end up with a more cohesive look.\n\nDavid\n\n"
    },
    {
      "time": " 27.Jun.2008 4.00pm",
      "content": "Here’s an attempt to integrate some of the suggestions posted. Am I headed in a good direction?\n\n ![](http://web.archive.org/web/20081013104815im_/http:/www.typophile.com/files/calvaryway5_4876.png)\n\n_Edited to replace image with correct version_\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 28.Jun.2008 6.22pm",
      "content": "How about tucking the left part of the flame underneath the others?\n\n"
    },
    {
      "time": " 28.Jun.2008 10.39pm",
      "content": "i think adnix’s suggeestion is very good for getting the mark to work.\n\nalso, have you though about other sans options?\n\nGill has a long and solid history, but maybe there is something more contemporary?\n\nLike: [Museo](http://web.archive.org/web/20081013104815/http:/www.myfonts.com/fonts/exljbris/museo/) or [Stag](http://web.archive.org/web/20081013104815/http:/www.vllg.com/Schwartzco/Stag/mudTyper+Weights/) ??\n\n"
    },
    {
      "time": " 29.Jun.2008 4.22pm",
      "content": "Also, I stumbled upon this logo in the paper:\n\n[http://www.wyd2008.org/](http://web.archive.org/web/20081013104815/http:/www.wyd2008.org/ \"http://www.wyd2008.org/\")\n\nIt’s for World Youth Day 2008 in Sydney, from what I can gather is a big Christian youth event.\n\nTheir logo may help you as it references the fire of the Holy Spirit as well as the Cross and the Sydney Opera House, plus looks quite nice, well to me at least.\n\nCheers\n\n"
    },
    {
      "time": " 29.Jun.2008 4.27pm",
      "content": "also this: [http://www.wyd2008.org/index.php/en/about\\_wyd08/logo](http://web.archive.org/web/20081013104815/http:/www.wyd2008.org/index.php/en/about_wyd08/logo \"http://www.wyd2008.org/index.php/en/about\\_wyd08/logo\")\n\n"
    },
    {
      "time": " 29.Jun.2008 10.17pm",
      "content": "Hi Simon,\n\nThanks for those posts. They give a lot of good food for thought. I may give Museo a whirl, although I’m not at my computer right now. I’ll be back tomorrow with an update.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 30.Jun.2008 3.18am",
      "content": "Hi Nick, what I meant with regard to the proportions of the elements was mostly to do with their weights. The example you posted above with the flame outlined looks more balanced to me.\n\nGreat idea from David about achieving correct negative space in the flames.\n\nRoss\n\n"
    },
    {
      "time": " 1.Jul.2008 5.26am",
      "content": "hi nick, no worries, another option for a sans is [Knockout](http://web.archive.org/web/20081013104815/http:/www.typography.com/fonts/font_styles.php?productLineID=100013) or maybe a slab like [Archer](http://web.archive.org/web/20081013104815/http:/www.typography.com/fonts/font_styles.php?productLineID=100033) could do the trick?\n\n- sye\n\n"
    },
    {
      "time": " 1.Jul.2008 3.48pm",
      "content": "I like Gill, and also thought I would give Skia a shot, since it’s also free and well designed. I think it also balances even better than Gill. Here’s my latest:\n\n ![](http://web.archive.org/web/20081013104815im_/http:/www.typophile.com/files/calvaryway6_4284.png)\n  \n\n ![](http://web.archive.org/web/20081013104815im_/http:/www.typophile.com/files/calvaryway7_4441.png)\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 1.Jul.2008 4.09pm",
      "content": "I like the first and second flames and their negative space in between. But the negative space in between the second and third as well as the third flame still need more life.\n\n"
    },
    {
      "time": " 1.Jul.2008 5.53pm",
      "content": "Lose the strokes, they don’t add anything. I suggest going back to paper and drawing a bunch of flames. Google images of flames for reference. Right now it looks too bottom heavy-flames are slightly more vertical.\n\nDavid\n\n"
    },
    {
      "time": " 1.Jul.2008 9.38pm",
      "content": "I agree about the strokes.\n\n"
    },
    {
      "time": " 2.Jul.2008 9.26am",
      "content": "I agree with the comment at looking at flames for reference, it seems to look more like a water drop with all the flames funneling and shaping in toward the top most point.\n\nthe middle flame probably has the most flame-like shape to it. try to move the left and right flames up and down so that they don’t quite line up so much at the top and bottom. it will add tension and interesting visual space if they don’t line up so much.\n\n"
    },
    {
      "time": " 3.Jul.2008 10.32am",
      "content": "Try getting rid of the rightmost flame and rotating the other two a couple of degrees counterclockwise.\n\n- Lex\n\n"
    },
    {
      "time": " 3.Jul.2008 12.09pm",
      "content": "Darnit, it just came to me.\n\nThe overall flame should be similar in shape to a W and the 2 outer pieces should be similar to Cs. That way it sublty has the initials of the church.\n\nDavid\n\n"
    },
    {
      "time": " 7.Jul.2008 12.06pm",
      "content": "Good idea, David!\n\n"
    },
    {
      "time": " 7.Jul.2008 5.09pm",
      "content": "Thanks David. Among the very good input I’ve received on this thread, your advice has stood out as both honest and helpful throughout. I’ve been mulling over the “W flame” idea but the project has been put on hold for a bit. I’ll come back soon with an update.\n\n—  \nNick Hladek\n\n"
    }
  ]
}
