{
  "id": "46871",
  "title": "AE with acute, slashed O with acute, A with ring and acute",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The Windows Glyph List 4 have the Unicode ranges “Latin-1” and “Latin extended A” and the characters “latin small letter f with hook”, “latin capital letter ae with acute”, “latin small letter ae with acute”, “latin capital letter o with stroke and acute”, “latin capital letter a with ring above and acute”, “latin small letter a with ring above and acute” and “latin capital letter ae with acute”.\n\nI have identified that many languages are supported with Latin-1 and Latin extended A, that the f with hook is used as a currency symbol for the Florin, and ome fonts also includes the S and T with comma below for use in Romanian. But I’m not sure if the ae with acute, the slashed o with acute and a with ring and acute have some actual usage currently. I know that keyboards for Sami language can input them, but those don’t use them; and I read somewere that in Danish these were used in dictionaries, but they can’t be input by Danish keyboards, although they may still be used in some way, but I haven’t see it.\n\n [‹ ttf similar to \"Arno pro caption\"?](http://web.archive.org/web/20081012143939/http:/www.typophile.com/node/46877 \"Go to previous forum topic\") [An alternative font for Trajan Pro ›](http://web.archive.org/web/20081012143939/http:/www.typophile.com/node/46809 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012143939/http://www.typophile.com/user/22817\" title=\"View user profile.\">Peroyomas</a>",
  "time": "<br>",
  "uid": "22817",
  "comments": [
    {
      "time": " 27.Jun.2008 7.43pm",
      "content": "WGL4 should be split into two sections, Regular and Extended (which would also include all those weird geometric thingies).  \nIt’s supposed to be a standard, but many foundries are coming up with their own encodings.  \nI for one don’t follow WGL4, because I can’t bring myself to draw all that rubbish.\n\n"
    },
    {
      "time": " 28.Jun.2008 2.03am",
      "content": "John Hudson at [http://www.typophile.com/node/39752#comment-244401](http://web.archive.org/web/20081012143939/http:/www.typophile.com/node/39752#comment-244401 \"http://www.typophile.com/node/39752#comment-244401\")  \nWhen Microsoft were spec’ing the WGL4 character set, they decided to take an inclusive approach to European diacritic letters, even if the characters in question were not found in everyday orthographic use. Hence, the Aringacute (along with Oslashacute and AEacute, and lowercase equivalents) were all included and, through this, became fairly standard inclusions in OpenType glyph sets for European language support.\n\nAnd John again on the fhook/florin (U+0192) subject at [http://www.typophile.com/node/35138](http://web.archive.org/web/20081012143939/http:/www.typophile.com/node/35138 \"http://www.typophile.com/node/35138\")\n\n"
    },
    {
      "time": " 28.Jun.2008 2.53pm",
      "content": "For what it’s worth, we have something with ae-acutes about once a year. I don’t believe I’ve ever set the others in the last 25 years. But it is so hard to tell what people will need, I’ve never set a d-macron, either, but some people need it every day.\n\nLately, we seem to get a lot of Native American languages, and the orthographies for these are neither consistent nor common. Other times, you’ll get a run of stuff needing Yoruba, or transliterated Arabic, Polynesian, etc. etc. I would imagine it is hard for a font designer to know just what to put in a font.\n\nMuch of this should perhaps be handled by the applications programs. I remember back when the “front ends” for photocomp & early digital machines all had routines for using floating accents. Today, if fonts have the combining diacriticals, this would work except when double-accents are needed. Even here, I think an applications program could provide the solution. It was easy enough to do with TeX, & I imagine it could be provided for with InDesign. If the Unicode combining diacriticals are used, the meaning of the text wouldn’t be affected, and font designers wouldn’t be put in the impossible position of having to figure out who’s going to need what, as far as accents go.\n\n"
    }
  ]
}
