{
  "id": "46881",
  "title": "Son of a Linotype Salesman",
  "forum": "nancy sharon collins's blog",
  "tags": [

  ],
  "content": "One of the subjects for the History of Graphic Design in South Louisiana project is James Gabour, 96, who still goes every day to his printing plant in Pineville, Louisiana.\n\n ![](http://web.archive.org/web/20081015211546im_/http:/www.typophile.com/files/linotype-territory-map_3826.jpg)\n\nFor a while he was the local Linotype sales and service rep, his region around here was quite large.\n\nJames’ son, Jim Gabour, Artist in Residence and Professor of Video Technology, Loyola University New Orleans told me about his dad and we have been corresponding about him ever since.\n\nFollowing is the text from some of that correspondence while setting up my appointment to take James oral history:\n\n“Sent: Date: Jun 21, 2008 9:43 AM  \nTo: nancy sharon collins  \nSubject: Re: dad\n\nThanks, Nancy.\n\nDad loves the attention. The Smithsonian was talking to him about a print museum a couple of years back, right before Bush destroyed their funding. We have been trying to get him to safeguard this huge amount of material for years. Maybe your attention will make him value them more.\n\nMy first interview was just to get him to demo the operation and function of all the machines, graphic and type formats before they decayed or that old place burns down. Later this summer i am going to talk to him more on-camera about history.\n\nHe has a lot of that:\n\nhe was heavily into Indian motorcycles\n\nhe was a mess sergeant in the army, stationed in panama during WWII\n\nhe went to linotype school in brooklyn for a year or so, then more study in Chicago\n\nhe was shop steward for the printer’s union at the daily where he and my mom met (she was a cub reporter), and when the national union called a strike and the daily replaced everybody with scabs he started up a rival daily that lasted a couple of years\n\nhis linotype territory include northern Mexico\n\nWhen he and Mom got those weekly papers, as the eldest i worked three minimum ten-hour days a week after school from age 8 until i left for university at 18 on a press association scholarship. We started typesetting MON, laid out ads and pages TUE, and worked until midnight or later WED with the press run and printing and affixing mailing labels.\n\nIt was a good experience, and i watched him make it work\n\njg\n\n—\n\nSent: Jun 23, 2008 7:11 AM  \nTo: nancy sharon collins  \nSubject: Re: linotype\n\nwhen i ride my bike to the gym today i will try and shoot a few pix of the linotype bldg and send them along. i will send them to Dad too, as he remembers working in the bldg well\n\nfunny, every time i hold one of those 108-point wood letters in my hand i think of the human energy invested in its existence. and the metal 2-point no less\n\ndid you see that odd “machine” for hand-setting type on the diagonal? pretty cool. i forget what he called it, but i don’t remember it being there in my decade of residence as a child. he has continued picking up odd bits of print shops that have gone under over the years, and even though he no longer uses them he keeps them in shape and treasures them\n\njg\n\n—\n\nTo: nancy sharon collins  \nSubject: empty space  \nDate: Jun 25, 2008 2:06 PM  \nAttachments: linotype space.jpg  \n﻿  \nthis is where the linotype bldg stood until very recently, at the corner of Union & Baronne — i went to a few great art-opening parties in its new lobby prior to the storm, and it was a wonderful space. must have taken a Katrina hit, like many others\n\nas you can see, when they tore it down they painted where it adjoined the other buildings\n\njust got its first burst of grafitti\n\nthe passage of time is marked in many ways\n\n ![](http://web.archive.org/web/20081015211546im_/http:/www.typophile.com/files/linotype-space_4049.1.jpg)\n\n[http://www.jimgabour.com/](http://web.archive.org/web/20081015211546/http:/www.jimgabour.com/ \"http://www.jimgabour.com/\")\n\n[http://neworleans.aiga.org/home/history\\_project\\_1](http://web.archive.org/web/20081015211546/http:/neworleans.aiga.org/home/history_project_1 \"http://neworleans.aiga.org/home/history\\_project\\_1\")\n\n",
  "author": "<a href=\"/web/20081015211546/http://www.typophile.com/user/14410\" title=\"View user profile.\">nancy sharon collins</a>",
  "time": "<br>",
  "uid": "14410",
  "comments": [
    {
      "time": " 28.Jun.2008 6.20pm",
      "content": "Nancy,\n\nJust wanted to say that I like the historical and cultural perspective that you bring to the forum. Its always a pleasure to read stories like this.\n\nStephen\n\n"
    },
    {
      "time": " 30.Jun.2008 4.00pm",
      "content": "Why should it be “mean old W’s” fault when plenty of private concerns could have stepped up to the plate?\n\nTired of the entitlement mentality.\n\n"
    },
    {
      "time": " 1.Jul.2008 4.03am",
      "content": "Did not mean for that to come out terse and forgot to say I would be happy to make a contribution if they decide to go with private funds.\n\nMichael\n\n"
    },
    {
      "time": " 1.Jul.2008 7.27am",
      "content": "“Tired of the entitlement mentality.”\n\nI’m tired of my tax money going to private concerns rather than public.\n\n"
    },
    {
      "time": " 1.Jul.2008 9.44am",
      "content": "That’s what I was saying!\n\nMichael\n\n"
    },
    {
      "time": " 1.Jul.2008 9.49am",
      "content": "I’d call a museum public. But, whatever, we’re derailing this thread. ;o)\n\nNice post Nancy. Sorry for politicizing it.\n\n"
    },
    {
      "time": " 2.Jul.2008 2.38pm",
      "content": "Hi,\n\nNancy here. I have been in the field taking more oral histories so lost the thread. Umm, what did I miss? Where did the mean old W and entitlement aspect come into my original blog, I would love to know (with my head so much into history maybe I miss the current connections.)\n\nSunday I found out that James Gabour has every catalog, manual and written record from his time as a Monotype rep. I captured about an hour of video on him this go ’round.\n\nThanks for allowing history to be inspiring.\n\n"
    },
    {
      "time": " 2.Jul.2008 3.44pm",
      "content": "Sorry Nancy... the mean ole W remark was a gut reaction to the propensity for piling on Bush when in fact I think it was gutless politicians who probably slashed the bill fearing for their political lives. Don’t know and willing to be corrected. As to the funding I think since it was a private concern it should be kept from under the thumb of the “guberment” as they usually muck up the works. Hence my willingness to contribute to the cause. As to the public versus the private I think the line has been blurred for so long that those concerned with a particular facet of our heritage should belly up to the bar and forget the bureaucrats.\n\nJust trying to help, tell me what I can do.\n\nMichael\n\n"
    },
    {
      "time": " 3.Jul.2008 5.51am",
      "content": "1. I am petitioning for TypeCon to come to New Orleans 2011, please support this initiative.\n\n2. Prior to this I was just made Special Projects Director, AIGA New Orleans. Most of my efforts will go towards the “History of Graphic Design in South Louisiana Project”. AIGA is all volunteer and the local chapter is supported only by its members (about 40 professional) so our pockets are quite shallow.\n\n[http://neworleans.aiga.org/home/history\\_project\\_1](http://web.archive.org/web/20081015211546/http:/neworleans.aiga.org/home/history_project_1 \"http://neworleans.aiga.org/home/history\\_project\\_1\")\n\nDo you think that if I asked for donations for a designated fund anyone would help? We need operating expenses and storage (translate: gas money to take oral histories and hard drive space and physical storage space.)\n\n3. Follow my line of reasoning as I draft the long form of the article I am working on, “New Orleans Green Salon 2008” for the Seattle Journal for Social Justice. (I have copied and pasted the abstract below:)\n\n2008 New Orleans Green Salon\n\nNancy Sharon Collins and Daniela Marx  \nLoyola University New Orleans\n\nAbstract:\n\nThroughout North America, AIGA Center for Sustainable Design (CFSD) uses “green salons” to promote sustainable practices in design. In March 2008, Loyola University New Orleans hosted a Salon. In a city traditionally filled with creative vitality, what could sustainable currently mean when New Orleanians were still being consumed by efforts to stabilize communities, careers and individual lives? Quoting from the original notes and video footage taken during the New Orleans Salon, this article chronicles events, expert opinions and artistic insights as well as anecdotal community and individual concerns. By examining the text of this one-day event this article shows the tenuous relationship between academia, community, business and the arts in a city still challenged by the aftermath of great disaster.\n\n[http://sustainability.aiga.org/discussion/2008/03/bright\\_mississi.cfm](http://web.archive.org/web/20081015211546/http:/sustainability.aiga.org/discussion/2008/03/bright_mississi.cfm \"http://sustainability.aiga.org/discussion/2008/03/bright\\_mississi.cfm\")\n\n[http://neworleans.aiga.org/events/2008/03/17421097](http://web.archive.org/web/20081015211546/http:/neworleans.aiga.org/events/2008/03/17421097 \"http://neworleans.aiga.org/events/2008/03/17421097\")\n\n"
    }
  ]
}
