{
  "id": "46883",
  "title": "Magpie released, I hate Comic Sans pdf available, Como una estrella del rock!",
  "forum": "vinceconnare's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20101204160633im_/http:/typophile.com/files/magpierelease_4852.JPG)\n  \n\n ![](http://web.archive.org/web/20101204160633im_/http:/typophile.com/files/rockstar_4558.jpg)\n  \n\n ![](http://web.archive.org/web/20101204160633im_/http:/typophile.com/files/3cit_vconnare_3878.jpg)\n  \n\n ![](http://web.archive.org/web/20101204160633im_/http:/typophile.com/files/2616243154_ac6a3778c1_o_6041.jpg)\n\nSlides with presenter notes available from Valencia conference 3CIT Tercer Congreso Internacional de Tipografía presented by  \nAsociación de Diseñadores de la Comunidad Valenciana ADCV\n\n[http://www.connare.com/typography.htm](http://web.archive.org/web/20101204160633/http:/www.connare.com/typography.htm \"http://www.connare.com/typography.htm\")\n\nDedicated to BillG otherwise known as Bill Gates. Have a happy retirement and best of luck with the charities.\n\n ![](http://web.archive.org/web/20101204160633im_/http:/typophile.com/files/2608944232_7236f57266_4926.jpg)\n\n",
  "author": "<a href=\"/web/20101204160633/http://typophile.com/user/7029\" title=\"View user profile.\">vinceconnare</a>",
  "time": "<br>",
  "uid": "7029",
  "comments": [
    {
      "time": "",
      "content": "Vince, The Dark Knight Returns was DC, not Marvel.\n\nThanks for posting this. I'm not sure how I feel about it; it seems like there's not very much substance and that you don't really start your rhetoric until the last slide, so your argument is not very strong. Otherwise, though, it's always interesting to hear about what goes in to certain typefaces directly from the designer, so I appreciate your posting this.\n\n"
    },
    {
      "time": "",
      "content": "yes I made a mistake DC yes, but the Marvel I looked at I forgot to mention it's Daredevil from Marvel. sorry  \nvinnie\n\n"
    },
    {
      "time": "",
      "content": "Vince: Did you make Comic Sans for a Norwegian comic strip?\n\n"
    },
    {
      "time": "",
      "content": "No I originally made Comic Sans for Microsoft's Consumer Division which was to market software at novice users and the Home market (NOT the normal business customers that most software was being made for).\n\np.s. The Dark Knight has fixed his problem.\n\n"
    },
    {
      "time": "",
      "content": "Ok. Magpie looks very interesting, btw!\n\n"
    },
    {
      "time": "",
      "content": "\\>DrDoc it seems like there’s not very much substance and that you don’t really start your \\>rhetoric until the last slide, so your argument is not very strong.\n\nHave you read the Notes? left top icon, double click it and the notes open.\n\nThe overall talk is about showing that Microsoft was making software for home computers in every house and made a Consumer division ('93). Software was made not for designers, businessmen but novice common people. Common people love it. Designers hate it but it wasn't made for them it was made for dummies.\n\nvincent\n\n"
    },
    {
      "time": "",
      "content": "BillG's leaving video!!!!\n\n[http://news.bbc.co.uk/1/hi/business/7476720.stm](http://web.archive.org/web/20101204160633/http:/news.bbc.co.uk/1/hi/business/7476720.stm \"http://news.bbc.co.uk/1/hi/business/7476720.stm\")\n\nRay Ozzie 'We'll give credit where credit is do.  \nCraig Mundie 'Oh absolutely. Microsoft Bob, his idea, all his.'\n\nhahahahahahahahahahahaha\n\n"
    },
    {
      "time": "",
      "content": "BillG and Microsoft how there's a computer in every home with Comic Sans.\n\n[http://www.microsoft.com/presspass/exec/billg/videos/default.aspx?videoID=0](http://web.archive.org/web/20101204160633/http:/www.microsoft.com/presspass/exec/billg/videos/default.aspx?videoID=0 \"http://www.microsoft.com/presspass/exec/billg/videos/default.aspx?videoID=0\")\n\n"
    },
    {
      "time": "",
      "content": "Vince, I was reading the notes. What I'm saying is that your argument (from what I gather — not trying to set up a straw man) is that Comic Sans somehow reflects what design is all about, because it reflects what the consumer wants. I'd really like to see that argument developed further, particularly the idea that design is about reflecting what the greater public wants.\n\n"
    },
    {
      "time": "",
      "content": "<cite>the idea that design is about reflecting what the greater public wants/<cite></cite></cite>\n\n...or needs.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Hey, I remember MS comic chat. I used it for some time before moving to ICQ. It was quite a nice software but a bit obtrusive.\n\nHéctor\n\n"
    }
  ]
}
