{
  "id": "46896",
  "title": "Reality check before the fog: Web fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This session description, was on the TypeCon web site. I was kindly invited to join this panel, but alas, by the time last week's invite was offered, I was booked for Punkt weekend.\n\n\"No one can argue that improvements around fonts for the web aren’t long overdue, but the current scheme has various drawbacks. The most serious problem being that only freeware fonts can be used, with the fonts web designers want to use [] completely off-limits, leading to fears that commercial fonts will be misused...\"\n\nHmmm.  \n\"No one can argue that improvements around fonts for the web aren’t long overdue,\"  \nWell some people have successfully argued against doing anything productive for near 1.5 decades, quite obviously, right?\n\n\"...but the current scheme has various drawbacks.\"  \nThere is one? I mean, there is a scheme and it is cross-platform, cross-browser and solitary?\n\n\"The most serious problem being that only freeware fonts can be used...\"  \nIs this true? Does font embedding prevent the use of non-freeware fonts?\n\n\"... with the fonts web designers want to use are completely off-limits...\"  \nWho knows what they want, or what their licenses allow, so, what da heck is \"completely off-limits\"?\n\nAll comment types encouraged, (except for Varge, who needs to shut up forever;).\n\nCheers!\n\n",
  "author": "<a href=\"/web/20100116125204/http://typophile.com/user/2969\" title=\"View user profile.\">dberlow</a>",
  "time": "<br>",
  "uid": "2969",
  "comments": [
    {
      "time": "",
      "content": "What's the point David?  \nThe corporations that set the standards have annual revenue in the billions of dollars and will do what the hell they want, whatever you, I, the rest of the \"font industry\", end users, or various governments have to say about it. If they want to exchange opinions amongst themselves on a panel at a type conference, your presence (or not) won't make a blind bit of difference.\n\nIs that real enough?\n\n"
    },
    {
      "time": "",
      "content": "Hi David,\n\nDB\\> This session description,\n\nThat's actually not the description for Adam's talk and the panel discussion to follow - it's a blog entry I wrote for the TypeCon blog...\n\n[http://www.typecon.com/talk.php?id=145](http://web.archive.org/web/20100116125204/http:/www.typecon.com/talk.php?id=145 \"http://www.typecon.com/talk.php?id=145\")\n\n...In which I encouraged people attending TypeCon to get educated on the issues, so that they can contribute their thoughts on the downloadable Web fonts scheme...\n\n\"The “Web Fonts” scheme calls for fonts to be posted on web servers, downloaded and temporarily installed by browsers in order to render web pages. Earlier this year Apple’s Safari browser became the first to support the system.\"\n\nNS\\> The corporations that set the standards have annual revenue in the billions of dollars and will do what the hell they want, whatever you, I, the rest of the “font industry”, end users, or various governments have to say about it. If they want to exchange opinions amongst themselves on a panel at a type conference, your presence (or not) won’t make a blind bit of difference.\n\nYou're probably right. For the record the multi-billion dollar revenuers Adam Twardoch, Roger Black, Ted Harrison, Erik van Blokland, Zara Evens, and Bill Davis will be joined by Christopher Slye and me (MS and Adobe generally oppose the scheme). But aren't you playing into the hands of these evil standards-setters by remaining silent?\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "Answering your other question, sorry I missed it earlier…\n\nDB\\>Who knows what they want,\n\nTom and Ralf have done polls so we know what web designers want. The same fonts they use in print and other medias, so called “commercial fonts”.\n\nDB \\> or what their licenses allow\n\nWe analyzed 30+ EULAs and none allowed posting to Web sites. Ralf and James are the only commerical font vendors experimenting with licensing fonts for use under the scheme.\n\nDB \\> so, what da heck is “completely off-limits”?\n\nSo the fonts web designers want to use, can’t be used under the scheme. Does that makes sense?\n\n"
    },
    {
      "time": "",
      "content": "David, fonts in PDFs are a source of problem for more than web designers. I have recommended to publishers in the past that they not use certain foundries fonts, because the EULA either outright forbids it or says something like \"contact the company for details on extra license needed\" (al la Font Bureau). The one time I did this (not Font bureau), I was told that since that exposed the font to an extra 100,000 computers, I'd have to license it for those 100,000 computers. The price was astronomical. The font was not used for the book.\n\nMore than a few academic publishers have a contract with NetLibrary, which requires a PDF with full font embedding.\n\nThere needs to be a solution for this general problem, be it web or print. However, now that The Internet is such a large market, maybe a solution for that will be available for those of us who still only use type for print, too. Otherwise, we're going to have to drastically expand the calligrapher base.\n\n"
    },
    {
      "time": "",
      "content": "\\>David, fonts in PDFs are a source of problem for more than web designers.\n\nI don’t think the panel will be discussing PDF embedding issues – rather font distribution as promoted under the Web fonts scheme and possible alternatives – I’m sure someone will suggest that SIFR, regular Flash files and PDF should be used for rich content, however the promoters of the scheme are looking for a HTML+CSS solution – an open standard not a closed proprietary system. A separate thread on PDF embedding would be appropriate for the release section.\n\n"
    },
    {
      "time": "",
      "content": "_More than a few academic publishers have a contract with NetLibrary, which requires a PDF with full font embedding._\n\nThere needs to be a solution for this general problem, be it web or print.\n\nOne solution is for publishers to commission custom typefaces for which they can purchase rights up-to-and-including perpetual exclusivity. There comes a point where licensing existing commercial fonts for either a large install base or electronic distribution becomes more expensive than commissioning a custom font family. If individual publishers cannot afford to commission their own typefaces, they can join with others to pool their resources (as the members of the SBL Font Foundation have done). Such a solution works particularly well for academic publishers, since they tend also to have specialised requirements that existing commercial fonts may not support.\n\n"
    },
    {
      "time": "",
      "content": "<cite>One solution is for publishers to commission custom typefaces for which they can purchase rights up-to-and-including perpetual exclusivity.</cite>\n\nThat will happen right after pigs start whistling as they fly about. Before academic publishers do that, they'll all move to open source fonts & y'all can complain about the sad state of typography in academic publishing.\n\nBut I guess we're hijacking a thread . . .\n\n"
    },
    {
      "time": "",
      "content": "The more obvious solution is to use fonts with no commercial document embedding clause - such as those from Adobe or Microsoft. Adobe's having the advantage of allowing modifications (according to their FAQ).\n\nBack on-topic - with PDF embedding you have a choice of vendors, most of whom allow embedding, some of whom have restrictions about what you can do with the document. With the web fonts scheme there are no vendors (except Ralf & James) providing any licensing mechanism.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "It does seem like there would be a mint to be made if you could charge micro payments like google does for rendering a site in the right font for it's users without exposing the the Intellectual property of the font to risk. Maybe sfir will get better and allow kerning and CALTs and so on... I am not sure but it looks to me like sfir is WAY to slow to render whole sites and that probably cannot be helped - ever. Probably the rendering does have to happen locally for it be a fast/tasty solution.\n\nWith all this technical trouble, the wisdom of John's comments about commissioning new designs does carry lots of weight.\n\nThe problem with that model is that it is geared to a narrow part of the font using market. A part of the market that is very organized and has specific ideas about what it wants. It's a formal market. I am not dismissing it, just characterizing it.\n\nA bigger ( by volume) part of the market would be served by a service of the kind I have outlines above. That is a more casual market.\n\n"
    },
    {
      "time": "",
      "content": "With regard to the interesting question of EULAs not allowing fonts to be embedded in pdfs. This requirement only came into force a few years ago. Most of the fonts that anyone would want to use were already available by then, without quite such restrictive licenses. So couldn't you simply use an older version of the font which, obviously, is not subject to these silly new requirements? Hmmm, maybe my old Font Folios and Monotype Libraries are worth more than I thought - - not to mention the entire Bitstream and lots of ITC library that used to come with old versions of CorelDraw, old copies of which anyone could buy for pennies. I started throwing away font CDs in 1994 - - it was a big moment way back then! - - now I wish I'd kept them.\n\nSpeaking of font values, I just found an interview I did with Alex Kaczun in 1992 when I was using MCI Mail for email. He said,\n\n'The biggest ripoff is people copying fonts, and they don't think anything of it. There won't be any money or incentive to make new fonts if this goes on.'\n\nand that was before internet-enabled email was current.\n\nYes, we used to do it on floppies back then. URW made a huge fuss when they found out that Alex was using his Linotype-purchased Ikarus-M on his home Mac. How much was Ikarus-M back then? Five grand? Ten? Lino started counting up the hundreds of thousands they'd passed URW's way, and I don't remember how it all got resolved. URW was nearly finito by then, but fortunately there was still enough money in the kitty a few years later to get Albert-Jan Pool to refit the whole library. That is now a good and inexpensive library - - I wonder if it has pdf restrictions?\n\n"
    },
    {
      "time": "",
      "content": "_That will happen right after pigs start whistling as they fly about._\n\nThat will be welcome. At the moment, I can't hear them coming and neglect to duck.\n\n"
    },
    {
      "time": "",
      "content": "SD: _MS and Adobe generally oppose the scheme_\n\nWell, if Internet Explorer isn't going to support it, why is there anything to discuss?\n\n"
    },
    {
      "time": "",
      "content": "The 1995 Microsoft Font Pack was said by InfoWorld to have made more money than all font foundries from the beginning of time. Nearly everybody who bought Windows 95 seemed to have bought it, for $99. Why not make that the standard? No restrictive licenses, and it can be had on eBay 'buy it now' for a whole 49 cents.\n\nYou can't even \\_find\\_ Corel Draw 5, with its 1000 top quality fonts in TT and PS on eBay, that's how valueless it is. Again, no restrictive licenses.\n\nSeriously, it is just BS to suppose that anyone will ever pay for web fonts, or even that they have any value.\n\nPrint publishers are 99.5% delighted with the 99.5% low-quality fonts they use everyday. Their customers are not complaining.\n\nMicro-payments are never going to exist.\n\nThis discussion can't be rationally held without letting go of the fact that, post-PostScript, nobody is \\_ever\\_ going to make huge money on fonts again. That is the meaning of the technology we have today.\n\nAdd to that the overwhelming demographic fact that the few of us who still believe software should be paid for will be completely extinct in 50 years.\n\n"
    },
    {
      "time": "",
      "content": "sii\\> _“...however the promoters of the scheme are looking for a HTML+CSS solution”_\n\nThat might spoil my current method of using only Verdana and Georgia for every single project. Does anyone really need a script face? Certainly Comic Sans is usable anytime you need a handwritten look. Right? (Sarcasm intended)\n\nYou're absolutely right Sii. Standards-based web designers have had about a half dozen to maybe a dozen common fonts to use for years. There is no reason that at least another handful of fonts couldn't and shouldn't be common to all browsers.\n\n"
    },
    {
      "time": "",
      "content": "\\>SD: MS and Adobe generally oppose the scheme\n\n\\>Well, if Internet Explorer isn’t going to support it, why is there anything to discuss?\n\nThe current climate with respect to Web standards means you can't pick and choose what to support, especially if/when all your competitors, and an increasing number of web sites start to take advantage of it.\n\n"
    },
    {
      "time": "",
      "content": "\"don’t think the panel will be discussing PDF embedding issues – rather font distribution as promoted under the Web fonts scheme and possible alternatives\"\n\nWell, my 2 cents is that in terms of 'licensing' there is no difference. The issue is vendors vs. the public \"pirates\" vs. the customer.\n\nIdeally, regardless of the particular electronic medium, the vendor will accommodate the needs of the customer without letting the paranoia of the \"pirates\" interfere.\n\n"
    },
    {
      "time": "",
      "content": "I'm going out on a limb here with a suggestion. Some people will think this idea laffable. Let them eat cake, or frosted fonts. It worked for Wikipedia founders Jimbo Wales and Larry Sanger, so...\n\nHere is what I think we should do: **design a way forward** by starting up a Font Media Foundation. F.M.F is to be an \"open font media\" bank, whose goals are as follows:  \n\\* assemble an open library of \"open licensed\" fonts designed specifically for web and new media use  \n\\* all FMF fonts to be **new creations** wiki-made by the world's leading font makers  \n\\* it works like the Wikimedia Foundation and the Wikimedia Commons---except this is a Font Commons, initially for comon fonts long out of copyright, but eventually more and better stuff  \n\\* font maker contributors start fonts and hopefully finish them. Contributors work on each other's fonts and hopefully finish them. It all takes place online in a wikimedia-powered environemnt. Eventually a big pile of great fonts get wiki-built.  \n\\* font maker contributors don't get paid money. You do as little or as much as your commercial schedule allows  \n\\* philanthropic contributors required to seed the project---Microsoft, Apple, Opera, Mozilla, W3C, Yahoo/Flickr, Google, AIGA, large design and ad agencies to provide seed funding and computers to host the font data  \n\\* webpage designers and publishers who use the service FMF provides to be encouraged to make cash donations to the foundation, especially those who make commercial use of fonts held in the library. That kind of voluntary ongoing funding worked for Wikipedia and the Wikimedia foundation, so it could work for us.  \n\\* if it's a success and the cash donations run into profit, I am more than happy to accept payment for my part in proceedings. In that case other contributing font makers and contributors should get paid too.\n\nI'm ruling out adding existing fonts from any existing foundry catalog, especially the well-known retail and popular ones, regardless of their EULA types and terms, as a way of avoiding confusion and legal hassles.\n\nA lot of people said Wikipedia would or could never work, but five years+ down the track it's the standard general reference on the web and still going strong. It's still something of a mess but the areas that really matter like science, history, the arts, politics and so on have been in great shape for several years already. I did my bit for typography at Wikipedia and now I would like to return to making fonts and getting a central wiki-authored font bank going as soon as humanly possible.\n\nIf the graphic design and web design industries want to avoid the looming spectre of the great web fugly and want decent fonts available online 24/7 to use on webpages—you are going to have to help pay for it. Fonts don't grow out of the ground. If commercial font makers like myself, David, Nick and others represented here at Typophile want to avoid the next big piracy nightmare and contribute to the solution—this is the way to go. We are going to have to co-operate and wiki-author fonts together.\n\nI am willing come over there and help you guys set it up. It needs a charter and a steering comittee / board of directors. It needs a Tiffany too : ^ )\n\nAll suggestions and criticism welcome.\n\nWhat else? I am very busy with my Harold Lohner conversation project right now but I will try find time to come back to this tomorrow.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "<cite>Micro-payments are never going to exist.</cite>\n\nYeah, and that’s why I am willing to put up a 100 euro donation to fund the all-in purchase of an all in licence for — lets say — 50 greatlooking typefaces/families.  \nMe thinks that any designer that gets offered a six figure sum to liberate a family of six cuts will accept that. So with a fund of some 5 to 10 million bucks we’d resolve this issue in no time. Just a matter of a couple of thousand people who can offset the cost of a nice meal for the benefit of millions…\n\nRight?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "BT: \"Seriously, it is just BS to suppose that anyone will ever pay for web fonts...\"  \nShould I, give, the money, baaaack?  \nES: \"It does seem like there would be a mint to be made if you could charge micro payments... \"  \nA greed. (before SII can say so;)  \nSD:\"With the web fonts scheme there are no vendors (except Ralf & James) providing any licensing mechanism.\"  \nIt's just a scheme, why would any serious vendors provide for it until it's a standard and quality-approvable, when there is so much 'private' web font work?  \nCE: \"David, fonts in PDFs are a source of problem for more than web designers.\"  \nIf it zooms, I don't care, thanks.  \nJH: \"One solution is for publishers to commission custom typefaces for which they can purchase rights up-to-and-including perpetual exclusivity.\"  \nYes, that is a good business. Do You think I should give, the money, back?\n\nThere is no standard font size(s) or rendering method. So, embedding = happy display faces, sad text faces. Text face makers are thus at both ends of the reading problem, waiting patiently to serve the public. Are readable screen fonts a technical problem with exclusively technical solutions, and not design problems with design solutions? Do you want to comment on that in the session SII? (Hopefully you saw MS's Mr. Hill's presentation of last year?)\n\nAlso, I learned something new four months ago or so — MS believes that no one, (outside of a very limited number of people on the whole planet), need to know what hints are recognized by Windows Vista in its default mode, in order to effectively provide text type to web clients and their clients. Do you want to comment on that too SII?\n\nI of course, will brief Roger on these issues, and he will have the live options at session-time.\n\nNick: \"Shut Up David\" (I'm paraphrasing there.)  \n... the day before I plan to force you into a conversation, I'll let you know.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "Just some thoughts on James' wiki approach ... So basically you suggest that more free fonts available would cater the demand of potential webfont users.\n\nBut you wouldn't need webfont-capable browsers for your idea. Make some high quality free fonts, then make a deal with operating system or browser makers to supply these fonts with their products.\n\nBut after a while these fonts would become as overused as the currently available choices, and clients still can't use their corporate fonts on the web, etc.\n\nPlus, I'm not sure the collaborative approach would work with fonts as it does with Wikipedia. Many people know a bit of information and spare ten minutes or so to submit it to Wikipedia. But how many people out there are able to produce high-quality fonts? Can they spare the time to do so for free? If they were to develop fonts together with other people, could they agree on a common format, i.e. would professionals learn to use FontForge or open source enthusiasts shell out for FontLab licenses?\n\nDoes democratic design work at all, especially in a field as type design, which requires so many aesthetic and stylistic decisions based on individual taste and reasoning, as well as highly-specialized knowledge?\n\nJens\n\n"
    },
    {
      "time": "",
      "content": "\\>Do you want to comment on that too SII?\n\nThat's probably a question for Greg's team. And as much as this thread is throwing up interesting questions and issues ( like this one, and the moving goalpost problem with revised font EULAs) it's probably off-topic for this thread. Maybe start a new one?\n\n"
    },
    {
      "time": "",
      "content": "James, I do like your idea, it mirrors some suggestions I threw out a while back (in response to this [http://www.designwritingresearch.org/free\\_fonts.html](http://web.archive.org/web/20100116125204/http:/www.designwritingresearch.org/free_fonts.html \"http://www.designwritingresearch.org/free\\_fonts.html\")). My model required that type designers get paid, had an international focus, and required a NickNeg style charismatic front-man to hit up Google, et al for the cash.\n\nWhy type designers need to be paid... In the historically accurate “300” movie King Gerry Leonidas asks various members of the volunteer Greek army what their professions are – “sculptor”, “baker”, “candlestick maker” come the replies. He turns to the Spartans and asks them what their profession is, with one voice “type designer”. There is a role for amateurs, beginners, students, foundry people, etc., in an effort like this, but if you’re building a library of quality typefaces for the world (not just the Web) you need the best of the best, and you need to pay them. I think we proved that to be the case with Verdana, and Georgia? Matthew and Tom are the Spartans of type design. Anyone disagree?\n\nHowever, biggest problem with the plan is that it will do little to address one of the fundamental problems with the web fonts scheme, in that web page designers don’t want new fonts, they want to use the fonts they’re currently using in print – Gotham, Meta Serif, and Franklin ITC.\n\n"
    },
    {
      "time": "",
      "content": "<cite>James, I do like your idea, ...</cite>\n\nI do too. For web work, that is. But there is a drawback -- a typographical (quality) one! People (not \"us people\", \"them people\") will perceive these fonts as _free_ fonts. No matter how stringent the license is (i.e., in full caps, bold, red, \"For Web only\"), people will want to use the fonts in print **because** they can see them on the screen.  \nNo matter how good the screen rendering of Verdana, Arial, Tahoma, and Times New Roman, I already have had a fair number of struggles with \"them people\" to try and convince them these are _screen_ fonts, and we purchased CDs full of real, licensed fonts, just because they look better in print. It's not (purely) anti-Microsoft snobbery.\n\n<cite>[..] web page designers don’t want new fonts, they want to use the fonts they’re currently using in print ..</cite>\n\n.. so you'll bound to get a Fronklin Web family, a Footoora, a Jensoon, etc. After that, follow-ups will ask for _this_ fonts to be used in print -- because those are the fonts the web-designers use ...\n\nEverything on the Web is free. Quality is expensive. And them people will pick the free stuff.\n\n(sigh.)\n\n"
    },
    {
      "time": "",
      "content": "\"Everything on the Web is free. Quality is expensive. And them people will pick the free stuff.\"\n\nYes, Wal-Mart exists for a reason. But are we really targetting the 'people that always pick free' anyways? If that demographic is always going to pick free, it's not like they'd ever be a demographic worth going after anyways.\n\nSo...it seems that it makes more sense to focus on the professional users of professional type, and maybe not worry so much about the scrapbooking grandma.\n\nOr, perhaps still worry about her, but not let it overwhelm the discussion.\n\n"
    },
    {
      "time": "",
      "content": "SII \" I think we proved that to be the case with Verdana, and Georgia? Matthew and Tom are the Spartans of type design. Anyone disagree?\"\n\nThe Spartans? They lasted for 100's of years. And, don't ever forget, even if you didn't know before, the Spartans rose to ascendency by breaking the established rules of Hellenic war, with previously unheard of things like battlefield trickery, and the slaughtering of captives. When practiced in the neighborhood for a hundred years too long, this resulted in the eventual utter destruction of the entire Hellenic race. There are no Spartans, only movies made to help with recruitment.\n\nSII: \"However, biggest problem with the plan is [...] that web page designers don’t want new fonts, they want to use the fonts they’re currently using in print – Gotham, Meta Serif, and Franklin ITC.\"\n\nYes, and no. They want new ones, and they want old ones. Either way, how are we going to get their quality if people like me can't do my job beyond the design of the outline? Hmmmmmm? Clearly, web versions of Gotham, Meta Serif, and Franklin ITC would require some kind of 'expected' reaction to the grid... wouldn't they?\n\nThere is big problem with this that starts and ends at Microsoft Corporation, but what lies between, that's what's interesting now.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "'if you’re building a library of quality typefaces for the world (not just the Web) you need the best of the best, and you need to pay them. I think we proved that to be the case with Verdana, and Georgia? Matthew and Tom are the Spartans of type design. Anyone disagree?'\n\nNot me. Those are standards worth setting.\n\nSo why don't you get that team to set some more?\n\nBy the way, a student claims to have established that he consistently gets Bs for papers set in Times, As for papers set in Georgia. Has anyone told Matthew this?\n\nNo David, I don't want you to give the money back, especially not the money from the days when they were giving you 30K a weight. Do you still have it?\n\nA friend of mine sold over 10,000 copies of a very expensive font family and still didn't manage to buy a house . . . . though his distributor did . . . .\n\n"
    },
    {
      "time": "",
      "content": "_“Shut Up David”_\n\nYou asked for all types of comments. My cynicism about the ability of type designers/indie foundries to influence the course of events is comprehensive. Nothing personal. I'm quite prepared to defend my position, willingly participating in the conversation you initiated.\n\nSD: (a)_...MS and Adobe generally oppose the scheme..._\n\nSD: (b) _...you can’t pick and choose what to support, especially if/when all your competitors, and an increasing number of web sites start to take advantage of it._\n\nSurely, \"generally opposing\" is a disingenuous position, given the dominance of IE.  \nIf Firefox, with 20% browser share, adopts this scheme, Microsoft's general opposition will evaporate, prompted by the specific fear of losing market share.\n\nErgo, it is only a matter of time before this scheme becomes standard, as the font industry (should it wish to oppose it) has no influence over Firefox.\n\n ![](http://web.archive.org/web/20100116125204im_/http:/typophile.com/files/browsers_5974.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\\>Surely, “generally opposing” is a disingenuous position, given the dominance of IE.\n\nI mentioned the general opposition just to set expectations with regard to the make-up of the panel. I don't think you'll find many of the panelists supporting the scheme. However, I'm sure there will be disagreements between us on the alternatives, and on licensing for Web usage.\n\n\\>If Firefox, with 20% browser share, adopts this scheme, Microsoft’s general opposition will evaporate, prompted by the specific fear of losing market share.\n\nThat's probably an accurate assessment. The people here (in the typography and IE groups) who think it’s a bad idea will continue to think it’s a bad idea - but it will be hard to hold back the tide if/when web designers embrace the scheme, especially if they stay within the law by using legitimate free fonts.\n\n"
    },
    {
      "time": "",
      "content": "\\>That’s probably an accurate assessment.\n\nSo does that indicate that IE might become the first (FIRST!) Microsoft app to support OT typography now that Firefox 3 has it?\n\nHow many years ago is it that Greg said we're sorry that MS Office does not support OT typography? (The year I got kicked off the OT list?)\n\nAnd for that hope, 11 years later not realized, Adobe gave up MM . . . . oh well, at least they fired Dan what's his name.\n\n"
    },
    {
      "time": "",
      "content": "Note that Adobe's EULA allows for EOT but not for original fonts on web servers. The next version of our licensing FAQ will address this.\n\nThe notion that everything not addressed in a font license is always permitted is simply mistaken. With many font licenses, the opposite is true.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "<cite>If it zooms, I don’t care, thanks.</cite>\n\nSome of us are older than you Boomers. Take pity. I dunno what \"If it zooms, I don't care\" means. I \\*think\\* the \"If it zooms,\" isn't needed, right?\n\n"
    },
    {
      "time": "",
      "content": "\\>The notion that everything not addressed in a font license is always permitted is simply mistaken. With many font licenses, the opposite is true.\n\nWell, Thomas, could you enumerate the licenses in which the opposite is true? (And what exactly \\_is\\_ the opposite, anyhow?)\n\nAnd are you hinting that one cannot pdf a font whose license predates anti-pdf fever? I would just love to see ITC, Monotype, Bitstream, Microsoft, or anyone else sue me for pdfing a ten-year-old font. I bet even Mrs Harvey Whatnot couldn't colorably do that.\n\nAnd wasn't anti-pdf fever invented by Monotype as a way to get out of its Adobe commitments - - or something like that? Whatever - - it was very dodgy behavior on Monotype's part. Let's also remember just once more how unusable many of the Monotype Classic digitizations are, and how much work Adobe put into them . . . . .\n\nFont companies, even Adobe - - are not very good at contracts. That's why Adobe doesn't have Berthold fonts anymore - - in spite of having thought it bought them til the end of time -- as was no doubt Berthold's intention. Someone at Berthold must have known about Wagner's practice of selling his 'original' scores many times over . . . . sheesh!\n\n"
    },
    {
      "time": "",
      "content": "to clarify my statement: The opposite would be that any rights not explicitly granted to the licensee are reserved for the copyright holder.\n\nBeyond that: as a general policy, I don't respond to Bill Troop's comments, even if they contain misleading insinuations or outright falsehoods. To do so would dignify them with more attention than they're worth.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "So, Thomas, temper aside, it looks like you're taking the position that\n\n\\_unless a font explicitly contains permission to print to pdf, it is not legal to embed that font into a pdf\\_\n\nIf that were true, how could publishing exist?\n\nAll that boils down to is asserting a right to sue almost everyone who has ever bought a font. Can this be where Adobe's thinking is going? It doesn't make sense. Maybe you meant to say ... the 'opposite'?\n\n"
    },
    {
      "time": "",
      "content": "Nick: \"My cynicism about the ability of type designers/indie foundries to influence the course of events is comprehensive. Nothing personal. I’m quite prepared to defend my position\"  \nI doubt you know what position you are in, unless possible you've stumbled into a joint session of a congress of the cows. If you think that the developers in question have made it this far without massive influence from type designers/indie foundries etc. bend further. You think there are books on these topics? You think the wiki covered any of this in time to be useful? Do you think 'they' talk exclusively to other OS or App developers?\n\n\"..the font industry [...] has no influence over Firefox.\"  \nI think the DMCA has a big enough influence. There will of course need to be an expensive test case. I am prepared to scratch bite, and maybe even sue until there is a place for quality personalized text type in all this marvelous moveable type technology.\n\nBill: \"All that boils down to is asserting a right to sue almost everyone who has ever bought a font.\"  \nAhhhh, now we're getting somewhere. The FBI EULA Phanto-Clause would grant the user the license, delivery and appearance of the phont name in menus for their phee, and all other uses will be subject to additional phees. All neatly packaged where no one will read it.\n\nJames A: \"A lot of people said Wikipedia would or could never work, but five years+ down the track it’s the standard general reference on the web and still going strong.\"  \nWikipedia is a huge pile of unreliable junk that must absolutely be cross-checked for every single detail in order to put money on the line based on what you find there. So, you'd have to define \"work\" in a narrow, 'the actual facts are not really that important' sort of use, like grade school homework, but yeah, it's the standard there.\n\nI like some of the rest of your ideas, a lot.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "My first post was all I could come up with in two hours. I anticipated most of your criticisms and have taken the idea further on.\n\nHow an FMF might be made viable:\n\n\\* make it a **private** wiki, **for profit**  \n\\* professional type designers and font makers only, no amateurs please  \n\\* this is not a job for Joe Public. The general public will not be building fonts, nor will they be comenting on their creation.  \n\\* forget about the mess that is Wikipedia, the wiki thing only applies here in two parts: 1) user community and media interface (using wikimedia software) for getting the collaborative font design and building work done. 2) a \"wiki-like\" philosophy of open collaboration between professionals who all know precisely what they (we) are doing.  \n\\* would not be subject to the chaos caused by Wikipedia's policy of complete freedom of anyone to edit anything, or the problems inherent in getting anonymous contributors to write a general reference encyclopedia.  \n\\* needs seed funding from the big guns in the type business & the design industry to get it going, but after that, users pay for font usage on the web on a subscription-based licensing model.  \n\\* contributors all get paid for their work, but the amount of work you contribute is on a volunteer basis. We, the guys and gals who make fonts commercially, contribute as much or as little time as each of us can spare.  \n\\* the fonts in the media foundation will not be free, nor will they be distributable. Only user agents (browsers) will be able to access the font data and media.  \n\\* stop thinking of it as freeware.\n\nOther points of contention:  \n\\* the advantage of FMF to Apple, Microsoft, Adobe et al, is that existing commercial, retail and proprietary font licensing models do not need to change at all.  \n\\* Apple is first to introduce a browser supporting @font-face, yet they remain opposed to licensing their fonts for web use. As Yves Peters once said, Choose a position and stick to it, guys. Introducing a supporting user agent is, in my view, a persuasive reason why Apple should stick to their guns with their font licensing, but give me some computers and cash to get FMF going.  \n\\* if Microsoft introduce a supporting version of Internet Explorer, they could back it up with similar resources.  \n\\* if W3C want to introduce the CSS @font-face rule they should help pay to set it up, or at least contribute staff and resources to help set it up and keep it going.\n\nI'm really trying to look forward with this. **Design a way forward** tackles the most solid object here: the font industry's existing font licensing models are inappropriate, outdated and outmoded. They don't have to change, but the people involved could contribute some time and skill to creating the alternative---a library of fonts that do what web designers and CSS need them to do.\n\nIt's either that, or them peoples will be using them free fonties like there isn't no tomorrow.\n\nNow can I has a cookie?\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "tracking\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Seems like this is getting way more complicated than it needs to be.\n\n\"Wikipedia is a huge pile of unreliable junk\"\n\nGoing off topic now, but studies have shown that statement to not be true.\n\n"
    },
    {
      "time": "",
      "content": "<cite>professional type designers and font makers only, no amateurs please</cite>\n\nThe open-standards web design crowd would crucify the project as elitist and the fonts would get blacklisted in a heartbeat.\n\n<cite>Only user agents (browsers) will be able to access the font data and media.</cite>\n\nTechnically impossible. Any designer can install wget on his mac and spoof browser agents from the command line. Put in the most insane DRM system you can dream of and it’s still going to get cracked.\n\n<cite>stop thinking of it as freeware</cite>\n\nHow are you going to get designers to do that? From what I can tell most of them already treat commercial fonts as freeware and they tend to get testy about people suggesting that they pay for fonts.\n\n<cite>Apple is first to introduce a browser supporting @font-face, yet they remain opposed to licensing their fonts for web use.</cite>\n\nAre the people Apple licensed the fonts from willing to license for web use?\n\n<cite>if W3C want to introduce the CSS @font-face rule they should help pay to set it up, or at least contribute staff and resources to help set it up and keep it going.</cite>\n\nFont design and distribution is not something the W3C should engage in. The W3C did what they should—provide a simple solution. If font designers want something more complicated, that’s up to them.\n\nJames, I just don’t see your system working. If IE and Firefox support @font-face foundries will have to either start licensing for the web at reasonable prices or start suing their customers. And the financial shape of the record industry suggests that suing customers is probably a bad way to go.\n\n"
    },
    {
      "time": "",
      "content": "\\>Going off topic now, but studies have shown that statement to not be true.\n\nResearch indicates that 78.6% of all study results are fabricated.\n\n"
    },
    {
      "time": "",
      "content": "\\>The open-standards web design crowd would crucify the project as elitist and the fonts would get blacklisted in a heartbeat.\n\nI'd disagree with this - they see the professionally produced Open Source fonts (Vera, Droid, Liberation, Gentium) as being superior to the amateur efforts, and they see the amateur extensions to these fonts as being less than useful. Providing there are no restrictions on amateur development, they wont have a problem with quality gates being set on the official, blessed, versions of the fonts.\n\n"
    },
    {
      "time": "",
      "content": "DB: _I doubt you know what position you are in, unless possible you’ve stumbled into a joint session of a congress of the cows._\n\nMaybe if I get me some of them real big capital letters, DAVID, and stand on top, I'd get a better perspective?  \nYou could probably sway me to your point of view, if I could decipher what it is.  \nMoo.\n\n"
    },
    {
      "time": "",
      "content": "Microsoft and Yahoo are about to become one. This will change the industry, but how? Stop being angry and start be pragmatic you can't stop the corporate giants, just adapt.\n\n"
    },
    {
      "time": "",
      "content": "I keep on going to the beginning of this thread to try and figure out what it's really about, and I haven't, but\n\n'The most serious problem being that only freeware fonts can be used, with the fonts web designers want to use [] completely off-limits, leading to fears that commercial fonts will be misused...'\n\n'Designers' are always going to want to use what is newest and coolest, and what the designer of what is new and cool has the most interest in defending . . . .\n\nI am a little disturbed at stage 2 of the way MS is handling such fonts as Georgia and Verdana. At first they were freely available to everyone and Mac versions in particular were free. Then this dried up around the time, seemingly, that MS began to hope that Vista would be so great that it would wipe Macs off the planet. (Even Roger Black seems to have believed this -- for a few seconds at least -- and convinced me as well for a few seconds -- long before anyone had actually seen the final of course.) Now, a few years later, that we know that Vista is surprisingly clumsy, and that Apple has nothing to fear, maybe MS could lead the way in committing to some really high quality classics to be available, free, in every format? MS has everything to gain from a limited philanthropic move of this kind. Isn't 'establishing standards' what that company has always, principally, been about? Isn't that what makes it tick?\n\n"
    },
    {
      "time": "",
      "content": "I agree with Sii. Again, all this discussion seems to be trying to come up with a very complicated technology solution for something that really isn't a technology problem.\n\nBut, yea...I'm not even sure what the discussion is about anymore...\n\n"
    },
    {
      "time": "",
      "content": "Yep, it's all gone a bit sideways/foggy.\n\nWith respect to Georgia and Verdana, they were taken off of Microsoft.com in August 2002, less than a year after Windows XP shipped (quite a bit ahead of Vista). At that time they'd been shipping with Mac OS for around four years (since 1997 I believe). The c. 1997 versions of the fonts are still available on Source Forge, and continue to be exploited by users of other platforms, Symbian, Linux, etc.,\n\n"
    },
    {
      "time": "",
      "content": "Si, thanks very much for these dates. Yes, that's quite a bit ahead of Vista. I realize that it's impossible ever to know these things, but has anybody any idea why MS decided to make the newer versions of Georgia and Verdana platform-specific? Was it something so simple as that the newer versions were being optimized for ClearType and thus would be somewhat (not entirely!) wasted on other platforms? In any case I am truly delighted to hear that MS has made the 1997 versions available on Source Forge. That is really great!\n\nAnd see? They're practically the only fonts since Times and Helvetica which have become absolute standards for the foreseeable future. The combination of ineffably excellent workmanship and unparalleled marketing muscle have won out. Whatever anybody talks about doing now, I think it will be a while before we see anything like this happen again. Type really is intangible, and the achievement of setting a new standard for hundreds of millions of users is a kind of miracle that can't be repeated for the wishing of it.\n\n"
    },
    {
      "time": "",
      "content": "I don't want to spoil my TypeCon and ATypI talks on the subject, however the newer versions of the fonts were licensed directly to Apple. Leopard ships them.\n\n"
    },
    {
      "time": "",
      "content": "Hey Nick...\n\n\"Maybe if I get me some of them real big capital letters... moo\"\n\nIt should be \"sum u dem reel biiig kapitul leturs\"\n\nSubtle but effective slam to us redneck type designers down south!\n\nMichael :)\n\n"
    },
    {
      "time": "",
      "content": "\\>Subtle but effective slam to us redneck type designers down south!\n\nSomeone has to design bold italic numerals for NASCAR right? ;-)\n\n"
    },
    {
      "time": "",
      "content": "Sory, us ideuts caint spel. it shuld hav ben aetes.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Absolutely! The ates are reeely hard tho.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "I apologize, I know this is a serious subject, just could not resist an aside and was stunned by Nick's attempt, or lack of, at humor.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "\"But, yea...I’m not even sure what the discussion is about anymore..\"\n\nOver on the right side of your browser's window, there is a scroll bar, which has a handle indicating where on the page you are.  \nIf you drag the handle up, the page appears to scroll down, and at the top, there is an entry, the beginning of this topic.\n\n“No one can argue that improvements around fonts for the web aren’t long overdue, but the current scheme has various drawbacks. The most serious problem being that only freeware fonts can be used, with the fonts web designers want to use [] completely off-limits, leading to fears that commercial fonts will be misused...”\n\n...was read, and I determined at the time that it was worth asking if anyone actually was interested in discussin' the problem, or whether this text is just a come-on to attract attendees, which I think we decided it was.\n\nAlso, I said, \"hopefully you saw MS’s Mr. Hill’s presentation of last year?\" because it was about readable screen fonts being a technical problem with exclusively technical solutions, and not design problems with design solutions. Then you said: \"all this discussion seems to be trying to come up with a very complicated technology solution for something that really isn’t a technology problem\", which made me laugh.\n\nThen, the opportunity to describe how a southern typophile might make an \"8\" for NASCAR, which involves either tracing carefully nibbled donuts, or biting holes in fried dough... and, ah, that's where we are.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "\"Then, the opportunity to describe how a southern typophile might make an “8” for NASCAR, which involves either tracing carefully nibbled donuts, or biting holes in fried dough... and, ah, that’s where we are.\"\n\nDuh, was that meant to be snide David? I do not see you balking at taking 50% of this Southern ass's royalties every quarter. Check your roster of designers.\n\nIt was an aside as I said. Get a \\*\\*\\*\\*\\*\\*\\*\\* sense of humor and be able to identify elitism (which was my point, and you further dug the hole) when you see it.\n\nWe just got croissants and bagels down here last year! Nice respite from those damn doughnuts.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "_slam to us redneck type designers down south!_\n\nLooks like my dart at Mr B's occasionally plebian turn of phrase went astray. He more Lardner (a northener) than Twain.\n\n"
    },
    {
      "time": "",
      "content": "Sorry Nick, it was no big deal until David turned ethnocentric.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "\\>Also, I said, “hopefully you saw MS’s Mr. Hill’s presentation of last year?” because it was about readable screen fonts being a technical problem with exclusively technical solutions, and not design problems with design solutions. Then you said: “all this discussion seems to be trying to come up with a very complicated technology solution for something that really isn’t a technology problem”, which made me laugh.\\<\n\nI aver that the solution can only come about through the joint efforts of design and technique. (Who reads 'Computer Modern'?) And though my respect for Bill Hill could not be greater, I can't help remembering the kerfuffle that arose when he patented sub-pixel positioning for Microsoft only to discover that the fundamental technology had already been disclosed by Wozniak at Apple about two decades before.\n\nOne could get the impression from many of Berlow's postings that he has some real communication problems. But go over to his blogs at rogerblack.com, and a careful examination will show that his mastery of every aspect of screen font rendering is unparalleled. As well, his ability to explain something, when you can finally get him to be serious, is exceptional. I learned a lot from spending a few minutes with these articles.\n\nI will be spending some more time over there, trying to understand fully what is going on, but as I understand it now, Berlow's solution for better screen fonts is narrowly graded, size-specific scalable types. Perhaps not surprisingly, this is analogous to what Sumner Stone has found to be the only real solution for fine printing: narrowly-graded, size-specific, scalable, types. Surprise, ta-da. Just what we (I mean some of us) always suspected -- those of us, that is, who \\_don't\\_ think it is easy to make size-specific outlines.\n\nIt's a lot of work; it can't be done mechanically; it needs a vast understanding of the typographic language. After a comparatively short time floundering in type -- 15 years -- I can only identify three people who have, albeit overlappingly, an understanding of the joint technical and aesthetic problems we still need to solve: Carter, Stone, and Berlow. Apple, MS and the browser people can do what they want, and will, but without those three, preferably harnessed together, Apple, Microsoft and their collaborators, despite their justly lauded technical might, will never attain the goals they seek.\n\nIs it unfair to name names? Well, posers have to be put in their place every so often.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100116125204im_/http:/typophile.com/files/46896_3698.10.2.3.png)\n\n"
    },
    {
      "time": "",
      "content": "David, I think you're raising some valid points, and re-reading your posts, I think I missed the angle you were getting at.\n\nWould it be safe to say that you see the delivery mechanism - whether that be the web fonts scheme, EOT, or something else is the least of our web troubles - because browsers and operating systems employ rendering strategies which are a. all different, b. all over the map, c. mostly undocumented, and d. changing?\n\nI agree these are very valid concerns - one font may look super in Firefox but crappy in IE, work at 10pt in IE, but become illegible at 10pt in Safari.\n\nI think this a valid issue for someone to raise during the panel (Roger maybe?) but getting browser makers and operating system makers to standardize on rendering seems unlikely.\n\n"
    },
    {
      "time": "",
      "content": "Si, if I'm not completely mistaken, the fonts David is describing in the blog could be described as self-optimizing. But -- again if I'm not mistaken -- each browser would have to have some appropriate intelligence built in.\n\n"
    },
    {
      "time": "",
      "content": "I may be way off on this, but shouldn't the font rendering be handled by the OS more so than the browser? I know Safari on Windows doesn't work that way, and maybe the others don't as well.\n\nIt sounds like we're not really talking about 'web fonts' at this point but 'screen fonts', which then brings into play all of the variables one needs to watch out for:  \n - screen hardware  \n - screen hardware settings  \n - OS that is running the browser  \n - the browser itself  \n - the various font rendering engines involved with the above  \n - all the various user settings/preferences\n\n"
    },
    {
      "time": "",
      "content": "Yep its a bigger can of worms, and one of the reasons why why Web designers like platforms like Flash - although that is also a moving target.\n\n"
    },
    {
      "time": "",
      "content": "\"why Web designers like platforms like Flash\"\n\nYea, that's a can of works too. I think web designers, who treat the web more as a content delivery platform, aren't that picky. Print designers, who really really really want that brand extension of their print campaign with that specific typeface, yea, they like Flash for that particular reason.\n\n"
    },
    {
      "time": "",
      "content": "\\>which then brings into play all of the variables one needs to watch out for\n\nIt all depends on how much you care about those variables. Adobe did -- hence, in part, CoolType, an absolutely private screen rendering system now built into nearly all of its major apps. (i.e., figure out how to make ATM work on an app rather than a system basis, then figure out how to make it better than the versions you had to beg MS and Apple to include in their OS since customers never bought enough of it to make it worthwhile - - - and there's the rub. Customers never would pay for ATM and we wouldn't have it unless Adobe -- bless 'em! -- believed in it so much. Everyone who's building computer display systems (I mean that in the largest sense) knows what Adobe learnt: customers are really stingy. Sometimes you have to give away the best things if you care enough about the issues. And don't expect any thanks!)\n\nBut the variables all boil down to one thing: having the right font at the right grid for your system running your app in your view. This seems to be what Berlow is addressing practically.\n\n"
    },
    {
      "time": "",
      "content": "David, it appears that you started this thread as a trojan horse to push your screen rendering agenda.\n\nSo what you're saying is that the \"reality\" of having more fonts available for web sites won't address the fundamental problem?\n\nI somewhat agree, and will sign your petition (if written in plain English), much good may it do. Good luck with the scratching, biting and suing.\n\nHowever, I suspect that the messy business of getting more fonts into play online, because we like them in print and big, irrespective of how well they render immersively on screen, would be a massive juicing of the typosphere and therefore a good situation for type business, whatever the legalities.\n\nMuch as I respect the technologically-driven MS designs (especially Verdana/Georgia and ClearType), they are a dull diet and don't give typographers anywhere near enough variety to work with.\n\nI also wonder if too much importance isn't being given to the niceties of screen rendering, because:\n\n1. Typophiles idealize the less-than-perfect effect of old letterpress printing (i.e. the concept of a good type design as one that can take a lot of abuse)  \n2. Users can optimize screen type size to their liking--isn't that the Big Idea?!  \n3. Screens are getting finer all the time.\n\n"
    },
    {
      "time": "",
      "content": "So where does the money for all of the font optimizing come from? How many designers will be willing to start paying a lot more for fonts, or to start buying print and web versions? And who’s going to do all of the optimizing?\n\n"
    },
    {
      "time": "",
      "content": "No matter how much a web designer may dwell on the intricacies of all the type setting variables on a particular site, it's all for naught much of the time as the end-user has complete control and ability to over-ride any of the design suggestions the designer may make.\n\nSo...I can't see having very specific web-optimized fonts to be a major priority for most web designers. Just having a few more type face options is probably the key priority.\n\nNot that we shouldn't push for better on-screen rendering, but by the time something might come of that, if we're lucky, improvements in hardware will make it somewhat moot.\n\n"
    },
    {
      "time": "",
      "content": "Nick says, '... started thread ... trojan horse ... push agenda...'\n\nand he should know.\n\nAs to his points:\n\n\\>1. Typophiles idealize the less-than-perfect effect of old letterpress printing (i.e. the concept of a good type design as one that can take a lot of abuse)\\<\n\nThat isn't why we idealize letterpress printing. We idealize it because each size can be perfectly optimized, which on a parallel level is what David is talking about. One of these days, Nick, you'll read an old book, and you'll get it.\n\n\\>2. Users can optimize screen type size to their liking—isn’t that the Big Idea?!\\<\n\nNo. The idea is that simple scaling -- size -- doesn't work -- for a hundred and one reasons. We've known this since the invention of the pantograph, but every now and then we need to be reminded. The problems are far worse than they were because of the limited resolution of smaller and smaller screen devices and the very slow progress to higher res (see below)\n\n\\>3. Screens are getting finer all the time.\\<\n\nWhere? Eight years ago, in 2000, Dell offered an inexpensive, pathbreaking 1600x1200 display on a 15\" laptop -- that's 133 dpi. Two years later, Dell offered 1920x1200 -- 150 dpi -- on a 15\" machine. At present, Dell mainly offers 1920x1200 on a 17\" model, so we're back to 133 dpi.\n\nIn other words, it's been six years since, quite cheaply (BTO addition of $100-200), we could get 150 dpi, and now we're offered less, rather than more.\n\nNot to mention that it is \\_only\\_ this year that Apple finally offered a 133 dpi screen - - at last - - as a special BTO option on its 17\" laptop.\n\nNot to mention that David (and others) had been using 120 dpi CRTs since back - - when? the late 80s? Basically 20 years ago? I know I had them in 1992. Sigmas? And 150 dpi was available by the mid-90s.\n\nSo the sad truth is that in 20 years, we have not (except for some very high end equipment used in medical and other applications) been able to get much further than the 120 dpi we could achieve back then.\n\nThis is not, Nick, a case of screens 'getting finer all the time.'\n\nI don't know why the progress is so slow, but it is.\n\nBy the way, the 600 dpi LCD that Xerox touted quite some time ago was, it appeared on further inspection . . . a 150 dpi screen with subpixel anti-aliasing . . . . . . .\n\nIndeed the entire reason that subpixel anti-aliasing has had to be invented (I mean implemented) is that screen resolution has been essentially static for 20 years. Why this should be so, I don't know . . . . . probably mainly because most users don't care. Just like most users don't care about size-optimized type, whether it's in print or on screen. They can recognize that it is superior, but they're not going to make a compelling economic case for it.\n\n"
    },
    {
      "time": "",
      "content": "\\>So where does the money for all of the font optimizing come from?\n\nMy conclusion is that it must now come from love. Font optimization reached its apotheosis in the pre-WW2 period because of the unique economics of the competition between Linotype and Monotype. It was the \\_only\\_ thing they could do to make viable competitive cases for themselves, and the payoffs were huge. Those conditions no longer exist.\n\n\\>Not that we shouldn’t push for better on-screen rendering, but by the time something might come of that, if we’re lucky, improvements in hardware will make it somewhat moot.\n\nI'm not so sure about that. The best technology we have today can barely move around pixels at 133 dpi. Suppose we actually had 600 dpi screens tomorrow? The video hardware just isn't up to it, not to mention the rest of the hardware. It could be longer than one might think - - a couple of decades? - - for substantial improvements to be made and purveyed cheaply.\n\nWe need solutions that recognize the hardware where it is. Dave Ericsson, whose DOS-based XyWrite, still in use, was and is legendary for speed, always tested the program exclusively on hardware several years out of date. Can you see Microsoft forcing its Office and Vista teams to use only five-year-old computers? If they did, we'd have much better software . . . . .\n\n"
    },
    {
      "time": "",
      "content": "\"That isn’t why we idealize letterpress printing.\"\n\nTrue. But it is why much of the general market idealizes (or even idolizes) it.\n\n\"No. The idea is that simple scaling — size — doesn’t work\"\n\nAgain, true for type designers, but probably just fine for most folks.\n\n\"So the sad truth is that in 20 years, we have not...been able to get much further than the 120 dpi we could achieve back then.\"\n\n\\*Sigh\\*. That is true. Nearly everything in computing has improved at an exponential rate (storage sizes, memory sizes, processor speeds, printer quality, color depth, size) EXCEPT for display resolution.\n\nThat said, we're on the cusp of perhaps a long-overdue bump. The iPhone is at 166ppi. The Sony reader is at 170ppi. Still a long ways to go, but finally picking up a bit of momentum. Also keep in mind that screen ppi and print dpi shouldn't be compared via a 1-1 correlation given that type on paper is typically limited to 1 color, while a screen can take advantage of the color spectrum (though that does then get us back to wanting better screen optimized type...)\n\n"
    },
    {
      "time": "",
      "content": "It’s nonsensical to claim that IE has ≈75% market share, so Microsoft has to go along with this business if everyone else does.\n\nFirst, which version of IE? 7 is much better than 6, which is barely even a browser in any rational definition of the term.\n\nWho’s going to want to use Web fonts? A few Flash assholes, maybe, sure, but mostly standardistas of the Jason Santa Maria ilk. The only browsers they use are good ones; maybe they test certain layouts in IE7, but that will be it for pages that use Web fonts. Importantly, the readers of the sites that use Web fonts also will be using at least IE7, IE8, or, much more rationally, Firefox or Safari.\n\nHence, if Web fonts take off for all browsers other than IE\\*, they will have taken off for the vast majority of the developer audience that wants to use them and the reader audience that wants to look at them.\n\nP.S. I always love it when you kids use the phrase “Web standards.” I accept that Si is using it nonironically.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20100116125204/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100116125204im_/http:/typophile.com/files/ResFairy_3926.png)\n\n"
    },
    {
      "time": "",
      "content": "David you may be right but what about this: Regarding new graphics. Most web sites are re-designed every few years. That's how we went from a 800x600 web to a 1024x768 web.\n\nAnd since we are going to have a long tail it is likely that graphics/code for layout(css) will keep becoming more & more flexible. This is already starting to happen a bit. Probably that will continue and greater flex will be built in via flash and css.\n\nAnd the MS & Apple tech that lets you soon in to see something closer & zoom out for context is starting to see more & more play. That will have an impact too - although it's hard for me to say what it is. It will make rez specific designs harder to justify though. Sadly. I like the idea very much as I have said before.\n\nAlso OLEDs have made a lot of advances. And their rez is pretty insanely high. And could go higher. Plus they take less energy to run but that is a side issue except in that they will be attractive for that reason.\n\n200ppi is what OLED makers are starting to shoot for & apparently a lab somewhere has done a sample at 300ppi.\n\nSo is the \"rez fairy\" = 80% of people with 200ppi+ in 10 years? If I am gonna say \"I believe\" then I need to know what I am supposedly believing in.\n\nAnd chip speeds including graphics engine chips do somehow keep getting better.\n\nNone of this means that it will be other than a mess or even that it won't be even more of a mess than it is today.\n\nThe people that have a real clue about this are keeping mum because it's their job to do so until it's time for a marketing blitz.\n\nBut to sum up: What's the standard? Draw that line in the sand past which exists the rez fairy.\n\n"
    },
    {
      "time": "",
      "content": "Berlow always acts like he knows more than us and we’re fools to think what we do. (Actually, that’s his nickname right there: David “Fools!” Berlow.)\n\nI can already resize images in Firefox and Opera; who says the same thing can’t happen system-wide when the Resolution Fairy consensually sprinkles his dust upon us? Mister Sandman, bring me a megapixel.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20100116125204/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100116125204im_/http:/typophile.com/files/cochin_6158.png)\n\n"
    },
    {
      "time": "",
      "content": "Joe Clark, it's pretty bold to make a condescending statement like “I always love it when you kids use the phrase ‘Web standards’” and then take a swipe at Berlow with “Berlow always acts like he knows more than us and we’re fools to think what we do.”\n\nNick, the handful of faces aren't “preferred.” There are only a [handful of faces](http://web.archive.org/web/20100116125204/http:/en.wikipedia.org/wiki/Core_fonts_for_the_Web#The_fonts) “offered” or available for web design using CSS and HTML. Recall the quote from the OP “...the fonts web designers want to use are completely off-limits...” As Joe Clark can explain to you in some detail I'm sure, using Cochin for text means having to employ “text as image” or SIFR or SWF. All of those solutions can have major drawbacks — like taking ten hours to edit text instead of ten minutes.\n\nThe solution is pretty damn simple. But most of the type designers act as if the world will end if Cochin is allowed to be embedded and uploaded to a hosting server.\n\n"
    },
    {
      "time": "",
      "content": "Nick, interesting point, but your comparison is not a fair one. Using the graphic wipes out the hinting, and the strength of Georgia. A better comparison would be the Cochin in the graphic, and then the same words hinted in Georgia, as is the default on Typophile.\n\n"
    },
    {
      "time": "",
      "content": "_the handful of faces aren’t “preferred.”_\n\nThat changed in 1996 with the introduction of version 3.2 of html.  \nThe \"off limits\" refers to licensing restrictions, not technical feasibility.\n\n_Using the graphic wipes out the hinting,_\n\nI posted a screen grab of hinted text (the file was in TextEdit on my Mac).  \nOf course, it would display differently on a PC.\n\n"
    },
    {
      "time": "",
      "content": "_But most of the type designers act as if the world will end if Cochin is allowed to be embedded and uploaded to a hosting server._\n\nWeb sites may be designed to use system fonts.  \nSo, e.g. Cochin may be put at the front of the font specification code list, followed by Constantia.  \nThat way, Mac users get Cochin, and PC users get Constantia.\n\n"
    },
    {
      "time": "",
      "content": "<cite>That way, Mac users get Cochin</cite>\n\nThat way, those Mac users who a) run an OS version that came with Cochin, b) haven’t erased the fonts and c) haven’t deactivated them via a font management app get Cochin.\n\n"
    },
    {
      "time": "",
      "content": "This from Apple's web site re. Cochin (among much other font spam it inflicts upon its customers):\n\nPackage: Essential System Software  \nInstalled: Always (cannot be disabled)  \nInstallation location: /Library/Fonts\n\n"
    },
    {
      "time": "",
      "content": "_I posted a screen grab of hinted text (the file was in TextEdit on my Mac)._\n\nNick, Mac OS X ignores any hints present in the fonts. I actually think the result of this is surprisingly good and I can't stand the hinted Windows ClearType display :)\n\n"
    },
    {
      "time": "",
      "content": "I like the Mac OS rasterization too.\n\nThe Mac OS X ignores most of the hints in a font, but I have detected slight differences, at some sizes, between fonts I've generated with and without hints and values for alignment zones and stem widths.\n\nI have no idea how the Mac OS X rasterization works, but I assume it performs autohinting, therefore it is correct to say that text displayed in OS X is hinted.\n\n"
    },
    {
      "time": "",
      "content": "Nick Shinn, _“and PC users get Constantia.”_\n\nI appreciate where you are going, but once a web designer departs the handful of universal fonts there are caveats galore. Constantia is only on PCs with Vista and/or Office 2007.\n\n"
    },
    {
      "time": "",
      "content": "_...caveats galore._\n\nWhat's wrong with having a web site display with a different text face to different users?  \nNot everyone went to school in Olympia.  \nBesides, there's no brand singularity in the first place if everyone is using Georgia and Verdana.\n\n"
    },
    {
      "time": "",
      "content": "Joe Clark writes,\n\n\\>Berlow always acts like he knows more than us and we’re fools to think what we do. (Actually, that’s his nickname right there: David “Fools!” Berlow.)\\<\n\nHe doesn't know it, but he's echoing something one of the late great men of type, the much-loved Robert Norton (who among other things in a long, important life in type brought Matthew Carter to Microsoft if memory serves) wrote about David Berlow more than 15 years ago:\n\n\"We first learned to love Berlow when he was at Bitstream, when we could rely on him for ironic comments on whatever show or seminar we happened to be at. It became harder to love him as his career progressed and Font Bureau was started and shouldered its way into what is known as the 'leading ledge' of font technology and it became clear that he was getting to know more than the rest of us. Perhaps the reason we are still delighted to eat with him is that he hasn't yet got round to rubbing our noses in it.\"\n\nJoe, nothing has changed. Berlow still knows more than the rest of us - - and he still doesn't rub our noses in it - - even when they're a bit snotty.\n\nNick, reading your post, it seems your insight is that Cochin is more readable than Georgia. Am I misreading something?\n\nGosh! At this rate, maybe someday someone somewhere will call me polite.\n\nAgain, for those actually interested in learning something new . . . . [www.rogerblack.com](http://web.archive.org/web/20100116125204/http:/www.rogerblack.com/ \"www.rogerblack.com\") has got some cool stuff.\n\n"
    },
    {
      "time": "",
      "content": "For anyone interested in finding out more about Robert Norton, John Berry's article is a starting point . . . .\n\n[http://www.creativepro.com/article/dot-font-the-mischievous-mind-behind-...](http://web.archive.org/web/20100116125204/http:/www.creativepro.com/article/dot-font-the-mischievous-mind-behind-microsoft-s-truetype-fonts \"http://www.creativepro.com/article/dot-font-the-mischievous-mind-behind-microsoft-s-truetype-fonts\")\n\nThe first paragraph reads,\n\n'For a few short years in the early 1990s, Robert Norton had a decisive influence on something the great majority of us use and take for granted: the typefaces that accompanied a whole slew of Microsoft software products, including Microsoft Windows and software available for the Mac. Norton was \"the cornerstone of Microsoft's type group,\" as Nicolas Barker put it in his obituary in the \"Independent.\" He was largely responsible for the selection and creation of typefaces for Windows and all other Microsoft software, including Word and Office.'\n\nNorton did a lot of big things. One of them was saving Monotype from disappearing; without him, one can now see, there would be no Monotype, no Agfa, no Linotype. And so much else. And yet could take time out to critique something as unimportant as my early work which, by the way, Joe Clarke 'disapproved' of.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Besides, there’s no brand singularity in the first place if everyone is using Georgia and Verdana.</cite>\n\nTell that to all the corporate identity designers charging clients to select Georgia or Verdana as a “tertiary” font.\n\n"
    },
    {
      "time": "",
      "content": "_it seems your insight is that Cochin is more readable than Georgia. Am I misreading something?_\n\nI don't believe typefaces have inherent readability.  \nNothing happens till a face is set in a particular layout and read by a particular person in a particular environment.  \nFor this thread, following David's lead, I set Cochin small in TextEdit, compared it with Georgia, and rather liked the effect of its small x-height.  \nPerhaps it is like an amber ale, great in small amounts--but then, the Web is all about a tipple here, a tipple there.  \nWhy drown in the same old fonts all the time?\n\n"
    }
  ]
}
