{
  "id": "46920",
  "title": "1943 geometrical typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everyone,\n\nI came across this photo took in Paris during the occupation, in 1943. I am very interested in the banners, and I am wondering if anyone has some insights about the types used there, especially the \"organisation\" on the right... I just can't put a name on this one, I actually don't even know if this is a typeface. Looks a bit like Eagle or Neutra, but some stuff won't fit (like the G)... any help?\n\ndr\n\n",
  "author": "David Rault",
  "time": "30 Jun 2008 — 1:56am",
  "uid": "19074",
  "comments": [
    {
      "time": "30 Jun 2008 — 1:57am",
      "content": "the photo:\n\n ![](http://web.archive.org/web/20131022104528im_/http:/typophile.com/files/1854bba5005dffe9b8db28e77bf2c6a6_4890.jpg)\n\n"
    },
    {
      "time": "30 Jun 2008 — 2:35am",
      "content": "This is most likely [lettering](http://web.archive.org/web/20131022104528/http:/typophile.com/wiki/lettering), not typography. It is sign painting by hand and not based on any single typeface. That said, [Neutraface](http://web.archive.org/web/20131022104528/http:/www.fontshop.com/fonts/downloads/house_industries/neutraface_no_2_collection/), which is quite similar as you observed, does indeed have this sort of G. See the [alternates](http://web.archive.org/web/20131022104528/http:/www.fontshop.com/fonts/singles/house_industries/neutra_2_display_titling/?sample_text=See%20alternates%20below.&sample_size=24&acs_ss=2).\n\n"
    },
    {
      "time": "30 Jun 2008 — 3:00am",
      "content": "Thanks Stephen,\n\nI was quite sure that was lettering, but I thought this was still influenced by a typeface. Thanks for the heads-up on Neutraface, it really is close - but I'm still looking for this large S. Anyone knows about the other typeface?\n\ndr\n\n"
    },
    {
      "time": "30 Jun 2008 — 6:04am",
      "content": "<cite> &gt; but I thought this was still influenced by a typeface.</cite>\n\nIt is entirely likely that, on the contrary, there were typefaces from the period influenced by the popular sign-painter styles. I believe that is the more common directionality for influence before the latter quarter of the 20th century.\n\n"
    },
    {
      "time": "30 Jun 2008 — 6:13am",
      "content": "Do you have a higher resolution version of this?\n\n"
    },
    {
      "time": "30 Jun 2008 — 6:56am",
      "content": "As evil as those Nazis were, they sure understood graphic design.\n\n"
    },
    {
      "time": "30 Jun 2008 — 7:36am",
      "content": "\"ORGANISATION\"  \nMostra from M. Simmonson shares some of those letterforms, but not the S, which looks off to me. Should be narrower etc. … more Antiqua-like.\n\n"
    },
    {
      "time": "30 Jun 2008 — 10:07am",
      "content": "the s in eurostile is similar.\n\nand this s too.. [http://www.dafont.com/sanserifing.font](http://web.archive.org/web/20131022104528/http:/www.dafont.com/sanserifing.font \"http://www.dafont.com/sanserifing.font\")\n\nif the first sign's 's' is what you are talking about that is...\n\n"
    },
    {
      "time": "30 Jun 2008 — 11:01am",
      "content": "Squarosity was long established by then, whether in Germany (Futura Display), the US (Bankers Gothic), or lettering.  \nIn this example, the greater curvature of the horizontal strokes (in S and C) is unusual, and very nice.\n\n"
    },
    {
      "time": "30 Jun 2008 — 11:08am",
      "content": "Thanks for this one. It’s going into my folder ideas for a font based on similar old letters on a wall at the gym I work out in.\n\n"
    },
    {
      "time": "1 Jul 2008 — 12:09am",
      "content": "Well yes, it is actually a good idea for a typeface, as long as we are 100% sure it is not already available somewhere - but so far, nothing. I unfortunately don't have this at a higher resolution.\n\nI already have quite a nice amount of high res and lower res pictures of bits or full alphabets which have never been adapted digitally, I think I will make a website out of them - or a book. let me know if this idea is interesting and if you have some documents to share (i may as well open a new thread).\n\ndr\n\n"
    },
    {
      "time": "1 Jul 2008 — 1:27pm",
      "content": "I also have a really great collection of bits and full alphabets as well. I'm not sure if some of them have been adapted, but I'm pretty sure there's bound to be some that aren't.\n\nIf you post a new thread or have a place to share them, I would like to share mine as well. That would be a great idea for a website.. a place to share strictly non-digital fonts. My mouth is watering at the idea...\n\n"
    },
    {
      "time": "1 Jul 2008 — 3:51pm",
      "content": "Samantha: OK then, I will make a website. I will try to make it and open it at the beginning of september. Please send me an email at davidrault(a)gmail.com and let me know more about your lost alphabets...\n\ndr\n\n"
    }
  ]
}
