{
  "id": "46929",
  "title": "New Walmart logo?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "No more Antique Olive for Wally World? The [WSJ](http://web.archive.org/web/20140713225440/http:/online.wsj.com/article/SB121462040134113143.html?mod=googlenews_wsj) reports Wal-Mart may be changing its tired logo (and dropping the hyphen) but I don't think the new one is anything to get excited about.\n\n ![](http://web.archive.org/web/20140713225440im_/http:/typophile.com/files/wm_4142.jpg)\n\n",
  "author": "londontype",
  "time": "30 Jun 2008 — 9:48am",
  "uid": "11256",
  "comments": [
    {
      "time": "30 Jun 2008 — 10:08am",
      "content": "From the horse's mouth:\n\n[http://walmartstores.com/FactsNews/NewsRoom/8411.aspx](http://web.archive.org/web/20140713225440/http:/walmartstores.com/FactsNews/NewsRoom/8411.aspx \"http://walmartstores.com/FactsNews/NewsRoom/8411.aspx\")\n\nAnd the timeline of logos:  \n [http://walmartstores.com/AboutUs/8412.aspx](http://web.archive.org/web/20140713225440/http:/walmartstores.com/AboutUs/8412.aspx \"http://walmartstores.com/AboutUs/8412.aspx\")\n\n"
    },
    {
      "time": "30 Jun 2008 — 10:32am",
      "content": "The letters are better, but the design feels pharmaceutical and doesn’t fit Walmart’s low-cost and low-class MO. And what’s going on with the asterisk? It looks like someone just tacked it on with no thought behind it. Overall it just reeks of dishonesty; the company that only sells censored albums and puts apocalyptic bible-study materials near the registers is never going to make itself look mainstream with a logo change.\n\n"
    },
    {
      "time": "30 Jun 2008 — 10:32am",
      "content": "Wow, that asterisk needs to be centered or aligned to something.\n\nAlso, the whole thing (in the blue and yellow) looks like they're a cellphone company.\n\n"
    },
    {
      "time": "30 Jun 2008 — 11:25am",
      "content": "Someone in the WSJ story called the asterisk a sunburst...\n\n"
    },
    {
      "time": "30 Jun 2008 — 11:29am",
      "content": "Why?\n\n"
    },
    {
      "time": "30 Jun 2008 — 12:03pm",
      "content": "Because it's yellow?\n\n ![](http://web.archive.org/web/20140713225440im_/http:/typophile.com/files/wm2_4781.jpg)\n\n"
    },
    {
      "time": "30 Jun 2008 — 12:10pm",
      "content": "Solar Powered Shopping Carts?\n\n"
    },
    {
      "time": "30 Jun 2008 — 12:46pm",
      "content": "Wallpaper\\* — oh, sorry… Wallmart\\*…  \nHow original. But didn’t David Bowie say “It’s hard enough to be clever, you don’t have to be original”?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "30 Jun 2008 — 1:11pm",
      "content": "sorry, londontype...didn't mean for that to refer to your comment.\n\nI was asking 'why' in the big-picture/rhetorical/\"if it ain't broke...\" sense.\n\nI can't comprehend any business argument for Wal-Mart rebranding itself with that small of a shift...or, for that matter, ANY rebranding. They are what they are and they're the biggest retailer on the planet. Why bother with a rebrand?\n\n"
    },
    {
      "time": "30 Jun 2008 — 2:28pm",
      "content": "<cite>Why bother with a rebrand?</cite>\n\nBecause among non-Walmart customers, Walmart is one of the most detested brands around. Walmart’s domestic growth has been stagnating for years because Walmart stores have become persona non grata in many communities, and across America municipalities have been rewriting zoning laws to keep big box retailers like Walmart and Home Depot from setting up shop. Here in DC Walmart announced it was going to open a store in the morning, and within hours the city government was plotting ways to keep Walmart out. By the end of the day Walmart canceled plans for a store in DC.\n\nWalmart’s reliance on cheap Chinese goods to keep profits high is starting to hurt the company. Tainted pet foods and toys slathered in lead paint have made it much harder to defend that business model. Politicians and pundits blaming China for high gas prices isn’t helping. Neither is manipulating the hours worked by employees classified ”full-time” to avoid providing them with health insurance. Or discriminating against female employees. On the other side of the aisle Walmart is pissing off America’s religious extremists by adding gays to its anti-discrimination policy and making the company greener.\n\nWalmart has a huge image problem that the people running it don’t know how to fix. It’s probably not one that even can be fixed. But they appear to believe that getting their brand out of backwoods of Arkansas is a start.\n\n"
    },
    {
      "time": "30 Jun 2008 — 2:34pm",
      "content": "Walmart's new logo should be a vice putting the squeeze on small business owners and screwing their employees. Sorry, they are just a sore subject with me. :-(\n\nChrisL\n\n"
    },
    {
      "time": "30 Jun 2008 — 2:50pm",
      "content": "Considering the new \"green\" look this logo has, they'll try to push their environmental responsibility and conservation with \"greenovating\" their stores.\n\nWalmart is trying to become the new Target...\n\n"
    },
    {
      "time": "30 Jun 2008 — 3:16pm",
      "content": "<cite>…try to push their environmental responsibility and conservation with “greenovating” their stores.</cite>\n\nWalmart has been pushing hard to go green since 2005-probably because they finally noticed how many millions of dollars McDonalds and Starbucks have saved by slashing waste. Have you noticed that most laundry detergent had its concentration doubled in the last few years? That was Walmart getting trucks off the road. The problem is that Walmart spent years courting the ignorant redneck crowd as a customer base, and taking steps to making the company green pisses off the anti-science crowd who want us to all know about how controversial global warming and evolution are. I can’t say I have much sympathy, that’s what Walmart gets for doing business in America’s cultural gutter.\n\n"
    },
    {
      "time": "30 Jun 2008 — 7:40pm",
      "content": "That's quite the half-assed [Myriad](http://web.archive.org/web/20140713225440/http:/www.fontshop.com/fonts/singles/creative_alliance/myriad_pro_bold/?sample_text=Walmart&sample_size=96) modification. (Sorry, I can't stop IDing.)\n\n"
    },
    {
      "time": "30 Jun 2008 — 8:04pm",
      "content": "Nice catch!\n\n"
    },
    {
      "time": "30 Jun 2008 — 10:37pm",
      "content": "It seems to fit in perfectly with the \"monopolized\" society concept. The new logo reminds me of something I would see in a movie like I Robot or wall e, where futuristic companies dominate. Did they really need the mark? What is it saying about the brand? I don't see it, but maybe consumers today don't care about that. Perhaps they just want something that looks \"new\" and \"clean\".\n\nWith that said, I think a nice type treatment could have been very successful here. Good topic!\n\n"
    },
    {
      "time": "30 Jun 2008 — 11:13pm",
      "content": "I think it's way too late in the game for \"Walmart\" to be introducing an abstract logo. It will never be a Nike \"Swoosh.\" I severely doubt anyone will ever see that six-segment \"starburst\" and think of that identity. It looks kind of slapped-on.\n\nMust have paid their graphic designers the same they pay the rest of their employees.\n\n"
    },
    {
      "time": "30 Jun 2008 — 11:30pm",
      "content": "It does smack of pharmaceuticals.\n\nOn the subject of big brand branding. Has anyone seen a new/revamped Target store where they've schooched the target up a bit, to hang over the edge of the wall/sign it's on? This drives me crazy! I always want to pull it back down.\n\nAny thoughts?\n\n ![](http://web.archive.org/web/20140713225440im_/http:/typophile.com/files/DSC09512_5100.JPG)\n\n"
    },
    {
      "time": "1 Jul 2008 — 5:30am",
      "content": "<cite>Must have paid their graphic designers the same they pay the rest of their employees.</cite>\n\nOh this was probably in-house... so, yeah.\n\n"
    },
    {
      "time": "1 Jul 2008 — 7:23am",
      "content": "\"Because among non-Walmart customers, Walmart is one of the most detested brands around.\"\n\nAnd a new logo certainly isn't going to change that.\n\n\"Walmart is trying to become the new Target...\"\n\nWhich is probably a bad move given Target hasn't been doing great lately either...and also have been getting a bad image in a lot of its own business moves.\n\n"
    },
    {
      "time": "1 Jul 2008 — 7:34am",
      "content": "I've always thought Target deserved better than Helvetica. Bliss anyone?\n\n"
    },
    {
      "time": "1 Jul 2008 — 8:52am",
      "content": "_Walmart’s new logo should be a vice putting the squeeze on small business owners and screwing their employees. Sorry, they are just a sore subject with me._\n\nWell said, Chris.\n\nIf anybody is interested, PBS's Frontline did a great show about Wal-Mart a couple of years ago:\n\n[http://www.pbs.org/wgbh/pages/frontline/shows/walmart/](http://web.archive.org/web/20140713225440/http:/www.pbs.org/wgbh/pages/frontline/shows/walmart/ \"http://www.pbs.org/wgbh/pages/frontline/shows/walmart/\")\n\n"
    },
    {
      "time": "1 Jul 2008 — 3:19pm",
      "content": "I doubt that walmart will have much success reaching out to the utne reading, Prius driving segment of the population, but being a primium brand has never been their strategy. The logo is clearly a shout out to the rise of environmental consciousness in popular culture (see the rebrands of ge, philip morris/altria, and BP), and for wal-marts base of price oriented shoppers, a bit of gloss will go a long way in making them fell better about themselves for supporting a retailer whose treatment of their workers and the environment leaves little to celebrate.\n\nMy guess is that the new logo has less to do with a full greenwashing of the brand, but a signal of a more general physical downsizing. Up until now walmart has sold itself as the agricultural wholesaler for the suburban lifestyle, placing giant stores in recently developed rural areas. As energy prices rise and the middle class moves back to more densly populated areas, walmart needs to find a way to fit in to a more urban landscape. This logo signals that shift.\n\nI assume their plan is to put a greater focus on going after rite-aid and walgreens traditional turf of purchasing cheap properties in depressed and aging mid-century suburbs and putting in a big cube of retail/pharmacy. So when people say the logo looks pharmaceutical, they are probably dead on. In short, if you imagine the piece on the side of a Walmart, it definitely smacks of corporate doublespeak, but if you place the same on the side of a Walgreens, it looks a better fit.\n\n"
    },
    {
      "time": "1 Jul 2008 — 3:27pm",
      "content": "_a full greenwashing of the brand_\n\nBrilliant term. :-)\n\n"
    },
    {
      "time": "1 Jul 2008 — 4:40pm",
      "content": "With all the money that Wal-Mart has they couldn't hire a great, or at least decent graphic design firm? The new logo is horrible.\n\nJon.\n\n"
    },
    {
      "time": "1 Jul 2008 — 4:58pm",
      "content": "\"That’s quite the half-assed Myriad modification.\"\n\nThis is exactly what I thought. Could it have been any easier/lazier? The one logo retread I can think of that's more lame than this is the new [Chevron logo,](http://web.archive.org/web/20140713225440/http:/www.oskarlin.com/images/chevron_01.png) also using the safe and easily-available Myriad. They actually made signage with it and everything. Gak. I suppose we should be glad that the W is capitalized rather than made lowercase to give us all a cuddly, safe feeling.\n\n"
    },
    {
      "time": "1 Jul 2008 — 5:17pm",
      "content": "@Jon: That’s not how Wal-Mart keeps prices down.\n\n@Carl: Wow…that’s pretty bad. It makes me wonder if Myriad will become the new Optima; the font that every designer has that won’t offend anybody.\n\n"
    },
    {
      "time": "1 Jul 2008 — 6:07pm",
      "content": "The sunshine asterisk looks like a donut if you connect the rings. If they sell donuts, I'm there.\n\n"
    },
    {
      "time": "1 Jul 2008 — 6:10pm",
      "content": "Anyone who doesn't think that the proliferation of Walmart is evil, or needs some context should watch [this movie](http://web.archive.org/web/20140713225440/http:/www.walmartmovie.com/)\n\n"
    },
    {
      "time": "1 Jul 2008 — 6:11pm",
      "content": "I really do prefer the new logo though :) I would just rather sell my right arm than shop there.\n\n"
    },
    {
      "time": "1 Jul 2008 — 10:46pm",
      "content": "The little sunshine does make me think of an anti-depressant drug. It also looks pretty \"kindergarten\" or like packaging for diapers.\n\n\\*\n\nIronically, I had been thinking about Wal-Mart just recently...about the name and how if it were at all possible, they should change/tweak it. I think there are just too many obstacles for the \"Wal-Mart\" brand\\>\\> i.e. negative stigmas, stereotypes and associations that have been made about the store within the pop culture (that's all branding too!). The only positive \"brand attribute\" they seem to have going for them is \"cheap prices\".\n\nSince re-naming is probably out of the realm of possibility, I think changing the look is the next best hope for the company. However, the juvenile look of the proposed design doesn't seem to appropriately encompass the massive proportion of the brand.\n\n"
    },
    {
      "time": "2 Jul 2008 — 12:03am",
      "content": "Oh cool. Now I know where to go if I ever need to buy a golden anus.\n\n"
    },
    {
      "time": "2 Jul 2008 — 5:25am",
      "content": "The old logo did seem a bit cold:\n\n ![](http://web.archive.org/web/20140713225440im_/http:/typophile.com/files/200px-Star_wars_galactic_empire_emblem_4892.svg.png)\n\n"
    },
    {
      "time": "2 Jul 2008 — 5:58am",
      "content": "If a bully kicks you in the groin with ugly, worn boots and then changes his boots to a shiny new pair, do you still remember the pain in your groin thw next time you see him?\n\nChrisL\n\n"
    },
    {
      "time": "2 Jul 2008 — 7:50am",
      "content": "\"With all the money that Wal-Mart has they couldn’t hire a great, or at least decent graphic design firm?\"\n\nWal-Mart didn't become Wal-Mart by paying well. ;o)\n\n\"If they sell donuts, I’m there.\"\n\nThey do. And I challenge you to eat even half of one. It's bad enough that Wal-Mart can destroy the grocery stores in small towns when they move in, but to add insult to injury, most of their food is rather inedible by anyone with even average taste buds.\n\n\"golden anus\"\n\nHa! That has a certain charm to it, oddly enough...\n\n"
    },
    {
      "time": "2 Jul 2008 — 7:12pm",
      "content": "Clearly the sunburst, lowercase and rounding are going for happy and friendly, as opposed to imposing and fascist. It does look like a pharmaceutical brand, but it also reminds me of Washington Mutual.\n\n ![](http://web.archive.org/web/20140713225440im_/http:/typophile.com/files/wamu_4715.gif)\n\n"
    },
    {
      "time": "2 Jul 2008 — 7:24pm",
      "content": "It seems that they changed everything that they possibly could with this redesign:\n\nThe name in effect by unhyphenating it.  \nThe typeface.  \nAbandoning the all caps.  \nThe color\n\nThe overall effect is a softer friendlier identity.\n\nI question the the size of the sun. It will work nicely animated and patterned like Target's graphic does.\n\nI'd make the sun smaller on the primary mark though.\n\n"
    },
    {
      "time": "3 Jul 2008 — 7:41am",
      "content": "I've noticed a lot of companies changing their logos lately...I'm not going to say the new Walmart logo is surprising, I guess.\n\nOne that I found slightly disturbing (and still do), though, is Payless Shoe Source:\n\n[http://www.underconsideration.com/brandnew/archives/payless\\_logo.gif](http://web.archive.org/web/20140713225440/http:/www.underconsideration.com/brandnew/archives/payless_logo.gif \"http://www.underconsideration.com/brandnew/archives/payless\\_logo.gif\")\n\nPeace,  \nJT\n\nP.S. Oh, and hi all.\n\n"
    },
    {
      "time": "3 Jul 2008 — 9:33am",
      "content": "This is pretty good. I mean its Walmart for Christ's sake... how else would you brand a store that at least a billion people shop at all over the world? Using a simple Sans that looks like Myriad (which is one of the most ubiquitous faces today, all the more fitting for a ubiquitous corporation) and rounding it slightly is current and looks friendly. I think this was a great branding...\n\nbut still Walmart is a awful company and should be highly scrutinized.\n\n"
    },
    {
      "time": "3 Jul 2008 — 3:17pm",
      "content": "The new logo feels somehow less... evil. Probably what they were going for.\n\nAnd I dig the dropping of the hyphen.\n\n"
    },
    {
      "time": "3 Jul 2008 — 8:53pm",
      "content": "\\>Using a simple Sans that looks like Myriad (which is one of the most ubiquitous faces today, all the more fitting for a ubiquitous corporation) and rounding it slightly is current and looks friendly\n\nBut surely Apple will be pissed, first Adobe steals their font and now Walmart. ;-)\n\n"
    },
    {
      "time": "4 Jul 2008 — 12:23am",
      "content": "What does everyone think about the possibility that Walmart is trying to appeal to the European market? Europeans generally feel more comfortable with sans serif type. They also have shown they are not big fans of Walmart thus far. (Failed in Germany) I mean, getting rid of the caps, changing the font and forgoing the star...seems to all lean towards making it seems less Western and cowboy-ish. yea?\n\n"
    },
    {
      "time": "4 Jul 2008 — 6:47am",
      "content": "\"Europeans generally feel more comfortable with sans serif type.\"\n\nLove it! That has to go on a t-shirt!\n\n"
    },
    {
      "time": "4 Jul 2008 — 7:39am",
      "content": "Could see this coming... \" [Small Biz: Change Your Logo Like Wal-Mart?](http://web.archive.org/web/20140713225440/http:/www.thestreet.com/s/small-biz-change-your-logo-like-wal-mart/newsanalysis/small-business-blog/10424677.html)\"\n\nMaybe designers will get some work out of this.\n\nCheers, Si\n\n"
    },
    {
      "time": "4 Jul 2008 — 7:46am",
      "content": "\\>where they’ve schooched the target up a bit, to hang over the edge of the wall/sign it’s on? This drives me crazy! I always want to pull it back down.\n\nMaybe it was made to be over the wall, bringing it UP. I guess maybe a blatant fiasko.\n\n"
    },
    {
      "time": "4 Jul 2008 — 1:42pm",
      "content": "Logo is blah...but ive seen all the movies and read the books but I still shop there!\n\nWhen its late and you need \"\\_\\_\\_\\_\\_\\_\\_\" they got it.\n\n"
    },
    {
      "time": "4 Jul 2008 — 2:37pm",
      "content": "Blue and yellow is classy and chic, like a Swedish flag... I mean IKEA logo.\n\n"
    },
    {
      "time": "4 Jul 2008 — 2:52pm",
      "content": "I really am trying to like it. Ha. I mean, seeing how far they have come since the first logo...and being the biggest retailer...they must know what they're doing right?? Eh, maybe it will take some packaging and actually seeing it in use to get use to it. No one ever really likes change when the original was comfortable.\n\nBut still this logo is screaming out something that doesn't say \"Walmart\"! ha. I see it and I think generic. standard? I mean especially with the astric/sun/star symbol. But more like...designed generic. Oh who knows, everyone clap your hands and welcome in the new Walmart logo, cause we all know it's here to stay. =/\n\n"
    },
    {
      "time": "22 Jul 2008 — 12:54pm",
      "content": "They've switched up the television commercials here in San Jose. We saw one commercial yesterday with the old logo and the new one today. At first it looked like an IKEA ad. It doesn't help that at the end their logo is blue and yellow causing a little subliminal crossover.\n\n"
    },
    {
      "time": "25 Jul 2008 — 6:08pm",
      "content": "I just saw the new logo in a banner ad...\n\n ![](http://web.archive.org/web/20140713225440im_/http:/typophile.com/files/Walmart_BackToSchool_160x600_def_3538.jpg)\n\n"
    }
  ]
}
