{
  "id": "46938",
  "title": "Tattoo art",
  "forum": "louie c's blog",
  "tags": [

  ],
  "content": "I’ve always been a fan of tattoo art. Not the spring break, “o my god, I’m so wasted” tattoo art, but the finely tuned, detailed stuff. When looking at it from a design perspective, you may one to check out a guy named Sailor Jerry. Jerry was the original, old school tattooer. Although simple, a lot of his stuff is interesting..\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/flash_2_4980.jpg)\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/th_art7_4636.jpg)\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/th_Image2-1_3934.jpg)\n\n",
  "author": "<a href=\"/web/20081204120900/http://www.typophile.com/user/31635\" title=\"View user profile.\">louie c</a>",
  "time": "<br>",
  "uid": "31635",
  "comments": [
    {
      "time": " 1.Jul.2008 12.03pm",
      "content": "Louie,  \nYou are so fascinated by detail with all the work you show however when you post your own work I do not see that same intensity of detail. As you know detail takes a lot of time. I look forward to seeing the love you have for detail in your own work.\n\nHave you seen these typographic detailed tattoos?  \nWhat do you think about these? Do you think type would be difficult to tattoo?\n\nI found these on this website: [http://hubpages.com/tag/lettering+tattoos/hot](http://web.archive.org/web/20081204120900/http:/hubpages.com/tag/lettering+tattoos/hot \"http://hubpages.com/tag/lettering+tattoos/hot\")\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/261796_f520_3842.jpg)\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/261821_f520_6238.jpg)\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/261803_f520_4513.jpg)\n\nor on this website: [http://www.bmezine.com/tattoo/let001.html](http://web.archive.org/web/20081204120900/http:/www.bmezine.com/tattoo/let001.html \"http://www.bmezine.com/tattoo/let001.html\")\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/nq07-woody_3484.jpg)\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/nqid-callum_6277.jpg)\n\n"
    },
    {
      "time": " 2.Jul.2008 3.35am",
      "content": "I actually have my cousin’s eulogy tattooed on my arm... she was a published poet, dying of cancer....she wrote her own before she died.. I posted part of it as one of my digi sketch projects. I can actually take a shot of the whole thing if you would like to see it\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/-2_5253.jpg)\n\n"
    },
    {
      "time": " 3.Jul.2008 9.59am",
      "content": "Thank-you for sharing this image. I would like to see the entire piece.  \nIt is quite beautiful. Who did the art work? What typeface did they use?  \nDid you get to choose?\n\n"
    },
    {
      "time": " 7.Jul.2008 11.24am",
      "content": "I actually used the exact type that was on the back of the card that the funeral home had handed out...I know it sounds kind of weird, but I wanted to keep it as close to the original as possible. I actually get annoyed w/ it sometimes, every random person that sees a part of it will just come up to me, pull up my sleeve, and start reading it like I’m a book at the library. It’s been the source of many an intriguing conversation as well as the beginning of nights filled with bedlam and mayhem..\n\n"
    },
    {
      "time": " 8.Jul.2008 7.32am",
      "content": "Louie,\n\nIf this is not too personal, I would love to see a scan of the original card from the funeral home. My personal research is engraving and most of it is American commercial engraving which, traditionally, was used for the sea change occasions in life (birth announcements, christenings/confirmation/bar-bat mitzvah/wedding/bereavement.)\n\nNext week I go to Typecon to deliver “Etiquette and Typography” which includes the custom for printed bereavement cards.\n\nThere is an amazing Joan Didion book about dealing with illness and loss, “The Year of Magical Thinking”, Vintage Books. In it she talks about how western culture has forgotten the rules by which we mourn. We used to have rigid codes for the passage through grief into morning and then return to everyday life. But no longer, so every one of us is left on our own. Some mourn with grace, others not so. I personally think your treatment of dealing with your cousin’s passing is beautiful and hope that it brings you peace with your loss.\n\nWhen my own mom died last year my uncle, her brother, asked me if I would like to take care of the bereavement acknowledgment cards. My mom’s family is in the funeral business and ordinarily the funeral home takes care of these details. But, my business is engraving for social stationery, so, he asked.\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/cFk_4357.jpg)\n\nAbove is my mother’s original monogram engraved on the occasion of her marriage to my dad. Notice the initials that she took, “C” for Charlotte, her given name. The prominent “F” in center is her married name, Feldman, and the final “K” is her maiden name. \\*\n\nIn about 1990 I asked to borrow my mom’s monogram plate then proceeded to loose it. By then I had been working with a hand engraver who said he could replicate it. Mom’s die was engraved 1951 (go to [http://www.nancysharoncollinsstationer.com/2005/timetable.htm](http://web.archive.org/web/20081204120900/http:/www.nancysharoncollinsstationer.com/2005/timetable.htm \"http://www.nancysharoncollinsstationer.com/2005/timetable.htm\") for the whole story.) In the forty subsequent years the physical acumen required for such fine engraving as my mom’s monogram had all but gone away. My willing engraver was simply not up to the task and delivered a much less refined engraving for my mother’s initials.\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/cFk_4594.redo.jpg)\n\nIf you compare this brilliant rendition to the original white (top) monogram you will see how course the new die was. The original was made up of four paralleling lines. The new one has none of the delicacy inherent in engraving, it was just a course reproduction. So I commissioned a third:\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/cFk_redone_4658.jpg)\n\nBereavement acknowledgement cards are simple text, elaborations such as personal monograms are not usual. Although not proper, something in me wanted my mother’s final form of correspondence to hold her personal mark, so I decided to use her monogram. Below are the bereavement acknowledgment cards engraved for the occasion of my mother’s funeral:\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/cFk_3486.bereavement.jpg)\n\n\\* In 2001 I did a survey of society stationery shops across the country to find out trends in women’s married names. At that time about seventy five percent of women who married dropped their middle name, replacing it with their maiden name. (My mother, who had been Charlotte Beth Kaufman before marriage, became Charlotte Kaufman Feldman when wed.) This statistic is probably not the same today.\n\n"
    },
    {
      "time": " 8.Jul.2008 12.20pm",
      "content": "Sorry to hear about your mother. I think it’s admirable that you took the time to create something beautiful in order to preserve her memory. Sometimes doing the “inappropriate” thing is better than doing what everyone else “expected”.........we’ll leave that at sometimes. Here’s a scan of the poem on the card, I’ve e-mailed it to you as well. All together it took about eight hours to get the lines straight and to actually ink it, on my arm that is..\n\n ![](http://web.archive.org/web/20081204120900im_/http:/www.typophile.com/files/ejb_6683.jpg)\n\n"
    },
    {
      "time": " 8.Jul.2008 4.05pm",
      "content": "Louie,\n\nThank you for the kind thoughts about my mom.\n\nThank you for the original. In what form was it on the paper sample from the funeral home?\n\nIf i read you correctly, it took eight hours to scribe it on your arm, is this correct?\n\n"
    },
    {
      "time": " 9.Jul.2008 2.28am",
      "content": "yes m’am,  \nTo line it up and to ink, it took eight hours.......\n\n"
    }
  ]
}
