{
  "id": "46939",
  "title": "First venture into typography - opinions?",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hey folks, I'm a big fan of the many forms typography so thought I'd have a go at a simple compostion myself. I'm trying to go for a futuristic/experimental look with the typeface that I created. How do you think it looks?\n\nThanks\n\nCharlie\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.png](http://web.archive.org/web/20130825042606/http:/typophile.com/files/Picture%201_146.png) | 10.1 KB |\n\n",
  "author": "CPOliver",
  "time": "30 Jun 2008 — 12:33pm",
  "uid": "33189",
  "comments": [
    {
      "time": "1 Jul 2008 — 1:54pm",
      "content": "nobody?\n\n"
    },
    {
      "time": "24 Jul 2008 — 5:15am",
      "content": "I'm game.\n\nIt is not a readable letter.  \nIntruiging, though.\n\nI see a sort of modular structure.\n\nCan you tell something about the background?\n\n"
    },
    {
      "time": "11 Aug 2008 — 8:09pm",
      "content": "I like it. The t is too experimental... looks too much like a b. Keep going. I have no idea what the thing before the t is, either. Finish the alphabet and set it in some sample text and look for problems. Tweak the letters until they work. Then start over. If you were taking up painting, you wouldn't expect your first painting to be a museum piece, right? :)\n\n"
    },
    {
      "time": "17 Aug 2008 — 7:18pm",
      "content": "Experimental, a bit illegible at the beginning. I think something that may help is if you take into consideration identifiability of the tops and bottoms of letters. Typically, if you take a sentence of a typeface and cover the bottom half, you'll be able to read what the top half still says.\n\nHowever, if you cover the top half, it becomes more difficult to read. Your typeface seems to have a uniformity to the top and bottom. That's not necessarily bad, but it does make the eyes take a bit longer to identify what the letter is.\n\n"
    }
  ]
}
