{
  "id": "46984",
  "title": "Arabic shows strange chracters in ms access relationship",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I m making a database in ms access. While entering data in table in arabic, its ok but when seeing fields in relationship, it shows strange chracters. How to solve this problem.????????? I have already configured regional settings and also installed arabic support files.\n\n| Attachment | Size |\n| --- | --- |\n| [arabic problem.gif](http://web.archive.org/web/20131107044232/http:/typophile.com/files/arabic%20problem.gif) | 19.69 KB |\n\n",
  "author": "sallu",
  "time": "2 Jul 2008 — 1:28am",
  "uid": "33277",
  "comments": [
    {
      "time": "2 Jul 2008 — 2:10am",
      "content": "Welcome Sallu with Flowers  \n1. A new forum has been recently allotted to Arabic AT+AC:  \n [http://typophile.com/forum/366](http://web.archive.org/web/20131107044232/http:/typophile.com/forum/366 \"http://typophile.com/forum/366\")  \nSo please post Arabic-Related problems here next time.  \n2. Though I never use M$ Access, I can guess from my experience with M$Word 2.0 upto 2003 that you have to set the corresponding fields to Arabic Language + Right to Left Direction. Emphasizing: Direction has nothing to do with Justification that can be made right, left or center.  \n3. Sallu in Seen or Saad?  \n4. All the Best with Flowers\n\n"
    },
    {
      "time": "2 Jul 2008 — 5:24am",
      "content": "Sallu,\n\nIt seems this is more an error by Microsoft than one caused by your installation / machine / configuration. The font for this dialog might be hardcoded to one that does not contain Arabic characters. I'm guessing, but it's still displayed RTL -- so it's recognized as Arabic --, and the same text displays fine in other dialogs -- so it's not a text storage thingy.\n\nYou could contact Microsoft to report it as a bug, or perhaps they already have a fix.\n\n"
    },
    {
      "time": "2 Jul 2008 — 8:45am",
      "content": "Looks like a problem with ecoding, although I can't tell whether problem is with control only or Accsess engine not supporting Unicode in field names.\n\nCan you tell which version of Access you use? And whether you use localized versions of Access and Windows.\n\nThanks,  \nSergey\n\n"
    },
    {
      "time": "2 Jul 2008 — 9:40am",
      "content": "@ Aziz Mustafa  \nIts nick for Salman (-; name of one of my friend. Any how I have set all options but still the same. Previously I ws having problem with copy paste but it ws solved by installing arabic add-on for windows. Thanx Hoping to having a good relationship with this forum.\n\n@Theunis de Jong  \nI have searched all on the net but found no satisfactory results.\n\n@sergeym  \nI m using windows xp professional ver.2002 with service pack2.and office is 2003  \nWt do u mean by localized version??\n\n"
    },
    {
      "time": "5 Jul 2008 — 10:27pm",
      "content": "I was asking if version of your Windows and Office is English, Arabic, or something else.\n\nThanks,  \nSergey\n\n"
    }
  ]
}
