{
  "id": "46990",
  "title": "FontFont releases FF Pitu by Lukasz Dziedzic, a typeface with possibly no purpose at all",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu01_4069.png)\n  \n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu02_5974.png)\n\nThe **FF Pitu** typeface by **Łukasz Dziedzic** has been just released by **FontShop International** and is available in OpenType in three styles:\n\n[**FF Pitu Pro Light**](http://web.archive.org/web/20150123110120/http:/www.fontshop.com/fonts/downloads/fontfont/ff_pitu_pro/)\n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu03_5626.png)\n\n[**FF Pitu Pro Regular**](http://web.archive.org/web/20150123110120/http:/www.fontshop.com/fonts/downloads/fontfont/ff_pitu_pro/)\n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu04_6314.png)\n\n[**FF Pitu Pro Bold**](http://web.archive.org/web/20150123110120/http:/www.fontshop.com/fonts/downloads/fontfont/ff_pitu_pro/)\n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu05_3951.png)\n\nIn his primary occupation as an editorial and magazine designer, Łukasz Dziedzic has been constantly in search for new typefaces. Most of his own fonts originate in situations where he felt that none of the faces currently available on the market worked “quite right” in the context of a project he was currently working on. Therefore, most of his typefaces have at some point been tested in real magazine layouts, and refined based on those findings. This was also the case with Pitu: an early version of the design was used by the Polish weekly “Europa” until the magazine assumed a different stylistic direction.\n\nPitu started off in 2002 as a set of swashy capitals accompanied by lowercase that sits somewhere between a Didone italic and a Copperplate script. Its most characteristic features are probably the pronounced stroke modulation and blade-shaped sharp stroke endings, which are slightly softened by generous calligraphic loops with “foxtail” terminals. While keeping a slanted angle of the face, Lukasz expanded the initial face into a three-weight family, changed the proportions of the lowercase, reworked the swash capitals and added a complete set of “simple” Didone capitals and small caps.\n\nIn 2004, Pitu was selected for the “Bookmark” exhibition that showcased Central European typeface designs. The exhibition took place in The Hague and was hosted by the Slovak Centre of Design.\n\nThe primary alphabets of Pitu consists of an ordinary uppercase and lowercase\n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu06_3788.png)\n  \nsmall caps  \n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu07_5260.png)\n  \nswash capitals, lowercase alternates  \n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu08_6034.png)\n\nThe fonts also include several kinds or figures, various ligatures, superscripts, subscripts and many more characters. The FF Pitu Pro fonts cover all Latin-based European languages, including some niceties. For example, in addition to the regular „ł”,\n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu09_6332.png)\n  \nPitu contains a calligraphic „ł” variant, typical for Polish handwriting:  \n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu10_3917.png)\n  \nAnd even, by popular demand (i.e. I asked him), an „łł” ligature:  \n\n ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/pitu11_4121.png)\n\n**Full character sets** can be viewed for [FF Pitu Pro Light](http://web.archive.org/web/20150123110120/http:/www.fontshop.com/fonts/acs_rend.php?acs_db=1&acs_pt=48&acs_id=176303&acs_fr=0&acs_to=9000&acs_w=1600), [FF Pitu Pro Regular](http://web.archive.org/web/20150123110120/http:/www.fontshop.com/fonts/acs_rend.php?acs_db=1&acs_pt=48&acs_id=176304&acs_fr=0&acs_to=9000&acs_w=1600) and [FF Pitu Pro Bold](http://web.archive.org/web/20150123110120/http:/www.fontshop.com/fonts/acs_rend.php?acs_db=1&acs_pt=48&acs_id=176302&acs_fr=0&acs_to=9000&acs_w=1600) _(the images are large)._\n\nFF Pitu is available through the [**FontShop**](http://web.archive.org/web/20150123110120/http:/www.fontshop.com/) network. In addition to the three FF Pitu Pro OpenType fonts, the design is available in a variety of other encodings and formats.\n\n**Łukasz Dziedzic** was born 1967 in Warsaw. Rather than to finish high school, he worked as a sound technician and occasionally actor at a children's theatre group, spent a year working as a carpenter helper rebuilding 13th-century churches, he lent his voice and bass guitar skills to the band »Dunski Jazz«, and worked as a software developer at the Polish patent office.\n\nDuring the first free Polish elections of 1989, he briefly worked as a newsboy for Gazeta Wyborcza, the newly-launched, first independent daily newspaper in the country. A year later, he joined the design department of Gazeta Wyborcza and spent seven years there, co-creating the layouts of the main newspaper and its weekly companion magazine, for which he drew his first typeface. He later worked for several other publishing houses in Warsaw (since 2003 at Axel Springer Polska), designing newspapers and magazines. In the same time, Łukasz drew over a dozen typeface families ranging from large Latin and Cyrillic text families to single display styles. Many of these fonts were originally created for a particular newspaper or magazine layout. Some of them went into regular use or were used occasionally (in Poland: Gazeta Wyborcza, Vita, Przyjaciółka, Fakt, Lub Czasopismo, Gość Niedzielny, TeleŚwiat, Komputer Świat, in Russia: OK!, in Germany: OK! and PAGE), others were never utilized.\n\nIn 2007, Łukasz created a three-style Latin and Cyrillic corporate family for [**empik**](http://web.archive.org/web/20150123110120/http:/www.flickr.com/photos/adamt/2563664544/), one of Poland's largest press and music retail store networks. In the same time, FontShop International released two of Łukasz Dziedzic's families ( **FF Clan** and **FF Good** ). His [**Typo Berlin 2008 appearance**](http://web.archive.org/web/20150123110120/http:/www.typo-berlin.de/2008/index.php?node_id=Dziedzic;942&lang_id=2) did not bring him a standing ovation, as he did not show any examples of his own work, so he will do better next time. In 2008, FontFont released **FF Clan Italic** and **FF Pitu**. His other unreleased designs can be seen at his website [**alfabety.pl**](http://web.archive.org/web/20150123110120/http:/www.alfabety.pl/).\n\nThe designer's name is spelled Łukasz, not Lukasz, but Typophile's support for non-Western characters in the Flash-driven headlines is broken.\n\nFor those who like tongue twisters and want to try pronouncing Łukasz Dziedzic's name: it would go like **_woo-cash jeh-jeets_**. Also, **Pitu** should be pronounced **_pee-too_** (rhymes with _me-too_), not _pie-two_ or _pie-t-you_.\n\nŁukasz has absolutely no clue what Pitu is useful for, so I suggest you give it a shot and let him know.\n\nRegards,  \nAdam\n\n",
  "author": "twardoch",
  "time": "2 Jul 2008 — 7:52am",
  "uid": "1133",
  "comments": [
    {
      "time": "2 Jul 2008 — 8:34am",
      "content": "I need to learn a language with fewer vowels; it would make my type specimens look WAY cooler.\n\n"
    },
    {
      "time": "2 Jul 2008 — 10:04am",
      "content": "I love the way Adam has hacked our FontShop.com character set renderer to generate those oversize images.\n\nYou're going to be seeing a lot more of FF Pitu very soon.\n\n"
    },
    {
      "time": "2 Jul 2008 — 10:37am",
      "content": "This is gorgeous. Provocative even. The stems which mimick a sharp nib pen ... well it certainly doesn't shy away from anything. This is what people should think of when they want something that looks opulent, lavish and exclusive. This is a font for a private club with high bench seat and private alcoves with velvet curtains.\n\n"
    },
    {
      "time": "2 Jul 2008 — 11:58am",
      "content": "Dead on about the opulence, Tiffany.\n\n"
    },
    {
      "time": "2 Jul 2008 — 12:51pm",
      "content": "Count Dracula with emphasis on the Count.\n\n"
    },
    {
      "time": "2 Jul 2008 — 1:20pm",
      "content": "sa-weet!\n\nChrisL\n\n"
    },
    {
      "time": "2 Jul 2008 — 2:14pm",
      "content": "Finesse.\n\n"
    },
    {
      "time": "3 Jul 2008 — 1:46am",
      "content": "_with possibly no purpose at all_  \nHehe, that's what i thought too. We'll see. Go extravaganza go!\n\n"
    },
    {
      "time": "3 Jul 2008 — 6:27am",
      "content": "Congrats, Łukasz!\n\nAs for potential uses, yeah, titles for horror movies do come to mind, but also as a swash counterpart to something rigid and geometric it could be very useful.\n\n"
    },
    {
      "time": "3 Jul 2008 — 7:41am",
      "content": "Sometimes you just love to see new forms beautifully drawn for their own sake, Well done, Łukasz!!\n\nChrisL\n\n"
    },
    {
      "time": "3 Jul 2008 — 9:05am",
      "content": " ![](http://web.archive.org/web/20150123110120im_/http:/typophile.com/files/FF-Pitu_3807.png)\n\n"
    },
    {
      "time": "3 Jul 2008 — 11:31am",
      "content": "very nice\n\n"
    },
    {
      "time": "3 Jul 2008 — 11:39am",
      "content": "So bizarre and cool all at once…\n\nJon.\n\n"
    },
    {
      "time": "3 Jul 2008 — 2:24pm",
      "content": "Absolute beauty!\n\n"
    },
    {
      "time": "3 Jul 2008 — 11:05pm",
      "content": "Łukasz has absolutely no clue what Pitu is useful for,\n\nHAHAHAHAHAHAHAHAHAHAHA!\n\nthats prtty flaming funny mate! hahaha!\n\n-----------------------  \nChopper Reid says \"Harden the \\*\\*\\*\\* up\".\n\n"
    },
    {
      "time": "3 Jul 2008 — 11:13pm",
      "content": "sweet. i like it in the fontshop renderer.\n\n"
    },
    {
      "time": "4 Jul 2008 — 7:35am",
      "content": "Absolutely fantastic! A font family to fall in love. :)\n\n"
    },
    {
      "time": "5 Jul 2008 — 1:17pm",
      "content": "Wow, this is beautiful\n\n"
    },
    {
      "time": "7 Jul 2008 — 3:30pm",
      "content": "I predict type will be used for advertisements selling things I can't afford.\n\n"
    },
    {
      "time": "7 Jul 2008 — 3:45pm",
      "content": "lol\n\n"
    },
    {
      "time": "7 Jul 2008 — 4:35pm",
      "content": "bondage packaging typeface.\n\n"
    }
  ]
}
