{
  "id": "47",
  "title": "FOSS",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is a typeface I began after an inspiring tour of Iceland. Initially, I was only interested in spelling the name of the country, but I have continued to work with the letterforms and now find myself with a monocase alphabet and some rudimentary numbers.   \n   \nAgain at this point I am wondering if it is worth filling in the gaps in this typeface and whether there is a market for a titling face like this in today's type market.   \n   \nyour comments will be greatly appreciated.   \n   \nthanks, Nicholas.   \n   \n ![your_file_name.gif](http://web.archive.org/web/20150416055936im_/http:/www.typophile.com/forums/messages/29/1024.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [GCT\\_UG\\_GC.jpg](http://web.archive.org/web/20150416055936/http:/typophile.com/files/GCT_UG_GC.jpg) | 12.53 KB |\n| [GCT\\_UG\\_KP.jpg](http://web.archive.org/web/20150416055936/http:/typophile.com/files/GCT_UG_KP.jpg) | 12.61 KB |\n\n",
  "author": "anonymous",
  "time": "26 Mar 2002 — 2:00pm",
  "uid": "1203",
  "comments": [
    {
      "time": "26 Mar 2002 — 2:51pm",
      "content": "Nicholas - This is nasty good stuff. And nice craft pulling it off. There should be more monocase fonts (or unicase) on the market. And there's not enough icelandic inline/gothic fonts out there either. ![:)](http://web.archive.org/web/20150416055936im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nCertainly t26 would be interested in something like this. Or IHOF. (Look at James Grieshaber's excellent Gothic Gothic). I don't see it as short-lived (Hrant do you mean here today, gone tomorrow?). I see it as a niche face in a more classical sense. For example, Downer's Ironmonger is a niche typeface that people would use when appropriate, but nobody is going to log on and buy it for run-of-the-mill work.   \n   \nNice work.   \n   \n   \nBTW, a member of this forum is Phil Foss®. Maybe you can work out a royalty arrangement.   \n   \nPhil?   \n   \n   \nbj\n\n"
    },
    {
      "time": "27 Mar 2002 — 6:26am",
      "content": "i'll buy it if you actually name it FOSS. it looks great btw. how did you choose the name? i dont know much about my last name except it has roots in norway.   \n   \nPhil\n\n"
    },
    {
      "time": "27 Mar 2002 — 11:12am",
      "content": "Psychedelia Moderne? Very nice. I also like Sbo's idea about variance. More versions? And how about a couple of words?\n\n"
    },
    {
      "time": "26 Mar 2002 — 8:27pm",
      "content": "Ooh, a tuscan. Look out Margo. :-)\n\n"
    },
    {
      "time": "26 Mar 2002 — 9:32pm",
      "content": "Chase?\n\n"
    },
    {
      "time": "27 Mar 2002 — 12:47am",
      "content": "I guess Iceland have some extra characters u should take care of. This is nice to carve in wood I guess..or any other material.   \n   \nTry remove the thin inline and get an even nicer version, and try to take away everything except the thin inline and you get a third version of your font. This is a 3 in 1 package. I prefer the version where you remove the inline.   \n   \nSbo\n\n"
    },
    {
      "time": "27 Mar 2002 — 7:23am",
      "content": "thanks for all the input so far. I knew that if I posted my work I would get a great response from this community.   \n   \nPhil - I adopted the Icelandic word for waterfall (Foss) as the name for this face, as they were so prevalent and spectacular over there. It also didn't hurt that it was one of the few pronouncable words I found in Icelandic.   \n   \nIf you are interested in a distraction, the photo gallery that this type was created for can be found here: [http://feltron.com/island](http://web.archive.org/web/20150416055936/http:/feltron.com/island)   \n   \nI love the 3 in 1 suggestion, so I've got a lot of work ahead, but the murmurs of approval are inspiring.   \n   \nthanks, nick.\n\n"
    },
    {
      "time": "27 Mar 2002 — 10:47am",
      "content": "Foss means waterfall in Norwegian. I just have to say that you have a great intuition if you didnt know this. ![:)](http://web.archive.org/web/20150416055936im_/http:/www.typophile.com/forums/clipart/happy.gif) Your characters looks like mini-waterfalls.   \n   \nSbo\n\n"
    },
    {
      "time": "26 Mar 2002 — 2:14pm",
      "content": "This is icy-cool! :-)   \nI think there is a market, but a short-lived one.   \n   \nhhp\n\n"
    }
  ]
}
