{
  "id": "470",
  "title": "Getting 'special' characters into illustrator",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "i'm having a devil of a job getting 'non-keyboard'characters such as ligatures, em dashes etc into illustrator, & was wondering if anyone could help me.   \n   \ni've tried pasting/drag-dropping from Character Map, and the alt+# method without any success. when i paste the character directly from another app, illustrator rather unhelpfully displays an '?'.   \n   \ni'm running illustrator 9 on a PC. any suggestions welcome.   \n   \nthanks, geraint\n\n",
  "author": "geraintf",
  "time": "27 Jun 2003 — 7:44am",
  "uid": "868",
  "comments": [
    {
      "time": "27 Jun 2003 — 7:53am",
      "content": "I was having same problems with inserting square root symbol into Illustrator. No luck. Had to do it via InD - pasted in there, converted to curves, pasted as curves into Illustrator. No other way.. ![:-(](http://web.archive.org/web/20141123082752im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "27 Jun 2003 — 9:46am",
      "content": "making and breaking the glyph... ![:-)](http://web.archive.org/web/20141123082752im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "27 Jun 2003 — 2:37pm",
      "content": "If illustrator is giving you a question mark for special characters it means those characters are out of the first 256 glyph range and are unicode. Illustrator doesn't understand unicode yet. Though as someone said, if you have InDesign you can take it in there and create outlines. InDesign is fully unicode aware.   \n   \nOne thing though, I know the ligatures are out of the 256 glyph range on normal fonts, but em dashes are alt+0151, they should work fine.   \n   \nAlso, you can try doing Smart Punctuation and seeing if Illustrator will change it for you. It's under the type menu.\n\n"
    },
    {
      "time": "30 Jun 2003 — 1:23am",
      "content": "hey chris   \n   \nthanks for that. you're right about em dashes - the smart punctuation sorted that one out   \n   \ni use illustrator for everything - better start thinking about InD..\n\n"
    },
    {
      "time": "30 Jun 2003 — 1:51pm",
      "content": "The next version of Illustrator should be Opentype and Unicode aware :crosses fingers:\n\n"
    }
  ]
}
