{
  "id": "47002",
  "title": "Bitmap web text",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,  \nI am wondering, what are some good bitmap text fonts for searchable web content? I would like to improve the readablility of the content in the sites my company designs while at the same time keeping the content searchable. I know that Emigre was one of the first foundries to create bitmap fonts for screen use but are there newer designs/foundries that you could reccomend?  \nI like the text font that is used in the Typophile forums.\n\nThank you.\n\n",
  "author": "Jasper07",
  "time": "2 Jul 2008 — 10:58am",
  "uid": "33240",
  "comments": [
    {
      "time": "2 Jul 2008 — 11:12am",
      "content": "You might like [Unibody](http://web.archive.org/web/20150324141614/http:/www.underware.nl/site2/index.php?id1=unibody&id2=overview) from [Underware](http://web.archive.org/web/20150324141614/http:/typophile.com/wiki/Underware).\n\n"
    },
    {
      "time": "2 Jul 2008 — 12:07pm",
      "content": "Thanks. That is a nice family. Do you have any other suggestions that can be used at larger point sizes, say (9-11pt)? I am also concerned about readability issues with older users. Right now we are turning off the anti aliasing in Photoshop for the html content on our sites.\n\n"
    },
    {
      "time": "2 Jul 2008 — 1:39pm",
      "content": "Hi Chris,\n\nare you speaking of plain HTML text? You won’t have any control over the fonts and rendering techniques used at the visitors’ side.\n\n<cite>I like the text font that is used in the Typophile forums.</cite>\n\nThat’s `Georgia`, at least if you have it installed.\n\nF\n\n"
    },
    {
      "time": "2 Jul 2008 — 2:31pm",
      "content": "I think you completely misunderstand how 99.999% of the text you read on the Web is rendered – from outline fonts. An outline font that looks like a bitmap font is a non-starter.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20150324141614/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    }
  ]
}
