{
  "id": "47037",
  "title": "New Website",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nI just finished my new website. If you are interested in hand lettering you may like to check it out at:\n\n[www.borgeslettering.com](http://web.archive.org/web/20080905032346/http:/www.borgeslettering.com/ \"www.borgeslettering.com\")\n\nHave a nice 4th of July!\n\n-Charles Borges de Oliveira\n\n [‹ Best font for nonfiction book](http://web.archive.org/web/20080905032346/http:/www.typophile.com/node/47993 \"Go to previous forum topic\") [PAID GIG... My Illustration + Your Font Ideas = Great Logo ›](http://web.archive.org/web/20080905032346/http:/www.typophile.com/node/48036 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905032346/http://www.typophile.com/user/1657\" title=\"View user profile.\">Charles_Borges_...</a>",
  "time": "<br>",
  "uid": "1657",
  "comments": [
    {
      "time": " 3.Jul.2008 11.44am",
      "content": "Nice!\n\n"
    },
    {
      "time": " 4.Jul.2008 3.55am",
      "content": "Mmm, love those script faces. Wish I had talent like that! Ever done any ambigrams? It looks like your style would fit right in with those...\n\nOne teeny-tiny thing: on the Contacts page, “These are my friends websites” needs an apostrophe.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 4.Jul.2008 8.10am",
      "content": "Your site is very nice. Thanks for sharing that.\n\n"
    },
    {
      "time": " 5.Jul.2008 7.24am",
      "content": "I will give you my opinion as Media and Communication Designer.  \nThe intro page hasn’t a nice layout, logo is nice and so is Letter & Design but first, why do you need bullets to say it is a menu? and second why do you have a menu so big? 10pt or 9 pt would be good enough. Sometimes the simple and tiny things are better! All the layout of the website has that problem. Then the problem of colors. The white and the orange it’s ok (as i said i like the logo) but about that grey...  \nI’m just trying to give a constructive critique!!! Just so you can improve and get a nice website... Nothing harmful really!!! don’t take to that point.\n\nAbout portfolio i just have to say... amazing! I’m starting with italics and so too and looking to your work is an inspiration! Keep on!\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 5.Jul.2008 9.47pm",
      "content": "Yeah I agree with Joel about the menu. Also I found it slightly annoying that I couldn’t click on the words, instead had to click on the bullets. Maybe it could be higher too - I’m not using a huge screen so I actually have to scroll down to see the “Lettering and Design” :)\n\nI love your Chicago script!\n\n"
    },
    {
      "time": " 5.Jul.2008 11.46pm",
      "content": "Congrats on the redesign, Charles. When will we see Chicago Script for sale?\n\n"
    },
    {
      "time": " 6.Jul.2008 2.41am",
      "content": "HaleyFiege is right. Remember that most of the people use 1024 resolution as i prove here:\n\nAt January 2008:  \nHigher-38%  \n1024x768-48%  \n800x600-8%  \n640x48-0%  \nUnknown-6%\n\nFrom [w3schools](http://web.archive.org/web/20080905032346/http:/w3schools.com/browsers/browsers_display.asp)\n\nand yes you should link the text too.  \nI do agree, chicago is a really god font.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 6.Jul.2008 7.13am",
      "content": "Thanks to everyone! :)\n\nDave, thanks for catching that.\n\nStephen. Thank you. Chicago Script is an exclusive font that I made for Letterhead fonts.\n\nJoel, I appreciate your comments. To be honest I am not a web designer. (this is my second webpage). I am at the mercy of the software that I am using. It does not allow links on flash based objects. I wish I could have made the looping stop and only show the effect once but the text would disappear.Very frustrating. So that is why there are bullet points so people would know where to click. :)\n\nHave a nice week!\n\n"
    },
    {
      "time": " 6.Jul.2008 8.47am",
      "content": "What software are you using?  \nMy critiques are for a better site not screw with you around. I think that you have a beautiful type work so you should have a beautiful website :D  \nHave you came from portuguese families? Borges de Oliveira is a portuguese name.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 6.Jul.2008 9.04am",
      "content": "I am using webstudio 4.0. Yes my last name is Portuguese. I am American, but my Father was Portuguese.\n\nIt’s funny because in America it is an uncommon last name but in Portugal I hear it is a rather common.\n\nHave a good one,\n\n-Charles\n\n"
    },
    {
      "time": " 6.Jul.2008 9.43am",
      "content": "Ehehe, well... i’m portuguese!  \nAbout webstudio... yes... it sucks... ehehe\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 6.Jul.2008 9.52am",
      "content": "<cite>One teeny-tiny thing: on the Contacts page, “These are my friends websites” needs an apostrophe.</cite>\n\nNo it doesn’t. Possessive pronouns don’t get apostrophes.\n\n"
    },
    {
      "time": " 6.Jul.2008 10.10am",
      "content": "I agree, if you can make the words clickable that will help a lot.\n\n"
    },
    {
      "time": " 6.Jul.2008 11.43am",
      "content": "James, “friends” is simply a plural noun. The text should be “Friends’ websites”.\n\n"
    },
    {
      "time": " 6.Jul.2008 12.02pm",
      "content": "Very nice Charles. I love Enchanted. Hope it is doing well sales wise, it should.\n\nMichael\n\n"
    },
    {
      "time": " 7.Jul.2008 7.44am",
      "content": "Thanks Michael!  \nJoel, webstudio 4.0 is not a bad program. Granted it is not Dreamweaver by any means but I enjoyed it. Then again I am a lettering artist, not a web designer :)\n\n-Charles\n\n"
    },
    {
      "time": " 7.Jul.2008 9.16am",
      "content": "You know what charles?  \nYou’re a lettering artist... why don’t you use that in your favour? It’s kind of a lack on your website! You could use your lettering skills to make the layout. A website doesn’t have to have animation, the animation won’t give anything unless it’s really well done. If you don’t know how to give a link to the text i think you should do what you know... lettering. There are many HTML pages really good! Better than most with animation!\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 8.Jul.2008 7.40pm",
      "content": "Well I updated my site. The flash objects should link now. I also updated some of the images.\n\nThanks for the input!\n\n-Charles\n\n"
    },
    {
      "time": " 9.Jul.2008 4.24am",
      "content": "better, i really do appreciate better this website now.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 9.Jul.2008 7.31am",
      "content": "Thanks Joel.\n\nI appreciate it!\n\n-Charles\n\n"
    },
    {
      "time": " 1.Aug.2008 6.40am",
      "content": "I am a bit late, but worth finding the link. Very nice lettering and beautiful brush scripts.\n\n"
    },
    {
      "time": " 3.Aug.2008 11.20am",
      "content": "Thank you Graham!\n\n"
    }
  ]
}
