{
  "id": "47058",
  "title": "a",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "a\n\n",
  "author": "rbarker21",
  "time": "4 Jul 2008 — 12:29am",
  "uid": "30659",
  "comments": [
    {
      "time": "4 Jul 2008 — 12:52am",
      "content": "I like Adelto set in Cocon at the top, but the bottom does not seem to match.\n\n"
    },
    {
      "time": "4 Jul 2008 — 1:48am",
      "content": "Hi there SUF!\n\nYeah it does not seem to run through correctly, as we will be selling high-end funriture, bespke products and building services, we want to look contemporary and modern (cocon) and also luxurious (the tagline) i might not have the tagline, but it just helps with the brand, lets people know what we are about, can you think of a font that would be better suited? All suggestions and ideas are welcomed!!\n\nThanks for your input,\n\nRichard\n\n[http://www.adelto.co.uk](http://web.archive.org/web/20131023225103/http:/www.adelto.co.uk/ \"http://www.adelto.co.uk\")\n\n"
    },
    {
      "time": "4 Jul 2008 — 2:14am",
      "content": "I think it looks great, but I agree with SUF that the font for the strapline doesn't quite look the right font, being just a tad too 'sharp'. If you can try some other serif fonts I'm sure you'll find one that works better. I'm also wondering if the strapline could be a little closer to the main logo, but i'm sure you tried all these things before settling with the layout you currently have. I was just thinking maybe a little more equilibrium between the tracking of the strapline letters & the space between the strapline & the logo.\n\nGlad you feel you can still come here for opinions.\n\nJH\n\n"
    },
    {
      "time": "4 Jul 2008 — 11:37am",
      "content": "A neutral sans would be nice... Helvetica?\n\nPerhaps Stephen Coles can suggest one to you as he might know a good complement for Cocon.\n\n"
    },
    {
      "time": "4 Jul 2008 — 2:07pm",
      "content": "Well have to say glad you picked this one out of the original bunch :) Looks great though, great color choice. Not a heavy black, but not a really light gray. Adds an element of sophistication. As for getting \"nit picky\" I think another font for the tag is in order as everyone else has said. I also want to see it a tad darker. Only a few shades, nothing too drastic. Or same shade and a slightly thicker font. I just think it sort of gets lost especially being a little far from the main part of the logo.\n\n"
    },
    {
      "time": "5 Jul 2008 — 12:58am",
      "content": "Thanks for the positive feedback :) Its really appreciated, i`ll have a word with the developer as its not yet finished and he still wants to do some refinements, but its nearly there!!! i`ll keep you all up-to-date on here!!\n\nKeep the comments coming also!!\n\nThanks\n\n[http://www.adelto.co.uk](http://web.archive.org/web/20131023225103/http:/www.adelto.co.uk/ \"http://www.adelto.co.uk\")\n\n"
    }
  ]
}
