{
  "id": "47064",
  "title": "GQ Cover Font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi\n\nI am looking for the two main fonts that are used on this GQ front cover. I can't find them anywhere... please help...\n\nThanks\n\n ![](http://web.archive.org/web/20150218043054im_/http:/typophile.com/files/lilyallen_468x606_5813.jpg)\n\n",
  "author": "fridgedesign",
  "time": "4 Jul 2008 — 4:10am",
  "uid": "33384",
  "comments": [
    {
      "time": "4 Jul 2008 — 4:33am",
      "content": "don't know, but it's staggeringly beautiful\n\n"
    },
    {
      "time": "4 Jul 2008 — 4:55am",
      "content": "LILY ALLEN is set in [SOHO Ultra Extended](http://web.archive.org/web/20150218043054/http:/www.faces.co.uk/fonts/Monotype-Imaging-Vols/Soho-Pro-Professional-Pack-22-fonts-MTOPP616462/) I guess.\n\n"
    },
    {
      "time": "4 Jul 2008 — 5:42am",
      "content": "\"The two main fonts...\"\n\nPlease explain in more detail. Which two fonts, exactly, are you trying to I.D?\n\n@dux — some strange new use of the word \"beautiful\" I hadn't previously encountered. The woman, yes. The rest of it is graceless, cumbersome and just plain embarassing. I've met design students fresh out of college who can design a more beautiful magazine cover than that.\n\nj a m e s\n\n"
    },
    {
      "time": "4 Jul 2008 — 5:54am",
      "content": "The 2 main used fonts as in 'Lily Allen' and 'All grown up'.\n\nThanks\n\n"
    },
    {
      "time": "4 Jul 2008 — 6:09am",
      "content": "Aren't both from the same family, SOHO?\n\n"
    },
    {
      "time": "4 Jul 2008 — 6:31am",
      "content": "James:\n\nI was not only being a smart arse, but a lazy one. I thought the (beautiful) font was Stag! doh! And as for Lilly... I hadn't previously encountered her described so ;-)\n\nI think you're being more than a little harsh on the cover design and a little more than generous to kids straight outta (dying to say compton), college.\n\n"
    },
    {
      "time": "4 Jul 2008 — 7:25am",
      "content": "I must be getting old.  \nEverything looks retro.\n\n"
    },
    {
      "time": "4 Jul 2008 — 7:34am",
      "content": "But you look so young in your photo Nick ;-)\n\n"
    },
    {
      "time": "4 Jul 2008 — 8:05am",
      "content": "Specifically the all-caps column on the left gave me a strong 1970s Usherwood vibe--Flange, Marbrook, that kind of thing, and the tight fit and leading recall that era also. Yeah, everything reminds me of something...\n\n ![](http://web.archive.org/web/20150218043054im_/http:/typophile.com/files/MadameX_orig_4480.jpg)\n  \n(although I wasn't around in _those_ 80s;-) \n"
    },
    {
      "time": "4 Jul 2008 — 8:31am",
      "content": "That image made me think of Flaubert.\n\n"
    },
    {
      "time": "5 Jul 2008 — 4:34am",
      "content": "Wasn't there a huge outcry about that Singer Sergent painting, something to do with the angle of her arm or something?\n\nIt was considered to be very provocative. There is definitely something about it, but it's not that outrageous.\n\nYou can tell I'm a very learned art history scholar.\n\n:^}\n\nNick Cooke\n\n"
    },
    {
      "time": "5 Jul 2008 — 5:18am",
      "content": "Nick:  \nI think Mr. Shinn is alluding to the way a strap is falling off the shoulder in both images.\n\nSargent originally painted it that way, but altered the it in response to the scandalized reaction to the painting, putting the strap back up.\n\nSee here:  \n [http://jssgallery.org/paintings/Madame\\_X.htm](http://web.archive.org/web/20150218043054/http:/jssgallery.org/paintings/Madame_X.htm \"http://jssgallery.org/paintings/Madame\\_X.htm\")\n\nInteresting story, eh?\n\n"
    },
    {
      "time": "5 Jul 2008 — 5:45pm",
      "content": "[Soho Ultra Extended Ultra](http://web.archive.org/web/20150218043054/http:/www.fontshop.com/fonts/singles/monotype/soho_std_ultra_extended_ultra/?sample_text=LILY%20ALLEN&sample_size=40) and [Soho Light](http://web.archive.org/web/20150218043054/http:/www.fontshop.com/fonts/singles/monotype/soho_std_light/?sample_text=ALL%20GROWN-UP&sample_size=48), indeed.\n\n"
    },
    {
      "time": "5 Jul 2008 — 6:02pm",
      "content": "John, thanks for that link! I was familiar with the painting, but not the story behind it.\n\nAs for the magazine cover, I guess the British version of GQ does not have [Fred Woodward](http://web.archive.org/web/20150218043054/http:/pictureyear.blogspot.com/2008/07/blog-post.html) as art director.\n\n"
    },
    {
      "time": "5 Jul 2008 — 10:12pm",
      "content": "@dux: _I think you’re being more than a little harsh on the cover design and a little more than generous to kids straight outta (dying to say compton), college._\n\n(much laughter) I was being facetious and not totally serious. But really, that GQ cover blows goats. The dire state of book typography, yepp, and the dire state of magazine design—you are looking at it.\n\n**Sum up** : Surprizingly successful cheaper-than-walking entry from America let down by laughable quasi-hip styling, mind-numbing metrosexual leanings and editorial standards mutually incompatible with self-respect. To its credit GQ succeeds with a hackneyed approach in a market sector where its competitors turn out bird cage lining. Certainly for those unacquainted with the feeling of butchness that comes from reading a real men's magazine like British _Car_.  \n**Rivals** : Esquire, FHM, The Face  \n**Also try** : Taking a bona fide interest in women  \n**My choice** : No. Not even in a parallel taste-free universe.\n\nj a m e s\n\n"
    },
    {
      "time": "6 Jul 2008 — 4:30am",
      "content": "Easy tiger…\n\n"
    },
    {
      "time": "6 Jul 2008 — 9:58am",
      "content": "Interesting story, eh?  \nAmazing. Thanks for sharing. And I love the cover.\n\n"
    },
    {
      "time": "6 Jul 2008 — 10:24am",
      "content": "James, that was a pitch-perfect bit of skewering. Well-played!\n\n"
    },
    {
      "time": "6 Jul 2008 — 10:34am",
      "content": "David, is there something wrong with your scanner?  \nThe colour looks a bit washed out :-)  \n(Or are those metallics?)\n\n"
    },
    {
      "time": "7 Jul 2008 — 5:49am",
      "content": "\"I’ve met design students fresh out of college who can design a more beautiful magazine cover than that.\"\n\nLOL! Interesting comment. How would they do it? I'm only asking rhetorically. Actually, I should be asking rhetorically how COULD they do it? I'm asking this non-rhetorically: James, have you been involved in the, most often, cooperative venture that is the designing of a major magazine cover?\n\nCheers!\n\n"
    },
    {
      "time": "9 Jul 2008 — 2:40am",
      "content": "You're awfully quiet James?\n\n"
    },
    {
      "time": "9 Jul 2008 — 5:14am",
      "content": "An answer to the rhetorical question:\n\nOne recent graduate may well be able to design a more beautiful magazine cover than a committee.  \nNow, just suppose that the designer's preferred concept had less copy, which would no doubt qualify as more beautiful on the less-is-more principle. But then the editor or publisher got cold feet that such simplicity wasn't hard-hitting enough, or didn't communicate all the great content inside, or looked like it belonged on a different section of the magazine rack.  \nSo rather than go back to square one, the understated, upscale design was added to, and, of course, looked flat, because that's what clutter does to understatement. So the type was jazzed: serif here, sans there; script here, block there; condensed here, extended there. And now, at the expense of mere beauty, there's some excitement to please the powers that be.\n\n\\*\\*\n\nAlex White, from _Type in Use_:\n\n\"Cover lines should present the most important contents, usually only feature stories. Lesser listings dilute the importance of cover lines and can overwhelm the reader...the more sophisticated and upscale the publication, the more restrained the typography should be.\"\n\nHe wrote that in 1992, does it no longer apply?\n\n"
    },
    {
      "time": "9 Jul 2008 — 6:43am",
      "content": "@David Berlow: _LOL! Interesting comment. How would they do it? I’m only asking rhetorically. Actually, I should be asking rhetorically how COULD they do it? I’m asking this non-rhetorically: James, have you been involved in the, most often, cooperative venture that is the designing of a major magazine cover?_\n\nI have never worked on the design of a magazine cover or a magazine, since I don't work in the publishing industry. Regardless, dozens of magazines exist with more tasteful covers than _GQ_. Go figure. There is such a thing as good taste, and more to the point, common sense. Common sense and taste (presumably, or perhaps it's talent) produce good cover designs at other magazines, yet GQ somehow manages to combine pretentious with eye strain.\n\nDoes my not being involved \"in the, most often, cooperative venture that is the designing of a major magazine cover\" disquailfy me from making rhetorical criticism of magazine cover designs? What absolute twaddle.\n\nHow \\*could\\* students fresh out of design school do better? By working for a magazine where the comittee avoids navel gazing in a cul de sac. If _Car_ and others can do it, why can't GQ? Editorial policy, as Nick has explained. probably has a lot to do with it. I didn't call _GQ_'s editorial policy \"mutually incompatible with self-respect\" for nothing.\n\n@dux: _You’re awfully quiet James?_\n\nYou're awfully keen to point that out, like it means I'm having trouble coming up with an answer. I'm awfully busy dude. Life comes first, pissy internet arguments come last. I am also going thru the painful ordeal of getting used to wearing dentures in my mouth. It's uncomfortable enuff to sour most parts of the day and evening.\n\nj a m e s\n\n"
    },
    {
      "time": "9 Jul 2008 — 7:33am",
      "content": "@james:  \n<cite>You’re awfully keen to point that out, like it means I’m having trouble coming up with an answer. I’m awfully busy dude. Life comes first, pissy internet arguments come last.</cite>\n\nNot at all. It was a chance to revitalise a disappearing and loose ended thread that I was interested in.\n\nThere is such a thing as good taste. There's also such a thing as my taste, your taste and everyone else's. Go figure. Common sense also comes in the form of marketing needs. ie. the strapline situation. You underestimate the editorial pressure involved in this piece of \"just plain embarrassing\" design. Pretentious? I havn't seen the magazine in a while but I suspect this is a result of it being 'aspirational'. Clearly GQ isn't your cup of tea...\n\n<cite>How *could* students fresh out of design school do better? By working for a magazine where the comittee avoids navel gazing in a cul de sac.&gt;</cite>\n\nShame on students that take these jobs mutually incompatible with self respect.\n\n@nick:  \n<cite>“Cover lines should present the most important contents, usually only feature stories. Lesser listings dilute the importance of cover lines and can overwhelm the reader...the more sophisticated and upscale the publication, the more restrained the typography should be.”</cite>\n\nI truly wonder whether this is possible in a magazine like GQ. Not only is it always on the look out for floating readers, I get the impression there's such variety in their readership that who's to say which stories are the most important.\n\nback@james:  \nsorry to hear about the dentures! I hope you like soup ;-)\n\n"
    },
    {
      "time": "9 Jul 2008 — 9:16am",
      "content": "@dux: _Not at all. It was a chance to revitalise a disappearing and loose ended thread that I was interested in._\n\nOkay I'll accept that. Sorry I assumed bad faith, just that it looked that way.\n\n_There is such a thing as good taste. There’s also such a thing as my taste, your taste and everyone else’s. Go figure. Common sense also comes in the form of marketing needs. ie. the strapline situation. You underestimate the editorial pressure involved in this piece of “just plain embarrassing” design._\n\nNow it's turning into a pissy argument. I'm bored with this conversation. Waiter..!\n\nOther magazines have \"editorial pressure\" and a bottom line involving cash exerting an influence on their design too, but most manage to avoid being this ugly.\n\n_Pretentious? I havn’t seen the magazine in a while but I suspect this is a result of it being ’aspirational’. Clearly GQ isn’t your cup of tea..._\n\nIt's okay for people who like that sort of thing. It's akin to an otherwise-good-looking 1932 Ford Roadster Deuce coup hotrod with mag wheels of questionable stylistic match fitted. The wheels are okay—if you like that sort of thing. A real '32 Deuce Coupe, one worth having, has decent vintage wheels on it. Bona fide hotrodders and hotrod lovers know the difference and shun the car with the 90's mags—because they make a beautiful car suck. Connoisseurs of good design shun bad design—because it makes magazines (and other stuff) suck.\n\nWhat else? How much rationale do you need to cut the cards?\n\n_Shame on students that take these jobs mutually incompatible with self respect._\n\nNo, shame on the magazines for selling their souls. You're taking something I said and twisting it beyond its original purpose and scope. If an editor offered me a job designing for a crummy magazine I'd look elsewhere for something more respectable. If students fresh out of college take such a job they deserve no shame but praise for making the most of a competitive job market at the outset of their careers.\n\n_sorry to hear about the dentures! I hope you like soup_\n\nCheers and thanks :^) I'm eating a lot of fish. Yum!\n\nj a m e s\n\n"
    },
    {
      "time": "9 Jul 2008 — 4:11pm",
      "content": "_He [Alex White] wrote that in 1992, does it no longer apply?_\n\nThe current a trend is for magazines to put a celebrity on the cover and fill up any remaining white space with headlines and more headlines... Of course there are different ways of doing this. To repeat an example I mentioned earlier in this thread, Fred Woodward's work for Texas Monthly, Rolling Stone, and the American GQ has always been outstanding.\n\n ![](http://web.archive.org/web/20150218043054im_/http:/typophile.com/files/gq_cover_5032.jpg)\n\nOther magazines, like Esquire, have also been doing this lately. Esquire has tweaked the idea and placed the type _behind_ the cover subject.\n\n ![](http://web.archive.org/web/20150218043054im_/http:/typophile.com/files/deltoro_4338.jpg)\n\nHere's a tongue-in-cheek thing they did recently:\n\n ![](http://web.archive.org/web/20150218043054im_/http:/typophile.com/files/jessica-simpson-esquire-01_3575.jpg)\n\nNotice that the headline reads, \"We shot this image to catch your eye so you will pick up this issue..., etc.\" Good for a quick chuckle, perhaps, but other designers have found better ways to catch readers' attentions. Compare that with the 1960s Esquire cover that is being homaged, sort of:\n\n ![](http://web.archive.org/web/20150218043054im_/http:/typophile.com/files/esquire_woman_march_65_6485.jpg)\n\n"
    },
    {
      "time": "9 Jul 2008 — 5:08pm",
      "content": " ![](http://web.archive.org/web/20150218043054im_/http:/typophile.com/files/1050_1_4896.JPG)\n\n"
    },
    {
      "time": "9 Jul 2008 — 5:27pm",
      "content": "Heh-heh. Thanks, Nick! I couldn't find that one!\n\nSee also:\n\nMichael Bierut's [\"The Final Decline and Total Collapse of the American Magazine Cover\"](http://web.archive.org/web/20150218043054/http:/www.designobserver.com/archives/entry.html?id=103).\n\n"
    },
    {
      "time": "10 Jul 2008 — 10:32am",
      "content": "\"Life comes first, [urine-like] internet arguments come last.\"  \nYou can say that again, dude. Or maybe, life comes first, _starting_ internet arguments comes last? Not likely.;)  \nThe golden age of subscriptions, when a cover was intended for the coffee table, is over (for a while now). Gripping images; an artist drowning in his own work, a film star in her final term of pregnancy, an arrow-pierced dethroned heavyweight or a burning skyscraper with folks leaping out, one just can't depend on those every month. It ain't always 'art' at the top, sales at the bottom, or yeah, baby students, first day students could do a better job, while the job lasted.;)\n\nCheers!\n\nPost script: When I follow this link, Michael Bierut’s “The Final Decline and Total Collapse of the American Magazine Cover”, I get a page with text starting 1 pixel from the left edge of the browser window. Is that what everyone gets?\n\n"
    },
    {
      "time": "10 Jul 2008 — 10:41am",
      "content": "Post post script: that may be due to a very narrow browser window.\n\n"
    },
    {
      "time": "10 Jul 2008 — 10:58am",
      "content": "Right.  \nMove your cursor to the bottom right of the \"window\" David, and \"drag\" on the corner to widen the window.  \nHope this helps.\n\n"
    },
    {
      "time": "11 Jul 2008 — 4:31am",
      "content": "Wow, you can do that? I've never met a website that required it though...\n\n"
    },
    {
      "time": "11 Jul 2008 — 10:20am",
      "content": "It happens to me.  \nI think the reason may be that I sometimes open two browser windows at the same time (for various reasons), and narrow their width so that they don't overlap.  \nIf I then go to a website which has a wider design, then some of it is cropped off, so I have to drag my window size wider, as the browser is \"remembering\" the narrower size I was just using.\n\nWeb designers don't necessarily fix the opening window size, because they realize that people will be viewing on a variety of monitor sizes. So if you fix your opening window size to a standard minimum, you are missing the opportunity to make a big impression on people with larger screens.\n\nI like big, which is why I made my website with scalable Flash content.  \nAnd I'd have to say that the Preview pane in GeniusLab is brilliant, the way the type size changes as one changes the height of the window.\n\n"
    }
  ]
}
