{
  "id": "47069",
  "title": "Critique - Arabic Logo Design - !",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "QATAR BAYTI  \nCritique pls :)\n\n| Attachment | Size |\n| --- | --- |\n| [Qatar-Bayti.jpg](http://web.archive.org/web/20130106073700/http:/typophile.com/files/Qatar-Bayti.jpg) | 17.96 KB |\n\n",
  "author": "metofa",
  "time": "4 Jul 2008 — 6:02am",
  "uid": "15024",
  "comments": [
    {
      "time": "4 Jul 2008 — 8:46am",
      "content": "Would you mind explaining what the logo is meant for? Not knowing Arabic I also don't even know where to begin critiquing, because I don't know what it says...if anything. I think a little introduction would be good. =)\n\n"
    },
    {
      "time": "4 Jul 2008 — 9:09am",
      "content": ":)  \nYou're right..;)  \nThis logo is for Qatar Bayti = meaning Qatar My Home  \nIt is for one of the biggest new projects ever to be in Doha... They wanted to show Qatari Heritage in their logo since the project will be building houses maintaining the Qatari heritage and authenticity with a modern touch...  \nI don't think I can talk more abt this project... but the client didn't approve this logo ( no idea why) but wat am sure about, the main reason is that he didn't like the name \"QATAR BAYTI\"...  \nSo now am trying to work on the new name and I want to get some opinion on this one..  \n:)  \nCheers\n\n"
    },
    {
      "time": "4 Jul 2008 — 11:43am",
      "content": "I've worked on a few projects for middle eastern based companies looking to build more of a presence in the UK. The fundamental thing our research taught us was that a 'western' audience has difficulty discerning characters from other alphabets. A text based mark won't work in isolation unless your target audience is 100% familiar with the character set used. You must be 100% sure who your audience is.\n\nLooking at it as a composition it looks a little unbalanced to me, just waiting for it to topple down to the right.\n\n"
    },
    {
      "time": "4 Jul 2008 — 1:11pm",
      "content": "Ah, well I won't lie and act like this is even a topic that I have any knowledge in. The only input that I have to offer to the table is it looks a little uneventful, not interesting. There's just nothing here that says \"logo\" to me yet. But of course this could be because I don't read characters. So please feel free to ignore my comment, I won't be hurt :) I will make sure to check in on the post to see new updates if you post them though, I'm interested to see where this goes. Good luck!\n\n"
    },
    {
      "time": "5 Jul 2008 — 5:08am",
      "content": "Hey again....  \nabout the audience:100% Arabic ..  \nwell guys I hope u know arabic cuz that would have helped more...  \n:) thanx for comments\n\n"
    },
    {
      "time": "5 Jul 2008 — 5:55am",
      "content": "\\> They wanted to show Qatari Heritage in their logo since the project will be building houses maintaining the Qatari heritage and authenticity with a modern touch\n\nQatari heritage and authenticity = A fishing boat  \nModern touch = US Bombing fighters taking off the US base.\n\nSo a fishing boat in the shape of Qatar with a fighter flying over it ill do the Job.\n\n\"My fishing boat is my home\"  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nIf you win the project, do not forget me.\n\n"
    },
    {
      "time": "5 Jul 2008 — 6:22am",
      "content": "hahaha...\n\n"
    },
    {
      "time": "5 Jul 2008 — 10:35am",
      "content": "Ohkay! To help you write/draw the logo:  \nQatar is a three-letter word = (Qaf + 6a + R)  \nQaf + a H-flipped Qaf joined together = Boat  \nThe Arm of 6a = Boat's sail.  \nThe body of 6a = The body of a fighter  \nA number of Rs + Bayti = Waves  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHaHaHa with Flowers\n\n"
    },
    {
      "time": "5 Jul 2008 — 1:57pm",
      "content": "AzizMostafa\n\nI do not get it?\n\n"
    },
    {
      "time": "6 Jul 2008 — 4:14am",
      "content": "KC, O(K)!(I)C your avatar shows your power of drawing+imagination.\n\nQaf looks like ë?!  \nSo Qaf + a H-flipped Qaf joined together = Boat = ë\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_9?!\n\nThe first 3 letters of Bayti (üuu+dots) can go wavy = Waves?!  \nwhich can be consolidated with a fonty j(s) to complete Bayti?!\n\nMore?! At your service with Flowers\n\n"
    },
    {
      "time": "6 Jul 2008 — 6:05pm",
      "content": "metofa  \nthe \"Rau\" word is disappeared.. and if that logo is for project about \"Qatari Heritage\"  \ni think you need \"Arabic Calligraphy Font\" beacuse the font you use is and never Inappropriate never with the mark... i think the best typeface for this mark is the \"thuluth font\" \"خط الثلث\"..\n\n"
    },
    {
      "time": "7 Jul 2008 — 9:20am",
      "content": "KC,\n\ni believe AzizMostafa is referring to not-uncommon  \ntechnique for arabic logos - namely, shaping the  \ncalligraphic, script arabic in a custom way to pictorially  \nresemble shapes which also have meaning for the logo.\n\nto give a simple example (which i am making up, i don't  \nknow if this one works) - you could write \"boat\" in arabic  \nin a way that actually looks like a boat.\n\ni've seen it done well, and it can be fairly impressive.\n\n@AzizMostafa - if one doesn't speak arabic, and has never  \nbeen to the middle east, or seen this technique, one  \nprobably wouldn't have the faintest idea what you were  \ntalking about regardless of the power of one's imagination,  \nor drawing skills.\n\njarrod\n\n"
    },
    {
      "time": "8 Jul 2008 — 3:42am",
      "content": "Thanx for the reply guys..\n\n"
    }
  ]
}
