{
  "id": "47077",
  "title": "New logo advice and critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a new logo design I developed (without formal design experience).  \nI hope this is the right forum to post this.\n\nThis logo is for a new website for professional freelance English teachers who want to work in companies teaching business English (in Europe). I want the logo to have a professional feeling but to also have a Teachers touch. \"Teachers touch\" means some hand written style font. I want the logo to be both the symbol and the website name (one variation outside of this is also presented). I am having a lot of difficulty with choosing a font because the name of the site is so long, ProfessionalEnglishTeachers.com . The logo colors represent the colors from the flags of several English speaking countries (sorry Ireland). The logo symbol has 3 elements: the letters \"PEt\", a teacher in front of a desk/podium with arms stretched upward, and a hint of the euro symbol. I would like to get feedback on fonts to use and perhaps positioning, borders, 3D effects, ect.\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET_uploadsample_6691.jpg)\n\nAny critic on the symbol would be appreciated, love it, hate it, rate it.\n\nPlease rate it 1 to 10 with:  \n10 being memorable, clever, intersting, an absolute keeper,  \n5 being just ok, nothing special, keep trying.  \n1 being hire a designer because you suck ;)\n\n",
  "author": "KC",
  "time": "4 Jul 2008 — 9:25am",
  "uid": "33425",
  "comments": [
    {
      "time": "4 Jul 2008 — 9:41am",
      "content": "Sorry to say, but it's quite obvious you don't have any design experience.\n\nThese are all very busy, but I think there's some hope in the mark for logo 'B'. Right now because of the even stroke width and rounded ends, it looks almost Korean to me. I'd make it look more organic like real brush strokes. You can go with the blue and red for a colour version, but I'd lose the outlines (and especially the shadow) of 'C' and 'D'.\n\nI'd choose typefaces that contrast a bit more, maybe a rigid sans and a brush script, or else just use a single typeface. Look at how the letters connect in \"English\" - you'll have to modify the 'En', 'ng', and 'li' connections so they look natural.\n\nPay attention to how the type and the mark work with each other. Right now, there's no alignment whatsoever.\n\nThe \"your way...\" slogan doesn't really make sense to me.\n\n- Lex\n\n"
    },
    {
      "time": "4 Jul 2008 — 10:41am",
      "content": "_“Teachers touch” means some hand written style font._\n\nThat's begging for Comic Sans! ;)\n\n"
    },
    {
      "time": "4 Jul 2008 — 11:22am",
      "content": "Looks more preacher than teacher to me.\n\nThe whole 'PET' concept is too complex and when you combine it with 4 lines of text you are getting ridiculous.\n\nMy rating: 1\n\n"
    },
    {
      "time": "4 Jul 2008 — 11:44am",
      "content": " **1**\n\nUninstall Logo Creator and hire a designer.\n\n"
    },
    {
      "time": "4 Jul 2008 — 1:25pm",
      "content": "Thanks so much for the feedback. I think I have a designer rating that is not on my scale but I think I can improve that.\n\nI have made a few changes based on your feedback just to see the differences. I do not know what would be rigid sans. I agree that they are busy. You should have seen the first sketches, those were more than busy.\n\nI look at the brush strokes and think they make it even more busy.\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET_uploadsample2_6253.jpg)\n\nMy wife is a teacher and uses comic sans all the time in her work sheets. I think it is too youthful.\n\nEverybody has to start somewhere.\n\n"
    },
    {
      "time": "4 Jul 2008 — 2:22pm",
      "content": "Comic Sans...bad idea. I am pretty sure he was joking. God I hope so. ha. Anywho...yes you picked the right forum, this is a place filled with people that love to design especially when it has type in it :D\n\nSo my suggestions to your logo. I actually think the symbol at the top (B) has some promise. I get it, it's a kid raising his hand and there's what looks like a desk or a japanese style character. Works ok enough. Develop that first. Keep the type simple. It is quite long like you said and if your goal is to have people come to your site, then write is as a ulr. \"professionalenglishteachers.com\" or \"ProfessionalEnglishTeachers.com\" Something along those lines. The that way you break your logo into 2 elements, a symbol and the type. it will make it much easier to deal with and less jumbled.\n\nThe typeface you choose always depends on your audience. But pick one that you think makes sense right now (keeping it simple and easy to read) and try what I said above. Then come back here and post it. If you want a good logo...you're going to have to redesign and submit a lot to get some advice considering you're not a designer. and obvious...sorry. But it's not a big deal as long as you're willing to put in some time! You'll learn a lot, I promise :)\n\nThings to think about:\n\nContrast. If all of the elements of your logo are the same size...it's boring. make one or the other much bigger or much darker.  \nColor. Design in black and white first. Think about color afterwards. You need a strong logo before you start playing with color. (but do keep possible color schemes in mind)\n\nCheers\n\n"
    },
    {
      "time": "4 Jul 2008 — 2:57pm",
      "content": "cslem1,  \nThanks for the constructive critique. The intent is for the symbol to be a teacher in front of a podium or desk. However, like David mentioned it could be more preacher than teacher. With a name and product like ProfessinalEnglishTeachers.com I can not use PET alone without confusing people and it is for a non English speaking community too. I want them to remember the name. The symbol is a creative creation from many sketches and tweaks of the letters PET. I use Adobe Illistrator. But if it would be better to start with just text than so be it. I don't know of many law firms with a shorter name than mine.\n\nThe “your way…” tag line is suppose to be saying the customer can learn English and pave the way to success in an English dominated international business market, it also can mean that the customer can tailor the English lessons to their needs. I think it is also has a better rhythm to have a short phrase after the long name when I read it out loud.\n\nI want to learn and am willing to put in the time to create something that this community would consider quality. I have read many of the posts here and am happy to have found such a ´great site.\n\n"
    },
    {
      "time": "4 Jul 2008 — 3:50pm",
      "content": "_Comic Sans...bad idea. I am pretty sure he was joking._\n\nI was only half joking ... I know that Comic Sans is many a teacher's favourite typeface, so it might actually be appealing to them. I understood that the target audience of the website is teachers, or is it? Anyway, I don't think Comic Sans will work for this. Perhaps something more classy, like the classical – maybe even cliché – British typefaces ... Gill Sans perhaps?\n\n"
    },
    {
      "time": "5 Jul 2008 — 4:49am",
      "content": "Here are some text only attempts. I like the more traditional text next to the script. I think all of them are nice. I do not know about the smaller font size in #5 for com. I think it is a bit of a distraction from the harmony. Number 4 and 5 are the same except for the size of English. I am in favor of the bigger one. Please rank these offerings. I know it is still an untrained hand but perhaps I am on to something.\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET%20fontTy_3490.jpg)\n\n#1 is for Jens the Gill Sans and I like it! It is even better white on black.\n\n"
    },
    {
      "time": "5 Jul 2008 — 10:24am",
      "content": "Here are 4 more. The last one should tell a story about how English bridges the gap, gets you there. The bridge is just a stick thing but does the idea have merit? In all of these I have tried to arrange the letters to be better spaced than just \"out of the box\" is it noticeably better or worse? I notice some fonts are better than others on the spacing. Would I call this kerning when I rearrange the letters one at a time?\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET%20fontTy8-11_5262.jpg)\n\n"
    },
    {
      "time": "5 Jul 2008 — 10:54am",
      "content": "trying a bit too hard. You don't want to change the size of the font too much. Makes the reader work too hard, which also makes it that much harder to read. I don't think you need to emphasize English too much. Especially in the middle of a \"sentence\". It again makes the reader work too hard to read it, feels very unprofessional.\n\nTry seeing how you can fit together the words, make it one unit rather than just throwing it together.\n\n"
    },
    {
      "time": "5 Jul 2008 — 11:08am",
      "content": "I want to echo cslem1's advice. I don't see why \"English\" has to be emphasized apart from \"Professional\" and \"Teachers.\" I would like to see one line of text with the name:\n\n\"Professional English Teachers\"\n\non one line. #10 has promise. Also, I think you should stay away from sans-serif typefaces. I think serif typefaces will communicate more professionalism and authority than sans.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "5 Jul 2008 — 1:48pm",
      "content": "Nick, Here are a few serif typefaces without focus on English outside of a little spacing. I think that 14 is most readable because the letters are wider but it also need more realestate. The last one I think is the least readable.\n\ncslem,  \n\"Try seeing how you can fit together the words, make it one unit rather than just throwing it together.\"\n\nI need some help understanding this. What is it you mean by fit together?\n\nThanks everyone for taking the time to comment on my efforts.\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET%20fontTy12-16_4019.jpg)\n\n"
    },
    {
      "time": "5 Jul 2008 — 9:37pm",
      "content": "What I mean by trying to make the words fit together is: study the shapes of the letters, it's all about flow. I can't show you without just doing it, but just trying googling (images) \"logos\". The best way to learn is to look at the pro's and see what you can pick up from them (don't copy, obviously).\n\nAlso, an important question- Is this logo only going on the web?? Because if so, also google (images) \"Web 2.0 logos\". I think you might get a lot of ideas from there. Of course you want to keep in mind professional, because going the web 2.0 way can be easy to make your logo look too cartoony.\n\n"
    },
    {
      "time": "6 Jul 2008 — 10:06am",
      "content": "You can get a great designer to give you a great logo for about $100 on this. It will be well, well worth your money.\n\n"
    },
    {
      "time": "6 Jul 2008 — 10:50am",
      "content": "Vanina, Thanks for the good advice. I know I can pay someone and in the end I still will, but then I learn nothing except how much faster it is to buy experience. I have already learned a lot about type. It is fun for me. As I learn here I get to appreciate what you all do. It is easy to copy, but to invent is the major league. I want to swing my bat here and see if I can hit anything. I can paint a beautiful protrait with oil and I thought I could try to develp something with pixels. It is proving more difficult.\n\n"
    },
    {
      "time": "7 Jul 2008 — 3:29am",
      "content": "I think either your F or G logo marks are a start. Try putting that mark centered over your #12 type treatment and see what it looks like. I think that would earn you a 2/10, granted there is still a long way to go.\n\nI would consider exploring a lot more ideas on your logo mark, your site is not easily referred to as PET, most users will probably pronounce the full name. Also why not pick a shorter domain name? Or at least a domain like ProET.com or something.\n\nSearch youtube for logo design showcase or portfolio. Also go on logo websites or professional designers' websites who specialize in logo work.\n\nI really like:  \nLouise Fili: [http://www.louisefili.com/logos/logos.html](http://web.archive.org/web/20131105025103/http:/www.louisefili.com/logos/logos.html \"http://www.louisefili.com/logos/logos.html\")  \nBorges: [http://www.borgeslettering.com](http://web.archive.org/web/20131105025103/http:/www.borgeslettering.com/ \"http://www.borgeslettering.com\")  \nNon-Format: [http://www.non-format.com/](http://web.archive.org/web/20131105025103/http:/www.non-format.com/ \"http://www.non-format.com/\")  \nSi Scott: [http://www.siscott.co.uk/](http://web.archive.org/web/20131105025103/http:/www.siscott.co.uk/ \"http://www.siscott.co.uk/\") & [http://www.youarebeautiful.co.uk/bitch\\_web/](http://web.archive.org/web/20131105025103/http:/www.youarebeautiful.co.uk/bitch_web/ \"http://www.youarebeautiful.co.uk/bitch\\_web/\")  \n33rpm: [http://www.33rpmdesign.com](http://web.archive.org/web/20131105025103/http:/www.33rpmdesign.com/ \"http://www.33rpmdesign.com\")  \nand Hydro 74: [http://www.hydro74.com/](http://web.archive.org/web/20131105025103/http:/www.hydro74.com/ \"http://www.hydro74.com/\")\n\n"
    },
    {
      "time": "7 Jul 2008 — 8:16am",
      "content": "Just a thought...\n\nwhen I was looking at your desired logo elements--\\> I noticed that the person could be represented by a \"P\" and the podium by a \"T\". Now for the \"e\"? Hmmmm. Perhaps a \"hand-drawn\" calligraphic \"e\" made to look like the teachers hand.\n\nThis is a quick sketch I did with a very bad Sharpie...but just to throw the rough concept out there!\n\n\\*\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PeT_3712.jpg)\n\n"
    },
    {
      "time": "7 Jul 2008 — 9:43am",
      "content": "Very first set, option b, there's something there with that simple line mark. That could work.\n\nBut everything else is falling into the 'filters and effects' trap.\n\nFor now, forget colors, forget 3D, forget brush effects, forget skewing, rotating, transforming.\n\nDon't think 'handwriting' as that really doesn't say a whole lot about teaching, unless you were aiming for a cursive angle, but even that doesn't seem to say 'english teacher'.\n\n"
    },
    {
      "time": "7 Jul 2008 — 10:24am",
      "content": "Keep it simple. I would go back to the drawing board. good luck.\n\n"
    },
    {
      "time": "7 Jul 2008 — 12:11pm",
      "content": "Trying to balance a tall logo with alot of text can be difficult. I didn't see PET until you pointed it out. You my want to look at some sort of icon that sells for you.\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET_5845.gif)\n\n"
    },
    {
      "time": "7 Jul 2008 — 3:37pm",
      "content": "Please, just hire a professional designer.\n\nDavid\n\n"
    },
    {
      "time": "7 Jul 2008 — 3:43pm",
      "content": "I agree with hiring a designer.I realize you want to learn yourself but your sort of jumping in on the last step of the learning process without actually learning everything first.\n\nPick up the logo Font & lettering bible. A lot of good advice and history and application.\n\n"
    },
    {
      "time": "7 Jul 2008 — 5:41pm",
      "content": "KC,\n\nThis may be 'fun' for you but if you are serious about the results, hire a designer. Teaching English may be fun for me but I would be bad at it. I have seen more promise in the three iterations by Vintage than anything you have posted. You cannot teach a lifetimes worth of design skills in a forum like this.\n\nSorry to be blunt but I imagine most here would agree. I hate elitism in design and believe that anyone can design and be a designer. The results however, may not be great but hopefully enjoyable.\n\n"
    },
    {
      "time": "7 Jul 2008 — 6:40pm",
      "content": "\"You cannot teach a lifetimes worth of design skills in a forum like this.\"\n\nJayyy is completely right. I was hoping that you would try to do some of your own research of logos that already exist and then give it an honest try. Logo design, however, is not simple, well good logo design...especially if you don't even know the basic principles of design. So I say if you are doing this for yourself and it's more about YOU doing the logo then research a lot and start over. If you are doing this for a client...hire a designer or at least a student.\n\nIf you decide to keep putting up logo drafts, I will continue to critique, otherwise I'd still like to see the finish product regardless of what you decide to do, so at least post a link when it's done!\n\nGood luck!  \nCourtney\n\n"
    },
    {
      "time": "7 Jul 2008 — 11:19pm",
      "content": "I like the direction of Dave Curry a.k.a. vintagesingman. It has somehow contemporary looks of Olympic logos. Which may not be the best but it's still very good for organisations (probably non profit).\n\nYes it's very clear that KC doesn't have any real life experience with logos. I'm always amazed how complicated people like this try to make their logos. We all live in a world surrounded by logos. We are annoyed by busy snail mail marketing spam in our mail boxes. They all reflect this kind of design. Any yet they still tend to overdo this.\n\nFact: logo symbol PET (I didn't see it either but I find it clever now) is very promising. VERY. Dave showed us how.\n\nYou don't want to emphasize English too much. Almost definitely not with using a different font unless they complement each other.\n\nIf you're not going to hire a designer I would at least suggest you start reading Robert Bringhurst's Elements of typographic style. Quick!\n\n----  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "8 Jul 2008 — 12:33am",
      "content": "Thanks so much for all the comments and input. I am doing this for myself, no client. No designer poser here. The next few are marks based on PET. I like O the best. Are these of any design value?\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET_minimizeJ-O_5779.jpg)\n\n"
    },
    {
      "time": "8 Jul 2008 — 1:30am",
      "content": "\"Search youtube for logo design showcase or portfolio. Also go on logo websites or professional designers’ websites who specialize in logo work.\"\n\nj\\_polo9,  \nI have looked a so many logos. They are almost always simple. I look at them in Black and White and see this. Most are just text. I have looked at lots of Web 2.0 stuff since cslem1 mentioned it. I have made a few but they seem unsuitable on this thread. I think I should avoid color.\n\nI have not just 4 or 5 or 6 letters but more of a paragraph for a name, 30 letters. But as an internet brand, the name is what people need to remember and a name like ProET.com is for me not as easy to remember and is already owned. In English PEteachers means something other than English, ProET ET means the movie, PET means pet. Outside of creating a non related name for my product I have few options to make it short, relevant, and memorable.\n\nThe use of P E T as a person in front of a podium I thought was clever. Not that \"PET\" has much value for me alone. The initials are secondary to mark but the use of the letters and their relevance to the name makes it for me an interesting, memorable and relevant mark. My last post of the negative space PET is less about the person and podium and more about drawing the reader(customers) in to discover what it is, and then remember it. I will never hire famous people to wear my mark and sell my product, it needs to draw the person in on it’s own. I know I will hire a designer to do the final work but I want to develop a few of my own ideas before I hand it all over. This project is not about me and a huge ego but it would be cool if I had a part in the creative process outside of money.\n\njayyy,  \nBlunt is ok, I like that. Rude is bad and you are not that at all. I understand my limitations but I am creative by nature and just need to try and see what pros think.\n\n“You cannot teach a lifetimes worth of design skills in a forum like this.” I studied Mechanical Engineering so I know what you mean. I think anyone who has completed a university degree program knows how little they really know.\n\ncslem1,  \nI will post my link for sure. The website name is already clear but I will be back to remind you all when it is up if you like. After all this is the first place I have presented it publicly.\n\nMarz, litera, vintagesignman,  \nIs my original person in front of a podium catching on as something better than before? Should this figure be refined as a mark?\n\n"
    },
    {
      "time": "8 Jul 2008 — 1:42am",
      "content": "Just text and color or with one of the teachers marks. A little web2.0ish\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/rwb2_6316.jpg)\n\nI think the neg space does not go with the text  \nThen the PET is also screaming to me about a dog or something (distraction for me)\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/bw2logos_6614.jpg)\n\n"
    },
    {
      "time": "8 Jul 2008 — 2:11am",
      "content": "lol the top one is web 1990ish. The colours are less bad on the bottom... but what is the design for?\n\nYour logotype is huge and the combo doesn't work. try one of the ones vintage sign man did. Your latest pet symbol has promise but it still needs to be designed... right now it is only a concept. You need to mess with different strokes and weights and combinations and variations and... etc. until you have something that is eye catching and memorable. right now it is a stick figure drawing.\n\n"
    },
    {
      "time": "8 Jul 2008 — 2:43am",
      "content": "LOL, I can not tell when something is 80s 90s or what. That is funny though.\n\nThe design is for freelance English teachers that want to land corporate clients in German or EU companies. The mark stand for freelancers that teach business English. That means it has to be a universal mark for teachers and communicate professionalism to corporate clients. I am considering other symbols for the mark like a neck tie.\n\nI will go talk to my stick figures some more :)\n\n"
    },
    {
      "time": "8 Jul 2008 — 3:14am",
      "content": "Of course you can't. That's why you're producing so much different things and that's why your attempts are not going anywhere yet...\n\nBy the brief I suggest you take vintagesignman 's approach. It works very well for organisations and will work in EU. The middle one without the web address to me is at 90% of being finished.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "8 Jul 2008 — 5:12am",
      "content": "Well, I have to say that your symbol has become pretty easily recognizable to me. If I see your icon somewhere else on the site...I know exactly what it's for, haha...which is great. So I think your symbol is at least something you want to keep, just refine...you just need to figure out how to \"attach\" the web address and not make it look like you did it in Word.\n\ncourtney\n\n"
    },
    {
      "time": "8 Jul 2008 — 7:41am",
      "content": "I think this is my best work yet, I like it, maybe it earns me a rating of 2.5/10. I am sure you will tell me when it is worse, only cold hard honesty on this thread ;)\n\nI think the new figure is integrated into the words nicely (as idea) but the weight of the strokes is too thin at the E and T. Each of OO-S are a little different but I tried to bring the letters together. Would you believe I did this in Word?\n\nI tried to handle the PET a little differently in each one. I think S is to \"7ish\" on the \"T\". Q-R I think loose the \"T\" too much, looks too much like an \"L\" or an \"I\".\n\nDesign T is the same as Q but with the mark.\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET%20Logo%20o-T_5722.jpg)\n\n"
    },
    {
      "time": "8 Jul 2008 — 7:53am",
      "content": "Here is T thickened up\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/Just%20U_4154.jpg)\n\n"
    },
    {
      "time": "8 Jul 2008 — 8:10am",
      "content": "Maybe instead of playing on a computer you should take a piece of paper and a pencil. You'll worry about the end implementation later. Designers normally do it this way.\n\nI don't like any of these especially not the one with the symbol and lettering, because I hate overdone logos when there are two visually emphasized parts. Have either one or the other. Not both.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "8 Jul 2008 — 8:59am",
      "content": "leachers?\n\n"
    },
    {
      "time": "8 Jul 2008 — 10:14am",
      "content": "The irony is that you are rendering the words illegible by employing so many tricks.\n\n"
    },
    {
      "time": "8 Jul 2008 — 10:58am",
      "content": "Miss Tiffany,  \nIs that true for examples OO and P?\n\nlitera  \nWhat do you find bad about OO or P?\n\nAlu,  \nI see leachers now too and do not like it.\n\n"
    },
    {
      "time": "8 Jul 2008 — 11:20am",
      "content": "Yes, it is true for all of those, including U.\n\n"
    },
    {
      "time": "8 Jul 2008 — 12:11pm",
      "content": "I don't say this often, but honestly you should hire a real designer. It'll be worth it, at least in the time saved coming up with concepts just to have them repeatedly shot down.\n\n- Lex\n\n"
    },
    {
      "time": "8 Jul 2008 — 12:18pm",
      "content": "KC -\n\nGood for you for coming to a place to learn. These forums have helped me a lot in my development in design skills. I think I've come some way since my first post about a year and a half ago, but I have a long way to go.\n\nHaving said that, I think that the advice has been given many times for you to scrap this design, sit down with a pencil and paper, and draw a logo. I haven't seen you do that. Instead, you have posted numerous iterations of the same design you first posted.\n\nI think it's safe to say that your concept is broken. It consistently receives feedback that points out fatal flaws in both design and execution. Unless you're willing to take the advice of people who have a lot more experience than you, then I can't see that you're engaging in this process in a way that could produce a good result.\n\nSo here is, once again, a bit of advice that has gone a long way for me in my design development:\n\nSit down with pencil and paper and draw some black and white logos. Then come back and let us see what you've done.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "8 Jul 2008 — 12:45pm",
      "content": "You have two problems you need to work on.\n\n1. An icon. Come up with an icon that you like. PET or no PET, but for heavens sake, don't try to turn your text into an icon by melting that jumble together.\n\n2. You have a lot of text! My advice is to look at these two problems separate but figure a way to bring them together. Readability is very important, if you add the .com after teachers it may come off as teachers.com\n\nPaper and pencil is a great way to work things out.  \nGood luck.\n\n"
    },
    {
      "time": "8 Jul 2008 — 1:49pm",
      "content": "KC,\n\nAfter a quick search on Google images I came across quite a few logos with a similar look to your \"stylized person\". Originality is key when it comes to an effective logo.\n\nI had a couple minutes to spare while I wait for my ride... I came up with this...\n\nGood luck with your logo. You definitely foudn the right place for constructive criticism! :)\n\nA.\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PET_5902.jpg)\n\n"
    },
    {
      "time": "8 Jul 2008 — 1:52pm",
      "content": "Oh... I forgot to mention something... a small piece of advice...  \nI'd stay away from graduated fills. Some effects/techniques really are best left to the pros.... not unlike starting a sentence with 'and'. Heehee! ;)\n\n"
    },
    {
      "time": "8 Jul 2008 — 2:04pm",
      "content": "I like the typewriter font — by itself.\n\n"
    },
    {
      "time": "8 Jul 2008 — 7:42pm",
      "content": "too, too much. try to think about the singular thing that makes this service unique and special. it always helps me to make a 3x3 matrix with symbols on one axis and adjectives that i think describe the company on the other. k.i.s.s., you dig? i agree with the drawing first bit. effective negative space is the way to go... think about how it would look on the eraser head of a pencil... it has to be that small as well as the size of an eighteen wheeler (in theory)... think about literature... the touch... the imprint certain instructors leave on your life... it always helps me to think of three adjectives and then do a... what is the word? BRAINSTORMING TREE? (get yerself three HUGE pieces of paper for each word and write down as many words that you can think of that correspond to each one, then try to connect all three????) it always helps me to do that. if you want to talk message me and i will talk to you all you likee.  \ns.e. myers\n\n"
    },
    {
      "time": "10 Jul 2008 — 3:47am",
      "content": "I hired a designer (a few days ago) and these are his drafts for me. Nothing final. I asked him if it was ok for me to post them and he said it was ok.\n\nI would like to hear your comments. I do not see anything that would fit on an eraser but I do not see that as ever possible if I insist on the text being in there. I thank you all so much for your time and honesty.\n\nMy critique is that I see extreme complexity in the figures and see that as a weak point for a logo, however, I do like the story they tell. The very simple red logo is more logoish but I find it boring and not telling the story the others do. Perhaps if it was the bust of one of the other figures with a tie.\n\nI have been pushing for the .com to be in everything, is this unnecessary?\n\nPlease rate and comment. Which is the strongest? Which tells the best story?\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PETLOGO1a2a_3484.jpg)\n  \n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PETLOGOa4a5_3873.jpg)\n  \n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/PETLOGOa6a7_3842.jpg)\n\n"
    },
    {
      "time": "10 Jul 2008 — 6:18am",
      "content": "Hmm, I think out of all these...I like a2 best. The only reason being that it has depth. But I don't think I'm digging the silhouettes. It's not unique, I see those silhouettes all over stock photo sites. (Not saying that's where your designer got them, but just saying it's not one of a kind) Also, the silhouettes seem very unprofessional because of their body language, they are all hunched over, they look more like teenagers dressed in suits. I think (If you haven't already) suggest that your \"designer\" try some examples with your symbol. You had something there...I think it was just a little hard for you to execute into a logo.\n\nAlso, the text used a4, in my opinion, doesn't work. Your text is so long and the condensed text is hard to read and especially will be when it's smaller.\n\nAnywho, I do think you are right about the complexity. They are too complex. I mean, my personal design preference is simplicity. You need something very simplistic that people can remember on its own. (That's what I was getting at with the problem of the silhouettes) I mean think about the famous logos...McDonalds...FedEx...Deutsche Bank. (The latter being the epitome of simplistic logo)\n\ncourtney\n\n"
    },
    {
      "time": "10 Jul 2008 — 9:27am",
      "content": "The new ones all look like clip art of business people. I don't see teacher or english in these at all.\n\nWhy not pick a nice font and just go with the name?\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/pet2_3723.jpg)\n\n ![](http://web.archive.org/web/20131105025103im_/http:/typophile.com/files/pet1_4313.jpg)\n\n"
    }
  ]
}
