{
  "id": "47073",
  "title": "InDesign and Transparency, it's destroying my typeface!",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’m quite positive that this question must come up frequently, but I’ve searched the depths of the internet to find a solution to my problem.\n\nWhenever a file is imported that needs to have its background knocked out (through either a PSD with no background, or a clipping mask in various other formats) the type on the page its on becomes sickly and thin in appearance.\n\nI have tried most everything to fix it, from my previous research such as placing the type on a higher layer, putting it on the same layer but changing the stacking order. And a few other things. These have no effect on my typeface oddity. It seems that my problem cant be solved with the usual fixes.\n\nI would very much appreciate any input or solutions that anyone here has.\n\nHumbly Yours,\n\nJeremy Lee\n\n [‹ troubles with opentype ligatures and cs3](http://web.archive.org/web/20081012051858/http:/www.typophile.com/node/46975 \"Go to previous forum topic\") [Background image for tracing? ›](http://web.archive.org/web/20081012051858/http:/www.typophile.com/node/47112 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012051858/http://www.typophile.com/user/33423\" title=\"View user profile.\">Jeremy_lee</a>",
  "time": "<br>",
  "uid": "33423",
  "comments": [
    {
      "time": " 4.Jul.2008 7.13am",
      "content": "If the text is on a higher layer it’s just a preview problem. No need to worry.\n\n"
    },
    {
      "time": " 4.Jul.2008 7.15am",
      "content": "Many thanks for the prompt reply, that is very good to know. I was wondering if there was a way to remedy the preview issue. It’s a slight bother, in trying to figure the layout with this strange emaciated typeface.\n\n"
    },
    {
      "time": " 4.Jul.2008 7.43am",
      "content": "\\>the type on the page its on becomes sickly and thin in appearance.\n\nMay seem a stupid thing to say, are you previewing the page at highest res?\n\n"
    },
    {
      "time": " 4.Jul.2008 7.56am",
      "content": "Most certainly I am, the other blocks of type look perfect except anything that appears on the same page as something transparent.\n\n"
    },
    {
      "time": " 5.Jul.2008 3.13pm",
      "content": "You didn’t mention the version of Indy you are using...\n\n"
    },
    {
      "time": " 7.Jul.2008 8.06am",
      "content": "May be an issue with Flattening. There are 3 default settings for flattening (to be found in Export Adobe PDF: Advanced: Transparancy Flattener) — Low, High and Medium. These act differently when parts of the layout are rasterized.\n\nYou can also make up your own setting(s) under Edit: Transparency Flattener Presets. Sliders give you options regarding the balance between raster and outline.  \nPlay around with this to find out what solves your problem.\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
