{
  "id": "47079",
  "title": "Typeface copyright issues.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A few legal questions related to typefaces that I’m still a bit...how can you say...thick on?\n\n1. Work is created on a school computer (since I work in the academic world) and a certain typeface is available. A student submits it for a book and it gets selected, wins a competition, have it included in a show, etc. Is there any potential for legal consequences, since the student used a typeface w/ an academic license?\n\n2. A question that some of my students are particularly interested in. Since you can find almost any typeface online illegally (i’m referring to torrents and other file sharing communities), if a student of mine download a typeface illegally, uses it for a project, and they create the work at home and not on a school computer...a. can they get in trouble for it legally? b. can I get in trouble as an educator, knowing that they did not purchase the typeface? c. if they face any legal issues, can their work be disqualified/kicked out of a competition, art show, etc\n\n3. If someone downloads typefaces from a file-sharing community, what are any/all legal consequences that they can face?\n\nAny other legal tidbits/suggestions/advice would be great. Thanks!\n\nNikita\n\n",
  "author": "<a href=\"/web/20090504210349/http://typophile.com/user/23247\" title=\"View user profile.\">Fantômas</a>",
  "time": "<br>",
  "uid": "23247",
  "comments": [
    {
      "time": " 4.Jul.2008 12.27pm",
      "content": "1. A student book into a contest and show doesn’t cease being a student book. So I see no issue here.\n\n2. Theoretically one could get in trouble, but it almost never happens. It’s very hard for type designers/foundries to track who is purchasing and using their fonts, and even then it’s rare for anyone to get sued.\n\n3. Because file sharing generally requires the user to upload the file to other users while downloading downloaders expose themselves to lawsuits for making a copyrighted work available. Penalties can be as high as $250,000 per work, and if a user is downloading a large collection of typefaces, theoretical damages could escalate into the tens of millions of dollars. The Record Industry has used these theoretical damages to strongarm students and into forking over their life savings and selling all of their assets rather than go to trial. But nobody outside of the RIAA actually pursues these kind of suits against individual downloaders; the likely penalty is corporate lawyers sending a cease-and-desist letter to the offending ISP or University, who then calls up the user and threatens to cut off internet access.\n\n"
    },
    {
      "time": " 4.Jul.2008 12.33pm",
      "content": "This thread probably needs to be shifted to “release”\n\n1. Will depend on the EULA - does the EULA prohibit commercial use? And does this use constitute commercial use?\n\n2. Bigger question - why would any teacher accept student work using unlicensed fonts? Don’t all students sign something that says they won’t plagiarize, copy, steal, and have to cite their sources?\n\n3. Depends, on the fonts, the profile of the use.\n\n"
    },
    {
      "time": " 4.Jul.2008 12.36pm",
      "content": "Not a legal advice, but the fonts that can be found for download from dubious sites are often not the official foundry versions. They get extracted from PDF or Flash files, autohinted, autokerned if at all, format-converted ... So basically if students work with these they are learning to work with less than optimal tools. It’s for their own good to work with decent material.\n\nMight be an opportunity to analyze font quality issues with your students, compare badly done typefaces with good ones &c.\n\nJens\n\n"
    },
    {
      "time": " 4.Jul.2008 12.38pm",
      "content": "More on 2.\n\nTeacher: “That’s an interesting font, looks familiar, what is it?”  \nStudent: “It’s Gotham!”  \nTeacher: “Did you pay for it?”  \nStudent: “No I downloaded it from the Web.”  \nTeacher: “That’s cheating – do it again.”\n\nor\n\nTeacher: “That’s an interesting font, looks familiar, what is it?”  \nStudent: “It’s Gotham!”  \nTeacher: “Did you pay for it?”  \nStudent: “No, daddy did.”  \nTeacher: “That’s cheating – do it again.”\n\n"
    },
    {
      "time": " 4.Jul.2008 12.56pm",
      "content": "\\> if a student of mine download a typeface illegally, uses it for a project, and they create the work at home and not on a school computer\n\nIllegal is Illegal. Very simple. Are you going to carry a gun illegally? Illegal is Illegal.\n\n"
    },
    {
      "time": " 4.Jul.2008 3.10pm",
      "content": "\\>Illegal is Illegal. Very simple. Are you going to carry a gun illegally? Illegal is Illegal.\n\nMaybe pot smoking is a better analogy. You know the students are smoking pot at home, but you kind of frown upon them lighting up in class. And listing “pot smoker” as a hobby in their resumes is kind of like using downloaded fonts in their portfolio.\n\nPS I love the new pic!\n\n"
    },
    {
      "time": " 5.Jul.2008 12.33pm",
      "content": "\\> Maybe pot smoking is a better analogy....\n\nAnd Smoking Guns? :)\n\n\\> PS I love the new pic!\n\nThe Dark Knight is here...\n\n"
    },
    {
      "time": " 5.Jul.2008 2.28pm",
      "content": "On 1. When the student’s work goes into the book to be published - who holds the copyright? Did the student sign an agreement to be in the book - if yes, what did that agreement say? If no, does the university/college/school/organization own its copyrighted material? Was the student advised of his/her rights.\n\nI ask this because of an essay I once wrote. I wrote it during a college course on the history of New York and the professor used it in a compilation. My compensation - a good grade and I no longer had any legal rights to my “own” work.\n\n2. This is such a difficult question in today’s world. Yes, illegal is illegal - and thanks to the Clintons we have a don’t ask, don’t tell policy as a normal way of life. It’s illegal. Some fonts are fine for personal work - and I love Jens response. Education is the best way to go for the future. An understanding of the hard work that went into creating the font (sorry guys, not everyone can make a font) the thought process of the personality of the letters - how they fit together - work together, etc. If the designer is alive - it would be great if you could get them to come in for a class to discuss type. What an opportunity.\n\n3. I would like to share, once again, the Quark story. They went after a computer specialist company in New York City. The “gurus” had bought about 12 copies of Quark. They installed them for one company and were paid. They submitted it to Quark under their own company’s name. When they were called into the next company to get them computer-ready — they used the same 12 copies. And they did this over and over and over and over... well, you get the picture. When Quark put out its next program and the upgrades kept coming in with the same serial numbers - they had a lawsuit to pursuit. They did and they won.  \nThe moral of this story: If it’s big enough to go after - they will.\n\nOT - hey Dark Knight - you ready to turn to the Dark Side?\n\n"
    },
    {
      "time": " 5.Jul.2008 10.57pm",
      "content": "<cite> 1. Will depend on the EULA - does the EULA prohibit commercial use? And does this use constitute commercial use? <cite></cite></cite>\n\nWhy would it depend on the EULA? The student is not a party to it.\n\n"
    },
    {
      "time": " 6.Jul.2008 4.57am",
      "content": "I can’t believe you are trying to form some kind of analogy with guns and drugs…\n\n"
    },
    {
      "time": " 6.Jul.2008 7.31am",
      "content": "Fonts don’t kill people. People kill fonts.\n\n"
    },
    {
      "time": " 6.Jul.2008 7.56am",
      "content": "\\>Why would it depend on the EULA? The student is not a party to it.\n\nThe original question...\n\n\\>1. Work is created on a school computer (since I work in the academic world) and a certain typeface is available. A student submits it for a book and it gets selected, wins a competition, have it included in a show, etc. **Is there any potential for legal consequences, since the student used a typeface w/ an academic license?**\n\nThe fact that the student is using the font under an academic license isn’t in dispute. Why wouldn’t they be using it under the terms of the academic license?\n\n\\>I can’t believe you are trying to form some kind of analogy with guns and drugs…\n\nThe school in question is in the US. If it were in England analogies would be based on pies, fish and chips and not paying to ride the tube, or stealing a policeman’s helmet.\n\n"
    },
    {
      "time": " 7.Jul.2008 7.11am",
      "content": "I wouldn’t dwell on the legalities/penalties with the students as an educator and focus on the fact that shouldn’t be doing that from a industry ethics standpoint. That will likely sink in better and hit closer to home.\n\n“Illegal is Illegal. Very simple.”\n\nNot sure which country you hail from, but at least in the US, IP law is hardly ’simple’.\n\n"
    },
    {
      "time": " 7.Jul.2008 7.52pm",
      "content": "Well, maybe you guys went to a different school than I did, but the way I saw it then, and still kind of see it now is that when you are in school- it’s all “fair game”. School is expensive enough and it is no time to be saving up 200 dollars so that you can get five weights of “Interstate”.\n\nOnce you are out in the real world it is up to you to risk getting caught with your hands in the cookie jar, but until then pay no attention to the man behind the curtain.\n\nAlthough I’m sure it is technically illegal on paper, I really don’t think type foundries have become so far removed from schools that they could sue students. So in effect it is legal until a foundry sues (and wins), which so far as I know they never have.\n\nImagine a publisher of sheet music suing a student for using a photocopy to win a recital!\n\n"
    },
    {
      "time": " 7.Jul.2008 8.34pm",
      "content": "Lantz, you describe the reality at many colleges, maybe even the one where Nikita is an Assistant Professor.\n\nBut I think what’s more interesting are the educators actions around this. At your school were the staff okay with it? Did they encourage it? eg. “You won’t get a job unless you use Interstate.” Did the practice ever get questioned? Were they okay with the downloaded fonts being used on school computers, or did they only turn a blind eye when they were installed on students own machines?\n\nWhen you went looking for a job - did the question of font choices in your portfolio ever come up?\n\n"
    },
    {
      "time": " 8.Jul.2008 12.14am",
      "content": "I totally agree with Lantz on this one, and I have been a typography teacher for 4 years in a well known french school. some posters here are extremely disconnected from reality. I am, for one, convinced that if today’s students in the whole world stopped using the fonts they could not afford in their learning time, most of you designers would be in big trouble.\n\nI do now own the license of the fonts I use for any job I do, but I didnt own any font while I was a student myself, and it was obvious that 99% of my students didnt own these either, but I honestly didnt care. I spent enough time explaining them that they have to get the license of a type at the moment they use it for a job or whatever, and I am sure most of them understood this point. If all of you guys are trying to tell me now that you owned the rights to all the fonts you were using as a student, you are either lying or very very rich, or you are using only Helvetica and Times. In any case, you are not what a student generally is: eager to learn and use the latest creations to be able to stay tuned to what’s being done, and completely broke. What if Van Gogh had no money at all to buy his paint tubes? I guess you would tell him to wait until he could.\n\ndr\n\n"
    },
    {
      "time": " 8.Jul.2008 6.24am",
      "content": "When I was a student, I either had to comp lettering up by hand, buy the Letraset and rub it down, or pay to have text galleys typeset by my local type shop. Stealing Letraset or stiffing the typesetter was never an option.\n\nI understand the pragmatic arguments that are used to justify students not licensing fonts, but I think they should realize how lucky they are to have so much available to them and that by living in this legal gray area, they actually get off pretty easy.\n\nAnd that hypothetical student who won the recital? They may indeed have been able to photocopy the sheet music from the school’s music library (that’s covered by the Fair Use doctrine), but I’m pretty sure they had to purchase or lease their violin. It’s a shaky analogy — is a font the music, or is it the instrument?\n\n— Kent.\n\n"
    },
    {
      "time": " 8.Jul.2008 8.16am",
      "content": "At my school, and probably most schools I would imagine, students can’t install anything on school computers. Also, the school used all proper protocols for getting the rights to the fonts they had (and they had quite a few). But if I turned in a project using one that wasn’t on the school computers, which I did a few times, the teachers never questioned it. They spent their time like most teachers probably would, talking about how I applied them in the project. As I’m sure we all know getting a font does not a project make, and learning how to use fonts, and finding the appropriate treatment of them, requires that you play with them and see how they look—whether you draw them by hand, or trace them in illustrator, or “steal” them.\n\nOf course no analogy is perfect, but I think the best analog of the violin is the computer, not the font, in this case. Copying sheet music from the library would be fair use, if it wasn’t public domain. I think copying a font, however you go about copying it, in the pursuit of education, is fair use too.\n\nAs I say though, everything changes when you get into the real world, as it should.\n\n"
    },
    {
      "time": " 8.Jul.2008 10.38am",
      "content": "sii,  \nI’m curious to know what lengths you went to in finding out where I work..;)\n\nSome great comments here. It is difficult to completely prevent students from having access to free typefaces, especially when they are so widely available. It’s even harder to prevent students from obtaining them on file-sharing networks.\n\nFrom an ethical standpoint, as a professor, if I find out that a student used a typeface obtained illegally, could I tell them to use another typeface or fail them for ’stealing’ a typeface? Yes, technically I can. I can also lecture about professional ethics, stealing, use of ’free’ typefaces, etc.\n\nBut, remembering my time as a student and how much money I had, I didn’t have enough to purchase typefaces. While I can’t order a student to purchase a typeface, should or rather, CAN I fail a project because they utilized a stolen typeface?\n\nAs Lantz said, a typeface doesn’t always make a project. On our machines at school we have a set of fully-licensed typefaces that students are welcome to. And, it’s a quite extensive set! In theory, a student should be able to find a typeface for any project. While it is the professor’s duty to educate student about ethical use of type, is it on their shoulder to prevent student’s from using typefaces found through illegal means? If the students used school equipment to illegally download/install fonts, that’s one story. But if they do it at home, on their own computer, should I still forbid the use of typefaces obtained in such a manner?\n\n"
    },
    {
      "time": " 8.Jul.2008 11.38am",
      "content": "\\>I’m curious to know what lengths you went to in finding out where I work..;)\n\nJust followed the link from your profile, to your web site, to your resume - three clicks - not a lot of effort. ;-)\n\nI was interested in your schools IP policy and what it said on the subject...\n\n[http://www.ccsu.edu/its/usersupport/PoliciesProcedures/University%20Rule...](http://web.archive.org/web/20090504210349/http:/www.ccsu.edu/its/usersupport/PoliciesProcedures/University%20Rules%20and%20Regulations%20Governing%20Computer%20Accounts%20and%20Equipment.htm \"http://www.ccsu.edu/its/usersupport/PoliciesProcedures/University%20Rules%20and%20Regulations%20Governing%20Computer%20Accounts%20and%20Equipment.htm\")\n\n"
    },
    {
      "time": " 8.Jul.2008 11.44am",
      "content": "Only three clicks? Damn you’re good! I hear the NSA has a few openings. ;)\n\nI doubt that a lot of people adhere to that policy. Besides, we’re designers right? The ’normal folk’ policies do not apply to us. Right...right..RIGHT??? :D\n\n"
    },
    {
      "time": " 8.Jul.2008 1.17pm",
      "content": "Numbers not necessarily corresponding to the original questions.\n\n(1) The content of an essay/paper is text. It is not the font. Therefore, any copyright issues would have to do with the content. Most teachers dictate 12pt Times New Roman (or similar), so it’s not a terribly big deal. I found Palatino or Garamond on most computers I ever used, so when I could I used them - especially Palatino, which has greater space between lines and looks very comparable to Times New Roman 12pt when at 11pt.\n\nIf the paper’s going to be put in a compilation, the student really doesn’t have any dictate as to the font used therein...digital copies are the thing nowadays, so it’ll get formatted however the rest of the book is formatted (literary journals sometimes make exceptions, but not often).\n\n(2) Teacher’s rules stand; were I a teacher, grading an essay, font wouldn’t even come into the picture, unless it were Comic Sans 20pt or something like that.\n\n(3) Now, if this is a graphic design project...slightly different, I guess. However, if the school provides all the applications/materials, and hence fonts...yeah. And like a lot of people here have said, it’s really hard to track this kind of stuff. When I do Photoshop work, I’ll typically set the height at 75% or so, which distorts the font even more, just as an example.\n\nSo I guess my final thoughts would be this: chances of getting caught are near nil, so it’s up to the teacher to give final say, I should think.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 8.Jul.2008 4.36pm",
      "content": "Are 99% of design students type thieves? Sure, but pointing that out won’t make type designers any richer. Instead, foundries should be looking to new business models.\n\nThere’s probably two reasons most students steal fonts: the urge to collect, and the feeling that they don’t have any good typefaces. There’s not a lot anyone can do about the urge to collect. But I think the right kind of marketing could help alleviate the feeling that they don’t have any good typefaces.\n\nI think only a few students have 100% pirated fonts on their computer. Most type teachers include something like Adobe’s Student Type Collection on their required materials list the first day of class, and being under $100, most students don’t have too big of a problem going out and getting it legitimately. I think the problem arises because, wisely, the Adobe Type Collection is mostly workhorse type families, and these are not overly exciting, especially in the hands of people who aren’t skilled at using them. So the solution is usually to believe there’s something wrong with those fonts, and that if you download 10,000 fonts then your problems will be solved.\n\nHalf the problem, then, is education — teachers need to show students early on how much power they can get out of a seemingly bland type family, and feel confident that they can do great work if they only have a few fonts installed on their system. The second thing that could help this problem is to fill the void in the marketplace — students want what’s new at Veer, or the latest House Ind. script. Most students are not going to get too excited about a classic multi-weight text family with old-style lining figures and support for some Eastern European language they’ve never heard of. I think a supplementary pack or packs that address this desire would do really well commercially. The key is that the fonts be up to the minute, reflecting what’s cool in graphic design at that exact time. Of course, a lot of students will steal type because they can, but maybe a lot of students are stealing type because there’s no product out there filling that void.\n\n"
    },
    {
      "time": " 8.Jul.2008 5.48pm",
      "content": "\\>_Most students are not going to get too excited about a classic multi-weight text family with old-style lining figures and support for some Eastern European language they’ve never heard of._\n\nUnless of course the student is studying on a proper graphic design course in the Czech Republic, Poland, Hungary, or Romania, for instance. There are quite a few of these. Some of them even have typography professors who teach them about the uses for old style vs. lining figures, etc.\n\n"
    },
    {
      "time": " 8.Jul.2008 6.17pm",
      "content": "Hi Dan!!\n\nHow are you doing?\n\n\\*waves all the way from Connecticut\n\n"
    },
    {
      "time": " 8.Jul.2008 7.21pm",
      "content": "\\>Besides, we’re designers right? The ’normal folk’ policies do not apply to us. Right...right..RIGHT??? :D\n\nAbsolutely Designers are special - at birth they are issued with what’s known as a “creative license” that exempts them from the rules of “normal folk” :-)\n\n"
    },
    {
      "time": " 8.Jul.2008 8.25pm",
      "content": "It’s quite alright to steal something if you can’t afford it because you’re a student, and won’t get caught because the people that own it are stupid enough to not protect their property and prosecute theft, and besides, they should be looking to new business models.\n\nAnd when you’re starting out your career, it’s also alright to use pirated software, because you’re still poor and paying off your student debt, and how can you make a profit if you don’t? And how can you compete against the establishment otherwise?\n\nAnd even when you’ve become established, it’s still OK to pirate, because you always have, and everyone else does (including the up-and-comers snapping at your heels), and anyone who pays for that stuff is stupid, and friends share their software don’t they, and graphic designers are underpaid anyway.\n\nAnd if you do occasionally pay for a font licence, well, that’s practically sainthood.\n\n"
    },
    {
      "time": " 8.Jul.2008 10.53pm",
      "content": "Simon, you original answer was:\n\n<cite> 1. Will depend on the EULA - does the EULA prohibit commercial use? And does this use constitute commercial use? <cite></cite></cite>\n\nThe school didn’t make a commercial use. The student’s relationship is with the school. The EULA may give the IP rights holder remedies against the school, but are you sure it gives rights against the student?\n\n"
    },
    {
      "time": " 9.Jul.2008 5.43am",
      "content": "Well said Nick.\n\n"
    },
    {
      "time": " 9.Jul.2008 10.16am",
      "content": "@ Dan: I don’t want to disparage support for multiple languages in any way, particularly ones that have taken a back seat to more dominant business languages. My purpose was to compare something that people in the type community get excited about vs. what a typical graphic design student is going to be excited about.\n\n@ Nick: I wish that everyone did pay for font licenses, as probably 99% of people on Typophile do. In the graphic design world, it’s something that is rarely confronted — you walk into an agency with 10,000 fonts on their system, and you know that it’s probably pirated, but what are you going to do? The options are to 1) prosecute aggressively, which is a financial impossibility for most foundries, and regardless of how right the foundries are, they’re going to be seen as raining on the parade of people who should be their customers 2) create a copy safeguard in the software, which will be easily hacked and shared on p2p networks 2 weeks after it’s released, or 3) develop a new means of distributing fonts, that encourages designers to purchase fonts.\n\nOne thing that makes stealing fonts really attractive is that it’s private: you get on a p2p network, move everything into your font management program, and it looks like you bought them legitimately. I work with designers all the time who have $100,000 of fonts on their system, but I’m not going to accuse them of stealing, even though it’s highly unlikely that they bought them. Maybe font foundries need to start publicly praising those clients who do purchase licenses. And perhaps there’s some way to publicly shame agencies and corporations that use fonts without proper licenses?\n\n"
    },
    {
      "time": " 9.Jul.2008 10.29am",
      "content": "\\>The school didn’t make a commercial use. The student’s relationship is with the school. The EULA may give the IP rights holder remedies against the school, but are you sure it gives rights against the student?\n\nI’ve not spent a ton of time looking at academic EULAs but the agreement would be between the foundry and the school, so any violation of the EULA would be the school’s issue. The school probably has some kind of agreement/contractual relationship with the student.\n\n"
    },
    {
      "time": " 9.Jul.2008 10.48am",
      "content": "\\> _typical graphic design student_\n\nSorry to keep harping on this, but it is this generalization that bothers me. Can someone please point out the typical graphic design student to me? Where I sit, the typical graphic design student is not American. Moreover, English is probably not his or her first-language either.\n\nI’ve studied design at four universities in three countries. I don’t think that the “typical” student is easy to pin down at all.\n\n"
    },
    {
      "time": " 9.Jul.2008 10.50am",
      "content": "OT: Hi Nikita, greet Connecticut for me. Sometimes, I miss New England. But never in the summer! Or the winter, for that matter…\n\n"
    },
    {
      "time": " 9.Jul.2008 11.34am",
      "content": "Lantz: the sheet music analogy does not work. Fonts are tools with value; sheet music doesn’t have a lot of its own value without a performer interpreting it. Is there a big market for pirated sheet music?\n\nFonts are a new kind of property; virtual, “intellectual” property that can be replicated infinitely, like software programs and songs. That analogy (pirated songs) holds up much better if you are going to make a comparison. Be wary of making comparisons between anything physical, which requires additional resources to reproduce (copy) and digital data which does not. It’s a new concept.\n\nFeelTheKern: Sadly you’ve missed the real reason students use fonts they don’t have licenses for: They can. Kent points out that there previously was no way to get these products/services for free, so students didn’t just sit around bitching and scheming ways to get them for free. Now that this concept of instant download, instant replication is so widespread, students don’t think about how what they are doing is illegal, unethical, problematic, or anything. What’s their motivation? They would prefer to lean on all the excuses Nick lists, and demonize anyone who suggests that they do the right thing. Many students and designers are equally blithe about using pirated copies of InDesign, Illustrator, etc. for all the same reasons, “It’s too expensive/a rip-off”, “everyone’s doing it”, or “nobody is going to arrest me”. They are excuses and rationalizations, not reasons. But they are widespread because there is very little enforcement or other electronic barrier to copying/downloading. If students could get their books, rent, food and clothing for free thru a magical TV, believe me they would.\n\nIn the case of a large agency with thousands of unlicensed fonts, that’s easy: get them licensed. How old or well-paid do you have to be to finally accept that tools and supplies cost money? If you don’t pay rent or utilities on your agency’s studio space, do you just get to skate along hoping the landlord doesn’t notice? “Yeah but our rent is rilly high so I shouldn’t have to pay”. ;) A well-run design house makes font purchases part of their budget, along with all the other costs that go into their business.\n\n"
    },
    {
      "time": " 9.Jul.2008 1.36pm",
      "content": "Ultimately, this goes back to the idea of foundries considering ways to enable students to utilize their typefaces legitimately without having to fork over for full licenses.\n\nOne could argue an explicit “free for educational use only” license might be beneficial here if the argument is that students will use these fonts anyways. At least with a ’free for education use only’ the concept of font licensing is reinforced with the students, even if no money is exchanged.\n\n"
    },
    {
      "time": " 9.Jul.2008 2.12pm",
      "content": "There are many products available to students (who show enrollment) at substantial discounts. Sometimes they are limited versions, but often they are no different from regular versions. I like this, because it acknowledges that students don’t have the same income as professionals, and it also acknowledges that the software is worth something and should be licensed legitimately. Foundries can offer similar discounts.\n\n“students will use the fonts anyway[s]” Is that really a reason to offer the fonts for free? To me it seems to be saying “oh well, we can’t make you buy them, so go ahead”. I don’t think that’s a realistic position for a business. It also says the fonts don’t really have any value.\n\nWhen students graduate, typically they stretch their student licenses out as long as possible. They aren’t eager to pay full prices for conferences, software, periodicals, etc. When they are forced to upgrade at full price, they do. With fonts, there’s no upgrade path, so those graduates can then use the fonts they got for free indefinitely (or until the next big format shakeup).\n\nMaybe what would be useful is limited (basic) versions of fonts at lower prices. Some foundries already offer a number of options.\n\nAnd then there’s the whole literacy issue: Too often it seems, someone is crying about how terribly expensive a font is, and it turns out they aren’t really looking at the prices, they’re just seeing the one, full OpenType family price and apparently assuming that is the price for one face. If people really want to license type, there are options, and they are affordable, if they would be bothered to shop around. But it’s unrealistic to expect unlimited choices, if one’s budget is limited.\n\n"
    },
    {
      "time": " 9.Jul.2008 2.47pm",
      "content": "“To me it seems to be saying “oh well, we can’t make you buy them, so go ahead”. I don’t think that’s a realistic position for a business. It also says the fonts don’t really have any value.”\n\nWell, if the argument is that people are ’pirating’ fonts at college anyways, than that’s ALREADY an issue. “Free and disregarding the licensing and ethical issues” seems to be a poorer solution than “Free but realized that these are commercial products and the foundry is explicitly granting them permission ONLY for student work” seems a tad better, even if the financial exchange AT THAT MOMENT is the same.\n\nHopefully, by being able to reinforce the concept of licensing, it may lead to more purchased licenses once the student enters the marketplace. Of course, that is the key there and I obviously have no data to back up my argument (or invalidate it, for that matter).\n\n“With fonts, there’s no upgrade path”\n\nRight. That’s what I’m actually suggesting...valid licenses with an upgrade path.\n\n“But it’s unrealistic to expect unlimited choices, if one’s budget is limited.”\n\nWell, there’s the rub. It IS realistic when it comes to digital media. It’s even been that way for a while with some analog media. When I was 12, and couldn’t afford the $13 CD, my friend dubbed it for me on to cassette. Right or wrong, it is realistic.\n\n"
    },
    {
      "time": " 9.Jul.2008 6.28pm",
      "content": "Wow. Discussions around here can really take off! Catching up is like a second job!\n\ncrossgrove: I know you are going to think this is odd, but way back in my first run through college one of my teachers announced (roughly—it’s been a while):\n\n“I heard there will be a guy selling pirated sheet music tomorrow in the parking lot. I don’t encourage anyone to support this illegal activity, but just in case… can you guys in the back hear me?… in case anyone is around the Funkhouser building parking lot between the hours of 1 and 5pm tomorrow, and you see him I just want you to know that the reason that HIS SHEET MUSIC is SO CHEAP is that it is photocopies and that is illegal copyright infringement.”\n\nApparently, in order to get sheet music you have to go to a music store and get the music in books, which are kind of expensive. I can’t speak for how helpful cheap sheet music is, because I studied painting, and can barely play a cd (remember cds?) much less a guitar.\n\nLike I said though, no analogy is perfect.\n\nI couldn’t agree more though that fonts are a new kind of property even different from digitally reproduced songs, which for the most part can’t really be used to produce anything else of value. Fonts are very special, since they aren’t really valuable until they are put to use to create something else. Kind of like sheet music (but not exactly because, again, no analogy is perfect.)\n\n:)\n\n"
    },
    {
      "time": " 9.Jul.2008 11.55pm",
      "content": "<cite> I’ve not spent a ton of time looking at academic EULAs but the agreement would be between the foundry and the school, so any violation of the EULA would be the school’s issue. </cite>\n\n“the agreement would be between the foundry and the school, so any violation of the EULA would be the school’s issue.” — That’s right, but unless the student somehow became bound by the EULA, the student’s conduct is not a “violation of the EULA”. If the foundry can point out a breach by the _school_, then it could take action against the _school_. Any rights of the foundry against the student must be found outside the EULA.\n\n<cite> The school probably has some kind of agreement/contractual relationship with the student.</cite>\n\nPossibly. It’s also possible the school, if sued, could turn around and sue the student.\n\n"
    },
    {
      "time": " 11.Jul.2008 6.47pm",
      "content": "@ Crossgrove: “Sadly you’ve missed the real reason students use fonts they don’t have licenses for: They can.”\n\nI ended my first post in this thread by saying “Of course, a lot of students will steal type because they can, but maybe a lot of students are stealing type because there’s no product out there filling that void.” So I agree with you to some extent, I just think there’s a lot of students who would be willing to buy type, but it’s not marketed to them in the right way. The best way, I think, to get students to buy type is to have it listed as required materials by their teachers. This would overcome a number of mental hurdles — it becomes like any another book they have to buy for their quarter/semester, it gets them in the habit of buying type, and they need to have it by a certain date, whereas downloading it off the internet is unreliable. If student font packs were marketed to teachers as packs for expressive typography, or editorial design, or beginning typography, advanced typography, etc, I think a lot of people would tell their students it was a required material. The basic idea is that a font pack could be a way to enrich the curriculum. Not that this would be the end-all solution to stopping piracy by any means, but it’s an idea. I think most students are like people who download music illegally — just because they have a lot of illegal music on their computer doesn’t mean they don’t have a shelf full of CDs and a closet full of band t-shirts. Of course there’s going to be that person who downloads 200,000 songs onto their hard drive, but most people don’t have the patience for that.\n\n@ Dan: “Can someone please point out the typical graphic design student to me? Where I sit, the typical graphic design student is not American. Moreover, English is probably not his or her first-language either.”\n\nMy point was that the typical graphic design student is not going to get terribly excited about typefaces of the workhorse variety, where I used the examples of something like old-style lining figures and an extended character set as something that makes a typeface very valuable but isn’t necessarily attractive to most design students. The typical graphic design student probably is not American, I agree — half my graduating class spoke a language other than English as their first language. But I think I was more interested in non-Latin scripts and extended character sets than anyone I went to school with (actually, the only one), and I’ve found that to be even more true since I started working. This could be due to the fetishizing of English as the language of high design, and it could just be that type plays a small role in the work of a lot of designers.\n\n"
    },
    {
      "time": " 12.Jul.2008 7.14am",
      "content": "\\> “If someone downloads typefaces from a file-sharing community, what are any/all legal consequences that they can face?”\n\nFantomas:\n\nCommercial foundries often sell fonts which are in fact public domain fonts. I recently made a list of “One Thousand Linotype Public Domain Fonts” which are as free as the birds:\n\nsee [http://www.sanskritweb.net/forgers/publicdomain.pdf](http://web.archive.org/web/20090504210349/http:/www.sanskritweb.net/forgers/publicdomain.pdf \"http://www.sanskritweb.net/forgers/publicdomain.pdf\")\n\nTo pay “licence fees” for public domain fonts is “strictly for the birds”.\n\n"
    },
    {
      "time": " 12.Jul.2008 9.25am",
      "content": "Oh, more comedy from Uli. A shame no one seems to have told Linotype the news.\n\n"
    },
    {
      "time": " 12.Jul.2008 10.22am",
      "content": "Another rationalisation for piracy: I’m not really a thief, just smarter than the dim-wits who think so.\n\n"
    },
    {
      "time": " 12.Jul.2008 10.31am",
      "content": "Here’s another: Yes officer, the jewelry doesn’t belong to me, but I haven’t worn it yet, so that’s not theft.\n\n"
    },
    {
      "time": " 12.Jul.2008 10.39am",
      "content": "When I was a student, it was really hard to steal type and they didn’t even lock the doors. Of course the type then was made by ATF so all you had to do was pocket 2 tons of lead and then drag a Vandercook out to your dorm room. Not that we were so vertuous then. It was just impossible. Somehow, we all did our projects legally and used only the few fonts available in the type lab.\n\nChrisL\n\n"
    },
    {
      "time": " 12.Jul.2008 10.53am",
      "content": "@ Nick Shinn: I don’t think anybody wants to argue that piracy should be accepted, but pointing out that stealing is unethical is not going to make you or anyone else any richer.\n\n"
    },
    {
      "time": " 12.Jul.2008 11.26am",
      "content": "Rationalizing that stealing is OK because other folks do it does make people poorer, though.\n\nChrisL\n\n"
    }
  ]
}
