{
  "id": "47097",
  "title": "Font composed of mostly parallel lines of equal length",
  "forum": "Design",
  "tags": [

  ],
  "content": "I want a font that looks something like this (neater though). I’m looking specifically for the _T_,_t_,_L_ and _l_ and maybe the _K_ and _k_.\n\n ![](http://web.archive.org/web/20081011053907im_/http:/www.typophile.com/files/tl-lines_samples-noblue_5943.resized.png)\n\n [‹ Questions about criteria for typeface design](http://web.archive.org/web/20081011053907/http:/www.typophile.com/node/47162 \"Go to previous forum topic\") [Logo re-design for a clothing company ›](http://web.archive.org/web/20081011053907/http:/www.typophile.com/node/47042 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011053907/http://www.typophile.com/user/19606\" title=\"View user profile.\">Thomas Levine</a>",
  "time": "<br>",
  "uid": "19606",
  "comments": [
    {
      "time": " 5.Jul.2008 9.46am",
      "content": "I was just looking for shaded type like this a few weeks ago, and my search was not so fruitful. The best I turned up was Lexon Xylo, along with Treasury, P22 Zebra Line Cut, Chevalier, and Calypso. But I’m hopeful that as usual someone will know something I don’t.\n\n"
    },
    {
      "time": " 5.Jul.2008 10.57am",
      "content": "I don’t want shaded type; I meant for those lines to be of equal length and weight. I want the type to be designed such that it doesn’t need outlines and that the lines can be of mostly equal length.\n\nIt should probably be based on some style of writing in which the angle of the pen doesn’t change.\n\n"
    },
    {
      "time": " 5.Jul.2008 3.03pm",
      "content": "[http://processtypefoundry.com/typefaces/findreplace/index.html](http://web.archive.org/web/20081011053907/http:/processtypefoundry.com/typefaces/findreplace/index.html \"http://processtypefoundry.com/typefaces/findreplace/index.html\")\n\n"
    },
    {
      "time": " 5.Jul.2008 3.04pm",
      "content": "[http://processtypefoundry.com/typefaces/findreplace/index.html](http://web.archive.org/web/20081011053907/http:/processtypefoundry.com/typefaces/findreplace/index.html \"http://processtypefoundry.com/typefaces/findreplace/index.html\")\n\n"
    },
    {
      "time": " 5.Jul.2008 8.00pm",
      "content": "Since you are only looking for a small number of letters, and you know exactly what you want, why don’t you have a go at drawing them! You can’t really go wrong with straight lines!\n\n"
    },
    {
      "time": " 6.Jul.2008 2.50am",
      "content": "I do agree with 1985, you don’t have always to use other people fonts!  \nWhy don t you give your drawing a try? You’ll get better and faster because you already know what you have in mind and it isn’t that hard to draw those letters.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": " 6.Jul.2008 4.40pm",
      "content": "I don’t really have something in mind; I just wrote them like that because I looked through a calligraphy book and chose one style in which mostly parallel lines of equal length could be used to write the letters. I wanted to see other ways that this had been done.\n\nI guess this hasn’t been done, though, so I should change my request: I want ideas of other writing styles in which these letters could neatly be constructed with mostly parallel lines of equal length.\n\nActually, anything without lots of curves should work if I let the lines overlap a lot, and this should allow me to choose from a rather wide range of styles, but I still feel like some style should work particularly well.\n\n"
    },
    {
      "time": " 7.Jul.2008 6.50pm",
      "content": "Although it’s not quite what you’re looking for, the standard OCR font on all my Spanish documents used a font similiar, though they were almost exclusively on checks, and so I don’t have an example...maybe someone else can post one. But it wasn’t just parallel, it was all vertical.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
