{
  "id": "47116",
  "title": "Critique - Untitled typeface",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi,\n\nI have been working on several different typefaces lately and have found myself sketching type all the time. I'd really like to find out how and where to learn type design properly. I've undertaken the task of designing a usable typeface.\n\nThe sample below was made from scratch and I tried not to look at other typefaces during the process.  \nI would appreciate some guidance or direction on type design as I am very unexperienced!\n\n ![](http://web.archive.org/web/20130819233610im_/http:/typophile.com/files/Picture_1_3624.jpg)\n\n",
  "author": "smongey",
  "time": "6 Jul 2008 — 4:38pm",
  "uid": "25012",
  "comments": [
    {
      "time": "7 Jul 2008 — 4:24pm",
      "content": "If it's any use.\n\n ![](http://web.archive.org/web/20130819233610im_/http:/typophile.com/files/Picture_6_5148.png)\n\nIs it worthwhile pursuing?\n\n"
    },
    {
      "time": "7 Jul 2008 — 11:48pm",
      "content": "Your basic design is solid, and pretty fresh for its category. The J particularly makes me happy.\n\nAll that remains, then, is to learn how to tweak your curves. There are a lot of visible bends where a curve meets a straight line. For example, look at the top of the P; you can tell exactly where the curve and the line meet. Check the joining node, and if the handles aren't lined up, straighten them out. If they are, but it still looks kind of pointy, then you'll want to use your eyes and make subtle changes to smooth it out. Pure geometry is often not in agreement with what you actually see. Study other fonts to see how they achieve this visual smoothness. If you're still working with one thick stroke, you'll need to convert it to outlines at some point so that you can adjust the inside and outside independently to really make it look right. You'll have to do that eventually anyway to make it into a font.\n\nIt looks like the top of your E accidentally got moved very slightly off level. In future, if you can get your stuff into a PDF to post, it will help you get better feedback here, because then people can examine the vectors more closely and be more sure of what they see.\n\n"
    },
    {
      "time": "8 Jul 2008 — 12:31am",
      "content": "Thanks for your feedback. I'll put up a pdf. I wasn't sure if jpegs were ok. I'll expand the strokes to outlines for tweaking because at the moment it is even all over. In a typeface like this, do I still need to add contrast or will that throw off the geometric style I'm going for?\n\n"
    },
    {
      "time": "8 Jul 2008 — 1:31am",
      "content": "Contrast can still help something like this, as long as it is so minimal as to be imperceptible. Try making your pen proportions something like 97% high by 100% wide, more or less. If you get that proportion just right, it should look _more_ even.  \nBe sure to save your original strokes before you convert them to outlines; they may often come in handy later.\n\n"
    },
    {
      "time": "12 Jul 2008 — 7:59am",
      "content": "\\> _I’d really like to find out how and where to learn type design properly._\n\nHere are two Post-graduate / MA courses in type design (both 1-year courses)\n\n- Type&Media at the [KABK](http://web.archive.org/web/20130819233610/http:/www.kabk.nl/studierichtingen/vervolgopleidingen/inhoudstudie/type_media/-/nl) in Den Haag (The Hague, The Netherlands)  \n- MA Typeface Design at the [University of Reading](http://web.archive.org/web/20130819233610/http:/www.reading.ac.uk/typography/pg-taught/typ-pgtmatypefacedesign.asp).\n\n"
    },
    {
      "time": "12 Jul 2008 — 8:07am",
      "content": "[Education](http://web.archive.org/web/20130819233610/http:/typophile.com/wiki/Education)\n\n"
    },
    {
      "time": "17 Jul 2008 — 2:32pm",
      "content": "Thanks for that. I was looking at the Reading course. It was mentioned a lot in that thread about what people are working on. Thanks for your feedback also. Much appreciated.\n\n"
    },
    {
      "time": "18 Jul 2008 — 3:19am",
      "content": "Hi Seán. There is something fairly similar already:\n\n ![](http://web.archive.org/web/20130819233610im_/http:/typophile.com/files/ChevDemi_4298.jpg)\n\n[Chevin DemiBold](http://web.archive.org/web/20130819233610/http:/www.type.co.uk/index.php?p=a_to_z_listing&let=*&id=7621)\n\nNick Cooke\n\n"
    },
    {
      "time": "18 Jul 2008 — 4:52am",
      "content": "you sunk my battleship :(\n\n"
    },
    {
      "time": "18 Jul 2008 — 7:03am",
      "content": "I think you should continue nevertheless, even if your typeface comes out resembling an existing one. You'll learn a lot in the process anyway, like when you encounter a design problem and look at similar faces to find out how the designers solved this problem there.\n\nAnd besides in typedesign it's the small nuances that can make a big difference.\n\nJens\n\n"
    },
    {
      "time": "18 Jul 2008 — 7:43am",
      "content": "Thanks, I appreciate that. I guess i'll try and be a bit more experimental with the lowercase. I can always look at Chevin and steer away from the way its lowercase is designed in order to hopefully come out with a slightly more original typeface.\n\n"
    },
    {
      "time": "18 Jul 2008 — 8:07am",
      "content": "Sorry Seán, I didn't mean to discourage you. Still, it's a good effort for a first typeface. As Jens says it's all part of the learning process, which is never a waste of time. That's the trouble with type design - producing something original requires as much thinking as actual drawing.\n\nNot looking at other typefaces while you're producing a design is a good idea. Looking at other typefaces then doing something different is also a good idea.\n\nKeep at it. It'll only take a lifetime, and you'll still be learning.\n\nNick Cooke\n\n"
    },
    {
      "time": "22 Jul 2008 — 1:13pm",
      "content": "There is no rule that you have to release any typeface at all, and it's really quite a good idea to develop your first typeface(s) with the understanding that you never will release them. In 10 years time you will cringe when you see your earliest student work on packaging, movie titles, etc. and all the naive and inept flaws will stick out at you. Take this opportunity to learn from everything you see, including Nick's counter-example. Go hunting for all the typefaces that have these traits. see how they are different as well as similar. Look at your point structure and try to refine it. Be willing to redraw things to get a better shape. Set your typeface in 7 point and see if it works (being honest about that is one of the hardest lessons).\n\nHonestly I'm confused when you say you're sketching all the time, because this typeface looks completely made of straight lines and circle segments. Nothing about it looks handmade. It looks machine-routed. One thing about type is that even if things all look the same thickness, they probably aren't. Joins between rounds and straights, or several diagonals typically get thinner to avoid the clogs like you have in the bottom of G and middle of K.\n\n"
    }
  ]
}
