{
  "id": "47111",
  "title": "Appropriate typefaces for medical brocheres etc",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all,\n\nI'm a graduate graphic designer who really wants a proper education in typography! I've been signing up to dozens of typography foundries and browsing forums to try and understand the complex world of type. This forum has been extremely helpful.\n\nI'm starting a project for a new small company in the medical field. It's a medication review which offers a more holistic service...it's hard to explain! They need a logo, brochure, letterhead, report, website etc.\n\nThe font has to be professional, simple, and maybe with a slightly 'caring' feel to it. It's aimed at medical professionals, hospitals etc. Doctors get heaps of promotional material so I think that using a quality font or complete font package, along with good graphic design, could help catch their eye.\n\nWhat would be a professional-yet-modern-yet-caring typeface? I'm open to using a combination of typefaces or a type family to create this brand.\n\nThanks for your time.\n\n",
  "author": "mlg85",
  "time": "6 Jul 2008 — 7:43am",
  "uid": "21560",
  "comments": [
    {
      "time": "6 Jul 2008 — 8:54am",
      "content": "A couple of suggestions:  \nOutType's Fresco comes to mind: I don't have it, but it looks good. Their website doesn't let me link to Fresco, but go here:  \n [http://www.ourtype.be/home.htm](http://web.archive.org/web/20150328193244/http:/www.ourtype.be/home.htm \"http://www.ourtype.be/home.htm\")\n\n...and wait for the Flash to load, then navigate to Fresco and its related faces.\n\nAlso on their site, check out Eva.\n\nor how about Adobe's [Cronos](http://web.archive.org/web/20150328193244/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1734)?\n\nGiven the wide use you're contemplating be sure to check the EULA's for any fonts you consider. You want to be sure you can use the fonts in PDFs, for example.\n\n"
    },
    {
      "time": "7 Jul 2008 — 9:56am",
      "content": "Geez, what a website John! Nice.\n\nmig85 i'm a graphic designer too and on my case would get a classic typeface. Palatino, Bodoni and so on and on are good classical typefaces. The only problem is that they are user a lot (Bodoni for example is part of Vogue's logo).  \nI would recommend you one of my ex-teacher [Dino dos Santos](http://web.archive.org/web/20150328193244/http:/www.dstype.com/). He has really good typefaces. Check them.\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": "9 Jul 2008 — 4:16am",
      "content": "Optima.\n\n"
    },
    {
      "time": "10 Jul 2008 — 11:03pm",
      "content": "Thanks I checked out all the fonts - now the hard part is deciding on one!\n\n"
    }
  ]
}
