{
  "id": "47121",
  "title": "Coffee in Buffalo",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "TypeCon is a little more than a week away, and I realise that I still don’t know where the best espresso is to be had in Buffalo. I mean seriously good, 25-second shots of chocolatey, crema-rich darkness, not Starbuck’s burnt black p\\*ss. Anyone know?\n\nWhile we’re on the topic of Buffalo, what restaurants are recommended?\n\nI’ve found a [traditional Roman rite Mass](http://web.archive.org/web/20080821122022/http:/www.the-latinmass.com/id137.html) for Sunday morning, so church is taken care of.\n\n [‹ Japnanse graphic design magazines and books](http://web.archive.org/web/20080821122022/http:/www.typophile.com/node/47354 \"Go to previous forum topic\") [MS ClearType fonts on Mac ›](http://web.archive.org/web/20080821122022/http:/www.typophile.com/node/47333 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821122022/http://www.typophile.com/user/1262\" title=\"View user profile.\">John Hudson</a>",
  "time": "<br>",
  "uid": "1262",
  "comments": [
    {
      "time": " 6.Jul.2008 8.22pm",
      "content": "Restaurant guide... [http://www.typecon.com/talk.php?id=156](http://web.archive.org/web/20080821122022/http:/www.typecon.com/talk.php?id=156 \"http://www.typecon.com/talk.php?id=156\")\n\nCheers, Si\n\n"
    },
    {
      "time": " 6.Jul.2008 8.43pm",
      "content": "On a related note: the Hyatt is next door to a real gym!  \n<cite>For guests interested in a more complete workout, we offer complimentary admission to the Olympia Health Club.</cite>\n\n"
    },
    {
      "time": " 6.Jul.2008 10.11pm",
      "content": "Staying healthy and TypeCon are not really concepts that fit together well. TypeCon, followed by detox/rehab might work. But anything that doesn’t cut into hot-tub time, ( [http://www.typecon.com/talk.php?id=165](http://web.archive.org/web/20080821122022/http:/www.typecon.com/talk.php?id=165 \"http://www.typecon.com/talk.php?id=165\")) is probably all good.\n\n"
    },
    {
      "time": " 6.Jul.2008 10.20pm",
      "content": "That sounds mighty good James!\n\nI have some hard core coffee contacts though, so I will send out a feeler. If I get something worth talking about I will post it.\n\nAt dinner time I may follow Ale. He has been doing his research.\n\n"
    },
    {
      "time": " 7.Jul.2008 6.32am",
      "content": "Talk of coffee in Buffalo has me pining for ligatures right here.\n\nCheers!\n\n"
    },
    {
      "time": " 7.Jul.2008 8.21am",
      "content": "Greetings!\n\nAlthough not a coffee drinker (sorry) Spot on Delaware & Chippawa would be the best bet for non-chain coffee (closest to the hotel)... another sure bet would be Blue Mountain Coffee on Elmwood Avenue at Utica (they roast their own) and a little North on Elmwood is Dolci (elmwood and Breckenridge).\n\nGood hunting!\n\n"
    },
    {
      "time": " 7.Jul.2008 9.26am",
      "content": "Eben, my food research is stopped. I m now limited to the Richard list. No sushi in Buffalo...\n\n"
    },
    {
      "time": " 7.Jul.2008 9.37am",
      "content": "sushi’s on the list, Ale. it’s jut not sit-down sushi. i’ve heard it’s actually very good sushi too, you just have to take it with you.\n\ni’ve compiled [my own list](http://web.archive.org/web/20080821122022/http:/www.pilcrowtype.com/blog/archives/19) to supplement the official food guide.\n\nas for coffee, i think a lot of the locals enjoy Tim Horton’s, but i’ve not tried it. it may be more american (Canadian) than you like...\n\n"
    },
    {
      "time": " 7.Jul.2008 9.43am",
      "content": "No sushi bar in Buffalo?\n\nOIC Kuni’s\n\n"
    },
    {
      "time": " 7.Jul.2008 10.02am",
      "content": "Lots of sushi in Buffalo... Wegmans (local mega grocery) on Amherst street even has a sushi chef on staff...\n\nLocations ranked in proximity to the hotel. 3 are within 4 blocks of each other in the elmwood village.\n\nKunis - 226 Lexington Ave. Buffalo  \nWasabi’s - Elmwood Avenue (same block as Dolci) - 752 Elmwood avenue, Buffalo  \nLexington Co-op - elmwood avenue, one block north from Dolci  \nPangaea Sushi & Sake Restaurant&nbsp;- 1260 Hertel Ave, Buffalo  \nSushi Nagasaki - 2305 Elmwood Ave, Kenmore\n\n"
    },
    {
      "time": " 7.Jul.2008 10.40am",
      "content": "hahaha, sorry, I said “no sushi in Buffalo”, I should say “the research on the webwas not so good when I was looking for a really good sushi place to die eating there” lol\n\nCarima, I promise to try them!\n\nAnyway, seems like greek food is excelent there. Thats enough to be happy.\n\n"
    },
    {
      "time": " 7.Jul.2008 10.44am",
      "content": "Thanks Carima!\n\n"
    },
    {
      "time": " 7.Jul.2008 11.23am",
      "content": "<cite>I was looking for a really good sushi place to die eating there</cite>\n\nNo Fugu Surprise from the street vendors Ale.\n\n"
    },
    {
      "time": " 7.Jul.2008 11.35am",
      "content": "Tim Hortons? Isn’t that like going to Dunkin Donuts?\n\n"
    },
    {
      "time": " 7.Jul.2008 11.58am",
      "content": "What about local breweries?\n\n"
    },
    {
      "time": " 7.Jul.2008 12.59pm",
      "content": "Paul: _as for coffee, i think a lot of the locals enjoy Tim Horton’s, but i’ve not tried it. it may be more american (Canadian) than you like..._\n\nGenerally speaking, I don’t drink drip or percolator coffee. Brew methods that kill most of the flavours in coffee just seem wrong to me. Coffee is like wine: the beans possess an extraordinary range and complexity of flavours. Good roasting and extraction will bring out the flavours, but most of the world’s coffee is effectively destroyed by the people who make it. Imagine if 95% of the world’s grape harvest were lumped together in large batches to produce largely indistinguishable cheap table wines.\n\nPeople often assume, since I’m always keen to locate the best cafe in any destination, that I must drink a lot of coffee. I don’t. Typically, I have one small espresso in the morning and another in the afternoon. I’m not downing gallons of the stuff to stay awake or excite my neurons. I want a fantastic taste experience, and I want to know where the beans have come from, who roasted them, and I want the drink made by someone who understands and cares about quality.\n\n"
    },
    {
      "time": " 7.Jul.2008 1.20pm",
      "content": "If you want to try brasilian coffee, I can easily bring you some.\n\n"
    },
    {
      "time": " 7.Jul.2008 1.34pm",
      "content": "_“Tim Hortons? Isn’t that like going to Dunkin Donuts?”_\n\nIf Dunkin Donuts dispenses a bitter, overheated, industrially caffeinated liquid and markets it as coffee … then you’re bang on. My theory is that Tim Horton’s customers insist on ordering a [double-double](http://web.archive.org/web/20080821122022/http:/www.cbc.ca/arts/story/2004/06/30/doubledouble040630.html) (double cream, double sugar) in order to consume a beverage that’s just marginally palatable.\n\n"
    },
    {
      "time": " 7.Jul.2008 2.24pm",
      "content": "_What about local breweries?_\n\nFlying Bison  \n [http://www.flyingbisonbrewing.com/](http://web.archive.org/web/20080821122022/http:/www.flyingbisonbrewing.com/ \"http://www.flyingbisonbrewing.com/\")\n\nPearl St Brew Pub  \n [http://www.pubcrawler.com/Template/ReviewWC.cfm/flat/BrewerID=101489](http://web.archive.org/web/20080821122022/http:/www.pubcrawler.com/Template/ReviewWC.cfm/flat/BrewerID=101489 \"http://www.pubcrawler.com/Template/ReviewWC.cfm/flat/BrewerID=101489\")\n\nVillage Beer Merchant  \n [http://www.yelp.com/biz/village-beer-merchant-buffalo](http://web.archive.org/web/20080821122022/http:/www.yelp.com/biz/village-beer-merchant-buffalo \"http://www.yelp.com/biz/village-beer-merchant-buffalo\")\n\nBuffalo Brew Pub  \n [http://www.buffalobrewpub.com/](http://web.archive.org/web/20080821122022/http:/www.buffalobrewpub.com/ \"http://www.buffalobrewpub.com/\")\n\ncome back in August for  \n [http://www.buffalobrewfest.com/](http://web.archive.org/web/20080821122022/http:/www.buffalobrewfest.com/ \"http://www.buffalobrewfest.com/\")\n\n"
    },
    {
      "time": " 7.Jul.2008 2.31pm",
      "content": "_My theory is that Tim Horton’s customers insist on ordering a double-double (double cream, double sugar) in order to consume a beverage that’s just marginally palatable._\n\nhehe. shows how much i know about coffee!\n\n"
    },
    {
      "time": " 7.Jul.2008 2.39pm",
      "content": "Thank you very much Richard! :)\n\n"
    },
    {
      "time": " 7.Jul.2008 2.40pm",
      "content": "\\>What about local breweries?\n\nMake mine a Venti!\n\n"
    },
    {
      "time": " 7.Jul.2008 2.58pm",
      "content": "2 best bets for Coffee barista style near the hotel:\n\nSpot Coffee on Delaware is good  \n [http://spotcoffee.com/city.html#](http://web.archive.org/web/20080821122022/http:/spotcoffee.com/city.html# \"http://spotcoffee.com/city.html#\")\n\na block plus up Main st from the conference hotel is Chow Chocolat which does a great latte  \n [http://outside.in/places/chow-chocolat-2-buffalo](http://web.archive.org/web/20080821122022/http:/outside.in/places/chow-chocolat-2-buffalo \"http://outside.in/places/chow-chocolat-2-buffalo\")\n\n"
    },
    {
      "time": " 7.Jul.2008 3.26pm",
      "content": "I’m with you John — we used to have a coffee roaster in Seattle called Torrefazione that had a few storefronts. It was very good, but bought out by Charbucks and later shut down (rumor was they wanted Torrefazione’s access to grocery store shelves).  \nOne of their stores was a half block from our Fremont offices and the after-lunch shot of espresso was very good & is now very missed. Even in Seattle — supposedly a US coffee haven — the Peet’s and Charbucks don’t know how to pour a shot of espresso. They’ll have only paper cups or full size mugs. Not a good solution. With the best espresso shots you get interesting floral notes similar to good quality dark chocolate.\n\n"
    },
    {
      "time": " 7.Jul.2008 4.14pm",
      "content": "John - The next time you are in San Francisco, you must try Blue Bottle (they use the Japanese siphon method).\n\n[http://tinyurl.com/6623a7](http://web.archive.org/web/20080821122022/http:/tinyurl.com/6623a7 \"http://tinyurl.com/6623a7\")\n\n"
    },
    {
      "time": " 7.Jul.2008 4.22pm",
      "content": "Those of us who can barely think straight before noon will still be able to just chug whatever the hotel serves up at the breakfast bar, right?\n\n"
    },
    {
      "time": " 7.Jul.2008 6.19pm",
      "content": "I am in John’s camp as well. I called around and the standard that John is hoping for probably doesn’t exist in Buffalo. Which is no shame on Buffalo because it’s rare as heck! Depending on my caffeine need I may just go with tea or like James down the drip & think of TypeCon.\n\nZara, have you tried the siphon brew?\n\nFredrico, I don’t know if we can get it brewed but we could try.\n\nIced Coffee made in the way the NYT talked about it a while ago might be the very best thing of all.\n\nI am going to be so hot!!! It’s below 60 here and I am roasting!\n\n"
    },
    {
      "time": " 7.Jul.2008 6.48pm",
      "content": "You can always bring your own rig and make it in your room. I don’t drink coffee anymore, but I love my Assam tea and would rather not have to rely on being able to pay someone to make a decent cup.\n\n"
    },
    {
      "time": " 7.Jul.2008 6.53pm",
      "content": "<cite>I am going to be so hot!!! It’s below 60 here and I am roasting!</cite>\n\nI hope those temperatures hold out: I fly to Vancouver for a Canada/Alaska cruise right after I get back from Typecon.\n\n"
    },
    {
      "time": " 7.Jul.2008 7.40pm",
      "content": "\\>You can always bring your own rig and make it in your room.\n\nDo I smell a TypeCon battle brewing?\n\n"
    },
    {
      "time": " 8.Jul.2008 5.16am",
      "content": "Just wanted to say for the record that I’m jealous of all of your going to Typecon...I just got back from 6 months abroad...so I’m am beyond poor, hopefully next year...next year. I’ll have to make sure to take notes on coffee places though =)  \ncourtney\n\n"
    },
    {
      "time": " 8.Jul.2008 6.25am",
      "content": "Hey, Mark — I usually just get by with whatever teabags are around during conferences and just chalk it up to travel. But this year, I’m driving to TypeCon, so now you’ve got me seriously thinking about bringing my teapot and one of my favorite Assams or Ceylons.\n\n— K.\n\n"
    },
    {
      "time": " 8.Jul.2008 6.43am",
      "content": "Hey Kent, for those of us who can’t get there this year, will there be any recording of presentations?\n\nCoffee is for addicts. Now green tea, that is the nectar of the gods...\n\n"
    },
    {
      "time": " 8.Jul.2008 6.52am",
      "content": "Coffee in Buffalo?\n\nBetty’s on Virginal Street( [http://www.bettysbuffalo.com](http://web.archive.org/web/20080821122022/http:/www.bettysbuffalo.com/ \"http://www.bettysbuffalo.com\")) serves a great Cuban-style coffee. Although I am not coffee-expert I do like in black and strong!\n\nMost local folks can get by with the Spot coffee within walking from the Hotel— it is better than Starbucks (which is across the street).\n\n"
    },
    {
      "time": " 8.Jul.2008 10.38am",
      "content": "Bill —\n\nI’m bummed that you (and Chris and Thomas) won’t be joining us this year. Won’t be the same without you.\n\nI don’t believe that there will be any official, concerted effort at recording sessions. Unfortunately, we just don’t have the volunteer resources. More critically, there is no structure or capability yet to manage and publish any recordings.\n\nThere may be some individual initiatives to record certain sessions, coordinated through the sound booth. That’s been done before. Tamye or Stephen might have a better idea. I think Eben might have volunteered to do something, but I don’t know if anything came of it. Eben?\n\nI do know that there will be an official, concerted effort at blogging this year, through the new and improved TypeCon site. I believe that Si is going to be spearheading that and is recruiting a team of bloggers.\n\n— K.\n\n"
    },
    {
      "time": " 8.Jul.2008 1.27pm",
      "content": "Well, my suggestion in the past has been to record the sound. Then could the slides be put with sound? I don’t know how complicated that is, but people already have slides, and anything with a mike shouldn’t be hard to record. It’s probably way more trouble than I think, but maybe not.\n\nIf the speaker would say ’change slide’ or ’slide 2’ and such, then posting the audio file and slides, the viewer could coordinate it him or herself, with no additional labor needed beyond the posting the audio file and slides.\n\n"
    },
    {
      "time": " 8.Jul.2008 2.30pm",
      "content": "Coffee, heck!!\n\nWhat about good local beer in Buffalo? I’m looking, as John Hudson is in coffee, for that “fantastic taste experience.” Not to get zonked.\n\n& while we are at it, does Buffalo have any kind of free jazz scene? Or any other good jazz scene?\n\nsee you all soon.\n\npowers\n\n"
    },
    {
      "time": " 8.Jul.2008 2.48pm",
      "content": "_Now green tea, that is the nectar of the gods..._\n\nI wish I liked tea more. I have friends who are serious tea drinkers, and I’m impressed when they guide me through the taste development of some complex and carefully brewed tea. But I find even the best teas I have tried have a thin quality that I really don’t care for much. While it is fascinating how the taste will develop over quarter of an hour, so that each cup is quite different, I don’t actually _like_ the taste. My favourite methods of making coffee are the ones that significantly thicken the density of the liquid, which may be another indication of why I’m not a tea drinker: tea is too much like flavoured water.\n\n"
    },
    {
      "time": " 8.Jul.2008 4.14pm",
      "content": "_What about good local beer in Buffalo?_  \nsee earlier post in this thread\n\n_Or any other good jazz scene?_  \nDepends on when.  \nNot sure how current the website is, but this place is legendary  \n [http://www.coloredmusiciansclub.org/](http://web.archive.org/web/20080821122022/http:/www.coloredmusiciansclub.org/ \"http://www.coloredmusiciansclub.org/\")  \nor if you want to skip out of TypeCon on Sunday (not suggesting that)  \n [http://albrightknox.org/Jazz/jazz2008.html](http://web.archive.org/web/20080821122022/http:/albrightknox.org/Jazz/jazz2008.html \"http://albrightknox.org/Jazz/jazz2008.html\")  \nor for Django style gypsy jazz a free show before Pecha Kucha on Tuesday  \n [http://www.babikjazz.com/calendar.html](http://web.archive.org/web/20080821122022/http:/www.babikjazz.com/calendar.html \"http://www.babikjazz.com/calendar.html\")\n\n"
    },
    {
      "time": " 8.Jul.2008 4.34pm",
      "content": "OK, Buffalites (?), a question: can we make it to Elmwood Village / Bidwell Park for Babik and then to Hallwalls Cinema easily? If it can be done, I’m up for sharing cabs etc. (I found on G maps Hallwalls, but the first location escaped me)\n\n"
    },
    {
      "time": " 8.Jul.2008 4.49pm",
      "content": "Hi there,\n\nMy name is Pam and I am Mark’s sig oth. I hope you don’t mind — I saw the thread topic and grabbed the laptop because I wanted to jump in and recommend Caffe Aroma at 957 Elmwood. It’s a small non-chain coffee joint with an independent bookstore next door called Talking Leaves. When I interviewed for my new job at the Albright-Knox I was taken there for breakfast. I noted that several members of the museum staff were stopping in on their way to work. The ambiance was great and I made a note to visit again when I could grab a cup of tea and browse the bookstore.\n\nI look forward to meeting all of you next week!\n\nPam\n\n"
    },
    {
      "time": " 8.Jul.2008 5.10pm",
      "content": "Yes Gerry, it is a 10 minute drive. As a Buffalonian, I live near Bidwell Parkway (right near FL Wright Heath House on FLW map [http://www.typecon.com/hotel.php](http://web.archive.org/web/20080821122022/http:/www.typecon.com/hotel.php \"http://www.typecon.com/hotel.php\") ) Cafe Aroma looks out onto where the concerts are at Bidwell Pkwy.\n\nI may be going to the RIT tour [http://typophile.com/node/46808](http://web.archive.org/web/20080821122022/http:/typophile.com/node/46808 \"http://typophile.com/node/46808\") but should be back in time. You can catch a ride with me.\n\n"
    },
    {
      "time": " 8.Jul.2008 5.26pm",
      "content": "Of course — I got confused. Clearly Buffalite is what Buffalonians are made out of.\n\nNext week sounds better by the hour. Thanks!\n\n"
    },
    {
      "time": " 8.Jul.2008 5.28pm",
      "content": "It just occurred to me that I didn’t check on the parking situation at the hotel: do we need to reserve a space in the garage ahead of time?\n\n"
    },
    {
      "time": " 8.Jul.2008 5.44pm",
      "content": "James, there should be no issue getting a space, and the ramp is right across the street from the hotel.\n\n[http://buffalo.hyatt.com/hyatt/hotels/services/parking/index.jsp](http://web.archive.org/web/20080821122022/http:/buffalo.hyatt.com/hyatt/hotels/services/parking/index.jsp \"http://buffalo.hyatt.com/hyatt/hotels/services/parking/index.jsp\")\n\nPull up right in front of the Hyatt, go inside, check in and tell them you want the parking ramp in/out deal (unless you want to park it the whole time and not use it at all). It’s $14 a day for in-and-out privileges, and the hotel will give you the passes and charge it directly to your room bill. Once you get your pass, leave your bags with the bellman while you zoom across the street and park.\n\nThere are also outdoor lots close to the hotel for those who just want to park for the day or a few hours.\n\n"
    },
    {
      "time": " 9.Jul.2008 12.53am",
      "content": "Pam, looking forward to meeting you too!\n\nBill, as far as I know there is no concerted effort at recording. It would be easy to do on some level and yet hard to do really well. I will not have time to look into it but dedicated 1GB+ drive and a laptop might be enough ( depending on compression ) to make it happen. A set and forget kind of model... The other side though is you would have to get speakers to say Okay to it and make clear how the recording would be used etc. Bill, my suggestion is if you want it to happen be the person that does it. The recording I have of the Typecrit from last year was made by a participant and then offered afterwards. I do feel lucky to have it though! Anybody with a laptop, sound recording software ( wiretap on the mac might be a good choice) and the ability to burn off archives each night could make this happen.\n\nI like both the green tea (and venerate it) AND the coffee. And the beer. And the Sushi. And the Melons... A (no longer) secret hope of mine is that I may get to taste a real cantaloupe melon when I am at Reading on while traveling. What we call cantaloupe in the USA is not the same thing at all. I especially would like a [Charentais!](http://web.archive.org/web/20080821122022/http:/rubbahslippahsinitaly.blogspot.com/2006/08/charentais-melon-soup.html)\n\n"
    },
    {
      "time": " 9.Jul.2008 4.32am",
      "content": "I like coffee too—just tweaking the addicts :) I am mainly a tea drinker, though.\n\n\\>Bill, my suggestion is if you want it to happen be the person that does it.\n\nAs I mentioned above, I won’t be able to make it to TypeCon this year. Maybe next year...\n\n"
    },
    {
      "time": " 9.Jul.2008 9.48am",
      "content": "Thanks, Rich. I overlooked that bit about the brews amidst all the chat about the Evil Bean. I’ll check out the brews, one at breakfast, one later on.\n\n& thanks for the jazz notes, too. I’m sorry to miss both the gypsy jazz and the Pecha Kucha. & I’ll miss the Sunday show, too, for I must leave Saturday evening. It is SO beautiful here in Minnesota this time of year that I have to have at least one weekend day in the garden and the lake. I’m sure a Buffalonian can understand that.\n\npowsers\n\n"
    },
    {
      "time": " 9.Jul.2008 4.09pm",
      "content": "“I’m bummed that you (and Chris and Thomas) won’t be joining us this year. “\n\nNot half as bummed as I am about it, Kent!\n\nChrisL\n\n"
    },
    {
      "time": " 9.Jul.2008 4.40pm",
      "content": "Can I get some Buffalite souvenirs for the kids?\n\n"
    },
    {
      "time": " 9.Jul.2008 5.57pm",
      "content": "William Berkson...  \n“Coffee is for addicts.”\n\nYou say that as if it’s a bad thing.\n\nJason C\n\n"
    },
    {
      "time": " 9.Jul.2008 5.58pm",
      "content": "And did Si say a brewing competition? If I knew that was happening, I’d be packing my press now!\n\n"
    },
    {
      "time": " 9.Jul.2008 7.45pm",
      "content": "Hi all — this will be my first TypeCon — but — I’ve been in Buffalo 8 years now... thought I’d throw in my 2 cents. Sorry for the blown out post — I’m procrastinating on getting some work done. ;)\n\n- **Coffee** — Spot, downtown (Delaware and Chippewa) is your best bet. There’s a great little hole-in-the-wall (and I mean that in the kindest way) coffee shop on the north/west side of Allen St. and Elmwood Ave.\n- **Sushi** — definitely Kuni’s To-Go... Pangea is a second runner up but a bit of a trek from the hotel.\n- **Diner** — hit up the Town Restaurant (Elmwood and Allen St.) for the classic diner experience — or Betty’s on Virginia (2 blks west of Elmwood) for something a bit more modern and artsy. Both are great.\n- **Beer** — my vote is on Flying Bison. It is a little bit out of the way... but worth it. Saturday afternoon is unofficial customer appreciation day at the brewery — translation — stop in, hang out for an hour, talk to the brewers, sample all the beers on tap and take a growler to go. Second runner of course is Pearl Street — more of a restaurant/brew-pub... as opposed to FB’s straight up brewery. Village Beer Merchant has a great selection (a bit pricey) of bottled brews and something like 8 or so regional beers on tap — again fill a growler. They also have deli-style food.\n- **Best Bar/Food/Music Strip** — Allen Street (west or east of Elmwood Ave)... plenty to choose from... pubs, dives, live music (Nietszche’s or Allen St. Hardware), etc. Worth the handful of blocks hike north of the hotel. Chippewa is good too — but a bit young-n-rowdy-club for my tastes.\n- **Musical Treat** — Mickey Hart (drummer of the Grateful Dead) is playing for free downtown on Thursday - part of the Thursday At The Square series. Outdoor concert with beer and food tents. I wouldn’t miss that — but I’m a fan.\n- **Shameless Self Promotion** — If you’re here early (like this Friday) we’re having an opening reception for **[TypeIsArt.com](http://web.archive.org/web/20080821122022/http:/www.typeisart.com/)** at **[SP@CE224](http://web.archive.org/web/20080821122022/http:/www.224allen.com/)** (224 Allen Street) from 7-10PM. The show will be up thru the 19th so stop by any evening 6-9PM. There may be a closing reception on the 19th and there may be a keg of Flying Bison brew there... but only time will tell.  \n\n"
    },
    {
      "time": " 9.Jul.2008 9.15pm",
      "content": "the “hole in the wall” near the corner of allen and elmwood ( i don’t know the name, but it has a small red and black awning on it)  \ndoes have really good espresso, and the other place i go when in buffalo is the aforementioned Aroma Cafe at elmwood and bidwell.\n\n"
    },
    {
      "time": " 10.Jul.2008 6.49am",
      "content": "[More Coffee and tea in Buffalo info](http://web.archive.org/web/20080821122022/http:/www.yelp.com/search?find_desc=&rpp=10&find_loc=Buffalo%2C+Ny&cflt=coffee)\n\n"
    },
    {
      "time": " 10.Jul.2008 4.26pm",
      "content": "Thanks for all the excellent info!\n\n"
    },
    {
      "time": " 10.Jul.2008 7.55pm",
      "content": "I’m not a fan of the Town — I just don’t understand the appeal, and the food’s mediocre at best. If you do go there, don’t get anything with bacon, unless you like translucent strips of fat with just a little bit of meat attached to it. They have the WORST bacon!\n\nThere’s been some mention of the Elmwood Village, and there are several other good restaurants in that area. Saigon Cafe for Vietnamese, India Gate for Indian (just a few doors down towards Forest Ave, which marks the border of the Elmwood village area), and Pano’s which is kind of a local landmark which was originally a tiny diner and is now in a bigger building, and more upscale.\n\nIf you go north on elmwood past Forest a few blocks, you’ll be at the Albright Knox Art Gallery, which is not to be missed (free admission on Fridays’, too). Go up Elmwood maybe a half mile, take a right on Hertel, and you’ll find all sorts of restaurants, but mainly lots of good italian restaurants (of varying price levels — Romeo and Juliet’s is good and not too fancy or pricey, and you can sit outside).\n\nYes, I am made of Buffalite.\n\nJonathan\n\n"
    },
    {
      "time": " 11.Jul.2008 5.29am",
      "content": "In conjunction with TypeCon, Erik Spiekermann is giving a public talk on Friday night at 8:00 at the Albright-Knox.\n\nWe’ll have a couple buses heading up there to ferry people. I don’t yet know the time of the first bus, but we’re going to be encouraging folks to head up early and catch dinner in the Elmwood area before the talk. So Jonathan’s suggestions are right on target.\n\n— K.\n\n"
    },
    {
      "time": " 11.Jul.2008 6.13am",
      "content": "\\>_They have the WORST bacon!_\n\nFailing that is a bit of an achievement in itself\n\nƒ\n\n"
    },
    {
      "time": " 11.Jul.2008 1.27pm",
      "content": "Hertle is great for restaurants but TypeCon timing coincides with the Italian Festival  \n [http://www.buffaloitalianfestival.com/](http://web.archive.org/web/20080821122022/http:/www.buffaloitalianfestival.com/ \"http://www.buffaloitalianfestival.com/\")  \nIt’s a bit crazy, if you like crowds and want some great Italian food and people watching, it is a fun side event.\n\n"
    },
    {
      "time": " 11.Jul.2008 1.27pm",
      "content": "edit\n\n"
    },
    {
      "time": " 11.Jul.2008 2.07pm",
      "content": "So we have established that Buffalo has the worst bacon, presumably of any location anywhere. Where in Buffalo would you go to get Buffalo’s worst bacon?\n\n"
    },
    {
      "time": " 11.Jul.2008 2.51pm",
      "content": "Mark, Perhaps you would go to Sir Francis to find the worst Bacon? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 11.Jul.2008 4.13pm",
      "content": "Buffalo, the New Atlantis of Bad Bacon. That’s pretty bad.\n\n"
    },
    {
      "time": " 11.Jul.2008 7.26pm",
      "content": "I think Jonathan was referring to the Towne restaurant, not the “town” of Buffalo as bad bacon central. It is the late night Greek place in Allentown\n\n"
    },
    {
      "time": " 11.Jul.2008 7.29pm",
      "content": "Alejandro, your sushi wish is granted with a new place downtown  \n [http://www.buffalonews.com/185/story/389687.html](http://web.archive.org/web/20080821122022/http:/www.buffalonews.com/185/story/389687.html \"http://www.buffalonews.com/185/story/389687.html\")\n\n"
    },
    {
      "time": " 11.Jul.2008 9.16pm",
      "content": "Thanks for clearing that up, Rich — my missing “e” evidently caused a lot of bacon confusion. Indeed, I was referring to the Towne restaurant. To recap:\n\nThe Towne Restaurant: don’t order anything with bacon\n\nThe rest of the city of Buffalo: order whatever you want, including bacon, from any of our fine, fine restaurants.\n\nThe beauty of Buffalo, and its close proximity to Canada, is that you can readily get regular bacon (aka “bacon”) \\_and\\_ Canadian bacon (aka “back bacon”). It’s truly a bacon-lover’s paradise, except, once again, as long as you don’t get it at the Towne.\n\n"
    },
    {
      "time": " 12.Jul.2008 4.34am",
      "content": "Whew. Buffalo is bacon safe. That’s good news.\n\n"
    },
    {
      "time": " 12.Jul.2008 7.54am",
      "content": "It’s not just bacon safe. It’s bacontacular.\n\n"
    },
    {
      "time": " 12.Jul.2008 7.59pm",
      "content": "_It’s bacontacular._\n\nAnd I thought I couldn’t get any more excited about this trip!\n\n"
    }
  ]
}
