{
  "id": "47135",
  "title": "Baker Signet - forward",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I’ve recently taken on a fairly big brand job and inherited a logotype which utilizes Baker Signet with the addition of some slight changes. I’m looking to streamline this logo and presented Fedra Sans along with some of the existing nuances. Still client response was “too far out.” I’m hoping someone may have a suggestion of a typeface that embodies some of Baker’s qualities but be a bit more contemporary if you will. A foundation for me to move this logotype forward. I appreciate any input.\n\nThank you,  \nJ.C.\n\n [‹ Bible serif typeface circa 1981 or earlier](http://web.archive.org/web/20081012144444/http:/www.typophile.com/node/47125 \"Go to previous forum topic\") [2 lead type IDs please ›](http://web.archive.org/web/20081012144444/http:/www.typophile.com/node/47146 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012144444/http://www.typophile.com/user/33542\" title=\"View user profile.\">J.C. Nunzamoto</a>",
  "time": "<br>",
  "uid": "33542",
  "comments": [
    {
      "time": " 7.Jul.2008 8.40am",
      "content": "To Clarify - A Glyphic font that has nuances of a Sans Serif and that feels a bit more “fresh”. I must also use it in ALL CAPS. I don’t work much with these type of faces and wonder if anyone is doing anything new in this area.\n\nThanks again,  \nJC\n\n"
    },
    {
      "time": " 7.Jul.2008 8.45am",
      "content": "Hi J.C.,  \nmaybe [Alinea Incise](http://web.archive.org/web/20081012144444/http:/www.fontshop.com/fonts/downloads/presence_typo/alinea_incise/), [FF Angie](http://web.archive.org/web/20081012144444/http:/www.fontshop.com/search/?q=FF+Angie) or [Palatino Sans](http://web.archive.org/web/20081012144444/http:/www.linotype.com/111707/palatinosans-family.html)?  \nF\n\n"
    },
    {
      "time": " 7.Jul.2008 8.55am",
      "content": "JC.\n\nArthur is probably one of the few typographic/lettering artists whose work is readily identifiable and individualistic. The word idiosyncratic comes to mind.It is borne out of his personality, the tools he uses and his studies.\n\nIf you are looking for something with his “trademark style” you’ve only to search the myriad faces he has designed over the decades. Look at Hiroshige(Sans) as a possible alternative or just google his typefaces. Most are calligraphic but there are others to choose from.\n\nMichael\n\n"
    },
    {
      "time": " 7.Jul.2008 9.11am",
      "content": "Thank you kindly for the typeface recommendations Florian. - The most difficult part of this assignment is that the foundation I must start from is beautiful (Baker no doubt) the challenge is the face itself for a very recognizable brand is just too recognizable and maybe a bit over used to date. Feedback is, “it’s nice but I feel like I’ve seen a million times, seems like my mom’s brand type logo.” Not my words but the overall impression from a focus group. However much I respect the beauty of the typeface, I must find something “familiar” but that can relate to a younger market and a more savvy user following that is looking for something just a bit more freshened up, or should I say current. This isn’t easy as nothings seems to be better looking than Baker in my Glyph search and when I move to a Sans, it’s too far off. Arrrg...\n\n"
    },
    {
      "time": " 7.Jul.2008 1.43pm",
      "content": "How about Exemplar?  \n [http://www.psyops.com/html/spec\\_exemplar.html](http://web.archive.org/web/20081012144444/http:/www.psyops.com/html/spec_exemplar.html \"http://www.psyops.com/html/spec\\_exemplar.html\")\n\n"
    }
  ]
}
