{
  "id": "4713",
  "title": "Text fonts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Please suggest some interesting text faces. I'm redesigning a magazine and looking for someting a little off the beaten path. Currently I'm using Village, which I like quite a lot, but I'm considering switching to Edison. The headline font I'm using for the redesign is Trade Gothic Cond. (previously was Akzidenz Grotesk Ext.) Nothing is set in stone and would welcome fresh ideas.\n\n",
  "author": "anonymous",
  "time": "11 May 2004 — 1:51pm",
  "uid": "1203",
  "comments": [
    {
      "time": "11 May 2004 — 2:17pm",
      "content": "What's the magazine about, who is the target readership, how long are the articles, what are the illustrations like?   \n   \nhhp\n\n"
    },
    {
      "time": "12 May 2004 — 9:33am",
      "content": "The temptation would be to choose something conservative, even with the explicit request for \"funkiness\". I think it might hard to pull off anything too daring.   \n   \nI guess I have a hang-up, but I'm finding myself recommending a wedge-serif again... Maybe even FF Eureka (although you'd have to track it tighter to make it really readable), if you want to be pushy. Hey, tennis stars have funny names with accents, right? Eureka was made for that.   \n   \n\\> a condensed font will allow me to eek in a few more words in the same space.   \n   \nThis seems like common sense, but isn't always true; the reason is that a wider font allows you to use a smaller size, gaining _vertical_ space while maintaining apparent size. It depends on a few things though, including the proportion of paragraph breaks in the text, and the column width. Also, a bigger factor than economy can be the \"atmosphere\" that narrowness conveys: elegance. Which I think is appropriate here; unless I'm mistaken, older-generation tennis players view the sport as more elegant than... frantic.   \n   \nhhp\n\n"
    },
    {
      "time": "12 May 2004 — 1:28pm",
      "content": "I would take a look at the work of Terminal Design. ClearviewOne comes to mind. What I like about their designs is the variety of weights and readability. If you can get your hands on an Indie fonts 2 book you can see what I'm suggesting. If not visit their site [www.terminaldesign.com](http://web.archive.org/web/20131018214018/http:/www.terminaldesign.com/) and take a look at their work.\n\n"
    },
    {
      "time": "12 May 2004 — 2:41pm",
      "content": "Hrant? You seems always to propose the same faces whatever the subject is? Are you paid by some foundries or what?   \n   \n(don't take it wrong indeed)\n\n"
    },
    {
      "time": "12 May 2004 — 2:46pm",
      "content": "You're right, I have a problem - it must be due to my being a lousy _user_ of type.   \n   \nAnd don't worry, I appreciate any observation that has a decent chance of being correct!   \n   \nhhp\n\n"
    },
    {
      "time": "13 May 2004 — 10:27am",
      "content": "Thanks for the suggestions. I also scanned previous threads and found a few other fonts I want to test drive as well so to speak. A side note to Hrant: I agree with your comment regarding not always using a condensed font to save space \"a wider font allows you to use a smaller size, gaining vertical space while maintaining apparent size\", however I was previously using an extended font in the front of book articles and in side bars but for the redesign I was opting for a different look thus a condensed. Perhaps I don't need to swing from one extreme to the other. The suggestions I recieved have given me some interesing options to work with. Thanks again\n\n"
    },
    {
      "time": "12 May 2004 — 8:26am",
      "content": "Sorry, yes of course- can't design in a vaccum. It's a sports Magazine (tennis specifically) The audience is primarily adults aged 26-55, in addition, there is s significant older readership percentage (60+) and a fair amount of juniors (12-18) The magazine is 4/c on glossy stock, published bi-monthly, size 8 1/8 x 10 7/8. Feature stories typically run 1500 -2000 words, front of book articles are grouped a few on a page and are aprox. 250 words - I'm currently working with the Trade Gothic family in this area as part of the redsign because when I say 250 words the client interprets that to mean + or - (but usually +) and a condensed font will allow me to eek in a few more words in the same space. Also run statical info, tournament results etc. Art is action photography most of the time with some portraits as well, and unfortunately due to the grassroots nature of many of the programs, some of the photos are not what one would consider professional quality. The distribution is through subscription only, no newsstand. It is a house organ for a tennis association and so there are many masters to try to please, each with their own taste and adgenda. I redesigned the book 5 years ago, giving it an updated more sophiscated look (than previously), inspired in part by a variety different golf publications. As time goes by, story lineups change, the editiorial focus changes, and all the little \"patches\" of design no longer hold together. My goal this time is for the magazine to look sporty, have lots of energy, but not be too trendy (for all I'm told to be more funky with the layouts like things designed for the NBA or NFL, when I do I'm inevitably told to tone it down). Think golf not snowboarding, however the client doesn't want to perpetuate the country club image of tennis either. So think something hipper than golf but not as out there as snowboarding. I'm thinking a clean, classic - yet leaning towards bold design is the way to go, working with a lot of color and hopefully interesting typography. (did that make any sense?) The mast head font is City Bold - along with the redesign there is a planned name change but the powers that be haven't come to a consensus yet. I was also planning on using City inside the book as well for the department heads. As I understood things the mast head had been approved but I just learned they're not 100% sure of the new name. Frustratingly for me, they do not understand that changing the name will effect the design. Oh well, didn't mean to go off on a rant about all the red tape I'm wrapped up in. Any expert advise would be greatly appreciated. Actually advice from anyone who understands you can't simply replace a 7 letter word with initals and expect the design to retain it's original aesthetic would be appreciated. I guess what I'm looking for are suggestions for font families which will seem a little different, fresh, not same old, same old, but not be radically different or look dated in a matter of months - readability is important.\n\n"
    },
    {
      "time": "11 May 2004 — 2:09pm",
      "content": "Kirsten, it would help people who would help you to know, what kind of magazine you are designing, what you are printing on (newsprint, matt or glossy stock), who your audience is (older, conserative or young radical). Is it a scientific journal or a hip fashion magazine? So many questions so few answers. Willy Wonka\n\n"
    }
  ]
}
