{
  "id": "47163",
  "title": "Rocky",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "What's wrong with Rocky, the current featured typeface?\n\nNothing.\n\nIt's not too fat, too thin, too wide, too narrow, unbalanced in any way.\n\nNot too showy, not too bland.\n\nIt just sits there being perfectly readable, gracious, calmly doing its job.\n\nAmazing.\n\n",
  "author": "William Berkson",
  "time": "7 Jul 2008 — 8:42pm",
  "uid": "1551",
  "comments": [
    {
      "time": "7 Jul 2008 — 9:25pm",
      "content": "I know what you mean. It’s like Matthew Carter drew it or something…\n\n"
    },
    {
      "time": "7 Jul 2008 — 10:10pm",
      "content": "No Cyrillic? I guess we'll have to wait 'til Rocky version 4.0 before it takes on the Russian. ;-)\n\n"
    },
    {
      "time": "8 Jul 2008 — 5:34am",
      "content": "the font has a strange mood but... IT WORKS! it seems really well drawn!\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": "8 Jul 2008 — 12:13pm",
      "content": "This face hit me so hard in the fist that I started another thread about it and got KO'd by William in the first round! :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Jul 2008 — 12:25pm",
      "content": "Yeah, he beat you to the punch.\n\n"
    },
    {
      "time": "8 Jul 2008 — 12:34pm",
      "content": "Feels like an updated Fenice in some ways. Very nice.\n\n"
    },
    {
      "time": "8 Jul 2008 — 5:02pm",
      "content": "_What’s wrong with Rocky, the current featured typeface?\"_\n\nNothing, except the $1,000 tag for a single license.\n\n"
    },
    {
      "time": "8 Jul 2008 — 5:52pm",
      "content": "_Nothing, except the $1,000 tag for a single license._\n\nThere's always some complaint about price. Perhaps thinking about it as $25/style puts it into perspective. Without starting another price/flame thread, what do _you_ think is a \"fair\" price, Nathan?\n\n"
    },
    {
      "time": "8 Jul 2008 — 6:11pm",
      "content": "Well Kris Sowersby,\n\nWithout starting another price flame thread, given your occupation (your work is very nice btw), it would be mightly foolish to respond to your loaded question with a figure. Any figure stated will likely not be sufficient - justifiably so from your view of the world.\n\nIn the _real consumer world_ though, $1,000 for a single license, where we are not given an _option_ to select _some_ styles is a little ridiculous.\n\nGiven the **make once, sell many** , nature of type, would it not be more sensible to have a mid-range pricing point?\n\nRocky is brilliant. 30 mins ago, FB would have had another sale if it weren't for the price. I and many others have some good money for type designers to collect - please make it a little more accessible - or provide some _options_.\n\nRocky is brilliant and I don't wish to divert the direction of the OP's comments.\n\n"
    },
    {
      "time": "8 Jul 2008 — 6:22pm",
      "content": "Nathan, I just tried on the FB site putting one style of \"Rocky\" into my 'shopping cart', and I had no problem doing it. Did you see something that requires you to buy all 40 styles?\n\n"
    },
    {
      "time": "8 Jul 2008 — 6:51pm",
      "content": "Nathan,  \nYou can buy it for $40 bucks! That is a one-computer license for one weight.\n\nChrisL\n\n"
    },
    {
      "time": "8 Jul 2008 — 7:18pm",
      "content": "Thanks my bad.\n\nI had clicked Add to Cart (for the entire set), and was too busy admiring to notice the individual remove buttons.\n\n"
    },
    {
      "time": "9 Jul 2008 — 12:29am",
      "content": "noftus\\> I agree with anyways tho. Type is just so expensive these days.\n\nBoxing match: Rocky vs. Greta vs. Sunday Times Modern\n\nWho wins?!\n\n"
    },
    {
      "time": "9 Jul 2008 — 3:29am",
      "content": "\\>Rocky vs. Greta vs. Sunday Times Modern\n\nIf I'm not mistaken, Rocky is a headline face, as is Sunday Times Modern. The Sunday Times now uses Greta Text for text, but you can't really compare it to the other two because of the different function.\n\nThere is a [Greta Display and Greta Grande](http://web.archive.org/web/20131107211722/http:/www.typotheque.com/fonts/), but as I said over at [Typographica](http://web.archive.org/web/20131107211722/http:/typographica.org/001139.php), I find them too sparkly, whereas Greta text is a real winner, one of the \"best of 2007.\" For headlines I would prefer both Rocky and Sunday Times Modern to the display versions of Greta.\n\nFor headline, from what I see online--not the best test--I definitely prefer Rocky. It has the combination of weight, balance and bite that seems to me just right for headlines. I don't know about the issue of weights that one reviewer of the new Sunday Times brought up, but I'm pretty confident that all of the weights and widths of Rocky would work well, given that Carter drew it.\n\nIncidentally, I prefer Rocky to \"Postoni\" the Headline Bodoni that Carter drew for the Washington Post. It is also very good, though, and I know it well as I look at it every morning. I'd rather see Rocky though.\n\n"
    },
    {
      "time": "9 Jul 2008 — 6:15am",
      "content": "\"Type is just so expensive these days.\"\n\nI don't see how. Type is far cheaper now than ever in history.\n\nChrisL\n\n"
    },
    {
      "time": "9 Jul 2008 — 1:06pm",
      "content": "Nathan—You're right, my question was loaded, sorry. Luckily you can buy single styles! Which ones did you license?\n\nMikey—Type is not expensive, really. But we've been over this…\n\n—K\n\n"
    },
    {
      "time": "9 Jul 2008 — 3:34pm",
      "content": "I purchased Extra Condensed Black. I am a sucker for stuff like that and this cut was a beauty!\n\nChrisL\n\n"
    },
    {
      "time": "9 Jul 2008 — 7:18pm",
      "content": "<cite>Type is just so expensive these days.</cite>\n\nConsidering how much labour is put into creating a single font, $25 for a single weight is a bargain in my opinion. At the same time Mike, I want to thank you for your kind words regarding Whisk :)\n\n"
    },
    {
      "time": "10 Jul 2008 — 2:17am",
      "content": "Did anybody spot the small Rocky with it's fist up in the character set?\n\n ![](http://web.archive.org/web/20131107211722im_/http:/typophile.com/files/rocky_1_5678.gif)\n\n"
    },
    {
      "time": "10 Jul 2008 — 2:29am",
      "content": "I've seen it in Le Monde and it's really a beautifull face. It has that perfect classy but neutral touch, with personnality at the same time. I know this sounds paradoxal, don't know how to explain tho.\n\n"
    },
    {
      "time": "10 Jul 2008 — 3:36am",
      "content": "Punchy! I've been seeing it in le Monde for a while now and have always thought it to be rather beautiful. It looks smashing on the site too.\n\n"
    },
    {
      "time": "10 Jul 2008 — 5:52am",
      "content": "<cite> &gt; It has that perfect classy but neutral touch, with personnality at the same time. I know this sounds paradoxal, </cite>\n\nYou have described the essence of Matthew Carter's mastery.\n\n"
    },
    {
      "time": "10 Jul 2008 — 6:11am",
      "content": "Finally, someone fixed the \"g\" in Matrix!  \nHrant must be pleased.\n\n"
    },
    {
      "time": "10 Jul 2008 — 7:54am",
      "content": " ![](http://web.archive.org/web/20131107211722im_/http:/typophile.com/files/rockyfist_6110.png)\n\nAwesome!!!\n\nChrisL\n\n"
    }
  ]
}
