{
  "id": "47161",
  "title": "Critique first stages - Trim",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi,\n\nFor the past few nights Ive been converting some of my sketches into letters I'm starting to like the look of. Its pretty much my first sensible attempt at something usable, so am not up to speed on contrasting and detailing so would love to open the floor up to critique.\n\nAny feedback and thoughts are appreciated and hopefully with some guidance I could develop this into something quite pretty.\n\nThanks, I really appreciate the help from this level of expertise\n\nJordan\n\n ![](http://web.archive.org/web/20130819234908im_/http:/typophile.com/files/web_trim_1_5956.jpg)\n\n ![](http://web.archive.org/web/20130819234908im_/http:/typophile.com/files/web_trim_1_handgloves_3470.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [web\\_trim\\_1.pdf](http://web.archive.org/web/20130819234908/http:/typophile.com/files/web_trim_1.pdf) | 222.55 KB |\n\n",
  "author": "JordanSheldrick",
  "time": "7 Jul 2008 — 6:14pm",
  "uid": "27145",
  "comments": [
    {
      "time": "7 Jul 2008 — 8:11pm",
      "content": "First impressions: I love the capital R and the g is very interesting too. Other than that, this face has potential, but there are some forms that you might want to study further so you can spot the \"awkwardness,\" especially for for the forms of a, e, and s. Also, as this comes in time and experience, but you need to focus on not measuring the width of the letters, but the optical spacing, especially the negative space. Also, make sure that every form has a similar DNA to each other. Keep it up, and good luck!\n\n"
    },
    {
      "time": "7 Jul 2008 — 9:11pm",
      "content": "Great job. I'm really impressed. I love the D and k. I agree with jlapiak, the s is a little awkward, along with the e- visually the hook seems to stop a little short. But I love where you're going with it.\n\n"
    },
    {
      "time": "7 Jul 2008 — 10:38pm",
      "content": "Looks like good work. I actually think the s is fine; ordinarily one wouldn't want the center tangent to be fully horizontal but I think it works with this design. The e, however, is definitely awkward.\n\nX and x cross too low and appear top-heavy, especially in this high-crossbar face. They also seem a bit narrow.\n\n"
    },
    {
      "time": "20 Jul 2008 — 1:54pm",
      "content": "Hey, I'm back from holiday and ready to tackle some curves again.\n\nThanks for all the feedback, some very useful points made which I have been working on to correct and smooth out...\n\nThe main problem seemed to be in the curves of the e a and s so I have given these some attention to give them a body that better fits with my o shape.  \nI have also angled the center of the s which seems to work for me, but see what you think of the change.  \nThe x shape has also been changed after picking up on the point cerulean made, and I feel it is much better related to the rest of the crossbar heights now.\n\nI have also made a couple of alternative versions of a g k which will help me when it comes to drawing italics in the future.\n\nThank you all for your help, I shall be starting full-time work as of tomorrow so this will have to become a moonlit project from now on, so your advice has maybe saved me a few sleepless hours.\n\n ![](http://web.archive.org/web/20130819234908im_/http:/typophile.com/files/web_trim_2_4941.jpg)\n\n ![](http://web.archive.org/web/20130819234908im_/http:/typophile.com/files/web_trim_2_exams_5427.jpg)\n\n"
    },
    {
      "time": "20 Jul 2008 — 3:55pm",
      "content": "Jordan,\n\nI have a few comments on this typeface; however, take these comment with a grain of salt. I am by no means a type-expert. Hopefully, more will come along.\n\nTo start, everything seems a little tight to me. If the spacing/kerning could be loosened, I think this would be much easier on the eyes (especially look at your kerning between \"de\" \"ef\" and \"no\"). Next, the x-height of the alternate to your normal 'k' seems higher than of every other glyph in the lowercase. I think the 'C' looks kind of wide, and the 'K' feels awkward.\n\nGood luck on the font, and I hope I'm not being too picky.\n\n"
    },
    {
      "time": "21 Jul 2008 — 12:55pm",
      "content": "Thanks,\n\nI should have mentioned really that these are letters dragged from the design file so I haven't began on my spacing yet... but thanks for the attention to detail.\n\nThanks for the comments, I had doubts about both the C and the K so I am glad someone mentioned them. I think that the leg of the K may begin too high up in relation to the uppercase crossbars so I shall have a look at both that and my C width.\n\nps. Your pickyness is why we are here!\n\n"
    },
    {
      "time": "26 Jul 2008 — 6:03pm",
      "content": "After playing around with the C and K for a while, the rest of the upper case really started to look bad to me. The O and related shapes felt far too wide for the rest of the typeface and stuck out when I tried putting the uppercase into words and sentences.\n\nI hit the beziers once more to give the whole upper case more of the feel that the lower case has, one that is altogether less condensed and open. This turns out to have made my K fit in once more (although I have a retouched one in case it still looks too misshapen) and give upper case words a more solid feel.\n\n ![](http://web.archive.org/web/20130819234908im_/http:/typophile.com/files/web_trim_3caps_5645.jpg)\n\n ![](http://web.archive.org/web/20130819234908im_/http:/typophile.com/files/web_trim_3capsname_5129.jpg)\n\nI am also starting to think about expanding the weight of my letters into regular and bold (or perhaps down to a hairline??) but have yet to find any good resources for helping me do so... if anyone knows of any good sources I would love it if you could share them or direct me to a relevant discussion. Thanks.\n\nThanks again guys,  \nJordan\n\n"
    },
    {
      "time": "7 Aug 2008 — 9:47am",
      "content": "\\*gives award for best g ever\\*\n\nWell, maybe not that far, but that was the first thing that stuck out to me about this font.\n\nOh, and stick with the two-story a...something about the one-story one you posted just looked a bit awkward.\n\nPeace,  \nJT\n\n"
    }
  ]
}
