{
  "id": "47175",
  "title": "Realwear",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": " ![](http://web.archive.org/web/20131018110943im_/http:/typophile.com/files/realwear_3575.png)\n\nhello.  \ni am working on a logo for a company which will distribute and sell the carhartt clothes (both work and street) via online shop in slovakia.  \ni made this bunch of logotypes and now i can't decide which one fits best for this kind of company.  \ni drew all the letters myself except of the version L - that is avenir.\n\nwhich one would you choose?\n\nthank you.\n\n| Attachment | Size |\n| --- | --- |\n| [realwear.pdf](http://web.archive.org/web/20131018110943/http:/typophile.com/files/realwear.pdf) | 91.33 KB |\n\n",
  "author": "urtd",
  "time": "8 Jul 2008 — 6:16am",
  "uid": "17806",
  "comments": [
    {
      "time": "8 Jul 2008 — 6:42am",
      "content": "I'd go for the center one on the white circular background. Good stuff!\n\n"
    },
    {
      "time": "9 Jul 2008 — 10:57am",
      "content": "G&H. Did you modify an existing font?\n\n"
    },
    {
      "time": "9 Jul 2008 — 11:38am",
      "content": "Many of these could work...and given that fashion often uses interchangeable logos, perhaps a set of these would work.\n\nIn terms of the 'roots' of carhart (ag/industrial), I think E, I, and J are all contenders, with J maybe being that nice blend/crossover market angle.\n\n"
    },
    {
      "time": "9 Jul 2008 — 1:20pm",
      "content": "G or H without doubt for me. Nice style.\n\nJH\n\n"
    },
    {
      "time": "10 Jul 2008 — 5:57am",
      "content": "thank you guys very much.\n\nvintagesignman: no i did not. it is completely hand-drawn.\n\nmy personal favourite is version O, don't know why, it just feels good. i think i am not gonna look at them for a week or so and then i'll see which one will catch my eye.\n\n"
    },
    {
      "time": "10 Jul 2008 — 5:58am",
      "content": "Ugla,  \nDo let us know which one you pick. Nice work!\n\n"
    },
    {
      "time": "10 Jul 2008 — 7:37am",
      "content": "I like the way G hangs together and is centred without being too symmetrically dull, but it needs some refinement: the \"l\" is too much like \"c\", and the \"a\" too much like \"d\".\n\n"
    },
    {
      "time": "11 Jul 2008 — 12:34am",
      "content": "Haha, didnt make out(bad eyesight?!) it had letters labeling each logo. What I was trying to indicate in my desciption was of course the logo labeled H, G would do as an alternate logo.\n\nI love type!\n\n"
    },
    {
      "time": "12 Jul 2008 — 7:43am",
      "content": "I like the script type ones, i.e. G, H, J, K. Although I would probably slightly open up the space inside where the 'a' joins the 'r'.\n\n"
    }
  ]
}
