{
  "id": "47177",
  "title": "Print question, black onto coloured stock and metallic image",
  "forum": "Design",
  "tags": [

  ],
  "content": "Friends, Romans, countrymen\n\nI’m working on a book/catalogue at the moment and plan on using tan or sand coloured stock. I usually avoid rich black for text at all costs because of registration issues but I want to avoid the washed out look of 100% keyline black on coloured stock.\n\nI am only using two inks throughout the book, black for text (and some low res images) and a pms metallic (silver) for illustrations. The illustrations in silver sit partially behind the text and I want to make sure that the black does not dissapear when overprinted.\n\nAny advice? I was thinking about using a pms black instead of process black. I have not used any metallic colours before, anything I should know?\n\nThanks all\n\n [‹ Speech Bubble Font](http://web.archive.org/web/20080907165953/http:/typophile.com/node/47268 \"Go to previous forum topic\") [monogram help ›](http://web.archive.org/web/20080907165953/http:/typophile.com/node/47255 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907165953/http://typophile.com/user/16140\" title=\"View user profile.\">1985</a>",
  "time": "<br>",
  "uid": "16140",
  "comments": [
    {
      "time": " 8.Jul.2008 7.13am",
      "content": "If overprint of black is a problem you can turn it off in preferences.  \nMetallic pms colors will not look very good on uncoated stock, especially not paper with a soft, rough surface.\n\n"
    },
    {
      "time": " 8.Jul.2008 7.49am",
      "content": "Thanks Toby\n\nDoes turning off overprint create a knockout?\n\nThe stock I have my eye on is coated. Will that require sealing?\n\nCheers\n\n"
    },
    {
      "time": " 8.Jul.2008 8.07am",
      "content": "Yes, it will create a knockout. Not sure what you mean by sealing though..\n\n"
    },
    {
      "time": " 8.Jul.2008 8.37am",
      "content": "I’m not quite sure what I mean by that either, some process after printing, varnishing I guess?\n\n"
    },
    {
      "time": " 8.Jul.2008 12.42pm",
      "content": "Look at PMS K7. It is a mix of K and Silver. It prints as a very warm black. I use it for text on off white stock.\n\n"
    },
    {
      "time": " 8.Jul.2008 4.25pm",
      "content": "That sounds interesting, I will have a look at that tomorrow if I can get hold of some pantone books.\n\nMany thanks\n\n"
    },
    {
      "time": " 10.Jul.2008 9.14am",
      "content": "I printed once a metallic in over Domtar Titanium White and altough it looked lively it definitively was not shining at all.\n\nHéctor\n\n"
    }
  ]
}
