{
  "id": "47195",
  "title": "What's a parish?",
  "forum": "csgilmor's blog",
  "tags": [

  ],
  "content": "When people think of Louisiana they think of many things including, what the hell is a parish? When I first moved to New Orleans and I overheard people talking about all the different parishes and I was so confused. What is a parish? Then I found out that it is nothing more than a county but Louisiana of course had to be different and call it a parish. Well, the parish that I live in is Orleans parish which includes the Quarter, Uptown, Broadmoor, the 9th ward, Carrollton area, CBD, Warehouse District, Garden District, the Marigny, Gentilly and Midcity. If I’m not mistaken that is all of the areas of Orleans parish. Now, when driving around the parish of Orleans there is one thing that all of these different sections have in common: horrible streets. You can go through a set of tires down here it seems in 6 months and driving fast is not conducive to keeping your car in the best shape. I can not remember the amount of times I’ve hit a pothole just a little too hard and there are certain communities and streets that do not want all the potholes to get fixed just so people do have to drive slow down their street. Even though this is a good idea, it is just so annoying when you hit a pothole every two seconds. Recently though, the city has gotten better with filling the potholes but then it still makes the road uneven and sometimes it would just be better to repave all the roads but that is not going to happen. A person can dream of one day being able to drive on roads as smooth as butter but in Orleans Parish, that’s not even on the radar and maybe it should be.\n\n",
  "author": "<a href=\"/web/20080830094021/http://www.typophile.com/user/31954\" title=\"View user profile.\">csgilmor</a>",
  "time": "<br>",
  "uid": "31954",
  "comments": [
    {
      "time": " 8.Jul.2008 4.28pm",
      "content": "The law in Lousiana is different from the rest of the United States because of the Code Napolean. A quick click on Google brought the easiest way to think about this:\n\n[http://www.la-legal.com/modules/article/view.article.php?c8/29](http://web.archive.org/web/20080830094021/http:/www.la-legal.com/modules/article/view.article.php?c8/29 \"http://www.la-legal.com/modules/article/view.article.php?c8/29\")\n\n"
    },
    {
      "time": " 9.Jul.2008 10.47pm",
      "content": "That’s funny, I had to get used to the word “county” myself. Another thing that I find funny is when I tell tourists that they have to wait on “the neutral ground” in order to catch “the street car”. What’s all this nonsense about medians and trolleys anyway?\n\n"
    }
  ]
}
