{
  "id": "47211",
  "title": "Calligraphy Pen",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nI'd like to learn a bit about calligraphy. I saw a thread on a few good books but I'm not so sure about what pens to get. Can anybody suggest a good quality pen? My intended goal with learning this is to write nice letters (as in mail, not glyphs).\n\nThanks very much for your help.\n\n-Glen\n\n",
  "author": "Glen",
  "time": "8 Jul 2008 — 5:05pm",
  "uid": "24145",
  "comments": [
    {
      "time": "8 Jul 2008 — 6:24pm",
      "content": "Are you just wanting basic calligraphy with no goal of getting to an advanced level?  \nIf so, you could start with a fountain pen and maybe one of the basic calligraphy books like Jacki Svarin's 33 alphabets.\n\nfountain pens:  \n [http://www.johnnealbooks.com/prod\\_detail\\_list/7](http://web.archive.org/web/20150414023922/http:/www.johnnealbooks.com/prod_detail_list/7 \"http://www.johnnealbooks.com/prod\\_detail\\_list/7\")\n\nIf you are thinking of being a bit more disciplined and perhaps taking it the next step, take a class and use real dip nibs such as Brause or Mitchell nibs. John Neal Books sells all that stuff. They could recommend a good beginning set of tools for you.\n\n"
    },
    {
      "time": "8 Jul 2008 — 6:53pm",
      "content": "If your aim is to simply develop a nice handwriting for everyday use, then a fountain/cartridge pen with a 1.5 or 2 millimetre wide flat nib will be best. My favourite is a Parker model to which Jean Fançois Porchez introduced me over a decade ago, and remarkably I've managed not to lose it in all that time. Unfortunately, this model is no longer made, but you can find it on eBay sometimes.\n\nAvoid Osmiroid pens, since the nibs are not well made and tend to gunk up. That said, they are the only company they made a pointed split nib fountain pen, for which I'm very grateful; on the whole, though, they are too much trouble for an everyday pen.\n\n"
    },
    {
      "time": "8 Jul 2008 — 7:41pm",
      "content": "My calligraphy instructor (a professional calligrapher for nearly 30 years) introduced me to the Brause nibs that Stephen mentioned. You will need a holder for the nibs, such as a Caran d'Ache brand. For \"letter\" writing, you are going to want a fairly small nib, perhaps a .75 mm - 2 mm size.\n\nIf you are interested in classes or lessons, these are usually readily available.\n\nRoberta Gfeller apparently is a calligraphic teacher located in Toms River, NJ; not sure how far that is from you. Her e-mail: ( [peninhand22@aol.com](mailto:peninhand22@aol.com)). If it doesn't work to get lessons from her, at least she could probably direct you.\n\n\\*\n\nNibs:\n\n[http://www.pencity.com/cgi-bin/SoftCart.exe/Brause/CalligraphySet.htm?L+...](http://web.archive.org/web/20150414023922/http:/www.pencity.com/cgi-bin/SoftCart.exe/Brause/CalligraphySet.htm?L+scstore+epsl2165+1215603689 \"http://www.pencity.com/cgi-bin/SoftCart.exe/Brause/CalligraphySet.htm?L+scstore+epsl2165+1215603689\")\n\n\\*\n\nCalligraphy teacher directory:\n\n[http://www.acatemp.org/teachers.htm](http://web.archive.org/web/20150414023922/http:/www.acatemp.org/teachers.htm \"http://www.acatemp.org/teachers.htm\")\n\n\\*\n\n"
    },
    {
      "time": "9 Jul 2008 — 4:43am",
      "content": "Thanks very much for the suggestions!\n\nI think I'll be getting the Brause set and also a fountain pen, if the nibs are too difficult to start with.\n\nThanks once again!!!\n\n"
    },
    {
      "time": "9 Jul 2008 — 8:40am",
      "content": " I just got the Parker Calligraphy Gift Set, model #35979 ( [http://www.amazon.com/dp/B000MK53AK](http://web.archive.org/web/20150414023922/http:/www.amazon.com/dp/B000MK53AK)), and I’m really enjoying them—I just wish I could find extra nibs &c. for the set, without actually buying another copy of the kit! (John, are these like the pen you liked so much?)\n\n—Joel\n\n"
    },
    {
      "time": "9 Jul 2008 — 8:43am",
      "content": "It is a little hard to tell from the photo, but yes this looks like it might be similar to my favourite Parker.\n\n"
    },
    {
      "time": "9 Jul 2008 — 3:11pm",
      "content": "You can always try to find ArtPen from rotring. They no longer exist but i have 2.7mm and i like it i just have the problem of being left-handed so... i tie two markers and draw on a big a2 paper ehehe... was the solution i found\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": "16 Jul 2008 — 10:17pm",
      "content": " BTW, the pen in the calligraphy kit is from Parker's Vector line.  \n—Joel\n\n"
    },
    {
      "time": "17 Jul 2008 — 12:27am",
      "content": "a nice fountain pen: [Lamy Joy](http://web.archive.org/web/20150414023922/http:/www.lamy.com/eng/b2c/joy/011)\n\nif want to try a pen holder:  \n1. don’t put the pen into the inkpot but rather put some ink with a small brush onto the nib. this helps avoiding ink blobs.  \n2. pimp your pen with som cotton wool on the downside of the nib, so that the pen can hold more ink at once and instead of one or two words you can write a whole line without refilling.\n\n ![](http://web.archive.org/web/20150414023922im_/http:/typophile.com/files/pencotton_5397.jpg)\n  \nthe cotton can be fixed with some wire or a rubber band (rather loose than tight) \n"
    },
    {
      "time": "17 Jul 2008 — 1:54am",
      "content": "sorry this post sholdn't be here\n\nJoel Santos // youremin  \nsound & visual\n\n"
    },
    {
      "time": "6 Aug 2008 — 6:04am",
      "content": "I just thought I'd let you guys know that I got the Brause calligraphy set with the pen holder. I tried it out and it works great! I really am quite happy with it, so thank you for the great advice and suggestions.\n\n"
    },
    {
      "time": "6 Aug 2008 — 6:58pm",
      "content": "<cite>...pimp your pen...</cite>\n\n'Sup dawg? We heard you like calligraphy so we put a pen in your car so you can write while you drive.\n\n- Lex\n\n"
    },
    {
      "time": "7 Aug 2008 — 2:38pm",
      "content": "could you just make some reviews of your pens? like say which is and then a picture of the sample?\n\nJoel Santos // yrmk  \nsound & visual\n\n"
    },
    {
      "time": "9 Aug 2008 — 7:58am",
      "content": "I think the Pilot Parallel pen soundly beats all the other italic fountain pens. It's amazing.\n\nCheck out [http://fountainpennetwork.com](http://web.archive.org/web/20150414023922/http:/fountainpennetwork.com/) for a lot of info and opinion on FPs for calligraphy.\n\n"
    },
    {
      "time": "18 Jan 2012 — 8:28pm",
      "content": "I'm also a beginner, and big fan of Gillott nibs\n\n"
    },
    {
      "time": "19 Jan 2012 — 6:08am",
      "content": "Pilot Parallel are great for studying/practising. My favourite shop for nibs and pens is John Neal Bookstore.http://www.johnnealbooks.com/prod\\_detail\\_list/61  \nThey have a great selection of nibs and good shipping options.\n\n"
    },
    {
      "time": "27 Feb 2012 — 10:26am",
      "content": "Out of interest; How much harder is it to practice calligraphy being a left-hander? I imagine it's very different and tricky, but would love to learn.\n\n"
    },
    {
      "time": "27 Feb 2012 — 11:06am",
      "content": "Some people will tell you it's not a problem.  \nTo me that makes no sense, and I have heard  \nof cases where it was an issue, including one  \nwhere a teacher simply asked the person to  \nleave if they couldn't switch to the right hand.\n\nRelated:  \n [http://typophile.com/node/48843](http://web.archive.org/web/20150414023922/http:/typophile.com/node/48843 \"http://typophile.com/node/48843\")\n\nhhp\n\n"
    },
    {
      "time": "27 Feb 2012 — 1:32pm",
      "content": "Also related:  \n [http://typophile.com/node/36802](http://web.archive.org/web/20150414023922/http:/typophile.com/node/36802 \"http://typophile.com/node/36802\")  \n [http://typophile.com/node/66795](http://web.archive.org/web/20150414023922/http:/typophile.com/node/66795 \"http://typophile.com/node/66795\")  \n [http://typophile.com/node/74710](http://web.archive.org/web/20150414023922/http:/typophile.com/node/74710 \"http://typophile.com/node/74710\")\n\n"
    },
    {
      "time": "4 Mar 2012 — 7:25am",
      "content": "I have practised and taught calligraphy, on and off, for some years and at the beginning of any course of instruction I always asked if any of the students were left-handed. As I asked this, my fingers were usually crossed behind my back, hoping that no one said yes.\n\nIt's not impossible for left handers but it is extremely difficult, usually made worse by the common practice that left handers adopt of turning the paper so that they are writing almost vertically, so's to avoid the hand smudging and obscuring the writing. I have seen one really extreme example where the paper was turned until very nearly upside down.\n\nMy dread of having left handers in a class was because it usually requires much, much more patience and discipline on the part of the student to achieve rewarding results and as I am next to useless with my left hand it is difficult for me to 'feel' the problems it creates for the student and to advise accordingly.\n\nThere are left-oblique nibs which can help a little but, in truth (in my experience anyway), it is only a little.\n\n"
    },
    {
      "time": "4 Mar 2012 — 11:43am",
      "content": "Roundhand, split nib styles of writing can be easier for lefties. Some of these are actually written, by righties, used special nibs that actually mimic the alignment of nib to line that would be natural for a lefty. It will likely require a change of practice for the lefty, though, if he or she is used to turning the page or crooking the arm.\n\n"
    },
    {
      "time": "4 Mar 2012 — 11:53am",
      "content": "John (D P), thanks for the candid expert insight.  \nToo many calligraphers are in denial concerning this.\n\nOne big thing I wonder about is: what about leftward  \nscripts like Arabic or Hebrew? Do their calligraphy  \nteachers secretly hope for lefties in the class? :-)\n\nhhp\n\n"
    },
    {
      "time": "4 Mar 2012 — 3:07pm",
      "content": "Hrant: _One big thing I wonder about is: what about leftward scripts like Arabic or Hebrew? Do their calligraphy teachers secretly hope for lefties in the class?_\n\nI doubt it, because although the connecting horizontal strokes might benefit from being written by a lefty -- the pen can be pulled rather than pushed -- the verticals would either need to be pushed instead or would have flipped terminals. Remember, when writing with a broad nib you not only get distinctive stroke modulation you also get distinctive stroke terminals, in terms of both their weight and angle.\n\nNow, if a lefty were to hold the pen in the mirror of how a Devanagari scribe would, i.e. with a strong rotation past the vertical, and modify the normal ductus of the letters accordingly, he or she might produce the classical styles quite well.\n\n"
    },
    {
      "time": "6 Mar 2012 — 1:26am",
      "content": "I encourage the lefties in my class to just write the other way round, from r. t. l.  \nYes, Latin. At the end, we hold the sheet up against the bright window and criticise.  \nIt works.\n\nBut when I let them write on potatoes to make stamps from it, the leftie is the king.\n\n"
    },
    {
      "time": "16 Mar 2012 — 8:09pm",
      "content": "Solt's tricks for pimping the pens sounds great.\n\nBy the way, if you want to know what pen is the best all-around pen, no one really has the answer for that. Buy one or a couple and see what you like. I like vintage nibs that can be purchased from [Pendemonium](http://web.archive.org/web/20150414023922/http:/www.pendemonium.com/) or eBay. Which one depends on what I'm doing, but the nibs are usually cheap, so buy a bunch and try them out.\n\nI used to think I could find the \"perfect\" pen, and the \"perfect\" ink, and was always dissatisfied. Finally I just bought a bunch of both and figured out what I like, and what works better for one thing or another.\n\n"
    },
    {
      "time": "17 Mar 2012 — 8:48am",
      "content": "John (Petty): as a lefty I'm relieved, in a way, that you say that. Makes me feel less bad about finding calligraphy annoyingly difficult :^)\n\n"
    }
  ]
}
