{
  "id": "47214",
  "title": "New Prospero Pro font marks ten years of font releases",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "FOR IMMEDIATE RELEASE\n\nStevens Point, Wis. (July 8, 2008) -- Independent digital type designer Tim Rolands has released a new cross-platform OpenType font called Prospero Pro to mark the tenth anniversary of his first public font release.\n\nThe first publicly released font from Tim Rolands came just over ten years ago – a Nicolas Jenson-inspired oldstyle Roman called Prospero and distributed as shareware. Prospero Pro, a brand new OpenType remake of that early font includes completely redrawn letterforms that capture the character and spirit of the original while incorporating many improvements born of experience.\n\n\"The outlines are cleaner, scale better and have a much more even color,\" says Rolands, \"and the glyph set now includes numerous extended ligatures, alternate forms, swash forms and support for a wider range of languages.\"\n\nProspero Pro is intended primarily for book and magazine work and would be a worthy choice for display work such as posters, advertising, branding, identity systems, and more.\n\nFor a limited time, Prospero Pro is available from MyFonts.com for US$36.75, a savings of 25% off the regular price of US$49. Visit [http://www.myfonts.com/fonts/timrolands/prospero-pro/](http://web.archive.org/web/20140913094949/http:/www.myfonts.com/fonts/timrolands/prospero-pro/) for details.\n\nOpenType, a font technology jointly developed by Microsoft and Adobe, eliminates the need for multiple files in multiple formats, combining everything into a single cross-platform font file that supports large character sets and advanced typographic features. Visit [http://www.adobe.com/type/opentype](http://web.archive.org/web/20140913094949/http:/www.adobe.com/type/opentype) for more information.\n\nLong-time designer and type enthusiast Tim Rolands has released fonts exclusively through MyFonts.com since 2001. Current releases include the popular text font Envoy as well as Odyssey, Orlando, Miranda and the distinctive Anvil and Valor. Visit [http://www.timrolands.com](http://web.archive.org/web/20140913094949/http:/www.timrolands.com/) for more information.\n\nAll trademarks are the properties of their respective owners.\n\n###\n\n",
  "author": "timotheus",
  "time": "8 Jul 2008 — 7:06pm",
  "uid": "5658",
  "comments": [

  ]
}
