{
  "id": "47213",
  "title": "Font licenses for commercial use",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi, I have 3 questions related to licensing....\n\nI downloaded a bunch of free fonts online and now I'm looking to use them for commercial use. I can't seem to find where to buy the font license for these 2 fonts: Angelina and Kayleigh. Any ideas?\n\nAlso, does anyone know what company does sort of an overall font audit? Or is it just the individual font houses that do it for their own fonts? Who would I contact to ask licensing-related questions?\n\nLegal suggestions...I'm in CA and my biz partner is in PA and our printer is in IL. I was looking over the licenses for several companies and I'm overwhelmed with thinking that I'd have to buy 3 copies of each font. The CA and PA offices are NOT going to do any printing of the fonts only the IL printer. The co is based in CA, we don't need to file as an LLC in PA b/c nothing is being sold there. And, nothing will be physically sold out of the CA office because the printer in IL is going to do the shipping as well. So, do you think I'd need to by 3 copies of each font? Would one copy be sort of Kosher? (The co is just me and my biz partner.)\n\nThank you thank you!  \nJessica\n\n",
  "author": "jesslipton",
  "time": "8 Jul 2008 — 5:35pm",
  "uid": "20249",
  "comments": [
    {
      "time": "8 Jul 2008 — 5:42pm",
      "content": "[http://www.fontshop.com/support/mul.php](http://web.archive.org/web/20120623045858/http:/www.fontshop.com/support/mul.php \"http://www.fontshop.com/support/mul.php\")\n\n"
    },
    {
      "time": "8 Jul 2008 — 5:54pm",
      "content": "Same thing with Harrington, I can't find the co that makes it. Any ideas? Thank you.\n\n"
    },
    {
      "time": "8 Jul 2008 — 7:17pm",
      "content": "Harrington is from Font Bureau - it's a font bundled with various Microsoft products so it’s likely you may already be licensed.\n\nThe two freeware fonts seem to be unattributed so it may be hard to track down their designers. But they seem to be posted to the usual sites without a license, so there doesn't appear to be any restrictions on commercial use.\n\n"
    }
  ]
}
