{
  "id": "47232",
  "title": "Your thoughts?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm sure this has happened to others, but here's the back story: This was \"concepted\" by some co-workers on a day that I was attending a software seminar, and \"executed\" by a pre-college intern while I was away on a 25th anniversary trip with my wife.\n\nSadly, it is our \"new\" corporate logo.\n\nPlease respond truthfully, since I might need the \"ammo\" to make someone see the light.\n\nThanks in advance!\n\n| Attachment | Size |\n| --- | --- |\n| [Logo.jpg](http://web.archive.org/web/20131019185327/http:/typophile.com/files/Logo_3.jpg) | 670.21 KB |\n\n",
  "author": "Artboy34",
  "time": "9 Jul 2008 — 8:17am",
  "uid": "33637",
  "comments": [
    {
      "time": "9 Jul 2008 — 8:46am",
      "content": "Image gives me an error. Be sure that the JPG is an RGB JPG.\n\n"
    },
    {
      "time": "9 Jul 2008 — 8:50am",
      "content": "Well I'm sure you'll get more than enough ammo here, because for starters, design execution aside, this \"logo\" says nothing to me about marketing. And the only reason it is saying 'sustainable' is because it is throwing every cliche in the book out there (not that cliches are necessarily bad, after all they are immediately understood cultural elements, that, if used correctly and cleverly, can be wonderful springboards of communication). If I were to look at the logo, words aside, I would not know what the company does.\n\nSecondly, it looks very amatuerish. The weights of the type, the \"lettered\" 'H' 'M' 'A', the number of similar yet different elements, it's all too much. WAY too much.\n\nThat said, if it is something they are attached to, I could see similar elements and \"inspiration\" being used to create a more evolved, more refined evolution of this mark.\n\nLastly, this mark would not inspire confidence in me to do business with this company. Especially to handle my marketing when it appears they cannot even market themselves properly.\n\n"
    },
    {
      "time": "9 Jul 2008 — 9:42am",
      "content": "Not sure how to upload a corrected file, but might need to start a new thread.\n\nHere's the RGB version:\n\n ![](http://web.archive.org/web/20131019185327im_/http:/typophile.com/files/Logo_6704.jpg)\n\n"
    },
    {
      "time": "9 Jul 2008 — 11:06am",
      "content": "I second cmcd in saying this looks very amateurish. Sorry, but you're the Art Director / Creative Director of the firm and they come up with this identity while you're away attending a seminar?! It doesn't look like they respect you too much...\n\n"
    },
    {
      "time": "9 Jul 2008 — 11:07am",
      "content": "Did you say this is a sustainable fishing company? I love the reeds and the water flows ever so softly. WOW I totally agree with cmcd, WAY too much! There is nothing memorable, nothing marketable,nothing. I want to forget it, wipe it from my memory. k.i.s.s.\n\n"
    },
    {
      "time": "9 Jul 2008 — 11:36am",
      "content": "It's not really a logo in the sense that it's not a cohesive concept. It's just random type with random decorations.\n\nAlso, what does 'sustainable marketing' mean?\n\n"
    },
    {
      "time": "9 Jul 2008 — 11:41am",
      "content": "If you sold seaweed this might be the start of something - but even then it would need a serious re-work. For the purpose of marketing, in a word: No.\n\nIf they maintain that this has to be the logo, start looking for a new job, because they will not be able to bring in new business with this logo - barring corruption of course.\n\nUnfortunately Dan's comment \"It doesn’t look like they respect you too much...<cite>\" seems all too accurate! Another reason to start looking. And if that's your role there you shouldn't need the \"ammo\".</cite>\n\n"
    },
    {
      "time": "9 Jul 2008 — 11:56am",
      "content": "If you shrank this on to a business card, the tagline would be nothing but a choppy white blur. Furthermore, the M in Miller becomes two oddly spaced Ls because the connecting strokes are too thin. If you convert it to black and white, you'll lose most of the first two words and I suspect the whole logo would look like it's drowning.\n\nWorst of all, it's just garish. Too busy, too many colors, too many fonts that don't match, too much scale between the letters, too many bad curves. Too much!\n\nI work with environmental organizations all the time. It's a market full of extremists. I know instantly from a company identity if they're true professionals or just a bunch of idealists looking to earn enough money to buy pot and gas for their next week-long music festival. This logo says you're not even gonna make it to the festival across town, even stone-cold sober.\n\nPlease work hard to convince them to change this. There are far too many unprofessional hacks who want to be professional environmentalists to risk your company on a amateur logo. With a lame identity package, you'll be dismissed MUCH faster than in any other industry.\n\nEileen\n\n"
    },
    {
      "time": "9 Jul 2008 — 12:04pm",
      "content": "I think you might want to capitalize on what Eileen said in her first paragraph:\n\n<cite>If you shrank this on to a business card, the tagline would be nothing but a choppy white blur. Furthermore, the M in Miller becomes two oddly spaced Ls because the connecting strokes are too thin. If you convert it to black and white, you’ll lose most of the first two words and I suspect the whole logo would look like it’s drowning.<br>\n</cite>\n\nThis seems to be a clear argument against it which the the people who approved it could accept, while saving face. If you highlighted all the poor design ideas, you might put them on the defensive.\n\nAs I see it, the logo is unusable in most instances. Obviously it doesn't work at all in black and white, and would be difficult in grayscale too. Beyond that, if you sized it to use on business cards, stationery, envelopes, nearly any handheld sized printing application, the tag line would be too small to notice or read.  \nBut when you blow the logo up to a sensible size to read the tagline, the \"H\" M\" and \"A\" become so large as to be distracting, and they separate from the rest of the name.\n\nI'd go with that argument rather than pointing out the poor overall design, it'll be easier to get everyone to see your point and agree with you.\n\nJason C\n\n"
    },
    {
      "time": "9 Jul 2008 — 12:14pm",
      "content": "Jason has a very good point. There are so many mechanical issues with this that you can easily focus on that without even having to begin talking about the aesthetic issues.\n\n"
    },
    {
      "time": "9 Jul 2008 — 12:56pm",
      "content": "Thank you all for your comments. Sometimes it has to be enough that you know you're not losing your mind.\n\nPerhaps I'll wake up and this will all have been a cruel dream...\n\nMartin Bentley Krebs  \nDesignosaur since 1980\n\n"
    },
    {
      "time": "9 Jul 2008 — 4:51pm",
      "content": "Did anyone say it is...ugly?\n\nMechanicals and practicalities aside. It is just damn ugly!\n\n"
    },
    {
      "time": "9 Jul 2008 — 6:29pm",
      "content": "THANK YOU, JAYYY! That's been the 300-pound gorilla in the room! It is horribly, dreadfully, incredibly BUTT UGLY!!!\n\nMy day has been made.\n\n"
    },
    {
      "time": "10 Jul 2008 — 7:44am",
      "content": "I would like to emphasize again that I can't really imagine this same logo in pure black/white version. Some elements would have to go...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "10 Jul 2008 — 7:45am",
      "content": "I would like to emphasize again that I can't really imagine this same logo in pure black/white version. Some elements would have to go...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "10 Jul 2008 — 8:02am",
      "content": "Sometimes when I joke with friends, if we're talking about something that we both think is ridiculous, I say, \"If I had to represent this visually, it would be a picture of a giant ass.\"\n\nSince it's already in visual form, I'll represent it verbally: it's a giant ass.\n\nWhile on the one hand it speaks of a lack of respect for you as a professional, it also speaks of the lack of understanding and respect these folks have for the visual arts. Would anyone in your company think about making the same types of decisions for the company's attorney? Absurd.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "10 Jul 2008 — 10:30am",
      "content": "The tagline is like the cherry on top the ugly type/wavy/fugly colors mashup.  \nI hope that Artboy as Art Director / Creative Director you solve this as soon as possible.\n\n--  \n<cite>There must be some way out of here...</cite>\n\n"
    },
    {
      "time": "10 Jul 2008 — 11:19am",
      "content": "Oh, honey...  \nI usually like to be positive and uplifting, or at least non-committal and vague is something is not up to par, but this is just awful! On SOOOO many levels! So many thoughts come to mind - poorly crafted - amateurish - muddy - unprofessional - unreadable - no ability to reproduce - not distinct - not memorable - tells no story - does not communicate, well, anything positive at least...\n\nIt's the ANTI-logo!\n\nWhy have a logo if it does not communicate positively for your company.... whether it's what you do, your style, or at the very least that you are professionals at whatever you do. Just use a default typeface in WORD, make it a \"12 font\" and you are good to go. Don't waste time and say you concepted - for Pete's sake - it will make you a laughing stock!\n\nArtboy - you are so much better than this... the walls are speaking and they're saying \"Get Out!\"... but you know that already!  \nGodspeed!\n\nAA\n\n"
    },
    {
      "time": "12 Jul 2008 — 11:01am",
      "content": "I second flowerchild's sentiment: Get out! This shows an enormous level of disrespect towards you to rebrand the company while you're out of town.\n\n"
    },
    {
      "time": "22 Jul 2008 — 12:27pm",
      "content": "Sweet Jesus.\n\nSweet Jesus.\n\nSweet Jesus.\n\nCough.\n\n::sighs::\n\nJoseph Szala  \nVigor - an interactive branding strategy firm  \n [www.vigorbranding.com](http://web.archive.org/web/20131019185327/http:/www.vigorbranding.com/ \"www.vigorbranding.com\")\n\n"
    },
    {
      "time": "22 Jul 2008 — 12:56pm",
      "content": "What happened Martin? Did you tell them how it is? Do tell, i can't stand the suspense!\n\n"
    },
    {
      "time": "22 Jul 2008 — 5:02pm",
      "content": "indeed!\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20131019185327/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "28 Jul 2008 — 5:39pm",
      "content": "Yeah, about that...\n\nFor some inexplicable reason, the logo that was so \"hot\" to be produced has yet to have any files sent out for actual production, although there is a newly created Flash animation (think \"seaweed slapping farmers and hills\" to get a picture) that was done while I was vacationing with my family for three days last week (I'm seeing a pattern here...).\n\nI've been told that it's a bigger deal to me than it is to the owner. Good lord, it is **ugly**!\n\nMartin Bentley Krebs  \nDesignosaur since 1980\n\n"
    },
    {
      "time": "28 Jul 2008 — 7:07pm",
      "content": "ahhh well, back to saving lives I guess.\n\nheheh.\n\n;)\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20131019185327/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "30 Jul 2008 — 9:07am",
      "content": "This honestly looks like someone just discovered the pen tool.\n\nLooking at the logo, I have no idea what your company does. The only thing I would know about your company (other than the name) is that it's trying to piggyback on the \"being green\" fad. The colors are terrible and please tell me why the two background swashes are transparent? (seen in the section where they overlap.)\n\nTalk about a 300 pound gorilla . . . this has to be the ugliest most unmanageable rectangular block of a logo I have seen in a long while. It doesn't even deserve to be nitpicked or modified in any way. It simply needs to be tossed.\n\n"
    },
    {
      "time": "5 Aug 2008 — 12:52pm",
      "content": "Some simple ammo: legibility and readability. It's hard to read, it's difficult to remember: too much going on. No concise focus or effort to communicate something in-line with your marketing.\n\n"
    },
    {
      "time": "6 Aug 2008 — 2:55am",
      "content": "I'm dying to know what happened! Please give us an update! Did they change it? Did you get another job. Either would be a great ending to this story! :D\n\ncourtney\n\n"
    },
    {
      "time": "6 Aug 2008 — 5:16pm",
      "content": "Yes! Yes! Do tell!\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "24 Aug 2008 — 9:14pm",
      "content": "Ugly that it is... is it possible that they're just having fun with you? This seems like a huge elaborate prank.\n\nStill, I know the Lancaster area and this logo is in the realm of possibilities.\n\n"
    },
    {
      "time": "28 Aug 2008 — 6:46pm",
      "content": "It turns out that the ultimate \"evil\" behind this egregious example of design behaving badly was purely impulsive indecision – someone wanting something so quickly (a website using it) and so badly (new business development as a result) that sane reasoning and sound judgment were both sent packing.\n\nNothing, repeat NOTHING has been produced (thank God!) to this point, and we're (I say \"we\" as if I'm somehow actually involved in the process – it still hasn't been handed over to me for fixing as yet) going round and round with faint variations of it, asking everyone under the sun if they like it with blue swooshes and any of sixteen more typefaces from which to choose.\n\nI'm hoping to have the opportunity to unceremoniously burn all copies, discs, and printouts of it in a huge bonfire on the front lawn of our business complex, dancing shirtless and chanting barely intelligible names of typefaces that should join the inferno (\"Souvenir!\" \"Brush Script!\" \"The entire Korinna family!\"). Hope springs eternal.\n\nIf something redeeming comes out of it, I'll share it with all of you for truly valued critique and worthily appreciated commentary...\n\nMartin Bentley Krebs  \nDesignosaur since 1980\n\n"
    },
    {
      "time": "28 Aug 2008 — 9:07pm",
      "content": "I truly cannot believe that people are even deeming this worthy of variations. This is a sad day for graphics indeed. If they keep it, or any iteration thereof, I say you pack your things and go.\n\npenn\n\n"
    },
    {
      "time": "29 Aug 2008 — 7:27am",
      "content": "Why are you waiting for them to ask you to fix it? Since they haven't moved on printing that abomination yet, show them your ideas. Hopefully seeing a well crafted logo will lift the blinders from their eyes. And if they are smart they will not only thank you for showing them the error of their ways, but give you a big raise as well.\n\n"
    },
    {
      "time": "4 Oct 2008 — 2:29pm",
      "content": "Well, I am happy to report that indecision has led to a situation in which a new identity needs to be rolled out prior to a trip overseas to meet with new clients. I took the liberty (and the timely advice of some contributors here) to make changes and improvements to the most recent round of logos and created a workable logo and color palette. It's not what would have developed through a more \"normal\" course of action, but I think the end result (considering the constraints, and we've all had to deal with those!) is a vast improvement over what was going to be the \"final\" version I showed earlier.\n\nI'd greatly appreciate your feedback, and thanks for all of your support!\n\nMartin Bentley Krebs  \nDesignosaur since 1980\n\n ![](http://web.archive.org/web/20131019185327im_/http:/typophile.com/files/Logo091808_5252.jpg)\n\n"
    },
    {
      "time": "8 Oct 2008 — 12:48am",
      "content": "Ok. It does look better than the original, but it looks like a Web site header logo. Especially the first one. Can you present a simple BW version of these two?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "9 Oct 2008 — 9:34am",
      "content": "Thank you! Much better. I mean, yea looks a little web-ish, but that's an easy fix if it's even that important. I prefer the second one, but \"Associates\" sort of gets lost in the background colors. Also, the \"Miller\" looks a little squished. The counters in the first and last words are very open, and then Miller has a lot of vertical lines. So maybe open that up a bit. But again, thank you! I'm glad you got a chance to redo the logo.\n\ncourtney\n\n"
    },
    {
      "time": "11 Oct 2008 — 7:37am",
      "content": "Dear Artboy\n\nAfter reading every post I felt like I needed to comment but for the first time I found myself totally out of words. But returning today, I have a few. Thank you for stepping up to your job as a creative director. I felt your posts was kinda joking with the whole concept and that sort of pissed me off a little. You should have forced your way into this with a pencil in every hand and set people straight - as your jobtitle would demand. I'm sure you could have made 10 new logo sketches in one day that would have been better... a lot better! Your companys profile would have taken a beating and eventually your own job would be threaten. The owner of your company hired you because you knew something about graphic design that he himself didn't and the fact that he didn't even take his own companys profile so serious - just scares the hell out of me. I'm leaning towards the cries for you to leave this company ASAP... You coming here shows you care.\n\nYou certainly made a better logo for the company but I agree with the other post that it's webish and the word Associates is disturbed by the graphics.\n\nIn scandinavian design we have a saying \"keep it simple\"... I would suggest you try that. Remove what are not important and go ahead and save the day!\n\nYou can do it - because you care\n\nMark  \n [http://www.enterthemark.com](http://web.archive.org/web/20131019185327/http:/www.enterthemark.com/ \"http://www.enterthemark.com\")\n\n"
    },
    {
      "time": "11 Oct 2008 — 9:18am",
      "content": "I understand the urge to make a nod to the old seaweed but I agree with the others that a simpler more straightforward more sober solution is likely to be stronger even if it may seem too conventional at first.\n\nStill, you have clearly made you point. So congratulations!\n\nCertainly it isn't necessary now to quickly get another one out. Instead now that you have saved the ship, begin thinking about a) a better ship. or b) an even better solution.\n\n"
    },
    {
      "time": "11 Oct 2008 — 11:11am",
      "content": "This whole topic of discussion is deeply disturbing to me. I myself have been in a similar situation as a Web Developer/Graphic Designer. I am no longer with the company. Think of it this way. Would a company who hired an accountant or a production manager or an editor trust those people's duties to an intern? I would certainly hope not. People should be (in a RESPONSIBLE company) hired for a reason and given a clear description of job duties- which are not to be shared with others hired for separate reasons.\n\nYou were hired in as the expert in your area, and if you need \"help\" designing a logo, it should be left to YOU ALONE to delegate that assignment to someone YOU trust to help with YOUR job. If you are not allowed the responsibility to delegate your own work to those which you (as the expert) trust, then you are obviously not valued as the expert and your company should question why they hired you, if they cannot trust you as the expert to delegate your own work. You need to make them realize this. Let them know how important it is to allow department experts to delegate work from their own departments. Explain to them that nobody is an expert in everything, and the company NEEDS specialized experts in all fields in order to succeed. And in order for those experts to do the best jobs they can do - they NEED to be trusted.\n\nThe advice you should give this company you work for should be: \"Do not hire anyone you do not trust more than yourself in the area they are being hired into.\"\n\nNot everyone is trained to think critically about design, and how the way things look affect a company's image - and in what ways. Anyone can have an opinion, but designers look beyond what \"looks good\" because designing is a strategic process, to achieve what a company, or a client is trying to achieve.\n\nI'd definitely give them a chance to \"change their ways\", but if they don't understand the simple concept of job specialization by now, chances are, they never will. GET OUT of that place - It's going to go down in flames!\n\n"
    },
    {
      "time": "31 Mar 2009 — 6:53am",
      "content": "POSTSCRIPT 23 March 2009\n\nI am happy to report that I have a new job at a new company in a different line of work. Design should definitely be left to the experts, and when it is not — it is truly time to move on.\n\nAs I have done.\n\nMartin Bentley Krebs  \nDesignosaur since 1980\n\n"
    }
  ]
}
