{
  "id": "47286",
  "title": "Custom Numeric Fonts",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hey...\n\nHere’s the situation. I do the marketing for an appliance retailer. We are integrating our price tags into the entire company system. Unfortunately the program is CRAP! Our current tags have a drop shadow, we build them manually in Corel. Once we move to the program we cannot add the drop shadow. I posted on this forum about embedded drop shadows a few months ago. There were some pretty decent fonts. I didn’t mind retial script personally. However, not having layers you can’t have a red face and a black shadow. My boss then asks me to create a font for him that does..beacause I’m apparantly Super Man! Not that easy I tell him. Then pay someone he tells me. So, again I tell him that to my knowledge it isn’t that easy because when you create the font it is still just one single layer. You can’t have multi-layer fonts. But then again...I am by no means an expert. So...can you create a font with a red type face and a black drop shadow? I don’t think so because again it is the design software that allows the attributes to be changes, such as drop shadow, colour, etc. Can it be done or am I right on this one?\n\nThanks!!!\n\n",
  "author": "<a href=\"/web/20090519052044/http://typophile.com/user/23258\" title=\"View user profile.\">giggsy</a>",
  "time": "<br>",
  "uid": "23258",
  "comments": [
    {
      "time": " 10.Jul.2008 1.40pm",
      "content": "You can’t use a “normal” PostScript, TrueType or OpenType font in two colors. You have a couple of options:\n\n1) Using Fontographer or FontLab, you can (fairly) easily create a “drop shadow” version of a face - it would take a while, but compared to creating a face from scratch, it’s easy. Then you would have to set your type twice - one text box with the “normal” face, and one box (in the exact same position) with the “dropshadow” face. But this really isn’t any easier (or better) than simply crating two text boxes with the same font, and offsetting the lower one for the shadow.\n\n2) Some applications (and I doubt that corel is one of them) support alternative font types - Motion, for example, uses “LiveFonts” that can be almost any image/movie you want. FontLab is pushing their new “Photofont” app and format, which will let you use any bitmap image (with transparency) for the characters in a font, and it works with Photoshop.\n\n3) Doesn’t Corel support styles? Illustrator, for example, will let you define a style for an object (ex: White fill, black stroke, offset grey dropshadow) that you can easily apply/re-use to your heart’s content.\n\n"
    }
  ]
}
