{
  "id": "47310",
  "title": "Meet Me at TypeCon",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "We just had our last SoTA board meeting before we all gather in Buffalo for TypeCon, and I tell you, it's shaping up to be another great week.\n\nLast year, I know there were a number of Typophiles in attendance whom I did not really get a chance to talk to or even meet. Once again, I'll be managing some of the logistics, wrangling buses, and overseeing front-end this year; and I realize that when I'm in that mode I can sometimes put out a \"Don't bother me, I'm busy\" vibe. But don't buy into it. Seriously, come up and introduce yourself.\n\nYou might have to tell me your screen name or otherwise jog my memory. I always think about this too late to do anything, but wouldn't it be great if we could have figured out a way to cross-check the TypeCon registration database with the Typophile membership and get an image of every Typophile's avatar on the TypeCon badges. Sometimes it's tricky to match up a face & name to an avatar & screen name.\n\nHope to see lots of fellow Typophiles in Buffalo.\n\n-- Kent.\n\n",
  "author": "kentlew",
  "time": "11 Jul 2008 — 6:05am",
  "uid": "1215",
  "comments": [
    {
      "time": "11 Jul 2008 — 8:48am",
      "content": "Ditto.\n\n"
    },
    {
      "time": "11 Jul 2008 — 9:47am",
      "content": "Don't tell me the lights are shining anyplace but there!\n\nSame here y'all. I always look grumpy even after coffee.\n\n"
    },
    {
      "time": "11 Jul 2008 — 10:11am",
      "content": "[Not so!](http://web.archive.org/web/20130823225919/http:/www.flickr.com/photos/ebensorkin/1118099298/)\n\n"
    },
    {
      "time": "11 Jul 2008 — 10:59am",
      "content": "Horrors! That is clearly before coffee.\n\n"
    },
    {
      "time": "11 Jul 2008 — 11:31am",
      "content": "[This is not what I call grumpy.](http://web.archive.org/web/20130823225919/http:/flickr.com/photos/zara/1036446030/in/set-72157601323882950/)\n\nI too am looking forward to seeing everyone and meeting new folks. I'll be the one with the name tag that says \"zara.\" :)\n\n"
    },
    {
      "time": "11 Jul 2008 — 4:02pm",
      "content": "Wham! The wig strikes again!\n\nIt stinks that I'll be missing out on all of the fun. And I even had a friend in Buffalo who was willing to put me up for a few days!\n\n"
    },
    {
      "time": "11 Jul 2008 — 4:07pm",
      "content": "Kent, Stewf and Zara... look forward to catch up with you all soon ;-)\n\n"
    },
    {
      "time": "11 Jul 2008 — 7:36pm",
      "content": "I'm really looking forward to seeing people again, particularly after having to miss out on last year. I can personally vouch that almost\\* everyone above was a pleasure to hang out with.\n\n\\*Nothing personal, I've yet to meet a few of you. Hopefully that'll change.\n\n"
    },
    {
      "time": "12 Jul 2008 — 6:27am",
      "content": "I'm in Detroit, on my way to majestic Buffalo. I can't wait to see everyone! I'm really excited about all the speakers this year, but am jazzed at seeing Sagmeister for the first time and Herr Spiekermann yet again - he never fails to please.\n\nI probably won't look grumpy, before or after coffee - more likely dazed and confused, but happy.\n\nLet's work on the Typophile avatar thingie for next year. Who wants to take it on?\n\n"
    },
    {
      "time": "12 Jul 2008 — 4:29pm",
      "content": "Tamye - that is something we can definitely pursue here at Punchcut. I imagine the magical Christian can write a fancy script to automate the collection of avatars.\n\n"
    },
    {
      "time": "13 Jul 2008 — 1:08am",
      "content": "So sorry I can't be there. This will be the only TypeCon I've missed since my first 'Con; TypeCon Minnesota. This year overlaps with a personal, family engagement (we're wishing my parents off on their upcoming humanitarian mission).\n\nI'll miss the late night dinners with all kinds of random and fascinating conversations including watching design rockstars explain the Helvetica R on a cocktail napkin. I'll miss exploring random cities with friends that I only see once a year at the 'Con.\n\nEnjoy Buffalo! I'm also bummed that I won't see [P22](http://web.archive.org/web/20130823225919/http:/typophile.com/wiki/P22)'s home turf. =/\n\nRegarding the avatar/icon it's a great idea. I hope everybody will keep Twitter active with TypeCon action. Use the \"hashtag\" #TypeCon when you're there. Or you can post directly to Typophile from your smartphones.\n\n"
    },
    {
      "time": "14 Jul 2008 — 8:36am",
      "content": "Help a player out: What's the Typophile Avatar Thingie? Is that the tee design with all the avatars made into a T?\n\n"
    },
    {
      "time": "14 Jul 2008 — 8:47am",
      "content": "Carl, it is the TypeCon name badge that has your own avatar on it so that everyone will recognize you :-P\n\nChrisL\n\n"
    },
    {
      "time": "14 Jul 2008 — 8:53am",
      "content": "A-ha! I like that. I suppose anyone who feels inclined could print them out and stick them on their badge this year. Not automated, but still possibly helpful. Or someone could bring a button-maker and we could make buttons with the avatars....\n\n"
    },
    {
      "time": "14 Jul 2008 — 8:56am",
      "content": "Sounds like a plan!\n\nChrisL\n\n"
    },
    {
      "time": "14 Jul 2008 — 9:31am",
      "content": "Isn’t this why most of us use our real names on Typophile?\n\n"
    },
    {
      "time": "14 Jul 2008 — 10:20am",
      "content": "\\> _I suppose anyone who feels inclined could print them out and stick them on their badge this year._\n\nI'm doing that.\n\n\\> _Isn’t this why most of us use our real names on Typophile?_\n\nTrue. But for example, I have a photographic memory but am really bad at remembering names. It's more easy for me to remember someone's face than his/her name. So the avatars help a lot, even if you're using your real name.\n\n"
    },
    {
      "time": "14 Jul 2008 — 1:03pm",
      "content": "\\>_I’m doing that._  \ngood idea.  \nwhen trying to keep track of who said what in a thread, I find myself thinking kind of like: \"OK, Bold white \"J\" in a black square said... and white sans letters \"Ms\" in a red gradient filled square replied with...\" It's just easier that way :o).\n\n-=®=-\n\n"
    },
    {
      "time": "14 Jul 2008 — 1:38pm",
      "content": "Script R in a green field makes a good point :-P\n\nChrisL\n\n"
    },
    {
      "time": "14 Jul 2008 — 2:24pm",
      "content": "Carl, Should I bring my crafty button-maker? ;)\n\n"
    },
    {
      "time": "14 Jul 2008 — 3:38pm",
      "content": "I don't suppose it makes square buttons, does it Amy? In any case, if you do, we could all print our avatars a certain size and have buttons. What size buttons can you make? If they are bigger than an inch, it would be worth it. You can keep the button after the conference for other meetings.\n\n"
    },
    {
      "time": "14 Jul 2008 — 3:42pm",
      "content": "I can see the sign now \"Amy's Button Factory and Suvlaki Shop\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Jul 2008 — 6:07pm",
      "content": "Arrived a few hours ago myself, after a nasty 12-hour trip from Toronto (yeesh: a canceled flight from Toronto to NY last night - where I was to have dinner with friends before flying to Buffalo this morning - and thus 3 hours of sleep to catch the make-up flight to Laguardia at 6am, shuttle to JFK, delayed flight to Buffalo, &, etc., &c.; as I said: yeesh), and so stumbled into the Hyatt around 4:30pm, got the computer hooked up, had a long shower, and now about to crash.\n\nBUT, looking forward to the coming days. I'm planning on the shuttle-trip to RIT tomorrow, and already snuck a peek at the Grosvenor exhibit (it looks to be delicous, although it's simply not right that the books are held captive under glass).\n\nIs there usually some sort of informal gathering at these things to help identify who's here for Typecon?\n\nOh, and does anyone know where Paradise Press is? I'm taking in the letterpress workshop on Wednesday and can't find an address for PP...\n\nJason\n\n"
    },
    {
      "time": "14 Jul 2008 — 6:33pm",
      "content": "Isn't Toronto about a 3-hour drive to Buffalo?\n\nChrisL\n\n"
    },
    {
      "time": "14 Jul 2008 — 6:54pm",
      "content": "Don't get me started Chris (too late). When my flight from Toronto to NY got canceled last night, I attempted to book a bus from TO to Buffalo, rather than fly the 500 miles to NY only to turn around and fly back the same distance, and in the process I canceled my morning flight from TO to NY, and then attempted to cancel my NY-Buffalo flight, only to find that simply to KEEP my return flight from Buffalo-NY on the 21st it was going to cost $300. That's $300 for the privilege of NOT taking the NY-Buffalo flight. Makes sense, right?\n\nSo, onto the TO-NY flight went I, and then onto the NY-Buffalo flight, which was completely bungled by Delta. Why didn't anyone tell me not to fly Delta?\n\nBut, to return to your simple question: it's actually 2 hours. 125klms. My cab driver from the Buffalo airport to the Hyatt told me it would have cost $200 to take a cab.\n\nGood thing I'm half drunk on sleep deprivation, because for the moment the whole thing seems pretty funny...\n\n"
    },
    {
      "time": "14 Jul 2008 — 8:21pm",
      "content": "Partadise Press is located within Printing Prep. 12 East Tupper at at the corner of Washington Street. It's walkable from the Hyatt.\n\nThe Hyatt is on Pearl Street. Washington is two streets over. Head north on Washington a couple blocks and you'll hit Tupper.\n\n"
    },
    {
      "time": "14 Jul 2008 — 8:36pm",
      "content": "Hee hee. I am sleep deprived too but gleeful at the prospect of seeing you all again.\n\n"
    },
    {
      "time": "14 Jul 2008 — 8:40pm",
      "content": "I am so sorry, Jason. That is a horrible story. Who says airlines are a service industry. I wish you well and hope you have a better trip home. Take care and at least enjoy the conference. Say hello to everyone for me?\n\nChrisL\n\n"
    },
    {
      "time": "14 Jul 2008 — 9:35pm",
      "content": "So you won't be there either, eh, Chris? Same here. :-(\n\nHave fun, everybody!\n\n"
    },
    {
      "time": "14 Jul 2008 — 10:44pm",
      "content": "Following Joe's lead I've [posted](http://web.archive.org/web/20130823225919/http:/www.typecon.com/talk.php?id=186) a Twitter reminder on the TypeCon blog. There is also now a TypeCon Twitter account for official updates. Anyone I'm missing [here](http://web.archive.org/web/20130823225919/http:/twitter.com/typecon/friends)?\n\n"
    },
    {
      "time": "14 Jul 2008 — 10:48pm",
      "content": "I believe Jason Santa Maria is attending TypeCon this year and is also on Twitter.\n\nI'm so so so excited to see all of you! We leave in the morning and arrive tomorrow (Tue) early evening in time for the party. Yipee. Sleep deprivation here we come!\n\n"
    },
    {
      "time": "15 Jul 2008 — 4:33am",
      "content": "Ricardo -- Not coming? Darn, I was looking forward to meeting you (again -- and maybe remembering this time ;-)\n\nJason -- Sorry to hear about your travel woes. That reminds me of the recent hassle I had getting from Albany, NY, to Montreal for the AAUP conference -- 10 hours! (via Newark; don't ask). Same deal: It would have been faster to drive, if I'd only been able to forecast the delays. Come up to the mezzanine if you get a chance after RIT and say hello. (We'll be working here until about 5:00.)\n\nJonathan -- Thanks for posting the directions to Paradise Press. I'm sure I'll be getting questions about where to go tomorrow and hadn't gotten around to figuring it out.\n\nOne great thing about this year's location is that almost all of the workshops (except the letterpress ones) are just across the street from the hotel, so none of that nasty bus business (except for some of the evening off-site events).\n\nAnd the main presentation space, marketplace, and galleries are all pretty much right together, so no wandering around several floors trying to find things (or worse, for us organizers, schlepping boxes up and down and all around).\n\nToday: the goodie bag stuffing!\n\n-- K.\n\n"
    },
    {
      "time": "15 Jul 2008 — 5:13am",
      "content": "I was planning to go, but my wife broke her ankle over the July 4th weekend, so I am staying in Brooklyn to look after her.\n\nJamesM\n\n"
    },
    {
      "time": "15 Jul 2008 — 5:40am",
      "content": "Thanks for all the sympathy regarding my travel headache, but I obviously either made things sound much worse than they were, or else you folks are far too kind. Anyway, a decent night's sleep in a very comfortable room and all is well. Looking forward to meeting each of you over the coming days. And thanks, Jonathan, for the directions to PP.\n\n"
    },
    {
      "time": "15 Jul 2008 — 6:13am",
      "content": "I was planning to go, too, but work was slow in June! :-/ Maybe next year, Kent.\n\n"
    },
    {
      "time": "15 Jul 2008 — 6:14am",
      "content": "James --\n\nWhat?! Bummer. Give my best to Nora. I hope she's up and around again soon.\n\n-- Kent.\n\n"
    },
    {
      "time": "15 Jul 2008 — 6:17am",
      "content": "Stephen, can you sign me up for the Twitter list? Username is greenboathouse.\n\n"
    },
    {
      "time": "15 Jul 2008 — 6:40am",
      "content": "Was Nora giving you a roundhouse kick, James? :-)\n\nWish her a speedy recovery for me!\n\nChrisL\n\n"
    },
    {
      "time": "15 Jul 2008 — 7:17am",
      "content": "_“I suppose anyone who feels inclined could print them  \nout and stick them on their badge this year. ”_\n\nThat’s exactly the reason why I had some of these lovely [Moo stickers](http://web.archive.org/web/20130823225919/http:/www.flickr.com/photos/splorp/2177160414/) printed up last year. They’re both dandy and dandy.\n\n[\n ![](http://web.archive.org/web/20130823225919im_/http:/typophile.com/files/2177160414_cffc11502f_3524.jpg)\n](http://web.archive.org/web/20130823225919/http:/www.flickr.com/photos/splorp/2177160414/ \"Facebooks by splorp, on Flickr\")\n\n_“I believe Jason Santa Maria is attending TypeCon this  \nyear and is also on Twitter.”_\n\nThis is true. JSM’s Twitter account is [@jasonsantamaria](http://web.archive.org/web/20130823225919/http:/twitter.com/jasonsantamaria)\n\nMy Veer cohort Jon Parker is attending as well. He’s [@cacomixI](http://web.archive.org/web/20130823225919/http:/twitter.com/cacomixI)\n\nSee you folks on Wednesday.\n\n"
    },
    {
      "time": "15 Jul 2008 — 11:23am",
      "content": "I too will be arriving tomorrow morning, [hopefully] around 7:30am. I have a very, very long night ahead of me.\n\n@Grant - I love those stickers! And of course your photography makes them look that much more awesome.\n\nSee yizall tomorrow!\n\n"
    },
    {
      "time": "15 Jul 2008 — 1:22pm",
      "content": "Stephen please add me on... [http://twitter.com/tootsiewoo](http://web.archive.org/web/20130823225919/http:/twitter.com/tootsiewoo \"http://twitter.com/tootsiewoo\")\n\n"
    },
    {
      "time": "15 Jul 2008 — 1:53pm",
      "content": "I m pre boarding at Buenos Aires airport to NY then Buff arriving in 18 hours to the hotel.... see you soooooooon!\n\n"
    },
    {
      "time": "15 Jul 2008 — 3:52pm",
      "content": "See you all soon. Bummed I missed it last year like Chris R. but I'm looking forward to seeing the Usual Suspects and meeting new folks.\n\n-glenda (deguzman) bellarosa\n\n"
    },
    {
      "time": "15 Jul 2008 — 5:00pm",
      "content": "I'm hopping in my little hatchback and driving up from Philly tomorrow morning (into the evening). I hope to be there with enough time to make myself look human for the Sagmeister talk.\n\n[This](http://web.archive.org/web/20130823225919/http:/currentconfig.com/images/bbird3mos_2329.jpg) is what I look like (I'm the tall one). And I'll be wearing a shirt with [this R](http://web.archive.org/web/20130823225919/http:/rdesignltd.com/) on it, probably on Thursday.\n\nI can't wait to see/meet/party with you all!\n\n"
    },
    {
      "time": "15 Jul 2008 — 6:07pm",
      "content": "My son chose to be born two years ago this weekend and my wife insists said occasion should be marked. I suspect he did this on purpose. He's always been very willful.\n\nSo as you all get buried in a veritable lake effect of typographic inspiration, whip up a nice NJH monogram, would you? It will make Nathaniel happy and I'll feel a part of a creative community even if I'm only wiping frosting from places frosting should never be.\n\n"
    },
    {
      "time": "16 Jul 2008 — 4:32am",
      "content": "Xtian -- You were sooo close to making it happen this year. Silly Nathaniel.\n\nSo, is this going to be a regular problem? We haven't quite settled the dates for next year's Con (still negotiating with hotels), but we're aiming to keep it in mid July again. When is his actual birthday?\n\n-- K.\n\n"
    },
    {
      "time": "16 Jul 2008 — 4:46am",
      "content": "_next year’s Con_\n\nWhere will it be?\n\n"
    },
    {
      "time": "16 Jul 2008 — 6:31am",
      "content": "I'm hoping Nate's birthdays will be a regular thing, yes.\n\nHe was born July 21, 2006. He already recognizes many letter, but he's still weak on classification. He keeps calling Veljovic a Didone.\n\nI'll attend next year, one way or another.\n\n ![](http://web.archive.org/web/20130823225919im_/http:/typophile.com/files/Didone_5537.jpg)\n\n"
    },
    {
      "time": "16 Jul 2008 — 7:04am",
      "content": "Please add me to twitter. I've now met a few people and have toured around 20 basements in the lovely greater Buffalo area. There is some great type on old valves and furnaces. The air quality down there leaves something to be desired though.\n\n"
    },
    {
      "time": "16 Jul 2008 — 9:03am",
      "content": "Anybody know where I need to drop off the item I brought for the auction?\n\n"
    }
  ]
}
