{
  "id": "47320",
  "title": "Bitmap Arabic Font",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I’m trying to find an acceptable Arabic font that can be the basis for generating and displaying preferably in 8 wide x 16 high pixel characters, or alternately 16 x 16.\n\nIs that possible considering the complexities of Arabic ?\n\nAll suggestions welcome\n\nTony\n\n",
  "author": "apttony",
  "time": "11 Jul 2008 — 10:42am",
  "uid": "33258",
  "comments": [
    {
      "time": "11 Jul 2008 — 11:17am",
      "content": "Check out [Al Abdali 8](http://web.archive.org/web/20150324002822/http:/www.yanone.de/typedesign/alabdali8/).\n\nJens\n\n"
    },
    {
      "time": "14 Jul 2008 — 7:17am",
      "content": "Thank you Jens.\n\nI have had a look at the Al Abdali 8 font and from what I can see it looks promising.\n\nI have to admit that working with .ttf and .otf Font files, other than installing them into Windows, is something new to me, and I am having trouble seeing the form of the individual characters. Trying to insert each character into MS word is causing Word to crash.\n\nThe system into which I want to build the font, is an OEM piece of equipment with embedded firmware. It runs a 192 x 64 pixel display user interface, displaying pregenerated English text strings from within the embedded code. The user can also select to change to French, German, Spanish, etc. and we have had relative strings simply translated into the appropiate languages and stored in the code.\n\nWhen it comes to Russian, Greek, or Chinese, we have generated a bitmap look-up table for each character to be displayed.\n\nIdeally, I was hoping to do the same thing for Arabic message strings that have already been correctly constructed, but to do this I need to be able to see the full form of each character and it's code within the font table in order to generate the bitmap look-up table.\n\nOther than downloading the Al Abdali font file, I have so far been unable to find any other information, or make progress.\n\nAny advice, please\n\nTony\n\n"
    },
    {
      "time": "14 Jul 2008 — 10:07am",
      "content": "How about Tahoma? If you're interested in licensing a bitmap version of the font (which contains hinted outlines Latin, Greek, Cyrillic, Arabic, Hebrew and Thai) please drop Ascender a mail via [http://www.ascendercorp.com/](http://web.archive.org/web/20150324002822/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com/\")\n\n"
    },
    {
      "time": "16 Jul 2008 — 1:41am",
      "content": "Here is One of 100's sites offering products with Bitmap Arabic fonts:  \n [http://www.zikronline.com/newproducts.html](http://web.archive.org/web/20150324002822/http:/www.zikronline.com/newproducts.html \"http://www.zikronline.com/newproducts.html\")  \nSurely, one of them will guide you to the right site.  \nAll the Best with Flowers\n\n"
    },
    {
      "time": "19 Jul 2008 — 4:34pm",
      "content": "It is certainly possible. In the 1980s my brother and I  \nmade an Arabic font for the Commodore64: 8×8, with  \nthe bottom row unused! And it was entirely readable.\n\nThese days I make bitmap fonts with grayscaling:  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20150324002822/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")  \nIf this were applied to Arabic it would certainly help!\n\nhhp\n\n"
    }
  ]
}
