{
  "id": "47358",
  "title": "Help with Hebrew monogram",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": " I'm getting married soon, and I've been playing with this concept for a monogram on our wedding invitations. (Actually, I proposed with this design!) My initials in Hebrew are ייש, my fiancée's are הה, and my last name is spelled with a ש.  \n The basic idea was one of these two designs:\n\n ![](http://web.archive.org/web/20150415084539im_/http:/typophile.com/files/monogram%20concept_5764.jpg)\nI preferred the first, and the drafts below reflect that, but some folks have suggested the second version.  \n Trouble I'm having is with the middle head of the large ש. I've tried for something abstract, but I'm worried that it still looks like something \"belongs\" there. I avoided the usual shape for the middle head for exactly that reason: it looked like the letter ז or ו was intended.  \n\n ![](http://web.archive.org/web/20150415084539im_/http:/typophile.com/files/monogram%20draft%20ii_6540.jpg)\n\n ![](http://web.archive.org/web/20150415084539im_/http:/typophile.com/files/monogram%20draft_4667.JPG)\n  \n Any hints?  \n—Joel (יואל יחזקאל שרגא שאלאמון) \n",
  "author": "JCSalomon",
  "time": "12 Jul 2008 — 7:50pm",
  "uid": "19836",
  "comments": [
    {
      "time": "23 Jul 2008 — 8:53pm",
      "content": " Figured it out! See below.  \n—Joel\n\n ![](http://web.archive.org/web/20150415084539im_/http:/typophile.com/files/Monogram_6628.jpeg)\n\n"
    },
    {
      "time": "23 Jul 2008 — 11:35pm",
      "content": "The het does not work; also the he + shin. But Mazael Tov :)\n\n"
    },
    {
      "time": "25 Jul 2008 — 2:42pm",
      "content": " How does the ‘ח’ not work? Is it insufficiently distinct from the ‘ה’? I do note that I've been inconsistent about which has the left leg stick down & which up. I'd intended the ‘ה’ always to stick down & the ‘ח’ up; my hand on the pen had other ideas…  \n How 'bout the basic concept; does that work?  \n—Joel\n\n"
    },
    {
      "time": "26 Jul 2008 — 12:22pm",
      "content": "The concept is beautiful, but it's hard to make out the letters. Are these ה's on the left, or mem sofit? And the rightmost י is so close that my עין sees an עין!\n\n"
    },
    {
      "time": "26 Jul 2008 — 10:57pm",
      "content": " Eran: Are you referring to the original version, or the one I posted on July 23rd?  \n—Joel\n\n"
    },
    {
      "time": "27 Jul 2008 — 3:33pm",
      "content": "\\> How does the ‘ח’ not work?\n\nAmbiguity: het -- mem;  \nShin: looks like bet -- Rashi script.  \nVav: not the same; one of them looks like yod.\n\n ![](http://web.archive.org/web/20150415084539im_/http:/typophile.com/files/WedHebr_6501.gif)\n\n"
    },
    {
      "time": "28 Jul 2008 — 9:32am",
      "content": "I think the idea is appealing, so I hope I can explain without graphics:\n\nThe central element has a large centre with letters on both sides (stems). Except for the yod on the right, you have to guess them all. Without knowing which letters you mean, I read (RTL): ain, yod, mem sofit, mem sofit.\n\nThen, simha is not happy at all with the het and heh looking the same.\n\nBy the way, you should discount my modern bias.\n\n"
    },
    {
      "time": "28 Jul 2008 — 10:19pm",
      "content": "David: I see where the _ḥet_ (ח) & _heh_ (ה) might be confused (sorry simḥa!), but that's a bug in the Hebrew alphabet. If I were turning the surrounding text into a font I might try to differentiate them more, but in this context, with its well-known quote¹, I figured I could prefer ‘pretty’ over ‘more readable’.  \n That the _ḥet_ (ח) looks somewhat like the _mem_ (מ) from some fonts is harder for me to see; it certainly doesn't look like the _mem_ I'm using! Similarly with the _shin_ (ש) and the Rashi script _bet_ (ב): there's some similarity, but no real possibility of confusion.  \n The _vav_ (ו)/_yod_ (י) confusion is less excusable, so a bit of background: The style of the surrounding text came from an experiment I'd done in how wide I could extend Hebrew letters and have them recognizable. To distinguish the _vav_ (ו) from the _yod_ (י) from the _resh_ (ר) I chose to make the _yod_ as short as I could while keeping the basic shape and making the _vav_ the narrow exception to the extended style. The `bump' on the _shin_ (ש) and the awkwardness of the _ayin_ (ע) are both also results of this original design. I liked the _alef_ (א) I'd done, but it's only here in the tiny text.\n\nEran/Simḥa: I vaguely see an _ayin_ (ע) in the right stem—where I’d intended _yod yod shin_ (ייש), but I cannot see how the _heh heh_ (הה) on the left looks like a _mem mem_ (םם) to you. I guess I should take it in account anyhow.  \n … But: Once you know what letters they're supposed to be, do you see them, or still what you saw first? It doesn't need to be obvious _a priori_; if it works _a posteriori_ it's good too.  \n (Modern bias?)\n\n—Joel\n\n1. Jeremiah 33:10–11: “Yet again there shall be heard … in the cities of Judah, and in the streets of Jerusalem, … (11) the voice of joy and the voice of gladness, the voice of the bridegroom and the voice of the bride”.\n\n"
    }
  ]
}
