{
  "id": "47361",
  "title": "want to get something off my chest...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "And I’d like any opinions on it please. I’ve recently started a project for a new Delicatessen, designing their stationery, logo, wine & cheese cards etc. In addition, they own a bar and restaurant two doors down. I’ve not done any work for these guys before so I want to make a good impression.\n\nAnyway, they’re promoting some jazz nights at the bar and I did a A6/postcard flyer for these nights, which they then took to their printer - who incidentally lives literally around the corner from my office. Now what I usually do is either create a PDF with the fonts embedded as standard, and whoever (as in printers) I’m dealing with, this doesn’t seem to be a problem. If they prefer, I tend to save as an eps file with all font converted to outlines. The printer in this case work in CorelDraw on a PC - I work on a Mac using Illustrator. Anyway, with this in mind, on this occasion I converted fonts to outlines to avoid the historical font issues between the two platforms.\n\nNow the printer called me and asked for all the fonts and a version of the design with the text intact so that he could edit the text if it needed changing (I never send anything to a printer until it’s approved anyway, so they shouldn’t need to be altered). I explained to him that I wasn’t happy to hand over fonts that I’d paid for, and I also explained that if the fonts I’d used for Mac only it wouldn’t be any use anyway. He kept on insisting he needed the fonts, and that converting them to outline causes other problems - which he didn’t seem to want to elaborate on. He also let it be known that the client was actually with him at the time, which made me think “is he trying to make me look difficult or inadequately qualified in front of the client?”.\n\nAnyway, to cut a long story slightly shorter, I reluctantly handed over one of the fonts, so as not to appear awkward, but ended up having to replace another font for one of his fonts to make the artwork usable (this was Clarendon Bold, which I thought he’d have anyway). I was unhappy about this as the artwork wasn’t quite as I’d intended, and he’d sort of used the client (who he’s known for over 20 years), plus I felt manipulated into doing something I didn’t feel was right on a least two levels.\n\nAnyway, sorry for the rant but it left me annoyed and confused. I’ve been in design for about 10 years, but this guy has been in the print trade for over 30 and I did feel a little like a kid when he spoke to me, due to his years in the print trade! So, my questions to you guys are;\n\n\\* Is it ok to convert to outlines to avoid these issues, like all other printers I’ve worked with have suggested?\n\n\\* If he’s using CorelDraw, what format do you reckon is best for him, coming from Illustrator CS3?\n\n\\* Have any of you guys experienced this kind of thing yourselves, where you’re made to think you’re doing something wrong, even when you’re sure it’s right!?\n\nAny opinions gratefully welcome.\n\nJH\n\n [‹ Examples of elegant/classy/sophisticated layout & typography?](http://web.archive.org/web/20080720141857/http:/typophile.com/node/47539 \"Go to previous forum topic\") [Help me organize my fonts! ›](http://web.archive.org/web/20080720141857/http:/typophile.com/node/47273 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080720141857/http://typophile.com/user/23155\" title=\"View user profile.\">jazzhustler</a>",
  "time": "<br>",
  "uid": "23155",
  "comments": [
    {
      "time": " 14.Jul.2008 12.09am",
      "content": "From what I figure, the problem here is your printer (or his attitude).  \nMy clients don’t decide on the printer; I present a design which they approve, and then I deceide on a suitable printer (according to the needs of the project). I have worked with the same printer for a couple of years now, and I have never had any problems so far. He works on PC, I’m working on Mac. I provide PDF files with outlined text. I don’t provide fonts - ever. Works just fine.\n\nI only had an issue once with a PDF file generated through Illustrator, where an embedded Photoshop file was altered. It worked just fine on the Mac, but apparently not on PC. Unfortunately I only saw the error when I came collecting the job :-(  \nWe were able to sort out the problem by running some tests on his PC. So far I’m very happy with my printer.\n\n"
    },
    {
      "time": " 14.Jul.2008 5.02am",
      "content": "One way to discourage this sort of thing is to mention software legalities in your original contract with your client.\n\nWhile it’s hard to deal with a bullying client, you should really say no to a bullying third party, such as the printer in this case. Hopefully, your client will not see this as a negative, but respect your professionalism.\n\nPrinters are the last people that designers should let themselves be pushed around by, because the relationship should be the other way around—you want to be in the mindset where you say: the colour you printed doesn’t match the PMS number, reprint the job.\n\n"
    },
    {
      "time": " 14.Jul.2008 5.03am",
      "content": "“Anyway, sorry for the rant but it left me annoyed and confused.”\n\nI really feel sorry for you. What seems to have happened, based on previous similar experiences, is that the printer has convinced your client that he can modify and edit your designs for future events and save the client some money by not needing you as a middle go-between. I stopped using Quark years ago because it wouldn’t let me outline fonts. Since then I always outline fonts. With the fonts passed on to them, I’ve had printers make edits and completely bungle a layout due to their design ineptitude.\n\nBeyond what the crowd here would say about the EULA of the fonts, it’s more about your work. I would hate to be put in the position you were put in, but I’d have to tell the client and printer that any edits to my work need to be done by me. You might lose the client, but it doesn’t sound like the client cares too much about the relationship with you anyway and is looking to cut you out of the deal if possible.\n\n"
    },
    {
      "time": " 14.Jul.2008 5.34am",
      "content": "Get a better price include it into the complete design and printing cutting that muppet of a printer out of your life.  \n30 years of printing ... does not make them a good printer, 30 years of bad printing.\n\nPrinters should change anything, my printers just wont do it, they always ask for amended files.\n\nOR... say “yes can do” tell them the price of the font, buy it for them giving the printer the licence, on charge it. The printer is still going to stuff up your design and then try to cut you out of the loop all together....\n\n"
    },
    {
      "time": " 14.Jul.2008 5.46am",
      "content": "Right.  \nMany printers also do design work.  \nAs a “service” to your client, they would like to do other little jobs for him/her in the corporate style that you have designed.  \nSo why should you give your competitor the tools you have bought, for free?!\n\n"
    },
    {
      "time": " 14.Jul.2008 6.27am",
      "content": "And always remember that 90% of printers are cheap bastards who haven’t upgraded their equipment in years, and are still using old PostScript Level One RIPS if they can get away with it. If they can’t handle a PDF workflow than they shouldn’t be in the business.\n\nAnd charge your client for the fonts you handed over and buy another set of licenses to keep legal. And if they balk at that, you’d better consider letting them go as a client. How ethical are they going to be in the long run, if they condone and demand illegal activities from you.\n\n"
    },
    {
      "time": " 14.Jul.2008 6.44am",
      "content": "I’ve never heard of a printer who uses CorelDraw, and doesn’t have the current Adobe applications. That should tell you something.\n\n"
    },
    {
      "time": " 14.Jul.2008 6.46am",
      "content": "My parents own a veterinary clinic. They needed some signage for the front. They asked me to put it together for the sigh shop. I locked up their logo, along with the type converted to outlines per the template they sent, and emailed it out.\n\nA month or so later, after not hearing anything, my parents wanted me to come see the really nice lazer cut metal sign that they got mounted.\n\nThe first thing I said “umm...that’s not the font I sent”\n\nMoral of the story? Most printers/fabricators and pretty much all people, in general, are type illiterate.\n\nSo, to answer your question, this is a crappy printer and, well, sounds like a client that needs some more educating.\n\n"
    },
    {
      "time": " 14.Jul.2008 7.33am",
      "content": "Man, I’m so happy you’ve all taken the time to reply to this post. After I’d type it up, I did feel as though I was being a bit of wimp for doing so, but truth be told, the whole thing ruined my weekend in as much as the whole scenario was always in the back of my mind. What everyone has said it of course totally true, and it only confirms what I had known all along about fonts & licensing etc.\n\nConcrete, you’re so right when you state that 30 years in print doesn’t always mean he’s good. Funnily enough, someone else I do a bit of design for knows this printer, and has since told me some horror stories when dealing with him. In fact before this happened my friend’s first statement was “he can sometimes unnecessarily complicate things” which I know was him being diplomatic.\n\nWell I’ve decided, I’m in control of the design, so ultimately he’ll have to accept the files I send in the format I intended them to be. If he kicks up a fuss with the client, then I’ll just explain, and maybe even point them in the direction of this thread!!\n\nCheers guys\n\nJH\n\n"
    },
    {
      "time": " 14.Jul.2008 8.23am",
      "content": "The major issue for any printer you deal with should be: Is he/she capable of printing/outputting this job, as designed. Period. That means they need to become capable of handling PDFs and the resultant workflow. Any time I’ve allowed a printer to make changes, and every single time they’ve made changes to my work without consulting me, they have made mistakes, created bigger problems than they were trying to solve, or completely ruined the job. Unless you are part of a house that does design, prepress and print, those roles are best left separate.\n\nThis does not presume that designers never make unprintable work, but it is the general rule.\n\nIf the printer feels the need to make changes, that sounds like they are trying to get the work away from you and that possibly they have convinced a cheap or unethical client that they will save money this way. Delete both from your address book. They deserve each other. You should definitely talk to the client separately, and get a clear sense from them of their needs and intention. Ask them point blank if they are unhappy with your rates or with your work. Help them clarify why they use you and not Dimwit Printing for design. If they prefer cheap over quality, they should make that choice once and for all, and be professional enough to communicate that with you directly, and not enlist the printer to make an ugly mess as a cowardly mechanism for firing you.\n\n"
    },
    {
      "time": " 14.Jul.2008 1.39pm",
      "content": "I’m not intending to start a “which software is more professional” argument, but in my experience, the kind of printers who \\_only\\_ use Corel Draw are the kind of printers who focus on doing work for people who happen to have a copy of Corel Draw, and aren’t designers (so, things like business cards, flyers, etc.). They tend not to be too concerned about courting the business of designers, and thus don’t tend to stay very up to date with the software and methods that designers are using. So I’m in agreement with the others here. Avoid this guy (and others like him) if at all possible.\n\n"
    },
    {
      "time": " 14.Jul.2008 3.37pm",
      "content": "JAZZ:\n\nIf this cowboy is only using Corel Draw he should be out of business pretty soon. Anyway - you could just provide a generic EPS file with all fonts converted to outlines. That will open perfectly in any pro vector app.\n\nI worked in digital offset print prepress for five years in the late nineties and nearly all the files we received were in Quark 4 on Mac. This meant that all design studios sent us the original quark file, with separate graphic files used in the document AND all fonts used. Yes that is against most EULA’s but Adobe PDF was not a robust prepress application like it is now with spots, embedded fonts, PANTONEs etc.  \nWe always requested the designer’s fonts as even if we had the font there could be subtle differences in different releases or iterations of the same font which could ruin the typesetting of a job.\n\nMost of you guys here have a few years on me - what was your modus operandi during those years?\n\n"
    },
    {
      "time": " 14.Jul.2008 7.48pm",
      "content": "Nope, it’s not you: that sounds like an awful printer.\n\n"
    },
    {
      "time": " 14.Jul.2008 8.44pm",
      "content": "It sounds very fishy. I agree with those who say the printer is angling to cut you out and grab your part of the pie. If one is in the printing business, 90% (at least) of the work you’ll get will be in some sort of Adobe files. It would just be plain bizarre to try run a shop that only uses Corel. This from a Corel user. I would be possible, but not worth the effort. For the money and headaches you’ll save, go out and buy Illustrator, Indesign, & any other design software in use. (or in this guy’s case, steal them.)\n\nThe problems with fonts converted to outlines sounds like bunkum to me. Since Adobe so completely dominates the Graphic arts software biz, The one thing Corel has to do to survive is import Adobe files properly, which it does. The only time I’ve ever had any problem has been due to version compatibility issues (older version trying to import files saved as a newer version).\n\n(edit to add, Corel’s support of Open Type only extends to the common character set so it could cause problems, but not if converted to outlines)\n\n-=®=-\n\n"
    },
    {
      "time": " 14.Jul.2008 8.51pm",
      "content": "AS noted, it’s very odd that any printer only uses CorelDraw. If they are a PC shop, and their designers prefer CorelDraw, that’s fine. But how could they survive not having any Adobe apps? This cant’ be the first and only time this has happened. If they were a serious Printer they’d have to have the Adobe CS, even if they preferred to use CorelDraw for their in house designs.\n\nI use CorelDraw all the time, and I can’t see any issues with converting the fonts to outlines, except that the files will get larger, possibly much larger, if there’s a considerable amount of text. This would only be an issue if the printer used inadequate hardware, for instance if his machine lacked the memory to process it. This could be the problem, and rather than fess up to not having current machines, he’s putting the blame on you by saying there are phantom “other issues” with using outlines.\n\nJason C\n\n"
    },
    {
      "time": " 15.Jul.2008 12.56am",
      "content": "Thanks for the additional comments guys. This of course all serves to show me that it’s all puff and smoke from the printer, which I’d previously stated was my suspicion, certainly with the “fonts as outlines causes problems” argument. I’ve since spoken to client, and they assure me that they’re happy with my work and will not be expecting the printer to do any of the graphics work. He has done stuff on the cheap for them in the past, and they’ve been happy with it because the design work only needed to be functional in the most basic way.  \nThe Deli they’re opening is in an affluent suburb, so I’ve made them realise that style and consistency is an important aspect of the look for their new venture.\n\nThanks again for all the comments. It really helps a lot.\n\nJH\n\n"
    },
    {
      "time": " 15.Jul.2008 5.40am",
      "content": "I did not head all of the above, but what I can figure is that the printer doesn’t have software. For that you can provide a eps with text converted to curves, so they can import it to whatever they have. They want the fonts so they can do design or typeset whatever for their customer, which is your customer.  \nIf you give up the fonts or your files, they will use it, and by doing that they will get you OUT of the way. Sorry.\n\nDoes anybody knows a reality show about graphic designers? If not, it would be an interesting TV show.\n\nAndré\n\n"
    },
    {
      "time": " 15.Jul.2008 6.01am",
      "content": "you clearly have the upper hand here. i would simply reply to the printer:  \nyou shouldn’t have to modify these designs, but if you must you’ll have to buy the font for your own system. end of story. did he also ask for your wacom tablet and air conditioner ?\n\n"
    },
    {
      "time": " 15.Jul.2008 6.07am",
      "content": "<cite>Does anybody knows a reality show about graphic designers?</cite>\n\n_Project Brochure_ or _Project Logo_ Don’t quite make it.\n\nBut _Collateral Damage_ might work as a series.\n\n"
    },
    {
      "time": " 15.Jul.2008 11.51am",
      "content": "<cite>Does anybody knows a reality show about graphic designers?</cite>\n\nProject Brochure or Project Logo Don’t quite make it.\n\nBut Collateral Damage might work as a series.\n\nI’m storyboarding the opening credits already.\n\nJac  \n_“pronounced by saying ’Jake’ without conjuring imagery of lumberjacks or mans best friend.”_\n\n"
    },
    {
      "time": " 17.Jul.2008 1.16am",
      "content": "I read your initial post and straight away guessed that the printer was being difficult because he had previously charged for producing the artwork and ’design’ for this Deli business. Info which you have added in a further post.\n\nSupplying a job as a high res pdf is pretty much becoming the industry standard now.\n\nYou have taken away some of his income and he is just being difficult.  \nHe knows the client, and knows they are ’in the dark’ when it comes to the print processes, so I guess considers them a soft touch.  \nYou do have to be careful as the printer will almost definitely cut you out of the loop and go direct the client questioning your ability to supply the artwork ’properly’ even if this is obviously not true, so he can charge to put it right.\n\nIf its not to late, and even if it is, get another quote from a ’proper’ printer and put it to your client. My guess is that it will be cheaper (and better quality) than the existing printer. I would be so annoyed if I was in your position that I would not even add the 30% handling charge and just put your client in touch with a printer you trust.\n\nGood luck\n\n"
    },
    {
      "time": " 17.Jul.2008 5.42am",
      "content": "Thanks for the advice Belleisle. There’s more work to do for the deli, and I know they’ll want to stick with the printer (at least for the time being). I have another postcard that they’ll be wanting printed soon, so I’ll be tackling the printer head on this time, and be presenting the file as I see fit. I hate confrontation, but I’m going to be straight with him.\n\nCheers\n\nJH\n\n"
    },
    {
      "time": " 17.Jul.2008 7.45pm",
      "content": "Yeah, I’ve done this kind of stuff in the past: no you can’t have the font, no I will need to supply a new version of the file if there are changes, yes I know I’m the only person who does it this way, no I’m not expecting a medal for this. And each time I’ve dreaded the confrontation and felt sick and so on. But it’s a good thing to do, because it’s the right thing to do. I do it cause I want to respect the authorities that ultimately God has put in place (whether I agree with all the laws or not) for the sake of an untroubled conscience which is worth more than the cost of a confrontation with a grouchy printer. Anyway, good on you.\n\nDo people really outline fonts for big jobs like book files?\n\n"
    },
    {
      "time": " 18.Jul.2008 1.23am",
      "content": "No its not Okay! there is something terrible fishy about this chap.  \nits impossible that a printer is using, Corel, where as most of them (rather all of them )use Adobe.  \nit has happened rarely with me, but i stuck to what i feel, whatever may be the repercussions!  \nVik  \n————  \n [Local Directory](http://web.archive.org/web/20080720141857/http:/ilsmedicalreference.org/)\n\n"
    },
    {
      "time": " 18.Jul.2008 12.33pm",
      "content": "The only time I’ve seen someone in the print trade use Corel before was a print & copy shop in the centre of town where I live. I guess they had that for working with files from the common man/woman on the street, but I’m sure they had some Adobe stuff as well and they definitely had an older version of Quark.\n\nI used to have a version of Coreldraw years ago on an old PC. I used to love it’s 3D modelling feature, but Illustrator’s had that for a while now.\n\nJH\n\n"
    }
  ]
}
