{
  "id": "47377",
  "title": "Universal Type Server",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Has anyone tried this out?  \n [http://www.extensis.com/en/products/universaltypeserver/index.jsp](http://web.archive.org/web/20131013200627/http:/www.extensis.com/en/products/universaltypeserver/index.jsp \"http://www.extensis.com/en/products/universaltypeserver/index.jsp\")\n\nWe're thinking of giving it a go but I was unable to find any posts about it here.\n\nthanks\n\n",
  "author": "Will Miller",
  "time": "14 Jul 2008 — 9:13am",
  "uid": "4552",
  "comments": [
    {
      "time": "14 Jul 2008 — 10:43am",
      "content": "I haven't tried it out yet, but I went to a meeting/ presentation last week presented on-line by Extensis.\n\nThere were a lot of participants, so not all questions could get answered. It did look pretty impressive, especially for larger companies. I liked the way the end user client can see several preview fonts at once and easily scale them as well. It seems like it extensive on features. It even keeps track of license agreements for fonts to some degree. I think they said that was for end users only as they didn't want to get into a position of being font police.\n\nI'm not real clear as yet how it deals with font caches.\n\nStephen\n\n"
    },
    {
      "time": "14 Jul 2008 — 3:35pm",
      "content": "We have a recorded Universal Type Server webcast, as well as another live webcast coming on July 22 at 11 am Pacific. View or register [at the Extensis site](http://web.archive.org/web/20131013200627/http:/www.extensis.com/en/support/webcasts/).\n\nYou may also want to check out [this independent review by IT Enquirer.](http://web.archive.org/web/20131013200627/http:/www.it-enquirer.com/main/ite/more/uts/)\n\nRe: font caches, Type Server stores them locally in the library folder of the user's machine, hidden and \"in disguise\" to prevent users from accidentally accessing and deleting them.\n\nCindy Valladares  \nProduct Marketing Manager, Extensis\n\n"
    }
  ]
}
