{
  "id": "47388",
  "title": "Should accents be scaled by case?",
  "forum": "Design",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20081201152731im_/http:/www.typophile.com/files/accents_5940.png)\n  \nTop: accents all the same size.  \nMiddle: lower case and small cap accents are the same size, cap accent slightly bigger.  \nBottom: accents progressively sized.\n\nIn many faces (but not all), I vary the angle of the acute, grave and circumflex/caron accents between cap, small cap and lower case.  \nHowever, I always make the tilde, ring, dieresis etc. the same size—through laziness as much as anything else, I guess.  \nHowever it ocurred to me while making the “N small cap with tilde” accent here that perhaps these accents should be sized according to case. (Actually, I have had this thought before, concerning the “attached accents”, ogonek and cedilla.)  \nI wonder if there are any types where this has been done?  \nIs it a good idea?\n\n [‹ Pasting arabic text in Indesign cs3](http://web.archive.org/web/20081201152731/http:/www.typophile.com/node/42608 \"Go to previous forum topic\") [A typographic connection to Dorchester, UK? ›](http://web.archive.org/web/20081201152731/http:/www.typophile.com/node/47662 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201152731/http://www.typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": " 14.Jul.2008 1.46pm",
      "content": "I think it is a case-by-case issue. What looks good for a prticular font is good but not necessarily law for all fonts.  \nI like #2 best in the above tlde case. For ogoneks, I make different ones for i than for wider letters and for curved bottom letters like u, I make a joining adjustment.\n\nChrisL\n\n"
    },
    {
      "time": " 14.Jul.2008 2.29pm",
      "content": " ![](http://web.archive.org/web/20081201152731im_/http:/www.typophile.com/files/accntz_5630.png)\n\nI went to the same thoughts when I was working on the accents for Calluna (not ready yet). I widened the dieresis and tilde. Scaling them made them too fat.\n\n"
    },
    {
      "time": " 14.Jul.2008 5.45pm",
      "content": "What about small caps Jos?  \nIt’s there that the difference in scaling of the letter and the accent is most obvious.\n\n"
    },
    {
      "time": " 15.Jul.2008 11.13am",
      "content": "Nick, I agree with Chris on this one. It can be a good idea, but it depends on your design. In your case I would opt for version #2 but with the capital accent scaled but a little less heavy. Your post is good food for thought and set me to think about my own small caps accents also. In my case I guess I’ll have to try something that lies in between U&lc.\n\n"
    },
    {
      "time": " 17.Jul.2008 3.46am",
      "content": "“Is it a good idea?”  \nThe bigger the gap between the heights and weights of the l.c. and u.c., the more likely the need for case sensitive accents. Text vs. display also plays a part, as does of course, design energy.\n\nCheers!\n\n"
    },
    {
      "time": " 20.Jul.2008 8.51pm",
      "content": "Most Adobe Originals of the past decade have at least two sizes of accents.\n\nT\n\n"
    },
    {
      "time": " 20.Jul.2008 11.54pm",
      "content": "Two sizes I think will generally be sufficient, unless of course you’re going to do accents on raised characters as well (I think someone mentioned in another thread that French at least needs a raised é for some ordinal numbers maybe?).\n\nAlthough this font in particular I don’t see having a full set of superscript and subscript (though I could be wrong).\n\nMore randomly, I just found a unique new capital Ñ that looks like an inverted breve, something I (seriously) hadn’t seen before untiL I saw it yesterday, so you could just go with a totally new shape for the cap and a smaller version for the small cap and then the normal version for the lowercase ;-)\n\n ![](http://web.archive.org/web/20081201152731im_/http:/www.typophile.com/files/oddtilde_5203.jpg)\n\nIn all seriousness, I’d go with whatever feels best. In this example the second one looks best to me, but in part ’cause I like all my diacriticals to be, as much as possible, vertically aligned.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 21.Jul.2008 9.43am",
      "content": "_Most Adobe Originals of the past decade have at least two sizes of accents._\n\nCan you give examples of some that have more than two?  \nIs the third size for small caps?\n\n"
    },
    {
      "time": " 21.Jul.2008 10.28am",
      "content": "I have a vague memory of seeing Adobe with ordinals having diacritics. This might only be a dream so hopefully, Thomas can give a definitive answer.\n\nChrisL\n\n"
    },
    {
      "time": " 29.Jul.2008 8.50am",
      "content": "If there’s a \\*third\\* accent size in any Adobe typefaces, it would be for small caps, yes. I’m afraid I haven’t tracked it carefully enough to know for sure which of our typefaces (if any) do this, besides my own Hypatia Sans. I believe it would mostly be more recent Slimbach designs.\n\nBTW, like Jos, we don’t only do scaling. In many cases the cap accent is wider but flatter (proportionally speaking) than the lower case accent.\n\nI wasn’t counting ordinals or superiors. We have recently started doing e with grave in that size. But that’s pretty obviously going to get a different size accent!\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 30.Jul.2008 9.34am",
      "content": "Hi,\n\nI see the problem, depends how you’re gong to display it. I am Polish designer, working many years in the West.  \nWe had this problem introducing many new typefaces in Poland and Eastern Europe. So called: diactric signs.\n\nIn running body text diactric signs would NOT be scaled down.\n\nCheers,  \nLech\n\n"
    },
    {
      "time": " 31.Jul.2008 6.54am",
      "content": "Lecho\n\n ![](http://web.archive.org/web/20081201152731im_/http:/www.typophile.com/files/Weiss_4025.jpg)\n\nHere is a sample of Weiss typeface “polonised”. See diactric signs.\n\nCheers,  \nLech\n\n"
    },
    {
      "time": " 31.Jul.2008 7.02am",
      "content": "Hi,\n\nThe only major visual difference is letter “ł” [eu] upper ca and lower case. Where diagonal slash is shorter.\n\nCheers,  \nLech\n\n"
    },
    {
      "time": " 31.Jul.2008 8.46am",
      "content": "Almost all of our designs have separate accents drawn for Uppercase, lowercase and small caps.\n\nJamesM\n\n"
    },
    {
      "time": " 31.Jul.2008 10.33am",
      "content": "Lech, could you show Weiss “E with ogonek”, comparing capital with small capital. In a setting preferably.  \nOn a related issue, how often do the ogonek characters appear at the beginning of words?\n\nJames, could you show some of your tilde accented characters, comparing caps, lower case and small caps?\n\n"
    },
    {
      "time": " 31.Jul.2008 11.03am",
      "content": "Nick,\n\nThis is from something we are currently working on.\n\n ![](http://web.archive.org/web/20081201152731im_/http:/www.typophile.com/files/accentedc_glyphs_4203.jpg)\n\n"
    },
    {
      "time": " 31.Jul.2008 1.28pm",
      "content": "Thanks James, that’s nicely done.  \nMy, aren’t those small caps big!\n\nBTW, 590 pixels wide is the widest image that won’t go into scrollbar mode on Typophile.\n\n"
    },
    {
      "time": " 31.Jul.2008 3.03pm",
      "content": "<cite>My, aren’t those small caps big!</cite>\n\nSince working with Maxim on some cyrillic designs, I’ve started to make all my small caps larger so they work better with their cyrillic counterparts. And while there is currently no cyrillic counterpart to this design, who know what the future holds.\n\nThanks for the advice on image size, I’ll pay more attention to that in the future.\n\nJamesM\n\n"
    },
    {
      "time": " 31.Jul.2008 4.42pm",
      "content": "@ gulfa\n\nThe “Ñ” in “Nestra Señora” may not be a actual accent ( a tilde); it seems to me that it is ´postizo´, false, a piece of other available character used by the typographer. Doesn’t look like a parenthesis? Some metal type doesn’t have accents, to solve the problem false ones are aligned to the character with a accent . That is what appears to me. Just a thought .\n\n"
    },
    {
      "time": " 31.Jul.2008 8.42pm",
      "content": "AGL: While I’ve definitely seen mistakes like that, this is consistent in the entire book (every capital Ñ uses this mark), but I find it essentially impossible to believe that the typesetter didn’t have tildes available, it’s a wholly requisite character for Spanish printing and would be like not having a Z. For reference, the book was printed in 1722 in Madrid, which, granted, is out of my general time period of study. I’m going to try to look up some other examples to see if this was a particular quirk of either the printer or the period, but most of the time a mistake with the tilde is to accidentally print it in reverse like I’ve seen a few times from Iuan de la Cuesta’s presses (which I’ve seen in New Mexico’s highway signage too!)\n\nThat said, it doesn’t look too odd to me since at that time, italic tildes actually were far more like breves (in almost all instances I’ve ever seen prior to about early 1800s). In fact, on a Spanish passport, on the inside front cover, this traditional and almost extinct form is still used (unfortunately I didn’t take a picture of it when I had the chance)\n\n ![](http://web.archive.org/web/20081201152731im_/http:/www.typophile.com/files/tilde_breve_5489.png)\n\nIt warrants investigation whenever I can get some free time to do it.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 1.Aug.2008 5.16am",
      "content": "Gulfa: Ah OK, You are aware of this practice. The question then is, why the typographer used that sign as a tilde.  \nI suppose the typographer while examining the manuscript realized that he did not have enough tildes to compose four pages (a possible spread back then), and so he decided to use something else, even parenthesis, and keep the style over the whole book. Is possible, I am just speculating.  \nA curiosity: I learned from a old time typographer in Seville that, due to the use of german, english or american mats on linotype or monotype composing machines without accents, it become sort of a ’rule’ not accent capital letters (accute accents) except the “N” , which you know is not a accented character. Cheers.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n” El que vino a este mundo, se vino a beber vino, ¿si no, porqué vino? “\n\n- Anónimo Mejicano\n\n"
    }
  ]
}
