{
  "id": "47413",
  "title": "TypeIsArt",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "Please take a look at [www.TypeIsArt.com](http://web.archive.org/web/20150317182128/http:/www.typeisart.com/) it was recently re-released with some additional features and a new interface design.\n\nTake it for a spin... and let me know what you think. Any feature requests? Typefaces you think would make for a good Special Edition? I'm working up a list for the next version and would love to have your opinion.\n\nIf you happen to be in Buffalo for TypeCon2008 this week please stop in at [SP@CE224](http://web.archive.org/web/20150317182128/http:/www.224allen.com/) between the end of the day and any night's festivities (5PM-9PM). If the door is locked, ring the white doorbell and I'll open up. We are just a block South and a block West from the venue where Sagmeister is speaking on Wednesday.\n\nLet me know you're in for TypeCon2008 and I'll uncork a bottle of Ex-Libris Cabernet Sauvignon.\n\n ![](http://web.archive.org/web/20150317182128im_/http:/typophile.com/files/TIA_mini_4447.jpg)\n\nHere are some tips for those who bothered to scroll down this far.\n\n- There are several key combinations that affect the selected object. (move/rotate/scale)\n- Hold down the space bar and use the arrow keys to move all objects at once.\n- Don't forget to save!\n- Let it sit for 10 minutes for an animated treat.\n- Check it out again soon to see the first Special Edition featuring a treat from the folks at P22.\n\n",
  "author": "J.R.",
  "time": "14 Jul 2008 — 11:01pm",
  "uid": "33658",
  "comments": [
    {
      "time": "11 Aug 2008 — 7:57pm",
      "content": "I created a similar tool called Alphabet Soup back in 2000:  \n [http://www.theory.org/artprojects/alphabetsoup/](http://web.archive.org/web/20150317182128/http:/www.theory.org/artprojects/alphabetsoup/ \"http://www.theory.org/artprojects/alphabetsoup/\")\n\n"
    },
    {
      "time": "30 Dec 2008 — 9:59pm",
      "content": "Track\n\n"
    }
  ]
}
