{
  "id": "47440",
  "title": "Upscale Jewelry Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nWe are trying to redesign the logo for an upscale jewelry in San Juan. They mostly sell very expensive watches. The brand must represent luxury and also the client wants a symbol they can use alone. Don't pay any attention to the name because it doesn't have any relation to luxury, jewelry or anything for that matter.\n\nHere is the current logo:\n\n ![](http://web.archive.org/web/20140830114541im_/http:/typophile.com/files/logo_jibarito_5478.gif)\n\nThis is the proposed logo used in various sample executions:\n\n ![](http://web.archive.org/web/20140830114541im_/http:/typophile.com/files/200290680-003_1_4237.jpg)\n\n ![](http://web.archive.org/web/20140830114541im_/http:/typophile.com/files/maria-menounos-chopard-and-valentino-dinner-party-cannes-3_1_5818.jpg)\n\n ![](http://web.archive.org/web/20140830114541im_/http:/typophile.com/files/Gad-Elmaleh_1_5179.jpg)\n\nWhat do you think?\n\nE.\n\n",
  "author": "vivirenet",
  "time": "15 Jul 2008 — 1:30pm",
  "uid": "7501",
  "comments": [
    {
      "time": "15 Jul 2008 — 2:27pm",
      "content": "The mark feels like it is falling over-very top heavy.\n\nThe kerning with the J and I is funky.\n\nDavid\n\n"
    },
    {
      "time": "15 Jul 2008 — 3:13pm",
      "content": "For those not in the know, \"Club Jibarito\" is a funny name for an upscale jewelry store because it basically means something along the lines of \"Little Hillbilly Club.\" No matter; my last name is \"Hladek,\" and I'm half Puerto Rican, so go figure.\n\nI second David's perspective. The proposed logo doesn't have very good balance. The 'j' makes it top heavy, and yet, at the same time, the 'C' is too big. Not a bad direction, though.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "16 Jul 2008 — 5:53am",
      "content": "I agree; the 'CJ' feels like it's about to fall over. Could the tail of the J become the bottom of the C?\n\nRoss\n\n"
    },
    {
      "time": "16 Jul 2008 — 9:13am",
      "content": "or extend the bottom of the c to balance the j, but i'd leave the icon and work on the text. all caps? I like \"club\" in all caps but i'm not a fan of \"JIBARITO\". Good luck.\n\n"
    },
    {
      "time": "16 Jul 2008 — 11:17am",
      "content": "How about turning the 'C' around counter clockwise to symbolize a necklace around a neck which in this case would be the 'J'. This takes care of the top heavy issue. Just a thought...\n\n"
    },
    {
      "time": "16 Jul 2008 — 4:33pm",
      "content": "Your mock-ups illustrate a scale problem with your tag line. Notice yours is the only logo with text that's too small to read? Otherwise, I agree with everything vintagesignman said. The capital J and I are competing with each other, and no amount of obsessive kerning will ever help.\n\n"
    },
    {
      "time": "17 Jul 2008 — 8:00am",
      "content": "Thanks to everyone. I really agree with all the comments, specially those that comment on the heavy top of the mark... and the J-I issue!\n\nWe will be working on some changes and I'll come back!\n\nE.\n\n"
    },
    {
      "time": "21 Jul 2008 — 8:06am",
      "content": "andix has a point with the kerning between JI but also and AR\n\n"
    },
    {
      "time": "21 Jul 2008 — 8:03pm",
      "content": "<cite>kerning between JI but also and AR</cite>\n\nexactly.\n\n"
    },
    {
      "time": "4 Aug 2008 — 7:25am",
      "content": "Hi,\n\nI am back with a small fix. What do you think?\n\nE.\n\n ![](http://web.archive.org/web/20140830114541im_/http:/typophile.com/files/3(2)_3660.jpg)\n\n"
    },
    {
      "time": "4 Aug 2008 — 1:08pm",
      "content": "The C in the mark does not match the C in the name. It looks odd when it is the only letter with the serif on top, give it the serif on bottom and the curl on top like the mark. I like the mark more now than before.\n\n"
    },
    {
      "time": "4 Aug 2008 — 1:19pm",
      "content": "The mark is nice, but seems to be emphasizing \\*C\\*lub rather than \\*J\\*barito.\n\nWhich is maybe OK, but it seems that Jibarito is the unique identifier and should be getting the emphasis.\n\nWhat if the ligature was a lower case c with it then up-turning into a larger J?\n\n"
    },
    {
      "time": "5 Aug 2008 — 3:31am",
      "content": "To me the 'C' and 'J' looked like a 'G'.\n\n"
    },
    {
      "time": "6 Aug 2008 — 3:17am",
      "content": "Well you fixed the top heavy thing with the serif, so it hold it up a lot better, visually. But I do agree with some comments about the C being a little too big it feels. It seems like they should either get the same attention scale wise, or the J should get a little more. I do like the concept though. Pretty recognizable alone as just the symbol.\n\nAs for the name CLUB is looking a little spacey, of which you can't fix because C, L, and U all give themself plenty of \"personal bubble space\". But standing next to JUBARITO...just makes that fact stand out a little more. Although, good job with the J and the I...looks really good now.\n\ncourtney\n\n"
    },
    {
      "time": "7 Aug 2008 — 9:36am",
      "content": "You have a seashell spiral thing going on with the tail of the j and the continuance of the C... extend the bottom stroke of the C a little, then continue that spiral up and around with an offset lighter-toned (grey) accent mark. That'll help maintain the strength of the Cj combo plus adding a \"catcher\" should the j start falling over. Having it an different shade will help to create more dimension as well.\n\nI like how your original design creates conflict, it's uneasy which helps create focus.\n\n"
    },
    {
      "time": "7 Nov 2008 — 7:15pm",
      "content": "The C in the mark does not match the C in the name. I do agree with some comments about the C being a little too big it feels. It seems like they should either get the same attention scale wise, or the J should get a little more. I do like the concept though.\n\n[Handmade Jewelry](http://web.archive.org/web/20140830114541/http:/www.artfire.com/modules.php?name=Category_Top&main_cat_id=5)\n\n"
    },
    {
      "time": "14 Nov 2008 — 2:37am",
      "content": "Good job with the spam boys.\n\n"
    }
  ]
}
