{
  "id": "47452",
  "title": "FontlabStudio VS Fontographer",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "how different are they from one another, in terms of learning to use them? Are they comparable? Are there huge differences?\n\n [‹ Type Organizer/Database programs](http://web.archive.org/web/20080907165018/http:/typophile.com/node/47641 \"Go to previous forum topic\") [Font Conference on CollegeHumor.com ›](http://web.archive.org/web/20080907165018/http:/typophile.com/node/47634 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907165018/http://typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": " 16.Jul.2008 12.18am",
      "content": "the basic concepts are very similar and easy to understand.  \nhowever Fontographer just resurrected from the dead, while FontLabStudio constantly evolves.\n\ndepending on your needs you might also consider buying TypeTool (think of it as FontLab Limited Edition) and upgrading to FLabS later.\n\n"
    },
    {
      "time": " 16.Jul.2008 1.12am",
      "content": "I think FontLab is the best choice because it’s much more advanced. And it’s not hard to learn. When I started to use FontLab I used the book Learn FontLab fast: [http://www.logofontandlettering.com/](http://web.archive.org/web/20080907165018/http:/www.logofontandlettering.com/ \"http://www.logofontandlettering.com/\")\n\nPieter\n\n"
    },
    {
      "time": " 16.Jul.2008 4.52am",
      "content": "Setting all the usual FL-is-better arguments aside, I will say that they are similar in concept, but very different in implementation and details. I often draw an analogy between Fog/FL and Quark/InDesign. Both have their strengths and weaknesses. But switching from one to the other requires a certain amount of shifting mental gears, which can take focus away from designing.\n\nThat said, I found learning initially in Fog to be relatively easier than learning FL for some reason (and that was coming to FL from Fog, where I already had an understanding of the concepts). But if you’re planning on doing this at all professionally (or even semi-professionally) then you’re probably better off just learning FL than starting in Fog and later trying to retrain your habits into FL.\n\n— K.\n\n"
    },
    {
      "time": " 16.Jul.2008 5.13am",
      "content": "I also started with FontLab. The basic problem with Fog is that it [lacks features to deal with open type](http://web.archive.org/web/20080907165018/http:/www.fontlab.com/fontlab-products/compare/), and so is out of date in this respect.\n\nThose who know Fog refer to features that are better executed in Fog. Either they are more intuitive or just work better. The FL folks seem to concede this, and now that they own Fog, from what Adam has written recently here they are going to integrate at least one better feature of Fog into FL in the next version, and I would guess more than that.\n\nIt doesn’t look like they are going give open type features to Fog, but I don’t know.\n\n"
    },
    {
      "time": " 22.Jul.2008 12.32am",
      "content": "95% of professionals use FontLab Studio. That should make the choice simple.\n\n"
    },
    {
      "time": " 22.Jul.2008 9.38am",
      "content": "Of the 95% of FontLab professionals, what percentage are using the respective computer platforms: Windows? Mac?\n\n"
    },
    {
      "time": " 22.Jul.2008 11.06am",
      "content": "My question turned out to be because of a typo. :o\\\n\nI took a workshop @ typcon. The on line info for the session said I’d need a full or demo version of TypeTool and Fontographer but Fontgrapher isn’t availabe as a demo for PCs at this time,\n\nIn the end it turned out that it should have read FontLab instead of Fontographer.\n\nThanks everyone for the info\n\n\\> Lakeway Graphics,  \nIf it helps, I was quite possibly the only person at TypeCon with a PC. Which would make it somewhere between 0. 2% and 0.25%.\n\n-=®=-\n\n"
    },
    {
      "time": " 22.Jul.2008 12.11pm",
      "content": "I believe many at Adobe are on PCs. We set books using PCs. Most of the authors whose books we set prepare their manuscripts on PCs. Now if only the publishers didn’t mess things up by converting the authors documents to Mac — particularly older versions of the Mac OS that didn’t support Unicode . . .\n\nSee, for example, [http://answers.google.com/answers/threadview?id=766664](http://web.archive.org/web/20080907165018/http:/answers.google.com/answers/threadview?id=766664 \"http://answers.google.com/answers/threadview?id=766664\")\n\nBut so what if Mac has a small market share? As long as it does it’s job & doesn’t get in the way of people doing work, the platform/OS shouldn’t matter.\n\n"
    },
    {
      "time": " 22.Jul.2008 12.13pm",
      "content": "Some of this typophile polling was already done in [this thread](http://web.archive.org/web/20080907165018/http:/www.typophile.com/node/38314).\n\n"
    },
    {
      "time": " 22.Jul.2008 12.30pm",
      "content": "\\> _I believe many at Adobe are on PCs._\n\nI don’t know about the rest of the company, but we on the Type group mainly use Mac. Thomas is one of the few using a PC.\n\n"
    },
    {
      "time": " 22.Jul.2008 12.32pm",
      "content": "Past thread, [Do font pros really use FontLab or Fontographer?](http://web.archive.org/web/20080907165018/http:/www.typophile.com/node/31998)\n\n"
    }
  ]
}
