{
  "id": "47453",
  "title": "Didot type by J. L. Vafflard",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi there, hope this is the right forum for this thread. Reading \"A Short History of the Written Word\" by Chappel and Bringhurst I stumbled upon this sample of a typeface \"cut by Jacques-Louis Vafflard for Francoise-Ambroise Didot\" in 1781, as reported in the book. As you may see, the style is very different from the usual romantic Didot type - more calligraphic and with a humanistic/old style feel, in some way. Since this is the first time that I see a Didot typeface with such a flavour, I would be interested in knowing more. Has there been any contemporary revival of this particular Vafflard cut? By the way, googling for \"Jacques-Louis Vafflard\" reported no results, while a Pierre-Louis Vafflard is quoted as Ambroise Firmin Didot's master. Thanks for any help.\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/vafflard02_5754.jpg)\n\n",
  "author": "ncaleffi",
  "time": "15 Jul 2008 — 11:35pm",
  "uid": "23726",
  "comments": [
    {
      "time": "16 Jul 2008 — 4:43am",
      "content": "Although both the Didots and Bodoni are best known for their eponymous Modern style typefaces, earlier in their careers there were types from both foundries that are more Transitional in character, influenced by both Baskerville and Fournier. I think you're definitely seeing a Fournier influence here (and perhaps some Luce).\n\nIf Bill Troop is still wandering through these parts occasionally, then that \"Vafflard\" in the thread title should surely grab his attention. If I recall correctly, he spent quite a bit of time on a Vafflard-based design years ago. He was posting in another thread not that long ago. Dunno if he's still lurking about, but he might be a good source of information.\n\n-- Kent.\n\n"
    },
    {
      "time": "16 Jul 2008 — 9:51am",
      "content": "Try to get a hold on this article:\n\nGerard Unger: ‘The Types of François Ambroise Didot and Pierre Louis Vafflard.  \nA further investigation into the origins of the Didones’, in:  \nQuaerendo vol. 31, No. 3, Leiden 2001\n\nSee also:  \n [http://www.gerardunger.com/allmytypedesigns/allmytypedesigns17.html](http://web.archive.org/web/20150123053551/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns17.html \"http://www.gerardunger.com/allmytypedesigns/allmytypedesigns17.html\")\n\n"
    },
    {
      "time": "17 Jul 2008 — 2:40am",
      "content": "How wonderful to see this great print, the 'Prospectus' here!\n\nLooking at this - - it's in Updike - - was one of the most thrilling moments of my type life. I saw it when I was just starting out in type and reading Updike - - around 1992 or 1993 - - and at once started digitizing it. I wanted something that would reproduce not just the image I beheld in the Prospectus, but the feeling of it. It remains for me the most beautiful type I have ever beheld, but it is not until you see how Didot actually printed with it that you understand just how beautiful it can be.\n\nI was working with Jeff Level at the time. We sent my earliest drafts to David Berlow, who thought that it looked too much like Fairfield, which had just been revived by Linotype. That was a very acute remark, because Fairfield was undoubtedly influenced by this type. Jeff also sent it to Robert Norton, because he thought it could be an interesting challenge to the Microsoft people with the kind of hinting they were then doing. Norton didn't want it for Microsoft, for obvious reasons, but was tremendously supportive of the approach I was taking, which was to permit the letterforms to have obvious faults. The question then becomes - - which faults are aesthetically useful in the digital type, and which are not? We all spent countless hours on these questions. Matthew Carter was also a great help with the type at this time, and later. He was to use a similar approach in his revival of Monticello. I had been attacked so vigorously for sticking to this principle that I was very glad to have his support.\n\n'Adagio Didot 48', released through Precision Type around 1995 or 6, was derived from this type although it can be difficult to see the relationship. It is not easily available and has very little to do with the aesthetic feeling of the 'Prospectus' type.\n\nMy version of the 'Prospectus' page caught Robert Slimbach's attention - - was it in 1996? He asked what could be done with a multiple master in size and weight, and a couple of weeks later, we had a new typeface closely based on this type - - which Veyrin identifies as 'Vafflard's First [of three] Manner'. After a while, we signed a contract for typeface known as 'Valerie' (after Balzac's heroine) -- the first Adobe Original text family from an outside designer.\n\nCarol Twombly warned me at this early stage. 'Robert has art-directed several projects for Adobe over the years. Not a single one has ever been released. This is his last chance. Are you sure you want to take this risk?'\n\nI paid no heed. I loved Robert! It was fantastic working with him!\n\nThings started going wrong a few months later . . . do I have to tell the rest of the story again?\n\n"
    },
    {
      "time": "17 Jul 2008 — 3:49am",
      "content": "Thanks for the info, Bill. It's a pity to hear that the \"Valerie\" font didn't make it out - the Updike's sample looks nice and it would be great to have a faithful and functional revival of that Vafflard First Manner type. Maybe you'll start working on it again?\n\nAlso, I checked for the Adagio Didot 48 in an online catalog ( [www.fontshop.fi/price\\_fk.pdf](http://web.archive.org/web/20150123053551/http:/www.fontshop.fi/price_fk.pdf \"www.fontshop.fi/price\\_fk.pdf\")), but it looks very different indeed.\n\n\"Only when the design fails does it draw attention to itself; when it succeeds, it's invisible.\" (John D. Berry)\n\n"
    },
    {
      "time": "17 Jul 2008 — 5:47am",
      "content": "I'll send you a copy if you really want - - it would be interesting to get some feedback. In my later versions I used the fitting of Vafflard as near as I could get - - it is mathematically exact. Of course, a replica is only really useful at the design size of 18 pt - - so say 14-24. Italics are a problem. Vafflard had a gorgeous italic but neither Unger nor I have - - when last I checked - - succeeded in finding more than a few letters of it. Unger, by the way, believes that the font is almost identical to Adobe Garamond, and he illustrates this quite convincingly in the article that Wolfgang cites. I worked on this design with Robert Slimbach for two years without Robert ever remarking on it. It just shows that there are lots, and lots, and lots of different ways of looking at type.\n\n"
    },
    {
      "time": "17 Jul 2008 — 7:04am",
      "content": "Bill, I'd love to have a closer look at your work, but be aware that I'm not a type designer - just a guy in love with print, types and book designing. Anyway, I don't see so many similarities with Adobe Garamond - just my two cents...\n\n\"Only when the design fails does it draw attention to itself; when it succeeds, it's invisible.\" (John D. Berry)\n\n"
    },
    {
      "time": "17 Jul 2008 — 3:20pm",
      "content": "Hi Bill,\n\nDo you have a PDF we could look at?\n\n--K\n\n"
    },
    {
      "time": "18 Jul 2008 — 2:12am",
      "content": "I must have one somewhere - - I'll look - - or make one. But can one be attached to a message here or do I have to put it on some website?\n\n"
    },
    {
      "time": "18 Jul 2008 — 2:18am",
      "content": "Bill, in comments to a thread, you can only post links or images—not files like PDFs.\n\nBut if you open a new thread in any of the Typophile forums, you can upload the PDF as a downloadable document there. The file is then stored on the Typophile server, so you wouldn't have to upload it anywhere else. You should see \"File attachment\" as one of the drop down menu options in the \"post new forum topic\" interface ( [http://typophile.com/node/add/forum/0](http://web.archive.org/web/20150123053551/http:/typophile.com/node/add/forum/0 \"http://typophile.com/node/add/forum/0\")).\n\n"
    },
    {
      "time": "18 Jul 2008 — 1:34pm",
      "content": "Anyone who is interested, please have a little patience. I haven't used these fonts for about 8 years so the last time everything was working was on OS/9 or early XP. I just installed ATM 4.1 onto Vista (simply disable UAC) and am trying to find my files.\n\nFor anyone interested in really finding files, I'd like to mention the program dtsearch, only available on Windows, which blows away spotlight and any other Win search program if you want to find everything in every possible file on your system.\n\nAnyway, as soon as I can post one of my old specimens I will - - naturally, I have the Prospectus . . . .\n\n"
    },
    {
      "time": "18 Jul 2008 — 2:06pm",
      "content": "OK, here are some images, and I can already see a lot of things I don't like. For example, my numbers are terribly lacking in spirit. I reproduced the thickness of the type much as Updike had. That is not too far away from Didot's own printing in this type, but nothing can compare to the exceptional blackness, and the razor thinness of the finest details. In spite of having put so much work into it, I can honestly say I am glad I did not release it. It needs rethinking. After this, I'll post the Adobe version. The image Nicola posted is the darkest I have seen yet, and I like the meatiness, but Vafflard's is not a heavy type, so keep that in mind while comparing.\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/prospectus%20detail_3955.GIF)\n\nand the full page\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/prospectus%20full%20page_4361.GIF)\n\n"
    },
    {
      "time": "18 Jul 2008 — 2:43pm",
      "content": "Here's a problemmatical version. The Adobe beta type at some point in its development, midway through the optical interpolation ... you can see at once there are problems with some of the accented characters and plenty of other problems. I would now completely revise the optical axis as the small size master seems defective. Next, some examples of the large-size master. Please note that the small caps in this print are from the pre-Adobe version; at Adobe we never got around to doing the small caps.\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%2018%20prospectus_4250.GIF)\n\n"
    },
    {
      "time": "18 Jul 2008 — 3:08pm",
      "content": "Here are versions of the large size master of the Adobe version, with italic - - apols for all these images - -\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20p%201_5887.GIF)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20p%202_6540.GIF)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20p%203_6535.GIF)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20p%204_3815.GIF)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20p%205_3425.GIF)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20p%206_4877.GIF)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20p%207_4451.GIF)\n\n(note the extremely small R and TM symbols then favoured by Robert)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20italic%20p%208_4681.GIF)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20italic%20p%209_6318.GIF)\n\n ![](http://web.archive.org/web/20150123053551im_/http:/typophile.com/files/jeanne%20italic%20p%2010_5084.GIF)\n\n"
    },
    {
      "time": "18 Jul 2008 — 5:26pm",
      "content": "Bill, I hope somebody can convince you to finally release this thing.\n\nOne thing about the GIF images you've posted: it seems like you've used a funny palette, I'm guessing the old MacOS 8-bit palette. This is causing a lot of half-bitting (look at the \"teeth\" on vertical edges) which is distracting, and detracting from the work. In fact the bodies of some letters aren't even solid black. You only need a 16-color palette (even with that red border) but it has to have enough grays in it. Use Adaptive when you map down.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2008 — 5:31am",
      "content": "Many, many thanks for kind remarks, Hrant - -\n\nre the gifs, what I did was pdf from Quark 7 to Acro 8, then screen shot via Vista snipping tool. Acro 8 has default rendering settings that make no sense to me: 'smooth text for monitor' rather than LCD and custom resolution of 110 pixels/inch rather than recommended system setting of 140. And snipping tool no doubt has various unknowns. I didn't do the screen shot direct from Quark so I would avoid all the clutter. However, comparing the two onscreen, the Acrobat is grey, not black, like the Quark is. Doubtless if I had any idea what I was doing it could all be better. I can see that the screen shots should be much better, but getting them there at all seemed to me miraculous enough.\n\nI can identify three problems finishing the type.\n\n1. I like to work collaboratively, and I truly believe type should be a collaborative event. But Matthew Carter disagrees, and told me so from the very start of this project: 'When are you going to fly solo?' I still haven't answered that question and it continues to haunt me.\n\n2. I don't have a deadline. It's amazing what you can finish when you have a deadline. When you don't have a deadline, you spend a week on things that are really fascinating like, 'What size, really, should the command and period be?' -- things that, mercifully, under deadline, you can't get too involved with.\n\n3. The legal situation isn't clear. Ask Adobe and they say they own the design. Carol said, 'just release it, nobody will care, so long as you don't use our trademarked name.' I expect she was right.\n\n"
    },
    {
      "time": "19 Jul 2008 — 7:21am",
      "content": "\\> Many, many thanks for kind remarks, Hrant - -\n\nHah.\n\nIn my book when it comes to old French type, Tuleu is the one to revive.\n\nBut you know how supportive I've been of you when it comes to the... bureaucracy. In fact if you'd gone for my stratagem back then you wouldn't feel stuck in any legal gray area now.\n\n\\> Acrobat is grey, not black\n\nThat happens to me too - very annoying. Plus it didn't used to happen in the past. I think it has to do with CMYK versus RGB. What I end up doing sometimes is using a rich black: 100% on all four of C, M, Y and K. Which is almost as annoying. Does anybody have a more elegant/robust solution?\n\nThat said, with a quick Levels in Photoshop the gray becomes black.\n\n\\> I like to work collaboratively\n\nCertainly, a minefield, even though there's a pot of gold at the end.\n\n\\> I expect she was right.\n\n\"Was\"? Since she's still alive, that makes it sound like you've already decided never to release it. Ever the aspiring Greek tragic hero, Bill. Release it, and dominate your hamartia.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2008 — 8:04am",
      "content": "\\>Since she’s still alive\n\nYou think there's life after Adobe?\n\n\\>In fact if you’d gone for my stratagem back then\n\nDoubtless. But I was too much then under the sway of my hramartia (that's the extra-strong Armenian-style hamartia)\n\n\\>Tuleu\n\nAll right, you win. Who and what is Tuleu?\n\n"
    },
    {
      "time": "19 Jul 2008 — 9:01am",
      "content": "There are good samples throughout this old thread:  \n [http://www.typophile.com/node/1331](http://web.archive.org/web/20150123053551/http:/www.typophile.com/node/1331 \"http://www.typophile.com/node/1331\")\n\nThe italic is especially nice; what Morrison was supposed to  \nhave been doing instead of his brutish wannabe Modernism.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2008 — 9:45am",
      "content": "this is lovely!!!!\n\n"
    },
    {
      "time": "20 Jul 2008 — 1:59am",
      "content": "Thanks Mike! Hrant, I've had a look at Tuleu, and I see it as descended from the key early Didot that Walter Tracy was so interested in, which is either Vafflard's third manner or Vibert's first manner (don't remember which), and which Tracy thought was the first modern type. I mean the roman of course. But even the italic might have seeds in Vafflard's first italic -- if we only had a complete setting of it. Astounding that Vafflard's first manner type appears to have been used for a year and a half max - - then abandoned. After that, ugliness reigns for a century. Nor is there a hint that it was sold to a provincial printer/founder or anything like that. It is almost as if there was an historical imperative to destroy it. The Tuleu g obviously comes from Baskerville, who seems to have been, for the French, the Jerry Lewis of the 19th century.\n\nThe stagnancy of 19th century is strange. Just as English printing was mired in low quality modern (i.e. 99% of the 19th c English books you will see in any sale are printed in hideously thin modern), the French seem to have been mired in the over-technical forms of the very late 18th-early 19th century Didots. They're fussy and ultimately not easily readable, but at the very least they are heavier than the contemporaneous English types. You wonder how printers and the public could possibly have preferred them to the pleasant Jannon types that were masquerading as Garamond during this period.\n\nI find the Tuleu italic a little messy both stylistically and aesthetically -- and conceptually. You want a plain, emphatic italic? Then you wouldn't stick that silly k in the middle of it. And the f form is as unnatural as it is in the early American italics that are also trying to become slanted romans.\n\nRe Morison, Jeff Level had the intriguing idea that an ideal italic should be fully calligraphic but upright. I don't accept this idea, and I don't imagine you would, but it is interesting nonetheless, and it would be nice to see more designers trying it out.\n\nTuleu really is a missing link. It would be interesting to trace the development from 1800 to 1900. We don't seem to know enough about the terribly slow typographical progress of that century, compared to the 18th and the 20th. I imagine it's because printing historians don't find it stylistically interesting. But just as we are beginning to find Victorian architecture considerably less repulsive than we used to, might we not be on the verge of coming to an accommodation with common Victorian type?\n\nSpeaking of italic, I like, for display, the type I showed here. I have tried to adapt it to text sizes, but I don't think it's a good idea for submersive reading.\n\n"
    }
  ]
}
