{
  "id": "47456",
  "title": "Critique, developing new logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "First time on logo design part of the forum, hello to the regulars and all.\n\nBelow are first sketches of the logo for a company which operates on numerous grounds: publishing, conferences, training courses, learning courses, e-learning, on the subject of management.\n\nCompany operates for about 5 years on the local market and its name and BI were changed several times, thought products they sell remain constant and have high reputation and are well recognized among aimed target group.\n\nThis time they need another name change and drop some associations. (see img of **current** logo, NOT a subject to critique!)\n\n ![](http://web.archive.org/web/20111214095649im_/http:/typophile.com/files/CIMI_6584.jpg)\n\nThe name will be **ICAN** and is ment to be meaningless noun. Dropped Canadian associations from previous BI.\n\nICAN must not have any associations with: **iSomething** bandwagon, **I can** mistakes, broken word **...can...** (Ameri **can** , **can** on, etc.) Knowledge of english is common among target audience.\n\nLogo must be accompanied by taglines specifying the branch of the product (eg. publishing, education, institute, etc.) Variety of repro targets: offset up to billboards size, desktop, fax, screen, engravings. Extreme small repros without tagline.\n\nAnd here are said proposals:\n\n ![](http://web.archive.org/web/20111214095649im_/http:/typophile.com/files/ican_5554.jpg)\n\nAnyone willing to share thoughts on the sketches is most welcome.\n\nThanks,  \nAntoni Adamowicz\n\n",
  "author": "<a href=\"/web/20111214095649/http://typophile.com/user/22209\" title=\"View user profile.\">Urquell</a>",
  "time": "<br>",
  "uid": "22209",
  "comments": [
    {
      "time": "",
      "content": "Hi Antoni\n\nThe company does so many things. Are there things that are common to all of them?\n\nWhat I see now misses a soul, a feel.  \nSure it is a nice picture perhaps, but logo (lets say: identity) design should be more than that.\n\nWhat kind of a company is it? A happy one where the people wear jeans and shirts? Or a rigid business with suits? Or something in between? What are their products? For whom are they for? How does it communicates with their customers now? (in that you can often see what kind they WANT to be, but the question should be: who are they really)  \nFind out who they realy are and what their mission and vision for the future is.\n\nI would like to see some actual pencil sketches. Do you have them?\n\nBased on these two pictures I would explore the second one. The ornamental style may fit the company better.\n\nThe name ICAN is not a meaningless noun. In a world full of iPods, iStockphoto etc. it has a meaning and some association with all of them.\n\nI like your choice of dropping things like dropshadows, gradients etc. since they can make it harder to use the logo on so many media.\n\nHope this helps.\n\nGood luck!\n\nRaymond\n\n"
    },
    {
      "time": "",
      "content": "Hi Raymond, thanks for your replay.\n\n\"The company does so many things. Are there things that are common to all of them?\"\n\nThe only common thing is a subject of management, leadership, etc. The publications, conferences, trainings all are about it. A character of business is formal and strict – corporate look, feel and behave. Communication channels are printed media (brochures, magazine ads) and internet.  \nBut the company lacks its identity – it sells known products with its logos (Harvard Business Review, Harvard Business School Publishing) and there's no real local competitors in this area (Poland).\n\n\"Find out who they realy are and what their mission and vision for the future is\"  \nAs I can see, there's no coherent vision of the future, corporate culture or aspirations, apart from pragmatic running business. The company grows very fast and is charging lots of money for its services. Clients are mostly top dogs with no much choice between various products from competitors. It seems CEOs and VPs got no time and urgent need to seek for ICAN's identity. The main and only reason for the design project is a company name change and dropping Canadian symbols. All I have written are my assumptions, I haven't even got any real brief for this work. It seems no one cares:)\n\nOh, and I got some \"on paper\" sketches, but alas I don't have running scanner for a while, besides they won't help much I'm sure.\n\nCheers,  \nAntoni Adamowicz\n\n"
    },
    {
      "time": "",
      "content": "\"The only common thing is a subject of management, leadership, etc. The publications, conferences, trainings all are about it. \"  \nMy first question which comes to mind: do you think your designs reflect this properly?\n\n\"A character of business is formal and strict – corporate look, feel and behave.\"  \nSame here. Do you think your designs reflect this?\n\nIf your answer to both is yes, you have something that suits. We all have our own styles. We all come with another sollution to this question. All good.\n\n\"But the company lacks its identity.\"  \nI see an opportunity here. :-)  \nYou have the power of adding something. Adding in the sense of something you might spot in all of the things you have seen, heard, read and felt.\n\nNo vision and mission? Maybe on their site? If you read a few text of them concerning their business some of this might come to light.\n\nA little critique though: I'm not sure if your logo's are that different in comparison to others.  \nWith version 2 it looks refreshing, but in the lowest version the typographic ornaments become a bit of wings. Somewhat dated. I don't feel this with the bigger version that much.\n\nWhat is the reason for the dot behing PUBLISHING, EDUCATION? A part of an exclamation mark! If so, it brings meaning to ican which wasn't what was supposed to happen.\n\nHope this helps too!\n\nRaymond\n\n"
    },
    {
      "time": "",
      "content": "ICANN is a very well known organization. You really may want to rethink the name. Anybody who has ever registered a domain name has heard of ICANN.\n\n[http://www.icann.org/](http://web.archive.org/web/20111214095649/http:/www.icann.org/ \"http://www.icann.org/\")\n\n[http://en.wikipedia.org/wiki/ICANN](http://web.archive.org/web/20111214095649/http:/en.wikipedia.org/wiki/ICANN \"http://en.wikipedia.org/wiki/ICANN\")\n\n"
    },
    {
      "time": "",
      "content": "I really like version 1. I think you should play with the sub text. left justify, play with the kerning... maybe put the square in front of the sub text(upside down i)?\n\n"
    },
    {
      "time": "",
      "content": "Alaskan, thanks for your find, I haven't known about icann. Don't believe it is enough argument to re-think company name for decision makers. In spite of clear disadvantages they seem content about the name. I'll send them info anyway.\n\nDave, I actually got a version with this kind of dots, I thought they hurt legibility of \"i\" badly, so abandoned the way. Text has not been a subject of fine tuning yet.\n\n ![](http://web.archive.org/web/20111214095649im_/http:/typophile.com/files/ican_2_3836.jpg)\n\nRaymond, you made a good points, thanks.\n\nNow I'm trying to add a mark to the logo, will insert a update soon.\n\nCheers,  \nAntoni Adamowicz\n\n"
    },
    {
      "time": "",
      "content": "There's much about strategy and tactics in ICAN's texts. They although use \"hunting\" semantics extensively (verbs and adjectives like chase, grab, capture, avoid, swift, assertive etc.) so I thought about adding corresponding mark to accompany logotype. What do you think about it?\n\n ![](http://web.archive.org/web/20111214095649im_/http:/typophile.com/files/ican_3_4368.jpg)\n\nAntoni Adamowicz\n\n"
    },
    {
      "time": "",
      "content": "forgive my rip, this is more of what I was thinking.\n\n ![](http://web.archive.org/web/20111214095649im_/http:/typophile.com/files/ican_6237.gif)\n\n"
    },
    {
      "time": "",
      "content": "Hi there Antoni\n\nI like the idea of a chess piece.\n\nThe lion – however - doesn't do it for me.\n\nTurning the 'i' upside-down doesn't do it for me also. But maybe you can craft the 'i' and chess-piece together to form an 'i' which can also be used as a seperate logo?\n\nHope this helps.  \nGood luck!\n\nRay\n\n"
    },
    {
      "time": "",
      "content": "Hi,\n\nDave: \"forgive my rip, this is more of what I was thinking.\"  \nNow I follow you, thanks for clarification.\n\nRay: \"But maybe you can craft the ’i’ and chess-piece together to form an ’i’ which can also be used as a seperate logo?\"\n\nIncreasing of emphasis of the \"i\" letter is so inviting, but after several efforts I don't seem to be able to keep integrity of the hole word. \"i\" and \"can\" no longer forms one word, and I can't stop reading it \"i....can\".\n\nI think it's good time to present projects to the client and focus on developing one of their choice (if any choice will be made :-)).\n\nThank you all for your time and comments.\n\nAntoni Adamowicz\n\n"
    },
    {
      "time": "",
      "content": "Hi Antoni\n\nOne last addition.\n\nPerhaps you could dot the 'i' with a chess style dot?  \nAnd perhaps you could adjust the 'i' slightly to make it a chess piece.\n\nI have a sample, but don't know how to place it here.  \nPlease advice on that.\n\nGood luck\n\nRaymond\n\n"
    },
    {
      "time": "",
      "content": "It was right in my face.  \nHere it is.\n\n ![](http://web.archive.org/web/20111214095649im_/http:/typophile.com/files/image_6645.jpg)\n\nMind you, I've do it very quick.  \nYou have to take a good look at the balance.  \nBut it shows what I mean.\n\nBest\n\nRay\n\n"
    },
    {
      "time": "",
      "content": "Hi Ray,\n\nI really like the idea, but I'm afraid of ambiguity. In small sizes top version will obviously loose chess figure association and become just \"different\", \"strange\" i. Second one is worth pursuing, I'll definitely do it if the \"chess\" identity suits the client.\n\nBig thanks for the idea!\n\nCheers,\n\nAntoni\n\n[edited, added img]\n\n ![](http://web.archive.org/web/20111214095649im_/http:/typophile.com/files/ican_4_4725.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Your mark is developing nicely but you may want to re-draw the crown, it's starting to look like a Mouseketeer hat, especially at the larger size.\n\n"
    },
    {
      "time": "",
      "content": "First, the name sounds like \"I can jump, build, win etc.\" to me.\n\nAbout the whole:  \nMaybe try using the same typeface for \"ican\" and \"publishing\" and make \"publishing\" the same width by increasing the font size a bit and also increasing kerning?\n\nAbout the \"i\":  \n- The extra detail to the \"i\"s bottom is either not polished or overkill. The crown is not legible in the small size sample. Maybe using a more traditional chess king's figure as a guide can help as in the below image? I'm a chess player and the cross alone tells me it's the king immediately. Beside, the cross should be legible in small sizes. Holding the \"i\" and the cross shaped crown together, not letting there be a space between them should help.\n\n ![](http://web.archive.org/web/20111214095649im_/http:/typophile.com/files/AAAAAo_Rq5kAAAAAAJETZQ_6395.jpg)\n\n"
    },
    {
      "time": "",
      "content": "While your mark is improving, I think the name's still very problematic. I immediately thought of ICANN as well, but most people won't. A bigger problem is that there are numerous Canadian businesses already using this name, such as:\n\n[ICAN](http://web.archive.org/web/20111214095649/http:/www.icanhelps.com/) - an international charity based in Toronto  \n [ICAN](http://web.archive.org/web/20111214095649/http:/www.ican.nf.net/) - a marine tech company based in the Maratimes  \n [ICAN](http://web.archive.org/web/20111214095649/http:/www.icangroup.ca/) - Canadian auction network  \n [ICAN](http://web.archive.org/web/20111214095649/http:/www.ican.nfld.net/) - Institute of Chartered Accountants of Newfoundland\n\n...all this from the first 10 results on Google. Your client might have difficulty getting a trademark for the name.\n\nIf ICAN is \"meaningless\", and almost certain to be confused for an acronym by anyone (when it's not), why use it? You may have already argued this matter with the client, but it seems that the business would benefit greatly from a name that's both distinctive and prestigious (which would match the direction you seem to be headed graphically).\n\n"
    },
    {
      "time": "",
      "content": "I agree with Arcturus. The name is flawed. Why use a name without meaning and fight the most basic of principles of identity design - using the name to derive meaning.\n\nYou are in a great situation. You not only could have a identity design project, but a whole re-naming project too! Use it to conceive a brilliant new name that will reinvent the company's image AND give it a clearer direction for the future while helping to **differentiate** the brand. Right now the upper management seem to be trying to push their services further into ubiquity and obscurity!\n\n"
    },
    {
      "time": "",
      "content": "interesting thread.\n\nI'm going to sit hear and listen for a bit longer before Imp in to convo.\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20111214095649/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "Any news on this Urquell?\n\n"
    },
    {
      "time": "",
      "content": "Hi all, I'm on holiday till next Monday, so forgive me not keeping the thread alive. I'm trying to avoid internet and displays for two weeks ;-).\n\nJay said: \"Why use a name without meaning and fight the most basic of principles of identity design -- using the name to derive meaning.\"\n\nI'm afraid I'm not in position to answer your question. In spite of teaching on subjects including marketing and branding to some extent the company doesn't seem to apply a knowlege it sells to itself. Disadvantages of the chosen name were clear to me from the very beginning. Alaskan and Mike added more undesirable associations to the name than I've thought of. It's one of the best features of forums like typophile. Thanks. However, I'm quite sure the client won't change his mind, he seems stubburn about the name for some reason. I'll show him what I and you found about \"the other icans\".\n\nBoke, the chess king figure is not polished yet. It needs more work than I initially thought. If I take on the concept, it'll need to be:\n\n- instantly recognizable as a letter i,\n- instatly recognizable as a king chess figure,\n- last but not least, it cannot evoke any feudal or catholic associations _a cross_ and _a king_ have in my part of Europe.\n\nMy workmates are developing their ideas, with deadline set to the end of July. If my sketches will be chosen to further developing I'll kindly ask you to share your opinion on refining the logo.\n\nCheers,\n\nAntoni\n\n"
    },
    {
      "time": "",
      "content": "Hi Urquell\n\nDo you have any updates?\n\n"
    },
    {
      "time": "",
      "content": "Hi bobbydobo, no great news from my side.  \nNone of the proposals got accepted with no coherent feedback given to me.  \nDecision making process have stopped also because arising doubts about the name. I sent my opinion (enhanced with your help) and couple of ican logos. They haven't even bothered to check if the domain ican.com or ican.pl is vacant. Pity they're not. The only one available is ican.com.pl. Hardly a name for prestigious company seeking an exceptional identity. Maybe I get back to that work, if I manage to get a reasonable brief.\n\n[http://www.icaninternational.com/img/ican\\_logo.gif](http://web.archive.org/web/20111214095649/http:/www.icaninternational.com/img/ican_logo.gif)  \n [http://www.icanw.org/files/ICAN-logo-full-lg.jpg](http://web.archive.org/web/20111214095649/http:/www.icanw.org/files/ICAN-logo-full-lg.jpg)  \n [http://www.icanconsulting.com/ICAN\\_logo\\_copy1.jpg](http://web.archive.org/web/20111214095649/http:/www.icanconsulting.com/ICAN_logo_copy1.jpg)  \n [http://www.healthsystem.virginia.edu/Internet/ican/images/ICAN\\_logo\\_acronym\\_trans.gif](http://web.archive.org/web/20111214095649/http:/www.healthsystem.virginia.edu/Internet/ican/images/ICAN_logo_acronym_trans.gif)  \n [http://www.icannabis.ca/images/ican\\_logo\\_black.jpg](http://web.archive.org/web/20111214095649/http:/www.icannabis.ca/images/ican_logo_black.jpg)  \n [http://www.noria.com/buyersguide/graphics/ican/ican\\_logo.jpg](http://web.archive.org/web/20111214095649/http:/www.noria.com/buyersguide/graphics/ican/ican_logo.jpg) [http://www.doodoovoodoo.com/images/ICAN-S-N-Logo-IL10.gif](http://web.archive.org/web/20111214095649/http:/www.doodoovoodoo.com/images/ICAN-S-N-Logo-IL10.gif)  \n [http://www.qinsy.nl/img/Image/Company%20Logos/Ican%20Logo.png](http://web.archive.org/web/20111214095649/http:/www.qinsy.nl/img/Image/Company%20Logos/Ican%20Logo.png)  \n [http://www.whro.org/cii/enews/winter\\_spring08/image/icanlogo.jpg](http://web.archive.org/web/20111214095649/http:/www.whro.org/cii/enews/winter_spring08/image/icanlogo.jpg)  \n [http://www.icanpublishing.com/images/logo\\_no\\_tail\\_225\\_215.jpg](http://web.archive.org/web/20111214095649/http:/www.icanpublishing.com/images/logo_no_tail_225_215.jpg)  \n [http://www.icantraining.org/images/2005-ICAN-logo-2x1-for-web.gif](http://web.archive.org/web/20111214095649/http:/www.icantraining.org/images/2005-ICAN-logo-2x1-for-web.gif)\n\nCheers,  \nAntoni\n\n"
    },
    {
      "time": "",
      "content": "Hi Antoni\n\nThanx for getting back.\n\nThis is a petty.  \nYou must be curious about WHY your proposals didn't got excepted?! I would.\n\nI wonder if this company is as prestigious as you think.\n\nA domain-check should be up there in the list of most important things when you are looking for a new name. That they didn't do that tells something about them.\n\nIf there changes anything, feel free to get back with us about this!\n\nBest\n\n"
    },
    {
      "time": "",
      "content": "Ray, I'm involved with work for the company not for the first time, and must say I'm not surprised at all. OK, maybe they got me with \"we have checked the name here and there and are pleased with it\" and I was really surprised to find they didn't check even the domain name. The company is responsible and prestigous in the field of its core activity, but the PR, Sales and Marketing decisions are not up to that level IMHO. They're made by few people depending on their intuition. But the company goes VERY well, so never mind the style, they're successful.\n\nAnyway, we usually finish projects for them, but it's time consuming and reserve demanding :)\n\nThanks for your help and interest\n\nCheers,  \nAntoni\n\n"
    },
    {
      "time": "",
      "content": "Interesting to see how succesful companies still leave room to be even more succesful.\n\nAll the best and thank you for sharing.\n\nRay\n\n"
    },
    {
      "time": "",
      "content": "dayum!\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20111214095649/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
