{
  "id": "47461",
  "title": "Going to California",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi Typofolks,\n\nMy wife and I are off to California in a few weeks, starting in San Francisco and ending up in San Diego. As an avid photographer of (old) shop signage I would be grateful for any suggestions. I’d really like to go to that signage graveyard in the desert somewhere outside Las Vegas (I think), but probably won’t have the time.\n\nI’ve only previously been to New York, so am looking forward to California. I know there’s a heck of a lot to see.\n\nThese are some from my European collection:\n\n ![](http://web.archive.org/web/20081013182135im_/http:/typophile.com/files/IMG_4530_4399.jpg)\n\n ![](http://web.archive.org/web/20081013182135im_/http:/typophile.com/files/IMG_8689_6301.jpg)\n\n ![](http://web.archive.org/web/20081013182135im_/http:/typophile.com/files/IMG_8703_5277.jpg)\n\n [‹ Grouping multiple fonts under one family name](http://web.archive.org/web/20081013182135/http:/typophile.com/node/48128 \"Go to previous forum topic\") [[day] 08/08/08 ›](http://web.archive.org/web/20081013182135/http:/typophile.com/node/48201 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013182135/http://typophile.com/user/3834\" title=\"View user profile.\">Nick Cooke</a>",
  "time": "<br>",
  "uid": "3834",
  "comments": [
    {
      "time": " 16.Jul.2008 10.05pm",
      "content": "Nick, if you’d like to meet up let me know when you’ll be passing through LA. Although it’s more memorable for its graffiti and “fauve” lettering, LA is big, so it’s got everything.\n\nBTW, if you time it right (and you use your mirrors well) the freeways here allow you to cover a huge number of miles very quickly, so you can probably make a side-trip to Vegas. It’s signage central baby. And there’s really nothing like barreling through the desert in the summer.\n\nhhp\n\n"
    },
    {
      "time": " 17.Jul.2008 12.46pm",
      "content": "If you time it wrong in LA you can sit on the freeway for hours and hours. Avoid rush hours, 7-10 and 16:00-19:00 at all costs. Eat sleep photograph but do not drive. Have fun!\n\n"
    },
    {
      "time": " 17.Jul.2008 5.17pm",
      "content": "In fact the afternoon rush hour can start as early as 2:30pm! But the morning range is actually complex: depending on the freeway and direction, there are 15-minute windows that are amazingly smooth. Also, on Fridays the evening rush hour is more spread out: it starts earlier and ends later, but/so is gentler.\n\nIn terms of Vegas the good news is that if you’ll be going there as you approach LA County, you’ll skirt the top rim of LA, largely avoiding traffic. But when you come back into LA from Vegas your timing is critical.\n\nhhp\n\n"
    },
    {
      "time": " 18.Jul.2008 2.40am",
      "content": "We were actually thinking of avoiding LA as much as possible (well, Santa Monica to Hollywood and back down the coast.) for exactly the reasons above. We come from a very crowded island, and sitting in traffic is the last thing we want.\n\nHrant, after reading a few threads I’m a bit apprehensive :^{ Just tell me you’re not too scary in the flesh!\n\nPs. any areas in San Francisco with old signage? there must be surely.\n\n"
    },
    {
      "time": " 18.Jul.2008 7.53am",
      "content": "Certainly most of LA is flat, topographically as well as existentially. Or rather, most of LA is only interesting in its contribution to the fascinating texture of the whole. But that degree of subtlety is neither interesting nor viable to appreciate in passing.\n\nYour plan of coming down the coast is solid. If you have time come straight down Pacific Coast Highway, through Malibu to Santa Monica and Venice (don’t miss all the loonie beachwalk performers!) and then down through all the beach cities until you end up in San Diego; if you’re short of time come down the 5 Freeway (where you’ll get a fringe glimpse of desert driving) switch to the 405 and then cross over to Santa Monica using the 10. And if you go inland from Santa Monica your safest bet (although decidedly toursitic) is to use Wilshire Boulevard to go through Beverly Hills (Rodeo Drive etc.) and Melrose Avenue. These are not “fake” things to see, they’re just one aspect of the reality of LA, which I feel is a breathtaking microcosm of the world. Now, if time and mettle permit, at least get yourself to a King Taco\\*, where you’ll be afforded a small peek into one of the other realities of LA. The last time I took some visitors there (from Singapore) there were three armed guards, and ironically enough one of them was missing an arm! But of course, les goûts et les couleurs ne se discutes pas.\n\n\\* [http://www.kingtaco.com/](http://web.archive.org/web/20081013182135/http:/www.kingtaco.com/ \"http://www.kingtaco.com/\")  \nCaveat: some of the locations are boring.\n\nSF: It’s an older city, and has paid more attention to preserving itself, so it certainly has more old signage, and much more densely packed. But overall I’ve come to find the city boring - too touristic. LA doesn’t really care about tourists; the tourists have to do the caring in order to make it worthwhile.\n\nMe: virtually everybody who has ended up meeting me in person after experiencing me online expresses shock at the difference in apparent character. Whether the existence of this difference is good or bad is arguable.\n\nAnyway, I’ve become quite proud of my city, after all these years of ambivalence and even periodic animosity, so I would be glad to spend a few hours showing it off to you.\n\nhhp\n\n"
    },
    {
      "time": " 18.Jul.2008 9.53am",
      "content": "If you like Art and museums, LA deserves a longer visit. The Getty is one of the best complexes in all of LA and is free with a view worth the Billion dollars it cost to build it. The museum mile on Wilshire blvd has the LACMA, los angeles county museum of art, a great collection and next door is the La Brea tar pits with a great park with the pits where they have found 1000s of skeletons Mammoths, sabertooth tigers and even a person. Across the street is a Car museum. a mile down from the car museum is little Ethiopia, there are a few great resturants, do one if you make to this area, I like the vege plate. Also close to here is the famous Rodeo Dr which is a few blocks of luxury shopping and worth walking through (I like it at night best). A drive through the neighborhoods in beverly hills is interesting during the day. The not so great but good for tourist is sunset blvd and hollywood blvd for the stars and the Chinese Theater (I think it is now owned by KODAK). All of these sites are close together.\n\nIn downtown LA is the Disney theater, great building. The MOCA, museum of contemporaty art, small and good. Downtown has also many interesting old buildings all in a few short blocks. The best priced jewelry in all the world that I have found is also there, thousands of shops and one third the price with better quality than any mall jewler. Just ask for the jewlery distric I think it is Hill st. Downtown also has a few big theaters if you like musicals, Wicked has amazing costums.\n\nAnother area that is great is Pasadena, this is where the Rose Parade is held. Go there for a nice, very nice part of greater LA, 30 min from downtown. The Huntington Gardens are amazing and there is also a small museum there, The Blue Boy and Pink Girl. Also in Pasadena is the Norton Simon museum, Great and a nice quiet garden.\n\nOn the shore side is Long Beach with the Queen Mary and a russian sub you can visit. Downtown long beach has had lots of money poured into it and there are lots of places to eat and hang out. This is a cool area and a few miles south of there is Belmont Shore, cooler and less expensive. There is a short strech of 10 blocks with great place to eat and many super shops, not overly commercial with big chains. You can also catch a boat here to Avalon for a day away from it all, very touristy but quaint and great diving and snorkeling clear water! Long Beach also has the Museum of Latin American Art, small and good.\n\nYou would have to spend a week here to scratch the surface but these are all great places in the huge wasteland of ulgy.\n\nIn downtown San Diego at the trainstation is also a great museum of modern art, very small and great new stuff every few months.\n\nHave a great trip.\n\nGo to google maps and look for the things I mentioned and plan a driving tour and you will not be sorry, a convertable makes the tour fantastic.\n\n"
    },
    {
      "time": " 18.Jul.2008 10.10am",
      "content": "San Francisco Public Library, Harrison collection. Largest collection the great calligraphers and lettering artists.\n\nMichael\n\n"
    },
    {
      "time": " 18.Jul.2008 10.37am",
      "content": "KC, that post is a keeper! Thanks.\n\nGetty: Plus it’s right off the 405 and some people go there just to hang out and admire the architecture, landscaping & views, without going into any exhibits! I have a second cousin who regularly goes there, has a glass of wine, and leaves.\n\nhhp\n\n"
    },
    {
      "time": " 22.Jul.2008 1.58pm",
      "content": "Nick,\n\nContact Paul Hunt about the signage graveyard in Vegas. He went recently. Also see his [photo album from there.](http://web.archive.org/web/20081013182135/http:/www.flickr.com/photos/pauldhunt/sets/72157604100507517/) [Here is their website.](http://web.archive.org/web/20081013182135/http:/www.neonmuseum.org/boneyard.html) I’ve been wanting to go there for years, and I plan to go there sometime in the next year. I just have to combine the trip with a green building or other design conference so it feels somewhat purposeful. The Sign museum requires you to make arrangements for tours in advance, but it seems a lot of fun to me.\n\nSet aside a good amount of time for type and lettering jaunts in SF. Hrant is right that it isn’t particularly rich in lettering; we have virtually no good signpainters here for example, and a lot of the old factory signs and painted ads you might see in less busy towns are covered. But there are gems of signage, and particular areas that are better for it. I also second Michael’s suggestion of the Harrison collection; there are marvels there you will appreciate. Susie Taylor is a huge champion of hand-lettering and calligraphy, so she can help you there and will probably like to see your work.\n\nIf you drive down the coast, take a day to roam around Santa Cruz. They do in fact have an amazing sign painter: Carl Rohrs, who might even be able to meet with you and chat about lettering, signage, etc. He is a big fan of german calligraphers, and an amazing brush letterer. I keep wishing he would make typefaces, but he’s apparently busy making Santa Cruz graphically interesting. Santa Cruz also has some marvelous mid-century signage and it’s a fun town as well.\n\nThe Arion Press is in San Francisco, and I think they give regular tours.\n\nChris Stinehour lives in Oakland, in case you are interested in some stonecarving. Chris is a nice fellow.\n\nNow that we’ve barraged you with too many things to do, I’ll add one more: Let’s keep in touch about a dinner time you can meet up with some Bay Area type and lettering people. There’s a cluster here, It’s always fun to meet up; a little like a mini-conference. Do that on the early side of things and you’ll get a better sense of what’s easy, worthwhile, etc.\n\nI hope we’ll see you soon.\n\n"
    },
    {
      "time": " 22.Jul.2008 3.54pm",
      "content": "A cluster, you say?\n\n"
    },
    {
      "time": " 31.Jul.2008 7.44am",
      "content": "Thanks everybody for your input. I was hoping for early to mid 20thC shop signage of the sort seen in Vertigo, (I watched it again last night to familiarize myself with SF), but alas I suspect hardly any survives. It’s especially a shame if it’s covered. I’m not particularly interested in anything modern, although Santa Cruz sounds good. And I’m definitely not showing any work to anybody - I’m not bringing my portfolio or laptop - No work! I’m on vacation! Plus my wife is not of the typenerd world, so she would be less than enthralled listening to me and anybody else discussing ascenders, descenders, optical sizing and kerning. BTW. I designed Olicana and Gizmo but I’m most certainly NOT a calligrapher, I’m a typeface designer.\n\nCarl, It would be good to meet you folks in SF for an evening meal once we’re over the jet-lag\n\nHrant, we are planning on visiting the Getty and of course WallyWorld in Anaheim - just hope it’s open when we get there ;^) so we’ll have to arrange a meet.\n\nNick Cooke\n\n"
    },
    {
      "time": " 31.Jul.2008 7.54am",
      "content": "Super. Email me as needed: hpapazian\\_at\\_gmail\\_dot\\_com\n\n\\> once we’re over the jet-lag\n\n[http://news.bbc.co.uk/2/hi/health/7414437.stm](http://web.archive.org/web/20081013182135/http:/news.bbc.co.uk/2/hi/health/7414437.stm \"http://news.bbc.co.uk/2/hi/health/7414437.stm\")\n\nhhp\n\n"
    },
    {
      "time": " 31.Jul.2008 8.20am",
      "content": "Hmmm.... avoiding food for 16 hours. It’s a bit of a tall order.\n\nNick Cooke\n\n"
    },
    {
      "time": " 31.Jul.2008 8.35am",
      "content": "16? You probably don’t have to count the first leg, I assume to London. Just the main flight going due West, so about 11 hours. I haven’t tried this fasting trick myself. What I do is get about 3 hours of sleep (not more) on the plane, then things just fall into place. But for most people it’s easier to regulate eating than sleeping!\n\nhhp\n\n"
    },
    {
      "time": " 31.Jul.2008 11.14am",
      "content": "Nick, bring a sweater to SF. The sun is shining (in some parts of the city) during the day, but it has been fiercely cold and windy in the evenings.\n\nI highly recommend doing some nice walking tours of various neighborhoods and checking out the vernacular signage in San Francisco. The Mission is very good for this (I am biased because I live there). Loads of interesting examples of Latino lettering and there are some fabulous aging cinema signs on Mission street near 21st/22nd. There is also a really incredible graffiti culture here, the best I’ve seen also located in the Mission. Take a walk down Valencia between 16th and 20th, and look into some of the alleys there. Also try going up to 24th street, between Mission and Bryant streets you’ll find some really lovely works of art.\n\n"
    },
    {
      "time": " 31.Jul.2008 11.22am",
      "content": "There have been so many threads similar to this one (for various cities), it makes me think we should create a permanent location for typographic traveling resources. Mmmm…\n\n"
    },
    {
      "time": " 31.Jul.2008 11.40am",
      "content": "Good idea.  \nCould we splice it into Google Maps?\n\nhhp\n\n"
    },
    {
      "time": " 31.Jul.2008 11.53am",
      "content": "Hrant - I love the mapping idea and I think it would be an ideal feature to implement. I’m going to take this back to the team and discuss.\n\n"
    },
    {
      "time": " 31.Jul.2008 12.14pm",
      "content": "Nick, let us know your SF and LA dates.\n\n"
    },
    {
      "time": " 8.Aug.2008 7.34am",
      "content": "Those fabulous aging cinema signs are the sort of thing I’m looking for. A permanent location for typographic traveling resources is a great idea Zara- I’ve got loads of old Italian and other European signage. We must capture them before they all disappear and are replaced by boring laser-cut plastic crap.\n\nWe set off 2 weeks today!\n\nNick Cooke\n\n"
    },
    {
      "time": " 8.Aug.2008 10.37am",
      "content": "How can we reach you Nick? Get in touch via the contact forms here when you’re on the ground.\n\nDoesn’t Google Earth/Maps have some kind of pin/photo/locator feature? Put the photo on the map where you saw it. Turn on the pictures layer. Maybe we could get our own layer....\n\n"
    }
  ]
}
