{
  "id": "47463",
  "title": "Disposing of lead type",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A number of year ago I inherited about 80 lbs of type and a small hand press (needs new ink rolls). My mother used all of this along with a large 1800’s press (now gone) to create stationary, flyer’s, etc. in the 60’s before PCs. She purchased all of the type and equipment by going to auctions (many small town news papers going out of business auctions) in northern Missouri. I now need to dispose of it but find that a problem. I don’t really want to destroy it I would like to find someone that might use it. Other than the ink, which has dried out, I think everything necessary is there. Spacers, etc. I remember her settig pages. However finding someone that wants it and shipping is an issue.\n\nAny suggestions?\n\nThanks.\n\n [‹ Im Berlin](http://web.archive.org/web/20080907164859/http:/typophile.com/node/47484 \"Go to previous forum topic\") [Strange font sizes ›](http://web.archive.org/web/20080907164859/http:/typophile.com/node/47476 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907164859/http://typophile.com/user/33930\" title=\"View user profile.\">jpaddock</a>",
  "time": "<br>",
  "uid": "33930",
  "comments": [
    {
      "time": " 16.Jul.2008 7.05am",
      "content": "I’d like to know more. I might be interested in using some of it if it is ATF type in very good condition. I live in SW Wisconsin. We’d have to discuss what typefaces you have and shipping, etc.\n\nwork # = 888-444-MILK x3338 (Mike)\n\nThanks.\n\n(Last time I took a bunch of lead type to the scrap yard I got nineteen cents per pound for it...I heard the price is down since then.)\n\n"
    },
    {
      "time": " 16.Jul.2008 7.22am",
      "content": "Post it on the Briar Press classifieds ( [http://www.briarpress.org/](http://web.archive.org/web/20080907164859/http:/www.briarpress.org/ \"http://www.briarpress.org/\")) and your local Craigslist. Contacting your local art/design schools will probably turn up some letterpress/book arts types who will take it.\n\n"
    },
    {
      "time": " 16.Jul.2008 10.30pm",
      "content": "Briar Press classifieds is a good place to start, as James says.\n\nYou could also try asking these institutions:\n\n[http://www.mnbookarts.org/](http://web.archive.org/web/20080907164859/http:/www.mnbookarts.org/ \"http://www.mnbookarts.org/\")\n\n[http://www.sfcb.org/](http://web.archive.org/web/20080907164859/http:/www.sfcb.org/ \"http://www.sfcb.org/\")\n\nI’m sure they would both be interested in acquiring your type.\n\n"
    },
    {
      "time": " 17.Jul.2008 5.40am",
      "content": "YES !! You can contact me and we can talk . ( I want ALL of it! ) . Just kidding, talk to Koppa and myself and we get a nice home for them. ( 239 - 214 - 26 59 ).\n\n"
    }
  ]
}
