{
  "id": "47484",
  "title": "Im Berlin",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello,\n\nTomorrow evening I leave Stockholm for Berlin. This time I need something type related to keep me occupied while my better half visits Bergheim and Brandenburger tor. And as usual every little tip is of great value — bookstores to burial grounds etc.\n\nThank you!\n\n [‹ This cartoon wrote a sweary word on your toilet wall.](http://web.archive.org/web/20081201154725/http:/www.typophile.com/node/47488 \"Go to previous forum topic\") [Disposing of lead type ›](http://web.archive.org/web/20081201154725/http:/www.typophile.com/node/47463 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201154725/http://www.typophile.com/user/13022\" title=\"View user profile.\">Kristian M</a>",
  "time": "<br>",
  "uid": "13022",
  "comments": [
    {
      "time": " 16.Jul.2008 4.12pm",
      "content": "Bierstuben in the Berliner Museum\n\n"
    },
    {
      "time": " 16.Jul.2008 4.19pm",
      "content": "All the cemeteries in Berlin are a treat. There are several along the base of Prenzlauer Berg, just outside of Mitte (a short walk from Alexanderplatz). Kreuzberg has a massive multi-cemetery complex from behind the Bergmanstraße onwards.\n\nThe design bookstore fave seems to be Bücherbogen on Savignyplatz.\n\nI quite like the museums, but I wouldn’t say that they are quite typographic. Although current branding and ads for the Bode Museum and the Pergamon Museum are.\n\nThere are a number of monuments with inscriptional lettering to see, including the memorial to Soviet troops in Treptower Park as well as a memorial to WWII Polish partisans in the Friedrichshain Volkspark.\n\n"
    },
    {
      "time": " 16.Jul.2008 10.16pm",
      "content": "Karl, head over to Berlin’s Tempelhof airport (there’s a convenient subway stop). It is “the mother of all airports”\\*, sadly slated to close at the end of October. I don’t know about any type, but just the photos of its monumentalism give me the shivers (in the best way). I might make a trip to Germany just to fly into it, into its glorious canopy. Sigh.\n\n\\* Norman Foster\n\nhhp\n\n"
    },
    {
      "time": " 17.Jul.2008 12.12am",
      "content": "Check out this thread: [Typographic BERLIN](http://web.archive.org/web/20081201154725/http:/typophile.com/node/44942)\n\nFurthermore:  \nThe International Design Center hosts an [exhibition on 20+15 years of Information Design](http://web.archive.org/web/20081201154725/http:/www.idz.de/en/sites/1640.html), showing the works of Prof. Michael Klar (July 26th—August 22th).\n\nFrom 18th to 20th July, the UdK (Berlin University of the Arts) has its annual [Rundgang](http://web.archive.org/web/20081201154725/http:/www.udk-berlin.de/sites/content/topics/home/index_eng.html) (open days). There’s also a Design section.\n\n"
    },
    {
      "time": " 17.Jul.2008 5.50am",
      "content": "Thank you all and Schönes Wochenende!\n\nKTKM\n\n"
    }
  ]
}
