{
  "id": "47498",
  "title": "The Economist logo typeface?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Does anyone know the font they use for their posters and \"The Economist\" logo. Its similar to, but not quite, Plantin. Maybe a different weight/type which I havent been able to find\n\n| Attachment | Size |\n| --- | --- |\n| [economist\\_logo.png](http://web.archive.org/web/20150226170532/http:/typophile.com/files/economist_logo.png) | 4.79 KB |\n| [\\_40181610\\_economistads2032.jpg](http://web.archive.org/web/20150226170532/http:/typophile.com/files/_40181610_economistads2032.jpg) | 37.77 KB |\n\n",
  "author": "Conor Sullivan",
  "time": "17 Jul 2008 — 8:08am",
  "uid": "33984",
  "comments": [
    {
      "time": "17 Jul 2008 — 8:59am",
      "content": "According to the horses mouth:  \n [http://www.economist.com/help/DisplayHelp.cfm?folder=663377](http://web.archive.org/web/20150226170532/http:/www.economist.com/help/DisplayHelp.cfm?folder=663377 \"http://www.economist.com/help/DisplayHelp.cfm?folder=663377\")\n\nAbout the Logo:  \n\"The corporate logotype of The Economist has evolved from the gothic lettering used on the cover of the first issue, published in 1843, to the box device designed in 1959 by Reynolds Stone, a British engraver and typographer. It now incorporates a font from The Economist Typefamily, a typeface created specifically for our use.\"\n\nThe typeface:  \n\"The Economist has used a specially designed family of typefaces since May 1991. Development work focused specifically on how the new type family would respond to electronic transmission and different printing conditions at The Economist's seven international production sites. In our recent re-design a new typeface, Officina, was introduced for cover headlines and all navigational information. Ecotype, The Economist’s main typeface, was also redrawn to make it easier to read. If you would like to buy a copy of our type family, or if you would simply like to find out more about it, please go to Agfa Monotype's website\"\n\nA truly great publication! They document everything, the style guide regarding the use of English language within their articles is also pretty special:  \n [http://www.economist.com/research/styleguide/?CFID=13548251&CFTOKEN=6126...](http://web.archive.org/web/20150226170532/http:/www.economist.com/research/styleguide/?CFID=13548251&CFTOKEN=61264069 \"http://www.economist.com/research/styleguide/?CFID=13548251&CFTOKEN=61264069\")\n\nHope that helps. Peace!\n\n"
    }
  ]
}
