{
  "id": "47504",
  "title": "Suitcase Server / Font Management",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi All,\n\nI understand Extensis has recently released something called \"universal type server\". Has anyone been using this? We have about 12 machines in our office that are running Fusion. Fusion, in and of itself works fine, however, not following \"best practices\" seem to be what pull users into a pit of font problems (that and Microsoft Office).\n\nThere is some good info on organizing and managing fonts in the literature Extensis provides, but I was wondering if any of you have any sage advice for managing office fonts, client fonts, deploying newly purchased fonts, etc. Is Universal Type Server the answer?\n\nThanks in advance.\n\nchris\n\n",
  "author": "csr",
  "time": "17 Jul 2008 — 9:46am",
  "uid": "3630",
  "comments": [
    {
      "time": "17 Jul 2008 — 11:50am",
      "content": "I finally gave up on Suitcase completely. It WAS the best/only thing out there (pre-OSX), but corporate changes and OS changes have taken their toll. Reasons:\n\n1) Major releases/versions are buggy as hell;\n\n2) LOTs of updates to fix (1)\n\n3) Updates are a PAIN to get at (I feel like I have to give blood to get to their download area)\n\n4) For all their hype, the \"features\" they keep adding do nothing but distract\n\n5) NOT cheap (I'm tired of the \"We're gonna upgrade the version to infuse some cash\" philosophy)\n\nExtensis is a perfect example of a company that's goal seems to be to make things more difficult and obtuse voer time so you have no alternative but to submit to their superior corporate will. Portfolio is another example -- the ONE THING it should do well (let you quickly look up archived files by keyword) it does HORRIBLY, while Extensis spends time adding new Views to the windows or new icons. Argh.\n\nYou may want to wait and see what Apple is up to with Snow Leopard (OS 10.6)... It's very server-oriented, and one of the changes may be font management. Otherwise, I'd recommend FontAgentPro.\n\n"
    },
    {
      "time": "17 Jul 2008 — 2:32pm",
      "content": "mutual sentiments, Scott. Have you seen Extensis' new \"Universal Type Server\" program? The client side interface looks pretty simple and iTunes-esque.  \n [http://www.extensis.com/en/products/universaltypeserver/index.jsp?ref=hpBnr](http://web.archive.org/web/20131022124701/http:/www.extensis.com/en/products/universaltypeserver/index.jsp?ref=hpBnr \"http://www.extensis.com/en/products/universaltypeserver/index.jsp?ref=hpBnr\")\n\n"
    }
  ]
}
