{
  "id": "47518",
  "title": "MOAI (sketches & logo)",
  "forum": "jko's blog",
  "tags": [

  ],
  "content": "Esta noche hemos estado con Cristina modificando algunas letras que encontré en un viejo archivo FH9. La madre de un amigo tiene una pastelería en Isla de Pascua (leyó bien Isla de Pascua). Entonces estas letritas era de MOAI, un intento de alcanzar el estilo TIKI de houseindutries. Claro que falta mucha pega. por ahora modificamos solamente las letras que necesitábamos para componer el logotipo.\n\n ![](http://web.archive.org/web/20130816090720im_/http:/typophile.com/files/ma-ahu-logo-1_4815.jpg)\n\n ![](http://web.archive.org/web/20130816090720im_/http:/typophile.com/files/moai_4642.jpg)\n\n",
  "author": "jko",
  "time": "17 Jul 2008 — 5:27pm",
  "uid": "2111",
  "comments": [
    {
      "time": "8 Aug 2008 — 9:55am",
      "content": "Pienso que avanzarías mejor si trabajaras con palabras. Resultaría más práctico porqué percibirías de cerca el desempeño de formas/contraformas de cada glifo actuando con otros glifos.\n\nDe todos modos aquí va lo que veo:\n\nEl bastón izquierdo de \"A\" está muy delgado. Yo lo haría más cercano al bastón izquierdo de \"K\"  \nLa barra de \"A\" y \"H\" se ven débiles. Quizás más gruesa y un poquito salidas por la derecha en ambas quedarían mejor.\n\n\"o\" la veo angosta, quizás obtengas mejor color si se ve igual de ancha a \"b\" , \"p\" , \"d\" y \"q\"  \nEl bastón inferior de la barriga de \"a\" yo lo probaría en \"d\" y en \"q\" (sin ser exacto, claro)  \nel bastón izquierdo de \"h\" no lo haría tan curvo ni tan similar al bastón izquierdo de \"u\"  \nel bastón derecho de \"m\" tampoco lo haría tan curvo y literal con \"u\".\n\nEn mi opinión el espíritu que expele tu fuente creo que tiene que ver (Depronto ni lo hiciste pensando en ello pero no importa :) con la interpretación tipográfica del imaginario occidental de lo asiático. Trazos irregulares de pincel. Más rectos que curvos sin dejar de ser irregulares.\n\nEn cuanto a la interpretación (Quizás te de ideas): te recomiendo un pequeño e interesante libro llamado: Barthes Y El Imperio De Los Signos - Peter Pericles Trifonas (Ed. Gedisa). A continuación dos parrafos al azar:\n\n(\\*) Cuando Roland Barthes se interesó por la escritura nipona, hizo una \"interpretación ficticia del Japón\" fijándose puramente en la superficie de sus signos. Esto marcó un giro crucial en su trabajo, lo alejó de la obsesión occidental por los significados y le permitió plantear la cuestión de la arbitrariedad social e histórica de los signos. Este acercamiento de la semiología lingüística a la cultura, entendida como \"imperio de signos\", puso en marcha también una investigación crítica más amplia en los terrenos de los medios de comunicación y de la cultura popular. (\\*)\n\n(\\*) El conocimiento que tiene Barthes de Japón se limita a lo que ha leído sobre su historia y las imágenes que ha visto, tanto por su experiencia directa como en los medios de comunicación. Esta exposición a un archivo occidental de textos e imágenes llamado \"Japón\" establece el mito de Japón como parte de una cultura oriental que es contraria a una cultura occidental (\\*)\n\nSaludos desde Bogotá, Colombia,\n\n--  \nCarlos Fabián Camargo G.\n\n"
    },
    {
      "time": "9 Aug 2008 — 10:44pm",
      "content": "Carlos, Muchísimas gracias por el comentario, detallado y preciso.  \nSin duda requiere cambios en casi todos los glifos. Creo que compondré algunas palabra sy los dejaré en Critique acá está un poco escondido.\n\nPondré atención a ver si veo por ahí el libro de Barthes.\n\nsaludos desde un poco más al sur.\n\njko\n\n"
    }
  ]
}
