{
  "id": "4752",
  "title": "ARCHISTRUCTURE",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello community   \nI started this logo two days ago and it is about a studio which sets up exhibition kiosks. They do both the design and the production and are neither the small office that will be eclectic and produce high quality design, nor the big one with mass production and low costs. Actually those are their competitors, so they are trying to define themselves among them.   \nThe most taugh task it's their name (which is rather difficult and long -so not clear and easily eye-catching), so my efforts focused most at this point: it has to be the most legible it can be. At this direction the most effective solution   \nseemed to be the braking of the two consisting words of the name.   \nAlso if you have to recommend a subtitle (like \"expo experts\" or smthng at this manner) would be great.   \n   \nThanks for reading, Have a nice day.   \n   \nchristos   \n   \n ![logo1](http://web.archive.org/web/20131021030207im_/http:/www.typophile.com/forums/messages/29/35775.gif)\n\n",
  "author": "tsoler",
  "time": "13 May 2004 — 3:45am",
  "uid": "1058",
  "comments": [
    {
      "time": "13 May 2004 — 6:06am",
      "content": "I feel the solutions that don't break the words up seem to make more sense. D and B2 are my favorites.\n\n"
    },
    {
      "time": "13 May 2004 — 8:49am",
      "content": "D is alright but don't use any of those alternatives - placing words at 90degrees for varying circumstances isin't a good strategy nor would I say breaking up the logo just to fit a panel. Changing the entire shape you'll have a hard time proving public recall - which is the point of a logo in the first place. If it was for wrapping paper fine, use angels but not when its going to be 6x2feet.   \n   \nI'm also liking B2.   \nE and I are interesting and have potential I think.   \nA I'd throw out.\n\n"
    },
    {
      "time": "13 May 2004 — 8:55am",
      "content": "For practical reasons I'd agree with David, that \"D\" works well. Conceptually, however, I like the direction of C2 and the 3D graphic of E. Both of these need to be developed a little more, but I think both have good potential.   \n   \nNice work.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "13 May 2004 — 10:56am",
      "content": "I like C2 and H.   \n   \nhhp\n\n"
    },
    {
      "time": "13 May 2004 — 11:23am",
      "content": "C2 and B2.   \n   \nvery nice!\n\n"
    },
    {
      "time": "13 May 2004 — 1:18pm",
      "content": "This is interesting. Logos are something I struggle with frequently--especially when dealing with service-based companies. These concepts are very nice, but none conjure up images of kiosk development or touch screens or whatever. Should this be a concern, or is this one of those cases where \"suggestion\" is as far as you can go? For example, what would separate this from a structural engineering firm? Just curious of what everyone's thoughts are (especially you, Christos).   \n   \nI'm drawn to C2 and E, and I like the flexibility of D. I would imagine that the panels in version E could fold and turn to create variations as well. C2 has great \"interaction.\" Great stuff.   \n   \n-Addison\n\n"
    },
    {
      "time": "13 May 2004 — 1:59pm",
      "content": "I would guess this is a niche audience so they get it no real explaination needed. I would opt for a KISS solution, don't over think this one.\n\n"
    },
    {
      "time": "13 May 2004 — 2:39pm",
      "content": "Sorry to get off on a tangent--I think some of these are appropriate, myself. I guess I was hoping to hear some of Christos's reasoning behind some of these concepts, or at least what sparked some of these directions.\n\n"
    },
    {
      "time": "16 May 2004 — 5:40am",
      "content": "Hello everybody   \n   \nFirst of all thank you for the immediate feedback and the interest you all showed to the critic.   \n   \nI appologize for the delay of the response and i admit that the concept is not very clear.   \n   \nMy main object -as i mentioned before-was to make this difficult name the most legible and i worked on it in this two directions: a/ to separate (subtly but clear) the two words that the name comes from and b/ to design a simple form which would work rather to support the legibility than to describe the occupation. Of cource the result has to have reference to the activity of the company but in a generic -and not descriptive- way. Now if this can happen in an intersting way (as i believe happens in C2 and H) that would be welcome.   \n   \nLet's say the concept is immediate legibility (imagine that the main exposition of the logo will be on trucks and while in traffic the \"audience\" has to \"catch\" the name in a very short time), plus anything \"intersting\" implies setting things in a space (that's why D).   \n   \nAlso a bold solution (G) -showing that they are considerable competitor- and a sophisticated one (I) should be basic players of the team.   \n   \nHave a nice day   \n   \nchristos\n\n"
    },
    {
      "time": "16 May 2004 — 10:17pm",
      "content": "yah, what is wrong with G. why i like it. did i too bad to know anything about logo??\n\n"
    },
    {
      "time": "17 May 2004 — 3:24am",
      "content": "C2 is my favourite (the others are ...erm, too obvious solutions) But you should definitely do something for the type...line height at least\n\n"
    },
    {
      "time": "13 May 2004 — 12:15pm",
      "content": "Color: E or D   \nShape: C2   \nSubtlety: I   \nPotential: C2, D or I   \n   \nI agree that this word is perhaps dependant upon reading it entirely and so to break it apart is probably not a good choice. So C2, while the most interesting shape, doesn't work (well not completely. I'm a rebel. What if ARCHI was the lighter weight typeface? Or can they overlap more or not touch?)   \n   \nFor D, I'm seeing Paula Scher (not accusing you of anything, I'm reading her book right now). What if the word never broke apart, but from use to use the bars could form different shapes? Or what if the could attach differently or even detach (such as B1)?   \n   \nI think my favorite is 'I' ... so simple. The lines could perhaps be shades of the same color, they could move. I can even see motion and vibration happening (kiosk tv display promo thingy).\n\n"
    }
  ]
}
