{
  "id": "4755",
  "title": "Divisign Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hallo everybody,   \nI\n\n",
  "author": "stefanie",
  "time": "13 May 2004 — 5:59am",
  "uid": "3763",
  "comments": [
    {
      "time": "13 May 2004 — 6:18am",
      "content": "hi, Stefanie.   \nfirst of all i dont like italic in \"divisign\"   \nand its spacing in correlation with   \n\"forte+wegmann\". maybe you should use   \nsome real 3d forms as a sign?\n\n"
    },
    {
      "time": "13 May 2004 — 6:59am",
      "content": "Hi Dmitry,   \nthanks for your answer.   \nYou are right I don\n\n"
    },
    {
      "time": "13 May 2004 — 7:14am",
      "content": "3D scanning = cutting edge   \n   \nlogos with gradated lines = too 70's/80's-era\n\n"
    },
    {
      "time": "13 May 2004 — 8:18am",
      "content": "i meant some pseudo 3d structure   \nor something more modern (as Darrel said)..   \nabout typeface, try some techno faces or   \nfrutiger but at more havy weight..\n\n"
    },
    {
      "time": "13 May 2004 — 9:06am",
      "content": "Stefanie:   \n   \nI like your concept of taking the parent company's mark and giving it a 3-D effect, but you may need to loosen it up a bit to avoid having it look dated (as Darrel said, \"too 70's/80's-era). Develop the concept more, but don't make it look so rigid (square).   \n   \nWhat kind of scanning technology is used? Do points/dots represent the technology better than lines?   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "14 May 2004 — 12:17am",
      "content": "Thanks for your answers.   \nIt is an optical scan technology, with two cameras. If an object is scanned there will apear lines on the object. There are no points in the scanning process instead of a red laser point to focus the object.   \nPerhaps I could try to use some kind of camera for the logo but the scanned objects should be on the focus.\n\n"
    },
    {
      "time": "27 May 2004 — 2:31am",
      "content": "Hallo everybody,   \nhere are my new results:   \n   \n ![](http://web.archive.org/web/20131021030450im_/http:/www.typophile.com/forums/messages/29/36844.jpg)   \n   \n   \nThe logotype is info office and info text in different versions.   \nNow I don\n\n"
    },
    {
      "time": "27 May 2004 — 5:56am",
      "content": "Why do you have variations in type weight? To the average person it might seem like an accident or way to suttle of a concept.\n\n"
    },
    {
      "time": "27 May 2004 — 11:12am",
      "content": "Why are you not dotting the \"i\"'s in the lc versions? They look like \"1\"s. Is this intentional, and if so, what does it mean? Honestly, none of these are working for me. I don't think the two faces are working well together. Especially with the weight treatment that David identified.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "8 Jun 2004 — 7:07am",
      "content": "Hi Stefanie,   \n   \nhow's it going? I'm interested in the progress, if there is any.   \n   \nMy $0,02:   \n   \nLike Scott, I don't really see any of the four Info Office/Info Text concepts work well.   \n   \n1st one: spaced too tight. Base line of the two parts (divi and sign) doesn't seem to match. \"i\"s look like \"1\"s.   \n   \n2nd one: I don't see the two sides go very well together. Somehow I find the lettershapes of the \"divi\" part too cheap.   \n   \n3rd one: Base line problem again. I don't really like the serifs on the divi side either.   \n   \n4th one: Absolute no-go, if you ask me. Info Office and Info Text look way too similar in this one, building up zero contrast, but giving an uneasy, heterogenous look to the whole thing. \"i\"s look like \"1\"s again.   \n   \nGenerally, I don't see why you're breaking up \"divisign\" into two parts and why the \"sign\" part is emphasized, particularly as you stated above that it's composed of three ingredients (digital, vision and sign).   \n   \nThe divisign logo isn't bad as a variant of the mother company logo, but I think that there's room for improvement, especially when a very close resemblance between the two logos isn't mandatory.   \n   \nFrom a geometric point of view, the pseudo 3D logo isn't completely logical (with the vertical lines forming a square, one would intuitively expect the lines that indicate the sphere to flow both to the left and the right instead of exclusively to the right), but this isn't too big of a concern to me.   \n   \nKeep it coming. ![:-)](http://web.archive.org/web/20131021030450im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \njpg\n\n"
    },
    {
      "time": "8 Jun 2004 — 7:24am",
      "content": "Yes, keep it coming...\n\n"
    },
    {
      "time": "8 Jun 2004 — 11:12pm",
      "content": "hi everybody,   \nfirst of all I want to thank you all, you really helped me a lot.   \nUntil now my boss wants this logo:   \n   \n ![](http://web.archive.org/web/20131021030450im_/http:/www.typophile.com/forums/messages/29/37825.jpg)   \n   \nIt was his suggestion to split the logo in two parts. The colours are the   \nsame as in the old logo. He also wanted 3D effects with photoshop filters   \nlike shadows ...   \nSo I think this is the best compromise.\n\n"
    }
  ]
}
