{
  "id": "47563",
  "title": "Veer contract",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I saw Olicana used to write \"Tropical Paradise\" in an ad today, and decided to visit its critique page, where I found out that it's been pulled from the market because Veer has an \"unreasonable\" new contract, due to new management. This made me concerned, because I'm working on getting my first font (Newt) sold, and I've gotten it pretty far down the pipeline with Veer. What should I know about Veer's new terms? I'm pretty sure Grant Hutchinson is an honest guy, but you never know about upper management, so it'd be nice to know what's changed and what makes it \"ridiculous\".\n\nNathanael\n\n",
  "author": "Number3Pencils",
  "time": "19 Jul 2008 — 4:03pm",
  "uid": "7642",
  "comments": [
    {
      "time": "19 Jul 2008 — 8:46pm",
      "content": "This is Typophile. Not Veer. Contact Grant and ask him.\n\n"
    },
    {
      "time": "19 Jul 2008 — 9:39pm",
      "content": "Very reasonable. I don't mean to sound accusatory in this; mainly I'm curious, and certainly not interested in making enemies. I'll ask Grant. In the meantime, now that I've breached the topic, if anyone else wants to sound off on it, it couldn't hurt to know what typophiles at large think.\n\n"
    },
    {
      "time": "19 Jul 2008 — 10:02pm",
      "content": "It would also be strange for a font to be \"pulled\" because of an \"unreasonable contract\" - once the contract is signed its a bit too late to say its unreasonable? Sure contracts get terminated due to breach or a change of heart, but unreasonableness?\n\n\\>This made me concerned, because I’m working on getting my first font (Newt) sold, and I’ve gotten it pretty far down the pipeline with Veer.\n\n\"Pretty far down the pipeline\" and you've not seen the contract?\n\n"
    },
    {
      "time": "19 Jul 2008 — 10:36pm",
      "content": "Hi a question, Q: wont someone at Veer be reading this anyway?\n\n"
    },
    {
      "time": "19 Jul 2008 — 11:11pm",
      "content": "They're all at the party right now. Maybe after chucking out time.\n\n"
    },
    {
      "time": "20 Jul 2008 — 12:47am",
      "content": "I wrote an e-mail, but I've only ever gotten e-mails during business hours, so that probably won't get to him until Monday. He may see this first, which I mentioned in the e-mail.\n\nI have seen the contract (or rather, a preliminary draft), but this is my first time selling a font, so I don't have any idea what a different contract might look like. It seemed reasonable to me, which is why I was wondering.\n\nI'm not sure what the chain of events was that led to Olicana not being sold by Veer anymore. [Here](http://web.archive.org/web/20131014231714/http:/www.typophile.com/node/16296)'s the relevant thread, with people starting to discuss it on November 4th last year.\n\n"
    },
    {
      "time": "20 Jul 2008 — 2:28am",
      "content": "It isn't a good idea to discuss details of contracts –&nbsp;which are private agreements – in a public forum. Just because it has been done already doesn't make it any better.\n\n"
    },
    {
      "time": "20 Jul 2008 — 3:46am",
      "content": "If I was Veer I would be slightly concerned... I too think you may want to be a bit more discreet. stop here.\n\n"
    },
    {
      "time": "20 Jul 2008 — 6:59am",
      "content": "\\>I have seen the contract (or rather, a preliminary draft), but this is my first time selling a font, so I don’t have any idea what a different contract might look like.\n\nI believe investing in a few hours consult with an IP lawyer would be a good move.\n\n"
    },
    {
      "time": "20 Jul 2008 — 7:21am",
      "content": "Oh, and did you sign an \"NDA\" (an NDA is a non-disclosure agreement) with Veer before they sent the contract?\n\nCheers, Si\n\n"
    },
    {
      "time": "20 Jul 2008 — 11:26am",
      "content": "No, I never signed an NDA. I thought it would be okay to talk about Veer's terms in general, not my specific contract, but you all are probably right. I'll keep this between me and Grant, I suppose, unless anyone would like to private-message me.\n\n"
    },
    {
      "time": "20 Jul 2008 — 5:56pm",
      "content": "Also, I apologize to anyone who might need an apology for my faux pas in bringing up the contract.\n\n"
    },
    {
      "time": "21 Jul 2008 — 3:14am",
      "content": "I wish I'd never mentioned it now. The problem concerned only a few points in the contract. I was pretty annoyed at the time, and maybe posted too hastily, but the situation may yet have a solution. I have great respect for Veer - their marketing is fantastic, and I was proud to be associated with them.\n\nPlease, no more discussion on this subject.\n\nBTW, what was the ad?\n\nNick Cooke\n\n"
    },
    {
      "time": "21 Jul 2008 — 9:23am",
      "content": "It was in one of those neighborhood circulars that get mailed to \"Current Resident\", this one in the Cincinnati area. I think it was for pools, but I don't have it right now. I remember thinking, \"Wow, if that's Olicana, it's gotten a whole lot of market penetration in a very short time.\" And it was, so it has. I congratulate you--within one year, your font made it into a place where I'd expect most people to just use system fonts.\n\nI'm probably over 99% sure I'll still market with Veer, so now this has been graded down to just being kind of curious, mixed with not worrying about it. Whenever I hear back about it, that'll probably satisfy me.\n\nCheers!  \nP.S. If I find the ad again, I'll post here what the company's name is.\n\n"
    },
    {
      "time": "21 Jul 2008 — 10:04am",
      "content": "Nathanael, I have sent you a reply via email.\n\nI would have been quicker to respond, but I've been returning and decompressing from TypeCon for the past day or so.\n\nNick, thank you for your input … no need to apologize. I just wish the contractual situation could have been resolved months ago … unfortunately, it was beyond the control of my particular sphere of influence. I still anticipate a resolution, and the return of G-Type to Veer.\n\n"
    },
    {
      "time": "21 Jul 2008 — 11:10am",
      "content": "Hello Nathanael,\n\nI think you have to rename your typeface Newt because there is already a typeface with the same name:  \n [http://www.garagefonts.com](http://web.archive.org/web/20131014231714/http:/www.garagefonts.com/ \"http://www.garagefonts.com\")\n\nPieter\n\n"
    },
    {
      "time": "22 Jul 2008 — 2:20am",
      "content": "Thanks Grant. I'd rather be with Veer than Fonts101:\n\n[http://www.fonts101.com/forums.asp?tt=forumreply&TopicID=633&ForumID=1](http://web.archive.org/web/20131014231714/http:/www.fonts101.com/forums.asp?tt=forumreply&TopicID=633&ForumID=1 \"http://www.fonts101.com/forums.asp?tt=forumreply&TopicID=633&ForumID=1\")\n\nNick Cooke\n\n"
    },
    {
      "time": "22 Jul 2008 — 3:11am",
      "content": "Nick, that must hurt to read such a topic. And there's even a name of a forum member on that list.\n\n"
    },
    {
      "time": "22 Jul 2008 — 3:20am",
      "content": "Nick, that thread is one of the most repulsive and distressing things I have seen in a while. I'm so sorry that this has happened to you and other designers.\n\n"
    },
    {
      "time": "22 Jul 2008 — 6:28am",
      "content": "That really sucks. They don't even care about posting their addresses. Such blatant thieves! :-(\n\nChrisL\n\n"
    },
    {
      "time": "22 Jul 2008 — 1:14pm",
      "content": "Nick, contact them. Let them know you do not allow free sharing. I think they are trying to stay on the right side of that, but they won't know unless you contact them.\n\n"
    },
    {
      "time": "22 Jul 2008 — 1:26pm",
      "content": "Ouch. That thread makes me really sad.  \nYes, I'd say Veer is quite the good bet, especially if that's the alternative. I'm not worried about Veer at all. Thanks, everyone.\n\n"
    },
    {
      "time": "22 Jul 2008 — 6:35pm",
      "content": "Nick,  \nSorry to see that fonts 101 business. When my font Chai Tea first came out I saw similar things happening, but not on a free font site. There are lots of sites about where people blatantly give out intellectual properties such as fonts. The person giving my font away was acting as though we were romantically involved and I wanted to spread the wealth. Such thievery is tragically rampant.\n\nVeer, by the way, has been great for me. My deal is exclusive and thus uncomplicated. They are very good at marketing and since I'm not, it works like a charm.\n\nStephen\n\n"
    },
    {
      "time": "22 Jul 2008 — 6:43pm",
      "content": "Wow. Crazy blatant piracy!\n\n"
    },
    {
      "time": "23 Jul 2008 — 1:28am",
      "content": "I have contacted them - to no avail, it's still there.\n\nNick Cooke\n\n"
    },
    {
      "time": "23 Jul 2008 — 4:43am",
      "content": "Nick, maybe you could ad a comment right there and tell them what is what. Sorry for you sir.\n\n"
    },
    {
      "time": "23 Jul 2008 — 6:12am",
      "content": "At least I've worried some people. I sent all those who requested the font a personal email telling them they're using stolen property.\n\nBut some others have actually gone and bought a license.\n\nNick Cooke\n\n"
    },
    {
      "time": "23 Jul 2008 — 6:22am",
      "content": "Good for you, Nick. I see someone posted a copy of your cease-and-desist on the thread, too.\n\n"
    },
    {
      "time": "24 Jul 2008 — 3:35am",
      "content": "I posted that Ricardo.\n\nAnyway, it just took them a couple of days to reply to me and they have now removed that thread, for which I am very grateful.\n\nNick Cooke\n\n"
    },
    {
      "time": "25 Jul 2008 — 10:04am",
      "content": "Hurrah, I'm so glad that site is specifically trying to stay away from sharing retail fonts. There are some sites that really encourage massive piracy, but apparently this is a pretty honest group.\n\nI know we'd all be glad to recommend that people purchase Olicana, where can we send them now?\n\n"
    },
    {
      "time": "26 Jul 2008 — 1:18pm",
      "content": "Thanks Carl. Still only at: [Fontworks UK](http://web.archive.org/web/20131014231714/http:/www.type.co.uk/index.php?p=a_to_z&search=Olicana) for the time being. Maybe other places too soon.\n\nNick Cooke\n\n"
    },
    {
      "time": "3 Aug 2008 — 7:32pm",
      "content": "Now you people got me curious about that piracy forum. It seems they have quickly deleted the thread or something, since the link seems dead.\n\n[edit]\n\nAlthough it seems someone else started [a new one.](http://web.archive.org/web/20131014231714/http:/www.fonts101.com/forums.asp?TopicID=1022&ForumID=1&tt=forumreply)\n\n"
    },
    {
      "time": "4 Aug 2008 — 2:19am",
      "content": "Dammit! Those buggers don't give up do they?\n\nNick Cooke\n\n"
    },
    {
      "time": "4 Aug 2008 — 3:37pm",
      "content": "Please, nobody confuse that Fonts 101 site with [http://1001fonts.com](http://web.archive.org/web/20131014231714/http:/1001fonts.com/). That's a completely different site.\n\n"
    },
    {
      "time": "6 Aug 2008 — 11:51am",
      "content": "Nick: no, I doubt they ever will, unfortunately.\n\n"
    }
  ]
}
