{
  "id": "47576",
  "title": "What's up with this place?",
  "forum": "louie c's blog",
  "tags": [

  ],
  "content": "Not only does political signage amuse me during election time , but the attitudes and tactis of the participants are pretty dam funny as well. It seems as though elections are a manifestation of the fountain of youth considering that it makes fifty and sixty year old men and women behave like they’re five year old children.Everthing from the mud slinging, the backstabbing, the alliances, and the buttons, is reminiscent of days I spent in middle school. Rediculous, isn’t it?\n\nI kind of have the same opinion of my country that I do of my state, a type of love/hate relationship. I love the people, the diversity, the entrepeneurial spirit, but I do not agree with it’s politics, nor the “notion” that we are actually “free”. I do believe that our country has strayed too far from the original ideas of it’s founding fathers and in turn has taken power away from it’s citizens and has created an imperealistic way of governing.\n\n",
  "author": "<a href=\"/web/20081122043207/http://www.typophile.com/user/31635\" title=\"View user profile.\">louie c</a>",
  "time": "<br>",
  "uid": "31635",
  "comments": [
    {
      "time": " 21.Jul.2008 4.37am",
      "content": "America is as free as the people let it be. If you do not vote or take part in the political process, state your opinion with words, letters, phone calls, votes and most important, your pocket book you give up your freedom to the corporate bodies willing to use all those methods of influence. The corporate bodies want you docile, meek, and uninterested. Our lack of freedom is our choice until we decide to give it away too. Politics is a give and take and the US is 51% left and 51% right depending on the weather, the question, and the statistical analyst. Everything is normal and as it was before. The founding fathers did not allow women to vote, or non land owners. If we change it back would we have a better system than now? Americans can change the country and its direction, that is the beauty and the ugly of America depending on which 51% you are.\n\nThe internet is the best platform ever for the growing political action groups that have goals, plans, and direction. Find one you like and use all the tools that you have not been using to get your voice heard. At the end of the day the politicians will make choices that tend to please their supporters and sponsors, their careers, and their country. If they do not do it the way we like we can replace them like California did with old governor what’s his name. The structure is set up so we can not change things too fast which is healthy but requires the public to be on their toes year after year governing the government.\n\n"
    },
    {
      "time": " 21.Jul.2008 7.11am",
      "content": "“I love the people...but I do not agree with it’s politics”\n\nIn the US, the people = the politics.\n\n"
    },
    {
      "time": " 23.Jul.2008 3.57am",
      "content": "i cannot agree with the voting aspect...those that say if you do not vote, you have no right to bitch are in fact a bunch of undereducated asses..I’ve grown up in Louisiana politics for my entire life..I will say that if I choose not to vote, according to the current political system, I am still a TAX PAYER! I have been given the right, whether I choose to vote or not!, to voice my own opinions and to also disagree with my government.\n\nI am in no way saying anything ill, just re-iderating my thought and ideals that “represent” me and my people\n\n"
    },
    {
      "time": " 14.Aug.2008 2.32am",
      "content": "What legal tool do you have besides your voice, and your vote? What more powerful tool do you have than your pocket book? Are you the only one unsatisfied? Get organized like the ones are that you do not like. The beauty of the USA is that you will not go to jail for it and you can change it. Do you disagree?\n\n"
    }
  ]
}
