{
  "id": "47571",
  "title": "Epiphany (contemporary skoropis)",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "Hello!\n\nThis is my typeface Epiphany.  \nIt is a contemporary interpretation of Russian skoropis. Epiphany has its origin in calligraphic scripts of 15-17 centuries, but it has almost no contrast. I saved typical calligraphic movements and historical letterforms, but I removed original skoropis tool (goose quill). So, Epiphany is not a revival, but skoropis of our days. It has rich set of Cyrillic ligatures and alternates.  \nNow I want to create Latin letters for Epiphany. What can you advice me? Are there any Latin calligraphic styles which are suitable for my typeface?\n\nThank you!\n\n ![](http://web.archive.org/web/20150419100144im_/http:/typophile.com/files/epiphany_poster_900_600_6684.gif)\n\n",
  "author": "om",
  "time": "20 Jul 2008 — 11:54am",
  "uid": "19022",
  "comments": [
    {
      "time": "11 Aug 2008 — 7:52pm",
      "content": "I like this.\n\nIt's not clear what you mean when you ask for Latin calligraphic styles that are \"suitable\" for this face.\n\nI'd start by adapting letters like A, B, K, etc. that are the same in Cyrillic and Latin, and then finish the rest off in the same style.\n\n-matt\n\n"
    },
    {
      "time": "16 Aug 2008 — 3:02am",
      "content": "Thank you, Matt!\n\nEpiphany has a lot of historical forms, because it is based on 15-17 centuries writting. So, I would like to add a shade of archaism to Latin too. And I need original historical Latin forms. Do you know any Latin script like a Russian skoropis?\n\nSorry for my English.\n\n"
    },
    {
      "time": "16 Aug 2008 — 4:04am",
      "content": "This is gorgeous. I love it.\n\nTo me, this looks totally modern. It reminds me a bit of my own [ITC Dartangnon](http://web.archive.org/web/20150419100144/http:/www.linotype.com/626/itcdartangnon-family.html). Except mine has rounded terminals.\n\nNick Cooke\n\n"
    },
    {
      "time": "17 Aug 2008 — 5:21am",
      "content": "Thank you, Nick!\n\nIt’s very pleasant, that Epiphany looks totally modern for you. But Сyrillic readers can feel the spirit of the Middle Ages in Epiphany. So I would like to find historical forms to Latin.  \nWhat can you say about my first attempt in Epiphany Latin?\n\nOleg Macujev\n\n ![](http://web.archive.org/web/20150419100144im_/http:/typophile.com/files/epiphany_latin_3617.gif)\n\n"
    },
    {
      "time": "19 Aug 2008 — 7:34am",
      "content": "Looks great Oleg! I can already see 3 OT features; Swash cap R, replacement ligature ss, and contextual alternate end character a. Why do you need to find something else? You are perfectly capable of creating it yourself. Carry on in that vein and it'll be a winner in Latin and Cyrillic.\n\nNick Cooke\n\n"
    },
    {
      "time": "19 Aug 2008 — 5:26pm",
      "content": "Absolutely agree. This is such a fresh and lovely take on something that, for me, feels slightly reminiscent of art deco scripts.\n\nI'm pushing this to the front page. Gorgeous.\n\n"
    },
    {
      "time": "19 Aug 2008 — 5:58pm",
      "content": "Beauty! It's probably not something you intended, but it's perfect for pysanky with a modern kistka (no chicken bones!).\n\n"
    },
    {
      "time": "20 Aug 2008 — 12:35pm",
      "content": "Nick, Miss Tiffany, Mica, thank you all!\n\nto Nick: I will try to develop Latin part this way, but some historical forms wouldn’t be a bad thing.\n\nto Miss Tiffany: Art Deco? It’s funny. I didn’t think about this style while working on Epiphany.\n\nto Mica: Exactly, Epiphany is closely connected with national culture and national crafts. So, pysanky will be good application for my typeface.\n\nOleg\n\n"
    },
    {
      "time": "20 Aug 2008 — 10:27pm",
      "content": "Maybe a little after Art Deco. More along the lines of the lettering they used for silent movies.\n\n"
    },
    {
      "time": "20 Sep 2009 — 8:37pm",
      "content": "Hello!\n\nI've reverted to Epiphany Latin and create u&lc and some alternates and ligatures.  \nI've tried to mix cursive and uncial forms, as I did in Cyrillic part.  \nDoes it look natural?\n\n ![](http://web.archive.org/web/20150419100144im_/http:/typophile.com/files/epiphany_lt_4116.png)\n\n"
    },
    {
      "time": "21 Sep 2009 — 2:23am",
      "content": "Lovely! It seems a little less “flowing” than its cyrillic counterpart. I think it’s because it seems to lack an uniform direction/structure.\n\n"
    },
    {
      "time": "23 Sep 2009 — 4:22pm",
      "content": "Yay! Inspirational, and fun to look at.\n\n"
    },
    {
      "time": "9 Mar 2010 — 6:04pm",
      "content": "I really love this font! How do I contact you? I would like to learn more about it. I have a Russian text that I would like to be this type. \"человек рассужен его действиями, не его словами\" Can you help me?\n\n"
    },
    {
      "time": "30 May 2011 — 1:51pm",
      "content": "oh my gosh, beautiful!  \n//am a proud russian now.\n\n"
    },
    {
      "time": "30 May 2011 — 2:30pm",
      "content": "You took a break?\n\nhhp\n\n"
    }
  ]
}
