{
  "id": "47590",
  "title": "Would you Scuba Dive with us?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi guys,\n\nI wish I was as creative as some of the work I've seen in this forum! Nonetheless would you mind letting me know your thoughts on this logo for a scuba diving company in Kenya. What I have attached is the logo incorporated into a sign board. The idea is to make large sign boards to place around the town. Each will be like 2m square and will be white board with 3 colours of vinyl stuck on, navy blue, mid grey, and gold.\n\n ![](http://web.archive.org/web/20130715235342im_/http:/typophile.com/files/logo_5436.gif)\n\nI can just imagine you all thinking what the hell kind of beast is that on the logo! I feel the same way. It's a manta ray... not my choice.\n\n| Attachment | Size |\n| --- | --- |\n| [logo.gif](http://web.archive.org/web/20130715235342/http:/typophile.com/files/logo_40.gif) | 11.35 KB |\n\n",
  "author": "paulsschwarz",
  "time": "21 Jul 2008 — 7:09am",
  "uid": "23484",
  "comments": [
    {
      "time": "21 Jul 2008 — 9:02am",
      "content": "I picked up the manta ray right off. The only thing I'm confused about is the company name? Is it Aqua Ventures? or Ocean Sports? Is there going to be a phone number? I do like the oceanic colors.\n\n"
    },
    {
      "time": "21 Jul 2008 — 10:54am",
      "content": "Ok thanks for bringing that up, Ocean Sports is a hotel on the coast in a town called Watamu. Aqua Ventures is the Scuba center based at Ocean Sports. The two however are separate business entities and have little to do with each other. Around here it is understood that Ocean Sports is the \"host\" hotel, but yours is still a very good point... most tourists might not be aware.\n\nShould I put \"at OCEAN SPORTS - WATAMU\"?\n\nAnd Aqua Ventures is a limited company, so should I put \"AQUA VENTURES LTD\" at the top?\n\nAlso what to people think of the mix of font faces? I very much like the ITC Legacy Sans at the bottom, but not sure about the Avenir at the top.\n\nAlso AQUA VENTURES is biased to the left, but balanced out by the golden sun biased to the right... how does that flow with Scuba Dive in the center?\n\nThanks\n\n"
    },
    {
      "time": "21 Jul 2008 — 11:28am",
      "content": "The colors are OK, but I think the ray could be simplified.  \nAlso, the type could be stronger.  \nYou don't need to put LTD - the general public doesn't need to know this.\n\n"
    },
    {
      "time": "21 Jul 2008 — 11:55am",
      "content": "The first thing I saw was a strange arm with a claw. I think the ray from a top-down view might be stronger. The type also lacks cohesion, and I don't like your name in italics. In fact, the whole treatment lacks balance and flow.\n\nI would suggest getting the mark solid first, and then worry about the type, particularly if the manta ray is a non-negotiable in the piece. Otherwise, you're just fiddling around with type to compliment a not-so-particularly strong mark.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "21 Jul 2008 — 12:22pm",
      "content": "Thanks everyone, Nick you are quite right, I should get the mark right before I worry about font.\n\nLet me give you some history about the client. They have been using the manta ray in their logo for 20 years. They were the first, and remain the most reputable Scuba enterprise on the Kenya coast. Here is their very first... and still current logo.\n\n ![](http://web.archive.org/web/20130715235342im_/http:/typophile.com/files/old%20logo_6482.GIF)\n\nThey rely heavily on repeat customers. I thought therefore to acknowledge the old repeat customers it would be only fair to stick with a logo that they know for nostalgic purposes, but equally to acknowledge them by updating it and giving them the impression that the company is still strong after 20 year and they're going to get the same professional personal treatment they're used to. (You know what it's like when you're a regular at a joint and then they get a new corporate image and you feel you're not a part of it anymore?)\n\nApart from all that we're very open to new ideas for a logo, doesn't have to be a ray. I also like the idea of a manta ray from top view but one of Aqua Venture's competitor has done it: [http://www.buccaneerdiving.com/](http://web.archive.org/web/20130715235342/http:/www.buccaneerdiving.com/ \"http://www.buccaneerdiving.com/\")\n\nAny suggestions on other interesting beasts of the ocean/how to turn them into captivating logos?\n\n"
    },
    {
      "time": "21 Jul 2008 — 3:26pm",
      "content": "I think you've stayed too close to the original logo. The elements that people will recognize are a blue ray on top of a yellow circle, but not necessarily that specific drawing of a ray.\n\nTry playing with these two elements, and simplify the drawing some more.\n\n- Lex\n\n"
    },
    {
      "time": "21 Jul 2008 — 4:30pm",
      "content": "<cite>\"I can just imagine you all thinking what the hell kind of beast is that on the logo! I feel the same way. It’s a manta ray... not my choice.\"</cite>\n\nNot an excuse. Try to direct your customer to a better concept by showing them. They picked some mark that is not clear for everyone at first sight. That is not a well known animal and looks like a bat... Ugly, even scary. What I first saw was a forefinger and a thumb pulling a sticker from its edge. Forget the sign boards and make a good logo that will work everywhere. You need a new concept.\n\nDivers, mermaids, waves, fish are first marks come to my mind. You asked for beasts. Why not go for cute animals like dolphins, sea horses, tropical fish if an animal is a must?\n\n"
    },
    {
      "time": "21 Jul 2008 — 6:03pm",
      "content": "Paul:\n\nI feel, as I am sure many here will agree, that when redesigning a logo it is important to redesign it and not waste more money by investing in a flawed and unmemorable mark.\n\n<cite>They rely heavily on repeat customers. I thought therefore to acknowledge the old repeat customers it would be only fair to stick with a logo that they know for nostalgic purposes...<br>\nApart from all that we’re very open to new ideas for a logo, doesn’t have to be a ray. I also like the idea of a manta ray from top view but one of Aqua Venture’s competitor has done it.</cite>\n\nYou must realize then that this mark is not even unique and is used by their main competitor! And as bad as their logo is, this is not any better.\n\nAnyway, I do not like the italic type on top. Try it in Avenir Bold. The colors are quite muted also and not really helping. Why not work in black and white first?\n\nI would also say 'OCEAN SPORTS HOTEL' to make it clearer. As for the 'LTD' that will just confuse the identity and a legal business structure means nothing to their customers.\n\nHope this helps.  \nJay\n\n"
    },
    {
      "time": "22 Jul 2008 — 4:13am",
      "content": "As a diver myself, I do not feel attrackted by the logo.  \nPersonaly, I'm looking for fibrant. Bright. Happy. These colors are too much business-like for me. Oke, I don't know the underlying identity. But I my experience all the dive-masters were people loving their job. The business 'comes in second place. They love this life. Reflect this.\n\nIt is too much of the same. It is not unique.\n\nWhy use two typefaces? Have you tried just using just one, more contemporary?\n\nYou can always choose to use just a part of the ray.\n\nI can't find a real concept in you text. Maybe you are just concentrating too much on the graphics now. First make sure you have got a good working concept. Then concentrate on the graphics.\n\nHope this helps, too.\n\nSuccess!\n\nRay\n\n"
    },
    {
      "time": "22 Jul 2008 — 5:09pm",
      "content": "my first impressions were ... wtf is that!?!\n\nhonestly though ... if I want to scuba dive, I'll dive ... the decision most likely won't be based on the logo ... however in a competitive situation the logo would definitely come in to play ... depends what the competition looks like I guess.\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20130715235342/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
