{
  "id": "47599",
  "title": "Plagiarism with intent or predisposed solutions?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Just a thought...that will hopefully initiate a good discussion and get these cobweb-covered minds thinking on a Monday morning, after a long hot humid weekend. ;)\n\nAs creative individuals, we can come up with unlimited ideas, at least in theory. So when two designers on different sides of globe are given an similar project (i.e., an identity for a plumbing company), and they just happen to come up with identical solutions......then what do we consider the outcome?\n\nIs it...  \nA. Plagiarism with intent? I don’t think this needs to be explained since we all know what plagiarism is.  \nB. A project with a predisposed outcome? Let’s face it: regardless of our individual creativity, there are solutions that are destined for specific projects. For the example above (plumbing company identity) how many of us would try to use an image of a tool that a plumber uses, or use a certain image of existing plumbing, or fabricating the type to look like pipes?\n\nSo can it really be called plagiarism if two different designers come up with very similar solutions for a project that has a similar concept, or rather, potential for a similar solution? And if two projects are similar in their brief/requirements, will the solutions always be similar, or should we strive (as uniquely creative people) to come up with really distinct solutions? Or are some outcomes so predictable that there is no other choice?\n\n [‹ Loving the latest issue of Typo](http://web.archive.org/web/20081013235536/http:/typophile.com/node/47948 \"Go to previous forum topic\") [Style-linking bold, italic, b/i and regular weights of a purchased font ›](http://web.archive.org/web/20081013235536/http:/typophile.com/node/47865 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013235536/http://typophile.com/user/23247\" title=\"View user profile.\">Fantômas</a>",
  "time": "<br>",
  "uid": "23247",
  "comments": [
    {
      "time": " 21.Jul.2008 9.51am",
      "content": "Similarity of independedent outcomes = polygenesis.\n\nPlagiarism = not acknowledging known sources.\n\n\\*\\*\n\nWith simple execution, it’s more likely that polygenesis will occur, and be apparent.\n\nTherefore, simplicity is in danger of banality, and, ironically, vague distinction.\n\n\\*\\*\n\nIgnorance is not really an excuse for either polygenesis or plagiarism—for the true professional—who should know what’s “out there”.  \nSearching is more and more fruitful, with powerful recognition analysis tools such as MyFonts’ “What the font?”.\n\n"
    },
    {
      "time": " 21.Jul.2008 10.30am",
      "content": "more often than not I think polygenesis becomes plagiarism when a designer makes a choice to end their creative process before reaching a unique viewpoint.\n\nIt seems more rare that someone would blatantly plagiarize a work. Although, that negative conclusion is the first we usually come to when similarities are spotted.\n\nI once designed a logo that we failed trademark before putting into use and later found a competitor had adopted a very similar mark with an additional “t” in the name and an uglier typeface for a similar product. The date on their trademark was listed before our first use, so it would have been difficult to press plagiarism, but the process we went through to create the logo made it difficult for us to think it could have been polygenesis. I do my best to try and think they didn’t deliberately copy our mark and lie about the trademark date, but the thought gets the better of me sometimes.\n\n"
    },
    {
      "time": " 21.Jul.2008 10.33am",
      "content": "@Nick  \nLooks like an evening at Roycroft’s got you talking epigrammatically!\n\n"
    },
    {
      "time": " 21.Jul.2008 10.36am",
      "content": "I would think that search companies like Thompson & Thompson could be helpful.\n\n[http://compumark.thomson.com/jsp/index.jsp](http://web.archive.org/web/20081013235536/http:/compumark.thomson.com/jsp/index.jsp \"http://compumark.thomson.com/jsp/index.jsp\")\n\nChrisL\n\n"
    },
    {
      "time": " 21.Jul.2008 10.37am",
      "content": "I think it’s silly to assume ’unique’ is a prerequisite to good design. Plagiarism is bad, yes, but so it forcing uniqueness when it’s not needed.\n\nPlumber = pipe wrench = best solution for probably a majority of plumbers that need a simple icon to show up on the side of their van. It’s great to come up with that one unique solution, but sometimes it’s not needed, and is even a bad thing.\n\nIn terms of student work, the issue compounds itself when a professor tends to use the same project over and over again each semester. It can quickly saturate a market’s young portfolios with a lot of the sameness.\n\nThese days you post a logo online and within an hour you’ll have 10 people pointing out similar concepts. That’s not plagiarism. That’s just coincidence.\n\n"
    },
    {
      "time": " 21.Jul.2008 10.49am",
      "content": "it’s only plagiarism if a copier is aware of the copied.\n\nfor two designers to independently come up with similar solutions is definitely not plagiarism, nor is it all that unusual. it’s called a design trend. part of the zeitgeist.\n\n"
    },
    {
      "time": " 21.Jul.2008 10.52am",
      "content": "Nick, are you referring specifically to typeface design when you say “ignorance is not really an excuse” for polygenesis, or design in general? If there is a tool like “What the font?” that is designed to compare two designs from within a somewhat limited set (all typeface designs), I can somehow see your point.\n\nBut, as a graphic designer, do you expect that I - as a professional - know every logo, custom type design, identity program, etc. done WORLDWIDE, and from the past XX years, no less?\n\njarrod\n\n"
    },
    {
      "time": " 21.Jul.2008 10.53am",
      "content": "_...got you talking epigrammatically!_\n\nOne damn thing after another :-)\n\n"
    },
    {
      "time": " 21.Jul.2008 10.56am",
      "content": "Plagiarism is knowingly taking another person’s design and willfully copying it with or without minimal changes. Some solutions are heavily odds-on favorites to be done by coincidence. If two different paperclip companies end up with a logo that looks like a paperclip, I am not a bit surprised. It is a designer’s duty to at least suggest a search be done before a new logo is put into service. Branding or logo design is not just a matter of drawing skills and a quick idea-hatching session. Granted, this is done every day by bargain so-called design firms. If an idea comes too easily, chances are that someone else also thought of it. Branding is about finding what is unique about the client company and portraying it in a memorable way while maintaining brand separation from competitors. That is not to say that 3 car rental firms can’t all have a car-like image as a brand. Each one should have enough unique about it to identify the parent company easily, though.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Jul.2008 10.59am",
      "content": "“do you expect that I - as a professional - know every logo, custom type design, identity program, etc. done WORLDWIDE, and from the past XX years, no less?”\n\nThat is why there are search companies out there that for a few hundred dollars, can search out possible overlap.\n\n[http://compumark.thomson.com/jsp/index.jsp](http://web.archive.org/web/20081013235536/http:/compumark.thomson.com/jsp/index.jsp \"http://compumark.thomson.com/jsp/index.jsp\")\n\nChrisL\n\n"
    },
    {
      "time": " 21.Jul.2008 11.42am",
      "content": "so then would we say that this is ok? Is this a design trend or just laziness and ignorance.\n\n[http://usablebrands.de/files/blog\\_pdf/the\\_brand\\_gap.pdf](http://web.archive.org/web/20081013235536/http:/usablebrands.de/files/blog_pdf/the_brand_gap.pdf \"http://usablebrands.de/files/blog\\_pdf/the\\_brand\\_gap.pdf\")  \npage 133-4\n\nAlso, initially you can search for free  \n [http://tess2.uspto.gov/bin/gate.exe?f=tess&state=e6pi7j.1.1](http://web.archive.org/web/20081013235536/http:/tess2.uspto.gov/bin/gate.exe?f=tess&state=e6pi7j.1.1 \"http://tess2.uspto.gov/bin/gate.exe?f=tess&state=e6pi7j.1.1\")\n\n"
    },
    {
      "time": " 21.Jul.2008 12.13pm",
      "content": "“so then would we say that this is ok?”\n\nNo, it is not ok, it is also not criminal. It is just not what a professional should do. A professional should know their client’s company, their products and services, and their position in the market. They also should know their competitions position and image. The idea is to position your clients brand to be, distinctive, desirable, and easy to work with. This means doing due-dilligence in seeing what they are up against and steering them away from potential law suits due to your work with them.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Jul.2008 3.08pm",
      "content": " ![](http://web.archive.org/web/20081013235536im_/http:/typophile.com/files/Slogos_3651.jpg)\n  \nI’ve designed a logo for Shinntype, and put it on an email newsletter.  \nA customer in the Czech Republic noticed a resemblance to the Czech lottery corporation logo, designed long ago.  \nI’ve never been there.  \nMore likely a subconscious deli influence! (I do buy their salami.)\n"
    },
    {
      "time": " 21.Jul.2008 4.18pm",
      "content": "Might help to look at some older symbols (like the swastika) that emerge from different cultures and consider that some patterns may even evolve from a physiological model, etc.\n\n"
    },
    {
      "time": " 21.Jul.2008 4.27pm",
      "content": "Gosh, Nick, I was just planning to go to your site and buy some Czech lottery tickets! Do they come with sausage or is that a different purchase? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 21.Jul.2008 5.01pm",
      "content": "The question was,\n\n\\>... is it plagiarism (w/ or w/o intent) ... when two designers on different sides of globe are given an similar project (i.e., an identity for a plumbing company), and they just happen to come up with identical solutions......then what do we consider the outcome?\\<\n\nthe answer is, in 9 cases out of 10, the ’identity’ will be a new font identical to Frutiger.\n\nSo yes, it’s plagiarism, yet not of each other but of Frutiger.\n\nOK, it’s plagiarism. The next question is, is it intentional or unintentional?\n\nThere are two answers. Every designer who has ever copped Frutiger tells you they came up with nearly the identical design by chance. The other answer . . . . .\n\nSo what’s interesting is the extent to which Helvetica is the only vernacular sans recognized by most business people who still, forty or so years later, find something wonderfully forward and original in Frutiger.\n\nSo then the question becomes, why, if you need an entirely ’fresh’ look for goons, is Frutiger still the only safe way to deliver it?\n\nAnd let’s just remember that ’goons’ isn’t just businessmen with zero design & technology experience. Both Adobe and Microsoft have fallen into this popular trap.\n\nThe peculiar thing is how terribly limited the trusted typographic vernacular is.\n\n"
    },
    {
      "time": " 21.Jul.2008 5.26pm",
      "content": "Bill.  \nI think the larger the organization, the more likely they are to go with safer—supposedly tried-and-true—solutions. in other words Frutiger (or Myriad) :-)  \nAlso, large organizations don’t need as much separation as smaller ones. They are more known just by nature of multiple exposure and volume marketing. Also, design-by-committee or corporate signoff lists take a bigger toll on large organizations. The least objected to solution wins.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Jul.2008 7.18am",
      "content": "_Every designer who has ever copped Frutiger tells you they came up with nearly the identical design by chance._\n\nI agree with Bill.\n\nI don’t believe it’s possible for even very good type designers to accurately recreate well known designs—_without visual reference to the original._ Ergo, similarities that occur are not the coincidences of polygenesis, but the result of careful comparison, with decisions being made as to just how far to diverge from the original to legitimize the similarity.\n\nI challenge other type designers to make a Frutiger “a” from memory, right now, and post the results.  \nI just did it (but won’t show yet).\n\n"
    },
    {
      "time": " 22.Jul.2008 8.01am",
      "content": "\\>I don’t believe it’s possible for even very good type designers to accurately recreate well known designs—without visual reference to the original.\n\nSign-painters (John Downer for example) do this all the time - John did a live demo of this at TypeCon Seattle recreating Helvetica without reference to the original.\n\nCheers, Si\n\n"
    },
    {
      "time": " 22.Jul.2008 1.29pm",
      "content": "I think Nick and Si are both right. We all have an idea of the Frutiger a, but to recreate a facsimile as faithful as . . . name your clone . . . . I wouldn’t want to try it out of the air. On the other hand, it’s Downer’s profession to be able to do this. He might be able to do it with Helvetica, after a lot of practice, but not with for example Syntax — or with Fontesque to take it to an extreme. In any case: he’s trained to be able to replicate these faces fairly accurately - - the rest of us aren’t — perhaps not even our own. Jeff Level used to get quite a charge out of repeating an encounter with Zapf during which Zapf proved — it was considered an exceptional feat — that he could draw Palatino accurately, from memory, at 12 points. He prefaced this with the immortal remark, ’I vill now draw for you ze Palatino!’\n\nI do think that a lot of us could draw from scratch a nice Frutiger-ish a, and use it as the basis for a nice new sans serif. But the people whose Frutiger clones are nearly indistinguishable from Frutiger have, I think obviously, gone a lot further than that.\n\n"
    },
    {
      "time": " 22.Jul.2008 2.31pm",
      "content": "I’m sure if I practised drawing Frutiger, working from reference, I’d be able to do a pretty good facsimile, as per JD and Helvetica.\n\nBut it’s simply not possible to draw a typeface accurately solely from memory, without “learning the piece”, developing muscle-memory through study and trial-and-error practice.\n\nMy challenge stands: draw a Frutiger “a” from memory, without reference.  \nI’ll show you what I came up with, once we’ve had a chance to work on it.\n\n"
    },
    {
      "time": " 22.Jul.2008 4.15pm",
      "content": "Not being experienced in using FontLab’s drawing tools, my first effort was far too embarrassing to disclose — but even if I was using Fontographer, which I’m much more comfortable with, my effort would be pathetic. I could do it more easily on paper. Anyone else?\n\n"
    },
    {
      "time": " 22.Jul.2008 9.21pm",
      "content": "\\>Searching is more and more fruitful, with powerful recognition analysis tools such as MyFonts’ “What the font?”\n\nOh, another possible tip - post an image of the suspect font to the Typophile ID forum - and see what the typorati come back with.\n\n"
    },
    {
      "time": " 23.Jul.2008 1.28pm",
      "content": " ![](http://web.archive.org/web/20081013235536im_/http:/typophile.com/files/Frutiger_4545.png)\n  \nHere’s my effort, compared to the real thing.  \nI remembered it was quite round, but still my tendency was to draw with more angle.  \nI recalled the slight flare at the bottom right, but over-exaggerated it.  \nI forgot that the terminal at top left is vertical.  \nI got the proportions and weight fairly close though.\n"
    },
    {
      "time": " 23.Jul.2008 4.49pm",
      "content": "Excellent work, Nick. Your version is more beautiful. However, Frutiger’s version is more functional for two reasons: larger bowl, and less leftward slant of the stem — and those extraordinary things he does with thick and thin that are so difficult to understand yet have a reason. Nevertheless, fabulous. I know how difficult this is to do — I tried it!\n\nEarlier in this thread, I talked about the way a Frutiger clone can always be sold as something new . . . . Nick’s version helps me to understand why. There is something about Nick’s version that is satisfying and comforting: it is within a vernacular that we all understand. In Frutiger’s version there is something restless, jarring, unexpected. It really does — perhaps it always will — look new. It’s because of the conflict Frutiger initiates with our most primitive visual expectations. I feel as if I’m finally beginning to understand something of what Frutiger is about. Incredible! Bravo!\n\n"
    },
    {
      "time": " 23.Jul.2008 7.11pm",
      "content": "bill - i think you and others on this list are conflating font design with font usage.  \nif i use unmodified Frutiger in a logo, it might be lazy and unoriginal, but it’s not plagiarism. if i “design” a font for sale which is un-or-slightly modified Frutiger, then it’s plagiarism. by the dictionary: plagiarism occurs with intent to deceive, to pass someone else’s work as one’s own. Fonts are provided for my use as a designer, and i can choose to be more or less creative with them. i can even imagine a logo in which Frutiger works.\n\nplain and simple: plagiarism is intentional and deceptive.\n\nlaziness, trends, zeitgeist, and coincidence are not plagiarism.\n\nand i’d go farther to say that throwing that word around irresponsibly doesn’t do anyone any good.\n\nthis cuts to the heart of my complaint about certain details in the way font EULAs are going, into which this conflation of design and usage seems to creep. there’s got to be a level jump between TOOL DESIGN and USE OF LICENSED TOOLS.\n\ni agree to buy (license) fonts fully legally and i won’t pass them around, even to printers, but i’m damned if font designers are going to start telling me what i can and can’t use the fonts for. i simply won’t use those fonts at all. perhaps they prefer it that way ?\n\nfrom my perspective as the middle-user, it’s like any tool or pigment or paper maker telling me what i’m not allowed to make with their product, except for a heftier fee. WTF? - granted the work that goes into a beautiful and functional font is creative and highly specialized and even pure artistry, but it is after all a beautiful and functional tool to be used at another level of consideration, beyond the font maker.\n\nsorry if this designation of “font as tool” steps on any egos. i have extreme awe and admiration for great font design, but let me be the graphic designer, please, unfettered by usage restrictions.\n\n"
    },
    {
      "time": " 24.Jul.2008 4.40am",
      "content": "Chris, I am very sorry if I gave the idea that I don’t believe in free use. I do believe in it most strongly. I am TOTALLY AGAINST some of these preposterous new restrictions on fonts. Desirable they may be from the point of view of the designer who is dreadfully underpaid by and large. VERY FEW OF US can make a decent living at it. And this IS the fault of a system. 30 years ago, you had to pay for every line of type you used from ITC. You couldn’t afford that, today, as a designer.\n\nNEVERTHELESS, when I buy or am given a font (since most of my vast font collection — which I hardly ever use — has been given to me by manufacturers) I treat it as any other consumer would treat a product. I can use it for whatever I please, in any way I please. DON’T TELL ME I CAN’T PDF YOUR FONT!@!!!!\n\nAs I have said twice in other recent threads, there is a simple cure to this problem: use ten-year-old fonts that don’t have this new license garbage. You can get the whole Bitstream/ITC library for $5 by buying an old copy of CorelDraw 5/6/7, whatever. Mac, PC, TT, PS. You can get the whole URW library, also for nothing, by buying a copy of [forgot the names of the software that bundles/d it]. These ancient licenses have in effect NO RESTRICTIONS, and the quality of the fonts is superb. Believe me, nobody who bought the Bitstream/ITC library via Corel has ANYTHING to fear, though Thomas Phinney of Adobe has made a small effort to spread FUD on this subject. There is no colorable legal theory by which someone with a license to these libraries, acquired via CorelDraw, cannot use these fonts for any reasonable purpose - - same is true to a lesser but substantial extent for all fonts sold a few years ago, but there, at least, there is a EULA. Where’s the EULA with CorelDraw? Was anybody ever sued for using a Corel-derived font for any reason whatever?\n\nLikewise, when was the last time someone was actually sued for pdfing a font or using it to draw a logo?\n\nPDF licensing was a brilliant ploy by Monotype to extract additional money from Adobe - - and the truth is, without Adobe, Monotype would not HAVE any high quality fonts. You only have to look at some of the PATHETIC data in the Monotype Classic Library that was NOT released by Adobe to see what kind of crap Monotype was releasing. Anyway, Adobe’s legal people (who are neither competent nor nice, a bad combo) fell for it, just as they did the outrageous arguments of Mrs Hunt when she wrested the Berthold library from Adobe, after Adobe had paid substantially for it and put an enormous amount of work into it (for example, all the f-ligatures - - though that work was sub-Adobe-standard, sadly).\n\nNow other companies have joined in, hoping, in the end, for a payoff from Adobe. Of course it will never happen. PDF technology is VASTLY more important than any single font. PDF is here to say. Some lovely font with a no-PDF license is not here to stay. All pdf-licensing is doing now is making customers LOATHE the foundries who do it.\n\nWe font providers need to know when to let go. We need to hear from font users. And most of us need to accept that we are in it for love, not money.\n\nLet me let you in on another secret, Chris. We font designers only post on blogs when we are suffering our chronic existential despair: we aren’t working on a font because we aren’t getting enough money to motivate us to get on with work. You’ll never see Robert Slimbach posting anywhere. He’s got too much work to do.\n\nSorry for the rant and the ugly caps, and tone but ... there is no way we can return to the past. There cannot be usage restrictions. And nobody can POSSIBLY ask ANY graphic designer to read, much less to understand, a EULA.\n\n"
    },
    {
      "time": " 24.Jul.2008 4.51am",
      "content": "Let me just add that in spite of all the LIES about how nobody could use MM in the future, all you have to do in Vista is disable UAC (which you don’t want anyway) and install ATM 4.1. Voila! You now have all the marvellous multiple master fonts available to you in every single application on Vista. They said it couldn’t be done, just like they pretended that only OT fonts would work on Vista. But the way it turned out, there is a subsystem in Vista which doesn’t use old fonts. But nobody has written a single app for it. Any they never will! This illustrates how the industry has used blogs and the internet to spread FUD - - I won’t name names just this once, but you know who you are!\n\nAs a font designer it hurts me that people don’t have to pay per line of usage. But as a user . . . . I’m on the side of the real world.\n\nI was just about to install OS X over Vista on my fabulous new  \nDell . . . . but now that I have ATM working on Vista, I’ve changed my mind.\n\nAdobe, you need to get ATM working on OS X . . . . and stand up to Microsoft as regards its pathetic implementation of OT in the Office Suite and its aversion to MM which we are all using every day thanks to Fontlab.\n\n"
    },
    {
      "time": " 24.Jul.2008 4.51am",
      "content": "Let me just add that in spite of all the LIES about how nobody could use MM in the future, all you have to do in Vista is disable UAC (which you don’t want anyway) and install ATM 4.1. Voila! You now have all the marvellous multiple master fonts available to you in every single application on Vista. They said it couldn’t be done, just like they pretended that only OT fonts would work on Vista. But the way it turned out, there is a subsystem in Vista which doesn’t use old fonts. But nobody has written a single app for it. Any they never will! This illustrates how the industry has used blogs and the internet to spread FUD - - I won’t name names just this once, but you know who you are!\n\nAs a font designer it hurts me that people don’t have to pay per line of usage. But as a user . . . . I’m on the side of the real world.\n\nI was just about to install OS X over Vista on my fabulous new  \nDell . . . . but now that I have ATM working on Vista, I’ve changed my mind.\n\nAdobe, you need to get ATM working on OS X . . . . and stand up to Microsoft as regards its pathetic implementation of OT in the Office Suite and its aversion to MM which we are all using every day thanks to Fontlab.\n\n"
    },
    {
      "time": " 24.Jul.2008 6.03am",
      "content": "\\>... MM which we are all using every day thanks to Fontlab.\n\ni.e., MMs which we font designers are using every day thanks to Fontlab, but which our customers can only effectively use on Windows (ALL versions, in EVERY app) . . . . . how can it happen that the Mac is behind the curveball in this regard?\n\n"
    },
    {
      "time": " 24.Jul.2008 7.22am",
      "content": "_We font designers only post on blogs when we are suffering our chronic existential despair:_\n\nSpeak for yourself, Bill.\n\n"
    },
    {
      "time": " 24.Jul.2008 7.45am",
      "content": "\\>They said it couldn’t be done,\n\nI don’t think so. I passed a MM work-around to Tom six months ago for his blog. He found an easier work-around with the UAC thing - good for him.\n\n\\>just like they pretended that only OT fonts would work on Vista.\n\nAlso I don’t think anyone said PS Type 1 wouldn’t work on Vista - the GDI font system is unchanged from Windows XP.\n\nThat’s not true for WPF (Windows Presentation Foundation) which supports OpenType only (TTF and OTF) - but no actual Windows components use it.\n\n"
    },
    {
      "time": " 24.Jul.2008 8.36am",
      "content": "\\>Speak for yourself, Bill.\n\nGet back to work, Nick!\n\n\\>I don’t think so.\n\nSi, I was NOT accusing you of being one of the annoying FUD crew re non-PS in WPF. But lots of people were saying that everything Vista would be WPF - - instead of which, nothing Vista is WPF. Who were they? Well, it wasn’t just a certain well-known source at Adobe, but I’m not going to troll through old blogs to see who it was. The fact is, everyone believed it for awhile. Then — not all of a sudden, but slowly, slowly, slowly — we’ve all come to realize that fonts in Vista are exactly like fonts in XP - - and down on back to Win95 and - - is it possible? Windows 3.1? (+ATM?)\n\nAlthough Vista is disappointing - - who needs an un-sexy, un-beautiful shell for XP without a single good idea? it’s a perfectly good OS and I am (and I know many millions of other users are) tremendously grateful to MS for its commitment to backwards compatibility extending to apps OVER TWENTY YEARS OLD. This is the way it should be. There is no excuse for it not to be this way.\n\nNow that Apple has finally settled on Intel processors - - one might guess, for good — we can hope that Apple may be able to give customers some of this benefit more easily. Too bad Dave Opstad isn’t at Apple anymore - - why doesn’t MS hire him?\n\nAnd why did he leave? Now there’s someone whose story I would really like to know.\n\n"
    },
    {
      "time": " 24.Jul.2008 8.50am",
      "content": "Bill, please calm down and get a grip on your self. You’re grandstanding and contributing an uncivil rant. A moderator will be in contact with you offline to counsel you about this.\n\nFor the time being, please turn Typophile off. Log out and take a break. Go do something else for a while. Wait for email contact from the moderator and get yourself sorted before returning to this discussion.\n\nYou are out of order sir.\n\nThankyou.\n\nj a m e s\n\n"
    },
    {
      "time": " 24.Jul.2008 8.54am",
      "content": "Oh, and everybody else on this thread, please stop the incivility by not retaliating or attempting to supress or otherwise respond to Bill’s uncivil remarks.\n\nJust go on with the discussion sans Bill. Pretend he’s not here and didn’t say those things the way he said them.\n\nThankyou. Please continue with typographic discussion.\n\nj a m e s\n\n"
    },
    {
      "time": " 24.Jul.2008 9.09am",
      "content": "_Get back to work, Nick!_\n\nTypophile is work, in many ways, some of which are quite playful.\n\n"
    },
    {
      "time": " 24.Jul.2008 10.49am",
      "content": "\\>... quite playful\n\nJames doesn’t think so.\n\n"
    },
    {
      "time": " 24.Jul.2008 12.15pm",
      "content": "Bill is right, WPF was mentioned/used by Adobe to support the retirement of Type 1. WPF is still cool (the New York Times News Reader is built on it) but dependencies around it were cut from Vista some time before it shipped (as you’d expect it wasn’t a last minute cut).\n\nI don’t know Dave well, but I think it’s accurate to say that Monotype recruited him out of retirement with the promise that he’d be able to work on interesting tools and research projects. Dave spoke on some of these at the ATypI Helsinki tech forum a few years back. Unless I’m mistaken he’s still there and very active in that space.\n\nDave Opsted is still at Monotype\n\n"
    },
    {
      "time": " 24.Jul.2008 3.15pm",
      "content": "wow this is interesting, and mostly a foreign language to me.\n\nnot only do i not know what MM or FUD or WPF mean, i have no idea what james is accusing bill of. none of it seemed particularly harsh to me, just some chronic gripes that everyone seems to have in one form or another, alone or in groups. gripes are okay. i gripe occasionally too. trollish flaming is a whole other level of abuse.\n\nmeanwhile... please translate for us pedestrians on the thread. i’m on a mac, btw. :)\n\n"
    },
    {
      "time": " 24.Jul.2008 3.34pm",
      "content": "MM = Multiple Master  \nFUD = Fear, Uncertainty, and Doubt  \nWPF = Windows Presentation Foundation\n\n...sorry, can’t help with the other bits.\n\n"
    },
    {
      "time": " 24.Jul.2008 3.35pm",
      "content": "FUD is [Fear/Uncertainty/Doubt](http://web.archive.org/web/20081013235536/http:/en.wikipedia.org/wiki/Fear,_uncertainty_and_doubt).  \nMM is [Multiple Master fonts](http://web.archive.org/web/20081013235536/http:/en.wikipedia.org/wiki/Multiple_master_fonts).  \nI think WPF is [Windows Presentation Foundation](http://web.archive.org/web/20081013235536/http:/en.wikipedia.org/wiki/Windows_Presentation_Foundation).\n\n"
    },
    {
      "time": " 24.Jul.2008 3.48pm",
      "content": "with links! nice :-)\n\n"
    },
    {
      "time": " 24.Jul.2008 4.05pm",
      "content": "I’m proud to take that extra minute to insure quality. :-)\n\n"
    },
    {
      "time": " 24.Jul.2008 4.11pm",
      "content": "As I mentioned to professor S last Friday, quality is job 3.0 :-)\n\n"
    },
    {
      "time": " 24.Jul.2008 5.07pm",
      "content": "aviso: remarks certain to be removed by moderator:\n\nSi, thanks for kind remarks straightening everything out.\n\n\\>i have no idea what james is accusing bill of\n\nChris, I don’t want to read too much into this, but here’s a possible scenario.\n\nI made some perfectly true statements about Adobe which Adobe may have protested about to the moderators. The moderators then wrote something panicky on this thread. There’s only so far they can go in alienating a company as big as Adobe. Then someone from Microsoft, an even bigger software company, came on board to confirm what I’d said. The moderators then wrung their hands, had a good laugh, and backed off.\n\nWho knows? Who cares?\n\nThe background is that Adobe spent nearly a decade in the 1990s making multiple master fonts, the most advanced technology available to users so far. An MM is a variable font. You can for example have any width, any weight, any optical size. Adobe decided to abandon MMs during the late 90s when they failed to convince Microsoft that MM was worth keeping in the OT (OpenType) spec that they were co-developing. I have always blamed this on MS’s dumbness, and I now regret to say I think I had it mostly wrong or at least partly wrong. Adobe was never any good at promoting MMs (and not as good at designing them as they should have been) - - and I think they just didn’t put their case to Microsoft intelligently enough. The MS font people are not idiots. If there was something they didn’t get, it was up to Adobe to put it to them convincingly. Adobe failed in this. Significantly, the Adobe executive, Dan Mills, who was responsible for caving, was soon thereafter let go.\n\nMicrosoft had argued that its app group couldn’t support MM fully because it wasn’t anywhere up to speed on supporting non-MM OT — and still isn’t — the reason being that they have to work so hard to keep speed while adding new features (think of the overhead of Word’s fabulous new undo). However, this is not so simple as it seems. MM fonts were — and are — automatically supported in all Windows apps via ATM (built in or not). When MS was talking about the ability of its app group to support MMs, they meant \\_special\\_ support. For example, an early release of Word in the mid-90s on the PC automatically supported MMs with optical size masters. It would automatically select the right optical size depending on what font size you had selected. This is a beautiful trick and it was \\_fantastic\\_ that MS was doing this so early on. But no other app I know of — Mac or PC — ever did that, unless it was one of the early releases of InDesign? And that was much later. Anyway, that is the \\_kind\\_ of support MS wanted to build in — it would have been glorious had they felt able to do it then. But the MS app people have so many exceptional pressures on them that font complications are the first to go.\n\nAdobe made another series of missteps. It transitioned its entire library to OT without giving customers any idea of any value they were gaining by rebuying their libraries. It allowed the MacOS not to support MMs by failing to produce ATM (or ATM Deluxe) for OS X. It is a cardinal sin for a company like Adobe to produce a font that can’t be used anymore. However, it partly made up for this by building in MM (ATM) capability into all its own apps. But this was all ’secret’ for some reason, so users only found out about it on blogs. And notice that Microsoft would never allow such a thing to happen to its customers. There is nearly always a solution for a Microsoft customer who wants to run a legacy app from the year 0.\n\nIt will all come out clean in the end. OS’s are quickly running out of new features that are visibly useful to customers. MM/Variations technology will come into its own at some point in the next few years again — better and stronger for all the painful water under the bridge.\n\nIn the meantime, MM expertise is kept alive by being so well supported in FontLab. Nearly every font designer uses FontLab’s MM capabilities — even though they generally don’t then sell MM fonts since Apple no longer comfortably supports MMs. Even Adobe is quite upfront about still using MM in the development of nearly all its new fonts.\n\nThe funniest online kerfuffle of all regarding font technology came when someone (maybe me?) noted on the OpenType list, around 2000, that ATM for Mac had finally ditched support for Apple’s neglected and mostly discontinued GX font technology (which offered the best support of any platform for MMs but which was ... too good, too soon — and it needed 4MB extra memory at just the point when 32MB was standard on high-end Macs). Harold Grey from Adobe wrote in saying, well guys, no need to act surprised about this - - we discussed this with everyone at Apple before we did it.\n\nThen Dave Opstad at Apple wrote a blistering note to Grey, not intended for the list, but accidentally sent to the list, which flat out contradicted Grey, saying the matter was never discussed with Apple. In other words, you’re ... not telling the truth.\n\nWe were all holding our breath - - things like this just don’t happen that often online between industry titans.\n\nDavid Berlow then quipped,\n\n’I hate it when Mommy and Daddy quarrel.’\n\nand we all went back to our business.\n\nExcept that Adobe got so mad about my relentless commitment to MM technology and my incurable lack of interest in self-censorship that they had me booted off the OT list. Best thing that ever happened to me, not having to read it, as a lot of it was over my head.\n\n"
    },
    {
      "time": " 24.Jul.2008 9.11pm",
      "content": "WOW! What an unexpected turn of a thread. Interesting reading, what I could grasp.\n\nTo take another step off course, maybe some of you guys can throw some light on these ridiculous new EULAs. I have read the H&FJ FAQ pertaining to PDF for internal vs. external use and feel there should be no issue with sending a PDF to print with embedded fonts.\n\nI did also raise the question (slightly off topic) on another thread which was unanswered, asking what we did in the not so distant past when we had no PDF as a print standard. We bundled font files with Quark documents to get printed, right?\n\nI also reckon that quite a few designers have print issues with PDFs so send native files in InDesign (with fonts) to a printer to bypass these problems.\n\n"
    },
    {
      "time": " 24.Jul.2008 9.55pm",
      "content": "\\>We bundled font files with Quark documents to get printed, right?\n\nYep, so called “collect for output”\n\n\\>I also reckon that quite a few designers have print issues with PDFs so send native files in InDesign (with fonts) to a printer to bypass these problems.\n\nMaybe, but probably more risky than PDF. Adobe has ironed out most of the issues over the years.\n\n"
    },
    {
      "time": " 25.Jul.2008 2.16am",
      "content": "<cite>I also reckon that quite a few designers have print issues with PDFs so send native files in InDesign (with fonts) to a printer to bypass these problems.</cite>\n\nSo in the situation where a printer is doing the traditional prepress work and inserting live images from 4x5s based on a designer’s guides as to scale and FPO images, isn’t it better to work from the native files?\n\n"
    },
    {
      "time": " 25.Jul.2008 5.11am",
      "content": "\\>isn’t it better to work from the native files?\n\nI guess the problem is economics.\n\nBack in the late 80s, early 90s, there were no independent foundries and everyone made their money - - pathetic by the standards of the early 80s and the pre-Type 1 closed systems — by selling them Type 1 libraries. At this time, foundries could, and did, insist that printers buy the fonts they were using.\n\nIt’s a different story now. There are more than 100,000 fonts. You can’t ask a printer to own them all. By the mid-90s, nobody was insisting that printers own fonts. One reason was that you couldn’t even sell them imagesetters anymore. Everyone who wanted an imagesetter already had one.\n\nPrint publishing has become vastly more expensive. Editorial staff has been trimmed to the bare bones. There isn’t money for graphic design and photography. Books and magazines are produced on shoestring budgets that were unimaginable 15-20 years ago. Editorial quality is out the window, writers are crap, and there’s no money for anything except a few hard-working do-it-alls to survive. But magazines continue to be published, albeit they are produced for 5% of the cost — remarkable as this may seem — that they were produced in the 1980s.\n\nIn this new reality, font income is crushed. Nervous font-makers try to find more and more ways of making money, instead of accepting the fact that for most — if they want to stay in type — they have to have a separate source of income.\n\nAdobe foresaw this from the start. It was crushingly self-evident that once a few thousand printers and designers owned their basic library, there would be no \\_major\\_ income to be had from fonts. That had already happened by the very early 1990s. And that’s how Adobe graduated from becoming a type company to becoming the owner of Photoshop and Illustrator. On a small scale, that’s what people in type have to do today. You simply have to diversify unless you’re one of the very lucky few who can make a consistently good living doing type.\n\nI’m not going to name names and betray embarrassing secrets but of the top five type designers now living, none of them is getting well-paid for their work, and it hurts.\n\nWhy is it necessary to say this? Because this is the first time in history that there are thousands of font designers on the planet, rather than half a dozen. This is the first time that font designers are getting PhD’s — which will earn you about as much as a PhD in Eng Lit - - little.\n\nYet in spite of all this, I simply don’t see what is to be gained by more restrictive licensing. Font designers should be worrying about making great type, not about legal and marketing issues.\n\nIn the end, we all have to remember: we are making products that we hope customers will buy. To do that we have to make the customer happy. Very happy. Otherwise we don’t have a hope. Every tiny little thing we do to make the customer nervous or unhappy or that wastes the customer’s time - - is a whole series of missed sales opportunities. Happy customers will buy more of your product, and will encourage others to buy more of them. We can’t treat customers like enemies. We have to court them.\n\nWe also all have to be much more inventive about how we survive. In Lisette Model’s photography Master Classes at the New School, someone would always ask, ’what’s the most important thing you need to be a great photographer.’\n\nLisette would always answer: ’a rich spouse.’\n\nAnd for once she wouldn’t be joking.\n\nBut to get back to the point, this is the way I think it should work:\n\nThe designer buys the font, and the designer keeps the font. The client doesn’t get it unless the client pays for it.\n\nThe printer can get the font, but only in the circumstance that the printer doesn’t accept pdf or .ps workflow.\n\nThe font can be limitlessly embedded in pdfs. No point in talking about subsetting because subsetting doesn’t always work.\n\nThe graphic designer has bought the font and can use it for any purpose. (Why? If you start making limitations, or defining ’normal purpose’ you will never come to the end of it. And you will long since have lost the GD’s attention. Do you think the GD has time or inclination to think about these things?)\n\nYou ask the customer not to copy the font for others. And maybe you explain in one sentence why it’s important to ask this. These two sentences are the only ones you really worry about, no? - - and they have to be in big print.\n\nYour customer has limited attention, limited concern. He or she wants to install the font and get on with the work. You have an \\_incredibly\\_ limited opportunity to catch the customer’s attention. Make the most of it.\n\nAbove all, don’t ask the customer to read the EULA. The only way you are ever going to make serious money is in the exceptional circumstance where somebody wants to license your font for thousands of users. There is where you can and should have a restrictive license and take it seriously. You have to distinguish between small sales and very large corporate sales. They need very different approaches. But you’re unlikely to get to the point where someone knows enough about your font to want it for 10,000 seats until you have made a lot of small sales.\n\nThat’s about it, isn’t it?\n\nMany apols for length of rant. People who really know how to communicate - - like Kathleen Tinkel - - are always telling me that in a post, you only have one point to make, and you should make it short. Otherwise nobody will want to read it. I guess the same advice applies to EULAs.\n\n"
    },
    {
      "time": " 25.Jul.2008 6.57am",
      "content": "_Font designers should be worrying about making great type, not about legal and marketing issues._\n\nBill, look at how long it took Myfonts to sell its first million fonts, and then two, three, and four million...  \nThere is a growing market for fonts.  \nIf the “top five” type designers are not doing well, their business model is at fault.  \nThis is a golden age for type design, but type designers cannot afford to only concern themselves with designing type, they have to be entrepreneurial.  \nAnd they are. The situation is dynamic, foundries are experimenting with different kinds of EULAs as new licensing scenarios emerge, and as their markets develop. Licensing issues are more likely to be a spur than a detriment to the font industry, prompting innovation—and this will become more apparent at the retail interface.\n\nOne cannot say that type designers should only concern themselves with designing type (as if they ever have), and then say that they should be savvy enough about marketing to adopt differential licensing strategies for different markets.\n\n"
    },
    {
      "time": " 25.Jul.2008 7.42am",
      "content": "Since there are so many indi type designers afoot these days who are most one or person shops, they cannot “just pay attention to designing type.” They have to do the marketing and market appraisal as well. The sticky-wicket business issues are always there now. The market of graphic designers has changed as well. They are all freelancers bidding for crumbs. The old model of the big design office with dozens of salleried grafikers in tow is gone. In those days, the studio bought the type and the designers just pushed rapidographs around. Big ad agencies are even shells of their former selves. Business models have changed and so has the industry. So must we to stay afloat. Burying your head in the sand and just “designing type” is a pipedream, up in smoke with the 20th century.\n\nChrisL\n\n"
    },
    {
      "time": " 25.Jul.2008 7.49am",
      "content": "\\>Many apols for length of rant. People who really know how to communicate - - like Kathleen Tinkel - - are always telling me that in a post, you only have one point to make, and you should make it short. Otherwise nobody will want to read it. I guess the same advice applies to EULAs.\\<\n\nHaha, true. I only read the first and last paragraph of your post. I was looking for an introduction or a summary or something.\n\n"
    },
    {
      "time": " 25.Jul.2008 10.25am",
      "content": "\\>If the “top five” type designers are not doing well, their business model is at fault.\n\nBut Nick, part of the reason that’s so is that — to take one example — newbies have pushed the price of custom newspaper type down to as low as 3K/weight — and you don’t get a quality newspaper typeface for that kind of money. At the same time, graphic artists and art directors know very little about type quality compared to their predecessors a generation ago. So the level of acceptable quality has plummeted.\n\nA lot of your other points are really good, and so are Chris’s. But when Chris says ’They have to do the marketing and market appraisal as well’, I really wonder. Good marketing skills and good design skills are not often possessed by the same person. And someone who’s great at marketing this year may be lousy at it five years from now. Just look at how the great adman Jerry della Femina’s career tanked. He’s still the same guy. He just doesn’t know to how to communicate to the public today. But in his prime - - - wow!\n\nWell, I’ve made my point but I must admit I am considerably persuaded by what you two have said.\n\nJessi, that is so funny - - the best parts of my posts are usually in the middle. I really should do a better job.\n\n"
    },
    {
      "time": " 25.Jul.2008 10.37am",
      "content": "<cite>At the same time, graphic artists and art directors know very little about type quality compared to their predecessors a generation ago. So the level of acceptable quality has plummeted.</cite>\n\nAnd don’t forget the client. There has to be a demand for good work from the top down. On a larger scale, I think we are experiencing a decline in respect for knowledge and expertise. Even very sophisticated people tend to assume now that anyone can be hired to do any job. I suspect, particularly in the states, this has to do with the slow death of manufacturing and the rise in service industry where training for any job is a multi-week affair.\n\nWhat drags me down is I often get the sense I could do a good job or a poor job and the client would never know the difference. All you need is a degree in compliance.\n\n"
    },
    {
      "time": " 25.Jul.2008 11.43am",
      "content": "\\>All you need is a degree in compliance.\n\nTruer words were never spake.\n\nBut Mark - - you’re a designer who also does editorial?\n\nThat’s unheard of in this day and age! Bravo!\n\n"
    },
    {
      "time": " 25.Jul.2008 12.05pm",
      "content": "In the interest of full disclosure I pull Pam in on select projects, but I did spend my first seven years as a copywriter. Now there is a profession where everyone believes they can do your job.\n\nIf I were to spin a sentence or two, or do some selective whacking in an essay here or there it would definitely be on the down low.\n\n"
    },
    {
      "time": " 25.Jul.2008 1.46pm",
      "content": "bill, I read that last one.\n\nI think designers should know a lot about type, guess that’s why I keep hanging around here. They should know what happens to a job between handing over the pdf and getting the printed piece. They should know something about marketing and branding or at least the overall picture of where their work plays a role in that. And really shouldn’t be too bad at copy or at least have the tools handy to double check things. In my job that’s an AP stylebook and the writer in the next cube. I geuss if you worked in a big ol firm where your role was super defined, you may not need all that, but truth is, don’t most work in interprofessional environments? If you’re shooting for excellence, you better know that everyone else is doing their job too. And no, I can’t and don’t want to do everyone else’s job, I just want to know why it’s there.\n\n"
    },
    {
      "time": " 25.Jul.2008 8.55pm",
      "content": "Just for clarity - James is not a moderator Bill. He speak for himself- just like you.\n\n"
    },
    {
      "time": " 26.Jul.2008 5.06am",
      "content": "Thanks for pointing that out, Eben - - bang goes my conspiracy theory! But isn’t that usually the way with conspiracy theories?\n\nJessi, it’s wonderful to be in an environment where you always have a trusty writer, or whatever, a cubicle or two away. Personally, I love collaboration and I particularly love consulting experts. But very few type designers work in such places and I would imagine that most graphic designers are pretty isolated - - I’m just guessing on the latter - - it would be interesting to know for sure. WHAT WOULDN’T I GIVE to have someone sitting nearby to whom I could say, ’what’s the matter with the spacing of this letter?’\n\nI was hoping that when Poetry Magazine got its $90 million windfall, it would spend some of it on fine type and fine print, and of course the promotion of poetry. I hear it’s all being mismanaged and nobody is getting the benefit except the administrators. Peccato!\n\n"
    },
    {
      "time": " 26.Jul.2008 9.19am",
      "content": "I have read the whole list. [Are these copyrighted ?](http://web.archive.org/web/20081013235536/http:/www.photoblog.com/storage001/2008/07/26/)\n\n"
    },
    {
      "time": " 26.Jul.2008 9.39am",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": " 26.Jul.2008 9.40am",
      "content": "^ those are mine so stay away.\n\n"
    },
    {
      "time": " 26.Jul.2008 11.34am",
      "content": "Bill,\n\nReading your comments here reminds me of the phone conversations we used to have.\n\nWhere are you now? Give a call when you get a chance.\n\nJames\n\n"
    },
    {
      "time": " 27.Jul.2008 7.12am",
      "content": "Mañana, James!\n\n"
    },
    {
      "time": " 28.Jul.2008 9.40am",
      "content": "I ran across this post about polygenistic (is that a word) logotypes today...\n\n[http://www.logodesignlove.com/similar-original-logos](http://web.archive.org/web/20081013235536/http:/www.logodesignlove.com/similar-original-logos \"http://www.logodesignlove.com/similar-original-logos\")\n\n"
    },
    {
      "time": " 28.Jul.2008 2.03pm",
      "content": "great link ! i’m sure there are examples here of both imitation and coincidence. ford, for example, is so ubiquitous that it’s hard to imagine a designer not knowing about it. and of course there was the thread about the new cardiff logo - dots in perspective -\n\n[http://typophile.com/node/42203](http://web.archive.org/web/20081013235536/http:/typophile.com/node/42203 \"http://typophile.com/node/42203\")\n\nto which i posted this:\n\n ![](http://web.archive.org/web/20081013235536im_/http:/typophile.com/files/dotslogo_6471_3577.png)\n\n"
    },
    {
      "time": " 30.Jul.2008 10.52am",
      "content": "Wow this thread really exploded into a great discussion...I love it!\n\nJessi and ch,  \nGreat links and examples...I think that in the first link, a few of those are too close for comfort. Also the very first logo (the ’g’) reminds me of a wine logo that is a lowercase ’g’ with a horn/horns instead of the serifs. Anyone recall which logo it is? I have it in one of my books..just can’t find it.\n\nNick, that’s a nice ’a’. Love it...\n\nok need to catch up on the rest of the thread...\n\n"
    },
    {
      "time": " 30.Jul.2008 12.26pm",
      "content": "” Create links ! ” How you see the INFLUENZA ? . It spreads thru the wire and promises to exponentially go up .\n\n"
    },
    {
      "time": " 30.Jul.2008 2.34pm",
      "content": "<cite>We also all have to be much more inventive about how we survive. In Lisette Model’s photography Master Classes at the New School, someone would always ask, ’what’s the most important thing you need to be a great photographer.’</cite>\n\nLisette would always answer: ’a rich spouse.’\n\nWell, I am an artist/graphic designer, and my partner is a photographer. Perhaps we need a third party? ;)\n\nHaving sat in the background for much of this discussion, I really have to voice a few of my thoughts. As far as EULA v/s graphic designer is concerned, I completely agree that the GD doesnt have time to worry about whether or not we intend “normal” use. I have a hard enough time categorizing my fonts without having to worry which ones I am allowed to use for what. Not to mention that my job includes far too many things to have to also be fluent in legalese. I also agree that while fonts are an art form in themselves, they are a tool to be used by a designer. It is a simbiotic relationship, the font designer and the graphic designer. I want to use the best font possible for my jobs, but I also have pressure from every angle imaginable. As has been stated previously, this industry has changed completely, and much of it is in dire need of repair. I have clients who tell me what they will pay, and if I refuse their offer, they will go to joe baloney with the pirated CS3. They simply dont care, except for the bottom line. But of course, thats everything. Where there once was a budget for photography, and an art director hired a photographer to take the precise image needed, now I spend hours rifling through junk on stock sites because thats all I can afford. Where we used to show clients sample books and order the perfect paper stock and proof the job with the local printer, we now have to compete with online gang printers who print from JPGs! I can’t tell you the nights I have stayed up until 3am editing images for practically nothing just to pay the rent. We already do everything possible to stay afloat, and yet this unending stream of diversification has me so dilluted that I no longer know what I DO for a living.\n\n<cite>What drags me down is I often get the sense I could do a good job or a poor job and the client would never know the difference. All you need is a degree in compliance.</cite>\n\nI couldnt agree more.\n\n"
    },
    {
      "time": " 30.Jul.2008 2.37pm",
      "content": "By the way, my partner is going back to school to be a surgical tech. Otherwise, we’ll be driving this 87 nova until we die.\n\n"
    },
    {
      "time": " 30.Jul.2008 3.16pm",
      "content": "Geez Katelynn - what a double post downer!!\n\nMakes me reconsider all of my ambitions :(\n\n"
    },
    {
      "time": " 30.Jul.2008 3.28pm",
      "content": "Haha. It’s not all bad. Just sometimes it is so depressing. I know that times are tough all over, but its really sadenning to read about font designers being ripped off, while graphic designers and photographers are being ripped off... It seems to me that the attitude these days is that any of these jobs can either be completed for free, or by anyperson with a computer. Like no talent or education required, just have at it folks!\n\nQuality control has got to play in at some point, and this will end. At least that is what I hope for.\n\n"
    },
    {
      "time": " 30.Jul.2008 4.00pm",
      "content": "This is a fun site that explores this very thing in ads:\n\n[http://www.coloribus.com/admirror/](http://web.archive.org/web/20081013235536/http:/www.coloribus.com/admirror/ \"http://www.coloribus.com/admirror/\")\n\nSometimes the ideas are so strange it’s amazing 2 people on opposite sides of the globe came up with them at the same time! I’m sure some of them are intentional rips but I’m also sure many of them are pure coincidence.\n\n"
    },
    {
      "time": " 31.Jul.2008 8.40am",
      "content": "Katelynn raises the absolutely crucial point that exists when type designers get incensed about pdf licenses, piracy, all the things that “stop?” their flow of income. (Like when did they ever have a flow?) And it is, GDs have a totally tough time as it is. Font designers who want to make substantial money must get it from corporate clients. GDs will do everything they can for us. Many, even if they acquire a font via piracy, will make sure a valid license is obtained for a client. The really nice ones will make client after client license the same font. Most of us are bottom feeders looking for a rose garden nobody ever promised us. All we can do is co-operate. Font designers tend to work for hours alone, often on spec. We can find it difficult to remember the stupendous pressures that GDs are typically under.\n\nIn the meantime, are font designers going to GD schools and getting their message across? Who is evangelizing for us?\n\n"
    }
  ]
}
