{
  "id": "47610",
  "title": "What a great TypeCon!",
  "forum": "ebensorkin's blog",
  "tags": [

  ],
  "content": "What a great TypeCon! I even got to have coffee with JP at the end today.\n\nI am plenty tired but also very happy.\n\nMy thanks to everybody who made it possible & especially the kind folk at p-22!\n\nCheers!\n\n",
  "author": "ebensorkin",
  "time": "21 Jul 2008 — 3:01pm",
  "uid": "2942",
  "comments": [
    {
      "time": "21 Jul 2008 — 4:15pm",
      "content": "So how did the {calt) presentation go? That is the one I most wanted to see! Will you have speaker notes or presentation slides or pdf for those of us who missed it?\n\nI also missed seeing Matthew Carter at the type crits.\n\nChrisL\n\n"
    },
    {
      "time": "21 Jul 2008 — 6:57pm",
      "content": "I missed that one too. I heard that it was good, but would love to see notes as well. I snuck out to play tunes at an Irish music session at Nietzsche's that afternoon.\n\nIt was a great week.\n\nStephen\n\n"
    },
    {
      "time": "22 Jul 2008 — 12:28am",
      "content": "Chris - Matthew Carter was unable to attend at the last minute. I believe it's the first TypeCon he's missed. Eben's talk was excellent, especially the slides. I hope he'll share them online.\n\n"
    },
    {
      "time": "22 Jul 2008 — 6:21am",
      "content": "Thanks Stewf! Is Matthew ok? I hope it wasn't a health reason that kept him away.\n\nChrisL\n\n"
    },
    {
      "time": "25 Jul 2008 — 4:52pm",
      "content": "Thanks for those kind words Stewf!\n\nI was told that he was just very busy with a project - no doubt one we will all be excited to see. I have a request in to try to see him since he may not be at Atypi either. fingers crossed!\n\nI will post the talk & it's images at some point after I have settled in at Reading. The main reason being - I have much more stuff that would just assume go in that 20 min at Typecon would not permit. The Atypi slot is 50 min so more things will fit.\n\nAlso I was just at the Boston Rare Books room and found a copy of the Iambluchus ( Aldine/Griffo ) that was printed very well. I think some of those images might make it into the talk as well. I have one more week in Boston coming up and with luck I may find other interesting stuff. And who knows, maybe more folk will send me more cool things to see. I know I would like to put Paul Hunt's font in.\n\n"
    }
  ]
}
