{
  "id": "4761",
  "title": "21st Century Chinese",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello folks,   \n   \nGetting ready to do an identity for SF's Chinatown Night Market. They want something that will primarliy appeal to potential corporate sponsors, so it's got to be clean and professional looking etc... I want to make sure though that it doesn't forget it roots, and that it will somehow capture some essence of a Night Market.   \n   \nSo, I am going to focus on some sort of simplified latern treatment for the mark. But for the type I am a bit stumped. I would like something that it is a contemporary sans-serif, but still hints at Chinese brush script.   \n   \nI'm including last years logo, which has a traditional Chinese brush script. I think this is a relevant treatment, but it needs to be updated to fit their current goals. Though I like this logo, I think it is perhaps a bit too coloquial for their needs.   \n   \nLet me know what comes to mind.   \n   \nThanks\n\n",
  "author": "markatos",
  "time": "13 May 2004 — 2:01pm",
  "uid": "1839",
  "comments": [
    {
      "time": "13 May 2004 — 2:03pm",
      "content": "![](http://web.archive.org/web/20131021043232im_/http:/www.typophile.com/forums/messages/30/35825.gif)\n\n"
    },
    {
      "time": "13 May 2004 — 3:28pm",
      "content": "Peter, change the colors to reflect nighttime and festivity. Do you have fireworks? That could be useful. The type does nothing for me. Open one of your Indie font books and get some inspiration. Oh you don't have them, get them or get to a library.\n\n"
    },
    {
      "time": "13 May 2004 — 3:40pm",
      "content": "You should check out how that great typogrphic illustrator Danny Pelavin solved a similar assignment.   \n   \n [http://www.pelavin.com/cm.html](http://web.archive.org/web/20131021043232/http:/www.pelavin.com/cm.html)\n\n"
    },
    {
      "time": "13 May 2004 — 4:56pm",
      "content": "\\> I agree with you Daniel on the type. Its also really busy. The funny \\> thing is, and sort of makes me feel weird about this assignment, is \\> that this logo was designed by one of Senior Designers at Landor. \\> He's got a whole decade more experience than me at design. I'll check out the indie book.   \n   \nThanks James. I'll look at that fellow's site.\n\n"
    }
  ]
}
