{
  "id": "47626",
  "title": "Is the quality of architecture slowly declining?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.thecityreview.com/nuchin12.jpg](http://web.archive.org/web/20080906160332/http:/www.thecityreview.com/nuchin12.jpg \"http://www.thecityreview.com/nuchin12.jpg\")\n\n[http://news.yahoo.com/s/mcclatchy/20080720/wl\\_mcclatchy/2994196](http://web.archive.org/web/20080906160332/http:/news.yahoo.com/s/mcclatchy/20080720/wl_mcclatchy/2994196 \"http://news.yahoo.com/s/mcclatchy/20080720/wl\\_mcclatchy/2994196\")\n\nThe building above is the headquarters of China Central Television. I think that it is easily one of the most aesthetically horrific structures I have ever seen. Yes it’s a tribute to modern technology and how far we have developed, but that’s it. I think it this building is an eyesore on the horizon of Beijing, much like the Lloyd building is an eyesore to London (having seen that first hand, it really does look like a cigar that has its end chopped off and was stuck into the ground.)\n\nWhen you compare this architecture with the classic work of Wright, Le Corbusier, Mies van der Rohe, Oscar Niemeyer, Alvar Alto, Antonio Gaudi (I could go on and on) this building is a great reminder of the fact that just because you can do something, doesn’t mean you should. My grandfather was a wonderful architect in Moscow, and growing up with him I would go through his books of late 19th and 20th century architecture. If he would see this building, he would be horrified. I am not an architecture expert, but knowing a bit about the era that preceded modern day architecture, I can say it’s not a testament nor a credit to modern day architecture.\n\nAnyone else agree/disagree?\n\n [‹ looking for \"Inkpen2script\"](http://web.archive.org/web/20080906160332/http:/typophile.com/node/47751 \"Go to previous forum topic\") [S. H. Steinberg ›](http://web.archive.org/web/20080906160332/http:/typophile.com/node/1772 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906160332/http://typophile.com/user/23247\" title=\"View user profile.\">Fantômas</a>",
  "time": "<br>",
  "uid": "23247",
  "comments": [
    {
      "time": " 22.Jul.2008 7.54am",
      "content": "Well, it’s all about taste. Some people don’t like modern architecture, and some people love it. I think it’s far too personal of an opinion to be able to categorize it generally. Yes, I admire the CCT building more for its industry and it’s oddity than I do for its architectural design. But, that’s what I think, perhaps other think it’s the greatest building since the Pantheon…!\n\nJon.\n\n"
    },
    {
      "time": " 22.Jul.2008 7.59am",
      "content": "The grid structure and square monolithic shape suggest a handmade strength. But the meandering lines of the grid also suggests nature or natural elements. Those same lines however strong they really may be, suggest weakness and the protruding top on an uneven grid makes the stomach feel as queasy as looking up at Pisa’s leaning tower. It definitely provokes thought and is not something to overlook.\n\nAs far as representing China, I can’t say since my opinion is solely based on other people’s experiences or lack thereof in the country.\n\nAs far as representing the direction of architecture as a whole, I would have to guess that was probably not the goal of the project. Although it might in so far as architecture today seems to be more focused on meeting the needs of it’s specific client, upsetting traditional hierarchy of work environments, and letting computational algorithms drive design, especially in it’s facade or “skin”.\n\n[one example [http://www.morphosis.net/](http://web.archive.org/web/20080906160332/http:/www.morphosis.net/ \"http://www.morphosis.net/\") ]\n\n"
    },
    {
      "time": " 22.Jul.2008 8.11am",
      "content": "I think it’s a really cool design. I’d like to see some more pictures, but they all seem to be from the same angle.\n\nEven if you don’t like it, I think one must remember that one building does not a direction make. I think it’s important for all kind of designers to explore “design space”, and even if not every experiment is a success, we learn something from it. We make progress and establish direction from an aggregation of previous designs, and in every generation, there have to be some things that turn out to be bad ideas and some that remain good in retrospect.\n\n"
    },
    {
      "time": " 22.Jul.2008 8.40am",
      "content": "“I think that it is easily one of the most aesthetically horrific structures I have ever seen.”\n\nThat’s a very common reaction to most modern architecture from any era. People hated the Eiffel tower, the St. Louis Arch, etc. I’m sure there was a group of Romans arguing about the Acropolis when it was being built.\n\nIconic architecture is just as much art as it is design and art, at times, is meant to cause a reaction more than anything. You spoke of FLW and his Guggenheim was hated by many folks at the time as well.\n\n"
    },
    {
      "time": " 22.Jul.2008 9.47am",
      "content": "\\> I’m sure there was a group of Romans arguing about the Acropolis when it was being built.\n\nPerhaps the Romans were grumbling while the Acropolis was being built. But when the Athenians were busy building the Acropolis in Athens, the Romans only had control of their still rather small city on their seven hills (and maybe just a tad of the area surrounding it). They were hundreds of years away from conquering Greece. ;-)\n\n"
    },
    {
      "time": " 22.Jul.2008 12.33pm",
      "content": "I strongly disagree with you Fantômas. Architecture is perhaps the slowest art from we have. Like most of OMA’s work, the CCTV building is a radical departure from the expected, something that art ultimately strives to do. There is no merit in regurgitating what has been done for the last 30,40, or 50 years. Corbu, Eames, et al. were great, they brought us to where we are today, but at some point, you have to take them for what they are- Dead White Guys (and Girls).\n\nfor more images:  \n [http://www.oma.eu/index.php?option=com\\_projects&view=portal&id=55&Itemid...](http://web.archive.org/web/20080906160332/http:/www.oma.eu/index.php?option=com_projects&view=portal&id=55&Itemid=10 \"http://www.oma.eu/index.php?option=com\\_projects&view=portal&id=55&Itemid=10\")\n\n"
    },
    {
      "time": " 22.Jul.2008 7.39pm",
      "content": "I also think it’s ugly but also has sense of greatness and is very dramatic.\n\nI would like to see a departure of glass and steel. Who will be the brave architect to build with stone again?\n\nHéctor\n\n"
    },
    {
      "time": " 23.Jul.2008 5.50am",
      "content": "It is a wonky salute to Stonehenge.\n\nIt’s new. It’s innovative. It’s not just another glass-box office tower, but a glass-box office tower that has broken out of it’s rectangular mould - and into a more oddly shaped one. The building is not all that attractive and appears to be about style for the sake of style. Different to be different... Not much different from the empty visual calories of a new Easter bonnet — Except an advantage enjoyed by viewers of Easter bonnets is that no matter how lovely or gaudy it is, you only have to look at it for a day or two. In this way, I think Koolhaas’ CCTV Headquarters is the opposite of good design. Particularly for a prominent public building. All images I’ve seen of it are from the same angle showing the hole in the middle, where essentially, it looks like an angular donut. Rotate it from 45 to 90 degrees to the right and, if the renderings are drawn correctly and the photos don’t lie, it’s a slightly off balance letter ’z’.\n\nThere is something very unsatisfactory about that, similar to what you’d feel looking at half a bridge that ends abruptly part way across a river. Nice as a sculptural statement, perhaps but only if there is something that explains or resolves the implied instability. It poses a visual question about balance and purpose that goes unanswered.\n\nAre the exterior walls not vertical simply because, given enough steel, some good engineering and buy-in from the client, you can build walls at any angle you like? I don’t think that’s a good enough reason to impose such a large and improbable looking building on the people of Beijing. Will they find themselves thinking back with affection on the monotonous and shabby concrete architecture and shapeless olive-drab hats of the Cultural Revolution as they look up uneasily at the over-hanging upper floors?\n\nIn other words, I think it is pretentiously foppish.\n\n-=®=-\n\n"
    },
    {
      "time": " 23.Jul.2008 6.08am",
      "content": "Fantomas, I believe in your rage you mixed something up. The Lloyds building in London is not the “chopped off cigar” but “the one with the tin cans stuck on”. You mean the Swiss Re building.\n\nHard to take you seriously.\n\n"
    },
    {
      "time": " 23.Jul.2008 6.56am",
      "content": "In my rage? well I’m not turning green yet, so no rage has surfaced...yet. But the Lloyd building does look like a cigar. Can’t you see it? ;)\n\nRusselm,  \nI’m trying to remember the name of the structure but back in 1920/30s, Le Corbusier (I believe it was him) had an idea for a building that looked like a letter “T” (a san-serif T!). So the idea of a building with part of the structure hanging off the side isn’t new, but back then they had no means to execute it.\n\nI’m really missing my grandfather’s architecture books. I need to go visit grandma and ’borrow’ a few of them...\n\n"
    },
    {
      "time": " 23.Jul.2008 7.17am",
      "content": "_an idea for a building that looked like a letter “T”_\n\n[Lissitzky perhaps?](http://web.archive.org/web/20080906160332/http:/en.wikipedia.org/wiki/Image:Photomontage_of_the_Wolkenbugel_by_El_Lissitzky_1925.jpg)\n\n"
    },
    {
      "time": " 23.Jul.2008 7.25am",
      "content": "eliason,  \nGah!! I was thinking an “L” name...thanks for clearing that up. I REALLY need to go back to a few of the old books...\n\n"
    },
    {
      "time": " 23.Jul.2008 7.56am",
      "content": " ![](http://web.archive.org/web/20080906160332im_/http:/typophile.com/files/lloyds_london_building_3826.jpg)\n  \n&nbsp;  \nFantomas:  \n<cite>But the Lloyd building does look like a cigar.</cite>\n\nYou must be smoking very strange cigars.\n\n"
    },
    {
      "time": " 23.Jul.2008 3.24pm",
      "content": "@ Héctor\n\nI think some of the planning regulations for Berlin enforce the use of stone, but I may be wrong.\n\n-\n\nI cycle past the Lloyd’s building some days, there are always people photographing it.\n\nStrange that you mention a T shape because the building across the street to the Lloyd’s building, the P&O building, has taken on a T shaped form as it is demolished, from the floor up!\n\n[http://farm1.static.flickr.com/192/501183164\\_7be12527ec.jpg?v=0](http://web.archive.org/web/20080906160332/http:/farm1.static.flickr.com/192/501183164_7be12527ec.jpg?v=0 \"http://farm1.static.flickr.com/192/501183164\\_7be12527ec.jpg?v=0\")\n\n"
    },
    {
      "time": " 23.Jul.2008 9.04pm",
      "content": "I have always liked architecture that has a sense of evident purpose, I mean the architecture that tells you what it is and how to behave on it.\n\nA recent example of this is [The Church of the Light](http://web.archive.org/web/20080906160332/http:/bp1.blogger.com/_SZjS0x8XooU/RxhAvTfmylI/AAAAAAAAAnQ/2UCeRx8cf98/s1600-h/Ando.png) by Tadao Ando. Only watching a picture of it makes you understand the building and humbles you.\n\nAlso note that the [killer](http://web.archive.org/web/20080906160332/http:/blog.jaman.com/wp-content/uploads/2008/02/bardempic.jpg) on the movie No Country For Old Men looks a lot like [Tadao Ando](http://web.archive.org/web/20080906160332/http:/www.aboodalamoudi.com/architecture_images/1-famos%20architet/tadao_ando_architecture.jpg).\n\n@1985  \nThen I have to visit Berlin soon.\n\nHéctor\n\n"
    },
    {
      "time": " 24.Jul.2008 2.42am",
      "content": "@Héctor\n\nCheck before you visit :-)\n\n"
    },
    {
      "time": " 24.Jul.2008 3.18am",
      "content": "I think that the reference to El Lissitzky is right. The model of Koolhaas must be that. But where Lissitzky was (I suppose) maybe too naif (like Tatlin) and utopian, Koolhaas is totally cynical. He represents power without rethorical filters.\n\n"
    },
    {
      "time": " 25.Jul.2008 10.24pm",
      "content": "I am a huge fan of contemporary architecture. I agree with others that you either like it or you don’t. I think sometimes new things and ideas make people uncomfortable. I personally love the new CCTV building and find it fascinating, I would love to see it in person. It looks like it belongs in China, where else would a building like this fit in. Ever looked at photos of Shanghai, it is practically Blade Runner’s LA. I also do love the work of Zaha Hadid, Santiago Calatrava, and Norman Foster who all push the boundries of both architecture and engineering in similar ways. I do think they do it better, but that is definitely up for debate.\n\nOn another note I think there may be some confusion on the “cigar in the ground” building. I agree with Tim, and have a feeling that Fantômas is speaking about 30 St Mary Axe, The Swiss Re building, in London sometimes referred to as ’the Gherkin’ by Sir Norman Foster and not the Lloyd building. the Gherkin does have some resemblance to a cigar, but I wont go there. I know there was a lot of arguing and discussion especially amongst Londoners when it first went up and some people still hate it, many have learned to love and accept it though. I think it is an amazing iconic building that brings an even more modern feel to the London skyline that is so interesting, and I think the building itself is gorgeous. I think architecture is hard because you want the field to grow and develop, but because it isn’t on paper or canvas and we live in it, it can be hard to watch as things change in your surroundings without your control. You can choose to no longer read a magazine because you hate the redesign, but you cant really get away from, maybe the Gherkin that was just built outside your window. However, if you do not allow progression and change where will the field go? We may as well all be living in FLW Prairie style homes, and I am sure that would make some of you very happy, but not all of us.\n\n[http://en.wikipedia.org/wiki/The\\_Gherkin](http://web.archive.org/web/20080906160332/http:/en.wikipedia.org/wiki/The_Gherkin \"http://en.wikipedia.org/wiki/The\\_Gherkin\")\n\n"
    },
    {
      "time": " 26.Jul.2008 4.31am",
      "content": "@Héctor\n\nIf you are ever in Fort Worth—http://www.themodern.org/\n\n"
    },
    {
      "time": " 26.Jul.2008 5.05am",
      "content": "“Is the quality of architecture slowly declining?”  \nSince the nuclear reactor museum tragedy in Bilbao, I think it’s declined rapidly.  \nCheers!\n\n"
    },
    {
      "time": " 26.Jul.2008 6.42am",
      "content": "I don’t care for architecture as a field in general, but I actually LOVE the CCT building. I’m not exactly sure what, but it says something valuable, and that’s more than most buildings do.\n\nBut the future is this:  \n [http://news.bbc.co.uk/2/hi/middle\\_east/7472722.stm](http://web.archive.org/web/20080906160332/http:/news.bbc.co.uk/2/hi/middle_east/7472722.stm \"http://news.bbc.co.uk/2/hi/middle\\_east/7472722.stm\")\n\nhhp\n\n"
    },
    {
      "time": " 26.Jul.2008 9.49am",
      "content": "\\> I can say it’s not a testament nor a credit to modern day architecture.\n\nWhat is modern day architecture?\n\n"
    },
    {
      "time": " 26.Jul.2008 4.05pm",
      "content": "I for one would be one of the loudest supporters of a return to Greco-Roman architecture, although I’m not an architect; the only two architects I know by name are Frank Lloyd Wright and Henry Hornbostel, and the second only because I’m a Carnegie Mellon alum.\n\nThen again, all you have to do is go to CMU campus to see the new against the old. I’d provide links, but Google isn’t rocket science.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 28.Jul.2008 4.00am",
      "content": "”... return to Greco-Roman architecture...”  \nIf you have never been to eastern Berlin, you’re missing some of the best of, and freshest painted of, all neo-classical architecture ever built.\n\nCheers!\n\n"
    },
    {
      "time": " 28.Jul.2008 8.23am",
      "content": "Did anyone catch this article?\n\n[http://blogs.telegraph.co.uk/richard\\_spencer/blog/2008/07/24/city\\_of\\_the...](http://web.archive.org/web/20080906160332/http:/blogs.telegraph.co.uk/richard_spencer/blog/2008/07/24/city_of_the_past_city_of_the_future \"http://blogs.telegraph.co.uk/richard\\_spencer/blog/2008/07/24/city\\_of\\_the\\_past\\_city\\_of\\_the\\_future\")\n\n"
    }
  ]
}
