{
  "id": "47621",
  "title": "The Typecon 2008 thanks thread",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just wanted to say thanks again to Tamye and everyone else at SoTA and in Buffalo for everything that went into Typecon 2008! You did an incredible job, and it was memorable to say the least.\n\n [‹ Jovica Veljovic at the SF Public Library!](http://web.archive.org/web/20081014000329/http:/typophile.com/node/48110 \"Go to previous forum topic\") [They're everywhere and then they're nowhere. ›](http://web.archive.org/web/20081014000329/http:/typophile.com/node/47837 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081014000329/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 22.Jul.2008 12.11am",
      "content": "yes, many big thank you’s! I had a great time.\n\n"
    },
    {
      "time": " 22.Jul.2008 12.25am",
      "content": "Thank you, James. Agreed.\n\nPeter, I’m sorry I didn’t get to say goodbye to you and Stefan. So many pals, so few chances to chat. I hope to be less busy and scarce next year.\n\n"
    },
    {
      "time": " 22.Jul.2008 6.50am",
      "content": "All,\n\nThank you all so very much for a super TypeCon.\n\nEveryone involved with SOTA works so hard I hope that it is gratifying to see so many people enjoying and appreciating their efforts.\n\nAgain, my thanks.\n\n"
    },
    {
      "time": " 22.Jul.2008 7.11am",
      "content": "Wonderful to meet some of you. Can’t imagine the number of hours that went into planning and organizing. Thanks to everyone involved.\n\n"
    },
    {
      "time": " 22.Jul.2008 7.19am",
      "content": "Thanks, James. You’re quite welcome.\n\nAnd right back at you. It’s the attendees and participants, as much as the organizers, that make TypeCon what it is. As you know, the whole thing is pretty much volunteer. So TypeCon is all of us and we all help to create it in our different ways.\n\nPeter, it was great to see you and Stefan. I’m glad the Swedish delegation was there again to “represent.” You guys are always great fun to have around. But next time, get your stuff to me in time to go in the goodie bag ;-)\n\nNancy, I enjoyed what I was able to see of your presentation. As someone said to me in the hall afterward, you always manage to make the most seemingly mundane things so fascinating.\n\nMark (“Jupiter Boy Hatley” ;-), it was great hanging with you & Pam (and Craig and Jason) at the Roycroft, however briefly.\n\nIt was great to see many of the usual suspects and meet some more Typophiles face to face.\n\nHope to see y’all again next year in Atlanta!\n\n— Kent.\n\n"
    },
    {
      "time": " 22.Jul.2008 7.57am",
      "content": "So many, many people to thank – Rich and Carima for their generous hospitality, Shu for taking a hit for the team by staying up late to entertain the attendees, Tamye, Kent, Michelle, Jon, Deb etc., for all their work behind the scenes, the sponsors, the speakers, - truly amazing! Thanks SOTA!\n\nRegrets: not getting to talk to more people, not making it to the “Hockey House”, missing the Roycroft, and of course that last brewski on Saturday night. :-)\n\n"
    },
    {
      "time": " 22.Jul.2008 8.51am",
      "content": "Si — Sorry you had to leave early. Thanks for all your help and especially the blogging; I hope folks who couldn’t attend appreciated it.\n\nP.S. I love the new pawn.\n\n"
    },
    {
      "time": " 22.Jul.2008 8.55am",
      "content": "Thanks to all. An inspiring time, and a pleasure to meet many of you in person.\n\n"
    },
    {
      "time": " 22.Jul.2008 9.09am",
      "content": "I wish I could have finally met Peter Bruhn after so many enjoyable internet posts! Hopefully, next year!\n\nChrisL\n\n"
    },
    {
      "time": " 22.Jul.2008 9.59am",
      "content": "Mark — Tried to send you a personal message via Contact in your profile, but it didn’t go through. I never got your e-mail address. Please contact me via my profile, or via my website.\n\n— K.\n\n"
    },
    {
      "time": " 22.Jul.2008 10.14am",
      "content": "I had such a great time - Thanks to all the council members and volunteers I didn’t have a chance to thank in person.\n\n"
    },
    {
      "time": " 22.Jul.2008 10.17am",
      "content": "This really was another excellent TypeCon. Thanks indeed. The hard work bleeds off the page for sure.\n\nThe only downside for me was not being able to meet more people. I can think of quite a few people that I was never able to find.\n\n"
    },
    {
      "time": " 22.Jul.2008 10.59am",
      "content": "Lovely write up by Armin...\n\n[http://www.underconsideration.com/speakup/archives/005052.html](http://web.archive.org/web/20081014000329/http:/www.underconsideration.com/speakup/archives/005052.html \"http://www.underconsideration.com/speakup/archives/005052.html\")\n\n"
    },
    {
      "time": " 22.Jul.2008 12.11pm",
      "content": "I’m nearly recovered. Thanks everyone, especially SOTA volunteers who keep it all together and on schedule against the odds. Glad to meet a few new people (even on the plane to SF!), sorry to miss some. Stewf, we have to do a Bay Area birthday something; sorry I missed it. An excellent conference packed with amazing stuff. From genetic type to etiquette to murder, TC08 exceeded expectations. Thanks again all.\n\n"
    },
    {
      "time": " 22.Jul.2008 12.20pm",
      "content": "Another great year. Thanks to everyone that have put it together. Already looking forward to Atlanta!\n\n"
    },
    {
      "time": " 22.Jul.2008 2.23pm",
      "content": "Indeed - thanks to all those who worked so hard to put together another great conference! I found myself relying very heavily on SOTA members and volunteers to help me find my way and keep me in line.\n\nAs usual, it was a pleasure to see my friends and to make so many new ones! Looking forward to Atlanta.\n\n"
    },
    {
      "time": " 22.Jul.2008 2.35pm",
      "content": "Thanks everyone!  \nGood to see you’all again.  \nAs per Carl, just about recovered—that was a lot of social drinking every night.\n\n"
    },
    {
      "time": " 22.Jul.2008 3.39pm",
      "content": "Thanks from me as well. I was there for only a day-and-a-half because of a late invite on to the speaker’s list, but this was my first typecon and I found my time there very worth while, from both a ’meeting people’ and and ’attending sessions’ point of view.\n\n"
    },
    {
      "time": " 22.Jul.2008 3.58pm",
      "content": "Thanks to everyone who came to Buffalo. It was great to see so many old friends and meet a few new ones, but like the host of a big party, not enough time to do more than chat quickly and then go refill the chip bowl. I am sorry if I didn’t say hello. It is great to hear the many comments. I thought I would rest up today but instead found out about a printers auction today in East Aurora and saw letterpress equipment sell for far too little (and scrap). Luckily I was able to get Laurence Penney to help move some items we bought for [WNYBAC](http://web.archive.org/web/20081014000329/http:/www.wnybookarts.org/)\n\n"
    },
    {
      "time": " 22.Jul.2008 4.15pm",
      "content": "Hey, Rich — I just learned that the Museum of Printing in Andover, MA, is going to be selling off some of their extra collection. Mostly redundant type material, it seems (but maybe some equipment?). See [http://www.museumofprinting.org/](http://web.archive.org/web/20081014000329/http:/www.museumofprinting.org/ \"http://www.museumofprinting.org/\")\n\nThanks for all your hard work. I don’t know if everyone realized the tremendous amount that you and Carima did to prepare the way for us in Buffalo, from the great PR (really raised the bar for local publicity!) to some great evening events & partners, plus all the WNYBAC receptions. And even helping clean up the “chip bowls” and “empty glasses” on Monday morning. Thanks.\n\n— K.\n\n"
    },
    {
      "time": " 22.Jul.2008 4.33pm",
      "content": "My only regret: Not keeping a copy of that Buffalo Rising mag with the article comparing Rich to Indiana Jones.\n\n"
    },
    {
      "time": " 22.Jul.2008 5.04pm",
      "content": "Rich is the greatest! I wish I could have been there.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Jul.2008 6.14pm",
      "content": "See you all again in Atlanta where they have Delta, Coca cola and Home depot! lol. Just kiddin, was a pleasure to meet everybody again.\n\n"
    },
    {
      "time": " 23.Jul.2008 1.37am",
      "content": "Stewf: I’m sure you’ll turn up in Malmö soon.\n\nChris: Yes, I was hoping to hear all those puns irl.\n\nIndy & Carima: So nice to met you again, and what a effort you have put in.  \nAlso very nice to see the house you bought and the printing presses. I’m envious!\n\nAll typeCon workers/volenteers: Wonderful job!\n\nI met so many new people – really great to put a face to many of the names  \nyou’ve seen so many times here at typophile.\n\n/p\n\n"
    },
    {
      "time": " 23.Jul.2008 6.52am",
      "content": "I, too, had a swell time, and extend my thanks to them what put TypeCon 08 together. It is so nice to see old pals, to meet people I’ve only connected with on this and other lists, as well as completely new folks. & to learn from all of them. A treat.\n\nAnd Buffalo! What a story Buffalo must have to tell. I just got glimpses from buildings and streets, from history placards, etc. I want to know more about that city’s history. I’m much more interested in going to conferences in “out-of-the-way” places like Buffalo than to the great cities we all know so much about. Buffalo was as good as the conference.\n\npowers\n\n"
    },
    {
      "time": " 23.Jul.2008 7.52am",
      "content": "Once again this years TypeCon was freakin’ A awesome. Being a photographer coming to TypeCon is like going on a vacation to a foreign country. You need to learn the language of course one I strive to learn. Once I arrive I start meeting such welcoming people like Tamye, Stephen, Kent, Mark, Carl, Si, Kegler , Sherman, Shu, Shinn, Wild Man Downer, Zara, Adam, Nadine, Shelley , Amy P., Veronika, and Parker. Remember the behind the scenes folks as well like AV QUEEN J.P. and my homey Eben. Thanks guys for welcoming me to your family. Check out the photos on Flickr (I’m still uploading). If you would like me to send you a larger res shot, email me. Hope to come back next year and I promise I will be on my best behavior (sorry A.P.). I’ll be bringing the Pama and St-Germain.\n\n**√o**\n\nPS- Anyone wanting a photo CD of Seattle 2007 please drop me your address via email: [info@checkofoto.com](mailto:info@checkofoto.com)\n\n"
    },
    {
      "time": " 23.Jul.2008 8.03am",
      "content": "JP - absolutely! I feel like I’m in the inner circle because she let me use my own laptop! A great honor. And Checko it was great getting to chat with you at the Steak-Out. Be sure to make those crazy cocktails in Atlanta!\n\nAlso the Flickr group... [http://www.flickr.com/groups/typecon/](http://web.archive.org/web/20081014000329/http:/www.flickr.com/groups/typecon/ \"http://www.flickr.com/groups/typecon/\")\n\nPS. a CD of Seattle - sign me up!\n\n"
    },
    {
      "time": " 23.Jul.2008 4.16pm",
      "content": "This convention has lit a fire under me. My most gracious thanks everyone; especially Kent and Tamye.\n\n"
    },
    {
      "time": " 23.Jul.2008 5.59pm",
      "content": "Thanks to Vanessa Farquharson of the National Post - I think she sums up Typecon almost perfectly...\n\n[http://www.nationalpost.com/life/story.html?id=675149](http://web.archive.org/web/20081014000329/http:/www.nationalpost.com/life/story.html?id=675149 \"http://www.nationalpost.com/life/story.html?id=675149\")\n\nThe best bit...\n\n“But just then, Erik Spiekermann - a renowned German typographer who founded FontShop and has created typefaces for Audi and Volkswagen - walked by and scanned through the list.\n\n“Trebu-f—-ing-chet?” he said. “Who put that on here?”\n\nAlthough he wasn’t impressed with this decision, the outspoken Spiekermann did reveal a smile upon seeing Meta on the list; after all, he created it.”\n\n"
    },
    {
      "time": " 23.Jul.2008 8.04pm",
      "content": "I really enjoyed this year’s TypeCon. I was glad to see quite a few people who have been absent in recent years and met some new people as well. The only problem I have with TypeCon is that it’s almost impossible to do anything but TypeCon when you’re there. Thanks to everyone who made it possible.\n\n"
    },
    {
      "time": " 23.Jul.2008 8.08pm",
      "content": "TypeCon was amazing and a ton of fun!!! Volunteering was a great experience. I got to meet a ton of students from Buffalo area that share the same passion of design as I do. I also got chat with a bunch of designers from around the US. I’ve never learned some much about type in a short period of time. It gave me a ton of ideas for my own work and got me font crazzy!!\n\n"
    },
    {
      "time": " 23.Jul.2008 9.04pm",
      "content": "[http://www.nationalpost.com/life/story.html?id=675149](http://web.archive.org/web/20081014000329/http:/www.nationalpost.com/life/story.html?id=675149 \"http://www.nationalpost.com/life/story.html?id=675149\")  \n_high-waisted denim_  \nThanks for that too.\n\n"
    },
    {
      "time": " 24.Jul.2008 4.17pm",
      "content": "Thanks to all of you for being so supportive and inquisitive about my documentary-in-progress. It was amazing to be at a conference outside of my official “industry” and have everyone be so warm and welcoming. I learned a lot- I had a ton of fun.\n\nThanks again  \nJustine  \n [www.typefacethefilm.com](http://web.archive.org/web/20081014000329/http:/www.typefacethefilm.com/ \"www.typefacethefilm.com\")\n\n"
    },
    {
      "time": " 24.Jul.2008 4.52pm",
      "content": "I too must chime in to say what a fantastic conference TypeCon was.  \nBeautifully organized, fascinating content, and attended by fascinating people willing to share their knowledge with all and sundry, even with a decidedly amateur typographer like me!\n\n"
    },
    {
      "time": " 24.Jul.2008 11.52pm",
      "content": "Justine - Can’t wait for your movie. The scene with the students who excitedly went out and bought their own mini print workshop is still resonating with me. I’m the same age as those guys, in a similar position, and just looking for an excuse to setup a lead type studio to call my own.\n\n"
    },
    {
      "time": " 25.Jul.2008 9.36am",
      "content": "Wanted to add my thanks to all the people who made TypeCon happen. I came early for workshops with Miguel and Adam and stayed through the Roycroft tour. Couldn’t do everything on the schedule but dropped a bundle in the SoTA store and at the auction, and had a grand time. Hope I can make it to the next one!\n\n"
    },
    {
      "time": " 25.Jul.2008 4.58pm",
      "content": "A great big thanks from me too. I am fully caught up on sleep as of today.\n\nLike the inimitable Checko, I have started to get images up on Flickr. It is really nice to revisit the experience that way.\n\nAle, I feel you, but Atlanta can be a great food town! You need to be there!\n\nChecko: I would like a CD of Seattle too!\n\n"
    },
    {
      "time": " 27.Jul.2008 3.28pm",
      "content": "Sorry for bouncing in so late... I’ve been a holiday slacker with my family for a week now and I sure needed it. TypeCon is wonderful experience and I also wish to thank Tamye, Stewf, Ken, Tiffany, Jon and all the other Sota board members for making into such a success, over and over again. It was a bunch of fun to meet up with old friends and finding new ones. Cheers!\n\n"
    },
    {
      "time": " 27.Jul.2008 3.29pm",
      "content": "PS. Stewf. If you make it all the way over to Malmö you know you have to make a detour to Stockholm as well! DS.\n\n"
    },
    {
      "time": " 29.Jul.2008 4.47am",
      "content": "Thank you all! It was great fun!  \nHad the chance of meeting a lot of interesting people, making new friends, meeting old ones, learned & partied a lot. See you all in Atlanta! Cheers!  \nFrederico\n\n"
    },
    {
      "time": " 30.Jul.2008 6.32am",
      "content": "I just got back from a week’s vacation following TypeCon and my first two days at a new job, so please forgive my tardiness.\n\nThanks, everyone, for a great time in Buffalo. It’s a wonderful feeling to have so many people remember you and strike up conversation, even after missing a year. I’m wary of listing names, as I fear omitting one, but I do want to specifically thank Tamye and the other SoTA board members for their hard work. I had a great time, as always. To those I neglected to say goodbye to in person, I had to leave early Sunday morning so I retired early on Saturday night to try and catch up on sleep. Forgive me!\n\nI’m looking forward to 2009. I hope to see you all again in the ATL.\n\nP.S. Good luck in SF, Steph (sp?). You’re really grabbing the reins in a crazy situation, and I’m sure you’ll be a hit on the Left Coast.\n\n"
    },
    {
      "time": " 5.Aug.2008 9.22am",
      "content": "I’m way late to this thread after a week in NY following TypeCon, but wanted to get a quick note in to say thanks to Rich & Carima, Tiff, Tamye, and all the rest of the organizers. It was great to finally meet a bunch of you Typophiles and to spend an entire dinner conversation discussing the proper setting of ellipses at the Roycroft...\n\n"
    }
  ]
}
