{
  "id": "47625",
  "title": "Etiquette at Typecon. Why?",
  "forum": "nancy sharon collins's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20080906121453im_/http:/typophile.com/files/nate_4600.gif)\n\nI was delighted that my lecture, “Etiquette and Typography” was so well received at TypeCon 2008 in Buffalo this past weekend.\n\nTo my great satisfaction, a diverse number of individuals—old, young, male and female—so many people came up or wrote to thank me for my lecture that I began to think about why.\n\nIt was with great interest that I watched Ken Barber’s presentation from House Industries; much of the iconography for the product they make comes from the time period that I discussed.\n\nMid-century America was a special time, filled with optimism and opportunities for economic and social advancement. The clothes, houses, interiors, manners and work ethics symbolize this optimistic and upwardly mobile period. After a half century of world strife it was a relief to think of poodle skirts, bowling, prosperity and good hygiene. As I mentioned in my talk, there is comfort in order and the pursuit of order was the pursuit of happiness for the United States in the 1950s and 60s.\n\nMy favorite photograph of my dad is pictured here. My dad entered the coast guard during clean-up operations after WWII to utilize the G.I. bill which then paid for his college education. His first job, and, the job he did until retiring very recently, was to open up markets all over the world for the purpose of selling used clothing (rags) and army surplus. When I was growing up dad would travel to everywhere except South America and Russia. He sold or stopped-over in Western Europe, the Middle East, the entire African continent, Japan and Hong Kong (China was closed then so trade was not possible and travel there for his purpose would be futile.) There are African countries on his passport that no longer exist.\n\nBut what I love about this photo, and I have discussed this with dad since, is that there he stands in a suit and a tie on the ruins of a civilization destroyed. Granted, the Acropolys has been in ruins for centuries but as a symbol for the way he felt when he traveled the world with his brief case of American samples must have been a form of mastery. America had saved the world and the world was grateful.\n\nThe cynic in me says, okay, the world was grateful for the American dollars he brought. But he always felt welcome abroad which is a far cry from sentiments about America now.\n\nMy point is that we felt hopeful and proud so we dressed and acted like this, too.\n\nWhy then, I wonder, is this sudden interest in manners and protocols and symbols of an American time that has been derided in movies and popular culture? Why are we attracted to hand lettered types and fusty-dusty engraving? Are we just yearning for simpler times when America was perceived to be great? I wonder\n\n",
  "author": "<a href=\"/web/20080906121453/http://typophile.com/user/14410\" title=\"View user profile.\">nancy sharon collins</a>",
  "time": "<br>",
  "uid": "14410",
  "comments": [
    {
      "time": " 22.Jul.2008 8.37am",
      "content": "It may be. And I won’t venture a particularly well thought out answer but to say that the societal pendulum does seem to swing between fascism/conformity and individual expression. I suspect, that on a primitive level, it may have to do with the level of fear working in the zeitgeist. So maybe our nostalgia is based in a fear that we are less powerful that we used to feel.\n\nI really loved your integration of fashion design and other more anthropological observations.\n\n"
    },
    {
      "time": " 22.Jul.2008 9.01am",
      "content": "I was a student during that era 50-60s but I don’t have the same nostalgic feel for it’s artifacts. I think of it more as an age of innocence where people just made stuff without great debate over why it looked a particular way. Today, we categorize and parcel everything into bins of acceptability. We have fear of failure so we look elsewhere for what we think of as success. I wish we were more naive producers who just take a problem and solve it for its own needs rather than searching for a stamp of approval from historic times. I think we are just afraid to be us in our own time, doing what we need to do for now.\n\nI wish I had been able to see your presentation, Sharon. It sounds like it would have been revealing and interesting.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Jul.2008 9.17am",
      "content": "Hi,\n\nI agree with ChrisL: “Today, we categorize and parcel everything into bins of acceptability. We have fear of failure so we look elsewhere for what we think of as success.” This was the underlying reason for my thoughts and presentation.\n\nI was born in 1954 and pretty much lived under a rock so my world-view memories lies in the personal artifacts I own. I received my under graduate degree in design at the Kansas City Art Institute and had Rob Roy Kelly as an instructor but everyone thought what he taught was nuts, and I was to young to appreciate it. In an article a few years ago in PRINT there is a quote from one of the other instructors asking about teaching of “the grid”. I will find the article, but, the jest of it is what I believe Chris is saying, that we made stuff and did not think about nor were we taught the method. Even college in the early 70s was still a time of innocent discovery because we did not have any design text books and there was not yet published, or compiled, a survey of graphic design. So we just made stuff, performed crits and made more.\n\nI will post a .pdf of the “how to write a personal letter” that I handed-out at TypeCon. It is tongue-in-cheek but it works and every word is true.\n\n"
    },
    {
      "time": " 22.Jul.2008 9.29am",
      "content": "Thanks Nancy! I look forward to your PDF.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Jul.2008 9.41am",
      "content": "ChrisL: You are welcome and the .pdf is up, I will find the PRINT article and post that, too, as it pertains.\n\njupiterboy: I think fear is part of our current love for things that look happy, safe and nice as well. Perhaps ChrisL can elaborate, but the Cold War era is the underpinning for what I was talking about as well. I am glad you enjoyed the presentation. There is a sub rosa area on my website with a personal timeline if you are interested. it is the ’html’ button on the nav bar, top extreme left hand corner.\n\n[http://www.nancysharoncollinsstationer.com/](http://web.archive.org/web/20080906121453/http:/www.nancysharoncollinsstationer.com/ \"http://www.nancysharoncollinsstationer.com/\")\n\nIt is corn ball, a bit, because the individual elements fit into this. Of particular note is when this nostolgic section in my site was created; my husband and I were evacuees from Katrina and I desperately wanted to get something current up on my URL. So, perhaps fear breeds nosalgia.\n\n"
    },
    {
      "time": " 23.Jul.2008 11.26pm",
      "content": "_I think fear is part of our current love for things that look happy, safe and nice as well._\n\nIsn’t there always love for things that look happy, safe and nice?\n\n(But then, isn’t there always fear...)\n\nNancy, would you be willing to say more about how the bra-burning fits into your picture? I was very fascinated by your talk but have to confess to struggling with putting the pieces together - my own inattention to blame. Were you intending to analogize the end of restrictive corsetry with the end of polite written communication? Do you hope for a return of the latter but not the former?\n\nAnd a somewhat-related aside: I think “Mad Men” is incredibly well done - evoking the era in a way that makes its visual character so appealing, but also exposing the dysfunctions of conformity and power relations at the core of that zeitgeist.\n\n"
    },
    {
      "time": " 24.Jul.2008 6.48am",
      "content": "<cite>Isn’t there always love for things that look happy, safe and nice?<br>\n</cite>\n\nToo some degree, but clearly the dark side has a draw as well. Look at the explosion of torture/horror films recently as the US national identity constricted into conformity behind a less-than-convincing “moral” imperative for war.\n\nMy point is that we are like sheep that stick together when there is a threat, but loosen up when we feel safe.\n\nNot to speak for Nancy, but what I took away was that she has a strong sense of preservation even as we move beyond and past. Maybe part of the confusion comes from the mixing up of social revolution against Victorian ideals that coincides with an atomic-fueled futurism that had a certain influence on design.\n\n"
    },
    {
      "time": " 27.Jul.2008 10.01am",
      "content": "hi,\n\ni have been working on an article for a social justice journal, slogging away in citations and such, so just found these posts.\n\n“Were you intending to analogize the end of restrictive corsetry with the end of polite written communication? Do you hope for a return of the latter but not the former?”\n\nyes. socialization comes with rules and rules are usually restrictive. a lot of working, housing and economic development happened in the 50s and 60s, also the victorian era. but at a price (personal freedom.)\n\nwhat i FEEL is happening today is that, for what ever reason (and there are so many) we don’t have any rules for social engagement. so i look with a sentimental eye at former systems that APPEAR, on a surface level, to have worked. for instance, you want an hour glass figure, wear a corsette. want to fit in to the society of a new town? follow the rules (go to your local stationer and habadasher and find out what get’s you “in” in local society. do i wear formal attire if the invitation states “formal”? do i arrive on time or fashionably late? recently i was flown to naples FL to meet with a client i have had for years but never met. we do business via email and through their personal secretary, no joke. i wore my work armor–black skirt, sandals with a 2” heal, white t-shirt, pearls and a cardigan sweater–the morning i arrived i received an email from the secretary suggesting the appropriate attire–”crop pants” and loafers, neither of which i own. too late i realized that i should have zipped over to the walmart or nearest anything store to buy what would make me fit in. sounds crazy, but, it presents a comfort level, says, i’m one of you.)\n\noh, the bra buring. i wrote an article that will come out soon on “abriefmessage.com” that may address this more fully. i will post the link when its up.\n\n“mixing up of social revolution against Victorian ideals that coincides with an atomic-fueled futurism”\n\nthere are parallels between the victorian era and the middle of our last century. both found unprecedented growth in technology, population, the fall out from war. both sought rules and restrictions on the outside with wild crazy internal modes. the victorian era and mid-century brought pride of home to the forefront, your house was your kingdom. safe, something you could control. housemaking became a real art.\n\nwhat’s that great movie about the ad exec in new haven who comes out? leaving his wife to wonder what happened, juliet moore i think (is that her name?) she starts an innocent relationship with an african american briefly? that’s a winner to watch, too.\n\n"
    },
    {
      "time": " 27.Jul.2008 11.26am",
      "content": "[Far From Heaven](http://web.archive.org/web/20080906121453/http:/us.imdb.com/title/tt0297884/) with Julianne Moore? I haven’t seen it.\n\n"
    },
    {
      "time": " 27.Jul.2008 11.46am",
      "content": "^ really great movie. Sent me off on a Douglas Sirk binge.\n\n"
    },
    {
      "time": " 31.Jul.2008 11.09am",
      "content": "Another great movie about manners, mores and the forbidden is “Death in Venice” by Visconti. Sad to say that even to me it looks a bit dated. (I must have watched it 20 times, maybe more.) I tried to show it in my “History of Graphic Comm” class to explain the fien de siecle&nbsp;but it was too corn-ball to watch. If so, read the original Thomas Mann novella, its my favorite traveling book. It really does talk about responsibility, what is expected of us and how we handle our own artistic obsessions.\n\nSupposedly the story was based on an event that really happened to Mann while on vacation although he never followed up on the obsession the way his protagonist does in the story.\n\n"
    }
  ]
}
