{
  "id": "47633",
  "title": "Please Critique Custom Stationery Company Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I've developed a logo concept for a cute/quirky custom stationery company that focuses on custom birthday invitations, birth announcements, holiday greetings, etc. The main theme behind the company is to celebrate the little things in your big life. The central theme of the product is based on family events.\n\nThe target audience is mother's, ages 25-42, mid-high income bracket. She probably enjoys reading Cookie magazine and taking Starbucks coffee breaks.\n\nThe logo is intended to be fun, approachable, and representative of the look and feel of the products the company is selling.\n\nI got so much great feedback with my last logo posting, I hope to get the same amount of critique and debate with this one. This forum is great. Thanks in advance!\n\n ![](http://web.archive.org/web/20131014001519im_/http:/typophile.com/files/lbl_4985.jpg)\n\n",
  "author": "showandtell",
  "time": "22 Jul 2008 — 9:54am",
  "uid": "22825",
  "comments": [
    {
      "time": "22 Jul 2008 — 10:53am",
      "content": "I really like it, Maybe some colour variations? The only thing I'm not sure about is use of Gotham for the word _big_. I'd love to see something a little more quirky!\n\nThis is my personal view on the typeface rather then your design.  \n_Gotham = Change... Thanks Barrack_\n\n"
    },
    {
      "time": "22 Jul 2008 — 11:07am",
      "content": "Great design, simple but really fun! My inner Starbucks™ Mom is overjoyed! However I do agree with robbie, Gotham contrasts well but it might be a little too static. Its a good choice but I think it needs to feel BIGGER, maybe something as simple as shearing it at an angle in order to give it some depth. Nice work tho. -ONE\n\n"
    },
    {
      "time": "22 Jul 2008 — 11:36am",
      "content": "Thanks for the nice feedback so far. Looking forward to more constructive criticism.\n\nBy the way, did Barack ruin Gotham for everyone?? Damn. I'll look into alternative fonts. Any suggestions?\n\n"
    },
    {
      "time": "22 Jul 2008 — 11:47am",
      "content": "While I do like it I wonder if \"little\" and \"life\" be a touch smaller and rotated (differently) to have a little more bounce? The silhouette isn't rigid so the type doesn't need to be either. You could even have a tiny bit of overlap.\n\n"
    },
    {
      "time": "22 Jul 2008 — 12:12pm",
      "content": "I agree with Tiffany. I like the logo, but I feel uneasy about it because of the rotated house and horizontal text.\n\nI like her idea of overlap. Or let the text extend past the house a little (but I'm not sure how that would look).\n\n-S\n\n"
    },
    {
      "time": "22 Jul 2008 — 12:24pm",
      "content": "I agree with Tiffany too! It needs a touch of asymmetry with the text treatment. Have a play with a small 'little' and a huge 'big' - an overlap may work well. Give it a sense of drama.\n\nI HATE the Gotham. Try something more modern with personality, less classic. Each letter of the word 'big' could be asymmetrical too...might be too much but worth exploring.\n\nI also think the blue could be a touch brighter. White text with pink offset/hard drop shadow (1950s/60s style) on a stronger blue arrow? Might be worth looking at getting both pink and blue in there with the family theme.\n\nJust some ideas but i think you are on the right track.\n\n"
    },
    {
      "time": "22 Jul 2008 — 12:54pm",
      "content": "Just curious, what is the name of the script font? I think it is working well here.\n\n"
    },
    {
      "time": "22 Jul 2008 — 1:29pm",
      "content": "The script font is called Wendy. Someone helped me ID it on the Type ID board just the other day.\n\n"
    },
    {
      "time": "22 Jul 2008 — 1:41pm",
      "content": "A larger 'little' and tiny 'big' may also be interesting\n\n"
    },
    {
      "time": "22 Jul 2008 — 1:44pm",
      "content": "Thanks for the suggestions on how to tweak it a bit. I'll try some out and post them as soon as I am able.\n\n"
    },
    {
      "time": "22 Jul 2008 — 4:59pm",
      "content": "looking great ... the arrow shape could probably do with some tweaking shape-wise .. and could imo be larger in proportion to the text ... to make the text seem smaller again.\n\n----------  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20131014001519/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "22 Jul 2008 — 5:16pm",
      "content": "Admittedly, this next iteration is not a huge departure but I do see some improvement. Please, fire away with your comments. Thanks so much!\n\nOh, color is just for fun for now, I want the logo to be 1 color -- but I'm not settled on what that color would be (the orange looks a little \"Home Depot\" to me).\n\n ![](http://web.archive.org/web/20131014001519im_/http:/typophile.com/files/lbl3_6735.jpg)\n\n"
    },
    {
      "time": "22 Jul 2008 — 5:18pm",
      "content": "By the way, I wondered how apparent it was to everyone that the silhouette shape is a house. I noticed only one person mentioned it. Is it too abstract/subtle?\n\n"
    },
    {
      "time": "22 Jul 2008 — 7:24pm",
      "content": "FWIW, I read it as an upward arrow first, and house second.\n\n"
    },
    {
      "time": "23 Jul 2008 — 12:11am",
      "content": "And that is the fun about it, I think.\n\nI read an arrow too, but after reading more carefuly I noticed the house structure.  \nA surprise. I like it.\n\nI do have a little trouble reading little, however.\n\nIt is light, happy, funny, quirky. I like it!\n\n"
    },
    {
      "time": "23 Jul 2008 — 2:21am",
      "content": "Might be more readable as an 'L' (rather than 'e') if you put a leg on the left hand side of the L. Balances the composition a bit more but perhaps it loses some character?\n\n ![](http://web.archive.org/web/20131014001519im_/http:/typophile.com/files/little_3702.jpg)\n\n"
    },
    {
      "time": "23 Jul 2008 — 2:26am",
      "content": "This makes it more readable.  \nBut the counters of the 't' look stil a lot like an 'l'.\n\nDespite the crossbar.\n\n"
    },
    {
      "time": "23 Jul 2008 — 9:03am",
      "content": "I like the additional leg on the \"l\" a lot! Does the logo seem energetic enough -- or should I keep working it and push it a bit more? I'm afraid to overwork it, I guess, hence the small change from v1 to v2!\n\n"
    },
    {
      "time": "23 Jul 2008 — 9:48am",
      "content": "I think this is better for readability.  \nI wrote 'little' myself.\n\n ![](http://web.archive.org/web/20131014001519im_/http:/typophile.com/files/Naamloos-1_5073.gif)\n\n"
    },
    {
      "time": "23 Jul 2008 — 11:46am",
      "content": "Arial bad! Arial bad!\n\n...\n\nSorry, I got a little carried away, but still, using Arial in a logo makes baby Jesus cry. Try switching to Helvetica, or better yet, something not so bland.\n\nI like your choice of font for \"little\" and \"life\", but I would letter it by hand based on Wendy (after all, it's only ten characters). That way you could fix the awkward way the 'e's connect to the previous letters.\n\n- Lex\n\n"
    },
    {
      "time": "23 Jul 2008 — 12:41pm",
      "content": "Lex, I'm fairly certain that's Gotham, not Arial. In bobbybobo's ripped version it's decaying, but it's still Gotham. Isn't it?\n\n"
    },
    {
      "time": "23 Jul 2008 — 12:58pm",
      "content": "Nah, first rev was gotham but the orange version is arial.\n\n"
    },
    {
      "time": "23 Jul 2008 — 1:00pm",
      "content": "It already was Arial in showandtell’s last version. I agree with Lex. Doesn’t have to be Gotham but certainly shouldn’t be Arial (or Univers, Helvetica, Frutiger ...).\n\n"
    },
    {
      "time": "23 Jul 2008 — 1:47pm",
      "content": "Ok, yes, I see the Arial now! I don't like the orange, either. I think it changes the feel to preschool toys instead of playful yet sophisticated. I might try some grassy greens.\n\n"
    },
    {
      "time": "23 Jul 2008 — 1:55pm",
      "content": "Do you have _[National?](http://web.archive.org/web/20131014001519/http:/www.vllg.com/KLIM/National/mudTyper+Weights)_, you should try it. I think it would really sit well with _Wendy_. Especially when you see the italic. Kind of quirky and fun! It would also be a great typeface/textface for additional use with the brand mark.\n\nOh and if you do use the Italics, try sheer them -10% gives you a beautiful new version!\n\np.s I like the first version better then the second one! the _BIG_ has room to breath, I also don't think you need to rotate each letter in the word _BIG_ I think there is plenty going on already…\n\nBut what the hell do I know… hehe!\n\n"
    },
    {
      "time": "23 Jul 2008 — 2:53pm",
      "content": "Bobby: I really like your hand drawn version of \"little\" -- I could never do it that well!\n\nYou guys got me -- I picked Arial...I can't believe that it was me that made baby Jesus cry....I had no idea it was a faux pax. Eeek! :)\n\nSeriously, though, I'm having major trouble with my font selection (in general)  \nwhen I'm looking for something 'plain' to pair with a face that has some personality to it. Do you guys have a resource for this or is it just something you've come to know by instinct? Like, how do you know when picking a 'classic' typeface is good and when is it bad?\n\nAs for National -- I really like the font overall. I adore the LC letters but the UC letters (particularly the B-I-G together) don't seem interesting enough for me to use it in this logo. I think it would be great for a brochure job I'm working on, though. I love the depth of the family.\n\n"
    },
    {
      "time": "23 Jul 2008 — 5:11pm",
      "content": "I thought that about _National_, I think it would look good mainly as a text-face with Wendy!\n\nMaybe you got it right the first time. I always say there is no point trying to look for something _similar but different_ just because of the stigma attached to a certain typeface, In this case Gotham.\n\n**Jan** stuck up a great list of typefaces that can be alternatives to a plain typeface such as Helvetica. _[Helvetica Alternatives](http://web.archive.org/web/20131014001519/http:/www.fontshop.com/fontfeed/archives/helvetica-and-alternatives-to-helvetica)_.\n\nI personally like to look at blogs, take note of typefaces I like or maybe have a look at foundries until I find something that is suitable to a particular project. I then organise my suitcase as I build my collection. Any typeface I have in my suitcase I have spent time to organise and I don't just have them for the sake of it!\n\nI don't know if that made any sense... Rob!\n\n"
    },
    {
      "time": "23 Jul 2008 — 5:48pm",
      "content": "Great article and advice...thanks. I always enjoy learning more. As the principal of a 1 person studio it is hard to glean new information in a vacuum. I really appreciate the information, critiques, and support that I have found on these boards.\n\n"
    },
    {
      "time": "24 Jul 2008 — 1:36am",
      "content": "The thing I find hard about being a one person design team is getting out of bed... If anyone has advice on that please share! haha!\n\n"
    },
    {
      "time": "24 Jul 2008 — 11:48am",
      "content": "Maybe another one to consider is [Knockout](http://web.archive.org/web/20131014001519/http:/www.typography.com/fonts/font_overview.php?productLineID=100013)? I tried it out in the 54 Sumo weight really quick, and it has a wideness that contrasts with the script, and the quirky G might just be enough character to set it off without having to resort to rotated/quirkier/crazier type, since you already have the script going on.\n\n ![](http://web.archive.org/web/20131014001519im_/http:/typophile.com/files/littlebiglife_4902.jpg)\n\n"
    },
    {
      "time": "24 Jul 2008 — 12:04pm",
      "content": "The image didn't get posted to my reply.. trying it again:\n\n ![](http://web.archive.org/web/20131014001519im_/http:/typophile.com/files/littlebiglife_6202.jpg)\n\n"
    },
    {
      "time": "24 Jul 2008 — 12:39pm",
      "content": "The crossbar and spur of the Knockout G looks too \"arrow-y\" and competes with the larger shape, IMO. But I like the width of it.\n\n"
    },
    {
      "time": "24 Jul 2008 — 1:10pm",
      "content": "You're right---I had only been looking at the type. Maybe the 90s series, then? There, the crossbar & spur combination doesn't look as \"arrow-y\". But then it might just be too fat---you'd have to try it out (I don't have that weight).\n\n"
    },
    {
      "time": "25 Jul 2008 — 7:23am",
      "content": "I like Knockout -- this is the second time that I've been tempted into purchasing it. I might have to bite the bullet and go for it. I think the 90s series might be a good fit. Thanks.\n\n"
    },
    {
      "time": "25 Jul 2008 — 6:43pm",
      "content": "I think this could benefit from being done entirely by hand. The somewhat looser lines that will result might set this logo off.\n\n"
    },
    {
      "time": "26 Jul 2008 — 6:57am",
      "content": "Hi showandtell, I like your logo concept a lot.\n\nTry Tornac and Foco Black.  \nLess 'old America', but fresh and smart!\n\n ![](http://web.archive.org/web/20131014001519im_/http:/typophile.com/files/TryThat_6444.png)\n\n"
    },
    {
      "time": "26 Jul 2008 — 9:03am",
      "content": "I like your logo. Have you tried in red or blue. Nice colors that are seen well from the distance, you never know they will need signs. As for fonts you seem to be in the right track . cheers!\n\n"
    }
  ]
}
