{
  "id": "47649",
  "title": "Hebrew Typography",
  "forum": "gohebrew's blog",
  "tags": [

  ],
  "content": "Hebrew Typography is somewhat alone in the field of typographical design.\n\nFor example, Hebrew is all one case, unlike most Roman languages. There is no upper and lower case. Most traditional Hebrew type design has dominant or thicker horizontal stroke widths, compared to its less dominant or thinner vertical stroke widths. Therefore matching designs in Roman languages, like English, is extremely difficult or odd-looking compared to most traditional Hebrew type designs.\n\nAs more and more sans-serif designs become more prevalent in Roman languages, such as English, and non-Roman languages, such as Hebrew. An excellent example of this was type designer Boruch Gorkin’s work for Monotype Typography purchased by MicroSoft in the popular Helvetica-like design, “Ariel-Hebrew”.\n\nI created an original serif design inspired by “Ariel-Hebrew”, and called it, “Safed”, for WinSoft Ltd. of Grenoble, France and Adobe’s popular ME (Middle East) versions of its software products.\n\nAnother interesting typeface design issue unique to Hebrew is the eye movement factor found in the shapes of certain Hebrew letters.\n\nFor example, Henri Friedlander (the great Hebrew type designer of the sixties) told me a secret of good Hebrew type design. Although the “vov” Hebrew character shape is basically a single vertical stroke, with a short thicker horizontal stroke at the tip of the vertical stroke, nevertheless Friedlander insisted that the entire graphic shape should be slightly tilted, so the upper left-sided stroke “leans” to the left, and the vertical stroke is slightly closer to the right the further lower it goes.\n\nThe purpose of this design is for subtle eye movement, making the eye move rapidly across the page, from right to left, the direction of the reader’s eye in Hebrew.\n\nSimilarly, the “reish” and “tov” Hebrew character shape in older classic Hebrew type design are designed in such a way that the thin vertical stroke on the right-hand side does not reach the baseline, as if to stand slightly above the ground. The purpose of this again is to guide eye movement. By leaving a space between the baseline and the beginning of the letter form just above the baseline, emphasis is placed upon the thicker horizontal element of the “reish”, and downwards to the left-hand baseline element of the “tov”.\n\nUnfortunately, these qualities of eye movement has been lost by most Hebrew type designers today.\n\n",
  "author": "<a href=\"/web/20080725075909/http://typophile.com/user/18444\" title=\"View user profile.\">gohebrew</a>",
  "time": "<br>",
  "uid": "18444",
  "comments": [

  ]
}
