{
  "id": "4765",
  "title": "Building an OpenType font, where to start?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Okay, so along with the redesign for the magazines I work on, I'm going to rebuild our typefaces (Scala Sans and Scala) as OpenType fonts, to access all the small caps, etc. since we're switching to InDesign.   \n   \nI have no idea where to start.. I have been looking through the documentation in FontLab... it's abyssmal to say the least. I've opened a couple OpenType fonts, only to find a near indecipherable list of code terms for OpenType.   \n   \nI had to rebuild this font earlier in the year to unite all the family styles (the original Scala and Scala Sans were all pulled apart so that you don't jump to bold by clicking bold. Because most of the magazine text is written in Word prior to being laid out, it's imperative that the family function works correctly.) So I've got all my metrics, bitmaps, outlines already saved in FontLab, and united as families, but I don't know where to go from there.   \n   \nThis is the list of functions I want to include:   \n   \nStandard ligatures (ff, fi, fl, ffl, ffi)   \n   \nLining numerals   \n   \nNon-lining numerals   \n   \nSmall Caps   \n   \nMultiplication Symbol (this is used constantly in my texts, and needs to be present... can I define a discretionary alternate that says \"if number x number\" then \"number [multiply] number\"? There's probably about five or six discretionary rules I'd need to incorporate.   \n   \nThere's also a set of expert symbols that I'd like to incorporate as alternate/additional characters.   \n   \nThe range of weights will be regular, regular italic, bold, bold italic, black, black italic. Scala doesn't have a black italic caps, so I'll have to leave that out.   \n   \nBasically, I need some guidance. I've not done a lot of coding, and this seems pretty crazy, but if the House Industries guys can learn to do it, so can I!\n\n [‹ Different versions of Syntax](http://web.archive.org/web/20081121184824/http:/www.typophile.com/node/4730 \"Go to previous forum topic\") [Adobe InDesign vs. QuarkXPress ›](http://web.archive.org/web/20081121184824/http:/www.typophile.com/node/4588 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121184824/http://www.typophile.com/user/1256\" title=\"View user profile.\">seanglenn</a>",
  "time": "<br>",
  "uid": "1256",
  "comments": [
    {
      "time": " 13.May.2004 7.05pm",
      "content": "Urm. I'd love to advise, but FontShop's end user license doesn't permit you to modify their fonts. It reads:   \n   \n\"You agree not to modify, adapt, translate, reverse engineer, decompile, disassemble, alter, or otherwise attempt to discover the source code of the Software.\"   \n   \nSo you should contact FontShop and let them know you want OpenType versions of the fonts.   \n   \nThat aside, it would not be at all difficult to add a handful of OpenType features like those you're contemplating. You could indeed do a contextual alternate that substituted a multiplication symbol for an x in the manner you describe.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 13.May.2004 7.13pm",
      "content": "EULA aside, FontLab's documentation really leaves me in the dark. Where would one find this sort of documentation for adding OpenType features?   \n   \nI'll contact FontShop and see about an OpenType version of Scala and Scala Sans.\n\n"
    },
    {
      "time": " 13.May.2004 7.17pm",
      "content": "\\> \"You agree not to modify, adapt, translate, reverse engineer, decompile,   \n\\> disassemble, alter, or otherwise attempt to discover the source code of   \n\\> the Software.\"   \n   \nHmmm, I'm smelling a legal loophole: look at that \"otherwise\" and tell me if you think that everything before if would be forgiven in court if it were not to \"discover the source code\"...   \n   \nAnyway, loophole or no, I would advise Sean to \"just do it\" in such cases (as long as he: owns the original; and keeps the derivatives to himself).   \n   \nhhp\n\n"
    },
    {
      "time": " 13.May.2004 7.35pm",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>I find this in a FontFont/FontShop EULA on Veer's site (unfortunately we didn't get a hardcopy of the EULA specifically for our purchase, it's only available, as text and not as a download, as part of the purchase online process, there's no link to it on FontShop's site that I can find).   \n   \n\"You do have the right to modify and alter Font Software for your customary personal and business use, but not for resale or further distribution.\"   \n   \n [http://www.veer.com/help/license.aspx?eula=DET](http://web.archive.org/web/20081121184824/http:/www.veer.com/help/license.aspx?eula=DET)\\</font\\>\n\n"
    },
    {
      "time": " 13.May.2004 7.38pm",
      "content": "Hrant,   \n   \nFirst, the clause after the \"or\" clearly does not modify the first part of the sentence. But we can leave that to lawyers to debate, since neither of us is one.   \n   \nSecond, there are laws about inducing somebody to break a contract. \"Tortious interference\" IIRC from my business law class. Technically, you can be sued for this. I don't know that it applies when you merely advise somebody without giving them any incentives though. (note: revised this comment after thinking about if a few minutes.)   \n   \nThird, unless Sean commissioned FontShop to build Scala just for him (work for hire), he does NOT \"own the original\"; he owns a license to use it.   \n   \nAs for OT features in FontLab, I will post some comments later.   \n   \nT\n\n"
    },
    {
      "time": " 13.May.2004 7.46pm",
      "content": "Sean:   \n   \nThat's the EULA for Device Type; Veer doesn't sell FontShop fonts as far as I can tell.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 13.May.2004 7.53pm",
      "content": "Yes, I realized that, but it does reference FontShop as well, didn't know if it was the same as the FontFont EULA.\n\n"
    },
    {
      "time": " 13.May.2004 7.55pm",
      "content": "Interesting, I grabbed one of the free fonts from FontFont's website, and this is what it says in the license included therein:   \n   \n3. You agree that the Software, and all copies thereof, are owned by FSI and/or its suppliers, and its structure, organisation and code are the valuable trade secrets of FSI and/or its suppliers. You acknowledge that the Software is protected by the United States Copyright Law, by the copyright and design laws of other nations, and by international treaties. You agree to treat the Software as you would any other copyrighted material, such as a book. You may not copy the Software or Documentation, except as expressly provided herein. Any copies that you are permitted to make pursuant to this Agreement must contain the same copyright, trademark, and other proprietary notices that appear on or in the Software. You agree not to modify, adapt, translate, reverse engineer, decompile, disassemble, alter, or otherwise attempt to discover the source code of the Software. You agree to use trademarks associated with the Software according to accepted trademark practice, including identification of the trademark owner's name. Trademarks can only be used to identify printed output produced by the Software. The use of any trademark as herein authorized does not give you any rights of ownership in that trademark and all use of any trademark shall inure to the sole benefit of the trademark owner. Except as expressly provided herein, this Agreement does not grant you any right to intellectual property rights in the Software and its associated trademarks. **You do have the right to modify and alter Font Software for your customary personal and business use, but not for resale or further distribution.**   \n   \n_emphasis mine_\n\n"
    },
    {
      "time": " 13.May.2004 8.00pm",
      "content": "Huh? i can't find any reference to FontShop or FontFont in the Device EULA. Oh well....   \n   \nInteresting, but not shocking, that the free font EULA is different. I got the blurb I quoted by going partway through the purchase process on Scala Sans. Not that I was trying to catch you out or anything, just curious as to FontShop's policies on the matter. Always interesting to see what the competition is up to in their EULAs.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 13.May.2004 8.05pm",
      "content": "It still contains the same line about altering the fonts for personal and business use:   \n   \n [http://www.fontfont.com/cgi-bin/license.pl?f=1](http://web.archive.org/web/20081121184824/http:/www.fontfont.com/cgi-bin/license.pl?f=1)   \n   \nLook at section three. It's the same.   \n   \n(Thanks for the hint on finding the EULA!)\n\n"
    },
    {
      "time": " 13.May.2004 8.29pm",
      "content": "I've purchased a number of fonts form FontShop, and I've never been able to \\_find\\_ the EULA.   \n   \nI'm in Canada, so the EULA may be different, and since I wasn't made aware of it, its application seem...moot.   \n   \nI have relied instead on a little booklet called \"FontShop's Guide to Legal Typeface Use\" put out by FontShop Canada some time ago. It states that: \"most font manufactures will allow you the right to produce a modified [font]... subject to the same licensing requirements as the original font.\"   \n   \nNow, I haven't relied on this booklet for other foundries, but the booklet goes on to discuss a hypothetical swash version of a FS font, so it certainly strongly implies that modifications are permitted, at least in Canada.\n\n"
    },
    {
      "time": " 13.May.2004 8.30pm",
      "content": "Anyhow, back to the main question:   \n   \nOpen the \"OpenType\" panel in FontLab. The left side lists the OT features, the right side lists the code for the currently selected feature.   \n   \nClick on the \"+\" sign at the bottom left of the OT panel. This adds a feature. The feature will initially be called \"xxxx\".   \n   \nIn the right pane of the panel, you'll see the initial template of the feature code appear. Change the two occurrences of \"xxxx\" in the right pane \" to the feature you want. Let's say lowercase to small caps ('smcp').   \n   \nThe remaining line to change and expand on is this one:   \n   \n\\> sub by ;   \n   \nYou need to fill that out and duplicate it. Remember you're using glyph names to refer to the glyphs, so you'll need to use the same glyph names you're actually using in your font. A completed smcp feature might look like this:   \n   \nfeature smcp {   \nsub a by a.smcp ;   \nsub b by b.smcp ;   \nsub c by c.smcp ;   \nsub d by d.smcp ;   \nsub e by e.smcp ;   \nsub f by f.smcp ;   \nsub g by g.smcp ;   \nsub h by h.smcp ;   \nsub i by i.smcp ;   \nsub j by j.smcp ;   \nsub k by k.smcp ;   \nsub l by l.smcp ;   \nsub m by m.smcp ;   \nsub n by n.smcp ;   \nsub o by o.smcp ;   \nsub p by p.smcp ;   \nsub q by q.smcp ;   \nsub r by r.smcp ;   \nsub s by s.smcp ;   \nsub t by t.smcp ;   \nsub u by u.smcp ;   \nsub v by v.smcp ;   \nsub w by w.smcp ;   \nsub x by x.smcp ;   \nsub y by y.smcp ;   \nsub z by z.smcp ;   \nsub b.sans by b.smcp ;   \nsub d.sans by d.smcp ;   \nsub h.sans by h.smcp ;   \nsub i.sans by i.smcp ;   \nsub j.sans by j.smcp ;   \nsub k.sans by k.smcp ;   \nsub l.sans by l.smcp ;   \nsub m.sans by m.smcp ;   \nsub n.sans by n.smcp ;   \nsub p.sans by p.smcp ;   \nsub r.sans by r.smcp ;   \nsub u.sans by u.smcp ;   \n} smcp;   \n   \nA completed liga feature might be something like this:   \n   \nfeature liga { # ligatures on by detault   \n sub f f i by ffi ;   \n sub f f l by ffl ;   \n sub f f by ff ;   \n sub f i by fi ;   \n sub f l by fl ;   \n sub f j by f\\_j ;   \n sub t f by t\\_f ;   \n sub f t by f\\_t ;   \n sub T h by T\\_h ;   \n sub T h.sans by T\\_h ;   \n sub Tcommaaccent h by Tcommaaccent\\_h ;   \n sub Tcommaaccent h.sans by Tcommaaccent\\_h ;   \n sub Tcaron h by Tcaron\\_h ;   \n sub Tcaron h.sans by Tcaron\\_h ;   \n sub t t by t\\_t ;   \n} liga;   \n   \nPlease note that ffi and ffl should precede the two-letter ligatures. Otherwise the two letter ones will get processed, and you'd need to make them input into the three-letter ones. Simpler just to order them differently.   \n   \nYou'll also be noting that initial white space in a line doesn't matter, that anything after a # sign is ignored as just a comment, and that every line after the first MUST end in a semicolon. Failure to include a semicolon is the most common reason for a feature to fail to compile. Referring to a glyph name that doesn't exist (or got changed) is the next most common reason.   \n   \nSo hit the compile button regularly to check that you haven't messed anything up. It's the little stack of sheets with the down arrow on it.   \n   \nThe numbers work pretty much the same as the other stuff. The one remaining feature that is complicated is your multiplication substitution.   \n   \nThis code ought to work, though I haven't tested it. Luckily you don't have more than one glyph of backwards context, so you won't be affected by the clarification/change in the definition of how that's processed:   \n   \nfeature calt { # contextual alternates   \n sub [zero one two three four five six seven eight nine] x' [zero one two three four five six seven eight nine] by multiply   \n} calt;   \n   \nNow, you could clean up that code by defining a class for the digits. Also, you might need to extend it to cover the other number forms (oldstyle and any others you have).   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 13.May.2004 8.33pm",
      "content": "I do suggest that you only cover the lowercase x in the contextual substitution for the multiplication sign. There are times when one actually wants to mix numbers and letters, but usually those are uppercase letters.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 13.May.2004 8.46pm",
      "content": "John's right. I didn't read the entire EULA -- entirely my fault. (Repro'd below for the curious.) First it says you can't modify the fonts, then it says you can. Go figure.   \n   \n   \nFSI End-User License Agreement   \n   \nNotice to the User:   \n   \nThis is a contract. By downloading this font software, you accept all the terms and conditions set forth below.   \n   \nThis package contains software (\"Software\") and related documentation (\"Documentation\"). As used herein, \"Licensed Unit\" means up to five (5) computers at a single geographic location. As used herein, \"Font Software\" means coded and encrypted Software that generates typeface designs when used with the appropriate hardware and software.   \n   \nFSI grants you a non-exclusive license to use the Software and Documentation, provided that you agree to the following:   \n   \nUse of the Font Software   \n1. You may install and use Font Software in a Licensed Unit for the purpose of reproducing typeface designs. If the number of computers with which you want to use Font Software exceeds those set forth in the definition of Licensed Unit above, then you must notify FSI or your FontFont distributor and request an appropriate site license covering all units in which Font Software will be used or stored and for which an additonal fee will be charged. You may make one back-up copy of Font Software for archival purposes only, and you shall retain exclusive custody and control over such copy. The license granted herein is effective until terminated. FSI has the right to terminate your license immediately if you fail to comply with any term of this Agreement. Upon termination, you must destroy the original and any copies of the Software and Documentation.   \n   \n2. You may take a digitized copy of the Font Software used for a particular document to a commercial printer or service bureau for use by the printer or service bureau in printing such document but only if the printer or service bureau represents to you that it has purchased or been granted a license to use that particular Font Software. You may include the Font Software in a document for the sole purpose of printing or viewing such document, but you may not distribute the document with the Font Software included to third parties, e.g. on Internet, CD-ROM. If you intend to use the Font Software in such cases you must request and receive from FSI or your local distributor a special License Agreement for which an additional fee will be charged.   \n   \n3. You agree that the Software, and all copies thereof, are owned by FSI and/or its suppliers, and its structure, organisation and code are the valuable trade secrets of FSI and/or its suppliers. You acknowledge that the Software is protected by the United States Copyright Law, by the copyright and design laws of other nations, and by international treaties. You agree to treat the Software as you would any other copyrighted material, such as a book. You may not copy the Software or Documentation, except as expressly provided herein. Any copies that you are permitted to make pursuant to this Agreement must contain the same copyright, trademark, and other proprietary notices that appear on or in the Software. You agree not to modify, adapt, translate, reverse engineer, decompile, disassemble, alter, or otherwise attempt to discover the source code of the Software. You agree to use trademarks associated with the Software according to accepted trademark practice, including identification of the trademark owner's name. Trademarks can only be used to identify printed output produced by the Software. The use of any trademark as herein authorized does not give you any rights of ownership in that trademark and all use of any trademark shall inure to the sole benefit of the trademark owner. Except as expressly provided herein, this Agreement does not grant you any right to intellectual property rights in the Software and its associated trademarks. You do have the right to modify and alter Font Software for your customary personal and business use, but not for resale or further distribution.   \n   \n4. You may not rent, lease, sublicense, give, lend, or further distribute the Software or Documentation, or any copy thereof, except as expressly provided herein. You may transfer all your rights to use the Software and Documentation to another person or legal entity provided that (i) the transferee accepts and agrees to be bound by all the terms and conditions of this Agreement, and (ii) you destroy all copies of the Software and Documentation, including all copies stored in the memory of a hardware device. Without limiting the generality of the foregoing, you agree that you will not distribute or disseminate all or any part of the Software through any on-line service and you further agree that any such intentional distribution shall constitute a theft by you of a valuable property of FSI and/or its suppliers.   \n   \n5. FSI warrants to you that the Software will perform substantially in accordance with the Documentation for the ninety (90) day period following your receipt of the Software. To make a warranty claim, you must return the Software to the location from which you obtained it along with a copy of your sales receipt within such ninety (90) day period. If the Software does not perform substantially in accordance with the Documention, the entire and exclusive liability and remedy shall be limited to either, at FSI's option, the replacement of the Software or the refund of the license fee you paid for the Software. FSI and its suppliers do not and cannot warrant the performance or results you may obtain by using the software or documentation. The foregoing states the sole and exclusive remedies for FSI's or its suppliers breach of warranty. Except for the foregoing limited warranty, FSI and its suppliers make no warranties express or implied, as to non-infringement of third party rights, merchantability, or fitness for any particular purpose. In no event will FSI or its suppliers be liable to you for any consequential, incidental or special damages, including any lost profits or lost savings, even if a FSI representative has been advised of the possibility of such damages, or for any claim by any third party.   \nSome states of jurisdictions do not allow the exclusions or limitations of incidental, consequential or special damages, so the above exclusion may not apply to you. Also, some states or jurisdictions do not allow the exclusions of implied warranties or limitations on how long an implied warrenty may last, so the above limitations may not apply to you. To the extent permissible, any implied warranties are limited to ninety (90) days. This warranty gives you specific legal rights. You may have other rights that vary from state to state or jurisdiction to jurisdiction. For further warranty information, please contact FSI.   \n   \n6. You agree that this Agreement will be governed by the laws of Germany applicable to contracts wholly performable within such state. This agreement will not be governed by the United Nations Convention of Contracts for the International Sale of Goods, the application of which is expressly excluded. If any part of this agreement is found void and unenforceable, it will not affect the vailidity of the balance of the Agreement, which shall remain valid and enforceable according to its terms. You agree that the Software will not be shipped, transferred or exported into any country or used in any manner prohibited by the United States Export Administration Act or any applicable export laws, restrictions or regulations. This Agreement shall automatically terminate upon failure by you to comply with its terms. This Agreement may only be modified in writing signed by an authorized officer of FSI.   \n   \n7. If this product is acquired under the terms of a (i) GSA contract - use, reproduction or disclosure is subject to the restrictions set forth in the applicable ADP Schedule contract, (ii) Dod contract - use, duplication or disclosure by the Government is subject to restrictions set forth in subparagraph (c) (1) (ii) of 252.277-7013; (iii) Civilian agency contract - use, reproduction, or disclosure is subject to 52.277-19 (a) through (d) and restrictions set forth in the accompanying End User Agreement.   \n   \nFontFont is a trademark of FSI in the US and elsewhere. Macintosh is a registered trademark of Apple Computer, Inc. Windows is a trademark of Microsoft Corporation. FSI Fonts and Software GmbH, Bergmannstr. 102, 10961 Berlin, Germany FSI Fonts and Software USA Inc., 60 Tehama Street, San Francisco, CA 94105 USA   \n   \nFor U.S. customers: Tel: (415) 512-2093, Fax: (415) 512-2097   \nOther countries: Tel. +49 (30) 693 7022, Fax. +49 (30) 692 8443\n\n"
    },
    {
      "time": " 13.May.2004 8.47pm",
      "content": "Oops, some cross-posting there. Oh well.   \n   \nT\n\n"
    },
    {
      "time": " 13.May.2004 9.09pm",
      "content": "\\> there are laws about inducing somebody to break a contract.   \n   \nYou should see how I drive.   \n   \nhhp\n\n"
    },
    {
      "time": " 13.May.2004 10.38pm",
      "content": "Thanks Tom, for answering the original question...finally! But your answer seems to begin with the assumption we're working on an existing OT font. Please give us a procedure for taking, say, a TT or Type 1 font (that's our own--legal!)and turning it into OT and adding those very first OT features. I'm not even sure yet how to add the extra glyph slots to accomodate the extra characters being added, or how to properly identify the new slots in a way that InDesign will recognize each one as the one I'm calling for (as you can see, I haven't entered this particular arena at all yet).   \nThanks,   \nLeslie\n\n"
    },
    {
      "time": " 13.May.2004 11.43pm",
      "content": "I'm not assuming that it's already an OT font. I am however assuming that all the glyphs are in one font and are named correctly.   \n   \nS'funny, I was just about to say, I wish Leslie's book was out, since it probably covers this!   \n   \nThere are probably faster ways of doing this, but one way of merging glyphs is:   \n   \n1) Open all the relevant fonts.   \n   \n2) For the fonts that have supplemental glyphs, rename them in that font. You can rename a currently selected glyph in the glyph window by digging through the menu commands or just hitting Cmd/Ctrl-\\   \n Note the handy \"next glyph\" button in the glyph renaming dialog. This allows you to cycle through renaming a bunch without having to keep on hitting the rename command again.   \n Note also that one could script this sort of thing. I think Adam Twardoch at his steroids.fontlab.com site has a handy script that does stuff like sticking a given suffix onto a bunch of glyph names. Could be great for this kind of thing.   \n   \n3) After you have all the glyphs renamed, select them all, and hit copy. Switch to the other font, and do a contextual click in the main window, and choose \"append.\" Whammo, they're all there.   \n   \nNow you can do the OT programming.   \n   \nAs for how to name glyphs, that's a whole 'nother story.... But one that has been addressed here at length in other threads.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 13.May.2004 11.50pm",
      "content": "Hmmm. One problem with the above workflow is that it doesn't address getting the kerning from the supplemental fonts into the main font. Probably AFTER you rename the glyphs, you would need to export kerning in the form of an AFM or something, and then after appending the glyphs into the master font, import the AFM kerning.   \n   \nT\n\n"
    },
    {
      "time": " 14.May.2004 4.44am",
      "content": "Sean --   \n   \nDespite the confusion and/or contradictions in the FF EULA, I would suggest contacting FontFont first and asking permission to make an OT version for the use of your company. It would just be good form.   \n   \nYou might find that they have already done so for another client or that they are currently working on it and would be able to get you copies easily. Or you may find that they'd be happy to do the work for you at a reasonable rate. On the other hand, they might say Hey, better you than us, Fine, Go for it, and Good luck.   \n   \nDespite the fact that Thomas was actually able to make it sound relatively easy in theory (good job Thomas, as always), it will still be a fair amount of work in practice -- especially troubleshooting and making sure that all the fonts work reliably before you stake your entire production cycle on them (!).   \n   \nIf your publisher is investing all the time and effort in a redesign, it might be worth having the OT fonts developed professionally. Any cost is likely to be negligible within the context of the whole. Redesigning a magazine and totally revamping editorial/design workflows is complicated enough without adding detailed technical font production to the process. I would suggest exploring getting FontFont to do this for you.   \n   \nUnless of course, you don't have anything better to do and your employer doesn't mind paying for your learning curve ;-) (But do ask first.)   \n   \n-- Kent.\n\n"
    },
    {
      "time": " 14.May.2004 5.50am",
      "content": "Sean: You may know about this, but if not, join.   \n [http://groups.msn.com/fontlab/](http://web.archive.org/web/20081121184824/http:/groups.msn.com/fontlab/)   \n   \nThomas: Thanks that was helpful and overdue at typophile.   \nHrant: As you state at Daidalia, here, imagination is better than fact :-)   \nKent: Good reminder. I'm a chronic do-it-your-selfer.\n\n"
    },
    {
      "time": " 14.May.2004 5.59am",
      "content": "This EULA is, incidentally, a classic example of everything that is wrong with legal drafting in the software industry. Whatever it is supposed to mean, as an attempt at producing a clear statement of rights and responsibilities, it is a disgrace.   \n   \nWhen you buy a font, you are buying the right to use it, in certain defined ways. It ought not to be necessary to go back later and ask \"What can I do?\" It ought to be as clear as it can be. As it stands, it is not. Instead it looks as if boilerplate language from some other software licence, or probably a number of them has been pressed into service.   \n   \nIt really ought not to be difficult to provide a simple list: things you may do; things you must not do. These should be clearly set out in a file that accompanies the font files so that it is always accessible.   \n   \nIf type-designers and digital foundries wish to maintain their rights and earn a fair return on their investment -- which seems to me to be a perfectly reasonable ambition -- they really ought to give more thought to the fact that a transaction whereby they licence the use of their product has two sides. The purchaser has to be getting something: and that something needs to be clearly defined.\n\n"
    },
    {
      "time": " 14.May.2004 6.46am",
      "content": "Randy --   \n   \nI too am an inveterate do-it-myselfer. But as I get older and technology gets harder to keep up with, I am slowly recognizing the value of letting others do what they've spent time learning to do best, so that I can focus on what I know (and like to do) best.   \n   \nRegardless, I've also learned that it is good karma to When in Doubt, Ask First. I've been pleased to experience how when you treat others with respect and professional courtesy, you get treated in kind.   \n   \nI've had several recent experiences where I've had a publishing client ask me to make modifications to commercial fonts (minor mods -- nothing like an OT overhaul which would be beyond me at this point) and I've had very cordial and permissive interactions with Scriptorium, Bitstream, Carter & Cone, and Hoefler. It has also provided the opportunity to educate the client about licenses. Good karma all around.   \n   \n-- K.\n\n"
    },
    {
      "time": " 14.May.2004 7.09am",
      "content": "Kent   \n   \nI'm sure that \"when in doubt, ask\" is an excellent motto, and that professional courtesy is a good thing too. I also think there are areas where good manners (especially good professional manners) may cause one to do things that the law does not require.   \n   \nBut contracts are not for nice people. Nice people usually don't need legal intervention. They are for nasty people, for selfish people, and for cases of dispute: for OW Holmes's \"bad man\" -- the \"bad man\" who might misuse a typeface, and the \"bad foundry\" which might behave unreasonably. Contracts matter most precisely where \"good manners\" are breaking down. From that point of view, they really ought to be clear about what is and is not permissible. In other words, there really ought not to be much doubt, either way. The boundaries of what the selfish user can do and the selfish producer demand ought to be clear.   \n   \nThe decent user may appreciate that some things, while legal, are not quite acceptable. The decent foundry may understand that some things, while not expressly permitted, are reasonable. Each may accommodate the other. But it is wrong in principal that this should happen because the EULA is unclear, or inaccessible, or self-contradictory, or confused if that can be avoided.\n\n"
    },
    {
      "time": " 14.May.2004 9.13am",
      "content": "_\\>Contracts matter most precisely where \"good manners\" are breaking down. From that point of view, they really ought to be clear about what is and is not permissible. In other words, there really ought not to be much doubt, either way._    \n   \nPaul -- You're absolutely right and will get no argument from me. The current state of EULAs is abysmal. My comments weren't really a response to your post, although I can see how the chronology may have suggested such.   \n   \n-- Kent.\n\n"
    },
    {
      "time": " 14.May.2004 9.27am",
      "content": "I think asking for permission is generally good practice, but it's also dangerous: there are people out there who are unreasonable, unwilling to compromise, and getting a permission rejected would put you in an unfair bind. So one good tactic might be to ask around about the general behavior of the party in question, and only ask permission if you find no reason to believe that they're nasties. It might sound Machiavellian (although he was a softie compared to today's politicians), but there's a reason for a reputation preceding somebody, and society needs reasonable individuals.   \n   \nhhp\n\n"
    },
    {
      "time": " 14.May.2004 10.48am",
      "content": "Kent, I have contacted FontFont, but the EULA specifically states that I am allowed to modify the fonts, so I'm sure that I'm 100% in the clear.   \n   \nWe're a small magazine, and a lot of us wear a lot of hats, and mine is going to be the \"fix the fonts\" guy, although as art director, it's my choice to take on this project.   \n   \nMy plan is to take this project slowly, testing at every stage, and then implementing the fonts when they are finished, and not before. I'm excited to learn FontLab and OpenType on a real project, and not just some theoretical practice. We probably won't even be using the OpenType versions for a couple production cycles.\n\n"
    },
    {
      "time": " 14.May.2004 10.54am",
      "content": "\\> the EULA specifically states that I am allowed to modify the fonts   \n   \nI thought it stated both.   \nWhich means: the lawyers have it.   \n   \nhhp\n\n"
    },
    {
      "time": " 14.May.2004 11.06am",
      "content": "I can't seem to find my copy of the FontShop EULA can someone point me to it, or at least post the PDF? According to a comparison chart that I have, FontShop does allow modifications, but I'd like to see the EULA just because I'm paranoid.   \n   \nFrom memory: Be aware that most Foundries that do allow modifications also consider the modified fonts as 1 of the 5 installable copies. Meaning if you modify the fonts and install those modified fonts onto 2 cpu you may only use the non-modified on 3 cpu.\n\n"
    },
    {
      "time": " 14.May.2004 11.49am",
      "content": "I posted the whole dad-blamed thing earlier in this thread.   \n   \nT\n\n"
    },
    {
      "time": " 14.May.2004 12.31pm",
      "content": ":p -- I'm blind. Thanks, T.\n\n"
    },
    {
      "time": " 14.May.2004 4.16pm",
      "content": "In relation to the article I've written on the EULA I contacted the various foundries which we added to our chart. FSI was among those emailed. From Berlin, Ms. Marekowa wrote:\n\n> * * *\n> **quote:**\n> \n> modifications: yes, for customary personal and business use, not   \n> for resale or further distribution\n> \n> * * *\n"
    },
    {
      "time": " 14.May.2004 4.18pm",
      "content": "That said, I would still contact them. I agree that contacting the foundries is good form.\n\n"
    },
    {
      "time": " 14.May.2004 5.25pm",
      "content": "_This is the list of functions I want to include:   \nStandard ligatures (ff, fi, fl, ffl, ffi)_      \n   \nI discovered recently that if you include the ff, ffi, and ffl ligatures in a Type 1 font and name them \"ff,\" \"ffi,\" and \"ffl,\" InDesign finds them and automatically uses them when you type those sequences of characters, just the way the fi and fl ligatures work in both InDesign and Quark.   \n   \n(I tried it with a TrueType version of the font, but it didn't work.)\n\n"
    },
    {
      "time": " 14.May.2004 5.43pm",
      "content": "Interesting... isn't the standard glyph naming for those supposed to be f\\_i, f\\_l, f\\_f\\_i, f\\_f\\_l etc?   \n   \nCool to know though!   \n   \nDoes anyone know how to export kerning metric info for a selected range of characters in FontLab? Obviously I'll need to do that (and import it as well) for the small caps, etc. The manual is horribly dense, and I can't find that info. It seems as though I could delete all the glyphs I am not using, then export the metrics from that file (although I'm not sure if the metrics are tied to the glyph, or the glyph name... that could be confusing), then import them into my file that contains both the standard glyphs, and the small caps glyphs, it seems like FontLab will match them up. Any suggestions?   \n   \nTiffany, I don't know if I agree that it's necessary to contact the foundry when the EULA specifically states that you are allowed to modify your own files. Why waste everyone's time?\n\n"
    },
    {
      "time": " 14.May.2004 5.45pm",
      "content": "_...just the way the fi and fl ligatures work in both InDesign and Quark._   \n   \nWell, Quark on the Mac, anyway. QuarkXPress on Windows doesn't do ligatures -- not even fi and fl -- in normal fonts. InDesign on Windows does the basic ligatures even in Type 1 fonts, as long as they are present and named correctly (which they generally are, they're just unencoded).   \n   \nOf course, \"expert set\" fonts work fine in QXP, even on Windows.   \n   \nT\n\n"
    },
    {
      "time": " 15.May.2004 6.25am",
      "content": "_\\>Tiffany, I don't know if I agree that it's necessary to contact the foundry when the EULA specifically states that you are allowed to modify your own files. Why waste everyone's time?_   \n   \nSean, this is only my opinion: It is a matter of the degree or nature of the modification. If a EULA allows modification for personal use and you wish to adjust the leg of the R to fit a particular dept head style you're creating throughout a pub-- fine. Or perhaps you want to rearrange the OS figures out of an expert set into the regular font as a matter of convenience -- okay.   \n   \nBut (again, my opinion), to convert an entire complex font family to a different format and add features is a different degree of modification. Many EULAs (even those that allow for personal mods, I believe) do prohibit recompiling or converting into different formats -- i.e., creating an entirely different software program -- without permission.   \n   \nI'm not saying don't go ahead with your plan. That's your choice. I'm just explaining why I personally might choose to spend the time communicating with the foundry.   \n   \nAs a personal example: Recently a project at my publisher required (at the last minute) an instance of italic for a title citation in text that was spec'ed in a face that did not have an italic version. I was asked to quickly create an oblique for them. I contacted Bitstream to get permission first. Jim Lyles informed me that in fact they had already done this for another client, but had not planned on releasing the oblique version for commercial release. He offered to send me the data if I wanted or I could go ahead and make my own if I preferred (for exclusive use by this one client, obviously). The exchange took but a few e-mails and it was not a waste of everyone's time. No deadlines missed; good relations all around.   \n   \n-- K.\n\n"
    }
  ]
}
