{
  "id": "47655",
  "title": "Font Conference (funny video)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Not sure if this is a re-post, but enjoy guys...  \n [Conference](http://web.archive.org/web/20131107174701/http:/www.collegehumor.com/video:1823766)\n\n",
  "author": "Prakash Nair",
  "time": "22 Jul 2008 — 8:28pm",
  "uid": "10437",
  "comments": [
    {
      "time": "22 Jul 2008 — 9:46pm",
      "content": "\"Mailbox...open mailbox!\"\n\nIt's pretty funny, though the type snob in me wishes that the creators knew something more about the typefaces they mentioned beyond their names :-)\n\n"
    },
    {
      "time": "22 Jul 2008 — 9:49pm",
      "content": "Very well done. Beats many of the typophile film fest flicks (IMHO) and Comic Sans the hero! Who would have expected that?\n\n"
    },
    {
      "time": "23 Jul 2008 — 9:22pm",
      "content": "Yeah, it would be nice if they knew there are fonts that didn't come with their computer. It's a damn shame to start a sketch about typefaces having a debate and then miss the chance to depict Helvetica stating his complete neutrality on the issue.\n\n"
    },
    {
      "time": "24 Jul 2008 — 8:59am",
      "content": "I also wish they had fleshed out the characters with more than just their names. Baskerville should have been English. Futura's portrayal bothered me the most. But I guess they were trying to appeal to a wider audience (it is, after all, posted on CollegeHumor). Courier New saying \"do we really need Courier?\" was awesome, though, and Wingdings was hilarious. \"Mailbox! Mailbox! MAAILBOXX!\"\n\n"
    },
    {
      "time": "24 Jul 2008 — 3:27pm",
      "content": "Even though it was supposed to just be a joke on \"Narrow\", depicting Arial as ignorant trash was a nice coincidence.\n\nThe real Futura would be a slim German in a black turtleneck and little round glasses. Comic Sans would be a drunken middle-aged woman with an annoying laugh trying to sell homemade crafts. Since he was mentioned, I picture Zapf Dingbats as a cheerful portly man with a handlebar moustache wearing a monocle and bright purple tuxedo with white gloves, communicating entirely in mime.\n\n"
    },
    {
      "time": "26 Jul 2008 — 12:55pm",
      "content": "Gotham should have been the hero.\n\nWhat would Ed Interlock look like?\n\nBodoni?\n\nImpact?\n\n"
    },
    {
      "time": "26 Jul 2008 — 11:52pm",
      "content": "And if they were basing it on names alone, they seriously missed an opportunity with Akzidenz-Grotesk.\n\n"
    },
    {
      "time": "28 Jul 2008 — 12:01pm",
      "content": "French Script's accent was so campy. Wingdings took the show for me though. Mailbox! Open Mailbox!\n\n"
    },
    {
      "time": "16 Aug 2008 — 9:14am",
      "content": "A former student of mine sent me this when it first came out. My first curiosity was wondering what typefaces they chose. When I saw the selection I knew that the director or writer's only knowledge of \"fonts\" came from Microsoft Word. All the chosen faces are readily available and constantly mangled by the PC users of the world. Obviously the target for the piece was those very users, not designers.\n\nI'm curious what it would have looked like and how inside the jokes would have been had it been written and produced by true typophiles. Not to mention the palette of faces.\n\nNot type related, but if you've never seen the first couple of installments of \"Truth in Advertising\" you'll appreciate the industry inside humor: [http://www.youtube.com/watch?v=j50Xd40EfJg](http://web.archive.org/web/20131107174701/http:/www.youtube.com/watch?v=j50Xd40EfJg \"http://www.youtube.com/watch?v=j50Xd40EfJg\") Beyond episode two the joke wears thin.\n\n[http://typographyshop.com](http://web.archive.org/web/20131107174701/http:/typographyshop.com/ \"http://typographyshop.com\")  \n [http://kinggroupmedia.com](http://web.archive.org/web/20131107174701/http:/kinggroupmedia.com/ \"http://kinggroupmedia.com\")\n\n"
    }
  ]
}
