{
  "id": "47652",
  "title": "Unused logos - what do you do with them?",
  "forum": "Design",
  "tags": [

  ],
  "content": "A quick poll, what does everyone do with their unused logos? Some say they use them for ’spare parts’, others for inspiration, others say they it’s cheating to use them again.\n\n [‹ Margins - for an annual report](http://web.archive.org/web/20081121180233/http:/www.typophile.com/node/47736 \"Go to previous forum topic\") [High-end, luxury type replacement for Times New Roman? ›](http://web.archive.org/web/20081121180233/http:/www.typophile.com/node/47684 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121180233/http://www.typophile.com/user/34210\" title=\"View user profile.\">wilsonws309</a>",
  "time": "<br>",
  "uid": "34210",
  "comments": [
    {
      "time": " 22.Jul.2008 4.39pm",
      "content": "And others think it’s wrong to discuss them... my apologies in advance :)\n\n[http://incspring.com](http://web.archive.org/web/20081121180233/http:/incspring.com/ \"http://incspring.com\")  \nBuy and Sell Corporate Brands on IncSpring.  \nWe’re brand new... Launched July 2008.\n\n"
    },
    {
      "time": " 22.Jul.2008 4.53pm",
      "content": "Nice spam?\n\n—————  \n**Paul Ducco**  \n [Graphic Design](http://web.archive.org/web/20081121180233/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 22.Jul.2008 5.10pm",
      "content": "Sorry, not trying to spam. Should have left off my signature before.\n\n"
    },
    {
      "time": " 22.Jul.2008 7.47pm",
      "content": "Well whatever anyones opinion about ’recycling’ old logos - selling them is just wrong. And even more so if you buy them! What a farce.\n\n"
    },
    {
      "time": " 22.Jul.2008 11.11pm",
      "content": "How so, jayyy?\n\n"
    },
    {
      "time": " 23.Jul.2008 5.17am",
      "content": "yeah; it is wrong. completley wrong.\n\n® ɯɐs ʎʞɔıɹ™\n\n"
    },
    {
      "time": " 23.Jul.2008 10.48am",
      "content": "Explain.\n\n"
    },
    {
      "time": " 23.Jul.2008 12.04pm",
      "content": "“Sorry, not trying to spam.”\n\nBut you are.\n\n"
    },
    {
      "time": " 23.Jul.2008 11.14pm",
      "content": "Recycling is the way, but not reselling :) I’d usually just incorporate them into new designs as fru fru.. on the background etc. :D sometimes if i really like the logo I include it on my portfolio :)\n\n"
    },
    {
      "time": " 24.Jul.2008 6.44pm",
      "content": "Clashmore:\n\nWhen working in identity development the standards we should aspire to is a tailor-made design solution in response to a clients’ communication problem. This recycling of logos is a reverse engineered idea where the designer (or client) browses unused concepts and logos and picks one based purely on aesthetics.\n\nTHAT is more like browsing in a Goodwill store for an identity than design.\n\nDesign is a process between client and designer and choosing a ’brand’ from hacked old and unused logos is a farce and, I believe, unethical.\n\nIf a designer is lucky enough to be able to find an unused concept that BEST FITS a new project, well good for them. But selling them - please.\n\n"
    },
    {
      "time": " 24.Jul.2008 7.14pm",
      "content": "I think that it may be silly to buy a random unused brand rather than work one-on-one with a designer to come up with the best possible representation of their company, I don’t see any way that it is unethical.\n\nRidiculously dumb, maybe. But if someone wants to sell and someone wants to buy, then win-win for them, I suppose.\n\nI personally use my ’unused’ logos in personal portfolios, or just keep them for possible inspiration later on.\n\n"
    },
    {
      "time": " 24.Jul.2008 7.25pm",
      "content": "Unethical was a bad choice of word. But I feel that certain relationship is founded between a client a a designer during the design process and the by products of that should not be sold.\n\nEach to their own. It just ain’t for me.\n\n"
    }
  ]
}
