{
  "id": "47694",
  "title": "Font Embedding Licenses",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello everyone. I'm new the world of type, so please forgive my ignorance.\n\nAs part of a major re-brand, my company is looking to adopt a relatively unique font family which can be used in all of our collateral. The font which has most appealed to us so far is Whitney and, whilst we are definitely willing to pay for the 2 licenses needed for our designer and server to host the font files, I've been told that, if we want to use the font in our distributed PDFs, we need to pay an additional $150 per year per font variant. These kind of figures amount to being way too much and i'm thinking it makes much more sense to have a custom font developed.\n\nUnfortunately, though, we don't have much time available to us and using a ready-made font family makes much more sense.\n\nMy questions to all of you typophiles are...\n\n1. Will we face the same problem with all fonts or was this unique to Whitney?  \n2. What solutions are available to us?\n\nMany thanks for your time and input.\n\nFahed\n\n",
  "author": "FahedBizzari",
  "time": "23 Jul 2008 — 11:15pm",
  "uid": "34288",
  "comments": [
    {
      "time": "24 Jul 2008 — 1:47am",
      "content": "Hi there\n\nI found a piece concerning this on the web (ITC fonts).  \n [http://www.itcfonts.com/About/Embedding.htm](http://web.archive.org/web/20150122202340/http:/www.itcfonts.com/About/Embedding.htm \"http://www.itcfonts.com/About/Embedding.htm\")\n\nBut hope someone else has definite answers. Interesting questions.\n\nBut hope this helps.\n\nRay\n\n"
    },
    {
      "time": "24 Jul 2008 — 3:39am",
      "content": "Each foundry makes its own determination about what to allow in its agreement. See this:  \n [http://typophile.com/node/13840](http://web.archive.org/web/20150122202340/http:/typophile.com/node/13840 \"http://typophile.com/node/13840\")\n\nI would say most allow embedding in a PDF, H&FJ charge extra for that. If that's a deal breaker, then start looking at fonts from FontFont, OurType or Adobe, to name a few.\n\n"
    },
    {
      "time": "24 Jul 2008 — 8:32am",
      "content": "see also this new resource hosted by Ascender - [www.fontembedding.com](http://web.archive.org/web/20150122202340/http:/www.fontembedding.com/ \"www.fontembedding.com\")\n\nI agree with John, in that most font vendors allow their fonts to embedded in PDFs that can be publically redistributed, but H&FJ are not that unusual. In addition they have an excellent licensing FAQ that lays it all out.\n\n[www.fontembedding.com](http://web.archive.org/web/20150122202340/http:/www.fontembedding.com/ \"www.fontembedding.com\") also hosts a chart of 30 vendors and their positions on embedding.\n\n"
    },
    {
      "time": "24 Jul 2008 — 10:31am",
      "content": "Thank you all so very much for your contributions. They're all very encouraging.\n\nThankfully, it seems we can still go ahead, just not with H&FJ on this one.\n\nMany thanks to all once again.\n\n"
    },
    {
      "time": "24 Jul 2008 — 6:20pm",
      "content": "I'm seeing a red flag. It's the discrepancy between \"Major re-brand\", \"requisite 2 licenses\" and \"server to host the font files\".\n\nHow many employees will be using the fonts to make documents? How many people will use templates, company forms and collateral that require the use of the fonts? Will all of them require the fonts themselves, or will company graphics using the fonts be converted to outlines?\n\nI ask all these questions because most \"major re-brands\" require a considerably more extensive licensing arrangement than 2 copies of the fonts. Hosting fonts on a server doesn't replace the necessity for all users of the fonts to be licensed. If 50 people throughout the company need to have access to the fonts to make documents, there will be many more than 2 licenses required.\n\nIt might be useful to ascertain all the potential uses your company would make of the fonts, and then get appropriate pricing for retail fonts, and compare that to pricing for custom fonts. Custom fonts have the advantage that nobody ever needs to upgrade licenses or get new licenses; the fonts can be distributed freely within the company that owns them. In the case of exclusive custom fonts, you could host them on a server and allow employees to download them at will. However the fonts are a more valuable asset as exclusive property, and need to be kept within the company.\n\n"
    },
    {
      "time": "24 Jul 2008 — 9:04pm",
      "content": "Crossgrove... many thanks for your comments.\n\nAt the moment, only 2 licenses would be needed. The first would be for web-based sIFR and the second would be on our designer's machine. You are right, though, that we will need to get the font onto other machines as well.\n\nI also value your points about the advantages which custom fonts bring and this is something which we are definitely considering.\n\nMaybe you can give me a rough idea on (a) how long it takes and (b) how much it costs to develop a custom family of fonts.\n\nThanks again.\n\n"
    },
    {
      "time": "25 Jul 2008 — 10:01am",
      "content": "Ah, sIFR. I get that. They use that for the rotating display type here at Typophile.\n\nHmmm...\n\nIf you aren't absolutely desperate to get the fonts settled, it will probably be worthwhile to consider custom.\n\nBut I would have a number of questions to ask you about your needs and preferences before I could give any idea of turnaround. There are many variables like: how many styles, character set (language coverage), style, intended uses, etc.\n\nAt a certain point, you are likely to want a real quote from someone, and I'm not in a position to do the work or give a quote at all, so maybe this is the time for you to contact some of the [independent foundries whose designers visit typophile.](http://web.archive.org/web/20150122202340/http:/typophile.com/node/20643) If you want recommendations, contact me offline thru my profile.\n\nOne thing to know: There is a lot of gray area between retail and custom type solutions for you. For instance, a designer might take one of their own retail releases and make custom weights or styles for you from their private data, thereby saving immensely in development costs. They might also arrange for the faces to be exclusive to you for a specific period such as 3 years or 10 years, after which they become retail, and a royalty stream takes up some of the development cost. So there are many different ways to get custom type that might fit your situation and budget.\n\nThe one way that isn't kosher is for someone to slightly scale someone else's retail face and then sell it to you as custom. The originating foundry is likely to pounce. Work directly with originating foundries to get the best work and the cleanest contracts.\n\n"
    },
    {
      "time": "11 Sep 2008 — 2:15pm",
      "content": "I am very interested in this discussion. You mentioned sIFR, I am wondering what about Print-On-Demand (POD) systems?\n\nI work as a designer in a franchise company with many franchisees. We would like to have in place that would allow franchisees to go online and edit variable data in a print template that I created and provided to our POD provider. I would have a 5-user license and the POD provider would also have a 5-user license. Would that not be sufficient?\n\nThe foundry that we initially purchased our fonts from says that it also wants a license for every franchisee in our system, even though none of the franchisees will have the fonts on their machines. This seems overboard. The edits that franchisee make on the POD amount to changing the address and phone number on the template. Does that really necessitate a license for each?\n\nI am interested in the feedback of the Typophile community about this. Thanks for your time and attention.  \n--  \nAj\n\n"
    },
    {
      "time": "11 Sep 2008 — 3:34pm",
      "content": "It is an understandable thing for some foundries to want each end user to have a license. It is the same thing, essentially, as a EULA which doesn't allow for editable embedding unless the user has a license to do so.\n\n"
    },
    {
      "time": "11 Sep 2008 — 3:56pm",
      "content": "So, by your estimation, this would be a normal and equitable arrangement and would be considered editable embedding?\n\nOur POD provider believes that as long as they have a license, everything should be fine since it is their equipment that is doing the editing of the final document. Let me explain, there is a layer between the website user (franchisee) and the template editing. The website user modifies text in a field on a web form, the POD providers system stores that information in a database which then edits a template accordingly. Essentially, this could be seen as similar to a franchisee emailing the POD provider the text changes desired and the POD provider making the change and printing it. The franchisee has no direct contact with the print templates other than to see a screenshot of what a typical template looks like.\n\nDoes this change anything?  \n--  \nAj\n\n"
    },
    {
      "time": "11 Sep 2008 — 6:00pm",
      "content": "As far as foundries are concerned if a person can log onto a website and typeset something, whether they do the printing or someone does it for them, they have used the font.\n\n"
    },
    {
      "time": "12 Sep 2008 — 7:23am",
      "content": "Hmmm... So, to try to carry out the logic. I present some scenarios accomplishing the same thing, changing an address on a business card. Where does the typesetting occur?  \n#1: I call my printer and ask them to change my address on a business card, have I now typeset something?  \n#2: I email my printer the change I would like made on a business card, have I now typeset something?  \n#3: I modify a spreadsheet of business card info and email the file to my printer to import into a biz card template, have I now typeset something?  \n#4: I modify a database of business card info and email the database file to my printer to update his database which is linked to a biz card template, have I now typeset something?  \n#5: I modify a database of business card info on my printers website which is linked to a biz card template, have I now typeset something?\n\nHere is my point and question: does modifying raw data constitute typesetting? If so, does a credit card company or bank that uses a specific font in its statements need to purchase licenses or make special arrangements for thousands (maybe millions) of its customers who make purchases, deposts, transfers and withdrawls thereby 'typesetting' the statement? That may sound a bit ridiculous, but I believe that this line between compensated use and non-use of a font needs to be more equitably and definably drawn in an era of increasingly remote data manipulation.\n\nPlease let me know your thoughts.  \n--  \nAj\n\n"
    },
    {
      "time": "12 Sep 2008 — 8:37am",
      "content": "Banks often buy site licenses that cover all of their employee computers. These are a bit pricey. But what do you expect when someone licenses, say, 10,000 copies of four-member font family. What do you think said bank spends on hardware and software a year? Certainly more. Just calculate the Windows XP licenses…\n\n"
    },
    {
      "time": "12 Sep 2008 — 10:01am",
      "content": "I'm actually not referring to employees, but customers. Employees have the fonts loaded on their machines, customers do not. It is understandable to pay for licensing employee machines, I am wondering if it is understandable to pay for licensing customer machines. The scenarios I listed do not involve the fonts being anywhere except on the printer's machine. The hardware and software a bank owns is present in their own facilities, used on a daily basis by their employees. There is no problem understanding that cost. That is a different situation than the scenarios I described.\n\nTo use your bank scenario, it would be like a customer coming in to make a deposit, filling out the form, handing it to the teller who then prints a current balance statement for the customer. The bank would now need to pay to license the customer's (not the employee's) use of that font used in printing the statement he/she received.  \n--  \nAj\n\n"
    },
    {
      "time": "12 Sep 2008 — 11:12am",
      "content": "But the bank teller is printing the balance statement on a bank computer, and then giving this sheet of paper to the customer.\n\nOf course that bank computer would have licensed fonts. The bank is free to given printed out pieces of paper to anyone, presumably.\n\nThe letters printed out on the paper statement are not the font, but the font and other software's output. The person holding the piece of paper that they didn't make—or even touch a computer to get a hold of—does not need a license.\n\n"
    },
    {
      "time": "12 Sep 2008 — 11:17am",
      "content": "Every font distributor has their own EULA provisions! However, to try and answer your questions…\n\n\\>_#1: I call my printer and ask them to change my address on a business card, have I now typeset something?_\n\nNo. But when your printer makes the change, he IS typesetting something. You can't give him the font you used to make the design (unless the font's EULA allows this). The printer will have to license the font himself in order to make the change.\n\n\\>_#2: I email my printer the change I would like made on a business card, have I now typeset something?_\n\nIf you are sending him a changed business card layout file, then yes, you have. You are using the font you licensed, and you made the change on your own computer. If your font's license allows PDF Print & Preview embedding, then you can send that PDF to the printer, and he can print your business card. He's not actually using the font himself, and probably wouldn't need a license.\n\n\\>_#3: I modify a spreadsheet of business card info and email the file to my printer to import into a biz card template, have I now typeset something?_\n\nHere your printer would need a font license, I think. Depending on whether or not you actually designed anything in the font on your computer, you may not even need the font file yourself to do this work! But the printer would.\n\n\\>_#4: I modify a database of business card info and email the database file to my printer to update his database which is linked to a biz card template, have I now typeset something?_\n\nThe answer here is probably the same as number three. Your printer would probably need to license the font himself.\n\n\\>_#5: I modify a database of business card info on my printers website which is linked to a biz card template, have I now typeset something?_\n\nSounds like numbers three and four to me…\n\n"
    },
    {
      "time": "12 Sep 2008 — 3:21pm",
      "content": "Thanks for the reply Dan. I'm not intentionally trying to be aggravating, I'm playing a devil's advocate role to help see what knowledgeable, experienced 'typophiles' think about the situations I laid out as I prepare to negotiate with the font foundry we are working with. I appreciate your feedback.\n\nIn #2, when I state \"I email my printer the change...\", I am saying that I am sending a plain email with the text I want on the business card typed into the email. I am not sending a file for the printer to output. The only fonts used in this scenario are the default fonts with the email program.\n\nI agree, that #3, 4 and 5 are the situation I am talking about. I have no contention with the printer paying for font license. I am in complete agreement with that. My argument is that the end user who is modifying the spreadsheet/database of information does not need a license. It would seem from your last post that you would agree with that?  \n--  \nAj\n\n"
    },
    {
      "time": "12 Sep 2008 — 3:29pm",
      "content": "If the spreadsheet is not using the font in question, and the person editing it isn't using the font in any way, including having it on their own computer, then no, they wouldn't need a license. Only the printer. If someone at the same office (or an other office…) designed the business card first, that would need a license.\n\nThat's it, unless there is some other step I don't know about. I'm not a lawyer, and this advice is only my own personal opinion, based on the questions posed so far.\n\n"
    },
    {
      "time": "16 Sep 2008 — 7:35am",
      "content": "Thanks for the feedback Dan. Those were my thoughts as well. I understand the comments of people here at Typophile are not legally correct or binding, I just wanted to get a feel for what people here thought about the subject.\n\nThanks again.  \n--  \nAj\n\n"
    },
    {
      "time": "28 Apr 2011 — 11:51pm",
      "content": "[Franchise Cost](http://web.archive.org/web/20150122202340/http:/www.franchiseassociationofindia.com/) Franchiseassociationofindia.com is a non-profit professional organization associating at the national level. Franchise Association of India specialists dealing with franchise company, franchisor, business franchise, franchise in India, franchise opportunities, franchise business, franchise cost, franchise sales & franchisee.\n\n"
    }
  ]
}
