{
  "id": "47708",
  "title": "(x) \"Don't forget\" mediaeval looking lettering - hand lettered {Michael Clark}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I’m trying to upload an image and keep getting Could not copy image. Error\n\nWhat am I doing wrong.\n\nIt’s an RGB JPG 150 pixels wide, 150 dpi.\n\nFrustrated\n\n [‹ (x) Grace's 99th Birthday geometric sans - Neutraface {Tiff}](http://web.archive.org/web/20081121191032/http:/www.typophile.com/node/47803 \"Go to previous forum topic\") [(x) Blackletter on Sean Paul \"The Trinity\" album cover - Agincourt {Yves} ›](http://web.archive.org/web/20081121191032/http:/www.typophile.com/node/47793 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121191032/http://www.typophile.com/user/20685\" title=\"View user profile.\">typesetter1</a>",
  "time": "<br>",
  "uid": "20685",
  "comments": [
    {
      "time": " 24.Jul.2008 6.42am",
      "content": "Are you uploading it from a digital camera?\n\n"
    },
    {
      "time": " 24.Jul.2008 6.46am",
      "content": "Are there spaces in the file name?  \n [How to post a sample or image](http://web.archive.org/web/20081121191032/http:/typophile.com/node/18067)\n\n"
    },
    {
      "time": " 24.Jul.2008 6.51am",
      "content": "Yes. There are spaces. Should I use an underscore?\n\n"
    },
    {
      "time": " 24.Jul.2008 6.56am",
      "content": "I would get rid of any spaces or underscores. Hopefully that should work :)\n\n"
    },
    {
      "time": " 24.Jul.2008 6.56am",
      "content": "Changed the space to an underscore.\n\nSame problem.\n\n"
    },
    {
      "time": " 24.Jul.2008 7.10am",
      "content": "What’s the filename? Any weird glyphs in it? (Shouldn’t.)\n\n"
    },
    {
      "time": " 24.Jul.2008 7.33am",
      "content": "dont\\_forget.jpg\n\n"
    },
    {
      "time": " 24.Jul.2008 7.42am",
      "content": "Hm. Dunno. Looking good.\n\nWhatever. Try empty cache and upload again.\n\n"
    },
    {
      "time": " 24.Jul.2008 8.24am",
      "content": "AAAAAAAAAARRRRRRRRRRGGGGGGGGGGHHHHHHHHH!\n\nIs there another way to get the image uploaded?\n\n"
    },
    {
      "time": " 24.Jul.2008 8.38am",
      "content": "Upload it to [Imagefilez.com](http://web.archive.org/web/20081121191032/http:/www.imagefilez.com/) for example and attach the link here.\n\n"
    },
    {
      "time": " 24.Jul.2008 8.43am",
      "content": " ![](http://web.archive.org/web/20081121191032im_/http:/www.typophile.com/files/dont_forget_3837.gif)\n\nOK. Changed it to a b&w gif and it worked.\n\nVery strange.\n\nSorry for the hassle.\n\nI’ll know next time.\n\n"
    },
    {
      "time": " 24.Jul.2008 9.05am",
      "content": "Are you using the new update to Firefox?\n\n"
    },
    {
      "time": " 24.Jul.2008 9.37am",
      "content": "I’m using Internet Explorer.\n\n"
    },
    {
      "time": " 24.Jul.2008 12.03pm",
      "content": "This is from a dentist’s card. It was hand done by Marc Drogin. Probably printed in red and black, right? Quite a business he built up in the Northeast with just dentists, and boy could he do some incredible illustrations with the same Coit pen.. There are some fonts by Arthur Baker out there that may satisfy you.\n\nMichael\n\n"
    },
    {
      "time": " 24.Jul.2008 12.07pm",
      "content": "He used to be in Oxford New Hampshire (or was it Vermont?) I believe. No idea where he is now.\n\nMichael\n\n"
    },
    {
      "time": " 24.Jul.2008 1.06pm",
      "content": "You might also like [Fine Gothic](http://web.archive.org/web/20081121191032/http:/www.finefonts.com/finefontsfinegot.html) or [Balthasar](http://web.archive.org/web/20081121191032/http:/www.finefonts.com/balthasar.html) both by [Michael Harvey](http://web.archive.org/web/20081121191032/http:/www.typophile.com/wiki/Michael%252BHarvey).\n\n"
    },
    {
      "time": " 24.Jul.2008 2.32pm",
      "content": "Yep. Red and black. I thought it was a font, because all the letters are identical. Usually when something is hand lettered, there are differences between the same letters.\n\nThanks for your help.\n\n"
    },
    {
      "time": " 24.Jul.2008 2.37pm",
      "content": "I checked out this website.\n\nYep, this is precisely what the card looks like.\n\n[http://www.ibccsite.com/drogin](http://web.archive.org/web/20081121191032/http:/www.ibccsite.com/drogin \"http://www.ibccsite.com/drogin\")\n\n"
    },
    {
      "time": " 24.Jul.2008 3.24pm",
      "content": "Not necessarily when you have done the same thing for so many years & the client doesn’t want to try out any of your new alphabetic creations... instead they want your stock and trade. Boring but it pays the bills and can be done in your sleep, with tender loving care of course.\n\nThanks for finding the website. Haven’t talked to that old geezer in 15 years. Actually he is one of the brightest, most rounded, individuals I ever met. I will e-mail him.\n\nMichael\n\n"
    },
    {
      "time": " 24.Jul.2008 7.17pm",
      "content": "Michael,\n\nI also emailed Mr. Drogin to inquire about some of his cards and included the link to this thread. Marc wished me to thank you for your comments!\n\nHe has an ebay account with which he is selling some of his vintage cards!!\n\n[http://myworld.ebay.com/marcdrogin/](http://web.archive.org/web/20081121191032/http:/myworld.ebay.com/marcdrogin/ \"http://myworld.ebay.com/marcdrogin/\")\n\n"
    },
    {
      "time": " 24.Jul.2008 7.22pm",
      "content": "Here is another website with samples of Drogin’s cards:  \n [http://www.cardeologist.com/drogins.php](http://web.archive.org/web/20081121191032/http:/www.cardeologist.com/drogins.php \"http://www.cardeologist.com/drogins.php\")\n\n"
    },
    {
      "time": " 25.Jul.2008 4.57am",
      "content": "Just a thought...........\n\nI wonder if he has thought about having his calligraphy digitized?\n\nSure would make for some cool fonts.\n\n"
    },
    {
      "time": " 25.Jul.2008 7.08am",
      "content": "Tom\n\nI broached that subject with Marc this morning and he is intrigued. So look out for the possibility. As soon as he clears up some pressing business we may just digitize some of his hands.\n\nJesse, treasure what he sends you... he is a one of a kind calligraphic designer.\n\nMichael\n\n"
    },
    {
      "time": " 26.Jul.2008 7.03pm",
      "content": "Digitizing one’s calligraphic work does sound like the 21st century evolution of the craft. I wouldn’t be surprised if a lot of professionals have thought of doing it — creators of metal, movable-type typefaces have transitioned to creating digital work, after all.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 26.Jul.2008 8.15pm",
      "content": "I think Gunnlaugur Briem was playing with the notion of turning a calligraphic hand into a font almost 30 years ago in London. Brilliant audacious fellow deeply engrossed in both calligraphy and typography when I knew him.\n\nOh, and thank you all for your very kind comments.\n\nCheers,  \nMarc\n\n"
    },
    {
      "time": " 27.Jul.2008 11.30am",
      "content": "Michael Clark has some excellent digitized alphabets.  \nI’m wondering how they were produced? Did Michael scan them himself and work with them in a font creation program, or did he collaborate with someone who was experienced with the software?\n\n"
    },
    {
      "time": " 27.Jul.2008 12.30pm",
      "content": "I scan them and produce them in Fontographer. I am in the midst of the steep learning curve with FontLab. Taught myself Fontographer but FontLab is a completely different, and frustrating animal. I have everything really tight before I even go into the software so there is no guessing. I am one of those who still spends a majority of my time with ink. Actually the digital work is really boring to me. P22 does all of the final assembly for me as I have NO expertise with the Open Type side of things.\n\nThank you for the compliment Textwrap. The fonts I design are based on lettering done for commercial use. I’ve no interest in text faces, just titling fonts. It goes back to setting copy on the Phototypositor in the 80’s. Ahhhh, the smell of fixer in the morning and the sight of 2 inch idiosyncratic letters in a headline. Love... pure love.\n\nMichael\n\n"
    },
    {
      "time": " 27.Jul.2008 4.42pm",
      "content": "hey Marc! Welcome to the forum!!\n\n"
    },
    {
      "time": " 27.Jul.2008 4.43pm",
      "content": "Michael,  \ndo you have a website with your work?\n\n"
    },
    {
      "time": " 27.Jul.2008 5.06pm",
      "content": "Send me an e-mail at\n\n[typerror@aol.com](mailto:typerror@aol.com)\n\nAnd I will send you a PDF\n\nMichael\n\n"
    }
  ]
}
