{
  "id": "4771",
  "title": "Going around in circles...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I need some help, I'm lost...   \n   \nI'm doing a new logo for a classic car spare parts company - Canley (or Canley Classics - yet to be decided) - also does servicing and work on cars too. They're alot more than just that though - they invest a lot of money in my favourite marque of car (Triumph) - developing various products and making new parts. There is a really big feel good factor about buying from them - they are one of the few good guys - everywhere seems rather money grabbing. Passionate is the word.   \n   \n   \nA few of their competitors logos:   \n   \n ![Rimmer Bros](http://web.archive.org/web/20131017125750im_/http:/www.typophile.com/forums/messages/4100/35905.gif)   \n ![Moss](http://web.archive.org/web/20131017125750im_/http:/www.typophile.com/forums/messages/4100/35906.gif)   \n ![JP](http://web.archive.org/web/20131017125750im_/http:/www.typophile.com/forums/messages/4100/35907.jpg)   \n   \n   \nThe trouble I've got is that I the people who are going to appreciate the logo perhaps arent exactly type or design orientated - which I know is normal for most jobs - but Im having a real problem trying to \"place\" the logo and being happy with it.   \n   \nI almost need to walk away from this job and come back - but I don't have time. I need some fresh thinking.   \n   \nI've been looking at typefaces - and with lots I think \"that would look really nice and would give the right feel\" - but I then get paranoid thinking that the type isnt going to be suitable - but whats suitable anyway? There are no set rules with what Im working with - and I don't have much to compare with in their market place - as most of them either arent really \"designed\" or are just really after thoughts...   \n   \nRamble over... confused... ![:-(](http://web.archive.org/web/20131017125750im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nI thought this would be fun - working with something I love - but perhaps Im just too close to it... strange...   \n   \nHow do you guys cope with this? Any advice?   \n   \n   \n   \nJames\n\n",
  "author": "jcarruthers",
  "time": "14 May 2004 — 5:50am",
  "uid": "3519",
  "comments": [
    {
      "time": "14 May 2004 — 6:17am",
      "content": "_The trouble I've got is that I the people who are going to appreciate the logo perhaps arent exactly type or design orientated_   \n   \nBut these are the people you must reach! They may not be type oriented, but they are certainly Triumph oriented, yes? The trouble (opportunity) with the competion is that as far as I can tell their look does not connect with Triumph in any way. Before thinking about typeface, think about how you can make your product the \\*authentic\\* spirit of the original, not the flashy tripple gradient Rimmer Bros.   \n   \nMake the connection your goal. For example, I bet if you included a very (i mean very) subtle leaf cluster motif, a true enthusiast would instantly recognize it. That's probably not the answer, but seek out that swap-meet junkie appeal. Flip though old brochures, catalogues, ads, car club newsletters, racing ephemera etc.   \n   \nAs for font, don't let this drive your concept. It may be a type-only solution in the end, but is it based on the chrome lettering from the 1956.... blah blah.   \n   \nRandy\n\n"
    },
    {
      "time": "14 May 2004 — 6:28am",
      "content": "Thanks for the advice Randy. Feel a bit silly now... the trouble is the people Im trying to reach I know too well (does that make sense?) and I'm one of them... so what seems easy is actually a bit difficult... am I making sense?   \n   \nIm trying to get it as authentic - and thats what I've been looking at - mainly 60s/70s typefaces - old logos of that period.   \n   \nI have two things to do: a logo for them - which I think will be mainly type based - and also a \"competition logo\" which will be for their \"go-faster\" race products they do - and will be cast on to products - and also be on the racing cars they sponsor...   \n   \n ![canleygogo](http://web.archive.org/web/20131017125750im_/http:/www.typophile.com/forums/messages/4100/35910.jpg)   \n   \n(a very rough!)   \n   \nCurrently working around the original Triumph logo - and making it look a bit more up to date and motorsport-alike...   \n   \nThe original design:   \n   \n [http://web.brandsoftheworld.com/?id=112&query\\_id=5479176&page=1&brand\\_id=3449](http://web.archive.org/web/20131017125750/http:/web.brandsoftheworld.com/?id=112&query_id=5479176&page=1&brand_id=3449)   \n   \n...is actually based on a pair of wings... so thats what Im working on...   \n   \n   \n   \nJames\n\n"
    },
    {
      "time": "14 May 2004 — 6:59am",
      "content": "Wings. Exactly! You also have a checker flag thing happening there. How about a back to back CC wing thing\n\n"
    },
    {
      "time": "18 May 2004 — 6:48am",
      "content": "Update... I came up with this last night - still want to do a nice angular type one too... still finding the right typeface for it...   \n   \n ![canleyruff](http://web.archive.org/web/20131017125750im_/http:/www.typophile.com/forums/messages/4100/36162.gif)   \n   \n   \nIgnore the tag line - I just put it in there to see what it came out like...   \n   \nI think I might try putting some wings on the two C's next...   \n   \n   \n   \nJames\n\n"
    },
    {
      "time": "18 May 2004 — 1:52pm",
      "content": "James I think the face is too soft for an upscale company. I think of sports cars as sleek and angluar.\n\n"
    }
  ]
}
