{
  "id": "47722",
  "title": "Monotype Imaging Expands Its Foundries' Typeface Collections With More Than 100 designs",
  "forum": "FontsForward's blog",
  "tags": [

  ],
  "content": "Monotype Imaging today announced that more than 100 fonts are now available from its Monotype, Linotype and ITC typeface foundries. The designs range from enhancements of timeless classics to new space-saving offerings. The fonts are available online at Fonts.com, Linotype.com, ITCFonts.com and Faces.co.uk.\n\nNew to the Monotype Library  \nThe Slate™ Condensed family by Rod MacDonald leads a selection of releases from the Monotype foundry. Elegant yet functional, the fonts add six space-savings designs to the original Slate family. Also new to the Monotype Library is the Givens Antiqua™ family. Drawn by George Ryan of Monotype Imaging and named in honor of Robert M. Givens, Monotype Imaging’s first president and chief executive officer and current chairman of the board, the Givens Antiqua design employs a generous x-height and open proportions to promote readability. The new Monotype typefaces follow the April announcement of the Soho® Gothic family, the latest offering by Monotype Imaging’s Sebastian Lester, which extends his 40-font Soho collection released last year.\n\nNew to the Linotype Library  \nDesigned by Akira Kobayashi, type director at Linotype, the Eurostile® Next family is the newest of five typeface families added to the Linotype Library. Part of the Linotype Platinum™ Collection, Eurostile Next is an enhanced and expanded version of the widely used Eurostile typeface family. Like the original, Eurostile Next uses open, squared letterforms to create a modern aesthetic. The Cosmiqua™ family, also from Kobayashi, exudes a lively, youthful feel inspired by advertising from the 1950s. The design includes five weights, each with an italic counterpart.\n\nThe Satero™ family, created by designer Werner Schneider, is a versatile type system that contains complementary sans serif and serif variations. Designed with newspaper and magazine use in mind, the Satero family offers high legibility and slightly condensed proportions to help maximize space limitations.\n\nCalligrapher Gaynor Goffe brings to the Linotype Library the Hamada™ typeface, a script design that captures the feeling of ink on paper. The font offers many alternate characters and a series of ligatures and swashes for seemingly limitless combinations.\n\nAlso new to the Linotype Library is the Frutiger® Arabic family, which carries over the friendly, yet professional demeanor of the original Frutiger design to the Arabic alphabet. Created by Linotype designer Nadine Chahine, with the approval of Adrian Frutiger, who designed the Frutiger typeface in the 1970s, the Frutiger Arabic family is intended for use in a variety of applications, form signage to corporate design.\n\nChahine, Kobayashi and Frutiger are also credited with other typefaces announced this year, including the Frutiger Serif family, designed by Kobayashi and Frutiger, and the Palatino® Arabic design, created by Chahine and Hermann Zapf, who designed the original Palatino typeface more than 50 years ago. The Palatino Arabic typeface was honored for design excellence at the TDC2 2008 design competition held by the Type Directors Club of New York City.\n\nNew to the ITC Library  \nThe ITC Franklin™ family, which evolved from the widely used ITC Franklin Gothic™ design, is the latest release from International Typeface Corporation, a Monotype Imaging Inc. company. Designer David Berlow created the ITC Franklin version specifically for use at display sizes. ITC also released OpenType® Pro versions of the popular ITC Stone® and ITC Bodoni™ families. OpenType fonts, which operate on both Macintosh® and Microsoft® Windows® platforms, allow type designers to create large character sets within fonts – up to 65,000 characters – well beyond the 256 characters supported by PostScript® Type 1 or TrueType® fonts. Instead of creating multiple fonts, a typeface designer can build a single OpenType font that provides access to characters that would have previously required switching between fonts. The ITC Stone Pro collection includes the ITC Stone Serif Pro, ITC Stone Sans Pro, ITC Stone Informal Pro and ITC Stone Humanist Pro families. Each shares an underlying structure that allows the designs to coexist harmoniously. The ITC Bodoni family is intended to serve as a faithful rendition of Giambattista Bodoni’s most revered typeface design. As OpenType Pro families, the ITC Stone Pro and ITC Bodoni Pro offerings provide expanded character sets to support most Central European and many Eastern European languages.\n\nThe ITC Mattia™ design from designer Giuseppe Errico is a distinctive handwriting font, with its scrawled letterforms that produce a tense, nervous tone. The ITC Santangeli™ face, also from Errico, is based on an 18th century manuscript by Italian writer, Benedetto Santangeli. The design includes alternate characters and ink splotches to enable a realistic reproduction of antique lettering.\n\n",
  "author": "<a href=\"/web/20080802085619/http://typophile.com/user/31252\" title=\"View user profile.\">FontsForward</a>",
  "time": "<br>",
  "uid": "31252",
  "comments": [

  ]
}
