{
  "id": "47739",
  "title": "Logo rework for small company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey, this is a new logo mock-up for a small creative firm, specializing mostly in interactive design. The old look we felt was a little to dark and edgy and decided to lighten it up a bit. The new look is just a text mark in Bauer Bodini pt72. We feel we needed something a bit friendlier to relate with our current stream of clients(doctors, lawyers, etc...). We think the new look is a bit more timeless and wouldn’t have to be drastically changed in the future, maybe just retouched. Feel free to make any comments or suggestions on the logo including if it should be accompanied by a mark or not?? Thanks for any posts.\n\n ![](http://web.archive.org/web/20081121191828im_/http:/www.typophile.com/files/fourfather_4967.png)\n\n [‹ Typeface combinations](http://web.archive.org/web/20081121191828/http:/www.typophile.com/node/47944 \"Go to previous forum topic\") [Logotype for a media firm using custom type ›](http://web.archive.org/web/20081121191828/http:/www.typophile.com/node/47596 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121191828/http://www.typophile.com/user/32815\" title=\"View user profile.\">Jeremiah</a>",
  "time": "<br>",
  "uid": "32815",
  "comments": [
    {
      "time": " 24.Jul.2008 6.27pm",
      "content": "Hey Jeremiah,\n\nI think it’s neat and memorable, due in no small part to the interesting name, the word looks good, it looks trustworthy and arty. My only question is, is it too similar to [Pentagram’s](http://web.archive.org/web/20081121191828/http:/www.pentagram.com/) to create enough of a point of difference? Maybe a mark would help  \ncheers\n\n—N\n\n"
    },
    {
      "time": " 24.Jul.2008 7.48pm",
      "content": "why fourfather?\n\n"
    },
    {
      "time": " 24.Jul.2008 8.17pm",
      "content": "Hey, we get asked that all of the time so I’m pretty good at answering the question. We named the firm Fourfather obviously because phonetically its “forefather”. The meaning of forefather has to do with being a part of a tradition from its origin. We feel we’ve collectively been in the business long enough to make that bold of a statement. The Four replaced Fore because there are 4 of us who started the firm. Plus we do operate mainly on a digital medium and the number in some slight way validates that. Would love to hear more comments on the name/logo/color, anything you guys have to offer would be great. Oh and Nick, thanks for the post. I am very familiar with Pentagram and it does come to mind when looking at the word. I think maybe a color change would help improve, but we do love the color.\n\n"
    },
    {
      "time": " 24.Jul.2008 8.19pm",
      "content": ".\n\n"
    },
    {
      "time": " 24.Jul.2008 8.29pm",
      "content": "Colour the balls on the ’f’s and ’r’s a different colour (aqua maybe) and add a period to the end for a total of four coloured balls.\n\n- Lex\n\n"
    },
    {
      "time": " 24.Jul.2008 8.29pm",
      "content": "Actually, I just noticed the ’a’ has a ball too. That works even better. Four balls without the need for a period.\n\n- Lex\n\n"
    },
    {
      "time": " 24.Jul.2008 8.46pm",
      "content": "“You got to frame it just right and have some luck of course  \nAnd it helps to have a tall man sitting on the horse”\n\n"
    },
    {
      "time": " 24.Jul.2008 8.47pm",
      "content": "Thanks Lex, I would have never thought of that. Pretty interesting concept, i’ll play around with the idea and see if anything works out.\n\n"
    },
    {
      "time": " 25.Jul.2008 6.43am",
      "content": "Why the The Drive-By Truckers’ lyric?\n\n"
    },
    {
      "time": " 25.Jul.2008 10.50am",
      "content": "Anyone have any more suggestions? Kerning, color? anything at all!\n\n"
    },
    {
      "time": " 25.Jul.2008 1.02pm",
      "content": "“Kerning”\n\nThe F seems to be floating away a bit. I think the ’he’ could be tighted up too.\n\nYou’ll definitely want to rethink the color. The Pentagram similarity might be a bit much.\n\n"
    },
    {
      "time": " 25.Jul.2008 2.24pm",
      "content": "Here is the suggested spacing tightened up. Brought the F closer to the body itself and tightened the h & e together. Let me know what you guys think and maybe some color reworks to be posted soon.\n\n ![](http://web.archive.org/web/20081121191828im_/http:/www.typophile.com/files/fourfather_6367.png)\n\n"
    },
    {
      "time": " 25.Jul.2008 2.29pm",
      "content": "Here is the logo side by side with the Pentagram logo, side by side they don’t bear much of a similarity. Let me know what you guys think, is it too close?\n\n ![](http://web.archive.org/web/20081121191828im_/http:/www.typophile.com/files/fourfatherpent_3724.png)\n\n"
    },
    {
      "time": " 25.Jul.2008 2.55pm",
      "content": "As Aluminum said - the color should be the first to go. At least then it removes the huge Pentagram connection.\n\nMaybe a graphic device too?\n\n"
    },
    {
      "time": " 25.Jul.2008 3.30pm",
      "content": "The tone and sentiment are exactly the same. My immediate thought is ’ripoff’ - they look far too similar to me.\n\n"
    },
    {
      "time": " 25.Jul.2008 5.31pm",
      "content": "meh I don’t think either is unique enough to be considered as owning the rights to that look.\n\n"
    },
    {
      "time": " 25.Jul.2008 5.35pm",
      "content": "Ya, I immediately thought of pentagram when I first saw this thread.\n\n"
    },
    {
      "time": " 25.Jul.2008 6.26pm",
      "content": "I do not mean any disrespect but it looks just like you typed the word out, not like a logo.\n\njust my two cents....\n\n-Charles Borges de Oliveira\n\n"
    },
    {
      "time": " 27.Jul.2008 12.18pm",
      "content": "I agree. But ad-agencies all over the world use these kind of logo’s.  \nSo you could expect them here. It also connects to lawyers etc.  \nHowever, a bit more creativity would be appreciated. Even by you customers.\n\nTo me ’Fourfathers’ would be more in balance if it would be written in lower cast: fourfathers\n\nOr play with upper and lower cast together to get a playful thing. Although, that might be to much....\n\nHope this helps.\n\nBest\n\nRay\n\nHere a few quick ideas\n\nYou say you are around for a while now. So your firm is solid with certain roots. Hence the baseline.\n\n ![](http://web.archive.org/web/20081121191828im_/http:/www.typophile.com/files/ideas_6096.jpg)\n\n"
    },
    {
      "time": " 27.Jul.2008 5.31pm",
      "content": "Appreciate the advice Ray. I really like the ideas, definitely worth investigating. I’ll work up some more mockups and post them. Anyone else have any suggestions or comments?\n\n"
    },
    {
      "time": " 28.Jul.2008 1.35am",
      "content": "Why stick to one colour? We often design logos to appear in a different colours on different applications (but best to choose a complementary palette of colours, obviously). You could have some fun with it rather than worrying that you’ve chosen the just the right colour.\n\n"
    },
    {
      "time": " 28.Jul.2008 2.37pm",
      "content": "Perhaps “four” and “father” are different colors, or the same color but at differing percentages. Or, maybe you set “father” in a more modern typeface, a sans that marries well with the Bodoni. This may reinforce your “fore” idea. That is, in an old/new kind of way.\n\n"
    },
    {
      "time": " 28.Jul.2008 2.40pm",
      "content": "i would definitely try and rethink your approach. it is more than commendable that you have gone for a simple and timeless solution, but it does bear an uncanny resemblance to a lot of industry, hm... forefathers, like interbrand, landor, and, of course Pentagram.\n\nif it is your aim to rank yourselves amongst the aforementioned, then i am sure there are many different ways to articulate your potential than Bauer Bodoni 72. as a matter of fact pentagram’s identity probaby works because its simplicity contrasts with the amount and diversity of work they have produced, rather than some sort of painstaking perfectionism in their choice of Modern 20.\n\ni would just make a fantastic showcase of your work rather than spend any more time on kerning (with all due respect).\n\n"
    },
    {
      "time": " 28.Jul.2008 8.20pm",
      "content": "That is a great comment Asen, thanks a lot. I definitely agree with the point you make about the broad spectrum of work some of the larger firms have on display to contrast with the simple branding. I’m starting to think that for our demographic and location it could actually backfire. I’ve had several people tell me they liked the old one in comparison because the new one is “too plain”.\n\n"
    },
    {
      "time": " 28.Jul.2008 10.13pm",
      "content": "This seems, uh, underdesigned. Could you not incorporate the numeral four, merging the crossbars of the “4” and the “f”? Just a thought.\n\nDOGG : : :\n\n"
    },
    {
      "time": " 29.Jul.2008 1.23am",
      "content": "One thing i like about a plain logo is that depending on it’s context it could work very well. Maybe we need to split up the debate to:\n\n1. Is the logo imposing on another designer/studio?  \nPersonally i think the logo is very similar, but it does not copy anything unique because of its simplicity.\n\n2: What is the purpose of your logo for your company?  \nDoes your logo define your company, what is the definition? Is your brand’s main goal to help new client acquisition? Where should your logo take you?\n\n3. Does/Can the logo work well for its purpose?  \nI think developing a consistent and unique brand strategy that includes everything you would use in your designs besides your logo can turn a plain logo into an interesting brand image that sets you apart from the competition.\n\n"
    }
  ]
}
