{
  "id": "47731",
  "title": "Cyrillic Fraktur Experiment",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "I happened to be rereading the Shark thread and thought it might be interesting to try to do a design experiment making a would-be (since as far as I know Cyrillic never used anything resembling fraktur or other blackletters) Cyrillic font based on my previous fraktur work. I've seen a few examples of Cyrillic frakturs but very modernized, more like a updated blackletter for English (where the x would be an x, instead of an r with a tail, etc). So, I figured I'd make an attempt at what Cyrillic fraktur would have been back in the day. Although I realize the almost impossibility of doing this for the capitals (though certainly an interesting experiment), I figured I'd go ahead and see what I might come up with for lower case.\n\nNot being a cyrillic user, I'd really like to hear people's comments, both on what works and what doesn't and maybe other avenues for exploration.\n\n| Attachment | Size |\n| --- | --- |\n| [cyrillic\\_fraktur.pdf](http://web.archive.org/web/20150317225726/http:/typophile.com/files/cyrillic_fraktur.pdf) | 51.52 KB |\n| [fraktur\\_cyrillic\\_capitals.pdf](http://web.archive.org/web/20150317225726/http:/typophile.com/files/fraktur_cyrillic_capitals.pdf) | 67.36 KB |\n| [AElbrocan\\_Test.pdf](http://web.archive.org/web/20150317225726/http:/typophile.com/files/aelbrocan.pdf) | 119.26 KB |\n\n",
  "author": "guifa",
  "time": "24 Jul 2008 — 2:03pm",
  "uid": "16708",
  "comments": [
    {
      "time": "24 Jul 2008 — 2:25pm",
      "content": "looks good!\n\n"
    },
    {
      "time": "24 Jul 2008 — 2:30pm",
      "content": "nice experiment. go on.\n\n"
    },
    {
      "time": "24 Jul 2008 — 5:05pm",
      "content": "\"Cyrillic never used anything resembling fraktur or other blackletters\"\n\nnot true, the original [cyrillic ustav](http://web.archive.org/web/20150317225726/http:/en.wikipedia.org/wiki/Image:Azbuka_1574_by_Ivan_Fyodorov.jpg) is very much a black letter. of course it doesn't look like latin blackletters, but that's beside the issue.  \nsome of these forms are very confusing, the ka looks like a na, the la like a pa, the ma like a ta, &c.\n\n"
    },
    {
      "time": "24 Jul 2008 — 9:46pm",
      "content": "Paul, this is what I love about Typophile, all I have to do is say \"As far as I know ...\" and someone will correct me within minutes :)\n\nAs you guess I did mean to imply \"fraktur or other blackletters in the style of Latin ones\". But I did use that ustav to make a few changes (but not substantial yet) to the lowercase. Added uppercase, where possible I used the Latin equivalent, but I still had to invent quite a few, which just like in Latin some of which are only marginally related to the normal form but I think they work.\n\nAgain comments are appreciated.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "25 Jul 2008 — 12:03am",
      "content": "Any idea to match the figures when they are scaled down a bit ?\n\n"
    },
    {
      "time": "25 Jul 2008 — 12:51am",
      "content": "Alessandro, what do you mean exactly? Are you talking about the numbers? If so, yeah, I'll eventually do those. The base fraktur was designed to go with a serif font and that's what the punctuation, roman numerals, etc, come from in the sample text. I'm going to expand it all soon as I'm fleshing out this face a lot more than i originally intended.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "25 Jul 2008 — 4:22am",
      "content": "Yes, Matthew, I meant the numbers and their proportion.  \nEnjoy working on your experiment.\n\n"
    },
    {
      "time": "26 Jul 2008 — 7:15pm",
      "content": "Looks nice, but I think someone used to the traditional letterforms would be upset/perplexed by some of your letters (I'm speaking of the miniscules here...the capitals look good, mostly). For one, your ts looks more like an u than the u does. For another, your k looks like an n, and the n, in turn, looks like it was designed by someone used to the Latin alphabet, which might be a bad thing.\n\nYou know, if you just switched the u and ts characters, it'd work a lot better, I think, as well as making the k definitely a k and the n definitely an n...\n\nJust figured I'd put in my two cents, since I took five semesters of Russian in college.\n\nAlso...Russian Cyrillic isn't the only Cyrillic. Check out the Cyrillic subrange of any Unicode font. There are characters for other languages who use a modified Cyrillic. You might look into modifying your letters accordingly.\n\nBut like I said, it looks cool. I've toyed around with blackletter/fraktur versions of Cyrillic in my notebooks myself.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "26 Jul 2008 — 10:39pm",
      "content": "JT, thanks for all the comments. I know Russian's not the only language for Cyrillic, but it's the simplest subset of the alphabet. A lot of the others are more or less copy and paste operations.\n\nIt's interesting that several people are pointing out the k looks like an n. Maybe it's 'cause Greek lacks a c character and thus the sequence ic wouldn't happen, but my test version of this same thing in Greek was found to be surprisingly readable by my Greek friends. I'll have to investigate other ways of doing it as the zhe won't work just chopping off the left. Tho maybe if I use a top like a t it might distinguish itself more (also of note, the i+c formation seems to be the original method, not that original means best of course). Slight change but it also gives it a short ascender that might help distinguish it and definitely goes better with the capital.\n\n ![](http://web.archive.org/web/20150317225726im_/http:/typophile.com/files/cyrillic_fraktur_k_comparison_4362.png)\n  \nHere's a more modern-like n, definitely more readable although it loses its connexion with the capital (which was the inspiration for the miniscule).  \n\n ![](http://web.archive.org/web/20150317225726im_/http:/typophile.com/files/cyrillic_fraktur_n_comparison_3573.png)\n  \nAs for the ts and and the u, I'm a little hesitant to swap them, if only because the ts is visually essentially the same in all other styles to Latin Y and that's the shape it has in the Latin version of it, and I'd like to keep the tails of the u and shch the same. That said though, here's a third version (with the other two for comparison) that I think might work better as ts, and then I can perhaps leave u as u. What do you think?  \n\n ![](http://web.archive.org/web/20150317225726im_/http:/typophile.com/files/cyrillic_fraktur_tsu_comparison_6481.png)\n  \nOn a side note, I'll have the Greek one posted as soon as I can come up with an acceptable uc Omega.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "27 Jul 2008 — 4:10am",
      "content": "i think the ka still looks too similar to the na. and the crossbar on the na is sloping the wrong direction, which can make it easily confused as an i. i would do a bit more research into cyrillic if you really want to make this viable.\n\n"
    },
    {
      "time": "27 Jul 2008 — 8:44am",
      "content": "I think the Л/л should always follow the shape of the Д/д. It's because they derive from the corresponding Greek capitals. This may be difficult with an open top...\n\nLooking into script forms should give you some insight into how the forms can be made less ambiguous. For instance, a lowercase г becomes a sort of backwards s in cursive. So, for your blackletter г, I suggest breaking the present join and connecting the top of the vertical to the right end of the horizontal with a thin stroke, making a sharp seveny shape.\n\n"
    },
    {
      "time": "28 Jul 2008 — 6:01pm",
      "content": "Paul\n\nAzbuka 1574 by Ivan Fyodorov.jpg. Is this the eg. that is considered blackletter?\n\nOther than the mass of black (for which Blackletter is named) it shares none of the characteristics of any of the four sub catagories of Blackletter: textura, rotunda, schwabacher or fractur. Granted, blackletter was a derivative of Carolingian but I still don't see the angularity and rigid penshifts.\n\nIs this something being taught somewhere? Did I miss something?\n\nMichael\n\n"
    },
    {
      "time": "28 Jul 2008 — 8:21pm",
      "content": "Okay, new version posted, with also a test version of the Greek and samples in various cyrillic- and latin-based languages. The letters in crimson I'm not convinced of their viability, and will probably update them strongly.\n\nCerulean, great suggestion, and actually I was able to use the same form for л to make a far nicer lowercase A, so that makes three characters sharing that shape. Is the t now more or less what you were thinking of? My only Russian friend (who I only used to check and see if the letters are readable) didn't even seem to notice it, and it looks a bit nicer spacing wise.\n\nPaul/JT: how is the к now? I think now I might have made it too much and it might stand out too much. And just to JT: I've added in some of the other Cyrillic letters (the first six lines on the Unicode charts which I think covers all current-use native-Slavic Cyrillic letters). Some of those capitals were interesting, and although I'm sure they're mostly unreadable, I suppose I can take comfort in the fact that most latin fraktur capitals are unreadable to English speakers :-)\n\nI've also finally come up with a name for the font, Ælbrocan.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "29 Jul 2008 — 7:52am",
      "content": "Очень лучше, спасибо! I like the new k and n (although if you wanna get technical, the capital n looks like a Latin capital H anyway, but I'm not gonna ask you to change your capitals...even though the Z, which is that cool Fraktur S, looks nothing like the Cyrillic Z.\n\nGood job with the non-Russian Cyrillic characters too. I don't speak any languages which use them, but they look like they fit in well.\n\nSo when do we get a \"trial\" version to download and test for ourselves?\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "29 Jul 2008 — 12:03pm",
      "content": "Well, capitals of course with fraktur like fonts have little to do with their uppercase. So in general, I went with the system of, \"if normally in Antiqua they look the same, so be it in fraktur\", although I recognize sometimes that means one might get some odd switch ups (like the capital el looking exactly like an N when it might not have otherwise been). Hence, I'm always open to suggestions, the capitals are pretty fun to make.\n\nAs for a trial version, once the semester is over (sad, isn't it, I should be working on my completely-unrelated term paper), I'm going to set up a site for it and offer the whole thing as a free-for-non-commercial use font and host it for people who want to use it for websites (although it's not that easy to read on screen, printed out it really shines) that way I can always make sure they have the most up-to-date version.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "29 Jul 2008 — 1:39pm",
      "content": "Cool; I'll be sure to download it (for non-commercial use, of course)\n\nOne final note: If you've ever seen a Cyrillic script T, you know it looks very little like a print one (like a pi with a third leg in the middle)...alternate character, perhaps?\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "29 Jul 2008 — 3:28pm",
      "content": "Certainly possible once I start doing the OT features. One nice thing I've found is while I do need to do some kerning, the nature of blackletters makes it far less necessary (except in Greek, jeez I swear there is no good default spacing)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "30 Jul 2008 — 8:03am",
      "content": "Dude, nice.  \nYou keep this up, OK?\n\nhhp\n\n"
    },
    {
      "time": "30 Jul 2008 — 10:42am",
      "content": "Funny you posted here hrant, I was actually going to e-mail you this weekend asking for a critique of the Armenian version (started it yesterday afternoon), since I have a feeling I'm going to absolutely butcher the capitals. I don't suppose you have made/seen any examples of blackletter armenian?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "30 Jul 2008 — 11:12am",
      "content": "Nice you hear of your continuing efforts in Armenian.\n\nThe thing is, being an anti-Latinization guy I'd like to see  \nsome sort of eventual disclaimer, even if it's a token effort.  \nAmericans and even Russians don't really need to worry  \nabout assimilation the way Armenians do. This stance is  \nbased partly on things like the monstrosities seen here:  \n [http://www.armsite.com/software/](http://web.archive.org/web/20150317225726/http:/www.armsite.com/software/ \"http://www.armsite.com/software/\")  \nOne of them is even called Frankenstein...  \nNadine would appreciate the candor I'm sure! :-)\n\nIn any case please do send me any samples.\n\nhhp\n\n"
    },
    {
      "time": "30 Jul 2008 — 11:22am",
      "content": "Yikes, that frankenstein one does look terrible. Is it even readable? I would think it's way too high contrast to be even readable by the most liberal sense of the word.\n\nI had actually though that Armenian and fraktur would be a good fit since they both go far better with long descenders and ascenders. I still wish I had taken a picture of this beautiful calligraphy of the Armenian alphabet at a restaurant I would eat at in Pozuelo by the train station (although the fact that a Döner Kebab shop is called Ararat is suspect heh). I dunno, I definitely see how it could be seen as Latinization, but I (personally at least) see fraktur/blackletter as almost being its own script until itself especially when traditional forms are used, hence I tried to stay as true to fraktur roots as possible.\n\nHow \"bad\" is the ArTarumian Africkian on that page?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "30 Jul 2008 — 11:44am",
      "content": "\\> they both go far better with long descenders and ascenders.\n\nThat's a good point. I do think it's doable, just not at all easy.  \nAs usual in type design the elusive ingredient is always Subtlety.\n\nAfrickian\\* doesn't seem Latinized to me (even though there might very well be a Latin font that served as its inspiration). Mostly it seems to be based on the laughable habit of taking a basic graphic element and force-feeding it to a script. You know, the sort of thing that a graphic designer would do... Graphic designers train poodles; we handle anacondas.\n\n\\* I think the design is supposed to look African... Although there's  \nthe Armenian last name \"Afrikian\" and maybe that's the connection.\n\nhhp\n\n"
    },
    {
      "time": "30 Jul 2008 — 9:22pm",
      "content": "I've been toying with the idea of designing a Russian blackletter, whenever I have about a month of free time (i.e., not for years probably). This is a great effort in an akin type, especially from someone with no Russian background. I only have two semesters of Russian behind me, but I think I can help you. My main suggestion is to base the minuscules off of cyrillic script (handwriting) style characters, not the roman characters you always see in modern serifs. I don't know how much you know about this stuff, but cyrillic italics are still based off of the handwriting letterforms rather than the roman-modern-type ones, so you can look at a handy cyrillic italic to learn what these letterforms are. In a font like this, very kindred to handwriting, I expect the forms immediately to be of the handwriting type, and it's jarring to see them based off the serif forms. Probably the letter that throws me off the most is the em; it reads as a te, because a handwritten te looks exactly like that em. After that, the te strikes me more as a 7 than a te, and could even be mistaken for a che. The zhe seems too busy, maybe. The pe would read better if it looked exactly like your latin m. The de would work better in one of two forms: like an ð with no crossbar, or else like a single-story g--both of these read clearly as a de for cyrillic readers. The ve could be based on an e, with the outstroke coming back up to the bowl--that's a form I've been thinking should work for my possible blackletter. And your ya ought to be derived from the ah, because it started out as an ah with an i attached before it. This would fix the chirality issue it has. Other than that, your lowercase works very well, and would be really interesting to read in, if I could read Russian for any respectable length of text. Heck, I suppose it's still pretty interesting, even at my amateur fluency.\n\nThe capitals are mostly a ton of fun. Occasional ones look a bit awkward, like the Zhe. The En isn't working at all; it needs to have two vertical lines and a crossbar, because the \"h\" form isn't recognizable to cyrillic readers as equivalent with the \"H\" form. The cyrillic En derived from the Greek Nu, which of course looks exactly like our N. (If I may use a term from high-school biology, the two are an example of convergent evolution, like the similar shapes of insect and bird wings, even though the two evolved along completely different paths.) The El and Em are probably usable, though I'd be more at ease with them if they had no stems (like your lowercase el doesn't). The Te also, while probably legible, could do with some big honkin' serifs of some fashion on the crossbar. Those serifs are where the \"m\" form of lowercase te came from, and in handwriting the big serifs are very common. A cursive Te is three vertical strokes, topped by a horizontal one. The Pe would follow the Te's design.\n\nI may have given you more information than you ever plan to use, but hopefully this has been useful to you. I hope you keep it up--I think you may be the first to try this (this statement awaits correction), so you're a pioneer in it!\n\n"
    },
    {
      "time": "31 Jul 2008 — 8:27am",
      "content": "I was thinking similarly, Number3Pencils, about the script/type distinction, but as this is a print font, I wasn't too disturbed by it. I would like to see, as I mentioned, glyph variations, or even an entire Italic version (an italic gothic?) based on the handwriting versions, though.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "31 Jul 2008 — 7:03pm",
      "content": "Noticed a mistake: \"The pe would read better if it looked exactly like your italic **n** ,\" that should read. Also, I'd consider a ghe that looks like a backwards s (with chirality properly reversed, of course). And your be could work well with a delta-shaped form--that form is common in handwriting, and it's the one I learned when I learned the cyrillic cursive alphabet. It seems odd at first, but it does read as a be. Maybe your ka shouldn't go outside the short-letter box above <cite>and</cite> below. And your ef is pretty sweet, but it has chirality issues on the left side.\n\n"
    },
    {
      "time": "31 Jul 2008 — 7:36pm",
      "content": "Thanks everyone for the number of comments and suggestions. I'll work on all of them and see how they go (no other way to see which works better).\n\nIf I give т the shape of m, what shape then would I give м? The handwriting samples I found showed that м would get a bar over it, but that's definitely something I associate strongly with (pure) handwriting (Sütterlin) as opposed to blackletter/fraktur.\n\nRe the ef, I still need to go in and touch up curves on that and others, the basic design at the moment as had more priority (I'm assuming you're referring specifically to the slant on the curve rather than that it's disconnected no?). I'll take a break at some point to go in and really polish up each letter.\n\nI'm going to work a couple of alternatives for some of these and then make a page where you can swap out the letters dynamically and test the alternates. Then I (and y'all) can take a look at how the various alternates work in tandem. I'll do that next since i need to take a break from the Armenian, as hrant mentioned, it's a good bit of work to get fraktur and armenian to unite, possible, but jeez my first draft sucks.\n\nAlso, a first draft (emphasis on first) of the site is up with the draft version of the font used in the PDF posted above (which is lazily made, you can definitely see some alternate characters placed in control character slots etc) for download/embedding:\n\n[http://coruna.elahorcado.net/](http://web.archive.org/web/20150317225726/http:/coruna.elahorcado.net/ \"http://coruna.elahorcado.net/\")\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "1 Aug 2008 — 5:12am",
      "content": "Actually, it's the lowercase handwritten t that gets a bar over it....I'd have to upload a sample of writing, and I don't have a scanner here...\n\nYou know what, lemme try this:\n\n_Тт Мм Жж Кк Лл Пп Бб Дд Чч Гг Зз_\n\nIf the above showed up as italic, you'll get a picture of what we mean. Italic Cyrillic characters are typically based on the handwritten forms, at least in the lowercase.\n\nIn a few fonts: [http://img171.imageshack.us/img171/206/cyrillicitalickx7.png](http://web.archive.org/web/20150317225726/http:/img171.imageshack.us/img171/206/cyrillicitalickx7.png)  \nTimes New Roman, Arial, Adobe Caslon Pro, Myriad Pro\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "1 Aug 2008 — 9:37am",
      "content": "Hrm, that's going to be a hard distinction to make in blackletter, since it's using weight distinctions in places that would be uniform in blackletter.\n\nThis is the table I was looking at that had a variety of forms: [http://www.pitt.edu/~armata/cyrillic.jpg](http://web.archive.org/web/20150317225726/http:/www.pitt.edu/~armata/cyrillic.jpg \"http://www.pitt.edu/~armata/cyrillic.jpg\") Maybe the descending variant of т would work better? How common is it?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "1 Aug 2008 — 10:12am",
      "content": "Hrm...I've never encountered some of those forms, although my Russian instructor did show us a variant of lowercase t which looked a bit like a Greek tau (τ).\n\nI also don't see ф there, although it's hard to mistake.\n\nA lot of Cyrillic cursive letters look alike, since they're based on what I'll call the English cursive i-without-a-dot shape - _и, л, м, ш, щ, ц_ . The л and м, as well as я, have little curly-cue strokes before them, though, to differentiate them. You can sorta make that out on the image you posted. I do agree it'd be difficult to \"Frakturize\" a cursive м though...\n\nHere's my horrible Paint rendition of how you might approach some \"italic\" Cyrillic Fraktur: [http://img212.imageshack.us/img212/6466/paintfrakturzk5.png](http://web.archive.org/web/20150317225726/http:/img212.imageshack.us/img212/6466/paintfrakturzk5.png)\n\nBtw, what would you title the font? Maybe something on the border between the Slavic and Germanic, like Vlad?\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "1 Aug 2008 — 11:32am",
      "content": "I'm calling it Ælbrocan. Brocen is the old English equivalent of fangere (« fratus « fraktur) and since I'm breaking other alphabets other than just latin, so to speak, I added on the prefix Æl (al- in modern English or omni- from the Latin). Brocan's the participle form of brecan, so we have Ælbrocan — all broken/fractured (but in the sense of broken shaped letters rather than non-functioning). That and I really like my Æ ligature. :)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "1 Aug 2008 — 11:57am",
      "content": "Heh...I like that. All-broken :D\n\nBtw, re: your signature. My Spanish is really rusty (so much for 5 years of study); would you mind translating it?\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "1 Aug 2008 — 12:11pm",
      "content": "Ack, by the way that should be “_Brecan_ is the old English equivalent...”\n\nIt means \"The future is a line so fine that we barely realize that we ourselves paint it”, it's from a short film by a friend that won a few awards over in Spain.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "1 Aug 2008 — 12:58pm",
      "content": "Ah....it was the syntax there that threw me, I guess — \"...we realize that paint it we ourselves.\"\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "1 Aug 2008 — 12:59pm",
      "content": "That chart you were referring to was a fairly confusing one. It shows lots of cursive forms that I've never encountered before, and it's also done in what appears to be a marker - hardly nice for something that should have precision.  \nWhat I meant by chirality issues on the ef is that the two bowls are mirror-symmetric, not rotationally symmetric, and that leads to stress on the left side for which a scribe would have to turn his pen some sixty degrees. I like when the pen angle is pretty constant throughout a font. I also noticed pen angle changes in the ya, Ya, Zhe, and now that I look for more, also the Eh, Ef, and maybe Ze (top part). For the lowercase em, I recommend you just use the el, and add an extra hump--that's usually the done thing, I believe.\n\nI looked at your Greek, too. I think the form you have for your upsilon now actually reads as a good kappa (strange, huh?). And the nu form would work as an upsilon, I think--I don't recall ever seeing an upsilon with a stem. For a nu form you'd have to come up with something new (no pun intended). Something without curves, maybe. Your Sigma is very confusing for me; do you have a precedent for that form? Also, for the same reason that form didn't work for cyrillic En, I don't think you can use the \"h\" form for Greek Eta. Chirality rears its head again in epsilon, Phi, phi, and omega. I love the texture, though, and most of the face--the lambda especially.\n\n"
    },
    {
      "time": "1 Aug 2008 — 6:56pm",
      "content": "\\> Chirality rears its head again\n\nChop chop!\n\nhhp\n\n"
    },
    {
      "time": "1 Aug 2008 — 8:48pm",
      "content": "Hrmm?\n\n"
    },
    {
      "time": "1 Aug 2008 — 9:50pm",
      "content": " ![](http://web.archive.org/web/20150317225726im_/http:/typophile.com/files/chirotrophy_4551.jpg)\n\nhhp\n\n"
    },
    {
      "time": "1 Aug 2008 — 11:05pm",
      "content": "If I recall correctly (correct me if I'm wrong, of course, I remember the discussion from a year or two ago and simplifying now a good bit), and I'm simplifying a good, hrant makes a distinction between type design and calligraphy, one of which is dependent on the movement/form/handling of the pen and the other one free to do more.\n\nPut (again, I think, please correct if not right) another way, in this case, there's nothing wrong in touching up and fixing the curves it does the font good, but it shouldn't be \"just\" because that's how it would look with a pen.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "2 Aug 2008 — 8:44am",
      "content": "True. I just think that it looks distracting when the pen angle changes in such a calligraphy-inspired face. I suppose there's nothing inherently wrong in it, but I personally feel like fonts look better when they keep the same pen angle throughout.\n\n"
    },
    {
      "time": "2 Aug 2008 — 8:48am",
      "content": "\\> it looks distracting\n\nOnly to a chirodesigner. To an actual user, the opposite is often true.\n\nhhp\n\n"
    },
    {
      "time": "2 Aug 2008 — 8:54am",
      "content": "Sounds like you've done a study where you asked layperson friends to rate which was more distracting. However, did you do that with blackletter? Seems like blackletter, being more rigid, might give you different results.\n\n"
    },
    {
      "time": "2 Aug 2008 — 9:00am",
      "content": "Also, I just noticed that your phi could read as iota-rho.\n\n"
    },
    {
      "time": "2 Aug 2008 — 9:45am",
      "content": "No study, just some years of observation and introspection.\n\nBlackletter: since the whole style is \"distracting\" the issue becomes moot. Which again leads to the conclusion: why bother? For kicks? Users don't pay for our kicks.\n\nhhp\n\n"
    },
    {
      "time": "2 Aug 2008 — 12:30pm",
      "content": "<cite> Users don’t pay for our kicks </cite>\n\nEspecially when the font is free ;-)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "2 Aug 2008 — 5:43pm",
      "content": "I guess it's down to the designer, then. As long as it's a conscious decision to break the \"rule\", then it's all right--I just wanted to point it out. And, <cite>I</cite> think it would look better with normal chirality.\n\n"
    },
    {
      "time": "10 Sep 2008 — 5:34pm",
      "content": "smal д i would mix up in a text as for all els - it works\n\n"
    },
    {
      "time": "28 Sep 2008 — 11:35am",
      "content": "I think this is wonderful exercise, and there is much untapped ground in the realm of Cyrillic blackletters!\n\nAs a Russian I found lowercase \"el\" \"en\" \"k\" \"u\" and \"em\" very confusing.\n\nл - looks like a scripty п  \nн - looks like a Latin \"h\" and has no relation to anything found in Cyrillic  \nк - looks like iс  \nу - is nearly impossible to recognize as anything but п  \nм - looks like a scripty form of т  \nц - looks like either у or ч\n\nIt took me over a minute to decipher the word \"унциальному\"\n\nStill, I think this could be a foundation of a really exquisite typeface!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20150317225726/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "12 Dec 2009 — 2:37pm",
      "content": "My curiosity got piqued, so I did a search...\n\n[http://commons.wikimedia.org/wiki/File:Ustav\\_-\\_cyrrilic\\_writing.gif](http://web.archive.org/web/20150317225726/http:/commons.wikimedia.org/wiki/File:Ustav_-_cyrrilic_writing.gif \"http://commons.wikimedia.org/wiki/File:Ustav\\_-\\_cyrrilic\\_writing.gif\")\n\napparently Ustav is considered to be a Cyrillic **uncial** rather than a Cyrillic blackletter.\n\n"
    }
  ]
}
