{
  "id": "47743",
  "title": "Chacón",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": " ![](http://web.archive.org/web/20150417175158im_/http:/typophile.com/files/chacon_4992.jpg)\n\nThis typeface it's designed based upon the work of the \"brigade Chacón\", the graphic team of the Chilean Communist Party.  \nI make it in a grungie style, because it's used in painted paper over walls.  \nI had to do the \"no grunge\" style for the work in Chacon, but i prefer the texture and the style of Chacon.  \nPlease critique.\n\n",
  "author": "Jaime Ayala",
  "time": "24 Jul 2008 — 10:32pm",
  "uid": "7401",
  "comments": [
    {
      "time": "25 Jul 2008 — 1:23am",
      "content": "I like it. Reflects communism at first sight. I guess it's better to finish the typeface first and add scratches later.\n\n\"K\" and \"R\" are not legible to me. \"I\" looks shorter in white text. \"G\" looks like borrowed from another typeface.\n\nHow about a \"Y\" like below? IMHO it suits your typeface better... To E, F, A etc.\n\n ![](http://web.archive.org/web/20150417175158im_/http:/typophile.com/files/poster-13_5978.jpg)\n\n"
    },
    {
      "time": "10 Aug 2008 — 6:55am",
      "content": "Personally, I like the \"K\" and \"R\", but I agree that the \"G\" and \"Y\" need work.\n\nPS: yuzgen, that \"Y\" you speak of is actually a Russian che \"Ч\"\n\n"
    },
    {
      "time": "10 Aug 2008 — 7:26am",
      "content": "i think the K and R are what really make this typeface great. i had no problem reading them.\n\n"
    },
    {
      "time": "10 Aug 2008 — 10:01am",
      "content": "\"K\" seems like a stylized \"V\" to me and \"R\" is a \"D\". More with the \"R\"; looking at the \"P\", it's so different.\n\nSuppose you're looking at a poster from a far distance:\n\n ![](http://web.archive.org/web/20150417175158im_/http:/typophile.com/files/Picture-11_5001.png)\n\nI know \"Ч\" is cyrillic, but it should fit better. Current \"Y\" associates to Bauhaus as in ITC-Bauhaus bold's \"Y\". \"Ч\" looks like a \"4\" though.\n\n"
    }
  ]
}
