{
  "id": "47749",
  "title": "Finding/replacing space after in InDesign?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey, all. So I'm finding that, for my current project in InDesign, I'm always having to adjust the \"Space After\" paragraph property manually. I'm working with a baseline grid of 4pt, so I want most paragraphs to have that 4pt (0.0554 in.) space after. The problem is that I'm working with mostly material that I didn't generate (it's an editing job), and even text that I import has that space at 0.0556 inches. Because all my leadings are multiples of 8pt, the snap to baseline grid forces two 4pt spaces after paragraphs (I also have to change every instance of .00007 in to 0 in, for lists where I don't want spaces).\n\nSo I've found the Find/Replace feature useful for applying formatting such as text size, leading, and underline options with a broad brush, but for whatever reason, I can't get it to work for Space After. I set the \"Find Format\" box to the space after I don't want, the \"Change Format\" box to the space after I do want, and then when I click find, it tells me it can't find any instances.\n\nAnybody tell me what I'm doing wrong?\n\nPeace,  \nJT\n\n",
  "author": "jt_the_ninja",
  "time": "25 Jul 2008 — 6:16am",
  "uid": "33323",
  "comments": [
    {
      "time": "25 Jul 2008 — 6:24am",
      "content": "Hi,\n\nJust wondering if you have set up a paragraph style for your text, which would make it easier than manually applying the properties?\n\n"
    },
    {
      "time": "25 Jul 2008 — 6:28am",
      "content": "Oh, I've toyed with the idea, but the stuff I'm working with came imported with all kinds of paragraph styles already, and I don't even want to mess with that tangle if there's a way to do it with find & replace. I'm not a professional; I'm basically teaching myself InDesign as I go.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "25 Jul 2008 — 6:35am",
      "content": "How about using a script? Have you looked into those yet?\n\nCan you not just import the text unformatted and then apply your own style to it?\n\n"
    },
    {
      "time": "25 Jul 2008 — 6:40am",
      "content": "Don't know what you mean about a script, sorry. My degree is in Creative Writing and Linguistics, not programming.\n\nAs for importing it unformatted, I'm not sure...I think InDesign applies defaults to it anyway, doesn't it? Anyway, I'd really prefer not to add double the work to the job if possible. Thanks for your suggestions, though.\n\nAnyone else have an experience like this?\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "25 Jul 2008 — 6:48am",
      "content": "No problem.\n\nScripts are just little automation doodads built into InDesign to make life easier. My process is to import the text and reformat using my own paragraph styles - but that's just my way of doing it. I guess there are a dozen different ways of doing things\n\n"
    },
    {
      "time": "25 Jul 2008 — 7:13am",
      "content": "<cite> I’d really prefer not to add double the work to the job if possible.</cite>\n\nThat's why you should use the paragraph styles.  \nSet them up once, and you will have none of these problems. You can even map the paragraph styles in the original document to your styles when you place the document.\n\n"
    },
    {
      "time": "25 Jul 2008 — 7:18am",
      "content": "@ Ralf: Well, yeah, but like I said, the styles are already a mess, and I've no clue at this point what's formatted as what.\n\nMy original question was not, \"How would someone do this?\" but \"Why does the Find Formatting feature have an option to search for space after if it cannot, in fact, do so? Or am I using it incorrectly?\" Sorry if I confused anyone. –\\_–\n\nPeace,  \nJon\n\n"
    },
    {
      "time": "25 Jul 2008 — 7:20am",
      "content": "You can learn about paragraph styles on lynda.com. There is an excellent video on style sheets in InDesign and you can get a free 7-day subscription by going to lynda.com/deke\n\nThe investment in time you take to learn the tool will pay dividends many times over.\n\nTad\n\n"
    },
    {
      "time": "25 Jul 2008 — 7:45am",
      "content": "The problem is that I'm not setting up the document...there is no \"later on down the road\" for this project. I'm already there. Next time I'm setting up a document, I'll go with style sheets (already know how useful they are), but I didn't generate 90% of the text in this case, so it's a tangle of whatever's already there.\n\nCould I just get an answer to my question?\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "25 Jul 2008 — 8:22am",
      "content": "Go to find/replace and click on the little magnifying glass next to \"find format\" near the bottom of the dialogue box. This pops up a new window. On the left hand side click on \"Indents and spacing\" and put in the current space after value in the \"space after\" field. Click OK.\n\nThen click on the magnifying glass on the \"change format\" and do as above, but this time put in your desired value in the \"space after\" field.\n\nClick OK.\n\nClick Find/Change or Change All if you're feeling brave.\n\nThere are other options there as well.\n\nHope this helps!\n\nI'm presuming you're on CS3?\n\n"
    },
    {
      "time": "25 Jul 2008 — 8:27am",
      "content": "@tak5haka: That's exactly what I've been trying...it can't find any instances, even when I have copied and pasted the correct values, and have the drop-down box set at \"Document.\" Hence my question.\n\nAnd yeah, I use CS3.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "25 Jul 2008 — 8:35am",
      "content": "What I have just done as a test is to choose \"GREP\" instead of \"TEXT\" on the main dialogue and then in the \"find format\" option chose one of my existing style sheets (in \"style options\") and nothing else.\n\nI then changed the space after value only in the \"change format\" dialogue and it worked.\n\nTry that and see if it helps.\n\nThat way it picks up that particular paragraph style and changes that one value.\n\n"
    },
    {
      "time": "25 Jul 2008 — 9:01am",
      "content": "Good idea, but it didn't work well, because whoever did this text originally (in PageMaker!) used the same paragraph style for different types of text, in places...I think...like I said, it's such a tangle of stuff that I've tried my best to avoid dealing with paragraph styles; one small change somewhere might throw a whole page out of whack, and I'd have no clue what was going on with it.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "25 Jul 2008 — 10:05am",
      "content": "Yikes!\n\nNo wonder you're pulling your hair out! Sounds like a real nightmare.\n\nWelcome to the wonderful world of typesetting and layout! As I said before, which isn't much help to you, personally I would have imported the text without any pre-existing formatting and done my own from scratch.\n\nRegardless, and unfortunately, it sounds like you're going to have to do it manually.\n\nLaters ...\n\n"
    },
    {
      "time": "25 Jul 2008 — 10:53am",
      "content": "\"Good idea, but it didn’t work well, because whoever did this text originally (in PageMaker!) used the same paragraph style for different types of text, in places...I think...like I said, it’s such a tangle of stuff that I’ve tried my best to avoid dealing with paragraph styles; one small change somewhere might throw a whole page out of whack, and I’d have no clue what was going on with it.\"\n\nSometimes you have no other option than to kill all the formatting and start over with precise paragraph and character styles. This appears to be one of those times. I'm sorry that it's not the answer that you're looking for, but it _is_ the only answer that's correct.\n\nHere is why: the Find/Change format options are exact. If you import text that is 6.295pt, InDesign will round that off in the _displays_ to 6.3pt. But when searching for it in Find/Change, ID still treats it as 6.295pt, so it won't be found. Either find that discrepancy somehow and account for it in your search, or start over. I wish you luck.\n\n"
    },
    {
      "time": "25 Jul 2008 — 1:30pm",
      "content": "\"Here is why: the Find/Change format options are exact. If you import text that is 6.295pt, InDesign will round that off in the displays to 6.3pt. But when searching for it in Find/Change, ID still treats it as 6.295pt, so it won’t be found. Either find that discrepancy somehow and account for it in your search, or start over. I wish you luck.\"\n\n^ Well, that tears it...no way I'd be able to determine what it means by .0597 in (the default, despite my earlier typo) in the display box.\n\nYeah, I guess it'd have been better if I'd just started clean...next time...\n\nThanks for your help.\n\nPeace,  \nJT\n\n"
    }
  ]
}
