{
  "id": "47756",
  "title": "Promo tee design",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Did this as a promotional t-shirt for a photographer friend of mine. We'll be printing it two color on either a black or dark gray shirt, possibly with a very small tagline or URL on the back. It's fairly final but I'm doing some tweaking, I'd love to hear some feedback and crits either way. Thanks.\n\n[bigger version here](http://web.archive.org/web/20130824145454/http:/www.figdigital.com/misc/grungeshirt01_rev03.jpg)\n\n ![](http://web.archive.org/web/20130824145454im_/http:/typophile.com/files/grungeshirt_sm_5445.jpg)\n\n",
  "author": "cfig",
  "time": "25 Jul 2008 — 9:17am",
  "uid": "27157",
  "comments": [
    {
      "time": "25 Jul 2008 — 1:02pm",
      "content": "thats a killer design, i'd buy one. Thats really all I can say. Nice!  \n-ONE\n\n"
    },
    {
      "time": "25 Jul 2008 — 1:44pm",
      "content": "Combines current tropes of Bantjesism, broken scripts, and floating, apparently solid type.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20130824145454/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "29 Jul 2008 — 5:40pm",
      "content": "I love the design but do have a few minor suggestions:\n\nThe kerning between the \"P\" and \"A\" of \"passion\" is too loose. Same with the \"e\" and \"a\" of real. And I might tighten up the front end of \"emotion\" too.\n\nThe graphic at the lower left corner feels a bit heavy to me. It throws off the balance. Perhaps if that particular graphic was a bit transparent (lighter) the balance would seem better.\n\nAgain, these are minor. You did a great job with it.\n\n"
    },
    {
      "time": "29 Jul 2008 — 8:05pm",
      "content": "Now that you mention it the kerning between \"P\" and \"A\" is killin' me :) Good call on the others too, appreciate the feedback. The top splatter mark was originally a little more solid which I think balanced the overall design with the bottom graphic a bit better. I'll take a look and do a bit of tweaking.\n\nThanks for the comments guys, though I don't know that Joe is much of a fan...ah well ;)\n\n"
    }
  ]
}
