{
  "id": "47755",
  "title": "minuteman logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello all,\n\nI've been working on a business card project and could use some feedback. Minuteman3 is from the first round of designs and my friend was leaning towards this one. The art is from a famous statue that has also been converted into stock art. This piece is from my combo sketches from both sources. However it is quite common and has been used in many other logos. The name \"Minuteman\" is not set in stone, there is another Minuteman appraiser in another state. The client is thinking of just changing the name to \"Minutemen\" but I want to suggest changing it to \"Connecticut Minuteman\". Minuteman16 and 17 are revised with the name change and new original art. I also modified (the i and the u) in the Cezanne font a little to make it more readable. The new minuteman is more of an icon than drawing. I thought he would reproduce better and be more recognizable as a minuteman. However does the script style of font now work with a less sketchy style of image? I've been looking at this a lot on my own and could really use some fresh eyes.\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman3_3579.gif)\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman16_3840.gif)\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman17_4560.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [minuteman3.gif](http://web.archive.org/web/20150112051612/http:/typophile.com/files/minuteman3.gif) | 15.01 KB |\n| [minuteman16.gif](http://web.archive.org/web/20150112051612/http:/typophile.com/files/minuteman16.gif) | 18.56 KB |\n| [minuteman17.gif](http://web.archive.org/web/20150112051612/http:/typophile.com/files/minuteman17.gif) | 18.96 KB |\n\n",
  "author": "Kirs10",
  "time": "25 Jul 2008 — 8:47am",
  "uid": "17904",
  "comments": [
    {
      "time": "25 Jul 2008 — 9:16am",
      "content": "I do prefer the changes you made to the Cezanne type - nice subtle changes, but they really do help. I think file minutemen3 is the most successful - I don't know if the line behind the minuteman is really needed. I would also look at maybe using a sans serif typeface to compliment the script title. Hope that helps in some way.\n\n"
    },
    {
      "time": "25 Jul 2008 — 9:38am",
      "content": "The Minuteman looks very clip-arty to me. That said, I think Minuteman 3 is better - looks like more professional clip art and suits the type treatment. If you're going to use a handwriting font, I'd customize any letters that repeat - the last 'n' is a prime candidate. Also watch the kerning in \"APPRAISALS' - especially the RA pair.\n\n"
    },
    {
      "time": "25 Jul 2008 — 12:15pm",
      "content": "I agree that 3 is the best, but overall, I feel it's too busy. IMO you have too many fonts and too many varied sizes. My eye leaps all over the place. Seven lines of text, each one with a different font and/or size?! Editing with an eye for simplicity may go a long way to solve this project.\n\n"
    },
    {
      "time": "25 Jul 2008 — 3:01pm",
      "content": "Maybe its just me not being from america but a guy with a gun as a central part of a company's visual identity really makes me uneasy, feels a tad sinister and menacing.\n\nFar too many type sizes and shades - too busy. Looks like an ad in a cheap property trade magazine rather than a business card. The balance feels off in all of them - eg look at number 17. Shouldn't the right hand side of Conneticut, Appraisals and Reliable line up?\n\nThe name and tel etc at the bottom of the card feel like an after thought. I don't know where the logo finishes and the contact details begin.\n\nI do like the 'minuteman' and 'appraisals' typeface combination though\n\n"
    },
    {
      "time": "25 Jul 2008 — 3:03pm",
      "content": "I like 3 best. More breathing room and whitespace.\n\nthe minuteman graphic I am not too fond of. It makes me think literally about the minuteman as opposed just having more elegant text. Then you would also have some people think the guy can do appraisals in a minute. That would be a nice coincidence :)\n\n"
    },
    {
      "time": "28 Jul 2008 — 9:55am",
      "content": "Thank you all, I greatly appreciate your feedback.\n\nI'm posting a revised design but first I want to address David's concerns about an armed figure. My client and I discussed the impression of the minuteman holding a gun may have. However he really likes the tag line Fast Accurate Reliable. The minuteman is a strong historical national symbol, especially in New England. He represents the spirit and independence of the individual. That said guns certainly are a negative in modern society. Which is why we opted to go with a relaxed yet ready pose rather than a figure firing or aiming. In my first round of designs I did present versions with architectural elements (focusing on the real estate angle). My client felt that with the name Minuteman it needed to show a minuteman. He is considering a name change, so perhaps he will re-think the figure as well.\n\nI've simplified the overall design and drew a new minuteman (He still needs work). I also tweaked the second \"n\" so that it is not exactly like the first and thus appears more like handwriting. I kept the serif font, after trying many sans, with the name and colonial figure it just seemed too modern and out of place.\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman18_4614.gif)\n\n"
    },
    {
      "time": "28 Jul 2008 — 2:22pm",
      "content": "As I said - fast, accurate and reliable next to an image of an armed guy has menancing undertones to me - but i'm definitely NOT your target market so take that with a grain of salt. Its obviously not a global company and you have to look at who you are designing for - if you think the solution will resonate with New England home owners then i guess you have your answer.\n\nIn terms of the design i think the new version is an improvement, its less cluttered than the others. A couple of things i'd look at...\n\n- Generally i'd put the job title under Patrick's name then have a large bit of leading or even a line break between the job title and phone. Does the number need a preface/label? ie Mobile/Office/Home. Is there a website or email address too?\n\n- I don't like the gray line. You've now got a lot of white space that could more elegantly accomplish the visual seperation of logo/contact details. Seems like the logo is sitting a little low too, could it be nudged up? If you're still experimenting it might also be interesting to look at a version with the logo much smaller and maybe positioned up the top right corner?\n\n"
    },
    {
      "time": "28 Jul 2008 — 2:34pm",
      "content": "I don't get a negative sense from the fact that the minuteman has a gun, and I want to lend support to your claim that the image evokes more of a sense of history and reliability than violence. The pose you chose in this latest rendering reinforces this idea. People that can't handle the historical fact that minutemen carried rifles need to get over themselves. If your client is going to stick with the name \"Minuteman Appraisals,\" then I think you need to stick with the guy holding a gun.\n\nAdditionally, I think you're right about the cultural context of New England. Having grown up in New Jersey, and now living in California, I've always been in a politically progressive context, and generally hold politically progressive ideas myself. Nevertheless, now that I live in California, I've found many West Coast people annoyingly politically correct and considerably uptight about being laid back. (Before anyone gets too offended by my criticism, mind you that my wife is a Californian.) I think this business card is well executed and appropriate for the client's context. As always, I'm open to dialogue and push back on my opinions, but sometimes West Coasters and Europeans need to understand the unique paradox of progressive, \"politically incorrect\" Northeasterners.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "29 Jul 2008 — 12:35am",
      "content": "For some reason Cezanne is not working well with this piece. Also, try not to be so literal with the minutemen illustration.\n\nRegardless hit up Borders and look up some books to see how people treat Cezanne with a serif because right now everything its looking kinda confusing with sizes and letter spacing.\n\nI would try to nail out the logo first and then do the business card because when I try to do both at the same time I design in circles.\n\nKeep up posted!!!!\n\n"
    },
    {
      "time": "29 Jul 2008 — 1:15am",
      "content": "Interesting posts.\n\nCommenting on the man holding the gun.  \nFor US citizen it may be a normal piece of history.  \nBut for non-US it is different. We are talking about different cultures and believes, perhaps.  \nAs non-US I do understand the historical influence of the figure and understand the choice.\n\nThe new design is an improvement.\n\nBut why the grey line?\n\nHas it a purpose? If not, loose it.\n\nRay\n\n"
    },
    {
      "time": "29 Jul 2008 — 4:25am",
      "content": "\"The minuteman is a strong historical national symbol, especially in New England.\"  \nUnderstood, but once one says the word \"minuteman\", who but a child needs a picture?\n\nCheers!\n\n"
    },
    {
      "time": "29 Jul 2008 — 7:49am",
      "content": "Wow, what great and interesting comments (and some really good design suggestions as well). I certainly didn't expect a little minuteman to stir up a debate. A bit of a myopic view perhaps however given the project it just may be the view to have.\n\nI added the line because the figure seemed suspended in space, it sounds like it's an unnecessary element so I'll try without. I also tried the figure smaller, but he started becoming an indistinguishable blob - which just means he needs to be drawn better and I already knew he needed more work. As for making him less literal, I'm afraid he might truly then become just a guy holding a gun. The client had envisioned his card to have a figure. When we discussed using other symbols (doorway, column and etc. to represent real estate) it seemed odd to use the name minuteman paired with a symbol other than a minuteman. And to dberlow's question Does it need a figure at all? No, I think not, so I'll be getting to work on refining the figure and trying some strictly typographic solutions.\n\nOh yes, and I agree with mad grab. Usually when working on logos I complete the logo and then move on to it's applications. This however is a start-up company that will be run out of his home. There will be no signage, no ads, no other applications (perhaps stationery for invoices at some point in the future) When I showed initial sketches, the client was concerned not seeing his name and contact info. Which is why I've been working on the whole of the card.\n\nFinally thanks again to you all for your thoughtful comments and suggestions. It's a small side job but that doesn't mean I want it to look like it's a small side job. Have a lot of work to do now. hopefully will post again soon.\n\n"
    },
    {
      "time": "29 Jul 2008 — 10:05am",
      "content": "Might I suggest dropping the minuteman figure and just using the elements that make him a minuteman... his rifle and hat, and constructing a logo image out of those 2 elements?\n\nPersonally, I don't think you need the \"Fast • Accurate • Reliable\" on the front, but that might not preclude it from being used on the back. Unless this is a single-sided black & white business card.\n\nAlso, your title should follow the name, then the phone number (and email/or website if any). So, something like this:\n\n**Patrick Henry**  \n_Certified Residential Real Estate Appraiser_ - or small caps in regular weight.  \n(123) 456-7890  \n [phenry@minutemanappraisals.com](mailto:phenry@minutemanappraisals.com)  \n [www.minutemanappraisals.com](http://web.archive.org/web/20150112051612/http:/www.minutemanappraisals.com/ \"www.minutemanappraisals.com\")\n\n"
    },
    {
      "time": "30 Jul 2008 — 9:55am",
      "content": "Here are some revisions going off of many of the suggestions from the forum. To me 20 and 23 are working best so far but still aren't quite there yet. The minuteman, although improved still seems mmmmm... awkward? Perhaps I should try a simple clean silhouette? Although, as a few people did suggest he may just not be needed. Which is probably why my favorite so far is 23. My concern is that the client's name doesn't stand out. I was thinking if I could add a color (a deep rich red) just for his name, it might be the pop it needs.\n\nAny recommendations on further improvements would be appreciated.\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman19_5375.gif)\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman20_4572.gif)\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman21_5406.gif)\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman22_4974.gif)\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman23_5581.gif)\n\n"
    },
    {
      "time": "30 Jul 2008 — 10:14am",
      "content": "Oh my, you need to step back.\n\nThings are starting to feel like a ransom note... all cut up and pasted where ever.\n\nLets get this back to a decent start point. Stop focusing on the icon/image. Stop worrying about the guy's name, title, phone number. Stop worrying about where or if to include FAST ACCURATE or RELIABLE.\n\nYou need to get a consistent logo. Is it just the Minuteman script or is APPRAISALS also part of the logo?\n\nOnce you have that figured out and consistent... then you can start thinking about the tag line... which should be consistent as well.\n\nAfter that, then you can start focusing on the name/title/number... remember Hierarchy is your friend. The logo will be more important than the name, but the name should be more important visually than the title and phone number. As I suggested earlier, you can do this with type styles and weights. Bold/Italic or Small Cap/Regular weight...\n\nI'd even lay out a grid to work within. You're alignment is atrocious (number 23 isn't even centered and it's sooo tiny, you'd need a magnifying glass to read it.)\n\nDo one or 2 version and print them out, looking at them as a physical proof will be extremely revealing than just looking at them on screen.\n\nI don't mean to come off harsh, but things are definitely getting away from you. You're juggling more than you need to and you're losing focus because of it.\n\nIt's just a business card, it's 2 inches by 3.5 inches... it's small; keep it that way. You'll never fit the Mona Lisa on it, so stop trying. Keep things simplistic, and add flavor with small embellishments.\n\n"
    },
    {
      "time": "30 Jul 2008 — 10:50am",
      "content": "Thank you. It may have been harsh (although not really you worded it so nicely) but it's what I needed to hear. I feel like I'm spinning in circles on this and I don't know why. To use a sports analogy I\"m trying too hard, I was swinging for the bleachers but wasn't focused on the fundamentals and ended up striking out. I do need to step back.\n\n"
    },
    {
      "time": "30 Jul 2008 — 10:54am",
      "content": "I agree with Asvetic.\n\nYour bottom two are the cleanest, but they're still jumbled. You need to look at what's most important and set their font size and weight accordingly. Don't get too crazy with different sizes and weights though. Keep it simple.\n\nCan you cut \"fast accurate reliable\" out? I generally think that good companies can stand on their own without a tagline. I don't think anyone's going to pick a company based on a tiny tagline pasted on a business card. ie: \"hmm I wonder if this company is any good. Oh look! It says they're fast, accurate and reliable! It must be true!\" It really doesn't add much. If you do decide to keep the tagline, however, put it with the logo and not with the info for the guy - It's the company you're describing . . . not Patrick Henry.\n\nWhat size font are you using by the way? If it's any smaller than 8 or 9 pt. you need to scale it up.\n\n"
    },
    {
      "time": "5 Aug 2008 — 12:10pm",
      "content": "After reviewing what I liked and did not like about this logo I'm posting my latest direction. Please let me know what you think.\n\nWhat I liked was the \"Minuteman\" script (Cezanne with some minor tweaks to the \"i\", \"u\" and second \"n\". However when I set the word \"Appraisals\" I found the Cap \"A\" and \"pp\" distracting (awkward for this particular word). In looking at other fonts I was drawn to both Declaration and Dear Sarah. The new design is still primarily Cezanne with influences from the other two fonts. Does it read as being written by one hand or does it appear too piecemeal? I'm trying to achieve an old, hand-written feel that isn't overly formal.\n\nI'm also attaching another go at a design with a minuteman figure. To me he's become extraneous but it is what the client originally requested so I wanted to work on it a  \nlittle more.\n\n#1\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman_t1_5932.gif)\n\n#2\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman_t2_5719.gif)\n\n#3\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman_t3_3474.gif)\n\n"
    },
    {
      "time": "5 Aug 2008 — 1:03pm",
      "content": "Now this is much better. It shows that you've put thought into it, made art direction changes instead of just slapping together elements that seemed to go together.\n\nI like the direction number 2 is going, this minuteman illustration is nice. Course, it still feels tacked on, making me think you can get away with just the logotype only. I would suggest beefing up the 's's and 'r's in Appraisals, they seem a bit too wispy.\n\nI might suggest a font pairing of Cezanne and Engravers (or something similar, like Farnham), for you Name, title and phone number later on.\n\nAnother thing to consider would be printing methods. Something more hand-hewn or letterpressed would make this art direction really sing. Paper selection coupled with perhaps a foil-stamped logo would look awesome (I'm picturing an off-white paper with a Colonial Brick Red back and the logo gold-foil stamped) then you'll have plenty of white space to set the important contact info which will make it seem even more luxurious... i.e., an appraiser who knows his stuff and will appraise a little on the higher-end perhaps or he appraises quality homes. Anyway, it would equal more money for both of you.\n\n"
    },
    {
      "time": "6 Aug 2008 — 9:19am",
      "content": "I adjusted the \"r\" and \"s\" slightly to give them more weight and I also worked on the positioning of the minuteman figure. I've tried the contact info in a few different fonts. t7 is Caslon, t8 and t10 are Engravers and t9 is Village. The .a versions include the \"fast accurate reliable\" tag line.\n\nAny other suggestions for fonts that might work well with the script would be welcome. As would any other suggestions to improve the script logotype itself. I'm a designer who loves type but not a type designer. I'm hoping I did not make any major faux pas in re-drawing some of the letter forms.\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman_t4_6399.gif)\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/minuteman_t5_6103.gif)\n\n"
    },
    {
      "time": "6 Aug 2008 — 10:00am",
      "content": "I like it: t9\n\nt8a, this one I don't like.  \nThe text is to wide/bold.  \nHard to read.\n\n"
    },
    {
      "time": "6 Aug 2008 — 10:09am",
      "content": "Kirsten, this is what I was thinking. Engravers might have been a bad suggestion, sorry. I ended up using Swift for the contact info. ( [http://www.fontshop.com/fonts/downloads/linotype/swift\\_pro\\_virtual/](http://web.archive.org/web/20150112051612/http:/www.fontshop.com/fonts/downloads/linotype/swift_pro_virtual/ \"http://www.fontshop.com/fonts/downloads/linotype/swift\\_pro\\_virtual/\"))\n\nI aligned Patrick's Name to the center of the card before adding anything else.\n\nI'd also suggest printing this on an off-white stock and try to get some sort of letter-press effect, even if it's just a simple gold rectangle like I've indicated on these versions:\n\nTop is a 2 sided version, bottom a single sided. Font sizes: Name 12pt, title 10pt, everything else 9pt. Everything is set in a regular weight.\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/mydeas_3893.gif)\n\n"
    },
    {
      "time": "6 Aug 2008 — 10:52am",
      "content": "T7 and T9 are my two favorites. I like Asvetic's two sided cards too, but I'd like them better with Caslon for the contact info.\n\n"
    },
    {
      "time": "6 Aug 2008 — 12:15pm",
      "content": "With Swift and Caslon...  \n(edit: I should have drop shifted the vertical alignment of the parenthesis on the Caslon version. Oh well.)\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/mydeas2_4422.gif)\n\n"
    },
    {
      "time": "7 Aug 2008 — 6:48am",
      "content": "Thanks everyone. I appreciate all your comments. Asvetic I love your idea of the 2-sided card, it's quite nice and elegant looking.\n\n"
    },
    {
      "time": "7 Aug 2008 — 7:08am",
      "content": "I hope I wasn't stepping on any toes, and I'll be happy to relinquish my files to you if you'd like, Kirsten. Just contact me through my profile.\n\n"
    },
    {
      "time": "7 Aug 2008 — 7:24am",
      "content": "My toes are feeling just fine. We are visual artists, at times it's just a better way to communicate an idea by showing it. I know sometimes that is considered a no-no on the forums though. Just heard back from my client who is very excited. He still wants to get in the \"fast, accurate, reliable\" line and we need to iron out the legal details of the name (does it have to include the LLC designation in the logo?) But we are in the final stretch. And again thank you all for your ideas, your input was a true benefit.\n\n"
    },
    {
      "time": "7 Aug 2008 — 7:40am",
      "content": "I'm glad I could help. You did all the hard work though, and it sounds like there's still more work ahead. Good luck.\n\nIt would be interesting to see the final printed cards, especially if you use more traditional letterpress techniques when printing. Please share your final design with us when completed.\n\n"
    },
    {
      "time": "21 Aug 2008 — 10:38am",
      "content": "No new designs. The client is busy creating the llc. and then we'll proceed.\n\nPentagram has launched a new series called Green Patriotism using a minuteman figure. Just thought it was interesting.\n\n[http://blog.pentagram.com/2008/07/green-patriotism-1.php](http://web.archive.org/web/20150112051612/http:/blog.pentagram.com/2008/07/green-patriotism-1.php \"http://blog.pentagram.com/2008/07/green-patriotism-1.php\")\n\n ![](http://web.archive.org/web/20150112051612im_/http:/typophile.com/files/Patriot_Poster_01_3781.gif)\n\n"
    },
    {
      "time": "21 Aug 2008 — 1:05pm",
      "content": "Only in america could that tone work. It makes me want to flush the toilet 11 times and leave the lights on all day just to rebel against the stupid military sentiment.\n\n"
    },
    {
      "time": "21 Aug 2008 — 1:20pm",
      "content": "You know. At first glance I saw the [friendly green giant](http://web.archive.org/web/20150112051612/http:/www.generalmills.com/corporate/brands/brand.aspx?catID=61). If these are on moving vehicles I hope people get a few chances to read it.\n\n"
    },
    {
      "time": "21 Aug 2008 — 9:11pm",
      "content": "<cite>Only in america could that tone work. It makes me want to flush the toilet 11 times and leave the lights on all day just to rebel against the stupid military sentiment.</cite>\n\nSurprise, Surprise... the British hate Patriots.\n\n"
    },
    {
      "time": "21 Aug 2008 — 10:39pm",
      "content": "Nothing wrong with patrotism, but some americans take it over the edge. Unfortunately.  \nAnd no, I'm not British.\n\nSame here regarding the color though. Looks like a tiny soldier kids play with.\n\n"
    },
    {
      "time": "22 Aug 2008 — 11:49am",
      "content": "<cite>Surprise, Surprise... the British hate Patriots.</cite>\n\nI don't hate patriots, I just don't understand what they, guns and assault vehicles have to do with global warming. Surely they need to be fostering understanding of the issues amongst the younger generations- dredging up horrible world war two propaganda posters with the 'we've been through this before' message is a far too detached and insular approach to a modern, complex and global issue.\n\n"
    },
    {
      "time": "22 Aug 2008 — 2:14pm",
      "content": "Patriotism is the cornerstone to the birth of America. The ultimate unifier, as we fought for our independence from British rule. Most Americans understands the intrinsic history of what being a Patriot is... and it's not only being a soldier on the war front. It's an idea, a belief that when unified against something much bigger than you, you'll still have a chance to defeat it.\n\nObviously, the campaign is geared towards Americans, but Patriotism isn't solely an American idea. It's just ingrained stronger here.\n\nI think the concept is strong, Global Warming is a beast bigger than us and it'll take a unified front to defeat it, but where the concept loses strength is that it is America-centered. Perhaps if following the war idea (which is a tired idea) they should have looked to the World Wars with Allieds, and made Global Warming the Axis of Evil.\n\n"
    },
    {
      "time": "22 Aug 2008 — 3:02pm",
      "content": "What world wars have america fought without the allies?\n\nThe 'axis of evil' is a modern-day Bush coined term used to describe north korea, iran and iraq...it was the basis of american validation for invading Iraq. If you seriously think that portraying global warming as Iraq/NK/iran is a valid foundation for a successful, modern campaign against global warming then you are utterly deluded, even in america.\n\nYou say that americans intrinsically understand patriotism, but judging from what you have written i disagree entirely - you don't even have a basic grasp of the facts - just a dumb 'grab your gun' guttural reaction.\n\n"
    },
    {
      "time": "22 Aug 2008 — 3:40pm",
      "content": "Weird ... I thought patriotism had been replaced with the term extremism ... or is that reserved for people from other countries?  \nAnyway ...we digress.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Australia](http://web.archive.org/web/20150112051612/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "22 Aug 2008 — 5:22pm",
      "content": "David, you're entitled to your opinions. Hell, I don't even know why I'm defending Pentagram's work, I didn't design it.\n\nEither way, the current discussion should stop. Unless it pertains directly to the original post's critic of Kirsten's Minuteman Logo and Business Card, this side conversation is unfair to Kirsten.\n\nIf anyone would like to continue an open discourse on Pentagram's Green Patriot work, feel free to start a new post under General Discussions.\n\n"
    },
    {
      "time": "3 Sep 2008 — 8:45pm",
      "content": "Hey Kirsten, whatever became of your final design on this before we got sidetracked?\n\nA little updated on progress?\n\n"
    },
    {
      "time": "4 Sep 2008 — 8:31am",
      "content": "Not yet, unfortunately. My client is busy getting his ducks in a row, taking the final exams for his certification, completing his understudy experience and registering the name. I should probably be getting my ducks in a row looking for printers. I'd like the final piece to have a certain feel, almost a hand crafted quality. My usual printer is good, but typically does slick 4/c work.\n\nAnd I didn't mean to hijack my own thread by posting the green minuteman. I just thought it was interesting the sudden popularity of a localized historic figure. I also found it interesting/surprising that a firm with Pentagram's resources would resort to using the standard clip art that I too had started with. And I am so appreciative to all the people who pushed me through their postings. Thanks to everyone's suggestions I am happy with the uniqueness of the design.\n\n"
    },
    {
      "time": "4 Sep 2008 — 8:41am",
      "content": "Sweet.\n\nSpeaking of your unique minuteman. I just noticed a gap between the end of \"Minuteman\" and your illustration and then how super tight it is on the other side of the illustration and \"Appraisals\". It's even more apparent in my versions which are just tracings of yours. Bump your image to the lift a little to even the alignment between the words.\n\n"
    },
    {
      "time": "4 Sep 2008 — 2:32pm",
      "content": "To be fair, i didn't even know what a minuteman was till i read this thread. At the very least you've educated a naive brit!\n\n"
    }
  ]
}
