{
  "id": "47753",
  "title": "OT to PS",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’ve been asked to essentially work backwards.\n\nOne of our clients for whom we are doing some licensing jobs has a few OT fonts that they own. My company is putting together jobs (greeting cards) that use these fonts with their artwork. Since we are still using Freehand as our layout software we need to create a PS version of these.\n\nOn my first attempt, I simply generated a PS suitcase from the OT font that I opened up in FontLab. That worked ok except my quotations would not come in. So this morning I opened the OT version again and started a brand new font file with a name variation as well. I copy and pasted the main characters, and used extra slots for some alternates and ligatures. I generated a PS version and started typing in Freehand. The quotes work, however, my cursor position is way far to the right of the character making it extremely difficult to edit text. In both Text Edit and Photoshop the cursor is in the correct position.\n\nBTW, this is on an Intel based Mac OSX 10.4.9.\n\nAny ideas?\n\nStephen\n\n [‹ Help with Font Rendering on Screen](http://web.archive.org/web/20081121180916/http:/www.typophile.com/node/48304 \"Go to previous forum topic\") [FontLab Studio disaster -Help! ›](http://web.archive.org/web/20081121180916/http:/www.typophile.com/node/48277 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121180916/http://www.typophile.com/user/14650\" title=\"View user profile.\">Stephen Rapp</a>",
  "time": "<br>",
  "uid": "14650",
  "comments": [
    {
      "time": " 25.Jul.2008 10.59am",
      "content": "Problem solved for now.  \nI figured another way to create the PS version and so far everything is working OK.\n\nStephen\n\n"
    },
    {
      "time": " 2.Aug.2008 2.10pm",
      "content": "so what was the other way you figured out?\n\nThis is reminiscent of a Fontographer bug where one of the single quotation marks wouldn’t space properly. The cure involved ATM - - it was something like having the afm file available, deleting the pfm file, installing the font, and allowing ATM to generate a new pfm font. It would thus appear, if memory serves, that it was a PC-only problem.\n\n"
    },
    {
      "time": " 11.Aug.2008 7.04pm",
      "content": ""
    }
  ]
}
