{
  "id": "47766",
  "title": "Quark 8 doesn't suck",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I went to the New York version of the World Tour and the program is much simpler and is more usable by designers. If you just need to upgrade its not a bad alternative to InDesign. I fear Adobe will do what it likes to do to its programs and make it fat. Competition is good and this Quark update will keep it competitive\n\n",
  "author": "Dan Weaver",
  "time": "25 Jul 2008 — 1:49pm",
  "uid": "2203",
  "comments": [
    {
      "time": "25 Jul 2008 — 1:57pm",
      "content": "I think it may be too late for most people. A lot of people have switched to Indesign, and those people (like me) have no reason to switch back. So Quark 8 will probably just be preaching to the choir. Competition definitely is good, though, and whatever features Quark 8 has (that InDesign doesn't have already) will only force Adobe to make InDesign better.\n\n"
    },
    {
      "time": "25 Jul 2008 — 2:35pm",
      "content": "Quark costs $800. Adobe InDesign comes with CS3 (Design Premium) for $1800. For that extra $1000 you have a bundle of essential software: Illustrator, Photoshop, Acrobat, Dreamweaver, Flash and Bridge. Not to mention their key sales tactic of bundling by selling a 'workflow' solution.\n\nSo to say it doesn't suck is hardly going to motivate the masses into a purchase. Quark dropped the ball and rejoined the curve too late. They will need to offer some serious value to compete - which I see they are trying to do with the web features in Quark 8. I have yet to see any serious web development come off the back off page layout software so we will have to wait to see.\n\n"
    },
    {
      "time": "25 Jul 2008 — 3:15pm",
      "content": "What's the OpenType interface like Dan?\n\n"
    },
    {
      "time": "25 Jul 2008 — 4:18pm",
      "content": "There are still segments of the industry that are built on Quark infrastructure. Book publishing is the one I know. Because of a lot of legacy material (at least, for those that maintain any kind of backlist) and intricately integrated Editorial-Design workflows, many have continued along with behind-the-curve versions of Quark.\n\nIf Quark 8 re-enters the fray as a suitable, up-to-date alternative to InDesign, then these industry niches will no longer need to confront the painful process of switching over. (I know: I've led a company through that transition. It was the right choice at the time; but it was not easy, nor intuitive, nor fun.)\n\n-- K.\n\n"
    },
    {
      "time": "25 Jul 2008 — 5:24pm",
      "content": "what about the plug-ins you have to buy and download to use Quark that is standard built-in with Indesign.\n\n"
    },
    {
      "time": "25 Jul 2008 — 8:22pm",
      "content": "What about the $100 a year app you have to add to Indy to adjust the kerning on a font?\n\n"
    },
    {
      "time": "25 Jul 2008 — 8:47pm",
      "content": "That is a much needed feature - especially if the fonts you work with are no good! A cheap alternative might be to use decent fonts. But actually I would like to see it show up in InD.\n\n"
    },
    {
      "time": "25 Jul 2008 — 8:53pm",
      "content": "Reviews:\n\n[PC Advisor,UK](http://web.archive.org/)\n\n[PC World](http://web.archive.org/)\n\n"
    },
    {
      "time": "26 Jul 2008 — 3:59am",
      "content": "<cite>That is a much needed feature - especially if the fonts you work with are no good! A cheap alternative might be to use decent fonts. But actually I would like to see it show up in InD.</cite>\n\nBut even with good fonts there are usually a few odds and ends that could use some attention. How often do you see, even highly skilled typographers, agree on kerning? Improving these details to a polished perfection is specifically what sets a good book designer apart.\n\n"
    },
    {
      "time": "26 Jul 2008 — 9:29am",
      "content": "I agree with Jupiter boy - \" It is not the software that makes a good artwork \".  \nI love Quark and know Indesign too. They mixed PageMaker and illustrator. Indesign alone is a vector and layout app.\n\nI still run with Quark .\n\nBatman, your links don't work for me .\n\n"
    },
    {
      "time": "26 Jul 2008 — 9:44am",
      "content": "\\> Batman, your links don’t work for me\n\nYou need InDesign CSS to read it :^)\n\nWell, I can't edit/fix it.\n\n"
    },
    {
      "time": "26 Jul 2008 — 10:00am",
      "content": "It seems you mistyped the href attribute. Here you go:  \n [PC Advisor,UK](http://web.archive.org/web/20131222103926/http:/www.pcadvisor.co.uk/reviews/index.cfm?reviewid=2118)  \n [PC World](http://web.archive.org/web/20131222103926/http:/www.pcworld.com/article/146500/quarkxpress_8_takes_on_indesign.html)\n\n"
    },
    {
      "time": "26 Jul 2008 — 12:00pm",
      "content": "I've always loved Quark, and I would have loved InDesign to work as it was conceptualized, but I have always found the interface bad and the advanced typographical features other than OT access useless. The optical kerning feature, as I've discussed in a couple of reviews, is a sham which makes Adobe's own fonts look like crap (just look how it respaces the word jumps in Adobe Garamond OT Pro 12 point).\n\nOptical alignment never worked because of the presets. Emdashes and hyphens hang out of the margin like smuts on a mechanical. Quark 8 finally has optical alignment, and it is totally customizable. That's how it should be.\n\nAnd multi-line justification is overrated in Adobe's skimpy implementation.\n\nThese problems would be acceptable in version 1 software. But we're at version 4 already and none of this has been adjusted.\n\nI am also far from convinced that the user base of Indy is as large as Adobe claims. Sell a copy of CS3 and you've registered a sale of InDesign. But how many people are actually using it?\n\nMacromedia used to bundle Fontographer with a suite, registering millions of sales. But how many people were using Fontographer? A very few thousand at most.\n\nThat said, Adobe has done very well getting Indy into the education channel, and Quark's prices still seem too high.\n\nBut Quark is a \\_very\\_ different company from what it was in the Fred Ibrahimi days. This is a company that wants to please, wants to innovate. They're fighting for survival, and I think they're doing it intelligently.\n\nWhatever - - the fact is that competition is the only for us to have great software. The only thing we have to dread is monopoly. Think how much faster Photoshop would be if there was a creditable competitor ? WOW!\n\n"
    },
    {
      "time": "26 Jul 2008 — 1:26pm",
      "content": "Good to see they're still using Houschka as the 'Quark Xpress 8' title\n\nNick Cooke\n\n"
    },
    {
      "time": "26 Jul 2008 — 1:34pm",
      "content": "\\> The only thing we have to dread is monopoly\n\nThere's nothing wrong with monopoly; as long as they're doing their job.\n\n\\> Think how much faster Photoshop would be\n\nAre you driving on the freeway with Photoshop? :)\n\n"
    },
    {
      "time": "27 Jul 2008 — 7:24am",
      "content": "No, but I've been around computers long enough to remember the days when we expected things to happen instantly. It was unacceptable for any computer operation to take any noticeable amount of time. And the landscape did seem richer when there were serious competitors to Photoshop.\n\nAnd just look at InDesign. It's an agglomeration of desirable features few of which are well-implemented. The only time they ever get better is when Quark does them better. And Quark of course would not be bothering to do this if it weren't for InDesign. Where would Microsoft be without Apple? Where would Apple be without Microsoft? (You'd still be paying 5K for your desktop and 5K for your printer.)\n\nI'm totally open to the idea of a monopoly that works. But where are they in technology? Where are they elsewhere?\n\n"
    },
    {
      "time": "27 Jul 2008 — 3:33pm",
      "content": "I'm a Studio Manager and I'm transitioning a creative department of 30+ to InDesign now. After Sept 1st all new jobs will be created using ID. I have trained all myself and some of us have gone through individual training to support those who have a longer, tougher learning curve.\n\nI have used QXP for years and ID since it's weak conception years ago. But I have to say it is really a spectacular app now. So many features that really make workflow simple. Aside from a few minor glitches here and there, you can't beat the Bridge/PS implementation, placing multiple, easy automator and applescript implementation, export without fail PDFs, Glyphs, layer control in PS. Most of these features without weak quark extentions or plugins. I always hated how people would say to me when I complained about quark, \"you can do that, with this cool extension\" - yeah great, if you have to outfit 50+ user licenses, that's the kind of shit i can't stand.\n\nOut of the box InDesign does some pretty thought out stuff. It does take a while to load, just like all adobe apps these days, they have really become memory-dogs. I use lots of the functions in Bridge to catalog photoshoots for creatives, libraries, collections, and the place in ID function from Bridge is great, especially if you add keywords to selects when they are approved.\n\nGreat, in Q8 you won't have to import images into boxes, just like ID, well too late. I like the ID double-click, then single click the box to edit it's content, then double click again to edit the container (or get back to the black arrow) and, I though in Q4 you have single keystrokes that would choose tools, or at least a 2-key combination. I use so many shortcut claws it's ridiculous! Lucky I play guitar!\n\nAlso, that horrible export to pdf, if you don't have the right preference set, you get a gibberish file-name! Quark just didn't care about it's customers for too long for me to hang in for 8. I wouldn't eat a restaurant that kept serving me bad food, or had horrible service! I will however, get takeout, if the food is good. So I will purchase a few licenses of Q8 so I can test drive it and in the unlikely event that an outside agency partner of ours sends us over some Q8 files - it'll never happen!\n\nWell good luck all, I am personally psyched to be knee-deep in a cluster-F of transition! hahaha! Creative anxiety is sooooo satisfying!\n\nPeace!\n\n"
    },
    {
      "time": "28 Jul 2008 — 10:17am",
      "content": "What mario said.\n\ni really hope that the new quark is great. that would make the adobe boys move they're asses and make an even better application.\n\n-\n\n[www.nunocoelho.com](http://web.archive.org/web/20131222103926/http:/www.nunocoelho.com/ \"www.nunocoelho.com\")\n\n"
    },
    {
      "time": "28 Jul 2008 — 4:20pm",
      "content": "Twitter'd:  \n [\n ![](http://web.archive.org/web/20131222103926im_/http:/typophile.com/files/quark8doesntsuck_4643.png)\n](http://web.archive.org/web/20131222103926/http:/twitter.com/Typophile/statuses/871034239)\n\n"
    },
    {
      "time": "28 Jul 2008 — 6:00pm",
      "content": "Most of my straight book layout work, like 80 or 90%, I'm supplied Quark templates. I'm just not seeing InDesign overtaking Quark yet, tho' I get an InDy job once in a while. InDyCS2 was certainly an improved type engine over InDy2, which I cut my InDy teeth on. Quark 7.3 most certainly does not suck. But I still think there ought to be room for both of them.\n\nThere's plenty wrong with monopoly. Without choice, there's no chance that pricing won't continue to skyrocket. And there's no real incentive for meaningful advancement in the product without a competing product.\n\n"
    },
    {
      "time": "29 Jul 2008 — 5:36am",
      "content": "That all depends where you live Steve.  \n-\n\n[www.nunocoelho.com](http://web.archive.org/web/20131222103926/http:/www.nunocoelho.com/ \"www.nunocoelho.com\")\n\n"
    },
    {
      "time": "29 Jul 2008 — 6:49am",
      "content": "\"Competition is good\"\n\nExcept when the only competition is between Quark and Adobe.\n\n;o)\n\n"
    },
    {
      "time": "30 Jul 2008 — 6:41am",
      "content": "My barometer for InD's penetration is by looking at the want ads. Take a look at how many now require InD skills, or Quark and InD skills. I'd say that InD is as prevalent or more than Quark in the field of design, generally. However, I do hope that Quark sticks around to keep Adobe on their toes. I hope QX8 is fantastic.\n\nI also hope it gets cheaper, or people will stop buying it. InD is making inroads all over the place, particularly when a group needs to buy new software. The bottom line argument is hard to beat. I agree with Kent that there are places that will probably never stop using Quark as long as the company is still around, but that mentality will only keep them alive for so long. It reminds me of how GM got addicted to fleet sales (to car rental companies) and ended up screwing themselves by losing sight on capturing new buyers to keep their consumer base stable.\n\nFull disclosure: I shed QX about 4 years ago.\n\n"
    },
    {
      "time": "1 Aug 2008 — 10:21pm",
      "content": "Quark had all the time in the World to \"kill\" InDesign at version 1.0 and their arrogance at the time got the better of them. By that time, you could get the Creative suite upgrade for just having a PhotoShop license and it was all over for them.\n\nBut that wasn't my major problem with XPress; the poor screen quality of what I was working on was. Type looked terrible, so kerning was impossible until you output your work. Images were poorly pixilated and you just had to guess what your work looked like until you printed it (which could take 20+ minutes for a complicated layout).\n\nThe Agency I'm at right now put up with XPress through 6.5, but when we upgraded to Mac/Intel workstations, the writing was on the wall for Quark. I had used InDesign since v1.0 and another art director was already using CS1, so it wasn't hard to transition the other 5 designers in our group to InDesign CS2. Sure it required a lot of emergency \"come over here, I can't get this/somethings not working right\" situations, but so does XPress with young designers (its them, not the programs).\n\nThe worst thing still about XPress sounds like you have to spring a lot of extra money for basic functionality (of InDesign) with plug-ins. And are PDFs still rendered through that JAWS garbage that gave you horrific looking fonts and vector art renderings? That was a nightmare in 6.5.\n\nI can place a PDF (and determine what page displays) AND a INDD into another INDD file as a graphic. Let me know why you think this isn't that big of a deal and I'll elaborate (as if I haven't with this post already).\n\nTo \"Billtroop: about the optical type settings in InDesign - I agree they stink and do some very weird things to fonts. I never use the setting but we have one guy at the agency who sets all his layout up this way. Every time I pick one up it bites me in the ass. The only reason he does this is that \"ones\"=1 don't kern right on the Mac and optical settings means he doesn't have to kern ones all the time.\n\nI hope the best for Quark because I'd like to see the only competition left stay alive. I'll fork out the $299 to upgrade my personal license, but I haven't used the program or the last two years, because I don't HAVE TO.\n\nVIC\n\n"
    },
    {
      "time": "2 Aug 2008 — 12:56pm",
      "content": "Anyway, why on earth does it have to be one or the other? I always use everything. Years ago I loved Quark and disliked PageMaker, but I never would have set a long book in Quark. Although I have always preferred Quark for I think is its vastly superior interface, I would never hesitate to use InDesign for something I thought it would excel in. I like having a Mac, I like having Windows, and I like having all the software that could possibly be useful to me. I don't see where an X vs Y mentality would get me anywhere. As a type designer, I remain very annoyed with Adobe for not implementing its 'superior' typographic features better. And I am deeply alarmed at the disappearance of rivals to Photoshop and Illustrator. The best ideas in Illustrator since the late 90s have all come from the pioneering program LightningDraw GX which is also gone. Where are the new ideas going to come from ?\n\n"
    },
    {
      "time": "5 Aug 2008 — 5:38pm",
      "content": "I laugh at companies and studios that struggle with \"transitions\" away from Quark at the same time Quark transitions to THE app for design studios. I find the fact that Indy has no multi-layout spaces, synchronized content, composition zones so several people can work on the same documentm color-based transparency,advanced hanging punctuation or job jackets really separates the weenies from the pros...enjoy the new PageMaker while we use software named after one of the fundamental building blocks of the universe....not a mud brick.\n\n"
    },
    {
      "time": "6 Aug 2008 — 5:16am",
      "content": "People talk about Quark’s rude customer support. That is a thing of the past. As Quark's support has gone up, Adobe's has gone down.\n\nOver here, [http://typophile.com/node/48059](http://web.archive.org/web/20131222103926/http:/typophile.com/node/48059 \"http://typophile.com/node/48059\") there's a vigorous thread on why Adobe's Arno Pro typeface won't work properly with Xpress 7, Xpress 8, Microsoft Word 2007, Microsoft Publisher 2007, and who knows what else.\n\nAdobe's response to Nick Cooke's enquiry was blistering:\n\n’We, the Adobe Type Group, definitely have better things to do with our time ... no reason for it not to work in QuarkXPress ... Your concerns about Arno Pro’s kerning have no ground...stop wasting my time with nonsense....’\n\nI gave CS3 Mac Directory magazine’s annual award this year. On balance I thought it was earned, mainly for the small though brilliant improvements in Photoshop and for the purchase of Dreamweaver. I didn’t think much of what InDesign and Illustrator had racked up since CS2. But had I known that Adobe was bundling CS3 with core fonts that don’t work with other apps, I would have placed the award elsewhere, explaining my reluctance. I only wish I’d been aware of this problem a few months ago.\n\nAnd frankly, Adobe’s customer response in this forum is enough to ban it from ever getting an award from me until the company can prove to me that it is treating its customers better than this.\n\n"
    },
    {
      "time": "6 Aug 2008 — 6:54am",
      "content": "\"People talk about Quark’s rude customer support. That is a thing of the past. As Quark’s support has gone up, Adobe’s has gone down.\"\n\nFunny that when you're the underdog, suddenly customer support is a priority. ;o)\n\nNo argument from me that Adobe's customer support is pretty much non-existent these days.\n\n"
    },
    {
      "time": "6 Aug 2008 — 10:00am",
      "content": "\\> _Adobe’s response to Nick Cooke’s enquiry_\n\nNot true.\n\n"
    },
    {
      "time": "6 Aug 2008 — 1:33pm",
      "content": "Come on, Bill, that's outright ridiculous. On this other thread you come up with a bunch of accuses which have been addressed in detail and all seriousness. Miguel referred to another thread where the issue was discussed already (files have been closed long ago), John provided elaborate explanations (these were not excuses at all), which you either do not understand or do not want to understand.\n\nAs regards \"support\", you mix something up: If people from Adobe and Microsoft are posting here, it's _not_ the support or p.r. guys and girls but the ones who actually produce the stuff. If they take the time to respond here and help out even with trivial problems, that's worth more than so-called support. But of course you risk some spanking if you tell nonsense about their product which they, you can bet, know by heart.&nbsp;&nbsp;:)\n\nBack to the main issue: Do you seriously expect that OpenType fonts do _not_ make use of the things that quality them as OpenType fonts in the first place -- just because some application developers do not see a need to support these things? You better make some noise to wake up application developers than accusing font developers who take their job seriously and have a hard time anyway when it comes to find a balance between setting free OpenType's power and working around applications' restrictions.  \nIf you simply don't like OpenType, why not leave it alone? And nobody forced you to use Arno Pro. Or to use it in Word. It was not made for use in Word. Do you really use Word?\n\n"
    },
    {
      "time": "6 Aug 2008 — 2:43pm",
      "content": "'If they take the time to respond here and help out even with trivial problems'\n\nBut they're not, Karsten -- they're just gruffly insulting perfectly reasonable customers. Why don't you actually read that thread? The Adobe people haven't come up with anything except denial, bluster and -- one must say -- savage rudeness.\n\nAnd please Karsten, don't bring Microsoft into it -- nobody from Microsoft has posted on this tiresome issue.\n\nAs for the rest .. . . . . when is the next time you are going to release a font to several million customers that doesn't work with 99% of the software out there?\n\nAnd without letting anyone know?\n\nAll that does is give fonts a bad name.\n\nIs that the message we want to send to customers?\n\nAnd I also don't think we should be telling customers that they should throw away money to upgrade software that is perfectly serviceable.\n\nFor corporate customers, upgrades are usually very, very slow -- years! That's the real world. I can't take the ivory tower approach.\n\n"
    },
    {
      "time": "6 Aug 2008 — 3:25pm",
      "content": "Nor can I endorse an ivory tower approach to other users -- either in print or on a blog.\n\n"
    },
    {
      "time": "6 Aug 2008 — 4:03pm",
      "content": "I just went back and re-read a very lucid explanation by John Hudson. Has anyone tested to see if Q8 yet supports extension format lookups? Thinking of it from the font development side, I can imagine some frustration when an OS or application doesn't fully support useful features present in the font spec. The application developers have their frustrations too, because the fonts they're trying to support are actually a bit of a moving target, and end users are unlikely to have much sympathy. However, it's simply an engineering issue that requires some effort to overcome, not a deep philosophical dispute about what format to use.\n\n"
    },
    {
      "time": "6 Aug 2008 — 5:53pm",
      "content": "\"But they’re not, Karsten — they’re just gruffly insulting perfectly reasonable customers. Why don’t you actually read that thread? The Adobe people haven’t come up with anything except denial, bluster and — one must say — savage rudeness.\"\n\nBill, I just came across these two threads and you seem to be overlooking the fact that the Adobe's type team's flatly-worded response was not addressed to Nick, the actual customer in the thread, but rather to you - acting as a critic, not a customer - with a pretty savage and insulting accusation.\n\n"
    },
    {
      "time": "7 Aug 2008 — 1:32am",
      "content": "There's not a single \"customer\" involved in the other thread.  \nNick Cooke is not a \"customer\" but a fellow type designer (Olicana) who has problems with one of his own fonts, see the very first sentence of the very first post: \"I was testing one of my own fonts\". So the entire thread was not a discussion between type-users and type-producers, but a discussion among collegues.\n\nIndeed I _do_ read entire threads before replying anything.\n\ncanderson -- <cite>Thinking of it from the font development side, I can imagine some frustration when an OS or application doesn’t fully support useful features present in the font spec. The application developers have their frustrations too, because the fonts they’re trying to support are actually a bit of a moving target,</cite>\n\nVery true as regards the first part. This always brings up questions like the one in question, whether or not to apply something like extension lookup type or more than one lookup in the kern feature.  \nAs to the second part: Since all that font developers can do with available tools is producing fonts that are built according to the specs, there is no moving target. Application developers should simply bite into the sour apple and invest the time to support specs completely in one step, rather than bits and pieces that are likely to be found in available fonts -- that indeed would make an odd race between apps and fonts. Also, application developers should document which parts of the specs they _don't_ support, rather than font developers justifying what their fonts _do_.\n\nThis is a XP8 thread however. So I should emphasize that I have _not_ yet tested XP8 and cannot say anything about it. My remarks are about applications and support of OT layout tables in general.\n\n"
    },
    {
      "time": "7 Aug 2008 — 5:45am",
      "content": "Whatever the case is, XP8 works fine with Arno provided the type does not come to it from a legacy file. When that happens you must convert the file\n\nThe fact remains that releasing a font that doesn't work with 99% of existing software is like Sony releasing a CD that only works in Sony players.\n\nWhen a customer notices this, the response should be better than\n\n_’We, the Adobe Type Group, definitely have better things to do with our time ... stop wasting my time with nonsense.’_\n\n"
    },
    {
      "time": "7 Aug 2008 — 7:10am",
      "content": "This thread would not be complete without an illustration I have already posted on the OT kerning problem thread. It shows\n\n1. that Adobe's OT kerning works perfectly in Quark 8.\n\n2. that you might be better off if it didn't work, as in earlier versions of Quark 8.\n\n3. This is not a new bug. Customer complaints have been coming in to Adobe for twenty years on this issue. They haven't addressed it yet. Can anyone think of anything comparable in technology?\n\n ![](http://web.archive.org/web/20131222103926im_/http:/typophile.com/files/arno%20pro%20display%20kern%20clipping%202_5616.GIF)\n\n"
    }
  ]
}
