{
  "id": "4776",
  "title": "Type related place to see in Netherland",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have a student who going for a few days in Netherland. Do you have suggestions for nice place to see, bookshops, Museums, etc.\n\n",
  "author": "jfp",
  "time": "Fri, 2004-05-14 10:07",
  "uid": "1275",
  "comments": [
    {
      "time": " Fri, 2004-05-14 15:30",
      "content": "Nijhof & Lee in Amsterdam is a fantastic book store with a great collection of typography books. I also recommend their poster collection.   \n   \n [http://www.nijhoflee.nl/design/typography/](http://web.archive.org/web/20050525174634/http:/www.nijhoflee.nl/design/typography/)   \n   \n   \n   \nZara\n\n"
    },
    {
      "time": " Fri, 2004-05-14 17:07",
      "content": "There is also a book store called Minotaurus (Sint-Antoniestraat), I didn't have the chance to go when i was there three weeks ago, they're closed on mondays, and open late on tuesdays, but it is a store dedicated to typography. There's a poster collectiona at Nijhof & Lee? Missed it, but my wallet thanks me for it.\n\n"
    },
    {
      "time": " Sat, 2004-05-15 03:21",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>I live in Amsterdam and strongly recomend going to KOK a \\*huge\\* second hand book store. The list of typographic material is really big there and the prices much cheaper than N&L and Minotaurus (It's OK to go there, of course, but sometimes in KOK you have the same material for half price).   \nKOK is in the very downtown and close to Minotaurus.   \n   \nCheck the material and the prices there: [http://www.nvva.nl/kok/typografie.htm](http://web.archive.org/web/20050525174634/http:/www.nvva.nl/kok/typografie.htm)   \n   \nBTW, If your student want to visit the KABK or to have a little type-chat with a KABK's student, he can contact me to my mail: [jazz@futurezone.com](mailto:jazz@futurezone.com)   \n   \n\\</font\\>\n\n"
    },
    {
      "time": " Sat, 2004-05-15 06:17",
      "content": "I visited the studio of Ewald Spieker when I was over in January, he has a gallery containing his work with cut out letters. It was just such a fantastic space... it's just next to a great design bookstore too. Ramiro do you know where it is, do you maybe have a street name?\n\n"
    },
    {
      "time": " Sat, 2004-05-15 09:30",
      "content": "It's around the corner from Nijhof & Lee. He's a very nice guy, it is a fantastic space.\n\n"
    },
    {
      "time": " Mon, 2004-05-17 04:05",
      "content": "Jim... I don't remembed where this studio is. I found it by coincidence walking down the city. You have the book... may be adress is there.   \nCheers.\n\n"
    }
  ]
}
