{
  "id": "47778",
  "title": "When to give a typeface",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi, I tried to look in archive re this. Sorry if redundant.\n\nI designed a logo and supplied it in svg, pdf, jpeg, png (typefaces outlined).\n\nThe client sent it to a freelance prototype engineer who contacted me for the font. I explained that the font was altered, creating custom logo and outlined -so having the font won’t help. His response:\n\n“Okay,  \n If you are not willing to send me the TFF file for this font I am going to have to go buy it for $106. I am not going to do this to use it just one time. I am not going to redraw it line by line either. You used it on your design so it would be nice to use it on the product. Give me a break here…”\n\n(the font is actually $45)  \nBottom line: Is it custom to also include the font when supplying a logo to client?\n\n [‹ Looking for a matching font.](http://web.archive.org/web/20081122015506/http:/www.typophile.com/node/47903 \"Go to previous forum topic\") [Tips for finding fonts ›](http://web.archive.org/web/20081122015506/http:/www.typophile.com/node/47869 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122015506/http://www.typophile.com/user/26917\" title=\"View user profile.\">cdigi</a>",
  "time": "<br>",
  "uid": "26917",
  "comments": [
    {
      "time": " 26.Jul.2008 1.44pm",
      "content": "You probably have no right to redistribute the font you used, except if it has a permissive licence.  \nIf they want to use it, they have to licence (read buy) it.\n\n"
    },
    {
      "time": " 26.Jul.2008 1.53pm",
      "content": "I had a similar problem regarding the font with a local printer - check the responses to my problem here;\n\n[http://typophile.com/node/47361](http://web.archive.org/web/20081122015506/http:/typophile.com/node/47361 \"http://typophile.com/node/47361\")\n\nBottom line - Don’t take any s\\*\\*t from this guy.\n\nJH\n\n"
    },
    {
      "time": " 26.Jul.2008 2.18pm",
      "content": "I would buy an additional license, pass the font onto the engineer, and charge the client $100. $40 for the font, and $60 as your font licensing consultancy fee.\n\n"
    },
    {
      "time": " 26.Jul.2008 3.23pm",
      "content": "Come on, what is he stupid?!\n\nHe doesnt need the font if you send him the outline logotype :)\n\nProvide him with different formats, AI, EPS, PDF and some Windows vector formats. If he cant use any of them, then he probably shouldnt work with this anyhow.\n\n"
    },
    {
      "time": " 26.Jul.2008 5.51pm",
      "content": "Thanks very much for the responses! Extremely helpful and validates my thoughts from the start.\n\nI do think I will include a line in all estimates re “fonts not included...”\n\nThanks again,\n\nC\n\n"
    },
    {
      "time": " 27.Jul.2008 12.02am",
      "content": "<cite>I do think I will include a line in all estimates re “fonts not included...”</cite>\n\nWhy? It’s unusual to include the fonts, and absolutely unnecessary for him to have them, as explained. You might as well include something like ‘foot massage not included’.  \n;-)\n\n"
    },
    {
      "time": " 27.Jul.2008 8.08am",
      "content": "Florian,\n\nyeah, might include that too :D\n\n...I’ve had more success detailing estimates with items such as this, as obvious as it may be. Many of my clients haven’t worked much with a graphic designer, so there’s a learning curve. They do read and refer back to estimates thoroughly though.\n\n"
    },
    {
      "time": " 27.Jul.2008 8.22am",
      "content": "Rather than getting into a long laundry list of things that are NOT included in your estimate, just list the deliverables—sort of a “what’s in the box” kinda thing. In this case, perhaps “EPS file scaleable to any dimension of the accepted logo, color swatches and Pantone numbers as well as CMYK and RGB builds. laserprint proof and PDF file” etc... The point is, anything not on the deliverables is extra.\n\nChrisL\n\n"
    },
    {
      "time": " 27.Jul.2008 10.38am",
      "content": "while i strenuously oppose restrictive EULAs (either boycotting the foundries or finding legitimate but less restrictive options) i must say that i think it’s a good idea for designers to include either “fonts not included” or “extra license fees” in estimates and contracts.\n\nit seems that the common practice of designers sending fonts to printers is what got us into this absurd EULA mess in the first place and, as has been detailed in several other threads, the public and the industry needs to be educated.\n\ni’m currently working on a project where i have had to inform my client that foundries with specific restrictions on their EULA will not be considered in the design process, and even then the fonts ultimately chosen will have to be licensed separately by the client for further use.\n\n"
    },
    {
      "time": " 27.Jul.2008 11.02am",
      "content": "\\>i’m currently working on a project where i have had to inform my client that foundries with specific restrictions on their EULA will not be considered in the design process,\n\nYou may be able to use the EULA chart at fontembedding.com. It has some issues right now, but hopefully those can be resolved.\n\n"
    },
    {
      "time": " 27.Jul.2008 2.22pm",
      "content": "Curious. Why would a prototype engineer need the font unless he is also doing design work?\n\nIf the font is going to be part of the client’s corporate ID/branding the client should license the font for use among the company’s staff of freelance designers. The fact that you used it in developing the logo doesnt obligate you to provide it to other designers. This is something you should take up with the client (not this designer). If he doesnt want to pay for the licensing maybe this guy should just pick another font.\n\nBut I know what kind of dilemma this can be. You want to continue working with this client and you dont want to be perceived as difficult to work with. My advice: explain it to them in a conscientious way that they are paying for your design services - not your software. Like you said, there’s a learning curve, part of your job is to help educate them. But if they cant respect your professional practices, maybe they’re not worth keeping as a client.\n\n"
    },
    {
      "time": " 27.Jul.2008 7.22pm",
      "content": "\\>”Curious. Why would a prototype engineer need the font unless he is also doing design work?”\n\nI thought it curious too. He’s simply applying the logo to a product. Additionally, the type was converted to outlines then altered so the logo can’t be recreated simply using the font.\n\nIn general, I outline all art for clients and edit myself if needed. I’ve had clients purchase fonts for crossplatform which hasn’t been an issue (yet do have issues when although client purchases face, the layouts not looking as I’ve sent). This was first time I was asked for font.\n\n\\>re EULA chart at fontembedding.com.\n\nI’m still studying + attempting to absorb the EULA chart as well as a host of info on site that I didn’t know .. thanks sii\n\n"
    },
    {
      "time": " 28.Jul.2008 5.17am",
      "content": "The guy needs a few words or sentences in the same typeface? Quote him for supplying these in outline-form & he will realize that spending 45 bucks is a lot cheaper and easier.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 28.Jul.2008 7.28am",
      "content": "If the engineer wants to “brand” the logo into the product—embossed or debossed, we would say—it may be nice to have the font to work with in the CAD program. But wouldn’t a simple EPS file work just as well?\n\n"
    },
    {
      "time": " 28.Jul.2008 7.43am",
      "content": "“But wouldn’t a simple EPS file work just as well?”\n\nIt certainly would. The other reason is that the design was manipulated as part of the design process so the type outlines would not match the logo. I can’t imagine a logo that does not need the outlines tuned for the brandname.\n\nChrisL\n\n"
    },
    {
      "time": " 28.Jul.2008 6.34pm",
      "content": "If he wants to use it on the product to compliment the logo, the client should pay you to provide him with the text he needs for the product. Send him various EPS files to cover all his bases and let him choose.\n\nWhatever way you look at it, the font is yours and he cannot have it without you violating the EULA. If he thinks it is vital he have it, $45 is a small price to pay.\n\n"
    },
    {
      "time": " 29.Jul.2008 1.11pm",
      "content": "What Goran said!\n\n"
    },
    {
      "time": " 29.Jul.2008 1.44pm",
      "content": "This guy sounds sleazy. As stated, it’s one thing to ask for the font if he actually needed (in which case he should purchase a license) but given that he doesn’t actually need it, it smells fishy in the sense that he’s trying to circumvent whatever work you’ve done for the client.\n\nI’d get forceful with him and ask him to justify the need for the font given that it’s a custom logo.\n\n"
    },
    {
      "time": " 30.Jul.2008 6.21am",
      "content": "Never, ever participate in piracy in your professional work. Period. And if clients are asking you to violate the EULA, and put yourself in a position of risk and exposure, then they are asking too much. Additionally, this genius is probably sending this all over email, no less!\n\nConvert the type to outlines and tell him what I do if someone pushes back at me when I politely decline to send a font: “I understand the position you are in, but I am unwilling to expose myself or my business to penalties or lawsuits associated with software piracy.” If he’s running a business, he should be realistic about needing to drop $45 or $100 on a project. _That’s life_.\n\nSometimes I also mention that I have “too many friends who are font designers to steal their work.”\n\n"
    },
    {
      "time": " 30.Jul.2008 9.25am",
      "content": "Thanks again for all the feed back!\n\nI emailed the link to purchase, eps files (I had originally supplied client with pdf, png, jpeg, svg all outlined—really thought sufficient) and haven’t heard from him/client since. It’s fine, this client was difficult from the start.\n\nThis may be another obvious qt.. again, did a typophile search but still unsure...When a client would like to regularly edit copy on a design format I’ve created, my client purchases the font(in addition to the one I ahve). I’m finding that clients like me to purchase and send the font to them (yes, believe it or not they have a hard time buying and downloading using the link I send or they end up buying a different version). How do I purchase a font but license it to my client? (yes, I’m buying a version for me or already have one of my own)......technically, I now have two of same font licensed to me.\n\nI’m sure this is typophile 101 so sorry.\n\nC\n\n"
    }
  ]
}
