{
  "id": "4778",
  "title": "Letters of Support to put an end to the Olympic Committee's logo challenge",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello Typophiles,   \n   \nI don't know how many of you are aware what has happened in Vancouver yesterday.   \n   \nBecause I'm a typophile regular of sorts I wanted to use this forum to inform you of some views and make mention that The GDC (Society of Graphic Designers of Canada) and members, Canadian designers alike are all in the midst of a very big mess and wish for your support in letters or emails. The address to write to is [design@vancouver2010.com](mailto:design@vancouver2010.com). Anyone who is a member of AIGA, ICOGRADA or any other country association would be helpful in our mission because frankly this is an international issue - one that the Olympic Committee may continue to implement in the future if not stopped now.   \n   \nBackground:   \nVANOC (Vancover Olympic Committee for 2010) and Mr. John Furlong (Chair) has decided that it should be a wonderful idea to open a beauty contest for the next Olympic emblem - open to anyone 19 years of age and older. Their definition of a \"professional\" at the press conference. They are asking for entrants to attend a design conference for a fee of $150, - the submissions are \"free\" and the winning design to be granted $25,000 - an insult for such an organization.   \n   \nThe 2010 Winter Olympic Committee has really launched this CONTEST to design the   \nlogo! I got wind of it through our GDC listserve and the news. Some senior GDC members, Yves Rouselle,   \nMatt Warburton and Jim Skipp along with Pamela Lee attended the press   \nconference. As you can imagine all hell broke loose. The press and   \nthe Olympic Committee don't get it. They think we are all hobbyists, that we run craft shops.   \n   \nAs Canadian designers; members of the associations, we abide by strict by-laws prohibiting us from speculative work much in the same way the AIGA and ICOGRADA agree that spec work is exploitative and benefits no one. We are mounting a force to hit the press; our president, Matt Warbuton has been on the news and radio in the last 24 hours, in an effort to stop all this.   \n   \nYou can read more here:   \n [http://www.globeandmail.com/servlet/ArticleNews/TPStory/LAC/20040514/OLYMPICLOGO14//?query=2010](http://web.archive.org/web/20131015071756/http:/www.globeandmail.com/servlet/ArticleNews/TPStory/LAC/20040514/OLYMPICLOGO14/?query=2010)   \n   \nYou can see the VANOC info here:   \n [www.vancouver2010.com/design](http://web.archive.org/web/20131015071756/http:/www.vancouver2010.com/design)   \n   \nWe look forward to hearing one day soon that the 2010   \ncommittee realized their error in judgement and puts out a proper RFP thanks   \nto the design education of real professionals everywhere.   \n   \nYou know how much of an insult this is. I would appreciate that this thread not be wasted on debate of speculative work and related issues and/or whether the idea has merit or not.   \n   \nSimply if you support the idea that what VANOC is doing is wrong please send a letter.   \n   \nAs our BC Chapter Secretary, Mr Sigrid Albert, MGDC put it:   \n   \n_I want to register my opposition to the Olympics \"emblem\" design competition   \nas well. I propose that the VANOC is a) lazy, b) cheap, and c) ignorant.   \n   \na) Lazy, because they seem to believe they will save themselves time by not   \ngoing through a proper RFP and preselection of qualified studios. IMO, the   \nonly way to hold a professional competition, if they must have one, is to   \nselect a handful of studios after review of qualifications, give time for   \nbriefing and questions to each studio, establish a budget for each studio to   \nsubmit a design, and commit to the full design development process with the   \nwinning studio at a price established through a proposal by the winning   \nstudio, not an amount of VANOC's choosing. Sounds like a lot of work though.   \nBetter have an open contest (and don't kid yourselves, anyone who thinks   \nthemselves a designer will participate!) and sift through 1,000 entries for   \nweeks or months. But wait, what about the time it takes to establish a   \nselection committee, and criteria for selection? Or let's just skip all that   \n- maybe it'll be a daughter-in-law of Mr. Furlong who will make the final   \nchoice? Jane has always been very artistic!   \n   \nc) Cheap, because they think they will save money holding an open   \ncompetition. As Mr. Furlong correctly points out, he can't pay 1,000   \ndesigners for their entries. But apparently he thinks that just by the sheer   \nquantity of entries a winning design has got to be in there somewhere, like   \na needle in a haystack? Maybe it will be, but will Jane find it? And what   \nabout the process of making the emblem work with its many applications? A   \nprofessional firm with significant capabilities will have to be hired at   \nthat point - at equally significant expense which will make the original   \nprize seem rather small in comparison - to make the winning emblem \"work\".   \nAt the very latest, a proper selection process will have to be established   \nthen. Why not now?   \n   \nb) Ignorant, because of the above wrong assumptions. Ignorant, because they   \nthink design is a talent, is just a brief moment of inspiration, and does   \nnot also require education, experience, and hard work. Ignorant, because   \nthey are calling it an \"illustration\" (according to the Globe and Mail   \narticle), not a logo, a brand, or an identity._      \n   \nThanks for the floor.   \n-t\n\n",
  "author": "tsprowl",
  "time": "14 May 2004 — 1:23pm",
  "uid": "1019",
  "comments": [
    {
      "time": "14 May 2004 — 1:41pm",
      "content": "\\> I want to register my opposition   \n\\> to the Olympics \"emblem\" design competition   \n\\> as well. I propose that the VANOC is a) lazy, b)   \n\\> cheap, and c) ignorant.   \n   \n\\*sigh\\*. We are a thin-skinned bunch, aren't we?   \n   \nYes, it's rather silly and naive of the committee to assume that they can get real benefit out of using volunteer submissions to help brand themselves. But calling them names is rather absurd. How about a simple explanation of the value of professional branding services?\n\n"
    },
    {
      "time": "14 May 2004 — 1:53pm",
      "content": "sure - and yes that is happening as well. But I wouldn't say lazy, cheap and ignorant are names or name calling. These are the attributes this professional organization (OC) is displaying, calling spades is all.   \n   \nIf one choses to send an empassioned letter or one that's very matter of fact, or another in petition form -it's your choice - they are all very much needed.\n\n"
    },
    {
      "time": "14 May 2004 — 1:56pm",
      "content": "Good start, here's the snail mail address   \n   \nVANOC   \nAttn: A/R\n\n"
    },
    {
      "time": "14 May 2004 — 2:32pm",
      "content": "Since your chances of success are probably slim, you should start working ASAP on the \"post-disaster\" phase: mounting an immediate, rigorous and persistent campaign to discredit the organizers, compiling negative critiques by noted designers of the eventual logo (yes, to some extent even before a design is chosen) and airing the attack through as many channels as possible. Bureaucracy is reactionary - leverage that to your advantage.   \n   \nhhp\n\n"
    },
    {
      "time": "16 May 2004 — 3:12am",
      "content": "I guess it is about money, but why don`t organizers   \nhave a little idea of what graphic design is?   \nJust a bunch of business and sports people   \nwho think that having a logo contest is a great idea,   \nbecause they can see a lot of ideas for free   \nand pick the one they like best?   \nWas it the same for Olympics in Salt Lake City, USA?\n\n"
    },
    {
      "time": "16 May 2004 — 7:49am",
      "content": "Alessandro, [Landor was commisioned to design that identity program](http://web.archive.org/web/20131015071756/http:/www.landor.com/index.cfm?fuseaction=cPortfolio.getCase&caseid=494).\n\n"
    },
    {
      "time": "16 May 2004 — 11:27am",
      "content": "Hi, Tanya.   \n   \nI have to say that I agree with Darrel. I think that calling a spade a spade, as you say, might work against your purposes, purposes I completely support. If we, as graphic designers, are to win these people over, we won't get much sympathy or even a willingness to be heard out by calling them lazy, cheap and ignorant.   \n   \nbtw, I do think that it's important to write them and try to educate them a bit about all this. If they are flooded with letters from all over it might just make them think a bit about what they're doing here.\n\n"
    },
    {
      "time": "16 May 2004 — 12:02pm",
      "content": "Ricardo - I understand but that's just an example of one's person's views - one that I tend to agree with. There are many \"official\" letters being sent (perhaps I should have waited and posted one of them) but as well as personal letters from designers across Canada right now - everyone should write. I'm not spear-heading here, just wanted to get the word out to other designers who care and want to write.   \n   \nRight now, it seems that VANOC is corresponding and replying some letters. Of this reply that I've read it would seem that they aren't really taking this seriously yet. If they get away with it this time imagine the ramifications in years to come, and the public's perception of our industry.   \n   \nInstead of critiquing ourselves how about we just start doing something - anything - what-ever you can - do it however you want - but just so something if you care enough , there's not a whole lot of time to waste here.\n\n"
    },
    {
      "time": "16 May 2004 — 12:22pm",
      "content": "Here is one of our official party lines:   \n   \n_While we appreciate your consideration in inviting GDC members to participate in the Vancouver 2010_\n\n"
    },
    {
      "time": "16 May 2004 — 1:07pm",
      "content": "Like I said. You can't negotiate without power. It's our old Father Khrimian proverb: you can't get your share of the soup with a paper ladel - you need an iron ladel. They have to be[come] afraid of you.   \n   \nhhp\n\n"
    },
    {
      "time": "16 May 2004 — 1:40pm",
      "content": "good point Hrant, one I hadn't thought of. - I'll share your comment with the association.   \n   \nBy opening an exchange with them now I would hope that we may avoid the situation - but we may not - but having them be scared of us afterwards won't help resolve the situation now - well unless we leak the idea to protest afterwards as well - which would most likely happen in any case if this went through.   \n   \nStill - we have one iron ladel - maybe not the biggest, but the fact that they are inviting \\*us\\* as professionals and student designers to submit - meanwhile very few - very very few are able to - (by-laws) and of those non-members many have good heads on their shoulders and wouldn't work on spec. It's just strange that they would think this could fly in Canada - one of 2 (?) who have accreditation. Really if they say part of the idea to hold a contest was for us - they obviously didn't do much homework, it's hard to imagine who's running the show over there.   \n   \nIf they get by I fear the perception the rest of the public has - it's more a matter of respect in the end, one that hopefully could come from being proactive in a positive manner.\n\n"
    },
    {
      "time": "16 May 2004 — 2:14pm",
      "content": "\\> unless we leak the idea   \n   \nNot _leak_ - tell them outright. The earlier they become afraid of you the better!   \n   \nhhp\n\n"
    },
    {
      "time": "16 May 2004 — 2:42pm",
      "content": "Mr. Armin Vit: massive!   \nThanks, I didn't know Landor.   \nI have this document, I attach it.\n\n<!--attachment: SGDC_Code_of_Ethics-36044.pdf*mime_pdf.gif*application/pdf*25.9*SGDC+Code+of+Ethics*SGDC_Code_of_Ethics%2epdf --><!--attachment: SGDC_Code_of_Ethics-36044.pdf*mime_pdf.gif*application/pdf*25.9*SGDC+Code+of+Ethics*SGDC_Code_of_Ethics%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131015071756im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">SGDC Code of Ethics<br><a href=\"http://web.archive.org/web/20131015071756/http:/www.typophile.com/forums/messages/30/SGDC_Code_of_Ethics-36044.pdf\" target=\"_blank\"><b>SGDC_Code_of_Ethics.pdf</b></a> (25.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "17 May 2004 — 8:12am",
      "content": "Hey thanks Alessandro for posting that.   \n   \nAs you can see related issues extends from #36 through 40 - it's not just 1 sentence worth.   \n   \nIf anyone has written a letter and wants to post it that would be great to see.\n\n"
    }
  ]
}
