{
  "id": "47796",
  "title": "Website & Logo for Professional Paella Chef",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nPlease rip my [new website](http://web.archive.org/web/20131015092035/http:/pedros-paella.designbits.de/) apart.\n\nIt's essentially a one-man business of a guy who comes to people's homes to cook a fabulous paella for them. The focus in this project was on the website itself. Along the way, we also decided to brush up his logo a little.\n\nPlease can you give me some feedback as to what could be improved further in this website?\n\nThanks a lot for any input!\n\nP.S. Sorry for the website being in German only, but most of you will get the gist of it!\n\n",
  "author": "Tintin81",
  "time": "27 Jul 2008 — 1:18pm",
  "uid": "19464",
  "comments": [
    {
      "time": "27 Jul 2008 — 3:54pm",
      "content": "I like your website. I remember you working up a logo for this a while ago. I think your solution works great.\n\nIt's interesting for me to read about paella from a German point of view, considering that I am an American of Spanish descent (separated, admittedly, by many generations, and the establishment of family roots in the colony of Puerto Rico).\n\nA major issue I have with the site is your use of the red chili peppers as part of your menu navigation. Paella doesn't call for red chili peppers (at least none of the traditional recipes I'm familiar with). Plus, with my American eyes, it reads as a reference to Mexican food, and not Spanish food. Or it could read as a reference to [Chili's restaurant](http://web.archive.org/web/20131015092035/http:/en.wikipedia.org/wiki/Chili%27s), an American restaurant chain. It could be fun, instead, to have little images of the traditional ingredients of paella: chicken, chorizo sausage (from Spain and Portugal, again, not the Mexican kind), clams, shrimp, mussels, etc.\n\nAdditionally, the image of the paella bowl on the right side of the screen seems not to balance the rest of the elements on the left. I would be more satisfied to see the menu and content div centered. It's feeling a bit lopsided right now. If you can think of arguments to keep it as it is, I would be open to hearing them, of course.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "27 Jul 2008 — 4:49pm",
      "content": "Now, I'm just an Irish woman who grew up in New England so take (or toss) my opinion with that in mind.\n\nWhen I think of paella, I see family gatherings. I see earthy warmth, generations of tradition, and the gathering of family itself is the very cause to prepare this feast. I see aprons spattered with sauce, oversize wooden picnic tables cluttered with colorful plates, and children hovering relentlessly for hours. Stone fireplaces, cast iron skillets, and rugged clay tiles. Heck, there's even a big headed dog wagging about. I can feel the silky fingers of a scrappy grandmother, warmly clutching my wrist as she feeds me a taste off a wooden spoon. I can't see any reason to be anywhere else on earth. (I smile and sip red wine from a clunky goblet made of blue glass...)\n\nYour website is clean and almost plastic looking. Where's the texture? Where's the tradition? Where's the fun? The unity? It just feels way too sterile.\n\nAgain, _my people_ gather around cold steel kegs of beer - so maybe my impression of a paella feast is way off. Is it?\n\n"
    },
    {
      "time": "27 Jul 2008 — 5:53pm",
      "content": "I think its just the use of the branding (Yellow + Red) that makes it looks \"plastic\" as stated above. I know by the aprons it looks like these are colors they are using but it says McDonalds to me when I see this site.\n\nTry to put some more white within the body of the site and save yellow as an accent color. I think the header is fine but could use some work. Maybe pull the two words together. They already have contrast. The man w/ crossed arms could go to the left where number is.\n\nAlso those images in the background that are scaled back do not say \"professional\". I would lose the one behind the phone number and also the one behind the yellow background. You could pull the number and contact info to the right column and do something nice over there.\n\n"
    },
    {
      "time": "28 Jul 2008 — 1:36am",
      "content": "hi, I don't understand what the shiny metal effect on the \"Pedros Paella\" logo is good for? I think it doesn't fit into the theme.  \nOne more detail: On this page [http://pedros-paella.designbits.de/paella-gerichte/](http://web.archive.org/web/20131015092035/http:/pedros-paella.designbits.de/paella-gerichte/ \"http://pedros-paella.designbits.de/paella-gerichte/\") the background for the menu card looks too tiled. Maybe try to generate a homogeneous one with photoshop-filters.\n\n"
    },
    {
      "time": "28 Jul 2008 — 5:55am",
      "content": "Agreed. It feels a bit like ‘fast-food’ paella.\n\nPedros is calling for an apostrophe too.\n\nRoss\n\n"
    },
    {
      "time": "28 Jul 2008 — 9:54am",
      "content": "The website looks professional to me. When I think of Paella I think of Paella de Marisco. It's a famous Spanish dish, and good too! So I like your website, and love food.\n\nAnother website I saw about paella had one page about the [history of Spanish food](http://web.archive.org/web/20131015092035/http:/www.learn-podcast-spanish.com/history-of-spanish-food.html). It teaches Spanish and the most common ways natives would talk about everyday.\n\nSo keep up the work on the website, it's not an easy thing to put together.\n\n"
    },
    {
      "time": "28 Jul 2008 — 12:56pm",
      "content": "From a web structure point of view, your navigation hierarchy has some issues.\n\nYour main navigation has the same weight as the checked list underneath (though the list is smaller) and both have some sort of icon next to them with the same background color. First thing I did was rollover your main navigation, then see if I could click on the list underneath. Something to differentiate those would be very helpful as far as usability.\n\nHope that helps.\n\n"
    },
    {
      "time": "28 Jul 2008 — 2:19pm",
      "content": "Pedros doesn't call for an apostrophe in German.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "29 Jul 2008 — 1:08am",
      "content": "Hi guys,\n\nThanks for your feedback. It's very much appreciated.\n\nI am going to implement most of your suggestions within the next two weeks or so.\n\nI'm a little surprised that some of you guys don't like the scaled back images in the background. I think especially the large pan makes the site look very sophisticated and defines the right edge of the site very nicely. No?\n\nMaybe I should have used another technique to scale back the image? I simply cropped the pan and then changed the layer opacity to something like 30%. Is there a better technique to achieve this? Maybe by decreasing the number of colours first?\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015092035/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "3 Aug 2008 — 10:01am",
      "content": "Hey guys,\n\nI just uploaded a new version: [http://pedros-paella.designbits.de](http://web.archive.org/web/20131015092035/http:/pedros-paella.designbits.de/)\n\nPlease let me know what you think of it...\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015092035/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "4 Aug 2008 — 10:50am",
      "content": "I didn't see the first version, but this looks a little rigid and sterile to me. Too many drop shadows and gradients make this look like one of those sites that get put up when a domain expires (in my opinion).\n\n- Lex\n\n"
    },
    {
      "time": "4 Aug 2008 — 11:59am",
      "content": "I don't like that the content area has a red border on the top that doesn't align with the top red border of the background. It looks like a mistake in positioning.\n\n"
    },
    {
      "time": "4 Aug 2008 — 12:46pm",
      "content": "The Chili as an icon may be a bad choice for attracting new German customers. Germans do not have a \"spicy\" eating culture. I think any chili spicier than a green bell pepper is \"verboten\" (forbidden). I did not see the first version of the site but I think a shrimp would appeal more to a conservative German considering a \"new\" eating experiance.\n\nGermans love to eat Red Bell Peppers, that would fit the color scheme you have and the tastes of Germans.\n\n-Ken\n\n"
    },
    {
      "time": "5 Aug 2008 — 2:41am",
      "content": "<cite>Too many drop shadows and gradients make this look like one of those sites that get put up when a domain expires</cite>\n\nI think you are being to harsh here, AJK. Especially considering all the hard work I've put into this project so far. There aren't actually that many gradients and even if there were that wouldn't necessarily be a bad thing. Nearly all \"award-winning\" websites I know use at least some kind of gradient at some point.\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015092035/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "13 Nov 2008 — 12:08pm",
      "content": "Can't access to your web design. Just tell me if you want advice from a spaniard (and great paella cooker)\n\n"
    },
    {
      "time": "13 Nov 2008 — 2:32pm",
      "content": "I'd love to cook a paella\n\nand yep ... Forbidden 403 error\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131015092035/http:/www.solid-creative.com/identity.htm)  \n [Bicycle Film Festival](http://web.archive.org/web/20131015092035/http:/www.bicyclefilmfestival.com.au/)\n\n"
    }
  ]
}
