{
  "id": "47807",
  "title": "Need your thoughts - Type support t-shirt",
  "forum": "Typography / Composition",
  "tags": [
    "Logos / Corporate ID Design",
    "Typography / Composition"
  ],
  "content": "Hi there\n\nAfter a few times trying to give input to others, I thought I might post something of myself here.\n\nI'm working on this t-shirt project.  \nI started it just for the fun of it, but now I have plans of producing it.\n\nIt is not finished. I have to take a closer look at the type. So this is more of a sketch.\n\nLet me know what your thoughts are!\n\nThe idea – in general and short – is that we all eat, sleep and breath type! Hence the lungs.\n\nMy idea was to make it a limited edition. But am not sure about that.\n\nYour input is appreciated.\n\nBest\n\nRay\n\n ![](http://web.archive.org/web/20130824061245im_/http:/typophile.com/files/tee_4418.jpg)\n\n",
  "author": "bobbybobo",
  "time": "27 Jul 2008 — 10:58pm",
  "uid": "24403",
  "comments": [
    {
      "time": "28 Jul 2008 — 12:06am",
      "content": "By the way  \nWhat I forgot to tell is that the lungs are the negative space of the letter \"T\".\n\n"
    },
    {
      "time": "28 Jul 2008 — 5:05am",
      "content": "I wasn't sure if I liked it at first, but now you pointed the negative T out, I do like it! May be font could be a little large at the bottom though.\n\nJH\n\n"
    },
    {
      "time": "28 Jul 2008 — 5:24am",
      "content": "Thanx for your comment.\n\nThe question could then be:  \nis it a bad thing you can not intantly see what it is?  \nOr does it bring an extra dimension? A surprise once you see it?\n\nPersonaly I feel it is not a bad thing when the graphic itself is interesting enough (perhaps together with a text line creating ).\n\n"
    },
    {
      "time": "28 Jul 2008 — 4:45pm",
      "content": "I don't think it's a bad thing. Sometimes I think things shouldn't be spelt out (if you excuse the slight pun).\n\nJH\n\n"
    },
    {
      "time": "29 Jul 2008 — 6:06am",
      "content": ":-)\n\nI'll wait a while for others to respond too.  \nCurious about their view about this.\n\nRay\n\n"
    },
    {
      "time": "29 Jul 2008 — 6:31am",
      "content": "I saw the 'T' straight away but I don't think i would have got the lungs thing if i hadn't read it, but now i know i really like it.\n\nI can't really think of anything you could do to the lungs to make them more lungy without ruining the simplicity of the piece.\n\nDid you have a look at a capital T and S in 'type support' to mirror the shape above?\n\n"
    },
    {
      "time": "29 Jul 2008 — 6:35am",
      "content": "Thanx David.  \nNo I haven't thought of the capital T and S.  \nNice tip. Thank you.\n\nWhat do you think of the discussion with JazzH.  \nDo you think you alway have to put things in clear view?\n\n"
    },
    {
      "time": "29 Jul 2008 — 7:53am",
      "content": "No, i agree entirely.\n\nI always say that concepts with depth that work on multiple levels \"keep on giving\". I feel that one dimensional solutions tend to be more vulnerable to dating. The challenge is always to a make a 'deep' solution 'simple'. A classic example of this is the Fedex logo.\n\n"
    },
    {
      "time": "29 Jul 2008 — 8:03am",
      "content": "This is awesome! I saw the lungs first, but now I can't stop switching back and forth between the 'T' and the lungs. Compelling.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "29 Jul 2008 — 10:25am",
      "content": "He guys\n\nThank you for your comments.\n\nI have added the Capital T and S for Type Support instead of lowercast.  \nBut it starts to interfere with the y. So I think I'll switch back. Unless you have got a good reason not to?\n\nI was also playing with some colors.  \nAt the bottom some modern colors. But they don't fit the overal feel of it.  \nIt becomes to distant.\n\n ![](http://web.archive.org/web/20130824061245im_/http:/typophile.com/files/lung1_4183.gif)\n\nHere I have added an image of actual lungs.  \nHowever I think it distracts to much from the rest. It might even starts to clutter.\n\n ![](http://web.archive.org/web/20130824061245im_/http:/typophile.com/files/lung2_6633.gif)\n\nThe 45degree lines add a nice feel to it, but I can't think of a good reason why I should use them. They don't add to the concept. What do you think?  \nThe reason for adding the lines was to break the big chunks. But actualy, that is what is it about …\n\n ![](http://web.archive.org/web/20130824061245im_/http:/typophile.com/files/lung3_5838.gif)\n\nI like bright colors, but here it just doesn't work for me.\n\nRay\n\n"
    },
    {
      "time": "29 Jul 2008 — 3:34pm",
      "content": "Not to be hating, but I dont get it.\n\nThe T doesnt look like a real T, and the lungs dont look like real lungs. Neither read clearly. The type below doesnt help. Is 'Type Support' an organization or something?\n\n"
    },
    {
      "time": "29 Jul 2008 — 4:32pm",
      "content": "It's about negative shapes and abstract images and a play on words! Simple as that. Nuttin' fuzzy honey!\n\nMichael\n\nedit: skip the interior textures!\n\n"
    },
    {
      "time": "29 Jul 2008 — 4:37pm",
      "content": "If you think about it... it could be saloon doors from the Old West! And then it could be Old Style Type Support.\n\nSorry, just having fun!\n\nMichael\n\n"
    },
    {
      "time": "29 Jul 2008 — 4:52pm",
      "content": "You know, every time i look at this i like it a little bit more...its one of those slow burners. I don't think the halftones and patterns are adding anything, i prefer the very first version.\n\nI think the capital 'T' and 'S' sit and balance the composition well but it also gives the text more prominence, is that what you want?\n\n"
    },
    {
      "time": "29 Jul 2008 — 10:54pm",
      "content": "No, its no organisation.  \nIt started just for the fun of it.  \nIt is a personal project.\n\nA perfect project to put in front of you guys.\n\nHere I'm just working in a vacuum. It is refreshing to see what other like-minded think and feel.  \nThanks for that!\n\nI don't like the halftone myself, but wanted to show you. An experiment. The patterns ... I do like them a bit. But they don't add anything. In that case I would also skip them.\n\nPersonaly I'm a lower cast type. I often find that capitals break the balance. But it is funny you see it a bit different. And I think I start to agree. :-)\n\nLooking at it again I think it does add. I do like the prominence.\n\nThanks for your comments! Very helpful.\n\nWhat about the shirt color? Leave it white?\n\n@typerror: fun is what it is all about! But it sound you just came out of a bar ...  \nhaving fun too!\n\n"
    },
    {
      "time": "30 Jul 2008 — 12:06am",
      "content": "I saw the 'T' right away, but not the lungs.\n\n- Lex\n\n"
    },
    {
      "time": "30 Jul 2008 — 6:37am",
      "content": "@typerror: fun is what it is all about! But it sound you just came out of a bar ...  \nhaving fun too!\n\nNo bars... my wife doesn't let me go out and play. Just late night tomfoolery!\n\nMichael\n\n"
    },
    {
      "time": "30 Jul 2008 — 4:43pm",
      "content": "I really like this concept. Of all of them, I prefer the brown shirt. This (to me) makes the lungs/\"t\" more equally toned, which helps them be more readable. For me, the white shirt was too much contrast.\n\nLet me know when you get this finished, Id love one!\n\nOn an aside, I was walking in the city (NYC) today and saw a guy wearing a helvetica shirt. It made me smile.\n\n"
    },
    {
      "time": "31 Jul 2008 — 11:41am",
      "content": "Seems I'm an exception, but I saw the lungs immediately, but not the T. Really. But it still left me puzzled, until I read the T explanation.\n\n"
    },
    {
      "time": "31 Jul 2008 — 11:51am",
      "content": "I got the T and the Lungs right off. I think the concept is strong. I like it! The abstract shapes and negative space work well for me. You could try another direction as well... a more classical serif T along with scroll work, or drafting texture in the lung area to simulate capillaries. That could take it in the direction of \"the Anatomy of Man\" DaVinci style. Which I have always associated with the medical profession, It could strengthen the \"life Support\" \"Type Support\" link, or is might just clutter up the nice simple structure you have going on now. Who knows?\n\n"
    },
    {
      "time": "31 Jul 2008 — 1:22pm",
      "content": "Assuming you make a variety that's not pink (navy blue maybe?), how much for one? :D\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "31 Jul 2008 — 10:56pm",
      "content": "Thank you all for your valuable comments!  \nVery helpful and interesting to see how one looks at the same design.\n\nIntruiging!!\n\n@Carolyn: I have tried a texture, but it just doesn't seem to work.\n\n@JT: Not sure what it will cost. I still have to talk with the local t-shirt printer.\n\nI'll get back with you for final result and more.\n\nRay\n\nThanks, all of you!\n\n"
    },
    {
      "time": "31 Jul 2008 — 11:04pm",
      "content": "The T is in a very rigid style. This gives the \"lungs\" a blocky shape that is a further remove from the idea of lungs. Are they lung bitmaps blown up? Why so blocky? Low-res lungs?\n\nWhat I'm getting at is that your T shape is clear but your lung shapes could really stand to look more like lungs. Start with the shape of 2 lungs and see how you can adapt the outer contour to become a recognizable T shape. Consider large, bracketed serifs at foot and at top that follow more the contour of lungs. Right now, no matter how many times I read the word \"lungs\", I still just see blocks that conceal a T.\n\nYou may have to.... Gosh dare I say it?..... HAND-DRAW IT!!!!\n\n[sob]\n\n"
    },
    {
      "time": "1 Aug 2008 — 12:31am",
      "content": "Crossgrove.  \nThank you for your comment.  \nI'll have a go at drawing it myself. It could indeed bring character to it all.  \nI must have a pencil somewhere … ;-)\n\nTo be continued ...\n\n"
    },
    {
      "time": "1 Aug 2008 — 5:52am",
      "content": "I made three different shirts.  \nI tried to put more of a lung into it.\n\nI'm not very enthousiastic.  \nThe last one (a very quick handdraw) attracts me most.\n\nI'd like to hear your comments.\n\n ![](http://web.archive.org/web/20130824061245im_/http:/typophile.com/files/3-t-shirts_5912.gif)\n\n"
    },
    {
      "time": "1 Aug 2008 — 6:37am",
      "content": "hmmm, no. now they look like other male or female anatomy that you might not want to reference.\n\n"
    },
    {
      "time": "1 Aug 2008 — 7:18am",
      "content": "No No No. Stick with what you had - it worked. So no need to bring out the (wacom)pencil ;)  \nJust an idea, maybe to break up the big flat areas you could try to distress them?  \nThink vintage T-Shirt & Machine Wash filters.\n\n"
    },
    {
      "time": "1 Aug 2008 — 7:54am",
      "content": "I think the 2nd one there looks the least like a certain aforementioned female body part (which, for many, begins with t...)...\n\nI dunno, I didn't have a problem with your previous designs. It's not supposed to look exactly like lungs, but only to suggest them.\n\nMaybe if it weren't pink...add more green to the color, make it more orange?\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "1 Aug 2008 — 8:07am",
      "content": "heh, the new versions did make me laugh...but for all the wrong reasons!\n\n"
    },
    {
      "time": "1 Aug 2008 — 8:49am",
      "content": "Ya, I prefer what you had before as well.\n\n"
    },
    {
      "time": "1 Aug 2008 — 11:06am",
      "content": "Thank you all!\n\nI don't like it either, but in response to crossgrove I tried another path. You never know what this will bring you. But it doesn't work for me either.\n\nI needed your input.\n\nI'll stick with what I had!\n\n@Carolyn  \nJudging from your input it starts to look like a Rorschach inkblot test.  \nBut yes Carolyn, I now also see something I didn't wanted to refer to. ;-)\n\n@jt\\_the\\_ninja  \nIndeed, it is about suggestion. I lost my way here.\n\n@all about seb  \nIs [this](http://web.archive.org/web/20130824061245/http:/www.scigear.com/ProductImages/clothing/vintage-both.300M.jpg) what you mean with washed/vintage?  \nI'll have a look into it.\n\nMy only hestiation would be that I can not see a conceptual justification to use this. But it will definitely bring more life to it.  \nI can be very rigid about this, maybe I just have to loosen up about this.  \nAfter all, we are also in the business of making something beautiful.\n\nMore to come ...\n\n"
    },
    {
      "time": "1 Aug 2008 — 11:41am",
      "content": "Bobby,\n\nthat was exactly what I meant. Needed? I am not sure...  \nImpressed how you keep the momentum going on this - you stacked up an impressive number of responses.\n\n"
    },
    {
      "time": "3 Aug 2008 — 10:33pm",
      "content": "@all about seb: Thanks!\n\nGetting back to the question of pricing.  \nI think the shirts will be around $18-$20.  \nThat is without the cost of sending them to you from The Netherlands.\n\nIf you are interested, please let me know.\n\nIt will be the brownish shirt with the pinkish print.\n\nRay\n\n"
    }
  ]
}
