{
  "id": "47817",
  "title": "Adobe ADFKO or Fontlab Auto Hinting ?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Which is the best Auto hinting to use, that with Fontlab or the auto hinting with Adobe's ADFKO ?\n\n",
  "author": "RachelR",
  "time": "28 Jul 2008 — 6:55am",
  "uid": "16986",
  "comments": [
    {
      "time": "28 Jul 2008 — 7:58am",
      "content": "From what I can see, the Adobe hinting looks better. There is a way to access it from within FontLab but I have failed to make it work so far. Perhaps Miguel will be better at helping you with it.\n\nChrisL\n\n"
    },
    {
      "time": "28 Jul 2008 — 8:16am",
      "content": "Is there something I need to do I access the autohinting.\n\nI have an Autohint option in the outlines section of the ADFKO I installed, I was assuming that this was the ADFKO autohinting, is that not correct.\n\n ![](http://web.archive.org/web/20131022045501im_/http:/typophile.com/files/Picture-1_3882.jpg)\n\n"
    },
    {
      "time": "28 Jul 2008 — 8:39am",
      "content": "I haven't got the AFDKO to install on my Mac. I'm sure I'm doing something wrong. Perhaps Miguel could make his slides from TypeCon on this available?\n\n"
    },
    {
      "time": "28 Jul 2008 — 8:47am",
      "content": "William, what do you think you might be doing wrong ?\n\n"
    },
    {
      "time": "28 Jul 2008 — 8:59am",
      "content": "\"I have an Autohint option in the outlines section of the ADFKO I installed,\"\n\nNothing like that shows on my system. I assume I have installed the ADFK properly :-/\n\nChrisL\n\n"
    },
    {
      "time": "28 Jul 2008 — 10:13am",
      "content": "Hello Bill, did you do the additional installation steps described at [http://typophile.com/node/20078](http://web.archive.org/web/20131022045501/http:/typophile.com/node/20078 \"http://typophile.com/node/20078\") in the section \"AFDKO FontLab macros\" (twice, once for Win, once for Mac).\n\nKarsten\n\n"
    },
    {
      "time": "28 Jul 2008 — 10:58am",
      "content": "Hi Karsten. Thanks for pointing this out.\n\nIt's been a while since I tried to install it, so I might well have not done those additional steps--or they might not have been there in the Wiki; I'm not sure when they were added.\n\nI'll have another go at installation today or tomorrow.\n\n"
    },
    {
      "time": "28 Jul 2008 — 11:57am",
      "content": "So do people think ADFKO's autohinting is a better option ?\n\n"
    },
    {
      "time": "28 Jul 2008 — 12:22pm",
      "content": "Thomas Phinney said that the autohinting program was the \"crown jewel\" of the Adobe Font Development Kit, and it was a big decision for them to decide to release it to other font makers.\n\nSo I'm pretty sure it's better than FontLab's; hopefully I'll find out for myself pretty soon.\n\n"
    },
    {
      "time": "29 Jul 2008 — 12:34pm",
      "content": "FWIW, back in the mid-90s, a very technically adept designer I knew was working for IBM using the Adobe tools and simultaneously evaluating Fontlab 2.5. He said Fontlab's autohinting then was just about on par with Adobe's -- a remarkable achievement of Yuri Yarmola's. Adobe's gift of its hinting system reflects the importance of FontLab in its workflow today. But beware of Greeks bearing gifts! Don't forget that John Warnock cried when he announced the disclosure of the Type 1 format which the industry had essentially forced on him.\n\n"
    },
    {
      "time": "29 Jul 2008 — 5:01pm",
      "content": "IMO, the FDK's Autohint is better than FontLab's Autohint. On this thread [http://www.typophile.com/afdko2](http://web.archive.org/web/20131022045501/http:/www.typophile.com/afdko2 \"http://www.typophile.com/afdko2\") you can find other people's opinion about it.\n\nThe FDK's Autohint tool comes in two flavors,  \n1) a command-line program, that you can run from the Terminal (Mac) or from the Command Prompt (PC)  \n2) a FontLab macro  \nBoth flavors run independently of each other, but should produce the same results, with one exception: the FontLab macro won't generate Flex hints.\n\nAnother thing to keep in mind is that the FDK's Autohint tool won't do miracles. In order to do its \"magic\" the tool needs to have the font's Alignment Zones (a.k.a. BlueValues, OtherBlues) and Standard Stems setup beforehand.\n\nThe installation instructions are all on the Wiki [http://www.typophile.com/wiki/afdko](http://web.archive.org/web/20131022045501/http:/www.typophile.com/wiki/afdko \"http://www.typophile.com/wiki/afdko\") Please read and follow them \\*carefully\\*. I have been fine-tuning them based on feedback I get from people and eventual troubleshooting I have to do during workshops. So they should work for almost everyone.\n\n"
    },
    {
      "time": "30 Jul 2008 — 1:45am",
      "content": "Is the fontlab Auto button for the Alignments Zones and Stems widths a good way to set these options or should they be done manually ?\n\n"
    },
    {
      "time": "30 Jul 2008 — 11:10am",
      "content": "The Auto button is a good start, but you should definitely confirm the values and do adjustments as necessary.  \nAFAIK, FontLab looks at the outlines of a few key glyphs (e.g. 'o', 'H') to set the Alignment Zones.  \nBefore pressing the Stem's Auto button, you need to first Autohint -- use FontLab's-- a few glyphs (e.g. A-Za-z), otherwise you might get bogus values.\n\n"
    },
    {
      "time": "30 Jul 2008 — 12:25pm",
      "content": "I really prefer Adobes autohinting. I love it :)\n\n"
    }
  ]
}
