{
  "id": "47828",
  "title": "The Daily Prophet (Harry Potter)",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Does anyone know what type face was used for \"DAILY PROPHET\" on the top right.\n\n ![](http://web.archive.org/web/20150418105952im_/http:/typophile.com/files/Mass_Breakout_from_AZKABAN_5791.jpg)\n\n",
  "author": "dontbugme",
  "time": "28 Jul 2008 — 1:14pm",
  "uid": "8234",
  "comments": [
    {
      "time": "28 Jul 2008 — 1:33pm",
      "content": "I know that the wizard world is supposed to be old-fashioned and all, but you would still think that they would have decent newspaper design.\n\n(No, I don't know what the type is).\n\n"
    },
    {
      "time": "28 Jul 2008 — 3:54pm",
      "content": "I'm thinking it may be a custom logo design.\n\n"
    },
    {
      "time": "28 Jul 2008 — 4:23pm",
      "content": "I agree. The P's look different from each other.\n\n"
    },
    {
      "time": "28 Jul 2008 — 6:24pm",
      "content": "It's designed by magical compositors. Muggle design standards and page layout software baffle them. Apparently.\n\n"
    },
    {
      "time": "28 Jul 2008 — 9:09pm",
      "content": "Good answer Mark.\n\nA similar Muggle font is [Angulatte](http://web.archive.org/web/20150418105952/http:/www.myfonts.com/fonts/gallofonts/angulatte/) from Gallo Fonts.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "28 Jul 2008 — 9:21pm",
      "content": "I would think that it is not a custom designed logo. I say this because of the limited amount of time this logo is actually on screen during the movies. If it is custom designed, I doubt its anything more than a few modified letters. It really wouldn't be worth the time of putting a lot of work into a logo when its only going to be on screen for 5-10 seconds tops. And since newspapers in Potterland have animations on them, I doubt anyone is going to spend much time looking at the logo of the paper. Anyway, thanks for the suggestion. Its not quite what I was looking for, but if it comes down to it I guess it may have to do :D\n\nThanks everyone! And if anyone else knows what it is, I'm still open to suggestions.\n\n"
    },
    {
      "time": "28 Jul 2008 — 9:23pm",
      "content": "Also I don't think the P's are different. I think that the first one may be bold and the latter is not? could be wrong though.\n\n"
    }
  ]
}
