{
  "id": "47865",
  "title": "Style-linking bold, italic, b/i and regular weights of a purchased font",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I hope I can phrase this clearly, and thanks in advance for any help. This is an example of a problem I’ve had for a while. I wouldn’t be surprised if there’s a simple solution, but I’ve yet to find it.\n\nSay I recently bought the regular, bold, italic, and bold italic versions of a font — let’s say Scala OT for this example. I’m writing a document in Word on my work PC and using Scala Regular as my main font. If I want to italicize something, I can’t just hit Ctrl-I and type. Instead of mapping to Scala Italic, the program just slants Scala Regular to the right a bit.\n\nSo, I have to change the face to Scala Italic, type my phrase, and then change the font back to Scala Regular. This is such a pain, especially when it comes to longer documents.\n\nSome programs (e.g., Illustrator and Photoshop) are smart enough to map the font properly on their own, but many others (e.g., Word and Fireworks) are not.\n\nIs there any way to get around this problem? I’d love it if there was a system-wide fix for my PC (I use XP at work). But at this point, I’d settle for a program-specific workaround in Word — since that’s where I do most of my long-form writing.\n\nThanks for any help you can offer!\n\n [‹ Plagiarism with intent or predisposed solutions?](http://web.archive.org/web/20081122014112/http:/www.typophile.com/node/47599 \"Go to previous forum topic\") [Opentype Com Vs. Std and some words on Bembo Book ›](http://web.archive.org/web/20081122014112/http:/www.typophile.com/node/47675 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122014112/http://www.typophile.com/user/15915\" title=\"View user profile.\">hellogreg</a>",
  "time": "<br>",
  "uid": "15915",
  "comments": [
    {
      "time": " 29.Jul.2008 1.18pm",
      "content": "The fonts need to be modified (or “fixed” from some points of view, including mine). You should contact the foundry you got them from to see if they have style-linked versions of the fonts available. If not, inquire as to whether you can make such modifications yourself, under their license terms.\n\nGood luck!\n\nT\n\n"
    },
    {
      "time": " 29.Jul.2008 2.47pm",
      "content": "Thomas I recall that Adobe, for some considerable number of years, encouraged the font industry \\_not\\_ to style-link its fonts (without, however, doing anything to unlink its own fonts) on the grounds that doing so would prevent the many customer complaints of faked italic or bold that would occur when the requisite weight was missing. Adobe also encouraged software developers not to accept style-linked fonts. Some seem to have heeded this advice. Confusion consequently seems to reign.\n\n"
    },
    {
      "time": " 29.Jul.2008 3.11pm",
      "content": "Style-linking is a dangerous thing to be messing with... mostly for compatibility reasons. If you make a system-wide change on your PC, it won’t help with anything you send to anyone else (without providing them with the same modified font).\n\nAlthough it’s a pain, your best bet is probably to use “Ctrl-I” as you want to, then do a find-and-replace after you’re done typing. Hopefully the application(s) you use will allow you to search (and replace) by style(s), so you can do a complete update of the entire document at once (changing “fake” italics to “real” italics).\n\n"
    },
    {
      "time": " 29.Jul.2008 4.41pm",
      "content": "Thanks all for the for the feedback. I will contact the foundries where I’ve purchased some of these fonts, as you suggested, Thomas. And if that doesn’t work, I’ll probably wind up following your advice, Scott. And you’re right, billtroop, confusion does seem to reign!\n\n"
    },
    {
      "time": " 30.Jul.2008 1.09am",
      "content": "_I’d settle for a program-specific workaround in Word_\n\nI think the workaround would be to define a character format for italicized passages, assign the italic weight of the font to this character format and assign a keystroke so you can call it, similar to the keystroke combination of the Italic button.\n\n"
    },
    {
      "time": " 30.Jul.2008 9.41am",
      "content": "Note: as a matter of general policy, I don’t respond to Bill’s baiting, no matter how false his statements are.\n\n"
    },
    {
      "time": " 30.Jul.2008 1.59pm",
      "content": "Could you be less self-important, Thomas? And while you’re at it, do take out some of the truly false statements in\n\n[http://blogs.adobe.com/typblography/2005/10/phasing\\_out\\_typ.html](http://web.archive.org/web/20081122014112/http:/blogs.adobe.com/typblography/2005/10/phasing_out_typ.html \"http://blogs.adobe.com/typblography/2005/10/phasing\\_out\\_typ.html\").\n\n(The gravamen of which is that Adobe tried, through Thomas, to get everyone to believe that Vista would not support any type except fresh-minted Adobe OTF - - so you’ll have to re-buy your library in OTF. It’s magnificently crafted to make you give up on all font formats before OTF - - and it’s simply not true. Microsoft is supporting every font format it ever did since Windows95 or even 3.1 — and Apple is not too very far behind. You can imagine what Microsoft thinks of this - - Adobe is blaming Microsoft for you, the customer, having to buy your library over in OTF — unless of course you’re on a Mac — and the only problem is, none of it is true.)\n\nAnd by the way - - can you name a single false thing I’ve ever said? I’ve given you specifics, now you give me some.\n\n"
    },
    {
      "time": " 31.Jul.2008 7.04am",
      "content": "Though it looks like this thread (while short) is already getting sidetracked, here’s my update.\n\nI contacted FontShop about some of the fonts I’ve purchased. They’ve said that, for a fee, I can get the fonts style-linked. (The fonts are from their FontFont foundry, making the process simple. Otherwise, I guess I’d have to contact the creating foundry.)\n\nI don’t don’t know the cost, yet, but I’ll be paying the fee — my work is paying for it, anyway.\n\nFor convenience’s sake, I do wish that they offered style-linked versions of their fonts for immediate purchase, though. I understand that there are many weights of something like Scala, but I think a four-in-one style-linked pack of the common weights (regular, bold, italic, and bold italic) would be a smart move. Even if it cost a bit more, I’d opt for those versions all the time.\n\n"
    }
  ]
}
