{
  "id": "47877",
  "title": "Magazine Grid - Which grid layout to use?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there,\n\nI wanted to ask about grids with magazine layouts. The reason being I have just been asked to quote on a job to do a layout for magazine that will need a 2 and 3 column template as well as a spread.\n\nI have been reading books by Timothy Samara (Making and breaking the grid) and Kristin Cullen (Layout workbook) though what I am looking for is more of an explanation on what grid to use and to understand better why grids may contain up too 8 - 12 columns though the layout will then group (3 - 5) columns and use as one column.\n\nexample here:  \n [http://www.puidokas.com/wp-content/uploads/2007/08/subtraction-grid.jpg](http://web.archive.org/web/20141118212307/http:/www.puidokas.com/wp-content/uploads/2007/08/subtraction-grid.jpg)\n\nThere must be some rules to setting up grids or is it a visual thing?\n\n",
  "author": "Monsta",
  "time": "29 Jul 2008 — 5:12pm",
  "uid": "34545",
  "comments": [
    {
      "time": "29 Jul 2008 — 5:20pm",
      "content": "I also was curious to how the book \"Grid Systems in Graphic Design\" rates against \"Making and Breaking the Grid\" for learning and better understanding the art of grids?\n\n"
    },
    {
      "time": "29 Jul 2008 — 6:18pm",
      "content": "I would like to know what you guys think of those books too. The Muller Brockman one is a lot more expensive and a lot older I know. Is there any others that are good?\n\n"
    },
    {
      "time": "29 Jul 2008 — 6:22pm",
      "content": "I do use this technique for book layout  \n [http://en.wikipedia.org/wiki/Canons\\_of\\_page\\_construction](http://web.archive.org/web/20141118212307/http:/en.wikipedia.org/wiki/Canons_of_page_construction \"http://en.wikipedia.org/wiki/Canons\\_of\\_page\\_construction\")\n\nbut magazine, I am curious to how many columns to use, there always seem to be a lot more column use for magazine layout.\n\n"
    },
    {
      "time": "29 Jul 2008 — 6:26pm",
      "content": "Monsta - in response to your question, from the little formal theory and historic examples I know of grids, I think it is a visual thing. By developing a rock-solid grid for your magazine this will give it a visual hierarchy and consistency throughout.  \nIn your posted example they use many columns so they can alter the layout depending on what the content is. In the context of a magazine or similar publication you ideally would establish a width for your minimum text column and adding in gutters and margins, work that into a full two-page spread. In certain layouts you may then decide to run text over 2 columns for a feature or more for heads etc.\n\nHaving a template like this will give you the freedom to chop and change your layouts to suit the amount of copy, open pages, ads, etc.\n\nHope that makes sense.\n\n"
    },
    {
      "time": "29 Jul 2008 — 6:28pm",
      "content": "when a grid system has 8-12 columns it is giving the designer a more versatile way of laying out the design. It is also usually used when you have more complex information that needs more areas to lay it out.\n\nThe reason that many columns are sometimes grouped into less is to give the designer flexibility. You are still conforming to the grid, but it give you the ability to layout a lot of information and many different ways you can layout a single page. The lower the number of columns in your design the least number of ways you can arrange the information.\n\nthere really are not any rules, just depends on the amount of information and the type of information that you have.\n\nUsually in a magazine there are many different grids layouts, usually about 3 or 4. main articles, secondary articles and maybe the reoccurring features (i.e editors note, etc)\n\nhope this helps\n\ndavid\n\n"
    },
    {
      "time": "29 Jul 2008 — 7:20pm",
      "content": "Thanks jayyy and david, what you have both written has been of great help and insight. What i get out of this is the versatility a grid offers with more columns used and also gives a structural hierarchy and constant format throughout.\n\n"
    },
    {
      "time": "29 Jul 2008 — 8:48pm",
      "content": "What jayyy and dzobel said.\n\nThe grid, and the number of columns, should be dictated by the content of your publication. For example, you wouldn't usually split fiction into six columns, just as you wouldn't usually use one column for the section with letters from your readers... But then again, there are always exceptions.\n\nIn short, form should follow function. :-)\n\n"
    },
    {
      "time": "30 Jul 2008 — 8:03pm",
      "content": "Find out how they are going to want to hack up the add space, for example, what is the smallest add they will sell. You might assume they will need a bit more flex than even they first imagine. If you design that in from the start they will love you for it later.\n\n"
    },
    {
      "time": "30 Jul 2008 — 9:20pm",
      "content": "Thats an excellent point jupiterboy regarding the ad space, very good thinking.\n\n"
    },
    {
      "time": "31 Jul 2008 — 5:27am",
      "content": "Having spent years in the magazine business in a former life, I would recommend an odd number grid approach. 13 columns is quite a flexible grid. you can have three columns of four with an extra column for white space that can be inserted either on the outside, inside or between the columns. You can have 4 columns of three with that extra space, Two columns of six, again with that extra space to use as a layout element. Willi Kuntz was a big advocate of the 13 column grid, as is Will Hopkins of Hopkins/Baumann who worked with Kuntz.\n\n"
    },
    {
      "time": "12 Aug 2009 — 10:36pm",
      "content": "Hey,\n\nIn my first semester of design, in our typography class we had an exercise learning about grids where we actually took existing articles from magazines and placed tracing paper over them mapping out their grids. So we looked at the gaps between the columns etc.\n\nI am currently doing a magazine design and have been doing that with some different magazines to help work out the similarities and differences. It might be a useful exercise?\n\nLauren\n\n"
    },
    {
      "time": "13 Aug 2009 — 8:00am",
      "content": "I would emphasize what the Jameses said (jupiter & terminal). With magazines, typically the advertising grid is determined first. Your editorial grid should in some way reflect (or harmonize with) the ad grid.\n\nI also like using grids with odd numbered columns. I've used both, but to my mind odd-numbered column grids are a little easier to use and aesthetically a little more pleasing to the eye. Hey, but that's just me.\n\nI also like using a 13-column grid. But you should experiment.\n\nA grid is a helpful tool. Especially in magazines.\n\n"
    }
  ]
}
