{
  "id": "47872",
  "title": "Student Newspaper Redesign",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all,\n\nWe’re a daily university paper working on a redesign this summer and struggling with fonts. We have a history of neglecting and harassing our readers with shoddy fonts, so we’re looking for any help we can get. Everything is open for us —— body, headline, nameplate.\n\nFirst, some specs:  \nWe run five days a week and our audience is primarily 18-22 year old students. We take our news seriously, but we happily print columns about sex and drugs, and we run words like “\\*\\*\\*\\*” in the opinion section.\n\nWe’re on a 11’x17’ tabloid (59p x 95) on newsprint and we’re irregularly in color (cnyk). We print 11,000 a day. We are six columns wide, and run with body font size @ 10.5. Headlines run at 42, 36 and 30. Subheads are at 18.\n\nFinally, we’re low on money.\n\nGod knows why, but for the past few years we’ve been using Bodoni Book for body text. Right now, we’re looking at Trump Medieval.\n\nFor headlines, we’d like one serif and one sans serif. Right now we like Miller Headline, but we’re not made of money and any cheaper suggestions would be wonderful. (I believe Rotation is on the shortlist.) Sans serif is up in the air.\n\nOur hunt for a perfect nameplate font is beginning to feel quixotic: we’d like to find one that is modern and forward thinking but vaguely elegant/classic —— all the while keeping in mind that we’re a bunch of idiot 22 year old students. (I suppose a nameplate is a very personal thing, but I just thought I’d ask.)\n\nSorry that ran so long, we really appreciate the help.\n\nDavid & Sabrina\n\n [‹ design Podcast - what do you listen too?](http://web.archive.org/web/20081122000705/http:/www.typophile.com/node/48289 \"Go to previous forum topic\") [Quality script ›](http://web.archive.org/web/20081122000705/http:/www.typophile.com/node/48425 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122000705/http://www.typophile.com/user/34488\" title=\"View user profile.\">ferry</a>",
  "time": "<br>",
  "uid": "34488",
  "comments": [
    {
      "time": " 30.Jul.2008 3.58am",
      "content": "Given the volume of work your doing, you should probably try not to think too much about price in your choice: fonts would be a fairly insignificant cost compared to all the printing costs!\n\nThere are, of course, lots of possibilities: the Miller family is tried and true for body and headlines. Font Bureau has a number of other fonts you should consider, and has lots of expertise. You should probably contact them.\n\nHave a look Adobe’s Utopia, and, a more “outside” choice, Adobe’s Chaparral. If you own Adobe software, you may already have some of these. (Also, Adobe offers some of their fonts in special collections for education, see more info [here.)](http://web.archive.org/web/20081122000705/http:/blogs.adobe.com/typblography/2008/03/ffee.html#more)\n\nA very nice face you may not have consider is OurType’s Arnhem. Arnhem Fine is “modern and forward thinking but vaguely elegant/classic.” Go to [http://www.ourtype.be/home.htm](http://web.archive.org/web/20081122000705/http:/www.ourtype.be/home.htm \"http://www.ourtype.be/home.htm\"), wait for the Flash to load, and navigate from there.\n\nAlso look at Kris Sowersby’s [Newzald](http://web.archive.org/web/20081122000705/http:/vllg.com/KLIM/Newzald/Example+About/) at Village.\n\nAnd [Eudald News.](http://web.archive.org/web/20081122000705/http:/www.felicianotypefoundry.com/main/?page_id=88)\n\nFinally, be sure to read the EULAs for any fonts you’re considering: many foundries allow 5 seats at one location as part of their standard license, for others it’s one. Some allow embedding in PDFs (which may or may not be important to you), others do not, or charge extra.\n\n"
    },
    {
      "time": " 30.Jul.2008 4.05pm",
      "content": "Hey thanks so much for the suggestions.\n\nArnhem is lovely looking and even, dare I say, cool. It seems worth the purchase.\n\nSorry to trouble you further, but do you have any suggestions for a sans seriff (for headlines)? We could settle on ITC Franklin Gothic, but it would be just that — settling.\n\nDave\n\n"
    },
    {
      "time": " 30.Jul.2008 9.43pm",
      "content": "Our local paper just switched up their layout and overall typography, and the heads are now set in Interstate. Now Interstate does not sit well with my eyes, but it definitely has some distinction and I daresay a bit of an edge or bite to it. I read our campus newspaper every day, and a “bite” is certainly what it calls for! Also, Interstate has plenty of weights to work with. Personally, I enjoy it in its condensed form in all caps.\n\n"
    },
    {
      "time": " 31.Jul.2008 4.04am",
      "content": "First of all, I wouldn’t be too quick to dismiss Franklin Gothic: it’s a very broad family, you’ve probably got several weights already, and [the latest ITC release](http://web.archive.org/web/20081122000705/http:/www.itcfonts.com/Fonts/NewFonts/2008/Franklin.htm) means you could get just about anything you need. There’s also bargains to be had in it, for example, [this URW collection.](http://web.archive.org/)\n\nI admit that you’re going to be seeing yourself coming and going if you use Franklin. More out of the way , and very nice, is Nick Shinn’s [Brown Gothic.](http://web.archive.org/web/20081122000705/http:/www.shinntype.com/brown.html)\n\nFontFont, at Font Shop, is crawling with excellent sans: [FF Unit](http://web.archive.org/web/20081122000705/http:/www.fontshop.com/search/?q=unit&x=0&y=0), the wildly extensive [FF Fago family,](http://web.archive.org/web/20081122000705/http:/www.fontshop.com/search/?q=fago&x=0&y=0) the apparently infinite range of [FF Clan,](http://web.archive.org/web/20081122000705/http:/www.fontshop.com/search/?q=clan&x=0&y=0) or the distinctive [Quadraat Sans,](http://web.archive.org/web/20081122000705/http:/www.fontshop.com/search/?q=quadraat+sans&x=0&y=0) with its headline and condensed cuts.\n\n"
    },
    {
      "time": " 1.Aug.2008 7.22pm",
      "content": "If you’re on a budget I would strongly recommend a visit to Jos Buivenga’s site [Exljbris](http://web.archive.org/web/20081122000705/http:/www.josbuivenga.demon.nl/index.html). I am a big fan of [Museo](http://web.archive.org/web/20081122000705/http:/www.josbuivenga.demon.nl/museo.html), which amazingly you can download all but 2 of its weights for free. This is probably the best free typeface you are ever likely to see.  \nHowever I have yet to see it actually being used by anyone. Think your paper could be the one to break the mold? I think it would work really well as a headline and subheading face. What do you think?!\n\n"
    },
    {
      "time": " 2.Aug.2008 11.04pm",
      "content": "Christ museo is interesting, but I think we’d have to force it into the inside for style and arts sections. Mm mm though, some of those are fun.  \nThanks for pointing me towards the free site——there simply aren’t enough out there.\n\n"
    },
    {
      "time": " 2.Aug.2008 11.54pm",
      "content": "FWIW, I’ve seen the Exlibris [Fontin](http://web.archive.org/web/20081122000705/http:/www.josbuivenga.demon.nl/fontin.html) family used on what must be the absolute worst newsprint/press available in the USA, and it still looked great. Not bad for free fonts!\n\n"
    },
    {
      "time": " 4.Aug.2008 3.12pm",
      "content": "Thanks for recomending Museo, Naoise. On my (Typophile) blog I’ve posted some examples of Museo in use ... [click](http://web.archive.org/web/20081122000705/http:/typophile.com/node/46620) | [click](http://web.archive.org/web/20081122000705/http:/typophile.com/node/47030) | [click](http://web.archive.org/web/20081122000705/http:/typophile.com/node/47964)\n\nI would love to see some pics of that torture James :-)  \nIt would be very useful for me.\n\n"
    },
    {
      "time": " 4.Aug.2008 7.13pm",
      "content": "Congratulations on some excellent work Jos. I was aware you were a fellow Typophile, I wondered if you’d spot my post! Museo looks great in your examples.  \nI’m waiting for the right job to give one of your faces a go myself. I’ll keep you informed when I do.\n\n"
    },
    {
      "time": " 4.Aug.2008 9.52pm",
      "content": "Thanks Naoise. I couldn’t help noticing this post because of the referring links to Museo and Fontin :-) Please do keep me informed. I would appreciate that very much!\n\n"
    },
    {
      "time": " 7.Aug.2008 11.13am",
      "content": "As long as we’re talking about free/low cost alternatives, how about Lido STF. It’s free for “non-commercial” use (which a student newspaper may or may not qualify as) and even if you DO end up being considered as commercial, the commercial license is relatively cheap (roughly $125) as fonts go.\n\n"
    },
    {
      "time": " 7.Aug.2008 7.35pm",
      "content": "Actually if it is in fact free typefaces you are after this post [here](http://web.archive.org/web/20081122000705/http:/www.smashingmagazine.com/2007/11/08/40-excellent-freefonts-for-professional-design/) is well worth a read. It includes Lido mentioned above and many of Jos’ typefaces.\n\n"
    },
    {
      "time": " 8.Aug.2008 2.20am",
      "content": "For the title, [Ælbrocan](http://web.archive.org/web/20081122000705/http:/coruna.elahorcado.net/) is a good (free) option :)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 12.Aug.2008 2.56pm",
      "content": "Aelbrocan has a nice feel to it, but I fear its too classy for a little old student paper :(.\n\n"
    },
    {
      "time": " 15.Aug.2008 5.54am",
      "content": "That’s pretty cool. Our newspaper is going through a redesign too (although it’s a high school publication).\n\nIf you would want to take a look at our new design, you can check it out at:  \n [http://www.flickr.com/photos/seunghoyang/2710256826/sizes/l/](http://web.archive.org/web/20081122000705/http:/www.flickr.com/photos/seunghoyang/2710256826/sizes/l/ \"http://www.flickr.com/photos/seunghoyang/2710256826/sizes/l/\")\n\nBecause it’s a high school publication, we couldn’t get new fonts so we had to make do with what we had. The headlines and captions are Myriad Pro and the body is just plain old Times New Roman. The teaser/index on the left is Arial and the big headlines fonts are a combination of TNR, Gotham and Rockwell, in that order.\n\n"
    },
    {
      "time": " 15.Aug.2008 7.20am",
      "content": "Since they do a lot of work directly with publications Font Bureau has a wealth of sans serif types that would work nicely. [Amplitude](http://web.archive.org/web/20081122000705/http:/www.fontbureau.com/fonts/Amplitude), (different widths and weights, but no italics); [Scout](http://web.archive.org/web/20081122000705/http:/www.fontbureau.com/fonts/Scout), and [Antenna](http://web.archive.org/web/20081122000705/http:/www.fontbureau.com/fonts/Antenna) to name a few.\n\n"
    }
  ]
}
