{
  "id": "47882",
  "title": "Web fonts article on webmonkey",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.webmonkey.com/blog/The\\_Future\\_of\\_Web\\_Fonts\\_Looking\\_Brighter](http://web.archive.org/web/20090925023656/http:/www.webmonkey.com/blog/The_Future_of_Web_Fonts_Looking_Brighter \"http://www.webmonkey.com/blog/The\\_Future\\_of\\_Web\\_Fonts\\_Looking\\_Brighter\")\n\n",
  "author": "<a href=\"/web/20090925023656/http://www.typophile.com/user/7716\" title=\"View user profile.\">Ricardo Cordoba</a>",
  "time": "<br>",
  "uid": "7716",
  "comments": [
    {
      "time": " 29.Jul.2008 9.26pm",
      "content": "Are major foundries researching solutions? If they come up with a free solution would the bragging rights and inherit clients from the bragging rights be enough recompense? Could foundries not research a solution and sell the solution to different companies to implement in their browsers?\n\nWho is more responsible to find a solution the browser company or font foundries? (not that i think anyone is inherently responsible to find an answer but we as designers are customers to both the foundries and the browser companies, and neither have provided a viable solution for a problem with their product). Maybe it is the web designers’ obligation?\n\n"
    },
    {
      "time": " 29.Jul.2008 9.47pm",
      "content": "We don’t need that many new fonts to really help out. For aging fonts, some foundries could gift two or three fonts from their collection to the web world for this type of embedding. Surely every foundry has a few good fonts that just frankly don’t sell. Or even some good ones that are actually fully usable as part of a collection.\n\nMost web browsers can make fake bold and italics/oblique, which is about the extent of font families the web has ever used (and I think iirc in CSS you can control the oblique angle too). Just releasing, say, Univers at a regular weight would enable designers to use (fake) bold and italic on websites when needed for emphasis, but would also allow users to preview the font and then maybe investigate the full collection. Any designer of course knows that you’ll want to buy the actual italic or bold font because obliquing only goes so far).\n\nPlus, you’ll always have OFL or CC licensed fonts which are often times of pretty decent quality.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 29.Jul.2008 10.02pm",
      "content": "Webmonkey is still around?\n\n"
    },
    {
      "time": " 29.Jul.2008 10.57pm",
      "content": "[The article by Richard Rutter](http://web.archive.org/web/20090925023656/http:/www.clagnut.com/blog/2166/) that is referenced at Webmonkey is the one worth reading. He suggests that embeddable fonts present a new licensing opportunity for font vendors. He may be right, and I believe EOT is the way to make it happen. See my comment on his blog.\n\n"
    },
    {
      "time": " 30.Jul.2008 1.29am",
      "content": "<cite>He suggests that embeddable fonts present a new licensing opportunity for font vendors. </cite>\n\nThat’s exactly the model I suggested in my [webfonts survey article](http://web.archive.org/web/20090925023656/http:/opentype.info/blog/2008/04/19/font-face-survey-results). Though the survey showed, that the web designers are not overly excited about it yet.\n\n<cite>He may be right, and I believe EOT is the way to make it happen. </cite>\n\nEOT is clearly the best solution from OUR point of view as type designers or font vendors. But we shouldn’t wait until EOT is someday supported in all major browsers. If we only think about the protection and not about the wishes of the users, we make the same mistakes as the music industry.  \nIt is foreseeable that in 2009 all major browsers will have webfonts support: Font linking for Safari, Firefox and Opera and EOT for Internet Explorer. This feature will be used, so we better have a license model ready by then.  \nEOT might be good in the long run, but a combination of font linking and EOT support might be necessary until then.\n\n"
    },
    {
      "time": " 30.Jul.2008 3.15pm",
      "content": "_Webmonkey is still around?_\n\nI think it was gone for a while, cuttlefish — I remember reading something on Wired’s website about webmonkey coming back (maybe a couple of months ago).\n\n"
    },
    {
      "time": " 31.Jul.2008 5.02am",
      "content": "“But we shouldn’t wait until EOT is someday supported in all major browsers.”  \nWe HAVE to wait — Why wouldn’t we?\n\n”... we make the same mistakes as the music industry.”  \nWe can’t make the same mistakes as the music industry — they provide a digital file (a rare parallel), but it requires no “composition”, and no “arrangement” is required... only volume control and this does not radically change the tune... So, when people say, “it’s just like music”, I laugh, musically.\n\nAnd, when people say the fonts are not installed in the system, I say they lie. But mostly, when people don’t understand that the reason I don’t like embedding, is because I don’t want my intellectual font property used in the seriously inferior world of the web until the typographic functionality accumulates to compose type well, (or of course, unless I’m paid up-front and in full).\n\nJust look around. GEEZE is [http://billhillsite.com/ugly](http://web.archive.org/web/20090925023656/http:/billhillsite.com/ugly \"http://billhillsite.com/ugly\"), or /what!?  \n1. Underweight rules, feed ’em.  \n2. OS figures in an all cap headline, drop ’em.  \n3. Dark Grey type on a dark grey background.  \n4. 8 ½ x 11, comes out looking like 8©x11.  \n5. small caps in the first line that are light and narrow.  \n6. descenders cut off by graphics, ouch.  \n7. word space wider than leading is tall, kan u rede it?  \n8. Are some of these fonts obliqued?  \n9. Can an initial drop cap get uglier than if it’s aligned lower than the following text?  \n10. Enclosed, what is the crap obscuring the type?\n\n ![](http://web.archive.org/web/20090925023656im_/http:/www.typophile.com/files/SadBlogType_3484.png)\n  \n11. I’m viewing this site on a 22 inch monitor, it barely fits and does no scaling to the window...\n\nI have yet to see a site with embedded fonts that is more than simple pour-’n-puke quality. You can see at Bill’s site, clearly what happens when you try to go farther. Typography is not just having fonts. Fonts not having enough typography, (not to mention common ground in enabling software), is just not going to work for all users and uses, as a standard should.\n\nCheers!\n\n"
    },
    {
      "time": " 31.Jul.2008 8.48am",
      "content": "It works for me.\n\n_1. Underweight rules, feed ’em._  \nQue?  \n_2. OS figures in an all cap headline, drop ’em._  \nNope. What “figures”? Where?  \n_3. Dark Grey type on a dark grey background._  \nNope. Could be your browser color settings David.  \n_4. 8 ½ x 11, comes out looking like 8©x11._  \nNope. It works on my system. I get a proper 1/2 glyph.  \n_5. small caps in the first line that are light and narrow._  \n“ADAPTIVE LAYOUT” No, sorry. No small caps there.  \n_6. descenders cut off by graphics, ouch._  \nNope.  \n_7. word space wider than leading is tall, kan u rede it?_  \nNope, the leading is wider than the word space over here man. Very readable.  \n_8. Are some of these fonts obliqued?_  \nThe style sheet specifies oblique, but as you can see from my screen dump I’m getting genuine Calibri italics here.  \n_9. Can an initial drop cap get uglier than if it’s aligned lower than the following text?_  \nCome again?  \n_10. Enclosed, what is the crap obscuring the type?_  \nA rendering problem at your end. I guess it would be your browser’s doing.\n\n ![](http://web.archive.org/web/20090925023656im_/http:/www.typophile.com/files/bill_hills_blog_5103.gif)\n  \n^ Internet Explorer\n\n ![](http://web.archive.org/web/20090925023656im_/http:/www.typophile.com/files/bill_hills_blog_firefox_4020.gif)\n  \n^ Firefox\n\nIt’s amazing. Web designers and typographers complain no end about Internet Explorer. For Bill Hill’s site it’s Firefox that screws it up worse. IE does a comparitiviely good job of it.\n\nj a m e s\n\n"
    },
    {
      "time": " 31.Jul.2008 9.22am",
      "content": "<cite>We HAVE to wait — Why wouldn’t we?</cite>\n\nBecause we can already work out solutions which work with font linking.\n\n<cite> So, when people say, “it’s just like music”, I laugh, musically.</cite>\n\nFonts are not like music. But the similarity is that the music industry first saw the web as a huge threat instead of a huge possibility. They know better now.\n\n"
    },
    {
      "time": " 31.Jul.2008 9.24am",
      "content": "I see what you mean about the dropped cap. That bit doesn’t work for me either.\n\nBut the figures in the all caps headline. No, sorry, it must be the font your user agent chose to render the page in. With the specified font you get lining figs:\n\n ![](http://web.archive.org/web/20090925023656im_/http:/www.typophile.com/files/bill_hills_4733.gif)\n\nI think most of the problem with that page is the proprietary MS formatting, so it isn’t really a fair test of IE versus Firefox versus Opera versus Safari versus Other User Agent(s).\n\nMS is not sticking to universal standards here and favoring its own user agent.\n\nj a m e s\n\n"
    },
    {
      "time": " 31.Jul.2008 10.45am",
      "content": "I met with Bill on Monday - and he’s taken quite a bit of flack re. his demo site. He showed me the new version he’s working on and described the large stack of HTML books he purchased from Borders last week.\n\n"
    },
    {
      "time": " 31.Jul.2008 11.41am",
      "content": "_Enclosed, what is the crap obscuring the type?_\n\nIt’s the white letters of the word Blog which have wrapped unexpectedly.\n\n"
    },
    {
      "time": " 31.Jul.2008 11.48am",
      "content": "\\> _and described the large stack of HTML books he purchased_\n\nI hope he got some about CSS too. And please remind him to test his site on other browsers. Not everyone is watching the web through IE. (In fact, he should first code for standards-compliant browsers, e.g. Firefox, and then add the tweaks for IE. That’s the best way to do it, hands down.)\n\n"
    },
    {
      "time": " 31.Jul.2008 1.26pm",
      "content": "Yep a stack of CSS books almost as big, and he does have the other browsers installed. I’m not sure if he’s blitzed the Mac OS partition on his mac-book but he’s down the corridor from a Mac lab so he can check out the layout there too.\n\n"
    },
    {
      "time": " 1.Aug.2008 4.28am",
      "content": "Si: Yep a stack of CSS books almost as big...\n\nMe: ... and it’s not even 2010 yet! I thought for sure it’d take that long to get real. Tell Bill we don’t need to increase the size of the display type, leave that for the text! If possible, this helps confine the users composition destroying acts to type mods that do help...good luck!\n\nMe: We HAVE to wait — Why wouldn’t we?\n\nRalph: Because we can already work out solutions which work with font linking.\n\nMe: Browser-by-browser embedding implementations are not “a solution.”\n\nMe: So, when people say, “it’s just like music”, I laugh, musically.\n\nRalph: “... the similarity is that the music industry first saw the web as a huge threat instead of a huge possibility. They know better now.”\n\nMe: They? Do you mean the 1,000’s of fired music industry executives? The young bands no one can afford to chance? Or perhaps the veteran musicians, who have recognized that if they want money from their music, they must tour?\n\nMe too: Sure, the music industry clowned around on ’quality’ for a few moments, but the difference they faced was nothing compared to our qualitative drop-off on the web. And we can tour, but...\n\nJames: MS is not sticking to universal standards here and favoring its own user agent.  \nWhat good is it then?\n\n"
    },
    {
      "time": " 1.Aug.2008 8.56am",
      "content": "<cite>Me: Browser-by-browser embedding implementations are not “a solution.”</cite>\n\nWhy not? This is exactly how @font-face is suppose to work. You specify local or external font sources and the browser will pick whatever is available and supported.\n\n`\n@font-face {\nsrc: local(\"Graublau Sans Web\"),\n     url(\"graublauweb.otf\") format(\"opentype\"),\n     url(\"graublauweb.eot\") format (\"embedded-opentype\");\n}\n`\n\n"
    },
    {
      "time": " 3.Aug.2008 4.10am",
      "content": "“This is exactly how @font-face is suppose[d] to work. []...the browser will pick whatever is available and supported.\n\nThe typeface one specifies with font-face must “be installed on the computer of the person viewing the web page”, which is not embedding. The browser picking whatever font(s) is/are available and supported, is not design. And, as one can see from the “ZEN GARDEN” examples, to Mr. Hill’s site, neither allows typography, just type.\n\nAlso, I hope you understand that this is not like music industry in many more ways than it is.\n\nCheers!\n\n"
    },
    {
      "time": " 3.Aug.2008 6.34am",
      "content": "<cite>The typeface one specifies with font-face must “be installed on the computer of the person viewing the web page”, which is not embedding.</cite>\n\nAnd what’s the point of this sentence?  \nHTML websites are plain text files with linked resources. I don’t see any other way of doing this. You can’t (or shouln’t) actually embed a binary file in an HTML website. That’s not how the web works.\n\n<cite>The browser picking whatever font(s) is/are available and supported, is not design. </cite>\n\nRegarding webdesign this IS design. The web doesn’t work like a printed page and designing a website in a way that works for different browsers, screen sizes and user settings is actually a pretty hard design job. Webdesign always includes a lot of variables like font sizes, column widths or even font choices. As a webdesigner I would be very insulted if you don’t consider this job and such decisions “design”.\n\nConcerning the “browser picking whatever font(s) is/are available and supported”: I just meant that it is no big deal to have the same font linked two times, as TTF/OTF for browsers like Safari/Opera/Firefox and as EOT for Internet Explorer. So the visual result would be identical. @font-face is designed for this kind of use, in the same way as the VIDEO tag should support different video formats.\n\n<cite>And, as one can see from the “ZEN GARDEN” examples, to Mr. Hill’s site, neither allows typography, just type.</cite>\n\nBoth of them are no real “web designers”, so I don’t see a point in picking on their webdesign skills.\n\n"
    },
    {
      "time": " 3.Aug.2008 8.05am",
      "content": "Ralph: “Both of them are no real “web designers”, so I don’t see a point in picking on their webdesign skills.”  \nNot “picking on their web design skills”, picking on their typography. You think they are not ’web designers’? You probably have an incorrectly narrow view of that definition in the context of this discussion.\n\n“Regarding webdesign this IS design...browsers, screen sizes and user settings is actually a pretty hard design job...variables like font sizes, column widths or even font choices...” are not enough...  \nYes, there are a lot variables, and we agree that imbedded font formats, (and thus browsers (for the thinking thinker)), should not become a competitive field of typographic functionality —&nbsp;that that would be detrimental to the increasingly shrinking universality of the page description capabilities for the ’web designer’, is obvious... the rest of what I said, is obviously not.\n\n“The web doesn’t work like a printed page”  \nNever? ;ol. The web doesn’t _always_ work like a printed page, you’re right about that. But we are talking, standards, so the web ought to at least be able to pretend to be a printed page, no? Most of the web, in fact, behaves exactly like badly printed pages. And much of it behaves like badly printed and badly designed pages. Command Plus, does not change this, it just makes 5x possible results to test, (in paradise).\n\nj a m e s:  \nI start a new list based on your far superior screen grabs  \n1. is the headline really supposed to obscure the rule, sometimes?  \n2. Should the deck cross a color bound, only in Firefox, or should you fire Firefox?  \n3. Can someone please feed the serif text’s diagonals? y and v are about to drop in both browsers!  \n4. Is... ’s ....a kernable pair?  \n5. The spacing of the text serif face in Firefox and Explorer, though identical, is not what has worked for the last 35,000 years ;) Call me Flat Earthy, but Explorer’s “H u m ans” is the worst of an entire paragraph of _not human readability enabled_ non-text-typography, **(I bet it prints fine though;)**\n\nI’m as all-for-an-all-audio/video/graphics/hyperlinked/non-text-based-round-earthed future as the next guy or gal. But in the meanwhile, typography on the web has got to improve. Why Mr. Hill would try to fit his gigantic ideas into a standard browser at all, much less a super-sized browser, when he could be making his own “Reader” solving all these problems after a single simple download... that’s what I’d do.\n\nCheers!\n\n"
    },
    {
      "time": " 3.Aug.2008 10.10am",
      "content": "vinyl = letterpress\n\n"
    },
    {
      "time": " 3.Aug.2008 1.25pm",
      "content": "Ralf, you can embed things into the html if you want. The only thing is it doesn’t prevent someone from copying it once it’s transfered, it just prevents direct linking by URL.\n\n`<img src=\"data:image/gif;base64,xxxxxxxxxx\" alt=\"\" />`\n\n[http://danielmclaren.net/2008/03/embedding-base64-image-data-into-a-webp...](http://web.archive.org/web/20090925023656/http:/danielmclaren.net/2008/03/embedding-base64-image-data-into-a-webpage \"http://danielmclaren.net/2008/03/embedding-base64-image-data-into-a-webpage\")\n\nExplains one potential use. Also if you want to embed signatures in an e-mail without needing to send an image as an attachment. Not a hugely useful thing but it’s available I’m sure there are niche applications for it.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 3.Aug.2008 11.14pm",
      "content": "<cite>Ralf, you can embed things into the html if you want. </cite>\n\nSure, it’s technically possible. But it’s really no option to force the user to download large resource files within the HTML. (That’s what I hate about most Flash pages...)\n\n<cite>You think they are not ’web designers’? You probably have an incorrectly narrow view of that definition in the context of this discussion.</cite>\n\nWithin the context of my post I take the freedom to have my own definition of “web designer”. And I would want you to respect that. But nevermind. I won’t bother you any longer with my narrow-minded thoughs.\n\n"
    }
  ]
}
