{
  "id": "47894",
  "title": "Being Wicked logo",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Does anyone know what font is used in the “being wicked” logo?\n\n[http://beingwicked.com/index.php](http://web.archive.org/web/20080807023629/http:/beingwicked.com/index.php)\n\nThanks!\n\n [‹ I need help with this italic...](http://web.archive.org/web/20080807023629/http:/www.typophile.com/node/47895 \"Go to previous forum topic\") [van Gogh ›](http://web.archive.org/web/20080807023629/http:/www.typophile.com/node/47897 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080807023629/http://www.typophile.com/user/26077\" title=\"View user profile.\">ctchorz</a>",
  "time": "<br>",
  "uid": "26077",
  "comments": [
    {
      "time": " 30.Jul.2008 7.14am",
      "content": "Hi Christine,\n\nit’s a customized [Americana](http://web.archive.org/web/20080807023629/http:/www.fontshop.com/search/?q=Americana&site=d&sample_text=being%20wicked). The ‘k’ gives it away.  \nF\n\n"
    },
    {
      "time": " 30.Jul.2008 7.16am",
      "content": "Wow, that was quick! Thank you! :)\n\n"
    },
    {
      "time": " 30.Jul.2008 7.43am",
      "content": "The kerning needs improved, but it’s a nice little logo. I like the look of the fire.\n\n"
    },
    {
      "time": " 30.Jul.2008 8.02am",
      "content": "Hi there,\n\nThe font is actually Sanford Book. Happy to see the positive feedback, and always interested in constructive criticism. Asvetic, do you have any kerning suggestions? We’re web specialists, and from what I can tell you guys are typography and font specialists, so we would love any helpful feedback you may have!\n\nThanks,\n\nGordon\n\n"
    },
    {
      "time": " 30.Jul.2008 8.30am",
      "content": "Looking at “Sanford Book” on a free download site I have to say Florian is right. Whatever the designer, Jennifer Dickert, chose to call it, it sure looks like she customized Americana in Fontographer and gave it a new name. The resemblances are for more convincing than the minor changes that make it no longer identical to its model. What the heck, Phil Martin did it (probably with permission) with [Scenario](http://web.archive.org/web/20080807023629/http:/www.myfonts.com/fonts/urw/scenario/) for URW, so why should I complain? [It’s my understanding that URW, like Bitstream, was allowed to keep renamed digitizations of fonts that they converted from pre-digital formats for the original foundries.]\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 30.Jul.2008 9.04am",
      "content": "Sanford Book, huh? It’s Americana, adulterated.\n\nThis is what the causer says:  \n<cite> It started out as a blend of 2 fonts which I further manipulated and refined.</cite> —&nbsp; [Jennifer Dickert](http://web.archive.org/web/20080807023629/http:/www.jenniferdickert.com/fonts/sanford.shtml)\n\nThis is a good example for what is typical of a lot of (not all) free fonts:  \nTheir creators too often take the easy way and start with someone else’s outlines. That’s not only lazy, it’s uninspired. If you don’t have an idea of your own, don’t start designing type. Running [Richard Isbell](http://web.archive.org/web/20080807023629/http:/www.typophile.com/wiki/Richard%252BIsbell)’s Americana and some other poor typeface through a blend filter is not ‘an idea’.\n\nAdditionally, the fonts technically are inferior. With amateur fonts, there’s no quality control, as you would have with commercial foundry fonts.  \nJust have a look at these characters (these are only the most obvious glitches):\n\n ![](http://web.archive.org/web/20080807023629im_/http:/www.typophile.com/files/sanford_5719.png)\n\nManipulated? — Yes. Refined?— No. Type design and font production is a time-consuming and ambitious task. One needs a lot of knowledge – not only in terms of software. And did I say _free font?_. Heck, she even asks $10 for it.\n\nEnd of rant.  \nGordon, I have to admit that it looks quite nice on your website. If it works for you&nbsp;… For what JD did: it doesn’t necessarily have to be against the law (I don’t know), I just find it quite unethical.  \nBottom line: There’s a reason why type costs money.  \nF\n\n"
    },
    {
      "time": " 30.Jul.2008 9.09am",
      "content": "<cite>Asvetic, do you have any kerning suggestions?</cite>\n\nIt’s not huge, very minor tweaking.\n\nBei - tighter\n\nwi - loosen\n\nicked - tighter\n\nyou can even tighten the space between Being and Wicked slightly. I say this because Being is floating out there alone and Wicked is anchored down by the Fire and the tag line. In fact, I might use the distance between the bottom of Wicked and the top of the tag and use it to a basis for the space between Being Wicked and the Fire. Balance and consistency.\n\nI really like that fire!\n\n"
    },
    {
      "time": " 30.Jul.2008 9.17am",
      "content": "Hi all,\n\nThanks for the information about the font. Very interesting indeed. I’ll have to buy Americana for future use as it’s perfect.\n\n@Asvetic - Thank you for the feedback. I really appreciate it. I like your suggestions and am going to play with the logo a little more. Glad you like the fire!\n\nCheers,  \nLorissa\n\n"
    }
  ]
}
