{
  "id": "47899",
  "title": "Client requesting design file",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have a client who hired me to do a direct mail piece for one of their new client. My client sends me a lot of work and I gave her a great rate. But now the end client is requesting the complete layout design in its original format so that “we can make changes to the file as needed”.\n\nIs anyone else releasing the layout design as part of the job? Please advise.\n\n",
  "author": "<a href=\"/web/20091126054456/http://typophile.com/user/34583\" title=\"View user profile.\">bldginc100</a>",
  "time": "<br>",
  "uid": "34583",
  "comments": [
    {
      "time": " 30.Jul.2008 11.08am",
      "content": "Best is to prevent this all in the first place.\n\nYou made a deal with your client. Not with your client clients.\n\nBut what are things worth to you?  \nDo you want to put a good relationship on the line? I guess not.\n\nNext time you probably take this into account.\n\nFor now it is a personal question I guess.\n\nOff course, they do have to pay for it since you were paid for making the designs. Not for giving them the files as well.\n\nJust thinking of something: I’m not certain about the laws in your country (I live in The Netherlands), but it could be you are NOT the author of your designs at all! By taking the job it could be that your immediate client has become the author (with all the rights) of your work.  \nIn that case you stand empty handed, my friend.\n\nHope this helps.\n\n"
    },
    {
      "time": " 30.Jul.2008 11.59am",
      "content": "Thanks for your help. My direct client thought that they were insane for asking, but she passed it on to me and advised her end client to discuss it with me directly.\n\nI will hold my ground on this. I just was not sure if others were giving up layouts as the end client insists that they have it done all the time. I still have my great client to work with and the job was already paid for. It appears that this end client has had other crazy requests to vendors on this project, and are getting resistance from them all.\n\nThanks again.\n\n"
    },
    {
      "time": " 30.Jul.2008 2.17pm",
      "content": "\\>My direct client thought that they were insane for asking, but she passed it on to me and advised her end client to discuss it with me directly.\n\nTo confirm the sub-client is insane, put an insane price on the files - “Like a photographer who keeps the negatives, I don’t normally provide source files, but I’m willing to make an exception for you for only $X,XXX.”\n\n"
    },
    {
      "time": " 30.Jul.2008 9.26pm",
      "content": "Providing source files is fine, it’s what you would call a template file, though you need to be clear on what the purpose of the template it to be used for and factor that into the cost or supplying the client with the files.\n\nYou can more or lease state exactly what is meant by template file and its usages as well.\n\nIdeally to be clear on handing over files form the start is to have a contract of some type stating that the work they are receiving is the end product, a pdf file for print etc and if they want the working files then an arrangement needs to sorted.\n\n"
    },
    {
      "time": " 30.Jul.2008 10.46pm",
      "content": "What I read is that they want to temper your designs?  \nIf that is the case, I think it is a good decision to hold your ground.  \nEspecially because your direct client actually backs you in some way.\n\n"
    },
    {
      "time": " 31.Jul.2008 7.50am",
      "content": "Happens all the time with advertising agencies, where a client will move to a different agency and ask for all their design files. Design files are technically owned by the client, who has bought and paid for them.\n\nIn your case, your client has another client who has asked for the files. And your client has agreed to release them. Be courteous. Be helpful. Let your client know you are being courteous and helpful.\n\nDon’t release fonts or software apps used to build the files: they aren’t licenced to your client’s client.\n\n"
    },
    {
      "time": " 31.Jul.2008 3.33pm",
      "content": "I totally agree with Ken. If the client wants source files, just give them.\n\nThey don’t wanna pay for small changes or they will hire another advertising agency (another designer in your case). Although it’s a small possibility, they could also do this for backup purposes.\n\nIf you give them what they paid for, there is a possibility to work with them again. Not a chance if you do not.\n\n"
    },
    {
      "time": " 31.Jul.2008 3.45pm",
      "content": "<cite>They don’t wanna pay for small changes …</cite>\n\nIndeed, not to mention that it could potentially become a huge hassle for you, the designer, to have to deal with a series of small changes to those files in the future (depending on your workload, this could be a good thing or a bad thing). It is best to give the source files to the client.\n\n"
    },
    {
      "time": " 31.Jul.2008 3.47pm",
      "content": "To be honest whenever a client requests the source files we just burn them and send the cd over (with charge for time, courier etc). Its all about a relationship. I don’t understand what the issue is.\n\nThird parties often request them too, (for DAM systems or whatever) again, we just send them over - even the interactive team send their FLA source files.\n\n"
    },
    {
      "time": " 2.Aug.2008 9.47am",
      "content": "They don’t wanna pay for small changes? — that means they should pay a lot for the right to do their own changes. I would sell them the right to use the files for 250% of the original price. Tell them it is a standard mark up in the industry (It should be).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 3.Aug.2008 8.16am",
      "content": "I share Bert his vision. Not sure whether that has to do with the fact we both come from The Netherlands.  \nAlthough I stick to my point: what is all of this worth to you?\n\n"
    },
    {
      "time": " 3.Aug.2008 5.06pm",
      "content": "I have been asked to hand over files to various clients, and I have done different things in different situations:\n\n- Hate the client, but I know they have money: put a ridiculous price on the files.\n\n- Hate the client, but they don’t have money, and I don’t want to do annoying changes for them: Just hand over the files, and wipe my hands. Or if really hate them, don’t hand over anything.\n\n- Love the client, and I know they have money: Depending on how much work they send you, either just hand over the files or put a small fee on the files, so they know your files have a value.\n\n- Love the client, but I know they don’t have money: Just hand them over.\n\n"
    },
    {
      "time": " 3.Aug.2008 7.00pm",
      "content": "Intellectual property is always a tricky situation, especially concerning clients who misunderstand the fee they are actually paying for is the design services. I have a similar approach to Josh (FeeltheKern) when it comes to handing over files. And honestly, if your clients don’t respect the services you are providing, or appreciate their ultimate value, then it’s probably not a relationship you want to continue.\n\n"
    }
  ]
}
