{
  "id": "47944",
  "title": "Typeface combinations",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi everyone,  \nI'm doing a rebranding project right now, and I'm trying out some typeface combinations. The company is within womens fashion FYI, and their existing CVI only makes use of a Bodoni as it is now (both for their logo and all type applied in brochures etc.)\n\nMuch appreciated if you have any feedback on what combinations you prefer.\n\nRegards in advance\n\n| Attachment | Size |\n| --- | --- |\n| [typo.pdf](http://web.archive.org/web/20110110194834/http:/typophile.com/files/typo.pdf) | 57.46 KB |\n\n",
  "author": "<a href=\"/web/20110110194834/http://www.typophile.com/user/34639\" title=\"View user profile.\">michaelnilsson</a>",
  "time": "<br>",
  "uid": "34639",
  "comments": [
    {
      "time": "",
      "content": "My favorite is the one on the bottom right. the body text is the most readable and the best looking of all of them. The first one isn't bad either, but I like the serif headline font / sans-serif body font combo better here.\n\n"
    },
    {
      "time": "",
      "content": "Not sure that I like any of them.\n\nGo for a font that is of the same family is your plan is to mix san serif with serif, that way they are specifically designed to work with each other.\n\nA couple of good choices\n\nMeta + meta serif\n\nThesis Family\n\nSoho Family\n\n"
    },
    {
      "time": "",
      "content": "Of those, I gotta say I like the first...can't really say why. I guess the sans serif font for the headings is just really clear and simple, and it goes pretty well with the serif font...although there are a lot of serif fonts that could do just as well.\n\nWhat are the pairings, btw? I'm not the kind of guy who can tell just by looking at them, yet.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "",
      "content": "Ok, the combinations are (from top to bottom, and starting with the headline, then emphasized text and then body):\n\n1. LT Helvetica Neue Bold combined with AG Souvenir\n\n2. Leitura Display combined with LT Helvetica Neue Bold/Light\n\n3. Leitura Display combined with Leitura Sans Grot 1/Grot 3\n\n4. Leitura Display combined with LT Helvetica Neue Bold and AG Souvenir\n\n5. Leitura Display combined with HJF Gotham Bold/Light\n\n"
    },
    {
      "time": "",
      "content": "@Charming Man  \nI disagree, sure families like Meta Sns/Srf work together (as they are intended to), but I think very interesting combinations can arise from strongly contrasted sans and serifs also.\n\nI think number 4 or 6.\n\n"
    },
    {
      "time": "",
      "content": "1\n\n"
    }
  ]
}
