{
  "id": "47964",
  "title": "Ana Maria Tavares at Kröller-Müller Museum",
  "forum": "Jos Buivenga's blog",
  "tags": [

  ],
  "content": "<cite>During the sculpture exhibition ‘Sonsbeek 2008: Grandeur’, the Kröller-Müller Museum will show work by one of the participating artists, Ana Maria Tavares. Tavares is fascinated with water. The workings of the water in the streams in and around Park Sonsbeek in Arnhem inspired her work, both in Sonsbeek and at this museum. During her investigations, she discovered some 80 springs in the vicinity, flowing into a large number of streams. The names of these springs – along with the mantra ‘Desire, Deserve, Delight, Still Life, Sparkling Water, Still Water, Sparkling Life’ are part of ‘Chrystal Waters’. This object, specially made for the museum consists of stacked layers of reflecting coloured acrylic glass. The mantra also appears in the net of ribbons that was carried as a banner in the Sonsbeek Procession and now makes up the installation, in combination with ‘Chrystal Waters’ and a map of locations. The installation will be on display until January 31 in one of the museum's project rooms.<br>\n</cite>\n\n+++\n\nAnother (beautiful) sighting of [Museo](http://web.archive.org/web/20120730160944/http:/www.josbuivenga.demon.nl/museo.html).\n\n ![](http://web.archive.org/web/20120730160944im_/http:/typophile.com/files/m3_3841.jpg)\n\n ![](http://web.archive.org/web/20120730160944im_/http:/typophile.com/files/m2_5833.jpg)\n  \n\n ![](http://web.archive.org/web/20120730160944im_/http:/typophile.com/files/m1_6123.jpg)\n  \n\n ![](http://web.archive.org/web/20120730160944im_/http:/typophile.com/files/m4_4803.jpg)\n  \n\n ![](http://web.archive.org/web/20120730160944im_/http:/typophile.com/files/m5_3991.jpg)\n  \n\n ![](http://web.archive.org/web/20120730160944im_/http:/typophile.com/files/m6_6628.jpg)\n\n",
  "author": "Jos Buivenga",
  "time": "31 Jul 2008 — 3:21pm",
  "uid": "10199",
  "comments": [
    {
      "time": "31 Jul 2008 — 4:15pm",
      "content": "This is really interesting. Did it \\*work\\* for you? I mean the top image looks like a sad room for such a conceptual piece. I love the idea of it representing water although I first saw [Sulley](http://web.archive.org/web/20120730160944/http:/www.imdb.com/media/rm1777178880/tt0198781). Cool use of your typeface. Congratulations.\n\n"
    },
    {
      "time": "31 Jul 2008 — 4:40pm",
      "content": "<cite>... although I first saw Sulley. </cite>\n\nLOL! That's was \\*very\\* funny :-)\n\nIt could have looked better in another room, but you also have to take in account my lousy camera and camera work. It looked better in the real world. The entrance is near the back (where my wife stands looking at the ribbons) and the first view from that was really great. It \\*did\\* work for me, but I must confess that I was a bit distracted because she used my type :-)\n\n"
    }
  ]
}
