{
  "id": "47972",
  "title": "Resumes, internships, college...",
  "forum": "Carolann's blog",
  "tags": [

  ],
  "content": "I am working on transforming my resume so that it is fit for graphic design positions. Thus far I have used my resume for part time, clerical, customer service jobs.\n\nAnd now I feel inadequate... ha.\n\nI'm only applying for an internship, and it is unpaid, so I feel like what my resume lacks, I should be able to make up in the fact that I am applying and that seemingly no one else has in the past 3 months. The position has been listed a few times on the company's site of choice.\n\nSo if anyone has any suggestions or tips, they're most welcome. I think I've gotten my content solidified. Now comes the fun part of putting it together in InDesign.\n\n",
  "author": "Carolann",
  "time": "31 Jul 2008 — 7:26pm",
  "uid": "29740",
  "comments": [
    {
      "time": "31 Jul 2008 — 9:37pm",
      "content": "I recently went through and re-designed my resume to suit a more graphically minded audience as well. I'll try and help you as best I can. This is free advice though too, and I don't know how much you already know about resumes so take each point with a grain of rice. (I know I know, it's salt but rice rhymed.)\n\n-If you don't already know what sort of design direction you want to take it in, do some looking at magazines or websites that you like the look of. Take note of graphical elements you can use in your resume like header, bullet and font styles. Make sure you don't go overboard on the designing, however. Remember it primarily needs to be functional and understandable.\n\n-If you're applying to schools or jobs in a specific field, take that into account in your designs. Make sure your resume matches the look and feel a given type of company or college would want.\n\n-Remember: the primary goal of a resume is to get you an interview. Make sure that someone flipping through stacks of resumes would flag yours to make a call.\n\n-General advice about getting where you want to be in a company that can also be applied here: \"Dress for the job you want, not the job you have.\" Maybe a bit cliche, but helps just the same. Design your resume with your desired job in mind. Don't design it as if you were an intern, but as if you were an art director for a major design firm.\n\nI don't know if any of those points are helpful . . . or if they sounded any different from a self help book on writing resumes. Best of luck in getting that internship.\n\n"
    },
    {
      "time": "1 Aug 2008 — 6:46am",
      "content": "“Dress for the job you want, not the job you have.”\n\nThe problem with that is I'd always be walking in to jobs with flip-flops and a t-shirt on.\n\n"
    },
    {
      "time": "2 Aug 2008 — 10:24am",
      "content": "pennANDink - comments helpful! I created my resume in InDesign. It's pretty simple, but I don't have Word on my laptop because usually other things suffice, although I am planning on borrowing my boyfriend's copy for other endeavors.\n\nBut the resume is pretty simple. I wondered if I might be going overboard by using InDesign but I feel a bit justified after those comments.\n\naluminum - I would be, too.\n\n"
    }
  ]
}
