{
  "id": "47982",
  "title": "Looking for Software to create a font specimen book?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi All,  \nI posted this yesterday, but didn't get any suggestions, so I thought I would try one more time. I am on the hunt for a versatile software that will take my font collection and organize it into a printed specimen book. Does anyone have any suggestions?\n\n",
  "author": "Carolyn Connors",
  "time": "1 Aug 2008 — 6:20am",
  "uid": "33741",
  "comments": [
    {
      "time": "1 Aug 2008 — 11:53am",
      "content": "If you're on Leopard, try this:\n\n\"Printable Font Book\n\nPrint out comprehensive previews of your fonts, including sample text in varying sizes or all available glyphs. Just select fonts in Font Book, choose Print from the File menu, and select any of the three built-in report types\"\n\nTaken from [Apple's site](http://web.archive.org/web/20131107211836/http:/www.apple.com/macosx/features/300.html).\n\nEdit: <cite>I posted this yesterday, but didn’t get any suggestions, so I thought I would try one more time.</cite>\n\nNot nice.\n\n"
    },
    {
      "time": "4 Aug 2008 — 4:43am",
      "content": "Thanks for your help. I'll let you know how it works out.\n\n"
    },
    {
      "time": "4 Aug 2008 — 10:38pm",
      "content": "[FontExpert](http://web.archive.org/web/20131107211836/http:/www.proximasoftware.com/fontexpert/) has the ability to print out specimens of selected fonts on your system.\n\nIt sounds ideal for your needs.\n\n\"Print Fonts  \nFontExpert 2007 can print selected fonts. It is easy to print character map, \"water flow\" or face name reports for selected fonts, either installed or uninstalled. You can customize and format page headers and footers as desired, for example, by adding the name of your company. \"\n\n"
    },
    {
      "time": "5 Aug 2008 — 8:36am",
      "content": "I used Typograf to create mine.\n\n"
    },
    {
      "time": "5 Aug 2008 — 10:18pm",
      "content": "Hi, I use Typograf too\n\nThanks!\n\nRichard  \n [Web Developer India](http://web.archive.org/web/20131107211836/http:/www.web-developer-india.com/)\n\n"
    },
    {
      "time": "6 Aug 2008 — 6:59am",
      "content": "I wish FontExplorer X had a feature like that. I suppose a plug-in could be developed. I remember outputting massive sheafs of specimens at my first job using Adobe Type Manager. Oh, ATM. Those were the days... of something.\n\n::shakes off nostalgic glimmer in eyes::\n\n"
    }
  ]
}
