{
  "id": "47992",
  "title": "Logo for Event Management Firm",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI am currently redesigning the [website of a German event management firm](http://web.archive.org/web/20140307100941/http:/www.nordevent.de/).\n\nAlong the way, the client decided that their logo will need a facelift as well, at least in the long-run. The client wants to get rid of the stickmen in their current logo and prefers a simple word mark instead. They really like the typeface of the current logo (Nimbus sans), however I think it lacks some character. That's why I decided to come up with this:\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/ne_logo_4406.png)\n\nUnfortunaly though, I'm not a logo designer by profession and would need some other opinions before presenting it to the client. Any ideas on how it could be improved further? How about spacing etc.?\n\nBy the way, \"Nord\" is German for \"North\".\n\nThanks for any input in this matter...\n\n",
  "author": "Tintin81",
  "time": "1 Aug 2008 — 9:49am",
  "uid": "19464",
  "comments": [
    {
      "time": "1 Aug 2008 — 12:11pm",
      "content": "Just an idea for adding some character to the text: what about adding a little arrow or \"circumflex\" above the \"N\". (playing off the direction and the look of a compass.) You'll probably want to make sure that it's not intended to simply be an accent mark on the \"N\" but an added mark for illustrative purposes. You could do that by making it the same color as \"Event\" or maybe red (some compasses have red north arrows). Just tossing an idea out there . . .\n\nAs far as spacing goes, you need to tighten the space around the \"o\" (between the \"N\" and \"r\") and between the \"e\" and \"n\" in \"Event\". Maybe also a little between the \"n\" and \"t\".\n\n"
    },
    {
      "time": "1 Aug 2008 — 12:24pm",
      "content": "I like it. Compass is a idea good, pennANDink. Since the client wants a word mark, simply putting \"Nord (North)\" to the top of \"Event\" will present north too. In other words you could try a two line version.\n\nCold colors recede. Currently \"Event\" dominates. You could play with the colors. You could also try a tighter kerning for \"o\" and \"e\" on both sides.\n\n"
    },
    {
      "time": "1 Aug 2008 — 3:18pm",
      "content": "Hey,\n\nexcellent feedback, thanks a lot.\n\nThis is the new version:\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/ne_logo_4398.png)\n\nI adjusted the spacing as you suggested. I also added a compass needle on \"Nord\" but wonder if it fits the style of the other letters.\n\nBy the way, the colour scheme can't be changed. I have to stick to the corporate colours here. But that won't be too much of a problem I guess...\n\n[Webdesign Hamburg](http://web.archive.org/web/20140307100941/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "1 Aug 2008 — 4:28pm",
      "content": "I like the color switch you made, but I think the triangle is too squatty. I hope you don't mind but I just quickly did a different version that I think works better with the way the font is cut.\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/ne-logo_02_4731.png)\n\n"
    },
    {
      "time": "1 Aug 2008 — 4:35pm",
      "content": "Too bad the v in Event is inverted, that would be the best spot for a mark like that. :^\\>\n\nI think the scale of both of those is too small compared to the word mark. No?\n\n"
    },
    {
      "time": "1 Aug 2008 — 4:41pm",
      "content": "I love it. So strong. I see \"Nord\" right away and then \"Event\" and the arrow now. I guess the arrow is fine. Minimalist and clever. Tells north, future, rising and positive things. Using the same tint for \"Event\" and the arrow makes \"Nord\" even stronger.\n\nI also find it procreative. If \"Nord\" decides to get into -let's say- finance business some day, you'll just type \"Finance\" instead of \"Event\" and it's done.\n\nThat \"t\" seems lonely out there, so I guess a bit tighter kerning could be useful between \"n\" and \"t\" as pennANDink suggested while I was writing my previous post.\n\n"
    },
    {
      "time": "1 Aug 2008 — 5:28pm",
      "content": "agree with Miss Tiffany :) here's it slightly larger.\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/ne-logo_6426.png)\n\n"
    },
    {
      "time": "2 Aug 2008 — 12:38am",
      "content": "You are probably right about the compass needle.\n\nHere's what I've got so far:\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/ne_logo_4133.png)\n\nNote that I also tightened the space between the \"n\" and the \"t\". Is it close enough?\n\nI'm surprised that none of you guys mentioned cap height so far. I stretched the \"E\" a little so that it has now the same height as the preceding \"d\". I like that, although I can't really say why. The \"E\" is a tad higher than the \"N\" now. Not sure if that's good or bad...\n\n[Webdesign Hamburg](http://web.archive.org/web/20140307100941/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "2 Aug 2008 — 1:12am",
      "content": "Timo,\n\nthis is starting to look really nice – great use of Olsen as well.  \nI don't mind the heightened 'E' at all, but curious to see how it would look if you would shorten the 'd' instead.\n\n"
    },
    {
      "time": "2 Aug 2008 — 10:18am",
      "content": "I get stuck in the arrow in the V.\n\n"
    },
    {
      "time": "4 Aug 2008 — 5:34am",
      "content": "I don't like the arrows used now. Sorry.\n\nIn the curent state I would place the arrow on top of the 'O'\n\nBut what about placing the arrow inside the 'O'? I feel this is a better incorporation.  \nYou might have to alter the 'O', though.\n\nThe arrow is copy of the arrow in the 'V' as you can see in the third image\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/nord_6681.gif)\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/nord2_5317.gif)\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/nord3_4510.gif)\n\nThis is where the arrow came from.\n\nAnd, perhaps you could use the 'd' and 'E' to form a new arrow?\n\n"
    },
    {
      "time": "5 Aug 2008 — 2:17am",
      "content": "Wow, nice, Bobby!! Looks fantastic. Thank you!\n\nDo you think it may be a good idea to slightly rotate the arrow inside the \"o\", only by say 5 degrees? Will that make it look more like an actual compass needle? I think I'm going to try that as well...\n\n[Webdesign Hamburg](http://web.archive.org/web/20140307100941/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "5 Aug 2008 — 2:52am",
      "content": "I have thought of that. But let's face it.  \nNord (North) is up.  \nBut it is worth trying. I brings some dynamics into play.\n\nWhen you do this, have a good look at the arrow inside the 'O' so it will not contrast to much with all of the other letters. Now the 'O' is fatter than the rest.\n\nViel spass!\n\n"
    },
    {
      "time": "6 Aug 2008 — 5:15pm",
      "content": "Oh no. I liked the previous treatment with the arrow over the N much better. No offense, bobbybobo, but the arrow over the N much more strongly suggests North and cartographic direction than your treatment. Just my .02.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "6 Aug 2008 — 7:12pm",
      "content": "TIN:\n\nI liked the second version with the arrow above the 'N'. What I would do to integrate it better is make the angle of the slope in the point the same as the serif below where it connects with the vertical stroke of the 'N'.\n\nAlso give it two vertical sides before the slope or point to mirror the serif of the 'N'.\n\nHope this makes sense but I have no software where I am now to mock it up.\n\nJay\n\n"
    },
    {
      "time": "6 Aug 2008 — 9:57pm",
      "content": "@nick: No offense taken. ;-) You have got a good point there to consider.\n\n"
    },
    {
      "time": "8 Aug 2008 — 2:54pm",
      "content": "Hey guys,\n\nThanks for your input, really appreciated...\n\nThe client doesn't like the arrow version though. I just rang them up. They prefer their old [clipart logo](http://web.archive.org/web/20140307100941/http:/www.nordevent.de/) over the arrow version. Arrggghh... How crazy is that? I'll have a face to face meeting with them next week though. Let's see if I can convince them.\n\n[Webdesign Hamburg](http://web.archive.org/web/20140307100941/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "8 Aug 2008 — 9:00pm",
      "content": "Don't you hate it when that happens.\n\nLooking back on their old logo now, it looks like they may want something a little more delicate. Even though I love this font, they may be looking for something a little more consistent with their old face. Sorry I can't help with any specific examples of ones that would work, but maybe look at their old logotype to get a feeling.\n\nAlso, now this may be adding a little too much, but what if you colored half the arrow blue and left the other half white with just an outline . . . to give it a more compassy feel.\n\nI think the more options you give them this way, the less chance they'll have to stay with their current look.\n\nWhatever you do, I hope you convince them to see things your way. Good luck.\n\npenn\n\n"
    },
    {
      "time": "8 Aug 2008 — 9:02pm",
      "content": "\\*\\*sorry, double post was here, (accidentally clicked the button twice) edited it out\\*\\*\n\npenn\n\n"
    },
    {
      "time": "16 Aug 2008 — 7:13am",
      "content": "Hi,\n\nI think pennANDink is right here. The more options I present to the client the more likely they are to go with any of my solutions. How do you like this one then?\n\n ![](http://web.archive.org/web/20140307100941im_/http:/typophile.com/files/logo_concept7_4997.png)\n\nDo you think it's got any potential?\n\n[Webdesign Hamburg](http://web.archive.org/web/20140307100941/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "16 Aug 2008 — 8:16am",
      "content": "I really liked the 5th image from the top of the page the best. It had the most character, in my humble opinion. I never received an explanation of why that design failed. This works nicely, though, since this suggests a compass needle while also complementing the geometry of Helvetica.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "16 Aug 2008 — 11:57am",
      "content": "Did you get any more specific feedback from them? I thought your post on 2 August with the arrow and the chiseled slab font (is it Olsen?) was terrific. It's a shame they did not care for the arrow designs. What do they like about their old logo? A light weight font? a Condensed font? All caps? Please I hope it's not the dancing children. Keep at it there is so much to explore and develop.\n\n"
    },
    {
      "time": "16 Aug 2008 — 4:02pm",
      "content": "Hi,\n\nThanks for your comments, Nick and Kirsten. I fully agree with you. The arrow version is a simple yet very effective solution. My contact at the client's office told me on the phone that they \"didn't like\" that version, however, without giving any details.\n\nMy guess is that they somehow feel attached to their [old logo](http://web.archive.org/web/20140307100941/http:/www.nord-event.de/) (the \"dancing children\") in combination with the company name set in \"Nimbus sans\" (their \"corporate typeface\"). However, I feel that Nimbus sans (which is actually derived from Helvetica) lacks the character to turn it into a unique word mark.\n\nOn Tuesday I have a meeting with the entire project team. So let's see how it goes.\n\n[Webdesign Hamburg](http://web.archive.org/web/20140307100941/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "16 Aug 2008 — 4:04pm",
      "content": "By the way, the font I used in the initial versions is \"Union\", not Olsen. Although, to be honest with you, I'm not quite sure what the difference is between the two anyway.\n\n[Webdesign Hamburg](http://web.archive.org/web/20140307100941/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "18 Aug 2008 — 9:05pm",
      "content": "I'm also down with the arrow hat version.\n\ngood luck at the meeting.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20140307100941/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
