{
  "id": "48009",
  "title": "hand-drawn logos, your opinion",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I'm trying to create an identity for my company, Manilla, but I'm having a hard time deciding what it should look like. I want the logo to represent that we are creative, fun and artistic (traditional arts). We try to use our own artwork in all the sites we do if the client is willing and if it fits. I've looked around for inspiration like on Logopond and Behance but I haven't found what I'm looking for.\n\nHowever, Mike Perry has a lot of great hand-drawn type [http://www.midwestisbest.com/work.php](http://web.archive.org/web/20120226072632/http:/www.midwestisbest.com/work.php \"http://www.midwestisbest.com/work.php\")  \nThe question is, if I decide to use a hand-drawn logo will that look less professional?\n\nI attached some past **mock-ups**. The last one is what I'm trying to perfect. The L loops represent my sister and I and are also supposed to be a stylized M.\n\nbtw, hi Typophiles! (first post)\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.png](http://web.archive.org/web/20120226072632/http:/typophile.com/files/Picture%202_95.png) | 9.36 KB |\n| [Picture 5.png](http://web.archive.org/web/20120226072632/http:/typophile.com/files/Picture%205_29.png) | 6.73 KB |\n| [Picture 6.png](http://web.archive.org/web/20120226072632/http:/typophile.com/files/Picture%206_12.png) | 6.79 KB |\n| [manilla\\_rough\\_sample.jpg](http://web.archive.org/web/20120226072632/http:/typophile.com/files/manilla_rough_sample.jpg) | 26.39 KB |\n| [swoop.gif](http://web.archive.org/web/20120226072632/http:/typophile.com/files/swoop.gif) | 2.01 KB |\n\n",
  "author": "<a href=\"/web/20120226072632/http://typophile.com/user/34735\" title=\"View user profile.\">MrKikkoman</a>",
  "time": "<br>",
  "uid": "34735",
  "comments": [
    {
      "time": "",
      "content": "\"The question is, if I decide to use a hand-drawn logo will that look less professional?\"\n\nThat all depends on the execution. And by the looks of the samples you attached, you don't have to worry about that.\n\n"
    },
    {
      "time": "",
      "content": "picture 2, rough\\_sample, and swoop remind me of something... a little derivative, although i think they're the strongest graphically.  \nthe loops read as \"l\" \"l\" and not as an \"m.\"\n\n"
    },
    {
      "time": "",
      "content": "I’m having a hard time deciding what Manilla does.\n\n"
    },
    {
      "time": "",
      "content": "\"I’m having a hard time deciding what Manilla does.\"\n\n ![](http://web.archive.org/web/20120226072632im_/http:/typophile.com/files/swoop_FINALVERSION_6605.gif)\n\nIs this what you want?\n\n"
    },
    {
      "time": "",
      "content": "well, you have to admit that david has a point. the type does not, in and of itself, communicate what the public might wanna know about manilla. sometimes that's okay. \"TARGET\" does not convey \"retail store\" but it's a very successful logo.  \nbut sometimes, it's not okay. if it's not an established brand, a logo that really tells us what to expect can be very helpful.\n\nthe bigger question is, are hand-drawn logos less professional, and the answer is no -- not if they're done with professionalism. or, yes -- if they're not.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the post ChuckGroth. I understand what David means. A lot of logotypes depend on a logo to help establish the brand. Although, I haven't seen that many web agency logos with web related graphics. It's too predictable.\n\nSince manilla uses custom artwork on sites I want the logo to look \"artsy\". I will post some hand-drawn logos this week.\n\nOtherwise, since I'm going to use the swoop logo, does anyone have any critiquing to give on: if the two l's look like an 'M' to you/ if the swoops are too big/too small.. etc?\n\nThanks\n\n"
    },
    {
      "time": "",
      "content": "I was immediately struck with #2. The two l's do not look like an 'M' to me. Definitely playful.\n\nI'm getting a sense that perhaps you're getting a bit anal on the details here. Trust that you're going in the right direction with this project. (Although I do feel your pain with self-critique. It can be paralyzing!)\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "",
      "content": "I find the x-height of the type a little too varied the a’s in particular are a little ‘bouncy’ and heavy on the right. On the swoop version the l’s are becoming too knot-like and less spontaneous maybe a greater variation of weight would help.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "The problem for me is that the logo _doesn't_ look hand drawn. It looks like it was done in illustrator. Have you tried pen & ink? (sorry, not intended to be an advertisement for my name) Right now it's looking a little cartoony to me rather than 'artsy'.\n\nI think actually hand drawing this would give you more of an authentic, artsy feel.\n\n"
    },
    {
      "time": "",
      "content": "I have an issue with the name. Manilla = plain, generic, office cubicle land.\n\nOut of curiosity, why was that chosen as the name for a creative agency?\n\n"
    },
    {
      "time": "",
      "content": "Thats really interesting. I associated the name with something quite exotic and steamy as per the Philippines.\n\nIs it an american term? Don't really hear it used in the generic sense in the UK.\n\n"
    },
    {
      "time": "",
      "content": "I associated it with manila folders too, just like aluminum. I don't know if the name is strictly American, but here is what they are: [http://en.wikipedia.org/wiki/Manila\\_folder](http://web.archive.org/web/20120226072632/http:/en.wikipedia.org/wiki/Manila_folder \"http://en.wikipedia.org/wiki/Manila\\_folder\")\n\nThere's only one 'l' in the correct spelling of the folder though.\n\npenn\n\n"
    },
    {
      "time": "",
      "content": "Without penn's comment, I had no idea what aluminum was talking about! But then again, I'm not from the US. Nor do I work in \"office cubicle land\". Manilla sounds exotic to me also (capital of the Philippines) and the loops are quite nice. My favorite is the last option you presented (with shorter lines perhaps).\n\n"
    },
    {
      "time": "",
      "content": "ah, perhaps it is a US-centric concept. I actually never knew the origins of the term 'manila' in Manila envelope until reading that Wikipedia page!\n\n"
    },
    {
      "time": "",
      "content": "semantics and associations aside ... I quite like the beginnings of the Pablo Ferro style.\n\nDunno if it suits ... but I like the style :)\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20120226072632/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20120226072632im_/http:/typophile.com/files/Manilla_hand_drawn_5150.jpg)\n\nI attached some more logo ideas. I really can't pinpoint which direction I want to go in. Why am I treating this identity like it's for Nike lol?\n\nAnyways, to answer some of your questions:\n\nYes, Manilla is a creative agency and yes we're US based. We chose the name for a couple of reasons:\n\nAluminum is half right on one of them. It does represent the plain, generic office cubicle-land. But to me it more so representative of the manila paper I drew on as kid. Creativity was welcome and free to express.\n\nIt's an inside joke. I'm half asian, so if you take a yellow asian man and mix it with a white caucasian man what do you get? Bad joke.\n\nThe two L's in manilla stand for my sister and I -- it's our company. Having the L's connected can represent our brother-sister relationship.\n\nIt sounds fun to say! We wanted a name that didn't make us _seem_ like geeks i.e Hyper Revolution Media or Digitalistic Realm Design.\n\nAluminum, since you said it reminds of of the corporate world that makes it even more important for us to show in the identity that we're completely opposite of \"cubicle land\". That's why I feel a hand-drawn/\"artsy\" logo will hopefully get the message across.\n\nAs of now, I'm leaning towards the bottom ones. Unfortunately, it takes the emphasis away from the L's but I feel it's more fitting. As you can see in the top right, it looks funky mixing computer fonts with hand drawn letters in the same word. Well, at least the way I'm doing it.\n\nWhat do you all think? BTW, these are all roughs and the bottoms ones aren't supposed to be on a baseline.\n\n"
    },
    {
      "time": "",
      "content": "I too like your pick #1 best so far. Be careful of your double \"l\", at times it looks like a funky \"M\" and then your name reads ManiMa.\n\n"
    },
    {
      "time": "",
      "content": "Actually, it's good you say that. I want the L's to look like a stylized 'M' so that it can be used as a \"logo\". However, I see what you mean about it reading ManiMa. I'll try loosening it up more.\n\n"
    },
    {
      "time": "",
      "content": "not such a fan of the vector versions, they lose the charm of the original sketches\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20120226072632/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "I like the idea.  \nAs a Finn the word manilla makes me think of rope, so the loops are appropiate. Manila rope is manillaköysi in Finnish. Manillaköysi is also a famous book by Veijo Meri.\n\nWikipedia came up with this, too:  \nManillas, ancient money first used in Africa by the Calabar Kingdom of present day Nigeria.\n\n"
    },
    {
      "time": "",
      "content": "Definitelly use the \"my pick #1\" the right version. Very nice. A small tweak with \"m\", double \"ll\" and you're practically done.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
