{
  "id": "48015",
  "title": "secure empty trash?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "whats the difference between this and the noral ’empty trash’?\n\n [‹ New Original Hebrew Fonts](http://web.archive.org/web/20081122032221/http:/www.typophile.com/node/30236 \"Go to previous forum topic\") [Quark 8 doesn't suck ›](http://web.archive.org/web/20081122032221/http:/www.typophile.com/node/47766 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122032221/http://www.typophile.com/user/17767\" title=\"View user profile.\">fredcastle</a>",
  "time": "<br>",
  "uid": "17767",
  "comments": [
    {
      "time": " 2.Aug.2008 2.15pm",
      "content": "Empty trash doesn’t completely delete the files; it just saves the space occupied by them to be overwritten the next time you add data to your computer. Secure empty trash writes over the part of the hard drive occupied by those files.\n\n"
    },
    {
      "time": " 2.Aug.2008 2.46pm",
      "content": "Note, though, that even though the data is overwritten once, it’s still recoverable, fairly easily. There are utilities out there for making a bit more sure your data is gone when you delete it (mainly by overwriting the file a good couple of times - which helps, though the data may still be recoverable, unless you do something to the hardware itself)...\n\nFor the normal day-to-day, though, a secure empty trash should suffice.. ;)\n\n[http://docs.info.apple.com/article.html?path=Mac/10.5/en/8279.html](http://web.archive.org/web/20081122032221/http:/docs.info.apple.com/article.html?path=Mac/10.5/en/8279.html \"http://docs.info.apple.com/article.html?path=Mac/10.5/en/8279.html\")\n\n"
    },
    {
      "time": " 2.Aug.2008 6.47pm",
      "content": "but doing the “secure” empty trash after a number of normal empties removes all the extra space?\n\n"
    },
    {
      "time": " 2.Aug.2008 7.22pm",
      "content": "On Windows, I recommend UltraSentry, which supports US defence standards for secure deletion.\n\n"
    },
    {
      "time": " 3.Aug.2008 9.50am",
      "content": "<cite>Note, though, that even though the data is overwritten once, it’s still recoverable, fairly easily.</cite>\n\nThis is a very common misconception. <cite>Any</cite> overwritten data is both difficult and expensive to recover, even when using the special equipment necessary to do so.\n\nA single pass of zeroes is more than sufficient for over 99% of users in the world. Anything else is more placebo than anything else.\n\n"
    },
    {
      "time": " 7.Aug.2008 5.00pm",
      "content": "Well, it’s like shredding paper. Run it through a regular shredder once, and it’ll be safe for most prying eyes - and for 99% of users, that’ll be enough. But if you’re planning to take over the world Pinky & the Brain-style, you’ll still want that paper turned into pulp and burned, then scotch-taped to an atom bomb and sent into outer space, where it’ll be blown to smithereens...\n\nSure, it’s overkill for most users - but bombs in space are still more fun. ^.^ Just the same way [the shredder widget for mac](http://web.archive.org/web/20081122032221/http:/www.apple.com/downloads/dashboard/business/shredder.html) is more fun than secure empty trash.\n\n(Oh, and by “fun”, I of course mean “secure”.)\n\n"
    },
    {
      "time": " 7.Aug.2008 6.39pm",
      "content": "Of course, I was going to suggest the shredder widget. I am also quite partial to the [Abracadabra Widget](http://web.archive.org/web/20081122032221/http:/www.apple.com/downloads/dashboard/networking_security/abracadabra.html), that hides files from your finder, and password protects their recovery.\n\n"
    }
  ]
}
