{
  "id": "48041",
  "title": "Logo Design for Photographer",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I am working on this logo, and I am having a bit of a hard time. I looked at fonts for inspiration, and Alleghieri had some interesting swashes, that inspired the box look. I used that font for the first three, but it looks too amateurish and dirty to me, especially for a photographer (since one would hope to convey crisp clean imagery).\n\nI still liked the idea of the “L” and “k” making a box, so I modified Bernhard Fashion. I started to really like where it was going at that point. This is a chronologically numbered grid of where I am currently at, with the last one being my final attempt thus far.\n\nTo add insult to injury, the client likes the first three, which I now can’t stand.\n\nUgh. Any helpful comments appreciated.\n\n ![](http://web.archive.org/web/20081122054408im_/http:/www.typophile.com/files/LS_Logo_5070.jpg)\n\n [‹ Duplicate letters in logo identity](http://web.archive.org/web/20081122054408/http:/www.typophile.com/node/39988 \"Go to previous forum topic\") [University Mag logo ›](http://web.archive.org/web/20081122054408/http:/www.typophile.com/node/47781 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122054408/http://www.typophile.com/user/32160\" title=\"View user profile.\">tearsforsappho</a>",
  "time": "<br>",
  "uid": "32160",
  "comments": [
    {
      "time": " 3.Aug.2008 11.23am",
      "content": "I like the echo in #3, but even more I like the “very simple thoughts” below #’s 7,8,9. Any way you can go after a more photographic crop gesture with those? Maybe running the info side or bottom. As they are I am seeing matting.\n\nMichael\n\n"
    },
    {
      "time": " 3.Aug.2008 11.31am",
      "content": "What about this?\n\n ![](http://web.archive.org/web/20081122054408im_/http:/www.typophile.com/files/Logo10_5684.jpg)\n\n"
    },
    {
      "time": " 3.Aug.2008 11.49am",
      "content": "I like it better. Maybe the L looks a bit like a T. Possibly do not cross them.\n\nNow, can you resolve the disparity in weight for me, no I am not the mean old art director, see if the same weight for the type works and reverse the colors. Or just pump the weight of ST DIOS.\n\nAnyone else?\n\nMichael\n\n"
    },
    {
      "time": " 3.Aug.2008 11.59am",
      "content": "horrible im afraid.\n\nToo contrived. Your making the letters do things thier not supposed to do.\n\nSee if you can make that frame in a simpler way without distorting the letters\n\nfind fonts that naturally lend themselves to making that shape\n\n"
    },
    {
      "time": " 3.Aug.2008 12.35pm",
      "content": "She’s working thru it. Jeez!\n\nNo, let me rephrase it. Give her some concrete suggestions other than what I have suggested.\n\n“I.e. Maybe the L looks like a T and try making consistent the weights” which were what I said!\n\nMichael\n\n"
    },
    {
      "time": " 3.Aug.2008 1.25pm",
      "content": "Here, I have tried your suggestions. I uncrossed the “L”, and increased the weight of the “ST DIOS”. I have tried two different placements for the orange crop mark, so let me know if you like either or neither.\n\n ![](http://web.archive.org/web/20081122054408im_/http:/www.typophile.com/files/Logo12-13_4295.jpg)\n\n"
    },
    {
      "time": " 3.Aug.2008 2.22pm",
      "content": "After you decide upon the final appearance of the logo, FontWorld ( [www.fontworld.com](http://web.archive.org/web/20081122054408/http:/www.fontworld.com/ \"www.fontworld.com\")) has a service to convert the logo in a keystroke font, so the customer can simply type a keystroke to get the logo. This is called a “Font Logo”. Prices are reasonable. Many well established companies use Font Logos. They sub-contract this service as well, so this can be another service that you can offer.\n\n"
    },
    {
      "time": " 3.Aug.2008 2.39pm",
      "content": "sorry. i like number 2, with the kodak yellow box placement of number 3. the alluded dimensional boxes of 6-9 (and the subsequent uploads) don’t say anything photographic to me, and seem a little forced.\n\n"
    },
    {
      "time": " 3.Aug.2008 5.28pm",
      "content": "-The first three are too sloppy. The font isn’t right. The studios in number three I especially don’t like.\n\n-I like the look of 7, 8 & 9. The box adds dimension and substance. The font you’re currently using is very thin and cannot stand strongly alone. I don’t like the join on the “y”. It makes the font look too haphazard.\n\n-Forming the “U” in studios with the bottom of the “k” forces the type to do a little too much with itself (if you know what I mean).\n\n-I’m not sure putting the horizontal line of the “L” below everything (at least with the current font and setup) is working. It really just makes everything a little hard to read. It makes me focus more on the “uck” (which is probably not a good thing).\n\n-Have you thought about using a more substantial font?\n\n-I did a quick version in Helvetica that’ll maybe give you more ideas about where to take this. I think you need to simplify and clean up what you’re trying to do.\n\n ![](http://web.archive.org/web/20081122054408im_/http:/www.typophile.com/files/luckey_02_4023.png)\n\n"
    },
    {
      "time": " 4.Aug.2008 12.18am",
      "content": "Hi, from your first set I like no. 2. If it fits the character of the photographer of course.\n\n"
    },
    {
      "time": " 4.Aug.2008 7.02am",
      "content": "I’m with Chuck and Orbi. The first 3 have a nice retro feel to them. Perhaps that’s not appropriate for this client, but they have a nice feel.\n\nYour second round works too, though there is the challenge that the ’L’ become a bit lost.\n\n"
    },
    {
      "time": " 4.Aug.2008 1.24pm",
      "content": "At first glance I liked 2. I also like Penn&inks work.\n\n"
    },
    {
      "time": " 6.Aug.2008 1.07pm",
      "content": "I think the logo is not a problem of make something right or wrong. You can choose from those proposals you´ve made but a logo is a problem of identity. The brand itself represents Luckey Studios, so this is some kint of restaurant or bakery?.\n\nSL\n\n"
    },
    {
      "time": " 7.Aug.2008 9.25am",
      "content": " ![](http://web.archive.org/web/20081122054408im_/http:/www.typophile.com/files/Logo12-13_4295_6041.jpg)\n\nYou almost have it... the second one. Go back to the original k and soften up the “frame”. Love it.\n\nAssuming this is a film/production studio, you’ll want to loosen the lines creating the “frame” and let them appear as if you’re creating a frame with your thumbs and forefingers. You know, like when a director/photographer walks into a space, and to get an idea of how to shoot it, they create a simple frame with their hands. Now I’m not suggesting you draw hands, just kind of hint to the curvature of the fingers on the inside of that makeshift frame then apply it to your current stiff frame. Subtle, but nuanced.\n\n"
    },
    {
      "time": " 7.Aug.2008 6.32pm",
      "content": "I have had an absolutely unruly week at work, and havent had a chance to go back to this. However, there are some suggestions here that I really think work.\n\nFirst, to elaborate, this logo is for a food and still-life photographer. Most of the people that he works with already know him through the absolutely horrible logo I made for him when I was a freshman in college (eek!) so, this redesign is a pro-bono one to more or less clear my name. Everyone has skeletons...\n\nSo, that said, it really isnt necissary for this logo to be incredibly static, and it could even benefit from some personality. And for the record, the “k decender as u” was the client’s idea, one that I did not agree with but attempted to make work. However, after looking at it more, I am going to have to stand my ground.\n\nAsvetic, I really like your suggestions, and I will be reworking this over the weekend. I’ll be sure to post updates!\n\n"
    }
  ]
}
