{
  "id": "48044",
  "title": "Wordmark critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi, all. I’d really appreciate your critiques of this wordmark I’m working on. It’s Helvetica Neue with the l borrowed from DIN Mittelschrift and slightly altered, and a single story a built from Helvetica’s d.\n\nThanks in advance.\n\n| Attachment | Size |\n| --- | --- |\n| [clashmore-typo.png](http://web.archive.org/web/20081122054701/http:/typophile.com/files/clashmore-typo.png) | 6.5 KB |\n\n [‹ Logo Design for programmer](http://web.archive.org/web/20081122054701/http:/www.typophile.com/node/47946 \"Go to previous forum topic\") [Need your thoughts - Type support t-shirt ›](http://web.archive.org/web/20081122054701/http:/www.typophile.com/node/47807 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122054701/http://www.typophile.com/user/26894\" title=\"View user profile.\">clashmore</a>",
  "time": "<br>",
  "uid": "26894",
  "comments": [
    {
      "time": " 3.Aug.2008 5.29pm",
      "content": "Let me ask you this, why would you want the Clashmore word mark as opposed to the avatar you have. It, the avatar, is much more interesting, individualistic and thought provoking than a series of san serif letters strung together with no distinguishing marks other than some of them are altered characters.\n\nMichael\n\n"
    },
    {
      "time": " 3.Aug.2008 5.35pm",
      "content": "Michael/typerror: Are you looking for a more complex answer than “they still make fun of Prince for changing his name to a symbol”?\n\n"
    },
    {
      "time": " 3.Aug.2008 6.09pm",
      "content": "The wordmark and the monogram in my avatar are actually for two separate things. Also, the wordmark is only part of the logo. I’m looking to get some thoughts on how it could be improved from a technical standpoint.\n\n"
    },
    {
      "time": " 3.Aug.2008 6.42pm",
      "content": "Prince was a joke to begin with. I assume Robert is looking for a mark with some distinction. I rather like his avatar and yours Eileen!\n\nThe Clashmore is JUST fine.\n\nMichael\n\n"
    },
    {
      "time": " 3.Aug.2008 6.54pm",
      "content": "And I would not make fun of either of your symbols.\n\nEileen, does your avatar/logo appear on your printed ephemera? IF so/not why/not. Perfectly lovely, as is Robert’s.\n\nIf it is inappropriate, for purpose, then it should be changed. I was under the assumption that Robert’s avatar could have been his logo and thought he did not need to change a thing.\n\nMichael\n\n"
    },
    {
      "time": " 3.Aug.2008 7.00pm",
      "content": "Thanks, Michael. I really appreciate your insight.\n\n"
    },
    {
      "time": " 3.Aug.2008 7.17pm",
      "content": "No problem Robert. I know a nice mark when I like one. : )\n\nAnd I liked yours.\n\nI am just soooooo done with the sans as the definitive modifier in the identity environment.\n\nUnexpressive at best. Unless it is expressive.\n\nAnd I would not appreciate me too much cause I am about to catch a ration for this remark.\n\nMichael\n\n"
    },
    {
      "time": " 3.Aug.2008 8.48pm",
      "content": "I agree with you, Michael, on both the aviatar comments and also on sans. Clashmore’s aviatar is excellent. An aviator is an important part of a typophile’s clothing. My own aviatar is crap, but it will do until I get around to doing something better and more appropriate.\n\n"
    },
    {
      "time": " 3.Aug.2008 9.22pm",
      "content": "Graham, O my, so good to see your thoughts again. I lost your addie after our last contact.\n\nNow you guys want to see some talent see this guy.\n\n[typerror@aol.com](mailto:typerror@aol.com)\n\nSend me your info and I promise I will have the package off to you in less than 1 hour, provided the post office is open.\n\nAs to your avatar, being the illustrator you are I am sure it will be brilliant, no magnificent. But what you have is DISTINCTIVE as is Robert’s. It is so good to see your name. You were a voice of reason on the calligraphic site.\n\nMichael\n\n"
    },
    {
      "time": " 3.Aug.2008 9.46pm",
      "content": "Michael, I have not noticed your name on typophiles before!?  \nSo good to hear from you. We will have to bring the voice of a calligrapher’s hand to the world of the bezier.\n\nBest wishes, Graham\n\n"
    },
    {
      "time": " 3.Aug.2008 11.00pm",
      "content": "Graham\n\nOur predecessors have paved the way but many have missed the path.\n\nI am not sure they are ready for the tour de ink. No pumped sans, just expressive nuance. Something that is sadly lacking in a lot of contemporary design.\n\nLet us start a new thread in the a.m. Your a.m. Oh hell, you are on the down side of the work day! Ok, I will start it and you and some others can pick it up. I will nudge them. I got dirt on the calligraphers. That will be the title! OK?\n\nMaybe Miss Tiffany will give us our own little corner. “Calligraphy, why I have black fingers!”\n\nMichael\n\n"
    }
  ]
}
