{
  "id": "4806",
  "title": "Plantin Numerals",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Okay, this isn't really an ID request, but I was reading a book set in Plantin and this got me curious. Does anyone know why the numerals in the regular weight of Plantin don't resemble the numerals in any other weight of Plantin, but instead resemble the numerals of Goudy's Italian Old Style? See the picture below. (This only seems to apply to the LF\n\n",
  "author": "<a href=\"/web/20111214115521/http://typophile.com/user/3418\" title=\"View user profile.\">metadox</a>",
  "time": "<br>",
  "uid": "3418",
  "comments": [
    {
      "time": "",
      "content": "This is very interesting. I tried to find an older sample of Plantin lining numerals, but they don't seem to have existed. All of the metal versions of Plantin I found only show old style numberals. I wonder if somebody at Monotype took a short cut when they did the lining numerals for Regular?\n\n"
    },
    {
      "time": "",
      "content": "I just took a look at Bitstream's digitization of Plantin, [Aldine 721](http://web.archive.org/web/20111214115521/http:/www.myfonts.com/fonts/bitstream/aldine-721/aldine-721/testdrive.html?s=1234567890&p=48), and it looks like the numerals are the same style in all weights there (including the regular). This was probably digitized separately from MT's. The question is, where did Plantin MT's lining numerals come from, and when were they designed?\n\n"
    },
    {
      "time": "",
      "content": "Another interesting tidbit: Bitstream's version of Plantin, [Aldiine 721](http://web.archive.org/web/20111214115521/http:/www.myfonts.com/fonts/bitstream/aldine-721/aldine-721/testdrive.html?s=1234567890&p=60), has the correct numerals, matching the other weights. No old style numerals, though.\n\n"
    },
    {
      "time": "",
      "content": "haha... guess we had the same thing in mind, Mark.\n\n"
    },
    {
      "time": "",
      "content": "_Rookledge's International Type Finder_ (1978) shows the correct lining numerals in the regular weight, so they must have existed in pre-digital versions of the face.\n\n"
    },
    {
      "time": "",
      "content": "I think there's something about this in Morison's \"A Tally of Types.\" I don't have my copy at work, but I'll look tonight.   \n   \n-Addison\n\n"
    },
    {
      "time": "",
      "content": "Sorry, I was thinking of Van Dijck having Bembo's numerals. I can't find anything on this.   \n   \n-Addison\n\n"
    },
    {
      "time": "",
      "content": "Also interesting is [Plantin Titling MT](http://web.archive.org/web/20111214115521/http:/www.fonts.com/findfonts/detail.asp?pid=205920) whose numerals appear to be hybrids of the two different forms.\n\n"
    }
  ]
}
