{
  "id": "48062",
  "title": "connect.com",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi All,\n\nafter reading the last 200 posts in the last 4 hours, I decided to put my logo, which I designed for a friend to your critisism. What is wrong and what is good?\n\nThanks.\n\n ![](http://web.archive.org/web/20131023141215im_/http:/typophile.com/files/connect_5038.jpg)\n\n",
  "author": "nic08",
  "time": "4 Aug 2008 — 8:50am",
  "uid": "34832",
  "comments": [
    {
      "time": "4 Aug 2008 — 10:41am",
      "content": "I'm not really a big fan of Serpentine - it always reminds me of Mountain Dew - but I suppose you could do worse.\n\nThe mark and the type don't look like they're one coherent unit. They're spaced too far apart from each other in all of these examples.\n\nWhat are these logos for? I assume this was designed just for fun as \"connect.com\" and \"direct.com\" are already taken.\n\n- Lex\n\n"
    },
    {
      "time": "4 Aug 2008 — 11:54am",
      "content": "The sentiment behind the concept is very dated and the solution looks obvious - by that i mean I have no confidence that you've put much thought into it. Try and get some good ideas on paper before hitting photoshop.\n\n"
    },
    {
      "time": "4 Aug 2008 — 11:19pm",
      "content": "Better yet. Try and get some good ideas on paper before hitting Illustrator.\n\n"
    },
    {
      "time": "5 Aug 2008 — 12:09am",
      "content": "I see Mountain Dew meets Tinker Toys from the seventies.\n\nI agree with clashmore, you'd benefit by starting on paper then using Illustrator. This screenshot is actually Photoshop, but I assume that's not what you used to create the logo, right?\n\n"
    },
    {
      "time": "5 Aug 2008 — 5:46am",
      "content": "Ok, first, I thought, after 24 hours, to get some 'constructive' critisism. Things like ' I really don't like Serpentine' don't help me - 'Mountain Dew'??? Sorry, doesn't say anything to me, maybe because I am on the other side. Why is Serpentine not right (I think it is a nice 'speedy' font) and which one would be more appropriate??  \n'They’re spaced too far apart from each other in all of these examples' - that is something to work with. I will change this, but closing in leaves me no choice than to lift the text and get it a little bit between the 'balls', which make it uneven somehow.  \n'The sentiment behind the concept is very dated and the solution looks obvious - by that i mean I have no confidence that you’ve put much thought into it' - yes, I did research, but it is difficult to come with something brandnew in this segment.  \nI did the basics in Freehand as it is for me very difficult to sketch on paper. The ideas are in my head. but I can them realise better with a program than with 'bare' hand. My Freehand docs looks like sketches, so... :)  \nAny other suggestions??\n\nThanks.\n\n"
    },
    {
      "time": "5 Aug 2008 — 6:55am",
      "content": "When you ask for someones opion, you can expect their opinion.  \nSometimes some-ones personal opinion triggers some-one else his.  \nI wouldn't worry about this.\n\nSince you are working on a logo I would loose the shadows.  \nRemember that things have to be printed, placed on websites, cars, stationary ...  \noften  \nShadows are a pain then. Beside that, they often don't add anything. It often brings an amateuristic feel with it. It is often a way of adding something interesting.\n\nWhat is your reason of putting it there?\n\nAnd, what is your reason to choose for yellow?\n\nI would try and look for an other font. Personaly I do like serpentine, but I hardly ever use it because it feels outdated. It has become a bit cheapy. Exception are outthere.\n\nThis together with the logo in front of it, it is not a memorable logo.\n\nYou say you have difficulty in sketching on paper. Often this does open new doors.  \nResearch, look what is out there and not te be missed: what kind of company is it? Translate that into a logo and I think the one you have now doesn't suit anymore.\n\nHope this helps.\n\n"
    },
    {
      "time": "5 Aug 2008 — 7:42am",
      "content": "\"Any other suggestions??\"\n\nGive us some context.\n\n"
    },
    {
      "time": "5 Aug 2008 — 8:12am",
      "content": "2 points 4 your consideration:  \n1. Make the letters of Connect Connect in this way:  \n [http://typophile.com/node/48101](http://web.archive.org/web/20131023141215/http:/typophile.com/node/48101 \"http://typophile.com/node/48101\")  \n2. Make the arrows demonstrate convergence instead of divergence.  \nHappy Connecting with Flowers\n\n"
    },
    {
      "time": "5 Aug 2008 — 8:37am",
      "content": "What does the company do? It's bizarre to even solicit people's opinions without giving them any context – even more bizarre since connect.com and direct.com are both unavailable.\n\nRoss\n\n"
    },
    {
      "time": "5 Aug 2008 — 9:38pm",
      "content": ":)) That's more like what I expected.\n\nTo Bobby:  \nAbout the font: ok, I am a little bit short at fonts, and there is no way I purchase them for 150$ or more just for demonstration. So, I have to go with what I have. Sure, I like fonts like Futura, Helvetica, Frutiger, Garamond, and so on, but most of the times my clientel doesn't like them as they are too 'simple' (that's what customer say - I prefer 'timeless'). So they want something out of the row. Maybe you have some suggestions for fonts I could use or would be more appropiate.  \nAbout the shadow, yes, I know, but that's why there is a b/w version at the bottom.  \nOrange, I think is still a color which attract attention without alarming.  \nTo Aziz:  \nAbout connecting the font. yes, I thought of this, but isn't it too much. And there is the problem with direct.com, that it doesn't make sense there to connect the fonts. But both logos should look as a unit.  \nIf I let lead the arrows to the circle, it wouldn't have the same impression like the 'connect' version and so the unity goes.  \nto Ross:  \nThe company is in the hotel-booking and travel business (and no, there shouldn't be any hotel or house icons in the logo). There will be an addition in the front, like 'Bali-connect.com' or 'Bali-direct.com' (just as an example). The icon will then finally move to the other side.  \nThanks for all your comments.\n\n"
    },
    {
      "time": "5 Aug 2008 — 10:28pm",
      "content": "Have a look at dafont.com  \nSome of them are for free, some are available for a small fee (the last time I looked).\n\nGood luck.\n\n"
    },
    {
      "time": "6 Aug 2008 — 12:17am",
      "content": "Sounds like your client would be better off devising a single cohesive, marketable brand, rather than registering and trademarking several million nation-prefixed domains. That would make your task much easier, and they could then use subdomains to cater to every conceivable destination without diluting that brand.\n\nbali.nongenerictravelbusinessname.com  \nfiji.nongenerictravelbusinessname.com  \nchina.nongenerictravelbusinessname.com  \netc.\n\nUnless, that is, their SEO strategy is to build a massive link farm to attack Google with... :/\n\nAside from that, I wouldn't really associate the words \"direct\" or \"connect\" with hotels. One makes me think of flights, the other of telecommunications. Also, how is it \"direct\" when the business is acting as a middleman between me and my destination hotel?\n\nI suppose none of this will help you with your design, but if the concept is flawed, I don't really see font and color choices mattering that much.\n\n"
    },
    {
      "time": "6 Aug 2008 — 12:58am",
      "content": "bobby: that was a big help - lots of fonts to choose from. thanks.  \narcturus: that is right. maybe I should have a serious talk with them, as I am a little bit lost in this issue. thanks again.\n\n"
    },
    {
      "time": "6 Aug 2008 — 2:45am",
      "content": "I think Arcturus hit it right on the nose. Or at least what I was thinking. I thought the logos had to be for something like telecommunications, or SOMETHING electronical. You said hotel, and nothing clicked. Hotels are suppose to be homey like, right? This is too rigid, too technological. Anywho, as for the current logo, That symbol is so over used. I swear I've seen it in at least 3 logos. Rather well known logos too. So this one will get lost.\n\nBut yea, those are my two sense for now, I don't want to critique the current logo too much, cause I'm hoping to see something different after you talk to your client.\n\ncourtney\n\n"
    },
    {
      "time": "6 Aug 2008 — 4:18am",
      "content": "I agree with Arcturus with regard to the concept.\n\nAs regard typefaces, maybe this can help:  \n [http://www.smashingmagazine.com/2007/11/08/40-excellent-freefonts-for-pr...](http://web.archive.org/web/20131023141215/http:/www.smashingmagazine.com/2007/11/08/40-excellent-freefonts-for-professional-design/ \"http://www.smashingmagazine.com/2007/11/08/40-excellent-freefonts-for-professional-design/\")\n\nBest of luck,  \nRoss\n\n"
    },
    {
      "time": "6 Aug 2008 — 7:07am",
      "content": "Sorry, have not read ALL comments but on first appearance, have you tried printing this out and photocopying it?  \nI know this may well be for online only but if this logo has longevity and, for example, they sponsor an event in years to come and the logo is printed – yellow is not photo-reflective.\n\nSomething you may want to consider\n\n"
    }
  ]
}
