{
  "id": "48080",
  "title": "Logo For a Photographer, WIP",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello all, I just discovered this forum and this is my first post.\n\nI’m redesigning a photographer’s website/logo/identity, and having a hard go of it. The problem is that I need to incorporate the words “Crystal Genes Photography” into the logo. Here’s where I’m at:\n\n ![](http://web.archive.org/web/20081025043116im_/http:/typophile.com/files/trythree_3571.png)\n Sorry that it’s not more polished. The original plan was to have the word “Photography” under her name, and in a separate font. Now I’m toying with the idea having all the text horizontal, so what you see is the very definition of “work in progress”.\n\nI really need suggestions of how to get the word “Photography” into this design, and would be very grateful for any input. Thanks!\n\n- ben\n\n [‹ Rosetown Logo Critique](http://web.archive.org/web/20081025043116/http:/typophile.com/node/48368 \"Go to previous forum topic\") [Self Promo Logo ›](http://web.archive.org/web/20081025043116/http:/typophile.com/node/47763 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025043116/http://typophile.com/user/34856\" title=\"View user profile.\">talkingwires</a>",
  "time": "<br>",
  "uid": "34856",
  "comments": [
    {
      "time": " 4.Aug.2008 7.21pm",
      "content": "Judging by the logo, I’d think she was a painter. I can tell you that I don’t really like the “G” in “Genes”, nor do I like the italic / all caps fonts you have chosen for “photography”. I’ll leave it to an expert, however, to suggest a more appropriate alternative font.\n\n"
    },
    {
      "time": " 5.Aug.2008 3.10am",
      "content": "I second pennANDink (nice logo, pennANDink).\n\nBeside that, there happens some much. I can’t figure out where to start.\n\nPerhaps you should clean up your type. You have a few very nice forms, but you take away the attention tru your type. That’s a shame. This is beside the point of I think it is apainter or not.\n\nFurther, it is very dark.\n\nCan you tell more about this photographer?  \nIn what line of photography is she/he in?  \nThat determains a lot.\n\nBeside the fact that I like the flowers as form, why do you use them? What is the purpose?\n\nHope this helps.\n\n"
    },
    {
      "time": " 6.Aug.2008 3.02am",
      "content": "Well, you can see her work [here](http://web.archive.org/web/20081025043116/http:/www.crystalgenes.net/). I guess I should mention that she’s my girlfriend, and we do wedding photography. She’s the brains of the outfit; I’m just the assistant and am also rebuilding her web site.\n\nYou’re both right; the font is a little over-worked, especially the “G”, but I didn’t create it. I guess as I get closer to a final design, I’ll convert it to SVG and trim off some the excess fluff. And though I do like the unique, whimsical nature it creates, readability is a real issue with it.\n\nNobody has any suggestions on what to do with the word “Photography”?\n\n"
    },
    {
      "time": " 6.Aug.2008 3.30am",
      "content": "Photography stands alone.  \nIt is not coherent.\n\n"
    },
    {
      "time": " 12.Aug.2008 2.18pm",
      "content": "To begin I would also like to compliment Penn&Ink on your logo\n\nI don’t know it seems that there is so much going on on the left side that by the time my eye works it’s way to the name it’s exhausted. Wedding Photography is all about simplicity and capturing the moment. If it’s strictly wedding photography i’d suggest trying to marry the CG (no pun intended) and try to do a word mark.\n\nSo in my opinion scale back on the vector imagery and focus on the name. If what you have posting is the direction you’re going in, maybe the photography can be underneth nestled (but not to close) to the decender of the y in Crystal.\n\nKeep us updated\n\n"
    }
  ]
}
