{
  "id": "48094",
  "title": "typeface for fashion magazine logo",
  "forum": "Design",
  "tags": [

  ],
  "content": "Dear all,  \nI want to welcome you warmly from a small amazing country - Moldova, where i currently work and live.\n\nIn the last 2 months i've been working on a concept for a fashion, beauty and lifestyle magazine (size: 230mmx290mm) for women and in the last days i came back to the issue of typeface for logo.  \nCheck the attached image and tell me what word do you read? Are there some letters that you hardly understand? Some people say the typeface i used (bodoni poster) is too bold for a magazine for women but i tried to stand out and do smth different from magazines like vogue, elle, l'officiel, bazaar, plus you can see that the magazine name is way long and strange :) that pushes me to search for a good readable typeface.  \nAny other suggestions of typefaces?  \nWhat typefaces you think about when i say women, fashion, beauty, lifestyle?\n\nnamy thanks,  \nDumitru\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.png](http://web.archive.org/web/20120226072034/http:/typophile.com/files/Picture%201_153.png) | 12.77 KB |\n\n",
  "author": "<a href=\"/web/20120226072034/http://typophile.com/user/34873\" title=\"View user profile.\">dumitru</a>",
  "time": "<br>",
  "uid": "34873",
  "comments": [
    {
      "time": "",
      "content": "Why always Bodoni if it is for fashion? Try something [contemporary](http://web.archive.org/web/20120226072034/http:/www.linotype.com/de/183977/agilita-schriftfamilie.html)!\n\n"
    },
    {
      "time": "",
      "content": "I like the feel, but I'm curious about the concept behind it.  \nCan you tell something about that?\n\n"
    },
    {
      "time": "",
      "content": "If you are going to keep that approach, I suggest you make it much more contrasty. Thin down those thin strokes till it hurts!\n\nJamesM\n\n"
    },
    {
      "time": "",
      "content": "I could imagine that this was a packaging from a household supply store in the early 1960s, where grandmum bought some quite expensive tableware. No direct connection to a cliche fashion mag, right now. Is that what you want?\n\nPS  \nI read \"Stiluette\" and i understand it as a combination of \"Stil\" (style) and \"Siluette\" (silhouette)\n\n"
    },
    {
      "time": "",
      "content": "This might be pushing the boat out a bit here but [Wyld](http://web.archive.org/web/20120226072034/http:/subtype.org/wyld/) by Subtype is a stunning contemporary face, clearly designed with fashion magazines in mind. Definitely worth a look I think even if it's legibility isn't great.\n\nOtherwise you could try a different tack altogether. [Affair](http://web.archive.org/web/20120226072034/http:/www.sudtipos.com/fonts/2) by Alejandro Paul has a very feminine feel and with it's huge set of ligatures I'm sure you could create something very exiting indeed.\n\n ![](http://web.archive.org/web/20120226072034im_/http:/typophile.com/files/rubydemure_5633.jpg)\n<dt>Here it is put to great use on a business card by <a class=\"freelinking external\" href=\"http://web.archive.org/web/20120226072034/http:/www.conoranddavid.com/\" rel=\"nofollow\">Conor &amp; David</a>.</dt>\n"
    },
    {
      "time": "",
      "content": "My initial intuition tagged it for the early '70s.  \nI am fond of the typeface, however.\n\nWhat really matters is a) who the audience is and b) what you're trying to convey to them. Define that, and you'll narrow your search down for an appropriate typeface.\n\n"
    },
    {
      "time": "",
      "content": "@J Weltin  \nAgree, but Agilita is good for inside pages, now for a magazine title.\n\n@bobbybobo  \nWhat i am doing now it supposed to be a redesign of the magazine. Attached is the previous logo, that is more about silhouette, and less about style. They asked for smth more readable, bold and stylish.\n\n@terminaldesign  \nThin down those thin strokes till it hurts! What do you mean?\n\n@poms  \n:)  \nI guess you took the whole image I attached as a design. I tried to show there just the type of the logo and how it looks on the shape of the cover, because as you see the margins of the logo are cut by the margins of the cover.  \nPS. Indeed, it is about style and silhouette :)\n\n@naoiseo  \nWyld looks great, and could be a gooood contrast with the bold magazine title.  \nSure i will try to use Affair in the concept, i just bought it :)\n\n@Fell  \na) Women, 20-40 years interested in fashion, beauty, lifestyle.  \nb) trying to show them that we have fashion in our country :)\n\n"
    },
    {
      "time": "",
      "content": "Old logo:\n\n ![](http://web.archive.org/web/20120226072034im_/http:/typophile.com/files/oldlogo_5410.png)\n\n"
    },
    {
      "time": "",
      "content": "Another inspiration perhaps, Giorgio by C. Schwartz.  \n [http://christianschwartz.com/giorgio.shtml](http://web.archive.org/web/20120226072034/http:/christianschwartz.com/giorgio.shtml \"http://christianschwartz.com/giorgio.shtml\")  \nOk it's not bold, but has a certain power and charme.\n\nWhat terminaldesign probably meant, put the stroke contrast to an extreme. Make the Thins so \"hairline\" that it hurts, nearly invisible. Tension-filled.\n\n_I guess you took the whole image I attached as a design. I tried to show there just the type of the logo and how it looks on the shape of the cover, because as you see the margins of the logo are cut by the margins of the cover._\n\nYes, i thought something like that, but couldn't resist to tell my first impression … :)\n\n"
    },
    {
      "time": "",
      "content": "Thanks poms, thanks everybody\n\n"
    },
    {
      "time": "",
      "content": "there is a cover sample bellow.  \ni had in mind to use Helvetica Neue for this magazine and have a look how it works with magazine title and Affair font.\n\n ![](http://web.archive.org/web/20120226072034im_/http:/typophile.com/files/cover_3421.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Nice touch, but to be honoust … I don't see what is different between this and already existing magazines. But again. Nice job.\n\n"
    },
    {
      "time": "",
      "content": "What I mean is that the thin strokes of the letterforms should be made thinner than they are now. Increase the contrast by making all of those thin strokes thinner. I don't know how to say it any clearer.\n\n"
    },
    {
      "time": "",
      "content": "hm, i can't go thinner with Helvetica Neue, that's the thinnest they have (Ultra Light).  \nAnyway, thanks a lot, i will show you more when it's done.  \nbest,  \nDumitru\n\n"
    },
    {
      "time": "",
      "content": "<cite>I don’t know how to say it any clearer.<cite></cite></cite>\n\nNot easy, but I'll try make it clearer :-)\n\nDumitru, James is trying to tell you to increase the contrast in Stiluette. Contrast is about the difference between thin and bold parts of a character, not the weight of the typeface (so Helvetica Ultra Light has naearly no contrast and modern typefaces as Didot, Bodoni has it plenty). See images below. BTW I quite like your cover sample.\n\nbefore:\n\n ![](http://web.archive.org/web/20120226072034im_/http:/typophile.com/files/before_4076.jpg)\n\nafter:\n\n ![](http://web.archive.org/web/20120226072034im_/http:/typophile.com/files/after_5315.jpg)\n\nBest,  \nA.\n\n"
    },
    {
      "time": "",
      "content": "I learned something new here too.  \n;-)\n\n"
    },
    {
      "time": "",
      "content": "Bodoni Poster italic shows something which is to prissy, to nice in my opinion. And maybe i've seen it too often …\n\n"
    },
    {
      "time": "",
      "content": "@Urquell  \nthanks, i got it now :)\n\n ![](http://web.archive.org/web/20120226072034im_/http:/typophile.com/files/cover_stroke_4167.jpg)\n\n"
    },
    {
      "time": "",
      "content": "The gold really seals it Dumitru. I assume this will be printed in a gold pantone? Affair looks great. Looking at it now my earlier suggestion of Wyld wouldnt suit at all. Nice work!\n\n"
    },
    {
      "time": "",
      "content": "Nice job indeed!\n\n"
    },
    {
      "time": "",
      "content": "thanks to all, couldn't make it without your help\n\n"
    },
    {
      "time": "",
      "content": "Hi Dumitru,\n\nI appreciate the classic look, records Valentino’s work.  \nIn general I find the title very nice, even it is very classic and not that new (doesn’t hurt in my eyes that it is so).  \nBut would be better if you would find another solution for the „first number“ button.  \nMakes the whole title look cheap somehow in my opinion.  \nSeocnd I did like the Helvetica in black more. More elegant and classy.  \nThinner hairlines in the title: Much better!  \nDid you try Didot faces instead of Bodoni?\n\nsalute  \nStefan\n\nDon’t forget to abolish this button!! ;-)\n\n"
    },
    {
      "time": "",
      "content": "@Stefan Seifert\n\nI tried Didot and my conclusion was that Didot is not for this long title - Stiluette.  \nThanks for remarks about the button :)\n\nD.\n\n"
    },
    {
      "time": "",
      "content": "@ dumitru\n\nThe strokes of the modified letters of your logo become thinner and thinner now, while Urquell sets the point, from which the strokes become thin earlier and then the stroke width does not change anymore. Thin it down, till it hurts, may be a bit overdone, but calligraphically it was better in Urquell’s example. I miss the correct terms, but I hope it is clear enough, what I mean.\n\n"
    },
    {
      "time": "",
      "content": "With everything so tight, the counters in the \"e\"s become too open.  \nI would recommend narrowing both the top counter, and also the width of the right stroke, and possibly opening the i\\_l\\_u letterspace by a small amount (or, alternatively, increasing the space inside the \"u\"), for a better overall colour/tone.\n\nYou see, the relative stroke widths and negative space within \"u\" and \"e\" are designed for text setting small, with normal tracking. They are designed to be different from one another, so that text matter doesn't become too grey. However, in an ultra-tight display setting, these differences become a liability, nbot an asset.\n\nBy the way, is there some other way to deal with the Abreve accent, for settings with negative leading?\n\n"
    }
  ]
}
