{
  "id": "48092",
  "title": "(x) Looking for Olivetti lettera 35 Schreibmaschinen-schriften {James Langdon}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I'm looking to track down the typewriter font used by Derek Birdsell in his book 'notes on book design'.  \nHe refers to it as 'Olivetti lettera 35 Schreibmaschinen-schriften' within the text, but I can't seem to find it, or anything similar.\n\nI've attached some pics from the web, but they're not great so apologies for that.  \nAny help will be much appreciated!\n\nT\n\n| Attachment | Size |\n| --- | --- |\n| [13302.jpg](http://web.archive.org/web/20110131195311/http:/typophile.com/files/13302.jpg) | 23.71 KB |\n| [27c9eb6709a0336172bf1110.L.jpg](http://web.archive.org/web/20110131195311/http:/typophile.com/files/27c9eb6709a0336172bf1110.L.jpg) | 27.26 KB |\n\n",
  "author": "<a href=\"/web/20110131195311/http://typophile.com/user/34871\" title=\"View user profile.\">terrys5844</a>",
  "time": "<br>",
  "uid": "34871",
  "comments": [
    {
      "time": "",
      "content": "Images are too small. You can take a look at [lekton](http://web.archive.org/web/20110131195311/http:/lekton.blog.isiaurbino.it/) an olivetti typewriter inspired ‘open source’ font\n\n"
    },
    {
      "time": "",
      "content": "I don't know if this is what you're looking for as I can't see the type in the images, but from the name it might be:\n\n[http://www.myfonts.com/search?search%5Btext%5D=schreibmaschineregular](http://web.archive.org/web/20110131195311/http:/www.myfonts.com/search?search%5Btext%5D=schreibmaschineregular \"http://www.myfonts.com/search?search%5Btext%5D=schreibmaschineregular\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks guys, it's much appreciated.  \nThe Lekton face is very interesting, certainly going to keep that in mind for future projects.  \nSchreibmaschine Regular is the exact font I was looking for, thanks James you're a star.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "This is just great. Somebody posts pictures where you can't make out a damn thing, then somebody else identifies the exact font by name.\n\nJust a few things to consider:\n\n- \"Schreibmaschinen-Schriften\" is just German for \"typewriter faces\", thus hardly a distinguishing name.\n- Contrary to popular belief, most typewriter faces weren't specific to certain typewriter models. You could have different fonts on one model, just like today on your computer, only the changing of the font was a bit more difficult (it would have included soldering, so you chose one font when purchasing the machine and then were basically stuck with it). As far as I know though, Olivetti _did_ have some exclusive typefaces on some of their machines.\n- The Linotype \"Schreibmaschine Regular\" cannot possibly be the face in question, because Linotype produced composing machines, not typewriters. At best they would have some makebelieve typewriter faces on their machines to mimick a hand-typed letter.\n- Linotype's \"Schreibmaschine Regular\" probably came to their Library via Berthold's \"Schreibmaschinenschrift BQ\" which looks identical. Berthold also didn't produce typewriters, so go figure if it's a real typewriter face ...\n\nWhy do I bother at all? When it comes to typewriter faces, I just can't help it ... now does anybody have a _recognizable_ picture of the typeface in question ... you really got me interested ;)\n\nCheers  \nJens\n\n"
    },
    {
      "time": "",
      "content": "Terry, excuse me for asking this but you really got me intrigued. How on earth did you expect anyone to identify this typeface from those pictures? I mean, there is _no way_ you can make out even a single character.\n\n ![](http://web.archive.org/web/20110131195311im_/http:/typophile.com/files/27c9eb6709a0336172bf1110_6111.L.jpg)\n\n"
    }
  ]
}
