{
  "id": "48109",
  "title": "Shall we hyphenate?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My fiance and I are doing something that I think is pretty cool: He’s Beeson and I’m Durango, and after we’re married in October, we’ll \\*both\\* be Durango-Beeson.\n\nAnd that’s where I bring a question to the typophiles.\n\nPersonally, I have something against the hyphen. Not always. And often, I love what it can do. But in this context I really just \\*don’t\\* like it.\n\nIt’s been pointed out to us, though, that not hyphenating our name might confuse some people. “Is Durango your middle name?” Would it be ignored altogether?\n\nLindsay Durango Beeson  \nPatrick Durango Beeson\n\nI feel like there’s a simple elegance to it.\n\nBut I’d like to ask you typophiles: is the hyphen interceding where it absolutely must intercede? Or do you think that, in the world today, people could simply come to understand that Durango Beeson is meant as a surname?\n\nMany thanks for your time,  \nLindsay Durango (Beeson!)\n\n [‹ Justification question for InDesign](http://web.archive.org/web/20081122033718/http:/www.typophile.com/node/48116 \"Go to previous forum topic\") [Font for a hotel rebrand. ›](http://web.archive.org/web/20081122033718/http:/www.typophile.com/node/47580 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122033718/http://www.typophile.com/user/18714\" title=\"View user profile.\">lindsaydurango</a>",
  "time": "<br>",
  "uid": "18714",
  "comments": [
    {
      "time": " 5.Aug.2008 10.42am",
      "content": "Oh my ... and by my subject line, I meant “Shall we hyphenate”! Please forgive me. Former copy editor and I still didn’t get it right!\n\n(\\* It’s been fixed)\n\n"
    },
    {
      "time": " 5.Aug.2008 10.50am",
      "content": "I personally wouldn’t process “Durango” as anything other than a kickin’ last name, especially if it were Mrs. **Lindsay** Durango Beeson...\n\n...the true typophile would make it an en–dash, and mandatorily so :þ\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 5.Aug.2008 10.54am",
      "content": "Aha! I didn’t know that was a function of the en-dash! (Still have a lot to learn, mostly about en-dashes.)\n\nIt will be pretty kickin’, huh?\n\n"
    },
    {
      "time": " 5.Aug.2008 11.36am",
      "content": "The en–dash has many uses...mostly it’s for typophiles’ pleasure in scoffing at the ignorant.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 5.Aug.2008 11.50am",
      "content": "\\>“Is Durango your middle name?”\n\nThis would solve that problem ...\n\nLindsay Danger Durango Beeson\n\n"
    },
    {
      "time": " 5.Aug.2008 11.57am",
      "content": "We could definitely go for that, the both of us.\n\nI wonder if the kids will mind when we decide that they, too, will be Danger Durango Beesons ...\n\n"
    },
    {
      "time": " 5.Aug.2008 12.42pm",
      "content": "I have the opposite problem when I’m in Spain, everything thinks my last name is Stephen, most people have three names, one first name and two last names.\n\nI say go without the hyphen, and whenever there’s a situation of doubt, write the name in all caps.\n\nLindsay DURANGO BEESON\n\nA good typophile will of course make that small caps, and a true one will make that real small caps instead of scaled-down caps. ;-) But in all seriousness, I’ve found that works, as it’s generally the accepted practice, especially for those who come from cultures where the last name comes first, e.g., KIM Jong-Il instead of Jong-Il Kim or Kim John-Il to emphasis that Kim is the family name.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 5.Aug.2008 12.56pm",
      "content": "\\>”A good typophile will of course make that small caps, and a true one will make that real small caps instead of scaled-down caps.”\n\nGood plan. Doesn’t look like this site lets you post in small caps...it’d have to use CSS properties, and the style attribute doesn’t seem to be supported.\n\n[Nope, guess not.](http://web.archive.org/)\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 5.Aug.2008 1.19pm",
      "content": "Also sii, the problem with using the middle name is that some people have two first names, at least, it’s quite common here in the South and I think in French/Spanish regions it’s common with the equivalents of John. In the South there’s a lot of folk with two first names, a middle, and a last name.\n\nHere’s an example with my name, lindsay’s, sii’s, and a friend of mine from Spain who has a whopping 5 (!) names and uses them all regularly.\n\n ![](http://web.archive.org/web/20081122033718im_/http:/www.typophile.com/files/surnames_smallcaps_5848.png)\n\nI’m actually a fan of the small cap treatment even if there’s no confusion. It gives a nice prominence to the family name. Of course, I’ve never been told what the practice would be if the person only has one name like in parts of Africa.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 5.Aug.2008 1.23pm",
      "content": "Well obviously, if there’s only one name it all gets small-capped. Or all-capped. Or something.\n\nI love how lindsay’s just gotten a de facto medial moniker, “Danger.”\n\nWhy haven’t I ever thought of that?\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 5.Aug.2008 1.57pm",
      "content": "Whew...touchy subject. Perhaps you’ve thought this through, but, supposing you have children some day, will they, too, be Durango Beesons? And what happens when they marry someone with a hyphenated surname?\n\nMy wife and I went through this same thing when we married 10 years ago. She didn’t want to change her name for \\*professional\\* reasons...that and she liked her name as it was. I didn’t want \\*one of those hyphenated names.\\* I changed my “stage name” to Michael Hoffmann Koppa, no hyphen...sorry, en dash...in an attempt to persuade her to do the same. She never did, and in day-to-day life I remained Mike Koppa. We had a child. Katrina’s (our daughter) last name became Koppa. Vicki changed her name to Koppa. I dropped the Hoffmann bit. We’re all just Koppas now...boring traditionalists. But it works. It’s over.\n\nWhatever you do, consider the future implications of a complex last name. How many times do yo want to explain it? We found it wasn’t worth the hassle, hyphen or no hyphen. Or en dash.\n\n"
    },
    {
      "time": " 5.Aug.2008 2.02pm",
      "content": "You could do a symbol and be the couple formerly known as Durango-Beeson.\n\n"
    },
    {
      "time": " 5.Aug.2008 2.44pm",
      "content": "\\>”You could do a symbol and be the couple formerly known as Durango-Beeson.”\n\nYeah, or you could get really creative: [http://www.xkcd.com/327](http://web.archive.org/web/20081122033718/http:/www.xkcd.com/327 \"http://www.xkcd.com/327\")\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 5.Aug.2008 2.45pm",
      "content": "[double–post]\n\n"
    },
    {
      "time": " 5.Aug.2008 4.43pm",
      "content": "You could eliminate the space and capitalize it like a software brand: DurangoBeeson.\n\n"
    },
    {
      "time": " 5.Aug.2008 5.48pm",
      "content": "I love the small caps solution. It’s handsome and functional (as opposed to the hyphen, which I find functional, yet ... hangy-on-y).\n\nAnd @Koppa ...\n\nI appreciate your insights, and though it is a personal decision, I obviously don’t mind going into detail (considering the forum!). Patrick and I would pass our double name onto our children, who would of course reach an age (or a marriage or other union) for which they may want to alter it (simplify? add on to?).\n\nThe reason for the double name: I quite strongly identify as a Durango, but I want our family to have a singular identity, and Patrick is more than happy (I think he’s actually quite excited) to take on my name as well.\n\nIt will make for a tongue-twister/mind-bender, but we aren’t used to doing things the easy way. ... He proposed on top of a mountain, at the beginning of a “spontaneous” weekend trip to North Carolina during which he managed to lead me to suggest visiting the very mountaintop on which he had already planned to propose.\n\nWe’re complex, complex people. ;)\n\n"
    },
    {
      "time": " 5.Aug.2008 5.51pm",
      "content": "@jt\\_the\\_ninja\n\nHILAROIUS!\n\nPatrick’s a django kid; I love spreadsheets. We may be able to embed some vicious code in those little Durango Beesons.\n\n"
    },
    {
      "time": " 5.Aug.2008 5.53pm",
      "content": "@cerulean\n\nHow do you feel about durang08ee50n?\n\n"
    },
    {
      "time": " 5.Aug.2008 10.56pm",
      "content": "Because typographic control is the exception not the rule, I find it handy to follow cultural convention. With that control, personally I think the small caps option Matthew suggests sounds great. But. There’s no ’small caps please’ box to check alongside one’s last name on a driver’s license application. Small caps don’t translate well into handwritten text. Hyphens are nearly inaudible when spoken. There are no small caps in braille, text messages, credit card receipts, &c..  \nThe confusion is going to happen; not because of the way the information is arranged, but because of the information itself. That’s the problem. You’ve come searching a cure to its symptoms.  \nThis goes without mention of the beautiful symbolism of a bride taking upon herself a new name.\n\n"
    },
    {
      "time": " 6.Aug.2008 12.00am",
      "content": "I would suppose the kids would keep both names and then each could pass on one name when they’re kids (maybe a daughter would pass on lindsay’s family’s name, and her son would pass on her husband’s, or something). That, at least, is close the Iberian tradition, where the patrolineal name is passed down, but the husband’s name is his dad’s first-last name (his grandpa’s contributed name) and his mom’s first-last name. The wife then has several options, she can be her dad’s last name + of + her husbands last name, or her husband’s last name + her dad’s last name. And in Spanish society today, the order and the patro/matralineality of the names is optional and freely changeable and either name can be passed down as per parent’s preference, with the child able to reorder it once they turn 18 if they so choose. Spaniards do father’s name then mother’s name, and the Portuguese do the reverse. A little odd I suppose for us Americans, but these days with so many people taking double last names it’s not a bad model to follow (both of theirs can actually be extended as long as you want, though officially you can only use two first names and two names in each of the two last names, eg, your four grandparent’s families’ names is the max in an official name).\n\nEither way, the union of the names is only a superficial reference to a far deeper and more important union, so I think whatever you go with, will ultimately work out for y’all. You could always just write down all the options and pick it out of a hat :)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 6.Aug.2008 1.42am",
      "content": "A name pattern for your kids:\n\nLindsayPatrick-I MyMothersSurnameIsDurangoAndMyFathersIsBeesonAndLongNamesAreNoble!  \nPatrickLindsay-I MyMothersSurnameIsDurangoAndMyFathersIsBeesonAndLongNamesAreNoble!  \nLindsayPatrick-II MyMothersSurnameIsDurangoAndMyFathersIsBeesonAndLongNamesAreNoble!  \nPatrickLindsay-II MyMothersSurnameIsDurangoAndMyFathersIsBeesonAndLongNamesAreNoble!  \n...  \n..  \n.\n\n"
    },
    {
      "time": " 6.Aug.2008 4.31am",
      "content": "The deeper union really is the point. And truly, I’m ready to be Lindsay Beeson if Patrick and I continue this conversation and decide that it’s just too complicated for us or our future kids to be Durango Beesons. (He, so far, has insisted on Durango Beeson.)\n\n@David: I take your point about the control being out of our hands most of the time. I’ve already got this script rehearsed for phone conversations: “My first name is Lindsay. I have two last names, without a hyphen. The first name is Durango. D U R A N G O. The second name is Beeson. B for boy, E E S O N.”\n\nAnd @guifa (Matthew?): As an interesting aside, my Dad is from Colombia, South America, where the Spanish convention also made its way into the culture. When I was a kid, my dad would joke that my name was “Lindsay Nicole Durango Velasquez Cadavid Machado Spain.” (Funny aside-aside: My mom’s maiden name is Spain.) I wonder if my affection for this double name isn’t that it works a version of my dad’s traditions into our new family.\n\n"
    },
    {
      "time": " 6.Aug.2008 5.00am",
      "content": "Wow...yeah, I pretty much prefer the KISS method of naming....unless you go to a country like Russia, where people might think your dad’s name was Durango or something, you should be fine, Lindsay Danger. It might be a more justified worry if your last name were also a common first name, like May or Thomas, but Durango, unless you’re really Old-West-ten-gallon-hat-six-shooter-packin-cattle-rustlin’-train-robbin’-yee-haw-you get the picture, processes as a last name.\n\n:D\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 6.Aug.2008 7.54am",
      "content": "Have \\*we\\* considered dropping BOTH Durango and Beeson and simply going with Danger? Or maybe Lindsay and Patrick Dangerous?\n\nOr maybe a merger...Beerango, perhaps.\n\nMost importantly, congratulations! A marriage is an amazing and beautiful thing!\n\n"
    },
    {
      "time": " 6.Aug.2008 8.01am",
      "content": "Danger twins’ powers activate!\n\n"
    },
    {
      "time": " 6.Aug.2008 12.31pm",
      "content": "Here here! Congratulations Lindsay!\n\n"
    },
    {
      "time": " 6.Aug.2008 1.18pm",
      "content": "I may have playfully suggested Beengo a long, long time ago. It will have to be saved up for some amazing joint venture we do (one other than our marriage).\n\nLindsay and Patrick Dangerous, though. Wow. People would certainly know what they’re in for ...\n\nAnd thank you for the congratulations! I am quite excited about the marriage (the wedding, on the other hand, has only recently become a small and adorable enough affair for me to be truly excited about. You could call me the anti-Bridezilla. Bridemothra?)\n\nAs an aside, you guys are pretty awesome for humoring my very personal question regarding hyphens. I feel pretty good about us going forward as Durango Beesons. Patrick’s for it, too! So many thanks.\n\n"
    }
  ]
}
