{
  "id": "48104",
  "title": "The Face of San Francisco?",
  "forum": "San Francisco",
  "tags": [
    "San Francisco"
  ],
  "content": "If H&FJ Gotham represents New York, what font is quintessentially San Francisco? Where do you look? Coit Tower? Wells Fargo? Trolleys? Street names stamped into cement?\n\nWhat attempts have been made to capture the face of San Francisco? Perhaps this was Susan Kare's dilemma in designing [San Francisco](http://web.archive.org/web/20150317153253/http:/www.kare.com/MakePortfolioPage.cgi?page=4) that shipped on the early Mac. How else to capture the Mission, Presidio, Downtown, North Beach, the Castro?\n\n",
  "author": "Jared Benson",
  "time": "5 Aug 2008 — 9:14am",
  "uid": "3",
  "comments": [
    {
      "time": "10 Aug 2008 — 1:42am",
      "content": "I'm not aware of one. Unlike New York, San Francisco is not quite as type-heavy a town.\n\nI do commonly associate [W. A. Dwiggins](http://web.archive.org/web/20150317153253/http:/www.fontshop.com/fonts/designer/w_a_dwiggins/ \"W. A. Dwiggins | Designer | FontShop\")' faces Metro and Electra with SF, as they were both used as headline type for the _San Francisco Chronicle_ (albeit with adjustments to the letter forms to suit newsprint).\n\nMore common in usage, though, is SF's history of being erected in the Gold-rush Victorian era, so it naturally gets associated with tuscan (\"western\") type, and all the gaudiness that implies. For instance, the 49ers logo set in [Quentin](http://web.archive.org/web/20150317153253/http:/www.myfonts.com/fonts/ef/quentin/ \" MyFonts\").\n\n"
    },
    {
      "time": "12 Aug 2008 — 12:30am",
      "content": "This is a very good question worthy of further research. While Tuscan decorative types like Quentin certainly reflect an aspect of the city's history, it is far from anything current.\n\nI would have to agree with the call on Metro being a likely candidate, but again I think it only captures a part of the city's story. Perhaps there is some need for a new typeface, an amalgam of the best of San Francisco's signage much like how Gotham was inspired by the city of New York.\n\n"
    },
    {
      "time": "27 Jul 2009 — 11:46pm",
      "content": "[spam post removed by moderator]\n\n"
    },
    {
      "time": "1 Aug 2009 — 1:14pm",
      "content": "Medusa  \nMoscoso  \nHippy Chick  \nKeep on Truckin  \nPantagruel  \nCrazy Harold\n\n"
    },
    {
      "time": "1 Aug 2009 — 2:50pm",
      "content": "<cite>Susan Kare’s dilemma in designing San Francisco</cite>  \nActually, the name was given to an already existing typeface:  \n [http://folklore.org/StoryView.py?project=Macintosh&story=World\\_Class\\_Cit...](http://web.archive.org/web/20150317153253/http:/folklore.org/StoryView.py?project=Macintosh&story=World_Class_Cities.txt \"http://folklore.org/StoryView.py?project=Macintosh&story=World\\_Class\\_Cities.txt\")\n\n"
    }
  ]
}
