{
  "id": "48105",
  "title": "ID these lead types?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi folks, I picked up some foundry type from an old-timer in my area and could use some help identifying them. They were simply listed by drawer (at right in the listing). Any help would be much appreciated... (Larger version of the image below is attached.)\n\n ![](http://web.archive.org/web/20130823074027im_/http:/typophile.com/files/type-ID-small_6277.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [type-ID-large.jpg](http://web.archive.org/web/20130823074027/http:/typophile.com/files/type-ID-large.jpg) | 524.43 KB |\n\n",
  "author": "jason",
  "time": "5 Aug 2008 — 9:36am",
  "uid": "3771",
  "comments": [
    {
      "time": "5 Aug 2008 — 9:56am",
      "content": "The last one, the script looks like Kaufmann.  \n [http://www.linotype.com/de/901/kaufmann-schriftfamilie.html?gclid=CPKw9Z...](http://web.archive.org/web/20130823074027/http:/www.linotype.com/de/901/kaufmann-schriftfamilie.html?gclid=CPKw9ZyV95QCFQJRtAodAnCxXA& \"http://www.linotype.com/de/901/kaufmann-schriftfamilie.html?gclid=CPKw9ZyV95QCFQJRtAodAnCxXA&\")\n\n"
    },
    {
      "time": "5 Aug 2008 — 9:58am",
      "content": "Rarely do I attempt this, but I'm a foundry type guy myself so I'll give it my best shot without referencing anything...\n\nB1 is definitely Onyx.  \nB5 looks like it might be Benton's Cloister (I think it was called Cloister anyway...it was his magnum opus if I recall correctly)...lucky you!  \nC12 (and B6) looks like Extra Condensed News Gothic.  \nAnd the other one in B6 is Kaufman Script.\n\nIs the top one a Garamond Italic?\n\nThe rest I'll leave up to the pros around here!\n\nAnd if you're interested in ATF type, you have to be interested in [Theo Rehak](http://web.archive.org/web/20130823074027/http:/www.daleguild.com/). The Dale Guild site might be of some help.\n\n"
    },
    {
      "time": "5 Aug 2008 — 11:12am",
      "content": "Thanks Thomas & Koppa,\n\nB6 & C12 are definitely [News Gothic Condensed](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/bitstream/news-gothic/condensed/); the lowercase \"g\" is the confirming glyph.\n\nB5: After doing some digging I've come up with a variety of versions of this type in digitized forms, all under the name of Jensen/Jenson Old Style:  \nOne design by [Jordan Davies](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/woodentypefonts/jensen-old-style/) for Wooden Type Fonts;  \nand another by [Freda Sack](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/linotype/jenson-old-style/) for Linotype, but a third provided the best info:\n\n[Phinney Jenson](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/hihretrofonts/phinney-jenson/), released digitally by HiH Retrofonts, seems to most clearly provide details on the provinance of this type in metal:\n\n_In 1890 a leader of the Arts & Crafts movement in England named William Morris founded Kelmscott Press. He was an admirer of Jenson’s Roman and drew his own somewhat darker version called “Golden”, which he used for the hand-printing of limited editions on homemade paper, initiating the revival of fine printing in England._\n\n_Morris' efforts came to the attention of Joseph Warren Phinney, manager of the Dickinson Type Foundry of Boston. Phinney requested permission to issue a commercial version, but Morris was philosophically opposed and flatly refused. So Phinney designed a commercial variation of Golden type and released it in 1893 as Jenson Oldstyle. Phinney Jenson is our version of Phinney’s version of Morris' version of Nicolas Jenson’s Roman._\n\nIt's a clunky / quaint attempt at Jenson, but an interesting curiosity to have in the drawer.\n\n\\*\n\nStill very curious about those smaller fonts (D1, 2, 3, 7, 8, 15; B2 & 9).\n\nKoppa, I do know of Theo & Dale Guild and have fallen hard for their Cloister Light Face; unfortunately I can't afford Theo's minimum order at the moment, but I'm attempting to find a few others to band together to place an order. It's the most beautiful version of the Jenson type that I've ever seen.\n\n"
    },
    {
      "time": "5 Aug 2008 — 11:23am",
      "content": "B5 is my favorite font -- Cloister Old Style.\n\nWe used to use the bold version as a complement to Kennerley Old Style because we only had Kennerley Light and Italic. We had Cloister Old Style Bold and Bold Italic.\n\n"
    },
    {
      "time": "5 Aug 2008 — 11:38am",
      "content": "Update:\n\n[D1/2/3/VII/8](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/efscangraphic/cheltenham-old-style-sb/rom/) appear to be Cheltenham Old Style.\n\nThe roman above B2 looks like [Shipley](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/ephemera/shipley/), digitized by Andrew Leman for E-phemera, which [he identifies](http://web.archive.org/web/20130823074027/http:/www.ahleman.com/fonts/fontindex.html) as a Kennerley by Goudy.\n\nI'm going to work on the italics later, but if anyone has any ideas, please let me know...\n\n"
    },
    {
      "time": "5 Aug 2008 — 1:21pm",
      "content": "B8 uncannily looks like Caslon 540, but is somehow more slanted than the digital version that's available.\n\n"
    },
    {
      "time": "5 Aug 2008 — 1:24pm",
      "content": "Jason, if I were actively printing, I'd really consider going in with you for some of that [Cloister](http://web.archive.org/web/20130823074027/http:/www.daleguild.com/CloisterOS.html).\n\nUnfortunately, my type and my press have been in storage for 4 years now (hardly believable). I do hope to resurrect it in 2009, and for sure by 2010. I have to wait for my daughters to not need a play room anymore. That's when their playroom becomes my playroom. Or, even better, OUR playroom!\n\n"
    },
    {
      "time": "6 Aug 2008 — 11:00am",
      "content": "OK, I think I have them all identified EXCEPT D15, so if anyone can lend some help on this one I'd be very grateful. (And thanks for the assistance thus far.)\n\nKoppa, I'll likely pester you down the road about that Cloister; the Light Face isn't shown on the Dale Guild website, but it's extremely handsome in print. I have someone New York state who is also wanting some, but he and I want different sizes (I'm after the 14 & 16pt, and he's after 18); the type is quite small on the body, so 16 seems ideal to me for poetry (which is primarily what I print).\n\nAnyway, back to this thread's topic. Here is the list of final IDs, and a close up of D15 for further study:\n\nB1: 72pt [Onyx](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/bitstream/onyx/) & 12pt [Shipley/Kennerley](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/ephemera/shipley/)  \nB2: 12pt [Century Expanded Italic](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/bitstream/century-expanded/italic/)  \nB5: 24pt [Phinney Jenson](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/hihretrofonts/phinney-jenson/)  \nB6: 18pt [News Gothic Condensed](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/bitstream/news-gothic/condensed/) & 14pt [Kaufmann Script](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/bitstream/kaufmann/)  \nB8: 36pt [Founders Caslon 30 Italic](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/itc/founders-caslon/fcaslon-thirty-italic/)  \nB9: 12pt [Kennerley OSBQ Italic](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/berthold/kennerley-bq/italic/)  \nC12: 36pt News Gothic Condensed  \nD1: 8pt [Cheltenham Old Style](http://web.archive.org/web/20130823074027/http:/www.myfonts.com/fonts/efscangraphic/cheltenham-old-style-sb/rom/)  \nD2: 8pt Cheltenham Old Style Bold  \nD3: 12pt Cheltenham Old Style (lc)  \nDVII: 12pt Cheltenham Old Style (caps)  \nD8: 10pt Cheltenham Old Style\n\nD15: ????\n\n ![](http://web.archive.org/web/20130823074027im_/http:/typophile.com/files/D15_5514.jpg)\n\n"
    },
    {
      "time": "8 Aug 2008 — 9:08am",
      "content": "Please do contact me when you are serious about the acquisition of the Cloister.\n\nThanks.\n\n"
    },
    {
      "time": "8 Aug 2008 — 11:48am",
      "content": "I think D15 looks like a Caslon Oldstyle or especially Linotype's Caslon Old Face, which has a very similar swash N (however, now that I look at it the italic K is not the same as your sample -- your sample's K is quite odd looking, with a very low join for the upper arm and stem. The l.c. italic k is also odd). In Mac McGrew's book of American Metal Typefaces this seemed about the closest I found, but the more letters I look at, the more doubt I have that I am seeing anything that matches enough of the letters.\n\nThe problem with Caslons is that they were probably one of the most common typefaces, and every foundry had multiple versions. There are no marks that help identify the foundry?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "8 Aug 2008 — 12:00pm",
      "content": "Is it possible that the swash initials are from a different typeface? The rest of the italic letters look more like Elzevir, which we have talked about several times in recent months.\n\n- Mike Yanega\n\n"
    }
  ]
}
