{
  "id": "48115",
  "title": "Wordmark for rapid software application development",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "The software — rapid application development, or RAD — was originally called WebRADE (RADE = rapid application development environment). Shortened it down, and focused on its speed at developing apps and its robustness.\n\nIt's for quickly developing apps that can access a variety of databases and is easy for non-programmers to use. It's also tied in to Autodesk MapGuide, allowing for use of map and GIS info to provide particularly robust applications.\n\nI wanted to capture the three dimensions, speed, and effectiveness. I also wanted to avoid anything too complex so it can represent the company in light of Oracle, Autodesk, et al.\n\nAny comments?  \n.\n\n ![](http://web.archive.org/web/20131019185132im_/http:/typophile.com/files/RADE_Logo_3444.jpg)\n\n",
  "author": "Fell",
  "time": "5 Aug 2008 — 12:37pm",
  "uid": "34892",
  "comments": [
    {
      "time": "5 Aug 2008 — 9:50pm",
      "content": "I like the concept & type. Not sure about the current perspective, it seems to fall backwards, thus contradicting the idea of stability /reliability.\n\n"
    },
    {
      "time": "5 Aug 2008 — 10:38pm",
      "content": "It has something of a movie poster. Especially the 'R'. Not sure if that reflects the IT environment. That is what I miss. Seeing this, I don't see something of IT. It could – like I said – be a title for a movie, or a book. But software? No.  \n;-)\n\nI do like the treatment\\> Type becomes interesting very quickly this way. But that shouldn't be a goal in itself.  \nIf you could add something IT it would benefit from that.\n\n@all about seb: couldn't one read this as a wide field (it has to fall a bit more backwards). Possibilities? Base?\n\nHope this helps\n\nWhat about colors?\n\n"
    },
    {
      "time": "5 Aug 2008 — 11:06pm",
      "content": "I kept the horizon equal to eye-level to maintain depth, three dimensions. Keeping with the idea that in photography/cinematography, when the subject is above, it diminishes viewer's posture. When the viewer's perspective is from above, it empowers the viewer. This offers a bit of depth towards-beneath the viewer. Which hopefully adds a bit to the idea of the GIS/CAD capabilities of the software.\n\nIt's geospatial features is part of what differentiates it from its competition.\n\nGetting away from the stereotypical IT elements, I want to convey a bit more dynamism. It's not being marketed to IT departments per se, but to departments, execs, and persons with very basic database knowledge. Because it is a \"rapid application development\" environment, the point is that almost anyone can easy prototype and create solutions instead of relying on software developers and consultants.\n\nOr so I am shooting for… =]\n\nAs for colour, we'll be working with a green hue. This is a strategic decision in light of competition primarily using reds.\n\nI appreciate the feedback so far, though. Thanks! Keep offering insight!\n\n"
    },
    {
      "time": "6 Aug 2008 — 11:23am",
      "content": "I've done a lot of work for IT companies. Most would convey speed through a generically dull swoosh of some form or other.\n\nI actually really like what you've done. It stands out within the tech sector (especially in green) and it conveys depth, speed, movement, robustness and authority but is still a lovely and simple mark.\n\nSomething about the E bothers me slightly though...it just seems like its rotating a bit and lifting off the ground - the bottom looks like its coming toward me. Is it just me?\n\n"
    },
    {
      "time": "6 Aug 2008 — 1:36pm",
      "content": "@David Ford: No, I see that in the E, too. Compare the left vertical stroke of the A with the vertical stroke of the E. They seem to conflict.\n\nOverall, very nice. Just needs some tweaking.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "6 Aug 2008 — 8:16pm",
      "content": "Thanks, guys.\n\n"
    },
    {
      "time": "17 Aug 2008 — 9:30pm",
      "content": "Don, any updates?\n\n"
    },
    {
      "time": "18 Aug 2008 — 8:57pm",
      "content": "nice. looking good.\n\nmy first impression was ... you want speed, maybe slice up the logo some ... butDavid makes a very valid point.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131019185132/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "25 Aug 2008 — 11:12am",
      "content": "Hey Seb, Feedback's been good! Was working on choosing the green last week, making sure it's something that contrasts equally well against Oracle and is usable in rgb, cmyk, and has a Pantone equivalent.\n\nIf any major updates happen soon, I'll post em. Working on www UI currently, so I test it out on biz cards and on web this week, we'll see it being used practically and can make accurate calls on its use. =]\n\n"
    }
  ]
}
