{
  "id": "48125",
  "title": "Font embedding in pdf academic articles and other exciting tales.",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "G'day folks,\n\nI've just been asked today about supplying a pdf of a historical journal which I produce so that it can be placed online on an academic database. I wonder if any of you have come across this in your line of work. First a bit of background: from what I understand, most foundries are OK with font embedding in pdfs which are publicly distributed as long as they are set to print and preview and are not editable. However, if they are being offered for sale they become a commercial product and an additional embedding license needs to be purchased. Three questions:\n\n1. Are my assumptions about pdfs correct, (I guess most of my fonts are from ITC, Monotype and Adobe)?  \n2. From what I can tell, someone is not able to edit a pdf unless they have the fonts installed locally on their systems, do I need to apply additional security settings to pdf articles to prevent changing the document? In the past this has caused headaches with uploading content to the web.  \n3. Do articles or journals which are placed on academic databases like EBSCO or Informit count as commercial products? As far as I know the person submitting the journal isn't so much selling their journal as getting a small royalty (or copyright fee?) for each journal downloaded.\n\nthanks, in advance for any help\n\n",
  "author": "nicholasgross",
  "time": "5 Aug 2008 — 5:12pm",
  "uid": "9500",
  "comments": [
    {
      "time": "5 Aug 2008 — 6:20pm",
      "content": "The best thing to do is to read the EULA of the fonts you're planning to use.\n\nOn the technical side, the security settings of a PDF document are a separate matter from the embedding permissions of the fonts you may use in it.\n\nIf a font has Preview & Print embedding, it will be possible to embedded it in a document, but it won't be possible to edit the text of that document. You can, however, change other aspects of the document (e.g. page size, number of pages) if the security settings of the document so allow.\n\nIf a font has Editable embedding, it will be possible to embedded it in a document and it will be possible to edit the text of that document. Depending on how the document was created, you may or may not need to have the font installed in the system to edit the document and maintain its fidelity re. fonts. The ability of editing the document will still be dependent on its security settings. If the document only allows printing, you won't be able to change it, even if the fonts used in it have Editable embedding permissions.\n\n"
    },
    {
      "time": "5 Aug 2008 — 6:38pm",
      "content": "Thanks Miguel!\n\nSo I guess it sounds like the pdf embedding security is taken care of on the software side of things and I don't necessarily need to worry about locking down pdfs further with security settings.\n\nYes, reading the EULA should provide all the answers but I find them quite ambiguous, that's my reason for seeking further advice.\n\ncheers mate\n\n"
    },
    {
      "time": "5 Aug 2008 — 8:06pm",
      "content": "[This doc,](http://web.archive.org/web/20131014193733/http:/www.fontembedding.com/local/documents/EULA-embedding.pdf) at [www.fontembedding.com](http://web.archive.org/web/20131014193733/http:/www.fontembedding.com/ \"www.fontembedding.com\") covers the current situation for some foundries, but the EULAs you agreed to when you licensed your fonts might not be the same as the ones now being offered, so as Miguel says, there's no real substitute for reading the EULA!\n\n"
    },
    {
      "time": "6 Aug 2008 — 1:38am",
      "content": "Software manufacturers, including font foundries, could resolve a LOT of the mystery of the EULA, by NOT marketing their wares as purchasable items as opposed to licensed items. I don't recall ever seeing \"license now\" in regard to the point of sale. But I just did leave the Adobe web site where it says \"Buy.\" I think most folks don't realize they are only licensing software rather than owning. Most don't bother to read the EULA and don't understand there are restrictions on their \"purchase.\" The BSA has done a remarkable job in protecting the rights of its members but I cannot find on their site anything about the problem of the uninformed or misinformed \"licenser.\" Probably best kept under the rug.\n\nI asked three students about this tonight and none of them realized that they did not own the software they \"bought.\" Though manufacturers are quite righteous in their EULA policy, it is somewhat mystifying why they are reluctant to inform the \"buying\" public about it up front. Likely, because they prefer the sale, and the sale might be hampered if the buyer thought twice about the idea of licensing. Disagree or Agree. Click the right button to proceed with \"installation.\" Often though, especially when there is a physical product, this is after the \"buyer\" has submitted payment. It is not the consumer's fault that digital material cannot be adequately protected, and licensing is a deceptive practice to get around this problem.\n\nGerald\n\n"
    },
    {
      "time": "6 Aug 2008 — 9:51am",
      "content": "charles\\_e raised precisely this problem a couple of weeks ago in a discussion of web fonts ( [www.typophile.com/node/46896](http://web.archive.org/web/20131014193733/http:/typophile.com/wiki/www.typophile.com/node/46896)). There he described his having \"recommended to publishers in the past that they not use certain foundries' fonts\" based on strictures in their EULAs.\n\nI'd love to be corrected, but it seems to me that the \"Internal/Business\" embedding in fontembedding.com's chart, at least under the terms of Monotype's current license (and Linotype's now-similar version), precludes publishing in an online academic database without a \"special\" license.\n\nThe powers that be apparently prefer to ignore the issue. For example, the National Endowment for the Humanities convened a conference on \"Supporting Digital Scholarly Editions\" whose report manages nothing more useful than \"there seemed to be a consensus in one group at least that ... digital and print editions would look identical\" ( [www.virginiafoundation.org/NEH%20Workshop%20Report%20FINAL-3.pdf](http://web.archive.org/web/20131014193733/http:/typophile.com/wiki/www.virginiafoundation.org/NEH%2520Workshop%2520Report%2520FINAL-3.pdf), p. 6). Equally futile is searching for \"typeface\" or \"font\" in blogs on electronic publishing such as [www.futureofthebook.org/blog/](http://web.archive.org/web/20131014193733/http:/typophile.com/wiki/www.futureofthebook.org/blog/) and [www.escholarlypub.com/digitalkoans/](http://web.archive.org/web/20131014193733/http:/typophile.com/wiki/www.escholarlypub.com/digitalkoans/). Or check out the \"Publisher Guidelines\" PDF for Project Muse, whose mission is to put scholarly journals online.\n\nIt is not hard to imagine scholarly articles becoming hostage to the EULAs for the typeface in which their initial publication was set, either to retain page breaks (thus ensuring that citations by page number remain valid) or to preserve slightly unusual diacritics. All in all, not a happy situation.\n\nDavid\n\n"
    },
    {
      "time": "6 Aug 2008 — 4:58pm",
      "content": "True.\n\nIt really does seem to be an obscure part of publishing knowledge, I get blank looks and/or disbelief that it could actually be that way when I bring it up, even from an expert in copyright. What I'd like in a EULA is instead of, or in addition to, obscure language buried in a long long document is upfront simple language guidelines when you buy, or if you've inherited a bunch of fonts like I have, prominently displayed on a website for example in a FAQ, instead of being buried in the legal or terms and conditions section\n\nI have to say I just don't understand and have never understood the internal/business thing. Does that preclude putting pdfs up on the web for free download? In my experience and my email conversations with folks at Monotype, it seems that the issue is if you charge for your electronic document; if it's a commercial product but I'm still not sure. But it seems strange to deem an academic article a commercial product. From Monotype:\n\n<cite> “Personal or Internal Business Use” shall mean Use of the Font Software for your customary personal or internal business purposes and shall not mean any distribution whatsoever of the Font Software or any component or Derivative Work thereof. “Personal or Internal Business Use” shall not include any Use of the Font Software by persons that are not members of your immediate household, your authorized employees, or your authorized agents. All such household members, employees and agents shall be notified by you as to the terms and conditions of the Agreement and shall agree to be bound by it before they can have Use of the Font Software </cite>\n\n<cite> 6. “Derivative Work” shall mean binary data based upon or derived from Font Software (or any portion of Font Software) in any form in which such binary data may be recast, transformed, or adapted including, but not limited to, binary data in any format into which Font Software may be converted. </cite>\n\n<cite> 9. “Commercial Product” as used herein shall mean an electronic document or data file created by Use of the Font Software which is offered for distribution to the general public (or to some subset of the general public) as a commercial product in exchange for a separate fee or other consideration. By way of illustration and not by way of limitation, an electronic book or magazine distributed for a fee shall be considered a Commercial Product; a document distributed in connection with a commercial transaction in which the consideration is unrelated to such document (for example, a business letter, a ticket for an event, or a receipt for purchase of tangible goods such as clothing) shall not be considered a Commercial Product </cite>\n\nIs a pdf a component or a derivative work? Is a free pdf newsletter on a website internal/business? Is a pdf academic article which attracts a copyright royalty fee a commercial product?\n\nthanks for your thoughts guys.\n\n"
    },
    {
      "time": "6 Aug 2008 — 5:48pm",
      "content": "Hmm...<cite>\"an electronic book or magazine distributed for a fee shall be considered a Commercial Product\"</cite> ... seems pretty clear to me.\n\nSo, if this kind of use is important to you I'd say you have to factor in the cost of an extended license, if available, or shop elsewhere.\n\nBut, again, in the case of fonts you already have, the EULA that you agreed to when you licensed the font is what you need to read.\\*\n\n\\*Unless _that_ EULA has a clause allowing the vendor to unilaterally alter the terms of the licence—and, appallingly, some do!\n\n"
    },
    {
      "time": "6 Aug 2008 — 7:20pm",
      "content": "The thing is I'm not shopping anywhere, I already have the fonts, but no real record of how the fonts were bought and at what date, so I really only have the font info in suitcase to go off; current EULAs for the relevant companies, and an assurance from my previous boss that a font audit was carried out in the past. If I find myself in any kind of position to buy fonts in the future I will undoubtedly be buying the fonts with the friendliest EULAs I can find.\n\nBut, you're right, that commercial product reference does seem reasonably clear on distributing pdfs for a fee, but it just does seem like a different case with the academic database, where people aren't so much paying for the individual articles but paying a much smaller copyright/royalty fee that doesn't really reflect the cost of the publication. Perhaps this is splitting hairs.\n\nI also have trouble deciphering the table at fontembedding.com: does this mean that Adobe don't make the same stipulation between internal/business and commercial products? This may just solve the problem as the journal in question is set in Adobe Garamond from memory.\n\n"
    },
    {
      "time": "6 Aug 2008 — 7:45pm",
      "content": "Adobe's terms are very good in this regard.\n\nSee here:  \n [http://www.adobe.com/type/browser/legal/embeddingeula.html](http://web.archive.org/web/20131014193733/http:/www.adobe.com/type/browser/legal/embeddingeula.html \"http://www.adobe.com/type/browser/legal/embeddingeula.html\")  \nand here:  \n [http://www.adobe.com/type/browser/info/embedding.html](http://web.archive.org/web/20131014193733/http:/www.adobe.com/type/browser/info/embedding.html \"http://www.adobe.com/type/browser/info/embedding.html\")\n\nI haven't noticed any \"exclusions by purpose\" if you like, in Adobe's embedding terms.\n\nSee this as well:  \n [http://www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf](http://web.archive.org/web/20131014193733/http:/www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf \"http://www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf\")\n\n"
    },
    {
      "time": "7 Aug 2008 — 11:01am",
      "content": "You can use system fonts without embedding them. If you look at your system fonts carefully you will find out that there is awesome type that everyone have on their computers. Very good to be used on a project like yours.\n\n"
    },
    {
      "time": "7 Aug 2008 — 4:52pm",
      "content": "Thanks André,\n\nHm... that may be an option for designing for the future, it would require obviously re-setting existing work. And isn't it quite difficult to predict a font that everyone will have on their computers? Perhaps Times New Roman? I can imagine there are fonts that most people using PCs running Windows will have but what about mac users or Linux users? Web designers get away with it by specifying families of fonts and by the web page's ability to re-size to cope with differences in fonts. But academic journals have footnotes and index entries and so on which rely on things being really tied down.\n\nThanks for those links John, I think that almost solves my current problem. It's interesting to note, though, that there is a difference between fonts Adobe creates and fonts Adobe licenses from other foundries in questions of embedding. For example my versions of Univers have a copyright which rests with Adobe but a trademark which goes back to Linotype/Monotype. Our company, which produces a journal which is sold online, have taken out an commercial product embedding license with Monotype for this (and another font) even though we probably initially licensed it in some way from Adobe. I find this kind of stuff really confusing.\n\n<cite> Copyright (c) 1987, 1991, 1993, 1994 Adobe Systems Incorporated. All Rights Reserved.Univers is a trademark of Linotype-Hell AG and/or its subsidiaries. </cite>\n\n"
    },
    {
      "time": "7 Aug 2008 — 8:41pm",
      "content": "Adobe's license terms for fonts wholly owned by Adobe (plus those licensed from Bauer), versus fonts sub-licensed from other foundries, differ only in whether they one can use them for \"editable embedding.\"\n\nThat is, fonts licensed from Adobe - including those Adobe sublicensed from Linotype and Monotype - do NOT require some additional license for \"commercial embedding\" or anything like that.\n\nSo, if you licensed the original font(s) from Adobe, you wouldn't need to pay more money. If you licensed them from one of the foundries that has \"commercial embedding\" clauses in their EULA, then you'll have to see if what you want to do qualifies as \"commercial embedding.\"\n\n(I write this wearing my official Adobe hat.)\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "8 Aug 2008 — 12:10am",
      "content": "Wow thanks for an informed Adobe response Thomas,\n\nI'm assuming that is true for fonts that are bundled with programs as well as fonts that are separately licensed. This is interesting (or sickening) now as I might have encouraged our small and struggling company to pay (a fair bit of) money to license something we didn't actually need to license. On the post above is the verbatim info for the Univers weights and the following is the font info for most Palatino weights we've commercially licensed (apart from 'regular' which seems to be licensed to Apple):\n\n<cite> Copyright (c) 1985, 1987, 1989, 1990 Adobe Systems Incorporated. All Rights Reserved.Palatino is a trademark of Linotype AG and/or its subsidiaries. </cite>\n\nThese seem to be Adobe licensed fonts. It seems I need to go again back to Monotype. hm...\n\nthanks again\n\n"
    },
    {
      "time": "8 Aug 2008 — 11:20am",
      "content": "EULAs are what is known as adhesion contracts. Non-negotiable contracts that are largely punitive without providing the second party any benefit except to \"take it or leave it\" can be considered a violation of consumer statutory rights. Courts tend not to favor contracts seen as contra proferentem and most EULAs certainly fit the bill. It might benefit members here if the powers that be at Typophile take a pro-consumer stand on EULAs.\n\nGerald\n\n"
    },
    {
      "time": "8 Aug 2008 — 3:05pm",
      "content": "Nicholas: The copyright and trademark info in the font is not important here. The question is, who did you license the font from, and under what EULA? That exact same font (with the same copyright and trademark info) can be licensed from either Adobe or Linotype, under quite different license terms. And yes, Adobe's license terms are essentially the same for fonts bundled with applications, except for the number of computers you can use the font on.\n\nGerald: I'm not a lawyer, but the benefit of having and using the font seems like it is worth the restrictions placed by the license. If the user wasn't getting something out of the deal, I would think they wouldn't be willing to pay money for the privilege of agreeing to the EULA.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "8 Aug 2008 — 5:27pm",
      "content": "Thomas\n\nYes, but you are assuming folks read the EULA, most don't. Last one I read was 60 some pages long, and when I was finished I had no idea what my rights were. Manufacturers know, and some probably count on the fact, that no one is going to read the EULA in detail if at all. See the following reference (from Google, search EULA $1,000):\n\n[When Doug Heckman was installing a PC Pitstop program, he actually read the EULA. In it, he found a clause stating that he could get financial compensation if he emailed PC Pitstop. The result: a $1,000 check, and proof that people don't read EULAs (3,000 people before him didn't notice it).]\n\nIt's quite apparent that most folks don't know they are leasing because manufacturers are not up front about it. If they were folks just might not \"buy\" that proffered font.\n\nI just got an advertisement from a distributor of Adobe's offering a product with a Buy Now click button. I replied to the email asking if they were indeed selling the product or just a restrictive leasing arrangement. I think I am going to do that with every email solicitation I receive from now on.\n\nIt's not hard to resolve the problem folks are having, or to prevent the problems they might encounter. Write EULAs in plain language and inform the consumer prior to purchasing just what it is they are being sold.\n\nGerald\n\nInteresting tidbit: Anyone under the age of 18 is exempt from the contractual obligations of an EULA because they are not of legal age to enter into a binding contract. Which age group is responsible for most illegal copying of software?\n\n"
    },
    {
      "time": "12 Aug 2008 — 6:52pm",
      "content": "Hm. Thanks for all the advice. I think I'm a bit stuck now not knowing exactly how we came by the font and lacking proper documentation. I might have to have a think about what to do. I still don't understand how the font would have Adobe details in the copyright info if the font is purely a Monotype/Linotype font.\n\nRe: EULAs I'm all for these to be upfront and written in plain language -- although it was great to see that Adobe for its part has tried to make things clear and easy. Those links from John Nolan were quite valuable ad pretty straightforward.  \ncheers\n\n"
    },
    {
      "time": "13 Aug 2008 — 2:04am",
      "content": "\\> _I still don’t understand how the font would have Adobe details in the copyright info if the font is purely a Monotype/Linotype font._\n\nAdobe was responsible for converting the fonts to PostScript Type 1 (many years ago), therefore the copyright on the files. But Monotype/Linotype still have the ownership of the designs and the trademarked names.\n\n"
    },
    {
      "time": "13 Aug 2008 — 2:02pm",
      "content": "It's my understanding that in at least most such cases, our colleagues did considerable editing of the outlines and various cleaning up the fonts, as well as producing them in Type 1 format.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "13 Aug 2008 — 4:59pm",
      "content": "Ah ha, that makes sense. Thanks again guys, this topic has been valuable to me, thanks for your generosity.\n\n"
    },
    {
      "time": "15 Aug 2008 — 8:41pm",
      "content": "You will find many font resource at [Removed]. It is cool\n\n[Please note that it is frowned upon to name such sites here on Typophile. — Moderator]\n\n"
    }
  ]
}
