{
  "id": "48164",
  "title": "new Design: Forma sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi everyone, I would like to have your opinion on my new font, it's called Forma and it is a redesign of an old font of mine, I am trying to make an editorial/corporate font out of it.  \nthanks in advanced.\n\n ![](http://web.archive.org/web/20130819222914im_/http:/typophile.com/files/Forma_4303.jpg.jpg)\n\n",
  "author": "rui abreu",
  "time": "6 Aug 2008 — 4:55pm",
  "uid": "12433",
  "comments": [
    {
      "time": "7 Aug 2008 — 1:26am",
      "content": "Hi,  \nme as a non-typedesigner would disturb your design of the § and the &, for me should be much more conventional. I know that the Ampersand is an \"valid Et\"\n\n"
    },
    {
      "time": "7 Aug 2008 — 9:19am",
      "content": "Hi Rui,\n\nI have 2 thoughts: I find this looks too close to Neo Sans. It also reminds me of other square sans designs like Apex, Amplitude and Stainless. Which brings me to my second thought: There are so many square sans designs out there. It's a saturated area in type.\n\nAlso: The more mechanical a typeface looks, the more anonymous and undifferentiated I find it. Is there something really fresh or distinctive you can do with this? Right now it doesn't seem like it has its own identity.\n\n"
    },
    {
      "time": "7 Aug 2008 — 9:44am",
      "content": "All I'll say is I love your ampersand, as well as the half-rounded endings on the letter strokes.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "7 Aug 2008 — 10:59am",
      "content": "Yes, your right. I know from the start is not anything new, but i've been wanting to make a font like this for a while. I guees it more a question of resqueing an old design.  \nwell, thanks:)\n\n"
    },
    {
      "time": "3 Sep 2008 — 6:40am",
      "content": "Hi,  \nI quite like this. With all the other modern sans designs out there, it might not be easy to make it a commercial success, but perhaps that's not the reason you are making this.  \nI like this ampersand, its forms and proportions are neat.  \nFor me, the D and N are a bit wide. I wonder if the bottom right leg of the k could be chopped like the top (not horizontal ending). I think the tail of the Q could move right a bit?  \nj might need a longer base. y looks too narrow and needs more space, and the brackets () too thin and pointy (this kind of tapering is not seen in any other glyph).  \nI like the @.  \nJust some ideas...see what you think :)\n\n"
    },
    {
      "time": "5 Sep 2008 — 1:20am",
      "content": "Very nice. Your ampersand is quite like the Linotype Univers ampersand with its very definite horizontal bar.\n\nI wouldn't worry too much about this being a very saturated market, unless you earn a living from it it is just nice to craft something you can be proud of. I particularly like the curved base on the lowercase 'v' and 'w'. I can see this working really well in a corporate situation as it is very distinctive without being over-bearing.\n\n"
    },
    {
      "time": "29 Oct 2008 — 8:22am",
      "content": "Thanks Ronan. Thanks Ben.  \nI'm going to try your suggestions. I let this lay for a while but now i'l get beack to it.\n\n"
    }
  ]
}
