{
  "id": "48165",
  "title": "Personal portfolio web site",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I thought I should post before getting any further. I need to do the hardest thing and build [a personal portfolio web site](http://web.archive.org/web/20131107205153/http:/yuzgen.com/for_your_consideration/). Those two pages (PNG only yet) are all I have right now.\n\nI'm unsure and afraid. I need your objective critique. Thanks in advance.\n\n",
  "author": "yuzgen",
  "time": "6 Aug 2008 — 5:40pm",
  "uid": "17165",
  "comments": [
    {
      "time": "6 Aug 2008 — 6:46pm",
      "content": "I'm assuming the navigation will work on the real site.\n\nSo far it looks good to me. I would get rid of the black background and make it either the same colour as the background of the page, or just a shade or two darker.\n\n- Lex\n\nP.S. \"Stationary\" means standing still. \"Stationery\" means envelopes and letterhead.\n\n"
    },
    {
      "time": "6 Aug 2008 — 6:59pm",
      "content": "Agree with Lex about the black border.\n\nThe colors for your navigation fall way flat to me. The text becomes illegible over some of them. I am not crazy about your 'b.y.' mark. I feel the concept is good but just needs to be sharper and more fluid in the execution.\n\nFinally, with only those 2 pages, there seems to be a lack of consistency between them. They both look totally different. It would be better if you could make your pages fit into a master template so that all of your portfolio can be displayed using the nav on page one.\n\n"
    },
    {
      "time": "6 Aug 2008 — 7:01pm",
      "content": "It's coming along. Don't be so quick to fear your design work. Just think about your layout, make a good document grid/system of organization and hierarchy, and work it out. I am usually halfway into a project before I decide on the direction I will eventually follow.\n\n"
    },
    {
      "time": "7 Aug 2008 — 2:36am",
      "content": "Thanks a lot for the comments.\n\n@Lex  \nSure, the navigation will work. Each of the square thumbnails will be a button. I don't want a colourful HTML background. The five colourful squares on the welcome page will move to the top and each portfolio piece will be shown on one of the five background colours. So the visitor will know where he/she is by the background colour. Black seems way too heavy though. I'll try grey.\n\nThanks for the spelling.\n\n@jayyy  \nAs I wrote above, those colours will also be used as the inner background colours of the portfolio pieces. So they need to be muted or flat as you wrote. True, the colour used for \"Poster\" needs lightening. \"by\" mark is somewhat oriental and occult, but not the typography. Maybe you don't like that contrast? Please explain.\n\nAbout consistency... First one is a classical informative welcome page. The second one is actually the last one. Getting the welcome info to the second page should be quite logical. I'll try.\n\n@David Sudweeks  \nIt's just uncomfortable to show off myself. There's actually a grid, it's just lenient. The pages are constructed on a 40px grid, all the margins, spaces etc. I don't feel a dictating and easily seen grid is needed here. I presume the layouts will be awkward, there will be different sized pieces, so space should dictate instead. My intention was to present my work on a quiet and minimalist layout. The visitor shouldn't need to think about the layout itself but only look at the work. Easy and direct access to the rest of the content was my another intention.\n\n"
    }
  ]
}
