{
  "id": "48177",
  "title": "Arabic typography help",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "Arabic Typography & Type Design"
  ],
  "content": "Hello,\n\nSo I work in-hose for an architecture firm, and we have some of our people doing business in Abu Dhabi. We need to print up business cards with english and arabic translations on them. Although I consider myself very discerning of roman characters in typography, i have no clue what I’m doing in arabic.\n\nMy company won’t spring for any new fonts, as this is pretty much a one-off thing, but my computer has six arabic fonts (i believe they are Mac Standard, yet I can’t seem to find samples on the web...). I would like to avoid the middle-eastern equivalent of comic sans, and (as closely as possible) match the Avenir that already appears on the card. We have an architect in-house who can translate.\n\nMy choices are:  \nAl Bayan  \nBagdhad  \nDeco Type Naskh  \nGeeza Pro  \nKufi Standard GK  \nNadeem\n\nI would appreciate any help that I could get...\n\nA\n\n",
  "author": "i cant delete m...",
  "time": "7 Aug 2008 — 6:52am",
  "uid": "26908",
  "comments": [
    {
      "time": "7 Aug 2008 — 7:01am",
      "content": "Kufi Standard GK is probably the best choice of the mentioned typefaces. The geometric appearance of the typeface slightly matches the appearance of Avenir.\n\n"
    },
    {
      "time": "7 Aug 2008 — 7:21am",
      "content": "I was looking at that, but I wasn't sure if it was really forced. That is to say, I've heard people talk about trying to make Arabic type (or any other language system) \"helvetica-ized\", and completely losing the forms in the process. It looked to me like it would be the equivalent of a \"techno\" font, with really forced curves and lack of contrasts. I think that first, I want to make sure that the letters look good, then matching avenir comes next...\n\n"
    },
    {
      "time": "7 Aug 2008 — 11:45am",
      "content": "It is true that Kufi doesn't look like a traditional Arabic typeface due to its geometric nature. However Dubai doesn't have the appearance of a typical middle eastern country. I have recently seen a lot of Arabic geometric typefaces in use, most memorable was during the recent Bahrain f1 gran prix and this years TDC winning text family Al Rajhi. I personally really like them. I can understand why many Arab nations believe they are an insult to their cultural traditions.\n\nI am guessing Arabic geometric inspired typefaces haven't been around for a long period of time. It is only a matter of time before they become more accepted in certain countries like Dubia and Bahrain. The west had similiar acceptance issues with grotesques and early geometrics during the early twentieth century because of the radical change.\n\nI would give it a test setting to see if it works. If it does still feel to \"techno\". I would use Nadeem or Geeza since they appear slightly minimal but still have an element of Arabic calligraphy to them,\n\n"
    },
    {
      "time": "12 Aug 2008 — 11:32am",
      "content": "You might try UKIJ fonts, a wide variety there. Also, SIL puts out Lateef and Scheherazade, both nice looking. Finally, there are the Paktype fonts. Any of these may suit you. Check the license first.  \nPersonally, I'd go for a nice Nastaliq, or Sulus face for any names.\n\nWhy aren't you using whatever service others use in-country? There likely is some \"standard\" font, layout, etc., and it might be better to fit in rather than splash in.\n\n"
    },
    {
      "time": "11 Oct 2008 — 4:54am",
      "content": "The DecoType Naskh we made is the Arabic equivalent of, say, the Times New Roman so it's always a safe choice, though in our eyes technically obsolete and too simplistic. We also licensed a Thuluth to Apple based on the same simplified Apple template, so you should be able to use that a s well.\n\nIf you want access to our new high-end typefaces for this one-off job, you can contact me directly as tmilo [at] my company dot below.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150414232544/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "11 Oct 2008 — 4:55am",
      "content": "The DecoType Naskh we made is the Arabic equivalent of, say, the Times New Roman so it's always a safe choice, though in our eyes technically obsolete and too simplistic. We also licensed a Thuluth to Apple based on the same simplified Apple template, so you should be able to use that a s well.\n\nIf you want access to our new high-end typefaces for this one-off job, you can contact me directly as tmilo [at] my company dot below.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150414232544/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    }
  ]
}
