{
  "id": "48186",
  "title": "Typeface identification / Legenden?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi all you type experts\n\nIs there a new(ish) font called Legenden? A beautiful, slightly condensed modern serif text face, makes a first appearance – at least to me – in beautiful new book  \n’Buch gestaltung in St.Gallen’  \nby Roland Fruh  \npub. VGS, 2008  \nISBN 978-3-7291-1116-7.  \nCan anyone help?  \nBTW, the other font used is Futura, also beautiful, but that I know!  \nThanks.\n\nHonestly...\n\n [‹ Old northwest typography](http://web.archive.org/web/20081122105452/http:/www.typophile.com/node/48229 \"Go to previous forum topic\") [Two Gems from 1967 \"Play Time\" ›](http://web.archive.org/web/20081122105452/http:/www.typophile.com/node/48215 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122105452/http://www.typophile.com/user/35005\" title=\"View user profile.\">Honestly...</a>",
  "time": "<br>",
  "uid": "35005",
  "comments": [
    {
      "time": " 7.Aug.2008 1.39pm",
      "content": "A sample would be helpful.\n\n"
    },
    {
      "time": " 7.Aug.2008 5.33pm",
      "content": "A quick Google and Fontseek search for that font name came up with nothing that seems related to a font. Renko is right, we need to see a sample, to have a chance to identify it.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 7.Aug.2008 5.56pm",
      "content": "You may want to google Robin Kinross and see if she can help you. She may be in touch with Fruh.\n\nOr if you can translate this site you could e-mail and get info:\n\n[http://www.stadt.sg.ch/shownews.44959.l2nVBNrLBNqVC2CVAg9Tzq—.html](http://web.archive.org/web/20081122105452/http:/www.stadt.sg.ch/shownews.44959.l2nVBNrLBNqVC2CVAg9Tzq--.html \"http://www.stadt.sg.ch/shownews.44959.l2nVBNrLBNqVC2CVAg9Tzq--.html\")\n\nSorry I cannot be of more help.\n\nMichael\n\n"
    },
    {
      "time": " 8.Aug.2008 12.38am",
      "content": "Of course a sample would obviously help.  \nUnfortunately I would if I could but I can’t: broken scanner.  \nBut thanks so far.  \nHonestly...\n\n"
    },
    {
      "time": " 8.Aug.2008 2.11am",
      "content": "Michael, just a side note:  \n [Robin Kinross](http://web.archive.org/web/20081122105452/http:/www.typophile.com/wiki/Robin%252BKinross) is a British gentleman, [see here](http://web.archive.org/web/20081122105452/http:/www.115.org.uk/occupant/robinkinross.html). ;-)\n\nPeter, the author’s name is Roland Fr **ü** h (may help with searching?)\n\n‘Legenden’ means captions, underlines, legends. Could it be that this is not the name of the typeface, but rather an annotation that the captions are set in some typeface? (Of course it could be a typeface, too, but ‘Legenden’ would be a very generic name, like ‘Headlines’)\n\n"
    },
    {
      "time": " 8.Aug.2008 6.54am",
      "content": "Just trying to help Florian! No... just being a dumass! Sorry!\n\nFlorian, does that site help at all?\n\nMichael\n\n"
    },
    {
      "time": " 8.Aug.2008 4.51pm",
      "content": "Michael, I didn’t want to be a wisenheimer. Glad to see that native speakers can get confused by ambiguous English forenames like Jude, Frances or Leslie, too!\n\nThe website is by the municipality of St. Gallen/Switzerland. It announced an exhibition that presents 60 years of book design in St. Gallen. The show has been conceived by the world-renowned Swiss typographer and book designer [Jost Hochuli](http://web.archive.org/web/20081122105452/http:/www.typophile.com/wiki/Jost%252BHochuli). Roland Früh is a Zurich based art historian. He did the accompanying brochure (which is the printed matter in question). No infomation about typefaces, alas.  \nF\n\n"
    },
    {
      "time": " 8.Aug.2008 5.05pm",
      "content": "Had this problem yesterday. Wrote a lengthy e-mail to a client. It was going to the type director...addressed the e-mail to MR., when I got on the phone with “Carter” she quickly informed me that she was a she! Been married for 26 years but I never confuse my wife with a George.\n\nBad day for me!\n\nMichael\n\n"
    },
    {
      "time": " 10.Aug.2008 7.33am",
      "content": "Hello,\n\nRoland is currently working with Robin in a building I share but neither of them currently contactable hence my (first ever) approach to Typophile.\n\nAnyway, through a little detective work I worked it all out. The font is called Collis and is designed by Christoph Noordzij, available form the Enschedé Foundry. Check [http://www.teff.nl/fonts/collis/collis.html](http://web.archive.org/web/20081122105452/http:/www.teff.nl/fonts/collis/collis.html \"http://www.teff.nl/fonts/collis/collis.html\") for more details – and the pictures I couldn’t provide!\n\nThanks again.\n\n"
    },
    {
      "time": " 10.Aug.2008 9.38am",
      "content": "That was one of the few times we said so much with no image to look at.\n\nI am glad you solved your puzzle, but you might have done this on your own more quickly with the [Serif Font ID Guide](http://web.archive.org/web/20081122105452/http:/bowfinprintworks.com/SerifGuide/intro.php), as long as you had sample of the type you could look at. Collis was in there, along with about 1600 other serif type families.\n\nI know this seems like some sort of shameless self-promotion, but I get nothing if people use my Guides. I just think this one in particular is a helpful tool, which works pretty well once you learn how to select the attributes. It’s what I use for the serif questions.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 10.Aug.2008 10.14am",
      "content": "<cite>I just think this one in particular is a helpful tool</cite>\n\nI second that.\n\nPeter, congratulations on your find. So, still curious: where did ‘Legenden’ come from?\n\n"
    },
    {
      "time": " 11.Aug.2008 3.51am",
      "content": "Again, thanks for all the help — I’ll have a look at the ’Serif Font ID Guide’.\n\nOkay, the red herring of ’Legenden’ comes from my less than complete grasp of German. On the colophon of the book (see initial posting) it said ’Text der Legenden, Auwahl der Abbildungen...’ I was grasping at straws but could just about decipher that the rest was about the printer, the papers used, etc. As it turns out, and rather uncharacteristically for a book with Hochuli’s involvement, the typeface is not mentioned.\n\n"
    },
    {
      "time": " 12.Aug.2008 3.09pm",
      "content": "Alright, thanks. Just as I suspected in my first post: It says <cite>captioning, selection of figures</cite>.\n\n"
    }
  ]
}
