{
  "id": "48229",
  "title": "Old northwest typography",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I am working on a film about Portland OR, as well as the pacific northwest. Portland is filled with old building painted with great typography. It’s very railroad/lumber yard looking (which is Portland’s roots). The film is going to capture the essence of the rustic city, by featuring a sound track of all local artists and using old typography.\n\nI’ve attached some examples of the buildings, and some scans out of a book. I am NOT looking for a distressed font, or anything cheesy like that. I plan to use slighty imperfect letter spacing (as the type was painted by hand) and faded colors. Of course, I am really open to suggestions for interesting (but not over the top) type treatment ideas.\n\nIf there are any typefaces you know of that are similar to what I’ve attached, it would be most appreciated. Bonus points if the type or typography has any historical relevance to the northwest.\n\nThanks all!\n\n ![](http://web.archive.org/web/20081122114707im_/http:/www.typophile.com/files/NWType_4294.jpg)\n\n [‹ Antique typewriter font](http://web.archive.org/web/20081122114707/http:/www.typophile.com/node/48260 \"Go to previous forum topic\") [Typeface identification / Legenden? ›](http://web.archive.org/web/20081122114707/http:/www.typophile.com/node/48186 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122114707/http://www.typophile.com/user/32162\" title=\"View user profile.\">takes2totricycle</a>",
  "time": "<br>",
  "uid": "32162",
  "comments": [
    {
      "time": " 8.Aug.2008 12.15pm",
      "content": "Justin\n\nYou might want to go to your local train store. There is a publisher, OSO Publishing/Evergreen Hill, which produced some books on the rails out there. They are a great resource.\n\nI partiularly love the Uintah Railway Co. My favorite is the 2-6-6-2 Steam engine used by them.\n\nTrains were the recipient of some great lettering/type so I would not discount the RR as a source. Cool stuff and some wonderful lettering/type on engines, buildings and signage.\n\nGuess you can tell what I do in my spare time. HO all the way. Get your minds out of the gutter... HO is a train guage. Not you Justin ; )\n\nMichael\n\n"
    },
    {
      "time": " 8.Aug.2008 12.23pm",
      "content": "Your examples look to be from a wide time span but some simple ideas are:  \n-Neutratext, it has a similar feel.  \n-akzidenz grotesk (similar to what you have at the bottom-and the most prevelant pre-Helvetica Sans so probly in your time frame).  \n-Belwe (pretty classic)  \n-Ottomat  \n-Candida (personal favorite)  \n-Trade gothic (obvious! the classic face of the industrial revolution-this guy practically built the railroads!)  \n-Americana (a bit played out but relevant)  \n-AmfacParksHeadline (essentially serifed version of Trade)\n\n-Hope some of those help. You’re project sounds cool-the time in which Portland came up be was an interesting time for design and typography in general. Good Luck keep us posted\n\n"
    },
    {
      "time": " 8.Aug.2008 12.42pm",
      "content": "I don’t have anything to add, but I just wanted to say I really like that last uppercase ’G’. Anyone know that exact font, or one with a similar ’G’?\n\npenn\n\n"
    },
    {
      "time": " 8.Aug.2008 1.19pm",
      "content": "A wonderful aside.\n\nWhen I got into lettering in the early eighties I searched out a couple of the surviving old guys who did some of the buildings here in Richmond.\n\nOne of them who was at least late in his nineties told me... “Ain’t a one of them (type designers, I assume) know what they’re doin’. I have to borrow an N from this style and an A from that one and then finagle them to work on the building, ain’t enough room for the damn showoff ten dollar names. Inc. or Co. don’t make a damn to me! Just shorten the rest of the malarky. I almost fell off my chair laughing.\n\nMichael\n\n"
    },
    {
      "time": " 8.Aug.2008 2.03pm",
      "content": "I was also reminded of [Figgins Bold Caps](http://web.archive.org/web/20081122114707/http:/www.shinntype.com/figgins.html).\n\n"
    },
    {
      "time": " 8.Aug.2008 2.33pm",
      "content": "Justin,\n\nA little nit to pick about terminology: Type is not the same as lettering, and typography is not the same as type.\n\nTypeface: A suite of glyphs or letterforms designed to work together as a system, a “type design”\n\nFont: the module, hardware, software or other unit you use to set type, based on the type design (see above)\n\nLettering: hand-lettering includes hand-painted signs, calligraphy, informal and formal brush lettering, drawn and cutout letters made uniquely for a specific use. Lettering of any kind can be reproduced and applied digitally to printed matter or used to make a pattern for signs, logos, and other applications. Whatever form it’s in, hand-lettering is not type. Specific logos with intertwined letters, logos that fit into shapes, monograms or other word marks can’t simply be taken apart to make typefaces, and are just one element to be used in typographic composition.\n\nTypography: The use and application of typefaces. Could be stretched to include the use of logos and other letterforms\n\nThere are typeface designs based on hand-lettering (see the work of the talented Michael Clark - typerror - for example), but those are typefaces, based on hand-lettering styles. Michael can do marvelous hand-lettering as well (not true of everyone who has made typefaces based on lettering). Michael has skills in calligraphy and brush lettering that set him apart. Those skills do not necessarily add up to “typography”, although a lettering artist has to understand spacing, consistency and other things that make a piece of lettering click.\n\nSorry to be so dogmatic, but these terms are still useful in discussing your topic, signage on buildings. It’s terrific and I hope you’ll share links to the film when it’s done. There was a thread here recently that explored whether there are localized lettering styles in every city, such as the vernacular lettering that Gotham was based on. I hope so. Patzcuaro is another typeface based on the particular lettering style seen on all the public signs in Patzcuaro, Mexico. Originally those signs were hand-lettered.\n\n"
    },
    {
      "time": " 8.Aug.2008 3.02pm",
      "content": "Well if Carl is going to be dogmatic... there is a difference between calligraphy and lettering. The latter implies that the calligraphy was augmented or was not done in a single stroke, but built up... but that is kind of archaic in this day and age.\n\nCarl, do you have a valid e-mail address? It bounces back from your website.\n\nMichael\n\n"
    },
    {
      "time": " 8.Aug.2008 6.48pm",
      "content": ""
    },
    {
      "time": " 8.Aug.2008 7.47pm",
      "content": "Carl, with all due respect, if you do feel the need to preach to others then it is best you have your facts straight before you begin. I agree with the main point of your post that _“Type is not the same as lettering, and typography is not the same as type.”_ But beyond that many of your definitions above are pretty inaccurate and/or misleading. I feel you could have explained yourself in about half the words you used and alleviated the need for my lengthy waffle!\n\n_“Font: the module, hardware, software or other unit you use to set type, based on the type design (see above)”_\n\nYour definition of a font doesn’t seem to make any sence. If I am understanding you correctly here, you are suggesting that a font is the tool you use to set type, a Linotype machine or InDesign for example? The [Typowiki](http://web.archive.org/web/20081122114707/http:/typophile.com/node/13544) states in nice simple terms that “_a font can be said to be one weight, width, and style of a typeface_”. Or an older, yet still relevant definition of can be found on the real [Wikipedia](http://web.archive.org/web/20081122114707/http:/en.wikipedia.org/wiki/Font) where it defines a font as “_as a complete character set of a single size and style of a particular typeface_” (digital fonts are no longer limited to size as they are scalable). Also, to the best of my knowledge a digital font is not regarded as a piece of software, I may be wrong about this.\n\n_“Typeface: A suite of glyphs or letterforms designed to work together as a system, a ‘type design’”_\n\nTo begin with I have never heard of a typeface being referred to as a “type design”. Obviously a typeface is a piece of design but it’s not referred to as such. Your definition of a typeface sounds closer to the definition of a font. Again the [Wikipedia](http://web.archive.org/web/20081122114707/http:/en.wikipedia.org/wiki/Typeface) provides another straight forward definition: “_a typeface is a set of one or more fonts designed with stylistic unity, each comprising a coordinated set of glyphs_”. I would actually go so far as to challenge the Typowiki definition of a typeface, which is already being discussed [here](http://web.archive.org/web/20081122114707/http:/typophile.com/node/39843), and it would seem that the term is open to interpretation. Yet neither the Typowiki nor the Wikipedia make any reference to “type design” with regard to a typeface.\n\n_“Typography: The use and application of typefaces. Could be stretched to include the use of logos and other letterforms”_\n\nI don’t believe that that typography can stretch to include logos unless you are talking about a purely typographic logotype. Once you combine a graphic element with a typographic element you create the most clear-cut example of graphic design. Graphic Design : The combination of image and typography to communicate an idea. But now I’m nit picking!\n\nCarl I respect the fact that you have many years of experience in the field of typography and I am assuming you do know what you are talking about, however I think I have explained with references a number of problems with the definitions you have given above.\n\nNaoise\n\n"
    },
    {
      "time": " 9.Aug.2008 1.08am",
      "content": "@penn\n\nEagle Bold has a similar cap G\n\n"
    },
    {
      "time": " 11.Aug.2008 9.08am",
      "content": "I like this letters very much. Look in House Industries they have many in these style [http://www.houseind.com/index.php?page=fontsbystyle&s=4](http://web.archive.org/web/20081122114707/http:/www.houseind.com/index.php?page=fontsbystyle&s=4 \"http://www.houseind.com/index.php?page=fontsbystyle&s=4\")\n\n"
    },
    {
      "time": " 12.Aug.2008 2.09pm",
      "content": "I know we’ve had previous discussions regarding Letterhead fonts and issues of corporate sanity, but they are about the best source around for authentic sign painter fonts, which are definitely different from typography, and are what you’re showing in your photos:\n\n[http://www.letterheadfonts.com/](http://web.archive.org/web/20081122114707/http:/www.letterheadfonts.com/ \"http://www.letterheadfonts.com/\")\n\n"
    },
    {
      "time": " 12.Aug.2008 2.16pm",
      "content": "You can also go directly to the source and look up the old Atkinson font books:\n\n[http://www.theletterheads.com/lhparts/atkinsonbooks.html](http://web.archive.org/web/20081122114707/http:/www.theletterheads.com/lhparts/atkinsonbooks.html \"http://www.theletterheads.com/lhparts/atkinsonbooks.html\")\n\nThe Letterheads (not affiliated with the Letterhead Font folks) are a great resource far all sorts of historic sign info.\n\n"
    },
    {
      "time": " 12.Aug.2008 5.39pm",
      "content": "Not necessarily useful for your film, but the Thorniley Type Museum is in Kent, Washington, an industrial suburb outside of Seattle. It’s housed in a side room of West Coast Paper. Anyone interested in American type during the period of westward expansion should check it out. It’s got some great specimen books, and some old hand presses.\n\n"
    }
  ]
}
