{
  "id": "4822",
  "title": "Analog or digital--how do YOU start a glyph?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello everyone. Just wanted to take a quick survey of sorts:   \n   \n1) How many of you design your type from scratch in Illustrator (no scanned images, just pure composition inside the program)?   \n   \n2) How many of you draft the glyphs first by hand, then edit that draft in Illustrator?   \n   \n3) Do any of you use Illustrator (or any comparable program) simply to get the image in EPS format so you can do the majority of aesthetic work in FontLab?   \n   \nIt seems like more of #3 should be happening than what I suspect actually is--and it's a wonder, because FontLab has some really great glyph-construction tools (I don't mean to sound like I work for FontLab, no offense to those who do).   \n   \nOh, and why do you feel that your method is best?\n\n",
  "author": "A. Scott Britton",
  "time": "18 May 2004 — 7:37am",
  "uid": "3373",
  "comments": [
    {
      "time": "18 May 2004 — 7:53am",
      "content": "Where do you get the idea of design a font?\n\n"
    },
    {
      "time": "18 May 2004 — 9:27am",
      "content": "I almost ALWAYS start from a source either a sketch or photo of letters scanned, or a doodle with an idea on it I want to capture. Often times I only make one word to start usually less than 8 letters long.   \n   \nIt's like a piece of dirt in an oyster that starts a pearl. I rely on my first tracing/drawing to capture the gesture of the face and if it looks right on screen then I give myself the green light to proceed with more of the characters and flesh out the entire font in Illustrator 8.0.   \n   \nHonestly the making of the font goes MUCH faster if it's drawn well first and I find Illustrator to be that tool for me. I reply on the peices and parts of other letters for consistent rules on how to make the rest of the glyphs in the face so I need the entire font in front of me at all times on the pasteboard.   \n   \nBeyond that, it's a quick import to FOG and a few hours to complete the font. I use FOG/FLAB strictly as technical font development and production tools and nothing more.   \n   \nStuart :D\n\n"
    },
    {
      "time": "18 May 2004 — 10:04am",
      "content": "\"I use FOG/FLAB strictly as technical font development and production tools...\"   \n   \nYou mean aspects like metrics and other things specific to font design, right?   \n   \nAny particular reason why you limit drawing to Illustrator and stay away from those tools in FL?\n\n"
    },
    {
      "time": "18 May 2004 — 10:17am",
      "content": "Nice to know about your process, Mr. Stuart Sandler.   \n\"A few hours to complete the font\" sounds like fast like Ferrari.\n\n"
    },
    {
      "time": "18 May 2004 — 11:31am",
      "content": "I do almost all my work directly in FontLab. I almost never scan an image: even if I am using analogue artwork, I'll just prop it beside my monitor and interpret it in the FontLab glyph window.   \n   \nI often start designs with a period of what I generically term 'research' which often involves a variety of writing implements. Usually this is to understand the organic development of a particular script style, rather than 'design' per se.   \n   \nBy the way, Tim Holloway, brilliant designer of Arabic and Indic typefaces, told me about a clever technique he has used in the past: draw outlines on clear mylar with a translucent red pen, then tape the mylar over your computer screen and digitise the outline in the background. Very clever, and much more efficient than scanning, tracing, cleanup etc.\n\n"
    },
    {
      "time": "18 May 2004 — 2:07pm",
      "content": "My work style is rather close to John's. I'll doodle and think and such, but unless the font is based substantially on sources outside my head, I'll work directly in FontLab to do the real drawing, without scans.   \n   \nBut then again, I don't spend nearly as high a percentage of my time drawing letters as some people on this forum. Maybe I'd have evolved a different work style if I spent 40+ hours a week on it instead of 5-20.   \n   \nT\n\n"
    },
    {
      "time": "18 May 2004 — 2:51pm",
      "content": "I take the dog for a couple of pee during the process,   \nthat means I like to draw, leave it, check it again later,   \nI mean the difference between reading a poem and a book.   \nFontLab is a supacool software,   \nbut I believe that man thinks because he has fingers.   \nThanks, this topic is extremely interesting to me,   \nalso because it is a little bit unlinked from the money.\n\n"
    },
    {
      "time": "18 May 2004 — 3:24pm",
      "content": "\\> man thinks because he has fingers.   \n   \nDon't tell that to people born without hands - like this guy:   \n [http://news.bbc.co.uk/2/hi/south\\_asia/3253168.stm](http://web.archive.org/web/20131010194539/http:/news.bbc.co.uk/2/hi/south_asia/3253168.stm)   \n   \nhhp\n\n"
    },
    {
      "time": "18 May 2004 — 3:47pm",
      "content": "OH, yeah, I think you posted that url before on TYPO-L didn't you?   \nAnyway I said fingers, not hands, but well,   \nsometime nature seems cruel.\n\n"
    },
    {
      "time": "18 May 2004 — 4:48pm",
      "content": "\\> sometime nature seems cruel.   \n   \nEspecially when it gives somebody dexterous hands, but no brains to know when NOT to use them.   \n   \nhhp\n\n"
    },
    {
      "time": "18 May 2004 — 4:58pm",
      "content": "I'm so lucky I met you ![:-)](http://web.archive.org/web/20131010194539im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n [www.wulffmorgenthaler.com/log/AL06052004.gif](http://web.archive.org/web/20131010194539/http:/www.wulffmorgenthaler.com/log/AL06052004.gif)\n\n"
    },
    {
      "time": "19 May 2004 — 6:57am",
      "content": "_\"I use FOG/FLAB strictly as technical font development and production tools...\"   \n   \nYou mean aspects like metrics and other things specific to font design, right?   \n   \nAny particular reason why you limit drawing to Illustrator and stay away from those tools in FL?_   \n      \n   \nTo answer your question it has a lot to do with the way I draw an alphabet. A small word is first drawn, then I make as many obvious spin-off letters from what I have, then I refer to all the letters I've created to make the remaining glyphs to flesh out the font set.   \n   \nAt all times I find I need to be able to see every letter I've drawn to see what parts and peices I need to steal from it to make another glyph from it. Illustrator uses a large pasteboard area which makes this easy for me to do.   \n   \nI can't see drawing an entire font in FLAB all in one glyph slot and then moving each glyph into its own slot.   \n   \nAnother part of it is that I'm quite fast with Illustrator since I've been working with it since version 3.0 as a young design pup, so I'm not inclined to move away from that especially when you consider that it still requires the same effort to draw a glyph outline in either program.   \n   \nNow regarding my other comment regardint font production, I port all my drawn glyphs into FOG then do the spacing, kerning and hinting and generate the font. Then I import it into FLAB and correct the Font Info double check the hinting and export the PS versions. I save an alternate copy, change the em to 2048, apply the TT specific features and generate that version. Like I said all production since there is no further creative decisions required at that point in the fonts development.   \n   \nStuart :D   \n   \nPS: Yep, a couple of hours it all it takes to space and kern a font. It always comes back to well drawn character sets.\n\n"
    },
    {
      "time": "19 May 2004 — 7:20am",
      "content": "\\> a couple of hours it all it takes to space and kern a font.   \n   \nNot the way I do it.   \n   \nhhp\n\n"
    },
    {
      "time": "19 May 2004 — 7:32am",
      "content": "![](http://web.archive.org/web/20131010194539im_/http:/www.typophile.com/forums/messages/4101/36277.gif)\n\n"
    },
    {
      "time": "19 May 2004 — 8:57am",
      "content": "\"Illustrator . . . I've been working with it since version 3.0 as a young design pup\"   \n   \nYeah, you know that's funny because I've been wondering lately what is so great about Illustrator--let me rephrase that (I don't mean that it's a bad program, I think it's really good in fact), what I mean to say is that for the longest time I couldn't figure out why people insisted on doing all creative work in Illustrator, then using their FontLab for \"translation\" purposes. However, I now understand that it's a preference and that a bunch of people learned Illustrator from the get-go and I agree that to change your procedure after a certain point is pointless.   \n   \nFor me, it's about hand-drafting (an old habit from my architectural drafting school days), scanning, and then using FontLab to manually trace the bitmap ghost. In other words, I'm really gonna use the daylights out of FontLab (which means learning it inside and out--just last night I was expounding the virtues of backgrounds and templates in FontLab to my fianc\n\n"
    },
    {
      "time": "19 May 2004 — 12:32pm",
      "content": "One advantage I will say Illustrator has to FLAB is that I can res up an image to say 18' x 18' at 72 dpi in Photoshop and place it in Illustrator and do my tracings from incredibly highres source material.   \n   \nI jsut can't zoom in enough sometimes :D\n\n"
    },
    {
      "time": "19 May 2004 — 3:47pm",
      "content": "I'm all for whatever works but...   \nBy drawing in Illustrator you're designing independent of spacing,   \ncreating inconsistent stem weights and ultimately wasting time by   \nhaving to paste back and forth.   \n   \nDrawing in FL (or FOG for that matter) is wonky at first if you're   \naccustomed to drawing in a vector program. Even highly frustrating.   \nBut, after a few days the logic will reveal itself.   \n   \nIn FL I hit the TAB key to keep the glyphs on hand, use the ~ key   \nfor previews and always keep a metrics window open to see   \nthe glyphs in relation to one another.   \n   \nJust another way of working I guess. Seems very similar to   \nJohn and and Thomas.   \n   \nA few hours for spacing and kerning...?   \nWhoa. I'm more like a few days per weight if I rush it.   \n   \nBest,   \nEric O.\n\n"
    },
    {
      "time": "20 May 2004 — 5:41am",
      "content": "I cut my vector teeth on FreeHand pretty much before Adobe even showed up on the software scene. Never bothered to port over to Illustrator (that double arrow thing always confused me for some silly reason). So drawing directly in FOG [same folks who made FreeHand; similar interface back then] has always been my preference, rather than starting somewhere else.   \n   \nI work my ideas out on paper. At least to get started. I used to draw just about every glyph first, but now mostly just the key characters to get the foundation firmly established. Or especially tricky characters where the vectors just seem too unruly.   \n   \nI do my working drawings in HB mechanical pencil on Clearprint. I rule out \"slug\" lines at 250 points (i.e., 1:4 ratio to the 1000 PS em square) and a baseline and x-height. I love drawing and fine-tuning letters on paper.   \n   \nThen I scan my characters and paste them into the template in FOG and digitize directly there.   \n   \nLately I'm getting more comfortable working directly in FOG without bothering to scan the sketches -- much like John described : sort of like a punchcutter interpreting a drawn model.   \n   \nI know I should switch to FLab, but Fog is now second nature and so I'm just lazy. I'd rather focus on the ideas and not struggle with the tool. Same problem I have with switching to Indy from Quark. Intellectually, I know it's better and more efficient; but in the short term it's just plain frustrating and too much bother. (Hey, Carter still uses Fog 3.1, right? Good enough for him, good enough for me. Well, sounds like a good excuse anyway.)   \n   \nWhile I understand why Stuart and others like him work the way they do, that seems more appropriate for display designs. (No disrespect, Stuart.)   \n   \nSince my chosen arena is text typefaces, I can't imagine not designing in an environment where spacing is integral and I always keep a metrics window open. In fact, I wish I could edit outlines directly in a metrics window (wasn't Mark fantasizing about this once?).   \n   \nI spent more like several months spacing and kerning Whitman. (Hard to say exactly, because it was mostly evenings and weekends.) I'd like to think that I'm getting faster and better, but I still think spacing takes as much, if not more, time than actual character design.   \n   \nMy ideas generally come from \"What If\" scenarios. Sort of like Einstein's famous thought experiments. Whitman grew out of something like \"What if Dwiggins had designed Joanna instead of Gill?\" Stadler (in development) is an experiment in \"What if Mozart were a punchcutter (instead of a composer) and Anton Stadler were a printer (instead of a clarinetist), and Mozart created a typeface for him, instead of the Clarinet Concerto?\" I usually have a verbal, conceptual brief for the design even before I have a clear visual image. There is a felt sense of something possible or some road not taken, long before I discover what it actually looks like.   \n   \nThere are always references to other sources, historic and contemporary. These usually have a love/hate component and a certain amount of hubris -- \"This has some nice aspects, but I would have done it this way.\"   \n   \nThese are starting points. Once the face takes shape, it tends to gain a life of its own and evolves according to its own inner logic, and the concepts and references take a back seat to What Works.   \n   \n-- K.\n\n"
    },
    {
      "time": "20 May 2004 — 7:45am",
      "content": "Kent,   \n   \n\"I used to draw just about every glyph first, but now mostly just the key characters to get the foundation firmly established.\"   \n   \nWhat do you deem to be the 'key characters'? Are you working from an established (and universally accepted) list, or from personal experience and opinion?\n\n"
    },
    {
      "time": "20 May 2004 — 9:26am",
      "content": "\\> \"What if Mozart were ....   \n   \nThat's pretty crazy stuff, man!   \nI like it.   \n   \nhhp\n\n"
    },
    {
      "time": "20 May 2004 — 10:05am",
      "content": "\\> In fact, I wish I could edit outlines directly in a metrics window   \n(wasn't Mark fantasizing about this once?).   \n   \nYou almost, kind of, sort of can.   \nDouble click on the name of the glyph in the metrics window and   \nit will pop open while the metrics window is still open.   \nI do this often.\n\n"
    },
    {
      "time": "20 May 2004 — 2:28pm",
      "content": "_\\>You almost, kind of, sort of can._    \n   \nYeah, Eric, I know. Command-H does the same thing in Fog. But it's not the same as being able to just grab a point in the metrics window and start manipulating the outlines right there in context.   \n   \n_\\>What do you deem to be the 'key characters'? Are you working from an established (and universally accepted) list, or from personal experience and opinion?_   \n   \nI'm no expert. Personal preference. Although, I wouldn't be surprised if mine overlap with others'. Wasn't there a thread along these lines at some point earlier this year?   \n   \nWhen I'm sketching out new ideas, I usually play with 'n a p e r g s t o'. Sometimes 'f' or 'y'. For me, caps don't usually come along until well after the lc is pretty much developed.   \n   \n-- K.\n\n"
    },
    {
      "time": "20 May 2004 — 2:56pm",
      "content": "_I usually have a verbal, conceptual brief for the design even before I have a clear visual image. There is a felt sense of something possible or some road not taken, long before I discover what it actually looks like._    \n   \nThis is quite similar to my approach. My thought experiments usually go something like 'What if Constantinople had never fallen to the Turks, and the Greek script had continued to evolve in closer contact to the Middle East than to Western Europe?'   \n   \nRecently, I've been asking myself the larger question: What if the advent of typography had not frozen our scripts? -- as mass printing also froze much of our knowledge: a kind of filter through which we perceive the manuscript world.\\* I'm increasingly interested in palaeography (and not just because it gives me a whole new avenue of book collecting!), and the rich variety of letterforms before the standardisation of typography. I think it is ironical that much of the history of type, especially from the 19th century on, has involved a conscious effort to massively expand the variety of letterforms -- hence the huge number of fonts now available --, but most of it has been largely unconscious of the historical variety that preceded Gutenberg et al.   \n   \n   \n\\* Colette Sirat makes this point very well in her _Hebrew manuscripts of the Middle Ages,_ when she notes how most of what we know about pre-typographic history, culture and thought is determined by which manuscripts were deemed commercially viable by the early printer publishers.\n\n"
    },
    {
      "time": "20 May 2004 — 3:15pm",
      "content": "My approach in terms of which letters I do first is a lot like Kent's. I focus on the lowercase first, maybe just doing H and O in the caps to start with.   \n   \nThe exact LC letter choice varies, but I'll usually start with something like habeonti and then later expand towards a full hamburgefontstiv.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "20 May 2004 — 3:24pm",
      "content": "John, that's a good point (although I think \"frozen\" is too strong).   \nI guess a good antidote is to be braver about the possibilities,   \nto worry more about culture and less about sales.   \n   \nhhp\n\n"
    },
    {
      "time": "20 May 2004 — 6:31pm",
      "content": "_John, that's a good point (although I think \"frozen\" is too strong)._   \n   \nProbably. If you think about it, though, early type founding and printing derived directly from the specific formal writing hands employed in particular places at a specific point in time, and just about all type design since has been in reaction to and evolved from those models. Type designers have generally only gone back to pre-Gutenberg models for display types and to deliberately evoke historical periods, usually in fairly crude and superficial ways. There seems to have been relatively little exchange between type design and serious palaeographical scholarship.   \n   \nIn broader terms, 'frozen' is certainly too strong a word to rhetorically describe the general solidifying of our image of the pre-typographic world based on what printers considered worth preserving in the new media. A better image is of print as a filter through which only some of the past has come down to us.\n\n"
    },
    {
      "time": "20 May 2004 — 8:06pm",
      "content": "_n a p e r g s t o_   \n   \nDitto for me. I will also do an h. Without it you have no ascender height :-)   \nAlmost always start with an -a- on paper. I have pages of a doodles.   \n   \nI too am an illustrator junkie, but I'm weaning myself. Importing is not too bad. I do miss designing glyphs in context and I also find that i get stray points and confused path directions.   \n   \nRandy\n\n"
    },
    {
      "time": "20 May 2004 — 9:41pm",
      "content": "I almost always start with lowercase _i_ since this enables me to determine basic stem weight, serif forms, and normative termination of four corners of a basic stem. I then design the lowercase _n._\n\n"
    },
    {
      "time": "21 May 2004 — 4:03am",
      "content": "_naperstgo_ are the usual suspects for drawing and working out ideas. But . . .   \n   \nWhen the work begins in earnest -- i.e., digital -- I usually start with 'h n o p'. Establish stem weight, foot serif treatment, head serifs, ascender, descender, bowl, arched counterform, counter and width relationships; I might work these quite a bit and work out preliminary spacing as well.   \n   \nThen typically 'm u i l' are derived without sketches or scans. And more spacing tweaks. The 'r' comes soon after and is sometimes worked directly on screen, sometimes scanned, depending upon the design.   \n   \n'b d' might be derived at this point, to check and refine the bowl design.   \n   \nThen 'a g' are brought in about now, maybe sooner. This is where things get interesting. These characters usually make it or break it for me. 'e' might get scanned, or might get drawn directly on screen. Quite a bit of spacing tweaks may follow.   \n   \nAfter this, things progress variably. The goal is to get to 'hamburgefontsiv' (with 'pldc' usually thrown in for good measure). I often work out comma, period, hyphen, and apostrophe even before lc is fully developed. Sometimes the question mark. And determine the spaceband. The point is to start setting as much trial text as soon as I can and then keep adding and refining. (I will confess that 'k' and 'x' are almost always last.)   \n   \nWhen I get to caps, 'H O' are the standard starting point to establish height, weight, and width relation to each other and the lc. Spacing also gets some attention in relation to each other and lc. From there, the easy caps 'I E F T L' are quickly derived. Then usually 'M N' -- they might get sketched a bit first, and the 'M' often scanned.   \n   \nAfter that, usually the 'A V W' or 'P R B'. 'R' is always sketched quite a bit and usually scanned.   \n   \nThis is a general reflective description I'm making up here, not any kind of well-honed, tried-and-true methodology. Just reflecting on how things seem to go these days and how my own personal, self-taught habits have developed. (Interesting exercise.)   \n   \nIt's not really as linear as it sounds, every new character can provoke reevaluation of everything else.   \n   \nType design is still an evenings-and-weekends, in-between-jobs venture for me, so work on any given design will proceed slowly and in fits and starts.   \n   \n-- K.\n\n"
    },
    {
      "time": "21 May 2004 — 5:32am",
      "content": "Thank you Mr. Kent Lew for your letter, then I much appreciate   \nJohn Hudson\n\n"
    },
    {
      "time": "21 May 2004 — 8:01pm",
      "content": "At one of the ATypI meetings someone, David Farey if I recall, would cut letters out of rubylith by hand without having a drawing or anything to look at. You could name a face and he would cut it with a razor blade stuck in a ratty piece of wood for a handle.   \n   \nI do the whole alphabet on paper, pencil first, then marker. I use a mechanical pencil with 4H lead on a nice drafting paper. Sometimes it's marker first, then pencil if it's something more gestural. I've usually work large, 8\" body height, but lately have been drawing smaller, 4-5\". Then I scan them, digitize them, fiddle with the outlines, print them out and usually draw some again and scan them again.Then I do words and readust the characters accordingly. I go at the spacing and kerning the same way: space it, space it again, set it aside, then space it again.   \n   \nI like the idea John Hudson mentioned, tape the drawing on the monitor, so I'm going to try it. If it saves some scanning time that would be great.   \n   \nI could never get the hang of doing it by eye unless I was working on a tablet and I never found a tablet pen that worked for me.\n\n"
    },
    {
      "time": "21 May 2004 — 8:12pm",
      "content": "\\>At one of the ATypI meetings someone, David Farey if I recall, would cut letters out of rubylith by hand without having a drawing or anything to look at. You could name a face and he would cut it with a razor blade stuck in a ratty piece of wood for a handle. \\<   \n   \nI'm afraid you have it very wrong on this count. Dave Farey is a master of stencil cutting, but he always has a master under the Ulano to cut. The whole point of the technique was to render alphabet art into clean masters for photo reproduction.\n\n"
    },
    {
      "time": "22 May 2004 — 11:29am",
      "content": "I've been reorganizing my entire collection of type material (after a week I'm _almost_ finished...) and I ran into something that might give a funky non-Latin spin to this thread.   \n   \nThe Georgian alphabet has a _lot_ of modularity, so when I was making my font for that script (a highly modular design to boot) it seemed efficient to draw a \"PERT chart\" of sorts, and develop the glyphs in a cascading fashion based on \"classes\".   \n   \n\\* [http://www.themicrofoundry.com/f\\_akhalkalak.html](http://web.archive.org/web/20131010194539/http:/www.themicrofoundry.com/f_akhalkalak.html)   \n   \nHere's what I ended up with!   \n [http://www.themicrofoundry.com/other/georgdev.gif](http://web.archive.org/web/20131010194539/http:/www.themicrofoundry.com/other/georgdev.gif)   \n(Details inset.)   \n   \nhhp\n\n"
    },
    {
      "time": "22 May 2004 — 3:28pm",
      "content": "Friends,   \nDo you think that ability to edit outlines directly in Metrics window is really important? I don't think I can make full set of Glyph window tools available there, but simple node-mover can be put there quite easily. What I really afraid is that after I put simple tool there you will ask for more :-)\n\n"
    },
    {
      "time": "22 May 2004 — 4:12pm",
      "content": "I think if you can simply edit glyphs in one window and see the setting results in another window (which you can), that's plenty. But I guess if monitor \"real-estate\" is limited, combining them could be useful.   \n   \nhhp\n\n"
    },
    {
      "time": "22 May 2004 — 7:51pm",
      "content": "_What if Mozart..._ i would very much like to see that one. any samples yet?\n\n"
    },
    {
      "time": "23 May 2004 — 5:43am",
      "content": "_Do you think that ability to edit outlines directly in Metrics window is really important?_    \n   \nYuri -- Important? probably not. But definitely convenient. I would be happy just being able to grab nodes and handles and nudge them directly in the Metrics window. But I can't speak for anyone else.   \n   \nAnd you might not want to listen to me, as I'm not a huge FLab user yet. Still primarily stuck in the comfort of Fog. (Though I'm trying to make the move. But all my automatic habits are defeated and I hate having to struggle to relearn a new tool.)   \n   \nBut while I'm at it, I will mention one pet peeve about the FLab metrics window. Because the data readout for the metrics is at the top of the window, when I want to toggle kerning on and off to compare the effect of kerning, the preview jumps up and down -- which completely defeats the ability to compare the effect.   \n   \nDoes this make sense? Does anyone else experience this and does it bug them?\n\n"
    },
    {
      "time": "23 May 2004 — 6:12am",
      "content": "_\\>\\>What if Mozart... i would very much like to see that one. any samples yet?_   \n   \nRe: Stadler. Sorry; still very formative. It may still be quite a while before this one reaches fruition. (It's already been gestating for four years). I think I may have finally found the right themes, but I have yet to pull them together, and the design is once again sidelined.   \n   \nIronically, I got sidetracked by something a colleague said. I was showing a few Stadler sketches and he mentioned an interesting possibility that he saw in them which was not in line with my [Neoclassical] concept, but which got me thinking about an older design I had stashed in a drawer. So I revisited the older concept (something more Baroque) and it suddenly gained legs. It's been getting all my available attention recently.   \n   \nThis is sort of how it goes for me.   \n   \n-- K.\n\n"
    },
    {
      "time": "23 May 2004 — 7:25pm",
      "content": "Maybe I am crazy\n\n"
    },
    {
      "time": "23 May 2004 — 7:28pm",
      "content": "Whoops, I am sorry. I got carried away with that previous post. I should have kept it to the topic but I strayed into stream-of-conciousness babble.   \n   \nChris\n\n"
    },
    {
      "time": "24 May 2004 — 5:50am",
      "content": "\\> But while I'm at it, I will mention one pet peeve about the FLab metrics window.   \n\\> Because the data readout for the metrics is at the top of the window, when I   \n\\> want to toggle kerning on and off to compare the effect of kerning, the preview   \n\\> jumps up and down -- which completely defeats the ability to compare the effect.   \n   \n\\> Does this make sense? Does anyone else experience this and does it bug them?   \n   \nYes! So much so that I've stopped comparing them. Not good.   \n   \nIt's almost as cumbersome as the keystroke for toggling through   \na list of kerning pairs. Apple/Page Up + Page Down.   \nOr Option/4 for the Measurement tool...   \nI'll stop.\n\n"
    },
    {
      "time": "24 May 2004 — 6:06am",
      "content": "Ah yes, the measurement tool -- another pet peeve, and a reason I stay comfortably ensconced in Fog. Fog's constant display of the relative distance between the cursor and a selected point is an important convenience, one that I sorely (and cursedly) miss whenever I am in FLab. Really slows me down.   \n   \nDoes anyone else miss this?   \n   \nYuri, how hard would it be to add this info to the data bar in the glyph window?   \n   \nSorry. Don't mean to turn this into a FLab pet peeve thread.   \n   \n-- K.\n\n"
    },
    {
      "time": "24 May 2004 — 8:37pm",
      "content": "Yuri, one thing that does strike me as perhaps being useful would be a 'smart' palette or ghost layers of related glyphs and glyph peices.   \n   \nI usually build my h, n, and r together, so it would make sense that I can quickly see an onionskin of them behind what I'm working on OR have the peices available to me to construct that glyph.   \n   \nLeslie Cabarga illustrates this point quite nicely in his Font book.   \n   \nStuart :D\n\n"
    },
    {
      "time": "24 May 2004 — 8:47pm",
      "content": "That's called onionskin, a classic technique in 2D/cel animation.   \n   \nhhp\n\n"
    },
    {
      "time": "25 May 2004 — 4:52pm",
      "content": "Stuart:   \ngood idea, I will look into it. Can you send me a sample list of \"related\" glyph groups, for LC and UC, Latin script. I only afraid that display of more than one outline will slow down rendering and editing, but you can always get faster pc :-)   \n   \nKent:   \nOK, it will measure distance (direct and h-v) and angle from the \"active\" node or single selected node to the \"free\" cursor, OK?   \n   \nEric:   \nOK, I'll try to do something with \"jumping lines\" in the new Metrics window.   \n   \nI'd recommend to leave this thread with FL-related questions, it looks to be offtopic here.\n\n"
    },
    {
      "time": "26 May 2004 — 5:55am",
      "content": "_\\>OK, it will measure distance (direct and h-v) and angle from the \"active\" node or single selected node to the \"free\" cursor, OK?_    \n   \nYuri, this sounds perfect. So we'd have : cursor x,y | selected node x,y | distance from selected node to cursor x,y | distance from node to cursor direct measure | angle from node to cursor. Great!   \n   \n_\\>I'd recommend to leave this thread with FL-related questions, it looks to be offtopic here._   \n   \nYes, you're right. I'll stop now.   \n   \nThanks.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "26 May 2004 — 7:22am",
      "content": "Before we end this discussion, I'll add this since it is significant to our discussion regarding drawing glyphs and is on topic.   \n   \nOn page 215 of Leslie's Logo and Lettering Bible, at the bottom of the page is a fantastic description called Shape groups which refers to related glyph forms that share common elements.   \n   \nWith respect to Leslie I will leave you with that information to look up on your own. Yuri, I will ask Leslie for permission to send you a scan of the page to define exactly what I'm referring to.   \n   \nBest,   \nStuart :D\n\n"
    },
    {
      "time": "17 Jun 2004 — 10:45pm",
      "content": "I'm nominating this thread as one of the best so far this year.\n\n"
    }
  ]
}
