{
  "id": "48233",
  "title": "Public apology & gratitude",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "About a year ago I made a comment in one of these nodes about how the world doesn’t really need any more type designers, that there are plenty of excellent typefaces to go around, and way to many crappy ones littering our culture.\n\nToday, my boss told me that I could shop for some type to use in some posters rather than go with the Marker Felt that we had handy in our type library. Dream come true. So I went shopping. It started here, with a search for the classic Mr. Dom Casual, which took me to [this node](http://web.archive.org/web/20081122110041/http:/typophile.com/node/19380).\n\nI honestly cannot believe how many incredible, beautiful typefaces I just looked at through the links provided there. I’m in awe. The people who create these things are obviously incredibly talented, well-studied, and rehearsed; and I imagine they come from all walks of life...the last thing I want to do is stifle the next up-and-comer. If that’s you, pay attention to these people and follow your dreams.\n\nThank you all for giving people like me the tools we need to make the world a more beautiful place.\n\n [‹ \"oz.\" question](http://web.archive.org/web/20081122110041/http:/www.typophile.com/node/48120 \"Go to previous forum topic\") [Election year pangram ready for test drive! ›](http://web.archive.org/web/20081122110041/http:/www.typophile.com/node/48253 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122110041/http://www.typophile.com/user/18852\" title=\"View user profile.\">Koppa</a>",
  "time": "<br>",
  "uid": "18852",
  "comments": [
    {
      "time": " 8.Aug.2008 8.28pm",
      "content": "Thanks for posting this.\n\n"
    },
    {
      "time": " 8.Aug.2008 9.08pm",
      "content": "You can also try [Letterhead](http://web.archive.org/web/20081122110041/http:/www.letterheadfonts.com/), [Blambot](http://web.archive.org/web/20081122110041/http:/www.blambot.com/fonts.shtml) and [Comicraft](http://web.archive.org/web/20081122110041/http:/www.comicbookfonts.com/).\n\n"
    },
    {
      "time": " 8.Aug.2008 9.15pm",
      "content": "<cite>Thank you all for giving people like me the tools we need to make the world a more beautiful place.</cite>\n\nWell said.\n\n"
    },
    {
      "time": " 9.Aug.2008 12.03am",
      "content": "Though you could also have checked the new typefaces a little bit before your boss orderered you to do so, a year is a hell lot of time.\n\nbut hey! better late than never.\n\ndr\n\n"
    },
    {
      "time": " 11.Aug.2008 8.53am",
      "content": "\\> <cite>You could also have checked the new typefaces a little bit</cite>\n\nWouldn’t have mattered much at the time, trust me. As a department, we had some things to work through. But things are changing a little bit around here, for the better. That patience...she’s frustrating sometimes, but always comes through in the end.\n\n"
    }
  ]
}
