{
  "id": "48235",
  "title": "Bounce brand refresh",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "There is a [nice blog post](http://web.archive.org/web/20081122060749/http:/www.underconsideration.com/brandnew/archives/more_bounce_for_bounce.php) over at [Under Consideration](http://web.archive.org/web/20081122060749/http:/www.typophile.com/wiki/Under%252BConsideration), on the latest brand update for Bounce.\n\n ![](http://web.archive.org/web/20081122060749im_/http:/www.typophile.com/files/bounce_5130.png)\n\nMy opinion is that they got a little too gimmicky with the word mark, literally making the letters appear to bounce. The “un” ligature seems clever, but is poorly executed and I question the added dimension by hiding part of a letter “o” behind the “e,” creating a “c.” It still reads as an “o” and the more I look at it, the worse it seems to get.\n\nI can imagine the discussion with the executive stakeholders now, “OMG, I love it! The letters are bouncing their way right into the dryer!” “The ’s’ shape the ’u’ and the ’n’ creates really makes me feel like I want to dry some clothes, IMMEDIATELY!” “Women across the country are going to just die for this logo. The dryer sheets will literally Bounce right into their shopping carts!”\n\nI think they certainly headed in the right direction with the overall feeling the brand exihibits. It is bright, clean and still very recognizable as the same ole’ dryer sheets that we know and love. I appreciate the expanded brand palette used in their packaging and think they should consider pushing these new colors across the brand, especially on the site, although the site is a whole discussion in itself because it is [awfully dreadful](http://web.archive.org/web/20081122060749/http:/www.bouncesheets.com/en_US/index.jsp) on many levels.\n\nWhat does everyone think? Discuss.\n\n [‹ I need help with Historical and Conempoaray Fonts.](http://web.archive.org/web/20081122060749/http:/www.typophile.com/node/47931 \"Go to previous forum topic\") [Favorite J ›](http://web.archive.org/web/20081122060749/http:/www.typophile.com/node/48225 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122060749/http://www.typophile.com/user/111\" title=\"View user profile.\">Zara Evens</a>",
  "time": "<br>",
  "uid": "111",
  "comments": [
    {
      "time": " 8.Aug.2008 4.07pm",
      "content": "I saw this over there earlier too, and I have to say I think they sacrificed some legibility on the “ce”.\n\nOtherwise, it is in the normal garish nature of cleaning product packaging design.\n\n"
    },
    {
      "time": " 8.Aug.2008 4.41pm",
      "content": "oooh, that c-e looks like a mistake.\n\nmaybe Vault was done by the same firm?\n\n ![](http://web.archive.org/web/20081122060749im_/http:/www.typophile.com/files/2006220164960_4657.vault.jpg)\n\n"
    },
    {
      "time": " 8.Aug.2008 7.29pm",
      "content": "I agree that the lettering could have been worked a bit more. Maybe some Omnes style could have given a softness to the letters. The contrast surrounding the word has been reduced, which really emphasizes the sky photography.\n\nI resort to the multi-dimensional outline style on packages and the halftone dot art. In this case a bit of the blue in the outline might have made the name pop a bit more on the shelf.\n\nThe photography and the incorporation of the vector masks to marry the photo with the rest of the package works well.\n\n"
    },
    {
      "time": " 8.Aug.2008 8.29pm",
      "content": "Looks like a mashup of tired ideas I’ve already seen a million times, mostly in the stock illustration section of iStock. The circles gimmick has been old for a while, the same goes for the halftone trick; I can find both of them all over logo compilation books from the last few years. The wordmark is hackneyed and clever for the sake of being clever. The entire design will get dumped in a year or two when it gets to be painfully outdated and the old logo will be revived by someone who understands brand equity better than whoever did this one.\n\n"
    }
  ]
}
