{
  "id": "48242",
  "title": "How to use Avant Garde ligatures?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Lubalin always felt the ligatures of Avant Garde were misused, but I've not found any instructions or guidance for using them properly. Does anyone have any suggestions?\n\n",
  "author": "pdxuser",
  "time": "8 Aug 2008 — 5:40pm",
  "uid": "15738",
  "comments": [
    {
      "time": "8 Aug 2008 — 11:44pm",
      "content": "[Alex White on Herb Lubalin's Avant Garde](http://web.archive.org/web/20121231002949/http:/www.graphic-design.com/Type/Avant/Avant2.html)\n\nGoogle is your friend. :-)\n\n"
    },
    {
      "time": "9 Aug 2008 — 12:16am",
      "content": "Also, I would say that if you are a truely good designer with a correct connexion between your eyes and your brain, you should be able to use these ligatures well enough without reading any \"instructions\".\n\nThis being said, I noticed something wrong in the text you mentioned above:\n\n\"Avant Garde -- the typeface -- was born as a logo for a new magazine of the same name in the mid-60s. Ralph Ginzburg collaborated with Herb Lubalin (pronounced \"Loo-ba-lin\") on four magazines, of which Avant Garde was their second\"\n\n\\> not true, Avant-Garde (1968-1971, so a little bit more end of sixties than mid-sixties) was the third of 3, coming after Eros (1962-1963) and Fact (1964-1967).\n\nAnd I am quite surprised to see this text being proposed as an answer to a question that is \"how to correctly use Avant-Garde's ligatures\", because in this essay the author very clearly explains that Avant-garde is ugly and too much linked with the sixties to be used today in another goal than nostalgia. At the end he actually proposes to use Franklin Gothic instead... Apart from the historical background which proves interesting when true, this text is, imho, a crappy one.\n\ndr\n\n"
    },
    {
      "time": "9 Aug 2008 — 7:25am",
      "content": "David, you're right -- the text I linked to does not directly answer the original question! However, it does have a telling remark from Ed Benguiat:\n\n\"The only place Avant Garde looks good is in the words Avant Garde. Everybody ruins it. They lean the letters the wrong way.\"\n\nI think that statement _does_ partially answer the question, because it gives a clue as to what the wrong use is.\n\n"
    },
    {
      "time": "13 Aug 2008 — 6:27pm",
      "content": "I think it would be great if sincere questions on the board were NOT met with snide comments that imply that the questioner does not have \"a correct connection between his eyes and his brain.\"  \nAlso, referring to someone else's reading suggestion as \"crappy\" is too juvenile for any kind of professional discourse.\n\n"
    },
    {
      "time": "13 Aug 2008 — 8:29pm",
      "content": " ![](http://web.archive.org/web/20121231002949im_/http:/typophile.com/files/AG_5459.png)\n  \nLubalin used the ligatures to achieve super-tightfitted, squared-off layouts, not just for the frisson of their strange letter forms--he would have considered that to be misuse. \n"
    },
    {
      "time": "14 Aug 2008 — 12:53am",
      "content": "Hey Brooklyn Rob,\n\nLet me make a few things clear: I, like anyone else on this forum, including you, am quite free to say what I want, and that's nice. I agree with you on the fact that I sometimes tend to use ways of saying stuff which might look rude, for I speak this way in my mothertongue (french) and I don't use smileys everywhere, but what can I do. I guess only extremely susceptible people take these comments out of any irony or with a sweet distance. I of course didn't mean to be disrespectful, but I guess I was making a little fun in order to state (seriously this time) that in my opinion, if you need a booklet in order to use correctly a typeface, then it's far much better not to use this typeface.\n\nRegarding this text, I knew it before, because I did a lot of research for my upcoming book, including research about Avant-Garde Gothic. I think this text is crappy, because it clearly tells people \"don't use this font\" (at least for modern, up to date design). And, again in my opinion, that's a shame, because this font is really beautiful when correctly used (I'm talking only about the capitals here). Ed Benguiat was, in my opinion, very stupid when he said that this typeface looked only nice in the Avant-Garde logo. Herb Lubalin made wonderful covers (including the beautiful example posted by Nick), he also sent a congratulations note to an agency in the seventies who made a real nice use of the ligatures in an Audi advertisement, and if you just look around a little right now, you'll see plenty of great works set in Avant-Garde and full of ligatures. I'm sorry if the use of \"crappy\" offended you enough to post a comment regarding my youth-speaking.\n\nNuff said,  \ndr\n\n"
    }
  ]
}
