{
  "id": "48249",
  "title": "Embedding Fonts",
  "forum": "rajadain's blog",
  "tags": [

  ],
  "content": "One of the candidate ideas for next semester’s project was to develop an online musical notation tool which people could use to write compositions, and get an output. The catch is, I don’t want to part with my font (at least not till I’ve figured out the litigation involved in copyrighting and/or patenting a font (is that even allowed?)).\n\nYesterday, I received a shock when it was announced that we have to submit a project THIS semester as well. So, this being the only worthwhile idea in my head, I’ve decided to expedite my grand design.\n\nAs I understand it, font-embedding is possible in Silverlight. While Flex would probably be a better option (since more people have Adobe’s Flash player than Microsoft’s Silverlight plugin, about 50,000 times more people...), I’m faced with two issues:\n\n1. I don’t know scratch about Flex. I used to work with Macromedia’s good ol’ Flash, but was never a hard core UI scripter. And\n2. Silverlight development tools are free (like the VS 2008 Express editions). While I may build stuff on evaluation versions of Flex, I’m not sure whether it would be legal to publish the work on the web.\n\nThere may be other options that I may be unaware of. Although I’m not sure myself, but I suspect that there would probably be a way of using AJAX and doing it, making it truly universal (jerks with no JS browsers do not belong to this universe...)\n\nSo, having been patient enough to hear all of my rambling reasons and quibbles, I now present to you with my problem: the output. Lets assume that I have built an application using whatever technology that allows people to type out musical compositions using my font without having actually downloaded the font file (or at least not that they know of), what can I do to provide them with proper output? Like a printout, say?\n\nThe obvious answer is to somehow generate a PDF dynamically (with the site logo and copyright notice, of course), which has THEIR composition that THEY typed in MY font. Since PDF also supports glyph embedding, they should be able to view it, print it, email it and have a ball with it if that’s what they want. But there may be other ways as well. Maybe I ought to look into the new DeJaView format that’s making the rounds of the net these days.\n\nI’m not sure how to implement this last part. At the moment, all this is speculation. But I do not expect to face problems in the former sequence. If there are any other options, maybe in the OpenSource realm or elsewhere, please do suggest. Since I have not committed to any particular platform right now, I have the luxury of choice.\n\n",
  "author": "<a href=\"/web/20081122111530/http://www.typophile.com/user/31647\" title=\"View user profile.\">rajadain</a>",
  "time": "<br>",
  "uid": "31647",
  "comments": [
    {
      "time": " 9.Aug.2008 11.55am",
      "content": "I’m pretty sure you can create a pdf dynamically with PHP.\n\n"
    },
    {
      "time": " 10.Aug.2008 12.55am",
      "content": "PHP being a server side tool ought to be able to generate a PDF having embedded my font (which is stored on the server). Thanks frode, really appreciate it. I’ll look into it immediately.\n\nIf there are any other suggestions, I am all ears. Even about the first part. Also, if someone knows of such an implementation already in existence, please do share it: I would like to visit it and get an idea...\n\n"
    },
    {
      "time": " 10.Aug.2008 11.56pm",
      "content": "If you would like to learn about font embedding issues on the web, you should read these threads on the subject:\n\n[http://typophile.com/node/47629](http://web.archive.org/web/20081122111530/http:/typophile.com/node/47629 \"http://typophile.com/node/47629\")  \n [http://typophile.com/node/46896](http://web.archive.org/web/20081122111530/http:/typophile.com/node/46896 \"http://typophile.com/node/46896\")\n\n"
    },
    {
      "time": " 11.Aug.2008 4.24pm",
      "content": "¡Handpicked!\n\n"
    }
  ]
}
