{
  "id": "48247",
  "title": "Confused about ITC Highlander",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I want to use ITC Highlander bold italic in a certain design. The Linotype site offers two versions called:\n\n- [ITC Highlander® Bold Italic](http://web.archive.org/web/20081122072801/http:/www.linotype.com/13723/itchighlanderbolditalic-font.html)\n- [ITC Highlander® by ITC Bold Italic](http://web.archive.org/web/20081122072801/http:/www.linotype.com/187757/itchighlanderbyitcbolditalic-font.html)\n\nI’ve been trying to understand the difference. I can’t see any by just looking at the Linotype web site (PDF samples, create samples). But in the Linotype FontExplorer application, the fonts look distinct, as shown below.\n\nAny ideas what’s going on?\n\n ![](http://web.archive.org/web/20081122072801im_/http:/www.typophile.com/files/highlander_vs_highlander_5633.png)\n\n [‹ \"Untitled\" by Joshua Darden](http://web.archive.org/web/20081122072801/http:/www.typophile.com/node/37551 \"Go to previous forum topic\") [Font Conference (funny video) ›](http://web.archive.org/web/20081122072801/http:/www.typophile.com/node/47655 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122072801/http://www.typophile.com/user/35080\" title=\"View user profile.\">thefsb</a>",
  "time": "<br>",
  "uid": "35080",
  "comments": [
    {
      "time": " 9.Aug.2008 8.01am",
      "content": "There are some slight differences I can see off hand... The _m, p, a, i, k_ actually there is loads of differnces... they are just slight!\n\n"
    },
    {
      "time": " 9.Aug.2008 8.17am",
      "content": "if you open two tabs and flick in between them you can see the differnces! haha! :)\n\n"
    },
    {
      "time": " 9.Aug.2008 8.17am",
      "content": "Yes, big differences between the fonts as shown in the FontExplorer screenshot.\n\nBut on Linotype’s web site (I provided links above) I can’t see the differences. Both fonts look like the “by ITC” version in FontExplorer. I’m not sure what to trust.\n\n"
    },
    {
      "time": " 9.Aug.2008 8.22am",
      "content": "The second one seems to have better hinting. I don’t think the jumpiness in the first one is intentional or part of the design.\n\n"
    },
    {
      "time": " 10.Aug.2008 3.17pm",
      "content": "Have the GX extensions been released in some other format?\n\n"
    },
    {
      "time": " 11.Aug.2008 6.39pm",
      "content": "This ’Q’ is so different, when you have eyes so sensitive like me to nuances of types it gives me sharp pain in the eye. Agh! As is also lowercase ’o’ and small serifs of feet of ’h’, ’m’, ’n’, and ’t’. Overall font ITC Highlander® by ITC Bold Italic is squashed in vertical. Have you heard saying I am sharp like knife!\n\n"
    },
    {
      "time": " 11.Aug.2008 8.50pm",
      "content": "Just to be clear: The dissimilarities between the two samples are most likely due to screen rendering, as affected by differences in hinting, not design differences. I would bet that if you output both versions on a high res device, the fonts would look virtually identical.\n\nHinting purposely distorts the letter shapes, usually to make the font appear more uniform at low resolution (squashed, unfortunately, in this particular case). But if it’s done incorrectly, for instance if the alignment zones are set improperly, it can have the opposite effect and make the letter shapes appear more irregular than they actually are, which is what I think we are seeing in the top sample.\n\n"
    },
    {
      "time": " 11.Aug.2008 8.59pm",
      "content": "I would like to make bet of ¥1000 with you Mr. Mark that you are wrong. This hinting at size show will not make such dramatic changes to this “Q”. I pity you fool. Sharp\n\n"
    },
    {
      "time": " 11.Aug.2008 9.53pm",
      "content": "Mark is right, the typefaces aren’t different, it’s the rasterizer. There are a number of different rasterizers used for type viewers. Look at some other typefaces you are familiar with, in various viewers, to see the different rasterizing styles. Some are very intelligent and some don’t do a very good job. Look at the same products at a different website, for example. It may also have to do with the outline format; OT fonts can have PS or TT outlines.\n\nBut Mark, maybe you should take the bet, you could buy 3 coffees with that $9!\n\n"
    },
    {
      "time": " 15.Aug.2008 8.21pm",
      "content": "But this is so skewed i am right i am sure! crossgrove you make many foolish postings.\n\n"
    },
    {
      "time": " 16.Aug.2008 1.43pm",
      "content": "Perhaps that is true, Masakuni, but I must defend my duenna on this occasion. Highlander is particularly hard to hint. And please consider the courtesy due to my duenna on account of his great age and esteemed position. Annata no tei nei wa dane desu!\n\n"
    }
  ]
}
