{
  "id": "48260",
  "title": "Antique typewriter font",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "This font is a real old font from a typewriter - then copied/reproduced. Probably 40-50 years old [I think]. I can scan & submit more samples if needed. Any help identifying or approximating this font is appreciated. The end result does not need to look dirty/typewritten/reproduced like the sample - the clean, modern equivalent would actually be preferable.\n\n ![](http://web.archive.org/web/20120913062109im_/http:/typophile.com/files/typewriter_font_sample_4313.png)\n\nThanks for your help.\n\n",
  "author": "luciddream",
  "time": "9 Aug 2008 — 9:51pm",
  "uid": "35113",
  "comments": [
    {
      "time": "10 Aug 2008 — 4:35am",
      "content": "I don't think anyone could give you a name of a typeface that would match exactly just suggestions, so here a view fonts similar to [American typewriter.](http://web.archive.org/web/20120913062109/http:/www.identifont.com/find?similar=american+typewriter&q=Go) You might just find one you like yourself!\n\n"
    },
    {
      "time": "10 Aug 2008 — 4:49am",
      "content": "The a and the g remind me of Courier, but your sample is not monospaced. There were IBM typewriters that could use proportional fonts, but I don't know if a \"Courier proportional\" typeface existed.\n\n"
    },
    {
      "time": "10 Aug 2008 — 3:15pm",
      "content": "Thanks for the thoughts - very appreciated. The g and a are what caught my [very untrained] attention too. Most typewriter type fonts use a double story g - which I find very distracting - barf.\n\nI was going to ask about the proportional vs not - thanks for letting me know about that - and the IBM part too. A big help.\n\nIf you put the likely time frame and the proportional bit together you would end up with perhaps an IBM Executive typewriter:  \n [http://amygdalagf.blogspot.com/2004/09/ibm-executive-typewriters.html](http://web.archive.org/web/20120913062109/http:/amygdalagf.blogspot.com/2004/09/ibm-executive-typewriters.html)\n\nThe picture from the above page/link is very poor quality. I would say that this might be IBM Secretarial Type but the lowercase y does not seem to match. It looks pretty close though.\n\n ![](http://web.archive.org/web/20120913062109im_/http:/typophile.com/files/tpyewriter_sample_2_3887.png)\n\nAre there any resources that you may know about for the various IBM types that have been made into current fonts? Or anywhere I might find good information about the various IBM types? There were gazillions of these typewriters made [Executive & Selectric] - they were the most popular typewriters on earth with gazillions x gazillions of pages of documents typed on these things. I would think that someone would have taken it on to recreate these types? Or am I just talking crazy analog? Am I in the wrong forum?\n\n"
    },
    {
      "time": "10 Aug 2008 — 4:12pm",
      "content": "This is what i got when I put IBM into font font which is kind of interesting, It looks like Courier was actually designed specifically for the Selectric typewriter series... It also showed _Letter Gothic_ as a specific typeface designed for the Selectric series! (maybe you all ready knew this from your research)\n\n_Courier draw line – Designed as a typewriter face for IBM, Courier was redrawn by Adrian Frutiger for the IBM Selectric series. Courier is a typical fixed pitch design, monotone in weight and slab serif in concept. The Courier font is used to emulate typewriter output for reports, tabular work and technical documentation._\n\n"
    },
    {
      "time": "10 Aug 2008 — 4:31pm",
      "content": "Oh it wouldn't be a bad idea to start a new thread in the general discussions to see if anyone else and some good information.\n\n"
    },
    {
      "time": "10 Aug 2008 — 6:11pm",
      "content": "Also a unique feature are the middle humps of the W and w go all the way to the top.\n\n ![](http://web.archive.org/web/20120913062109im_/http:/typophile.com/files/tpyewriter_sample_WHISKEY_6310.png)\n\nIn just about all the examples of Courier and Letter Gothic I've seen the middle hump only goes part way up.\n\n"
    },
    {
      "time": "11 Aug 2008 — 3:58pm",
      "content": "I can definitely say that none of the typeface samples listed here so far is IBM Secretarial (public release 1939), a typeface I know well and really love and which I have worked on digitizing. If the typewriter division is still going at Lexmark, they would be able to help identify the typeface. Otherwise, email me and I will try to look up some of the old IBM typeface designers who helped me with Bud Kettler's bio for the Courier page at graphos.org - - which is now down but which I hope to have up again in a few weeks. Secretarial is a simple 5-unit slab, very similar to faces like Rockwell.\n\nWith regard to the Dan Rather/G Bush letter, one of these ex-IBM/Lexmark/ people, examining the admittedly dreadful quality fax that was made available to the public, came to the conclusion that the typeface used must have been from the IBM Executive that had Times -- this was based, I think, on the eccentric height of the hyphen. And there were known sales of IBM Executive typewriters to that office. But with that lousy fax, who could really tell? Will anyone ever get to the bottom of that freakish story?\n\n"
    },
    {
      "time": "12 Aug 2008 — 5:54pm",
      "content": "Just a couple of other things: Courier was not designed for the Selectric, but rather well before; and I don't know of a proportional variation.\n\nFrutiger DID NOT WORK ON ANY VERSION OF COURIER. This was an error on the Agfa/Monotype website that should long ago have been corrected. There is no basis for this claim whatever. Frutiger however did work on some fonts for the Selectric Composer:\n\n\"Bud [Kettler] worked with Adrian Frutiger on fonts for the IBM Selectric Composer. Frutiger was very good but Bud had to help him through some technical problems. The upper case M and W of Frutiger's design were too bold for the limited impact from the type element. Bud decided he could cut down on the surface area without cutting down on the surface size. Bud did this by redesigning the M and W with a series of lines that would resemble a plowed field in a shallow pyramid pattern. The ribbon that was impacted by the modified M and W would spread across the furrows on the face of the characters and make them appear on paper as solid characters.\"\n\n(from my temporarily down 'graphos.org' page on Bud Kettler; reminiscence by Paul Rainey, one of Bud Kettler's colleagues on the IBM/Lexmark type team)\n\nI'm going to suggest to Lexmark that they do an IBM/Lexmark typewriter typeface ID page. They have all that info on file.\n\n"
    },
    {
      "time": "2 May 2010 — 6:47pm",
      "content": "There is a typestyle for the IBM Executive typewriter called Arcadia. This could be what the sample shows.\n\n"
    }
  ]
}
