{
  "id": "48274",
  "title": "Lead type as luggage?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m about 500 miles from home and just picked up some 48 and 60 point letters along with a monotype matrix. I’m going to have to get it home, and I don’t want to pay to mail this heavy stuff. I can put most of it in a bag and check it to get the stuff home, but I expect that the airline and the TSA will frown on me taking lead type on a plane, checked or carry-on. Does anyone have experience flying with lead type?\n\n [‹ Looking for Type Wallpaper](http://web.archive.org/web/20081122065828/http:/www.typophile.com/node/46940 \"Go to previous forum topic\") [What does \"office\" mean? ›](http://web.archive.org/web/20081122065828/http:/www.typophile.com/node/48250 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122065828/http://www.typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 10.Aug.2008 5.17pm",
      "content": "Everyone that went to TypeCon got some lead type. If its a large amount they may frown, but I think its legal. They will catch it at the gate and inspect, but shouldn’t be a problem as long as the overall weight is OK.\n\n"
    },
    {
      "time": " 10.Aug.2008 6.41pm",
      "content": "If you’re checking it you might want to tape a note to the outside of the bag/box. If it’s in hand luggage you might want to let them know before it goes through the x-ray machine... [http://www.typecon.com/talk.php?id=271](http://web.archive.org/web/20081122065828/http:/www.typecon.com/talk.php?id=271 \"http://www.typecon.com/talk.php?id=271\")\n\n"
    },
    {
      "time": " 11.Aug.2008 6.25am",
      "content": "I can’t imagine why it’d be illegal, but, then again, shampoo is illegal, so who knows?\n\nI think the bigger issue is weight, eh? Might be cheapest/easiest to walk over to a FedEx or UPS store and have it shipped ground freight.\n\n"
    },
    {
      "time": " 11.Aug.2008 6.29am",
      "content": "<cite>I can’t imagine why it’d be illegal</cite>\n\nYou could set a threatening line out of it. With sizes of 48 and 60 pt that would be quite a lethal weapon.\n\n"
    },
    {
      "time": " 11.Aug.2008 7.57am",
      "content": "Coming back from a trip to Seattle/Vancouver in April, I had a bunch of funny metalic things in my hand luggage\\*. Security was visibly uneasy\\*\\*, and they asked me for all the details, but in the end they didn’t take too long to clear it. They actually had a lot more trouble with the bottle of water and the can of ice tea I’d forgotten to “process”. As a security lady at Burbank airport once confided to me: “We hate water.” Feared substance du jour.\n\n\\* [http://www.typophile.com/node/44243](http://web.archive.org/web/20081122065828/http:/www.typophile.com/node/44243 \"http://www.typophile.com/node/44243\")\n\n\\*\\* Being Middle-Eastern-Looking couldn’t have helped.\n\nhhp\n\n"
    },
    {
      "time": " 11.Aug.2008 3.31pm",
      "content": "Once I had a box of pastels. They called me right up when they saw the cylindrical shapes inside a box thru the xRay thing... They will bother you but you can transport that. Just be ready to justify in a slow paced talk :) Have fun . Will take 45 minutes ...\n\n"
    },
    {
      "time": " 13.Aug.2008 6.47am",
      "content": "I had an issue last year with [lead type in my checked baggage.](http://web.archive.org/web/20081122065828/http:/www.helveticafilm.com/newblog/2007/07/26/lead-type-and-homeland-security/) I think the lead tripped a red flag in their x-ray, and they pulled the bag to be opened and hand-inspected, which caused that bag to miss my connecting flight, so the bag was AWOL for a few days. So yes, you can check it, but it may delay that bag.\n\n"
    },
    {
      "time": " 13.Aug.2008 8.53am",
      "content": "I ended up leaving everything in Ohio for a family member to bring down here the next time a trip is made by car. At the end of the day I decided I would be pushing it to try taking 40 pounds of type, two jobsticks, some wood furniture and a monotype matrix with three fonts through airport security.\n\n"
    }
  ]
}
