{
  "id": "48289",
  "title": "design Podcast - what do you listen too?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Am looking at building up a bit more of a library of design related podcasts, hmm well I only actually have one on the list at the moment but wanted to ask what other designers out there listening too.\n\nLooking for both web and print related design\n\n",
  "author": "Monsta",
  "time": "11 Aug 2008 — 3:04am",
  "uid": "34545",
  "comments": [
    {
      "time": "11 Aug 2008 — 7:41am",
      "content": "[Typeradio](http://web.archive.org/web/20130516052701/http:/www.typeradio.org/)!\n\n"
    },
    {
      "time": "11 Aug 2008 — 1:47pm",
      "content": "[www.36point.com](http://web.archive.org/web/20130516052701/http:/www.36point.com/ \"www.36point.com\")\n\nI listen to their podcast mostly due to the fact I know who they are and often have designers on from where I'm located, Omaha.\n\nDesign Observer should do a podcast, that would make me happy.\n\nI'm definitely now going to give Typeradio a listen for the first time.\n\n"
    },
    {
      "time": "11 Aug 2008 — 3:34pm",
      "content": "I second 36point.com, Krebstar. I've never been anywhere near Omaha, but I've listened to these guys' great shows since the very first Be A Design Cast, their old show.\n\n"
    },
    {
      "time": "11 Aug 2008 — 6:31pm",
      "content": "I was going to mention Be A Design Cast/Group, but I figured since it's gone it wasn't worth it. I miss that blog being updated.\n\n"
    },
    {
      "time": "11 Aug 2008 — 6:44pm",
      "content": "I listen to \"What These Bitches Want\" by rapper artist DMX from successful album of 2007 \"The Definition of X: The Pick of the Litter\". There is many inspiration in this aggressive lyrics. Strong for type design work.\n\n"
    },
    {
      "time": "15 Aug 2008 — 8:53am",
      "content": "I think the SVA has an excellent series of podcasts/vidcasts for you to download.\n\n[Clicky for the linky](http://web.archive.org/web/20130516052701/http:/design.schoolofvisualarts.edu/weblog/)\n\n"
    }
  ]
}
