{
  "id": "48303",
  "title": "Poster for client Pet Psychics Inc.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I make poster design for client Pet Psychics Inc. I have nearly finished but I search for fonts and composition advice. I find the flow and feeling appropriate and the essential paws line signify end of poster. Have you an idea? I also find Psychic font appropriate but suggest other font please for all.\n\n ![](http://web.archive.org/web/20140126040352im_/http:/typophile.com/files/PetPsychicPoster_5480.gif)\n\nThank you very much,\n\nGui\n\n",
  "author": "guiyong",
  "time": "11 Aug 2008 — 10:20am",
  "uid": "35223",
  "comments": [
    {
      "time": "11 Aug 2008 — 10:40am",
      "content": "Haha. yess.\n\n"
    },
    {
      "time": "11 Aug 2008 — 10:48am",
      "content": "Can you make suggestion Clifton please?\n\n"
    },
    {
      "time": "11 Aug 2008 — 11:16am",
      "content": "Are you trolling?\n\n"
    },
    {
      "time": "11 Aug 2008 — 11:24am",
      "content": "What is trolling? I am new in this forum. I am looking for Design suggestions for my design.\n\n"
    },
    {
      "time": "11 Aug 2008 — 12:47pm",
      "content": "\\>Are you trolling?\n\nI think that would be a yes.\n\nI hate to break it to you, but your \"client\" is already using your design...\n\n[http://members.shaw.ca/sahara1/pet\\_communicator.htm](http://web.archive.org/web/20140126040352/http:/members.shaw.ca/sahara1/pet_communicator.htm \"http://members.shaw.ca/sahara1/pet\\_communicator.htm\")\n\n"
    },
    {
      "time": "11 Aug 2008 — 12:58pm",
      "content": "I don't think I've ever had more chuckles off Typophiling in one day!\n\n"
    },
    {
      "time": "11 Aug 2008 — 1:11pm",
      "content": "Yes Simon, but we seek to improve this design. That is the purpose of my thread.\n\n"
    },
    {
      "time": "11 Aug 2008 — 1:47pm",
      "content": "\"but we seek to improve this design\"\n\nQuit being a smug show-off. You know the poster is perfect and can't possibly be improved upon. Now you're just rubbing it in our noses.\n\n"
    },
    {
      "time": "11 Aug 2008 — 1:53pm",
      "content": "Thank you Darrel for many kind words, I feel a warm fuzzy feeling. unfortunately I am a perfectionist, i seek only the best.\n\n"
    },
    {
      "time": "11 Aug 2008 — 2:37pm",
      "content": "Why is everyone beating about the bush? The 'design' is awful. Sorry Guiyong if you thing I'm being rude, but honesty's the best policy.\n\nJH\n\n"
    },
    {
      "time": "11 Aug 2008 — 2:44pm",
      "content": "It's all about the mystery of Gui Yong at this point. A master of comedy or just an innocent, striving amateur?\n\nI think he's got us all befuddled!\n\n"
    },
    {
      "time": "11 Aug 2008 — 8:30pm",
      "content": "Clearly Simon you are a fool who can not spell and who has little respect for others. You would have found with one simple click that my name is in fact Gui not \"guiyong\" which you have lazily copied from my username. Yes Simon I \"thing\" you are being rude calling my design awful. I would take your comments to heart but unfortunately for you Simon I discovered this skeleton in your closet. ( [WARNING terrible graphics may hurt your eyes](http://web.archive.org/web/20140126040352/http:/members.tripod.com/~notts_derby/index_sub.htm)) It appears that you were responsible for this abomination, you are credited with designing, editing, researching and providing photography no less!\n\nThis is an _awful_ design my friend.\n\n ![](http://web.archive.org/web/20140126040352im_/http:/typophile.com/files/magicbus_6011.gif)\n\n"
    },
    {
      "time": "11 Aug 2008 — 9:42pm",
      "content": "Trolltastic!\n\n"
    },
    {
      "time": "12 Aug 2008 — 1:11am",
      "content": "ooh he got me there! I'm so hurt. If you ask for an opinion and get one, don't be surprised. Oh and by the way Gui Yong (is that ok? Have I spelt your name correctly this time?), your link points to a Simon Bramley - That's not me. I'm Simon T Bramley and I don't live in either Derby or Nottingham, so you too should get it right if you're gonna criticise. I'm also not 'your friend'. Now everybody, have I fallen into his trap and playing his game? If so, I'll stop right here.\n\nJH\n\n"
    },
    {
      "time": "12 Aug 2008 — 6:39am",
      "content": "\\>Now everybody, have I fallen into his trap and playing his game? If so, I’ll stop right here.\n\nThe standard advice is “Don’t feed the Troll” – even when it’s fun. :-(\n\n"
    },
    {
      "time": "12 Aug 2008 — 7:01am",
      "content": "uh...jazz...put on your sarcasm glasses and re-read the thread. ;o)\n\n"
    },
    {
      "time": "12 Aug 2008 — 7:07am",
      "content": "Got it!\n\nJH\n\n"
    },
    {
      "time": "12 Aug 2008 — 11:17am",
      "content": "The pawprints are a nice touch, Gui.  \nThose Catbats/Dingdogs fonts sure come in handy.\n\n"
    },
    {
      "time": "12 Aug 2008 — 12:03pm",
      "content": "Has anybody else actually read the flyer? Gad...I just keep on giggling over here. Too much. Regardless of whether or not Gui's for real, this flyer apparently is, according to the link in about the 5th post.\n\n"
    },
    {
      "time": "12 Aug 2008 — 12:10pm",
      "content": "Ms Exodus does appear to be a real live Canadian psychic/entertainer, and not the figment of an imaginary graphic designer's imaginary imagination.\n\nAs for the image the Internet Archive dates the page back to 2005, so it's been around a while. Not to say that things like this couldn't be created today.\n\n"
    },
    {
      "time": "12 Aug 2008 — 1:28pm",
      "content": "Does this lady do paw readings too? (sorry couldn't help myself)\n\nI say scrap all the images and do a paw with lines going across it. Simple and to the point, regardless if this is a joke or not.\n\n"
    },
    {
      "time": "12 Aug 2008 — 3:31pm",
      "content": "I think it would be much better if you could condense all those points into a pie chart.\n\n"
    },
    {
      "time": "13 Aug 2008 — 6:00am",
      "content": "Why did you use al those underlining? What is the purpose of it?  \nThe same question for the bordersstyles used around the images.  \nAnd is there a concept?\n\nThere is so much going on, try to get some rest in it.\n\n"
    },
    {
      "time": "13 Aug 2008 — 8:51am",
      "content": "One essential element you are forgetting is pet testimonials.\n\n"
    },
    {
      "time": "13 Aug 2008 — 9:36am",
      "content": "The application of the bevel/fade on the images is inconsistent. The image of the proprietress needs one too.\n\n"
    },
    {
      "time": "13 Aug 2008 — 9:44am",
      "content": "The photos need more vignetting...\n\n(Hi Haley.)\n\n"
    },
    {
      "time": "13 Aug 2008 — 9:59am",
      "content": "Why do psychics need to advertise?\n\n"
    },
    {
      "time": "13 Aug 2008 — 10:19am",
      "content": " ![](http://web.archive.org/web/20140126040352im_/http:/typophile.com/files/kate_3884.png)\n\n"
    },
    {
      "time": "13 Aug 2008 — 11:16am",
      "content": "Haha! Doh!! by leaving a post am I indeed contributing to this now pointless thread?\n\nJH\n\n"
    },
    {
      "time": "13 Aug 2008 — 11:16am",
      "content": "double post.\n\n"
    },
    {
      "time": "13 Aug 2008 — 11:21am",
      "content": "This is all too much miscommunication and confusion for me.\n\nAnybody know someone who can help clear it up?\n\n"
    },
    {
      "time": "14 Aug 2008 — 2:18am",
      "content": "Koppa, spread something gooy on your head and relax, you will feel better soon and all things will become clear.\n\n"
    },
    {
      "time": "14 Aug 2008 — 8:10am",
      "content": "Oooooooh.\n\nAh.\n\nOh, yes. I see.\n\nMuch better.\n\nThank you.\n\n"
    },
    {
      "time": "14 Aug 2008 — 11:50am",
      "content": "Sweet thread.\n\n"
    },
    {
      "time": "14 Aug 2008 — 3:33pm",
      "content": "Very entertaining :)\n\n"
    },
    {
      "time": "20 Aug 2008 — 7:36am",
      "content": "Wow that was a good one!\n\n"
    }
  ]
}
