{
  "id": "48304",
  "title": "Help with Font Rendering on Screen",
  "forum": "Build",
  "tags": [
    "General Discussions",
    "Build"
  ],
  "content": "Hello everybody,\n\nI am new to this forum and I have to mention I do not have real knowledge in typography.\n\nI became very interested recently in learning about font rendering on screen (LCD) and I have been trying to find out if there is any method (besides Cleartype) of displaying crisp and good looking fonts on the LCD screens. One aspect that I dislike is the fuzzy appearance of fonts that can be seen for instance even in Acrobat products.\n\nProblem: I am trying to find a way to get fonts to display as sharp as possible on an LCD screen.\n\nQuestion: As I have no experience in this field I would like to get some feedback and expert advice on whether the approach I am using now is worth pursuing.\n\nExamples:\n\n ![](http://web.archive.org/web/20130817190756im_/http:/typophile.com/files/T_2_All_4488.PNG)\n\nThe Above Image shows a piece of text (Pdf File)rendered using:\n\n1) Ghostscript (antialiased)  \n2) Ghostscript (antialiased) + modifications: method 1  \n3) Ghostscript (antialiased) + modifications: method 2  \n4) Adobe Acrobat reader 9\n\nI am aware that the modified versions 2, 3 have some major problems (on some LCD screens there might be some serious color fringes).\n\nNevertheless I would like to get some expert advice on whether the approach 2 or 3 have any chance at improving text appearance or readability. The goal here was to get the text look more crisp (like you see it in print), eliminate unequal widths of font stems and gray shadows for stems.\n\nThank you in advance for any advice.\n\n",
  "author": "pinguin",
  "time": "11 Aug 2008 — 10:33am",
  "uid": "35228",
  "comments": [
    {
      "time": "11 Aug 2008 — 11:20am",
      "content": "2 seems too faint for easy reading, and 3 is too purple. 4 seems clear and well-formed to me. The aliasing in 1 seems a bit random on some of the caps, the two 1's in 1981, the h and u in Thus, etc.\n\n"
    },
    {
      "time": "11 Aug 2008 — 11:25am",
      "content": "\\>I am trying to find a way to get fonts to display as sharp as possible on an LCD screen.\n\nBasically that would be black pixels on white background (or possible vice-versa) with no sub-pixel or grayscale rendering, using the display's native resolution. **Everything** else will produced less sharp type.\n\n"
    },
    {
      "time": "11 Aug 2008 — 12:09pm",
      "content": "Thank you for your comments.\n\nI agree with you Pdxuser. I cannot correct right now the purple on 3), but I tried to make 2) a little bit darker (see the 2b, 2c versions).  \nI also think that Adobe reader has so far the best display although it is still far from what I would like. In any case my problem is that I am stuck with ghostscript output (1) which I am trying to modify to get a crisper font look.\n\nThanks for the comments Sii; What I am trying to do is to reduce the font width as much as possible while still retaining font appearance.\n\nI loaded 2 new image2 for method 2 - darker versions (2b, 2c)\n\n ![](http://web.archive.org/web/20130817190756im_/http:/typophile.com/files/T_2_All_3b_6142.PNG)\n\n"
    },
    {
      "time": "11 Aug 2008 — 12:13pm",
      "content": "\\>Thanks for the comments Sii; What I am trying to do is to reduce the font width as much as possible while still retaining font appearance.\n\n\"Font Appearance\" and \"sharpness\" are pretty much opposite ends of a sliding scale. Assume you're looking for something that's closer to the sharpness end of the scale?\n\n"
    },
    {
      "time": "11 Aug 2008 — 12:59pm",
      "content": "Yes, I want to obtain sharp fonts. More exactly: starting with fonts rendered using standard grayscale antialiasing methods (as for CTR monitors) I want to apply subpixel rendering to improve font sharpness.\n\nI understand that \"font appearance\" and \"sharpness\" are opposite due to limited screen resolution. It might be a matter of personal preference but I like reading sharp and crisp text rather than text that faithfully reproduces font shapes but is diffuse and has gray shadows instead of sharp stems, as it is produced by some current rendering methods.\n\nI start with fonts rendered at 2X dimension and then resize them at their final size using subpixel positioning; image 1) is the one that is modified (a 2x version actually).\n\n"
    },
    {
      "time": "12 Aug 2008 — 9:05am",
      "content": "Have a look at:  \n [http://www.antigrain.com/research/font\\_rasterization/](http://web.archive.org/web/20130817190756/http:/www.antigrain.com/research/font_rasterization/ \"http://www.antigrain.com/research/font\\_rasterization/\")\n\nGreat research, impressive and convincing visual output, and opensource code.\n\nA.\n\n"
    },
    {
      "time": "12 Aug 2008 — 6:59pm",
      "content": "\\> I have been trying to find out if there is any method (besides Cleartype)  \n\\> of displaying crisp and good looking fonts on the LCD screens.\n\nPlease see this:  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20130817190756/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    }
  ]
}
