{
  "id": "48305",
  "title": "Amateur versus professional",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Here is a vague and general question. Please give me any and all opinions. How does one differentiate between amateur and professional fonts? Are amateur fonts free? Reside on a certain web site? Not come from a major type foundry?\n\nFirst throw out some thoughts, then I will elaborate on why I’m asking.\n\nThanks,\n\nTara\n\n [‹ Orthography](http://web.archive.org/web/20081122064135/http:/www.typophile.com/node/48588 \"Go to previous forum topic\") [Type and Design related stuff in NY ›](http://web.archive.org/web/20081122064135/http:/www.typophile.com/node/48504 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122064135/http://www.typophile.com/user/35234\" title=\"View user profile.\">TaraBuehner</a>",
  "time": "<br>",
  "uid": "35234",
  "comments": [
    {
      "time": " 11.Aug.2008 10.53am",
      "content": "I like for you please to elaborate first? There comes many fonts preloaded in your system I have found many more in website [DaFont](http://web.archive.org/web/20081122064135/http:/www.dafont.com/).\n\n"
    },
    {
      "time": " 11.Aug.2008 10.53am",
      "content": "I am sorry for making “double post”\n\n"
    },
    {
      "time": " 11.Aug.2008 12.05pm",
      "content": "I don’t there there are many clear lines between the two. There are plenty of free professional-level fonts to be found all over the web. There are also probably some not-for-free fonts that aren’t very professionally done. I’d say that the majority of free fonts aren’t necessarily “professional,” but that doesn’t mean they are totally unusable.\n\nI think lately, the bar has been raised, and fonts that are truly “professional” tend to come in families of several weights and also include many glyphs that most free fonts don’t.\n\n"
    },
    {
      "time": " 11.Aug.2008 12.10pm",
      "content": "Not all fonts are created equal, and there in lies the difference. Wether it’s poor use of nodes, an overall bad design, or a font that was done but has very limited appeal and usefulness.\n\nAs far as residing at a particular website, daFont carries free fonts, there’s thousands of other sites as well, and some are not always ’free’ but are commercial fonts being pirated under a different name. While places like Myfonts.com carries many quality commercial fonts, it also allows people to submit their work and have it downloadable for free. There are also many professional type designers that choose to run their own shop and sell for themselves, meaning you don’t have to buy through a major foundry, or even a minor one to get professional fonts. You can’t judge quality by price, some accomplished type designers release free faces as an incentive. Even large foundries do this.\n\n"
    },
    {
      "time": " 11.Aug.2008 12.13pm",
      "content": "I think you’re using the term “amateur” in the sporting sense, which does have a pretty strict non-profit (for the players) definition, but such is not so clearly defined in the arts.\n\nFonts are free (no cost) only when their authors or foundries declare them to be so, skill, certification, experience, or establishment notwithstanding.\n\n"
    },
    {
      "time": " 11.Aug.2008 12.18pm",
      "content": "I think it probably has a lot to do with the experience of the designer. My (unreleased) fonts are incredibly amateur, and probably still will be by the time I release them. There are plenty of professional type designers who have gone back and pulled their amateur works from the market. Take a look at the Schwartzco web site; Christian has posted stuff going back to when he was 14 and you can see how one develops to the professional level.\n\n"
    },
    {
      "time": " 11.Aug.2008 1.51pm",
      "content": "“How does one differentiate between amateur and professional fonts?”\n\nUmm...I don’t think you do. They aren’t really adjectives that make a whole lot of sense in the context of typefaces.\n\nIf you’re looking for analogies...maybe buildings would be better. There are well built, sound, strong buildings designed by internationally known architects and then there are falling down shacks built with scraps by transients down by the railroad tracks. One probably took a lot more time and craft to build, probably costs more, and likely has more uses, but both can have character and either might be the right building for the right setting for a particular need.\n\n"
    },
    {
      "time": " 11.Aug.2008 2.21pm",
      "content": "As with any art or craft, some of the best work is done by amateurs, and some of the worst by professionals. And vice versa. I can’t see what difference “type designer” makes as opposed to, say, “playwright,” or “cabinet maker” when it comes to the distinction between amateur and professional.\n\n"
    },
    {
      "time": " 11.Aug.2008 4.30pm",
      "content": "A font is either good or bad.  \nYour decision.\n\n"
    },
    {
      "time": " 12.Aug.2008 1.59pm",
      "content": "OK - interesting answers. I know this was a vague question with no real answers, and so that’s what I got. But it’s interesting.\n\nHere’s the deal. I’m doing research into font preferences. I’m at a step of my research right now where I am trying hard to define “trendy” fonts. It has been suggested to me that perhaps amateur, ephemeral, grunge fonts are trendy by several people. So let me ask one more:\n\nWhat do you think current trends are in type design?\n\n"
    },
    {
      "time": " 12.Aug.2008 2.09pm",
      "content": "“trendy fonts”\n\nHow about: “Someone (else) took a big risk & used (or made) the font (first), it seems to be well received, and not too many people have used it yet. So, if I use it right now, I’ll be thought of as an innovative person.”\n\n’Bout the same as with anything trendy.\n\n"
    },
    {
      "time": " 12.Aug.2008 2.42pm",
      "content": "Are you doing research into what’s trendy, or what people think is trendy?  \nHave you defined what “trendy” means?  \nWithout a statistical basis, your research will be based on hearsay.  \nIf you have a suspicion that people like what’s popular, you are probably right—check it out:  \n [http://www.fastcompany.com/magazine/122/is-the-tipping-point-toast.html](http://web.archive.org/web/20081122064135/http:/www.fastcompany.com/magazine/122/is-the-tipping-point-toast.html \"http://www.fastcompany.com/magazine/122/is-the-tipping-point-toast.html\")\n\n"
    },
    {
      "time": " 12.Aug.2008 2.47pm",
      "content": "“perhaps amateur, ephemeral, grunge fonts”\n\nGrunge is a style. It sounds like you are using ’amateur’ as perhaps a stylistic description?\n\n"
    },
    {
      "time": " 12.Aug.2008 2.52pm",
      "content": "I answered an earlier email from Tara and have been struggling with this a bit. I think what’s being tried here is to compare the fonts traditionally or commonly used in a particular context, with “trendy” fonts. However when I hear trendy I think Gotham, and that’s hardly non-traditional.\n\nOne way of looking at this might be to gauge users perceptions when out of place fonts are used in familiar contexts, maybe a techno font used in place of Helvetica on a tax form, or a script font used on stop sign.\n\n"
    },
    {
      "time": " 12.Aug.2008 2.53pm",
      "content": "Here’s a teaser: In any era, you could say that flashy, crowd-pleasing display typefaces always attract the most intense attention initially, and then after a while the charm rubs off and everyone realizes how limited the uses are for them. A quick, intense period of interest which dies away just in time for the next hot flashy thing. It doesn’t necessarily follow, however, that these are always products of amateurs. Experienced type designers put out any number of styles both utilitarian and showy. But we’ve seen in the last 20 years a flood of inexpert or naive fonts that gained popularity due to their appeal, wide distribution, low price or prominent exposure.\n\nIn other words, don’t discount factors that are completely unrelated to design (price, association, availability). What looks like a trend may just be a relatively interesting, relatively functional free font.\n\n"
    },
    {
      "time": " 12.Aug.2008 5.13pm",
      "content": "To phrase crossgrove’s argument a different way, professionals may design both display faces and text faces, but amateurs are almost always just designing display faces. Of course, there are countless exceptions to this. Take a look at someone like Ale Paul, who almost exclusively designs display scripts, but nobody would argue he’s less than professional. I highly doubt that you’re going to see a multi-weight serifed book face with support for multiple languages posted on dafont anytime soon, though.\n\nThis is a difficult distinction to make in any arts-related field. Lawyers have the bar exam, doctors have residencies, but such a distinction in the arts would be impossible to administer, and would kill innovation. The idea of who’s professional and who’s amateur in type design is often a high-art/low-art distinction, and what associations that person maintains. Pizza Dude would probably be thrown in the low art pile by most designers, but Ed Fella is someone they’d look up to in the design hierarchy. If you just knew Ed Fella by FellaParts and OutWest, without any context of what his work is about, you might lump him in with all the free font creators out there.\n\nAs much as those inside the design world cringe at the sight of all the unnecessary and poorly crafted fonts out there, maybe a font entirely composed of paw prints is the perfect thing for some lady sitting at her PC putting together a newsletter for purebred Beagle enthusiasts. And even if it’s not good for anything else, I don’t think it’s hurting the professionals. It would be like saying that if I recorded myself singing unaccompanied Christmas carols on GarageBand and sold CDRs out the back of my car, I’d be taking income away from Celine Dion.\n\n"
    },
    {
      "time": " 13.Aug.2008 11.37am",
      "content": "Thank you for comments and opinions. Mr. Shinn, thank you for the article. Very interesting.\n\nWell I will give a few more details now. I was reluctant to do so initially, because I thought people may be tempted to critique my method rather than answer my questions.\n\nI am a graduate student of journalism (with an interest in higher education) at South Dakota State University. For my thesis, I am conducting a Q-research study on visual impact of display type (Si - I am pretty sure I’ve narrowed my research down to display only.) Participants will be asked to sort hypothetical textbook pages from “most prefer” to “least prefer.” The hypothetical pages will be of two types: “trendy” and “classic.” I am defining “classic” by those display types most commonly used by textbook designers currently. From what I’ve found thus far, they are mainly Times, Palatino, Univers, Optima, and a couple of others. I am defining “trendy” by, well, that’s what I’m trying to do right now. I have been speaking with various typographers to try and operationalize this variable. Some of the trends agreed upon have been: grunge, ephemera, distressed, sloppiness, etc. Ellen Lupton went as far as to say, “like those marketed by Veer.”\n\nI will choose my fonts, tentatively using some/all/more of the following criteria:\n\nThey have to be on the top-100 most-downloaded list of some kind  \nThey cannot not released by a major foundry ( What do you consider a major foundry? I would include Bitsteam, Linotype, or Monotype.)  \nThey cannot not be script fonts.  \nThey cannot not be novelty fonts (dingbats, for instance, or dog paws.)  \nThey cannot not obviously be based upon a “classic” font.  \nThey must have been released in at least the past five years.  \nAnd, I will use some of my own discretion, based upon the keywords, key themes I am currently gathering from my talks with typographers.\n\nTrends are hard to define, and of course, they change constantly. This particular research was completed back in the 1970’s - but the problem is what those researchers considered to be a “trend” is obviously no longer so. Updated research is needed.\n\nThank you for all your comments.\n\nTara Buehner\n\n"
    },
    {
      "time": " 13.Aug.2008 12.43pm",
      "content": "_Participants will be asked to sort hypothetical textbook pages from “most prefer” to “least prefer.”_\n\nThis has very little to do with whether classic or trendy display type is best for textbooks.  \nIt’s more likely that you will be measuring whether participants identify themsleves as classic or trendy.\n\nWouldn’t it be better to do a split run of textbooks, and have two groups of students with equal abilities use the books, and see whether the group with the classic or those with the trendy type has better grades?\n\nEven then, you wouldn’t be measuring the efficacy of the typefaces, because the best kind of page layout for a classic type is not the same as for a trendy type. So if you optimized the page layout for each to make it appropriate for the typeface, what you would be comparing is trendy page layout versus classic page layout.\n\n ![](http://web.archive.org/web/20081122064135im_/http:/www.typophile.com/files/Brushes_4818.jpg)\n\nAt the moment, your test is like asking participants to look at these toothbrushes and say which they prefer, when it would be better to check with their dentists a year later which group has fewer cavities.\n\n"
    },
    {
      "time": " 13.Aug.2008 2.41pm",
      "content": "“visual impact of display type”...”Participants will be asked to sort hypothetical textbook pages”...”Times, Palatino, Univers, Optima”\n\nI think there’s still some terminology confusion here.\n\nYou say ’display type’. ’display’ usually refers to typefaces specifically designed for large sizes and would be used for things like headlines, signage, posters, etc.\n\n’text’ faces would be what you mention (Times, Palatino, Univers) which are typically used for body text.\n\nYou mentioned ’grunge’ as a style before, and that would be more applicable to display faces.\n\nVeer’s more popular typefaces are typically going to be used as display faces. You’d rarely see any graphic designer setting body copy in a book using a trendy script faces or a faux wood-block typeface.\n\nSeems like the challenge you have at the moment is how to definitively categorize the typefaces you are studying and then making sure they are being used in the correct context.\n\nSome other potential pitfalls:\n\n“They cannot not released by a major foundry ( What do you consider a major foundry? I would include Bitsteam, Linotype, or Monotype.)”\n\nThis seems like another arbitrary segregation. Obviously one needs to properly define ’major foundry’. Some of the smallest foundries are the most popular.\n\n“They cannot not be novelty fonts (dingbats, for instance, or dog paws.)”\n\n’novelty’ might not the proper term there. Perhaps pictoral would be more accurate?\n\n“They cannot not obviously be based upon a “classic” font.”\n\nThat might be a tough one. That can be highly subjective. ;o)\n\n"
    },
    {
      "time": " 13.Aug.2008 7.04pm",
      "content": "Check the letter space. Leading experts say that 93%-94% of unprofessional fonts sport an unfathomably-wide space glyph. Not all unprofessional fonts have a really wide space but all fonts with a really wide space are unprofessional . . . except for one or two that were made that way as a joke and monospaced fonts. Go to MyFonts and change the sample text to “sp ac ed” and browse around. Science, man. Science.\n\n"
    },
    {
      "time": " 14.Aug.2008 7.07am",
      "content": "Thanks, again. I recently made some changes to my objectives, hence the unclarity on my terminology. It is indeed the display faces only that will be measured.\n\nMr. Shinn - the efficacy of typography is not what I am trying to measure. My apologies - it’s a bit difficult to place my entire study’s purpose in nut-shell form for a forum like this one. But what I am measuring is first-impression visual preference - what I am calling “visual impact,” a term suggested by Sii - aesthetics, what draws a reader to a page.\n\naluminum - I appreciate your comments. You’re right - some of my conditions remain somewhat subjective. It’s difficult, but I’m working on it. Thanks very much for your help.\n\n"
    },
    {
      "time": " 14.Aug.2008 8.21am",
      "content": "<cite>At the moment, your test is like asking participants to look at these toothbrushes and say which they prefer, when it would be better to check with their dentists a year later which group has fewer cavities.</cite>\n\nI am using both models toothbrush and getting quite proficient at using them together at the same time.  \n(Just kidding)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 14.Aug.2008 10.15am",
      "content": "_...the efficacy of typography is not what I am trying to measure....what I am measuring is first-impression visual preference...what draws a reader to a page_\n\nIn that case, why not level the playing field and just give them each a type catalog and ask which fonts they like best?\n\nYou are assuming that the likeability, i.e. “visual impact” of a typeface, can be isolated from the context in which it is used, and who uses it.\n\nCompare the situation to musical instruments. Suppose a performer plays a piece of music on diffferent guitars, and listeners score the sonic impact of the axes. Now change the performer, and the tune—wouldn’t that change the results?\n\n"
    },
    {
      "time": " 14.Aug.2008 12.33pm",
      "content": "<cite>Check the letter space. Leading experts say </cite>...\n\nIs that leading experts, or leading experts?\n\n-=®=-\n\n"
    },
    {
      "time": " 14.Aug.2008 6.30pm",
      "content": "\\> In that case, why not level the playing field and just give them each a type catalog and ask which fonts they like best?\n\nBecause they’re trying to measure the actual effect of setting the text in the font on people’s preferences for the different texts. That’s not at all the same as asking people to look at a bunch of fonts and decide which they like best.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 14.Aug.2008 11.54pm",
      "content": "It’s exactly the same.\n\nAs she has explained, Ms Buehner is not trying to measure the efficacy of the typography, so will pesumably be using the same layout with a variety of fonts. So participants will quickly figure out that they are being asked to grade their font preferences.\n\nDespite this, they will still base their judgements on how well the fonts work in the layout.  \nHow meaningful is that? Don’t different fonts call for different typography? That would certainly seem to be the case with the classic-trendy distinction as it is playing out here, with trendy being tagged as “grunge, ephemera, distressed, sloppiness”. Such fonts would be “most prefered” in a similarly trendy layout, while classic fonts would look better in buttoned-down layouts.\n\nSurely the most neutral layout for determining the relative “visual impact” of different fonts is a type catalog?\n\n"
    },
    {
      "time": " 15.Aug.2008 6.34am",
      "content": "Surely a font, regardless of cost, shouldn’t be deemed professional or otherwise as all fonts have an application within the sector they were designed for. Maybe it would be better to look at the use of fonts as unprofessional?\n\n"
    },
    {
      "time": " 15.Aug.2008 2.09pm",
      "content": "If the experiment is constructed as Nick describes, that would indeed be a significant weakness.\n\nHowever, if the experiment is being done with a reasonable methodology, then each individual user will \\*not\\* be asked to grade the \\*same\\* content with different designs. Instead, there will be as many different sets of content as there are designs, and which content gets assigned which design will be different for each subject, rotated across the group of subjects. You’ll need a reasonable number of subjects for this to work well, of course.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 18.Aug.2008 2.30pm",
      "content": "Hi again.\n\nThanks for your criticisms and suggestions; I always consider them carefully. My methodology is sound, and not nearly as simple as you might assume based on my very brief description. I am basing my own research on a reputable piece on typography done in the 1970’s. I am working carefully with an adviser on my method and am not seeking that kind of advice in this forum, although I truly appreciate your comments.\n\nFor everybody’s time - thank you. I look forward to talking type with you all in the future.\n\nTara\n\n"
    },
    {
      "time": " 19.Aug.2008 1.56pm",
      "content": "Tara,\n\nI wasn’t critiquing your method, just pointing out that Nick was making unreasonable inferences in his critiquing of your method.\n\nThat being said, can you tell us what “reputable piece” you’re basing your research on?\n\nIf you’re been sharing your full proposal with Si, good for you. For anybody doing such research, I would strongly suggest you get a typographer to read your full proposal. In the published research on typography I’ve read, of the ones that had significant problems, I’d say half the issues were in methodology, but half were from errors due to lack of typography background.\n\nOn a side note, the grunge/distressed/etc trend was big over a decade ago, and is actually less popular now.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 19.Aug.2008 2.35pm",
      "content": "_...Nick was making unreasonable inferences..._\n\nJust keeping it real.  \nI will be extremely surprised if this doesn’t turn out to be another banality along the lines of the recent Song & Schwartz “Arial is best” research.  \nHowever, if it does transpire, pardon the inference, that trendy fonts have more visual impact than classic, I might conceivably change my tune and praise science for suggesting that Times, Palatino, Univers and Optima be put out to pasture.\n\n"
    },
    {
      "time": " 19.Aug.2008 4.55pm",
      "content": "What’s the hypothesis of this study? I think it would just prove that people who grow up reading serifed book faces will find those typefaces easier to read, just as people who grow up reading Chinese set in certain typical newspaper faces would find that easy to read.\n\nIf you put some kids in an isolated room, and taught them to read only serifed faces from childhood, and gave another group of isolated kids only sans faces to read, and another group only Fraktur, etc., then maybe you could compare these groups and say something about the instrinsic formal qualities in a typeface and how that effects legibility, comprehension, friendliness, etc. But there are so few faces used heavily for reading that you can’t really compare apples to apples: certain typefaces will have an obvious bias, due their heavy use in our culture.\n\nThis study may prove that certain typefaces are favored culturally, but I think it’s important that they not be presented as intrinsically better due to their construction.\n\n"
    },
    {
      "time": " 19.Aug.2008 4.56pm",
      "content": "I may find nothing. I’m having an amazing time learning more about typography with you experts and others. I love it; love learning. The study I am mimicking is Ernst/Kahle from 1978 (?) or ’79.\n\nThanks for keeping it real.\n\nTara\n\n"
    }
  ]
}
