{
  "id": "48313",
  "title": "chinese fonts causing crashes",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am running the CS3 suite on a Mac - US version (also tried this on Windows - US as well with the same results), and every time I try to use any of this set of Chinese fonts, Adobe apps crash. Interestingly, Fireworks, which was not originally made by Adobe handles the fonts fine. MS Word on Windows also has no problem. But Illustrator, InDesign, and I believe P-shop and Flash as well all bomb on startup if the font is activated. Can anyone take a look at one of the fonts and tell me why this happens, and how it can be rectified?\n\n[http://www.sino.uni-heidelberg.de/edv/fonts/HDZB\\_75.TTF](http://web.archive.org/web/20081122122432/http:/www.sino.uni-heidelberg.de/edv/fonts/HDZB_75.TTF \"http://www.sino.uni-heidelberg.de/edv/fonts/HDZB\\_75.TTF\")  \n [http://www.sino.uni-heidelberg.de/edv/fonts/HDZB\\_86.TTF](http://web.archive.org/web/20081122122432/http:/www.sino.uni-heidelberg.de/edv/fonts/HDZB_86.TTF \"http://www.sino.uni-heidelberg.de/edv/fonts/HDZB\\_86.TTF\")\n\n [‹ Where are the calligraphic origins of Humanist Sans type?](http://web.archive.org/web/20081122122432/http:/www.typophile.com/node/48078 \"Go to previous forum topic\") [buying type ›](http://web.archive.org/web/20081122122432/http:/www.typophile.com/node/48308 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122122432/http://www.typophile.com/user/35052\" title=\"View user profile.\">nitrospectide</a>",
  "time": "<br>",
  "uid": "35052",
  "comments": [
    {
      "time": " 11.Aug.2008 3.57pm",
      "content": "Microsoft’s font properties tool reports a copyright notice 1994-1997, and lots of information missing from HDZB\\_75.TTF. In particular, the Supported Unicode Ranges and Supported Code Pages both report “Information not available in font.” So I’m not too surprised Adobe apps. don’t like this font. The Font Encoding Type is given as Big-5, which is unusual for a font with simplified chars., but the number of chars. (8,435) is about what one would expect from a GB font (i.e., usually simplified) of that vintage. The Heidelberg website says HDZB\\_75.TTF is a Kai-style font in medium weight. The Adobe Kaiti Std that comes with the CS3 package is similar in style, and would be a much safer bet. I’d avoid this font.\n\nHDZB\\_86.TTF is a more decorative font without an Adobe equivalent, but I expect you can buy something similar from the Arphic or Dynafont libraries. Note that I did not install either: I’m very wary of installing free fonts anyway, but especially outdated East Asian fonts.\n\nDavid\n\n"
    },
    {
      "time": " 11.Aug.2008 4.07pm",
      "content": "I find thi also when make use of Japanese font in my computer? How will I fix this?\n\n"
    }
  ]
}
