{
  "id": "48322",
  "title": "Font copyright question.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am a third year design student, and can’t afford to purchase most fonts. My school has a very limited supply. What kind of trouble am I asking for if I use fonts that were downloaded via torrents, news groups, file-sharing networks, etc.? What would happen if someone found out? I don’t want to cross that line, but I might have to for some projects.\n\nThank you.\n\n [‹ Bernhard Gothic SG + Indesign CS2 = Weird \"e\"](http://web.archive.org/web/20081122121534/http:/www.typophile.com/node/48440 \"Go to previous forum topic\") [Deseret alphabet ›](http://web.archive.org/web/20081122121534/http:/www.typophile.com/node/48048 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122121534/http://www.typophile.com/user/35265\" title=\"View user profile.\">js2008js29</a>",
  "time": "<br>",
  "uid": "35265",
  "comments": [
    {
      "time": " 11.Aug.2008 5.39pm",
      "content": "Is it morally wrong?  \n====================\n\nUnless you have permission from the copyright owner (as most fonts are only licensed for specific use, and actual ownership is not transfered), it is definitely wrong.\n\nWhat could be done?  \n===================\n\nNot much. The fonts will not be used for commercial purposes. You are a student, and the fonts are to be used in some projects.\n\nEducational Use  \n===============\n\nUS Copyright law makes a clarification about educational use. I am no lawyer, but this seems to a loophole for you. However, some copyright owners make a notice limiting the use of the fonts, and not permitting the fonts to be used freely for educational purposes.\n\nFor example, I never saw this disclaimer or legal limitation on any Adobe font package.\n\nThomas, what’s Adobe’s position on educational use?\n\n"
    },
    {
      "time": " 11.Aug.2008 6.36pm",
      "content": "Thank you for your response. What if I use it for a project that is used commercially (for example, a contest that for a local business or a pro-bono project) but it is not a paying job?\n\nI am still very unsure where the line is drawn. I know that the bottom line is to use a font for a school or freelance project, I have to pay for it. But what if I use a school computer to work on a pro-bono project or a contest? Do the same rules still apply?\n\nThank you.\n\n"
    },
    {
      "time": " 11.Aug.2008 7.18pm",
      "content": "As to getting into trouble. I’d recommend a bit of household burglary, fencing the goods to pay for fonts. Chances are even if you get caught you’ll be let off with probation. This way no type designers are deprived of income. In all likelihood your neighbors have insurance to cover the items you take.\n\nA related thread - [http://typophile.com/node/47079](http://web.archive.org/web/20081122121534/http:/typophile.com/node/47079 \"http://typophile.com/node/47079\")\n\nWith respect to that thread I’m interested in what the teachers that encourage piracy say when type designers visit to guest lecture. My guess is that type designers are not invited. That in my opinion is the real crime.\n\n"
    },
    {
      "time": " 11.Aug.2008 7.29pm",
      "content": "Israel, US copyright law does not give students carte blanche to use any copyrighted work in entirety. Fair-use applies to academic work, but only for works used in part, and I don’t think that the software copyrights that apply to font protection in the USA operate in the same legal area. Anyway, the student “exemption” from following copyright law in academic work is related to copyright holders not wanting to bother suing broke college students for work that has little or no commercial relevance anyway.\n\nIn other words, Adobe would go bankrupt suing all the college kids pirating Adobe products without ever collecting a dime.\n\n<cite>My guess is that type designers are not invited.</cite>\n\nNot all schools have nearby type designers to come in and lecture.\n\n"
    },
    {
      "time": " 11.Aug.2008 7.39pm",
      "content": "\\>Not all schools have nearby type designers to come in and lecture.\n\nNot all. But most?\n\nCheers, Si\n\n"
    },
    {
      "time": " 11.Aug.2008 8.04pm",
      "content": "James P\n\n\\> Israel, US copyright law does not give students carte blanche to use any copyrighted work in entirety. Fair-use applies to academic work, but only for works used in part, and I don’t think that the software copyrights that apply to font protection in the USA operate in the same legal area.\n\nThank you for bringing to my attention the distiction between a partial work or a complete work.\n\nI don’t even know if this “loophole” applies to software, and only to printed works. This would explain why Adobe doesn’t warn that their software should not be stolen and used for academic purposes.\n\nRegarding js...’s question abour a non-profit project or one to raise money for school, I don’t think that this is the same an internal project for purely academic purposes at a school.\n\nIf the goal to make money, why shouldn’t the type designer be compensated? Here Robin Hood should not steal no matter how poor is the school.\n\n"
    },
    {
      "time": " 13.Aug.2008 8.43am",
      "content": "The foundries or intellectual property rights holders should give design students permission to use their fonts for school-related projects. In fact, they should push their fonts free of charge. It’s common business sense, and done in many other fields.\n\n"
    },
    {
      "time": " 14.Aug.2008 7.15pm",
      "content": "If the school project is for internal use, and not for commercial use, even if the school is non-profit or for-profit, I might agree. Hmmm... on second thought...\n\nIf the school project is for commercial use, whether the school is non-profit or for-profit, I definitely disagree. We live in a society of free economics, not in a communist or socialistic society.\n\nEven where the school project is for internal use, even if the school is non-profit or for-profit, if the school has a budget, like most schools, this too should be paid for out of budget. If the school is so poor that its budget is extremely limited, then perhaps use should be granted woth acknowledgement in the school project of the foundries or intellectual property rights holders, such as a free advertisement and a letter of thank you.. This would be a fair payment for the font.\n\n"
    },
    {
      "time": " 14.Aug.2008 11.58pm",
      "content": "rss\n\nTypeface design is not allowed to be copyrighted in the US. Not since the 19th century.\n\nHowever, you CANNOT download most foundry fonts via P2P legally. Licensing contracts (EULAs) almost uniformly forbid copying. In an academic environment you are at risk. There are fines and jail times and the admin ain’t about to take it in the butt for you. If they catch you they might even inform your parents. Yikes.\n\nUltimately, what it comes down to is how many friggin fonts do you need? or want?\n\nYou probably have, if your have any of the Adobe products, enough. There was a time, a very long time ago, when one typeface was all that was needed. Actually you will turn into a much better designer / typographer if you can learn to live and work with this kind of restraint. Really.\n\nGerald\n\n"
    },
    {
      "time": " 15.Aug.2008 12.53am",
      "content": "_I ... can’t afford to purchase most fonts._\n\nBullshit.  \nYou just want to make sure you won’t get caught for cheating.\n\n"
    },
    {
      "time": " 15.Aug.2008 6.24am",
      "content": "_I am a third year design student, and can’t afford to purchase most fonts. My school has a very limited supply. What kind of trouble am I asking for if... ...I don’t want to cross that line, but I might have to for some projects._\n\nIf your school has a limited supply of fonts yet your lecturers insist you have to use certain fonts, or just really excellent fonts of your choosing for course work, and you genuinely cannot afford to purchase those fonts to use in your course work...\n\n...Jesus H. Christ on a Bright Shiney Fire Truck! Your teachers have a lot to answer for. Your teachers need working on. They need to be educated. Tell them they are irresponsible, unrealistic, arrogant, stupid wankshafts who should get some wealthy philanthropists to shell out three million dollars to fix this problem.\n\nThe three million dollars will be allocated to a project which employs James Puckett, Nick Shinn, Simon Daniels, Tiffany Wardle, Ray Larabie, Chris Lozos, Terry Biddle, and myself, to tour schools on a lecture circuit designed to educate stupid design teachers and lecturers.\n\nj a m e s\n\n"
    },
    {
      "time": " 15.Aug.2008 6.36am",
      "content": "“What kind of trouble am I asking for”\n\nThousands if not tens of thousands of folks have copied fonts while at school. I don’t recall anyone going to jail or facing fines.\n\nSo, yes, it’s infringing on someone’s intellectual property. It’s usually illegal in some shape or form. It can, legally, result in some sort of penalty. Can it happen? yes. WILL it happen? I’d say it’s a long shot.\n\nBut then there’s the Karma aspect. You are going into a profession that depends, at least in part, on IP rights, so infringing on others IP rights is rather hypocritical. You should feel some guilt, at the very least. ;o)\n\nNote that there are ways around this issue that shouldn’t entail you having to break laws. Many foundries offer online typesetting tools for mock-up purposes (which is, after all, what most student work is...mock-ups). If you ask nicely, you might find a lot of foundries will offer a student discount. Also, bug your art/design department. Just as they need to purchase screen printing equipment for printmaking classes, they should be looking at investing in some type collections for the graphic design classes.\n\nAnd, finally, there’s the best option...if you need a typeface...make one. Not only will that avoid any IP issues, it’s great learning/training/skillset.\n\n"
    },
    {
      "time": " 15.Aug.2008 7.38am",
      "content": "Nick, keep in mind that there are thousands of students without access to heavily subsidized Canadian art schools. Here in the states tuition is rising every year, wages are going down, inflation is killing the value of our money, prices for fuel and food are skyrocketing, federal student aid has been slashed and our banking system is near total collapse leading hundreds of lenders to cease lending to students. Much of this is the fault of stupid political decisions made when many of the students weren’t even old enough to vote.\n\nIn design school I knew kids so broke had to take turns reading the one copy of a required textbook in the library (the professors couldn’t always make copies or printouts because the school couldn’t afford to keep the copiers and printers working all the time). Some of these kids eat one meal a day, and it’s mostly rice or spaghetti. One guy lugged a keyboard with him everywhere he went because the keyboard on his laptop broke and he couldn’t afford to fix it. These kids can’t afford most commercial fonts, nor can they afford to let their grades slip and lose scholarships because they annoyed a professor with a hangup for expensive type.\n\n"
    },
    {
      "time": " 15.Aug.2008 9.28am",
      "content": "James brings up an interesting point. With a lot of US kids having to resort the military to get through college, seems like we need to focus on better graphic design training in the military. ;o)\n\nUnfortunately, it wasn’t until AFTER I served my 6 years that I discovered it’s actually an option:\n\n[http://www.goarmy.com/JobDetail.do?id=10](http://web.archive.org/web/20081122121534/http:/www.goarmy.com/JobDetail.do?id=10 \"http://www.goarmy.com/JobDetail.do?id=10\")\n\n"
    },
    {
      "time": " 15.Aug.2008 10.42am",
      "content": "\\>James brings up an interesting point. With a lot of US kids having to resort the military to get through college, seems like we need to focus on better graphic design training in the military. ;o)\n\nZapf honed his skills in the army, mapmaking as I recall?\n\n"
    },
    {
      "time": " 15.Aug.2008 10.57am",
      "content": "bieler,\n\n\\> Typeface design is not allowed to be copyrighted in the US. Not since the 19th century.\n\nI don’t think that this is true anymore, since the demise of bit-map font technology.\n\nA US Copyright meant that there was a dated record for US Copyright and intellectual property rights violation. If the violator pirated and earned much as a result, a court victory could yield a hefty earning for the US Copyright and intellectual property rights owner.\n\nIn the era of outline font technology US Copyright and intellectual property rights are applicable.\n\n"
    },
    {
      "time": " 15.Aug.2008 12.34pm",
      "content": "here’s some info:\n\n[http://en.wikipedia.org/wiki/Typeface#Legal\\_aspects](http://web.archive.org/web/20081122121534/http:/en.wikipedia.org/wiki/Typeface#Legal_aspects \"http://en.wikipedia.org/wiki/Typeface#Legal\\_aspects\")\n\nThe issue, of course, is that the interpretation of laws change from lawsuit to lawsuit so, ultimately, it’s not an issue of the law’s specific intent, but rather how much you can pay your lawyers. ;o)\n\n"
    },
    {
      "time": " 16.Aug.2008 12.33am",
      "content": "James, I can sympathize with poor students, (in any country, including the impoverished USA), but not to the extent of using that as a justification for theft.  \nLet’s hope they have paid for a computer (probably an Apple) and the CS, which they won’t be able to study without. In which case they have access to most of the fonts necessary to do their design projects, bundled. Anything else, they can pick up as freeware etc. (as Darrel explained). If they have a hankering for Gotham or Mrs Eaves, well, those typefaces will really impress their professors, so pirating them is OK, is that what you’re saying?\n\n"
    }
  ]
}
