{
  "id": "48336",
  "title": "crit for a logotype",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello and Shalom.  \nmy name is yaron from israel.  \ni usualy deal with hebrew typography, so this is quite new for me and i would love to get another opinion on this.\n\nthis is a photographer that deals with photojounalism on one side, and artistic nude and foot fetish photography on the other side.  \nthe key words were \"bold, lacks inhibition, but also sophisticated, sexy, and sensous\"  \ntherefor i searched for bold and italic fonts like  \n\"bauer bodoni black italic\" which really gave me that kind of feeling.\n\ni showed the client a type test with some 50 fonts related to that style, and we agreed on the bauer bodoni combined with the \"F\" letter of \"Benguiat\" font.  \nalong the way i noticed seceral problems like \"il\" letters and the \"fi\" ligature, so i tried to work it out.\n\ni would like to get a critique for a logotype, especially concerning kerning and typo :)  \ni can't change the font because of tight schedule, but i would like to hear your opinion on my font choice.\n\nthanks alot,  \nYaronimus\n\n ![](http://web.archive.org/web/20131021143552im_/http:/typophile.com/files/logo%20sk_5064.png)\n\n",
  "author": "Yaronimus-Maximus",
  "time": "12 Aug 2008 — 4:30am",
  "uid": "9203",
  "comments": [
    {
      "time": "12 Aug 2008 — 4:31am",
      "content": "smaller size:\n\n ![](http://web.archive.org/web/20131021143552im_/http:/typophile.com/files/logo%20sk_6119.png)\n\n"
    },
    {
      "time": "12 Aug 2008 — 6:16am",
      "content": "Of your options the bottom one is working best – it definitely needs a ligature, although the word space is a touch wide and the Ye could be a touch tighter.\n\nIf you wanted to push it further Stilla might be an option, the E+F cut has an fi ligature\n\n[http://www.myfonts.com/fonts/ef/stilla/](http://web.archive.org/web/20131021143552/http:/www.myfonts.com/fonts/ef/stilla/ \"http://www.myfonts.com/fonts/ef/stilla/\")\n\nTim\n\n"
    },
    {
      "time": "12 Aug 2008 — 7:57am",
      "content": "The bottom is my favorite too. However, I prefer the ligature of the il in the option just above. Nice work with the fi.\n\nPdub\n\n"
    },
    {
      "time": "12 Aug 2008 — 8:09am",
      "content": "thank you very much tim and Pdub.\n\ntim - when you say \"word space\" which word do you meen exactly?  \nstilla is cool, but a bit too funky for my client.\n\nPdub - that's funny, well, maybe because english is my second laguage i feel that the Il looks like LL which is confusing. doesn't an IL ligature in this type affect legibility? isn't this a problem in english?\n\nanother question - isn't the logo a bit too long?  \nmaybe a sub line with something like \"art & press photography\" would be better for the logo?\n\nthanks!\n\n"
    },
    {
      "time": "12 Aug 2008 — 10:05am",
      "content": "Yaron,  \nI meant the space between Ilia and Yefimovich, my feeling is that given the tight kerning of the names that space is just too wide.\n\nAs for the logo being too long, it might present a problem – at a small size you might need to look at a more spaced version at the smaller (business card) sizes. I think adding a strap line would give you a hefty block which could be clumsy to work with in a layout.\n\nTim\n\n"
    },
    {
      "time": "12 Oct 2008 — 6:29am",
      "content": "thanks all of you.  \n [http://yefimovich.com/](http://web.archive.org/web/20131021143552/http:/yefimovich.com/ \"http://yefimovich.com/\")\n\n"
    },
    {
      "time": "12 Oct 2008 — 5:02pm",
      "content": "I'm with Pdub on this one.\n\nlike the ligatures, but feel overall the kerning is too tight\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131021143552/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
