{
  "id": "48344",
  "title": "Terminology: Down style and up style",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "“Down style” means to capitalize only the first word and proper nouns. Usually in titles.\n\nThis is a title in down style which Microsoft Word calls “sentence case”\n\nThis Is A Title In Up Style Which Microsoft Word Calls “Title Case”\n\nI refer to the latter as “up style” for lack of a better term. Does anyone know if there is a proper term for “Title Case?”\n\n [‹ hand lettering 101](http://web.archive.org/web/20081122061614/http:/www.typophile.com/node/48369 \"Go to previous forum topic\") [Perfectly Kerning Helvetica? ›](http://web.archive.org/web/20081122061614/http:/www.typophile.com/node/48399 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122061614/http://www.typophile.com/user/15065\" title=\"View user profile.\">Christopher Dean</a>",
  "time": "<br>",
  "uid": "15065",
  "comments": [
    {
      "time": " 12.Aug.2008 9.34am",
      "content": "I’ve heard “up style” as well for “Title Case”—though that doesn’t mean it’s right. Works for me, though.\n\n"
    },
    {
      "time": " 12.Aug.2008 9.43am",
      "content": "The only proper term for “title case” I can think of is “initial caps” or just “capitalization”.  \nBoth are used frequently – in The Netherlands that is.\n\n"
    },
    {
      "time": " 12.Aug.2008 9.49am",
      "content": "I’ve come across Title Case in the context of linguistic orthography, not typographic style; it appears to be a proper term with rules to govern how the casing of digraphs such as LJ in Ljubljana should be handled, i.e. not LJubljana.\n\n"
    },
    {
      "time": " 13.Aug.2008 9.26am",
      "content": "In the UK newspaper industry we would always prefer the “down style”. The alternative, “up style” is seen as quaint, or Amerenglish, usage. But the extent of this varies.\n\nIn the pages of the Guardian, for instance, we would see President George Bush who is the US president. The Times, however, would refer to one as the President and the other as Prime Minister; “cap specifics” says The Times [which takes a cap on the article], whereas the [l/c] Guardian style guide comments that “the tendency towards lowercase ... in part reflects a less formal, less deferential society”.\n\nFor those interested in matters of style, the Guardian style guide can be downloaded as a pdf, whereas The Times guide is for online reading.\n\nPersonally, my rule is simple: if in doubt, go low.\n\nKen W\n\n"
    },
    {
      "time": " 13.Aug.2008 4.13pm",
      "content": "<cite>This Is A Title In Up Style Which Microsoft Word Calls “Title Case”</cite>\n\nIn this example I believe that “a” and “in” would not be [capitalised](http://web.archive.org/web/20081122061614/http:/www.grainge.org/pages/various_rh_projects/cedar_procedures/procedures/053_typographical_rules.htm).\n\n"
    },
    {
      "time": " 14.Aug.2008 3.50am",
      "content": "<cite>In this example I believe that “a” and “in” would not be capitalised.</cite>\n\nYou’re missing the word pun. It’s what _Microsoft Word_ calls “title case” — the rest of the world may have another opinion.\n\nNick: for prime examples of “linguistic orthography, not typographic style”, go Dutch! The digraph ’ij’ should be capitalized for proper names, at the start of a sentence, or at the start of a word in title case — “IJsselmeer”, rather than “Ijsselmeer” (just typing this last word makes me cringe).\n\nAm I correct in remembering these rules are not the same for all languages with digraphs? I.e., “Aesop” looks right to me, “AEsop” does not.\n\n"
    },
    {
      "time": " 14.Aug.2008 5.09am",
      "content": "Æsop looks perfectly normal to me, Aesop and AEsop do not. Same for Œdipus. Sentence case or down case is standard in Portuguese and Spanish and most other languages that I know of for being used in title case. In English the general rule is to capitalize all words except for articles and short conjunctions (a, an, the, but, and, of, in, on) except where these are the first word in a phrase.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 14.Aug.2008 6.39am",
      "content": "I often miss the humor in Microsoft products.\n\n"
    }
  ]
}
