{
  "id": "4835",
  "title": "(x) Typeface query: Trooper",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I'm doing a project filling in the blanks in identifying the original typefaces for SSi's clones.   \n   \nThere is an SSi font for which I've located a match in Fontbank's Talon Bold. I'm finding, however, that almost all of the Fontbank fonts are modified (butchered would, in many cases, be the proper term) commercial fonts. Finding the original tyepface, when not [already known](http://web.archive.org/web/20141116092441/http:/jeff.cs.mcgill.ca/~luc/pro1555.txt), has not, in most cases, been too difficult.   \n   \nThe image below is of the SSi version of this font:   \n   \n ![](http://web.archive.org/web/20141116092441im_/http:/www.typophile.com/forums/messages/83/36248.gif)   \nI've found a typeface in the Solotype Catalog that might be the original, but the character sampling is brief. I cannot find a digital version by its original name. It's called Trooper Roman Bold Extended. From the small sample provided, the A, B, E, e, i, l, n, s, t and w are exact matches or extremely close. The R's right leg extends further to the right. Actually, the s and the fact that the Broadway-like w are present is what grabbed my attention.   \n   \nSo ... do any of you (Mark, Mike Y)have a better sample image of the Trooper family in your old catalogs? If so, might it be a predecessor? Keep in mind that some glyphs will surely vary\n\n",
  "author": "Mike F",
  "time": "19 May 2004 — 3:53am",
  "uid": "3368",
  "comments": [
    {
      "time": "19 May 2004 — 6:11am",
      "content": "It's some version of Trooper, though not one of the originals. I believe there were only two weights, light and roman with italics. This is a bolder weight than either. There is a Trooper Roman Black in the Phil's Photo catalog, but there are differences in the characters. Trooper was very popular for a little while, so much so that some other film font outfits released there own versions with extra weights and styles. This doesn't quite match any that I've found. The hairlines are a bit too thin, for one thing. But, it's not far off either. The original (and the knock-offs) had several alternate characters. Most of the characters in your sample are the normal ones, some are alternates (o, O, and Q).   \n   \nAlso, Dave Trooper was the designer. The font was originated by VGC.\n\n"
    },
    {
      "time": "19 May 2004 — 8:25am",
      "content": "Thanks much for that information Mark. What a very strange combination of styles.   \n   \nLookie what I just came across: SoftUnion's [Troover](http://web.archive.org/web/20141116092441/http:/www.paratype.com/pstore/fonts/Troover.htm). Tucked away in the extended characters lie my calligraphic g and y, albeit at a lesser weight. I assume that the rotation of the o, O, q and Q was, indeed, a Fontbank gimmick.   \n   \nAlso, a listing at [AtomicType](http://web.archive.org/web/20141116092441/http:/www.atomictype.co.uk/castle_page.html) pointed me to [Castle Type](http://web.archive.org/web/20141116092441/http:/www.castletype.com/), where Trooper Roman Bold at first seems to not be present. It is, it turns out, listed in the [PDF catalog](http://web.archive.org/web/20141116092441/http:/www.castletype.com/catalog/CastleType_catalog.pdf) as Trooper Roman and at pretty much the same weight as the SSi font. I wonder if Jason Castle made that early enough to have been ripped off by Fontbank ... I think I'll write and ask him.   \n   \nThanks again.\n\n"
    },
    {
      "time": "19 May 2004 — 9:27am",
      "content": "Huh. The Castle Type version looks pretty much exactly like the SSi version, more so than the old film font samples I found. Your theory may be right.\n\n"
    }
  ]
}
