{
  "id": "48369",
  "title": "hand lettering 101",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Proud papa here, showing off the card my daughter made for her friend’s 5th birthday. I had nothing to do with it. I don’t think I’ve ever shown her how to draw letters on an arc. She didn’t do it in pencil first. When she showed it to me it was done, and I was pretty amazed...I mean, how did she know where to put the B? I couldn’t do that when I was 5.\n\n ![](http://web.archive.org/web/20081122120040im_/http:/www.typophile.com/files/happybday_5_3494.jpg)\n\n [‹ Man on stilts rides sea horse at Olympics](http://web.archive.org/web/20081122120040/http:/www.typophile.com/node/48415 \"Go to previous forum topic\") [Terminology: Down style and up style ›](http://web.archive.org/web/20081122120040/http:/www.typophile.com/node/48344 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122120040/http://www.typophile.com/user/18852\" title=\"View user profile.\">Koppa</a>",
  "time": "<br>",
  "uid": "18852",
  "comments": [
    {
      "time": " 13.Aug.2008 7.53am",
      "content": "Clearly and advanced child ; )\n\nNice ATP lig!\n\n"
    },
    {
      "time": " 13.Aug.2008 7.58am",
      "content": "I think she has been fiddling with Illustrator!\n\nFuture Typophile!\n\nMichael\n\n"
    },
    {
      "time": " 13.Aug.2008 10.05am",
      "content": "Kid’s art is awesome, the younger the better.  \nBut usually on crappy materials that are far from the archival quality the work merits.  \nSo my advice to all parents of infants: invest in the proper materials.  \nIt may seem like an extravagance now, and I know things are always tight financially when raising a young family, but you won’t regret the expense twenty or fifty years from now.  \nAnd put it in a safe place.  \nMy mother had me enter a children’s art competition in 1958, and when she died the work was passed on to me.  \nIt’s a bit fragile, but I’m touched that she kept it, and it’s really amazing to look back on my early work, that I don’t even remember doing.\n\n"
    },
    {
      "time": " 13.Aug.2008 10.42am",
      "content": "And if you don’t capture the work on the best materials, the digital age will let you keep some version alive. This was my niece, Hope, at around age four.\n\n ![](http://web.archive.org/web/20081122120040im_/http:/www.typophile.com/files/Hope_4025.png)\n\n"
    },
    {
      "time": " 13.Aug.2008 11.44am",
      "content": "\\> I couldn’t do that when I was 5.\n\nSimly because your father was not a Typophile.  \nMay God bless her little fingers\n\n"
    },
    {
      "time": " 13.Aug.2008 4.13pm",
      "content": "If she’s looking for a partner in the firm, show her my [daughter’s portfolio](http://web.archive.org/web/20081122120040/http:/www.typophile.com/node/40152)...\n\n"
    },
    {
      "time": " 14.Aug.2008 7.35am",
      "content": "I’ll show her this thread, your daughter’s work, and make sure she gets the memo.\n\nThanks.\n\n"
    }
  ]
}
