{
  "id": "48367",
  "title": "Kindersley Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m doing a logo for the town of Kindersley and I would love some comments & critique on my logo.\n\nRequirements:\n\n- Same color blue\n- Discover Kindersley name in that order\n- A goose must be included\n\nLook forward to your input\n\n [‹ hand-drawn logos, your opinion](http://web.archive.org/web/20081122065724/http:/www.typophile.com/node/48009 \"Go to previous forum topic\") [Health products company ›](http://web.archive.org/web/20081122065724/http:/www.typophile.com/node/48753 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122065724/http://www.typophile.com/user/25730\" title=\"View user profile.\">christopher.martens</a>",
  "time": "<br>",
  "uid": "25730",
  "comments": [
    {
      "time": " 13.Aug.2008 7.28am",
      "content": "Darn, forgot to add the image, my apologies. Here is the link...\n\n[http://freshnewthing.com/kindersley\\_logo.jpg](http://web.archive.org/web/20081122065724/http:/freshnewthing.com/kindersley_logo.jpg \"http://freshnewthing.com/kindersley\\_logo.jpg\")\n\n"
    },
    {
      "time": " 13.Aug.2008 10.47am",
      "content": "I like the goose and the colors you’ve chosen. I think there are a few changes that need to be made to the type though.\n\nIs the “.com” necessary? - This is for a town isn’t it?\n\nI wouldn’t do the glassy effect on the type as it’s been done to death and I don’t think it suits a logo for a town - to me it suggests a more programming/internet type company.\n\nThe contemporary style sans-serif font along with the effect you have on it AND the “.com” give this a very modern, cold feel. It’s too corporate. I’d suggest removing the reflection effect, removing the “.com” and perhaps changing the font to one with a little more character. (though the font selection may be fine once the glassy effect is removed).\n\npenn\n\n"
    },
    {
      "time": " 13.Aug.2008 11.23am",
      "content": "The “.com” was also a requirement in both of the logos. The logo is actually for a city website which I forgetfully neglected to mention. I think I might agree with taking away the gloss. I’ll make some revisions and play around with some fonts.\n\n"
    },
    {
      "time": " 15.Aug.2008 10.16am",
      "content": "Your design is nicely done but I agree with pennANDink. in it’s current state your logo looks very slick and corporate. Why the goose? Is it the town symbol/mascot? With a goose I think of a northern mountain town with a lake, lots of fishing, hiking, boating, nature preserves etc. What is the town really like? Your contemporary sans doesn’t seem like an appropriate choice.\n\nbtw, I also like your Rosetown logo design.\n\n"
    },
    {
      "time": " 15.Aug.2008 4.26pm",
      "content": "I think this is well executed but perhaps you could supply us with more information. Where is the city located? Why does the goose need to be included? Why such a corporate colour palette? Why such a punchy sans serif? I think more information is required before we can judge whether this is a good or bad design.\n\n"
    },
    {
      "time": " 16.Aug.2008 7.09am",
      "content": "Hi Christopher,\n\nvery good start. Is that gradient on the letters really necessary though? It might look better without. I have seen a very similar goose somewhere else on this forum before. Let me see if I can find it...\n\nYep, here it is:\n\n ![](http://web.archive.org/web/20081122065724im_/http:/www.typophile.com/files/35305_4737.gif)\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122065724/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 16.Aug.2008 7.10am",
      "content": "Oops, file was larger than I expected. Apologies...\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122065724/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 17.Aug.2008 4.03am",
      "content": "But Timo, this is clearly the rare eagle-duck. ;)\n\n"
    },
    {
      "time": " 29.Aug.2008 4.33am",
      "content": "If nothing else, you will have to correct kerning.\n\nBTW: Since it’s a mark for a town, did you think to use some kind of heraldry in it? Not in a regular old fashioned way but an open modern way? It will definitely put it apart from corporate identity.\n\nI’d also make a different stylisation of the goose...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
