{
  "id": "48377",
  "title": "Comping Foil Stamping?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,  \nDoes anyone know if there is a way to accurately make a comp of a foil-stamped piece, showing the actual foil you plan to use (or a close facsimile), prior to the printing? Are there service bureaus that can do this, (preferably in the U.S.)?\n\nthanks for any ideas....\n\n",
  "author": "<a href=\"/web/20091103063716/http://typophile.com/user/9177\" title=\"View user profile.\">BrooklynRob</a>",
  "time": "<br>",
  "uid": "9177",
  "comments": [
    {
      "time": " 13.Aug.2008 11.24am",
      "content": "Back in college there was this iron-on foil material that would adhere to laser toner.\n\nYou’d print out your piece, then ’iron’ the foil on with a head pen and then peel it off.\n\nBut that was over a decade ago and have since long forgotten the name of it or if it even exists anymore...\n\n"
    },
    {
      "time": " 13.Aug.2008 11.25am",
      "content": "But...now that I think about it, if any place would have something like that, it’d be a scrapbooking store. Maybe check there.\n\n"
    },
    {
      "time": " 13.Aug.2008 11.39am",
      "content": "I recall these sheets too. One brand was called “Copy FX”. There were these sheets of film you could attach to a laser print or photocopy, run them through the printer’s fuser a second time (by making a blank print) and the foil would adhere to the toner.\n\nI worked for a while in a shop that had a semi-automated system that did this with the film on rolls, but it was a terrible mess, constantly jamming.\n\nLetraset had a hand operated system for a time with a similar material and a special hand iron.\n\n"
    },
    {
      "time": " 13.Aug.2008 1.16pm",
      "content": "I think there might be places that can do a comp for you but it may end up being to expensive. If its to show a client, you could simply do a color comp and show samples of the process. If you have a printer in mind, ask them for samples from extra runs or misprints. They would likely have a book available with samples of foil to choose from.\n\nSometimes foil-stamping , sometimes referred to as Hot Stamping, is combined with embossing or even litho. One important thing to be mindful of is line weight and counters in type. Very thin hairlines in type are apt to drop out leaving the undercoating showing. The counters in the loops of e’s and such can plug with foil if they are very small in size. These effects vary some from one printer to the next so seeing printed samples of your printers work is a good idea.\n\nStephen\n\n"
    },
    {
      "time": " 13.Aug.2008 8.51pm",
      "content": "The iron-on stuff is still out there, but it’s very hard to find in the USA—I know a woman who uses it, but she brings it here from Taiwan. But at least you’re in New York—if you’re going to find it anywhere, that’s the place!\n\n"
    },
    {
      "time": " 13.Aug.2008 10.20pm",
      "content": "I found a link for the [laser foil](http://web.archive.org/web/20091103063716/http:/www.paperdirect.com/Using+Laser+Foil/id=52/shop.axd/Content) stuff. It looks interesting, but I wonder what a finished product would look like...\n\n"
    },
    {
      "time": " 14.Aug.2008 5.27am",
      "content": "Very difficult to comp foil-stamping yourself.\n\nAs for service bureaus, Allan Wahler’s company, A2A Graphics, does exactly this sort of thing. I know them for comping trade fiction covers — lots of stamping and embossing, etc., . . . you know the style. They also mock up credit cards and such, comping holograms, etc.\n\n[http://www.a2a.com/home.html](http://web.archive.org/web/20091103063716/http:/www.a2a.com/home.html \"http://www.a2a.com/home.html\")\n\n(Looks like they’ve just moved out of NYC.)\n\nP.S. Allan Wahler is husband to Carol Wahler, long-time director of the Type Directors Club. Many typophiles may have met him at various conferences without realizing what he does.\n\n— Kent.\n\n"
    },
    {
      "time": " 14.Aug.2008 6.29am",
      "content": "A friend of mine used the laser foil back during my undergrad days. The end result looked great, provided you got it to work correctly. More often than not, it would jam or create a sticky mess inside the printer.\n\nCould you use a metallic marker to simulate the foil effect?\n\n"
    },
    {
      "time": " 14.Aug.2008 5.24pm",
      "content": "The foil/toner laminator we used to use at my old studio to comp stamping was called an Omnicrom machine. Googling “omnicrom foil” doesn’t turn up much, though. Looks like [this place in the UK](http://web.archive.org/web/20091103063716/http:/www.hotfoiluk.com/othermachinery.html) might have them.\n\nAlso, I haven’t done it for awhile, but there are plenty of service bureaus that do rubdown transfers and they can usually do them in most PMS colors (including metallics).\n\n"
    },
    {
      "time": " 24.Aug.2008 6.58pm",
      "content": "Thanks for the help everyone, I appreciate it.\n\n"
    },
    {
      "time": " 26.Aug.2008 6.24am",
      "content": "I’ve used laser foil tons of times. It works great.\n\n1. Print out your art using a laser printer  \n2. Cut out a piece of laser foil slightly larger than the area you want foiled  \n3. Tape it over the graphic using the provided tape.  \n4. Load the paper back into the laser printer.  \n5. Print a blank page  \n6. Remove excess foil from page.\n\nThe toner and the foil will fuse together leaving a foil graphic. Pretty cool stuff. I did about 150 certificates using this method. Worked great.\n\nI’ve used the stuff from paper direct. But I’ve only used gold.  \n [http://www.paperdirect.com/Using+Laser+Foil/id=52/shop.axd/Content](http://web.archive.org/web/20091103063716/http:/www.paperdirect.com/Using+Laser+Foil/id=52/shop.axd/Content \"http://www.paperdirect.com/Using+Laser+Foil/id=52/shop.axd/Content\")\n\n"
    }
  ]
}
