{
  "id": "48370",
  "title": "Three Favorite Newspaper Text Types",
  "forum": "Reed Reibstein's blog",
  "tags": [

  ],
  "content": "This summer I have been unbelievably lucky to work with [Mario Garcia](http://web.archive.org/web/20131022104843/http:/www.garciamedia.com/) and [Pegie Stark Adam](http://web.archive.org/web/20131022104843/http:/starkadamdesign.com/) on redesigning the [_Yale Daily News_](http://web.archive.org/web/20131022104843/http:/www.yaledailynews.com/), Yale University's daily newspaper, and Mario has very graciously posted a few of my thoughts from time to time on [his fantastic, revamped blog](http://web.archive.org/web/20131022104843/http:/www.garciamedia.com/blog). Recently, he wrote an entry, [\"Text type: here are five that work for me all the time](http://web.archive.org/web/20131022104843/http:/www.garciamedia.com/blog/articles/text_type_here_are_five_that_work_for_me_all_the_time), picking Miller Daily, Poynter Oldstyle Text, Chronicle Text, Mercury Text, and Quiosco as his favorite news faces. Being an incorrigible typonerd, I decided to share three of my favorites with him as well. He posted my e-mail in [yesterday's post](http://web.archive.org/web/20131022104843/http:/www.garciamedia.com/blog/articles/students_design_newspaper_of_the_future_yes_it_is_printed), and I have excerpted it below:\n\n**THE FOLLOW UP**\n\nTHREE OTHER INTERESTING TEXT TYPE FONTS: THE REED REIBSTEIN CHOICES\n\nOur Yale University intern, Reed Reibstein, whose interest in typography has inspired my colleague Pegie Stark Adam and me as we work on a rethinking of the Yale Daily News this summer, had these contributions to make concerning choices for text type—the subject of previous postings of TheMarioBlog.\n\nAfter reading your recent post on the five text types that always work for you, I thought I would send you three of my favorites:\n\n1) Globe and Mail Text: [http://www.shinntype.com/globetext.html](http://web.archive.org/web/20131022104843/http:/www.shinntype.com/globetext.html \"http://www.shinntype.com/globetext.html\")\n\nThe text member of Nick Shinn’s typographic suite for the new Globe and Mail looks like it was plucked from a beautifully set novel, not made for the harshness of newsprint. It has the short descenders and high x-height useful for newspaper columns, but its slight calligraphic flair makes the experience of reading it quite unusual for the setting.\n\n2) Eudald News: [http://www.felicianotypefoundry.com/main/?page\\_id=88](http://web.archive.org/web/20131022104843/http:/www.felicianotypefoundry.com/main/?page_id=88 \"http://www.felicianotypefoundry.com/main/?page\\_id=88\")\n\nAn indirect member of the wave of Fleischmann revivals for publications (Hoefler & Frere-Jones’ Mercury and Christian Schwartz’s Farnham among them), it is the most rococo, with odd but not offputting “zigzag” terminals evident in the “E” and long tails in the italic. Mario Feliciano has imparted a powerful fullness to its letters that makes them burst confidently from the page, giving it a style largely unfettered by the traditions of newspaper type.\n\n3) Greta Text: [http://www.typotheque.com/fonts/greta\\_text/](http://web.archive.org/web/20131022104843/http:/www.typotheque.com/fonts/greta_text/ \"http://www.typotheque.com/fonts/greta\\_text/\")\n\nPeter Bil’ak might have created Greta to work especially well for setting languages with lots of diacritics, but it functions beautifully no matter the tongue. It looks wider than many newspaper types, yet was made with economy in mind; overall, it is a gorgeous, entirely modern typeface that livens any page it graces.\n\n[_Had it not taken me so long to write these three blurbs, I would have added a few more of my favorites: Dino dos Santos' [Leitura News](http://web.archive.org/web/20131022104843/http:/dstype.com/leitura_news.html) and Christian Schwartz's [Houston Text](http://web.archive.org/web/20131022104843/http:/christianschwartz.com/houston.shtml) and [Guardian Text Egyptian](http://web.archive.org/web/20131022104843/http:/christianschwartz.com/gdntegyp.shtml). I am also really hoping that Kent Lew decides to continue and finish the \"cut and then curved\" typeface he gave a peek of on [this thread](http://web.archive.org/web/20131022104843/http:/www.typophile.com/node/41687)._]\n\n",
  "author": "Reed Reibstein",
  "time": "13 Aug 2008 — 7:47am",
  "uid": "11702",
  "comments": [

  ]
}
