{
  "id": "48381",
  "title": "Type on an arc?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m doing a logo re-design for a client, and they’ve specifically requested the company name in a circle.\n\nHas anyone found a way to decently arc text? I’ve used the “Type on a path” tool in Illustrator, but the text always looks off to me - either the letterforms start blending together, or the kerning is a nightmare.\n\nHere’s another company’s example of what I’m trying to do (not mine): [http://www.yellowcabchicago.com/images/logo.gif](http://web.archive.org/web/20081122120238/http:/www.yellowcabchicago.com/images/logo.gif)\n\n [‹ tone on tone black](http://web.archive.org/web/20081122120238/http:/www.typophile.com/node/48376 \"Go to previous forum topic\") [Body Copy Typeface for Blog ›](http://web.archive.org/web/20081122120238/http:/www.typophile.com/node/48279 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122120238/http://www.typophile.com/user/35421\" title=\"View user profile.\">haresy</a>",
  "time": "<br>",
  "uid": "35421",
  "comments": [
    {
      "time": " 13.Aug.2008 12.49pm",
      "content": "I know that Leslie Cabarga’s Logo, Font, and Lettering Bible details this (and other similar techniques) explicitly (without using Type on a Path), though I don’t know how much detail he goes into on kerning it properly.\n\n"
    },
    {
      "time": " 13.Aug.2008 5.02pm",
      "content": "Read your Visual Quickstart for Illustrator book (Peachpit Press) This is an easy and standard skill in Illustrator once you start to understand it. We used to use a program called Adobe Type Align but all of that was folded into Illustrator as was Adobe Streamline ( the tracing program). TypeStyler is another program that does this but has been in a holding pattern for a number of years.\n\n"
    },
    {
      "time": " 14.Aug.2008 6.16am",
      "content": "Thanks, **auricfuzz** and **bojev**.\n\nI’ve used this technique before, but it’s not a favourite - it might just be my eyes, but it never looks right to me.\n\nI remember using Streamline _many_ years ago. I also remember the copy I had always wanted to crash, usually during a save.\n\n"
    }
  ]
}
