{
  "id": "48390",
  "title": "Help choosing Arabic font for software interface",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nI'm working on an Arabic version of an English software, and I'm really confused as to what font to use as the default font for software interface.  \nSince this software will use the default system font (btw what's the default system font for Arabic Windows?) for input fields and dropdown lists and etc., I want to make sure the UI font doesn't look too different from the default system font. The UI font will be used at sizes between 14px to 30px. Also for English I was using Milo as the UI font.  \nI know similar questions have been brought up in the past, but I wasn't able to find an answer after reading all those posts.\n\nRight now I'm looking at Tahoma, but still undecided yet. I have also tried simplified arabic, but [the result](http://web.archive.org/web/20131023174457/http:/maricastudio.net/temp/2.png) isn't very good (actually I think it looks terrible) to my eyes. But again I know nothing about Arabic, so forgive me if I sound ignorant.\n\nMarica\n\n",
  "author": "marica",
  "time": "13 Aug 2008 — 9:33pm",
  "uid": "23193",
  "comments": [
    {
      "time": "13 Aug 2008 — 10:23pm",
      "content": "Windows uses Microsoft Sans Serif. Office uses Tahoma.\n\nTahoma has the benefit of a true bold, scales better too. MicroSS only really works well at 8pt.\n\nAvoid Simplified Arabic. Might want to look at Arial and TNR.\n\nPreference amongst native readers is somewhat mixed, and depends on the language for some extent.\n\nThere are some good third party UI fonts. Might want to consider talking to Mamoun Sakkal, Monotype, Ascender or Bitstream.\n\nCheers, Si\n\n"
    },
    {
      "time": "13 Aug 2008 — 10:25pm",
      "content": "Oh and I assume you've already licensed the FF Milo for redistribution? Maybe the FontFont ISV sales folks can suggest something matched for the Arabic or may be willing to produce a custom Arabic.\n\n"
    },
    {
      "time": "13 Aug 2008 — 10:57pm",
      "content": "Thanks for the replies Si.\n\nThis software is aimed at professional users who should be pretty familiar with computers, so I guess most of them may have got used to reading text set in european fonts? I googled for some random Arabic website and went through their css files, turns out there aren't much difference in the choice of web fonts. Anyway I think you are right about avoiding Simplified Arabic.\n\nThe software doesn't actually have a UI font, but lots of little images with text on them. It's a pain to edit them, really.\n\n"
    },
    {
      "time": "14 Aug 2008 — 6:35am",
      "content": "If you're not shipping a font, or tied to a system font then that opens up more possibilities. Might want to look at Sakkal Majalla - it was originally designed as a UI font.\n\n"
    },
    {
      "time": "15 Aug 2008 — 5:13pm",
      "content": "But why don't you use whatever default UI font is on particular user's computer? This will definitely look no different from the rest of UI.\n\nAll system fonts used for UI in Windows support Arabic.\n\n"
    }
  ]
}
