{
  "id": "48411",
  "title": "Font Piracy",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was thinking about designing a typeface and it got me thinking. How do you protect against piracy? With stock images, they can place code within the picture and scan everywhere until they get a hit. I imagine this would be much harder to encode in a typeface.\n\nAlso what about print, once it's out there, unless someone recognizes a face in a product, researches who designed it and then searches all past invoices or goes to each reseller and asks them to search for the offending company (which seems you would waste more time than it's worth) it would be near impossible to find stolen fonts.\n\nAm I missing something or is it really just a lot of faith in the end user?\n\n",
  "author": "voiceof",
  "time": "14 Aug 2008 — 8:51am",
  "uid": "4114",
  "comments": [
    {
      "time": "14 Aug 2008 — 9:18am",
      "content": "<cite>How do you protect against piracy?</cite>\n\nOne can’t protect against it. It’s far too common—IIRC an study put it at 50% of American designers used pirate fonts at least sometimes—to prevent. Once a few people have bought a font it inevitably ends up getting posted online by an end-user. Watermarks can be embedded in fonts, but unless a designer has the time and money to sue the original purchaser for letting the font get out, there’s no point. And if watermarks were used by more than the one foundry that currently does, someone would just write a tool to strip them from fonts.\n\n<cite>Am I missing something or is it really just a lot of faith in the end user?</cite>\n\nSomething like that. I see it as a willingness to just focus on the paying customers and not get hung up on the pirates.\n\n"
    },
    {
      "time": "14 Aug 2008 — 9:36am",
      "content": "Agreed. I think the best thing is to focus on the paying customers and if you love doing type – just keep doing it.\n\nI do it 100% out of passion and to go through the wonderful process of starting from scratch and ending up with a usable font – and I would even if I didnt sell anything at all.\n\n"
    },
    {
      "time": "14 Aug 2008 — 10:40am",
      "content": "\"How do you protect against piracy?\"\n\nYou don't.\n\n"
    },
    {
      "time": "14 Aug 2008 — 11:26am",
      "content": "the sisyphian task of \"protecting\" against piracy inevitably fails, drives up cost, and tends to ruin the experience of legitimate users.\n\nthere have been numerous threads regarding this issue, with a few staunch enforcers, a few \"don't bother\" liberals, and a vast majority of legitimate end users who can only moan about the inconvenience and downright disfunction of the more aggressive protection tactics hopelessly employed.\n\ni think the most useful discussions resolved in general agreement that the best antidote to abuse is education. people (users, students, layout artists) need to better understand the real work that goes into font craft and respect it as such.\n\n"
    },
    {
      "time": "14 Aug 2008 — 11:53am",
      "content": "\\>the sisyphian task of “protecting” against piracy inevitably fails, drives up cost, and tends to ruin the experience of legitimate users.\n\nI think this goes too far. The landmark cases establishing that font piracy is against the law were important. And the occassional prosecution, such as the one not too long ago in England, are also helpful.\n\nFrom other threads it seems that the larger foundries will go after companies, especially large companies that violate copyright. But they don't bother with hobbiests or small business, and there is little that a single designer, without big bucks for lawyers, can to.\n\nIt does seem that a reminder to a company that font piracy is against the law will very often get them to comply, as they are afraid of lawsuits.\n\nSo I think although there is a lot of piracy, it is a not a hopeless situation.\n\n"
    },
    {
      "time": "14 Aug 2008 — 11:58am",
      "content": "Maybe not hopeless but pretty damn close to it William. Go ahead and release your font and find out.\n\nMichael\n\n"
    },
    {
      "time": "14 Aug 2008 — 12:01pm",
      "content": "<cite>How do you protect against piracy? With stock images, they can place code within the picture and scan everywhere until they get a hit.</cite>\n\nThe phobia of font makers is of pathological nature and strictly for psychiatrists. Look at me: I wrote a dozen books, most of them running into several printed editions. But I never bothered to protect my books against piracy. A decade ago, there was a crazy guy who deviced the WORN disk (WORN = \"write once, read never\"). On this special CD disk, authors could store theirs books, but nobody including the authors, could ever retrieve what was stored on this WORN disk. People who invent such devices are crazy in the head. An no sane human being would ever use such crazy devices that \"can place code within the picture\", and similar lunatic stuff.\n\n"
    },
    {
      "time": "14 Aug 2008 — 12:04pm",
      "content": "Michael, I'll find out pretty soon, you're right. My impression is that those who are making good money from creating fonts do a lot of custom work, which by-passes the problem of piracy.\n\nBut then they need to establish a reputation to get custom work. Do you get custom lettering work from people who know about you through your fonts?\n\n"
    },
    {
      "time": "14 Aug 2008 — 12:13pm",
      "content": "The lettering got me the fonts and the fonts get me the lettering ad infinitum. I started out as a lettering artist and continue to do logos, titling etc. See the Node/Tour de ink William.\n\nI was just over on a site and they now have Sweepy up for grabs. This is the third time.\n\nedit: By the way, proprietary does not protect fonts. Employees take them home and then lend them to their friends. I have seen this too.\n\nMichael\n\n"
    },
    {
      "time": "14 Aug 2008 — 12:15pm",
      "content": "_But then they need to establish a reputation to get custom work. Do you get custom lettering work from people who know about you through your fonts?_\n\nMaybe you leak your own fonts to piracy sites! [That's what at least one music group did](http://web.archive.org/web/20141113054819/http:/entertainment.slashdot.org/article.pl?sid=08/08/01/2337206).\n\n"
    },
    {
      "time": "14 Aug 2008 — 12:20pm",
      "content": "Yeah, and I pimp my wife out twice a week!\n\nGet real.\n\nMichael\n\n"
    },
    {
      "time": "14 Aug 2008 — 12:35pm",
      "content": "Although I agree with the basic point that the fonts business is built upon the goodwill and honesty of people licensing fonts, I can’t imagine how ignoring piracy is at all helpful. Even the most fundamentalist Open Source proponent gets annoyed when Open Source licenses are flouted.\n\n"
    },
    {
      "time": "14 Aug 2008 — 1:05pm",
      "content": "\\>See the Node/Tour de ink\n\nI've been looking. I just love it. Fabulous!\n\n"
    },
    {
      "time": "14 Aug 2008 — 1:16pm",
      "content": "As a little note on how cruel the reality can be, my [Exemplar Pro](http://web.archive.org/web/20141113054819/http:/autodidakt.se/index.php?page=exemplar) got \"ripped\" from a PDF, only a couple of days after it had been released. Since my PDF was downloaded hundreds of times during the first days, I guess someone saw the opportunity and grabbed it.\n\nAfter that I made outlines of the font in the complete character set showings, to prevent more piracy. It doesnt look as good on screen that way, but it is a good compromise to outline the complete sets. I should have done it from the start only. The rest was only subsets of the font.\n\nIt was a forum on the internet, someone asked for the font and someone ripped it, simple as that! I made an account on this perticular forum and found out that this person had \"ripped\" and/or shared almost all of the new fonts that was recently released by the major foundries.\n\nI downloaded my own font – now as a PDF-extract since I wanted to see how it worked. Something that is both good and bad with PDF extracting of fonts \"pirate-style\" is that the kerning cant be extracted, so my font was autokerned (without classes and looked terrible) and the hinting was very bad on the \"ripped\" fonts. Also the OT-features were not complete as it was recovered in some way. It's easy to spot the copy, in other words.\n\nSomething that however made me a little less sad, was that the person at least left my copyright string in the font.\n\nEven though this felt terrible in many ways, I have the same passion for type, so it will definately not stop me from doing more typefaces. Good people pay for fonts, and it is for them I design :)\n\n"
    },
    {
      "time": "14 Aug 2008 — 2:13pm",
      "content": "Hey William... post that praise over on the other node.\n\nMichael\n\n"
    },
    {
      "time": "14 Aug 2008 — 2:43pm",
      "content": "\"I can’t imagine how ignoring piracy is at all helpful.\"\n\nThat's true. I think the bigger thing is to remember that trying to fight piracy via DRM is often hurtful.\n\nAs Goran points out, ANY digital media, in short time, will be floating around out in the wild. Accept that, and then focus back on the other non-technical, but more pragmatic solutions: education, law, customer focus, etc.\n\n"
    },
    {
      "time": "15 Aug 2008 — 6:12am",
      "content": "@typerror: _By the way, proprietary does not protect fonts. Employees take them home and then lend them to their friends. I have seen this too._\n\nSure. Certainly. That does happen. But when a fontmaker gets a commission job, makes the specified font(s) and gets paid, a substantial sum of money is acquired and retained by the fontmaker. Unlike retail fonts, piracy of proprietary fonts doesn't affect or reduce the revenue earned by designers/makers of those fonts.\n\nThe UK videogames industry loves me and have given me four separate comission jobs. They paid me a tidy sum of money each and every time, and if any of their employees upload any of the proprietary fonts I made for them—that's their problem, not mine. The tidy sum of money they paid me to make those proprietary fonts remains my property and is unaffected by any piracy those fonts may be subjected to.\n\nj a m e s\n\n"
    },
    {
      "time": "15 Aug 2008 — 6:38am",
      "content": "\"Unlike retail fonts, piracy of proprietary fonts doesn’t affect or reduce the revenue earned by designers/makers of those fonts.\"\n\nI'd say that likely 'more' true, but not an absolute. There really hasn't been any sort of tangible proof that digital media piracy has directly resulted in lost revenue. There's some tangential statistics for both sides of the argument.\n\n"
    },
    {
      "time": "15 Aug 2008 — 10:12am",
      "content": "I can’t imagine how fighting piracy is at all helpful. [For example, governments have tried to block access to a popular torrent site, and only managed generate publicity that increases the number of people using the torrent site](http://web.archive.org/web/20141113054819/http:/torrentfreak.com/the-pirate-bay-sees-boost-in-italian-traffic-following-block-080815/).\n\n"
    },
    {
      "time": "15 Aug 2008 — 12:49pm",
      "content": "I agree James.  \nIgnoring is not condoning, and some prosecution of miscreants may be necessary, but the constant publicizing of the \"piracy issue\" on Typophile only serves to inform would-be villains of opportunities, and reassure them that they stand little chance of getting nailed for their transgressions.  \nAnd who gets the bad rap in these threads? Not the evil-doers, but the foundries, who are castigated for their attempts at self defence as not being more \"customer-friendly\"!  \nThis is why you don't get foundry folk entering these discussions much.\n\n"
    },
    {
      "time": "16 Aug 2008 — 2:57pm",
      "content": "Q. How do you protect against piracy?\n\nA. Offer rewards to turn in companies using pirated fonts.\n\n"
    },
    {
      "time": "16 Aug 2008 — 4:20pm",
      "content": "Matt, how are you going to prove that somebody didn't pay for a font? Sounds like a witch-hunt to be.\n\n"
    },
    {
      "time": "16 Aug 2008 — 7:38pm",
      "content": "In my country, Thailand. We've a large font law suite last few years. After that, printing & publishing company has been learn about font licensing much. So, law enforcement may be helpful.\n\nBut I'm still thinking about how to encourage user to pay for the work. The situation that work right now is to make a license easier. Discount for many license + company license or site license in a very attractive price. Then it'll be a customize version in a reasonable price for customer too.\n\nAt least not going to the most end of black and white.\n\nAny comment & question are welcome.\n\n"
    },
    {
      "time": "18 Aug 2008 — 6:17am",
      "content": "William - you wrote:  \n_I think this goes too far. The landmark cases establishing that font piracy is against the law were important. And the occassional prosecution, such as the one not too long ago in England, are also helpful._\n\nDoes this mean they finally caught the Vampire? (I thought she was working out of Scotland or Ireland.)\n\nI haven't heard of this case, and I feel I've been out of it - would love to know where I can read up on what happened.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nMeanwhile, piracy has become an annoyance and a fact of life. Since each country has it's own set of laws to follow. I've seen torrents in Sweden waving their noses at us...giveaway font sites from India that preach they do not recognize copyright laws of other nations, Russian sites (need I say more about those guys) and my favorite was an American college student, in California, who put up a giveaway site - and had to take it down several months later (yes, after the damage).\n\nSome companies do go after pirates. They do hire people to help stop it. They do hire lawyers to write letters. They do hire hackers to break all connections. Yet, there are too many uneducated people out there, giving away - not just fonts - but all software they can get their grubby little hands on.\n\nWill it end? I hate to sound like a pessimist but if you can get rid of one site - the new one pops up 5 seconds later - it was just waiting in the wings.....\n\n"
    },
    {
      "time": "18 Aug 2008 — 6:59am",
      "content": "Also, for the record, I do believe that one should always go after 'true' pirates...those that are actively reselling IP for profit. That's traditionally what the term 'pirate' referred to.\n\nThat's different than the 'file trader' who is usually not out to make money on the endeavor. They might be out to save a few bucks, but more often than not, they are doing it for no other reason than the fact that they can. ;0)\n\n"
    },
    {
      "time": "19 Aug 2008 — 5:06am",
      "content": "_Also, for the record, I do believe that one should always go after ’true’ pirates...those that are actively reselling IP for profit. That’s traditionally what the term ’pirate’ referred to._\n\nSuch as a designer who sells their design to a client using \"traded\" fonts? That is reselling IP for a profit (without license to do so).\n\n_That’s different than the ’file trader’ who is usually not out to make money on the endeavor. They might be out to save a few bucks, but more often than not, they are doing it for no other reason than the fact that they can. ;0)_\n\nIsn't that also one of the rationale of serial killers: just because they can? There are a lot of things you \"can\" do on the internet. Does that make it innocuous?\n\n"
    },
    {
      "time": "19 Aug 2008 — 6:52am",
      "content": "\"Such as a designer who sells their design to a client using “traded” fonts? \"\n\nSure.\n\n\"Isn’t that also one of the rationale of serial killers: just because they can?\"\n\nProbably. But if you are trying to equate Russian kids swapping fonts with serial killers, I think the sane and civil discussion of this topic may be done.\n\n"
    },
    {
      "time": "18 Feb 2010 — 4:16pm",
      "content": "Talking about Russia, I had to ask for my only font (just released a few days ago on MyFonts), to be removed from forum NoWa.cc.\n\nAs I am a newbie in the typographic world, I think loads of people here should have a look there to see if they can grab their stuff for free.\n\n"
    },
    {
      "time": "18 Feb 2010 — 8:09pm",
      "content": "Having been a victim to a whole lot of piracy, I have to admit it's like chasing rabbits. You can drive yourself crazy going after the offenders. The larger web sites are worth going after, as it lets other offenders know you are vigilant. I found one web site that showed how many fonts had been downloaded. I calculated it, and it came to over $750,000.00 that I lost in potential sales. I contacted them and offered to settle for 10% if they chose not to remove my work. They removed it within a couple of hours.\n\nI have embedded code in each font I have sold and so I know who the original purchaser is if it gets shared or posted on a piracy web site. I have caught several people in the act, and confronted them... this too helps to at least let people know you are serious about protecting your work.\n\n"
    },
    {
      "time": "18 Feb 2010 — 11:33pm",
      "content": "@TypeSETit: given that you are talking about this, I wonder: How difficult is to put such a code into a font? Is it possible to open it in Fontlab, rename the font and delete the code? Does it require a manual generation of the fonts every single time, or this can be automatized? If it is a sensitive subject, you can contact me off-list (click on my icon \\> contact).\n\n"
    },
    {
      "time": "18 Feb 2010 — 11:40pm",
      "content": "[I know that some people in this forum have been said that putting a code into a font is a bit paranoid, but hey, I am just trying to learn.]\n\n"
    },
    {
      "time": "18 Feb 2010 — 11:57pm",
      "content": "If you guys are interested talkin' about that, I'm on the boat too!\n\n"
    },
    {
      "time": "19 Feb 2010 — 4:44am",
      "content": "TypeSETit:\n\n\\> <cite>I have embedded code in each font I have sold and so I know who the original purchaser is if it gets shared or posted on a piracy web site.</cite>\n\nSix years ago, in 2004, I disclosed that Linotype started this embedding of purchaser data (first and last name, company name, street, zip code, city, country, email address, telefon, bank account, customer number, credit card number, pin code, password, etc. etc. etc.)\n\nsee [http://www.sanskritweb.net/forgers/lino17.pdf](http://web.archive.org/web/20141113054819/http:/www.sanskritweb.net/forgers/lino17.pdf \"http://www.sanskritweb.net/forgers/lino17.pdf\"), page 1\n\nsee [http://www.sanskritweb.net/forgers/forgers.pdf](http://web.archive.org/web/20141113054819/http:/www.sanskritweb.net/forgers/forgers.pdf \"http://www.sanskritweb.net/forgers/forgers.pdf\"), page 9\n\nOther font forging outfits adopted this illegal practice of embedding private purchaser data, much to the pleasure of professional phishing criminals, who can easily get access to these private data by hacking and analysing the embedded code of purchased fonts.\n\nPurchasing fonts via online stores is highly dangerous for your privacy, because any phishing hacker can read your private data by analysing the fonts you bought via online fontshops.\n\n"
    },
    {
      "time": "19 Feb 2010 — 7:07am",
      "content": "Here [http://www.typesetit.com/order.html](http://web.archive.org/web/20141113054819/http:/www.typesetit.com/order.html \"http://www.typesetit.com/order.html\") we read:\n\n**\"Don't worry, it's safe and secure... I won't see your private information\"**\n\nThat's a really good joke, considering that he inserts your private data into the fonts you purchase (for the convenience of phishing criminals).\n\n"
    },
    {
      "time": "19 Feb 2010 — 10:17am",
      "content": "And the LINO-table in OTF? Does it personalize fonts?\n\n"
    },
    {
      "time": "19 Feb 2010 — 11:04am",
      "content": "_Purchasing fonts via online stores is highly dangerous for your privacy, because any phishing hacker can read your private data by analysing the fonts you bought via online fontshops._\n\nThat seems to be a bit of a generalization, Uli.  \nAre you accusing me of font forgery and endangering my customers' privacy?\n\n"
    },
    {
      "time": "19 Feb 2010 — 11:36am",
      "content": "I'd suggest you might be 'losing potential sales' with the DRM data you are inserting into the files...provided you are disclosing that to your customers.\n\n"
    },
    {
      "time": "19 Feb 2010 — 12:11pm",
      "content": "\\> That seems to be a bit of a generalization, Uli.\n\nYou belong to the good ones.\n\nBut there are a lot of bad ones in this funny industry.\n\n"
    },
    {
      "time": "19 Feb 2010 — 12:24pm",
      "content": "\\> And the LINO-table in OTF? Does it personalize fonts?\n\nIf you want to avoid phishing via Linotype fonts, do the following:\n\n1. Best advice: Do not buy Linotype fonts.\n\n2. Second-best advice: Do the following:\n\na) Import the Linotype OTF font into Fontlab with\n\n- Import Hinting option switched off and  \n- Import OTF tables option switched off.\n\nb) Generate a plain PS Type 1 font in .PFA format.\n\nc) Remove %% lines from .PFA file with a text editor.\n\nd) Import the .PFA font into Fontlab and rehint it.\n\ne) Resave it as .PFB file or as .OTF or as .TTF file.\n\nSuch a cleaned Linotype font will not contain your private data.\n\n"
    },
    {
      "time": "19 Feb 2010 — 3:31pm",
      "content": "@ Uli\n\nThanks for the tip.\n\n<cite>Best advice: Do not buy Linotype fonts.</cite>\n\nI don’t. I think, that there are dozens of small and a few big foundries, that are much more innovative, technically and with regard to creativity. I will not spend much money for fonts, that were good, before they were badly digitized. Well, Ginkgo is interesting for me.\n\n"
    },
    {
      "time": "19 Feb 2010 — 3:56pm",
      "content": "I don't sell fonts, so it might not be my business, but if foundries wanted to somehow serialize or attach a code which could help them keep track of who what and where then it wouldn't bother me. But having my personal information embedded into a font is another issue.\n\n"
    },
    {
      "time": "19 Feb 2010 — 4:08pm",
      "content": "I presume that companies embedding your credit card number into a font you purchase do not license their fonts for embedding into PDF documents. Otherwise, depending on how much of the font gets embedded, this could affect legitimate purchasers even if they aren't victims of employee malfeasance.\n\nIncidentally, this type of practice, were it perceived as common, could give a valid reason for a major TV network like NBC licensing exactly one copy of a font, putting it on a computer in a locked room, and using that computer day and night for the purpose of applying that font to its promotional materials... instead of buying lots of copies and putting them on lots of computers.\n\n"
    },
    {
      "time": "19 Feb 2010 — 9:53pm",
      "content": "Do they really embed the personal info like credit card numbers, really? Because if I were a foundry, I would just stick an invoice/receipt number into the font file, and that's it. It just doesn't make any sense to do it any other way. Perhaps only out of sheer incompetence.\n\n"
    },
    {
      "time": "19 Feb 2010 — 11:29pm",
      "content": "Miss Tiffany:\n\n\\> <cite>But having my personal information embedded into a font is another issue</cite>\n\nGerman laws do not allow sellers to secretly affix private data (name, address, email, bank etc.) to the commodity you purchase. It is likely that the same holds true for the USA. Here an example:\n\nLet's assume, you marry, and your betrothed buys wedding rings at a jeweller's shop. In the wedding night, you happen to look inside the ring and discover that the first and last name of your betrothed, his postal address and his email, his bank address and his credit card number and other private data had been engraved in small print in Neue Helvetica Ultra Light Condensed into the inside of the wedding ring by the jeweller, secretly without your prior written permission, would you think that this is illegal in the United States? If this is so, then the Linotype practice of clandestine embedding your private data into each Linotype font purchased at the Linotype Website is illegal too.\n\nWould the legal situation in the United States be different, if you visited [www.linotype.com](http://web.archive.org/web/20141113054819/http:/www.linotype.com/ \"www.linotype.com\"), and if Linotype, prior to your purchase, disclosed to you that it embeds all your private data (name, address, email, telephone, bank, etc.) into each font you purchase, and if Linotype requested you to click on an \"Accept\" button stating that by purchasing Linotype fonts you accept to forgo all your privacy rights?\n\nIncidentally, I have a new website [www.chillingeffects.de](http://web.archive.org/web/20141113054819/http:/www.chillingeffects.de/ \"www.chillingeffects.de\") dealing with bizarre legal chilling effects, but this site is in German language only.\n\n"
    },
    {
      "time": "20 Feb 2010 — 5:00am",
      "content": "Wow, I wouldn't even consider placing private information about the purchaser in the font they buy from me. The information that I place in the font is general. It's a serial number (which only I can track) along with the date/time of the purchase. I starting doing this back in 2004 when I first starting selling my fonts to the general public. The very first font I sold for public use... it immediately got shared with 10's of thousands of people in a font sharing group. This was after the person making the purchase assured me in a letter that she would not do such an unethical thing.\n\nIn answer to Cristobal's question: : How difficult is to put such a code into a font? Is it possible to open it in Fontlab, rename the font and delete the code?\n\nThe practice of embedding the serial numbers in purchases will likely come to an end for me because it's a tedious task. My system isn't automated at all. So I manually go into a specific character of the font they are buying and import the serial number from an Illustrator file. It's time consuming. Since I don't sell that many fonts from my own website, I've been able to keep up with it.\n\nHowever, I just recently purchased FontLab (I've been using Fontographer for many years) and plan to convert most of my fonts to OTF forrmat. Once I make those formats available, I will likely end the practice of embedding serial numbers. Perhaps I'll find another way that will help me track who the people are that are sharing my work illegally. (I'm open to suggestions).\n\nRob Leuschke\n\n"
    },
    {
      "time": "20 Feb 2010 — 6:36am",
      "content": "If I'm not wrong, you can only embed fonts purchased from your store. But are you able to track fonts you sell on other shops ?\n\nI'm thinking about MyFonts, because I tried to track which asshole was sharing mine with the short list of buyers I have. I wasn't able to find him/her, and it's a kind of poor hobby.\n\n"
    },
    {
      "time": "20 Feb 2010 — 7:03am",
      "content": "It would be great to embed very discretly some serial number in each purchased font.  \nThen you just have download your file when you see it somewhere, and open fire on the original buyer.\n\nI don't know if pirates are looking for this kind of information before sharing any material, but I think they're not that stupid to give something with their name (or any info) engraved on it.\n\nI'm also working on a update and other fonts, and I would give this update for all my buyers, as to say \"Thank You For Your Support\". And I don't to say \"Thank You\" to someone who's stabbing me.\n\nAlso, — maybe not the topic for but — as I am a young freelance graphic designer, it's hard for me to pay bills. And I'm wondering \"Maybe this guy earns a lot more of money than me\". It's frustrating.\n\n"
    },
    {
      "time": "20 Feb 2010 — 7:57am",
      "content": "\"but I think they're not that stupid to give something with their name (or any info) engraved on it.\"\n\nRight. They'd likely be smart enough to strip it out before putting it out there.\n\n"
    },
    {
      "time": "20 Feb 2010 — 10:22am",
      "content": "Well, some protection is better than no protection, right? According to TypeSETit experience, some people just share the files as they receive it.\n\nAnyway, I don’t think it’s possible at this moment to implement that kind of protection for fonts purchased in sites like Myfonts. If this is the case, the only way to go is to trust in your clients.\n\n"
    },
    {
      "time": "20 Feb 2010 — 1:37pm",
      "content": "I do have a similar embedding in the fonts at MyFONTS, but they are identical for all the purchases. So, while I'm able to track that a shared font came from MyFONTS, I can't tell who the individual offender was.\n\nThe only case where I WAS able to do that was when my font, RoadRage got shared after someone purchased it from MyFONTS. Within a week of release, it was being shared. I knew who the offender was because it was the only sale.\n\n"
    }
  ]
}
