{
  "id": "4843",
  "title": "Typeface recommendations please",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I have been asked by a client to design a brochure advertising the sale of a luxury \"boutique\" island hotel. The hotel is described as being in the \"plantation\" style   \n   \nI know that in the end the choice of typeface is a very personal decision, but having read many of the articles here recently I would be very interested to hear your thoughts, perspectives and recommendations.   \n   \nThe brochure is aimed at a select group of extremely wealthy private and corporate investors. Potential purchasers would be buying the hotel as a trophy asset.   \n   \nCommunicating the textual information of this brochure clearly, efficiently and legibly is of primary importance. However, there are some beautiful images of the hotel that will also be included.   \nThe ratio of text to images will be about 60/40. The general feel of the brochure will be very clean with plenty of white space.   \n   \nThe brochure will be printed on a white matt coated stock.   \n   \nGiven the different kinds of text and tables/diagrams in the brochure I will need a serif and a sans with small caps, lining and OSFs. I dont mind if these are a \"matching\" pair (eg scala serif/sans) or two different faces that compliment each other.   \n   \n2 versions of the brochure will be printed, one in english, one in French so it is important that the type works well with all the accents etc in the french version.   \n   \nI have spent so much time reading the articles here recently that I have slightly overloaded myself with all the potential options available. I am now a bit confused!   \n   \nFirst and foremost this is a corporate financial communication. However I feel a little of elegance, style and sophistication of both the hotel and it's clientele should come through in the typography. I am wary though that it would be all too easy to overdo this.   \n   \nIn the past the hotel has used various serifed type for it's logo and communications varying from Times (yuk) to Garamond (good but a bit dull) to ITC Novarese (excllent (IMO) for advertising the hotel to guests but maybe a bit much for this).   \n   \nI have been given a pretty free reign with the type so I would like to use something that is not too common.   \n   \nI would like a sans that works well as a text face - not just headings.   \n   \nI think that's everything - Fire away!\n\n",
  "author": "spirit",
  "time": "19 May 2004 — 10:04am",
  "uid": "3622",
  "comments": [
    {
      "time": "19 May 2004 — 1:04pm",
      "content": "This sounds like a pretty interesting project.   \n   \nI might go for something colonial, and maybe weathered.   \n   \nWhat about Founder's Caslon? [http://www.hwcaslon.com/](http://web.archive.org/web/20131018224245/http:/www.hwcaslon.com/)   \n   \nIf you go too anachronistic though you might have trouble finding a good sans, especially a texty one. Or you could have a sans that contrasts sharply with the Roman, since the hospitality industry is generally about clean, shiny, efficient things. Like something from Spiekermann.   \n   \nAnother serif idea is Octavian: somewhat old-fashioned, dignified, and highly readable.   \n   \nOh wait, I got it! Quadraat, serif & sans. And there's a really cool Headliner cut too.   \n   \n\\> the choice of typeface is a very personal decision   \n   \nWell, in that there are simply too many choices, I agree! :-)   \nBut there are still good and bad choices, of course.   \n   \nhhp\n\n"
    },
    {
      "time": "19 May 2004 — 11:43pm",
      "content": "[**Monticello**](http://web.archive.org/web/20131018224245/http:/www.creativepro.com/story/feature/20027.html)\n\n"
    },
    {
      "time": "20 May 2004 — 4:12am",
      "content": "I'm prepping a book right now with Monticello and I love it. Nevertheless, I would not recommend it for printing on a white matte coated. Nor for a spendy sales piece for Trump wannabes. Same goes for Founder's Caslon. Seems like a real mismatch to me.   \n   \n-- K.\n\n"
    },
    {
      "time": "20 May 2004 — 4:32am",
      "content": "Okay, in an effort not to be merely a naysayer, let me see if I can offer a different suggestion.   \n   \nYour brief wasn't crystal clear to me, so I may be way off base. But I think if I was creating a lavish sales piece for wealthy island-shoppers with full-color photos and a matte uncoated (like Vintage Velvet, mmm) then I might try combining the following:   \n   \nI'd start with Hoefler Titling for some nice large graceful heads. I'd also use it to pull out keywords as graphic elements to play against large beauty photography.   \n   \nThen I'd use MvB Verdigris for the main sales text. And give it an extra bit of air for a relaxed, \"I can afford to be extravagant\" feeling.   \n   \nI'd follow up with FTF Stella for all the nuts and bolts sans serif stuff -- complementary bits of text, captions, financial tables.   \n   \nHoefler Titling will give you all the elegance and luxury you need. Use it sparingly and set it is island colors. Verdigris is classic, but fresh and solid: very reassuring. Stella is clean and versatile, friendly but confident.   \n   \nThis is not a combination I've tried yet. Just making it up. And it's been a while since I did any marketing sales pieces. But at least now others have something to respond to and maybe you'll get some good suggestions.   \n   \nGood luck.   \n   \n-- K.\n\n"
    },
    {
      "time": "20 May 2004 — 5:34am",
      "content": "As Kent and Hrant and John point out, there are at least two way you can go :-) Antiquated plantationism, or nanny toting yuppyism. I wouldn't get too locked in to overly antiqued \\*plantation\\* style type if your audience is looking to buy the island. Kent, I was thinking [HTF Requiem Titling](http://web.archive.org/web/20131018224245/http:/www.typography.com/catalog/requiem/index.html) for even more grace!   \n   \nAt any rate here are some photos from a visit to a plantation on Martinique in the French West Indies. The type is on the rustic side, but you may find it useful. I got some very odd looks from the staff as I ran around photographing the inside of victrolas and every swinging rhum label on display... all for the type.   \n   \nRandy   \n   \n ![](http://web.archive.org/web/20131018224245im_/http:/www.typophile.com/forums/messages/4100/36405.jpg)   \n ![](http://web.archive.org/web/20131018224245im_/http:/www.typophile.com/forums/messages/4100/36406.jpg)   \n ![](http://web.archive.org/web/20131018224245im_/http:/www.typophile.com/forums/messages/4100/36407.jpg)   \n ![](http://web.archive.org/web/20131018224245im_/http:/www.typophile.com/forums/messages/4100/36408.jpg)   \n ![](http://web.archive.org/web/20131018224245im_/http:/www.typophile.com/forums/messages/4100/36409.jpg)\n\n"
    },
    {
      "time": "20 May 2004 — 6:08am",
      "content": "Well, if you wanted to go for that French colonization, plantation sort of feeling, then consider the MvB Sirenne series, perhaps, and build the whole thing around that. I don't know what you'd do with the financial tables. You're on your own there.   \n   \nUnless you're trying to brand the hotel itself, however, I think I'd stick to trying to appeal to the wealthy and leave it to someone else to come up with all the local-color, vernacular hotel branding later, once they've bought the thing.   \n   \nBut you might put the question to your client.   \n   \n-- K.\n\n"
    },
    {
      "time": "20 May 2004 — 11:43am",
      "content": "Thank you all for your comments and suggestions, I am very grateful for your help.   \n   \nI think \"nanny toting yuppyism\" is definitely where I need to be aiming as opposed to \"Antiquated plantationism\"   \n   \nI hesitated about mentioning the plantation thing at all and added it at the last minute - I almost wish I hadn't now as it's a bit of a red herring. As Kent implied - a good place to start for branding the Hotel, but not for selling it.   \n   \nI say \"almost\" wish I hadn't mentioned it because even though it's not right for this project, I loved Randy's Rum labels - absolutely great - thank you for those!   \n   \nKent   \nI have to say that I have found your take on the project to be absolutely spot on - even if my brief was not so clear! Thanks for your insight and recommendations.   \n   \nHrant   \nI was a bit worried when I saw your first suggestion of FWCaslon as I agree with Kent that it would not be right at all for a piece of corporate financial communication (sorry). However Quadraat was something I was (and still am) considering. Thanks.   \n   \n   \nIf you have any more suggestions along the \"nanny toting yuppyism\" line I would love to hear them as unfortunately I don't own any of the fonts mentioned by Kent!   \n   \nthanks again   \ns\n\n"
    },
    {
      "time": "20 May 2004 — 3:23pm",
      "content": "Your original suggestion of Garamond as \"good but a bit dull\" tends to suggest it might be right. There doesn't seem to me to be anything wrong with \"a bit dull\" in this context. If you get the details right some Garamond or a Garamondish thing (Sabon, say) could be just what's wanted, and the blandness might let you be a bit bolder in display.   \n   \nSome other random suggestions (Warning! from a typographic amateur, but one who knows a few nanny-toting-yuppies):   \n   \n(1) If for an American audience, how about something by Goudy: FB Californian, eg. This kind of elegant but slightly precious font seems to have an old-money yacht club kind of feel: reliable elegance. It might be too mannered for text, but it would certainly be a candidate for display. I'd be worried that Hoefler Titling or Requiem are too much \"old aristocracy\" and a bit too literary. Goudy for people who bought their furniture, which is what you probably want.   \n   \n(2) If you're thinking of Quadraat have a look at Smeijers' Fresco [(from ourtype)](http://web.archive.org/web/20131018224245/http:/www.ourtype.com/) too. It's pretty bland (I mean that in a good way), and pretty complete too. I've only seen one book set in it, and it looked finely reticent. You might also have a look at Arnhem, though it has some quirks which you might not want (notably very low cap height).   \n   \n(3) Could Galliard be another possibility? Seen around a lot. Used in books a lot. Now rather out of fashion around these parts? But it's classic and polished without being tricksy. A great deal seems to depend on how well it's set and printed.   \n   \n(4) Finally, what about Le Monde? Everything's there, it looks great printed, and any implications or overtones it has will be exactly the right sort of thing. More \"businesslike\" than Garamond or Galliard, but that may be no bad thing.\n\n"
    },
    {
      "time": "21 May 2004 — 2:17am",
      "content": "Scala is not a bad idea, but i found the Serif a bit straight for the subject. Scala Sans got all necessary qualities you're looking for. perhaps the open caps series from Scala can be fun to use too?   \n   \nBliss, as Gotham and others are too clean for that subject (in my opinion).   \n   \nBecause Paul Stanley refer to Le Monde, why not the full ligatured-alternates Le Monde Livre Classic [http://www.typofonderie.com/alphabets/view/LeMondeLivreClassic](http://web.archive.org/web/20131018224245/http:/www.typofonderie.com/alphabets/view/LeMondeLivreClassic) combined with Scala Sans, with the beautiful Sirenne for some titling?   \n   \nAnd why not Cochin? the italic is wonderful: [http://www.myfonts.com/fonts/linotype/cochin/familytree.html](http://web.archive.org/web/20131018224245/http:/www.myfonts.com/fonts/linotype/cochin/familytree.html) Combined with Peignot!! (be careful Peignot is not easy to handled to produce a result with style and not amateurism).\n\n"
    },
    {
      "time": "22 May 2004 — 11:45am",
      "content": "This begs the question -- how can a designer pick a face out of the blue without seeing a word of text or any visuals? I'll admit to being a dinosaur among you but in my day we picked the right horse for the load before we put it in front of the cart.\n\n"
    },
    {
      "time": "20 May 2004 — 10:06am",
      "content": "Sirenne is beautiful. MvB also has a Sirenne 6 for smaller sizes. For the sans, what about something very stark, closer to Cason's sans, like Gotham. Hmm. Although Gotham doesn't have smallcaps. How about Jeremy Tankard's Bliss?\n\n"
    },
    {
      "time": "20 May 2004 — 10:25am",
      "content": "Although Bliss is closer to Gill which means it isn't similar to Caslon's Sans. I meant to add that.\n\n"
    }
  ]
}
