{
  "id": "48432",
  "title": "The 66 Character Line / MS Word Preset as Scourge",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m a designer for a poetry chapbook press and I’m constantly running into manuscripts that have been influenced to ungainly effect by the specter of MS Word’s preset.\n\nI remember reading in Bringhurst that the 66 character line is the ideal length for continuous reading, but does this even apply to poetry? Have there been studies that backup this notion? I feel that I can’t really make suggestions unless there is some research to back this up.\n\nIs it presumptuous of the designer to suggest a slightly modified textblock that might improve the overall readability of the work? Doesn’t it seem wrong that a word processor should be the palette for a book that is a work of art?\n\nDisclaimer: I’m a poet who wasn’t aware of things like this before I became a designer so I understand why it isn’t necessarily intuitive to be thinking of the dimensions of the book when composing. Am I just griping? Down with legal size asfjd;lasfj!!1!\n\n [‹ creating light and bold from regular](http://web.archive.org/web/20080821162747/http:/typophile.com/node/48545 \"Go to previous forum topic\") [Open source layout/word processing software with support for Opentype? ›](http://web.archive.org/web/20080821162747/http:/typophile.com/node/48354 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821162747/http://typophile.com/user/24749\" title=\"View user profile.\">fi</a>",
  "time": "<br>",
  "uid": "24749",
  "comments": [
    {
      "time": " 14.Aug.2008 8.11pm",
      "content": "I mean I’m sure Word can be blamed for lots of things (gas prices, street gangs, Avian Flu) but can it really be blamed for long line lengths being the standard? Seems as if the answer would be multicolumn as the default, and that seems to be the opposite of what you want - clean text uninfluenced by the authoring tool? Beyond that why not provide a template to the authors? Push good practice upstream.\n\n"
    },
    {
      "time": " 14.Aug.2008 9.21pm",
      "content": "The ~66 character line recommendation is for continuous reading at average text sizes (10-12 points) with reasonable leading. It’s related to saccades, the tiny eye movements across the line as one reads. Too many saccades on a single line causes discomfort and head turning, which distracts the reader, too few and the reader gets annoyed at dropping to the next line so quickly. IIRC Unger covers this in _While You Are Reading_ which has a monster bibliography.\n\nAnyway, I would hope that good poets wouldn’t be composing in a word processor to begin with. If Neal Stephenson can write with a Mont Blanc than poets can.\n\n"
    },
    {
      "time": " 15.Aug.2008 4.49am",
      "content": "<cite> &gt; I remember reading in Bringhurst that the 66 character line is the ideal length for continuous reading, but does this even apply to poetry?</cite>\n\nIn a word: No.\n\n— K.\n\n"
    },
    {
      "time": " 15.Aug.2008 7.12am",
      "content": "I heard Bill Hill of Microsoft at last year’s TypeCon say that the reason the 66 character limit works is that beyond that you have to turn your head, not just your eyes. And that slows you down—or maybe because it more likely you will have to look twice for the next line, but I don’t remember exactly.\n\n\\>can it really be blamed for long line lengths being the standard?\n\nWell somewhat. Microsoft chose a condensed face—Times New Roman—as its default, knowing most people are going to be printing on letter sized paper or A4. With typewriters, Courier was designed so it would give the 66 character length on letter sized paper; Times New Roman at 12 point is way more. Given that these paper sizes are standard, I’m not sure that there is a general best solution, but the choice of Times New Roman—a great typeface in other settings—exacerbated the problem.\n\n"
    },
    {
      "time": " 15.Aug.2008 1.20pm",
      "content": "_Have there been studies that backup this notion?_\n\nGMAFB from these “I need scientific studies to tell me what good typography is” threads!\n\nPoets determine line length, not typographers.  \nA study would be asking stupid questions like are Lorca’s _Canciones_, with their very short lines, more “readable” than his _Ode to Walt Whitman._\n\n"
    },
    {
      "time": " 16.Aug.2008 7.05am",
      "content": "Two potential issues with continuous text reading are what I call “track-back” and “drift”.\n\nTrack-back refers to the activity of moving from the end of one line to the beginning of the next line. Ideally this happens smoothly, effortlessly, accurately, without distraction, without losing your place, without needing to look back up to recall the end of the previous line, etc.\n\nLong line lengths can undermine track-back — all the eye-turning/head-turning sorts of things mentioned.\n\nDrift refers to the phenomenon of accidentally slipping from one line to the next, mid-line. One of the most common culprits in drift is excessive word-spacing. When the word space approaches the distance between lines, then drift becomes more likely. Short line lengths (justified) generally lead to greater extremes of word spacing and can become susceptible to drift.\n\nAll of this is in the context of continuous text reading — where the text/content generally has narrative linearity, momentum, forward motion.\n\nPoetry happens in a different mental time/space. It is a different typographic animal.\n\n<cite> &gt; Poets determine [poetry] line length, not typographers.</cite>\n\nPrecisely.\n\n— K.\n\n"
    },
    {
      "time": " 16.Aug.2008 11.05am",
      "content": "To continue with the Lorca observation, it seems to me that poets (not just of the concrete variety) have long been aware of the effect of layout on printed verse, and follow the general maxim that the longer a poem, the longer the line lengths, and the more the look of prose. It’s a question of pleasant proportion in the document, as much as any purely literary concern.\n\nBlake’s _Songs_ and his _Prophecies_ are an extreme example. But even Eliot follows the principle: _The Hollow Men_, for instance, has shorter line lengths than _The Waste Land._\n\nAnother factor may be whether the verse is meant for silent visual reading, or to be listened to, the difference being that within the three-second span of conscious apprehension, many more words can be held by eye than ear. The relationship between temporal duration and speech/verse is discussed by Ernst Pöppel (originator of the 3-second theory) in _Mindworks._\n\n"
    },
    {
      "time": " 18.Aug.2008 11.51am",
      "content": "“Poets determine line length, not typographers.”\n\nI agree with this in principle but when I see most formal variation dominated by the same Word preset it makes my head hurt. I’ve done an MFA in poetry and worked for literary magazines and it was often very apparent when the poem was composed for an 8.5 x 11 page without any preexisting aesthetic consideration (just one of wanting to use the “whole” page). I’ve talked with poets about this and many say they just open Word and go.\n\nI know it sounds silly to ask for science to speak to poetry, but its just as bad to ask a word processor to do the same.\n\n"
    },
    {
      "time": " 18.Aug.2008 12.22pm",
      "content": "I love Whitman’s long lines btw.\n\nThis is more pointed to poets who employ dramatic use of white space and want to preserve each page as is from .doc to print. In the setting of a literary magazine, where page dimensions are fixed, this is often unrealistic, no? Not many can afford to produce [Volt](http://web.archive.org/web/20080821162747/http:/www.voltpoetry.com/html/about.html).\n\nI encourage poets to make aesthetic use of white space but not from the standpoint of the arbitrary hegemonic preset!\n\nI can see how this can come off as whiny but I think its in the interest of producing better work for all involved.\n\n"
    },
    {
      "time": " 18.Aug.2008 12.29pm",
      "content": "Why not scale their artwork to fit the page and send them a page proof?  \nWhen they print it out and see how tiny their text is going to be, they might get the message.\n\n"
    },
    {
      "time": " 18.Aug.2008 1.54pm",
      "content": "“Why not scale their artwork to fit the page and send them a page proof?  \nWhen they print it out and see how tiny their text is going to be, they might get the message.”\n\nNow we’re getting somewhere.\n\n"
    },
    {
      "time": " 18.Aug.2008 5.38pm",
      "content": "Thanks to everyone for all the resources.\n\n"
    }
  ]
}
