{
  "id": "48444",
  "title": "Really bad font",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Does anyone have an idea what this might be? Not the face that Washington Mutual is set in, but the other real bad one.\n\n ![](http://web.archive.org/web/20081122114201im_/http:/www.typophile.com/files/330_4336.jpg)\n\n [‹ Matt Keers](http://web.archive.org/web/20081122114201/http:/www.typophile.com/node/48524 \"Go to previous forum topic\") [Gothic for peace, justice, etc. ›](http://web.archive.org/web/20081122114201/http:/www.typophile.com/node/48496 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122114201/http://www.typophile.com/user/20906\" title=\"View user profile.\">ascheid</a>",
  "time": "<br>",
  "uid": "20906",
  "comments": [
    {
      "time": " 15.Aug.2008 8.54am",
      "content": "The _really bad font_ is [Missive](http://web.archive.org/web/20081122114201/http:/www.myfonts.com/fonts/t26/missive/).\n\n"
    },
    {
      "time": " 15.Aug.2008 9.19am",
      "content": "Ahh, the early 90s are back :-)\n\n"
    },
    {
      "time": " 15.Aug.2008 10.09am",
      "content": "Every time I walk by a WaMu I’m amazed this typeface was given the thumbs up by a national bank. _Any_ committee, really — be it design, administrative, or executive — that approved this must have been asleep or incompetent. It doesn’t exactly inspire confidence in an institution.\n\n"
    },
    {
      "time": " 15.Aug.2008 11.47am",
      "content": "This is a bank??! Holy Maccheroni!\n\n"
    },
    {
      "time": " 15.Aug.2008 12.10pm",
      "content": "Huh? Formata and Missive seem like a perfect match to me.  \nI just did an identity for an accountant with Fudoni. Turned out just lovely.\n\n– guiyong –\n\n"
    },
    {
      "time": " 15.Aug.2008 12.31pm",
      "content": "kerning aside, this does seem like an interesting use of a ’bad’ font in a nice way. Certainly adds some character.\n\n"
    },
    {
      "time": " 15.Aug.2008 1.26pm",
      "content": "There are at least 50,000 faces with character that aren’t amateurish.\n\n"
    },
    {
      "time": " 15.Aug.2008 1.57pm",
      "content": "In this case, “amateurish” might be a bit subjective. I’d agree that the typesetting appears amateurish, but I could see arguments for the typeface choice going off the ’difference’ tagline.\n\n"
    },
    {
      "time": " 15.Aug.2008 2.03pm",
      "content": "To me, this font looks like you rasterized some type at 72 dpi, and then used a live trace.\n\n"
    },
    {
      "time": " 15.Aug.2008 2.17pm",
      "content": "It’s slop. A clumsy mix of maybe Garamond and Futura with poor decisions (if any were consciously made) about which pieces of each style to use. Even in the context of the grunge era it is bad. Stephen Farrell did better stuff, notably Flexure.\n\nThe typesetting doesn’t save it either. The layout is thoughtless scatter and they didn’t even bother to use a proper apostrophe.\n\n"
    },
    {
      "time": " 15.Aug.2008 4.09pm",
      "content": "The ear on the “o” bugs the hell out of me. Among other things, of course.\n\n"
    },
    {
      "time": " 15.Aug.2008 8.38pm",
      "content": "I make this font, it is class.\n\n"
    },
    {
      "time": " 16.Aug.2008 1.59am",
      "content": "Oh sweet Wolf Olins, they know how to have people talking about their work...\n\n"
    },
    {
      "time": " 16.Aug.2008 3.58am",
      "content": "The kerning is abysmal too. This typeface does not have one redeeming feature.\n\nReally? Wolff Olins? I guess the quality control department must have been on vacation when this was passed.\n\nNick Cooke\n\n"
    },
    {
      "time": " 17.Aug.2008 3.55pm",
      "content": "Is Wolf Ollins handling WaMu stuff now? It was [Sedgwick Road](http://web.archive.org/web/20081122114201/http:/www.sedgwickrd.com/work/port/wamu.aspx), a Washington State ad firm for a long time, and I would imagine the wall graphics in the above photo were produced during the Sedgwick Years.\n\nWaMu was also one of the worst offenders for selling no-income no-asset home loans during the past few years, but will inevitably get an idiotic government bailout that keeps all of their profit in the hands of private investors, and funnels them billions of taxpayer dollars. Sorry to veer into politics, but you could say that typeface is a great metapohric foreshadowing of the broken and imbalanced banking they engaged in for the past few years.\n\n"
    },
    {
      "time": " 18.Aug.2008 7.46am",
      "content": "“didn’t even bother to use a proper apostrophe”\n\nAck! You’re right. I take back my argument. This \\*is\\* slop.\n\n"
    },
    {
      "time": " 18.Aug.2008 9.03pm",
      "content": "Ha ha, I walked into a WaMu just today, noticed the straight “apostrophe” and the weak qualities of the face, and thought about posting it here. I don’t particularly care for Dead History, but Dead History did it better.\n\n"
    },
    {
      "time": " 19.Aug.2008 12.33am",
      "content": "Oh God, I have WaMu as my bank and going in there to see this horrid font on display makes my skin crawl. I really hope they decide to change it soon.\n\n"
    }
  ]
}
