{
  "id": "48455",
  "title": "OpenType installation problem",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Apologies if this is not the site to ask these questions, but I have a user moving working font files from one PC to another - both running XP SP3. She has even tried installing from clean copies with the same results, per below:\n\n- Open Type Fonts generate a ’file is missing or damaged’ message  \n- OTF fonts show up in /fonts/ folder, but are designated as TTF - trying to open these files also generates ’file is missing or damaged’ message  \n- The icon associations are all over the map: .ttf files that call themselves ’True Type’ have a true type icon, .otf files that call themselves Open Type (and don’t work) have an open type icon; and .ttf files that say True Type but say they are an ’Open Type Font with True Type Outlines’ when I open them also have an open type icon. This may be normal, I don’t know.\n\nIt is unclear to us whether this is a Problem with the font files or with Windows. Any advice/referrals much appreciated.\n\n",
  "author": "<a href=\"/web/20100103022448/http://typophile.com/user/35558\" title=\"View user profile.\">krdoughty</a>",
  "time": "<br>",
  "uid": "35558",
  "comments": [
    {
      "time": " 17.Aug.2008 4.14am",
      "content": "Try to open and view the OTF files with a program that does not use any of the Windows APIs. If that fails, it’s the files themselves that have been damaged in the transfer.\n\nIf not, your Windows installation might need a refresh ...\n\nThe icon oddities come from the fact that Windows looks at the file extension — otf is OpenType, ttf is TrueType. _Then_ it checks whether the file is digitally signed — “yes” shows an OTF icon, “nope” shows a TTF icon. Go figure.\n\n"
    },
    {
      "time": " 17.Aug.2008 1.46pm",
      "content": "Many tx, Theunis. Fingers crossed for a resolution!\n\n"
    },
    {
      "time": " 7.Nov.2008 12.12pm",
      "content": "Hi,  \n@krdoughty: did it work? because i got a quite similar problem. It can’t be a transfer-problem as there were no transfer. It happened just by that, but i can’t link it to anything i did/installed/deinstalled/blocked.  \nI’ve got a InDesign-Document where i used a opentype font. One Day I opened it and my font was not available any more. first I thaught it was a licence problem, because i used an adobe-font. Then I realised that all my opentype-fonts did not appear in the pull-down menu.  \nin the folder windows\\fonts the opentypes are all broken, some truetypes have opentype-icons instead, but work. I installed the adobe type manager, but it also tells me, that the fonts are broken. also new downloaded files from free opentype fonts from the internet does not work on this system, but do on my notebook.  \nDoes anyone got an idea what happened?\n\nthank you in advance,\n\nboronian\n\n"
    },
    {
      "time": " 9.Nov.2008 3.40am",
      "content": "ok, I found out, that it seems to be a driver-problem (not that surprising...) concerning nVidia-graphics and ASUS Mainboards (see [here](http://web.archive.org/web/20100103022448/http:/www.laptopvideo2go.com/forum/index.php?showtopic=18538) and [here](http://web.archive.org/web/20100103022448/http:/www.techsupportforum.com/microsoft-support/windows-xp-support/122491-can-not-install-otf-fonts-damaged.html)) for not wanting to be outdated (as the other blogs purpose) I first will try to update all my other drivers. If it works I will tell.\n\n"
    },
    {
      "time": " 9.Nov.2008 6.23am",
      "content": "only the older versions give you the otfs back. sad but true. i installed now version 169.21 for the graphic card and everything is fine again. good luck to the others having this prob.\n\n"
    },
    {
      "time": " 29.Dec.2009 12.28pm",
      "content": "Hey @krdoughty,\n\nI had a problem just like yours with OTF fonts after a recent format in my workstation. There´s a [specific registry entry](http://web.archive.org/web/20100103022448/http:/forums.laptopvideo2go.com/topic/18538-9300m-xp-otf-and-lots-of-surprises/page __view__ findpost __p__ 100403) into the Windows XP´ regedit that solves the problem. Everything is OK now - lots of thanks to @boronian for the links.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n[http://pedromoura.com.br](http://web.archive.org/web/20100103022448/http:/pedromoura.com.br/ \"http://pedromoura.com.br\")\n\n"
    }
  ]
}
