{
  "id": "48452",
  "title": "Media(/marketing) company logo, design from scratch",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey guys. First of all: I’m new here, so please forgive me if I’m doing something horribly wrong somehow :).\n\nI made the following logo for a new company I’m founding with two friends of mine. We’ll be focusing on music and music marketing in specific, but expanding our activities to other domains is still possible...\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo_3831.png)\n\nI didn’t want the link between the logo and what we represent to be too explicit. Maybe I should also mention that the “atticus” is a part of the inner-ear (also known as Epitympanum or Attic). The logo is composed out of 2 Pantone colours. I also have a draft of a monocolour version and a black background version, but I wanted to hear what you guys think first :). Thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [atticus\\_logo.png](http://web.archive.org/web/20081122104749/http:/typophile.com/files/atticus_logo.png) | 11.83 KB |\n\n [‹ Photographer's logo, critique please](http://web.archive.org/web/20081122104749/http:/www.typophile.com/node/48834 \"Go to previous forum topic\") [Logo for Job Agency ›](http://web.archive.org/web/20081122104749/http:/www.typophile.com/node/48719 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122104749/http://www.typophile.com/user/35542\" title=\"View user profile.\">Xavez</a>",
  "time": "<br>",
  "uid": "35542",
  "comments": [
    {
      "time": " 15.Aug.2008 4.13pm",
      "content": "Seems quite random. Could you possibly explain your rationale behind the swash and colour selection? Does the swash graphically relate to the ‘atticus’ part of the inner-ear? I see your reason for differentiating the ‘c’ but maybe this gives the ‘c’ too much emphasis.\n\n"
    },
    {
      "time": " 15.Aug.2008 4.45pm",
      "content": "I like the idea behind the company name and logo, but I have to say, its not something a regular joe would know. To me, the name says either abacus or attica, neither of which has the connotation you desire. But thats just my .02\n\nAs for the logo, I dont mind the wordmark, but I am not understanding the reason for the swash. SO many logos have the swash, that it isnt really adding anything to your concept, and the gradient isnt helping. I think losing the swash and focusing on your font is a better use of your energies.\n\nPerhaps lose the wedge between the “t”s and make it a ligature? My eye goes straight to that.\n\n"
    },
    {
      "time": " 16.Aug.2008 1.25am",
      "content": "Hey guys, thanks for the comments!\n\nAs for the colour choice: I wanted something that was solid, looks good on both dark and light backgrounds and I wanted the C to stand out in a signaling colour. The choice of red is completely arbitrary, I have to admit :). It just didn’t \\*work\\* for me with green, yellow/orange or blue/purple. So there really is no motivation behind that choice :).\n\nThe swash on the other hand actualy _is_ motivated. Maybe it looks too much like a swash, but it is actually supposed to represent a tube -\\> hearing canal. The spacing between the tube and the logo represents the atticus (it’s actually an empty space, an atticus—not so easy to represent ;-)).\n\n@tearsforsappho: I don’t think it is _that_ important that a regular Joe knows what the name stands for. To us and to some other people it means something and to various others it just sounds great. We’re quite okay with that :).\n\nI adjusted the swash a bit so that it looks more like a tube now. Also changed the tt.\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo_5302.png)\n\nThanks for the comments so far!\n\n"
    },
    {
      "time": " 16.Aug.2008 2.48am",
      "content": "Worked a tad more on the kerning (t-t and t-i)\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo_5860.png)\n\n"
    },
    {
      "time": " 16.Aug.2008 7.06am",
      "content": "Hi Xavez,\n\nI would lose the gradient on the swash all together. It simply doesn’t look professional. It will also cause you trouble in the long-run since it’s very difficult to scale down gradients, especially at smaller sizes, e.g. on business cards.\n\nThe color scheme you chose doesn’t look very appealing to me either. The brown is not a proper one. It looks kind of dirty to me. But don’t worry, changing the colors is very easy. You should always develop your logos in black and white and shades of grey, and then add color later!\n\nHope this helps. Good luck with it...\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122104749/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 16.Aug.2008 8.02am",
      "content": "Hey\n\nThanks for the comment. Apparently nobody seems to like the gradient. But the gradient is what makes the swash different from every other swash. If I make it flat, it degrades to a completely meaningless swash. But maybe that means my original idea was a bad idea to begin with :).\n\nAs for the colours: I did develop the logo in black on white and white on black. I also developed a very bright and colourful google-like colourscheme, but that would simply cost too much to print in spot colours. Maybe I need to head a different direction on the colour scheme though.\n\nPS: I always look at tiny and very large versions of the logo as well when I’m designing it. There are no technical difficulties concerning the gradient (I printed it). It actually looks quite good on a business-card/back cover of a vinyl/cd when printed :) (15mm of height). You can check that out when you zoom out the page if you’re browsing in Firefox :).\n\nMaybe I need to go back to the sketchboard with this :p.\n\n"
    },
    {
      "time": " 16.Aug.2008 8.12am",
      "content": "_Apparently nobody seems to like the gradient. But the gradient is what makes the swash different from every other swash. If I make it flat, it degrades to a completely meaningless swash. But maybe that means my original idea was a bad idea to begin with :)._\n\nYou came to the right conclusion with this one. As a form, the swash doesn’t add meaning to your logo in a significant way. If the only thing that’s differentiating your swash is a gradient, then you seriously need to rethink the swash.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 16.Aug.2008 9.51am",
      "content": "So I started thinking again... Basically, an atticus is an empty space, so I wanted to create an empty space with the letter A. Since we are a media company that will be largely focusing on music media, I simply took the most common media forms we will be producing: cd’s and vinyl. And they are round discs. So I simply took a disc :). The extra border represents a vinyl groove, but I’m not too sure whether that works when I shrink it to a smaller size...\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_5275.png)\n\n"
    },
    {
      "time": " 16.Aug.2008 10.44am",
      "content": "Much better already!\n\nIn this version it kind of hurts my eyes that the foot of the “A” is not in line with the other letters. It looks like it’s going to jump up any moment, which I find quite disturbing.\n\nI really like the fonts you chose, however there’s quite a bit (maybe too much) going on in this picture. There’s the “A”, the “tt” ligature, and then the carved out “i”. If you pick one of those details and develop it further, rather than all 3 of them, the chances to end up with an outstanding logo are much higher in my opinion.\n\nProve me wrong, if you like though! I’m really curious.\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122104749/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 16.Aug.2008 11.39am",
      "content": "I like the name quite a bit, there are plenty of companies whose name may not be understood by the average joe.\n\nAnd I like your new direction. The swash did not bother me as much as it did others, it made me think of the gentle curves of an ear (but I did only think of that after I knew what Atticus meant).\n\nTintin81 is correct, there is too much going on. I prefer the simple circle without the outline. And in these latest designs I find the ovelapping “c” distracting, it’s sending the “tti” to the background. And like a puzzle I keep trying to figure out why. Also why the period at the end? Is it big circle = vinyl, little circle = CD? Is your name actually “Atticus.”?\n\nfinally the purple just isn’t doing anything for me. Look at other logos either in your field or just other samples. Which colors are you drawn to? Do the colors help convey the meaning of the logo? Is there a secondary message? for example; strength, speed, high-tech, eco-friendly, and etc. What would be relevant to your company and design? Since it is your company it’s ok for the color you choose to be your favorite, you’re going to be looking at it a lot. But own that as your reason-I love purple I want that to be my logo.\n\nKeep going. I’m looking forward to seeing what you finally end up with.\n\n"
    },
    {
      "time": " 16.Aug.2008 2.45pm",
      "content": "<cite>In this version it kind of hurts my eyes that the foot of the “A” is not in line with the other letters. It looks like it’s going to jump up any moment, which I find quite disturbing.</cite>\n\nHmm, that’s odd, because the A is in the exact same position as it was before... Or do you mean the bottom of the circle (which is not actually the foot of the A). I’m not sure what you mean, because I don’t quite “feel” what you’re saying. But that might be because I’ve been seeing the A that much that it is imprinted in my head :p.\n\n@Kirsten: thanks for the reaction. The dot was actually a remainder of the swash. I left it there because I liked it. But actually you’re right: it doesn’t belong there anymore.\n\nAs for the colour scheme: I’m still trying to figure out what will work best. Meanwhile, this is where I am now, just to keep you updated:\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo2_6350.png)\n\nI think this is already much better than the one where the “c” was intersecting the “i”. The striped upper left half of the circle represents the groove on a vinyl record. I also made a variation on that one:\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo2_5394.png)\n\nThanks for your input so far, everyone! :).\n\n"
    },
    {
      "time": " 16.Aug.2008 4.23pm",
      "content": "Hi Xavez,\n\nmuch better (again!). I really like the one at the bottom. I think the idea of the vinyl record works great.\n\nI have to admit that the “A” is very much in line with all the other letters now. But once you change the background color of the “A” to something other than black, it’s probably going to “jump up” again.\n\nIt’s hard for me to think of any further improvements here now. You \\*could\\* move the “s” one pixel to the left and tweak some of the letter shapes a little, but that’s not a must...\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122104749/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 16.Aug.2008 4.49pm",
      "content": "I don’t know about the ’A’.  \nThe Arts Club theater Company has the the letter ’A’ in a circle just like in your logo, and it is widely recognized and is internationally known.\n\n[http://www.artsclub.com/template1/graphics/ac\\_logo\\_2008.gif](http://web.archive.org/web/20081122104749/http:/www.artsclub.com/template1/graphics/ac_logo_2008.gif \"http://www.artsclub.com/template1/graphics/ac\\_logo\\_2008.gif\")\n\nHere is their site  \n [http://www.artsclub.com/](http://web.archive.org/web/20081122104749/http:/www.artsclub.com/ \"http://www.artsclub.com/\")\n\nJust something to think about :o)\n\n"
    },
    {
      "time": " 17.Aug.2008 1.56am",
      "content": "Don’t you just hate when that happens? :p.\n\nHmm, internationally known and widely recognized ey... I’ve never heard of them. And they’re in a different industry, more or less... And even on a different continent :(. But I guess that doesn’t really count :).\n\nThey’re using a slightly different font for the A though! :p.\n\n@tintin: the font I’m using is Meta (since you liked it so much). I’m afraid that if I even slightly touch one of the lettershapes, the typography god—I prefer to call him Todd—will clench me in his mighty fist and reduce me to an uncomfortably compact pile of flesh and bones and transistors ’n all. We’ll also be using Meta for the packaging design and most of the other stuff (vinyl covers/cd covers/invoices/business cards/...) so I’d like the typical characteristics of Meta to be present in the logotype as well :).\n\n"
    },
    {
      "time": " 17.Aug.2008 6.43am",
      "content": "Got some more stuff...\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_5658.png)\n\n"
    },
    {
      "time": " 17.Aug.2008 8.27am",
      "content": "Nice, I like your “stuff”...\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122104749/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 17.Aug.2008 8.52am",
      "content": "I really like the symbol of the last batch, well done!\n\nBut I have some things you might want to consider:\n\n- Have you tried redrawing the ’A’ to make it more geometric? The slight stroke modulation of the Meta ’A’ doesn’t really play well for me and makes it look unbalanced when placed in a circle. (The type gods won’t kill you.)\n\n- Have you tried some variations with a separate mark? I reckon this could work well now.\n\n- ’Music Media Group’ might be a tad pretentious if it is a single company you are setting up.\n\n- The color scheme might be too American?\n\n"
    },
    {
      "time": " 17.Aug.2008 9.09am",
      "content": "Hey, thanks!\n\n- I’ll try redrawing the A. I haven’t even noticed the stroke modulation on that capital A (I don’t really study graphic design or anything :)).\n- I have indeed tried some variations! This was one that worked really well for me. Or did you mean something else than the relative positioning of text/symbol?\n- Baseline is still under consideration. I was thinking down the lines of “We’re in your head” or even more specific “We’re in your ears”. Just playing with that thought for now though...\n- America was indeed one if the things I spontaneously thought of. But it is not necessarily a bad connotation. I tried red/black and yellow/black, but those combinations are definitely not the best colour combinations in Belgium right now. Orange is just too passé in my opinion. Still have to mess around with it a bit more. But I really like the colours right now: red is signaling and blue is balancing, so I think I’ll stick with those... For now :).\n\nThanks for the awesome feedback!\n\n"
    },
    {
      "time": " 17.Aug.2008 9.34am",
      "content": "Wow, that was quick.\n\nBy variations, I was thinking about exploring the possibility of using the mark separately from your name.  \nSo it would be variations of:\n\n[mark]  \nAtticus  \nTag line\n\nAlso reckon that the mark is now strong enough to be used on its own in certain applications.\n\nPS\\> Glad you lost the swash btw.\n\n"
    },
    {
      "time": " 17.Aug.2008 10.23am",
      "content": "I agree with seb. The “A” itself is very strong, so you might want to explore variations where it stands on its own, with the remaining letters underneath it or next to it.\n\nAnother idea I just had is to use Meta’s small-cap “A” instead of the regular version. Do you happen to have “Meta-Caps” installed on your computer? The cap versions are a tad wider which may look very nice in this case. It’s a bit like placing a square inside a circle. It should look more balanced!\n\nJust give it a try...\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122104749/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 17.Aug.2008 10.38am",
      "content": "The baseline is in Meta’s Caps, so yes, I have that one as well :).\n\nI’ll explore some variations! Keepin’ you posted :).\n\n"
    },
    {
      "time": " 17.Aug.2008 1.02pm",
      "content": "I quite like the last batch you posted. Definitely very american though, I would reconsider that.\n\n"
    },
    {
      "time": " 17.Aug.2008 3.33pm",
      "content": "Interesting that red white and blue are considered so American. That color combo is used in many other national flags. However, It is what I immediately thought of when I saw your latest posting, but I live in America.\n\nHonestly, I like the mark best in black and white especially since producing on vinyl seems to be a major component of your company. I loose the “grove” element when that part of the circle changes to a color. Not sure the kind of music you intend to produce or if you plan to cross many genres, but red white and blue (in these current shades) seems very pop to me. IF you’re not wild for a monocromatic logo perhaps black with a smokey grey (not just a tint of black) or a rich warm gray may be something interesting to try. It could bring an edginess as well as a sense of sophistication to the design. However this may not be in tune ; ) with what you are going for.\n\nExcellent work, you’ve made some smart refinements.\n\n"
    },
    {
      "time": " 18.Aug.2008 1.36am",
      "content": "Got another batch. I’ve redrawn the A, which indeed looks a lot better now—thanks for the tip! Still not sure about the colours though. I think I’m going to make a few prints and see what works best on paper. Too bad I don’t have a Pantone printer though ^.^.\n\nBaseline is still in “brainstorm mode” :).  \nCrap, I really need to start studying now =P. PS: just a question: is the kerning on u\\<\\>s too tight? Or is that just me? :).\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo4_4725.png)\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 18.Aug.2008 1.56am",
      "content": "And I’ve also tried monocolour, with some variations... :)\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo4_6412.png)\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 18.Aug.2008 2.46am",
      "content": "Commenting will be easier if you number them ;)\n\nI think the variations with red are too aggressive, except the one with the navy/denim. The purple reminds me of Proximus. I like the red+navy/denim & the first grey monochrome one. What is your target audience?\n\n"
    },
    {
      "time": " 18.Aug.2008 3.28am",
      "content": "Target audience in this case is mostly a B2B audience. Yeah, I forgot to number them :P. Sorry about that :). Funny that the purple reminds you of Proximus, I think this shade leans much more towards the pastel side than the Proximus colour—which is much deeper.\n\nHow about the red/navy combination being too American? Do you agree on that point? Also, I just realized that [SABAM](http://web.archive.org/web/20081122104749/http:/www.sabam.be/) (author/composer/... protecion agency in Belgium, for those of you who don’t know) uses red/blue as a colour combination as well. I don’t know if I want to be associated with them :p.\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 18.Aug.2008 3.44am",
      "content": "The re-drawn ’A’ works well for me. Not sure about the placement/size of the company name & tag yet.  \nI’d get that solid before moving on to colors. The way it is now, the design as a whole is very left heavy (detail on the ’A’ + tag line)\n\n"
    },
    {
      "time": " 18.Aug.2008 5.43am",
      "content": "I’m not directly getting the vinyl reference. I get it, but only because you said it earlier. I feel you’d get the idea of the vinyl if there were more striped lines.\n\n"
    },
    {
      "time": " 18.Aug.2008 6.41am",
      "content": "Well, yeah, but vinyl isn’t the only/main activity... We’re doing a lot more (but too much to implement in one logo). We’re not just a record label, we’ll also be providing other services for the recording industry. That’s why I wanted a subtle reference, but not one that would “push us in a corner”. Still brainstorming about the baseline btw...\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo4_5365.png)\n\nBTW: they should really, really add pagination on this Drupal install :/.  \n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 18.Aug.2008 8.56am",
      "content": "1b is the most effective to me for these reasons:\n\n1. The capital ’A’ in the name complements the ’A’ in the mark.  \n2. The groove suggests a record, as has already been suggested, and also subtly an ear. I like that it achieves so much with so little. This is lost in the other versions.  \n3. The orientation is strong and solid and will most likely scale better than the other versions.\n\nGood work!\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 18.Aug.2008 11.48am",
      "content": "What about “Hammer & Stirrup - inner ear media”\n\nI take it you’ve researched the name and made sure you can co-exist with the already established (and at least one very well known\\*) companies that go by Atticus?\n\n\\*referring to the clothing company\n\npenn\n\n"
    },
    {
      "time": " 18.Aug.2008 12.07pm",
      "content": "We have indeed conducted research into the brand name, but there was no company in our industry that was already using the name. Thanks for the heads up though, I sincerely appreciate your concern! :)\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 18.Aug.2008 3.33pm",
      "content": "I am fully with Nick on this one. 1b is definitely the one to go...\n\nDon’t use more than 2 stripes on the record. If 2 stripes don’t get the message of a record across here, 3 stripes won’t either!\n\nIf you use a capital “A” in the mark, this should also be reflected in the name underneath it. It just feels better that way.\n\nWhatever color changes you do, make sure you keep the record in black! Because otherwise people may not recognize it as a record. It will also give you a vast amount of color options for the remaining letters.\n\nGreat job so far!\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122104749/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 18.Aug.2008 5.44pm",
      "content": "Hi,  \nI just see this thread for first time so I don’t think I have read everything, but I have made a fast scanning for comments, with a good reading for Your description.\n\nLet me tell You some notes about Your latest submission:\n\n1.I like the type face.\n\n2.For tag line: using uppercase letters to introduce each word creates ambiguity. Is “MUSIC” a place or a person? It also takes too much space.\n\n3.To me the curves are presenting a “sound wave” symbol to me, and it may represent a CD or vinyl, but I don’t think it is that big chance, and I will tell You my reason: An A letter inside a circle is just random but only the curves at the left part which makes some difference. Actually even not that strong difference enough yet.\n\n4. I agree if it is not recognized by 2 curves then no need for a 3rd curve, which appeals to the KISS principle; however I guess the case here is different.\n\nIf we look at Your latest submission #4b: I see 2 white curves, but acutally they created in the negative space 3 black curves! Likely that who will recognize them as 2 curves, wouldn’t recognize the negative 3 curves, and vice versa; according of how perception works. (unless if You are there with the viewer to tell him/her about that). Any way I think this is just fine, it will help me more to recognize the form in small sizes, and it made me see the sound wave, and also the old comics movement symbol. [http://www.symbols.com/encyclopedia/02/024.html](http://web.archive.org/web/20081122104749/http:/www.symbols.com/encyclopedia/02/024.html \"http://www.symbols.com/encyclopedia/02/024.html\")\n\nHowever, If You loose 1 of them white curves, it will work better to me in regards of the CD/Vinyl symbol.\n\n5.I like the typeface You have used, it has the impact of a bold weight and saves space. I only would like the one with capital (A).\n\nA.\n\n"
    },
    {
      "time": " 19.Aug.2008 2.58am",
      "content": " ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_6465.png)\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 19.Aug.2008 5.27am",
      "content": "And another colour variation (the white border is not part of the final logo):\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus_logo4_5064.png)\n\nPS: anyone got a good tip on exporting from illustrator with the right colour profile? My colours always turn pale... The colours are all Pantone colours btw :).\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 19.Aug.2008 5.35am",
      "content": "Uh, nice to see some fresher color variations. I instantly like 2b. But then again, I have a weakness for green.  \nNot sure the name and tag line should be in the same color though. It would seem natural to have the name in black and then use the line to pick up the color again.\n\nAbout your colors, why do you use Pantone colors at this point? Shouldn’t you rather find good CMYK colors as you’re most likely to print in 4-c later on? Your colors turn pale, as Illustrator uses soft proofing to emulate how that specific Pantone color ’might’ look.\n\n"
    },
    {
      "time": " 19.Aug.2008 6.24am",
      "content": "Well, actually, we’re more likely going to be printing in Pantone, than in CMYK. But actualy you’re right, seeing as the CMYK colour space is narrower than the Pantone colour space, I should’ve been experimenting with CMYK first, then later searching for a matching Pantone colour (you never know, we might one day indeed have the need to print something in CMYK). Thanks for the reminder =).\n\nProbably one of the last batches before I present it to my colleagues (I’ve taken a screenshot. I figured that wouldn’t change the colours so much. Correct me if I’m wrong here? :)):\n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus1_4933.png)\n  \n\n ![](http://web.archive.org/web/20081122104749im_/http:/www.typophile.com/files/atticus2_5318.png)\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 19.Aug.2008 8.16am",
      "content": "PS: the font rendering on “music marketing” looks a bit odd because this is a screenshot from Illustrator :). The most important thing in this last batch are the colours though..\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    },
    {
      "time": " 19.Aug.2008 9.55am",
      "content": "I like the green the best.\n\nHave you tried keeping the logo all one color (or just all black) and the lettering a second color? I find the multicolor approach to the logo very distracting and buzzy.\n\n"
    },
    {
      "time": " 19.Aug.2008 2.05pm",
      "content": "black with red is the only option that I liked the black color in it, black in the rest is quite poor .. what about a dark green with the green logo, and dark blue with the blue logo, however, the blue color is too cold and corporate to be as cool for ur concept.\n\nA.\n\n"
    },
    {
      "time": " 19.Aug.2008 2.37pm",
      "content": "I like all the b’s because of the way you colored the text and the focus of attention being on the black company name.\n\nI don’t like batch 3 though, because the contrast of the blue and the background is not strong enough for me.\n\n[Webdesign Hamburg](http://web.archive.org/web/20081122104749/http:/www.designbits.de/)\n\n"
    },
    {
      "time": " 19.Aug.2008 10.22pm",
      "content": "Much improved from start till now. Glad to see typophile is helping!\n\nConsider using Meta Headline — check the sample a fontshop.com — The lockup will be better for a tightly kerned logo. Also consider taking the weight of the type either up or down for better presence.\n\n"
    },
    {
      "time": " 19.Aug.2008 11.48pm",
      "content": "It was a real pleasure to read this thread - was great to see a lot of constructive criticism going into the development and refinement of this logo.\n\nThe result (so far) is looking great; vastly improved from the first.\n\nI did, however, want to comment on that pale creamish-brown shape you have behind the logos. I’m sure that you already have this covered, but I take it that’s included as part of the design?\n\nIf so it might be an idea to move the top edge of that colour a little closer to your symbol/logo, it just seems there’s a disproportionate amount of space at the top that throws off the balance slightly. It probably couldn’t hurt to ensure that your logo still ’works’ to your eye against a white background as well, in case of future applications where the creamy-brown coloured shape isn’t feasible.\n\nIt could look great if that colour was actually the colour of your stock for the business cards and letterheads.\n\n"
    },
    {
      "time": " 27.Aug.2008 7.54am",
      "content": "Hey guys\n\nI’m sorry I’ve lost track of this thread a bit, but I also have some exams at the moment. It’s not always easy to combine a hobby with school work :).\n\nAs for the logo: we have decided to go with the logo composition as it was in the last post I’ve made. We were all quite content with the overall look and we thought the brand was strong enough. There is still room for improvement, but time was not on my side: I still had to prepare the cover artwork as well.\n\nWe have also decided to go with a colour combination of hard red and very dark brown on a slightly pale background (the paper, or when printed on white paper, a third colour, as represented above).\n\nThanks everyone, for your wonderful help. You’ve all been most kind! :).\n\n—  \n [LGD](http://web.archive.org/web/20081122104749/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122104749/http:/uandme.be/)\n\n"
    }
  ]
}
