{
  "id": "48469",
  "title": "Enjoying P22 Type Catalogue",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I recently purchased P22’s new type specimen book and have been enjoying “reading” it! Yes READING! The chosen text for each sample is both informative and enjoyable. The visuals are fun as you might expect from Mr Kegler, et al but the writing brings back fond memories of the typebooks of old.  \nThe book is also very helpful to those not familiar with the P22 web site and makes shopping for type much easier than trying to navigate the web site unaided.\n\n[http://www.p22.com/products/specimenbook.html](http://web.archive.org/web/20081122103006/http:/www.p22.com/products/specimenbook.html \"http://www.p22.com/products/specimenbook.html\")\n\nChrisL\n\n [‹ Typophile Slow Down](http://web.archive.org/web/20081122103006/http:/www.typophile.com/node/48647 \"Go to previous forum topic\") [[TypeCon2008] Typographers help school launch student newspaper ›](http://web.archive.org/web/20081122103006/http:/www.typophile.com/node/48655 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122103006/http://www.typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": " 16.Aug.2008 1.18pm",
      "content": "Thank you for posting this Chris.\n\nMikey :-)\n\n"
    },
    {
      "time": " 16.Aug.2008 2.06pm",
      "content": "You are welcome, Mikey!\n\nChrisL\n\n"
    },
    {
      "time": " 18.Aug.2008 6.17pm",
      "content": "Thanks Chris! Glad you like it.\n\n"
    },
    {
      "time": " 19.Aug.2008 6.56am",
      "content": "That appears to be a very lovely book and a really nice price!\n\n"
    },
    {
      "time": " 19.Aug.2008 11.50am",
      "content": "Yeah it IS wonderful. Just a small caveat: the binding could be better — leafs are already trying to liberate themselves.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 19.Aug.2008 3.41pm",
      "content": "track\n\n"
    },
    {
      "time": " 20.Aug.2008 4.33am",
      "content": "Thanks for the report Bert. This is in many ways an experiment (using a third party print-on-demand printer/delivery system), so it is good to hear any reports of issues. “Perfect” binding is not something I would normally want to use, but options are limited for this type of thing. If the book does fall apart, send it to me and I will get you a fresh one. Please email me offlist.\n\n"
    },
    {
      "time": " 20.Aug.2008 8.45am",
      "content": "<cite>If the book does fall apart, send it to me and I will get you a fresh one. Please email me offlist.</cite>\n\nAre you kidding? It’s a TypeCon Special Edition, number 33 of 50!!!  \nYou will have to wrench it from my dead hands. ; )\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 21.Aug.2008 4.42am",
      "content": "Very nice.  \nNice will be when I distribute my Stern (Rimmer) metal typeface to the case. I bought it few weeks ago. Can’t wait when it get here ...\n\n"
    },
    {
      "time": " 21.Aug.2008 6.11am",
      "content": "I know the first batch of Stern has been shipped. There were more orders than expected for the metal face so that complicated casting a little for Jim. Please post images of settings of letterpressed Stern when you have them!\n\n"
    },
    {
      "time": " 21.Aug.2008 12.58pm",
      "content": "Hey Richard\n\nLooks good. I thought you left a beer sitting on the book before you sent it to me as a joke. It matches my Miller can(s)!\n\nMichael\n\n"
    },
    {
      "time": " 21.Aug.2008 3.48pm",
      "content": "““Perfect” binding is not something I would normally want to use, but options are limited for this type of thing.”\n\nI don’t blame you, Rich. I would rather have something in print than just a PDF even if the binding is not perfect.\n\nChrisL\n\n"
    }
  ]
}
