{
  "id": "48461",
  "title": "Hyphenation on web sites",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi everybody,  \nI've got a question for you. You know that, for print, we should hyphenate a sentence like:\n\n\"the black cat is still around, playing with the  \nblue ball\"\n\nthis way:\n\n\"the black cat is still around,  \nplaying with the blue ball\"\n\nor\n\n\"the black cat is still around, playing  \nwith the blue ball\"\n\nTo avoid separating words, and keeping together words that go \"together\". But on web sites, is it really important to follow this kind of rule, if you know that the user can change the size of the font as he wants ?\n\nthanks !\n\n",
  "author": "<a href=\"/web/20110423185906/http://typophile.com/user/35576\" title=\"View user profile.\">g0ldstein</a>",
  "time": "<br>",
  "uid": "35576",
  "comments": [
    {
      "time": "",
      "content": "If you can dynamically justify a paragraph on the screen, the most common use of the hyphen is to divide words that do not fit on a justified line of type. Usual texts are treated different than poetry, anyhow, we use the _hyphen_ ‘-’ to separate words (not sentences) and/or to create compound words, write numbers, adding certain prefixes, etc.\n\n"
    },
    {
      "time": "",
      "content": "Don’t manually hyphenate or rag type for the web. Just let it be. Honestly, nobody but a serious typographer ever notices one way or another.\n\n"
    },
    {
      "time": "",
      "content": "James and Alessandro silently let pass by, the term is not \"hyphenation\" for words. Hyphenation is when a word itself breaks.\n\n<cite>“the black cat is still around,<br>\nplaying with the blue ball”</cite>\n\nor\n\n“the black cat is still around, playing  \nwith the blue ball”\n\nI come across this problem a lot (in typesetting, that is) with the large font size I use for chapter titles. I prefer personally to set the top line longer than any subsequent lines, hold \"the\"'s together with the next word, and ... well ... whatever looks best. (Sometimes it takes several tries).\n\nFor a web page, I don't think I could be bothered :-)\n\nYou can tack words together with & nbsp; -- the non-breakable space (for example, \"the blue\"), or use the HTML \\< nobr \\> .. \\< /nobr \\> tags, which work just like InDesign's \"No Break\" feature. But you have to consider that with all different browsers, font sizes, and window widths, virtually everyone will get to see a different broken paragraph. Imagine doing this for every _possible_ bad break ...\n\nBesides, as current browsers do not use any intelligence at all, breaking paragraphs comes down to \"Oi, the line is full. Go to next line.\" SO, if you use one of these tricks, the text will look _worse_ instead of better.\n\n"
    },
    {
      "time": "",
      "content": "Hi, thanks for all you replies !  \nBy \"hyphenation\", I meant line break, sorry for this error (English is not my first language), and I'm glad you understood what I wanted to mean\n\n"
    }
  ]
}
