{
  "id": "4846",
  "title": "Type casting at the PieTree Press",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So I just got back to Chicago after a 5 day workshop with Jim Rimmer at his Pie Tree Press and Type Foundry in New Westminster, BC. I must say that it was one of the best times I\n\n",
  "author": "matteson",
  "time": "19 May 2004 — 11:19am",
  "uid": "1026",
  "comments": [
    {
      "time": "19 May 2004 — 1:02pm",
      "content": "All I can say is, I'm jealous!   \n   \n\\> I\n\n"
    },
    {
      "time": "19 May 2004 — 3:09pm",
      "content": "Nathan Matteson ,   \n   \nSorry I missed you, I did not wish to interrupt. Perhaps another time.\n\n"
    },
    {
      "time": "19 May 2004 — 3:26pm",
      "content": "\\>Sorry I missed you   \n   \nYeah I would've enjoyed meeting you. Hopefully I'll be up again sometime. I actually didn't know you were back in Vancouver until Jim told me, or I'd've emailed you.   \n   \nIncidentally, how's the Deepdene bold? I seriously can't believe how fast Jim is.\n\n"
    },
    {
      "time": "19 May 2004 — 6:02pm",
      "content": "Hrant   \n   \nNext year at this time there's a spot for you at the bench if you can break away from the work-a-day world.   \n   \nNathan   \n   \nI thought that Gerald would be in town on the Friday, and it would have been fun to have him drop in. (He is now located in Victoria on Vancouver Island).   \n   \nGlad you got home and through the metal detector with no problem.   \n   \nJim\n\n"
    },
    {
      "time": "19 May 2004 — 10:42pm",
      "content": "Jim,   \n   \nI have been in Sooke with Ross. I don't know if you met him. He used to build boats. Now he just builds. Also he is an Easthope buff. But I might go up and see Ian on Gabriola. I am looking for some space to work on a boat.\n\n"
    },
    {
      "time": "20 May 2004 — 9:12am",
      "content": "Jim, your generous offer might in fact be taken advantage of next year...   \nContrary to impressions, I very much enjoy fondling machinery. I used to build crossbows (of my own design).   \n   \nhhp\n\n"
    },
    {
      "time": "20 May 2004 — 9:31am",
      "content": "\\>fondling machinery   \n   \nJust be careful Hrant. I'm not sure how BC stands on same-sex marriages, but I almost started looking for clergyman who'd unite me with Jim's Weibking.\n\n"
    },
    {
      "time": "20 May 2004 — 11:06am",
      "content": "Oh yeah. One more thing about the workshop. I got to use Ikarus for the first time to digitize the drawing I brought. I can definitely see why folks would prefer it to drawing in FOG and FLAB. Or working in Illustrator or Freehand. I suppose you end up with more points than are necessary, but it gives you a working outline in a matter of seconds. Pretty amazing.\n\n"
    }
  ]
}
