{
  "id": "48477",
  "title": "Newspapers - Moscow, Portugal, Frankfurt",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Of the four newspapers that won this year’s Society for News Design award, I’ve only managed to find a copy of one (The Guardian) and I’m hoping for help from the kind font freaks of the world. The three in question are:\n\nAkzia (Moscow)  \nExpresso (Paco de Arcos, Portugal)  \nFrankfurter Allgemeine Sonntagszeitung\n\nThe last one isn’t very exotic (unless “Sonntagszeitung” means something strange - perhaps just “Sunday edition”?) but Newseum.org hasn’t shown front pages from any of them since I started looking (and they’re also very lousy at returning emails and phone calls).\n\nOf course I would be more than happy to barter something of -supposed- value with anybody willing/able to mail me an issue of one of those three.\n\nhhp\n\n [‹ Typolphile's Header Font](http://web.archive.org/web/20081122114354/http:/www.typophile.com/node/48562 \"Go to previous forum topic\") [Nice vintage american typography website ›](http://web.archive.org/web/20081122114354/http:/www.typophile.com/node/48591 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122114354/http://www.typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": " 16.Aug.2008 7.28pm",
      "content": "Perhaps someone else will have unfettered access to it, but I do have access to Expresso through the Yale University Library’s newspaper room. I could almost certainly make some scans of an issue if that would be helpful, and I could see about whether I could acquire an old issue. I wouldn’t be able to do that for at least a week, though, but let me know if nothing else materializes.\n\nEDIT: And, yes, the Frankfurter Allgemeine Sonntagszeitung is the Sunday edition AFAIK, looking significantly different (less conservative) from the other days.\n\n"
    },
    {
      "time": " 17.Aug.2008 1.00am",
      "content": "\\> Frankfurter Allgemeine Sonntagszeitung\n\nHrant:\n\nHere is a scan of today’s “Frankfurt General Sunday Edition”  \n(literal word-by-word translation of this newpaper title):\n\n[http://www.faz.net/s/RubE3C3C6176BD4497B8E43BEC78289CFD1/Tpl~Ezeitung~So...](http://web.archive.org/web/20081122114354/http:/www.faz.net/s/RubE3C3C6176BD4497B8E43BEC78289CFD1/Tpl~Ezeitung~Soverview.html \"http://www.faz.net/s/RubE3C3C6176BD4497B8E43BEC78289CFD1/Tpl~Ezeitung~Soverview.html\")\n\n[http://www.faz.net/d/asi/ZPack.aspx?pack=fas&big=1](http://web.archive.org/web/20081122114354/http:/www.faz.net/d/asi/ZPack.aspx?pack=fas&big=1 \"http://www.faz.net/d/asi/ZPack.aspx?pack=fas&big=1\")\n\n"
    },
    {
      "time": " 17.Aug.2008 4.40am",
      "content": "Expresso is available to registered users in PDF(?) format at [http://impresa.newspaperdirect.com/epaper/viewer.aspx](http://web.archive.org/web/20081122114354/http:/impresa.newspaperdirect.com/epaper/viewer.aspx \"http://impresa.newspaperdirect.com/epaper/viewer.aspx\")\n\nIf you don’t mind waiting until January, I can bring a couple paper editions with me and mail them to you.\n\n"
    },
    {
      "time": " 17.Aug.2008 4.26pm",
      "content": "hrant\n\nDo you want a copy in paper send to your address?  \nPlease contact me at my email ( [afonseca@portugalmail.com](mailto:afonseca@portugalmail.com))\n\nAntónio\n\nPS:  \n“barter something of -supposed- value with anybody willing/able to mail me an issue of one”...I’m sure we can find something...:-)\n\n"
    },
    {
      "time": " 17.Aug.2008 4.45pm",
      "content": "Thanks guys!\n\nThe Expresso site that Miguel points out seems to give a great idea of the paper, although I couldn’t figure out how to register\\* to get a PDF. Miguel, I would gladly Paypal you the mailing cost if you’d be willing to make that generous effort; January would be better than never, but too late for a project I’m working on. Reed, if Miguel does have to wait until January then I would certainly highly appreciate the following two scans: medium-res of a typical inside page, and max-res of a few lines of typical text. And if you can swing an actual back issue, that would rule.\n\n\\* My Castillian doesn’t unlock Portuguese, contrary to what I assumed when I was learning Castillian...\n\nUli, thanks much for that. BTW, are they no longer using Gulliver? (Or am I mixing up Frankfurter Allgemeine with another German paper?) Also, if anybody would be willing to snailmail me a copy of the Sunday Edition that would be very nice (and deserving of reciprocation).\n\nSo, what about the elusive Akzia...\n\n—\n\nBTW, I forgot to include my contact info:  \n [http://themicrofoundry.com/s\\_contact.html](http://web.archive.org/web/20081122114354/http:/themicrofoundry.com/s_contact.html \"http://themicrofoundry.com/s\\_contact.html\")  \n(But please use the Gmail address.)\n\nhhp\n\n"
    },
    {
      "time": " 17.Aug.2008 4.49pm",
      "content": "Antonio, our messages crossed.\n\n\\> Do you want a copy in paper send to your address?\n\nThat would be super! Please use the ground address in the link above. And let me know your understanding of “supposed value”. :-) Sadly I can’t send you any of our phenomenal weather, but let me know what else might tickle your fancy.\n\nhhp\n\n"
    },
    {
      "time": " 17.Aug.2008 5.10pm",
      "content": "Well...the registed PDF access to Express is payed...and not sure if the PDF visualization of the paper edition is dowloadable...  \nI will contact you in your email...\n\nAntónio\n\n"
    },
    {
      "time": " 18.Aug.2008 1.30am",
      "content": "Hrant, I won’t be back in Germany till October, but if you can wait until then (and you remind me…), I can send you a copy once I’m resettled in Frankfurt.\n\nI think that you are confusing the FAZ’s Sunday Edition with the _Stuttgarter Zeiting_. The _Stuttgarter Zeitung_ uses Guilliver.\\* The _Frankfurter Allgemeine_ uses Times Ten, AFAIK.\n\n\\* During a lecture earlier in the year at Reading, Gerard showed us _USA Today_ and the _Stuttgarter Zeiting_. Both use Gulliver, but you won’t think it just by glancing at the two papers together, because they both use the typeface in such completely different ways.\n\n"
    },
    {
      "time": " 18.Aug.2008 1.06pm",
      "content": "Dan, that would be great. I will remind you in a few weeks.\n\n\\> I think that you are confusing the FAZ’s  \n\\> Sunday Edition with the Stuttgarter Zeiting.\n\nYes, that’s it.\n\nBTW Miguel, Antonio is taking care of sending the Expresso, but thank you very much for the kind offer.\n\nhhp\n\n"
    },
    {
      "time": " 19.Aug.2008 5.05pm",
      "content": "Hrant,\n\nI’m not sure if you’ve found the PDF versions of Akzia online yet. If not, here you go: [http://www.akzia.ru/pdf](http://web.archive.org/web/20081122114354/http:/www.akzia.ru/pdf \"http://www.akzia.ru/pdf\"). Granted it’s not the same as a hard copy, but I hope it will work for now.\n\nChris\n\n"
    },
    {
      "time": " 19.Aug.2008 7.12pm",
      "content": "Chris, great find! Thank you. I don’t read Russian, but I should have thought of searching the main page for “PDF”... I’d still like a hardcopy if anybody can swing that though.\n\nBTW, looking at that index page, does anybody know what the difference is between the issues that have the large circle-A logo versus the ones that say “akzia.\\*\\*\\*\\*” in single guillemets? I assume the latter are special issues, like about “careers” and “mobiles”?\n\nhhp\n\n"
    },
    {
      "time": " 19.Aug.2008 7.45pm",
      "content": "Hi Hrant,\n\nYou are correct about “careers” and “mobiles.” I didn’t see any other special issues. If you need any more help with the Russian, let me know (I am reasonably proficient, though it’s getting rustier by the day!).\n\nChris\n\n"
    },
    {
      "time": " 20.Aug.2008 11.36am",
      "content": "Just to set the record straight:  \nI finally did get a reply from Newseum. The three papers I’m looking for apparently haven’t been submitted to Newseum for inclusion in their front-page collection (at least not in the past year), although there does seem to be interest in rectifying that.\n\nhhp\n\n"
    }
  ]
}
