{
  "id": "4848",
  "title": "Magazine masthead",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all. I could use some help - I've been working on the redesign of a sports magazine, along with the redesign the title is changing as well. Here are a few masthead designs. The client initially wanted to empahsize the word \"Tennis\" and downplay \"US\", now they want to see more of a balance between the words. Red and Blue will probably be the main color palette, however it may change from issue to issue depending upon the cover art. With that in mind the flag \"E\" versions might not work in a different color combo. Please, your thoughts on which of these is working. Am I turning it into too much of a logo? One big concern is it should not look similar to Tennis Magazine. see bottom attachment. One final note the magazine only goes to subscribers, it's not for sale on newsstands.   \n   \n ![masthead 1](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36351.jpg)   \n ![masthead 2](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36352.jpg)   \n ![masthead 3](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36353.jpg)   \n ![masthead 4](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36354.jpg)   \n   \n ![tennis magazine logo](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36355.jpg)\n\n",
  "author": "kirsten",
  "time": "19 May 2004 — 1:57pm",
  "uid": "3768",
  "comments": [
    {
      "time": "19 May 2004 — 2:03pm",
      "content": "I like the three dimensionality of the first example, but not how it interlocks.   \n   \nI like the serifed type on the second to the last example. but I'd like to see the same idea in small caps.\n\n"
    },
    {
      "time": "19 May 2004 — 2:04pm",
      "content": "Sorry for the double post, I got an error message and posted a second time.\n\n"
    },
    {
      "time": "19 May 2004 — 2:40pm",
      "content": "I think I favor the first two designs, but on the second one the \"E\" is not working yet. Have you tried incorporating any kind of graphic elements (net, ball, racket, racket strings, etc.)? Maybe a graphic of some kind could help that \"E\" area. I think the \"E\" is less important than the other letters. Even if it was an empty space there (please don't take that as a suggestion) the word would still read as Tennis. My point is that maybe that is a flexible space. I also think the \"S\"s need to be a little taller.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "19 May 2004 — 4:09pm",
      "content": "I like the first idea quite a bit, I get a university sport kind of feel from it, but Im not too fond of the protruding outline.\n\n"
    },
    {
      "time": "20 May 2004 — 1:17pm",
      "content": "Thanks for the suggestions. I reworked the first two mastheads. I liked the interlocking letters and tried an extended version of the letterforms to give it a little more weight. I also created a version with the US and Tennis on one line, not interlocked. On the second masthead (of the original post) I lost the flag E and played with adding a graphic element to the type (a ball) I'll have to try this on some covers, not sure if the ball will be confusing with other balls that may be in the cover art. Final version I used a dot instead of a photographic ball.   \n   \nAm I heading in the right direction with these?   \n-Kirsten   \n   \n ![masthead version 2.1](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36441.jpg)   \n ![masthead version 2.2](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36442.jpg)   \n   \n ![masthead version 2.3](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36443.jpg)   \n ![masthead version 2.4](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36444.jpg)   \n ![masthead version 2.5](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36445.jpg)\n\n"
    },
    {
      "time": "20 May 2004 — 1:31pm",
      "content": "I prefer number 5 of the \"ball\" grouping. Looks screenprinted. the cropped clipart hurts 3's presentation.   \n   \nHave you tried chopping the serifs off the T in the interlocking logo? The logo is quite pinched at the T junctions. I favor 2 like many do. Whats it look like sans outline?   \n   \nAndrew\n\n"
    },
    {
      "time": "20 May 2004 — 2:02pm",
      "content": "I quickly worked on one of Andrew's suggestions. Attached is the serif interlocked version with a modified T. What I had liked about the version I first did was that the serif in the T also acted as the negative inner curve of the s - which is squareish. Perhaps that's one of those design ideas that works in your head and not on paper. The modified T is sort of working but isn't quite there yet. Perhaps the rest of the letters need some adjustments as well or perhaps I should play with some other fonts. I also think version 5 of second posting with the yellow dot has merit too will work on both and post again soon.   \n-Kirsten   \n   \n ![masthead version 3.1](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36458.jpg)\n\n"
    },
    {
      "time": "20 May 2004 — 2:44pm",
      "content": "Perhaps just me, but in the interlocking versions (less with the serifs chopped) I find the lower curve of the S tends to combine with the upstroke of the T to make a P shape, so I see both Tennis and Pennis. I much prefer the simpler versions. I think I'd say \"What is the interlocking really adding?\". For me at least its just adding confusion.\n\n"
    },
    {
      "time": "20 May 2004 — 7:51pm",
      "content": "Definitely lose the literal tennis balls, but the fifth version does have some merit as you said. I'm anxious to see what you do with it.\n\n"
    },
    {
      "time": "20 May 2004 — 8:57pm",
      "content": "Back to the 5 exemples that you did...   \nforget the ball and let the space ther...try to work more in the N's, can get something quite cool...\n\n"
    },
    {
      "time": "21 May 2004 — 5:19am",
      "content": "If you go with the interlocking version you have to change the value of either the red or the blue. They have the same value and the interlocking area vibrates. You could solve this with a white stroke around the interacting letters. I don't know why it has to be flag red and flag blue.\n\n"
    },
    {
      "time": "21 May 2004 — 6:17am",
      "content": "I feel like US should have periods between the letters, so the logotype reads smoother. Maybe those periods could be a helpfull graphic element.\n\n"
    },
    {
      "time": "21 May 2004 — 6:49am",
      "content": "I quite like the non-interlocked dimensional one (First of the last 5 you displayed).   \n   \nI think the interlocked versions would not work well on a magazine cover when space is considered. I think, to have a blank space above \"Tennis\" would be slightly irritating.   \n   \nForget the Tennis ball represenation, it adds complexity. Magazine mastheads, in my opinion, should be simple and adaptable, as content will change from issue to issue.   \n   \nKeep with the good work.   \n   \nCheers.\n\n"
    },
    {
      "time": "21 May 2004 — 8:04am",
      "content": "\\> I think, to have a blank space above \"Tennis\" would be slightly irritating.   \n  \nUnless you use that space to put the issue number, volume number, ISSN, etc. ![:-)](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "21 May 2004 — 12:08pm",
      "content": "Thanks for all the terrific input.   \n   \na couple of specific concerns which were brought up that I didn't previously address:   \nIt has to be US not U.S.   \nThe color choice right now is the Association's color palette. However, depending upon the cover artwork, the colors most likely will change from month to month.   \n   \nHere are three more designs.   \n   \n ![masthead version 4](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36519.jpg)   \n  \nI find the ball inbetween the two \"N\"s creates a bull's eye effect in a part of the word that doesn't need the attention. I'm sure there's some kind of interesting treatment to do to the double \"N\"s, I'm just not hitting upon it.   \n   \nThe 2nd and 3rd designs are essentially the same just one is outlined and the other is not. The client likes outlines, but it's use will more likely be determined by what else is on the cover.   \n   \nI liked Garage Gothic from versions #3-5 of second posting but now I'm thinking it looks too soft for a masthead.   \n   \nWhat are the forums' thoughts - on font choice? on keeping or droping the dot? & etc.?\n\n"
    },
    {
      "time": "21 May 2004 — 12:26pm",
      "content": "Well the dot's power is less effective when its not allowed to breathe. I'd give it some space and make it a tad bigger.   \n   \nI'm still a big fan of #5 above. I dont like serious slabs.   \n   \n#3 of new group. THe outlining helps the slab serif I think.   \n   \nAndrew\n\n"
    },
    {
      "time": "21 May 2004 — 12:35pm",
      "content": "Try reversing the second N to create a face off competition effect with the first.\n\n"
    },
    {
      "time": "21 May 2004 — 12:38pm",
      "content": "Check out the Nine Inch Nails logo\n\n"
    },
    {
      "time": "21 May 2004 — 1:02pm",
      "content": "Interesting...   \n   \nHere's revisions reflecting both Andrew's and David's thoughts. I combined both at times which might be too much. Let me know what you think.   \n   \n ![masthead revise](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36522.jpg)\n\n"
    },
    {
      "time": "21 May 2004 — 1:27pm",
      "content": "\"Tricky Feathers\"? :-)   \n   \nI like the shape of the 2 Ns in #2 of the last batch, but it really doesn't add anything, does it?   \n   \nI'm thinking the ball w/o the seams is just a dot. I liked it better when it had some depth.   \n   \nHave you tried using the ball to dot the I? Or as periods after U and S? Just suggestions...\n\n"
    },
    {
      "time": "21 May 2004 — 1:29pm",
      "content": "The softer face reminds me of USA today\n\n"
    },
    {
      "time": "21 May 2004 — 2:43pm",
      "content": "1 The slab serif has more visual appeal for me and conveys the spirit of US   \n   \n2 The sans serif seems more appropriate for tennis (perceived as more of a finess sport than a tough guy sport)   \n   \n3 If the double \"N\" treatment was the only distinctive feature of this logo it might work, but combined with any of the other distincitve elements (multi-colors, tennis ball/dot) it is too much (\"tricky feathers\")   \n   \n4a I prefer the seamless tennis ball, but if the seams did make a return, I think an oversimplified graphic approach would work better than the photographic tennis ball from your old post   \n   \n4b I actually like the position of the seamless tennis ball between US and Tennis, as it gives it non-overbearing purpose (divider)\n\n"
    },
    {
      "time": "21 May 2004 — 3:27pm",
      "content": "The typs is 3-D, but the ball is just a 3-D dot. Maybe use an actual 3-D ball with the 3-D type.\n\n"
    },
    {
      "time": "22 May 2004 — 5:28am",
      "content": "Additionally to Scott's comments, I'd add that the double \"inverted\" N gives me a feeling of Russian/cyrillic language, wich I don't think relates at all with a logo that is so USA centered. (Color scheme and the play on words US/USA)   \n   \nNIce to see work in process   \nVicente\n\n"
    },
    {
      "time": "24 May 2004 — 1:42pm",
      "content": "First, thank you all for your ideas and comments. After spending quite a bit of time in Border's magazine section I realized I was trying to do too much with this. Simplified the sans serif and slab versions. Did keep one version with the reversed N. I felt it illustrates the head-to-head competion of tennis. However (and especially because it is an N) I doubt I'll end up using it because it will be too similar to the Nine Inch Nails symbol.   \n   \nThe forum seemed split between the slab and the sans so I'll probably show both to the client. Funny I was favoring the slab, but now I like the sans with no space between the US and Tennis or the all blue with yellow dot version. Keep it simple.   \n   \n ![masthead version 6](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/36678.jpg)\n\n"
    },
    {
      "time": "24 May 2004 — 2:22pm",
      "content": "I like the third from the top and the 5th from the top. However, the yellow ball is begging for its seams back.(not the photographic version, but a simple graphic rendering would probably do. The addition of the seems would also imply motion which would be a good bonus.)   \n   \nHave You tried an all Green Version?   \n   \nHonestly, by having a specific set of colors you are potentially limiting your graphic pallette down the road.   \n   \nWhat happens when you have a beautiful photograph that has a blue(or Red)background? You might feel the need to change the colors of your logotype.   \n   \nI was always told that a logo should be able to work in black and white 1st, and color 2nd.   \n   \nYou might want to try some versions with solid colors throughout.   \n   \nps.Forth from the top feels Swedish.\n\n"
    },
    {
      "time": "10 Jun 2004 — 9:56am",
      "content": "Hi, I'm back again with another revision to this masthead. It's negative space around the ball not a white line, so when the masthead is on top of the art, the art will show through. The colors will be dependant upon the cover photo/illus., but in looking over past issues, these were colors that were frequently used. I steered away from putting a seam on the tennis ball for two reasons 1. Tennis magazine used a seamed tennis ball as the dot over the \"i\" for about 25 years prior to their recent logo redesign. and 2. The more litteral ball depiction (with seam) looks odd when the ball is in a color other than yellow. ![masthead with dot e](http://web.archive.org/web/20131019234829im_/http:/www.typophile.com/forums/messages/29/37958.jpg)   \n\"US\" looks a little tight to me and \"NI\" a little loose. Do you agree? Or should I tighten TENNIS to match US? And does anyone feel the perfect circle doesn't jive with the imperfect soft Garage font? I tried using period from the font as the ball but it looks like a mis-shapen blob to me.\n\n"
    },
    {
      "time": "10 Jun 2004 — 11:19am",
      "content": "Kirsten, I don't want to sound crazy, but I feel that having the circle on the E makes it look like a clowns nose. I kind of liked the circle as a divider between the two words. Maybe it is just that simple. A monochtomatic logo with a simple circle in between the two words implying transition, movement, and of course the tennis ball.\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:18pm",
      "content": "_but I feel that having the circle on the E makes it look like a clowns nose_   \n   \nI get that, too. Maybe bring back the seams?\n\n"
    },
    {
      "time": "20 May 2004 — 10:56am",
      "content": "I prefer the first as well, a little dimension used sparingly (and done well) can make something stronger. As this is sports it also adds a little bit more strength to the design as well.   \n   \nThe 3-pronged E is currently being used by [Chevrolet](http://web.archive.org/web/20131019234829/http:/www.chevrolet.com/). I would steer clear of that solution.\n\n"
    },
    {
      "time": "21 May 2004 — 1:10pm",
      "content": "This has evolved nicely. Two questions.   \n   \n1. Isn't the reversed N too \"tricky feathers\" for a magazines masthead?   \n   \n2. Does anyone else, even if only momentarily, think about the other US magazine?\n\n"
    },
    {
      "time": "22 May 2004 — 8:26am",
      "content": "kirsten -- what if the soft typeface were used (as in that bottom version minus the feathers)? could it act as a nice contrast to which ever typeface you do use as coverlines etc? It might allow for more versatility, ergo use of slabs, grots or even a heavier serif. hmmm. and it really is friendly.   \n   \nhowever, and i'm NOT a tennis fan or aficionado (ok, guilty pleasure watch agassi) but i do perceive that they want to be taking just as seriously as any other sport, so to make it too soft and cuddly could be bad.\n\n"
    }
  ]
}
