{
  "id": "48494",
  "title": "Probably gonna write a font manager for Windows...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "...because I am fed up with there not being anything decent available for finding/classifying\n\nwas thinking of a tag based system of classification, e.g. a font could be tagged\n\n“sans-serif 1970s funky curly bold narrow bodytext” or anything you like just to make things easier to find.\n\nthe power would be in people sharing their databases online - export to a text file and stick it online so others can merge with their own databases. Of course some agreement would need to be reached over generic tags but really anything is better than nothing.\n\nthis would be free (and probably open source later)\n\ncomments?\n\n [‹ please help with what font this is?](http://web.archive.org/web/20081122063122/http:/www.typophile.com/node/50344 \"Go to previous forum topic\") [Looking for Berlin design agencies ›](http://web.archive.org/web/20081122063122/http:/www.typophile.com/node/50187 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122063122/http://www.typophile.com/user/35628\" title=\"View user profile.\">IanT</a>",
  "time": "<br>",
  "uid": "35628",
  "comments": [
    {
      "time": " 17.Aug.2008 3.38pm",
      "content": "If your idea includes a nice, thoughtful preview pane and activation, I am already drooling at the thought. We poor Windows users are rather out of luck as you said.\n\nI currently use Extensis Suitcase for Windows, which is leaps and bounds better than my previous program, MainType. But Suitcase, though functional, does seem rather barebones, especially in being locked into the folder methodology rather than the more metadata-style approach you are using.\n\nYou probably have already seen it many times, but MyFonts has what seems to be the best tagging system out there, though with so many typefaces available, it can be hard to find something really suitable for a query. You might want to contact Nick Sherman from MyFonts; he’s done some work trying to figure out how to organize and classify type, which you can get an overview of [over at his site](http://web.archive.org/web/20081122063122/http:/www.nicksherman.com/degreeproject/index.html).\n\nAnd if, far down the line, you want anyone to test the software, look me up  \n:-)\n\n"
    },
    {
      "time": " 17.Aug.2008 4.00pm",
      "content": "How will this be different from Linotype Font Explorer?\n\n"
    },
    {
      "time": " 17.Aug.2008 4.33pm",
      "content": "@auricfuzz  \nA ’thoughtful’ preview pane? please expand on that!\n\nbut yes, something along the lines of extensis suitcase (but with more functionality in the classification/grouping/searching) is probably on the cards. (though the auto activation plugin stuff might be beyond the time i have available. for me just a decent categorisation would be beneficial)\n\n“activation” is easy it seems having a look at the APIs. weirdly enough there is no functions for determining font names from a file and that’s going to have to be hard coded, reading the file format.\n\n@Hallock\n\n\\>How will this be different from Linotype Font Explorer?\n\ni won’t delete the software from the net :) I’ve not tried it as they pulled it. No dates, no real indication that they are carrying on with it, let alone a projected release date. Seriously if me just hacking something together forces the hands of one or more other developers then hooray. i just can’t take looking through loads of fonts or having to manually stick things in groups anymore. this kind of software is not rocket science.\n\n"
    },
    {
      "time": " 17.Aug.2008 4.34pm",
      "content": "Right now, Font Explorer isn’t for Windows. They did have a Windows Beta version out a while back, but it didn’t work for me on Vista and they pulled it shortly after. But maybe they will release the Windows version for real. Until then...\n\n"
    },
    {
      "time": " 17.Aug.2008 4.48pm",
      "content": "Yeah, the beta is back listed but it may be XP only still.\n\n"
    },
    {
      "time": " 17.Aug.2008 6.12pm",
      "content": "IanT\n\nWe are about a month or so away from releasing the first beta of ’Fontbase’, a commercial version of our own font cataloging/database program.\n\n[http://www.dtptypes.com/Fontbase/Fontbase.pdf](http://web.archive.org/web/20081122063122/http:/www.dtptypes.com/Fontbase/Fontbase.pdf \"http://www.dtptypes.com/Fontbase/Fontbase.pdf\")\n\n"
    },
    {
      "time": " 18.Aug.2008 2.13am",
      "content": "[FontMatrix](http://web.archive.org/web/20081122063122/http:/www.fontmatrix.net/) is a cross platform font manager - written with Qt and licensed as free & open source software under the [GNU GPL](http://web.archive.org/web/20081122063122/http:/www.gnu.org/). It recently had a big release with a packaged Mac OS X version and also a [packaged windows version](http://web.archive.org/web/20081122063122/http:/www.fontmatrix.net/archives/win/) - and it has **all the features you want, right now!** :-)\n\n"
    },
    {
      "time": " 18.Aug.2008 2.20am",
      "content": "The most entirely satisfactory font management experience I have ever had was ATM Deluxe on Mac Classic. Perfect auto-activation in all programs, intelligent drag and drop, effectively absolutely bug-free, and multiple master handling. A rock-solid program you could have total confidence in. The only gotcha was the painful initial setup as it dissed your otherwise healthy Bitstream and Monotype fonts. There was never anything comparable on OS X.\n\nATM Deluxe for Windows still works on Vista and still provides MM creation. (Just disable UAC — I think this is only necessary temporarily but I disable it permanently as it is such a nuisance.) It is not as stupendously elegant as the Mac version and doesn’t have auto-activation on NT-based versions of Windows, but it does work and it appears, even all these years later, and in Vista, for which it was never designed, to be, again, absolutely rock-solid, a testament both to the extraordinary care and skill that went into its programming and to Microsoft’s inflexible and wholly benign commitment to backward compatibility.\n\nI would go even further. ATM Deluxe for Mac is the most entirely satisfactory _software_ experience I have ever had. The reason is simple: no vital piece of system software was ever so reliable or such a simple pleasure to interact with.\n\nWe users are perpetually beleaguered with nervous stress due to buggy software. Can it be surprising that software of the calibre of ATM inspires such affection?\n\nATM’s success as a program was no accident. Adobe knew from the start that the future of PostScript itself depended on ATM’s exemption from any visible flaw. Consequently, there was probably no programming team that ever worked so hard for perfection.\n\nATM’s success as a profitable product is another story. For reasons nobody understands, ATM Deluxe did not sell much. The core code (PostScript rendering, but not font organization and not auto-activation) had to be given away both to Apple and Microsoft because there were never enough paying customers. Adobe had to do this to ensure the continued success of PostScript. As extra insurance, the core code is also included (as ’Cooltype’) in most of Adobe’s application products.\n\nATM Deluxe for Mac never developed to the point of characterizing fonts, but it made it so easy to do yourself that nobody missed the feature way back when. Were it ever to be revived, it would probably need such a feature.\n\nWhat ATM had going for it was trust. T R U S T. You knew it would never mess you up.\n\nW H E N is Adobe going to do it again? W H Y do people get so excited about new font managers without ever considering how incredibly difficult it is to write something so apparently simple? Why don’t they, instead, encourage Adobe to revive this most perfect software experience since Adobe is the one company with the experience and the personnel to do it right?\n\nNot that I mean to discourage Ian. Maybe open source is the best way forward, maybe it is the only way forward. In the meantime, OS companies need to hear that everybody wants auto-activation in all programs all the time. This is considered to be a great obstacle in NT+ and OS X. Who is going to let them know?\n\n"
    },
    {
      "time": " 19.Aug.2008 4.54am",
      "content": "Well you can’t discourage me when I’m obsessed like I am right now :)\n\ncouple of questions\n\n#1 : is anybody seriously using pfms/pfbs now? aren’t they all converted to OTF?\n\n#2 : anybody got the lowdown on auto-activation of fonts in CS3? just a quick search of the adobe site doesn’t pop up any interesting information, or is it just a case of a number of plugins for different apps? I haven’t got access to the photoshop SDK so I can’t tell.\n\nIan\n\n"
    },
    {
      "time": " 19.Aug.2008 5.25am",
      "content": "\\> _#1 : is anybody seriously using pfms/pfbs now?_\n\nWell, er, yes. All these unhappy guys with [old versions of Quark](http://web.archive.org/web/20081122063122/http:/www.typophile.com/node/33707), for example... (_hope my boss reads this..._)\n\nOr those who did not bother to upgrade their OS - and it does not support OTF without third-party tools.\n\n"
    },
    {
      "time": " 9.Oct.2008 4.26am",
      "content": "Do you know how to install FontMatrix in Windows?  \nThanx\n\n"
    },
    {
      "time": " 9.Oct.2008 4.49am",
      "content": "It’s ok! I needed to install the c++ runtime library [http://www.microsoft.com/downloads/details.aspx?familyid=200B2FD9-AE1A-4...](http://web.archive.org/web/20081122063122/http:/www.microsoft.com/downloads/details.aspx?familyid=200B2FD9-AE1A-4A14-984D-389C36F85647&displaylang=en \"http://www.microsoft.com/downloads/details.aspx?familyid=200B2FD9-AE1A-4A14-984D-389C36F85647&displaylang=en\")\n\n"
    }
  ]
}
