{
  "id": "48502",
  "title": "Mixing Hebrew & English Side-by-Side or in a Single Line",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": "A challenge to English/Hebrew typesetters and Hebrew type designers is how to successfully mix and match Hebrew and English either side-by-side (as in a translated work or a technical manual), or in a single line, or top and bottom paragraphs (as in a poster or flyer).\n\nRarely has this been done well. Often, we attempt to identify two different designs that work together well, as Boruch Gorkin did in his rendition of Ariel, which he created for Monotype and was later licensed to MicroSoft and Apple.\n\nAnother approach is to design the Hebrew letter forms in accord with the design attributes of the English letter forms. This approach rarely works successfully, because the dominant strokes of Hebrew letter forms are horizontal, and the dominant strokes of English letter forms are vertical.\n\nI did this with the popular \"Broadway Nights\" design, creating a similar \"freilich\" (joyful) design, called \"Purim Party\". I knew it had become popular, and widely accepted, because it was \"stolen\" by others, and even ended up as lettering on the side of a Jewish school building. I think that this is a sign of success.\n\n",
  "author": "gohebrew",
  "time": "18 Aug 2008 — 3:16am",
  "uid": "18444",
  "comments": [
    {
      "time": "18 Aug 2008 — 5:42am",
      "content": "\"Purim Party\" - copyright and trademarked by Israel Seldowitz\n\n ![](http://web.archive.org/web/20150414065739im_/http:/typophile.com/files/PurimParty_H_6114.jpg)\n\nThis Hebrew design is meant to work well beside the popular \"party-like\" design, known as \"Broadway\" or \"Broadway Nights\".\n\n"
    },
    {
      "time": "18 Aug 2008 — 5:50am",
      "content": "\"Broadway\" was copyright as an unpublished work by Bitstream. (Are they still in business?) They wrote it was \"confidential\", whatever that means? I've seen it float around by other venders, but Bitstream claimed copyright. Hmmm, makes you wonder.\n\n ![](http://web.archive.org/web/20150414065739im_/http:/typophile.com/files/PurimParty_E_4263.jpg)\n\nI think that they work together well, and both have a sense of celebration, like that associated with the holiday of Purim.\n\nThe design in Hebrew became popular in its own right. The Cheder, a large school in Brooklyn and popular catering hall, featured the \"Purim Party\" letters on its building in very large size type.\n\n"
    },
    {
      "time": "18 Aug 2008 — 7:37am",
      "content": "Israel, ever heard of Google? Or of myfonts.com or fontshop.com?\n\nJust use them and you will find that Broadway was designed by Morris Fuller Benton in the mid-twenties. And you will see that there are versions from many foundries, so the name and style are probably not in copyright, though the bezier curves of any particular version will be.\n\nYour Hebrew version is very nice--kol hakavod!\n\n"
    },
    {
      "time": "18 Aug 2008 — 4:01pm",
      "content": "William,\n\n\\> Broadway was designed by Morris Fuller Benton in the mid-twenties\n\nThank you for the imformation. If I was Bitstream, I would have written that: \"Inspired by Morris Fuller Benton\".\n\nIf he did it in the twenties, and it was not constantly renewed in the US Trademark Office, as there was no US Copyright for analog artwork or even \"mere digital data describing letter forms\", such as the bit-map technology, then it was in effect in the piblic domain.\n\nOn halacha, \"zchus hamechaber\" or \"zchus hayotzrim\" extends throughout the generations, as long as its not \"azil min hashuk\", \"disappears from the marketplace\".\n\nThank you for the compliment regarding Purim Party. Should I ask the Cheder for some money? No one ever paid me a dime for this large lettering.\n\n"
    },
    {
      "time": "18 Aug 2008 — 4:32pm",
      "content": "The question is whether the Cheder licensed the font from you or a dealer--or whether the signmaker who made it licensed it. Of course it is important to ascertain the facts first.\n\nIf they did not license it, and you didn't give it away, then whoever is a fault should pay you. Hopefully when the matter is brought to their attention they will do the right thing.\n\n"
    },
    {
      "time": "18 Aug 2008 — 6:16pm",
      "content": "Nah, they were just ripped it off. Maybe, a middlew man convinced them to do it.\n\nWe stopped licensing it many years before the Cheder was built. The sole Windows-based licensee (he had a Unicode word processor that replaced Multi-Linqual Scholar, but violated the contract by stealing this font and not paying for it).\n\nThe other Hebrew font packages were sold on Macintosh with coventional printer rights only, and not sign-making rights. The font outlines muyst beconverted to vectors to make signs. We prohibited this action, as the viewing of the outlines and their construction was required.\n\nI think that they would do the right thing too, because they don't want a court to rule: \"Tear it down.\"\n\n"
    },
    {
      "time": "18 Nov 2008 — 3:37am",
      "content": "<cite><br>\nA challenge to English/Hebrew typesetters and Hebrew type designers is how to successfully mix and match Hebrew and English either side-by-side (as in a translated work or a technical manual), or in a single line, or top and bottom paragraphs (as in a poster or flyer).<br>\n</cite>  \nWhat about the translation in most siddurim? It seems to bee common to have the english/german/russian etc. texts on the left hand side and the hebrew text on the right hand side.\n\nThis way, in my opinion, the reading directions are working \"against\" each other but if you use both translation and original text it would be helpful to see the hebrew text on the left hand side and the translation on the right hand side. Both texts are starting from the same place...:  \n [http://photos1.blogger.com/blogger/3734/383/320/khadesh\\_yameinu.jpg](http://web.archive.org/web/20150414065739/http:/photos1.blogger.com/blogger/3734/383/320/khadesh_yameinu.jpg \"http://photos1.blogger.com/blogger/3734/383/320/khadesh\\_yameinu.jpg\")\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "18 Nov 2008 — 5:57am",
      "content": "Welcome back. We missed you, and your insightful comments and useful links, as above.\n\n"
    },
    {
      "time": "18 Nov 2008 — 11:54pm",
      "content": "Thank you, I am still online but was \"occupied\" with some other projects...  \nSo, I am ready to talk about the best siddur layout ;-)\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "19 Nov 2008 — 10:32pm",
      "content": "I forgot what I said before. But on the left should be English, and on the right should be Hebrew.\n\nWhy?\n\nHere, less eye movement is better.\n\nThe Hebrew reader moves his or her eye from the right to the left.  \nThe English reader moves his or her eye from the left to the right.\n\nIf the Hebrew reader starts on the far right, he or she can easily glance ahead for a translation of a word or phrase.  \nSimilarly, if the Hebrew reader starts on the far left, he or she can easily glance ahead for a translation of a word or phrase.\n\nSo, there is less eye movement.\n\nBut if the Hebrew reader starts in the middle, he or she can only glance back for a translation of a word or phrase, and then again all the way over to continue.  \nSimilarly, if the English reader starts in the middle, he or she can only glance back for a translation of a word or phrase, and then again all the way over to continue.\n\nSo, there is more eye movement.\n\n"
    },
    {
      "time": "24 Nov 2008 — 3:18am",
      "content": "In my opinion it was just a matter of \"tradition\". Once people started to print the texts with the translation along, all other printers went the same way without thinking that there could be another way of presentation and indeed, not many printers thought about a \"nice layout\". I own a siddur from Danzig where the translation is under the hebrew text, which is also very nice. Einhorn made his Reformsiddur with a translation in form of a footnote. How would you organise a new siddur?\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "24 Nov 2008 — 2:35pm",
      "content": "Simon Prais wrote an important paper on the subject some years ago, now available here: [http://www.hebrewtypography.me.uk/Hebrew%20Typography%20Thesis.html](http://web.archive.org/web/20150414065739/http:/www.hebrewtypography.me.uk/Hebrew%20Typography%20Thesis.html \"http://www.hebrewtypography.me.uk/Hebrew%20Typography%20Thesis.html\")\n\n"
    },
    {
      "time": "25 Nov 2008 — 12:31am",
      "content": "Misha, Thank you very much for the intersting link! Of course I downloaded the book and I am happy to see: He is on my side ;-)\n\n<cite><br>\nA common mistake in bilingual books and single foldes leaflets is the fact that the Hebrew is always printed to the right of the English. This produces spreads in which the two languages always read into each other. There are a number of reasons why this format is wrong and the only reason for its continued use is that people are used to it.<br>\n<em>Simon Prais, Hebrew typography page 29</em><br>\n</cite>\n\nThe book is a very smart discussion of all the problems I think of.  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "25 Nov 2008 — 1:25am",
      "content": "Mr. Simon Prais does not offer any rationale for his preference, but only comments: <cite>\"A common mistake...this format is wrong...the only reason for its continued use is that people are used to it.\"</cite>\n\nIsn't this dictorial?\n\nThere is a logic to placing Hebrew on the left of English when Hebrew is ragged left and English is ragged right, for aesthetics only. Also, if the reader does not know the other language.\n\nIn that case, up and down also works.\n\nBut if the reader prays in one languages and uses the other simply to help understanding, placing Hebrew on the right of English is logically preferred. Here, Mr. Prais seems incorrect. The burden of proof is upon him, and you.\n\n"
    },
    {
      "time": "30 Nov 2008 — 12:46pm",
      "content": "It is true that the direction of eye movement is an important consideration. however there are also other problems.  \nIn a translation from Hebrew into English, the English will usually have more words.  \nIn Hebrew, brevity is an valued quality.  \nThere is sometimes a reluctance to put line breaks into a sacred text as they may indicate a particular interpretation.  \nWhen English and Hebrew have the same point size, the English with its vertically oriented Latin characters will be dominant the page unless the Hebrew is printed bold.  \nAll these factors can result in texts that not \"in sync\" in the sense of layout. When I come across a Hebrew word I don't understand, it can be quite difficult to find the corresponding translation in the supposedly parallel text. Typically the font size is different and column width may also be different. The Hebrew may have the verse numbers outside the sacred text in the margin whilst the English has the numbers at the start of each verse.  \nMike\n\n------------------------------------------------------------------------------------  \nMichael Cunliffe Thompson  \nSeascapes and Landscapes of New England and...  \nHebrew Calligraphy at [http://cunliffethompson.com/font](http://web.archive.org/web/20150414065739/http:/cunliffethompson.com/font \"http://cunliffethompson.com/font\")\n\n"
    },
    {
      "time": "30 Nov 2008 — 2:06pm",
      "content": "Mike,\n\nYou raised an important point regarding brevity. It isn't that it's \"in Hebrew, brevity is an valued quality\". Rather, less words are required to express the same idea in Hrbrew than English This simply is due to the unique quality of Hebrew. Russian is even longer.\n\nFurther, each word of Hebrew also alludes to another meaning as well. This is often not even translated.\n\nYou are correct that in terms of typography, side-by-side text requires either smaller size type for English, or greater line spacing for Hebrew. Usually, the solution is both, to avoid extremes, too small English type or too mch space between lines for Hebrew.\n\nAnother shrewd technigue is to increase the line lngth of the English, and reduce the line length for the Hebrew, and/or set the letters and words much closer in English, and much farther apart in the Hebrew.\n\nI believe custom made matching Hebrew and Englsh fonts with these qualities is the ideal solution.\n\n"
    },
    {
      "time": "1 Dec 2008 — 4:28pm",
      "content": "I have just downloaded and read the thesis by Simon Prais, \"Design Considerations Affecting Simultaneous Use of Latin & Hebrew Typography\". (A link appears in an earlier post in this forum.) The thesis is perceptive and thoughtful. I recommend it. It is twenty years old so some of the technical discussion is way out of date but the problems remain.\n\ngohebrew wrote: \"I believe custom made matching Hebrew and Englsh fonts with these qualities is the ideal solution.\"  \nA suggestion by Prais is to regard the baseline in Hebrew as being at the top of the letters. I view of this we might consider a custom matching English font that would have lower case letters hanging from such a baseline.\n\nMike\n\n"
    },
    {
      "time": "1 Dec 2008 — 10:06pm",
      "content": "Why choose the baseline? It is an abitrary position, simply to rest the letters upon.\n\n"
    },
    {
      "time": "2 Dec 2008 — 7:03pm",
      "content": "gohebrew  \nPrais suggeted that the tops of the Hebrew characters were more important visually than the bottoms. Following this train of thought, by \"baseline\" I wasn't refering to y=0 in a font designer program but rather I was thinking of the visual effect.\n\nFor instance, one might have the tops of all the lower case Latin characters and the tops of all the Hebrew characters share the same y value but not have their bottoms share the same y value. Putting it another way, the letters would be aligned at the top rather than the bottom.  \nSame might apply also to numerals.\n\nMike\n\n"
    },
    {
      "time": "2 Dec 2008 — 9:23pm",
      "content": "This is an interesting unconventional approach.\n\nI must see how it looks.\n\n"
    },
    {
      "time": "6 Dec 2008 — 10:13am",
      "content": "Firstly, Simon Prais is considered to be a world authority on Hebrew typography highlighted by the fact that various Univesities around the world that teach typography invite him at their expense to lecture on the subject so I wouldn't dismiss him too quickly.\n\nIn fact he consulted on the new bilingual Koren Siddur (pages can be see at [www.korenpub.com/siddurpages](http://web.archive.org/web/20150414065739/http:/www.korenpub.com/siddurpages \"www.korenpub.com/siddurpages\") – be patient they take a while to load).\n\nOf course the Hebrew should be on the left. This is for 3 reasons that I can think of:\n\n1. Whenever you have prayers that are set line by line such as Ashrei, if you set the Hebrew on the right then you get an ugly negative white space in the middle.\n\n2. Siddurim are Hebrew books. When opening a Hebrew book you should see Hebrew, not English. If the English is on the left, then you see English.\n\n3. When you finish a page of prayer and you start to turn over the page, you should see Hebrew again. (This is really the same argument as 2. to be honest).\n\nThere are other reasons too. Let's say you are davening the Amida. You know it off by heart, but frankly you don't have a clue what you are saying so you decide to read the English whilst saying the Hebrew. By setting the English on the right, you can quickly see the beginning of the Hebrew prayer (eg Ata Kadosh) then without having to skim an entire spread, you simply glance over the spine and quickly see the beginning of the English. Much more user-friendly.\n\nOriginally books were set eith the Hebrew on the left. Take a look at the Polyglot Bible here: [http://www.newadvent.org/images/05286abx.jpg](http://web.archive.org/web/20150414065739/http:/www.newadvent.org/images/05286abx.jpg \"http://www.newadvent.org/images/05286abx.jpg\")\n\nand you can see that Hebrew was printed on the left.\n\nPersonally, if you are setting the Hebrew full justified, I think that the tradition of putting the Hebrew on the right is so strong that I wouldn't change it, but if you are setting text ragged (such as half the Koren Siddur), then you have no choice, if purely for aesthetic reasons, to set the Hebrew on the verso.\n\n"
    },
    {
      "time": "6 Dec 2008 — 10:16am",
      "content": "<cite>A suggestion by Prais is to regard the baseline in Hebrew as being at the top of the letters. I view of this we might consider a custom matching English font that would have lower case letters hanging from such a baseline.<br>\n</cite>\n\nIn the new Koren Siddur we tried to follow this system (actually this was done in Koren Siddurim from the beginning). You will notice that source references on the Hebrew and English sides hang from the top and on the Hebrew side, instructions that are inline or on the right of the text also hang from the top of the letter.\n\nIt's hard to do since Hebrew typography and typefaces are designed to sit on the baseline rather than hang as is traditional in Hebrew so we tried to create a balance.\n\n"
    },
    {
      "time": "8 Dec 2008 — 7:22am",
      "content": "<cite><br>\nBut if the reader prays in one languages and uses the other simply to help understanding, placing Hebrew on the right of English is logically preferred. Here, Mr. Prais seems incorrect. The burden of proof is upon him, and you.<br>\n</cite>\n\nI guess Raphael Freeman gave the right explanation concerning this. A siddur draft I made with hebrew on the left and german on the right, people were pleased with this type of presentation... but some are used to see the \"traditional layout\"...  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "8 Dec 2008 — 9:57am",
      "content": "It seems that people are at first surprised with the Hebrew on the left, however in the field, people get used to it very quickly as can be seen by this review and some of the comments on the ARC of the new siddur:\n\n[http://adderabbi.blogspot.com/2008/12/book-review-yehuda-bilingual-editi...](http://web.archive.org/web/20150414065739/http:/adderabbi.blogspot.com/2008/12/book-review-yehuda-bilingual-edition-of.html \"http://adderabbi.blogspot.com/2008/12/book-review-yehuda-bilingual-edition-of.html\")\n\n"
    },
    {
      "time": "10 Dec 2008 — 12:54am",
      "content": "I think I will buy this new siddur to review it in my blog (in german language), I even started to \"review\" siddurim in a jewish weekly (also in german). Mostly because I really would like to push this \"hebrew on the left\" thing ;-) .  \nOne article is available online [http://www.juedische-allgemeine.de/epaper/pdf.php?pdf=../imperia/md/cont...](http://web.archive.org/web/20150414065739/http:/www.juedische-allgemeine.de/epaper/pdf.php?pdf=../imperia/md/content/ausgabe/2008/ausgabe45/15.pdf \"http://www.juedische-allgemeine.de/epaper/pdf.php?pdf=../imperia/md/content/ausgabe/2008/ausgabe45/15.pdf\") , I am sorry it is in german only...\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "10 Dec 2008 — 6:52am",
      "content": "Chajm, if you are reviewing siddurim, you might be interested in looking at the new Reform siddur in the US: Mishkan Tefila. Whatever you think of its philosophy, graphically it is innovative, and I think quite well done.\n\nIts basic idea is to put the traditional prayers in both Hebrew and English on the right, and related modern prayers and poems on the left. The translations of the traditional prayers are more literal--and better--than the old Reform or Conservative siddurim. They also use plenty of white space and two colors of text to help orient the reader. [This review in the NY Times](http://web.archive.org/web/20150414065739/http:/www.nytimes.com/2007/09/03/us/03prayerbook.html?pagewanted=2&sq=mishkan%20t&st=cse%27fila%20book%20review&scp=1) has a link to a page spread, but it is small and one color so it doesn't really give you a good idea.\n\nThe concept is that each congregation can mix the traditional and modern as they like.\n\nI'd be interested in what you all think of it as a piece of typography.\n\n"
    },
    {
      "time": "10 Dec 2008 — 11:50am",
      "content": "Of course I know about it ;-) I was extremely interested so I tried to contact some person who is responsible and also tried to order a review copy, but nobody ever answered so I \"buried\" the idea to write about it. Recently I wrote about the new \"Seder ha Tefilot\" the siddur of the british Reform movement. Very conservative choice of fonts (Times and Frank Rühl) but some nice inventions but also some very smart texts...\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "10 Dec 2008 — 10:22pm",
      "content": "Scott Kesofsky's siddur (really machzor) for the conservative movement is absolutely stunning. He uses a custom version of Hadasa, with a modern motif, and sophisticated OpenType programming, which I created for him, with addition cousel from John Hudson and Diane Collier (experts in MS Volt, both employed at times by MicroSoft).\n\nHe has a website called I think [www.philidor.com](http://web.archive.org/web/20150414065739/http:/www.philidor.com/ \"www.philidor.com\"). You can email him their about a review copy.\n\n"
    },
    {
      "time": "10 Dec 2008 — 8:01pm",
      "content": "Israel, I'm glad that there is going to be a replacement for Sim Shalom, the Conservative siddur; I really disliked the way the Melior looked in the English text. Are there previews anywhere?\n\n"
    },
    {
      "time": "11 Dec 2008 — 12:46am",
      "content": "There will be a new version of the conservative siddur/machzor? That is more than interesting!! There was also a customized version of Hadasah in the new British (orthodox) siddur, wasn't it?\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "11 Dec 2008 — 6:27am",
      "content": "I am unaware of the British's customied version of Hadas. How is it different?\n\nKesofsky's Milon is very modern, but is reminiscent of Hadasa. He is a true artist and unique designer, and excellant typesetter, who style is very high end.\n\nRaphael is also very good, but has a conservative style.\n\nI created a sopisticated OpenType version of Milon. I am urging Scott to create an italic as well.\n\nHe is working on a modern version of FrankRuhl too, which will cause a big stir by Hebrew type enthusiasts.\n\nBeta example of Milon by Scott Kesofsky. I am still working on the alignment issues. Available from [www.fontworld.com](http://web.archive.org/web/20150414065739/http:/www.fontworld.com/ \"www.fontworld.com\").\n\n ![](http://web.archive.org/web/20150414065739im_/http:/typophile.com/files/Bialik_p1_3993.jpg)\n\n"
    },
    {
      "time": "11 Dec 2008 — 7:01am",
      "content": "Raphael Freeman knows better than me ;-) He commented my short review:  \n [http://www.sprachkasse.de/blog/2007/06/25/the-authorised-daily-prayer-book/](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog/2007/06/25/the-authorised-daily-prayer-book/ \"http://www.sprachkasse.de/blog/2007/06/25/the-authorised-daily-prayer-book/\")\n\nBut I think it was הדסה חדש [http://www.fontbit.co.il/html\\_view.asp?id=195](http://web.archive.org/web/20150414065739/http:/www.fontbit.co.il/html_view.asp?id=195 \"http://www.fontbit.co.il/html\\_view.asp?id=195\")\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414065739/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "12 Dec 2008 — 4:27am",
      "content": "There are some design similarities between FontBit's New Hadasa and Scott Kesofsky's Milon. Milon had different shapes on certain letters, many different widths, and almost a completely different set of side-bearings.\n\nIf you look at either one from afar, they clearly look like Friendlaender's Hadasa. Up close they look modern, but Kesofsky's looks perfected.\n\nI think ifI was professionally typesetting, I'd pick Kesofsky's. If I wanted to save a fe hundred dollars, I'd buy FontBit's.\n\nI think after Keosofsky adds an italic (he has a bold already), I think that the comparison will no longer be made.\n\n"
    },
    {
      "time": "12 Dec 2008 — 7:02am",
      "content": "Independently from my inability to read Hebrew, I would have never thought to place Hebrew at the right in a bilingual layout… :=) As far as I am able to understand the internal dynamics of a page I have to design, I would always try to accommodate things to make the reader's experience the best. Especially with scriptural content or prayers…\n\nI have to ask you a question: to an Hebrew's eye is the perception of \"text blocks\" independent from the reading and writing direction? I mean, if the Hebrew block is on the left, is it usually perceived after the Latin-based one? After all, if it's a multi-lingual layout, the way we look at it would change, both if we have a LTR and a RTL habit due to our native writing.\n\n"
    },
    {
      "time": "12 Dec 2008 — 7:46am",
      "content": "Claudio, if you know any Hebrew, your eye automatically goes to the top right to start reading that script. The Hebrew letters open to the left also, giving a sense of movement right to left, so your eye has every signal to start right as the beginning.\n\n"
    },
    {
      "time": "13 Dec 2008 — 3:44am",
      "content": "Thanks William,  \nbut if the layout is mixed – and maybe unusual (i.e. different from traditional Hebrew scriptural layouts, with the different commentary, etc.) would the eye automatically perceive the Hebrew main text BLOCK placed on the left as \"out of place\"? Just curious, I think the biggest improvements of typography may be done by considering the page as a living entity (and not just by the quality of type or an excessive \"rationale\" in the page creation)… :=)\n\n"
    },
    {
      "time": "18 Dec 2008 — 8:40pm",
      "content": "Presuming the principal language of the text is Hebrew and the English is a translation, one could arrange a two-page spread like this:  \n`\n__________\n|....|....|\n|..H.|.H..|\n| ____|____ |\n|....|....|\n|..E.|.E..|\n| ____|____ |\n`\n\nA fine line dividing the top from the bottom part of the page can be helpful.\n\n"
    },
    {
      "time": "18 Dec 2008 — 9:05pm",
      "content": "John, when you have side by side, you can see what is translating what. The side by side approach thus helps the English speaker who knows some Hebrew, and wants to refer to the Hebrew to gain a deeper understanding of the text. And it helps the English speaker who is reading a prayer in Hebrew with only partial understanding and wants to refer to the English to understand the Hebrew better. Especially the latter is a most common situation for the Siddur, the prayer book.\n\nAn example of this approach that takes the side-by-side approach the furthest is the Metsudah Siddur, which has mirrored English and Hebrew of the same phrases--Hebrew on the right, left aligned, English on the left, right aligned. The same phrase is mirrored in two languages on a common gutter. Functionally, it is almost like an interlinear translation, but with the advantage that if you want to read the English or Hebrew straight, you can do it more easily.\n\nIf you have large blocks of text up and down, as you show, you loose these advantages. But of course what is best depends on how the text is going to be used.\n\n"
    },
    {
      "time": "19 Dec 2008 — 11:29am",
      "content": "Yes, I tend to agree with William, since if there is a translation it's very likely we have people interested in \"interlinearity\", not occasional readers.  \nOn a side note, the main edition of the Bible we have here in Italy with interlinear text (Greek / Latin / Italian) sucks big time… Ah, I'd like to be a publisher/printer…\n\n"
    }
  ]
}
