{
  "id": "4850",
  "title": "Bad color choices - MCAD catalog",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Am I getting old or what? Yeah, It's rhetorical.   \n   \nI seem to be finding a lot of examples of bad color choices with type. The latest example that drove me nuts was from the Minneapolis College of Art and Design catalog for continuing education classes. Dark yellow type on lilac. You can download the equally irritating pdf by clicking on the \"Summer Course Catalog\" link from this page:   \n   \n [http://www.mcad.edu/continue/fs-continue.htm](http://web.archive.org/web/20050516051332/http:/www.mcad.edu/continue/fs-continue.htm)   \n   \nIt reminds me of a local eatery called The French Meadow Bakery -- their coffee menu is written in brick red chalk on a black chalkboard. I told a friend, \"If I hadn't had any, I sure as heck wouldn't be able to order it from that!\"\n\n",
  "author": "kristin",
  "time": "Wed, 2004-05-19 14:41",
  "uid": "1553",
  "comments": [
    {
      "time": " Wed, 2004-05-19 15:58",
      "content": "Uf! That's pretty bad. I did a vivid orange on a deep purple once ... I wanted it to be jarring, though, and it was only the headline.   \n   \nI printed your catalog out on the color xerox, and the orange died a little, so the print-out is almost readable.   \n   \nThe cool thing about this is that it makes me feel good about my designs.\n\n"
    },
    {
      "time": " Thu, 2004-05-20 07:25",
      "content": "I recently asked my supervisors at work if they'd be willing to pay for the local AIGA new media conference.   \n   \nI showed them the web site:   \n [http://www.aigaminn.org/exhibita/index.asp](http://web.archive.org/web/20050516051332/http:/www.aigaminn.org/exhibita/index.asp)   \n   \nAnd the unanimous response was:   \n   \n'are you nuts? It's PINK and I can't read any of the type?'   \n   \nNeedless to say, the graphic design and typography of the awards didn't win over too many laypersons into thinking that these were reputable awards. ;o)   \n   \nAs for MCAD, I could have understood the color choices for the undergrad catalog, but not continuing ed. I can't read a damn thing on that page.\n\n"
    },
    {
      "time": " Thu, 2004-05-20 10:33",
      "content": "Darrel: supervisors, laypersons, and grown-ups in general tend to be pinkophobic. It's just something we \"creatives\" have to accept.\n\n"
    },
    {
      "time": " Thu, 2004-05-20 12:41",
      "content": "Reminds me of the old Wired layouts -- stuff like Pantone silver over sherbet orange or lime green.\n\n"
    },
    {
      "time": " Thu, 2004-05-20 14:04",
      "content": "\\> supervisors, laypersons, and grown-ups in general tend to be pinkophobic   \n   \nMy grandfather (a farmer whose design instincts revolved around finding things that could be used for fences, gates, etc. on the farm) was very fond of pink, and even painted two rooms in their house (very pale) pink. They also had a bunch of very cool art deco stuff that I couldn't appreciate as a kid. C'est la vie.\n\n"
    },
    {
      "time": " Tue, 2004-05-25 13:40",
      "content": "Eeek! Just found this orange-on-orange sidebar on the AIGA site.   \n   \n [http://www.aiga.org/content.cfm/365%5Fselections2003](http://web.archive.org/web/20050516051332/http:/www.aiga.org/content.cfm/365%5Fselections2003)   \n   \nMaybe orange is the new black?\n\n"
    },
    {
      "time": " Tue, 2004-05-25 13:43",
      "content": "\"_Maybe orange is the new black?_\"   \n   \nHeh, maybe it _was_ the new black. I think it reached a recent saturation point at the end of the '90s. Interestingly, this is when I first noticed (late '97) the company [Orange](http://web.archive.org/web/20050516051332/http:/www.orange.ch/) was pushing itself in Europe.   \n   \n ![:-)](http://web.archive.org/web/20050516051332im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI actually think orange is a great color, but it seems saddled with A) warning connotations or B) fad-ish associations. Or maybe that's just me...\n\n"
    },
    {
      "time": " Wed, 2004-05-26 03:33",
      "content": "\\>\\>Maybe orange is the new black   \n\\>\\>Heh, maybe it was the new black   \n   \nWell it might have been, but since old is the new new, and black is still the old black, then really black is actually the new black.\n\n"
    },
    {
      "time": " Wed, 2004-05-26 05:58",
      "content": "Actually I applaud what MCAD did. You have to take chances, and if you don't take chances you aren't trying hard enough, and if you aren't trying hard you're doing a disservice to your clients. A designer who never goes overboard is a designer who does vanilla crap.\n\n"
    },
    {
      "time": " Wed, 2004-05-26 07:34",
      "content": "There's a fine line between 'taking chances' and 'pumping out crap' though.   \n   \nBut, then again, I'm a jaded, cynical graphic designer who feels a lot of what we do these days (or at least what gets press in the community) has little to do with 'good design' and more to do with 'pretty decorations' a lot of the time. ;o)   \n   \nApparently, the AIGA show mentioned above didn't go over real well. Most of the entries, as usual, were pretty, but lacked in all sorts of other design criteria (usability, accessibility, functionality, etc.). It's that kind of thing that bums me out.\n\n"
    },
    {
      "time": " Wed, 2004-05-26 07:34",
      "content": "To get back to the MCAD page.   \n   \nI don't mind the color scheme. You can do things with RGB that you can't in print.   \n   \nBut the real weakness with the type at the bottom is this: It is set in Base, famously with \"media specific\" versions -- and yet the face is not bitmapping correctly here, it is incorrectly used. THAT is poor typography (for instance, look at the \"m\" with uneven stem spacing).\n\n"
    },
    {
      "time": " Wed, 2004-05-26 10:16",
      "content": "_Actually I applaud what MCAD did. You have to take chances, and if you don't take chances you aren't trying hard enough, and if you aren't trying hard you're doing a disservice to your clients. A designer who never goes overboard is a designer who does vanilla crap._   \n   \nWell, yeah ... kinda. I think it's OK to go overboard, but it's not OK to make something unreadable in the process. Maybe I've turned into a hack, but I always ask myself, \"Is this doing anything to enhance communication?\" If it's not helping, it gets cut. If it's actively hindering communication, it gets cut, thrown on the floor and stomped.   \n   \nThe orange on purple text in the pdf is almost impossible to read. The printout on my color printer is difficult to read. Without the actual printed piece, I don't know how difficult it was to read, but judging from Krisin's original reaction, it wasn't good.   \n   \nIf a client is paying for a design, I think the designer has an obligation to make it usable/readable. An unreadable piece might not be vanilla, but it's probably not a success.   \n   \nNick: are you talking about the cover, or the insides?\n\n"
    },
    {
      "time": " Wed, 2004-05-26 12:09",
      "content": "Jay, I just clicked on Kristen's link and looked at the web page, so looks I'm talking about the wrong thing.   \n   \nI had a look at the catalog just now, and the PDF of the inside pages is impossible to read. maybe the printed version is OK, but they should have checked at the pdf if they're going to post it.\n\n"
    },
    {
      "time": " Wed, 2004-05-26 12:39",
      "content": "I have a buddy here at work who's color blind, and the orange-on-lavender he said was totally readable. :-)\n\n"
    },
    {
      "time": " Wed, 2004-05-26 12:51",
      "content": "That's it! It's perfect for those who are colorblind! ![:-)](http://web.archive.org/web/20050516051332im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI did see the printed piece and thought it was entirely wrong for the audience.\n\n"
    },
    {
      "time": " Thu, 2004-05-27 10:53",
      "content": "nevermind\n\n"
    }
  ]
}
