{
  "id": "48522",
  "title": "Please comment my new font",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi everyone. I'm working on this serifed font. I am still not sure if I'm going a make a text family from this, but the idea is to make a typographic companion for my previous font Orbe [http://www.fountain.nu/catalogue/orbe.asp](http://web.archive.org/web/20150417170015/http:/www.fountain.nu/catalogue/orbe.asp \"http://www.fountain.nu/catalogue/orbe.asp\")\n\nI would love to have your opinion on this. thanks in advanced.\n\n ![](http://web.archive.org/web/20150417170015im_/http:/typophile.com/files/spec_4953.jpg)\n\n",
  "author": "rui abreu",
  "time": "18 Aug 2008 — 11:48am",
  "uid": "12433",
  "comments": [
    {
      "time": "18 Aug 2008 — 12:05pm",
      "content": "That's quite lovely. I love the ampersand, and the alternate v, w, and y.\n\nTo me, the only character that looks a little odd is the 3. It seems unbalanced without the ball serif on the top.\n\n"
    },
    {
      "time": "18 Aug 2008 — 1:01pm",
      "content": "Rui,\n\nThis is a really nice one!. Just a few things that \"pop out\" from the overall good flow and rhythm of this typeface.\n\nI agree on the comment made for the number 3. The ampersand is great but more as a alternate rather that a regular ampersand to me. The Euro sign could also have thin \"ball serifs\" like the other currency signs. The upper case R is also to \"alternate\" for me.  \nApart form that I like what I see. Gives me a sort of a \"funky Bodoni\" feeling. Good luck with the finalisation of your typeface.\n\nPS. The posters for TypeCon 2008, that Peter Bruhn made with your typeface on the front page made a success!\n\n"
    },
    {
      "time": "18 Aug 2008 — 2:03pm",
      "content": "yes, I agree the 3 is unbalanced and maybe the 2 as well. I have to fix these.  \nAbout the exuberances still present here, like the upper case R, I still have to make more \"quiet\" glyphs and have letters like the \"R\", \"g\" and Ampersand as alternatives. I'll show more soon.\n\nStefan, Peter's poster was also very nice.\n\n"
    },
    {
      "time": "18 Aug 2008 — 9:33pm",
      "content": "Very nice! I agree that tamer versions of R, g, &, etc, might make it more useful. Where's 9? Old-style numerals would also be a nice addition, and you could make them a bit more eccentric. The contrast is fantastic.\n\nOh, also, is Œ supposed to be shorter?\n\n"
    }
  ]
}
