{
  "id": "48538",
  "title": "LOGO TO LOOK AT (i'm not a designer / trying to help a friend)",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "putting together a logo / wordmark for an industry blog site — name is Golf News Now —he comes from a news background and wants to ’eventually’ truncate to GNN — need to establish the wordmark / brand identity first — i suggested just a wordmark, but seeing as it is a Canadian site, there is a flag (maple leaf) as well (nothing golf — figured it was self explanatory in the name and imagery could be used eleswhere\n\n ![](http://web.archive.org/web/20081122115705im_/http:/www.typophile.com/files/logo_temp2_5809.png)\n\ncould also use an idea for a typeface for seventyone (it’s a craetive agency)\n\ngreat forum\n\n [‹ Wordmark for rapid software application development](http://web.archive.org/web/20081122115705/http:/www.typophile.com/node/48115 \"Go to previous forum topic\") [Critique, developing new logo ›](http://web.archive.org/web/20081122115705/http:/www.typophile.com/node/47456 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122115705/http://www.typophile.com/user/35672\" title=\"View user profile.\">seventyone</a>",
  "time": "<br>",
  "uid": "35672",
  "comments": [
    {
      "time": " 18.Aug.2008 6.12pm",
      "content": "I’m not a professional designer but I have some suggestions.\n\nThe “Canada’s trusted source...” part is way too tiny. Also even if you make it larger that amount of text would look better in a cleaner, easier to read font. You might even want to come up with a more concise tagline if you truly intend to make it part of the logo.\n\nI really like the Flag/Leaf concept.  \nHere’s my attempt at making it more flag-like:\n\n ![](http://web.archive.org/web/20081122115705im_/http:/www.typophile.com/files/flag_6630.gif)\n\nThe main typeface (Serpentine) looks dated so you might want to experiment with one that gives a more modern appearance...\n\nHere’s two that might work better...\n\n——————-House Gothic————————————Stainless——————-\n\n ![](http://web.archive.org/web/20081122115705im_/http:/www.typophile.com/files/golf_4595.gif)\n\n"
    },
    {
      "time": " 18.Aug.2008 8.51pm",
      "content": "To be honest, this is a total mess. Why is this so complex? Why this type treatment? Not everything Canadian needs a maple leaf - but if you have to use it, why not combine the leaf with golf imagery? Do you have sketches? What is the idea behind this?\n\n"
    },
    {
      "time": " 19.Aug.2008 6.54am",
      "content": "eww. Serpentine.\n\n"
    },
    {
      "time": " 19.Aug.2008 8.53am",
      "content": "GNN = [Guerilla News Network](http://web.archive.org/web/20081122115705/http:/www.guerrillanews.com/)\n\nIf you’re committed to using a maple leaf, why not use a dark green one? Aside from the obvious golf colour tie-in, that’s how the majority of such leaves appear in nature.\n\nAnyway, your leaf illustration needs some tweaking to make it more recognizable (see Zev’s tweak for the general direction you should be headed in) and a type substitution is definitely recommended. I’d also get rid of the underline/frame thing, and leave the tagline out for now.\n\n"
    },
    {
      "time": " 19.Aug.2008 9.26am",
      "content": "thanks for the comments ,,,\n\nno sketches — the idea is an easily recognizable and memorable wordmark / name for a web based blog / news site\n\nthe content will be industry ’news’ about golf — hence the stab at using a old style ’news’ type font for the tag line — trying to invoke credibility and news source — where the info / writing is paramount vs the images & design\n\nthe focus needs (as per owner) on the GNN as eventually he’d like to be recognized under that name (once the industry knows what the letters stand for etc\n\nthe focus will be canadian & golf & news — but we did not want to be too cliched in the design (maybe it was anyway based on the comments)\n\ni like to green leaf idea (but perhaps that is too clever for the average audience and the red does have more impact)\n\ni’ll rethink it and try some of the suggestions — thanks for the insight (you all are i’m certain far better designers than i)\n\n"
    },
    {
      "time": " 19.Aug.2008 9.51am",
      "content": "So I guess what you’re saying is that you want to use a serif :). That’s a fine idea. But I certainly wouldn’t use that font if I were you. Not only does it look dated. It is plain ass ugly :). If you’re looking for free fonts (I take it you are not yet up for buying a font), you might want to take a look at [Tallys](http://web.archive.org/web/20081122115705/http:/www.josbuivenga.demon.nl/tallys.html). I think it is a very modern font that looks very serious, but has a nice playful edge that you might want to have in your logo.\n\nYes, red will have more impact at first glance. But it does not differentiate your logo from the so many other red maple leaf logo’s. So in the long run, going for a green leaf might have more impact. You can still play with red elements in your logo, as red and green are a very appealing colour combination to many (not to me though, I absolutely hate it :p).\n\n—  \n [LGD](http://web.archive.org/web/20081122115705/http:/livegraphics.eu/) • [U&Me](http://web.archive.org/web/20081122115705/http:/uandme.be/)\n\n"
    }
  ]
}
