{
  "id": "48582",
  "title": "Looking for works done with Robert Slimbach's typefaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Dear Typophiles,\n\nFor a publication about Robert Slimbach, I'm looking for digital samples (PDF, high-resolution bitmaps, high-quality photos) showing his typefaces in action. These might be book spreads, posters, newspapers, corporate identities or other quality typographic works.\n\nI'm looking for samples in all languages (not just English), both older (using the old Type 1 fonts) and newer (showing the OpenType versions), exhibiting both \"classical\" and \"original/inventive\" use of his typefaces, in particular his less known typefaces (i.e. not necessarily Minion). High-profile work, well-known brands etc. are also welcome.\n\nAnd, of course, I'm looking for works that I would be permitted to use in the publication (both print and web).\n\nAs a reminder, below is a list of Robert's typefaces.\n\nPlease contact me directly at [adam@twardoch.com](mailto:adam@twardoch.com) with the subject line \"Slimbach\".\n\nMany thanks in advance!\n\nRegards,  \nAdam\n\nAdobe Garamond  \nAdobe Jenson  \nArno  \nBrioso Pro  \nCaflisch Script  \nCronos  \nGaramond Premier  \nITC Giovanni  \nKepler  \nMinion  \nMyriad  \nPoetica  \nSanvito  \nITC Slimbach  \nUtopia  \nWarnock\n\n",
  "author": "twardoch",
  "time": "19 Aug 2008 — 4:42pm",
  "uid": "1133",
  "comments": [
    {
      "time": "19 Aug 2008 — 5:38pm",
      "content": "Adobe Garamond Titling (perhaps) - [McSweeney's](http://web.archive.org/web/20150302150143/http:/www.mcsweeneys.net/)  \nAdobe Jenson - [My European Adventure](http://web.archive.org/)  \nWarnock - [Traveller's World](http://web.archive.org/web/20150302150143/http:/www.graphic-exchange.com/exellence/huber.htm) (near the bottom)  \nCaflisch Script - [mint truffles packaging](http://web.archive.org/web/20150302150143/http:/www.bustbright.com/portfolio.html)  \nCronos - [San Diego Zoo](http://web.archive.org/web/20150302150143/http:/sandiegozoo.com/)  \nCronos - [Europharm](http://web.archive.org/web/20150302150143/http:/brandient.com/en/portfolio/case_studies/europharm/)  \nITC Giovanni - [Simply Organic](http://web.archive.org/web/20150302150143/http:/www.fontshop.com/features/newsletters/aug2006_a/)  \nITC Giovanni - [Imagekind](http://web.archive.org/web/20150302150143/http:/www.imagekind.com/)  \nITC Giovanni - [concert poster](http://web.archive.org/web/20150302150143/http:/www.martineelma.com/)  \nMyriad Tilt (I'm sure his favorite) - [What The Kids Said Today book](http://web.archive.org/web/20150302150143/http:/www.percolator.us/images/portfolio/WhatKidsSaid.jpg)  \nMyriad - [One thousand paintings](http://web.archive.org/web/20150302150143/http:/www.onethousandpaintings.com/blog/)\n\n"
    },
    {
      "time": "19 Aug 2008 — 6:14pm",
      "content": "Perhaps the best example of Minion MM on glossy paper is its use over several years in National Geographic magazine. A very nice example of Minion and Minion Expert on heavy paper, showing desirable ink gain (which also makes the face seem less narrow, to its advantage) is in the first American edition of Gitta Sereny's book on Speer. The book shows adept use of all ligatures, small caps, and osf, and is also notable for the designer's decision to turn the kerning off. A detailed description of the many modifications that have been made to the face over the years would be helpful.\n\n"
    },
    {
      "time": "20 Aug 2008 — 6:15am",
      "content": "In Germany, the #1 book with the highest pressrun, namely \"DUDEN Rechtschreibung\", is typeset using a \"changed\" (some would say \"forged\") **Kepler**. The changes are extremely difficult to spot. For a start, look at the regular \"a\" and the italic \"p\". See e.g. the embedded \"changed\" Kepler fonts in this PDF file:\n\n[http://www.duden.de/produkte/downloads/duden01\\_was\\_ist\\_drin.pdf](http://web.archive.org/web/20150302150143/http:/www.duden.de/produkte/downloads/duden01_was_ist_drin.pdf \"http://www.duden.de/produkte/downloads/duden01\\_was\\_ist\\_drin.pdf\")\n\n"
    },
    {
      "time": "20 Aug 2008 — 7:19am",
      "content": "How extraordinary, Uli - - who made the changes, and why? And for an important German book, why on earth didn't they use Walbaum [Standard] or Prillwitz?\n\nKepler MM (Multiple Master) remains remarkable for being the most ambitiously flexible text typeface ever released. It is an entire foundry in one font! The range and depth of the axes is a stunning technical achievement.\n\nUnfortunately, Kepler also illustrates the inadvisability of updating classics when the philosophy seems to have been, 'let's take 75% Walbaum but throw in a couple of distinctive ideas from Baskerville, a couple of inimitable Claude Garamond touches, a bit of Fournier, a bit of Didot' etc. etc. The result is a deracinated aesthetic that is not altogether persuasive.\n\n"
    },
    {
      "time": "20 Aug 2008 — 7:34am",
      "content": "Doesn't Adobe's EULA allow you to modify their fonts for your own use? So Duden has a Kepler license, aren't they within their rights to make these changes for their books (as long as they don't redistribute the fonts)?\n\n"
    },
    {
      "time": "20 Aug 2008 — 8:53am",
      "content": "That was the traditional Adobe attitude, and very sensible it was. Also not attempting to stake intellectual property in metrics. But why assume Duden has a license? Maybe they do ... I hope they do ... they probably do ....\n\nI would expect the fonts to have different names ... as a matter of principle whenever I have modified a typeface I always put in the copyright notice copyright the copyright holder, modifications copyright by me. I don't think Adobe has ever claimed a copyright stake in its customers' modifications, but I can imagine others might. Whatever font copyright is, anyway. The copyright notice in a font is mostly wishful thinking as we know.\n\n"
    },
    {
      "time": "20 Aug 2008 — 9:36am",
      "content": "Well, I would assume that Duden has a license. Of course, I can't verify it, but for a company like them, I would find it unusual to work without proper licenses. Also, has Kepler been bundled with Adobe design software? Like very many Adobe fonts, Duden could have acquired Kepler this way. But I don't know the history of Adobe's bundled packages.\n\n"
    },
    {
      "time": "20 Aug 2008 — 9:56am",
      "content": "\\> I would expect the fonts to have different names\n\nAs a font detective, I noticed at once the prefix \"po\" in the PDF, and I came to the conclusion that it means \"Page One\". If you investigate at this outfit, and you will know who made the \"changed\" fonts.\n\n"
    },
    {
      "time": "20 Aug 2008 — 10:27am",
      "content": "Thank you for the responses so far, keep 'em coming! :)\n\nA.\n\n"
    },
    {
      "time": "20 Aug 2008 — 2:04pm",
      "content": "New Pioneer Co-op uses Cronos in their downloadable PDF flyer. I think their website is [www.newpi.com](http://web.archive.org/web/20150302150143/http:/www.newpi.com/ \"www.newpi.com\")\n\nDavid\n\n"
    },
    {
      "time": "20 Aug 2008 — 3:29pm",
      "content": "Adobe Jenson is used in the newsletter as well.\n\n"
    },
    {
      "time": "20 Aug 2008 — 6:32pm",
      "content": "Don't know if this is any help, but here's a comparison of Minion Pro and Minion I did some time ago, when it first came out. (Minion Pro in black)\n\n ![](http://web.archive.org/web/20150302150143im_/http:/typophile.com/files/Minion%20pro%20vs%20minion_6183.gif)\n\nI think Minion Pro was a decisive improvement, and to me it is intriguing the way the slight thickening of the serifs and joins, and the narrowing and thickening of the 'o'--and other small changes consistent with this--improved the face. I admire the way he kept at it, improving the face in successive iterations.\n\n"
    },
    {
      "time": "24 Aug 2008 — 12:54pm",
      "content": "Thanks a lot friends, keep 'em coming. I can still use a few!\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "24 Aug 2008 — 5:28pm",
      "content": "Minion: [PC Professionell](http://web.archive.org/web/20150302150143/http:/spiekermannpartners.com/clients/project/pc_professionell/en)  \nCronos: [Kraft's salad dressing](http://web.archive.org/web/20150302150143/http:/www2.dupont.com/Packaging/en_US/assets/images/20thawards/kraft_salad_dressing_hi.jpg)\n\n"
    },
    {
      "time": "24 Aug 2008 — 9:59pm",
      "content": "nice thread.\n\nwow. a \"decisive improvement\" ... I either have a lot more to learn ... or I'm lazy ... or, most likely, both.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20150302150143/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "24 Aug 2008 — 10:35pm",
      "content": "Nobody mentioned a book typeset in **Utopia**.\n\nSo, here's is a book typeset in Utopia:\n\nMichael Swan, Practical English Usage, 2nd ed., Oxford 1995, 658 pp.\n\nAs regards **Minion** and **Myriad** , hundreds of STM Books (Scientific, Technical, Medical Books) were typeset by the Springer publishing house\n\n[http://www.springer.com](http://web.archive.org/web/20150302150143/http:/www.springer.com/ \"http://www.springer.com\")\n\nusing \"changed\" versions (others would say \"forged\" versions) of these fonts renamed to SMinion and SMyriad. These fonts are freely downloadable from the internet, although I won't disclose the link (Miss Tiffany wouldn't like it), but it is not difficult to trace the download source for these SMyriad, SMinion fonts.\n\n"
    },
    {
      "time": "26 Aug 2008 — 12:11am",
      "content": "Hey Adam,\n\nI have written a typography book due to be released in october 2008 at Perrousseaux Atelier (the french publisher of Adrian Frutiger) in France, french speaking Europe and Canada, and it was set in Utopia. I might send you a couple of PDF spreads if you are interested. There is also a nice cafe here in Istanbul whose logo is set in Utopia (it's so uncommon I was in awe). I might take a snapshot. Plus, I designed a line of beauty care products in Istanbul some time ago using Cronos, again I can send you some pics.\n\nLet me know,\n\ndr\n\n"
    },
    {
      "time": "26 Aug 2008 — 4:37am",
      "content": "<cite>Beyond Pleasure</cite> by Margaret Iverson, published by Pennsylvania State University Press in 2007, uses Utopia for its text face.\n\n"
    },
    {
      "time": "26 Aug 2008 — 6:45am",
      "content": "\\>or I’m lazy\n\nI should have made clear: there's no way to see whether there's any improvement just from that comparison of the outlines above. But when you see the text in mass, and read it, then you see the improvement.\n\n"
    },
    {
      "time": "27 Aug 2008 — 4:32pm",
      "content": "I don't like Utopia at all, but the redoubtable Kathleen Tinkel found it very useful and always set one of her UNESCO magazines in it. I was going to make the same comment about William's original note - - of course he is right, you have to see the font in mass. Also consider that the old, inferior optical instances of MinionMM have been substantially revised and improved in the OT 'Opticals' series. The overriding weakness of the font for me is the italic - - it seems clumsy set next to the cool, practical elegance of the roman. The overwhelming importance of Minion for me is the degree to which we can tolerate its slight compression. I don't know of any design, other than Times, that does compression so comfortably. And all Times-haters would be are advised to remember that it is Robert's favourite font. By comparison, I find Stone Print just a trifle too compressed, though I think its expanded cousin Cycles is one of the top two or three text faces of the PostScript period.\n\n"
    },
    {
      "time": "27 Aug 2008 — 4:47pm",
      "content": "\\> I don’t know of any design, other than Times, that does compression so comfortably.\n\nMany of Unger's faces are \"by design\" meant to handle compression.  \nSee how well Gulliver for one survives the iron maiden treatment in USA Today.\n\n\\> And all Times-haters would be are advised to remember that it is Robert’s favourite font.\n\nYou're making an assumption there...\n\nhhp\n\n"
    },
    {
      "time": "28 Aug 2008 — 12:13am",
      "content": "[The New Republic](http://web.archive.org/web/20150302150143/http:/www.tnr.com/index.html) uses Warnock.\n\nI just noticed a book called [The Sistine Secrets](http://web.archive.org/web/20150302150143/http:/www.amazon.com/dp/0061469041) which uses Brioso on its cover.\n\n(Kepler, IMO, got a lot of nice, subtle improvements when it was converted from MM to OpenType. Same for Utopia, which also got a whole optical size axis added.)\n\n"
    },
    {
      "time": "29 Aug 2008 — 7:40am",
      "content": "David R,\n\ngo ahead and send me some PDFs to adam at twardoch dot com. Other people's direct submissions in PDF format are also very welcome! For published works, please kindly include some brief colophon in your e-mail if possible.\n\nAdam\n\n"
    },
    {
      "time": "29 Aug 2008 — 8:06am",
      "content": "We published a book in Warnock, you can buy it here:\n\n[http://www.amazon.com/s/ref=nb\\_ss\\_gw?url=search-alias%3Daps&field-keywor...](http://web.archive.org/web/20150302150143/http:/www.amazon.com/s/ref=nb_ss_gw?url=search-alias%3Daps&field-keywords=will+lupens+neighbor&x=0&y=0 \"http://www.amazon.com/s/ref=nb\\_ss\\_gw?url=search-alias%3Daps&field-keywords=will+lupens+neighbor&x=0&y=0\")\n\nWow, the depths one will stoop to to plug a book...\n\nBut really, we can send you high res PDF if it looks at all interesting.\n\n"
    },
    {
      "time": "30 Aug 2008 — 4:29pm",
      "content": "\\>See how well Gulliver for one survives the iron maiden treatment in USA Today.\\<\n\nI don't think it works at all well.\n\n\\>\\> And all Times-haters would be are advised to remember that it is Robert’s favourite font.\n\n\\>You’re making an assumption there...\n\nNo, I'm relaying something he told me often.\n\n"
    },
    {
      "time": "30 Aug 2008 — 4:46pm",
      "content": "\\> I don’t think it works at all well.\n\nWell, Times would have done worse.\n\n\\> No, I’m relaying something he told me often.\n\nThe false assumption is that everybody  \nlikes Slimbach's type design perspective.\n\nBTW, interestingly Evert Bloemsma also had  \nhigh respect for Times. Which is not to say that  \nMorison, Lardent and/or Burgess could ever  \nhave made something as sublime as Legato.\n\nhhp\n\n"
    },
    {
      "time": "31 Aug 2008 — 5:20am",
      "content": "\\>The false assumption is that everybody  \nlikes Slimbach’s type design perspective.\n\nNot at all, Hrant; as far as I know, nobody particularly likes Robert's perspective, but it is inarguably worth investigating. He has great technical skills, and has produced a large body of disparate work, albeit of scant originality. But you could say some of the same things about Goudy. Just because Goudy now seems fussy and dated doesn't mean that he isn't worth thinking about.\n\n\\>BTW, interestingly Evert Bloemsma also had  \nhigh respect for Times. Which is not to say that  \nMorison, Lardent and/or Burgess could ever  \nhave made something as sublime as Legato.\\<\n\nYes, but that's got nothing to do with what Morison was trying to do: he was trying to make a practical typeface that was as compressed (space-saving, green) as possible without offending the reader. In this he succeeded where everyone else has failed except Robert.\n\nTimes wasn't about the sublime, it was about the purely functional, and amply demonstrated Morison's versatility. For Morison truly was interested in the sublime, and directly engendered the printing of more sublime books than any other single figure in the 20th and 21st century combined.\n\nWho was it who said more pragma, less dogma?\n\n"
    },
    {
      "time": "31 Aug 2008 — 7:19am",
      "content": "Bill, my point was that you can like or not like Slimbach's work, but still not subscribe to his valuation of Times. Your (inherited) logic was making a false assumption.\n\nBTW, I think Warnock is very nice.\n\n\\> But you could say some of the same things about Goudy.\n\nWho says everybody likes Goudy? I don't.\n\n\\> he was trying to make a practical typeface\n\n1) So was Evert. And he succeeded. He just wasn't in a position to force-feed it on people. On top of that, Legato is something New, which is extremely rare and helpful.  \n2) Times was fine when it was created (mostly because of ink gain), but it hasn't been fine for a long time. And Times was never sublime. And sublime (which to me has mostly functional and very little stylistic relevance) is a Good Thing.\n\nhhp\n\n"
    },
    {
      "time": "31 Aug 2008 — 7:25am",
      "content": "Actually, I've met a few professional typeface designers who like and respect Times New Roman. For me, I've always enjoyed it in older editions of Encyclopaedia Britannica. I think that they did use it sublimely there.\n\n"
    },
    {
      "time": "31 Aug 2008 — 3:26pm",
      "content": "What an exceptionally good point, Dan. The EB use is indeed marvellous. The arch-subliminator Van Krimpen also chose the font for some of the reference books he designed and you don't get any higher praise than that.\n\n"
    },
    {
      "time": "10 Sep 2008 — 10:18am",
      "content": "[http://www.bodycology.us/](http://web.archive.org/web/20150302150143/http:/www.bodycology.us/ \"http://www.bodycology.us/\")\n\nThis line of products is covered with Minion. In a nice way I think.\n\n"
    },
    {
      "time": "13 Jan 2009 — 2:22pm",
      "content": "Robert Bringhurst's <cite>The Elements of Typographic Style</cite>, version 3.1 (3rd edition, 2004) is set in Minion Pro. (Being new to typography, I feel obligated to admit that I only know this because he says so on page 237. [Being both a neophyte and new to this forum, I jumped at the opportunity to contribute something. So I apologize if this is something that everyone already knows.])\n\nBrian\n\n"
    },
    {
      "time": "14 Jan 2009 — 4:39am",
      "content": "Hi Brian,  \nwelcome to Typophile!\n\nWell, I’m pretty sure Adam (the original poster) knows about that, as he is the [editor of the Polish edition](http://web.archive.org/web/20150302150143/http:/www.twardoch.com/adam/project.php?pid=0082). ;-)\n\n"
    },
    {
      "time": "14 Jan 2009 — 5:41am",
      "content": "Adam, I did some books using some of the fonts (Adobe Garamond, ITC Giovanni, Minion, Myriad, ITC Slimbach, Utopia), but they are not remarkable enough for your purpose, I think ... if you really need more, check my web.  \nprgr\n\n"
    }
  ]
}
