{
  "id": "4858",
  "title": "Argos",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello, here is an alphabet that I'm working on with another student in Offenbach. The design is still in its first stages, so the text that you see is just illustrator vectors, not a working font.   \n   \nA few letters are bothering us in particular; c, f, l, t, and x. As usual any of your comments would be appreciated!   \n   \n ![Argos Sample 1](http://web.archive.org/web/20131012105711im_/http:/www.typophile.com/forums/messages/29/36413.gif)\n\n",
  "author": "dan_reynolds",
  "time": "20 May 2004 — 8:11am",
  "uid": "1085",
  "comments": [
    {
      "time": "21 May 2004 — 3:34pm",
      "content": "Very rune like. fav. character is properly the \"s\"\n\n"
    },
    {
      "time": "22 May 2004 — 10:17am",
      "content": "don't you think j & l are too wide?\n\n"
    },
    {
      "time": "22 May 2004 — 11:03am",
      "content": "Yes, Titus, I do! Do you have a suggestion for the letter \"j\"?   \n   \nBelow is a diagram illustrating some thoughts I have about the letter \"a\". Would it be good to _romanize_ the form? This would allow the presnt \"a\" to be more different in the italic.   \n   \n ![argos a test](http://web.archive.org/web/20131012105711im_/http:/www.typophile.com/forums/messages/29/36567.gif)\n\n"
    },
    {
      "time": "22 May 2004 — 11:30am",
      "content": "i prefer also the second a. but the diagonal seems a bit thick to me.   \nperhaps the j could be just a straight line (readability isn't really a big issue with your font i suppose).\n\n"
    },
    {
      "time": "22 May 2004 — 1:12pm",
      "content": "Ok. I've lightend up the diagonal stroke on the \"a\" and made a straight \"j\". Also in the diagram below, I've illustrated a possible top-terminal change. Good idea?   \n   \n ![j-test argos](http://web.archive.org/web/20131012105711im_/http:/www.typophile.com/forums/messages/29/36570.gif)\n\n"
    },
    {
      "time": "23 May 2004 — 5:50am",
      "content": "i'd say you have to make a basic decision:   \nwether you go in a more \"roman\" direction, or if you decide to make it really funky, then you'd have to make it even more unconventional.   \n   \nhope i could make clear what came to my mind.\n\n"
    }
  ]
}
