{
  "id": "48608",
  "title": "Researching by Doing: an idea for a font",
  "forum": "eliason's blog",
  "tags": [

  ],
  "content": "What existing upright fonts have branches that come out of the bottom of the stems? I’m imagining and sketching letters that have that feature. A better example is the h/n/y here:\n\n ![](http://web.archive.org/web/20081122115607im_/http:/www.typophile.com/files/Picture_5797.gif)\n\nIt’s obviously a handwriting-like cursive feature, but has anybody tried to make a more formal, regular sans with that kind of branching?\n\nI can see the first problem I’d run up against is cloggy spots where the strokes are doubled up. That would involve some serious thinning of the monoline treatment of the rest, or some other solution. Maybe a horizontal spreading of the strokes, as we see in the vertices of capital M’s in some sans that almost look like IVI.\n\n",
  "author": "<a href=\"/web/20081122115607/http://www.typophile.com/user/3254\" title=\"View user profile.\">eliason</a>",
  "time": "<br>",
  "uid": "3254",
  "comments": [
    {
      "time": " 20.Aug.2008 10.19am",
      "content": "Nami, by Frutiger. Mark Simonson did an experiment in formalizing Felt Tip Roman.\n\n"
    },
    {
      "time": " 20.Aug.2008 12.37pm",
      "content": "Craig, does Gerard Unger’s [Flora](http://web.archive.org/web/20081122115607/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns07.html) qualify, even if it’s slightly leaning?\n\n"
    },
    {
      "time": " 20.Aug.2008 12.38pm",
      "content": "Do you mean something like [Roman Script](http://web.archive.org/web/20081122115607/http:/www.fontshop.com/fonts/downloads/elsner_flake/roman_script/)?\n\n"
    },
    {
      "time": " 20.Aug.2008 1.04pm",
      "content": "Yes, Flora is nearly exactly what I had in mind as far as the branching goes. I wonder if the forward-moving “cursivity” of the branching basically requires the italic slope, or if it would work with vertical strokes.\n\n"
    },
    {
      "time": " 20.Aug.2008 3.40pm",
      "content": "Thanks to all of you for the suggestions, btw.\n\n"
    },
    {
      "time": " 22.Aug.2008 10.24am",
      "content": "Craig: I think you could make it work without the slope too, in a novelty face. Did you already sketch anything? (I did, but then threw it away)\n\n"
    },
    {
      "time": " 22.Aug.2008 10.45am",
      "content": "I’ve been sketching but haven’t gotten to scanning any of it yet. I have aspirations of making something more useful than a “novelty face.” (But maybe that’s how most novelty faces start! :-) )\n\n"
    },
    {
      "time": " 23.Aug.2008 2.37am",
      "content": "I look forward to seeing what you come up with. I didn’t mean the “novelty” to be an overly negative remark, sorry. I’m just not sure this particular solution would make it for an effective text typeface but I’d be happy to be wrong: in fact, that would be a very original solution, if you could make it work. Good luck!\n\n"
    },
    {
      "time": " 28.Aug.2008 4.38am",
      "content": "Craig: Mark Simonson’s [Sharktooth](http://web.archive.org/web/20081122115607/http:/www.ms-studio.com/FontSales/sharktooth.html) also falls in this category and maybe it’s the experiment Carl was referring to.\n\n"
    },
    {
      "time": " 28.Aug.2008 10.35am",
      "content": "I’ll bet you’re right, Antonio. I’ll follow up with Mark.\n\n"
    },
    {
      "time": " 5.Sep.2008 6.42am",
      "content": "To add another answer to my own question, looks like [Eaglefeather Informal](http://web.archive.org/web/20081122115607/http:/www.myfonts.com/fonts/p22/eaglefeather/informal/) has this branching, and is upright. (Actually it’s one of many “architectural” scripts that have this, but its lowercase is closer to the formalized font I’m envisioning that others.)\n\n"
    }
  ]
}
