{
  "id": "48624",
  "title": "New to Typophile",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone, I am new here and I just wanted to say hello.  \nI look forward to getting to know my way around the site and I hope i will get to know some of you soon.\n\nI suppose I will introduce myself.  \nMy name is Cody, I am 20 years old and I am a design student at Collins College in Tempe. I am not a great typographer or a great designer yet, but I am getting better, so if you have any critique don't hesitate to say it. :)\n\nOther than that I'm not quite sure what to say, other than that I look forward to getting to getting to know you guys.\n\n",
  "author": "Cody",
  "time": "20 Aug 2008 — 4:50pm",
  "uid": "35752",
  "comments": [
    {
      "time": "20 Aug 2008 — 5:00pm",
      "content": "Hello and welcome to Typophile!\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "20 Aug 2008 — 5:41pm",
      "content": "Welcome!  \nDon't be shy about making links (see \"More information about formatting options\") and posting image files to illustrate a point. (Use the \"insert image\" link below the comment box. JPEG or PNG. With PNG you can post layered images with no background that \"show\" the grey typophile background. Max width 590 pixels to avoid scrollbar.)\n\n"
    },
    {
      "time": "20 Aug 2008 — 7:52pm",
      "content": "Hey Cody, welcome to Typophile! :)\n\n"
    },
    {
      "time": "21 Aug 2008 — 1:05am",
      "content": "Welcome!\n\n"
    },
    {
      "time": "21 Aug 2008 — 1:09am",
      "content": "Hey man, welcome, have a nice time and don't take it all too seriously when reading harsh comments (it happens sometimes, even by myself).\n\nEnjoy,  \ndr\n\n"
    },
    {
      "time": "21 Aug 2008 — 1:31am",
      "content": "Welcome to Typophile, you've just joined a community with a great bunch of people, and a limitless knowledge of type between them.\n\nTake Care\n\nAndy\n\n"
    },
    {
      "time": "21 Aug 2008 — 2:48am",
      "content": "\\> you’ve just joined a community with a great bunch of people,  \nand a limitless knowledge of type between them.\n\n...and between them Goldfish + KingFishers too?!  \nWelcome with Flowers\n\n"
    },
    {
      "time": "21 Aug 2008 — 9:23am",
      "content": "Thank you all for the welcome! It is nice to meet you all.  \nI am glad to see that Typophile has such a nice population. Everyone here seems very courteous and willing to help each other.  \nPerhaps soon I will ask for critique and advice on a few of my designs and try to help others when I can.  \nThis seems like a very nice site and I think I will like it here.\n\nThank you all again for the welcome and the advice, I will be sure to make use of it.\n\n"
    },
    {
      "time": "22 Aug 2008 — 10:01am",
      "content": "Hey Codyyyyyyy!  \n:P\n\n"
    },
    {
      "time": "24 Aug 2008 — 11:36am",
      "content": "Hello!\n\n\\> Everyone here seems very courteous\n\nAlthough some of us don't let that translate to a deceptive silence. In any case, nobody here engages in cloying, Flickr-style \"Great color and composition! I so LOOOOOOOOOOOOOOOOOOOOOOOOOOOOOVE IT!!!!\" crap, which is incredibly refreshing.\n\nhhp\n\n"
    },
    {
      "time": "24 Aug 2008 — 1:26pm",
      "content": "like..... I looooooooooooooooooooooove your comment Hrant! You are like soooo right! ROTFL OMG LOL!\n\nmikey :-)\n\n"
    },
    {
      "time": "24 Aug 2008 — 1:47pm",
      "content": "Me to i love your icon Rhant its realy cute!!!!!! Nice colors\n\n;)\n\nWelcome Cody.\n\n"
    },
    {
      "time": "24 Aug 2008 — 10:39pm",
      "content": "Hah. Hah. Hah.\n\nhhp\n\n"
    }
  ]
}
