{
  "id": "48651",
  "title": "High-End Spa Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi everyone,\n\nit’s been a while I’ve been on this site, but I need your help.\n\nThe following is my logo for a High-end Spa - (french for the word ’calm’). I’m using a handwritten font from the Sudtipos Mister/Mrs pack. I basically added a stroke and adjusted the kerning between the L and the M.\n\nThe target market is women from old money, who don’t work and can get facial treatments during the day.\n\nThe interior of the spa has many patterns with low contrast. Almost everything has pattern, so the applications I will be using (menu, business card, etc) will mostly have patterns.\n\nI need to keep the font in the same general direction since I’ve presented and the client approved. I cannot scrap the direction, but I just feel something is missing right now....\n\n———————-\n\nI wanted to know:\n\n1- Do you enjoy the logo overall?  \n2- Is there a font you may suggest other than the one used? Something similar.  \n3- Any other suggestions?\n\nThanks, it’s much appeciated!\n\n———————\n\n\\*Note: I tried a couple of more samples with some Caps throughout the logo. I like the top-right sample, but I can’t justify using a capital L.\n\n| Attachment | Size |\n| --- | --- |\n| [calme.jpg](http://web.archive.org/web/20081122114905/http:/typophile.com/files/calme.jpg) | 19.12 KB |\n| [newsample.jpg](http://web.archive.org/web/20081122114905/http:/typophile.com/files/newsample_0.jpg) | 99.39 KB |\n\n [‹ Trying to remake a logo, stuck on HELVETICA?](http://web.archive.org/web/20081122114905/http:/www.typophile.com/node/48813 \"Go to previous forum topic\") [Logo critique please! ›](http://web.archive.org/web/20081122114905/http:/www.typophile.com/node/49012 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122114905/http://www.typophile.com/user/8209\" title=\"View user profile.\">DaveG</a>",
  "time": "<br>",
  "uid": "8209",
  "comments": [
    {
      "time": " 21.Aug.2008 1.07pm",
      "content": "It’s not awful, but the added stroke doesn’t work that well with all the letters. With such a short word, why don’t you grab a pencil and a piece of paper and start sketching?\n\n"
    },
    {
      "time": " 21.Aug.2008 2.43pm",
      "content": "I like the first one you have there, but it’s a bit plain to me for something so elegant. I love simplicity, but the handwriting is a bit too clumsy I think. Here are a few variants in Burgues Script . . . also by Sudtipos. There are a ton of different swashes and open type options you can play around with.\n\n ![](http://web.archive.org/web/20081122114905im_/http:/www.typophile.com/files/calme_01_5654.png)\n\npenn\n\n"
    },
    {
      "time": " 21.Aug.2008 3.19pm",
      "content": "I like the first one you posted quite a bit.\n\nSharon\n\n"
    },
    {
      "time": " 21.Aug.2008 3.28pm",
      "content": "I’m with Sharon. Calme reads “calm” which in turn means “calm”. No, I’m not trying to be a smarty-pants. Being calm is not necessarily about swooshing around in all different directions. No?\n\n"
    },
    {
      "time": " 21.Aug.2008 4.52pm",
      "content": "no ... it’s not.\n\nI also like the first one ... but it really needs to be put in context of the environment and identity/styling too.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081122114905/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 21.Aug.2008 5.17pm",
      "content": "I’m happy to hear most like my original concept. I’ve really considered what each of you have suggested.\n\nI tried a different one here. It’s a bit less plain, with a bit of a swash to it... do you still read ’calme’? The last thing I want people to read is ’came’ (sounds so bad)\n\n ![](http://web.archive.org/web/20081122114905im_/http:/www.typophile.com/files/Untitled-4_6620.jpg)\n\n"
    },
    {
      "time": " 21.Aug.2008 5.18pm",
      "content": "Just for the fun of it, I tried this new one on a sign application (photoshop). Whatcha think?\n\nDoes it read ’came’ or ’calme’?\n\n ![](http://web.archive.org/web/20081122114905im_/http:/www.typophile.com/files/calme_sample_4909.jpg)\n\n"
    },
    {
      "time": " 21.Aug.2008 5.21pm",
      "content": "On this last one, I’m reading the ’l’ as an ’f’. You might try going back to your original concept. It seems the most clean and concise. I would maybe try a thinner font as well. Maybe something like this:\n\n ![](http://web.archive.org/web/20081122114905im_/http:/www.typophile.com/files/calme_4042.jpg)\n\nThe font is Lucy Script and is probably one of my favorite script fonts on the market.\n\nLove the rich brown though. Very nice.\n\n"
    },
    {
      "time": " 21.Aug.2008 5.27pm",
      "content": "Well the original font is much thinner, I just added a stroke. Maybe its a bit too chubby at the moment, so I might reduce the thickness. I’m just worried that the logo might get drowned in that deep brown, or look bad on signage applications. I’m not a fan when they’re TOO thin.\n\n"
    },
    {
      "time": " 21.Aug.2008 5.42pm",
      "content": "I don’t think you’ll have to worry about losing it. The stark white on the brown background will be easy enough to read. Just keep good contrast in all of your applications of the logo. I probably wouldn’t create one that is brown on white unless it’s to be printed large (like in the instance of your sign). But for black and white publications such as newspapers where they don’t run color ads, make a nice black on white version.\n\nAlso, be careful in newsprint situations that your logo doesn’t fill in when they ink it. Sometimes thin or calligraphic/script fonts tend to fill in and you definitely don’t want that.\n\nIt’s getting there and is sure to be a beautiful treatment none the less.\n\n"
    },
    {
      "time": " 21.Aug.2008 5.46pm",
      "content": "The problem with the last version is that the word “came” jumps out first. Only because I know it says “calme” do I read it correctly.\n\n"
    },
    {
      "time": " 21.Aug.2008 6.12pm",
      "content": "I got ’came’ in the latest version, wasn’t sure what the thing in the middle was til i went back and read the comments - the script flows from the a to the m, the L looks like it was just chucked in....and even then i thought it was a P anyway.\n\nTo me, the very first one reads the best but i’m not 100% convinced about the relationship between the l and the m. Something about it doesn’t sit quite right. At first i didn’t like the capital E on the end but its kinda quirky and interesting too and its growing on me. I also think it would be interesting to have a bit more variation in the stroke widths - thinner but just in places, more contrast.\n\n"
    },
    {
      "time": " 21.Aug.2008 6.44pm",
      "content": "it’s also pretty bold/strong for something that’s meant to represent calmness IMO - and agree about original.\n\n—————  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20081122114905/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": " 21.Aug.2008 8.35pm",
      "content": "I also prefer the original. You know how designers sometimes will stack initials in a logo (example: New York Yankees)? Well, I read your latest as “came L” or “L came”.\n\n"
    },
    {
      "time": " 21.Aug.2008 10.44pm",
      "content": "I do like the toning of the first one. I also like to feel. But it has something of café to me. Do they do coffee-wrappings over there? ;-)\n\n"
    },
    {
      "time": " 22.Aug.2008 11.17pm",
      "content": "I read “cajme” in some of the latest ones.\n\n- Lex\n\n"
    },
    {
      "time": " 23.Aug.2008 1.52am",
      "content": "It’s totally cafè. Basically it’s screaming cafè.\n\n[http://www.ti-la.de/logos/mccafe.jpg](http://web.archive.org/web/20081122114905/http:/www.ti-la.de/logos/mccafe.jpg \"http://www.ti-la.de/logos/mccafe.jpg\")\n\n"
    },
    {
      "time": " 23.Aug.2008 6.12am",
      "content": "I like the very first one except for the break between the l and the m, which disturbs the smooth flow, especially the way the l drops down.\n\nI like mattjohns Lucy Script interpretation too. I think if you could get your original one to flow in a single pen line like that and take note of the better thick and thin contrast there yours will be perfect. At the moment your m could in fact be any combination of u, n and an undotted i.\n\n"
    },
    {
      "time": " 23.Aug.2008 7.03am",
      "content": "what about some gorgeous, luscious serif? very plain and quiet?\n\ni think scripts are used too often for this sort of thing. think of the hermes logo and the channel logo, there’s nothing fancy about them. though, it might be a harder sell it is more appropriate.\n\nwe’re not talking bling with these ladies, subdued....\n\n"
    },
    {
      "time": " 23.Aug.2008 7.51am",
      "content": "i think this is gorgeous, i like the fixed width of the line, i wish we had more things like this in hebrew, it is classic in a way, and interesting. i’m getting sick of the simple use of sans serif caps as symboling something “lucrative”.  \nbut - as people said - i’m not sure how much this countour symphony is really calm.  \nit is beautiful and sweet to let go, but the question is how right it is.\n\nhowever i think that you really came with an interesting style, maybe you can calm it a bit more. try spacing, prolonged contours, fixed “motion”.\n\n"
    },
    {
      "time": " 23.Aug.2008 9.22am",
      "content": "I like the first version, albeit the “e” is bugging me. Does lowercase “e” do the trick?\n\nAlso, it’s smoothness is great. Maybe the “l” is getting too relevant. Did you try to write it yourself? In your own calligraphy? Maybe it would look more personal, intimately informal.\n\nCheers!\n\n"
    },
    {
      "time": " 24.Aug.2008 2.23pm",
      "content": "the first one is lovely.. i wouldn’t over fuss it.\n\nre: the cafe comments - its all in the application and the situation you come across it in.. i don’t buy the cafe link at all.\n\ni think it really really rocks.. nice one\n\nJ\n\n"
    },
    {
      "time": " 25.Aug.2008 10.21am",
      "content": "Thanks everyone, it feels great to hear positive feed back on the original.\n\nI love everyone’s comments. I’ll be sticking with the original concept but just tweaking it a little, with your suggestions.\n\n————————\n\nJustin\\_Ch: I think you have a point, I will try having a continuous flow. I find it SO hard to keep it consistent when creating your own element in a font.\n\nNancy: I proposed some sexy serifs to the client, but I need to stick to this concept at the moment. Or something quite similar.\n\nYaronimus-Maximus: Caps Sans is very overdone, I agree (especially extended à la Marc Jacobs).\n\nLula: People tell me the ’e’ makes the logo unique. Also, I tried creating my own lowercase e, but I found it very difficult to have it integrate properly. I will try this again, either way.\n\ntyp01134: Thanks! :D\n\n————————\n\nAgain, I really really appreciate the comments. I work alone all day, so its really refreshing to hear some designer comments, rather than client criticism all day! hehe! :)\n\n"
    },
    {
      "time": " 25.Aug.2008 5.36pm",
      "content": "Nice job Dave.\n\nLove the first one. Even with the stroke. Maybe thin in a tiny bit but I like the extra weight to it. I think the key to this one is in your application in it’s variety of uses.\n\nJay\n\n"
    },
    {
      "time": " 7.Sep.2008 2.25pm",
      "content": "I discover the depths of the English language further & further...\n\n“The target market is women from old money, who don’t work”\n\n"
    },
    {
      "time": " 7.Sep.2008 5.32pm",
      "content": "heh\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081122114905/http:/www.solid-creative.com/identity.htm)\n\n"
    }
  ]
}
