{
  "id": "48666",
  "title": "Type in Illustrator CS3- how to stretch it",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi, I am new to CS3 illustrator. In my old mac/old illustrator, I used to be able to put a box around it to nudge it around and stretch it a bit if needed. I cannot figure out how to do this. Thanks for your help, (I need step by step. Its amazing what you can forget in 2 years).\n\n",
  "author": "westcoastartist",
  "time": "21 Aug 2008 — 3:37pm",
  "uid": "35679",
  "comments": [
    {
      "time": "21 Aug 2008 — 3:49pm",
      "content": "by the way, I'm not a type stretcher! (I hate that..) but need to nudge it once in a while. Today, I wish I never gave away my old computer set up and programs on craiglist... A manual did not come with CS3.\n\nAny help appreciated.\n\n"
    },
    {
      "time": "21 Aug 2008 — 4:23pm",
      "content": ""
    },
    {
      "time": "21 Aug 2008 — 4:22pm",
      "content": "you may just be using the wrong tool. If you select the type using the select tool (its the tool that looks like the black arrow, the shortcut is V) it should bring up a box with transform handles which you can click and drag as needed.\n\n"
    },
    {
      "time": "21 Aug 2008 — 4:24pm",
      "content": "Oops, i didn't mean to post twice ^^;\n\n"
    },
    {
      "time": "22 Aug 2008 — 11:32am",
      "content": "Hi, No, I tried that. It just selects it for moving. It does not put the box with little handles on it....\n\nAnybody know how to do this on Illustrator CS3?  \nthanks.\n\n"
    },
    {
      "time": "22 Aug 2008 — 12:02pm",
      "content": "i don't have cs3, but you should look for\n\nView \\> Show Bounding Box\n\nor search Help for Bounding Box\n\n"
    },
    {
      "time": "22 Aug 2008 — 12:26pm",
      "content": "Beware the ugly effect of over-streched type though!\n\n"
    },
    {
      "time": "22 Aug 2008 — 1:10pm",
      "content": "Thanks for comments. this forum is saving my sanity. I found what I needed.  \nIt is the \"Free Transform\" Tool under the scaling tool on palette. It gives me that box I need.\n\nI agree with stretching. I have always maximally hated it, it looks totally amateur. It's so offensive to me it makes my lower digits cringe. I understand about lettering and type, and it is a high aesthetic indeed, thats why I'm excited to find this forum! Type people like me!\n\n"
    }
  ]
}
