{
  "id": "4867",
  "title": "Type marketing, modifying fonts. Lineto",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "When it comes to marketing and selling type I think the typeheads at Norm/Lineto have done a brilliant job. I check their site once in a while and recently came across the posting about the new exclusive Simple Airport (modified Simple) typeface they designed for the Koln airport.   \nFirst they sold Simple as a mono in 5 weight, each 180 Ch francs   \nan great design but not very usable in a lot of applications. Then they re-designed and licensed it as a standardized Sans to a client. To top this they sell a small booklet about the re-design of Simple for 20 Ch francs. Is this type marketing at it's finest or what.   \nI am wondering what other foundries/designers have done similar types of marketing strategies, showcase their wares in a retail environment (e-commerce) as a mono or incomplete family and then rework it for a client.   \n ![](http://web.archive.org/web/20061130180525im_/http:/www.typophile.com/forums/messages/30/36470.jpg)   \n   \nOn a similar note what happens when a designer (or design firm) gets a job where a commercial font that is choosen for the job needs to be modified or re-designed, and the client wants a copy of this modified font (I have seen this done years ago with DIN for instance by some german design firm). In the case where the firm desires to do work inhouse instead of contracting the original font designer do it. I know vector outlines are usually   \ntrade marked so what happens? It would obviously be very time   \nconsuming to redesign from scratch just because the client desires a different lc \"g\" and perhaps a bolder weight, or perhaps tabular numerals (that were not available) but likes the font otherwise. Any comment would be appreciated. Perhaps this should have been several treads as there is several issues.\n\n",
  "author": "<a href=\"user/804\" title=\"View user profile.\">designalchemy</a>",
  "time": "<br>",
  "uid": "804",
  "comments": [

  ]
}
