{
  "id": "48678",
  "title": "Dez Boulder goes Pale starting a family",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I have been pushing the extremes of Boulder to creates interpolation styles. Here is Dez Boulder superego Hairline to start off.\n\nChrisL\n\n ![](http://web.archive.org/web/20130819234025im_/http:/typophile.com/files/Hairline_4077.png)\n\n",
  "author": "dezcom",
  "time": "21 Aug 2008 — 9:32pm",
  "uid": "3135",
  "comments": [
    {
      "time": "22 Aug 2008 — 9:31am",
      "content": "As usual, good looking font, Chris.\n\nIs your r (and to some extent t and f) overkerned?\n\nIf your x is going to have fluid arms, then shouldn't the v, w, y and z too? I guess what I'm really saying is I think the x should be straight. I notice now that the y is slightly curvy. Hmmmm. Love to see a pdf.\n\nN\n\n"
    },
    {
      "time": "22 Aug 2008 — 10:18am",
      "content": "Nick,  \nThe y, v, w, x, and k all have some curve to them. The x perhaps a bit more than the k. Part of this is setting up for the MM extremes for interpolation. After I do some of the between weights, I may have to revisit the x a bit.  \nThe kerning is not there quite yet.\n\nThanks for your help, Nick! I will post a PDF soon.\n\nChrisL\n\n"
    },
    {
      "time": "22 Aug 2008 — 3:08pm",
      "content": "I feel in lightening the font, the rhythm of widths may have gone a bit off. For example, the 'a' feels to me too wide, and maybe the e. I guess there's always a question, whether you go more for preserving the shapes of the counters, or the outside.\n\n"
    },
    {
      "time": "22 Aug 2008 — 3:43pm",
      "content": "Bill,  \nI took a midline when choosing the shape. The \"a\" may be a tad wide at larger sizes but is better smaller. The proportions are not humanist, I admit so \"a\" will seem wider than typical humanist faces. I always worry about the counters of a and e getting clogged and dark so feel better about making them open. This helps in interpolation but I may have to go back and adjust the hairline weight \"a\" afterward.\n\nChrisL\n\n"
    }
  ]
}
