{
  "id": "48675",
  "title": "$3000 scanners?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I used this machine the other day:\n\n[http://www.epson.com/cgi-bin/Store/consumer/consDetail.jsp?BV\\_UseBVCooki...](http://web.archive.org/web/20131018104823/http:/www.epson.com/cgi-bin/Store/consumer/consDetail.jsp?BV_UseBVCookie=yes&infoType=Specs&oid=47915743&category=Products \"http://www.epson.com/cgi-bin/Store/consumer/consDetail.jsp?BV\\_UseBVCookie=yes&infoType=Specs&oid=47915743&category=Products\")\n\nIts huge and fast and is a solid piece of plastic,\n\nbut are they any real advantages to the average graphic designer besides its size?\n\nI just want to know why anyone would buy it for $3000 rather than a nice one for $200.\n\n",
  "author": "fredcastle",
  "time": "21 Aug 2008 — 8:47pm",
  "uid": "17767",
  "comments": [
    {
      "time": "21 Aug 2008 — 9:35pm",
      "content": "I have a cheap Epson scanner I picked up from the refurbished section of Epson.com for less than $100, and the scans it outputs are almost indistinguishable from the high-end Epson and Microtek scanners that I’ve used. The average designer is printing work at no more than 300 lpi, so what’s the advantage of a high-end scanner? A scanner like that might matter if you’re archiving important photos or doing high-quality enlarging. If something really incredible needs scanning you can always just have the printer do it on a drum scanner that will blows away a flatbed and just charge it to the client. And 11\"x17\" scanning is nice to have if you do a lot of drawing, but that can be had for $1500.\n\n"
    },
    {
      "time": "22 Aug 2008 — 4:39am",
      "content": "I think James has it about right. It all depends on the work you are doing.\n\nOne thing about the higher-priced scanners is you can scan in the 16-bit mode. There is a lot of detail, esp. shadow detail, that can be recovered from most photographs, but this requires some heavy manipulation of the image -- severe compression, then re-expansion, similar to HDR compression techniques. Working in the 16-bit mode pretty much eliminates posterization as an issue. Sample down to 8-bit as a last step.\n\n"
    },
    {
      "time": "23 Aug 2008 — 7:34am",
      "content": "<cite>I have a cheap Epson scanner I picked up from the refurbished section of Epson.com for less than $100, and the scans it outputs are almost indistinguishable from the high-end Epson and Microtek scanners that I’ve used.</cite>\n\nBut I would imagine that all of those scans pale in comparison with a scan done on a professional drum scanner from Scitex or Hell. But then most of the great color separation houses have been put out of business by the \"crappy scan, do-it-yourself, I'm not paying money for that\" crowd.\n\nThe race to the bottom continues.\n\nJames\n\n"
    },
    {
      "time": "23 Aug 2008 — 12:37pm",
      "content": "I would, if I could afford it. After having used crappy scanners for the last year (after mine regrettably stopped working), I am positively in withdrawl. There is nothing compared to the depth of shading and color that you get with a higher end scanner. Especially since I scan subtle sketches, marker and watercolor renderings, there is such a difference.\n\n"
    },
    {
      "time": "23 Aug 2008 — 2:11pm",
      "content": "I guess it mostly comes down to...\"I Wish\". Honestly, if I could easily afford it, I'd get it. It's no doubt your scans will come out beautiful, especially in comparison to the $200 scanners most common people own. BUT...most of us can't afford it...so to us, they are just pretty to look at, hoping one day we work for someone that will let us play with it.\n\ncourtney\n\n"
    }
  ]
}
