{
  "id": "48706",
  "title": "\"funky splatter text all skewed\" said the client",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i'm designing the back of a postcard for a tech client's IBC tradeshow party in Amsterdam.  \nAfter sending the layout, which is sophisticated and euro simple she asked for -\n\n\"funky splatter text and all skewed\"\n\nand she said it 2x, so she's adamant.\n\ndoes any typeface like that or look and feel come to mind?\n\nthat's still sophisticated and euro?\n\nthe copy is something like this so you get a sense of how much to make splattery and skewed.\n\nVIP Party at IBC 2008\n\nSaturday 17 September  \n21:00hr – 1:00hr\n\nAt Cobra Cafe BV  \nRjiks Museum Square  \nHobbemastraat 1  \nMuseumplein, Amsterdam  \n+ 31 (0) 20 47 00 11\n\nurgh,  \nthanks,  \nliz\n\n",
  "author": "lizthiem",
  "time": "22 Aug 2008 — 2:59pm",
  "uid": "26270",
  "comments": [
    {
      "time": "22 Aug 2008 — 3:21pm",
      "content": "Write it on rough newsprint using a steel-nib pen and sumi ink at double or triple size. Scan it, use levels to kill the newsprint color, and you’re all set.\n\n"
    },
    {
      "time": "22 Aug 2008 — 3:47pm",
      "content": "A good compromise might be to skew the text, but keep it clean, and add a texture overlay in front and behind it. Sounds like she wants it to look \"exciting\" wooooo.\n\n"
    },
    {
      "time": "22 Aug 2008 — 4:44pm",
      "content": "[Reactor Degrading](http://web.archive.org/web/20150416060858/http:/www.fontshop.com/fonts/singles/font_bureau/reactor_degrading/)\n\n\"First drawn in 1993 by Tobias Frere-Jones for Neville Brody’s Fuse magazine, Reactor FB combines abraded forms with Tesla’s theory of destruction through accumulating rhythmic points of noise. The “Derelict” style offers choices of eroding framework for each character. In Degrading, each letter flings soot and smut at its stark neighbors until accumulating flecks build up a roaring vibration that can overwhelm the outlines; FB 1996\"\n\n"
    },
    {
      "time": "22 Aug 2008 — 5:15pm",
      "content": "Sophisticated and euro? Sounds like [\"Helvetica\"](http://web.archive.org/web/20150416060858/http:/www.phatfonts.net/pp_font.asp?Font_ID=125)\n\n"
    },
    {
      "time": "22 Aug 2008 — 10:27pm",
      "content": "thanks guys!  \ni combined all of your thoughts and ended up with 2 options, as we providers like to do. one helvetica cy light - skewed it with different gradations of grey and the other one, i handwrote / scanned and placed some funky line drawings in there and played with curves. client seems very excited. thanks for your thoughts.\n\n"
    },
    {
      "time": "28 Aug 2008 — 10:36am",
      "content": "\"Sophisticated and euro? Sounds like “Helvetica”\"\n\nlolz\n\n"
    },
    {
      "time": "31 Aug 2008 — 3:04pm",
      "content": "when i read stuff like this, i am so happy i am out of the design biz...\n\n"
    }
  ]
}
