{
  "id": "48712",
  "title": "What is this type effect called?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there,\n\nThis is a very simple question but it is one of those mental blocks that is driving me crazy. What is this type effect called? Is it just considered a kind of drop shadow? Also is there a quick way to make it in Photoshop?\n\nThanks very much!\n\n ![](http://web.archive.org/web/20140806123855im_/http:/typophile.com/files/flow_logo_large_6407.png)\n\n",
  "author": "sven s",
  "time": "22 Aug 2008 — 7:15pm",
  "uid": "18637",
  "comments": [
    {
      "time": "23 Aug 2008 — 3:32am",
      "content": "It is an old sign painter or poster artist trick. A reproduction of a late 19th Century British signwriting book of mine calls any effects to give the letters an appearance of thickness \"raising\". Shadow effects are \"shading\". I don't know about a special name for this look where the original letter face is removed.\n\nI'm not sure about Photoshop but in Illustrator I would use the Extrude & Bevel effect. Expand that to be flat paths & then use Pathfinder to knock out the original letters.\n\n"
    },
    {
      "time": "23 Aug 2008 — 6:31am",
      "content": "with the \"extrude\" on Illustrator you can make that effect on the letters with no problem. You can then expand the effect and edit the colours as you wish OR you can define on the extrude options a pure hard shadow.\n\n-\n\n[www.nunocoelho.com](http://web.archive.org/web/20140806123855/http:/www.nunocoelho.com/ \"www.nunocoelho.com\")\n\n"
    },
    {
      "time": "23 Aug 2008 — 3:43pm",
      "content": "excellent, thanks very much.\n\n"
    },
    {
      "time": "26 Aug 2008 — 10:58pm",
      "content": "Hello again,\n\nSo after playing around with the Extrude & Bevel in Illustrator CS3 I don't believe this is what I'm looking for.\n\nExtrude has two problems that I ran into:\n\n1) it seems to only be able to give you a 3D effect (Freeza is probably explaining a solution to this when he says \"define on the extrude options a pure hard shadow\" but I wasn't able to do this. I could remove the shading but I could not change the color of the extruded portion)\n\n2) it shifts the access of the type. in the picture \"FLOW\" is completely unaffected, but with Extrude I could never create a 45 degree angle shadow effect without rotating the type some amount.\n\nSorry if I'm not understanding you're instructions.\n\nI see this effect absolutely everywhere so it seems like it must be easy to do (I even saw it on an add on typophile just the other day). Anybody have any other hints?\n\nThanks again,  \nSven\n\n"
    },
    {
      "time": "27 Aug 2008 — 12:38am",
      "content": "I am more of a Photoshop user than Illustrator, so that's the method I wound up sussing out for this. It's a very easy process that only takes a minute, although it doesn't nail what you want 100%.\n\nBasically, you just make a type layer, with the color of the text the same as the color of the background. Then click the \"Add a Layer Style\" button on that layer (the little fx button), and select Drop Shadow. Set the angle to be the drop you want (around 45 deg.), set Opacity to 100%, bring the Spread up to 100%, make the size what you want it at (I used 7px), and then change the distance so that all of the shadow is on the bottom-left of the image (it will tend to peek out of the other edges because of the larger Size) - I went with 11px for this example.\n\nThis method does seem to create some roundness in the drop, unfortunately. It seems like it would be a matter of a few minutes to just manually straighten those edges, so long as this is just for a logo or two. But I suspect there might be a 3rd-party drop-shadow plugin that allows for that roundness to go away. I'll keep playing.\n\nOne love.\n\n ![](http://web.archive.org/web/20140806123855im_/http:/typophile.com/files/svenSample_5740.png)\n\n"
    },
    {
      "time": "27 Aug 2008 — 12:45am",
      "content": "Hmm, I see now that what I've done is not what you are going for. I'll have to keep looking at this.\n\n"
    },
    {
      "time": "27 Aug 2008 — 6:41am",
      "content": "Here's a way to achieve the effect in Illustrator (somewhat complicated, but works pretty well and the result is scalable without quality issues):\n\n1. Select the text (or object), copy it (CMD+C), lock the original object (CMD+2), paste a copy behind the locked object (CMD+B) and make it black\n\n2. ALT+Drag the pasted object away (in your case that would be down to the left), copying it\n\n3. Select both copies of the original objects, give them and choose from the top menu Object \\> Blend \\> Make (CMD+ALT+B)\n\n4. From the same palette, choose 'Blend options...'. A new options palette will appear; select the 'Specified distance' option instead of the preset 'Specified steps'. Lower the distance until the individual blend steps aren't recognizable as such anymore.\n\n5. Unlock the original object (CMD+ALT+2) and group it with the blend if you plan to move it around.\n\nYou can come up with some interesting effects with this method.  \nHere's a nice tutorial:\n\n[http://www.bittbox.com/illustrator/fun-with-illustrators-blend-tool/](http://web.archive.org/web/20140806123855/http:/www.bittbox.com/illustrator/fun-with-illustrators-blend-tool/ \"http://www.bittbox.com/illustrator/fun-with-illustrators-blend-tool/\")\n\n"
    },
    {
      "time": "27 Aug 2008 — 1:05pm",
      "content": "With the extrude you have diferent type of perspectives to choose from, and besides you have a \"more options\" button to control the shadow. anyway, you can always do it manually, after all its simple geometry :D\n\n-\n\n[www.nunocoelho.com](http://web.archive.org/web/20140806123855/http:/www.nunocoelho.com/ \"www.nunocoelho.com\")\n\n"
    },
    {
      "time": "28 Aug 2008 — 2:15am",
      "content": "Here's a very simple and accurate way to achieve this effect in illustrator...\n\n ![](http://web.archive.org/web/20140806123855im_/http:/typophile.com/files/3dtext_3487.png)\n\nInstructions:\n\nMake two identical copies of the graphic you'd like the effect applied to.\n\nIf desired give a different color to the main part (top copy) and the 3d part (bottom copy)\n\nNow with only the bottom copy selected, click: Effect \\> Distort and Transform \\> Transform\n\nUse settings similar to this...\n\n ![](http://web.archive.org/web/20140806123855im_/http:/typophile.com/files/3dsettings_5568.png)\n\n\\*If you want to make something like this in photoshop you could record an action of moving a layer repeatedly 1px diagonally.\n\n"
    },
    {
      "time": "28 Aug 2008 — 3:19am",
      "content": "we had a similar thread three or four years ago — the 'blend-tool' solution, or the 'multiple-copies' solution came up in that thread, iirc. Back then, I posted something similar to this as another possible method.\n\n1. Copy and paste into desired position.  \n2. Pathfinder/Unite, then use Delete Anchor PointTool on each letter (the points indicated by the black circles.)  \n3. Paste a final layer on top and set to white.\n\n ![](http://web.archive.org/web/20140806123855im_/http:/typophile.com/files/help_6172.jpg)\n\nWith rounds, you have to do some extra work with the pen tool. Or you can use Z's method.\n\n"
    },
    {
      "time": "28 Aug 2008 — 7:03am",
      "content": "Seems pretty simple even without breaking out the fancy-schmancy graphics apps... WordArt anyone? [ducks for cover... LOL]\n\n ![](http://web.archive.org/web/20140806123855im_/http:/typophile.com/files/image002_5227.png)\n\n(admittedly I couldn't see a way to lose the text outline)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "29 Aug 2008 — 1:15pm",
      "content": "zevbiz's method worked great, thanks for the help.\n\n"
    }
  ]
}
