{
  "id": "48736",
  "title": "Automating Type Design Processes",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Prior to the my talk about the (possible) automation of type design processes at the coming ATypI TypeTech Forum (FM Track) in St. Petersburg, I have made the latest preliminary edition of the DTL LetterModeller available for (free) download from: [http://www.fontmaster.nl/english/demo.html](http://web.archive.org/web/20140720034935/http:/www.fontmaster.nl/english/demo.html \"http://www.fontmaster.nl/english/demo.html\")  \nThe downloads for Mac OS X and Windows also include the PDF of my presentation. This document gives some hints on how to proceed with the further design of the generated glyphs and subsequently reveals some of the planned functionality for DTL LetterModeller.\n\nThe development of the application is partly the result of my PhD research at Leiden University, in which harmonic systems in scripts and music play a central role. The ideas behind the application, which are described in the PDF, are based on my program and experiments as Senior Lecturer at the Royal Academy of Art in The Hague over the past 21 years. Basically the models are supplementary to writing with the broad nib and the pointed pen and the subsequent letter drawing (and vice versa). I actually believe that the application can also be of use at a much earlier stage of education, like at the elementary school.  \nSome of my former students showed some of my models on the web over time, like:  \n [http://www.letterlabor.de/frank.php](http://web.archive.org/web/20140720034935/http:/www.letterlabor.de/frank.php \"http://www.letterlabor.de/frank.php\") and this lead to discussions like at: [http://typographica.org/000756.php](http://web.archive.org/web/20140720034935/http:/typographica.org/000756.php \"http://typographica.org/000756.php\").\n\nBasically (the current status of) my theory is that Scripts are represented by Harmonic Systems, (for instance Capitals, Textletters and Cursives), which contain one or more Harmonic Models, which also can be shared between the Systems. Harmonic Models can contain one or more Proportional Models, which reflect in the Rhythmic Model (texture and spacing), and one Relational Model (pen width vs. x-height, i.e. weight).\n\nThe current edition of the DTL LetterModeller focusses only on the Textletters. This Harmonic System can be explored and modified using a range of parameters. The outcome can be exported in BE (Bezier) format, and these glyphs can be further edited in DTL FontMaster (Light) and subsequently exported as a font.\n\nThe application has some rough edges and a few loose ends still. For instance the ‘Pen thickness’ currently only works for the diagonals in the ‘a’ and ‘e’. Furthermore there is room for improvement for construction of the ‘k’ and ‘v-z’ range and the ‘s’ is missing. Flattening of the curves is not possible yet, so Gothic variants have to wait for the moment.\n\nThe programming of the DTL LetterModeller is done by Dr. Juergen Willrodt and Axel Stoltenberg at URW++.\n\nFrank E. Blokland\n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_v107_5199.gif)\n\n",
  "author": "blokland",
  "time": "24 Aug 2008 — 7:36am",
  "uid": "1688",
  "comments": [
    {
      "time": "24 Aug 2008 — 11:17am",
      "content": "It’s certainly an interesting tool. Are user-created models something we can expect in a future version? Also, will the text of your talk be posted for those of us who can’t make it to ATypI?\n\n"
    },
    {
      "time": "25 Aug 2008 — 3:01am",
      "content": "James Puckett:\n\n‘[...] Are user-created models something we can expect in a future version? [...]’\n\nYou must correct me if I am wrong, but this question seems to imply that the underlaying models for the Harmonic Systems are arbitrary, which they are not in my opinion. The model for the Textletters shows the underlaying and historically developed construction, which finds its origin in writing with the broad nib. This opposed to user defined patterns for constructing a particular type design, which can to a certain extend be derived from, or relate to a Harmonic System, depending on the level of support of the conventions.\n\n‘[...] Also, will the text of your talk be posted for those of us who can’t make it to ATypI? [...]’\n\nThe next edition of the DTL LetterModeller will be accompanied by the launch of the lettermodel.org/com web site, on which supporting texts will be placed.\n\nFrank E. Blokland\n\n"
    },
    {
      "time": "25 Aug 2008 — 8:10am",
      "content": "I do not mean to imply that the models are arbitrary, but unless I misunderstand your theory, it seems logical that there is more than one.\n\nBut more arbitrary models could be fun as well! Then again, I guess that multiple master tools and superpolator could be considered as a way to create arbitrary models that can be used to extrapolate alphabets.\n\n"
    },
    {
      "time": "12 Aug 2009 — 5:22am",
      "content": "A new, free, version (2.0.0) of **DTL LetterModeller** can be downloaded from:  \n&nbsp;  \nMac OS: [http://www.fonttools.org/downloads/LEMO/LeMo\\_200\\_MAC.zip](http://web.archive.org/web/20140720034935/http:/www.fonttools.org/downloads/LEMO/LeMo_200_MAC.zip \"http://www.fonttools.org/downloads/LEMO/LeMo\\_200\\_MAC.zip\")  \nWindows: [http://www.fonttools.org/downloads/LEMO/LeMo\\_200\\_WIN.zip](http://web.archive.org/web/20140720034935/http:/www.fonttools.org/downloads/LEMO/LeMo_200_WIN.zip \"http://www.fonttools.org/downloads/LEMO/LeMo\\_200\\_WIN.zip\")  \nLinux: [http://www.fonttools.org/downloads/LEMO/LeMo\\_200\\_LIN.tgz](http://web.archive.org/web/20140720034935/http:/www.fonttools.org/downloads/LEMO/LeMo_200_LIN.tgz \"http://www.fonttools.org/downloads/LEMO/LeMo\\_200\\_LIN.tgz\")  \n&nbsp;  \nNew functionality includes:  \n– Optional serifs  \n– Predefined sets  \n– Bodysize entry  \n– Curve flattening  \n&nbsp;  \nA listing and description of the newly added functionality and some other changes can be found in the _Read Me_ file. Also a new PDF file (_Harmonische Systemen_) of my talk on my research at Leiden University last May has been added to the download. Currently I am working on an extensive manual, which will be presented at the 4th _DTL FontMaster Conference_ (‘Type[&]Design’) in the Steigenberger Kurhaus, The Hague in November of this year.  \n&nbsp;  \nSupported font storage formats are .be and .ik, which can be edited using DTL FontMaster (Light). As soon as the .vfb format becomes public, this will be added too.  \n&nbsp;\n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_1_6272.jpg)\n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_2_4751.jpg)\n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_4_6024.jpg)\n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_5_4146.jpg)\n  \n&nbsp; \n"
    },
    {
      "time": "12 Aug 2009 — 11:35am",
      "content": "Frank, I've downloaded and run the Windows installer, but I can't run the program. I've checked the folder, and I have a subfolder called 'Documentation' and a shortcut, but the shortcut doesn't point to anything: the program itself doesn't seem to have been installed.\n\n"
    },
    {
      "time": "12 Aug 2009 — 11:49am",
      "content": "I have the same problem. The installer seems to be faulty. This looks a fun and useful tool! I really hope the error will be fixed soon.\n\n"
    },
    {
      "time": "12 Aug 2009 — 11:56am",
      "content": "Ah, I managed to find the .exe file. The shortcut unhelpfully pointed to a Start menu directory containing, er, the shortcut. The .exe was where it should be. However, when I try to run it the program hangs, displaying a black rectangle on my screen which I imagine is where the splashscreen should be. I have to shut down the process from the task manager.\n\n"
    },
    {
      "time": "12 Aug 2009 — 12:04pm",
      "content": "I got it working! Do you use Windows Vista? If so, start the .exe as an administrator in XP compatibility mode.\n\n"
    },
    {
      "time": "12 Aug 2009 — 12:05pm",
      "content": "_As soon as the .vfb format becomes public, this will be added too._\n\nHow about [UFO](http://web.archive.org/web/20140720034935/http:/unifiedfontobject.org/), that's already public? :)\n\n"
    },
    {
      "time": "12 Aug 2009 — 12:37pm",
      "content": "Thanks, Sindre. That works.\n\n"
    },
    {
      "time": "12 Aug 2009 — 12:57pm",
      "content": "Sorry for the problems with the Windows version; I will look at it early tomorrow.\n\n"
    },
    {
      "time": "12 Aug 2009 — 4:21pm",
      "content": "FYI, the Mac version works just fine. Serifs and curve flattening are pretty cool.\n\n"
    },
    {
      "time": "13 Aug 2009 — 7:46am",
      "content": "Jens: ‘How about UFO, that’s already public? :)’\n\nYes, that could be an option too.\n\nThe UFO format is actually related to (inspired by?) our 35 years old IKARUS based system. As Karsten Luecke noted ( [http://www.typophile.com/node/55208](http://web.archive.org/web/20140720034935/http:/www.typophile.com/node/55208 \"http://www.typophile.com/node/55208\")): ‘[...] in their essence, UFO and UFO applications are actually more similar to Ikarus/FontMaster’s than FLS’s philosophy:  \n— The UFO font format. Rather than one file per font as with FLS, an UFO is a collection of separate files for outlines, naming and other metadata, kerning, classes, features — not unlike FM fonts. [...]’  \nand: ‘[...] — The UFO applications. AFAIK, the philosophy behind UFO-based applications is to have one tool per each well defined step in the font production workflow. Which is exactly FM’s philosophy of offering separate modules. [...]’\n\nPerhaps it would be interesting to make a direct comparison of UFO files and UFM file plus other FM files. Any volunteers?\n\n"
    },
    {
      "time": "14 Aug 2009 — 12:07pm",
      "content": "John: ‘[...] the shortcut doesn’t point to anything [...]’  \nSindre: ‘[...] start the .exe as an administrator in XP compatibility mode [...]’\n\nThe installer seems to function correctly, but it looks like permission-settings force the Vista user (under XP there is no problem) to run the app as administrator. Checking this option in the ‘properties’ seems to revitalize the shortcut. Changing the compatibility mode is, as far as I can see, not necessary.\n\nThat being said, changing settings as such should not be necessary, of course, and this is also not the case with the Windows versions of DTL OT- and CompareMaster. So, I will discuss this with the programmers. It is vacation season, so it can take a couple of days before an update becomes available.\n\n"
    },
    {
      "time": "16 Aug 2009 — 7:05am",
      "content": " **Some brief notes to a few illustrations from the _Harmonische Systemen_ PDF, which is part of the LeMo 2.0.0 download.**\n\nThe characters which are part of the scripts that are in use all over the world are not supplied by God(s) nor find their origin in nature, but are actually inventions of mankind. The differences between these scripts and their underlaying structures make it plausible that the requirements are mostly culturally and historically based. One can’t apply the same (design) rules concerning harmony and rhythm for the latin script on for instance Hangul, like the traditional music of Korea is not comparable with Western music and even seems to lack what we call harmony.  \n&nbsp;\n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_2_6482.jpg)\n  \n&nbsp;  \nTherefore the rules for good typography, that derive from the scripts, i.e., the letterforms themselves, and which for instance show up in the ‘hierarchy of space’, cannot be universally applied, but only within the (elements of the) scripts themselves. These rules are anchored in what I would like to name _Harmonic Systems_. For Latin these _Harmonic Systems_ are Capitals, Textletters and Cursives. These systems are not completely coherent and share collections of different _Harmonic Models_, _Proportional Systems_, _Relational Systems_ and _Rhythmic Systems_.\n\nThese models and systems and their combinations are the result of the sum of evolution, direct interference of scholars and (the moments in time of) technical innovations.  \n&nbsp;\n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_1_5686.jpg)\n  \n&nbsp;  \nThe _Harmonic Syetems_ are neither perfect nor sacred, but anchored in conventions. Conventions are blueprints for conditioning and conditioning on it’s turn preserves the conventions. That may be a scary thought for every type lecturer (at least it is for me!), but we simply have to acknowledge this fact and to deal with it.  \n&nbsp;  \n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_8_5734.jpg)\n  \n&nbsp;  \nTo understand the requirements, or to be able to deviate from these, one has to understand the structure of the underlaying systems and models. The themes on which all current type designers make variations, find their origin in systems and models that were fixated in the fifteenth century by the invention of movable type. Type designers basically put a relatively thin (but often complex) layer of varnish by making variations on the more than five centuries old themes which have become the standard. The newly created typefaces are the result then of the designers’ insights, technical skills and, of course, the _Zeitgeist_.\n\nLetterforms that are made for Latin but which are outside the conventions, like for instance Wim Crouwel’s _New Alphabet_, can only be judged as such by applying the rules that derive from the underlaying structure, i.e., the conventions that are defined by the type design itself.\n\nOne could argue that Capitals, Textletters and Cursives find their origin in the movements that result in a single line (‘skeleton’) form on which a certain contrast sort (‘translation’, ‘expansion’ or a combination of these), contrast and subsequent contrast flow (can be influenced by rotation) are applied. Another opinion is that the shapes find their origin in (the restrictions of) the tool that was used to make the movements. In case of the variations on the Textletters and Cursives from the Renaissance (‘Humanistic’) the pen in question was the broad nib, as was the case with the ‘base model’ from the 8th century (‘Carolingian’).  \n&nbsp;\n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_9_3668.jpg)\n  \n&nbsp;  \nThe models above show that when translation is applied on a ‘skeleton’ form of a Textletter ‘n’, the construction changes significantly depending on the vector angle. The position of the highest contrast in the arch moves in case the pen angle is changed. Due to the conventions one would expect the highest contrast in the arch nearby or even attached to the stem. So, the ‘skelton’ shape works for the ‘n’ on the right, but not for the other one.  \n&nbsp;  \n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_3_6544.jpg)\n  \n&nbsp;  \nWhen writing such a Textletter, normally (but not necessarily) the pen is lifted and the ‘skeleton’ lines that define the stem and arch are not connected. When stem and arch have to be connected to construct an uninterrupted shape, the 'skeleton' line should represent/follow the ‘vector bridge’, i.e., the angle and width of the broad nib effect applied.  \n&nbsp;  \n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_4_6583.jpg)\n  \n&nbsp;  \nIn the primary Harmonic Model (phm) in the current LeMo edition the ‘s’ lacks and it is obvious that the 'k' and 'v-z' range are not faultless when it comes to the design and digital representation, especially when serifs are applied. One could conclude that therefore the model is to much restricted or is even incorrect to represent the Textletter. In fact, it is not strange that the letters in question cannot be defined faultlessly with the phm; as everyone who writes with a broad nib knows, these letters need some tweaking and bending to fit with the other ones.  \n&nbsp;  \n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_5_4972.jpg)\n  \n&nbsp;  \nThe ‘k’ and the ‘v-z’ range, but also the ‘s’ are definitely directly derived from the capitals and therefore represent a different Harmonic Model. Capitals **do** find their origin in ‘skeleton’ lines, which were eventually vectorized by the Romans. The geometrical and relatively simple shapes of the Capitals allow the applying of broad nib effects using different vector angles.  \n&nbsp;  \n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_6_6272.jpg)\n  \n&nbsp;  \nThe next edition of the LetterModeller will contain a library of ‘skeleton’ shapes for, amongst other characters, the Capitals and ‘k’ plus ‘v-z’ range. All parameter settings for the phm can be applied on these characters then.  \n&nbsp;  \n\n ![](http://web.archive.org/web/20140720034935im_/http:/typophile.com/files/LeMo_7_6438.jpg)\n  \n&nbsp;  \nAnother addition will be the ‘disconnection’ of the serifs of the basic model afterwards, by using the ‘general’ parameters and the subsequent applying ‘independent’ general parameters, i.e., for all serifs, or even local ones (per [part of the] serif).  \n&nbsp; \n"
    },
    {
      "time": "16 Aug 2009 — 11:27am",
      "content": "Ultimately, the system should work for connected scripts. This looks promising!\n\nI developed a feature code for OpenType substitutions in connected scripts (Latin), with glyphs having joins (connecting entry/exit strokes) that are:\n\nLeft joins:  \n1. none  \n2. top  \n3. bottom\n\nRight joins:  \n1. none  \n2. top  \n3. bottom\n\nThere is a reductive logical constraint here, but the system has much in common with the traditional \"joining rules\" of calligraphy, e.g. in the chancery script.\n\nThis technique was explained at a workshop at TypeCon in New York which I co-presented with Adam Twardoch and Thomas Phinney.\n\nI haven't got around to fully implementing it in a type design yet (although there is some of it reverse engineered into Handsome Pro), but will have a go at using it on my own handwriting one day.\n\nI got the idea that a connected script could be based on a skeletal path when making the Handsome family, with a variety of styles that are different \"pens\" based on the same skeleton, executed with different path-stroking treatments.\n\nBut of course, this is Knuth's idea of the metafont.\n\n"
    },
    {
      "time": "21 Aug 2009 — 5:53pm",
      "content": "In addition to the curved endings and basic serifs simply angled terminals would be a great feature.\n\n"
    },
    {
      "time": "22 Aug 2009 — 7:19am",
      "content": "James: ‘In addition to the curved endings and basic serifs simply angled terminals would be a great feature.’\n\nStroke endings, including serifs, represent the contrast and contrast sort. In case of slab serifs or sans serifs (if such things exists) the lowest possible contrast is represented and the contrast sort can’t be distilled anymore from the (lack of) serifs.\n\nPage 82 of the _Automating Type Design Processes_, which is part of the LeMo version 2.0 download, shows the effect on the serifs of the lowering of the contrast. In one of the next versions of LeMo the ‘Pen thickness’ function will work for all letters and subsequently the used parameters will have an effect on the contrast and the related serif angles, and optionally the serifs can be removed then.\n\n"
    },
    {
      "time": "5 Sep 2011 — 11:50am",
      "content": "Some students actually used the LetterModeller as a source of inspiration for their type design: [http://typophile.com/node/84858?destination=node/84858](http://web.archive.org/web/20140720034935/http:/typophile.com/node/84858?destination=node/84858 \"http://typophile.com/node/84858?destination=node/84858\")\n\n"
    }
  ]
}
