{
  "id": "48753",
  "title": "Health products company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This is a logo concept for a natural health products company. The idea behind the company is making and deciding on what supplements to take easier and simpler.\n\nI would love to hear your thoughts\n\n ![](http://web.archive.org/web/20081122102355im_/http:/www.typophile.com/files/Untitled-4_4238.jpg)\n\n [‹ Kindersley Logo Critique](http://web.archive.org/web/20081122102355/http:/www.typophile.com/node/48367 \"Go to previous forum topic\") [Lost & Found Stock (stock-photo collection) ›](http://web.archive.org/web/20081122102355/http:/www.typophile.com/node/48617 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122102355/http://www.typophile.com/user/35935\" title=\"View user profile.\">tommartin</a>",
  "time": "<br>",
  "uid": "35935",
  "comments": [
    {
      "time": " 25.Aug.2008 7.59am",
      "content": "The lowercase “s” in Avant Garde is so narrow that it looks like a mistake. If it were me, I’d pick a different typeface. There are a lot of other sans serifs out there that are clean and modern (Avant Garde looks really dated) and that don’t suffer from the “s” problem. Avenir might be a better choice.\n\nThe yellow seems to be fine for that shape on the top right, but it seems to be a little too light for “natural”\n\n"
    },
    {
      "time": " 25.Aug.2008 10.48am",
      "content": "I second Jonathan’s opinion, Your font choice does seem dated, experiment some more with that.\n\nAlso overall it feels a little off balance. The green shape looming over the word “natural” makes me think of a boulder teetering on a cliff. Did you try reversing the two shapes - so the natural/organic shape is over the word “natural” and the half a capsule is over the word “prescription”?\n\nYour color palette has that fresh, organic, natural feel. However the yellow might be tough to read at small sizes, on a business card for example.\n\n"
    },
    {
      "time": " 25.Aug.2008 11.04am",
      "content": "What’s the purpose of the period? As for the yellow, I find it difficult to read even at its present size.\n\n_Did you try reversing the two shapes - so the natural/organic shape is over the word “natural” and the half a capsule is over the word “prescription”?_\n\nI’m pretty sure those two shapes are meant to symbolize ’N’ and ’P’ in an abstract fashion.\n\n"
    },
    {
      "time": " 25.Aug.2008 12.28pm",
      "content": "I didn’t see the abstract N and P at all, thanks for pointing that out Arcturus. As I go back and re-evaluate the design, now I really want to see the font replaced. One where the negative space is more clearly reflective of the above shapes.\n\nN and P’s, or leaf and capsule, it still looks unbalanced, like the icon is crushing the type. However, with a type change this comment may become moot. Or perhaps it’s just a size/scale issue - it’s a good start Tom just play around a little more.\n\n"
    },
    {
      "time": " 25.Aug.2008 2.27pm",
      "content": "those fluoro colours are burning a hole in my screen!\n\nI also think the balance of mark and text will cause problems when you start reducing the size.\n\ngot any more concepts?\n\n—————  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20081122102355/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": " 28.Aug.2008 5.23pm",
      "content": "I saw the ’n’ and the ’p’ right off the bat. Let’s see it the type in Avenir, and the whole treatment with some different color choices (not forgetting black and white).\n\n—  \nNick Hladek\n\n"
    }
  ]
}
