{
  "id": "48769",
  "title": "Union Made (working title)",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I've been really tired of seeing how much brothers gets used, so I wanted to make an alternative with a little more character.\n\nThus, union made:\n\n| Attachment | Size |\n| --- | --- |\n| [unionmade\\_03.jpg](http://web.archive.org/web/20150417203549/http:/typophile.com/files/unionmade_03.jpg) | 48.66 KB |\n| [unionmade\\_01.jpg](http://web.archive.org/web/20150417203549/http:/typophile.com/files/unionmade_01.jpg) | 57.46 KB |\n| [unionmade\\_tester.pdf](http://web.archive.org/web/20150417203549/http:/typophile.com/files/unionmade_tester.pdf) | 80.37 KB |\n\n",
  "author": "ned wright",
  "time": "25 Aug 2008 — 12:41pm",
  "uid": "16370",
  "comments": [
    {
      "time": "25 Aug 2008 — 2:13pm",
      "content": "Would love to see a pdf (or more visuals closer up).\n\nI think it may well be superb!\n\n"
    },
    {
      "time": "25 Aug 2008 — 4:44pm",
      "content": "i'll post a pdf tomorrow AM :)\n\n"
    },
    {
      "time": "25 Aug 2008 — 4:50pm",
      "content": "looking awesome!\n\ncan't wait for more.\n\nZING!\n\n----------  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20150417203549/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": "26 Aug 2008 — 8:21pm",
      "content": "This looks really interesting. Let us know when you post the PDF.\n\n-matt\n\n"
    },
    {
      "time": "28 Aug 2008 — 1:52pm",
      "content": "Sorry this took so long... check out:\n\n[http://ltrltd.com/images/umglyphset.gif](http://web.archive.org/web/20150417203549/http:/ltrltd.com/images/umglyphset.gif)\n\n"
    },
    {
      "time": "29 Aug 2008 — 1:51am",
      "content": "It would help to see the letters close-up, and to see some actual text set in it. I like it in general. It's hard to tell, but it might be a bit too regular & consistent across glyphs -- almost formulaic. Varying some of them a bit might be in order.\n\n-matt\n\n"
    },
    {
      "time": "20 Oct 2008 — 6:12pm",
      "content": "Couple months later..... added a PDF for you guys to peep.\n\n"
    },
    {
      "time": "22 Oct 2008 — 7:26am",
      "content": "Ned, Ned, Ned...Constructionally speaking, this is absolutely outrageous and makes no sense at all. So I have to ask the question, why do I have such a broad grin on my face every time I look at this bad boy? There are some crazy curves in it that I would never have chosen in a million years. That said, you're most definitely on the edge of something very, very cool. Maybe I want clearer rules to be established across the font, for example the R has an ink trap on its counter that the B doesn't have. Why? And yet, it's a thing of beauty and very different. Is it pure self-indulgence on your part or do you have a 'use' for it (other than bringing a smile to people's faces, of course)?\n\n"
    },
    {
      "time": "25 Oct 2008 — 11:54am",
      "content": "hah, nick..\n\nIt's the first font I've really ever spent much time building. So what your seeing is a series of mistakes, luck, an appreciation for history + the midwest, with a touch of bare-bones (typography 101 represent) intuition from a 23 year old kid out of college.\n\nYeah, i see what your saying with the ink trap. I really wanted to build this font to have a certain small town charm, extra character if you will, but still work as a system. It does have hic-ups, things that come from no where (i.e. the A).. but aesthetically speaking I feel like it mostly holds together (the X has been troublesome).\n\nHow would you suggest I proceed from here? Really want to make this thing mint.\n\n"
    },
    {
      "time": "1 Nov 2008 — 2:35am",
      "content": "Some minor points: The crossbar on the small-cap a seems too wide. The top of the small-cap b seems too thick, and I agree with Nick that both Bs need ink traps like the P and R. I'd like to see punctuation. You might experiment with making a few of the glyphs wider, like the N, R, X and K -- right now it's almost monospace with wide M and W.\n\nI particularly like the flair on the top of the B, the diagonal crossbar of the A and H, the ink traps, and the punched-out detail in the lower right. In general I think this is great and nearly ready for prime-time.\n\n-matt\n\n"
    },
    {
      "time": "1 Nov 2008 — 8:05am",
      "content": "I worry a little that the dingus in the lower right makes the O look too much like a Q.\n\n"
    },
    {
      "time": "14 Jan 2009 — 11:46am",
      "content": "Nice work, Liked this when I first saw it in Sr. Project.\n\n"
    },
    {
      "time": "14 Feb 2009 — 10:33am",
      "content": "Fantastic work. Minor thing, but I feel like the 3 is a little off. Where all the angles meet on the left seems ot be a bit jarring...makes it look like it's hunched over almost. Still awesome though...if you were selling this somewhere I'd buy it.\n\n"
    }
  ]
}
