{
  "id": "48777",
  "title": "Mac MS Office 2008 does not properly display T1 fonts in menus",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "(I apologize for length, but I wanted to be specific)....\n\nI've beat my head over this and, not being a font dummy, quickly eliminated all obvious potential issues (install sequence of updaters, permissions, font caches, font managment utilities, etc...) I found a screen grab online that illustrates the problem quite distinctly, let me try to outlne the behaviour and see if anyone knows the answer. I am convinced this is a Microsoft issue in terms of how they are coding fonts for display in Office apps' font menus. The behaviour below occurs ONLY in Office 2008, latest version (12.1.2), Leopard 10.5.4.\n\nI only use/install Mac T1 fonts, and Leopard's own dfonts that you cannot disable/delete. I did not install any of Office 2008's fonts from the installer. I do not have any OTF fonts on my system. I normally use Lino's Font Explorer for font management, but I've even eliminated (completely uninstalled) that and only use Apple's Font Book to activate/deactivate fonts. All my T1 fonts are in my user library. The behaviour below is not font vendor-specific. All fonts are squeaky clean (not corrupt), and use proper Mac Postscript naming conventions (verified by me in FontLab).\n\nThe behaviour seems limited to the italic fonts in a font family, at least for T1 fonts. I surmised this issue is related to MS not correctly dealing with style-linked font names, but I verified in FontLab that the behaviour occurs for T1 font families where style-linking is implemented, AND for those where it is not implemented. Oddly though (I have not verified this extensively to say for sure), it seems to occur mostly for font families where there is a base weight called Thin, Light, Regular and/or Medium. Does not seem to occur if the base weight is called Normal, or Roman, instead of Regular.\n\nOK, look at the screen grab for Gotham, which if it were the T1 version, exhibits the behaviour I have encountered. Notice how the Thin Italic, Book Italic, Bold Italic, and Light Italic weights are missing? They would be missing from all three of Word's font menus. Yet, they ARE installed in the system, they are menu accessible in all non-Office apps, and--here's the puzzler--Word WILL access them, albeit inconveniently. If you knew that Gotham-ThinItalic was the postscript file name for the missing Thin Italic weight, you could type that in one of Word's font name linkboxes (e.g., in the Formatting Palette), hit return, and Word WILL implement the font in the document and show the font's name in the linkbox (though it will forget the name as soon as you select some other font).\n\nFinally, this bug also occurs for Apple's dfonts; for Helvetica, for example, there is an indication that this is a family in Word's Font Menu listing via a triangle, but the submenu is blank; none of the weights are shown.\n\nThis bug is driving several users here batty, including yours truly. What is going on?\n\n ![](http://web.archive.org/web/20130921050350im_/http:/typophile.com/files/wordmenuhiccup_4216.jpg)\n\n",
  "author": "ryanholmes",
  "time": "25 Aug 2008 — 5:45pm",
  "uid": "22894",
  "comments": [
    {
      "time": "25 Aug 2008 — 6:59pm",
      "content": "I can confirm many oddities relating to Office's (Word's) font menu...missing items, and inconsistencies from machine to machine, etc. Also it seems these problems are not limited to Type 1 fonts. I've seen it with CFF (.otf) and TrueType (.ttf) families as well.\n\nUnfortunately I've not been able to locate any cause, other than some kind of bug in Word. The fonts we've seen it with adhere to naming conventions, etc.. Doesn't happen with every font/family, though I will say it \\*seems\\* to happen more often with families that have more than the usual 4 weights. I don't have any stats to back that up though I could review our records and see if there's a pattern...\n\n"
    },
    {
      "time": "25 Aug 2008 — 7:51pm",
      "content": "In previous versions of Word, MS did not mess with the system's internal font calls much as far as I can tell, other than doing the WYSIWYG thing. Every font weight showed up as an individual listing, in all menus--albeit ungrouped. I conjecture that part of the problem might be the new feature where MS now groups the fonts into families with submenus for individual weights--but as the above shows, they seem to have coded it wrong. In the past, I used a 3rd party utility (Fontcard) to get this functionality and many years ago, the long-since gone Adobe Type Reunion.\n\nI agree, I've tried to reverse-engineer the logic behind instances when these font menu hiccups occur, and I can't do it. There is no immediately obvious pattern, but it is indeed pervasive.\n\n"
    },
    {
      "time": "26 Aug 2008 — 1:21am",
      "content": "There seem to be a lot of problems with Office 2008. And MS doesn't seem all that concerned about fixing them. Probably because it's an Apple thing. It's so bad that they came out with a program, Open XLM converter, that allows Office 2004 to open 2008 docs. 2008 has been out for something like seven months now and my Word crashes each and every time I close it and Excel can't even open half of its own or Excel 2004 docs. I don't really see any difference between 2004 and 2008 and I'd drop it but if I ever have to re-install I already know the hell I would go through, since I've done that, been there. Needless to say, I keep 2004 as a backup. Their site, Mactopia, gives me the creeps with its corporate fake flowerly dorky everything is wonderful attitude. I'd like to meet some of the MS programmers right up front and personal. I would really like to. Really. I kick the Starbucks out of them.\n\nGerald\n\n"
    },
    {
      "time": "26 Aug 2008 — 1:45am",
      "content": "Yeah, a typo or two. It is Open XML Converter. And instead of \"I kick\" I should have said \"I'd kick\" the Starbucks out of them. And I would. Seriously. After FRICKIN all it's not like I bought the software (buyer beware), I am only FRICKIN leasing it. Isn't some sort of responsibility required on the part of the rightful owner (the lessee) here? Weird, my landlord has contractual obligations, why don't software manufacturers?\n\nGerald\n\n"
    },
    {
      "time": "26 Aug 2008 — 6:37am",
      "content": "<cite>... my landlord has contractual obligations, why don’t software manufacturers?</cite>\n\nThat's the small print on the wrapping around the CD: as soon as you open that, you forfeit every right to complain.\n\nIt is kinda weird that in practically every field a customer has the right to complain about malpractice, except in the software industry.\n\n"
    },
    {
      "time": "5 Jun 2011 — 1:46am",
      "content": "[usb flash drive](http://web.archive.org/web/20130921050350/http:/badabingbaby.com/)\n\nINFORMATICS ARTICLE\n\n"
    }
  ]
}
