{
  "id": "48775",
  "title": "Kill a Font",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey guys,\n\nI know you all have at least one font that you absolutely hate and refuse to use, so I thought it would be fun to start a list. The rules are as follows:\n\n1) Name the ONE font you’d kill. (Arial)  \n2) Explain why you chose it. (it’s a knockoff)  \n3) Suggest an alternative. (Helvetica)\n\nEnjoy,  \nMatt\n\n [‹ Help!](http://web.archive.org/web/20081206012905/http:/typophile.com/node/49121 \"Go to previous forum topic\") [ITC Garamond vs Adobe Garamond ›](http://web.archive.org/web/20081206012905/http:/typophile.com/node/48826 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081206012905/http://typophile.com/user/27335\" title=\"View user profile.\">Maverick18x</a>",
  "time": "<br>",
  "uid": "27335",
  "comments": [
    {
      "time": " 25.Aug.2008 5.18pm",
      "content": "1. Times New Roman  \n2. After Helvetica and Arial, the most ubiquitous typeface in the world, and it performs horribly in most of the settings in which its used.  \n3. [Arnhem](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/singles/ourtype/arnhem_normal_ot/). A new serif for a new era.\n\n"
    },
    {
      "time": " 25.Aug.2008 6.24pm",
      "content": "1. Times New Roman.  \n2. Because as a newspaper face it’s outdated, and for everything else it looks like some idiot used a dated newspaper face in the wrong place. Because as much as designers love to bitch about Arial, Arial in all caps looks a lot better to me than Times.  \n3. Stone Serif. Sumner Stone is the forgotten typographic genius of our era. His designs are fecund with potential that almost nobody is doing a damned thing with.\n\n"
    },
    {
      "time": " 25.Aug.2008 8.02pm",
      "content": "1. Times New Roman.  \n2. It’s ugly and it’s ubiquitous.  \n3. [Freight Text](http://web.archive.org/web/20081206012905/http:/www.dardenstudio.com/typefaces/freight_text).\n\n"
    },
    {
      "time": " 25.Aug.2008 9.43pm",
      "content": "1) Helvetica  \n2) It’s a goddam cyclops of a font.  \n3) Unica\n\nhhp\n\n"
    },
    {
      "time": " 25.Aug.2008 11.46pm",
      "content": "1) Charlemagne  \n2) I hate the numbers with those ugly serifes.  \n3) Requiem\n\n"
    },
    {
      "time": " 26.Aug.2008 12.06pm",
      "content": "_1. Times New Roman  \n2. After Helvetica and Arial, the most ubiquitous typeface in the world, and it performs horribly in most of the settings in which its used.  \n3. Arnhem. A new serif for a new era._\n\nStewf, I came very close to presenting a plan for doing that very thing corporation-wide at one of my past employers.\n\nThe result: no dice. Free beat good, yet again.\n\n1) Impact\n\n2) Its inclusion in MS software has created a belief, apparently, that no other condensed bold is necessary, so people use it to make an IMPACT without a thought about LEGIBILITY.\n\n3) Univers Condensed Black (but, really, most _any_ decent grot/gothic with that variant will do).\n\n"
    },
    {
      "time": " 26.Aug.2008 1.47pm",
      "content": "While I can’t think of any fonts I’d go so far as to kill, I’d kill fonts with unnecessarily restrictive EULAs.\n\n"
    },
    {
      "time": " 26.Aug.2008 4.56pm",
      "content": "Times is not bad !\n\nIt is just in every single computer in the planet.\n\n"
    },
    {
      "time": " 26.Aug.2008 8.05pm",
      "content": "Hi everyone,\n\nCan’t believe this one hasn’t been suggested yet...\n\n1. Comic Sans\n\n2. It’s a fugly abomination that Microsoft thoughtlessly inflicted upon the world, thereby allowing millions of innocent (and not-so-innocent) computer users worldwide to perpetrate crimes against typography\n\n3. Any number of comic book-inspired casual handwriting/handlettering fonts out there, especially anything done by Comicraft.\n\nCheers,  \nJohn the Fontaholic\n\n"
    },
    {
      "time": " 27.Aug.2008 3.09am",
      "content": "@ Matt: Helvetica is a rip off too.\n\n"
    },
    {
      "time": " 27.Aug.2008 3.18am",
      "content": "1. Microgramma/Eurostile\n\n2. It sure was such a great typeface, back then. But — It’s so heavily overused, and abused, currently, it’s not even funny anymore.\n\n3. [(Foundry) Monoline](http://web.archive.org/web/20081206012905/http:/www.foundrytypes.co.uk/foundry_monoline/monoline.html); [Vafle](http://web.archive.org/web/20081206012905/http:/www.suitcasetype.com/index.php?lmut=en&part=fonts&font=18); And some more...\n\nDav\n\n"
    },
    {
      "time": " 27.Aug.2008 10.33am",
      "content": "Everyone is hating on the web fonts :(\n\n"
    },
    {
      "time": " 27.Aug.2008 10.52am",
      "content": "Oh, but Haley, no one is hating on the [good ones](http://web.archive.org/web/20081206012905/http:/www.will-harris.com/verdana-georgia.htm).\n\n"
    },
    {
      "time": " 27.Aug.2008 12.59pm",
      "content": "1.+ 2. The most annoying sans serif i know in the recent years was/is FF Dax/FF Dax Wide. This typeface is so pretentious, and it’s everywhere – screaming at me improperly.\n\n3. Daxline would be calmer, Schmalhans would be nicer.\n\nI agree, Eurostile should pause for n-years.\n\nI have no problems with “the hidden” Times New Roman, where do you see it in use? I just see Verdana, Arial/Helvetica and Georgia, and a bit Tahoma on the web.\n\n"
    },
    {
      "time": " 27.Aug.2008 3.01pm",
      "content": "1. Curlz MT  \n2. It makes me dizzy  \n3. Anything else\n\n"
    },
    {
      "time": " 27.Aug.2008 3.18pm",
      "content": "A few of many Curlz alts: [FF Fontesque](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/downloads/fontfont/ff_fontesque_1/), [Marguerita](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/singles/itc/marguerita_std_plain/), [Scriptease](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/singles/itc/scriptease_std_plain/), [Swank](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/downloads/itc/swank_std_virtual/), [Gigi](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/singles/itc/gigi_std_plain/)\n\n"
    },
    {
      "time": " 27.Aug.2008 3.22pm",
      "content": "All equally dizzying. Although I don’t mind Swank!\n\n"
    },
    {
      "time": " 27.Aug.2008 5.07pm",
      "content": "1. Concorde (Can’t remember the foundry).  \n2. Had to use it. Just detested it’s looks.  \n3. Any nice serif with good lookin’ italics.\n\n"
    },
    {
      "time": " 27.Aug.2008 10.26pm",
      "content": "My vote also goes to Comic Sans. Especially in business correspondence!\n\n"
    },
    {
      "time": " 28.Aug.2008 12.34am",
      "content": "1: Comic Sans  \n1: University Roman  \n1: Stop  \n1: Revue  \n1: Ayumi  \n1: Balloon  \n1: Hobo  \n1: Papyrus  \n1: Keedy  \n1: Curlz  \n1: NotCaslon  \n1: Remedy  \n2: there was a time these were fashionable, but there is a time one should be kind enough to stop use them everywhere.  \n3: anything else which is not looking too ugly.\n\ndr\n\n"
    },
    {
      "time": " 28.Aug.2008 8.24am",
      "content": "1. digitized versions of distressed type\n\n2. the premise is that the type has existed in place for a while and has eroded or been distressed by the elements. However, each letter is distressed exactly the same. Every E is the same. Every S is the same. So a headline with repeated letters looks goofy.\n\n3. there are better ways of distressing type than purchasing a pre-distressed font. Photoshop works. Or the old-fashioned method of outputting the type and beating the crap out of it, then scanning it back in, offers great satisfaction.\n\n"
    },
    {
      "time": " 28.Aug.2008 10.49am",
      "content": "or Trixie HD.\n\n"
    },
    {
      "time": " 28.Aug.2008 2.59pm",
      "content": "1. Papyrus  \n2. overused to make things look old and traditional.  \n3. don’t replace.\n\nWhat many of you seem to be ignoring is the fact that many of these fonts are used everywhere because they are free. As ’Chris Rugen’ said, free beats good so you can’t suggest a pay font to be used instead of a free font.  \nThe problem I’m realizing is that the mass public does not care about type or correct usage, it’s only us that care so deeply about these things.\n\n"
    },
    {
      "time": " 28.Aug.2008 3.05pm",
      "content": "Mass public, no. But it’s always nice for _professionals_ to have alternatives on hand for clients who have a particular typeface in mind due to the fact that it’s on their computer.\n\n"
    },
    {
      "time": " 28.Aug.2008 3.09pm",
      "content": "For Papyrus I humbly suggest:\n\n[Mariposa Sans](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/downloads/creative_alliance/mariposa_sans_std_virtual/)  \n [Oxida](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/downloads/linotype/palatino_sans_informal_com_virtual/)  \n [Palatino Sans Informal](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/downloads/linotype/palatino_sans_informal_com_virtual/)  \n [Florentine Set](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/downloads/letterperfect/florentine_set_ot/)  \n [ITC Cancione](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/singles/itc/itc_cancione_std_regular/)  \n [P22 Peanut](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/singles/ihof/p22_peanut_pro/)\n\n"
    },
    {
      "time": " 28.Aug.2008 3.38pm",
      "content": "1. Optima\n\n2. It’s what I would call ‘spießig’ in german. It’s so 50ies. I mean the grey 50ies that were to be washed away by the Pop and Beat rebellion in the 60ies.\n\n3. Angie Sans maybe\n\n"
    },
    {
      "time": " 28.Aug.2008 4.00pm",
      "content": "Amen, Jan. [Cora](http://web.archive.org/web/20081206012905/http:/www.fontshop.com/fonts/downloads/typetogether/cora/) and [Accent Graphic](http://web.archive.org/web/20081206012905/http:/www.identifont.com/show?BNC) for replacements too.\n\n"
    },
    {
      "time": " 28.Aug.2008 4.05pm",
      "content": "1. ) Interstate, or whatever is on the majority of highway signs across America.\n\n2. ) I’ve always found it somewhat clumsy and arbitrarily sharp (notably on the lowercase l) for something that adorns so much of the country.\n\n3. ) [ClearviewHwy](http://web.archive.org/web/20081206012905/http:/www.clearviewhwy.com/). It’s so much more understated and legible. I noticed the sudden increase in legibility when driving through Pennsylvania a year or two ago (where most of the signs have already been switched).\n\n"
    },
    {
      "time": " 28.Aug.2008 4.11pm",
      "content": "... and FF Advert maybe (with the two-storey ‘a’)?\n\n"
    },
    {
      "time": " 28.Aug.2008 4.13pm",
      "content": "What you’re seeing on the highway is a [typeface](http://web.archive.org/web/20081206012905/http:/en.wikipedia.org/wiki/FHWA_Series_fonts) designed by the US Highway Administration (mostly engineers). [Interstate](http://web.archive.org/web/20081206012905/http:/www.fontbureau.com/fonts/Interstate) is a design inspired by that typeface designed by Tobias Frere-Jones (a bonafide type designer).\n\n"
    },
    {
      "time": " 28.Aug.2008 4.26pm",
      "content": "“Inspired” is too generous.  \n“Based very closely on” is more accurate.\n\nhhp\n\n"
    },
    {
      "time": " 28.Aug.2008 4.28pm",
      "content": "Oh, I think it’s much too different for that description.\n\n"
    },
    {
      "time": " 29.Aug.2008 11.29am",
      "content": "I get tired of seeing Rosewood.\n\nOveruse.\n\nAny other font.\n\n"
    },
    {
      "time": " 29.Aug.2008 12.23pm",
      "content": "Bank Gothic.\n\nAs a sci-fi fan, I am completely burned out on it.\n\nHard to say. Most sci-fi type choices have become terribly cliché.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 29.Aug.2008 12.26pm",
      "content": "Very kind of you Stephen\n\nMichael\n\n"
    },
    {
      "time": " 29.Aug.2008 12.34pm",
      "content": "1.Avant Garde Gothic.  \n2.Avant Garde Gothic looks like a swiss cheese.  \n3.I don’t have an alternative cause I avoid type styles whose counters are very large in relation to the stroke weight. This will slow the reader.\n\nA.\n\n"
    },
    {
      "time": " 29.Aug.2008 7.47pm",
      "content": "There is a movement to Ban Comic Sans. I think it’s Bancomicsans.com.\n\nI would agree that comic sans is a crime against typography. It actually does look like a comic book when it’s in all caps, but everyone uses it for normal type.\n\n1. Comic Sans  \n 2. It looks like bad fifth grader handwriting and it pisses me off when people use it to write procedures at my office.  \n 3. Lucida Console\n\n"
    },
    {
      "time": " 30.Aug.2008 11.50am",
      "content": "OK Stephen, I’ll nix the “very”. But that’s it.  \nPolishing is way different than creating.\n\nhhp\n\n"
    },
    {
      "time": " 30.Aug.2008 1.49pm",
      "content": "<cite>[Comic Sans MS] actually does look like a comic book when it’s in all caps....</cite>\n\nI strongly disagree.\n\n"
    },
    {
      "time": " 30.Aug.2008 2.39pm",
      "content": "_I know you all have at least one font that you absolutely hate and refuse to use, so I thought it would be fun to start a list. The rules are as follows:_\n\n1) Name the ONE font you’d kill. (Arial)  \n2) Explain why you chose it. (it’s a knockoff)  \n3) Suggest an alternative. (Helvetica)\n\nLet me do this one sound bite at a time:\n\n_I know..._\n\nYou know only what you think you know, and what you think or believe you “know” is subject to errors of omission. Ignorance is golden in the end. As for what other people know, you _cannot know_ the contents of their minds.\n\n_I know you all have at least one font that you absolutely hate and refuse to use..._\n\nNope. Not even one. Such a mindset is unknown to me. Such an attitude fits the definition of what the ancient Greeks saw as Tyranny with a ruthless capital T.\n\n_...so I thought it would be fun to start a list._\n\nSome strange new definition of the word “fun” I hadn’t encountered before. You are about the fiftieth person to start such a hate list. Nothing could be more tedious or predictable at Typophile.\n\n_1) Name the ONE font you’d kill. (Arial)  \n2) Explain why you chose it. (it’s a knockoff)  \n3) Suggest an alternative. (Helvetica)_\n\n1) Get over it. Fonts cannot be killed, and expression of the desire to do so is an expression of your own insecurity, a projection of your anxieties and fears on what you don’t understand.  \n2) Explain why you have to pick on any body or any thing.  \n3) Tyranny, murder.  \n4) **Also try:** designing your own fonts.\n\nj a m e s\n\n"
    },
    {
      "time": " 30.Aug.2008 5.14pm",
      "content": "This is all subjective. No need to poo-poo on someone else’s fun.\n\n"
    },
    {
      "time": " 30.Aug.2008 5.24pm",
      "content": "Yeah Tiff, don’t poo-poo on James’s fun. ;-)\n\nhhp\n\n"
    },
    {
      "time": " 30.Aug.2008 5.31pm",
      "content": "True, true. James tells me I need to cut the cards more often. So, I figure I’m doing that. Or maybe this isn’t what he means. ;^)\n\n"
    },
    {
      "time": " 31.Aug.2008 2.52am",
      "content": "Tiffany, Hrant, Eden — what I wrote isn’t a personal attack, but a call for tolerance. Albeit inflammatory in style. While it may look as if I am taking the topic of this one too seriously, when I see typophiles revving up the hate juggernaut I wonder who is poo-pooing who and what. Perhaps you guys can tell me; is a thread like this anything other than poo-hanging session?\n\nHate is a corrosive word. Look at where hatred got the guy who stated the Ban Comic Sans campaign. Nowhere. My point—hating what you dislike rarely makes that thing go away, and we’re better off tolerating it. Nobody here will engage in any actual killing, and the life of no living thing is under threat. But “kill” is still dangerous corrosive word, I think best reserved for living things that actually threaten us and cannot be tolerated. The national socialists in Germany hated the Jews and killed between 9 and 11 million of them. The Jews weren’t threatening anybody, but when the axis powers took control of what was left of Germany we found it neccessary to execute the murderers who had tried to exterminate an entire race of people. Only in extreme circumstances like that is killing anybody neccessary. Why the Nazis had to hate the Jews. Well, clearly it was the Nazis projecting their fears and insecurities onto a convenient social / cultural group.\n\n**He who saves one life saves the entire world.**\n\nWill hating certain fonts we dislike (can’t bring ourselves to tolerate) make them disappear? Not likely. So where does hating them get us?\n\n**He who hates one font hates all of typography** Don’t take it literally. I’m speaking figuratively.\n\n_Wouldn’t your time be better spent on days to come  \nNot the ones that went?_    \n—words by Ron Sexsmith.\n\nTiffany—I’m not out of control, not doing a Bill Troop trip here, but having you step in and remind me why I joined this community in the first place is a good thing. We all need to keep a grip on the things that really count.\n\nj a m e s\n\n"
    },
    {
      "time": " 31.Aug.2008 4.13am",
      "content": "You’re really hating this thread, aren’t you, James?\n\n"
    },
    {
      "time": " 31.Aug.2008 5.39am",
      "content": "You’re really misunderstanding what I say, aren’t you, Jan?\n\n(sigh) I’m imitating you. How predictable. How boring.\n\nNo. What makes you think I hate the thread? I only find it abhorrent, childish and stupid, arrogant and concieted. Intolerant.\n\nWhy don’t you attempt to answer the question: Is the topic of this thread anything other than poo-hanging?\n\nIt seems you think that my questioning it amounts to hating it. How simplistic. Such a black & white view. I’ve seen you express hatred of numerous fonts. How intolerant. Such a black & white view.\n\nThere is a difference between being critical of something and hating it.\n\nj a m e s\n\n"
    },
    {
      "time": " 31.Aug.2008 5.40am",
      "content": "It wan’t neccessary to cut the cards before. It is at this point we should cut the cards. If I am really saying terrible things and expressing hatred for something, you shouldn’t feel the need to retaliate or at least suppress what I say, because it only makes me look bad (if true).\n\nDon’t let it escalate into a personal fight. Go on with the typo discussion. Remember why you joined this community in the first place.\n\nj a m e s\n\n"
    },
    {
      "time": " 31.Aug.2008 5.51am",
      "content": "I wasn’t all that serious and I think you’re taking this thread waayyy too serious.  \nShould have added a ;-) to my last post.\n\n_I’ve seen you express hatred of numerous fonts._  \nMe? Where? When? I’m pretty sure I never stated I **hate** a font.  \nI dislike, find overused but I don’t hate.\n\n"
    },
    {
      "time": " 31.Aug.2008 6.24am",
      "content": "After Comic Sans, Arial and Times New Roman the most ranted font is probably Papyrus.  \nBut it was just yesterday, that I saw a perfect use of it. Really. It was a perfect choice for that Rooibos tea package. Beautiful.\n\nRemember: there is no bad font. Only fonts used inappropriately.\n\nSzabolcs\n\n"
    },
    {
      "time": " 31.Aug.2008 6.59am",
      "content": "There is no love without hate.\n\nhhp\n\n"
    },
    {
      "time": " 31.Aug.2008 12.14pm",
      "content": "<cite> There is no love without hate </cite>\n\nIf we’re getting into dialectics, I would argue Hate is not the opposite to Love. Maybe Indifference.  \nA thread on what typefaces leave us indifferent would perhaps be more interesting. The ones typographers hate seem so predictable it makes me yawn - Arial, Comic Sans, Papyrus, Optima... - as do the motivations why. Why a typeface leaves us indifferent may start a proper discourse on design and typography.\n\nBut then again, hate is fun, indifference isn’t.\n\n1. DIN  \n2. It’s everywhere and it shouldn’t be  \n3. Something completely different\n\n"
    },
    {
      "time": " 31.Aug.2008 1.14pm",
      "content": "James, hate is not for the font it self, it is more for the wrong use of the font. I personally don’t use the word “hate” or “kill” too, but I am sure the thread didn’t mean anything like that rather a funny way to describe the general disapproval of some popular fonts - as far as I see - in wrong use.\n\nA.\n\n"
    },
    {
      "time": " 31.Aug.2008 2.03pm",
      "content": "James, I thought the point by point analysis of such a frivolous thread was hilarious.\n\n[Plato](http://web.archive.org/web/20081206012905/http:/www.myfonts.com/fonts/wilton/plato/) is a good slightly-less-ugly substitute for Papyrus.\n\n"
    },
    {
      "time": " 31.Aug.2008 6.35pm",
      "content": "This thread is miraculously defying [Godwin’s Law](http://web.archive.org/web/20081206012905/http:/en.wikipedia.org/wiki/Godwin%27s_law). Color me impressed! Anyway, to business:\n\n1) Myriad Pro  \n2) Bland and lifeless  \n3) Calibri\n\n"
    },
    {
      "time": " 1.Sep.2008 11.22am",
      "content": "@ Szabolcs\n\nYou make a good point. I think overuse and inappropriate use of Comic Sans anger me more than anything. I guess I shouldn’t be all for censoring creative expression of Comic Sans (if you can call it that). However, I often wonder what is wrong with the people who think it’s okay to use it at work.\n\nAlso, on Papyrus, I think it’s hysterical how popular it has become. It makes me think of bad History Channel specials about Ancient Egypt.\n\n"
    },
    {
      "time": " 2.Sep.2008 11.18am",
      "content": "I have an external hard drive which has a folder which contains backups of the source bitmaps for Otoboke. For some reason I can’t delete the folder or the files contained within. As much as I’d love sit around and rag on the standard Typophile hatethread fonts (Arial, Papyrus etc.), I would very much like to kill the source bitmaps for [Otoboke](http://web.archive.org/web/20081206012905/http:/www.typodermic.com/181.html).\n\n1: Otoboke Source bitmaps  \n2: It makes my root folder look messy  \n3: 1970s soft core pornography\n\n"
    },
    {
      "time": " 2.Sep.2008 1.39pm",
      "content": "1. Whatever font Hitler used in the Nazi party logo.\n\n"
    },
    {
      "time": " 2.Sep.2008 1.51pm",
      "content": "_1. Whatever font Hitler used in the Nazi party logo_\n\n3. And replace it with ???\n\n-\\> What do you want to say … ?\n\n"
    },
    {
      "time": " 2.Sep.2008 2.36pm",
      "content": "<cite>1. Whatever font Hitler used in the Nazi party logo.</cite>\n\nThere was type in the Nazi logo?\n\n"
    },
    {
      "time": " 2.Sep.2008 3.14pm",
      "content": "1. Arnold Boecklin  \n2. Because it is soooo passé  \n3. Bell Bottom\n\n"
    },
    {
      "time": " 2.Sep.2008 4.38pm",
      "content": "3. And replace it with ???\n\nSomething by that guy in a coma?\n\nhhp\n\n"
    },
    {
      "time": " 2.Sep.2008 6.08pm",
      "content": "You know who else wanted to ban fonts?  \nHITLER!  \n(actually, I have absolutely no evidence for this statement, but I don’t really care)\n\nI really just wanted to say that I love Myriad Pro (especially bold & condensed). It’s extremely readable without being as boring as, say, Arial.\n\nI might also submit that Calibri, having (thankfully) replaced Arial as the default sans serif font on Office 2007/8, is on its way to becoming overused.\n\n"
    },
    {
      "time": " 2.Sep.2008 6.16pm",
      "content": "what Ray said\n\n ![](http://web.archive.org/web/20081206012905im_/http:/typophile.com/files/08_06%20098_3660.jpg)\n\n-=®=-\n\n"
    },
    {
      "time": " 3.Sep.2008 7.03am",
      "content": "uh, with apologies to MAD Magazine & Antonio Prohias, of course.\n\n-=®=-\n\n"
    },
    {
      "time": " 3.Sep.2008 8.23am",
      "content": "Well someone sure needs to stop drinking the hyperbole tea :-|\n\n1. Mistral\n2. Very dated; almost impossible to find it used well (simply seeing it spaced properly would be a welcome change).\n3. Maybe Kinescope. \n\n"
    },
    {
      "time": " 3.Sep.2008 3.50pm",
      "content": "Thanks Russell!  \nHitler tried to kill Futura for real reals; with his bare hands. Renner gave him a couple of nut shots and the rest, as they say, is history.\n\n"
    },
    {
      "time": " 6.Sep.2008 7.25am",
      "content": "With all due respect to Matthew Carter, Verdana. It has become the most ubiquitous face on the web. While it’s not unattractive when properly used and well kerned, it looks horrible with normal web letterspacing. Its character count is very low, it takes up more space than necessary and a page full of it can be nauseating.\n\nWhile the face has nothing in common with Verdana, and isn’t even a sans serif, I’d suggest Georgia as a much more readable and truly attractive web face. Of course I know that it looks no better on a PC than Times, but on a Mac Georgia, whether on the front page of The New York Times or someone’s blog, is beautiful.\n\n[http://typographyshop.com](http://web.archive.org/web/20081206012905/http:/typographyshop.com/ \"http://typographyshop.com\")  \n [http://kinggroupmedia.com](http://web.archive.org/web/20081206012905/http:/kinggroupmedia.com/ \"http://kinggroupmedia.com\")\n\n"
    },
    {
      "time": " 6.Sep.2008 8.52pm",
      "content": "<cite>Of course I know that [Georgia] looks no better on a PC than Times....</cite>\n\nWhat? That’s completely false.\n\n"
    }
  ]
}
