{
  "id": "48782",
  "title": "(x) Bold sans in ComputerArts issue 111 double page spread (pages 6-7) - Scene {H Johnston}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Don’t know how many people have got this issue, but I am wondering about a font on the blue double page spread (pages 6-7). On these pages there are quotes from famous font designers, I guess in their own typefaces, the one I want to know about is the quote by Adrian Frutiger, I am not sure which on of his fonts this is. It is quite tall and the arms of the “E”s seem to have a slight angle to them. Anyone know what this font is?\n\nThanks in advance!\n\n [‹ hi i need help identifying this stencil font](http://web.archive.org/web/20080913040132/http:/typophile.com/node/48820 \"Go to previous forum topic\") [1st edition Portnoy's Complaint dust jacket ›](http://web.archive.org/web/20080913040132/http:/typophile.com/node/48809 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080913040132/http://typophile.com/user/21212\" title=\"View user profile.\">viceversarohan</a>",
  "time": "<br>",
  "uid": "21212",
  "comments": [
    {
      "time": " 26.Aug.2008 12.44am",
      "content": "I have this issue at home I will check it out.\n\nEvery time I buy that magazine I am deeply disappointed, the design is terrible and the tips are quite random in there nature. I get the impression that the magazine is set up to help students, however their step by step tutorials are all about reproducing what’s cool. Other magazines such as Graphic — which I love — and the rare ’typographic’ both give insights into the minds of great designers, discussing thought processes which is infinitely more useful for young designers, and older ones.\n\nNow you might well be saying “why buy the magazine?”, which is fair enough, and the answer is that it only costs me $4 and occasionally there is something interesting.\n\nNow while I am on my rant my I bring up another point regarding computer arts. I have noticed in the last few issues they have started copying a headline style which I first saw in an issue of POL OXYGEN designed by Frost design Sydney. The issue won SPD silver award. Now computer arts just copys it.\n\nI will try to post up the font reference and the plagiarism.\n\n"
    },
    {
      "time": " 26.Aug.2008 1.08am",
      "content": "If you want an ID post an image.\n\n"
    },
    {
      "time": " 26.Aug.2008 3.32am",
      "content": "Please post a sample, this is getting nowhere. :^)\n\n"
    },
    {
      "time": " 26.Aug.2008 3.37am",
      "content": "Here is the image\n\n ![](http://web.archive.org/web/20080913040132im_/http:/typophile.com/files/the-most-important-thing_6318.gif)\n\nHi, I am pretty sure the font is [Scene Black](http://web.archive.org/web/20080913040132/http:/www.myfonts.com/fonts/agfa/scene/black/)\n\nI used [what the font](http://web.archive.org/web/20080913040132/http:/www.myfonts.com/WhatTheFont/) it’s very handy.\n\nHere is a spread from the Pol Oxygen mentioned above (bad scan, this mag folds out on the y and the x axis). The grid used for the headline is actually the same grid used for layout throughout the mag.\n\n ![](http://web.archive.org/web/20080913040132im_/http:/typophile.com/files/pol-oxygen_5311.jpg)\n\nHere is the poor copy from computer arts.\n\n ![](http://web.archive.org/web/20080913040132im_/http:/typophile.com/files/comp-arts_5467.jpg)\n\n"
    },
    {
      "time": " 26.Aug.2008 10.32pm",
      "content": "Wow guys thanks for the response, sorry for not posting an image earlier, thanks to h johnston for filling in the gap. Scene black...I’ll check it out...and yeah computer arts isn’t always good, I just picked up this one because it seemed to have some interesting articles in it.\n\nThat really is a blatant rip off!\n\n"
    }
  ]
}
