{
  "id": "48780",
  "title": "questions on Japanese Typography",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "_[I posted this elsewhere, but figured I might have more luck here. I noticed an earlier thread on a similar subject, but it didn't satisfy my throbbing needs.]_\n\nDoes anyone here have experience working as a designer in Japan, on Japanese-language material? I'm wondering idly about a couple of things:\n\n**1. What are some of the staple fonts in Japan?** In countries that use writing based on the Roman alphabet, a list of staple fonts might include the likes of Helvetica, Univers, Franklin Gothic, Futura, Garamond, and Bodoni. (Not an authoritative list, I am not a lawyer, etc.) These fonts are resilient and have been in heavy use for a while. What are some of Japan's?\n\n**2. Are there any Japanese fonts in heavy use that pro designers consider embarrassing?** Are there analogs to our Arial, Comic Sans, Curlz MT, and Papyrus?\n\n**3. What are the top-level font categories in Japanese type?** In western countries, we've got serif and sans-serif, and then subdivisions within those (geometric sans vs. humanistic, old-style serif vs. transitional vs. modern, etc). What about in Japan? Funnily enough, it looks like you guys have a serif vs. sans distinction too. Fonts that imitate brush-stroked kana look like they have little serifs, while other, more contemporary fonts don't. Is that right? How do you begin to categorize your fonts?\n\n**4. Do most fonts include tons of kanji, or just the kana?** (Man. I would not want to be a Japanese typographer.)\n\nJust asking out of curiosity. I took Japanese for a year in college a long while ago and I've been wondering about these things on and off since I became a designer.\n\n",
  "author": "baloo",
  "time": "25 Aug 2008 — 9:27pm",
  "uid": "35964",
  "comments": [
    {
      "time": "26 Aug 2008 — 12:18am",
      "content": "I'm hardly an expert, but I do look around the Japanese font sites from time to time, so I'll answer what I can.\n\n4. Out of necessity, text fonts will include fairly comprehensive kanji, whereas this is rarely the case for display and decorative fonts, which there are many. They often only have one set of the kana or the other (hiragana or katakana), but sometimes there are both in separate font files, and also a matching Roman font to go with them.\n\nJapanese text fonts are certainly available, but much less common than those for scripts with smaller character sets. If your operating system is capable of displaying Japanese, it will usually include a square-stroked font that complements sans-serif roman type, and a contrasty stroked font with brush ticks on the strokes that complements roman serif fonts. I'll have to dive through my font menu to find the names of the ones I have.\n\n"
    }
  ]
}
