{
  "id": "48787",
  "title": "Radio Station Logo",
  "forum": "tommartin's blog",
  "tags": [

  ],
  "content": "Here is a concept for a pop radio ststion branding.  \nTargeted at the youth market I wanted something vibrant and bold.\n\nLove to hear your thoughts\n\n ![](http://web.archive.org/web/20080913040156im_/http:/typophile.com/files/Untitled-1_4321.jpg)\n\n",
  "author": "<a href=\"/web/20080913040156/http://typophile.com/user/35935\" title=\"View user profile.\">tommartin</a>",
  "time": "<br>",
  "uid": "35935",
  "comments": [
    {
      "time": " 26.Aug.2008 4.57am",
      "content": "101 FM ALIVE WITH MUSIC -FONT TO BE RE LOOK AT IT & THE COLORS, DESIGN CAN BE MORE VIBRANT COLORS\n\n"
    },
    {
      "time": " 26.Aug.2008 6.01am",
      "content": "Where is it?\n\n"
    },
    {
      "time": " 26.Aug.2008 6.10am",
      "content": "Here it is (the original post has a CMYK image).\n\n ![](http://web.archive.org/web/20080913040156im_/http:/typophile.com/files/Untitled-1_4321_3920.jpg)\n\n"
    },
    {
      "time": " 26.Aug.2008 6.34am",
      "content": "I like it!\n\nDoes it read HUB?\n\nDo you have a concept? I’m curious.\n\n;-)\n\n"
    },
    {
      "time": " 26.Aug.2008 6.58am",
      "content": "Hey  \nIts reads as HUB, I was just experimenting with repeating patterns and optic illusions.  \nI wanted something edgy and bold, that will catch your eye when viewed.  \nIve created a typeface off of the logo as well.\n\n"
    },
    {
      "time": " 26.Aug.2008 7.08am",
      "content": "I think it looks pretty good and I like the concept but I’m wondering if maybe it’s a little _too_ hard to read.\n\nAnother thing to think about is how small will this be replicated. It’s quite likely that on a business card the small lines may not hold up. You could test it by printing one out at an inch wide or so.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n[Tylor j Reimer DOT com](http://web.archive.org/web/20080913040156/http:/www.tylorjreimer.com/)\n\n"
    },
    {
      "time": " 27.Aug.2008 6.00am",
      "content": "I agree with tylor. Make that logo about 1/4” and see what you get. If you absolutely want all those lines, then I would consider two versions with a more simple version for certain uses. If you do that, be sure and address in your usage guide precisely when each version gets used. Better yet, I would simplify it to work in all circumstances or you will wind up with the wrong one all the time. It is just human nature for clients to get it wrong.\n\nI did not see the word Hub at all.\n\n"
    }
  ]
}
