{
  "id": "48794",
  "title": "typical 80s sans serif",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "any ideas?  \nThanks so much!\n\n",
  "author": "umily",
  "time": "26 Aug 2008 — 8:07am",
  "uid": "27485",
  "comments": [
    {
      "time": "26 Aug 2008 — 8:38am",
      "content": "I just flipped through some 80s-publications: Helvetica.  \ndoes Helvetica count as typical for anything?\n\nlate 80s: Futura (Bold, uppercase), [Industria](http://web.archive.org/web/20150227021859/http:/www.myfonts.com/fonts/adobe/industria/), [Insignia](http://web.archive.org/web/20150227021859/http:/www.myfonts.com/fonts/adobe/insignia/)\n\n"
    },
    {
      "time": "26 Aug 2008 — 9:57am",
      "content": "At the time, I used mostly Helvetica, Futura, and Avant Garde.  \nBut those were designed earlier, and have had sustained usage.\n\nSo I would say, Laudatio (1982), which was quite popular at the time, but not much afterwards -- although it is presently being used by Tim Hortons.\n\n"
    },
    {
      "time": "26 Aug 2008 — 10:32am",
      "content": "I love Laudatio, but have trouble seeing it as a sans.\n\nIn the 80s I was still mostly cloistered in the world of making bitmap  \nfonts, so I have no recollection of what sans fonts were popular. Whew.\n\nhhp\n\n"
    },
    {
      "time": "26 Aug 2008 — 10:58am",
      "content": "I think I was using Gill Sans on pretty much everything. That was my Gill Sans period. Now I can't stand to use it.\n\n-- K.\n\n"
    },
    {
      "time": "26 Aug 2008 — 11:03am",
      "content": "_...have trouble seeing it as a sans._\n\nTrue, a near-sans.\n\nHow about Symbol? Benguiat Gothic?  \nNot really pure sans either.\n\n_...what sans fonts were popular._\n\nNot a lot. The action was serific.\n\n"
    },
    {
      "time": "26 Aug 2008 — 5:53pm",
      "content": "Univers Italic (see April Greiman's work). I second Insignia.\n\n"
    },
    {
      "time": "26 Aug 2008 — 8:01pm",
      "content": "Hi everyone,\n\nI third Insignia! ;-D\n\nAnd I'd have to nominate Futura Condensed as a very '80s sans serif. Yeah, I know it's been around and in use a long time, but it seemed to me that it was EVERYWHERE during the Me Decade.\n\nAvant Garde was still getting a lot of use, but to me that's a quintessentially '70s sans serif.\n\nHelvetica was everywhere too, but to me that doesn't exactly count because to most people back then, it was a \"default\" \"block style\" font. Heck, until the Mac made its debut in 1984 I had never heard of the word \"font\" except in the baptismal sense! ;-)\n\nCheers,  \nJohn the Fontaholic\n\n"
    },
    {
      "time": "26 Aug 2008 — 8:30pm",
      "content": "A little bit about [Industria](http://web.archive.org/web/20150227021859/http:/www.shinntype.com/Writing/Industri.pdf).\n\n"
    },
    {
      "time": "26 Aug 2008 — 9:33pm",
      "content": "\"Brody rapidly constructed the typeface later named Industria, and debuted it throughout The Face in July. What a leap, and so rare: an art director designing a typeface for his own magazine.\"\n\nActually Industria seems to be based closely on some student work from the first half of the 20th century, specifically from the Stuttgart School of Decorative Art. See page 105 of \"130 Alphabets & Other Signs\" by J Rothenstein & M Gooding.\n\nhhp\n\n"
    },
    {
      "time": "27 Aug 2008 — 12:00am",
      "content": "I've seen other putative precusors too.  \nBut the similarity is likely a coincidence, as the design principal of the face is so simple.\n\nSomething similar happened to me. After I had designed Eunoia, I discovered that patricking had beaten me to the punch with a somewhat similar \"exercise in pure geometry\", Fast Girls.\n\n"
    },
    {
      "time": "27 Aug 2008 — 12:55am",
      "content": "futura condensed bold, industria, typeface six.\n\ndr\n\n"
    },
    {
      "time": "27 Aug 2008 — 7:45am",
      "content": "\\> But the similarity is likely a coincidence\n\nThat's possible. See attached. Are any of the ones you've seen this close?\n\n ![](http://web.archive.org/web/20150227021859im_/http:/typophile.com/files/PreIndustria_5338.gif)\n\nhhp\n\n"
    },
    {
      "time": "27 Aug 2008 — 10:02am",
      "content": " ![](http://web.archive.org/web/20150227021859im_/http:/typophile.com/files/sq_3811.jpg)\n  \nThis is Dutch, anon., c.1935.\n\nAlso caps, Morris Benton's [Raleigh Condensed.](http://web.archive.org/web/20150227021859/http:/www.fonthaus.com/products/fonts/view.cfm?sku=GT002661)\n\nPerhaps there is some influence of Soviet constructivism, e.g. Rodchenko's \"CPAZY\" poster lettering:\n\n ![](http://web.archive.org/web/20150227021859im_/http:/typophile.com/files/149_4607.jpg)\n  \nBTW, isn't that logo for GUM neat? The same idea is currently appearing as section heads in Wired!\n\nBut really, I doubt Neville directly referenced earlier sources. Look at your own experience with bitmaps, Hrant, there's not much room to move within strict constraints.\n\n\\*\\*\n\nIndustria wasn't available as a font until 1990, and there was nothing else like it available during the 80s, so can it be considered typical, even though it is iconic?\n\n"
    },
    {
      "time": "27 Aug 2008 — 10:05am",
      "content": "\\> there’s not much room to move within strict constraints.\n\nTrue, but there's a \"genetic\" difference between a constraint coming from a medium (lo-res screen) versus a constraint that somebody dreams up: unlike the former, the latter can possibly been inspired by another designer's work. As in \"Oh, that looks like an interesting constraint - let me see what I can do with that\". Unlike in bitmap fonts, Industria had no \"inherited\" constraints. That said, I do agree that Industria could very well be \"original\".\n\nhhp\n\n"
    },
    {
      "time": "27 Aug 2008 — 10:33am",
      "content": "\\> Perhaps there is some influence of Soviet constructivism, e.g. Rodchenko’s poster lettering  \nBrody stated something like that in an interview with Der Spiegel (1988 or ’89).\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:53pm",
      "content": "_Brody stated something like that in an interview with Der Spiegel (1988 or ’89)_\n\nHe didn’t state it but it said in that article that books about russian constructivism could be spottet on the shelves in his studio.\n\n"
    },
    {
      "time": "27 Aug 2008 — 8:13pm",
      "content": "Ubiquitous and in the background: Helvetica, Univers, and still a lot of Avantgarde\n\nWhat I used most: Futura - all weights, (think extrabold caps, bold ital u/l, bold condensed, light all caps) - it felt rebellious and new wave against the not exactly sans, but very prevalent Souvenir, Stymie, etc., also some Gill Sans\n\nWhat I was very excited about because they were so hard to get - mostly on typositor: Radiant, Empire\n\nRepresentative but very hard to get: Insignia, Industria\n\nA lot of condensed type.(Think Univers Ultra Condensed)\n\nThe fun of phototype: condensing type, letterspacing it.\n\nThe fun of the photocopy machine: distressing it\n\n"
    },
    {
      "time": "31 Aug 2008 — 2:40pm",
      "content": "Stop is the 80s font for me...  \nAnd all forms of ugly cuts of [Garamond and similar](http://web.archive.org/web/20150227021859/http:/www.365questions.org/wp-content/uploads/2007/06/ticosbyad.jpg).  \nagree with vivicity: avantgarde, Futura Bold/Xbold, and souvenir...\n\n"
    }
  ]
}
