{
  "id": "48802",
  "title": "Legality of altering typefaces",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have just started a new job at a university designing for the art and architecture departments. the art and architecture departments want me to make something very cutting edge, but the graphic standards of the university are very stringent...i can only use akzidenz and melior. akzidenz i can deal with, but i am not particularly crazy about melior especially because it only has two weights. would i be legally able to create additional weights based on the medium and bold or should i just grit my teeth and bear it?\n\n [‹ Frutiger Issue](http://web.archive.org/web/20081122070829/http:/www.typophile.com/node/48816 \"Go to previous forum topic\") [French typography - i need help ›](http://web.archive.org/web/20081122070829/http:/www.typophile.com/node/38947 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081122070829/http://www.typophile.com/user/7018\" title=\"View user profile.\">minimum</a>",
  "time": "<br>",
  "uid": "7018",
  "comments": [
    {
      "time": " 26.Aug.2008 1.46pm",
      "content": "Linotype’s EULA does not allow modifications. You would need to contact them directly, license information in hand, and ask them to modify it for you.\n\n"
    },
    {
      "time": " 26.Aug.2008 2.25pm",
      "content": "This is a little concerning to me, as I have recently (and innocently) outlined Franklin Gothic and tugged at the vector anchors to create an altered version of it. I am with an in-house art department, and we have recently printed a relatively small run of bumper stickers and buttons using the letterforms I (sort of) created. Am I about to get in big trouble? Should I have kept my mouth shut?\n\nIs there a law against using a typeface as a model for letters I wish to create?\n\nIs it really illegal if I’m not selling it or claiming that it’s 100% my own creation?\n\nI’m hoping that at the very most somebody is going to slap my hand and tell me not to do it again.\n\n ![](http://web.archive.org/web/20081122070829im_/http:/www.typophile.com/files/OVspf_bttn_ILikeMilk08_6555.png)\n\n"
    },
    {
      "time": " 26.Aug.2008 2.56pm",
      "content": "Koppa, did you alter all the glyphs or just the ones you needed? The original poster needs/wants a whole new weight of an existing face and be able to use it as a font in any program.\n\nWhat you did was change the letters into outlines and use them as art, sort of like customizing a letter for use in a logotype. Most EULAs account for that type of use. The graphic design is 100% your own creation, but I would mention in your portfolio that your lettering is “customized Franklin Gothic” or something of that sort. Give credit where credit is due.\n\nDavid\n\n"
    },
    {
      "time": " 26.Aug.2008 3.18pm",
      "content": "Adnix is right, Koppa. Taking a few letters in Illustrator and then tweaking them is not (usually) a problem. Creating a new typeface is the problem in this instance. There are foundries, such as Adobe, which allow modification for internal use.\n\n"
    },
    {
      "time": " 26.Aug.2008 3.21pm",
      "content": "Melior is available from Adobe, and they allow modifications, so if you can get a license from them, you should be okay.\n\n"
    },
    {
      "time": " 26.Aug.2008 3.27pm",
      "content": "\\> You would need to contact them directly, license  \n\\> information in hand, and ask them to modify it for you.\n\nFirst, ask them to let you modify it yourself (reassuring them that the new fonts will not leave your hard disk). Tell them that you will be forced to use another font if you can’t have a demi of Melior in 3 days. Tell them that if they can’t do it that fast and they don’t give you their blessings, oh my, you don’t know _whatever_ shall you do...\n\nAll this however assumes that you can do the job well. While in Boston in April I witnessed a font utterly butchered by a designer doing high-profile work for MIT; I found the guy and told him to please stop.\n\n\\> Melior is available from Adobe, and they allow modifications\n\nAh! As far as you know your Melior is now from Adobe...\n\n—\n\nThis is how reasonable people deal with unreasonable EULAs.\n\nhhp\n\n"
    },
    {
      "time": " 27.Aug.2008 7.12am",
      "content": "Thank you for the clarification. Very helpful, as always.\n\n"
    },
    {
      "time": " 27.Aug.2008 12.27pm",
      "content": "\\>art and architecture departments\n\n\\>i can only use akzidenz and melior.\n\nThere’s _always_ a loophole - how about hand lettering?\n\n"
    }
  ]
}
