{
  "id": "48826",
  "title": "ITC Garamond vs Adobe Garamond",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "i know its abit simplistic to ask \"what best\" out of these two, but what is the general consensus, what does everyone prefer?...i cant decide...\n\n",
  "author": "leif",
  "time": "27 Aug 2008 — 2:25am",
  "uid": "25735",
  "comments": [
    {
      "time": "27 Aug 2008 — 2:51am",
      "content": "Hi Neill,\n\nyou might wanna check out the [Garamond](http://web.archive.org/web/20150418200002/http:/www.typophile.com/wiki/Garamond) wiki entry and the linked threads there.  \nTo put it in a nutshell, I’ll quote [Patty](http://web.archive.org/web/20150418200002/http:/www.typophile.com/node/33124):  \n<cite>Not ITC</cite>.  \nF\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:15am",
      "content": "thanks!, that link to the previous thread was super helpful...will go and check out the wiki entry...  \nthanks again!\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:30am",
      "content": "And don’t forget that some of the best versions of Garamond are not even called Garamond at all — Jean-François Porchez’s Linotype Sabon Next, for instance.\n\n"
    },
    {
      "time": "27 Aug 2008 — 4:08pm",
      "content": "Augereau.\n\n"
    },
    {
      "time": "27 Aug 2008 — 4:41pm",
      "content": "I will go to my grave saying that, although ITC Garamond is not a design for purists, it is an incredibly useful, space-saving, generous, incredibly readable typeface. It is especially useful in its wonderful multiple master version from Adobe. A fabulous font to print with when you need a large x-height take on Garamond.\n\nI love Monotype Garamond, which as we know is not Garamond, but Jannon. The digital version is too light, but you can easily create a darker version by interpolating the regular with the bold or semi-bold in Fontographer or Fontlab. As with all Garamonds, it should be used with its full complement of f-ligatures.\n\nI've never been convinced by Adobe Garamond -- though it was great at 300 dpi in its day. Look instead at Adobe Garamond Premiere Pro by the same designer, a much more mature design, representing a decade of painstaking work, and with the additional bonus of optical sizes. It was designed to be used as two multiple masters - - one multiple for text, one for display. There was too much design difference to do it as a single multiple master. When will we say it as it was intended to be seen?\n\n"
    },
    {
      "time": "28 Aug 2008 — 12:21am",
      "content": "Garamond Premier's development did start as an MM font with an intermediate master (IIRC), but in the end was developed as four separate MMs -- one for each of its optical sizes (i.e. Caption, Text, Subhead and Display). Well, in fact that's eight if you count italic!\n\n"
    },
    {
      "time": "28 Aug 2008 — 12:37am",
      "content": "It is indeed a really complicated thread.\n\nI can only speak to myself, for this kind of answer asks a great deal of subjectivity, but in my humble opinion ITC Garamond is a denatured Garamond, a skilled but very personnal, time / era anchored redesign of the original type, best suited for the advertising age of the seventies and bound to the crazy-large x-height trend which was very fashionable at the time. I can't help but cringe each and every time I see it somewhere. Adobe Garamond, while not the best out there, is far superior, when compared to the original 16th century model.\n\nThis being said, you might also check these ones for they are much closer to the original Garamond: Sabon (by Tschichold, not Porchez' Sabon next, which is really loosely based on Garamond), Stempel Garamond (more harsh and \"vintage\" looking) - and if you are tempted by the feeling of ye olde printing press, you might also take a look at Tribute (though it's more like a well done joke, but still might be useful). I still have to make my mind about Adobe Garamond Premier. I won't even begin to talk about Monotype Garamond for it is an absolute shame.\n\ndr\n\n"
    },
    {
      "time": "28 Aug 2008 — 5:53am",
      "content": "\\>Garamond Premier’s development did start as an MM font with an intermediate master (IIRC), but in the end was developed as four separate MMs — one for each of its optical sizes\\<\n\nWow! In the late '90s, it was still only two separate MMs. Four MMs for each of four optical spaces must be a record. However, it is the only way to do it if you want to have perfectly optimized type and the utmost flexibility within each space. The technical icing on the cake would be intermediates within the four separate variable optical spaces?\n\nSo, I assume the ideal human interface would be:\n\n1. You have the four separate MMs.\n\n2. The layout program automatically selects which MM is correct and then further adjusts for the exact point size of the text.\n\n3. You then have convenient sliders in your formatting bar to allow you to select the precise weight you want, or to override the automatic optical selection. There could be a checkbox for 'override automatic selection'.\n\nThe important thing is to conceal the perversely counterintuitive numbering system from 100 to 1000. A slider control does that handily. I don't know why the 100 to 1000 arrangement proved so difficult to deal with, but it did. No matter how familiar you were with it, it never felt comfortable. Strange.\n\nDavid, I feel your pain, but all issues of authenticity aside, I think a lot of lovely books have been printed in Monotype Garamond, especially in the jewel-like smaller sizes. Would you like it better if it wasn't called Garamond but Jannon? Monotype has spent nearly 80 years apologizing for the confusion, so I don't see that they should be blamed for it anymore. Also, I can see your objection to ITC as an annoying 70s-ish display face, but I can't say what the problem is as a small text face. The large x-height is also typical of small sizes of most Monotype (and Linotype) metal faces. The major problem with ITC Garamond for me is that it is usually set too light. But if you are lucky enough to have the Adobe MM, you can set any weight you like, even using small weight gradations to get some nice optical effects (i.e. if you 11 point text and 9 point indented quotes, you would simply dial a hair more weight (and width?) for the 9 point text to correct colour. I guess part of ITC Garamond's appeal to me is just that the MM version does, in fact exist - - it's an available tool, so why not use it? Well, and because it's a fun toy. And because it has the distinction of being the first MM offered with an intermediate axis. But I realize I'm beginning to sound too much like a hobbyist. Still, I do think that technical things should be, whenever possible, fun.\n\n"
    },
    {
      "time": "28 Aug 2008 — 7:09am",
      "content": "Speaking of ITC Garamond, here's a funny piece by Michael Bierut:\n\n[http://www.designobserver.com/archives/entry.html?id=205](http://web.archive.org/web/20150418200002/http:/www.designobserver.com/archives/entry.html?id=205 \"http://www.designobserver.com/archives/entry.html?id=205\")\n\nAlso check some interesting technical and historical remarks by J. Hoefler on the comments.\n\n"
    },
    {
      "time": "28 Aug 2008 — 8:34am",
      "content": "I think Jonathan Hoefler got it quite right in his comment:  \nThere’s Garamond and there’s \\*\\*\\*\\*-Up Garamond and it depends which one is which.  \n;-)\n\n"
    },
    {
      "time": "28 Aug 2008 — 10:51am",
      "content": "I stopped using either in the mid '90s, it was time to move on.  \nSo I don't know how much relevance my experience with them would have today.  \nGenerally, I used the whole family of Adobe Garamond; with the \"Expert\" fonts it was my go-to face for all the complexities of traditional typography.  \nI think today that kind of usability has been surpassed by faces like Arno, with all its optical sizes and other features and glyph sets, and Atma, with all its small cap options.  \nI rarely used the normal width of ITC Garamond, but the Condensed styles were brilliant, especially if you wanted to create an imposing headline and there was too much copy. Not only is it condensed and with a big x-height, but you could squish it even more without that looking too obvious.  \nOn occasion, I used both Adobe and ITC Garamond Condensed in the same job.\n\n"
    },
    {
      "time": "28 Aug 2008 — 11:12am",
      "content": "That thread is fabulous. OK - - set all the available versions at 7-9 points and tell me which is the most pleasant to read. I don't want to go out further on a plank here, but, I also think Souvenir has considerable virtues. I know it was the most reviled font of the tasteful '90s, but - - - it fits together with such harmonic felicity - - presents such a gloriously even color - - what other design comes close? I don't want to see it, I don't want to set it, but I do think it has virtues we could all learn from. And seriously - - now that ITC has no clout whatsoever - - we have to rescue its gems from obscurity. What about the Jenson revival - - forgot its name - - Golden Cockerel - - Founders' Caslon - - and of course the one text font that can really be taken seriously by purists, ITC Bodoni.\n\n"
    },
    {
      "time": "28 Aug 2008 — 7:35pm",
      "content": "\\> ITC Garamond ... incredibly readable\n\nBill. Lock your doors. I'm coming over  \nto knock some sense into you right now.  \nExtenders aren't just decoration; they  \nplay a key role in reading. Legibility  \nis one thing, readability quite another.\n\nFurthermore, a font leaves its impression not just through things like the exact shape of its terminals, etc. It also leaved its impression based on vertical proportions. Monotype Garamond, even though it's a Jannon, is more of a Garamond than that goddam obese cyclops.\n\nhhp\n\n"
    },
    {
      "time": "28 Aug 2008 — 9:01pm",
      "content": "Look at the ITC revivals of Bookman, Caslon, Cheltenham (all by Benguiat). It’s all about style. The 50ies were post-war. The 60ies were trying out. The 70ies were starting all new from zero. The most stylish decade of all in that century. The 70ies were idealistic. Utopia (not the font!). They had guts and they failed. ITC Garamond can only be discussed within its historical context.\n\n"
    },
    {
      "time": "31 Aug 2008 — 5:09pm",
      "content": "\\> ITC Garamond can only be discussed within its historical context.\n\nAbsolutely. But you could say that of any font. What about a font that does not seem yet to have had a period, such as Steile Futura/Topic?\n\n\\>Monotype Garamond, even though it’s a Jannon, is more of a Garamond than that goddam obese cyclops.\n\nHrant, I don't worry about whether ITC is a Garamond or not. No modern Garamond is a Garamond. I just think ITC G is a useful font. Like metal Plantin -- also not a Garamond -- but my how many wonderful books were printed with it. Now there's a great design still looking for a decent digital revival.\n\nAlso, Hrant, look at some more metal in really small sizes. Obesity aids legibility at small sizes. And that ain't theory!\n\nRegarding historical context, that can be technical. For example, Adobe Garamond first release was designed very much with the 300 dpi printer in mind -- as was Hoefler Text. I have dug up some old correspondence with Carol Twombly from 1998 in which it is apparent that Garamond PP in its then-state had only two multiple masters -- with 24 pt being the breakover as I recall.\n\nWhen you start talking about four multiple masters for a single font family, I really think what Sumner Stone has figured out for Cycles makes more sense. And you can understand the numbers. That helps!\n\n"
    },
    {
      "time": "31 Aug 2008 — 6:19pm",
      "content": "Sorry Bill, old, obvious rehash.\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2008 — 12:13pm",
      "content": "The historical context of any work of art is important, but someone once said \"It's not great art unless it's timeless.\"\n\nGiven that, ITC Garamond, like the clothes I wore when I used that face back in the day, will forever be linked to a very short period in which it looked appropriate.\n\nFor a much more attractive version look at Apple's ITC commissioned redesign of their own private version of the face. So many computer companies were using ITC Garamond that Apple wanted their usage to be unique. (Volkswagen did the same with Futura)\n\nI used to use Simoncini Garamond quite a bit. It's a slightly lighter redraw of Italian Garamond from what I can tell. A quick search found this thread here: [http://typophile.com/node/20299](http://web.archive.org/web/20150418200002/http:/typophile.com/node/20299 \"http://typophile.com/node/20299\")\n\n[http://typographyshop.com](http://web.archive.org/web/20150418200002/http:/typographyshop.com/ \"http://typographyshop.com\")  \n [http://kinggroupmedia.com](http://web.archive.org/web/20150418200002/http:/kinggroupmedia.com/ \"http://kinggroupmedia.com\")\n\n"
    },
    {
      "time": "6 Sep 2008 — 1:53pm",
      "content": "Patrick, I think I'm in the majority (I mean of people who  \neven notice these things of course) when I say that Apple's  \nGaramond is even worse than the parent ITC version.  \nCertainly very few people would call it \"timeless\"...  \nApparently not even Apple thinks it was, since they  \ndumped it!\n\nAnd if Apple wanted to be unique, they should have  \nsimply steered clear of Garmond/Jannon to begin with.\n\nEspecially over the past few years, Apple has had an  \nentirely undeserved reputation as caring about type,  \na reputation that continues to cloud the judgment of  \nmany, even many years after the painful truth has  \nbecome so apparent.\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2008 — 2:19pm",
      "content": "<cite>Especially over the past few years, Apple has had an<br>\nentirely undeserved reputation as caring about type…</cite>\n\nIt’s not just type; Apple’s reputation for design is undeserved in plenty of other areas. Apple design gets so much love not because it’s especially good, but because everyone else in the industry is so much worse!\n\n"
    },
    {
      "time": "6 Sep 2008 — 2:32pm",
      "content": "But also, Apple plays too much to vanity and sensationalism, which detracts from substance. There is always some limit to how much caring one can spread around, and when you care too much about the sheen on that laptop's titanium lid...\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2008 — 4:14pm",
      "content": "Oh Hrant, don't make Apple into another windmill. Of course there is much to criticize, but . . . . for heaven's sake, the things they do! Here's something I wrote when I reviewed the 2nd generation G5:\n\n\"When Apple's G5 first came out in June, 2003, a group of design engineers at one of the three largest PC manufacturers took it apart to see what Apple was up to. Providentially, MacDirectory had a fly on the wall at this critical moment. There were murmurers of excitement as each refinement in engineering and manufacturing was discovered. Finally, one of the engineers noticed that where the case turns over at the top, the holes in the case were not elongated. That means they had been drilled after the metal had been turned, an expensive refinement. \"But we couldn't build something like this for under six  \nthousand dollars!\" he said -- and there was a moment of stunned silence.\"\n\nOn the other hand, Hrant, I take that back. Recently I awarded their 17-inch MacBook Pro but naughtily pointed out that it took Apple something like 8 years longer than Dell to provide 133 dpi screens in a laptop -- and Dell does it at a third of the price. Apple PR hasn't talked to me since. It's always been an obnoxious company, and it gets more so the more successful it is. But when you look at something like Vista, or Word 2007, aren't you glad that Apple exists? That fundamental commitment to intuitive comprehensibility is really wonderful. Go to the MS support site for help. You'll need the patience of a PhD candidate to wade through the inept scribbling. Now go to Apple's support site. Bliss, by comparison! Yes, they're wilful, paranoid, rude, ungenerous, nasty. But it's still a wonderful company.\n\nTo get back to topic, I must say, I still think the only Garamond available that makes beautiful books is Monotype metal. Who cares if it's Jannon? Know what? Jannon's smallest sizes are better than Garamond's. Garamond's greatest genius is in the 18+ point sizes. Meantime, when are we going to get a great digital Plantin? (just as homogenized a Garamond as Tony Stan's ....) What a lot of great books have been printed in the metal . . . .\n\n"
    }
  ]
}
