{
  "id": "48823",
  "title": "What is the best version of Caslon?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There seems to be so many versions. I am designing a book with Caslon Book and would like to pull out some quotes, parts of which are in italic. Caslon's italic looks a bit messy to me. Any suggestions would be greatly appreciated. Thank you ...\n\n",
  "author": "cmlewis",
  "time": "26 Aug 2008 — 11:17pm",
  "uid": "27332",
  "comments": [
    {
      "time": "27 Aug 2008 — 2:43am",
      "content": "Hi Carolyn,\n\nwhich Caslon Book?  \nCheck out the [Caslon](http://web.archive.org/web/20150123173029/http:/typophile.com/wiki/Caslon) wiki entry and the linked threads there.  \nF\n\n"
    },
    {
      "time": "27 Aug 2008 — 2:47am",
      "content": "For pull quotes I'd use Big Caslon. The roman is available from several sources (if you have a Mac it came with the system). Big Caslon Italic is harder to come by: contact Carter & Cone for that: [http://www.carterandcone.com](http://web.archive.org/web/20150123173029/http:/www.carterandcone.com/ \"http://www.carterandcone.com\")\n\nAnother possibilities are Caslon 540 and [King's Caslon.](http://web.archive.org/web/20150123173029/http:/www.daltonmaag.com/browse/fonts/dama/kingscaslon/typo)\n\nSomeday the long awaited William's Caslon, from our very own William Berkson, will be available. (Nudge, nudge William.)\n\n"
    },
    {
      "time": "27 Aug 2008 — 2:48pm",
      "content": "[ITC Founder's Caslon](http://web.archive.org/web/20150123173029/http:/www.myfonts.com/fonts/itc/founders-caslon/) by [Justin Howes](http://web.archive.org/web/20150123173029/http:/typophile.com/wiki/Justin%20Howes) is supposed to be a faithful representation of Caslon's metal types, so it can probably be considered the best in that respect.\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:12pm",
      "content": "Thank you for your comments ...\n\nMy version comes up as: CaslonBookBE. I also have Adobe Caslon on my current Mac. Is one better than the other?\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:13pm",
      "content": "Oh, and a version called: CaslonBookBE Expert ...\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:14pm",
      "content": "Try to find the article in Serif Magazine about all the Caslons.\n\nhhp\n\n"
    },
    {
      "time": "27 Aug 2008 — 4:05pm",
      "content": "CaslonBooKBE is a Berthold font:Caslon Book. It's quite different from the Adobe cut. The Berthold face is a bit darker and has shorter descenders. I like the Adobe cut better, but if I was setting small type, say 8 point, I might use the BE font.\n\n"
    },
    {
      "time": "27 Aug 2008 — 4:07pm",
      "content": "I think Lange's versions of many of the classic typefaces like Caslon are very nice in extended text settings at sizes around 10 and 11 pt. I prefer Caslon Book to Adobe Caslon, and Baskerville Book to Storm or ITC's versions. I also think the Berthold Bodonis are quite nice.\n\n"
    },
    {
      "time": "27 Aug 2008 — 4:20pm",
      "content": "Berthold text fonts are typically optimized for 9 pt rather than everyone else's 12 pt. Adobe Caslon is designed for 8-14 and is best at 10-12. I think it's my favourite of all the Adobe text faces, a great triumph for Twombly and of course the art director for the Originals in those days, Sumner Stone. I love Berthold fonts as a rule, but I remember being disappointed by the Caslon. The comments here make me want to have a new look -- it's been years. But just look at how well Adobe Caslon works in the New Yorker. Perfectly credible, graceful, transparent. Happy, even. Very few fonts give me that feeling, other than Sumner Stone's Cycles family.\n\nAs Ryan says, the Berthold Bodonis are very much worth looking for. One's basically for display, very high contrast, and another - - I forget the name - - Antiqua? Classic? something? - - is absolutely sensational in text - - setting even more fluently than Sumner Stone's ITC Bodoni 12. But I hate the g - - and for that reason would always use ITC Bodoni, which has the additional advantage of small text and display sizes. But if the g doesn't bother you . . . .\n\n"
    },
    {
      "time": "28 Aug 2008 — 2:40am",
      "content": "There are a couple of recent Font Font efforts in this area, I forget the names now, but I looked at them some last year. One was very high contrast and I felt was a candidate for display work, but in the end I went back to the Bertholds. The negative there though, besides the general Berthold vibe, is that you get the old 8-bit character set, no modern glyph goodies. Which of course, sucks.\n\n"
    },
    {
      "time": "28 Aug 2008 — 6:43pm",
      "content": "Thanks everyone for your wisdom! I have decided to go with the Adobe version which seemed to have far less slant on its italic.\n\nIt's a book on Football but damn it it's going to be a classy one ...\n\n"
    }
  ]
}
