{
  "id": "48831",
  "title": "heres another - ITC New Baskerville vs Baskerville",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "what d'you reckon?\n\n",
  "author": "leif",
  "time": "27 Aug 2008 — 3:26am",
  "uid": "25735",
  "comments": [
    {
      "time": "27 Aug 2008 — 3:32am",
      "content": "Monotype Baskerville or Frantisek Storm’s John Baskerville.\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:52am",
      "content": "I'll second the 'John Baskerville' suggestion.\n\nDav\n\n"
    },
    {
      "time": "27 Aug 2008 — 5:00am",
      "content": "Again, it’s all in the wiki: [Baskerville](http://web.archive.org/web/20150328232609/http:/typophile.com/wiki/Baskerville)  \nF\n\n"
    },
    {
      "time": "27 Aug 2008 — 5:22am",
      "content": "<cite>Again, it’s all in the wiki:</cite>\n\nWell, yes and no. I'd disagree with a bit of it, & some detail is lacking. ITC Baskerville is the same as Linotype \"New Baskerville.\" Linotype created New Baskerville, and in the days of the Linotron 202, sold it to ITC & then re-licensed it. So us 202 users were in the position of being able to buy \"New Baskerville\" from Linotype, or \"ITC Baskerville\" from Linotype for $20 more, but they were in fact essentially the same fonts.\n\nTo my eye, the digital version of ITC Baskeville looks very similar to the older photocomp version, perhaps the x-height has grown a touch larger. But it has been used for extended text for years, by many award-wining designers such as Rich Hendel, Richard Eckersley, etc. A different generation, I know.\n\nMonotype Baskerville, in digital form, is as the wiki says. The letterforms were never adjusted for the difference in ink spread between letterpress printing and offset printing, and this is exacerbated with direct-to-plate offset printing.\n\nThe Berthold Baskerville doesn't have the character weight problem of Monotype -- and to a smaller extent, ITC -- but to my eye, somehow lost the quality of \"Baskerville.\" I haven't used the Storm version, so can't say anything.\n\nMy main gripe with the wiki is that it gives the impression the \"New Baskerville\" is unsuitable for book-length text. While not one of my favorites & while it does have some weaknesses, it has been successfully used for years, in both photocomp & digital forms.\n\n"
    },
    {
      "time": "27 Aug 2008 — 5:59am",
      "content": "New Baskerville makes a great text face but gets horsey at larger sizes.\n\n"
    },
    {
      "time": "27 Aug 2008 — 3:13pm",
      "content": "My favorite is this: [http://typophile.com/node/30583](http://web.archive.org/web/20150328232609/http:/typophile.com/node/30583 \"http://typophile.com/node/30583\")  \nIt has by far the best \"g\" (which is saying a lot).\n\nhhp\n\n"
    },
    {
      "time": "28 Aug 2008 — 11:25am",
      "content": "Very nice, Hrant. Aren't you working on a version? How's it going?\n\n"
    },
    {
      "time": "28 Aug 2008 — 2:42pm",
      "content": "It's in hibernation. :-(  \nBut that bear will be raised from its slumber.\n\nhhp\n\n"
    }
  ]
}
