{
  "id": "48848",
  "title": "Beagle Bold",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is Beagle Bold, my revival of Eagle Bold. It’s almost done and I hope to release it very soon under a Creative Commons attribution license (among other reasons, so that people can use it with @font-face without pestering me about licensing issues). Right now it’s going to support Latin-1 with a few extras tossed in; I plan to add more language support over time.\n\n ![](http://web.archive.org/web/20150417191022im_/http:/typophile.com/files/beaglebeta1_5860.png)\n\n| Attachment | Size |\n| --- | --- |\n| [beagle\\_beta\\_1.pdf](http://web.archive.org/web/20150417191022/http:/typophile.com/files/beagle_beta_1.pdf) | 41.91 KB |\n| [beagle\\_beta\\_2.pdf](http://web.archive.org/web/20150417191022/http:/typophile.com/files/beagle_beta_2.pdf) | 41.5 KB |\n\n",
  "author": "blank",
  "time": "27 Aug 2008 — 11:43am",
  "uid": "14722",
  "comments": [
    {
      "time": "27 Aug 2008 — 2:00pm",
      "content": "Very nice! Maybe M & N could do with a little weight loss on the diagonals. S seems a little light.\n\n"
    },
    {
      "time": "2 Sep 2008 — 3:58am",
      "content": "Just a few quick comments:\n\nI think the round letters and also A, V, W could use (more) overshoot. Like they are now, they look too small.\n\nI think the accents are a bit too light. The ogonek should be aligned to the right side on the E, as it is on the A.\n\nThe S looks quirky (I haven't checked with Eagle, perhaps it's similar there). The transition from the straight line to the curve on top of B and D has a small bump.\n\nThe left and right part of the O look too light compared to the top and bottom part, their weight needs optical correction (same goes for G and Q).\n\nNice effort though, keep it going :)\n\nJens\n\n"
    },
    {
      "time": "2 Sep 2008 — 4:54am",
      "content": "All rounded glyphs (O, Q, C and G) need more overshoot.  \nNice though.\n\nPieter\n\n"
    },
    {
      "time": "6 Sep 2008 — 12:42pm",
      "content": "Thanks for the help. I’ve updated the original post with a new sample image and specimen. Here’s the rundown:  \n• Many spacing and kerning tweaks.  \n• All diacritical marks are larger/heavier.  \n• Fixed Eogonek  \n•&nbsp;Round letters are now wider and overshoot farther.  \n• S is wider. The old version was based on the original, which was pretty gross.  \n• A, M, N, V, and W now have pointy tips. I felt that this gave the face character that Coiner’s drawings had and the ATF metal type lost.\n\n"
    },
    {
      "time": "11 Sep 2008 — 4:20pm",
      "content": "Hrm; I feel almost like the diacitics don't necessarily need to be heavier, but that they do need to be much wider, almost crossing the entire letter. These have such a block feel it's a bit odd to see them so skinny on both the X and Y scale. That's fine on the Y but the X needs to be a good bit bigger. I dunno how the original drawings were.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "11 Sep 2008 — 5:06pm",
      "content": "I considered going with larger diacritics, but there’s a problem of diminishing returns, aesthetics get worse as scale increases. To make the marks look good and be wider the marks need to become more chirographic (like Whitney by TFJ) and then they don’t harmonize well with the letters, and marks like ring and circumflex get gigantic.\n\nThe original designs by Coiner and Benton didn’t have any diacritics. These are American letters from the 1930s that were intended to be used by a government agency and business tied to it. I don’t think that these letters would look like this if they had been designed for use in Europe. I guess that this is a novelty font to the core!\n\n"
    }
  ]
}
