{
  "id": "48844",
  "title": "Farola - New decorative PeGGO font...",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi Typophilian mates!\n\nWell I love try to design some fontface cuz I'm just a begginer on this discipline, in fact, my start is this year and my previuos experience is on Calligrhy.  \nI come to tell to all of you that this is my first full character set designed and I would like take your opinion and critiques about this work and so you can help me to improve it, please.\n\n**_\"Farola\"_**\n\nThe uppercases Farola are very decorative then its lowercases are most regular for keep a little of equilibrium.\n\n ![](http://web.archive.org/web/20150423162407im_/http:/typophile.com/files/farola-typophile1_6004.png)\n\nThis is a Display font is done to be used on big sizes, titles or logos.  \nhere an example:\n\n ![](http://web.archive.org/web/20150423162407im_/http:/typophile.com/files/farola-typophile2_5344.png)\n\nRespects and Regards  \nPedro [**PeGGO**]\n\n",
  "author": "peggo",
  "time": "27 Aug 2008 — 10:22am",
  "uid": "30293",
  "comments": [
    {
      "time": "27 Aug 2008 — 11:11am",
      "content": "This is a real delight, Pedro. It gives me a '60s-'70s latin resort feeling and has a definite hand rendered charm. I adore the caps, but I recommend a simpler set as alternatives. I know it's meant for larger settings, but it can work for short text too if you improve the spacing, especially to the right of the 'a' and around the 'i' and 'o'. This will sacrifice your connections a bit, but it's worth it.\n\n"
    },
    {
      "time": "28 Aug 2008 — 9:46pm",
      "content": "thank you Stephen..!!!  \nI appreciate so much this kind words.. specially coming from you..!!!  \nI get some Capital alternatives drawed but it's hard ever.. .. some friends also tell me about some spacing pairs.. I believe that need a deep and slow check.. for reach a work more accurate.  \nthan you mate..!!  \n=)  \nPedro\n\n"
    },
    {
      "time": "28 Aug 2008 — 10:11pm",
      "content": "I'd say this needs to be handpicked. This really is a lot of fun!\n\n"
    },
    {
      "time": "28 Aug 2008 — 10:22pm",
      "content": "Beautiful work.\n\nYour ch and ck ligatures are a little too crowded. Open them up so that the c has as much room as the unligated one we see in \"Acholias\".\n\nYou may find it wise to create Ni And Mi ligatures.\n\nThe decorated tails of R and K force a very large gap in all settings with lowercase. Perhaps they should descend?\n\n"
    },
    {
      "time": "30 Aug 2008 — 11:31pm",
      "content": "- **Miss Tiffany:**\n\nOh Thank you so much for your beautiful gesture, it's so encourage, believe me. I'm fun so much when I'm design it, although is a hard work.. is too funny work and deserve the better efforts..!! :D\n\n- **Cerulean:**\n\nI'm agree with your suggestions about Ligatures, then I tried to make that 'Mi', 'Ni' and another so similar 'Hi':\n\n ![](http://web.archive.org/web/20150423162407im_/http:/typophile.com/files/Farola_NEWLIGA-text_5254.png)\n\nAfter every new ligature added I think about one thing:  \nthat mean a new hard work cuz if our design has an irregular Metric (like Farola) mean several check out for every new gliph added (ligatures), and by the way so several aditional kerning pairs are need be checked too, is necessary had work and anyway I love make this irregular design.\n\nI also tried that descent tails for K and R (and may be L need same work)\n\n ![](http://web.archive.org/web/20150423162407im_/http:/typophile.com/files/Farola_NEW_R-and-K_6227.png)\n\nthank you for your words and all useful mate words, I always appreciate good suggestions and critiques..!! and sometimes I appreciate bad words too.. lol\n\nRegards  \n:D  \nPedro [PeGGO]\n\n"
    },
    {
      "time": "29 Sep 2008 — 11:00pm",
      "content": "Here is some.. new farola  \nRegular Caps and SmallCaps  \nstill need improve kerning work\n\n ![](http://web.archive.org/web/20150423162407im_/http:/typophile.com/files/Farola-Vrs_texto_590w_4623.png)\n\nregards  \nPeGGO\n\n"
    },
    {
      "time": "23 Oct 2008 — 9:07am",
      "content": "Lóve it!\n\n"
    },
    {
      "time": "23 Dec 2008 — 9:49am",
      "content": "thank you \"il sans\" I like to know you love it.\n\n-------------------------------------------------------\n\n\"Farola-Simple\" is a new variable from \"Farola\" classic\n\n ![](http://web.archive.org/web/20150423162407im_/http:/typophile.com/files/Farola-simple_SHOW3_6273.PNG)\n\nplease, all kind of opinion and critiques are so welcomed.  \nhope you like it..!!  \n:)  \nregards to all  \nPedro [PeGGO]\n\n"
    },
    {
      "time": "23 Dec 2008 — 10:55am",
      "content": "How about a PDF of this new sheet? Looks great from here, but can't see the details.\n\n"
    },
    {
      "time": "27 Dec 2008 — 5:05am",
      "content": "Great work!\n\n"
    },
    {
      "time": "28 Dec 2008 — 7:01pm",
      "content": "Hi Stephen..!!  \nThank you for stop and pay attention here and well.. if you want you get ;D\n\n[http://typophile.com/files/text\\_TRC.pdf](http://web.archive.org/web/20150423162407/http:/typophile.com/files/text_TRC.pdf)\n\nHi Kliment  \nThanks for your happy words to my work..!!!  \n:D\n\nPeGGO\n\n"
    },
    {
      "time": "11 Feb 2009 — 5:56pm",
      "content": "Execellente! I've never seen a typeface with such latin flair! Keep up the good work!\n\n"
    },
    {
      "time": "24 Feb 2009 — 11:16am",
      "content": "Aww.. Thanks \"Dhannah\" I feel so glad for your sweet words for this work. I'm keep working on it.. =)  \nregards.  \n=)  \nPeGGO\n\n"
    },
    {
      "time": "24 Feb 2009 — 2:18pm",
      "content": "This is amazing! Where do you get your inspiration?\n\n"
    },
    {
      "time": "5 Mar 2009 — 6:21pm",
      "content": "Hi Bendy.. :D\n\nI just think in old times... in its decoration shapes.. ond metal foundry objects.. like romantics park lamps... and some like.. :D a complete pleasure to done.\n\nregards and smiles.. :D\n\nPS: I almost ready my new update to my another font.. just need some hits more..:D  \nthank you so much for the support... :D\n\nPeGGO\n\n"
    },
    {
      "time": "11 Mar 2009 — 10:56am",
      "content": "That's exactly how it comes across. It's very beautiful and clever and unique. Great work!\n\n"
    },
    {
      "time": "14 Mar 2009 — 12:42am",
      "content": "bravo! this is quite romantic! i would personally use this more as a display font, but i think it really is beautiful! i definitely get the farola feel, and the swirly decorative touch makes me happy! i really enjoy it!\n\n"
    },
    {
      "time": "29 Mar 2009 — 8:47pm",
      "content": " **Bendy:**  \nThank you again **Bendy**.. I worth so much your kind words.. and more.. make me feel so honoured to see this kind words coming from you.. thank you so much for support and for attention on my work.. :D\n\n**gcrivera:**  \n:D  \nwow! thank you for your surprised and expressive words.. :D  \nI really feel so glad for make you happy and enjoy trough by this work and imagine my pleasure when I'm working on this proyect.. I still enjoy to details and challenge to solve each part.. :D\n\nThank you so much for your support and for you attention by..!!\n\nPeGGO\n\n"
    },
    {
      "time": "4 Sep 2010 — 7:15pm",
      "content": "Lot of hours working for reach a litle new stuff with farola, \"Seasons Spiral\" a couple of words in many sizes and fullcolor done specially for print!\n\n ![](http://web.archive.org/web/20150423162407im_/http:/typophile.com/files/seasons-spiral_550w_4378.gif)\n  \n=)  \nBest regards mates! \n"
    },
    {
      "time": "19 Sep 2010 — 7:01am",
      "content": "Sweet. Any plans to release this one?\n\nMaybe it's just me but perhaps the spacing could be a little looser. I think it could be more even too (looks a little bumpy?)\n\n"
    },
    {
      "time": "4 Oct 2010 — 7:05pm",
      "content": "Hi dear Ben!  \nNowdays I'm working on LEGAN font but btw few days ago I redrew some new alternates gliphs of FAROLA font, remind me everything could be improve still better like current state. Some peoples told me same like you about spacing for this font and I think this could be improve with a little looser spacing.. this kind of specific spacing was so cause to touching forms between gliphs, like a visual game and in fact could be changed after by each program but of course I figure it out that you talk about of some details that really need an more accurate review.. I'll keep the plan in mind, no doubt.\n\n"
    },
    {
      "time": "2 Mar 2011 — 11:22am",
      "content": "I'm just coming back to this one for some inspiration for my [Nola](http://web.archive.org/web/20150423162407/http:/www.typophile.com/node/74593), which is more texty but has similar twiddles. I think what I've learnt here is to have two sets of caps, that works well I think.\n\n"
    },
    {
      "time": "21 Aug 2011 — 11:25am",
      "content": "good news dear Ben, I actually would like to know some Nola's caps cuz I just saw lowers, please.. notice if you get updates..!! or I will try to be alert..!! cheers for Nola's sets..!!\n\n"
    },
    {
      "time": "21 Aug 2011 — 2:06pm",
      "content": "Hah, it'll be quite some time before I'm able to get back to Nola, I'm afraid! Much as I'd love to work on it now, I'm going to be rather busy for the next twelve months!\n\n"
    },
    {
      "time": "22 Aug 2011 — 2:29am",
      "content": "gosh! hope to keep on mind Nola project until that years.. haha.. I love it anyway!\n\n"
    },
    {
      "time": "30 Aug 2011 — 8:38am",
      "content": "Hey, you released this!?! [Farola](http://web.archive.org/web/20150423162407/http:/new.myfonts.com/fonts/peggo/farola/) now available on MyFonts, and on the 'Hot New Fonts' list! Congratulations!\n\n"
    },
    {
      "time": "30 Aug 2011 — 1:01pm",
      "content": "hehe... Thank you Ben... in fact this happy is double because Legan is also on there..!! and very soon I hope to start to offer Fonton.. but that is another deal.. by the way I'm really glad for.. yeah..!! :D\n\n"
    },
    {
      "time": "5 Sep 2011 — 2:53pm",
      "content": "That is one of the nicest looking \"F\"'s I've seen. Absolutely gorgeous.\n\n"
    },
    {
      "time": "7 Sep 2011 — 7:31pm",
      "content": "Thanks Michael, if Farola was a human person, surely she felt so glad for your kind comment :D\n\n"
    }
  ]
}
