{
  "id": "48851",
  "title": "Legality of expanding typefaces",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A tie-in to some of the other discussions relating user modification and/or supplementing of an existing font — something I’m quite conscious about, since I already may _have_ broken the EULA, or at least stretched it to a breaking point!\n\nMy main field of typesetting is in linguistics. Not your average translation stuff, but the university side: descriptional (languages from all over the world — I stopped counting), historical (Proto-Indic; but also 17c English), orthographic (showing different forms of the capital of ’ŋ’ — “eng” — there are at least two varieties), and phonetic /fəˈnɛtɪk/ — not all browsers will display the required characters!\n\nThere are lots of phonetic fonts out there, but a lot are put together by willing amateurs (non Unicode; missing italic, bold, and bold italic), and there are certainly none even close to the base font I use for plain text. So I[\\*] created a Unicode compliant set of additional characters as a stand-alone font, in all required styles. And here comes the snag.\n\nAn upside down ’e’ in this font is created by copying a base font ’e’ and inverting it. A small capital ’R’ (that’s the uvular trill; not a regular American “arrr” but the clear one in “garçon”) is copied plainly from the base font small caps set. It has to be copied because it has a Unicode point of its own! The voiceless retroflex plosive (don’t ask me — I didn’t make up the names) looks like this ’ʈ’ — a lowercase ’t’ with a lowered bottom, shaped more like a ’j’. And so on — the characters are all based on Latin, but may have any amount of alterations.\n\nIt gets worse with added accents: acutes and carons are readily available, usually already in combination with often-used characters. But I need them up/under/through virtually any possible character, and sometimes even stacked upon eachother! No worries: I copy all available accents directly from the base font, add a few handfuls of ones Adobe didn’t think of (small plus above; inverted breve; lots more), create OTF tables to combine them in a fashionable way with my own extended set of glyphs ... and _then_ I need the same for the _regular_ set of Latin characters! So I copied _these_ as well — ’a’ to ’z’ — and copy their kerning tables too, then position the accents for these as well,. That’s where my conscience really began to work. To be totally in control, I would need to add even more characters from the original font, virtually up to the moment I would not even need the original. I might as well put _my_ entire set into the _original_ font!\n\nIt has been mentioned that Adobe doesn’t mind adjusting fonts for ’private use’, but, as this is to be put in books, that seems stretching their indulgance quite a lot, even though this new font has no commercial purpose on itself. I have no intentions at all to sell it as ’the’ linguistic set, and up to now I am extremely wary of sharing it, even within the publishing cy I do this work for.\n\nWho can sooth my worries? Alternatively, what _can_ I do without having to worry about the Font Police?\n\n[\\*] TBTH, building heavily upon the work of a previous colleague, who had a large part in the initial development. But now I’m on my own.\n\n [‹ sophisticated varsity lettering?](http://web.archive.org/web/20081201085113/http:/www.typophile.com/node/48912 \"Go to previous forum topic\") [Hoefler Text in books... ›](http://web.archive.org/web/20081201085113/http:/www.typophile.com/node/36928 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201085113/http://www.typophile.com/user/29994\" title=\"View user profile.\">Theunis de Jong</a>",
  "time": "<br>",
  "uid": "29994",
  "comments": [
    {
      "time": " 27.Aug.2008 1.52pm",
      "content": "Dunno about your legal issues, but have you tried using Doulos SIL? As a linguist, it’s always sufficed for me.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 27.Aug.2008 2.01pm",
      "content": "I agree with JT, start with a font like Gentium or Vera Serif, which have clear open-source like licenses.\n\nCheers, Si\n\n"
    },
    {
      "time": " 27.Aug.2008 2.24pm",
      "content": "Speaking of BT Vera, [DejaVu](http://web.archive.org/web/20081201085113/http:/en.wikipedia.org/wiki/DejaVu_fonts) has been mentioned here before and might be useful.\n\n"
    },
    {
      "time": " 27.Aug.2008 7.42pm",
      "content": "I have a lot of respect for those devoted souls, including Victor Gaultney and the folks at SIL, for producing fonts with extensive diacritics such as Gentium, Doulos, etc.: Unicode has little practical use without fonts that actually implement the many characters for which it standardizes encodings.\n\nHowever, I work as a typesetter, and need to offer customers more than a handful of typeface choices. Sure, I can suggest editors persuade authors to submit manuscripts with Sanskrit diacritics rendered in Time Roman Ext. However, journals that have always used, say, Monotype Baskerville, would like to see those diacritics rendered in Baskerville; and, by the way, as journals increasingly move on-line, they’d like those diacritics coded in Unicode. I can tell editors that Monotype might not be a good choice, on grounds its current font licenses both forbid modification and require additional licensing for electronic publications, and point out that there are other fish in the sea. And for some projects Gentium, SIL Doulos, or Times Roman Ext really might work very well. But for many jobs designers will insist on more variety.\n\nScholars are certainly grateful for fonts with large character sets, but I’m also pretty sure they don’t want all their publications to look the same. And from a practical point of view, I doubt universal fonts will ever be the answer: as readers of the Typophile forums know better than most, adding ever more characters is not trivial. I think instead that typesetters, and the scholarly world in general, need a variety of fonts that can be expanded as required for a particular piece of text.\n\nJudging by their font licensing, I think Adobe understands this. I’m also encouraged by Adobe’s push for SING glyphlets, developed as a means for adding characters without actually modifying the underlying font. Some such facility is essential for setting East Asian languages, where large dictionaries contain more characters than almost any font. I have heard very little about glyphlets recently, but I’m hoping Adobe will migrate the technology to versions of InDesign other than Japanese.\n\n"
    },
    {
      "time": " 27.Aug.2008 8.47pm",
      "content": "<cite>It has been mentioned that Adobe doesn’t mind adjusting fonts for ’private use’, but, as this is to be put in books, that seems stretching their indulgance quite a lot, even though this new font has no commercial purpose on itself.</cite>\n\nThe wording in Adobe’s font FAQ is that modification for “customary and internal business use” is permitted, provided that the modified font isn’t distributed. Whether selling books printed using that font falls within that is hard to tell, but the general drift of that part of the FAQ seems to be that it’s OK as long as you are neither selling nor otherwise distributing the modified font software - i.e., that the font file itself is staying “internal” to the business. Or at least that’s what I’ve assumed, since I’ve had to do similar work (although for epigraphy rather than linguistics). I’d be interested to know if anyone knows otherwise.\n\nWhen I’ve had to do this with fonts from vendors that don’t allow modification, the obvious workaround (assuming I need to match existing glyphs for parts of the shapes) is to print out specimens and draw my own outlines around them, and generate the new glyphs in a stand-alone font. I’d never distribute those either, but it does get around the license issue if you don’t use their vectors at all.\n\n"
    },
    {
      "time": " 28.Aug.2008 12.53am",
      "content": "Naive question: Could’nt you just ask Adobe if they mind? I don’t think your niche project - sorry, I know it is important - would curtail their profits.\n\n"
    },
    {
      "time": " 28.Aug.2008 2.05am",
      "content": "David, thank you for correctly assessing the situation! I do not know enough of glyphlets to tell if this could work — perhaps the forthcoming new version of the CS Suite will have integration for those.\n\n<cite>I don’t think your niche project — sorry, I know it is important — would curtail their profits.</cite>\n\nAu contrare. That’s why I prefer to use the term ’supplemental font’, even if it means I get into trouble mixing base font with my characters, and I am suppressing the urge to modify the original one.\n\n“Important” ... I think it’s pretty important books look good. Using another font for some characters Does Not Look Good. I am not sure if the readers appreciate the effort; best case I can imagine is that they never even noticed!\n\n"
    },
    {
      "time": " 28.Aug.2008 5.50am",
      "content": "In my view you paid a licence fee for the use of a typeface (at least I guess you did…). If you want to extend that with stuff you made that would not make a difference. It’s usage is still within bounds of fair use.\n\nExample: years ago I combined a regular font and an expert font so I would have old style figures in the base font. For good measure I added a few dingbats (using spots for glyphs that would never be used in this situation). This way I could use ONE font instead of THREE when doing the layout of a magazine. Of course I paid for all three.\n\nYou can put your conscience to rest, Theunis.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 28.Aug.2008 1.23pm",
      "content": "Theunis,\n\nLinguists definitely appreciate the effort. Though as a side question, do you simply flip and forget for some of the IPA or do you rework the weights and proportions etc?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 29.Aug.2008 1.34am",
      "content": "<cite>.. do you simply flip and forget for some of the IPA or do you rework the weights and proportions etc?</cite>\n\nSimple flips whenever possible ;-)\n\nThe weights of individual pieces of ’jigsaw’ glyphs are as close to the base font as possible, but since they get repositioned I do take care heavy stems do not end up on ’the wrong side’ of lighter stems. It is not unusual that I refine a character after seeing it in print — that’s usually a case of proportions that apparently didn’t work.\n\nA definitive disadvantage of this labour of love is the urge for constant twiddling!\n\n"
    }
  ]
}
