{
  "id": "4888",
  "title": "Cyrillic Glyphs in Adobe Font Folio OpenType Edition",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi guys,   \n   \nI am looking for the Adobe fonts that have cyrillic characters. I could sift through them at the Adobe site, but was hoping someone had already compiled a list.   \n   \nAny pointers?   \n   \nMany thanks in advance,   \nNicky\n\n",
  "author": "<a href=\"/web/20091205085801/http://typophile.com/user/3822\" title=\"View user profile.\">nmk</a>",
  "time": "<br>",
  "uid": "3822",
  "comments": [
    {
      "time": " 22.May.2004 2.44pm",
      "content": "Try \\< [http://www.adobe.com/type/browser/c/c\\_cyrillic.jhtml](http://web.archive.org/web/20091205085801/http:/www.adobe.com/type/browser/c/c_cyrillic.jhtml)\\>   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 22.May.2004 4.18pm",
      "content": "Adobe seems to be case sensitive. ![:-)](http://web.archive.org/web/20091205085801im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n [http://www.adobe.com/type/browser/C/C\\_cyrillic.jhtml](http://web.archive.org/web/20091205085801/http:/www.adobe.com/type/browser/C/C_cyrillic.jhtml) (with C)\n\n"
    },
    {
      "time": " 23.May.2004 12.45am",
      "content": "Thanks guys,   \n   \nI was actually hoping for a more extensive cyrillic support in a huge set such as this.   \n   \nCan anyone recommend a collection with more cyrillic opentype faces?\n\n"
    },
    {
      "time": " 23.May.2004 3.45am",
      "content": "I know that [Paratype](http://web.archive.org/web/20091205085801/http:/paratype.com/) made good cyrillic fonts and remading typefaces from ITC, AgfaMonotype, Emigre and other major type foundries.\n\n"
    },
    {
      "time": " 23.May.2004 11.37am",
      "content": "Paratype is certainly the leading type foundry for Cyrillic typefaces in general. I'm not sure how much they have in OpenType format so far.   \n   \nT\n\n"
    },
    {
      "time": " 23.May.2004 11.45am",
      "content": "Oh, and though Adobe doesn't have a ton of Cyrillic-supporting typefaces, many of our newer and upcoming releases do support Cyrillic. It's become relatively common for us to do typefaces that support extended Latin, Greek and Cyrillic all in one go.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 23.May.2004 12.45pm",
      "content": "That's good to hear. Are those up and coming typefaces cpmpletely new ones or are you going to add cyrillic characters to existing ones as well?\n\n"
    },
    {
      "time": " 23.May.2004 1.01pm",
      "content": "New ones. Three of our next four type families have Cyrillic support (as well as Greek and extended Latin).   \n   \nI don't think we have any current plans to retrofit Cyrillic characters to any existing typefaces, however.   \n   \nT\n\n"
    },
    {
      "time": " 23.May.2004 1.39pm",
      "content": "Thomas, does the presence of Cyrillic characters affect where InDesign places the font in its font menu? I recently switched to the OpenType version of Times Ten (which has Cyrillic characters), and find that it sits in its own section near the bottom of the font menu, sandwiched between the Asian type that Adobe and Apple thoughtfully supply (but that I never use).\n\n"
    },
    {
      "time": " 23.May.2004 2.16pm",
      "content": "Yes.   \n   \nInDesign (and the Mac OS) try to identify the codepage of the font to decide which language section of the font menu it belongs with.   \n   \nThis approach has limitations, of course, when you have fonts that support multiple codepages.   \n   \nDoes this approach seem reasonable to you? What would you suggest?   \n   \nT\n\n"
    },
    {
      "time": " 23.May.2004 2.57pm",
      "content": "Thanks for the clarification, Thomas.   \n   \nMy preference would be a straightforward alphabetical listing. But I don't do any work with non-Western languages, so I can't comment on the advantages of having the type segregated by language support.\n\n"
    },
    {
      "time": " 24.May.2004 4.46am",
      "content": "Yes, Thomas, unfortuneately, as i know, Paratype don't make OpenType fonts. I just don't saw that talk was about OpenType exactly. But, however, thank you for encouraging promise about cyrillic support in upcoming Adobe fonts. It's good.\n\n"
    },
    {
      "time": " 27.May.2004 8.19am",
      "content": "_Does this approach seem reasonable to you? What would you suggest?_   \n   \nGive the user a choice.   \n   \nResurrect ATM Deluxe as Adobe Type Manager CS and let it give the user fine-grained control over the CS font menu appearance and behavior, even if it can't exercise such control inside non-Adobe apps for lack of access. Now that more and more designers can do all of their work in this or that CS app, font management in other apps matters less and less.\n\n"
    },
    {
      "time": " 27.May.2004 9.11am",
      "content": "_Resurrect ATM Deluxe as Adobe Type Manager CS and let it give the user fine-grained control over the CS font menu appearance and behavior_   \n   \nNow that's an idea. Thomas, please run with this. I know Noha (Edell) at Adobe has been pushing for ATM to come back, and this sounds like a great reason for doing so.\n\n"
    },
    {
      "time": " 27.May.2004 9.38am",
      "content": "Thanks for the feedback, folks.   \n   \nI'll note that the font menu stuff John is talking about could be put into a future version of the Creative Suite without any involvement from ATM.   \n   \nT\n\n"
    },
    {
      "time": " 8.Apr.2007 6.09pm",
      "content": "[Extending Cyrillic (and later Latin) character sets](http://web.archive.org/web/20091205085801/http:/blogs.adobe.com/typblography/2006/08/defining_an_ext.html)\n\nHypatia Sans Pro, Thomas’ upcoming typeface family will also include the following characters:  \nU+0498 Zedescender  \nU+0499 zedescender  \nU+04A0 Kabashkir  \nU+0401 kabashkir  \nU+04AA Esdescender  \nU+04AB esdescender  \nU+04D0 Abrevecyr  \nU+04D1 abrevecyr  \nU+04D6 Iebreve  \nU+04D7 iebreve  \nU+04F2 Uhungarumlautcyr  \nU+04F3 uhungarumlautcyr  \nU+04E6 Odieresiscyr  \nU+04E7 odieresiscyr  \nU+04C1 Zhebreve  \nU+04C2 zhebreve  \nU+049C Kavert  \nU+04B8 Chevert  \nU+049D kavert  \nU+04B9 chevert\n\nThese characters will add coverage for a few more Cyrillic languages:  \nAzeri  \nBashkir  \nChuvash  \nDargin  \nKomi (Zyrian & Permyak)  \nMoldavian (Cyrillic)\n\n"
    },
    {
      "time": " 10.Apr.2007 12.24pm",
      "content": "First, Thomas and speter, both those links result in an infinite redirect between [www.adobe.com](http://web.archive.org/web/20091205085801/http:/www.adobe.com/ \"www.adobe.com\")... and store.adobe.com... But, this one does the trick:  \n [http://www.adobe.com/type/browser/C/C\\_cyrillic.html](http://web.archive.org/web/20091205085801/http:/www.adobe.com/type/browser/C/C_cyrillic.html \"http://www.adobe.com/type/browser/C/C\\_cyrillic.html\")\n\nSecond, may I applaud Adobe’s efforts to design fonts with the whole character-set enchilada: Latin, Cyrillic and Greek. (Though, would a Greek enchilada feature feta? I digress.) I, for one, set a lot of type that features other languages and certainly prefer to use the same font for all the different editions. However, there are precious few quality fonts that feature the character-set trifecta and even fewer that also include support for East Asian diacritics (specifically, for me, Vietnamese).\n\nSo, thanks, Thomas, for Myriad Pro, Minion Pro, Warnock Pro, Garamond Premier Pro, etc. I look forward to seeing the three new fonts soon. I can only hope that other foundries follow your example in this global age of communication to offer their fonts to users of non-Western alphabets.\n\n"
    },
    {
      "time": " 10.Apr.2007 12.29pm",
      "content": "“Though, would a Greek enchilada feature feta?”\n\nOnly if you are a fetalist :-)\n\nChrisL\n\n"
    }
  ]
}
