{
  "id": "48881",
  "title": "Business card for lactation consultant?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all.\n\nMy mother works as a “laction consultant” (midwife with lactation as main area). And she wants a business card. I tried some designs, but I can’t get anything good out of it.\n\nShe wants the font “avant garde” (gothic or somehting like that I think).\n\nAs she is a stand-alone consultant, she doesn’t have a logotype - and I don’t think that’s necessery. Are these designs too plain? They aren’t mine, but I was thinking something like that.\n\n| Attachment | Size |\n| --- | --- |\n| [Consultant-business-cards.gif](http://web.archive.org/web/20081201164752/http:/typophile.com/files/Consultant-business-cards.gif) | 15.92 KB |\n\n [‹ Wordle](http://web.archive.org/web/20081201164752/http:/www.typophile.com/node/48892 \"Go to previous forum topic\") [Typography Funny? ›](http://web.archive.org/web/20081201164752/http:/www.typophile.com/node/48885 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201164752/http://www.typophile.com/user/22360\" title=\"View user profile.\">Fernando_Gutierrez</a>",
  "time": "<br>",
  "uid": "22360",
  "comments": [
    {
      "time": " 28.Aug.2008 8.11am",
      "content": "They are a bit plain ..  \nOTOH, perhaps this is too obvious:\n\n ![](http://web.archive.org/web/20081201164752im_/http:/www.typophile.com/files/card_3544.PNG)\n\n(I seem to have misplaced my Avant Garde!)\n\n"
    },
    {
      "time": " 28.Aug.2008 8.27am",
      "content": "Hhahaha. That was a really good one Theunis!!!\n\nBut I don’t know, perhaps it’s too sexistic. Most of her clients are having problems with the things you painted. =)\n\n"
    },
    {
      "time": " 28.Aug.2008 12.06pm",
      "content": "Well okay ;-)\n\nI think your samples are _very_ business-like. Well, they should, being from a bank.\n\nTry something with lots of white, and as thin a font as you can find. Nothing compressed — keep it open and friendly. Add lots of tracking.\n\nDon’t crowd the text. If you need to include lots of contact information (as the tiny print in your samples), try putting this on the back side, and keep the front side with your mom’s name as clean and clear as possible.\n\nColoured text, rather than black, might work, but maybe you should steer clear from light blue (although I would associate it with dairy products). A pale red — but not pink! — conveys a ’human interest’ (with a slightly feminine slant). Blue, green, purple, orange, brown and cyan do not. Pure, bright colors (red, green, cyan, hot pink) stand for ’intensity’ and/or ’urgency’, that you could do without.\n\n"
    }
  ]
}
