{
  "id": "48904",
  "title": "Harry Potter Fans are disappointed with the Harry Potter 6 release date",
  "forum": "Barry Batholo's blog",
  "tags": [

  ],
  "content": "[Harry Potter Fans are disappointed with the Harry Potter 6 release date](http://web.archive.org/web/20090622070415/http:/www.petitionspot.com/blog/130/)\n\nHarry Potter 6; the Half-blood prince is much anticipated by all the Harry Potter fans around the world. Everybody were expecting it to be on their movie screen by November 21st, but suddenly Warner Brothers had announced that they will push the date to July 17th of 2009 and not on November 21st of 2008! This angered lots of the Harry Potter fans who just can’t get enough of Harry Potter.\n\nBecause of these fans’ outrage, one person started an [online petition](http://web.archive.org/web/20090622070415/http:/www.petitionspot.com/online-petition/) asking fellow Harry Potter fans to sign it if they are disappointed with the decision to move the release date of the movie. In just a week after the petition had been created, it gathered over 40,000 signatures already! Just imagine, that’s over 5,000 signatures in a day! The Harry Potter fever is just getting hotter and hotter. Now, fans are not excited but they are outraged by the decision of Warner Brothers. With this much signatures under one petition, just imagine how many online [petitions](http://web.archive.org/web/20090622070415/http:/www.petitionspot.com/) about this had been created after the news broke out about the postponement of the movie’s release. With all these petitions getting the same bombardment of signatories, for sure Warner Brothers would be worried. Why not? They keep on making Harry Potter movies because of its fans that just can’t stop watching it. What would happen to them if their fans would decide to boycott? They’d lose lots of money and that’s not good for business. What are their reasons for postponing the movie?\n\nAfter watching Harry Potter 5, many Harry Potter fans already started their long wait for the next Harry Potter sequel. For them it may have already seemed forever and with just 3 more months left and they could already watch their anticipated movie, suddenly they realize they don’t need to wait 3 more months but another 11 months! Now, wouldn’t that make your blood boil? So just imagine the outrage. Thankfully, online petitions are there to make these fanatics have a chance to share their opinions in the hopes that those people in Warner Brothers may change their minds. It’s a disaster! For these Harry Potter fans, this news seems like they’ve been hit by a killer tornado.\n\nWarner Brothers said they moved the date to ensure they’d get the most audience as possible but they never thought that with their move, they made their Harry Potter fans angry. Is this the best way to market their movie? They should have kept their movie fans happy and excited about the movie and not angry and want to boycott. They may just end up realizing that they made the wrong move. Let’s face it. It doesn’t matter what time of the year they would release the Harry Potter movie, it would still get the same number of audience. Harry Potter fans would continue to watch the movie with so much excitement even when it’s released on the coldest day of the year!\n\nSo, if you are a Harry Potter’s fan and you are also outraged with the decision by Warner Brothers, you may want to check out the online petition about it and sign there too! Perhaps [start a petition](http://web.archive.org/web/20090622070415/http:/www.petitionspot.com/start-a-petition/) of your own?\n\n",
  "author": "<a href=\"/web/20090622070415/http://typophile.com/user/36105\" title=\"View user profile.\">Barry Batholo</a>",
  "time": "<br>",
  "uid": "36105",
  "comments": [
    {
      "time": " 28.Aug.2008 9.03pm",
      "content": "Maybe they’re trying to make the movie better, which can always be done with book to movie translations. And no one that is outraged enough to create a petition for the release date is going to boycott this movie. They’re just mad and have no power over what’s happening, so they express their anger the only way they can. Warner Bros has no need to worry about losing any sort of fan base.\n\npenn\n\n"
    }
  ]
}
