{
  "id": "48908",
  "title": "Serif to pair with Neutraface",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I know it's not everyone's favourite face..and it IS used far too often..but does anyone have a good idea of what serif face would work nicely with Neutraface?\n\nThanks in advance!\n\n",
  "author": "Yehan",
  "time": "29 Aug 2008 — 12:44am",
  "uid": "19396",
  "comments": [
    {
      "time": "29 Aug 2008 — 1:55am",
      "content": "Most important is the context in which Neutraface and the serif will be used. What is your project? Who is your audience?\n\n"
    },
    {
      "time": "29 Aug 2008 — 10:27am",
      "content": "If Neutraface is the display face, a modern (didone) would be a good text complement.  \nOr possibly a non-geo slab serif, e.g. Archer or Bodoni Egyptian.\n\nIf Neutraface is the text, you could try matching a modern where the hairline corresponds to the weight of the text monoline.  \nTo see this effect, set up some 72 pt text in [Scotch Modern Display](http://web.archive.org/web/20150215161905/http:/www.shinntype.com/scotch.html) in the type tester, and put the window next to a showing of [Neutraface Light](http://web.archive.org/web/20150215161905/http:/www.houseind.com/index.php?page=showfont&id=18&subpage=viewfontspecimens)\n\nBut really, any true (\"optically sized\") display face with lots of fine detail would complement the strong personality and sparkle of Neutraface text.\n\n"
    },
    {
      "time": "29 Aug 2008 — 5:20pm",
      "content": "House has shown their own [Paperback](http://web.archive.org/web/20150215161905/http:/www.houseind.com/index.php?page=showfont&id=171) in use with Neutraface.\n\n"
    },
    {
      "time": "30 Aug 2008 — 2:43am",
      "content": "Hi..context is a wedding invitation. I don't want to set ALL the text in Neutraface..just the RSVPs and the couple's names. The rest can be in another face...preferably serif - still have the programme to do and I don't envision the service notes in Neutraface!\n\nThanks for the suggestions..will look at them. At the moment I've used Mrs Eaves...for lack of something better.\n\n"
    },
    {
      "time": "30 Aug 2008 — 12:17pm",
      "content": "Ah wedding invitations. Ok. Well maybe Paperback doesn't reflect the style or intent. Are you shooting for something mid-century mod or what?\n\n"
    },
    {
      "time": "1 Sep 2008 — 2:06pm",
      "content": "My yearbook this year will be using neutra face as the headline font and officina as the copy font.\n\nI think they pair nicely...\n\n"
    }
  ]
}
