{
  "id": "4890",
  "title": "Book font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone know which Garamond would look best in the following books: 1) a detective story; 2) a historical fantasy novel for children.   \nI intend to use my Bitstream collection which has the Bitstream versions of Stempel Garamond, Garamond #3 and Sabon.   \n   \nI don't like very thin fonts such as digital Bembos.   \n   \nWhat kind of printer should I have in order to see the fonts exactly as they will look in the final result (=book)? I think the printer should be able to emulate Postscript or something.   \n   \nOr should I forget Garamonds and use something else, such as ITC New Baskerville or Minion which I also have? (Although Minion looks condensed, intended for narrow columns only and perhaps too modern). How about Trump Medieval (Kuenstler 480) or Bitstream Kis? Please help.\n\n",
  "author": "aku_ankkuli",
  "time": "22 May 2004 — 11:59pm",
  "uid": "3824",
  "comments": [
    {
      "time": "23 May 2004 — 8:40am",
      "content": "Well, maybe not \"know\" and \"best\" - at most \"think\" and \"good\". :-)   \n   \nFor a detective story I think any Garamond would look somewhat awkward (although few people would actually complain explicitly). What to use instead: could you give more details, like more info about the story, how long it is, etc.?   \n   \nGaramond is more appropriate to historical topics, but then you have to say what target age it's for - because below about 10 years of age children don't read very immersively, so something like ITC Garamond (shudder) would actually be good.   \n   \nThe printer: more than imaging language, _resolution_ is your biggest concern. From what James Montalbano has said, on a \"desktop\" you can only get a true idea of the final result by using a 2400 dpi laser (because the lower the resolution the more gain in the letterforms, throwing off the color and texture). If that can't happen, you might do some early testing of one key page directly on lino/velox, then work \"semi-blindly\" from there - pretty normal procedure anyway.   \n   \nhhp\n\n"
    },
    {
      "time": "23 May 2004 — 9:12am",
      "content": "Aku,   \nAre you asking which of the faces you already have to use or are you asking what is the best solution for the job at hand? If the latter then we need to know more about the storyline, place time, etc. (as Hrant mentioned above).   \nIn my opinion, the actual typeface used for the body text has less to do with conveying the intent of the subject matter than the display fonts selected and how the typography is designed on the page. Those of us here on this list are far more likely to be sensitive to typographic nuances than the average mystery novel reader so you can choose a good neutral text face with good readability from your collection and focus your design abilities on the front matter, chapter dividers, and cover to convey the meaning of the content.   \n   \nChrisL\n\n"
    },
    {
      "time": "23 May 2004 — 11:38am",
      "content": "The detective story is actually an old-fashioned soap opera set in current time, yes it has a killer but no detective. It is targeted for the middle-aged and elderly. It is not very long. In front of me I have an old UFO book \"Sky people\". It is set \"in 12 on 13 point Intertype Baskerville\". Looks very clear to my eye. Yes, no Garamond for the detective story - perhaps 11/14 point ITC New Baskerville would do the trick?   \n   \nI intend to use the faces I already have. However, if you experts come out with a clearly superior choice, I could reverse my decision. I am a spineless weakling!   \n   \nThe historical novel is targeted for girls of 9-12 years. It is set in ancient Egypt of the pharaohs but with time travel. How about Zapf Calligraphic 801 (=Palatino) for this - it would be easy to read but would it be boring too? Do boys and girls prefer the same fonts?   \n   \nJust for curiosity - what you would choose for:   \n1) Farewell my lovely (by Raymond Chandler)   \n2) Pet sematary (by Stephen King)   \n3) Space Odyssey 2001 (by Arthur C. Clarke)   \n4) pocket size biography of a fashion designer   \n   \nThanks! Aku\n\n"
    },
    {
      "time": "23 May 2004 — 12:12pm",
      "content": "The detective story: Baskerville is certainly a great \"adult\" (no, not that kind :-) face for a short novel. Maybe a bit too \"rational\", but if it smells like a detective story then maybe just right. Which cut of Baskerville? That's where the usage experts are needed...   \n   \nThe historical novel: Palatino might actually be very fitting, since its somewhat large x-height (compared to its more bookish sister, Aldus) might be just the thing for the transition from non- to immersive reading. The main problem with Palatino though is that it's too common. So maybe Trump or Kis would indeed be better overall, although you'd have to set them a bit big (like 12).   \n   \n\\> Do boys and girls prefer the same fonts?   \n   \nThere might actually be some empirical evidence about this, but:   \n- It will be hard to locate.   \n- It's unlikely to be very reliable.   \n   \nI wouldn't get that detailed in font choice \"context\" if I were you - it's quicksand.   \n   \n\\> what you would choose for: ....   \n   \nHey, I could waste _days_ on that... :-)   \n   \nhhp\n\n"
    },
    {
      "time": "23 May 2004 — 1:04pm",
      "content": "Sherlock\n\n"
    },
    {
      "time": "23 May 2004 — 1:05pm",
      "content": "For historical fiction, why not a typeface that is itself an historical fiction?   \n   \nBy that I mean one that is not a revival, but done in the style of a bygone era.   \n   \nAnd depending on how much anachronism there is in the story, that could effect the decision also.   \n   \nFor instance, Storm's \"Sebastian\" is an anachronistic historical fiction -- a sans serif from the 18th century -- so would be suitable for stories involving modern gadgets \"time-transported\" into the past.\n\n"
    },
    {
      "time": "23 May 2004 — 4:10pm",
      "content": "5{erstand why the chosen type in any way should interpret its content.   \n   \nYou're being rather severe with \"in any way\" -- surely the typography (and that includes the choice of face) can resonate with the subject matter without being heavy-handed?\n\n"
    },
    {
      "time": "23 May 2004 — 4:33pm",
      "content": "Imagine that, somethink Nick and I actually agree on.   \n   \nIndeed, if the typeface choice doesn't need to resonate with its content in any way, we wouldn't need more than a handful of functional typefaces in the world.   \n   \nI believe that the typeface choice shouldn't \\*get in the way\\* of the content, but that doesn't mean it can't \\*enhance\\* the content. That's sort of the purpose of having typefaces, in my mind.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "23 May 2004 — 4:45pm",
      "content": "Wow, now we've got a highly implausible _three-way_ agreement! :-)   \n   \nFredrik, this TOTALLY deserves its own thread - could you please start one - maybe taking the opportunity to explain why you think fonts can't help the content.   \n   \nhhp\n\n"
    },
    {
      "time": "23 May 2004 — 5:09pm",
      "content": "Hrant   \n   \n_. . . maybe taking the opportunity to explain why you think fonts can't help the content._\n\n"
    },
    {
      "time": "23 May 2004 — 5:10pm",
      "content": "I think a font can't help a content is the content doesn't want.   \nSomething like addicts.   \nThe typographic designer is a good message,   \nand the medium.   \nI also will enjoy the own thread about book fonts.\n\n"
    },
    {
      "time": "23 May 2004 — 5:15pm",
      "content": "\\< . . .maybe taking the opportunity to explain why you think fonts can't help the content. \\<   \n   \nPerhaps it is the Masimo Vignelli philosophy? Where would he have been without Helvetica and Bodoni? :-)   \n   \nChrisL\n\n"
    },
    {
      "time": "23 May 2004 — 5:22pm",
      "content": "Somewhere in the Alps making cheese?\n\n"
    },
    {
      "time": "23 May 2004 — 6:58pm",
      "content": "but the cheese holes would be quite precise Helvetica \"O\"s flush-left, ragged-right down the exact square block of cheese. And it would have been very beautifully done. :-)\n\n"
    },
    {
      "time": "23 May 2004 — 7:13pm",
      "content": "LOL!   \n   \n [http://www.logvin.ru/russian/portfolio/posters/large\\_pic/24.jpg](http://web.archive.org/web/20120902074849/http:/www.logvin.ru/russian/portfolio/posters/large_pic/24.jpg)\n\n"
    },
    {
      "time": "24 May 2004 — 5:49pm",
      "content": "LOL   \nThis must a poster on the death of Swiss typgraphy.   \n   \n:-)\n\n"
    },
    {
      "time": "31 May 2004 — 12:29am",
      "content": "Thanks for interesting answers. I still wonder should I tinker with the tracking setting in Indesign. My understanding is that if I use the default tracking (zero value), the body text will be much too tight for languages other than English. How can I find the correct setting - is there a rule of thumb?\n\n"
    },
    {
      "time": "31 May 2004 — 9:22pm",
      "content": "Interesting - Where did you hear/read that optimal tracking depends on language?   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2004 — 9:18am",
      "content": "Well, for example Berthold offers special BQ versions of many fonts. According to Berthold's web site:   \n\"The Berthold BQ and Adobe Berthold versions are derived from the same data source and so the character outlines are almost identical. The metrics (spacing and kerning) will differ considerably as the Berthold BQ versions have extended kerning for European languages (German, French, Italian etc.).\"   \n(Obviously English is not considered an European language by Berthold).   \nThis could be just sales talk, but if it isn't, then I should either buy the BQ version or increase the tracking?\n\n"
    },
    {
      "time": "1 Jun 2004 — 9:31am",
      "content": "Oh, but the kerning for European languages isn't there to tighten/loosen the overall setting, but to address some problem pairs that are not addressed in lower-ASCII. For example an Adobe font might have a pair for \"Ty\" but not \"T\n\n"
    },
    {
      "time": "1 Jun 2004 — 11:16am",
      "content": "I see.   \nI didn't know that B is disreputable... I wonder what is the story behind this.   \n   \nFollow-up to my original question: I'm about to use Sabon 11/14 for the detective story and ITC New Baskerville 12/15 for the historical fantasy novel for children. (My 8-year-old daughter much preferred Baskerville over Palatino).   \n   \nWhen in doubt pick Sabon or Baskerville.   \n   \nBTW, England is an European island.\n\n"
    },
    {
      "time": "1 Jun 2004 — 12:18pm",
      "content": "I'd still like to see how Trump Medieval looks in printed books - is it ever used today? It looks perhaps a bit masculine to my eye, like it has been cut with axe.\n\n"
    },
    {
      "time": "1 Jun 2004 — 12:52pm",
      "content": "Yes, Trump Medieval is used periodically in books, and I think it can work well when handled sensitively.   \n   \nI noticed it recently being used in a series of young adult novels by Gary L. Blackwood, the _Shakespeare Stealer_ series.   \n   \nLook for them next time you're in a book store and this will give you some idea of how it can work.   \n   \n-- K.\n\n"
    },
    {
      "time": "2 Jun 2004 — 3:59am",
      "content": "@Aku:   \nGo into a protestantic church in Germany :-)   \nThe\n\n"
    },
    {
      "time": "2 Jun 2004 — 1:14pm",
      "content": "\\>\\>BTW, England is an island. :-)   \n\\>\\> \\>\\>BTW, England is an European island   \n   \nI don't want to be pedantic, or to disrupt the thread, but England isn't an island.   \nThat would be Britain that you're thinking of.   \nBritain is an island ;-)\n\n"
    },
    {
      "time": "2 Jun 2004 — 1:42pm",
      "content": "I think Britain includes North Ireland. Therefore it cannot be an island.\n\n"
    },
    {
      "time": "2 Jun 2004 — 2:56pm",
      "content": "At the risk of being pedantic and disrupting the thread, this is the correct designation, as it appears on passports, etc.   \n   \nThe United Kingdom of Great Britain and Northern Ireland.\n\n"
    },
    {
      "time": "2 Jun 2004 — 3:54pm",
      "content": "Nick is right - Northern Ireland is the difference between Britain and the UK.   \n(Not 'North Ireland', though, as that would include bits of the Republic of Ireland. The wording is opposite to the difference between 'South Africa' and 'Southern Africa', but in both cases, one is a specific political area, so the other refers to a geographical area).   \n   \nOh sh1t - now I've been pedantic _and_ disrupted the thread.\n\n"
    }
  ]
}
