{
  "id": "48924",
  "title": "Inkscape now integrates Spiro",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "There's [YouTube video](http://web.archive.org/) of Inkscape's integration with Spiro.\n\n",
  "author": "abattis",
  "time": "29 Aug 2008 — 5:15pm",
  "uid": "16849",
  "comments": [
    {
      "time": "29 Aug 2008 — 5:32pm",
      "content": "Nice! [**Here**](http://web.archive.org/web/20150124044058/http:/www.youtube.com/watch?v=3OaLZuFZxdk) is the link.\n\n"
    },
    {
      "time": "29 Aug 2008 — 5:58pm",
      "content": "Wowow !!\n\n"
    },
    {
      "time": "29 Aug 2008 — 6:40pm",
      "content": "Looks great, but the whole SVG thing has me confused: can I draw with Spiro in Inkscape and output it to a format that can be used in Illustrator/Indesign and/or Fontlab?\n\n"
    },
    {
      "time": "29 Aug 2008 — 8:10pm",
      "content": "That's cool!\n\n@James: According to [this chart](http://web.archive.org/web/20150124044058/http:/wiki.scribus.net/index.php/Export/Import_capabilities_of_Scribus,_OpenOffice.org,_Inkscape,_GIMP,_and_Krita), Inkscape can export in Illustrator .ai format (among many others).\n\n"
    },
    {
      "time": "29 Aug 2008 — 10:04pm",
      "content": "Yeah, I'm really thrilled to see this happen. I think this is the way people are going to actually get to use Spiro, and (so I might be a little biased here), I think people are going to love it.\n\n"
    },
    {
      "time": "30 Aug 2008 — 12:35am",
      "content": "odd. I downloaded it, but it doesn't seem to want to work in either my iMac running Leopard or my eMac running Tiger. Is anyone else having this problem, or find a solution for that matter?\n\nJH\n\n"
    },
    {
      "time": "30 Aug 2008 — 5:43am",
      "content": "Wow, that video is very impressive!\n\n"
    },
    {
      "time": "30 Aug 2008 — 6:07am",
      "content": "Very cool indeed\n\n"
    },
    {
      "time": "30 Aug 2008 — 6:43am",
      "content": "@jazzhustler I'm not sure the official builds have this in place yet. Looks like it's part of the 0.47 release.\n\n"
    },
    {
      "time": "30 Aug 2008 — 7:29am",
      "content": "Thanks for letting me know Craig. I'll sit and wait patiently!\n\nJH\n\n"
    },
    {
      "time": "30 Aug 2008 — 2:20pm",
      "content": "@Jazzhustler: You'll need X11.app from the Mac OS install disk, and to download and compile the SVN version. If this is sounding like gobbledegook, just wait for the next release - or maybe the one after next... Spiro is still seen as very experimental.\n\n@raph: When's the next version of libspiro due out? Graphics software developers like Spiro but think its not stable enough :-)\n\n@Michel Boyer: Thanks for the working link! (TP munged my post because I tried to use the YouTube object embedding copy and past code I think)\n\n@James Puckett: If you want to make fonts with Spiro, drop FontLab and use FontForge.\n\n"
    },
    {
      "time": "30 Aug 2008 — 9:10pm",
      "content": "This is beyond cool. Very impressive guys.\n\nA question concerning that horizontal element at the top that's used to affect the actual curved drawing: I can imagine there are advantages to having such a one-step-removed, one-dimensional control, but would it also be possible to make the same sorts of modifications directly on the outlines? Or does it simply get too confusing in terms of not being sure what you're editing?\n\n\\> drop FontLab and use FontForge.\n\nWell, FontLab has a lot going for it, so it would be better -although I understand perhaps against the spirit of open SW- if Spiro worked in FontLab too. I suspect they'll be the ones knocking on your door...\n\nhhp\n\n"
    },
    {
      "time": "31 Aug 2008 — 2:58am",
      "content": "I wonder how Spiro compares to other on-curve-point editors. For example, AutoCAD has had an on-curve editor for a long time that works and feels quite okay. I don't know the mathematics behind it but they just all it \"splines\".\n\nAre there any significant advantages? Maybe if I find the time I will do a comparison.\n\n"
    },
    {
      "time": "31 Aug 2008 — 5:37am",
      "content": "the demo looks impressive, can't wait to try it out\n\n"
    },
    {
      "time": "31 Aug 2008 — 6:06am",
      "content": "I loved Spiro in FF already. Though the best method of drawing for me was a combination of spiro-drawing and then switching to bezier and play with the points.  \nGreat they integreated it into Inkscape!\n\nSzabolcs\n\n"
    },
    {
      "time": "1 Sep 2008 — 12:30am",
      "content": "I'm working on a PC - how can i download the 0.47 version? the video was amazing:-)\n\nthanks,  \nalex\n\n"
    },
    {
      "time": "1 Sep 2008 — 1:24am",
      "content": "Yipee, already got to try it.  \nalex, you can download the latest win build from [here](http://web.archive.org/web/20150124044058/http:/inkscape.modevia.com/win32/) (aug 30 version), you just need to download 7zip or Jzip to unzip\n\n"
    },
    {
      "time": "1 Sep 2008 — 12:54pm",
      "content": "Outrageously delicious. I hope FontLab is interested in integrating Spiro in some form.\n\n"
    },
    {
      "time": "1 Sep 2008 — 1:36pm",
      "content": "@alexfjelldal,  \nu should download the inkscape sources from the SVN and compile\n\nhere the compiling inkscape how-to, on mac, win an gnu/linux:\n\n[http://wiki.inkscape.org/wiki/index.php/CompilingInkscape](http://web.archive.org/web/20150124044058/http:/wiki.inkscape.org/wiki/index.php/CompilingInkscape \"http://wiki.inkscape.org/wiki/index.php/CompilingInkscape\")\n\nour 'D' screencast was made in inkscape from svn running on debian gnu/linux, and paper and pencil\n\nmore info here  \n [http://www.disenolibre.org/minombresbond/inkscape-spiro-lo-que-se-viene](http://web.archive.org/web/20150124044058/http:/www.disenolibre.org/minombresbond/inkscape-spiro-lo-que-se-viene \"http://www.disenolibre.org/minombresbond/inkscape-spiro-lo-que-se-viene\")\n\nthe svn developer version is somewhat unstable yet!\n\nmy english is very unstable too :P\n\nsaludos!\n\n"
    },
    {
      "time": "1 Sep 2008 — 1:42pm",
      "content": ".  \n.\n\n\\<- that logo was made with spiro too!\n\n"
    },
    {
      "time": "1 Sep 2008 — 2:17pm",
      "content": "There's also a screencast [here](http://web.archive.org/web/20150124044058/http:/screencasters.heathenx.org/wp-content/videos/ep067/ep067.html). Longer and slower than it needs to be, but shows off some functionality.\n\n"
    },
    {
      "time": "1 Sep 2008 — 3:16pm",
      "content": "@hrant\n\nin the screencast example we wanted to show spiro, compare with bezier nodes, and show how inkscape live path effects work, like layers that u can add or quit\n\nwe think that the 'harmonic softness' of spiro (like rubber band) make this splines an ideal for use in primive paths, and wanted to try\n\nyeah, it's rigth for this!\n\nbut, it is better to trace contours also, as can be seen at the end of that video of this LGM 2007 conference, when the speakers talk about spiro and trace glyphs contours incredibly easy\n\n[http://river-valley.tv/conferences/lgm2007/media/Dave\\_Crossland/flv/](http://web.archive.org/web/20150124044058/http:/river-valley.tv/conferences/lgm2007/media/Dave_Crossland/flv/ \"http://river-valley.tv/conferences/lgm2007/media/Dave\\_Crossland/flv/\")\n\n"
    },
    {
      "time": "1 Sep 2008 — 6:47pm",
      "content": "It seems like this continues the recent development of new tools for creating letters outside of tracing an outline with beziers -- Kalliculator, LivePen, and now this. None of these, as I've seen them so far, can really develop a complete font file the same way FontLab can, though. They seem like good tools for sketching an idea, and can take it to a pretty finished state, but there's still a lot of work to be done in FontLab. I hope somebody creates a tool that takes the best intuitive parts of Kalliculator, LivePen, and Spiro, and combines them into a full-fledged font development tool.\n\n"
    },
    {
      "time": "1 Sep 2008 — 7:45pm",
      "content": "For the record: I would never use Spiro for defining a \"skeleton\" and then expanding it. I would use it to demarcate the two borders between Black and White. Skeletons are for the undead.\n\nhhp\n\n"
    },
    {
      "time": "1 Sep 2008 — 9:28pm",
      "content": "hrant: I'm with you. There are applications, though, for which skeletons are appropriate, and Inkscape at least gives you the choice, as well as a much more sophisticated way to increase their expressiveness.\n\nI'm working on the chapter of my thesis that includes the comparison with Ikarus, so I just made this graphic, comparing Spiro with the example that Karow gave in his 1991 paper \" [Digital Punch Cutting](http://web.archive.org/web/20150124044058/http:/cajun.cs.nott.ac.uk/compsci/epo/papers/volume4/issue3/ep044pk.pdf)\". As you can see, it takes about half as many control points to achieve the same level of quality. I haven't tried the Autocad spline directly, but from what I have been able to find, it's based on NURBS, which is a polynomial spline roughly similar to the cubic Lagrange spline at the heart of Ikarus. I'd be very surprised if the Autocad and Ikarus splines were much different.\n\nDave: I'm still working on the stability question. It turns out to be a more interesting (i.e. harder) problem than I first thought. I have some Javascript code which is slightly better than the C implementation, but now I'm encouraged that a different generating curve may actually be even more robust. I'll release something before too long.\n\n ![](http://web.archive.org/web/20150124044058im_/http:/typophile.com/files/ikarus-spiro_3912.png)\n\n"
    },
    {
      "time": "1 Sep 2008 — 11:57pm",
      "content": "Amusing to hear the screencast narrator switching between \"spy-ro\" and \"speer-oh\". Have an official pronunciation, Raph?\n\n"
    },
    {
      "time": "2 Sep 2008 — 1:34pm",
      "content": "@raph: I love the way you use \"interesting\" as a euphemism for \"hard\" :-) I look forward to your next release with patience :-)\n\n@FeelTheKern: Combining parts of Kalliculator and LivePen isn't possible, since they are proprietary programs. How Spiro works isn't a secret, but its available under the GPL which means if any other program includes it, it must also not be secret. (Or pay Raph lots of money! haha :-) When I spoke to Frederick about making Kalliculator free software a few years ago, he didn't seem convinced, but there are rumours that he's changed his mind so fingers crossed :-)\n\nProbably what will happen is that Inkscape's calligraphic pen path tool will be extended from a 'one shot' tool to a skeletal one with much more control. There are existing efforts to add basic type design features to Inkscape directly too, for developing SVG Fonts, which will make the Inkscape -\\> FontForge workflow a lot smoother.\n\n"
    },
    {
      "time": "2 Sep 2008 — 2:04pm",
      "content": "Has the patent on skeletal strokes from Expression expired yet? (formerly of Creature House and Fractal Design, now owned by Microsoft). I don't think it's quite been 15 years since that first came out, but it's getting close.\n\nI haven't yet tried the similar feature of Inkscape. I suppose it could function in a sufficiently different way to not be infringing. Has there been any cause for concern?\n\n"
    },
    {
      "time": "3 Sep 2008 — 6:35am",
      "content": "These new tool features look amazing!\n\nWhy established illustration software giants (such as Adobe Illustrator) somehow fail to be ahead of the 'curve' in such innovative features is beyond me.\n\n"
    },
    {
      "time": "3 Sep 2008 — 7:07am",
      "content": "Because capitalism and true progress are actually not friends.\n\nhhp\n\n"
    },
    {
      "time": "4 Sep 2008 — 5:12am",
      "content": "@hrant: Not sure about that - the free software business community seems plenty capitalist to me ;p\n\n@cuttlefish: lol, first I've heard of such a patent. Could you explain in more detail? :-)\n\n"
    },
    {
      "time": "4 Sep 2008 — 1:53pm",
      "content": "@abattis: According to the Expression 3 manual:\n\n<cite>Creature House, the Creature House logo, Creature House Expression and Skeletal Strokes are trademarks or registered<br>\ntrademarks of Microsoft Corporation.</cite>  \n[...]  \n<cite>The Creature House Expression program Copyright © 2003 Microsoft Corporation, including the look and feel of the<br>\nproduct. The Creature House Expression 3 Manual Copyright © 2003 Microsoft Corporation. This manual, as well as the<br>\nsoftware described in it is furnished under license and may only be used or copied in accordance with the terms of such<br>\nlicense.</cite>  \n[...]  \n<cite>Microsoft may have patents, patent applications, trademarks, copyrights, or other intellectual property rights covering<br>\nsubject matter in this document. Except as expressly provided in any written license agreement from Microsoft, the furnishing<br>\nof this document does not give you any license to these patents, trademarks, copyrights, or other intellectual<br>\nproperty.</cite>\n\nI wish it were more specific about the patents involved. At a minimum, the term \"Skeletal Strokes\" is a Microsoft trademark, so Inkscape's similar feature would have to be named something else. If that's the only issue, it's not such a big deal. Still, it should be investigated to assure that there isn't more to it.\n\n"
    },
    {
      "time": "4 Sep 2008 — 2:17pm",
      "content": "It does take more than simple similarity of resultant function to constitute a patent infringement, doesn't it? Even in software?\n\nI don't know. I'm not a patent attorney, so I'm asking.\n\n"
    },
    {
      "time": "4 Sep 2008 — 11:36pm",
      "content": "Raph: Any idea when .47 is going to be available for us double-click dumbasses, who don't know anything about X11 and all that?\n\n"
    },
    {
      "time": "8 Sep 2008 — 10:37am",
      "content": "FeeltheKern:\n\nFrom an Inkscape dev: \"maybe maybe maybe by the end of the year, but no guarantee\"\n\nFrom another: \"Our goal is, before all, a stable and usable release. Right now the  \ncodebase is VERY destabilized, probably more so than ever before, due  \nto all the refactorings. As I wrote recently, even I sometimes have to  \ngo back to older stabler build to do some work. If we really focus on  \nthis, we probably can stabilize it enough for releasing within the  \nyear, but we have to work hard for that.\"\n\nIt seems the developers are also trying to fix this huge bug in the software: [https://bugs.launchpad.net/inkscape/+bug/264052](http://web.archive.org/web/20150124044058/https:/bugs.launchpad.net/inkscape/+bug/264052 \"https://bugs.launchpad.net/inkscape/+bug/264052\")\n\n"
    },
    {
      "time": "8 Sep 2008 — 10:42am",
      "content": "So I feel like digging into Inkscape/Fontforge/Spiro but don’t feel like screwing around with all this stuff on my Mac. What’s a Linux distro that will allow me to install/run these apps without getting into dependency hell?\n\n"
    },
    {
      "time": "8 Sep 2008 — 11:07am",
      "content": "@FeelTheKern: Installing X11 on Mac OS X is easy :-) Its on the Mac OS X DVD and is a simple double click install. Then to install and run Inkscape or FontForge you just download their Mac builds, drag them to Applications, start X11, and then click their icons like a normal Mac OS X program. However....\n\n@James: Building these tools from source is a requirement if you want to see the latest and greatest features. FontForge is notorious for having no hard dependencies, other than X11, and the latest version from CVS is often quite far in advance of the last released and packaged version. Similarly, Inkscape is currently in a rapid development phase and you'll need to build that from source too in order to see the latest Spiro features. I recommend using [gNewSense](http://web.archive.org/web/20150124044058/http:/www.gnewsense.org/), a version of Ubuntu with no proprietary software. That way you can see what a 100% free software system can do, and all the information available for Ubuntu will be applicable. The website offers an ISO CD image file you can burn off and restart your computer with in the usual way.\n\nIf you get stuck, just post on this thread specifically where you're at and I'll try to help out.\n\n"
    },
    {
      "time": "9 Sep 2008 — 7:20am",
      "content": "<cite>FontForge is notorious for having no hard dependencies, other than X11, and the latest version from CVS is often quite far in advance of the last released and packaged version.</cite>\n\nThis is true that FontForge will function fine without dependencies, but there are some libraries that will add features if installed (most notably libspiro, but there are others, listed on [http://fontforge.sf.net](http://web.archive.org/web/20150124044058/http:/fontforge.sf.net/)). Though the CVS gets well ahead, at least George does make the effort to post a release package on an almost monthly basis.\n\n"
    }
  ]
}
