{
  "id": "48950",
  "title": "Suggest a good Serif Font in Small Caps",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I'm putting together a website for a clothing company selling high end dress clothes. We want the feel of the site to be sort of british, european, established, royal, professional, formal, etc. For the menu items, I want to use a Serif Font in Small Caps. I will be rendering it fairly small, so it can't be too elaborate.\n\nI will be rendering the font in the web page with sIFR.\n\nA mock up of my design is currently here: [http://archimedescloth.com/wireframe/page16.html](http://web.archive.org/web/20150417151651/http:/archimedescloth.com/wireframe/page16.html \"http://archimedescloth.com/wireframe/page16.html\"). I am pretty happy with the font in the menu items now, it is MS Reference, with a 0.5px stroke, with the 1st letter of each word at font size 19, and the following letters at size 16. I'd prefer to find a font that looked something like this without having to modify the stroke and font size.\n\nAny suggestions? I really appreciate any advice.\n\nThanks,\n\nSeph\n\n| Attachment | Size |\n| --- | --- |\n| [Small-Caps.png](http://web.archive.org/web/20150417151651/http:/typophile.com/files/Small-Caps.png) | 71.17 KB |\n\n",
  "author": "Archimedes",
  "time": "31 Aug 2008 — 1:19pm",
  "uid": "36176",
  "comments": [
    {
      "time": "31 Aug 2008 — 3:28pm",
      "content": "hmmm...  \nI like Mrs Eaves small caps.\n\n"
    },
    {
      "time": "31 Aug 2008 — 7:03pm",
      "content": "British? Baskerville or Caslon?\n\n"
    },
    {
      "time": "1 Sep 2008 — 9:07am",
      "content": "Thanks - those are good suggestions, but not exactly what I'm looking for.\n\nFor this application the delta between the height of the big caps and small caps needs to be minimized. Most Serif Small caps seem to have the big caps about 50% taller than the small caps. I'd like to find a font where the delta is more subtle - like 10-20% or so.\n\nNot sure if this is clear - to put it another way, the small letters should be closer to the same size as the bigger letters (although still smaller).\n\nThus, when I put them on the screen in a menu bar where I am vertically constrained, the small letters can still be legible.\n\nAny other ideas?\n\nSeph\n\n"
    },
    {
      "time": "2 Sep 2008 — 5:38pm",
      "content": "If height control is what you want in caps, consider FF Atma:  \n [http://www.fontshop.com/fonts/downloads/fontfont/ff\\_atma\\_serif\\_book/](http://web.archive.org/web/20150417151651/http:/www.fontshop.com/fonts/downloads/fontfont/ff_atma_serif_book/ \"http://www.fontshop.com/fonts/downloads/fontfont/ff\\_atma\\_serif\\_book/\")\n\nFeijoa has a cracking set of small caps:  \n [http://www.klim.co.nz/feijoa\\_charset.php](http://web.archive.org/web/20150417151651/http:/www.klim.co.nz/feijoa_charset.php \"http://www.klim.co.nz/feijoa\\_charset.php\")\n\nAlso, if you want the delta to be small, try using small caps for everything and scale up the first letter 10% It will look fine, and not like fake small caps. If it were me I'd set straight small caps with no full caps.\n\nLastly, small caps should be generous in width and set loose. The narrow width and tight tracking on the caps in your layout looks like poop. All of this my opinion and not hard-n-fast rules. Good luck!\n\n"
    }
  ]
}
