{
  "id": "48965",
  "title": "15th Century Font needed urgently",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I originally posted this in the General Discussion Forum, but I think this may be the correct forum.\n\nIf this is in the wrong Forum, please let me know and I will repost in the right Forum.\n\nI am opening a shop in the UK very soon and I am looking for Letterhead etc.\n\nThe shop was built in the 15th Century, so I thought that a font which matched the building would be a good idea to reinforce the character etc.\n\nThe problem is that I am totally ignorant of 15th Century fonts. Are they available etc?\n\nAlso if I buy a font, I assume that I load the software and set it as me default font etc.However, will people be able to read emails written in the font etc?\n\nI do apologise for the naivety of my questions, but any help would be gratefully received.\n\nMany thanks in advance.\n\nThe font would be used on signage, hand painted and suitable large. It would also be used for Word documents, emails and newspaper adverts etc.\n\n",
  "author": "Gordon Jones",
  "time": "1 Sep 2008 — 3:23am",
  "uid": "36189",
  "comments": [
    {
      "time": "1 Sep 2008 — 4:02am",
      "content": "Here is a helper [Here is a helper](http://web.archive.org/web/20140407091415/http:/www.agdproject.com/timeline2.htm) on the styles of the 16th century (and further). You can then go to [Myfonts](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/) and search for those styles.\n\nAs you can see, there are a number of styles to choose from. You should probably narrow down the region/country of origin of the typeface to something that fits. Another consideration is that the styles in the timeline are all text faces from book printing applications. Popular signage/lettering from the era you'll have to Google for. Thirdly there are the many styles of handwriting from that period, that all carry special connotations. They divide into geographical areas, periods, fashions, occasions, and some are used specifically by some governments/regencies.\n\n"
    },
    {
      "time": "1 Sep 2008 — 4:06am",
      "content": "As far as composing emails with the 15th century font. Your recipients will not be able to view the message in the font unless they already have the font installed on their systems. (Unlikely)\n\nOne way to get around this is to save the text as an image, but you'll only want to do this for short blocks of text.\n\n"
    },
    {
      "time": "1 Sep 2008 — 4:06am",
      "content": "See also [The evolution of writing](http://web.archive.org/web/20140407091415/http:/www.textism.com/writing/).\n\n"
    },
    {
      "time": "1 Sep 2008 — 4:59am",
      "content": "Many thanks for your responses.\n\nThe shop is to be in Ipswich, England.\n\nI understand that I can only use the font for printing, or embedding i.e. images and pdf's.\n\nIhave found these three, but advice from wiser people is always welcome.\n\n[http://www.myfonts.com/fonts/ihof/p22-operina/corsivo/?s=ABCDEFGHIJKLMNO...](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/fonts/ihof/p22-operina/corsivo/?s=ABCDEFGHIJKLMNOPQRSTUVWYZP&case=default \"http://www.myfonts.com/fonts/ihof/p22-operina/corsivo/?s=ABCDEFGHIJKLMNOPQRSTUVWYZP&case=default\")\n\n[http://www.myfonts.com/fonts/sherwood/p22-grenville/p22-grenville/?s=App...](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/fonts/sherwood/p22-grenville/p22-grenville/?s=Apples&case=default \"http://www.myfonts.com/fonts/sherwood/p22-grenville/p22-grenville/?s=Apples&case=default\")\n\n[http://www.myfonts.com/fonts/grouptype/aquiline/regular/?s=Or+this+one+I...](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/fonts/grouptype/aquiline/regular/?s=Or+this+one+IP1+3AX%2C+but+the+O+is+small&case=default \"http://www.myfonts.com/fonts/grouptype/aquiline/regular/?s=Or+this+one+IP1+3AX%2C+but+the+O+is+small&case=default\")\n\n"
    },
    {
      "time": "1 Sep 2008 — 5:19am",
      "content": "P22 Operina Corsiva is the current favourite.\n\nAre there any similar, or more suitable than this, given the location etc?\n\n"
    },
    {
      "time": "1 Sep 2008 — 11:49am",
      "content": "Caxton Script ( [http://www.myfonts.com/fonts/suomi/caxton/script/charmap.html?vid=333950...](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/fonts/suomi/caxton/script/charmap.html?vid=333950&cpselect=CP5 \"http://www.myfonts.com/fonts/suomi/caxton/script/charmap.html?vid=333950&cpselect=CP5\")) will give you a good impression of 15th century english printing types. You may agree that this type is not so useful, as it is no very legible.\n\nHave a look at Willam Morris' Troy and Golden Type. Those are not true 15th centure types but - in my opinion - very good reconstructions. You may like the P22 Morris cd ( [http://www.myfonts.com/products/p22/william-morris-cd/](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/products/p22/william-morris-cd/ \"http://www.myfonts.com/products/p22/william-morris-cd/\")), but there are a lot more Morris adaptions - try a search on Morris at myfonts.com.\n\nwolfgang\n\n"
    },
    {
      "time": "1 Sep 2008 — 4:38pm",
      "content": "Those three are present-day versions of Renaissance Italian-style writing, Gordon.  \nThe Roman style of writing and type didn't arrive in England until the 16th century.\n\nIn 15th century England, the local style was \"Bastarda\".  \nThis was also the style of the first English typeface by Caxton.\n\nFor instance, below from the early 15th century, and below that from the second half of the century:\n\n ![](http://web.archive.org/web/20140407091415im_/http:/typophile.com/files/Chaucer_Hoccleve_5298.gif)\n  \n\n ![](http://web.archive.org/web/20140407091415im_/http:/typophile.com/files/05000802_3969.jpg)\n\nHere are some modern [Bastardas](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/search?search%5Btext%5D=bastarda/).\n\nI'd say pick the one that suits your line of business best.\n\n"
    },
    {
      "time": "3 Sep 2008 — 11:29am",
      "content": "Try Givry from type-together - looks like its worth every penny.  \n [http://www.type-together.com/ampl\\_font.php?idpuente=18&nomfuente=Givry](http://web.archive.org/web/20140407091415/http:/www.type-together.com/ampl_font.php?idpuente=18&nomfuente=Givry \"http://www.type-together.com/ampl\\_font.php?idpuente=18&nomfuente=Givry\")  \n [http://www.myfonts.com/fonts/type-together/givry/](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/fonts/type-together/givry/ \"http://www.myfonts.com/fonts/type-together/givry/\")\n\n-- [astype.de](http://web.archive.org/web/20140407091415/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "3 Sep 2008 — 11:44am",
      "content": "While the building is certainly some great context to build off of, it might be more prudent to build off the product/service you are actually providing in this shop.\n\n"
    },
    {
      "time": "3 Sep 2008 — 11:45am",
      "content": "You could always take the view that the building has lived many lives and mix it up a bit. Why not use something like Hoefler & Frere-Jones' [Historical Allsorts](http://web.archive.org/web/20140407091415/http:/typography.com/fonts/font_overview.php?productLineID=100012).\n\n"
    },
    {
      "time": "3 Sep 2008 — 4:04pm",
      "content": "Gordon I think you deserve a pat on the back for taking the extra trouble on this; most people would simply go to the local sign shop and ask for [Old English,](http://web.archive.org/web/20140407091415/http:/www.fontseek.com/fonts/old_english.htm) and whatever they got would pretty much blend into the (older) Ipswich landscape. Usually this stuff is unreadable because the sign shop set it all in capitals!\n\nClearly, you want something different. As Darrel suggests, sometimes there are other places to start from when thinking about the look of the shop frontage. Good luck.\n\n"
    },
    {
      "time": "3 Sep 2008 — 7:38pm",
      "content": "Andreas: _Givry_\n\nDon't you think the \"y\" would be mistaken for \"n\"?\n\n"
    },
    {
      "time": "4 Sep 2008 — 1:46am",
      "content": "You should possibly consider that your average customer is not going to be aware that your timeline in font matches. The fact that you found it necessary to ask here would indicate that. They may get that feeling somewhat if you use something that looks like an antique Roman or simple Blackletter. Tiffany's link seems like a good bet to me because its both a historic and elegant solution. Just be sure not to use something like a Bastarda for long text settings. Also, as Nick pointed out, some historic letters (such as long s) may be difficult for your customers to read.\n\n"
    },
    {
      "time": "4 Sep 2008 — 7:42am",
      "content": "_your average customer is not going to be aware that your timeline in font matches._\n\nThat's not an argument against doing what's best.  \nCompare the situation to using organic or fair trade food ingredients.  \nMost people can't tell the difference by taste.  \nThe benefits are elsewhere. In particular, one can expect synergies to emerge.\n\n"
    },
    {
      "time": "4 Sep 2008 — 9:25am",
      "content": "I agree Nick and didn't intend to downplay the role of appropriate and well-crafted typography. Many old style Roman types have origins that go back that far. Then there are antique versions of these that mimic early printing methods. I just thought since 15c would encompass a large chunk of time both typographicly and calligraphicly there would be a lot of room for interpretaion. Perhaps the surrounding architecture might help play a role in choosing a more specific type. Not being versed in type history like many folks here I would hesitate to offer a specific font, but would reccommend using something thats not cliche.\n\nOf course we could go with an organic, fair trade font. ;-)  \nSorry, couldn't resist.\n\n"
    },
    {
      "time": "4 Sep 2008 — 11:38am",
      "content": "_fair trade font_\n\nNothing from the big American corporations, then.\n\n"
    },
    {
      "time": "11 Sep 2008 — 8:42am",
      "content": "Many thanks for you responses.\n\nI do think that it is worthwhile to get a font as close to the Fifteenth Century as I can. Close is the operable word, in that it does not have to be an exact font from the period, but it should compliment the building\n\nI am getting closer now, even if it is just knowing what I do not want.\n\nI know that I do not want the flowery (is it Bastarda?) type fonts.\n\nAlso, as I intend to use it for Letterheads, Business Cards, Gift Vouchers, Posters/leaflets in the shop, and Shop Signage, I know it needs to be scalable, down to Business Card size.\n\nThere does appear to be one other common problem. Postcodes look decidedly odd in such fonts, as numbers are the same size as Lowercase letters. Is it possible to just increase the font size for them to be a similar size to Uppercase letters?\n\nMorris Golden matched all my requirements, I think, except it failed the postcode test.\n\nAny more ideas/contributions are gratefully received.\n\n(Edits added below)\n\nI have just found this one, which seems to tick my boxes. But does it tick yours as a decent imitation of a Fifteenth Century font?  \n [http://www.myfonts.com/fonts/grouptype/caslon-antique/](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/fonts/grouptype/caslon-antique/ \"http://www.myfonts.com/fonts/grouptype/caslon-antique/\") (non-italic verson).\n\nThere is a claim here to that period.  \n [http://www.aapainfo.org/atf/BBS.pdf](http://web.archive.org/web/20140407091415/http:/www.aapainfo.org/atf/BBS.pdf \"http://www.aapainfo.org/atf/BBS.pdf\")\n\n"
    },
    {
      "time": "11 Sep 2008 — 9:40am",
      "content": "Perhaps this is too much of an Italian blackletter/humanist transitional face (ie Subiaco) but [Litteratra](http://web.archive.org/web/20140407091415/http:/www.vllg.com/KLTF/Litteratra/mudTyper+Weights/) from KLTF/vllg is both legible and believably from the period. The italics are within the single (OTF) font file, under stylistic set 1.\n\n"
    },
    {
      "time": "11 Sep 2008 — 10:05am",
      "content": "Unfortunately the numbers fail the post code test. The numbers are the size of lower-case numbers, and are raised.\n\nI apologise if this is a pedantic requirement, but I think it is important as it wil be used for post-codes etc. By post code I mean IP1 1DP, for those not familar with UK post-codes.\n\n"
    },
    {
      "time": "11 Sep 2008 — 10:43am",
      "content": "I think you really need two fonts that work together. One bears most of the burden of conveying the character you intend, and the other bears most of the burden of readable communication. The font used for the company name on the letterhead shouldn't in this case be the same one in which that the letter itself is set. Look at the [beer label thread](http://web.archive.org/web/20140407091415/http:/typophile.com/node/49157) - most of those don't use the same blackletter or script in the brandname for the smaller and longer texts describing the beer, brewery location, ingredients, etc.\n\n"
    },
    {
      "time": "11 Sep 2008 — 11:59am",
      "content": "We also have the same difficulty in Canada, but small caps help. I have no special cross to bear regarding this type but there are both small caps and titling figures in the face (see below); they're just not evident from the sample they give you in the preview. NB: I accessed these features from InDesign.\n\nEliason raises an excellent point however. What about something like [Plantin](http://web.archive.org/web/20140407091415/http:/www.linotype.com/1345/plantin-family.html) for a supporting face?\n\n ![](http://web.archive.org/web/20140407091415im_/http:/typophile.com/files/litt-example_6308.gif)\n\n"
    },
    {
      "time": "11 Sep 2008 — 12:12pm",
      "content": "I quite like that font, not sure about the \"s\", though.\n\nAnd the Plantin could well work for the body of text.\n\nSo when I get the fonts there are features to enable appropriate sizing etc? (I apologise for my ignorance again, and thank you for your contributions?)\n\n"
    },
    {
      "time": "11 Sep 2008 — 1:46pm",
      "content": "It depends on the face and the layout software you have. If you get a standard-issue regular-set PostScript face, it will only contain one type of figure style, and will not contain small caps. These character sets usually contain only tabular lining figures, meaning all of the number have the same space around them and are all about cap-height. The numbers 1 and 0 usually look awful in this setting. The problem is that in this older format (and TrueType shares this difficulty) is that there are only 215 slots for various characters (glyphs) - not nearly enough for good typographic design. So the PostScript-format faces got around this by having supplementary set - 'expert' sets - that would contain small caps or text figures - anything that was lacking in the regular set.\n\nThere's a newer format called OpenType where all of these characters (or glyphs) are in one typeface. This format I think can handle 12,000 characters, so there's more than enough room. Not all faces use all of the possible features, so you need to examine the manufacturer's description carefully. Generally if it's called 'OpenType Pro' you'll get complete typographic support. Contact the seller directly, if in doubt.\n\nBUT to access these characters you need a layout program that can us the font properly. InDesign can, and I think that Illustrator CS2 or later can as well. I'm unclear about Quark as the last time I checked they were still accessing only the first 256 characters of an OpenType font. Doubtless this has changed, but you'll need to have an up-to-date version. While MS Word can read and use OpenType fonts it cannot (it seems) access any special features, such as small caps. It can use any multi-lingual features (such as Greek or Arabic characters in the typeface), but then that's not what you need here.\n\nI hope this helps.\n\n"
    },
    {
      "time": "11 Sep 2008 — 3:57pm",
      "content": "Hallowing Hollanders! The Historical Allsorts collection is fantastic! Thanks for the lead.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20140407091415/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "11 Sep 2008 — 8:43pm",
      "content": "There's also [this](http://web.archive.org/web/20140407091415/http:/www.lazydogs.de/fabiol), a rusticated Garamond by Robert Slimbach, the creator of Adobe Garamond. Garamond's a 16th century kind of thing, but perhaps this could be of some use.\n\n"
    },
    {
      "time": "12 Sep 2008 — 2:39am",
      "content": "Many many thanks for your answers and the time you have taken.\n\nI am not a Designer or Publisher, I will be a humble shop owner who wants a font to compliment the character of the shop. I intended to design the Business Card, Letterhead etc and pass them to the Printers (with the font software). I will be printing out Price Lists, Notices etc for the shop on the (yet to be bought) printer. I was hoping to just use MSWord for this. I am deluding myself, that it is that straight forward.\n\nHere is my final shortlist. Do they look Fifteenth Century(ish) and suitable for someone who wants to install them, then type and print?\n\n[http://www.myfonts.com/fonts/grouptype/caslon-antique/](http://web.archive.org/web/20140407091415/http:/www.myfonts.com/fonts/grouptype/caslon-antique/ \"http://www.myfonts.com/fonts/grouptype/caslon-antique/\")  \n [http://www.faces.co.uk/fonts/Elsner-Flake/Garamond-Rough-H-Regular-EF163...](http://web.archive.org/web/20140407091415/http:/www.faces.co.uk/fonts/Elsner-Flake/Garamond-Rough-H-Regular-EF16331/index.cfm \"http://www.faces.co.uk/fonts/Elsner-Flake/Garamond-Rough-H-Regular-EF16331/index.cfm\")  \n [http://www.faces.co.uk/fonts/Elsner-Flake/Cloister-Old-Style-B-Roman-EF1...](http://web.archive.org/web/20140407091415/http:/www.faces.co.uk/fonts/Elsner-Flake/Cloister-Old-Style-B-Roman-EF12821/index.cfm \"http://www.faces.co.uk/fonts/Elsner-Flake/Cloister-Old-Style-B-Roman-EF12821/index.cfm\")\n\n"
    }
  ]
}
