{
  "id": "48966",
  "title": "Compendium, new Sudtipos font",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Ale Paul](http://web.archive.org/web/20101125152930/http:/typophile.com/user/827 \"View user profile.\") : 1.Sep.2008 5.59am \n\n**[Compendium](http://web.archive.org/web/20101125152930/http:/www.veer.com/products/typedetail.aspx?image=UMT0000365)**\n\n ![](http://web.archive.org/web/20101125152930im_/http:/typophile.com/files/Compendiumpress_6243.png)\n\nDon not forget to grab the [Compendium PDF](http://web.archive.org/web/20101125152930/http:/www.veer.com/download/pdf/compendium.pdf) with wonderful photography by [Gonzalo Aguilar](http://web.archive.org/web/20101125152930/http:/www.flickr.com/photos/zydeko_mx/sets/72157603928614774)\n\n\"Compendium is a sequel to my Burgues font from 2007. Actually it is more like a prequel to Burgues. Before Louis Madarasz awed the American Southeast with his disciplined corners and wild hairlines, Platt Rogers Spencer, up in Ohio, had laid down a style all his own, a style that would eventually become the groundwork for the veering calligraphic method that was later defined and developed by Madarasz.\n\nEven though the current trend of extending older popular typefaces can play tricks with a type designer’s mind, and maybe even send him into strange directions of planning, my purpose is not the extension of something popular. My purpose is presenting a more comprehensive picture as I keep coming to terms with my obsession with 19th century American penmanship.\n\nThose who already know my work probably have an idea about how obsessive I can be about presenting a complete and detailed image of the past through today’s eyes. So it is not hard to understand my need to expand on the Burgues concept in order to reach a fuller picture of how American calligraphy evolved in the 19th century. Burgues was really all about Madarasz, so much so that it bypasses the genius of those who came before him. Compendium seeks to put Madarasz’s work in a better chronological perspective, to show the rounds that led to the sharps, so to speak.\n\nAnd it is nearly criminal to ignore Spencer’s work, simply because it had a much wider influence on the scope of calligraphy in general. While Madarasz’s work managed to survive only through a handful of his students, Spencer’s work was disseminated throughout America by his children after he died in 1867. The Spencer sons were taught by their father and were great calligraphers themselves. They would pass the elegant Spencerian method on to thousands of American penmen and sign painters.\n\nThough Compendium has a naturally more normalized, Spencerian flow, its elegance, expressiveness, movement and precision are no less adventurous than Burgues. Nearing 700 glyphs, its character set contains plenty of variation in each letter, and many ornaments for letter beginnings, endings, and some that can even serve to envelope entire words with swashy calligraphic wonder. Those who love to explore typefaces in detail will be rewarded, thanks to OpenType. I am so in love with the technology now that it’s becoming harder for me to let go of a typeface and call it finished.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20101125152930/http:/typophile.com/user/827\" title=\"View user profile.\">Ale Paul</a>",
  "time": ": 1.Sep.2008 5.59am",
  "uid": "827",
  "comments": [

  ]
}
