{
  "id": "48971",
  "title": "Calling all font makers - the W3C wants to hear from you",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "When I talk to type designers and foundry representatives about issues related to Web fonts they often state that they feel as if they don’t have a voice that’s heard by standards bodies and browser makers.\n\nTo address this issue I’ve set up a conference call with Bert Bos (W3C staff contact for the CSS working group) and his colleagues from W3C. Bert wants to hear directly from people making fonts about issues related to fonts and the Web, font-linking (as recently implemented in Safari) and efforts to standardize the Embedded OpenType (EOT) format.\n\nThe call will take place on Wednesday September 3rd at 8am Seattle time, that’s 11am east-coast, 4pm in the UK and 5pm in mainland Europe.\n\nIf you’re a type designer or foundry rep and would like to be on the call please send me a mail and I’ll send local call in numbers. If the number of participants is high, or the time inconvenient, we’ll set up a second call at a later date.\n\nIn other news, providing he can get his visa, Bert will be joining the Web fonts panel at ATypI St Petersburg next month, and will be able to chat with type designers in person about these issues.\n\nCheers, Si\n\n(cross-posted to ATypI list)\n\n [‹ Help with Identity](http://web.archive.org/web/20081201142847/http:/www.typophile.com/node/49903 \"Go to previous forum topic\") [The perplexing upper case of the Monotype 'Porson' Greek ›](http://web.archive.org/web/20081201142847/http:/www.typophile.com/node/49747 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201142847/http://www.typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 1.Sep.2008 10.09am",
      "content": "Thank you Simon.\n\nhhp\n\n"
    },
    {
      "time": " 1.Sep.2008 12.52pm",
      "content": "Thanks Si!\n\nChrisL\n\n"
    },
    {
      "time": " 3.Sep.2008 5.47pm",
      "content": "We had the first call this morning and I think it was quite productive. Planning to have a second call - let me know if you’re interested in joining.\n\n"
    },
    {
      "time": " 3.Sep.2008 6.35pm",
      "content": "The timing last time wasn’t good for me.  \nDon’t mind me too much, but next time if  \nthe timing is good I’ll definitely join in.\n\nhhp\n\n"
    },
    {
      "time": " 3.Sep.2008 9.46pm",
      "content": "Was thinking maybe 8am West coast time (to facilitate Europe) on Monday the 15th. Does that work for you? If not please let me know here or off-list what times might work.\n\n"
    },
    {
      "time": " 13.Sep.2008 9.09pm",
      "content": "Last call for participants!\n\nToo late, too late will be the cry when fonts on the web have passed you by.\n\n"
    },
    {
      "time": " 13.Sep.2008 9.34pm",
      "content": "I’m still having difficulty wrapping my head around this.  \nMaybe I will understand it better after the ATypI panel discussion.\n\n"
    },
    {
      "time": " 15.Sep.2008 7.28am",
      "content": "It sounds like a group conference via a group telephone call arrangement of some kind. Looks like I got here a bit late, but thanks for posting hte info anyway Sii. It’s just good to know W3C is interested in hearing from fontmakers directly. I mean, it’s an encouraging development.\n\nj a m e s\n\n"
    },
    {
      "time": " 15.Sep.2008 9.52am",
      "content": "Yep, sorry you weren’t able to make it. Notes from the calls should be posted shortly.\n\nCheers, Si\n\n"
    },
    {
      "time": " 15.Sep.2008 10.21am",
      "content": "Thank you for organizing the phone conference, Simon.\n\n"
    },
    {
      "time": " 15.Sep.2008 4.41pm",
      "content": "I have to post an extra thank you to Sii because he is one of the type biz’s leading technical people and he has done a flawless job of keeping us informed and saddled up on the whole web fonts issue. You can trust this man, and Thomas Phinney too, to get the facts right and coordinate the interests of all players with maximum relevance and diplomacy.\n\nLooks like I was right about W3C and Jim Puckett was a little too skeptical of their role. Perhaps somebody at W3C read one of the recent threads we had here and took the hint. However it transpired, thanks, guys. The best way to move forward on web fonts is together.\n\nj a m e s\n\n"
    },
    {
      "time": " 15.Sep.2008 5.26pm",
      "content": "Glad to hear that the W3C is a little less out there than I suspected.\n\n"
    },
    {
      "time": " 15.Sep.2008 6.22pm",
      "content": "good news.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081201142847/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 17.Sep.2008 4.35am",
      "content": "“When I talk to type designers and foundry representatives about issues related to Web fonts...”\n\nYou keep trotting this out, as you did in the conference call, without mentioning names.  \nSupply me with a list of the type designers and foundry representatives who support EOT and have significant IP at risk.  \nI can fix it. ;-)\n\nCheers!\n\n"
    },
    {
      "time": " 17.Sep.2008 5.04am",
      "content": "“When I talk to type designers and foundry representatives about issues related to Web fonts _they often state that they feel as if they don’t have a voice that’s heard by standards bodies and browser makers._”\n\nA specific example would be Nick Shinn here on Typophile, who felt that the W3C would not listen to type designers concerns.\n\n\\>Supply me with a list of the type designers and foundry representatives who support EOT and have significant IP at risk.\n\nI can’t speak for type designers or foundries other than Microsoft, and I’ve actually stated publically that few currently support EOT in their EULAs. However, I can state with confidence that the number of font vendors considering supporting EOT is infinitely larger than those considering the alternative.\n\n"
    },
    {
      "time": " 17.Sep.2008 5.39am",
      "content": "Here’s the thread in question...\n\n[http://typophile.com/node/46896](http://web.archive.org/web/20081201142847/http:/typophile.com/node/46896 \"http://typophile.com/node/46896\")\n\n...2nd post down.\n\nCheers, Si\n\n"
    },
    {
      "time": " 17.Sep.2008 8.02am",
      "content": "”...Nick Shinn here on Typophile, who felt that the W3C would not listen to type designers concerns.”  \nClearly, I would not listen to Nick on this topic either, sorry. Who else?\n\n“I can state with confidence that the number of font vendors considering supporting EOT is infinitely larger than those considering the alternative.”  \nMaybe, we have different definitions of infinity. Font vendors considering supporting EOT _are dealing with the ’alternative’_ that’s been adopted by the w3c, consideration is/was not a consideration. Should we deal with EOT too? with users having both? and with neither? and ’explain’ it all to font designers, lawyers, licensees, and web designers? How? EOT is not a new font format, and since it is the most illegal and dangerous of the options, I cannot support the proposed version.\n\n“We analyzed 30+ EULAs and none allowed posting to Web sites.”  \nSurprise! For an active vendor in this area to allow posting to Web sites, would require a linking situation with either accountability, or other protection, _and then_ a EULA can be written.\n\n**In the mean time, all in favor of Microsoft’s call to join ’Web Font Linking Wars’, please step forward.**\n\nCheers!\n\n"
    },
    {
      "time": " 17.Sep.2008 10.54am",
      "content": "\\>Who else?\n\nDezcom. I think he made similar observations re the lack of a voice.\n\n\\>I cannot support the proposed version.\n\nAnd that’s fine. There’s nothing wrong with sitting on the sidelines. As you know, because you were on the call (for some reason you failed to mention your “illegal and dangerous” objections???) that we see EOT, as currently spec’d, as a “Version 1” technology, and we don’t expect it to be embraced by every font vendor (heck, some don’t even allow PDF of SWF embedding!). But it’s a starting point that can be built upon by the community (ie. the font community) and not a bunch of browser makers who don’t care about people who make fonts.\n\nBut theoretically as EOT is bad and font linking, as currently implemented, is bad. What’s your alternative?\n\n"
    },
    {
      "time": " 17.Sep.2008 12.13pm",
      "content": "“Dezcom. I think he made similar observations re the lack of a voice.”\n\nSi, my comments were directed to the end of having all the stakeholders get a voice before something is done we may all regret. My problem is that I am not knowledgeable enough to speak for anyone other than to say that those who know more about the technology and the potential ramifications in the type community should be speaking up. I am concerned about intellectual property rights of all designers and foundries and the potential for easily stealing type. More than that—I think it is another way to convince the public that type is free because it can distributed free from a web browser so why should they have to pay for it for print use..\n\nChrisL\n\n"
    },
    {
      "time": " 17.Sep.2008 2.04pm",
      "content": "Were the notes from the call posted to the ATypI list and not Typophile?\n\n"
    },
    {
      "time": " 17.Sep.2008 8.31pm",
      "content": "So far the notes (prepared by Bert) have been passed to the people invovled in the conference calls. They need to be updated based on the second call. Then if there are no corrections from the participants they’ll be posted to the W3C site.\n\n"
    },
    {
      "time": " 18.Sep.2008 6.21pm",
      "content": "Simon: “There’s nothing wrong with sitting on the sidelines.”  \nI’m a player, coach, and owner and so I know when it is half time.  \nYou must, by the furiousness of your horn-blowing, be with the marching band.\n\n”...(for some reason you failed to mention your “illegal and dangerous” objections???)”  \nI did no such thing. Community-building, is a good reason. You were the one who said there are hundreds of EOTs out there we don’t know about. I shut up for your sakes in front of your guests. I’ll be no more polite in the future, if you insist.\n\n”...that we see EOT, as currently spec’d as a “Version 1” technology,...”  \nThe spec itself says version 3.3 — I wish it was 1.0, and start it right. How far off is it? How can I take the notion of a transportable font format with panose values in it seriously, when bull boobs keep coming to mind?\n\n“But it’s a starting point that can be built upon by the community (ie. the font community) and not a bunch of browser makers who don’t care about people who make fonts.”  \nOh those evil browser makers. I’m not saying patriotism is the last refuge to which a scoundrel clings, oops, I guess I am. Also, remember the E in EOT, it is a problem. There is no “Embedding” in EOT, and there are no “Linking Bits” in the open font format — cart (linking), follows horse (format), eula follows cart. We could call it LOT...\n\n“But theoretically as EOT is bad and font linking, as currently implemented, is bad.”  \nThe Embeddable OpenType proposal is currently worse, for several reasons and I said so. Shooting at the messenger is not community building. Font linking, as currently implemented, is honest, leaving the fonts in their native format, where one can always find them, and there is more.\n\n“What’s your alternative?”  \nMy alternative is my business to propose in the right places at the right times to the right people, which here, now, and you is/are not.\n\nBy the way, while you’re ’over there”, understand that you are in a preview of an EOT-like typographically lawless society gone wild. So, see if you can find a local type designer who could survive a blood donation.\n\nDez: “...before something is done we may all regret.”  \nA little late for that.\n\nSimon: “They need to be updated based on the second call.”\n\nAnd when that happens, I’ll be ready.\n\nCheers!\n\n"
    },
    {
      "time": " 18.Sep.2008 11.10pm",
      "content": "\\>I shut up for your sakes in front of your guests.\n\nYou’re breaking my heart. The calls were set up so you, and people like you, could let the W3C know your position on EOT and font linking - sorry you felt you had to hold back because I was on the phone. :-(\n\n\\>I’m a player, coach, and owner\n\nI see, you’re letting the other team run up the score, so your second half comeback will all the more impressive. Or maybe you’ve placed a bet on the other side, just in case?\n\n\\>My alternative is my business to propose in the right places at the right times to the right people, which here, now, and you is/are not.\n\nAh, another secret business model, or perhaps you have a trick play. I like it. ;-)\n\n"
    },
    {
      "time": " 19.Sep.2008 6.01am",
      "content": "A trick play? There are no plays at all!\n\nWhen the game is on, and the EOT team shows up after training for years ready to play, and the other team doesn’t show up at all, the referees are obligated to call a forfeit. Game over. See you next year.\n\n"
    },
    {
      "time": " 19.Sep.2008 6.43am",
      "content": "<cite>When the game is on, and the EOT team shows up after training for years ready to play, and the other team doesn’t show up at all, the referees are obligated to call a forfeit.</cite>\n\nNo, the EOT team will be busy screwing around in the locker room with DRM methods. But it won’t matter because the pirates all have the complete fonts anyway. And then the fans will go ape when a new team shows up with a bunch of fonts licensed for @font-face linking.\n\n"
    },
    {
      "time": " 19.Sep.2008 7.06am",
      "content": "<cite>But it won’t matter because the pirates all have the complete fonts anyway.</cite>\n\nBut the pirates were never your customers anyway. Hope for a major corporation to pirate your fonts, and laugh all the way to the bank.\n\n"
    },
    {
      "time": " 19.Sep.2008 7.45am",
      "content": "<cite>But the pirates were never your customers anyway.</cite>\n\nShhh! You’ll upset people who can’t stop angsting over all the sales they’re losing to people who don’t pay for fonts to begin with.\n\n"
    },
    {
      "time": " 19.Sep.2008 8.04am",
      "content": "Simon: \\>You’re breaking my heart.  \nI’ll send a surgeon! He’ll be in St. Pete by Sunday, so set some time aside for a... Dr. Aorta D. Stitcher.  \nI didn’t only feel like I should hold back, but also that the EOT fans were dominant in the direction you wanted the conversation to be structured. W3C talks, then each foundry talks, you and Thomas get to talk whenever you want. The coughing, sneezing, paper shuffle and echoing feedback hurts all of our ears, and then its over, we can get back to making money by our own herculean efforts and you all can go back to napping while you vest, having been paid to direct the conversation, while we were spending money to debunk.\n\n\\>Or maybe you’ve placed a bet on the other side, just in case?  \nThere is no other side Mr. I. M. Community Builder, just us. One big happy community o type designers, OS vendors, standard makers, application folk, and web designing angels, all trying our hardest to make type and typography something that the big happy community of users... lawyers, teachers, students, .com millionaires, starving artists, priests, poets and prostitutes, farmers, coal miners, flight engineers, toad collectors, landscape activists, firemen, police officers, politicians, actors, software criminals, musicians, talk show hosts, translators, transporters, flight attendants, martial arts instructors, butchers, bakers and candlestick makers, beauty queen candidates, and project coordinators... I say, you didn’t answer any of my questions, Simon. Who’s the secretive one again, I forget?\n\nBS\\>When [] the EOT team shows up [] ready to play, and the other team doesn’t show up at all, the referees are obligated to call a forfeit. Game over.  \nBS, we all are showing up! Nearly all of us are saying we don’t think this is well planned, from the independent font industries point of view. EOT was developed 10 years ago for something else, not this. I add, that as its heading, it reeeallllly sucks for users, and web designers.\n\nAnd, what referees? The W3C has adopted @fontface. The Microsoft Windows Internet Explorer group, alone amongst all of the browser makers, has stated they “Will not support @fontface, ever!” The W3C cannot withdraw @fontface can they? The Internet Explorer team is trying desperately to ’protect the font industry’ and the W3C, (those allegedly fonthirsty bastards), are trying to kill us... I don’t think so. I made the suggestion, MS and W3C settle their issues, AND THEN, the font industry can cohesively, (or not), lobby for what’s needed among the surviving technological solution(s). Ideally, this would be done after the font format...  \nBut, it is either @FF alone, or both. EOT alone is not an option, for either, or any community.\n\nCheers!\n\n"
    },
    {
      "time": " 19.Sep.2008 8.09am",
      "content": "EOT’s downfall will likely be the want for DRM capabilities. That simply won’t survive very long in the wild.\n\nIt’s great that the teams are talking, though. W3C is no different than any open political system...those who vote, get the say.\n\n"
    },
    {
      "time": " 19.Sep.2008 11.36pm",
      "content": "David,\n\n\\>I didn’t only feel like I should hold back, but also that the EOT fans were dominant in the direction you wanted the conversation to be structured.\n\n\\>The Internet Explorer team is trying desperately to ’protect the font industry’ and the W3C, (those allegedly fonthirsty bastards), are trying to kill us... I don’t think so\n\nYour theories, as always are immensely interesting and entertaining. But there’s something missing from this latest conspiracy theory. What’s IE’s motivation for not supporting font linking, if it’s not to support the interests and wishes of type designers and vendors?\n\nWe’re not winning any friends in the standards or web design world for taking this stand. It would certainly make life so much easier for everyone if the font design community would embrace font linking, change their licensing models and give us the green light to support it. Any chance that will happen? “I don’t think so.”\n\n\\>and you all can go back to napping while you vest, having been paid to direct the conversation,\n\nI’m not on the clock at 8am. I called in from home.\n\n\\>while we were spending money to debunk.\n\nI sent you an 800 number?\n\n"
    },
    {
      "time": " 20.Sep.2008 5.04am",
      "content": "Simon: We’re not winning any friends in the standards or web design world for taking this stand.\n\nAnd I appreciate the stand your company has taken. My deep and sincere apologies for any and all misguided slime, hot headedness, or other etiquette-busting behavior I’ve displayed on this topic over the past few weeks. I only wish I’d composed some of it in 6 pt. Algerian, Playbill, something equally as daft, or not at all.\n\nCheers!\n\n"
    },
    {
      "time": " 20.Sep.2008 7.02am",
      "content": "Roger Black gave some of the details in his talk today...\n\n1. Large corporate customer commissions custom type, and is willing to post it on a web server, and allow anyone access to it.\n\n2. Fonts are only linked to pages behind a registration barrier - not accessible to unregistered users.\n\n3. EOT is also posted for IE users.\n\n4. Any unauthorized usage of the font (ie print, reposting on other sites) should be easy to spot, and is enforced in the traditional way (invoices and cease & desists)\n\nI think this is basically what you suggested back at TypeCon Boston. And it might work. It’s certainly worth a try. Best of luck.\n\nI also suggested to Bert Bos that he talk to you directly, so as to avoid any Si bias.\n\nChears!\n\n"
    },
    {
      "time": " 20.Sep.2008 7.05am",
      "content": "sii — <cite>What’s IE’s motivation for not supporting font linking, if it’s not to support the interests and wishes of type designers and vendors?</cite>\n\nGood or bad intentions aside, what matters is the effect that something — an additional font format — has or may have.  \nAn EOT font, according to current specs, is a wrapper around a ’normal’ OT font. It may or may not be subsetted. May or may not be compressed. DRM is not touched in the specs. This means, the minimum EOT font _is_ an OT font.  \n [EOT specs](http://web.archive.org/web/20081201142847/http:/www.w3.org/Submission/EOT/) say that <cite>3) User Agents may download, extract and temporarily install fonts of the EOT file suffix that are included in the @font-face definition of a CSS style sheet.</cite> Which I assume is about the same behavior as with ’normal’ OT or TT fonts.  \nGiven the lack of functional differences between OT and EOT, I miss the basis for IE’s movitation to allow [only EOT](http://web.archive.org/web/20081201142847/http:/msdn.microsoft.com/en-us/library/ms530757.aspx) for use with @font-face — as opposed to support it as an additional font format.\n\n[Caveat: Web design and related things are not my business.]\n\n"
    },
    {
      "time": " 20.Sep.2008 7.16am",
      "content": "Maybe going a bit off-topic, wish you were here at ATypI. :-)\n\nNot supporting font linking, and submitting EOT spec for possible standardization are not the same thing.\n\nBut essentially yes they use the same mechanism and work in the same way - only difference (in the specific case you mention) is that the font posted on the server won’t work as a desktop font - can’t be dragged and dropped into the fonts folder. I would expect commercial font licenses would also require URL binding be used.\n\n"
    },
    {
      "time": " 20.Sep.2008 9.15am",
      "content": "Indeed different issues but related since an EOT-only approach of IE “encourages” production of EOT fonts while for other browsers “normal” OT fonts may do.\n\nMaybe neither not-a-desktop-font nor URL-binding would require EOT — both are mere “user agent” behavior. (An additional/extended OT table for URL-binding?)\n\nI am attending remotely, thanks to your flickr photos. :) It looks like a really nice location and rooms.\n\n"
    },
    {
      "time": " 21.Sep.2008 4.56am",
      "content": "Simon,\n\nKinda makes one wish you had EOT right here! right now! You might set:  \n“1. Large corporate customer commissions custom type, and is willing to post it on a web server, and allow anyone access to it.”  \n...in an elephantine face until you’d want to set “allow anyone access to it”, in something _ **really bold!** _  \nThen,  \n“2. Fonts are only linked to pages behind a registration barrier - not accessible to unregistered users.”  \n...could be set in 2 point Cascade. ;-)\n\nI’m also curious as to what, or who you think is gonna make a successful “commercial font license”?  \nI can see our model, (models actually as the one you are quoting is but one), and Ray Larabie’s model quit clearly. . .\n\nI’m also curious as to who wrote “What’s wrong with FONT FACE” on your web site: ( [http://www.microsoft.com/typography/web/designer/face7.htm](http://web.archive.org/web/20081201142847/http:/www.microsoft.com/typography/web/designer/face7.htm \"http://www.microsoft.com/typography/web/designer/face7.htm\"))  \nE.G. Isn’t “Users can’t override fonts specified using FONT FACE” currently one of the major advantages web designers see in imaged type? and isn’t it also currently one of the major advantages seen by the publications using the Microsoft Reader technology? And why would “Control over font style and weight is difficult” matter when the exact style and weight are being linked to? ’m afraid, once I eliminate the wrong wrongs from this page, it’s quite empty. :-)\n\nk.l.,\n\nI hope everyone becomes as hip to this as you! :-)\n\nCheers!\n\n"
    },
    {
      "time": " 21.Sep.2008 10.22am",
      "content": "I don’t think focusing on the packaging of fonts for the web, i.e. the delivery format (.ttf or .eot), makes much sense. A font, in whatever format, is going to be served data, so the focus should be on server models, i.e. on where the fonts are stored, how they are published, how they are accessed, and how money changes hands. We already have well-established models for storing data and serving it in bits and bytes over the web, and for charging money based on traffic: this is how ISPs make money.\n\nDuring the webfont panel discussion at TypeCon, Erik van Blokland described a relationship between font foundries, web developers/publishers, and people looking at websites. The missing element from this description is the server, which necessarily sits between the people publishing websites and the people looking at websites. Nadine Chahine pointed this out after the panel discussion, and got me thinking that the server — as a machine handling font data and as the company providing this service — could also sit between the font foundry and the web publisher.\n\nSo here’s a model for webfonts, which I’ll call the ’Font Server’ model.\n\nThe Foo Font Foundry has created a new typeface that they believe will be popular with web developers. They sign up with the Font Server company, perhaps paying some initial fee. They legally affirm their intellectual property rights re. the font. They upload the font to the Font Server, and create publicity material about the font on their own website, perhaps in a marketing section of the Font Server website, print media and however else they decide to advertise the availability of the font.\n\nThe Websites-R-Us development company has been hired by the Generic Client Company to create a website promoting their splendid, environmentally-friendly products. The designer at Websites-R-Us sees the new Foo Font Foundry typeface advertised or listed in the new releases on the Font Server site. She selects the font for use on the GCC website, and persuades the client to pay for font serving. Websites-R-Us or GCC provide the Font Server company with URLs to which they wish the font to be served, the Font Server company provides Websites-R-Us with a font data link for the specified font(s). The font data link might be personalised for Websites-R-Us or GCC, so that the link only works for the specified URLs. GCC is charged monthly for font data traffic associated with their specified URLs. The Font Server company collects the money from GCC and pays a percentage to the Foo Font Foundry.\n\nIt is easy to see how this model adapts also to things like custom corporate fonts, which could be served by the Font Server at discounted rates — in lieu of having anyone to whom to pay royalties —, served only to the company’s registered URLs and not made available to other customers.\n\nAs with other data storage and serving, competition is possible in e.g. speed and reliability of service as well as percentage rates paid to foundries.\n\nThe format of the served font data is not really important, but there are a variety of options. The served font data could be watermarked and linked to the registered URLs. It could be subset’d on-the-fly. Indeed, the format and level of data protection offered could be another area of competition between font server companies hoping to attract font foundries with the latest popular designs.\n\n[Thanks to Nadine Chahine for getting these thoughts started in my head.]\n\n"
    },
    {
      "time": " 21.Sep.2008 4.21pm",
      "content": "My apologies for jumping into this with what may prove to be a naïve or redundant (or both) proposal... I’ve been out of this game (not by choice) for at least three years now.\n\n“The Web” is generally screen-based. The W3C designing yet another font format without adding any DRM protections seems to be little more than Stallman-izing some fairly open, accessible, well-documented font formats. I find the idea of a W3C font format rather presumptuous.\n\nRemoving outlines and substituting only bitmaps is a very old and very serviceable idea for foundries looking to preserve thes security of their outlines. There are embedded bitmap facilities in the Opentype spec itself, as I recall. Font-building tools and font-rendering libraries (Windows, MacOS, Firefox Gecko engine, Safari/Webkit/Chrome Quicktime font renderer) should flesh out support for these existing parts of the OpenType spec, if it’s not fully working already, and users should be served the bitmap fonts instead of the outline fonts. OS font renderers should be completed to transparently display these bitmap fonts as if they were first-class outline fonts, and all the OpenType feature facilities and functions available to OpenType outline fonts could be used in these fonts as well.\n\n"
    },
    {
      "time": " 21.Sep.2008 4.29pm",
      "content": "I think this is a very cogent model for changing the landscape of font usage on the Web. In some ways, it’s like the quickly growing Software as a Service or Web application model. It would probably have to be simplified somewhat as a font being displayed to three people or three million people is still being used. As well, one, trustworthy company would need to ensure that the “server” (or more accurately, perhaps, the database) is available and scalable. The reality is that type designers need to get paid for their work and, without a clear and accountable service model that serves typefaces, typography on the Web will be exactly where we are now: limited and lacking, but not at all bad.\n\n"
    },
    {
      "time": " 21.Sep.2008 9.44pm",
      "content": "_As well, one, trustworthy company would need to ensure that the “server” (or more accurately, perhaps, the database) is available and scalable._\n\nWell, I was going to call it the ’Google Font Server’ model. :)\n\nBut I’m not sure that it does need to be ’one, trustworthy company’; indeed, one of the arguments against monopolies is that they tend towards untrustworthiness, since they do not need to actively build trust in order to retain customers. In this regard, too, I think the basic ISP model is a good one: customers, in this case the font foundries, shop around for people who provide good rates, reliable service, attractive contract terms, etc.\n\nPS. During the TypeCon panel discussion, someone in the audience asked who was going to police font use on the web, and Erik van Blokland said something along the lines of ’Well, Google of course, because they’re the people who are looking at it’.\n\n"
    },
    {
      "time": " 22.Sep.2008 12.22am",
      "content": "Hi from Franky, the airport not the font.\n\nJohn, your ideas are interesting - and this is exactly the kind of thing that can be developed as extensions on the working group, if and when it gets set up.\n\n\\> I’m also curious as to who wrote “What’s wrong with FONT FACE” on your web site:\n\nThat was one of mine...\n\n“this page was last updated 30 June 1997” ;-)\n\nBut do we really want to start digging up historical articles from the Web?\n\nYou do understand that FONT FACE (the proprietary font tag MS added to IE in 1995) is different from the @FONT FACE font linking solution? If not maybe Bill Hill can suggest some HTML and CSS books for you. ;-)\n\nCheers!!!\n\nSi\n\n"
    },
    {
      "time": " 22.Sep.2008 12.28am",
      "content": "\\>I can see our model, (models actually as the one you are quoting is but one), and Ray Larabie’s model quit clearly. .\n\nAlthough Ray is the poster child for this (his fonts are posted). Last time I checked Ray hadn’t made a decision about letting his fonts be used with the web fonts scheme. Clearly as it stands doing so (outside of his .zip) breaks his EULA. I believe he gave permission to Howcome to allow a few of his fonts to be used in the demos. Just as he allowed Ascender to make some of his fonts available as EOTs (A good strategy in my opinion).\n\nSo I think you and Ralf Hermann on your own right now. Maybe others will join.\n\nCheers!! Si\n\n"
    },
    {
      "time": " 22.Sep.2008 5.52am",
      "content": "Simon: “You do understand that FONT FACE...”  \nCute trap, what a gaffe. First Embedding that isn’t, now this. I thought you just forgot the @ and I never ever get the bottom of these pages. Or, maybe the band width required to make a font that’ll work as well as Franky, and the band width required to read through 200 pages of documentation for the accurate and relevant pages on this topic does not exist. Or maybe you should take out the trash more often.\n\nAnd let’s not forget, this opinion-gathering effort may be running along to help protect font founders from the world, or... to protect the world from font founders. So no matter how snide you might go off on Bill Hill, it hard to quit easily. :)\n\nJohn: 3rd party web servers are slippery enough already about responsibility for their content. And, you make it sound like average users are inclined to see fonts as IP. So, while I fully appreciate your excellent take on a “best case scenario”, I believe strongly that we have to take into account the opposite.\n\nFocusing on the packaging, (and I might add, authoring tools), is clearly part of a sensible approach, especially if the packaging is dynamic, and the original package is where the legal protection is. Also, many linking models adapt to custom corporate fonts, with their inherent legal/economic exposure, those customers are inclined to see fonts quite differently than users like yours.\n\nCheers!\n\n"
    },
    {
      "time": " 22.Sep.2008 7.04am",
      "content": "Has much thought gone into the perceived customers of said technology? Granted, this is a group of type designers, so it only makes sense that the conversation revolve around that side, but it seems that it all may be moot if more consideration isn’t put towards who this technology is supposedly going to be marketed to.\n\nIt sounds like the ultimate aim is to make sure that whatever technology is chosen, that is posses the necessary auditing and DRM protections that the industry desires. Ignoring the fact that that is probably a futile endeavor, it does make me wonder who, then, is going to be interesting in purchasing this.\n\nLike the commercial font industry now, I assume the larger market would be commercial advertising, marketing and web design firms accommodating larger brand names with established brand identities and guidelines. Alas, the more a product/service veers towards that kind of implementation, the more it seems they’ve already circumvented the issue by creating flash-laden sites, or image-bloated sites. Yea, they suck at times, but that hasn’t really stopped them from continuing down that path, so one has to assume that they work to some extent.\n\nAs a web designer/developer with background in graphic design, even I don’t have that much interest in any web font technology. We’ve gotten along fine without it in the past 10 years and I’m not so sure that there’s a strong of a want as we may think there is.\n\nGiven the complexities of just figuring out if one can embed fonts in a PDF or not is enough for a lot of folks to either a) not care about the EULA or b) not care about using any typeface not installed on the system.\n\n"
    },
    {
      "time": " 22.Sep.2008 7.38am",
      "content": "”...creating flash-laden sites, or image-bloated sites. Yea, they suck at times,..”\n\nYes they do. In fact this morning I was thinking about it, and searched google for “why flash sucks” to get a better handle on the broken browser UI issues, like the “back” button, or the scroll arrows being disabled. How much is Flash, how much is the designer, and how much is me? ;)\n\nThis site is not as bad as some, but it’s still more than a little annoying that the arrow keys sometimes work and sometimes don’t and the back button does work while you are writing, without asking if you want to lose it.\n\nMuch of it boils down to the w3c just not being constituted/funded in a way that allows progress at speeds required by the web, leaving us all at the mercy of whatever’s cool in the here and now of web development, or whatever is on the “big guy’s” agendas.\n\n”...I don’t have that much interest in any web font technology”  \nThis seems to be a dominant opinion of one of our major constituencies. What would change that for you?\n\nCheers!\n\n"
    },
    {
      "time": " 22.Sep.2008 8.26am",
      "content": "<cite>...I don’t have that much interest in any web font technology</cite>\n\nMaybe you don’t, but designers who bleed clients for $250,000 identities don’t like explaining to clients why they can’t use the corporate fonts on the corporate web site. I’ve got a client right now who was quite unhappy to see their web stuff designed using Helvetica and Georgia.\n\n"
    },
    {
      "time": " 22.Sep.2008 8.36am",
      "content": "“What would change that for you?”\n\nFor me, personally, ease of use by both the developer and the end user. No plugins. No silly EULA worries. Etc.\n\nReally, no different than how I shop for music. Can I download it in a standard format free of any proprietary strings attached? If so, great, here’s my money. If not, eh...I’ll pass.\n\nThe advantage of the web font issue, is that particular ’worry’ is really only at the level of the site designer, so that helps with the selling of the concept. As long as the end-users are able to use it (or not use it at their discretion) with no effort on their part, it’ll be adopted to some extent.\n\n"
    },
    {
      "time": " 22.Sep.2008 8.41am",
      "content": "“Maybe you don’t, but designers who bleed clients for $250,000 identities don’t like explaining to clients why they can’t use the corporate fonts on the corporate web site.”\n\nExactly! The market for this really seems to be rather niche. Big agencies doing big identity projects. Granted, that’s the market with the $$$, so certainly a good one to go after.\n\nThe catch is that they’ve already found all the workarounds to accommodate that already. They don’t use flash just because it can embed a font, so having an alternative font embedding technology likely won’t change that much at all.\n\n(Furthermore, I’d argue that a wise branding agency would have already taken into consideration the caveats of the various mediums said branding would appear in, but I digress...)\n\nAgain, not to discount the whole concept/effort/direction...just that I wonder if the market has truly been defined yet and, if it has, if it is really that big.\n\nPure speculation, but it seems that the folks that would really jump on this new technology in a heartbeat are the same folks that the industry seems to have no use for (and rightfully so, it could be argued): scrapbookers, myspace teens, font ’collectors’, that annoying secretary who has to use HTML email for all her correspondence with a picture of her dogs and a background image of some ugly wallpaper, etc.\n\n"
    },
    {
      "time": " 22.Sep.2008 10.11am",
      "content": "<cite>No silly EULA worries. Really, no different than how I shop for music. Can I download it in a standard format free of any proprietary strings attached?</cite>\n\nYou are mixing up two very different types of use:  \nWhen you download music against fee, you license it for your personal use and are not allowed to copy, hire, lend, perform publicly etc. Grab the next-best CD and read the EULA for yourself. Within this limited type of use, it’s as easy with fonts as it is with music.  \nOnce you intend to post these music files on a website such that visitors can listen to them or download them, well, you won’t get away without EULA/rights worries and paying someone. And exactly that’s what we’re talking about here — only difference is that our music is called fonts.\n\n"
    },
    {
      "time": " 22.Sep.2008 10.49am",
      "content": "kl...good points. To use your analogy note that there is still no DRM involved. If I want to license a Brittney Spears song, I do, and then I use it in a way that accommodates the agreement. The restrictions of the agreement are legal...not technological.\n\nI think that’d be a fine way to handle the font issue. Don’t bother with technical protection. It’s futile. Instead, make it a legal issue and leave it at that.\n\nAs for the EULA, I wasn’t against EULAs as much as I was against arbitrary and inconsistent restrictions that make sorting them all out a pain for the end user, thereby lessening the chances of them even bothering with it in the first place. Agreed, licensing something for personal use is typically a lot easier than licensing for publishing.\n\nI’m afraid I’m veering this thread off course, though. So, apologies for that...back to the font developers and the W3C to hash things out... ;o)\n\n"
    },
    {
      "time": " 22.Sep.2008 11.46am",
      "content": "In general, thanks for the comments.\n\n“Really, no different than how I shop for music. Can I download it in a standard format free of any proprietary strings attached?”  \nSo I guess you don’t use itunes.\n\n“As long as the end-users are able to use it (or not use it at their discretion)”  \nSee though, that there are some differences between music and fonts that are practically intractable. Each song is a combination of sound and silence, (image and background on web sites) and then, a combination of instruments and volumes (fonts, images and their specifications), all carefully blended...You’re saying, for example, that unless users can switch any and every vocal to Willie Nelson’s voice, (or whatever the system default, or their own choice), your ’as long as...’ is not met. Even further, you imply that users need to sub generic computer instruments for the ones used in the song. . . or else!\n\nCheers!\n\n"
    },
    {
      "time": " 22.Sep.2008 11.49am",
      "content": "An I almost forgot:\n\n”...designers who bleed clients for $250,000 identities don’t like explaining to clients why they can’t use the corporate fonts on the corporate web site.”\n\nCan you explain what the client’s tech spec would be to make that happen?\n\nCheers!\n\n"
    },
    {
      "time": " 22.Sep.2008 12.14pm",
      "content": "<cite>Can you explain what the client’s tech spec would be to make that happen?</cite>\n\nCopy set only HTML usually does the trick. Back to my current job—it has to be done in HTML to ensure that it works right in email clients loaded over dialup. No flash and only one small image allowed. Being able to tack on a subset font would make things work a lot better visually without resorting to Flash or big images. Remember, not everything on the web is done for people living in wealthy nations who have fast connections!\n\n"
    },
    {
      "time": " 22.Sep.2008 1.24pm",
      "content": "“So I guess you don’t use itunes.”\n\nSure, as long as it’s in the DRM free format iTunes+.\n\nAs to your other point, if I follow it, that’s how it is now. The web is user-controlled as much as it is designer-controlled. While we designers may want more and more control, our users may want the same. If/when font embedding becomes a more realistic option, if I, as an end user, can’t block Comic Sans wholesale, I likely won’t be too happy about it. ;o)\n\n"
    },
    {
      "time": " 22.Sep.2008 3.29pm",
      "content": "David: _3rd party web servers are slippery enough already about responsibility for their content. And, you make it sound like average users are inclined to see fonts as IP. So, while I fully appreciate your excellent take on a “best case scenario”, I believe strongly that we have to take into account the opposite._\n\nI don’t believe the current debate about whether the data package is an .eot or a .ttf takes into into account and case scenario. It’s an argument about whether you want to put the brown horse or the white horse before the cart.\n\nMy proposal is a model for professional web developers to be able to use specific typefaces and for the makers of those typefaces to be able to collect a fee for this use. It puts the responsibility for security and honesty in the hands of companies with contractual obligations to each other, rather than loading it onto crackable DRM technologies wrapped around vulnerable data which is then handed over to end users to do with as they will. Further, the Font Server company has as much of an interest in policing the use of the fonts as the font foundry: they collect money for legitimate use.\n\n"
    },
    {
      "time": " 22.Sep.2008 4.00pm",
      "content": "“Sure, as long as it’s in the DRM free format iTunes+.”  \nNo strings are attached there? Neither you nor James seem to be overly aware of the existing preconditions under which your comments, and descriptions of your lives and work are couched. I’ll try again.\n\nIf Cosmic Sans were the entire subject of a web site, as an end user, going freely to said web site and then blocking Cosmic Sans wholesale seems blindingly stupid, don’t it? And, if everything on the web must be designed for people living in poor nations with slow connections (hey, that’s me!), what good is that?\n\nUsers have been enjoying periodicals, books, music, film, TV and radio for generations with little control, other than the binary use/don’t-use choice and volume control where audio is involved. If a publisher wants to make a web site entirely and only in their own custom sights and sounds, only giving the user choice of text size and volume of sound, what gives the user, much less the ’standards-makers’, the right to block that option? Surely you have the right, as a user, not to go to that site, but to say all web sites must be enabled to cascade into a formless default standard plain vanilla appearance, is subverting the rights of those for whom form is a basic tool of their corporate trade. Is it not?\n\nCheers!\n\n"
    },
    {
      "time": " 26.Sep.2008 4.26pm",
      "content": "[Myspace is now selling music through Amazon’s DRM-free service](http://web.archive.org/web/20081201142847/http:/news.yahoo.com/s/ap/20080924/ap_on_hi_te/tec_myspace_music). If Rupert Murdoch doesn’t think he can foist more DRM onto consumers, the font industry isn’t going to pull it off, and is going to end up looking really, really bad for trying.\n\n"
    }
  ]
}
