{
  "id": "48985",
  "title": "Fonts with variable metrics",
  "forum": "Build",
  "tags": [

  ],
  "content": "Has anyone ever created or proposed a font format that allows metrics to vary with size? For example, a face might need more interletter spacing at small sizes and less at large sizes. So why not create a font that automatically increases or decreases interletter spacing by a set percentage as it changes from the default? Specific kerns could even be set to only activate above or below certain sizes.\n\nThoughts?\n\n [‹ Colour fill on fonts?](http://web.archive.org/web/20081201160842/http:/www.typophile.com/node/47881 \"Go to previous forum topic\") [footnotes to endnotes in Indesign CS3 ›](http://web.archive.org/web/20081201160842/http:/www.typophile.com/node/41052 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201160842/http://www.typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 1.Sep.2008 11.08pm",
      "content": "You could include this when using the OpenType feature “size”:  \n [http://www.microsoft.com/typography/otspec/features\\_pt.htm#size](http://web.archive.org/web/20081201160842/http:/www.microsoft.com/typography/otspec/features_pt.htm#size \"http://www.microsoft.com/typography/otspec/features\\_pt.htm#size\")\n\nBut I don’t think it would be a good idea. The spacing isn’t just based on the size alone. It may also be based on the reading distance, text color, background color/material and so on. So it is really something the user has to choose. I guess people might even be annoyed if the font would apply such changes automatically.\n\n"
    },
    {
      "time": " 2.Sep.2008 4.33pm",
      "content": "James, you must be pretty new to digital type!\n\nPrecisely what you describe has already been available, and been implemented, and been abandoned.\n\nBasically, from 1990 to 2000, Adobe had a lot of Multiple Master fonts with optical axes that did just that. This development was spearheaded by Sumner Stone. Each font with an optical axis had size variation from 6 to 72 points. Spacing changed according to type size. In the mid-90s, one of the PC versions of Microsoft Word automatically selected the right optical size to use when it detected a multiple master font. If I recall, much later, one of the early editions of InDesign could accomplish the same trick, though clumsily. Microsoft’s implementation was invisible — I think I must have been almost the only person outside Microsoft who knew this was happening, and I publicized it wherever I could, but it wasn’t considered of overwhelming interest by anyone.\n\nQuark was on the verge of doing some great things with MM when Adobe pulled the plug around 2000. Nobody really knows why Adobe pulled the plug. We used to blame it on Microsoft, but I now accept Microsoft’s verdict that it was Adobe, in particular Dan Mills, who made the decision. Dan Mills was later fired — whether for this typographical treachery or for something else, I have no idea.\n\nApple had a superior version of the technology called Variations but if I recall correctly, none of the released Variations fonts (of which Matthew Carter’s Skia was the most famous) had an optical axis.\n\nMM survives as a vital part of Acrobat and all its derivative products. (You will find two multiple master versions of Times and Helvetica — with invisible attributes — in every copy of Mac OS X - - they are supposed to work with Preview.)\n\nMM also survives as a vital part of the design process, thanks to the fabulous work done by Yuri Yarmola with Fontlab.\n\nMM optical axes had design change from 6 to 72 points. But there was never any reason why you couldn’t leave the design the same at each end, and simply use the axis to change spacing, just as you suggest.\n\nOh, the dreadful, painful history you have missed! How I truly envy you!\n\nBy the way, PageMaker had a great feature that would automatically apply tracking according to size - - this is not an ideal situation at all, but it often worked better than nothing - - much, much better — and it isn’t at all analogous to what was happening with MM.\n\nBy the way, MM still works perfectly well with all versions of Windows including Vista - - simply install ATM Deluxe for NT and disable UAC. Try it - - you’ll like it!\n\nOne problem with MM is the crazy nomenclature and lack of interactive control in programs. Only one program ever supplied up-front interactive slider bars without the confusing gobbledygook - - LightningDraw GX on the Mac. Had that feature been implemented in all layout and WP programs, everyone in the world would happily be using MM fonts today.\n\nIt’s an unfair world out there!\n\nBe that as it may, many, including some at Adobe, predict that MM in some form will be with us again - - sometime within the next 5, 10 or 20 years, depending on whom you’re talking to.\n\n"
    },
    {
      "time": " 2.Sep.2008 4.58pm",
      "content": "PS. MM also did light to bold, compressed to wide, serif to flare to sans serif, etc. etc. - - and Lucas de Groot had a special MM font that did something vaguely pornographic - - I’m not making this up! I’ve never seen that font. Lucas offered me his entire library as a present when I got him a special beta copy of FontStudio that would work with PPC Macs - - and foolishly, I declined. I also gave that version of FontStudio to Carol Twombly, who really wanted it. She didn’t offer me anything in return.\n\n"
    },
    {
      "time": " 2.Sep.2008 5.01pm",
      "content": "PPS. Ralf is absolutely right - - the totality spacing can’t be based on size alone. But spacing carefully optimized to size is a very good starting point. And you do need a starting point. If you didn’t have one, you wouldn’t be able to space a font at all.\n\n"
    },
    {
      "time": " 2.Sep.2008 6.06pm",
      "content": "I don’t think it was uncommon for a hinted TrueType font to use hinted widths at small sizes. I believe Microsoft Sans Serif is wider at 8pt (96dpi) than it is at 9pt due to 8pt have hinted widths.\n\n"
    },
    {
      "time": " 2.Sep.2008 6.48pm",
      "content": "Quark’s tracking table Xtension has been doing this since 1989 (version 2.1).  \nTypically, if using a face throughout a publication, one would set the table to decrease tracking the larger the type size became.  \nI don’t recall ever adding tracking for small sizes.\n\nAs Ralf notes, probably best to have it in the application, rather than the font.  \nAlso, the user can kern display and text versions of a type differently with the XPress Kern Table Editor.\n\n"
    },
    {
      "time": " 2.Sep.2008 10.21pm",
      "content": "[http://typophile.com/node/28517](http://web.archive.org/web/20081201160842/http:/typophile.com/node/28517 \"http://typophile.com/node/28517\")\n\n"
    },
    {
      "time": " 10.Sep.2008 5.10am",
      "content": "”...a font format that allows metrics to vary with size”  \nHot metal did this. The Merganthaler VIP typesetter did this. MM could do this. TrueType GX Variations too. All the current font formats allow any single outline to do it, so a collection of outlines can too.\n\nPageMaker and QuarkExpress allowed the user to define a table of a track-per-size, per outline. These work on a single outline with a value for each size. As long as the single outline master is still applicable to the range of size/track pairs used, somewhat fine!\n\n”...a hinted TrueType font to use hinted widths at small sizes...”  \nAs this depends on the presence of a course grid, at which point the technique is most often being used for readability survival rather than as a refinement to spacing, it is really not a point to make.\n\n”...the OpenType feature “size”...”  \nis static, i.e. one label per font, it’s not related to anything of the dynamic issue being discussed.\n\nIt would be great to have a truely dynamic version like GX Variations offered, but waaaaaay too many “type people” (lol) appear scared of this. It would bring out the cream of the crop in type design and use, and leave the janitorial type type people, (who must keep things understandable for themselves, or else!), in the dark at the back of the pack. Thus, since the janitorial type type people seem favored and rising for their lack of interest in granting type type intelligence, their lack of vision, and even of hearing, it’s unlikely to happen in any of the “big” typesetting systems, much less in a standard. . . ever, or until the next generation of typographic janitors arrives. ;)\n\nCheers!\n\n"
    },
    {
      "time": " 10.Sep.2008 6.04am",
      "content": "David,\n\nIs it possible to ammend or extend the OpenType specification (and MS Volt) to support a different character width per point size, or at least to substitute a different character width when a typeface’s point size is greater than a certain number?\n\nOr must we we wait for yet another typeface specification, like OpenType II, to have this?\n\n===\n\nI know that in Latin languages, this is useful for the M and N in the very least, and in Hebrew for the Shin in the very least; I’m certain that in other character sets this is needed as well.\n\nAt Lintotype of Hauppauge’s Type Department, I was shown print samples of metal type typeface designs that had different character widths and slightly different designs at different point sizes. When I created a set of Linotype-like Hebrew type designs for the standard FrankReuhl typeface design, I inspected print samples of that typeface design at different point sizes. I found that each letter form had interesting design differences, created to be used at different point sizes.\n\nHence, it is clear then this is an essential feature of a typeface design, and something that should not be lost for convenience sake. Variable character widths and designs that are point specific should be incorporated into this or the next typeface standard like OpenType.\n\n"
    },
    {
      "time": " 10.Sep.2008 6.42am",
      "content": "<cite>R.H.”...the OpenType feature “size”...”<br>\nD.B.: is static, i.e. one label per font, ...</cite>\n\nAnd so it could be used to automatically switch between fonts with different designs and/or metrics depending on the used size.\n\n<cite>D.B.: ... it’s not related to anything of the dynamic issue being discussed.</cite>\n\nAnd I must ask you a second time: Why do you think you can define the scope of a discussion you haven’t started? My answer might be useful to James or any other reader. Let them decide and please stop always trying to prove my or other other peoples statements wrong. It’s not helpful.\n\n"
    },
    {
      "time": " 10.Sep.2008 6.44am",
      "content": "There are three issues here:\n\n1. The increase or decrease of spacing between the letters, known as tracking;\n\n2. The widths of a character’s design;\n\n3. The actual design of the letter.\n\nThe first factor, a typeface’s tracking, affects all the letters of a typeface across the board equally.\n\nThe second factor only affects the widths of those letters which the designer intends to be different at different point sizes.\n\nThe third factor only affects the design shapes of those letters which the designer intends to be different at different point sizes.\n\nFor example, if I was typesetting the phrase “time in a bottle”, and I created a typeface with these variable widths, then at very small type sizes, the shape of the “m” (and perhaps “n”) would have the horizontal strokes spaced further apart to increase its legibility and prevents ink spread on certain paper kinds, and the kerning between the two “t”s and the “l” of “bottle” (in kerning, there is no end, so I will not cite the other combinations where this would be helpful) needs also to be increased.\n\nAt large type sizes, I might seek the opposite to occur: the strokes of the “m” should be closer together to minimize the unnecessary while space. Similarly, the extra space between the letters “t” and “t”, and “t” and “l”, would be decreased. Perhaps, I would make a three letter ligature with equal distances between the horizontal strokes of the t, t, and l, and join the first two letters, but not the “t” and “l”.\n\n"
    },
    {
      "time": " 10.Sep.2008 6.58am",
      "content": "Ralf Herrmann,\n\n\\> You could include this when using the OpenType feature “size”:  \n [http://www.microsoft.com/typography/otspec/features\\_pt.htm#size](http://web.archive.org/web/20081201160842/http:/www.microsoft.com/typography/otspec/features_pt.htm#size \"http://www.microsoft.com/typography/otspec/features\\_pt.htm#size\")\n\nDoes this mean that the character’s width(s) are changed in a different point size range (like from 13.9 until 24 as in the Microsoft example), or only the design shapes?\n\nHas Microsoft implemented this feature in its MS Volt software?\n\n"
    },
    {
      "time": " 10.Sep.2008 8.01am",
      "content": "\\>it is really not a point to make.\n\nPlease accept my humble apologies for mentioning it.\n\n"
    },
    {
      "time": " 10.Sep.2008 8.09am",
      "content": "_Does this mean that the character’s width(s) are changed in a different point size range (like from 13.9 until 24 as in the Microsoft example), or only the design shapes?_\n\nThe “size” feature basically tells an application which font file to use for any specified point size range, so the changes are not limited to any characteristic.\n\nThe only application that can take advantage of this feature that I know of is XeTeX.\n\n"
    },
    {
      "time": " 10.Sep.2008 12.38pm",
      "content": "I asked my OpenType/Volt expert who confirmed that “size” is not a [direct] way to handle variable widths in a font.\n\nPerhaps, Simon Daniels of Microsoft can confirm that OpenType is flexible font format that allows new features to be added to it, such as variable character widths.\n\nIt would seem logical that if “size” can determine a point size range for tracking, then seemingly it can then input information to another unyet created or named operative that could change a character’s width based upon its point size.\n\nMaybe, in the next main release of OpenType by Adobe/Microsoft the feature of variable character widths will be implemented.\n\nCertainly, implementation of this feature is vital to OpenType, because digital type would then include an important feature of metal type.\n\nWhat do you think, Thomas Pinney? At RIT, wasn’t that an area of your study?\n\n"
    },
    {
      "time": " 10.Sep.2008 5.19pm",
      "content": "\\> Nobody really knows why Adobe pulled the plug [on MM fonts]\n\nI talked about it at great length in a presentation at ATypI. I’ve written about it in public as well. You may choose to not believe the explanations I’ve given, but to simply say “nobody really knows” is a bit odd. Certainly those of us who were here at Adobe when the decision was made to not support MM in OpenType are pretty familiar with the issue.\n\nI was not thrilled at the time with the decision not to support MM functionality in OpenType, but I understood the many pragmatic factors that went into it. These days a decision like that today would be made by me and David Lemon, but if somehow we could wind back the clock, I couldn’t tell you which way we’d go on that one.\n\n\\> Dan Mills was later fired\n\nNot at all true. He retired to spend more time with his family.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 10.Sep.2008 6.28pm",
      "content": "Thomas,\n\n\\> I was not thrilled at the time with the decision not to support MM functionality in OpenType, but I understood the many pragmatic factors that went into it.\n\nCan you elaborate upon the “many pragmatic factors”?\n\nPerhaps, if convincing counter-arguments can be suggested, the clock can in deed be turned back, and David Lemon and you might conclude differently.\n\nWith a religious note, we are in the final Hebrew month, called “Elul”, the traditional time of ’teshuva’ (lit. return, or popularly known in English as ’repentance’), when we turn back the clocks and resolve that next year will be different. “Teshuva” is so powerful that it not only affects ones future, it can even change the past.\n\nCheers!\n\n"
    },
    {
      "time": " 13.Sep.2008 4.47am",
      "content": "BTroop: Dan Mills was later fired  \nTPhinney: Not at all true. He retired to spend more time with his family.  \nMe: That’s what I heard from him too. I’m curious though, as to whether he finished it and if Adobe is planning to publish it any time soon? ;)\n\nRHerrmann: And I must ask you a second time: Why do you think you can define the scope of a discussion you haven’t started?  \nMe: Defining the scope of discussion here, in general, is quite impossible, and topic “ownership” is fleeting. Stop asking and perhaps you will stop being disappointed.  \nRHerrmann: You could (use the “size” feature)... But I don’t think it would be a good idea.  \nMe: What makes you think you can give an answer, then say it’s not a good idea, and then complain when I fully agree?\n\nISeldowitz: ...must we [] wait for yet another typeface specification, like OpenType II, to have this?  \nMe: Good question! I can only hope. Like most standard standard developments, the current one is the translation of 10-20 years of technology into “education.” Unlike most standard standard topics, the education in this topic is well ahead of the technology.\n\nCheers!\n\n"
    },
    {
      "time": " 13.Sep.2008 6.10am",
      "content": "One of the misapprehensions here is that tracking can ever be a substitute for variable metrics. It can’t. As you go up and down the size scale, different letters will be spaced proportionately differently. At 6 points you might need proportionately more spacing around l shapes and less around o shapes — or vice versa. It depends on numerous factors. Tracking is only the crudest possible solution.\n\nI love it that there is someone here who genuinely believes that fired people really just left to spend more time with ... their families. Who am I to be cynical?\n\nMeantime, MM still works.\n\nIt’s painful to hear David break taboo about the janitorial class in type. I would like to say that I don’t have anything against janitors, and never have had. Love ’em.\n\n"
    },
    {
      "time": " 13.Sep.2008 11.49am",
      "content": "So here’s the thing...\n\nYou have text at a specific size and you want it to be as non-poo-like as possible. The ’possible’ part may be constrained by non-typographic considerations — resources and time, technological limitations — compromising typographic quality. If there are no constraints, then the obvious way to make non-poo size-x text is to have a dedicated size-x font with appropriately designed outlines, spacing, kerning etc. Let’s be clear that this is the proper solution and _anything_ else is a compromise. Interpolation is a compromise. Tracking is a compromise. Variant metrics is a compromise. The compromises are on a continuum between poo and non-poo. As Bill points out, variant metrics would be better than tracking: it would be further from poo, closer to non-poo.\n\nBut the compromises are subject to the same non-typographic considerations and constraints as the ideal: resources and time and technological limitations. The closer the compromises get to non-poo — i.e. the fewer typographic compromises they entail — the more resources and time they are likely to require, and eventually they become essentially indistinguishable, in terms of cost, from the ideal, non-poo solution. At that point, such compromises simply are not worth spending time on: better to spend one’s time making those size-x specific fonts. On the other end of the scale, there are compromises that are so close to poo that they, too, are not worth spending time on. We don’t want to be in the business of making almost-poo.\n\nThe question then, is whether there are in fact compromises somewhere in the middle of the continuum that are sufficiently non-poo-like to be worth doing and sufficiently cheap, in terms of resources and time to be viable. And I’m not convinced that the answer is yes, although if I had to pick a technology that came close it would be TT variations.\n\nBasically, I’ve come to the conclusion that the compromises are all a waste of resources and time because, ultimately, the results are not satisfying, and in order to become more satisfying they need to become more complex, and will eventually become technically more complex than making size-x specific fonts would be. We’ll know we’ve reached this point when designers are making size-x specific fonts and then processing them to fit them into the compromise technology. We may already have reached this point.\n\nThe answer is not new font formats or extensions of font formats. The answer is font development tools that make it viable for designers to produce size-x specific fonts, i.e. that reduce the cost in resources and time of doing it properly. Letterror’s Superpolator and Tim Ahren’s RMX tools strike me as the most significant advances.\n\n"
    },
    {
      "time": " 13.Sep.2008 1.55pm",
      "content": "I’m desperately trying to find something to disagree with here but not succeeding.\n\n"
    },
    {
      "time": " 14.Sep.2008 6.11am",
      "content": "Bill T \\>I’m desperately trying to find something to disagree with here but not succeeding.\n\nWell, linear interpolation is a fatal compromise, and John believes so firmly that the answer is not new font formats or extensions of font formats, (only tools!), that it’s impossible to agree with :) As long as the allied janitorial staff is making such decisions about what’s “Too hard” and what’s “Too expensive” and what’s “Too complex”, for all users, for all time... instead of just making sure such an extension doesn’t get in the way of the foundries/users determined to stay at poo corner... it’ll stay that way. “Lead, follow, or get out of the way”, is not allowed to cross their minds.\n\nCheers!\n\n"
    },
    {
      "time": " 14.Sep.2008 7.22am",
      "content": "<cite>If there are no constraints, then the obvious way to make non-poo size-x text is to have a dedicated size-x font with appropriately designed outlines, spacing, kerning etc. Let’s be clear that this is the proper solution and anything else is a compromise. </cite>\n\nFine as long as you are talking about a theoretical technique, rather than say, results. Quick, Which size of metal Perpetua worked best? And how well did other sizes work?\n\nI’m aware that some plain old scaling was used even in the days of machine set metal fonts, but ignoring that, there were always some sizes that worked better than others.\n\nThe different masters has been done In digital type. Ignoring Adobe’s 4 sizes (which to me seem to be multiple masters interpolations) Stone has re-released “Cycles” in a variety of sizes. “Paperback” did this too, though as I remember, after some use they had to go back & re-lable some masters as a different size. Nothing wrong with that, it’s called “testing.”\n\nBut to somewhat cloud David’s janitor model, the problem I see with the use of type arises from the artiste. The artiste’s mind set, when beginning a new project, is to think “What do I want to do?” I’ve always felt the right question is “what does it need?” I’ll allow the question & linkage of this thought to type design is tenuous. Fair enough for the type designer to take the mantle of artist. And fair enough if we don’t like the offerings, or don’t find them useful.\n\n"
    },
    {
      "time": " 14.Sep.2008 9.55am",
      "content": "Metal type forced the use of individualized pointsize designs. Some of this was the needs of the production process and some was an intended attempt to fit pointsize with weight, spacing, and proportion. Digital type took the economics angle to task. We were not wedded to optical size differences and the added expense that comes with them so the money won out and we were one-size-fits-all. It was assumed tracking could solve everything—but they were wrong. The problem is that only sophisticated users give a damn and since bean counters have fonts too, they don’t get the need for optical sizes. The sophisticated users who do quality publishing or even newspapers who need to fit more text in less space, really do care and see the need. The problem is the market for this sector is much smaller than the market for the “I could care less, one size is good enough” is quite large. So what is a foundry to do? The economics would tell us that finding the “good enough for prime time” compromise point would cover even most of the sophisticated users. This would have to be something that is far more easily achievable than drawing 4 optical sizes from scratch yet way better than just tracking. As we all know, tracking dumps the same amount everywhere which is not too helpful. Adobe’s auto kern feature is an attempt to solve the problem but it does not work too well for text and causes copyfitting confusion. Just as in the 80s when we struggled to find “Good Enough Color” to allow digital halftones to take over the printing industry, we must go through the development and growing pains to find “Good Enough Optical Sizes” to progress in the typesetting industry. Let’s not give up on trying to find a technological fix just yet just because we have not perfected anything “Good Enough” yet. I say bravo to anyone trying to solve this and I won’t say nay to their efforts—keep trying!\n\nChrisL\n\n"
    },
    {
      "time": " 14.Sep.2008 10.48am",
      "content": "William Caslon the First spent most of his life on what we would now call one font, and really cut a full range of sizes. The problem is A. He fairly often messed up some characters in some sizes, and some sizes were altogether better than others; B. it took over half his life. As we know, beginning with metal type done with the pantographic punch cutter, this was reduced to three sizes, sometimes, with adjustments. Then during the brief photo type period did it go to one master, no adjustments?\n\nNow in digital we are contemplating doing the full range of sizes, again. Because of whole ’art is long, life is short’ thing, I think help from technology is needed to solve the sizing problem on any regular basis. The means probably both understanding the problem of sizing better, and better tools. The tools can either be for font designers, or in the applications, or a combination of both. I’m not clear about what needs to go for the designer and in the app, but more and better programs are going to really help.\n\n"
    },
    {
      "time": " 14.Sep.2008 11.43am",
      "content": "_Tracking is a compromise._\n\nFrom the typographer’s perspective, being able to adjust size, leading, scaling, tracking, kerning (and even “grade”) are all useful tools to create a custom setting that works for specific content, layout, and media.\n\nWhen I used ITC Bodoni in a brochure, I found that the recommended sizes didn’t work. I ended up using “72” at 14 pts, horizontally scaling it wider, and adding tracking.\n\nThere is a tremendous amount of leeway in the usability of fonts, and the various authors of a setting (software engineers, type designers, typographers), not to mention publishers, clients, and readers in general, all have different ideas of what does and doesn’t look like shit.\n\n"
    },
    {
      "time": " 14.Sep.2008 11.52am",
      "content": "Every change, since we moved away from scribes copying manuscripts by hand, has been for economic reasons. Every change (including type itself) has been met by cries of lost quality.\n\nMy problem with this thread is that it isn’t just the metrics that need redoing with a significant size change, it is the characters themselves. Both would be nice.\n\nA while back we were hired to design & set a two volume edition on John Payne Collier. As I remember, most of the second volume was notes & bibliography. I chose Minion for the text, & used a custom “instance” of Minion MM — 11 point optical size & a little different weight, with some work on the characters & metrics. But for some reason, I couldn’t get a 9-point version to work. The then-new Adobe OpenType versions of Minion was just out, and the (whatever smallest) “Optical” was just right — at least, in character weight. I’ve never liked Adobe metrics, which is probably just a matter of taste. There wasn’t time for me to redo the kerning, so we just used it more or less out-of-the box for the extensive notes & bibliography. To me, that match of the character weight was the most important consideration. YMMV.\n\n"
    },
    {
      "time": " 14.Sep.2008 12.46pm",
      "content": "Charles, I’m interested, what haven’t you liked about the metrics? —I mean aside from the over-kerning of punctuation, which I think is a wrong decision.\n\n"
    },
    {
      "time": " 14.Sep.2008 1.45pm",
      "content": "\\>William Caslon the First spent most of his life on what we would now call one font, and really cut a full range of sizes.\n\nBut probably not the Great Primer, right?\n\n\\>As we know, beginning with metal type done with the pantographic punch cutter, this was reduced to three sizes, sometimes, with adjustments.\n\nNot as far as I know. The general rule is, new drawings for every size with Mono, every other size with Lino. It’s below 12 points that the substantial changes need to be made.\n\n\\>Then during the brief photo type period did it go to one master, no adjustments?\n\nNo, William. How can you possibly think that? There were plenty of fonts with three or four size masters in phototype. Nobody bought them. That’s why companies like Monotype, Agfa, and Linotype were never interested in repeating the tragic experiment (not that they did it right to begin with — Monotype’s awful 4 photo masters of Bembo are a typical example) and why optical size in digital type is primarily due to the interest of David Berlow on the one hand, and on the other Sumner Stone, who presciently guided Adobe into it but tragically didn’t stay around long enough to fix things when his executants messed up. So a display optical axis (Kepler/Light/72) typically had a contrast ratio of only 1:3 (stems 45, thinnest thins 15), because (charitable explanation) Adobe wanted to be sure the font would be printable without dropout at 6 points if it were accidentally misused under those circumstances or (uncharitable explanation) the type group (Robert, Carol, Fred) didn’t then know how to design display type.\n\nWell, they do now, but that may just have something to do with the 18th months I spent from late 1996 to early 1998 getting the message through to them. It culminated in a kind of lecture letter I just found which explained what Stone was doing with Arepo and Carter was doing with Big Caslon — which was very different from Adobe’s approach at that time. They have since seen the light. What is important to keep in mind is that as bad as the optical axes were in the MM types, they have been improved in the OT ’opticals’. That is progress! However it came about.\n\nYou don’t become an expert in optical type technology for the wishing. It’s easy to make misjudgments. Hence the observation that some metal sizes are sometimes substantially better than others — 7-1/2 pt Bembo versus 8 pt Bembo to take a hypothetical example — I forget the specifics on that one. Dan Carr is the kind of person who knows these things.\n\n"
    },
    {
      "time": " 14.Sep.2008 1.50pm",
      "content": "\\>not to mention publishers, clients, and readers in general, all have different ideas of what does and doesn’t look like shit\n\nGreat reminder, Nick! That’s the reality! We pontificate about the ideal this, that and the other - - but the fellow who pays the bills has the last word . . . .\n\n"
    },
    {
      "time": " 14.Sep.2008 2.00pm",
      "content": "\\>Charles, I’m interested, what haven’t you liked about the metrics? —I mean aside from the over-kerning of punctuation, which I think is a wrong decision.\n\nWilliam, one of the things you have to keep in mind about an MM optical master is that the spacing is very difficult to do ideally and always represents a compromise. Because of the demands of spacing, the 50% point in a 6-72 pt MM often has to be at about 14-18 pt. This is far from ideal.\n\nYou can see from this that in a conventional old-technology 6-72 pt MM, there would never be enough leeway to space 6-12 pt the way you could if you were simply designing each size as a separate.\n\nHence John’s point, doing separate sizes is best; and David’s point, that we need a more sophisticated format. It was in the mid-80s that Stephen Harper illustrated the possibility of using PostScript to interpolate from large size Garamond to small size Garamond and getting something usable in the middle — which is basically all you can do with a PS MM optical axis. But in all the years since, we’ve learned that we need a lot more flexibility than this model permits.\n\n"
    },
    {
      "time": " 14.Sep.2008 2.03pm",
      "content": "Bill (Berkson),\n\nWell, metrics is metrics. It probably is just the kerning. Once I decide to redo a text font for us to use setting books, I just start over with the kerning. If a sidebearing change reduces the number of kerns, I change them. When we decide to \\*support\\* a font for text, it gets certain attention, and often I don’t remember just what gets done to what. For the record, I think Adobe fonts are pretty damn good; I didn’t mean to imply any inferiority.\n\nBill (Mr. Troop),\n\nWell, in the early photocomp days, one foundry’s fonts wouldn’t work on another foundry’s machine — in fact, usually wouldn’t work on another machine from the same foundry. So I can’t say for sure that some of Monotype’s \\*other sizes\\* weren’t bought because they weren’t any good, but that was certainly the case with a number of Linotype (202) fonts. I do remember Monotype’s absolutely dreadful \\*Agency Fit\\* — though that was in the early PostScript era, wasn’t it? Couldn’t trust a company who though that pleasing . . .\n\nI suspect the look that appeals to ad typographers will always differ from the look that appeals to book typographers, even though both of us will occasionally use 24-point type.\n\n& while I didn’t hang out in the Monotype (UK) drawing room, as I remember, Bill Berkson is right, some of the sizes were basically just scaled. We could ask Cameron Poulter, he’s old enough to know for sure.\n\n"
    },
    {
      "time": " 14.Sep.2008 3.36pm",
      "content": "_...optical size in digital type is primarily due to the interest of David Berlow on the one hand, and on the other Sumner Stone..._\n\nFor me it was Hoefler’s Didot, in Harper’s Bazaar from 1991, which really addressed the issue of optical scaling in digital fonts, paradoxically by the way that different optical sizes were mixed in the same word, with equal hairline thicknesses.\n\n"
    },
    {
      "time": " 14.Sep.2008 4.52pm",
      "content": "Well, Nick, I’d say that to the extent Jonathan knew anything about optical scaling when he designed (or caused to be designed — he had assistants doing lots of his drawing, as I witnessed for myself) the Didot, I’d say he must have got it from his apprenticeship with David Berlow which is not a thing Jonathan likes to mention, ever. But the one-horse trick you’re describing doesn’t address the utter failure of HTF Didot as a viable text face. Jonathan still had a lot to learn in those days, but give him credit, he did grow. In the Didot, I see a purely technical approach to optical scaling. It is very simple to understand as such. What is lacking is any awareness of aesthetics, readability ... typography. We are all a lot more demanding of type nowadays. Those were very raw days for young designers. If you look at the progress Slimbach made from the original AtypI showing of Jenson (1994? with dreadfully long ascenders/descenders in the smallest sizes) to what he achieved two or three years later when it was released, you see that he had learnt a great deal in the interim. But the display sizes had nothing remotely comparable to the contrast and magesterial incision of Monotype’s large sizes of Centaur. And small size parts of the axis had nothing comparable to the clarity and readability of the equivalent Centaur metal sizes. That’s because ... see above. We were all very naive in those days! When Jonathan saw my first font (a Garamond display) he said, ’Do you realize you’re already one of the top ten designers in the world?’ It was total drivel but we were all reinventing the wheel at that time. Then, after I released a font called Adagio Didot, he never talked to me again, because he believed it to be in violation of his ’impeccably trademarked’ family with which mine had no stylistic relation whatever.\n\nYou have so many, many concerns in optical scaling. You have all your optimizations to consider, then you have to consider colour from size to size, and colour within the entire range from large to small. Matthew Carter once told me he thought Linotype only ever got the colour scale right once, towards the end of metal. How do you adjust stem widths over the entire optical range while keeping ascender-descender length optimal, serif size optimal, spacing optimal, etc. etc. ? A very few exceptional individuals seem to be able to do this kind of thing on their own, but surely the rest of us need a group of brilliant collaborators? Yet the solo conditions most of us exist in breeds a distaste for collaboration . . . . and where is the economic incentive to collaborate?\n\n"
    },
    {
      "time": " 14.Sep.2008 8.37pm",
      "content": " ![](http://web.archive.org/web/20081201160842im_/http:/www.typophile.com/files/Bazaar_6397.jpg)\n  \nAccording to H&F-J’s web text, the collaborators were Liz Tilberis and Fabien Baron, and no doubt he was paid for the commission.\n\n_...one-horse trick you’re describing doesn’t address..._\n\nSure, we do things differently now, but at the time it wasn’t that simple.  \nThere is a traditon of art directors, especially in fashion magazines, pushing the finesse of modern-style hairlines and serifs to the limit—Alexander Liberman at Vogue in the 1950s, for instance. Robert Priest, at Esquire in the 1980s, had also created exemplary layouts which showcased meticulous detail. But compared with metal or phototype, digital technology took it to another level.  \nThis Bazaar typography certainly addressed that tradition, and also represented the emergent layout technique of varying type size word by word. The negative leading and wilful “bad” colour wasn’t the slick “tight but not touching” used by Priest, so was very much of its time. To touch all those bases, and mix in optical scaling, that was a pretty good trick, I’d say.\n\n"
    },
    {
      "time": " 14.Sep.2008 11.01pm",
      "content": "\\> Ignoring Adobe’s 4 sizes (which to me seem to  \n\\> be multiple masters interpolations)\n\nAlmost all of them are. But Garamond Premier uses four separate cuts. Arno uses interpolations, and has 5 sizes instead of 4. I suspect most future Adobe typefaces with optical size variants will have 5 sizes. I would certainly go for five as a functional minimum.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 14.Sep.2008 11.38pm",
      "content": "Regarding more fonts vs. compromises: I feel like compromises might be a great option for people who aren’t going to make the jump to fonts with optical sizes. Think about all the designers out there who don’t even know how to use the Opentype menu in Indesign/Quark/etc.. I don’t think they’re doing a lot with complex fonts with optical sizes. Word processing software users probably don’t want to be bothered with more than one font with regular, italic, bold, and bold italic. But what really brought the whole thing up for me was noticing that some screen fonts would benefit tremendously from spacing that opened up at sizes that start turning words set in a heavy face into a chunky streak of mush.\n\n"
    },
    {
      "time": " 15.Sep.2008 12.23am",
      "content": "<cite>According to H&amp;F-J’s web text, the collaborators were Liz Tilberis and Fabien Baron, and no doubt he was paid for the commission.</cite>\n\nFabien Baron was the commissioning designer/art director of Harper’s.  \n [http://en.wikipedia.org/wiki/Fabien\\_Baron](http://web.archive.org/web/20081201160842/http:/en.wikipedia.org/wiki/Fabien_Baron \"http://en.wikipedia.org/wiki/Fabien\\_Baron\")\n\nLiz Tilberis was the editor in chief of Harper’s at the time. She passed away in 1999.  \n [http://en.wikipedia.org/wiki/Liz\\_Tilberis](http://web.archive.org/web/20081201160842/http:/en.wikipedia.org/wiki/Liz_Tilberis \"http://en.wikipedia.org/wiki/Liz\\_Tilberis\")\n\nIt appears that the unknown collaborators of Jonathan shall remain so (or maybe he will step in here and enlighten us).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 15.Sep.2008 2.40am",
      "content": "\\>But probably not the Great Primer, right?\n\nJames Mosley ascribes the Great Primer to Caslon, though he notes that it was strongly influenced by a Dutch type which it replaced at the printing house of Caslon’s patron, William Bowyer. (Journal of the Printing Historical Society, 1981/82, p. 23-4.)\n\n"
    },
    {
      "time": " 15.Sep.2008 9.21am",
      "content": "_...some screen fonts would benefit tremendously..._\n\nSurely the adjustment for simple users is the font size button?  \nIf the type isn’t clear, make it bigger!  \nAnother tool that could be useful for them would be something along the lines of the Photoshop anti-aliasing button, which operates on a kind of fuzzy-logic principle. In other words, one tries out all the options and sees which works best.\n\n_...unknown collaborators..._\n\nProps to Font Bureau for publishing designer attributes, e.g. Weissman and Lipton for Benton Modern, but really, what a foundry chooses to reveal about how its products are manufactured is nobody else’s business, and if designers want recognition, they should start their own foundry/studio.\n\n"
    },
    {
      "time": " 15.Sep.2008 9.39am",
      "content": "<cite>Surely the adjustment for simple users is the font size button?</cite>\n\nBut if the problem is just loosening up headline fonts as they get smaller the user might not want to keep cranking up the size of everything on the page, which can break layouts in browsers that increase the text size without any other scaling.\n\n"
    },
    {
      "time": " 15.Sep.2008 10.03am",
      "content": "David: _John believes so firmly that the answer is not new font formats or extensions of font formats, (only tools!), that it’s impossible to agree with_\n\nThat’s a bit of a distortion of what I wrote. There are plenty of things for which I think a new font format is desirable — heck, just getting beyond some of the table size limits in OT would be great —, and for optical sizes we need a robust format extension to enable apps and users to access appropriate sizes (preferably automatically but with the option of manual override). What I am not convinced by is app-side interpolation/variation technologies for optical size: linear interpolation because it is too close to poo to be worthwhile in terms of quality, non-linear interpolation because it is too close to non-poo to provide significant cost benefit, i.e. why not just make size-specific fonts? These technologies make a lot of sense on the developer-side, where they can speed up design and production processes while at the same time allowing post-interpolation manipulation and optimisation.\n\n"
    },
    {
      "time": " 16.Sep.2008 9.37am",
      "content": "All right, I _am_ going to disagree. First of all with the nomenclature introduced by John to denominate the good and the bad in type. There is something profoundly wrong with this, but we haven’t time to analyze what just now except to say that you only invoke poo when you don’t want to think about what you’re really talking about. Let’s just drop it.\n\nWe have spent a little time discussing why linear interpolation of an optical (or other) axis may leave much to be desired. But the key thing to keep in mind is that just because Adobe didn’t do it right throughout the 1990s, doesn’t mean it can’t be done right. It’s been demonstrated since the mid-1980s how to do it right. It can be done. And there is plenty of evidence that Adobe, now, would do a much better job even within the constraints of first generation MM.\n\nSecond I must take issue with John’s now very old opinion that MM is great for developers, bad for users.\n\nI think John is the only person in the world who holds this opinion. In its day, when it was first trotted out on the OT list about ten years ago, it was a brilliant rationalization for Adobe.\n\nAdobe was in shock because it had just lost the crown jewel of its type technology — MM — because Dan Mills had decided MM would have to be removed from the OT spec.\n\nAmong the many consequences, a notably bad one was that Adobe now had to explain that OT was a replacement for MM, and market it as such. This wasn’t true and didn’t make any sense. A notably good consequence, as explained by Thomas above, is that Dan was encouraged to love his family _even more_ than he had loved it before. Wasn’t that nice?\n\nJohn was the only person capable of coming up with what sounded like an intelligent reason to remove MM from OT. It was brilliant! John, we salute you for originality, aptness, and pertness — in this case.\n\nBut now that Adobe has admitted it was a all a mistake, well, John, I believe you can safely retire the old chestnut!\n\n"
    },
    {
      "time": " 16.Sep.2008 11.21am",
      "content": "Also, all that needs to be said about optical size and ’most users’ is Microsoft Word, circa 1995 version, Windows. It detects an optical axis, and automatically creates the correct instance according to what type size the user has selected.\n\nThe user doesn’t even have to know it’s all happening. No fuss! No effort! Just superior type. Why wasn’t Adobe causing this to happen with every app? Bundling an MM with the Mac/Win OS’s? Etc. etc. etc. Evangelism? Advertising?\n\nAnd OT is still clumsily struggling to get a weasly little decimation of this trick going . . . . . you gotta wonder !\n\nTime for OT2, MM2, and Apple Too. Except the guy who could architect it all has gone to Google. Lucky Google!\n\n"
    },
    {
      "time": " 17.Sep.2008 3.25am",
      "content": "”...i.e. why not just make size-specific fonts?”\n\nBecause OS and apps will never handle it and font menus/font managment are already way OUT OF CONTROL! :)\n\nCheers!\n\n"
    },
    {
      "time": " 17.Sep.2008 6.01am",
      "content": "InDesign also does automatic optical sizing with MM fonts, btw.\n\n“Dan was encouraged to love his family even more than he had loved it before.”\n\nDan was neither fired nor encouraged him to leave. His decision on killing MMs was unpopular with a noticeable number of us on the team, but he was still well respected within the team.\n\nOne person has been fired from the type group during my 11 years at Adobe, but it wasn’t anyone known outside the group. A few have left because they decided to do something quite different - in my time, nobody has left the Adobe type team of their own accord who wanted to remain involved in type development. A number of people have been laid off as part of one or another of Adobe’s periodic restructurings (common for high-tech companies).\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 17.Sep.2008 6.33am",
      "content": "Thank you, Thomas, for this explanation!\n\n"
    },
    {
      "time": " 17.Sep.2008 6.39am",
      "content": "I know I should just leave it like that, but I am a very bad person, so I’ll ask two more questions:\n\nWhy did [one person] Fred Brady get fired?\n\nWhy did Linnea and Jim leave? (I was told it was because they were no longer on speaking terms with Robert.)\n\nAnd of course there’s the whole Carol saga.\n\n(Don’t take the bait, Thomas!!!!! You’ve got more important things to do!)\n\n"
    },
    {
      "time": " 17.Sep.2008 6.44am",
      "content": "Can I just say one thing on-topic?\n\nThis thread was started by a wonderful newcomer who sees a need for fonts to do something they aren’t doing. Now he knows that a lot of other people also saw the need, and put a lot of work into making it work. Somehow it all got out of hand, and powers that be, for no particularly good reason, decided no user wanted this stuff.\n\nBut James’s original question proves that there is an insatiable thirst for better font technology, and always will be. It’s time for people to put their heads together and get it working.\n\nType is about the only computer technology where users are getting less, not more, as the decades roll by. That needs to change!\n\n"
    },
    {
      "time": " 17.Sep.2008 6.58am",
      "content": "Bill,  \nI hope they find a better solution as well but I think the powers that be need a bigger showing of what the profitability would be in investing tin sophisticated type technology. They always are going to ask, “Once we’ve solved the problem, am I going to make more money than it cost me to develop the solution?”  \nWe here who love type and want to see it get better for its own sake have a different outlook than the boardroomers and bean counters who come up with the cash. It would only come about if some young, energetic entrepreneur would come along and just do it and prove that it worked. I hope such a person is working on it now :-)\n\nChrisL\n\n"
    },
    {
      "time": " 17.Sep.2008 7.00am",
      "content": "Bill, would you _please_ stop trying to derail threads by acting like Suetonius?\n\n"
    },
    {
      "time": " 17.Sep.2008 10.02am",
      "content": "How can you figure out where you are now if you don’t know how you got there and why?\n\n"
    },
    {
      "time": " 17.Sep.2008 11.05am",
      "content": "Knowing how and why hardly requires us to know how well anyone got along with Robert Slimbach. So stuff the gossip or take it to the playground and share it with the other tween girls.\n\n"
    },
    {
      "time": " 17.Sep.2008 11.43am",
      "content": "I don’t think I can agree, James. Ultimately, gossip is what people talked about while they were doing things round which historical events, great and small, revolved. I think we can all agree that nobody in type has ever put more high quality work hours into multiple master design than Robert. Maybe one reason the technology isn’t here has something to do with the extent to which people were willing to go to bat for him. Please understand: the technology was here - - we had it - - it was deeply embedded into the Mac and Windows way of life. To take the drastic step of ripping it out - - something that’s almost unprecedented in technology - - ? I will never believe that personalities weren’t involved. Same with GX and Win95. Personalities. All great events have small stories behind them.\n\nGoing forwards, there are other issues to be addressed. I’m a multiple master evangelist. I don’t like to talk about the problems that existed with the fonts. MM problems don’t get mindshare from me. But there were lots of people who did have problems and vowed never to use them. Adobe’s general response was, they were using ancient PS drivers or ancient versions of ATM and needed to update their software. Was that all there was to it? I don’t know. I bought into Adobe’s explanation wholesale, as they say.\n\nWere there similar problems with Variations fonts? Or did the GX model prevent that by simplifying the print stream that was ultimately seen by the printer? I guess we can never know, because there was probably never enough professional output. But I am guessing that, in this crucial architectural respect, Variations worked better than MM. Have I got this right? Is there something to learn from it?\n\n"
    },
    {
      "time": " 17.Sep.2008 6.23pm",
      "content": "From Bill Troop:\n\n<cite>The user doesn’t even have to know it’s all happening. No fuss! No effort! Just superior type. </cite>\n\nYou seem to like outrageous language, so here’s some for you. I think I’m a better typesetter than you. Keep your hands off my applications programs & what happens without my control. Give me good fonts & let me set the type.\n\nOne of the myriad of things I like about Matthew Carter is that he doesn’t claim expertise in the use of type. Another person you seem to mention with a bit of affection is Sumner Stone — I think he shares that view as well. I recommend it to you.\n\nCharles Ellertson\n\n"
    },
    {
      "time": " 18.Sep.2008 4.57am",
      "content": "Charles, I am willing to bet that you are a better typesetter than I am, even though I have never seen your typesetting and you have never seen mine. But Sumner is a good typesetter. Among other things, he composed the article I wrote about him in 2006 for MacDirectory ( [http://www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/pdf/S...](http://web.archive.org/web/20081201160842/http:/www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/pdf/SizeDoesMatter1.pdf \"http://www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/pdf/SizeDoesMatter1.pdf\") and [http://www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/pdf/S...](http://web.archive.org/web/20081201160842/http:/www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/pdf/SizeDoesMatter2.pdf \"http://www.macdirectory.com/newmd/mac/PAGES/REVIEWS/SizeDoesMatter/pdf/SizeDoesMatter2.pdf\") — unfortunately the middle page, brilliantly showing off the different sizes, never got uploaded).\n\nRe Suetonicity, my eye fell this morning on this week’s _Spectator_ in which Sam Leith reviews A.N. Wilson’s concluding volume of British history. He heads the review with the sentence Wilson wrote to begin his chapter on Suez.\n\n’Eden, the only male British prime minister known to have varnished his fingernails, was easily the best-looking individual, of either sex, to occupy that office in the 20th century.’\n\nLeith admires the element of gossip and the ’irrelevantly judgmental’. I’ll take my writing tips from Wilson, rather than a design undergrad (albeit a clever one), even though I was dreadfully upset by Wilson’s slanderous treatment of Winifred Wagner. And I rejoice to say I do not know what a tween is, and I hope nobody will ever tell me.\n\n"
    },
    {
      "time": " 18.Sep.2008 9.19am",
      "content": "<cite>Among other things, he composed the article I wrote about him in 2006 for MacDirectory </cite>\n\nHmm. Hard to tell with a PDF. Looks like Francesca Stauffacher’s composition style; very similar to <cite>Type</cite> 1:1.\n\nTypesetting (composition, if you want) is rarely about showing off type. Sometimes it is about showing off a product, sometimes communicating the written word. If you can’t rewrite the copy, as is usually the case when the end is communicating another person’s words, good composition is almost always about making good compromises. Whatever decisions you make, someone would always prefer you made others. For example, in the PDF you referenced, there are cases where, with ragged right composition, two letters are taken down. The graphic designer might approve; tough to find an editor who would let that pass.\n\nBut to stay on topic: With display type, be it an advertisement, a title page, or a chapter title, most anyone who makes any claim to typesetting skill is willing to fuss with the spacing of the letters — the metrics. When you have 2,000 lines of foot- or endnotes, that isn’t an agreeable option. The spacing of the smaller type better be good, because no comp I know is willing to adjust it in the setting part of the job. And as I said above, as important as the metrics are the character shape & weighting.\n\nP.S. I like Sumner Stone, and have admired his both work and kindness to Jack Stauffacher. But we’ve never met face to face, & in any case, I wouldn’t feel comfortable gossiping. I’ve also admired some of Chuck Bigelow’s work. Is that allowed in your gossipy, gotta pick a side world?\n\n"
    },
    {
      "time": " 18.Sep.2008 9.43am",
      "content": "Charles, I am way too ambivalent to pick sides because what interests me is less people than their work. With either, you can be on one side for one reason, and on the other for another reason. I regret to say I know very little about Bigelow but I have always respected him for having the eye to highlight Frutiger’s incredible Icone and for his own and his partner’s incredibly utilitarian (in the good sense) typeface design. If there’s one person I regret not knowing more than another when I had the opportunity, it’s Jack Stauffacher. I really respect you because you describe yourself as a compositor. Long may you multiply!\n\n"
    },
    {
      "time": " 18.Sep.2008 12.24pm",
      "content": "I have not seen Jack Stauffacher since I was a college kid. He ran the Laboratory Press at Carnegie Mellon (Carnegie Tech back then in the early ’60s). It was a fun memory, watching him work! Thanks for reminding me, Charles!\n\nChrisL\n\n"
    },
    {
      "time": " 20.Sep.2008 5.33am",
      "content": "Speaking of variable metrics and Jack Stauffacher, for several years he has only printed with two fonts: Metal Janson, and Stone’s multi-size digital Cycles family. A lifetime of fine printing experience distills it down to those two fonts. Who really needs anything else?\n\n"
    },
    {
      "time": " 20.Sep.2008 5.33am",
      "content": "Speaking of variable metrics and Jack Stauffacher, for several years he has only printed with two fonts: Metal Janson, and Stone’s multi-size digital Cycles family. A lifetime of fine printing experience distills it down to those two fonts. Who really needs anything else?\n\n"
    },
    {
      "time": " 20.Sep.2008 7.28pm",
      "content": "I’ve always thought both the metal Janson’s — Linotype and Monotype — were very nice fonts. I recut a version in Postscript/OT for use with lithographic DTP printing, for my (Tseng’s) own use. We’ve used it a fair bit, including Brown / <cite>Retreat from Gettysburg</cite>.\n\n(Small web sample, which never does any type justice. Only the interior, not the jacket, was set with this Janson.)\n\n[http://www.amazon.com/gp/reader/0807829218/ref=sib\\_dp\\_pop\\_ex?ie=UTF8&p=S...](http://web.archive.org/web/20081201160842/http:/www.amazon.com/gp/reader/0807829218/ref=sib_dp_pop_ex?ie=UTF8&p=S00W# \"http://www.amazon.com/gp/reader/0807829218/ref=sib\\_dp\\_pop\\_ex?ie=UTF8&p=S00W#\")\n\nMy problem with Janson is always what to use as display type.\n\nAs to the font generally, maybe some of the newer releases such as Storm have also solved the contrast problem of the letters, I don’t know. In the original Linotype photocomp Janson fonts this was esp. egregious w/ offset printing. I do believe I like the metal Monotype cut over the Linotype, but it was one of the linecaster’s better fonts. Printing with linecaster-set type was almost always worse than Monotype printed with any care.\n\nFWIW\n\n"
    },
    {
      "time": " 21.Sep.2008 8.07am",
      "content": "Charles, I just get a blank from that link and I’m dying to see the type. Fred Brady when he was at Adobe was always talking about how he’d like to do a proper Kis revival, but of course nothing ever came of it. Sumner Stone made a valiant effort in his Autologic days which is best regarded as a practice run for later, more successful work. As late as the early 90s, one of the large printers was still using a very good Janson — I’m thinking of one of the hardcover editions of ’Interview with a Vampire’ — and now I can’t remember whether I thought it was metal or whether it was an amazing proprietary digitization that actually did the font justice. Which version does Stauffacher use?\n\n"
    },
    {
      "time": " 21.Sep.2008 9.11am",
      "content": "Hmm. The link takes you, for some reason, to an “intermediate” place with the Amazon reader. Clicking on the little left-right arrows at the top of the gray turns a page & the text appears. If you want to go back to the ad for the book & get to the sample the long way, here’s another link:\n\n[http://www.amazon.com/Retreat-Gettysburg-Logistics-Pennsylvania-Campaign...](http://web.archive.org/web/20081201160842/http:/www.amazon.com/Retreat-Gettysburg-Logistics-Pennsylvania-Campaign/dp/0807829218 \"http://www.amazon.com/Retreat-Gettysburg-Logistics-Pennsylvania-Campaign/dp/0807829218\")\n\n\\* \\* \\*\n\nIt is always best to look at type designed for high-resolution offset printing in a book. I’m not sure the pages on the link show anything worth judgment, be that favorable or unfavorable. Another book that I set using this font is <cite>Bach Perspectives</cite> Volume 1, designed by Dika Eckersley, wife of Richard Eckersly, and a fine designer in her own right. That title is probably more widely available in libraries. As I remember, I set vol. 1, vol. 2 was set at our shop, & the later volumes were set elsewhere.\n\nI don’t know which version of metal Janson Stauffacher uses. I would assume Monotype. I never knew him very well, our only contact was through Richard Eckersley, who was a very good friend. But now I’m gossiping; apologies to the thread.\n\nEdit:\n\nNow that I think on it, that Janson was also used for the letters of Henry James (University of Nebraska Press), the last thing designed by Richard Eckersly. he died before the first volume was printed. It was a nice enough design, but will never make the book shows — a lot of books Richard designed were for use, with nothing added excite show jurors (& detract from reading).\n\n"
    },
    {
      "time": " 21.Sep.2008 11.33am",
      "content": "I’ve been mad about Eckersley’s work ever since I discovered the philosopher Avital Ronell, with whom he worked for two decades though they never actually met. I’m now more than ever curious about your Janson. Can’t you tell us a little more about it?\n\n"
    },
    {
      "time": " 21.Sep.2008 1.54pm",
      "content": "OK, with profound apologies to James Puckett, who’s thread has now been hijacked beyond repair . . .\n\nOne of the problems us older photocomp comompsitor’s face is when young designers come along & want to use classical fonts from the metal era; fonts they have read about, but all too often don’t work well in photocomp. With the Linotron 202, Janson & even the later Janson Text were such fonts — with a 10-point setting, the Linotron 202 Janson lower-case “o” looked like two tiny parentheses. Etc.\n\nI got started using Fontographer somewhere around 1990, when the designer Mary Mendel was up to do the AAUP Book Show Catalog. Rather than design it & have it set (& printed) gratis — the usual way for these catalogs to be produced — she decided to take the then-new Macintosh/PageMaker tools & set it herself. She chose Ehrhardt & had at it, & then asked me for some help. First problem was the Ehrhardt, at that time a PostScript Type 3 font from Monotype. That led me to Fontographer.\n\nSince I’d always liked Janson (metal), I started fooling around with it. All this is just background — or maybe foreground — to explain why I can’t remember what’s what. I don’t remember just which version(s) of Janson I started with. On one corner of my table is PS Janson Text on a 5-1/2 inch floppy and the Ehrhardt in PS Type 3 format. There are some others of unknown origin, & specimens printed from Stempel Janson. Anyway, I didn’t start from scratch, & strictly the fonts can only be used by us.\n\nAll this was going on while we were still setting type on the Linotron 202. The first person to use “my” re-worked Janson in a book was my wife, for one of her designs. As luck would have it, about the time the book was printed, George Mackie was over to the states & my wife got him to critique it. (He liked both the design and the type). I started using it for our own typesetting as we switched from the 202 to PostScript. All this preceded the PDF format, and everybody was still running out repro & pasting up pages on the light table. Printing plates were still burned from flats. I kept fooling around with the Janson according to how things looked when printed, when the amount of leading used by the design community changed, etc.\n\nBy the time PDF & DTP printing came along I was a bit tired of fiddling with it, but I think it holds up pretty well; several designers still specify it for interiors, and I still use it for some historical texts when Monticello seems inappropriate. Recently I converted it to OpenType, but didn’t revisit either the characters or the kerning. It could obviously be improved, but best would be for one of today’s talented young font designers to start over & create a new revival that could be commercially sold. Maybe there isn’t enough interest though, revivals of classical designs don’t seem to be of much interest to the new generation of type and graphic designers.\n\nBTW, Richard’s son, Sam Eckersley, is a designer living in your neighborhood. [http://www.red-nyc.com/](http://web.archive.org/web/20081201160842/http:/www.red-nyc.com/ \"http://www.red-nyc.com/\")  \nSam is a fine designer & shouldn’t be though of as Richard’s son any more than Richard should be though of as Tom’s son. But maybe if you bought him a good dinner, he’d give you a copy of <cite>Remembering Richard</cite>, which was written, designed, and manufactured by Richard’s friends. There is a nice piece by Ronell in the book, & she says “Of course, we would schedule meeting times in Berkeley or Lincoln or Paris—or later on in New York, to where his kids had migrated.” So I’m not sure they never met.\n\n"
    },
    {
      "time": " 21.Sep.2008 3.29pm",
      "content": "Charles, it’s a little confusing. In an interview somewhere on the web — and I don’t at all know when this dates from, Ronell said,\n\n’And often I did argue with Richard Eckersley, the marvelous designer, because I felt that he was pulling away from the telephonic logic that I wanted his work to reflect and that he was becoming too autonomous–becoming a computer virtuoso. I didn’t want the computer to overtake the telephonic markings that I felt needed to be continually asserted and reasserted. In a sense, we had a war of technologies–of course, over the telephone (I have never met Richard).’\n\nRe the Janson, I think you should do something about it. A Janson that Eckersley used (in his last book no less) is a Janson we would all be interested in. I doubt that the original rights-holder would particularly care, but . . . I’ll redigitize the font for you if you like — no charge, no nothing — just careful work!\n\nFunnily enough, the first I heard of The Telephone Book was from Jeff Level, who thought it was the last great achievement of pre-Mac typesetting — when in fact it was the first great piece of virtuoso typesetting on the Mac.\n\nWe are hijacking the thread, but in a sense it’s relevant. Janson is one of the fonts that just doesn’t react well to being designed as a single master. Variable metrics isn’t enough. It can probably only work with a tiny size range. Janson is one of the toughest cookies! Another reason why I think you should find a way to make yours more available is that a young designer willing to put that much work into a font is more likely to spend the time on his or her own design.\n\n"
    },
    {
      "time": " 21.Sep.2008 5.51pm",
      "content": "<cite>Funnily enough, the first I heard of The Telephone Book was from Jeff Level, who thought it was the last great achievement of pre-Mac typesetting — when in fact it was the first great piece of virtuoso typesetting on the Mac.</cite>\n\nNo, Jeff Level is about right. If you’re really interested in Richard Eckersley, you need to read <cite>Remembering Richard</cite>. There were only 300 copies printed, & it was privately circulated. I don’t know who owns the rights, what permissions would be needed for more copies. Rich Hendel did most of the coordinative work, Paul Betz edited it, I set it, and Thomson-Shore printed it. After friends & family had their copies, the remainder were distributed at the AAUP Production Manager’s Meeting. I believe I still have a PDF of the whole book; surely Rich Hendel does. I think he and Dika Eckersley would be the ones to ask about another distribution. There was a little bit of nonsense in it, but most was true to the man and his work.\n\nI mention this because one of the pieces was by Michael Jenson, who, if anyone could be called the typesetter of <cite>The Telephone Book.</cite> I’ll quote him:\n\n\\>\\>\n\nMost all of <cite>The Telephone Book</cite>’s base typography was not done on the Mac, but, rather, with “traditional” tools of phototypesetting, design creativity and visualization, creative use of darkroom equipment, and a lot of razorblade work. (p. 27)\n\n. . .\n\nWe started by going over what was functionally possible using the Linotronic 202 and the Magna typesetting system. There was reasonably good WYSIWYG (What You See is What You Get) functionality on the Magna, but the L202 could also be pushed beyond what the Magma system could represent on the screen, which we also explored (p. 29)\n\n\\>\\>\n\nA lot of us, including Richard, got tired of all the talk about <cite>The Telephone Book.</cite> Not the work itself, the talk. I remember providing Behren with some material. What came out in the article was “Hammer blows.” Well, I said it, as a part of a sentence contrasting TTB to Eckersly’s subtle humor, which was rather more prevalent in his designs. But that’s not what got emphasized when the article was printed.\n\nI suppose I’m guilty too. I said the design for <cite>The Letters of Henry James</cite> was Richard’s last work. I remember having to make some last-minute decisions without him. But as anyone who’s worked in a publishing house knows, a designer always has a number of projects going on, some nearing completion (final proof), some going to/just back as first proof, some still on the drawing board, some just sketched. There was no “last book.” Annie Shahan, who more or less succeeded Richard as Senior Designer at Nebraska, would have the strongest vote as to the “last book.”\n\nAs to the Janson, if you want to digitize it & have it available as an Open Source Font, fine with me.\n\n"
    },
    {
      "time": " 22.Sep.2008 5.05am",
      "content": "Let’s do it. I like the idea of open source.\n\nI’m glad Jeff was right after all — mostly - - and so will he be. But isn’t it amazing how difficult it is to establish the facts? how complex the story is? Practically anything you say is just the tip of the iceberg!\n\n"
    }
  ]
}
