{
  "id": "490",
  "title": "LOGO OPINIONS OR IDEAS",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi guys!   \n   \nI need some help to decide on our company logo. We have been through tons of designs, but are not convinced yet. I am not sure whether to use a funky, trendy or modern look or a more serious neutral look. The company offers ALL Design services available and specializes in web and online/offline marketing. Our future plans are to evolve into an integrated advertising agency.   \n   \nWith that said, the name of the company is fullride. For full-integration, full-service and full-power. We thought some ideas with a roller coaster (flash intro), a driving wheel (for logo icon) and other simple and emotive things. Any idea for this is SUPER welcomed. The name can be written in caps, in the case anyone wants to try some ideas. The rest of the name or the text below the LOGO reads, \"creative design group\". We offer intelligent design that sells effectively and creative ideas that will swipe people off their feet.   \n   \nI wanted to have the name plus some icon so I could use both elements for designing and alternating in my company collaterals.   \n   \nI will really appreciate any ideas or suggestions on this.   \n   \nYou ALL understand the toughest decision is to decide on what you want for yourself. THANKS FOR THE FEEDBACK!   \n   \nJorge.   \n   \nThis are some of my ideas:   \n [http://www.fullridemedia.com/ideas/logos.htm](http://web.archive.org/web/20150417062849/http:/www.fullridemedia.com/ideas/logos.htm)\n\n",
  "author": "jorgefusaro",
  "time": "25 Apr 2002 — 1:00pm",
  "uid": "894",
  "comments": [
    {
      "time": "25 Apr 2002 — 1:30pm",
      "content": "Just some things from a non-graphic-designer:   \nI like the name, but forget that rollercoaster business. Since you're not starting off as some long-term megabucks operation, try to focus on one aspect of the scene in the beginning, to maximize your chances for survival. This focus should be reflected in your logo. And don't use Helvetica - it makes you looks like a 40-something accountant. I like the 4-arrows, but maybe make them point \\*in\\*. I also think the slant in the logotype is good, and you might want to choose one letter (maybe in a different case than the rest) that can be made to convey movement. Consider using a set of wide, upright caps for the subtext.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2002 — 1:58pm",
      "content": "Hi Jorge,   \n   \nAs a \"creative design group\", you'd better push yourselves much harder to make the impact you're going for creatively.   \n   \nWith the concept of your company being a full service design firm, the metaphors you've suggested are just that metaphors but none of them really speak to the qualities your trying to impress on potential clients.   \n   \nAs I posted in another critique, your brand goals should be solidly identified before you start killing yourself with rounds of design execution which is what your post seems to suggest.   \n   \nGive your company a strong concept first and the logo will present itself! Good Luck!   \n   \nStuart :D\n\n"
    },
    {
      "time": "25 Apr 2002 — 2:37pm",
      "content": "yeah!   \nThat's the criticism I was exactly looking for.   \nThanks Stuart and Papazian.   \n   \nPapazian which logo do you consider works better. I didn't get the opinion on the type. By the way, the type used is arial, with simple twists to it. I think you get my feeling on what I think is neutral. If you go and check the major advertising and design firms, as well as clothing designers, they all have simple one or two color logos. most of them just text. since they work with different media and aspects of the business, they remain neutral with their identity. This is an observation I have made and I do not want to mislead my clients for a particular service or specialty. I want to appeal to all markets, nationally and internationally.   \n   \nSomething too funky (sort of like a rave flyer or CD cover - which by the way I do like) may not represent seriousness and quality to everyone.   \n   \nI think you guys get my feeling. I originally come from marketing background, I later became a designer.   \n(Stuart) The main focus of the company is to offer intelligent marketing design that sells and represents the brand. Not just some cool graphics and colors. Represent the essence and impact the customers.   \n   \nI also though about \"creative adrenaline\" which works good with the fullride concept.   \n   \nStuart, which logo will you go for, or do you have any other suggestions?   \n   \nGUYS, I truly appreciate your time and opinions.   \n   \nLater,   \nJorge\n\n"
    },
    {
      "time": "25 Apr 2002 — 2:41pm",
      "content": "\\> The main focus of the company is to offer intelligent marketing design that sells and represents the brand. Not just some cool graphics and colors. Represent the essence and impact the customers.   \n   \n   \nmy suggestion: think about this comment long and hard for a couple of weeks without touching your computer. when you think you have a grasp on what this means, then put pencil to paper and i bet that you will get just the result that you will need.\n\n"
    },
    {
      "time": "25 Apr 2002 — 2:53pm",
      "content": "While it's not really unique or powerful, I like the simplicity of the type treatment on the left hand side and down one and you could even lose the tag line and it would hold up pretty well.   \n   \nAs far as an icon goes a well done graphic image of an electric bolt or visual fuel gauge may be appropriate start but I think they need something else to combine with to make them more original.   \n   \nPerhaps something that represents the full power of media? Granted it's a tall order concpetually, but hopefully it should offer some groundwork for your next round of thinking.   \n   \nStuart :D\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:03pm",
      "content": "Great you have a theme, that is a good start and a name with a domain name to match ,even better but now what? Who is the client you are seeking. fortune 500 or a cool music label. Your logo must appeal to them, it should of course also reflect your values and ultimately reel in the jobs you will enjoy doing. If you want to do this right you will need to document everything, make this a case study and not just 30 logos to choose from. Here are the steps I take for a logo design. (branding is something else altogether).   \n   \nPhase1) Planning   \n a) gather content information   \n b) decide hierchy of information   \n c) examine usage   \n d) consider context   \n e) define expression   \n f) consider capability   \n g) establish timelines   \n  \nPhase 2 Elements   \n a) choose elements, photos, illustrations, etc   \n b) spec colors   \n c) choose proper typefaces or modify exsisting type faces or design from scratch   \n d) evaluate fusibility with existing identity (you may not have anything currently so skip this one)   \n   \nPhase 3 Refine Direction   \n a) make comps   \n b) discard unnecessary elements   \n c) emotionalize remains   \n d) choose best comp   \n   \nPhase 4) Complete design   \n a) refine best comp to a complete design   \n b) test legibility-laser, fax, screen, etc   \n c) proof prints   \n   \n(in between all these phases always carry a sketchbook a sketch as much as you can.)   \n   \nthe logo should be a strong enough design to not rely on color. Black and White, with no shades of grey if possible. This of course is just a rule and as they say, rules are meant to be broken.   \nGood Luck.   \n   \ncheck out www.logolounge.com\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:05pm",
      "content": "I reckon the first one is the best...it creates a definite identity. In my humble opinion, the infinity sign has been done to death in company logos + it isn't that inspiring a shape. I would abandon gradient fills within the text...looks dodgy, especially when in grayscale. The arrows are also promising. I'd like to see more of the thin outline of the first example's font coupled with the straightforward colours of the text, perhaps with the innerfacing arrows.   \nMatthew Brown\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:09pm",
      "content": "wow.   \n [http://www.logolounge.com/articles/default.asp?Archive=True&ArticleID=60](http://web.archive.org/web/20150417062849/http:/www.logolounge.com/articles/default.asp?Archive=True&ArticleID=60)\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:15pm",
      "content": "If had been on my toes a bit more I would have signed up by march 31 and gotten unlimited uploads to Logo Lounge for $100, and had the chance to be in their book that is in the works.   \nNow I believe it is about $20 per logo   \nOh well, at least we still have typophile.\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:21pm",
      "content": "i really REALLY like that Alfa Laval logo, but i think that this is mostly because im having to work with that (head)ache logo that i only wish could have been executed as well.   \n   \nif you are going to use the rounded box, do it right for pete's sake.\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:26pm",
      "content": "Logo Lounge actually extended the free up upload (normally $20) for 1 year with paid $100 membership.\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:30pm",
      "content": "\\> I want to appeal to all markets, nationally and internationally.   \n   \nI think that's too ambitious. Start with a focus. If/when you make it, expand. Hey, that's one good reason growing companies do redesigns!   \n   \nFigure out what you can do best, as well as who you can best do it for, \\*then\\* forge your identity. I think in this case movement is good, hipness is good, but also some sobriety. So maybe a slant in the main logotype, some funky organic shape for the logo (no swooshes, please), and a solid subhead using the slogan. The tricky part is the logo, but remember that memorability comes from simplicity as well as sensation.   \n   \n(BTW, Ole, nice list!)   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2002 — 11:09pm",
      "content": "I came across this two pages critizing bunch of logos than don't work or lack originality. Definitely no more swooshes like Papazian said. By the way you insights are been very helpful. They are giving balance to my vision. Very cool.   \n   \nCheck'em out:   \n [http://www.splorp.com/critique/](http://web.archive.org/web/20150417062849/http:/www.splorp.com/critique/)   \n [http://50cups.com/swoosh/starandswoosh.asp](http://web.archive.org/web/20150417062849/http:/50cups.com/swoosh/starandswoosh.asp)   \n   \nMatthew, your ideas are also great.   \nStuart \"the full power of media\". I'm working with that. I like it.   \n   \nole sørensen, thanks for sharing your creative process. That is very generous of you. logolounge.com has been added to my bookmarks :D   \n   \nI have to get to work. I'll upload new stuff as I finish.   \n   \nThanks againaa   \nThis thread is rocking!\n\n"
    },
    {
      "time": "26 Apr 2002 — 2:24am",
      "content": "...the process bumps up the billing as well when working on clients jobs. A nice benefit.\n\n"
    },
    {
      "time": "26 Apr 2002 — 5:58am",
      "content": "I appreciate the simplicity you're trying to   \nachieve by using Arial. Before you continue with   \nit, however, I'd say, use a genuine article.   \n   \nArial is is available to 99.9% of computer users   \nand I'd argue that's fair enough reason to pick any   \nother face, just for the sake of originality.   \n   \nArial is also a bastardization (cross breed) of   \nHelvetica and some others. It's not that great a   \nface.\n\n"
    },
    {
      "time": "26 Apr 2002 — 8:47am",
      "content": "As for simplicity, I would suggest using a typeface with more open lettershapes... Maybe frutiger? It's nice and neutral.\n\n"
    },
    {
      "time": "26 Apr 2002 — 11:34am",
      "content": "Cross-breed fonts, oh lord what is this world coming to. Blame it on the liberals.\n\n"
    },
    {
      "time": "26 Apr 2002 — 12:17pm",
      "content": "Mark Simonson's classy site contains an entertaining essay on the origins of Arial.   \n   \nCheck out \"The Scourge of Arial\" at   \n [http://www.ms-studio.com/articles.html](http://web.archive.org/web/20150417062849/http:/www.ms-studio.com/articles.html)   \n   \nMr. Simonson's typeface design work is wonderful, too, as is the tabbed interface for viewing font samples.\n\n"
    },
    {
      "time": "26 Apr 2002 — 1:31pm",
      "content": "Marc,   \n   \n\"The Scourge of Arial\" is exactly what I was   \nreferring to. Thanks for the link. Mark Simonson   \nrecently gave us permission to run that piece   \nhere as part of our screen fonts series. (I'd say   \n'coming soon' but it's been 'coming soon' for too   \nlong.)\n\n"
    },
    {
      "time": "26 Apr 2002 — 1:40pm",
      "content": "I dislike Arial, but Helvetica even more.   \nThe UC \"R\" in the former is less bad.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Apr 2002 — 2:14pm",
      "content": "Arial isn't as closed as Hevetica either.   \nBoth have ugly proportions IMHO though.   \n   \nAs a matter of fact I'm writing a small essay comparing Frutiger and Helvetica for sign use.   \nIt's real interesting, but tough to find (indepth) info on the two typefaces.\n\n"
    },
    {
      "time": "26 Apr 2002 — 4:18pm",
      "content": "Richard, thanks for the font idea. Do you know where can I get it?   \n   \nI will appreciate any other font that will make it! I have hundred of fonts, but they are too wild. I want to get some better ones. where can I go?   \n   \nThanks for the input.   \n   \nBy the way the arial story is good. I like arial black, its works well with many stuff.\n\n"
    },
    {
      "time": "26 Apr 2002 — 5:39pm",
      "content": "frutiger - [http://www.myfonts.com/FontFamily81.html](http://web.archive.org/web/20150417062849/http:/www.myfonts.com/FontFamily81.html)\n\n"
    },
    {
      "time": "30 Apr 2002 — 1:13am",
      "content": "I am new to this forum, reffered to by Mr. Stephen Coles from MyFonts. I am a romanian graphic designer specializing in corporate identity with a particular interest in typography. While I have no academic training (I am a math graduate...), I have worked on some projects with American design agencies, thus getting the hands-on training needed. This is not enough an it shows now, as I am confronted with a decision making problem. My friends posted the case study at www.grapefruitdesign.com/wireality/id\\_review01.shtml, where you can find the issue and the comments.   \n   \nThe problem I have is the overall balance of my hand customised logotype, as well as the A-S ans S-T white space. Once these issues solved, I hope my clints will make up their mind. (I have beeen working on this project for 3 months now...)   \n   \nThank you all in advance.   \nGeorge   \n   \nP.S. this forums are exactely what I have been looking for ... Well done ...\n\n"
    },
    {
      "time": "30 Apr 2002 — 5:11am",
      "content": "![4_big .jpg](http://web.archive.org/web/20150417062849im_/http:/www.typophile.com/forums/messages/29/1255.jpg)\n\n"
    },
    {
      "time": "30 Apr 2002 — 5:22am",
      "content": "White spacing issues, the ligature? between the S and the I is clever but does just not quite work as it throws off the balanace of everything else, maybe if the letters were a thinner weight. try more repetition of elements. flatten out the tails of the S's.\n\n"
    },
    {
      "time": "30 Apr 2002 — 8:23am",
      "content": "In terms of spacing, I think you're only real problem is the \"AS\". One thing you could do (but it wouldn't be enough on its own) is too loosen the whole thing a bit.   \n   \nBTW, you might also consider ligating the \"ST\".   \n   \nhhp\n\n"
    },
    {
      "time": "30 Apr 2002 — 10:08am",
      "content": "Thank you...Your remarks point out some new issues none of the people involved in the project noticed. Hopefully I'll be able to show you the final choice in a day or so...   \n   \nMille grazie, so to speak,   \nGeorge\n\n"
    }
  ]
}
