{
  "id": "49019",
  "title": "handwritten script to ID",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Dear typophiles, perhaps you can tell me what the script here below is? I have _no_ idea...\n\nThanks in advance, B\n\n ![](http://web.archive.org/web/20131012222822im_/http:/typophile.com/files/script_to_ID_3775.jpg)\n\n",
  "author": "ben_archer",
  "time": "2 Sep 2008 — 8:26pm",
  "uid": "1337",
  "comments": [
    {
      "time": "2 Sep 2008 — 8:55pm",
      "content": "This is an interesting specimen Ben. On first blush it looks hand written as a result of the tones in the ink. But after close scrutiny it is a typeface... I just do not know what it is. What a wonderful ruse. The scribbling and the blot are the coup!\n\nI am so sorry that I cannot help you. But there are certainly people on this site that will come to your rescue!\n\nThe fact that you thought it was a typeface is a tribute to you as I am a calligrapher and had to look twice. Yes it may have been obvious but I had to make sure!\n\nMichael\n\n"
    },
    {
      "time": "2 Sep 2008 — 9:03pm",
      "content": "Thanks Michael.\n\nIndeed it has been artfully done – and it's my wife, not me, who deserves the credit for recognising it as a typeface rather than a piece of lettering. Really it's an object lesson for anyone wanting to make something look handwritten while using computer software to generate the artwork... let's hope someone can solve this riddle.\n\n"
    },
    {
      "time": "2 Sep 2008 — 9:05pm",
      "content": "They will!\n\nMichael\n\n"
    },
    {
      "time": "2 Sep 2008 — 10:15pm",
      "content": "The closest fonts I know are in the [3IP Historical Pens set](http://web.archive.org/web/20131012222822/http:/www.fontshop.com/fonts/downloads/three_islands_press/3ip_historical_pens/).\n\n"
    },
    {
      "time": "3 Sep 2008 — 12:21am",
      "content": "Thanks Stephen\n\nYour comment was very useful, because although it's not any of the 3IP Historical Pens, it got me thinking and I went to check out the script section at Veer; that led to thinking about P22's artist's collection, which has just coughed up their [Vincent Regular.](http://web.archive.org/web/20131012222822/http:/www.p22.com/products/vincent.html)\n\nSorry if this deprives anyone of their due share of fun...\n\n"
    },
    {
      "time": "3 Sep 2008 — 3:10pm",
      "content": "Ben\n\nYour wife sounds like a keeper! My wife would say What's a typeface!\n\nMichael\n\n"
    }
  ]
}
