{
  "id": "49012",
  "title": "Logo critique please!",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I am working on a logo for a finance company. This is what i have so far. Please give me some feedbacks. Thank you.  \n [view image](http://web.archive.org/web/20081201163530/http:/typophile.com/files/centinella_0.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [centinella.jpg](http://web.archive.org/web/20081201163530/http:/typophile.com/files/centinella_0.jpg) | 42.8 KB |\n\n [‹ High-End Spa Logo](http://web.archive.org/web/20081201163530/http:/www.typophile.com/node/48651 \"Go to previous forum topic\") [Photographer logo ›](http://web.archive.org/web/20081201163530/http:/www.typophile.com/node/48962 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201163530/http://www.typophile.com/user/25798\" title=\"View user profile.\">catdogucd</a>",
  "time": "<br>",
  "uid": "25798",
  "comments": [
    {
      "time": " 3.Sep.2008 4.51am",
      "content": "It doesn’t strike me as financial.\n\nI don’t recognize it.\n\nCan you tell us your thoughts behind these logos?  \nWhat is the concept driving all of this?\n\nIn what area is this business exactly? Financial is wide. Is it a large one or just a few people?\n\n"
    },
    {
      "time": " 3.Sep.2008 7.35am",
      "content": "They’re all OK, but all feel like rather generic logos that could be used for any business.\n\n"
    },
    {
      "time": " 3.Sep.2008 8.44am",
      "content": "The top one seems the most fiscal to me, though that might be becuase I associate it with Wachovia’s logo. The bottom one is reminiscant of a film production company that I can’t place a name too right now.\n\n"
    },
    {
      "time": " 3.Sep.2008 9.59am",
      "content": "_becuase I associate it with Wachovia’s logo_\n\nAnd the arc in #2 looks like Citi’s.\n\n"
    },
    {
      "time": " 3.Sep.2008 11.43am",
      "content": "Exactly what I meant, Aluminum.  \nIt could be used for any business indeed.\n\nA logo should stand out. Identify, tell the viewer a little about him/herself.\n\nThat is what I miss\n\n"
    },
    {
      "time": " 3.Sep.2008 2.53pm",
      "content": "I really like the last one. I feel it has the best overall balance and is most unique.\n\nAs for all the comments above - finance can be one of the hardest things to design for and as more and more finance corporations strive to differentiate and build brand equity through design this gets even harder.\n\nI think you did a good job on all of these though.\n\n"
    },
    {
      "time": " 3.Sep.2008 6.18pm",
      "content": "Thanks for your inputs. This is the second stab on the logo. This is an investment company. Thanks again for your respond.\n\n ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/centinela_2_5514.jpg)\n\n"
    },
    {
      "time": " 3.Sep.2008 9.03pm",
      "content": "My favorite of this new set is number 2. It reminds me of the door of a safe and gives confidence and security to the company name.\n\npenn\n\n"
    },
    {
      "time": " 4.Sep.2008 7.00am",
      "content": "Just casting my humble vote for #2 as well. Good job!\n\n"
    },
    {
      "time": " 4.Sep.2008 7.46am",
      "content": "Agreed. SAme reasons as already mentioned but also because of the interlocking nature it expresses the idea of partnership and the middle bit looks like an old stamped C.\n\nI would only maybe go with 5 if they were a large worldwide company since the arc through the logo makes them seem worldwidish lol.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 4.Sep.2008 8.05am",
      "content": "I like your improvements. And while visually I like the look of #2. The stylized C looks like a ¢ mark to me. And between the name “Cent”inela and the ¢ symbol the subliminal message is that this firm won’t deliver big returns on your investment. When investing I want to see $ not ¢. Perhaps re-working #2 to eliminate the similarity to a ¢ mark.\n\n"
    },
    {
      "time": " 4.Sep.2008 9.09am",
      "content": "I like #5. #2 is nice, but, at least for me, I keep seeing that adapter one used to use to play 45s on an LP record player. But it’s a decent concept given the ’C’ and what the others have said about it. Maybe give it some more breathing room within the box and see if you really need the outer outline.\n\n"
    },
    {
      "time": " 4.Sep.2008 10.34am",
      "content": "#2 and #5 both work for me. The others remind me of this:\n\n ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/commodore_logo_4958.png)\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 4.Sep.2008 11.52am",
      "content": "I like 1 and 2.\n\n"
    },
    {
      "time": " 4.Sep.2008 12.41pm",
      "content": "1 and 2 here.\n\n3 is too busy and the line (at the bottom of the ’C’) is also too thin in relation to the rest.\n\n4 brings no feeling at all.\n\n5 a little better.\n\nWhy did you break out the curve in 1 and 2?\n\n ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/pic_4774.jpg)\n\n"
    },
    {
      "time": " 4.Sep.2008 2.25pm",
      "content": "yeah, it makes it look like a maze...’lost’ is not a good undertone for finance!\n\n1 is a bit too web 2.0 for me\n\n3 and 4 look like clip art\n\n5 is robust and trustworthy...my favourite\n\n"
    },
    {
      "time": " 4.Sep.2008 2.56pm",
      "content": "bobbybobo, it’s the letter “C” inside the interlocking circle.\n\nI personally like 2 and 5. I can see them going for 5, I think I need to refine 2 a bit more.\n\n"
    },
    {
      "time": " 4.Sep.2008 3.10pm",
      "content": "Can you give more detail about your concept and how it relates to investing? I understand that there are two C’s in the name, but that doesn’t tell me anything about what they do visually. I think #3 looks like a medication.\n\n"
    },
    {
      "time": " 4.Sep.2008 5.10pm",
      "content": "It seems that you have backed yourself into a wall with the usage of a circular mark. I think you may be able to jolt your creativity by exploring other shapes.\n\nI do however understand the correlation between the circle and a coin which does relate to financial, however the mark is beginning to looking more like a Frisbee. Also you have several scale issues with the size of your marks and logotype, your mark is too large for some of the supporting type. By adjusting this scale you will increase your mark’s legibility.\n\n"
    },
    {
      "time": " 5.Sep.2008 10.04am",
      "content": "I like the type treatment in #4 and 5, if only “Capital Partners” was a tad bolder/easier to read. The all upper case works better than the upper and lower case. #1 is okay, but I prefer the letter height contrast in 4 and 5. However, it all depends upon the culture. Do these folks refer to themselves as CENTINELA with CAPITAL PARTNERS, more softly stated afterwards? Or are they CENTINELA CAPITAL PARTNERS? That should determine the typographical contrast. Either way, be sure to SPELL CORRECTLY, as there are typos in ’capital’ on numbers 2 and 3.  \nSymbolwise, keep it simple. 1, 2 and 3 are too complicated. Like bobbybobo, I need to know about the thought that drives the symbol. What about the company are you trying to communicate? What core values does the symbol represent?\n\n"
    },
    {
      "time": " 5.Sep.2008 10.39am",
      "content": "#2 with the type treatment on #5 would be worth a try. Also: In addition to the spelling error in “CAPTIAL,” you also have, on the same line, an error in “PARNERS.” As far as the mark in #2, I think it would be worth it to simplify it. For example, do you really need the double border? And, I just love the idea that the mark can be read as a safe lock. But, as David Ford points out, it can also be read as a maze. Can you simplify it and make it look MORE like a safe lock?\n\n"
    },
    {
      "time": " 5.Sep.2008 2.01pm",
      "content": "Wow, such great responds. Thanks so much. I will keep the symbol in number 5 as one of the final choice. I personally really like it. As for now, this is the re-work of the shield. I tweaked it a bit to mimic the key hole.  \nAs far of the company, they want to promote safety and confident when doing investment with them.\n\nSo here is the shield, please let me know what you think. Thanks again you guys.\n\n ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/shield_3886.jpg)\n\n"
    },
    {
      "time": " 5.Sep.2008 9.08pm",
      "content": "The symbol is too complex and embellished for my taste, how about something simple like this?\n\n ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/C_5272.gif)\n\n"
    },
    {
      "time": " 5.Sep.2008 9.48pm",
      "content": "@ zevbit: That was exactly what I started out with, and I thought It was too simple, not up to the complexity of the finance nature. Plus don’t you think it look a bit like the copyright mark?\n\n"
    },
    {
      "time": " 5.Sep.2008 10.03pm",
      "content": "_That was exactly what I started out with, and I thought It was too simple, not up to the complexity of the finance nature_\n\nYour symbol should need not be that literal. Heck all these are way too simple if you truly want them to reflect on the complexity of finance. Making something memorable and iconic should be your goal.\n\n_Plus don’t you think it look a bit like the copyright mark?_  \nYou may ave a point there.\n\n ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/170px-Copyright_4141.svg.png)\n\nIf it bothers you how about making the overall shape an octagon or hexagon?\n\n"
    },
    {
      "time": " 5.Sep.2008 10.28pm",
      "content": " ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/c2_6584.gif)\n\n"
    },
    {
      "time": " 6.Sep.2008 4.17am",
      "content": "Looks more like a ¢ then a © which would be good considering the subject, but at smaller sizes it could be confusing. I agree that simpler is better though.\n\n"
    },
    {
      "time": " 6.Sep.2008 12.19pm",
      "content": "I’m sorry to be the wet blanket but I just don’t see these icons as being positive ones for an investing firm. The design of your c mark looks way too much like either a copyright mark or a cents symbol. Neither seems appropriate. And reduced to business card size will just add to the confusion of the logo. You said your client wants to focus on security and confidence but what their clients will want from them is security and confidence in growth. I mean otherwise why give your money to an investment firm? Safety can be found in a bank or under your mattress. Is a lock/c symbol the best way to go?\n\nMy opinion is in the minority on this thread, and I don’t want to seem harsh. I just believe that if you devote a little more time to exploring other ideas you will come up with a stronger design.\n\n"
    },
    {
      "time": " 6.Sep.2008 1.31pm",
      "content": "Of all the designs, I like #5. #4 is good too. I like the cleaner looks.\n\nIt may also be just me, but I am kind of tired of the swooshes running through logos for finance. I work at a credit union and the swooshes and arcs seem too ubiquitous in the financial sector.\n\nIf you took the swoosh out of 5, I think it would be the best by far. I kind of get the impression you are going for the interlocking C and P, so if that’s the case, why not keep it simple and take out the swoosh.\n\nAnother thing I always think about with swooshes and arcs is that they should always end up, especially in finance, to help people think positively about finance and your company. Downward angles in design always send out an impression of negativity.\n\n"
    },
    {
      "time": " 6.Sep.2008 11.50pm",
      "content": "How about this?\n\n ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/c3-3d_3812.gif)\n\n"
    },
    {
      "time": " 7.Sep.2008 3.31am",
      "content": "Think I nailed it here.\n\n ![](http://web.archive.org/web/20081201163530im_/http:/www.typophile.com/files/cx_6389.gif)\n\n_P.S._\n\nSorry for hijacking your thread. ;)\n\n"
    },
    {
      "time": " 7.Sep.2008 1.17pm",
      "content": "I totally and utterly agree with K.Nevin.\n\nTake a piece of paper and a pencil and start looking for a distinct mark. Adding perspective to non memorable symbols will not make them memorable.\n\n@zevbiz: the last one should be what? Yoghurt lid that opens on two sides? Sorry but i find it ... well simply put: not a logo.\n\nOf all the things so far: nothing worked yet.\n\nBut. investment banking = i = has a dot that can be transformed into a c = c can be seen as sun rising behind the earth... dawn of wealth?\n\nJust ideas popping into my mind...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
