{
  "id": "49025",
  "title": "Top Ten Reasons why you should like Typophile",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This is a poll to establish why Typophile is great, what makes it so attractive and keeps us Typophilers endeared to the place. Once we've worked out say, 25 good reasons, we can vote for the top ten \"most popular\" ones.\n\nI wonder if Paul Hunt would like to put together one of his polling forms so we can get an accurate tally for the top ten?\n\nI'll start off with a handful of sample reasons:\n\n\\* It's a rollercoaster ride but it's the best design & visual arts-based rollercoaster ride going on the internets. Put money on it. Typophile is the best.\n\n\\* It's a diverse, dynamic community of mostly open-minded, left-thinking, right-brained and uncannily creative visual thinkers and artists unparalleled in their ability to explain what typography is all about.\n\n\\* Some of the world's best typeface designers, typographers, book designers, calligraphers and type engineers are here. The amount of talent on tap surprises me daily. (similar to above but slightly different reason)\n\n\\* We have the most exhaustive and thoroughgoing typo discussions & debates in the world, and you can learn more about typography here than you ever thought possible.\n\n\\* From a technical standpoint Typophile's forum pages are the easiest to read on the web (you'd expect that anyway but it's worth stating).\n\n\\* Typophile is at least as long as it is broad. It's hairy too, in some places some of the time. But stick with it, roll with the punches and take it all in good faith, and you will see the point with everlasting clarity.\n\n\\* It makes me proud to be a Typophiler. I'm touched. I'm humbled. I'm impressed. In the future everybody will be a type designer for 15 minutes.\n\nAny others? There are stacks of reasons. Go for it . . .\n\nj a m e s\n\n",
  "author": "James Arboghast",
  "time": "3 Sep 2008 — 12:18am",
  "uid": "9349",
  "comments": [
    {
      "time": "3 Sep 2008 — 1:11am",
      "content": "Borrowing (10-1) of James's words and down-crosswording them:  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nTouched  \nYou can learn more about typography here than from any TypeSchool.  \nProud to be a Typophile(r).  \nOpen-minded  \nPopular  \nHumble  \nImpressed  \nLeft-thinking (right-brained)?!  \nEasy to read on the web  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nWith Flowers\n\n"
    },
    {
      "time": "3 Sep 2008 — 3:34am",
      "content": "\" you can learn more about typography here than you ever thought possible \"\n\nIt is a 24/7 TypeCon, without the need to catch a plain ?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEven for those who can't figure how in the world the quotes are inverted ...\n\n"
    },
    {
      "time": "3 Sep 2008 — 5:39pm",
      "content": "1, When I first came here, I thought serifs were a kind of angel. (bigger than cherubs and not as nice - or much nicer... I forget.)  \nNow I know that they are the sort of spiky things on Times New Romain that make it different from Areal.\n\n2, As part of my job, over the last few years, I have had the opportunity and privilege to study typography and type design quite deeply. And on company time! It's been kinda cool. For me at least. My coworkers seemed to think that eating glass would have been preferable and were glad is was my burden and not theirs, but - That's their problem :o)... Any how, I have found no better source of all-round typo-learnin' anywhere.\n\n3. In my opinion, typefaces & how they are generated, rendered, reproduced, read and understood are the nuts and bolts of human communication. It is worth knowing about type if you are a designer (... or a reader), and it is frankly just very interesting and fun to read some the debates that take place about the directions things in typography are going in.\n\n4, I've seen some of the best damned type designers and typographic experts you'll find anywhere on the planet answer the most basic questions from the the greenest novice in enormous detail and with no hint of condescension.\n\n--  \n--\n\n-=®=-\n\n"
    },
    {
      "time": "3 Sep 2008 — 5:57pm",
      "content": "It’s like being backstage with [put your favourite rock band here].\n\n"
    },
    {
      "time": "5 Sep 2008 — 12:28am",
      "content": "Right on peeples. Thanks. Jimi thanks you. Can we keep this one going? Time will tell.\n\nj a m e s\n\n"
    },
    {
      "time": "5 Sep 2008 — 5:07am",
      "content": "The Typophile community actually acts like a good, decent community. It's like that local historical neighborhood with all the interesting characters who live there. To top it off, these characters will invite you, the complete stranger, to stop in for the neighborhood BBQ. And the discussions here are, even when completely above your understanding, interesting to observe.\n\n"
    },
    {
      "time": "5 Sep 2008 — 8:01am",
      "content": "Meeting friends without faces who make faces with friends.\n\nChrisL\n\n"
    },
    {
      "time": "5 Sep 2008 — 8:40am",
      "content": "We all share one common love interest - TYPE\n\n"
    },
    {
      "time": "5 Sep 2008 — 8:43am",
      "content": "Brilliant chiastic structure, Chris, but I've come to expect that from you.\n\nI love this site because it's so very educational. Even a totally untalented typedweeb like me (look for my creations on FontStruct, username metalfoot) has learned a ton from this site. I've gained some valuable resources, and stimulated my brain. What else can you ask from a web-forum?\n\n"
    },
    {
      "time": "5 Sep 2008 — 11:51am",
      "content": "It's a thoroughly delightful and illuminated place, where humanism and craftsmanship can ride on the avant-garde of technological revolution without clashing into a bloody civil war with everyone getting shot behind the chemical shed.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20120720132936/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "6 Sep 2008 — 6:54am",
      "content": "In addition to what is discussed here, not enough has been said about the beauty of this site and its interface. I'm not a coder but am involved in my share of web design. This site is so easy on the eyes and so simple to navigate and interact that just being here is a respite from the glare and clutter of wherever else you've been surfing before you arrive.\n\n[http://typographyshop.com](http://web.archive.org/web/20120720132936/http:/typographyshop.com/ \"http://typographyshop.com\")  \n [http://kinggroupmedia.com](http://web.archive.org/web/20120720132936/http:/kinggroupmedia.com/ \"http://kinggroupmedia.com\")\n\n"
    },
    {
      "time": "6 Sep 2008 — 2:19pm",
      "content": "\\> _why Typophile is great, what makes it so attractive and keeps us Typophilers endeared to the place_\n\nThe fact that Typophile is NOT run by a cabal.\n\n"
    },
    {
      "time": "7 Sep 2008 — 11:09am",
      "content": "Because people are here to enjoy the culture  \nof type more than to make money from type.\n\nhhp\n\n"
    }
  ]
}
