{
  "id": "49039",
  "title": "Feedback on card designs?",
  "forum": "Design",
  "tags": [

  ],
  "content": "My first post here. I had already graduated from college when I discovered graphic design. I’ve been trying to soak up as much information as possible on my own, and I would really appreciate feedback. Please destroy as much as you want.\n\nThese are ideas for cards for my business (an economics firm). They want a general thank you card, which would be used for our clients, primarily colleges and workforce boards. As a bit of explanation, the flourishes on the card with the thank you in the bottom left corner are supposed to be turning into wheatfields (my company is located in a very wheat-ish part of the country).\n\nPreferences? Do none of them work? What tweaking should I do? Oh, and I just noticed that I never fixed the serifs on the bottom of the Y in the calligraphic card. Heh.\n\nThanks\n\n| Attachment | Size |\n| --- | --- |\n| [thankyou\\_card.jpg](http://web.archive.org/web/20081201174740/http:/typophile.com/files/thankyou_card.jpg) | 55.69 KB |\n| [card\\_2.jpg](http://web.archive.org/web/20081201174740/http:/typophile.com/files/card_2_0.jpg) | 61.07 KB |\n| [card\\_3.jpg](http://web.archive.org/web/20081201174740/http:/typophile.com/files/card_3_0.jpg) | 45.47 KB |\n\n [‹ Looking for an RG ligature](http://web.archive.org/web/20081201174740/http:/www.typophile.com/node/49028 \"Go to previous forum topic\") [What's the font used in this forum? ›](http://web.archive.org/web/20081201174740/http:/www.typophile.com/node/49049 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201174740/http://www.typophile.com/user/36281\" title=\"View user profile.\">BEH</a>",
  "time": "<br>",
  "uid": "36281",
  "comments": [
    {
      "time": " 3.Sep.2008 8.00am",
      "content": "Sorry about that. I’m afraid I haven’t figured out how to bring the images up directly without linking them.\n\n"
    },
    {
      "time": " 3.Sep.2008 9.36am",
      "content": "Hey there. Nice designs! All of them are very different in style impressive. My favorite would have to be the second one (turquoise background) lovely Type treatment! :) Try to play around with that one some more  \n-Take care.\n\n"
    },
    {
      "time": " 3.Sep.2008 9.40am",
      "content": "I truly do love the first one. Just a thought... have you thought about more subdued organic colors? And Can you extend the tail of the y? I think this is wonderful. Just ignore me if you do not agree. Good job!\n\nEdit: No, great job!\n\nMichael\n\n"
    },
    {
      "time": " 3.Sep.2008 9.41am",
      "content": "Thanks for the feedback! I appreciate your comments. I’ve been working on tweaking the first one by changing the bottom of the card to a soft brown, and the flourishes to white. When I’m happy with it, I’ll post a revision.\n\n"
    },
    {
      "time": " 3.Sep.2008 10.36am",
      "content": "I like both one and two.\n\nNumber one needs some work though. I like your idea about the brown bottom and reversed text. Right now it’s a little too stark between the black the green and the gold color. Although, if you do color the bottom brown it may lose some of the charm that the letters forming the hills brings. What if you just made the text brown and changed the green and gold in the hills to be a little more natural looking? The green, at least is a little too bright and neon-like for me.\n\nThe other thing that bothers me about number one is the contrast between the sans-serif font and the swashes forming the hills. I’d suggest making the swashes start thicker from the letter forms and gradually thin as they go. I’d also suggest experimenting with some serif fonts like garamond or caslon to see if that would look any more natural with the swashes. Perhaps even taking similar letter forms from number two would work well here.\n\nTwo needs a little work on the letter forms - refining the swashes and serifs, etc. It’s nice letter-work, though number one may fit the bill better for your company.\n\nI’m eager to see your revisions.\n\npenn\n\n"
    },
    {
      "time": " 3.Sep.2008 11.22am",
      "content": "Maybe a demi or regular as opposed to bold.\n\nMichael\n\n"
    },
    {
      "time": " 3.Sep.2008 11.36am",
      "content": "I agree with Penn about number one. Numbers 2 and 3 are both gorgeous compositions that do wonders with space and size. And Michael is right about the colors—these pale tones are right out of 2005.\n\n"
    },
    {
      "time": " 4.Sep.2008 10.28am",
      "content": "Alright, here’s a revision on the first card. I ended up reworking the flourishes so that (hopefully) the card is simpler. When I tried a serif font, I agreed with you, pennANDinkit looked much more appropriate. I also tried brightening up the colors...although I confess I have an inordinate fondness for unsaturated hues.\n\nTwo versions here, one with brown on the bottom and one without. I think I prefer the simplicity of the first card, and that the concept is more understandable, but I would love to hear feedback.\n\n ![](http://web.archive.org/web/20081201174740im_/http:/www.typophile.com/files/thankyou_card_6087.jpg)\n\n"
    },
    {
      "time": " 4.Sep.2008 11.27am",
      "content": "“Ooooooh number 2 dad! Way cool,” my 20 year old daughter just passed by and exclaimed. Gets my vote also.\n\nEdit: but I do like the first one too.... maybe the bottom of the second one looks heavy as I look again.. Either one wins.\n\nMichael\n\n"
    },
    {
      "time": " 4.Sep.2008 1.03pm",
      "content": "I did thicken up the lines on the bottom one so they would stand out more. Maybe I should tone that down a bit. I should probably print it off to make sure (major shortcoming of mine...I always forget to print things off until the last minute). Sweetness. I think I’m just about satisfied with this one.\n\n"
    },
    {
      "time": " 4.Sep.2008 2.56pm",
      "content": "Big improvement. I like either of them.\n\nThere is, however, still something funky with the swashes. They don’t flow well out of the letter forms and the varying thickness around the top of the brown hills throws me off. Some of them also aren’t a consistent size in relation to the white stroke over green or yellow hill they’re forming. Work on continuity and flow and refining the shape of the swashes so they look more natural.\n\npenn\n\np.s. I didn’t know kids were saying “way cool” again.\n\n"
    },
    {
      "time": " 4.Sep.2008 4.06pm",
      "content": "Alright, I’ve tried tweaking the swashes. Unfortunately, I only have InDesign on my work computer, so my makeshift attempts at smooth joins may not have worked too well. Does this pass? If not, I’m way too much of a perfectionist to stop now. Thanks.\n\n ![](http://web.archive.org/web/20081201174740im_/http:/www.typophile.com/files/thankyou_card_4055.jpg)\n\n"
    },
    {
      "time": " 4.Sep.2008 4.15pm",
      "content": "Hey Penn... I don’t care what she says as long as she is talking to me ; ) Know what I mean?\n\nMichael\n\n"
    },
    {
      "time": " 4.Sep.2008 7.08pm",
      "content": "Two and Three are my favorites.\n\nNumber 3 has a simple, but sophisticated feel associated with a more wealthy clientelle. I don’t know if that’s the type of impression you’re going for though. Also in number 3 I would say the Bickham setting seems a bit weak for the space.\n\nI like the playful and more trendy look of 2. I would maybe play up some of the various elements a bit more. I would lower the crossbar of A some and fix the serif at the top to match other. The tapered strokes going on adds a nice touch and maybe worth exploring playing that up more. Also… since you are already mixing other styles in a bit as in your O and at least in parts elsewhere; you might try a version of N with thinner verticals so you can build up a better contrast where it shoots through the H.\n\nStephen\n\n"
    },
    {
      "time": " 5.Sep.2008 8.33am",
      "content": "Thank so much for the help, everyone. I’ll be working on revising the second and third versions soon. I’ve never done custom lettering before, so I might try starting off the second card with calligraphy (since I’ve dabbled in it for quite a while), and then vectorizing it (is that actually a word?).\n\nAny suggestions on things I should watch out for with the letters? I know my serifs are pitiful, so if there’s a method for working out good ones, please enlighten me. Maybe I should warm up by creating an avatar so I don’t look quite so...raw.\n\nGood thing I really like letters, because I have the strange feeling I’m going to be staring at them for mind-numbingly long periods of time in the near future.\n\nCheers.\n\n"
    }
  ]
}
