{
  "id": "49033",
  "title": "DOM PERIGNON",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hey guys!\n\nplease help me in finding the Dom Perignon-font. Do you have any clue what font it is and where to find it? please!\n\nthanks...xuxu\n\n",
  "author": "xuxu",
  "time": "3 Sep 2008 — 6:01am",
  "uid": "36228",
  "comments": [
    {
      "time": "3 Sep 2008 — 7:35am",
      "content": "2nd time someone's asked you this (on a different post of yours); how about giving us an image, so we can help you.\n\nJH\n\n"
    },
    {
      "time": "3 Sep 2008 — 12:03pm",
      "content": "You can get close with [Typo Upright](http://web.archive.org/web/20140307125209/http:/www.myfonts.com/fonts/bitstream/typo-upright/).\n\n ![](http://web.archive.org/web/20140307125209im_/http:/typophile.com/files/2498154464_16ce22770a_6195.jpg)\n\nFound here: [http://flickr.com/photos/70238393@N00/2498154464/](http://web.archive.org/web/20140307125209/http:/flickr.com/photos/70238393@N00/2498154464/ \"http://flickr.com/photos/70238393@N00/2498154464/\")\n\n"
    },
    {
      "time": "4 Sep 2008 — 2:28pm",
      "content": "Fantastic! Not only does someone else find the pic for this person, they also don't both returning to at least say thanks! Is it only me that gets p#\\*sed off with this kind of ungrateful attitude?\n\nJH\n\n"
    },
    {
      "time": "4 Sep 2008 — 4:16pm",
      "content": "I've reserved my energy for other things in life. ;^)\n\n"
    },
    {
      "time": "5 Sep 2008 — 8:07am",
      "content": "oh cool, thank you miss tiffany:) i'll try that!\n\nand well...jazzhustler, sorry, that i cannot post an image with my posts because it's not working, and i'm so sorry that i didn't check this forum for 2 days...and i think it's soooooo nice of you to care about the other persons that they get a thank you, it's so nice of you to spend your energy on these things... you should get awarded!\n\n"
    },
    {
      "time": "5 Sep 2008 — 1:07pm",
      "content": "Well if you can't post an image, just say so. It doesn't take any effort to explain that when you're posting at the time. If you can't be bothered to do at least that, I can only assume it's just plain laziness.\n\nMy point stays the same despite your sarcactic remarks - people help each other out on these forums, and it's common courtesy everywhere (not just this forum) to show at least some appreciation for the people that take time out to look into questions in this forum. The fact that I checked your post in the first place was to see if I could help, so in fact I was, as you say -'...spending your energy on these things...' - in order to initially help out.\n\nYour barbed remarks only show that you don't really appreciate the help offered you. Miss Tiffany obviously doesn't let this kind of thing get to her, and I too usually let it go, but then I never claim to be perfect, just appreciative of the help given - check any of my posts.\n\nJH\n\n"
    },
    {
      "time": "5 Sep 2008 — 1:13pm",
      "content": ":^D\n\nLet me take this opportunity to state that I'm not perfect either. I was just having a good day on this day when I posted about letting it go.\n\n:^P\n\n"
    },
    {
      "time": "5 Sep 2008 — 2:51pm",
      "content": "Hey Miss Tiffany, I wasn't having a go at you. Hope it didn't appear that way. I was in fact pointing out a strength. Have a good weekend.\n\nJH\n\n"
    }
  ]
}
