{
  "id": "4905",
  "title": "Against Typography?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Nick,   \n   \nGill Sans \"a\" book face? I say whooh to hang gliding Nick. Gill Sans [http://www.linotype.com/6-1822-6/gillsans.html?PHPSESSID=03bc86dbb1b605f398a58a1edc879ff1](http://web.archive.org/web/20131108192539/http:/www.linotype.com/6-1822-6/gillsans.html?PHPSESSID=03bc86dbb1b605f398a58a1edc879ff1) would be great for a trolley ticket or signage on a bread truck.   \n   \nNice choice.\n\n",
  "author": "gerald_giampa",
  "time": "26 May 2004 — 12:22pm",
  "uid": "2094",
  "comments": [
    {
      "time": "26 May 2004 — 1:10pm",
      "content": "We don't know either the crap done 500 years ago or the good work that did not survive 500 years of time any more than we know what will be considered good work 500 years from now and what will be considered the crap of our time by those in the future. One thing is clear, if we do nothing now, there will be nothing to judge in the future. Only the most arrogant among us can pretend they know what future generations will cherish. After all, we can't (thank heaven) even agree among ourselves now on what is wheat and what is chaff. I am sure Van Gogh didn't have a clue in his life that any one of his paintings would sell for millions of dollars after his death.   \n The only danger is doing nothing. We should all design our brains out as we individually see fit.\n\n"
    },
    {
      "time": "26 May 2004 — 4:18pm",
      "content": "Gerald,   \n   \nYou really should read more carefully before you respond.   \nI said,   \n\"A FACE BY DWIGGINS OR GILL\"   \n   \nAs the subject is book faces, I had hoped Typophiles would assume I was referring to Caledonia or Perpetua, not Gill Sans!   \n   \n(Dwiggins and Gill are the type designers Kent Lew credits as influences for his Whitman face.)\n\n"
    },
    {
      "time": "26 May 2004 — 5:01pm",
      "content": "Right on, Tiffany.   \n   \nhhp\n\n"
    },
    {
      "time": "26 May 2004 — 6:21pm",
      "content": "Nick,   \n   \nThank's for the correction, you had me worried. Dwiggins is OK.\n\n"
    },
    {
      "time": "27 May 2004 — 7:36am",
      "content": "\\>How... profound.   \n   \nDitto.\n\n"
    },
    {
      "time": "27 May 2004 — 7:47am",
      "content": "You guys might be surprised how many people don't agree with that. Some people -especially highly religious types- might think that Order is the spice of life. Or they might think spice is over-rated. One man's soup is another man's Goudy Sans.   \n   \nhhp\n\n"
    },
    {
      "time": "27 May 2004 — 7:58am",
      "content": "The first great thing is to find yourself, and for that you need   \nsolitude and contemplation: at least sometimes. I tell you,   \ndeliverance will not come from the rushing, noisy centers of   \ncivilization. It will come from the lonely places.   \n   \nFridtjof Nansen\n\n"
    },
    {
      "time": "27 May 2004 — 8:00am",
      "content": "How can order ever be the spice of life?   \n   \nOh, I get it, black is white.   \n   \nHow... profound\n\n"
    },
    {
      "time": "27 May 2004 — 8:29am",
      "content": "\\> How can order ever be the spice of life?   \n   \nWho knows? And that's the point: we can't transfer feelings between us, and we can't even totally understand each other's feelings. If you want to get \"profound\", dump Modernism.   \n   \nhhp\n\n"
    },
    {
      "time": "27 May 2004 — 8:34am",
      "content": "\\>dump Modernism.   \n   \nAre you proposing Pre- or Post- ?   \n   \nWill that be long \"s\"s in the traditional style, or as part of a pixel font?\n\n"
    },
    {
      "time": "27 May 2004 — 9:14am",
      "content": "I greatly admire innovative work in type design, including Nick's, but I do not think his - your - view   \non this is quite right in the case of type.   \n   \nFor computers, better ones have made past ones more or less obsolete.   \nAs a general rule, there is no point in using the last generation of computers.   \n   \nWith type, I think the analogy is more to architecture than computers.   \n   \nI live in the Washington DC area, and two of the best monumental buildings in the area are the [Lincoln memorial](http://web.archive.org/web/20131108192539/http:/www.nps.gov/linc/) and [Dulles Airport](http://web.archive.org/web/20131108192539/http:/www.greatbuildings.com/buildings/Dulles_Airport.html).   \nThe Lincoln Memorial is more or less a copy of a Greek temple, with the fabulous statue of Lincoln in the middle.   \nDulles, designed by Eero Saarinan, is an icon of modern design, with its sweeping wing-like roof.   \n   \nWas it a mistake to copy an Greek temple in the late 19th century?   \nNo, because of the resonance with ancient ideals of democracy, and what Lincoln stood for in extending these ideals to all Americans.   \nAlso by simply doing a copy, they didn't mess it up, but got a fabulous result.   \n   \nSaarinen's design was very much of its time, but when it came to expanding it a few years ago, they just doubled the length, not changing anything.   \nIn fact this was the original design, and Saarinen had adjusted the design so that only half could be built first.   \n   \nWas it stupid to simply build a 60's design in 2000? I don't think so.   \nIt works beautifully.   \n   \nNow it would have been stupid in the '60s to build an airport as a Greek temple.   \nHaving a modern building was appropriate and worked well.   \n But expanding it in the 60s style - the only smart thing to do.   \n   \nI think these examples illustrate that what is appropriate in design and use in relation to history is a complicated matter,   \nand that newer is not necessarily better.   \nThere is a place for historical revivals, and they are sometimes better than the contemporary   \n- and sometimes not.   \n   \nI may be wrong but I detect in Nick's arguments some buying into Hegel's idea of the 'zeitgeist', the spirit of the times.   \nOf course, fashions are a reality, but what Hegel is claiming is that some are superior, the 'wave of the future',   \nand that everything that doesn't go along with the Zeitgeist is backward.   \nThe same type of thinking goes is in the somewhat different idea that there is an 'avant garde',   \nand everything else done is more or less stale and worthless.   \n   \nFashion is exciting in itself, and I have nothing against it.   \nBut most fashions go stale and a few turn out to be lasting.   \nBecause something is innovative doesn't mean it is necessarily good or most appropriate for every project and setting.   \nIn many cases old and good is better even than new and good.   \nAnd of course the other way around is also often true.   \n   \nA new design that is good is a greater personal achievement for the designer,   \nbut it is not necessarily better than an old design, even for contemporary works.   \n   \nI think new, excellent work that that done by some who post on this board, including Nick, is exciting and wonderful to have and use.   \nBut that doesn't mean that less innovative work is less useful or appropriate in many, if not most, contexts.\n\n"
    },
    {
      "time": "27 May 2004 — 9:22am",
      "content": "There was a little princess with a magic crown.   \n   \nAn evil warlock kidnapped her, locked ger in a   \ncell, i a huge tower and took away her sweet   \nvoice.   \n   \nThere was a window with bars. The princess kept   \nsmashing her head against the bars hoping that   \nsomeone would hear the sound and find her. The   \ncrown made the most beautiful sound that anyone   \never heard.   \n   \nYou could hear the ringing for miles. It was so   \nbeautiful, that people wanted to grab air. They   \nnever found the princess. She never got out of   \nthe room. But the sound she made filled   \neverything up with beauty.\n\n"
    },
    {
      "time": "27 May 2004 — 10:03am",
      "content": "William, my perspective is more Marx than Hegel.   \n   \nThe appearance and function of fonts are important -- they have to do the job -- but appearance and function are not absolutes, but culturally specific.   \n   \nI think it is important to express the zeitgeist, but not for reasons to do with historical time. Like Tiffany, I am neither for or against tradition or fashion. What concerns me is that people today should contribute to their culture in a meaningful way (hopefully paid as well).   \n   \nWhat I object to is that in many ways Helvetica, and the \"Adobe Original\" are our zeitgeist. The Adobe Original is, with perfect Newspeak, a revival. Now matter how \"good\" such a typeface is, it represents the way that trans national corporations have come to dominate the cultural landscape, restricting opportunity for content creators.   \n   \nHelvetica, Adobe Garamond, and Minion are good typefaces, but they would not occupy their present position of popularity had their free distribution not been part of a strategy used by companies whose primary business is to sell other, more lucrative products such as computers, operating systems, and major applications.   \n   \nOn the upside, there is a thriving, diverse industry in script fonts (with a growing prosumer market), and, to a lesser extent, pixel fonts (for Flash).\n\n"
    },
    {
      "time": "27 May 2004 — 10:27am",
      "content": "Nick,   \n   \n{...but culturally specific.}   \n   \nWould you argue that only Torontonians should buy your types?   \n   \nI might!\n\n"
    },
    {
      "time": "27 May 2004 — 11:06am",
      "content": "Nick   \n   \n_good typefaces, but they would not occupy their present position of popularity had their free distribution not been part of a strategy used by companies whose primary business is to sell other, more lucrative products such as computers, operating systems, and major applications._  \n   \nMost surprising objection. If you want to go along with the cultural and political temperature, go no further. Corporatism is\n\n"
    },
    {
      "time": "27 May 2004 — 11:52am",
      "content": "\\> The Adobe Original is, with perfect Newspeak, a revival.   \n   \nSome Adobe Originals are revivals, but they are in the minority. Or do you use some definition of revivals that includes typefaces such as Warnock, Nueva, Rad and Shuriken Boy?   \n   \n\\< [http://www.adobe.com/type/browser/c/c\\_adobe.jhtml](http://web.archive.org/web/20131108192539/http:/www.adobe.com/type/browser/c/c_adobe.jhtml)\\>\n\n"
    },
    {
      "time": "27 May 2004 — 11:57am",
      "content": "To me the main point about the Adobe Originals is that they're _not_ generally revivals. And among the entire Adobe collection of revivals, decoratives face and whatnot, the best single design is Jamra's Kinesis-MM, an AO.   \n   \nhhp\n\n"
    },
    {
      "time": "27 May 2004 — 12:16pm",
      "content": "Thanks Thomas, I should have qualified that.   \n   \nBTW that link doesn't work.   \n   \n\\>Some Adobe Originals are revivals   \n   \nGaramond, Caslon, Trajan (possibly).\n\n"
    },
    {
      "time": "27 May 2004 — 2:31pm",
      "content": "\\>dump Modernism. \\<   \n   \nHow about if we dump \"Eliminationism\" and adopt \"Inclusionism\" (pre and post) or would that be \"Confusionism\" (with apologies the the great Chinese phlosopher).   \nWhat I mean is we can have \"Nickism,\" Hrantism,\" Fredrikism,\" \"Thomasism,\" \"Geraldism,\" \"Tiffanyism,\" \"Alessandro,\" indeed \"Entire Typofilelistism\" and let the critics of the future sort out the Zeitgeist from the Poltergeist.   \n   \nDo what you do today for the love of doing it TODAY\n\n"
    },
    {
      "time": "27 May 2004 — 2:32pm",
      "content": "_BTW that link doesn't work._   \n   \nAdobe's got a thing with case-sensitivity, and I hope the webmasters there will change that.   \n   \nTry [http://www.adobe.com/type/browser/C/C\\_adobe.jhtml](http://web.archive.org/web/20131108192539/http:/www.adobe.com/type/browser/C/C_adobe.jhtml)\n\n"
    },
    {
      "time": "27 May 2004 — 2:36pm",
      "content": "Must be a UNIX server at Adobe\n\n"
    },
    {
      "time": "27 May 2004 — 2:37pm",
      "content": "_What I mean is we can have ... \"Hrantism\" ..._   \n   \nI thought that was Hranting and Hraving ![:-)](http://web.archive.org/web/20131108192539im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "27 May 2004 — 3:15pm",
      "content": "These issues go all over the map. Obviously there is need for \"good book faces\", old, or new. We have an abundance of the rest.   \n   \nStill the real question remains. What makes for good book design? Is it as Nick suggests, type decision, and type decision only. Otherwise he asks, \"why not use default grids?\"   \n   \n(not exact wording, to lazy to find the archives)   \n   \nClearly questionable logic. One (1) good book face is more important than quantity. The work of Aldus Manutius demonstrates not only one (1) good book face, and take further note, in one (1) point size only. Aldus Manutius is a name you should all know.   \n   \nA good book designer can certainly produce beautiful books with \"a single type face for their entire working career.\"   \n   \nI say to \"those that disbelieve\" that they know nothing of the history of book design. In fact, contrary to arguments type designers offer, just examine the plethora of typographical book design failures in spite of \"accidental good type face decisions\".   \n   \nType face choice is an important ingredient in book design, as is paper, paper size, colours, margins, illustrations, text page to sheet size ratios, point size, spacing, line length, table of contents, character count, binding etc. etc.   \n   \nEasily comparable to cooking. Without quality ingredients it is impossible to make the finest of foods. However, that said, \"a bad chef\" can not make a culinary masterpiece from the finest of ingredients.   \n   \nThe \"cook for the book\" is the designer, not the ink saleman, type salesman or the \"green grocer\".   \n   \nRemember what your mothers said, \"too many cooks spoil the broth\".   \n   \nType design is not the Eiffle Tower of typography. What is so badly needed in the type manufacturing industry is a broader appreciation and understanding of the industry at large. Navel gazing should be kept to a minimum.   \n   \nThe \"type designers and manufacturers of 90,000 digital fonts doe not dictate taste\".   \n   \n\"Good taste\" is a sophistication of refinements. Like it or not.\n\n"
    },
    {
      "time": "27 May 2004 — 5:00pm",
      "content": "Much of 50's/60's Modernism, particularly in among the Swiss and German designers, consisted of using one typeface. This was usually AG, Univers, or Helvetica and far from the English fine book tradition\n\n"
    },
    {
      "time": "27 May 2004 — 5:04pm",
      "content": "Good taste is in the palate of the beholder\n\n"
    },
    {
      "time": "27 May 2004 — 5:19pm",
      "content": "Chris,   \n   \n_My foundation in typography in the early 60s_   \n   \nIs it rude to ask your age?\n\n"
    },
    {
      "time": "27 May 2004 — 5:40pm",
      "content": "_Good taste is in the palate of the beholder_   \n   \nIf you ever have kids you will find they think very ugly smelling things taste real good. Keep them away from your bait bucket. Yuck.   \n   \nFound that out the hard way.\n\n"
    },
    {
      "time": "27 May 2004 — 6:58pm",
      "content": "I am 60 years old.   \nBoth of my kids were very picky eaters but my 20 year old daughter now loves sushi\n\n"
    },
    {
      "time": "27 May 2004 — 8:14pm",
      "content": "Chris,   \n   \n_White space was revered at least as much as the type._   \n   \nThis is where I was headed when I quoted Hrant. Remember his observations about margins. Hrant read me wrong. He read my compliment as an insult.   \n   \nIf you see him, say I am sorry.\n\n"
    },
    {
      "time": "28 May 2004 — 8:35am",
      "content": "IMO, it's not the typeface, it's the designer who causes mischief. For every well designed book that makes the AIGA, there are scores of difficult to read solutions being OK'd by editors and publishers who should know better. If I may do so without sounding contentious, I would take exception to the comment above concerning typefaces in use in CH and D in the 50s and 60s. I was there, and I assure you that the Swiss, all over their well-ordered country, set plenty of Times New Roman better than we were doing in the USA. Ditto for Baskerville, Bodoni, Clarendon, and the lovely Diethelm, which we did not have. The output of even the smallest regional newspaper and job shop was far superior to our larger shops. Furthermore, they did it all with a dozen or so faces compared to our hundreds, most of which were just as mindless in metal as the digital of today. FWIW\n\n"
    },
    {
      "time": "28 May 2004 — 2:23pm",
      "content": "Gerald,   \nI can't speak for Hrant and I am sure he doesn't need my help speaking for himself :-)   \nThere is a small chance that he logs on to this forum on a few rare occasions and just might see your apology ;-)   \n   \nChris\n\n"
    },
    {
      "time": "28 May 2004 — 2:31pm",
      "content": "No apology needed - I could tell that one wasn't an insult.   \nI'm avoiding Gerald because I think religious debate is generally wasteful.   \n   \nhhp\n\n"
    },
    {
      "time": "28 May 2004 — 2:45pm",
      "content": "Paul,   \nI believe what I said was, \"Much of 50's/60's Modernism, particularly in among the Swiss and German designers. . . \"   \nTo me that means only the designers who are counted with the modernists and only \"much of\" them, not all of them. Also, I said \"among\" not every single Helvet or Deutsch citizen. In America during that period (corporate design mostly), plenty of \"Standard,\" Helvetica, and Univers was set as well but less of it as a percentage per printed piece than in CH (mostly in the German speaking Cantons).   \n Quality Typography and impeccable craftsmanship are legendary Swiss traits whatever the face of choice.   \n   \nChrisL\n\n"
    },
    {
      "time": "28 May 2004 — 10:38pm",
      "content": "Gerald: one typeface and your cooking analogy --   \n   \nLooks like Spam is on the menu!\n\n"
    },
    {
      "time": "29 May 2004 — 6:02am",
      "content": "Chris -- No, that's not what I was responding to. You said \\>\\> Nevertheless, it was a monofontistic society as well.\\<\\< and I was trying to deal with that.\n\n"
    },
    {
      "time": "29 May 2004 — 12:38pm",
      "content": "Nick,   \n  \nRead much? Most books are set in one (1) single typeface. Are you recommending otherwise?   \n   \nGerald\n\n"
    },
    {
      "time": "26 May 2004 — 4:35pm",
      "content": "I don't want the type designers of today to stop, nor do I want to be held accountable for using type designs from the past. I agree with the comment just made by Chris.   \n   \n_But, true, there aren't that many typefaces of worth being designed these days._   \n   \nThis might well be true, but don't you think this is your own subjective opinion?   \n   \nPeople! Variety is the spice of life.\n\n"
    },
    {
      "time": "27 May 2004 — 11:12am",
      "content": "Hmm. You know very well that I wasn't being profound. And yet you had to go for the easy smart remark. Oh well. I was simply trying to point out that I was thankful for the variety, new and old. It would be financially impossible to license all of the type to which I really would like to have access. I would hope that type designers today would want to improve or at least work toward an ideal improvement of their own thinking. Why design type if you aren't trying to improve? But, I don't think that you should throw out the old simply because there is new.   \n   \n_Because something is innovative doesn't mean it is necessarily good or most appropriate for every project and setting.   \nIn many cases old and good is better even than new and good.   \nAnd of course the other way around is also often true._     \n   \nAmen. It isn't cut and dried, nor is it black and white.\n\n"
    }
  ]
}
