{
  "id": "49051",
  "title": "Marquam",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Here is the latest version of the irregular sans serif that I'm working on.\n\n| Attachment | Size |\n| --- | --- |\n| [marquam-2-24-09.pdf](http://web.archive.org/web/20150415073634/http:/typophile.com/files/marquam-2-24-09.pdf) | 339.01 KB |\n| [3-14-09-Marquam.pdf](http://web.archive.org/web/20150415073634/http:/typophile.com/files/3-14-09-Marquam.pdf) | 38.59 KB |\n\n",
  "author": "EricFromPTown",
  "time": "3 Sep 2008 — 2:14pm",
  "uid": "21313",
  "comments": [
    {
      "time": "15 Sep 2008 — 10:56am",
      "content": "One Week, Four days, no replies...is this common of Typophile posts?\n\n-Eric MacLeod\n\n"
    },
    {
      "time": "18 Sep 2008 — 8:18am",
      "content": "I haven't printed it to judge accurately, but it looks to me like your straight verticals appear stronger than the thicks of your rounds, esp. in lowercase.\n\nI would consider:  \n- rethinking the g completely  \n- evening the counters on the a more  \n- widening the V  \n- narrowing the r  \n- altering the curve of the J - looks like it will tip over  \n- smoothing the bend in e's tail  \n- alternate ways of making the Q's tail\n\nThough the top of it may be too wide, there's something I really like about the s.\n\n"
    },
    {
      "time": "26 Sep 2008 — 11:44am",
      "content": "Thank you, Eliason, for your comments. I have taken note and made changes accordingly.\n\nConcerning the \"g\" though, I rethought the g when I began this project so re-rethinking the g seems a bit overkill. I'm still working on a lot of the changes, but here is a text sample of the lighter verticals.\n\n-Eric MacLeod\n\n ![](http://web.archive.org/web/20150415073634im_/http:/typophile.com/files/freewaysmerge2_5372.png)\n\n"
    },
    {
      "time": "27 Sep 2008 — 7:31am",
      "content": "It looks much better already.  \nConsider shortening the ascender of t.\n\n"
    },
    {
      "time": "6 Jan 2009 — 3:43pm",
      "content": "This has been on the backburner for a while, but the numerals are new and changes have been made on many letters, including the g. Any feedback before I start on an italic companion would be great.\n\n ![](http://web.archive.org/web/20150415073634im_/http:/typophile.com/files/1-3-09_6035.jpg)\n  \n\n ![](http://web.archive.org/web/20150415073634im_/http:/typophile.com/files/waste-time_3628.jpg)\n\n"
    },
    {
      "time": "10 Jan 2009 — 1:10am",
      "content": "the g has gotta go\n\n:-)\n\n"
    },
    {
      "time": "10 Jan 2009 — 5:52am",
      "content": "I liked the g... before it was changed.\n\n"
    },
    {
      "time": "10 Jan 2009 — 7:24am",
      "content": "The g is horrible:) How about rewinding your rethinking?\n\n"
    },
    {
      "time": "14 Jan 2009 — 4:16pm",
      "content": "Yeah, the three of you are right about the 'g'. I think the counters need to be balanced...I tried too hard to make g relate directly to d,p,b,q. Here's a last attempt with g relating closer to the counters of a. Thanks for the honesty. If this doesn't work I'll have to abandon the 3-story g for the generic g also seen here.\n\n ![](http://web.archive.org/web/20150415073634im_/http:/typophile.com/files/marquam_6083.jpg)\n\n-Eric MacLeod\n\nP.S. Please forgive the poor quality of this sketch. I am away from a computer with a drawing program.\n\n"
    },
    {
      "time": "24 Feb 2009 — 7:04pm",
      "content": "Here is the newest version of Marquam (Please see revised pdf in first post). The new I have trimmed down some curvy, quirkiness to make the font more serious.\n\nThere are too many changes to showcase individually in images, but I can mention them. Looking back at previous versions of this is kind of embarassing now, but:\n\n• 'a' has lost the wavy terminal  \n • 'g' has balanced counters and a smaller top-story  \n • unnecessary notches have been filled in in capitals  \n • 'S,s' have more balanced counters  \n • '6,9' have terminals closer to the '4', then to '2,3,5'  \n • more even outer-curves on 'u,n,h'  \n • flat crossbar on 'e'\n\nI have also added an italic companion. Any feedback on the changes would be greatly appreciated.\n\nThanks,  \n-Eric MacLeod\n\n ![](http://web.archive.org/web/20150415073634im_/http:/typophile.com/files/marquam-2-24-09_5102.gif)\n\n"
    },
    {
      "time": "24 Feb 2009 — 7:56pm",
      "content": "It's now much stronger. The weak point is still the g. The top part needs to be less lopsided. (And there's some funky overstrike going on right now.) Maybe an ear, too.\n\nI'm not entirely sure the difference in the way the curves join n and u, for example, works. I'd rather see the n-join carried over to the u. (I realize you've consistently thinned the lower joins, but I think they look too thin.)\n\nAlso, the second join on the m needs some love, the y is a tad heavy where the tail joins, and the top of the s is too flat.\n\nOverall, I like where this is going. Keep at it!\n\n"
    },
    {
      "time": "9 Mar 2009 — 10:25am",
      "content": "The tail of the Q is a bit off center on italic and roman. The g (double storey) on your sketch is better than the first one you've drawn, but not a good one yet. I prefer the one storey so far. I think there is too much curve in it, also the little point on bottom left side of the top of the counterform doesn't help it. I think some oblique line A, M,N and some bowl are too thick especially where the stem meet the oblique. The bowl of the P and the R on the italic version are too little especially the P. The top of the 6 and the tail of the 9 should be like the 2 and 3. Keep going.\n\n"
    },
    {
      "time": "11 Mar 2009 — 2:51pm",
      "content": "Thanks for the comments speter and sim. I'm reworking the 'g' again adding a tail to it. Update images and pdf's soon to come.\n\n@speter\n\nI recognize that the lower joins look too thin to fit the entire font...one thing that I am toying with right now to remedy the situation is trying open-joins on P, B, and R, to make the thin lower joins more acceptable.\n\n@sim\n\nI recognize that the 'little point' in the two-story 'g' does not follow the continuity of the other notched points in the font; 'g' has a notched joint at a bowl joining another curved stroke. I would like to keep it because I am looking to create a continuity in the counter forms and g's top counter is close to a's lower counter in proportion and scale. If there is consensus among everyone that looks at that the multiple story 'g' cannot work in this way, then I will abandon it and go with the much simpler 'g'\n\nSide Note: I thought that the circle + hooked tail 'g' was '3-story' as it has 3 distinct counter forms.\n\n-Eric MacLeod\n\n"
    },
    {
      "time": "12 Mar 2009 — 3:15pm",
      "content": " ![](http://web.archive.org/web/20150415073634im_/http:/typophile.com/files/3-12-09-Marquam_6073.jpg)\n\n"
    },
    {
      "time": "12 Mar 2009 — 5:18pm",
      "content": "I still don't understand what's going on in the upper bowl of the g, and the join on the K catches the eye way too much. On the R, how would a straight leg look? I think a slightly narrower a would be better.\n\nKeep on going! This is looking nice.\n\n"
    },
    {
      "time": "20 May 2009 — 10:33am",
      "content": "Here is the latest version of it. I am putting this on my [typophile blog](http://web.archive.org/web/20150415073634/http:/typophile.com/node/57755) instead of continuing this thread. I am working on interpolating weights by hand, since I do not have Fontlab, and therefore do not have the Python nudge-scripts. I am going to make the kerning mostly consistent throughout the family so that blacks appear tighter and lights appear whiter.\n\n ![](http://web.archive.org/web/20150415073634im_/http:/typophile.com/files/MarquamBold5-16_4459.jpg)\n\n-Eric MacLeod\n\n"
    }
  ]
}
