{
  "id": "49082",
  "title": "Google Chrome",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Anyone else loving Google Chrome or is it just me?\n\n [‹ Better calligraphy/handwrite](http://web.archive.org/web/20081201175124/http:/www.typophile.com/node/49171 \"Go to previous forum topic\") [Are there differences between Nimbus sans and Helvetica? ›](http://web.archive.org/web/20081201175124/http:/www.typophile.com/node/49127 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201175124/http://www.typophile.com/user/8008\" title=\"View user profile.\">Nick Job</a>",
  "time": "<br>",
  "uid": "8008",
  "comments": [
    {
      "time": " 4.Sep.2008 6.39am",
      "content": "(Sorry if you’re on a Mac.)\n\n"
    },
    {
      "time": " 4.Sep.2008 6.50am",
      "content": "Finally something that does not get in your way! But I have discovered one thing I don’t like about it: it does not let me click the scroll wheel and then go up or down the page by just moving the mouse (if that makes sense).\n\n"
    },
    {
      "time": " 4.Sep.2008 7.06am",
      "content": "You’re right, it doesn’t. They’re sure to iron that out though.\n\n"
    },
    {
      "time": " 4.Sep.2008 8.18am",
      "content": "Where are the AD BLOCKING features?\n\n"
    },
    {
      "time": " 4.Sep.2008 9.06am",
      "content": "“Where are the AD BLOCKING features?”\n\n;o)\n\n"
    },
    {
      "time": " 4.Sep.2008 12.25pm",
      "content": "I switched after 1 hour of using it. Uninstalled Firefox. A few glitches here and there but it’s worth it.\n\n"
    },
    {
      "time": " 4.Sep.2008 1.59pm",
      "content": "So no one minds the [EULA](http://web.archive.org/web/20081201175124/http:/arstechnica.com/news.ars/post/20080903-google-on-chrome-eula-controversy-our-bad-well-change-it.html)?\n\n"
    },
    {
      "time": " 4.Sep.2008 2.13pm",
      "content": "They’ve already backed down on [Section 11](http://web.archive.org/web/20081201175124/http:/go.fark.com/cgi/fark/go.pl?i=3847716&l=http://www.pcmag.com/article2/0,2817,2329414,00.asp) of the EULA.\n\n"
    },
    {
      "time": " 4.Sep.2008 4.19pm",
      "content": "Ah good. That is the bit that really had me wondering. I will probably try it once it is available for the mac, but more than likely I’ll stick with Safari. The design is a little elementary for my taste.\n\n"
    },
    {
      "time": " 4.Sep.2008 5.22pm",
      "content": "so far the only think i miss in it vs. Firefox is the spell check. Google seems to identify mis-spellings, but doesn’t give you options to fix it. Firefox lets you right click the mis-spelled word, and select from most likely options.\n\nJason c\n\n"
    },
    {
      "time": " 4.Sep.2008 5.33pm",
      "content": "I like overriding default fonts and you can’t really do that well in Google Chrome. Currently, I’m running pages in FF with Cambria and I love it!\n\nI’ve come to the conclusion that Chrome is really a stripped down version of FF. But really until they add ad blocking, I’m not jumping onboard. Plus, I really love FF, there are so many great things and I only expect more from it in the future.\n\n"
    },
    {
      "time": " 5.Sep.2008 12.24am",
      "content": "Yepp. I’m using Chrome right now. It runs rings around Firefox and IE, both of which will probably slip into decline as a result. Haven’t really read the EULA yet. I switched strate from IE to Chrome. Never bothered with Firefox because it never offered a significant enuff advantage over IE to make it worthwhile. Both IE and Firefox have major shortcomings.\n\nAnybody want to post a comparison of Chrome to Safari and Opera?\n\nj a m e s\n\n"
    },
    {
      "time": " 5.Sep.2008 12.25am",
      "content": "@Darrel: _Where are the AD BLOCKING features?_  \nWhat ads? I’m not getting any ads in Chrome.\n\nj a m e s\n\n"
    },
    {
      "time": " 5.Sep.2008 7.32am",
      "content": "“I’ve come to the conclusion that Chrome is really a stripped down version of FF.”\n\nWell, it’s based on WebKit, so it’s more related to Safari than Firefox.\n\nGoogle has been (and will continue to be) a major financier of Firefox, so it’s an odd decision on their part. The theory that makes the most sense to me is that Google Apps depends heavily on JavaScript and the current crop of browsers just suck at that, so they thought the easiest solution would be to just write their own browser.\n\nChrome, for the most part, is Google’s Operating system for Google applications. If you are an avid user of Gmail, Google docs, Google sites, Google calendar, Google reader, Google etc, then Chrome is the browser for you.\n\nIf not, there’s probably not a really strong reason to bother with it at this point.\n\n“It runs rings around Firefox and IE, both of which will probably slip into decline as a result.”\n\nIt’ll probably chip away at Firefox’s share, but probably won’t have much effect on IE. Anyone that uses IE isn’t the kind of user that’s even aware that the web browser is actually a piece of software that they can choose alternative for.\n\n“What ads? I’m not getting any ads in Chrome.”\n\nThat wasn’t me that mentioned the ads. I just thought it was a funny comment (google makes money via web ads).\n\n"
    },
    {
      "time": " 5.Sep.2008 7.46am",
      "content": "James, I asked “where are the ad blocking features”. And I’m still asking. Google Chrome has a lot of nice features, but I’ve gotten pretty a accustom to FF and I don’t see me switching to Chrome right out of the gate. There are bound to be missing features and bugs and I’m anticipating that. So, I’ll just wait and see what happens next.\n\n"
    },
    {
      "time": " 5.Sep.2008 7.52am",
      "content": "it seems chrome combines the good features from ff and ie, i haven’t found the bad yet, but will be sure to post back once i find them.\n\n"
    },
    {
      "time": " 5.Sep.2008 8.00am",
      "content": "I tried Chrome and it feels nice but, as others remarked, where is the ad blocker?  \nI don’t mind static ads but I simply can’t stand it when anything moves while I am reading the news or so.  \nSo, no flash blocker, no Chrome for me. Unfortunately. I will give it another try as soon as there is a flash blocker available.  \nAlso, as [this article](http://web.archive.org/web/20081201175124/http:/news.yahoo.com/s/ap/20080904/ap_on_hi_te/tec_tech_test_google_chrome) points out, flash often uses more resources that you could ever save with Chrome.\n\n"
    },
    {
      "time": " 5.Sep.2008 8.32am",
      "content": "Asvetic, Darrel, sorry, my goof.\n\n@Darrel: _Anyone that uses IE isn’t the kind of user that’s even aware that the web browser is actually a piece of software that they can choose alternative for._\n\nI’ve been an IE user from the very beginning of the popular internet, and I’ve been trrying all kinds of browsers ever since, yet I always went back to IE because it works well enuff.\n\nTim, guys, peeples, Chrome doesn’t have an ad blocker because it doesn’t need one. The ad blocking is built into the thing, which is why you don’t have an option to turn ad blocking on or off. Ads are blocked permanently. I’m not getting any ads where I don’t want them in Chrome. The proof is in the pudding. Don’t assume Google are going to the use the same software and interface model as IE, Firefox and all the others, because Google are well-known for their intuitive approach to software and application design.\n\nI mean, I’m a gmail user, and I wouldn’t even consider going back to any other kind of email client, especially not a stand-alone desktop-based proggie like Outlook and its ilk, because gmail is so intuitive and simply anticipates what people need it to do automatically. compared to gmail, I would describe Outlook as a hopeless, outmoded, time-wasting, unintuitve, stupid, badly-constructed, over-complicated piece of junk.\n\nj a m e s\n\n"
    },
    {
      "time": " 5.Sep.2008 8.37am",
      "content": "James,  \nDon’t hold back. Tell us how you really feel about Outlook.\n\n(I use Thunderbird, myself)\n\n"
    },
    {
      "time": " 5.Sep.2008 8.44am",
      "content": "I’m not alone in thinking Chrome is missing a few features:\n\n[http://news.cnet.com/8301-17939\\_109-10033296-2.html](http://web.archive.org/web/20081201175124/http:/news.cnet.com/8301-17939_109-10033296-2.html \"http://news.cnet.com/8301-17939\\_109-10033296-2.html\")\n\n"
    },
    {
      "time": " 5.Sep.2008 10.10am",
      "content": "“And I’m still asking.”\n\nOh! Sorry, I thought you were joking.\n\nIf they add it, it’d be interesting, but given that Google’s primary income comes from web ads, I find it hard to believe they will put too much effort into allowing you to block them using their own browser. ;o)\n\nThat said, Chrome is open source, so give it a week and I’m sure someone will have a solution.\n\n“I’ve been an IE user from the very beginning of the popular internet, and I’ve been trrying all kinds of browsers ever since, yet I always went back to IE because it works well enuff.”\n\nSure. That’s kind of my point. Anyone that’s fine using IE probably has no incentive to bother using anything else.\n\n"
    },
    {
      "time": " 5.Sep.2008 10.24am",
      "content": "Nope, not joking. I’d say I’m a proponent for free internet. It’s becoming a life blood for so many organizations and communities (ahem, Typophiles), that to not have internet access is almost a crime.\n\nBut, I don’t have free internet. I have to pay for it, like most other people. However, I’m also subjected to a constant stream of advertisements... I feel the same with television. You have to pay for the service (if you have anything more than an antenna, which will eventually be gone soon too) and yet you’re forced to watch commercials ad nauseam.\n\nSo, I would prefer to have a program that can atleast filter out a large chunk of that noise and leave the more important features available.\n\nThere are many arguments for and against, and I’m aware of that. It’s just, I’d prefer to have a choice in the matter. Right now, Google isn’t giving me that choice.\n\nThey might be open source, but until they allow plug-ins/add-ons that support my choices, I’m not jumping on board.\n\nI prefer FF over IE because it’s a forward moving application. They’re trying to be open to all features of the web. IE makes small waves, but it’s still a locked-tight box with little expandability. It all comes down to choices. Some people like the freedom of choice, some don’t care, and some just want things to be as simplistic as possible.\n\n"
    },
    {
      "time": " 5.Sep.2008 11.38am",
      "content": "I completely understand what you’re saying, Asvetic. I’m just pointing out the irony of Google developing a browser with built in web advertising blocking, as their primary source of income to pay for things like developing a browser comes from web advertising.\n\nFTR, I’m completely on your side in regards to open/free/community internet. I’m very tired of paying the cableco/telco monopolies for the ’honor’ of their incredibly crappy customer service and crazy pricing.\n\n"
    },
    {
      "time": " 5.Sep.2008 11.58am",
      "content": "Spellchecker (working in both English and Russian), DownThemAll and Web Developer plugins. Once chrome has these, I’ll consider switching. For now, I’ll stick to Firefox.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20081201175124/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 5.Sep.2008 12.54pm",
      "content": "Hmmm, so Chrome may have a built-in ad blocker, but does it also block Flash ads?  \nTo me, that is exactly the crucial point.\n\n"
    },
    {
      "time": " 5.Sep.2008 2.37pm",
      "content": "Trust Tiffany to go straight for the EULA - - that was a brilliant find! It’s a very significant moment - - that Google is capable of even getting near such an atrocious EULA means the idealistic days are over — really, truly, over. We could be watching the birth of a new MS, and it will require constant user-policing to make sure this doesn’t happen anytime soon.\n\nThe great thing about Chrome — and about IE 8 — is that they try to keep each tab or window an entirely separate process — this is really big news because it means that — unlike any other browser — a single errant tab won’t take the entire browser down.\n\nSo far, Chrome is implementing this concept more rigidly and more thoroughly (and more effectively) than Microsoft.\n\nThe downside in both cases is huge memory footprints and startlingly high thread counts. You’ll need twice as much memory for either as you did for previous generations of browsers. If you have the memory and processor power, Chrome has by far the most persuasive architecture of all the browsers.\n\n1/3 gig to run 10 tabs. What about 20? 30? All of a sudden, 4GB of memory is beginning to look like 4MB of memory. I’ve never understood why a browser takes up so much memory — what is it but a hypertext interpreter after all? Yet the programmers at both MS and Google seem to have the same message: to advance the architecture means having even _more_ memory.\n\nSo how will Mozilla react?\n\n"
    },
    {
      "time": " 5.Sep.2008 11.13pm",
      "content": "I’ve been using Chrome as my primary browser since Tuesday now.\n\nPlus: Blazingly fast. Very stable. Each tab is a process. Minimal “chrome” to clutter the UI (making the name rather ironic).\n\nMinus: Not being able to override fonts in web pages. Imported bookmarks end up in a \\*sub-menu\\* of the bookmarks, with no apparent practical way to move them all out to the main level.\n\nOverall: Thumbs up, but with significant reservations. But still about the most impressive pre-1.0 “beta” app I’ve used.\n\nT\n\n"
    },
    {
      "time": " 5.Sep.2008 11.26pm",
      "content": "<cite>Not being able to override fonts in web pages.</cite>\n\nI noticed that too.\n\nIn FF I run everything in Cambria now. Love IT!\n\n"
    },
    {
      "time": " 6.Sep.2008 12.28pm",
      "content": "for me, as I am not using googles web-apps heavily, chrome is a very impressive but stripped down browser (or should we say operating environment?), resulting in a stripped down web experience for me. I can’t influence how web content is presented to me (filtering, re-styling, adding additional information, ...), which is a killer feature of firefox to me.\n\nIf  \n... there were more preferences to set  \n... there was an addon system  \n... it was not google watching every step you take with UIDs, cookies etc.  \n(... it adjusted it’s look to the native UI of the operating system running on)  \n(... googleupdate.exe phoning home 2x/h, whether chrome is running or not)  \nit would be my favourite browser. Too many ifs at the moment.\n\n"
    },
    {
      "time": " 6.Sep.2008 12.56pm",
      "content": "<cite>... [If] it was not google watching every step you take with UIDs, cookies etc.</cite>\n\nThere was a big outcry when MS was accused of doing this. They backed down, and I’ve never heard it mentioned again — until now!\n\n(What’s the current status of their user profile mining?)\n\n"
    },
    {
      "time": " 6.Sep.2008 1.16pm",
      "content": "I have every major browser on my Toshiba Satellite A215 laptop, running Vista Home Premium.\n\nI prefer Firefox 3 for most things, but Safari for Windows is by FAR the most stable. Chrome is okay, but I haven’t used it that much because I am so big on FF3 and Safari Win.\n\nI keep IE7 around for my boyfriend to use and for watching movies on Netflix.\n\nI also have Browzar, the free “private” browser, which in itself is pretty good.\n\nI just don’t see the need for Google to come up with a new browser, except for the fact that they seem to be creating more and more stuff that would be a vital part of their own OS.\n\n- Gmail  \n - Blogger  \n - Documents  \n - Calendar  \n - Desktop  \n - Chrome\n\nMy suspicion is that they are amping up their products to be a new free OS on par with Linux. They probably are cultivating these new applications and generating all this buzz to lure people from other systems. I already use two different Gmail accounts, write in documents, etc.\n\nI would wager that within five years Google will have a new OS and make it big with users turned off by the people turned off by the exclusivity of MS and Mac and target a new cult of tech-savvy youth and millennials. I wouldn’t even be surprised if they started manufacturing manufacturing their own devices.\n\n"
    },
    {
      "time": " 6.Sep.2008 2.29pm",
      "content": "“I just don’t see the need for Google to come up with a new browser”\n\nThey’ve pretty much said why: all current browsers have really crappy memory handling when it comes to JavaScript execution.\n\nBut you are correct, this is pretty much the Google OS that has been rumored from what I can tell.\n\nSome think it might become an actual full-fledged OS as you state. I’m not convinced yet, but things like their Cell Phone ’OS’ Android is a convinced argument for it...\n\n"
    },
    {
      "time": " 7.Sep.2008 2.00pm",
      "content": "After Google eased up on the eula, I reinstalled Chrome. I had the same problem as Thomas as far as bookmarks on my laptop, but they were imported from Firefox correctly on my desktop. So I installed Firefox 3 on my laptop, reinstalled Chrome and my bookmarks imported properly - showing correctly in the bookmarks toolbar.\n\nSharon\n\n"
    },
    {
      "time": " 8.Sep.2008 4.15am",
      "content": ".........................................................  \n [Bison Design](http://web.archive.org/web/20081201175124/http:/www.bisondesign.no/)  \n [Spön](http://web.archive.org/web/20081201175124/http:/www.myspace.com/sponnorway)\n\n"
    },
    {
      "time": " 8.Sep.2008 7.45am",
      "content": "I’d have to say i love Chrome. I switched after I read the online comic they offered. It was a great way to really understand what makes Chrome an actual contender in the browser world. You can find the Chrome Comic here:\n\n[http://www.google.com/googlebooks/chrome/](http://web.archive.org/web/20081201175124/http:/www.google.com/googlebooks/chrome/ \"http://www.google.com/googlebooks/chrome/\")\n\n@oprion\n\n“Spellchecker (working in both English and Russian), DownThemAll and Web Developer plugins. Once chrome has these, I’ll consider switching. For now, I’ll stick to Firefox.”\n\nChrome actually does have spell checker built in as well. :)\n\n"
    },
    {
      "time": " 8.Sep.2008 8.11am",
      "content": "I’ll hold off until it checks facts as well.\n\n"
    },
    {
      "time": " 8.Sep.2008 2.34pm",
      "content": "Ah Google... I think this may be the turn for the worse in your scheme to rule the world or at least the internet... jk.\n\nI won’t be using Chrome after reading this...  \n [http://www.tgdaily.com/content/view/39176/108/](http://web.archive.org/web/20081201175124/http:/www.tgdaily.com/content/view/39176/108/ \"http://www.tgdaily.com/content/view/39176/108/\")\n\n"
    },
    {
      "time": " 8.Sep.2008 10.14pm",
      "content": "My computer is full of all sorts of sensitive information, and my hard drive is encrypted and protected in multiple ways. As long as Google Chrome’s indexing is on my local hard drive, I have no problem with it.\n\nT\n\n"
    },
    {
      "time": " 9.Sep.2008 7.27am",
      "content": "dali:\n\n“the browser was indexing information from HTTPS sites”\n\nHTTPS would be a network transfer protocol, while the browser cache would be a local computer behavior.\n\nThat article seems to be describing the functionality of the local browser cache and spinning it as a security hole.\n\nGranted, having data like this in the local cache is certainly an issue, but not really something that is unique to Chrome.\n\n"
    },
    {
      "time": " 9.Sep.2008 8.51am",
      "content": "interesting article on the chrome logo\n\n[http://www.labnol.org/internet/google-chrome-logo-design-inspiration/441...](http://web.archive.org/web/20081201175124/http:/www.labnol.org/internet/google-chrome-logo-design-inspiration/4414/#Scene_1 \"http://www.labnol.org/internet/google-chrome-logo-design-inspiration/4414/#Scene\\_1\")\n\n"
    }
  ]
}
