{
  "id": "49085",
  "title": "Why are there so few mathematical fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This is my first post on this forum so it is polite to introduce my self i have 21 years and come from Serbia.Ok my question in subject refers that there are only 3 fonts for serious mathematical work:Computer Modern,Euler,and that new Microsoft font.Why is that,is it because most of the people don't care about math so there isn't demand on market or what.\n\n",
  "author": "zaza",
  "time": "4 Sep 2008 — 7:23am",
  "uid": "36303",
  "comments": [
    {
      "time": "4 Sep 2008 — 7:36am",
      "content": "Simply because Math is not Fonty.\n\n"
    },
    {
      "time": "4 Sep 2008 — 7:43am",
      "content": "I would say lack of documentation for me. I would love to make a math font (my dad's a math prof) but I'm sure there are special metrics outside of the kerning and substitution tables that I really don't have a clue how to set up. If anyone has information on how to do it I'd love to know!\n\nBut, as you note, there just really isn't a demand for it. The original one was intended as a be-all end-all font of sorts, and its served its function so well there just hasn't been demand to change it.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "4 Sep 2008 — 8:09am",
      "content": "If anyone is interested in making a font like Cambria Math that works with the new Office math engine please drop me a line. We held a Math font workshop at TypeCon last year and have shared specs with interested parties.\n\n"
    },
    {
      "time": "4 Sep 2008 — 8:28am",
      "content": "Sii,\n\nWhat's the difference between making a math font for \\*\\*TeX and Office? I know the math department at my university uses LaTeX exclusively.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "4 Sep 2008 — 8:28am",
      "content": "Is [Old Standard](http://web.archive.org/web/20120720140608/http:/www.thessalonica.org.ru/en/fonts.html) \"serious\" enough?\n\n"
    },
    {
      "time": "4 Sep 2008 — 8:42am",
      "content": "Math Font Group homepage:\n\n[http://www.tug.org/twg/mfg/](http://web.archive.org/web/20120720140608/http:/www.tug.org/twg/mfg/ \"http://www.tug.org/twg/mfg/\")\n\n"
    },
    {
      "time": "4 Sep 2008 — 8:55am",
      "content": "Cambria Math is an OpenType font with at least one additional table. Can send you the details if you want to contact me via simonda@\n\n"
    },
    {
      "time": "4 Sep 2008 — 4:37pm",
      "content": "WELCOME TO TYPOPHILE ZAZA! enjoy your stay, we're friendly here :-)\n\n"
    },
    {
      "time": "7 Sep 2008 — 4:37am",
      "content": "Out of topic, but ...  \nhow are the Integration + Multiplication + other Math Symbols?!  \nWith Flowers of Course\n\n ![](http://web.archive.org/web/20120720140608im_/http:/typophile.com/files/intrvw_tahany5_6117.jpg)\n\n"
    },
    {
      "time": "9 Sep 2008 — 9:25am",
      "content": "Hi all,  \nI am currently attempting to construct a book of equations expressed typographically as well as mathematically and have been wondering about this.  \nWhy is it that only those three / four fonts are considered maths friendly?\n\n"
    },
    {
      "time": "9 Sep 2008 — 10:15am",
      "content": "Well the original one was designed to be a be-all-end-all font, and it's hard to find any fault in its designed from a math user's perspective. All characters are easily recognizable without context from other letters, all the necessary variations, sizing concerns etc. But it was also done after lots of research into previous font designs. Donald Knuth, the author of the font, has an excellent write up on his design process in (_Computers and Typsetting_, vol. E). I read it years ago and so have forgotten most of the details, but needless to say, he created a more or less definitive standard for design.\n\nAnd along those lines, because it is so well made and, let's be honest, a niche market, people aren't looking for variety. When scientists can't be bothered to hire illustrators and designers to do their figures and instead leave it to Excel, do we really think they're going to go the distance and buy new fonts? Because of that, and the large amount of work involved in creating and testing a font, it's just not something most people want to put the work into. It falls much into the lines of what Thomas Phinney has been talking about with the new Adobe Latin charset.\n\nRemember, a math font needs to have regular, italic, bold, struck, and fraktur and combinations therewithin. Also it needs some Hebrew and very carefully designed combining diacritics and a full set of sub/superscript variants and even better to have double-script variants. And there is now the OpenType method of defining metrics as used by Word (which honestly seems like the more logical approach, I know, surprising that Word would take a logical approach to something) and the method I sitll need to look into for \\*\\*TeX.\n\nAll in all it's a lot of work for a small market. The only reason I'm doing it is because of my dad and I figure I can convince his department to use it (mathematicians can be surprisingly well convinced on things like this).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "10 Sep 2008 — 6:16am",
      "content": "<cite>it’s hard to find any fault in its designed from a math user’s perspective</cite>\n\nYes, but from a type design point of view, many of the glyphs are a bit faulty (most lack any sort of optical correction). This is where you see the main difference between a font done by a mathematician and a font done by a real type designer (compare Computer Modern and Cambria for example).\n\n<cite>people aren’t looking for variety</cite>\n\nWhile most mathematicians don't care which font they use, in the last few years quite a few math fonts have been developed (see the [Free Math Font Survey](http://web.archive.org/web/20120720140608/http:/ctan.tug.org/tex-archive/info/Free_Math_Font_Survey/survey.html) for an overview of the free ones) so those who do want to use other fonts can, although the choice is still rather limited.\n\n<cite>the method I still need to look into for **TeX.</cite>\n\nMath specific metrics are stored into TeX's own format, TFM (TeX File Metric). Making TFM files for math fonts is a bit technical. The first problem is that there are very few ways of generating them (the only ways I know of are metafont, fontinst, [fontforge](http://web.archive.org/web/20120720140608/http:/fontforge.sourceforge.net/PfaEdit-TeX.html) and by hand). The second is that you need to test the fonts, so you must have a TeX distribution installed and have enough knowledge to install your new fonts (not so easy: there's more involved than putting the files into a directory; but once you know how to do it, it's not difficult).\n\nYou can find a technical description of the TFM font format in Yannis Haralambous' book [Fonts and Encodings](http://web.archive.org/web/20120720140608/http:/books.google.com/books?id=qrElYgVLDwYC) from O'Reilly.\n\nIf you're really up to it and don't mind all the technical hassle of the process, I should probably be able to answer most of your questions on the subject.\n\n"
    },
    {
      "time": "10 Sep 2008 — 6:50am",
      "content": "_All in all it’s a lot of work for a small market._\n\n\"Comic Math\", anyone? School teachers might love it :)\n\n"
    },
    {
      "time": "10 Sep 2008 — 8:30am",
      "content": "<cite>“Comic Math”, anyone? School teachers might love it :)</cite>\n\nHa, but come to think of it, a handwritten style math font, maybe one mimicking Erdős's handwriting, would be kind of neat. Now that'd be a huge font file with 7 or so variations on every single math character.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
