{
  "id": "49106",
  "title": "Quotes about Design",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I once read a quote that went something like this:\n\n**Good design is the balance between monotony and overindulgence.**\n\nI don’t know who said it, but I love the simplicity of it. It really gets to the heart of where design starts and ends.\n\nFollowing in the foot steps from this thread ( [http://typophile.com/node/13406](http://web.archive.org/web/20081201165205/http:/typophile.com/node/13406 \"http://typophile.com/node/13406\")) are there any design specific quotes that are inspiring, you’d like to share?\n\n [‹ \"Upper & Lower case\" magazine published in paper](http://web.archive.org/web/20081201165205/http:/www.typophile.com/node/48638 \"Go to previous forum topic\") [Seriously, what's with these logos? ›](http://web.archive.org/web/20081201165205/http:/www.typophile.com/node/48952 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201165205/http://www.typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 4.Sep.2008 6.09pm",
      "content": "“As long as the message is pure, the more gently it is spoken, the more forcefully it will reverberate into the world’s receptive places, as a penetrating whisper.” – Kenya Hara\n\n“I don’t want to be original, I want to be good” — Mies\n\n"
    },
    {
      "time": " 4.Sep.2008 8.57pm",
      "content": "“Pushpin Studios brilliantly married conceptual imagery (both illustration and photography) with eclectic, often decorative typography. They did so to make a specific point or to tell a joke. It seemed to me to be the most generous form of design. It told you what you needed to know and entertained you at the same time.” — **Paula Scher**\n\n“If I can’t think it, I can’t do it.” — **George Orwell**\n\n“To maintain any creative longevity a designer today must reinvent his or her work every five years. This does not mean simply changing style. It means reassessing one’s approach — again, design is an art of planning — and finding a way that is new yet still reflects on one’s core ethic and aesthetic. This entails a reevaluation of one’s visual vocabulary, new technologies, the cultural zeitgeist, and the scale on which one works. Reinvention is personal growth.” — **Paula Scher**\n\n"
    },
    {
      "time": " 6.Sep.2008 7.14am",
      "content": "Not about design per se, but creativity:\n\n“Creativity can solve almost any problem.  \nThe Creative Act, the defeat of habit by originality, overcomes everything.”\n\nGeorge Lois\n\n[http://typographyshop.com](http://web.archive.org/web/20081201165205/http:/typographyshop.com/ \"http://typographyshop.com\")\n\n"
    }
  ]
}
