{
  "id": "49148",
  "title": "Overton's re-branding",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Overton’s is the world’s largest water sports dealer and are re-branding. They want a logo that can be used for a water sports demographic (wake boarding, water skiing, tubing, etc.) as well as for a marine electronic demographic (higher end products). Logo choices have been narrowed down to these three. Please critique these logos as much as you possibly can. Criticism of any kind is greatly appreciated, however the constructive kind is always better. Because of placement on some products, the icon will have to be strong enough to stand alone as well as work with the logo as a whole of course.\n\n ![](http://web.archive.org/web/20081206012914im_/http:/typophile.com/files/Overtonslogo_4942.jpg)\n\n [‹ waterbox logotype critique](http://web.archive.org/web/20081206012914/http:/typophile.com/node/48611 \"Go to previous forum topic\") [Australian Type Club logo ›](http://web.archive.org/web/20081206012914/http:/typophile.com/node/48525 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081206012914/http://typophile.com/user/36416\" title=\"View user profile.\">Overtons</a>",
  "time": "<br>",
  "uid": "36416",
  "comments": [
    {
      "time": " 5.Sep.2008 3.57pm",
      "content": "#1 is the best. I like the icon.\n\nWould be useful to see the entire logo at higher resolution before making any further suggestions.\n\n#2 doesn’t convey any energy or excitement.  \n#3 is fine, but generic.\n\n"
    },
    {
      "time": " 5.Sep.2008 4.29pm",
      "content": "Hopefully this will help with a larger view.\n\n ![](http://web.archive.org/web/20081206012914im_/http:/typophile.com/files/compare2_4839.jpg)\n\n"
    },
    {
      "time": " 5.Sep.2008 7.07pm",
      "content": "The O in #2 doesn’t read like a letter - I see “VERTON’S” next to a swooshy logo.  \nThe O in #3 looks somewhat like a Q. I also see the Barack Obama logo in its logo, but that may be less of a concern after the election passes.  \nThe O logos in #1 and #3 may look too heavy to convey a sporty, skidding-across-the-water feeling. Almost donut-y.  \nHeaviness aside, I like the type choice of #3 best.\n\n"
    },
    {
      "time": " 5.Sep.2008 8.45pm",
      "content": "They all look like tires to me.\n\nSharon\n\n"
    },
    {
      "time": " 6.Sep.2008 1.27am",
      "content": "At first glance, logo 2 looked like it would suit a bread bakery. I think that possibly a combination of concepts 1 and 3 might work.\n\n- Lex\n\n"
    },
    {
      "time": " 6.Sep.2008 7.22am",
      "content": "Try taking the stroke from #1 off the “O” and see how that affects the “heaviness” of the mark.\n\npenn\n\n"
    },
    {
      "time": " 7.Sep.2008 12.59pm",
      "content": "#1 is really nice. It has connection to water sports. Maybe you will have to tweak a the O over the wave. It somehow reminds me of sun, which is great, but it could probably be done better.\n\n#2: no relation to water sports whatsoever. not memorable and O is not part of the word Overton’s\n\n#3: Q? Noone seems the relation to QOMPAQ? Q? Very similar and also not enough relation to water sports.\n\nIf I were you, I’d only work on #1. Forget the other two. Really.\n\nPenn&ink suggested to remove the stroke. I think EXACTLY that particular stroke gives your logo some character. Without it will just be blunt and forgettable. And It will not go well with wave underneath that has stroke modulation. You’ll maybe have to introduce stroke weight on teh O’s stroke as well? Maybe... Try it.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 7.Sep.2008 2.13pm",
      "content": "Yes, Robert - I too think that #3 is way too Compaq-ish :) Like #1, but i don’t like the Borders around the O, I think it will work better without them.\n\n"
    },
    {
      "time": " 7.Sep.2008 5.34pm",
      "content": "I’m digging number 1 too.\n\nit’s definitely the strongest. I do agree about the stroke requiring some weight differentiation though ... perhaps it doesn’t need to completely encircle the main O.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081206012914/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": " 8.Sep.2008 7.30am",
      "content": "Thanks for all the comments so far everyone. The ’O’ in the top icon is actually a throughput of the old Overton’s logo.\n\n ![](http://web.archive.org/web/20081206012914im_/http:/typophile.com/files/OvertonsOLD_4686.jpg)\n\nI agree the stroke around the top may be a bit too thick, Chose to go with that size to tie it in with the weight of the type underneath it. Without a stroke it does not stand up as well especially when the icon is by itself.\n\nAlso the top version was done in house here at Overton’s and the bottom two came from some big agency in Texas. Thank you again for all your input so far.\n\n"
    },
    {
      "time": " 8.Sep.2008 10.06am",
      "content": "#2’s not bad per se .... it just... doesn’t have much to do with water.\n\nI definitely prefer #1 and agree that it’s a bit heavy. The other two just show why sometimes its best when possible to get someone within a culture to do design work.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 8.Sep.2008 10.50am",
      "content": "The marks:\n\nThe Obama force is strong with 1 and 3, and 3 definitely reads as a Q at a quick glance. Perhaps what 2 is missing is a little of the dynamism that 1 and 3 have? Try skewing it to match the leaning type, maybe make it blacker to get the positives and negatives vibrating a bit more?\n\nThe type:\n\n1 definitely has more of what it sounds like you’re looking for: bold, in-your-face energy. I might rework some of the intersections between letters, but keep that RT, it’s tasty.\n\n(edit) The N’S in 1 is pretty great too!\n\n"
    },
    {
      "time": " 8.Sep.2008 10.42pm",
      "content": "I think #1 is the best by far, but agree with few others that the line around the O should go. With regards to giving it weight without this, have you tried bulking up the waves so they are more in line with the O itself, and having the O a closer match to the name treatment below? You may find that helps.\n\nAlso, I find the type for this one a little distracting. It’s like you didn’t quite know when to stop adding.\n\n"
    },
    {
      "time": " 9.Sep.2008 12.23pm",
      "content": "I like the icon for #1. I don’t think you should get rid of the line around the O (but can we see it without it, just to make sure).\n\nNot so hot about the logotype for #1 though. Seems incongruous with the icon.\n\n-I’d explore a logotype with the same O that you used with the icon.  \n-What do you think about making the logotype more fluid? Right now it looks really angular to me.\n\n"
    }
  ]
}
