{
  "id": "49153",
  "title": "Ed Rondthaler's Spelling Lesson",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "House Industries has posted a video of 102-year-old Ed Rondthaler (founder of Photo-Lettering, Inc.) giving his famous spelling lesson. As some of you may recall, Ed presented this live on-stage at TypeCon 2005 in NYC.\n\n[Ed Rondthaler on English Spelling](http://web.archive.org/web/20120720132659/http:/www.houseind.com/showandtell/index.php?id=592)\n\n",
  "author": "Mark Simonson",
  "time": "5 Sep 2008 — 5:01pm",
  "uid": "1043",
  "comments": [
    {
      "time": "5 Sep 2008 — 5:26pm",
      "content": "Loved it!\n\n"
    },
    {
      "time": "5 Sep 2008 — 5:38pm",
      "content": "Sweet! I was there - it was quite a moment!\n\n"
    },
    {
      "time": "5 Sep 2008 — 5:38pm",
      "content": "Sweet! I was there - it was quite a moment!\n\n"
    },
    {
      "time": "6 Sep 2008 — 9:23am",
      "content": "Can't wait for the movie!\n\n"
    },
    {
      "time": "6 Sep 2008 — 7:01pm",
      "content": "Great fun, but not terribly convincing, since the single syllable words don't present anything like the full extent of variation in English spelling. There's no way that English spelling can be made phonetic without extending the number of letters in our alphabet: there are simply too many sounds to be represented by too few letters. Even if one made the representation of short vowels consistent -- sum dum bum --, one would quickly run out of letters and have no way to represent other vowels, diphthongs, slurs, etc.\n\n"
    },
    {
      "time": "6 Sep 2008 — 7:53pm",
      "content": "I recall that back in the Seventies, there was an article by Ed in U&lc. It explained the entire \"Sound Spel\" system. While I'm sure there were limits, as you point out, it did seem like it would be an improvement over the present system on some levels. And it would certainly be easier to learn. The thing that bothered me about it was that it would disconnect English from its roots. The thing about English is that it is a melange of other languages, which is also why its spelling is so inconsistent. Make the spelling consistent, and all that would be hidden. Or at least it would be harder to see. Also, how would you decide how to spell \"either\" and \"tomato\"?\n\nIn spite of all that, I still find Ed's critique entertaining and clever.\n\n"
    },
    {
      "time": "7 Sep 2008 — 7:11am",
      "content": "Oh my, he is 102 years old! Congratulations Sir -that's is FUN .\n\n"
    },
    {
      "time": "7 Sep 2008 — 10:47am",
      "content": "Ironically, I got that wrong: It should be \"soundspel\" or \"SoundSpel,\" not \"Sound Spel.\"\n\nThe article appeared in the second issue of U&lc. (vol. 1, no. 2). In case anyone is interested, there is an article on Wikipedia about the system:\n\n[http://en.wikipedia.org/wiki/SoundSpel](http://web.archive.org/web/20120720132659/http:/en.wikipedia.org/wiki/SoundSpel)\n\n"
    }
  ]
}
