{
  "id": "49164",
  "title": "Character Sets",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi Guys,  \nAs a newbie to type creation I’d like to start off on the right foot and create fonts that generally cover most languages. (I have a background in Graphic Designer and after many years of loving and appreciating all styles of fonts, I’d like to have a crack myself)\n\nMy question is;  \nIf I was to design a typeface and wanted to set off on the correct foot to start with, what would generally be the complete character set based around English that also covers the most widely used other main languages? (I understand that there are many more Glyphs catering for many minor langusges, but if I eventually wanted to sell a font, what would be a sufficient Character Set that a Foundry would see as being acceptable for the wider market?\n\nI want to start designing the correct way early in my endevours by designing Character Sets that anyone would say is professional and covers the major langusges and their respective glyphs. I have looked through FontLab, but their ’Encoding’ selections look overwhelming.\n\nA guiding hand, and anyone’s wisdom would be greatly appreciated.  \nI have already started looking through these fantastic forums and am amazed at the information available.\n\nI have created all forms of Graphics in my time, from the basic business card & tee shirt prints, to in-store displays and creating art for Licensed Product all around the world, but after many years I’ve got the bug, and I think there is nothing more beautiful in the designing world than a beautiful font!\n\nThanks for having me, and if you could answer my various questions on Character Sets & widely used languages that would be great.\n\nCheers Guys\n\n [‹ School Branding](http://web.archive.org/web/20081201172141/http:/www.typophile.com/node/49290 \"Go to previous forum topic\") [Concert Ticket Design ›](http://web.archive.org/web/20081201172141/http:/www.typophile.com/node/16768 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201172141/http://www.typophile.com/user/36432\" title=\"View user profile.\">Dr jack</a>",
  "time": "<br>",
  "uid": "36432",
  "comments": [
    {
      "time": " 6.Sep.2008 4.48am",
      "content": "here’s a very good starting place for Latin character sets:  \n [http://blogs.adobe.com/typblography/2008/08/character\\_set\\_terms.html](http://web.archive.org/web/20081201172141/http:/blogs.adobe.com/typblography/2008/08/character_set_terms.html \"http://blogs.adobe.com/typblography/2008/08/character\\_set\\_terms.html\")  \nand for Cyrillic:  \n [http://blogs.adobe.com/typblography/2006/08/defining\\_an\\_ext.html](http://web.archive.org/web/20081201172141/http:/blogs.adobe.com/typblography/2006/08/defining_an_ext.html \"http://blogs.adobe.com/typblography/2006/08/defining\\_an\\_ext.html\")\n\n"
    },
    {
      "time": " 6.Sep.2008 4.53am",
      "content": "I wouldn’t worry too much about character sets right know if you have to start your first font from scratch. Just select MacOS Roman encoding and do those characters first till your utterly happy with them. You can easely extend the font later (if we’re not talking about Greek or Cyrilic) because a lot of other characters/glyphs can be made of components.\n\n"
    },
    {
      "time": " 6.Sep.2008 8.00am",
      "content": "Thanks Paul,  \nI’ll cut and paste those links and keep them for reading and reference.\n\nThanks Jos,  \nJust a quick question on ’MacOS Roman’.  \nHow great is the difference between that encoding and ’MS Windows 1252 Western’.  \nWill I limit myself by using one and not the other?\n\nCheers\n\n"
    },
    {
      "time": " 6.Sep.2008 9.04am",
      "content": "if you’re making a cross platform font, you will likely want to include all the glyphs from both of those two character sets.\n\n"
    },
    {
      "time": " 6.Sep.2008 12.08pm",
      "content": "I wasn’t aware of any diference between these two codepages, but if so then as Paul says: include both.\n\n"
    },
    {
      "time": " 7.Sep.2008 4.47pm",
      "content": "This is my main post on Latin character sets: [http://blogs.adobe.com/typblography/2008/08/extended\\_latin.html](http://web.archive.org/web/20081201172141/http:/blogs.adobe.com/typblography/2008/08/extended_latin.html \"http://blogs.adobe.com/typblography/2008/08/extended\\_latin.html\")\n\nThere are some noticeable differences between MacRoman and WinANSI (codepage 1252). For example, Mac includes some ligatures and math symbols Windows leaves out, while Windows has some fractions and numeric superiors which Apple ignored.\n\nThe Adobe Latin 2 character set linked from my blog post (see link above) is the union of these two key character sets, plus the liter and estimated symbols.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 8.Sep.2008 11.07am",
      "content": "Fantastic Thomas,  \nMany Thanks for the Link.  \nLots of Learning to do, but with the right information from the start this should give me the correct grounding.And being able to download the various Latin Sets is excellent.\n\nSo in a nutshell Thomas, designing to the Adobe Latin 2 Character set to begin with, takes in a wider user base and doesn’t disadvantage too many people?  \nEven though I’m a newbie to Font Design, would designing to Adobe Latin 2 be seen as a sufficient professional set to sell eventually?  \nI just don’t want to become one of those nasty free font designers who just releases 26 Upper & Lower case Latin letters, numerals and a few punctuation marks.\n\nRegards\n\nJ\n\n"
    },
    {
      "time": " 8.Sep.2008 2.12pm",
      "content": "Yes.\n\nPersonally, I consider Adobe Latin 2 to be the most basic general-purpose cross-platform character set. You could omit liter and estimated, but the rest are pretty fundamental.\n\nNow, that’s still limiting yourself to western European languages, and sure, it disadvantages hundreds of millions of people (even just sticking to Latin based writing systems). It just depends on how much work you’re willing to do. Adobe Latin 3? etc.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 9.Sep.2008 8.04am",
      "content": "Following on from Thomas’s help (and maybe Thomas can answer this)...\n\nI have FontLab Studio 5.  \nI would like to design a Font to the Adobe Latin 2 Character Set.  \nOn the ’encoding’ tab within the Fontlab 5 program I can’t seem to find the title on the tab for ’Adobe Latin 2’ with the full 250 Glyphs.\n\nI do have these two settings “Adobe OT PS Kerning Subset” and “Adobe OT PS Standard Names(CFF)”.  \nDo I select one of these, and do they match the Adobe Latin 2 Set?\n\nI have lots of Type 1 settings...and the only encoding that has “Latin 2” in the name is “ISO 8859-2 Latin 2 (Central Europe)...but that has glyphs like ’Tcommaaccent’(0162)which aren’t mentioned in the AL-2 Official Character Set.\n\nOther that, I’ll have to print out the AL-2 Character Set from Thomas’s link, print it out and trawl through the encoding tab options FontLab 5 gives me.\n\nHope I’m making sense. Newbie talking.  \nCheers in advance to anyone that can help.  \nJ\n\n"
    },
    {
      "time": " 9.Sep.2008 8.40am",
      "content": "The easiest way to get from Thomas’ lists to a FontLab encoding is this:\n\nDownload [http://blogs.adobe.com/typblography/latin\\_charsets/txt/AL2\\_table.txt](http://web.archive.org/web/20081201172141/http:/blogs.adobe.com/typblography/latin_charsets/txt/AL2_table.txt \"http://blogs.adobe.com/typblography/latin\\_charsets/txt/AL2\\_table.txt\")\n\nOpen in plain text editor, remove everything but the column containing the glyph names, so you end up with a text file with one glyph name in every line and nothing else:\n\nspace  \nexclam  \nquotedbl  \nnumbersign  \n...\n\nThen you can add a file header (look in the FontLab encodings folder for examples), but be sure to change the name and ID number and put the resulting plain text file into the FontLab encodings folder, restart FL and you will find your encoding in FontLab’s encoding list.\n\n"
    },
    {
      "time": " 9.Sep.2008 9.12am",
      "content": "Many Thanks Jens.....I will give it a try.\n\n"
    },
    {
      "time": " 9.Sep.2008 9.31pm",
      "content": "I now am the proud owner my own ’Adobe Latin 2’ encoding setting file in FontLab 5.\n\nOne small query.  \nWhen I go to my new, customized encoding setting in FontLab, I have no greyed out view of the ’% percent’ glyph in that box, though all other grey background template glyphs are present.  \nI checked inside my original text file that became this customized set and the word just says ’percent’. (It was just ’cut & pasted” from the AL 2 text link Thomas posted here)\n\nAll other grey glyphs are present, just not ’%’ (Unicode Character 0025).  \nOther Character Set se3tting that came with FontLab show the grey ’%’ symbol.\n\nAny ideas?  \nThanks.\n\n"
    }
  ]
}
