{
  "id": "49198",
  "title": "1923 American Type Founders Book - FOUND!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello, All!\n\nI was at a fantastic antiquey-junky-funky place and found a 1923 ATF Book of Type Styles from 1923, among the piles of old letterpress letters I was scooping up.\n\nThe dealer wanted $325, but I got him to hold it for me for $250.\n\nI'm a graphic designer that adores type - but I don't know a lot about how much something like this is even worth. I did some Typophile searches, figuring this question has probably come up before... I found a post saying you can usually buy these for $120-$150. The quality of the book is fair - has the crusty, musty smell and look of a worn, old treasure. I snapped a few pics that are with this post.\n\nSo, my question is - should I just be happy I stumbled upon one of these and buy it asap? Or try to bargain this guy down further? Thanks in advance for any advice, typophiles!\n\n-Anne\n\nAside:  \nSomething about this book jogged my memory. I went home to my beloved dorky design binders and found an article I'd pulled out of Print \"If I had $9,000...\" The article was a collection of things a designer might buy if they just happened to have a suitcase of money under the bed. One of the items was this book! Ha!\n\n ![](http://web.archive.org/web/20120720132317im_/http:/typophile.com/files/IMG_1301_6574.JPG)\n  \n\n ![](http://web.archive.org/web/20120720132317im_/http:/typophile.com/files/IMG_1304_6144.JPG)\n  \n\n ![](http://web.archive.org/web/20120720132317im_/http:/typophile.com/files/IMG_1303_3881.jpg)\n\n",
  "author": "annedesigns",
  "time": "7 Sep 2008 — 1:47pm",
  "uid": "24338",
  "comments": [
    {
      "time": "7 Sep 2008 — 2:40pm",
      "content": "Hi!\n\nwell...dont know much about \"commercial value\" but I would love to put my hand on one...  \nCan you post some pages with Typefaces? I just love that \"old flavour\"...\n\nAntónio\n\n"
    },
    {
      "time": "7 Sep 2008 — 2:45pm",
      "content": "Don't know if you already saw this, but there is some info about your copy [here](http://web.archive.org/web/20120720132317/http:/www.garloo.com/atf1923.htm)!\n\nAntónio\n\n"
    },
    {
      "time": "7 Sep 2008 — 2:48pm",
      "content": "Prices on old specimen books went up after Helvetica (the film) found an audience, but it’s mostly asshole booksellers who will leave the books on a shelf for years in hopes that someone bites at a high price. They can sometimes be found in the hands of better businesses cheap, tho, and right now there are two copies on Amazon for just under $80.  \n [http://www.amazon.com/gp/offer-listing/B000JC1GHU/ref=sr\\_1\\_olp\\_3?ie=UTF8...](http://web.archive.org/web/20120720132317/http:/www.amazon.com/gp/offer-listing/B000JC1GHU/ref=sr_1_olp_3?ie=UTF8&s=books&qid=1220823584&sr=8-3 \"http://www.amazon.com/gp/offer-listing/B000JC1GHU/ref=sr\\_1\\_olp\\_3?ie=UTF8&s=books&qid=1220823584&sr=8-3\")\n\n"
    },
    {
      "time": "7 Sep 2008 — 3:04pm",
      "content": "Anne,\n\nIt's a lovely speciemen book indeed, and of course one of the standard books for a serious type designer or a graphic designer with a great deal of interest for typography. Usually the \"mid-20ies\" editions are the best from most type foundries. Still judging from the pictures it seems to be pretty warn and jagged. I wouldn't pay more that $100 or so for this particular piece. E-bay often have this book in mint condition.\n\n"
    },
    {
      "time": "7 Sep 2008 — 3:08pm",
      "content": "Just had aquick look at E-bay and they actually have two up for auction right now, closing soon.\n\nGood luck!\n\n"
    },
    {
      "time": "7 Sep 2008 — 4:26pm",
      "content": "Be happy! That is a nice find. The prices of these books went way up because people are talking about them here :)  \nYou buck was ex-trimly well spent.\n\n"
    },
    {
      "time": "7 Sep 2008 — 4:43pm",
      "content": "Typophiles never disappoint!  \nThanks, everyone, for such quick and thorough responses.\n\nJudging by a couple of the responses, I probably didn't make myself super-clear... I haven't bought the book - yet. I was looking for the sage advice of all the typophiles out there to be better armed with info on what I should (and shouldn't) be spending for this particular copy. I'll go back to the dealer and see what kind of deal we can strike. I'd like to try, anyway - as I could use the practice negotiating. I'm terrible at negotiating, I usually just pay what they're asking.\n\nIf I scoop it up, I'll be sure to post pictures!\n\nThanks again, everyone!\n\n"
    },
    {
      "time": "7 Sep 2008 — 6:21pm",
      "content": "I think you should wait and find a better copy. That one looks pretty sad and I just hate a strong musty smell. If it is mildew, it can spread to your other books.\n\nSharon\n\n"
    },
    {
      "time": "7 Sep 2008 — 11:09pm",
      "content": "I would suggest you hold off on this purchase. These can be picked up quite cheaply on eBay if you are willing to wait. I'd say that if you bid $120 for one of these on eBay you will win and for a lot less.\n\nThese were published in a very massive edition back in 1923. Theo Rehak, in his book on ATF, mentions how foundry workers, a half century or more later, were using mint copies for firewood at one point.\n\nGerald\n\n"
    },
    {
      "time": "8 Sep 2008 — 4:16am",
      "content": "Hi Anne.\n\nThe advice to go bidding on ebay is really valid. This copy you're looking at in the antiquey-junky-funky place is overpriced by about 200%.\n\nI say this because I asked my local bookseller (in New Zealand) to acquire me one a couple of years ago – and including the shipping & insurance, it still came in at less than half the price of this one you're getting held at $250. I know I paid over the odds, but my copy is in better condition.\n\nThe book itself states that the 1923 edition was 60,000 copies. They were passed out to ATF resellers worldwide. Here's a couple of pages with that 'old flavour'...\n\n ![](http://web.archive.org/web/20120720132317im_/http:/typophile.com/files/ATF_Garamond4_4452.jpg)\n\n ![](http://web.archive.org/web/20120720132317im_/http:/typophile.com/files/ATF_Recut-Caslon1_5702.jpg)\n\n"
    },
    {
      "time": "8 Sep 2008 — 9:05am",
      "content": "E-bay is mostly a very good place to find book within the typographic area. I boucght my excellent copy for not more than $100.\n\nAnd the smell issue could turn out hard to overcome. Apart from e-bay, Adebooks ( [www.adebooks.com](http://web.archive.org/web/20120720132317/http:/www.adebooks.com/ \"www.adebooks.com\")) are sometimes a nice option.\n\nCheers\n\n"
    },
    {
      "time": "8 Sep 2008 — 9:07am",
      "content": "Sorry about the false link. It shoud be ABEBOOKS... [www.abebooks.com/](http://web.archive.org/web/20120720132317/http:/www.abebooks.com/ \"www.abebooks.com/\")\n\n"
    },
    {
      "time": "8 Sep 2008 — 1:52pm",
      "content": "I've bought two copies of this book, and the most recent for well under $100 on eBay. I certainly would not pay anything over $120 for this book, and I'd only go over $100 for one in really wonderful condition.\n\nT\n\n"
    },
    {
      "time": "10 Sep 2008 — 4:06pm",
      "content": "To hook onto this inquiry, is the 1927 ATF supplement of Goudy faces a worthwhile purchase?\n\n"
    },
    {
      "time": "11 Sep 2008 — 7:13pm",
      "content": "This is a nice book if it is in one piece still. Check to see if any ofthe pages have been removed or if someone has been at the pages with a scalpel. If its all there then $150 is a fair price, if it been hacked about then don't pay over $100.\n\n"
    }
  ]
}
