{
  "id": "492",
  "title": "(x) W Magazine titling face - June {Stephen}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I just saw a copy of \"W\" (it's a thick tabloid-size magazine), and besides having a cool format (it's two upside-down halves, with different typography), it has this pretty amazing font, used nicely for titles, but also a lot less happily for text (for one thing, the color's way too dark for that), and the font seems to have a sans too. Any ideas what this thing is, and who made it?   \n   \nI wasn't about to spend money for the magazine's content, so I have no scans - sorry.   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "25 Apr 2002 — 1:38pm",
  "uid": "1250",
  "comments": [
    {
      "time": "25 Apr 2002 — 3:02pm",
      "content": "is this what you are talking about?   \n   \n [http://wmagazine.com/w/images/newhome/pict3.jpg](http://web.archive.org/web/20120716215034/http:/wmagazine.com/w/images/newhome/pict3.jpg)\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:07pm",
      "content": "Hrant, no pictures - you little tease.\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:35pm",
      "content": "Kevin, that's the logo, and it looks like the same magazine. But I'm after the titling font they're using (on the cover and inside too).   \n   \nOle: I'm not paying no $4 for crap!   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2002 — 3:37pm",
      "content": "i think the girlfriend may have a copy of this at home. ill see what i can do.\n\n"
    },
    {
      "time": "25 Apr 2002 — 5:15pm",
      "content": "is this what you are looking for?   \n   \n ![w-titling](http://web.archive.org/web/20120716215034im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "28 Apr 2002 — 7:42pm",
      "content": "![w-titling](http://web.archive.org/web/20120716215034im_/http:/www.typophile.com/forums/messages/83/1236.gif)\n\n"
    },
    {
      "time": "25 Apr 2002 — 6:06pm",
      "content": "Just a start: looks like a Garamond.   \nIt has a sans, Hrant? Got a scan of that, Kevin?   \n   \nStephen\n\n"
    },
    {
      "time": "25 Apr 2002 — 6:51pm",
      "content": "well, they use trade gothic for the folio, futura for some of the subheads, and a fat-face slab serif for the some of the bi-lines, and this for the some pull quotes.   \n   \n ![W sans](http://web.archive.org/web/20120716215034im_/http:/www.typophile.com/forums/messages/83/1237.gif)\n\n"
    },
    {
      "time": "25 Apr 2002 — 7:07pm",
      "content": "and the above is News Gothic if i am not mistaken.\n\n"
    },
    {
      "time": "25 Apr 2002 — 7:18pm",
      "content": "well, i guess i was mistaken.   \n ![news gothic sample](http://web.archive.org/web/20120716215034im_/http:/www.typophile.com/forums/messages/83/1238.gif)\n\n"
    },
    {
      "time": "25 Apr 2002 — 7:24pm",
      "content": "Slow down, guys! That's not the stuff.   \n   \nI think you're either looking at the \"other half\" of the magazine, or maybe the font I saw (way funkier than those oldies, the type of thing Tankard or RXC would have made) is part of a recent redesign, and Kevin's scans -and appreciated as they are- are from a pre-redesign issue.   \n   \n(Maybe I'll fork over the $4 for the font, if not the content...)   \n   \nhhp\n\n"
    },
    {
      "time": "25 Apr 2002 — 7:28pm",
      "content": "yeah, those are from the december 2001 issue. anyone know what that first garamond is up there? just curious.\n\n"
    },
    {
      "time": "25 Apr 2002 — 7:38pm",
      "content": "nevermind, i believe it is bitstream's \"Italian Garamond\"\n\n"
    },
    {
      "time": "26 Apr 2002 — 5:42pm",
      "content": "well mr. papazian, where are the scans?\n\n"
    },
    {
      "time": "26 Apr 2002 — 7:10pm",
      "content": "Funny you should ask. I \\*just\\* came back from a magazine stand (but not the same as yesterday's) that had an issue of \"W\", and it was like half of the other one - but the wrong half... :-/ Maybe tomorrow.   \n   \nBTW, just call me Hrant, and don't fret the pronunciation either.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Apr 2002 — 8:33pm",
      "content": "I went back to where I saw it, and it's gone! Can you believe that? It was the April issue (which is very surprising - I thought the April would have been long gone by February...). I'm going to call their offices on Monday to ask what the font was, since back issues are $10 + S&H...   \n   \nhhp\n\n"
    },
    {
      "time": "28 Apr 2002 — 7:40pm",
      "content": "Fortunately, my wife is both a W subscriber and a pack rat, so we had a copy of the issue.   \n   \nHere are (hopefully) passable scans of the faces in question.   \n   \n ![w_mag_cov1.jpg](http://web.archive.org/web/20120716215034im_/http:/www.typophile.com/forums/messages/83/1247.jpg)\n\n"
    },
    {
      "time": "28 Apr 2002 — 7:42pm",
      "content": "![w_mag_cov2.jpg](http://web.archive.org/web/20120716215034im_/http:/www.typophile.com/forums/messages/83/1248.jpg)\n\n"
    },
    {
      "time": "28 Apr 2002 — 7:43pm",
      "content": "/image{w\\_mag\\_sans.jpg}\n\n"
    },
    {
      "time": "28 Apr 2002 — 7:45pm",
      "content": "(\\*#%@$ backslash! What is this, MS-DOS?)   \n   \n   \n ![w_mag_sans.jpg](http://web.archive.org/web/20120716215034im_/http:/www.typophile.com/forums/messages/83/1249.jpg)\n\n"
    },
    {
      "time": "28 Apr 2002 — 7:57pm",
      "content": "That's it, Marc! Thanks much. And the sans too - double thanks.   \n   \nSo, guys, any ideas of who made this stuff?   \n   \nhhp\n\n"
    },
    {
      "time": "28 Apr 2002 — 7:59pm",
      "content": "BTW, isn't that lc \"g\" just [structurally] genial?   \n   \nhhp\n\n"
    },
    {
      "time": "28 Apr 2002 — 9:14pm",
      "content": "This smells of Jocham.   \nwww.hubertjocham.de   \n   \nStephen\n\n"
    },
    {
      "time": "28 Apr 2002 — 9:24pm",
      "content": "It is! June Regular and Oldstyle.   \nJocham's work has a very recognizeable   \nlook and this set is the most extreme   \nrepresentation of that style. I think   \nit's beautiful.   \n   \nFrom the samples I've seen, the   \nOldstyle is definitely a display face.   \nIt's hard to picture it used for body   \ncopy. Can I trouble you for another   \nscan, Marc?   \n   \nStephen   \n   \nP.S. I've invited Hubert to the forum   \nto comment on this stuff.\n\n"
    },
    {
      "time": "29 Apr 2002 — 12:08am",
      "content": "Happy to oblige. Sorry for the quality of the scan.   \n   \n ![w_mag_text.jpg](http://web.archive.org/web/20120716215034im_/http:/www.typophile.com/forums/messages/83/1250.jpg)\n\n"
    },
    {
      "time": "29 Apr 2002 — 3:43am",
      "content": "Hi Hubert, I have heard a type designer is lucky if he gets paid for 6% of due royalties for licensing his work. This of course means 94% would be in circulation with no license as pirate copies. so just out of curiosity, how many copies of this font have you licensed, and what does a license to these nice fonts cost. Also what inspired you to do the strange signature lower case \"g\"s in the majority of you work, I find these lc \"g\"s disproportionate, unattractive and yet appealing all at the same time, I would guess you must have had discussions with clients over this, as they are very different from normal lc \"g\"s.\n\n"
    },
    {
      "time": "29 Apr 2002 — 8:14am",
      "content": "Hubert, great work. To me June is what post-modernism was \\*supposed\\* to become (but largely didn't).   \n   \nThis isn't the Critique Forum, so I won't go into that, except to say that I think the structure of your \"g\" solves the \"g-problem\"\\* in a very smart way; but in terms of finish, I think it's a bit wide, especially in the head. I also think the font's x-height is a bit large for text (except if somebody is daring enough to use it as a news face!), but I saw a more serious problem in \"W\": the text was way too dark, much darker than the headline settings seem to indicate. I think they had had a gain problem, or maybe they used \"deep black\" (CMYK).   \n   \n\\* Since you're new to this forum you won't know that I have a reputation for an obsession with the lc \"g\". I think it's by far the most difficult Latin character to design (which is what makes it fascinating), and have some pet theories about what it needs to be.   \n   \nOf course, an even more serious problem is that they might have no license! All I have is some phone numbers:   \n   \nHQ: 800.289.0390   \nEditorial, NY: 212.630.4000   \nLA Office: 323.951.1800   \n   \nBTW, what about the sans?   \n   \nhhp\n\n"
    },
    {
      "time": "29 Apr 2002 — 11:02am",
      "content": "\\> there is a demand of new especilly sans typefaces   \n   \nSince trends in type design are much faster on the display side than the text side, that makes sense. But I still don't like it. Serif faces have such a complex beauty, like with June in fact. Not to mention their greater readability.   \n   \n\\> it was used in 8p and even 6p and it worked quite well.   \n   \nThis makes perfect sense, and it alludes to what I wrote about newspaper typography. Below the immersive reading range (about 9-11 point) reading becomes more \"choppy\", and legibility is more important than readability. But in the optimal range, boumas (word shapes) are more important, and a smaller x-height helps.   \n   \nAs for the area above the narrow range, it depends on the design. Generally you want a large x-height, especially if it's a Modernist design, but sometimes a Garamond with a small x-height set large conveys a great elegance.   \n   \n\\> At the end you never really know why it workes or not. A big part is to get used to an alphabet.   \n   \nFamiliarity is very important. But it's also used by many people as an escape from thinking about the beast that is readability. It's clear that some fonts are inherently more readable than others, but the reasons are very dark, and this makes most people afraid.   \n   \nFurthermore, familiarity itself is not understood. How quickly is it gained, and in what ways? It's very significant that the people who keep saying \"legibility is unimportant, it's just what you read most\" also don't bother unraveling familiarity itself! :-/   \n   \nThe truth is out there, but we will never know it completely. However, this does not relieve us (especially not text font designers) of the responsability of understanding the \"scientific\" aspects of the craft. For example: there's a very good \\*physical\\* reason that newspaper fonts need bigger x-heights than book faces.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Apr 2002 — 11:39am",
      "content": "\\> June workes also for longer copy   \n   \nI agree that it works well, even better than most people might suspect. But I also think that a smaller x-height would make it more readable, at 9-11 point.   \n   \n----   \n   \nI work mostly in non-Latin, especially Armenian. But I do have one Latin text face (so far):   \n [http://www.typophile.com/forums/messages/29/805.html](http://web.archive.org/web/20120716215034/http:/www.typophile.com/forums/messages/29/805.html)   \n   \nHere's my site:   \n [http://www.themicrofoundry.com/](http://web.archive.org/web/20120716215034/http:/www.themicrofoundry.com/)   \n   \n----   \n   \nBTW, your web site is bookmarked for some serious browsing soon! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "29 Apr 2002 — 1:15pm",
      "content": "\\> readability is more than x-hight.   \n   \nTotally.   \nIt's also more, much more, than familiarity.   \n   \n\\> there are far enough beautyfull textfaces arround.   \n   \nYou think so? Well, even so, beauty changes all the time - fortunately!   \n   \nOn top of that, readability has a lot more to do with our reading \"hardware\" than beauty. And I think designers haven't been doing much (especially not recently) to push the envelope of functionality. This is probably because there's practically no money in it, and capitalism is getting fatter by the minute.   \n   \n\\> You dont get paid for bookfaces   \n   \nYes, that is a sad truth. Certainly in retail (as opposed to custom commissioned work) there is zero market.   \n   \nMy solution? Simply remove money from the equation!   \n   \n\\> nobody wants to read long text nowadays   \n   \nI think \"nobody\" is too strong.   \n   \n\\> question any rule I try to formulate.   \n   \nYes, that's very important.   \nBut it's also important to try to answer the questions and refine our views, instead of giving up, no?   \n   \nhhp\n\n"
    },
    {
      "time": "29 Apr 2002 — 1:31pm",
      "content": "Hi Hubert. I do not have any specific use for your fonts at this time but I am a busy designer and I sell clients on certain fonts if I think they are good for a project. Your work is obviously in that category. One project I think it would be great for is in negotiations.I am not able to discuss this yet but I will get back to you via email on that later if anything come out of it. I have some work of my own on typophile you may like as we have similar taste. Check out Unicratica in the critique sans section. It is only caps at this time but it will be a full family hopefully sooner than later. I would welcome your critique of this.   \nI have noticed reference to your work on typophile on a few occasions yet we don't have any of it in the critique section so please upload some images of your work if you like.\n\n"
    },
    {
      "time": "29 Apr 2002 — 11:39pm",
      "content": "\\> I have just started to less discuss verbaly and do more typefaces   \n   \nI could learn from that myself! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "29 Apr 2002 — 12:56am",
      "content": "Hello everybody,   \nThis is indeed june, one of my typefaces.   \nBut the thing is that I never gave a licence to W-magazine. the serif version is hardly licenced to anybody yet. So I would be thankful if you give me more information about the issues it has been used in, because in germany I hardly can get hold of W-mag.\n\n"
    },
    {
      "time": "29 Apr 2002 — 4:46am",
      "content": "Hi, Ole   \nIf you try to sell the font throu foundries it's nearly impossible to find out who's allowed t use the font. In my case I know, because evervbody who wants to use it has to ask me. By the way I fond out that w-mag is part of fairchild publishing which also publishes Details. So the connection is clear. But I have to talk to them, because we never agreed on the usage in w-mag. The g is just the character I really like. I always try to do something different. The g i used in June is maybe in 2 different fonts as well, but there are a varienty of oher forms used in my fonts. I dont want to get stuck in to much of a style.   \nThere are only two licences of June yet. One was limited down to just on print of an art cataloque in Denmark and the other is for Details. They might want to have an exeptional licence, thats why I did not give it to anyone else.   \nBut tell me what you are working on and how you want to use it, we might find a way\n\n"
    },
    {
      "time": "29 Apr 2002 — 10:15am",
      "content": "Hey Hrant,   \nIf you have seen my webpage you know that I worked quite much in Branding. there is a demand of new especilly sans typefaces (June was first designed in sans, one of the samples shown in the forum is teh sans bold version). But there it is quite usfull to have a big x-hight. I was not to keen to have a typeface for very long copy, but in the cataloque I was talking about earlier it was used in 8p and even 6p and it worked quite well. I have a very traditional typografic backround and I heard about all those legebility stuff over and over again. At the end you never really know why it workes or not. A big part is to get used to an alphabet. Sometimes, when I design a typeface I lose the overall picture of it, because I'm to much into the details. Later it is very strange to see a printed sample.\n\n"
    },
    {
      "time": "29 Apr 2002 — 11:29am",
      "content": "Hey Hrant,   \nyou know, thats what I mean with legibility stuff.   \nJune workes also for longer copy and on a wide column believe it or not.   \nshow me a few of your textfonts.   \n   \nHave you had a look at my webpage?   \nwww.hubertjocham.de   \nHubert\n\n"
    },
    {
      "time": "29 Apr 2002 — 12:54pm",
      "content": "dear Hrand,   \nAgain readability is more than x-hight. Books are one part and there are far enough beautyfull textfaces arround. You dont get paid for bookfaces and sad but true, nobody wants to read long text nowadays. Hardy a book-publisher asks you to design a typeface. I dont take my typographic statements to serious, although I have studied Latin typefaces quite intensive. Every face I do has got some irony in it. Typography in the last 4 centuries has been full of stupid tendencies and very many typographers have been totaly anal. I dont want to be like that and thank god I know loads of different designers I work with, that always question any rule I try to formulate. I love practical work it humbles me every day.\n\n"
    },
    {
      "time": "29 Apr 2002 — 11:28pm",
      "content": "Hrant,   \nI have not given up, I have just started to less discuss verbaly and do more typefaces.   \nI had a look at your latin face:   \nVery crafty, very emotional, for me a bit to sentimental when I think of projects to use it in.   \nmaybe a bit narrow. Some things I like and some, like the g I would never do.   \nI have not seen it in copy but I think it does not work in longer text, to many fancy bits.   \nBut maybe that is a strong character.   \n   \nHey Ole,   \nI'm looking forward to the project and I'll have a look at your typeface.\n\n"
    }
  ]
}
