{
  "id": "49228",
  "title": "First Font exercise: Sans Serif- UPDATED - feedback required",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello everybody,\n\nIn an attempt to learn the process of font design I tried to practice and generate a simple helvetica-like sans serif type for my own use. There is much work to do - most shapes require work I am aware of that. I would like to get some feedback if possible. I know some letters are irregular (unequal stem width etc.)...\n\nThanks in advance for any feedback.\n\nUPDATE (10/22/08):  \njust a sketch to get an idea where this is heading.\n\n ![](http://web.archive.org/web/20130817170930im_/http:/typophile.com/files/test-v5vtt_5797.PNG)\n\n| Attachment | Size |\n| --- | --- |\n| [test-v5-2.pdf](http://web.archive.org/web/20130817170930/http:/typophile.com/files/test-v5-2.pdf) | 27.73 KB |\n\n",
  "author": "pinguin",
  "time": "8 Sep 2008 — 10:26am",
  "uid": "35228",
  "comments": [
    {
      "time": "8 Sep 2008 — 11:09am",
      "content": "You've done a nice job of evening out the character weights. As an exercise, I think it's already a success! If you want to push it further...\n\nMonolines can be _tough_. Getting that stroke weight optically consistent should be your first priority.\n\nIt does look an awful lot like Helvetica. I think you could afford to take some more liberties, go a little crazy, then pull it back.\n\nThe vertical cut on the arms of the K and k is at odds with the rest of the terminals (maybe this feature is something you can play with to differentiate your typeface from other monolines). The hook on the G, and to a degree the tail of the Q, feel a little more forced than the rest of your solutions; they might warrant a little more sketching.\n\nKeep going and keep learning!\n\n"
    },
    {
      "time": "8 Sep 2008 — 1:36pm",
      "content": "Thank you for the comments.\n\nI will try to incorporate your advice. The vertical cut in k, K was deliberate although I am aware that it might not fit well with the other letters.\n\nCurrently I am struggling with the Beziers...I have some difficulties controlling them and making smooth curves. After that I will definitely try to give the fonts a more distinctive appearance. I used TypeLight (Type 2.2 free version) and most of the fonts were drawn using Truetype points, initially mostly by eye, and then tried to measure the fonts dimensions and make them equal - so the the results are not yet satisfactory.\n\nP.S. One of the things I tried to do is to give some of the fonts a more squared appearance - this is not really visible very well at small sizes.\n\n"
    },
    {
      "time": "11 Sep 2008 — 10:05am",
      "content": "The first thing that flagged to my eyes were the bowls and round elements that rest on the baseline {a,b,c,d,e,g,o,p,q,s,u}. Typically the rounded characters rest slightly below the baseline, or slightly above the x-height or cap-height. They look unintentionally forced to me.\n\nThe vertical chop on the k's arm looks kind of lonely, maybe incorporate that in some of the other terminals somehow.\n\n"
    },
    {
      "time": "12 Sep 2008 — 9:04am",
      "content": "Thanks for the comments Eric. You are right about bowls and round elements.\n\nI intentionally tried to align them with the baseline/x-height. This was because when using the font in Microsoft Word, some of bowls/curves (at certain font sizes) were rendered very distorted. I did not known how to correct for this and I though that changing the alignment with the baseline/x-height might solve the problem which it did not.\n\nIn any case I would be very curious how one should draw the outlines to avoid situations like the ones indicated in the image bellow (Word snapshot with font displayed at various sizes).\n\n ![](http://web.archive.org/web/20130817170930im_/http:/typophile.com/files/Test_carpathica-sans_version%204b_WORD_6736.PNG)\n\n"
    },
    {
      "time": "12 Sep 2008 — 10:15am",
      "content": "Most Microsoft programs don't support anti-aliasing, which is why solid pixels are replacing the top curves.\n\nIf this font is for screen application, you should be editing it in Bitfonter ( [http://www.graphics.com/modules.php?name=News&file=article&sid=2675](http://web.archive.org/web/20130817170930/http:/www.graphics.com/modules.php?name=News&file=article&sid=2675))  \nI haven't personally used this program, but it looks like it has all the necessary features to manually change the mishap that is occurring in your font.\n\nIf it is meant for print, then it should be of little concern to you how it looks on screen as long as the printed resolution maintains the integrity of the forms.\n\nI hope this helps! Your project sounds exciting...being un-relient on someone else's translation of Helvetica! Keep it up.\n\n"
    },
    {
      "time": "12 Sep 2008 — 11:14am",
      "content": "I would like to have the font perform well both in print and on screen.  \nAt the moment I will continue working on improving the shapes and getting them as far as possible from the Helvetica pattern then I will try optimizing on screen appearance. I also placed this question(screen rendering) as a separate tread on the general discussion forum - [http://typophile.com/node/49391](http://web.archive.org/web/20130817170930/http:/typophile.com/node/49391 \"http://typophile.com/node/49391\"). Thanks again Eric.\n\n"
    },
    {
      "time": "14 Sep 2008 — 10:30am",
      "content": "I think that you’re getting into an Arial situation, and I’ll elaborate. Erik Spiekermann likes to point out that, for what it is, Helvetica is perfect. Arial is a knockoff of Helvetica, and a knockoff of perfect must be imperfect. You’re doing the same thing the Arial team did: trying to make a font with Helvetica’s character by making a bunch of semi random tweaks to the letters. And what you’re creating here is a mutilated Helvetica.\n\nI know that you’re doing this as a learning experience, but I think you’re getting into a negative feedback loop, because to refine you can’t really do anything but hack and tweak You’re putting all of your energy into trying to force something good and original to come from modifying Helvetica instead of doing something that allows you to really focus on coming up with something that just works on its own.\n\n"
    },
    {
      "time": "15 Sep 2008 — 9:09am",
      "content": "Thanks for the comments James.  \nI am definitely aware of the \"Arial situation\". I agree with you on some of the concerns raised and I really appreciate your input.\n\n\\>\\>\"Erik Spiekermann likes to point out that, for what it is, Helvetica is perfect. Arial is a knockoff of Helvetica, and a knockoff of perfect must be imperfect. \"\n\nI am sure the issue has been overly discussed among professionals, however, I am really curious to what extent can we consider that a certain design has reached \"perfection\", and thus any further modifications would necessarily mean a departure from the ideal form - in other words a closed matter. I would like to read more about this issue.\n\nPersonally, I do tend to favor the idea that this is quite a relative matter. I might be wrong, as I do not have formal training in this area, but I think that terms such as \"perfect\" may be too rigid for describing a type. While one could say that a certain shape is perfect from a technical standpoint there is also a lot of subjectivity in appreciating its aesthetics.\n\nWhile I agree with you that modifying a masterpiece has little chance to lead to another one, we also know that most beginners start by imitating them. From the little I know of type design I kind of get the impression that many of the fonts that are used today have \"evolved\" from other pre-existent designs. That kind of makes me think that type design can be subject to \"evolution\". On the other hand it might be true that the Arial Team did not intend at all to further refine and develop the \"Helvetica design\" but just to have a slightly modified \"clone\".\n\nWhile it is true that I had Helvetica in mind when I was drawing the shapes, I freely drew them without any external visual help. As a consequence version 1 came out almost identical to Helvetica (excluding at this point the fact that there are a lot of technical problems).\n\nThat in fact adds support to your theory, in the sense that when having a certain pattern in mind and trying to get the \"perfect\" shape you end up in the same place. On the other hand it can also mean that we are so used (\"conditioned\") to this shapes (we can draw them from mind) that we consider them perfect.\n\n\\>\\>\"I know that you’re doing this as a learning experience, but I think you’re getting into a negative feedback loop, because to refine you can’t really do anything but hack and tweak\"\n\nI am not sure whether you are saying that the particular modifications that I made are bad, or you just think that anybody who will try to do such a thing will end up \"mutilating\" Helvetica.\n\n\\>\\>\"You’re putting all of your energy into trying to force something good and original\"\n\nAs a beginner, I would really appreciate some feedback on the original aspect of Helvetica. From what I read it appears to me that Helvetica was also designed based on a previous type. Just for curiosity i put together several fonts including Helvetica Arial, and Akzidenz Grotesk (that I think preceded Helvetica). Arial looks almost indistinguishable from Helvetica, and Akzidenz also looks very similar to me. I added the first and fourth versions of my font, and included a detail of version 4 at the bottom (vs Helvetica light) for you to compare - pointing out certain elements that were consistently changed for all glyphs.\n\nThanks for input, and I hope that with more practice I can reach a point were the font will not look just like a collection of semi-random tweaks.\n\n ![](http://web.archive.org/web/20130817170930im_/http:/typophile.com/files/SansSerifs_comparison-2_5915.PNG)\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:30am",
      "content": "With all the rounding off it looks like it's heading more towards [Blur](http://web.archive.org/web/20130817170930/http:/www.myfonts.com/fonts/fontfont/ff-blur/medium/) than Arial...\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:49am",
      "content": "Thanks for the remark, Eliason. I have to tell you that I never heard of that font....and on a lighter note, I never heard of a Blur situation either, so it seems I am ok...\n\nI guess i would have to go back to Pica Pusher's comment above that \"Monolines can be tough\" and to think more about what James said...maybe this is an exhausted area and there is little to be done that has not been tried already...\n\n"
    },
    {
      "time": "18 Sep 2008 — 12:37pm",
      "content": "I have updated the font with a new version (see version 5). V5 is just a sketch. Please let me know what do you think ...I am just curious where is this going (or whether it is going anywhere)... Thanks in advance for all your helpful comments, Eliason, James, Eric, Pica and everybody that took the time to comment..\n\n"
    },
    {
      "time": "18 Sep 2008 — 3:18pm",
      "content": "This isn't about the font design, but I would left- (rather than full-) justify your paragraph samples.\n\n"
    },
    {
      "time": "22 Oct 2008 — 10:44am",
      "content": "Thanks eliason. I left-justified the text and uploaded a modified version.\n\n"
    }
  ]
}
