{
  "id": "49222",
  "title": "Anyone want to review my portfolio before submitting?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey Everyone,\n\nI'm going to be submitting my portfolio, a few links, and my resume for a job this week and wanted to have some members here go over part of it.\n\n[http://www.rosem.com/work/portfolio/](http://web.archive.org/web/20120720132519/http:/www.rosem.com/work/portfolio/ \"http://www.rosem.com/work/portfolio/\")\n\nI'm basically looking for any feedback/suggestions along with typos, etc...\n\nIt's for a Web Development job, but I thought I would add this section which shows more of my print design work.\n\nThanks,  \nMike\n\n",
  "author": "rosem",
  "time": "8 Sep 2008 — 8:47am",
  "uid": "14030",
  "comments": [
    {
      "time": "8 Sep 2008 — 9:29am",
      "content": "Your navigation arrows are very hard to see. I almost missed them entirely. I would make it navigable by clicking on the picture, also, if you can't lighten the arrows.\n\n"
    },
    {
      "time": "8 Sep 2008 — 9:43am",
      "content": "If you go to [http://www.rosem.com/work/](http://web.archive.org/web/20120720132519/http:/www.rosem.com/work/ \"http://www.rosem.com/work/\") you get to see the entire directory structure and get an access to a lot of different works and files that might not be intended for visitors. Might be a good idea to create a blank index.html there.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20120720132519/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "8 Sep 2008 — 10:11am",
      "content": "I could see the arrows, but maybe I was a bit influenced by just reading Sharons comment.\n\nI think it looks nice. It's clean. It was very fun to see the logos that you've posted on here before for critique.\n\nIf anything I might work on some of the comments about the work. I'm not sure at this point it really adds to the work. I'd suggest either using more in-depth commentary or just leave it totally basic, like just use the company name that the actual design was for.\n\n"
    },
    {
      "time": "8 Sep 2008 — 10:24am",
      "content": "Agreed, comments/titles removed.\n\n"
    },
    {
      "time": "8 Sep 2008 — 11:21am",
      "content": "Nice works. And — That sure seems like a smooth flash showcase. _(Did you base it on an existing system or create it yourself / from scratch, if I may ask?)_\n\nDav\n\n"
    }
  ]
}
