{
  "id": "49279",
  "title": "Jewelry designer logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all, wanted to post what I think is the final mark for a jewelry designer I'm working with. Her studio is called Aubrey Ellen, she creates handmade pieces from semi-precious and precious stones and is looking at moving into doing custom design for bridal parties.\n\nI explored tons of different directions and this is the final iteration of my script-y explorations, which are very much [b]not[/b] my strong suit. I tried a variety of hand-lettered forms, none of which had the refinement needed, and then started looking for typefaces that had some of the forms I was looking for. The working name is Aubrey Ellen, this is a slight reworking and connection of a font called Jeffriana into a sort of A and e ligature. Very open to any feedback you have, as well as ideas for a typeface to pair with this for the name (which I think will be Aubrey Ellen Fine Jewelry, still finalizing that). Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [ae.gif](http://web.archive.org/web/20120622231912/http:/typophile.com/files/ae.gif) | 3.12 KB |\n\n",
  "author": "cfig",
  "time": "9 Sep 2008 — 2:32pm",
  "uid": "27157",
  "comments": [
    {
      "time": "9 Sep 2008 — 3:46pm",
      "content": "The curve that connects the A to the e isn't consistent. And overall, I see more of (weird loop) fe than Ae. Maybe if the e were raised a bit so that it fit nicely into the white space between the top and bottom loops on the A? Other than that, I like.\n\n"
    },
    {
      "time": "9 Sep 2008 — 5:21pm",
      "content": "I think the bottom-right loop on the 'A' should loop back into it's crossbar smoothly. This looks off to me right now as I like the way the whole 'A' is one, almost symmetrical stroke.  \nThe 'e' is a bit small for the 'A'. It would seem by looking at the name, Aubrey Ellen, that Ellen should have as much emphasis, so I would make the 'e' much bigger.\n\n"
    },
    {
      "time": "10 Sep 2008 — 7:44am",
      "content": "Thanks for the feedback guys. This was my rough attempt just sort of laying the forms over each other, I'm breaking apart the typeface now and working on getting the lines to flow better and I'll definitely take your comments into account.\n\njayyy, I've gone back and forth on the a/e relationship, I'll try some options and see what may work. Appreciate the crit.\n\n"
    },
    {
      "time": "11 Sep 2008 — 9:58pm",
      "content": "there's an existing ligature that could work wonders here.\n\nit holds its own in the classy stakes?\n\n ![](http://web.archive.org/web/20120622231912im_/http:/typophile.com/files/ae_3818.jpg)\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20120622231912/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "12 Sep 2008 — 12:05am",
      "content": "Looks like a good opportunity for an ambigram.\n\n"
    },
    {
      "time": "12 Sep 2008 — 5:56pm",
      "content": "thanks guys. Paul, I played with the ligature idea but felt like there were a lot of AE logos out there I wanted to clearly differentiate from. Every sketch in that vein I did was met with \"it looks like American Eagle\" even though it really bore very little resemblance. I explored the ambigram a bit as well but hand-rendered type is very much not my strong suit, didn't get anything very successful out of it.\n\nI'm working on this while I have power before the hurricane hits, so I'll check back in when I can :)\n\n"
    },
    {
      "time": "12 Sep 2008 — 10:03pm",
      "content": "stay safe.\n\ngood luck.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20120622231912/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "12 Sep 2008 — 10:17pm",
      "content": "A few random ideas...\n\n ![](http://web.archive.org/web/20120622231912im_/http:/typophile.com/files/ae_4161.gif)\n\n"
    },
    {
      "time": "13 Sep 2008 — 2:44am",
      "content": "from what i know a ligature is a way to a fusion of two or more letters. that that you're doing... i think it isnt correct... i would take more attention to that like... doing that with just \"one\" stroke, with the pencil always on the paper.  \ni dont know the english expression to this...\n\nJoel Santos // yrmk  \nsound & visual\n\n"
    },
    {
      "time": "17 Sep 2008 — 12:31pm",
      "content": "The mark of Adobe Acrobat comes immediately to mind when I look at this solution. And I would add that that the studio’s name must be used in full, unless this is just one half of the final trademark. If it is, let's see both word and mark together.\n\n"
    },
    {
      "time": "18 Sep 2008 — 3:15pm",
      "content": "Ok, I'm alive with things more or less intact, have power back and no real damage. It's been a bit of a crazy week to say the least.\n\nJoel, if I get what you're saying you want it to be one continuous stroke? I don't disagree, I'm working on that with the (hopefully) final version).\n\nJoshua, I've noticed the resemblance as well but I don't think I'm worried as it's a totally different application and really a fairly abstract form to start with. I do realize the type is a major part of the identity but wanted to develop the mark first before letting the type influence it. I am looking to see how i'd like to use the name with it and hope to have some ideas with that in the next day or two. Thanks for the feedback.\n\n"
    },
    {
      "time": "20 Sep 2008 — 6:57am",
      "content": "Yes... i had a project sometime ago that faced mostly the same problems the solution i found was to pick up a marker and put a white paper (a2 size) on the table and just with arm half stretched draw everything in one stroke...  \nthe best way for you to accomplish that and see how it works is to draw and get out of the computer...  \nmy opinion of course...\n\nJoel Santos // yrmk . visual\n\n"
    },
    {
      "time": "3 Nov 2008 — 3:01pm",
      "content": "I see Adobe Acrobat as well... but something handwritten like that in the layout of zevbiz's would be slick.\n\n"
    }
  ]
}
