{
  "id": "49277",
  "title": "OpenType font naming in FM",
  "forum": "Build",
  "tags": [

  ],
  "content": "For those who are interested in how OpenType font naming can be handled in FM, I just published a [PDF](http://web.archive.org/web/20081201175746/http:/www.fontmaster.nl/pdf/FM_docs/Name_table_entries.pdf) on this subject. Also some details are revealed on how the automatic generation of OpenType Layout features is handled. At the coming [FM Track](http://web.archive.org/web/20081201175746/http:/www.fontmaster.nl/pdf/FM_docs/FM_Track_2008.pdf) in St. Petersburg more info will be given, also on OT Master.\n\n [‹ Class-based kerning questions](http://web.archive.org/web/20081201175746/http:/www.typophile.com/node/49274 \"Go to previous forum topic\") [Inkscape now integrates Spiro ›](http://web.archive.org/web/20081201175746/http:/www.typophile.com/node/48924 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201175746/http://www.typophile.com/user/1688\" title=\"View user profile.\">blokland</a>",
  "time": "<br>",
  "uid": "1688",
  "comments": [
    {
      "time": " 9.Sep.2008 2.26pm",
      "content": "Thanks, Frank!\n\nChrisL\n\n"
    },
    {
      "time": " 9.Sep.2008 11.33pm",
      "content": "Frank,  \ncheck out page 14  \n<cite>TTName 2 3 1 0x409 “Regular”; #Macintosh</cite>  \n“#Macintosh” is wrong here, this might lead to confusion ...\n\n"
    },
    {
      "time": " 10.Sep.2008 1.15am",
      "content": "‘[...] check out page 14  \nTTName 2 3 1 0x409 “Regular”; #Macintosh [...]’\n\nYes, I noticed the wrong comment, but most readers will probably understand what should have been written there. Nevertheless I will change the page shortly.\n\nPerhaps I should add here to the info in the PDF that at DTL we normally edit the name IDs directly in the UFM files using a text editor. Not only ‘basic’ name IDs, like copyright notice, manufacturer name, URLs and license description can be simply copied into the UFM files, also the complete UFM files can be copied and internally renamed (in batch) for weight/style related fonts of the same family that support for instance other scripts (every font has its own UFM and kern file, which are connected by file name to the corresponding glyph database).\n\nFor the OpenType production normally a centralized ‘standard’ OT layout features file is used (features that don’t match the character set are removed during font generation), but when the features file is specifically customized it could make sense to put the font names in the file itself (if only to mark the file).\n\n"
    }
  ]
}
