{
  "id": "49282",
  "title": "[P22] Neu & Sale fonts for September",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20081013172947/http:/typophile.com/user/7006 \"View user profile.\") : 9.Sep.2008 2.44pm \n\n- New Platten Neu Family  \n— Michael Clark Script font sale  \n—- New TypeCaster!\n\nIntroducing — Platten Neu\n\nThe P22 Platten font family has been revisited and expanded by designer Colin Kahn. Platten is based on lettering found in German fountain pen practice books from the 1920s (you may have seen the similar Speedball books in the US). This round tip pen lettering is comparable to the basic forms used in grammar school teaching alphabets, but with a few original characteristics. The Italic version has even more of these unusual features. Geometric & simple yet casual & timeless. Perfect for many uses.\n\nP22 Platten Neu includes 6 Pro fonts (Light, Regular & Demibold) with many alternates and ligatures (over 500 glyphs in each font) in Roman & Italic with expanded Central European language coverage and Smallcaps (Roman only). Pro fonts are $39.95 each, non-Pro fonts are $19.95 each.  \n [http://www.p22.com/ihof/plattenneu.html](http://web.archive.org/web/20081013172947/http:/www.p22.com/ihof/plattenneu.html \"http://www.p22.com/ihof/plattenneu.html\")  \nSet of 6 Pro fonts, with 9 non-Pro fonts included: $129.95 Special Introduction price for the month of September -$89.95!\n\n——————————  \nA new, monthly feature on p22.com will be a revisiting of P22 fonts you may have missed.\n\nSweepy, Sneaky & Pooper Black  \nNo, not 3 of Snow White’s sidekicks, but rather 3 related script fonts from Calligrapher Michael Clark.\n\nPooper Black is based on a brush ethic and has an extreme axis that lends a certain amount of speed to the font while the lack of connectors “slows” it down. A wonderful face for packaging, titling, and short burst of text.  \nPooper Black has been seen takin’ care of business on shop ads and food packaging.  \n [http://www.p22.com/ihof/pooper.html](http://web.archive.org/web/20081013172947/http:/www.p22.com/ihof/pooper.html \"http://www.p22.com/ihof/pooper.html\")\n\nSneaky is a connecting-script and sibling of Pooper Black that shares a similar flow and casual elegance. It features shared details and relative size so that with careful design, the two can be mixed and matched.  \n [http://www.p22.com/ihof/sneakypro.html](http://web.archive.org/web/20081013172947/http:/www.p22.com/ihof/sneakypro.html \"http://www.p22.com/ihof/sneakypro.html\")\n\nSweepy (winner of a Type Director Club 2006 award) is a lighter, and connecting version of Sneaky. Sweepy is a brush script that is casual and fluid. In the expanded OpenType version Sweepy is loaded with alternate characters and ligatures that offer more flexible lettering options.  \n [http://www.p22.com/IHOF/sweepy.html](http://web.archive.org/web/20081013172947/http:/www.p22.com/IHOF/sweepy.html \"http://www.p22.com/IHOF/sweepy.html\")\n\nGet them individually for the month of September for 20% off regular price Or get them all in one package for additional savings!  \nP22 Pooper Black, P22 Sweepy OT, P22 Sneaky Pro Regularly $79.85- only $49.95! ends Sept 30 [http://www.p22.com/products/monthly.html](http://web.archive.org/web/20081013172947/http:/www.p22.com/products/monthly.html \"http://www.p22.com/products/monthly.html\")\n\n—————  \nThe P22 type preview tool, the TypeCaster has been revamped for easier previewing and better resolution. Now you can zoom in as well as out to see any given font in any given size with any of your own text. Give it a try!  \n [http://www.p22.com/products/typecaster.html](http://web.archive.org/web/20081013172947/http:/www.p22.com/products/typecaster.html \"http://www.p22.com/products/typecaster.html\")\n\n—————  \nBest wishes!  \nP22 type foundry  \n [http://www.p22.com](http://web.archive.org/web/20081013172947/http:/www.p22.com/ \"http://www.p22.com\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20081013172947/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 9.Sep.2008 2.44pm",
  "uid": "7006",
  "comments": [

  ]
}
