{
  "id": "49315",
  "title": "Embedding fonts in web pages?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Did some searches, Im actually baffled as to which search terms to use...\n\nHow would I embed unconventional fonts into a web page, much like the headings on this forum are? I want to use various Opentype fonts in web page that are selectable, and spiderable by search engines like Google. Even if the viewer doesnt have the font installed on their system, I want them to be able to see it. Is this possible?\n\n",
  "author": "seekay",
  "time": "10 Sep 2008 — 2:15pm",
  "uid": "36633",
  "comments": [
    {
      "time": "10 Sep 2008 — 2:35pm",
      "content": "You should google search \"sIFR\". It is the only way to really do what you want if the font is very unique.\n\n"
    },
    {
      "time": "10 Sep 2008 — 3:02pm",
      "content": "SiFR is the only generally usable way today that works with most browsers.\n\nThere are movements afoot to allow HTML/CSS to either refer to regular desktop fonts on web servers (supported by Safari and perhaps Chrome) or to EOT fonts on web servers (supported by Internet Explorer).\n\nT\n\n"
    },
    {
      "time": "10 Sep 2008 — 4:19pm",
      "content": "I don't understand how this works.\n\nDoes the web page require to be displayed in a certain font in order to be viewed by the viewer. Then, a freely distributed font is downloaded to be then installed by the user. After the font is installed, only then the web page can be viewed?\n\nOr does this process occur automatically?\n\n"
    },
    {
      "time": "10 Sep 2008 — 6:20pm",
      "content": "Hmm, okay, for all you Flash people: How does sIFR compare to using Flash document featuring:\n\n- Dynamic text  \n- Embedded characters  \n- Configured as selectable  \n- Configured to be rendered as HTML\n\nI just used this method to create text on a webpage that behaves much like regular text. Apparently Google (and others, including Yahoo!) are now indexing .swf files.\n\n"
    },
    {
      "time": "11 Sep 2008 — 6:12am",
      "content": "SiFR is a very smart tool. Your html source-code is not flash but just xhtml:\n\nFrom the sIFR website:  \n<cite><br>\nYour (X)HTML document starts off with its standard styles. Then, once sIFR determines it will run, your html and body tags are classed with “.sIFR-hasFlash”. This is done in order to accomplish two things: 1) to hide your browser text as the method is running, and 2) to create “decoy” styles for the text you are replacing. Decoy styles are never seen by the user. They are meant to adjust the space the browser text takes up before the measurement and replacement occurs.<br>\n</cite>  \n [http://www.mikeindustries.com/blog/sifr/](http://web.archive.org/web/20120720132951/http:/www.mikeindustries.com/blog/sifr/ \"http://www.mikeindustries.com/blog/sifr/\")\n\nSo, there is no need for the search-engine to index flashfiles...\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20120720132951/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "11 Sep 2008 — 6:49pm",
      "content": "SiFR is an amazing hack. But it is a hack. There are serious performance issues for doing large amounts of text with it. Even some fo the co-inventors of SiFR have said publicly that they just see it as a stop-gap until something more reasonable is implemented.\n\n@Go: Yes, it's all automatic, when it is supported.\n\nT\n\n"
    },
    {
      "time": "13 Sep 2008 — 2:28am",
      "content": "On Flash, i think the best way is to embed the characters that you're going to use! Of course... for Dynamic texts and so. For static text there is no need for embed... so... the really best way... is to avoid! ehehe maybe adobe and the html developers and so will find a way to embed the font on the website without performance issues!\n\nJoel Santos // yrmk  \nsound & visual\n\n"
    },
    {
      "time": "14 Sep 2008 — 12:36am",
      "content": "SiFR _is_ flash, generated by a javascript-solution that works fine for headlines. There is also image-based generated solutions with php etc. but this is also just working for headlines and shorter texts.  \nFor longer texts I don't think there is no other way to go than flash, if you want a bit more typographic and anti-aliasing control than in html based text. To get text in flash avalible for search engines, the best way I think is to add the text as a comment in the html document that holds the flash file.\n\n"
    },
    {
      "time": "15 Sep 2008 — 7:18am",
      "content": "\"How does sIFR compare to using Flash document featuring:\"\n\nsIFR, for many, is less annoying and more accessible/usable that doing the entire site in flash.\n\n"
    }
  ]
}
