{
  "id": "49368",
  "title": "Zaph for Windows?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So I own a PC, And the only thing that I regret is that it didnt come with any of the Zaph fonts such as Optima. So I wanted to ask if there was a way that I could get them for my PC?  \nYour help would be greatly appreciated.\n\n~Cody\n\n",
  "author": "Cody",
  "time": "11 Sep 2008 — 5:46pm",
  "uid": "35752",
  "comments": [
    {
      "time": "11 Sep 2008 — 5:57pm",
      "content": "You can license them from [Fontshop](http://web.archive.org/web/20131017025012/http:/www.fontshop.com/search/?q=optima&x=0&y=0).\n\n"
    },
    {
      "time": "11 Sep 2008 — 6:14pm",
      "content": "Also, if you buy Corel Draw or Wordperfect Suite, a number of Zapf (or their Bitstream equivalent) fonts are included.\n\n"
    },
    {
      "time": "11 Sep 2008 — 6:41pm",
      "content": "Windows has come with Palatino Linotype for the past eight to ten years.\n\n"
    },
    {
      "time": "12 Sep 2008 — 12:42pm",
      "content": "Of course, there's nothing wrong with licensing the real typeface. However, doing a Google search for\n\nmgopen site:typophile.com\n\nwill bring up a typophile node that mentions the mgopen fonts, which include a font similar to Optima. I haven't ever really looked closely at the quality of MGOpen Cosmetica, but I believe it is more ethical to go with an open source option than to go with downloading a pirated version of Optima.\n\nFor non-commercial use, there is also a URW version of Optima in the fonts released with GhostPCL:\n\n[http://www.artifex.com/downloads/](http://web.archive.org/web/20131017025012/http:/www.artifex.com/downloads/)\n\nHere are some other Google searches you can perform to find Typophile information on good \"free\" fonts, in all the meanings of that word. I suggest the google searches because some of the internal typophile links to its own wiki pages seem to be out of date.\n\ngood libre fonts site:typophile.com\n\nfaq free site:typophile.com\n\nst\n\n"
    },
    {
      "time": "12 Sep 2008 — 7:47pm",
      "content": "\\>I believe it is more ethical to go with an open source option than to go with downloading a pirated version of Optima.\n\nThe type designer may think otherwise. In downloading at least the thief shows that they value and respect the work enough to pilfer it, rather than going with a forgery that someone wasn't even paid to produce.\n\n"
    },
    {
      "time": "13 Sep 2008 — 7:48pm",
      "content": "<cite>The type designer may think otherwise. In downloading at least the thief shows that they value and respect the work enough to pilfer it, rather than going with a forgery that someone wasn’t even paid to produce.</cite>\n\nMy understanding of the fonts from URW and from the MGOpen collection was that they were typefaces released under fairly \"free\" terms from reputable sources. I apologize if it wasn't clear that I was limiting my comments to these particular options in this particular case.\n\nIn general, I know that the question of when a look-alike typeface is a forgery and when it is a legitimate copy done by a legitimate foundry is one that has come up here before, and I certainly don't have enough knowledge to be able to add anything to that debate. I'm also not suggesting that being licensed as open-source is more important than quality of the typeface or whether someone was appropriately paid for their work.\n\nHowever, in this case I did try to do reasonable research into the origins of these typefaces. If my understanding of these particular typefaces is incorrect, I would certainly like to know it. When a good typeface that is created in an ethical manner is given as a gift in this way, I do feel it's appropriate to respect that gift by letting others know about it.\n\nst\n\n"
    }
  ]
}
