{
  "id": "49374",
  "title": "Suitability of OSF vs LF for different fields of writing",
  "forum": "Design",
  "tags": [

  ],
  "content": "In typographic circles, old-style figures (OSF) are generally preferred over lining figures (LF) for body text because they integrate better with lowercase letters. There seems to be a trend of returning to typographic elegance, so to speak, with many of the newly designed digital fonts having OSF as the default.\n\nHowever, there are certain fields where the use of OSF may not be appropriate. Zivatar, a lawyer, has asserted that OSF are not suitable for legal writing on a number of occasions, in the following threads:\n\n[Typography for Lawyers](http://web.archive.org/web/20081201162543/http:/typophile.com/node/49288)  \n [Advice for legal pleadings](http://web.archive.org/web/20081201162543/http:/www.typophile.com/node/37541)  \n [Typefaces for use in legal practice](http://web.archive.org/web/20081201162543/http:/typophile.com/node/41921)\n\nI invite people to comment on whether there are certain fields where one should be using LF instead of OSF, and what the reasons are. While it certainly makes sense to me that LF is better for certain technical fields of writing, I would still like to hear the rationale.\n\nFor mathematical writing, for instance, LF would be strongly preferred over OSF. One sees mathematical texts using LF not long after the introduction of LF to the typographic palette, such as 1822’s _[An Introduction to the Elements of Algebra](http://web.archive.org/web/20081201162543/http:/books.google.com/books?id=VeQGAAAAYAAJ&printsec=toc&source=gbs_summary_r&cad=0)_. I do not remember seeing any mathematical texts from the last century using OSF.\n\nI would venture there must be a few reasons beyond tradition and familiarity for this. For example, one frequently sees multiple levels of super- or subscripting in mathematical writing, and the alignment will be difficult to keep track of for OSF. Consider the following, where the expression on the left is meant to represent Exp(38). Because OSF are used, there is a chance it might be read as Exp(3^8), the expression on the right, especially by readers who are used to seeing LF in mathematical texts.\n\n ![](http://web.archive.org/web/20081201162543im_/http:/www.typophile.com/files/exp38_5745.gif)\n\nAlso, a LF zero is less likely to be confused with the letter o, which is used in the ’little o notation’, for example.\n\nWhat do people think about this issue? Are there other fields where LF may be preferred to OSF? What are the advantages and disadvantages each of these types of numerals provides for different fields of writing?\n\n [‹ Looking for a slightly modern, slightly decorative type...](http://web.archive.org/web/20081201162543/http:/www.typophile.com/node/49454 \"Go to previous forum topic\") [India style typo ›](http://web.archive.org/web/20081201162543/http:/www.typophile.com/node/49337 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201162543/http://www.typophile.com/user/12009\" title=\"View user profile.\">Jongseong</a>",
  "time": "<br>",
  "uid": "12009",
  "comments": [
    {
      "time": " 11.Sep.2008 10.49pm",
      "content": "[http://typophile.com/node/45260](http://web.archive.org/web/20081201162543/http:/typophile.com/node/45260 \"http://typophile.com/node/45260\")\n\n"
    },
    {
      "time": " 11.Sep.2008 11.51pm",
      "content": "Yes, I thought I’d regret saying that I don’t remember mathematical texts from the last century using OSF. I remember seeing that thread; I must have forgotten about it. I’d like to see more of that book and see if it uses multiple levels of super- or subscripting where OSF can cause confusion.\n\nOf course, all mathematical texts used OSF up till the late 18th century or so when LF were introduced, and a lot of those were beautifully designed. So I probably shouldn’t say OSF should never be used for mathematical texts. But as a reader of mathematical texts, I think I would strongly prefer to read those set with LF. I guess I’m still struggling to verbalize why OSF with mathematical texts are so distracting to me. Maybe in mathematical texts the goal is to set the numbers more apart from the surrounding text rather than harmonize them, the same reason variables represented with letters are italicized.\n\nThe OSF in the number tables of Nick’s thread don’t bother me at all. But when the OSF numbers are used alongside the text, they are somewhat distracting.\n\n"
    },
    {
      "time": " 12.Sep.2008 8.48am",
      "content": "Whether you view \\*typography\\* as an art or a craft, remember that both address an audiance, not a vacuum. Transfer your question to music. Is the pentatonic scale better or worse than the heptatonic scale for some uses? Of course: It wouldn’t be \\*real\\* Blues if you use the heptatonic scale.\n\nAudience expectations count, and need no further justification.\n\n"
    },
    {
      "time": " 13.Sep.2008 7.40am",
      "content": "Today, using old style figures is nearly nowhere seen in mathematics publication, but Gauthier-Villars, which was one of the main publisher of mathematical content in France up until something like the late 1950’s, used a Didot typeface with old style numbers at normal size and lining figures in exponents. Here’s a sample:\n\n ![](http://web.archive.org/web/20081201162543im_/http:/www.typophile.com/files/gauthiervillars_oldstylenum_3451.png)\n\n(This sample is from the _Formulaire pour le calcul symbolique_ by Mc Lachlan and Humbert, edited and printed by Gauthier-Villars in 1941.)\n\nConcerning suitability, confusion between an old-style zero and a lowercase O is more academic than anything else, as the context will make it clear which is which. I would be more concerned about the confusion between an old-style 1 and a capital I, especially if they appear in fractions (e.g. a display fraction with a 1 and a small piece fraction with a I).\n\n"
    },
    {
      "time": " 14.Sep.2008 7.00am",
      "content": "Even when the primary figures in a font are oldstyle in form, the numerators, denominators, superiors, and inferiors are generally lining in nature. I don’t know that I’ve ever seen oldstyle superiors (unless they were just scaled OsF).\n\n— Kent.\n\n"
    },
    {
      "time": " 14.Sep.2008 7.50am",
      "content": "<cite>I don’t know that I’ve ever seen oldstyle superiors</cite>\n\nCarter cut them in a C&C release of Galliard. Richard Eckersley use them for note calls in a few books, until several editors went apoplectic. He had some sympathy for breathing problems, & stopped.\n\n"
    },
    {
      "time": " 14.Sep.2008 11.07am",
      "content": "_I don’t know that I’ve ever seen oldstyle superiors_\n\nIn _The Coming of the Book_, Verso, 1984, set in Monophoto Garamond.\n\n"
    },
    {
      "time": " 15.Sep.2008 4.51am",
      "content": "I stand corrected.\n\nJust checked my GalliardCC and I see the alternate OS footnote superiors now, Charles. I overlooked those before.\n\n— K.\n\n"
    }
  ]
}
