{
  "id": "49385",
  "title": "Hebrew Type Designs",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": " ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/frank_scanned_25_4113.jpg)\n\nHere are [Hebrew](http://web.archive.org/web/20150414110851/http:/typophile.com/wiki/Hebrew) Type Design specimens from Mr. Raphael Frank's important little book on Hebrew type designs and its history, printed originally in German, and translated later into Hebrew. An English translation doesn't yet exist. His ideas and opinions are quoted in my English language book on Hebrew Typography.\n\nFrank's contribution to Hebrew type design was significant and influenced Jewish culture due to its enormous impact upon modern Jewish and Israeli societies. These samples include rarely used examples of different type style designs, demonstrating his intense love and knowledge of Hebrew type design.\n\nFrank designed and created the popular standard FrankReuhl type style. No other type design has been used to a greater extent for the Hebrew language in the twentieth century and beyond. In the eighteenth and nineteeth centuries, the Merubaas typeface, and its derivatives, were the book publishing stand typeface. Since then, it was replaced by FrankReuhl. Over the past fifty years, Hadasa, David, and Narkiss, have attempted to upsupt FrankReuhl's dominance and have failed.\n\n",
  "author": "gohebrew",
  "time": "12 Sep 2008 — 4:52am",
  "uid": "18444",
  "comments": [
    {
      "time": "12 Sep 2008 — 5:41am",
      "content": " ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/meruba_5199.jpg)\n\nThe first type specimen is called \"Meruba\", which means in Hebrew, square. This is not the common name associated for this design.\n\nWhy then did Frank refer to this design as \"Meruba\"?\n\n\"Meruba\" is both a very old and yet also a relatively recent design. Many hand-drawn books from hundreds of years ago appear with this typeface design, usually to present Biblical material.\n\nRelatively recently, the huge Romm family printing establishments in Vilna, Lithuania standardized their print jobs upon a version of this typeface design. Their popular printing of the Talmud for over a hundred years used it. Hundreds of other Torah books, including those of great Chassidic masters, used it. And even hundreds of non-Torah books of literature, poetry, Hebrew grammar, children's primers, and secular thought, used it as well.\n\nThere are two reasons why this design style is referred to as \"Merubah\", or square.\n\nFirst, the dimensions of the design is very wide and square-like. This is conducive to accurate reading, good comprehension, and overall clarity.\n\nAlso, the design in some ways is comparable to the type design of the style used in the Sefer Torah scroll. In fact, many laws are derived from aspects of the \"Merubah\" design that would invalidate the Sefer Torah scroll style of lettering.\n\nThe second reason is actually associated with all non-script Hebrew type designs, and not necessarily to the \"Merubah\" design. Here, the choice of the word \"Merubah\" simply means \"block letter\".\n\nIt is unlikely that Frank refered to this design because of the second reason. Clearly, the first reason accurately describes the most important aspect of the \"Merubah\" design, and seems to be the basis of Frank's intention.\n\n"
    },
    {
      "time": "14 Sep 2008 — 1:56am",
      "content": "Nevertheless, Frank revolutionized the Hebrew printing industry with his new bold FrankReuhl design.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/franksamp_4236.jpg)\n\nHere are two examples of the popular standard Hebrew design, created by Frank.\n\nThe top one, in regular and bold weights, is the most like the original design, with certain differences. A radical change was introduced by Varityper, a now extinct photo-typestting firm, later purchased by Agfa(-Compugraphic).\n\nThe type design was later revived for desktop publishing as an early Hebrew PostScript font by FontWorld, the leader in software products for professional typesetting of non-Latin laguages, such as Arabic and Hebrew.\n\nRecently, an early pioneer in desktop publishing software for foriegn languages, Linquists' Software, created an OpenType version for use in Biblical Publishing of a scholarly nature, in Micrsoft Word for Windows. It was incompatible with Adobe InDesign CS/3 ME.\n\nAnother example popular in Hebrew desktop publishing is Apple's New Pnimim, another knock-off of FrankReuhl. New Pnimim is based upon (Merganthaler-)Linotype's version of FrankReuhl. It contained many design differencs, depending upon the needs of metal type, which were varied besad upon the point size used.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/npsamp_5536.jpg)\n\n"
    },
    {
      "time": "14 Sep 2008 — 3:26am",
      "content": "Another example popular in Hebrew desktop publishing is FontWorld’s LinoNine, another knock-off of FrankReuhl, originally created by (Merganthaler-)Linotype, and FontWorld’s LinoTwelve, also originally created by (Merganthaler-)Linotype.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/linosamp_6171.jpg)\n\n"
    },
    {
      "time": "14 Sep 2008 — 3:33am",
      "content": "A sample of Raphael Frank's original FrankReuhl:\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/frank_hebrew_14_4155.jpg)\n\n"
    },
    {
      "time": "14 Sep 2008 — 3:56am",
      "content": "This was a major revision of the enormously popular standard at the time, \"Romm\", \"Merubaas\", \"Vilna\", or \"Siddur\".\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/ghromm_6346.jpg)\n\n"
    },
    {
      "time": "14 Sep 2008 — 4:59am",
      "content": "If we look carefully at these two designs, we can ask, what is different about them to cause such an upheaval in the Jewish printing industry?\n\nFirst, the proportions are very different. The \"Romm\" design is much wider than Frank's. This means, practically speaking, many more words per line typeset using FrankReuhl will fit in a given space. This is very economical to printers.\n\nOn the other hand, Romm is very wide, almost squarish. The letters are thicker. The results are much more conducive to repeated study.\n\nA sofer, Hebrew scribe, once explained the advantage of the Romm typeface. \"It has round soft edges,\" he said. \"I know what it means to look at letters for a long time. The design of this typeface is easy on the eyes. You can look at it forever, and yours never feel strain.\"\n\nRomm was designed for Bible and Talmud study, and the like. The prayerbook is typset in Romm. The Passover Hagada is typeset in Romm.\n\nWhen Frank lived, the Jewish world was abandoning traditional Jewish study, and going away from use of books typeset in Romm. Frank's design fit a gap, a need in Jewish society, that was different, and reformed of tradition. We see today that most secular literatures, newspapers, even pornographic writing use FrankReuhl.\n\nThis has been the norm for over fifty years.\n\nThe question is, with a revival called desktop publish, and a new font format excellantly geared for Biblical Hebrew, called OpenType, will the Romm design regain its status of dominance, particularly if multiple weights and widths of it appear to meet the needs of Jewish publishers today.\n\n"
    },
    {
      "time": "14 Sep 2008 — 5:21am",
      "content": "Since the creation of the State of Israel, many different designs have come on the scene. Some are used as display faces, some are used as text faces, and some are useda s an italic, for italic in general is not used in Hebrew.\n\nOther popular Hebrew designs\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/hebsamp3_6499.jpg)\n\n"
    },
    {
      "time": "14 Sep 2008 — 6:11am",
      "content": " ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/hsan1_6315.jpg)\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/hsan2_5289.jpg)\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/hsan3_4709.jpg)\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/hsan4_3848.jpg)\n\n"
    },
    {
      "time": "14 Sep 2008 — 6:28am",
      "content": "A popular display in Israel is Aharoni.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/Aharoni_5909.jpg)\n\nMany Israeli newspapers use Aharoni for their headlines. A narrow version of Aharoni exists, which news papers in Israel use for the headlines of minor articles.\n\n"
    },
    {
      "time": "14 Sep 2008 — 6:47am",
      "content": "Another very popular design is David, created by the great Israeli type designer, Mr. Itamar David a\"h. It is a script-like upright design, very unlike FrankReuhl. It's light, not as wide, and very readable. Until the advent of Narkis, David became an exceedingly popular design, second to FrankReuhl.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/David_3941.jpg)\n\nFontWorld created another version, called King David. Purchased by Apple, MasterFont created, Raanana, as yet another knock-off of David.\n\nMr. David created many other remarkable designs, such as Itamar, but David was his claim to fame.\n\n"
    },
    {
      "time": "14 Sep 2008 — 7:06am",
      "content": "Your question of why Frank Reuhl won out is an interesting one to me.\n\nBased on my own efforts to understand readability of roman text types, my guess would be that the ratio between counter and spacing is better in Frank Reuhl than in the older, wider styles, and that a better 'rhythm' resulted in higher readability in extended text.\n\n"
    },
    {
      "time": "14 Sep 2008 — 7:11am",
      "content": "Another very popular modern Hebrew design is Mr. Henri Friedlender's Hadasa, named after the printing school where he worked. Hadasa was created to be carved into stone on a new Israeli building. Friedlaeder resourched its design extensively, patterning it after motifs he took from very old Ashkenazic and Sephardic letter forms, and those of Bomberg and Soncino.\n\nGoHebrew's Henri is a faithful rendition of Hadasa, approved by Mr. Friedlander before he died. Another version was drawn for the Israeli distributor of Esselte/Letraset products. Very recently, a third design was designed by FontBit, called New Hadasa. Also, John Hudson's Adobe Hebrew was inspired in part by Hadasa.\n\nThe very popular ArtScroll Orthodox Jewish publishing house based in Brooklyn uses Hadasa exclusively for its books. Mr. Friedlaender cried when he learned that the Bible today is studied by millions of Jews in Hadasa.\n\nAlthough not as popular as David, Hadasa is a close third.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/Hadasa_6124.jpg)\n\n"
    },
    {
      "time": "14 Sep 2008 — 7:28am",
      "content": "\\> the ratio between counter and spacing is better in Frank Reuhl\n\nThis is true.\n\nTo peruse text swiftly, comprehension is certained enhanced. Perhaps, that is the main reason for its popularity and longevity.\n\nThe wide Romm design nevertheless is preferred for lengthy concentrated study. Rabbi Akiva Eiger zatzal even strongly endorsed the Romm family efforts to produce the Talmud over the previous publishers of Slovita, causing a decade long batter over which publisher has exclusive rights.\n\nRabbi Eiger cited that study would enhanced with this typeface, and for that reason it was justified to replace the publishers of Slavita.\n\nToday, new renditions of the Talmud are being produced, with the effort of Oz VeHadar leading the pact, followed by Zundel Berman Books. A third effort is being made by the Moznayim/Vagshall publishing house, for this very large market.\n\nA fourth competitor is GoHebrew, whose near-identical version of the Romm and Rashi typefaces seeks to invoke Rabbi Eiger's ruling and capture the entire market.\n\nThe goal of GoHebrew is to remake the entire library of Jewish classics, with an English translation, too.\n\n"
    },
    {
      "time": "14 Sep 2008 — 9:28am",
      "content": "Israel, just out of curiosity, since you worked with Friedaender, did he pronounce his first name dropping the H, as the French would, or did he use pronounce it?\n\n"
    },
    {
      "time": "14 Sep 2008 — 1:03pm",
      "content": "Israel,\n\nWhere's the head of this thread? What is subject? When you start a new thread try to take a little break; maybe drink... tea... coffee or something :) There're ton of images — try to group them to one or two; rest a little bit, post more.\n\nBecause right now this thread is a big mish mash. Moreover, try to play a fair game. Why do you say knock-off and not version? — \"MasterFont created, Raanana, as yet another knock-off of David\"? Maybe FontWorld created knock-off?\n\nSo, what is the subject? FrankReuhl ? Aharoni? Romm? text vs. display? text vs. display vs. decorative?\n\n\\> Many Israeli newspapers use Aharoni for their headlines\n\nI have here Israeli newspapers -- I don't remember the last time that I saw Aharoni.\n\n\\> Hadasa was created to be carved into stone on a new Israeli building. Friedlaeder resourched its design extensively, patterning it after motifs he took from very old Ashkenazic and Sephardic letter forms, and those of Bomberg and Soncino.\n\nAre you aware of Friedlaender's essay (appeared first in 1967, in German; 1975, Jerusalem) -- The Making of Hadassah Hebrew? He was influenced by the Scroll of Esther (1800; Ashkenazic letter forms) and by the Italian semi-cursive Drugulin (also Ashkenazic letter forms). There's nothing about Bomberg or Soncino.\n\nHis first experiment was in 1932; 1941 first draft; from 1932 to 1950 he was in Holland; From 1950 to 1970 he was head of Hadassah Apprentice School of Printing in Jerusalem.\n\nSo, \"Hadasa was created to be carved into stone on a new Israeli building\"? In 1932 he knew that? I didn't know that Friedlaender has encountered the supernatural powers :)\n\n"
    },
    {
      "time": "14 Sep 2008 — 1:21pm",
      "content": "William,\n\nHenri Friedlander was a very old man when I worked with him. He was retired. I spoke to him only on the phone. Out of respect, I never called him by his first name, nor did ever even refer to himself, by his first name or last.\n\nI remember 3 things in particular:  \na) He cried when I mentioned that much of Orthodox world was studying Tanach, the Bible, in his Hadasa typeface;  \nthis caused him great satisfaction to know this. (We spoke in Hebrew, so he was apparently unaware of ArtScroll.)  \nb) He approved my interpretation of Hadasa as authentic;  \nc) He criticized one detail in a few letters, urged me to correct them, and added this was the secret of good Hebrew fonts.\n\nThe story how we spoke on the telephone was really amazing. I had just married and created a PostScript version of his Hadasa design for a very early system of Apple Macintosh operating system, when the IBM PC just began. It was System 5.\n\nAnticipating to license it to Apple Israel, I sent Mr. Friedlaender a check for 100 old shekels. He return the check to me, explaning that he sold the rights to a now-defunct small European type foundry many many years ago. Hence, he was not entitled to any money. I was very impressed with his honesty.\n\nNot long after, Mr. Friedlaender called me in Kfar Chabad. He said that \"I noticed from the address that you live Kfar Chabad. Kfar Chabad is village which is inhabited with the followers of the Lubavitcher Rebbe.\" I replied, praised his work, extolled his important role in Jewish history, and added that the ArtScroll Orthodox publishing house in the United States had standardized their books on Hadasa. Then, I told him that even the Tanach, the Bible, appeared in Hadasa, and studied every day by many many Jews around the world.\"\n\nMr. Friedlaender was silent, and I heard him weeping like a baby.\n\n"
    },
    {
      "time": "14 Sep 2008 — 1:50pm",
      "content": "David,\n\nWhat a hostile post.\n\nThe theme of this thread is Hebrew Type Designs, like its name. The first post begins with Mr. Raphael Frank a\"h, desiugner of FranReuhl.\n\nFrankReuhl is the first main topic. To appreciate its position as the premiere Hebrew typeface design, I compare it to the Merubah typeface design. Merubah means square.  \nThis design was popularized in many other forms, particular by the Romm family of Vilna, Lithuania.\n\nThe Romm family printing establishments were reknown for very high quality workmanship. Even though they were very modern Jews, Chassidic masters sought for their books to be produced by the Widow and Brothers Romm.\n\nIn order of popularity, I move on to David, Hadasa and the rest.\n\nI am glad that you add important details about Aharoni and Hadasa. I was unaware of this. In Israel, during the eighties, many popular Israeli newspapers used Aharoni for headlines, and Aharoni Tzar, its narrow look-a-like, for headlines of minor articles.\n\nI don't read Hebrew, except to pray or study, or read fascinating articles about Hebrew Type Design. Perhaps, another black typeface design is used, like Chaim Shamen, Fat Chaim.\n\nI would be interested to read, as I am sure many others, for you to post a summary of Friedlaender's article in German, and an overview of facts that you know.\n\nHe sold the Hadasa design I think to the Amsterdam Typefoundry.\n\nIn Israel, I read that he used the Hadasa design to be carved in an Israeli building. The book even included his picture, the building, and a picture of the short inscription. I never said that he made it for that purpose.\n\nHow is Drogolin in any way similar to Hadasa? Look, I have samples above. When I first saw Drogolin, I thought it was an attempt to capture the flair of Romm/Vilna. FontWorld called Drogolin by th name of Belz, because the Belz logo featured Drogolin.\n\nActually, the font called Margoliot is not really Drogolin. Drogolin had a peculian curl on the lower left side of the aleph, and this version cuts it out.\n\nDavid, you are a treasurechest of knowledge Hebrew type design. Please don't keep it to yourself. Share your knowledge with us, and post, post, post...\n\n"
    },
    {
      "time": "14 Sep 2008 — 3:02pm",
      "content": "David voiced his objection to the subjective use of the term \"knock-off\". A knock off is an imitation of a popular design, simply with a different name, to avoid payment to its designer or copyright/trademark owner.\n\nHe cited the example of Tzvika Rosenberg, a popular Israeli font-maker, of MasterFont, who created Apple's Raanana. I called it a \"knock-off\". The bold version is a really poor knock-off.\n\nI called it a knock-off because when it was first created and licensed to Apple Israel, the unrelated name, Raanana, a small city in Israel, was picked to avoid payment to Mr. Itamar David, in the early eighties.\n\nDavid wondered why I did not call FontWorld's version, King David, also a knock-off, like Tzvika's Raanana. It's a valid question.\n\nFirst, King David is not a \"knock-off\". It is a very carefully rendition, inspired by Mr. David's popular design. It is rendered not to divert from hiis designintentions, but to correct his design flaws.\n\nThe real differance is in appearance.\n\nRaanana is a little, thinner, narrower, and not equally weighted in its strokes. Look at how David is different. Its strokes are weighted equally, making reproduction at even small point sizes looking right, while the same text, at the same point sizes, does not look right.\n\nKing David captures David's flow, but adds a unique touch, like raising a bit the height of the lamed, or raising the top of the left hand lower stem of the gimmel to increase its clarity and legibility, or the lowering of the top of the detached stroke on left hand side of the kuf, to allow better distinction and \"breathing room\".\n\nFontWorld never issued Itamar David a\"h any royalty out of \"moral good sense\" in the nineties, as it had no way to contact him (he was an invalid either living in an age hold or with a child in America). If anyone knows how to contact his descendants, please write to: [ContactInfoforDavid@gmail.com](mailto:ContactInfoforDavid@gmail.com)\n\n"
    },
    {
      "time": "15 Sep 2008 — 9:30am",
      "content": "Ittai Tamari -- Digitization of Hebrew Fonts (pp.190-191, p.195), about Frank-Rühl:\n\n\"Among its numerous faults one may mention its too dense and heavy appearance, which needs very careful letterspacing when hand-set in sizes smaller than 12 point...clear distinctions between similar-looking letters (Daleth and Resh, Vav and Za'in, Heth and Thaf) were not made, although the designer was well aware of the problem.  \nHowever, what interests us most is not the shortcomings of the design -- rather, its incomparable success as the most-used Hebrew type....Any possible explanation is indeed a mixture of many factors: sociological, technical, human -- and most of all the lack of other, more compatible choices, which would comply with the current taste. The Frank-Rühl letters appaered (at first only in normal weight, the additional bold weight was a later adaption by other designers), fortunately, in a significant period for the Jews: the establishment of the Zionist movment...; the visualisation of their return to the Promised Land....; Jewish authors and poets were endeavouring to write in the future only in Hebrew. These developments needed, of course, means of publications, i.e. text typefaces, which needed to be different-looking from the then familiar ones. These were found in the Frank-Rühl design.\"\n\nLine #1: the original -- Berthold  \nLine#2: Linotype linecasting machine  \nLine#3: Monotype  \nLine#4: AM International  \nLine#5: Linotron 202  \nLine#6: Autologic\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/FrankR_4351.gif)\n\nRight now there's not a single revival that is close to the original.\n\n\\> Why then did Frank refer to this design as “Meruba”?\n\nMeruba= block letter, all non-script Hebrew type (page 9, 12 -- his little booklet). BTW, Monotype's version of Meruba was called Sonzino, Drugulin's was called Magalith; the font Miriam -- Frank also may have designed Miriam, since it appers in the 1924 Berthold catalog along with Frank-Rühl.\n\n\\> These samples include rarely used examples of different type style designs,\n\nLettering. Don't forget that Raphael Frank was Sofer Stam.\n\n"
    },
    {
      "time": "15 Sep 2008 — 11:06am",
      "content": "\\> Right now there’s not a single revival that is close to the original.\n\nI also think this conclusion is accurate. Considering the specimens that we have before us from his book, which are for large size body text, we actually don't have cpmparables.\n\nApparently, Frank made his design to typeset large Biblical texts, or Hadagas. The other venders aim were rabbinic commentaries, or political discussions, or literature in general, that appears at smaller text sizes, or even have very small footnotes.\n\nThere are multiple weights which I have from Linotype, 9, 10, and 12 point sizes. Vaityper's version is even lighter, and very suitable for small text sizes. We don't find a 18 pt. or 24 pt. FrankReuhl from Linotype.\n\nEach one (the 9, 10, and 12 point sizes of Linotype's FrankReuhl) is very different from its siblings. 9 in particulars has major differences.\n\nI also has from a very old job a revival of FrankReuhl from an artist commissioned to draw very large letters from an unknown machine. There also an interesting design that is unique to all other versions of FrankReuhl from other venders, except one of the 3 point sizes from Linotype (the nine) [maybe, it was drawn from the nine].\n\nI also have another set of drawings that I was told was drawn from an old Linotype machine, where Frankruehl is somewhat crossed in design with Romm. I haven't revived it yet.\n\nIn these two versions (Linotype's 9, and the very large drawings) the bottom of the right side is lifted off (in part) from the baseline. It looks like a person standing upon his toes, with his heel lifted off the ground.\n\nI debated whether I should include this detail. A professor at RIT (Rochester Istitute of Technology, a leader om printing technology and type design studies) suggested that this peculiarity in design was like the design of serifs, to allow ink to gather during the print process. He reasoned that sonce this was no longer an issye, I should abandon thos aspect of the design.\n\nI was unsure, so I left it in the Varityper revival. Later, I found ot only in the small 9 point aleph of FrankReuhl from Linotype.\n\nPerhaps, the professor was correct, but his conclusion in my view was not. What do you think?\n\n[My scanner is suffering from a paper jam in the printer (its an all-in-one), so it'll be awhile until I can scan and post.]\n\n"
    },
    {
      "time": "15 Sep 2008 — 11:41am",
      "content": "Israel, I got hold of a Biblical grammar book, so I understand better now what David has been saying with regard to your idea of 'automating' the setting of the kamatz ketan and shva na, as you discussed in the other thread. This thread seems to be 'live', so I'll post here.\n\nThe grammar book is by a Chinese guy, but it corresponds exactly to what David was writing, so I'm assuming it's solid. It's called \"Grammar for Biblical Hebrew\" by C.L. Seow.\n\nSo the rule for the kamatz katan--which he calls a kamatz chataf--is simple: if it's in a closed syllable, then the kamatz is a kamatz katan, and otherwise not. This David wrote, and followed the rule with a 'smiley'.\n\nNow I understand the 'smiley', because the rule leads you into a whole chain of questions.\n\nHow do you know whether it's an closed syllable? Simple, it ends with a consonant that has a schva nach under it, or is the last letter.\n\nAnd how do you know whether it's a schva nach or schva na? Well, now you get a bunch of rules, one of which is that it's a schva na if comes after a letter with a strong dagesh.\n\nSo how do you know whether it's a strong or weak dagesh? Well, one of the rules is that it's a strong dagesh if it's preceded by a short vowel.\n\nSo how do you know whether it's a short or long vowel?\n\nWell up till now I will probably forget all this, but a computer won't, so there's no problem programming it, I would guess.\n\nBut here is the kicker: you only tell whether it's a short or long vowel by whether it falls on an accented syllable.\n\nSo you've hit a brick wall if you are only looking at syntax, because nothing in the letters or nikud are going to tell you where accent is. (David mentioned the accent issue also.)\n\nTo know the where accent is you are going to have to have a 'look up' of the word in some kind of dictionary that will tell you where the accent lies.\n\nSo it looks to me like what you need is not open type programming to do what you want, but rather some kind of 'spell check' that will automatically put the kind of nikkud you want. That you could do with the look-ups. I know that one of the Hebrew typing programs already has 'auto-nikud', but I don't know whether they will distinguish a kamatz katan and the different kinds of schva. But I don't see why they couldn't do it in principle.\n\nSo with a kind of spell checker which you would run or would be active all the time, it seems you could do what you want. But not by just sticking to the sequence of letters.\n\nps. Oops I left out that the cantillation marks for Torah writings--taamei hamikra--might change where the accent is, according to what David wrote. That might force you to look at more than on word, but presumably a spell check program could do that in principle.\n\nWhether it's worth the effort is another question.\n\npps. This book says that a kamatz katan is sometimes indicated by putting a meteg next to the kamatz. That seems to me typographically better than the line above the letter, or a bigger kamatz. However, I read somewhere that in the Siddur the meteg multiplied like measles so nobody really knows what they mean. So I don't know.\n\n"
    },
    {
      "time": "15 Sep 2008 — 11:49am",
      "content": "As I listed earlier, Frank-Rühl (aka FrankRüehl, FrankRuehl, FrankReuhl) usurped the role of Romm (aka Vilna, Siddur, Meruba) as the leading popular standard Hebrew typeface.\n\nSecond in popularity, is Itamar David's David. Third in popularity, is Henri Friedlaender's David.\n\nItamar David created many other and varied Hebrew type designs. I revived one of them so far, which I called, \"Itamar\", after hos first name.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/Itamar_3755.jpg)\n\n"
    },
    {
      "time": "15 Sep 2008 — 12:12pm",
      "content": "William,\n\nThank you very much for the detailed explanation about Mr. C.L. Seow's printed observation s on Biblical grammar. Where did you pick it up?\n\nIt seems kinda dire for programming it onto OpenType, as OT needs to substitute a string of characters, and there seems no Unicode value for stressed and unstressed (I thought that is the role of the meyeg in nikkud but not taamei mikra text).\n\nEffort is not the issue. In OpenType programming, you do it once for the first and you never have to do it again.\n\nI still like a visual indicator above the letter for a shvana.\n\nMy remaining question is the seeming preplanned design for the upper graphic symbol for shvana, because every occurance of shvana never had an upper taam. That seems to indicate that the lower taamim can cause a shvana but the upper taamim are immune to them. Why?\n\nThe answer is that upper and lower taamim must have a connection not only to cantillation but to grammar as well.\n\n"
    },
    {
      "time": "15 Sep 2008 — 1:24pm",
      "content": "\\> Itamar David created many other and varied Hebrew type designs. I revived one of them so far\n\nIsrael, do you have the type catalog with Itamar? and any other designs?\n\n"
    },
    {
      "time": "15 Sep 2008 — 1:28pm",
      "content": "I got it from a college library. [It is also available at Amazon](http://web.archive.org/web/20150414110851/http:/www.amazon.com/Grammar-Biblical-Hebrew-C-Seow/dp/0687157862/ref=pd_bbs_sr_1?ie=UTF8&s=books&qid=1221510201&sr=8-1).\n\n"
    },
    {
      "time": "15 Sep 2008 — 1:29pm",
      "content": "Before I mentioned that a popular display face was Aharoni. It was designed by a deceased Israeli graphic artist. FontWorld renamed it Aaron the Cohen, and below is GoHebrew's rendition in two weights. David Hanuel objected to my statement it is used as a headline font in many Israeli newpapers. So, I am also showing the Chaim font: Skinny, Bold, and Fat (I am working on Regular), as I certain it is used now for headlines (I think it was designed in Germany). Perhaps, my memory does not serve me well, so David might be correct, as he has newspapers to prove it.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/Stuff_5788.jpg)\n\nIf anyone has other designs, please post then. Likewise, if you know further details about Hebrew type designs, their history, the names of their designers etc., your posts are very welcome.\n\n"
    },
    {
      "time": "15 Sep 2008 — 1:34pm",
      "content": "Bill,\n\nYou're fast :)\n\n\\> This book says that a kamatz katan is sometimes indicated by putting a meteg next to the kamatz. That seems to me typographically better than the line above the\n\nMeteg is Always placed underneath the letter. Never above.\n\n\\> the line above the letter,\n\nThis is custom mark(s) much like the segol above the letter -- metsudah siddur; horizontal line -- artscroll siddur etc. etc.\n\n"
    },
    {
      "time": "15 Sep 2008 — 1:37pm",
      "content": "William, thank you.\n\nMy new hobbie: collecting Hebrew grammar books. :)\n\n"
    },
    {
      "time": "15 Sep 2008 — 1:50pm",
      "content": "David,\n\nSome 15 years ago, a paperbound book called Hebrew Typography was authored by Mr. Itamar David, with lots of designs that he made, including a few for the Hebrew Bible, including matching taamei mikra There no information in it at all. Just lots and lots of specimens. It looked like he knew his end was near, and wanted someone to implement his designs. Maybe, that person willo be you or me.\n\nI haven't seen it for many years. I know I have it somewhere. When I find it, I'll post some scans. Each design is very different that the other.\n\n"
    },
    {
      "time": "15 Sep 2008 — 2:14pm",
      "content": "David,\n\nWhy do you think that a graphic symbol besides the shva to indicate a shvana is preferable to a graphic symbol above a Hebrew letter, like in the Kehot Publication Society books (floating asterisk), or in the books of Shay Lemorah publishers (a floating asterisk with a circle closely around it)?\n\nHow about three dots, one on top of another?\n\n"
    },
    {
      "time": "15 Sep 2008 — 2:04pm",
      "content": "\\> This booklet is special because it features a graphic symbol for a shvana.\n\nIsrael, do you have a scan/sample? samples of words with that mark?\n\nedit: i need to go now; later on i'll answer your question.\n\n"
    },
    {
      "time": "15 Sep 2008 — 3:26pm",
      "content": "Another useful text face in book and bold weight is Apple's Margoliot, created by Tzvika Rosenberg of MasterType, and GoHebrew's Belz (which I created many years ago, based on gigantic drawings from an earlier photo-typesetting system, in a rare book on Hebrew typography.\n\nBoth are inspired by the Dragonal design. There is an important design element in the mem, which I decided to implement, and Tzvika did not. Perhaps, Tzvika had a different set of original artwork than I, as you the weights and metrics of both the book and bold are different. See the direction of upper right hand element of the tzaddi in the regular/book weight.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/Stuff2_5916.jpg)\n\n"
    },
    {
      "time": "15 Sep 2008 — 5:21pm",
      "content": "\\> Why do you think that a graphic symbol besides the shva to indicate a shvana is preferable to a graphic symbol above a Hebrew letter,\n\nAre you talking about the meteg? let's keep it simple: the meteg is part of the cantillation; placed underneath the letter. Any other graphic symbol e.g. floating asterisk isn't part of the cantillation and/or the nikud. But before talking too much I'll be glad to see that booklet:\n\n\\> This booklet is special because it features a graphic symbol for a shvana.\n\n\\> the shvana always appeared over the shva after the first letter of a Hebrew word, if that letter is a shooruk, a vov with a dot on it middle left side.\n\n"
    },
    {
      "time": "15 Sep 2008 — 6:12pm",
      "content": "David,\n\nA meteg as part of the taamim/cantilation set, true.\n\nIt is also a part of the nikkud/vowel set.\n\nI don't lein, chant the Torah according to the taamei mikra (even though I do sing some made-up verses in the shower). Does a meteg represent a sound in the taamei-mikra?\n\nIn the nikkud/vowel set, it is a stress mark, indicating which syllable in the word is stressed. Is this how it is used in Tanach?\n\nSo, too, a shvana. It is universal, applicable in both text without taamei-mikra and text with taamei-mikra (even though I have only seen it used in text with only nikkud, and not in text with taamei-mikra [except in Rabbi Shmuel Winefeld's Shay LeMorah Tanach books]).\n\nI don't see the two things are related?\n\n"
    },
    {
      "time": "15 Sep 2008 — 6:55pm",
      "content": "There are more differences between Apple's Margoliot by MasterFont, and between GoHebrew's Belz besides the unique shape of the mem. Take a look closely at the shapes of the lamed, ayon, amd tzaddi. It is clear the the regular and bold weights of Margoliot were drawn by two different artists. Although there is design integrity to both designs, I believe GoHebrew's Belz is closer to Droginal's original design intentions in both matching Book and Bold.\n\nFour weights of Belz\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/GH_Hebrew1_6429.jpg)\n\n"
    },
    {
      "time": "15 Sep 2008 — 7:19pm",
      "content": "Earlier, I showed you the populars designs by Itamar David and Henri Friedlaender. Before are 4 weights from each designer by GoHebrew.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/GH_Hebrew2_5092.jpg)\n\n"
    },
    {
      "time": "15 Sep 2008 — 7:34pm",
      "content": "Israel,\n\nA question or a statement:  \nI don’t see the two things are related?\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:15pm",
      "content": "David,\n\nIn nikkud text, meteg is a stress mark; it is also a part of the taamim. Always, it is a narrow vertical line that is placed below the Hebrew letter. Under a vov, zayin, yud, nuhn, there is barely enough space to position a nikud, lower taam, and meteg.\n\nAnd you would consider adding another meteg between the nikud and taam???\n\nIm nikkud text, a shvana is used; it is also a part of the taamim, though it is not placed there except in Shay Lamorah books (and in the future Tanach books I typeset). Under a vov, zayin, yud, nuhn, there is barely enough space to position a nikud, lower taam, and meteg.\n\nAnd you would consider adding another meteg between the nikud and taam???\n\nThe Shay Lamorah publisher, Rabbi Shmuel Winefeld of Jerusalem knew want he was doing when he placed the graphic symbol above and out of the way. Rabbi Menachen M. Schneersohn of Kehot Publication Society (the seventh Lubavitcher Rebbe) knew want he was doing when he placed the graphic symbol above and out of the way.\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:20pm",
      "content": "David,\n\nWhat are the names of books on Hebrew grammar and taamim that you recommend?\n\nJohn,\n\nI recall that you strongly recommended a certain book? What was it?\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:24pm",
      "content": "Re. meteg, in vocalisation and in cantillation:\n\nThe small vertical mark serves two functions with two names: meteg and siluq. Meteg is a vocalisation mark used to indicate secondary stress. Siluq is a cantillation mark signifying the end of a Biblical verse. Since the marks are visually identical but semantically distinguishable by context, Unicode unifies their encoding as a single mark.\n\nIt is the nature of chant -- not only Jewish chant but also Byzantine chant and the varieties of Latin chant -- that melody arises out of text. This means that it isn't really possible to talk about cantillation independent of vocalisation; so, for instance, the marking of secondary stress using meteg has a musical function that derives from the musical function of syllable stress as a punctuating and rhythmic principle. Or, as Joshua R. Jacobson puts it: 'Where there are too many consecutive unaccented syllables, the rhythm of the chant may sound rushed. Accordingly, to slow down the pace of the reading, a secondary stress is often indicated on words with more than two syllables.... A syllable with a meteg should be chanted _slightly_ louder and longer than a syllable that has no accent at all.'\n\nJacobson's book, _Chanting the Hebrew Bible,_ is excellent, and I learned more from it about vocalisation and cantillation than from any grammar I have consulted (and I have grammars dating back to 1539!)\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:34pm",
      "content": "John,\n\n\\> Jacobson’s book, Chanting the Hebrew Bible, is excellent, and I learned more from it about vocalisation and cantillation than from any grammar I have consulted (and I have grammars dating back to 1539!)\n\nThank you.\n\nAre some of yout very old grammar books in Hebrew by the Jewish grammar scholars of Spain, known as the Rishonim, the early dutactors of Jewish law?\n\nA definition of shvana, kamatz katan, and hataf kamatz katan, is there. I believe Rabbi Shmuel Winefeld derived his information from there.\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:44pm",
      "content": "John,\n\n\\> The small vertical mark serves two functions with two names: meteg and siluq.\n\n\\> Meteg is a vocalisation mark used to indicate secondary stress.\n\n\\> Siluq is a cantillation mark signifying the end of a Biblical verse.\n\nThis is very questional.\n\nAre you confusing it with sof pasuk?\n\nA meteg and sof pasuk has similar designs. Meteg though is small, like a nikud. Sof pasuk is much taller, does not descend below the base line, but does protrude above the other letters, like a lamed.\n\n\\> Since the marks are visually identical but semantically distinguishable by context, Unicode unifies their encoding as a single mark.\n\nIf so, meteg and sof pasuk should have two distinct Unicode values. They appear together in a single verse.\n\nAccoording to your definition of metrg, how then is a secondary stress indicated?\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:45pm",
      "content": "The grammar of Biblical Hebrew by Seow that Bill mentioned is a very good basic text. It manages to be a lot clearer than many other textbooks.\n\nGenesius' Hebrew Grammar remains extremely important, despite being well over a hundred years old now. I still refer to it when I want a really thorough explication of a topic.\n\nSome of the older grammars have lovely woodcut or engraved alphabets to illustrate pronunciation of the letters. I have my eye on one of these as a source for a possible display typeface. And then there's this beautiful piece of writing inside the back cover of my copy of Happellio's _Lingua Sanctae Canones grammatici_ (1561). The larger letters are about 3mm tall, and the small letters only 1.5mm.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/HappellioM_6080.jpg)\n\n"
    },
    {
      "time": "15 Sep 2008 — 10:58pm",
      "content": "_Are you confusing it with sof pasuk?_\n\nNo. One of the ways you can distinguish siluq from meteg is that siluq will always be followed by a sof pasuq. Siluq always occurs on the last word of a verse, so if you see what looks like a meteg on the last word, it will actually be a siluq unless there is another accent. [There are a few cases of polysyllabic words that have both a meteg and a siluq; the latter, of course, is the one nearest to the end of the word.] The siluq is specifically a cantillation mark: it indicates a melodic ending to be sung.\n\n_Accoording to your definition of meteg, how then is a secondary stress indicated?_\n\nBy a meteg. In the cantillation system, the meteg is used to indicate secondary stress. Primary stress is indicated by one of the other accents -- which one depends on the melody --, but where a number of unaccented syllables follow in succession, the meteg is used to signify a secondary stress, which musically is a rhythmic device.\n\n[Note that I only know about Biblical Hebrew. I don't know how stress works in normal spoken Hebrew or understand what role meteg plays in the vocalisation system other than in cantillated text.]\n\nAgain, I strongly, strongly recommend Jacobson's book. It comes with an audio CD, so you can hear the correct interpretation of the different 'trops'.\n\n"
    },
    {
      "time": "15 Sep 2008 — 11:26pm",
      "content": "John,\n\nThe sample contains a beautiful poetic prayer.\n\n\"I will praise You, my Father, Master of the Heavens and Earth, who arranged  \nYour will, from the wise (?) ones and the understanding ones,  \nAnd you make [your will] pleasant to youth.\"\n\n\"From the flowing of the heart, will speak the mouth.\"\n\nWow, where did you get these books from? Want to sell them? :)\n\nThe typeface design is Stam.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/Stam_4030.jpg)\n\nRegarding the first inscription, what does the arrangement of G-d's will have to with pleasing youth?\n\nRegarding the second inscription, this statement is reflected in the expression in Chassidic thought [on the opposite] that the more you speak, then the more you wake up feeling about that subject.\n\n===\n\nDid you see anywhere the discussion that there is a relationship between the nikud and the taamim? Or the taggim? I think there must be, but we must figure it out.\n\n"
    },
    {
      "time": "15 Sep 2008 — 11:16pm",
      "content": "\\> I learned more from it about vocalisation and cantillation than from any grammar....\n\nJohn,\n\nThe only complete book/work is by Mordechai Breuer Ta’amey ha-mikra (The Poetical Books +The Prose Books) +  \nPisuk Te’amim sheba-Mikra  \nAnd of course Keter Aram Tsovah by Israel Yeivin!!!\n\nAbout the meteg, there are ten different kinds of metegs.\n\n"
    },
    {
      "time": "15 Sep 2008 — 11:21pm",
      "content": "Israel, how much do you know about linguistics and how much about music?\n\nBecause of the nature of chant -- all chant, not just Jewish --, there is a strong relationship of music to text and hence to the characteristics of spoken language, particularly stress, which performs a rhythmic role in both speech and chant. So yes, there is a relationship between the ta'amim and the nikudot, _but_ -- and this is important -- vowels are the most fluid elements of language. They are fluid in their individual and regional interpretation and they are also historically fluid (consider the 'great vowel shift' in mediaeval English). So what the nikudot signify is something less fixed than either the consonant letters or the ta'amim. Note also that what the ta'amim signify is also changeable, although in a different way: how particular accents are interpreted by the cantor depends on the calendar, the same mark will be expressed musically in different ways depending on the text and the holy day. Historically, the ta'amim have also been given different melodies in different diaspora communities. Jacobson has a nice example of the intersection of these phenomena on page 16, where he shows six different melodic interpretations of the ta'am tevir -- respectively for Torah, Haftarah, Esther, Lamentations, the Song of Songs, and Torah on a High Holiday -- in a Lithuanian tradition.\n\n_The typeface design is Stam._\n\nBetter to say that Stam is a typeface in the style of this (probably 18th century) Ashkenazic formal writing.\n\n"
    },
    {
      "time": "15 Sep 2008 — 11:56pm",
      "content": "John,\n\n\\> Stam is a typeface in the style of this (probably 18th century) Ashkenazic formal writing\n\nStam is as acronym foe three kinds of holy objects, the S-efer Torah parchment, Tefillin, and Mezuzah. That is why this design for religious writings.\n\n\\> Ashkenazic\n\nNow, do you see why I suggested (based on my research) when we worked on FrankRuehl and then Henri that the Romm design of Vilna, Lithuania, was based upon a Sephardic style of writing, and Adobe Hebrew, Henri (Hadasa), Koren (Crown), was based upon an Ashkenazic style of writing.\n\n ![](http://web.archive.org/web/20150414110851im_/http:/typophile.com/files/Alephs_3771.jpg)\n\n.  \nEach of the alephs have a left upper arm facing leftwards.\n\nHenri right lower leg, and Adobe Hebrew's, face to the right (in this, they blend traditions). Do you remember that I said that Hadasa inspired Adobe Hebrew?\n\n"
    },
    {
      "time": "16 Sep 2008 — 12:21am",
      "content": "John,\n\n\\> Israel, how much do you know about linguistics and how much about music?\n\nNot much, but I want to know, to learn...\n\nAre there books which connect the two?\n\nDavid,\n\nThank you. Do you know from which book stores I can acquire them, or libraries, or are they even in print?\n\n"
    },
    {
      "time": "16 Sep 2008 — 12:11am",
      "content": "Israel,\n\nPart of the list:\n\nMordechai Breuer Ta’amey ha-mikra — this is the only book that covers The Poetical Books +The Prose Books;  \nPisuk Te’amim sheba-Mikra  \nAharon Ben Asher — Diqduqe Hate’amim (Dotan Edition, 1967, 3 vol)  \nKeter Aram Tsovah by Israel Yeivin  \nNorzi, Minhat Shai  \nWolf Heidenheim, Mishpete Ha-Te’amim\n\nAnd the rest... from the first thread e.g. Ibn Janah — Sefer Ha-Riqmah; David Kimhi (RaDaK) — Michlol , Sefer Hashorashim;\n\nsince they are dealing with issues/subjects/problems that no other book deals with.\n\n"
    }
  ]
}
