{
  "id": "4940",
  "title": "Sans pairing for Californian FB",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey i'm putting together my r\n\n",
  "author": "pablohoney77",
  "time": "26 May 2004 — 11:50am",
  "uid": "2910",
  "comments": [
    {
      "time": "26 May 2004 — 1:33pm",
      "content": "Yeah, Legacy Sans was my first thought too.   \nYou could also try Eureka Sans or Sebastian.\n\n"
    },
    {
      "time": "26 May 2004 — 2:03pm",
      "content": "Good call! Legacy almost feels like Gill (another sans i was toying with but didn't thing was quite right) with the quirks ironed out. It feels, too, like Optima but more in line with the flavor of Californian. Thnx for yer help guys!\n\n"
    },
    {
      "time": "26 May 2004 — 3:03pm",
      "content": "before i spend the money, does anyone know if there's a huge difference between the Agfa and E&F versions?\n\n"
    },
    {
      "time": "26 May 2004 — 4:17pm",
      "content": "and the best prices too. i checked both itc and myfonts and neither of them came close to fontshop's $79 for the whole shebang. what a deal!\n\n"
    },
    {
      "time": "26 May 2004 — 4:35pm",
      "content": "i was actully hoping you'd weigh in tiff. but you gotta give me a better suggestion!\n\n"
    },
    {
      "time": "26 May 2004 — 4:50pm",
      "content": "I only have what came with Office XP\n\n"
    },
    {
      "time": "26 May 2004 — 5:02pm",
      "content": "tiff, i'm still waiting for a suggestion from you! ;^)   \nsurely you must be thinking of _something_!\n\n"
    },
    {
      "time": "26 May 2004 — 5:30pm",
      "content": "wow! thnx for the suggestions and the trouble, tiffany. good thing you didn't see my resume with goudy sans for headings\n\n"
    },
    {
      "time": "27 May 2004 — 11:21am",
      "content": "\\> Tiff, do you think Scala Sans would be any better than Legacy? or still too friendly? \\>\n\n"
    },
    {
      "time": "27 May 2004 — 12:18pm",
      "content": "_The most important thing to think about is that this represents you and your own style_   \nvery true. i think i'm overanalyzing now and so it's all starting to feel irrelevant.   \nPersonaly I think Legacy is a good match for Californaian, but i'd agree a bit too friendly and maybe more humanistic feeling than i want for a resume.   \nOriginally I was thinking Gill caps, and tho i love Gill, i think it's a bit too quirky again for a resume.   \nNow i'm thinking Scala Sans Bold SC. I'll agree that for my purposes i want something with a very small amount of modulation. So before i commit... any other ideas to consider?   \n;^)\n\n"
    },
    {
      "time": "27 May 2004 — 1:21pm",
      "content": "Well if that's it, thanks for yer help Stephen and Tiffany! 'preciate ya.\n\n"
    },
    {
      "time": "27 May 2004 — 1:51pm",
      "content": "I'm so happy that Franklin Gothic was suggested. I have a fondness for it that goes beyond any natural state. Grew accustomed to Franklin as a reliable plowhorse and have never outgrown the love of it.   \n   \nI would also like to see it paired with other versions of \"Californian\". Lanston has the face in the works from his patterns as you all now know from another thread.   \n   \nGood on ya, Tiffany!   \n   \njim Rimmer\n\n"
    },
    {
      "time": "27 May 2004 — 1:56pm",
      "content": "Nearly any plain-spoken and sober, bold-sans would pair well with ITC Berkley or Californian.   \nI thought Franklin Gothic was a good, compatable suggestion. Try Spartan or Futura bold, too.   \nI also like Penumbra MM for the job. You can go with a plain sans (725 BD 0 SA) or with a subtle spur serif (725 BD 150 FS).\n\n"
    },
    {
      "time": "27 May 2004 — 6:26pm",
      "content": "I've had success pairing Californian with Monotype Grotesque. MT Grot's complete lack of pretension played well against the slightly ornate Californian.\n\n"
    },
    {
      "time": "26 May 2004 — 12:47pm",
      "content": "Love Californian - nice choice. Maybe Legacy Sans.   \nThe [Medium SC](http://web.archive.org/web/20131023140407/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdisplay&packagefontid=0&displayfontid=ITC.9268.3.7&view=single&searchID=0&searchby=keyword&searchletter=A&searchstr=legacy&totalrecords=117&startrow=1&records=20&currpage=1) might fit especially well with Cal or   \ntry [Ultra](http://web.archive.org/web/20131023140407/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdisplay&packagefontid=0&displayfontid=EF.6701.0.4&view=single&searchID=0&searchby=keyword&searchletter=A&searchstr=legacy&totalrecords=117&startrow=1&records=20&currpage=1) for contrast.\n\n"
    },
    {
      "time": "26 May 2004 — 1:36pm",
      "content": "![resume example](http://web.archive.org/web/20131023140407im_/http:/www.typophile.com/forums/messages/30/36810.gif)\n\n"
    },
    {
      "time": "26 May 2004 — 3:50pm",
      "content": "I think the main differences are in naming schemes rather than   \nquality or design. So I'd go with the [ITC](http://web.archive.org/web/20131023140407/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdisplay&displayfontid=ITC.9268.0.0&packagefontid=0&view=package&searchID=0&searchby=keyword&searchletter=A&searchstr=legacy&totalrecords=117&startrow=1&records=20&currpage=1) or Agfa packages which   \nare much cheaper at $79.   \n   \nBuy from FontShop for the best support.\n\n"
    },
    {
      "time": "26 May 2004 — 4:24pm",
      "content": "Am I too late? [wink,wink] Legacy Sans is nice, but doesn't the casual contrast go against the the elegant contrast in Californian?\n\n"
    },
    {
      "time": "26 May 2004 — 4:44pm",
      "content": "which weights/varieties of Californian have you licensed?\n\n"
    },
    {
      "time": "26 May 2004 — 4:46pm",
      "content": "\"doesn't the casual contrast go against the the elegant contrast in Californian?\"   \n   \nNot sure what you mean here, Tiff. Could you rephrase?\n\n"
    },
    {
      "time": "26 May 2004 — 4:53pm",
      "content": "FB Californian was installed with Office XP? I think you might be   \nlooking at something else.\n\n"
    },
    {
      "time": "26 May 2004 — 4:55pm",
      "content": "Paul, can you post a sample of it for us?\n\n"
    },
    {
      "time": "26 May 2004 — 4:55pm",
      "content": "Yes. Good question. What were you saying Miss Tiffany? Uhmm. Let's see. Legacy Sans is too friendly for Californian. IMO. I shoulda just said that to begin with. It seems to call too much attention to itself. Californian is very beautiful, but I think it needs a sans that contrast with it more.\n\n"
    },
    {
      "time": "26 May 2004 — 5:00pm",
      "content": "Wow - I humbly withdraw my skepticism. Looks like FB Californian   \n [is bundled with some MS products](http://web.archive.org/web/20131023140407/http:/www.microsoft.com/typography/fonts/default.aspx).   \n   \nI stand by the Legacy Sans pairing, though.\n\n"
    },
    {
      "time": "26 May 2004 — 5:14pm",
      "content": "ok. my first gut would have been franklin gothic. i used to have a client that i paired berkeley with franklin and i liked how it worked. but i played with it for you. if you really want flavor you might look at anisette (see sample below).   \n   \n ![](http://web.archive.org/web/20131023140407im_/http:/www.typophile.com/forums/messages/30/36830.gif)   \n   \ni don't have anything against legacy as a typeface. it is very nice. i simply think it is too casual (a) for a resume, and (b) to pair with californian.\n\n"
    },
    {
      "time": "27 May 2004 — 11:47am",
      "content": "Maybe using the word elegant was too easy. Elegant is Bickham script. For a serif (so-called) bookface, Californian is pretty elegant. But it is also not un-friendly. I simply think that it needs something with no (or hardly any) contrast. Sorry. I took this thought home with me last night. The most important thing to think about is that this represents you and your own style, not mine. Tell us what you think about these pairings. It doesn't do you (or me) any good to simply accept what I show you. (and besides it could be a good conversation).   \n   \nI don't have the black weight of scala so I don't know. A few other ideas below:   \n   \n ![](http://web.archive.org/web/20131023140407im_/http:/www.typophile.com/forums/messages/30/36903.gif)   \n   \nlast minute thought:   \n   \n ![](http://web.archive.org/web/20131023140407im_/http:/www.typophile.com/forums/messages/30/36904.gif)\n\n"
    },
    {
      "time": "27 May 2004 — 12:20pm",
      "content": "I think what these samples show is that most of these sans work   \nwell with Californian. What changes with your selection is the   \noverall feeling of the document. So really, it comes down to what   \nattitude Paul wants to portray. If it's \"classy yet comfy\" I still   \nthink Legacy fills the bill. But so does Scala and Meta.\n\n"
    }
  ]
}
