{
  "id": "49413",
  "title": "Jimmy James reviews Helvetica",
  "forum": "James Arboghast's blog",
  "tags": [

  ],
  "content": " **Sum up:** On the [Advice on establishing an Australian type club thread](http://web.archive.org/web/20110305114847/http:/typophile.com/node/47892) I said \"the only interesting person in Helvetica is David Carson.\" That was overstating it. Carson isn't the only talking head worthy of your attention in Gary Hustwit's documentary on Max Meidinger's ubiquitous mid-century grotesk. Jonathan Hoefler and Tobias Frere Jones give David Carson a decent run for his money. Hoefler in particular came across as we would expect such a type luminary to—articulate, lucid, quick-witted and well-informed. Frere Jones was more sober yet no less erudite or cultured than his partner. Matthew Carter was absorbing and informative.\n\nWhat disappointed me about this film was its near complete absence of teeth. It's just plain dull. A balanced view of Helvetica the font should present more than a handful of the type world's biggest and brightest stars. Hustwit made the mistake of focussing on mainstream opinion and mainstream use of Helvetica, and went on repeating this mistake for a mind-numbing eighty minutes of trite, safe, risk-free pandering to the lowest common denominator.\n\nWhere are all the other stars in the typosphere, such as Nick Shinn, Robert Slimbach, Sumner Stone, Gerald Giampa, Stuart Sandler, Tiffany Wardle, Rebecca Alaccari, Brian Bonislawsky, Richard Kegler, Peter Bruhn, Peter Bilak, Stephen Coles, James Grieshaber, Carl Crossgrove, Ray Larabie, Erik van Bokland, Hrant H. Papazian, Akira Kobayashi, Shu?\n\nWhere are the opinions of working graphic designers who hate the flipping thing? Why did Hustwit limit the expression of opinions on Helvetica to talking heads, and why limit samples of the font in action to signage and other real world use? It's a film for crying out loud. Cinema is a visual medium and Gary Hustwit simply did not make use of its many possibilities.\n\nMade-up samples of Helvetica made specially for the film could have been made to voice the views of less important type people. The titles are set in Helvetica, but designed and executed in an almost insufferably dull fashion. A boring font Helvetica may be (depending on your point of view), but artists are supposed to do interesting and surprizing things with boring fonts, aren't they?\n\nI'm hardly what you'd call a type geek, yet the film contains absolutely no factual information on the Helvetica font I did not know already. At the end of it I thought of a dozen ways it could have been made a superior, more interesting, stimulating and informative viewing experience. Instead Hustwit delivered _Nothing New About Helvetica_.\n\n**Spec notes:** At 80 minutes it's far too long. The music is blows Dimetrodons.  \n**Rivals:** The Life of Al Gore, A World Without Zinc, Beyond 'The Golden Compass'.  \n**Also try:** Standing outside a train station and greeting commuters like they are guests arriving at your birthday party.  \n**Rating:** Two stars.  \n**My choice:** No, sorry. I sort of want to like it but I can't.\n\n",
  "author": "<a href=\"/web/20110305114847/http://www.typophile.com/user/9349\" title=\"View user profile.\">James Arboghast</a>",
  "time": "<br>",
  "uid": "9349",
  "comments": [
    {
      "time": "",
      "content": "\\> Why did Hustwit limit the expression of opinions on Helvetica to talking heads\n\nI wouldn't call the interviewees talking heads. When have you ever heard from most of these guys beyond the odd magazine article or design conference? Part of the value of the film is that it gives graphic designers and type designers a voice on film. That is very rare.\n\n\\> The titles are set in Helvetica, but designed and executed in an almost insufferably dull fashion.\n\nI found the titles perfectly appropriate. Helvetica is important for its neutrality (or dullness for some) and ubiquity. To do something different just for the sake of being different ignores the soul of Helvetica.\n\n\\> music is blows Dimetrodons\n\nI'm interested. What sort of music says Helvetica to you? [Hustwit's choices](http://web.archive.org/web/20110305114847/http:/www.flickr.com/photos/stewf/579455436/) were personal, but carefully considered, and I think they fit the subject well.\n\n"
    },
    {
      "time": "",
      "content": "_I wouldn’t call the interviewees talking heads. When have you ever heard from most of these guys beyond the odd magazine article or design conference? Part of the value of the film is that it gives graphic designers and type designers a voice on film. That is very rare._\n\n\"Talking head\" is a popular term used to describe anybody interviewed on a screen for any purpose. Wiktionary defines it as, \"(idiomatic) A pundit who discusses issues of the day, especially one on TV.\" [http://en.wiktionary.org/wiki/talking\\_head](http://web.archive.org/web/20110305114847/http:/en.wiktionary.org/wiki/talking_head \"http://en.wiktionary.org/wiki/talking\\_head\")\n\nMy use of the rem is broader than that. At least as broad as it is long.\n\nThe problem with Helvetica is that it only gives a handful of designers and type designers a voice on film. That's disappointing. It isn't broad enuff.\n\n_I found the titles perfectly appropriate. Helvetica is important for its neutrality (or dullness for some) and ubiquity. To do something different just for the sake of being different ignores the soul of Helvetica._\n\nYour view and interpretation of what Helvetica is and the uses it can be put to is a bit conservative in my estimation. I advocate doing something different with it (for the film's titles) not merely for the sake off being different, but to reduce the yawn factor. Helvetica's soul can survive any assault, mild or extreme.\n\n_I’m interested. What sort of music says Helvetica to you? Hustwit’s choices were personal, but carefully considered, and I think they fit the subject well._\n\nThe music Hustwit chose was unimaginative and had a dulling effect. Fitting the subject is one thing, sending the audience to sleep is something else.\n\nThere is more to documentary filmmaking than appropriateness, if you follow the significance of that. For example, by doing something unexpected and pushing the interpretation at the edges a flimmaker can throw a new perspective on the subject. It all has to do with catching the audience off-guard and taking a fresh look at things.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Helvetica is so generic a typeface it can be contrasted with almost anything in any setting. That's kind of the whole point of my review and my take on the film as well as the type itself.\n\nTypophiles seem to have a black & white view of the type itself. I have been saying for almost a year now that Helvetica in bold weights really isn't so bad. Certainly it's more robust and malleable in bold or heavy guise, altogether less ugly, more palatable, and a lot more chuckable in the the hands of graphic designers and typographers who use it.\n\n**Alternative music candidates**  \nPhilip Glass -- Glassworks [Rubrid Facades Floe, Islands], Akenaten,  \n [http://en.wikipedia.org/wiki/Philip\\_Glass](http://web.archive.org/web/20110305114847/http:/en.wikipedia.org/wiki/Philip_Glass \"http://en.wikipedia.org/wiki/Philip\\_Glass\")  \nSteve Reich -- Tehilim, Drumming, Six Pianos, Music for 18 Musicians  \n [http://en.wikipedia.org/wiki/Steve\\_Reich](http://web.archive.org/web/20110305114847/http:/en.wikipedia.org/wiki/Steve_Reich \"http://en.wikipedia.org/wiki/Steve\\_Reich\")  \nJohn Adams -- Short Ride in a Fast Macine, Shaker Loops  \nn.wikipedia.org/wiki/John\\_Adams\\_(composer)  \nEric Satie -- gymnopaedie  \n [http://en.wikipedia.org/wiki/Erik\\_Satie](http://web.archive.org/web/20110305114847/http:/en.wikipedia.org/wiki/Erik_Satie \"http://en.wikipedia.org/wiki/Erik\\_Satie\")  \nBill Evans --  \n [http://en.wikipedia.org/wiki/Bill\\_Evans](http://web.archive.org/web/20110305114847/http:/en.wikipedia.org/wiki/Bill_Evans \"http://en.wikipedia.org/wiki/Bill\\_Evans\")\n\n**But also try:**  \nGrace Jones -- Slave to the Rhythm (get it yet?)  \nMiles Davis  \nThe Art of Noise  \nWeather Report  \nJohanne Sebastian Bach\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "See and Philip Glass would put me to sleep. So it is all subjective. ;^)\n\n"
    },
    {
      "time": "",
      "content": "What about the other music candidates? Any of those appeal to you? Satie is anything but sleep-inducing. Bach is pretty exciting. Miles mesmerizes.\n\nOne thing is for sure, Helveeta the font is quite generic and goes with just about anything, yet Hustwit's film is remarkably one-dimensional. Surely he could have come up with a lot more in the way of opinions and context. Only the bigwigs in the type business and a few prominent graphic designers like Carson and Brody are included, along with a few isolated draftsmen connected with the original font's creation.\n\nNarrow, narrow, too narrow even for pretend consideration.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "As long as you agree that this is your own opinion then we're cool. Because I disagree (to some extent) on all points.\n\nSure. Some of the others are good enough to great enough. But I don't think it would have fit the tone set forth by the rest of the film.\n\nI think sales and seats prove that plenty of people disagree.\n\n"
    },
    {
      "time": "",
      "content": "I loved the film. As Stephen says it gives graphic designers and type designers a voice. It is a nice history of the past 50 years of graphic design, with lively discussions of some leading participants.\n\nFor me the only problem was all that damn Helvetica :)\n\nI especially appreciated the way Erik Spiekermann nailed the problem with Helvetica: that it's \"fat in the middle\" and so demands a whole lot of space.\n\n"
    },
    {
      "time": "",
      "content": "James, I submit that all of your music selections (all of which I enjoy!) have a similar tone to what is on the soundtrack, only they are older and more well-known. It seems to show that your objection to the music is highly subjective.\n\n"
    },
    {
      "time": "",
      "content": "@Tiffany: _As long as you agree that this is your own opinion then we’re cool. Because I disagree (to some extent) on all points._\n\nThere are no facts, only opinions and points of view on the world. Agree to disagree for the sake of tolerance and we can live together peacably.\n\n_I think sales and seats prove that plenty of people disagree._\n\nPopular doesn't always equal high quality. The substantial number of peeple who went to see the film may have gone to see it because they didn't know much about Helvetica. To type experts with all our knowledge of fonts like Helvetica, the film offers little that is genuinely new.\n\n@Stephen: _It seems to show that your objection to the music is highly subjective._\n\nYes, and there is such a thing as good taste and connoisseurship. What I found withering about the music used in the film was its lack of balls.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "_I submit that all of your music selections (all of which I enjoy!) have a similar tone to what is on the soundtrack, only they are older and more well-known. It seems to show that your objection to the music is highly subjective._\n\nAbsolute nonsense and not true at all. Your view is founded on a distinct inability to appreciate the qualitative superiority of my music selections over the music used in the Helvetica film.\n\n_It seems to show that your objection to the music is highly subjective._\n\nNope. My objection to the music in the film is nowhere near as subjective as you like to pretend. It's based on a thorough appreciation great music versus the stuff used in Helvetica. As usual you are trying to win a debate with erroneous suggestions and by misconstruing the points of your oponent. Once again you are out of gasoline and unable to concede and play the game with full deck of cards. Your deck is missing several cards and your dice is loaded in favor of the result you want.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "I thought it was a great film. On the other hand, without Spiekermann it would have been as James describes.\n\nhhp\n\n"
    }
  ]
}
