{
  "id": "49423",
  "title": "Font \".zip\" Archives - Unix Executable Files & other font files",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all,\n\nI have been given a font (.zip) archive from a client, and I am having a problem deciphering some of the files once it has been decompressed.\n\nI have tried both StuffIt Expander AND BOMArchiveHelper. I get the same thing with both extracting processes.\n\nOnce the archive is decompressed, I get Font Suitcase files and PostScript Type 1 outline font files (both of which I am familiar with).\n\nWhat I am NOT familiar with and the files that STUMP me are:  \nUnix Executable Files(s) - some of which are Zero KB in size  \nStuffit Expander.app Document(s) - some of which have \"afm\" suffixes after the file name(s)\n\nCan anyone shed some light on what I am supposed to do with these files?  \nAre they corrupt files?  \nAm I supposed to import them into FontAgentPro?  \nHas my client archived them improperly?  \nShould I Trash the Zero KB files?\n\nPlease help! Thank you in advance!\n\n",
  "author": "girlwithglasses",
  "time": "13 Sep 2008 — 5:16pm",
  "uid": "22707",
  "comments": [
    {
      "time": "13 Sep 2008 — 7:47pm",
      "content": "Often times, files that are identified as UNIX executable are simply files that OS X doesn't know what to do with (i.e., there is no application associated). AFM files are normally not needed on Macs.\n\nIf the files have are empty (i.e., zero kb), it probably means that the files are corrupt due to being transfered through a non-Mac file system (Windows, UNIX, Linux). Some Mac files (including suitcase files) have have a component called a resource fork. This is a special part of a file that is not visible to non-Mac file systems, such as Windows. If you move such a file to Windows and back, the resource fork will be lost, resulting in an empty file if all the data was in the resource fork, which is the case with font suitcases.\n\nIf you want to transfer font files from one Mac to another over the internet or via a Windows PC, you need to make sure the font files are placed into a zip or StuffIt file on the originating Mac before transfer and never opened on a PC at any point during transit.\n\n"
    },
    {
      "time": "13 Sep 2008 — 8:14pm",
      "content": "At this url is some detailed information as to how to solve the problem. I have had the same problem but it was always something I could work around. I'll be trying this solution as well the next time I encounter it.\n\n[http://discussions.apple.com/thread.jspa?messageID=7401999&#7401999](http://web.archive.org/web/20130127025838/http:/discussions.apple.com/thread.jspa?messageID=7401999&#7401999)\n\nGeorge\n\n"
    },
    {
      "time": "13 Sep 2008 — 8:15pm",
      "content": "At this url is some detailed information as to how to solve the problem. I have had the same problem but it was always something I could work around. I'll be trying this solution as well the next time I encounter it.\n\n[http://discussions.apple.com/thread.jspa?messageID=7401999&#7401999](http://web.archive.org/web/20130127025838/http:/discussions.apple.com/thread.jspa?messageID=7401999&#7401999 \"http://discussions.apple.com/thread.jspa?messageID=7401999&#7401999\")\n\nGeorge\n\n"
    }
  ]
}
