{
  "id": "49422",
  "title": "Captain Quill Font Introduced by Ascender Corp",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20120105005632/http:/typophile.com/user/108 \"View user profile.\") : 13.Sep.2008 3.01pm \n\n_Captain Quill™ is a swashbuckling script font that captures the authentic feeling of italic handwriting with a quill pen. Captain Quill is available in both TrueType and OpenType formats and includes an extensive character set with extra typographic features including alternative letterforms and pirate icons. Captain Quill is available now for instant download from [www.AscenderFonts.com](http://web.archive.org/web/20120105005632/http:/www.ascenderfonts.com/) and [www.FontMarketplace.com](http://web.archive.org/web/20120105005632/http:/www.fontmarketplace.com/)._\n\n ![](http://web.archive.org/web/20120105005632im_/http:/typophile.com/files/quill-01_5975.gif)\n\nElk Grove Village, IL -- September 13, 2008 -- Ascender Corporation, a leading provider of advanced font products, today announced a new retail font called Captain Quill™. Designed by Jim Ford, the Captain Quill font is a calligraphic style script font based on the handwriting of a fictional pirate figure named Captain Quill. The letterforms have elegant, natural-flowing shapes with a distressed touch that gives the font an authentic, vintage appeal.\n\n\"It all started with a bottle of rum\" said Jim Ford, the designer of Captain Quill, \"I was inspired by the legend of Captain Quill and saw potential in the lettering style for a variety of uses. It fits right in with the current design community's hunger for rich OpenType features and smart typefaces that bridge the gap between hand lettering and fonts.\"\n\nCaptain Quill was developed in both TrueType and OpenType font formats to appeal to a wide audience from consumers to creative professionals. It is available immediately for download from Ascender's font websites: FontMarketplace.com and AscenderFonts.com.\n\nWhen Cap'n Slappy and Ol' Chumbucket, founders of the International Talk Like A Pirate Day ( [http://www.talklikeapirate.com](http://web.archive.org/web/20120105005632/http:/www.talklikeapirate.com/ \"http://www.talklikeapirate.com\")), saw the font, they were as happy as a pirate with a new chest o' doubloons. \"Avast ye buccaneers,\" Slappy said. \"Captain Quill be a beauty of a font.\" And Chumbucket added \"If ye want to be writin' like a swashbuckler, then lads an' lasses ye best download this treasure t'day!\"\n\nCaptain Quill is an exciting font that's loaded with adventure, perfect for pirate-themed documents, scrapbooking, invitations and correspondence. Creative Professionals will find the Captain Quill font useful for everything from logos, packaging, menus & headlines, as it lends an old-worldly feel with its authentic rough texture.\n\nCaptain Quill contains an extended Latin and Central European character set and the following OpenType features: Contextual Alternates (or Connection Forms), Contextual Ligatures, Discretionary Ligatures, Historical Ligatures (Pirate talk), Standard Ligatures, Stylistic Alternates, 2 Stylistic Sets and Swash characters. Note: an application with support for advanced OpenType Typographic features is required to access these features.\n\n ![](http://web.archive.org/web/20120105005632im_/http:/typophile.com/files/quill-02_4905.jpeg)\n\nThe Story Behind the Font  \nThe story behind the Captain Quill font is quite an adventure. While vacationing in Jamaica, Jim Ford stumbled on a small chest buried just a foot or two below the white sandy beach. Inside he found some items, most notably, the captain's log and diary of Paul Pierce (aka Captain Quill). Few historians know about Pierce, the forgotten son of Edward Teach (Blackbeard) and his 12th wife. Until recently, there has not been any historical evidence of Captain Quill's existence. In the captain's diary, Jim discovered Quill's very curious form of handwriting which would have been considered very unusual for the 18th century. From this handwriting, Jim enlarged and recreated the captain's hand, with several alternative forms and illustrations inspired by the Golden Age of Piracy.\n\nHow to Order  \nCaptain Quill is available for immediate download from Ascender's two font sites:\n\nFontMarketplace.com features affordably-priced professional-quality fonts packaged individually and in sets. The FontMarketplace.com website was designed to make it easy for first time font buyers and creative enthusiasts to browse, download and install fonts. [http://www.FontMarketplace.com](http://web.archive.org/web/20120105005632/http:/www.fontmarketplace.com/ \"http://www.FontMarketplace.com\") offers the TrueType™ version of Captain Quill priced at $4.99 with a license for use on one computer. FontMarketplace fonts include an automatic font installer for Windows™ XP & Vista users or as a compressed .zip file for Mac OS X or other systems. Click here to preview & purchase: [http://www.fontmarketplace.com/font/captain-quill.aspx](http://web.archive.org/web/20120105005632/http:/www.fontmarketplace.com/font/captain-quill.aspx \"http://www.fontmarketplace.com/font/captain-quill.aspx\")\n\nAscenderFonts.com has an extensive collection of OpenType and TrueType fonts, including a variety of multilingual fonts and Pro fonts for creative professionals. The site has interactive font previews to try a font before buying and downloading it. AscenderFonts.com features the Captain Quill font with a suggested retail price of $20.00 with a license for use on five computers. Click here to preview & purchase: [http://www.ascenderfonts.com/font/captain-quill.aspx](http://web.archive.org/web/20120105005632/http:/www.ascenderfonts.com/font/captain-quill.aspx \"http://www.ascenderfonts.com/font/captain-quill.aspx\")\n\nAbout Ascender  \nAscender Corporation is a leading provider of advanced font products. Ascender's founders are font industry experts and have been involved in developing many of the most important and influential fonts used in computers and mobile devices. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises and hardware & software developers. Ascender also provides TrueType & OpenType fonts for download to graphic designers and consumers through its font websites.\n\nContact:  \nBill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225, Elk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730  \nFax: (847) 357 0731  \nCorporate website: [http://www.ascendercorp.com](http://web.archive.org/web/20120105005632/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com\")  \nFontMarketplace website: [http://www.fontmarketplace.com](http://web.archive.org/web/20120105005632/http:/www.fontmarketplace.com/ \"http://www.fontmarketplace.com\")  \nAscenderFonts website: [http://www.ascenderfonts.com](http://web.archive.org/web/20120105005632/http:/www.ascenderfonts.com/ \"http://www.ascenderfonts.com\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20120105005632/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 13.Sep.2008 3.01pm",
  "uid": "108",
  "comments": [

  ]
}
