{
  "id": "4943",
  "title": "Minion as body copy??",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We (Outside magazine) are trying to find a new serif body copy font. Minion has crossed our radar but how can I possibly find out who else is using it? I called Adobe but the guy I talked to seemed unable/unwilling to help...\n\n",
  "author": "<a href=\"/web/20110107100624/http://typophile.com/user/3851\" title=\"View user profile.\">jana</a>",
  "time": "<br>",
  "uid": "3851",
  "comments": [
    {
      "time": "",
      "content": "After reading some old posts I guess the better question would have been who ISN'T using it. Is it really that ubiquitous?\n\n"
    },
    {
      "time": "",
      "content": "Yes, because it's one of those fonts that come bundled with Adobe apps.\n\n"
    },
    {
      "time": "",
      "content": "\\> who ISN'T using it.   \n   \nMy grandmother. She's dead.   \n   \nInstead of the more tired than tried Minion, you can surely find something better.   \n   \nTell us more about your magazine:   \n-The general style, including a titling font you might have settled on.   \n-What's it about? Who is it for?   \n-How long are the articles?   \n-What are the illustrations/photos like?   \n-How much of a design statement would you like it to make, versus serving the reader directly?   \netc.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>I called Adobe but the guy I talked to seemed unable/unwilling to help...   \n   \nUnless you were lucky enough to reach someone in the Adobe font group, a general sales guy would be unlikely to reel off a list of high-profile publishers/magazines using the font. You might be better off looking at the work of smaller vendors or independent type designers who can provide a more personal level of pre-sales support.   \n   \nSi\n\n"
    },
    {
      "time": "",
      "content": "Outside is a monthly outdoor/adventure/men's magazine published out of Santa Fe. If you go to SPD.org you might find some spreads of ours; we won Silver Medal for magazine of the year last year (ha! and yet here I am asking about Minion, hm?).   \n   \nThe photos and illos are usually pretty nice (illos by the Clayton Bros, Brian Cronin, Zohar Lazar, etc., photos by James Nachtwey, Anton Corbijn, Jake Chessum, etc.) .   \nI think the main thing is that our creative director would like to make a departure from the body copy font that she had to inherit when she arrived at the magazine. Right now we're using Caslon224 Book. Yeek. The other fonts we use mainly are Interstate, Giza and BigCaslon for display.   \n   \nI also thought that maybe Miller (Font Bureau) would work well as a new serif?\n\n"
    },
    {
      "time": "",
      "content": "Actually, Minion wasn't bundled with Adobe apps for a couple of generations, but it is with the CS apps. I think it's a first-rate text face, but it certainly is ubiquitous.   \n   \nMost of the other suggestions seem pretty solid. Iowan Oldstyle, Whitman and Miller are all great choices. I think Le Monde Journal is perhaps a little too refined for this usage (an objection that could also be made to Minion).   \n   \nOne other typeface of ours springs to mind for this usage: Chaparral. I think it would be an excellent choice if you're looking for something a little more out of the ordinary. As the name suggests, it has that sturdy, outdoorsy feel.   \n   \nBTW, sorry that our sales folks aren't as up on typography as one might like. ![:-(](http://web.archive.org/web/20110107100624im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "\\>how can I possibly find out who else is using it?   \n   \nYou could look at the magazines that are your competitors (either on the newstand or at awards shows) and identify which typefaces they are using.   \n   \nTo aid in identifying the faces, you should accumulate a library of specimen books and leaflets from the likes of Font Bureau, and Hoefler Type Foundry, in particular, who are much favored in the US magazine business.   \n   \nI can particularly recommend the Bureau's hard cover specimen, a real keeper.   \n   \nAnd of course, go to TypeCon -- the Goody Bag is a primo source of the best new stuff!\n\n"
    },
    {
      "time": "",
      "content": "Jana --   \n   \nIn addition to Font Bureau's showing of Whitman ( [http://www.fontbureau.com/fonts/font\\_frames.tpl?fontname=Whitman](http://web.archive.org/web/20110107100624/http:/www.fontbureau.com/fonts/font_frames.tpl?fontname=Whitman)), you can find a more extensive PDF specimen for download at my site: [http://www.kentlew.com/Type.html](http://web.archive.org/web/20110107100624/http:/www.kentlew.com/Type.html).   \n   \nWhitman is beginning to show up in magazines. I know of one here in the States and another in Europe. I can steer you toward printed examples, if this would help.   \n   \nAlso, if having a display version of your primary text face is an important consideration, there are some custom display weights of Whitman that have been developed, but are not yet available through the retail line. Feel free to contact me or Font Bureau if you'd like to know more.   \n   \nSorry to sound so blatantly self-promotional here.   \n   \n-- Kent.   \n   \nP.S. Thanks Tiffany, for the initial mention, and Thomas, for the endorsement.\n\n"
    },
    {
      "time": "",
      "content": "Thanks so much for all the great feedback! I've already gotten in touch with Sam at Font Bureau, but please keep the suggestions coming, they have all been so useful!   \n   \nToo many exclamation marks. Sorry.\n\n"
    },
    {
      "time": "",
      "content": "Jana, I'm thinking the three \"character traits\" you want here are: robust, honest, and youthful. Besides that you want something highly readable for a magazine, mostly meaning something with a somewhat large but not too large x-height. I'll resist suggesting a wedge-serif yet again (my \"pet genre\", Jana, since you might not have been here long enough to realize :-), but ideally I think you want something wide, somewhat rigid but a touch idiosyncratic, with chunky serifs.   \n   \nOf the suggestions so far, Whitman and Miller seem good, although the former might be a touch too feminine here - but its proportions are right on, and it has a bounce in its step that Miller might be lacking. Now that I think about it, maybe Miller is too stodgy here.   \n   \nBTW, in the Adobe library, besides Chaparral (a great suggestion) you might consider Warnock too.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "You know, I almost suggested Warnock, but somehow I thought that it's style wasn't quite right. Not as good a fit as Chaparral, anyway. IMO.   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "Congrats on ditching the Caslon 224.   \n   \nAs a fellow magazine designer, I respectfully disagree with Hrant and Thomas about Chapparal. I find it unattractive, mannered and dark en masse -- look at an old issue of Adobe magazine before it died to see Chapparal used as a text face. (Ick.)   \n   \nI'd second (or third?) the recommendation of Miller. It's plainspokenness would be an asset with all of the other faces (and expressive headline typography) that Outside uses. You don't need yet another face saying \"look at me!\"\n\n"
    },
    {
      "time": "",
      "content": "Come to think of it, why not use Adobe Caslon? It has a sturdy, organic feel (unlike the prissy Caslon 224) that would contrast with Interstate and harmonize with Giza. Its shared roots with Big Caslon make it a natural fit.\n\n"
    },
    {
      "time": "",
      "content": "Sound incredible how each time someone ask for suggestion for a publication in US, always same things are proposed.   \n   \nThere is many typefaces in FontFont for example who will fit perfectly.   \n   \nperhaps its a cultural thing?\n\n"
    },
    {
      "time": "",
      "content": "Same old, same old.   \n   \nHrant, you mentioned youthful as a criterion, and then suggested some old chestnuts.   \n   \nHow about a sans serif? (please, no \"immersive reading\" gobbledegook)   \n   \nJFP -- you're right about the cultural divide.   \n   \nAndy Cowles set the entire text -- heads, decks, captions, sidebars, pubset ads even, of New Woman (big UK mag) in Shinn Sans. More recently, he's at Rolling Stone, doing the Americana Victoriana thang.   \n   \nBTW, signs of the humanist in Cyrus Highsmith rebelling -- he has a new text sans on show at FB homepage.\n\n"
    },
    {
      "time": "",
      "content": "\\> always same things are proposed.   \n   \nYes, that's a problem (with me at least). When asked casually, people will propose what's at the top of their heads at the moment. My own \"excuse\" is that I have too little experience _using_ type (even less than your average type designer), but what I can try to do is apply what I've learned about \"congeniality\" (or what Ovink calls \"atmosphere value\") to the choices at hand.   \n   \nAnd I think what you're doing JF, staying in our \"minds\" by participating here, is good for your fonts.   \n   \n\\> Outside is a particularly American looking mag.   \n\\> So it is appropriate to go for something with   \n\\> a US flavor.   \n   \nBut suggesting a \"robust, honest, and youthful\" font for a male outdoorsy mag is not?   \n   \nPlantin Schoolbook: yes, I agree it's robust and honest, but more than youthful to me it just feels retarded. Those alternates are not working, as far as I'm concerned - certainly not for adult material - they were made to ease learning, and that's how they really work.   \n   \n\\> gobbledegook   \n   \nYes, do ignore 5 centuries of anecdotal evidence and a century of empirical evidence, because Larson said so. Oh and of course because Emigre said so. \"We Read Best What We Read Most.\" The Hogwash of the Century. And Avant Garde is just as readable as Adobe Garamond, at least as long as you read it -and nothing else- for 5000 years.   \n   \n [http://www.themicrofoundry.com/ss\\_read1.html](http://web.archive.org/web/20110107100624/http:/www.themicrofoundry.com/ss_read1.html)   \n   \nOh, I so wish there was a sans version of ITC Garamond, which we could set at 14 point in long lines, with big word spaces, negative leading and +25 tracking. That would be such a... _cultural_ statement. Just make sure the content isn't worth actually reading, 'cause nobody will.   \n   \nPeople are making _news_ faces with zero understanding of readabililty. That's \"democracy\" for you.   \n   \n--   \n   \nThat said, there is I think some cultural justification for using a sans in a magazine... although it certainly helps that magazine reading sessions tend to be very short! Don't pull a stunt like that in a book, unless you think that humans are ethereal beings who use osmosis and not vision to read.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>BTW, signs of the humanist in Cyrus Highsmith rebelling -- he has a new text sans on show at FB homepage.   \n   \nOOh, it's [Halo](http://web.archive.org/web/20110107100624/http:/12pointstype.com/work/pictures/typecon03/typecon03-Pages/Image71.html) ...   \n   \n(Or was. What's an Amira?).   \n   \nI've been waiting for that one.   \n   \nR\n\n"
    },
    {
      "time": "",
      "content": "Larson never said there was no such thing as immersive reading, and I have not seen anyone (other than Hrant, who was not at Larson's talks) claim that he said otherwise.   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "It depends on how you define \"immersive reading\". Larson's parallel-letterwise model is inherently limited in terms of how deep into immersion it can go. Any act of reading that doesn't use boumas can't be said to be fully immersive. For an adult reader, the only thing \"below\" parallel-letterwise reading is sequential-letterwise reading, and since adults are proficient in parallelism, it actually takes an extra effort to read sequentially - so the immersive threshold for adults is between letterwise and bouma, not sequential and parallel.   \n   \nBTW, I have spent plenty of time learning not only what Larson said, but also reading up on almost all his references. Anyway, there will be a round table discussion in Thessaloniki in a month (with John Hudson moderating, so I'm already at a disadvantage, even though I'm sure John will try to be objective - but a human is a human) and we'll see what people conclude.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> I don't think reading a magazine qualifies as \"immersive reading\".   \n   \nI agree (generally).   \nWhich is the main reason a sans can be OK for a magazine - not because readability is only a matter of culture - it isn't, just like a human shouldn't eat tree bark.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "BTW, I just thought of something: could it be that one reason (maybe not a main one) that I keep recommending \"honest\", \"robust\" fonts is that that's the type of project that's being brought up the most on Typophile? Maybe prissy financial types and stuff don't come here for help?   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>\"honest\", \"robust\" fonts   \n   \n\"Robust\" I can understand.   \nBut \"honest\"? Is that like a \"crisp, clean-tasting\" beer?\n\n"
    },
    {
      "time": "",
      "content": "Nick, I'm guilty of suggesting the \"same old,\" too. But what most of these suggestions seem to ignore is that the new text face has to work with the existing type -- Jana didn't say that Outside was undergoing a complete redesign. For that reason, and knowing that most headlines in Outside are \"designed,\" rather than merely \"set,\" I think quieter body type would make more sense.\n\n"
    },
    {
      "time": "",
      "content": "You're right of course, Marc, and Hrant always asks for the rest of the design context.   \n   \nBut it might still be possible to use a sans text face. My mentor, Raymond Lee, sometimes used Trade Gothic text with Bodoni heads -- the linear quality of the sans in harmony with the linear serifs and hairlines of Bodoni.\n\n"
    },
    {
      "time": "",
      "content": "ok, so, Outside is the subject? Something bit rough?   \nAs I proposed FontFont, why not   \n   \nFF Quadraat (A sans exist too with pretty nice condensed versions)   \n   \nFF Eureka   \n   \nFB Parkinson, not my prefer text face, but seems to give a \"Color.\"   \n   \nFB Prensa seems fit also.   \n   \nWhitman don't fit as its too round and calm to me for this subject. Its not that I don't like it, just seems doesn't fit here.   \n   \nAdobe Warnock sound not bad too. Not my taste, but fit well here I'm sure.   \n   \nVend\n\n"
    },
    {
      "time": "",
      "content": "Hey, wait a second - more than half of those are fonts I recommend all the time! :-)   \n   \n--   \n   \nJana, I just took a look at the current issue of Outside, and here's some ideas:   \n-It's a really busy, even riotous magazine! Sometimes even a humorless guy like me gets turned on - like I loved the look of that \"crazy mofos\" article.   \n-The Caslon for text actually has a charm here, I think - but it's also too frail, and a bit old-fashioned.   \n-Interstate: although it makes sense in an outdoor transportation sort of way, to me it feels like the odd man out: too plain, and not in a constructive way, because there's a lot going on anyway.   \n   \nSo I might suggest these ideas:   \n-Do try Chaparral. Coupled to that charming fat Egyptian for subheads, I think it might sing sing sing.   \n-Consider dumping Interstate. As a sub, try to find a sans that matches Chaparral. Like what?   \n   \nI think the highly \"talkative\" layout needs a somewhat more focused base to really work optimally, and reducing the number of fonts (which is not the same thing as taming all the fonts) might really click. On the other hand, no magazine I've designed has won an award. My defence here is that I've never designed a magazine. :-P   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, is there any subject on which you \\*don't\\* have an expert opinion? ;-)\n\n"
    },
    {
      "time": "",
      "content": "It's all in your head. The only thing I'm an expert at is being Hrant. And you'll never be.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Just wait for little Hrad to hit the type scene! ;-)   \nActually, he's nothing like me - he has a great sense of humor.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Jana -- OUTSIDE is too interesting for Minion. Interesting in a bold, graphic, appealing sort of way. I'm not an outdoorsy type, but I still find myself looking at the mag when I'm in Border's.   \n   \nMiller is wonderful. And as a bonus you can license the display and text versions when you feel like splashing out with larger serifs. I also think it flows well with Big Caslon. Or if you want something a little more understated you might look at Whitman (also from Font Bureau). Both have OsF and smallcaps and all the requisite goodies.   \n   \nAnother idea, perhaps a little more similar to Minion, but more interesting IMO, would be [Iowan Oldstyle](http://web.archive.org/web/20110107100624/http:/bitstream.com/categories/products/nfc/iowan_complete/iowan_complete.html) ... again all the goodies.   \n   \nOr, if you want a little more flavor than Minion, something truly French, you might try [Le Monde Journal](http://web.archive.org/web/20110107100624/http:/www.typofonderie.com/alphabets/view/LeMondeJournal)\n\n"
    },
    {
      "time": "",
      "content": ".. another thought ... [Jeremy Tankard's](http://web.archive.org/web/20110107100624/http:/typography.net/) Enigma.\n\n"
    },
    {
      "time": "",
      "content": "Wow, really nice to see _Outside_ drop by here. I've loved much   \nof the magazine's design over the years.   \n   \nTiffany's call for Enigma is a good one. Pick up a copy of _Details_   \nfor an example of how well it works.   \n   \nI think another interesting choice was _Wallpaper_'s use of   \nPlantin Schoolbook. Plantin is a proven long-reading face, but   \nthe 'a' and 'g' variants of the Schoolbook version lent a distinctive   \nquality without being overbearing. Not sure if they're still using   \nit because I haven't seen _Wallpaper_ in a while, but [here](http://web.archive.org/web/20110107100624/http:/typographi.ca/000490.php)'s an   \nexample of the copy I saw.   \n   \nOf course, none of these have the condensed quality of Minion,   \nbut I think condensed is overrated for a text face. Instead, use a   \nsmaller point with generous leading.\n\n"
    },
    {
      "time": "",
      "content": "\"each time someone ask for suggestion for a publication in US,   \nalways same things are proposed.\"   \n   \nBingo, JFP! It's always Miller, Miller, Miller! Set one page in   \nPlantin School and tell me it doesn't look - as Hrant duly   \nsuggested - \"robust, honest, and youthful.\"   \n   \nI think Fenway is Carter's best magazine face anyway.\n\n"
    },
    {
      "time": "",
      "content": "BTW, JFP, one reason so many Am/English designs are suggested   \nis because Outside is a particularly American looking mag. So it   \n_is_ appropriate to go for something with a US flavor.\n\n"
    },
    {
      "time": "",
      "content": "Yes. I'm guilty. Miller is something I've worked with recently and so it is easy access. But hey, I could've suggested Tyfa (and Mrs. Eaves and Regent). But as Fast Company still uses it, although it is a different niche, maybe it isn't a good choice.   \n   \nI think that Plantin Schoolbook is too wide for magazines. Not everyone can read 9pt. type and relax at the same time.   \n   \nI don't think reading a magazine qualifies as \"immersive reading\".\n\n"
    },
    {
      "time": "",
      "content": "Another thought: [Hollander](http://web.archive.org/web/20110107100624/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdisplay&displayfontid=EF.512.0.0&packagefontid=0&view=package&searchID=0&searchby=keyword&searchletter=A&searchstr=hollander&totalrecords=13&startrow=1&records=20&currpage=1).   \nAn overlooked Unger face that's less chiseled than Swift.\n\n"
    },
    {
      "time": "",
      "content": "never be what? an expert at being hrant? ah ahem, thank goodness! wouldn't want two hrant's running around! ;^)\n\n"
    }
  ]
}
