{
  "id": "49480",
  "title": "Wedding Monogram for D&H M",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Here is a wedding monogram I am working on for my brother's wedding. My soon to be sister-in-law is excited to have the elaborate swashes in the monogram. Let me know what you think of the forms. Thanks\n\n ![](http://web.archive.org/web/20130823193320im_/http:/typophile.com/files/DHM7_5616.png)\n\n",
  "author": "EricFromPTown",
  "time": "15 Sep 2008 — 2:18pm",
  "uid": "21313",
  "comments": [
    {
      "time": "15 Sep 2008 — 2:22pm",
      "content": "Slightly over the top, in my modest opinion.\n\n"
    },
    {
      "time": "15 Sep 2008 — 2:27pm",
      "content": "Slightly?\n\n"
    },
    {
      "time": "15 Sep 2008 — 2:39pm",
      "content": "It looks like it was poorly live-traced in illustrator. Are you going for a more organic letter-form feeling?\n\nFor me, the forms are too broken up by the swashes and don't really look well crafted or well integrated. I'd suggest coming up with more variations on this that use different letter placements. For examples on swashes and similar letter-forms, I'd suggest looking at the [sudtipos](http://web.archive.org/web/20130823193320/http:/www.sudtipos.com/home) type foundry. They have a lot of great script fonts with lots of open type options.\n\nAlso, it looks more like D&MH, not D&HM.\n\npenn\n\n"
    },
    {
      "time": "16 Sep 2008 — 6:39am",
      "content": "It being a wedding, my wholly uneducated opinion is that OTT is expected…however, the M is overbearing and does make it look like D&MH.\n\n"
    },
    {
      "time": "16 Sep 2008 — 6:44am",
      "content": "There is no coherency. It is too much.  \nIt is more of an illustation. Not a well one, I'm afraid.  \nVery cluttered. Sorry.\n\n"
    },
    {
      "time": "4 Dec 2008 — 6:40pm",
      "content": "wow, this monogram is a bit hard to read as is.  \nsize it down to 25% and have someone who has never seen it and does not know the couple read it.\n\nif they cannot decipher the letters, you then should reconsider a simpler route.\n\n"
    }
  ]
}
