{
  "id": "49500",
  "title": "Greek Typeface / Bekkeriana",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Does anyone knows, where I could get hold of this typeface or any similar one?\n\nI am looking for a font which refers to a genuine greek typographic style – if that makes sense … :)\n\nDoes anyone have any idea?\n\n| Attachment | Size |\n| --- | --- |\n| [bekkariana.pdf](http://web.archive.org/web/20131101121908/http:/typophile.com/files/bekkariana.pdf) | 40.79 KB |\n\n",
  "author": "piero101",
  "time": "16 Sep 2008 — 4:02am",
  "uid": "31988",
  "comments": [
    {
      "time": "16 Sep 2008 — 4:41am",
      "content": "Have a look at the Greek Font Society's website ( [http://www.greekfontsociety.gr/pages/en\\_typefaces1.html](http://web.archive.org/web/20131101121908/http:/www.greekfontsociety.gr/pages/en_typefaces1.html \"http://www.greekfontsociety.gr/pages/en\\_typefaces1.html\")). You will find something similar (eg. Bodoni Classic and Gazis from the 18th century fonts).\n\nI don't understand though who (and how) came up with the name Bekkariana?\n\nGeorge Triantafyllakos - backpacker.gr\n\n"
    },
    {
      "time": "16 Sep 2008 — 4:48am",
      "content": "May I quote »Keeping Greek Typography Alive« by Yannis Haralambous:\n\nA good friend and colleague of ours at ENST de Bretagne, Prof. Ioannis Kanellos, has started an initiative against this trend, by giving us the opportunity to modelize the typesetting of a very important collection of books : the Aristotelian Collected Works by the German scholar Bekker of the Academy of Leipzig.  \nThe typeface used in these books, and especially in the earlier volumes, is a pure masterpiece of 18th-19th century Greek typefaces. It has practically no ligatures ( besides omicron-upsilon and sigma-tau ) but keeps the manuscipt style of earlier Greek typefaces. The placement of accents is amazingly dynamic : in some cases, an accented letter seen out of context seems to be completely wrong. The same letter seems completely natural in the context of a word.  \nWe hope that this typeface, called »Bekkeriana« in honour of Bekker, will contribute to the revival of older Greek typefaces and bring the Greek audience closer to part of the ( typographical ) history of its language.\n\n[http://omega.enstb.org/yannis/](http://web.archive.org/web/20131101121908/http:/omega.enstb.org/yannis/ \"http://omega.enstb.org/yannis/\")\n\n[http://omega.enstb.org/yannis/pdf/thessaloniki.pdf](http://web.archive.org/web/20131101121908/http:/omega.enstb.org/yannis/pdf/thessaloniki.pdf \"http://omega.enstb.org/yannis/pdf/thessaloniki.pdf\")\n\n"
    },
    {
      "time": "16 Sep 2008 — 4:50am",
      "content": "And thanks for the link to the Greek Font Society. I already knew them and appreciate their work a lot, but their fonts doesn't refer to old greek typesetting. Obviously Bodoni isn't a greek typeface ;)\n\n"
    },
    {
      "time": "16 Sep 2008 — 5:22am",
      "content": "It is a category mistake to think that Bodoni Greek reflects ‘old Greek typesetting’ any more or less than does the typeface used in Bekker’s Aristotelis Opera. A typeface is Greek because it is designed to set the Greek language. Many of the great type designers, Bodoni included, cut Greeks for academic works which are no more or less authentic than Bekkeriana.\n\nBekker’s Aristotle editions were printed in Berlin in the early nineteenth century and the use of the particular Greek typeface reflect the tastes of their time and the place of printing (and, perhaps even more importantly, the availability of type) as much as the use of any roman typeface. Bekkeriana closely resembles the cursive Greek cut in the late eighteenth century by Alexander Wilson of Glasgow (which has been digitized by Matthew Carter). Like Bodoni, Wilson was a punchcutter in the romantic tradition.\n\nBekkeriana reflects ‘old Greek typesetting’ only to the extent that it is an old typeface that was designed to set Greek, and its original is much more likely to have been produced on the shores of the North Sea than the Aegean.\n\n"
    },
    {
      "time": "16 Sep 2008 — 5:30am",
      "content": "Incidentally, the Junicode font for medievalists designed by Peter Baker now contains a 'beta' version of a new digitization of Wilson's Greek, which I think you'll find has a very similar feel to Bekkeriana. See pages 3-4 of [this pdf](http://web.archive.org/web/20131101121908/http:/inamidst.com/stuff/archive/Junicode.pdf). Junicode is available at [http://junicode.sourceforge.net/](http://web.archive.org/web/20131101121908/http:/junicode.sourceforge.net/).\n\n"
    },
    {
      "time": "16 Sep 2008 — 7:14am",
      "content": "Wow, I guess Junicode will be very handy sometime…\n\nThank you very much!\n\n"
    }
  ]
}
