{
  "id": "49507",
  "title": "What is this typeface?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "All I know is that it comes from a book printed in Venice, ca. 1694. The name of the book is Cicceide Legitima, by Francesco Lazzarelli. These are some pictures from pages of the third edition. Notice the unusual shape of the g in both roman and italic versions. Any help will be greatly appreciated.\n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/DSC04518_3952.JPG)\n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/DSC04525_6016.JPG)\n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/DSC04530_3716.JPG)\n\n",
  "author": "Cesar Puertas",
  "time": "16 Sep 2008 — 8:04am",
  "uid": "7466",
  "comments": [
    {
      "time": "16 Sep 2008 — 8:36am",
      "content": "I went to my copy of Updike's \"Printing Types\" and looked at the sections on \"Italian Types 1500-1800\". He shows a type specimen from Rome in 1628 called \"Canon Grosso\" from the Stamperia Vaticana. This has the same G of your sample and other letters also seem consistent with your Roman sample. The type is named according to size, apparently, with \"Ascendonica\" being a similar typeface in a smaller size. The italic is called \"Corsivo Grosso\", but it does not match your samples. One thing Updike describes is how much of Italian printing during the 17th century mixes typefaces, using whatever is at hand, so perhaps this should not be surprising.\n\nI could not find a sample of an italic that matches yours. I notice that the italic 'g' varies quite a bit in your samples.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Sep 2008 — 10:48am",
      "content": "Thank you, Mike!\n\nThe information you provide is very ellucidating. I'll see what I can get from the data you provided.\n\nThanks again!\n\nCésar Puertas  \ndiseñador (tipo)gráfico  \n [www.cesarpuertas.com](http://web.archive.org/web/20150317171858/http:/www.cesarpuertas.com/ \"www.cesarpuertas.com\")  \n [cepuertas@hotmail.com](mailto:cepuertas@hotmail.com)\n\n"
    },
    {
      "time": "3 Oct 2008 — 7:51am",
      "content": "Well, that’s quite a tricky one, and it’s hard to say what your chances are to actually find out ...\n\nMy guess for the italic is:  \nThis font is from poorly justified matrices (too much letter spacing/tracking and dancing baseline) from punches by Robert Granjon.  \nSome letters like ‘r, m, n, p, a, t, g, long s’ share characteristics with Granjon’s italics.  \n(Some letters like ‘z’ look as if these were later additions/replacements. But then again, Granjon’s italics were quite popular, and therefore often imitated, so probably it’s not by Granjon at all.)  \nIt’s quite possible that the capitals of the italics are from a different font.\n\nMy advice:  \nMeasure the fonts (caps height, x-height, measurement for 20 lines) and compare with Vervliet's article on Granjon (I hope you have access to a library with good typography books):\n\nH. D. L. Vervliet: ‘The italics of Robert Granjon’,  \n in: Typography Papers 3 (1998), pp 5–59\n\nAlso these two books are quite useful:  \nJ. Dreyfus: Type specimen facsimiles I (1–15)  \nH. D. L. Vervliet, H. Carter: Type specimen facsimiles II (16–18)\n\nGood luck.\n\n"
    },
    {
      "time": "21 Oct 2008 — 9:47am",
      "content": "This is how I started the revival. It's all wrong. I made way too many assumptions and did not even start using the actual proportions of the typeface.\n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/attempt1_6078.jpg)\n  \nLater on, with the help of a teacher, (Erik van Blokland) I realized that I was making a mistake, a big one and started from scatch. I made a high resolution scan and superimposed from 6 to 9 prints of each letter. This helped me to find the maximum average surface of every letter, as if the ink spreaded out more or less evenly from the center of the ductus of the letters in the surface of the lead type.  \n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/maximums_4344.jpg)\n  \nThis exercise allowed me to understand the real proportions of the original typeface even if I didn't have any information regarding details such as shape of the serifs, etc. The next logical step was to start drawing with the information available but from the inside out, avoiding assumptions about the details and concentrating efforts on the proportions and the desired characteristics of the revival. The shapes derived from this exercise can certainly be far from the original but at least provided a solid ground for drawing.  \n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/attempt2_3580.jpg)\n  \nNew shapes emerged when trying to be respectful to the self-imposed limits. I borrowed some shapes typical from 15th and 16th century typefaces such as Adobe Garamond Pro to fill the \"empty spaces\".  \n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/attempt3_4396.jpg)\n  \nNext step consisted on trying to simulate a texture with the few drawings available. The tool available at adhesiontext.com was a great help on this.  \n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/textura_3745.jpg)\n  \nNow I am trying to complete the lowercase set. Your feedback will be greatly appreciated.  \n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/textura%20minusculas_6243.jpg)\n\n"
    },
    {
      "time": "21 Oct 2008 — 10:58am",
      "content": "What's your aim with this font? Your method leaves you with \"soft\" looking letters - you would get that with letterpressed ink spread of course, but in that case the physical impression also lends a sharpness that your font won't have.\n\nYour method has given you very solid proportions, though, it seems to me.\n\n"
    },
    {
      "time": "22 Oct 2008 — 8:18am",
      "content": "Hello eliason,\n\nThe aim is to revive the typeface used on the book. I am still not very sure about the shape of many details, but this is what I got. Thank you for your feedback!\n\nCésar Puertas  \n [www.cesarpuertas.com](http://web.archive.org/web/20150317171858/http:/www.cesarpuertas.com/ \"www.cesarpuertas.com\")  \n [cepuertas@hotmail.com](mailto:cepuertas@hotmail.com)\n\n"
    },
    {
      "time": "23 Oct 2008 — 9:07am",
      "content": "I am trying to find a system of proportions in the design, in order to revive not only the shapes put their spacing. Everything seems to be based on twelfths of the em quadrat. Does anybody know if this was common practice in the 17th century?\n\n ![](http://web.archive.org/web/20150317171858im_/http:/typophile.com/files/proportions_4173.jpg)\n\n"
    },
    {
      "time": "30 Nov 2014 — 5:53am",
      "content": "Too bad this thread died. Are there any people interested in contributing more information? And what happened to this revival?\n\n"
    },
    {
      "time": "30 Nov 2014 — 6:18am",
      "content": "> what happened to this revival?\n\nIt was published:  \n [http://www.myfonts.com/fonts/cepuertas/legitima/](http://web.archive.org/web/20150317171858/http:/www.myfonts.com/fonts/cepuertas/legitima/ \"http://www.myfonts.com/fonts/cepuertas/legitima/\")  \n [http://www.behance.net/gallery/19147947/Legitima-a-17th-century-revival](http://web.archive.org/web/20150317171858/http:/www.behance.net/gallery/19147947/Legitima-a-17th-century-revival \"http://www.behance.net/gallery/19147947/Legitima-a-17th-century-revival\")\n\n"
    },
    {
      "time": "30 Nov 2014 — 7:22am",
      "content": "Thanks for the link. Very nice work.\n\n"
    }
  ]
}
