{
  "id": "49510",
  "title": "Serif Font in Small Point Size",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,  \nI have recently taken on a print design job for a high class directory of top top restaurants, hotels and golf courses. The directory in question is not a publication like a phone directory, more of a listing of participating high brow establishments that members who subscribe to the directory can get benefits from and therefore has more extensive body copy for each establishment that that of a directory such as a phone directory (I only mention as I think it is an important factor on the selection of font choice).\n\nAnyway, I was looking to use a nice serif font for these listings although the text size is restricted to that of 6pt and therefore not suitable for all serifed fonts due to loss of definition at smaller sizes. I was hoping though of some possible suggestions by posting my situation on this forum. The main qualities I am looking for from my font choice is that it works at 6pt, has a good variation between bold and book/light and have a high class look. Any suggestions would be much appreciated. Thankyou.\n\n [‹ How did I do that again?](http://web.archive.org/web/20081201095607/http:/www.typophile.com/node/49535 \"Go to previous forum topic\") [Fanzine binding ›](http://web.archive.org/web/20081201095607/http:/www.typophile.com/node/49361 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201095607/http://www.typophile.com/user/22306\" title=\"View user profile.\">jarbinson</a>",
  "time": "<br>",
  "uid": "22306",
  "comments": [
    {
      "time": " 16.Sep.2008 8.41am",
      "content": "I used Hoefler Text before at 6pt. If you have the right kerning and paper, it works fine.\n\n"
    },
    {
      "time": " 16.Sep.2008 9.05am",
      "content": "Stone’s [Cycles](http://web.archive.org/web/20081201095607/http:/www.stonetypefoundry.com/cyclesoverview.html) has cuts for 5 and 7 points. It’s beautiful, and Stone’s prices have come down recently; Cycles is an absolute steal! Sadly, only available in Type 1 currently: the site says OpenType is “not yet available”, which gives one hope.\n\nSee also [Bodoni Six.](http://web.archive.org/web/20081201095607/http:/www.stonetypefoundry.com/bodoni6specimen.html) It’s available in OpenType, but not from Stone himself. FontHaus has it a good price [here.](http://web.archive.org/web/20081201095607/http:/www.fonthaus.com/products/fonts/view.cfm/sku/MI-OPP613153.cfm)\n\n[Clifford 6](http://web.archive.org/web/20081201095607/http:/www.fontshop.com/fonts/singles/fontfont/ff_clifford_ot_6_regular/) is great, and available in OpenType.\n\nYou might also pester Nick Shinn about his upcoming Scotch Modern micro.\n\n"
    },
    {
      "time": " 16.Sep.2008 9.34am",
      "content": "Check out ITC Charter. It’s got chunky serifs, so it works well at small sizes, and there’s good contrast between regular and bold. Although it’s a lovely typeface, it may not meet your “high class” criteria.\n\n"
    },
    {
      "time": " 16.Sep.2008 1.40pm",
      "content": "Arno Pro, Garamond Premier Pro, and Warnock all have caption sizes which work very well at small sizes.\n\n"
    },
    {
      "time": " 16.Sep.2008 3.21pm",
      "content": "I’d say if you wanted class go with Matthew Carter’s Charter (with a touch of hz scaling and a little extra tracking). And of course Cycles 5 is ideal — and as John points out, a steal. Too bad Lino has never released Carter’s tiny size version of Optima.\n\n"
    }
  ]
}
