{
  "id": "49528",
  "title": "Fee for extending a character set",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I have the opportunity to extend the character set for a corporate typeface. It's a script, meant to look handpainted. I pitched them on the idea of creating OpenType ligatures to give it a more handpainted feel, and they'd like to do it. But I don't really know what the going rate for something like that is -- the Graphic Artist's Guild Handbook talks about rates for customizing typefaces and creating new ones, but not really anything this specific. Any ideas based on your own experiences? Maybe a per glyph fee?\n\n",
  "author": "FeeltheKern",
  "time": "16 Sep 2008 — 3:15pm",
  "uid": "10069",
  "comments": [
    {
      "time": "16 Sep 2008 — 3:33pm",
      "content": "Talk to Charles de Borges.\n\n[http://www.borgeslettering.com/](http://web.archive.org/web/20131019032907/http:/www.borgeslettering.com/ \"http://www.borgeslettering.com/\")\n\nHe is in your neighborhood and fully capable.\n\nMichael\n\n"
    },
    {
      "time": "16 Sep 2008 — 3:40pm",
      "content": "I'm not really looking to pass it off to anyone, even though I have no doubt Charles de Borges is way more capable than me, since I would really like to do type design professionally down the road.\n\n"
    },
    {
      "time": "16 Sep 2008 — 3:56pm",
      "content": "I'm sorry, I figured you worked for these people and you were looking for outside help. Mea culpa. Lo siento mucho.\n\nMichael\n\n"
    },
    {
      "time": "16 Sep 2008 — 4:05pm",
      "content": "Haha I'm a graphic designer who would like to be a type designer, but I haven't released any fonts yet. I'm only weaseling my way into this job because they don't know that there are people out there who could do a much better job than me, and I do normal graphic design work for them too.\n\n"
    },
    {
      "time": "16 Sep 2008 — 5:49pm",
      "content": "So if he is way more capable then let him do it and raise your estimation in your clients eyes by pleasing them. And then you have more time to hone your skills as a type designer and learn from Charles.\n\nMichael\n\n"
    },
    {
      "time": "17 Sep 2008 — 1:47pm",
      "content": "If all of us passed off everything to people who are better than us, than none of us would take on any work. I see the job as an opportunity to hone my skills, and I feel capable enough to do it correctly with the right OpenType code and following the curve patterns of the existing font. Maybe we should all pass our jobs on to Matthew Carter and Jonathon Hoefler ;)\n\n"
    },
    {
      "time": "17 Sep 2008 — 2:15pm",
      "content": "Did not intend to be rude, just trying to be helpful.\n\nMichael\n\n"
    },
    {
      "time": "20 Sep 2008 — 10:23pm",
      "content": "I can't think you can do anything other than quote based on your hourly rate, plus some padding for inevitable re-work. Under-charging and usin this as a learning experience probably isn't a good idea, esp. if you plan to do repeat work with this client.\n\nHowever I do like the idea of adding some fees for expert consultation and travel, and perhaps hiring Matthew or Jonathan for half a day to review the work. :-)\n\nAlso if the “corporate font” is being used in corporate apps and OS’s be sure that the client understands that the features won’t work in those apps.\n\n"
    },
    {
      "time": "21 Sep 2008 — 11:44am",
      "content": "Thanks Sii!\n\n"
    }
  ]
}
