{
  "id": "49543",
  "title": "You're on a deserted island",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "And you get one typeface...\n\ncomic sans\n\nor\n\npapyrus\n\ngo\n\n [‹ Slab Serifs ⅹ Three](http://web.archive.org/web/20081025044613/http:/typophile.com/node/49429 \"Go to previous forum topic\") [(P)honogram . . . we still doin' these? ›](http://web.archive.org/web/20081025044613/http:/typophile.com/node/49669 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025044613/http://typophile.com/user/34584\" title=\"View user profile.\">kamolahy</a>",
  "time": "<br>",
  "uid": "34584",
  "comments": [
    {
      "time": " 16.Sep.2008 11.36pm",
      "content": "It would be more of a challenge if we were forced to use the fonts for something. On a deserted island we wouldn’t need either. I suggest altering the challenge slightly:\n\nYou may only use one font in your designs for the rest of your life. Comic Sans or Papyrus? Go.\n\n"
    },
    {
      "time": " 17.Sep.2008 1.30am",
      "content": "With Papyrus you will always find work in the spa identity field so if you want to put food on the table go with Pappy\n\nSi\n\n"
    },
    {
      "time": " 17.Sep.2008 1.55am",
      "content": "If you get a typeface you get a specimen of some sort and you can use it for fire.\n\n"
    },
    {
      "time": " 17.Sep.2008 4.13am",
      "content": "Nothing personal, but I’d remove the zipper from my pants, use it and the thread to make a lure and line, catch a poisonous fish and eat it. (But only if I couldn’t convince you to eat it first).\n\nCheers!\n\n"
    },
    {
      "time": " 17.Sep.2008 4.20am",
      "content": "i like David’s answer\n\n"
    },
    {
      "time": " 17.Sep.2008 5.17am",
      "content": "Oh God not another one.\n\nNothing personal, but I would stick both fonts up my arse for nothing and fack off while I was doing it.\n\nWhat a kind of challenge is this one supposed to be? Weak, weak, weak. Too boring even for pretend consideration. Also try: spam fritters, war stories, teling people “Eh gah, it were all different in my day lad.”\n\nj a m e s\n\n"
    },
    {
      "time": " 17.Sep.2008 6.12am",
      "content": " ![](http://web.archive.org/web/20081025044613im_/http:/typophile.com/files/WM_textme_4881.jpg)\n\n"
    },
    {
      "time": " 17.Sep.2008 6.19am",
      "content": "\\>Oh God not another one.\n\nCome on James it’s been almost a week. ;-)\n\nMaybe the guidelines should be adjusted to outlaw posts like this?\n\n"
    },
    {
      "time": " 17.Sep.2008 6.23am",
      "content": "“Eh gah, it were all different in my day lad.”  \nLOL! That’s right sonny, in my day, it would have been Cooper Black or Clarendon Bold :-)\n\nChrisL\n\n"
    },
    {
      "time": " 17.Sep.2008 6.56am",
      "content": "mix em up and take one... anagram.... comicsans+papyrus = Conspiracy spam US.\n\n"
    },
    {
      "time": " 17.Sep.2008 12.33pm",
      "content": "Assuming we’d get any point size we wish. I want 600 pt Comic Sans. It is a little more readable and maybe I’d be rescued a little sooner. =P\n\n"
    },
    {
      "time": " 17.Sep.2008 2.04pm",
      "content": "Tiff,  \nIt is TrueType! You can scale that puppy up as big as you want! As long as you had a humongous plotter or inket printer conveniently located on your Island (or at least a Kinkos :-)\n\nChrisL\n\n"
    },
    {
      "time": " 17.Sep.2008 2.35pm",
      "content": "And make sure there’s enough toner for that plotter!\n\n ![](http://web.archive.org/web/20081025044613im_/http:/typophile.com/files/helf_3506.jpeg)\n\n"
    },
    {
      "time": " 17.Sep.2008 4.49pm",
      "content": "<cite>stick both fonts up my arse for nothing and fack off while I was doing it.</cite>\n\nlol - a ’Withnail & I’ fan James? One of my all time faves.\n\nDefinitely Papyrus. I have seen some decent food packaging with Papyrus recently - much to my sheer astonishment. I will try and find it but I can’t even remember what it was.\n\nJay\n\n"
    },
    {
      "time": " 17.Sep.2008 4.54pm",
      "content": "Two I found that are pretty good;\n\n ![](http://web.archive.org/web/20081025044613im_/http:/typophile.com/files/263525625_5bea679c3b_3505.jpg)\n\n ![](http://web.archive.org/web/20081025044613im_/http:/typophile.com/files/287443933_829e829deb_6654.jpg)\n\nBut if I had some ice-cold sweet green tea and some delicious goat cheese on a dessert island I would not give a f\\*\\*\\* what type the packaging was set in :)\n\n"
    },
    {
      "time": " 18.Sep.2008 4.41am",
      "content": "Papyrus\n\n———————————-  \nMichael Browers  \n [www.michaelbrowers.com](http://web.archive.org/web/20081025044613/http:/www.michaelbrowers.com/ \"www.michaelbrowers.com\")\n\n"
    },
    {
      "time": " 18.Sep.2008 5.02am",
      "content": "\\>Oh God not another one.\n\nHere’s another five...\n\nYou’re in the basement of the Linotype office when a fire breaks out (don’t look at me). You can only rescue two sets of original drawings, what do you save?\n\nYou’re in a bar when a fight breaks out between Meta and Avenir. Which one do you clock with a half empty vodka bottle?\n\nThe US font foundries are about to go out of business (due to some font embedding scheme that went awry) – if you were the US government which one would you bail out?\n\nYou have a fox, a chicken, a row boat, a copy of InDesign CS 4, and a 1200dpi laser printer. How do get them all across the river?\n\nA train leaves Chicago at 8am, and another leaves St Louis at 10am – which font gets to Los Angeles first.\n\n"
    },
    {
      "time": " 18.Sep.2008 5.24am",
      "content": "1. Dwiggins drawings of Gill with his dog and Gill’s dog’s drawings of Dwiggins with Gill.  \n2. While in Russia, it is illegal to discuss, or email a discussion pertaining to the wasting of vodka. Hide.  \n3. If I were the US government you’d be the very first to know.  \n4. Print 10 pictures of the chicken, rub them on the bird and feed them to the fox. When he’s full, load the boat and go.  \n5. What font is it?\n\nCheers!\n\n"
    },
    {
      "time": " 18.Sep.2008 7.52am",
      "content": "Pardon me while I hijack this thread: David what is your avatar? I always look a it and think:\n\n• Uzi? Nah, can’t be?  \n• A map of Bezerkistan?  \n• Freda Khalo’s monobrow, but she forgot to shave her nose?\n\nAnd now with the additional elements:\n\n• Par 5, US Open 1998 (with flag and bunker positions for each round)?\n\nWait wait...  \n• The truetype hints for the Typophile T?\n\nYou and Si, way to salvage this thread.\n\n"
    },
    {
      "time": " 18.Sep.2008 9.06am",
      "content": "“Pardon me while I hijack this thread: David what is your avatar?”  \nPardon me while I answer: A mystery. You want a closer look?  \nCheers!\n\n"
    },
    {
      "time": " 18.Sep.2008 11.10am",
      "content": "Sii—LOL! I really don’t mind these threads any more. In line with my policy tolerance, I’m tolerating this one in good faith and with a sense of humour ;^)\n\njayyy—yep, I love that film and Richard E. Grant is one of my favorite actors.\n\nSay, that Goat Brie packaging looks decent. Good find!\n\n_Here’s another five..._\n\nYou’re in the basement of the Linotype office when a fire breaks out (don’t look at me). You can only rescue two sets of original drawings, what do you save?\n\nITC Machine, Gill Sans\n\n_You’re in a bar when a fight breaks out between Meta and Avenir. Which one do you clock with a half empty vodka bottle?_\n\nBlow up the bitch with the firecracker smile. Sorry I can’t take that one seriously.\n\n_The US font foundries are about to go out of business (due to some font embedding scheme that went awry) – if you were the US government which one would you bail out?_\n\nNone of them. They are all corrupt and not worth saving. If anything, I would buy up shares or assets in each foundry at the fire sale, take control of all companies, and sink them into oblivion.\n\n_You have a fox, a chicken, a row boat, a copy of InDesign CS 4, and a 1200dpi laser printer. How do get them all across the river?_\n\nDon’t pay the ferryman!\n\n_A train leaves Chicago at 8am, and another leaves St Louis at 10am – which font gets to Los Angeles first._\n\n“The beast stops at Swindon, I’m having treatment, and La Fontaine can get knotted!” — John Cleese\n\nj a m e s\n\n"
    },
    {
      "time": " 18.Sep.2008 11.37am",
      "content": "@dberlow: _“Pardon me while I hijack this thread: David what is your avatar?”_\n\nOh don’t be so ridiculous. Tolerate it and resist the urge to retaliate or at least suppress what he is saying. Then you and others won’t be goaded into incivility and the hijacking is prevented by stopping the escalation of childish ad hominem personal remarks.\n\nI blame Neil Diamond and his A & R people.\n\nj a m e s\n\n"
    },
    {
      "time": " 18.Sep.2008 5.05pm",
      "content": "I believe Randy was just being curious and not attacking David. Ergo, the word “tolerate” isn’t needed.\n\n"
    },
    {
      "time": " 18.Sep.2008 8.08pm",
      "content": "I can’t stand Papyrus.\n\nI choose Papyrus.\n\n"
    },
    {
      "time": " 19.Sep.2008 12.35am",
      "content": "Tiffany, I’m complaining about David Berlow’s ego, which takes the form of intolerant humour. David is being his usual egotistical self, and he has on many other occasions made ad hominem personal attacks on perfectly innocent people who become victims of his vitriol.\n\n_I believe Randy was just being curious and not attacking David._\n\nExactly! I thought the same thing about Randy, but it seems David must make something of it and retaliate with his silly egotistical personal attack.\n\nTry and see my use of the word “intolerance” in color, or at least shades of gray, rather than black & white. I’m not using the word in a cut ’n dried sense.\n\nj a m e s\n\n"
    },
    {
      "time": " 19.Sep.2008 5.22am",
      "content": "Right Tiff, David wasn’t attacking Randy, he was being funny back with not a hint of sly or slime. James on the other hand, can anyone who’d save ITC Machine first be taken seriously? It’s all straight lines, doesn’t really need drawings. I think he wants to work at Microsoft from the pattern of the sounds he makes, which would probably be a good fit, as they have an excellent health benefits program, (think that’s what he means by intolerant humor?).\n\nCheers!\n\n"
    },
    {
      "time": " 19.Sep.2008 6.34am",
      "content": "Just found this : [http://www.aiac.org/ing/congresso\\_2008/home.htm](http://web.archive.org/web/20081025044613/http:/www.aiac.org/ing/congresso_2008/home.htm \"http://www.aiac.org/ing/congresso\\_2008/home.htm\")\n\n"
    },
    {
      "time": " 19.Sep.2008 8.12am",
      "content": "Seems that papyrus with its rough edges would come in more useful for hacking down trees or cutting up wild boar.\n\nComic sans...I dunno...does it float? Maybe one could create a raft form it? It think cooper black would be better for that, though.\n\n"
    },
    {
      "time": " 19.Sep.2008 8.22am",
      "content": "I’ll take Comic Sans over Pap Smear any day. Comics Sans says “brownies in the breakroom” — at its worst, it’s a passive aggressive sign in the kitchen that says “Your mother doesn’t live here...” in rainbow colors.\n\nPapyrus is the annoying quote in email signatures set in hunter green. Maybe it’s from Joseph Campbell, maybe Gandhi, but it’s going to wear thin very fast. Much worse in my book.\n\n"
    },
    {
      "time": " 19.Sep.2008 8.39am",
      "content": "_Right Tiff, David wasn’t attacking Randy, he was being funny back with not a hint of sly or slime. James on the other hand, can anyone who’d save ITC Machine first be taken seriously? It’s all straight lines, doesn’t really need drawings. I think he wants to work at Microsoft from the pattern of the sounds he makes, which would probably be a good fit, as they have an excellent health benefits program, (think that’s what he means by intolerant humor?)._\n\nAnother ad hominem personal attack disguised as humour.\n\nj a m e s\n\n"
    },
    {
      "time": " 19.Sep.2008 8.41am",
      "content": "I was joking about saving ITC Machine of course. How could anybody take that, or Sii’s challenge, seriously?\n\nj a m e s\n\n"
    },
    {
      "time": " 19.Sep.2008 8.41am",
      "content": "(much laughter!)\n\nj a m e s\n\n"
    },
    {
      "time": " 19.Sep.2008 8.46am",
      "content": "Do you get it yet David? I was joking about you making an ill-disguised personal attack on Randy.\n\nAlso try: deceptive humour, surrealism, throwing away all of the rules.\n\nI made a joke about your absurd egotism, which itself (the ego) is not very funny. Did you catch that one?\n\nj a m e s\n\n"
    },
    {
      "time": " 19.Sep.2008 9.17am",
      "content": "David, if you and others here could quote each other with typographic clarity it would avoid many errors of judgement and save me from having to make stupid ill-concieved jokes about them.\n\nThis utter debacle is partly a reflection of my reading skills when in a hurry, and partly a reflection of your skills as a text typographer. That’s criticism and an explanation of what _really happened_, and not really intended as an ad hominem personal attack on you.\n\nInterpret that however you like. I apologize for my screwing up and making stupid jokes about you and your ego.\n\nThe praise I recently voiced for Sii was for Sii as a person, and has nothing to do with wanting to work for Microsoft. Taking up such a position with Microsoft is now impossible for me since my post-aneurysm memory dropouts have made me virtually unemployable.\n\nTiffany—now would be a good time to cut the cards. Stop it from escalating further. Don’t let me or David hijack this thread.\n\nCiao!  \nj a m e s\n\n"
    },
    {
      "time": " 19.Sep.2008 10.29am",
      "content": "So, how about them Mets! :-)\n\nChrisL\n\n"
    },
    {
      "time": " 19.Sep.2008 12.50pm",
      "content": "\\> You’re in the basement of the Linotype office when a fire breaks out (don’t look at me). You can only rescue two sets of original drawings, what do you save?\n\nThe half empty vodka bottle :)\n\n\\> You have a fox, a chicken, a row boat, a copy of InDesign CS 4, and a 1200dpi laser printer. How do get them all across the river?\n\nWet or dry? :)\n\n"
    },
    {
      "time": " 19.Sep.2008 3.32pm",
      "content": "Pikachu.\n\n"
    },
    {
      "time": " 19.Sep.2008 7.32pm",
      "content": "My SOS would be easier to read in Comic Sans.\n\n"
    },
    {
      "time": " 19.Sep.2008 8.08pm",
      "content": "\\><cite>Say, that Goat Brie packaging looks decent. Good find!</cite>\n\nTastes good too!\n\nI’d go for the Comic Sans. It’s more practical. I’d type low level encrypted messages, put them in bottles and toss the into the sea. That would be the most fun available to me on that deserted island.\n\nA2 F9 A2\n\n-=®=-\n\n"
    }
  ]
}
