{
  "id": "49585",
  "title": "Fonts with Old English characters?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm looking for Old English fonts that actually include all 6 old English characters (viewable here: [http://www.wordorigins.org/index.php/site/comments/old\\_english\\_alphabet/](http://web.archive.org/web/20100930040501/http:/www.wordorigins.org/index.php/site/comments/old_english_alphabet/ \"http://www.wordorigins.org/index.php/site/comments/old\\_english\\_alphabet/\"))\n\nAny ideas??? Thanks!!\n\n",
  "author": "<a href=\"/web/20100930040501/http://typophile.com/user/5778\" title=\"View user profile.\">SF Highlander</a>",
  "time": "<br>",
  "uid": "5778",
  "comments": [
    {
      "time": "",
      "content": "The versions of the Windows core fonts (Times New Roman, Arial, Courier New, and the new Segoe UI) that ship with Vista contain glyphs for all these characters; older versions do not.\n\n"
    },
    {
      "time": "",
      "content": "You might want to look at Junicode (see [http://junicode.sourceforge.net/](http://web.archive.org/web/20100930040501/http:/junicode.sourceforge.net/ \"http://junicode.sourceforge.net/\") ).\n\nJonathan\n\n"
    },
    {
      "time": "",
      "content": "I think he's looking for a blackletter font.\n\nWhile the next release of [Ælbrocan](http://web.archive.org/web/20100930040501/http:/coruna.elahorcado.net/) will include all of them, it might not be appropriate as it uses German forms for some of the letters.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "Hey All,\n\nThanks for your help. Matthews right - I'm looking for a blackletter font, in the \"old english style\", with all six of the characters. Really its just the wynn that I'm having trouble locating. Thanks again for the help.\n\n"
    },
    {
      "time": "",
      "content": "It's fine if you want only those 6 characters, just be aware that they aren't \\*all\\* the \"Old English\" characters not included in modern English character sets.\n\n"
    },
    {
      "time": "",
      "content": "On that matter, what WOULD a capital Thorn, Wynn, and Yogh look like in blackletter. I've not seen an example of either. I've seen Thorn only in one other black letter font, but it was one where the P's bowl was high. Unfortunately I'm not sure if there's a standard way of differentiating P, Ƿ, and Þ and I'm not familiar with good sites to browse for facsimile editions of old English books.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
