{
  "id": "49590",
  "title": "Why doesn't anyone ever discuss this font? Calibri",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I feel like, if I had to pay $150 for Microsoft Office, I would tear open the packaging not excited for the Office Programs, but excited for the rights to the font(s) I just bought.\n\nLike I seriously am in love with Calibri: There's something about it that somehow makes it float above the (digital) page ever so slightly, and it's just very clean. Perhaps a near epitome of what it means to have a \"Curvy\" Sans-Serif font.\n\nBut since the release of Microsoft's OpenType (?) fonts, few designers have brought them to mention. (None that I've heard at least). Are they scoffed at? Or do we just have too many other things to focus our attention on?\n\n",
  "author": "James Deux",
  "time": "17 Sep 2008 — 8:10pm",
  "uid": "36883",
  "comments": [
    {
      "time": "17 Sep 2008 — 9:01pm",
      "content": "The Vista fonts are hampered by the anti-Microsoft sentiment common among designers. Perhaps there is also a segment of type users who see Colibri and the other C-fonts as made specifically for ClearType -- for the screen -- not for professional print design.\n\nPersonally, I think the series is one of the brightest things MS has done in years and they continue to school Apple on commitment to typography, but I haven't seen much of the Vista fonts in offline use.\n\n"
    },
    {
      "time": "17 Sep 2008 — 10:11pm",
      "content": "When Office was released reviewers all mentioned the new fonts, and it's clear I think that MS Office users have embraced it. Which is a bit surprising as its a radical departure from the old default Times New Roman.\n\nIt was a few years before you started to see Verdana and Georgia in print, and they had broader exposure (bundled with browsers, OS's as well as a free download). I'd expect now that the C\\* are supplied with Mac Office that you'll see them used more widely.\n\n"
    },
    {
      "time": "17 Sep 2008 — 11:41pm",
      "content": "Used more widely by Office users, yes.\n\n"
    },
    {
      "time": "18 Sep 2008 — 1:27am",
      "content": "...and maybe Mac based designers, who get them for free with Mac Office? I can't imagine use declining - unless or until it goes out of style, like some other bundled fonts. ;-)\n\n"
    },
    {
      "time": "18 Sep 2008 — 7:42am",
      "content": "I like the C\\* fonts but hate most of their names, which I find completely unmemorable. Constantia sounds like a classical Roman virtue, so that fits its stately sobriety; and Consolas sounds like \"console\" so I can remember it's the monospace one. But Calibri, Cambria, Candara, Corbel, and Cutlass Ciera all run together in my brain.\n\n"
    },
    {
      "time": "18 Sep 2008 — 7:52am",
      "content": "<cite>...and maybe Mac based designers, who get them for free with Mac Office?</cite>\n\nSii, the Mac Office coders screwed you. Office 2004 for Mac works well enough on Intel that for most of us the fonts would really be the only reason to upgrade!\n\n"
    },
    {
      "time": "18 Sep 2008 — 11:09am",
      "content": "_Constantia sounds like a classical Roman virtue, so that fits its stately sobriety_\n\nI was neither stately nor sober by the time I came up with that name. One of the Microsoft managers had come up with the idea that all the CT fonts should have names that started with C. I can't remember all the possible names I came up with, each of which ended up rejected after international trademark searches. Microsoft probably spent more money on lawyers doing trademark searches than they spent on the typeface development! As I recall, the day before the penultimate choice came back rejected, I'd been singing some psalms during vespers, and noticed the word constantia. Hey, I thought, that starts with C!\n\n"
    },
    {
      "time": "18 Sep 2008 — 11:15am",
      "content": "\"Mac-based\" is a hyphenate, stat!\n\nConstantia was the name of an actual historical Roman person, the wife of Roman emperor Constantius. Constantius was the slightly insane and very corrupt imperialist emperor who died in battle just before Julian the Apostate assumed the \"throne\" seat of power over the empire.\n\nj a m e s\n\n"
    },
    {
      "time": "18 Sep 2008 — 11:17pm",
      "content": "\\>Office 2004 for Mac works well enough on Intel that for most of us the fonts would really be the only reason to upgrade!\n\nThe fonts are available as part of a free download for Office 2004.\n\nCheers, Si\n\n"
    },
    {
      "time": "19 Sep 2008 — 6:57am",
      "content": "I have Firefox reset all the websites to be displayed in Cambria. I love the Vista fonts. I only wish they were distributed across all the platforms for a wider variety of web specific use. It would give Georgia and Verdana a much needed break.\n\n"
    },
    {
      "time": "19 Sep 2008 — 7:04am",
      "content": "About a decade from now. These things take time to catch on.\n\nj a m e s\n\n"
    },
    {
      "time": "29 Sep 2008 — 3:32pm",
      "content": "'The Vista fonts are hampered by the anti-Microsoft sentiment common among designers.' says Stephen Coles. I don't think so. In my view they're hampered by subliminal recognition of unfitness for purpose. The Vista fonts represented the chance for the junior designers (under 40s let's say) to prove they could do as well as the senior designers (over 40s let's say) when it came to designing fonts that would be employed by hundreds of millions of users.\n\nMany people think Calibri is the best. Here's what I don't like about it. I think the angular o forms impede readability. I think the calligraphic italic forms impede readability. (I am not one of those who thinks that chirographic forms assist readability; I think they impair it. There's a reason why we read type more quickly than calligraphy. It's precisely because type is non-chirographic. The marketing of calligraphic features in type is fine by me -- anything to make a buck -- just don't ask me to take type spin any more seriously than any other kind of spin.)\n\nI truly do believe that type destined for the millions should be crystal goblet type. It should be transparent. There should be no cutesy features.\n\nCalibri is all about cute. Let's start with the punctuation. The worst feature is the quotation marks, which look like falling snowflakes, not quotation marks. You have to keep asking yourself 'is this really a quote mark?' They're also badly fitted, with 's (quoteleft-s) having a greater gap than g' (g-quoteright) for example. But wait! This font is designed for use with MS Word, a program which declares kerning off by default. With kerning off, there's not just a gap between 's (quoteleft-s) but a river and the font is really a mess.\n\nKerning is being used here to fix bad spacing, a poor design philosophy.\n\nThe question mark is slightly too large to seem transparent, and the comma is almost as bad as the snowflakes. It's not where you expect it to be, it's not the shape you expect it to be. That's the definition of what cute is and transparent is not.\n\nThe default g is so clotted there has to be an alternate g. But who is going to figure out how to use it?\n\nThe ascenders/descenders are misproportioned. For this design, there needs to be fractionally more descender length, even if it has to be at the expense of ascenders.\n\nFinally -- for this very brief look, try to type some text using Calibri. One of the most frequent errors you make when typing is one space instead of two or two instead of one. With Calibri, the on-screen representation of the space is too thin. It's impossible to have an intuitive sense whether you have typed one space or two. Somehow, with all the classic Microsoft fonts, you can tell this.\n\nAt that point I give up - - these guys can't even get the space character right? It's scarcely worth discussing. I realize I'm not going to win any popularity prizes by being so harsh, but I don't think there's any other way to get better type.\n\nWho knows? Maybe everyone will get used to this stuff? If they do, no sweat. But to eyes accustomed to the level of excellence that was customary just five or ten years ago, that's a stretch.\n\n"
    },
    {
      "time": "30 Sep 2008 — 4:42am",
      "content": "Calibiri is really a good font, its meant for screen but i have used it in some of my print projects too..and its really readable and works well.\n\nI think its getting ignored because its a default font, and as a designer we have a tendency of not to go with the defaults. We always try to do some value addition even when its not needed sometimes.\n\n"
    },
    {
      "time": "30 Sep 2008 — 7:01am",
      "content": "...get them 'free' / licensed by downloading powerpoint viewer too\n\n"
    },
    {
      "time": "1 Oct 2008 — 1:00am",
      "content": "get also calibri for free when I bought the Microsoft office suite...\n\n"
    },
    {
      "time": "1 Oct 2008 — 12:52pm",
      "content": "These percipient comments are enjoyable.\n\n"
    },
    {
      "time": "1 Oct 2008 — 1:47pm",
      "content": "Indeed its \"freeness\" is its #1 quality. ;-)\n\n"
    },
    {
      "time": "1 Oct 2008 — 9:46pm",
      "content": "I never got the chance to look at Calibri that closely; I just printed one sample page a while ago. But I do like the design overall. Here are my very rough impressions (keep in mind that's what they are):\n\nMany of the design details Bill Troop pointed out as being too cute didn't bother me. The o doesn't strike me as being angular, maybe because I'm just so used to seeing square sans designs these days. The ascender-descender proportions look fine to me, although again that is perhaps because I'm so used to extremely minimal descender lengths of latin components of CJK fonts.\n\nI did notice the spacing problems with the single quotes that Bill mentionned, and I remember wondering what the rationale was. Possibly something to do with different quotation marks used for different languages... The design itself of the single and double quotes struck me odd as well, and I remember thinking it was maybe a screen font thing. It will be interesting to hear the designer's reasoning for these choices.\n\nThe double-storey default _g_ is too busy perhaps, but I'm trying to make my peace with double-storey _g_s in sans designs (they seem to be in fashion after all) and there is no real way to completely avoid a cluttered look with double-storey _g_s. I never got to look at the italic too closely, so I can't comment on it.\n\nOverall, I think because of what I'm used to seeing nowadays, Calibri looks quite neutral to me. I think there are definitely shifts in the sensibilities in typeface designs over time and maybe Calibri will be dated soon (\"Look at those early-century square _o_s!\"). But I'm not really sure it represents a drop in the level of typographic excellence as Bill stated, although if his point is mainly based on the punctuation marks, then I see his position. A default font used by millions should be held up to higher standards, after all.\n\n"
    },
    {
      "time": "2 Oct 2008 — 10:42am",
      "content": "\\>The fonts are available as part of a free download for Office 2004.\n\nDoes anyone have a link to this download? I searched but could not find anything.\n\nthanks\n\nAll ideas, theories and statements are subject to change without notice.\n\n"
    },
    {
      "time": "2 Oct 2008 — 11:36am",
      "content": "I think this is it...\n\n[http://www.microsoft.com/downloads/details.aspx?FamilyID=6b9238e1-cf69-4...](http://web.archive.org/web/20150217234048/http:/www.microsoft.com/downloads/details.aspx?FamilyID=6b9238e1-cf69-48c4-bf2d-c4a8aceee520&DisplayLang=en \"http://www.microsoft.com/downloads/details.aspx?FamilyID=6b9238e1-cf69-48c4-bf2d-c4a8aceee520&DisplayLang=en\")\n\n"
    },
    {
      "time": "3 Oct 2008 — 9:37am",
      "content": "Thanks sii.\n\nThis installed Calibri, Candara, Consolas, Constantia and Corbel.\n\npbc\n\nAll ideas, theories and statements are subject to change without notice.\n\n"
    },
    {
      "time": "3 Oct 2008 — 12:52pm",
      "content": "I got them all with a trial version of the new MS web design software.\n\n... Which I liked so much that MS sent me a free copy. Go figure!! Say thanks for me, sii, if you see the folks who sent it out to me. :o)\n\n-=®=-\n\n"
    },
    {
      "time": "4 Oct 2008 — 10:24am",
      "content": "I don't have Vista, unfortunately. But I found this nice link:\n\n[http://www.ascendercorp.com/ctfonts.html](http://web.archive.org/web/20150217234048/http:/www.ascendercorp.com/ctfonts.html \"http://www.ascendercorp.com/ctfonts.html\")\n\nShould I tell my wife she needs a new pc?\n\n"
    },
    {
      "time": "7 Sep 2014 — 6:43am",
      "content": "It seems that Lucas de Groot made a version without rounded stems. When I read this on his website, I was a bit disappointed. I think Calibri would have looked better without the roundings.\n\n<cite>De Groot drew a contemporary sans serif family with subtle roundings on stems and corners. However, as the roundings seemed to suffer under ClearType rendering, De Groot redesigned the font, taking out the rounded corners. When submitting the proposal to Microsoft, he sent along a sample of the original version, adding: ‘I like the look of it, but as you see these rounded tops look real ugly in ClearType; don’t choose this.’ De Groot had in fact been critical of the ClearType rasterizer when he first saw it demonstrated. To his astonishment, Microsoft chose the rounded version. ‘As I soon found out, the rasterizer had indeed improved, and rounded tops and bottoms could be rendered smoothly now.’</cite>\n\n"
    },
    {
      "time": "9 Sep 2014 — 10:23am",
      "content": "I like the wide character set available with Calibri. Screen fonts are a separate area from typefaces designed for high-quality print; while they are a concern to web designers, not just people who design computer interfaces and operating systems, Calibri is not really one of the choices available to web designers.\n\nWhy not? Some people who browse the Internet have Macintosh computers. And they're people with more money to spend!!!\n\n"
    },
    {
      "time": "20 Sep 2014 — 7:38pm",
      "content": "How can you like Calibri?? It's by far the worst font that ever existed. Much worse than even Comic Sans. I don't get how anyone can actually like it. So boring and makes work look unprofessional.\n\n"
    },
    {
      "time": "21 Sep 2014 — 5:19am",
      "content": "<cite>I don't get how anyone can actually like it. So boring and makes work look unprofessional.</cite>\n\nThat is because of the rounded corners. I think if it had 'normal' corners it would appear a lot more professional.\n\n"
    },
    {
      "time": "21 Sep 2014 — 11:00pm",
      "content": "Hmm. Actually, I never noticed Calibri before. I had it mixed up with Cambria.\n\n"
    },
    {
      "time": "22 Sep 2014 — 12:42pm",
      "content": "\"Calibri is not really one of the choices available to web designers.\"\n\nNot sure what \"available\" refers too in the above comment, but:  \n [http://www.webtype.com/font/calibri-family/](http://web.archive.org/web/20150217234048/http:/www.webtype.com/font/calibri-family/ \"http://www.webtype.com/font/calibri-family/\")  \nI'm sure to find out soon.\n\nThis excellent font would be hard for any knowledgable type designer, typographer or web author to call worse than Comic Sans, boring or unprofessional, if it's used for its intended purpose, and even beyond, for the right composition matter.\n\n"
    },
    {
      "time": "22 Sep 2014 — 12:44pm",
      "content": "Yes.\n\n"
    },
    {
      "time": "22 Sep 2014 — 2:43pm",
      "content": "It's a legible and somewhat condensed contemporary sans-serif. Microsoft commissioned it as a default typeface for its screen displays, now that they're using anti-aliasing.\n\n"
    },
    {
      "time": "28 Sep 2014 — 4:50am",
      "content": "Yes, but I still don't understand why they chose rounded corners... This makes it appear a bit 'childish'.\n\n"
    },
    {
      "time": "27 Sep 2014 — 9:50am",
      "content": "And what is you opinion of Gotham rounded [http://www.typography.com/fonts/gotham-rounded/overview/](http://web.archive.org/web/20150217234048/http:/www.typography.com/fonts/gotham-rounded/overview/ \"http://www.typography.com/fonts/gotham-rounded/overview/\") ?\n\n"
    },
    {
      "time": "28 Sep 2014 — 10:38am",
      "content": "Rounded fonts remind me of the 70s, even though I wasn't alive back then. Gotham Rounded is a bit more outspoken than Calibri. I believe that fonts with rounded corners are just not that suitable for papers/reports etc. A lot of fellow students use Calibri for their theses/dissertations. It's just too informal. Thesis Sans (also by Lucas de Groot) is Calibri without rounded corners. MS sould've stuck with Lucas de Groot's initial proposal.\n\n"
    },
    {
      "time": "27 Jan 2015 — 3:15am",
      "content": "I quickly read the above comments and if I am not mistaken, the font is discussed only from \"Latin\" point of view. Yes, there are many other latin fonts, but when it comes to Greek language, esp. sans serif fonts, Calibri is beautiful, clear and quite rich. And this is a true challenge for type designers, to try to design not only a Latin version but also a Greek one, for example.  \nCalibri became very popular lately in Greece. Finally, Times New Roman is being set aside step by step.  \nThe Capital letters are gorgeous in comparison with other Greek fonts, the numbers are great.  \nHere are some samples of my work with Calibri:  \n(the blue numbers below aren't Calibri)\n\n ![](http://web.archive.org/web/20150217234048im_/http:/typophile.com/files/screen-capture-13_6422.jpg)\n\n ![](http://web.archive.org/web/20150217234048im_/http:/typophile.com/files/screen-capture-16_3769.jpg)\n\n"
    }
  ]
}
