{
  "id": "4960",
  "title": "Digital opticals",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This is something I've been thinking about lately.   \nWhat was the first digital typeface to have optical sizes?   \n   \nI think the first digital font to have them was ITC Bodoni   \n(released in 1994, according to [Daidala](http://web.archive.org/web/20131010211045/http:/www.daidala.com/itcbodoni.html)). But, it's a   \nrevival.   \n   \nSo. What was the first original typeface, created with   \ndigital technology, to have optical sizes?   \nMaybe something from Adobe, back in the days of MMs?\n\n",
  "author": "eomine",
  "time": "27 May 2004 — 1:12pm",
  "uid": "1353",
  "comments": [
    {
      "time": "27 May 2004 — 2:00pm",
      "content": "Yes, I think so. Minion MM back in 1991 (which also predates ITC Bodoni).   \n   \nOf course, it all depends on what you mean by optical sizes. I suspect that Minion MM was the first digital typeface to have the full range of characters in a range of optical sizes.   \n   \nHowever, some degree of optical size variation had been done even earlier than this. Adobe Garamond, for instance, had an all caps titling face back in 1989.   \n   \nOf course, Adobe Garamond was a revival. But I see the question of revivals versus originals as rather orthogonal to the question of optical size variation.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "27 May 2004 — 2:06pm",
      "content": "Heh. That was a cross-post, though you wouldn't know from the wording. ![:-)](http://web.archive.org/web/20131010211045im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI should have gone on to say that I strongly suspec some other late 80s faces had titling or display variants. However, I expect they may have all been revivals or fairly straight translations of pre-existing photo or metal typefaces.   \n   \nT\n\n"
    },
    {
      "time": "27 May 2004 — 2:45pm",
      "content": "I'd be willing to bet that there were bitmap font sets in the 70's where at each size the letter shapes were different at say 12ppem and 10ppem. This would meet the definition of 'optical sizes'. Si\n\n"
    },
    {
      "time": "27 May 2004 — 3:00pm",
      "content": "FB's Belucian was pretty early, I recall.   \n89 or 90.\n\n"
    },
    {
      "time": "27 May 2004 — 4:36pm",
      "content": "Bernard Gothic, ATF, 1987\n\n"
    },
    {
      "time": "27 May 2004 — 4:43pm",
      "content": "But still, a revival.\n\n"
    },
    {
      "time": "27 May 2004 — 6:35pm",
      "content": "Besides Simon's interesting wrench-in-the-machine, I think we might need to narrow this even more: multiple sizes (of an outline) font for text, not just one for text and one for display - that's kind of minimal. And if we're discounting revivals, I might guess this: the first non-revival MM font that Slimbach made - what was that?   \n   \nBTW, although the ATF Kingsley people were probably the first to implement optical scaling on a full-production level, Jacques Andr\n\n"
    },
    {
      "time": "28 May 2004 — 8:06am",
      "content": "Thanks for the input.   \n   \nHrant wrote:   \n\\> I think we might need to narrow this even more:   \n\\> multiple sizes (of an outline) font for text, not   \n\\> just one for text and one for display - that's   \n\\> kind of minimal.   \n   \nYeah, that's a good brief.   \n   \nSo I guess that Adobe Minion MM (1992, according to the Readme PDF downloaded from Adobe) can be considered the first non-revival, optically-scaled digital typeface.   \n   \nAnd good call, Simon. Screen fonts were certainly the first optically scaled typefaces created in computers. But currently I'm more interested in optical scaling for 'outline' fonts.   \n   \nI think I know the answer to this question, but is there some easily accesible reference (links, books, magazine articles) to the ATF/Kingsley stuff?   \nThanks again.\n\n"
    },
    {
      "time": "28 May 2004 — 8:13am",
      "content": "There's virtually nothing on Kingsley.   \n   \n   \nhhp\n\n"
    },
    {
      "time": "28 May 2004 — 11:59am",
      "content": "That's what I thought.   \nThanks anyway.\n\n"
    },
    {
      "time": "30 May 2004 — 2:31am",
      "content": "Hrant   \n   \nThe manual for Type Designer I (ATF/Kingsley's font design software) had some information. Still have the disks for the software but can no longer find the printed manual. Probably tossed it in one of those purges. Someone other than myself must have purchased this though. Do you think?   \n   \nSome of the early information from Reading that was published on digital type might have something. They were quite aware.   \n   \nOf course, this will take some work. The digital realm certainly, and willingly, finds it quite easy to destroy its own history.   \n   \nGerald\n\n"
    },
    {
      "time": "30 May 2004 — 11:10pm",
      "content": "Computer Modern family designed/wrote in Metafont by prof. Donald Knuth back in 1977. It has 8 optical sizes (5, 6, 7, 8, 9, 10, 12 and 17pt). As far as i know.\n\n"
    },
    {
      "time": "31 May 2004 — 3:31am",
      "content": "Does Computer Modern count as a revival or not?   \nIt's supposedly based on Monotype Modern 8A, but   \nI don't know how similar it really is. Has anyone seen   \na sample of Modern 8A, so they can compare?   \n   \nI don't know what CM Greek was based on, if anything.   \nDoes the sans go all the way back to the beginning?   \nIt's not based on an existing type as far as I know;   \ncould it even be the first instance of an extended family   \nincluding complementary sans and serifed designs?   \n   \nI'm not sure about your dates. [According to Hermann Zapf](http://web.archive.org/web/20131010211045/http:/www.tug.org/TUGboat/Articles/tb22-1-2/tb70zapf.pdf),   \nComputer Modern was created in 1980.\n\n"
    },
    {
      "time": "31 May 2004 — 4:01am",
      "content": "According to Knuth, CM was created in 1977:   \n   \n [http://www.tex.ac.uk/tex-archive/fonts/cm/mf/README](http://web.archive.org/web/20131010211045/http:/www.tex.ac.uk/tex-archive/fonts/cm/mf/README)   \n   \nfirst paragraph.   \n   \nAs for the cm sans, it is based on the same Monotype Modern: both cmr10.mf and cmss10.mf (for example) load cmbase.mf, just check it out.   \n   \nCM i think it is the biggest font family, not only \"complementary sans and serif\". There are more: startin from typewriter endin with funny fibonacci face or upright italic.   \n   \ni found a book typeset in Monotype Modern8A but the pic is useless. maybe someone will buy that book and we all see a comparison: [http://www.arionpress.com/catalog/048.htm](http://web.archive.org/web/20131010211045/http:/www.arionpress.com/catalog/048.htm)   \n   \nFor a indepth between mm and cm: [http://www.tug.org/TUGboat/Articles/tb22-3/tb72hoenig-modern.pdf](http://web.archive.org/web/20131010211045/http:/www.tug.org/TUGboat/Articles/tb22-3/tb72hoenig-modern.pdf)\n\n"
    },
    {
      "time": "31 May 2004 — 5:42am",
      "content": "Okay, I think we're basically saying the same thing: the   \nfirst sketches were made in 1977, and the first digital   \nMetafont implementation was made in 1980.   \n   \nThere are several large typographic families available   \nnow. Lucida is probably the largest, and certainly larger   \nthan CM. I don't know of any _earlier_ example (but   \nof course there are a lot of things I don't know).   \n   \nKnuth's upright italic is a kind of typographic sick joke,   \nnot a useful typeface. ![:-)](http://web.archive.org/web/20131010211045im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "31 May 2004 — 5:58am",
      "content": "Upright italic is not a joke, it is a proof of what metafont can do. I know Knuth loves jokes, but I don't think that cm ui is one of them.   \n   \nAs about cm family, i'll put together all the fonts available (including ams, bright etc). I'm curious about the number. Does anyone has the complete lucida family? I only got 19 fonts:   \n   \nlucida, italic, bold, bolditalic,   \nsans, sansitalic, sansbold, sansbolditalic,   \ntypewriter, italic, bold, bolditalic,   \nsanstypewriter, italic, bold, bolditalic,   \nmathextension, mathitalic and mathsymbol.   \n   \nThere are more?\n\n"
    },
    {
      "time": "31 May 2004 — 7:05am",
      "content": "Lucida grande which is a unicode one. Y&Y provides LucidaBright regular, italic, slant, smallcaps, demi, demi-italic, and demi-smalcaps; LucidaFax regular, italic, demi, and demi-italic; LucidaBlackLetter; LucidaCaligraphy-italic; LucidaCasual regular and italic; LucidaHandWriting-italic; and a family of 11 fonts for LucidaNewMath.\n\n"
    },
    {
      "time": "31 May 2004 — 9:33am",
      "content": "\\>Knuth's upright italic is a kind of typographic sick joke,   \nnot a useful typeface.   \n   \nBackslanting an italic is the origin of Dalliance Roman, wittily Post-modern.\n\n"
    },
    {
      "time": "1 Jun 2004 — 9:43am",
      "content": "Gerald, I remember last year you mentioning the Kingsley stuff that you have - I'd love to see any of it. Maybe on the 15th? I'll remind you. :-\\>   \n   \nThe Reading stuff: What year-range am I looking for? Any specific publications?   \n   \n\\> upright italic is a kind of typographic sick joke   \n   \nSome people (like Martin Majoor and the Underware boys) would disagree.   \nBut not me. :-\\> Although not a \"sick joke\", an upright italic -at least in the primary role of emphasis that an italic should have- is a dysfunctional artsy affectation. Unless you call it a \"cursive roman\" instead and use it independently. Then it can be somewhat cute - although not much more.   \n   \n--   \n   \nI don't think CM is a revival - for one thing it's way too ugly.   \nSo Eduardo, I think that's your answer after all.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2004 — 10:10am",
      "content": "\\> Some people [...] would disagree   \n   \nThere's certainly a fun debate to be had about whether   \nan italic font need necessarily be slanted, but the CM   \n'upright italic' is just the ordinary italic, mechanically   \nunslanted. It has to be seen to be believed. ![:-)](http://web.archive.org/web/20131010211045im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI can't find a sample online, but you'll see that it's   \nactually (shudder) _used_ in the Zapf article I linked   \nearlier, to set the text \"Editor's note\" in one of the   \nfootnotes. (Such a pity that Texiness and taste seem   \nso inimical to one another.)   \n   \nTo be fair to Knuth, I think his intention (aside from   \nthe understandable desire to play with his new toy   \nMetafont) was to demonstrate to the typographically   \ninnocent that the structural differences between roman   \nand italic forms go beyond mere inclination, and   \nit's certainly a shocking demonstration of that!\n\n"
    },
    {
      "time": "1 Jun 2004 — 11:08am",
      "content": "BTW, I just found this [link](http://web.archive.org/web/20131010211045/http:/www.seyboldreports.com/SRDP/dp4/dp04-02a.htm).   \nIt's from an old Seybold Report, but it's interesting.\n\n"
    },
    {
      "time": "1 Jun 2004 — 11:13am",
      "content": "Ah, I've been waiting for Hrant to raise his objection about the dysfunction of upright italics again. I've now read two books set in Martin Majoor's Seria, both using the upright italic for emphasis etc. and I didn't find any problem with it at all. I read the books and my brain processed the italics as italics. I don't think one can form a general rule from this that upright italics are always going to function as well as slanted ones -- surely this depends on the individual design --, but equally one shouldn't denounce upright italics as dysfunctional on a theoretical basis. Go read a book that uses them. Further evidence that our reading ability is good enough to handle most of what we typically throw at it and then some.\n\n"
    },
    {
      "time": "1 Jun 2004 — 11:27am",
      "content": "Your experience is moot for two reasons:   \n1) You're a type designer.   \n2) Nobody can consciously gauge their own immersive reading.   \n   \nThere can really be no doubt that slant is the central attribute of an italic\\* - everything else (like cursiveness) is secondary. Don't disagree just because I'm the one saying it, John.   \n   \n\\* In its primary role as an emphatic style.   \n   \n--   \n   \nThat said, sure, an upright italic won't give you problems 95% of the time. But good design is exactly in that last 5%. Otherwise just use Times and Arial, and nobody will [consciously] notice jack anyway.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2004 — 6:26pm",
      "content": "I didn't try to 'gauge my own immersive reading', I just read the bloody books. I read them like any other book, and the italics functioned like any other italics: they did their job, they typographically signalled information about the text.   \n   \n[If anything, being a type designer is more likely to be an impediment to comfortable immersive reading of things like upright italics: it makes one more likely to notice something unusual and out of the ordinary. Being a type designer is something one overcomes in order to be a reader.]   \n   \nI disagree with you because I disagree with what you say, not because you're the one saying it. I'm not about the run out and start designing upright italics, because I do think that there is a net benefit to slant: a compound differentiation of letterform and slant is _more_ effective than a single differentiation of letterform (upright italic) or slant (sloped roman). I also agree that slant generally makes for greater differentiation than letterform. Where I disagree is in how great the differentiation actually needs to be for successful reading: I think a well designed upright italic can be perfectly sufficient in this regard and that slant, while desirable, is far from necessary. I do not think slant is even the 'central attribute of an italic': the central attribute is sufficient differentiation from the roman, however that is achieved.\n\n"
    },
    {
      "time": "1 Jun 2004 — 6:42pm",
      "content": "Hrant   \n   \n_Gerald, I remember last year you mentioning the Kingsley stuff that you have - I'd love to see any of it. Maybe on the 15th? I'll remind you. :-\\>_   \n   \nWhich Gerald?\n\n"
    },
    {
      "time": "1 Jun 2004 — 8:32pm",
      "content": "John, the point is that while you were bloody reading you don't know if you missed any emphasized words because they were not distinctive enough because there was no slant. Consider the \"I\" for example.   \n   \nAnd you can't overcome being a type designer. If you did you couldn't design type any more. Being type designers make us a bad benchmark for readability.   \n   \nSlant is central to an italic because it's the thing that determines what else _might_ be needed to pull it sufficiently away from the Roman, and only if the slant isn't strong enough. Slant is also central because it's the only attribute that's _required_ for an italic to work well in an emphatic role. The other attributes are basically aesthetic.   \n   \nI'm not saying all an italic should have is slant, but what I'm saying is that slant is a necessary condition - while cursiveness for example is not. So a slanted-Roman is less bad than an upright italic.   \n   \n\\> Which Gerald?   \n   \nLange. Although I certainly remember you talking about Kingsley as well - I'm still waiting for the goods!   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2004 — 9:42pm",
      "content": "John   \n,   \n_Ah, I've been waiting for Hrant to raise his objection about the dysfunction of upright italics again. I've now read two books set in Martin Majoor's Seria, both using the upright italic for emphasis etc. and I didn't find any problem with it at all._\n\n"
    },
    {
      "time": "2 Jun 2004 — 12:25am",
      "content": "_...you missed any emphasized words because they were not distinctive enough because there was no slant. Consider the \"I\" for example._    \n   \nOnly egomaniacs italicise 'I'. I don't read those sort of books. ![:-)](http://web.archive.org/web/20131010211045im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "2 Jun 2004 — 1:13am",
      "content": "Robin Huston:\n\n"
    },
    {
      "time": "2 Jun 2004 — 8:47am",
      "content": "\\>Being type designers make us a bad benchmark for readability.   \n   \nRight. And musicians have no idea what their music sounds like.\n\n"
    },
    {
      "time": "2 Jun 2004 — 9:28am",
      "content": "First of all, the parallels between music and type are seriously over-rated. Massively.   \n   \nBut anyway, I didn't say that type designers have \"no idea\" what their designs look like, just that their consciousness filters things more -and in different ways- on their way \"down\" to the subconscious. This should be pretty obvious. This is why evaluating a text font by merely reading it is not enough. And there's another reason: a font contains many more glyphs than are encountered in any reading session. So reading provides \"deterministic\" evaluation, but not \"mathemetical\" evaluation: for the latter you have to look at each glyph in the font, which is something that doesn't happen in reading. For example, a font can have a wonderful alphanumeric set, but a lousy eszet - and few people will ever realize.   \n   \n--   \n   \nSome more thoughts about upright italics: the chances that an emphasized word will be noticed is proportional to the length of the word (among other things). We might agree that single-letter words are highly problematic for an upright italic, but there are only two of those in English, and one of them (\"a\") has a structurally different form in cursive, so it's not disasterous (although I might doubt the ability of a reader to appreciate the difference [enough] during immersive reading). And I might further concede that three-letter words are pretty safe. But in English two-letter words are about 20% of text! And I think that's a notable problem.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Jun 2004 — 10:54am",
      "content": "Hrant   \n   \n_(although I might doubt the ability of a reader to appreciate the difference [enough] during immersive reading)_   \n   \nHave your read _\"Towards and Ideal Italic\"?_\n\n"
    },
    {
      "time": "2 Jun 2004 — 11:06am",
      "content": "Yes, and I think Morison:   \n1) doesn't deserve credit for the idea (which he took). The RdR boys deserve the credit, and Tuleu (of the Deberny foundry) deserves credit for making the first good (and maybe still best) slanted-Roman, many decades before Morison;   \n2) does deserve credit for elaborating on it, but the idea requires a high degree of design-sense to make it really work - and Morison had little (certain other positive qualities he had plenty though). As for Dwiggins and JvK, they went the wrong direction, probably under Morison's bad influence.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Jun 2004 — 1:47pm",
      "content": "\"Towards an Ideal Italic\" predates Times New Roman. I wonder Morison never took his own advise when he oversaw Times Italic?\n\n"
    },
    {
      "time": "27 May 2004 — 2:00pm",
      "content": "Yes, I guess that should be Minion MM. Mr. Phinney?\n\n"
    }
  ]
}
