{
  "id": "4962",
  "title": "Quark 6.1 Problem",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "QUARK 6.1   \nMAC OS X   \n--------------   \n   \nOkay, new problem.   \n   \nOne of the girls in the creative department has been getting an error after a couple times pdf-ing an ad.   \n   \nThe error has something to do with \"itc franklin gothic med cd\" and she can't get rid of this error until she closes out of quark completely.   \n   \nThen when she opens it back up, does a couple more pdf's and BAM... there is the same error again.   \n   \nAnd she just keeps doing that repetitive loop.   \n   \nAny idea whats going on? Anyone else have this problem?\n\n",
  "author": "anonymous",
  "time": "27 May 2004 — 2:07pm",
  "uid": "1203",
  "comments": [
    {
      "time": "28 May 2004 — 2:51pm",
      "content": "Kyle it sounds like a corrupt font. Try reinstalling that font either on your server or her computer.\n\n"
    },
    {
      "time": "28 May 2004 — 2:58pm",
      "content": "To tell you a good news about QXpress 6, I have a customer who \"destroyed\" (corrupted) some font suitcases after using them with it.   \n   \nPerhaps the same nasty bug. (Its not a joke)\n\n"
    },
    {
      "time": "5 Feb 2005 — 2:03pm",
      "content": "Quark Forum, Quark Xpress Tutorial, Quark Xpress, Quark Express Download Quark Express, Quark Software, Quark Xpress Download, Printing & Graphic Arts   \n   \nDoes this sound familiar?   \n   \n\\<snip\\>\"The font Helvetica may be corrupt and may be substituted with Courier [108]\"   \n   \nYes, There are TWO Solutions , like a plague on the industry, this Quark Xpress 6.1 problem is a pain. Quark Xpress is more sensitive to font management issues that ever before. Glad you asked because there are two solutions to the problem that PDF-X-Robot users are employing. Like you say, if not, you cannot leave a robot outputting pdf files and proofs all night long. \\<snip\\>   \n **[Quark Xpress Corrupt Font Problems Post](http://web.archive.org/web/20131018215853/http:/software-robotics.com/db_user_forums/viewtopic.php?t=203)**   \n   \nAbout The Problem, Then The Solutions. . .   \n **[Quark Xpress Tutorials To Read](http://web.archive.org/web/20131018215853/http:/software-robotics.com/db_user_forums/_Quark_Xpress_Tutorial_Quark_Forum.php)**\n\n"
    },
    {
      "time": "7 Feb 2005 — 9:58pm",
      "content": "I've had this problem with Quark a bunch of times too. I hate Quark, and now I only use it when I have to. InDesign is so much better - Unfortunatly it can only read old Quark files. ![:-(](http://web.archive.org/web/20131018215853im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "10 Feb 2005 — 10:28am",
      "content": "Hi everybody,   \n   \nI have just upgraded my system to OSX 10.3 and quark to version 6.1. The thing is that the program has become very unstable and while I am working it keeps shutting down without any specific reason. I work for a publisher and usually pages are quite full of images and formulas. However I never experienced anything similar using Xpress 4 for OS9.   \nFonts should not be the issue as we are working with an origilan adobe font folio 10 package and apparently there are no conflicts. Has anyone experienced the same problem? Any solutions?   \n   \n   \n   \nThanks to everyone\n\n"
    },
    {
      "time": "11 Feb 2005 — 6:37am",
      "content": "Upgrading to Quark 6.5 will help [http://www.quark.com/service/desktop/downloads/](http://web.archive.org/web/20131018215853/http:/www.quark.com/service/desktop/downloads/) it still has problems.   \nEspecially with appearing to not deselect type, the highlighted bars remain and you need to hide/show guides to show where it actually is selected\n\n"
    },
    {
      "time": "12 Mar 2005 — 2:38pm",
      "content": "Dude, with regard to font problems. . . If you really think a simple clean font library will save you the horrors of Mac OS X and fonts, you're in for a ride. Fonts on Mac OS X are Hell. Atleast until you clean out the many multiple font locations and get to a state of control. Then your clean adobe folio will work really well. **[\\*Font Management Issues on Mac OS X Here!](http://web.archive.org/web/20131018215853/http:/software-robotics.com/docs/PDF-X-Robot_Font_Management.html)**   \n   \nAnother VERY important read, when you are done with that is to really get accomodated to **[\\*Disk and File System Maintenance on Mac OS X Here!](http://web.archive.org/web/20131018215853/http:/software-robotics.com/docs/PDF-X-Robot_OS_X_Maintenance.html)** Mac OS X should not be crashing out like that, in case it's not a font conflict or problem, be sure you understand proper maintenance, like using some of the old stand by utilities will send you endless doom. Good luck!\n\n"
    },
    {
      "time": "27 May 2004 — 2:25pm",
      "content": "the font is used directly in Quark in the ad.   \n   \nnot sure about font in more than one place. i'll take a look tomorrow. as im soon out for the day.   \n   \nbut me and the other IT guys are trying to get everyone to start using InDesign cuz all Quark is... is a pain in the butttttttt.   \n   \nthanks.\n\n"
    },
    {
      "time": "27 May 2004 — 2:16pm",
      "content": "It might help if you could tell folks what the error is, exactly. Also, more details on the workflow and the font usage. For example, is the font being used directly in Quark in the ad? Or is it in an EPS or PDF or something placed in the ad?   \n   \nDo you have more than one copy of this font installed on the computer? Perhaps both a Type 1 version and a system dfont or something?   \n   \n(Not that I personally know much about Quark 6.1 trouble shooting, as I work at Adobe. Just sort of standard procedure, y'know?)   \n   \nCheers,   \n   \nT\n\n"
    }
  ]
}
