{
  "id": "49649",
  "title": "OpenType & Classes panels don't show",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi,\n\nI’m stuck with a major problem here. Since I’ve updated to Leopard, the OpenType & Classes panels in FLS 5.0.4 don’t show anymore. I temporarily do all the features and class work on my old PowerBook running Panther (on which I haven’t encountered any problem so far).\n\nIs this vanished-panels-thing a known issue?\n\nCheers,  \nSteph\n\n [‹ Problem with XP and OTF/Type 1 fonts](http://web.archive.org/web/20081206081603/http:/typophile.com/node/49308 \"Go to previous forum topic\") [Improving OpenType support in free software: your requests? ›](http://web.archive.org/web/20081206081603/http:/typophile.com/node/46866 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081206081603/http://typophile.com/user/10088\" title=\"View user profile.\">Steph</a>",
  "time": "<br>",
  "uid": "10088",
  "comments": [
    {
      "time": " 19.Sep.2008 8.45am",
      "content": "I encountered a similar issue but under the Windows version. Apparently some preferences got corrupted and apparently FontLab does not deal with those very well.\n\nI would try quitting FontLab, then removing the com.fontlab.fontlab5.plist file which resides in ~/Library/Preferences and start FontLab again and see if it helps. Be advised that doing this may (...will) reset a lot of other preferences that you’ve set (global options, etc.) so you may not want to pemanently delete that file...just move it out of the prefs folder onto your desktop or something, temporarily.\n\nOr, If you’re comfortable with editing .plist files you could probably just edit the specific key, which I think is under /General/ClassListWidth. Mine is currently set to “142”. There may be other similar values that need updating for your specific case.\n\n"
    },
    {
      "time": " 19.Sep.2008 10.07am",
      "content": "Thanks for your comment. I removed the .plist file as you advised, but it doesn’t help at all. And since I’m not that of a tech wizard, I didn’t dare editing this file. Reinstall FontLab didn’t help either.\n\nReminds me of the Terminator that wouldn’t die in the first episode.\n\n"
    },
    {
      "time": " 19.Sep.2008 12.13pm",
      "content": "Try this, [http://www.typophile.com/node/33549#comment-237439](http://web.archive.org/web/20081206081603/http:/www.typophile.com/node/33549#comment-237439 \"http://www.typophile.com/node/33549#comment-237439\")\n\n"
    },
    {
      "time": " 19.Sep.2008 1.08pm",
      "content": "Wow - thanks Miguel! I didn’t know that trick. Now I can carry on FontLabbing without having to use different computers to have the job done! What a relief. :0D\n\n"
    }
  ]
}
