{
  "id": "49670",
  "title": "To Find: A Substitute For Lacuna and FF Good Wide Light",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Any ideas:\n\nwhat kind of similar typeface could be used as a substitute for both of these?\n\nThanks!\n\n ![](http://web.archive.org/web/20131013173411im_/http:/typophile.com/files/lacuna_4433.gif)\n\n ![](http://web.archive.org/web/20131013173411im_/http:/typophile.com/files/goodwidelight_4438.gif)\n\n",
  "author": "halloran",
  "time": "19 Sep 2008 — 3:24pm",
  "uid": "14979",
  "comments": [
    {
      "time": "19 Sep 2008 — 4:37pm",
      "content": "What do you like about them? What don't you like about them?\n\n[FF Good Light](http://web.archive.org/web/20131013173411/http:/www.fontshop.com/fonts/downloads/fontfont/ff_good_wide_light_lf_osf/) can be licensed for $44.00 — not that expensive considering what you get. And [Lacuna](http://web.archive.org/web/20131013173411/http:/www.dafont.com/lacuna.font) is free.\n\n"
    },
    {
      "time": "19 Sep 2008 — 6:30pm",
      "content": "thanks Miss Tiffany.\n\nI like them both, I just am curious if there is another typeface upon which they are based or are similar to (like cousins, for example...) !\n\nApparently, FF Good Wide Light is free too, however, when you visit the FF site, it is not featured under the \"free\" downloads... I am just a little disappointed is all and looking for an alternative.\n\n"
    },
    {
      "time": "19 Sep 2008 — 7:36pm",
      "content": "Yes. FF Good Wide Light was a featured free font last month I believe.\n\nThey are quite different from one another. But I gather you are leaning toward FF Good, yeah? And you are hoping for Free? While I'd really suggest licensing FF Good as it will become a tool\\* which you can use again and again. But, if it is free that you are after I can point you toward:\n\n- [40+ Excellent Freefonts For Professional Design](http://web.archive.org/web/20131013173411/http:/www.smashingmagazine.com/2007/11/08/40-excellent-freefonts-for-professional-design/).  \n- [FAQ Free Fonts](http://web.archive.org/web/20131013173411/http:/typophile.com/node/44453) Typowiki entry.\n\n\\*Always better to opt for quality in terms of tools to be used in the long term.\n\n"
    },
    {
      "time": "20 Sep 2008 — 5:39pm",
      "content": "Hey Miss Tiffany!\n\nThanks very much.\n\nYes, I agree, I think at a certain point... (when income is sufficient) it will be a definite priority to obtain the finest versions of fonts of the highest quality. For now, I am trying my best to be considerate and also to use the faces which best suit my needs and my client's desires...\n\nThank you anyways and I will consider your thoughts in my purchase-decisions in the future.\n\nTake care,\n\nJaz\n\n"
    }
  ]
}
