{
  "id": "49682",
  "title": "Time signatures (music) in body text",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "In a book on music, how does one properly set (e.g. 3/4 or 6/8) time signatures? In a musical score, numerals sit one above the other in vertical alignment. Are standard fraction figures (not that 6/8 seems all that common) acceptable? Or should the numbers be separated by a colon, virgule, etc.?\n\n",
  "author": "ffetish",
  "time": "20 Sep 2008 — 1:47am",
  "uid": "16361",
  "comments": [
    {
      "time": "20 Sep 2008 — 3:08am",
      "content": "What I see most commonly (and I am a musician, so I see this sort of thing fairly often) is simply the numbers separated by / (just as you typed them in your message). Setting them on top of each other, as you'd see in a score, causes problems not only because, unless you make them very small, they are quite high and so cause problems with line spacing, but also it's slightly jarring (to me) to see them presented in any typeface other than the heavy 'standard' time signature style, or variation thereof. Seeing 4/4 or 12/8, however, is quite clear and looks fine in text.\n\nIn a footnote to a score itself, however (also something I deal with fairly often) I'd tend to actually use time signatures matching those in the score, with the numbers on top of each other; but that's less of a problem, since footnotes are usually a few lines (rarely more than two), and one can be flexible about line spacing and so on, especially since on occasion you need to put all kinds of musical notation into them (anything from accidentals, notes to indicate rhythm, or even fragments of music on a stave).\n\nThis is IMHO, of course; I've seen various approaches in music books. In some texts, and assuming enough control over the niceties of the layout, it might be nice to present time signatures in their 'proper' form, especially if other musical symbols are often used in running text.\n\n"
    },
    {
      "time": "20 Sep 2008 — 7:57pm",
      "content": "Depending on the text, I usually set them stacked. See, for example, <cite>Bach Perspectives</cite> Volume 1. Volumes in this series later than 2 or 3 (if any) weren't set by us, & I have no idea whether or not they continued this practice. As the previous poster said, it also depends on whether or not you can make up good characters (numbers), and to some extent, the design of the book/journal.\n\nIf you don't set them stacked, on-line numbers separated by a the virgule is probably best.\n\n"
    }
  ]
}
