{
  "id": "49704",
  "title": "Near clone of Optima on early rulebooks for Traveller role-playing game (late 1970s-early 1980s)",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello all -\n\nMostly for the thrill of the hunt, I’m looking to identify the typeface used as display type in the early rulebooks for the Traveller role-playing game from the late 1970s and early 1980s. After a few years the display face changed to Optima, and the differences were very slight. In fact, there are examples where the two are mixed, with an old logo and new Optima type above it.\n\nOverall, the face is extremely similar to Optima in form of almost all letters and punctuation I’ve seen, oblique and roman both. The oblique form is more upright than Optima’s though, and some letters like F and L may be more condensed.\n\nThe mystery face generally has softer edges and is less delicate, with less cupped terminals. Actually, it often tends to look like a badly worn letterpress font of Optima, and maybe that’s where the maker started from. But there are a few letters that are quite distinct in form. The most obvious is A, which has its righthand stroke continued above its lefthand one. Its crossbar is also high. It’s distinctive, and is one of the reasons I want to find this face, which otherwise looks like a fairly mediocre knockoff of Optima.\n\nHere’s a bit of the logo in mystery face and in Optima for comparison of oblique caps, including the A:\n\n ![](http://web.archive.org/web/20081013050524im_/http:/typophile.com/files/mystery-TRA-sm_6489.jpg)\n\n ![](http://web.archive.org/web/20081013050524im_/http:/typophile.com/files/optima-TRA-sm_5548.jpg)\n\nI should note that the A is this same shape in plain roman, too, not just in the oblique form.\n\nThe other differences I’ve noticed are\n\n1) the apostrophe (or single quote), which is a sharp triangle in the mystery face, unlike the rounded pinball-flipper shape in Optima:\n\n ![](http://web.archive.org/web/20081013050524im_/http:/typophile.com/files/mystery-apostrophe_5827.jpg)\n\n ![](http://web.archive.org/web/20081013050524im_/http:/typophile.com/files/optima-apostrophe_4565.jpg)\n  \n(Try to ignore the fact that the Optima sample is a heavier weight - when they’re the same weight, most letters are nearly identical.)\n\n&  \n2) the y, which has a curved tail in the mystery face, unlike the sharp triangular end in Optima:\n\n ![](http://web.archive.org/web/20081013050524im_/http:/typophile.com/files/mystery-ry_5733.jpg)\n\n ![](http://web.archive.org/web/20081013050524im_/http:/typophile.com/files/optima-ry_6581.jpg)\n\nOther than that, differences are subtle to non-existent within the letters I’ve been able to compare. I haven’t found a Q or a J to compare anywhere, nor most non-alphanumerics. 1, 4, question mark and comma do match Optima quite well.\n\nThe front page of two books, with mystery and Optima (from which the TRA samples above were taken), can be seen [here](http://web.archive.org/web/20081013050524/http:/www.davidmbowman.com/RCB/Traveller/type/TypeComparison1.jpg). I can scan other samples if anyone wants other specific letters, but as I said, I haven’t found any others that aren’t virtually identical to Optima.\n\nDid someone take some Optima and add a new A and y, and change, basically, nothing else? Anyone know what they called it?\n\nThanks in advance for your attention and help!\n\n [‹ Type face id urgently required](http://web.archive.org/web/20081013050524/http:/typophile.com/node/50122 \"Go to previous forum topic\") [Font ID Help ›](http://web.archive.org/web/20081013050524/http:/typophile.com/node/50115 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013050524/http://typophile.com/user/37037\" title=\"View user profile.\">hammerquill</a>",
  "time": "<br>",
  "uid": "37037",
  "comments": [
    {
      "time": " 23.Sep.2008 9.16pm",
      "content": "bump!\n\n"
    },
    {
      "time": " 1.Oct.2008 11.23pm",
      "content": "No replies yet. I’ve got a bit more information. I actually contacted the game designer, who says that Optima was specified from the beginning. This means either the printer said “oh, this one’s close enough,” or the printer had a face that was called Optima, but wasn’t real Optima. I expect it’s the latter, because the text face of these early books is an odd, corrupted form of Univers, with the e and a couple of other letters much too condensed for the rest of the face. When the display face becomes real Optima in later books and printings, the text becomes real Univers.\n\nI have also found examples of both Q and J. J is more or less identical to Optima. Q is quite different from Optima, with the tail a straight bar crossing from inside the bowl to well below the line at about a 45 degree angle. (I can scan if anyone’s interested.)\n\nIf I’m right about the face, though, probably the only hope of finding it would be in the catalogue of whatever company sold the font, back in the ’70s. I can always hope, though...\n\n"
    },
    {
      "time": " 2.Oct.2008 7.58am",
      "content": "Sorry I don’t have enough time to write up more details and provide source files, but Optima had many licensed and unlicensed variants during the 1960s-1980s.\n\nDuring that time many printers and designers used type output from multiple sources; hot-metal (often resized by camera), press-type, IBM Selectric, photo-headline, phototype, and closer to the eighties - CRT typesetters and the first generation digital imagesetters.\n\nGiven the fact that optical adjustments were made by type designers and type foundries to visually optimize the font when used for text versus headlines, you often saw these variants within typefaces at different sizes.\n\nSo just multiply the variables — many licensed/un-licensed versions of Optima x display/text versions x various technology = design variants.\n\nI know of at least six Optima “versions” I used during that time.\n\n"
    },
    {
      "time": " 2.Oct.2008 10.39am",
      "content": "Thanks, Norbert. This is pretty much as I expected. Probably the main logo (from which the ‘TRA’ above is taken) was scaled up by camera - it would fit with its look.\n\nThese are not expensively designed or printed books, so the designers were not going to great lengths with tailoring the typeface for them, I’m certain. Presumably it’s a version (licensed or not) of Optima that was floating around.\n\nI was hoping that someone would be able to pinpoint the actual variant, based on that distinctive A especially, and tell me where it came from. But I know it’s a longshot.\n\n"
    },
    {
      "time": " 2.Oct.2008 10.47am",
      "content": "I found this page of ‘font aliases’ interesting: [http://desktoppub.about.com/cs/findafont/a/fontaliases\\_o.htm](http://web.archive.org/web/20081013050524/http:/desktoppub.about.com/cs/findafont/a/fontaliases_o.htm \"http://desktoppub.about.com/cs/findafont/a/fontaliases\\_o.htm\")\n\nIt suggests clones named\n\n\\* CG Omega  \n\\* Optimum DTC  \nOttawa  \n\\* Zapf Humanist 601 BT  \nAthena  \nChelmsford/II  \nMusica  \nOctober  \nOptimist  \nOrleans  \nUrsa  \nZenith\n\nI was able to find the ones with \\* asterisks online easily (and Zapf Humanist everywhere, of course), and they are at first glance precise copies of Optima. No interesting variants. My few type books are all very above-board and legitimate, so they don’t have the shady stuff. Nor have I seen any reference to legitimate, licensed variants of Optima. But my resources are few.\n\n"
    },
    {
      "time": " 2.Oct.2008 11.40am",
      "content": "I helped launch CG Omega when I was at Compugraphic/Agfa. This was preceded by the infamous “Oracle” version of Optima made during early days of Compugraphic, and before the font library became “legitimate” during Agfa ownership.\n\n"
    },
    {
      "time": " 2.Oct.2008 3.15pm",
      "content": "Sorry I didn’t catch this thread earlier. I recognized this right away. It’s Chelmsford, the clone of Optima that AM (Addressograph Multigraph) had for their typesetting equipment. I always hated what they did to poor Optima, making seemingly random and pointless changes to a few letters, apparently to avoid being accused of font piracy. I still cringe every time I see it—which isn’t often anymore, but happens. There is a trucking company that still uses it, so I see it whizz by on the freeway now and then.\n\nAM had the oddest taste in naming their knock-offs: Melior was called Mallard; Helvetica was called Megaron. A duck and what sounds like something from a Japanese monster movie. And Chelmsford—a British-sounding name for a typeface by a German designer inspired by Italian stone-carved letters. Brilliant.\n\n"
    },
    {
      "time": " 2.Oct.2008 3.57pm",
      "content": "What a great thread. I still remember pouring over the typebooks that different typesetters had, all with different names for similar (based on the same) typefaces! It took a lot of sleuthing then too...\n\n"
    },
    {
      "time": " 3.Oct.2008 12.12am",
      "content": "<cite>It’s Chelmsford, the clone of Optima that AM (Addressograph Multigraph) had for their typesetting equipment. </cite>\n\nCool! This is exactly what I was hoping for hereabouts. I’ll have to see if I can dig up a full specimen sheet of AM Chelmsford. I doubt anyone’s digitized it - there wouldn’t be much point. It is a rather poor copy, and mostly pointless, but that A I do find interestingly done, and quite distinctive, and it’s solidly stamped into my consciousness as part of the logo for the game, and therefore a part of my adolescence...\n\nThanks, Mark (and everyone). Glad I found this place to ask.\n\n"
    },
    {
      "time": " 3.Oct.2008 2.36am",
      "content": "It was Compugraphic itself that documented that Chelmsford was a ripoff of Optima.\n\n[http://www.sanskritweb.net/forgers/compugraphic.pdf](http://web.archive.org/web/20081013050524/http:/www.sanskritweb.net/forgers/compugraphic.pdf \"http://www.sanskritweb.net/forgers/compugraphic.pdf\")\n\nsee page 6, left column, sub voce\n\n"
    },
    {
      "time": " 3.Oct.2008 7.09am",
      "content": "Yes, I have that book. The Typeface Analogue was produced essentially as a marketing tool — a handy “reference” for look-alike typefaces. Several other foundries produced them, Bitstream had one as I recall.\n\nI wouldn’t advise using the Typeface Analogue for accurate historic reference.\n\n"
    }
  ]
}
