{
  "id": "49718",
  "title": "Anchor Attachments using VOLT",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Greetings.\n\nI'm trying to use Anchor Attachments to position marks to base glyphs for an Indic font I'm creating with FontLab+VOLT.\n\nThe positioning of the mark works well and VOLT does provide a really nice interface to tune this perfectly well.\n\nHowever, when I run the feature through the Proofing Tool, there is a space after the base, presumably by the mark that is now attached to the base.\n\nI've tried this with 'Below-Base Mark Positioning' and 'Mark Positioning' features - the result is thesame.\n\nThe attached screen shot may help illustrate the problem.\n\nAppreciate any help or pointer.\n\n~ MUTHU\n\n ![](http://web.archive.org/web/20140522132716im_/http:/typophile.com/files/Telugu_Anchor_Attachments_5182.png)\n\n| Attachment | Size |\n| --- | --- |\n| [Telugu\\_Anchor\\_Attachments.png](http://web.archive.org/web/20140522132716/http:/typophile.com/files/Telugu_Anchor_Attachments.png) | 36.56 KB |\n\n",
  "author": "muthu",
  "time": "21 Sep 2008 — 9:15pm",
  "uid": "2168",
  "comments": [
    {
      "time": "21 Sep 2008 — 10:08pm",
      "content": "Are your marks zero width? Marks should have no advance width, and should be made that way in your font outline creation tool prior to work in VOLT.\n\n"
    },
    {
      "time": "22 Sep 2008 — 12:03am",
      "content": "Thank you, John. That is indeed the problem. Have fixed that and it's working well now.\n\n~ MUTHU\n\n"
    },
    {
      "time": "9 Nov 2008 — 10:09pm",
      "content": "It appears you are working with Telugu font. What is your success rate. I am also trying with a telugu font with VOLT. I adopted the Pothana2000 like glyph structure. In VOLT proofing tool I am getting the right ligatures etc. But on compiling and testing in Word or OO the letters are not forming. Can you help me?\n\nI attaching my screenshot.\n\nVenu Gopal\n\n ![](http://web.archive.org/web/20140522132716im_/http:/typophile.com/files/duvvuri_4087.JPG)\n\n"
    }
  ]
}
