{
  "id": "49715",
  "title": "Illustrator/FontLab workflow questions",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’ve got a few general workflow related issues that I’d love to get some advice on. Any help is greatly appreciated.\n\nI use FontLab 4 on Mac and the CS3 suite. I’ve customised a few typefaces directly in FontLab, but have always used illustrator to draw new ones, using various (hacked together) workarounds.\n\nThe last font I made (shown below) by opening an existing font, which was similar proportions, and copying and pasting my glyphs in, replacing the originals. This worked quite quickly and didn’t require too much tweaking of the existing kerning. It was only after printing out some letters quite large that I realised nodes had been altered and some curves compromised during my copy/paste from illustrator. These were minor, but annoying and noticeable because it was an outline font.\n\nI do plan to start drawing directly in FontLab (is this the best option?) but have just created a typeface in illustrator that I would like to bring into FontLab. Because it is based on a complex grid (shown below), I created letters by using pathfinder to divide the grid into segments which I could then select and unite, quickly designing and keeping the perfect curves. Now I’m not sure what the best way to turn this into a font is. Redrawing on top of a grid in FL seems time consuming and inexact, is there a better way to work that will be quick and preserve my nodes/curves?\n\n ![](http://web.archive.org/web/20081029024134im_/http:/typophile.com/files/Grace_5192.jpg)\n\n ![](http://web.archive.org/web/20081029024134im_/http:/typophile.com/files/Typeface_5809.jpg)\n\n [‹ Ligatures and SmallCaps ?](http://web.archive.org/web/20081029024134/http:/typophile.com/node/49781 \"Go to previous forum topic\") [Software for Calligraphy ›](http://web.archive.org/web/20081029024134/http:/typophile.com/node/49767 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081029024134/http://typophile.com/user/34604\" title=\"View user profile.\">jake1</a>",
  "time": "<br>",
  "uid": "34604",
  "comments": [
    {
      "time": " 21.Sep.2008 11.58pm",
      "content": "I’ve purchased FL5, so hopefully this might be a bit better to work with, but any other help would be appreciated.\n\n"
    },
    {
      "time": " 22.Sep.2008 2.28am",
      "content": "this is a fine question, a fine design mate!\n\nAlthough, personally, Illustrator can drop dead. I’m still holding up the Freehand brigade!\n\nI heard a rumor it’s better to draw up the glyphs in Fontographer, and then slink your sexy font over to FontLab to exploit it’s high-octane scripting, kerning, classing etc. Any truth?\n\n"
    },
    {
      "time": " 22.Sep.2008 3.39am",
      "content": "I would recommend drawing straight into FL, it might take a while to pick it up if you have been drawng in Illustartor but once you do you won’t look back.\n\nThere are enough things to worry about when you are designing fonts without the complications of dragging things between different applications.\n\n"
    },
    {
      "time": " 22.Sep.2008 3.57am",
      "content": "Everyone I know, including myself, has more or less abandoned Illustrator completetly when it comes to drawing letters after getting used to FontLabs bezier handling. I think you will do the same :)\n\n"
    },
    {
      "time": " 22.Sep.2008 4.06am",
      "content": "I’m inclined to agree, for logotypes and such I will ultimately fall back upon freehand, but when it comes to making numerous glyphs, the nature of FL makes it the correct tool for the job.  \nI do love the way the absolute grid works, The handles and points system is pretty spectacular. I need to find all the various buttons I need tho, things like punch and union I miss fiercely.\n\nHehe, and path direction had me proper flummoxed for a whole evening not so long ago.  \nLeslies book helps greatly, I recommend that purchase. It’s lighter than the manual too ;)\n\n"
    },
    {
      "time": " 22.Sep.2008 12.29pm",
      "content": "Not \\*sure\\* that this is the solution for you, but you could try saving/exporting from illustrator as SVG format. I had good results importing SVG into FontForge (haven’t tried it with FontLab).\n\n"
    },
    {
      "time": " 22.Sep.2008 3.50pm",
      "content": "Thanks for the feedback! Now that I have FL5 I’m definitely going to try to get my head around it properly and start drawing in it from scratch.\n\nIt was more this new font that I specifically wanted advice on. As you can see from the second image, it’s all constructed from segments of circles. In Illustrator, creating it by dividing the grid and then uniting sections means the perfect curves are preserved, every one has the same radius. How can I keep this mathematical level of perfection in FL?\n\n"
    },
    {
      "time": " 23.Sep.2008 4.57pm",
      "content": "Jake,\n\nplease read the Illustrator-related section of the FontLab Studio manual. It explains how to optimize the process of moving your outlines from Illustrator to FontLab Studio. The basic principle is that in outline fonts (as supported by FontLab Studio) all points must be on an integer coordinate grid, and that 1 pt in Illustrator corresponds to 1 font unit in FontLab Studio. In other words, make sure that you have a grid in Illustrator every 1 pt, and that all your points are placed on that grid. Then you should be able to transfer your artwork to FontLab Studio without problems.\n\nRegards,  \nAdam Twardoch  \nFontlab Ltd.\n\n"
    },
    {
      "time": " 23.Sep.2008 9.08pm",
      "content": "Adam,  \nthanks so much for your help, I’ll be sure to check out that section of the manual and I’ve also ordered Leslie’s book. Is this something that has changed since FL4.5? I was working in [this](http://web.archive.org/web/20081029024134/http:/haikumonkey.net/?p=42) fashion which takes into consideration sizing, but I don’t think talks about points being aligned to the grid.\n\n"
    },
    {
      "time": " 24.Sep.2008 7.40am",
      "content": "Jake,  \nAlso, Leslie Cabarga’s “Learn FontLab Fast” has great information in it for beginners. Including a page or two of, basically, what Mr. Twardoch just pointed out.\n\nCheers!\n\n"
    },
    {
      "time": " 24.Sep.2008 4.08pm",
      "content": "Adam,  \nI’m using your tips in conjunction with the 1000 x 1000 sq grid I had earlier read about and it’s working well, I’ve only had to slightly modify a couple of nodes to hit grid co-ordinates.\n\nIf I don’t move them in Illustrator, will they automatically be bumped to the nearest co-ordinate when I paste them into FL anyway?\n\nThanks again.\n\n"
    },
    {
      "time": " 25.Sep.2008 8.16am",
      "content": "\\> If I don’t move them in Illustrator, will they automatically be bumped to the nearest co-ordinate when I paste them into FL anyway?\n\nYes.\n\nA.\n\n"
    }
  ]
}
