{
  "id": "49725",
  "title": "Fontographer is dead, long live Fontlab?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi  \nI’ve been using fontographer for a decade now, been through classic, waiting for osx, finally osx version by FL, but what now. Should I keep waiting for FL to upgrade Fontographer or is it time to switch to FontLab? I know it’s a question of taste and use, but is there hope for a Fontographer update (OT and bug fixes).\n\nThe reason, more people are asking for my fonts in OT format. Converting is an option, but creating is out with only 256 char. set in Fontographer.\n\nOr is this just oldskool hanging on to Fontographer?\n\nThoughts anyone?\n\nHans  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nIt’s not where you go, it’s what you bring back…\n\n[http://www.fontourist.com](http://web.archive.org/web/20081201152006/http:/www.fontourist.com/ \"http://www.fontourist.com\")\n\n [‹ Mark glyphs - Python script ?](http://web.archive.org/web/20081201152006/http:/www.typophile.com/node/50172 \"Go to previous forum topic\") [Kern feature ›](http://web.archive.org/web/20081201152006/http:/www.typophile.com/node/7156 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201152006/http://www.typophile.com/user/10859\" title=\"View user profile.\">Fontourist</a>",
  "time": "<br>",
  "uid": "10859",
  "comments": [
    {
      "time": " 22.Sep.2008 5.01am",
      "content": "FontLab has been the king of font production for some time now. How long exactly? Four years? Five years? Maybe a lot longer than that? If I were you, I would switch. Upgrading won’t make you a better designer by any means, but it will allow you to get your fonts out onto today’s market much quicker.\n\n"
    },
    {
      "time": " 22.Sep.2008 7.07am",
      "content": "Fontourist,\n\nI have been enjoying the best of both worlds for awhile.\n\nI have been using professionally Fontographer since Altsys and John Von Ehr of Texas created the program in the eighties. With every new version, they send out a long detailed questionaire and wish list, where a user could describe his peeves and wishes upon how to improve the program. Over 90% of my wishes were implemented, and I sent them many pages of details.\n\nA few years ago, I upgraded to FontLab at the advice of Paul Nelson, formerly of the Microsoft Typography Group. Now, it is headed by Simon Daniels, here on Typophile.\n\nI use Fontographer for my creative and font editing work, and generate my end results in FontLab, as I find Fontographer’s user interface very intuitive.\n\nCertainly, if FontLab would upgrade Fontographer to have OpenType support, this would be great, but I doubt if FontLab will invest the resources to cause users not to purchase FontLab.\n\nBtw, Fontographer supports Unicode and breaks the 256 character limit for a long time. Support though is terrible. I don’t think that there is an online user group.\n\nSo, if you can justtify the investment, you can use both programs, or just patiently learn the FontLab user interface. If you are not a professional, and only use your font creations for personal use, you could always just continue using Fontographer for OSX; similarly, if you don’t need OpenType or the nuances of recent Unicode enhancements in various foriegn languages, then you can just stick with Fontographer.\n\n"
    },
    {
      "time": " 22.Sep.2008 7.28am",
      "content": "I think Israel Seldowitz has it about right. I too used Fontographer since the late 80s. It was comfortable, and still does a few things better than FontLab. It also had a lot of bugs we all worked around. A few years after FL came out, I’d do most of the work in Fontographer but run the final files through FL to get rid of those bugs — & I wasn’t the only one. I remember describing this at a meeting & seeing David Berlow’s head nodding up & down . . .\n\nEventually, you get more comfortable with FL, & will probably use it instead of Fontographer. I think you will need FL to make your OpenType fonts. There are other ways, other programs, but if (like me) you’re more “type” than “computer,” FL is probably the easiest route.\n\n"
    },
    {
      "time": " 23.Sep.2008 5.47am",
      "content": "Thanks guys  \nHelped me decide to buy an upgrade to Fontlab. (they, FL offer a reduction when buying Fontlab if you already own Fontographer:-)\n\nOne quick question, how do you import the fog file into Fontlab?\n\nThanks and cheers\n\nHans g\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nIt’s not where you go, it’s what you bring back…\n\n[http://www.fontourist.com](http://web.archive.org/web/20081201152006/http:/www.fontourist.com/ \"http://www.fontourist.com\")\n\n"
    },
    {
      "time": " 23.Sep.2008 4.50pm",
      "content": "We have plans to continue work on Fontographer, but we don’t plan any immediate releases. We want to rethink the whole application from the ground up and create a font editor that is focused on design rather than on technical work, while making it still very suitable for the needs of the 21st century.\n\nBut this will not happen anytime real soon. We have FontLab Studio 6 in the works, with a much more clear release horizon (sometime within the next 10 months, I would say), while the Fontographer effort is more long-distance.\n\nIn the end, our plan is to have Fontographer as a tool that is focused on design of letterforms and at the same time hide all the unnecessary technical details from the user, while FontLab Studio will the same design tools as the new Fontographer but on top of that will allow people fine control over the production aspect.\n\nCertainly, you’re not doing anything wrong by switching to FontLab Studio now.\n\nRegards,  \nAdam Twardoch  \nFontlab Ltd.\n\n"
    },
    {
      "time": " 24.Sep.2008 3.42pm",
      "content": "_...suitable for the needs of the 21st century_\n\nWhat the heck does that mean?\n\n"
    },
    {
      "time": " 24.Sep.2008 8.47pm",
      "content": "<cite>What the heck does that mean?</cite>\n\nIt means that in addition to crashing every five minutes, Fontlab will now automatically submit bug crash reports to the Web 2.0 so that everyone can socially network about them.\n\n"
    },
    {
      "time": " 25.Sep.2008 8.15am",
      "content": "No, not really.\n\nIt basically means: internationalization.\n\nA.\n\n"
    },
    {
      "time": " 25.Sep.2008 5.28pm",
      "content": "You mean I can pay for it with <cite>Cedi</cite> (currency of Ghana)?\n\n"
    },
    {
      "time": " 30.Sep.2008 3.52pm",
      "content": "Nobody complains about Fontlab more trenchantly than me, I think I have earned my creds in that respect, but I resent it when people say it crashes every five minutes. I use it extensively on Mac and PC and find it remarkably stable. As with all programs, the more complex the input you throw at it, the more likely it is to hiccup. Those working on huge fonts might take a tip from the old days of word processing (the 1990s!), when we would split a complex document into 20-page segments and only assemble at the last possible moment, to avoid crashes. Those working on very complex fonts may have to adopt similar strategies. Considering how varied and unpredictable the input to Fontlab can be (especially when you consider add-ons), I’d even go so far as to say it is a remarkably stable program. Looking forward to a great 21st w/ Flab!\n\n"
    },
    {
      "time": " 30.Sep.2008 4.19pm",
      "content": "I have not had any problems with FLS crashing related to overall VFB size, number of glyphs, etc. Class editing operations run incredibly slowly when kerning is expanded, but the app remains stable.\n\nCrashing is related to particular action sequences. Some of which I’ve so deeply suppressed that I can’t remember what they are: I just don’t do them.\n\n_It basically means: internationalization._\n\nWell, why didn’t you say so? :)\n\nSorry to give you a hard time, Adam: ’needs of the 21st century’ sounded like ad-speak.\n\n"
    },
    {
      "time": " 5.Oct.2008 12.06am",
      "content": "My experience is similar to John’s in this area. Specific sequences of actions can generate a crash pretty consistently (or at least, used to in older versions of FontLab). But I can work day in and day out with a 3000-glyph MM VFB without crashes, as well.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 5.Oct.2008 12.57am",
      "content": "My two and a half cents:\n\nFL crashed on me a good few times, not even on huge complex fonts.\n\nBut I’ve been around this stuff for a real long time.\n\nWho remembers the disappearing files in System 7.0 (before the bullet)? Now, that’s a great bug from none other than Apple! You know when Adobe was a dinky company in Palo Alto.\n\nOh, those were the days, my friends...\n\nWindows 2.1 would crash, if you sneezed, but Mac bombed. Yes, Mac was so much more sophisticated.\n\n"
    }
  ]
}
