{
  "id": "4973",
  "title": "Arya Logotype. Modified Fedra",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Arya is a upscale oriental rug gallery/dealer based in Seattle.   \nClient needed upgraded typographic identity that looks less dated, less ethnic, and bolder. must accompany exsisting Zoraster logo. Top version with lower case Y just didn't quite work. Client choose bottom logo.   \n   \n ![arya](http://web.archive.org/web/20131022203837im_/http:/www.typophile.com/forums/messages/29/36969.jpg)\n\n",
  "author": "designalchemy",
  "time": "28 May 2004 — 5:30am",
  "uid": "804",
  "comments": [
    {
      "time": "28 May 2004 — 5:34am",
      "content": "Here is comp for tri-fold brochure (one of two tri-folder to be designed) This would be cover image. ![brochure cover](http://web.archive.org/web/20131022203837im_/http:/www.typophile.com/forums/messages/29/36972.jpg)\n\n"
    },
    {
      "time": "28 May 2004 — 5:44am",
      "content": "Here is old brochure covers ![old covers](http://web.archive.org/web/20131022203837im_/http:/www.typophile.com/forums/messages/29/36975.jpg)\n\n"
    },
    {
      "time": "28 May 2004 — 5:50am",
      "content": "I'm not quite sure what you are wanting a crit for. Is this a done deal already, or is it still evolving. To bad they you can't just loose the bird.   \n   \nThe space between the Y and A is to tight. Why is the word guide in purple. The purple seems a little dull in relation to the black. I dig the type face. It seems like the logo needs to be bolder, or if not bolder smaller.\n\n"
    },
    {
      "time": "28 May 2004 — 5:51am",
      "content": "Second choice for cover. In this version logo type was not yet developed . I used Peter Bilak's Fedra Sans.   \n ![alt cover](http://web.archive.org/web/20131022203837im_/http:/www.typophile.com/forums/messages/29/36979.jpg)\n\n"
    },
    {
      "time": "28 May 2004 — 5:55am",
      "content": "Ole, the only thing I would look into for your comp is (not a rug pattern) but a rug texture behind your graphics. Its a little cold and austeer. As for the old brochures: Tacky use of drop shadows and squooshing of Tiffany is just disgusting.\n\n"
    },
    {
      "time": "28 May 2004 — 5:57am",
      "content": "Hey Sorry Ole, when I posted my message all I could see was the top logo and brochure. I couldn't see the old versions. You really made some changes for the better. I do like the top first cover over the second.\n\n"
    },
    {
      "time": "28 May 2004 — 11:51am",
      "content": "Hi Tiffany.   \nVersion.1-The Zoraster character has to be part of it and I was not allowed to simplify it/ or re-render it as vector.   \nVersion.2-I think you have a point about the lines. I took them from other comps (not shown), but I think you are right-not needed. Background is dark brown not black (perhaps poor color compression for web post). A redish tone brown would properly be even nicer. Thanks for the critique.\n\n"
    },
    {
      "time": "28 May 2004 — 2:24pm",
      "content": "Ole, frisson-inducing stuff, as usual. :-) Really warm, but deep, not mushy.   \nBut I wonder why the curvy \"Y\" wasn't chosen - it fits _so_ well to me.   \n   \nThe lines: I actually think they make sense in the context of rugs, but maybe make them slightly \"shaky\", organic (and thicker), instead of totally rigid.   \n   \n\\> Tiffany doesn't like to be squooshed very often.   \n   \nBut it's the ultimate wedding font!! ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "29 May 2004 — 1:04am",
      "content": "Ole, I prefer comp #1 for the brochure, but the Zoroaster character really bothers me. It either needs to be the full width of the logotype or set as a watermark along the length of the brochure.   \n   \nAlso, I don't understand the significance of the spot colour on \"Guide\"\n\n"
    },
    {
      "time": "29 May 2004 — 6:55pm",
      "content": "Black is too hard colour for hand made stuff my grandmothers do. Their work is always soft and warm, black is always used to express suffering and struggle in contrast with other colours.   \ng\n\n"
    },
    {
      "time": "30 May 2004 — 6:33am",
      "content": "My 2 cents:   \nThe 2 A's look overdesigned, and remind me of the anarchic A's of the heavy-metal ages. ![:-)](http://web.archive.org/web/20131022203837im_/http:/www.typophile.com/forums/clipart/happy.gif) WHy don't you try to keep the curly crossbar (and maybe make it subtler) but raise it's right end so that it intersects the right stem of the first A a bit higher?   \n   \nAlso, if you plan to use rounded shapes as design elements, I think you should soften a bit the letter shapes (look at British Airways logo and Mylius font).\n\n"
    },
    {
      "time": "31 May 2004 — 7:28am",
      "content": "Futher explanation and responses to posts.   \nArya wanted to modernise and synchronize their identity witout modifying the Zoraster icon they already use. As I discovered once I got started was that the sacred geometry and symbology associated with the character could not be modified, as there was a reason for everything in it. Although I would have liked to re-render it in vector for userbility and refinement I was discouraged to do so by client.   \n   \nThe comps shown were really my first attempt at this to show client some direction. I banged this out the same night after our initial brief 10 minute meeting.   \nThe next day when we had a real meetiung scheduled I was surprised to discover client liked it all as is (top version).   \nIn some strange way disappointing as I like many other typophiles really enjoy the refinement aspect of a project like this.   \n   \nOne issue is that we are doing mostly trade, and what was not determined was $ exchange in our short 10 min. meeting. I trust this client because of the referral, so I went ahead with comps as shown.   \nSo what now? Well I have approval and exchange negotiated, so I will continue with content.   \n   \nI agree the \"A\"s aret not perfect (btw I enjoyed your comment about heavy metal Marius-I can see where you how you see the associated, at least if the type is isolated).   \nBlack is to stark-\" It always expresses suffering and struggle\" I don't agree, Pirates always seemed to be having a good time-just kidding, anyway in final version they will be a warm dark reddish black/maroon.   \n   \nAbout spot color on \"Guide\" - just a comp to show client what we could use. It will be solid-thanks Chase a good observation.   \nI does lokk a bit off.   \n   \nA word of advice. Trades can be nice but be careful-it is not a good practise to get in the habit of doing so, especially if you have a sales rep.\n\n"
    },
    {
      "time": "28 May 2004 — 9:14am",
      "content": "Yeah. Tiffany doesn't like to be squooshed very often. Hehe. ;)   \n   \nVersion 1: Is the little character part of the logo at all? If not I think it is unnecessary.   \n   \nVersion 2: I think the lines are superfluous and remove from the organic other-wordliness of the rest of the design. I wonder if instead of black you use another red/brown color?\n\n"
    }
  ]
}
