{
  "id": "49747",
  "title": "The perplexing upper case of the Monotype 'Porson' Greek",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Dear Friends,\n\nIt has become clear to me that the great disparity of height  \nbetween the upper and lower case of the Monotype ‘Porson’  \nmakes it difficult to find an utterly pleasing latin companion  \nfor this distinct cursive.  \nAt long last I took a bunch of old books on my desk and  \nmeasured up some ratios between the upper and lower case  \nletters used in the course of time by the Oxford University  \nPress. And it seems indeed that the upper case glyphs have  \nincreased as follows:\n\n1882 (a metal type for hand composition)  \nCap Height = 1,62 units  \nx-height = 1,00 units\n\n1955 (a metal type for machine composition)  \nCap Height = 1,86  \nx-height = 1,00\n\n1978 (a type for photosetting)  \nCap Height = 1,91  \nx-height = 1,00\n\n1993 (a digital type)  \nCap Height = 1,91  \nx-height = 1,00\n\n\\* \\* \\*\n\nI have been examinig thus if the existing uppercase of the  \nMonotype ‘Porson’ could be successfully replaced by capitals  \nloaned from an entirely another font. The ‘Arno’ for example  \ncan be seen on the left column (and the ratio 1,62/1 was used):\n\n ![](http://web.archive.org/web/20081005113014im_/http:/typophile.com/files/Porson_4993.jpg)\n  \nWhat say You?\n\nP. L.\n\n| Attachment | Size |\n| --- | --- |\n| [Porson.jpg](http://web.archive.org/web/20081005113014/http:/typophile.com/files/Porson.jpg) | 146.35 KB |\n\n [‹ Calling all font makers - the W3C wants to hear from you](http://web.archive.org/web/20081005113014/http:/typophile.com/node/48971 \"Go to previous forum topic\") [The letter J: Obsolete? ›](http://web.archive.org/web/20081005113014/http:/typophile.com/node/49764 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081005113014/http://typophile.com/user/12482\" title=\"View user profile.\">Hyperboreus</a>",
  "time": "<br>",
  "uid": "12482",
  "comments": [
    {
      "time": " 22.Sep.2008 2.36pm",
      "content": "I don’t much like the match of Arno caps & Porson lowercase.\n\nBut you are right, the caps in Porson are too big for comfort in most text settings with the PostScript version. I resized (& therefore had to reweight) our version long ago. But that was a couple of sales of Monotype Corporation ago, & I had permission. I doubt you could get it today.\n\nThe Greek Font Society has an Open Source version of Porson Greek\n\n[http://www.greekfontsociety.gr/pages/en\\_typefaces19th.html](http://web.archive.org/web/20081005113014/http:/www.greekfontsociety.gr/pages/en_typefaces19th.html \"http://www.greekfontsociety.gr/pages/en\\_typefaces19th.html\")\n\nIt isn’t quite as good as the Monotype, but if you’re going to fiddle, it IS open source & there wouldn’t be any license issues.\n\nGFS has some other nice Greek fonts, look at Olga on the 20th century page.\n\nAnd I’ve always liked Wilson Greek, Matthew Carter’s digitization of Alexander Wilson’s fonts. Not sure it is available now, though.\n\n"
    },
    {
      "time": " 23.Sep.2008 3.31am",
      "content": "Dear Charles,\n\nIt is true of course that ‘Arno’ and ‘Porson’ do not match remarkably well,  \nbut astonishingly well with such incompatible pedigrees.  \nIn the ‘Agamemnon’ of Aeschylus, printed by John Clay at the Cambridge  \nUniversity Press in 1910 the upright capital letters are used:\n\n ![](http://web.archive.org/web/20081005113014im_/http:/typophile.com/files/Porson_CUP_1910_3702.jpg)\n  \n\n ![](http://web.archive.org/web/20081005113014im_/http:/typophile.com/files/Porson_CUP_1910_2_5602.jpg)\n\nMight I ask, how much You decided to diminish the cap-height of the digital  \nversion? (My very own skills are not sufficient when it comes to altering any  \nexisting designs and that is the reason for my searching.)  \nMr. Carter granted me his kind permission to use ‘Wilson’ in my recent  \n‘Compositor’s Epilogue’ to a fresh Classical Greek Textbook for Finnish  \nreaders, it is a masterpiece, but I wonder if it could survive moderate point  \nsizes occasionally required in the forthcoming Greek Grammar?  \nOn the other hand ‘Wilson’ might be a perfect companion to ‘TEFF Lexicon’...\n\nP. L.\n\n"
    },
    {
      "time": " 23.Sep.2008 7.18am",
      "content": "Second things first:\n\nI think Wilson Greek works very well with Quadraat, see\n\n[http://books.google.com/books?id=YenwwRfce9YC&dq=%22household+and+city+o...](http://web.archive.org/web/20081005113014/http:/books.google.com/books?id=YenwwRfce9YC&dq=%22household+and+city+organization+at+olynthus%22&pg=PP1&ots=8-a7kcE0K3&sig=eH-gO-JlkD9qF37WAruetaTkxU8&hl=en&sa=X&oi=book_result&resnum=4&ct=result \"http://books.google.com/books?id=YenwwRfce9YC&dq=%22household+and+city+organization+at+olynthus%22&pg=PP1&ots=8-a7kcE0K3&sig=eH-gO-JlkD9qF37WAruetaTkxU8&hl=en&sa=X&oi=book\\_result&resnum=4&ct=result\")\n\nPage 306 shows Wilson run into the text at a note-size setting; page 1 shows a text-size setting.\n\nOf course, this from an American (European-American if we use the current politically correct practice of appending the continent of our ancestors), who doesn’t see Greek in everyday life. Someone who reads Greek newspapers, magazines, books, etc. on a daily basis may have a different feeling.\n\n\\* \\* \\*\n\nMy discomfort with the Arno caps & Porson lowercase doesn’t stem from the fact that the caps are upright & lowercase is inclined. As I remember, that was also the case with the old metal Porson. It is more the weight & contrast of the Arno; the heavy strokes are not as heavy, and I believe the fine lines are not quite as fine. Too, the Arno is broader for it’s height; too broad for Porson.\n\nThis isn’t a matter of numbers, but of feel.\n\nYou asked how much I reduced the ratio of the caps in Porson — “about” 1.7 times the x-height. Depends on where you measure. This is the ratio of the top of the cap Epsilon, at 605 units (1,000 unit em) and the flat part of the serif on a lowercase nu, at 349 units. But the rounded part of the nu is 364, the same as a lowercase omicron.\n\nI didn’t do the scaling by aiming for a particular raito. I scaled them according to what I thought I could get away with. It was also a non-linear scaling, and I re-worked the weighting of the caps (& some of the lowercase letters also, from my notes).\n\nThe GFS Porson has a cap height of 703 (Epsilon, as above), and the nu is 396 and 404 (as above). That works out close to 1.75. The GFS Porson also has upright caps & inclined lowercase.\n\nIf you set a lot of Greek and are wedded to Porson, it may be worth your while to have the font redrawn to your taste. I peeked at your user information; it says “graphic designer.” I make my living mainly setting type, and can justify the cost of custom fonts, either by paying for a redrawing or doing the work myself. When I work over fonts, I get no return, since I do not sell type. So for me and you, custom fonts would just be another business decision. Well, that’s the argument available to us — I suspect it’s really about good type, but our motives are private business.\n\n"
    },
    {
      "time": " 25.Sep.2008 3.26am",
      "content": "Dear Charles,\n\nThank You for all the invaluable insight!  \nActually I considered using ‘FF Quadraat’ with ‘Porson’, but rejected it  \nbecause of its overelaborate ‘§’. (There are no less than 168 §§ in the  \ngrammar.) It would be stimulating though to see the book recommended.\n\n\\* \\* \\*\n\nBy the way I think the numbers and ratios are often much gentler tyrants  \nthan the pure feelings...\n\n\\* \\* \\*\n\nUnfortunately the custom fonts are far out of my reach... And the current  \ncommission is most probably my last opportunity to work with the Greek  \nalphabet. (I am afraid that no more than a dozen books containing Greek  \nsettings have been published in the whole Finnish printing history.)\n\n\\* \\* \\*\n\nFurthermore, do You happen to know if ‘DTL Albertina Greek’ supports  \npolytonic Greek. (It is obvious that DTL does not answer to any inquiries.)  \nThe ‘DTL Albertina Polytonic’ mentioned here might be, well, customized:\n\n[http://www.microsoft.com/typography/links/news.aspx?NID=2533](http://web.archive.org/web/20081005113014/http:/www.microsoft.com/typography/links/news.aspx?NID=2533 \"http://www.microsoft.com/typography/links/news.aspx?NID=2533\")\n\nP. L.\n\n"
    },
    {
      "time": " 25.Sep.2008 1.52pm",
      "content": "As to the Albertina Greek, the site you reference says\n\n<cite>The typefaces she used for this book are DTL Haarlemmer, DTL Albertina Greek Monotonic and Polytonic.</cite>\n\nI doubt it was customized.\n\n\\* \\* \\*\n\nYou might get up with Yannis Haralambous. He knows far more about what is available in polytonic Greek than most of us.\n\n[http://omega.enstb.org/yannis/](http://web.archive.org/web/20081005113014/http:/omega.enstb.org/yannis/ \"http://omega.enstb.org/yannis/\")\n\n& on the off chance that you rejected Quadraat only because of the section symbol, remember it would be easier to switch that character than all the uppercase Greek letters . . .\n\n"
    },
    {
      "time": " 25.Sep.2008 2.42pm",
      "content": "If you have Arno Pro, who not use that for the Greek?\n\n"
    },
    {
      "time": " 26.Sep.2008 10.32am",
      "content": "Charles\n\nWell, ‘DTL Albertina Greek’ might not look as good as it sounds.  \nIt is just that I have not seen any text settings composed in ‘Albertina  \nGreek’—the individual letters certainly bear some resemblance to  \nMr. van Krimpen’s ‘Antigone’, which does seem a virtue to me  \n(I am well aware of the criticisms towards ‘Antigone’, but I consider  \nit exceptional when composed in 16-points with ‘Lutetia’.)\n\nJohn\n\nI am not very keen on Mr. Slimbach’s Greek types. ‘Arno’ actually  \nreminds me of Willy Wiegand’s ‘Homer’ which was used in archaistic  \neditions of Sappho (1921) and Homer (1923–1924) by the Bremer  \nPresse. It is as if the types aforementioned were too conscious of  \ntheir fine calligraphic ancestry... Having said that, I do notice that  \nsomething similar could be said of the ‘Antigone’.\n\n"
    }
  ]
}
