{
  "id": "49754",
  "title": "Times Old Roman",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "If you go to Wikipedia and look up Times New Roman you'll see a reference to Times Old Roman.\n\nAnyone have a good specimen or link to an actual font?\n\n",
  "author": "Christopher Dean",
  "time": "22 Sep 2008 — 2:46pm",
  "uid": "15065",
  "comments": [
    {
      "time": "23 Sep 2008 — 5:42am",
      "content": "In the Summer 2001, Vol. 10, issue of Eye magazine, there was an article about the introduction of Dave Farey and Richard Dawson's Times Classic (which I think has since been superceded yet again).\n\nOne illustration to the article shows part of a publicity piece that was produced to accompany the 1932 introduction of Times New Roman and which compares TNR with its predecessor. It looks like some fairly non-descript Modern, typical of the period. I'd never heard that it was referred to as Times Old Roman; that strikes me as a questionable assertion.\n\n-- Kent.\n\n"
    },
    {
      "time": "23 Sep 2008 — 6:22am",
      "content": "_that strikes me as a questionable assertion._\n\nI'd think publishers calling their type Times Old Roman would be as plausible as Plato having a wall calendar reading 400BC.\n\n"
    },
    {
      "time": "23 Sep 2008 — 8:16pm",
      "content": "Yeah, it was called Times Modern if my memory is not failing (read it at Lawson's Anatomy). Times Old Roman is nonsense as pointed out by eliason.\n\nThe face looked nondistinctive and pretty dull amongst the universe of modern untrascended faces.\n\nHéctor\n\n"
    },
    {
      "time": "24 Sep 2008 — 5:21am",
      "content": "Looks like Lawson is where the Wiki statement came from -- <cite>Anatomy of a Typeface</cite>, top of page 274. I've found inaccuracies and misleading statements in Lawson before, so I'd like to see some corroboration before I accept his assertion.\n\n-- K.\n\n"
    },
    {
      "time": "17 Dec 2008 — 3:10pm",
      "content": "Sorry to resurrect an older thread, but I was just rereading Morison's _Tally of Types_. On page 15 of the 1999 Godine reprint, he specifically says that _The Times_ used Monotype Modern 7 starting in 1908, replacing Miller and Richard Modern.\n\n"
    },
    {
      "time": "17 Dec 2008 — 5:03pm",
      "content": "_Looks like Lawson is where the Wiki statement came from —_ Anatomy of a Typeface_, top of page 274. I’ve found inaccuracies and misleading statements in Lawson before, so I’d like to see some corroboration before I accept his assertion._\n\nAccording to Google Books, [at least three other publications make the same claim](http://web.archive.org/web/20120612021330/http:/books.google.com/books?client=safari&q=%22times+old+roman%22&btnG=Search+Books)... The only one published before Lawson's book is the _Journal of the Royal Society of Arts_. So could that be the original source of the statement?\n\n_I’d think publishers calling their type Times Old Roman would be as plausible as Plato having a wall calendar reading 400 BC._\n\nExactly. No one would name a typeface \"Old\" before the fact!\n\n"
    },
    {
      "time": "17 Dec 2008 — 6:00pm",
      "content": "I do wonder though how much Times Old Roman isn't a simple matter of miscapitalization of a common term.\n\nThat was the old roman typeface we were using, and this is the new roman. Oh, it's New Roman. Therefore, Old Roman.\n\n"
    },
    {
      "time": "18 Dec 2008 — 2:34am",
      "content": "I do not think that the term ‘The Times Old Roman Type’, for the paper’s normal text type, was ever intended as anything but a visual joke when it was set for the image that appeared on the cover of the ‘special issue’ of Monotype’s publicity journal, _The Monotype Recorder_, issued in 1932 to promote the new type. (Lawson’s assumption that it was a term – so capitalized – that was in use before 1932 must indeed one of his blunders.) Most of the text of the journal is written in a gushing style that means it can only be the the work of Monotype’s new publicity manager, Beatrice Warde.\n\n‘The Times Old Roman Type’ of the image, which is shown below, does indeed seem to be Monotype’s Modern Extended, their Series 7, a revision of Series 1, their first face, which had been derived from a type of the Edinburgh typefounders Miller & Richard.\n\n ![](http://web.archive.org/web/20120612021330im_/http:/typophile.com/files/The%20Times%20New%20and%20Old%20Roman%20-%20MR%201932%20500_3742.jpg)\n\nHere are details of the lower case and capitals of the 9-point size, from a specimen page printed by Monotype in 1971.\n\n ![](http://web.archive.org/web/20120612021330im_/http:/typophile.com/files/Mono%20Modern%20Extended%207%20-%209%20pt%20-%20lc%20det%20500_3954.jpg)\n\n ![](http://web.archive.org/web/20120612021330im_/http:/typophile.com/files/Mono%20Modern%20Extended%207%20-%209%20pt%20-%20caps%20P%20to%20T%20500_5536.jpg)\n\nSuch fine hairlines and ink traps might have alarmed the printers of mass circulation papers, but _The Times_ was different, being set on Monotype machines rather than Linotypes, and its small print run was printed slowly on superior paper. It was, as the _Monotype Recorder_ cringingly explained to its readers, a paper for ‘people who count’, who were ‘a wealthy group; a group to which the executives and rulers in every walk of life are automatically attracted’.\n\nBut it is worth noting that the note in the _Tally of Types_ concerning the use by _The Times_ of Monotype’s Series 7 was almost certainly never written by Morison. It does not appear in the first edition, which was made to be ‘privately printed’ in 1953 for his friends by Brooke Crutchley, the University Printer at Cambridge, in order to tell the story in Morison’s own words of the making of the types cut by Monotype and used at the University Press. Morison died in 1967, before the ‘trade edition’ of the book was prepared and published in 1973. This edition was reprinted from the original pages by Godine in 1999, with the addition of an excellent new introduction by Mike Parker but omitting Crutchley’s own preface of 1973, which a pity.\n\nFor the 1973 edition Morison’s original introduction was ‘revised and amplified by P. M. Handover’, who was his research assistant based at _The Times_. She wove his words together with some from Crutchley’s original ‘postscript’ of 1953 (which was omitted), inserting not only many details of her own but some miscellaneous material that had been put together for the new edition, including a contribution of mine. Correspondence at the University Library in Cambridge suggests that some aspects of her editorial performance tried Crutchley’s patience sorely.\n\n"
    },
    {
      "time": "18 Dec 2008 — 4:40am",
      "content": "_According to Google Books, at least three other publications make the same claim... The only one published before Lawson’s book is the Journal of the Royal Society of Arts. So could that be the original source of the statement?_\n\nThe reference in the RSA Journal of (I think) 1968 appears simply to be a caption to the image on the front of the special issue of the _Monotype Recorder_, repeating the words that are set in type, and is neither a claim nor a statement.\n\n"
    },
    {
      "time": "18 Dec 2008 — 6:55am",
      "content": "Thanks for clearing this up, James. Google Books mentions 1968 as the date of the RSA Journal with the caption.\n\n"
    }
  ]
}
