{
  "id": "49765",
  "title": "Feijoa in use: 2 great samples",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I googled and found 2 great samples of Feijoa, a most beautiful serif by a most talented Kris Sowersby.\n\n**Samples**  \n1. _Write Times_ (a literary collection of student writing from Scotland)\n\n[http://www.sqa.org.uk/sqa/24110.html](http://web.archive.org/web/20131106084904/http:/www.sqa.org.uk/sqa/24110.html \"http://www.sqa.org.uk/sqa/24110.html\") (the page the link is sitting on)\n\n[direct link to sample](http://web.archive.org/web/20131106084904/http:/www.sqa.org.uk/files_ccc/Final_Write_Times.pdf)\n\n2. _Goodbye, Madame Butterfly_ (a series of short stories)\n\n[http://goodbyemadamebutterfly.com/preface/](http://web.archive.org/web/20131106084904/http:/goodbyemadamebutterfly.com/preface/ \"http://goodbyemadamebutterfly.com/preface/\") (the page the link is sitting on)\n\n[direct link to sample](http://web.archive.org/web/20131106084904/http:/goodbyemadamebutterfly.com/mint/pepper/tillkruess/downloads/tracker.php?uri=http%3A//goodbyemadamebutterfly.com/downloads/gmb_preface_mannequin.pdf)\n\n[purchase the book](http://web.archive.org/web/20131106084904/http:/goodbyemadamebutterfly.com/purchase/)\n\n**Where can you license Feijoa?**\n\n[http://vllg.com/KLIM/Feijoa/mudTyper+Weights/](http://web.archive.org/web/20131106084904/http:/vllg.com/KLIM/Feijoa/mudTyper+Weights/ \"http://vllg.com/KLIM/Feijoa/mudTyper+Weights/\")\n\nMake Feijoa a part of your personal collection. I can't stop looking at it! There, I said it.\n\nEnjoy!  \nRahim\n\n",
  "author": "RahimSnow",
  "time": "22 Sep 2008 — 10:11pm",
  "uid": "28631",
  "comments": [
    {
      "time": "23 Sep 2008 — 12:29am",
      "content": "feijoa along with every other kris' typeface is on my to buy list!  \ngreat stuff, thanks for the links\n\n"
    },
    {
      "time": "23 Sep 2008 — 1:06pm",
      "content": "riiiiiight...and what was it you googled exactly?\n\nThis reeks of someone on the payroll.\n\n"
    },
    {
      "time": "23 Sep 2008 — 1:18pm",
      "content": "Hello Therese.\n\nYou might want to open the windows & let in some fresh air. I can assure you that the only person on my payroll is me.\n\n--K\n\n"
    },
    {
      "time": "23 Sep 2008 — 1:31pm",
      "content": "Kris,  \nYou mean you don't have a factory full of little glyph people down there in NZ who work the hours away for you for free? :-)\n\nTherese doesn't know that type design is the land of solitude and FL5 crashes :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Sep 2008 — 4:08pm",
      "content": "Therese wrote: \"riiiiiight...and what was it you googled exactly?\"\n\nI googled:  \nfeijoa font  \nfeijoa typeface  \nfeijoa \"set in\"  \nfeijoa body text\n\nI searched through lots of blogs, forums, etc and picked up additional clues to see who's been using Feijoa. And that led me to these two samples.\n\nTherese also wrote: \"This reeks of someone on the payroll.\"\n\nHave you ever listened to a band that was so good you told your friends they HAD to listen to them?\n\nHave you ever seen a movie that moved you so much that you told your friends they HAD to see it and that you'd be willing to go with them to see it again?\n\nHave you ever read a book that blew you away so much that you bought several copies for your friends and family?\n\nNow: did that band or that movie studio or that author ever send you a paycheck in the mail to thank you for your unsolicited efforts in marketing their product?\n\n\"Marketing your product\", you might say, \"sounds so clinical and cold. No, no, I just got so excited about it, I just wanted to share it with other people and encourage them to support you so that your company can keep making stuff of this quality into the far future. The last thing I want you to do is stop what you're doing because you weren't able to make a living off of it.\"\n\nIt's in that spirit that I hunted down samples of Feijoa via google and clues left on various typography forums, blogs, etc. and in that spirit that I made this post to encourage people to license Feijoa so that Kris can keep doing what he loves and we can be benefactors in the future of his amazing creativity.\n\nAlso, I haven't yet mentioned the fact that I'm a writer so I'm also coming at it from the angle of an artist supporting another artist's work.\n\nI'm not on Kris's payroll. My evangelism for his work is simply an extension of my gratitude for his creative efforts.\n\n(Don't you know a few people who are evangelistic about a certain computer company with the logo of a fruit who are crazy about that company, buy everything from that company, love to talk smack about that company's biggest competitor, though none of these die-hard fanatics have ever received an evangelism paycheck from Mr. Jobs?)\n\nRahim\n\n"
    },
    {
      "time": "23 Sep 2008 — 5:08pm",
      "content": "We are all type evangelists, to some extent, here on Typophile. I'm totally guilty.\n\n"
    }
  ]
}
