{
  "id": "49779",
  "title": "Astrid Lindgren Rotunda?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20081201160423im_/http:/www.typophile.com/files/astrid1_4489.jpg)\n\nI’m looking for the typeface on this cover. I’ve found similar faces, but nothing that has the round curves that this one has. I think this would be classified as a rotunda, but I’m not sure.\n\nThanks,  \nS.\n\n [‹ font id](http://web.archive.org/web/20081201160423/http:/www.typophile.com/node/49772 \"Go to previous forum topic\") [What is the serif-font in this image with the large spaces? ›](http://web.archive.org/web/20081201160423/http:/www.typophile.com/node/49771 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201160423/http://www.typophile.com/user/1092\" title=\"View user profile.\">svenni</a>",
  "time": "<br>",
  "uid": "1092",
  "comments": [
    {
      "time": " 23.Sep.2008 7.50am",
      "content": "It’s not a font. It’s handwritten.\n\n"
    },
    {
      "time": " 23.Sep.2008 8.11am",
      "content": "Lydian is very close apart from the ’e’.\n\n ![](http://web.archive.org/web/20081201160423im_/http:/www.typophile.com/files/Lydian_3732.jpg)\n\nNick Cooke\n\n"
    },
    {
      "time": " 23.Sep.2008 8.18am",
      "content": "On first blush Jan I agree... but there are some metal qualities to this that are throwing up red flags.\n\nSvenni, do you have a date and publisher on this book?\n\nMichael\n\n"
    },
    {
      "time": " 23.Sep.2008 8.48am",
      "content": "An amazing book, by the way.\n\n"
    },
    {
      "time": " 23.Sep.2008 8.49am",
      "content": "Thank you Nick. I knew it was WC’s Lydian, I know that there were derivatives produced but was not sure of the time line of the copies or this book. This is, as everyone can see, a bolder version which led me to believe, as well as agree with Jan, that this may be a rip or amended version... possibly “emboldened” by hand.\n\nMichael\n\n"
    },
    {
      "time": " 23.Sep.2008 10.01am",
      "content": "It’s published in 1976. The original publisher is Heimskringlan. I doubt that’d tell you much though :D\n\nThis is the Icelandic translation of the Brothers Lionheart. The original version in swedish uses a different typeface, and the english/american one yet another.\n\nSv.\n\n"
    },
    {
      "time": " 23.Sep.2008 11.54am",
      "content": "There was a bold version added in ’38 but I have never seen it that I remember. But I would bet you that this is it... however there does seem to be a bit of finagling. Do not know how that figures into this piece of work. He was heavily into book publishing, as was his cousin, Oscar Ogg (Book of the Month Club), so maybe he did it himself or as I suggested someone else amended it! BTW, they are both from Richmond VA, USA where I live.\n\nMichael\n\n"
    },
    {
      "time": " 23.Sep.2008 5.09pm",
      "content": "That ’e’ is from the italic.\n\n"
    }
  ]
}
