{
  "id": "49795",
  "title": "Typophile: Do we need it?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Seems like a valid question given the recent spate of topics.\n\n [‹ The letter X: do we really need it?](http://web.archive.org/web/20081201150738/http:/www.typophile.com/node/49787 \"Go to previous forum topic\") [DIY Dry transfer rub downs? ›](http://web.archive.org/web/20081201150738/http:/www.typophile.com/node/50004 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201150738/http://www.typophile.com/user/1947\" title=\"View user profile.\">terminaldesign</a>",
  "time": "<br>",
  "uid": "1947",
  "comments": [
    {
      "time": " 23.Sep.2008 4.02pm",
      "content": "Maybe we just need a “Wankshaft” category.\n\n"
    },
    {
      "time": " 23.Sep.2008 4.03pm",
      "content": "I will dignify your remark with a reply because I am bored.\n\n"
    },
    {
      "time": " 23.Sep.2008 5.27pm",
      "content": "\\>Seems like a valid question given the recent spate of topics\n\nJames, all the cool kids were in Russia last week and are de-toxing this week.\n\n"
    },
    {
      "time": " 23.Sep.2008 6.07pm",
      "content": "What is this ... Russia?\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081201150738/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 23.Sep.2008 6.17pm",
      "content": "<cite>What is this ... Russia?</cite>\n\nIt’s apparently where typographers go to drink tainted vodka.\n\n"
    },
    {
      "time": " 23.Sep.2008 6.37pm",
      "content": "<cite>I will dignify your remark with a reply because I am bored.</cite>\n\nYou and me both.\n\nYou call that a reply?\n\n"
    },
    {
      "time": " 23.Sep.2008 7.51pm",
      "content": "To do nothing is still a course of action.\n\n"
    },
    {
      "time": " 23.Sep.2008 8.02pm",
      "content": "\\>What is this ... Russia?\n\nFor me it’s certainly eye-opening being in a country where the rules of capitalism don’t apply, phones are tapped, companies are being nationalized, the leaders are dangerous nut-jobs and the currency is close to worthless.... Especially after spending a week in Russia.\n\n"
    },
    {
      "time": " 23.Sep.2008 8.11pm",
      "content": "Action is the effect of an act, not doing is not an act.\n\nHéctor\n\n"
    },
    {
      "time": " 23.Sep.2008 8.35pm",
      "content": "<cite>For me it’s certainly eye-opening…</cite>\n\nThat reminds me, time to go buy _Rosetta Stone Dutch_…\n\n"
    },
    {
      "time": " 24.Sep.2008 5.23am",
      "content": "@sii,  \nWouldn’t you be able to say the same things about the US? :-)\n\n"
    },
    {
      "time": " 24.Sep.2008 6.48am",
      "content": "\\>Wouldn’t you be able to say the same things about the US? :-)\n\n:-) I was - my joke was lost in translation.\n\n"
    },
    {
      "time": " 24.Sep.2008 7.34am",
      "content": "I got it Si and loved it :-) Even those of us who are not the Big Kids in Russia can get your humor :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Sep.2008 7.36am",
      "content": "Oh, and to answer James’s original question, “Yes”.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Sep.2008 12.56pm",
      "content": "I thought the joke/sarcasm was funny, too. Funny and scary. Crazy to think my children will be paying for the crimes of this generation until they die. Crazy, sad, frustrating...but that’s got very little to do with type.\n\n"
    },
    {
      "time": " 25.Sep.2008 12.04am",
      "content": "@sii,  \nUm, I knew that... :-)\n\n"
    },
    {
      "time": " 25.Sep.2008 1.24am",
      "content": "TP’s multiple layers of sarcasm and irony are sometimes even too much for me. ;-)\n\n"
    },
    {
      "time": " 25.Sep.2008 6.58am",
      "content": "That’s funny.\n\n"
    },
    {
      "time": " 25.Sep.2008 12.13pm",
      "content": "\\> TP’s multiple layers of sarcasm and irony  \n\\> are sometimes even too much for me. ;-)\n\nThat’s why I only use 1-ply.\n\nhhp\n\n"
    },
    {
      "time": " 25.Sep.2008 2.39pm",
      "content": "\\>That’s why I only use 1-ply.\n\nWell that’s charmin - you’re clearly on a roll. No chance of you going soft in your old age? ;-)\n\n"
    },
    {
      "time": " 25.Sep.2008 4.50pm",
      "content": "\\> Oh, and to answer James’s original question, “Yes”.\n\nBeg to differ. We only need food, water and shelter. Everything else is elective.\n\npbc\n\nAll ideas, theories and statements are subject to change without notice.\n\n"
    },
    {
      "time": " 25.Sep.2008 6.50pm",
      "content": "Maybe?\n\n"
    },
    {
      "time": " 25.Sep.2008 7.11pm",
      "content": "OK, I’m going to swim against the tide here and offer a serious answer. Every longstanding online “community” goes through ebbs and flows. They aren’t predictable, i.e. foreseeable, but once they’re happening you absolutely can look back at other communities and see that the same thing happened to them.\n\nSo don’t sweat it. Typophile will get its groove back, or whatever, soon enough. These things happen.\n\nAssuming what you are insinuating is happening actually is.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20081201150738/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 26.Sep.2008 9.39pm",
      "content": "I hope Typophile gets its groove back. I haven’t been around much in part because of some nasty pointless flame wars, in part because I’ve branched out to other internet time vortices like Facebook. But at one time this was my hands down favorite site. Something got lost in an upgrade somewhere, no more IMs, whatever. I am happy to see Hrant back tho.\n\nAnd yes, we need Typophile.\n\n"
    },
    {
      "time": " 27.Sep.2008 12.50am",
      "content": "Yes, we need Typophile\n\n...\n\nback.\n\ndr\n\n"
    },
    {
      "time": " 27.Sep.2008 3.30am",
      "content": "” Typophile: Do we need it? “\n\nSure.\n\n"
    },
    {
      "time": " 27.Sep.2008 5.36am",
      "content": "Okay Guys. I am back. And Typophile will be corespondingly better I expect...\n\nJust kidding of course!\n\nNo, but seriously, I am glad it’s here; and I do expect to make use of it this year despite being at Reading etc. In fact I have some new questions fermenting that I hope will properly tap the collective typophilic brain.\n\nJames, for someone like yourself, I imagine Typophile is probably going to be useful only just so often - but it is an “opportunity” to teach. And you have taught me. And I am still grateful. Having been taught I do have the urge to help new folk in the same way.\n\n"
    },
    {
      "time": " 27.Sep.2008 8.29am",
      "content": "I think James may have been a bit facetious in his post. There have been a spate of questions like “Do we need a Florin, J, etc., so this was just a wry extension of that logic. I thought more folks would just see the humor in it and go along with the joke, but...\n\nChrisL\n\n"
    },
    {
      "time": " 27.Sep.2008 11.56am",
      "content": "Eben,\n\nIt was great seeing you here in Brooklyn. I hope your presentation was a hit in St.P. I enjoyed the private showing!\n\nI’m glad you finally got some good food in NYC. Please stay in touch.\n\nYes, I was being facetious. But only very slightly.\n\nSnap out of it!\n\nJames\n\n"
    },
    {
      "time": " 28.Sep.2008 4.30pm",
      "content": "James,\n\nI must have run across the thread in one of my more earnest moments...\n\nThe presentation was pretty well liked from what I could tell. Everybody ( me too ) was pretty exhausted by the end.\n\nIt was great seeing you too. In many ways my private showing & conversations were at least as enlightening or to me as the ones I had in St in St. Petersburg.\n\nSeeing really successful cyrillic designs was eye opening too. That may have been the best part.\n\ncheers!\n\n"
    },
    {
      "time": " 28.Sep.2008 4.31pm",
      "content": "Eben,\n\nAny chance of getting a copy of your presentation?\n\nChrisL\n\n"
    },
    {
      "time": " 29.Sep.2008 4.49am",
      "content": "Of course we really need Typophile. I’m quite certain need it and it would be foolish and short-sighted to write the world’s one and only truly international typo community off on the basis of a transient lull. Worse things happen at sea you know.\n\n@Patty: _I hope Typophile gets its groove back._\n\nI hope so too. I didn’t post my “Top 10 reasons why you should like Typophile” thread for nothing, and I don’t think I was wasting my breath there either. I mentioned the neccessity of having to roll with the punches and stick with it for the long haul.\n\nAs the community’s semantic auditor and civility consultant, I do what I can to keep the place civil and pleasant to be a part of. When I can make it count, I do. But you knew that. At the same time I try to stimulate debate and discussion without rocking the boat or going against the flow too much.\n\n_Miles above your circumstance  \nThere’s water on your mind  \nI’ve wrestled with convictions  \nAnd I’ve settled with the times  \nIt’s more or less uncertainty  \nBut still you play the game  \nA pedicure won’t change the score  \nBut all of this will fade_    \n—words by Scott Weiland\n\nInterpret “all of this will fade” in a good way, in the sense that the lull and not-so-hot times won’t last forever.\n\nLife is a struggle. Typophile doesn’t make the struggle go away—it only makes the struggle more illuminating.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2008 7.08am",
      "content": "Eben,\n\nmy splitting headache somewhat lifted when You spoke in StP. on sunday.  \nNice meeting you,\n\nƒ\n\n"
    },
    {
      "time": " 29.Sep.2008 7.18am",
      "content": "Dare I say we don’t <cite>need</cite> Typophile? Most of us are here because we WANT Typophile; we like Typophile...and that’s a good enough reason for it to be here. My thanks to those people who are responsible for its existence. But <cite>need</cite> it? I don’t think so. Not as much as we need J, C, and X.\n\n"
    },
    {
      "time": " 29.Sep.2008 7.33am",
      "content": "What you are saying makes very little sense. You’re mincing with words dude. Semantic twaddle. How can we not need Typophile if we want it and like it? It sounds like six and one half dozen of the other. Same difference.\n\nUli is here because he hates type and the people who make typefaces.\n\nDo I have to point out that Ray Larabie and I were joking when we posted out threads on J, C and X?\n\nJames Montalbano may also have been having a laff with this thread. Take it all with a grain of salt. Life’s too short for semantic quibbling that sheds no light on the topic at hand.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Sep.2008 1.22pm",
      "content": "All right, James. Sorry for the semantic twaddle. Yes, I knew all of those posts (J, C, and X, and this one) were intended to be light, and I’m only responding to those who got all up in defense of Typophile earlier in this thread.\n\nHere’s the deal...I live out in the middle of nowhere, and among a pretty solid Amish community. What does that have to do with anything? I work on a computer all day, and I use the internet and I check out what’s going on on Typophile a few times every day. To me, it seems like a lot of the problems we face as a culture have a lot to do with people thinking way too much of their importance on this earth, and sometimes that includes me, and it certainly extends into all of our modern day obsessions about this and that, include type design. I stand by what I said. We don’t need Typophile. I think accepting that will help Typophile evolve in a positive way, and that’s why I said it. It’s a public forum and I was trying to helpful. I didn’t say it to give you grief.\n\n"
    },
    {
      "time": " 29.Sep.2008 1.33pm",
      "content": "_Uli is here because he hates type and the people who make typefaces._\n\nWell that explains a hell of a lot.\n\n"
    },
    {
      "time": " 30.Sep.2008 12.43am",
      "content": "Chris, I have contacted you off list.\n\nFredo, likewise! And Happy Birthday!\n\n"
    },
    {
      "time": " 30.Sep.2008 1.17am",
      "content": "_Well that explains a hell of a lot._\n\nJust sayin’, okay? Your response is not helpful and does nothing to move the discussion forward. And you assumed bad faith on my part. If somebody says something you don’t dig, leave it. Just walk away.\n\nKoppa—it’s totally not a problem. Whatever your response happens to be, there’s no harm done. I take it all in good faith unless presented with overwhelming evidence to the contrary.\n\n_To me, it seems like a lot of the problems we face as a culture have a lot to do with people thinking way too much of their importance on this earth, and sometimes that includes me, and it certainly extends into all of our modern day obsessions about this and that, include type design._\n\nMost of typophile’s problems are due to the assumption of bad faith, the predominance of black & white thinking and conception of type design and application, the inability of most of users to recognize and distinguish ad hominem personal attacks when they occurr, and the suppression of freedom of speech by its proprietors and moderators.\n\nNo really guys, I’m not kidding about that one. Uli was right recently when he pointed out Zara Evens’ supression of the name of the crooked font maker who ripped off Ralf Herman’s logo-making font.\n\n_I stand by what I said. We don’t need Typophile._\n\nI don’t believe your view on this is representative of the majority here. And your semantic reasoning does not add up. Answer this: If, as you said earlier, we like and want typophile, how can we not need it?\n\n_I think accepting that will help Typophile evolve in a positive way, and that’s why I said it. It’s a public forum and I was trying to helpful. I didn’t say it to give you grief._\n\nI never assumed you did. You assumed I had assumed bad faith on your part, when I didn’t. Mistake #1. Now, please explain how accepting the notion that we don’t need typophile will help it evolve in a positive way. How is that supposed to facilitate typophile moving forward?\n\nj a m e s\n\n"
    },
    {
      "time": " 30.Sep.2008 1.29am",
      "content": "Koppa, I’ve just re-read my earlier post and I can’t find anything in it that indicates grief over what you said. I have no idea where you got that from. Only thing I can suggest is that you assumed I had assumed bad faith on your part earlier.\n\nDo you get it yet? You’d be much better off making as few assumptions as possible and just giving straight answers. At worst I assumed you didn’t get the joke aspect of the threads Ray and I posted. You then turned that into a grief reaction from me by way of assumption.\n\nGod this conversation is boring. I stress being bored, not being angry.\n\nMaybe if you \\*you\\* don’t need typophile, you could just go away and stop boring the pants off everybody. That’s an ad hominem attack but not one based on assumption of bad faith. It’s practical advice. If you sincerely believe \\*we\\* don’t need typophile, then maybe it’s you who feels he doesn’t need it and should walk away.\n\nDo you get it yet? Learn to follow your own flawed irrational arguments instead of asking intelligent people to swallow them, because they don’t make sense to us.\n\nj a m e s\n\n"
    },
    {
      "time": " 30.Sep.2008 7.33am",
      "content": "Ouch. Uh...how do I fight my way out of this corner? I’m boring you to death, and you and your people are intelligent and I’m not. I feel sort of publicly humiliated, but maybe I deserve it. Or maybe it’s as simple as I just don’t belong with this crowd. Whew.\n\nCan we agree that there is a difference between a want and a need?\n\nUgh. Forget it. I’ll shut up. Sorry for “boring the pants off everybody” (How often has this happened? Yeesh!).\n\nNicely done, James...you’ve made rid of me. Not because I don’t like Typophile, but because I don’t need Typophile. Or, maybe I should be less general...I don’t need you.\n\n"
    },
    {
      "time": " 30.Sep.2008 9.54am",
      "content": "Err folks, step away, take a few shots of tequila, shake hands and change the subject before someone says something that would lock them into an unneeded and unwanted course of action.\n\nAbilene Paradox is a dangerous thing :)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20081201150738/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 30.Sep.2008 1.41pm",
      "content": "<cite>…and the suppression of freedom of speech by its proprietors and moderators. No really guys, I’m not kidding about that one. Uli was right recently when he pointed out Zara Evens’ supression of the name of the crooked font maker who ripped off Ralf Herman’s logo-making font.</cite>\n\nJames, taking this issue out of context and using it in your argument is a little unfair and I want to make something clear. There are circumstances around the choices we make as moderators (and Typophile as an organization) that the community as a whole is not always made aware of, and it is our right to withhold that information because it may concern the privacy of our users. We are trying to be as fair as possible to all parties, all members of our community, regardless of what a small handful of people with loud voices may be saying about their business practice, religious beliefs or favorite cheeses.\n\nI try not to let my personal opinions about these matters interfere with decisions that need to be made on behalf of Typophile the community, and Typophile the organization. If we started moderating based on our own biases and on how we feel about people in these forums, I’d have deleted your account and a few others\\*, long ago. But that isn’t how we do things around here, oh wise civility consultant.\n\n\\*My comments do not represent the general views of Typophile\n\n"
    },
    {
      "time": " 30.Sep.2008 2.22pm",
      "content": "<cite>I do what I can to keep the place civil and pleasant to be a part of</cite>\n\nThat actually made me laugh out loud!\n\n"
    }
  ]
}
