{
  "id": "4982",
  "title": "Lucia",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hello fellows,   \n   \nthere is another theater (opera actually) poster i am working on. It is the opera \"Lucia di Lammermoor\" by Gaetano Donizetti.   \n   \nThe story (in a very shoet brief) is about the forbidden love (what else?) between two young aristocrates Edgardo and Lucia. Their families are deadly enemies, so Lucia's brother Enrico and leader of the family tricks Lucia into believing Edgardo unfaithful. Enrico insists Lucia to marry Lord Arturo Bucklaw. Edgardo disrupts the wedding and curses Lucia. After a lot of tragic events Lucia starts getting mad and she is \"abadoning\" herself in a way. Her personality is DECONSTRUCTED day by day. At the climax of this proceedure she kills Arturo on their wedning night. This deconstruction of herself leads her to death as the paranoia and her sorrow destroyed her will for life.   \n   \nSo, that's the story and below are the proposals. I am looking forward for comments.   \n   \nHave a nice day, christos.   \n   \n ![a](http://web.archive.org/web/20131108090108im_/http:/www.typophile.com/forums/messages/29/37008.gif)   \n ![b](http://web.archive.org/web/20131108090108im_/http:/www.typophile.com/forums/messages/29/37009.gif)   \n ![c](http://web.archive.org/web/20131108090108im_/http:/www.typophile.com/forums/messages/29/37010.gif)   \n ![d](http://web.archive.org/web/20131108090108im_/http:/www.typophile.com/forums/messages/29/37011.gif)\n\n",
  "author": "tsoler",
  "time": "28 May 2004 — 9:48am",
  "uid": "1058",
  "comments": [
    {
      "time": "28 May 2004 — 10:22am",
      "content": "I like the A series and D. I find the \"blood tear\" in B far too disturbing. C looks like somebody tore down the poster, and it was taped together.   \n   \nFor D, the tiara (or whatever it is) is interfering with the legibility of the _Megaro_ line. (And the spacing between the A and the R looks off, probably because of the background color).\n\n"
    },
    {
      "time": "28 May 2004 — 10:31am",
      "content": "personally i wouldn't use meta (for d). i think meta has the attitude of a corporate typeface. i'd say that doesn't fit to an opera.   \n   \nbesides it is much too often used ...\n\n"
    },
    {
      "time": "28 May 2004 — 10:40am",
      "content": "i like b2, c1, c4 as posters i want to meet at the streets.. and i love d becouse its very close to images and colours in my head after i've read your description of the opera.. not sure in type choise at \"Lucia\", but i think it's the best one..   \n   \nt80.\n\n"
    },
    {
      "time": "28 May 2004 — 2:32pm",
      "content": "The great Greek strikes again! Really nice stuff. Each one is a winner to me.   \nBut my fav has got to be A1.   \nAnd ditto about Meta.   \n   \nhhp\n\n"
    },
    {
      "time": "28 May 2004 — 3:09pm",
      "content": "Endaxy!   \n   \nI vote for C1 but perhaps without the texture of the torn paper. Did you try it as just line art?   \n   \nBy the way, what is the beautiful Greek font which says \"7 parastaseis\" ? Is that one yours? Polly kathera.   \n   \nChrisL\n\n"
    },
    {
      "time": "28 May 2004 — 3:42pm",
      "content": "Definitely A1 for me. It's crisp and clean and fresh and anyway, I'm a sucker for Art Nouveau...\n\n"
    },
    {
      "time": "1 Jun 2004 — 2:37am",
      "content": "Good morning and thank you all for the interest.   \n   \nAbout the C series: i tried to give the braking down of Lucia by tearing a copy i printed on Lazer. I agree that it doesn't work too well and i shall try to give the image just in lineart.   \n   \nAs for the Meta i use in pro D (all text is set in Meta -converted in greek by Cannibal Fonts) to me it works well (...\"De gustibus...\"). I know that when you think about opera a sans type wouldn't be the first thing comming to mind, but first i wanted to avoid this clich\n\n"
    },
    {
      "time": "1 Jun 2004 — 5:01am",
      "content": "Again, great stuff Christos!   \nI also like A1.   \n   \nD1:   \nHrant is saying he also thinks Meta has too much business   \nfeeling for opera. I agree, but i think only Lucia di Lammermoor   \nneeds to change. Maybe a script? Perhaps sliced down the   \nmiddle and shifted slightly?   \n   \nR\n\n"
    },
    {
      "time": "1 Jun 2004 — 8:57am",
      "content": "Hello again   \n   \nmy three \"I\"ies (not lies) are:   \n   \n-I \"poured some water in my wine\" (as ancient greeks were) and tried another font (FF Bodoni) for \"Lucia\".   \n   \n-I \"corrected' the positioning a little (still the text is \"blind\").   \n   \n-I put the title of the Concert Hall (Megaro Mousikis Thessalonikis) in a black box   \nprotecting the need for clarity (this is the client) and giving an extra support to the conceivable vertical line of the composition.   \n   \nThanks again for the support   \nAu revoir, christos   \n   \n ![newD](http://web.archive.org/web/20131108090108im_/http:/www.typophile.com/forums/messages/29/37217.gif)\n\n"
    },
    {
      "time": "1 Jun 2004 — 10:41am",
      "content": "\"Ditto\" [usually] means \"the same as what the previous guy said\".   \n   \nBTW, I'll be at the conference Saturday and Monday at least.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2004 — 4:21pm",
      "content": "Christos,   \nThere is no bigger Opera lover on Earth than me. I applaud your use of a sans serif on an Opera poster. I see no reason to exclude sans serifs just because it is not typically done. We need not continue a clich\n\n"
    },
    {
      "time": "2 Jun 2004 — 1:29am",
      "content": "...you are right Chris. On the other hand just \"breaking the law\" doesn't necessary means good design.   \n   \nAfter all, now i think my last efort is the most suxessfull even that i use a \"clich\n\n"
    },
    {
      "time": "2 Jun 2004 — 2:18am",
      "content": "### Formatting Error\nThe formatting code **png\\_alreadyuploaded\\_t** does not exist or cannot be used in this context. \n"
    },
    {
      "time": "2 Jun 2004 — 2:17pm",
      "content": "Christos,   \nMy name is Greek. Both sets of my grandparents came to the US from Greece about the time of the 1st World War.   \nMy full name is:   \nChristos Evangelos Lozos. My father's family is from Levadia and my mother's family is from Kranidy.   \n   \nI didn't mean to imply that \"braking the law\" was enough to be good design. I only meant that you should not \"uphold the law\" just because many other people have in the past. Either direction requires design skill\n\n"
    },
    {
      "time": "22 Jun 2004 — 3:47am",
      "content": "Hello again   \n   \nsorry for the delayed news but it seems that the clent was not in a hurry. Still they didn't make up their mind but they seem to go for C series (not my favorite). The only thing that i am afraid of now is how much they are going to destroy the poster (lots of names, bigger titles/logos...you know).   \n   \ngood day to all, christos   \n   \nP.S. chris: my name is christos and my brother's name is Evangelos. If you ever come to greece let me know.\n\n"
    },
    {
      "time": "22 Jun 2004 — 6:06pm",
      "content": "Yasou Xristos,   \nI see clients in Greece are the same as they are here. The \"Make it Bigger!\" cry is universal (ask Paula Scher).   \n   \n\\>chris: my name is christos and my brother's name is Evangelos. If you ever come to greece let me know.\\<   \n   \nI certainly will. If you visit America, let me know as well.   \n   \nChrisL\n\n"
    },
    {
      "time": "23 Jun 2004 — 3:02am",
      "content": "Quoting Steve Peter:   \n   \n\"I find the \"blood tear\" in B far too disturbing.\".   \n   \nAs far as I understand, this is an opera poster. It's not intended to deprave young teenagers with taste of Marilyn Manson & Rammstein. I think the target audience will understand the \"blood\" metaphor. Or maybe I'm just not an American.\n\n"
    },
    {
      "time": "23 Jun 2004 — 9:51am",
      "content": "Agree with Ivan. Blood has it's appropriate place, in sample above it is used tastefully. I would however (being overly critical) move the blood tears a bit right so it is not as symetrical.   \n   \nPaths are a bit harsh and may look better if softened. Reversed face (only showing nose) facing right is a bit much, and should be reworked a bit to draw less attention. Idea is clever enough   \nbut subtlety goes a long way.   \n   \noverall the work is exceptional. ![](http://web.archive.org/web/20131108090108im_/http:/www.typophile.com/forums/messages/29/39048.gif)\n\n"
    },
    {
      "time": "23 Jun 2004 — 10:52am",
      "content": "A1, A3, or D (your favorite, Christos). I agree with Chris L., sans serif is not a problem. I also agree with\n\n"
    },
    {
      "time": "30 Jun 2004 — 1:28am",
      "content": "Ole: your eye is a killer. I couldn't get more precise (and so correct to my opinion) comments.   \nThank you for the help.   \n   \nThe only problem is that the client (unfortunately) chose the C series.   \nIt's always this fear that the client will chose   \none of the solutions you don't believe much in   \nbut you are \"obliged\" to have as an alternative.   \n   \nThank you all for the help.   \nWhen the final poster is ready i will post again.   \n   \nGood day to you all, christos\n\n"
    },
    {
      "time": "26 Jul 2004 — 3:38am",
      "content": "...and that's the conclusion, after additions, beggings for \"make it larger\" and arguments.   \n   \nI know, i know, but really i am too tired to argue anymore. After all, this is their image of promotion. They deserve it (actually much less)...   \n   \nbittered, christos   \n   \n ![finalPOSTER](http://web.archive.org/web/20131108090108im_/http:/www.typophile.com/forums/messages/29/41411.jpg)\n\n"
    },
    {
      "time": "26 Jul 2004 — 10:50am",
      "content": "Christos, this is beautiful and I think addresses many of the earlier comments. I would love a high-res PDF of this to print on my plotter here - I hope it is not rude to ask.\n\n"
    },
    {
      "time": "27 Jul 2004 — 8:04am",
      "content": "Joshua thank you for the comforting words.   \nNo problem to send you the poster, but if it is   \nto have it on your wall, why to have   \nall those sponsors on the poster? Just choose one   \n(even the latest) and i can send it to you clear   \nof useless information (only tell me the size/resolution   \nand the limitation of the file size).   \n   \nchristos\n\n"
    },
    {
      "time": "27 Jul 2004 — 8:36pm",
      "content": "I don't comment on your work, Christos, because I am just awstruck by its artistry. I'm sure that many other typophiles like me just love to see your new work as you post it here. Keep up the great work!\n\n"
    },
    {
      "time": "29 Jul 2004 — 2:42am",
      "content": "Thank you all for the good words. It keeps my spirit up. This was another exhausting year and finaly Sunday i will have my vocations. I will try to keep my mind off the work (as it concerns the bussines part of course and not the design part). Hope to come back from France with interesting street pictures (i will post anything looks great).   \n   \nFor me the working year is closing now and i feel a pause is vital to my (mainly mental) health.   \n   \nWish you all have your own pause-time in the right time and place.   \n   \ncheers, christos\n\n"
    },
    {
      "time": "14 Aug 2004 — 4:23am",
      "content": "out standing work mate ![:-)](http://web.archive.org/web/20131108090108im_/http:/www.typophile.com/forums/clipart/happy.gif) i think that final version is dope\n\n"
    },
    {
      "time": "2 Sep 2004 — 8:12am",
      "content": "I love the final product!   \n   \nHowever, I am confused as to why you would submit to them versions which you thought were your least favourite.   \n   \nOnly being a student at the moment, with one more year to go, I am trying to get my head around what you do and do not show to a client.   \n   \nRegardless, the final product is inspirational. Great stuff. Opera fan or not!\n\n"
    },
    {
      "time": "3 Sep 2004 — 3:09am",
      "content": "Hello kumbuniko   \n   \nyou are right to be curious about this.   \nI don't know how it works generaly but i will try to describe how it works with me:   \n   \nBeing a professional -meaning that you make a living out of your work- makes you trying to sell your work. On this process a basic tool is to give a client the bigest variety of options you can. Of course this doesn't mean to show something you dislike only to have something more. But even if you have 2 things you like you can't like them equal.   \n   \nThere is a point when you stop creating and act as a viewer even in your own piece, and then you are as subjective are the rest viewers. There were times that i didn't like works of mine that have been chosen, but after an explanation of those who chose them i started liking them.   \n   \nThe thing is that even the creator sometimes cannot comprehence completely his work and a \"stranger\" can see more. So i believe is better to show also the work you \"don't believe\" so much, keeping always of course you quality line on a decent level.   \n   \nHope i was understood (i am not so fluent in english as you can see).   \n   \nHave a nice day, christos\n\n"
    },
    {
      "time": "16 Oct 2004 — 3:28pm",
      "content": "great work, superb, truly inspirational. keep it up. Cheers!\n\n"
    }
  ]
}
