{
  "id": "49832",
  "title": "Does Indesign CS4 support Indic scripts?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Well, is Adobe finally getting it together with Indic scripts in CS4?\n\n—D.\n\n",
  "author": "Devadaru",
  "time": "24 Sep 2008 — 7:22pm",
  "uid": "28821",
  "comments": [
    {
      "time": "25 Sep 2008 — 8:14am",
      "content": "I cannot tell about InDesign CS4's Indic capabilities but I have heard that SIL ( [http://www.sil.org](http://web.archive.org/web/20150104012133/http:/www.sil.org/ \"http://www.sil.org\") ) developed a plugin for InDesign CS3 for Windows that uses the Microsoft Uniscribe library, which should give users of InDesign the ability to typeset using any complex script that Microsoft Windows supports. I am not sure about the public availability of the SIL plugin, though.\n\nAdam\n\n"
    },
    {
      "time": "25 Sep 2008 — 11:10am",
      "content": "Officially? No.\n\nUnofficially? Yes.\n\nConfused? Watch Typophile and/or my blog for more details, Real Soon Now.\n\nT\n\n"
    },
    {
      "time": "26 Sep 2008 — 12:19pm",
      "content": "You can probably tell from Thomas' comments that we're trying to figure out the best way to describe the support for what we're calling \"complex scripts\" in InDesign CS4. We spent a lot of effort integrating the glyph layout engine that is in the ME version of InDesign into the mainline product. The goal was to allow documents that were created in InDesign ME to be opened, viewed, printed, and edited in the non-ME version. We did not have time to figure out a user interface or to do as much testing of this separate engine as we would like. We consider it \"beta\" and we'll continue to improve this area as we move forward. That said, you can use scripting or template-style documents to access features for the correct composition of Arabic, Hebrew, Tamil, Devanagari, Thai, Lao, and more. Full cross-platform support of these writing script at the level we and our users demand is going to take more than one release. We're excited about the functionality that is under the hood and hope that this first step will allow our more cutting-edge users to do high-end design with these scripts.  \neric\n\n"
    },
    {
      "time": "26 Sep 2008 — 1:49pm",
      "content": "Once we've figured out how to roll this \"beta-but-useful\" functionality out, you'll see more posted. We're still debating how to do that.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "26 Sep 2008 — 4:48pm",
      "content": "_Once we’ve figured out how to roll this “beta-but-useful” functionality out..._\n\nHow about a set of complex script template files for download?\n\nI suspect the most obvious UI deficiency will be right-to-left text controls for Hebrew, Arabic, etc. Being able to set paragraph directionality is pretty critical for working with RTL scripts. A lot of other complex script support doesn't really need much dedicated UI, since so much is handled via input, layout engine and character properties.\n\n"
    },
    {
      "time": "26 Sep 2008 — 4:55pm",
      "content": "Certainly somebody will make some template files. The question is whether they go on Adobe Labs, on my blog, or we just let some third party make and distribute them.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "7 Oct 2008 — 5:28am",
      "content": "So the goal is a single version of ID that supports all scripts? Can I ask how that tallies with your policy up to now of having to buy a Chinese Japanese or Korean version to be able to access features specific to those languages?\n\n"
    },
    {
      "time": "9 Oct 2008 — 5:26pm",
      "content": "The goal is that every version of InDesign should be able to set type in every writing system is different from the goal that every version of InDesign should offer full typographic support for every writing system.\n\nThe English and Middle East versions of InDesign allow you to do basic typesetting for East Asian (CJK) languages, but only the East Asian version gives you access to the full set of typographic features specific for those languages.\n\nBut until now, the English and the East Asian version of InDesign did not at all allow setting Arabic or Hebrew. I think Adobe is now changing that, but I'm not sure if their goal is to completely unify all the editions, including the advanced typographic features.\n\nIt is possible that they fear that this would make the user interface overly complex. (I imagine putting the East Asian, Middle East, Indic and European typographic controls would result in some serious complexity).\n\nA.\n\n"
    },
    {
      "time": "15 Oct 2008 — 9:02am",
      "content": "Is the Indic plugin referred to above the same as the MetaDesign one at [http://www.metadesignsolutions.com/IndicPlus.html](http://web.archive.org/web/20150104012133/http:/www.metadesignsolutions.com/IndicPlus.html \"http://www.metadesignsolutions.com/IndicPlus.html\") ?\n\nSeems to be Windows-only, but CS2 and CS3 for many Indian languages. Anyone tried this?\n\n"
    },
    {
      "time": "15 Oct 2008 — 9:33am",
      "content": "indic plus looks 'interesting', but it seems not to do what it says it does. the site claims proper matra placement, but their images show imporperly placed reph characters in relation to ka. it seems that this plugin is performing glyph reordering and replacement, but not mark placement. but i can't be sure as i haven't actually tried this out...\n\n"
    },
    {
      "time": "17 Oct 2008 — 12:11pm",
      "content": "Yes, IndicPlus is Windows only. They said they may do a Mac version if there's demand for it. I did ask them if it supported mark placement and they were a bit vague. I will check it (you can check yourself with the demo if you have Windows ID). But most of the Unicode Indic fonts I have seen don't use GPOS mark features anyway, just GSUB replacements.\n\n"
    },
    {
      "time": "18 Oct 2008 — 6:48am",
      "content": "Hello Everyone,\n\nI Myself represent MetaDesign Solutions, doing development of IndicPlus and other InDesign Solutions.  \nUsing Typohile as medium, Firstly I would like to convey my thanks to all our IndicPlus Customers for the great response and feedback to this product.\n\nImages on our website was using an ancient version of IndicPlus which had issue with placement of reph characters and other conjunctions. In our latest demo release which is freely available on web we support reph characters and also features such as below base mark and above base mark.\n\nURL’s for demo version\n\nWindows InDesign CS3 : [http://www.metadesignsolutions.com/trial/IndicPlus Installer CS3.exe](http://web.archive.org/web/20150104012133/http:/www.metadesignsolutions.com/trial/IndicPlus%20Installer%20CS3.exe)  \nWindows InDesign CS2 : [http://www.metadesignsolutions.com/trial/IndicPlus Installer CS2.exe](http://web.archive.org/web/20150104012133/http:/www.metadesignsolutions.com/trial/IndicPlus%20Installer%20CS2.exe)\n\nIndicPlus Product manual\n\nPdf : [http://metadesignsolutions.com/manuals/IndicPlusManual.pdf](http://web.archive.org/web/20150104012133/http:/metadesignsolutions.com/manuals/IndicPlusManual.pdf)\n\nProduct Page\n\n[http://metadesignsolutions.com/IndicPlus.html](http://web.archive.org/web/20150104012133/http:/metadesignsolutions.com/IndicPlus.html)\n\nFor feedback or more information please drop me an email at [sales@metadesignsolutions.com](mailto:sales@metadesignsolutions.com)\n\nThanks  \nAmit Gupta  \nMetaDesign Solutions\n\n"
    },
    {
      "time": "18 Nov 2008 — 1:37am",
      "content": "Well it's been two months and I still don't see any posts and/or blogs about Indic support in InDesign CS4. I mean does unicode Hindi, Bangla work at all in InDesign CS4 (officially or unofficially)??\n\n"
    },
    {
      "time": "18 Nov 2008 — 11:58am",
      "content": "You'd need to first open an InDesign ME document to end up with text that has the World Ready Composer \"on.\" Then you could give it a try. It is still very much \"pre-release quality\" but there is a fair bit of functionality there.\n\nInDesign CS4 ME will have similar functionality, btw. If you also need Arabic or Hebrew support, you should wait for that.\n\nT\n\n"
    },
    {
      "time": "18 Nov 2008 — 3:26pm",
      "content": "So at that point you can paste in some Unicode \"indic\" text from the Web and it should shape? Which scripts might we try?\n\n"
    },
    {
      "time": "19 Nov 2008 — 12:01am",
      "content": "You'd need an appropriate typeface as well, but sure, give it a try.\n\nVery much pre-release functionality, swim here at your own risk, no support available, etc.\n\nT\n\n"
    },
    {
      "time": "21 Nov 2008 — 8:04am",
      "content": "Well, I downloaded CS4 trial, added a script found on the Swiss InDesign forum \"hilfdirselbst\" at  \n [http://www.hilfdirselbst.ch/gforum/gforum.cgi?post=373891](http://web.archive.org/web/20150104012133/http:/www.hilfdirselbst.ch/gforum/gforum.cgi?post=373891) to enable the World-Ready paragraph composer, and had an experiment with some Unicode UTF8 text copied from the BBC Hindi website.  \nJust to double-check, I viewed the same web page via Safari on OS X 10.4 and via Firefox on Windows XP, and used both those renderings to check against the same text in CS4.  \nResult: The World-Ready paragraphs certainly join the Hindi/Devanagari letters much better, and in the same order as the text rendering via the browsers.  \nOddly, the results were better when I switched from the OS X 10.4 font Devanagari MT to the downloaded font Mangal.\n\nProbably needs someone with a better understanding of the language to be 100% sure, but to  \nthis amateur, it looks OK so far.  \nNow for some experiments with other Indian languages...\n\n"
    },
    {
      "time": "21 Nov 2008 — 10:44am",
      "content": "Chris, is the OS X Devanagari font an OpenType font or an AAT font? If it is an Apple system font, it probably contains AAT tables instead of OpenType tables. In that case, you would expect the World-Ready composer to correctly re-order Devanagari characters, but you wouldn't get all the refinements of conjunct forms, accurate mark positioning, etc. that rely on the OT GSUB and GPOS tables. Mangal is an OT font, so will perform better.\n\n"
    },
    {
      "time": "21 Nov 2008 — 11:28am",
      "content": "The Devanagari bundled with Mac OS X is Monotype Devanagari (Devanagari MT). This is an AAT-font, not an OpenType font. And Mangal is not just \\*any\\* downloaded font, but the Devanagari system font for Windows (and is an OpenType font, as John mentions above).\n\n"
    },
    {
      "time": "21 Nov 2008 — 5:10pm",
      "content": "Yup.\n\n"
    },
    {
      "time": "25 Nov 2008 — 9:52am",
      "content": "Thanks to John Hudson and Dan Reynolds.  \nThat makes perfect sense. The mark positioning was \"markedly\" improved with Mangal. Very promising.\n\n"
    },
    {
      "time": "19 Dec 2008 — 12:51am",
      "content": "Well here's a third part solution for RtL functionality in Indesign CS4... ;)\n\n[http://www.in-tools.com/plugin.php?p=8](http://web.archive.org/web/20150104012133/http:/www.in-tools.com/plugin.php?p=8 \"http://www.in-tools.com/plugin.php?p=8\")\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:40am",
      "content": "Today, I typeset a Hindi novel in InDesign CS4 Middle East edition. In the ME version, the World Ready text composer is available by default (since it is used for Arabic and Hebrew), so this version is easy to use for Devanagari. There is no Hindi dictionary support yet, and no hyphenation module, so one has to be careful to get good results and be prepared for some manual editing, but overall the World Ready composer seems to do a grand job with Devanagari OpenType fonts.\n\n"
    },
    {
      "time": "20 Jan 2009 — 9:19am",
      "content": "Thomas has posted information about the Adobe World Ready Composer on his new blog:\n\n[http://tphinney.wordpress.com/2009/01/19/adobes-world-ready-composer/](http://web.archive.org/web/20150104012133/http:/tphinney.wordpress.com/2009/01/19/adobes-world-ready-composer/ \"http://tphinney.wordpress.com/2009/01/19/adobes-world-ready-composer/\")\n\nalong with links to scripts and templates that can be used to activate the new composer in the standard version of ID CS4.\n\n"
    },
    {
      "time": "20 Jan 2009 — 9:31am",
      "content": "Oops, I don't know what went awry there, but that post wasn't supposed to be live quite yet, and that is a very early draft with just a fraction of the content I have written.\n\nWhy the real version is not up:\n\n1) The scripts and templates aren't there yet. The scripts are almost all done, the templates still in progress.\n\n2) I'm migrating to a different URL, [http://www.thomasphinney.com](http://web.archive.org/web/20150104012133/http:/www.thomasphinney.com/ \"http://www.thomasphinney.com\").\n\nI should have something up in a week or so, and will post a note here when it is there.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:51pm",
      "content": "[http://www.thomasphinney.com/2009/01/adobe-world-ready-composer/](http://web.archive.org/web/20150104012133/http:/www.thomasphinney.com/2009/01/adobe-world-ready-composer/ \"http://www.thomasphinney.com/2009/01/adobe-world-ready-composer/\")\n\nVery nice writeup, Thomas. Thank you for documenting all of this, it's very informative and I can see this being useful for those interested in typesetting exotic scripts using Adobe products.\n\n"
    },
    {
      "time": "28 Jan 2009 — 1:01am",
      "content": "Exotic scripts. Like the Arabic language with with Arabic script. Or Indic languages with Indic script. Don't forget the Chinese language with Chinese script. What about the Aztec language with Aztec script. And, don't forget, the Egyptian language with Egyptian script. Good point.\n\nWhy not make English exotic, too? Let's concentrate all design efforts on creating a proper English script for the English language. It's way overdue to get rid of the totally obsolete, millennia old, and outmoded and out-of-place complex Latin letters which are continually causing endless ridiculous spelling problems all over Yurp.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150104012133/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    },
    {
      "time": "28 Jan 2009 — 6:41am",
      "content": "[http://www.exoticmotorcars.com/](http://web.archive.org/web/20150104012133/http:/www.exoticmotorcars.com/ \"http://www.exoticmotorcars.com/\")\n\n"
    },
    {
      "time": "29 Jan 2009 — 2:39pm",
      "content": "Note that my article ( [http://www.thomasphinney.com/2009/01/adobe-world-ready-composer/](http://web.archive.org/web/20150104012133/http:/www.thomasphinney.com/2009/01/adobe-world-ready-composer/ \"http://www.thomasphinney.com/2009/01/adobe-world-ready-composer/\")) contains several things not yet seen elsewhere:\n\n- template documents for Photoshop, Illustrator and InDesign  \n- new InDesign scripts (thanks to Peter Kahrel)  \n- complete list of writing systems enabled by the World-Ready Composer (and the degree of testing)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "1 Feb 2009 — 5:55am",
      "content": "Thank you, thank you.\n\nWithout world-ready composer:\n\n ![](http://web.archive.org/web/20150104012133im_/http:/typophile.com/files/Varnanam_no_wc_5837.png)\n\nWith world-ready composer:\n\n ![](http://web.archive.org/web/20150104012133im_/http:/typophile.com/files/Varnanam_with_wc_4765.png)\n\ncompare: same verse in Wordpad (MS):\n\n ![](http://web.archive.org/web/20150104012133im_/http:/typophile.com/files/Varnanam_MS_wordpad_5470.png)\n\n(This is a Sanskrit Verse, set in Sanskrit 2003 from Omkarananda Ashrama)\n\nSo far looks great.\n\n--D\n\n"
    },
    {
      "time": "27 Jun 2009 — 1:56am",
      "content": "All,\n\nI have been following up some of the threads on Typhophile for long. especially the ones with information on Support for Indic Scripts. Information on this site is probably the best available and helps people like me to figure out the best solution :). I am an artist by nature and profession. To make my piece of contribution, I would like to share some information on IndicPlus Plug-in, which I found missing on this forum. The company which owns IndicPlus have slashed there prices for CS2 and CS3 version and they are selling there CS4 version at a special introductory price of 25 USD. Apart from standard world ready features, they have additional support for Numbering Styles in all Indian Languages and few others.\n\n[http://metadesignsolutions.com/IndicPlus.html](http://web.archive.org/web/20150104012133/http:/metadesignsolutions.com/IndicPlus.html)\n\nCheers  \n~ Mike\n\n"
    },
    {
      "time": "5 Nov 2009 — 11:01pm",
      "content": "Hello Guys  \nI have been working on Adobe Indesign CS2/CS3 from so many years and was so frustrated by it's minimum support for Indian Languages.I intalled IndiPlus And SpellPlus Plugin provided by Metadesign Solutions. Indicplus Plug-in is capable to render complex scripts (Indian Languages and others) without error using Unicode fonts. This is the first plugin which supports typing in both Indian and Other languages using complex script in Indesign.  \nSpellPlus delivers the much needed spell check feature to Adobe Indesign in various Indian languages including Hindi, Tamil and Bengali etc. SpellPlus enhances the potential of Indesign by augmenting the language and spelling options available to the user It just saved me. Site:\n\n[http://www.metadesignsolutions.com/index-3.html](http://web.archive.org/web/20150104012133/http:/www.metadesignsolutions.com/index-3.html \"http://www.metadesignsolutions.com/index-3.html\")\n\nNever had any problems with it. Awesome tool for Indian Languages. Has one tool for Adobe Indesign CS4 also. I will highly recommend it.  \nCheers  \nSA\n\n"
    }
  ]
}
