{
  "id": "49846",
  "title": "Building a concept for \"wellsense\" public health consultants",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I usually approach this forum with a design that I like and then I put it out there for people to confirm I'm on the right track... which I never am! So this time I want to do things differently, I want to talk to the forum right from the conceptual stage so that my mind is open.\n\nWellsense is a company that is being set up in Africa and it is currently two women who are medical doctors. They are academic and hands-on.\n\nThe idea is that they are setting up a company which offers consultancy, be it to medical research institutes or to clinics and hospitals.\n\nThey said they wanted the identity to be unmistakably African and they mentioned red earth tones. They also did me a huge service in fishing out some Egyptian symbols which mean things like wisdom, medicine, enlightenment, etc. All the stuff they believe they stand for.\n\nI am brain storming and using pen and paper only (I used to dive straight into Illustrator).\n\nI don't want to put images up straight away because this limits creativity so I just wanted to explain what I have so far and then see if anyone is kind enough to throw in other suggestions.\n\nSo far what I have is the word wellsense with no space between well and sense, all lower case, although maybe WellSense might work too. I then have picked an Egyptian symbol which means \"wise medicine man\" apparently! It's quite neat, it looks a little like the old Umbro logo. It is a diamond \\<\\> shape with another diamond shape inside and then a small dot inside that, so it's like an eye, but angular. I wanted to have that in the background and slightly above the text. So you'd have this diamond \\<\\> shape and then infront you'd have wellsense written in something like the facebook logo font, or the [eachday logo](http://web.archive.org/web/20131020055824/http:/blog.eachday.com/2007/8/1/bubble-logo-insanity) font, (it's sans serif and rounded, but sort of square at the same time, I like it. OR the other option is something murcurius which is quite interesting. It sometimes looks like it belongs on a cosmetics label but somehow it might work for wellsense. The text or background can be earthy tones, like I was thinking a reddy brown, then an ochre colour somewhere for contrast and then maybe throw in some bright blue somewhere, be it in the logo or elsewhere like as a motif that is present in their brochures, website, business cards, etc.\n\nA question I have is, you know how certain fonts have certain histories and applications, for instance Times is a newspaper font, verdana is a nasty screen font, arial is from the same family as helvetica but created for Microsoft, etc. (I hope I have my history correct there!) anyway, what I'm saying is can anyone tell me what murcurius was created for, or fonts like it? The reason I ask is lets say it's common knowledge to some people that it was created for branding an ice cream company, then it's hardly suitable for a health consultancy.\n\nSorry for the essay but can anyone help me out be adding to this discussion, I really want to give this client something good. It should be professional looking but still engaging and maybe even quite daring. They will be operating in the same town as a Wellcome Trust partner and so we don't want something that looks professional but dry like [Wellcome Trust's Helvetica](http://web.archive.org/web/20131020055824/http:/typophile.com/wiki/www.wellcome.ac.uk) logo.\n\n",
  "author": "paulsschwarz",
  "time": "25 Sep 2008 — 3:06am",
  "uid": "23484",
  "comments": [
    {
      "time": "25 Sep 2008 — 3:45am",
      "content": "You don't need to double post regarding the typeface. Maybe [Klavika](http://web.archive.org/web/20131020055824/http:/www.processtypefoundry.com/typefaces/klavika/index.html) could suit your needs? I'm personally a bit tired of all those mixed case and lower case one word logos out there, and with your clients you'd probably want to stear away from the Web 2.0 look.  \nThe symbol sounds very interesting!\n\n"
    },
    {
      "time": "25 Sep 2008 — 4:02am",
      "content": "So you would suggest splitting it into two words?\n\nWell Sense\n\nI hear you on the web 2.0 look.\n\nHave you managed to take a look at Mercurius? I have no idea what the history of this font is so not sure whether to consider it but it takes the logo away from the web 2.0 thing a bit since it is most certainly not a screen font. What I am trying to achieve is a mark where the icon suits the font and the font suits the icon. I'm probably quite guilty in the past of coming up with an icon and then slapping some text beside it. I'm trying to get them both to talk to each other.\n\n"
    },
    {
      "time": "25 Sep 2008 — 8:22am",
      "content": "I'm looking forward to seeing your designs. My only concern is that the organization was formed by two women and the symbol you have chosen is \"wise medicine man\". Is the design going to be used primarily in Africa? or will it be on material that will be sent elsewhere? Knowing how it will be used should help you make your typographic choices.\n\n"
    },
    {
      "time": "25 Sep 2008 — 2:29pm",
      "content": "As far as I know they will be providing consultancy locally in East Africa. Some of their documents might make it back to the UK but the majority of their stationery is intended for use locally. I will put some time into getting samples together over the weekend and I'll look forward to some critique then!\n\n"
    },
    {
      "time": "28 Sep 2008 — 8:52am",
      "content": "I had some time over the weekend to prepare some samples. All these samples stem from the same concept, so I'd like to know what people think of the concept but also if anyone else can throw me a bone for other concepts that spring to mind for them.\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/logo-1_4390.0.gif)\n\n"
    },
    {
      "time": "28 Sep 2008 — 9:12am",
      "content": "And here's something slightly different whilst still on the theme of Africa symbols and red earth tones.\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/logo-2_5030.0.gif)\n  \nLooking forward to some critique. \n"
    },
    {
      "time": "29 Sep 2008 — 10:12am",
      "content": "Hi Paul  \nFor me, the square sans doesn't convey Africa so well as the cursive font. I think it also fights with the diamond shape, whilst the cursive characters contrast nicely with the lines in the diamond.  \nThe reddy colours are more interesting so my favourite is the bottom left design.  \nThe circular one below is also interesting, but looks more corporate (a bit sterile?) and less 'local'.  \nHope that helps! :)\n\n"
    },
    {
      "time": "29 Sep 2008 — 10:44am",
      "content": "Thanks, that does help. The circle was a pun thought out by the client, it is an Egyptian symbol of a well, meaning the source (of anything, prosperity, knowledge, etc). I think the diamond is far more appropriate, meaning \"the eye of the medicine man\" or wisdom.\n\nBear in mind I will tidy up the diamond shape a bit, right now it's a rough trace of a pencil drawing but came out very Illustrator-ish. I'll adjust it by hand later.\n\nI was sold on the square sans font but your comment has almost totally convinced me. Do others like the curvy font? Does it say \"health consultancy run by two highly academic female doctors\"???\n\nThanks\n\n"
    },
    {
      "time": "29 Sep 2008 — 11:22am",
      "content": "I'm not wild for either font choice. The stroke weight of the letters and the stroke weight of the eye drawing are essentially the same. There's no real contrast. Also if you are going to run the two words together you need to differentiate them by color (like on the circle sample) or by one in all caps, or by using different weights, or different fonts. The two right side versions read as wellsense not well sense.\n\nThe logo is going to be used to help market the service of these two women to medical facilities yes? Sort of a B-to-B of doctors rather than trying to appeal to the average joe/jane. Then you might want to take a clean, crisp approach to the type rather than trying to capture a local African flavor. I'm sure there are several typefaces that would be a happy melding of the two but off the top of my head I can't make any suggestions.\n\n"
    },
    {
      "time": "29 Sep 2008 — 11:40am",
      "content": "Thanks Kirsten.\n\nThis client is somewhat unusual!\n\n1. They are quite keen to be known as WellSense (all one word) but I agree with frode frank who earlier said to keep away from the web 2.0 look. That's when I split the words, but we may be stuck with either wellsense or WellSense.\n\n2. You are almost right in saying that they will be marketing their services to other health professionals (therefore stick with pale blue helvetica on white background) but only some of their business comes from other HEALTH professionals. The rest of their business comes from all sorts, HIV care units, health policy planning, motherhood guidance, mental health, gender rights, community partnerships, sanitation, etc. So yes, they are very much medical professionals, but they must exude that warm, African, approachable type feeling. Quite a juxtaposition.\n\n3. How can I achieve better contrast? I tried fading the eye right into the background and then having pale text. I thought it worked. If I use a light version of any font face I feel it looks weak and too fussy. I could thin out the strokes that make up the eye??\n\nYou are right, neither font is a perfect fit, there is something i like about the font on the left but I worry it could just as easily be a cosmetics label (very odd one but still!)\n\n"
    },
    {
      "time": "29 Sep 2008 — 12:24pm",
      "content": "It may be worth a try to use Papyrus. It's been over used but it just may make sense in this application. It's a lighter font and has a hand crafted feel to it.\n\nSet the words in every font you have, you may discover a pairing you wouldn't normally consider. In my mind's eye I'm leaning towards a thin perhaps condensed font. A sans would probably be most associated with medicine but I think a serif could be interesting. Play a bit more. The heavier fonts that you've selected may work fine if you set them quite a bit smaller to provide the contrast.\n\nI'm hesitant to make font suggestions because I don't know what the cultural associations are with different typefaces in that area of the world. You may need to do some research.\n\n"
    },
    {
      "time": "29 Sep 2008 — 2:28pm",
      "content": "Kirsten you'll never believe this, the original concept proposed by a different design company was done in papyrus!\n\nWhilst on the cultural issue here's something quite interesting:  \nIf you live in the comfort of the first world you'd probably tend to think of Africa as \"yay, animals and tribal people\" (so you'd tend to use fonts like the Jurassic Park font (I think that's what they used in the new Madagascar movie logo). But when you actually live here you'll discover people are always trying to live more like they do in the first world. That's the intention but many designers here are not capable of knowing how to treat that. When a brief says \"logo should be african\" the first thing everyone here does is download a map of Africa from internet and there's your logo! I can't tell you how boring it gets. What I am trying to do for this client is invoke the image of Africa through the colours, and I suppose also the eye symbol, but really we want it to be a mark that looks like it will stand up in the first world too. Think of organisations like oxfam who are international, but some branches are African. Now think, what sort of identity would they have for these branches? African enough to look African, but still pretty European. I think that's what I'm trying to achieve here.\n\nI will try going through all my fonts ;) If I get stuck on helvetica I'll kill you!\n\n"
    },
    {
      "time": "30 Sep 2008 — 7:23am",
      "content": "Ha ha ha, well hopefully you will find a more unique solution than helvetica.\n\nYour explanation is exactly why I was hesitant to make any font suggestions. What I may think of as African is probably pretty stereotypical and not truly indicative of the culture. I once designed an article about a sports program in East Africa. It was suggested that I just add some African art as a graphic element. However when I researched the art of that region it was not what one (from the west) would typically associate with African art. The design was questioned by the editors, but remained as designed. On the flip side, a designer friend once had to design a brochure using Chinese characters. However the characters chosen had nothing to do with the subject mater, they were personally selected by the client because they looked pretty.\n\nYou are on the right track by using a more meaningful symbol than just a generic map. Looking forward to see where you take this.\n\n"
    },
    {
      "time": "30 Sep 2008 — 10:51am",
      "content": "Thanks, I'm going to see if I can come up with another concept and another iteration tonight.\n\nWhat was the sports program in East Africa? Was it Uganda? or Kenya?\n\n"
    },
    {
      "time": "30 Sep 2008 — 12:15pm",
      "content": "Interesting posts here ;)  \nI think Papyrus would need to be used exceptionally carefully to avoid looking stereotypical.  \nIn my day job I market our training services worldwide but with a focus on Africa and Asia, including in the health sector. I've also travelled a fair amount in East Africa.  \nWithout going into too much detail, I'd be inclined to think the principles of relevant design stand whatever context; also people's aspirations the world over are ultimately the same, and their psychologies are more similar than I'd imagined. If you look at INGO websites such as ActionAid, Oxfam, WaterAid etc you will see that most of their country office websites are branded pretty much the same way to confer international standards on their work around the world. That does not detract from their local context, which appears in the details specific to each webpage.  \nI'd agree with Kirsten that clarity and meaning are vital here. There is also the added criterion that your clients have asked for something 'unmistakeably African', which I think the Egyptian eye and the terracotta suggests. (Bear in mind that Egypt is not generally considered culturally part of Africa!)  \nYou might try changing that terracotta into the blue you originally suggested, as blue is easier on the eye, more restful. It might also help you get around the contradictory criterion of 'not looking stereotyped', and suggest the blue of Lake Victoria or of the sky! But I do very much like the red you have. It depends whether you think the eye icon is enough to suggest African or whether the colour and the font need to do that too.  \nThe curvy font suggests warmth, professionalism, calmness and femininity, which is I guess good for the client.  \nI think you could probably find a better-suited font. It's not bad what you have but there are some lovely humanist sans fonts out there. I might look at Fago, Le Monde Sans, Maiandra for example, just to see how the word form appears in different fonts.  \nJust some suggestions...you might not have budget to buy fonts!\n\n"
    },
    {
      "time": "30 Sep 2008 — 1:30pm",
      "content": "Thanks so much for that post Bendy. It's really awesome to hear from outsiders who know a lot about Africa. I actually live in Kenya, but roaming the streets of Mombasa is a sure way to get completely uninspired when it comes to professional... um, anything!\n\nKirsten, you were right about the target market, I asked the client to break it down and here's what I got.  \nOur market as anticipated:  \n- Locals/ laymen 0 %  \n- Community groups 2%  \n- locally based NGOs (not necessarily health professionals) – 5 %  \n- local Kenyan institutions – 15%  \n- internationally minded development & health related groups – donors, international NGO’s, academic institutions – 78%\n\nBendy, budget is an issue (when is it not) but I happen to own a copy of Maiandra, I don't have Fago or Le Monde Sans, I wish we could try before you buy. I did that with Klavika in one of my early posts (I just set the words wellsense on fontshop or something and then downloaded the gif). But the font costs $300!\n\nI am going to try out your suggestion of using blue. In actual fact I put together a basic sample for a brochure and I used pale blue on the inside pages to break up the teracota. Looks good. I'll attach it to this post as a PDF (please don't judge the actual typesetting and whatnot, it's just a sample I put together in 10 minutes to test colours)\n\nAlso here's the latest version of THIS concept based largely on ideas I got while reading Kirsten's latest post. Kirsten won't be killed because I found Univers to have the same professional clinical look as Helvetica but slightly different, namely the a looks quite different. I've also played with the ll in Well and I made the W and S of WellSense about 95% of their true size so that it looks like a mark rather than plain boring text.\n\n"
    },
    {
      "time": "30 Sep 2008 — 1:43pm",
      "content": "Couldn't figure out how to attach a pdf. prob not possible. Here's the latest logo iteration:\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/logo-1_4713.2.gif)\n\nAnd here's the blue and reddy brown together on a brochure, not sure I've got the right blue. Also I know you meant actually bring the blue into the logo, that's what I'm trying now.\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/brochure-1_4469.0.gif)\n\n"
    },
    {
      "time": "30 Sep 2008 — 1:44pm",
      "content": "[Fago](http://web.archive.org/web/20131020055824/http:/www.myfonts.com/fonts/fontfont/ff-fago/fago-no-med-roman/) and [Le Monde Sans](http://web.archive.org/web/20131020055824/http:/www.myfonts.com/fonts/typofonderie/le-monde-sans/demi/) appear on MyFonts if you want to see how they look.\n\n"
    },
    {
      "time": "30 Sep 2008 — 1:53pm",
      "content": "Aah, Kilifi! I remember lolloping around there for a couple of days on someone's yacht in the creek! Idyllic!\n\nMeta might work too as a font choice. Is that Univers Black? I don't think I've ever seen it before. It doesn't say very much to me, I'm afraid, and looks a bit too much like Arial.\n\nYou can attach a pdf to your original post at the top.\n\nI was imagining electric blue as a contrast colout. In small amounts!\n\nI'll try to stop interfering now, so you can get other people's feedback again!  \n:)\n\n"
    },
    {
      "time": "30 Sep 2008 — 2:06pm",
      "content": "I was imagining electric blue too! I have a disease where I start off with bright colours and then tone them down till they look boring. Let me go a bit wild with the blue and see what I come up with.\n\nKilifi Creek is great, we lived at the next creek down, Mtwapa if you've been there? it's the one with the floating restaurant. But now we've moved into Nyali closer to the shops and everything.\n\n... just looked at myfonts.com, wow le monde sans in nice!\n\n"
    },
    {
      "time": "30 Sep 2008 — 2:11pm",
      "content": "I have ITC Legacy Sans which is quite similar to Le Monde Sans except the e isn't horizontal, it rises at a slight angle\n\n"
    },
    {
      "time": "30 Sep 2008 — 2:25pm",
      "content": "Whilst we're on the topic...\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/logo-1_4257.3.gif)\n\n"
    },
    {
      "time": "30 Sep 2008 — 2:26pm",
      "content": "We went Mombasa-Kilifi-Watamu-Malindi-Lamu I think. Wonderful memories, it was about 10 years ago. We were in Kilifi during the monsoon season and the winds didn't stop -- all the boats in the creek were rocking all over the place, mostly empty as everyone had to wait for the winds to change before setting sail again, and they'd all gone off on safari and stuff.\n\nLook forward to seeing how you resolve all this!\n\n"
    },
    {
      "time": "30 Sep 2008 — 2:29pm",
      "content": "and here's Maiandra\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/logo-1_3864.4.gif)\n\n"
    },
    {
      "time": "30 Sep 2008 — 2:47pm",
      "content": "I got a bit bored so here are two more completely different ideas\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/logo-3_3657.0.gif)\n\nI have a feeling I'll be revisiting the eye logo, these are just to clear my mind ;)\n\n@Bendy, I haven't yet been to Lamu but know the others really well. My uncle and aunt have been running a scuba diving joint in Watamu for 20 years. Where did you go/stay in Watamu? or were you on the yacht the whole time?\n\n"
    },
    {
      "time": "30 Sep 2008 — 3:19pm",
      "content": "Oh gosh! It was some kind of person's house we stayed in there. I don't know what kind of person! There were old books on a shelf. Was it a hotel? There might have been flowers and palm trees. Not very illuminating I'm afraid!  \nWe did go out in a glass-bottomed boat and snorkelling in the grey wind, which was pretty horrible.  \nWe had lunch in a place with a blue marlin on the wall, it would have been really nice on a sunny day!\n\n"
    },
    {
      "time": "30 Sep 2008 — 4:20pm",
      "content": "I think the diamond/eye mark was working pretty strongly ... just needed a bit more exploration.\n\nand then rusticified ... drawn in sand ... with sand etc ... and some type created from earth.\n\nI'm not against \"wellsense\" as all lowercase ... has a ring of being a word that could enter vocab etc. It does of course have the whole web2.0 connotation, but that might be able to be avoided. I feel the mixed case version heads toward being too corporate ... with the examples shown at least.\n\nsounds like a great project.\n\nkeep us posted.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131020055824/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "1 Oct 2008 — 2:31am",
      "content": "Ratbaggy, thanks for the comments. I liked your suggestion of going back to all lower case. I got a few people to read your rationale there and they all went \"ahh yeah\". I also liked the idea of making it look \"drawn in sand\", I tried a couple of photoshop effects and couldn't get even close to how I imagined it. One hesitation is I want the logo to be as versatile as possible (website, letter head, signboards, etc) so complex effect won't work, unless they're somehow successfully work with the limitations.\n\nAnyway here's the latest:\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/logo-1_5050.5.gif)\n\nI just want to point out a few things so you can see the process:  \n- I have made it all lower case now  \n- I have used ITC Legacy sans ultra which i found to have some of the same appeal as le monde sans  \n- I stretched the font to 125% of its natural height  \n- but then cropped the ll so they weren't too high  \n- I then shaved them off at an angle and introduced a curve on the top left corner to mirror the s and e of the original font.  \n- the logo in the background has been redrawn slightly, I guess I like the homemade look rather than a precise geometric shape  \n- I think the \"serifs\" of the s shape match the angular logo in the background  \n- the text at the bottom is set in Vectora (I guess any professional looking face would be appropriate down there, but just need to find something that matches well)\n\nBendy, I'm afraid the books on a bookshelf and palm tree didn't narrow things down an awful lot, BUT good news on the restaurant front... the marlin on the wall, there are two restaurants in Watamu like that. They're neighbours actually, both facing the beach. One is at the Hemingways Hotel (posh place) and the other is at Ocean Sports Hotel (where you go barefoot into the bar and restaurant) - that's the one we hang out at more. How well do you remember you trip? How old were you?\n\n"
    },
    {
      "time": "1 Oct 2008 — 4:20am",
      "content": "I think it's time I got a sample to the client. This is what I'm going to show them:\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/collection-1_5536.gif)\n\n"
    },
    {
      "time": "1 Oct 2008 — 7:29am",
      "content": "I think I prefer the version of Legacy Sans without all the stretching and tweaking. The unaltered font has subtle weight shifts in the strokes that have a humanistic feel. Those are virtually lost in the stretched version.\n\nCurious to see blue added into the mix on the logo. Although I do quite like the earth tones you've been using.\n\nThe article I worked on was about tennis programs in Tanzania and Kenya. I created some Tingatinga inspired graphics as a design element. I quite liked the simple graphic drawings and the bright colors.\n\nYour client should be very pleased with your progress.\n\n"
    },
    {
      "time": "1 Oct 2008 — 11:39am",
      "content": "Hi Paul, I would've been 22 at that time, it was definitely not the posh place we sat in, we were all unkempt and seawatery.  \nI love the business cards, the headed paper is pretty nice too.  \nI'm slightly hesitant with [squooshing](http://web.archive.org/web/20131020055824/http:/typophile.com/node/33713) text; was that a design choice? But I do like the double l. Could they be sheared together rather than separately, so their tops form a continuous gradient? Legacy Sans looks good, I don't have an opinion on Vectora.\n\nI'd steer well away from photoshop effects and I don't think earth and sand want to be associated with medical expertise :) and as you say, logos need to be easy to transfer into different mediums.\n\nThis is coming along nicely.\n\n"
    },
    {
      "time": "2 Oct 2008 — 7:49pm",
      "content": "Best way to get a \"made of sand effect\" ... make it from sand.\n\n;)\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131020055824/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "3 Oct 2008 — 11:19am",
      "content": "Hi all, I had a meeting with the clients today. One comment is that the red brown background colour looks too dark, like dark chocolate. They said that the colours are exactly what they asked for but now wondering if they can see something a bit more orange. I'm finding it really hard because I'm working on a laptop so during the day with lots of ambient light the red brown becomes grey brown and then at night the colours come alive. So it's really hard to show the client. I did tell them that when we print I'll take them to the printer to play with the Pantone chart, but not sure of the proper way forward.\n\n ![](http://web.archive.org/web/20131020055824im_/http:/typophile.com/files/logo-1_4456.6.gif)\n\nThanks for all the comments, I found squooshingTM was pretty funny, I read the official definition. I am very aware of concepts like faux formatting and am careful not to be silly with stretching fonts, etc, however in this particular case I feel that my squooshed version only becomes obvious if you compare it to the original, but also ITC Legacy sans is quite a squat font when you look at its lowercase characters and I feel that stretching vertically injected a bit of logo life into it (ok a bit of a compromise, but I think it works well enough?).\n\nBendy, do you like the continuous shear along the tops of the Ls? Thanks for the idea. Sounds very much like you were at Ocean Sports Hotel. I'm actually Zimbabwean but we've been coming to Kenya on holidays for years and my uncle and aunt own a scuba school based at Ocean Sports so have been going there for many years. How funny!\n\nKirsten, the reason I asked about the sports job you did is recently we met folk in Uganda who have a soccer program for under priviledged kids (including ex-child soldiers) and they've done very well. They tour the world and win every junior soccer tournament they enter. Prince Charles has even visited them. They have lovely brochures and website obviously produced outside Africa.\n\n"
    },
    {
      "time": "3 Oct 2008 — 1:08pm",
      "content": "In the third image from your most recent post, there's not enough contrast between \"wellsense\" and the background image, so they start to blur together.\n\nI prefer the cream/terracotta/chocolate combination because there's greater hue variation between the three elements. If you're going to go with the orange/tan background, try making the text slightly pink to incorporate another hue.\n\nWhat about incorporating a cooler accent colour into the scheme? I don't mean into the logo itself, but maybe for secondary headings in the body text, or something along those lines.\n\n- Lex\n\nP.S. You could always reverse the first image (i.e. chocolate letters on a cream background).\n\n"
    },
    {
      "time": "3 Oct 2008 — 3:16pm",
      "content": "Quick reply before packing my rucksack for India!\n\nThe ls work ok, but now the second one stands out being too tall i think. Perhaps bring the second one down somewhere in between the height it was and the height it is? Or shorten both down a bit? Or starting the second l at the same height as the right tip of the first one? Play around with moving those nodes, see what looks most comfortable.\n\nI also prefer the colour in the first version. It looks more purposeful. As Lex says, you can always try reversing the colourways. Or increase the saturation to make it redder.\n\nI think the third version reminds me of fudge and the second is too yellowy.\n\n"
    },
    {
      "time": "4 Oct 2008 — 12:04am",
      "content": "Cool project. Logo looks good and seems well suited to the purpose. perhaps not a whole lot of ideas were tried, though I love the sand part. Would be awesome if you could customize the typeface witha breezed on sand look. it would just give the logo a more mysterious and personal touch.\n\nMaybe just a wind blown look? and feather off the lighter parts with grain effects to mirror sand? Perhaps print out the design in black and smeer it before the ink drys for different results?\n\n"
    },
    {
      "time": "31 Oct 2008 — 11:25am",
      "content": "Hey Paul how is this project going? Did you finish? I'd be interested to see what you decided in the end.\n\n"
    },
    {
      "time": "2 Nov 2008 — 7:18pm",
      "content": "definitely also curious to see where it's at\n\n\\*bump\\*\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131020055824/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20131020055824/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "9 Feb 2009 — 2:16am",
      "content": "Hi Bendy and Paul,\n\nThis all worked out nicely and the client is now using the marketing material that we produced. I fully intended to get a sample of each and take a photo to upload here to show you how it turned out, but when I said the printers here in Mombasa take a long time I meant it!! It's been such a headache getting everything printed, especially the brochures because I used 3 spot colours but did some interesting gradients and colour overlays on photographs which needed to be treated more like process colour. I didn't see the problem but the printers gave me grief.\n\nAnyway I'll get a photo soon and upload it so you can see the final product. It's definitely been the most fun logo I've worked on, thanks for your input!\n\nPaul\n\n"
    },
    {
      "time": "10 Feb 2009 — 2:28pm",
      "content": "sweet!\n\ncheers Paul.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20131020055824/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20131020055824/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": "18 Feb 2009 — 4:04am",
      "content": "Look forward to seeing the photo! :)\n\n"
    }
  ]
}
