{
  "id": "49857",
  "title": "Job Posting - Hoefler & Frere-Jones",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello Typophiles,\n\nWe've just posted the following job listing to our Careers page, in case any type-minded graphic designers in the New York area are looking for full-time employment among fellow type folks. (This listing is for a _graphic designer,_ not a typeface designer.)\n\n[Here's a brief intro from our blog](http://web.archive.org/web/20150103220009/http:/www.typography.com/ask/showBlog.php?blogID=132), and here's the complete listing:\n\n----\n\nCompany: **Hoefler & Frere-Jones**  \nJob Title: **Graphic Designer**\n\nHoefler & Frere-Jones is looking for an experienced graphic designer to work across all aspects of the customer experience. This position is full-time at our offices in New York.\n\nFirst and foremost, this position demands an absolute mastery of typography, and candidates must have experience with (and enthusiasm for) a wide range of media. You will be responsible for designing and executing all visual materials associated with an established, evolving, and highly visible brand, so experience with identity design is a plus.\n\nDigital projects will include all visuals connected with our website, from the presentation of typefaces to the development of new user interfaces. Print projects will include the design of advertising, catalogs, and type specimens. You will work with our marketing team to conceptualize and execute a wide range of projects, and with a programmer to develop new features and UI improvements for both the front-end and back-end of our website.\n\nIn addition to being problem-solvers with fine communication skills, applicants should have a wide range of interests, and impeccable instincts for what works.\n\nThis is a full-time salaried position with excellent benefits, open to US citizens or those with authorization to work in the US.\n\nRequired Experience:\n\n— BS/BA or equivalent  \n — 5-10 years professional experience  \n — A fanatical, absorbing passion for typography  \n — Experience managing print projects from soup to nuts  \n — Strong online experience, and a working knowledge of HTML/CSS  \n — Proficiency with the Adobe Creative Suite and Mac OS X\n\nStrong candidates will have:\n\n— Experience in brand development or identity design  \n — Experience in book or editorial design  \n — MFA in design, or other relevant post-graduate experience\n\nPlease submit a cover letter accompanied by a portfolio of relevant work (under 5 mb, please) to Carleen Borsella through the link on this page: [http://www.typography.com/about/careers.php](http://web.archive.org/web/20150103220009/http:/www.typography.com/about/careers.php \"http://www.typography.com/about/careers.php\")\n\n",
  "author": "hoefler",
  "time": "25 Sep 2008 — 9:48am",
  "uid": "101",
  "comments": [

  ]
}
