{
  "id": "49875",
  "title": "Logo For A Jazz / Soul Band, Named EC[easy]",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi\n\nI´m doing a logo for a Jazz / Soul Band, named EC[easy]. This Jazz / Soul band is new and they haven´t got any logo yet.\n\nMy problem is that I´m stuck with my idea... So I wonder if anyone could give critiques... suggestions... for this logo.\n\nThe band itself doesn´t have a logo and they asked me to make one. Something that describes in a few words:\n\n- new  \n- soul  \n- jazz  \n- easy (EC)\n\nOther questions?\n\n- Is this logo proper for music industry and for a Jazz / Soul Band?  \n- Is there some proper font that I instead could use to make an logo for the band?\n\nHere is a link to the band:\n\n[http://profile.myspace.com/index.cfm?fuseaction=user.viewprofile&friendi...](http://web.archive.org/web/20101224182930/http:/profile.myspace.com/index.cfm?fuseaction=user.viewprofile&friendid=166131331 \"http://profile.myspace.com/index.cfm?fuseaction=user.viewprofile&friendid=166131331\")\n\nMany Thanks,\n\nTed\n\n| Attachment | Size |\n| --- | --- |\n| [eclogo.jpg](http://web.archive.org/web/20101224182930/http:/typophile.com/files/eclogo.jpg) | 61.57 KB |\n| [eclogo2.jpg](http://web.archive.org/web/20101224182930/http:/typophile.com/files/eclogo2.jpg) | 83.46 KB |\n| [eclogo5.jpg](http://web.archive.org/web/20101224182930/http:/typophile.com/files/eclogo5.jpg) | 70.97 KB |\n| [eclogo8.jpg](http://web.archive.org/web/20101224182930/http:/typophile.com/files/eclogo8.jpg) | 151.79 KB |\n| [eclogo10.jpg](http://web.archive.org/web/20101224182930/http:/typophile.com/files/eclogo10.jpg) | 136.15 KB |\n| [ec\\_logo7.jpg](http://web.archive.org/web/20101224182930/http:/typophile.com/files/ec_logo7.jpg) | 204.5 KB |\n| [ec\\_logo\\_final.jpg](http://web.archive.org/web/20101224182930/http:/typophile.com/files/ec_logo_final.jpg) | 700.05 KB |\n| [ec\\_logo\\_final\\_two.jpg](http://web.archive.org/web/20101224182930/http:/typophile.com/files/ec_logo_final_two.jpg) | 212.68 KB |\n\n",
  "author": "<a href=\"/web/20101224182930/http://www.typophile.com/user/25037\" title=\"View user profile.\">Ted</a>",
  "time": "<br>",
  "uid": "25037",
  "comments": [
    {
      "time": "",
      "content": "Have they given any suggestions as to what they want?\n\nWhat you have done does might suit a chamber music quartet but does not really suit this band's music. Also the way the letters join looks too much like an i.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Justin for answering....\n\nI described in the text, that the band itself doesn´t have a logo and they asked me to make one. Something that describes them in a few words:\n\n- new  \n- soul  \n- jazz  \n- easy (EC)\n\nCheers, T\n\n"
    },
    {
      "time": "",
      "content": "You might find some starting points here. This is a British guy who has been doing graphics for this type of music since the late '80s. There is a whole page of logos. The roots of most of his designs, especially the record sleeves, are classic soul and jazz covers from the '60s and '70s.  \n [http://www.swifty.co.uk/swifty/portfolio.php](http://web.archive.org/web/20101224182930/http:/www.swifty.co.uk/swifty/portfolio.php)\n\n"
    },
    {
      "time": "",
      "content": "\\*Justin,this will help mew allot!\n\nI appreciate allot,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "you looked at, or listened to any classic jazz tracks recently?\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20101224182930/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "Thank you for the comments so far. There are some new logos that I attached. Please look and give some feedback. I really appreciate!\n\nThank you!\n\nTED\n\n"
    },
    {
      "time": "",
      "content": "I quite like the idea, but right now the letters look very much forced together - not easy at all.\n\nHave you tried drawing something by hand? Maybe with a thin brush?\n\n"
    },
    {
      "time": "",
      "content": "Thank you for your comments.\n\n\\*all about seb\n\nNo I havent yet tried it yet but I will try to as you said with an thin brush. That could propably do it.\n\nIs there something else that I could change to this logo?\n\nCheers, T\n\n"
    },
    {
      "time": "",
      "content": "Here is a new design i did really fast,[logo5.jpg] hand drawn.\n\nThanks a bunch for the comments so far!\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Being blunt, the designs so far look really clunky and forced. If you think about classic band logos, they are usually really simple ideas, which helps when you bear in mind the application - guitar picks, embroidered badges, school book doodles etc, in other words, it has to look good when really small, as well as really big and so far the ones on show wouldn't translate. Also, is the name of the band EC, or Easy? If it's EC, then why are the logos so far \"easy\"?\n\n"
    },
    {
      "time": "",
      "content": "take a look at the story behind paula scher's logo for the jazz institution at the Time Warner Center in New York. It will give you some insight into how she went about that logo.\n\n[http://www.adobe.com/designcenter/dialogbox/type\\_is\\_image.html](http://web.archive.org/web/20101224182930/http:/www.adobe.com/designcenter/dialogbox/type_is_image.html \"http://www.adobe.com/designcenter/dialogbox/type\\_is\\_image.html\")\n\ncourtney\n\n"
    },
    {
      "time": "",
      "content": "yes. the scher thing is a great and simple approach.\n\nit was one of the first things that sprang to mind ... but I didn't want to reference it it for fear you'd follow that path entirely. basically ... and this is what I meant by my original post ... get to know the music, attitude and feeling of the band and the genre (and the way it makes you feel) and respond to that - you'll no doubt find a whole range of great ideas there.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20101224182930/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": "",
      "content": "Thank you for the comments! Im going to work a bit on the logo and come back for more feedback from you...\n\nI really appreciate all the comments so far.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Paul-\n\nGood point, I decided to bring her in because of the way she approaches logos...which was why I attached the video, hoping he would take a peak.\n\nTed-\n\nYou're not allowed to copy paul scher...\n\n:P\n\ncourtney\n\n"
    },
    {
      "time": "",
      "content": "it's Paula .. Scher. I am Paul\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20101224182930/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20101224182930/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "",
      "content": "hehe, yes, look at my first post (Spelled correctly), just a typo. But he's not allowed to copy paul scher either...if there is one. :)\n\ncourtney\n\n"
    },
    {
      "time": "",
      "content": "Scrap the Helvetica font, so overused and I hate it. Totally the wrong font choice Jazz has a lot of swing to it, so maybe show this in the design. Maybe experiment with your own hand styles in illustrator. Or maybe get them down on paper and scan them into your workspace to work on them.\n\n"
    },
    {
      "time": "",
      "content": "Thank you again for the feedback. Really helps me allot.\n\nHad some time again doing some work with this logo. New,[logo8.jpg].\n\nT\n\n"
    },
    {
      "time": "",
      "content": "hmmmm\n\nupload hasn't seemed to have worked.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20101224182930/http:/www.solid-creative.com/print.htm)  \n [Bicycle Film Festival](http://web.archive.org/web/20101224182930/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "",
      "content": "I tried the attachment, and it works for me!\n\nT\n\n"
    },
    {
      "time": "",
      "content": "oh ... on the original post? right\n\nI'm reading Casy soul\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20101224182930/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20101224182930/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "",
      "content": "\\*Thanks Paul  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nYour´e right, i´ll fix it!\n\n"
    },
    {
      "time": "",
      "content": "Too much. Way too much. Get rid of the splatter/stroke type. It doesn't serve a purpose. A great mantra...\"Keep it simple stupid\". I swear one day I am going to make myself a t-shirt so I can wear it while I'm working on projects. :) I am also plagued by the overwhelming want to put colors and colors and stuff everywhere...but...\n\nI think you are trying too hard. The cool thing (but hardest part) about design is that you are suppose to make it look effortless. It's suppose to look like you just sort of made it in a few minutes. But behind it all, there are hours upon hours of work and tweaking and kerning and frustration and then finally...SUCCESS!\n\nAlso, the swirl doesn't read as an e, it's reads as a swirl. I do kind of like how you have the top of the s sort of following the o. That's a nice little piece there. But step back a little and clean it up. Jazz is all about the off beat. (I have played instruments for about 12 years now, including some jazz) Jazz is about the energy. You can show those things without making the text do them. It's cool to see how you're working though.\n\ncourtney\n\n"
    },
    {
      "time": "",
      "content": "Oh, just a small note too...\n\nStay away from the graphic styles of the paintbrushes in illustrator. To people that use those programs...they stick out like a sore thumb. So your logos look like you just went through all the brush styles, and changed it for each logo.\n\ncourtney\n\n"
    },
    {
      "time": "",
      "content": "Thank you for the comments so far, what would I do without you guys/girls!\n\nI´ve listened to youré comments so far and tried to reform this logo.\n\nI would apprectiate youre help by choosing THE LOGO you think I should go forward with, I know there´s allot of them at the attachment. Please do and comment on what you think is wrong and what I should do with making this logo better so it could get published! If you think there isn´t a logo fit to publish then tell me. I dont have allot of time left and the band wants this logo by next week. And I spent allot of time hoping to make a suitable logo for this band.\n\nMany thanks to you that have commented and I hope of hearing some feedback from you now again.\n\nCourtney to all,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Hmm, 4 & 6 of JPG 10 have some potential. I still say get rid of the outlines around the type. If you like this font, you can always go into illustrator -\\> type-\\> create outlines. This will make the type into vector shapes. Then you can select \"expand\" from the top tool bar. This will make it to where you can go through and delete those stroke lines around the type.\n\nI do think it's going in a direction at least. I'd say put some effort into making it read \"Easy Soul\" and making it look clean and professional. You might end up with a fairly nice portfolio piece at the least.\n\ncourtney\n\n"
    },
    {
      "time": "",
      "content": "Thank you \\*cslem1\n\nThe E is a handdrawn piece already. The thing is that I wanted to show some sort of energy and depth to the E, that you described earlier in the text. Do you have some other tips and tricks that I could make for the logo?\n\n"
    },
    {
      "time": "",
      "content": "My latest creation jpeg 7 in the attachmeant! I really hope you have some last comments before it´s to late...\n\nMany thanks.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Too many styles if you ask me:  \n1. ec  \n2. easy soul  \n3. text\n\nEspecially text doesn't work at all to me. Try to check 20' or 30' posters to see what type could go with this overall style that reflects it to some degree.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "",
      "content": "\\*Thank you Robert\n\nI will look up at that! I don´t even know if im going to use the text in the botttom. It was just an experiment so to speak. But im glad that I got some respons.\n\nPlease do tell me if there something else that I should consider to change because I will have to give this logo for the band untill next week.\n\nMany thanks\n\nT\n\n"
    },
    {
      "time": "",
      "content": "I noted on the most obvious. Maybe others will give their two cents, because it better to have two not so detailed opinions (that may be the same) than one detailed that may be to biased.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "",
      "content": "\\*Many thanks to you Robert.\n\n"
    },
    {
      "time": "",
      "content": "Hi everyone!\n\nThis would be my last and final time to post about this logo! Tomorrow is the day that i´ll give the logo to the rightfull owners...so to speak. So i wonder what you think? Tell it straight to my face...\n\nI´m really glad for every comment that you have given me. Because it had helped me to come to this approach, so thank you again!\n\nCourtney to all,\n\nT\n\n\\*the logo is in the attachments! \"final\"\n\n"
    },
    {
      "time": "",
      "content": "I love the script but I feel the application is too much. I would be inclined to drop the script onto a plain old white background.\n\n"
    },
    {
      "time": "",
      "content": "I'm seeing \"Casy Soul\" - I think a more conventional 'E' would work better.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Stick to the band's name as is, don't do the play on words.  \nLook at old jazz and soul album cover, you might find inspiration from that and add your own flavor to it.  \nKeep it simple.\n\ncheers  \n:tony\n\n"
    },
    {
      "time": "",
      "content": "I really plan to make that a t-shirt someday...\"Keep it simple stupid\" just a reminder for myself. :)\n\ncourtney\n\n"
    }
  ]
}
