{
  "id": "49879",
  "title": "Creative album cover design - A showcase of Beatles albums",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "So we all know that album covers and record sleeves often present some of the most creative design or illustration around. Recently I was reading in Grafik. about the Keane Under the Iron Sea album design with illustrations by Sanna Annuka ( [http://www.sanna-annukka.com/portfolio/#](http://web.archive.org/web/20130516064801/http:/www.sanna-annukka.com/portfolio/# \"http://www.sanna-annukka.com/portfolio/#\")) and found the whole process fascinating. So I decided to write a blog on album cover design.\n\nBut heres where I hit a stumbling block. What to choose as a showcase. There is some marvelous design out there and I would point viewers to agencies like non-format ( [http://www.non-format.com/](http://web.archive.org/web/20130516064801/http:/www.non-format.com/ \"http://www.non-format.com/\")) who specialise in this. However for the purpose of this article I will focus on The Beatles album covers. They have a fascinating variation which spans across a long and changing time period.\n\n1. Revolver\n\n ![](http://web.archive.org/web/20130516064801im_/http:/typophile.com/files/revolver_6169.jpg)\n\nThere is little doubt that the Beatles were progressive with their music, and their album covers certainly mirrored this. Here on revolver we see a original mix of illustration and print by illustrator Klaus Voorman, himself a guitarist of some note.\n\nFirstly a word on the illustration. The hand drawn feel and simplicity are truly refreshing. Klaus achieves a distinct likeness to four of the worlds most famous faces with such a simple use of line and shape. He also seems to capture the likeness of the characters. Lennons eyes and nose seem to shout out confidence where more innocent open eyes of George Harrison portray a more thoughtful demeanor. I also love simplicity of the black and white look of the album.\n\nThe album has a collage-y feel, with the combination of Robert Whitakers photography and the illustrations. This is a technique that is ever popular in todays design environment, but it is important to note that techniques would have been for more difficult and time consuming before our good old friend the Mac arrived. When done well it is spectacular and it is the black and white colouring throughout that presents it being over-crowded. The style of the placement of the photographs around the faces almost fits into the abstract art movement that was still evident in the 1960’s.\n\nThe name of the album itself also contains meaning with revolver a pun on a kind of hand gun (incidentally the first idea for a name was abracadabra...glad they went with revolver) as well as a reference to the revolving motion of a record on a turntable. So from a conception point of view it is also interesting.\n\nTypographically the text of the word revolver fits in with the style of the whole cover. It is in a simple san serif font, thick and clear and still has that hand made feel somehow. Personally I love this cover. It is experimental and yet simple. It also fails to look dated which many album cover artwork fails to achieve.  \nhttp://en.wikipedia.org/wiki/Revolver\\_(album)\n\nSgt Peppers Loely Hearts Club Band\n\n ![](http://web.archive.org/web/20130516064801im_/http:/typophile.com/files/sgt-peppers_6356.jpg)\n\nProbably the most famous of the beatles packaging, design and music-wise a multi award winner, this cover and record sleeve design was created by art director Robert Fraser (one of the biggest supporters of modern art in Britain), designed by Robert Blake and photographed by Peter Blake. It was made up by a clourful lifesize collage of cardboard cut-outs. Incidentally, this was favoured by an original painting pictured below.\n\n ![](http://web.archive.org/web/20130516064801im_/http:/typophile.com/files/sgt-peppers-original-AW_4626.jpg)\n\nThe design very much contains pop art and psychedelic art movements, and opened up to a picture of the Beatles in dress on a bright yellow background. It was originally thought to contain a bag of ‘lonely hearts club goodies’ but this was rejected for cost implications.\n\n ![](http://web.archive.org/web/20130516064801im_/http:/typophile.com/files/300px-Sgtpeppergatefold_6500.jpg)\n\nSimilar to the Rubber Soul cover, this has quite a hand made feel from the collage technique. The collage is made up of the Beatles’s heroes, and also contains a photograph of the band members from the early 60’s. All the characters overlook a grave with The Beatles written in flowers. The thought is that the early version of the mop topped band is dead and buried, to be replaced by a more meaningful one. The album name, is displayed on the drum is a psychedelic patterned style.\n\nThe album cover is surely one of the most famous ever and has an overcrowded feel to it. It is packed full of insignia and meanings, whilst being truly original. In a similar way to Revolver, it has stood the test of time. I think if no one had seen this design and it was released today, it would still be marvelled at.  \n [http://en.wikipedia.org/wiki/Sgt.\\_Pepper%27s\\_Lonely\\_Hearts\\_Club\\_Band](http://web.archive.org/web/20130516064801/http:/en.wikipedia.org/wiki/Sgt._Pepper%27s_Lonely_Hearts_Club_Band \"http://en.wikipedia.org/wiki/Sgt.\\_Pepper%27s\\_Lonely\\_Hearts\\_Club\\_Band\")\n\nThe Beatles (more commonly known as The White Album)\n\n ![](http://web.archive.org/web/20130516064801im_/http:/typophile.com/files/white-album_6652.jpg)\n\nI like this album, it has such a minimal look, and instead concentrates on subtle printing techniques to make it special. The music within was written and in most parts recorded unplugged and the cover design echoes this simplicity. It presented a deep contrast to its predecessor Sgt Peppers’s bright colours.\n\nThe record sleeve design was produced by renowned Pop artist Robert Whitaker, and plays on the minimalist art movement that was around at the time. The original design consisted on the bands name discreetly embossed just below the middle. It also contained a serial number to create, in Hamilton’s own words, “the ironic situation of a numbered edition of something like five million copies.” Later releases in the had the name printed in grey as opposed to embossed, but still maintained the simplistic approach. The original releases of the CD also contained serial numbers, which presented a uniqueness to every copy.\n\nThe inside of the sleeve involved photography by John Kelley, contained harshly lit and moody photographs of the band, as well as a large poster. Incidentally it was the first album of theirs to not have a photo of the 4 members on show on the front cover. Later cassette versions also contained gold foil printing on black tapes.  \nThe typography is just as simple as the design with a simple execution using what I believe is Helvetica. In this case all the white space placed the emphasis solely on the type. Even with the embossing this would have made it quite impactful.\n\n ![](http://web.archive.org/web/20130516064801im_/http:/typophile.com/files/white-album-detail_6725.jpg)\n\nI think this sleeve really gives us a view of world of record sleeves rather than plastic CD cases. Not to take anything away CD cover design, but imagine how spectacular a music store would have been, containing hundreds of these large scale fold out covers.  \nhttp://en.wikipedia.org/wiki/The\\_Beatles\\_(album)\n\nYellow submarine\n\n ![](http://web.archive.org/web/20130516064801im_/http:/typophile.com/files/yellow-sub_5496.jpg)\n\nYellow submarine was a release alongside the more successful animated film by Canadian-born animation producer George Dunning. Conceptually the album was based more or less solely on the film, so for the purpose of this blog I will write about this. The concept of the film was pretty abstract. It is set in Pepperland a music filled paradise under the sea. The story involves the 4 band members going on an epic and colourful journey, to save Pepperland and defeat the ‘blue meanies’ (a slang term for bad politicians or the police).\n\nThe cover artwork is influenced by the abstract and psychedelic art movements around in the 1960’s. The illustrations are colourful and rounded. The setting, in contrast to other animations of the time, such as Disney features, involved a more abstract environment that could not exhist in the real world. Other animators who worked on the movie are Paul Driessen, Cam Ford, Anne Jolliffe, Tony Cuthbert, Geoff Collins, Jim Hiltz, Ron Campbell and Hester Coblenz. It is very playful and experimental. I guess the style of the movie and album artwork mirrored that of McCartney songs, and in fact he also had a large input into the concept.\n\nThe style is thought to resemble acid trip, flower power style pop art. Typographically this is also the case. The font, which I think is Amelia (confirm anyone?) is the same. It is rounded and also double imaged, giving even more of a psychedelic feel. The grey space surrounding it, draws the line of site towards it, making the illustration an afterthought, and not overpowering.\n\nI really like the illustration here, and again I think it is important to realise the context of the timing. It was not overly common that a pop band had such free conceptual ideas.  \nhttp://en.wikipedia.org/wiki/Yellow\\_Submarine\\_(album)\n\nAbbey Road\n\nI thought I would write about this simply because of the iconic symbol it has become, but actually it was one of the more understated in terms of design and production. The concept was thought of and directed by Apple records creative, Kosh (couldn’t find a first name!). The image was taken by photographer Iain Macmillan, who was given only ten minutes to take the shot at 11.30 one morning.\n\nThe insignia in the album is meant to portray that of a funeral with the police car in the background a hurst. The clothes of the band are also thought to represent this. Harrison a grave digger, McCartneys lack of shoes indicate a corpse, Starkey an undertaker, and Lennons all white a priest. The design added to the conspiracy theory rumours that Paul McCartney was in fact dead.\n\nTypographically the album name is on the rear, being written as you might expect as a road name would be on a wall. The song names are written just plainly toward the bottom left, and lack legibility. I guess the idea is to keep the emphasis solely on the image, but I actually think it looks a little dated and should be more considered. Though this album is my least favourite design wise, it has probably become the most iconic of them all.  \nhttp://en.wikipedia.org/wiki/Abbey\\_Road\\_(album)\n\nWell I hoped you enjoyed the post, please correct me if I have got anything wrong. So whats your favourite? anything to add to this? also please check out my other entries on [www.freddesign.co.uk](http://web.archive.org/web/20130516064801/http:/www.freddesign.co.uk/ \"www.freddesign.co.uk\").\n\nI am new to blogging and still finding my way so any feedback would be appreciated.\n\nRoger Chasteauneuf\n\n ![](http://web.archive.org/web/20130516064801im_/http:/typophile.com/files/abbey-road_4347.jpg)\n\n",
  "author": "chasteauneuf",
  "time": "26 Sep 2008 — 3:14am",
  "uid": "29870",
  "comments": [
    {
      "time": "27 Sep 2008 — 6:09pm",
      "content": "About the Sgt Pepper cover. To me [this account is plausible](http://web.archive.org/web/20130516064801/http:/www.beatlesagain.com/btsgtppr.html) on the role of Robert Fraser in the creation of the cover. Fraser had a superb eye for excellence in art, and owned a gallery, but was not an artist or art director, I believe. His role seems to have been to have the eye to realize that what had been initially done was not very good, and he knew that Peter Blake--whom he showed in his art gallery--could do a great job, which he did. Paul McCartney admired his taste in art, and probably consulted him. But really the credit for the work itself goes to Peter Blake and his wife, also an artist, who helped him with it.\n\nFraser was an amazing character, who you can learn a lot about in the biography of Paul, \"Many Years from Now.\" He was an immensely charming and evil character who had a great eye for art, and was at the center of \"swinging London\" of those days (1965-69). He was also dope dealer to the stars, and IIRC had a habit of taking 100% commission on the art work he sold. At the time, a friend of mine worked for Fraser in his gallery, and was shamelessly exploited--which seems to have been pretty typical of Fraser.\n\nOh so many years ago.\n\n\"Those were the days, my friend, we thought they'd never end.\"\n\n"
    }
  ]
}
