{
  "id": "4987",
  "title": "Design Education in Ontario Canada",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all I am currently a high school student, graduating this year, and I am trying to make up my mind what I am going to do new year.   \n   \nMy first choice was the Ontario College of Art and Design - Bachelor of Design program. I didnt get accepted there because my fine art work was not strong enough because I know their program enforces a very strong background in Fine Art, especially after they ditched their foundation art year. My high school art programs didnt teach me to paint or draw so I had to teach myself.   \n   \nSo what I planned to do was go to George Brown in Toronto for art fundamentals and improve my work and re apply to OCAD the next year.   \n   \nHowever today I found out I was accepted into the York University and Sheridan College joint program for their Bachelor of Design program. I don't know as much about York/Sheridan as I do about OCAD, and I know they have had some pretty good press about their program but I am concerned about their academic vs practical teaching in that school.   \n   \nCan anyone offer me any advice on my decision or know about the two programs? They both offer the same degree so I am guessing there may be an oportunity to transfer from York if I didnt like it.\n\n [‹ Used to be &#34;bright ideas&#34;](http://web.archive.org/web/20081121155826/http:/www.typophile.com/node/5227 \"Go to previous forum topic\") [Typograpic trailer ›](http://web.archive.org/web/20081121155826/http:/www.typophile.com/node/5197 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121155826/http://www.typophile.com/user/3793\" title=\"View user profile.\">negativespace</a>",
  "time": "<br>",
  "uid": "3793",
  "comments": [
    {
      "time": " 2.Jun.2004 8.30am",
      "content": "York/Sheridan is good - least its a degree rather then a diploma at George Brown. But you get the best of both worlds be being linked with the college for technical skills.   \n   \nOCAD I find is going downhill for design programs - of all the people I know who've gone or are familiar with the program they say it's based far too much on theory/thesis and not enough practice. I know Industrial Designer's from there who never even heard of autoCAD - that's a bit scary. Not that I want to push the computer aspect but to be employable they are skills that you're going to have to learn on the side if you were at OCAD. And if you were at George Brown you might have too much practice and not enough thinking to do.   \n   \nyork/sheridan is a good choice - it's a new program (well only a few years old I think) but they have some pretty spiffy looking courses. go go go.\n\n"
    },
    {
      "time": " 2.Jun.2004 12.09pm",
      "content": "Thanks for the info Tanya!   \n   \nI wasnt looking to finish ym education with George Brown, only to build my fine art portfolio to help me get into OCAD. It is a shame to hear that they are lacking in the design program, because of my friends who is a graduate from the school said when he went it was mostly practical and was concerned that there would not be enough practical experience at York.   \n   \nI have been thinking about all the options and I think I am going to stick with York U/Sheridan for now, and if I really didnt like it then I would reapply to OCAD or try to transfer.   \n   \nNick Shinn was able to give me some helpfull information and the typeface design class sounds really interesting.   \n   \nAnyways I got the official letter from York and a scholarship so I am pretty happy today!\n\n"
    },
    {
      "time": " 14.Jun.2004 9.15pm",
      "content": "A few weeks late, but hopefully I can help.   \n   \nI attend ocad and I find it's design program excellent. I think there is a good blend of practical and theoretical experience. One good thing about ocad is that the assignments are quite open, they really become what you make them. ie: It may seem like an ordinary assignment, but can turn into a great piece of design if you put a lot into it. However If you're mainly interested in type design I agree with nick, york/sheridan is the way to go.   \n   \ncheck out the forums on [www.myocad.com](http://web.archive.org/web/20081121155826/http:/www.myocad.com/) for some good threads in the archive about OCAD vs York (from both ocad and york students)   \n   \noh, and take comments from ocad students with a grain of salt; they are a great bunch of people but they complain non-stop...\n\n"
    }
  ]
}
