{
  "id": "49881",
  "title": "Terminology: Morphology?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I may be a bit vague here, but I'm searching for a word to describe a particular concept: The abstract idea about how a grapheme is formed, i.e., the conception about what elements of a grapheme are essential to its identity. A direct graphical representation of this \"idea\" shows the grapheme in its most basic, neutral form. (This is something that may very well change over time, which frequently leads to the birth of allographs, or even new alphabets.)\n\nAn example: The modern grapheme \"P\" can be described as a vertical line, to which a closed semicircle is attached at the top, to the right. This is, I think you all agree, the natural, most neutral form. However, this was not always so: originally, the P is related to the Greek Π, with the difference that the Italic (pre-classical) Π had a shorter descender to the right (i.e. a form half way between Π and Γ. This was frequently rounded, but almost always with a large opening at the bottom:\n\n[http://commons.wikimedia.org/wiki/Image:Polla\\_via\\_popilia\\_da\\_reggio\\_a\\_ca...](http://web.archive.org/web/20140714224658/http:/commons.wikimedia.org/wiki/Image:Polla_via_popilia_da_reggio_a_capua.jpg \"http://commons.wikimedia.org/wiki/Image:Polla\\_via\\_popilia\\_da\\_reggio\\_a\\_capua.jpg\")\n\nOver time, this opening gradually became smaller and smaller:\n\n[http://commons.wikimedia.org/wiki/Image:Sol\\_Serapis.jpg](http://web.archive.org/web/20140714224658/http:/commons.wikimedia.org/wiki/Image:Sol_Serapis.jpg \"http://commons.wikimedia.org/wiki/Image:Sol\\_Serapis.jpg\")\n\nAnd today, the normal form (ask any child) is with a closed semi-circle. The open form is still a perfectly valid glyph-variant, no question about that, but the closed form is what is regarded as the \"essential\" P.\n\nNow, what is it that has changed? The P-grapheme's \"morphology\"? Its \"topology\"? Is there a standard term for this concept?\n\n",
  "author": "winge",
  "time": "26 Sep 2008 — 4:48am",
  "uid": "6424",
  "comments": [
    {
      "time": "26 Sep 2008 — 7:12am",
      "content": "I believe \"morphology\" applies best here.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "26 Sep 2008 — 10:26am",
      "content": "Thank you. But, is that an established term for this concept? I just more or less made it up, you see. Might there be another word I haven't heard about that would be better?\n\n"
    },
    {
      "time": "26 Sep 2008 — 12:09pm",
      "content": "You didn't mention the Etruscan language (ca. 650 B.C.) ; morphological changes in 'P' could be coherent to its bi[p]olarity in the languages, from \"[p]ous-[p]ed-[p]es\" to \"su[p]erior-u[p]-loo[p].\" Sure if it was a stylistic variation it was visible in its form.\n\n"
    },
    {
      "time": "26 Sep 2008 — 2:03pm",
      "content": "\\> The abstract idea about how a grapheme is formed, i.e., the conception about what elements of a grapheme are essential to its identity.\n\nSounds like ontology. And the \"what has changed\" part sounds like phylogeny or cladistics.\n\n"
    },
    {
      "time": "29 Sep 2008 — 6:55pm",
      "content": "'Morphology' refers to the form of things. In linguistics, morphology refers to the forms that meaning-units (\"morphemes\") take, for instance.\n\nOther terms might overlap, I guess, but I don't think there's anything wrong with using the word 'morphology' here.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "29 Sep 2008 — 10:04pm",
      "content": "Thomas Milo has spent a lot of time thinking about this sort of question, and using his background in linguistics to provide analytical and terminological tools to systematically describe writing systems (particularly Arabic). I'll alert him to this thread.\n\nMorphology or morphography seem like a good candidates to me. Ontology is concerned with existence in a metaphysical sense, not with form or structure, so doesn't seem appropriate in this context.\n\n"
    },
    {
      "time": "23 Mar 2014 — 4:57am",
      "content": "Graphematics?\n\n"
    },
    {
      "time": "23 Mar 2014 — 9:58am",
      "content": "As a linguist, I would find the term 'morphology' (or 'morphography') highly counterintuitive if used in this way, despite the fact that it may seem to make sense from an etymological standpoint -- both suggest combining graphemes into larger units (for instance, forming complex syllables in Devanagari). I find Andreas' suggestion of 'graphematics' less confusing.\n\nAndré\n\n"
    },
    {
      "time": "23 Mar 2014 — 11:15am",
      "content": "A closed P and an open P are different topologically.\n\nUnfortunately, topology makes an open P equivalent to an L or an I, or a C. It makes E equivalent to T.\n\nSo that's definitely not the term to use.\n\nAnd topography is right out as well, although one could (with tongue firmly in cheek) use it to talk abut the frequency and height of ascenders, making a line of type more mountainous.\n\nI'd suggest using nontechnical language. Merely speak of the basic shape of a letter. Or eschew Latin for German, and use something starting with \"ur-\".\n\n"
    },
    {
      "time": "23 Mar 2014 — 12:55pm",
      "content": "I like topology.  \nIts meaning doesn’t have to be strictly mathematical, when applied to typography.  \nThe idea is that the topology of a glyph remains the same, no matter how much its contrast, stress, weight and serifs are transformed.  \nOne might also say that the topology of P and R in Palatino is consistent.\n\n"
    },
    {
      "time": "23 Mar 2014 — 2:25pm",
      "content": "You are looking too far afield. The skeletal essence of a grapheme shape is its _form._ Now, in plain language, \"form\", \"shape\" and \"morphology\" would be synonyms, but there is enormous precedent in how people in typography and graphetics talk about this: we say \"the binocular form of g\" and \"the cursive form of r\". You naturally used it many times in your inquiry. _Form_ could be considered its own taxonomical level between _grapheme_ and _glyph_.\n\nThe study of how a graphic form has changed and developed could be called its \"morphology\" in the same way the origins of a word are called its \"etymology\".\n\n"
    },
    {
      "time": "23 Mar 2014 — 2:55pm",
      "content": "What changes is that when the P is \"open\", it is simply connected whereas when it is \"closed\" it is not simply connected; simple connectedness is indeed a topological property. To use that interpretation, we need to see a P as a plane surface bounded by its contours. What that means is just that the open P can be defined by a unique contour and the closed one needs two contours (and both P's are \"connected\" i.e. are made of just one piece).\n\nBut, quadriloc is right: the letters p, q, d, b are nothing but an o with an outgrowth. Topologically, they are undistinguishable.\n\n"
    },
    {
      "time": "23 Mar 2014 — 5:04pm",
      "content": "> the letters p, q, d, b are nothing but an o with an outgrowth. Topologically, they are undistinguishable.\n\nSo too is a single-story a. And if you allow nibbling on the o, you get c. If you add a bar to a nibbled o, an e.\n\nAlso, h, n, m, and u share shape (& maybe you can add the r), as do v, w, and y. If you allow the \"outgrowth\" to bend, voila, l, f, and j, and maybe i.\n\nTwo smaller stacked o's with a connecting line make up a g, and two small, sacked o's nibbled on an s.\n\nConsider: if you look at runic forms, another way of looking at all this comes about.\n\nEtc.\n\n"
    },
    {
      "time": "23 Mar 2014 — 6:59pm",
      "content": "> So too is a single-story a. And if you allow nibbling on the o, you get c. If you add a bar to a nibbled o, an e.\n> \n> Also, h, n, m, and u share shape (& maybe you can add the r), as do v, w, and y. If you allow the \"outgrowth\" to bend, voila, l, f, and j, and maybe i.\n\nAn o, a single story a and a double story a and also the letter e are just the same topologically: one exterior contour, and one contour inside to make one hole (with font editors, that contour winds in the opposite direction).\n\nThe j and the i have two disconnected pieces and with font editors, they are made using two contours that do not overlap and that wind in the same direction; they are not distinguishable from É or ù that have similar contours, but are distinguishable from a, e and o and also é (that has three contours).\n\nAs for h, m, n, v, w, u, they are also undistinguishable: just one contour.\n\nJust making a little slice to make a c from an o does not preserve the number of contours.\n\n"
    }
  ]
}
