{
  "id": "49893",
  "title": "Carpathica - a simple pixel font - critique please",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "Hello everybody,\n\nI am new to font design and I tried to generate a simple pixel font. I posted earlier another design - a helvetica-like sans ( [http://typophile.com/node/49228](http://web.archive.org/web/20150414144255/http:/typophile.com/node/49228 \"http://typophile.com/node/49228\")) and the pixel font here is the equivalent of that.\n\nI used the free font editor Fony. The font was set at 9 points (12 depending on dpi).\n\nPlease let me know what you think.\n\n ![](http://web.archive.org/web/20150414144255im_/http:/typophile.com/files/Test_Carpathica_Px4_5204.PNG)\n\n",
  "author": "pinguin",
  "time": "26 Sep 2008 — 11:27am",
  "uid": "35228",
  "comments": [
    {
      "time": "26 Sep 2008 — 12:24pm",
      "content": "Well, somehow you ended up with a short H, but otherwise it looks like you did all right. Maybe the space is a little wide. There are a few strange choices among the symbols, such as how the colon and semicolon don't match, and the very low-seated equal sign.\n\n"
    },
    {
      "time": "27 Sep 2008 — 10:22am",
      "content": "The space is much too wide, actually. You should probably decrease it by at least half. :)\n\n"
    },
    {
      "time": "27 Sep 2008 — 10:30am",
      "content": "Actually, when you make a pixel font you have two choices, two pixel breaks or one. If you two as we see here it looks too wide. If yo go one then then it seems too tight. The main culprit in the over wide look is the r. r c ra r anything looks too wide. It's not a monospace so loose a pixel next to the r and you should have a better look.\n\n"
    },
    {
      "time": "27 Sep 2008 — 11:27am",
      "content": "We were talking about the space (that goes between words), not the letterspacing. But that's a good point about the right sidebearing of the r, and I'd say the same of the f. In fact, for f, it could even go down to negative one.\n\n"
    }
  ]
}
