{
  "id": "49930",
  "title": "GOTHAM: Alternatives?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "So we all know and love so much this font but...\n\nIt's pricey. And sadly enough, it doesn't actually come default with any Macs that I have access too. So I was wondering: Does anyone here know of a knockoff Font, or perhaps one similar that almost always does the trick?\n\nI am quite in love with it, mind you, but at the price it's being offered at, well I simply don't have the money. (And am, again, aghast that it isn't standard on anything).\n\n",
  "author": "James Deux",
  "time": "28 Sep 2008 — 11:01am",
  "uid": "36883",
  "comments": [
    {
      "time": "28 Sep 2008 — 1:55pm",
      "content": "You're opening a can of worms by asking for a \"knockoff\" font. Something that was just released that is available in individual weights is [Museo Sans](http://web.archive.org/web/20150409035332/http:/www.myfonts.com/fonts/exljbris/museo-sans/).\n\n"
    },
    {
      "time": "28 Sep 2008 — 2:16pm",
      "content": "Gill Sans can be used to mimic the lighter weights of Gotham if your audience isn’t going to notice the difference. But just use something different and don’t run with the crowd. Just think, in a few more years everyone will be sick of Gotham and you won’t have to reprint a bunch of portfolio pieces in some other font.\n\n"
    },
    {
      "time": "28 Sep 2008 — 3:59pm",
      "content": "[Avenir](http://web.archive.org/web/20150409035332/http:/www.fontshop.com/search/?q=avenir&x=0&y=0) is another good clean sans that works well in many situations, and can be purchased in individual weights.  \nAnd fwiw some of my most \"luxe\" clients are happy to stick to [Futura](http://web.archive.org/web/20150409035332/http:/www.fontshop.com/search/?q=futura&x=0&y=0), because it has so many weights, is readily available internationally and puts on a good face.\n\nIf you're looking for \"free\" - there's always [Century Gothic](http://web.archive.org/web/20150409035332/http:/www.fontshop.com/search/?q=century+gothic&x=0&y=0), it's a good stand in for both Futura and Avant Garde when in a fix - comes standard on most computers, but only seems to have 4 weights.\n\nAnd James Puckett - so true! We all have a Gotham period in our portfolios which will be as datable as using condensed serif typefaces in the 80s.\n\n"
    },
    {
      "time": "28 Sep 2008 — 8:04pm",
      "content": "James,\n\nUnfortunately, I'm creating a Mock-Campaign Ad and I need to use Gotham because I'm mocking something set in Gotham: the Obama Biden signs.\n\n"
    },
    {
      "time": "28 Sep 2008 — 8:43pm",
      "content": "I did an Obama ad with Bitsream Gill Sans (Humanist 521) and nobody noticed. [You can get it in some weird font pack at myfonts for $30.](http://web.archive.org/web/20150409035332/http:/www.myfonts.com/fonts/bitstream/humanist-521/) The trick was to not use anything heavier than bold, only use uppercase, and work with the blue color scheme and gradients from the campaign materials.\n\nOf course it probably helped that the flyer was for a $5 fund-raiser at Gladys Knight and Ron Winan’s Fried Chicken and Waffles. If it had been a $1000-per-plate dinner I probably would have made the organizers pay for Gotham.\n\n"
    }
  ]
}
