{
  "id": "49948",
  "title": "Building a Unicase/Allcaps Opentype font with multiple alternates",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi, I have a number of questions relating to my build of a font. There seems to be many ways for me to achieve a similar final outcome and I need some advice on the best way forward.\n\nThe display font has no descenders or ascenders, however some glyphs are based on the forms of l/c letters. For this reason it could be called Unicase, however there will be no Caps version of these ’scaled up l/c glyphs’ and vice versa.\n\nFirst of all, I would like the font to display in the same way, regardless of whether the user is working in upper or lowercase - is there a way to achieve this other than repeating the glyphs in both u/c and l/c positions on the key map?\n\nSecondly, each letter has between 0 and 6 alternate glyphs which I would like to activate through OT functions, however I’m not sure which ones. They could be done as Contextual Alternates, Contextual Ligatures, Discretionary Ligatures or Stylistic sets. Some of the substitutions relate to ’serifs’ not overlapping, whereas some are purely aesthetic options. The font will initially only be used inhouse in AI and ID CS3 on Macs, so perhaps the easiest solution is best for now.\n\nAny help is greatly appreciated.\n\n [‹ Strange behaviour when selecting ot alternates.](http://web.archive.org/web/20081002010111/http:/typophile.com/node/49914 \"Go to previous forum topic\") [How to increase zoom factor in Fontlab ›](http://web.archive.org/web/20081002010111/http:/typophile.com/node/48519 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081002010111/http://typophile.com/user/34604\" title=\"View user profile.\">jake1</a>",
  "time": "<br>",
  "uid": "34604",
  "comments": [
    {
      "time": " 29.Sep.2008 3.33pm",
      "content": "Since the first post, I’ve worked a few things out.\n\nAlthough it would be great in the long term, ligatures of any sort would be a nightmare to use right now due the the huge number I would need to create.\n\nI created some of the alternates as Stylistic Sets which works fine in ID but do not seem directly accessible in AI. I guess I could live with them being accessible through the ’glyphs’ window.\n\nAnyone know another way?\n\n"
    }
  ]
}
