{
  "id": "49953",
  "title": "Petr van Blokland",
  "forum": "Home",
  "tags": [

  ],
  "content": "**[Indices](http://web.archive.org/web/20130922080810/http:/typophile.com/wiki/Indices) : [Designers](http://web.archive.org/web/20130922080810/http:/typophile.com/wiki/Designers) : Petr van Blokland**\n\nBorn in Gouda, The Netherlands, in 1956, Petr van Blokland graduated Cum Laude from the graphic arts program at the Royal Academy of Fine Arts in the Hague. He has been a freelance designer since 1980. He specializes in systematic design — typically building directories, forms systems, corporate identity programs, etc. He has taught graphic design, typography, and type design for many years at the Royal Academy of Fine Arts in The Hague and at the Academy of Fine Arts, Arnhem. His first typeface is Proforma, a large series commissioned by Purup, Danish manufacturer of forms preparation systems, now released for general use by Font Bureau. His work brought him ATypI’s coveted Charles Peignot Prize in 1988. His statements on typeface design are well-known: On Quality “The same bottomline that applies to typography also applies to typefaces: when no one notices, the aim has been accomplished.” On Experience “To be accomplished in all aspects of the design process is the fundamental demand on the designer. Experience and talent counts, not the availability of equipment.” On Digitization “By carrying out the digitization as an integral part of the design process, maximum control is exercised over the eventual reproducing of the typeface, thereby avoiding any errors of interpretation.” On New Typefaces “Why design a new typeface? After all, there are so many. There is a misconception that typefaces are not designed. They are simply here. Yet new typefaces are designed and this need is increasingly present in view of the current technological advances.”\n\n**External Links**  \n [Petr van Blokland](http://web.archive.org/web/20130922080810/http:/fontbureau.com/people/PetrvanBlokland) at the Font Bureau  \n [Petr van Blokland](http://web.archive.org/web/20130922080810/http:/www.fontshop.com/fonts/designer/petr_van_blokland/) at FontShop\n\n",
  "author": "Stephen Coles",
  "time": "28 Sep 2008 — 8:31pm",
  "uid": "103",
  "comments": [

  ]
}
