{
  "id": "49975",
  "title": "Font Manager Recommendations for OSX Leopard?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I've recently upgraded to a new MacBook Pro and Leopard this year, and Suitcase Fusion seems a bit buggier than it used to. I'm using version 12.1.7 currently...\n\nI've never really used anything but Suitcase for font management, but I'm willing to try something new. Any recommendations, or should I stick with what I'm used to? What about the native font management in Leopard?\n\nI'd love some point/counterpoint on this topic as I'm fairly ignorant on the whole subject.\n\nThanks!\n\n",
  "author": "greyjay",
  "time": "29 Sep 2008 — 12:28pm",
  "uid": "29004",
  "comments": [
    {
      "time": "29 Sep 2008 — 1:03pm",
      "content": "I understand the OSX Font Book in Leopard is much improved over earlier versions, but it is still inadequate if you have more than a handful of fonts in excess of what's bundled with the system.\n\nLinotype FontExplorer X is a very good alternative to Suitcase Fusion, and it's free!\n\n"
    },
    {
      "time": "29 Sep 2008 — 1:08pm",
      "content": "As a mac user I think Font Agent Pro rules!\n\n[http://www.insidersoftware.com/](http://web.archive.org/web/20131022050722/http:/www.insidersoftware.com/ \"http://www.insidersoftware.com/\")\n\n(I know, their site could look better, but their program are excellent)\n\nCheers\n\n"
    },
    {
      "time": "29 Sep 2008 — 1:11pm",
      "content": "I have been very happy with Font Explorer.\n\n"
    },
    {
      "time": "30 Sep 2008 — 10:52am",
      "content": "No one wants to defend Suitcase? I'll take that as a sign that I should be switching programs. I'm going to check out what Linotype has to offer, and then give Font Agent Pro a try if FontExplorer doesn't do the trick. Thanks for the input!\n\n"
    },
    {
      "time": "2 Oct 2008 — 4:43am",
      "content": "What's wrong with Font Book? Why is it inadequate? I've never had any problems with it.\n\nNick Cooke\n\n"
    },
    {
      "time": "3 Oct 2008 — 6:24am",
      "content": "I met with the developers of FontAgent Pro a couple of years ago and I was very impressed. But I haven't tried the program yet. It may very well be the answer. Short of that, the best thing to do is to petition Adobe to bring back ATM Deluxe, which has always been the best font manager out there.\n\nWhy isn't it here? What went wrong?\n\nWell, ATM Deluxe didn't sell well, that's the main problem. Is it possible it was well under 50,000 copies, or does my memory deceive? The main problem with the Mac version was that it checked and invalidated the majority of competitor Bitstream and Monotype's fonts. That this was a desperate political move to encourage designers to use only Adobe fonts might be illustrated by two facts: (1) the problem was never fixed between the first version of Deluxe for Mac, 4.0, and the last, 4.6; and (2) the invalidation trick wasn't performed in ATM for Windows -- where designers don't, by a majority, live.\n\nFor whatever reason, Adobe decided to move all ATM functionality except font management (which meant PostScript rasterization and subpixel anti-aliasing) into its apps under the once-secret codename 'CoolType'. CoolType doesn't only mean anti-aliasing; it means making every Adobe app capable of rasterizing any Adobe font regardless of the underlying operating system.\n\nYou can see that these actions came out of paranoia: that designers wouldn't primarily use Adobe fonts; that OS developers would pull the rug from under PostScript.\n\nThese fears were well-founded. What was wrong, I think, was Adobe's response. It simply wasn't necessary to pull font management out of the picture. This is something Adobe seems to understand, intuitively, better than any other company, in spite of its mishaps with font-interface strategy (MM numbers from 100 to 1000 is the best example of that).\n\nTo this day, there isn't a more reliable font manager for Vista than the old ATM for NT. OS X users deserve a chance to use Adobe's bulletproof font database programming.\n\nBy the way, the fact that ATM for NT still works under Vista means that Multiple Master fonts still work transparently in every existing application under Vista.\n\n"
    },
    {
      "time": "9 Oct 2008 — 5:28pm",
      "content": "I think Linotype Font Explorer X is phenomenal:  \n [http://www.fontexplorer.net/](http://web.archive.org/web/20131022050722/http:/www.fontexplorer.net/ \"http://www.fontexplorer.net/\")  \nA.\n\n"
    },
    {
      "time": "10 Oct 2008 — 7:25am",
      "content": "The best font management system I have found is the Finder. Now that you can preview fonts and create folders inside of the Library/Fonts folder, I simply create a \"fonts\" folder for each project and drag them in and out of Library/Fonts to install/uninstall. In my experience all font management software does is screw up my fonts folder, corrupt fonts and crash my machine.\n\n"
    },
    {
      "time": "10 Oct 2008 — 11:19am",
      "content": "Christian,\n\nI agree that with Leopard's native font previews in Finder, working with native font files without any management software is easier. This combined with Spotlight may be a reasonable working method.\n\nThe reason I love Linotype FontExplorer X is that it stores its data in a SQLite database which I can programatically access from Python. I've written a few Python scripts that use the \"Comment\" field in FontExplorer's database to store extra metadata for various fonts. Then I can use the smart sets to filter out various sets. Very practical.\n\nA.\n\n"
    },
    {
      "time": "13 Oct 2008 — 7:34am",
      "content": "Christian's solution is brilliant. Adam, if FontExplorer is using SQL, does that mean that the database is actually reliable? Christian, did you ever have problems with FontExplorer?\n\nAdam, a Fontlab-font management question: am I correct that with OS X and InDesign, if you generate a font to InDesign's font folder, you will always output the latest version?  \nWhat else do you have to do? Close active documents that use the font and open again? Does the same work in Windows? And what do you do if you are using Quark 8, Win and Mac?\n\n"
    },
    {
      "time": "4 Nov 2008 — 9:32am",
      "content": "Bill,\n\nmy FontExplorer X database currently has over 56,000 fonts and I've found it fast (definitely fastest out of all products I tested) and reliable. I've even had over 65,535 fonts and it worked.\n\nSuitcase and Font Agent Pro were horribly slow on such large databases or produced errors (started overwriting the first records in the database after indexing 65,535 fonts), while Bitstream Font Navigator for Windows was still fast but, well, had the same problem (65,535 fonts was the maximum).\n\nIf you generate the font directly into one of InDesign's or Adobe's private font folders:  \n/Applications/Adobe InDesign CS4/Fonts/  \n~/Library/Application Support/Adobe/Fonts/  \n/Library/Application Support/Adobe/Fonts/  \nthen InDesign will automatically update the font if you switch to it, even if you overwrite it. But remember not to change any family/style naming between iterations -- if you do, you should remove all the AdobeFnt\\*.lst files and relaunch InDesign, otherwise it may get confused.\n\nAdam\n\n"
    },
    {
      "time": "13 Nov 2008 — 10:18am",
      "content": "I am really glad to hear good things about Font Agent Pro because I want an alternate to Suitcase.\n\nI fully intend to go from OS 10.4 to 10.5 soon, along with a host of other software upgrades. Sometimes I feel like I'm the only one who struggles with upgrades and the ensuing disruptions they create. I am trying to keep up with the software companies but am losing the battle. As I try to keep up with Adobe and Microsoft, I really need stability in my font manager. I use Suitcase X1, which I went back to reluctantly years ago when Adobe abandoned ATM Deluxe. But Extensis is so quick to jump ahead to the next generation with Fusion 2, that I recently wrote them about my concerns regarding their Suitcase offerings for people like me who are slow to upgrade.\n\nThis was the exchange:\n\nI wrote:  \nI have slipped behind in software upgrades. I am trying to upgrade now, as much as my budget will allow for, but I see that you have already jumped to an upgrade (Fusion 2) whose minimum requirements goes past my processor capabilities and Operating System. I am currently using Suitcase X1 and would like to stay as current as I can, but my computer is a G4 and I operate on 10.4. Do you have any suggestions, or should I find another way to manage my fonts that doesn't include your software? You don't offer Fusion anymore, so what am I supposed to do?\n\nI am getting increasingly discouraged by the rash of recent software upgrades that are not backward compatible (this includes Adobe and Microsoft). I sometimes wish that software companies would realize that some of your customers are suffering hard times. I can barely afford any new upgrades, let alone new computers and operating systems. Has anyone looked at a newspaper lately?\n\nThey replied:\n\nGreetings,  \nWe have a limited amount of licensing available for Suitcase Fusion 1, but it is offered on a case by case basis. Be aware: Suitcase Fusion only supports CS2, and CS3, and Quark 6.5 and Quark 7. It also requries a 1GHz processor or better, as well as 256megs of RAM. Due to the advanced age of your hardware/ software, Suitcase Fusion may be of little or no use to you. We will also be unable to give you any sort of technical support on Suitcase Fusion as of 10/20/2008. The upgrade is fully priced at $49.98.\n\nIf you find these terms/ circumstances acceptable, please give a call at the number listed below and we will help you place an order for the previous version software. Thank you.\n\nKind Regards,  \nCustomer Service\n\nHmm. Nice. Let me think, should I buy a new computer so I can use Fusion 2? Maybe not in this economy. I think it's time to find another font manager. I'll just have to limp along with my archaic G4. Hopefully Insider Software is a little less arrogant and a little more helpful to designers like me who opt for stability rather than having the latest thing.\n\nJim\n\n"
    },
    {
      "time": "20 Nov 2008 — 2:41am",
      "content": "Well,\n\nI used FAP 3 until Fontexplorer appeared. It was the Fontmanager I was waiting for. It worked like a charm in Tiger, but since upgrading to Leopard I encountered some problems.  \n- System font activation status isn't always up to date. I manage my System fonts with fontbook, but Fontexplorer doesn't recognize the status of the fonts in Fontbook.  \n- With every restart, I have to \"refresh fonts\" to activate all the fonts that were activated before the restart. If you don't do this before starting an CS-app, you're screwed. You'll have to activate all your fonts again by hand. Annoying.  \n- It crashes now and then (but keeps running, funny)  \n- it takes a long time until they have updated PlugIns (Suitcase Fusion 2 has the CS4 plugins). I would like to update to CS4 this year, but I know the CS4-plugins for Fontexplorer won't be released until Q1 next year…\n\nAnd I love to see a Support Forum that's moderated by Linotype itself. But it's a free application, so maybe that's not possible (altough I would gladly pay for this kind of app).\n\n@Hanneman: Despite my problems in Leopard, I think Fontexplorer is a very good (maybe the best) & cheap choice as fontmanager in 10.4\n\nHas anybody tried Suitcase Fusion 2 (Mac) yet? Is it worth it's money?\n\nlettertiep\n\n"
    }
  ]
}
