{
  "id": "50004",
  "title": "DIY Dry transfer rub downs?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I woke up today with vague recollections that there was some kind of kit available for making one's own dry transfer rub down graphics. I'm not sure if it was a sort of photographic process or if it used copier/laser printer technology or some other common studio machine. It could have even been a way to make wet transfer decals, like those found in model kits.\n\nDoes anyone know the details of such a material or process, or did I just dream it?  \nPerhaps there is a service that will make them inexpensively nowadays.\n\n",
  "author": "cuttlefish",
  "time": "30 Sep 2008 — 10:31am",
  "uid": "14556",
  "comments": [
    {
      "time": "30 Sep 2008 — 11:23am",
      "content": "How big an image do you need?\n\nMichael\n\n"
    },
    {
      "time": "30 Sep 2008 — 11:51am",
      "content": "Never mind the size (I was going to suggest something else), you may want to contact these people.\n\n[http://www.ambientgraphics.net/](http://web.archive.org/web/20130612011016/http:/www.ambientgraphics.net/ \"http://www.ambientgraphics.net/\")\n\nMichael\n\n"
    },
    {
      "time": "30 Sep 2008 — 11:56am",
      "content": "I don't have an immediate need, just trying to confirm my suspicions. Thanks for the link.\n\nI'm just sure there was a home and/or studio kit to make these by yourself at one time.\n\n"
    },
    {
      "time": "30 Sep 2008 — 12:26pm",
      "content": "I was also looking through my model train magazines. There is a \"paper\" that you can buy that will do transfers but I cannot find the supplier. There are however companies who will do custon transfers ... as in models. If you need those sites let me know.\n\nMichael\n\n"
    },
    {
      "time": "30 Sep 2008 — 1:26pm",
      "content": "Again, no immediate need here, but any information would be useful for future reference, and maybe help someone else out too.\n\n"
    }
  ]
}
