{
  "id": "50015",
  "title": "Galaxie Polaris V3 + Condensed / Buttoned up / 2008.09.30",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Hi!  \nBest wishes from Brooklyn; we can see Wall Street from here, and it's a mess!\n\nWe have two new releases - actually, one update and one new release. And we'd like to get a little political.\n\n/ / / / /\n\nNew release: Galaxie Polaris V3 + Galaxie Polaris Condensed\n\nFinally, our popular Polaris family has three things people have been asking for: small caps, Cyrillics, and a condensed complement.\n\nVersion 3 of Galaxie Polaris features some small but important improvements and adds small caps (with its own specific punctuation) and Cyrillic script support.\n\nGalaxie Polaris Condensed was started in 2005, used for a conference identity program in 2007, and completed in 2008 for use by the Alliance for Climate Protection. (We also created a special version of Galaxie Polaris Bold for the Alliance, which can be seen in the group's WeCanSolveIt advertising.)\n\nWe are offering a special upgrade price for existing licensees: Galaxie Polaris V3 plus Condensed for US$149.\n\n[http://vllg.com/Village/GalaxiePolaris/mudTyper+Weights/](http://web.archive.org/web/20141114142525/http:/vllg.com/Village/GalaxiePolaris/mudTyper+Weights/ \"http://vllg.com/Village/GalaxiePolaris/mudTyper+Weights/\")  \n+  \n [http://vllg.com/Village/GalaxiePolarisCondensed/mudTyper+Weights/](http://web.archive.org/web/20141114142525/http:/vllg.com/Village/GalaxiePolarisCondensed/mudTyper+Weights/ \"http://vllg.com/Village/GalaxiePolarisCondensed/mudTyper+Weights/\")\n\n/ / / / /\n\nObama buttons\n\nWith 5 weeks until Election Day here in the US, it is imperative that all eligible voters register to vote. And - sorry Republicans - vote for Barack Obama. He is a dream come true: a thoughtful, intelligent, energetic leader; a constitutional law expert who will do what's best for his country, not his cronies.\n\nWe have designed and produced a set of Obama Heart buttons. We love hearts and we love Obama. The buttons are US$10 within the US, and we are shipping sets out daily for quick delivery.\n\n[http://vllg.com/products/Village/Obamabuttons/](http://web.archive.org/web/20141114142525/http:/vllg.com/products/Village/Obamabuttons/ \"http://vllg.com/products/Village/Obamabuttons/\")\n\n/ / / / /\n\nThanks again.\n\nChester & Tracy Jenkins  \nVillage  \n206 Front Street #4A  \nBrooklyn, NY 11201\n\ntelephone ++1 718 852 1005  \nfax ++1 718 852 1006\n\n[http://vllg.com/](http://web.archive.org/web/20141114142525/http:/vllg.com/ \"http://vllg.com/\") / / / / / / / / / / / / / / / / / / / / / /\n\nPS: To our Republican friends... It's not you, it's your candidates. They frighten us.\n\n",
  "author": "paul d hunt",
  "time": "30 Sep 2008 — 3:12pm",
  "uid": "7006",
  "comments": [

  ]
}
