{
  "id": "50024",
  "title": "New Brand ID - Feel free to tear into this one!",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi, My first post. This is a new idea and personal project I’m working on for a designers creative resource. I’m really not good at designing for myself and get in a rut after a while trying. This web site will include podcast, articles, tutorials or anything to inspire other designers. Also what do you think of this idea, do we really need another website out there? Is this different enough? Honest feedback wanted here on the brand, colors and look please. Feel free to tear into this one if you see issues. Thank you in advance for your constructive criticism.\n\nKind Regards\n\nDA\n\n[http://geocities.com/lyletrush2001/creative-revelation-logo.jpg](http://web.archive.org/web/20081206012945/http:/geocities.com/lyletrush2001/creative-revelation-logo.jpg \"http://geocities.com/lyletrush2001/creative-revelation-logo.jpg\")\n\nP.S. I was trying to embed the image inside the source of the HTML here but I could not. I’m not much of html or coder person.\n\n| Attachment | Size |\n| --- | --- |\n| [Creative-Revelation-Logo.jpg](http://web.archive.org/web/20081206012945/http:/typophile.com/files/Creative-Revelation-Logo.jpg) | 52.21 KB |\n\n [‹ crit for a logotype](http://web.archive.org/web/20081206012945/http:/typophile.com/node/48336 \"Go to previous forum topic\") [New Corp Logo and typeface ›](http://web.archive.org/web/20081206012945/http:/typophile.com/node/50203 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081206012945/http://typophile.com/user/28799\" title=\"View user profile.\">DigitalArtistry</a>",
  "time": "<br>",
  "uid": "28799",
  "comments": [
    {
      "time": " 1.Oct.2008 2.05am",
      "content": "Hi,\n\nDon’t spark and ignite mean more or less the same thing here? Creativity has only one e.\n\nNot sure about the colours – they’re fairly low-contrast on white.\n\nI don’t think it says ’revelation’. In fact it looks more like revolution.\n\nA revelation is an unveiling, an exceptional disclosure even. I don’t think your mark reflects this.\n\nCheers,  \nRoss\n\n"
    },
    {
      "time": " 1.Oct.2008 4.38am",
      "content": "If this is a project is something you are determined to pursue further, then I highly recommend looking at what else is already out there. Your website will need to fill a need that isn’t already available (or at least percieved as not already available). To simply offer similar things that another website successfully provides will fail to generate sustained interest in your website.\n\n———————————-  \nMichael Browers  \n [www.michaelbrowers.com](http://web.archive.org/web/20081206012945/http:/www.michaelbrowers.com/ \"www.michaelbrowers.com\")\n\n"
    },
    {
      "time": " 2.Oct.2008 3.59pm",
      "content": "I agree with your comments, thank you. :) Everyone seems to have similar feedback. I’m really not good at doing design for my own stuff. I don’t know why that is... I’ll keep this post up to date, thanks again.\n\n"
    },
    {
      "time": " 2.Oct.2008 7.30pm",
      "content": "it’s very generic.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081206012945/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 6.Oct.2008 6.16pm",
      "content": "feedback needed. this is for a personal fun podcast project and nothing to serious but this should be appealing. : [http://geocities.com/lyletrush2001/creative-revelation-2.jpg](http://web.archive.org/web/20081206012945/http:/geocities.com/lyletrush2001/creative-revelation-2.jpg \"http://geocities.com/lyletrush2001/creative-revelation-2.jpg\")\n\n"
    },
    {
      "time": " 7.Oct.2008 9.31pm",
      "content": "I have an update\n\n ![](http://web.archive.org/web/20081206012945im_/http:/typophile.com/files/creative_revelation_6574.jpg)\n\n"
    },
    {
      "time": " 7.Oct.2008 9.40pm",
      "content": "another variation:\n\n ![](http://web.archive.org/web/20081206012945im_/http:/typophile.com/files/creative_revelation-Logo4_6450.jpg)\n\n"
    },
    {
      "time": " 8.Oct.2008 9.51am",
      "content": "_it’s very generic._\n\npenn\n\n"
    },
    {
      "time": " 8.Oct.2008 10.28pm",
      "content": "Thank you PenANDink, Finlay it’s been over 40 hours or more! many late nights and all this while holding a full time design job. So I think I got it this time. Now I have to move on the website and actual production of the vodcast. Thank you very much, feedback is still welcome, I will still be tweaking but moving on. Like I said it’s very hard to be a designer and the client at the sometime but your feedback has really helped me out with that block. This has evolved from something that was way off track into something I can be kind of happy with. Peace to you!\n\n ![](http://web.archive.org/web/20081206012945im_/http:/typophile.com/files/creative-revelation-logo_4126.jpg)\n\n"
    },
    {
      "time": " 11.Oct.2008 1.45am",
      "content": "Maybe it is the colours or the names but this has a religious feel. I cannot see the point of the little flick on the v – it affects the kerning of iv, perhaps you will need to kern out the other characters, which might work with the tracking on Revelation, the split-C really reminds me of something I cannot bring to mind at the moment, but, especially with the gradient, it renders the C less legible.\n\nI am afraid that the second iteration is a step back from the first. Personally in this situation (designing for designers) I default to as simple as possible – no icon, simple type, simple alignment, single colour – as basic as basic gets, but getting the choice of typeface and the kerning spot on.\n\nTim\n\n"
    },
    {
      "time": " 11.Oct.2008 2.58pm",
      "content": "Maybe the religious touch is created by the round gradient - “beginning to see the light” - in combination with the purple.\n\n"
    }
  ]
}
