{
  "id": "50028",
  "title": "What font is this ???",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Anyone know what font this is, i think the word carpets is set in the real letterfont.\n\nKind regards Rene\n\n ![](http://web.archive.org/web/20081119080312im_/http:/www.typophile.com/files/STGfont_4898)\n\n [‹ Typeface ID - TRS Logo](http://web.archive.org/web/20081119080312/http:/www.typophile.com/node/50128 \"Go to previous forum topic\") [Need font ID in a hurry please! ›](http://web.archive.org/web/20081119080312/http:/www.typophile.com/node/50137 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119080312/http://www.typophile.com/user/37516\" title=\"View user profile.\">winnetou</a>",
  "time": "<br>",
  "uid": "37516",
  "comments": [
    {
      "time": " 1.Oct.2008 2.30pm",
      "content": "Rene, I’m surprised that no one has tried to answer this one. I thought it looked like something I had seen, but just couldn’t recall where. The strong diagonal stress of the C, G and presumably the O, should ring some bells for someone here. I have a feeling that this is an old font that has been in a lot of budget collections, but is not offered by any major foundry. Something like Opti or Brendel perhaps, but not places that design their own fonts.\n\nAny ideas?\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 2.Oct.2008 7.24am",
      "content": "(bump) Mike F or Angel?\n\nI’m sure this is out there somewhere. I couldn’t find it a Dafont, and for some reason I also thought T-26, but it wasn’t among the T-26 collection at MyFonts.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 2.Oct.2008 11.44pm",
      "content": "Mike, tnx for searching. Also looked at Dafont and some other fontsites, but no.. cant find it.  \nFor this moment im using a different font for the word Carpets and the STG i just drawn in Illustrator.  \nStill looking for it, because its a beauty ;) Tnx again.\n\nRene\n\n"
    },
    {
      "time": " 3.Oct.2008 8.26am",
      "content": "René, I thought this reminded me of [Romic](http://web.archive.org/web/20081119080312/http:/www.myfonts.com/fonts/efscangraphic/romic-sh/) in a heavy weight, but that is the closest in appearance that I have been able to locate.\n\nI still think I have seen this before, but I searched Veer (no luck), T-26 at their site (no luck), the Solotype Catalog (no luck), and even the old Precision Type catalog — nothing.\n\nI know this one is going to make me crazy, because I think it is a font, and I think I have seen it before, but I am running out of ideas where to search for it.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 3.Oct.2008 10.50am",
      "content": "Sorry. Romic was the face that came immediately to mind. When that proved way off, I jumped to Seagull. Nope. From there, I too went through the Solotype Catalog, then the 8th VGC Catalog and the Phil’s Fonts catalog. I don’t have a Letraset catalog and, so, am out of ideas.\n\nI share your frustration, Mike. It looks like something I should know, but ...\n\n"
    },
    {
      "time": " 3.Oct.2008 12.58pm",
      "content": "I just looked through the 1985 Letraset catalogue. The closest I could find was Romic (as previously mentioned) and Le Robur Noir, which has a similar ’A’ but is more rounded overall.\n\n- Lex\n\n"
    },
    {
      "time": " 3.Oct.2008 1.41pm",
      "content": "Thanks Mike & Lex for looking. I am starting to get crazy enough that I was looking to see if there was a way to modify the C and G in [Korinna](http://web.archive.org/web/20081119080312/http:/www.myfonts.com/fonts/adobe/itc-korinna/), and modify other letters from that font to make something similar to this. I think there are some heavier weight versions by other names in the Brendel & FontBank collections, but I don’t have time at the moment to play around with this. If I had to re-create this from another font, I think I might try it that way, but it could get ugly.\n\n- Mike Yanega\n\n"
    }
  ]
}
