{
  "id": "50026",
  "title": "Reprinting ATF specimen pages, copyright, and fair use",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m trying to figure out some details regarding getting permission to an image of a page from the 1934 ATF specimen in a revival of a typeface. First, is there even anyone to get permission from? Second, has anyone ever checked to see if ATF even bothered to renew the copyrights for it’s books? Last, I feel that if I reprint a single page for the purpose of comparing letters on it with a revival I’m covered under fair use. Does anyone disagree?\n\n [‹ dutch typefaces](http://web.archive.org/web/20081206012949/http:/typophile.com/node/49943 \"Go to previous forum topic\") [[calligraphy] Five From Four exhibition ›](http://web.archive.org/web/20081206012949/http:/typophile.com/node/50032 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081206012949/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 1.Oct.2008 12.18am",
      "content": "I think this is a perfect case of fair use. You’ll be copying one page, the copying will not affect the sales of the remnants of ATF. If this is a noncommercial, educational work, it’s even better.\n\nGo [here](http://web.archive.org/web/20081206012949/http:/en.wikipedia.org/wiki/Fair_use) for details.\n\nConsidering how unpredictable the courts are in judging cases of copyright infringement, many publishers ignore the fair use option and just don’t print things for which permission was not granted even if they perfectly meet fair use criteria.\n\n"
    },
    {
      "time": " 1.Oct.2008 3.53am",
      "content": "For works created before Jan 1978, the maximum duration for U.S. copyright protection is 75 years from date of publication, assuming all renewals were filed in a timely fashion.\n\nSo, for the 1934 ATF specimen, if you wait a couple more months to publish your comparison, you’re home free. Fair use or not. ;-)\n\n— K.\n\n"
    },
    {
      "time": " 1.Oct.2008 7.14am",
      "content": "I am not an expert of US copyright law, but I know from German copyright law that copyright period calculations are often tricky. As regards the calculations by Mr. Kentlaw concerning pre-1978-US-works it seems to me that his calculations are not correct.\n\nsee [http://www.copyright.gov/circs/circ15a.pdf](http://web.archive.org/web/20081206012949/http:/www.copyright.gov/circs/circ15a.pdf \"http://www.copyright.gov/circs/circ15a.pdf\")\n\nFurthermore, calculations start on the 1st of January of the following year, so that the work (given that Mr. Kentlaw’s assumptions are correct) would fall into public domain on the 1st of January, 2010.\n\n"
    },
    {
      "time": " 1.Oct.2008 10.26am",
      "content": "Ah yes, right. I believe it was the so-called “Mickey Mouse” statute of 1998 that extended the second term by another 20 years. The copyright reference that I generally use is from 1997, so I’d forgotten about that.\n\nJames, I guess you’ve got to wait another 20 years before you’re in the clear (thanks to Sonny Bono). Assuming that ATF renewed the copyright in 1962, that is.\n\nAll of this sidesteps the question of whether what’s being proposed is fair use. Which it very well might be. But I am not a lawyer and would not presume to advise in this regard.\n\n— K.\n\n"
    },
    {
      "time": " 1.Oct.2008 12.36pm",
      "content": "I think that I’m going to assume that first, it’s fair use and second, that even if someone does own the copyrights to the ATF specimen books, it’s probably been forgotten and the paperwork is in a warehouse that would cost more to dig through than anyone could sue me for.\n\n"
    },
    {
      "time": " 1.Oct.2008 4.28pm",
      "content": "You can probably get correct information about the status of the old books from the Attorney for the surviving owner of Kingsley which did own the rights to all ATF IP.\n\nThe Attorney’s name is Mark A. Lester, Los Angeles, CA. You should be able to locate him through Directory Assistance.\n\nGood luck and let us know what you find out.\n\n"
    },
    {
      "time": " 1.Oct.2008 4.29pm",
      "content": "Thanks, Majus, I’ll track him down.\n\n"
    },
    {
      "time": " 1.Oct.2008 11.58pm",
      "content": "The copyright on the 1934 work is long expired and cannot be renewed.\n\nWhen ATF was auctioned off, the name and all rights associated with it went up for bid. Despite all the tear shedding one reads about this auction, it is my understanding that NO ONE bid on the rights. Kingsley’s digital font realm dissolved some time before the auction of the physical plant itself. There may be trademark rights etc still valid for licensing purposes but you are free and clear to reproduce whatever you want from the 1934 specimen catalog. My god, the BB&S catalog is completely digitized and available on ebay for $25.\n\nGerald\n\n"
    }
  ]
}
