{
  "id": "50057",
  "title": "Well known logotypes",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello everyone, my first post here...\n\nI’m trying to pull some research together for a college project, and was wondering what people would consider to be well executed, and/or well known logotypes. I was thinking along the lines of avant garde, coca-cola and fedex, can people think of anything else?\n\nYour help would be greatly appreciated!\n\n [‹ Im New to this](http://web.archive.org/web/20081010003702/http:/typophile.com/node/50253 \"Go to previous forum topic\") [Logo type suggestion (friendly, playful, readable) ›](http://web.archive.org/web/20081010003702/http:/typophile.com/node/50138 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081010003702/http://typophile.com/user/24312\" title=\"View user profile.\">Merlin</a>",
  "time": "<br>",
  "uid": "24312",
  "comments": [
    {
      "time": " 1.Oct.2008 5.07pm",
      "content": "xerox, IBM, hp, EPSON, UPS, IKEA, VW, Canon, LEGO  \nall your television channels have ’em...\n\nthere are many many more, just google ’logo’, ’logotype’ and you will find lots. it’s really quite easy\n\n"
    },
    {
      "time": " 1.Oct.2008 11.39pm",
      "content": "You could start with what Interbrand/Businessweek ’reasearched’ as the ’ [Best Global Brands 2008](http://web.archive.org/web/20081010003702/http:/www.interbrand.com/best_global_brands.aspx?langid=1000)’. _(Rest assured that most people will recognize and know most of these.)_\n\nAs for well executed thats a matter of _(personal)_ taste and not merely success as a brand, me thinks. ;) _(You may find a lot of what I would call well executed logos at [Behance](http://web.archive.org/web/20081010003702/http:/www.behance.net/), or [FFFFound](http://web.archive.org/web/20081010003702/http:/www.ffffound.com/).)_ As for really, really great identities you may have to step back in time, as the minimal, one-colour logotypes of the 80’s and beginning 90’s are way better than the shiny, glossy, bevely, 3dy stuff that’s so hyped today.\n\nDav\n\n"
    },
    {
      "time": " 2.Oct.2008 9.11am",
      "content": "[Golden Brands](http://web.archive.org/web/20081010003702/http:/www.50goldenbrands.com/)\n\nThat might help.\n\n"
    },
    {
      "time": " 4.Oct.2008 3.43pm",
      "content": "Thanks alot!\n\n"
    },
    {
      "time": " 5.Oct.2008 5.47am",
      "content": "Well, based on frequency of occurrence, I’d say \\*We\\*, followed by \\*Ve\\*. But T, V, and W with all the lower-case vowels were important. There were a lot of logotypes — look at the list for Linotype Caslon.\n\nOr did you mean type used for logos?\n\n"
    },
    {
      "time": " 5.Oct.2008 3.59pm",
      "content": "Charles\n\nSorry, I was under the impression that a logotype was a logo solely comprised of type, such as the examples I gave? Is what you’re talking about not referred to as a glyph?\n\n"
    },
    {
      "time": " 6.Oct.2008 6.37am",
      "content": "The term “glyph” came about in the late 1990s I believe. It means something like “sort,” but does not have quite the same connotations. In modern (Unicode) usage, a Greek capital “Alpha” can be the same “glyph” as Latin capital “A”, but they are different characters. It would be odd to use the term “sort” here; the notion of having both Greek and Latin in a single metal font would be unusual. Caslon Greek would be thought of as a different font in the old days (“old” meaning before the 1990s). In type cases, they would be thought of as different sorts only because they would be in different cases. But if you ran out of \\*A’s\\*, you could use an \\*Alpha\\* & not loose meaning.\n\nAnd while all logotypes are sorts, not all sorts are logotypes. “Sort” doesn’t specify what is unique about logotypes (two letters on one body). It would be the same as saying we don’t need the term “ligature”, because “sort” or “glyph” is sufficient. (see note)\n\nBy the way, there were logotypes in systems other than Linotype. With foundry type, a Q with a long tail required a “Qu” logotype.\n\nIt may be that in the past few years “logotype” has come to mean a logo consisting only of type, I don’t know. While words can change meanings even in formal usage, that would seem to be a bit far. Sort of like expecting everybody to know what “dudine” means.\n\n(note): A “ligature” means tied letters; by extension, used where elements of the two letters touch, such as the glyphs \\*fb\\*, \\*fk\\*, etc. The individual characters in logotypes (old usage) were not tied; nothing touched, hence not “ligatures.”\n\n"
    },
    {
      "time": " 6.Oct.2008 7.15am",
      "content": "In addition to the two-letter sorts that Charles has explained, I believe that “logotype” also referred to catchphrases and other complete words set as a single metal sort. (Hence the derivation of the term.) A printer’s glossary I have from 1924 gives the definition: “Logotype — Two or more letters, or a whole word, cast on one body.”\n\nIn some cases, a company would have had it’s name specially cast up as a single sort, perhaps in a variety of sizes, to facilitate the setting of advertising material, especially once the practice of custom, identifying marks became a common part of business practice. This might have been more frequently a zinc etching rather than a proper type-metal sort, but I think the term was still applied.\n\nI believe that’s how we’ve inherited the usage that is pretty common today, where a company’s distinguishing wordmark is referred to as a logotype.\n\n— Kent.\n\n"
    },
    {
      "time": " 6.Oct.2008 7.24am",
      "content": "All about “Law-guh-types”:\n\n[http://www.youtube.com/watch?v=GZ0W-\\_9gTH8](http://web.archive.org/web/20081010003702/http:/www.youtube.com/watch?v=GZ0W-_9gTH8 \"http://www.youtube.com/watch?v=GZ0W-\\_9gTH8\")\n\n"
    },
    {
      "time": " 6.Oct.2008 7.52am",
      "content": "OK, Kent, makes sense.\n\nI watched the clip, & seems like “logotypes” are not limited to just letters anymore.\n\nNext you’ll be telling me that “branding” isn’t something you do with a hot iron.\n\n"
    },
    {
      "time": " 7.Oct.2008 11.11am",
      "content": "C’mon, Charles: stop playing the old fart game. I’m just as well-qualified as you are to do that, but I know it won’t fly here.\n\nIf you can prove to me that you did not, until this discussion, know that “logo” and “logotype” mean (and have meant for many years) “distinguishing wordmark,” well . . . I’ll eat that old can of rubber cement that I’m sure is sitting on a back shelf in your typesetting shop.\n\npowers\n\n"
    },
    {
      "time": " 7.Oct.2008 7.08pm",
      "content": "Hard to prove a negative Will. Best I could do is to have you look on page 63 of the <cite>Glossary of Typesetting Terms</cite>. I believe I wrote that one. You’re safe, though. We may still have some wax around, but I always hated rubber cement.\n\nSeriously, I’m not going to tell half-truths on the Typophile forum. Had I known the advertizing zinks were termed “logotypes” the same as the two or three-character Linotype mats, I’d have said so.\n\n"
    }
  ]
}
