{
  "id": "50066",
  "title": "Using Adobe Thai Font in InDesign",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi Folks,\n\nDoes anyone have any experience with using Adobe Thai Font in InDesign (CS3)?\n\nI have to copy text from a PDF document into InDesign, in order to be able to move around some text. The problem is, that I cannot get Adobe Thai Font to work properly (that is to show the proper Thai characters/signs).\n\nCan anyone help me?\n\nKind Regards  \nAnne\n\n",
  "author": "asha00",
  "time": "2 Oct 2008 — 12:52am",
  "uid": "37572",
  "comments": [
    {
      "time": "2 Oct 2008 — 1:57am",
      "content": "Where did you get an Adobe Thai font? How old is it?\n\nProper Thai fonts today, to operate correctly in Adobe InDesign CS/3 require to be encoded in Unicode.\n\nIf the font is encoded in Unicode, it should recognize all Thai characters correctly.\n\nVery old fonts, even in early PostScript or TrueType font formats, were not encoded in Unicode. As a result, they will not behave correctly.\n\n\"Smart\" OpenType fonts, if programmed intelligently, will not only treat Thai text encoded in Unicode correctly, but will also make \"intelligwnt\" contextual changes of certain Thai characters, such as switching one letter with a average character height, for another alternative character with a higher than average character height.\n\nI am unaware if any \"smart\" OpenType Thai fonts are available, but I know my friends at FontWorld ( [www.fontworld.com](http://web.archive.org/web/20130317122904/http:/www.fontworld.com/ \"www.fontworld.com\")) are working on releasing a package early next year.\n\n"
    },
    {
      "time": "2 Oct 2008 — 2:10am",
      "content": "I got the Adobe Thai Font from Adobes online store about 3 weeks ago. How do I find out whether the font is encoded in Unicode?\n\n"
    },
    {
      "time": "2 Oct 2008 — 3:02am",
      "content": "I would send them an email, with a copy to Adobe's Type Development Department. Besides the encoding question, describe the problem of copying Thai text from the PDF.\n\n===\n\nIt is very likely that if Adobe sold it recently, it is encoded properly with Unicode, as Unicode has been supported by Adobe for many many years.\n\nThere is also the very likely possibility that the text that you copied from the PDF appeared as Thai, but was encoded in some wierd non-standard way from a long time ago.\n\nThe PDF format has been around for a long time.\n\nBefore text was encoded in Unicode, there were many non-standard ways of encoding text for Thai and other non-Latin languages.\n\nIf this is the case, there are two options.\n\nA) If it's a small amount of text, then the text must be retyped using a font which was encoded in Unicode.\n\nB) If it's a large amount of text, such as page after page after page, then a simple text conversion program must be written or acquired, to convert the old text into the new Unicode text.\n\n"
    },
    {
      "time": "2 Oct 2008 — 3:43am",
      "content": "Thanks a lot for your help.\n\nI have already been in contact with Adobe Support who was not able to help me.\n\nI have to find an almost permanent solution, as this also can be a problem in the future.\n\nBut again - thanks a lot for your time.\n\n"
    },
    {
      "time": "2 Oct 2008 — 3:57am",
      "content": "You're welcome.\n\nIt seems for sure that the data in the PDF and others like it were created either a long time ago, or with non-standard Thai fonts.\n\n(I know about this issue with Thai, as I have dealt with these issues in many languages over the past two decades. It's a real nightmere. Unicode aims to correct the problem for now and the future. The problem that you are facing is with the old data.)\n\nTo create a workable data conversion program, you need to know the old Thai encoding for each character, or to obtain a copy of the old Thai font which was used to create the files and the PDF. Can you gwet hold of either this information, or one of the old Thai fonts which were used? (Different Thai fonts may have been used by different people, creating the need for different conversion tables in the data conversion program.)\n\nThere was a program called \"Add/Strip\" on Apple Macintosh to create such a program. I am certain that there are similar programs on Windows. Contact FontWorld ( [www.fontworld.com](http://web.archive.org/web/20130317122904/http:/www.fontworld.com/ \"www.fontworld.com\"), if you seek a custom solution - they have been doing this stuff for manty years).\n\n"
    },
    {
      "time": "2 Oct 2008 — 4:30pm",
      "content": "You can use Adobe Thai in InDesign CS3, with a couple of caveats, but it is important that you set the language of the text to [No language] for spellchecking etc. purposes. InDesign does not support Thai text beyond basic layout: no spellchecker, no hyphenation dictionary, etc. For some reason, the layout only works if the language is set to [No language].\n\nI'd say that about 99% of Thai layout works correctly in InDesign CS3. The thing that doesn't work is decomposition of the sara am vowel, which causes mark collisions when the preceding letter also takes a tone accent. There are manual ways to fix this, but these involve editing the text string, so are far from ideal.\n\n"
    },
    {
      "time": "2 Oct 2008 — 4:32pm",
      "content": "Israel, the Adobe Thai fonts are CFF OpenType, Unicode encoded. I know, because I made them. :)\n\nThere are a number of other OpenType Thai fonts available, including the classic Linotype Sukothai and Sirichana designs (the latter partly redesigned).\n\n"
    }
  ]
}
