{
  "id": "50094",
  "title": "Logo and primary typography",
  "forum": "Design",
  "tags": [

  ],
  "content": "If I choose one typeface for a logo should the typeface used for all the print materials like brochures for eg.(bodytext and headlines)be from a different typeface family or it doesn’t matter? If it matters, why is that so?\n\n [‹ Lucida Grande and Optima for web](http://web.archive.org/web/20081121143829/http:/typophile.com/node/49924 \"Go to previous forum topic\") [Vista sans with Garamond or Minion? ›](http://web.archive.org/web/20081121143829/http:/typophile.com/node/50119 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121143829/http://typophile.com/user/37425\" title=\"View user profile.\">felixana</a>",
  "time": "<br>",
  "uid": "37425",
  "comments": [
    {
      "time": " 2.Oct.2008 2.08pm",
      "content": "It is all about context. If the typeface you’ve chose for the logotype is very strong then using something different is a good way to balance and not overpower. If the typeface is subtle it is ok to use the same typeface. Or, you can really mix it up and do the opposite. It all depends upon the message you are trying to convey.\n\n"
    },
    {
      "time": " 2.Oct.2008 3.23pm",
      "content": "If your logo and its typeface are distinctive, there are compelling reasons NOT to use the face any place else. To do so merely dilutes the distinctiveness.\n\nAs Miss Tiffany suggests: it’s all a matter of context, ifs, and depends.\n\n"
    },
    {
      "time": " 3.Oct.2008 5.49am",
      "content": "LOGOTYPE should be more towards legibility and headline/bodytext type should be more towards readability.\n\nSo, I think you should use different type for headlines and body text, otherwise the logo will become like one big headline only.\n\nBut the style and family of type shouldn’t change too dramatically. For instance, if logotype belongs to some Roman Serif font, then you can use a simplified serif one for your Headlines and so on....\n\nNITIN GARG | India\n\n"
    },
    {
      "time": " 3.Oct.2008 6.29am",
      "content": "OK, but how about if I use Vista Sans alt bold for a logo  \nand then take Vista sans regular (not alt) for headlines...and some matching serif type for bodytext? Would that be a crime?\n\n"
    },
    {
      "time": " 3.Oct.2008 9.42am",
      "content": "Vista Sans Alt has clearly differentiable characteristics than Vista Sans Regular, but they still go in harmony.\n\nI find this as a good solution.\n\nNITIN GARG | India\n\n"
    }
  ]
}
