{
  "id": "501",
  "title": "Playford",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hi there, this is my attempt at a geometric sans with varying stroke width. the second 'a' and 'k' are alternative ideas.   \n   \nthe rest of the set (numbers, caps et al)to come.   \n   \napologies for the large and artefact-y sample.   \n   \nany comments welcome.   \n   \nta, geraint   \n   \n ![playford lc](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/12399.jpg)\n\n",
  "author": "geraintf",
  "time": "1 Jul 2003 — 12:29pm",
  "uid": "868",
  "comments": [
    {
      "time": "3 Jul 2003 — 5:50pm",
      "content": "Hi Geraint , This reminds me of a more artistic expression of Barry Deck's Eunuverse which I really like. First thing that strikes me is the name, why call it a Franklin? It does not seem like a Franklin. I think it is great that you are starting from sketches, a lot can be explored with pen and ink. To take this to the next level consider end user. Are you going to make a Family or just a single weight/style. The widths are very broad on forms with curves and rather narrow on the rest, I think we may have a problem here with legibility, especially in text settings. The \"a\"s are designs similar to what I in the past have seen in Gaelic fonts but here the glyph is an \"a\", and it is a \"d\" in Gaelic fonts.Interesting. The \"s\" seems to small. Best glyphs are the g, h, j, k, t, x, y. Will you make stems the same or is it intentional that some a wider than others and some straight and others with curves (ie. m is straight, r is curved) Soft curves are nice and organic, I do this a lot in my own type designs, but perhaps this trend is coming towards an end.\n\n"
    },
    {
      "time": "4 Jul 2003 — 2:17am",
      "content": "hey ole,   \n   \nthanks for your comments. my first font, my first critique!   \nyou flatter me with the eunuverse comparison, tho ![:-)](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nthe name is playford, and i think its the best thing about the font!   \nmessers playford, bell and myself, franklin, are friends;   \ni thought playford was perhaps feeling a bit left out not having a face bearing his name ![:-)](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nmy family plan (crikey that sounds a bit scary) is to have two weights,   \none for reading extended text, and one for display applications. (perhaps playford display / playford read).   \nthis is the display version - much lighter, more contrast, and with features that emerge at larger point sizes.   \nthats the intention anyway.   \n   \nthe stem thickness \\*should\\* be uniform - that fact that they're not is down to my inconsistancy and bad draughting skills.   \nthe idea was that the stems width should equal the widest part of the curved forms.   \n   \nas far as the tapers go on the stems, the idea was to have one side tapered (maybe the internal edge), one side straight.   \nso i need to go back and redraw a whole bunch of these glyphs. not all, tho;   \ni don't have a problem with a mixture of curved and straight forms.   \n   \na - yes, my thoughts exactly.   \nis it too close to a d?   \nperhaps i should set some text to get the context.   \nthe a was the first glyph to be drawn.   \n   \nok, perhaps some uc&lc numerals will smoke out some more crits... worth a try;)   \n   \n ![numerals](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/12504.jpg)\n\n"
    },
    {
      "time": "10 Jul 2003 — 1:39am",
      "content": "here is the upper case...   \n   \napologies for the fact that the images are at different scales. i hope to get a pdf of the character set up soon.   \n   \nalso, stay tuned for a glyph comparison of the two weights   \n ![](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/12742.gif)\n\n"
    },
    {
      "time": "10 Jul 2003 — 2:18am",
      "content": "[a small sample to give an idea of the uc and lc together. apologies for the spacing issues.]   \n   \nas always, all comments welcome, the harsher the better ![:-)](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n ![playford display caps](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/12745.gif)\n\n"
    },
    {
      "time": "11 Jul 2003 — 2:42am",
      "content": "ahem, i've just noticed my lining numerals are too small!   \nthey should match the cap height rather than the x height...   \ni will redraw them.   \nas for the 'x-height numberals', could i recycle/rescale them to make lining tabular numberals?\n\n"
    },
    {
      "time": "11 Jul 2003 — 2:56am",
      "content": "Or use them for your caps.   \n   \n--jacques\n\n"
    },
    {
      "time": "11 Jul 2003 — 3:12am",
      "content": "i think the caps need a lot of work.   \nthere are loads of inconsistancies that have probably arisen   \nfrom hand-drawing isolated glyphs on separate pieces of paper :/   \n   \ni think the stoke widths need to be evened out.   \nthe stem width of the U seems too wide,   \nthat of the I and R too narrow.   \n   \nthe other thing i would appreciate some comment on   \nis the tapering present on some of the ascenders (one side of the stem only).   \n   \nheres a H for example.   \n ![](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/12802.jpg)   \ni quite like that feature, and it will look a bit more even when it is vectorised.   \ni have not applied it consistantly to all characters - is this a problem?   \ni also have a feeling that its going to play havoc with rendering/hinting,   \nespecially at small sizes.\n\n"
    },
    {
      "time": "11 Jul 2003 — 3:16am",
      "content": "[self - edit]\n\n"
    },
    {
      "time": "11 Jul 2003 — 3:29am",
      "content": "jacques   \n   \nthanks for your suggestion.   \nhere i have scaled the (too small) lining numerals   \nup to match the caps.   \nperhaps the result is slightly overbold in relation to the blackness of the caps.   \nwhat do you think?   \n   \n ![](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/12805.gif)\n\n"
    },
    {
      "time": "11 Jul 2003 — 8:05am",
      "content": "I didn't like it at first, but this design is acquiring a certain handsomeness! Keep it up.   \n   \nBut that \"a\" is a \"d\".   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jul 2003 — 4:23pm",
      "content": "It seems to me (I'm no expert yet) that you need to nudge your capital proportions closer to the classical Trajan proportions. I.e. make your T's and E's narrower, your S's a little wider, etc. Letters like N, D, and G should almost be the same width.   \n   \nPaul\n\n"
    },
    {
      "time": "20 Jul 2003 — 11:11pm",
      "content": "i'm with hrant on the whole \"a\" issue. that one sticks out like a sore thumb. i'd suggest a single story \"a\" that looks similar to a rotated \"b\" with the (now) descender lopped off. i think the tapered vertical strokes are a nice touch, and can go a long way to giving the face a nice character. i'd say, yes, be consistent in its application to similar verticals -- B, D, E, F, H, K, L, M, N, P, R. not sure about the I tho. maybe make it fluted on both sides. have you inspected optima as a reference point?\n\n"
    },
    {
      "time": "22 Jul 2003 — 7:14am",
      "content": "hrant, paul, tyler   \n   \nthanks so much for your critiques, they are really helping the development of this face!   \n   \nhrant,   \nthanks for your words of encouragement! i\n\n"
    },
    {
      "time": "31 Jul 2003 — 3:25am",
      "content": "ok, heres some ideas for a new 'a'.   \nsorry its taken me so long,   \nhope its worth the wait...   \n ![different 'a's](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/13504.gif)   \n   \nnote: the mutant 'd' has resurfaced as #1.   \ndoes the new height make it feasible?\n\n"
    },
    {
      "time": "31 Jul 2003 — 3:28am",
      "content": "![anna](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/13507.gif)\n\n"
    },
    {
      "time": "31 Jul 2003 — 3:44am",
      "content": "thanks to tyler for #3, [the single storey a]   \nwhich is his suggestion.   \ni'm sure there are more possibilities...   \n   \nadditionally, any thoughts on the alternative 'd'?   \n   \nbonus points for IDing the red face ![:-)](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nthanks, geraint\n\n"
    },
    {
      "time": "31 Jul 2003 — 8:02am",
      "content": "a: #3   \n   \nhhp\n\n"
    },
    {
      "time": "1 Aug 2003 — 1:51am",
      "content": "a- yes, you're right. #3 it is.   \n   \nalthough i'm beginning to come around to the idea   \nof a supplementary font of alternatives/ligatures (?expert set).   \nwhich could accommodate the many alternates.   \nis this a good idea?\n\n"
    },
    {
      "time": "1 Aug 2003 — 9:13am",
      "content": "I'm just a beginner and I'm sure many of the people who have given you advice know much more than I do about the in\"s and out's of type design so please defire to their expertise, but I just wanted to say...   \nI really like #4. Depending on what you are going for #3 is an excellent choice. It feels historically/sterotypically correct with what I assume is the genere of the typeface. What I personally like about #4 is that is is unexpected (at least to me) in that style. It still reads as an \"a\" to me immediately, but it comes off as a fresh way to represent the character (within that genere). If you were to choose to do #4, I would however try to replicate the style in the letter \"e\" to maintain some consitency within the character set. Maybe it can be part of the alternates set. For what its worth\n\n"
    },
    {
      "time": "23 Nov 2004 — 2:17am",
      "content": "...a year later...   \n ![playf](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/messages/29/54170.gif)   \nok, i've been spurred on to do a little more work on this project. at least now it's in digital form. any thoughts?\n\n<!--attachment: playf-54171.pdf*mime_pdf.gif*application/pdf*23.6*playf*playf%2epdf --><!--attachment: playf-54171.pdf*mime_pdf.gif*application/pdf*23.6*playf*playf%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">playf<br><a href=\"http://web.archive.org/web/20131012104040/http:/www.typophile.com/forums/messages/29/playf-54171.pdf\" target=\"_blank\"><b>playf.pdf</b></a> (23.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "23 Nov 2004 — 2:23am",
      "content": "grr, cos the thread's too long (my fault),   \nyou have to scroll to the right to see the   \npdf link ![:-)](http://web.archive.org/web/20131012104040im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "23 Nov 2004 — 2:31am",
      "content": "a wonderful mix of concepts and style beautifully executed. I can't think of anything to improve upon except perhaps by adding alternates to the \"a\", \"d\" \"g\". I love the current \"g\" but perhaps in text it may be a bit to stylish.\n\n"
    },
    {
      "time": "23 Nov 2004 — 6:31am",
      "content": "hey thanks ole for your kind words. you're quite right about the alternates\n\n"
    },
    {
      "time": "23 Nov 2004 — 10:28am",
      "content": "This is oozing quite a nice character.   \nThe structures are [mostly] modern but the finish is fauve - pretty unique, and surpisingly effective.   \n   \nThe only \"macro\" complaint I have is that _all_ of the strokes should have that flare; some, like the bar of the \"t\" are too straight.   \n   \nMicro stuff:   \n- I would have the joins in \"b\", \"p\" and \"q\" sharp, not pudgy.   \n- The \"g\" is charming (love the \"missing\" ear) but out of character, I guess because its structure is too organic - try making the join and the bottom bowl more geometric.   \n- The \"z\" is too dark.   \n   \nhhp\n\n"
    }
  ]
}
