{
  "id": "50108",
  "title": "Same font over and over ?",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello, I was trying my skills in type design, and started working on a font, but when i tried to submit it here to receive some advise, I saw about 35 very very similar fonts designed by others.\n\n ![](http://web.archive.org/web/20130819224104im_/http:/typophile.com/files/font_5351.png)\n\nIs this the case ? I mean is every beginner designing the same font :) ?\n\n",
  "author": "XssPirito",
  "time": "2 Oct 2008 — 5:31pm",
  "uid": "37620",
  "comments": [
    {
      "time": "2 Oct 2008 — 6:26pm",
      "content": "Ruler & compass font ideas ran out in the mid 1970s. No matter what you do with a ball & stick, it can't help but resemble everyone else's ball & stick. That doesn't mean you can't make one too. Just make it better or different or more useful or hit a smaller niche.\n\n"
    },
    {
      "time": "2 Oct 2008 — 9:31pm",
      "content": "i think its looking good so dont give up...\n\nThere are so many sans serif typefaces but even if its something that bares similarities to others the main thing i would look for is versatility which will make it more usable - the relationship between the weights, and also how does it work together at sizes like caption, body, leader, headline etc?\n\n"
    },
    {
      "time": "2 Oct 2008 — 9:33pm",
      "content": "Thanks for reply, I'm also trying another one, a serif font, can you guys tell me if it is worth continuing? or have you seen a similar font?\n\n ![](http://web.archive.org/web/20130819224104im_/http:/typophile.com/files/bb_4681.png)\n\n"
    },
    {
      "time": "2 Oct 2008 — 10:31pm",
      "content": "If these are your first fonts, don’t worry about being original, worry about getting them done. By the time you have these fonts working well and kerned you’ll have realized that you need to get a lot more experience before releasing anything. I’m about to release a font for the first time, and it’s the third I’ve done. My first and second fonts weren’t remotely original and will probably never be released. But they were certainly worthwhile learning experiences.\n\nI do like where your serif design is going. You’ve got some great ideas there—run with the design while you use the geometric design to learn about spacing and kerning.\n\n"
    },
    {
      "time": "2 Oct 2008 — 10:34pm",
      "content": "well for this one, the way you end your strokes is a little weird.. but if you're dead set on keeping that.. for the 'c' you should reverse the action of the stroke because it's supposed to look like the stroke of the pen and the way you have it now, one of the strokes is backwards.  \n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20130819224104/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "3 Oct 2008 — 6:01am",
      "content": "Thanks for comments, I'll try to work on this font and make them a little more unique than what they are now. One more qwuestion which format is the best otf or ttf (or somethign else) ?\n\n"
    },
    {
      "time": "3 Oct 2008 — 7:58am",
      "content": "How about this one? is this unique?\n\n ![](http://web.archive.org/web/20130819224104im_/http:/typophile.com/files/otf_5390.png)\n\n"
    },
    {
      "time": "6 Oct 2008 — 2:35am",
      "content": "You are absolutely going into a right direction. Just don't care whether there are similar designs exists or not, don't even look for them. If it's 100% your work, it has to be unique.\n\nLooking at your work, am assuming that you are working on Illustrator at the moment. You should start learning FontLab from now onwards cause that will give you more command over the decisions you are making. And you will save a lot of your time too.\n\nAll the best.\n\n"
    },
    {
      "time": "6 Oct 2008 — 7:44am",
      "content": "I have designed some Armenian fonts about 10 years ago using Fontogrpher, FontLab has changed a lot since :) so I'm having a little difficulties adjusting. I'll design the bold one and will post here to see what comes out of it.\n\n"
    },
    {
      "time": "6 Oct 2008 — 5:36pm",
      "content": "When I saw them second sample I thought the same thing as Satya. You really have to say goodbye to Illustrator at some point. If you have to choose only one format, go with OTF.\n\n"
    }
  ]
}
