{
  "id": "50116",
  "title": "Alex Parrott",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello,\n\nI have recently done this bit of typography for the launch of my website. The two word marks work in tandem on the site and help unite my print origins and the URL in a, hopefully, memorable way.\n\n[http://alexparrott.co.uk/](http://web.archive.org/web/20131108213455/http:/alexparrott.co.uk/ \"http://alexparrott.co.uk/\")\n\nI would really appreciate your thoughts and feedback.\n\nMany thanks,\n\nAlex\n\n| Attachment | Size |\n| --- | --- |\n| [AP\\_CMYK\\_COUK.jpg](http://web.archive.org/web/20131108213455/http:/typophile.com/files/AP_CMYK_COUK.jpg) | 662.72 KB |\n\n",
  "author": "Alex Parrott",
  "time": "3 Oct 2008 — 3:35am",
  "uid": "28354",
  "comments": [
    {
      "time": "3 Oct 2008 — 3:38am",
      "content": " ![](http://web.archive.org/web/20131108213455im_/http:/typophile.com/files/AP_CMYK_COUK_6144.jpg)\n\nApologies – here's the work.\n\nA\n\n"
    },
    {
      "time": "3 Oct 2008 — 3:40am",
      "content": "hmmm… seem to be struggling today.\n\nThe wordsmarks can be seen here:\n\n[http://alexparrott.co.uk/](http://web.archive.org/web/20131108213455/http:/alexparrott.co.uk/ \"http://alexparrott.co.uk/\")\n\nroll over the top left wordmark to reveal the other.\n\nA\n\n"
    },
    {
      "time": "3 Oct 2008 — 3:56am",
      "content": "Hi Alex,\n\nI think it works quite well.  \nI would suggest just the black background, as maybe your clients wouldn't understand the reference.  \nThe black background and sharp images looks great.\n\nMy 2 Cents.\n\n"
    },
    {
      "time": "3 Oct 2008 — 4:01am",
      "content": "Excellent work, Alex. A side-comment only: Can you 'reload' the tooltip upon clicking? Once I start browsing your site, I tend not to move the pointer at all, and so the tooltip is not updating and subsequently not displaying the corresponding information.\n\n"
    },
    {
      "time": "3 Oct 2008 — 4:12am",
      "content": "Love the 'fr' id by the way!\n\n"
    },
    {
      "time": "3 Oct 2008 — 4:14am",
      "content": "Nice work Alex!\n\nUnfortunately, the site navigation is a little bit confusing - it took me a while to figure out that the small bars at the top represent different portfolio pieces and the initial click takes you all the way to the last page which didn't help.\n\n"
    },
    {
      "time": "3 Oct 2008 — 4:20am",
      "content": "(clarification: my comment regarding the tooltip only applies when browsing backward)\n\n"
    },
    {
      "time": "3 Oct 2008 — 4:49am",
      "content": "Hi Andyboot, Fredrik and Seb,\n\nthanks for your comments. I really appreciate the feedback.\n\nThe site is a representation of how I work really – paired back, subtle design, using the minimum of means to get maximum effect. My intention was for it to have stand out from other designers'sites, and to be memorable. As a freelancer, in relatively tough times, I need the bulk of my clientele (Creative Directors) to think that I have a slightly different approach to solving graphic problems.\n\nI understand that the navigation can appear to be a tad confusing, but the site is a simple gallery: if you click on the left hand side of an image you go to the previous slide, and right hand side the next, all continuously looped. I know this isn't apparent when you first visit the site, but I'd like to use this forum as a sounding board for designers to let me know if what I have done is interesting enough to make you scroll through the work… or just plain silly.\n\nThe colour change is just a bit of fun. A spectacle really. It's the core idea of the site so removing it would mean starting again! Also, it's an interesting way to display the variety of my one colour marks and B+W imagery.\n\nMore thoughts encouraged.\n\nMany thanks,\n\nAlex\n\n"
    },
    {
      "time": "3 Oct 2008 — 4:50am",
      "content": "Fredrik – I'm not sure, I'll have to consult my web guy!\n\n"
    }
  ]
}
