{
  "id": "50132",
  "title": "READABILITY ON THE WORLD WIDE WEB",
  "forum": "nancy sharon collins's blog",
  "tags": [

  ],
  "content": "This article was brought to my attention:\n\n[http://www.reidreviews.com/reidreviews/](http://web.archive.org/web/20081210105357/http:/www.reidreviews.com/reidreviews/ \"http://www.reidreviews.com/reidreviews/\")\n\n(SEE ARTICLES AT BOTTOM OF PAGE, “A Side Note on Macintosh Computers and Text Readability” and “Zooming Reid Reviews With Macintosh OSX”)\n\nSo I turned to my favorite type guru for his expert opinion, Steve Matteson, Ascender, Corp. He was gracious enough to answer and allow me to post his response:\n\n“Hi Nancy,\n\nBoy you’ve really stepped in it with this one! :-) The skinny on this  \nlink is that type on screen is truly a big fat mess. There’s a lot of  \nbad speculation on this blog but a grain of truth. The variation of  \nrasterizers is much deeper than the author initially suggests.... he  \ndoesn’t even mention Adobe applications which override Apple and  \nMicrosoft rasterizers to display type in their own preferred way  \n(their rasterizer is called ’CoolType’... don’t ask why).\n\nIt’s a terribly subjective topic - some prefer black and white and  \nothers prefer anti-aliased fuzz. Some just need new prescriptions for  \ntheir glasses. The arguments against black and white are that it is  \ntoo stark. Also that spacing suffers\\*. The arguments against anti-  \naliased (gray scale) is the lack of edge definition. Microsoft Windows  \nuses ClearType and some people bitterly hate it because they are  \nsensitive to the color fringing. Microsoft has had independent  \nresearch done which quantifies the legibility of ClearType of anti-  \naliasing. I think their claims were a 5% improvement in reading  \nperformance with ClearType.\n\nApple thinks they have the ultimate solution which needs no further  \nimprovement. They are putting no investment that I’m aware of in  \nrefining type quality. Google and Microsoft kill Apple in side by side  \ncomparisons. Being a hardcore Apple fan this is terribly frustrating.\n\nFor Microsoft’s part - the ClearType tuner gives you ability to fine  \ntune your system for the way type renders in non-Adobe apps.\n\n ![](http://web.archive.org/web/20081210105357im_/http:/typophile.com/files/pastedGraphic_3527.gif)\n\nThe attachment with the 6 text blocks shows the range in settings. At  \nleast they realize that people see differently. Apple seems to rely  \nonly on Steve Jobs’ personal reading glasses prescription.\n\nThe second attachment illustrates the same \\*exact\\* font data rendered  \nwith different rasterizers....\n\n ![](http://web.archive.org/web/20081210105357im_/http:/typophile.com/files/screenfonts_6043.gif)\n\njust a ’for example’ to prove that different rasterizers draw type  \nvery differently.\n\n\\*spacing suffers because most applications choose to round high  \nresolution letter widths to pixels. The effect is sort of randomized  \nspacing - good at one size but not another. The alternative is to have  \nperfect spacing on screen which then is potentially/likely different  \nthan print (causing line breaks to occur in different places than on  \nscreen).\n\nWell I hope this helps.... someday I should write this stuff down....\n\nSteve”\n\n",
  "author": "<a href=\"/web/20081210105357/http://typophile.com/user/14410\" title=\"View user profile.\">nancy sharon collins</a>",
  "time": "<br>",
  "uid": "14410",
  "comments": [
    {
      "time": " 3.Oct.2008 11.59am",
      "content": "The original site’s readability could be much improved if they would have not used arial and some appropriate leading (line spacing) not to mention picking a better color combination for the foreground/background.\n\nArguing about font smoothing between operating systems for a majority of the population is splitting very small hairs. ;o)\n\n"
    },
    {
      "time": " 3.Oct.2008 2.29pm",
      "content": "hi,\n\ni know what leading is but obviously the blogger does not. what was interesting to me is that this showed up on a PHOTOGRAPY blog.\n\ni think steve matteson is correct, however, that perception is everything and there are many conflicting opinions on type readability on the web. lord knows, the PRINT readability question is far from clear. ellen lupton argues that readability is habitual (or conditioned,) that if i grow up reading black letter i would find it perfectly readable. others do not share her view. there are questions about the repetitive structure of the alphabet we use; so many characters repeat forms (b d, c o, h l p q, and etc.,). but most researchers who actually spend time on readability issues are not typographers and typographers understand the LANGUAGE of type.\n\nwhat i think is that all of these issues are important. think about type foundries mediating letterforms in metal, each one rendered according to their ability and pocket. there were beautifully rendered cuts of type, and really lousy ones. same with the shift to hot metal then cold. what’s going on right now is that there are (1) people who draw the type then people who write the software to manage it then (3) people who receive the type on zillions of devices that render it differently. #3 is new. so, now we need (4) someone to figure out what it how it should function with #3, and there is no “canon” to do this.\n\nyah, splitting hairs to some.\n\n"
    },
    {
      "time": " 3.Oct.2008 3.09pm",
      "content": "“what was interesting to me is that this showed up on a PHOTOGRAPY blog.”\n\nUsually that extent of a disclaimer is due to ignorance. Not in the ’he is stupid’ sense, but rather just an ignorance of type in this case. Yea, the font smoothing can be an issue, but it’s usually the lesser issue of all the issues that can make on-screen type a pain on the eyes.\n\n“there are many conflicting opinions on type readability on the web”\n\nCertainly.\n\n"
    },
    {
      "time": " 3.Oct.2008 5.39pm",
      "content": "hi,\n\nso, because you continue the discussion you agree that “Arguing about font smoothing between operating systems for a majority of the population” is worth discussion.\n\nyes?\n\nmy point is that non-type folk, but visually literate individuals, notice this stuff. so we in the type industry should pay attention.\n\n"
    },
    {
      "time": " 6.Oct.2008 4.33am",
      "content": "Nancy\n\nThis article might interest you:\n\n[http://jontangerine.com/log/2007/10/smoothing-out-the-creases-in-web-fon...](http://web.archive.org/web/20081210105357/http:/jontangerine.com/log/2007/10/smoothing-out-the-creases-in-web-fonts \"http://jontangerine.com/log/2007/10/smoothing-out-the-creases-in-web-fonts\")\n\n"
    },
    {
      "time": " 6.Oct.2008 7.26am",
      "content": "“you agree that “Arguing about font smoothing...”\n\nUmm, well, I didn’t realize we were arguing. ;o)\n\nBut, sure, it’s important. But in the context of that example site, it’s perhaps the least important of the variables that made that site a pain to read.\n\n"
    },
    {
      "time": " 8.Oct.2008 5.44am",
      "content": "Nancy: “my point is that non-type folk, but visually literate individuals, notice this stuff. So we in the type industry should pay attention.”\n\nWe in the type industry pay attention, thanks. Starting in the late winter and early spring of ’07, (when MS finally released a system with antialiased type on by default), you will find somewhere between 40,000 and 100,000 words on this topic right here at Typophile. The differences between Adobe, Apple and MS antialiasing were studied, quantified and discussed at great length. When the dust had cleared and the broken bottles of Yukon Jack and Mountain Dew were swept up:  \nAdobe settled on, “We are all just carbon/water balls tripping ’round the sun. Reading screens is inferior to print, why waste time?”  \nApple decided, “People like it!” (which means Jobs, which makes it plural, I guess).  \nAnd Microsoft proclaimed proudly that, “Readability is a software engineering problem, not a type design problem.”  \nI said and repeat, “They all make modestly nice fonts for previewing print.”  \nThen, there were another 10,000 to 1,000,000,000 words discussing Microsoft’s thinly veiled attempts at ’scientific studies’ of reading and Cleartype. When the dust cleared from that, the U. of Michigan Business School, the iDocs Union and former students of MS’s Behavioral Psychology Guru had to be swept up and tossed in the “Oh Really!?” bin. Then, most of the people with real skills and open eyes in this area of the field went off to help readers of systems used by a minority of users, which is working out quite nicely for all involved, whilst we wait...\n\nCheers.\n\n"
    }
  ]
}
