{
  "id": "50139",
  "title": "Swirly script engravers font - it's driving me crazy",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi all -\n\nI've been looking (unsuccessfully) for a script font that has some of the detail in the fill of the letterforms (the little lines) seen in the letters below. Eventually, I'll have to probably draw what I want by hand, but I'm hoping to find a usable substitute to include on mockups...\n\nAny leads?\n\nThank you thank you!\n\n ![](http://web.archive.org/web/20150417022549im_/http:/typophile.com/files/2907077367_24e4f934e9_4931.jpg)\n\n",
  "author": "miekebl",
  "time": "3 Oct 2008 — 1:09pm",
  "uid": "24671",
  "comments": [
    {
      "time": "3 Oct 2008 — 1:11pm",
      "content": "None of the 'a's are exactly the same - this is hand-drawn calligraphy.\n\n- Lex\n\n"
    },
    {
      "time": "3 Oct 2008 — 1:19pm",
      "content": "Yep, I know it. Pretty much what I'm looking for is a script typeface with this type of shading within the letterforms. On the original, you can see that there are little lines to give the shaded illusion when printed.\n\n"
    },
    {
      "time": "3 Oct 2008 — 2:50pm",
      "content": "hi,\n\nthis is the engraving lady and yes, this is engraved, probably by hand.\n\nits not a font. do you have the plate (or die) or just the print.\n\nthere are 2 categories for this kind of font available: script and calligraphic (calligraphy.)\n\nthe \"lines\" are either the shadow cast within the \"cut\" or the guide lines scribed first. neither of which will help you.\n\nif your task is to replicate this, best and (historically \"correct\" according to the market) is to re-draw it in illustrator. it will be lovely. and maybe you can use the lesson learned for someothing else.\n\n"
    },
    {
      "time": "3 Oct 2008 — 3:15pm",
      "content": "[Inscription](http://web.archive.org/web/20150417022549/http:/www.fontshop.com/fonts/singles/itc/inscription_std_plain/)  \n [Stuyvesant](http://web.archive.org/web/20150417022549/http:/www.fontshop.com/fonts/singles/monotype/stuyvesant_std_engraved/)\n\n"
    },
    {
      "time": "4 Oct 2008 — 7:24am",
      "content": "Offhand, the only font I know that has these kinds of fills is [Treasury](http://web.archive.org/web/20150417022549/http:/www.myfonts.com/fonts/canadatype/treasury/), a revival of an old MacKellar, Smiths & Jordan 1875 typeface by the same name, by Canada Type. Patrick Griffin and Rebecca Alaccari made a very ornate script with lots of variations that can be used, including two styles of fills.\n\n- Mike Yanega\n\n"
    }
  ]
}
