{
  "id": "50153",
  "title": "\"Asymmetrical\" joins on the N?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello Typophiles!\n\nWhat a great place to be. :)\n\nI'm currently working on the digitization of an old metal face [I asked about here before](http://web.archive.org/web/20150416055918/http:/www.typophile.com/node/49701). I'm fairly new to type design, just having started the postgraduate type design course in Zurich, Switzerland, so please bear with me ;-).\n\nHere is the Uc alphabet:\n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/industria_alphabet_4091.jpg)\n\nWell, it has these unexpected quirky details. I just spent the entire afternoon trying to figure out the N, the question being that the joins of the diagonal with the left & right stems respectively are solved quite differently (these are my sketches, please forgive any crookedness). And interestingly, the \"asymmetrical N\" is only present in the original sample from Emil Gursch Foundry in Berlin (1910); Berthold slightly redesigned the typeface in the 1920s and rereleased it with symmetrical N joins. So I guess they were wondering too ;-)\n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/N_joins_variations_3920.png)\n\nHans Jürg Hunziker, my teacher in this, told me to change it to make the joins equal. I realized changing the angle of the diagonal runs me into other problems, but found a very \"neutral\" variation by moving the diagonal a tad to the left.\n\nWhat I'd like to know, though, is why this may have been solved like this. While I would like to \"filter out\" some of the weirdnesses that stem from the lead \"medium\", as well as some of the historical specialties, I would still want my digitization to remain as true as possible to the original typeface, so if the thing with the N was a valid and purposeful design decision, I wouldn't necessarily want to change it.\n\nSo, can anyone tell me some reason why this asymmetry in the joins could have been a valid design decision? Does it relate to any of the other letterforms? (I realize the left join, as is, matches the apex of e.g. the A; but when I use this system on both joins, like in the middle sketch, the N looks a bit like it's about to break apart.)\n\nFWIW, whereas Karen Cheng's \"Designing Type\" does not show any asymmetrically joined sansserif N's, I've checked some other fonts and noticed that Verdana, for one, does the exact same thing – it has a \"flatter\" or \"wider\" join on the left and a more \"acute\" or narrower one on the right.\n\nThanks a lot for any input!  \nNina\n\n",
  "author": "nina",
  "time": "4 Oct 2008 — 11:47am",
  "uid": "13487",
  "comments": [
    {
      "time": "4 Oct 2008 — 12:11pm",
      "content": "What does the M, V, W, and Z look like in terms of joins? Try to maintain some conistency with them. Metal type usually requires a bit more allowance for inkspread and traps. You may want a tad less for your digital version. Also, that is a very wide font. With that much width, the N is easier to deal with either way you approach it. Visually, you want a join both without a dark spot or a falling apart. Your eyes will tell you when it is right, not your ruler.\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2008 — 1:10pm",
      "content": "I haven't thought much about this before but\n\n1) It doesn't surprise me that a \"darker\" join works better at the bottom, but not at the top where it might look \"top-heavy.\"\n\n2) The way I would write a capital N is not symmetrical - I do the first stroke downwards, then the diagonal downwards and the other vertical upwards - like an I and a V. So conceptually, with writing in mind, a greater break works at the top left (where the pen actually picks up and restarts) than at the bottom right (where it just changes direction).\n\nI'm just making this up - I have no idea if either of these might have been rationale for your original design decision, but there you go. It's an interesting question.\n\n"
    },
    {
      "time": "4 Oct 2008 — 1:55pm",
      "content": "Some early sans-serif faces were slabs with the serifs chopped off. Perhaps the original design came from a slab. It's unlikely that the bottom right on the N would have had a serif which might explain why it's different.\n\n"
    },
    {
      "time": "4 Oct 2008 — 2:07pm",
      "content": "Thanks for your input, Chris and Craig.\n\nChris: Thanks for the tip with the comparison to M, V, W, and Z.  \nThe whole thing looks pretty inconsistent to me:  \n– The W has really tight joins (and the apex looks like the ink would clog)\n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/W_roman_4194.png)\n  \n– The M has the wider ones where the diagonals join the stems  \n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/M_roman_4896.png)\n  \n– And the vertex of the V seems really black again.  \n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/V_roman_5432.png)\n\nIt's interesting though that the Z, especially the lowercase, looks like an N rotated counterclockwise: The (although very slightly) \"wider\" join is at the bottom.\n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/z_roman_3838.png)\n  \nThat seems to make sense for the Z, although this time not in terms of the stroke order Craig indicated, but in terms of visual balance.\n\nCraig: That's highly interesting – so in that case, the asymmetry of this N may be related to this Serif form in terms of how they interpret stroke order in writing?\n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/georgia-N_5296.png)\n  \nThat does seem to make a lot of sense. Although I wonder how much stroke order would have influenced the designer of this typeface.\n\n--  \nlearning is inherently an act of humiliation.\n\n"
    },
    {
      "time": "4 Oct 2008 — 2:12pm",
      "content": "<cite>Some early sans-serif faces were slabs with the serifs chopped off. Perhaps the original design came from a slab.</cite>\n\nWow, Ray, that would indeed explain a lot; I had no idea. Thanks for the suggestion! I'll try to find some specimen books & find out if there was indeed a similar slab, maybe even from the same foundry.\n\n--  \nlearning is inherently an act of humiliation.\n\n"
    },
    {
      "time": "4 Oct 2008 — 3:06pm",
      "content": "\"learning is inherently an act of humiliation\"\n\nNina, actually, Learning is inherently an act of illumination. A teacher may shine a light on a subject but you must still learn to see it.\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2008 — 3:08pm",
      "content": "Nina,  \nHave you ever met Frank Vigliotti or Bill Schoerner there in Basel?\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2008 — 3:54pm",
      "content": "\\> I just spent the entire afternoon trying to figure out the N\n\nIt seems that you've chosen the right field. :-)\n\n\\> While I would like to “filter out” some of the weirdnesses that stem  \n\\> from the lead “medium”, as well as some of the historical specialties,  \n\\> I would still want my digitization to remain as true as possible to  \n\\> the original typeface\n\n1) It's not so simple to separate the medium from the decisions.  \n2) This weirdness can't be from the medium, so if you really do want to make a faithful revival\\* you should definitely keep it. That said, it's always nice to try to read the minds of dead people!\n\n\\* Not something I myself generally recommend.\n\n\\> can anyone tell me some reason why this asymmetry in the joins could have been a valid design decision?\n\n1) Dynamism. The \"N\" is more boring than most letters, so it needs more help.  \n2) Incorporating a vestige of a serif; see the many serif \"N\"s that have a strong top-left but a weak bottom-right. There is no such thing as a pure sans or pure serif face; this one could very well be 98% sans, but 2% serif.  \n3) Maybe an optical effect (like some people have suggested).\n\n\\> Does it relate to any of the other letterforms?\n\nHopefully yes!\n\n\\> The whole thing looks pretty inconsistent to me\n\nMore dynamism (potentially). If the whole thing was consistent except for the \"N\", then I'd worry.\n\nhhp\n\n"
    },
    {
      "time": "4 Oct 2008 — 6:49pm",
      "content": "Nina,  \nI am not one to do revivals so you might take this with a grain of salt. I would say, the point of making a digital version of a metal font is to make it available and usable in modern day equipment. To me that means to make it better for digital type and offset printing. To do that, you must make some departures from the metal face to make it work. This makes you decide what you mean by \"faithful\" or \"true\" revival. First, make it a good typeface. If that means cleaning up the joins to look better to you, then do it. My idea of better might differ from yours. As a student, your job is to define what is better for yourself. You will learn more that way than if you just take my advice or anyone elses. Try all the angle joins several ways and see which makes the best sense with the whole font. For example, to me that z looks crazy. I could not stand looking at it. If it does not bother you, ignore it but whatever you do, make all the letters live together in comfort. Comfort does not mean everything is exactly the same. Sometimes a contrast is good--as Hrant puts it, a \"dynamism\".  \nType design is about hours of tinkering and debating nuances. If you start working on your typeface one afternoon and find that morning has come without your even knowing it, you may have found a field suitable for you :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2008 — 4:24am",
      "content": "Wow, this is getting really exciting. :-)\n\nChris,  \nI am afraid I do not know either of the people you named. Then again, although I am from Basel and now living in Basel, I have been utterly unconnected to the Basel school – until now that I am studying under some Basel graduates. I did my own studies in [Halle, Germany](http://web.archive.org/web/20150416055918/http:/www.burg-halle.de/).  \nAt least seen from this close distance, I would say the Basel school has lost much of the \"shine\" it had a couple of decades ago. They do not even do type design anymore, that happens in Zurich now. :-/\n\nWhat I meant about humiliation: In this occasion, I do find it to be humbling to find my own limits – of understanding, of (re-)production – to be very narrow when set against the complex beauty of letterforms. It is this humility (in a positive sense) that I need to be as open as possible about approaching new fields. I admit the quote may read as harsh but it does help me – usually, I like to be in charge of stuff, but that doesn't really work here. :-)  \n\"Illumination\", of course, makes a very neat quote as well.\n\nHrant,  \nSeeing sans and serif not as a binary \"decision\" but a gradual axis is a highly illuminating (!) thought. I am getting more and more convinced that any type classification system that would make sense today would need axes in numerous dimensions; then again, it would probably not be very usable. But I digress.  \nWhy are you not in favor of \"faithful revivals\": Is it because transplanting a font in the exact same shape into a new medium, time, and context would not pay enough homage to its original circumstances? – I would not want to just trace it and voilà; I think it needs a slight degree of \"modernization\" (plus there are some letters I simply can not live with, like the uppercase G, which I find incredibly hideous).  \nThat said, I'm also a little worried about the other extreme – putting too much of myself into this so it would end up looking like a different typeface vaguely inspired by this one. That would feel like disrespecting the intentions of the dead person who designed it in the first place. Hmm.\n\nAlso, your respective comments on dynamism offer a very interesting perspective. I have long ago given up the idea that \"cool, if you have the b, you can make the dpq in 2 seconds\", but I guess it's time I forgot about the copy paste concept altogether. Coming from a graphic / interface design background, it sounds pretty wild to me to \\*not\\* render elements with the same function and position in the same style, for the sake of dynamism. I will have to think about how that may translate to other fields. Or maybe it does not, or in a very different form.\n\nAnd yes … I have to admit I am loving this. I have always been obsessed with details, and with letterforms and symbols anyway, so it is feeling good. :-) Thanks a lot for sharing your views!\n\nNina\n\n--  \nlearning is inherently an act of humiliation.\n\n"
    },
    {
      "time": "5 Oct 2008 — 6:29am",
      "content": "Nina --\n\nThis asymmetrical approach to the two joins in a gothic N is not that unheard of. Here are a few other examples I found quickly.\n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/AsymmetricNs_5072.gif)\n\nLeft to right: Trade Gothic, ITC Franklin (the new revision by David Berlow), Benton Gothic. Varying degrees of asymmetry (that Benton Gothic is actually pretty subtle), but all following the same basic pattern.\n\nAs to \"why,\" I offer this supposition: As you and Craig have hinted at, I think it derives from the pattern of serif types (but not so much because of handwritten stroke order, as Craig suggests, though this is interesting). Consider the nature of N in a typical serif style. The joins are not the same. The upper join is capped with a serif form — strong, flat, relatively wide, reinforcing the cap line. The baseline join, on the other hand, is a vertex pure and simple — sharp, acute, and often undershooting the baseline.\n\nThe asymmetrical treatment that you're noting is probably a vestige of this character of N. I believe you'll find that this quality is not uncommon in sans serifs that descend from the Grotesque/Gothic lineage.\n\nBTW, Blair — an all-caps face originally released by the Inland Type Foundry ca. 1900, and later produced by ATF — bears a remarkable similarity to your caps, and in the original metal the N had asymmetrical joins of this type; but the ITC revival does not retain that detail.\n\n-- Kent.\n\n"
    },
    {
      "time": "5 Oct 2008 — 8:00am",
      "content": "\\> Why are you not in favor of “faithful revivals”\n\nOne reason is that any person has _something_ to contribute\\*, plus it's impossible to remain totally faithful to somebody else's original intent\\*\\* anyway, so why not make a clean break? Another reason is that today is not yesterday, and today's users cannot fully benefit from something that worked (and we're really just guessing that it did) in the past. For example we might mostly agree that that \"G\" is too ugly, but it's possible that back in that time, in that environment, it was just dandy.\n\n\\* Although there should be severe limits on self-expression in type, especially text type (essentially making expression happen naturally, in a way in spite of yourself, as opposed to pushing it out) the fact that it is always there means we should see it as a good thing.\n\n\\*\\* In fact a designer's intent typically changes over the course of the design! So which intent are you going to revive? :-)\n\nInstead of seeing literal revivals as respecting the dead original designer, I see non-literal revivals as respecting the living users.\n\n\\> I have long ago given up the idea that “cool, if you have the b, you can make the dpq in 2 seconds”\n\nGood! Some people remain stuck on that (in different dimensions, often the dimension of chirography, where the bowls of those letters are make too similar) for years, or even their entire careers.\n\n\\> I guess it’s time I forgot about the copy paste concept altogether\n\nWell, it depends on the design. Copy-paste isn't totally useless, it's just a dangerous tool to be used carefully.\n\nhhp\n\n"
    },
    {
      "time": "5 Oct 2008 — 8:54am",
      "content": "<cite>I believe you’ll find that this quality is not uncommon in sans serifs that descend from the Grotesque/Gothic lineage.</cite>\n\nAgreed. I was sifting through an old gothics last night and asymmetric Ns were in the majority. As a new type designer I always get stopped by this.\n\nI think that this really comes down to making these letters work within the proportions of the overall font; the same thing happens with the middle vertexes of M and W. That it seems to appear more in older sans types might be a symptom of the drawing rooms where fonts were designed and manufactured by groups of people who weren’t necessarily sharing an office and had limited options for communicating over distances and for testing and previewing type. Digital technology makes it easier to wipe out every perceived inconsistency—although, as Hrant likes to point out, this is can be to the detriment of letters.\n\n"
    },
    {
      "time": "5 Oct 2008 — 9:57am",
      "content": "Kent,  \nBlair is really quite similar to this one! I am somewhat relieved it's Uppercase only ;-). I also looked at Ray's [Presicav](http://web.archive.org/web/20150416055918/http:/www.typodermic.com/177.html), which is also very similar. It has a slightly asymmetric N, at least discernible in the bolder weights. Ray, I assume it was asymmetric in Tempo too?\n\nHrant,  \n_\"Instead of seeing literal revivals as respecting the dead original designer, I see non-literal revivals as respecting the living users.\"_  \nThat is what I call a good point. :-) I will definitely keep that in mind; in the end, my motivation to do this is not primarily a conservationist one, but on the contrary, I think this font has some qualities that may work very well in a contemporary environment too, and I definitely want to make it usable (just without completely betraying its roots).\n\nJames,  \nI am realizing I really have no clue about how letters were designed back then; I guess it may be wrong to assume one designer that has total control over every letter & how they go together – which is probably more so today.\n\nI think I will try finding a compromise concept, roughly in the direction of the third sketch in my original post, work the joins / apexes / vertices of the AMVWZ in a similar fashion & then see what that does for the liveliness of the font – see if it becomes too bland or neutral. I'm really just at the start of this, in fact the only letters I've started to work on seriously are the O, N, A and T (and even the T is asymmetrical to a wild degree, but I don't think I can make myself keep that).  \nMy teacher told me to do the lowercase first, as it is more interesting and complex, but I am half thinking I should first get some basic shape principles down as shown in the uppercase. I mean, if I can spend this much brainpower and time on the N, I don't (want to) know what would happen if I tried to do the lc a now. :-)\n\nThanks again for all the input guys – this is what I call a warm welcome to Typophile and the world of typeface design!\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "5 Oct 2008 — 10:03am",
      "content": "\"this is what I call a warm welcome to Typophile and the world of typeface design!\"\n\nType designers are a pretty down to earth bunch. Welcome to our little piece of the world! Come back often.\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2008 — 11:19am",
      "content": "<cite>I also looked at Ray’s Presicav, which is also very similar. It has a slightly asymmetric N, at least discernible in the bolder weights. Ray, I assume it was asymmetric in Tempo too?</cite>\n\nYes but the difference is very, very subtle; nothing close to Kent's examples. Check the N in [Presicav Bold](http://web.archive.org/web/20150416055918/http:/www.myfonts.com/fonts/typodermic/presicav/UniqueName-8414-1209656028-14-76722/opentype-ps/397664/character/004E/CP2/1/) as it's the only weight traced from Tempo.\n\n"
    },
    {
      "time": "5 Oct 2008 — 12:49pm",
      "content": "<cite>My teacher told me to do the lowercase first, as it is more interesting and complex, but I am half thinking I should first get some basic shape principles down as shown in the uppercase.</cite>\n\nMake your ideas work in the minuscules first. That’s what people will be seeing most of the time, so it really makes sense to have the majuscules complement the minuscules. It also takes more drama to make the majuscules stand out, and that drama might not transfer to minuscules so well.\n\nAnd don’t be afraid to stick with the asymmetric N regardless of what the professor wants. But before you do, design a symmetric version so that you know what works better and why.\n\n"
    },
    {
      "time": "5 Oct 2008 — 1:03pm",
      "content": "I noticed [this one](http://web.archive.org/web/20150416055918/http:/photoshopdisasters.blogspot.com/2008/06/chanel-deformed-arm-trifecta.html) today.\n\n"
    },
    {
      "time": "5 Oct 2008 — 1:16pm",
      "content": "Ray, wow, the Chanel one is wild! Especially since it's so visible via the outlines. (I have actually seen that picture before but that was before I noticed asymmetric Ns.)  \nAlso, the Presicav Bold N is nice. Very subtle.\n\nJames, thanks for the tip. That does sound like a bunch of good reasons to start with the minuscules. I've got to admit that they kind of scare me, but hell. :-)\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "5 Oct 2008 — 2:25pm",
      "content": "\\> Type designers are a pretty down to earth bunch.\n\nReally?! Maybe compared to witch doctors.\n\nhhp\n\n"
    },
    {
      "time": "6 Oct 2008 — 2:41am",
      "content": "To me, there is a very simple reason for different joins: raising the diagonal a bit and make it look more centered, just as one raises the bar of the H above the mathematical vertical center (where it would sit too low). With an N, there is no other way to achieve this effect than at the price of different joins.  \nAs your remark about the Chanel logo indicates -- <cite>(I have actually seen that picture before but that was before I noticed asymmetric Ns.)</cite> -- obviously this is subtle enough to go unnoticed unless one starts measuring or reconstructing it.\n\n<cite>... in the original metal [of Blair] the N had asymmetrical joins of this type; but the ITC revival does not retain that detail.</cite>\n\nIt looks like reinterpreting type for another medium encourages designers to make details more consistent. Which does not necessarily mean improving them.&nbsp;&nbsp;:)\n\n"
    },
    {
      "time": "6 Oct 2008 — 3:01am",
      "content": "_\"To me, there is a very simple reason for different joins: raising the diagonal a bit and make it look more centered, just as one raises the bar of the H above the mathematical vertical center (where it would sit too low).\"_\n\nYeah, I've been thinking about that. Your rationale sounds totally sound and logical, but to be honest I don't \\*see\\* that. Does a symmetric N, to you, look like it's heavier at the bottom, or like the diagonal is too low?\n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/symmetric_N_6147.png)\n  \nMaybe there's something wrong with my eyes, but to me that looks just fine (please try to ignore the excessive weight of the diagonal).\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "6 Oct 2008 — 4:48am",
      "content": "\"Maybe there’s something wrong with my eyes, but to me that looks just fine...\"\n\nThat's fine. My suspicion has always been that this asymmetry was a compromise between what looks best with the uppercase versus what looks best with the lowercase, the big thick baseline feature being slightly overwhelming to the l.c. stem beside which it will often be used.\n\nCheers!\n\n"
    },
    {
      "time": "6 Oct 2008 — 5:49am",
      "content": "<cite>Does a symmetric N, to you, look like it’s heavier at the bottom, or like the diagonal is too low?</cite>\n\nI hesitate to decide by staring at a single N.  \nSome time ago I revised/redesigned the same kind of typeface, wondered about it too, tried the symmetric approach and found that the diagonal was too low and went back to the original approach.  \nWhether it looks heavier at the bottom is a different story and depends on how you solve the bottom-right join. (Independent of the symmetric/asymmetric question.) Looking at the samples posted by Kent Lew above, in ITC Franklin there is a little ink trap preventing it to look too heavy. Another way is to make the diagonal slightly thinner towards the bottom. So it is not a binary either--or. There are some additional means of visual compensation.\n\nVery similar issue: Usually you learn that the u should be narrower than the n so they look equally wide. But a bunch of sanserifs don't really care -- and obviously nobody objects. So, the real question is, what is your approach to this typeface. If you prefer a more \"rational\" approach and apply this consequently, why not.\n\n"
    },
    {
      "time": "6 Oct 2008 — 7:23am",
      "content": "Karsten, great point about the height illusion!\n\nBut:  \n\\> obviously nobody objects\n\nI think you agree that we're not really talking about conscious objection on the part of laymen; but do you think no type designer objects to the \"u\" and \"n\" being equally wide in a sans?\n\nhhp\n\n"
    },
    {
      "time": "6 Oct 2008 — 7:39am",
      "content": "<cite> &gt; Blair is really quite similar to this one! I am somewhat relieved it’s Uppercase only ;-). </cite>\n\nThere was a lowercase added to the Blair capitals and released as Litho Gothic, ca. 1911. It shares some basic qualities with your sample, but is noticeably different in details. I don't think there is anything in digital based directly on Litho Gothic.\n\nThe dates are all concurrent, so I wouldn't be surprised if there might have been some cross-fertilization going on. But I couldn't say which direction the influence was moving.\n\n-- K.\n\n"
    },
    {
      "time": "6 Oct 2008 — 7:45am",
      "content": "David,\n\n_\"My suspicion has always been that this asymmetry was a compromise between what looks best with the uppercase versus what looks best with the lowercase, the big thick baseline feature being slightly overwhelming to the l.c. stem beside which it will often be used.\"_\n\nGreat point! I haven't thought of that yet. (Speaking of which, it still confuses me when lc is slighly lighter than Uc in the same font – it sort of looks wrong to me when the contrast gets too obvious –, but we'll see how that works out in this one.)  \nAnother good reason to start with the lowercase I guess. :-)\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "6 Oct 2008 — 8:44am",
      "content": "\\> it still confuses me when lc is slighly lighter than Uc in the same font\n\nThink of it as the UC being darker, the rationale being that -especially in a titling font- you could set a fair amount of all-caps, in which case you want to speak a little louder. (I think it was David who brought up this insight, some years ago, on Typophile. IIRC it was in relation to a question by Dan Reynolds about some grots.) I agree that this throws off even color in mixed-case text (especially for German) but back then making/affording a Demi was more prohibitive than today, so they \"overloaded\" the functionality of single fonts. And that of course is a good example of the medium affecting the decisions, and an argument against revival literality (although keeping/making the caps darker does give a font a certain archaic/quixotic charm).\n\nhhp\n\n"
    },
    {
      "time": "6 Oct 2008 — 8:55am",
      "content": "Guys,  \nI have honestly never seen a forum that comes close to this one in terms of learning so much from a single thread. Doing a happy dance over here :-).\n\nHrant,  \n_\"… And that of course is a good example of the medium affecting the decisions, and an argument against revival literality …\"_\n\nAhh! This is highly interesting. I never thought about it that way before; I figured it must have something to do with the lowercase being more detailed and \"blacker\" due to (mostly) having more strokes per unit of space, so the UC was trying to match that by boldening its few strokes. Which is probably nonsense, because to follow that rationale, an s or an a would also be lighter than an i or l, which it probably isn't expect in some very very bold weights where space is a concern.\n\nWhat you say about German is obviously true, I guess that's also why these bolder majuscules irritate me to such a degree (I do read more German than English).\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "6 Oct 2008 — 9:05am",
      "content": "\"...confuses me when lc is slighly lighter than Uc in the same font\"\n\nNina,  \nSome degree of weight increase in the uppercase is there to overcome the vaster stretches of counter space in caps. The color perception humans make compares and figuratively averages the amount of black ink color with the amount of white paper enclosed. Since the strokes of caps are much further apart, it gives the illusion the the caps would be lighter than the lowercase. To combat this, the cap strokes are made just a bit bolder as compensation. (This is sort of like overshoot in round letters.) The trick is to find out how much is enough weight increase to achieve a balance of color with lowercase without having caps that jump off the page.\n\nChrisL\n\n"
    },
    {
      "time": "6 Oct 2008 — 1:14pm",
      "content": "<cite>I think you agree that we're not really talking about conscious objection on the part of laymen; but do you think no type designer objects to the \"u\" and \"n\" being equally wide in a sans?</cite>\n\nPart 1: definitely, only expert comments count; part 2: I fear so, cannot remember having heard any such objections in a long time, despite there being occasions.\n\n"
    },
    {
      "time": "6 Oct 2008 — 1:38pm",
      "content": "Chris,\n\n_\"Some degree of weight increase in the uppercase is there to overcome the vaster stretches of counter space in caps.\"_\n\nLooks like we said about the same at about the same time :-). Except you said it a lot more elegantly. Counter space! And here I am talking about \"strokes per unit of space\". I guess I'd better get the lingo down. :-)\n\nCheers!\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "6 Oct 2008 — 2:02pm",
      "content": "I think Karsten's got the right idea about the asymmetry of the cap N.\n\nI noticed it as being a common feature among sans serifs very early on and assumed (or maybe read somewhere) that it was done for the same reason as the slightly-raised cross-bar, the smaller upper bowl, and other asymmetrical construction: to keep conceptually symmetrical forms looking symmetrical, and not top-heavy or upside down. It's one of those optical illusion things.\n\nIt's more subtle in the case of the N since it's a diagonal, so you can get away with not doing it, especially if the face is very geometric. (Sometimes you have no choice, if the corners of the N are pointed, for instance.)\n\n"
    },
    {
      "time": "6 Oct 2008 — 4:51pm",
      "content": "On the weight of caps vs lower case, I think that is also partly an aesthetic decision. Because 95% of the text is going to be lower case, you can violate even color, and make a 'statement' with the caps being a bit heavier than even color would call for, if you want to.\n\n"
    },
    {
      "time": "6 Oct 2008 — 6:40pm",
      "content": "Nina,  \nI am a slow typist and did not see your post above mine until now. You have the right idea whatever the terminology.\n\n\"because to follow that rationale, an s or an a would also be lighter than an i or l, which it probably isn’t...\"\n\nActually, with very busy glyphs, this does happen. A double bowled \"a\" or \"g\" has so much going on that you often have to lighten some of the strokes so that they appear to be the same weight as other simpler glyphs. It is more in evidence in bolder weights as you thought.\n\nChrisL\n\n"
    },
    {
      "time": "7 Oct 2008 — 7:15am",
      "content": "Dezsaidwell: \"The trick is to find out how much is enough weight increase to achieve a balance of color with lowercase without having caps that jump off the page.\"  \n...or screen. And, to do so perhaps over a range of sizes, resolutions and rendering types. And then, from a light face, like the one under discussion, to faces of greater weight.\n\nHrant:\"... Maybe compared to witch doctors [Type designers are a pretty down to earth bunch].\"  \nI happen to have some metal type that once belonged to you,  \nso I'd be careful, 'cause it can get real hot and then I can stick pins in it.\n\n\"...keeping/making the caps darker does give a font a certain archaic/quixotic charm\"  \nFor the most part I agree. But, there are cases where one sees that the old guys got it exactly right, even for modern times.\n\nIn general, when the huge x-height, met the one-size-fits-all design of modern outlines, and then met the same-same-same of the laser printers they were being proofed on, among native-speaking german language group type designers, the modern concept of invisible to non-existent u.&l.c. difference took root as a compromise in a world where good titling faces, often in the same family, are practically free, and much better adapted to composition of all caps than any face made for mixed composition. True or False?\n\nCheers!\n\n"
    },
    {
      "time": "7 Oct 2008 — 8:35am",
      "content": "I like Mark's assessment, that it's similar to the crossbar of the H being slightly above centre.\n\nAs to why this is pleasing, perhaps, as with entasis, it's because it gives a sense of grandeur to the form.\n\n"
    },
    {
      "time": "7 Oct 2008 — 9:01am",
      "content": "David, ouch! :-)\n\nThere's one other big functional factor in determining whether/how\\_much caps should be darker than the lc: if the font is for one-time immersive reading (like a steamy novel) then you want more even color, while if it's a reference work (like a history textbook) where you need to frequently go back and scan for proper names\\* in a text then you want the caps to stand out. On the other hand, this particular design being a rather mannered sans, it probably won't be used much for either! So I'd say it becomes mostly an aesthetic decision. But anyway, practically speaking, first decide if you're going literal or interpretive.\n\n\\* And this extends to the prominence of numerals, for dates.\n\nhhp\n\n"
    },
    {
      "time": "8 Oct 2008 — 11:08am",
      "content": "Nina,\n\nyou've gotten some good feedback no doubt due to your own thoughtful and considered questions. Welcome.\n\nThe difference in cap/lc weight is mostly optical. Chris is right that they can look too light if not slightly bolder. Illusion! But suppose it is a text face for mostly German typesetting.... Or is it French, for stylish display in a magazine? Caps for text faces are typically spaced rather tightly, because they are used with lc. If you set all caps from such a face, they need some space. Now there is a \"cap spacing\" feature in some OT fonts which fixes this automatically when lines are styled as all caps. It's also true that lowercase stems might vary in weight depending on how the typeface is used. Bold weights of early metal sans faces had outrageous amounts of this visual adjustment, and it was necessary to keep them from closing up with ink and looking blotchy. Whitney's heavier weights have some of this inconsistency built into them, and it's intentional.\n\nType design is almost like cinema; it requires a series of tricks, illusions, inconsistencies, flat out continuity flaws and fakery to appear true. The more one tries to adhere to rules, the more frustration. Diagonals are very tricky; sometimes their weight only looks right slightly thinner than verticals, sometimes diagonals without tapers look \"wrong\", and I'm sure you've already noticed that many X and x shapes depend on non-continuous cross strokes to look right.\n\nThere are various factors at play in deciding about how to treat this N feature. It's difficult, and there are various tricks available, which depend on your priorities. If even color is most important, traps will help a lot. If a rigidly consistent stroke width is important (suppose this was a design for a monument-engraving machine), then engineering joins with sharp terminals might be best, and traps might not be an option. If stylishness is more important, entirely different decisions can take precedence.\n\nAnd then the next typeface will give you entirely different things to think about. ;)\n\n"
    },
    {
      "time": "11 Oct 2008 — 12:38pm",
      "content": "Thanks again for the wonderful welcome. Sorry I didn't reply earlier, in fact I was away for a couple of days, went to the library of the Gutenberg Museum im Mainz to scan the original font sample. The next night, I dreamed about the B, K, and R. And now I'm battling 350MB TIFFs. :)\n\nHrant, your latest post in this thread had me a bit baffled. I've always assumed that type design is just about the most complexly detailed thing one can possibly attempt to do in the graphic field, but I've never thought remotely _that_ far – choosing, or even making!, typefaces with a different contrast between caps and minuscules for different types of text. Wow. It makes a huge lot of sense, though, now that I think about it.\n\nI'm not scared, though. Just trying to get used to the thought that this typeface is going to serve as a practicing field & the provider of a steep learning curve for me rather than the ultimate digitization of this font. I still hope I'll get a result that is usable, and will be very happy to show it again here once I've got a reasonable character set together to judge the shapes in context.\n\nCarl,  \nI'm guessing I'm mostly aiming at the German language market (haha). Funny you mention \"stylish magazines\"; the first time I saw the light weight Industria, my inner eye immediately set it as a magazine title, large, light, dark violet (?), partly overlaying a picture with light colours. I'm not a fan, or even a reader, of fashion magazines, but I can picture this font in one.\n\nThe cinema metaphor is just great. I actually worked in video production for a bit and do absolutely see the parallels. Also how you spend endless hours on tiny details on the individual snippets, & in the end it all comes together and looks like a \"finished whole\" (well, ideally).\n\nThe thing about adhering to rules and how it doesn't work, I find that to be maybe the most difficult feature of type design to explain to outsiders. I tried to convince my aunt (who asked about the project) why optical correction is what counts, & not mathematical correctness. I think she had serious doubts about my ideas (she's a mathematician). If I didn't already have more than enough work on my hands, I'd make a little font for her where nothing is optically corrected (the O being a circle, the bar of the H in the mathematical center etc.) – has anyone ever done this, just for fun, just to see how it _doesn't_ work?\n\nAnd regarding the N, um, what I can say for sure is I'd love to be able to do it without traps, at least without them actually being discernible. Firstly because in general, I hate the look of them more often than not and find they quickly distract too much attention from the letterform itself (I'm still visually scarred by seeing this huge poster with Bell Gothic with about a meter of cap height); and secondly because I think this should have a future as a titling font too. Maybe, if it ends up not working without traps in small sizes, I'd consider doing optical sizes.\n\nCheers!\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "11 Oct 2008 — 1:27pm",
      "content": "I would indeed call type design a Black Art. Except it's not Art.\n\n\\> I still hope I’ll get a result that is usable\n\nI think the consensus is that you're on the right track! One thing to keep in mind here is something rather harsh that I've come to realize over time: to arrive at something _usable_, one must consciously NOT put _everything_ one knows into a single font, as tempting as that might be. Unless your talent is one-in-a-million, trying to make a font some sort of \"ultimate\" always ends in tears.\n\n\\> has anyone ever done this, just for fun, just to see how it doesn’t work?\n\nYes, I have a sample of something like that from a design book, where the author showed a before/after of optical correction. I'll try to find it for you.\n\n\\> this should have a future as a titling font too.\n\nNote that a single font is really only suitable for a narrow range of sizes, so a font for text\\* cannot be used well very large (although some designers disagree). In effect, a text font has to have a certain ugliness to do its job. Scary, I know. _Be_ afraid, be _very_ afraid. :-\\>\n\n\\* In this case very short text however.\n\nhhp\n\n"
    },
    {
      "time": "11 Oct 2008 — 1:58pm",
      "content": "<cite>where the author showed a before/after of optical correction.</cite>\n\nThis one? [Karl-Heinz Lange: _Schrift: schreiben/zeichnen/malen/konstruieren/schneiden. Praktische Anleitung_](http://web.archive.org/web/20150416055918/http:/www.flickr.com/photos/typeoff/2124117583/). From [Dan](http://web.archive.org/web/20150416055918/http:/typophile.com/wiki/Dan%20Reynolds)’s Flickr stream.\n\n"
    },
    {
      "time": "11 Oct 2008 — 2:19pm",
      "content": "_\"I think the consensus is that you’re on the right track!\"_  \n:-) That's cool, especially considering I haven't actually done so much yet (except for a lot of thinking).\n\n_\"to arrive at something usable, one must consciously NOT put everything one knows into a single font, as tempting as that might be. Unless your talent is one-in-a-million, trying to make a font some sort of “ultimate” always ends in tears.\"_  \nOK, let me see if I understand this right. Do you mean the danger lies in trying to make an \"ultimate\" font that would work for any size, any situation, any context, any purpose? I think I've understood that a font needs to be defined for a more or less narrowly defined purpose (maybe unless it's Helvetica ;-) ).  \nOr more like the danger of constantly being undecided in terms of what formal decisions to make, & then trying to cram it all in? (That reminds me of how my mother said to me once, \"when you're preparing a meal, there invariably will be a moment where you definitely need to define whether you're cooking chicken or chocolate cream.\")\n\nWould be cool if you found that example of the non optically corrected font. I'd love to show it to my aunt, & see if she gets the difference.\n\n_\"Note that a single font is really only suitable for a narrow range of sizes, so a font for text\\* cannot be used well very large [...]  \n\\* In this case very short text however.\"_\n\nYou know, I'm wondering with this one. I always thought of it as a titling and display font, certainly not a text font. On the other hand, it struck me when looking at the old samples that it's really nicely legible even in very small sizes, as long as the text isn't longer than maybe four or five lines. I wonder whether these two uses will be possible to reconcile (or more like, whether I'll be able to do that).  \nFWIW, it was originally advertised as a \"Reklame-Grotesk\" and used in advertisements in newspapers, which include both catchy / decorative headlines and tiny text for addresses, notes, & such.\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "11 Oct 2008 — 2:21pm",
      "content": "Oh, Florian, thank you! Very neat. It also hurts my eyes. :)\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "11 Oct 2008 — 2:28pm",
      "content": "Florian, that's a nice one. The one I have is page 51 (which has a transparent overlay) of a book by Ballinger. Here's a half-size, flattened version of the 2-layer Photoshop file I once made:\n\n ![](http://web.archive.org/web/20150416055918im_/http:/typophile.com/files/Ballinger51ab_5033.gif)\n\n\\> Do you mean the danger lies in trying to make an “ultimate” font  \n\\> that would work for any size, any situation, any context, any purpose?\n\nThat too, but there I was talking about resisting the urge to use all of one's \"tricks\" in a single design. NOT doing so might seem like short-changing your design, but my belief is that in practice -maybe because type design is so convoluted- it tends to backfire.\n\n\\> I always thought of it as a titling and display font\n\nWell, the lines are never very clear, but to me this looks like it can be used for a few lines at a time, maybe more if you make a darker version with a smaller x-height.\n\nhhp\n\n"
    },
    {
      "time": "11 Oct 2008 — 2:42pm",
      "content": "The book is: \"Lettering art in modern use\", R Ballinger. But there's more than one edition, and some (like the \"student edition\"\\*) might not have the nice transparent overlay.\n\n\\* What was that trilingual, full-color typography book that got a severely neutered student edition? That was sad. It was some famous German or Swiss guy - I always forget his name for some reason.\n\nhhp\n\n"
    },
    {
      "time": "11 Oct 2008 — 2:45pm",
      "content": "Oh nice one. Thanks a lot!\n\nI think I am understanding what you are warning against, albeit only in an abstract form so far. Do remind me in case I end up making this mistake, yeah?  \nIt's actually kind of a reassuring thought to not _have_ to think of \"all\" the possible options. I like having a somewhat limited freedom in design, or at least the thought that I don't need to try out all 134093284 options in all possible combinations. ;-)\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "2 Apr 2009 — 3:46am",
      "content": "Little P.S.:  \nI have just been alerted that as of yesterday, a digital version of Industria is available at MyFonts under the name of [Ronsard Crystal](http://web.archive.org/web/20150416055918/http:/new.myfonts.com/fonts/redrooster/ronsard-crystal/) (Ronsard was the name for Industria used in France).  \nAm I glad I ended up not just digitizing it…!\n\nUnfortunately, Ronsard's \"N\" is a cop-out of sorts – save for the Extra Bold, which retains the original asymmetry.\n\n"
    },
    {
      "time": "2 Apr 2009 — 6:44am",
      "content": "Since Ronsard Crystal was just released, I have to suspect that this thread of yours was what brought Industria to Red Rooster's attention... Six months sounds about right.\n\nhhp\n\n"
    },
    {
      "time": "2 Apr 2009 — 6:51am",
      "content": "You know, I was wondering about that...  \nMakes you worry about posting stuff on Typophile at all. :-\\\n\n"
    }
  ]
}
