{
  "id": "50188",
  "title": "The 1st day of classes is coming and all the students are excited!",
  "forum": "ebensorkin's blog",
  "tags": [

  ],
  "content": "The 1st day of classes is coming and all the students are excited! It's actually just an IT briefing but somehow it seems symbolic to everyone. I get my bike back from the shop tomorrow. I think I'll bike over to Waitrose and get some lovely dover sole.\n\n-e.\n\n",
  "author": "ebensorkin",
  "time": "5 Oct 2008 — 4:07pm",
  "uid": "2942",
  "comments": [
    {
      "time": "5 Oct 2008 — 4:40pm",
      "content": "Have a good year, Eben!\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2008 — 5:41pm",
      "content": "I hope you blog up a storm about your experiences. I second what Chris said!\n\n"
    },
    {
      "time": "6 Oct 2008 — 12:21am",
      "content": "Best wishes!\n\n"
    },
    {
      "time": "6 Oct 2008 — 12:29am",
      "content": "<cite> ... I hope you blog up a storm about your experiences ... </cite>\n\nSecond that.\n\n+++\n\nHave a great year, Eben!\n\n"
    },
    {
      "time": "6 Oct 2008 — 9:29am",
      "content": "Best of luck, Eben! At least I know that you’ll be posting lots of photos from Reading.\n\n"
    },
    {
      "time": "6 Oct 2008 — 11:02am",
      "content": "Have a great year. Looking forward to hearing about it.\n\n"
    },
    {
      "time": "6 Oct 2008 — 3:41pm",
      "content": "Yey! Good Luck MATD 2009 Students!\n\n"
    },
    {
      "time": "7 Oct 2008 — 2:42am",
      "content": "was it everything you hoped it would be? :D\n\n"
    },
    {
      "time": "8 Oct 2008 — 7:38am",
      "content": "Sounds awesome. Do post links and flickr photos when you get the chance.\n\n"
    },
    {
      "time": "8 Oct 2008 — 8:10am",
      "content": "All the best, Eben. Keep us posted.\n\n"
    },
    {
      "time": "8 Oct 2008 — 9:01am",
      "content": "Have a great year at Reading!\n\n"
    },
    {
      "time": "8 Oct 2008 — 1:43pm",
      "content": "Godspeed, Eben!\n\nI’m trying to keep people updated on my blog and Flickr account but there’s more stuff brewing, from other students too. Reading so far is amazing, it’s so exciting to be here.\n\n"
    },
    {
      "time": "9 Oct 2008 — 9:04am",
      "content": "Suerte!\n\n"
    },
    {
      "time": "9 Oct 2008 — 10:24am",
      "content": "Good Luck with it all Eben!\n\nTake Care\n\nAndy\n\n"
    },
    {
      "time": "10 Oct 2008 — 12:48am",
      "content": "How about a round up of all of this year's students' flickr links, blogs, etc.? We don't want to miss out on anyone :D\n\n"
    },
    {
      "time": "11 Oct 2008 — 4:15am",
      "content": "Thanks for all the support! I really appreciate it!\n\nI think that there is very limited blogging going on so far. I am have something in process but it will be a little while before I shows up. I will ask the other students to send me their links & create a compendium 'o links. Dan - you set quite a high bar for us to meet!\n\nDespite it's being quite early, I am very happy with the way things are going already.\n\nI still haven't been to Waitrose. It farther off than I thought! Maybe today though...\n\n"
    }
  ]
}
