{
  "id": "50180",
  "title": "Ambigram",
  "forum": "ryantauss's blog",
  "tags": [

  ],
  "content": "For my typography class. We were assigned to create an ambigram. I am posting this in hopes that I can get good feed back on what people perceive the ambigram is.\n\nWhen you read it: read the way it is displayed first, What name do you see? Then, rotate 180 degrees and read another name. The second name is not common, so just let me know what letters you perceive.\n\nI would appreciate as much participation as possible. The more the better. Feel free to give constructive feedback for helping letters become more intriguing or more readable.\n\nKeep in mind this is a rough sketch, I will put up improvements as comments come in and as I further explore my own creative ideas.\n\nAgain Thanks.\n\nRyan\n\n ![](http://web.archive.org/web/20081210163313im_/http:/typophile.com/files/HPIM0048_5715.JPG)\n\n",
  "author": "<a href=\"/web/20081210163313/http://typophile.com/user/37567\" title=\"View user profile.\">ryantauss</a>",
  "time": "<br>",
  "uid": "37567",
  "comments": [
    {
      "time": " 5.Oct.2008 1.37pm",
      "content": "I’m sorry I’m not seeing any words that I recognise.\n\n"
    },
    {
      "time": " 5.Oct.2008 1.48pm",
      "content": "I’m guessing this should be read “Ryan”, and then the other way round ... humm ... Tauh-something?  \nIf I hadn’t known it was supposed to be letters, though, I’d have thought this is some weird kind of polynesian script or something. Can you make it a tad more readable?\n\n"
    },
    {
      "time": " 5.Oct.2008 2.09pm",
      "content": "In this direction i can’t read anything. Flipped it’s Tauss? But it’s tough to recognize. Even tougher if I didn’t know your name.\n\n"
    },
    {
      "time": " 5.Oct.2008 6.52pm",
      "content": "thanks for the feed back guys!\n\nI have tried to simplify the letterforms a bit to increase readability. I hope it helps. I Know some of you have figured it out or come close, but try to see it through new eyes. I appreciate all the feed back.\n\nHere are the improvements.\n\nRyan\n\n ![](http://web.archive.org/web/20081210163313im_/http:/typophile.com/files/HPIM0049_3439.jpg)\n\n"
    },
    {
      "time": " 5.Oct.2008 11.02pm",
      "content": "Yeah, that looks better to my eyes. It’s becoming almost readable. :-) Some of the characters look really awkward, but they kind of read. (Like in the flipped view, the u looks backwards.)  \nYou may want to find a more organic / flowing form for that T; seen from this side, it doesn’t really look like it should be a merely decorative element. More like a character flipped upside down.\n\n"
    },
    {
      "time": " 6.Oct.2008 7.32am",
      "content": "the challenge is that extra ’thing’ at the end when you read it as Ryan.\n\n"
    },
    {
      "time": " 6.Oct.2008 9.13am",
      "content": "Thanks Again. I agree with your comments and I am working hard to get this thing readable and the “T” looking decorative when viewing ryan, but become a letter when reading “Tauss”.\n\nThanks for you input\n\nRyan\n\n"
    },
    {
      "time": " 6.Oct.2008 1.59pm",
      "content": "I’m guessing “RSrnnL” and “TausSSi” is not the hoped-for reading? :-)\n\n"
    }
  ]
}
