{
  "id": "50203",
  "title": "New Corp Logo and typeface",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Im redesigning the identity for a well known lounge and I was interested in some feed back.  \nTell me what you think of the Logo and the typeface. Any help will be appreciated.\n\n ![](http://web.archive.org/web/20131021183352im_/http:/typophile.com/files/stardust_6096.jpg)\n\n",
  "author": "nguerrero",
  "time": "6 Oct 2008 — 12:07am",
  "uid": "37740",
  "comments": [
    {
      "time": "6 Oct 2008 — 3:05am",
      "content": "I take it this lounge is primarily stylish rather than comfortable?\n\nThe circular o's don't seem to fit in with the rest of the type. I like the idea with the stars, though.\n\n--  \n_learning is inherently an act of humiliation._\n\n"
    },
    {
      "time": "6 Oct 2008 — 4:16am",
      "content": "Try o's with a similar shape to the loop on the d.\n\nI really don't like the light blue squares. I find them distracting. I also think perhaps the tail of the biggest star should end in a similar curve to the edges of the stars. The current steps plus those blue squares make the design look too much like coloured-in graph paper.\n\nThe darker blue, orange and sandy tones work really well together.\n\n"
    },
    {
      "time": "11 Oct 2008 — 11:26am",
      "content": "What kind of a lounge is it? That's the first question.\n\nThe logo itself looks awkward. The line & star underneath \"room\" does not connect in any way to the rest of the logo. I would get rid of the line/star, and only concentrate on the words \"stardust room\", and perhaps incorporate the stars as you did between the \"a\" & \"r\" and the \"o\" & \"m\".\n\n\"Stardust\" and \"Room\" look like they're written in 2 different typefaces. Did you hand-draw this word mark? I think the \"m\" in room needs to have a point on some corner like in the \"u\". And the relationships between the letters in \"room\" needs to be fixed. They need to relate or connect somehow. Definitely revise the o's. They should not be perfect geometric circles. They should be rectangular in some way like the rest of the letters. Narrower or with a point on an edge or two. Experiment and see what fits best with both words.\n\n"
    }
  ]
}
