{
  "id": "50206",
  "title": "LCM Grid?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey everyone!\n\nA couple of months ago a friend of mine had the chance to intern with one of India's best graphic designer, Mahindra Bhai Patel in Bombay. He had conducted a workshop where he had taught her (and the rest of the group) something called the LCM grid. From what i can gather, its one that requires quite a bit of mathematical calculation but works on the LCM of the page size rather than the Golden ratio.\n\nThats all i could \"extract\" from my friend and its going to be a while till i meet mr Patel once again...\n\nSoooo, does anyone know what this LCM grid is all about?\n\n",
  "author": "Arjun",
  "time": "6 Oct 2008 — 3:19am",
  "uid": "28693",
  "comments": [
    {
      "time": "6 Oct 2008 — 4:21am",
      "content": "If it is the _minimo comune multiplo (denominatore)_, the Least Common Multiple is the smallest number that two or more numbers will divide into evenly.  \nI have never seen that theory applied to a grid, tho, interesting, please post your findings.\n\n"
    },
    {
      "time": "6 Oct 2008 — 4:23am",
      "content": "true but how is that applied to a grid on the page???\n\n--  \narjun\n\n"
    },
    {
      "time": "9 Oct 2008 — 12:49am",
      "content": "Hy Arjun, first of all its really good to hear Patel Sir's name here, he is really a great mentor, fortunately i got a chance to work on some projects with him.\n\nWell LCM grid is a technique to find out no. of columns and their optimum width suitable for a particular page size, so you get the consistent divisons and there wont be any extra space left after drawing columns.\n\nThe most commonly used LCM is 12, because its a divisible for both even and odd, so you get a flexibility of working with 2,3 and 4 column chunks.\n\nPreviously designers had to use a formula for manually calculating the column widths accordingly to desired LCM, but now with InDesign you can directly define it easily.\n\n ![](http://web.archive.org/web/20150322042434im_/http:/typophile.com/files/12-LCM-Grid_5114.gif)\n\nSee the image, above its a 12 column LCM grid, might make clear.\n\n"
    },
    {
      "time": "9 Oct 2008 — 3:45am",
      "content": "I see what you mean with \"LCM grid,\" thank you, Nitin, that makes sense, it is also intuitive.\n\n"
    },
    {
      "time": "9 Oct 2008 — 9:33am",
      "content": "Ah!\n\nThank you so much for that Nitin! Thats cleared up something thats kept me from sleeping for quite a few nights!\n\n--  \narjun\n\n"
    },
    {
      "time": "9 Oct 2008 — 10:01am",
      "content": "I am glad that it helped you. Also see the link down, that will make everything clear.\n\n[www.subtraction.com/pics/0703/grids\\_are\\_good.pdf](http://web.archive.org/web/20150322042434/http:/www.subtraction.com/pics/0703/grids_are_good.pdf \"www.subtraction.com/pics/0703/grids\\_are\\_good.pdf\")\n\n"
    },
    {
      "time": "10 Oct 2008 — 5:10pm",
      "content": "Nitin:  \nWhat a great resource!\n\nHeh, this reminds me of a diagram I once made for a client to explain what I meant by \"divine proportion\" :)\n\n ![](http://web.archive.org/web/20150322042434im_/http:/typophile.com/files/goldengrid_4250.gif)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20150322042434/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    }
  ]
}
