{
  "id": "50223",
  "title": "Accent height - Multiple Master ?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’m generating the intermediate weights from a MM fonts but I’ve noticed a problem with the placement of the accents in the uppercase glyphs of the bold weight that is generated.\n\nI’ve created the MM font with the light and bold weights, if I then generate the bold weight so the Generate instance weight slider is set to 1000 the font created is the same weight as the original bold weight used to create the MM font. The problem is the accents in this generated bold are higher than they were in the original.\n\nIn the image the glyph on the left is the generated bold and on the right the bold that was used to create the MM font.\n\n ![](http://web.archive.org/web/20081023162901im_/http:/typophile.com/files/Picture-2_5449.gif)\n\nAfter some testing it seem to only happen to the uppercase glyphs and those that are composites.\n\nIf I decompose the glyphs before creating the MM font the problem doesn’t seem to happen.\n\nIs this the solution ?, do you have to decompose all the glyphs before creating the MM font ?\n\n [‹ Opentype randomizing: success/horror stories?](http://web.archive.org/web/20081023162901/http:/typophile.com/node/50303 \"Go to previous forum topic\") [Help generating InDesign small size pdf ›](http://web.archive.org/web/20081023162901/http:/typophile.com/node/50554 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081023162901/http://typophile.com/user/16986\" title=\"View user profile.\">RachelR</a>",
  "time": "<br>",
  "uid": "16986",
  "comments": [
    {
      "time": " 9.Oct.2008 5.18pm",
      "content": "How do you create the MM font?  \nA.\n\n"
    },
    {
      "time": " 10.Oct.2008 12.02am",
      "content": "1. I have the light and bold weights open - these weights oulines have been checked with AFDKO’s Fix Contour order, sharp angles and start points and Outline check  \n2. With the light weight selected, Tools - Mask - Assign font Mask, and select the Bold weight.  \n3. Then, Tools - Multiple Master - Define New Axis, and select weight.  \n4. Then select all glyphs in the light weight, Tools - Multiple Master - Mask to Master and select Wt1\n\n"
    },
    {
      "time": " 10.Oct.2008 9.59am",
      "content": "Rachel,\n\ncould you try using Tools / Blend Fonts and create a MM there, and compare the results?  \nA.\n\n"
    },
    {
      "time": " 12.Oct.2008 1.34pm",
      "content": "Adam, I have found the Blend Fonts option creating too many unwelcome changes in my fonts. What is the preferred option to create an MM with NO CHANGES in the data?\n\n"
    },
    {
      "time": " 16.Oct.2008 11.26am",
      "content": "Bill,\n\nwhich version of FontLab Studio specifically did you try Blend Fonts with? 5.0.4 or earlier?\n\nAdam\n\n"
    }
  ]
}
