{
  "id": "5023",
  "title": "Tyc logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm reworking the tyleryoungcreative site to focus on commercial photography. So, here's a run at a new tyc logo.   \n   \nI like this idea because it is playful and approachable ( I want approachable). I'm unsure of it because it might be a little too playful, too child-like.   \n   \nBut I do like the merging of the tyc with little people in increasing states of excitement, culminating in a smile. Say cheese!   \n   \nOr perhaps not. Too cheesy?   \n   \nI'm having trouble with the overall composition balance and kerning too.   \n   \n ![](http://web.archive.org/web/20131018163926im_/http:/www.typophile.com/forums/messages/29/37241.gif)\n\n",
  "author": "tyleryoung",
  "time": "1 Jun 2004 — 1:00pm",
  "uid": "2139",
  "comments": [
    {
      "time": "1 Jun 2004 — 1:21pm",
      "content": "Here is an attempt to pull the characters together more effectively. Also, a spin on the RGB color wheel. Good for the photo metaphor.   \n   \nThe c continues to be problematic though, leading to the second version of the rgb. It may actually be better anyway, if I show the combining of the colors. Not sure how I feel about the separation of the tyler young from the word creative though. Could be good, could be bad.   \n   \n   \n   \n ![](http://web.archive.org/web/20131018163926im_/http:/www.typophile.com/forums/messages/29/37251.gif)   \n   \n   \n   \n ![](http://web.archive.org/web/20131018163926im_/http:/www.typophile.com/forums/messages/29/37252.gif)\n\n"
    },
    {
      "time": "1 Jun 2004 — 1:35pm",
      "content": "the color wheel...   \n   \n   \n ![](http://web.archive.org/web/20131018163926im_/http:/www.typophile.com/forums/messages/29/37255.gif)\n\n"
    },
    {
      "time": "1 Jun 2004 — 1:37pm",
      "content": "Within the context of letters representing people, the last symbol must represent sex, right? I'm not sure if I would consider this approachable for the general population, but I'm not sure who you're targeting.   \n   \nAn alternative way, and perhaps a more sophisticated and mature approach, to represent people in your letters would simply be to use these or some other bold letterforms to mask your photography:   \n   \nT = photo of a man   \nY = photo of a woman   \nC = photo of ?\n\n"
    },
    {
      "time": "1 Jun 2004 — 1:44pm",
      "content": "Tyler -- tell us more about the commercial   \nphotography and who the clients will be ...   \n is this separate from the motorsports stuff ...   \n   \nwhat will you actually be doing ...   \n   \ndefinitely need s'more info.   \n   \nbj\n\n"
    },
    {
      "time": "1 Jun 2004 — 1:56pm",
      "content": "Scott,   \n   \nWow! I didn't get that connotation at all! In fact, when I first read your input, I still didn't get what you meant. Did you mean the smiley face was some sort of slang symbol meaning sex nowadays? Or (slowly dawning on me) that a man symbol plus a woman symbol meant a smile? I assume that this is what you meant.   \n   \nI don't see an overt relationship between a man and a woman equalling a (post coital I assume) smile. That train of thought could easily head toward love or friendship too, no?   \n   \nI do recognize your point though, and it is a good one. I need to think about the photo idea though. I really would like to keep the logo as blocked out as possible. Even the secondary colors are pushing it a bit.   \n   \nBJ,   \n   \nGreat icon! So funny ![:-)](http://web.archive.org/web/20131018163926im_/http:/www.typophile.com/forums/clipart/happy.gif) TYC will be a regular old photographer resume site--weddings, family portraits, modeling portraiture, commercial location work, and even pro-bono alternative sports coverage. I want the logo to be unassuming and welcoming, rather than the fancy image most photographer sites project (including, in its own way, the current tyc site).\n\n"
    },
    {
      "time": "1 Jun 2004 — 2:18pm",
      "content": "The problem with the smiley face, is that by its association with the other symbols I assume that the shapes represent torsos, arms and heads, not a sideways mouth and eyes. In this context, I see a torso/arms with a head on top of another torso/arms and a head, embracing. The only reason I assume it is sexual is because they are horizontal.   \n   \nMaybe it's just me.\n\n"
    },
    {
      "time": "1 Jun 2004 — 2:24pm",
      "content": "I see your point. The leap might be too great between the c and the other two characters.\n\n"
    },
    {
      "time": "2 Jun 2004 — 1:21pm",
      "content": "I agree with Scott's interputation of the man, woman, sex look of the letterforms. The C looks like a couple embracing not like a smiley face on it's side. The first two characters are upright figures, to then switch to a face on it's side is a bit of a jump. I had to go back to try and see the smiley. Did you try it with a plain C, sans eyes (heads)? The logo on it's own says fertility center or family planning, not photography. And so I also agree with Scott on his suggestion of incorporating photos with the letters. It could work with the photo inside the letter or the circle as a photo and the letter ko's. It might be a little difficult finding the right photo to work with the letter forms. If your plan is to build a weddings/family portrait client base, perhaps a simple textural image would work - close up of lace, or hair, etc. However, that approach may not work with the no-frills persona you are trying to represent. The soft rounded forms and human element does say friendly and approachable, however if you are aiming this at the general public they are not going to understand the RGB color wheel. Since you are going through the creative process of creating a logo for yourself it should somehow reflect your personality/photographic style (imo). I see a lot of energy in your photos which isn't expressed by this logo. Then again if your aim is weddings that might not be appropriate. Looking forward to seeing your next post.\n\n"
    },
    {
      "time": "6 Jun 2004 — 11:42pm",
      "content": "Here's another stab at the smiley face. Overall, I'm not sure that this look is what I'm after. But, I'll follow this one through just for the heck of it.   \n   \n   \n ![](http://web.archive.org/web/20131018163926im_/http:/www.typophile.com/forums/messages/29/37690.gif)\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:47am",
      "content": "and now, for something completely different.   \n   \n ![](http://web.archive.org/web/20131018163926im_/http:/www.typophile.com/forums/messages/29/37925.gif)\n\n"
    }
  ]
}
