{
  "id": "50246",
  "title": "Perfetto a new classic serif by Hubert Jocham",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "If you ask a typographer about Old Style he will tell you something about Aldus Manutius and Claude Garamond and maybe something about humanistic handwriting and the italic. But you would not consider the following serif as classic oldstyle.  \nIt is based on a tyoeface Giovanni Francesco Cresci wrote with a pen with an x-height of 8 mm. It was published in his book »Il perfetto Scrittore« in 1570. You can also see it in Tschicholds »Meisterbuch der Schrift«.  \nThe upper case letters are almost like the Capitalis Monumentalis. The lower case seem almost neoclassic and are very elegant. I only took the lowercase as a basis for Perfetto and wanted to keep the elegance and make a modern useful Serif. I started with the display version with thin hairlines and created the text version later. The display version has 9 weights with italics up to extrabold and ultrabold. The text version has only 7 weights, because extrabold and ultrabold make no sence in text.\n\nThe upcoming Pro version will have small caps, different sets of figures, some ligatures, Latin 2, turkish and baltic letters.\n\n[www.hubertjocham.de/item.php/type/serif/Perfetto/](http://web.archive.org/web/20150321004922/http:/www.hubertjocham.de/item.php/type/serif/Perfetto/ \"www.hubertjocham.de/item.php/type/serif/Perfetto/\")  \n [www.hubertjocham.de/item.php/type/serif/PerfettoDis/](http://web.archive.org/web/20150321004922/http:/www.hubertjocham.de/item.php/type/serif/PerfettoDis/ \"www.hubertjocham.de/item.php/type/serif/PerfettoDis/\")\n\n ![](http://web.archive.org/web/20150321004922im_/http:/typophile.com/files/NewWassPerfetto_5322.jpg)\n\n ![](http://web.archive.org/web/20150321004922im_/http:/typophile.com/files/Perfettoweights_4306.jpg)\n\n",
  "author": "hubertjocham",
  "time": "7 Oct 2008 — 4:25am",
  "uid": "6380",
  "comments": [
    {
      "time": "15 Oct 2008 — 10:30am",
      "content": "italic weights seems to be really nice :)\n\n"
    },
    {
      "time": "15 Oct 2008 — 10:32am",
      "content": "What? Only 9 weights? pfft!\n\n;o)\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:30pm",
      "content": "Wonderful. I'd wish there were just the basic roman+italic+small caps.  \nIt's a face I could really use, but I am constantly put off by big familes of more than 3 weights (or 6 variants).\n\n"
    }
  ]
}
