{
  "id": "50269",
  "title": "TypeTrust presents Recovery by James Puckett",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "My new typeface “Recovery” is now available from [TypeTrust.](http://web.archive.org/www.typetrust.com) Recovery is a reinterpretation of Charles Coiner’s letter designs for the National Recovery Administration and M.F. Benton’s typeface “Eagle Bold” which was based on Coiner’s work. Recovery comes in one weight with small caps, fractions, and an extended character set.\n\nView and buy it [here: http://typetrust.com/font/recovery](http://web.archive.org/web/20131017031833/http:/typetrust.com/font/recovery)\n\nAnd the [PDF is here](http://web.archive.org/web/20131017031833/http:/www.typetrust.com/fonts/specimen_pdfs/TypeTrust-Recovery.pdf).\n\nThanks to Silas Dilworth for his invaluable assistance with the production of this typeface.\n\n ![](http://web.archive.org/web/20131017031833im_/http:/typophile.com/files/recovery_release_5416.jpg)\n\n",
  "author": "blank",
  "time": "7 Oct 2008 — 12:46pm",
  "uid": "14722",
  "comments": [
    {
      "time": "7 Oct 2008 — 1:03pm",
      "content": "Congratulations, James!\n\n"
    },
    {
      "time": "7 Oct 2008 — 1:09pm",
      "content": "nice! (And damn...only $20!?)\n\n"
    },
    {
      "time": "7 Oct 2008 — 1:21pm",
      "content": "Is this a change of mind from your [earlier distribution plans](http://web.archive.org/web/20131017031833/http:/typophile.com/node/48848)?\n\n"
    },
    {
      "time": "7 Oct 2008 — 1:45pm",
      "content": "@Craig: Yes, I decided against doing a free release. It really came down to me deciding that the type would be better served by working with a foundry to produce a font of a higher caliber than I could do on my own.\n\n"
    },
    {
      "time": "7 Oct 2008 — 1:54pm",
      "content": "Congrats James!  \nNice to see you join TheTypeTrust.\n\nSilas and Neil are doing an amazing job over there.\n\nbest,  \nDino\n\n"
    },
    {
      "time": "7 Oct 2008 — 2:07pm",
      "content": "Well done, James. Congrats!\n\n"
    },
    {
      "time": "7 Oct 2008 — 2:54pm",
      "content": "Bravo, James! Good to see you've put your work on the market!\n\nChrisL\n\n"
    },
    {
      "time": "7 Oct 2008 — 3:03pm",
      "content": "Makes sense. Congrats and good luck with it!\n\n"
    },
    {
      "time": "7 Oct 2008 — 3:04pm",
      "content": "Love the timely specimen text and hopeful name, too!\n\n"
    },
    {
      "time": "7 Oct 2008 — 3:52pm",
      "content": "We priced it affordably since it's a titling face with a limited character set... no lowercase.\n\n"
    },
    {
      "time": "7 Oct 2008 — 5:11pm",
      "content": "Congratulations James!\n\n"
    },
    {
      "time": "7 Oct 2008 — 8:46pm",
      "content": "First of all, congratulations, James!\n\nI notice in your specimen PDF that where you present the diacritics, the capital dotted i (İ) is paired with what looks like a small cap (that functions as a lowercase) undotted i. Is this a typo in the PDF or a bug in the font?\n\n"
    },
    {
      "time": "8 Oct 2008 — 6:17am",
      "content": "Nice, James. TypeTrust also seems like a good place to be at. :)\n\n"
    },
    {
      "time": "8 Oct 2008 — 4:59pm",
      "content": "Excellent work, James.\n\nSharon\n\n"
    },
    {
      "time": "8 Oct 2008 — 7:06pm",
      "content": "The \"idot\" was my mistake. Just an oversight in the PDF. Thanks for bringing that to our attention, Brian.\n\n"
    },
    {
      "time": "9 Oct 2008 — 4:25am",
      "content": "Bought.\n\n"
    },
    {
      "time": "9 Oct 2008 — 5:46am",
      "content": "Congratulations James. Keep it up!\n\n"
    },
    {
      "time": "9 Oct 2008 — 8:43am",
      "content": "Looks great. I've always been a big fan of Eagle, going back to when it first came to my attention as part of the redesign of Publish! magazine back in the early '90s.\n\nJames, I'm curious what you see as the differences/strengths of your version compared to the Font Bureau interpretation.\n\n"
    },
    {
      "time": "9 Oct 2008 — 8:49am",
      "content": "Congrats. Now that’s a comma!\n\n"
    },
    {
      "time": "9 Oct 2008 — 9:31am",
      "content": "I haven’t actually licensed FB Eagle, so I can’t go into too much detail based on the specimen I have. Coiner’s letters for the NRA often feel a little harder and draw more attention and I tried to work that into Recovery. FB Eagle Bold feels a little lighter, some angles and points aren’t as sharp, and overall it feels a little quieter, perhaps because Dave drew it to work alongside the book weight. There are also some letters in both that depart pretty dramatically from the quirky gothic letters by Benton: Recovery drops Benton’s too-narrow S, FB Eagle uses a different K for example.\n\nEagle also features a much larger character set and fractions, whereas FB Eagle adds a lowercase.\n\n"
    },
    {
      "time": "9 Oct 2008 — 10:16am",
      "content": "Thanks for your comments, James.\n\n"
    },
    {
      "time": "9 Oct 2008 — 12:05pm",
      "content": "Hurray! Beautiful work James!\n\n"
    },
    {
      "time": "9 Oct 2008 — 10:35pm",
      "content": "Handpicked.\n\n"
    },
    {
      "time": "10 Oct 2008 — 12:42am",
      "content": "Congratulations!  \n<cite>Lage raho,</cite> in India we say.\n\n"
    },
    {
      "time": "10 Oct 2008 — 12:47am",
      "content": "_Eagle also features a much larger character set and fractions, whereas FB Eagle adds a lowercase._\n\nDo you mean _ **Recovery** also features a much larger character set and fractions, whereas FB Eagle adds a lowercase._ ?\n\n"
    },
    {
      "time": "10 Oct 2008 — 7:53am",
      "content": "<cite>Do you mean Recovery also features a much larger character set and fractions, whereas FB Eagle adds a lowercase. ?</cite>\n\nSorry, I mistyped. Recovery has the big character set and Eagle has the lowercase.\n\n"
    },
    {
      "time": "11 Oct 2008 — 8:10pm",
      "content": "Congratulations, James!\n\n"
    },
    {
      "time": "12 Oct 2008 — 2:34am",
      "content": "Recovery spotted on [iLT](http://web.archive.org/web/20131017031833/http:/ilovetypography.com/) :-)\n\n ![](http://web.archive.org/web/20131017031833im_/http:/typophile.com/files/october_4261.png)\n\n"
    },
    {
      "time": "12 Oct 2008 — 1:42pm",
      "content": "Way cool!\n\n"
    },
    {
      "time": "12 Oct 2008 — 1:44pm",
      "content": "And deserved!\n\n"
    },
    {
      "time": "15 Oct 2008 — 10:53am",
      "content": "_...who we are and where we are going._\n\nJames, how could you?  \nYour first release is a copy--and not only that, but one where you diss the master by professing to improve upon his mistakes.  \n\"Reinterpretation\", which is a dubious concept at best, is a lot more than sharpening a few points, fiddling with some character widths and metrics, and substituting an anachronistic 'S\".  \nPlease, don't go there again.\n\n"
    },
    {
      "time": "15 Oct 2008 — 12:22pm",
      "content": "<cite>Please, don’t go there again.</cite>\n\nI’m not planning to go there again. Since releasing Recovery I’ve been considering the same things you pointed out in your post. The semantics are just the tip of the iceberg, and had I thought about it all six weeks ago this font would have died at HAMBURGEFONS. For the foreseeable future I’ll be leaving revivals/reinterpretations/copies/clones to others and focusing on more original work.\n\n"
    },
    {
      "time": "15 Oct 2008 — 12:58pm",
      "content": "Congratulations, James!\n\n"
    },
    {
      "time": "22 Oct 2008 — 11:40am",
      "content": "Nick, If Recovery is a copy, then what is FB Eagle?\n\nI don't believe it's a \"diss\" to make considered, subjective changes when producing a digital revival, especially if they are measured and intended by the designer and preferable to the user. In addition to the more notably redrawn \"S\", Recovery exhibits what I would argue to be a more balanced visual equality. The repositioning of counters/bowls alone is a notable departure from what James rightfully refers to as Benton's \"quirky gothic letters\". James never referred to anything as a mistake on Benton's part.\n\nI also respectfully object to your tone. \"Fiddling with some character widths and metrics\" is one of the greatest technological advantages we have today in chasing a well-designed and well-proportioned typeface. We learn through play, and if Benton were to work in FontLab today, I'm sure he'd fiddle a symphony.\n\n"
    },
    {
      "time": "22 Oct 2008 — 1:12pm",
      "content": "_Nick, If Recovery is a copy, then what is FB Eagle?_\n\nA respectful copy.\n\n_James never referred to anything as a mistake on Benton’s part._\n\n\"Recovery drops Benton’s too-narrow S...\"\n\n_“Fiddling with some character widths and metrics” is one of the greatest technological advantages we have today in chasing a well-designed and well-proportioned typeface._\n\nWell, that's debatable. The design and proportions of a typeface bear an intimate relationship to the technology used at the time it's made. So fiddling isn't really a technological advantage, because all eras have technology that can be used to finesse widths and metrics.\n\nBut the point I was making was not about the merits of tinkering per se, but that Recovery is claimed to be a \"reinterpretation\", not a close revival with one letter redesigned and a lot of subtle nuancing. Looking at Coiner's letters (are there more than four in this style?) one would expect a reinterpretation to be much different than closely following in the footsteps of Benton and Berlow.\n\nLook, I've done revivals, and while I think original work deserves more respect, I don't think there's anything inherently wrong with doing them, although it's an ethical minefield. What prompted me to contribute to this thread was the gap between James' ambitious conception of the amount of socially relevant meaning that can inform a typeface, and the reality of releasing a close copy as one's first commercial type design. At Typecon, he showed me an original design he was working on, so I was disappointed to see Recovery and not that.\n\nHopefully he will give me similar consideration next time I post a new release in this forum...\n\n"
    },
    {
      "time": "22 Oct 2008 — 2:26pm",
      "content": "I think \"reinterpretation\" is a fair and accurate term. An analogy...\n\nA text can be interpreted from one language to another—or even from an older dialect to more modern usage—and be \"fiddled\" with enough with respect to the meanings of words and the nuance of grammar. The spirit of the text ought to remain the same. Whether it is true to the original is a matter of subjective comprehension and perception. Scholars and critics may argue indefinitely over all the finer points. Publishers will print variations as the market demands and ethics abide.\n\nSimilarly, a typeface can be interpreted. Coiner's work was invariably filtered by Benton's experience and the technology of their day, and further augmented by Font Bureau to meet the demands of the _Publish!_ project. James has chosen to interpret Coiner's and Benton's work, contributing a certain degree of nuance that many will find valuable and preferable to other reproductions. Recovery is recognizably rooted in the ATF Eagle specimen. For that it is an interpretation, however faithful you wish to judge it. Recovery comes after FB Eagle, so we respectfully call it a \"_re_interpretation\". There's nothing dubious about the word.\n\nI believe \"a lot of subtle nuancing\" is a considerable contribution to breathing new life into a typeface. In any sort of design practice, nuance is the fine line between a desirable work and something less preferable.\n\nJames may have come across as ambitious in his artist's statement _slash_ ad copy, but such is the nature of marketing. He's an inspired and disciplined new talent. I don't think it's fair to scold him for being so. I personally pushed him to work on the Recovery PDF so as to explain his intentions with this project, so blame me for fostering his lofty claims. His passion for this stuff is however evident and valued. Recovery is an excellent first release.\n\n"
    },
    {
      "time": "22 Oct 2008 — 3:07pm",
      "content": "A few things:\n\nI meant no disrespect to Benton. But I don’t think that Eagle Bold was a perfect typeface (nor do I consider my work perfect), and I hardly think that my saying so is any sort of attack on a great designer.\n\nAs for the revival/reinterpretation argument, at the end of the day it’s a relatively trivial argument over semantics. Maybe revival would be a better word. Maybe it’s the word I would have used if I had the decades of experience under my belt that Nick does. But it was not chosen to try and raise myself up over any other designer. Nor was it used to imply that Recovery is an original design.\n\nThe essay in the Recovery specimen isn’t great. I’ll probably end up rewriting it. But it’s really just ad copy—it’s not like this is appearing in _Baseline_. In retrospect, I overstressed the importance of Coiner because I felt that his contribution to the design of Eagle is neglected—the entire design is usually attributed to Benton. This was not meant as a slight to Benton, although I see how it can be interpreted that way.\n\nAnd as for my original works, they’re coming. Recovery was done as a break from art school before getting back to the original stuff. The face I showed at Typecon is a very ambitious design; I doubt it will see a release for at least a few years. Then again, with the job market the way it is, I may have time to get it done by spring ;)\n\n"
    },
    {
      "time": "23 Oct 2008 — 1:02am",
      "content": "James, what I worry about in the PDF is the page devoted to an Obama quote. Don't get me wrong, I love Obama! I contributed to the campaign. But I think that it is questionable to advertise products with quotes from active politicians. Once someone has gone into retirement (a la Clinton?), OK. Once they are dead, perfect! Then I guess it can be fair game to use their words to help sell products. Why not a pertinent quote from Kennedy, or FDR, or whoever. FDR would certainly fit right now, I guess. If you are going to go in and retool the PDF, please take a look at that page again, too.\n\n"
    },
    {
      "time": "23 Oct 2008 — 4:58am",
      "content": "I haven't seen this earlier... Congratulations, looks really good.\n\n"
    },
    {
      "time": "23 Oct 2008 — 6:14am",
      "content": "@Dan: \"Questionable\" because it might imply the candidate endorsing the font? \"Questionable\" because it might put off potential customers of different political persuasions?\n\n"
    },
    {
      "time": "23 Oct 2008 — 6:54am",
      "content": "Dan, the Obama quote was added because I find it pretty eerie that bad government, bad lenders, and bad borrowers have America on the brink of an economic depression. Pundits are already plotting the New New Deal. So the historical connection is interesting.\n\nThat and, living in downtown DC, politics is just never out of my mind.\n\n"
    },
    {
      "time": "23 Oct 2008 — 7:05am",
      "content": "\\> “Questionable” because it might imply the candidate endorsing the font?\n\nWell, more this one actually; I don't think that anyone can ever expect all of one's customers to agree with them on everything.\n\nBut I just think that such a quote is in less than good taste. It puts current politicians up on a pedestal, which they should not be placed upon, no matter how much we might agree with them or want to support them at the moment.\n\nJames, if you had used any Great Depression-era quote, customers know would get your prescient eerie-ness just the same!\n\n"
    },
    {
      "time": "23 Oct 2008 — 7:06am",
      "content": "Good point, Dan. Next time around I’ll stick with FDR quotes.\n\n"
    },
    {
      "time": "23 Oct 2008 — 8:17am",
      "content": "I thought were were only allowed to typeset Obama quotes in Gotham?\n\n"
    },
    {
      "time": "23 Oct 2008 — 9:16am",
      "content": "_Next time around I’ll stick with FDR quotes._\n\nScrew that. There's nothing wrong with wearing your politics on your sleeve.  \n(My critique was you didn't deliver on the promise of change!)\n\nA radical socio-political stance may not work for a corporation like Linotype, but it's branding for the likes of Virus.  \nAll business cares about is the bottom line. Segueway to Gill.\n\n"
    },
    {
      "time": "24 Oct 2008 — 12:28am",
      "content": "Quoting Barack Obama is not a radical socio-political stance. Quoting someone more left-wing who is less likely to win the presidency might be, though (i.e., Ralph Nader, Dennis Kucinitch,…).\n\n"
    },
    {
      "time": "24 Oct 2008 — 10:45am",
      "content": "_Quoting Barack Obama is not a radical socio-political stance._\n\nWell no, I was like, Linotype would never hype its wares thusly:\n\n ![](http://web.archive.org/web/20131017031833im_/http:/typophile.com/files/nposter_4213.jpeg)\n\n"
    },
    {
      "time": "26 Oct 2008 — 2:03pm",
      "content": "Awesome poster.\n\nCross you fingers.\n\n"
    },
    {
      "time": "21 Jan 2009 — 12:48am",
      "content": "james i love recovery, and as soon and the piggy bank allows, will purchase it. soon hopefully. nice work!\n\n"
    }
  ]
}
