{
  "id": "5026",
  "title": "Chinatown Night Market",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "\\<font class=\"dontLookLikeCrap\"\\>This is for the SF Chinatown Night Market. They want something that will appeal to corporate sponsors for the event, but still allude to the roots of this event.   \n   \nThere are two concepts, the one I am showing right now focusses more on the Sanf Francisco aspect of the event, not so much the NIGHT-MARKETness of the event (that comes later).   \n   \nI don't think Filosphia is appropriate really, but it says San Francisco to me, and I'm including it for that reason.   \n   \nThe second treatment happened kinda by accident, this was used for the chinese characters on the other concept, but I liked how it looked with Latin glyphs. But it seems a little thin, and I only have one weight to work with.   \n   \nNew Clarendon seems to be working the best. Says SF, looks conservative and classic.   \n   \nCould try some Sans treatments, but since the Chinese characters are more traditional brushstroke I think a serif is the way to go.   \n   \nWould really love your input/suggestions. Spent a lot of time on the mark/illustration so the type part has got to happen between now and tomorrow morning :/   \n   \nThank a bunch folks.   \n   \n\\</font\\>\n\n",
  "author": "markatos",
  "time": "1 Jun 2004 — 4:13pm",
  "uid": "1839",
  "comments": [
    {
      "time": "1 Jun 2004 — 4:16pm",
      "content": "the image   \n   \n ![](http://web.archive.org/web/20131019234316im_/http:/www.typophile.com/forums/messages/29/37272.gif)\n\n"
    },
    {
      "time": "1 Jun 2004 — 4:32pm",
      "content": "Nice artwork! Of the three you have, the New Caledonia looks the best to me. The color seems to blend best with the Chinese characters, and the line you have there nicely parallels (in both ways!) the horizontal rooflines. The spacing on Filosofia seems too wide to me.\n\n"
    },
    {
      "time": "1 Jun 2004 — 4:35pm",
      "content": "thanks Steve.   \n   \nI forgot to mention that I haven't done any kerning yet, so please disregard those gaps between the A and I.\n\n"
    },
    {
      "time": "1 Jun 2004 — 6:36pm",
      "content": "here's the other concept. FF Gothic and Syntax will be used for supporting text. In a strange sort of way FF Gothic looks somewhat 'eastern' to me.   \n   \nLet me know what you all think as to whether I need to blur/white out the area behind the text that runs over the lanterns.   \n   \n ![](http://web.archive.org/web/20131019234316im_/http:/www.typophile.com/forums/messages/29/37283.gif)\n\n"
    },
    {
      "time": "2 Jun 2004 — 5:45am",
      "content": "A once saw a bold condensed sanserif used for a kung fu school. It looked great.   \n   \nI feel like if you used a san serif face the title wouldn't be competing with the traditional chinese lettering and architecture.\n\n"
    },
    {
      "time": "2 Jun 2004 — 8:33am",
      "content": "Yes, I was going to try a condensed sans, thanks for the reminder.   \n   \nThat is a sans in the middle though (FF Gothic). Perhaps the outlines are too distracting?\n\n"
    },
    {
      "time": "4 Jun 2004 — 4:14am",
      "content": "Hey Peter   \n   \nDamn I hate it when you guys make TWO good logoes... I like them both and was just about to comment on the lack of kerning but then I saw you where not there yet...   \n   \nCant wait to see the finished one... any color on the logo?   \n   \nKeep it up   \n   \nMark   \n   \nDK\n\n"
    },
    {
      "time": "4 Jun 2004 — 7:00am",
      "content": "Peter, is this logo only going to appear in San Francisco? If so loose the words San Francisco. Also try stacking Chinatown on one line and Night Market on a second line they might justify. It could make a nice unit. I prefer the chinese laterns, implies light. Over all nice stuff\n\n"
    },
    {
      "time": "4 Jun 2004 — 10:14am",
      "content": "Yes, this is only an SF sort of thing.   \n   \nThat's a good idea about the stacking, though it ends up covering more of the front lantern, which I haven't been pleased with.   \n   \nHowever, it looks like they want to call it SF Chinatown Nightmarket Fair, so a stacking could be in order. Though I think Fair is redundant.\n\n"
    },
    {
      "time": "4 Jun 2004 — 1:53pm",
      "content": "I agree loose the Fair. If they insist on San Francisco stack it too and make it much smaller. Maybe the lantern(s) could go to the left or right side or both of the title, just not behind. Just thoughts\n\n"
    },
    {
      "time": "4 Jun 2004 — 2:02pm",
      "content": "I just had another thought, I know whats bugging me about your artwork, its too slick. Keep the lantern(s), but do them in Chinese ink painting style. Black ink on silk with a brush. A trip to the local museum might be in order.\n\n"
    },
    {
      "time": "5 Jun 2004 — 8:06am",
      "content": "Man, those zwo are pretty. It does look quite timeless and vernacular/retro.   \nI'm not sure about stacking the word. I ratherlike the horizontal axis that way. And although I hate type set in circles and all that... here it fits, so even the redundant SAN FRANCISCO adds a nice quaint touch. I'm not sure about ther kerning at this size, but apart from that it is really perfect because it doesn't feel perfect and designed and so on.\n\n"
    },
    {
      "time": "8 Jun 2004 — 7:04pm",
      "content": "Peter, those are nice logos. I agree with Daniel that the lanterns are best for a night market. I really like that and and the type surprised me in a good way.   \n   \nCould the lantern design be reversed out of a black, dark red or deep blue background?   \n   \nJon\n\n"
    },
    {
      "time": "8 Jun 2004 — 7:19pm",
      "content": "\\>   \n   \n\\> Jon, thanks for the feedback. The client decided to go with the \\> Chinatown Entrance. They want to have that credible esteemed effect \\> on potential sponsors of the event. I have a little room to work in another element that would perhaps make the this concept more festive. I had thought of fireworks, but thus far they haven't worked out. Could work in some stars, but that is more night, and the moon covers that domain.   \n   \nOpen to suggestions...\n\n"
    }
  ]
}
