{
  "id": "50325",
  "title": "Basic resume typography for programmers",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I am a professional programmer and amateur typographer. I have recently written a blog article about the typographic and composition improvements I made to my resume. [Resume: A Tale of Desire, Intrigue, and Formatting](http://web.archive.org/web/20130825061320/http:/zgrossbart.blogspot.com/2008/10/resume-tale-of-desire-intrigue-and.html) is an outline of the process I used to improve my resume with a little help from The Elements of Typographic Style and FF Scala. I hope this will help other engineers with very little understanding of typography make their resumes better.\n\nIt would be very useful to get some feedback from more experienced designers. Did the resumes actually get better? Is the final resume any good? Is the advice I give good advice? What do you think of the overall concept?\n\nThank you in advance.\n\n[http://zgrossbart.blogspot.com/2008/10/resume-tale-of-desire-intrigue-and.html](http://web.archive.org/web/20130825061320/http:/zgrossbart.blogspot.com/2008/10/resume-tale-of-desire-intrigue-and.html)\n\nCheers,  \nZack\n\n",
  "author": "zgrossbart",
  "time": "8 Oct 2008 — 2:48pm",
  "uid": "37858",
  "comments": [
    {
      "time": "8 Oct 2008 — 4:33pm",
      "content": "Very nice to see typography being discussed by others. :^)\n\nThe first thing I would suggest is that the line length on your blog is far too long. :^)\n\n"
    },
    {
      "time": "8 Oct 2008 — 11:30pm",
      "content": "The worst resumes are more than one page and jammed with information. The appalling resumes use highlighter pen to mark up the points to pay attention to.\n\nSeeing you're a Python scripter, do you also do PHP? We're looking for someone to revamp some things under Typophile's Drupal (PHP/MySQL) hood.\n\n"
    },
    {
      "time": "9 Oct 2008 — 4:41am",
      "content": "Hello Joe,\n\nI guess being offered a job is the ultimate positive review of a resume. Thank you very much. Unfortunately I already have a full-time job and I'm writing a book on the side. You should consider posting your job opportunity to [http://jobs.sourceforge.net/](http://web.archive.org/web/20130825061320/http:/jobs.sourceforge.net/). They have a lot of PHP programmers looking at their job listings.\n\nCheers,  \nZack\n\n"
    },
    {
      "time": "9 Oct 2008 — 12:36pm",
      "content": "I guess my first comment was kind of knee-jerk. I hope I can redeem myself.\n\nOverall it is very good. Organized. Clear. The only three things I might re-consider are point-size (Scala always looks so tight to me), leading (if point-size doesn't give enough air), and full-justification.\n\nI guess of those three the justification is the thing I'd do if nothing else. One reason is to avoid spots in the text or rivers. Under \"project administrator\", the last sentence which begins GOTD, it looks as if you have a double space when it is really a result of the justification. You'd not justified the first two paragraphs, and I don't think I'd justify the rest.\n\nI'd also take the last line, the references line, and align it with the rest of the paragraphs on the left. You've not centered anything else so there is little reason to start.\n\nSorry I see one more thing. This is a fault of the typeface and not you. The bold appears smaller than the roman. I don't recall of this is a fault of the hinting or if it appears in the printing as well. But I might scale the bold type up .5 pt or so.\n\nOk this is the last. You might consider sizing the all caps (small caps?) lines down a bit and letter spacing them a bit more.\n\n"
    },
    {
      "time": "9 Oct 2008 — 7:17pm",
      "content": "Hello Miss Tiffany,\n\nThank you very much for the more in-depth critique. I will start tweaking immediately.\n\nCheers,  \nZack\n\n"
    },
    {
      "time": "11 Oct 2008 — 12:43am",
      "content": "\\>begins GOTD, it looks as if you have a double space when it is really a result of the justification\n\nThere actually is a double space.\n\nThe title (your name) is rather overpowering, as you acknowledge in your blog it is the vital part of the cv, however I would look at reducing it to the measure of the main text block, possibly aligning the baseline with the baseline of the url, preserving the lefthand column for navigation.\n\nThe list of Technical Skills needs some way of differentiating between lines, although most employers would be used to picking out the initials (because they would be looking for them) it doesn’t hurt to assist them. You could add a half line space after each topic; a tab after each colon; or bold the topic title – I wouldn't use all of these options.\n\nThe heading Experience is aligned with the first line of the description, you could try positioning it above the text block so that the job title aligns with the first line of the description.\n\nThe last line is left awkwardly floating, you could align it to the left under the headings or the text block.\n\nSome of these suggestions will interfere with your vertical space but I think it will just work. Regarding Tiffany’s suggestion about the measure, the last lines of each experience paragraph has got enough space to reduce the measure without adding another line to the depth. By reducing the measure and shifting it to the right by the amount of reduction, you might be able to get happier line breaks in the job titles, although you might have to settle for abbreviations for months.\n\nTim\n\n"
    },
    {
      "time": "13 Oct 2008 — 4:11am",
      "content": "Hello Tim,\n\nThank you very much for all your help. I've made most of the changes already.\n\nCheers,  \nZack\n\n"
    }
  ]
}
