{
  "id": "50320",
  "title": "Helvetica Rounded please",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I feel guilty for asking (because I am a strong advocate of buying typefaces and supporting local foundries) however, with that being said... I need to use Helvetica Rounded Bold for a school project. I would purchase the typeface if I ever intended on using it again, but I don’t really like the face..... So if anyone has a copy and wouldn’t mind sharing for educational purposes it would be greatly appreciated.\n\nplease email me at [jmcammond@gmail.com](mailto:jmcammond@gmail.com)\n\nthanks!\n\nJay\n\n [‹ BAD Helvetica system font in LEOPARD OSX](http://web.archive.org/web/20081012070324/http:/typophile.com/node/50300 \"Go to previous forum topic\") [Cut and then curved ›](http://web.archive.org/web/20081012070324/http:/typophile.com/node/41687 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012070324/http://typophile.com/user/37340\" title=\"View user profile.\">Jay Mac</a>",
  "time": "<br>",
  "uid": "37340",
  "comments": [
    {
      "time": " 8.Oct.2008 1.30pm",
      "content": "What school are you studying at?\n\n"
    },
    {
      "time": " 8.Oct.2008 1.35pm",
      "content": "Your best bet is to purchase it. Even if you don’t plan on using it ever again. It’s only $29.00 to purchase a legit license - that’s really not that expensive. But if even that meager sum is beyond your means, you can try sweet-talking the license holders... Or you could trace the glyph shapes in an illustration program and use the traced shapes to typeset what you need...of course with how much time it would take to do that, you might as well have earned up the money to buy a license.\n\n"
    },
    {
      "time": " 8.Oct.2008 1.42pm",
      "content": "Hi Nick\n\nI go to OCAD, (you taught there right?) I know you son actually. He lives with my best friend, Andrew.\n\n"
    },
    {
      "time": " 8.Oct.2008 1.48pm",
      "content": "Proper grammar, please Nick : ) You are starting to sound like that bubba you chastised months back. By the way, welcome back! On holiday?\n\nMichael\n\n"
    },
    {
      "time": " 8.Oct.2008 1.50pm",
      "content": "No, I never taught there, although I did give a talk once.  \nI’m surprised they’d let you use pirated software.\n\n"
    },
    {
      "time": " 8.Oct.2008 1.56pm",
      "content": "At which school are you studying?\n\n\\*\\*\\*\n\nNot a holiday. A conference, and family responsibilities.  \nGood to be back!\n\n"
    },
    {
      "time": " 8.Oct.2008 2.02pm",
      "content": "They do not encourage using pirated software at all, its more a matter of trying to keep my student loan under control. After four years it is a bit late for that though....lol.. oh well.\n\n"
    },
    {
      "time": " 8.Oct.2008 2.15pm",
      "content": "If you begin to compromise your principles now it will be much more difficult to alter your “habits” later.\n\nMichael\n\n"
    },
    {
      "time": " 8.Oct.2008 4.32pm",
      "content": "Hi Jay,\n\nTypophile and typophiles do not condone font piracy. However, if you need something and similar is tolerable, Arial Rounded is a system font on most macs now. I’d suggest using that.\n\n"
    },
    {
      "time": " 9.Oct.2008 8.12am",
      "content": "Helvetica Rounded was in the Font Folio OCAD required GD and AD students to purchase (or at least was when I went to OCAD) so you can probably find it installed on one of the computers on the 6th floor. If not, ask someone at the service bureau.\n\n"
    },
    {
      "time": " 9.Oct.2008 10.21am",
      "content": "Hi Haley\n\nThanks for your advice. I went to the service bureau and it turns out that my font folio was not installed properly and that I have in fact already payed for it. problem solved!\n\nThanks everyone.\n\nJ\n\n"
    },
    {
      "time": " 9.Oct.2008 12.13pm",
      "content": "This is really good news. Now if more schools would just follow OCAD’s example!\n\n"
    },
    {
      "time": " 9.Oct.2008 2.57pm",
      "content": "“If you begin to compromise your principles now it will be much more difficult to alter your “habits” later.”\n\nBut it is easier to change your habit when you start earning a salary. ;o)\n\n"
    }
  ]
}
