{
  "id": "50335",
  "title": "Announcing Montague Script",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " **Fresh from Veer:**\n\nMontague Script— A New Brush Lettering Font from Stephen Rapp\n\nMontague Script takes its name from a small hilltown of western Massachusetts rich in culture and history. I lived in this beloved community for a number of years and it’s where I first began my study of calligraphy and lettering.\n\nWhile most brush scripts take their cue from mid-twentieth century samples, Montague Script is a fresh, contemporary alternative. It comes directly from lettering written with a #3 sable brush on smooth vellum and is digitized with the same sensibility a lettering artist writes with. Montague reflects a dynamic interplay between form and rhythm not usually associated with type. Words suggest a baseline, yet are not bound by it. Letters vary in size, connect smoothly, yet break that connection purposefully as the scribe does intuitively. Beginnings, endings, alternates and ligatures come in as needed while you type. Many more alternates are available in the glyph palette of most current graphic software. Exuberant swash versions of upper and lowercase letters, as well as ligatures can be accessed through both the type and glyph palettes.\n\nMontague Script is a natural for advertising, point of purchase displays, packaging and logo design, cards, journals and much more. You will be delighted at how well it can dress up a project and how easily it sets.\n\n[http://www.veer.com/products/typedetail.aspx?image=UMT0000367#specimen](http://web.archive.org/web/20131015154612/http:/www.veer.com/products/typedetail.aspx?image=UMT0000367#specimen \"http://www.veer.com/products/typedetail.aspx?image=UMT0000367#specimen\")\n\n ![](http://web.archive.org/web/20131015154612im_/http:/typophile.com/files/UMT0000367_P3_4158.jpg)\n\n",
  "author": "Stephen Rapp",
  "time": "8 Oct 2008 — 6:40pm",
  "uid": "14650",
  "comments": [
    {
      "time": "8 Oct 2008 — 8:57pm",
      "content": "This is by far the coolest typeface I have ever seen. My hat is off to you Stephen Rapp. Congrats on Montague!  \nGlad to see it got released,  \n-Charles\n\n"
    },
    {
      "time": "15 Oct 2008 — 10:20am",
      "content": "Just an amazing creation!! I love it!!!!\n\n"
    },
    {
      "time": "18 Oct 2008 — 8:08am",
      "content": "Thanks Charles and Vivio.\n\nIt was truly a learning experience trying to get all those glyphs to work together smoothly. If you sign into Veer you can test it out on a basic level anyway.\n\nStephen\n\n"
    },
    {
      "time": "20 Oct 2008 — 7:37am",
      "content": "I'm jealous. Love it. The only thing that I notice immediately is any character followed by an r - it all looks so fluid apart from that.\n\nNick Cooke\n\n"
    },
    {
      "time": "20 Oct 2008 — 8:40am",
      "content": "Stephen, stoooooop! hehe, nice so nice, well I told you before!\n\n"
    }
  ]
}
