{
  "id": "50347",
  "title": "Bold vs. Extra Bold vs. Black?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Okay, I get the difference between a Bold face and an Extra Bold, but where exactly does a \"Black\" fit into the grand scheme of a font? Every time I think I have sussed out what the definable difference might be I run into a font that breaks \"the rule.\"\n\nApologies to all who'll say that I should just choose what works/looks best. But, I'm the picky type who likes to understand the small stuff.\n\n",
  "author": "ShepherdJim",
  "time": "9 Oct 2008 — 7:29am",
  "uid": "33429",
  "comments": [
    {
      "time": "9 Oct 2008 — 8:09am",
      "content": " ![](http://web.archive.org/web/20150305002152im_/http:/typophile.com/files/Weights_3866.png)\n\nThis is the sequence that appears in the first Font Info panel of FontLab, so it represents something of a standard, as this is what a lot of type designers and font developers go by.\n\nHowever, it should be pointed out that when one of these is selected, Fontlab assigns a numerical weight value from 100 to 1000 (in increments of 100) to the font, so several of the weights share the same number.\n\n"
    },
    {
      "time": "9 Oct 2008 — 8:18am",
      "content": "Font weight definitions seem to be quite subjective and there's all sorts of ambiguity about where one weight ends and another begins. I guess what I'm saying is that there is no hard rule.\n\n"
    },
    {
      "time": "9 Oct 2008 — 8:22am",
      "content": "Nice list, Nick.  \nA minor inconsistency: ‘Ultra’ is more extreme than ‘Extra’ on the Light end, but not on the other.\n\n"
    },
    {
      "time": "9 Oct 2008 — 8:33am",
      "content": "I was going to propose \"InfraLight\" as a better candidate for that end of the spectrum, but I guess the world doesn't need yet another label added to the mix!\n\n"
    },
    {
      "time": "9 Oct 2008 — 11:51am",
      "content": "Personally, I've always felt that DemiBold was slightly bolder than Semibold and that Heavy was heavier than Black, but not as much as Ultra. Florian is right, ExtraBlack would come between Black and Ultra. UltraBlack is redundant. Fat just doesn't belong.\n\nAll completely subjective, of course.\n\n(Craig -- I like InfraLight!)\n\n-- K.\n\n"
    },
    {
      "time": "10 Oct 2008 — 8:22am",
      "content": "Wow! Thank you guys! You've all provided more info, education and thought provocation than I'd hoped for.\n\nFlorian, nice catch on the Extra/Ultra inconsistency -- tho, that is the kind of thing that'll keep me up at night, :-)\n\nOkay! I'm off to post another question.\n\nThanks again! Jim\n\ni wish i knew then what i know now\n\n"
    },
    {
      "time": "10 Oct 2008 — 8:36am",
      "content": "Black weights are sometimes narrower and have even smaller counters than bold or super/ultra weights, so they sort of sidestep most schemes. Take a look at FF Unit to see what I mean.\n\n"
    },
    {
      "time": "10 Oct 2008 — 3:55pm",
      "content": "For full symmetry, \"Infra\" should be lighter than \"White\". (There have been a few fonts that use \"White\").\n\n"
    },
    {
      "time": "10 Oct 2008 — 4:15pm",
      "content": "That is why Frutiger was such a smart guy when he designed Univers.\n\nChrisL\n\n"
    },
    {
      "time": "12 Oct 2008 — 8:15am",
      "content": "And then there's also 'Blond', like in Ourtype's Arnhem. Slightly lighter than Normal.\n\n"
    },
    {
      "time": "12 Oct 2008 — 8:56am",
      "content": "Hrm so Brunette is equivalent to Normal or is it between Normal and Demibold?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "12 Oct 2008 — 8:47pm",
      "content": "Where does \"Chunky\" fit in? Also, I put \"Svelte\" between Light and Book.\n\n"
    },
    {
      "time": "12 Oct 2008 — 8:52pm",
      "content": "Well, if we are going that far, where would Zaftic fit in? Between Rubensian and Curvacious?\n\nChrisL\n\n"
    },
    {
      "time": "13 Oct 2008 — 4:21am",
      "content": "Like all things in type seemingly - there are conventions and fashions and no real rules. Do grip the convention, but not too tightly.\n\n"
    },
    {
      "time": "13 Oct 2008 — 6:44am",
      "content": "\"Font weight definitions seem to be quite subjective and there’s all sorts of ambiguity...\"  \nI think weight names are only valuable relative to the family a style is in, as are the OS/2 values Nick refers to. The actual weights, expressed in units/units per em could be used across families to some extent, but in general, with selection for use being accomplished visually by humans, the only ones left in the dark are the computers.\n\nCheers!\n\n"
    },
    {
      "time": "16 Oct 2008 — 7:45pm",
      "content": "For what it's worth, here are the PANOSE weights, taken from the FontLab manual:  \nVery Light, Light, Thin, Book, Medium, Demi, Bold, Heavy, Black, Extra Black\n\n"
    }
  ]
}
