{
  "id": "50352",
  "title": "Cold feet. Like, really frickin' ice cold feet. It's October after all.",
  "forum": "Bald Condensed's blog",
  "tags": [

  ],
  "content": "Although I do not consider myself an artist, I have the artistic reflex deeply engrained in the fibres of my being. Whenever I see an opportunity I am known to do [crazy stuff](http://web.archive.org/web/20131019083255/http:/typophile.com/node/12347) for the good cause.\n\nFirst the bad news -- there’s something wrong with [FontPool](http://web.archive.org/web/20131019083255/http:/www.fontshop.be/details.php?entry=309). A leak at the bottom of the stairs caused the pool to drain, leaving only a shallow body of water at the bottom. We don't know if and when it can be repaired.\n\nThen, I received a request from Lisa, Lynn & Laurence, three students of the second year Graphic Design at [KASK](http://web.archive.org/web/20131019083255/http:/www.kask.be/index.php?/grafische_vormgeving), the Royal Academy of Fine Arts Gent (where I graduated myself). They had an assignment for the first semester: to design and produce a 40 page magazine for which they also had to provide the content. Which is why they asked if they could interview me. After they had conducted the interview yesterday, they asked if they could take a couple of pictures to illustrate it. While looking around to find a setting a bit more interesting than the obvious dude-sitting-at-a-table, the almost empty pool caught my eye...\n\nSee the pictures [here](http://web.archive.org/web/20131019083255/http:/flickr.com/photos/fontshop/sets/72157607885176245/detail/). ;^)\n\n",
  "author": "Bald Condensed",
  "time": "9 Oct 2008 — 8:55am",
  "uid": "110",
  "comments": [
    {
      "time": "10 Oct 2008 — 11:30am",
      "content": "great idea for the pics. fontbook was a nice touch.\n\n"
    },
    {
      "time": "10 Oct 2008 — 2:46pm",
      "content": "I know who you remind me of...finally! Ed Norton!!! Quite a lot in these new pics.\n\n"
    },
    {
      "time": "12 Oct 2008 — 12:19pm",
      "content": "Except that Ed still has hair. :^D\n\n"
    }
  ]
}
