{
  "id": "50416",
  "title": "Logo needed for a cafe in Russia",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello everyone, I’ve just bumped into this great site today, and was carried away by lots of interesting stuff and cooments and subjects ppl discuss here. Plenty of creative, out-of-the-box fresh thinking and professional advice.\n\nMy friend is opening a cafe soon here in Archangelsk city, Russia,so I have ordered a few designers a cafe logo, but still not satisfied with what they show me...\n\nThe name if the cafe is КОФЕРУМ which (COFFEEROOM in english)...I sense that the Cyrillic font is not very familiar to ppl here...but maybe someone’s got an idea of what font can be used for the logo...or recomment some web site with good logos archive so i can look thru it to get some inspiration..:)\n\nthanx everyone in advance\n\nhi from Russia\n\nAnastasia\n\n [‹ Personal logo for graphic designer](http://web.archive.org/web/20081016054423/http:/typophile.com/node/49305 \"Go to previous forum topic\") [opinion of the logo ›](http://web.archive.org/web/20081016054423/http:/typophile.com/node/50418 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081016054423/http://typophile.com/user/37933\" title=\"View user profile.\">AnastasiaMorozova</a>",
  "time": "<br>",
  "uid": "37933",
  "comments": [
    {
      "time": " 11.Oct.2008 6.03pm",
      "content": "This is a very open-ended question. What kind of image do the café owners want to have? With a name like “COFFEEROOM”, maybe a tightly kerned Helvetica Bold in black on white would work, but we really need more information.\n\n- Lex\n\n"
    },
    {
      "time": " 11.Oct.2008 8.48pm",
      "content": "what are the goals you wish to achieve with the identity?  \nwhat type of crowd does the place need to draw?  \nis it up-market or budget?\n\nwe really need more information before any valuable advice can be given\n\n"
    },
    {
      "time": " 12.Oct.2008 1.27pm",
      "content": "thanks all for a feedback :)\n\nwell, I will try to describe it in a few words : it’s planned to open a cafe chain, with three or four outlets in our town and if all is well, few other towns as well. The cafe will offer one of the best coffee in town, bakery and drinks. It won’t anything exclusive or arty, just a good coffee, nice lounge music and patisserie. can describe it as a good standard. as for target audience..middle class, students ...business people...\n\nIt is not an up-market project, just a good local cafe chain, as i already mentioned above- no special exclusivity about it, but still good value.\n\nAs for image...the owner really havent got any ideas so far, but i think it shouldnt be just trivial cup of steaming coffee or some simple coffeebean, although one can look really good if implemented creatively, so ....id like it also not to be very abstract, arty or quirky thing...maybe it can be icon image (pictogram) thing...it has to be smth simple at not banal at the same time...i will show down below the logos of the cafes i personally like...so maybe can bring u some ideas....\n\nthanks everyone in advance\n\nAnastasia\n\n"
    },
    {
      "time": " 12.Oct.2008 1.32pm",
      "content": " ![](http://web.archive.org/web/20081016054423im_/http:/typophile.com/files/top_4605.gif)\n\n ![](http://web.archive.org/web/20081016054423im_/http:/typophile.com/files/20080721140239_carversWareHouse017_4272.jpg)\n\n ![](http://web.archive.org/web/20081016054423im_/http:/typophile.com/files/Bradesko_5186.jpg)\n\n ![](http://web.archive.org/web/20081016054423im_/http:/typophile.com/files/logo_esplanad_4215.gif)\n\n ![](http://web.archive.org/web/20081016054423im_/http:/typophile.com/files/rekord_display_02_4681_4796.jpg)\n\n"
    },
    {
      "time": " 12.Oct.2008 4.58pm",
      "content": "doesn’t sound (to me) as though you’re putting your efforts into finding suitable designers for these projects.\n\nI’d love to work on an identity for a cafe (based on a decent brief from an owner who knows how they want people to perceive and respond to their cafe/bar, i.e, not necessarily”I want it to look like this” more “I want it to feel like this”)\n\n... anyway ... sounds like these designers had a great opportunity and let you down.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081016054423/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 13.Oct.2008 12.39pm",
      "content": "Thank you , Paul :)\n\n"
    },
    {
      "time": " 13.Oct.2008 2.09pm",
      "content": "What do your competitors look like?\n\nhhp\n\n"
    },
    {
      "time": " 13.Oct.2008 3.19pm",
      "content": "art lebedev is a good and well known design studio in Russia.  \nIt could be worth it trying to talk to them even just to see how much they will charge.\n\n[http://www.artlebedev.ru/](http://web.archive.org/web/20081016054423/http:/www.artlebedev.ru/ \"http://www.artlebedev.ru/\")\n\n"
    },
    {
      "time": " 14.Oct.2008 9.46am",
      "content": "<cite> art lebedev is a good and well known design studio in Russia.<br>\nIt could be worth it trying to talk to them even just to see how much they will charge. <cite></cite></cite>\n\ni think i could better turn to Saachi& Saachi with the same result :)\n\nArt Lebeved is one of the most expensive and known agencies in Russia, though not the best one up to me...:)\n\nwe’re local cafe chain...not up-market, Victor :) you comment made me smile :) but still thank you very much for it!\n\nAnastasia\n\n"
    },
    {
      "time": " 14.Oct.2008 6.07pm",
      "content": "i’m not a big fan of the Saachis.  \nand the book they produced (lovemarks) was badly designed in my opinion.  \nbut yeah, I wasn’t too sure about your budget.\n\n"
    }
  ]
}
