{
  "id": "50420",
  "title": "personal brand/personal typeface?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am in the process of creating my first visual identity as a designer and am feeling a bit overwhelmed by the spectrum of possibilities. The visual identity will be used as a starting point for the portfolio, resume, and used for billing an occasional freelance project.\n\nTo get an idea of what employers are looking for in a junior’s visual identity, I interviewed a few firms (which ironically focus on branding) that I am interested in working for upon graduation. The general consensus seems to be “keep it simple”, but make sure it “stands out”.Hmmmm. I assume that taking a typographic approach would probably be best, however I am having difficulty selecting the “right” typeface. I want the typeface to read “creative” “fresh” and as requested “simple”. The face that I am gravitating towards is Insigna because the “J” “M” “A” seem to add some interest to my long and awkward looking name. The big problem with this is it looks a bit too much like a “frat house” identity.\n\n-\n\n ![](http://web.archive.org/web/20081016054429im_/http:/typophile.com/files/workmark_6497.jpg)\n  \n-\n\nAnyway... In light of being overwhelmed I thought I would throw a few questions to those with a bit more experience.\n\n1. What is the most important thing you want your clients to read from your identity? And what typeface did you select fulfill that goal?\n\n2. How did you go about selecting the right typeface. What was your process?\n\n3. If anyone has any suggestions for typefaces that read “creative, fresh and simple”, I am all ears.\n\n [‹ Quark Indesign Line above/below thing?](http://web.archive.org/web/20081016054429/http:/typophile.com/node/50445 \"Go to previous forum topic\") [MonoSpaced type usage. ›](http://web.archive.org/web/20081016054429/http:/typophile.com/node/50428 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081016054429/http://typophile.com/user/37340\" title=\"View user profile.\">Jay Mac</a>",
  "time": "<br>",
  "uid": "37340",
  "comments": [
    {
      "time": " 11.Oct.2008 6.32pm",
      "content": "When you choose the typeface for your portfolio choose something like Univers that will go completely unnoticed. The identity of your portfolio should allow people to focus on your work, not the identity. If you want your portfolio to stand out, the entire piece needs to have a really great concept driving it, and a typeface isn’t going to do that.\n\nUsing a novelty face is a bad idea, and using a Neville Brody face from 1986 is akin to putting in a title page that says “I went to to a school that did not teach design history, I haven’t studied it on my own, and I’m out of touch with contemporary graphic design”.\n\n"
    },
    {
      "time": " 11.Oct.2008 8.29pm",
      "content": "Thanks for your feedback.\n\nThe point of the project is more to create a “word mark” that can be used in other applications (business cards etc.) that carries over into the portfolio. (maybe that is a bad idea, I’m not sure)\n\nYour response further clarifies my issue though. How does one balance simplicity and clarity with visual interest when choosing a typeface for a word mark?\n\n"
    },
    {
      "time": " 11.Oct.2008 9.29pm",
      "content": "Go to the biggest mall in town. Take your camera and a sketchbook. Look at everything in sight, identify the marks that work and differentiate them from the ones that don’t. Take lots of notes and pictures. Go home and do some sketches. Then go to bed, wake up the next day, and think about it all.\n\nDoing some reading will probably help, too. Take a look at Willi Kunz’s books, he has some ideas that will be dead on for this project.\n\n"
    },
    {
      "time": " 12.Oct.2008 8.08am",
      "content": "If you are creating a personal identity, I would create something _you like_, instead of what ’they’ like. I would try to show what you are about, and the only way to do that is to make something that comes from yourself.\n\nIn other words, I would not worry too much about what other people tell you it should look like. Just take a sketchbook, Illustrator or whatever suits you for making sketches, and start brainstorming. :)\n\nYou’ll end up with alot of different approaches. Pick one or two of them, and go from there.\n\n"
    },
    {
      "time": " 12.Oct.2008 11.21am",
      "content": "Following up on Jelmar’s advice: think about the kind of firm that you want to work for. When I was in design school my portfolio was in constant flux as I shifted it around to try and impress different firms based on advice from my professors, and most of the time my portfolio really looked like crap, both online and in print. It really only got better when I realized that the reason I could never come up with a great idea for a really wild portfolio with special leave-behind items was because I don’t really want to work for the firms that appreciate that stuff. I ditched all my expensive portfolio books and boxes and the custom web site for a $5 Muji portfolio and an Indexhibit web site that I actually like and the whole thing works about a million times better.\n\n"
    },
    {
      "time": " 12.Oct.2008 11.28am",
      "content": "Jay Mac, it’s a big thing to dive into, branding yourself. Lots of good suggestions in here already that I’d like to echo: Create something you like. Use a typeface that’s timeless (univers, helvetica, etc).\n\nBeing overwhelmed isn’t a bad thing. At this point, I’d suggest hunkering down with a notebook and sketching the word mark. When you feel exhausted like you can’t sketch anymore, quit for the night. Rest. Review the results.\n\nRegarding your questions:\n\n1. Most important thing is that you’re consistent. People value consistency in an identity over anything else (there’s been plenty of research to back this). I choose Helvetica Neue for my identity because of it’s reliable consistency.\n\nWhy Helvetica? I was looking for something neutral and honest. It works for me, I like it, and I feel it left me plenty of room to be creative. Have a look: [http://www.jasonrobb.com](http://web.archive.org/web/20081016054429/http:/www.jasonrobb.com/ \"http://www.jasonrobb.com\") I’ve also kept consistent in my portfolio: [http://jasonrobb.com/i/jasonrobb-resume-portfolio.pdf](http://web.archive.org/web/20081016054429/http:/jasonrobb.com/i/jasonrobb-resume-portfolio.pdf \"http://jasonrobb.com/i/jasonrobb-resume-portfolio.pdf\") I use the same header info on invoices as well.\n\n2. My process for choosing Helvetica was simple. I didn’t know much about typefaces at the time, so I picked something that was familiar and that I wouldn’t get sick of too quickly. It’s held up for a few years now, and I haven’t grown out of it yet.\n\n3. Creative, fresh and simple typefaces: I’m a big fan of Jos Buivenga’s work - [http://www.josbuivenga.demon.nl/](http://web.archive.org/web/20081016054429/http:/www.josbuivenga.demon.nl/ \"http://www.josbuivenga.demon.nl/\") Museo and Museo Sans. Joshua Darden’s Freight Sans [http://www.dardenstudio.com/typefaces/freight\\_sans](http://web.archive.org/web/20081016054429/http:/www.dardenstudio.com/typefaces/freight_sans \"http://www.dardenstudio.com/typefaces/freight\\_sans\") , TypeTrust’s Aaux Next [http://www.typetrust.com/fonts/font.php?id=Njc5](http://web.archive.org/web/20081016054429/http:/www.typetrust.com/fonts/font.php?id=Njc5 \"http://www.typetrust.com/fonts/font.php?id=Njc5\") ... are three of my favorites that come to mind at the moment.\n\n"
    },
    {
      "time": " 12.Oct.2008 6.25pm",
      "content": "<cite>and using a Neville Brody face from 1986 is akin to putting in a title page that says “I went to to a school that did not teach design history, I haven’t studied it on my own, and I’m out of touch with contemporary graphic design”.</cite>\n\nOr it can say, “I’m a clever little bastard. I’ve studied graphic design history and I am having the biggest hoot using this stupid typeface to brand myself. You guys must be really out of touch if you think that I am out of touch based on my ironic type choice.”\n\n"
    },
    {
      "time": " 13.Oct.2008 4.12am",
      "content": "James & James - Now I am laughing out loud.\n\nI think that if you are new to the biz and you don’t know how you want to be seen, or how to make people see you that way via your ID it is inevitable that you can’t turn lamb into mutton, if you see what I mean. Attempts to do so will be seen through in 90% of cases.\n\nJames M is also right to suggest that you can’t control how people see you. And in fact people will see you many different ways and all too often ignore you. And this is inevitable & in the end okay.\n\nI think the advice given is essentially sound. If you feel like a deer caught in headlights - go to the safety of the modern. It’s boring but okay.\n\nWhen you feel you have a good grasp on how to do more, let go and “swim away from the edge of the pool”.\n\n"
    }
  ]
}
