{
  "id": "50438",
  "title": "(Chinese) Cultural Revolution typeface",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey everyone. I have a design assignment for school that involves creating a poster in the style of some sort of design movement. I chose the Cultural Revolution, but the thing is, all the type on the original posters is in Chinese! Not knowing Chinese, does anyone have any suggestions on either typeface that mimics Chinese characters, or probably more likely, some type faces that have that communist blocky feel. Maybe like the blocky looking soviet union type, sort of like a more ridged Din. Though, at the same time, i don't want it to end up being too Russian/Soviet looking. Haha, sorry being so vague.\n\nThanks everyone! I really appreciate it.\n\n-josh\n\n",
  "author": "wolfattack",
  "time": "12 Oct 2008 — 9:58pm",
  "uid": "15289",
  "comments": [
    {
      "time": "12 Oct 2008 — 10:19pm",
      "content": "First time I've heard the Chinese Cultural Revolution called a \"design movement\".\n\n"
    },
    {
      "time": "12 Oct 2008 — 10:57pm",
      "content": "I know, it isn't a design movement. I should have stated that in the first post....\n\nThe thing is, EVERYONE is doing swiss design, and I wanted to do something different.\n\nanyway, any suggestions?\n\n"
    },
    {
      "time": "12 Oct 2008 — 11:38pm",
      "content": "Well, the first thing I think about is something stencil-looking, which might be kind of obvious, but still, it really does mimic the era in a number of ways...\n\n"
    },
    {
      "time": "13 Oct 2008 — 1:58am",
      "content": "In fact there are typefaces that imitate chinese letters, but I'm afraid they look tacky and amateurish. You could draw the lettering by hand, that's how the kids did their posters during the Cultural Revolution.\n\n"
    },
    {
      "time": "13 Oct 2008 — 7:43am",
      "content": "\"First time I’ve heard the Chinese Cultural Revolution called a “design movement”.  \nMe too, the only expression of the CR that I'm aware of out of direct control of government design, was the humiliation graffiti, This goes back much further than the CR. This was only a small part of the 'movement's design'. I think it's a good assignment, but unless the choice of tactics is modified, I'm of the opinion that the assignment will be impossible to achieve without looking tacky and amateurish. Modified for example, somehow to make the point that this was the largest ratio of populous-in-change, to design-in-stasis, in the history of mankind. Steven Heller did a presentation on totalitarian design, basically Stalin, Hitler and Mao, at TypoBerlin this year, knows much more about it than me, and I believe his book on the topic is out, or will be.\n\nOther huge popular movement choices might be to gather images of really sexy Indian temple carvings and show how there are word forms in that movement somewhere, the web, or point out the down-to-today stylistic longevity of ancient Egypt. Acid Rock, Circus Posters, or go Celtic(s). Depending on who is instructing, your interests... hope it helps.\n\nCheers.\n\n"
    },
    {
      "time": "13 Oct 2008 — 9:16am",
      "content": "_...creating a poster in the style..._\n\nIt shouldn't be a problem to mimic style.  \nJust find a number of examples of your subject, identify visual themes, and create a design using those themes.\n\nYou are right on the money:  \n [http://www.highbeam.com/doc/1G1-168067408.html](http://web.archive.org/web/20131020095859/http:/www.highbeam.com/doc/1G1-168067408.html \"http://www.highbeam.com/doc/1G1-168067408.html\")\n\n"
    },
    {
      "time": "13 Oct 2008 — 9:21am",
      "content": "[http://www.staatsgalerie.de/aus\\_china/](http://web.archive.org/web/20131020095859/http:/www.staatsgalerie.de/aus_china/ \"http://www.staatsgalerie.de/aus\\_china/\")  \nThose guys used Ff QType (i think so) with \"drastic revolutionary colors\", it worked for me on the posters and ads i've seen.\n\n"
    },
    {
      "time": "13 Oct 2008 — 4:54pm",
      "content": "Maybe the solution is to letter it by hand with a brush. Thatś the way they did it. Less chinese but more conceptual.\n\n"
    },
    {
      "time": "13 Oct 2008 — 8:15pm",
      "content": "cool, thanks everyone for the feedback and help. I know i kind of came across making it sound like I didn't know what I was talking about, but i just tried to give the necessary information. I appreciate all the help!\n\n"
    }
  ]
}
