{
  "id": "50436",
  "title": "Logo with upper and lowercase of the same letter: critique, and references",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m doing a logo for a new business called Brogan Brothers, which will make cabinets and also do general remodeling, to clients making over $200,000 a year. The remodeling and the cabinetmaking businesses will be legally separate entities, and therefore I need to have a base logo of “Brogan Brothers” to which I can add the words “cabinetmakers” and “remodeling/remodelers” respectively. I’ve found an interesting relationship with an italicized upper case B, and a lower case B.\n\nThis is in my opinion, the best rough I’ve come up with for the client. The openness and negative space, along with the color palette and use of italics, seems best fitted for their elite audience. Now, the client’s wife thought that the use of an upper and lower case B in the logo “suggests that one Brogan is far more important than the other Brogan.”\n\nYet, I feel that since the name of the company is not “Brogan & Brogan,” but rather, “Brogan Brothers,” this argument does not hold weight. The client has not seemed to interested in pursuing this, thanks to his spouse... but I am not going to give up on it yet.\n\nI’m using the font Disturbance, in regular and italic, I believe, under the BB. The reason being that it incorporates upper and lowercase within the same alphabet, thereby mimicking the Bb above, and also has a good rhythm and decorative feel to it.\n\nI’ld like to be able to show some references to the client of other logos that use acronyms, and an upper and lower case version of the same letter. If anyone knows of any— links, posts, or suggestions would be helpful. Furthermore, any critiques of the logo are more than welcome.\n\n\\*As a note, I don’t own disturbance yet and so I can’t color it..black for now\n\nThankyou all!\n\nhere’s an alternate link if my attached file doesn’t work:  \n [http://www.coroflot.com/public/individual\\_file.asp?individual\\_id=212054&](http://web.archive.org/web/20081016054439/http:/www.coroflot.com/public/individual_file.asp?individual_id=212054& \"http://www.coroflot.com/public/individual\\_file.asp?individual\\_id=212054&\")...\n\n| Attachment | Size |\n| --- | --- |\n| [BBdisturbance.jpg](http://web.archive.org/web/20081016054439/http:/typophile.com/files/BBdisturbance_0.jpg) | 29.2 KB |\n| [Tansu.jpg](http://web.archive.org/web/20081016054439/http:/typophile.com/files/Tansu.jpg) | 37.26 KB |\n| [Geometric2.jpg](http://web.archive.org/web/20081016054439/http:/typophile.com/files/Geometric2.jpg) | 52.41 KB |\n| [Dovetailed.jpg](http://web.archive.org/web/20081016054439/http:/typophile.com/files/Dovetailed.jpg) | 23.51 KB |\n\n [‹ freelance designer logo](http://web.archive.org/web/20081016054439/http:/typophile.com/node/50500 \"Go to previous forum topic\") [Embroidery going to promotional gifts ›](http://web.archive.org/web/20081016054439/http:/typophile.com/node/50364 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081016054439/http://typophile.com/user/17763\" title=\"View user profile.\">evanbrog</a>",
  "time": "<br>",
  "uid": "17763",
  "comments": [
    {
      "time": " 12.Oct.2008 9.28pm",
      "content": "Ouch ... the client’s wife.\n\nBut I tend to agree ... she kinda has a point\n\nThe toggled case of the type makes me go dislike it. the mark on its own isn’t bad ... I think a more customised BB is possible and could look amazing.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081016054439/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": " 12.Oct.2008 11.36pm",
      "content": "I think you might be able to play with the negative space a bit more.\n\n- Lex\n\n"
    },
    {
      "time": " 13.Oct.2008 8.28am",
      "content": "Another argument FOR this logo was that there are a million brothers out there in businesses, and having emphasis in the mark on the letter that corresponds to Brogan, was a good thing. Brogan is what distinguishes these brothers from all the other brothers. Anybody agree/disagree?\n\n"
    },
    {
      "time": " 13.Oct.2008 8.34am",
      "content": "Shouldn’t the differentiation come from the quality and expertise of their work more so then their name?\n\n"
    },
    {
      "time": " 13.Oct.2008 9.18am",
      "content": "That’s not working. Maybe start with a lc “b”,  \nand add the more formal top from an UC “B”.\n\nBTW, check out Panoptica too.\n\nhhp\n\n"
    },
    {
      "time": " 13.Oct.2008 3.21pm",
      "content": "hrant—thanks. but the client feels the word brogan HAS to start with a lowercase b if its in the logo. so starting with the lowercase and adding the uppercase would not appease them. panoptica only has uppercase Bs in the alphabet as far as i can see.\n\nyet here’s an example of someone putting a lowercase f into a logo for wright fine art. [http://sedlackdesign.com/creative/work/wfa.php](http://web.archive.org/web/20081016054439/http:/sedlackdesign.com/creative/work/wfa.php \"http://sedlackdesign.com/creative/work/wfa.php\") the logo is WfA. Yet when speaking about the identity this designer has no problem saying “Wright Fine Art,” with an uppercase F. A former teacher of mine, I know IF he would have all 3 words below the mark, they would all be in caps...\n\n"
    },
    {
      "time": " 13.Oct.2008 3.47pm",
      "content": "What about taking a lc “b” and replacing  \nthe bowl with the right side of an UC “B”?  \nOr maybe an UC “B” with three bowls.\n\nBut try to get rid of the wifie first.  \nBTW, is it one wifie or two?\n\nhhp\n\n"
    },
    {
      "time": " 13.Oct.2008 5.16pm",
      "content": "You know, I’m being stupid. You should find a good design firm.  \nIf they need type work done, _then_ somebody like me could join up.\n\nhhp\n\n"
    },
    {
      "time": " 13.Oct.2008 6.23pm",
      "content": "hahah.\n\nhi five!\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081016054439/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": " 13.Oct.2008 6.33pm",
      "content": "there may be something to the lowercase b with 2 bowls, or a variation of that. good advice. but yea i would like to be workin at that good design firm. not much in my hometown for the moment, and im not moving for at least two years. =(  \n this may be the worst client in the world too. but i gotta get paid. have you ever heard “my eye is never wrong” froma client? i mean i guess it takes balls to say that but still. and i can’t get rid of the wife. apparently my eye can be wrong but not his, and her input seems invaluable. sigh. tough profession!\n\n"
    },
    {
      "time": " 13.Oct.2008 7.11pm",
      "content": "\\> not much in my hometown for the moment\n\nWell, internet!\n\n\\> “my eye is never wrong”\n\n“Let’s put a number on that, shall we?” :-)  \n [http://typophile.com/node/50293](http://web.archive.org/web/20081016054439/http:/typophile.com/node/50293 \"http://typophile.com/node/50293\")\n\nhhp\n\n"
    },
    {
      "time": " 13.Oct.2008 8.03pm",
      "content": "ok i added 3 more jpgs of the other roughs i’ve got.  \ntansu is just using the stair stepping of the type that happens from right rag, left justified text. the very quickly done, simplified mark is from japaneese stair-stepped chests ( [http://www.greenteadesign.com/living-room-tansu-step-chests.html](http://web.archive.org/web/20081016054439/http:/www.greenteadesign.com/living-room-tansu-step-chests.html \"http://www.greenteadesign.com/living-room-tansu-step-chests.html\"))\n\nthe concept for geometric is thinking about all the right angles one has to work with when remodeling or creating cabinets—measuring angles, frames, doors, cabinets themselves, and those L shaped rulers. the client thought it might look better with ruler markings (although i worry the integrity of the lines will be compromised at smaller sizes).\n\nand dovetailed is meant to show dovetail joints, which are a true sign of good quality wood working, as they take no fasteners or anything, just glue.\n\n"
    },
    {
      "time": " 13.Oct.2008 8.32pm",
      "content": "The simpliest one ( **tansu** ) brings most attention, and looks quite balanced. The other ones look cheap and cheesy (at least to me).\n\nAny success in ditching the spouse-critic? 8D\n\n"
    },
    {
      "time": " 14.Oct.2008 1.23pm",
      "content": "acnapyx. ummm no how could i ditch the lady? i’m not married to her!  \nim definitely working on tansu more. i think the dovetailed can be done well.  \napparently dovetails are used a lot to combine 2 woods that are of different  \ntone. what is “missing” in the dovetailed version?\n\n"
    },
    {
      "time": " 14.Oct.2008 6.05pm",
      "content": "also, if anyone knows of a good font to match with the mark in geometric please let me know.\n\n"
    },
    {
      "time": " 14.Oct.2008 8.49pm",
      "content": "wait ... I’ll ask my wife.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081016054439/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 15.Oct.2008 12.09pm",
      "content": "Big B little b what begins with B?\n\nyour first post (disturbance) is interesting, however it still needs some refinement. Some of the shapes look awkward. Perhaps do one more round, and show the client other successful samples but if they are still not wowed by the big B little b, move on. It’s a good idea, hold it for a client that will appreciate it. Don’t waste too much of your time trying to get someone, who sounds very set, to change their mind.\n\nTansu: another interesting idea. I just wonder is their style of woodworking modern? Does this graphic suit their style?\n\nGeometric: too busy and not as solid an idea as your others.\n\nDovetailed: Does it have to be BB? I would think one graphic B would be sufficient as a symbol. Dovetailed joints are used to join different kinds of woods especially on drawers where only the face is readily visible. Look at real dovetail joints, the one you’ve drawn looks too thin and fragile. Try some other font combos, I believe you can find a more sophisticated pairing.\n\n"
    },
    {
      "time": " 15.Oct.2008 4.04pm",
      "content": "how about actually building a letter B out of wood photographing it and using that.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081016054439/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": " 15.Oct.2008 4.17pm",
      "content": "I would experiment with other fonts. From the lengthy script discussion elsewhere, have you thought of finding a more elegant script ’B’ and then a more robust lower case italic font? The reason I like the first design over all the others is this: (and it might even win the wife over) that logo would make an excellent branding iron to mark the finished piece. For example: the underside of the seat of a chair. Very cool. There are companies that will take your black and white art and create a brand from it.\n\nI also think the text font you’ve used for it is both bold AND elegant. Nice selection.\n\nI guess I don’t really understand the big ’B’ little ’b’ problem. The name ’Brogan’ (represented by the big ’B’) is the important part and ’brothers’ (represented by the little ’b’) is the less important part. The 2 ’B’s don’t HAVE to represent the two Brogan brothers... one greater, one lesser.\n\n2 ’B’s or not 2 ’B’s... that appears to be the question.\n\n"
    },
    {
      "time": " 15.Oct.2008 4.38pm",
      "content": "THIS JUST IN...\n\nI saw a logo on TV just 5 minutes ago that describes what I was saying... and, although very different characters, NEITHER ONE is subservient to the other:\n\n ![](http://web.archive.org/web/20081016054439im_/http:/typophile.com/files/logo_weinberg_6182.jpg)\n\nThe use of ’contrast’ is a very comfortable rule for me.\n\n"
    }
  ]
}
