{
  "id": "50442",
  "title": "CS3 \\> CS4 compatibility.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello folks.\n\nOur design department is with some doubts about CS3 to CS4 compatibility. We work mainly with InDesign, so I’d like to ask you guys if I can just save a document in .indd from CS3 and open it in CS4 right away. And of course saving it in CS4 and opening it in CS3.\n\nI realize this may be a hard question since the software ain’t out yet, but someone could have read about this somewhere else.\n\nIf you happen to know any other compatibility issues between these two, don’t hesitate on telling me.\n\nThank you.\n\n",
  "author": "<a href=\"/web/20091008013808/http://typophile.com/user/34250\" title=\"View user profile.\">Pedro Peixoto</a>",
  "time": "<br>",
  "uid": "34250",
  "comments": [
    {
      "time": " 13.Oct.2008 3.46am",
      "content": "Up until now the policy has been that documents are upward compatible (eg you can open a CS3-doc in CS4), but NOT downwards (eg you can not directly open a CS4-doc in CS3, but have to export a file in the IDX-format to open it in the lower version, one step at a time — from CS4 to CS3 works, but not to CS2 — you have to re-export in CS3).  \nChances are that the new version works likewise.  \nIt has to do with new features being introduced in new versions that will not translate well to the older ones.\n\nI may be not correct, but this was what I understood from the demo I attended.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 13.Oct.2008 4.32am",
      "content": "Bert is correct – CS4 retains the InDesign interchange format for saving documents for earlier versions. Apparently Adobe have ironed out a few glitches and the CS4 .inx-formats will be more robust.\n\n"
    },
    {
      "time": " 11.Nov.2008 2.09am",
      "content": "[Double Down(save)](http://web.archive.org/web/20091008013808/http:/indesignsecrets.com/double-downsave.php) at indesignsecrets.com: Directly from CS4 to CS2? Yes and no.\n\n"
    }
  ]
}
