{
  "id": "50461",
  "title": "Graphic and typography design movements and designers",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello to everyone,\n\nI have to choose 4 different graphic design styles within the history of design. I feel like there are too many I'm interested on. And, what it results me more different is to choose 3 designers that represent those styles the most.\n\nAt the moment, I'm thinking of:\n\nBauhaus  \n-El Lissitzky  \n-Herbert Bayer  \n-Josef Alberts\n\nSwiss Style  \n-Josef Müller-Brockmann  \n-Paul Rand  \n-Jan Tshichold\n\nDigital Age  \n-Nevelle Brody  \n-Richard Eckersley  \n-Jonathan Barnbrook\n\nWhat do you think about it? It would be interesting to hear what are yor tastes like.  \nThe fourth graphic design style still in process. I can't decide which one to choose.  \nSome advice?\n\nMany Thanks,  \nLaura\n\n",
  "author": "<a href=\"/web/20111222213828/http://typophile.com/user/30149\" title=\"View user profile.\">Bites of Life</a>",
  "time": "<br>",
  "uid": "30149",
  "comments": [
    {
      "time": "",
      "content": "El Lissitzky was a Russian Constructivist and Paul Rand may have admired the Swiss but was his own style. You might put Armin Hofmann and Emil Ruder in the Swiss group.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Koch?\n\n"
    },
    {
      "time": "",
      "content": "Also, design history regarding typography started well before the 20th Century.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Yeah, I was thinking that too. Your list is heavily modernism, consider something older, perhaps to contrast the styles you have listed. Like maybe the Vienna Secession, Rococo, or something like that.  \nOne of my favorite books on the subject is Philip Meggs' \"History of Graphic Design\"\n\n"
    },
    {
      "time": "",
      "content": "Hi Laura,\n\nBauhaus: Hard to omit Moholy-Nagy. Profoundly important (along with El Lissitzky) in developing and shaping the Bauhaus into what it would become \\_and\\_ central to the introduction of German modernist design sensibilities to the United States in founding the New Bauhaus/School of Design/Institute of Design in Chicago.\n\nSwiss: Josef Muller-Brockman: absolutely! Paul Rand: no (influenced by: yes; Jan Tschichold: no (New Typography). Instead: Armin Hofmann & Emil Ruder\n\nDigital: This covers \\_a lot\\_ of ground. . . Neville Brody: absolutely! I would consider April Greiman, Kathy McCoy, Rudi Vanderlans/Emigre, Nancy Skolos and many others.\n\nChoice 4: Constructivism. I don't see how you can leave it out of a top 4 influential syle group list.  \nLook at: Rodchenko, El Lissitzky, Gustav Klutsis, Georgii and Vladimir Stenberg, etc.\n\n"
    },
    {
      "time": "",
      "content": "I wouldn't put Richard Eckersley in \"the Digital Age.\"\n\nIf you are thinking of <cite>The Telephone Book</cite>, it was basically put together on the light table, from repro run off a typesetting machine & lots of work with a stat camera & darkroom time.\n\n\\* \\* \\*\n\nRichard used essentially four fonts from the mid 1980s until his death. Galliard when repro was used. Minion multiple masters, which let him get a little more condensed, a little heavier font. Once he figured out the numbers, he stayed with them for years. Trinite, because it had both the weight & condensed fit he wanted. The other one? ITC Baskerville, when Galliard, Minion & Trinite weren't right. ITC because the photocomp Monotype Baskerville was just too light.\n\n\\* \\* \\*\n\nIt isn't quite true, but it would be insightful to to say that Richard thought of the computer as a quick & cheap source of press-on lettering.\n\nOf course, I'm biased; I think of Richard in a class by himself. But an unbiased evaluation would be that the dates of his life included the early digital age; his way of thinking and working did not.\n\nFWIW\n\n"
    },
    {
      "time": "",
      "content": "Thank you very much for your dedication to all, I'll answer you one by one\n\nChrisL,\n\nI wasn't really sure with El Lissitzky, I love his work so I'm considering to incorporate as my 4th choice -Constructivism and El Lissitzky will be leading the choice of the three designers representing that period.\n\nBecause my project is more focus on graphic design movements, I have a chart that shows graphic design from the Arts and Crafts movement, that is why I'm using modernist styles with their respective designers.\n\nWeinziet,  \nThank you for your great consideration. I have to say that you've open few more doors in my brain and though I need to find the book you've suggested. I think I've seen it before. It is a great idea what you say, I know but I don't know if it would be as much graphics as type. I'm trying to mix the both togheter. Do you think that the ornaments would be the replacement of nowadays graphics?\n\nHi LetterGothic,\n\nDo you really think that I'd be enclosing El Lissitzky in the Bauhaus? or in the Constructivism. I believe that he was influenced by the Bauhaus but it was a Russian Constructivist typographer.\n\nI'm debating between Pop Art or Constructivism to complete the 4th Choice.\n\nI completely agree with all you say about Richard Eckersley. He used to experiment with type rather than designing types...admirable job though.\n\n"
    },
    {
      "time": "",
      "content": "Laura,\n\nEl Lissitzy \\_was\\_ a Russian Constructivist artist, designer, typographer and architect. However, when he was appointed a soviet cultural ambassador to Weimar, Germany, in the early 1920's, he began to design in Germany. His output of constructivist design in Germany profoundly influenced the direction of Bauhaus teaching and output (as did Moholy and van Doesburg) away from Itten's spiritualism and toward the original goal of uniting art and industry.\n\nIMHO, Constructivism was far, far more important in shaping graphic design, as we know it today, than was pop art.\n\n"
    },
    {
      "time": "",
      "content": "Thank you Lettergothic,  \nIt is really reassuring to hear your knowledge in the subject. I completely agre being Construcivism much more important in Graphic Design than Pop art. However, what do you think are the more significative differences between Bauhaus and Constructivism?\n\n"
    },
    {
      "time": "",
      "content": "Neville Brody did a lot of stuff by hand before getting his first Macintosh computer. Not everything he's done would be considered \"digital\".\n\n"
    },
    {
      "time": "",
      "content": "Thanks Ricardo,  \nIn what period would you consider him to be then?  \nBest wishes  \nLaura\n\n"
    },
    {
      "time": "",
      "content": "Laura, I was just trying to say that sometimes you can't divide things into clear-cut categories or periods. Sometimes there is a bit of overlap.\n\nAlso, \"Digital Age\" sounds like it's defined by a technology (computer-aided design) rather than by the ideas behind it (like the International or Swiss style, which has Modernist underpinnings).\n\n"
    },
    {
      "time": "",
      "content": "Absolutely,\n\nDigital Age sounds too extended, too confusing. There are many periods behind it and I'm having a bit of a problem to identify three designers that represent the Digital Age. I'm going to change it to something different. At the moment 'in this unknown group, maybe called Contemporary Design' I have Neville Brody and Jonathan Barnbrook and, was thinkin of David Carlson.\n\n"
    },
    {
      "time": "",
      "content": "I used to be interested in 20th century modernism, but came to realize that it played a very small part in graphic design as practised, and a disproportionately large part in design history.\n\nIMO, historicism was the most important movement of the 20th century, and three key typographic figures would be William Morris, Frederic Goudy, and Stanley Morison (a creative director more than designer). There are others, but the material about these is copious, and in English, so you can easily find what they did and had to say.\n\nHistoricism is not to be confused with traditionalism, which is doing things the way they've always been done.  \nHistoricism was a radical movement which tapped into anti-industrialism, discovering and reviving centuries-old styles of design.  \nDuring most of the 20th century, popular media was dominated by work in the historicist style, and modernism was marginal.\n\n ![](http://web.archive.org/web/20111222213828im_/http:/typophile.com/files/victrola_5762.jpg)\n  \nThis ad is from 1920, bringing recorded music to the masses.  \nTalking machines -- how high-tech is that?  \nAnd yet, typically, the ad is historicist, with a Bold version of a 15th century type for the headline, and Goudy's neo-renaissance old-style for the text. \n\nBarnbrook, Brody and Carson are revered in the design community, but are they representative of contemporary design?\n\n"
    },
    {
      "time": "",
      "content": "I think that your list might get more interesting if you picked less obvious choices for the designers and if the designers weren’t all men. And I agree with Nick on both counts: there’s more to design history than modernism, and the argument can be made that modernism sprung out of the historicism of the arts and crafts movement. Barnbrook, Brody, and Carson aren’t really representative of digital or contemporary design, their really influential work would be better categorized as “Postmodern”. Poyner’s book on postmodernism will be a big help for dealing with the 1980s and 1990s.\n\n"
    },
    {
      "time": "",
      "content": "\\>Thank you Lettergothic,  \n\\>It is really reassuring to hear your knowledge in the subject. I completely agre being Construcivism much \\>more important in Graphic Design than Pop art. However, what do you think are the more significative \\>differences between Bauhaus and Constructivism?\n\nHi Laura,\n\nYour welcome!\n\nThat's a big order. Historical periods exist only because of the ability to look backwards and notice trends in style that grouped at a given time. Constructivism evolved over time and space and only becomes visible as a general manifestation of stylistic tropes when we view it from a distance. Not every \"constructivist\" designer's work exhibited all the same manifestations but all of them shared enough similar characteristics, at a given time, to be grouped under the general umbrella of constructivism. Every artist brought different sensibilities and experiences to the table. Piet Zwart and Paul Schuitema are usually acknowledged to have practiced a sort of Dutch Constructivism. Their work shared what we now recognize as constructivist hallmarks but they tended to use a DiStijl palette of red, yellow, blue and black. Same with the Bauhaus. Certain constructivist tendencies were incorporated into the style grouping that characterized Bauhaus work. Herbert Bayer's poster for Kandinsky's birthday is pretty constructivist looking (architectural, diagonals, red and black, etc. but his \"Bauhaus Dessau\" book cover not so much ( that said, the photograph of the balconies does have a Rodchenko feel to it). Just like every style group, the Bauhaus evolved and changed over its run. It ended up a very different place than it began. As different teachers came and went, they brought different things to the mix. The Bauhaus started out as a rather different place than the one that we now celebrate as being pivotal in the evolution of design as we now know it.\n\nThe Bauhaus set out to integrate art and industry and was basically apolitical (until Hannes Meyer took over). Constuctivism developed as an art form in support of the Communist revolution---different goals, different products.\n\nIt's more nuanced than it seems at a glance. Was this was helpful?\n\n"
    },
    {
      "time": "",
      "content": "Futurism?\n\nI'm surpised no one has mentioned this so far...\n\n--  \narjun\n\n"
    },
    {
      "time": "",
      "content": "_Constructivism evolved over time and space and only becomes visible as a general manifestation of stylistic tropes when we view it from a distance._\n\nIf one looks at movements as just a visual style, then this kind of comment is easy to make, because it is self fulfilling.  \nOne looks back, sifting for commonalities through the filters of one's own prejudices, and determines significance.\n\nHowever, when Rodchenko and Stepanova published the _Program of the First Working Group of Constructivists_\\* in 1921, they defined it, so it's quite different from historical movements which were identified after the fact.\n\nSo how does one judge what constitutes Constructivism?  \nDoes it have to \"generally manifest stylistic tropes\" as David believes, or should it be, as per Rodchenko and Stepanova, \"the communistic expression of material structures\"?\n\n\\*It's in _Looking Closer 3: Classic Writings on Graphic Design_\n\n"
    },
    {
      "time": "",
      "content": "This may have been an obvious choice for a forth, but what about 'Grunge'?\n\n"
    },
    {
      "time": "",
      "content": "There is an interesting historical design movement that relates specifically to type design; legibility--i.e. making the physical process of reading the prime consideration in the design of a type.\n\nIt had some of the social idealism of early 20th century modernism.  \nRather than have a distinct look, it expressed itself in many ways.\n\nOne sees the begining of it in Cheltenham, with its emphasis on the upper part of the lower case characters, because that is more important in reading (or at least, that's what its designers believed).  \nCentury Schoolbook was a legibility face, as was Clearface -- both by Morris Benton for ATF.  \nThen there was the Legibility Series of newspaper faces from Linotype.  \nAll those in the early 20th century.\n\nIs that enough for a movement?  \nWas it disctinctively American?\n\nWhat of designs where legibility was not the prime concern, but was an important consideration?  \nPaul Renner for instance, in designing Futura, was well aware of how \"the sphere of appearances\" impinged on \"the sphere of mathematical concepts\".\n\nCan we now look back and identify work as belonging to a movement, even if that was not the author's stated or considered intention? Can we perhaps say that the surge of sans serif typography around 1930 was not so much an expression of broad Modernism, but more specifically Functionalism, which in text type must surely constitute the belief that simple monoline forms are the most efficient and legible?\n\nGiven the variety of type design solutions to the brief of \"legibility\", is it enough to identify design movements purely on the basis of established visual cliché?\n\n"
    },
    {
      "time": "",
      "content": "What is the value in sorting out historic designers into movements? This is a very common academic exercise but so much time is spent in the sorting process but to what end? It is like an obsessive compulsive disorder sufferer who must sort things out in some kind of order just to scratch an itch but there is no real value in the accomplishment. Was Piet Swart a Constructivist, De Stijlist, Bauhausist, Modernist, or just an Artist designer? If we sort it all out and even agree on any particular \"ist\", does it really do anything to further our ability to achieve something of our own in our own time? Is there something more productive we can do in looking at historical figures than sorting them into pigeon holes?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>This is a very common academic exercise but so much time is spent in the sorting process but to what end?</cite>\n\nLBJ is reputed to have said something like \"everyone in the graveyard has an equal right to vote\" -- this in response to a complaint that the names on some stones were a trifle hard to read.\n\nIn the same vein, academics have a right to eat (but not cake).\n\n"
    },
    {
      "time": "",
      "content": "Pigeon-holing may be a necessary evil in developing an eye for identifying the different principles that can inform a design.\n\nIs it useful to know that Futura has classically proportioned capitals, with a geometrically constructed lower case modified to accomodate legibility concerns?\n\nHow would one know this without placing that understanding in historical terms?\n\nI guess a lot depends on the validity of using allusion as a design principle--i.e. combining elements that allude to the same historical era or movement, in order to get the fast track on harmonizing them.\n\nDoes it help you to see and design better, if you know historical context?\n\n"
    },
    {
      "time": "",
      "content": "Thank you to all of you.  \nIt has been really interesting to read your comments. As well, I've made few notes in the history of design I keep to myself.  \nBest Wishes\n\n"
    },
    {
      "time": "",
      "content": "Aw, come on and tell us how your school project turned out. That's the reason you started this thread, after all. :-)\n\n"
    },
    {
      "time": "",
      "content": "the value in classifying historical sub-groups or genres in any field of study is that it helps the compiler map out a sort of mental \"genealogy\" of movements, which leads to a broader understanding of history, ie who inspired what, what inspired who and generally how everything mixed together to lead us where we are today\n\nand to answer your question, i think it absolutely helps to know the history of the field you're working in. learning where everything came from helps me understand the reasons for all the changes that led to other movements. being able to see the evolution of a form of art is so helpful when trying to improve my skillset.\n\n"
    },
    {
      "time": "",
      "content": "Chris and Nick: great comments!  \nThank you… :=)\n\nP.S. Laura, if you're still at it, they are absolutely right about Jon Barnbrook and Brody.  \nFor lack of better terms we should call their work \"post-modern\". Brody did his most amazing work while art-directing The Face, way before he started to use DTP.\n\n"
    },
    {
      "time": "",
      "content": "Hi Ricardo,\n\nI'd like to show you what I've done so far.  \nEverybody participating in the site has helped me a lot.  \nIt is really grateful to share opinions with people7/ interested in interact to learn all together and, more importantly, to build our critical point of view.\n\nThis proyect is about 'deck of poker cards' each suit represents a movement. At the moment have 3 suits designed out of 4. Swiss design, Constructivism and Grunge Design. I need to design a 21st Century suit, create it, so my ideas are 'vectorial age' (everything done with illustrator) or 'icon movement'...I'm still thinking about it.\n\nPlease see the attachments to see the suits I've designed....\n\nGerald,  \nI share your opinion about history of design.  \nI'll be asking for help in a new topic soon. I'd love you to participate.\n\nPiccic,  \nYes, I completely agree with you. I think that Brody, David Carson and Barnbrook broke with the rules of the Modernism. They are pure Postmodernists developed more recently as Grunge design.\n\n ![](http://web.archive.org/web/20111222213828im_/http:/typophile.com/files/Deck%20of%20Cards_Constructivism_Diamonds_Page_01_3463.png)\n  \n\n ![](http://web.archive.org/web/20111222213828im_/http:/typophile.com/files/Deck%20of%20Cards_Constructivism_Diamonds_Page_09_4284.png)\n  \n\n ![](http://web.archive.org/web/20111222213828im_/http:/typophile.com/files/Deck%20of%20Cards_Grunge_Spades_Page_02_4462.png)\n  \n\n ![](http://web.archive.org/web/20111222213828im_/http:/typophile.com/files/Deck%20of%20Cards_Grunge_Spades_Page_13_6193.png)\n  \n\n ![](http://web.archive.org/web/20111222213828im_/http:/typophile.com/files/Deck%20of%20cards_Swiss_Clubs_Page_01_4925.png)\n  \n[img:Deck of cards\\_Swiss\\_Clubs\\_Page\\_13\\_4968.png\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20111222213828im_/http:/typophile.com/files/Deck%20of%20cards_Swiss_Clubs_Page_13_5236.png)\n\n"
    },
    {
      "time": "",
      "content": "Looks like a cool project, Laura! Thanks for sharing some of the images.\n\n"
    },
    {
      "time": "",
      "content": "Thanks  \nI'll show you my 4th suit when I get it done.  \nI've hanged the questionary tittled Art Deco in the 21st Century, have a look at it. If you can would be great to get your opinion.\n\nMany Thanks,  \nLaura\n\n"
    },
    {
      "time": "",
      "content": "The idea is very interesting (using playing cards, to me looks like teaching and reflecting over typography and writing with people which have no knowledge on the subject, providing insights).\n\nI have to tell that I cringe when I read the term \"grunge design\". Its meaning is close to nothingness in my view. Call the process of breaking down and reprocessing, collaging, cutting and pasting something like \"deconstructivist\", \"post-structural\", or whatever, but not \"grunge design\". It's a meaningless and superficial term, even worse than provisional terms like \"post-something\"…\n\n"
    },
    {
      "time": "",
      "content": "Thanks Piccic,\n\nI like your point of view. It is a great argument, I have to admit that \"grunge design\" to me it means...well, what you said...deconstrutivist or post-structural.\n\nPiccic, It would be great if you can participate in the questionary I raised in a different topic about 'Art Deco in the 21st century'. Just if you feel like.\n\nMany Thanks for your comments. It is great!  \nLaura\n\n"
    }
  ]
}
