{
  "id": "50482",
  "title": "christmas card",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I know its early but I'm designing a corporate christmas car, I was thinking of doing a typographic christmas tree I saw it done once before but cant remember where.\n\nHas anyone else something similar or any site where I can find nice sample to get some inspiration?\n\nThanks!!\n\n",
  "author": "amyloo",
  "time": "14 Oct 2008 — 8:13am",
  "uid": "32618",
  "comments": [
    {
      "time": "14 Oct 2008 — 8:54am",
      "content": "So you want to know where you can copy one?\n\nHere's an idea: make one yourself, show us,  \nand hopefully we can help you improve it.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2008 — 9:02am",
      "content": "I think that's a little unfair that was definitely not my intention. I always research an area before I start to design that is not to say I plan to copy the things I like!!\n\n"
    },
    {
      "time": "14 Oct 2008 — 9:07am",
      "content": "Sorry if I was a bit snappy; I look at stuff all the time too. I just like to see people try first and look later: it makes for much more creative output. And this peeve extends to formal education: when you teach somebody something, you're perpetuating the past and curtailing discovery.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2008 — 10:53am",
      "content": "Hrant\n\n\"when you teach somebody something, you’re perpetuating the past and curtailing discovery.\"\n\nWithout a base knowledge of the past, discovery, or ground breaking, is difficult. I have always felt that you have to teach them the rules before they can break them! Oh wait, my uneducated monkey has made a groundbreaking design discovery : ) And he is left handed!\n\nMichael\n\n"
    },
    {
      "time": "14 Oct 2008 — 11:03am",
      "content": "Formal education isn't useless, but it is a two-edged sword. I think people can pick up some basics from the \"swirling background\" and make highly fruitful initial explorations, and _then_ get some formal education to tie things down. People who start off formally either take decades to become liberated, or never know what they're missing and simply fortify the establishment.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2008 — 11:55am",
      "content": "\"Formal education isn’t useless, but it is a two-edged sword.\"\n\nI agree Hrant. I am self taught, for better or worse. I learned from traditionalists like Zapf, Poppl and Schneider by looking at their work. I took off from there. I exploited their anomalies as well as their stalwart forms. One has to march to their own drummer and I think that is what sets people apart. Discovery is inherent in a mischievous mind : )\n\nMichael\n\n"
    },
    {
      "time": "17 Nov 2012 — 11:49am",
      "content": "Creating with letters:  \n [http://www.bemboszoo.com/](http://web.archive.org/web/20130215020944/http:/www.bemboszoo.com/ \"http://www.bemboszoo.com/\")\n\nSample:\n\n ![](http://web.archive.org/web/20130215020944im_/http:/typophile.com/files/wolfS_5235.jpg)\n\n=====\n\nChristmas is an awfulness that compares favorably with the great London plague and fire of 1665–66. No one escapes the feelings of mortal dejection, inadequacy, frustration, loneliness, guilt and pity. No one escapes feeling used by society, by religion, by friends and relatives, by the utterly artificial responsibilities of extending false greetings, sending banal cards, reciprocating unsolicited gifts, going to dull parties, putting up with acquaintances and family one avoids all the rest of the year ... in short, of being brutalized by a “holiday” that has lost virtually all of its original meanings and has become a merchandising ploy for color tv set manufacturers and ravagers of the woodlands.  \n —Harlan Ellison, _Los Angeles Free Press,_ 12/28/72\n\n"
    }
  ]
}
