{
  "id": "50498",
  "title": "I want your really good PowerPoint slides",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m working on a book and I need good examples of presentation slides. I want slides that are clear, compelling, and informative. They can be PowerPoint, Open Office, or anything else. Preferably they would be from real presentations rather than samples.\n\nWhere should I look for really good slides? Do you have any to share? Post a link to a really good one and I might feature it in my new book.\n\nThanks,  \nZack\n\n",
  "author": "<a href=\"/web/20090419081257/http://typophile.com/user/37858\" title=\"View user profile.\">zgrossbart</a>",
  "time": "<br>",
  "uid": "37858",
  "comments": [
    {
      "time": " 14.Oct.2008 1.42pm",
      "content": "Check out [www.presentationzen.com](http://web.archive.org/web/20090419081257/http:/www.presentationzen.com/ \"www.presentationzen.com\")\n\n"
    },
    {
      "time": " 14.Oct.2008 4.26pm",
      "content": "Oxymoron.\n\nWhich is precisely why the book will be a smashing success. =)\n\n"
    },
    {
      "time": " 14.Oct.2008 5.48pm",
      "content": "Try contacting the Washington DC AIGA, the DC Art Director’s Club, and DC area design firms. Many federal agencies and contractors require copies of presentations and only accept Powerpoint files. This has created a market for good Powerpoint presentations and local designers are all over it.\n\n"
    },
    {
      "time": " 14.Oct.2008 7.55pm",
      "content": "Thank you to everyone for the suggestions. I have contact the Washington DC AIGA.\n\nWhat if I opened the question up to really good slides from any tool? Does anyone have any presentation slides from any tool that are particularly good?\n\nThanks,  \nZack\n\n"
    },
    {
      "time": " 16.Oct.2008 9.56pm",
      "content": "If you find some interesting slides, please share here.\n\n"
    },
    {
      "time": " 17.Oct.2008 8.27am",
      "content": "Here are my two best slides...\n\n ![](http://web.archive.org/web/20090419081257im_/http:/typophile.com/files/slide1_3691.JPG)\n\n ![](http://web.archive.org/web/20090419081257im_/http:/typophile.com/files/Slide2_4108.JPG)\n\n"
    },
    {
      "time": " 24.Oct.2008 6.23am",
      "content": "Hello Everyone,\n\ndontbug me asked me to post if I found a source for good slides. Check out [http://www.slideshare.net/](http://web.archive.org/web/20090419081257/http:/www.slideshare.net/). They are a social networking sight around slide presentations.\n\nCheers,  \nZack\n\n"
    },
    {
      "time": " 26.Oct.2008 9.27pm",
      "content": "Next time in the future get your self a mac and buy an application called “Keynote”. Its better, and cleaner then PowerPoint.\n\nAs for the layer, I would use Helvetica Bold as your font, keep every sentence on the left, and align the text. Set the background black and the font white. thats probably the most beautiful color combination there is, also you show contrast so it’ll be easier to read.\n\nIt’ll look good.\n\n"
    }
  ]
}
