{
  "id": "50503",
  "title": "Color-changing offset printing inks?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m looking for a production technique that uses traditional offset printing with inks that can change color with varying temperatures. Specifically, I’d like to find an ink or process that can be applied invisibly and will appear when heat is applied. Such as a warm breath or touch of a hand.\n\nI’ve talk to a couple of local printers and they haven’t been able to find anything that meets specifically what I’m looking for. There are inks that will go down opaque and have a color and disappear when heat is applied, but that’s the opposite of what I’m looking for.\n\nDoes anyone know of such a process or where to begin my search?\n\nThanks,\n\nJenkin\n\n [‹ Max Kerning](http://web.archive.org/web/20081018082323/http:/typophile.com/node/50508 \"Go to previous forum topic\") [Unicode programmer font ›](http://web.archive.org/web/20081018082323/http:/typophile.com/node/41253 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081018082323/http://typophile.com/user/24988\" title=\"View user profile.\">Jenkin</a>",
  "time": "<br>",
  "uid": "24988",
  "comments": [
    {
      "time": " 14.Oct.2008 3.20pm",
      "content": "hi jenkin  \nsorry i can’t answer your question, but I’m interested in what  \nyour local printers told you...could you give me the details of  \nthose specific inks?\n\ncheers\n\n"
    },
    {
      "time": " 14.Oct.2008 3.37pm",
      "content": "This is getting into very specialized territory. One place to start might be to talk to Brady-Palmer, Inc. They are a book jacket & cover printer near New York City. They do amazing things.\n\n[http://www.bradypalmer.com/](http://web.archive.org/web/20081018082323/http:/www.bradypalmer.com/ \"http://www.bradypalmer.com/\")\n\nAlso talk to a major ink manufacturer. Find out what their inks can do and then ask them to recommend printers who use those inks. Ask your regular printer who their best ink supplier is.\n\nYou will also need to find out if this work needs a special stock.\n\nKeep us posted here.\n\npowers\n\n"
    },
    {
      "time": " 14.Oct.2008 3.41pm",
      "content": "Here would i found so far...\n\n[http://www.screenweb.com/index.php/channel/6/id/1425/](http://web.archive.org/web/20081018082323/http:/www.screenweb.com/index.php/channel/6/id/1425/ \"http://www.screenweb.com/index.php/channel/6/id/1425/\")\n\n"
    },
    {
      "time": " 14.Oct.2008 4.53pm",
      "content": "This conversation made me think of the old Transformer emblems on the toys. They were black, but after adding heat (your thumb) they would reveal the Transformer’s party affiliation. Pretty cool.\n\nCan I ask what you’re designing that would require such a unique technique, or is it hush-hush information?\n\n"
    },
    {
      "time": " 14.Oct.2008 9.19pm",
      "content": "IIRC the Underware foundry printed a book like that as a  \nspecimen for their Sauna typeface, so you could ask them.\n\nhhp\n\n"
    },
    {
      "time": " 15.Oct.2008 4.56am",
      "content": "Indeed, Underware uses it in their Sauna typeface specimen. It was printed by a printer in The Netherlands called [Ando](http://web.archive.org/web/20081018082323/http:/www.ando.eu/), in Den Haag (The Hague). So you could either try contacting Underware, or send an email to the printer.\n\nOn a sidenote, I’ve also seen something like it on coffee packaging here in the Netherlands, not too long ago. Somekind of promotional thing where there were blank stickers on the packaging, which you had to stick on the outside of your hot coffee cup and a text would appear.\n\n"
    },
    {
      "time": " 15.Oct.2008 5.52am",
      "content": "There was a similar thing done on a wine label I saw once. When the wine is stored at the proper temperature, part of the label turns a certain color (blue, I think it was). Don’t recall the winery.\n\nHey, Will (or Carl or Chris Slye) — I think this might have been that Tempranilla we had at that tapas place in Buffalo; does this ring a bell with you?\n\n— K.\n\n"
    },
    {
      "time": " 15.Oct.2008 6.19am",
      "content": "Dammit, Kent, you are right once more! I was just going through all the paper I hauled back from Buffalo and I came across the piece with the notation about that wine. I think I can get my hands on it again, and I think it was the Tempranillo. & I have since seen one other wine label with this feature.\n\npowers\n\n"
    },
    {
      "time": " 15.Oct.2008 8.35am",
      "content": "Thank you everyone for the responses. I’ve fired off several emails to some of the resources mentioned above. I’ll keep you updated as I find out more information and when my project is complete I’ll post photos of samples. Unfortunately it is hush hush right now otherwise I’d spill the juice.\n\nThanks again!\n\n"
    },
    {
      "time": " 15.Oct.2008 9.17am",
      "content": "Newcastle Brown ale does (or did, at any rate) do exactly the same thing - the blue star logo on the neck of the bottle only appeared when it had been properly chilled...\n\n@Asvetic: I love the term ’party affiliation’ applied to everyone’s favourite transforming robots. Republicons vs Autocrats! Genius.\n\n[[semibad](http://web.archive.org/web/20081018082323/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": " 15.Oct.2008 9.23am",
      "content": "Coors Beer has a similar color changing feature too. The mountains on the label go from white to blue at serving temperature.\n\n"
    },
    {
      "time": " 15.Oct.2008 9.35am",
      "content": "The white-to-blue color shifting inks are awesome, but not exactly what I’m looking for. I need clear-(or white)-to-color when heat is applied, not cold.\n\n"
    },
    {
      "time": " 15.Oct.2008 10.50am",
      "content": "Well, you might look into whether they go from white-to-blue with cold, or blue-to-white with heat. Could be either.\n\n"
    },
    {
      "time": " 16.Oct.2008 1.59am",
      "content": "Sounds cool, good luck on your search.\n\n"
    }
  ]
}
