{
  "id": "50508",
  "title": "Max Kerning",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just ran across maxkerning.com. The site introduces you to an over-the-top character who is obsessed with good typography.\n\nIn his faux manifesto he states: \"...technology conveys thoughts more cleanly and rationally than our imperfect mortal abilities.\"  \nWith a footnote that reads:  \n\"I admire the effort of men who hand kerned type, but when I look at  \ntheir work, I see fragments of sloppiness everywhere.\"\n\nAfter this odd experience, I did a whois search of the domain maxkerning.com to find it belongs to Extensis.\n\nI'm thinking maybe they have some sort of new kerning technology? Anyone have more info? Insight?\n\n",
  "author": "<a href=\"/web/20100726115346/http://typophile.com/user/7714\" title=\"View user profile.\">TGaskin</a>",
  "time": "<br>",
  "uid": "7714",
  "comments": [
    {
      "time": "",
      "content": "definitely you have stumbled on to some kind of viral marketing campaign. The name of the site is probably being spread around at technology conferences with little to no explanation right now or soon. No idea whether it relates to an upcoming product though.\n\n"
    },
    {
      "time": "",
      "content": "Remember Monotype's \"Agency fit\"? Reminded me of group sex. Well, no, reminded me of what I \\*imagined\\* group sex would look like.\n\nFor ease of kerning, I recommend Chinese.\n\n"
    },
    {
      "time": "",
      "content": "The site is owned by [http://www.extensis.com](http://web.archive.org/web/20100726115346/http:/www.extensis.com/ \"http://www.extensis.com\")\n\n"
    },
    {
      "time": "",
      "content": "I am curious for some more information. The text is too much of advertising talk for me to bear and too little information. But I am amused that Extensis uses the term \"Manifesto\" as did Igino Marini's [iKern](http://web.archive.org/web/20100726115346/http:/www.ikern.com/) site before. Could be a coincidence. Is it?\n\nKarsten\n\n"
    },
    {
      "time": "",
      "content": "\\>Could be a coincidence. Is it?\n\nI hear that when McCain found out that Obama had a \"Manifesto\" he went out to get one too - I think he found it on Craig's List.\n\n"
    },
    {
      "time": "",
      "content": "Now I want one too.\n\n"
    },
    {
      "time": "",
      "content": "<cite>The text is too much of advertising talk for me to bear and too little information.</cite>\n\nKarsten, yes. If the web designer got it right, the advertisement is aimed at lower-level managers who are trying to justify their job to slightly-higher-level managers -- \"See, I'm organizing!\" \"I got stuff to enhance productivity\" and \"I'm sending people to seminars.\"\n\nOf course, I've been wrong before, and am reputed to be somewhat of a curmudgeon.\n\n"
    },
    {
      "time": "",
      "content": "Update, the site maxkerning.com has a link to Extensis' new/updated product Suitcase Fusion 2.\n\n"
    },
    {
      "time": "",
      "content": "\"when McCain found out that Obama had a “Manifesto” he went out to get one too \"\n\nMcCain already did that once when he was in his 30s, didn't he? I mean after her heard that Karl Marx had one, he went out and got one, too :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Update, I checked the site - no change - still annoying ;-)\n\n"
    }
  ]
}
