{
  "id": "50510",
  "title": "Logo for swanky Laguna Beach seafood bar and grill...",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Any constructive criticism for this logo would be much appreciated.\n\nThis logo is for a restaurant that will be opening early next year in Laguna Beach, CA. The name is WaterMarc--it will be contemporary take on a seafood bar and grill.\n\nThe concept for the logo is that the \"W\" throws a shadow of a three-tined cocktail fork on the plate. I tried doing the W first and then the fork, but it didn't look right, so I drew the fork's shadow the way I wanted it to look first, then custom drew the \"W\" to kind of match it. I am a self-taught designer and have never tried to draw my own letters before, so I'm looking to this venerable community to help me out!\n\nThank you, and peace.\n\n| Attachment | Size |\n| --- | --- |\n| [WM2.jpg](http://web.archive.org/web/20130824233624/http:/typophile.com/files/WM2.jpg) | 613.67 KB |\n\n",
  "author": "emivey",
  "time": "14 Oct 2008 — 7:11pm",
  "uid": "20112",
  "comments": [
    {
      "time": "14 Oct 2008 — 7:27pm",
      "content": "The fork being a \"W\" is brilliant, but don't show the fork itself, just the shadow. You'd make the \"W\" of the shadow upright (with the stem bending over the plate's contours\\*) and that's that. Very classy. They could raise their prices just based on that logo! ;-)\n\n\\* Maybe use a slightly more contoured plate.\n\nBTW, interesting name they chose. Is the interior decoration going to involve watermarked coarse ecru wallpaper? Then I would go.\n\nhhp\n\n"
    },
    {
      "time": "15 Oct 2008 — 3:39am",
      "content": "A drop shadow? Really? I don't know, man, this is pretty weak.\n\n"
    },
    {
      "time": "15 Oct 2008 — 2:47pm",
      "content": "This design captures the essence of what makes for a good logo--once seen always remembered. I disagree with hrant; I would leave the graphic exactly as is. If anything, I would think about softening the \"W\" a tad. It's a bit on the stark contrast side.\n\nDo you mean to use the text beneath? Don't! Find a way to work that \"W\" into the text as well, and you have a double-good design. But, just to stress: don't let that graphic anywhere in public with that text!\n\nCurt Akin\n\n"
    },
    {
      "time": "3 Nov 2008 — 7:44am",
      "content": "Yea, wonderful logo graphic! I love the fork. I'm not so sure I'm feeling the plate though. Have you tried it without the plate? It just seems like stock photography, feels a little amateurish, which doesn't do your graphic justice. Yea, I don't think you need the plate.\n\nAs for the text, too much. And it's sloppy, people are going to be eating there, if you are looking for class, stick with a font that would compliment your \"W\" I mean, why aren't you using that same typeface? so there's a connection with the two W's. It possibly will not work well, but it's worth looking at.\n\nBut great idea! I'd love to see it when you're finished.\n\ncourtney\n\n"
    }
  ]
}
