{
  "id": "50511",
  "title": "choice font for print on demand",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "looking for suggestions which work particularly well for print-on-demand books. georgia is apparently well suited for the p.o.d. process, which tends to degrade fonts int the way that several generations of xeroxing would, but the look is unappealing, perhaps too friendly or childish. constantia is the only other i'm aware of that's recommended. any suggestions?\n\nit will be for a new edition:  \n [http://www.amazon.com/Where-Home-Stories-German-Jewish-%C3%89migr%C3%A9/...](http://web.archive.org/web/20131113185238/http:/www.amazon.com/Where-Home-Stories-German-Jewish-%C3%89migr%C3%A9/dp/B001BARVF0 \"http://www.amazon.com/Where-Home-Stories-German-Jewish-%C3%89migr%C3%A9/dp/B001BARVF0\")\n\n",
  "author": "lucadelcarlo",
  "time": "14 Oct 2008 — 7:34pm",
  "uid": "31953",
  "comments": [
    {
      "time": "14 Oct 2008 — 8:34pm",
      "content": "What kind of press will it actually be printed on? I’ve seen some digital press jobs that rival good offset work and some that can’t hold a copy to Kinkos.\n\n"
    },
    {
      "time": "15 Oct 2008 — 12:11am",
      "content": "the company is \"lightning press\" one of the largest POD presses. they are a digital press. do you mean exactly what type of digital printing equipment they use?\n\n"
    },
    {
      "time": "15 Oct 2008 — 4:34am",
      "content": "To date, and in my opinion, presses that use dry ink (toner) do not rival offset printing for type quality, esp. when the offset press is running at 2400-3000 dpi.\n\nWhile I have no scientific evidence, this is less a matter of resolution per se. than a matter of, say, \"nearest neighbor.\" For example, in photography, with silver halide images, the propensity of a silver halide crystal to turn metalic depends on what it's neighbor does. So, even with the lith systems used in the printing industry, \"overexposure\" results in thicker type, rounded serifs, etc. etc.\n\nFor whatever reason, systems that image a belt which picks up dry toner seem to have a large \"nearest neighbor\" factor. So you don't want a heavy face to begin with.\n\nA pretty good test would be any type that looks good on your xerographic laser printer, assuming it is a fairly high quality one, stands a good chance of looking pretty good on the larger POD systems.\n\nFWIW\n\n"
    },
    {
      "time": "15 Oct 2008 — 6:31am",
      "content": "Any well-run POD shop should be willing to run some tests for you. Set the same text in a few faces (the kinds of faces Charles mentioned) and have them run a test. A shop that won't do this for a potential customer is not worth doing business with. Maybe on a white and a natural stock. Lightning is so big, they might not want to do the test. There are a lot of good POD shops around.\n\nFor years I saw no good work from Lightning. Their work looked to me as though they had cut the letters into the face of a potato, inked it on a rubber-stamp ink pad, and mashed it onto the paper. But last week I saw a book printed by them that was better. The type, a very plain sans, looks quite good.\n\npowers\n\n"
    },
    {
      "time": "15 Oct 2008 — 8:07am",
      "content": "I've published two books through Lightning Source which were set in Computer Modern and came out quite well. Computer Modern is a TeX font.\n\n"
    },
    {
      "time": "15 Oct 2008 — 9:02am",
      "content": "does anyone else remember a blog post about a graphic design class putting together a book to send to a POD printer to test the quality of their results. i think their file was available to download? does this ring any bells? maybe do a small test with several different fonts and see which one you like best?\n\n\\*\\*\\*edit\\*\\*\\*\n\nfound it:\n\n[Dear Lulu](http://web.archive.org/web/20131113185238/http:/www.lulu.com/content/2709735)\n\nand the article on [Speak Up](http://web.archive.org/web/20131113185238/http:/www.underconsideration.com/speakup/archives/005154.html)\n\n"
    },
    {
      "time": "15 Oct 2008 — 9:44am",
      "content": "Girl, you can't seriously recommend Computer Modern.  \nUnless you're saying that low-quality printing doesn't  \naffect how it looks! :-/\n\nhhp\n\n"
    },
    {
      "time": "15 Oct 2008 — 2:25pm",
      "content": "Whoa!\n\n\"...tends to degrade fonts int the way that several generations of xeroxing would...\"\n\nThat makes me bristle. First of all: it's Xeroxing, at least if you respect trademarks and want to participate in keeping them protected.\n\nSecond, Please take a page from a well set book. Xerox it \"several\" times. Compare the results with the absolute worst you can find from a PoD printer.\n\nOne of the problems with PoD printers is that they get lulled into a do-it-fast stupor; shove it in one end and what comes out the other goes to the customer. QA is generally superficial (ie, if the signatures are in the correct order and the cover is properly oriented, it's a good book).\n\nWe had a title that was originally printed by a superior offset book printer in Canada. There was a need for a quick 2nd, short-run printing. We used our PoD printer. I admit that I viewed the results through 70-year-old eyes worn out by looking at print products for roughly 4 decades, but I was hard pressed to see a difference. I could tell which was which by smell, but visual comparison was much, much harder. The book was set in Garamond. I would not suggest Bodoni, but its serifs are hard to hold anywhere.\n\nSpend as much time finding a competent PoD printer as you do looking for the correct typeface, and you'll do fine.\n\nAnd, let's remember: lightning print and lightning source are two VERY different printing establishments.\n\nCurt Akin\n\n"
    },
    {
      "time": "15 Oct 2008 — 2:27pm",
      "content": "And Lightning press is difference from lightning source.\n\nCurt Akin\n\n"
    },
    {
      "time": "15 Oct 2008 — 7:51pm",
      "content": "About a year ago, Ken Sabol showed me some samples done by IBT (Integrated Book Technologies, Inc) that, as I remember, looked pretty darn good. The images were better than the type.\n\nBut also as I remember, the crossover for cost was around 800 copies & down for short-run xerography. Any more & offset was cheaper. I dunno if IBT offers print-on-demand services, or just short run.\n\n"
    },
    {
      "time": "16 Oct 2008 — 8:47am",
      "content": "\"Girl, you can’t seriously recommend Computer Modern.  \nUnless you’re saying that low-quality printing doesn’t  \naffect how it looks! :-/\"\n\nI do indeed. These were medical terminology books, with no illustrations.\n\nI'm typesetting another project which is a cookbook in English and Polish. This book will contain photographs. I've ordered another publisher's book, printed by Lightning Source, which has many photographs, mostly in color. I'll make up my mind how to proceed once that book arrives.\n\n"
    }
  ]
}
