{
  "id": "50521",
  "title": "Font suggestions: 15th-century Rome and beyond",
  "forum": "Design",
  "tags": [

  ],
  "content": "I would appreciate your ideas on suitable fonts for a project to do with the history of art and architecture that is set in the 15th-century Rome but also extends to the Christian Orient, for example to Armenia and Ethiopia.\n\nThe output will be both for the screen (moving images and interactive) and print. I am hoping for a selection of options, something simple and readable for text/headings and something more old-looking/idiosyncratic for maps and images. The body text font will need to have extended pro features.\n\nApart from the font names, any links to the pictorial references pertaining to this period would be great too.\n\nThank you for the suggestions...\n\nAnna\n\n [‹ Where to put the Ss serifs in a slab?](http://web.archive.org/web/20081020051244/http:/typophile.com/node/50660 \"Go to previous forum topic\") [how to draw smooth S? ›](http://web.archive.org/web/20081020051244/http:/typophile.com/node/50601 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081020051244/http://typophile.com/user/26640\" title=\"View user profile.\">Anna Waldon</a>",
  "time": "<br>",
  "uid": "26640",
  "comments": [
    {
      "time": " 15.Oct.2008 6.43am",
      "content": "Paradigm by [Nick Shinn](http://web.archive.org/web/20081020051244/http:/www.shinntype.com/)\n\n"
    },
    {
      "time": " 15.Oct.2008 10.00am",
      "content": "You might look at Rimmer’s Cadmus\\*, Carter’s Sophia\\*\\* and Stone’s Basalt\\*\\*\\*. But those are all caps-only. There’s also Sava\\*\\*\\*\\*. Just don’t use an uncial, or Lithos!\n\n\\* [http://www.myfonts.com/fonts/rimmer/cadmus/](http://web.archive.org/web/20081020051244/http:/www.myfonts.com/fonts/rimmer/cadmus/ \"http://www.myfonts.com/fonts/rimmer/cadmus/\")\n\n\\*\\* [http://www.myfonts.com/fonts/fontbureau/sophia/](http://web.archive.org/web/20081020051244/http:/www.myfonts.com/fonts/fontbureau/sophia/ \"http://www.myfonts.com/fonts/fontbureau/sophia/\")\n\n\\*\\*\\* [http://www.myfonts.com/fonts/stone/basalt/](http://web.archive.org/web/20081020051244/http:/www.myfonts.com/fonts/stone/basalt/ \"http://www.myfonts.com/fonts/stone/basalt/\")\n\n\\*\\*\\*\\* [http://www.myfonts.com/fonts/adobe/sava/](http://web.archive.org/web/20081020051244/http:/www.myfonts.com/fonts/adobe/sava/ \"http://www.myfonts.com/fonts/adobe/sava/\")\n\nThe there’s Candara (which is screen-optimized as well).  \n [http://www.myfonts.com/fonts/ascender/candara/](http://web.archive.org/web/20081020051244/http:/www.myfonts.com/fonts/ascender/candara/ \"http://www.myfonts.com/fonts/ascender/candara/\")\n\nhhp\n\n"
    },
    {
      "time": " 15.Oct.2008 10.15am",
      "content": "I’m realizing that those might all be too East-looking. If Rome needs to be more central to the style you might look at Meridien, which got a much-improved revision lately. Its rather large x-height would help your screen legibility. And you might match Vendome to it for funky titling: [http://www.myfonts.com/search?search%5Btext%5D=Vendome](http://web.archive.org/web/20081020051244/http:/www.myfonts.com/search?search%5Btext%5D=Vendome \"http://www.myfonts.com/search?search%5Btext%5D=Vendome\")\n\nhhp\n\n"
    },
    {
      "time": " 15.Oct.2008 2.48pm",
      "content": "Thanks for these ideas.\n\nI think something originating in the 15th-century would be best. Or the ones that were in standard use at that time because of course references to the Antique times were often made at then to improve status and the Antique objects (e.g., columns and capitals were routinely pilfered for new buildings). I am especially interested in the cases where precursors of a font are known and/or have been discussed. E.g. like in the case of Bembo (which I suspect would not be so good for the multimedia side of things).\n\nCadmus and Sophia refer a little too much to the Classic Greek lettering with Sophia openly acknowledging its 6th-century Greek origins (which is indeed too far from target). Basalt is quite nice even though it is a “fantasy” font according to Stone himself. Maybe I can consider it given my on-screen needs, he certainly thought it would be ubiquitous if the Antique Rome used computers. This also gives me an idea that maybe I could use chiseled lettering for the major headings, calligraphic lettering for media inscriptions and a printed type for the texts… Or it might end up being too much.\n\nVendome is pretty nice, I have not seen it before...\n\nParadigm is also nice and is the right period especially given that Sweynheym and Pannartz are said to be the first printers in Rome.\n\nLots to think about…\n\n"
    },
    {
      "time": " 15.Oct.2008 3.28pm",
      "content": "This might sound strange coming from a font freak, but I think you’re being too historically literal if you insist on the design originating from a specific time period. Unless the work is specifically for the highly typographically aware, the historical accuracy you gain will probably result in a bigger loss: functionality. I think it would be a pedantic limitation of your choices more than an instance of design sensitivity. This is especially valid due to your screen quality needs.\n\nhhp\n\n"
    },
    {
      "time": " 15.Oct.2008 3.51pm",
      "content": "Very true but this is also a comparative art history project where the visual impression of everything contributes to the argument. So, mixing in some relevant fonts, perhaps only in some places, would make sense.\n\n"
    },
    {
      "time": " 15.Oct.2008 6.07pm",
      "content": "Anna, I think Hrant is right. Using period fonts in a contemporary text to support the image is going to result in a boring looking book and most people aren’t going to get the reference anyway. I could see them working on the cover, on the title page and in chapter openers, but doing the whole book that way will likely produce a pretty stuffy book.\n\n"
    },
    {
      "time": " 16.Oct.2008 1.27am",
      "content": "OK, thank you for the advice. I’ll think about it. It is not a book. It is a multimedia piece with some printed matter supporting it. So, there are many opportunities for display types to be graphically significant and to unify the other visual content that is quite eclectic. I know it is impossible to explain well without showing more or less ready images. But the suggestions so far were very helplful.\n\n"
    },
    {
      "time": " 16.Oct.2008 5.53am",
      "content": "<cite>Using period fonts in a contemporary text to support the image is going to result in a boring looking book</cite>\n\nNot if they were good typefaces. But the type “of the time” was used to put ink on paper. Laid paper. Wetted paper. Letterpress. With abbreviations. Etc.\n\nMerlo is one nice contemporary reinterpretation “of the time” for book-size text. Probably not for multimedia.\n\n<cite>It is not a book. It is a multimedia piece with some printed matter supporting it</cite>\n\nI don’t believe the 15th century Romans had what we term “multimedia.” There goes the possibility of literal representation. See above for the use of type of that period. \\*Lettering\\* would be a different matter.\n\n"
    },
    {
      "time": " 16.Oct.2008 9.34am",
      "content": "I don’t subscribe to the “what people who don’t know any better think is about right” modus operandi.  \nThe best work satisfies everyone, authentic enough for the most demanding critics, with a lively common touch to boot.  \nAuthenticity can’t be literal, as Charles points out (we don’t even use the same alphabet as then).  \nThe main thing is, any 21st century adaptation would stem from 15th century sources, not anything subsequent.\n\n"
    },
    {
      "time": " 16.Oct.2008 10.21am",
      "content": "\\> The best work satisfies everyone\n\nRidiculous.\n\n\\> stem\n\nThe trick of course is nailing down what  \nthat should mean in a given context.\n\nhhp\n\n"
    },
    {
      "time": " 16.Oct.2008 10.47am",
      "content": "Developing this theme, I am thinking of something simple-looking for most of work but maybe something very large-scale for decorative effect. Do you have any suggestions on Carolingian-influenced, humanist Italian scripts? I know of Luminari\\* but am hoping for more. Especially, as I say, for large-scale use...\n\nI guess I could just cut some out of the images and blow them up. Might be even nicer. but I also have some map/image inscriptions in mind as I mentioned before.\n\nSome references:\n\n[http://www.ibiblio.org/expo/vatican.exhibit/exhibit/b-archeology/images/...](http://web.archive.org/web/20081020051244/http:/www.ibiblio.org/expo/vatican.exhibit/exhibit/b-archeology/images/arch05.jpg \"http://www.ibiblio.org/expo/vatican.exhibit/exhibit/b-archeology/images/arch05.jpg\")  \n [http://personal.us.es/tallafigo/humanistica%20\\_archivos/image005.jpg](http://web.archive.org/web/20081020051244/http:/personal.us.es/tallafigo/humanistica%20_archivos/image005.jpg \"http://personal.us.es/tallafigo/humanistica%20\\_archivos/image005.jpg\")  \n [http://85.88.3.173/elements/resources/Image/Bilder/Degree1.jpg](http://web.archive.org/web/20081020051244/http:/85.88.3.173/elements/resources/Image/Bilder/Degree1.jpg \"http://85.88.3.173/elements/resources/Image/Bilder/Degree1.jpg\")  \n [http://www.idehist.uu.se/distans/ilmh/Ren/niccoli-hand.gif](http://web.archive.org/web/20081020051244/http:/www.idehist.uu.se/distans/ilmh/Ren/niccoli-hand.gif \"http://www.idehist.uu.se/distans/ilmh/Ren/niccoli-hand.gif\")  \n [http://upload.wikimedia.org/wikipedia/commons/7/70/Caroline\\_2.jpg](http://web.archive.org/web/20081020051244/http:/upload.wikimedia.org/wikipedia/commons/7/70/Caroline_2.jpg \"http://upload.wikimedia.org/wikipedia/commons/7/70/Caroline\\_2.jpg\")\n\n\\* [http://www.myfonts.com/fonts/canadatype/luminari/](http://web.archive.org/web/20081020051244/http:/www.myfonts.com/fonts/canadatype/luminari/ \"http://www.myfonts.com/fonts/canadatype/luminari/\")\n\n"
    },
    {
      "time": " 16.Oct.2008 11.42am",
      "content": "Maybe you could like [Silentium](http://web.archive.org/web/20081020051244/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1701).\n\n"
    },
    {
      "time": " 16.Oct.2008 12.27pm",
      "content": "Nick: _The best work satisfies everyone._\n\nHrant: _Ridiculous._\n\nWhy not aim high?\n\n"
    },
    {
      "time": " 16.Oct.2008 12.41pm",
      "content": "High is what you have to be to aim for any totality.\n\nA design is only ideal for one person at one instance.\n\nhhp\n\n"
    },
    {
      "time": " 16.Oct.2008 2.00pm",
      "content": "<cite>A design is only ideal for one person at one instance.</cite>\n\nNo, you’re equating \\*person\\* with \\*designer\\*. Big difference.\n\nAnd even for \\*designer\\* it isn’t true. I’ve always believe that when producing a fine print book, reaching the end is a matter of exhaustion rather than completion.\n\n"
    },
    {
      "time": " 16.Oct.2008 2.38pm",
      "content": "Most of the times the by-product of an ideal design, in the sense that it completely satisfies the designer, is that other people appreciate it too. At least, that is my experience. (Joy transcends!)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 16.Oct.2008 2.49pm",
      "content": "_High is what you have to be to aim for any totality._\n\nWorks for me.\n\n"
    },
    {
      "time": " 16.Oct.2008 3.26pm",
      "content": "When aiming high you risk overshooting. Aiming low most certainly misses the target. Seems clear to me what to do: Aim straight and when in doubt aim a littele bit higher.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 16.Oct.2008 3.45pm",
      "content": "Bert, straight isn’t the same kind of thing as high or low.\n\n\\*\\*\n\nThe most popular types are often the most critically acclaimed.  \nI don’t know how high Carter, Frutiger and Zapf aim, but I would suspect they try to satisfy both typophiles and Joe the plumber.\n\n"
    },
    {
      "time": " 19.Oct.2008 1.22am",
      "content": "Anna,\n\nHave you considered [Incognito & Terra Incongnito](http://web.archive.org/web/20081020051244/http:/www.fontshop.com/fonts/downloads/fountain/incognito_terra_incognita/)?\n\n"
    },
    {
      "time": " 19.Oct.2008 1.19pm",
      "content": "Maybe Centaur. This is Bruce Rogers’ redesign of a Nicolas Jenson font—Jenson lived in that same time period you’re referring to, in 15th century italy (venice i believe). Centaur itself is classified as a Venetian Renaissance font. It’s a personal favorite of mine. Absolutely gorgeous.\n\n[http://www.fonts.com/findfonts/hiddengems/centaur.htm](http://web.archive.org/web/20081020051244/http:/www.fonts.com/findfonts/hiddengems/centaur.htm \"http://www.fonts.com/findfonts/hiddengems/centaur.htm\")\n\nIt’s certainly a font that works well for copy, if you have a lot of information as in a book. But, it alwso works well for display and caption. It’s the font used for the Metropolitan Museum of Modern Art.  \nCheck the top of this page:\n\n[http://www.metmuseum.org/home.asp](http://web.archive.org/web/20081020051244/http:/www.metmuseum.org/home.asp \"http://www.metmuseum.org/home.asp\")\n\n"
    }
  ]
}
