{
  "id": "50532",
  "title": "How do I explain to a client what typesetting is?",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "My client says he \"already paid\" an editor $6,000 to set the type, do page flow, etcetera. He thinks he should not have to pay for it done again. His editor only has it in a word document. I think page numbering is already done and fonts are already chosen by his editor in word, so he also thinks this doesn't need to be done.\n\nI want him to understand the value a designer can bring to his book. How do I help my client understand this with kindness and being confident but not obnoxious? I do not know how to explain to him what the difference is between what I do when I do the book, layout, and type design, and the typesetting, and what his editor did. He doesn't understand what goes into choosing the size, the different distinguishments of type (fonts, style and spacing) for different kinds of text. He doesn't know how much time goes into typesetting (Paragraph styles, character styles, assigning them to the text one piece of text at a time). I don't want to make him angry and defensive, but his editor didn't do what I will do, and you guys understand. He just isn't a designer and doesn't understand at all. How do you guys explain the value of design to clients?\n\nThanks for any help and responses!\n\n",
  "author": "LisaJacksonDesign",
  "time": "15 Oct 2008 — 8:39am",
  "uid": "38105",
  "comments": [
    {
      "time": "15 Oct 2008 — 1:59pm",
      "content": "The bad guy here is the editor who should have made it clear from the outset that he is an editor not a book designer. I'm not sure your client understands the role of an editor; I'm not sure the editor understands the role of an editor.\n\nWhen forced up against this wall, I would hurry to find examples of Word documents turned directly into books and examples of well designed books.\n\nOr, go out on a limb and do a rough design.\n\nHave a fireside chat with your client about the subconscious impact of good vs bad design. Bad design can lead to nonsale or, worse, to a serious blemish on your client as a serious author.\n\nGood luck. It's stuff like this that earns you the big bucks .\n\nCurt Akin\n\n"
    },
    {
      "time": "15 Oct 2008 — 2:12pm",
      "content": "I'm not really sure what you could do at this point. If it was typeset in MS Word, then that's what need to be printed unless the client wants to have it paid to be redone. I agree that this is a huge oversight by the editor (Then again, I don't work in the book publishing world, so maybe I'm oblivious to the fact that most books are typeset in MS Word...as hard as that would be to believe ;o) )\n\n"
    }
  ]
}
