{
  "id": "50540",
  "title": "MF Dots Pro - 35 segment LED display-based typeface",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello all,\n\nI work with fonts in my spare time.  \nThe most work I do is editing original fonts, but sometimes I make ones.  \nThis my latest release, MF Dots Pro:\n\n ![](http://web.archive.org/web/20150415000805im_/http:/typophile.com/files/mfdotspro_5158.png)\n\n&nbsp;  \nThis is the second font I've made completely by my self.  \nMF Dots was done in 2007, containing only Latin. Now I've extended it with much more glyphs. Maybe I post my other self-made fonts also.\n\nYou can download a free-for-personal-use beta version from [here](http://web.archive.org/web/20150415000805/http:/flitskikker.fl.funpic.org/downloads/server/files/15102008/225016/MF%20Dots%20Pro.zip).\n\nSpecifications:  \n- TrueType format  \n- 3 weights (Light, Regular, Bold) + Italics  \n- 653 glyhps per file  \n- Contains Latin, CE, Greek, Baltic, Turkish, Romanian, Cyrillic and special symbols.\n\nPlease rate. :)\n\n&nbsp;  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \nPlease note, that I'm a beginner in making fonts.  \nI used Font Creator Program 5.6 for this typeface, so don't expect high detail, OT features, etc. I have some really cool ideas for fonts, but I just don't know how to convert them to real fonts. This simple (dot-based) font I almost the only font you could make with FCP. I have FontLab installed, but don't know how to use it.  \nMay I post some drawings of these fonts so you can give tips how to make real fonts of it?  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n&nbsp;  \nThanks in advance, and enjoy MF Dots Pro!\n\nKind regards,  \nMartijn van Berkel\n\n_Off-topic: How do I insert images in my post?_\n\n",
  "author": "Martijn van Berkel",
  "time": "15 Oct 2008 — 2:00pm",
  "uid": "38279",
  "comments": [
    {
      "time": "16 Oct 2008 — 6:13am",
      "content": "Nice work, Martin.\n\nLike for me, very good for the first font. Special thanks for Cyrillic.\n\nI think you must change in Greek some glyphs, as illustrated\n\n ![](http://web.archive.org/web/20150415000805im_/http:/typophile.com/files/greek_6500.gif)\n\n"
    },
    {
      "time": "16 Oct 2008 — 6:35am",
      "content": "Maybe you may change design of M and F as illustrated\n\n ![](http://web.archive.org/web/20150415000805im_/http:/typophile.com/files/mf_4355.gif)\n\n"
    },
    {
      "time": "16 Oct 2008 — 6:56am",
      "content": "Thanks for your reply.  \nI think I'll compress those Greek chars a bit, so that they reach the x-height.  \nI won't fix the \"i\", as this is a monospaced font.\n\nAbout MF: In this design it's impossible. All chars needs to be max 5x7 dots, as based on the original LED displays.\n\nI'll look for some FLS tutorials, so I can add OpenType features, small caps, etc.\n\nI discovered some more mistakes that must be fixed. ;)\n\nKind regards,  \nMartijn\n\n"
    },
    {
      "time": "16 Oct 2008 — 7:26am",
      "content": "Sorry Martijn, I misprinted your name in my first reply.\n\n"
    },
    {
      "time": "16 Oct 2008 — 8:08am",
      "content": "Nevermind ;)\n\nAnyone other comments?\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "17 Aug 2014 — 6:17am",
      "content": "Um,could you re-ypload to mega? The Download link is Dead. Thanks\n\n"
    },
    {
      "time": "21 Aug 2014 — 12:59pm",
      "content": "To answer your “Off-topic question: How do I insert images in my post?” See the link “Insert image” at the bottom of the “Post new comment” window.\n\n ![](http://web.archive.org/web/20150415000805im_/http:/typophile.com/files/InsertImage_5623.png)\n\n"
    }
  ]
}
