{
  "id": "50596",
  "title": "Repost: Cyrillic ghe stroke, italic. Information needed",
  "forum": "Elias's blog",
  "tags": [

  ],
  "content": "Dear all (and especially those of you familiar with [cyrillic](http://web.archive.org/web/20131017061604/http:/typophile.com/wiki/cyrillic))\n\nMaking italics for a typeface that contains the cyrillic letter ghe stroke, I am having difficulties finding any information on what the (lower case) italic version of this letter looks like.  \nIs it just a slanted version of the upright, or does it follow the rule of ghe (and in that case: how is the stroke applied), or is it something third?\n\nYour help will be deeply appreciated.\n\n",
  "author": "Elias",
  "time": "16 Oct 2008 — 11:10pm",
  "uid": "17399",
  "comments": [
    {
      "time": "16 Oct 2008 — 11:58pm",
      "content": "Here's a good if hard-to-parse response on this exact question from the ATypI list, when I asked about it last January. Victor Kharyk is a type designer and scholar of Cyrillic letterforms.\n\nHe wrote:\n\nLook, if anybody, for example, ask here what is the form of Latin g -  \nyou will answer:  \n\"it is a lot of forms relative to typestyles, history, different  \nnational traditions etc\". The same is with Cyrillic letters, especialy with  \nghe ang its sisters.  \n CAPS is the same in all \"Cyrillic Slavonic countries\" and Greece.  \nRoman-styled lower case is the same, exept modern Bulgaria (circa last  \n30 years), where \"reversed s\" is prefered (naturaly the direction of stress must be  \ncorrected).\n\nItalic lower case have reversed s-form in all countries, exept Serbia  \nand Macedonia, where prefered form looked as i macron (and the  \nsame with macron and acute together for Macedonian u0453)\n\nUkrainian \"explosive\" ghe u0491 is relatively new letter and its  \ndevelopement were stoped in soviet time, thats why research of its  \nforms not finish till now. There are some historical forms relatived to  \nsome forms of Greek gamma (with long tale under the baseline)- this  \nform and its development seems good for \"quill tradition\", other  \n\"dropped pen tradition\" come in early 20th century (we can see it in  \nworks of Georgiy Narbut) - this form used in modern school-books. New  \nform (reversed s with \"strich\" bottom left) was proposed few years ago  \nby Hennadij Zarechnjuk (Hennadiy Zarechniuk) from Lviv and also in use. It is mean that  \nitalic form of this letter must be designed in every font relatively  \nto its style, as like as any other letter:)\n\n\\>From my presentation in Helsinki:  \n(you got it also in goody bag)  \n [http://www.ljplus.ru/img/v/i/viktor\\_kharyk/UL32.jpg](http://web.archive.org/web/20131017061604/http:/www.ljplus.ru/img/v/i/viktor_kharyk/UL32.jpg \"http://www.ljplus.ru/img/v/i/viktor\\_kharyk/UL32.jpg\")  \n [http://www.ljplus.ru/img/v/i/viktor\\_kharyk/UL33.jpg](http://web.archive.org/web/20131017061604/http:/www.ljplus.ru/img/v/i/viktor_kharyk/UL33.jpg \"http://www.ljplus.ru/img/v/i/viktor\\_kharyk/UL33.jpg\")  \n [http://www.ljplus.ru/img/v/i/viktor\\_kharyk/UL33a.jpg](http://web.archive.org/web/20131017061604/http:/www.ljplus.ru/img/v/i/viktor_kharyk/UL33a.jpg \"http://www.ljplus.ru/img/v/i/viktor\\_kharyk/UL33a.jpg\")\n\nBest wishes  \nViktor Kharyk,  \nCountry Delegate for Ukraine :)\n\n(ps. bad English does not mean bad information :)\n\nTuesday, January 22, 2008 you wrote:  \nTP\\> Hey all you Cyrillic experts,\n\nTP\\> In its italic form, does the ghe with stroke take the same \"reversed-s\"  \nTP\\> shape as the regular (non-stroked) ghe?\n\nTP\\> I would have thought so, but I believe I've seen some examples where the  \nTP\\> ghe had this change to the reversed-s form but the ghe with stroke did  \nTP\\> not.\n\n"
    },
    {
      "time": "17 Oct 2008 — 1:16am",
      "content": "Hi Thomas\n\nThank you very much, though I am not sure exactly what to conclude regarding ghe stroke, since this Viktor's answer is concerned with u0491 and not u0493.\n\nAs I see it, there are two options: a) no final conclusion has been reached as how to draw this letter (either oblique or \"reversed s\") and therefore it is optional, or is it b) that the ghe stroke should follow the shape of ghe. In my case, a sans serif, I have a \"reversed s\" ghe and an oblique ghe upstroke. So I guess that, if option a is valid, I could go for the oblique ghe stroke without making Uzbek eyes sore...\n\n"
    },
    {
      "time": "17 Oct 2008 — 1:37am",
      "content": "[http://www.myfonts.com/unicode/0493/](http://web.archive.org/web/20131017061604/http:/www.myfonts.com/unicode/0493/ \"http://www.myfonts.com/unicode/0493/\")\n\n"
    },
    {
      "time": "17 Oct 2008 — 4:04am",
      "content": "Thanks Paul.\n\n"
    },
    {
      "time": "17 Oct 2008 — 5:23am",
      "content": "you're welcome, this is the form i've typically used and been asked to use by clients. you might double check some [ParaType](http://web.archive.org/web/20131017061604/http:/typophile.com/wiki/ParaType) fonts just for reference.\n\n"
    }
  ]
}
