{
  "id": "50591",
  "title": "minimalstile",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi,  \nI'm new here. And this is my first try at creating a text type. I really appreciate some help.\n\nThis is what i got now, a single weight version with almost all characters I need.\n\nThe concept:  \nminimálstíle CE is a typeface designed to replace Helvetica in certain situations.  \nI like Helvetica and Eurostile a lot, so these and my handwriting were the foundations for my design process. I always tried to optimize my handwriting, less lines if possible, no 180° turn backs, just easy curves. The result was the single line b, d, n, p, q, and r. I love the squareness of Eurostile and it even makes it easier to chop off the \"unnecessary\" parts. I observed Helvetica, because its still the best designed typeface. The horizontal cutting is one of my favorite features, so I decided to design my font the same way.\n\n ![](http://web.archive.org/web/20150414170932im_/http:/typophile.com/files/minimalstileCE3_3774.jpg)\n\n",
  "author": "Áron Jancsó",
  "time": "16 Oct 2008 — 6:23pm",
  "uid": "38349",
  "comments": [
    {
      "time": "16 Oct 2008 — 7:09pm",
      "content": "Well, minimalistic it is. But distinguishing uppercase I from 1 or lowercase l seems problematic to me. And the descender of lowercase g seems slightly unbalanced. Same goes for lowercase s, I guess. But I'm not an expert, so maybe it's just me. Possibly you should wait for real professionals to provide more constructive critique.\n\n"
    },
    {
      "time": "17 Oct 2008 — 3:05am",
      "content": "It looks well-conceived. Some of the curves appear to need some attention for weight; for instance, n, f, and 6 have heavy lumps in the upper left, and a is rather light on the very bottom. It's hard to judge easily just by looking at the raster image, of course.\n\n"
    },
    {
      "time": "17 Oct 2008 — 7:22am",
      "content": "thanks for the comments and pointing out some stuff! it's really helpful. i'm working on it.\n\n"
    },
    {
      "time": "24 Oct 2008 — 6:58am",
      "content": "a little update with new lowercase a and g.\n\n ![](http://web.archive.org/web/20150414170932im_/http:/typophile.com/files/minimalstileCE4_3443.jpg)\n\n"
    },
    {
      "time": "28 Oct 2008 — 6:09pm",
      "content": "I'm very new to world of type, but I too love Helvetica, Eurostile, and minimalism in general. I feel that you have a great concept and I'd be tempted to try this font out in place of Helvetica. Like I said before I'm new to type design, but I find your work here to be very strong and would like to see it in the outside world. Keep it up.\n\n"
    },
    {
      "time": "28 Oct 2008 — 9:19pm",
      "content": "Personal opinion: the second version would make a wonderful display face itself, so IMHO you should develop these 'more-minimalistic' features to the full set of glyphs. It does not solve the insignificant problems in the original, but takes quite different - and way more interesting - direction. And do not take semi-amateur comments (like mine) that seriously; the last word on the design should be yours - and yours alone.\n\n"
    },
    {
      "time": "5 Nov 2008 — 5:28am",
      "content": "thank you for the comments!  \ni'll think about the display version.\n\nthe text version is in .ttf format now. its not public, but i can send it if someone would like to test it. has full CE character set plus some more, kerning is not finished and there are some other little things to polish.  \nbut anyway its working! so just drop me a line and i send the font!\n\nhere are some recent tests:  \n [http://www.flickr.com/photos/mil3n/2998573758/](http://web.archive.org/web/20150414170932/http:/www.flickr.com/photos/mil3n/2998573758/ \"http://www.flickr.com/photos/mil3n/2998573758/\")  \nand  \n [http://www.flickr.com/photos/mil3n/2986059130/](http://web.archive.org/web/20150414170932/http:/www.flickr.com/photos/mil3n/2986059130/ \"http://www.flickr.com/photos/mil3n/2986059130/\")\n\n"
    },
    {
      "time": "15 Nov 2009 — 6:44pm",
      "content": "How is this doing?\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2009 — 2:10pm",
      "content": "i have a somewhat kerned basic .ttf of this but never really finished it. maybe sometime... if i have time and interest i make a family out of this, cos i still like it. learned a lot during the last year so i gonna redesign some glyphs too.\n\n"
    },
    {
      "time": "24 Nov 2009 — 4:44am",
      "content": "IMVHO, this looks interesting and you should use the first example as a text font, the second one as a display.\n\n"
    },
    {
      "time": "30 Nov 2009 — 12:12pm",
      "content": "the very unusual lower case g needs I think to be perfectly symetrical  \ni.e. the lower bowl not slightly to the right\n\n"
    }
  ]
}
