{
  "id": "50618",
  "title": "Cursive-flavor sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Here's the present condition of my first font. I've been [blogging](http://web.archive.org/web/20150424043719/http:/typophile.com/blog/3254) about it on Typophile but I thought I'd do a post here in the critique forum and specifically invite feedback.\n\n(pdfs attached below)\n\nThanks in advance for your thoughts.\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_6433.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [loopysample.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample.pdf) | 13.6 KB |\n| [loopysample2.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample2.pdf) | 18.35 KB |\n| [loopysample3.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample3.pdf) | 33.64 KB |\n| [loopysample4.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample4.pdf) | 111.13 KB |\n| [loopysample5.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample5.pdf) | 57.98 KB |\n| [loopysample6.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample6.pdf) | 63.89 KB |\n| [loopysample7.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample7.pdf) | 60.38 KB |\n| [loopysample8.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample8.pdf) | 122.29 KB |\n| [loopysample9.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample9.pdf) | 119.3 KB |\n| [loopysample10.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample10.pdf) | 118.61 KB |\n| [italpdf.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/italpdf.pdf) | 19.55 KB |\n| [loopysample11.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample11.pdf) | 239.32 KB |\n| [loopysample12.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/loopysample12.pdf) | 270.42 KB |\n| [uprightedsample.pdf](http://web.archive.org/web/20150424043719/http:/typophile.com/files/uprightedsample.pdf) | 50.73 KB |\n\n",
  "author": "eliason",
  "time": "17 Oct 2008 — 12:26pm",
  "uid": "3254",
  "comments": [
    {
      "time": "22 Oct 2008 — 7:33am",
      "content": "Hopeful bump. Any reactions or suggestions on this first font?\n\n"
    },
    {
      "time": "22 Oct 2008 — 10:56am",
      "content": "This is very original.Everything flows very nicely.\n\n"
    },
    {
      "time": "23 Oct 2008 — 3:22am",
      "content": "what's your intended use?\n\n"
    },
    {
      "time": "23 Oct 2008 — 6:32am",
      "content": "_what’s your intended use?_\n\nI'm looking for something that will work in smallish sizes (say, 10pt up to subtitle size), and is comfortable enough for middling-length texts, such as sidebars or captions. Maybe places where one might otherwise use running italics? I think the \"handwritten\" voice of this might work well for pull-quotes. It looks to me like it also might work as an alternative to \"architect\" fonts (or Comic Sans!), where a somewhat casual, but not condescending, style is desired.\n\nThis started as formal experimentation so the potential uses are more \"emergent\" than intended from the get-go. If it would be beneficial for the design to define its uses more precisely and if there are good practices for doing that, I'd welcome that feedback too.\n\n"
    },
    {
      "time": "23 Oct 2008 — 7:27am",
      "content": "It looks good, but needs more unity. I like the bumps that come from the cursive styling, they give the letters a very friendly tone. I do think that this could make a great face for running copy in the same way Palatino Sans is.\n\nThe majuscules feel much more formal and machine-made than the minuscules; s, v, w and x have the same stiff feel. There are also letters that get a little too informal—a feels a little sloppy with its left lean. And k is distracting in the same way that the r is in Palatino Sans.\n\nI would also consider doing more with stroke terminals. The tapering round descenders on j and y are gorgeous. Coming up with a system for angled/tapered terminals throughout will really push this face up a notch.\n\nLast, throw together some ligatures or contextual alternates, at least the f-ligs, just for visual punch. I realize that your letters don’t crash, but this face is just begging for some cool ligatures.\n\n"
    },
    {
      "time": "23 Oct 2008 — 7:58am",
      "content": "well without much of a purpose given for this to satisfy, all i can really say is that the g and k bother me, as do the differing approaches towards triangular corners (A, M, Z). other than that it's fairly cohesive as a type system, if that's your only goal.\n\n"
    },
    {
      "time": "24 Oct 2008 — 8:40am",
      "content": "Thanks, James and Paul, for the helpful comments. I appreciate the time you spent looking at this. I've uploaded a new pdf that includes some of your suggestions heeded.\n\n_The majuscules feel much more formal and machine-made than the minuscules;_\n\nThe more formal caps are intended - I'm trying to pull off something like this (in terms of formal caps and more cursive minuscules):\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/600px-Arrighi_italic_4900.png)\n\nI may have to abandon that conceit if I can't get it to work, though.\n\n_s, v, w and x have the same stiff feel._\n\nAgreed; I've softened v, w, and x, and will take a look at s.\n\n_There are also letters that get a little too informal—a feels a little sloppy with its left lean._\n\nYes, I'm not terribly happy with that a. I'll try to clean it up. I'm trying to retain a bit of the \"loopiness\" in the stem on the right, but reconciling that with the top curve is proving difficult. A single-story a is much easier to meld with the style, but if I can get it to work I'd prefer a two-story.\n\n_And k is distracting in the same way that the r is in Palatino Sans._\n\nI wondered if I would get away with that!\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_3614.gif)\n\nknock is closest to working, no?\n\n_I would also consider doing more with stroke terminals. The tapering round descenders on j and y are gorgeous. Coming up with a system for angled/tapered terminals throughout will really push this face up a notch._\n\nExcellent - that will be my next big project for this.\n\n_Last, throw together some ligatures or contextual alternates, at least the f-ligs, just for visual punch. I realize that your letters don’t crash, but this face is just begging for some cool ligatures._\n\nAnother good idea. I've added fl, fi, and ti. The latter two connect at the crossbar. Will ponder more.\n\n_well without much of a purpose given for this to satisfy, all i can really say is that the g and k bother me,_\n\nk discussed above. I've reverted to the original, one-story g in the latest pdf. Not as fun but more fitting to the face, I suppose. Maybe I should pull the descender around a bit further.\n\nI'm not sure whether to have another go at the two-story g. Was its problem that it was poorly drawn, too busy, or just the wrong flavor for the font?\n\n_as do the differing approaches towards triangular corners (A, M, Z)._\n\nI've now chopped the points off of A, W, and V to match N, M, and Z. Question: does a pointy vertex in the middle of M and W look weird?\n\n"
    },
    {
      "time": "24 Oct 2008 — 5:14pm",
      "content": "<cite>…’m trying to pull off something like this…</cite>\n\nIt could work, but doing so could limit the use of the font to special projects by ballsy designers. Which allows me to segue to my next point. I think that you would be well-served to really nail down a pen theory behind this design. The majuscules have a the mechanical feel of letters constructed mechanically to idealized humanist proportions. Most of the minuscules have the feeling of the same proportions realized with modern felt-tip or ball-point pens. But then there are the occasions where a flexible nib pops out—y, h, and u. I’m not sure that all of these can be reconciled into a single design that doesn’t have the cacophonous feel of Makela’s Dead History. Of course, there’s a place for that kind of feel, but I don’t think that’s where you’re going.\n\nWhat you could do here is create the basis for a larger typographic system similar to ITC Stone. Looking at your second specimen I see how this could turn into a fabulous informal text face with a companion sans to use for titling.\n\n<cite>knock is closest to working, no?</cite>\n\nDefinitely.\n\n<cite>I’ve added fl, fi, and ti.</cite>\n\nThey’re fun and they add a nice touch of class.\n\nI do prefer your single-story g. I don’t know if a two-story g could fit into these proportions, but it’s still worth exploring.\n\n"
    },
    {
      "time": "25 Oct 2008 — 8:46am",
      "content": "This is really helpful criticism James.\n\nOn nailing down a pen theory: I have developed these letters as a monoline (which I guess corresponds to a felt-tip), and then I began thinning strokes where they merged to reduce black spots. I wasn't thinking of a pen-front, but rather of the kinds of adjustments you see in Futura for example. But now that you point it out, the \"cursivity\" of this letter construction is probably going to make a \"pen theory\" unavoidable. Maybe it's just a matter of starting the thinning closer in - perhaps I made what should be an \"invisible\" optical adjustment at too large a scale.\n\nConnecting with your previous comment, would a pen theory dictate the terminals? (Which I'd suppose would mean felt-tip = round?)\n\nFrom the start I've wanted this font to have a crispness - to read as something more sturdy than a scanned handwriting font.\n\nRe: caps, would you suggest I'd have to add the cursive bumps and loops to the majuscules if they are to fit in with the minuscules? I didn't find that very satisfactory in my sketching. (In fact, that exercise was a real lesson for me in just how different in character the Roman caps and Roman lowercase are.)\n\nHere's my newer, restructured 'a' (in \"aardvarks\"):\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/loopynewa_4759.gif)\n\n"
    },
    {
      "time": "26 Oct 2008 — 8:55am",
      "content": "before altering flat terminals:\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/without_4178.gif)\n\nafter:\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/withterms_4839.gif)\n\n"
    },
    {
      "time": "10 Nov 2008 — 6:53am",
      "content": "Latest pdf on first post shows the status as of today - lowercase are pretty close to where I want them; caps show a first pass at trying to add \"written\" qualities while retaining the formality. A work in progress.\n\n"
    },
    {
      "time": "8 Dec 2008 — 2:24pm",
      "content": " ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_4190.gif)\n\n"
    },
    {
      "time": "20 Dec 2008 — 7:46am",
      "content": ":)  \nA beautiful childish\n\n"
    },
    {
      "time": "26 Dec 2008 — 9:39am",
      "content": "New pdf on first post (loopysample4.pdf) shows status as of today. I've started some of the kerning now. Which glyphs need rethinking? Does the leg of the 'R' stink? Are the crossbars of AEFH too gimmicky? Any color balance problems jump out? Other suggestions?\n\nWithout much reason other than the challenge, I've made oldstyle, monowidth figures for this. (I'm still very dissatisfied with the '1'.) What would be the most useful kinds of figures in a font like this?\n\n"
    },
    {
      "time": "27 Dec 2008 — 9:12am",
      "content": "I love the font. It really reminds me of handwriting, only more polished. The only things that really jump out at me for now are the masculine and feminine ordinal indicators (ª and º). Also, the 'tt' ligature seems somewhat wide.\n\nAs for the R and AEFH, I think that the leg of the R sticks out a little too far, but I like the crossbars on the A E F and H. The oldstyle '1' also needs work--it looks like it's about to fall over to the left.\n\n_What would be the most useful kinds of figures in a font like this?_ Well, I would think that alternatives would be a nice addition. Because (to me) it feels like a handwritten font, a single-story 'a' would be nice, as would other common variants seen in peoples' handwritings (a crossed 'z', a serifed 'I', etc.)\n\n"
    },
    {
      "time": "2 Jan 2009 — 9:59am",
      "content": "Thanks a bunch for the compliment and ideas - very helpful.\n\nStill need to work on the R and 1.\n\nHere's some alterations including some alternates you suggested.\n\nHow do I code these into FontLab? I have added glyphs and named them \"a.alt\" etc., but how do I set it up with OpenType to give applications access to them?\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/alternates_6599.gif)\n\n"
    },
    {
      "time": "2 Jan 2009 — 11:50pm",
      "content": "Oops, I forgot the alternate t in that sample.\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_6675.gif)\n\n"
    },
    {
      "time": "4 Jan 2009 — 4:13pm",
      "content": "I think the top of the ﬂ is too thick and the join with the l could be flat instead of round. Good work.\n\n"
    },
    {
      "time": "4 Jan 2009 — 5:42pm",
      "content": "Yes, I realized after I posted that image that I had an extra f component overlapping on that ligature.  \nHere's what it actually looks like, but maybe it still needs work.\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_3535.gif)\n  \nWould a smoother top be better? \n"
    },
    {
      "time": "16 Jan 2009 — 3:27pm",
      "content": "Posted an updated pdf up top (loopysample5.pdf).\n\nI've been working on kerning and starting to develop small caps, but I'm still very eager to hear feedback on the letterforms before I get too much further.\n\n"
    },
    {
      "time": "16 Jan 2009 — 7:05pm",
      "content": "Craig,\n\nJust butting in – you know to take my comments with a _rock_ of salt!\n\nThis is much fun to look at, and quite likable (and interesting to see  \nhow the \"handwritten\" flavor is oozing into lots of tiny details).\n\nA few semi-random impressions:\n\nIn the caps, the \"T\" feels a bit wide.\n\nHave you tried a \"W\" with no crossing strokes and a lowered apex?\n\nI'd consider softening / taking back the—quite acute—angle in the join of the alternate \"g\". I like the idea; but it may be trying too hard to make a point.\n\nI know it's intentional (and probably also hard to do otherwise), but I'm somewhat put off by the contrast between the caps and the minuscules. The caps feel classical, almost \"stately\" in their proportions, whereas the lowercase is a lot more playful.\n\nOn a detail level, how about playing with the tail of the \"Q\" a bit?  \n(And possibly, the leg of the \"R\"?)  \nAlso, the bottom-right of the \"G\" feels stiff in context of the whole alphabet.\n\nOr it may help to think not from the stroke, but the overall proportion, to make the caps a tad less \"classical\" and more \"casual\". (While your minuscules have a strong hand-written feel, I don't know anyone who writes their caps with classical Roman proportions.)\n\nI'll be curious to see how this goes on.&nbsp;&nbsp;:-)\n\n"
    },
    {
      "time": "17 Jan 2009 — 1:22am",
      "content": "\\>How do I code these into FontLab? I have added glyphs and named them “a.alt” etc., but how do I set it up with OpenType to give applications access to them?\n\nYou'll need to use a Stylistic Set.  \nOpen the Opentype panel and click on the + at the bottom.  \nYou'll get a box with the words 'feature xxxx {'\n\nThe next line says 'sub by ;'  \nYou need to put in the substitutions you want in there. For example to substitute a with a.alt it should read 'sub a by a.alt;'  \nIf you want to add more substitutions, simply repeat the line below with the next letter you want substituted.\n\nThe last line needs to close the ss01 tag so again replace the xxxx with ss01.\n\nThen click on the compile button. (looks like pages)\n\nOn the preview panel, you can now try your Opentype out by going to the Opentype features tab and selecting ss01.\n\nWell, that's the way I've done it and it seems to work. Check the FL manual though, as I'm a beginner too :)\n\n"
    },
    {
      "time": "17 Jan 2009 — 11:06am",
      "content": "@altaira  \nThat's so helpful, thanks!  \nI've added a W with lowered vertex, made the original high one the W.alt and trashed the W with overlapping strokes, which was just silly in retrospect.  \nI softened the angle in the g.alt. I brought back that original g when I got excited about adding stylistic alternates, but I never updated it with how the rest of the font had evolved, so thanks for catching that. I think it still needs work.  \nI changed Q, R, and G as you suggested, and threw in K, too. Better?\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_5645.gif)\n  \nLastly and most importantly, thanks for the additional nudge to abandon the classical proportions conceit for the caps. I've been banging my head against the wall trying to \"casualize\" the caps through strokes and details, but it makes sense at least to try altering the proportions. I'll try that out and see what happens.\n\n@Bendy  \nThanks, that's helpful. Do I want the tag to be ss01 or salt? Is ss01 (etc.) used in cases where there's more than one alternate? (Part of my difficulty in figuring this out is that I don't have InDesign or the like to see how these work in layout applications.)\n\n"
    },
    {
      "time": "17 Jan 2009 — 11:09am",
      "content": " ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture1_5058.gif)\n Same preview smaller. \n"
    },
    {
      "time": "17 Jan 2009 — 12:41pm",
      "content": " ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/CLASSICAL_4294.GIF)\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/unclassical_4165.gif)\n\nI narrowed CDGNOQT and broadened BEFKLPS. Better?\n\n"
    },
    {
      "time": "17 Jan 2009 — 12:58pm",
      "content": "Forgot to show off the revised Q tail:\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Q_6602.gif)\n\n"
    },
    {
      "time": "18 Jan 2009 — 5:54am",
      "content": "I think that depends if you want all the alternates accessible at once (salt) or to create different stylistic sets to switch on and off different alternates in groups(ss01).\n\nYou should also put in the {} the name of the feature in real words, so for example:\n\n<cite>feature ss01 { # Stylistic Set 1</cite>  \nas the first line\n\nI've only learned from opening up other people's fonts and seeing how they've done it...probably a fairly good way to learn but means I'm not 100% sure; hopefully others can help.\n\n"
    },
    {
      "time": "18 Jan 2009 — 12:22pm",
      "content": "_\"Better?\"_  \nI like the changes you've made. But do you? :-)\n\nNot sure about the spur on the \"G\". I'd possibly try something like what I did  \nto the \"b\" in my font if you remember; just raise the join off the baseline.  \nBut that may just be me. :-)\n\nFWIW, if I was you (and if you're not doing this already), I'd print out a ton  \nof glyph samples of everything you have (outlines filled in, no nodes showing),  \nstick them up on a large empty wall (maybe shuffle them into different combinations from time to time), and just look at them whenever you happen  \nto pass by. For me, that seems to help for \"spontaneously\" spotting things  \nthat may not be quite cogent yet. & possibly, think some more about the concept  \nand how it can \"ooze down\" into the details (for one thing, if you're trying  \nto make the caps more casual, I'd also go with less exact/circular rounds in the  \n\"O\", \"G\" etc.).  \nAnd of course: add salt to everything I'm saying.\n\nI like the new \"Q\", but keep wondering if more can not be tried/done with that tail… Maybe have it grow out of the curve with sort of an overlap like you have in the bottom of the lowercase \"n\", \"a\" et al.? Though that might get too cute.\n\nPlay around :-)\n\n"
    },
    {
      "time": "20 Jan 2009 — 1:49pm",
      "content": "Thanks again, Nina.\n\nI've made some printouts and will look through them. Already I've seen an idea for the concept \"oozing down\" to the details - making suggestions of a loop in the middle of B and R (like the K already had). They are pictured below.\n\nI've also played with the Q some more. I like the idea of the tail coming out of a loop from the right side. Below is the result - I like it but I wonder if that big black part at the bottom will be too spotty in text. I experimented with disconnecting the left side at the bottom (like a cursive form of Q, \"2-like\") but couldn't get a solid looking letter out of it.\n\nI also experimented with a much loopier G but that got cartoonish rather quickly.\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_4823.gif)\n\n"
    },
    {
      "time": "21 Jan 2009 — 12:46pm",
      "content": "Quick QUIZ: any preferences on these different Q's?\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_4298.gif)\n\n"
    },
    {
      "time": "21 Jan 2009 — 1:20pm",
      "content": "#3 or #4 are more appealing to my eye. And I think #3 is stronger in that the \"Q\" circle is completed.\n\n"
    },
    {
      "time": "21 Jan 2009 — 3:08pm",
      "content": "Oh, nice \"Q\"s. #4 reminds me an awful lot of Bree, but maybe that's just me.  \nI like Bree, I'm just not sure this matches your font; #3 or especially #2 might jive with your typeface better, though I don't know if that #2 wouldn't clog in text. Maybe with a bit less overlap it might work better? (Kind of like in \"B\", \"R\", \"n\", where you didn't completely double the weight at the overlap?)\n\n\\*adding salt as usual\\* :-)\n\n"
    },
    {
      "time": "21 Jan 2009 — 3:50pm",
      "content": "Hmm, if I let the other end of the tail drop that might work. How's this (at the bottom)?\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_3468.gif)\n\nI'm pretty sure that's better than the one above it; is it better than #3 from above?\n\n"
    },
    {
      "time": "22 Jan 2009 — 6:52am",
      "content": "I like #2 in this last one - but I'm not sure if it bests #3 of the previous - because at smaller sizes the \"bump\" of the tail (at the top where it connects to the bowel of the q) may look like an imperfection in the font, thus why I think the loop would help mitigate this. But...like I said, #2 in this last one looks pretty good too.\n\n"
    },
    {
      "time": "22 Jan 2009 — 6:55am",
      "content": "(Can't help commenting on this, even if I'm not trying to climb too high on that \"top posters\" chart … :-| )\n\nI think this is really nice with the dropping tail! Would need to see it in context  \nto fully judge how it fits in, but it seems to be much in keeping with the character  \nof your font. (Though I'd be curious to see how the \"bumps\" behave at text sizes, too.)\n\n"
    },
    {
      "time": "22 Jan 2009 — 7:37am",
      "content": "Ongoing thanks for the help on this, Ben and Nina. Here's the Q finalists with a little more context:\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_5693.gif)\n\n"
    },
    {
      "time": "22 Jan 2009 — 8:00am",
      "content": "Hmm. It looks like both would work well. The loopless Q doesn't appear \"flawed\" like I feared. I kind of like the casual quirkiness that the looped Q provides but either approach works well. Perhaps include a stylistic alternate? Nice work - it kind of reminds me of Tekton (don't worry - it's quite different! - I mean the casual feeling is similar).\n\n"
    },
    {
      "time": "24 Jan 2009 — 1:31pm",
      "content": "Posted an updated pdf up top showing status as of today. Since the last one I've added lots of OpenType features. There are now four sets of figures (combos of lining/oldstyle and tabular/proportional). I'm thinking about having the f ligatures standard and the t ligatures (tt, ti) discretionary.\n\nLoopless Q above will be standard, with looped Q as an alternate. Added a nondescending J as an alternate, some lining versions of currency marks, and generally tweaked a huge number of glyphs.\n\n"
    },
    {
      "time": "28 Jan 2009 — 8:19pm",
      "content": "Quickly, before I go to bed, there are two things I noticed when I looked briefly at the new PDF:  \n1. Your 'æ' still has the tail of the 'a' included in the glyph. Now, this is fairly unorthodox, and it begs the question: was it intentional? I'm not exactly sure how this character is normally written by hand, but I was under the impression that it is composed of one stroke.  \n2. The slashes on 'Ø' and 'ø' are at different angles, which drew my eye.\n\nBesides that, I love how this font is turning out. Good job!\n\n"
    },
    {
      "time": "29 Jan 2009 — 6:13am",
      "content": "Both unintentional mistakes, born of my ignorance. I'll make both corrections. Thanks for catching those, and thanks for the compliment!\n\n"
    },
    {
      "time": "29 Jan 2009 — 10:11am",
      "content": " ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/oslashae_5191.gif)\n\nThat ae is a pretty fun glyph to design when you pay some attention to it!\n\n"
    },
    {
      "time": "29 Jan 2009 — 10:19am",
      "content": "But is the \"a\"'s bowel of the \"ae\" too different from the standard \"a\"? Not saying it is but it is something to consider.\n\n"
    },
    {
      "time": "29 Jan 2009 — 11:16am",
      "content": "Yes, maybe I got carried away with the loops. Is this better?\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/redoae_6230.gif)\n\n"
    },
    {
      "time": "29 Jan 2009 — 12:21pm",
      "content": "I prefer the first æ to the second. It seems more natural, even with the divergence from a.\n\n"
    },
    {
      "time": "29 Jan 2009 — 1:59pm",
      "content": "Hmm... here's some more evidence for consideration.\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_3437.gif)\n\n"
    },
    {
      "time": "29 Jan 2009 — 2:54pm",
      "content": "What's FN? :-)\n\nThis is funky. Seen in context like this, the second (\"a-like\") version looks better to me, more balanced; in the first (upper) version the \"a\" part of the \"ae\" looks kind of… flattened. On the other hand, seen close up the \"a-like\" version looks pretty weird, as the crossbars of the \"a\" and the \"e\" don't connect… hm.  \nHave you checked the \"ae\" glyph in other fonts where the top curve of the bowl of the \"a\" joins the stem in a downwards curve? I can't think of one off the top of my head&nbsp;&nbsp;:-|\n\nBoth of the \"ae\"s look a bit cloggy in the middle. But I guess that's the kind of stuff that's hard/impossible to judge from a screengrab.\n\n"
    },
    {
      "time": "29 Jan 2009 — 3:00pm",
      "content": "The difference is much less at smaller sizes, but I wonder if the second variant is a tad too dark.\n\n"
    },
    {
      "time": "29 Jan 2009 — 3:16pm",
      "content": "_Have you checked the “ae” glyph in other fonts where the top curve of the bowl of the “a” joins the stem in a downwards curve?_\n\nProxima Nova:\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/proximanova_4694.gif)\n\nWilke:\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/wilke2_4711.gif)\n\n"
    },
    {
      "time": "29 Jan 2009 — 4:31pm",
      "content": "But neither of those is \"cursive-flavor\"ed.\n\n"
    },
    {
      "time": "29 Jan 2009 — 6:24pm",
      "content": "That's true. Here's the versions from the fonts others have identified as the closest in style to this one: Auto 3 Italic, Flora, and Tekton.\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/auto3_3928.gif)\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/flora_5208.gif)\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/tekton_4612.gif)\n\nWhat if I raise the e's crossbar so it's no longer a near miss?\n\n ![](http://web.archive.org/web/20150424043719im_/http:/typophile.com/files/Picture_4785.gif)\n\nOr should I just work on making the curves of the continuous-crossbar version more pleasing?\n\n@altaira: FN I think is the UN in Danish. I thought that text would be familiar to you!\n\n"
    }
  ]
}
