{
  "id": "50617",
  "title": "An interesting aside from Updike - your interpretation?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Today I was re-reading Updike on the subject of Van Dyck and Elsevier fonts he says:\n\n_“In these old fonts, too, there were more unusual and tied letters than are now common.”_\n\nThis is on page 21 of Printing Types Vol 2, in a reprint from 1962, the 3rd edition.\n\nWhat do you suppose he means by this? What I think of are a) contextual shapes, and b) Type with two glyphs on it like a linotype logotype. But It may be that there are other possibilities.\n\nBecause I have started to see what looks like contextual shapes in a Plantin face I am especially wondering if this is what he means and if there might be some metal evidence at the Museum Plantin-Moretus.\n\nHere is a small sample of the Plantin most kindly photographed and sent to me by Wolfgang Mayer (wmayer at typophile.com)\n\n ![](http://web.archive.org/web/20081025043247im_/http:/typophile.com/files/Plantintwoa_4767.png)\n\nhere is some of the cover page:\n\n ![](http://web.archive.org/web/20081025043247im_/http:/typophile.com/files/coverpage_4055.jpg)\n\n [‹ Priva pro | help | question about the cyrillic/russian alphabet](http://web.archive.org/web/20081025043247/http:/typophile.com/node/50637 \"Go to previous forum topic\") [Priva pro | question about the cyrillic/russian alphabet ›](http://web.archive.org/web/20081025043247/http:/typophile.com/node/50636 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025043247/http://typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 17.Oct.2008 1.39pm",
      "content": "Wouldn’t that be like connected st, ct, etc.?\n\n"
    },
    {
      "time": " 17.Oct.2008 2.02pm",
      "content": "Eben\n\nas far as I can see, Updike relates with those words to the italics (Kanon cursijf and Paragon cursijf) mentioned some lines before – see page 20. If you look at Ill. 201 (between page 14 and 15), you will find a lot of unusual ligatures besides the usual ones (st sp ct ss st etc and so on) and the swashes in the type.\n\nThere is a “us” in line 1: Largus, a “as” in proprias, a “ta” in line 2: monimenta, a “at” in line 3: Illustrat, a “is” in line 9: Sudantis, and I’m sure there are a lot more of those ligatures. Although the example is taken from a 1616 imprint, the type was in use at least from 1575 onwards. There are also a lot of swashy alternate capitals in this type.\n\nSo I think Updike speaks mostly of those elements.\n\nwolfgang\n\n ![](http://web.archive.org/web/20081025043247im_/http:/typophile.com/files/rc-updike-201_3859.jpg)\n\nPart of Updike, Ill. 201\n\n"
    },
    {
      "time": " 17.Oct.2008 2.27pm",
      "content": "I think you are jumping too far in associating Updike’s ’unusual’ with specifically ’contextual shapes’, enamoured as you are of the latter. Linking obviously refers, as you note, to the various ligated letters: ff us et ta ll st etc. as illustrated in your second post. But note also the scribal abbreviation in ferroque in line eight, which doubtless Updike would have classified with ’unusual’, along with swash forms, and perhaps even the long s. Unusual means ’unusual to Updike’s time and taste’, of course, not unusual to the makers or users of the original type.\n\n"
    },
    {
      "time": " 17.Oct.2008 2.31pm",
      "content": "[http://www.columbia.edu/cu/lweb/data/indiv/rare/type-exhibit/2rvi/arrigh...](http://web.archive.org/web/20081025043247/http:/www.columbia.edu/cu/lweb/data/indiv/rare/type-exhibit/2rvi/arrighi.htm \"http://www.columbia.edu/cu/lweb/data/indiv/rare/type-exhibit/2rvi/arrighi.htm\")\n\nNote also the Greek letters, for spelling reform.  \nAll very experimental.\n\nThere was a lot of interest in italics during the 16th century, whole books were printed in them.  \nBut eventually it transpired that mixing roman and italic was a more useful complexity than trying to parse the effect of calligraphy.  \nBut as long as typefounders were wrapping their heads around such complexity, perhaps some of the contextuality rubbed off on their treatment of roman? Keep looking...\n\nThat title page is engraved.\n\n"
    },
    {
      "time": " 18.Oct.2008 4.06am",
      "content": "Re-reading I see that you must be correct Wolfgang! Probably the excitement of the funny shapes in the Van de Keere/Plantin Roman got the better of me. I must learn to write after I have had enough sleep.\n\nThe italics are really fun. I have not spent nearly enough time looking at italics. I have been seeing a lot of connected/ligatured italics this week in the MATD Reading collections.\n\n"
    }
  ]
}
