{
  "id": "50631",
  "title": "Could this be Adobe's Gauge?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The Adobe Media Player came bundled with the Adobe Reader 9 download recently. Having taken it for a spin, it appears to replicate what’s available at [http://tv.adobe.com](http://web.archive.org/web/20090525143719/http:/tv.adobe.com/ \"http://tv.adobe.com\"), only in an Adobe AIR wrapper so as to masquerade as a desktop application, apparently.\n\nI was struck by the typeface used in the Media Player, and at Adobe TV—it’s not Cronos, or even Thomas Phinney’s Hypatia Sans, the most-recent sans serif from Adobe. What could it be?\n\nI took a look at the lower-case “l,” and it appears to match up with the lower-case “l” in the “Fl” CS3/CS4 icon for Flash. I think that the font in question must be Robert Slimbach’s forthcoming tentatively-titled Gauge.\n\nI rather like it—and can’t wait to see what the entire family looks like.\n\nAnother usage of the purported Gauge appears on Adobe’s Experience Design Team’s blog, at [http://xd.adobe.com](http://web.archive.org/web/20090525143719/http:/xd.adobe.com/). That site, like Adobe TV, is constructed in Flex, and uses Flash to render on-screen. (Viewing the site with the Flash 10 player shows off the enhanced anti-aliasing as compared with Flash 9, BTW.) Some folks have quibbled with the site’s usability—creating it in Flex/Flash takes away some HTML/browser usefulness with regards to navigation and accessibility—but the visual effect is wonderful (especially being able to embed all the fonts, and not resorting to using the SiFR workaround with HTML for setting headlines, for instance).\n\nSo—do you think the typeface is Slimbach’s forthcoming Gauge?\n\n—Kent\n\n",
  "author": "<a href=\"/web/20090525143719/http://typophile.com/user/38429\" title=\"View user profile.\">Kent Steinbrenner</a>",
  "time": "<br>",
  "uid": "38429",
  "comments": [
    {
      "time": " 5.May.2009 8.47pm",
      "content": "Here’s the answer: [http://blogs.adobe.com/typblography/2009/05/a\\_new\\_face\\_for\\_1.html](http://web.archive.org/web/20090525143719/http:/blogs.adobe.com/typblography/2009/05/a_new_face_for_1.html \"http://blogs.adobe.com/typblography/2009/05/a\\_new\\_face\\_for\\_1.html\")\n\n"
    },
    {
      "time": " 6.May.2009 8.46am",
      "content": "Aw, man. Why did they have to swipe the “a” from Dax? Isn’t that look played out?\n\n"
    },
    {
      "time": " 6.May.2009 9.04am",
      "content": "Looks like a rather uncomfortable mix of Dax, Bliss and Myriad. The bold seems to be more convincing. I think I could grow to like it though.\n\n"
    },
    {
      "time": " 6.May.2009 10.23am",
      "content": "I love it - reminds me of Trebuchet!\n\nGreat work! Let’s hope Apple doesn’t adopt it for their brand, at least for a few months.\n\n"
    },
    {
      "time": " 6.May.2009 11.46am",
      "content": "_Isn’t that look played out?_\n\nNo, Robert hadn’t played that trick yet.\n\n_I think I could grow to like it though._\n\nIt takes a while to get used to it. Some people have a hard time liking the lowercase ’g’ and upper&lowercase ’K’ and ’k’.\n\n_reminds me of Trebuchet!_\n\nReally? I think Calibri or Corbel are closer than Trebuchet.\n\n_Let’s hope Apple doesn’t adopt it for their brand_\n\nThey can’t. Unless they acquire Adobe.\n\n"
    },
    {
      "time": " 6.May.2009 11.49am",
      "content": "Achtung! Why did you speak out loud such things!\n\n"
    },
    {
      "time": " 6.May.2009 12.23pm",
      "content": "\\>They can’t. Unless they acquire Adobe.\n\nSorry, I missed the bit about it being an Adobe exclusive.\n\n"
    },
    {
      "time": " 6.May.2009 12.35pm",
      "content": "Yes, the g and k stood out to me, as did the 5 and 8 and italic a. To me the sans-spur look is a bit dated too.\n\nWhat would be really fascinating would be to know more about the design brief and Slimbach’s thinking behind the ’uncharacteristic’ elements.\n\nIt’s already growing on me.\n\n"
    },
    {
      "time": " 6.May.2009 5.05pm",
      "content": "\\>Sorry, I missed the bit about it being an Adobe exclusive.\n\nBut inevitably, you didn’t miss an opportunity to slam apple. Not sure what’s more distasteful about that: predictability or inappropriateness.\n\nSimon, can you please discontinue this incessant crabbing about Apple? It starts to seem like some kind of game card you’re trying to fill.\n\n"
    },
    {
      "time": " 6.May.2009 5.19pm",
      "content": "Carl you’re joking right? That wasn’t a swipe at Apple.\n\n“Myriad, in particular, is used to represent many other companies, including businesses close to Adobe’s (such as Apple and Verizon). Adobe wanted a fresh look that could remain unique.”\n\nI’m sure I’m not the only one that thinks it’s interesting that one of the reasons Adobe has a new branding font is that their old one is associated with Apple more than Adobe? If anything this is a reason for Apple to stick with Myriad.\n\n"
    },
    {
      "time": " 6.May.2009 5.22pm",
      "content": "Oh, how refreshing then.\n\n"
    },
    {
      "time": " 6.May.2009 5.27pm",
      "content": "\\>Oh, how refreshing then.\n\nSeriously, I don’t think I’ve said anything negative about Apple since their PR around Safari and font downloads (wasn’t that a year ago?). Maybe your fanboyism is making you see “incessant crabbing” when it doesn’t exist?\n\n"
    },
    {
      "time": " 7.May.2009 7.38am",
      "content": "Typical Sii, slam and dance.\n\n:)\n\n"
    },
    {
      "time": " 7.May.2009 7.45am",
      "content": "true\n\n ![](http://web.archive.org/web/20090525143719im_/http:/typophile.com/files/siiko_5439.jpg)\n\n"
    },
    {
      "time": " 7.May.2009 10.42am",
      "content": "I think Sii’s Apple comments are funnier than all get out, personally. Considering how much M$ gets slammed around, I think it’s fresh and funky that someone has something to jab Apple with.\n\n"
    },
    {
      "time": " 7.May.2009 4.21pm",
      "content": "I think its cool that Adobe bothered to tell us about it. Not having looked in enough detail yet to have a earnest opinion - my initial reaction is that it is the g that will have to grow on me.\n\nLeaving the daxish a out of it, it feels just a little like a certain Underground font Paul Hunt made.\n\n[http://www.p22.com/products/underground.html](http://web.archive.org/web/20090525143719/http:/www.p22.com/products/underground.html \"http://www.p22.com/products/underground.html\")\n\nThe lc l and the (relative) lack of stroke modulation are what make me think out that.\n\n"
    },
    {
      "time": " 7.May.2009 6.19pm",
      "content": "Eben if you spend a little more time with it you’ll see that it isn’t like Underground at all. Nothing against Underground, this is just a lot different.\n\n"
    },
    {
      "time": " 8.May.2009 6.04am",
      "content": "Sorry if I gave the impression that I thought they were quite similar. They are not at all. The shapes are quite different. The impact of the two are as well. The reason I said what I did is that woven into the fabric of Clean there is just a certain melody or sensibility I felt like it they shared with Underground as a result of some forms and the low contrast. For example: the g in Clean does not share a shape with Underground at all. The are different at the script or stroke level! On the other hand there seems to be an an urge to a tempered geometric reductionism which is also present in Johnston’s Underground.\n\n"
    },
    {
      "time": " 11.May.2009 5.49am",
      "content": "\\>I think it’s fresh and funky that someone has something to jab Apple with.  \nI think MS’s ads; the ones with the shopper/actors who have a free pass from the advertiser to buy anything, but have _no idea_ what they are going to do with those cheaper computers (copywriter’s fault), then select the cheap one even though it’s going to be free — that is a funny enough Apple jab, don’t you think? ;)\n\nCheers!\n\n"
    },
    {
      "time": " 11.May.2009 8.02pm",
      "content": "This typeface is unacceptable. Really very bad.\n\n\\>\\>I love it - reminds me of Trebuchet!\n\nIts not that bad, but i think this type designer has trouble making a sans, yes.\n\n"
    },
    {
      "time": " 11.May.2009 10.23pm",
      "content": "wow! everyone’s a critic...\n\nthat or we could use the ’opinions are like arseholes’ line here.\n\n"
    },
    {
      "time": " 12.May.2009 6.03am",
      "content": "Oh, you don’t want to do that...\n\n"
    },
    {
      "time": " 12.May.2009 9.07am",
      "content": "\\>Oh, you don’t want to do that...\n\nUnleash the... [http://dlpfan.org/int/s7385.htm](http://web.archive.org/web/20090525143719/http:/dlpfan.org/int/s7385.htm \"http://dlpfan.org/int/s7385.htm\")\n\n"
    },
    {
      "time": " 12.May.2009 9.59am",
      "content": "<cite>wow! everyone’s a critic...</cite>\n\nAbsolutely. At least I do have opinions about books, music, films though I am unable to write, compose/play, shoot/direct/act/cut.\n\n"
    },
    {
      "time": " 12.May.2009 10.48am",
      "content": "_...’opinions are like arseholes’..._\n\nGlad to see you picked up a little local colour during your sojourn in blighty.\n\nMy old boss, Bill Whitehead, used to admonish me, “Nick, all around a pig’s ass is pork, but not the (w)hole of it.”  \nNever could figure out what he meant, but it sure sounded impressive!\n\n\\*\\*\n\nThis is indeed a _clean_ design—except for the “g” with its inherently messy double-bowl construction.  \nWouldn’t a single bowl “g” be more consistent with the general concept and execution of the face?\n\n"
    },
    {
      "time": " 12.May.2009 10.50am",
      "content": "Yes, it is Gauge or “Clean Pro”, as it came out extracted from the program’s SWF files.\n\nAnyone knows when it’s released?\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": " 12.May.2009 10.58am",
      "content": "The “opinions are like ...” view that Paul references is really damaging to fruitful discussion.\n\nMy old teacher Popper said that the way knowledge progresses is through an attitude “I may be wrong and you may be right. Lets look at the evidence and discuss it, and try to find out the truth.”\n\nI realize on matters of taste, as opposed to fact, it is more problematic, but still there’s no reason for people to take offense when they simply have different opinions.\n\nThat’s an opportunity to learn together.\n\nLet’s all hold hands and sing [Kumbaya](http://web.archive.org/web/20090525143719/http:/www.youtube.com/watch?v=p3MiD_U4CHQ) now folks :)\n\n"
    },
    {
      "time": " 12.May.2009 11.16am",
      "content": "william, my reply was directed at this line:\n\n_This typeface is unacceptable. Really very bad._\n\nthat’s not a discussion, that’s just making an arse of oneself. hence the offhand remark.\n\ni’d much rather listen to actual criticisms such as Nick’s: ’This is indeed a clean design—except for the “g”...’ that leads to more fruitful discussion.\n\n"
    },
    {
      "time": " 12.May.2009 11.23am",
      "content": "W.B. — <cite>and sing Kumbaya</cite>  \nK.L. — <cite>... though I am unable to ...</cite>\n\n... includes singing.&nbsp;&nbsp;:(\n\n"
    },
    {
      "time": " 12.May.2009 12.05pm",
      "content": "Paul, I agree, thoughtful opinions and rude put-downs are very two different things—and your example is right on.\n\n"
    },
    {
      "time": " 12.May.2009 12.07pm",
      "content": "@Martijn Gauge is exclusive and in-house only.\n\n"
    }
  ]
}
