{
  "id": "50637",
  "title": "Priva pro | help | question about the cyrillic/russian alphabet",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi there,\n\nHope someone could help me out here… deadlines are horribly tight and I’ve got a small problem here I think…\n\nI’m working on a project in two languages. Priva is one of the typefaces selected for the project, and noticed something a little weird with certain characters.\n\n1) One of the strange things here is that the charcter ‘B’ in priva looks a little weird. Compared to Charter in this image and other typefaces we have, it looks different. Is this some sort of alternate version of this character?\n\n2) This other is that in Priva the character ‘э’ gets inverted and looks like the western ‘E’. I am basically copying all the text from Word and it inverts this character whenver Priva is used. Why is this?\n\nAnybody here ever dealt with this situation?  \nAny recommendations? Sadly, budget’s tight… and looks like we can’t change the typeface as this is the typeface the client uses on their material.\n\n:( This is the first time I have to deal with a foreign language other than Spanish and English. Help! :o)\n\n ![](http://web.archive.org/web/20081023045804im_/http:/typophile.com/files/111_5409.jpg)\n\n ![](http://web.archive.org/web/20081023045804im_/http:/typophile.com/files/222_5207.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.png](http://web.archive.org/web/20081023045804/http:/typophile.com/files/Picture%201_172.png) | 32.74 KB |\n| [Picture 2.png](http://web.archive.org/web/20081023045804/http:/typophile.com/files/Picture%202_104.png) | 30.61 KB |\n\n [‹ List of characters in Opentype](http://web.archive.org/web/20081023045804/http:/typophile.com/node/47915 \"Go to previous forum topic\") [An interesting aside from Updike - your interpretation? ›](http://web.archive.org/web/20081023045804/http:/typophile.com/node/50617 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081023045804/http://typophile.com/user/35596\" title=\"View user profile.\">VectorM</a>",
  "time": "<br>",
  "uid": "35596",
  "comments": [
    {
      "time": " 18.Oct.2008 1.49am",
      "content": "I’m not sure why it does it, but as a speaker of Russian I can assure you that ’B’ and ’э’ characters on the 2nd slide will not be recognized by the Russian audience.\n\n"
    },
    {
      "time": " 18.Oct.2008 2.10am",
      "content": "Fedra Sans Pro has a simular feeling.  \n [http://www.typotheque.com/fonts/fedra\\_sans/](http://web.archive.org/web/20081023045804/http:/www.typotheque.com/fonts/fedra_sans/ \"http://www.typotheque.com/fonts/fedra\\_sans/\")\n\nIt looks like the glyphs are alternative versions of the characters.\n\nPieter\n\n"
    },
    {
      "time": " 18.Oct.2008 2.15am",
      "content": "Thanks so much for your comment.\n\nBut would those characters just ‘be not recognized’? or are they simply ‘wrong’?\n\nI’m sorta freaking out. Got tons of pages to lay out with this typeface and no cash to spent on a new typeface.\n\nAny recommendations from anybody on a new Sans?  \nWill try to propose (doubt they will go with this) a new alternative. I needed a sans sorta ‘modern’ (NOT pragmatica, or helvetica-ish) with like 3 weights and italics. It has to be somewhat affordable.\n\n"
    },
    {
      "time": " 18.Oct.2008 2.22am",
      "content": "Thanks Pieter but Fedra was initially a proposed typeface was not accepted due to the cost.  \nIt was perfect for this project. This is a very unrealistic and cheap client… plus there’s some ridiculous deadlines.\n\nI already went through Fedra Sans, paratype (nothing with the feel) and Enelka & Vida from Stormtype. :o(\n\nMaybe I’m missing some other type foundries… some obscure ones…\n\n"
    },
    {
      "time": " 18.Oct.2008 2.45am",
      "content": "That there is an alternate Greek theta that got dropped in the wrong slot. Luckily, you could replace it with a Latin B. The worse problem is that э and є are two different Cyrillic letters.\n\nI would guess that if you contact [the creator](http://web.archive.org/web/20081023045804/http:/www.dstype.com/profile.html) about these two mistakes, he would probably be glad to correct them and replace the font, because it’s something that can affect future buyers and he would want to know about it.\n\n"
    },
    {
      "time": " 18.Oct.2008 3.13am",
      "content": "The glyph sample you show doesn’t show all the letters of the Russian alphabet, and instead has several archaic letters (Ѣ, Ѵ, IA, Ѳ) and a couple of Ukrainian letters (Є, І).\n\nSome of those archaic letters have questionable designs in Priva pro. For example, Ѣ looks very strange considering it is supposed to be a capital letter. Also, I’m not sure how acceptable a Ѵ that looks like a V is.\n\nThere’s also something funny going on with the outline of the Х as well.\n\nI would strongly recommend that you run the typeface choice by typographically-trained Russian eyes. As wonderful as Dino dos Santos’s Latin typeface designs are, these Cyrillics don’t look really professional.\n\n"
    },
    {
      "time": " 18.Oct.2008 3.21am",
      "content": "Yeah, thats a good point too, there are quite a few Cyrillic characters missing from that sample. Regarding whether it’s wrong or not, I was born in Russia, and if i saw those characters used in text, I won’t know them. So I guess that makes them wrong.\n\n"
    },
    {
      "time": " 18.Oct.2008 3.40am",
      "content": "Thanks again everybody for your thoughts.\n\n\\*Hope more Russian fellows keep posting ;o)\n\nI will contact my bosses right away to see what could be done with the extremely tight budget and deadline and cheap client.\n\n-\\> Any suggestion or alternatives for a Sans with a modern feel? Will have to propose something new I guess. Cost is extremely important. Sadly, they’d rather have wrong characters than dropping more money on a decent typeface :o(  \nFedra is out. Enelka maybe. Vida nah. Most of paratype’s catalog bores me and is not that modern in this sense.\n\nThanks again people\n\n"
    },
    {
      "time": " 18.Oct.2008 4.07am",
      "content": "Some glyphs look like they’re misplaced and others look like they need a refinement.  \nJust send an email reporting those errors and I’ll be glad to send you an improved version of the typeface.\n\nbest,  \nDino dos Santos  \nDSTYPE\n\n"
    },
    {
      "time": " 18.Oct.2008 4.23am",
      "content": "Thanks Dino\n\nJust sent you an email.\n\nWill talk to my boss regarding this issue and will probably contact you early next week because the deadline is hard to beat this time around.\n\nThanks again!\n\n"
    }
  ]
}
