{
  "id": "50656",
  "title": "Pagli Roman",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Here is a new project that I'm working on at the moment. It's a display type which is a cross of Bodoni & Pistilli. This is my second type design and planning to release it free for personal use.\n\n| Attachment | Size |\n| --- | --- |\n| [PR.pdf](http://web.archive.org/web/20150417204806/http:/typophile.com/files/PR.pdf) | 891.88 KB |\n| [UPDATE.pdf](http://web.archive.org/web/20150417204806/http:/typophile.com/files/UPDATE.pdf) | 245.76 KB |\n\n",
  "author": "alienbreed",
  "time": "19 Oct 2008 — 12:42am",
  "uid": "37327",
  "comments": [
    {
      "time": "19 Oct 2008 — 10:06am",
      "content": "I love the rectangular counters, and that Q is especially nice. I look forward to seeing the ampersand. The D and the 8 stand out as not quite fitting with the elegance of everything else. They look a little bit too heavy to me.\n\n"
    },
    {
      "time": "19 Oct 2008 — 12:20pm",
      "content": "Nice idea. I actually think the perfect rectangle counters are distracting. 'a' top stroke is too long.\n\n"
    },
    {
      "time": "19 Oct 2008 — 1:48pm",
      "content": "I agree with the above comments about Q, D, 8, and a.\n\nTop serif of S and s extend too far down. All the big round letters get too black (CDGOQ). Glyphs with uneven thicknesses of thicks really stick out (e.g. D, 6). Is the arm of r too curled-up? Is the t's tail wide enough?\n\nDid you try unbracketed serifs with this? They might be a more natural fit for the rectangular counters (but maybe that would lose a distinctiveness you're after).\n\nI like j, Q's tail, X and x.\n\n"
    },
    {
      "time": "19 Oct 2008 — 9:20pm",
      "content": "Ok. Did some minor changes as advice here. Balanced the thickness of the numbers, added Pistilli's signature ampersand as an alternate just in case you want to use them and made some tweaks in \"r\" \"a\" \"D\" & \"Ss\". I'm quite happy with it right now and maybe I'll be releasing this soon enough.\n\n"
    },
    {
      "time": "20 Oct 2008 — 12:13am",
      "content": "Your 'Ss' appear to be upside down because they are not optically balanced.\n\n"
    }
  ]
}
