{
  "id": "50663",
  "title": "What are the most frequently chosen type faces for novels & related books?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is there good data on what the most frequently chosen type faces are for novels, histories, lit, humor poetry etc; ( books set on matte paper without color? )\n\nMy flatpmate, Julia here at Reading showed me this:  \n [http://www.museum-der-arbeit.de/Service/Schrift+Typografie/](http://web.archive.org/web/20130820075546/http:/www.museum-der-arbeit.de/Service/Schrift+Typografie/ \"http://www.museum-der-arbeit.de/Service/Schrift+Typografie/\")\n\n...but this is just for one publisher if I understand correctly.\n\nSo I was wondering what else the collective brain here may have run across before or simply knows.\n\nThanks!\n\n",
  "author": "ebensorkin",
  "time": "19 Oct 2008 — 9:01am",
  "uid": "2942",
  "comments": [
    {
      "time": "19 Oct 2008 — 10:29am",
      "content": "The <cite>AAUP Book, Jacket and Journal Show</cite> indexes several things, including typefaces used. For the books & jackets selected in the 2007 show, there were 95 faces used. For the selections in the 1992 show, there were 19 faces used.\n\nThe index doesn't sort between text and display fonts, or fonts used only on the jacket. As a rough guess, there were 25 different fonts used for text in 2007, 15 in 1994.\n\nIn 2007, for (maybe) text, Arnhem had 3, Bembo 4, Caslon 4, Electra 3, Fournier 3, Garamond 7, Minion 6, New Baskerville 5, and Scala 8. The rest were one or two instance. Fonts that had 2 uses add Schoolbook, and Trinite. See the comment below about jackets.\n\nIn 1997 for text, Bembo 6, Galliard 5, Joanna 3, and Sabon 11. Fonts that had two uses, Aldus, Baskerville, Bodoni, Garamond No. 3, and Palatino.\n\nAbout 50 books were selected in 1992 and 51 in 2007. However, the numbers of fonts selected does include the jackets only category, and obviously, text fonts also appear on jackets. As an observation, there is less tendency to use the font \"of the book\" on the jacket in 2007 than there was in 1992, and that skews the data.\n\nThe perception that the Association of American University Presses show includes only scholarly monographs would be wrong. Only about 25% fit that category.\n\nFWIW\n\n"
    },
    {
      "time": "19 Oct 2008 — 10:50am",
      "content": "_...but this is just for one publisher if I understand correctly._\n\nNo, the data was collected from books printed by Clausen & Bosse, one of the biggest book printers in Germany. Wikipedia tells me they are able to produce 700000 books per day :-0\n\nThey also added the typefaces used in books that were selected by the German \"Stiftung Buchkunst\" as the \"most beautiful books\" in every year since 1996.\n\n"
    },
    {
      "time": "19 Oct 2008 — 10:54am",
      "content": "[http://en.wikipedia.org/wiki/Books\\_published\\_per\\_country\\_per\\_year](http://web.archive.org/web/20130820075546/http:/en.wikipedia.org/wiki/Books_published_per_country_per_year \"http://en.wikipedia.org/wiki/Books\\_published\\_per\\_country\\_per\\_year\")\n\n\\*\\*\n\nTimes Roman, being the preferred face for pulp fiction.\n\n"
    },
    {
      "time": "19 Oct 2008 — 9:51pm",
      "content": "Lovely insights!\n\nJens, the biggest is still, just one though. And moreover in just one place.\n\nProbably you would have to hire some research done to get the answer I would like which would be a worldwide books in latin glyphs with units sold as the basis for % use rather than by counting titles.\n\nStill, this is a good start.\n\nInteresting link Nick!\n\n"
    },
    {
      "time": "19 Oct 2008 — 10:05pm",
      "content": "Yes.  \nOver a million books published every year.  \nIf one wanted to seriously answer the question, one would have to have a good argument as to why one's sample is representative of the whole.  \nAnd a definition of what is a \"related book\".  \nOtherwise this is just the usual sort of wishy-washy Typophile thread inviting people to indulge their recency illusions.\n\n"
    },
    {
      "time": "20 Oct 2008 — 6:13am",
      "content": "The AAUP show is one interesting cross-section, as would be the AIGA 50 (which Linotype used to tout in their marketing in the 1940s & 50s). But these are winning book designs from a large pool of submissions, and I don't think the type choices in the winners is necessarily representative of the majority. (I say this as one of the judges of last year's AAUP show).\n\nAnd Nick is right: anything we come up with here is likely to be highly anecdotal and not necessarily any accurate representation.\n\nThat said, several years ago, in preparation for a talk I gave to the Vermont Book Publishers Association, I did an informal survey by going to my local library and poring over the two stacks of new fiction and nonfiction titles and tallying the text typefaces. I thought that would constitute a good random sampling. (Not everything newly acquired at my library is necessarily newly published.)\n\nThe sample was 313 books. There were 56 different typefaces (and I think there were only one or two that I wasn't able to identify without later checking a resource). Half of these appeared in only 1 or 2 books. Here is the list of typefaces that appeared in 10 or more books:\n\n34 Sabon  \n28 Bembo  \n27 Times New Roman  \n18 Adobe Garamond  \n16 Baskerville [I didn't distinguish which source(s)]  \n15 Minion  \n15 Janson  \n12 Garamond (Jannon) [probably a combination of Mono & Lino No. 3; I don't think I was distinguishing between them]  \n10 Fournier  \n10 Centaur\n\nThis was probably 2002 or 2003.\n\nIf I were to do this exercise again now, I would expect Minion to rise slightly, AGaramond to drop slightly perhaps, Fournier might rise slightly, Janson would probably drop off this top, and Centaur might drop off also. Trends come and go. But I would not be surprised if the top three did not change.\n\nFWIW\n\n-- Kent.\n\n"
    },
    {
      "time": "20 Oct 2008 — 6:33am",
      "content": "_Jens, the biggest is still, just one though. And moreover in just one place._\n\nJust one, you're right, but it's a printer, not a publisher. They are printing and binding books for many publishers, so the results are not skewed by any individual publishers' taste in text typefaces. Still it's only a small part of what's out there.\n\n"
    },
    {
      "time": "20 Oct 2008 — 8:00am",
      "content": "That's quite convincing, Kent.  \nI wonder how the UK would compare.  \nI look forward to your report from the local library, Eben :-)\n\n"
    },
    {
      "time": "20 Oct 2008 — 9:01am",
      "content": "Kent, were any of these set metal, printed letterpress?\n\nIf they were set PostScript and printed offset, my experience would say there is not a terribly good relationship between the fonts designers select, and their eye. More like a good relationship between the fonts they select & what the design books before 1970 touted.\n\nSabon is an odd exception, it was a wonderful font with the Linotron 202 and earlier typesetting systems, but somehow failed as a PostScript font.\n\nJust one man's opinion.\n\n"
    },
    {
      "time": "20 Oct 2008 — 10:18am",
      "content": "Charles -- These would have all been trade publications from within a few years of that date, so no metal or letterpress.\n\nThis was simply a unscientific survey of frequency, not any claim nor evidence of quality or successfulness or anything else like that -- just a snapshot of what was being done.\n\nReading Eben's criteria again, I must note that while the majority of the books in the sample I cite were probably just text on uncoated stock, the nonfiction stacks may have included some illustrated titles and maybe some on coated stock.\n\n-- K.\n\n"
    },
    {
      "time": "20 Oct 2008 — 10:31am",
      "content": "<cite> &gt; with units sold as the basis for % use rather than by counting titles.</cite>\n\nI'm not sure why you want to use units sold as a basis instead of titles. Finding that information would indeed be tedious.\n\nYou could always take NY Times Best Sellers lists over a period of several months, hop down to your local bookseller and note all the text types, then do some kind of scoring based on list rankings (as a way of accounting for relative units sold, perhaps).\n\nBut I'm not sure anything meaningful whatsoever could be deduced from that sort of ranking.\n\n-- K.\n\n"
    },
    {
      "time": "20 Oct 2008 — 10:49am",
      "content": "Eben: For an historical perspective (or maybe just a long-term recency illusion), see if you can find a good archive of the old \"Monotype Recorder,\" the house publication of Monotype. They used to run an annual tally of faces used in Britain. I think this was, as the AAUP show Charles & Kent mentioned, based on a design competition. I'm speaking here of the 1950s and 1960s, so hot-metal. I'm not sure how long it was published.\n\nThe 1979 and 1983 AAUP catalogs (the earliest ones I have here at work) do not have typeface use indexed. By 1987 the type index was included. & in 1987 there's a face called \"Meleor.\"\n\nI'd be willing to photocopy the face indexes from the 17 AAUP catalogs I have (if you give me some time and a mail address).\n\nAlso historically you could look at the AIGA 50 Books of the Year catalogs (for some time this showing was separate from the regular AIGA design competition). I don't know if they had tallies, but in most years the faces are listed with the showing of each book.\n\npowers\n\n"
    },
    {
      "time": "20 Oct 2008 — 4:11pm",
      "content": "For what it's worth, when I was discussing the development of Adobe Jenson with Fred Brady, sometime around 1995, he said that one of the main reasons Adobe was doing the typeface was because of the large amounts of prize-winning books done in Centaur. (some book design prize or another, forget which one)\n\nI then asked him how many copies of Jenson Adobe expected to sell. 10,000? 20,000?\n\nHe said, 'We'd be very happy to sell a thousand.'\n\nIt was one of the most depressing days of my life!\n\n(Also for what it's worth, when I did a short piece, brilliantly illustrated by Jeff Level, on Monotype Centaur, after it first came out in PS, for the Ziff magazine PC Sources, it sold 200 copies for Monotype. I thought that was nothing, but Monotype was ecstatic -- they'd never sold so many copies of a retail PC font before. Alas, that's not a feat that can be repeated anymore!)\n\n(Straying a little further: around 1996, I or my editor at DTPJ, Linda Lee, had heard that Adobe was on the point of axing the entire type department. It's difficult to imagine today, when we have so many more designers and foundries, what a blow that would have been. So we cooked up the idea of giving an extravagant four pages over to the the new Jenson, on the theory that the type department needed all the good press it could get. I didn't like Jenson, and didn't entirely conceal that, but managed to say a great number of extremely nice things about Adobe type. Whether it made any difference to the fate of the type department, I can't say. There was a point somewhat later when I heard that Warnock confirmed his unqualified support of the type department. Some bean counter or another wanted to get rid of it. It certainly wasn't lucky with its managers in those days. Things are much better now.)\n\n"
    },
    {
      "time": "22 Oct 2008 — 5:53am",
      "content": "I really like the pampatype work.  \nIt's awesome! I am finding the opportunity to buy any font of Alejandro\n\nTake a look at [www.pampatype.com](http://web.archive.org/web/20130820075546/http:/www.pampatype.com/ \"www.pampatype.com\")\n\n"
    }
  ]
}
