{
  "id": "50667",
  "title": "Just one more novel question",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey,\n\nIn terms of older novels, small paperbacks like bantam house books or something along those lines, does anyone know what font they use? I know very little about all this, so it may well simply be Times New Roman and I just can’t tell.\n\nAlso, how does everyone feel about papyrus? I feel like it’s the most horrendous thing available, but I see it everywhere, even on professionally designed things like major motion pictures and packaging. Am I wrong, or are there a lot of bad designers out there?\n\nThanks.\n\n [‹ I'm looking for a Serif font with big, strong, prominent punctuation](http://web.archive.org/web/20081023163137/http:/typophile.com/node/50752 \"Go to previous forum topic\") [make words with lights from building ›](http://web.archive.org/web/20081023163137/http:/typophile.com/node/50683 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081023163137/http://typophile.com/user/38516\" title=\"View user profile.\">Duncapher</a>",
  "time": "<br>",
  "uid": "38516",
  "comments": [
    {
      "time": " 20.Oct.2008 11.19pm",
      "content": "You’re not wrong.\n\nAnd my type-ID-fu isn’t strong enough to identify text faces outside of the big guns, most of the time. But out of 4 older novels from the 40s to 70s lying nearby (2 Bantam, 1 Ballantine and 1 Lancer) 3 appear to be Baskerville and one (the Ballantine) is definitely Bembo.\n\n"
    },
    {
      "time": " 21.Oct.2008 7.45am",
      "content": "_Am I wrong, or are there a lot of bad designers out there?_\n\nThat’s not a very professional comment.\n\n"
    },
    {
      "time": " 21.Oct.2008 3.02pm",
      "content": "I apologize. I’m not a very professional designer. In fact, I’m not one at all. But that wasn’t a very helpful response, aside from reprimanding me.\n\nuppercaseH, thank you very much. I suppose I should take a picture of a specific book and ask in the font ID forum.\n\n"
    }
  ]
}
