{
  "id": "50670",
  "title": "Sans to slab: First sketches",
  "forum": "nina's blog",
  "tags": [

  ],
  "content": "As my project in the Zurich-based Type Design course, I originally had the idea of digitizing, and thereby slightly modernizing, this metal face that has been mostly forgotten by typesetting history.\n\n ![](http://web.archive.org/web/20150423013657im_/http:/typophile.com/files/erstes_alphabet_4163.png)\n\nI had fallen in love with it (with its lowercase a in particular); I like its funky proportions and its, sometimes quirky, mix between being clear & clean, being curvy, being 1910 style 'modern', and even being 'modern' still. So, I figured that making something new & usable that should, in a way, breathe a similar spirit as this old face would make for a great project.\n\nHowever, finding said spirit, extracting it and deciding about other features and details, proved very difficult when sitting in front of the original letterforms with tracing paper. My imagination was glued to the original shapes; my involvement dwindled, & so did my motivation.\n\nOn Saturday, I decided I would just give the idea a shot of not just copying the sans, but trying to design a _slab serif font_ that would still be based on this one, albeit more loosely. I like monoline slabs, I like extended fonts, and I have never seen a slab with these proportions that does not look awful, so it seemed like enough of a challenge :). I did a quick pencil sketch of what it might look like, scaled it down on the photocopying machine, & was pretty amazed: this could work out really nicely (especially once I actually started drawing and wouldn't just stick serifs on the existing letters). :)\n\n ![](http://web.archive.org/web/20150423013657im_/http:/typophile.com/files/slab_1_3781.jpg)\n\nSo, new plan: making a sans and a slab as a matching pair. No contrast in the slab either, similar proportions, not-too-huge serifs. To my big surprise, André Baldinger (who is one of our teachers in this class) then suggested even starting out with the slab, & _then_ moving on \"back\" to the sans. He said something in the vein that I need to emancipate myself from my model. I think that was the single best piece of advice I could possibly have gotten at this point.\n\nOn my way home, I thought about possible names for a typeface I could already vaguely picture in my mind. I got home around 8:30pm and continued drawing letters. Sitting there poring over the e and wondering if I could open it up more. So I did. I drew another e. An r, an n. I started inking in the letters to see them in black. I wondered about the g and if this would allow for a two-storey g.  \nWhen I checked the clock, it was 2am.\n\n ![](http://web.archive.org/web/20150423013657im_/http:/typophile.com/files/slab_3_5597.jpg)\n  \n\n ![](http://web.archive.org/web/20150423013657im_/http:/typophile.com/files/slab_4_6099.jpg)\n  \n\n ![](http://web.archive.org/web/20150423013657im_/http:/typophile.com/files/slab_2_4385.jpg)\n\nThese are obviously raw sketches (baseline is jumpy, sizes are off, so are weights, and I can't draw), but they capture pretty well the direction I want this to take. I admit I cheated with the proportions – the e looked horrible, I had to make it narrower, although I kind of liked the wider proportions. Will have to try and get that width back.\n\nI'm not sure about the two-storey g. This one is too bold, which makes it even more difficult to decide if it fits in; and it's also kind of, uh, badly drawn, and the ear is horrible. I guess I will decide about such things once I have more letters, and have really nailed the proportions.  \nI think this version of the s works better than one with 'outside serifs'; also, the resulting flat curves of the s correspond to the e, which I've opened up quite a bit.\n\nIn general what I like about the slab idea is that serifs can balance out some of the differences in detailedness (uh) in this typeface. What I mean is, I really like the original a, g, and ß, but these letters don't really fit in with the rest of the typeface because they're so detailed (especially the ß). Once I add serifs, I figure this contrast between busy and boring letters might be easier to balance out. (Which does not mean I may not still change the ß.)\n\nI think what I love most about the slab project is that it does emancipate me from the original alphabet above – without me throwing the latter out the window.\n\n",
  "author": "nina",
  "time": "19 Oct 2008 — 2:21pm",
  "uid": "13487",
  "comments": [
    {
      "time": "19 Oct 2008 — 2:46pm",
      "content": "Hi altaire  \ncould you give my the details of the course in zurich?  \nAs i will go back home next year and was looking join  \na type design course. Or is there anything in basel?\n\n"
    },
    {
      "time": "19 Oct 2008 — 2:57pm",
      "content": "Jörg,  \nUnfortunately, Basel is pretty much dead (or hibernating, hopefully), type design wise.  \nClosest from Basel is the type design course in Zurich ( [Website](http://web.archive.org/web/20150423013657/http:/vvk.zhdk.ch/castypo.html)), which is part-time (berufsbegleitend); it takes place on two days (Fri/Sat) every two weeks for two semesters (10 months or some such, from September to June or July). I only started about a month ago, so I can't say too much yet except that it's really good, although you'd likely learn even more if you can do a full time course (Reading or Den Haag).  \nLet me know if you have any more specific questions, I'll be happy to answer them :)\n\n"
    },
    {
      "time": "19 Oct 2008 — 3:52pm",
      "content": "\\> I decided I would just give the idea a shot of not just copying the sans,  \n\\> but trying to design a slab serif font that would still be based on this  \n\\> one, albeit more loosely.\n\nBeautiful.\n\nConcerning the \"g\" I would try these:  \n1) A Koch \"g\"\\*, which we don't see nearly enough.  \n2) Start the join just left of 6 o'clock (the very bottom of the bowl), keep the join short\\*\\*, and make the end of the tail overshoot the join on the left.\n\n\\* [http://www.myfonts.com/fonts/adobe/kabel/book/opentype-ps/386937/charact...](http://web.archive.org/web/20150423013657/http:/www.myfonts.com/fonts/adobe/kabel/book/opentype-ps/386937/character/0067/CP2/1/ \"http://www.myfonts.com/fonts/adobe/kabel/book/opentype-ps/386937/character/0067/CP2/1/\")\n\n\\*\\* And probably make it angular.\n\nThat said, the form in the original is charming and distinctive, so I might go with that monocameral form, especially if this is a display face (see below). Emancipation is one thing, shunning is another.\n\nAlso, if you maintain that huge x-height, you need to either shoot for a display face (tight spacing), or shoot for small sizes (8 and under) and give it more weight.\n\nhhp\n\n"
    },
    {
      "time": "19 Oct 2008 — 3:54pm",
      "content": "another idea is the g from Cheltenham:\n\n[http://www.myfonts.com/fonts/bitstream/cheltenham/cheltenham/opentype-tt...](http://web.archive.org/web/20150423013657/http:/www.myfonts.com/fonts/bitstream/cheltenham/cheltenham/opentype-tt/243952/character/0067/CP2/1/ \"http://www.myfonts.com/fonts/bitstream/cheltenham/cheltenham/opentype-tt/243952/character/0067/CP2/1/\")\n\ncheers\n\n"
    },
    {
      "time": "19 Oct 2008 — 4:03pm",
      "content": "Concerning the \"g\", huh. I must say that, and I feel quite unprofessional saying this, Kabel gives me the creeps. Seriously – that is one g I cannot stand looking at, so chances are pretty slight I'm going to use it. ;) To use a more serious objection, it is very constructed and I'm trying to get away from the geometric model a bit. (I know Koch has used the same principle for the \"g\" in other fonts that aren't as geometric, so there goes this line of argumentation, but I still can't stand it.)\n\nI'll try your second suggestion tomorrow (it's 1am here, so no more work today), that sounds interesting, although I can't quite picture it yet.\n\nRegarding the original \"g\", that's quite interesting. It was one of my favorite letters from the beginning. Apparently it is also so distinctive that people either love it or hate it. Most people I've shown the original sample have commented on the g very quickly and in very extreme ways, favorable or not. So I'm not sure this g should be the default g at least – also because it is distinctive in a way that recalls its historical roots (it feels very Jugendstil to me).  \nI will definitely try and see how it works, though.\n\n_Also, if you maintain that huge x-height, you need to either shoot for a display face (tight spacing), or shoot for small sizes (8 and under) and give it more weight._\n\nAah, unsolved question number one. I kind of like that extreme x-height, but you're right in that it does suggest being used for either very large, or very small sizes. And I have to admit that picturing actual uses for this font is totally beyond me at the moment. I guess I have to do some more thinking there. ;-\\>\n\n"
    },
    {
      "time": "19 Oct 2008 — 4:06pm",
      "content": "Thanks, Simon – the Cheltenham g is indeed quite interesting in this context! I'll try that out and see if I can manage to squish that descender into the almost non existant space (maybe I should enlarge the ascenders and descenders after all …).\n\n"
    },
    {
      "time": "19 Oct 2008 — 4:08pm",
      "content": "_Once I add serifs, I figure this contrast between busy and boring letters might be easier to balance out._\n\nThe potential flaw in this argument is that you're also making the busier letters even busier, since they're getting serifs, too. (And letters like o and e remain as \"boring\" as originally, so arguably you're \\*increasing\\* the range of busyness.)\n\nI agree with Hrant, the one-story g is one of the more likable letters in the original font; seems to me like you're struggling to find a solution to a problem you don't need to have.\n\nIt's also a good point to think of a target size for this. That would help decide whether and what size serifs, I imagine.\n\n"
    },
    {
      "time": "19 Oct 2008 — 4:16pm",
      "content": "\\> people either love it or hate it.\n\nAs Spiekermann has expressed many times (concerning the \"g\" in Meta) that's often exactly what you want! When people argue about something, that's superb free publicity. And love\\* from a minority is much better than tepidity from a majority. Dieu vomit les tiedes.\n\n\\* Which I personally believe cannot exist without hate.\n\n\\> picturing actual uses for this font is totally beyond me\n\nThe more experience you have, the more that's OK, because your instincts can tell you if something is viable if your logic is unwilling. In your case, even though your speedy progress seems impressive, I would suggest deciding which way to go before doing too much more work. Making an interpolated weight range and postponing the decision on the final weight(s) is often a great idea, but spacing does affect the ideal letter bodies greatly.\n\nhhp\n\n"
    },
    {
      "time": "19 Oct 2008 — 4:24pm",
      "content": "_\"And letters like o and e remain as “boring” as originally, so arguably you’re \\*increasing\\* the range of busyness.\"_  \nShoot, that's true. I forgot about the letters that don't get serifs, and thought of it as \"raising the overall level of busyness by the degree of serifs\", but obviously that's not true.  \nStill, when I scaled that first sketch down, I liked the busier overall impression and felt it makes the font more lively, so that certain \"busy details\" at least don't get all the attention by themselves ;).\n\n_\"As Spiekermann has said a number of times (concerning the “g” in Meta) that’s often exactly what you want! When people argue about something, that’s superb free publicity. And love\\* from a minority is much better than tepidity from a majority.\"_  \nThat's probably a good point :) – plus, it makes people remember your typeface. \"Oh, that's the one with the weird g?\"  \nI'll try that again, definitely. I'll just try to avoid that horrible Dracula-esque underbite it has in that first sketch up there, where I tried both \"g\"s.\n\n_\"Dieu vomit les tiedes.\"_  \nHow true.\n\n"
    },
    {
      "time": "19 Oct 2008 — 5:26pm",
      "content": "Great work! I really enjoy reading your posts about this project. I think that you made the right decision when you chose to design a slab instead of a revival. Before you go with the two-story **g** consider using the single-story design and playing more with the design of the serif. Some sort of odd angle on an already interesting design might lead to something special!\n\n"
    },
    {
      "time": "19 Oct 2008 — 7:31pm",
      "content": "cheers altaire  \nI will have a proper read after work...\n\n"
    },
    {
      "time": "19 Oct 2008 — 10:34pm",
      "content": "James,  \nWhen you say play with the design of the serif on the g, do you mean the ear or the terminal of the descender? (I don't even know if it's possible, or makes sense, to have a serif on the descender, but I like the analogy to having a serif on the top part [hook?] of the a.)  \nThanks for your comments!\n\n"
    },
    {
      "time": "22 Oct 2008 — 1:33pm",
      "content": "Other options for a two-story g that may be worth considering:\n\n1) make the upper bowl very small (and not wide) and rely on the lower, enlarged bowl to match the width of the other letters.\n\n2) an unfinished lower bowl, as can be seen in this [\"Kulby\"](http://web.archive.org/web/20150423013657/http:/www.forthehearts.net/Kulby) font.\n\nI have my doubts whether either of these would be workable stylistically with the existing alphabet, but you may want to play around with them.\n\n"
    },
    {
      "time": "22 Oct 2008 — 11:52pm",
      "content": "Cool, interesting suggestions! The \"unfinished\" one would be a \"Danish g\", right?  \nI'm looking forward to playing around with the different g shapes – a bicameral g is an incredibly exciting thing to be approaching for the first time :-). I do kind of suspect the monocameral one makes more sense in this font, but I'll need some more letters to judge that. (I'm currently in the office work part of my week, but will be delving into this again tomorrow & in the weekend.)\n\n"
    },
    {
      "time": "24 Oct 2008 — 11:25pm",
      "content": "It looks an awful lot like Zeppelin by Storm Type. Turning it into slab would be... interesting.\n\n"
    },
    {
      "time": "27 Oct 2008 — 1:37am",
      "content": "Uhh! Thanks for pointing out Zeppelin. Hadn't seen that before. :-/\n\nI've seen slabs with those kinds of proportions on old posters, hand-drawn stuff, but not in digital form … we'll see. I do like the slab idea; though at the moment I'm battling the technical problems of not being able to draw a smooth m. It's a wicked learning process ;-)\n\n"
    },
    {
      "time": "8 Dec 2008 — 11:13am",
      "content": "hallo, interesting project you´re working on. Sorry ich schreib mal auf deutsch das ist leichter.. also ne serif version daraus zu machen kann ich mir ganz gut vorstellen. Aber ehrlich gesagt, so schön es für sich ist, passt dein kleines g nicht so recht dazu, bei den geringen unterlängen sieht es arg gequetscht aus. Da solltest du meiner Meinung nach lieber drauf verzichten, ein solches g einzufühern. Die Serifen könnten auch noch winziger sein und vielleicht abgerundet? Ich finde die Modernität des Orginals könnte durch zu starke Serifen etwas verloren gehen. Aber ein schönes Projekt, ich bin auch ganz beeindruckt von deiner Gedult das alles per Hand zu zeichnen.. oder ist das beim Baldinger ein muß? Ich hab auch mal Bleisatz gemacht, das war ganz meditativ irgendwann.. für nen Entwurf ist das sicherlich auch besser, aber dann kommts doch auf die details an.  \nWeiter so! Ist ganz spannend!\n\n"
    },
    {
      "time": "11 Dec 2008 — 3:18pm",
      "content": "Danke für den Kommentar! Handzeichnen hab ich jetzt erstmal aufgegeben – ich bin da einfach zu langsam, zu obsessiv und zu ungenau. Von Baldinger kam das weniger mit dem Handzeichnen, er arbeitet meines Wissens eher digital, während Hunziker (die beiden unterrichten den Projektunterricht gemeinsam bzw. abwechselnd) sehr vom Handzeichnen her kommt. Gemeint ist das auf jeden Fall so, dass man intensiv mit Handzeichnungen anfängt, aber am Ende, denke ich, muss ja auch jeder seinen Workflow finden und ich komme da am Screen halt schon immer besser klar (obsessiv bin ich auch da, aber ich verzweifle nicht ganz so schnell ;-) ).\n\nSo just to follow this through in English, I put my sketches on a big pile and actually started building letters in FontLab today – which was hugely liberating! I'm just too brainy sometimes, and tend to agonize over details & decisions forever instead of just trying them out (for which the pen & paper definitely felt like more of a barrier than the screen, even FontLab, is now). I've been playing around, trying stuff, finding some shapes and details I actually (roughly) like, and please forget about that metal face because it's fading into the distance quite rapidly.\n\nThe funny thing is I just re-read this thread, as well as [the one about the Ss serifs](http://web.archive.org/web/20150423013657/http:/typophile.com/node/50660), and what many of you said to me almost two months ago makes perfect sense now. I guess I was just too much in agonizing and brainalyzing mode back then.  \nSo, I will be back with this … shortly. :)\n\n"
    },
    {
      "time": "5 Jan 2009 — 3:00am",
      "content": "Hrant said, two and a half months ago:  \n_Concerning the “g” I would try these:  \n1) A Koch “g”\\*, which we don’t see nearly enough._\n\nThe craziest thing just happened.  \nYou know how it is when you hate spinach as a kid, & then avoid spinach for years and years until at some point, you get into this awkward situation where you just can't refuse it – and then you realize it's actually really, really good! And then of course, you've missed half a lifetime of spinach.  \nI had that with the Kabel g last night. Totally crazy. That is one wild and wicked g! And here was I thinking all the time that it was 'ugly', just because it was different. Very, very strange.  \n(I hope that doesn't happen with the Rotis e, otherwise I'll get worried.)\n\nI started making g's at some point last night, and next thing I knew it was morning. (-: I now have seven different g's; I think two or three of those may be usable (though of course they're not uh, final yet). I actually really like the Kabel-based ones (although I still have to figure out how to make them look less like Kabel itself).  \nYeeh, I did Souvenir too. More for fun and to try out more variants&nbsp;… It's, uhm, enormous.\n\nOh, I lengthened the ascenders and descenders. Considerably.\n\nWill post the complete lc alphabet, hopefully, within the next few days (m, v, w, x, y, & z are still missing). Until then, here are a few g's.\n\n ![](http://web.archive.org/web/20150423013657im_/http:/typophile.com/files/gagging_3503.jpg)\n\n"
    },
    {
      "time": "5 Jan 2009 — 3:18am",
      "content": "Hi Nina, nice work! in my opinion it is the g in the fourth line on the left side that works well, and even better, the g in the second line on the right side. Good luck!\n\n"
    },
    {
      "time": "5 Jan 2009 — 3:46am",
      "content": "Thank you, Nora. :-)  \nI must admit I like the one on the bottom left too, but the problem is it doesn't work at small sizes. I'm pretty close to abandoning the concept of at least a 'classically shaped' bicameral g in this font, since I'm aiming to make this work for small text.\n\n"
    },
    {
      "time": "5 Jan 2009 — 11:25am",
      "content": "Nina, I had the same thing with eggplant (a staple  \nfood of my maternal grandparents' village, Urfa).\n\nKoch \"g\": I remember my first impression was not positive, but then I realized it's da bomb for lo-fi work. And recently I've been getting a strong vibe that it will become stylistically very du jour before the end of the decade. You heard it here first. :-)\n\nIn the ones you've made, the spike in top two of the right column are clashing; you might try a more stubby form there. I think the bottom one of the right column might turn out ideal, but the head does need to be smaller. And the second one on the left is still a very strong candidate.\n\nhhp\n\n"
    },
    {
      "time": "6 Jan 2009 — 1:45am",
      "content": "Hrant! Eggplant rocks. My main problem was this [sweet chestnut paste dessert](http://web.archive.org/web/20150423013657/http:/www.restaurantgalerie.ch/essen_trinken/vermicelle.JPG).\n\nThanks for the pointers. You're right of course about those spikes, I took them back.  \nYou really like the Souvenir-style one? I'm kinda torn there. But, I'll put some more work into it and see if I can make it work.\n\nAt the moment, I'd probably feel best with the second one on the left as the standard g. I'd also very much like to put in a Kabel-ish one. Although I'll be curious what everyone will say once I post the rest of the letters.\n\n"
    },
    {
      "time": "12 Jan 2009 — 3:20pm",
      "content": "I just uploaded the full lowercase alphabet, v1, [here](http://web.archive.org/web/20150423013657/http:/typophile.com/node/53395).\n\n"
    }
  ]
}
