{
  "id": "50679",
  "title": "Minimade",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "This is my first attempt at a serif pixelfont. I didn't have anything in mind when I was making it (just wanted to make it as neutral as possible), but I think it turned out to resemble Century Schoolbook somehow. I haven't done any kerning as of yet, but I'm quite happy with the result so far. Tell me what you think of it.  \nBTW: I'm still not working with grayscale pixelfonts, so it's still not as crisp as it could be ;-)\n\n| Attachment | Size |\n| --- | --- |\n| [MinimadeFamily.gif](http://web.archive.org/web/20150414144005/http:/typophile.com/files/MinimadeFamily.gif) | 15.61 KB |\n| [MinimadeMiniFamily.gif](http://web.archive.org/web/20150414144005/http:/typophile.com/files/MinimadeMiniFamily.gif) | 10.52 KB |\n| [Text.gif](http://web.archive.org/web/20150414144005/http:/typophile.com/files/Text.gif) | 9.36 KB |\n| [Comparison.gif](http://web.archive.org/web/20150414144005/http:/typophile.com/files/Comparison.gif) | 8.65 KB |\n\n",
  "author": "ill sans",
  "time": "20 Oct 2008 — 12:02am",
  "uid": "13099",
  "comments": [
    {
      "time": "20 Oct 2008 — 12:08am",
      "content": "Really nice work, Tom. Used FontStruct? Nathan Cox at Punchcut made a [pixel tribute to geometric slabs](http://web.archive.org/web/20150414144005/http:/fontstruct.fontshop.com/fontstructions/show/9974) that is similar to yours in some ways.\n\n"
    },
    {
      "time": "20 Oct 2008 — 1:45am",
      "content": "Thanks Stephen! Nathan's Uniball is fantastic!  \nI haven't tried out FontStruct yet, I used Fontographer.\n\n"
    },
    {
      "time": "20 Oct 2008 — 7:13am",
      "content": "Nice work indeed. I think it works very well.  \nUniball is also excellent.\n\n"
    },
    {
      "time": "22 Oct 2008 — 1:35pm",
      "content": "Still no kerning yet (I really dread the process ;-) ), but I've added 2 more members to the family. Maybe a 'fat cousin' will follow in the future.\n\n"
    },
    {
      "time": "27 Oct 2008 — 8:50am",
      "content": "The fat cousin's here & he brought his posh sister ;-)\n\n"
    },
    {
      "time": "27 Oct 2008 — 8:51am",
      "content": "The fat cousin's here & he brought his posh sister ;-)\n\n"
    },
    {
      "time": "27 Oct 2008 — 9:13am",
      "content": "This is quite nice, with a lot of cool touches.  \nAnd those swashes rule!\n\nA couple of quick things:  \n- The head serifs on the \"u\" should probably be leftward only.  \n- I would increase the ascenders by one pixel: it would help readability a good deal (and give you room to raise the bar of the \"f\", and make the dots on \"i\" and \"j\" two pixels tall).\n\nhhp\n\n"
    },
    {
      "time": "27 Oct 2008 — 10:36am",
      "content": "Hey Tom: I don’t know if it’s intentional but you seem to have the contrast in your y and Y flipped horizontally.\n\n"
    },
    {
      "time": "27 Oct 2008 — 11:05am",
      "content": "I don't know about the capital, but in the lc sticking to the conventional contrast scheme would result in an ungainly glyph. One has to be pragmatic and flexible, and worry about the results, not dogma. The bad \"y\" in Unibody's bold is in fact a direct result of a stubborn adherence to chirography.\n\nBTW, what's the 2014 about? Not the expected release date I hope!\n\nhhp\n\n"
    },
    {
      "time": "28 Oct 2008 — 3:56am",
      "content": "I didn't even notice the fact that the y's were flipped, but I did do several versions before settling down with this, so unconsciously the aesthetic part must have played a role in my decision.  \nAs for the lc u, that was probably due to not paying a lot of attention ;-) It seems a bit odd now, but I'm not really sure it actually bothers me… I'll have to make a comparison first & let it rest a while before I decide (when you work on something for too long, you can't see the forest for the trees anymore). I'm still working on more swash variations & after that I'll take a break from Minimade for a couple of days.  \nThe length of the ascenders however wás a deliberate choice. Along with the x-height & descenders, it was the only thing I had already determined when I started this. I didn't want it to end up looking too jagged, so I used the same measurements everywhere which I like to think it adds a little personality (or maybe amateurism? ;-p) to the font.  \nIf anything, I think the descenders could benifit from an extra pixel, but again, I wanted to keep it simple.\n\n"
    },
    {
      "time": "28 Oct 2008 — 7:24am",
      "content": "\\> unconsciously the aesthetic part must have played a role in my decision.\n\nYup.  \nLet's hope this moves into full consciousness on the part of certain people.\n\n\\> If anything, I think the descenders could benifit from an extra pixel\n\nAt this low res leaving them equal isn't so bad, but making the descenders _longer_ than the ascenders would be a pretty bad use of the vertical space. The simply reason is that in real text ascenders are much much more frequent.\n\nhhp\n\n"
    },
    {
      "time": "28 Oct 2008 — 8:12am",
      "content": "\\> Let’s hope this moves into full consciousness on the part of certain people\n\nAre you referring to anyone in particular?\n\n\\> The simply reason is that in real text ascenders are much much more frequent.\n\nYou see, that's why Typophile is very usefull for people like me who have no educational background in typography. When designing I don't even think about these things, but from now on it's something I'll keep in mind.\n\nSince I started fooling around in Fontographer a couple of years ago, I already see some progress in my work.  \nPixelfonts are actually great for learning about typedesign; they don't leave you with too much room for choice (or in other words, they eliminate a large part of doubt) which I find quite stimulating, it justifies a mathematical approach (which again simplifies things) & its simplicity & sheer size can camouflage (or compensate for) a lack of know-how.  \nThanks to the comments here, I'm also learning a lot about the relationships between characters & the actual use of a font.\n\n"
    },
    {
      "time": "28 Oct 2008 — 8:45am",
      "content": "\\> Are you referring to anyone in particular?\n\nWell, in this thread Underware in particular, but in general I'm talking about designers who believe that their favorite world order is more important than the results. It's a justification of creation over function, which is Art and not Design.\n\n\\> Pixelfonts are actually great for learning about typedesign\n\nI agree (although many designers do loathe them). Besides the paradoxically refreshing limiting of choice, there is a purity to bitmap font design; something that makes you think in a certain healthy way that vector-editing tends to obscure. Maybe it's because the illusion is fully broken, so you can see -or at least feel- the heart of the matter.\n\nhhp\n\n"
    },
    {
      "time": "28 Oct 2008 — 9:59am",
      "content": "I can imagine some typedesigners loathe pixelfonts, but in terms of designing is apples & oranges. It may be easier (especially to start with), but it takes a completely different state of mind.  \nI love vectors for their flexibility & 'weightlessness', but it's something very different. Pixels are not just about stripping down an image to its core, it's much more than that. The illusion is indeed broken, but you create an entirely new one with the right use of pixels (e.g. creating rounded shapes by pixelplacement). It has a lot to do with 'feeling' where all the pixels should (or should nót) go -much as bezierpoints in vectorial design- & it requires more thinking outside the box than vectors. Even though it may seem very technical, only by breaking the rules can you achieve a perfect bitmap.  \nFor someone who's used to working with vectors, it demands a lot of flexibility on the designer's part.  \nAt least, that's my experience…\n\n"
    },
    {
      "time": "28 Oct 2008 — 1:46pm",
      "content": "This is lovely. i especially love the swashes\n\n"
    },
    {
      "time": "6 Nov 2008 — 5:11am",
      "content": "I added the final additions to the Minimade family.  \nAs mentioned before, I made some more swashes & divided them into two fonts for practical reasons. I also added a bold, italic & swash version to the Minimade Mini family. I redid the italic version 'cause I wasn't completely satisfied with it. I'm quite happy with the end result now, but I might still make some minor changes in the future (such as the lc u perhaps).  \nThanks all for your lovely comments, they really kept me motivated throughout the process.\n\n"
    },
    {
      "time": "6 Nov 2008 — 9:03am",
      "content": "Nice.  \nCould you whip up some text, in both the sizes?\n\nJust looking at the 11 point Roman for now:  \n- Was the \"2\" always so cute? I like it.  \n- I would remove the inside pixel from the bottom-right of the \"N\".  \n- The \"y\" might benefit from a leftward serif at the bottom.  \n- Because your \"a\" is binocular I don't think you need that ungainly pixel at the bottom of the \"ae\".  \n- The eszet might look better with a smaller top bowl.  \n- I would connect the two parts of the pilcrow with a pixel at the top.\n\nBTW, I'm pretty sure there's a limit to how much you can overshoot the em space (re: swashes) before you hit rendering problems in some OS/app environments.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2008 — 11:00am",
      "content": "I added a few pangrams. Mind you, I haven't done my kerning yet which is definitely necessary for the italics.  \nThe 2 hasn't changed since the very beginning, I was quite pleased with it myself ;-)  \nYour comments make a lot of sense although I like the eszet as it is.  \nThe N would probably look 'cleaner' without that corner pixel & I hadn't thought of giving the y a bottom serif, but it might improve if I do.  \nThe æ is where I got caught up in my own rules (simply a + e pushed together) rather than 'flexible' aesthetics ;-)  \nI had to look up what a pilcrow is… Still learning.\n\n"
    },
    {
      "time": "6 Nov 2008 — 11:30am",
      "content": "Thanks for putting up some text. I think it's coming together very well, and the swashes are wonderful; used judiciously they could really mark some new ground.\n\nI think you're OK with the double serifs on the \"u\" after all, but I'm starting to feel more strongly about your ascenders being too short. I'd love to find out what others think, but personally I can almost hear the font wheezing from being put in a straight-jacket! Giving the ascenders one more pixel would really help. I promise. :-)\n\nSome other things:  \n- It just hit me that your Bold is three pixels heavy. Did you make one that was two pixels but didn't like it?  \n- Your smaller size is generic enough not to warrant making... except for the swashes! So pay extra attention to them at that size.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2008 — 11:51am",
      "content": "I admit I got a little sloppy at the end; I just used the same swashes for the mini-version as I did for the regular which obviously makes the balance shift.  \nThe 3-pixel bold was a deliberate choice since I wanted to make a bigger contrast than I could do with only 2 pixels. It looks more like a black version now & I might rename it later if I decide to include a 2-pixel bold as well. For the mini-version I did however reduced it to 2 pixels 'cause the dimensions of the characters would have to be to stretched too much to fit in the 3 pixel strokes.  \nFor the lc u I'll probably try to find another font that has doublesided serifs on the u to find comfort in. I actually like the way it looks & think it fits well with the other characters, but if it's just 'not done' I'll probably be too insecure to leave 'em the way they are. Any other thoughts and opinions on this would be appreciated.  \nI'll do a 3-pixel ascender version of the regular in the next few days (have to do some other stuff I shifted forward to finish this first) & post it here for comparison.\n\n"
    },
    {
      "time": "6 Nov 2008 — 12:04pm",
      "content": "\\> I’ll probably try to find another font that has doublesided serifs on the u\n\nGood luck... Not even the Romain du Roi (which has  \ndouble-sided ascender serifs) has doubles on the \"u\":  \n [http://tipografos.net/tipos/exemplo-grandjean.gif](http://web.archive.org/web/20150414144005/http:/tipografos.net/tipos/exemplo-grandjean.gif \"http://tipografos.net/tipos/exemplo-grandjean.gif\")\n\nBut that doesn't mean it can't work (especially  \non-screen, which can be a very different animal).\n\n\\> I’ll do a 3-pixel ascender version of the regular\n\nCool.\n\nhhp\n\n"
    },
    {
      "time": "13 Nov 2008 — 8:44am",
      "content": "I made the suggested changes to the regular family & put it up for comparison. I'm curious to hear your thoughts on this.\n\n"
    },
    {
      "time": "13 Nov 2008 — 10:55am",
      "content": "Well, **I** like it. :-)\n\nFor the dots on \"i\"/\"j\", I think I'd make them two pixels vertical. You might also try leaving them two-horizontal, but raising them up one pixel to the full height.\n\nThe \"t\" might be better short.\n\nA couple of other things:  \n- I'd give the UC \"J\" a bigger tail.  \n- Can you make the ampersand nicer?\n\nhhp\n\n"
    }
  ]
}
