{
  "id": "50674",
  "title": "Mike Hebrew - A Work in Progress",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": "The nights are already longer. My sailboat is out of the water. This morning the bird bath was frozen. Now is the time to start thinking about the next release of Mike Hebrew! Generally the next release will be ready at the time when Cabin Fever prevails in the surrounding forests....\n\nIn this topic, I like to share some of my design issues in the hope of receiving practical comments.\n\nIn this example of Mike Hebrew Web, I pasted bits of English text at random into a Hebrew newpaper article using the same font and size throughout.\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/mixed_latin_and_hebrew_1_4740.jpg)\n\nAn example of side-by-side usage of Mike Hebrew Web with a single point size.\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/mixed_latin_and_hebrew_2_5435.jpg)\n\nThe Design Process  \nI started with setting the size of my Hebrew characters so they would look good when displayed or printed without nikud or cantilation in Hebrew-only text. Next I tweaked a little to sqeeze them in, however the intent is modern Hebrew usage with little use of nikud.\n\nDefine “Hebrew Height” as the top of most Hebrew characters such as dalet and het. Lamad would be as high as possible. What heights should I use for the latin characters and numerals?\n\nA choose the cap-height to be higher than the Hebrew Height but much lower than the top of the lamed.  \nThe x-height was chosen to be much lower than the Hebrew Height. Numerals are a little less than cap-height.\n\nSo you see I started with my Hebrew design and choose the metrics of the Latin and numerals to match it. These characters were adapted from the free font Tuffy.\n\nI have my doubts as to the suitability of Tuffy and would like something than matches Mike Hebrew more closely. However the font should not draw attention to itself. It should also be free. Any ideas?\n\n",
  "author": "Michael Cunliff...",
  "time": "19 Oct 2008 — 7:16pm",
  "uid": "5786",
  "comments": [
    {
      "time": "22 Oct 2008 — 4:54pm",
      "content": "The font in my first post is “Mike Hebrew Web” which is a somewhat square font however “Mike Hebrew” is a bit more decorative with diagonal strokes. I find it quite difficult to choose a set of Latin letters to complement the Hebrew.\n\nThe example shown here is a modification of Tuffy.\n\n/font\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/mihu_meyelel_buruah_3966.jpg)\n\nAgain, I'm not looking for a Latin font that will mimic my Hebrew letters.  \nHow to deal with this problem?\n\nMike\n\n"
    },
    {
      "time": "22 Oct 2008 — 10:52pm",
      "content": "Mike,\n\nI like your two Hebrew fonts. The style is both script-like and informal, yet very readable and clear.\n\nEach though each typeface has different qualities. So to share a single name, and just to be distinquished by their recommended use, does not do design justice to them.\n\nI agree that the Latin faces, though well chosen in terms of weight and clarity, don't really match in ideal terms.\n\nBecause of the informal and stylistic qualities of the Hebrew, why not try to create a matching set of Latin faces, too?\n\nThe English is very \"straight\" and block-like. The Hebrew \"moves\" much more, adding movement to its informality. This is not at all reflected in most Latin faces. Hence, due to the inherent \"straight-ness\" of the Roman letter forms, I beieve that you need an unconventional Latin typeface design, which I don't think exists yet.\n\n"
    },
    {
      "time": "23 Oct 2008 — 5:27pm",
      "content": "Thanks for your comments. The idea of designing a Latin face from scratch is daunting!\n\nTo complete my presentation of the problem, may I introduce \"Mike Hebrew Italic\".\n\nThis was developed from my calligraphy of prayers, biblical texts and poems for relatives or friends. The font resembles my hand lettering style but with some idiosyncrasies and flourishes removed. Here it is “Mike Hebrew Italic”.\n\nThe italic form posed a real problem for the Latin letters and the numerals: Which way should they lean? I decided they should be slanted the same way as the Hebrew. The reason for this should be apparent from the next example\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/bialik_italic_with_dates_5737.jpg)\n\nThe Latin in this font can't be used for a block of text. It just looks ridiculous! So if we want a side-by-side Hebrew and English translation of a poem, the Mike Hebrew family doesn't have a suitable match for the Hebrew.\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/jonatan_italic_4388.jpg)\n\nIn the above poem by Rachel, both fonts are Mike Hebrew with the Hebrew in italic and the English in regular. The result is less than satisfactory. I don't have any idea of what to do about this. Of course the layout designer could chose a different font for the English but would have problems matching baselines, sizes etc.\n\nMike\n\n"
    },
    {
      "time": "26 Oct 2008 — 7:38am",
      "content": "Mike,\n\n\\><cite>...some idiosyncrasies and flourishes removed...</cite>\n\nPerhaps, you are aware that with MS Volt and OpenType, these \"idiosyncrasies and flourishes\" can be included, for a very natural look to your font.\n\n"
    },
    {
      "time": "26 Oct 2008 — 8:04am",
      "content": "The leaning of letters is a debate among professionals. Should Hebrew follow the direction of English, towards the right, particularly since Hebrew has no italic tradition. The only true Hebrew italic is \"David Italic\" and it leaned to the right.\n\nWhen I worked at Font World ( [www.fontword.com](http://web.archive.org/web/20150414023949/http:/www.fontword.com/ \"www.fontword.com\")), I reversed its direction to lean to the left. I learned many decades ago that eye movement is an important aspect of fine art. Hence, since eye movement in Hebrew is to the left, I believe all Hebrew italic should lean to the left.\n\nNow, you are asking about a matching Latin font, if it should lean to the left or to the right.\n\nIf Hebrew is the dominant language, and English is used to add a word or two or three to the Hebrew paragraph, my view is the English should lean to the left as well. Again, this follows the principle of eye movement.\n\nIf each language is dominant, like in side-by-side text, it's debatable. Do we follow the principle of eye movement, and lean the Latin font to the right,or do we follow aestetics and match the English to the Hebrew (as Hebrew really is the dominant language, and English is secondary)?\n\nMy view is that both languages should lean to the left, as in your title.\n\nAgain, your style is informal and non-level like much handwriting. Hence, you need to create either a hand-written like font to match (it's not so daunting), or find a more informal existing font (I'm sure it's there somewhere, but it won't match exactly).\n\nI suggest to look and find it, and then modify it in Fontographer or FontLab to match exactly. Weight and kerning is a big issue. If you plan to also create a \"smart\" version in MS Volt in OpenType, then FontLab is a better option than Fontographer (although Fontographer has a minimal learning curve).\n\n"
    },
    {
      "time": "26 Oct 2008 — 8:21am",
      "content": "A good font goes through stages of improvement in its development.\n\nLet's put on our critique hats now.\n\nI suggest that your font needs to be kerned properly, so that certain letter combinations appears more evenly spaced.\n\nI suggest the side-bars be adjusted to give it slightly more space between the letters.\n\nSpacing, like kerning, is a very subjective issue. As they say, \"some like it hot\". More space, less space. Kern close, kern far. As they say in Hebrew, \"טעם וריח אין להתווכיח\" - \"Taste and smell can not be debated\"; or in English, we say: \"Beaty is in the eye of the beholder\".\n\nIn general, the rule is greater space and further distance in kerning when the text size is less; less space and closer distance (or even very little and sometimes overlapping) in kerning when the text is more.\n\nI think that this is related to overall text \"color\" - the relationship between black and white (space). When text is small, more white is needed to create a blanced effect. When text is large, less white is needed to create a balanced effect.\n\nLikewise, readability and easier comprehension results when letters are farther apart at smaller text sizes. Greater aestetics is achieved when letters are closer, even touch, at much larger sizes.\n\nThat's my two cents.\n\n"
    },
    {
      "time": "26 Oct 2008 — 8:26am",
      "content": "Btw, do you know where I could get data of Bialik's poetry or writings, and poetry of others, in Hebrew with nikkud?\n\nI seek to demonstrate different OpenType Hebrew fonts with nikkud and Hebrew grammar marks, using Bialik and others Hebrew poetry.\n\nFor my own interest, I seek data of his writings, particularly Sefer Aggadah (?).\n\n"
    },
    {
      "time": "26 Oct 2008 — 8:37am",
      "content": "Looking briefly at the text in Hebrew, it seems the side-bar on the left side of the yud has too much space.\n\nIf you look at words containg yud, like between the yud and final mem in Chaim, or yud and aleph in Bialik, and again yud and kuf in Bialik, it appears the yud is too far from the left side.\n\nActually, in Fontographer (and perhaps also in FontLab), the left side in appearance is the right side in the program. At least, it was that way about 15 years ago. Maybe now it's different with the advent of Unicode. Maybe, FontLab knows Hebrew is from right to left. Anyway, you may to experiment.\n\n"
    },
    {
      "time": "27 Oct 2008 — 3:59pm",
      "content": "Israel,  \nThanks for you many comments which I will consider and answer one by one...\n\nHere is a quick answer to getting Bialik texts with Nikud:  \n [http://benyehuda.org/bialik/](http://web.archive.org/web/20150414023949/http:/benyehuda.org/bialik/ \"http://benyehuda.org/bialik/\")\n\nMike\n\n"
    },
    {
      "time": "28 Oct 2008 — 6:18pm",
      "content": "Open Type  \nMany of the very advanced topics that cause hundreds of posts on this special interest group for Hebrew are tackled using OpenType. I'm truly impressed by the expertize and energy that goes into it!  \nIn my simple way, I have been using Font Creator ( [http://www.high-logic.com](http://web.archive.org/web/20150414023949/http:/www.high-logic.com/ \"http://www.high-logic.com\")). This is a relatively inexpensive tool and is about as complex as I should care to learn. There remains a great deal of functionality in Font Creator which I havn't yet utilized. The tool is excellent for TrueType but doesn't support the added functionality of OpenType.\n\nThe Mike Hebrew font family has a lot of potential for improvement within TrueType without the added problems of OpenType development.\n\nThere are two areas of functionality in Font Creator which I haven't yet used.  \n1) Kerning - Israel, You are right in your suggestion that the font would benefit from this.  \n2) Transformations using scripts e.g to go from regular to bold.\n\nMike\n\n---------------------------------------------------------------------------------\n\nMichael Cunliffe Thompson  \nSeascapes and Landscapes of New England and...  \nHebrew Calligraphy at [http://cunliffethompson.com/font](http://web.archive.org/web/20150414023949/http:/cunliffethompson.com/font \"http://cunliffethompson.com/font\")\n\n"
    },
    {
      "time": "28 Oct 2008 — 8:40pm",
      "content": "OpenType is only supported in a very minor way by FontLab.\n\nThe free tool from MicroSoft, MS Volt, supports the very advanced features of OpenType.\n\nYou can use any front end, FontCreator, Fontographer, FontLab to edit and create the fonts.\n\nAfterwards, you open it in MS Volt. After you create the \"projects\" with the advanced OpenType features, you then \"ship\" the font, with those features, but without the source code which created them.\n\nThen, in the programs that support OpenType in all its glory, your advanced OpenType font will operate in all its glory. The programs that do not support OpenType in all its glory (even though they do support a very limited form of OpenType), your advanced OpenType font will not operate in all its glory, but only in a limited way.\n\n"
    },
    {
      "time": "28 Oct 2008 — 8:42pm",
      "content": "Mike,  \n\\><cite>The tool is excellent for TrueType but doesn’t support the added functionality of OpenType.</cite>\n\nFor MS Volt, that's all you need.\n\n"
    },
    {
      "time": "28 Oct 2008 — 8:45pm",
      "content": "Mike,\n\n\\><cite>1) Kerning - Israel, You are right in your suggestion that the font would benefit from this.</cite>\n\nOne way is through kerning. Another way is in OpenType through GPOS and GSUB (with ligatures).\n\nI prefer the ligature approach.\n\n"
    },
    {
      "time": "29 Oct 2008 — 4:57pm",
      "content": "I just did an experiment with kerning. In Font Creator, I added crazy kerning that could easily be recognised. This was done for three Latin pairs and two Hebrew pairs.  \nThis is a screen capture for Font Creator:\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/crazy_kerning_6603.jpg)\n\nThis is the result when displayed in Microsoft Word. The result for Open Office Writer is the same and a PDF exported is also the same.\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/kerning_on_microsoft_word_5412.jpg)\n\nNow I remember why I gave up on kerning some years ago. I had no software on my PC that could display it! Are the any editors on a PC that will display kerning FOR HEBREW?\n\nMike\n\n"
    },
    {
      "time": "1 Nov 2008 — 11:25pm",
      "content": "FontLab's metric window can display unkerned letters and kerned letters as left-to-right (by default) or right-to-left (by selection).\n\nThis is a benefit.\n\n"
    },
    {
      "time": "2 Nov 2008 — 12:33pm",
      "content": "`Hence, since eye movement in Hebrew is to the left, I believe all Hebrew italic should lean to the left.`\n\nA spontaneous question from a left-to-right reader:  \nGohebrew said Hebrew does not have a tradition of an inclined italic writing style, but it seems Mike's alphabet is based on his handwriting, so – in some ways – we have a custom of writing Hebrew leaning left (at least in recent times).  \nThe bottom line, in these cases, seems to me a question: «How does it look in Hebrew?»  \nBecause, if you ended up leaning your handwriting it means it works good, and it's a good direction to explore.\n\nFor the Latin complement it's not easy, but I would not worry excessively. Surely it would be a challenge to design a Latin face leaning left (however you try, it looks quite bad). But I think there should be a few faces doing this. In general, I would choose a quite \"casual\" face, it would work best than a traditional \"text\" face.\n\n"
    },
    {
      "time": "2 Nov 2008 — 2:04pm",
      "content": "piccic,\n\nHebrew uses another font in place of what Latin languages use as Italic. Like Bold, it is a form of emphasis, only lighter.\n\nHandwriting is complex. Is Mike left-handed. Lefties do better in Hebrew, as the arm does not \"smudge\" or obstruct the text. The opposite for righties.\n\nIs the angle of the text determined by the handing holding the quill? I assume it's as above.\n\n"
    },
    {
      "time": "2 Nov 2008 — 4:26pm",
      "content": "piccic  \nIf you go back far enough all Hebrew was written by hand. There are many reproductions in \"The Book of Hebrew Script\" by Ada Yardeni. I have just taken out my copy and I see that many early examples slope to the left. It was the Dead Sea Scrolls that inspired me to calligraphy and for some years my style was really a copy of this. During the seventies I lived in Israel and wrote a cursive that leaned to the left. I don't remember anyone commenting on this. In school they teach a vertical cursive however in Israel some people lean their handwriting to the right. The font \"Yad\" which simulates handwriting, slopes to the right.  \nMike\n\nBy the way I am right handed.\n\n"
    },
    {
      "time": "6 Nov 2008 — 11:44am",
      "content": "Hi, many thanks for your answers! :=)\n\nSo it's not uncommon at all to have sloped handwriting/calligraphy in Hebrew, right?  \nI guess it's pretty natural, it's quite common to lean sligtly towards the handwriting's direction when you start writing quickly.  \nSome 7-8 years ago, frustrated by the way people tend to use the keyboard even for the smallest writing tasks, I started to pick up again handwriting and to use it extensively.  \nThis brought me back to the habit of using small capitals for emphasis, and as the need arose to write quicker, I realized I started to develop a lot of ligature between the capitals.  \nIt's fascinating, since you actually see how naturally more cursive forms (in any script) develop from more \"affirmative\" forms, like the capitals.\n\nHebrew letters are so beautiful, but I have not had the opportunity to get into them properly yet (I'm currently trying to acquire some familiarity with the Greek alphabet first). I have some things about the dead sea scrolls, and I recall we have a lot of examples of ancient Hebrew in our \"Archivio Paleografico Italiano\" (which I can check at our library Estense, here in Modena). I'm sure I took some picture of a passage from Isaiah.  \nCoincidence, I went to the cemetery a few days ago on the festivity of the dead, and I visited also the Hebrew section in the cemetery. It's a pity, since nowadays the Hebrew community is pretty small, and the cemetery is quite barren and left to itself.\n\nDuring the seventies… I guess you were listening \"The Orange Season is Over\" by Tamouz all the way… :=)\n\n"
    },
    {
      "time": "6 Nov 2008 — 2:20pm",
      "content": "piccic,\n\n\\><cite>During the seventies… I guess you were listening “The Orange Season is Over” by Tamouz all the way… :=)</cite>\n\n“The Orange Season is Over” in Hebrew is סוף עונת התפוזים - \"sof oh-nat ha-tah-pu-zim\".\n\nWere you in Israel, then. It was the name of Shalom Chanoch's band.\n\n\\><cite>Hebrew letters are so beautiful...</cite>  \nI believe that is because the shapes and curves have meaning. The letter forms have meaningful designs, and when a good type design put those forms a good tytpe design, their beauty is stunning. Much has been written about the Hebrew letters.\n\n\\><cite>I went to the cemetery a few days ago on the festivity of the dead...</cite>\n\nWhat is the \"festival of the dead\"? A day of yarzheit?\n\n"
    },
    {
      "time": "7 Nov 2008 — 7:35am",
      "content": "I don't recall the band names, but I discovered “The Orange Season is Over” (the album by Tamouz) because I got hooked by the work of Ariel Zilber first. Maybe the band you mention is another thing. I see Ariel lyrics are sometimes criticized as ingenuous and nationalist, but (although I can't get properly the meaning) I instantly liked the optimism and joyful quality of his music.\n\nAbout the letterforms: I entirely agree. That, to a lesser degree, is what I see in any thorough work involving creativity. If you do not recognize you live within a creation, I can't see actual beauty, just a wandering logic. :=)\n\nWith \"festivity of the dead\" I meant the day we (as catholics) pray for and set in communion with the dead, liturgically it's the day following the festivity of all saints (November, 1). I'd like to know about yarzeit but I fear that we'd be hacking Mike's thread too much… :=)\n\n"
    },
    {
      "time": "7 Nov 2008 — 10:52am",
      "content": "piccic,\n\nYou might be right, maybe Ariel Zilber's band was named Tappuz and Shalom Chanoch's band. Anyway, they were all friends and used to play together too.\n\nHow did you access Israeli music from America? I was a teenager living in North Tel Aviv. So, for me it was natural. I also understans the lyrics, and the nuances etc.\n\nYou could go to [www.gotalmud.org](http://web.archive.org/web/20150414023949/http:/www.gotalmud.org/ \"www.gotalmud.org\") and join the blog there.\n\n"
    },
    {
      "time": "7 Nov 2008 — 11:53am",
      "content": "From America? I thought it could be seen from my comments that I am Italian… :=)  \nI hope to keep only the positive elements of any culture I get in touch with…  \nAs for Ariel, I think I was advised by an Israeli young fan with whom I talked in a music file sharing community. Then I listened to his recent works, and I enjoyed so much his music that I bought some records online from some Israeli seller. Ariel then was so kind to give me even a personal email reply, and another young fan translated roughly for me a song I absolutely from the recent album \"Anabel\" (\"Lev Amitz\", i.e. \"Brave Heart\").\n\nAnd for you, how has it been to grow up simultaneously in USA and Israel? (I was looking at your profile). I feel we should stop hacking Mike's thread, however… :P\n\n"
    },
    {
      "time": "8 Nov 2008 — 3:12pm",
      "content": "piccic,\n\nI didn't read your profile, and your accent could be picked up in your words. Id I was Italian, I'd be insulted if I mistaken for an American. Sorry 'bout that.\n\nAmerica has many greatnesses, and a very outgoing caring people at times. But culturally leaves much to be desired, except of course folk music. :)\n\nLet me do my due diligence now...\n\n"
    },
    {
      "time": "8 Nov 2008 — 5:27pm",
      "content": "piccic,\n\nI chose to discuss this personal stuff with you at: [http://gotalmud.org/blog/category/israels-stuff/](http://web.archive.org/web/20150414023949/http:/gotalmud.org/blog/category/israels-stuff/ \"http://gotalmud.org/blog/category/israels-stuff/\"). Please go there to respond.\n\n"
    },
    {
      "time": "9 Nov 2008 — 4:05am",
      "content": "That's great, many thanks Israel. I will drop as soon as I have a quiet minute…  \nP.S. I would not be offended if mistaken for any other culture. In fact, the only time in which I came to the US I was constantly mistaken for either a German or a French, but I see what you mean: there are so many negative aspects to US culture that there is always the risk to overcome a true American identity, imbued, in a good deal of cases, by a magnificent jewish heritage as well.\n\nExamples: almost all the big names of the comic book industries, from Jules Schwartz to my beloved Jack Kirby (Austrian jew roots, wonderfully expressed in his comic book art).\n\n"
    },
    {
      "time": "9 Nov 2008 — 5:13am",
      "content": "My principal in Israel at the American Intl. School there gave a speech at our high school graduation party.\n\nHe said that having spent our teenage years abroad, we would never feel fully at home in the US.\n\nHaving lived back in America for over 20 years, I have found this very true.\n\nI speak English like an American, but don't identify with the culture. Having said that I won't to add: As a Chassidic Jew, I have learned to see the good in people. Having been to Europe, Israel, Russia (and living in multi-cultural Brooklyn), I see how Americans do have some outstanding traits that are found much less elsewhere.\n\nI'm sure if you visited America, you might have picked up on that, if you left Mahattan.\n\n"
    },
    {
      "time": "9 Nov 2008 — 6:09am",
      "content": "Surely there's a uniqueness for any culture, but I think the focal point is to be able to have an appropriate definition of \"culture\". There is a book by french historian Louis Dollot, talking about the concept of personal culture as opposed to the emerging concept of \"mass culture\".  \nBut we'd better discuss this on your page, or Mike's font thread will be full of \"white noise\"… :=|\n\n"
    },
    {
      "time": "9 Nov 2008 — 7:31am",
      "content": "Tell me also over there what white noise is. Is it the opposite of black silence? :)\n\n"
    },
    {
      "time": "9 Nov 2008 — 7:04pm",
      "content": "\"Hebrew letters are so beautiful\"\n\nI'm back again...  \nI don't think all Hebrew letters are beautiful. Some are nondescript and others just don't fit to their fonts despite the best efforts of the designer. I take this to be true not because I sit on high and deign to judge on some \"aesthetic\" grounds which glyphs are inherently good and which are not but because I do have an objective measure. This is simply the number of times I have redesigned a glyph. Why it was redesigned doesn't need to be considered here. I can just take the number itself. I don't actually count design changes but I do remember making changes to certain glyphs again and again...\n\nThe winner is **Mem**. It has a stupid chubchik stuck on the top left.  \nClose runners up are **Tet** and **Sin** which should be different yet not too different.  \nAlso **Gimmel** is has this stupid appendage on the lower left.  \n**Lamed** must be tall. The long neck is no problem. One makes it as long as possible. The problem with the Lamed is the lower part. Different designers have quite different solutions and so the designer is free to choose (or to be indecisive).  \n**Tsadeh** is a solid balanced glyph but Tsadeh Sofit is weak and spindly.\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/ugly_ducklings_4331.jpg)\n\nThe version of the font is the last release.  \nSurely the next will be better?  \nMike\n\n"
    },
    {
      "time": "10 Nov 2008 — 7:47am",
      "content": "Unfortunately I have no familiarity with the Hebrew letters, but I guess Israel was speaking of their \"archetipal\" forms. Since a tradition holds them divinely given, it's probably the gesture associated with letters which is important.  \nIn fact I have developed a personal convinction that, if you draw letters keeping into account how they have become that way, they hold more strength.\n\nSo, Mike, I guess you could have some space to modify them, anyway.  \nFrom what I see the different styles allow for pretty radical changes. Less than Latin, but nonetheless there is quite room for working on them… :=)\n\nP.S. Sometimes your type looks not evenly spaced, but as I said I'm unfamiliar with the forms, and it's difficult to judge from bitmaps. The forms look fine, however.  \nP.S.2: With \"white noise\", I meant the disturbing element.\n\n"
    },
    {
      "time": "10 Nov 2008 — 9:07am",
      "content": "Thank you for sharing the meaning of white noise.\n\nAll outline font software is rendered as a bit-map. On a monitor, the resolution is particularly low, but nowadays most every font is in the TrueType, PostScript, or OpenType font formats, which are all are defined as mathematical outlines, and not as bit-maps.\n\nSome outline system fonts are \"hinted\" to render better on a monitor at small point sizes.\n\nAs a graphic artist, I agree that certain Hebrew letters are more beautriful in design that others, like the aleph, mem, and even taf.\n\nAs you point out, when you draw letters with intent, their is a superior quality to them than to those simply drawn without thought of meaning.\n\nIn Hebrew, we have this tradition, both in holy writings, and even in mechanically produced writings.\n\nFor example, a sofer scribe drew a Sefer Torah scroll after immersing himself in a mikva ritual pool, and thinking about the special meanings and associations of each letter he composes.\n\nThe Shlavita brothers, owners of the famous printing presses in Shlavita, Poland in the late 18th century, immersed the printing plates containing configured Hebrew letters of the Talmud and other significant works in the mikva ritual pool before printing with them.\n\nHowever, these outstanding customs are rarely practiced today.\n\nUsually, each letter has a meaning, and significance. Much has been written about this.\n\nI am of the opinion that each letter in a word contributes to the meaning of that word. As most Hebrew words have three letter roots, words with share in common the same first two letters, in the same order, will have similar or related meanings. The third letter provides a particular application of that general meaning.\n\nAlso, much discussion has been devoted to the shapes of the letters, where they have open spaces or closed. Are they upwards, downwards, to sideways, right or left? I don't believe that any other language and letter form is designed to be conducive to this form of analysis.\n\n"
    },
    {
      "time": "10 Nov 2008 — 4:35pm",
      "content": "piccic  \n\"Sometimes your type looks not evenly spaced\"  \nYou are right. I am spending more time on this for the next version. I am reviewing the design of the entire font so as to reduce or largely eliminate the need for kerning.  \nMike\n\n-------------------------------------------------------------------  \nMichael Cunliffe Thompson  \nSeascapes and Landscapes of New England and...  \nHebrew Calligraphy at [http://cunliffethompson.com/font](http://web.archive.org/web/20150414023949/http:/cunliffethompson.com/font \"http://cunliffethompson.com/font\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 6:37pm",
      "content": "Mike,\n\n\\><cite>I am reviewing the design of the entire font so as to reduce or largely eliminate the need for kerning.</cite>\n\nThe truth is most every Hebrew typeface only requires very few kerning pairs.\n\nIf you devote much thought and time to adjust the side-bearings, ie. the space on each side of the letter, very little effort must be spent on kerning.\n\nKerning, as you know, adjusts the appearance of space between the letters. So, even though a kerning pair may reduce or increase the distance between the letter pair, the overall look will be improved, and the distance between all the various pairs of letters \"appear\" to be consistant.\n\nThe classic pairs are the daled and gimmel (from right to left), and the reish and gimmel, as there is a perceived large gap between them, due to the right bottom void of the daled or reish, and the leftward incline of top of the gimmel.\n\nOther known pairs are the gimmel and daled or reish, daled and beit; zayin and taf, yud and beit; nuhn and daled; ayin and daled (sometimes); reish and beit; shin and taf (sometimes); taf and daled; taf and yud; taf and lamed; and taf and kuf.\n\nIf you do not plan to use it for text with nikkud, you could make a set of ligatures in FontLad or any font editor, and then create an OpenType font in Volt which will automatically replace the pairs with the correct ligatures, and then the kerning could be put to rest. Good night!\n\n"
    },
    {
      "time": "11 Nov 2008 — 7:31am",
      "content": "In general, with Type1 (and OTF), you have very limited possibilities for hinting.  \nHinting is a very important thing, but working on it is a big effort, repaid mostly if you generate TrueType or TrueType based types.\n\nMy friend Fabrizio Schiavi is one of the few designers (not only here in Italy) putting a lot of care into hinting (not being a large enterprise, I mean). When he designed his typeface Sys:  \n [http://www.fsd.it/fonts/sys.htm](http://web.archive.org/web/20150414023949/http:/www.fsd.it/fonts/sys.htm \"http://www.fsd.it/fonts/sys.htm\")  \nhe adjusted the geometry of the forms to help the hinting process.  \nOur common friend Oded Ezer ( [http://www.odedezer.com/fonts.html](http://web.archive.org/web/20150414023949/http:/www.odedezer.com/fonts.html \"http://www.odedezer.com/fonts.html\")) asked Fabrizio to design a Hebrew version (you can see it in the page I linked: scroll down, it should be called \"Systeza\", with Hebrew writing). To work on the hinting requires a thorough dedication, and I prefer to concentrate on the design as a whole. Besides, it's such a \"technology dependent\" thing that I'm unsure if it's worth such a big effort in the long term…\n\nI have the impression that this thing of the word roots is the most wonderful character of Hebrew language, although I don't know them. I have epiphanies each time I get into the meaning of a word. Not something you have to \"rationally hold\". It's really like a gift you receive: as you get the \"transversal\" meaning of a word (even if it has been translated into Greek in later codes, it seems it holds a good part of this), whole worlds opens before you, at the innermost level…\n\nI understand Hebrew needs little kerning, if the letters are spaced evenly, but this goes also for Latin, if you take enough care to design well-thought forms.  \nOf course, any cursive form benefits from this, in any script…\n\n"
    },
    {
      "time": "11 Nov 2008 — 7:59am",
      "content": "piccic,\n\n\\><cite>...(and OTF), you have very limited possibilities for hinting.cite&gt;</cite>\n\nIs this correct?\n\nAs I understand it, OTF are divided into 2 kinds: the PostScript flavor, and TrueType flavor. Dianne Collier told me that she hinted system fonts for MicroSoft. I believe that she was refering to OTF of the TrueType flavor.\n\n\\><cite>I understand Hebrew needs little kerning, if the letters are spaced evenly, but this goes also for Latin, if you take enough care to design well-thought forms.<br>\nOf course, any cursive form benefits from this, in any script…</cite>\n\nDepending upon the design, certain Hebrew letter pairs create large gaps of empty space, that can be significantly reduced by kerning.\n\nFor example, the beit ב by nature protrudes a little on the lower right. When the daled ד or reish ר are in front of the beit: דב רב , there is a gap that can be reduced through kerning, or if there is no nikkud a ligature can be created for the pairs in FontLab (or another font editor), and a GSUB routine can be defined for them in Volt.\n\nCursive or handwriting fonts are very complex, and could benefit enormously from ligatures, or even other amazing effecta.\n\n"
    },
    {
      "time": "11 Nov 2008 — 11:42am",
      "content": "<cite>Is this correct? As I understand it, OTF are divided into 2 kinds: the PostScript flavor, and TrueType flavor. Dianne Collier told me that she hinted system fonts for MicroSoft. I believe that she was refering to OTF of the TrueType flavor.</cite>  \nYes, it is. TrueType flavored OpenType fonts bear the .TTF suffix, while Type1 flavored ones bear the .OTF suffix. I was referring to OpenType as Type1 OTF, which is the direct \"descendant\" of the Type1 legacy, and has the same \"limitations\" concerning hinting. As far as I can get, the limits of Type1 are closely related to the more economic number of points.\n\nI thought such simple OpenType tasks (ligature) could be defined simply by using the code within FontLab. What does Volt do? Maybe Mike would need Volt just because he does not use FontLab…\n\n"
    },
    {
      "time": "11 Nov 2008 — 3:08pm",
      "content": "Well, there is a way to fool the OS into thinking it is PostScript .otf, when really it is TrueType in its origin.\n\nThe main difference between a PostScript .otf and a TrueType is in two things:  \n1. Bezier curves and Quadratic curves  \n2. 1000 versus 2048\n\nVolt is not a font editor. You still need FontLab, Fontographer or FontCreator to create the font.\n\nAs screen resolution improves, hinting will go away like bit-maps. Maybe, another 5 years.\n\nI know that FontLab can make ligatures using the LIGA command. I never saw any. I don't know how easy it is. FontLab is code-based.\n\nVolt is graphical. Volt uses the GSUB command. I see the results. I use it every day. It's not hard at all. Volt is free.\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:00pm",
      "content": "I think we were talking of slightly different things.\n\nThe differences you underline are actually the basic format differences between Type1 and TrueType.  \nOpenType simply starts from the old formats, offering two kinds of possible OpenType output: the .OTF flavored, which retains the bezier curves, and the .TTF one, with quadratic curves.  \nBut they are both OpenType, it's just the suffix .TTF which could fool you. You have got to open the face in FontLab to see if there's some OpenType code included.\n\nThe code for generating OpenType substitutions is really easy (at a basic level).  \nI have had a super-quick look at the VOLT page, and it seems more or less the same thing than  \n [this](http://web.archive.org/web/20150414023949/http:/www.microsoft.com/typography/developers/volt/images/all_ligs.gif)…\n\n"
    },
    {
      "time": "12 Nov 2008 — 5:26pm",
      "content": "piccic,\n\nThe real advatantages of OpenType are much greater than those related to file format or the way curves are defined. This is merely **technical**.\n\nThere are also **functional** advantages, which few fonts have mastered yet, to my limited knowledge. These advantages are more seen in non-Roman languages and the placement of diacritics.\n\nThe examples which you showed in the \"this\" link, about are very simple subsitutions. True, you don't need Volt to do this, as very basic substitutions can be done in FontLab (although I never saw anyone actually do this).\n\nWhere Volt really outshines FontLab are the complex positioning of multiple diacritics under and/or over a base letter, as is required in Biblical Hebrew. This is achieved with the GPOS command. An ingenious way to address multiple diacritics is to first have them replaced by a ligature and positioned correctly. This is done with the GSUB command, which is processed before the GPOS command.\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/Diacritics_4270.jpg)\n\nAt this time, it can not be done in FontLab, plus we do not see a graphic example, as OpenType programming is code-based, and not graphical, in FontLab.\n\nAt this time, FontLab should be the font editor only. Or it could be Fontographer, or FontCreator. I personally prefer Fontographer's superior interface and flexible feature set to create the fonts. Then, I use FontLab to generate the actual but interim font file. Finally, I use Volt to do the heavy OpenType development work, and \"ship\" the final font product.\n\nI suggest that Mike uses the lower cost easy to use FontCreator, and then cost-less Volt to do the sophisticated stuff. He doesn't need FontLab, since he knows the FontCreator interface already.\n\nIf he was focusing on Latin languages, he could center everything on one tool, like FontLab.\n\nAdam, I've been using Fontographer for over 20 years. I helped Jon Von Ehr at Altsys revamp Fontographer's interface and feature set from 1.x to 2.x to 3.x to 4.01. FontLab needs to be seriously overhauled. I suggest that you use Fontographer as a front end, as a wrapper for FontLab. Make one product in two versions, Light for $399, and the full version for $799.\n\nFontLab is a very powerful program, but a pain in 'a - -' to use.\n\n"
    },
    {
      "time": "13 Nov 2008 — 6:15am",
      "content": "<cite>Where Volt really outshines FontLab are the complex positioning of multiple diacritics under and/or over a base letter, as is required in Biblical Hebrew. This is achieved with the GPOS command.</cite>  \nMay I ask you what happens when you generate the typeface? If you re-open it, are the final glyphs \"decomposed\"?  \nIn FontLab I use anchors to define combined glyphs, although, of course, we do not have super-complex combinations. Besides, I generally prefer to draw accent glyphs specifically (I do not have experience yet, but I recall I edited some Polytonic Greek which my friend Panos designed for me, and I ended up getting rid of the \"composed\" accents to specifically design them. I mean, the \"dieresistonos\" accented letters made me redesign a custom combination of Dieresis and Tonos, since overlapping the two did not gave satisfactory results (you need to have enough space between the two dots of the Dieresis).  \nI don't understand what you mean by saying \"an ingenious way to address multiple diacritics is to first have them replaced by a ligature and positioned correctly\".\n\nAs for FontLab, I never used Fontographer. I tried, but I totally hated the clumsy interface, although it was a very solid program. To design, I always used FontStudio, which was buggy but light-years ahead in terms of interface and glyph editing. Then, as FontLab came out I hated it as well, up to version 4.x. In version 4.x, everything changed. True, the interface is still quite a mess (too many buttons and ways to accomplish single simple tasks, and the menus organization is bad), but nonetheless it's an effective program. I often jump back and forth from FS to FreeHand while I design, since each program have unique ways to treat the drawing process (I often find useful to blend forms, and make curve editing in one or the other).\n\n"
    },
    {
      "time": "13 Nov 2008 — 8:32am",
      "content": "piccic,\n\nAre you trying to make an ancient Greek typeface for the Bible? If yes, perhaps, we can work together here, as I was to do similar projects that I am doing for Biblical Hebrew, for Ancient Greek, Vietnamese, Thai, and other languages.\n\nI use FontLab, but it was renamed as FontStudio. I think that it's the same thing.\n\nDo you have a Macintosh or Windows (XP or Vista?) ? If you have a Mac, then you can download a free demo at [http://www.fontlab.com/font-editor/fontographer/](http://web.archive.org/web/20150414023949/http:/www.fontlab.com/font-editor/fontographer/ \"http://www.fontlab.com/font-editor/fontographer/\"). Try it. It is very intuitive and easy to use, but lacks some of FontLab's or FontStudio's capabilities (but FL or FS lack very basic simple things that Fontographer can do on the editing level.\n\nHence, I use Fontographer as an editor to create the font. Then, I use Font Lab or Font Studio to generate the font as TrueType, and add any advanced features that it offers. Then, I complete the TrueType font in Volt, say the project. Close Volt. Then, I reopen the TT font in FL or FS, and generate it again as OpenType. Then, I reopen Volt, open the OpenType font, import that project, and \"ship\" the final OpenType font.\n\nBe sure to append all the names, as .volt (in Volt) or .fl (in FontLab or FontStudio) to avoid confusing then. I call the final shipped product just its font name with no suffixes, but save it in a special folder.\n\nIf you do not use Volt, then I don't see how you could contextual substitute without the GSUB routine, or accurate placement of diacritics without the GPOS routine.\n\nAbout decompossing glyphs, I need more information.\n\nTwo last things about Volt and FL or FS,\n\n1) All development work you did in Volt can be saved 100% in a project file, and only in part in the shipped final OpenType font,and totally lost if openned later in FL or FS.\n\n2. The number of glyphs in FL or FS must correspond exactly to Volt, or everything goes haywire.\n\n"
    },
    {
      "time": "13 Nov 2008 — 10:58am",
      "content": "<cite> Are you trying to make an ancient Greek typeface for the Bible? </cite>  \nNot specifically. As I said, most of the work which I wish to finish, is informed by reflections on the \"post-modern\". In fact, I always keep an eye on the idea of being able to set a Bible if the face is enough \"text-friendly\", so I will probably add Polytonic Greek in the end, but as a start I wish to keep the work self-contained, or I will never put things to completion.\n\n<cite> I use FontLab, but it was renamed as FontStudio. I think that it’s the same thing. </cite>  \nNo. Here you mean the new name of FontLab, which is FontLab Studio.  \nI used to use FontStudio (owned by Letraset, but written by Ares), which ceased to be supported a lot earlier than Fontographer (around 1992, I think).\n\nI have a license of Fontographer 4.1.X (part of the old Macromedia \"suite\"), but I stopped using it, since I used it just for font generation and I no longer need it since I have FontLab Studio 5. I would never use Fontographer as an editor to create a face… I feel its interface \"entirely alien\".\n\nWe are abusing your thread Mike, I think I will start a new one… :=(\n\n"
    },
    {
      "time": "13 Nov 2008 — 11:03am",
      "content": "A last thing. Fontstudio (from the Flickr page of Eric Van Blokland):  \n [http://www.flickr.com/photos/letterror/2059323123/?addedcomment=1#commen...](http://web.archive.org/web/20150414023949/http:/www.flickr.com/photos/letterror/2059323123/?addedcomment=1#comment72157609011978334 \"http://www.flickr.com/photos/letterror/2059323123/?addedcomment=1#comment72157609011978334\")\n\nPlus, a handy creation by my friend Antonio:  \n [http://typophile.com/node/38539](http://web.archive.org/web/20150414023949/http:/typophile.com/node/38539 \"http://typophile.com/node/38539\")\n\n"
    },
    {
      "time": "13 Nov 2008 — 2:19pm",
      "content": "I recall FontStudio or LetraStudio - one of them, I think the latter. I even bought it, as I later bought Icarus too and its big clunky scanner.\n\nBut, I got a long string of very interesting jobs, like a Thai typeface for Smith-Corona (they needed the code in PostScript Type 3), a font logo for Estee Lauder in Cyrilic, fascinating candy wrapper logos in Arabic for Nestle of Canada (you typed it on the US keyboard and didn't have to know Arabic), Vietnamese, Georgian, Greek, Ukrainian, Belo-Russian etc.\n\nSo, I had no time to learn them, even just ther interface.\n\nI kept with Fontographer until a few years ago. In the old days, the Altsys people were very kind and warm, and implemented most of my multiple pages of suggestions. I wish FontLab Studio had them. When Aldus bought them, they celebrated with a big bar-b-que in Plano, Texas. They called me in Rochester, NY, and very warmly invited me to join, which I would have. They claimed jokingly, \"We're gonna have the biggest fattest juiciest steaks in the whole wide world! Please come. You'll drive down, join us, at sleep at Jon's house.\" I am an Orthodox Jew, who eats only kosher food and drink kosher wine. So, I refused politely, explaining it was one of my kid's birthdays.\n\nAnyway, I started a new blog. We can move this dialog to over there, and this cab be reserved for Mike's Hebrew stuff.\n\n"
    },
    {
      "time": "14 Nov 2008 — 1:18pm",
      "content": "Wow! gohebrew and piccic have had quite a chat since I last looked in.  \nMost of it about advanced software tools and mostly well over my head.  \nBack to simple stuff...\n\nIsrael,  \nThanks for listing some of the best known pairs of Hebrew letters that often need kerning.  \nI'm looking at that now.  \nMike\n\n"
    },
    {
      "time": "14 Nov 2008 — 1:39pm",
      "content": "Sorry, Mike, I apologize.  \nIt was just my enthusiasm since I know almost nothing of Hebrew scripts…\n\nI just wish to add Antonio's \"Automatic Text\" works with any glyph, and string of glyphs, no matter if Latin or not, encoded or not.  \nI know you are not using FontLab, but it may be handy…  \nHere's an example (typeface: Erica by Yanek Iontef, which has no Unicode since my copy is Type1):\n\n ![](http://web.archive.org/web/20150414023949im_/http:/typophile.com/files/AT_Antonio_5212.jpg)\n\nP.S. The \"daggerdbl\" thing is just because, being not Unicode, the Type1 has the Aleph in that slot… :P\n\n"
    },
    {
      "time": "14 Nov 2008 — 2:12pm",
      "content": "Mike, I have downloaded the previous release of your type family, right now.\n\nI'd love to comment on it, I hope to do so when I am more familiar with Hebrew letters.  \nIn the meantime, although it seems the drawing can be refined, I have to say it looks really well-conceived and \"craftful\".  \nIt's always a problem to learn to digitize letters well, this no matter the script…\n\n"
    },
    {
      "time": "14 Nov 2008 — 2:37pm",
      "content": "piccic,  \nThanks for suggestion to use \"Automatic Text\". The approach may be useful in a technical sense however it seems to me a step in the wrong direction.\n\nMy situation is that I am able to read Hebrew if I know what it's about, if I don't know what the Hebrew text is about I have difficulty in reading it. If I have an audio of prose or singing then its much easier for me to follow the Hebrew. Using the keyboard to enter Hebrew is very slow and if nikud are involved it's quite painful!\n\nIt seemed that to make a font fluid and natural I had to develop some new skills. Fortunately, the Internet has come to the rescue. I can listen to any part of the Old Testament and follow this in a display using my own font. I have the choice of hundreds of Israeli songs on You Tube and for almost any Hebrew song can find the lyrics in Hebrew. For many songs the Hebrew transliteration and English translation may be found.\n\nListing to a song and following the text displayed in Mike Hebrew has greatly improved the way I \"see\" the text. In particular I can now see whole words rather than letters.\n\nTo test a font I seek to choose expressive texts as much as for my enjoyment as for a technical goal. On my web site are some examples. I have about thirty texts with audio (or video) to match and am using these to improve the shape of common words and also the appearance of the entire page.\n\nMike\n\n"
    },
    {
      "time": "14 Nov 2008 — 3:03pm",
      "content": "<cite> My situation is that I am able to read Hebrew if I know what it’s about, if I don’t know what the Hebrew text is about I have difficulty in reading it. </cite>  \nSuch a \"plug-in\" is just an aid in preliminary setting of the basic spacing. It's not meant to generate texts, just to help in having strings to see how each letter's sidebearings works alongside with the others. In general, for my typefaces I do exactly as you are doing, and I entirely agree that, to properly evaluate text, you have to set something meaningful (even better if it's of particular meaning to you).  \nNonetheless I try to fine-tune the sidebearings before setting full sentences with custom strings of glyphs.\n\n"
    }
  ]
}
