{
  "id": "50673",
  "title": "How do designers draw simple maps AND respect copyright?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "G'day guys,\n\nI need to come up with some maps of continents, eg. India, Cambodia etc, for a book I'm producing and I'm wondering how designers normally go about it in the right way. Is there a good online resource with simple map outlines? can I use a few different sources and come up with a composite that doesn't rely too heavily on any of the originals? does NASA have such a thing?  \nthanks guys, I'm a bit stumped\n\n--N\n\n",
  "author": "nicholasgross",
  "time": "19 Oct 2008 — 7:11pm",
  "uid": "9500",
  "comments": [
    {
      "time": "19 Oct 2008 — 7:50pm",
      "content": "I've used [Map Resources](http://web.archive.org/web/20131018183404/http:/www.mapresources.com/) for years. Their vector maps are of very good quality. More recently, you can check out the maps at [iStockphoto](http://web.archive.org/web/20131018183404/http:/typophile.com/wiki/%20http%3A/%252Fwww.istockphoto.com/%20).\n\n"
    },
    {
      "time": "19 Oct 2008 — 8:16pm",
      "content": "Also, not related specifically to your request, but for the interest of the thread.\n\n[http://libremap.org/](http://web.archive.org/web/20131018183404/http:/libremap.org/ \"http://libremap.org/\")\n\n"
    },
    {
      "time": "19 Oct 2008 — 9:40pm",
      "content": "Thanks guys, these look like good resources. Andrew, if I use Map resources do I need to use them as is or can I modify them to suit an existing style?\n\nGenerally does anyone know if this is what designers normally do, (use stock maps) or do they composite a few different maps so that the result doesn't appear derivative? What are other people's experience? If I can figure out an option that won't cost $100 a map that would be ideal,  \ncheers\n\n"
    },
    {
      "time": "20 Oct 2008 — 5:34am",
      "content": "All maps are derivatives of geography. No one has a copyright on the lay of the land.\n\n"
    },
    {
      "time": "20 Oct 2008 — 7:14am",
      "content": "\\>\\> _All maps are derivatives of geography. No one has a copyright on the lay of the land._\n\nBut don't you think the _drawings_ of the geography themselves are copyrighted?  \nI think so.\n\n"
    },
    {
      "time": "20 Oct 2008 — 7:52am",
      "content": "\\>All maps are derivatives of geography. No one has a copyright on the lay of the land.\n\nSo all we have to do is build an island in the shape of Mickey Mouse (say in Dubai) and the global copyright empire will crumble.\n\n"
    },
    {
      "time": "20 Oct 2008 — 7:52am",
      "content": "Ha, mapmakers are very smart: they introduce very small anomalies (mistakes) into their products that will give away anyone that reproduces them.  \nBut there are some freeware maps to be had, such as  \n [http://geoatlas.com/](http://web.archive.org/web/20131018183404/http:/geoatlas.com/ \"http://geoatlas.com/\")  \n [http://www.nationalgeographic.com/xpeditions/atlas/index.html?Parent=eur...](http://web.archive.org/web/20131018183404/http:/www.nationalgeographic.com/xpeditions/atlas/index.html?Parent=europe&Rootmap=nether&Mode=d&SubMode=w \"http://www.nationalgeographic.com/xpeditions/atlas/index.html?Parent=europe&Rootmap=nether&Mode=d&SubMode=w\")  \nAnd  \n [http://www.openstreetmap.org/](http://web.archive.org/web/20131018183404/http:/www.openstreetmap.org/ \"http://www.openstreetmap.org/\")\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "20 Oct 2008 — 10:38am",
      "content": "\"But don’t you think the drawings of the geography themselves are copyrighted?\"\n\nYes.\n\n"
    },
    {
      "time": "20 Oct 2008 — 4:00pm",
      "content": "Thanks guys this is all good stuff.\n\nI'm really after pretty basic kind of political map forms -- I found a vector map from [wikipedia](http://web.archive.org/web/20131018183404/http:/en.wikipedia.org/wiki/Image:BlankMap-World.png) that seems to be OK to use, maybe I'll go with this. Do you think there are any issues with using this? I guess my concern is that the map itself is not copyrighted but it may be produced from something that is.\n\n"
    },
    {
      "time": "20 Oct 2008 — 4:21pm",
      "content": "Hey Bert,\n\nI just checked Geoatlas and it seems you have to buy Cd-Roms to get the maps  \nNational Geographic seems intended for educators not for those wanting to reproduce commercially  \nAnd if I use maps off openstreetmap I have to distribute my book free from copyright  \nhm ... still wondering what I should do...  \nthanks again\n\n"
    },
    {
      "time": "20 Oct 2008 — 4:40pm",
      "content": "As with any art, you need to read the license. In the case of the wikipedia one:\n\n-------\n\nThis image has been released into the public domain by its author, Vardion. This applies worldwide.\n\nIn some countries this may not be legally possible; if so:  \nVardion grants anyone the right to use this work for any purpose, without any conditions, unless such conditions are required by law.\n\n-------\n\n"
    },
    {
      "time": "20 Oct 2008 — 4:47pm",
      "content": "Thanks Darrel I did read the license :) so my concern is not with the map itself which is obviously not protected but with the map's source. Vardion might have traced over an atlas to produce his vector work -- it's just hard to know.\n\nHowever, I think the CIA has solved my problem (I never thought I'd get to say something like that). It has something called a factbook with lots of detailed maps which are all, apparently, in the [Public domain](http://web.archive.org/web/20131018183404/https:/www.cia.gov/library/publications/the-world-factbook/docs/contributor_copyright.html)  \nthanks for all your help\n\n"
    },
    {
      "time": "20 Oct 2008 — 9:28pm",
      "content": "Hi Nicholas, Just to echo previous responses, if you're ever in doubt of a copyright or license, the best thing is to contact the owner or provider directly. The legalese can be very complicated and it does vary from country to country. Those last maps are quite interesting but I don't know if you can modify them for your or your clients' needs. Best to check. :)\n\n"
    },
    {
      "time": "21 Oct 2008 — 4:17am",
      "content": "I have used [Mountain High](http://web.archive.org/web/20131018183404/http:/www.digiwis.com/dwi_mhm.htm?gclid=CJTy3eWNuJYCFQ6IMAodRw7KLQ) maps which do have licence requirements, but can be worked on or from and can work out expensive.\n\nTim\n\n"
    },
    {
      "time": "21 Oct 2008 — 5:26am",
      "content": "\"Vardion might have traced over an atlas to produce his vector work — it’s just hard to know.\"\n\nWell, that gets back to it being derivative of geography. Which no one (yet) holds a copyright on. Though I'm sure there are some lawyers working on that as we speak.\n\n"
    },
    {
      "time": "21 Oct 2008 — 3:50pm",
      "content": "\"if I use Map resources do I need to use them as is or can I modify them to suit an existing style? Generally does anyone know if this is what designers normally do, (use stock maps) or do they composite a few different maps so that the result doesn’t appear derivative? What are other people’s experience? \"\n\nI've purchased vector stock maps and then modified them to reflect a particular theme or illustrative style. I'm not sure if that's \"standard\" I suppose ideally it's best to have a budget and commission an artist. Even with purchased stock maps, I often just use it as a template to draw my own version which hopefully takes some of the \"stock-ness\" from the piece and gives it a more unique look.\n\n"
    },
    {
      "time": "22 Oct 2008 — 4:01pm",
      "content": "thanks Kirsten,\n\nIn a perfect world commissioning an artist would work the best, I wonder if anyone except a very small percentage do this. Just out of interest, which company do you purchase the stock maps from?\n\nI'm reasonably satisfied that these CIA maps will form a good basis for what I need. If they are in the public domain then I reckon they are fair game for style modifications.\n\n"
    },
    {
      "time": "22 Oct 2008 — 5:19pm",
      "content": "I think the fjords could be copyrighted by Slartibartfast.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131018183404/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    }
  ]
}
