{
  "id": "5068",
  "title": "My PC Handyman Logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm in the initial process of developing a logo for a friend's business, My PC Handyman. I'm looking for some concepts to work up. It's a little bit of a clunky name, but I think there's potential as well. I have considered using a toolbox theme, a more digital theme, as well as his idea of a figure carrying a computer.   \n   \nMy concern is the name and if I add a graphic that it might be distracting to the name. I'm also conerned about the 'PC' part. I don't want it to get lost and hopefully PC is interpretted properly.   \n   \nAny thoughts?   \n   \nThanks,   \nAdam\n\n",
  "author": "adamw",
  "time": "3 Jun 2004 — 11:52am",
  "uid": "3901",
  "comments": [
    {
      "time": "3 Jun 2004 — 1:28pm",
      "content": "Adam explain, your friends business. Is PC politically correct or is he a person that fixes PCs?\n\n"
    },
    {
      "time": "3 Jun 2004 — 1:42pm",
      "content": "Sorry, it's computer related\n\n"
    },
    {
      "time": "3 Jun 2004 — 2:56pm",
      "content": "I would definately create some sort of symbol to go with the name. I just finished working on a logo for a company called UPS For Less. They specialize in UPS units (uninterupted power supplies) and have nothing to do with the courier service so I had to make that clear like the problem you are having.   \n   \nAfter some advice from some people on these forums I ended up creating a simple symbol and also added a tagline below below that made it clear they were in a totaly different business.\n\n"
    },
    {
      "time": "4 Jun 2004 — 6:34am",
      "content": "Thanks Tom. I did go through your thread and the tagline does help. That is a worthy idea I will implement.   \n   \nAm I crazy to try and figure out a handyman combined with a computer-related concept? Too catchy or cliche? Toolbox or belt with a mouse or monitor or something? hmm...   \n   \nAdam\n\n"
    },
    {
      "time": "4 Jun 2004 — 6:41am",
      "content": "Adam does your friend only work on PCs or will he also work on Macs? You just said the tagline when you explained the business: hardware, software and networking services\n\n"
    },
    {
      "time": "4 Jun 2004 — 7:32am",
      "content": "\"Too catchy or cliche?\"   \n   \nThe name, itself, is just way too cliche IMHO. Not very original. It'll get lost in the plethora of computer repair shop names out there.   \n   \nBut, then again, PC repair is a pretty dry business (the old Geek Squad being perhaps THE exception).\n\n"
    },
    {
      "time": "4 Jun 2004 — 9:09am",
      "content": "Daniel, Primarily Windows, some Linux and a tiny bit Mac I'd guess.   \n   \nAdam\n\n"
    },
    {
      "time": "4 Jun 2004 — 12:02pm",
      "content": "If done right, I think some of the generic symbols could work well. As long as you stick to working with generic symbols that don't associate them selves with a certain OS, or are not parts of a computer that the average home user is not going to recognize.   \n   \nAs far as the tool box or tool belt goes, I would just make sure to implement something computer related into that too because you don't want people to see it and assume it is something construction related.\n\n"
    },
    {
      "time": "4 Jun 2004 — 1:39pm",
      "content": "Adam try incorporating the windows, linux and mac logos into a graphic with your tagline and you've got it. Don't try to overthink this one. Remember KISS, Keep it simple, smarty.   \n   \nOn another subject when you post and get the error message just go back one page and then go to topics you will see your name posted as the newest post. This server likes to tease the posters and make you post 3 times\n\n"
    },
    {
      "time": "7 Jun 2004 — 7:06am",
      "content": "The problem with generic symbols or using things like OS logos is that PC repair is already a fairly generic industry. Well, maybe that's not a problem...just an observation. I suppose you need to ask if the client is looking to sell commodity services or premier services and then approach the identity work from that perspective.\n\n"
    },
    {
      "time": "21 Jun 2004 — 2:10pm",
      "content": "Here is my design at this point. The more I worked with a graphic the busier it seemed to be. So I took a step back and decided to work with the text at thi spoint. Opinions?   \n   \n ![My PC Handyman logo](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/messages/4100/38862.jpg)\n\n"
    },
    {
      "time": "22 Jun 2004 — 6:38am",
      "content": "Looks OK, thought the 'PC' seems a bit cliche and reminds me of Tron...so it seems a bit dated.   \n   \nAlso it would seem that PC should be the emphasized part of the logo.\n\n"
    },
    {
      "time": "22 Jun 2004 — 9:05am",
      "content": "Yeah I am also not sure about the typeface on PC, as well like darrel said, PC should be emphasized as opposed to the way it is now, the black on the rest of the type is much more noticable.\n\n"
    },
    {
      "time": "22 Jun 2004 — 9:12am",
      "content": "Thanks guys. Do you have any suggestions regarding the PC font? I wanted to offset the PC from the rest and wanted to give the clue toward the type of PC. I have been working with this logo as a 2-color logo with the PC and the tagline in the same color while the My Handyman text is in another. I will need to make it work as a 1-color as well. Any thoughts about this?   \n   \nThanks again,   \nAdam\n\n"
    },
    {
      "time": "23 Jun 2004 — 12:45pm",
      "content": "I worked up some alternate logos with a different font for the 'PC'. Also expermented with some two-color applications. Thoughts or concerns?   \n   \nAdam   \n ![My PC Handyman logo](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/messages/4100/39057.jpg)\n\n"
    },
    {
      "time": "23 Jun 2004 — 10:20pm",
      "content": "\"Toolbox or belt with a mouse or monitor or something? hmm...\"   \nI think you should revisit your earlier thoughts on this logo.   \nwhat you have know seems generic and stale.   \n   \nExplore simple shape representations of toolboxes and toolbelts combined with pc handyman and see if anything pops. (of course if you already have done that - then disregard) ![:-)](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nhope that helps.   \n   \ns.\n\n"
    },
    {
      "time": "23 Jun 2004 — 10:21pm",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>\"Toolbox or belt with a mouse or monitor or something? hmm...\"   \nI think you should revisit your earlier thoughts on this logo.   \nwhat you have now seems generic and stale.   \n   \nExplore simple shape representations of toolboxes and toolbelts combined with pc handyman and see if anything pops. (of course if you already have done that - then disregard) ![:-)](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nhope that helps.   \n   \ns.\\</font\\>\n\n"
    },
    {
      "time": "28 Jun 2004 — 12:46pm",
      "content": "Well, I drew a simple toolbox and added it to the logo I had previously. Thoughts?   \n   \nThanks again,   \nAdam ![My PC Handyman logo](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/messages/4100/39437.jpg)\n\n"
    },
    {
      "time": "28 Jun 2004 — 3:30pm",
      "content": "I think the mark you created really helps to make the typography more approachable. Have you tried integrating pc or some sort of representation for the name into the mark itself? I am thinking about when it might be used alone without the wordmark. It seems like a step in the right direction, much more friendly.   \n   \n-s.\n\n"
    },
    {
      "time": "30 Jun 2004 — 6:18am",
      "content": "Adam -   \n   \nI think you are moving in the right direction with the addition of the icon. Shawn's idea is a good one. When I saw your initial concept my thought was \"Why isn't there an icon of a computer monitor in the middle of the logo with 'PC' within it?\" That incorporates the graphic/name into one concise image - rather than looking as if the icon was just slapped up against the name as an afterthought. Another option might be to make your toolbox graphic look like a computer monitor with the addition of the screen shape on the side of an elongated toolbox.   \n   \n- J.   \n   \n:: :: :: :: :: :: ::   \n   \nJeff Fisher :: Engineer of Creative Identity   \nJeff Fisher LogoMotives   \n   \n:: :: :: :: :: :: ::   \n   \nMember -   \nHOW Magazine Editorial Advisory Board   \n   \nMember -   \n2005 HOW Design Conference Advisory Board   \n   \nAuthor -   \n\"The Savvy Designer's Guide to Success: Ideas and tactics for a killer career\" - to be released by HOW Design Books in late 2004. Pre-sale available now at [http://www.savvydesigner.com](http://web.archive.org/web/20131017130624/http:/www.savvydesigner.com/)  \n   \n:: :: :: :: :: :: ::\n\n"
    },
    {
      "time": "1 Jul 2004 — 6:25pm",
      "content": "I agree about the addition of the icon to the logo. Perhaps even an implementation of a mouse with the tool box or something to represent the pc side of things. A mouse is something standard like a monitor that dosn't associate itself with a particular OS or area of computer work as well.\n\n"
    },
    {
      "time": "2 Jul 2004 — 2:12pm",
      "content": "Thanks again one and all. This forum has been very helpful. I just did this version below before reading Jeff's and Tom's remarks. I still may take a look at the monitor idea. I had one awhile ago and I will revisit it up.   \n   \nAdam ![My PC Handyman logo](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/messages/4100/39853.jpg)\n\n"
    },
    {
      "time": "2 Jul 2004 — 2:20pm",
      "content": "VERY much an improvement. Now how will the logo relate to the wordmark? Also on the wordmark, the PC seems out of place and almost feels like it was stretched, not sure if you are set in stone with that.   \n   \ngood work.   \n   \ns.\n\n"
    },
    {
      "time": "2 Jul 2004 — 2:47pm",
      "content": "Here is a rough draft from Jeff's ideas.   \n   \n ![My PC Handyman logo](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/messages/4100/39856.jpg)\n\n"
    },
    {
      "time": "2 Jul 2004 — 2:49pm",
      "content": "Shawn, can you explain what you wrote a little more to me, please. I'm not sure I'm following you completely.   \n   \nThanks.   \nAdam\n\n"
    },
    {
      "time": "2 Jul 2004 — 2:59pm",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>Sorry about being confusing, it happens on friday sometimes.   \n   \nAll i really meant was with the logo that has the mouse - it seems to be placed really close to the my pc handyman.   \n   \nI was also wondering if you had thought about how the combination might work when a vertical orientation was necessary. Of course a vertical orientation might never be necessary, but if it is its always better to have an option, rather than seeing your client squish it in word or something.   \n   \nhope that made more sense, by the way is it beer-thirty yet?   \n   \ns.\\</font\\>\n\n"
    },
    {
      "time": "2 Jul 2004 — 4:23pm",
      "content": "I really like the execution of the mouse idea. The first monitor one looks nice but i don't think it communicates \"computer\" as well as the mouse does, just because the shape of the monitor isn't as recognizable.   \n   \nI would definately keep fiddling around with the mouse and toolbox icon with different arrangements of text. Like Shawn said maybe a vertical arrangement.   \n   \nOther then that I agree this is a big improvement, looking forward to seeing it.\n\n"
    },
    {
      "time": "3 Jul 2004 — 9:58am",
      "content": "I do agree that the mouse image works very well (and that it may be a bit too close to the name). With the combined toolbox/monitor image I think having the monitor on the end of the toolbox results in the monitor image being too small. If you were going to use such an element, I think having the monitor on the larger side of the toolbox would make it work better and would allow it to still \"read\" as what you intend in smaller sizes. It's great to see the evolution of your concept.   \n   \n- J.   \n   \n:: :: :: :: :: :: ::   \n   \nJeff Fisher :: Engineer of Creative Identity   \nJeff Fisher LogoMotives   \n   \n:: :: :: :: :: :: ::   \n   \nMember -   \nHOW Magazine Editorial Advisory Board   \n   \nMember -   \n2005 HOW Design Conference Advisory Board   \n   \nAuthor -   \n\"The Savvy Designer's Guide to Success: Ideas and tactics for a killer career\" - to be released by HOW Design Books in late 2004. Pre-sale available now at [http://www.savvydesigner.com](http://web.archive.org/web/20131017130624/http:/www.savvydesigner.com/)\n\n"
    },
    {
      "time": "3 Jul 2004 — 3:46pm",
      "content": "Thanks for all the feedaback. I appreciate the critique and it is helping me push the design along. I will work on the placment and vertical variation as well. You're right, I might need somewhere down the line.   \n   \nAny color ideas/suggestions/opinions at this point? I really only have experimenting with color combos at this point. I'm curious if any really catch anyone's eye to date?   \n   \nI will explore these things when I get back to my working files on Tuesday. I'm just about out of time on this project I think, so I'm hoping to wrap it up by the end of next week.   \n   \nThanks,   \nAdam\n\n"
    },
    {
      "time": "7 Jul 2004 — 6:00am",
      "content": "Well, here is the final design. I m not completely sold on the color usage but we can always alter that later. I think he's very happy with it, so that makes me happy as well. BTW, I am now co-owner of the business too!   \n   \nI did move the mouse and toolbox away from the text a little, made the mouse a two button instead of three and increased the negatve space on the left edge on the front side of the toobox.   \n   \nI am also beginning to think we may be able to use the icon all by itself at some point and in certain situations down the line. We'll see.   \n   \nI want to thank everyone for all their ideas, encouragment and comments.   \n   \nAdam   \n ![My PC Handyman logo](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/messages/4100/40074.jpg)\n\n"
    },
    {
      "time": "8 Jul 2004 — 6:08am",
      "content": "Now we're working on a 8' x 3' illuminated sign. The below are our two options I am looking at. Both are in proportion. Any thoughts?   \n   \nAdam   \n   \n ![My PC Handyman logo](http://web.archive.org/web/20131017130624im_/http:/www.typophile.com/forums/messages/4100/40173.jpg)\n\n"
    },
    {
      "time": "8 Jul 2004 — 6:27am",
      "content": "What happened to that\n\n"
    }
  ]
}
