{
  "id": "50692",
  "title": "Basic Alphabet teaching for children?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "There are different letter drawing teaching techniques for children such as the Zaner-Bloser and D’Nealian methods. Some character formations are unique to different languages and countries such as the 7 with or without a slash or a q that has a curled tail vs. straight. Are there any good resources for some of these basic learning alphabets for young children in languages such as Arabic and Hebrew and even Ukrainian & Slovenian where the local preference in teaching character formation in learning to write is explained?\n\n [‹ Traffic System Typefaces](http://web.archive.org/web/20081024203643/http:/typophile.com/node/39661 \"Go to previous forum topic\") [Student Help \\*Franklin Gothic ›](http://web.archive.org/web/20081024203643/http:/typophile.com/node/50700 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081024203643/http://typophile.com/user/1334\" title=\"View user profile.\">kegler</a>",
  "time": "<br>",
  "uid": "1334",
  "comments": [
    {
      "time": " 20.Oct.2008 6.35am",
      "content": "i would grab some primers, either for child learners or for students for whom these might be second languages. I have some great textbooks for Russian, but I’m sure one could find these in a decent sized library for the languages for which you are seeking. i tried to look at primers to find regional preferences for languages that use Devanagari script and found these to be useful resources when i could find them.\n\n"
    },
    {
      "time": " 20.Oct.2008 6.43am",
      "content": "Additionally, it may be hard to find certain models for letter drawing techniques. When i was learning Russian, we only ever did script writing excercises and were never formally taught to write in block letters, i’m guessing this would be similar to the experience of most young students learning to write in countries which use the cyrillic alphabet. Anything I might say about Arabic would be mostly guess work, but I would think that teaching of the relation between initial/medial/final forms would be an important aspect in teaching the basics of the script to new learners.\n\n"
    },
    {
      "time": " 20.Oct.2008 7.22am",
      "content": "Thanks Paul. I was going to ask you directly since this is an extension of a project you know well. If anyone knows of any online resources, this quest is on behalf of a client. I would be interested to know if anyone has compiled a “localized pre-school” alphabet chart?\n\n"
    },
    {
      "time": " 20.Oct.2008 7.26am",
      "content": "sounds like a good master’s thesis, or maybe even a PhD \\>^p\n\n"
    },
    {
      "time": " 20.Oct.2008 10.55am",
      "content": "Hi Richard,\n\n<cite>some character formations are unique to different languages and countries</cite>\n\nthat’s quite the topic I am exploring in my Manuscribe project. It’s about researching international school scripts and the ‘dialects’ of handwriting – I held [a presentation at last year’s ATypI](http://web.archive.org/web/20081024203643/http:/florian.hardwig.com/manuscribe/index.html#atypi-2007) about it.  \nFor my master’s thesis, I focussed on Latin script only. However, I do have some copybook samples and the like in other scripts aswell, Cyrillic at least.\n\n<cite>if anyone has compiled a “localized pre-school” alphabet chart?</cite>  \nYes, there is a [poster](http://web.archive.org/web/20081024203643/http:/flickr.com/photos/hardwig/1359668869/in/photostream/) – Latin only. Ken Barber made use of it while doing research for the [culture-specific character sets](http://web.archive.org/web/20081024203643/http:/www.houseind.com/index.php?page=showfont&id=665&subpage=studio_how_lang) in his Studio Lettering fonts.\n\nYou can contact me via _forename_@_surname_.com\n\nFlorian\n\n"
    },
    {
      "time": " 20.Oct.2008 2.39pm",
      "content": "I knew you would read this.&nbsp;&nbsp;:)\n\n<cite>Ken Barber made use of it while doing research for the culture-specific character sets in his Studio Lettering fonts.</cite>\n\nInteresting!\n\n"
    }
  ]
}
