{
  "id": "5071",
  "title": "(x) Lexus Park Place - custom, Caslon 540, Nobel {Yves, Marc O}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Please ID the two fonts in this logo for \"Park Place\" and \"Lexus\".   \n   \nThanks   \n   \n   \n   \n ![logo](http://web.archive.org/web/20050516224104im_/http:/www.typophile.com/forums/messages/83/37469.jpg)\n\n",
  "author": "dsyoohoo",
  "time": "Thu, 2004-06-03 13:25",
  "uid": "3903",
  "comments": [
    {
      "time": " Thu, 2004-06-03 13:44",
      "content": "Yves:   \n   \nThanks for your help. That was quick. The closest I've found for the \"P\" is Script 33, but the Caslon 540 italic is right on.\n\n"
    },
    {
      "time": " Thu, 2004-06-03 15:04",
      "content": "Can anybody identify the sans serif font used on their web site?   \n   \n [http://www.lexus.com/](http://web.archive.org/web/20050516224104/http:/www.lexus.com/)   \n   \nI thought Avenir but the x-height is wrong, as are some characters. It's very nice.\n\n"
    },
    {
      "time": " Thu, 2004-06-03 15:14",
      "content": "Looks like Neutraface, from House Industries.   \n   \n [http://houseind.com/house.php?kit=NEUTRAFACE-FO](http://web.archive.org/web/20050516224104/http:/houseind.com/house.php?kit=NEUTRAFACE-FO)   \n   \n(When Rich Roat from House gave a presentation here in Phoenix, I learned that it's pronounced \"noy-trah,\" not \"new-trah\" as I had previously believed. And, yes, I can hear all of you German/Dutch speakers laughing.)\n\n"
    },
    {
      "time": " Thu, 2004-06-03 15:16",
      "content": "That post really fits your photo, Yves. :-)\n\n"
    },
    {
      "time": " Thu, 2004-06-03 15:21",
      "content": "Not to sound picky, but it's not quite Neutraface either. Look at the cap A and the numbers. It's not as quirky. And I do love Neutraface however you pronounce it.\n\n"
    },
    {
      "time": " Thu, 2004-06-03 15:22",
      "content": "Hmm, you may be right, Patricia. My other suggestion would be one of the Nobels, perhaps a version from Font Bureau or Dutch Type Library.\n\n"
    },
    {
      "time": " Thu, 2004-06-03 15:41",
      "content": "Yep, I think you called it. I really gotta get my hands on those Nobels. I was heartbroken to learn that the Guggenheim font was custom, and Nobel was the closest I could find to that.\n\n"
    }
  ]
}
