{
  "id": "50724",
  "title": "Type Specimen Posters",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hey guys,  \nI got this project in my type class to create a type specimen poster for two different fonts. I think they turned out pretty nice. What do you guys think of them? Sorry if it doesn't go here.\n\nThank you,  \nRskate2\n\n| Attachment | Size |\n| --- | --- |\n| [Baskerville.png](http://web.archive.org/web/20130824221355/http:/typophile.com/files/Baskerville.png) | 587.45 KB |\n| [Helvetica.png](http://web.archive.org/web/20130824221355/http:/typophile.com/files/Helvetica.png) | 236.8 KB |\n\n",
  "author": "Rskate2",
  "time": "20 Oct 2008 — 8:12pm",
  "uid": "35783",
  "comments": [
    {
      "time": "20 Oct 2008 — 9:05pm",
      "content": "Hi Rskate2  \nThe Posters come along nicely, just a few things\n\nThe Baskerville Poster  \nThe letterspacing of the title seems to be a bit odd.  \nCheck the last three lines on the lefthand column.  \nThe bottom two's letterspacing is pretty tide  \nwhere as the third one is loose.  \n(same with the word Baskerville's, third line down)\n\nThe Helvetica Poster  \nThe space between the H and the elvetica  \nseems to be a bit big.  \nThe text needs some more tracking, all a bit tide.  \nCheck Erik Spiekermann' s name, the last n.\n\nJörg\n\n"
    },
    {
      "time": "20 Oct 2008 — 10:34pm",
      "content": "At the risk of being rude, what's going on with your copy on the Baskerville poster? It reads like text auto-translated from another language.\n\n\"The Baskerville typeface is the result of John Baskerville's intent to improve upon the types of is William Caslon. He increased the contrast between thick and thin strokes, making the each serifs sharper because more tapered, and shifted the axis of rounded letters to a more vertical position. The curved strokes are more circular shape, and the characters.\"\n\nThe right hand side fares better because it's just a quote from the typowiki, but there's the random phrase \"a larger series\" in the middle of the italicized text, in roman face.\n\nAesthetically, it looks like a reasonable homage to the period, but I agree that the letterspacing could use attention.\n\nBefore you fix anything visually, though, figure out what happened to your text and fix that. A nice-looking poster that presents no useful information isn't a design, it's just a piece of art.\n\nI was about to point out problems with the copy on the helvetica one too, but then I realized they were both just lifted from wikipedia (although something went weird in your copy/paste for Baskerville). You need to either pick a source with an actual editor or write something yourself that makes sense.\n\n"
    },
    {
      "time": "20 Oct 2008 — 10:59pm",
      "content": "Not meaning to jump down your throat, I just see this all the time from my classmates — word for word, typo for typo, reproductions of the wiki. I don't know, maybe everyone else has too little time.\n\n"
    },
    {
      "time": "3 Nov 2008 — 7:40am",
      "content": "no, uppercaseH:\n\nyou make good points. First thing I thought when I saw Baskerville was that there was something up with the title. Then I thought, for a second, \"maybe it's just because it's not meant as a header text...maybe it's because I've possibly never seen it so big\" but then I snapped out of it. It looks odd, even the stroke weight looks a little off, but that could be me, who knows.\n\nAs for using a quote, even in a poster there should be some reference as to where it came from. I mean this could be a quote from anywhere, you will get more merit if you cite your source when using a quote. (Doesn't have to be full citation of course, but something) I doubt wiki address will get your much merit.\n\nThe design of the Baskerville is coming along, good color. I do like the \"Q\" in the background, just because it adds some texture, but why is it there? Does it serve a purpose to the poster?\n\nAnd a very small thing that is bugging me, near the bottom...the \"Jj\" looks a lot bigger than the \"Aa\". I think it might be partially because the J is sticking out. It might help to bring it inland, just a little. I mean 1 or 2 picas. (depending on how big this poster actually is)\n\nSorry if this sounds nit picky, but if you have a good start, why not make it a solid piece you can be proud of? :)\n\ncourtney\n\n"
    },
    {
      "time": "3 Nov 2008 — 10:58pm",
      "content": "No its fine uppercaseH I agree that I should of wrote something original for the copy on both pieces. Its just my teacher didn't ask for personal written copy, and I was feeling a little lazy I guess lol. But I will defiantly change it so something original.\n\nI really likes the Q in the background, I think it gave it some character. It is there because Baskerville was one of the first to Extend The Q-Tail, so I was trying to emphasize his motives.\n\nThe Jj does seem to look bigger, but its the same point size. It could be looking bigger because the flush left with the Aa and also its thinner and longer that the Aa also. What could I do to fix this issue?\n\nThanks for the comments guys,  \n Rskate2\n\n"
    },
    {
      "time": "5 Nov 2008 — 4:32pm",
      "content": "Yea, I figured they were the same point size. Try just moving it in a bit (to the right) Keep moving it in until it's visually balanced, I think you have enough of an eye to tell when that is. It will probably only be a few picas...very minimal.\n\nAnd I agree about the Q in the background, like I said, I like it there...it adds some depth. Maybe the new original type that you write, you can add the fact that Baskerville was one of the first fonts to extend the tail of the Q?\n\ncourtney\n\n"
    }
  ]
}
