{
  "id": "5080",
  "title": "Stanislav Marso Information request",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi All.   \nwhile reading \"Schriftkunst\" by Adolf Kapr I found an interesting piece of type, by an obviously czech designer called Stanislav Marso - the Marsuv Grotesk. I was searching through google but couldn't find anything further than his name for about three times nor could I find any digital piece of his work.   \n   \nSo you're my last chance. Has anyone round here Information about this guy and his typefaces - maybe I was just too stupid to find something that is too obvious (Maybe the type is now common under another name or something).   \n   \nI'm sure someone in here can help me.   \n   \nServus   \n   \nDominik\n\n",
  "author": "golfomat",
  "time": "4 Jun 2004 — 2:04am",
  "uid": "2323",
  "comments": [
    {
      "time": "4 Jun 2004 — 9:53am",
      "content": "Hopefully Filip Blazek will come to your rescue - I'll let him know.   \n   \nIn the meantime you could check issue #7 (page 13) of his wonderful TYPO magazine: it contains a short paragraph about Mar\n\n"
    },
    {
      "time": "4 Jun 2004 — 10:11am",
      "content": "Hrant is right. The only digital typeface from Stanislav Marso (1910-1975) is RePublic by Brousil. Marso was an employee of Grafotechna, Czech metal type foundry. There are even more typefaces created by him, but you can only find them in old Czech books on type and in some past issues of Typografia magazine. Typografia is a Czech magazine for printers and typographers since 1888; it is now published by son of Mr Marso.\n\n"
    },
    {
      "time": "4 Jun 2004 — 10:47am",
      "content": "BTW, I have this massive, old-school specimen book done by Oldrich Hlavsa\\* for ITC (not mine - on loan from Gerald Lange) - it's called \"Typographia 2\", put out in 1981, and the last 50 pages or so focus on Czech designs. And there are a couple of Mar\n\n"
    },
    {
      "time": "4 Jun 2004 — 4:36pm",
      "content": "Hrant,   \nIs that book available?   \n   \nChris\n\n"
    },
    {
      "time": "4 Jun 2004 — 5:15pm",
      "content": "I got \"mine\" from the UCLA library, but bookfinder.com is showing multiple copies, from $60 to $650. It also seems to be showing those magazines Filip mentioned, as well as that huge specimen book I mentioned. Just enter \"Hlavsa\" for author and browse.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Jun 2004 — 1:29am",
      "content": "Thanks Hrant and Filip.   \nThat was about what I imagined. I think I gonna try to make a revival of that beauty. I'm not quite sure if it'll work, but trying can't be a mistake. I have some time off in August, so i'll start then.   \nI'm sure there is someone with similar efforts anywhere, because this is not a specimen I found in the back of an old bookshop. I mean it was in a pretty popular book.   \nThere is definitely a lack of popularity for this face. Which, I think, It should definitely earn.   \n   \nDown there the spec I saw first (and now am in love with)   \n ![Marsuv Grotesk](http://web.archive.org/web/20131019145100im_/http:/www.typophile.com/forums/messages/30/37595.gif)   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "5 Jun 2004 — 10:40am",
      "content": "\"I think I gonna try to make a revival of that beauty.\"   \n   \nWhat sorts of permissions are required in making a revival like this? (Either of the design or the name?)\n\n"
    },
    {
      "time": "7 Jun 2004 — 1:58am",
      "content": "is it just me or does that marsuv grotesk look about 20 years ahead of its time? wow.\n\n"
    },
    {
      "time": "7 Jun 2004 — 2:04pm",
      "content": "Victor,   \nPlease do make a revival. It is one I would want.   \n   \nChrisL\n\n"
    },
    {
      "time": "7 Jun 2004 — 2:14pm",
      "content": "I think Dominik is the one you have in mind. (Though I do agree with you -- it's a beauty.)   \n   \nI just wanted to know what was the proper procedure if you wanted to make a revival of old hot metal fonts.   \n   \nNames, I assume, will still generally have copyright protection and so there must be legal hurdles there.   \n   \nBut what about the design itself?   \n   \nVictor\n\n"
    },
    {
      "time": "8 Jun 2004 — 6:04am",
      "content": "Thanks for the support guys and sorry for not tuning in a while.   \n   \nI haven't spent a single thought on the legal issues yet.(Thanks, Victor, for that hint, how naive can one be, doh!)   \nBut that would be something I sould surely check before starting something like this. It was more of a heart to arm decision than thought about very well. (I don't know if this was idiomatic but I hope the picture delivers)   \n   \nFor me the whole thing should be fun at first.I didn't have any commercial issues in background. To be able to sell something like that, I'd surely need to have the original metal. Since I'm surely not able to pay for these, the aspect of making money with it is out of play.   \n   \nI don't really know it from original source, but at least in the U.S. it seems to be only the name is under copyright protection. How else so many derivates for popoular fonts would have been developed. (I don't tell no company names).   \n   \nI'll check about the legal issues. But it would be a pity if this shouldn't work.   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "8 Jun 2004 — 6:43am",
      "content": "For the record: Typeface names are protected by \\*trademark,\\* not copyright -- two different sorts of intellectual property protection. You can't copyright a name, but you can trademark it. Trademarks can and do become abandoned when they are not active in commercial use for a certain period of time. The specifics will probably vary from jurisdiction to jurisdiction.   \n   \nOne should consult with a trademark attorney or expert before deciding that an old trademark has been abandoned.   \n   \n-- K.\n\n"
    },
    {
      "time": "8 Jun 2004 — 9:25am",
      "content": "\\> I'm surely not able to pay for [the original metal]   \n   \nYou don't need to own the metal to digitize it. You just have to find somebody who has some of it (at key sizes, assuming they did optical scaling), and collaborate.   \n   \nPlus it's not impossible to revive something lacking the metal: especially in a \"constructed\" face such as this, good prints might be enough.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jun 2004 — 9:54am",
      "content": "Thanks, Kent. Are there are any similar issues regarding the design itself?   \n   \nI ask because I wondered about starting such a project myself (with other old faces that were never digitized), and didn't know.   \n   \nBest, Victor\n\n"
    }
  ]
}
