{
  "id": "50816",
  "title": "Best way to move objects from Freehand to InDesign?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi all.\n\nI would like to post a question.  \nWhat is the best way to “move” vector drawings (sometimes with images), from freehand to Indesign?\n\nI’ve tried the following:\n\n1. Basic “copy paste”  \n2. Export as eps and import into Indesign  \n3. Build a pdf, and open in InDesign  \n4. Use Illustrator as a “buffer” between the two apllications using “copy paste” method.\n\nDidn’t get any conclusions and i still have problems mainly in files with images.  \nHow can i preserve all atributtes such as color, stroke width, fonts, image size and position, etc.\n\nThanks in advance  \nRegards\n\n [Strange behaviour in MM-project ›](http://web.archive.org/web/20081024060956/http:/typophile.com/node/50786 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081024060956/http://typophile.com/user/17987\" title=\"View user profile.\">kiko</a>",
  "time": "<br>",
  "uid": "17987",
  "comments": [
    {
      "time": " 23.Oct.2008 5.54am",
      "content": "You can copy and paste between Illustrator and Freehand!? Didn’t know you could do that.\n\nFreehand has serious issues doing anything Adobe related, your on the right lines using illustrator as bridge between the two though. Have you tried exporting your freehand file as an illustrator 7.x file, and then opening that in illustrator? You should be able to find something inDesign friendly that way.\n\nGood luck, and much respect for holding up the freehand quarter!\n\n"
    },
    {
      "time": " 23.Oct.2008 3.37pm",
      "content": "<cite>You can copy and paste between Illustrator and Freehand!?</cite>\n\nYes you can, at least from FH11 to Illustrator CS3. The oposite it’s way much different, triyng to paste something into freehand from any adobe apllications it’s aparently impossible! Right now i’m having trouble even in pasting things from FH to photoshop. Freehand can be a pain sometimes.\n\n<cite>Have you tried exporting your freehand file as an illustrator 7.x file, and then opening that in illustrator?</cite>\n\nI didn’t try that one, perhaps it will help.\n\nThanks for your reply\n\n"
    }
  ]
}
