{
  "id": "50826",
  "title": "Cyrillic characters in inDesign / anyone can help?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello dear typophiles, can you help?  \nI setting a book in FF Quadraat. Some parts of the text are in Russian, so i purchased the cyrillic version of the font (Cyrillic, Postscript). The cyrillic glyphs do not appear in inDesign when i apply the font to the Russian text. I tried to go through TextEdit - it does not work. Please do not tell me that i will have to replace every cyrillic glyph via glyphs palette!\n\n",
  "author": "<a href=\"/web/20101216074800/http://typophile.com/user/38816\" title=\"View user profile.\">Latham</a>",
  "time": "<br>",
  "uid": "38816",
  "comments": [
    {
      "time": "",
      "content": "The text you are using is proably Unicode encoded. You should have bought an OpenType Pro version of the font that includes Cyrillic, not a PostScript font which doesn't support Unicode.\n\n"
    },
    {
      "time": "",
      "content": "Hi Ralf, thanx for your reply. FontFont sells Quadraat in either PostScript or TrueType (Win) format. I ve got PostScript cause I am working on a mac. The characters do not map my keybord, even if I switch to Russian in International Settings. Why a cyrillic version of the font is practically of no use?\n\n"
    },
    {
      "time": "",
      "content": "you might try contacting FontShop directly with your problem.\n\n"
    },
    {
      "time": "",
      "content": "It would be helpful to know the exact version numbers of Mac OS X and InDesign that you are using, and also the file modification date of the FF Quadraat files. How does your text get into InDesign? Do you copy it, and if so from what source (e.g. Word Document, plain text file ...)\n\nIt should work, I tried it and can type with FF Quadraat Cyrillic in InDesign using the Russian keyboard layout, and apply the font to Russian text that I copy from the web.\n\nBy the way, TrueType fonts are also OpenType fonts, and not restricted to Windows. You can use them on any recent Mac OS as well.\n\n"
    },
    {
      "time": "",
      "content": "Try pasting your text in word, and do a word import from InDesign.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20101216074800/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    }
  ]
}
