{
  "id": "50835",
  "title": "Personal logo design",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’ve been playing with this for a while now and I keep going round and round in circles. I hate designing for myself, because I’m so flipping indecisive. Can anyone give me some guidance on any of these logos for me. It’s for my freelance design business.\n\nCheers in advance\n\nJames\n\n| Attachment | Size |\n| --- | --- |\n| [jv.jpg](http://web.archive.org/web/20081027182916/http:/typophile.com/files/jv.jpg) | 78.5 KB |\n\n [‹ Social investment project](http://web.archive.org/web/20081027182916/http:/typophile.com/node/50851 \"Go to previous forum topic\") [Logo Critique \\> Please HELP ›](http://web.archive.org/web/20081027182916/http:/typophile.com/node/50714 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081027182916/http://typophile.com/user/38178\" title=\"View user profile.\">jimijazz</a>",
  "time": "<br>",
  "uid": "38178",
  "comments": [
    {
      "time": " 23.Oct.2008 10.49am",
      "content": "The first one in the second row is the most compelling - it’s clean and sharp and will adapt well to any application. You could use the jv on its own as a graphic device too if you wanted.\n\nThe first row has that difficulty with the kerning of ’vi’ which is quite distracting. The other two look unbalanced to me - the rounded join in the third row looks forced, and awkward!\n\n—  \nAegir\n\n"
    },
    {
      "time": " 23.Oct.2008 10.52am",
      "content": "i lean more toward No. 8, but with a bit more of the name treatment like No. 6 (but smaller in relation to the circle).\n\n"
    },
    {
      "time": " 23.Oct.2008 2.39pm",
      "content": "That’s the trouble with the initials J and V. They just don’t sit well together.\n\n"
    },
    {
      "time": " 23.Oct.2008 2.42pm",
      "content": "“i lean more toward No. 8”\n\n#8 sort of looks like ’dv’.\n\n"
    },
    {
      "time": " 23.Oct.2008 3.14pm",
      "content": "_#8 sort of looks like ’dv’._\n\nor ’W’.\n\nI’d stay away from the slab serifs in row 2 - they bring to mind collegiate sports, where ’JV’ = junior varsity.\n\nI like row three, because the letters wind up looking a bit like a scribble, which fits with creative design. Though I keep seeing an N or M in the V.\n\nThe logos in rows 3 and 4 seem so different in personality: which one is more like you?!\n\n"
    },
    {
      "time": " 23.Oct.2008 3.26pm",
      "content": "“The logos in rows 3 and 4 seem so different in personality: which one is more like you?!”\n\nNo idea - I like both of them equally but in different ways - I like the neatness and even weight of the line in row 3, but then I like the hand drawn feel of 4; it just depends on the mood I’m in at the time.\n\nHow do you guys design for yourselfs? I find it a real struggle!\n\n"
    },
    {
      "time": " 23.Oct.2008 11.12pm",
      "content": "I vote row 2, or row 4 with some tweaking to make the letters more legible.\n\n- Lex\n\n"
    },
    {
      "time": " 23.Oct.2008 11.21pm",
      "content": " ![](http://web.archive.org/web/20081027182916im_/http:/typophile.com/files/jv_4717.jpg)\n\n ![](http://web.archive.org/web/20081027182916im_/http:/typophile.com/files/images_5973.jpeg)\n\n"
    },
    {
      "time": " 23.Oct.2008 11.30pm",
      "content": "wanted to post the image in the thread to make critiques a bit easier.  \ngood group of logos so far. Some slight nitpicking:\n\nrow 1: The j and t need to be narrowed at the loop maybe? Or maybe eliminate the loop on the t  \nor cut it?  \nOptically, the t feels like it’s too high, like it’s tiptoeing on the baseline.\n\n ![](http://web.archive.org/web/20081027182916im_/http:/typophile.com/files/jv2_5228.jpg)\n\nrow 2: classy, could work. Or people might perceive Junior Varsity, as mentioned.\n\nrow 3: the V feels wide in relation to the J ... and seems to rise too high to the right.  \ndifficult to decipher JV at first glance\n\nrow 4: snazzy work on this row, but maybe too close to Walden Media?\n\n"
    },
    {
      "time": " 24.Oct.2008 1.30am",
      "content": "Thanks for the comments people. I was having a play last night and I think I’ve cracked it - I’m probably going to go for a variation on the bottom row. I’ll remove the circle and just have the JV bleeding off the edge of the page, business card or whatever. I’ll post here when I’ve done it.\n\nAs for the Junior Varsity comments, I doubt that will be an issue here in the UK, unless I go global all of a sudden!\n\n"
    },
    {
      "time": " 24.Oct.2008 4.16am",
      "content": "last pair is by far the most original of the four. But change the top of J if you don’t want it to read d. You’re removing the circle to differentiate it from Walden Media. Good. But just removing maybe won’t work. Show us the results.\n\nGreat work anyway.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 24.Oct.2008 4.50am",
      "content": "Just been working on it. I can’t believe the tiny tiny changes to a curve you have to make to see the biggest changes in a shape! Designing fonts would drive me crazy!\n\nAnyway, latest 2 versions are attached, let me have it!\n\n ![](http://web.archive.org/web/20081027182916im_/http:/typophile.com/files/JV2_5414.jpg)\n\n"
    },
    {
      "time": " 24.Oct.2008 10.49am",
      "content": "Second one is better but it could still be emphasized a bit more on top of J to make it more distinctive. And Maybe loosen up the line weight at the end of v.\n\nBut it’s nice. I can see how you’re going to push it into the edge.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 24.Oct.2008 1.41pm",
      "content": "maybe if you gave the ’j’ more of a beginning stroke to serve as a ’point of entry’ into the mark... right now, it feels like we’re coming in in the middle of the thought. but i like where you’re going.\n\n"
    },
    {
      "time": " 24.Oct.2008 1.44pm",
      "content": "you might even solve the ambiguity by placing the “dot” atop the ’j’...\n\n"
    },
    {
      "time": " 24.Oct.2008 5.10pm",
      "content": "I like this, I’d prefer some work on the “J” to make it read more as a “J”. Right now I’m not sure what it is, could be an “a” could be a “d”, and that’s with knowing it should be a J.\n\nAnd just a side note...jimijazz - Clash fan?\n\n"
    },
    {
      "time": " 24.Oct.2008 5.41pm",
      "content": "“maybe if you gave the ’j’ more of a beginning stroke to serve as a ’point of entry’ into the mark”\n\nAny chance you could explain a little bit what you mean here? I don’t think I’ll be dotting the J as I like the simple continuos line and wouldn’t want to add to it.\n\nAs for the Clash - yup, I like them, and I play guitar too and like Hendrix, hence the spelling. It was a nickname given to me by some mates years ago and it stuck!\n\n"
    },
    {
      "time": " 25.Oct.2008 7.37pm",
      "content": "What you’ve got going now is the best of a set of good work.\n\nAs mentioned, I’d shave the right arm of the v a bit, as it seems  \ntoo bulky in contrast to the left arm/left portion of the mark.\n\ncheers!\n\n"
    }
  ]
}
