{
  "id": "50833",
  "title": "You thoughts on this monogram",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hey guys,\n\nIt's been a while I haven't posted anything here.  \nTime to grow back into old habits.  \nI'm currently designing this monogram for a photograph.  \nThis is still a work in progress but I would love your thoughts on this one while I'm trying to build some kinda balance and \"excitement\" to it.  \nEach letter has, of course, been entirely, designed from scratch.\n\nMany thanx in advance.\n\nVirginie\n\n[www.fluonoir.com](http://web.archive.org/web/20130823170320/http:/www.fluonoir.com/ \"www.fluonoir.com\")  \nformerly [www.drduckling.com](http://web.archive.org/web/20130823170320/http:/www.drduckling.com/ \"www.drduckling.com\")\n\n ![](http://web.archive.org/web/20130823170320im_/http:/typophile.com/files/ishot-224_5272.jpg)\n\n",
  "author": "drduckling",
  "time": "23 Oct 2008 — 8:53am",
  "uid": "14086",
  "comments": [
    {
      "time": "23 Oct 2008 — 1:07pm",
      "content": "Not really inspiring, I guess ? :/\n\n"
    },
    {
      "time": "23 Oct 2008 — 2:03pm",
      "content": "The first thing that struck me is the unevenness of the S. The bottom is pretty round, the top is a bit flattened, and the inner curves are a bit squarish. And the stroke (especially in the bottom half) needs to be smoothed out. It's narrow in the cross bar, then gets really fat, then thins out a bit, then gets a little fatter, then gets thin (thinner than the end at the top, which seems odd).\n\nThe K, even though I see that the lines are vertical, feels like it's leaning to the right. I think because the counter is narrower on the bottom than on the top.\n\n"
    },
    {
      "time": "24 Oct 2008 — 4:28am",
      "content": "Yes you're right.  \nThank you for your input.  \nAs I said, I'm at the very begining of this design, although I'm really happy with the overall aspect of the K, the S is still a nightmare…  \nDunno if the G works either.  \nTrying to define a driection right now.  \nI'm not sure of I should design S on the same \"architecture\" than the other letters ?\n\n"
    },
    {
      "time": "27 Oct 2008 — 3:20pm",
      "content": "I think I'm on to something here, what do you think ?\n\n ![](http://web.archive.org/web/20130823170320im_/http:/typophile.com/files/ishot-228_3820.jpg)\n\n"
    },
    {
      "time": "27 Oct 2008 — 5:44pm",
      "content": "I like the impression the \"s\" shape gives but it needs more refinement - I think the terminal \"bulges\" don't blend in well enough. It looks too arbitrary and not natural enough.\n\n"
    },
    {
      "time": "28 Oct 2008 — 4:15am",
      "content": " ![](http://web.archive.org/web/20130823170320im_/http:/typophile.com/files/ishot-2_6243.jpg)\n\n"
    },
    {
      "time": "28 Oct 2008 — 4:21am",
      "content": "Better isn't it ?\n\n"
    },
    {
      "time": "28 Oct 2008 — 4:37am",
      "content": " ![](http://web.archive.org/web/20130823170320im_/http:/typophile.com/files/ishot-6_3928.jpg)\n\n"
    },
    {
      "time": "12 Nov 2008 — 11:20am",
      "content": "I think the subtle camera idea is strong.  \nIt bothers me that the verticals in the K and G are all such different widths.\n\n"
    },
    {
      "time": "20 Nov 2008 — 5:03pm",
      "content": "I don't think the last two are going to work as a \"monogram\" A wordmark maybe? But I think that you could make it a ton cleaner with more time and guides through illustrator. Try investing some more time and see where you get. I am not set on that typeface at all either. Sorry. I agree with eliason that the K and G bother me.\n\n"
    },
    {
      "time": "23 Nov 2008 — 9:01pm",
      "content": "all three letters look really bad... k and g don't go with the s at all... you are also putting all the emphasis on the s... which is like a middle name or something right? The k and j look like mid 90s experimental faces in the worst way. I'd start fresh.\n\n[www.cotdamn.com](http://web.archive.org/web/20130823170320/http:/www.cotdamn.com/ \"www.cotdamn.com\")\n\n"
    },
    {
      "time": "3 Dec 2008 — 10:46am",
      "content": "What style are you trying to achieve? Classic or modern?  \nI see potential for the \"S\" to be wrapped around the \"K\" and \"G\"\n\n"
    },
    {
      "time": "11 Dec 2008 — 2:00am",
      "content": "Oh my !  \nSorry guys, haven't seen your posts until now.  \nWell, seems I did a pretty bad job here… Shit.  \nI think I'll (re)start from scratch or something.  \nThanx anyway for all your inputs.\n\n"
    }
  ]
}
