{
  "id": "5083",
  "title": "Graffiti & typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Cholo hand styles... To Daniel's comments this style has its history in Southern California Mexican gang graffiti. Artist, Giant (above in this thread) is really good at this style. I'll look for some examples   \n   \n ![Z Boys](http://web.archive.org/web/20131021190438im_/http:/www.typophile.com/forums/messages/30/38210.jpg)   \nThis flick is from the movie DogTown/Z Boys. Anyone see that. Brilliant!   \n   \nAnd an interpretation of that same handstyle by a New York writer with a typographic alias.   \n ![serif](http://web.archive.org/web/20131021190438im_/http:/www.typophile.com/forums/messages/30/38211.jpg)\n\n",
  "author": "c_acker",
  "time": "12 Jun 2004 — 3:44pm",
  "uid": "715",
  "comments": [
    {
      "time": "12 Jun 2004 — 3:48pm",
      "content": "\\> i just thought it would be fun   \n   \nMy own apportionment of illegal activity leaves no room for graffiti at the moment, sorry. :-)   \n   \n\\> lets not get too theoratical.   \n   \n?   \n   \n\\> give me an example of a rule in graffiti.   \n   \nHow should I know? But that doesn't mean I can believe there are none. For example, isn't \"coding\" broad a rule? Sure, it can be broken, but that's true in any field. Then there's the stylistic rules mentioned.   \n   \n\\> were do you think graffiti and typography DO overlap?   \n   \nA nice theoretical question. :-)   \nThey overlap at the level of individual black forms. But typography is different because of its abstraction - like \"default\" spacing; while lettering is different because of its contextualization - like doing something special when you have an \"LA\" sequence (although increasingly typography is engulfing this). And what lettering and calligraphy share (which typography doesn't have) is that the forms are \"heuristic\", not predetermined\\*. Calligraphy and typography share very little. And there's something else: of the three, only typography can be truly immersive, the other two are essentially display-centric (although in some instances -like a well-penned manuscript- it's hard to see that).   \n   \n\\* \"Random\" fonts are deceptive - because of what Johnny von Neumann said.   \n   \n\\> do you think a typographer can become better in typography after seeing graffiti? and vice versa?   \n   \nYes.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jun 2004 — 4:02pm",
      "content": "But Hrant, all early tyeface designs were based upon calligraphy. I've heard some historians claim that all type had origins in calligraphic forms well up until Bodoni really abstracted the forms toward a new direction of what design has become with the early moderns. Garamond is obviously based upon calligraphic forms. Transitional faces became more intelectualized maybe but the forms still have root in the way one writes a Latin majuscle and all italics of this period are based in humnist miniscule. Surely you can't deny a link, even if we have ventured farther from it as time has gone on.\n\n"
    },
    {
      "time": "12 Jun 2004 — 4:13pm",
      "content": "Not only is calligraphy (better: \"chirography\") at the source of virtually all historic type designs, it's still the largest \"school of thought\" in contemporary type design! I'm certainly not denying its relevance (and usefulness in terms of formal analysis), but I do think that in the realm of theory the actual overlap is minimal. Gutenberg for example imitated scribes in order to \"trick\" readers into buying his stuff. To me that says nothing about the true nature of typography, of what it _needs_.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jun 2004 — 4:33pm",
      "content": "Ok, I'll take the bait, what does typography (type design) need?\n\n"
    },
    {
      "time": "12 Jun 2004 — 5:18pm",
      "content": "That's the big question, isn't it? :-)   \nI certainly don't know - but I do have one big conviction: that it's to serve the reader. But of course that's a multi-faceted thing itself. I think the important thing is not to get too wrapped up in your expressive abilities/desires, otherwise you're moving towards selfish art.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jun 2004 — 5:28pm",
      "content": "The essence of Typography is communication.   \nThe essence of Aereosol Art is an extra coded form   \nof visual communication, it is on another semantical   \nlevel, and behaviors are different too, so it is also   \npragmatically different.   \n   \n\\> here's is a good question-   \n\\> were do you think graffiti and typography DO overlap?   \nWhy do you like to take photos of your pieces?   \n   \n\\> if a writer started designing fonts,   \n\\> would his graff career help him?   \nNo, I don\n\n"
    },
    {
      "time": "12 Jun 2004 — 6:17pm",
      "content": "\\>I think the important thing is not to get too wrapped up in your expressive abilities/desires, otherwise you're moving towards selfish art.   \n   \nOh Hrant, you disapoint me, we were so close and you seemed to have made an abrubt left turn. I thought you were starting to see the value in graffiti. Selfish is bad art for sure, but all art starts with a personal interprative starting point, even design, even typography. No matter your opinion on Carson, he champions an important idea- Legibility does not equal communication.   \n   \nMy wife is an actress, and one of the similiarities I find between our training and our professions is that we are both communicators. For sure, the audience must be able to understand our message, but to move your audience as an actor is more than just speaking loudly and clearly, I feel the same for my work as a designer. The appropriate choice of type within a given project is like an actor being able to convincingly speak in a given accent. It can add great depth to the audiences' perception of the content, or it can ruin it.   \n   \n   \n\\> you have to study what people have done   \nbefore and you can\n\n"
    },
    {
      "time": "12 Jun 2004 — 6:36pm",
      "content": "Well, I am sorry to disappoint you. But I wasn't leading you on or anything.   \n   \nI just think that most people benefit more when a person uses his abilities to improve communication between others (like in typography) than when he merely shares his personal expressions (like painting his name on a wall). But if a graffiti artist lends his skills to expressing some important social commentary, then I personally think that's great.   \n   \nNow, I do believe that Art is an integral part of life, and no human can or should try to supress his expression, but when that becomes the _objective_, the world gains very little. It's wasteful. On the other hand, people have different natures, and you can't force somebody to be very useful to many other people, at least not without making him miserable - and misery is contagious.   \n   \n\\> Legibility does not equal communication.   \n   \nOf course. But ignoring legibility is anti-design. Carson for example is an artist. I think the world needs more \"servants\" now, not more looking in the mirror.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jun 2004 — 6:53pm",
      "content": "\\>I just think that most people benefit more when a person uses his abilities to improve communication between others (like in typography) than when he merely shares his personal expressions (like painting his name on a wall)   \n   \nI can respect that, and in most cases agree. However, I have been speaking to the value of graffiti as a practice of creating letterforms, not necessarily the act of defacing public spaces.   \n   \n\\>I think the world needs more \"servants\" now, not more looking in the mirror.   \n   \nI agree, and think this is great idea, but it will obviously manifest itself in different ways, as we are all artists to some degree. You can embrace that. You don't have to use that word with such disgust :-)\n\n"
    },
    {
      "time": "12 Jun 2004 — 7:10pm",
      "content": "\\>the funny thing, nick, is that ive met some writers who think alot like you. they belive that graffiti should be legible all the time.   \n   \nItay, if they think that graffiti should be legible at all times, they are most definitely NOT thinkin glike me.   \nI was merely pointing out that graffiti and typography are very very different.   \n   \nRemember you started the thread with:   \n\\>i think graffiti is a peak in typography and caligraphy's history.   \n   \nI'm just saying that graffiti has nothing to do with typography, and to claim that it is a wonderful part of typography is absurd. In fact, it's the opposite of typography!   \n   \nAs many people have pointed out in the thread (Alessandro most eloquently) they are differsnt -- graffiti is more like WORDMARKS and LOGOs.   \n   \nTypographic design is about a system of glyphs that can be combined in different sequences.   \n   \nCalligraphy has this in common with type: both used for long text.   \n   \nYou would be more accurate to claim that graffiti is a peak in PAINTING's history -- it's more Jackson Pollock than Matthew Carter.   \n   \nHowever, I can imagine that in the future, digital type could enable more fluid, bio-mimetic forms of expression which would bring it closer to graffiti, and allow for that influence.   \n   \nFor instance, Frank Jonen's type with \"bit depth\", enabling the tonal variety of calligraphy, fused with some kind of LettError datastream-driven Knuth meta-font, could better capture the vitality of graffiti, which is presently killed by the media at the typographer's disposal.\n\n"
    },
    {
      "time": "12 Jun 2004 — 11:42pm",
      "content": "On what rules there are in graffiti, you guys have mentioned one of them yourselves: Style, when you do something in a certain style, you follow visual rules of the style.   \n   \nI meant that typography (setting one chunk of word after another) doesn't have anything to do with graf. Type design, on the other hand has loads to do with graffiti.   \n   \nWell, Itay K, I'm in on this challenge, how would you go about it? I suggest a new thread.\n\n"
    },
    {
      "time": "13 Jun 2004 — 5:41pm",
      "content": "kenn, you can join a handstyle battle in the 12oz forum.. (?)   \n [http://www.12ozprophet.com/forum/showthread.php?s=&postid=1687107#post1687107](http://web.archive.org/web/20131021190438/http:/www.12ozprophet.com/forum/showthread.php?s=&postid=1687107#post1687107)\n\n"
    },
    {
      "time": "15 Jun 2004 — 11:40am",
      "content": "Howdy Y'all,   \n   \nChristian has been doing a great time holding it down for HANDSELECTA... I'm on vacation so I haven't been a part of the discussion.   \n   \nCOPE2 was the one arrested. Very interesting if ya know anything about him. He also just had a book-signing in Williamsburg, Brooklyn about 2 weks ago. I wonder if that has anything to to with why the Vandal Sqaud has made their move now, were they tipped off about Cope being in the yeards?... But that's another story, another thread on another website... like 12oz... Here's a link: [http://www.sohh.com/thewire/read.php?contentID=5818](http://web.archive.org/web/20131021190438/http:/www.sohh.com/thewire/read.php?contentID=5818) I haven't asked around for more info, bc, like I said I am on vacation...   \n  \nTo my knowledge, Os Gemeos (trans: the twins) are from San Paolo, Brasil. Check out [http://www.lost.art.br/osgemeos.htm](http://web.archive.org/web/20131021190438/http:/www.lost.art.br/osgemeos.htm)   \n   \nWhen I get back, I promise to both Christian and all Typophile users to do my homework, read the posts and be involved.   \n   \nKyle Talbott   \nHANDSELECTA\n\n"
    },
    {
      "time": "17 Jun 2004 — 2:54pm",
      "content": "\\> or maybe its rap? :]   \n   \nOn a related note (athough a really late response) the new Beastie Boys record has a typographic reference...   \n   \n\"So watcha' want, so watcha' need, I got the fonts, you wanna read.\"   \n   \nOnly the Beastie Boys would boast about something like that... I love graffiti. But I actually find that it loses a lot of character when its all spruced up for a publicly sanctioned project. There are a lot of those in DC. And while quite wonderful, I always imagine the artists just trying to get it over with... Sort of like when a band such as Green Day puts out a record that is supposed to be \"punk\", but it sounds too good to be anywhere near the vicinity of punk. Let alone the fact that their records are deemed \"appropriate\" or \"acceptable\". Well, I suppose one could say it's not really graffiti anymore when it's commissioned...   \n   \nAnybody know the origin of the word \"graffiti\" ?\n\n"
    },
    {
      "time": "17 Jun 2004 — 3:12pm",
      "content": "According to John Ayto's \"Dictionary of Word Origins\", it doesn't come from the Greek gr\n\n"
    },
    {
      "time": "17 Jun 2004 — 3:13pm",
      "content": "From Latin \"graphium\" ('graffio' in Italian), \"scratch\";   \nfrom Greek \"graphion\" (meaning the stilo to cut the wax tablets).   \nRelated to hard nib and the scratch sound.   \nOne of the best Italian hip-hop dj is DJ Gruff.\n\n"
    },
    {
      "time": "17 Jun 2004 — 3:34pm",
      "content": "DJ Gruff   \n [http://www.italianrap.com/artists/artists\\_bios/djgruff/](http://web.archive.org/web/20131021190438/http:/www.italianrap.com/artists/artists_bios/djgruff/)   \n   \nPane   \n [http://www.panetrv.com/](http://web.archive.org/web/20131021190438/http:/www.panetrv.com/)   \n [http://www.whystyle.com/](http://web.archive.org/web/20131021190438/http:/www.whystyle.com/)\n\n"
    },
    {
      "time": "17 Jun 2004 — 5:06pm",
      "content": "\\< [http://www.mcgruff-safe-kids.com/](http://web.archive.org/web/20131021190438/http:/www.mcgruff-safe-kids.com/)\\>   \n ![McGruff](http://web.archive.org/web/20131021190438im_/http:/www.typophile.com/forums/messages/30/38591.jpg)\n\n"
    },
    {
      "time": "18 Jun 2004 — 3:38am",
      "content": "He hee! Funny that McGruff doggy mascot!   \n   \nHave a look to this site, [http://www.jardingalerie.org/](http://web.archive.org/web/20131021190438/http:/www.jardingalerie.org/)   \nA web site dedicated to showcasing children's art   \nacross cultures and highlighting art's essential   \nrole in development, education and communication.   \nTake a look at the work below from the past three   \nyears we've been on-line. Our website consists of   \ntwo parts: Exhibitions & The Galerie.\n\n"
    },
    {
      "time": "20 Jun 2004 — 7:16am",
      "content": "\\>it's the plural of the Italian \"graffito\", which means scratching!   \non my vication to NYC last year i saw alot of scrachitti on the trains' windows. some local ex-writer called UN told me that now that they dont do trains in york, they started doing scrachitti on them.\n\n"
    },
    {
      "time": "20 Jun 2004 — 7:16am",
      "content": "\\>it's the plural of the Italian \"graffito\", which means scratching!   \n   \nHa! Interesting etymological connection to one of the other four elements of hip-hop, DJing.   \n   \n(the 4 being: MCing, DJing, graffiti, breakdancing)\n\n"
    },
    {
      "time": "21 Jun 2004 — 6:28am",
      "content": "As far as my faulty memory goes, graffiti was the   \nscratching of political slogans, election promises and   \ngeneral advertisements on public buildings/tombs in   \nRome. Guess that the hook reference comes from the   \ntool used for the job. Still it would be frowned on by the   \npatricians (the rich class in Roman society) mainly   \nbecause the tombs were their family members (plebs   \nbeing thrown into the Cloaca Maxima, Tiber or dungheap).   \nTim\n\n"
    },
    {
      "time": "21 Jun 2004 — 7:19am",
      "content": "You have a good memory Mr. Tim Daly!   \nHow old are you? ![:-)](http://web.archive.org/web/20131021190438im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n [http://www.estovest.net/tradizione/yinyang\\_en.html](http://web.archive.org/web/20131021190438/http:/www.estovest.net/tradizione/yinyang_en.html)   \n   \n+   \n   \nThese (graffiti rupestri) are also called \"graffiti\",   \nbut as you know they are from thousands years before:   \n [http://www.cun-italia.net/dipinti-graffiti/dipinti-graffiti.htm](http://web.archive.org/web/20131021190438/http:/www.cun-italia.net/dipinti-graffiti/dipinti-graffiti.htm)   \n [http://www.bresciainvetrina.it/bresciaturismo/valcamonica\\_arterupestre.htm](http://web.archive.org/web/20131021190438/http:/www.bresciainvetrina.it/bresciaturismo/valcamonica_arterupestre.htm)   \n   \nLike this path \"la strada megalitica,\" for instance,   \nby the the sea near Genova (it was relaxing warm and fresh).   \nAnna found a very nice stone.   \nThat path is special, it was a magic path, it leads to a bunch   \nof stones used to do something, he hee, what an explanation! ![:-)](http://web.archive.org/web/20131021190438im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nWell, those stones face a small mountain, the path is about 2400   \nyears old and it is related to 21 June (funny posting!), this day,   \nwhen the sun sets, the rays are straight on the path.   \nI got to know that Indians had this form of art where they made   \na path on the ground and from the sky above you can see that those   \nlines/paths are in a form of an animal figure.   \nScientists say that when the indians walked along those paths   \nthey could \"see\" or comprehend or feel the animal it was...   \nhorse, whale etc.   \nSo walking along a path is also a spiritual experience a way   \nwe can make ourselves to relate to the nature, universe and ourselves...   \nI wish la strada megalitica my spiritual path...   \n ![La Strada Megalitica](http://web.archive.org/web/20131021190438im_/http:/www.typophile.com/forums/messages/30/38841.jpg)\n\n"
    },
    {
      "time": "21 Jun 2004 — 2:36pm",
      "content": "...as you know they are from thousands years before:   \n [http://www.cun-italia.net/dipinti-graffiti/dipinti-graffiti.htm](http://web.archive.org/web/20131021190438/http:/www.cun-italia.net/dipinti-graffiti/dipinti-graffiti.htm)  \n   \nAlessandro,   \nThis one looks like things from Von Danighan's(SP?) book \"Chariots of the Gods\"   \n   \nChrisL\n\n"
    },
    {
      "time": "22 Jun 2004 — 12:35am",
      "content": "Alessandro, not quite old enough to know any of the culprits.   \nI missed the solstice celebrations at Stonehenge   \n   \n [http://www.bbc.co.uk/religion/religions/paganism/festivals/summer\\_solstice.shtml](http://web.archive.org/web/20131021190438/http:/www.bbc.co.uk/religion/religions/paganism/festivals/summer_solstice.shtml)   \n   \nSomewhere I have some pictures (as usual I cannot   \nfind them when I want them) of scratched figures on a rock   \nin the Saudi desert of hunting scenes and human figures.   \n   \nTim\n\n"
    },
    {
      "time": "22 Jun 2004 — 10:52am",
      "content": "Hey, it looks like there are as many people   \nphotographing graffiti as there are photographing   \nlettering/signage. Could Typophile host an online   \ngraffiti gallery too? I have more and more photos   \nevery year; there are some very talented underground   \nletterers here in the Bay Area.   \n   \nPersonally I find there's a huge range of quality in graffiti: some art, some dog-pee. Not all of it is criminal or destructive.   \n   \nMaybe some of us who   \nrelish theorizing about graffiti could get together at   \nTypeCon and try it out on some warehouse walls.....   \nPut a spraycan where your mouth is! ;)\n\n"
    },
    {
      "time": "22 Jun 2004 — 10:52am",
      "content": "Hey, it looks like there are as many people   \nphotographing graffiti as there are photographing   \nlettering/signage. Could Typophile host an online   \ngraffiti gallery too? I have more and more photos   \nevery year; there are some very talented underground   \nletterers here in the Bay Area.   \n   \nPersonally I find there's a huge range of quality in graffiti: some art, some dog-pee. Not all of it is criminal or destructive.   \n   \nMaybe some of us who   \nrelish theorizing about graffiti could get together at   \nTypeCon and try it out on some warehouse walls.....   \nPut a spraycan where your mouth is! ;)\n\n"
    },
    {
      "time": "22 Jun 2004 — 11:14am",
      "content": "![](http://web.archive.org/web/20131021190438im_/http:/www.typophile.com/forums/messages/30/38994.jpg)\n\n"
    },
    {
      "time": "16 Jun 2004 — 4:50pm",
      "content": "_Moderator's   \nNote:   \n   \nIf you add a   \nreturn into   \nyour post it   \nwill wrap   \nnicely and not   \nrequire people   \nto scroll end-   \nlessly.   \n   \nOf course,   \nthe alternative   \nis to crop your   \nimages to a   \nnice 600px   \nwide. But   \nthat's too   \nlate now._\n\n"
    },
    {
      "time": "16 Jun 2004 — 5:23pm",
      "content": "To counter Gerald, I have to say that there are definitely   \noccasions (in some parts of SF's Mission District to name one)   \nwhere graffiti is the only urban renewal an area can hope to get.   \nThere is even sanctioned (commissioned may be the wrong   \nword) graffiti in these areas with the hope that people won't   \ntag over it.   \n   \nThe real difference is between graffiti and tagging. Tagging   \nis usually scrawled quickly and is very often ugly. For example,   \nthe stuff posted by Christian Acker on Saturday, June 12, 2004 -   \n11:35 am is tagging and is interesting to study, but only makes   \nthe urban landscape ugly.   \n   \nThe stuff posted by Itay K on Saturday, June 05, 2004 - 11:28 am   \nis the stuff I'm talking about.\n\n"
    },
    {
      "time": "30 Jun 2004 — 10:16pm",
      "content": "Carl, regarding the Bay Area, I dig the PERCEPT stuff. It's everywhere and it's always different.   \n   \nA quick googling yields: [http://www.pushby.com/tomas/img/photos/percept-mission.jpg](http://web.archive.org/web/20131021190438/http:/www.pushby.com/tomas/img/photos/percept-mission.jpg)   \n   \nAnd: [http://www.monkeyview.net/id/357/graffiti/percept.vhtml](http://web.archive.org/web/20131021190438/http:/www.monkeyview.net/id/357/graffiti/percept.vhtml)\n\n"
    }
  ]
}
