{
  "id": "50843",
  "title": "Looking for a free screen font. Any sugestions?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello to all.\n\nI’m looking for a free font to use in a portfolio pdf for screen display. It will be set in aprox. 9pt size over a 595x595 px page. And I want it to be readable without having to zoom in on text.  \nDoes anyone have any suggestions? I’m trying to avoid using system fonts like verdana or Tahoma, a pixel font could also work, it just have to be free and well suited to display on screen. It doesn’t need to perform well in running text, as I’ll only use a couple of lines with maybe 5/6 words each.\n\nAny suggestions will be greatly appreciated.\n\nThanks in Advance\n\n [‹ Favorite magazine masthead (logo-type) Battle Royal](http://web.archive.org/web/20081028162636/http:/typophile.com/node/27504 \"Go to previous forum topic\") [hairline typeface ›](http://web.archive.org/web/20081028162636/http:/typophile.com/node/18439 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081028162636/http://typophile.com/user/17987\" title=\"View user profile.\">kiko</a>",
  "time": "<br>",
  "uid": "17987",
  "comments": [
    {
      "time": " 23.Oct.2008 4.22pm",
      "content": "By screen font do you mean bitmap? How about Underware’s [Unibody](http://web.archive.org/web/20081028162636/http:/www.underware.nl/site2/index.php?id1=unibody&id2=overview)?\n\n"
    },
    {
      "time": " 23.Oct.2008 5.26pm",
      "content": "Thanks for you sugestion, it’s certainly an option!\n\nIt doesn’t need to be a bitmap font. It just has to “look good” on screen at small sizes.  \nIt will be displayed in a pdf not in a website, the point size in a pdf will actually look smaller than in a html file.\n\n"
    },
    {
      "time": " 23.Oct.2008 5.33pm",
      "content": "Howdy!\n\nOne of my favorite screen fonts is Trebuchet. You should check it out, it is quite legible at 9pt, it works in larger sizes as well. As far as I know it’s free too.\n\n- JK\n\n"
    },
    {
      "time": " 23.Oct.2008 7.08pm",
      "content": "When pdfs open they rarely open at 100%.\n\nIt’s one of the pitfalls pdfs.\n\nKeep this in mind if you choose a pixel font as they look terrible when not displayed at 100% (or 200%,300%...).\n\nIf you do choose a pixel font (which I suggest you don’t) FFF have some good cheap ones here: [http://www.fontsforflash.com/](http://web.archive.org/web/20081028162636/http:/www.fontsforflash.com/ \"http://www.fontsforflash.com/\")\n\n"
    },
    {
      "time": " 23.Oct.2008 10.14pm",
      "content": "You know what looks inexplicably good at very small sizes on-screen? Rotis. Specifically the Sans Bold, IIRC. Tracked loose.\n\n\\> When pdfs open they rarely open at 100%.\n\nSo there’s no way to force it?\n\n—\n\nIf you do need a pixelfont please check this out too:  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20081028162636/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    },
    {
      "time": " 23.Oct.2008 10.35pm",
      "content": "Jason Kottke’s [**Silkscreen**](http://web.archive.org/web/20081028162636/http:/kottke.org/plus/type/silkscreen/) is available for free, but read through his FAQ, in which he explains that the font looks best when set in 8 point multiples (8 pts., 16 pts., etc.).\n\n"
    },
    {
      "time": " 24.Oct.2008 5.22pm",
      "content": "Thanks to all for your interesting suggestions.\n\nRegards\n\n"
    },
    {
      "time": " 25.Oct.2008 9.04am",
      "content": "You can set the default display size for a pdf using Acrobat I think in file\\>properties. It can show at 100% or fit to screen amongst other options.\n\n"
    },
    {
      "time": " 26.Oct.2008 9.24pm",
      "content": "Just type it in Helvetica Bold in one size.\n\n"
    },
    {
      "time": " 26.Oct.2008 9.30pm",
      "content": "Ken, for the sake of argument (and motivated by the location details in your profile), I will assume you’re serious, and suggest that you sign up for my typeface design evening course at Art Center (in the Spring) where I can spend all the time necessary explaining why Helvetica (at any weight and size\\*) shouldn’t be touched with a ten foot composing stick.\n\n\\* Except maybe the hairline weight at a few hundred point.\n\nhhp\n\n"
    },
    {
      "time": " 28.Oct.2008 6.48am",
      "content": "Hrant, don’t feed the [Helvetitroll](http://web.archive.org/)!\n\n“Since I was 8 years old I had no other desire _then_ graphic design.”\n\nProofreading wasn’t a desire then? ;-)\n\n"
    }
  ]
}
