{
  "id": "50849",
  "title": "blurring typeface",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m looking for a specific typeface for a logo concept that I have.\n\nThe concept involves letters which are blurred and a plug symbol that represents/stands instead of letter “o”. Typeface I’m looking for should not be like Nevil Brody’s typeface Blur which infact has solid edges but it needs to be really blurred with blurred edges (because it needs to be in contrast with the solid plug symbol and also visible at small logo sizes). I guess there isn’t such typeface so I’m looking for type which is :\n\n1. propper for blurring (so the letters don’t melt in a way one wouldn’t be able to read it)  \n2. target audience is between 23 and 40 years of age, mostly women.  \n3. The type should probably match plug symbol in some way(???)  \n4. The client we’re designing logo for is a center for active creating of life that the person will love so the keywords connected to the project include: initiative, energetic, human, optimism, creative, life loving. Should represent a center which help people achieving that.\n\nThe photo of our idea is attached. I’m only looking for a different typeface.\n\n| Attachment | Size |\n| --- | --- |\n| [h2.jpg](http://web.archive.org/web/20081025121105/http:/typophile.com/files/h2.jpg) | 25.18 KB |\n\n [‹ Help with non-English glyphs](http://web.archive.org/web/20081025121105/http:/typophile.com/node/50867 \"Go to previous forum topic\") [Real free script font? ›](http://web.archive.org/web/20081025121105/http:/typophile.com/node/50795 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025121105/http://typophile.com/user/37579\" title=\"View user profile.\">Dot</a>",
  "time": "<br>",
  "uid": "37579",
  "comments": [
    {
      "time": " 24.Oct.2008 4.57am",
      "content": "[http://www.myfonts.com/fonts/bomparte/subliminal/](http://web.archive.org/web/20081025121105/http:/www.myfonts.com/fonts/bomparte/subliminal/ \"http://www.myfonts.com/fonts/bomparte/subliminal/\")\n\nthere should be more fonts that do this, or you would think you could do this type of thing fairly easily in illustrator. anyone got any tips on how?\n\n"
    },
    {
      "time": " 24.Oct.2008 4.58am",
      "content": "[http://www.myfonts.com/fonts/066font/bloor/](http://web.archive.org/web/20081025121105/http:/www.myfonts.com/fonts/066font/bloor/ \"http://www.myfonts.com/fonts/066font/bloor/\")\n\n"
    },
    {
      "time": " 24.Oct.2008 5.16am",
      "content": "As a font is a vector file you can’t have an actual blurred typeface, only the appearance of blurring using a halftone screen as in Paul’s examples.\n\nNick Cooke\n\n"
    },
    {
      "time": " 24.Oct.2008 5.18am",
      "content": "Thank you, but I actually need smooth and subtle blur. These typefaces are too harsh and somehow feel cheapish if you know what I mean. I think the solution lays in just slightly blurring regular typeface in Photoshop. I’m not sure myself. I need to achieve blur as in “dream”. Check the file attached.\n\n"
    },
    {
      "time": " 24.Oct.2008 5.19am",
      "content": "Maybe I’m reading this wrong, but didn’t the original poster ask for a font that would be _suitable for blurring_ (instead of having an inherent blurred appearance)? That would probably mean, what, wide, large counters, uh … somebody help me out here :-)\n\nEDIT: OK, too late ;-)\n\n"
    },
    {
      "time": " 24.Oct.2008 5.22am",
      "content": "Nick- it’s only for a logo- check this one,I don’t know who’s logo it is but It functions normaly and it also has this blur effect that’s achieved in Photoshop probably...or wherever.\n\n ![](http://web.archive.org/web/20081025121105im_/http:/typophile.com/files/spinner_4963.jpg)\n  \nTheblur I need is a little different but still it’s not vector logo.\n"
    },
    {
      "time": " 24.Oct.2008 5.31am",
      "content": "this is the blur I need...this is our logo..I only need different type that follows all I wrote in first post.\n\n ![](http://web.archive.org/web/20081025121105im_/http:/typophile.com/files/h2_5856.jpg)\n\n"
    },
    {
      "time": " 24.Oct.2008 11.15am",
      "content": "As a strategy, perhaps Clearview?\n\n"
    }
  ]
}
