{
  "id": "50840",
  "title": "New Watchmen Poster - What are your thughts?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have been following this forum for a while now and have never posted anything...\n\nSo... I found the new poster and wanted to get opinions on what everyone thought.\n\nHere is the link if the attachment does not work.\n\n[http://www.slashfilm.com/wp/wp-content/images/watchmenteaserposter21.jpg](http://web.archive.org/web/20081028162630/http:/www.slashfilm.com/wp/wp-content/images/watchmenteaserposter21.jpg \"http://www.slashfilm.com/wp/wp-content/images/watchmenteaserposter21.jpg\")\n\n| Attachment | Size |\n| --- | --- |\n| [watchmenteaserposter21.jpg](http://web.archive.org/web/20081028162630/http:/typophile.com/files/watchmenteaserposter21.jpg) | 272.33 KB |\n\n [‹ Styling leaders in Indesign](http://web.archive.org/web/20081028162630/http:/typophile.com/node/50828 \"Go to previous forum topic\") [Appropriate use of the ampersand ›](http://web.archive.org/web/20081028162630/http:/typophile.com/node/12426 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081028162630/http://typophile.com/user/17415\" title=\"View user profile.\">Rizzo</a>",
  "time": "<br>",
  "uid": "17415",
  "comments": [
    {
      "time": " 23.Oct.2008 2.07pm",
      "content": "It’s interesting how teaser posters tend to be more interesting than the final one-sheets. This is a pretty striking and compelling design that really hints at the content of the film. But I’ll bet a pitcher of Delerium Tremens that when this film is in theaters the one-sheet will just be the title, disclaimers, credits, and a few headshots poorly Photoshopped together.\n\n"
    },
    {
      "time": " 23.Oct.2008 2.20pm",
      "content": "Tight-set Futura XB... stickin’ to the classics, baby! (tho i don’t like it quite so scaled horizontally).\n\nThe Happy-face/blood-drip icon is so good (& well-known), but i wonder if they’re killing it by showing it so many new (CG) ways?\n\n"
    },
    {
      "time": " 23.Oct.2008 6.49pm",
      "content": "Don’t like the text set on the building at all. Whole composition seems strange and off balance.\n\n"
    },
    {
      "time": " 23.Oct.2008 7.10pm",
      "content": "glad they’re sticking with the classic yellow logotype from the book. brand loyalty !  \nagree that the perspective type above seems off somehow. could have gone straight across the top.\n\ngenerally striking, though. as a fan of the book i’m looking forward to this. so far the visual identity of the movie looks very impressive, with some layouts matched faithfully from the original drawings.\n\nB+ for poster design, A- for brand identity.\n\n"
    },
    {
      "time": " 23.Oct.2008 9.09pm",
      "content": "I can’t help it, whenever I see text mapped to a curtain walling grid, I always think of [North by Northwest](http://web.archive.org/web/20081028162630/http:/www.youtube.com/watch?v=Qbg089yT31g), to the detriment of what I’m looking at.\n\n"
    },
    {
      "time": " 23.Oct.2008 11.53pm",
      "content": "this version, eek\n\n ![](http://web.archive.org/web/20081028162630im_/http:/typophile.com/files/watch1_6712.jpg)\n\n"
    },
    {
      "time": " 23.Oct.2008 11.54pm",
      "content": "seeing this huge on banners at ComicCon reinforced how crummy the C looks when they eliminate the overshoot(s). In several versions of the logo, the bottom of the C awkwardly sits on the baseline and overall, the C appears smaller than the other letters. (the poster above notwithstanding)\n\n"
    }
  ]
}
