{
  "id": "50845",
  "title": "font featured in grafik magazine, also used by Wired Magazine for section headings",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello does anyone know what is the name of the display font that has been featured in GRAFIK magazine (couple of issues ago) and is used by Wired Magazine for section headings (starting with the last issue - Oct 2008)?\n\nI do not have the sample of the font, but the characters are created using conical gradients...\n\nThanks\n\n",
  "author": "<a href=\"/web/20111228172659/http://typophile.com/user/38849\" title=\"View user profile.\">flamboyant</a>",
  "time": "<br>",
  "uid": "38849",
  "comments": [
    {
      "time": "",
      "content": "You need to post a sample if you want people to help you.\n\nGrafik's house font is Avant Garde. It's a great mag in my opinion.\n\n"
    },
    {
      "time": "",
      "content": "Unfortunately no sample...\n\nThe font is NOT used by Grafik... it was featured in their \"Typo Showcase\" section...\n\nI was hoping that someone who picked up the latest issue of Wired would be able to identify it...\n\nIf not, I will get a copy of Wired tomorrow and scan a sample...\n\n"
    },
    {
      "time": "",
      "content": "Here's a shaky picture from the latest (Nov. 2008) issue of \"Wired\".\n\n ![](http://web.archive.org/web/20111228172659im_/http:/typophile.com/files/conical_6714.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Yes... Thank you Ricardo... this is exactly what I am looking for ... so anyone? What font and where to buy it?\n\n"
    },
    {
      "time": "",
      "content": "It's a custom job made for the sections 'start', 'test' and 'play'. The creator was was introduced with some text and info in the magazine when they started using it a couple of issues ago. I can post info later, when I get home.\n\n"
    },
    {
      "time": "",
      "content": "It's made by megawatt designer Mario Hugo.\n\n[http://www.spd.org/2008/07/mario-hugo-gets-wired.php](http://web.archive.org/web/20111228172659/http:/www.spd.org/2008/07/mario-hugo-gets-wired.php \"http://www.spd.org/2008/07/mario-hugo-gets-wired.php\")\n\n"
    },
    {
      "time": "",
      "content": "It's made by megawatt designer Mario Hugo.\n\n[http://www.spd.org/2008/07/mario-hugo-gets-wired.php](http://web.archive.org/web/20111228172659/http:/www.spd.org/2008/07/mario-hugo-gets-wired.php \"http://www.spd.org/2008/07/mario-hugo-gets-wired.php\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks, I was certain I saw the full character set featured in GRAFIK magazine... I guess I assumed it was a font. thanks a million for your assistance...\n\n"
    }
  ]
}
