{
  "id": "50846",
  "title": "Modern magazine fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone, my first post here so hello :-)\n\nI am a magazine designer in the UK and am interested in what are the most popular magazine fonts at the minute.\n\nI have been researching on the internet but am finding it hard to find out the most current fonts people in this industry are using, if anyone could make any suggestions i would be very grateful!!\n\nThanks everyone\n\n [‹ Type setters apron -](http://web.archive.org/web/20081025121050/http:/typophile.com/node/50855 \"Go to previous forum topic\") [A wonderful pop-up typo book from France ›](http://web.archive.org/web/20081025121050/http:/typophile.com/node/50735 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025121050/http://typophile.com/user/38856\" title=\"View user profile.\">DaniDixon</a>",
  "time": "<br>",
  "uid": "38856",
  "comments": [
    {
      "time": " 24.Oct.2008 2.18am",
      "content": "Here is what I can think of right now.\n\nThe free UK magazine Shortlist is pretty much only using Benton Sans from Font Bureau.\n\nBritish GQ is using Sebastian Lesters Soho, Berthold Akzidens Grotesk (and a serif).\n\nGQ (US) is using Titling Gothic from Font Bureau as well as a few others for features etc.\n\nEsquire US is using Mercury (Hoefler and Frere Jones) and Christian Schwartz’ Stag and Stag Sans.\n\nSorry that links aren’t included. Busy at work. You can search for specific magazine titles here at Typophile and probably find a lot more info.\n\n"
    },
    {
      "time": " 24.Oct.2008 3.14am",
      "content": "Hi, Thanks for the quick response i will keep looking into it and look at these examples!\n\n"
    },
    {
      "time": " 24.Oct.2008 5.06am",
      "content": "[Vibe](http://web.archive.org/web/20081025121050/http:/www.vibe.com/) is using [Leitura](http://web.archive.org/web/20081025121050/http:/dstype.com/leitura.html).\n\n"
    },
    {
      "time": " 24.Oct.2008 11.00am",
      "content": "_I have been researching on the internet..._\n\nMight I suggest a visit to your local newsagent?\n\n"
    }
  ]
}
