{
  "id": "50859",
  "title": "Lakemount Worship Centre Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey guys,  \nIt’s been awhile since I’ve created a logo, and have been stuck on this one for my church. The logo on the left is our current logo which I did around 5 or 6 years ago. The 2 on the right are a couple of possibilities that I’m working on.\n\nThe goal of the logo is to signify a bit of a fresh start, and attempt to make the logo / church look a little more approachable and friendly.\n\nIs it working? Too cliché? Any suggestions?\n\nThanks!  \nJesse\n\n| Attachment | Size |\n| --- | --- |\n| [Lakemount Logo 2.1.png](http://web.archive.org/web/20081201111906/http:/typophile.com/files/Lakemount%20Logo%202.1.png) | 28.92 KB |\n\n [‹ Another Best logo](http://web.archive.org/web/20081201111906/http:/typophile.com/node/51674 \"Go to previous forum topic\") [Pianist logo critique ›](http://web.archive.org/web/20081201111906/http:/typophile.com/node/51911 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201111906/http://typophile.com/user/2331\" title=\"View user profile.\">Jesse Bennett-C...</a>",
  "time": "<br>",
  "uid": "2331",
  "comments": [
    {
      "time": " 24.Oct.2008 9.49am",
      "content": "I like the top right one. Although I can’t really speak to the technical stuff (i.e. kerning, tracking, etc.) too much, I think the k-e need to be a tad tighter. The type and the mark look very cohesive otherwise.\n\n"
    },
    {
      "time": " 24.Oct.2008 12.16pm",
      "content": "Is this a map? And the dot is the church’s location on the road? If not, I don’t get the dot and the dot doesn’t work too well, for me.\n\nSharon\n\n"
    },
    {
      "time": " 24.Oct.2008 12.50pm",
      "content": "Thanks for the feedback guys...\n\nNo... it’s not a map Sharon, but I can see how it looks like one now. It’s an attempt at mixing a lake / mountain landscape image with a person celebrating. I suppose that it still needs some work though :)\n\nAny other thoughts?\n\n"
    },
    {
      "time": " 24.Oct.2008 2.04pm",
      "content": "Jesse, I like it. I would agree on the upper right version. Having done a lot of church-related design, I picked up on the figure. It has a nice feel. I’m not totally sold on the choice of typeface though, and I’m not sure why. I do think it’s an improvement for sure.\n\n"
    },
    {
      "time": " 24.Oct.2008 3.35pm",
      "content": "I saw the landscape/person immediately, before I read your explanation.\n\nThe right-hand version is better because it looks like it’s moving to the right (i.e. forward).\n\n"
    },
    {
      "time": " 26.Oct.2008 12.29pm",
      "content": "Rounded couple reminds me of olympics. Right most column remind me of a swimmer. I wouldn’t relate this logo with church even though it’s a very nice and eye pleasing logo. It’s just not the right one to me.\n\nApproachable? Friendly? How about open hands? Maybe with a clover it’s in nature surroundings. Or a leaf or something. But yes. It won’t be logo evolution. More like a revolution.\n\nAnyway. To me it doesn’t resemble anything to what it represents. Even worse. It looks like it’s something completely different.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 27.Oct.2008 6.55am",
      "content": "I disagree with litera. It doesn’t have to resemble what it represents at all. I saw the landscape/person before I read the post too. Even though it didn’t say “churh” to me right away, once I found out that the logo was for a church, I saw a cross and a dove (and I’m not religious, so I don’t tend to notice things like that often).\n\nI think it’s a fresh departure from the “traditional” church “logos.”\n\n"
    },
    {
      "time": " 27.Oct.2008 9.43am",
      "content": "I think this is a nice redesign. I agree that the rightward movement of the figure in the right column is more pleasing, though you do complicate the reading of it as the features are inverted from how they appear in the name. Any chance you could rename the place “Mountlake”? ;-)\n\nThe typefaces may be a touch sterile but even so I think you have the welcoming mood you’re looking for.\n\nThe rounded horizontal rectangle called to my mind a TV screen, but that was sixth- or seventh-impression.\n\n"
    },
    {
      "time": " 27.Oct.2008 3.45pm",
      "content": "Very good feedback so far guys... thank you very much. After giving it a couple of days, I’m not quite settled on the design either... and think it needs to be a bit simpler to work.\n\nI’ll post back when I come up with something else.\n\nThanks again,  \nJesse\n\n"
    },
    {
      "time": " 28.Oct.2008 8.50am",
      "content": "I wanted to try something a little more simplistic. I know leaves are somewhat cliche in the world of logos right now, but for a local church that’s not really exposed to trends, I think it might be ok.\n\nAny thoughts on this direction?\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/Picture964_5687.png)\n\n"
    },
    {
      "time": " 28.Oct.2008 9.11am",
      "content": "I like this version much better. The icon kind of looks like between a leaves & a candle flame...which is cool. Your first versions with a cross & a dot are so redundant imo.\n\n"
    },
    {
      "time": " 28.Oct.2008 10.02am",
      "content": "It’s handsome and likeable, though it looks a bit like an eco renovation of a natural-gas utility. Could something be done with the gradient to reduce the gas-flame impression?\n\nThe almost-but-not-quite alignment of the stem and the left stroke of u is irksome.\n\n"
    },
    {
      "time": " 29.Oct.2008 12.53am",
      "content": "Oh yes. Candle/leave. Eliason makes good comment on departing too from gas companies, but otherwise yes. This looks much better and goes better with a church.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 29.Oct.2008 6.16am",
      "content": "I like this direction even better. I would agree on the natural gas reference, although I didn’t see it at first. I saw a combination of a leaf and a flame. Love the choice of Omnes too. Maybe if the leaf had some perspective or angle to it? Nice work.\n\n"
    },
    {
      "time": " 29.Oct.2008 6.21am",
      "content": "the leaf/flame feels right, it feel like a much more “together” logo, it makes the others seem more suited for a resort of some kind..or is that just me? The top right logo form the original batch is also very good though.\n\n"
    },
    {
      "time": " 29.Oct.2008 10.42pm",
      "content": "I feel that the original midle column was the one that struck me the most. Blame the directionality on my laft-handedness but I felt that the action pointed towards the right (more dynamic or so I’m told) is better, but the question is, which is more important for a ’worship centre’, movement and advancing, or meditation and slowing down? I feel strong arguments could be made for both, but you have to admit it’s far less common to see a left-leaning logo so it might stand out in the mind better.\n\nI never understood the whole ’worship centre’ thing. In my experience it differs from a church because there isn’t ’crowd surfing’ or ’sprinting up and down the aisles’ in church. Oh that was one scary experience having to dodge sprinters just to get a seat.\n\nI am somewhat turned off by the latest logo because to me, I see a tree, a flame and then the first combination that pops into my head is: Natural Gas / Environmental\n\nAlso, I feel that the type choice (please don’t lynch me) in the first one will last longer than in the latest one. I feel that the latest one has a shorter lifespan and will feel ’dated’ longer.\n\nI hope you will continue to develop the original middle column idea and see where that leads you as you explore other options too.\n\n"
    },
    {
      "time": " 30.Oct.2008 8.06am",
      "content": "Thanks for all the feedback guys, you’ve been very very helpful. I think I’m going to refine each of these options a tad more and see if I can make them a little more solid.\n\nI came up with another quick option after seeing an image on istock that I thought was interesting. I’d love to hear some feedback on it.\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/20081030-tmnnt3auseeiti56uig3acuduw_4333.png)\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/20081030-rfw417rbnas7tk21xmmxc5iyhy_6216.png)\n\n"
    },
    {
      "time": " 30.Oct.2008 8.35am",
      "content": "Too storybookish; your previous ideas have more potential in my opinion.\n\n"
    },
    {
      "time": " 30.Oct.2008 10.25am",
      "content": "I saw leaf and flame immediately and really liked that direction. It’s an attractive symbol for a Christian church.\n\nSharon\n\n"
    },
    {
      "time": " 30.Oct.2008 10.48am",
      "content": "Hey Jesse, I’m a fan of the leaf/flame mark, as well. But a couple things to consider: how will it look at small sizes and in b/w? As it, you might lose the step/wick and would look like a teardrop at small sizes.\n\nThe kid the with ladder looks too complicated - what is he holding? and in b/w, it looks like he’s climbing to clean some specs off the wall. Good idea, but not the most practical for this use, in my opinion at least.\n\n-Scott\n\n"
    },
    {
      "time": " 30.Oct.2008 3.43pm",
      "content": "The leaf/flame was striking. I think you’ve got it. Unless you don’t think you do, of course. It’s always refreshing when you don’t have to have a cross in a church logo.\n\n—  \nNick Hladek\n\n"
    },
    {
      "time": " 30.Oct.2008 6.48pm",
      "content": "Hello,\n\nI’m the other designer working with Jesse on this seemingly impossible church logo. Here’s yet another concept we’ve drawn up...thoughts?\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/Picture_11_5577.png)\n\n"
    },
    {
      "time": " 30.Oct.2008 11.47pm",
      "content": "that’s a nice one too, and it works in 1 colour!\n\nI think it’s kind of got that 50’s googie feel to it to (a good thing, it’s casual and informal).\n\nWhat I do wonder though, is if you are using 4 elements to construct the cross, what do the four stand for? I recall seeing this logo from the Christian Missionary Alliance, where each element represents one of their core values as a denomination.\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/emblem30_5816.png)\n\nI don’t want to assume your Worship Centre is of pentecostal affiliation, but is there a way that your design could (even if not in a way as obvious as the CMA) reference the number of key points or a significant number just to be consistent.\n\nFour makes me think of the four corners of the earth, that’s the first thing that pops into my head, and while looking at your logo, I do think that (I know I’m weird eh?)\n\nHope this provides some insight and some feedback, keep up the great work!\n\n"
    },
    {
      "time": " 31.Oct.2008 12.36pm",
      "content": "Thanks for the feedback!\n\nInnovati, you’re correct to think of the ’four corners’ analogy here, that was my thinking as well when designing the logo. Also that the four corners come together to form the church, as represented by the cross.\n\nAt first I didn’t want to use a cross in the logo because it could be a bit cliché. Now though, we’ve decided that its a perfectly good method of representing the church, and have figured out a way to ’freshen up’ the image.\n\nI continued sketching this idea out, and here is the progress...\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/sketch_4967.png)\n\n"
    },
    {
      "time": " 31.Oct.2008 2.16pm",
      "content": "The solid color panes with white lines between (from 30.Oct post) can better suggest mosaics or leaded stained glass - I prefer them to these latest contourless gradient rectangles.\n\n"
    },
    {
      "time": " 31.Oct.2008 10.33pm",
      "content": "agreed. All logos should work in 1 colour, and the gradient ones don’t allow for that. Sure the logo can be spiced up to suit the occasion, but I feel that as a mark the previous incarnation with the separation lines worked better.\n\nI like the concept, and to address your fear of the cliché, I don’t think in this case the cross is being used out-of-context or in a clicé way.\n\nThe cross will always remain relevant, but where it most cliché is when designers attempt to integrate it into a place where it doesn’t belong, at any cost. We’ve all seen crosses replace ’t’s in words that don’t need it, or incredibly cross-suggestive layouts where it doesn’t help the content.\n\nWhat you’ve done, create a cross through the joining of independent elements, or creating a cross-shaped-hole inbetween the rectangles so me is a first, you’ve surely found a new way to show the same image. Far from cliché in my eyes.\n\nI think the proportions could use a slight amount of tweaking, but I have nothing to suggest other than the feeling that it’s not 100% done yet (sorry I can’t be of more help)\n\nKeep working on it, I’ll stick around to give my 2¢ as long as it’s helpful!\n\n"
    },
    {
      "time": " 31.Oct.2008 10.34pm",
      "content": "I favor the leaf/flame concept. This last idea comes off as just a bit too generically Christian for me.\n\npenn\n\n"
    },
    {
      "time": " 12.Nov.2008 1.57pm",
      "content": "Thanks for all the feedback so far everyone. It’s been very much appreciated. I have another concept that I’d like to float past you for feedback. Thoughts?\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/Picture1055_3950.png)\n\n"
    },
    {
      "time": " 12.Nov.2008 2.07pm",
      "content": "Ladder idea: very nicely done, but not for this “client” IMO. Hands: no. I liked the leaf direction. But I have to say I really like the overlapping gradients. I prefer the ones without the white cross in the center, where it’s more subtle. I could see that being very cool as signage, with overlappying pieces of amber or colored glass. Obviously the cross is central to the church, and this presents it in a unique way. FWIW, I’m in the buckle of the bible belt, and have seen a lot of church-related design.\n\n"
    },
    {
      "time": " 13.Nov.2008 12.31pm",
      "content": "Nice logos guys!\n\nI think the leaf/flame works best, once you move away from gas companies; I also like the last one: the coming together to form a cross seems like a church-y thing to go with. And the moving man/mountain-lake one works as well, I think.\n\nThe ladder one looks like a movie company (I can’t imagine why…); it just doesn’t say “church” in my opinion; the one with the hands is WAY too obvious, so I’d discard it.\n\nOverall, I think you’ve done a great job! Good stuff!\n\n"
    },
    {
      "time": " 13.Nov.2008 4.54pm",
      "content": "Thanks again for all your advice everyone... it’s be super helpful.\n\nIt’s amazing what a day or two will do to change your perspective on a logo. I was loving the hands / dove thing when working on it, but now think it looks ridiculous.\n\nHere’s my latest concept. Hopefully I’ll still like it in a couple of days from now :)\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/Picture_4819.jpg)\n\n"
    },
    {
      "time": " 13.Nov.2008 5.43pm",
      "content": "I usually stay away from church threads and logos ... but there’s some really nice ideas in what you’ve presented.\n\nwell done.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081201111906/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20081201111906/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": " 14.Nov.2008 9.38am",
      "content": "Thanks Paul!\n\nHere’s the last concept applied to different internal ministries...\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/Picture1073_4125.png)\n\n"
    },
    {
      "time": " 14.Nov.2008 9.46am",
      "content": "definitly loving the latest version...nice! One minor comment regarding the hand/dove symbol, I would make it a bit rounder at the tip of the fingers/wing otherwise it might looks like a claw.\n\n"
    },
    {
      "time": " 14.Nov.2008 10.09am",
      "content": "This is working well.  \nThe “global missions” sphere looks too much like the AT&T logo to me - would that be an issue in Canada?\n\n"
    },
    {
      "time": " 14.Nov.2008 4.22pm",
      "content": "@ eliason: well, here in Canada the most we see of AT&T is on american TV networks or ads on the internet. Still a widely recognizable mark, it’s certainly the first thing I thought of, even before reading this.\n\n@ all: I really like this solution too, because it’s scalable and it really combines the imagery well.\n\nGreat work!\n\n"
    },
    {
      "time": " 14.Nov.2008 6.43pm",
      "content": "Good call on “the claw” Jakes... I’ll work on making that a bit more friendly looking. :)\n\nAgreed on the AT&T logo as well. Definitely too close.\n\nI’m going to make some more refinements on this early next week, and keep you posted.\n\nThanks again for the help!\n\n"
    },
    {
      "time": " 15.Nov.2008 4.42pm",
      "content": "Jesse,\n\nA number of the logo concepts have potential. It seems like a direction is evolving for this logo project, so I will wait to comment until your next round of refinements.\n\nHas Lakemount Worship Center seen, or commented, on any of the concepts? If so, what has their feedback been so far.\n\nNice work. It is has been enjoyable to watch the process so far.\n\n———————————-  \nMichael Browers  \n [www.michaelbrowers.com](http://web.archive.org/web/20081201111906/http:/www.michaelbrowers.com/ \"www.michaelbrowers.com\")\n\n"
    },
    {
      "time": " 15.Nov.2008 5.52pm",
      "content": "I’m loving the latest one. It seems like it represents a church the best, but brings in a quality feel with the play of images there. And I love the variations for the different sections. You have a great logo that is both witty, and has quality and versatility. What more could you ask for?\n\nbut if your track record is like it has been with creating better logos each time...I’d like to see if you can beat this one!\n\ncourtney\n\n"
    },
    {
      "time": " 18.Nov.2008 12.48pm",
      "content": "Love the hand/dove.\n\n"
    },
    {
      "time": " 19.Nov.2008 1.35pm",
      "content": "Here’s an attempt to make the hand not look so scary, and bring a bit more warmth to it. Once I changed the icon, Gotham was looking a little too stiff for it, so I’ve paired it with Omnes instead. Any other suggestions would be much appreciated!\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/Picture1115_5360.png)\n\n"
    },
    {
      "time": " 19.Nov.2008 2.24pm",
      "content": "Some more I just came up with for different ministry options...\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/20081119-fpbanafniagfdj3frhp5dxtsh3_5700.png)\n\n"
    },
    {
      "time": " 19.Nov.2008 3.30pm",
      "content": "The gray is a little strong but I have to say I really like it!\n\nGreat work!\n\n"
    },
    {
      "time": " 19.Nov.2008 4.27pm",
      "content": "Excellent work. The various ministry options create a dynamic logo system or Lakemount to use in different areas. My only recommendation is that the leaf in the worship center option and the flame in the prayer ministry option might be shaped to similarly.\n\n———————————-  \nMichael Browers  \n [www.michaelbrowers.com](http://web.archive.org/web/20081201111906/http:/www.michaelbrowers.com/ \"www.michaelbrowers.com\")\n\n"
    },
    {
      "time": " 19.Nov.2008 5.34pm",
      "content": "Nice. Good dynamics to the mark.\n\npenn\n\n"
    },
    {
      "time": " 20.Nov.2008 12.07am",
      "content": "I liked the non-outlined version better, because it looked more refined.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 20.Nov.2008 4.26am",
      "content": "Great progression. Nice work!\n\nRoss\n\n"
    },
    {
      "time": " 20.Nov.2008 6.03am",
      "content": "_I liked the non-outlined version better, because it looked more refined._\n\nFWIW, I had this same reaction. The outline is overbearing relative to the words to my eyes; it and the misregistration makes it look a bit childish, like the logo for a Montessori school.\n\n"
    },
    {
      "time": " 20.Nov.2008 7.30am",
      "content": "Here’s the two side by side. I’ve refined the non-outlined one in hopes that it doesn’t look too much like a claw.\n\n ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/lakemount_logo_6119.png)\n\n"
    },
    {
      "time": " 20.Nov.2008 7.54am",
      "content": "What is the typeface in the ’Let’s Connect’ logo?\n\n"
    },
    {
      "time": " 20.Nov.2008 8.56am",
      "content": "Archer italic\n\n"
    },
    {
      "time": " 20.Nov.2008 10.29am",
      "content": "I like both versions. The one without the outline has a more contemporary feel to it. The outline one definitely works better on a big signage though.\n\n"
    },
    {
      "time": " 20.Nov.2008 11.54am",
      "content": "The version with the offset outline seems a little less current. But, that could be because I’m old and have used that style before in the last 10 years. :^P I like them both though. Age isn’t a reason to avoid using a style.\n\nEdit: I’m waffling. I think I do prefer the version without the outline because it implies a little more elegance. But, on the other hand I could equally say I prefer the other version because the outline and the offset implies a level of casual and openness.\n\n"
    },
    {
      "time": " 20.Nov.2008 12.31pm",
      "content": "Thanks for your feedback... I’m sort of waffling on the outline direction as well. Part of me likes it, and part of me doesn’t. It might just come down to how it’s actually used.\n\nCan I shift gears for a bit and ask for some advice on the type itself? Is Omnes working? Do any other typefaces come to mind that might work better?\n\n"
    },
    {
      "time": " 20.Nov.2008 1.05pm",
      "content": "I think Omnes is working. It is one of the least uptight rounded sans.\n\n"
    },
    {
      "time": " 20.Nov.2008 1.16pm",
      "content": "Outline version: no, no, no. Visually the hand symbol is stronger and clearer in the original form. The offset outline is trendy, but will date quickly. It also looks plugged up, and causes you to lose the nice space in between the fingers. Also, I preferred your original rendering of the hand. I don’t see any way it would look like a claw. The way the fingers tapered in the original version looked more like feathers, I think you’ve lost some of the elegance in the new version.\n\nI think Omnes is a perfect compliment to the symbol, with the tapered endings. Nice job.\n\nI think you’ve gone past the solution in this latest version...\n\n"
    },
    {
      "time": " 20.Nov.2008 9.15pm",
      "content": " ![](http://web.archive.org/web/20081201111906im_/http:/typophile.com/files/kleenex_6574.png)\n\n"
    },
    {
      "time": " 21.Nov.2008 8.34am",
      "content": "Anyway.  \nType works very well with the symbol.  \nI like the non-outlined version better (as I said already once before).  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
