{
  "id": "50851",
  "title": "Social investment project",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi there  \nI need a few thoughts on this design i am currently working on.  \nIt is a social investment/development project in Africa. Here: [http://youturn.jesperlarsen.com/](http://web.archive.org/web/20081030030919/http:/youturn.jesperlarsen.com/ \"http://youturn.jesperlarsen.com/\") you can read more about it as well as see an earlier version of the logo and the website in development.  \nI went for a system here that could be adapted to as many surfaces and formats as possible.  \nA few words would be kindly appreciated.  \nCheers\n\n ![](http://web.archive.org/web/20081030030919im_/http:/typophile.com/files/YT_Test_4702.jpg)\n\n [‹ New design to a corporate logo](http://web.archive.org/web/20081030030919/http:/typophile.com/node/50037 \"Go to previous forum topic\") [Logo Critique \\> Please HELP ›](http://web.archive.org/web/20081030030919/http:/typophile.com/node/50714 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081030030919/http://typophile.com/user/23280\" title=\"View user profile.\">Gregers™</a>",
  "time": "<br>",
  "uid": "23280",
  "comments": [
    {
      "time": " 24.Oct.2008 8.07am",
      "content": "I think people will have difficulty reading “turn” to be honest. It took me several tries before I figured it out. And then after figuring it out, it unfortunately didn’t have that “oh that’s clever!” moment. It was more of a, “now why did they do that?” Why not make the “turn” text fall vertically? Why have the entire “turn” reversed? That would make the effect more subtle and I think improve the readability. I understand the concept of a u-turn that’s involved here but I think readability would be more important then keeping the concept “pure”. Also the look and feel of the design is very “industrial” to be honest. I’m not sure about the dot before the “you.” Does it have meaning? Because I’m not figuring that out. That’s my 2 cents.\n\n"
    },
    {
      "time": " 24.Oct.2008 9.51am",
      "content": "Thank you for the comments.  \nI see what you mean bout the legibility. However, i believe that recognition is worth concidering as well. I believe that after a period that will not be an issue.  \nOne of the thoughts behind the project is that something different has to be done in Africa, that is investment wise. New dirrections for successfull investment and development are needed. I have tried to create a mark which one would have to look at differetly in order to decode it. I dont know if that is too overdone maybe?? Or perhaps just futile.  \nThe fullstop was an attempt to balance out the overall feel of the mark, but i guess it wont be necessary.  \nI am working on alternatives at the moment. Here is one.\n\n ![](http://web.archive.org/web/20081030030919im_/http:/typophile.com/files/YT_Test_02_6236.jpg)\n\n"
    },
    {
      "time": " 24.Oct.2008 9.52am",
      "content": "I actually really like it. The only thing that confuses me is the period before YOU. I didn’t have an issue reading TURN at all. I’m not completely sold on the slash/line/diagonal thing between the words though. What is it for?\n\nI can tell that you know this, but I love the way the mark resembles the shape of Africa.\n\n-S\n\n"
    },
    {
      "time": " 24.Oct.2008 10.04am",
      "content": "Thank you Scott  \nThe shape is there yep.  \nI wasnt gonna emphasize that, but here you go.\n\n ![](http://web.archive.org/web/20081030030919im_/http:/typophile.com/files/YT_Test_03_3514.gif)\n\n"
    },
    {
      "time": " 24.Oct.2008 10.20am",
      "content": "at first glance I really like the design...especially on the letterhead & the vehicles. Than, I notice the logo is leading the eye downward...it’s not a good thing especially if you believe in Feng shui. It might be irrelevance to you though...but just saying.\n\n"
    },
    {
      "time": " 24.Oct.2008 10.35am",
      "content": "Thanks Jakes  \nYou´re right, no relevance at all.  \nGuess we have to change western reading direction also, that is acording to Feng Shui, as that leads the eye downwards as well :-)\n\n"
    },
    {
      "time": " 24.Oct.2008 3.59pm",
      "content": "Why is the word TURN flipped? It will still convey the same concept and read more easily if it wasn’t in my opinion.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081030030919/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20081030030919/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": " 24.Oct.2008 4.33pm",
      "content": "I agree, it looks like you put your sticker on backwards.\n\n"
    },
    {
      "time": " 24.Oct.2008 5.33pm",
      "content": "I struggled with what the logo said initially. And I agree with the other postings that the word “Turn” should be turned rather than flipped. The slash was also a puzzlement although I see it was removed in your latest posting.\n\n"
    },
    {
      "time": " 25.Oct.2008 8.39am",
      "content": "Some people will definitely find it hard to read the mirrored text, so i’d keep it just rotated, as some others here have suggested.  \nit’s better without the punctuation! :)\n\n"
    },
    {
      "time": " 25.Oct.2008 9.28am",
      "content": "I was going to write and say that I think the “turn” being backwards is ok. Then I changed my mind. I understand what you’re saying about it not being a problem once you establish brand recognition, but I don’t think it’s necessary for that. Your logo is already unique in the way the two lines of text come together. There’s not many logos out there with vertical type. I like your most recent version the best with “turn” knocked out, it really grabs attention. i also prefer it without the period. It only adds confusion because it makes it seem like that’s the end point and i keep trying to read it backwards, especially with the turn flipped like that. there doesn’t seem to be a point (pun!).\n\nI also like the logo on top of africa, i could definitely see it printed on a tee. But I wouldn’t use africa as part of the logo. it works well as a secondary element as you’re using it now.\n\nthe only other thing that bothers me a bit is that i keep thinking u-turn, i saw the arrows on your site and i can see that this plays into it a lot. but the logo isn’t really making the shape of a u-turn. more of an L. I’m guessing your intention of turning the text like that was to play on the u-turn. it’s just not there yet for me...although it still is very eye appealing and maybe doesn’t need to be that obvious either.\n\n"
    },
    {
      "time": " 26.Oct.2008 1.39pm",
      "content": "Thanks for comments  \nHere are the latest edits. I think i’m just about there now.\n\n ![](http://web.archive.org/web/20081030030919im_/http:/typophile.com/files/YT_Test_04_6379.jpg)\n\n"
    },
    {
      "time": " 26.Oct.2008 1.45pm",
      "content": "Very nice.\n\nSharon\n\n"
    },
    {
      "time": " 26.Oct.2008 5.58pm",
      "content": "This is much more “readable” design. I’m still not understanding the period though. It doesn’t seem to fit -what’s your reasoning behind the period? Another thought - although this could be getting a tad too cliché - but what if you actually had a bent arrow symbol (like they actually use on u-turn signs) between the “you” and the “turn”? Finally, what if you stylized the African continent artwork - make it look like it was drawn freehand? This might help give it a more friendly feeling.\n\n"
    },
    {
      "time": " 26.Oct.2008 7.32pm",
      "content": "Of these last three edits, I’d go with number 1 without the period or number 3.\n\npenn\n\n"
    }
  ]
}
