{
  "id": "50865",
  "title": "Help locating Type Spec Books",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m desperately looking for type spec books that typesetters used pre digital typesetting. I’m located in NYC and wondered if anyone was aware of any resources like any still existant typesetters, bookstores and or graphics designers willing to part with theirs.\n\nThanks in advance.\n\n [‹ I want to shop for fonts like this!](http://web.archive.org/web/20081026140350/http:/typophile.com/node/50839 \"Go to previous forum topic\") [‘Mad Men’ creator knows his fonts are anachronistic ›](http://web.archive.org/web/20081026140350/http:/typophile.com/node/50860 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081026140350/http://typophile.com/user/38881\" title=\"View user profile.\">ipropa</a>",
  "time": "<br>",
  "uid": "38881",
  "comments": [
    {
      "time": " 24.Oct.2008 11.06am",
      "content": "[Here](http://web.archive.org/web/20081026140350/http:/shop.spatium-magazin.de/shop/USER_ARTIKEL_HANDLING_AUFRUF.php?darstellen=1&Kategorie_ID=42&PEPPERSESS=afb1dd64d5bceb70d39904e2dfbf0959&kat_last=42&kat_aktiv=42) you can buy an interesting DVD with lots of samples.\n\n"
    },
    {
      "time": " 24.Oct.2008 11.24am",
      "content": "Start with libraries; New York is full of them. IIRC correctly the ATF collection ended up in the Columbia U. library and I’m sure that there’s plenty more in the holdings of the three big design schools. If you’re looking for a specific hard-to-find book email H&FJ to see if they have a copy in their library that you can look at.\n\nAs for purchasing, your best bet is to just search Amazon, Abebook, Alibris, and Ebay. You might have to do some Google searches to track down the correct names first. Finding specimens in stores isn’t easy; the last time I was trying to find them in New York the best lead I got was a phone number for an appointment-only antiquarian vendor.\n\n"
    },
    {
      "time": " 24.Oct.2008 11.24am",
      "content": "Check out Oak Knoll Books - they always have some specimen books for sale.\n\n"
    },
    {
      "time": " 24.Oct.2008 2.47pm",
      "content": "When you say “pre-digital,” do you mean metal type or phototype also?\n\npowers\n\n"
    },
    {
      "time": " 24.Oct.2008 4.25pm",
      "content": "When looking for old books one of my favorite sources is abe.com.\n\nYou should also check with Timothy Hawley; he sells a lot of type-related books.\n\nTimothy Hawley Books  \n915 S. Third St  \nLouisville, KY 40203  \n502-451-3021\n\nHope this is helpful. Good luck.\n\n"
    }
  ]
}
