{
  "id": "50860",
  "title": "‘Mad Men’ creator knows his fonts are anachronistic",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Our own Mark Simonson wrote [the definitive treatment of typography on <cite>Mad Men</cite>](http://web.archive.org/web/20100207003332/http:/www.marksimonson.com/article/236/mad-men-mad-props \"‘Mad Men,’ Mad Props\"). (I have [a couple of pictures](http://web.archive.org/web/20100207003332/http:/www.flickr.com/photos/joeclark/tags/madmen/ \" madmen\").) It turns out that series creator Matthew Weiner [knows we’re watching](http://web.archive.org/web/20100207003332/http:/weblogs.variety.com/season_pass/2008/10/mad-men-qa.html \" ‘I’m fascinated that people get so much out of it’ \").\n\n(Someday, when Typophile learns about the `blockquote` element, quotations like the following will be more semantically and visually distinct.)\n\nYou know this whole concept about anachronisms… I know it’s a game people like to play. And they know I’m working my ass off to keep it from happening. Someone sent me something about how the font at the end of the show was Ari[a]l and was not period. I was like, “The show’s over. Go home. I’m allowed to do whatever I want.” [...]\n\nBut if you’re person who loves fonts, fantastic. I’m sure there are some mistakes in there about when these fonts came out.... I can tell you that almost everything you see in that show, especially the artwork, is cut and pasted out of old ads. Those fonts may not have existed on a computer or couldn’t be typeset yet, but they were cut and pasted from old ads, so maybe they were hand-drawn or something.\n\nThe American Airlines ad that they were most critical of had this very famous lettering and it was used by DDB about six months after the crash, and we put it in our pitch and I was thinking “I’m sorry, I don’t have the freedom to do that with my fictitious ad agency? To have them get there before DDB did?” Maybe American Airlines saw it and told DDB they wanted it. Who knows?\n\nI love that people are invested enough that they’re fighting about it getting into it and doing that. I put so much ambiguity into the show if you say something about it that I didn’t think of I don’t say “You’re wrong.” I’m just saying that’s not what I meant or whatever. But I’m fascinated that people get so much out of it.\n\n",
  "author": "<a href=\"/web/20100207003332/http://www.typophile.com/user/7076\" title=\"View user profile.\">joeclark</a>",
  "time": "<br>",
  "uid": "7076",
  "comments": [
    {
      "time": "",
      "content": "And I see this forum’s software still cannot handle anything outside US-ASCII in a post title. MS-DOS called; it wants its codepages back.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20100207003332/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks for posting this, Joe (and for posting the link to my article on MetaFilter, which triggered an avalanche of traffic to my site). I sort of expected/hoped that someone (!) working on the show might see what I wrote.\n\nI've been doing this \"typecasting\" thing for a while now. I totally understand that it's trivial and that 99.99% of the audience will never notice such things. If they did, then people like Weiner would naturally give it more attention than they do. To me it's more about the fact that when you're deep in a specialized area like I am, you get a skewed view of the world. It's an occupational hazard. On the face of it, it looks like I'm criticizing the show (or movie or whatever), but I'm also making fun of my obsessions for the amusement of my own audience. I don't take it nearly as it might appear.\n\n"
    },
    {
      "time": "",
      "content": "Mark, congratulations on getting under the skin of the Hollywood Liberal Elite™ - Missions Accomplished ;-)\n\n"
    },
    {
      "time": "",
      "content": "Interesting timing...\n\n[http://www.nytimes.com/2008/10/26/books/review/Heller-t.html?em](http://web.archive.org/web/20100207003332/http:/www.nytimes.com/2008/10/26/books/review/Heller-t.html?em \"http://www.nytimes.com/2008/10/26/books/review/Heller-t.html?em\")\n\nHm, \"font wonk\" indeed!\n\n"
    },
    {
      "time": "",
      "content": "And now we know who to blame for the show’s occasionally-ahistorical newspapers and magazines: [Propmaster Scott Buckwald](http://web.archive.org/web/20100207003332/http:/www.collectorsweekly.com/articles/an-interview-with-scott-buckwald-prop-master-for-the-hit-tv-show-mad-men/ \"Interview at ‘Collectors Weekly’\"). “Usually if it was paper, like a magazine or a newspaper, I would reproduce it. I do a lot of my own graphics. I’ve remade Volkswagen ads on my computer, and I remade <cite>Advertising Age</cite> magazine. I’ve redone <cite>TV Guide</cite>s, even if they don’t exist anymore or they’re very hard to find.... I’m constantly redoing book covers. In one scene, a couple is reading in bed, and I couldn’t find a copy of the book that looked brand new – the pages were yellowed or it was faded – so I found a new book and remade the cover based on the original.”\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20100207003332/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    }
  ]
}
