{
  "id": "50885",
  "title": "Submit Work for Rotovision Book - FONT - Classic Typefaces for Contemporary Graphic Design",
  "forum": "tamye's blog",
  "tags": [

  ],
  "content": "New project I'm working on... with the good help of Miss TIff and Jimmy G. All good typographic design meeting the parameters will be happily considered.\n\n. . . . . .\n\nInvitation to Submit Work for Rotovision Book - FONT - Classic Typefaces for Contemporary Graphic Design\n\nI am working on a book on classic typefaces used in contemporary graphic design for Rotovision, a noted UK publisher. FONT will feature around 60 classic typefaces and will feature the best in today's design using typographic favorites like Frutiger, Helvetica, Bodoni, Clarendon, and Baskerville. FONT will be published next summer by Rotovision in the UK and Princeton Architectural Press in the United States.\n\nWe are seeking a variety of design work that uses the classic typefaces featured in FONT. Work across all media is welcome.\n\nAt the end of this message is a list of the fonts that will be featured in FONT. If you have created design work using any of these typefaces, we'd like to see it. You can submit good quality jpegs, PDFs, or other Mac-compatible formats for the initial review. Once we've taken a look at the images you submit, we'll ask for high-resolution files suitable for print, along with more information about each project, and have you fill out and sign a simple release form granting us permission to publish the image(s) in FONT.\n\nWe ask that you please only submit work that you already have permission to publish for promotional purposes, or work that you can quickly and easily obtain a client release for.\n\nMultiple submissions are encouraged. All work will be properly credited.\n\nPlease submit your images for review no later than Friday, November 14. You may attach your images to email if the total of all attachments is less than 20mb; otherwise, please send a link for downloading the images. Email address for submissions is [fontthebook@gmail.com](mailto:fontthebook@gmail.com).\n\nFor each image, please include the following information:\n\n1) Title of the project  \n2) Type of project  \n3) Name(s) of typeface(s) used (please specify exact font name and foundry if known)  \n4) Name of Studio and Principal Designer(s)  \n5) Client  \n6) Year the project was completed\n\nTo help ensure that your email gets through all the spam filters in the world, please title it as shown:\n\nRotovision FONT Book Submission - Your Studio Name 1 of 3\n\nRotovision FONT Book Submission - Your Studio Name 2 of 3\n\nRotovision FONT Book Submission - Your Studio Name 3 of 3\n\netc.\n\nDEADLINE FOR SUBMISSIONS IS Friday, November 14.\n\n---------------------------  \nFONTS IN USE LIST  \n---------------------------\n\nPlease submit work that uses at least one of the typefaces from the following list. Projects that use multiple typefaces are welcome. You can submit work using any cut/weight/style/variant of these typefaces.\n\nAkzidenz Grotesk  \nAntique Olive  \nApollo  \nAvant Garde  \nAvenir  \nBaskerville  \nBauhaus  \nBell Centennial  \nBembo  \nBlackoak  \nBodoni  \nBookman  \nBureau Grotesque  \nCalifornian  \nCaslon  \nCentaur  \nCentury Old Style  \nCezanne  \nClarendon  \nCommercial Script  \nCooper Black  \nCopperplate  \nCourier  \nDIN  \nDom Casual  \nEdwardian Script  \nEgyptian  \nEldorado  \nEurostile  \nFette Fraktur  \nFolio  \nFrankfurter  \nFranklin Gothic  \nFrutiger  \nFutura  \nGaramond  \nGill Sans  \nGoudy  \nHelvetica  \nJanson  \nMemphis  \nMeta  \nMonterey  \nMrs. Eaves  \nOCR A  \nOfficina Sans  \nOfficina Serif  \nOld English  \nOptima  \nPalatino  \nPerpetua  \nSabon  \nShelley  \nTimes New Roman  \nTrade Gothic  \nTrajan  \nUnivers  \nVineta  \nWalbaum  \nWedding Text  \nWood Type Ornaments  \nZapf Dingbats\n\nPlease let us know if you have any questions or need more information before you submit. Email us at [fontthebook@gmail.com](mailto:fontthebook@gmail.com) or send a message through Typophile with your email address.\n\nAbout Rotovision: [http://www.rotovision.com/about.asp](http://web.archive.org/web/20150421210315/http:/www.rotovision.com/about.asp \"http://www.rotovision.com/about.asp\")  \nAbout Princeton Architectural Press: [http://www.papress.com/about.tpl?cart=12173551452012876](http://web.archive.org/web/20150421210315/http:/www.papress.com/about.tpl?cart=12173551452012876 \"http://www.papress.com/about.tpl?cart=12173551452012876\")  \nAbout the author, Tamye Riggs: [http://typophile.com/node/14029](http://web.archive.org/web/20150421210315/http:/typophile.com/node/14029 \"http://typophile.com/node/14029\")  \nAbout the designer, James Grieshaber: [http://typophile.com/node/12316](http://web.archive.org/web/20150421210315/http:/typophile.com/node/12316 \"http://typophile.com/node/12316\")?\n\n",
  "author": "tamye",
  "time": "24 Oct 2008 — 7:27pm",
  "uid": "107",
  "comments": [
    {
      "time": "28 Oct 2008 — 12:17am",
      "content": "I'm not trying to start a debate or anything, but I'm curious as to how the list of typefaces was chosen? I was kind of surprised to see that of the three Adobe Originals in the set, two of them were Blackoak and Wood Type Ornaments.... Eldorado, Monterey and Vineta were also unexpected (to me).\n\nAlso, some typefaces listed are classics that have been revived in often radically different versions, such as Bodoni, Caslon, and Garamond. Are we to assume that the different cuts are interchangeable for purposes of this book?\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:07pm",
      "content": "I emailed an entry a bit ago.\n\nChrisL\n\n"
    },
    {
      "time": "1 Nov 2008 — 10:15am",
      "content": "Crap, I missed this! Is there any chance of a deadline extension?\n\n"
    },
    {
      "time": "3 Nov 2008 — 5:45pm",
      "content": "i also just read this post.\n\na book that is launching mid-november is set in 2 of these fonts.\n\nit is a \"surregionlist\" Katrina (hurricane) rant. i am going to enter it eve though it is past the deadline.\n\n"
    },
    {
      "time": "3 Nov 2008 — 5:46pm",
      "content": "OH,\n\nmy email address is:\n\n[nscstattioner@earthlink.net](mailto:nscstattioner@earthlink.net)\n\n"
    },
    {
      "time": "5 Nov 2008 — 9:54pm",
      "content": "_Is there any chance of a deadline extension?_\n\nAccording to [typelife.com](http://web.archive.org/web/20150421210315/http:/www.typelife.com/fontthebook/), the deadline is November 7.\n\n"
    },
    {
      "time": "8 Nov 2008 — 6:51am",
      "content": "There is an extension on the deadline for valued Typophiles :) We have had a dearth of submissions for Helvetica, Avant Garde, and a few other extremely popular typefaces. Still looking for quality submissions for many of the fonts. Please feel free to submit ASAP if you want to participate.\n\n"
    },
    {
      "time": "8 Nov 2008 — 6:53am",
      "content": "To answer Tom - some of the typefaces listed were from the original publisher's spec. There will be some adjustments, depending on the quality of work we get in for all the listed typefaces. I know some of the choices might seem out of the norm, but they were chosen based on trying to get a well rounded overview of classic types, with a few modern \"classics\" worked into the mix.\n\nMultiple cuts will be illustrated to show designers how different some variants are that are sold under the same or similar names.\n\n"
    }
  ]
}
