{
  "id": "5089",
  "title": "type on Virginia license plates",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Can anyone ID the type used on the bottom two license plates? (A discussion of this subject appears at: [http://www.typophile.com/forums/messages/30/37521.html?1086375894](http://web.archive.org/web/20141005225039/http:/www.typophile.com/forums/messages/30/37521.html?1086375894) )   \n   \n ![Virginia Plate](http://web.archive.org/web/20141005225039im_/http:/www.typophile.com/forums/messages/83/37544.jpg)\n\n",
  "author": "A. Scott Britton",
  "time": "4 Jun 2004 — 1:14pm",
  "uid": "3373",
  "comments": [
    {
      "time": "4 Jun 2004 — 1:35pm",
      "content": "Whatever font it is, it's a mess. The stroke widths and serifs are all over the map. It looks like someone cut and pasted a bunch of different weights, condensed some, bolded others. I like the 1973 series much better.\n\n"
    },
    {
      "time": "4 Jun 2004 — 1:38pm",
      "content": "Are you serious? They don't use typefaces on stamped license plates (I mean for the actual license number), though they do sometimes resemble existing typefaces. In my opinion, the two at the bottom most closely resemble Caslon.\n\n"
    },
    {
      "time": "4 Jun 2004 — 1:43pm",
      "content": "Here's Font Bureau's [Caslon Bold Condensed](http://web.archive.org/web/20141005225039/http:/www.myfonts.com/fonts/fontbureau/fb-caslon/caslonfb-boldcondensed/testdrive.html?s=ZXU-2433%a0JDA-2058&p=48), for example.\n\n"
    },
    {
      "time": "4 Jun 2004 — 2:17pm",
      "content": "Maybe he's talking about the face that \"VIRGINIA\" is set in, which I think is [Caxton Bold](http://web.archive.org/web/20141005225039/http:/www.myfonts.com/fonts/linotype/caxton/bold/testdrive.html?s=VIRGINIA&p=48), though it's hard to be sure at such a small size.\n\n"
    },
    {
      "time": "4 Jun 2004 — 2:45pm",
      "content": "Sorry, Mark. I frequently use \"font\" and \"typeface\" interchangeably.\n\n"
    },
    {
      "time": "4 Jun 2004 — 3:16pm",
      "content": "What I meant was that they don't use what we would call fonts or typefaces on stamped license plates. They use special dies of letters and numbers created for making license plates. I guess you could call them typefaces in a certain sense, but usually a typeface means something you can buy from a font foundry for setting type. License plate dies are similar to type in that they involve letters and numbers and have a modular way of arranging them to make words or numbers, but they have a separate parallel history from type, and they are not the same thing.   \n   \nA better way to ask would be, what fonts look like the letters and numbers used on these license plates?\n\n"
    }
  ]
}
