{
  "id": "50950",
  "title": "Large cache of Indie Fonts 2 books discovered",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’ve been cleaning out the studio after a five month renovation, and have come across a large cache of Indie Fonts 2 books. If anyone is interested please contact me off list.\n\n [‹ Divided Type Design](http://web.archive.org/web/20081201111916/http:/typophile.com/node/51078 \"Go to previous forum topic\") [ObamaBats ›](http://web.archive.org/web/20081201111916/http:/typophile.com/node/51068 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201111916/http://typophile.com/user/1947\" title=\"View user profile.\">terminaldesign</a>",
  "time": "<br>",
  "uid": "1947",
  "comments": [
    {
      "time": " 25.Oct.2008 2.33pm",
      "content": " ![](http://web.archive.org/web/20081201111916im_/http:/typophile.com/files/CaptureiNDY_5731.JPG)\n\n"
    },
    {
      "time": " 25.Oct.2008 2.39pm",
      "content": "“Raiders of the lost book 2” , starring Indie Fonts :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Oct.2008 3.41pm",
      "content": "I answered the door one day and received a package containing all of the indie fonts books. Turned out that my mom was in a good mood and had sent me some of the stuff on my Amazon wish list!\n\n"
    },
    {
      "time": " 25.Oct.2008 4.01pm",
      "content": "Your Mom is a keeper!\n\nChrisL\n\n"
    },
    {
      "time": " 25.Oct.2008 5.59pm",
      "content": "Actually Si, my studio is larger than that, and the cache of Indie Fonts 2 dwarfs the boxes in your image.\n\n"
    },
    {
      "time": " 25.Oct.2008 6.56pm",
      "content": "Maybe the Starling Burgess Times sketches and the original crystal goblet are stashed in there somewhere? ;-)\n\n"
    },
    {
      "time": " 25.Oct.2008 7.21pm",
      "content": "James must have bought in when Brooklyn was still cheap!\n\nAnd I wonder if Jenson’s matrices are in that warehouse…\n\n"
    },
    {
      "time": " 25.Oct.2008 8.25pm",
      "content": "My office is in a cramped corner of one room, maybe that is why I have only one copy of “Indie Fonts 2” :-)\n\nChrisL\n\n"
    },
    {
      "time": " 25.Oct.2008 9.11pm",
      "content": "I’d be interested in a copy email me at dangerdom [at] dangerdom [dot] com\n\n"
    },
    {
      "time": " 26.Oct.2008 2.44am",
      "content": "That scene / picture / composition from _Raiders_ owes everything to _Citizen Kane_.\n\nJames, I own a copy of Indie Fonts 1. Indie Fonts 2 isn’t hard to acquire since most of the participating font makers, like those featured in Indie Fonts 1, had substantial difficulty selling any of the copies of the book given to them by its publisher in exchange for the substantial sum of cash they handed over to be featured in Indie Fonts 2. Like Indie Fonts 1, Indie Fonts 2 did not sell well. There are hundreds of copies around and they are not hard to find.\n\nFor example, it can still be purchased new from [here](http://web.archive.org/web/20081201111916/http:/www.myfonts.com/products/ptype/indie-fonts-cd-vol-2/), [here](http://web.archive.org/web/20081201111916/http:/www.p22.com/indiefonts/indie2.html) and [here](http://web.archive.org/web/20081201111916/http:/www.amazon.com/Indie-Fonts-2-Richard-Kegler/dp/0963108239).\n\nAmazon is offering 5 new copies at $20 apiece, and 7 used books at $12.95 apiece.\n\nIf the text typesetting and design of Indie Fonts 2 is anything like Indie Fonts 1, I haven’t a scintilla of interest in acquiring IF2 at any price. I might even express an interest in paying somebody to take away my copy of IF1 (joking). My complaint: the descriptive text typesetting on the sample pages is so small and hard to read it makes everybody who reads my copy of IF1 wonder aloud “Why, why, why?”\n\nj a m e s\n\n"
    },
    {
      "time": " 26.Oct.2008 7.22am",
      "content": "James A,  \nYour definition of “substantial”, may be different from most, or at least misinformed.\n\nOur method of self publishing the first 2 Indie fonts books involved a fee to be included in the book which was offset by being sent a number of books (100) that mathematics determined would be less than any wholesale rate would ever be. (therefore participating foundries would actually make money if they sold most of their books. The additional exposure has been reported to be helpful as well...not unlike advertising) This is how we paid the designer and for some of the printing. Our distribution was limited, but was somewhat effective: The first 2 sold quite well. In fact the indie fonts 1 book is all but sold out.\n\nThe books that James A is no doubt referring to is the Rockport publishers reprinting of the Indie Fonts books. We went with Rockport due to their tremendous distribution which we could not get anywhere near (in fact our only distributor that would take us at the time of the first book completely stiffed us and we never saw a cent from those). Our biggest disappointment with this arrangement was that Rockport decided to set the descriptive text a point size smaller than we had, in order to fit text in the event of a translated version of the book (which never happened). This reduction for our readable 5 point Faceplate to a miniscule 4 point made it unfortunately difficult to read. The other unfortunate change from our first edition was the Indie Fonts 2 being printed in halftone grey rather than the spot silver that makes the first edition quite appealing. The third volume was printed exclusively by Rockport with our concerns about the descriptive point size addressed, but late in the process we were told it would be a flexbound cover to match the reissues of 1 & 2 that Rockport was releasing. Our compromise is that we commissioned an edition of hardcover Indie Fonts 3 to self distribute.\n\nTo answer your “Why why why”, it is because you bought your indie fonts book from someone selling the Rockport reprints rather than directly from a foundry who was in the books. The small text is in the Rockport Edition. For full disclosure, we bought out some of the last stock of the indie fonts 1 book from Rockport and are selling them (at a special sale price, act now!) because we have no more of the first edition.  \n [http://www.p22.com/indiefonts/indie1.html](http://web.archive.org/web/20081201111916/http:/www.p22.com/indiefonts/indie1.html \"http://www.p22.com/indiefonts/indie1.html\")\n\nSo to recap, the following volumes/edition of Indie Fonts exist\n\n• Indie Fonts (P-Type publications) HC edition 5000 - distributed via foundries & limited bookshops (sold out\\*)  \n• Indie Fonts 2 (P-Type publications) HC edition 5000 - distributed via foundries & limited bookshops (silver ink)  \n• Indie Fonts 3 (P-Type/Rockport) HC edition 1000 - distributed via foundries (only hardcover edition)\n\n• Indie Fonts (Rockport) HC edition - distributed via major chain & small bookshops (oop)  \n• Indie Fonts 2 (Rockport) HC edition - distributed via major chain & small bookshops (oop)\n\n• Indie Fonts (Rockport) flexbound edition - distributed via major chain & small bookshops  \n• Indie Fonts 2 (Rockport) flexbound edition - distributed via major chain & small bookshops  \n• Indie Fonts 3 (Rockport) flexbound edition - distributed via major chain & small bookshops\n\n• Indie Fonts (Rockport/Japan) HC edition - Japanese edition- same content, Japanese foreword  \n• Indie Fonts 2 (Rockport/Japan) HC edition - Japanese edition- same content, Japanese foreword\n\n• Indie Fonts (Rockport/Russia) HC edition - Russian edition- same content, Russian foreword  \n• Indie Fonts 2 (Rockport/Russia) HC edition - Russian edition- same content, Russian foreword\n\nJames M. is offering up the silver ink edition with proper size descriptive text.\n\n\\*try Typeco or altered ego if you want to find a first edition copy.\n\n"
    },
    {
      "time": " 26.Oct.2008 6.40pm",
      "content": "Well, even with Mr Aborghast crapping all over my offer, I’ve succeeded in off-loading all of my copies. Sorry to those who did not understand “contact me off list” but everything is gone now.\n\nCheers\n\n"
    },
    {
      "time": " 28.Oct.2008 1.04am",
      "content": "James M —- sorry about that. I have been more than a little manic lately. Saying that probably does not help. It’s great that you sold all your copies.\n\n_pain and hate become our bosses  \nit spreads as he watches  \nhatred is contagious  \nhatred is contagious_\n\nit breaks me  \nit takes my pride  \nit makes me  \nbut I am alive\n\nhatred  \nis contagious  \nhatred  \nis contagious\n\nit breaks me  \nit takes my pride  \nit breaks me  \nit’s built on lies  \nit makes me  \nbut I am alive   \n—words by [Richard Patrick](http://web.archive.org/en.wikipedia.org/wiki/Richard_Patric)\n\nRichard —- apologies. I don’t mean to misrepresent you of your fine products. I can only go by the book I have, which ever edition it actually is. Ray Larabie gifted it to me from his original supply, so working on that info —- which edition do I have? I am willing to swap it for one with larger descriptive text setting if one is available.\n\nThe imprint reads:\n\nFirst Edition.  \nFirst Printing: September 2002.\n\nPublished by P-Type Publications  \nPO Box 770  \nBuffalo NY 14213\n\nDesigned in the USA  \nPrinted in Hong Kong\n\nj a m e s\n\n"
    },
    {
      "time": " 28.Oct.2008 10.52am",
      "content": "James is referring to the original printing; I sent him my copy. We had to create our own specimens which, in retrospect is rather odd. I’m not a graphic designer so I had to plonk down cash for Illustrator just to be involved. I’ve been in many font books since then but I’ve never had to create my own specimens. It was very, very expensive to get in on Indie Fonts 1 and impossible to sell, at least with Canadian shipping costs. In two years I managed to sell 2 books. We (the participants) were told not to drop the price so I was unable to offer them at a discount. I later noticed that the book store versions had jackets but mine did not. A couple of years later I asked Tamye/Richard if I could lower the price as they hadn’t been selling and was ignored twice. Perhaps I could have sold some if I could have dropped the price. So I donated/dumped about 70 books to/at a college and didn’t bother keeping one for myself. So, at least for me, Indie Fonts was a bad experience. But I thought it looked pretty good.\n\n"
    },
    {
      "time": " 29.Oct.2008 3.52am",
      "content": "From memory of correspondence between Ray and myself, Rina managed to sell a few copies on Ebay at a snipped price, and that was the only way Ray was able to sell any of the substantial number of the books allocated to him.\n\nA technical note for James Grieshaber and Richard Kegler—Indie Fonts could have been a much better designed book if you had made the page / book format rectangular in a landscape orientation. A rectangular format would have allowed twice as much width for the columns containing the descriptive text set in Faceplate sans condensed and left an adjacent square area for each font sample. You would have wound up with a rectangular-shaped book and lost the square appearance, but at least the area for the font samples would still be square, and the column for the descriptive text would have been wide enuff to use a normal width font or the same Faceplate condensed series at a larger point size.\n\n@Kegler: _Your definition of “substantial”, may be different from most, or at least misinformed._\n\n“substantial” is a subjective word with variable meaning depending on context and the person using it. I spoke of participants having “substantial difficulty selling any of the copies of the book given to them by its publisher in exchange for the substantial sum of cash they handed over to be featured in [one or another Indie Fonts book]”. Apart from that, I haven’t defined “substantial”. I only used the word twice. How readers define my use of the word is largely up to them, as I did not give any figures or sums.\n\nAccording to Ray, the “substantial” difficulty he had selling any copies of the books allotted to him was quite substantial, so substantial he wound up giving most of his stock away. How substantial was the fee paid by participating font makers to be featured in the IF books? I don’t know because nobody has ever given me a figure in dollars, and I haven’t quoted any figure(s). So there goes that. People will have to use their imaginations.\n\n_The books that James A is no doubt referring to is the Rockport publishers reprinting of the Indie Fonts books._\n\nIncorrect. Mine is a first edition printing. The imprint proves that.\n\n_To answer your “Why why why”, it is because you bought your indie fonts book from someone selling the Rockport reprints rather than directly from a foundry who was in the books. The small text is in the Rockport Edition._\n\nWrong. It’s a first edition. Evidently you are making excuses for what is a poorly-designed book.\n\nj a m e s\n\n"
    },
    {
      "time": " 29.Oct.2008 6.12pm",
      "content": "I am sorry Ray, I didn’t know you had such a hard time with it. It was an experimental concept in co-publishing a specimen book. Each foundry did design their own sections, giving freedom to show their work as they saw fit. We were not out to fleece anyone. We did at one point offer to buy back copies of Indie Fonts 1 we also had foundries buy extra copies. I think the exposure garnered from being in the book hasn’t hurt anyone involved. I have never intentionally ignored any email, so I am sorry there Ray, the request to have everyone keep the price at retail for a while was not for that long and I recall sending emails to say you could sell as you saw fit. There must have been a us/can border email filter. You lived an hour away from us at the time. Funny how the internet warps actual proximity.\n\nThe “fee” was less than the cost of a quarter page ad in a monthly design magazine. In Indie Fonts each foundry had 17 pages.\n\nI am sorry James, I assumed that because you were complaining about the small text that you were referring to the second edition. By comparison the first edition text is huge. The apparent lack of success in design leaves an opportunity for you to do it one better. Feel free.\n\n"
    }
  ]
}
