{
  "id": "5095",
  "title": "Canevas",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "I'm working on this shapes since 2 months, and I really need your mind now...   \n(don't think there is grey in this image, that's only proud and honest black)   \n ![canevas](http://web.archive.org/web/20150424022712im_/http:/www.typophile.com/forums/messages/29/377.gif)\n\n",
  "author": "gregorycadars",
  "time": "17 Sep 2001 — 10:00am",
  "uid": "724",
  "comments": [
    {
      "time": "17 Sep 2001 — 11:13am",
      "content": "Pretty cool idea! The only problem I see is that the diagonals are too light. BTW, you might consider making a filled-in version of the font, so that people can layer the patterned one over it, in different colors.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Sep 2001 — 2:53pm",
      "content": "Reminds me of old American cross-stitching! Great.   \n   \nI also like Hrant's idea. That could prove very interesting at larger scales (200%, 300%, etc.)   \n   \n//joe\n\n"
    },
    {
      "time": "17 Sep 2001 — 8:03pm",
      "content": "Superb work. Very original. I'm not a fan of the trend towards teeny tiny fonts on web pages, but this one proves that it's possible to make something beautiful out of just a handfull of pixels.   \nNow that it has been pointed out, those V and W stresses look wrong to me, and I think I'd prefer it done the normal way.\n\n"
    },
    {
      "time": "17 Sep 2001 — 11:57am",
      "content": "It's so great to see something as fresh and original as this, with definate historical roots. I don't think I've seen anything like it in the bitmap stuff being designed these days...\n\n"
    },
    {
      "time": "17 Sep 2001 — 7:53pm",
      "content": "Wow, that's a beauty!   \n   \nThe only other comment I'll make is that the u&lc V and W (and to a lesser extent, uc Y) look backward in their stress. Was that intensional, to have the heavier strokes on the right side as opposed to the more traditional left side?   \n   \nIt does add an interesting quirk, so I'm not entirely sure that it's a bad thing.\n\n"
    },
    {
      "time": "3 Oct 2001 — 6:24am",
      "content": "BEAUTIFUL!!!!!\n\n"
    },
    {
      "time": "5 Feb 2002 — 3:17pm",
      "content": "Thanks a lot for all your comments and consultings!   \n I've changed the Uc V and W cause it was not intentional (thanks David!) and it works better like this; and made a wide version of the Uc.   \n I work on kerning settings now because fixed letterspacing doesn't work.   \n The five last chars VWXYZ are really refractory to the grid constraints so they seems strange in the reg and wide version: I'm waiting for a pixel miracle.   \n ![ok](http://web.archive.org/web/20150424022712im_/http:/www.typophile.com/forums/messages/29/754.gif)\n\n"
    }
  ]
}
