{
  "id": "50972",
  "title": "Building a Typeface Library",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have been reading this site for just under a year, and I’m deeply impressed by what I have read and by the people who have written it. I am nothing like a professional, so I hesitate writing this; I hope you’ll forgive me if I express myself poorly or use incorrectly what little terminology I know.\n\nI am in the process of trying to build a quality (professional?) typeface collection. This will likely be a life-long process, and I hope I have taken a couple steps in the right direction, but it’s time to move forward a bit farther.\n\nMy first purchase was Brioso Pro (opticals) from Adobe when it first came out. I’ll never forget the day I received the type magazine from Adobe in the mail: I devoured the article on the new typeface. Looking at the examples on the page, I saw through the Italian Renaissance all the way back to the Carolingian—and on back to Rome and Greece. I had never been so impressed with a modern serif. I had to have it and purchased it immediately. I love this typeface; I feel fortunate to own (license) it.\n\nA while ago, I was trying to find a really good sans serif that I would love and want to use as much as Brioso. I posted on here asking for advice and received some great suggestions. I’m still looking, but I have narrowed down the field to a few choices: Helvetica Neue, Avenir, and Gotham. While I was looking at Gotham, I discovered H&FJ. And then I discovered Requiem and the Historical Allsorts collection. Requiem. What a beautiful and elegant typeface. I think of Brioso when I look at it, and have the same historical telescoping sensation. And the Allsorts collection, not surprisingly, has a similar impact upon me.\n\nThis past Friday and Saturday, I spent hours and hours researching Requiem (with the occasional sidetrack), a great deal of it here on this site (along with the H&FJ site) and I learned a few things which caught me by surprise.\n\nI hesitate mentioning the first thing that surprised me because it’s clear that there’s some…disagreement…on this site around this issue, but, there are no bold (or semi-bold) fonts for Requiem or Fell (Allsorts). I never even noticed that during all my visits to H&FJ to look at the typeface. I’m really rather embarrassed that I didn’t notice the fact till I read a complaint about it here! Now, as soon as I read it, I thought back, and it’s true as some have said there seldom seems a need for it, at least in some instances, but it seems to me there are other uses where it would be handy (I’m thinking of examples from the Lewis & Short Latin Lexicon and some other scholarly works). Bold fonts seem to give one more level of visual organization. Now, perhaps I could use Brioso for dictionary-type settings, and Requiem for other, more literary settings.\n\nIn reading this site, here are the issues which concern me—and which no doubt show my lack of experience and training:  \n1) Proper superiors (do they exist for this typeface?)  \n2) Requiem’s lack of bold or semi-bold fonts (and other typefaces from H&FJ)  \n3) The lack of OpenType formats  \n4) Style-linking (is this the right term…using keyboard commands to go from Roman to italic?)  \n5) The licensing, eg, saving my work as PDFs (at least the one from H&FJ)\n\nOK, I’ve clearly strayed from my original intent of asking about expanding my typeface collection. Here is my current plan, funds permitting:\n\nI have Brioso, and through my research on here learned that I also have Arno Pro (lovely! Thank you CS3). This weekend I had intended to buy Requiem and the Historical Allsorts (currently on hold while I try to learn more). Next, I’d love to buy Hoefler Titling and Text—those patterns and fleurons are exquisite and I’d love to produce some Victorian-styled works. Then on to Adobe’s Garamond Premier Pro (opticals). Somewhere in there I also need to pick up one or more of the above-mentioned sans serif faces.\n\nI also have a strong attraction to Didot and Bodoni (but not…?…Bauer?).\n\nOh, and if I might be permitted, could someone point me towards some quality reproductions of Medieval and Ancient scripts? I’m thinking particularly of various Gothic and Batarde scripts. I know there was a company that was doing some amazing digital reproductions of certain works (The Grammar of Ornament?). I thought the company’s name started with an “A” but I can’t find anything. Anyway, there are tons of knock-offs out there, but that’s not what I want.\n\nI have some friends who are priests, and one reason for some of my choices would be a personal project to create sections of the Office (Breviary) as gifts. I also have something of a scholarly leaning, so Garamond’s Greek (polytonic) is an added bonus. (I see there was a problem displaying polytonic Greek with Adobe’s Garamond (or InDesign CS2) at one point. I wonder if that’s been fixed?)\n\nWell, this is a much longer post than I had intended. Thank you for you patience, and I look forward to reading any replies!\n\nRegards,\n\nKeith\n\nPS I hope the “problems” I list for Requiem aren’t taken as anything but personal problems, and likely due to my own ignorance and lack of proper training! I am deeply impressed with H&FJ, and the beauty and quality of their work. And may I just say the examples they use to illustrate each typeface’s potential are inspiring! I wish I could get a specimen PDF containing these examples when I buy the typeface! (Perhaps they do offer such a thing.)\n\n [‹ Wedding Invitation Font Suggestions?](http://web.archive.org/web/20081201111935/http:/typophile.com/node/51187 \"Go to previous forum topic\") [Spanish Pangram? ›](http://web.archive.org/web/20081201111935/http:/typophile.com/node/51119 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201111935/http://typophile.com/user/28250\" title=\"View user profile.\">keithdvo</a>",
  "time": "<br>",
  "uid": "28250",
  "comments": [
    {
      "time": " 27.Oct.2008 12.15am",
      "content": "Hello Keith,\n\nfor the questions regarding Requiem, the best things is to get in [contact with the foundry directly](http://web.archive.org/web/20081201111935/http:/www.typography.com/about/contact.php), I guess.\n\nThe question of the appropriateness of having bold styles and the pitfalls of style-linking have both been brought up repeatedly by one dedicated member – and they have been discussed here:  \nRe #2: [Why doesn’t Cycles have bold and bold italic?](http://web.archive.org/web/20081201111935/http:/www.typophile.com/node/38645)  \nRe #4: [Fonts that lack keyboard links](http://web.archive.org/web/20081201111935/http:/typophile.com/node/38914)\n\n<cite>quality reproductions of Medieval and Ancient scripts? I’m thinking particularly of various Gothic and Batarde scripts.</cite>  \nA fresh bâtarde flamande: [Givry](http://web.archive.org/web/20081201111935/http:/www.type-together.com/ampl_font.php?idpuente=18&nomfuente=Givry)\n\n<cite>I also have a strong attraction to Didot and Bodoni </cite>\n\nWhat do you think about [Prillwitz](http://web.archive.org/web/20081201111935/http:/www.germantype.com/cms/front_content.php?idart=98&lang=2)?\n\nF\n\n"
    },
    {
      "time": " 2.Nov.2008 8.51am",
      "content": "Florian,\n\nFirst, my apologies for taking so long to respond. Work took over most of my week.\n\nRegarding Prillwitz, it’s nice actually, but speaking only personally, it just doesn’t have the same impact for me, though I’m at a loss to explain why.\n\nOn the other hand, Givry is lovely! Thank you so much for recommending it. I’ve added it to my (growing) list of typefaces to buy (thanks a lot! ).\n\nBefore I say anything more, let me again repeat that I am not a professional typographer. My opinions are formed only what (little) I have learned on my own, and my profound love for the written word.\n\nThank you sharing those two threads with me. I learned a lot from them, especially the second one regarding keyboard links. I was completely unaware of the issue until I started reading about it on this site. It certainly seems like an issue the industry should address, and perhaps it is. it can be exciting to come in on something like this and perhaps even contribute to the discussion. I was a Windows user, and just this past May bought a Mac Pro (I still love Vista and installed it via Fusion on my computer), but I am completely in love with my Mac. There are things Windows does differently, of course, and some things that, well, it does better. I wouldn’t be surprised to find that handling type isn’t one of them.\n\nI can see now that I will have to make some Global Styles to avoid this problem.\n\nAs for adding bold (or bold italic) to a typeface, I have to confess I’m probably still more for it than against it. Now, I don’t design type, and therefore I don’t know how hard it must be, though I can at least make a decent guess. When I think back on most of the works of fiction I’ve read, I can readily admit that bold was not used, or at least unnecessary. That realization alone was eye-opening. However, it is clear from reading a couple threads that spun off from “Why doesn’t Cycle’s have bold…” that there was a desire, a legitimate desire for emphasis, and not only for commercial works but academic as well. Perhaps I’ll have to purchase some Clarendons now as well.\n\nI certainly respect a designer’s decision not to include bold and bold italic, but I hope some will consider it, or perhaps at least make suggestions for other typefaces they feel complement their own work and provide that extra level of emphasis which some designers may wish for or need.\n\nWhat an amazingly great resource this site is!\n\nMy thanks for your advice and suggestions,\n\nKeith\n\nFabricando fabri fimus.\n\n"
    }
  ]
}
