{
  "id": "50992",
  "title": "Designing for Education. (Logo critique)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all,\n\nI'd like to get your feed back and suggestions on a logo I'm working on for a Education Program sponsored by a local public school system. I'd also like to get some general feedback on designing in education. I've designed for education programs before and I have a really hard time getting my clients past clipart and 'chalkboard' They love it... Does anyone have any examples of good design in education (I'm talking elementary-high school) or have any comments on what works well generally.\n\nTo the issue at hand. I'm designing a logo for a 'community learning center\" It's a center where kids can go after school to take classes not available in the ciriculum or classes to supplement their required courses. The name of the federal grant is the \"21st Century Community Learning Center\" The administrative folks call the program CLC. They want to brand the 2 locations in the town differently and they've chosen a train theme. 'Jefferson Junction' and 'Lincoln Station.' So the logo needs to evoke EDUCATION and TRAIN. I've attached my concepts so far but I'm missing it. any Help?\n\ntré\n\n| Attachment | Size |\n| --- | --- |\n| [CLC\\_smile.png](http://web.archive.org/web/20131004143431/http:/typophile.com/files/CLC_smile.png) | 5.73 KB |\n| [CLC\\_Train\\_engine.png](http://web.archive.org/web/20131004143431/http:/typophile.com/files/CLC_Train_engine.png) | 9.21 KB |\n| [JJredsign.png](http://web.archive.org/web/20131004143431/http:/typophile.com/files/JJredsign.png) | 14 KB |\n| [JJredsign.png](http://web.archive.org/web/20131004143431/http:/typophile.com/files/JJredsign_0.png) | 47.46 KB |\n| [Pencil Tracks.png](http://web.archive.org/web/20131004143431/http:/typophile.com/files/Pencil%20Tracks.png) | 43.56 KB |\n| [tracksguy.png](http://web.archive.org/web/20131004143431/http:/typophile.com/files/tracksguy.png) | 7.13 KB |\n| [Train\\_Bus.png](http://web.archive.org/web/20131004143431/http:/typophile.com/files/Train_Bus.png) | 13.98 KB |\n| [wigwam\\_pencil.png](http://web.archive.org/web/20131004143431/http:/typophile.com/files/wigwam_pencil.png) | 11.6 KB |\n\n",
  "author": "tre",
  "time": "27 Oct 2008 — 2:38pm",
  "uid": "30264",
  "comments": [
    {
      "time": "27 Oct 2008 — 3:36pm",
      "content": "To me a lot of these seem a bit old: the delicate serifs, old-style train drawings, hm.. it just doesn't seem to fit with am elementary - high school age-group. I would go for the subway graphics kind of angle, key colours, bold sans, ideograms that kind of thing.\n\n"
    },
    {
      "time": "27 Oct 2008 — 5:49pm",
      "content": "Yeah I see your point. When I thought of trains and schools I got pictures of MS Word clip art pictures of trains in my head. I guess that means I'm getting old. One other thing I was trying to achieve is I know that this logo will only be printed in black in white because of budget so I wanted to avoid using any color.\n\n"
    },
    {
      "time": "28 Oct 2008 — 5:40am",
      "content": "Similar thoughts to Nicholas. For a train image I'd try a very simple monorail. Any track could then be a single bold line like a subway map. You wouldn't risk the \"bent ladder\" look of trying to draw a slightly more literal train track, as in the Pencil Tracks.png.\n\nThink more about the clarity of station signs. [Here are some British ones.](http://web.archive.org/web/20131004143431/http:/railfoto.fotopic.net/c22648.html) (I love the vowel-less Welsh one in the middle of the second row.)\n\n"
    },
    {
      "time": "28 Oct 2008 — 6:34am",
      "content": "Great insight. I'm working on some new versions. I really had no direction when I started this project so this helps a lot. One other obstacle I ran into with the first round of logos i did was, I was designing the logos in a \"train industry style\" So I was using colors and mimicking the style of railway signs, companies, stations etc. What I ended up with was a logo that looked like a railroad company logo. I didn't look like it had anything to do with education. I can't figure out how to capture that with out adding the cliché 'kids holding hands,' or a book or a pencil.\n\n"
    },
    {
      "time": "28 Oct 2008 — 10:59am",
      "content": "You have a difficult challange, imagery that will appeal to elementary students will not necessarily appeal to high school students. You need to simplify the design. Will both locations have the same programs? or will one cater to younger children and the other to older kids? What I mean is, can the two marks be related or do they have to match exactly? The train drawings should be more iconic, less cutsie. Play more with the typography, the faces you have been working with seem stiff and old-fashioned for this project. On the clc train version it was difficult to read Jefferson Junction. Push yourself a little more - have fun with these logos.\n\n"
    },
    {
      "time": "29 Oct 2008 — 2:51pm",
      "content": "The program in specific will be geared toward mostly younger 1st-5th grade students. What I was referring to earlier was that style of artsy school-house bulletin board decoration crap that seem to be pervasive in the education system, k-12. There's got to be a name for that style...see below. What ever it is its horrible but it's all I can think of when I think education and design.\n\n ![](http://web.archive.org/web/20131004143431im_/http:/typophile.com/files/phpThumb_cache_edupics_4042.com_src364276957ee5b1dde342828b945cd370_par09ff33df758b5f7c5623216939181bf7_dat1188199978.jpeg)\n\n ![](http://web.archive.org/web/20131004143431im_/http:/typophile.com/files/B-56_5677.jpg)\n\n"
    },
    {
      "time": "29 Oct 2008 — 3:01pm",
      "content": "On second thought maybe the above style is exactly what the project calls for... any thoughts? The pencil with sunglasses is growing on me, kinda looks like a bloke you could sit and swill a pint with.\n\n"
    },
    {
      "time": "29 Oct 2008 — 6:24pm",
      "content": "the illustrative style you've posted recently is a LOT more friendly than your attemps.\n\nthey have character and a sense of fun ... which the original design lack.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131004143431/http:/www.solid-creative.com/identity.htm)  \n [Bicycle Film Festival](http://web.archive.org/web/20131004143431/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "29 Oct 2008 — 8:34pm",
      "content": "Agreed, but is a smiling backpack really good design?\n\n"
    },
    {
      "time": "30 Oct 2008 — 7:55am",
      "content": "Well is it communicating friendliness and education? If so then it's succeeding and therefore good, no? You might want to review children's books to see art styles that will be appealing to your particular audience.\n\n"
    },
    {
      "time": "30 Oct 2008 — 9:08am",
      "content": "I suppose, but I always hated that style even as a kid. I always thought is was so corny. Can anyone relate? I'm working on some redesigns now in a more playful style, I think you guys are right and it's what's going to appease the client.\n\n"
    },
    {
      "time": "30 Oct 2008 — 9:18am",
      "content": "Here's some more insight from the programs coordinator.  \n\"The audience is really the 1) children and their families and 2) the  \ngeneral public as this grant is intended to be supported by community  \npartnerships but it's all about the kids and families getting more help  \nto move them forward to be successful members of society.  \nI think the logos you just sent are too cutesy (but maybe that's  \nbecause I feel like you do about education art).  \nBut, I do think your feedback has a point.  \nMaybe the latest train you did could be may to look cuter and  \nincorporated into the soaring tracks???  \nThat would be a compromise. What do you think about that?  \nWe have an advisory council meeting on Monday morning at 7:30 a.m. This  \nshould be a good group to bounce this off of (except they know nothing  \nabout branding).\"\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:39am",
      "content": "Here's the latest. I like where this one is going a lot better. it balances whimsy/playful look with out making it look like the smiling apple style above. Type face I'm not sure about yet. I like serifs for the project. Serifs say education to me. I think it's from all the papers I've handed in in Times New Roman. The train car transition icon I think lends itself well to the project. Going from a child's toy caboose to a mono rail engine car shows progress from childhood to modernity. The monorail rendering still needs some work. I want to keep it simple but I don't want it to look like a boat. Thoughts\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:51am",
      "content": "I don't see any new designs. Is it a fluke with my computer?\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:04am",
      "content": " ![](http://web.archive.org/web/20131004143431im_/http:/typophile.com/files/Untitled-1_6705.jpg)\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:56am",
      "content": "there it is. technical difficulties.\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:15am",
      "content": "I'm definitely didn't get the monorail shape.\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:21am",
      "content": "This is an improvement. Get some stock of trains to use as reference. I don't mind mixing an old fashioned caboose with a monorail engine but the drawings need to be better. Right now the engine resembles a polar bear. I think I'd also like to see the rectangle more elongated. The proportion is too close to the square. Your font choice is still too formal for the subject, go to some font sites, browse their samples and get inspired.\n\n"
    },
    {
      "time": "31 Oct 2008 — 12:29pm",
      "content": " ![](http://web.archive.org/web/20131004143431im_/http:/typophile.com/files/JJ7_6601.0.png)\n\nthe monorail is tough and I totally saw the polar bear. I had a rendering that looked like a monorail but it was more detailed the the others and didn't fit, looked to much like a technical drawing. I think the last one was a step in the right direction but maybe tried to do too much. what about this 'little engine that could' inspired logo.\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:31pm",
      "content": "These are illustrations, not logos.\n\nWhat if you used the steam from the engine in the last image there as the main piece for the mark, and placed it coming out of the \"J\" in \"Jefferson\"? Could be a dumb idea. I just think you need to simplify what you're trying to do here.\n\npenn\n\n"
    },
    {
      "time": "2 Nov 2008 — 7:12pm",
      "content": "and it doesn't strike me as something that would appeal to students/children\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131004143431/http:/www.solid-creative.com/identity.htm)  \n [Bicycle Film Festival](http://web.archive.org/web/20131004143431/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "3 Nov 2008 — 7:36am",
      "content": "Kirsten, I'm glad you saw a polar bear, too. I didn't want to say anything, but that's the first thing I saw.\n\nPenn is right - they are too illustrative. A logo should be scalable, and these drawings will not scale well at all.\n\nIn the latest drawing, I see steaming blocks coming out of a Frankenstein head (of course, it was just Halloween, so maybe I'm still stuck in monster-mode) :).\n\n"
    }
  ]
}
