{
  "id": "51003",
  "title": "looking for ink-saving display typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "i'm looking for a ink-saving display typeface. it should have the following properties:\n\n1. sans or display.  \n2. contemporary (not cheap looking)  \n4. ink-saving.\n\nwe air brush a lot of ink that is expensive on large banners up to 100 meters in length using laser-cut patterns. i have found a good, but still not the best choice: Soho Gothic Medium. do you know a better typeface for this?\n\n",
  "author": "ghurman",
  "time": "28 Oct 2008 — 3:28am",
  "uid": "19465",
  "comments": [
    {
      "time": "28 Oct 2008 — 5:03am",
      "content": "How does Soho Gothic Medium save ink? Just curious how that works. The first type styles that come to mind would be stencil types, or dot matrix types where the letters are not solid.\n\n"
    },
    {
      "time": "28 Oct 2008 — 6:32am",
      "content": "[Hairline fonts?](http://web.archive.org/web/20131021073104/http:/www.typophile.com/node/18439)\n\n"
    },
    {
      "time": "28 Oct 2008 — 6:33am",
      "content": "You can find a lot of [ink-saving light weights here](http://web.archive.org/web/20131021073104/http:/www.linotype.com/de/183977/agilita-schriftfamilie.html).\n\n"
    },
    {
      "time": "28 Oct 2008 — 6:49am",
      "content": "Large banners would seem to need large type to be legible from a distance. So, it seems that ink-heavy faces would be the best choice from a design perspective. As mentioned, perhaps line screening or otherwise patterning the face would allow you to save a few bucks.\n\n"
    },
    {
      "time": "28 Oct 2008 — 8:26am",
      "content": "mmm, dot matrix may work in some cases. stencil typefaces can look odd to the customers.\n\nhow does Soho Gothic save ink: look at the upercase G of Soho Gothic it's minimalistic but still an easily recognizable G. another thing about Soho Gothic: it's an attractive, contemporary typeface, neither that bold like Helvetica Regular nor awkward like Arial.\n\nwe don't print backgrounds, only headlines and logos. the usable letter weight of Soho Gothic for our purpose is Medium or Regular. bold and black would take up too much surface. hairline is not display except if you're lucky. in rare cases we can use stencil and hairlines.\n\nthe banners are outdoor ads. it's about the effective surface that the letters occupy, the smaller the surface the less ink will be spent. we buy ink in gallons.  \ni would like to take bold typefaces but the ink is simply expensive at large banner sizes.\n\n"
    },
    {
      "time": "28 Oct 2008 — 8:10am",
      "content": "[Outline fonts](http://web.archive.org/web/20131021073104/http:/www.myfonts.com/browse/keyword/outline/)?\n\n"
    },
    {
      "time": "28 Oct 2008 — 8:59am",
      "content": "This is a peculiar question! :-)  \nIt sounds like you're not looking for huge savings, which makes this quest seem hopeful. Very light weights can't work for functional reasons, but here are some ideas:\n\n- Fonts with heavy trapping, like FB Amplitude or this:  \n [http://www.type.fi/SuomiTang.html](http://web.archive.org/web/20131021073104/http:/www.type.fi/SuomiTang.html \"http://www.type.fi/SuomiTang.html\")\n\n- Fonts that are made of up interrupted patterns, like:  \n [http://www.myfonts.com/fonts/letraset/cabaret/cabaret/](http://web.archive.org/web/20131021073104/http:/www.myfonts.com/fonts/letraset/cabaret/cabaret/ \"http://www.myfonts.com/fonts/letraset/cabaret/cabaret/\")  \n(But contemporary.)\n\n- I think the best solution might simply be inline fonts:  \n [http://www.myfonts.com/search?search%5Btext%5D=inline](http://web.archive.org/web/20131021073104/http:/www.myfonts.com/search?search%5Btext%5D=inline \"http://www.myfonts.com/search?search%5Btext%5D=inline\")\n\nhhp\n\n"
    },
    {
      "time": "28 Oct 2008 — 9:32am",
      "content": "the less ink you use per square foot of text, the lighter the average colour, and the less visual impact you have, so what's the real savings?\n\nIf you use outline fonts, or an interupted pattern, you'll have more cutting time to make the paterns, which is probly more expensive than the ink.\n\nMaybe just apply a lighter coat or thin the ink?\n\n-=®=-\n\n"
    },
    {
      "time": "28 Oct 2008 — 10:35am",
      "content": "If upper and lower case, Futura Mini or Avant Garde.\n\n- large x-height (less ink used in capitals)  \n-\"missing\" bits on letters, such as no tail on \"t\" and \"j\"  \n-minimal, single-bowl forms of a and g.\n\nAlternatively, a face that works well with ample letterspacing, such as DIN or Interstate, because it can be used smaller.\n\nAlso consider a good editor, for shorter words, and the use of understatement and \"white space\" to convey your message.\n\n"
    }
  ]
}
