{
  "id": "51018",
  "title": "What format would a German doctoral thesis of 1910 be in?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "My daughter's working on props for a play, in which one of the characters presents their thesis. The scene is pre WW1, in Germany, and it's in chemistry.\n\nWould this be typewritten or hand written? What size paper? If handwriiten, on ruled or unruled paper?\n\nAny ideas?\n\n",
  "author": "John Nolan",
  "time": "28 Oct 2008 — 10:32am",
  "uid": "711",
  "comments": [
    {
      "time": "28 Oct 2008 — 11:42am",
      "content": "Typeset in Fraktur.\n\nhhp\n\n"
    },
    {
      "time": "28 Oct 2008 — 12:15pm",
      "content": "\\>My daughter’s working on props for a play, in which one of the characters presents their thesis.\n\nProviding Mark Simonson sits at the back it really doesn't matter.\n\n"
    },
    {
      "time": "28 Oct 2008 — 12:17pm",
      "content": "\\>Would this be typewritten or hand written?\n\nAt that time it would have been a real manuscript = written by hand = manu scriptum. Typewriters were used at that time by only very few authors, for instance by Nietzsche. For samples, also of paper size, see here:\n\n[http://www.stephan-guenzel.de/Texte/Guenzel\\_Nietzsche-SM.pdf](http://web.archive.org/web/20131018065350/http:/www.stephan-guenzel.de/Texte/Guenzel_Nietzsche-SM.pdf \"http://www.stephan-guenzel.de/Texte/Guenzel\\_Nietzsche-SM.pdf\")\n\n"
    },
    {
      "time": "28 Oct 2008 — 12:39pm",
      "content": "Nietzsche purchased his typewriter in 1882 (according to the Atlantic). Don't know how popular they became over the next 30 years.\n\n"
    },
    {
      "time": "29 Oct 2008 — 2:43am",
      "content": "Thanks to all for that, and Uli: thanks for that info, and the interesting link.\n\nI had heard about Nietzche's typewriter, but hadn't seen samples. \"Über-schrift?\"\n\n"
    },
    {
      "time": "29 Oct 2008 — 4:56am",
      "content": "Marvellous to see the illustrations of Nietzsche's typewriter script.\n\nWith regard to the presentation of the thesis, I am not so sure that it could be presented in any of the ways proposed at the time of WW1. Certainly, in the 1930s, in America, at Columbia, a doctoral thesis was only considered presentable when printed in book form by, for example, no fooling, and entirely coincidentally, Columbia University Press. The expense entailed ($500? a small fortune in those days) delayed, sometimes for years, the awarding of doctorates to impecunious candidates, some well known to me. I would be surprised to learn that things were any less strict under the German system just a decade or two earlier. Certainly the American system was draconian to an extreme, and was gradually abandoned.\n\n"
    },
    {
      "time": "29 Oct 2008 — 7:24am",
      "content": "When my dad did his PhD at Ohio State in the 50s, they had a bound book produced. I think in early 20th century Europe it would have been not exorbitant to produce a letterpress piece of modest length for something so significant in a person's life (it's not like today where they hand out PhDs for money and some time invested - back then you had to _invent_ something).\n\nIn any case, the important thing is that it be in blackletter.\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2008 — 5:45am",
      "content": "Hmm... A chemistry PhD might not have been set in blackletter, Hrant (if it was typeset at all...). Didn't many in the sciences publish in serif typefaces? Before WWI, there were vigorous debates as to whether German should be set in Fraktur or serif typefaces. This implies to me that quite a lot of content was being printed in serif type. Otherwise, the discussion would not have been a big one.\n\n"
    },
    {
      "time": "30 Oct 2008 — 6:35am",
      "content": "Not a scientific poll but perhaps some evidence for Dan's point:  \nIn a [Google Books search for German books between 1900 and 1920 containing the word Chemie](http://web.archive.org/web/20131018065350/http:/books.google.com/books?as_q=chemie&num=10&lr=&as_brr=0&btnG=Google+Search&as_epq=&as_oq=&as_eq=&as_brr=0&lr=lang_de&as_vt=&as_auth=&as_pub=&as_sub=&as_drrb=c&as_miny=1900&as_maxy=1920&as_isbn=), 9 out of the 10 matches on the first page are in Roman type.  \n(These appear to be mostly textbooks and academic journals.)\n\n"
    },
    {
      "time": "30 Oct 2008 — 6:51am",
      "content": "The scientific community preferred Roman type, blackletter was used for novels etc. - AFAIK, theses were printed only after they had been accepted, so a draft in a play might well be handwritten.\n\n"
    },
    {
      "time": "30 Oct 2008 — 8:33am",
      "content": "\\> The scientific community preferred Roman type, blackletter was used for novels etc.\n\nOK, I'm starting to remember that too - sorry.  \nDamn shame though.\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2008 — 8:37am",
      "content": "I agree, Hrant, I agree!\n\n"
    },
    {
      "time": "30 Oct 2008 — 10:07am",
      "content": "Damn you liberal elite scientific community for killing blackletter!\n\n"
    },
    {
      "time": "30 Oct 2008 — 10:29am",
      "content": "Can I have that on a t-shirt?\n\n"
    },
    {
      "time": "30 Oct 2008 — 11:29am",
      "content": "All of the non liberal elite scientific community ended up in heavy metal bands :-)\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2008 — 12:03pm",
      "content": " ![](http://web.archive.org/web/20131018065350im_/http:/typophile.com/files/tshirtbl_6306.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2008 — 12:50pm",
      "content": " ![](http://web.archive.org/web/20131018065350im_/http:/typophile.com/files/tshirtblDan_6548.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2008 — 2:50am",
      "content": "I see two options that I have also seen examples of while working in a digitisation project at the local university library:\n\n- handwritten with latin script, the acknowledgements and preface being handwritten in current script (not necessarily Sütterlin, but something similar); those were considered not to be part of the scientific text, which of course had to be in latin script.  \nThe sample I have seen was produced on an empty notebook of about 40 pages without rules, ca. 15x25cm. My guess for this choice in this case is the high number of formulas in the text (which was a mathematical dissertation if I remember correctly), and probably also a question of money.\n- typoscript. While not everyone had a typewriter ready at hand in the 1900-1910’s, there used to be quite a remarkable number of \"writing offices\" where you could get your stuff typed from manuscript and/or from dictating it to one of the (usually relatively young and well-educated, both male and female) typewriter operators. Think of the number of internet cafés these days for a comparison (of course this is not really a parallel development, but the idea is that some new technique is invented, not everyone uses it at home or can't afford it, suddenly someone offers it as a service).  \nIllustrations and/or formulae would still be handdrawn/written even in typed dissertations. I have seen an example from 1912 from the field of philosophy.\n\nWhich option was chosen might not only have been dependent from money issues, but also from the requirements the university needed you to fulfil. If you had to hand in several copies, it would have been easier and faster to type them or let them be typed by someone else because you could do carbon copies more easily than with handwritten things (still possible, but I have never seen a carbon copy of some 60 sheets of a dissertation in handwriting in any university library).  \nThe number of formulae would also have played a role, so depending on which specific field and application your hypothetical chemistry doctoral candidate would chose her/his options with regard to several other factors (money, having a typewriter or having the possibility to use one in e.g. some relative’s office, number of copies requested by the local university administration, …).\n\n"
    },
    {
      "time": "31 Oct 2008 — 2:59am",
      "content": "Sii, while I had a good laugh about the t-shirt-inducing slogan, I am not very sure what lead you to the idea that those were liberals…\n\n"
    },
    {
      "time": "31 Oct 2008 — 3:43am",
      "content": " ![](http://web.archive.org/web/20131018065350im_/http:/typophile.com/files/beer_4952.jpg)\n\n"
    },
    {
      "time": "31 Oct 2008 — 5:05am",
      "content": "Thanks everyone!\n\nStephen: that's really useful info. In the end, though, I think we'll probably print the thesis on a series of t-shirts.\n\n"
    },
    {
      "time": "31 Oct 2008 — 6:25am",
      "content": "Katharina!!! That is a scream! :-) The funniest part is that you chose someone with such an obvious beer-belly to use as a model :-)\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2008 — 8:46am",
      "content": "On a serious note:\n\nStephan said: \"...I am not very sure what lead you to the idea that those were liberals…\"\n\nInteresting question.\n\nNot only the scientific community favoured roman letters.  \nRoman letters were frequently seen and meant as a statement in favour of Roman tradition and hence the Catholic church - which had a strong political party in Germany and of course kept allegiance to the Pope of Rome. The catchword is \"ultramontan\".\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:02am",
      "content": "[Fritz K. Ringer: The Decline of the German Mandarins. The German Academic Community, 1890–1933.](http://web.archive.org/web/20131018065350/http:/www.amazon.com/Decline-German-Mandarins-Community-1890-1933/dp/0819562351/ref=sr_1_1/191-8800548-2458928?ie=UTF8&s=books&qid=1225468685&sr=1-1)\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:21am",
      "content": "Stephen, in the US, people who write stuff are all liberals, goldangit.\n\nKatharina, I want that shirt!\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:37am",
      "content": "\\>Stephen, in the US, people who write stuff are all liberals, goldangit.\n\nPeople who read stuff too (captions on Fox don't count). Actually unless you are a plumber, small town mayor, or own 7 homes you're a liberal.\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:41am",
      "content": "You forgot about gun lovers and extremist religious fanatics, Si :-)\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:07am",
      "content": "Katharina,  \nIf you get those T-shirts produced, I will buy one, too!\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:29am",
      "content": "me too!\n\n"
    },
    {
      "time": "31 Oct 2008 — 12:07pm",
      "content": "I would want one too, but only with \"correct\" ligatures ;-)\n\n"
    },
    {
      "time": "1 Nov 2008 — 1:03am",
      "content": "About this tee: I know that the two final \"s\" are wrong spelling, and that the \"ck\" needs a ligature; I did a fast and sloppy job. - If you are serious about wanting to wear one, I could have them made and send them as a Christmas present???\n\n"
    },
    {
      "time": "1 Nov 2008 — 8:12am",
      "content": "I am serious about wanting the T-shirt and I am also serious about paying you for it,\n\nChrisL\n\n"
    },
    {
      "time": "1 Nov 2008 — 12:14pm",
      "content": "Dear Chris, thank you so much for that image. It made my day.\n\n"
    },
    {
      "time": "1 Nov 2008 — 12:31pm",
      "content": "Anytime, my friend.\n\nChrisL\n\n"
    }
  ]
}
