{
  "id": "51021",
  "title": "Website redesign; help me pick a title font!",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm in the process of overhauling my personal portfolio website. The old site is viewable here: [http://www.BirdInTheCity.com](http://web.archive.org/web/20110430002252/http:/www.birdinthecity.com/)  \nI'm sticking with the vending machine concept, but just updating the graphics/individual pages for a more cohesive/slick/professional flow.\n\nI'd love some suggestions for picking a new font for the web title/logo at the top. I'm planning a redesign of the logo, but I'd like to keep a similar general aesthetic. I'll be using this font in various contexts (business cards, resume, etc), so I'd like for the font to work in many sizes. On the old site --the one currently posted-- I'm using Frutiger.\n\nIdeally, the criteria that I'm looking for in order of importance:  \n1) Mesh well with the little bird logo  \n2) Should denote \"Bold, Professional, with a little sense of fun\"  \n3) Perhaps slightly-retro?\n\nAny suggestions would be greatly appreciated!\n\nThanks,  \nBrian Bird\n\n",
  "author": "<a href=\"/web/20110430002252/http://typophile.com/user/10497\" title=\"View user profile.\">DizyDevil</a>",
  "time": "<br>",
  "uid": "10497",
  "comments": [
    {
      "time": "",
      "content": "Hi Brian, check out some of the typefaces by [Mark Simonson](http://web.archive.org/web/20110430002252/http:/www.ms-studio.com/fontsales.html). There are at least a few here that could work well.\n\n"
    },
    {
      "time": "",
      "content": "Helvetica is the best all-round font around, but it is pretty overused. It can look great in anything though.\n\nIf it's fun and retro you want, go with 'Cooper Black'. It's great! You may recognize it, easyjet use if for their branding. I think they utilized it pretty well.\n\nexample.\n\n ![](http://web.archive.org/web/20110430002252im_/http:/typophile.com/files/birdinthecity_3536.jpg)\n\nHope it helps you.  \npeace.\n\n"
    },
    {
      "time": "",
      "content": "I know you weren't asking for usability advice but I would avoid names for links like \"demo reel\" (just call it \"portfolio\" or \"my work\") and \"mr. goodblog\". Every time a user has to think about what a link is you risk them just giving up on your site entirely.\n\nOn another note, I graduated from IU in the same year as you! Woot, go hoosiers.\n\n"
    },
    {
      "time": "",
      "content": "Cooper black reminds me of Archie Comic Books\n\nI think the header right now could use some work but you could stick to something like Syntax or Verlag? Nice Sans serif with a little character. I'm not sure you'd actually have to try them to see if it works.\n\n--  \narjun\n\n"
    },
    {
      "time": "",
      "content": "Brian, my thought is to pick up on the thick and thin strokes in the little bird logo, and try to find a font that has similar features. I don't know if you would be willing to consider a script, but if so, you might try something like Ribbon 131 Bold (see sample below). Otherwise, perhaps you might try something like Bodoni Italic.\n\n ![](http://web.archive.org/web/20110430002252im_/http:/typophile.com/files/Ribbon%20131%20Bold%20Sample_5180.png)\n\n"
    },
    {
      "time": "",
      "content": "Wow, a big thanks to everyone on some great ideas! I'm leaning toward Chris' suggestion of Mark Simonson's fonts. Filmotype Glenlake seems like it might be a good fit.\n\nClint: I'm also digging the stroke idea. I'm trying to think of another way to incorporate it. I just feel like a script font is too formal.\n\nfi: that's awesome about IU! what was your major? Did you take any telecom classes? I also appreciate the usability feedback. I'm definitely hoping to incorporate some additional UI tweaks in the upcoming website revision. In fact, I am going to be replacing the \"Photos\" section with \"Projects\", but I'll probably keep the \"Demo Reel\" as it'll house my newest demo reel. I totally hear you about the UI's complexity. I have freelance clients all the time that ask for something similar in the sites I build for them. I always have to explain that my site doesn't work for 99% of websites. Since my job is selling web \"bling\", I can get away with it, but a normal e-customer would just give up on the site. In the next revision, I intend to add some additional interactive elements to help clarify that intention tho.\n\nKeep those ideas coming!\n\nThanks,  \nBrian\n\n"
    },
    {
      "time": "",
      "content": "you could also try your own handstyle?? After all, it's your blog, keep it personal.\n\n"
    }
  ]
}
