{
  "id": "5103",
  "title": "TBS",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "TBS has re-done its identity -- looks like they've dropped the \"Superstation\" and added a ramen bowl in its place.   \n   \n ![tbs logos new and old](http://web.archive.org/web/20131018221339im_/http:/www.typophile.com/forums/messages/4100/37649.jpg)\n\n",
  "author": "rotodesign",
  "time": "6 Jun 2004 — 10:11am",
  "uid": "2731",
  "comments": [
    {
      "time": "6 Jun 2004 — 11:41am",
      "content": "That looks so 70s. I don't know if I'd call it an improvement, when the first one wasn't so great to begin with...\n\n"
    },
    {
      "time": "7 Jun 2004 — 6:59am",
      "content": "I saw that this weekend. Looks like a public TV logo.\n\n"
    },
    {
      "time": "7 Jun 2004 — 9:53am",
      "content": "I agree darrel, my first reaction too. I bet they told Ted that the bowl is just a representation of his smile from making money hand over fist.\n\n"
    },
    {
      "time": "7 Jun 2004 — 11:14am",
      "content": "I think Ted sold TBS back in 2001 to AOL/TimeWarner/BigBrother...though he apparently regrets it.\n\n"
    },
    {
      "time": "8 Jun 2004 — 5:19am",
      "content": "Ramen bowl... hahaha.   \n   \nbut...   \n   \n(grrrr... still have trouble posting images. I was trying to do a side-by-side comparison with the ubiquitous [ABC](http://web.archive.org/web/20131018221339/http:/abc.go.com/) logo.)   \n   \nInferiority complex?\n\n"
    },
    {
      "time": "8 Jun 2004 — 2:33pm",
      "content": "Maybe the bowl is something you find in a bathroom. How fitting for television\n\n"
    },
    {
      "time": "8 Jun 2004 — 11:07pm",
      "content": "I think its a step in a better direction.   \nAs ambiguous as it may be, it definately leaves   \nthe identity open for growth, and futher/later definement, if that makes sense.   \n   \nAlong the lines of, a brand is what you make of it. If it is too visualy pigeonholed up front, it leaves less room for viewer to decide.   \n   \nHildebrant.\n\n"
    },
    {
      "time": "11 Jun 2004 — 5:15pm",
      "content": "I thought they were going with something more feminine because they have Sex and the City now.\n\n"
    },
    {
      "time": "12 Jun 2004 — 4:02pm",
      "content": "Patrick,   \n   \nThe ramen bowl analogy is hilarious, both me and my girlfriend laughed at it. =)\n\n"
    },
    {
      "time": "25 Jul 2004 — 10:34am",
      "content": "A edp\n\n"
    },
    {
      "time": "26 Jul 2004 — 11:08am",
      "content": "Don't they also use an exploding S in an oval in the left corner of the tv screen. I seem to recall seeing this.\n\n"
    },
    {
      "time": "27 Jul 2004 — 8:01am",
      "content": "I've changed my mind about the redesign since I've seen it in use. They wanted to have it float at the bottom of the screen semi transparent. So it makes sense to make it boxy and simple.\n\n"
    },
    {
      "time": "27 Jul 2004 — 3:59pm",
      "content": "It reminds me of the part of the egg that snaps open and the partridges jump out of in the credits of \"The Partridge Family\".\n\n"
    },
    {
      "time": "29 Jul 2004 — 8:20am",
      "content": "The first logo looks pharmaceutical. The newer version is ambiguous. It could be the logo for a pregnancy test kit.   \n   \n [http://giam.typepad.com/the\\_branding\\_of\\_polaroid\\_/](http://web.archive.org/web/20131018221339/http:/giam.typepad.com/the_branding_of_polaroid_/)\n\n"
    }
  ]
}
