{
  "id": "51048",
  "title": "Flyer I made for my current client. Yup, the same one. Need more advice:-)",
  "forum": "Design",
  "tags": [

  ],
  "content": "Ok, so this is a a6 flyer I designed for the client mentioned in my last post who thinks because I haven’t got commercial experience, I have to show this in my price. Anyway, I now how to come to a price for this flyer on top of all of this and I am worried that he may think exactly the same with this flyer. I would be happy to charge for this flyer £100, but he may think I am overcharging him again. I only have myself to blame as there wasn’t a contract and I sent him the design without getting the money first. He has got 5k printed onto 350gsm silk card. SO how much could I get for something along the lines of this one I designed. I just need a figure that I can go off for future designs.\n\n ![](http://web.archive.org/web/20081207232658im_/http:/www.typophile.com/files/eyecandyhair_frontblog_3859.jpg)\n\n ![](http://web.archive.org/web/20081207232658im_/http:/www.typophile.com/files/eyecandyhair_backblog_4152.jpg)\n\nthanks.:-)\n\n [‹ Font used for Amazon.com Logo](http://web.archive.org/web/20081207232658/http:/www.typophile.com/node/51056 \"Go to previous forum topic\") [How Do I Adjust Photos for Uncoated Paper? ›](http://web.archive.org/web/20081207232658/http:/www.typophile.com/node/51020 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207232658/http://www.typophile.com/user/38688\" title=\"View user profile.\">babyDahl</a>",
  "time": "<br>",
  "uid": "38688",
  "comments": [
    {
      "time": " 29.Oct.2008 4.11am",
      "content": "Commercial Experience? Ha? What a big pot of BS!  \nHey BabyDahl, tell that dude that unless he could do the job you did himself, with the software you used, then it is a commercial job you created. (And looks good!) You don’t need commercial experience to do a commercial/professional job. Some people pick things up quickly and have a professional eye without a degree or experience. I’ve seen some damn awful Graphic Designer who have degrees and commercial experience who turn out badly designed rubbish still after many years of practicing.\n\nAnd I bet in his industry there are bad hair stylists(or whatever they are calling themselves this week!)who trash your hair, even with all there commercial experience.\n\nWhat is the hourly rate for Design in the UK?\n\nIf you can’t find out, charge him £150 for being a smart pain in your rear end, and tell him next time you’ll charge more thanks to him giving you the now treasured COMMERCIAL EXPERIENCE!!  \nIf he was happy to print your job and his commercial business deemed it to be commercial and professional, then it is.\n\nNice work BabyDahl.Keep up the good work.\n\nCheers  \nDrj  \n(Over 15 years Graphic Design AND Commercial Experience....lol)\n\n"
    },
    {
      "time": " 29.Oct.2008 4.22am",
      "content": "wow, that was great. I will now tell him that!!!:-)))) Thanks for the comments.\n\nBTW- Dr Jack, I am not charging by the hour, but am gonna charge by the project based on the amount of work I put into it. More of a fixed price, i think.\n\n"
    },
    {
      "time": " 29.Oct.2008 4.57am",
      "content": "Now I should like to know what your client charges for the full monty: Hairdye with additional streaks in a different colour, a new cut, conditioning, blow drying, spray. I bet for this job - which should take approximately two hours - he asks nearly the same amount he is offering you for a complete corporate identity which could mean several weeks of designing.\n\n"
    },
    {
      "time": " 29.Oct.2008 5.51am",
      "content": "Rule number one in billing - client always pays the first 1/3 (or even 1/2) of the estimated cost upfront before any work begins. Otherwise you **will** be stiffed. This helps the client realize its serious and reminds them that they have a vested interest in a successful design process.\n\nAs far as billing by the project goes - it should reflect your hourly rate which should be a reflection of the value of your time, skill, effort, cost of living, and business operating costs. As you get better over time at estimating how much a given project will cost (in time and effort), you’ll be better at providing more accurate “per-project” quotes. But you’ll probably get dinged the first couple of times until you’ve got your “estimating framework” in order and calibrated...\n\nAs for your design - I would have ’shopped out the hair on the model’s cheek - it looks distracting. Type wise you’ve done well - good, clean typesetting and it’s quite readable. The facebook logo looks out of place though - too far off to the left and a heavier and darker typeface make it take more precedence then it should in the visual hierarchy.\n\n"
    },
    {
      "time": " 29.Oct.2008 6.01am",
      "content": "Well, I told him the price I charged and he was happy to pay. £100 was the price I set. Thanks for the comments.\n\nBemerx25, I agree with the facebook part, but nothing I can really do much about it now. Overall, he is happy and so am I. Your also correct about charging. I am now writing a contract out to give to clients to sign and get everything set down on paper. Have learned a lot from this.\n\n"
    },
    {
      "time": " 29.Oct.2008 7.08am",
      "content": "You definitely want to charge by the hour + any premium you warrant/can get.\n\nYou may not BILL or INVOICE by the hour, but you have to be sure you’re invoice reflects, at an absolute minimum, your hourly rate \\* time spent.\n\nOtherwise, you’re not really making any money.\n\n"
    }
  ]
}
