{
  "id": "51059",
  "title": "Myriad Font License",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nHas anyone ever used the Myriad font to develop a corporate logo? I would like to use this font for the textual part of a corporate logo however I do not know if its license allow me to do that! I know (from Wikipedia) that some big companies such as Wal-Mart. I tried to contact Adobe but after three weeks I still did not even have a reply!! Do not know where else to ask.\n\nThanks and Regards,  \nSim085\n\n",
  "author": "sim085",
  "time": "29 Oct 2008 — 9:15am",
  "uid": "38821",
  "comments": [
    {
      "time": "29 Oct 2008 — 9:34am",
      "content": "I'm not an expert, but I believe it's the norm rather than the exception to allow you to create corporate logos from most any font.\n\nIn otherwords, unless the license specifically prohibits it, you should be fine.\n\nSomeone please correct me if I am wrong.\n\n"
    },
    {
      "time": "29 Oct 2008 — 5:01pm",
      "content": "\\> _tried to contact Adobe but after three weeks I still did not even have a reply!!_\n\nHi Simon, which channel(s) did you use?\n\n"
    },
    {
      "time": "30 Oct 2008 — 1:53am",
      "content": "Hi again,\n\nFirst of all thank you for the replies. I personally read the 'Adobe Standard License Agreement‏' and I did not find anything that prohibits me from using the font for a corporate logo. However there are some legal terms which I could not understand and I do not wish to develop the logo and then later on find out that I cannot use it.\n\nThe logo will be mostly text based with some minor modifications on two letters. The modifications would not be done on the font files I purchase (which is obviously illegal) but by using the font in a graphical application such as Adobe Illustrator and then do the modifications in a graphical way.\n\nFirst of all I tried to contact Adobe through their Customer Support Portal. Usually I get a reply after a week. In the last reply they suggested me to send the query to their legal team. I therefore sent an email to [permissions@adobe.com](mailto:permissions@adobe.com) but these did not send me back (more then 2 weeks have passed). I therefore reopened the Customer Support Ticket I had and informed them about this. However I still did not received any reply back! More then a month has passed from when I started my query!\n\nThanks again,  \nSim085\n\n"
    }
  ]
}
