{
  "id": "51081",
  "title": "CaliGrot 6-3, now with extra bold!",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/screenshot_0275_6379.png)\n\nThis is much an exercise in making something very controlled and unexpressive as it is in making a useful and attractive sans font in a limited time (a week and a half in this case). I think I still managed to shove a few quirks in there anyway. It's wound up a strange hybrid of Helvetica and Futura to my eyes, created entirely independently of course; all my own points and curves with the help of the Quaker space program. Perhaps it's _too_ simply done. It still has some spacing and kerning issues but I'll iron those out before too long. Feedback, as always, is welcome and desired.\n\nPDF contains the the basis of image above for full resolution viewing.\n\n| Attachment | Size |\n| --- | --- |\n| [CalGrot6-1sample.pdf](http://web.archive.org/web/20150414085849/http:/typophile.com/files/CalGrot6-1sample.pdf) | 22.03 KB |\n| [CalGrot6-2sampleB.pdf](http://web.archive.org/web/20150414085849/http:/typophile.com/files/CalGrot6-2sampleB.pdf) | 23.75 KB |\n| [CalGrot6-3sample.pdf](http://web.archive.org/web/20150414085849/http:/typophile.com/files/CalGrot6-3sample.pdf) | 23.28 KB |\n| [CalGrot6-3-XB2sample.pdf](http://web.archive.org/web/20150414085849/http:/typophile.com/files/CalGrot6-3-XB2sample.pdf) | 22.83 KB |\n\n",
  "author": "cuttlefish",
  "time": "29 Oct 2008 — 4:22pm",
  "uid": "14556",
  "comments": [
    {
      "time": "30 Oct 2008 — 6:16am",
      "content": "I think you're overstating the neutrality of this - to my eyes it has a pleasing, bouncy personality, like ad copy in the Eisenhower/Kennedy era. I think the tight curls of f, t, and y, f and t's long crossbar, and the high crossbar of e give it that. The t is interesting - its balance on its little umbrella handle is precarious, but \"normalizing\" that might sacrifice some of this character. I would look at its overshoot (seems to ride high), and I would reconsider its top shear - seems too sharp to me.\n\nV and v fall apart at the vertex - top of N, too. Some uneven weights, esp. in the figures: 7's diagonal and 5's bowl are too dark, for example. 9 looks topheavy. z looks too dark and too sharp.\n\nI think i's dot is too low (turns into a short l at small sizes), and the apostrophe may be too high. I'm not sure the curly question mark fits in with the font.\n\n"
    },
    {
      "time": "30 Oct 2008 — 10:32am",
      "content": "I'm glad you picked up on that. I was trying to get something a little retro feel in this without tying it to a too specific era. Maybe I got inspired by everyone else who's been inspired by Saul Bass movie titles.\n\nThe punctuation dots (period, &al.) were derived from the square tittle with auto-curvature activated to turn it into a slightly larger circle, and the comma and quotation marks derived from that with an added tail, Would a straight cut tail rather than the pointed one make them fit better, or should I go further and make them square like the tittle?\n\nI do have an alternate straight legged question mark. I'll make that the preferred and the serpentine one the alternate. It seemed too skinny at first glance, though, and a twisty one was good enough for Futura to annoy people with for nearly a century.\n\nThe stem of the 7 is a bit thick. That's always a hard one to balance. I didn't want to curve it, and making it the standard stroke weight of the font makes it look too skinny among other numbers on screen, but seeing it in print it does stand out a bit.\n\nAll the lc accents are too low, i and j dots included. It's nice that the program can reset them higher for me. I don't want to put them all the way at cap-height though, that's just too much air.\n\nOK, off to do an update...\n\n"
    },
    {
      "time": "30 Oct 2008 — 2:16pm",
      "content": "\"Quaker space program\"\n\nI think that reference went over my head.\n\n"
    },
    {
      "time": "30 Oct 2008 — 2:38pm",
      "content": "I agree, this is quite a fun look actually, and it does have a 1950's kind of appeal.  \nI think a little optical correction could help. I'm looking at the a and wondering about thinning the joins, and the horizontal on the t seems heavy though i'm sure it's the same weight as the vertical. Is that crossbar a bit too wide? I wonder if the comma and quotes could be squarer rather than tapered to a point. z is quite wide isn't it?  \nThe crossbars on the euro look too long.  \nHope that's helpful :) Look forward to seeing more.\n\n"
    },
    {
      "time": "30 Oct 2008 — 4:35pm",
      "content": "<cite>“Quaker space program”</cite>\n\nI think that reference went over my head.\n\n[Raph Levien](http://web.archive.org/web/20150414085849/http:/www.levien.com/), inventor of the [Spiro curve technology](http://web.archive.org/web/20150414085849/http:/libspiro.sourceforge.net/), is a member of the [Berkeley Monthly Meeting](http://web.archive.org/web/20150414085849/http:/www.quaker.org/berkmm/) of the [Religious Society of Friends (Quakers)](http://web.archive.org/web/20150414085849/http:/www.quaker.org/). He is also a rocket scientist.  \nThis is hopefully a _benign_ joke in his tribute/at his expense.\n\n"
    },
    {
      "time": "24 Nov 2008 — 12:41pm",
      "content": "Help! I need to rename this font and I can't think of a good one. It appears there is already a [font with a similar name](http://web.archive.org/web/20150414085849/http:/typophile.com/node/51998) out there, so I have to call this one something else entirely.\n\nThat reminds me, I need to cook up a new sample to show too. I fixed a few things. Probably still need to work on the spacing, though.\n\n"
    },
    {
      "time": "2 Feb 2009 — 10:12am",
      "content": "Dang! It's been a long time since we've talked about this one. I've been working on it, though.\n\nIt's always that last 10% of the work that takes 99% of the time, isn't it?\n\nAnyway, extensive yet subtle changes are in store. I think I've addressed most of the issues mentioned and some that weren't. I want to give the spacing a once-over, but I should have a new sample shortly.\n\n"
    },
    {
      "time": "2 Feb 2009 — 10:39am",
      "content": "\"I need to rename this font and I can’t think of a good one\"\n\nQuaker Space Program!\n\n"
    },
    {
      "time": "2 Feb 2009 — 12:14pm",
      "content": "Y'know, that might be crazy enough to work.\n\n"
    },
    {
      "time": "11 Feb 2009 — 1:48pm",
      "content": " ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/caligrot62_4736.png)\n  \nFinally I've brought out the next iteration. There are a lot of changes, but most are very subtle. I can hardly remember where they are, so if you can spot them, great!  \nI have come up with a bunch of alternate forms for the lc g, but I will probably kill the lot of them.\n\nI need to put up a PDF with the old format for easier comparison. The new layout shown here, which may or may not make a better presentation will be uploaded shortly.\n\n"
    },
    {
      "time": "15 Feb 2009 — 11:49am",
      "content": "I guess I succeeded in making this font completely boring.\n\n"
    },
    {
      "time": "15 Feb 2009 — 2:54pm",
      "content": "I wonder if the descenders ought not be longer. In the text setting in your PDF, they seem too shy. Also, I think the ligature on ct and st is too wispy. The offset on the 8 is to my eye a bit much.\n\nI think the spacing is in general too tight. And lastly, you need some kerning pairs. víl crashes.\n\nBut, no, the typeface is not boring. It looks rather good.\n\n"
    },
    {
      "time": "15 Feb 2009 — 3:19pm",
      "content": "It's a struggle to make the closed-S style 8 look balanced, but I don't want to go with stacked ovals. Any ideas on how I should tweak it?\n\nI'll try opening up the spacing a bit and bulk up that ct and st stroke. Are the ones on the ch lig and ß adequate?\n\n"
    },
    {
      "time": "15 Feb 2009 — 6:09pm",
      "content": "It looks as if the bottom bowl of the 8 comes in too high. The trick is to make the offset essentially disappear at text sizes.\n\nActually, I meant ch (I don't see a ct in the sample, but it needs to be treated the same way). The long-s+t is fine, and the ß is fine for weight, but I've never really liked the style with a large upper bowl. It might help if you make the transition from the lower \"s\" shape to the upper curve point more northeast, if that makes sense. (If not, I'll draw a picture.)\n\nOpening up the spacing will really help at text sizes. (You might want to have Caligrot Text and Caligrot Titling vel sim. to account for different optical needs.)\n\n"
    },
    {
      "time": "16 Feb 2009 — 10:25am",
      "content": "I think I get what you're saying about the 8 (the fix appears to be working), but not so much about the ß. I have a couple more things to try on that...\n\n"
    },
    {
      "time": "16 Feb 2009 — 10:49am",
      "content": "Are one of these the shape that you are looking for?\n\n ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/screenshot_0302_4185.png)\n\n"
    },
    {
      "time": "17 Feb 2009 — 6:19am",
      "content": "The one on the right is the route I was suggesting, but a bit too far. Something between 1 and 3 ought to do it.\n\n"
    },
    {
      "time": "17 Feb 2009 — 12:01pm",
      "content": "All right then. How about this?\n\n ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/screenshot_0303_6715.png)\n\n"
    },
    {
      "time": "17 Feb 2009 — 12:54pm",
      "content": "The middle one is best but I think it should be slightly nearer to the right hand one. Can you interpolate between 2 and 3 about 20%?\n\nI've just checked the latest pdf. It really suits Scandinavian languages somehow! I like the horizontal terminals and semicircular endings. Perhaps Ø and ø need horizontal stroke endings too? And perhaps you could design a Q with somehow a semicircular tail?\n\nI'd take the loop of J up a bit more to echo the f and j loops. x looks wide. The arches on n and u look slightly unresolved. The corners on N don't match. z looks dark.\n\nGenerally the straight stems are a hair too light for the bowls, which seem darker to me. Look at the word 'noite' and it seems the o and e are darker than the others. I'd make the 'hat' of the 1 much more generous.\n\nMiddle two strokes of w could be a few units narrower. k's lower leg is much steeper than the capital version and looks like it could start lower.\n\nI'm not sure whether you want detailed crit or general stylistic impressions, and the next bit might be more about the very fine-tuning which you are going to come to anyway next...\n\nThe overall colour of the text blocks seems a bit spotty and I'm not sure if it's the spacing or the stroke weight. I think perhaps there's a bit of both. For example, the inner contour of the roof of the a could be nudged up 2 or 3 units, the valley between the two curves of the m could be pushed a few units to the right, the joins of arches to stems makes some glyphs a bit heavy (r and u for example), and inner counters are not quite following the same ductus as the outer contours like on a, e and u.\n\nIf that's the next level of detail from where you are now, sorry!\n\nCan you set a block in CAPS so we can see how that looks?\n\nThese are just opinions and I'm still a learner about these things so see what others think too... :)\n\n"
    },
    {
      "time": "18 Feb 2009 — 1:30pm",
      "content": " ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/screenshot_0304_3502.png)\n\nI don't know about these here...\n\n"
    },
    {
      "time": "18 Feb 2009 — 2:14pm",
      "content": "I think the Q could work, perhaps even with just the outer part of the tail. I don't use the Oslash so I don't know whether that's more conventional or not, just I thought it might fit better with the other endings.  \nI'd have to see a block of text to get a better idea about the Q.  \n:)\n\n"
    },
    {
      "time": "18 Feb 2009 — 6:06pm",
      "content": "Jeez!\n\n ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/screenshot_0306_3906.png)\n  \nI'll likely keep the first of these, plus the last one as an alternate, but trash the rest. They didn't quite work out. \n"
    },
    {
      "time": "18 Feb 2009 — 7:08pm",
      "content": "You could use the fourth one if you ever have to design a logo for an optician. :-)\n\n"
    },
    {
      "time": "18 Feb 2009 — 7:50pm",
      "content": "My glasses tend to look more like the last one a lot of the time.\n\n"
    },
    {
      "time": "27 Apr 2009 — 12:41pm",
      "content": "How does a straight leg on the R sound? This curvy-swervy one doesn't appeal to me anymore.\n\n"
    },
    {
      "time": "7 May 2009 — 11:20am",
      "content": "Interpollating is fun!\n\nI've got version 6-3 going here on my desk along with an extra-bold version I drew and I'm finally getting them to sync up so I'll be able to generate a range of weights inbetween without extraneous effort. FontForge seems to have a problem with reorienting the handles of tangent points when the back angle moves, but that's easy enough to correct.\n\nBut the more I work on it, the more it looks like Helvetica.\n\n"
    },
    {
      "time": "14 May 2009 — 5:49pm",
      "content": "In my experimentation to get interpollation working, I managed to totally screw up the spacing. It needed to be redone anyway. I also extended the descenders 50 ems (typical stem width of the light version is 60), because the hooks were getting too tight for comfort on the bold, distorting the curves. This still needs a lot of work, in no small part to correct the damage I caused by stretching the descenders.\n\n ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/CalGrot6-3sample_5733.png)\n  \n\n ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/CalGrot6-3-XB2sample_5844.png)\n\nAlso, I made this image showing some of the alternate and special glyphs:\n\n ![](http://web.archive.org/web/20150414085849im_/http:/typophile.com/files/CaliGrot63alts_5718.png)\n\nAs usual, PDFs of the samples are up on top of the thread.\n\n"
    },
    {
      "time": "20 May 2009 — 2:38pm",
      "content": "Am I to interpret the lack of strong feeling one way or the other that my goal of neutrality has been achieved.~\n\n"
    },
    {
      "time": "18 Jun 2009 — 1:47pm",
      "content": "All right, I've been off my game for a while. Back to work making this thing work.  \nI wonder where my font really fits in the constellation of sans-serifs. I haven't really set out to imitate anything that I am aware of, but to a certain extent they all look alike.\n\n"
    },
    {
      "time": "22 Jun 2009 — 7:27pm",
      "content": "\"but to a certain extent they all look alike.\"\n\n: )\n\nMichael\n\n"
    },
    {
      "time": "20 Jan 2010 — 10:57pm",
      "content": "OMG have I really let this languish since June?\n\nI can see now that \"m, n, h, u\" get way too wide in the extra bold while some of the letters with closed counters look a bit narrow. Spacing on both is still wonky too. grr...\n\n"
    },
    {
      "time": "5 Oct 2012 — 12:31am",
      "content": "Here's a subtle update, mostly currency symbols and some minor tweaks elsewhere. I linked the pdf down here because I can't upload files to the thread directly anymore: [CaliGrot 6-4](http://web.archive.org/web/20150414085849/https:/docs.google.com/open?id=0B19KdtxO3CcbYno5TUdwZGh4azg)\n\n"
    }
  ]
}
