{
  "id": "51090",
  "title": "Wine Bar Logo Critique",
  "forum": "arosa94880's blog",
  "tags": [

  ],
  "content": "Hi All,  \nThis is my first time posting, and I would love some feedback about a few logos I have been working on. The logos are for a new wine bar located in Kennebunk, ME. The typical patron will be the working professional, wine enthusiasts, and the influx of tourists who visit the area every summer. It will be located in an old barn that has been renovated, but still hold the charm and rustic ambiance of the barn. All my client really expressed is that he didn’t want anything with the generic grapes and vines wrapped around the logo. The attached logos are the second round that I will be showing him. I originally showed him about 12 (4 different concepts with three executions). He chose two concepts that he liked, and I have gone back to fine tune them a bit. I would love to hear any comments you have about these, I am at the point now where I need another designer’s eye and am open to all constructive criticism.\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [OldVines.jpg](http://web.archive.org/web/20081202150238/http:/typophile.com/files/OldVines.jpg) | 523.92 KB |\n\n",
  "author": "<a href=\"/web/20081202150238/http://typophile.com/user/13728\" title=\"View user profile.\">arosa94880</a>",
  "time": "<br>",
  "uid": "13728",
  "comments": [
    {
      "time": " 29.Oct.2008 9.30pm",
      "content": "Just a tip, you might get more response if you post this in the logos/corporate ID design section found: [here](http://web.archive.org/web/20081202150238/http:/typophile.com/forum/23)\n\nas for critique, my favorite is 1b. the mark is interesting as it could be a grape, or a mark left by a wine glass. The choice of typeface could be better, though I’m not sure what specifically bugs me about the current choice.\n\nI’d scrap the ones in row 2.\n\nRow 3 could be confused as reading “Cold Vines”\n\npenn\n\n"
    },
    {
      "time": " 30.Oct.2008 12.45am",
      "content": "1b also. though i have seen the wine rim stain logo mark on a few other brands... Also the logo type does not seem high end at all.\n\nAlso can you post a smaller file so that it is not scaled to view them?\n\n"
    },
    {
      "time": " 30.Oct.2008 7.32am",
      "content": "thanks. I will post it on that forum instead. Yes the 2nd row is my least favorite. I am not loving the typeface with this as well on the first and third one. I am still searching for one that will work better. Any suggestions?\n\nDo you know specifically where you have seen the wine rim stain? I did some research on many wine bar logos, and I hadn’t found any that used that. Dang, and I thought I was being original :) oh well.\n\n"
    }
  ]
}
