{
  "id": "51091",
  "title": "A good alternative to helvetica for 'Nutritional information' on food packaging",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi everyone!\n\nIm a bit stuck on what typeface to use for the Nutrition Tables/Food tables on my food packaging design...at the moment i have got  \nhelvetica as place holder on my design...\n\nFrom what i have seen and read..the typeface for Nutrition Tables/Food tables its generally  \nHelvetica,Franklin Gothic or trade gothic ( i think in the states they recommend to use in on the food label?)\n\nI like the look of FF Milo (ias it has a nice large xheight and looks  \nawesome small print - first saw it on fontfeed) and Galaxie Polaris a new typeface designed by  \nChester Jenkins.\n\nCan anyone suggest a good alternative to helvetica that prints good very small and perhaps has a larger x-height?  \nor you think i should just stick with helvetica for the Nutrition information?\n\nThanks for your time, appreciate it!\n\n",
  "author": "djbaz",
  "time": "29 Oct 2008 — 9:58pm",
  "uid": "32276",
  "comments": [
    {
      "time": "30 Oct 2008 — 4:18am",
      "content": "FF Legato\n\n"
    },
    {
      "time": "30 Oct 2008 — 4:50am",
      "content": "[Amplitude](http://web.archive.org/web/20131018030909/http:/www.fontshop.com/search/?q=amplitude&x=0&y=0), works well at small sizes.\n\n"
    },
    {
      "time": "30 Oct 2008 — 6:05am",
      "content": "I could be wrong, but I thought the reason that Nutritional Labels always appear in Helvetica is because its mandated by the FDA.\n\n-- K.\n\n"
    },
    {
      "time": "30 Oct 2008 — 6:09am",
      "content": "Okay, I see now that they don't mandate the exact typeface, just certain parameters:\n\n[http://www.fda.gov/ora/inspect\\_ref/igs/nleatxt.html#General/Formal%20&%2...](http://web.archive.org/web/20131018030909/http:/www.fda.gov/ora/inspect_ref/igs/nleatxt.html#General/Formal%20&%20Print%20Size \"http://www.fda.gov/ora/inspect\\_ref/igs/nleatxt.html#General/Formal%20&%20Print%20Size\")\n\nBut Helvetica and Franklin Gothic are specifically used in the government example, so everybody probably uses these so as to guarantee that the label won't be found in violation of the requirements.\n\n[http://www.fda.gov/ora/inspect\\_ref/igs/nutri18.gif](http://web.archive.org/web/20131018030909/http:/www.fda.gov/ora/inspect_ref/igs/nutri18.gif \"http://www.fda.gov/ora/inspect\\_ref/igs/nutri18.gif\")\n\nI applaud your interest in making your label nicer, but just be careful that you don't end up causing your company a lot of headache with fines and reprinting costs.\n\n-- K.\n\n"
    },
    {
      "time": "30 Oct 2008 — 10:38am",
      "content": "The specification is \"easy to read type style\".\n\nWhat we need is someone to start up a Typeface Readability Certification Agency, wherein foundries can register their faces for a fee.  \nExpect to see it announced next Feb. 1.\n\n"
    },
    {
      "time": "30 Oct 2008 — 11:18am",
      "content": "Or Apr 1\n\n"
    },
    {
      "time": "30 Oct 2008 — 1:12pm",
      "content": "Awesome thanks for some of your guys Suggestions... I don't have to worry about a company as this is a student project however i am trying to get the finish product/package looking like industry (supermarket) level obviously.\n\nkentlew - cheers for the links, however in New Zealand hey don't really specify i recommend typeface for Nutrition information like that did on that site.\n\n[http://www.nzfsa.govt.nz/consumers/food-labelling/understanding-food-lab...](http://web.archive.org/web/20131018030909/http:/www.nzfsa.govt.nz/consumers/food-labelling/understanding-food-labels/ \"http://www.nzfsa.govt.nz/consumers/food-labelling/understanding-food-labels/\")\n\nOverall i guess im a little subjective to use Helvetica as i feel it is overused and i tend not to use it in my work.  \nHowever since its so familiar i think consumers will wonder whats different if i was to change it dramatically?\n\nthats why i guess many people do use helvetica as its a pretty safe typeface, and you can't go wrong with it.\n\nthe food labeling is for a children's snack...but the parents would no doubt be reading that information/buying the product.\n\nBut if anyone else has more alternatives, that would be much appreciated... i will have a go to see what the suggestions look like  \nCheers\n\n"
    },
    {
      "time": "30 Oct 2008 — 3:17pm",
      "content": "_Or Apr 1_\n\nThanks Si.  \nThat's what I meant, but got April Fool's Day confused with my wedding anniversary.  \nDon't tell my wife.\n\n"
    }
  ]
}
