{
  "id": "51102",
  "title": "Wine Bar Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi All,  \nThis is my first time posting, and I would love some feedback about a few logos I have been working on. The logos are for a new wine bar located in Kennebunk, ME. The typical patron will be the working professional, wine enthusiasts, and the influx of tourists who visit the area every summer. It will be located in an old barn that has been renovated, but still hold the charm and rustic ambiance of the barn. All my client really expressed is that he didn’t want anything with the generic grapes and vines wrapped around the logo. The attached logos are the second round that I will be showing him. I originally showed him about 12 (4 different concepts with three executions). He chose two concepts that he liked, and I have gone back to fine tune them a bit. I would love to hear any comments you have about these, I am at the point now where I need another designer’s eye and am open to all constructive criticism.\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [OldVines.jpg](http://web.archive.org/web/20150419110900/http:/typophile.com/files/OldVines_0.jpg) | 523.92 KB |\n\n",
  "author": "arosa94880",
  "time": "30 Oct 2008 — 7:27am",
  "uid": "13728",
  "comments": [
    {
      "time": "30 Oct 2008 — 7:36am",
      "content": "I guess the wine stain is the more successful option, if I have to pick. No offense, but both a wine bottle stain and grapes are the most obvious clichés in the world of wine-related design. Not that you have to totally revamp it, I think they both communicate wine, but I would play with the cliché a bit -- how could these old stand-bys of wine packaging be tweaked to be seen in a new way? I would check out thedieline.com, you can see some of the best new wine packaging in the marketplace. The sans type you're using is close, but not quite right, too. The lower-case \"l\" in particular is bothersome, it's a bit too modern looking. I would look for something a bit rougher looking, that gives off the feel of 19th and early 20th century metal type.\n\n"
    },
    {
      "time": "30 Oct 2008 — 7:40am",
      "content": "[http://www.thedieline.com/blog/2008/08/evan-geltosky.html](http://web.archive.org/web/20150419110900/http:/www.thedieline.com/blog/2008/08/evan-geltosky.html \"http://www.thedieline.com/blog/2008/08/evan-geltosky.html\")\n\nHere's an example of what I mean by playing with clichés.\n\n"
    },
    {
      "time": "30 Oct 2008 — 11:08am",
      "content": "Thanks for the comments. This is actually for a wine bar and not a label. But thanks for the link! Always love to look at new designs. I hadn't realized that the stain was so cliche, I had done a lot of research on wine bar logos, and hadn't seen anything like that before. Maybe I was looking in the wrong places... I wouldn't like to revamp since I don't think there is enough time. I guess I should probably go back and work with them a little more. I did realize that the grapes have been used a lot before, but I tried to use it in a different way. Trying to make it look like grapes as well as a wine glass. As for the type, I agree with you that it is not quite right. I want to find another one to use with it. any suggestions?\n\nThanks again for the comments, and more of them would definitely be appreciated. :)\n\n"
    },
    {
      "time": "30 Oct 2008 — 3:40pm",
      "content": "Row 2 should not be pursued further.\n\nOut of the similar designs in rows 1 & 3, I think 1a does the best job with getting the mark and the text to work and flow together. Good work.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:46pm",
      "content": "1b and 3b work the best for me, but I'd put my money on 1b.\n\nBe cautious though, the logo for some silly reason reminds me of The Body Shop's logo (which it isn't close to really)\n\nMaybe it's just me, maybe it's the roundness of it, but it not being a complete circle.\n\nI really like 1B though.\n\n"
    },
    {
      "time": "2 Nov 2008 — 7:14pm",
      "content": "not the first time I've seen the wine stain concept ;-)\n\nif you're gonna roll with it ... why not use an ACTUAL wine stain ... rather than some vector knock off?\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20150419110900/http:/www.solid-creative.com/identity.htm)  \n [Bicycle Film Festival](http://web.archive.org/web/20150419110900/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "3 Nov 2008 — 3:21am",
      "content": "Paul, my thoughts exactly. I don't mind the 'wine stain' idea, but please use an actual ring created by a wine glass...  \nand furthermore what better excuse to have some wine in the studio?\n\n"
    },
    {
      "time": "3 Nov 2008 — 5:54pm",
      "content": "wait ... you need an excuse? ... you're doin' it wrong.\n\n;)\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20150419110900/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20150419110900/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "4 Nov 2008 — 1:56am",
      "content": "oh, you bohemian types... ;)\n\n"
    },
    {
      "time": "4 Nov 2008 — 6:55am",
      "content": "Hi there. I did not read all of the above and, I think the logo with the circle is good. If you could (would) make it so it looks like a barrel, with strips of wood converging to the left horizon. Cheers.\n\n"
    },
    {
      "time": "7 Jan 2014 — 3:18am",
      "content": "This is very much great and hope fully nice blog. Every body can easily found her need able information. I am visit first time but I fond many use full article. I will back again when get time.\n\n"
    }
  ]
}
