{
  "id": "51101",
  "title": "The best typeface ever designed",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[The Palin Dudes Font](http://web.archive.org/web/20131019033055/http:/slog.thestranger.com/2008/10/the_return_of_the_palin_dudes)\n\nSlightly more useful than a typeface composed of paw prints.\n\n",
  "author": "FeeltheKern",
  "time": "30 Oct 2008 — 6:50am",
  "uid": "10069",
  "comments": [
    {
      "time": "30 Oct 2008 — 8:18am",
      "content": "Wasn't that featured on the 2002 Honest Fonts site? ;-)\n\nThat should be the typophile \"featured face\" on Nov 4!\n\nIt will probably crash the server though!?\n\n"
    },
    {
      "time": "30 Oct 2008 — 8:29am",
      "content": "Ah, yes, the \"Nailin Pailin\" crowd ;-)\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2008 — 3:31pm",
      "content": "@Sii: I'd love to see Typophile covered in that mess on Nov. 4. I'd imagine there's enough extra points in each glyph to crash the site 10 times over, though.\n\n@Dezcom: I was trying to think of something type-related, but \"Optically Scalin' Palin\" doesn't really make any sense. Anything you can think of, in the world of type, that rhymes with Palin?\n\n"
    },
    {
      "time": "30 Oct 2008 — 4:00pm",
      "content": "How about \"She is Pailen in Comparison\"\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2008 — 4:01pm",
      "content": "Whoops! That is not type related :-)\n\nMaybe what we need is a Pailindrone (before I get a Pailin Groan :-)\n\nChrisL\n\n"
    },
    {
      "time": "30 Oct 2008 — 4:10pm",
      "content": "In the Bering Strait we went a sailin,  \nwhere we met a young dimwit named Pailin.  \nWe thought she was smokin but buckshot was spokin,  \nthe Moose smoked it without even inhalin.\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:48pm",
      "content": "when reading this thread.....\n\nI think I dropped somethink.\n\nMy jaw!\n\n"
    },
    {
      "time": "1 Nov 2008 — 8:53am",
      "content": "Why would anyone develop type for people that don't read?\n\n"
    },
    {
      "time": "2 Nov 2008 — 10:05am",
      "content": "@BlueStreak: Judging by the state of the conservative movement today in America, maybe The National Review should start publishing their articles in Palin Dudes. If Obama is GQ urbane with his use of Gotham, then the conservatives need a rural imperfect typeface.\n\n@Dezcom: Wasilla would be a fantastic name for a typeface, I'm not sure what it would look like though. It would definitely need a Cyrillic version, regardless, with its proximity to Russia.\n\n"
    },
    {
      "time": "2 Nov 2008 — 10:39am",
      "content": ":-)\n\n"
    },
    {
      "time": "2 Nov 2008 — 11:54am",
      "content": "Josh,  \nI will get to work on it as soon as I get my Berings Strait :-)\n\nChrisL\n\n"
    },
    {
      "time": "2 Nov 2008 — 12:49pm",
      "content": "Speaking of Herself, I strongly disapprove of and would never refer you to [this site](http://web.archive.org/web/20131019033055/http:/www.pleaseenjoy.com/project.php?cat=4&subcat=&pid=107), so don't blame me :)\n\n"
    },
    {
      "time": "2 Nov 2008 — 2:10pm",
      "content": "@William Berkson: I think I can tell you which one would result in a child 9 months later, which I'm not in the market for. Sarah Palin may have the child with the most typographically relevant name, though -- Track. In fact, all of her children sound like they could be names for typefaces -- Bristol, Willow, Piper, Track & Trig.\n\n"
    }
  ]
}
