{
  "id": "51114",
  "title": "® Trademark Infringement",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I did some work for a friend who sells Kayaks a year ago and I gave his business a tagline to go with his new identity. I have just seen a commercial for a cruise operator who uses this tagline (for about 5 years). I ran a search on the USPTO and verified this.\n\nI did not attempt to register his tagline so it is unprotected.  \nMy question is, is this an infringement of a ® registered trademark if we are in different business' with entirely different objectives?\n\n",
  "author": "jayyy",
  "time": "30 Oct 2008 — 12:11pm",
  "uid": "4974",
  "comments": [
    {
      "time": "30 Oct 2008 — 12:26pm",
      "content": "Half jokingly/half seriously, I'll say: The answer to most intellectual property issues these days lies in the hands of the party with the highest paid lawyers.\n\n"
    },
    {
      "time": "30 Oct 2008 — 12:47pm",
      "content": "Well, fully seriously, that is not us :)\n\nI doubt they care or even know right now and it is certainly not going to turn into a lawyer issue because he does not have the budget for that and there is minimal investment in the tagline anyway.\n\nWhat worries me is if I do more work for him, online, advertising and possibly retail, would it be a wise idea to move away from further investment in this?\n\n"
    },
    {
      "time": "30 Oct 2008 — 12:51pm",
      "content": "I actually just found another LIVE TM registrant and they are a wheelchair manufacturer :)\n\nIronic but interesting, as this could mean that if you operate in entirely different business, there can be two or more identical taglines for different business.\n\n"
    },
    {
      "time": "30 Oct 2008 — 1:00pm",
      "content": "Since they are both _boating related_ companies, it could be argued that the nature of the business is sufficiently similar and this is enough to establish intent to deceptively connect the two companies by use of the same or similar trademark.\n\nAt least a tagline is more easily changed than a primary corporate identity. If the kayak company is served with a cease-and-desist letter, it would be easier to cave in and change rather than going through the expense of challenging.\n\nIANAL-TINTBCALA\n\n"
    },
    {
      "time": "30 Oct 2008 — 1:03pm",
      "content": "I just found this on the USPTO:\n\nIs registration of my mark required?\n\nNo. You can establish rights in a mark based on legitimate use of the mark. However, owning a federal trademark registration on the Principal Register provides several advantages, e.g.,\n\n\\* constructive notice to the public of the registrant's claim of ownership of the mark;  \n\\* a legal presumption of the registrant's ownership of the mark and the registrant's exclusive right to use the mark nationwide on or in connection with the goods and/or services listed in the registration;\n\n\\*\\*\\*\\*\\*\\*\\*  \nSo that means the mark is only exclusive when used in connection with the goods/services LISTED in the registration.\n\nSo I guess since he does not sell cruises I'm OK\n\n"
    },
    {
      "time": "30 Oct 2008 — 1:20pm",
      "content": "If he rents kayaks and/or conducts kayak tours, that could be construed as \"selling cruises\". They always try to get you with those generalized definitions.\n\n"
    },
    {
      "time": "30 Oct 2008 — 2:14pm",
      "content": "The old example is Delta Faucets and Delta Airlines. Easy to tell they are in completely different markets and coexist just fine.\n\nA more recent blurring of this is the example of Apple Computers and Apple Records. Traditionally, though they battled, it was decided they, indeed were in different markets and could coexist.\n\nAlas, once Jobs opened the iTunes store, things began to blur and, ultimately, it was decided they were both in the music industry.\n\nSo, yea, Kayaks aren't cruises. But Kayaks and Cruise Ships are both boats.\n\nIf your client is hoping to sell Kayaks throughout a huge region/marketplace, then maybe it makes sense to invest in some IP research and protection up front. But if it's just a local market, then it probably makes sense to just continue on and then if/when the big lawyers ever come knocking, rename the business then.\n\nBut, as always, IANAL.\n\n"
    },
    {
      "time": "30 Oct 2008 — 5:54pm",
      "content": "_I did not attempt to register his tagline so it is unprotected.  \nMy question is, is this an infringement of a ® registered trademark if we are in different business’ with entirely different objectives?_    \nSadly, if you did not register, let alone attempt to register then no, it is not a ® registered trademark. Unless it is a truly unique tagline that no one else would have independently come up with, odds are not good in making any claims against them.\n\n"
    },
    {
      "time": "31 Oct 2008 — 12:02pm",
      "content": "Kegier,\n\nI think you misread my post. I know it's not registered because I did not register it! It is a TM though as it is his tagline. I just wanted to know if it could co-exist in different areas of business.\n\nAluminum: I think you hit it on the head. We will continue until we have a problem. At which point we could always just change the tagline :)\n\nThanks for all of your help guys.\n\n"
    }
  ]
}
