{
  "id": "51119",
  "title": "Spanish Pangram?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I know we've had a handful of pangram threads before. And I could have sworn that there was one with pangrams in languages other than English, but I couldn't find it.\n\nSpecifically, I'm looking for a Spanish pangram. Does anyone know one?\n\n-- Kent.\n\n",
  "author": "kentlew",
  "time": "30 Oct 2008 — 3:09pm",
  "uid": "1215",
  "comments": [
    {
      "time": "30 Oct 2008 — 3:24pm",
      "content": "[Wikipedia's list](http://web.archive.org/web/20130824004748/http:/en.wikipedia.org/wiki/List_of_pangrams) includes these in Spanish:\n\n(with ñ and diacritics)  \nEl veloz murciélago hindú comía feliz cardillo y kiwi. La cigüeña tocaba el saxofón detrás del palenque de paja.  \n\\> (Used in Windows as sample text)  \n\\> The quick Hindu bat was happily eating golden thistle and kiwi. The stork was playing the saxophone behind the straw arena.\n\n(with ch, ñ and ll)  \nEl pingüino Wenceslao hizo kilómetros bajo exhaustiva lluvia y frío; añoraba a su querido cachorro.  \n\\>The penguin Wenceslao did kilometres under exhaustive rain and cold; he longed for its dear puppy.\n\nJovencillo emponzoñado de whisky: ¡qué figurota exhibe!  \n\\>Whisky-intoxicated youngster — what a figure he's showing!\n\nEse libro explica en su epígrafe las hazañas y aventuras de Don Quijote de la Mancha en Kuwait.  \n\\>That book explains in its epigraph the deeds and adventures of Don Quijote de la Mancha in Kuwait.\n\nQueda gazpacho, fibra, látex, jamón, kiwi y viñas.  \n\\>There is still gazpacho, fibre, latex, ham, kiwi and vineyards.\n\nWhisky bueno: ¡excitad mi frágil pequeña vejez!  \n\\>Good whisky, excite my frail, little old age!\n\nAnd [Spanish Wikipedia](http://web.archive.org/web/20130824004748/http:/es.wikipedia.org/wiki/Pangrama) has more and better ones, though you'll need to translate them yourself:\n\nQuiere la boca exhausta vid, kiwi, piña y fugaz jamón. (42 letras)  \nFabio me exige, sin tapujos, que añada cerveza al whisky. (45 letras)  \nJovencillo emponzoñado de whisky, ¡qué figurota exhibe! (46 letras)  \nDavid exige plazo fijo embarque truchas y niños New York (47 letras)  \nLa cigüeña tocaba cada vez mejor el saxofón y el búho pedía kiwi y queso. (58 letras)  \nEl jefe buscó el éxtasis en un imprevisto baño de whisky y gozó como un duque (62 letras)  \nExhíbanse politiquillos zafios, con orejas kilométricas y uñas de gavilán. (63 letras)  \nEl cadáver de Wamba, rey godo de España, fue exhumado y trasladado en una caja de zinc que pesó un kilo (81 letras)  \nEl pingüino Wenceslao hizo kilómetros bajo exhaustiva lluvia y frío, añoraba a su querido cachorro.(83 letras)  \nEl veloz murciélago hindú comía feliz cardillo y kiwi. La cigüeña tocaba el saxofón detrás del palenque de paja. (92 letras) Usada para ver la tipografía en las Fuentes de Windows en idioma Español\n\n"
    },
    {
      "time": "30 Oct 2008 — 4:44pm",
      "content": "Craig --\n\nI'm not really a wikipedia guy, so I never thought to look there. ¡Muchas gracias! These are perfect.\n\n-- K.\n\n"
    },
    {
      "time": "30 Oct 2008 — 5:28pm",
      "content": "This is not a pangram but a palindrome:\n\nDábale arroz a la zorra el abad.\n\n:)\n\n"
    },
    {
      "time": "30 Oct 2008 — 6:33pm",
      "content": "¡De nada!\n\n"
    },
    {
      "time": "2 Nov 2008 — 5:02am",
      "content": "” El que vino a este mundo se vino a beber vino, ¿sino, porque vino? ” (Mexican anonymous)\n\nWho come to this world did it to drink wine, if not, why come?\n\n\\*\\*\\*\\*\n\n¡Salut! Y forza al canut. (Catalan anonymous)\n\nYeeahh! Keep'em coming.\n\n"
    }
  ]
}
