{
  "id": "51142",
  "title": "Isn't this just modified Papyrus?...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.myfonts.com/fonts/bergsland/artichoke/](http://web.archive.org/web/20150123142154/http:/www.myfonts.com/fonts/bergsland/artichoke/ \"http://www.myfonts.com/fonts/bergsland/artichoke/\")\n\nI saw this on myfonts, read the blurb at the bottom, and there's no reference to Chris Costello.\n\nIf you compare this Artichoke and Papyrus there are essentially the same face.\n\n[http://www.costelloart.com/papyrus.html](http://web.archive.org/web/20150123142154/http:/www.costelloart.com/papyrus.html \"http://www.costelloart.com/papyrus.html\")  \n [http://www.myfonts.com/fonts/letraset/papyrus/familytree.html](http://web.archive.org/web/20150123142154/http:/www.myfonts.com/fonts/letraset/papyrus/familytree.html \"http://www.myfonts.com/fonts/letraset/papyrus/familytree.html\")\n\nFoul play?\n\nMikey :-|\n\n",
  "author": "SuperUltraFabulous",
  "time": "31 Oct 2008 — 8:54am",
  "uid": "12479",
  "comments": [
    {
      "time": "31 Oct 2008 — 8:58am",
      "content": "With some tinkering.\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:49am",
      "content": "Identical: no. A blatant rip-off: unquestionably. He does add an italic. But since the price is marked WAY down my guess is nobody's buying.\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:56am",
      "content": "No one would dare clone Papyrus and risk \"The Mummy's Curse\" would they?\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:09am",
      "content": " ![](http://web.archive.org/web/20150123142154im_/http:/typophile.com/files/papyrus_4084.png)\n\nDerivative, but not identical. What I can't get, is why anyone would go through the trouble of creating something like that.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20150123142154/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:24am",
      "content": "Looking at that sample i notice that the «notches» on every letter seem to be in the same place…or am i wrong? The Artichoke sample is a little blurry, but it's pretty evident in the stem of «t». The «s» seems a dead giveaway too.\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:30am",
      "content": "Kottis is right, if it was uniquely created, you would think the notches would at least be in different places.\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:46am",
      "content": "And when I mean they are essentially the same face, I mean that Papyrus was plopped in an outline editor and out came Artichoke.\n\nTo Patty Fab... Bergsland refers to Artichoke as a strong seller.  \n [http://bergsland.org/fonts2006-07.htm](http://web.archive.org/web/20150123142154/http:/bergsland.org/fonts2006-07.htm \"http://bergsland.org/fonts2006-07.htm\")\n\nMikey :-(\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:54am",
      "content": "<cite>What I can’t get, is why anyone would go through the trouble of creating something like that.</cite>\n\nTo make money, of course. Myfonts has many customers who are no professional designers. They can be fooled easily. And if you set the price low enoiugh, those fonts will sell.\n\nHere is an overlay (with the change in weight removed):\n\n ![](http://web.archive.org/web/20150123142154im_/http:/typophile.com/files/Bild-26_3520.jpg)\n\nI really wish MyFonts would check all new releases for rip-offs. There are enough experts out there, even among the MyFonts staff, who could spot these rip-offs easily.\n\n"
    },
    {
      "time": "31 Oct 2008 — 11:12am",
      "content": "It looks like they just squooshed Papyrus about ten percent and overtightened the sidebearings, then chopped the ascenders a bit.. It looks like the guy figured 15 minutes of work might gain him a few bucks for a while.\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2008 — 12:00pm",
      "content": "Well at least he acknowledges he ripped someone off. This is the selling copy: The roots of this font are obvious, but it is a radical reworking into a full 650 glyph OpenType Pro font design with many changes made to make it more readable, and easier to use in a standard text setting.\n\n"
    },
    {
      "time": "31 Oct 2008 — 12:21pm",
      "content": "\"standard text setting\"\n\nHuh? Yup, now it is a text face!\n\nChrisL\n\n"
    },
    {
      "time": "31 Oct 2008 — 1:24pm",
      "content": "Naturally!  \n\"It is designed for text use in body copy.\"  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20150123142154/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "31 Oct 2008 — 1:25pm",
      "content": "Egad! Now Papyrus will never die. It's begun to spawn mutants!\n\n_Happy Halloween ;)_\n\n"
    },
    {
      "time": "31 Oct 2008 — 1:28pm",
      "content": "\\>Huh? Yup, now it is a text face!\n\nHave you ever read a spa flyer? The \"waxing\" list alone often runs to two pages. ;-)\n\n\\>it is a radical reworking into a full 650 glyph OpenType Pro font design with many changes\n\nExactly! Brazilian support is a must.\n\n"
    },
    {
      "time": "31 Oct 2008 — 1:56pm",
      "content": "<cite>The “waxing” list alone often runs to two pages.</cite>\n\nWow, I just learned more about Simon’s private life than I ever wanted too…\n\n"
    },
    {
      "time": "31 Oct 2008 — 2:01pm",
      "content": "Let me tell you about the horrors of papyrus.\n\nMy wife liked it, so she started growing it in the small pond in front of the house. But it won't survive North Carolina winters outdoors, so we have to move it into the house during the winter months. It lives in water, so we have one of the few houses in a colder climate with year-long mosquitoes. Indoors. Also, when a stalk falls over, the cats like to chew on the leaves. Then they throw up.\n\n"
    },
    {
      "time": "31 Oct 2008 — 2:23pm",
      "content": "Charles, does this papyrus-growing mean you're thinking of going back to older publishing technologies? :)\n\n"
    },
    {
      "time": "31 Oct 2008 — 3:04pm",
      "content": "\\>My wife liked it, so she started growing...\n\nMaybe it was drying it and smoking it and then posting to typophile that was the bad idea? ;-)\n\n"
    },
    {
      "time": "31 Oct 2008 — 6:53pm",
      "content": "For me the important question here is: should we judge Mr. Bergsland as harsh as the Gasoligne guys, for example? And should we bring in again the discussion about the originality of type designs?\n\nOr maybe David himself would explain the similarities?\n\n"
    },
    {
      "time": "31 Oct 2008 — 9:05pm",
      "content": "I would not judge this person as harshly as Gasoligne. This person made no attempt to hide the copying. Also, everyone on earth already has Papyrus due to bundling so no profits were siphoned away. I would perhaps question the logic in bothering to do it and assume this person is not in possession of sufficient business sense to be able to see the futility of his actions. He may have built it but nobody is coming.\n\nChrisL\n\n"
    },
    {
      "time": "1 Nov 2008 — 10:04am",
      "content": "Chris\\> No one professional at least, but I still think if you make even a dime off of stealing someone else's work the original designer should get a cut or all your profits.\n\nMikey :-)\n\n"
    },
    {
      "time": "1 Nov 2008 — 11:59am",
      "content": "I agree with you, Mikey.\n\nChrisL\n\n"
    },
    {
      "time": "1 Nov 2008 — 12:38pm",
      "content": "Has anyone notified MyFonts?\n\n"
    },
    {
      "time": "1 Nov 2008 — 4:14pm",
      "content": "MyFonts is good on their word when something is brought to their attention. but beyond that I don't think there is much attention given to the checking the originality of designs. I suspect there are a lot of fonts on the site that are of questionable origins.\n\nI was looking at a font of Lettering Delights a while back on MyFonts and so I followed the links to the LD site. Turns out there were several recognizable fonts there including P22 Dearest, T26 Lassigue D'mato, and my own Shoebop (with Veer). When I emailed the company the web person removed them and the \"CEO\" emailed me saying he would comply with my request to remove them and look into the matter with their font guy. I don't know who was making fonts for them, but at $3 retail they definitely aren't labored over.\n\nStephen\n\n"
    },
    {
      "time": "2 Nov 2008 — 6:04am",
      "content": "In answer to the original question, the roots are obvious. My hope is that it is an example of the sincerest form of flattery. It comes from a fresh trace and it is modified quite a bit as an exercise in making a font I couldn't use into one that I now use all the time. Yes, it has sold some (a few dozen copies), but it is certainly no threat to Papyrus.\n\nI'm releasing one next week that is a tracing of a printed page of Erasmus, one of Solo's old display fonts. It too is heavily modified (and it is only part of a new study on making a book font family I can actually use). I really like it and I am making it mine while tearing it apart to try and see why it is so attractive to me.\n\nHere are some comments on why I did Artichoke:\n\n1. Seeing how Chris did it.\n\n2. Make a font I could actually use\n\n3. Yes, I did spend a ridiculous amount of time on it. Well over a hundred hours, as I recall.\n\n4. Yes, I am pleased with the result. I use the font often and I can not use Papyrus much as is is because it is missing too many crucial things for me: my normal OpenType set with small caps, lining, oldstyle and small cap figures, and so on\n\nI hope it is not too offensive to you all. It is not a nefarious plot. Myfonts only approved it after they saw my original tracings. It is certainly not an attempt to make money on Chris. It will probably end up in a new display font eventually. Remember, I'm just an old graphic designer hack who is very surprised that his font designs actually sell.\n\nThanks for your time,  \nDavid Bergsland\n\nFont designer, graphic designer, writer  \n [http://bergsland.org](http://web.archive.org/web/20150123142154/http:/bergsland.org/ \"http://bergsland.org\")  \n [http://bergsland.blogspot.com/](http://web.archive.org/web/20150123142154/http:/bergsland.blogspot.com/ \"http://bergsland.blogspot.com/\")\n\n"
    },
    {
      "time": "2 Nov 2008 — 6:52am",
      "content": "They are both ulgy.\n\n"
    },
    {
      "time": "2 Nov 2008 — 7:22am",
      "content": "Quite true, Lucia, I agree. The trouble is, we have no right to prevent production of type designs we dislike. We do have a right to prevent taking someone's intellectual property (good or bad) and using it for profit--however meager that profit. I certainly hope Mr Bergsland requested and received permission from the original designer and foundry before beginning his tracing and copying. Perhaps Mr Bergsland would be better served to create truly original designs. He might then see that a mere 100 hours is nothing when it comes to type design.\n\nChrisL\n\n"
    },
    {
      "time": "2 Nov 2008 — 9:58am",
      "content": "\\>Perhaps Mr Bergsland would be better served to create truly original designs. He might then see that a mere 100 hours is nothing when it comes to type design.\n\nOr vintage fonts that have not yet been digitized.\n\nReworking Papyrus certainly seems to me like an exercise in futility. I can't imagine why one would rework one of the world's most overused fonts in order to USE IT MORE. Yet, that's a personal choice, however strange. Profiting from it... seems a bit sleazy to me.\n\n"
    },
    {
      "time": "2 Nov 2008 — 7:07pm",
      "content": "Is it double double indemnity when someone copies a horrible font, makes it worse, sells it, AND has poor taste?\n\n"
    },
    {
      "time": "2 Nov 2008 — 7:18pm",
      "content": "It is kind of like stealing someone's farts, cloning them and then charging people to smell them :-)\n\nChrisL\n\n"
    },
    {
      "time": "2 Nov 2008 — 7:58pm",
      "content": "Above, Mr. Bergsland claims Artichoke \"has sold _some_ (a few dozen copies)\" whereas on his website he advises us: \"Be sure to check out the releases of the past two years. They include the _most popular fonts I've ever released_— Brinar & Artichoke,\" and elsewhere there, Artichoke is termed \"another _strong seller_\" (all emphases mine).\n\nA disconnect? Misleading, perhaps? Well, maybe not: If his \"strong seller\" has sold \"a few dozen copies\" only, perhaps the others are by comparison downright dormant. Deservedly so, if that's the case, for in casting a glance over his displayed wares one is hard pressed not to notice there's more than a mere whiff of familiarity to them all. \"Derivative\" alone won't cut it.\n\nSo much the worse for us all — not to mention easily gulled consumers.\n\nChrisL has it spot on: \"Mr Bergsland would be better served to create truly original designs.\"\n\n"
    },
    {
      "time": "3 Nov 2008 — 6:26am",
      "content": "I do know that in an advanced typography course, one of our assignments were to take two fonts (that we did extensive research on for the first 3 months) and make a hybrid font. This of course was only an exercise, and was in no way meant for us to call this our own design. it was rather to see how letterforms were proportioned to one another, and to come out of it with a new product. This just sounds very similar, just this guy decided to see if he could sell his. But eh, it someone buys it, then they aren't worried about quality let alone design.\n\ncourtney\n\n"
    },
    {
      "time": "3 Nov 2008 — 7:12am",
      "content": "\"their font guy\"\n\nI'm so glad to hear that MyFonts has at least one 'font guy' on staff. ;0)\n\n"
    },
    {
      "time": "3 Nov 2008 — 7:45am",
      "content": "@Bergsland:\n\n_In answer to the original question, the roots are obvious. My hope is that it is an example of the sincerest form of flattery._\n\nYour hope is vain in the extreme. You are not fooling anybody here. What you hope people will see as \"imitation\" is in fact plagiarism, a knock-off, a rip-off of somebody else's typeface design. Call it what it is.\n\n_It comes from a fresh trace and it is modified quite a bit as an exercise in making a font I couldn’t use into one that I now use all the time._\n\nWhether you steal a digital font's outlines directly by importing the font file into Fontlab, or whether you auto-trace a print of the same font, makes no difference to me. I won't claim to speak for how others here see the two methods, but I see both methods as theft and theft only.\n\n_Yes, it has sold some (a few dozen copies), but it is certainly no threat to Papyrus._\n\nA paper-thin justification. That it isn't shooting up the starlets or best sellers charts does not justify your plagiarism.\n\n_I’m releasing one next week that is a tracing of a printed page of Erasmus, one of Solo’s old display fonts. It too is heavily modified (and it is only part of a new study on making a book font family I can actually use). I really like it and I am making it mine while tearing it apart to try and see why it is so attractive to me._\n\nYour methods of font production are, at a minimum, very questionable. Certainly it cannot be deemed \"typeface design\". IHacking other people's fonts and calling the resulting violation your own is plagiarism. Your methods of font production amount to the kind of ass-clownery that gives our industry a bad name. I am stopping short of making an ad hominem personal attack on you David, an argument against you as a person. Instead I ridicule your working methods and pour icy cold water on your plagiarized fonts and lack of ethics.\n\n_I hope it is not too offensive to you all._\n\nI am disgusted by it. Please remove your Artichoke font from the market and destoy all copies and work files.\n\n_It is not a nefarious plot. Myfonts only approved it after they saw my original tracings. It is certainly not an attempt to make money on Chris. It will probably end up in a new display font eventually. Remember, I’m just an old graphic designer hack who is very surprised that his font designs actually sell._\n\n(much laughter!) As if saying that is supposed to redeem you or somehow appease your peers. I'm not moved, not even by a fraction of an em. Remove Artichoke from your website and remove it from Myfonts before several other font makers and I start lobbying John Collins and Laurnece Penney to have it removed from Myfonts for you.\n\nOh yes, I'll do it too (lobby Myfonts). You can put money of that.\n\n@Darrel: _I’m so glad to hear that MyFonts has at least one ’font guy’ on staff. ;0)_\n\nI guess you're joking at least a little there. For the record, Myfonts employ several very well-informed and experienced font people. Laurence Penney and John Collins are just two of them.\n\nj a m e s\n\n"
    },
    {
      "time": "3 Nov 2008 — 7:55am",
      "content": "Personally, I don't understand why MyFonts allowed this. I don't think they should have.\n\n"
    },
    {
      "time": "3 Nov 2008 — 8:13am",
      "content": "David Bergsland: Shame on you.  \nMyFonts: Shame on you too.\n\n"
    },
    {
      "time": "3 Nov 2008 — 8:23am",
      "content": "I agree, Bill, I never understood that tracing thing. I can understand in a revival where you go back to a Letterpress printed page of a historic typeface. I don't understand it for a current face designed as digital. What is the point? Certainly, the quality of the outlines is quite bad so it is no improvement over the original. While I don't care for the original Papyrus, at least is is a competent drawing. This Artichoke thing is just crap. This is the kind of thing that can give MyFonts a bad name.\n\nChrisL\n\n"
    },
    {
      "time": "3 Nov 2008 — 8:36am",
      "content": "MyFonts follows the letter of the law. As long as there is no \"point piracy\", it's OK.  \nIf they had to make judgement calls on derivative fonts, they would continually be in contentious situations.\n\n"
    },
    {
      "time": "3 Nov 2008 — 8:39am",
      "content": "I guess you are right, Nick. They would then need a fleet of \"Lawyer Guys\" and then could not afford a \"Font Guy\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "3 Nov 2008 — 9:08am",
      "content": "\"I agree, Bill, I never understood that tracing thing. I can understand in a revival where you go back to a Letterpress printed page of a historic typeface.\"\n\nI have trouble seeing a clear line between the two.\n\nIt seems that if one just uses the term 'revival' to begin with, they can save some time fighting those that claim it to be theft.\n\nGranted, in this case, if there were no permissions granted, I'd have to side with this being a lazy remake of a known, current, protected typeface.\n\nBut many many fonts have been created from doing just the same...tracing a classic instance of type found in the wild on a sign, in lead, on wood (in fact, I've created fonts that way), etc.\n\nPerhaps that's where the line is drawn...copying a typeface that has already been made into a digital font leans towards theft. Copying a typeface found on a box in an antique store leans towards 'revival'.\n\n"
    },
    {
      "time": "3 Nov 2008 — 9:08am",
      "content": "Dez: _It is kind of like stealing someone’s farts, cloning them and then charging people to smell them :-)_\n\nG R O S S !\n\n"
    },
    {
      "time": "3 Nov 2008 — 9:45am",
      "content": "Sorry, Fredrik, It was a weak moment. Perhaps not the right image for most folks to care to visualize :-)\n\nChrisL\n\n"
    },
    {
      "time": "3 Nov 2008 — 10:44am",
      "content": "I would be surprised if every toy shop owner individually tested each toy he or she puts up on sale. This is simply not feasible.\n\nBut please be assured that we at MyFonts always review cases immediately whenever there is a complaint (no matter whether the complaint came from the party who claims that their rights have been infringed, or from someone else). Our policy is to remove the font from sales temporarily until the issue is resolved.\n\nHowever, when it comes to fresh digital versions of typeface designs that some people view as derivative (such as Adobe's Myriad, FontFont's City Street Type, Linotype's Basic Commercial, Monotype's Arial or quite a few faces from the Bitstream library), we employ industry standards, which, well, are not perfect.\n\nI should also stress that in any case, the original rights owner always has the options to follow the conflict resolution path widely accepted in civilized countries, i.e. a court of law.\n\nBest regards,  \nAdam Twardoch  \nMyFonts typographic consultant\n\nPs. Thanks to William Berkson for bringing this thread to our attention.\n\n"
    },
    {
      "time": "3 Nov 2008 — 12:22pm",
      "content": "\\>a court of law.\n\nThat has some problems, as does the more popular \"court of public opinion\". It would be nice to have third court made up of industry leaders that could give disputed new designs an originality rating.\n\nI'm thinking something modeled after this...\n\n ![](http://web.archive.org/web/20150123142154im_/http:/typophile.com/files/250px-BarbossaCourt_6533.jpg)\n\nWho would be on the “Brethren Court” and who would be King?\n\n"
    },
    {
      "time": "3 Nov 2008 — 1:03pm",
      "content": "_\"... and who would be King?\"_\n\nDavid Berlow, of course — and that's even if we have to draft him!\n\n"
    },
    {
      "time": "3 Nov 2008 — 2:39pm",
      "content": "\\>Myfonts only approved it after they saw my original tracings\n\nOriginal tracings? I may not know much about the font industry but I can clearly say that tracing someone else's work is not very original or creative.\n\n\\>100 hours\n\nThis is no time at all for a type designer.\n\n\\>I’m just an old graphic designer hack who is very surprised that his font designs actually sell\n\nAs we all are.\n\n"
    },
    {
      "time": "3 Nov 2008 — 4:26pm",
      "content": "Dezcom made me spit coffee all over my screen.\n\n"
    },
    {
      "time": "3 Nov 2008 — 5:43pm",
      "content": "I just wanted to point out for the record here that Stephen's reference to the \"font guy\" thing was referring to Lettering Delights and not MyFonts!\n\n\\> I followed the links to the LD site....  \n\\> When I emailed the company the web person removed them...  \n\\> ...and look into the matter with their font guy.\n\n-ChrisL #2, MyFonts Webmaster in full defense mode ;)\n\n"
    },
    {
      "time": "3 Nov 2008 — 10:22pm",
      "content": "After listening to Adams corporate boilerplate I kind of think Mr. Costello’s opinion should matter the most...\n\nShouldn’t Chris Costello be notified?\n\nMike Diaz\n\n"
    },
    {
      "time": "3 Nov 2008 — 10:48pm",
      "content": "Mike: _\"Shouldn’t Chris Costello be notified?\"_\n\nFor my part, an e-mail's been sent. Add your voice independently if you wish. There's contact info on his website (the URL for which was mentioned in the original posting above).\n\n"
    }
  ]
}
