{
  "id": "51143",
  "title": "An interesting one - Windows 7 fonts...",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "[http://www.istartedsomething.com/20081030/improvements-to-fonts-in-windo...](http://web.archive.org/web/20131022023730/http:/www.istartedsomething.com/20081030/improvements-to-fonts-in-windows-7/ \"http://www.istartedsomething.com/20081030/improvements-to-fonts-in-windows-7/\")\n\n",
  "author": "Si_Daniels",
  "time": "31 Oct 2008 — 9:09am",
  "uid": "1049",
  "comments": [
    {
      "time": "31 Oct 2008 — 9:48am",
      "content": "interesting. no more use for suitcase?\n\n"
    },
    {
      "time": "31 Oct 2008 — 10:25am",
      "content": "Well-functioning fonts folder, handy features, fully embracing Opentype, hiring Erik Spiekermann as director of fonts...does this mean Microsoft actually gives a crap about typefaces now?\n\nMaybe Windows 7 will usher in the death of Arial.\n\nWe can only pray.\n\n"
    },
    {
      "time": "31 Oct 2008 — 11:05am",
      "content": "Chris, \"now\"?!  \nMicrosoft has been \"giving a crap\" about fonts much more and much longer than Apple. As for praying, if you're not seeing this, I don't think you can ever be swayed from your apparent \"platform religion\".\n\nhhp\n\n"
    },
    {
      "time": "31 Oct 2008 — 1:18pm",
      "content": "Couldn't help noticing this tidbit:\n\n_\\> \\> Features removed from Windows Vista and Windows 7_\n\n\\> Panose classification was cut as very few fonts set the Panose values correctly.\n\nMight this portend similar changes in AFDKO as well? (Those among us who are ... um, well, anal about setting Panose values correctly — myself included — might like to know.)\n\nRegards,  \nErnie\n\n"
    },
    {
      "time": "31 Oct 2008 — 1:51pm",
      "content": "The \"sort fonts by similarity\" feature was cut from Windows based on the fact that many fonts have bad Panose values. Personally I think this functionality is appropriate for advanced font management utilities (perhaps with some kind of sanity testing to ensure values are within tolerances based on the font itself) but was of little use to regular users.\n\n"
    },
    {
      "time": "31 Oct 2008 — 1:53pm",
      "content": "<cite>…no more use for suitcase?</cite>\n\nFontbook hasn’t managed to kill the Mac market. Microsoft isn’t going to go nearly as far as font management apps go—it’s just finally getting better than drag-n-drop.\n\n"
    },
    {
      "time": "1 Nov 2008 — 8:35pm",
      "content": "CJ,\n\nyou did notice the date of the announcement that mentioned Erik Spiekermann being hired as Microsoft's director of fonts?  \n [http://ilovetypography.com/2008/04/01/arise-sir-erik-spiekermann/](http://web.archive.org/web/20131022023730/http:/ilovetypography.com/2008/04/01/arise-sir-erik-spiekermann/ \"http://ilovetypography.com/2008/04/01/arise-sir-erik-spiekermann/\")\n\nA.\n\n"
    },
    {
      "time": "3 Nov 2008 — 3:17pm",
      "content": "This is great thinking on Microsoft's part. Nobody can fill Robert Norton's shoes, but Spiekermann would be on anyone's shortlist to do for Microsoft in this period what Norton did for his. It's a sensible move and it's as safe as anything can be in this uncertain world. Maybe it will also be exciting? I expect a lot of good to come from this either way.\n\n"
    },
    {
      "time": "3 Nov 2008 — 3:54pm",
      "content": "Bill, I know type designers aren't supposed  \nto be able to read very well, but come on.\n\nhhp\n\n"
    },
    {
      "time": "3 Nov 2008 — 5:08pm",
      "content": "lol\n\n"
    },
    {
      "time": "4 Nov 2008 — 11:05am",
      "content": "I'm surprised nobody has mentioned Microsoft's **actual** new hire for their type group: John Berry.\n\n[http://www.microsoft.com/typography/links/news.aspx?NID=6264](http://web.archive.org/web/20131022023730/http:/www.microsoft.com/typography/links/news.aspx?NID=6264 \"http://www.microsoft.com/typography/links/news.aspx?NID=6264\")  \n [http://johndberry.com/blog/?p=215](http://web.archive.org/web/20131022023730/http:/johndberry.com/blog/?p=215 \"http://johndberry.com/blog/?p=215\")\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "4 Nov 2008 — 2:15pm",
      "content": "It's true, Hrant, I haven't been reading carefully for the last month - - I just haven't been processing. I blame it on the economic news which has created a particular disconnect for me. All these petrifying headlines consort strangely with the daily grind of rural village life.\n\n"
    },
    {
      "time": "4 Nov 2008 — 10:04pm",
      "content": "Bill, you're clearly doing it all wrong: rural village life is supposed to be the antidote to petrifying headlines.\n\nBut look, it's my new typeface:  \n [http://www.flickr.com/photos/longzheng/2985578302/](http://web.archive.org/web/20131022023730/http:/www.flickr.com/photos/longzheng/2985578302/ \"http://www.flickr.com/photos/longzheng/2985578302/\")  \n [http://www.flickr.com/photos/longzheng/2984722335](http://web.archive.org/web/20131022023730/http:/www.flickr.com/photos/longzheng/2984722335 \"http://www.flickr.com/photos/longzheng/2984722335\")\n\n"
    },
    {
      "time": "4 Nov 2008 — 10:31pm",
      "content": "I could really care less about Windows 7. I mad at Apple for doing jack-diddly with their text engine. But anyway...\n\nThe real news is that fabulous Gabriola. Does pretty things like Zapfino but in a Doyald Young feeling kind-of-way.\n\nCongrats Mr. Hudson!\n\nPlease post info ( a pdf specimen would be so nice :o) ) on the Tiro site.\n\nMikey :-)\n\n"
    },
    {
      "time": "4 Nov 2008 — 10:44pm",
      "content": "\\>Does pretty things like Zapfino but in a Doyald Young feeling kind-of-way.\n\nIf Zapfino was only good for wedding invites, Bickham Script Pro was okay for wine bottle labels, where does that leave Gabriola?\n\n"
    },
    {
      "time": "5 Nov 2008 — 3:45pm",
      "content": "<cite>Microsoft has been “giving a crap” about fonts much more and much longer than Apple. As for praying, if you’re not seeing this, I don’t think you can ever be swayed from your apparent “platform religion”.</cite>\n\nThe thing is hrant, some of these gee-wiz features are already in the shipping version of Mac OS and have been for some time. For example font files currently preview at the Finder level in Leopard. Fontbook can turn off fonts without removing them, etc. The fact is Apple will probably release at least one more version of OS X before 7 ships. The current version of Windows(Vista), still uses the Add Fonts dialog from the 90s. Bundling more and more fonts with the product is fine, but I might point out that this is something that often annoys Mac users.\n\nGabriella is a beautiful font btw, and I'm sure most Typophiles will be glad to have a copy.\n\n"
    },
    {
      "time": "5 Nov 2008 — 7:36pm",
      "content": "\\> some of these gee-wiz features ....\n\nIt's not just about OS features. To me it's more about commissioning high-quality custom fonts, as opposed to: distorting the already monstrous ITC Garamond; tweaking Myriad and pretending it's Frutiger; swiping Comic Sans; getting one guy to hack up non-Latins like Mshtakan, etc.\n\nhhp\n\n"
    },
    {
      "time": "5 Nov 2008 — 10:34pm",
      "content": "Not to mention that Apple has done little architecturally to improve on screen rendering or the text layout engine.\n\n"
    },
    {
      "time": "6 Nov 2008 — 2:07pm",
      "content": "<cite>Not to mention that Apple has done little architecturally to improve on screen rendering or the text layout engine.</cite>\n\nMy really-big-prediction-that-may-never-come-true is that the One True Solution to screen rendering is to ditch low-res screens (72-96ppi) and use a resolution independent GUI. To accomplish this will require insane hardware requirements and an ability for the system to resample/resize all bitmaps on the fly. Around 2000, Apple switched to OS X, forcing users to pretty much abandon all the software they had and endure a painfully slow new system. MS couldn't afford to do this, and we ended up with Vista. The same thing could play out again if Apple runs out of feature ideas and needs to sell more computers. A lot of what they're doing with streamlining APIs and moving GUI elements to the GPU seems to be in this direction. If so, the advantages will all show up at once in the form of a 300ppi screen, making hinting technologies obsolete.\n\n"
    },
    {
      "time": "6 Nov 2008 — 2:26pm",
      "content": "If hinting isn't obsolete on 1200 dpi printers...\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2008 — 3:44pm",
      "content": "\\>the already monstrous ITC Garamond;\n\nHrant, one of these days, you're going to marvel at some stupendously readable yet beautiful 7-point text. Then you're going to realize it's ITC Garamond. What will you do then?\n\n\\>If hinting isn’t obsolete on 1200 dpi printers...\n\nAccording to Adobe, it isn't obsolete on 2400 dpi imagesetters.\n\n"
    },
    {
      "time": "6 Nov 2008 — 3:50pm",
      "content": "And John, I really like Gabriola, but I think, as with Constantia, that there are too many elements which compel a leftwards movement, something to watch out for since it is the opposite direction to reading.\n\n"
    },
    {
      "time": "6 Nov 2008 — 3:52pm",
      "content": "Bill, ITC Garamond would have to be darker and looser to work at smaller sizes. But anyway, what's the relevance of tiny type really? It's incidental, not fundamental.\n\n\\> According to Adobe, it isn’t obsolete on 2400 dpi imagesetters.\n\nWell, for 4 point type, OK. But for normal reading  \ntype (min 8 point) 1200 seems to be a good cutoff.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2008 — 4:13pm",
      "content": "<cite>If hinting isn’t obsolete on 1200 dpi printers...</cite>\n\nI think I can honestly say that around 300ppi is where I lose interest in hinting. If I'm holding a loupe it might go a bit higher, but not much. Certainly not for screen display.\n\nAlso, my comment was a bit off topic. I think I'm just cranky because it doesn't look like Windows 7 is going to be what I hoped. A lot of Windows users still haven't left XP because they think Vista is a big bloated mess. My hope was that MS was going to keep 7 lean and mean, perhaps with a package manager like Ubuntu Linux. I imagined one installing a small base system and then installing features and functionality that they want. Typographically, I hoped they might actually take the bold step of leaving fonts like Arial out of a default install. Hiding them isn't quite the same.\n\n"
    },
    {
      "time": "23 Nov 2009 — 10:34pm",
      "content": "Hi All,  \nOne thing that annoys me about Win 7, is that it installs about 500 MB of foreign language fonts (mostly East Asian) and I had a hard time to get rid of them. I had to fiddle with user/folder/account/login permissions, some of them seem to be allways \"in use\" by the system, and what not ...  \nDont't get me wrong. I totaly agree with a system supporting good fonts for all languages. But as a big fan of lean font menus (and a lean system in general), I just don't see the point of having that amount of fonts, wich I will never, ever use for my typographic work.  \nAt least, I wish Adobe applications would support the show/hide feature of Win 7. But they don't seem to care or am I doing something wrong?  \nSo, sorry for ranting in my very first post here. Just got two hours of Win-7-font management done ;)\n\n"
    }
  ]
}
