{
  "id": "5116",
  "title": "Graphic standards guide",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i am currently working on a graphic standards guide for a network of authors and they would not be persuaded into purchasing any fonts... so i am stuck with the fonts within Windows XP and backwards.   \nfor the \"bread\" i will go for the Garamond.. but what can i use for headlines? i wanted something like Fontbureaus Interstate...   \nAnybody have a nice suggestion that would work fine with garamond?\n\n",
  "author": "zpunktled",
  "time": "7 Jun 2004 — 1:50pm",
  "uid": "557",
  "comments": [
    {
      "time": "8 Jun 2004 — 7:41am",
      "content": "Maybe one of the MS web fonts? Trebuchet/Tahoma? I've been using Bitstream's opensource Vera on a few projects as well.   \n   \nNothing as nice or versatile as Interstate, but if that's all you have to work with...\n\n"
    },
    {
      "time": "8 Jun 2004 — 1:52pm",
      "content": "thanx Darrel...   \n   \ni just want a plain sans font to work well with the MS Garamond   \n   \nBy the way... is VERA for free...? i could not see anyplace to download it..\n\n"
    },
    {
      "time": "8 Jun 2004 — 1:55pm",
      "content": "You can get BT Vera [here](http://web.archive.org/web/20131013160037/http:/www.gnome.org/fonts).\n\n"
    },
    {
      "time": "8 Jun 2004 — 2:33pm",
      "content": "s m a s h i n g ! ! !\n\n"
    },
    {
      "time": "9 Jun 2004 — 5:23am",
      "content": "If you are working with Garamond, particularly for authors, why not do it all in Garamond? It has more than enough variations to do any job required of copy.\n\n"
    },
    {
      "time": "9 Jun 2004 — 9:15am",
      "content": "yes you are probably right Paul...   \ni had in mind a sans for headlines... but maybe that is needless...\n\n"
    },
    {
      "time": "9 Jun 2004 — 12:29pm",
      "content": "Jack -- If you were working in the USA, it would be more difficult to convince others that it could be done with one typeface family. I think the advantage to Garamond would be your ability to squeeze long headlines into narrow measures by using its various bold condensed family members. Of course, it might be too restrained to use only one typeface family for sensational journalism, where the eye-chart style of typography sets the pace. Now, how do I put in one of those smileys?\n\n"
    },
    {
      "time": "9 Jun 2004 — 12:45pm",
      "content": "Windows XP also comes with News Gothic and maybe Franklin Gothic. These may work nicely.   \n   \nFYI, I've purchased CorelDraw at around $290 and it comes with a nice collection of Bitstream fonts. I think that same Bitstream collection is available separately as well. Check bitstream.com if you're interested.   \n   \n-Addison\n\n"
    }
  ]
}
