{
  "id": "51177",
  "title": "Energetic, elegant script",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking to revitalize a client's logo. Right now they're using [English 111 Vivace](http://web.archive.org/web/20131018164826/http:/www.myfonts.com/fonts/bitstream/english-111/vivace/), but it needs new life. It's currently a wedding florals company, but is expanding to include other florals, as well as event production design (lounge furniture rentals, etc). Each division will have its own logo, as well, but the new parent logo should be energetic, not strictly weddingy (you know what I mean...), but still be recognizable to her current clientele, as she is well established in the wedding industry already. House Industries' revitalization of Agent Provocateur is a really good example of what I'm trying to do.\n\nAny font suggestions? I love Burgues Script and Compendium Script, but not sure if they're quite right. Plus my client thinks (on first viewing) that Burgues is too \"slanty\"...\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [getimage.php\\_.gif](http://web.archive.org/web/20131018164826/http:/typophile.com/files/getimage.php_.gif) | 11.82 KB |\n\n",
  "author": "Cassie",
  "time": "1 Nov 2008 — 5:35pm",
  "uid": "20665",
  "comments": [
    {
      "time": "1 Nov 2008 — 5:45pm",
      "content": "How does the Agent Provocateur logo factor in? They like it? Have a look at [this thread](http://web.archive.org/web/20131018164826/http:/www.typophile.com/node/50595). Have a look also at two new scripts from [Stephen Rapp](http://web.archive.org/web/20131018164826/http:/typophile.com/wiki/Stephen%20Rapp) that are on the more handwritten end of the spectrum: [Memoir](http://web.archive.org/web/20131018164826/http:/www.typophile.com/node/50595) and [Montague](http://web.archive.org/web/20131018164826/http:/www.typophile.com/node/50595).''\n\nIf they are looking for something less \"slanty\" and more upright, consider then [Biscotti](http://web.archive.org/web/20131018164826/http:/www.fontshop.com/fonts/downloads/font_bureau/biscotti_ot/), [Fling](http://web.archive.org/web/20131018164826/http:/www.fontshop.com/fonts/singles/itc/fling_std_plain/) or [Kursivschrift](http://web.archive.org/web/20131018164826/http:/www.fontshop.com/fonts/downloads/linotype/kursivschrift_complete_vp/), big winners with the Martha Stewart crowd.\n\n"
    },
    {
      "time": "1 Nov 2008 — 5:56pm",
      "content": "I showed her the Agent Provocateur before and after to give her an idea of the kind of energy that I want to give her logo, and she got really excited. She knows that her current, \"right out of the can\" is a little stale, but she still wants to keep the calligraphic, elegant look. I'm not sure that something uber-handwritten will really work... The normal slant of a script is okay with her, but she thinks that [Burgues](http://web.archive.org/web/20131018164826/http:/sudtipos.com/fonts/97) is too \"slanty\". I love it, I think it has just the energy that the logo needs, without breaking too far from her current logo. I also really like [Young Baroque](http://web.archive.org/web/20131018164826/http:/www.myfonts.com/fonts/letraset/young-baroque/), but I think it might be a little too delicate.\n\nThanks so much for the suggestions!\n\n"
    },
    {
      "time": "1 Nov 2008 — 6:16pm",
      "content": "Young Baroque is indeed delicate. It needs to be set at a large size to perform well, something you can't promise with a logo that will appear in various sizes. In that vein, [Ballantines](http://web.archive.org/web/20131018164826/http:/www.fontshop.com/fonts/downloads/elsner_flake/ballantines_script_1_ot/) might strike the right balance.\n\nIn the end, this is probably a job for a professional letterer who can get you the precise style, weight, and tone you need. I can recommend fellow Typophiles [Michael Clark](http://web.archive.org/web/20131018164826/http:/typophile.com/wiki/Michael%20Clark) and [Mark Simonson](http://web.archive.org/web/20131018164826/http:/typophile.com/wiki/Mark%20Simonson) as well as [Doyald Young](http://web.archive.org/web/20131018164826/http:/typophile.com/wiki/Doyald%20Young), the designer of Young Baroque.\n\n"
    },
    {
      "time": "1 Nov 2008 — 6:22pm",
      "content": "Oh, I would be thrilled to work with any of those three. Unfortunately, she really doesn't have the budget, so I just have to find something that will work with (of course) some minor modifications by me to customize the logotype for her.\n\n"
    },
    {
      "time": "1 Nov 2008 — 7:08pm",
      "content": "Thanks for the reference Stephen, it is a monstrous deal to me to be recommended by a fellow typophile. I am up to my ass in alligators, but it is amazing to me that clients are not willing to pay for something that ultimately is their identity in absentia. I have always laughed at the people who have settled for the first and the last capital in their name being big, and the in-between small capitals with an underline, in a non descript font for their logo. I do not even try any more. Ignorance is the soup du jour.\n\nNo offense Cassie. They are not willing to pay for something that will last more than ten minutes. So they get what they pay for, no matter how far you, as a conscientious designer, are willing to go to give them YOUR absolute best. They do not care. But keep on trying!!!!!!!!!!!!\n\nAny more all I can do is giggle as I drive by store fronts with logos designed by monkeys.\n\nMichael\n\n"
    }
  ]
}
