{
  "id": "51189",
  "title": "Journey of the Engraving Proofing Presses",
  "forum": "nancy sharon collins's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20120411012531im_/http:/typophile.com/files/steel-die-to-send_5085.jpg)\n\nEngraving is the highest form of printmaking known, some of the shapes in letterforms today originated with the restrictions and idiosyncrasies of engraved lines. The contemporary font \"Burin\" is based on engraver's lettering styles.\n\nBut what has become of this noble art, now relegated to museums, art history books and sometimes, wedding invitations.\n\n ![](http://web.archive.org/web/20120411012531im_/http:/typophile.com/files/Presses_5492.1.jpg)\n\nThis is the story of a 5-year journey in search of an engraving proofing press. These presses have not been made since before the 1950s. Once ubiquitous as the many small print shops in any decent-size town, these little presses proofed engraving dies or were used for deep impressions in blind embossing work.\n\n ![](http://web.archive.org/web/20120411012531im_/http:/typophile.com/files/Presses_6659.embossing.jpg)\n\n(For the complete story, download the .pdf file attached to this article.)\n\nIn a nutshell, two presses were finally located in New Haven, CT. Grant funding was secured but between the time the grant was written and the funds were awarded, gas prices had sky-rocketed, making the trucking charges exceed the grants. Also, by the time we were ready to ship, the original trucker had closed operations in Louisiana, which is where the presses were to go. The presses were trucked from New Haven to Conway, AR where we went to pick them up in our truck.\n\n ![](http://web.archive.org/web/20120411012531im_/http:/typophile.com/files/Presses_6380.4.jpg)\n\nThey were delivered on a busted palette which was loaded to the bed of our vehicle.\n\n ![](http://web.archive.org/web/20120411012531im_/http:/typophile.com/files/Presses_4373.6.jpg)\n\nTogether the presses weigh about 500 pounds. Individually the components consist of the press containing the \"force\" which is like a big screw and a cross bar with two heavy metal balls, one on each end. Through the sadly mangled shrink-wrap, the manufacturer was almost readable.\n\n ![](http://web.archive.org/web/20120411012531im_/http:/typophile.com/files/Presses_4758.5.jpg)\n\nIt is 400 miles from Conway, AR to where we live in south Louisiana. The presses were moved from the truck bed to our garage by a 2-ton shop crane.\n\n ![](http://web.archive.org/web/20120411012531im_/http:/typophile.com/files/Presses_4654.7.jpg)\n\nHere the presses are assembled, the tall one is 28 inches in height and the cross bar is 34 inches wide. Each ball is approximately 5 inches diameter. Most of the presses are steel but the fitting on the top of the force is brass.\n\n ![](http://web.archive.org/web/20120411012531im_/http:/typophile.com/files/Presses_6248.8.jpg)\n\n[http://nancysharoncollinsstationer.wordpress.com/](http://web.archive.org/web/20120411012531/http:/nancysharoncollinsstationer.wordpress.com/)\n\n",
  "author": "nancy sharon collins",
  "time": "2 Nov 2008 — 8:06am",
  "uid": "14410",
  "comments": [
    {
      "time": "3 Nov 2008 — 3:29pm",
      "content": "Thanks for sharing!\n\n"
    },
    {
      "time": "3 Nov 2008 — 6:21pm",
      "content": "thank you for noticing.\n\n"
    },
    {
      "time": "4 Nov 2008 — 7:02am",
      "content": "A Oasis of good information, with a awesome die.\n\n"
    },
    {
      "time": "6 Nov 2008 — 8:27am",
      "content": "dear AGL and anyone else interested in engraving:\n\nengraving is usually the art or picture part of books, broadsides and printing. but i like what it makes letters do. if you have never visited, there is plenty more info and pictures about engraving at my website:\n\n[www.nancysharoncollinsstationer.com](http://web.archive.org/web/20120411012531/http:/www.nancysharoncollinsstationer.com/ \"www.nancysharoncollinsstationer.com\")\n\n"
    }
  ]
}
