{
  "id": "51197",
  "title": "the wrong medium",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone,\n\nMost typefaces were designed for a specific medium. For example one will do better in long texts or work better on a computer screen than anothers. Now my question is do you know typefaces thet were designed for a specific purpose that have been taken over for others… (frequently) by this i mean that they are used frequently in an other context than they were designed for… So they actually work in that context altough it was not the intention of the designer…\n\nMaybe a weird question, i know, but i’m looking for examples and i think there are a lot. Please correct me if i’m wrong :)\n\nGreetings,\n\nOlivier\n\n [‹ Type Size and Opticals](http://web.archive.org/web/20081207232739/http:/www.typophile.com/node/51193 \"Go to previous forum topic\") [FlexiSign Pro 7.5 an 8.0...does anyone know of compatible font manager? ›](http://web.archive.org/web/20081207232739/http:/www.typophile.com/node/51202 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207232739/http://www.typophile.com/user/27695\" title=\"View user profile.\">Olivier Deneef</a>",
  "time": "<br>",
  "uid": "27695",
  "comments": [
    {
      "time": " 2.Nov.2008 1.17pm",
      "content": "Well, Comic Sans was designed for a computer applicaton and now it’s used everywhere.\n\n"
    },
    {
      "time": " 2.Nov.2008 1.33pm",
      "content": "An obvious one: OCR fonts - used for the sci-fi look\n\n"
    },
    {
      "time": " 3.Nov.2008 2.27am",
      "content": "txt for the comments! other suggestions?\n\n"
    },
    {
      "time": " 3.Nov.2008 2.37am",
      "content": "Rotis from Otl Aicher was designed for faster reading of long texts. Often the font is used for advertising and corporate design.\n\n"
    },
    {
      "time": " 3.Nov.2008 7.59am",
      "content": "Trajan - designed for inscriptional lettering to celebrate Emperor Trajan’s defeat of the Dacians, now used for movie posters.\n\nFrutiger - designed for airport signage - now used for everything.\n\nZapfino - designed as an OpenType demo font - now used for wine labels and wedding invites\n\nBell Centennial – designed for small type in phone books – now used at large sizes for techno look\n\n"
    }
  ]
}
