{
  "id": "51215",
  "title": "Chorus Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This is a logo to a chorus of a baptist church.\n\nRicardo Petrowski Chorus, First Baptist Church of Bairro das Graças, Rio de Janeiro, Brazil.\n\n ![](http://web.archive.org/web/20081207232744im_/http:/typophile.com/files/ricardo_chorus_4606.gif)\n\n [‹ Updating to existing logo](http://web.archive.org/web/20081207232744/http:/typophile.com/node/50634 \"Go to previous forum topic\") [Max: Mens yoga shorts ›](http://web.archive.org/web/20081207232744/http:/typophile.com/node/41703 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207232744/http://typophile.com/user/37495\" title=\"View user profile.\">rose</a>",
  "time": "<br>",
  "uid": "37495",
  "comments": [
    {
      "time": " 3.Nov.2008 6.32am",
      "content": "I’m guessing your trying to go for a musical staff in the background? What’s the concept?\n\ncourtney\n\n"
    },
    {
      "time": " 3.Nov.2008 10.43pm",
      "content": "Try taking the the staff shape from the top right, and moving it down to the left, then flipping it and moving it to the right to create wings. Just a thought.\n\n- Lex\n\n"
    },
    {
      "time": " 4.Nov.2008 5.40am",
      "content": "Yes, a musical staff.\n\nThe concept  \nThis is the most traditional chorus of this church.  \nTraditional but contemporary.\n\nI have used the chorus name into the musical staff, because the chorus is the music, the musical notes.\n\n"
    },
    {
      "time": " 4.Nov.2008 12.18pm",
      "content": "What about taking a nod from something [a bit historically fancier](http://web.archive.org/web/20081207232744/http:/www.typography.com/ask/showBlog.php?blogID=75)?\n\n"
    },
    {
      "time": " 5.Nov.2008 4.25pm",
      "content": "utt73-\n\nthose are beautiful. I’m not sure of your level rose, but this might be a pretty good idea for a direction. I think the design you have is too static. Also, maybe try another typeface. I think you might want a lighter face, possibly script face?. it’s just that now, the lines of the “staff” and the lines of “CORO” are practically the same width. Think contrast in scale.\n\nAlso, just one small thought about the staff, it doesn’t read musical staff yet. Because it’s wavy...it reminds me more of water...or the more obvious...waves ;) Maybe add the end vertical bars at the end? (The thick and thin lines that are at the end of the sheet music.) Again..,just a thought, but ya know :D\n\ncourtney\n\n"
    },
    {
      "time": " 6.Nov.2008 7.28am",
      "content": "I find that when I look at it, although I don’t get the feeling that it’s 100% done yet, I think it works.\n\nThe first thing that popped into my head is a sheet music book my sister used to have, Chopin and others I think.\n\nYou certainly communicated something with class, something musical and also something that’s current. Those are all what you seem to be going for, just finish up the details and I think you’ll be golden!\n\nEDIT: ah, and I got that it was a staff because of the number (5) of lines, I’m not sure you need more than that, but I do find the ends of the lines too abrupt. a tapering of the lines at the end might soften them and make them feel more calligraphic. Just my 2¢\n\n"
    }
  ]
}
