{
  "id": "51217",
  "title": "A Monogram",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I recently created a monogram for personal use and would like your thoughts about it. The base typeface is Minion. Any comments would be appreciated.\n\n ![](http://web.archive.org/web/20131017033406im_/http:/typophile.com/files/Monogram-With-Boxes_5492.png)\n\n",
  "author": "OwenB",
  "time": "3 Nov 2008 — 5:57am",
  "uid": "39219",
  "comments": [
    {
      "time": "3 Nov 2008 — 7:19am",
      "content": "At first glance i saw OB, then a second look made me see CB. Something about how the top of the C slides into the top of the B seems unresolved. Same with the bottom of the C joining the bottom of the B.\n\nPerhaps its the weight of the B's vertical Stem in comparison to the heavy back of the C. The bowls of the B match the C but it looks like the counter space of the C is eating into the stem of the B.\n\nWorking that counter a bit might really define the characters and make a nice monogram.\n\nIt looks good though. Nice work. Sorry if I have crossed my O's and C's\n\n"
    },
    {
      "time": "3 Nov 2008 — 8:22am",
      "content": "Thanks for the comment. First, to clarify, it's an \"OB\" monogram. I also thought that perhaps the stem of the B is too weak, especially in proportion to the back of the O and the end of the B. On the other hand, I don't want the bridge/web between the bottom and top of the O and B to be too heavy. Do you prefer the copy below?\n\n ![](http://web.archive.org/web/20131017033406im_/http:/typophile.com/files/Monogram-copy_4463.png)\n\nCompared to the original below:\n\n ![](http://web.archive.org/web/20131017033406im_/http:/typophile.com/files/Monogram-Big_3649.png)\n\nI personally feel that thickening the B stem actually throws off the balance of the monogram; the strength of the outer sides (left side of the O, right side of the B) makes up for a weaker center. Something about the increased thickness makes me feel that the letters are separately defined and the monogram is gluing them together, rather than the mark being a self-contained, more stylized symbol. But let me know your feelings about this; I can be easily persuaded.\n\nOB\n\n"
    },
    {
      "time": "3 Nov 2008 — 1:41pm",
      "content": "I do prefer the new thicker stem but I see your point. You'll have to print it at the size you expect it to be seen to be sure of the stem's effect on the monogram.\n\nWell you have my opinion but thats just one. Keep shopping it around. I do like it.\n\n"
    },
    {
      "time": "3 Nov 2008 — 1:55pm",
      "content": "I, too, did what Pentapus did. I saw OB at first, then thought maybe it was a CB. Is that a big deal? Maybe. Maybe not. It's a nice mark, though.\n\n"
    }
  ]
}
