{
  "id": "51245",
  "title": "Dance studio - typography",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am doing an identity redesign for a dance studio. I am running into the wall regarding typography.\n\nThe dance studio caters to an eclectic genres of dancing—ballroom, salsa, hip-hop, swing, tango, zumba, latin, flamenco, and other style of dances I am not familiar with. The typography has to appeal to a broad audience of dancer and encapsulate a whimsical feel.  \n(man, i sound like my worst client)\n\nCan i get a few suggestions?  \nThanks in advance for all of your feedbacks.\n\n [‹ The Cure for the Common Workout](http://web.archive.org/web/20081207232800/http:/www.typophile.com/node/51278 \"Go to previous forum topic\") [new logo ... ›](http://web.archive.org/web/20081207232800/http:/www.typophile.com/node/51243 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207232800/http://www.typophile.com/user/21101\" title=\"View user profile.\">designtn</a>",
  "time": "<br>",
  "uid": "21101",
  "comments": [
    {
      "time": " 3.Nov.2008 4.23pm",
      "content": "dance: humanist\n\ninternational/eclectic: sans\n\nwhimsical: light\n\nelegant: high-contrast\n\nPerhaps a light version of [Minah](http://web.archive.org/web/20081207232800/http:/fontbureau.com/fonts/sans/Minah)?\n\n"
    },
    {
      "time": " 4.Nov.2008 7.49am",
      "content": "I don’t think you can solve this kind of a problem with just a typeface.  \nYou have to have some idea of how you are going to set it.  \nWhimsy suggests, for instance, an old-style face with an ostensibly conservative personality, set large without much leading, on a narrow measure.\n\n"
    },
    {
      "time": " 4.Nov.2008 9.24am",
      "content": "Nick, thanks for your thoughtful insights. I guess I am still trying to formulate the feel.  \nI was thinking of going the route of a signature logotype but my budget does not permit a calligrapher.  \nI don’t want to go with a generic hand written typeface.\n\n"
    },
    {
      "time": " 4.Nov.2008 9.47am",
      "content": "Oh, I thought you were after a general typographic look, not a logo/wordmark.  \nIf you are thinking of a script wordmark, you should consider an OpenType script with contextual glyph substitutions, which will give more of the look of custom calligraphy. Veer and House are good places to look for such things. (Not to mention my own Handsome.)\n\nIf all goes well, you will be able to preview these effects at the new MyFonts.\n\n"
    }
  ]
}
