{
  "id": "51253",
  "title": "Lets poll the typography heads!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So I was sitting around the other day and realized that I had some nice development on some type to help express my political views and had unfortunately done nothing with it. So I sat down for an hour and pushed something out for fun. I figured I would post it and see if we can get a poll on election day of the typography crowd up here. So throw them up! Take a few minutes (or more if able) and show your support for your party with a fancy little type lock up. You know, if you are into that kind of thing.\n\n ![](http://web.archive.org/web/20081208191551im_/http:/typophile.com/files/obama-we-believe_3767.gif)\n\n [‹ Non-roman ornamental typography-please help](http://web.archive.org/web/20081208191551/http:/typophile.com/node/51364 \"Go to previous forum topic\") [Asian but not 'too Asian' ›](http://web.archive.org/web/20081208191551/http:/typophile.com/node/51351 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081208191551/http://typophile.com/user/39273\" title=\"View user profile.\">chadkouri</a>",
  "time": "<br>",
  "uid": "39273",
  "comments": [
    {
      "time": " 4.Nov.2008 2.51am",
      "content": "A quick and badly scanned contribution. I should be working but I must confess I’m just waiting for the results that won’t come before late this night. And thanks for giving non American a way to “vote”.\n\n ![](http://web.archive.org/web/20081208191551im_/http:/typophile.com/files/obama_3760.jpeg)\n\nNow that I have expressed myself I might be able to focus on something else, who knows.\n\n"
    },
    {
      "time": " 4.Nov.2008 6.39am",
      "content": "Maybe look at integrating the two elements a bit more. Maybe color? Weave the flourish throughout “obama08”? I like the iconic mixed with drawn. Keep rocking it.\n\n"
    },
    {
      "time": " 4.Nov.2008 6.40am",
      "content": "As a foreigner I don’t get to vote, so here’s one for the other guy...\n\n ![](http://web.archive.org/web/20081208191551im_/http:/typophile.com/files/Mac_5187.JPG)\n\n"
    },
    {
      "time": " 4.Nov.2008 7.30am",
      "content": " ![](http://web.archive.org/web/20081208191551im_/http:/typophile.com/files/election_6340.png)\n\n"
    },
    {
      "time": " 4.Nov.2008 7.51am",
      "content": " ![](http://web.archive.org/web/20081208191551im_/http:/typophile.com/files/Ob_4673.png)\n\nOn Target for Change.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2008 2.47pm",
      "content": " ![](http://web.archive.org/web/20081208191551im_/http:/typophile.com/files/pumpkinob2_6609.jpg)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2008 3.20pm",
      "content": "As a “foreigner” like Sii, I don’t get to vote in the U.S presidential election(s). This one has recieved so much attention outside the U.S that people over here and elsewhere have been saying we non-U.S citizens of the free Western world should get to vote for the U.S president since it affects us in more ways than we care to mention.\n\nI like Barak Obama and think he would make an excellent president in 15 to 25 years from now, when he has more life experience and experience holding executive office. I know, he is an early bloomer, and America really needs change right now, but installing a young president who isn’t white-skinned is not the way to do it. Obama’s skin color is not an issue with me. His lack of experience and world weariness is tho. And not being white-skinned makes him the target of hatred and bigotry. I don’t want to see him get blown away. Watching Kennedy die was bad enuff. A liberal white-skinned nominee devoted to change and pulling America out of Iraq, Afganistan and Pakistan, funding the war veterens hospitals and public health care system properly would be a better choice.\n\nA large number of the public are still using the outmoded term “race” when referring to Obama. There is no such thing as race or races within the human species. We are all of the same race—homo sapiens. In a politically-correct liberal society, “race” should not be an issue to the extent it does not even rate a mention, yet people continue referring to Barak Obama’s “race”. So we ain’t there yet.\n\nj a m e s\n\n"
    },
    {
      "time": " 4.Nov.2008 4.13pm",
      "content": "America has had years of presidents who were “experienced white guys” and look what a mess we are in. I could care less what race or sex our presidents are. I just don’t want any more invaders of foreign countries who are beholding to big oil and big defense companies destroying our country. I prefer to let a younger person with a brain have a chance to start us back in the direction of peace and prosperity.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2008 5.04pm",
      "content": "I agree with most of what you’re saying Chris, except I’m not recommending just any old “experienced white guy”. A liberal white-skinned guy, or even a white-skined woman.\n\nThe point about skin color is that Obama’s poses serious obstacles to his potential effectiveness as commander in chief and obstacles to America moving forward. U.S citizens threw away their best candidate, Hillary Clinton. Hillary was well qualified for the job. British author Doris Lessing expressed much the same view I am expressing.\n\nExperienced white guys are not the problem. America’s privately funded republic government is the problem. That and economic dependence on her munitions and war industry. America’s economy runs down when it doesn’t have a war to fight. As Gore Vidal said, “Why be a senator when you can just buy one?”\n\nGiving a younger person with a brain a chance at leading the country is a nice idea, but how practical is it?\n\nAnd once again you are perpetuating the term “race”. There is no such thing. Obama is the same species as you and I.\n\nj a m e s\n\n"
    },
    {
      "time": " 4.Nov.2008 5.13pm",
      "content": "Get real. America is a crumbling empire, like many before. Many ugly things happen during this process, just read your history. When you spread yourself too thin the Huns attack you from the North, the Celts revolt in the Northwest, etc…\n\nThere aren’t solutions for this, it is inevitable. The question is what will we do on the way down and how many will we take with us?\n\npbc\n\nAll ideas, theories and statements are subject to change without notice.\n\n"
    },
    {
      "time": " 4.Nov.2008 5.33pm",
      "content": "Paul—I am well-read on U.S history and world history thanks. Have you read Gore Vidal’s _Empire_? Yes, America is a crumbling empire. That I didn’t say that earlier doesn’t mean I didn’t know it. America is a crumbling empire but your view of it is wholly negative, and your analogy with what ended the Roman Empire holds less water than you might think. Different other empire with different other circumstances.\n\n_There aren’t solutions for this, it is inevitable._\n\nWhat is? That America will fall apart and crumble? You could be more positive about this you know. Your cynicism prevents you from seeing and acknowledging any change or positive outcome.\n\nj a m e s\n\n"
    },
    {
      "time": " 4.Nov.2008 5.53pm",
      "content": "\\> Your cynicism prevents you from seeing and acknowledging any change or positive outcome.\n\nThat very much depends on what is viewed as a positive outcome James. As someone who’s never felt part of this “system” I might have a very different point of view than yours as to what is “positive”.\n\nbtw - my original comment was certainly not pointed at you James.\n\npbc\n\nAll ideas, theories and statements are subject to change without notice.\n\n"
    },
    {
      "time": " 4.Nov.2008 7.48pm",
      "content": "_There is no such thing as race or races within the human species. We are all of the same race—homo sapiens._\n\nRight on, James. I feel the same way. Thanks for saying it. :-)\n\n"
    },
    {
      "time": " 4.Nov.2008 8.18pm",
      "content": "\\>the Huns attack you from the North,\n\nCome the revolution I’m with the Canadians.\n\n"
    },
    {
      "time": " 4.Nov.2008 10.59pm",
      "content": "lol. what happened to images for candidates?\n\n"
    },
    {
      "time": " 5.Nov.2008 12.21am",
      "content": "@Paul: _That very much depends on what is viewed as a positive outcome James. As someone who’s never felt part of this “system” I might have a very different point of view than yours as to what is “positive”._\n\nThis is a good point I can relate strongly to. I’ve always been quite a non-conformist myself and never really felt part of the system either. But I’m philosophical about most things and urge everybody I come into contact with to be philosophical too.\n\n_btw - my original comment was certainly not pointed at you James._\n\nThat’s okay. I offered a pre-emptive defense. Our views may differ but I’m with you in spirit.\n\n@j\\_polo9: _lol. what happened to images for candidates?_\n\nWe can have commentaries as well as type comps can’t we? Anything wrong with that? Now that Barak Obama has won the presidency I’ll put a visual piece together and post it—when I can get to it. I’m right in the middle of doing a font release.\n\nj a m e s\n\n"
    },
    {
      "time": " 5.Nov.2008 4.12am",
      "content": "There is no race. What is there is people upset. Upset with what happened during eight years of THE MONKEY!\n\nI wish the poppet-monkey go straight to hell! Upside down! And when he get down there he will pay 10,000,000,000,000,000.00 OVER!!!\n\nBut wait, the MONKEY is still there for more 10 weeks or so... until then cross your fingers.\n\n ![](http://web.archive.org/web/20081208191551im_/http:/typophile.com/files/hand_4147.gif)\n\n"
    },
    {
      "time": " 5.Nov.2008 9.30am",
      "content": "Any meaningful change is internal. In that spirit I will listen to Sufi ceremonial music today.\n\npbc\n\nAll ideas, theories and statements are subject to change without notice.\n\n"
    },
    {
      "time": " 5.Nov.2008 10.53am",
      "content": "\\>Giving a younger person with a brain a chance at leading the country is a nice idea, but how practical is it?\n\nObama ran an astoundingly disciplined campaign. He came from basically out of nowhere and managed to unseat the frontrunner in the primary, Hillary. He had an organized field operation that turned out the vote in places that had not voted for a democrat in decades. His first real act as candidate was choosing a vice president; he went with a man who has the experience he lacks rather than a publicity grab like Sarah Palin. He has shown extraordinary judgment and restraint in the general election. I have no doubt that Obama will staff his administration with smart, experienced advisors. I trust that he will have learned from what went on the past 8 years and cooperate with the other side, especially since he’s facing the sorts of challenges (economy, wars, healthcare, global warming) that require a bipartisan effort rather than just ramming legislation through.\n\nAnd importantly, he represents a chance for America to redeem its tattered reputation abroad.\n\n"
    },
    {
      "time": " 5.Nov.2008 1.41pm",
      "content": "youth and race have nothing to do with qualifications. he will surround himself with experts and advisors of all ages and races.\n\nthe brilliance of obama’s campaign and the wisdom of his words speak volumes about his qualifications. he won.\n\nin contrast, the laughable campaign choices of his opponent further testify that race and age guarantee nothing\n\n"
    },
    {
      "time": " 5.Nov.2008 4.59pm",
      "content": "“its tattered reputation abroad.”\n\nGod bless America... Murtha (a decorated war veteran) won his Senate seat again after calling his constituents rednecks and racists (and our soldiers murderers). Now that is an enlightened electorate! With his abhorrence for the war this should show Europe that Bush is finished.\n\nMichael\n\n"
    },
    {
      "time": " 5.Nov.2008 5.02pm",
      "content": "BTW Thank whoever that Obama won — he is the One.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 5.Nov.2008 5.03pm",
      "content": "O, I just spent half an hour to composit a post and then the system conspired and it all got l  \nost.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 5.Nov.2008 5.04pm",
      "content": "First time this sw helped me.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 5.Nov.2008 6.35pm",
      "content": "Well, I’m sitting up here in Canada, right on top of good ol christian america. I doubt most americans realize their neighbours to the north also just finished a federal election.\n\nYup, that’s right, we re-elected Stephen Harper as Prime-Minister of Canada.\n\nNow, what do I think of the election, living almost within sight of the US, and raised in a half-american home?\n\nIf this election shows us one thing, it’s that the mainstream american media has more power than ever. Most americans I talked to for the longest time though the election was between Hilary and Obama.\n\nAs america’s #1 trading partner, Obama gives me the heebie-jeebies. He focuses on America’s weaknesses and mistakes, and his promise of change, but I haven’t heard enough of his political platform, his plans and his personal worldview to support the man.\n\nMcCain does talk, and I believe him to be a liar, or delusional.\n\nWe all know Obama was going to get in, and we’re in for a 4 year ride. Please, please all americans get involved in politics in your community, get involved and don’t let your country go to waste because of a leader (no matter who it is)\n\nI think the next election will be the one that uses the Internet in place of Television as the deciding battleground - it would be wise to start working on that framework and technology now!\n\n"
    },
    {
      "time": " 5.Nov.2008 7.26pm",
      "content": "\\> it would be wise to start working on that framework and technology now!\n\nand the font?\n\n"
    },
    {
      "time": " 6.Nov.2008 6.12am",
      "content": "`if (hijack=continue)\n{\noperator(\"quit\");\n}\nelse\n{\noperator(\"continue.with.thread\");\n}`\n\nPuckett’s beautifully poetic composition gets my vote.\n\n"
    },
    {
      "time": " 6.Nov.2008 9.39am",
      "content": "_Now, what do I think of the election, living almost within sight of the US, and raised in a half-american home?_\n\nForeign policy experience!\n\n"
    }
  ]
}
