{
  "id": "51262",
  "title": "Convert to .otf?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi all,\n\nI've Googled a little but have not been able to find software that will let me convert fonts to open type files (.otf). Anyone know of a way to do this? (Hopefully a free utility)\n\nThanks or any info,  \nDavid\n\n",
  "author": "r0sss",
  "time": "4 Nov 2008 — 6:16am",
  "uid": "39286",
  "comments": [
    {
      "time": "4 Nov 2008 — 7:27am",
      "content": "You could try FontForge which is open-source. However, note that many font licenses do not allow such operations. Also, much depends on from what you want to convert. Is it Type-1, TrueType or something else?\n\nI hope this was helpful. Good luck!\n\n"
    },
    {
      "time": "4 Nov 2008 — 9:02am",
      "content": "MakeOTF that is part of the free Adobe FDK for OpenType will do this:  \n [http://www.adobe.com/devnet/opentype/afdko/](http://web.archive.org/web/20141029051916/http:/www.adobe.com/devnet/opentype/afdko/ \"http://www.adobe.com/devnet/opentype/afdko/\")\n\nTransType, TypeTool or FontLab Studio (commercial, use the Adobe FDK libraries):  \n [http://www.fontlab.com/](http://web.archive.org/web/20141029051916/http:/www.fontlab.com/ \"http://www.fontlab.com/\")\n\nFontForge (open source, does not use the Adobe libraries):  \n [http://fontforge.sourceforge.net/](http://web.archive.org/web/20141029051916/http:/fontforge.sourceforge.net/ \"http://fontforge.sourceforge.net/\")\n\nMost of the commercial OpenType PS (.otf) fonts are made using the Adobe FDK library -- either using MakeOTF or one of FontLab's applications.\n\nAdam\n\n"
    },
    {
      "time": "5 Nov 2008 — 5:47am",
      "content": "Thanks for the info, both of you. Helps a lot. I'll look into using these apps later today.\n\nThanks again,  \nDavid\n\n"
    },
    {
      "time": "8 Nov 2008 — 5:43pm",
      "content": "Adam - By listing tools that can be used to convert to OTF, are you now saying that it's OK to convert fonts from Truetype or Type 1 to Open Type? Three months ago (to the day, in fact) in the Adobe OpenType Developers forum, you spelled out in some detail a number of things that don't necessarily convert transparently. The areas included kerning, linespacing values, and styles and fontnames, while noting that this was not a complete list. You ended with:\n\n\"In my experience, a fully automated successful conversion from Type 1 to OpenType is quite difficult and requires technical knowledge of the OpenType specification beyond an average user's skills.\"\n\nFrom a technical (rather than legal) standpoint, under what circumstances would you recommend or be tolerant of such conversions ... and when NOT?\n\n- HVB\n\n"
    },
    {
      "time": "8 Nov 2008 — 7:03pm",
      "content": "I'm not Adam, and have never even played him on TV, but let me take a shot.\n\nI've converted a number of Type 1 fonts to .otf. The way I look at it is that .otf are just Type 1 fonts with an OpenType wrapper. I don't know any \"conversion\" software that writes good enough features, so you have to understand how to write features. Usually, the foundry kerning is inadequate, so you have to re-write the kerning, but you had to do that with Type 1 fonts anyway.\n\nPotential naming and linespacing problems are ones I can't speak to, as we only use converted fonts with InDesign & it is quite forgiving about names & we don't use any built-into-the-font linespace values. But the question comes up: if you aren't going to use the \"features\" (advantages) of OpenType, why convert? The only answer I can think of is to get everything in Unicode; that the \\*file\\* is more important than the \\*document\\*. If you are using, say, Word, and the file isn't what's important, why convert?\n\n"
    },
    {
      "time": "8 Nov 2008 — 8:10pm",
      "content": "\\> By listing tools that can be used to convert to OTF,  \n\\> are you now saying that it’s OK to convert fonts  \n\\> from Truetype or Type 1 to Open Type?\n\nWell, if one has a PC Type 1 font that he or she has to use on Mac OS X or vice versa, then a simple conversion to OTF may be helpful. But such fonts will not stand any comparison to profesionally-mastered fonts. Unless you really know what you're doing, the self-made OpenType fonts may work fine in one app but not in another, may have different linespacing depending between different systems and applications, the kerning may not work, the automatic ligatures may not work, some styles from the family may be missing etc.\n\nBut if you really need to get done something badly for a one-off publication, it's still better than nothing. But I wouldn't build a regular publication schedule or a corporate identity around such a conversion.\n\nIt's like when you need to insert some company's logo into a poster quickly, you'll autotrace it from a bitmap or insert an RGB variant and rely on the prepress software to deal with the color conversion. It'll be done quickly but you risk that the result may actually be wrong. On the other hand, if you care about the quality, you'll find a high-quality vector version of the logo with the official PANOSE or CMYK color definitions and usage guidelines.\n\nA.\n\n"
    },
    {
      "time": "9 Nov 2008 — 12:42am",
      "content": "Fair enough! Thank you.\n\n"
    }
  ]
}
