{
  "id": "51275",
  "title": "My son Michael votes in his first presidential election",
  "forum": "dezcom's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20081210105505im_/http:/typophile.com/files/Michaelelection_5239.JPG)\n\n",
  "author": "<a href=\"/web/20081210105505/http://typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": " 4.Nov.2008 10.31am",
      "content": " ![](http://web.archive.org/web/20081210105505im_/http:/typophile.com/files/MichaelVotes4Obama_4642.JPG)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2008 10.32am",
      "content": " ![](http://web.archive.org/web/20081210105505im_/http:/typophile.com/files/RuthMichaelvote_6276.JPG)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2008 10.41am",
      "content": "Oh, and by the way, we voted :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2008 11.42am",
      "content": "Awesome Chris!\n\nThanks to you and your family for doing your part! We voted as well today!\n\nShout out to all Typophiles . . . WHO VOTED TODAY?\n\n:D\n\n"
    },
    {
      "time": " 4.Nov.2008 11.53am",
      "content": "I voted—every election since Kennedy. And my wife, for the first time. Last month she became a citizen, and is very happy. We took pictures, but not digital so I can’t post them.\n\nHere’s hoping that tonight we’ll learn that our long national nightmare is going to be over. It’s looking good.\n\n"
    },
    {
      "time": " 4.Nov.2008 12.09pm",
      "content": "Chris,\n\nTo stay in the spirit, is Michael prepping for another of his rousing renditions of “I Feel Good,” too?\n\n_“WHO VOTED TODAY?”_\n\nDidn’t vote today, but a few weeks ago (absentee ballot sent from Athens).\n\nBut about _this_ election, I don’t know... Put it this way: I’ve got a funny feeling in my gut. Perhaps it’s just gas.\n\n"
    },
    {
      "time": " 4.Nov.2008 1.35pm",
      "content": "Thanks, everyone!\n\nrcc: Michael is waiting for the counting of ballots before he breaks out into song :-)\n\nHopefully, it will be “I feel Good” and not something like “Sometimes I Feel Like a Motherless Child”\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2008 3.12pm",
      "content": "Well, looks like he picked _one_ of the correct teams to support... ;-)\n\n"
    },
    {
      "time": " 4.Nov.2008 3.14pm",
      "content": "I hope both of his favorite teams do well. Now we have to see how the Obama team does :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Nov.2008 10.05pm",
      "content": "I think the song turned out to be “Signed, Sealed, and Delivered” :-)\n\nChrisL\n\n"
    },
    {
      "time": " 5.Nov.2008 12.15am",
      "content": "Thanks to you guys for helping to swing Virginia!\n\n"
    },
    {
      "time": " 5.Nov.2008 4.17am",
      "content": "God Bless!\n\nps: DIE MONKEY! DIE!!\n\n"
    },
    {
      "time": " 5.Nov.2008 4.56am",
      "content": "C.H.A.N.G.E  \nWE DO NEED\n\n"
    },
    {
      "time": " 5.Nov.2008 6.00am",
      "content": "It’s a new day in America. Hallelujah!\n\n"
    },
    {
      "time": " 5.Nov.2008 6.40am",
      "content": "Thanks to my wife Ruth for numerous door-to-door canvassing and phone calling as a volunteer for Obama and to our many friends here in Northern Virginia who voted, contributed, canvassed, and cried for joy last night at 11:01 PM eastern!\n\nChrisL\n\n"
    },
    {
      "time": " 5.Nov.2008 6.59am",
      "content": "By the way, Northern Virginia is truly a different world than the rest of Virginia—what they call “The Real Virginia.” Northern Virginia is mostly a collection of transplanted yankees, typically with college educations and liberal views. There is also a large number of immigrants from Latin America, Southeast Asia, and the Middle east.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Nov.2008 7.10am",
      "content": "Congratulations Chris, Dan, William, Stuart—to all U.S typophiles and the people of the United States of America. This is one historic day and the rest of the world will never forget it or you.\n\nI am most happy and filled with joy for all of you.\n\n@Stuart: _Shout out to all Typophiles . . . WHO VOTED TODAY?_\n\nNot wishing to put too fine a point on it, it would be most helpful and far less annoying to typophiles living outside the United States, if, when referring to U.S typophiles, Americans qualify these statements by including “U.S” as in “all U.S typophiles” or similar. Of course I didn’t vote in your election.\n\n:^) all comments made in good faith.\n\nj a m e s\n\n"
    },
    {
      "time": " 5.Nov.2008 7.35am",
      "content": "Chris, I also canvassed, made phone calls and gave money on line. I did a small amount of all three, but I figured that if millions of others did the same, it would add up. And it did. Whoopee!\n\nI got an e-mail from Obama saying thank you, “you” did it, you won the election. And I kind of felt that this wasn’t just hype. I and 3 million other ’I’s who volunteered—and got the same e-mail—did help.\n\n"
    },
    {
      "time": " 5.Nov.2008 7.49am",
      "content": "Yesterday’s [Daily Pangram](http://web.archive.org/web/20081210105505/http:/dailypangram.blogspot.com/):  \nHey! Like, quite exciting! B. Obama as prez, J. Biden as veep, FTW!\n\n"
    },
    {
      "time": " 5.Nov.2008 9.22am",
      "content": "We got the same letter, Bill :-)\n\nChrisL\n\n"
    },
    {
      "time": " 5.Nov.2008 9.55am",
      "content": "good, I hope everyone voted\n\n"
    },
    {
      "time": " 5.Nov.2008 10.44am",
      "content": "The giant dumpster in the background concerns me. Did their votes count, or did they get inputted directly into the dumpster?\n\n"
    },
    {
      "time": " 5.Nov.2008 11.13am",
      "content": "Darrel,  \nLOL!!! It does look rather suspect :-)  \nAs is the usual tradition, the partisan greeting tables are not permitted to be too close to the actual door of the polling place. The allowed number of feet clearance brings them smack infront of the dumpster! Since our voting district went 90% for Obama, I am sure our votes were counted. We helped swing Virginia to a Democrat for the first time in decades.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Nov.2008 11.51am",
      "content": "Congrats on your new president.  \nToo bad on the failed Prop 8 thing though.\n\n"
    },
    {
      "time": " 5.Nov.2008 12.05pm",
      "content": "Yes, my other son in California is really bummed about Prop 8.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Nov.2008 1.22pm",
      "content": "We now know Californians prefer constitutional rights protection for chickens, but not those citizens that happen to be gay.\n\n"
    },
    {
      "time": " 5.Nov.2008 3.38pm",
      "content": "Thank God, it is time for a change\n\n"
    },
    {
      "time": " 5.Nov.2008 4.56pm",
      "content": "What an amazing result! I’m very pleased to have been part of it . . .\n\nTo your point James, Typophile is so familiar to me, sometimes I don’t think to discriminate its truly global membership since I consider us collectively firstly under the category of Typophiles . . .\n\nStuart :D\n\n"
    },
    {
      "time": " 7.Nov.2008 9.19am",
      "content": "My son Michael came home from school today at our local community college grinning from ear-to-ear. He had heard several conversations among students as well as what the media had been saying. He was so proud to have been part of the new group of young voters who had swayed the election to Obama. He REALLY felt that his individual vote counted and felt proud thet his demographics had such a big voice in moving Virginia into the Blue column.\n\nChrisL\n\n"
    },
    {
      "time": " 8.Nov.2008 12.42pm",
      "content": "When W. was re-elected in 2004, my son told me that there was shock and grief on the faces of everybody in Manhattan. You could see the silence and stunned looks in the streets, in the subway.\n\nThis time, people spontaneously poured out in the streets to celebrate publicly, jumping up and down and shouting. People were dancing in the streets and hugging strangers. The coolest event my daughter saw was on 14th, West of Union Square; there people were doing percussion on the metal newspaper sales boxes, and a telephone booth, and one guy drumming on a plastic bucket. She said it was like a scene out of the musical “Stomp!”. Everyone who wasn’t drumming was dancing, everybody was hugging each other. And a guy with a trombone came alone and played to the beat.\n\nWalking through the more deserted streets—after midnight—when she would see somebody they would spontaneously shout “Yippee! Yahoo!” And she back. She said she’d never seen anything like it. I haven’t either.\n\n"
    },
    {
      "time": " 8.Nov.2008 12.50pm",
      "content": "Thank goodness we have a moment like this in recent times to celebrate a coming together with joy. Everyone around here is walking around on a cloud beaming! Here is hoping this wave will carry us ALL through the difficult times that still hang over us.\n\nMay you you have strength enough for all, Barack!\n\nChrisL\n\n"
    },
    {
      "time": " 8.Nov.2008 6.05pm",
      "content": " ![](http://web.archive.org/web/20081210105505im_/http:/typophile.com/files/10-08-dina-yeswecan-s_6724.jpg)\n  \nI stitched this appliquéd banner, and some people have been nearly brought to tears by it, much to my surprise, while little kids point and cry out “Obama, Obama!”\n\nI invented this lettering style while sewing the design, feeling the need to make an dazzling version of the slogan usually in the utilitarian type style of the Obama campaign.\n\nGovernor Dean was in town for a rally in Seattle, thus the Dean04 memorabilia.\n\nYeah, I am very happy!\n\n"
    },
    {
      "time": " 8.Nov.2008 8.27pm",
      "content": "Thank you, Dina! I am happy for you and all of us! :-)\n\nChrisL\n\n"
    }
  ]
}
