{
  "id": "51289",
  "title": "I BEG YOUR INSIGHT/ADVICE (warning, lengthy yet disturbing text ahead)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Bless me everyone for I have sinned. It's been more than 30 weeks since my last post. It's been so long because back in March, PattyFab scared the crap out of me a few times with her posts, and more than one person decided it was easier to spit vinegar on me for \"having\" to read my overly long posts than it would've been to just - I don't know - ignore them.\n\nStill, my love for the brainpower existing here is irrepressible and I can no longer deny being drawn to how much there is to learn here. And indeed, during my absence I've been haunted by questions I'm hoping someone (smart) here will be charitable enough to answer for my own peace of mind. I promise, not only did I spend 30 minutes editing this for length, I also tried to reduce the yawn factor as well. That's how bad I need answers to these questions:\n\n1.) I've released like eight fonts since Feb. '08, with moderate but increasing success. Before finishing them, I reviewed each one in a variety of programs (for spacing/kerning, visual appeal, even-ness, etc.), and tinkered with numerous settings to compare the differences before eventually realizing each was as good as it would ever get. This to me usually ended up with the fonts being as technically-sound looking as anyone else's I've ever seen, though perhaps not as inventive or attractive. By this I mean, all my ascenders and descenders looked perfectly even regardless of the point size, were uniform in height and contrast, so on and so forth. But here's the thing:\n\nI have NEVER set the x-height of my lowercase \"f, t, u, v, w, x, y and zs\" 10-12 points lower than the rest of the lc letters. The extreme tops of my uppercase \"Os\" and \"Gs,\" et. al. are exactly the same as the \"A\" and \"E\" as well. In other words, I don't mess around with overshoots, etc., and generally don't follow many of the other seemingly set-in-stone rules of type design.\n\nYet, in every font I've created thus far - at least on my screen and in print - the letters all look great, surprisingly so at times. Which begs the questions: am I crazy? Is my monitor screen the visual equal of a self-cleaning oven? Am I color blind to that little bit of blackness in rounded letters that's supposed to peek above the top of my UC Es and Fs? Or is it possible that whole jack-up the top of the caps thing just a dumb rule people have been blindly following? I'm serious - in fact, according to the \"rules,\" the lower case \"t\" in the font Vectora apparently is supposed to look at malnourished and retarded as it does.\n\n2.) Can anyone explain the difference when the start point/blue node of a lower-case \"m\" set at the highest point on the far left of the character, versus the bottom-most right point? Supposedly for Type 1 fonts, the start point is best placed on the bottom right (or thereabouts). In my experience, however, the only apparent benefit of that is the broken sewer-pipe manner in which it screws up the kerning on the right side of the m. Even if my right sidebearing is set at 125 and the kerning between the m and an \"i, is set at plus-50 for example, the two letters lay on each other like siamese twins. I've seen no evidence of how the placement of this point has any other effect. HELP!\n\n3.) I spent more than a decade designing and redesigning newspapers all over the South, so I do have some advanced design experience. Unfortunately, though, I didn't and never will go to Reading, never attended one of those international type club events, and never had an example of one of my typefaces blown up to movie poster size so people could walk by and check it out. Nor do I see myself ever doing these things.\n\nI've also never had my 15-minutes of collaboration fame with the Zeuses of typography, and don't see that ever happening either. Not to mention, even if it did I'd be run off on the first day because even Zeus doesn't like having his brain constantly picked at 60-90 second intervals like a monodrone. Basically I've spent the last three years educating myself on the field, mostly by trial and error rather than consuming every Zeus-authored online font-tutorial.\n\nThat said, something continues to terrify me: do all those things mean I could never be a successful, respected tipografia disenador? Could there really be as much benefit in knowing Unicode numbers and names by heart as there is at being an expert on the concept of \"convert font hints to links?\" Because to me the former is child's play ... the latter, though, might as well be asking me the air-speed velocity of an African Swallow.\n\n4.) After a nearly psychotic amount of time experimenting and comparing, I was absolutely crushed to discover a horrible truth: in my eyes, when it comes to most if not all fonts, applying hints to the vertical stems not only fails to improve the typeface, it almost never fails to make it look like unmitigated crap. Then when I remove those verticals and only hint the horizontals, the font looks like a fluffy velour comforter I could bury myself in. It's just beautiful.  \nSure on occasion at an obscure point size, my lower case i or l might look a tad bulemic next to his siblings, but that evil is nothing compared to the alternative. I realize this all depends largely on perception, but lately I've been reading where hinting might be overrated, which has provided me a ray of hope. That still doesn't answer my main question: am I actually \"cheating\" because these hints are \"expected\" or considered a \"given?\" Or is there a chance my potentially poor perception is really my own little blessing in disguise? I just can't help it - at my desk, on my screen, through my eyes, a font without vertical hints might as well be Cameron Diaz, while a font with them looks like the girl from the Planter's commercial. I'm totally vexed by it: I always got the impression vertical hints were essential at the very least, but 100 percent of the time in my experience, they are a font's version of hepatitis.\n\n5.) If (relatively speaking) I have a true desire to be a respected, successful disenador, am I eventually going to have to force myself to seek and identify the beauty and/or appeal in Gill Sans? Because - like \"Garamond\" - that typeface immediately makes me want to vomit on sight. And I'm especially concerned because of how prevalent Gill Sans is around the world. I can't stand that lower-case \"a.\" I really dislike the x-height that's slightly higher than the top of a good comma. I mean, I really, really do not like it AT ALL. So why can I not shake the feeling I'm almost obliged to love it if I ever want to consider myself even marginally versed on the beauty of type?\n\nAnd finally ... 6.) My take on a long-disputed ... um ... dispute that seems to have no clear cut, ethically correct answer but here it is: Simply put, I do not rely solely on \"auto-kerning\" to kern a font. But, I also don't sit there and build 3,000 houses of cards one-by-one either.\n\nInstead, I do this: I determine the best kerning classes and save them in .txt, auto-kern the font, import the classes, expand them, and then proceed to start cleaning off those hundred or so I know are always troublesome (you know, the LT, AV, Fa, Vo, etc.). In my opinion, it would be ignorant of me to think a computer brain applying various algorhythms has no chance whatsoever of at least matching in quality what my eyes could produce, if only something like 25 percent of the time. In fact, I am convinced the most efficient and successful approach not only involves recognizing and knowing those \"trouble\" pairs, but also having extensive knowledge and awareness of how the particular auto-kerning engine affects the font itself. So no, I do not manually kern thousands of pairs in fonts I create ... am I going to hell now? Or is there some legitimacy to spending more time mastering the natural trouble spots and application of the auto-kern engine? Have my ethics been permanently disgraced?\n\nI would be SO grateful for anyone's views on one or all of these questions, because they really bother me big time.\n\nThanks.\n\n",
  "author": "Curioustype",
  "time": "4 Nov 2008 — 3:53pm",
  "uid": "15771",
  "comments": [
    {
      "time": "4 Nov 2008 — 6:27pm",
      "content": "1) You're not going to see the effect of overshoots on computer screens except at relatively large sizes. The \"blue zone\" hinting region flattens out the overshoots to zero at smaller sizes. So, yes, your fonts will probably look okay on-screen at smaller sizes. BUT, when they are used at larger sizes, and especially in print, the round and pointed letters are going to look slightly slightly smaller than they should. If you can't see the difference, you need to spend more time looking at type.\n\n2) As far as I know, it makes no difference (at least anymore) which point is the first. I could be wrong.\n\n3) A lot of people in the field are autodidacts. I'm sure Reading is wonderful and worth every pound (Euro?), but not everyone can or has gone or needs to go there (or someplace like it) to do well.\n\n4) ?\n\n5) A lot of people love it. If you don't, don't worry about it. _Chacun a son goût,_ as they say.\n\n6) If your modified auto-kern assisted method works for you, go for it. Personally, I have never trusted auto-kern. I would rather do it myself and know exactly what I'm getting, rather than spend my time cleaning up the mess the computer made, just for the \"benefit\" of being able to hit a magic button that \"does it all\" for me. Computer power is a big lever, but you've got to apply it to the right task.\n\n"
    },
    {
      "time": "4 Nov 2008 — 7:58pm",
      "content": "Thanks, Mark, for providing your insight. Already a few of your answers have brought me some relief. I should probably clarify a few things real quick because it appears I failed to be more succinct in my original post.\n\nI eventually did take time to learn everything I could about \"Blue Shift,\" \"Blue Fuzz,\" and overshoots, so I do have functional knowledge of the concepts. I also checked these settings in every single decent font I could get my hands on just to see how much variation there was between an array of fonts. I discovered that 99 percent of the time the Blue Shift setting was either 5 or 7, although in one instance it was set at 14. The Blue Fuzz was always 0, 1, or 2. So between that, educating myself on the subject and searching the web for any user-described experiences, I would feel confident going into any sort of exam.\n\nOne thing you said immediately raised the red flag of importance to me, however: what point size you'd identify as being a \"larger size.\" If you mean looking at my font on screen or in print at 250 pt. size, I haven't done that. But I also didn't go up to 20 and stop; while I couldn't enumerate the largest size of my reviews, I did with every font -several times - look at it in a size large enough to make me think only an idiot would use it at that size.\n\nAnother thing I can't figure out is this: why would someone essentially need to \"trick\" a computer to get a letter to look like it's the same height as its neighbors? From my especially uneducated point of view, overshooting the G, applying hints, zones and scales, etc., is like driving around the block to get across the street. To me, walking across the street means setting the blues all to zero and applying an exact vertical hint to a universal caps height. This all gets real swimmy though when you bring the lower case t, f, and u into the discussion. The whole idea/process just lacks a consistent foundation: lower the cross bar on ts and fs, the relevant parts of which are flat, but raise other letters because they're curved? Overshoot these four or five, reduce these other six, add three, carry the six, jump down, turn around, give the dog a bone? That sounds like a programmer's sick joke.\n\nI've tried to apply my own little compromises, though, such as raising at least one of the top two nodes in lowercase letters to the uniform x-height. Like the two inside nodes of the v, w, x, and y, along with the i and j ... stuff like that. Ultimately I guess I asked the question because my way - though visually it seemed great - just didn't seem right to me. Still, if you get a chance, find a pdf with \"Vectora\" in it and look at the lower case \"t\" in a word. I can't remember a single time I didn't think it was screwed up by this process. Unless Adrian Frutiger thought it would be cool to give his big strong font a puny little t.\n\n2. I was especially glad to hear your answer to this question. However, your answer only led me to another question: If the start point position really doesn't make a difference in the display or kerning of a character, why even bother having a start point or include a command that allows you to put it where you want it? And why is it supposed to be on one side for .ttf and the other side for Type 1? I think we should write a strongly worded letter to Mr. Startpoint himself and demand he explain himself. He and the above programmer are not very funny.\n\n3. Glad to hear this answer as well - to a question that originally landed on my head after reading an interview with Veronica Burian done by myfonts.com. She's created some impressive fonts without a doubt, some highly acclaimed. But when you look at her education and experiences, it's not unreasonable to wonder whether she has underachieved or has accomplishments and success a peon like me lacks the ability to comprehend, and that she doesn't even need to tout or promote. I guess I'll always wonder if a six-week internship with an Unger or a Brody is more valuable and necessary than natural ability and instincts, or just a glorified road sign. I guess it would probably be what one made of it.\n\nPersonally speaking, just being in the room with either of them would leave me star struck. For that matter, getting an answer from you to my post is a big deal to me. All of which equals me being at a point where I need to seriously start considering whether or not I have it in me to A.) reach anywhere near the level of playing field on which people like you and they operate and B.) if I do continue developing any natural talent I might have, would it ever be as respected as having the worldly experience of drawing small caps in the Egyptian desert or whatever Veronika did seven or eight years ago. I have no doubt about one thing: NO ONE, not even you - work longer or harder at it, or are more dedicated. Not because I'm a Robocop worker, but because I freaking love it all so much.\n\nAs for No. 4, maybe you could take a minute one day and conduct an experiment. Find your core file of Proxima, any weight, and output it fully hinted. Then go in a remove all the stem hints and just leave the vertical hints (I misstated myself earlier) that help establish x-height, etc. Then install and compare the two. Do you not think the one without stem hints is exponentially more attractive? Especially in Firefox or a word processor? I certainly do, and I'm afraid my preference is really disguising my total lack of ability to appreciate the look of a font.\n\n5. I'll never appreciate Gill Sans. I feel a bit like a black sheep. I just happen to prefer fonts with big gaudy x-heights and uniquely shaped characters. Like Vecora, for example, only ones that have an actual lowercase t and are (conservatively) more tricked out. Like Quadraat Headliner, for instance. That font is my Mona Lisa.\n\n6. I admire your stance. However I still think if one can understand the nuances inherent in an auto-kerning engine and compensate for them while setting up the parameters, it can have its benefits. One of which, if nothing else, is that it can at times make you more diligent in seeking out runaways or escapees and in the end be more thorough about it. I can't help but parallel this to the whole stick shift vs. automatic debate. Whatever the case, the bottom line is kerning sucks jumbo eggs right off the farm and there has to be SOME way to make it both effective and more efficient. I refuse to accept the notion that to have great kerning a designer is all but obliged to go through a process I rank just under bleeding profusely as an enjoyable pastime. My question, I guess, really was asking whether or not I'd still be considered \"lazy\" or not a \"purist\" if I ever did develop a way to consistently and nicely kern a font in half a day rather than several weeks. I guess it's like deciding whether to spend years mastering the tinker-toy one-by-one way of kerning or those same years developing a process that can produce the same results in a single afternoon.\n\n"
    },
    {
      "time": "4 Nov 2008 — 9:44pm",
      "content": "1) The overshoot thing predates digital fonts. It's a basic principal of visual perception. A circle that measures exactly the same as a square will _appear_ to be slightly smaller. It's an optical illusion that can be overcome by cheating, which is what overshoot is. However, the low resolution of computer screens is too course, making the cheat visible at smaller sizes, so it cuts off below a certain size (off the top of my head, I don't know what that size is, except that the exact amount varies among fonts). The \"blue\" values relate to this cut-off point, but check Adobe's documentation for more (and better) info. For what it's worth, blue values pertain to the way hinting affects overshoots, not overshoots per se. Even without hinting, you would still want to use overshoots.\n\n2) All paths must have a starting point. Drawing programs hide this information from you because it's irrelevant. In font editing programs, it's made explicit, but that's not because it's necessarily relevant, it's just the way it's always been done. Don't worry about it.\n\n3) The main thing is to get experience, whether it's on your own or under someone else's wing, it's all good.\n\n4) I work almost entirely on Macs and in Adobe apps. Hinting doesn't make much difference in OS X and not a lot of difference in Adobe apps. However, on Windows it's a different story. The Windows method of rendering fonts seems to depend much more heavily on hinting, with the (apparent) goal being that strokes should fall on the pixel grid as much as possible, with the fidelity of the letter forms (as being a recognizable design) taking a back seat. With Cleartype, this rigidity is relaxed on the x axis. I'm not going to argue about which is better for all users (and there are many who prefer the Windows approach), but I prefer the methods of Apple and Adobe in this regard. Also, if your primary audience is using your fonts for print projects, hinting is not that important.\n\n5) When I was a young designer, I hated typefaces with small x-heights. The taste for large x-heights comes and goes. You must have missed the 'Seventies. I'll take them any size, depending on my mood. I am not an x-height partisan. I relish the variety.\n\n6) The best way to kern a typeface is to start by spacing it correctly as best you can, without resorting to kerning. Then, analyze the problem areas and fix those with kerning. Auto-kerning will never do as well as your own eye and knowledge of your typeface design and how you want it to look. If you want the computer to help you with kerning, use class-based kerning. This way the computer can do all the repetitive stuff so you don't have to. That's what it's good at. There are short cuts and there are \"short cuts\". Auto-kerning is a \"short-cut\". It's a case of something that's too good to be true. Maybe okay for something quick and dirty, but not for something you want to be proud of.\n\n"
    },
    {
      "time": "4 Nov 2008 — 11:18pm",
      "content": "Thanks Mark for the very interesting and educational responses. I realize it may sound like I am attempting to complain or argue about various subjects, but the truth is I have a tendency to think in overly simplistic terms. I don't doubt the optical illusions created by various letterforms, nor am I dismissive of the need to compensate for them. I actually find it all quite interesting - especially when you talked about how overshoots predate digital typography.\n\nThat bit of information proceeded to REALLY kick in my tendency of over-simplification and distracting, compulsive curiousity. In my little black and white world, it would seem our current technological capabilities - specifically, to apply \"hints\" or what amounts to a visual direction to the character - would be advanced enough to compensate for or remove these illusions, instead of merely making the same old overshoot hoops easier to jump through. Before tackling that dilemma, however, I obviously need to figure out how to justify to myself the need to fix what my eyes have never failed to tell me isn't broken.\n\nTo show you what I mean, if you go to this link and type the words \"WONDER Betty\" in the sample text field, you'll see the same thing I've been seeing ... which is, even at 72 points, that the crossbars of my lowercase ts and tops of my upper-case letters all appear in sync. Or, if there are any actual or optical differences, they're negligible at worst - even when you look really hard for them. Granted that probably isn't the Shangri-La of type testing environments, but that's exactly how they look in all my personal programs.\n\nAs it stands, the top extreme points in all the lc letters are identical, just like the uppercase letters. What's especially driving me nuts here is knowing the protocol does include overshoots and that tens of thousands of designers before me - and before computers - obviously know and see something I don't. But I always seem to get stuck with the loony brain-teasers so I'll get past it.\n\nI especially like the \"don't worry about starting points\" advice, though. Obviously this lack of concern hasn't affected you in any discernable way. Let me be clear here - I'm not glad to hear this advice because it justifies my being lazy. I'm glad because not only do I trust and appreciate the wisdom of your advice, I also can be sure it's sound because it's clearly worked for you. And it's certainly not like it came from one of my font-ignorant buddies telling me to stop sweating it because he's sick of me yapping about it. So I'm relieved about that too.\n\nAs for the hints issue, I wish I had the depth of knowledge you possess that's apparent in your advice. I appreciate such thoughtful, intellectual assessments in general and not just about hinting. Which is why I'm almost ready to design fonts with my eyes closed from now on, because all the hinting knowledge in the world would ever convince me that a font with hinted stems looks like crap while those without 'em are much more attractive ... at least to me.\n\nThat bottom line makes it very difficult to first acknowledge the need to fully understand hinting and second to apply it in a manner those far more experienced than I consider necessary and routine. I am by no means afraid of learning everything I can about typography - in fact I crave it. I just can't imagine spending a year or so becoming a scholar on the intracacies of hinting when it only takes me a few seconds to invariably conclude that \"this hinted font sucks\" and \"the partially unhinted one looks pretty awesome.\"\n\nAs for my preferences, I'm sure they'll change with time. I'm counting on it. I just don't seem to be able to find the charm in most of the fonts everyone else considers gorgeous or classics.\n\nAnd kerning - again, your approach is respectable and unassailable. But, let me run this up the flagpole real quick - if I created an add-on or some other code or program that could kern an entire font to look just as great as you do manually, but did it in an hour and required average user input, would you really not utilize such a tool and instead choose to grind out the weeks-long process manually? I am of the opinion that the goal - and really the only important thing - is the quality of the results. If you seriously would bypass using such a tool, then your dedication to the spirit of typography demands commendation. Still, even though there are various auto-kern tools out there that aren't particularly effective, I have little doubt creating one that can match the quality of manual kerning is arguably within our possibilities. And I mean a tool that can perform and calculate functions no human being could ever dream of matching, quality-wise included. Do you think something like that is possible and just waiting to be developed? It certainly seems like one big giant hole in the overall fabric of designing digital type. If we can walk on the moon, certainly we can fill this gap and allow designers to concentrate more on the artistic end. In fact, though I haven't tried it and probably couldn't afford it, I've heard good things about what \"iKern\" can do. I guess certain traditions elude me because this possibility is something I find extremely exciting.\n\nThanks again for the brain food Mark. Believe me when I say I eat up that kind of insight and knowledge like my dog eats his supper. I think that's why I grew tired of newspapers and am in a perpetual love trance over all aspects of typography. It's neat to be 40 and introduced to a new passion. So I appreciate the time you spent helping to advance that.\n\n"
    },
    {
      "time": "4 Nov 2008 — 11:46pm",
      "content": "Uh, the link I forgot: [http://www.myfonts.com/fonts/c-miller/morning-sans/regular/](http://web.archive.org/web/20131014231907/http:/www.myfonts.com/fonts/c-miller/morning-sans/regular/ \"http://www.myfonts.com/fonts/c-miller/morning-sans/regular/\")\n\n"
    },
    {
      "time": "5 Nov 2008 — 7:38am",
      "content": "Morning Sans is quite nice and distinctive.\n\nA design like this wouldn't exhibit many overshoot issues because of things like the angled stroke endings and and other script-like features. There are hardly any horizontal strokes that rest on either the cap line, base line or x-height line. But, notice how the cap E appears to be slightly taller than the other caps. If you were to lower the height of the E about 12-15 units (assuming a 1000-unit em), the E would appear about the same height.\n\n14 units comes out almost exactly to 1 pixel at 72 pixels. So, 72 pixels is about the cut-off point for overshoot. At smaller pixel sizes, it would usually be suppressed, although with grayscale antialiasing on the y-axis you might still see some effect.\n\nThe light weight and open spacing also minimizes the effects of lack of overshoot. If the face were very bold and tightly spaced, the lack of overshoot would be more noticeable.\n\nBy the way, if you want to see a classic typeface without overshoots, take a look at this scan of Cheltenham Old Style in the original metal version:\n\n ![](http://web.archive.org/web/20131014231907im_/http:/typophile.com/files/cheltos001_6073.jpg)\n\nIn some cases, like the C, the letters are actually slightly shorter, but the F and G and the O and P are exactly the same height.\n\nRegarding your hinting troubles, in the case of Morning Sans, the slight slant would make hinting the vertical stems pointless. Hinting assumes that vertical stems are _vertical_, not more or less vertical. Stems that are angled slightly off the vertical or horizontal are problematic on low resolution devices such as a computer screen. Antialiasing is the best solution in such cases. If the font is forced into a coarse pixel grid, it will not look very good. (In high-res print it should be fine at any size.)\n\n"
    },
    {
      "time": "5 Nov 2008 — 9:49am",
      "content": "You should be a teacher Mark, if you're not already. Thanks for the additional information. You mentioned a few things that struck me which I'll address later today and hope it isn't throwing too much on you.\n\n"
    }
  ]
}
