{
  "id": "5129",
  "title": "Lettering Critique",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I am looking for some feedback on this lettering. I only have about 2 hours max to finish this.   \n   \nIt is for a rural farming community that needs to pass a bond issue to save some farming land. It will be used on a poster.   \n   \nThanks!   \n   \n ![corrales_lettering](http://web.archive.org/web/20131010202935im_/http:/www.typophile.com/forums/messages/29/37789.gif)\n\n",
  "author": "sean",
  "time": "8 Jun 2004 — 1:59pm",
  "uid": "596",
  "comments": [
    {
      "time": "8 Jun 2004 — 2:07pm",
      "content": "I like the style, the colors, and the balancing.   \n   \nI would make the bottom serif of the \"C\" totally straight (not leaning a bit forward), and make the tail of the first \"R\" longer. Plus maybe adjust for weight, if you have time: the larger the letter the more slimming it needs - or vice versa.   \n   \nAnd there's a bit of wobbliness in some outlines, like the inside bottom-right of the \"S\", the body-shadow relationship in the \"C\", etc.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jun 2004 — 2:26pm",
      "content": "Sean -- nice start ... just a few things ...   \nmight be more subjective than anything.   \n   \n\\* the C seems a tad too big/heavy   \n\\* the leaf on the tip of the S gets obscured   \nwhen you stroke it ... could it be bigger?   \n\\* actually, the O looks a little big, too.   \n   \nbj\n\n"
    },
    {
      "time": "8 Jun 2004 — 2:28pm",
      "content": "The shadow's distribution seems odd to me.   \nIt's too dark on the middle ('rrale'). Both beginning and ending letters need a little more shadowing (especially the 'C').   \nOverall, I think it looks nice, but I wonder if the flourish in 'S' isn't too detailed.\n\n"
    },
    {
      "time": "9 Jun 2004 — 9:55am",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>Thanks for the critique. I think all your comments are right on. I'll be making those changes. Extra sets of eyes are great!   \n   \n_And there's a bit of wobbliness in some outlines, like the inside bottom-right of the \"S\"_   \n   \n\"S\"s are so hard for me to draw! They take me forever and I never get them quite right. Any suggestions to help me work through this in general?   \n   \nThanks a bunch for the help!   \n   \nS.\\</font\\>\n\n"
    },
    {
      "time": "9 Jun 2004 — 10:52am",
      "content": "Looks great, almost like a magazine masthead.   \n   \nSomething that has helped me with drawing an S is (this may be really obvious) starting with facing bezier handles being the same length. Does that make sense? This makes for a smooth starting curve--then I noodle with the node positions and fine-tune the handle lengths.   \n   \nThis helped me, but someone more experienced may have better advice.   \n   \n-Addison\n\n"
    },
    {
      "time": "9 Jun 2004 — 12:41pm",
      "content": "\\> \"S\"s are so hard for me to draw! They take me forever and I never get them quite right.   \n   \nIn 1979, Don Knuth wrote an article in the Bulletin of the American Mathematical Society in which he described the computer typesetting system that he was in the process of developing:\n\n> * * *\n> **quote:**\n> \n> The most difficult symbol by far, at least for me, was the letter S; in fact I spent three days and nights without sleep, trying to make the S look right, before I got it. At one point I even felt it would be easier to rewrite all my books without using any S's! After the first day of discouraging trials, I showed the meager results I had to my wife, and she said \"Why don't you make it S-shaped?\".\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n"
    },
    {
      "time": "9 Jun 2004 — 12:49pm",
      "content": "Robin,   \n   \nThat is a great quote.   \n   \nI'll have to confess that the flourish on the \"S\" is a result of getting overly frustrated with how it was going. I thought I could just make it something other than an \"S\". Funny.   \n   \nS.\n\n"
    }
  ]
}
