{
  "id": "51298",
  "title": "Microsoft's Malayalam Typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Microsoft had released Language support for many Indian Languages with WindowsXP. Crude and badly designed, the Malayalam typeface Karthika is an eyesore. With badly formed shapes, incorrect spacing and incorrect conjunct formation, the typeface and language support really mocks the language. Obviosuly people who didn't know the language were involved and made a mess out of it. On top of it, the OpenType/ Unicode support given is faulty and gives more disservice to the language.\n\nSome improvement was expected over the years, but nothing has happened. Unfortunately for want of a choice, people are using it for blogs and sites as if this is the norm/ default. This is likely to corrupt typography in the language and general aethetics forever.\n\nAs a langauge lover and type designer in the language what can be done?\n\n ![](http://web.archive.org/web/20130820104818im_/http:/typophile.com/files/malayalam_3550.gif)\n\n",
  "author": "hashimpm",
  "time": "4 Nov 2008 — 8:39pm",
  "uid": "5355",
  "comments": [
    {
      "time": "4 Nov 2008 — 9:07pm",
      "content": "How does it compare to the Malayalam font Apple supplies with Mac OS or the open source alternatives?\n\n"
    },
    {
      "time": "4 Nov 2008 — 10:56pm",
      "content": "There is no other OS level implementation on any other platform.\n\n"
    },
    {
      "time": "5 Nov 2008 — 12:26am",
      "content": "Si, Mac OS does not support Malayalam, or at least is not bundled with any AAT Malayalam fonts (just Devanagari, Gurmukhi, Gujarati, Thai, Tibetan, and Tamil). I've come across some OpenSource Malayalam fonts, but I never installed any of them, so I can't say which ones are Unicode-encoded, and which aren't.\n\nHashim, which Malayalam fonts do you like better?\n\n"
    },
    {
      "time": "5 Nov 2008 — 3:49am",
      "content": "There are some nice print fonts designed by Linotype and Monotype.\n\nWhat we need in Malayalam is something like Verdana or Georgia (or even Helvetica and Times), tuned for the screen and looking neat too.\n\nThe made-for print fonts are too rounded to suit the purpose. Micrososft's Karthika could have looked and worked better had some linguists and designers who know the language were genuinely involved.\n\nBut I guess that is what happens in most Asian scripts!\n\n"
    },
    {
      "time": "5 Nov 2008 — 6:29am",
      "content": "Well Prof Joshi passed away a few years back so he can't answer for himself. Have you tried turning on ClearType?\n\nCan you suggest a better Monotype or Linotype font that Microsoft should consider licensing?\n\n"
    },
    {
      "time": "5 Nov 2008 — 8:36pm",
      "content": "I was Prof. Joshi's student and he passed away this February. He was been my source of inspiration too to get into language typography which hasn't kept apace with developments in technology. He was more into Devanagari typography, but I believe was also involved with Microsoft's Indian language efforts to some extent. But Indian scripts being many and so diverse one cannot expect one person to be an expert in all of them.\n\nTurning on ClearType will makes it slightly better, but exaggerates its bad shapes further. I believe for on screen-reading bitmap fonts work best with B&W pixels— Verdana nd Gorgia being the best models to emulate. The language technology part needs to be corrected first, with better and more acceptable conjunct formations and then the shapes which needs to be screen-friendly. merely replicating the print fonts for on-screen use is also hampering other Indian languages, to the best of my knowledge.\n\nLinotype Manorama designed by Fiona Ross is a good evolutionary model, though may not suitable for on-screen viewing. We need original designs which are hand-tuned for the screen.\n\n"
    },
    {
      "time": "5 Nov 2008 — 8:43pm",
      "content": "So Microsoft should not have consulted with Prof Joshi on this language and no existing font is suitable? We need new fonts and fixed shaping? Which type designer would you suggest Microsoft work with? And where are the shaping bugs are documented?\n\n"
    },
    {
      "time": "5 Nov 2008 — 9:30pm",
      "content": "No doubt. Prof. Joshi was the right person, but I wish linguists and type designers in the language were also consulted before designing the default typefaces in each language. I have heard similar complaints from other friends speaking different Indian languages.\n\nI can help with Malayalam if needed, having designed many typefaces in Malayalam ( [www.design-difference.com/typedes.htm](http://web.archive.org/web/20130820104818/http:/www.design-difference.com/typedes.htm \"www.design-difference.com/typedes.htm\")). But the Unicode/ OpenType problem also needs to be addressed simultaneously to make it acceptable to a larger audience.\n\nAs you know there are two versions of Malayalam rendering: the traditional one (as recommended by Rachana, a group that recommends close to 900 characters to bring the language back to its original glory) and the reformed one (INSCRIPT/ C-DAC Gist with about 150 characters) which is more popular other than those used by various publishing houses (Summit's Indica, Mathrubhumi'system etc.). Karthika doesnot even match upto the INSCRIPT standards, bringing down typography in the language a few notches down. Script reformation in the 60's was an ill-thought-out step to make typewriters handle Malayalam, but Windows implementation corrupts the language further.\n\n"
    },
    {
      "time": "5 Nov 2008 — 9:47pm",
      "content": "Great, but where specifically are the problems with the font and Windows shaping documented? Lots of people complain, but sadly few are willing or able to articulate things that can be done to improve problems. Maybe a pointer to a concise article, white paper, blog entry or wiki that explains this?\n\n\\>But the Unicode/ OpenType problem also needs to be addressed simultaneously to make it acceptable to a larger audience.\n\nSo Unicode is broken!? Well respectfully until you fix that issue any Unicode compliant solution (like Uniscribe and ICU) isn't going to support your scheme.\n\n"
    },
    {
      "time": "5 Nov 2008 — 9:49pm",
      "content": "PS the font is called Kartika.\n\n"
    },
    {
      "time": "5 Nov 2008 — 9:59pm",
      "content": "There is no such article, but I can compile some of the comments aired in our circles. The general public may be blind to it and may even be resigned to use it everywhere as there is no alternative. But typographers in the language have been lamenting about it ever since Karthika was released. I can give you a list of problems if you are interested in a few days time.\n\nIn the Open Source domain, you can come across frequent communication regarding the incomplete Unicode impementation. But I am no expert on that, but can connect you to experts, if you are interested.\n\nThanks for your genuine interest in the issue.\n\n"
    },
    {
      "time": "5 Nov 2008 — 10:03pm",
      "content": "Kartika for sure, but we Malayalis would have prefered Karthika which has a more Malayali sound.\n\nJust like someone preferring Elizabeth over Elizabet! You bet!\n\n"
    },
    {
      "time": "5 Nov 2008 — 10:08pm",
      "content": "Certainly if there are improvements that can be made under the current Unicode framework I'd love to hear about them. But fixing broken aspects of Unicode is a bit out of scope for my group. Please forward any specifics to me at simonda (at) microsoft.com\n\nCheers, Si\n\n"
    },
    {
      "time": "5 Nov 2008 — 10:13pm",
      "content": "I will do that in a few days.\n\n"
    },
    {
      "time": "6 Nov 2008 — 8:24am",
      "content": "The sole Malayalam font for OS X is this one:\n\n[http://www.xenotypetech.com/osxMalayalam.html](http://web.archive.org/web/20130820104818/http:/www.xenotypetech.com/osxMalayalam.html \"http://www.xenotypetech.com/osxMalayalam.html\")\n\n"
    },
    {
      "time": "6 Nov 2008 — 8:25pm",
      "content": "Xenotypech's Malayalam is slightly better, and is seemingly based on C-DAC's Karthika (not to be confused with Microsoft's Kartika), which again being made-for-print is rounded and curly. Microsoft's font was a step in the right direction, but could have been better visually with more even counters, standrad x-heights and more acceptable character forms.\n\nPrint-specific fonts may not work well on-screen. Otherwise we would still be using Caslon, Baskerville and Garamond instead of Verdana, Georgia and Trebuchet.\n\nWhat software is used to design a typeface like Verdana with hand-tuned bitmap screen-fonts?\n\n"
    },
    {
      "time": "6 Nov 2008 — 8:38pm",
      "content": "Matthew drew bitmaps using this tool...\n\n ![](http://web.archive.org/web/20130820104818im_/http:/typophile.com/files/0_5936.JPG)\n\n...and outlines in FOG. Tom used FogQ to create TrueType outlines...\n\n ![](http://web.archive.org/web/20130820104818im_/http:/typophile.com/files/Picture1_3584.gif)\n\n...and then used Visual TrueType to hint the outlines to match the bitmaps Matthew had drawn...\n\n ![](http://web.archive.org/web/20130820104818im_/http:/typophile.com/files/cap2_5200.JPG)\n\nNo one ever did it like this before, and few have since.\n\nCurrent OS's have abandoned bi-level rendering, so this approach isn't really relevant today. Which is a shame. Maybe it will make a come-back?\n\n"
    },
    {
      "time": "6 Nov 2008 — 10:40pm",
      "content": "Thanks Simon for those screen shots. I have read about the pain-staking effort behind Verdana which has deservedly become the de-facto screen font.\n\nI am willing to help anybody make Malayalam look better on screen, to save future generations from the sacrilege that is Kartika.\n\n"
    },
    {
      "time": "7 Nov 2008 — 4:38am",
      "content": "would it be possible to get a link url reference to the original article that was referenced at the beginning of the post?\n\n"
    },
    {
      "time": "7 Nov 2008 — 7:41am",
      "content": "\\>I am willing to help\n\nGreat. Please let us know when you have that shaping bug list ready. We're here and waiting.\n\n"
    },
    {
      "time": "7 Nov 2008 — 7:53pm",
      "content": "Sorry Mike, no article was referred to in my post. This is just a personal feedback as a Malayalam-speaking-writing person and a type designer in the language.\n\nSimon, the list is being compiled and will be sent to you shortly.\n\n"
    },
    {
      "time": "8 Nov 2008 — 4:57am",
      "content": "I think Mike wants to know what article (= site) your initial screenshot is taken from.\n\n-- K.\n\n"
    },
    {
      "time": "8 Nov 2008 — 10:53am",
      "content": "That would be Sify.com -- the Malayalam subpages are [there](http://web.archive.org/web/20130820104818/http:/sify.com/malayalam).\n\nAnd no, I don't read the language, but the name is right there, in the center of the image :-)\n\n"
    },
    {
      "time": "8 Nov 2008 — 12:04pm",
      "content": "Great detective work ;-) Here's a grab from Vista/IE7\n\n ![](http://web.archive.org/web/20130820104818im_/http:/typophile.com/files/IE7_6401.JPG)\n\nof [http://sify.com/malayalam/fullstory.php?id=14791888](http://web.archive.org/web/20130820104818/http:/sify.com/malayalam/fullstory.php?id=14791888 \"http://sify.com/malayalam/fullstory.php?id=14791888\")\n\nHTML suggests its using an EOT. Will, have to delve in.\n\n"
    },
    {
      "time": "8 Nov 2008 — 3:47pm",
      "content": "Re. Unicode and Malayalam, I can confirm that the current encoding has been subject to much debate and some revision over the past couple of years. Unfortunately, there is a lot of disagreement about the correct/better way to encode Malayalam. Si, Peter C can probably tell you more about the issues involved.\n\n"
    },
    {
      "time": "8 Nov 2008 — 7:57pm",
      "content": "Thanks John, I guessed as much. Kindly Hashim sent us a couple of PDFs that show some of the design issues with the font. These seem to be independent of the encoding issues. I've passed these on to Ali and Peter for review.\n\n"
    },
    {
      "time": "9 Nov 2008 — 7:33pm",
      "content": "Regarding Unicode encoding—to the best of my knowledge—the disagreement is regarding the conjunct formation. Whether there should be 150 or 900. Can't OpenType fonts use this choice differently in different fonts, so that the user has a choice between say Kartika (traditional script) and Kartika (reformed script)?\n\nAlso Simon, the tools that you have shown wrt Verdana are Mac-specific and may no longer be available. Is there is a modern day option to go the same way? Does FontLab + BitFonter on PC suffice or are there any proprietary software being used nowadays? I am keen to explore possibilities.\n\n"
    },
    {
      "time": "9 Nov 2008 — 9:18pm",
      "content": "\\>Can’t OpenType fonts use this choice differently\n\nI would assume if this were possible someone would have done it, however it seems unlikely.\n\n\\>Is there is a modern day option\n\nThe proces (draw bitmaps, then draw outlines, and then hint the outlines to match the bitmaps) does not make any sense today for Windows and Mac OS fonts as these OS's don't rasterize bi-level any more. Not sure what tools you might use to repeat this as an accademic excercize, mabybe bitfonter, FontLab and VTT.\n\n"
    },
    {
      "time": "12 Nov 2008 — 7:58pm",
      "content": "Hi Simon,\n\nAny progress on Kartika design issues?\n\n"
    },
    {
      "time": "12 Nov 2008 — 8:18pm",
      "content": "The wheels of progress move slowly, however the timing, with respect to our product cycle, could be worse.\n\n"
    },
    {
      "time": "12 Nov 2008 — 8:29pm",
      "content": "Thanks Simon.\n\nCan you meanwhile give us some insight into the process of design of your screen fonts other than Verdana: Georgia, Trebuchet and the new ones? Are there any sites or useful links?\n\n"
    },
    {
      "time": "12 Nov 2008 — 8:48pm",
      "content": "That might be best served in a new thread - although i think using a search engine to scan typophile for the following keywords might provide some good results - ClearType Collection, ClearType Hinting, Calibri, Designing for ClearType etc.,\n\n"
    },
    {
      "time": "12 Nov 2008 — 8:50pm",
      "content": "Thanks.\n\n"
    }
  ]
}
