{
  "id": "51347",
  "title": "Critique: Possible New Self-Branding",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m rebranding myself really soon, and my company name will potentially be called ’Flo’ (variation of Flow).\n\nI already got some great feedback, but I was looking for some professional design comments.\n\n————-\n\nMy main questions are:\n\n1- Is this legible? Does it really need to be once the potential client already knows my company name?  \n2- Since the word is so short (how I like it) and with the font, can it potentially be mistaken for Arabic writing or a symbol?  \n3- I think the beauty is in the simplicity, I guess it would just be a matter of how I’d apply it.\n\nI’m loving it at the moment, but of course, I’m trying not to until I get good feedback and reassurance from a new set of eyes! :)\n\n(forgive the size, I’m using FLONT on Veer)\n\nThanks in advance!\n\n ![](http://web.archive.org/web/20081210105525im_/http:/typophile.com/files/flo_4107.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [flix.jpg](http://web.archive.org/web/20081210105525/http:/typophile.com/files/flix.jpg) | 5.39 KB |\n| [cards.jpg](http://web.archive.org/web/20081210105525/http:/typophile.com/files/cards.jpg) | 42.92 KB |\n\n [‹ Kerning help](http://web.archive.org/web/20081210105525/http:/typophile.com/node/51825 \"Go to previous forum topic\") [Personal logo design ›](http://web.archive.org/web/20081210105525/http:/typophile.com/node/50835 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081210105525/http://typophile.com/user/8209\" title=\"View user profile.\">DaveG</a>",
  "time": "<br>",
  "uid": "8209",
  "comments": [
    {
      "time": " 5.Nov.2008 10.34pm",
      "content": "I love it.\n\n1. Yes, I got it immediately.  \n2. Nope. I read “flo.”  \n3. Simplicity is clarity :)\n\nThe only time someone might not be able to read it, is if they see Uo instead, but if they know what a cursive f looks like, then it shouldn’t be an issue.\n\n"
    },
    {
      "time": " 5.Nov.2008 10.36pm",
      "content": "I recommend you just go with the Flo!\n\nMikey :-)\n\n"
    },
    {
      "time": " 5.Nov.2008 10.47pm",
      "content": "You don’t know how good this makes me feel. I’ve been struggling for so long to get something with some substance and it just hit me. Lets see if I can get this new brand up and running for the new year.\n\nThanks guys!\n\n"
    },
    {
      "time": " 5.Nov.2008 11.15pm",
      "content": "i love it. read ’flo’ immediately and it looks great\n\n"
    },
    {
      "time": " 5.Nov.2008 11.17pm",
      "content": "I hope it’s not too late to add more feedback. For what it’s worth.\n\nSimplicity is always potentially good, and it isn’t hard to understand why it appeals to you so much. You’re doing more than hedging for a simple logo / identity; you’re trying to make a virtue out of applied simplicity.\n\nRyte. Got it. This is good.\n\nMy gut reaction is that what you’ve turned out is a little too simple for some people and may pass over their heads without registering any kind of effect or reaction. I like it, and I love the cyan and white color scheme (very contemporary colors), but if I were doing it I would try another hue with hyer impact value. Like magenta, for example. Or orange (not burnt orange but a yellow-orange), or maybe even indigo. The cyan color is a bit passive and kind-of not really biting my cerebellum hard enuff to make me want to know more about what’s behind the logo.\n\nAlso try: using a capital **F** (if available) for two reasons. 1) To increase the readability / legibility; 2) To make the logo graphically stronger. With a capital **F** you’d have less reason to change the color and maybe retain the cyan after all.\n\nIdeally you could try designing a capital **F** from the lower case one you’re already trialing. That way you’d retain the lovely loop tail and still have a capital **F**.\n\nj a m e s\n\n"
    },
    {
      "time": " 6.Nov.2008 12.06am",
      "content": "Just a comment, my good friend’s mom is named Flo, as in Florence, and when I see it, I think of a middle-aged woman.\n\n"
    },
    {
      "time": " 6.Nov.2008 6.01am",
      "content": "Thanks for the feedback!\n\n1- I agree with the colors - I was thinking an orange as well. I was thinking of retaining my current colors which were cyan. I am going to explore the colors much more until I find something I’m happy with.\n\n2- The capital for this typeface changes the look dramatically. I would probably explore, like you said, adding some elements to make this a nice capital. Do you think it would just be a matter of adding 2 horizontal strokes on the ascender?\n\n———\n\nAlso I wanted to know about the FLO thing. Do people think of a woman’s name as welll?\n\n"
    },
    {
      "time": " 6.Nov.2008 7.02am",
      "content": "I added a new sample - I tried the work FLIX rather than FLO (I agree it might sound like my mom’s friend). I’m just thinking that FLIX sounds a bit too much like “I’m trying to be cool”.\n\nOf course, I would change the ligature between the ’i’ and the ’x’, this is just for viewing purposes.\n\nI agree, it looks really nice in orange.\n\nLet me know what you think.\n\n"
    },
    {
      "time": " 6.Nov.2008 7.16am",
      "content": "I think you could pull off ’Flo’, it was just the treatment, the hand-written that added a personal touch.\n\nIf I were to see it in context of say, a surboard, I would obviously instantly think of ’flow’ the word, and not a middle aged woman. So it all depends on context as well!\n\nIt can be handled, I just wanted to point it out so you were thinking about it.....\n\n"
    },
    {
      "time": " 6.Nov.2008 7.32am",
      "content": "Definitely stick with flo. I love this mark - it’s _extremely_ legible, and generally lovely to look at. The white on cyan looks really good, but you could really put it on just about any coloured (or textured) background and it would still look just as good. On the other hand, I really think _flix_ loses a lot of the charm - the name isn’t as strong, and the mark loses the wonderfully concise, compact feeling of the original. Stick with _flo_!\n\nGreat work!\n\n[[semibad](http://web.archive.org/web/20081210105525/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": " 6.Nov.2008 8.45am",
      "content": "I’m thinking FLO COMMUNICATIONS might sound more corporate — FLO DESIGN is a bit more personal, therefore maybe sounding more like a name.\n\nHowever, I really appreciate the feedback guys. Keep it coming!\n\n"
    },
    {
      "time": " 6.Nov.2008 12.19pm",
      "content": "about your name, let it be taken literally. I om obviously not experienced in this so my insight is just an average joe, please treat it that way and just consider it for what it is.\n\nDo you communicate Flo’s? Do you design Flo’s? A sign maker makes signs. A flo designer designs what?\n\nI think Flo by itself, if it were properly thought out and designed has the potential to stand on it’s own, but what are you?\n\nAre you a self-branded designer, are you a studio with more than one designer? Graphic Design? Type design? Web Design?\n\nI unfortunately don’t have the pleasure of knowing you yet, so it’s not apparent to me what it is you do, but if you are going to support the word ’Flo’ with another word instead of an _activity phrase_, please make it something so straightforward and simple even I would understand it.\n\nI’ll use a generic word of a company that may or may not exist, and you tell me which reveals more about who they are (just from the name or phrase)\n\nApex Gear. or Apex. Mountain climbing equipment.\n\nIntuishun Communications. or Intuishun. web development.\n\nI think the latter are FAR more descriptive, and the ’tagline’ should be a simple concise description of what it is you do, but don’t try to work it into your logo, your mark is very stable and self-contained.\n\nI just ask that you think about it and consider the alternatives and see which works best, that’s all.\n\nThis has a lot of potential, I’d love to see where it keeps going!\n\n"
    },
    {
      "time": " 6.Nov.2008 12.50pm",
      "content": "I think Flo really DOES have potential on its own.\n\nI graduated as graphic designer - I now freelance providing Graphic Design, Web Design and I offer printing (with or without design services). I also offer web development, photography, copywriting services...I don’t limit services. Trying to brand myself as a one-stop shop for all marketing and communication requirements.\n\nUp until now I have been ’Davide Giliati Design’ which I find is too singular.\n\nI’ve attached a potential business card design on original post - see what you think when applied.\n\n"
    },
    {
      "time": " 6.Nov.2008 5.01pm",
      "content": "Handpicked\n\n"
    },
    {
      "time": " 6.Nov.2008 5.35pm",
      "content": "Anyone know what ’Handpicked’ means? I hope its a good thing :P\n\n"
    },
    {
      "time": " 6.Nov.2008 5.42pm",
      "content": "It means this thread is in the handpicked column on the home page. [http://typophile.com/](http://web.archive.org/web/20081210105525/http:/typophile.com/ \"http://typophile.com/\")\n\n"
    },
    {
      "time": " 6.Nov.2008 5.51pm",
      "content": "Oh great! hopefully more feedback! :)\n\n"
    },
    {
      "time": " 7.Nov.2008 3.07am",
      "content": "I, being Greek, read “μο” and “μix” (which sound like mo and mix in English).  \nHowever the design is really good.\n\nGeorge Triantafyllakos - backpacker.gr\n\n"
    },
    {
      "time": " 7.Nov.2008 4.22am",
      "content": "I feel it needs a little something to make the f more obvious, partly because I like doing similar looped f’s in my brush lettering but with a crossing-over of the stem. Just a little bump on the left would be all it needs. Perhaps make the f not quite as tall as the l.\n\nWhich font at Veer is this based on?\n\n"
    },
    {
      "time": " 7.Nov.2008 6.44am",
      "content": "Looks like Cocktail Shaker to me ...\n\nI think this looks great, simple, strong and effective. I’m still not sure about the taglines, though.\n\n"
    },
    {
      "time": " 7.Nov.2008 10.40am",
      "content": "I would consider making it a cap F as I think was menitioned. To do this, consider dropping the top of the f and adding a horizontal swash that crosses the l and comes to a nice swoop over the o. I think it will lend balance to the design too.\n\nThought #1: \\*designflo\\* to me sounds more interesting than \\*flodesign\\*  \nIt also gives me more flow connotation, than flo the waitress.\n\nThought #2: A tag line should do more than explain what your company does, it should give your company a voice. “Flo - Graphics, web & printing” is like saying: “MacDonalds - Burgers, Fries & Coke.” I am helping a client with this notion right now, so it was on my mind. Give yourself personality.\n\nThought #3: Design or Graphic Design sounds like a profession. Graphics or Graphic Artist, sound like you work at a strip mall sign shop. Without “design” you are little more than a color jocky.\n\nThought #4: Careful with the cyan + brushscript + round font = this exact moment in design time. The best part of this is the logo.\n\nHave fun! - R\n\n"
    },
    {
      "time": " 7.Nov.2008 12.13pm",
      "content": "Without being greek like gtrianta, I immediately read µo as well – probably the suggestion to capitalise Flo or just customise the upper ending with some kind of ball could help prevent that…\n\n"
    },
    {
      "time": " 7.Nov.2008 3.14pm",
      "content": "Although “flo” (especially in the modern script font) does remind me a little of a middle-aged waitress, I still like it. It gives you personality. For adding further clarity, I like the suggestion of “designflo”—very slick sounding. Otherwise, I would suggest “DESIGN” in a light, all-caps, sans-serif font placed beneath “flo.” As for color, I happen to like the blue, but I would suggest something closer to cerulean for a little punch (and maybe a subtle gradient).\n\nLooking good, though. Best of luck.\n\n"
    },
    {
      "time": " 7.Nov.2008 5.49pm",
      "content": "i like flo. you do not need flo designs studios corporation llc inc. etc.\n\nalthough i did think flow as in that special time of the month... but i wouldn’t worry about it. Your whole brand image including how you use the logo will determine your identity and the way people are influenced by your name.\n\n"
    },
    {
      "time": " 8.Nov.2008 10.06am",
      "content": "It may not even need to be cap F, just needs more of a loop at the top I think, to distinguish from an l.\n\n[zerotwonine](http://web.archive.org/web/20081210105525/http:/www.zerotwonine.co.uk/)\n\n"
    },
    {
      "time": " 9.Nov.2008 11.29am",
      "content": "I like the flo more than flix. The x doesn’t really look as script, the i-x connection is not really elegant. May be the loop at the top will be more useful than the capital. Now, if you don’t know the name, it is not too clear.\n\n"
    },
    {
      "time": " 9.Nov.2008 3.47pm",
      "content": "I love flo. It is superb. I would personally vote for the lower case f. It works for me.\n\nSharon\n\n"
    },
    {
      "time": " 17.Nov.2008 5.30pm",
      "content": "1- Is this legible? Does it really need to be once the potential client already knows my company name?\n\nYes, I caught onto it right away.\n\n2- Since the word is so short (how I like it) and with the font, can it potentially be mistaken for Arabic writing or a symbol?\n\nI don’t think so. It is a easy read IMO.\n\n3- I think the beauty is in the simplicity, I guess it would just be a matter of how I’d apply it.\n\n100%\n\nI am quite fond of the ’flo’ logo - Great Job.  \nYou were right to go with Cyan - Orange would remind me too much of Veer’s mark.\n\nI think you could play around with your bcard however.  \nThe text “Flow Design & Communication - Graphics, Web & Printing.” extends from the first column to the second. Maybe give them more space or move them completely? I’m not sure.\n\nGood Luck!\n\n"
    },
    {
      "time": " 18.Nov.2008 10.25am",
      "content": "^Agreed about Veer... that was my first thought when I saw the mark, even in blue.\n\n"
    }
  ]
}
