{
  "id": "51356",
  "title": "Critique: Opinions please on this brochure design!",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "Hi fellow typites,  \ncould I get some advice on this brochure design please?  \nThe brochure is called a thousand words. The idea is that it stresses the importance of words, following from the saying that a picture is worth a thousand words. The opening spread says 'some words are worth a thousand pictures'. We have chosen an illustrative style made up of text which I am quite happy with. I am just still wandering how to treat the type on the opposite page. At the moment it is just white out and quite structured which is in contrast to the more chaotic illustration style. Does it need more creativity? is it too clean? does the colour take the emphasis from the illustrations?\n\nany feedback much appreciated!\n\n ![](http://web.archive.org/web/20130516063811im_/http:/typophile.com/files/1_5867.jpg)\n  \n\n ![](http://web.archive.org/web/20130516063811im_/http:/typophile.com/files/2_5379.jpg)\n  \n\n ![](http://web.archive.org/web/20130516063811im_/http:/typophile.com/files/3_3771.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [thousand words25.jpg](http://web.archive.org/web/20130516063811/http:/typophile.com/files/thousand%20words25.jpg) | 135.09 KB |\n\n",
  "author": "chasteauneuf",
  "time": "6 Nov 2008 — 3:02am",
  "uid": "29870",
  "comments": [
    {
      "time": "6 Nov 2008 — 5:10am",
      "content": "I think it is a very good work, congratulations!\n\nThe last illustration, though is a bit too much, I mean there is too much stuff. The other two are cleaner, and look much better!\n\n"
    },
    {
      "time": "6 Nov 2008 — 5:13am",
      "content": "I like it overall, especially the illustrations, which are really great. I'm not crazy about the typeface for the headline. The color block doesn't bother me, it is a good contrast to the illustration. but the choice of font, and typesetting in the block of color needs work to me. Great direction though.\n\n"
    },
    {
      "time": "6 Nov 2008 — 6:04am",
      "content": "There's a typo on 'public' (pulic) but I guess you would have caught that one! I'd agree with Chris - not loving the main headlines. Could maybe do with the leading turning up a couple of notches, and the type seems quite 'spindly' at the current weight. Excellent illustrations, and I think they really suit the layout. I do agree with Pilar that the third is not quite up to the same standard as the other two - it seems much 'blurrier' and less distinct.\n\nOverall though, great work - this is definitely well into the tweaking stages!\n\n[[semibad](http://web.archive.org/web/20130516063811/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": "6 Nov 2008 — 7:28am",
      "content": "cheers guys, thanks for the comments.  \nso what doesnt work about the headlines? Its kind of our corporate font so it is limited what can be done, perhaps smaller and increased leading?\n\nthanks so much guys, this is really helpful. Hopefully havnt issed you on this thread to get your thoughts on the revised.  \nRog\n\nincreased leading\n\n ![](http://web.archive.org/web/20130516063811im_/http:/typophile.com/files/4_4375.jpg)\n\nsmaller\n\n ![](http://web.archive.org/web/20130516063811im_/http:/typophile.com/files/5_4362.jpg)\n\n"
    },
    {
      "time": "6 Nov 2008 — 7:29am",
      "content": "thanks for the typo spot by the way - has to go through proof readers yet!!!  \n:-)\n\n"
    },
    {
      "time": "6 Nov 2008 — 7:30am",
      "content": "This stuff looks great.\n\nAgreed opinion on the headlines.\n\n\"Pulic\" is better than the more common misspelling of \"public,\" which is often mistyped as \"pubic.\" \"Pubic relations\" are also not always tangible either, so maybe that could work out in your headline as well.\n\nA quick run of spell check is always a recommended and easy step before showing a draft! (Although it would never catch \"Pubic Relations\" as a typo!)\n\n: )\n\n"
    },
    {
      "time": "6 Nov 2008 — 9:25am",
      "content": "I definitely prefer the larger version - the small headline looks a bit lost though. I think the text block was better being closer to the headline too, as in the original. To be honest, I think the spacing problems with the original headlines were least noticable in the spread that you've amended - it's the 'Public Relations' spread which really suffered due to the repeated capitals being so close together.\n\nHope this helps!\n\n[[semibad](http://web.archive.org/web/20130516063811/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": "6 Nov 2008 — 10:06am",
      "content": "OK cool, I think I shall try and increase the leading slightly and just be more careful in the clashing caps. Cheers for the feedback. Its amazing what you miss when you have been staring at it all day!\n\nI think your right about the other image not working as well. I think it could work, just needs work. Maybe slightly more minimal? Also, its less chaotic and random than the others. Almost less expressive.\n\n"
    },
    {
      "time": "6 Nov 2008 — 2:01pm",
      "content": "Great work here.\n\nDoes anyone else think that Presentation should be kerned a little looser? Are the t and a touching?\n\n"
    },
    {
      "time": "6 Nov 2008 — 3:35pm",
      "content": "I think in the third illustration of the man the mid-tones are not as defined and the photographic quality that gives these illustrations their (beautiful) zing is lost. The shaded side of the face merges into the hair, which merges into the neck shadow; the transition from the lips to the neck gets lost in the highlight of the shoulder (?); both of these areas overpower and confuse the rest of the illustration. Actually, I think the problem is that there is too much--the other two are mostly the face, with the positions of the rest of their body implied in an energetic and expressive manner, whereas the third one's shoulders, hands and neck are all there and the facial expression becomes secondary. The other two really have the beautiful drawn, penciled quality.\n\n...sorry, that had nothing to do with the typography.. but hope it helps still.\n\n"
    },
    {
      "time": "7 Nov 2008 — 1:46am",
      "content": "LisaO, I agree, it needs a little more work and I think your right about the intricate detail. More is less I think in this instance. Some of the first illustrations were just too chaotic and needed to be simplified a bit and this is the case here as well probably. Much appreciated.\n\nfi, see what you mean. I guess I wanted really large type, and have thus tried to squidge some words in to fit the grid. It would be a far better solution to reduce the size. Thanks for the feedback.\n\n"
    },
    {
      "time": "7 Nov 2008 — 12:49pm",
      "content": "\"fi, see what you mean. I guess I wanted really large type, and have thus tried to squidge some words in to fit the grid. It would be a far better solution to reduce the size. Thanks for the feedback.\"\n\nNo problem, thanks for sharing.\n\nWhat is the grid that you used? I'm curious about others methods of composition. Do you start with a grid and work inward?\n\n"
    },
    {
      "time": "10 Nov 2008 — 2:40am",
      "content": "Hi Fi,  \nwhat do you mean work inward?\n\nI always start with a grid to be honest - I think in this case it is a 4 column and then the type set into 2. I always try and start with a grid and work the type that way, and then change it if the type works better in another grid formation. The illustrations actually were done before I typeset the brochure so they dont follow the grid too much. Have tried to overlap them bit as I thought otherwise it looked too seperate. I always use a baseline grid as well although I suppose in this layout because of the small amount of text it is not needed as much. But this always related a bit to the heading size and leading. That what you mean at all?\n\n"
    },
    {
      "time": "12 Nov 2008 — 4:11am",
      "content": "I like the last one.\n\nThe heading is less 'in your face'. It is more in balance.\n\nBut why not try to have a right flush instead of a left one for the heading?\n\nJust an idea.\n\n"
    },
    {
      "time": "20 Nov 2008 — 1:22pm",
      "content": "\"I always start with a grid to be honest - I think in this case it is a 4 column and then the type set into 2. I always try and start with a grid and work the type that way, and then change it if the type works better in another grid formation. The illustrations actually were done before I typeset the brochure so they dont follow the grid too much. Have tried to overlap them bit as I thought otherwise it looked too seperate. I always use a baseline grid as well although I suppose in this layout because of the small amount of text it is not needed as much. But this always related a bit to the heading size and leading. That what you mean at all?\"\n\nI guess I just mean, how do you decide on the grid at the outset? Deciding on the grid seems like an outer constraint (a general underlying structure). The \"inside\" for me is the specific location on the page of various elements. I sometimes feel like I'm just \"pushing boxes\" as they say.\n\nDo your grids depend mostly on the page proportion?\n\nI'm curious as to how other people get started.\n\n"
    }
  ]
}
