{
  "id": "51375",
  "title": "Neutra Text",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am looking for either a postscript version of Neutra text or a suggestion of a font that would be similar? Can anyone help?\n\n[http://www.houseind.com/index.php?page=showfont&id=18&subpage=viewfonts](http://web.archive.org/web/20140307105031/http:/www.houseind.com/index.php?page=showfont&id=18&subpage=viewfonts \"http://www.houseind.com/index.php?page=showfont&id=18&subpage=viewfonts\")\n\n",
  "author": "pbusell",
  "time": "6 Nov 2008 — 12:55pm",
  "uid": "39353",
  "comments": [
    {
      "time": "6 Nov 2008 — 1:34pm",
      "content": "Are you saying you don't want/can't use the Opentype version?\n\n"
    },
    {
      "time": "7 Nov 2008 — 6:32am",
      "content": "Phyllis:\n\nWhile we ship all of our fonts in OpenType, we do have Postscript and Truetype versions available on request and for no extra charge.\n\nBen Kiel  \nHouse Industries\n\n"
    },
    {
      "time": "11 Nov 2008 — 6:19pm",
      "content": "Thanks, Ben, I will let my client know this. We designed a whole publication using the open type version and were unable to make PDFs suitable for our printer with it. Some problem with their system, I guess, but it was a problem nonetheless\n\nPhyllis\n\n"
    },
    {
      "time": "12 Nov 2008 — 4:39am",
      "content": "Phyllis:\n\nIf you, or your printer, is using QuarkXPress 6.5 or before, you will have a lot of problems generating PDFs with OpenType fonts. Please do contact us and we'll get you the Postscript version.\n\nBen Kiel  \nHouse Industries\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:30pm",
      "content": "Back in the day, and assuming you are using something older than Quark 6, I had to make my PDFs by saving the files as .PS and running them through Distiller to get them to work properly.\n\n"
    },
    {
      "time": "12 Nov 2008 — 2:58pm",
      "content": "With Quark 6 I find it easier to use the Print dialogue box to make PDFs rather than \"export to pdf\" but I think my Quark is wonky.\n\n"
    }
  ]
}
