{
  "id": "51379",
  "title": "Playboy sans cover titles",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20150225214400im_/http:/typophile.com/files/6a00d83451d48a69e200e54f6f58ac8833-800wi_4022.jpg)\n\nWhat is the font used here? Not the Playboy logo of course. Thank you.\n\n",
  "author": "JAGUART",
  "time": "6 Nov 2008 — 1:54pm",
  "uid": "39310",
  "comments": [
    {
      "time": "6 Nov 2008 — 2:49pm",
      "content": "Wait ... there's type on this page?\n\n"
    },
    {
      "time": "6 Nov 2008 — 3:06pm",
      "content": "I am going to cry. Can we please pretend there's only type there? I need this for a class project.\n\n"
    },
    {
      "time": "6 Nov 2008 — 3:28pm",
      "content": "I can't place it right away but someone here will certainly know. I'm definitely curious now so I'll go check it out. For some reason, my usually undependable memory tells me Font Bureau is/was responsible for some Playboy fonts. I'll go turn over some rocks now as a matter of fact.\n\nAt this very moment, however, all I can tell you for sure is I definitely went to all the wrong schools.\n\n"
    },
    {
      "time": "6 Nov 2008 — 3:30pm",
      "content": "Curioustype\\>\n\nThank you so much!\n\n"
    },
    {
      "time": "7 Nov 2008 — 1:09am",
      "content": "I thought it might be [ITC Bailey](http://web.archive.org/web/20150225214400/http:/www.fontshop.com/fonts/downloads/itc/itc_bailey_sans_std_virtual/?sample_text=WALTER%20MOSLEY&sample_size=48), but it's only a close alternative, not a match. And I must say I find it very difficult to concentrate on the type. :^/\n\n"
    },
    {
      "time": "7 Nov 2008 — 4:02am",
      "content": "Thank you very much! Using Photoshop's character panel, and can get it pretty close now. Good eye.\n\n"
    },
    {
      "time": "7 Nov 2008 — 8:19am",
      "content": "Target, by Tomi Haaparanta:  \n [http://www.identifont.com/show?AYE](http://web.archive.org/web/20150225214400/http:/www.identifont.com/show?AYE \"http://www.identifont.com/show?AYE\")\n\nThe advantage of growing up in the 1990s, in full \"digital explosion\"… :=)\n\n"
    },
    {
      "time": "7 Nov 2008 — 9:30am",
      "content": "There you go Jeremiah. Not sure if I ever would've found that one, and I did do a pretty decent-sized search. My own personal explosion only took place three or four years ago, which limits my abilities of type identification. However as you can see, this forum is over-flowing with knowledge, especially on the subject of identification.\n\n"
    },
    {
      "time": "7 Nov 2008 — 10:13am",
      "content": "Well, Christopher, I think each one here is more focused on certain aspects, or periods.  \nPersonally, I'd be a disaster in identifying non-digital type, especially designs which have not been international or which are not part of my heritage (i.e. Italian types).  \nBut as long as it cames to the worldwide \"post-modern\" wave in digital design (the one which preceeded the new generation of younger, more conscious and learned type designers), I was fixed on those Latin letters transmutations almost continuously up to, more or less, seven years ago.  \nBut although I can tell the names of even the most obscure faces from CalArts students, or used by David Carson, I'd have serious problems in identifying many faces of the more recent years…\n\nJeremiah? At least allow me some Isaiah… :=)\n\n"
    }
  ]
}
