{
  "id": "51414",
  "title": "Otis Saves",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Anyone know what this snappy brush lettering is on this logo?\n\n ![](http://web.archive.org/web/20120515173840im_/http:/typophile.com/files/otissaves_6360.jpg)\n\n",
  "author": "Chris Keegan",
  "time": "7 Nov 2008 — 9:47am",
  "uid": "1115",
  "comments": [
    {
      "time": "7 Nov 2008 — 9:54am",
      "content": "I'm hoping this may be a typeface and not actually lettering.\n\n"
    },
    {
      "time": "7 Nov 2008 — 11:46am",
      "content": "Lettering, possibly done by Don Grimes? or the other guy from Texas but I cannot for the life of me remember his name. Sorry\n\nMichael\n\n"
    },
    {
      "time": "7 Nov 2008 — 11:53am",
      "content": "Thanks Michael. Some of those letterforms look so familiar to me, I thought this might have been based on a typeface.\n\n"
    },
    {
      "time": "7 Nov 2008 — 12:49pm",
      "content": "\"might have been based on a typeface.\"\n\nIt probably is the reverse Chris. You know us lettering artists, we use a style for quite a while and then convert it to digital so we can enjoy the royalties and move onto something else. It keeps us fresh and honest.\n\nAll the best and have a great weekend.\n\nMichael\n\n"
    },
    {
      "time": "7 Nov 2008 — 12:58pm",
      "content": "If I find a digital version of something like this it would be an instant purchase. Thanks again.\n\n"
    },
    {
      "time": "7 Nov 2008 — 1:14pm",
      "content": "I would be very surprised if this is isn't hand made lettering. Actually the logo works with three different typefaces.\n\n"
    },
    {
      "time": "8 Nov 2008 — 1:09pm",
      "content": "the 'Otis' portion of the logo is custom, made by the guys at Decoder.\n\n[http://www.thedecoderring.com/](http://web.archive.org/web/20120515173840/http:/www.thedecoderring.com/ \"http://www.thedecoderring.com/\")\n\nPrimary logo and secondary icon for Otis Saves, a boutique bowling alley and live music venue currently under development in downtown Austin, Tx.\n\n"
    },
    {
      "time": "8 Nov 2008 — 5:51pm",
      "content": "Thanks Brian for laying that one to rest. I was going to call a couple of peers in Texas just out of curiosity, so you saved me a couple of nickels!\n\nMichael\n\n"
    },
    {
      "time": "9 Nov 2008 — 8:28pm",
      "content": "Thanks! They did a great job with it. Reminds me of the House stuff...\n\n"
    },
    {
      "time": "11 Nov 2008 — 8:44pm",
      "content": "no problem Chris and Michael. :)\n\n"
    }
  ]
}
