{
  "id": "51421",
  "title": "Univers and Helvetica X's",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hey everyone\n\nwas just working on my dissertation and im doing a type analysis of helvetica and univers and i worked my way through various letter to x where i found some strange going ons i wanted to see how the stroked lined up cause univers looked offset, so i dropped them into illustrator, expanded them, chopped them and extended the lines and this is what i found:\n\n[http://i49.photobucket.com/albums/f291/crazyreaper/Helvetica-to-Univer-C...](http://web.archive.org/web/20131019190637/http:/i49.photobucket.com/albums/f291/crazyreaper/Helvetica-to-Univer-Comparison.gif \"http://i49.photobucket.com/albums/f291/crazyreaper/Helvetica-to-Univer-Comparison.gif\")\n\nnothing lines up, helvetica does a lot more than univers, most of the lines in univers aren't even parallel, anyone else find this otherwise the last 2 thousand words are useless cause i might be using dud versions\n\nMatt\n\n",
  "author": "crazyreaper",
  "time": "7 Nov 2008 — 12:18pm",
  "uid": "39320",
  "comments": [
    {
      "time": "7 Nov 2008 — 12:42pm",
      "content": "They’re supposed to look like that. Draw them the way you think that they should look, compare your versions to the originals, and then you’ll get it.\n\n"
    },
    {
      "time": "7 Nov 2008 — 12:54pm",
      "content": "Matt, this is called \"optical correction\" and all professionally designed typefaces incorporate these elements into the letterforms. It has to do with positive/negative space, and making the letterforms appear balanced when in fact there are these small details that are measurably different. For a quick example, draw a square and a circle the same height and width. The circle will appear smaller even though it is the same height. This is why letters like O and Q, etc. have \"overshoot\" and actually extend past the height of the other letters.\n\n"
    },
    {
      "time": "7 Nov 2008 — 1:49pm",
      "content": "The way x's are usually constructed in typefaces has to do with a well-known optical illusion. Here is a simple example: Using only your eyes--no cheating with a straight edge or tilting your screen at a more advantageous angle--which of the two diagonal line segments on the right looks most like it is a continuation of the diagonal line segment on the left?\n\n ![](http://web.archive.org/web/20131019190637im_/http:/typophile.com/files/illusion_4925.gif)\n\nAfter you have decided, check your answer with a straight edge.\n\n"
    },
    {
      "time": "7 Nov 2008 — 1:57pm",
      "content": "One other thing: The amount to which this is done depends on how thick the strokes are. On a bolder typeface, the amount of compensation is greater; on a very thin typeface, maybe none at all. The amount also relates to how far from perpendicular the two main strokes are in relation to each other. The amount will be most extreme in a very bold condensed typeface.\n\n"
    },
    {
      "time": "7 Nov 2008 — 2:24pm",
      "content": "wow, thank you very much guys for that help. i just never expected them to be that far out, was worried that the type file i had was some dodgy 3rd part look a like and you have given me a lot more to talk about on the letter x, thank you :)\n\n"
    },
    {
      "time": "7 Nov 2008 — 2:25pm",
      "content": "p.s. i think i should stick around on these forums and learn a lot more from you guys :)\n\n"
    },
    {
      "time": "7 Nov 2008 — 2:42pm",
      "content": "Matt,  \nRemember, in type design, the eye is the final arbiter, not the ruler.\n\nChrisL\n\n"
    },
    {
      "time": "8 Nov 2008 — 11:28am",
      "content": "yes very true\n\n"
    },
    {
      "time": "9 Nov 2008 — 7:44am",
      "content": "Okay, that one has been a member for 45 min 30 sec and he's already getting on my nerves.\n\nCan someone with the right privileges kill him off? Please? Please? (And remove his posts? Please?)\n\n"
    },
    {
      "time": "9 Nov 2008 — 11:43am",
      "content": "Who is getting on your nerves? Which posts? ;^)\n\nI'm on his case Terminator-style, and _he_ won't be back. Blocking his sorry arse. :^P\n\n"
    },
    {
      "time": "9 Nov 2008 — 11:49am",
      "content": "Way to go, Yves!\n\nChrisL\n\n"
    },
    {
      "time": "9 Nov 2008 — 2:35pm",
      "content": "You went \"medieval\" on him, typophile style, eh: wood cuts? Branding irons?\n\n"
    },
    {
      "time": "10 Nov 2008 — 6:22am",
      "content": "Aw, don't be so mean. :(\n\n"
    },
    {
      "time": "14 Nov 2008 — 11:16pm",
      "content": "Thanks- Theunis and Yves for your mean remarks- very encouraging for new comers...\n\n"
    },
    {
      "time": "15 Nov 2008 — 5:19am",
      "content": "For those who missed it and might therefore be confused, Theunis was referring to a spam post that showed up in the middle of this thread. Yves is a moderator and quickly removed the offending post (actually post\\*s\\*, plural, since they showed up in several threads at about the same time).\n\nBut because the references here are somewhat cryptic, once the post in question was removed, it might look to some like they're beating up on the OP.\n\n"
    },
    {
      "time": "15 Nov 2008 — 5:53am",
      "content": "So _that_ explains the looks I'm getting on the streets.\n\nI thought it was because I need to shave.\n\n"
    },
    {
      "time": "15 Nov 2008 — 8:19am",
      "content": "Actually, Theunis, I really like the beard :-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Nov 2008 — 3:12am",
      "content": "Thanks for the clarification.\n\nCan't blame us, we came across some pretty mean remarks on Typophile lately - especially towards those who are from non-English speaking background, ( ie, Asians- their lack of command in English probably make them appear to be \"stupid\"...hey, come on... Obama just won the election... :P ) as well as towards the students. ( I also do a lot of lecturing and thus symphatize with students who ask seemingly \"stupid\" questions- I am sure many of us can identify with that too...)\n\nMy apology to Theunis and Yves for the misunderstanding (especially to Yves- I just couldn't figure out how could someone at his stature be so mean and I almost get disgusted by that...)\n\nAlright, let's not continue to dwell on this and let's get on to some more constructive stuff...\n\n(BTW, Theunis- I am sure I like that beard too if I saw you on the street... )\n\n"
    }
  ]
}
