{
  "id": "51441",
  "title": "young hip logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey friends! I'm doing a little work for a local 'zine' thats going to review the local music scene, it's called F4 and I'm designing the logo. Here I have a couple examples, I'm using MUSEO and I want to ask you guys about some legibility. I was concerned that the '4' form would not be recognizable in sketch (a) so I broke the stroke of the 4 at the top in sketch (b). How do you feel about the legibility of sketch a and the odd broken 4 of sketch b?\n\nplease excuse the rough edges of these sketches.\n\na:\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/f41_6144.png)\n  \nb:  \n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/f42_5948.png)\n\nThanks!  \n-Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n",
  "author": "scottsullivan",
  "time": "8 Nov 2008 — 12:11pm",
  "uid": "37489",
  "comments": [
    {
      "time": "8 Nov 2008 — 2:17pm",
      "content": "I am not really sure what the diagonal line in the center is there for. It makes the f and 4 hard to see. Also the F kind of becomes an E.  \ni did some real fast tweaking to try and bring out your f more. Cool start though, very bold.\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/f42_5948_5217.jpg)\n\n"
    },
    {
      "time": "8 Nov 2008 — 8:10pm",
      "content": "So I see the F4 and the Apple \"Command\" shape, I think b is better of the two, but needs more refinement - there's weird angles happening that make it disconcerting, things not lining up parallel as expected. I'm curious as to what your thinking is behind making the rounded squares different sizes? It kind of unbalances things to my eye. Maybe drop the lower right rounded square to make the number 4 more apparent. I think this is a good concept overall though.\n\n"
    },
    {
      "time": "9 Nov 2008 — 3:49pm",
      "content": "CJ- Really appreciate your re-working there, but the loops are supposed to flow into each other and I'd really like to keep the form unbroken. I think what makes my 'F' form not an 'E' is the position of the horizontal stroke in the middle of the form.\n\nBEM- Hah the 'command' shape! I definitely didn't intend that one (though don't mind it). I made the bottom right square that larger size because I just went off the shape that was given by the bottom right strokes of the '4' I definitely think what's making this unbalanced is the lower right square, I think I'll either cut it out all together or make it the same size as the other squares.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "9 Nov 2008 — 4:12pm",
      "content": " ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/ffour_6366.png)\n\nSketch A: The bottom right loop is removed without the strokes of the 4 being modified.\n\nSketch B: The bottom right loop is removed and the bottom vertical stroke of the 4 is shortened to reflect the adjacent horizontal stroke.\n\nSketch C: The bottom right loop is reduced in size to reflect the other loops.\n\nLet me know what you think! thanks again!\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "9 Nov 2008 — 5:53pm",
      "content": "is it meant to be legible?\n\ncause if it's not ... it working.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131011113902/http:/www.solid-creative.com/identity.htm)  \n [Bicycle Film Festival](http://web.archive.org/web/20131011113902/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "9 Nov 2008 — 5:56pm",
      "content": "I could do without your comment Ratbaggy, I didnt ask for assholes to comment, only friends.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "9 Nov 2008 — 6:00pm",
      "content": "_\"I could do without your comment Ratbaggy, I didnt ask for assholes to comment, only friends.\"_\n\nwoah! way to jump to conclusions scott.\n\nI don't think it's legible, but it doesn't necessarily HAVE to be - particularly being for a younger audience.\n\nbut hey ... whatever.\n\ngood luck.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131011113902/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20131011113902/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "9 Nov 2008 — 6:03pm",
      "content": "okay, you're right, I may have jumped the gun there, but you could have worded your comment a little differently. Sorry guy.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "9 Nov 2008 — 6:55pm",
      "content": "I agree about it's illegibility.\n\nI also don't really get the relation to the apple 'command' button. What's F4 got to do with music? Try out some different concepts and post them here.\n\npenn\n\n"
    },
    {
      "time": "9 Nov 2008 — 7:13pm",
      "content": "The ⌘ symbol is the 'command' symbol, and the similarities between the two symbols are coincidental. I have no idea why they chose F4, I'm just making the logo. I don't have anything to do with the actual production of the zine so I can't just tell them to re-do the title.\n\nI'm pleased with the direction that the current F4 symbol is taking, and I'd really like some feedback on the most current sketches posted above.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "9 Nov 2008 — 7:37pm",
      "content": "Hey Scott, first off I like the icon overall in terms of how it looks, BUT, if you ask for a critique on a typophile one of the main issues will always be legibility. The logo you've designed doesn't read \"F4.\" if that's not a concern to you I don't think you're going to get much positive feedback from this group. If you're pleased with it go with it! Personally I would encourage you to develop your idea into a form where \"F4\" is more legible.\n\n"
    },
    {
      "time": "9 Nov 2008 — 8:29pm",
      "content": "thanks Chris, first off, I'm all down for a critique here and I'm absolutely open to anyone's opinion here, but it's more the tone of a previous comment that irked me for a second.\n\nLegibility is a secondary concern to me, this symbol will (hopefully) be seen repeatedly so many times that it will actually become more of a ⌘ or something like that where every time one would see it, they don't think 'that's the letter F and the number 4' they just say, oh thats the F4 zine logo, and if they really actually take a moment to look at the symbol they see the two forms.\n\nNOW! legibility aside, what do you guys think about the three sketches in the post above?  \nBottom right loop on or off?  \nif off, which seems better balanced? the full vertical bottom stroke of the 4 or the shortened stroke?  \nI'm considering rotating the lockup very slightly to the left to keep it fresh.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 2:13am",
      "content": "Sorry scott. Ratbaggy made a very sensible comment. I don't know why you felt offended in the first place. Sorry but your logo isn't legible at all. You have to read this thread to know it's supposed to say F4. If you don't believe us, just print it out and hand it over to strangers. Young or old, majority WON'T read it as F4. And if you wan't them to refer to the magazine as F4 magazine, they will have to read it somewhere it's an F4 magazine. Otherwise it'll just be some symbol magazine. Do you intend to use words \"F4 magazine\" in the headline as well?\n\nSo I guess his comment is legit. If you need your magazine head to actually read F4, than you're on a completely wrong track. If legibility is not important at all (but originality is) than this is the logo to go.\n\nAny comment is welcome, even though you may see it as negative. You will have to judge whether you take some advice or not. No need to label people here as \"as\\*\\*oles\"...\n\nAnd one more observation: I've seen the lines in the last batch are not straight. Maybe that's an error. And they also vary from logo to logo.\n\nAnd to make it look more like mac's command symbol maybe don't put the top stroke of \"F\" into two levels. Just keep it straight and go into the top right loop. If you intend to keep the two levels, then make the change a bit more to the right, because it interferes with the \"F\".  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "10 Nov 2008 — 9:02am",
      "content": "thanks Robert. Yes, Ratbaggy's comment was very sensible and I appreciate it, however the wording was a bit aggressive and I felt it to be out of line. Granted my response was out of line as well.\n\nnow, as I stated earlier. I don't need the symbol to spell out the exact title of the zine, and I am NOT trying to make it look like the command symbol. The guys who are running the thing like how it's going. Anyone, is there anything else that is glaringly wrong other than the legibility issues before I work this out into a more polished image?\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 9:14am",
      "content": "If it's not supposed to be legible as F4, what <cite>is</cite> it supposed to look like? It doesn't appear to have any link to music. Is it representative of something local?\n\nI think you need to explain where you're coming from with the style and the idea behind the name F4.\n\nCheers,  \nRoss\n\n"
    },
    {
      "time": "10 Nov 2008 — 9:44am",
      "content": "Okay well, the image is not supposed to look like anything specifically, there's no real deep concept here, and I have absolutely no idea why they're calling it F4, I think it might have something to do with the names of the four main contributing writers. This is really just an exercise in a letter-number combination that appeals specifically to a younger audience.\n\nStylistically, I'm going to try and place this in a somewhat similar retro-like category as say the work of [Scott Hansen](http://web.archive.org/web/20131011113902/http:/blog.iso50.com/).\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 10:19am",
      "content": "Will this logo appear on the cover, and if so, will the characters \"F4\" appear next to it, and if so, in what font will they be?\n\n"
    },
    {
      "time": "10 Nov 2008 — 10:23am",
      "content": "As of right now, the logo will be on the cover and if the characters F4 appear next to the symbol, which they probably will, they will most likely be in Museo or Museo Sans.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 11:41am",
      "content": "A is the better of the latest bunch but perhaps, to make it even more apparent, remove the crossbar connecting the 4 back into the F. I think your 4 would then become more noticeable. Or perhaps think about changing the color values so the F and 4 would remain black while the connecting \"pieces\" would be a dark gray. Bonus if you can get the color values to blend nicely into each other. Just some thoughts to help the F and 4 stand out a bit more while maintaining your \"connected\" concept.\n\n"
    },
    {
      "time": "10 Nov 2008 — 12:16pm",
      "content": "If it's a music zine, that's not coming across. If it needs to say \"F4,\" that isn't coming across. I definitely picked up on the Apple \"Command\" symbol that some others have mentioned, but that could be because I work at a Mac all day.\n\nThe other meaning I could derive from the sketches, the one I think you were going for, is a sort of futuristic (not futurist), slick, electronic attitude. If that is your aim I think you're on the right track, and you could intensify that message by drawing the next round of sketches on an even more restrictive grid.\n\nI think you could try looking deeper into the meaning you're trying to convey, too. Musically speaking, \"F4\" is the note F just above middle C, although why that has significance to the zine is beyond me.\n\n"
    },
    {
      "time": "10 Nov 2008 — 12:25pm",
      "content": "But \"command\" F-4 could also be an homage to screen capturing - or in this instance, \"capturing\" the musical scene.\n\n"
    },
    {
      "time": "10 Nov 2008 — 2:14pm",
      "content": "bemerx - but ... it's not. its been stated that there's no deep concept behind it.\n\nscott - what other concepts have you got? it seems pretty clear that the consensus is the current version isn't really working on many/any levels.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131011113902/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20131011113902/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "10 Nov 2008 — 2:45pm",
      "content": "Paul, I like where this is going. There is no consensus that this is not working, I stated before that the people who are running the exquisitely named zine like the look of this. The sketches are working on the level of it looking cool. A trendy music zine doesn't need a treble clef or some deep meaning that's going to be largely lost on anyone but designers. As you said before, this being for a younger audience doesn't even need to be legible. sketches coming soon.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 2:51pm",
      "content": "wasn't your original question about legibility?\n\nso it doesn't need to be legible? cool then what do you want us to give feedback on?\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131011113902/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20131011113902/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "10 Nov 2008 — 2:58pm",
      "content": "Partially about legibility.. but since then I've been trying to get feedback on three sketches in the post above?  \nBottom right loop on or off?  \nif off, which seems better balanced?  \nthe full vertical bottom stroke of the 4 or the shortened stroke?  \nis it cool?\n\nThis forum isn't only about legibility.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 3:11pm",
      "content": "here we go then.\n\noff.  \nas a stand alone piece A is more balanced.\n\nI don't think it's cool.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131011113902/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20131011113902/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "10 Nov 2008 — 3:21pm",
      "content": "no purpose of having the F4 in it...since you can't read it anyway. Just create a cool symbol without it...it's much easier that way.\n\n"
    },
    {
      "time": "10 Nov 2008 — 3:24pm",
      "content": "thanks paul haha\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 3:31pm",
      "content": "Jakes! thanks for the suggestion, but I still have to keep the F and the 4 cause it's a requirement from the client and even though it's not immiediately recognizable, you do see the form when you know the name of the zine.\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 3:32pm",
      "content": "Maybe it is a young thing. I immediately saw 'F4'\n\n"
    },
    {
      "time": "10 Nov 2008 — 4:19pm",
      "content": "So if we're moving past the legible/not-legible debate... There's nothing wrong with it only abstractly representing an F4 - however in that case I would start to consider the over all symmetry and consideration of every single detail in the mark. (and let me try to cut off any misunderstanding by saying that these are not intended as rhetorical or patronizing questions - I'm honestly asking...)\n\nLooking at the last A,B,C samples; A and B have top-right and bottom-left loops that are almost the same, but they're not. On C the bottom-right loop doesn't match either of the two loops. Is this intentional? Do you intend to clean that up later?\n\nIn A the bottom-right-corner line pointing down doesn't quite reach as low as the bottom-left loop and the right-pointing line doesn't reach quite as far to the right as the top-right loop. Is there a reason for that?\n\nIf this is truly an abstract shape, I'd consider making it highly-symmetric (top right/bottom left; top left/bottom right corners identical), then the only places that you break that symmetry (the bar of the 'F' and the top of the '4') will seem much more intentional.\n\n"
    },
    {
      "time": "10 Nov 2008 — 4:38pm",
      "content": "On your nov 9 posting, a is the strongest so far but I think it has one loop-de-loop too many. Try versions taking away the top right loop and then the bottom left loop. Determine which one reads better. Or maybe it just doesn't need to be entirely enclosed.\n\n"
    },
    {
      "time": "10 Nov 2008 — 7:16pm",
      "content": "Your initial post asks about legibility. I don't feel like it's instantly legible, and I am young (and somewhat trendy, if that's what you mean by hip).\n\nWhat throws me off is the sagging line at the top and the various sized loops. They just confuse me. I expect them to be like that for a purpose, and my eyes get lost trying to figure out what that is.\n\nI'm not with my mac right now, but I just whipped this up on Paint.NET on my work compy.\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/F4_4086.png)\n\n"
    },
    {
      "time": "10 Nov 2008 — 7:59pm",
      "content": "and it's loads better.\n\nnice stuff istariskoda.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131011113902/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20131011113902/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "10 Nov 2008 — 11:06pm",
      "content": "It seems like you could tinker more with a juxtaposition of pure letter forms. Maybe try flipping letters. Since it's only a two-character name, there's some leeway as far as legibility goes. A quick thought:\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/f4_a_4407.gif)\n\nDOGG : : :\n\n"
    },
    {
      "time": "11 Nov 2008 — 1:20am",
      "content": "Both visual suggestions in the last two posts are much much better than the original. They are. More balanced less stressed and quite nice. It proves the old rule of making it better by simplifying it.\n\nSince it's trendy music maybe strokes should also have weight variation to make them more melody or music like... Only my opinion.\n\nAnd in the top left of istariskoda's preposition where the loop is missing in this exact design there could be a geometric font writing of \"F4\". Maybe in Eurostille. It would fit there perfectly and complement the symbol.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "11 Nov 2008 — 8:53am",
      "content": "Hi guys,\n\nBeen following this thread for a little while - I really love these crit threads, although I rarely have much to add!\n\nI've just been looking at the mark (both the originals and the later suggestions) and my personal feeling is that it would be considerably improved by losing the outer 'flourishes' altogether. I did a little mockup (which incidentally I hate doing - feels wrong changing somebody else's work) based on the suggestion istariskoda put up a few posts ago:\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/f4_5144.jpg)\n\nFor one thing, I think this improves the legibility of the mark a fair amount. It also leaves it much more compact, which I always think is helpful for a logo - obviously it will mainly be used on the cover, but you never know what other contexts it'll end up being used in! I also think paring it down like this might be helpful from a 'hip, cool' point of view (saying that makes me feel much older than I am) - I think it feels a bit fresher with straight edges and overtones of emoticons/faux-asian characters.\n\nFinally, it'll stop everyone referencing the apple command key! Which can only be a good thing :)\n\nAnyway, it's just an idea. For the record, I really like the idea, and think you're onto something - but it's not there yet. I sort of think the idea itself is the square with the two protrusions - the flourishes are simply decoration.\n\nGood work with this one, can't wait to see how it turns out. Keep us informed!\n\nAndi\n\n[[semibad](http://web.archive.org/web/20131011113902/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": "11 Nov 2008 — 10:14am",
      "content": "Sorry, just doodling…\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/F4_6522.png)\n\nRoss\n\n"
    },
    {
      "time": "11 Nov 2008 — 11:52am",
      "content": "Yes generic. I wonder how do you guys feel if you get a straight out suggestion in visual form that's better than yours by a margin... What do you do with it? Do you stay stubborn and go with your own or maybe try and improve other guy's idea if it can be improved at all...? What would you actually do?\n\nI think Andii (a.k.a. genericboy) produced something that can win majority vote on this logo. But the question is what will scott do with it?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "11 Nov 2008 — 12:59pm",
      "content": "The problem I have with a lot of these is that the 'F' could just as easily be an 'E'.\n\n- Lex\n\n"
    },
    {
      "time": "11 Nov 2008 — 2:00pm",
      "content": "people have put forward some great feedback, comments and suggestions.\n\nnow ... where's scott got to?\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131011113902/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20131011113902/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "11 Nov 2008 — 2:10pm",
      "content": "wow! first off I'd really like to thank everyone who's posted here I really appreciate it.\n\nnow:  \ncabbage: the loops being matching- no, not intentional, these are just little sketches I was working on and will be cleaned up later. 'pointing out' strokes not matching up on 11/9 A- those strokes are unedited Museo strokes and yes, in more refined versions, they'll be a bit more thought out in terms of alignment. symmetry- I agree, highly symmetric sounds like a good policy here.\n\nKristen Navin:\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/one_3439.png)\n\nistariskoda: yeah those are just in some sketches that I threw together and will be fixed in the final. and thanks for the great painted sketch! I really like the angle at the top of the stroke of the four there.\n\ndogg: thanks for the sketch, kinda scary tho.. pointy!\n\nRobert: eurostile.. hmm\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/two_5196.png)\n\nAndi: great sketch - you're right that does improve the legibility.\n\nRobert agian: See, I do not personally believe that Andi's sketch, as great as it is, is better for this specific project. Seeing that the music scene here isn't a european techno kind of thing, it just doesn't work for Ohio.\n\nround 3 sketches coming this evening\n\nthanks again  \n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "11 Nov 2008 — 2:43pm",
      "content": "andi-\n\nI like that logo. I mean with just coming up with it, it's pretty good. It might not read right away as F4, but as soon as I get the relation once, I see it without any effort. This is great for the music scene. It's almost like an \"in\".\n\nscott-  \nI've been reading all the threads, and your logo doesn't seem to be progressing too much in the legibility factor. I really think it has to be those squares on the outsides of the letter forms. They require too much focus, drawing your eye away from already difficult to see letter forms. It might just be because they don't serve much of a visual purpose. They don't seem to be at that electronica era yet...instead they are sort of mimicking the illuminated manuscripts...vaguely.\n\ncourtney\n\n"
    },
    {
      "time": "11 Nov 2008 — 3:09pm",
      "content": "Was reading over the thread again, and I had another thought. I feel it's a shame that the logo doesn't suggest music. What do you think about this?\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/F4_4086_6064.png)\n\n"
    },
    {
      "time": "11 Nov 2008 — 3:53pm",
      "content": "I think my favorite of the tossed up sketches is Dogg's. Quite simple and nice.\n\npenn\n\n"
    },
    {
      "time": "11 Nov 2008 — 3:57pm",
      "content": "i really like the top left on this one:\n\n[http://typophile.com/files/one\\_3439.png](http://web.archive.org/web/20131011113902/http:/typophile.com/files/one_3439.png)\n\nalso, i am young and obsessed with music so my opinion matters :)\n\ni would like to see this top left version with a longer stem on the top of the \"F\" flowing out toward the left (possibly the same size as the 4?)\n\ni really don't like the ones that look like the apple command symbol\n\n"
    },
    {
      "time": "11 Nov 2008 — 3:59pm",
      "content": "dogg's looks too much like the weezer logo in my opinion\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/Weezer_logo_3655.jpg)\n\n"
    },
    {
      "time": "11 Nov 2008 — 4:07pm",
      "content": "legible:\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/legible_3714.png)\n\ntrendy:\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/trendy_5836.png)\n\ngerald?\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/eh_6133.png)\n\n- Scott Sullivan  \n [www.trifepdgm.com](http://web.archive.org/web/20131011113902/http:/www.trifepdgm.com/ \"www.trifepdgm.com\")\n\n"
    },
    {
      "time": "11 Nov 2008 — 6:26pm",
      "content": "gerald:\n\nThen again, the Weezer logo is just a bite on the Van Halen logo…\n\n ![](http://web.archive.org/web/20131011113902im_/http:/typophile.com/files/VanHalen1979_3640.jpg)\n\nDOGG : : :\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:27am",
      "content": "_Seeing that the music scene here isn’t a european techno kind of thing, it just doesn’t work for Ohio._\n\nYeah, I can totally see this. I think this is part of the problem with trying to judge something as 'young and cool' - it really depends on the particular subculture. Because of my own location and particular musical background, when you talk about a music magazine aimed at an edgy local music scene, I automatically associate that with something a lot more urban and dance-based (with connections to a completely different graphic style, influenced by graffiti culture, etc).\n\nMaybe it would be helpful for you to be a bit more specific about the type of music culture that this magazine will cover, and thus the audience it's aimed at?\n\nAs for the most recent batch of sketches - I don't personally think the 'track line' on the second works, or adds anything to the logo. The more I look at the third one, the more I like it! I didn't really get a good feeling from it at first, but it's definitely grown on me - I like the fact that it's become a continuous line with a single flourish halfway, rather than a kind of ongoing loop with projections all round. I do think that the outer diagonal line of the four should follow the same line all the way down - not suddenly having a vertical edge where it hits the crossbar. Does this make sense? I couldn't think of a clearer way to say it!\n\nJust a final quick question - are you still using a typeface first and then 'extending' it with vector shapes? Your OP seems to suggest this, and if so this is probably why some of the sketches are a little uneven. If this is the case, it might be worth working on this in a purely geometric way, to make sure that line is a bit more even like this - a lot of the time, a geometric logo like this doesn't 'click' until it's _really_ even.\n\nSorry about the essay!\n\nAndi\n\n[[semibad](http://web.archive.org/web/20131011113902/http:/www.semibad.com/)]\n\n"
    }
  ]
}
