{
  "id": "51464",
  "title": "Sunday Topic - The textfaces of the 15 books I read recently",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I read novels for pleasure, never cared much about the typefaces the books were set in (unless it was horribly bad to read). Working in advertising I didn’t have to deal with setting large amounts of text (especially not prose) but rather designed in display sizes or tried to match the corporate content. But ever since I joined this forum I couldn’t help it, I started looking up the fonts in books. Today I looked up the textfaces of the 15 books I read recently. All books are paperbacks (and novels), some older, some new (I buy quite a lot of used books).\n\nHere goes:\n\nCandida  \nMonotype Garamond  \nCaslon 540  \nPlantin  \nStempel Schneidler  \nStempel Garamond  \nRotis Serif  \nStempel Garamond  \nDTL Fleischmann  \nITC Mendoza  \nStempel Garamond  \nStempel Garamond  \nDTL Documenta  \nMinion  \nBaskerville (don’t know exactly which one)\n\nStempel Garamond seems to be _the_ bookface. Really lovely are the DTL-faces.  \nAnd yeah. You may call me a geek.\n\n",
  "author": "Jan",
  "time": "9 Nov 2008 — 6:59am",
  "uid": "17243",
  "comments": [
    {
      "time": "9 Nov 2008 — 10:28am",
      "content": "Rotis Serif - ouch!\n\n"
    },
    {
      "time": "9 Nov 2008 — 11:43am",
      "content": "Just recently I've been curious about the text fonts too, but rarely are they named on the page listing the publishing info. Where would I find it?\n\nI recently saw a historical novel in the library I wanted to borrow. But after glancing over the pages, I couldn't. The text was actually in one of those faux-historical distressed fonts, maybe 17th or 18th century. I knew it would be unbearably distracting.\n\n"
    },
    {
      "time": "9 Nov 2008 — 12:20pm",
      "content": "None of the fonts were listed with the publishing info. I had to look them up using reference material. It was the book set in DTL Documenta which started this whole thing and it took me quite some time to figure that one out (mainly because I didn’t expect a paperback to be set in such a classy and expensive font).\n\n"
    },
    {
      "time": "9 Nov 2008 — 1:26pm",
      "content": "I recently read Neal Stephenson's Anathem, which got me thinking about this too. That book uses Dante, which was new to me. I did a blog post on it with a few photos from the book - [http://rocdove.com/blog/featured-font-dante/31](http://web.archive.org/web/20150416032123/http:/rocdove.com/blog/featured-font-dante/31 \"http://rocdove.com/blog/featured-font-dante/31\")\n\nI tend to notice a lot of Baskerville as well as Palatino.\n\n"
    },
    {
      "time": "9 Nov 2008 — 1:58pm",
      "content": "Handpicked and commented:\n\n**Caslon 540**  \nBook: _Mason & Dixon_ by Thomas Pynchon  \nStory is set mainly in London and America in the 18th century.  \nCaslon is historically a good choice, although the quality of the digitization of Caslon appears to be poor (too flimsy/light). A drawback are initials and chapter titles set in Bank Gothic.\n\n**Plantin (Monotype)**  \nBooks: _Quicksilver_ and _The Confusion_ by Neal Stephenson  \nParts One and Two of the Baroque Cycle (trilogie).  \nStory is set all over Europe and beyond. It’s Science fiction set in the 18th century.  \nAppropriate choice. Plantin is the recreation attempt of the work by a 16th century Frenchman in Holland with the lowercase ‘a’ taken from another face. Historical Confusion. Artificial. Fiction based on historical facts. Baskerville might have been a good choice reflecting the transitional aspect of the time-setting and content, but maybe too correct.\n\n**DTL Fleischmann**  \nBook: _Water Music_ by T. C. Boyle  \nActually in this case the typeface was listed with the publishing info (which I saw afterwards). A very cheap re-issue book (5 EUROs). Story is set mainly in London and Africa in the 18th century, about the exploration of the Niger by an Englishman. Fleischmann seems historically correct, but actually Baskerville (or Caslon) might have been a better choice, being more English. Fleischmann performs wonderfully, although being a Dutch extravaganza.\n\n"
    },
    {
      "time": "9 Nov 2008 — 2:11pm",
      "content": "How interesting that Jan's fifteen recently-read books were set in twelve different faces. Presuming Jan reads American books, this gives the impression that US publishers use a considerable variety of fonts. This personal typographic census reminds me of a more ambitious project I tried (but failed) to launch in Italy about seven years ago. The idea was to measure the reading public's perception of book faces.\n\nTen examples of a double-page spread from the text of a historical novel (paperback size), each set in a font commonly used by Italian book publishers (Times, a couple of Garamonds, Palatino, Minion, well-leaded Utopia, ITC Baskerville, Galliard, Rialto, Bauer Bodoni) were placed on a table. These ten different fonts came off a quality laser printer on off-white bookish paper. Each sheet had the same nice margins and the apparent size of each font was the same. Each sheet was given a number corresponding to its font and was folded in the gutter to give a more accurate idea of an open book.\n\nWhile examining the specimens, readers were asked the following questions about the different fonts: 1) Which is the most classical? 2) which is the most contemporary? 3) which is the most familiar? 4) which do you prefer to read? 5) which is the most difficult to read?\n\nThe idea was to get a close idea of the reading public's perception of type and sort out the results according to: 1) sex, age, profession and residence; 2) educational level; 3) number of books read in a year; 4) type of books prefered and names of prefered publishers.\n\nA nation-wide «opinion poll» of this kind would need very heavy sponsorship. It would mean having interviewers behind tressle tables in (or near) bookshops or in open spaces like parks on Sundays. People would need to be relaxed and not in a hurry to spend time examining the specimens and answering the questions. I never got any further than playing this game with my typography students. But even in that teaching context — which was a fairly close facsimile of reality — it certainly helped to raise students' awareness of type.\n\n"
    },
    {
      "time": "9 Nov 2008 — 2:49pm",
      "content": "_Presuming Jan reads American books ..._\n\nSorry James. German books by German publishers.  \nYour poll-questions are quite good, but what would be the outcome of a nation-wide opinion poll? Having all books being set in Times eventually?\n\n"
    },
    {
      "time": "9 Nov 2008 — 3:38pm",
      "content": "Ha, Jan you seem to share my taste for 1000 page novels :)\n\nFrom my shelf (American hardcovers):  \nMason & Dixon - some flavor of Bodoni, Bodoni Classico as best as I can tell  \nQuicksilver/The Confusion - ITC New Baskerville\n\n"
    },
    {
      "time": "9 Nov 2008 — 4:17pm",
      "content": "Jan's list struck me immediately as non-American in its breadth and variety, even without checking his profile to see where he hails from.\n\nI referenced an informal sampling that I did several years ago along similar lines in this thread:  \n [http://typophile.com/node/50663](http://web.archive.org/web/20150416032123/http:/typophile.com/node/50663 \"http://typophile.com/node/50663\")\n\nI've sensed a Dante resurgence in the past year or two. It seems to come and go. Various faces come in and out of vogue. Fournier was showing up quite a bit for a few years; less now.\n\n-- K.\n\n"
    },
    {
      "time": "10 Nov 2008 — 6:40am",
      "content": "Kent is right, there has definitely been a resurgence in Dante over the last couple of years, particularly at Penguin. A couple of years ago, they seemed to favour Minion over all others.\n\nAnyways, Jan's list is certainly interesting and made me look at the last fifteen books I have read. A lot of Garamond again (mostly Monotype or Adobe Garamond rather than Stempel), Adobe Sabon, Adobe Caslon, Bembo (of course). In fact, the only notable exceptions were Christopher Burke's Celeste and Trump Medieval. Perhaps that says more about my choice of reading material than anything else!\n\n"
    },
    {
      "time": "10 Nov 2008 — 7:02am",
      "content": "I looked at three more books I read more or less recently:\n\nAdobe Garamond  \nStempel Garamond  \nMonotype Garamond\n\nStempel Garamond seems to be the standard bookface here in Germany.  \nI don’t think it’s a matter of trend or fashion, but of design lazyness.\n\nNicest one in the list: DTL Documenta  \nBeautiful and a pleasure to read.\n\nI didn’t like ITC Mendoza (seeing it in use) as much as I thought I would (knowing it from speciments).\n\n"
    },
    {
      "time": "10 Nov 2008 — 8:37am",
      "content": "It is a shame that digitisations of metal types are near-universally preferred to more recent faces, designed specifically for modern typesetting. Where are the books set in, say, Jeremy Tankard's Kingfisher or H&F-J's Mercury?\n\nIn the UK, at least, it seems that book typography is falling way behind newspapers (see Guardian Egyptian or the Observer's heavy use of Whitney) – a case where the limitations of newsprint are helping push things forward?\n\n"
    },
    {
      "time": "10 Nov 2008 — 10:51am",
      "content": "\\<\\< It is a shame that digitisations of metal types are near-universally preferred to more recent faces, designed specifically for modern typesetting. \\>\\>\n\nWhen hiring freelance designers, art directors and production managers can help lead the way to use of new faces in book typesetting. I have just pulled down a bunch of books that had been in my charge over the past two years as Design & Production Manager for the Press of a state historical society. Here's some of the faces used by freelancers: Requiem, Kingfisher, Miller, Clifford, Malaga, Quadraat, Filosofia, Chaparral, Minion, Mercury, Paperback, Warnock Pro, Adobe Jenson Pro. (& one disaster set in Golden Cockerel far too small for good reading. But we were under a time crunch, and the manuscript had growed too much to fit into the desired page count. It still sells well, though.)\n\nThere are two reasons these designers used these faces. One is that I push them to, following my own practice of never using for text any hot-metal face I used in the years when I printed books letterpress. The other reason is that they are all good designers, able to understand that books they design will be printed better and will look better and read better if they carefully choose new faces, well-designed.\n\nI do not always like the faces they choose. Quadraat and Filosophia are not faces I'm drawn to for the work in my charge. But as good designers they can pull off good designs with these faces.\n\nAs for Plantin: I have yet to see a digital version I like. That's too bad, for I believe Plantin has inherent good qualities that could come forth if it were well digitized. Maybe now there's a good one; I gave up looking a while back.\n\nOther art directors & production managers for publishers should join me in pushing freelance talent in this direction. Onward with new types for new books!\n\npowers\n\n"
    },
    {
      "time": "10 Nov 2008 — 1:03pm",
      "content": "”Sorry James. German books by German publishers.”\n\nYes, that was very presumptuous of me, wasn't it? Dear Jan, I'm the one who should be saying sorry!  \nThat you refer to faces used by German publishers makes your report even more interesting. All I can say, by contrast, is that Italian publishers are far less adventurous.\n\nThe overwhelming majority of Italian books are not designed at all but are simply part of an automatic production process where only the jacket is designed. That is one reason why \"safe\" Garamondish faces predominate inside the books — to the point of nausea.\n\nWill's report above also testifies to a design climate that is inspiring and lively. Nevertheless, an interesting wave of new Italian type designers has emerged over the past few years. And a very good-looking book showing many of them (Italic 2.0, published by De Agostini with dual English/Italian texts) came off the press three weeks ago. All I can hope is that Italian publishers start to open their eyes and put some of the young talent to good use.\n\nI agree about Plantin. Before the letterpress era ended it was unbeatable for texts in small sizes on art paper, and to think that it was produced in 1913, ten years before Morison set foot in Salfords!\n\n"
    },
    {
      "time": "10 Nov 2008 — 11:10pm",
      "content": "How can the publishing industry be encouraged to include a colophon inside all of its titles?\n\nThe typeface designer of a particular book's typeface deserves just as much recognition as the book designer and the cover designer and the illustrator and the person who took the author's photograph, etc.\n\nEven if it is a line or two on the copyright page, I want to know the typeface name, the point size, the foundry, and the designer's name. It doesn't always have to be a long description on its own page in the back of the book. Just something short and sweet.\n\nIs this asking for too much?\n\nRahim\n\n"
    },
    {
      "time": "11 Nov 2008 — 6:27am",
      "content": "Would that all art directors be like Will! I think it's great that you encourage all of your freelancers to work in well-designed, new faces, but I fear – and Jan's list suggests – that you are the exception rather than the rule.\n\n"
    },
    {
      "time": "12 Nov 2008 — 9:20pm",
      "content": "I have designed my first 4 books over the last year and am still getting used to it, but i love it!\n\nI have used: Warnock Pro, Adobe Garamond, Arno Pro and Neutraface No. 2 (which was a challenge). i also put a credit in the books i design, so that other typophiles can track down the faces.\n\nSo far, my fave is Arno Pro (with Warnock being a close second).\n\nhave you guys seen these articles:\n\n[http://fontfeed.com/archives/top-ten-typefaces-used-by-book-design-winners/](http://web.archive.org/web/20150416032123/http:/fontfeed.com/archives/top-ten-typefaces-used-by-book-design-winners/ \"http://fontfeed.com/archives/top-ten-typefaces-used-by-book-design-winners/\")\n\n[http://www.fontshop.com/features/newsletters/industryfocus/book1/index.h...](http://web.archive.org/web/20150416032123/http:/www.fontshop.com/features/newsletters/industryfocus/book1/index.html?utm_source=FocusNov12&utm_medium=email&utm_content=WebVersion&utm_term=em&utm_campaign=FocusBook1 \"http://www.fontshop.com/features/newsletters/industryfocus/book1/index.html?utm\\_source=FocusNov12&utm\\_medium=email&utm\\_content=WebVersion&utm\\_term=em&utm\\_campaign=FocusBook1\")\n\n[http://ilovetypography.com/2008/01/22/why-bembo-sucks/](http://web.archive.org/web/20150416032123/http:/ilovetypography.com/2008/01/22/why-bembo-sucks/ \"http://ilovetypography.com/2008/01/22/why-bembo-sucks/\")\n\nI read a lot of sci-fi novels, especially older ones, and love the way Times and Palatino (or Plantin - i can't remember right now) were set in metal type, usually quite tight.\n\nI also read the Saga of Seven Suns books by Kevin J. Anderson, which were set in Weiss, which to be honest at first i found distracting as it is a really beautiful face, but after a while got used to it (although i really like the lowercase z and often pause to admire it...).\n\n"
    },
    {
      "time": "26 Mar 2009 — 12:21am",
      "content": "Will Powers writes:  \n<cite><br>\nAs for Plantin: I have yet to see a digital version I like. That’s too bad, for I believe Plantin has inherent good qualities that could come forth if it were well digitized. Maybe now there’s a good one; I gave up looking a while back.<br>\n</cite>\n\nWhat about the just released [Galaxie Copernicus](http://web.archive.org/web/20150416032123/http:/vllg.com/Village/GalaxieCopernicus/mudTyper+Weights/)?\n\nRahim\n\n"
    },
    {
      "time": "26 Mar 2009 — 4:19am",
      "content": "I read mainly french books; and they are, 99% of the time, set in Garamond.\n\ndr\n\n"
    },
    {
      "time": "26 Mar 2009 — 5:50am",
      "content": "Rahim:\n\nI just saw Galaxie Copernicus yesterday for the first time. maybe you made that post somewhere else? On that quick look I see a lot that I like. I shall have to study the PDF specimen more closely. But I'm encouraged. Thanks for the recommend.\n\npowers\n\n"
    },
    {
      "time": "26 Mar 2009 — 7:11am",
      "content": "Galaxie Copernicus is a nice face, with lots of weights, large character set, and many OT features. I look forward to finding a project where I can use it. And I _really_ like the plain-English EULA , which says the fonts are being licensed in good faith, and they expect the same good faith from licensees.\n\nDavid\n\n"
    },
    {
      "time": "26 Mar 2009 — 12:38pm",
      "content": "I've been staring at the PDF specimen for a while. The medium weight on Galaxie Copernicus hits the sweet spot for me, not to mention the italics.\n\nRahim\n\n"
    }
  ]
}
