{
  "id": "51498",
  "title": "univers - question",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hey. have a problem, i know frutiger had tottaly  \nopposite intentions but it happend :)  \ni need to combine at least 4 forms of univers lettertype  \nbut have big problems which regular, light, bold.. to choose.  \nofc i checked txts about frutiger's numering system but im  \nobviousely blind at the moment, hope not forever. it's the housework  \nfor tomorrow so i'm a bit worried right now ..  \nhow to recognize right combi of w&w?\n\n",
  "author": "iris k",
  "time": "10 Nov 2008 — 8:08am",
  "uid": "39473",
  "comments": [
    {
      "time": "10 Nov 2008 — 8:56am",
      "content": "Iris, I don't understand your question. What does \"ofc\" and \"w&w\" mean?  \nWeights beginning with a 4 are light,  \nWeights begininig with a 5 are regular  \nWeights beginning with a 6 are medium,  \nWeights beginning with a 7 are bold,\n\nstyles ending with a 5 are upright roman  \nStyles ending with a 6 are italic  \nStyles ending with a 7 are condensed,\n\nIn other words. Univers 55 is regular weight standard width roman  \nUnivers 65 is medium weight standard width roman\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2008 — 9:13am",
      "content": "thank you for your answer.  \nofc is ofcourse, w&w is weight and width.\n\nmaybe i dont understand the assignment so good, but.  \ni have to pick minimum 4 different styles from the family but it must have some sense- i have to find that sense so i can combine 4 good ones together.i pick some 4 (light, bold, oblique..) the teacher said \"no no i'm not sure that one fits, check frutiger's numbering system.) i'm a very big beginner and my classes are on language i dont understand so please have some understanding about my probably stupid question. thanks!!\n\n"
    },
    {
      "time": "10 Nov 2008 — 10:08am",
      "content": "Iris,\n\nLook at the thread from this link:\n\n[http://www.typophile.com/node/32569](http://web.archive.org/web/20140713230745/http:/www.typophile.com/node/32569 \"http://www.typophile.com/node/32569\")\n\nChrisL\n\n"
    },
    {
      "time": "10 Nov 2008 — 10:14am",
      "content": "I'm not sure exactly what your teacher's asking for, but if i was going to pick 4 fonts from Univers to go together I'd do this: choose one to start, then find a bold, italic, and bold-italic version of it.\n\nFor example:  \n55 (normal)  \n56 (italic)  \n75 (bold)  \n76 (bold italic)\n\nor:  \n47 (\"normal\" in this example)  \n48 (italic)  \n67 (bold)  \n68 (bold italic)\n\n"
    },
    {
      "time": "10 Nov 2008 — 10:30am",
      "content": "dear guys ChrisL and brendan thanks a lot!!  \ni am happy to help you one day.  \ncheers!! i.\n\n"
    }
  ]
}
