{
  "id": "5150",
  "title": "Windsor Farms Development",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am in the concept stage of a logo for a residential housing development called Windsor Farms. The geography doesn't offer much\n\n",
  "author": "squeeze",
  "time": "9 Jun 2004 — 4:29pm",
  "uid": "2236",
  "comments": [
    {
      "time": "10 Jun 2004 — 7:51am",
      "content": "Oh man...you're going to hate my cynical reply, but...it really doesn't matter what logo you slap on the granite sign in front of the gated community. This market is buying square footage and that's about it. ;o)   \n   \nAs for your marks, 1 is nice, but rather cliche...I think I've seen more slightly distressed/handwritten logos for whispering pines/shady acres/prarie rock/etc. in front of fields of houses than not.   \n   \nI like 2 alot, though I get a 'cigarette logo' vibe from it.   \n   \nI think #3 is the one I'd go with. It's got a bit of a modern feel to it, yet it fits in with the typical McMansion development logo style (as to not scare away the jones's).   \n   \nThe bottom 3 are nice, but just not doing it for me.\n\n"
    },
    {
      "time": "10 Jun 2004 — 9:04am",
      "content": "Starting from the top and working down, I prefer the first font you have chosen, and I also like the second on the left (condensed) and the bottom two fonts. I'm looking forward to seeing them with the graphics you are intending. One side note: I really like the weather vane idea but if these are high-end homes you may want to re-think using a tractor.\n\n"
    },
    {
      "time": "10 Jun 2004 — 9:22am",
      "content": "I agree with Kirsten, however If you are going to engrave this typeface you would would most likely want a clean version of it. Or If you like the distressed look, distress it yourself. It just seems funny when the R's are distressed in the exact same way. IMPO distressed types should only be distressed when the paper or other printing medium unintentionally distresses them. There is nothing wrong with a beautiful, confident, classical, and perfectly set serif typeface.(Maybe a BEMBO)   \n   \nAlso certain faces would look better in wood and certain faces would look better in stone.   \n   \nAn important question would be:   \n   \nHave they developed a style guideline for the development or are homeowners going to be able to build whatever they like (modern or classic)?\n\n"
    },
    {
      "time": "10 Jun 2004 — 9:35am",
      "content": "Hi Scott   \n   \nI vote for number two. It has a little vibe of hipness to it which the customers might draw some comfort from as they buy into the dowdy McMansion lifestyle. With a nice \"farm\" illustrative element I think you could chase away the cigarette associations.   \n   \nIf you're looking for inspiration for imagery / colors, you might try looking through a book of Andrew Wyeth paintings.   \n   \nGood luck!\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:46pm",
      "content": "Scott try setting Windsor Farms in a circular format, with your graphic in the middle. It might be interesting\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:33pm",
      "content": "Great comments! Thank you.   \n   \nI spared a few moments to gather some imagery together (not designs\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:43pm",
      "content": "I'd go with that contrasy, narrow face on top.   \nThe rest mostly look too plain, too Euro (like the thin slabs), or too Marlboro.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 4:38pm",
      "content": "Scott, the ideas on the first two pages of your PDF say \"Come to Windsor Farms to get fresh goat cheese, corn, and apples.\" Only the ones on the third page have a prayer of connoting a residential development.\n\n"
    },
    {
      "time": "10 Jun 2004 — 4:41pm",
      "content": "Scott I like #2. I feel with added lines/graphics/curves this has the most potential (what typeface is it?). 2 adds the most color and interest with thicks and thins.\n\n"
    },
    {
      "time": "10 Jun 2004 — 9:38pm",
      "content": "Hi Scott,   \n   \nOh man, can I relate to this! Its a tall order creating something appealing based on a mirage that has nothing to do with anything. I've done more than my fair share of these new housing development brochures. Two months ago I did one called Vintage Ranch. Predictably, it wound up having a nostalgic barn thing happening. The logo was modeled after antiquated fruit packing lables. All in all it worked out fine, but everyone knows they are being sold a bill of goods when they are selecting Floorplan 4 with the \"spanish\" detailing package.   \n   \nAll that aside, I agree that what you've got going in #2 has the most potential. It works well with the weather vane too (solid version). If you do decide to go with this, note the distortion/color issue from stretching the W (R looks ok).   \n   \nDo the flooplans have names?   \nIf so would you share them with us, just for laughs. :-)   \nThey might also give you imagery ideas.   \n   \nCheers,   \nRandy\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:34am",
      "content": "Hi Scott, gotta hand it to you...you did find some beautiful imagery of tractors. But I agree with Steve in that it says farm products rather than luxury homes. And I'm not sure the bucolic charm from the photos would translate into the stone or wood applications. The weather vane is working. Have you considered having the name as part of the weather vane itself? (W for West W for Winsor)Especially on the next to last design where the letters are right reading. It might be tricky at the crossover point, but it could be worth the exploration. Also what kind of architectural style will the buildings be following? Is there any inspiration that could be pulled from that?\n\n"
    },
    {
      "time": "11 Jun 2004 — 12:32pm",
      "content": "For some reason I picture cows laying down.\n\n"
    },
    {
      "time": "11 Jun 2004 — 4:19pm",
      "content": "David, sorry for not addressing your question earlier, which Kirsten has posed again. Get this\n\n"
    },
    {
      "time": "16 Jun 2004 — 1:27pm",
      "content": "Well wouldn't ya know it. I included the staple cliche background watermark image with the widely kerned type and my client was all over it. Meanwhile, all you typophiles unanimously (except for Hrant) pointed me toward the stacked \"marlboro\" concept.   \n   \nBelow are the two concepts that my client currently has on the table. I have offered to pursue a third direction (as a strategic maneuver to pull his attention away from his current favorite) which is Kirsten's recommended concept, but right now I am waiting for a response.   \n   \n ![Windsor logos2](http://web.archive.org/web/20131108003006im_/http:/www.typophile.com/forums/messages/29/38465.jpg)   \n   \n   \n ![Windsor logos1](http://web.archive.org/web/20131108003006im_/http:/www.typophile.com/forums/messages/29/38466.jpg)   \n   \nHmmm\n\n"
    },
    {
      "time": "16 Jun 2004 — 2:09pm",
      "content": "I like them both, and I like the colors.   \n   \nWhat I think helps tie the image and the type together on the first design is that the letters in the weather vane and the Windsor name are the same font. Did you try using the condensed slab characters for the NSEW letters on the second design?   \n   \nWhat I believe adds to the \"Marlboro\" look of the second design is the large W and R. What if the letters were one size? but then FARMS might need to be re-thought since it would no longer tuck in. Hmm, perhaps if FARMS were set as wide as WINSOR it might make the type block appear to be the coupola the weather vane is attached to. Then agin it might look too heavy.\n\n"
    },
    {
      "time": "17 Jun 2004 — 10:31am",
      "content": "Scott,   \n   \nI think you're coming on pretty strong with #2.   \nI dont like the backwards cock or the inverted letters. Am I missing the point on that? Is this a backwards community? I tend to read the cock looking south as forward. In image 2 he is mooning me. Farms seems small under the towering Marlboro windsor.   \n   \nI like 1. If the community has a newsletter,   \nthe vane could read NEWS.   \n   \nAndrew\n\n"
    },
    {
      "time": "17 Jun 2004 — 10:57am",
      "content": "The top version could work but considering the potential to engrave the logo you will run into difficulties with the R touching the weather vane post. I also think the bottom version could work but only as a typographic solution sans the weathervane. Consider wood type style ornaments for the bottom version if you feel the need to stylize it a bit more.\n\n"
    },
    {
      "time": "17 Jun 2004 — 11:58am",
      "content": ""
    },
    {
      "time": "20 Jul 2004 — 7:05pm",
      "content": "Thank you all for your assistance in making this logo respectable. This PDF is a very general/vague identity guide for my client (probably still more than they'll use).   \n   \nMahalo!\n\n<!--attachment: WindsorIdentity_Standards-41229.pdf*mime_pdf.gif*application/pdf*191.8*Windsor+Guide*WindsorIdentity_Standards%2epdf --><!--attachment: WindsorIdentity_Standards-41229.pdf*mime_pdf.gif*application/pdf*191.8*Windsor+Guide*WindsorIdentity_Standards%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131108003006im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Windsor Guide<br><a href=\"http://web.archive.org/web/20131108003006/http:/www.typophile.com/forums/messages/29/WindsorIdentity_Standards-41229.pdf\" target=\"_blank\"><b>WindsorIdentity_Standards.pdf</b></a> (191.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "20 Jul 2004 — 7:45pm",
      "content": "looks great Scott!\n\n"
    },
    {
      "time": "21 Jul 2004 — 7:42am",
      "content": "LOL - I am currently going through a similar situation with a bunch of patio homes called Carrington Greene. We actually have input into street names too. I have a small but vocal rally for Alexis Way, Blake Court and Crystal Boulevard... just too dang funny! I think I will post where I am so far with that. Its really funny because the agent who sells them likes one logo, the owner likes another and the owner's wife likes the third one! Where do I keep finding these people?!?!   \n   \nall kidding aside, scott - I think its a very nice identity and I especially think you have presented it well in your standards manual I hope you can post a photo of the entryway when its all done to see how it works as 3-d elements. I am currently also working with a shopping mall and we are having \"negotiations\" about how the logo will be on signage.\n\n"
    },
    {
      "time": "23 Jul 2004 — 4:49pm",
      "content": "Work is overall very nice. I however do not like the tall typeface. I am immediatly reminded of cigarette packaging. I can't recall what brand uses a similar face but regardless it is in my opinion the least attractive choice of font, based on the choices presented in the earlier posts. The illustration is in my opinion superb. Colors are good, but again, the typeface should be changed.\n\n"
    },
    {
      "time": "29 Jul 2004 — 4:23pm",
      "content": "Ole: I find your distaste for the typeface to be interesting. To be honest, it wasn't my first choice either, but the unanimous posts in favor of it (besides you and Hrant) persuaded me to go with it.   \n   \nThis association with cigarette packaging is interesting, as I am about as anti-cigarette as one gets. I did associate the Marlboro logo with this, but that didn't bother me too much because the words were distinctively different. After giving it more thought, however, I remembered the Winston logo, which is too close for comfort. Unfortunately, the logo is already in application.   \n   \nHopefully, the fact that Utah is one of the most smoke free states in the US (location of development) is an indication that most of the target market isn't as familiar with Smoking brands as the rest of us\n\n"
    },
    {
      "time": "10 Jun 2004 — 10:44am",
      "content": "scott, do you think they'll be landscaping? and is a requirement for the project that the signage/logo/identity be farm-like?\n\n"
    },
    {
      "time": "17 Jun 2004 — 10:46am",
      "content": "Scott, I think the bottom of the two makes more of a statement. The type is more architectural and strong. The only thing I wonder is if you could alter the cap W to be a little more open, the bottom legs are kinda heavy, they don't balance out with the cap R which feels lighter. Not 100% positive, but it seems that most housing developments I've noticed seem to be trying to be posh or elegant ... we're just too close to mountains. Exclusive can't be stated in more ways than just white space and thin serifs.   \n   \n ![:-)](http://web.archive.org/web/20131108003006im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI should add that it doesn't mean that there are posh or elegant people here, it just means that it really doesn't fit the landscape.\n\n"
    },
    {
      "time": "17 Jun 2004 — 10:49am",
      "content": "I meant exclusive CAN be stated ....\n\n"
    },
    {
      "time": "29 Jul 2004 — 4:30pm",
      "content": "I wouldn't worry about it Scott. I really believe that your assumption will hold true. Isn't it in Utah County? The surrounds and the application will serve to further dissuade association with cigarettes.   \n   \n:^)   \n   \nMy Utah County 2\n\n"
    }
  ]
}
