{
  "id": "51522",
  "title": "Where will I find this \"fountain of free fonts\".",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I have heard many men speak of a fountain from which the free fonts come?  \nI search for many time the Optimos and try also the FontShopping but no such luck with NO big bucks or Visa card.\n\nI thank many people in advance for these helpful comments.\n\nYours sincerily,  \nGui Yong\n\n",
  "author": "guiyong",
  "time": "10 Nov 2008 — 5:45pm",
  "uid": "35223",
  "comments": [
    {
      "time": "10 Nov 2008 — 6:22pm",
      "content": "The fountain is in a secret cave near the peak of the highest mountain in Patagonia. Only the pure of heart may enter. Oh, and you have to have the secret word.\n\n"
    },
    {
      "time": "10 Nov 2008 — 6:39pm",
      "content": "The fountain isn't here nor can it bound found by starting here. But there are some foundries who have some fonts with free (or non-commercial) licenses and those are included in the [FAQ Free Fonts](http://web.archive.org/web/20131012173648/http:/typophile.com/node/44453) in the Typowiki.\n\n"
    },
    {
      "time": "10 Nov 2008 — 7:04pm",
      "content": "[http://maps.google.com/maps?ie=UTF-8&oe=UTF-8&sourceid=navclient&gfns=1&...](http://web.archive.org/web/20131012173648/http:/maps.google.com/maps?ie=UTF-8&oe=UTF-8&sourceid=navclient&gfns=1&q=fountain%20of%20free%20fonts&um=1&sa=N&tab=wl \"http://maps.google.com/maps?ie=UTF-8&oe=UTF-8&sourceid=navclient&gfns=1&q=fountain%20of%20free%20fonts&um=1&sa=N&tab=wl\")\n\n"
    },
    {
      "time": "10 Nov 2008 — 7:09pm",
      "content": "It is directly adjacent to the fountain of youth.\n\n"
    },
    {
      "time": "10 Nov 2008 — 8:29pm",
      "content": "I am pretty sure that I saw it in the vicinity of Lost Springs, Wyoming...\n\n[http://lundestudio.com/photos/lost-springs-06072006-1](http://web.archive.org/web/20131012173648/http:/lundestudio.com/photos/lost-springs-06072006-1)\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    },
    {
      "time": "11 Nov 2008 — 1:29am",
      "content": "[Free fonts from the Fountain](http://web.archive.org/web/20131012173648/http:/www.fountain.nu/catalogue/probono.asp)\n\n"
    },
    {
      "time": "11 Nov 2008 — 1:30am",
      "content": "Have you tried looking in your shoe? When I can't find stuff I always try my shoes…\n\n"
    },
    {
      "time": "11 Nov 2008 — 1:59am",
      "content": "Man, what shoe size are you living in?\n\n"
    },
    {
      "time": "11 Nov 2008 — 8:26am",
      "content": "Gui, don’t let these snots hold out on you. You can get awesome free fonts at [2002 Honest Fonts](http://web.archive.org/web/20131012173648/http:/tinyurl.com/yowplg).\n\n"
    },
    {
      "time": "11 Nov 2008 — 9:53am",
      "content": "Damn it James, why did you give away our Fountian of free fonts!! Atleast he'll never find our _pot of golden free fonts_ at the end of the Dafont rainbow!\n\n"
    },
    {
      "time": "11 Nov 2008 — 12:12pm",
      "content": "lol @ <cite>Have you tried looking in your shoe? When I can’t find stuff I always try my shoes…</cite>\n\n"
    },
    {
      "time": "11 Nov 2008 — 6:27pm",
      "content": "Greetings to many people for your plentiful comments. But unfortunatly I still search for the fountain from which many free font such as the Optimo Pharma and please all of the works of Erik Spiekermann do flow, because he is a stingy man....\n\n"
    },
    {
      "time": "11 Nov 2008 — 10:59pm",
      "content": "Next time there's a troll-feeding session can someone IM me? ;-)\n\nThx, Si\n\n"
    },
    {
      "time": "12 Nov 2008 — 2:57am",
      "content": "arrghh!!!!\n\n"
    },
    {
      "time": "12 Nov 2008 — 6:32am",
      "content": "original free fonts also here [http://www.fontomas.ru/dload.htm](http://web.archive.org/web/20131012173648/http:/www.fontomas.ru/dload.htm \"http://www.fontomas.ru/dload.htm\")\n\n"
    },
    {
      "time": "12 Nov 2008 — 10:19am",
      "content": "_because he is a stingy man_\n\nThis is hillarious. But maybe I just don't get it. Guiyong, you are joking, right?\n\n"
    },
    {
      "time": "12 Nov 2008 — 12:18pm",
      "content": "I've often wondered how a person looking for a good fishing spot manages to miss all the docks around nearly every corner of the globe only to end up neck-deep and gushing blood in an out-of-the-way shark tank.\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:15pm",
      "content": "Sergiy you should add that to the FAQ Free page.\n\n"
    },
    {
      "time": "12 Nov 2008 — 10:19pm",
      "content": "I think there's a font site called tubgirl or something with a fountain of something. Maybe fonts.\n\n"
    },
    {
      "time": "13 Nov 2008 — 2:00pm",
      "content": "All the fonts you will ever need can be found [here](http://web.archive.org/web/20131012173648/http:/www.somethingawful.com/fakesa/fontsite/)\n\nConfusious says \"you get what you pay for\"\n\n"
    },
    {
      "time": "13 Nov 2008 — 3:28pm",
      "content": "<cite>I think there’s a font site called tubgirl or something with a fountain of something. Maybe fonts.</cite>\n\nCome now, Ray, that's just mean.\n\n"
    },
    {
      "time": "13 Nov 2008 — 6:31pm",
      "content": "No kidding - incredibly mean thing to post, Ray.\n\nI don't get it.\n\n"
    },
    {
      "time": "14 Nov 2008 — 7:53am",
      "content": "Yes. I don't think Ray's reference to Tub Girl is mean but I think most people would agree it is in rather poor taste. Not merely \"poor\" taste but \"rather poor\" taste, actually.\n\nRay, please post an apology.\n\nThank you.\n\nj a m e s\n\n"
    },
    {
      "time": "14 Nov 2008 — 7:56am",
      "content": "oh hai. free fnots?/ :D\n\n"
    },
    {
      "time": "14 Nov 2008 — 2:35pm",
      "content": "@Sergiy: Nice work on Amoebia… Are you in touch with Jens?  \nYour \"Liberator\" also looks like a nice work. Why did you choose the name \"Liberator\"? Is this something historically related to England?\n\n"
    },
    {
      "time": "14 Nov 2008 — 4:03pm",
      "content": "google typeoasis, typeart .\n\n"
    },
    {
      "time": "14 Nov 2008 — 5:17pm",
      "content": "Sorry, I don’t get the dis with the tubgirl thing.\n\n"
    },
    {
      "time": "14 Nov 2008 — 6:21pm",
      "content": "Hi all. I am sorry about that. Bad move.\n\n"
    },
    {
      "time": "14 Nov 2008 — 6:28pm",
      "content": "It went over my head anyway. :op\n\n"
    },
    {
      "time": "14 Nov 2008 — 7:58pm",
      "content": "This thread is pure win.\n\n"
    },
    {
      "time": "14 Nov 2008 — 10:44pm",
      "content": "H, SuperUltraFabulous:\n\nGo to Google search for \"tub girl\" under image- make sure your \"moderation sateserach\" is off, and you shall find it...It has got nothing to do with font though...\n\nBTW- don't look at it if you haven't had your dinner.\n\n"
    },
    {
      "time": "14 Nov 2008 — 11:02pm",
      "content": "Sory, Typo- Moderate SafeSearch\n\n"
    },
    {
      "time": "15 Nov 2008 — 6:41am",
      "content": "OK, that was THE most disgusting thing I've ever seen in my life. Allow me then to make a minor change to weng's above warning:\n\nBTW - don't look at it EVER, before dinner, after dinner, pre-snack, during 4 o'clock tea. Trust me - even the most curious people will come back and say \"I wish I hadn't been so curious.\"\n\nRay I am concerned over how you knew about this in the first place. Wait a minute ... now I know about it too. Oh man, what a crappy day this has been. Literally.\n\n"
    },
    {
      "time": "15 Nov 2008 — 9:16am",
      "content": "ohhhhh.... ewwww.\n\nOkay, I won’t look at what ever that is.\n\n"
    },
    {
      "time": "15 Nov 2008 — 8:11pm",
      "content": "Being 38 and a foreigner I often have to consult [http://www.urbandictionary.com/](http://web.archive.org/web/20131012173648/http:/www.urbandictionary.com/ \"http://www.urbandictionary.com/\") to understand what the \"youths\" are talking about. Definitely \"safer\" than google image search with the filters turned off.\n\n"
    },
    {
      "time": "16 Nov 2008 — 7:11am",
      "content": "It is indeed the most disgusting thing I have ever came across- I didn't know what Typodermic was talking about and so many reacted, so I decided to Googled it... I for one regret like anything after seeing that piece... (at the same time, thank God for Google- nothing is impossible...)\n\nCuriosity does kill the cat... That's the problem with visuals. Once they get into your mind it stays forever, and make such a lasting impression that no clever software on earth can thrash it...\n\nAs the old saying goes, \"The eye is the light of the body. If your eye is good, your whole body would be full of light.\"\n\nIt's wise to guard what you see...\n\nAs Graphic Designer, I am sometime thrilled by the fact that I am being entrusted with the giftedness of handling one of the most powerful thing on earth- the VISUALS- it can either \"break\" or \"build\"- just look at all the propaganda posters during the WWII, or the woodblocks of communist China during the cold war - those are great designs to be admired, at the same time it brings chill down my spine when I think of how many millions of young people have lost their lives as the result of these posters...\n\nIn one of the interviews, Bill Gates confessed that he discouraged his sons from playing too much computer games for he sees the damages it can bring to them... Even the guy realised he have created a moster that can be untamable...\n\n"
    },
    {
      "time": "16 Nov 2008 — 7:47am",
      "content": "I agree with you, weng: because I just had to know what the deal was, I now feel as though a small portion of my mind has been permanently disabled, requiring me to quarantine it forever by covering it with a bunch of those biohazard-logo stickers. Isn't there some kind of pharmaceutical assistance to help curb one's curiousity? Because if there is and you have some, please - TAKE IT NOW before anyone else gets hurt.\n\n"
    },
    {
      "time": "16 Nov 2008 — 3:44pm",
      "content": "Best advertising tagline there is: \"DON'T LOOK\". Sure to get tons of hits.  \nHuman nature, or what?\n\nWhat was that about Spiekermann -- you're miffed because you cannot find his fonts for free? Perhaps he doesn't _want_ them to be free. He _has_ the last word to say about that, you know.\n\nTalking about human nature, I decided to check the spelling of his name. \"Spiekerman\" gets 84,100 google points, while \"Spiekermann\" only gets 70,000. Funny thing is, even [book stores](http://web.archive.org/web/20131012173648/http:/www.computerboek.nl/boek/9780201703399/stop_stealing_sheep_find_out_how_type_works_second_edition_erik_spiekerman) get it wrong. If you zoom in on the book cover you see it's spelled right there.\n\n"
    },
    {
      "time": "2 Dec 2008 — 3:31pm",
      "content": "You’d be surprised how many people get my first name wrong a well. I suppose graphic designers don’t look very closely. Nor do type designers.  \nSeems that most people do not read what’s there but what they presume to be there. Which, in fact, is how we manage to read large amounts of text in the first place. Just doesn’t work for proper names.\n\n"
    },
    {
      "time": "2 Dec 2008 — 3:54pm",
      "content": "However, I suspect that a significant proportion of those who got it wrong read a mis-spelling correctly.\n\n"
    },
    {
      "time": "8 Dec 2008 — 9:48am",
      "content": "But Spiekermann you are proud owner of these more than 100,000 ‘cool fonts’ and you will not make sharing or swaps with any of them :(\n\n(except this FF Dingbests? there are not even ABCs in this??)\n\nYou are a very unkind mann! Erik you must learn many lessons from this man Jos Buivenga, owner of unfortunatly only 9 ‘cool fonts’ but he will offer all of them for swappings and sharings at this festive season of givings. If you do not show thought for these people not lucky to have 100,000 ‘cool fonts’ you will find no fullfilments and happiness.\n\nMerry christmas greetings and hope,  \nGui Yong\n\n"
    },
    {
      "time": "8 Dec 2008 — 12:28pm",
      "content": "Erik doesn't own those fonts.  \nHe has licensed them from hundreds of starving type designers such as myself.  \nIf he gave those fonts away for free, I would have no money to buy medicine for my sick children, and Tiny Tim would die.  \nGod Bless you, Herr Spiekermann!\n\n"
    },
    {
      "time": "8 Dec 2008 — 9:14pm",
      "content": "Guiyong - are you serious? geez, what is it with people expecting everything for free?\n\n"
    },
    {
      "time": "9 Dec 2008 — 3:29am",
      "content": "Guiyong - it may surprise you to learn that some people want to earn money from what they do. It's called working for a living. You've come to the wrong place with your stupidity. Now shut up and go away.\n\nWhy do you need 100,000 ‘cool fonts’ anyway - that's just greedy.\n\nNick Cooke\n\n"
    },
    {
      "time": "9 Dec 2008 — 3:37am",
      "content": "There are not 100,000 cool fonts anyway. I'm sure that the world has over 100,000 fonts. I know that the world has cool fonts. But 100,000 cool fonts? I think not.\n\n"
    },
    {
      "time": "9 Dec 2008 — 5:15am",
      "content": "A good designer doesn't need 100,000 fonts! I have to get by with a mere 5,000 -- and even then, I don't use all of them every day.\n\n"
    },
    {
      "time": "9 Dec 2008 — 5:54am",
      "content": "Wow, I can't imagine how you can get by with only 5000 fonts O\\_O\n\n"
    },
    {
      "time": "9 Dec 2008 — 5:59am",
      "content": "But why does Erik need this 100,000 fonts? He is Deutsch Design Meister right?\n\nUnfortunatly for my plentiful works I make ‘variety styles’ and for this I need numerous fonts.\n\n"
    },
    {
      "time": "9 Dec 2008 — 6:12am",
      "content": "(My god, what is this...)\n\n"
    },
    {
      "time": "9 Dec 2008 — 7:29am",
      "content": "Just keep feeding the troll, guys. I’m sure he needs the snacks.\n\n"
    }
  ]
}
