{
  "id": "51544",
  "title": "A iii? What does that mean?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Does someone know what \"A iii\" or \"A iiii\" means? This is often printed on the right side below the text in books of the 15th/16th century.\n\n ![](http://web.archive.org/web/20131020175231im_/http:/typophile.com/files/ald03_4116.jpg)\n\n",
  "author": "eneat",
  "time": "11 Nov 2008 — 8:26am",
  "uid": "39311",
  "comments": [
    {
      "time": "11 Nov 2008 — 8:46am",
      "content": "It means '3'.\n\nRoman numerals are often set in lowercase.\n\nUppercase translation would be 'III'.\n\n/// Jacques\n\n"
    },
    {
      "time": "11 Nov 2008 — 9:10am",
      "content": "Ahhhh, ok, thanks. And the \"A\"?\n\n"
    },
    {
      "time": "11 Nov 2008 — 3:13pm",
      "content": "The A might have been the signal for the first signature.\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:36am",
      "content": "I also thought someting like that, but I saw different book pages, and signatures, but there was everytime an A…\n\n"
    },
    {
      "time": "13 Nov 2008 — 12:10am",
      "content": "Do you have the whole book ?  \nAnd do they use more characters further on ?\n\n/// Jacques\n\n"
    },
    {
      "time": "13 Nov 2008 — 12:50am",
      "content": "Have you found that they can't be page numbers? Carmina 4 and 5 would be around page 3 of an edition of Catullus in this layout.\n\n"
    },
    {
      "time": "13 Nov 2008 — 2:17am",
      "content": "How about third leaf of first signature of Aldus' edition of Catullus, Tibullus, and Propertius?\n\n"
    },
    {
      "time": "13 Nov 2008 — 5:39am",
      "content": "I found also other pages, and they use more characters, so it's probably like you said \"A\" is the signature, and \"iii\" are lowercase roman numbers for the leafs. Thanks for your help.\n\n"
    },
    {
      "time": "13 Nov 2008 — 8:15am",
      "content": "A. is an abreviation for the Latin word Ante-whatever, signifying the part of a book that comes before the main text. We Dutch call it ‘voorwerk’ — before work.  \niii is a pag number, to be followed by iv, v, vi etc.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "13 Nov 2008 — 1:47pm",
      "content": "A iii ist the Signature.\n\nA signature consists almost always of a letter (or a combination of letters) and a numbering in lc roman numbers. Its function is\n\na) to help the book-binder to fold the printed sheet into a quire (and so to ensure the correct sequence of the leaves of a quire) – hence the numbers\n\nb) to help the binder to arrange the folded quires in the correct sequence in the order of the alphabet– hence the letters\n\nand so to arrange the whole book in the required order even if the binder was not able to read or understand the text. This was necessary because in early prints pagination was almost unknown and so many books were missbound. (Books from the 15th to 18th century were usually sold as unbound sheets and binding was left to the buyer).\n\nWolfgang\n\n"
    },
    {
      "time": "13 Nov 2008 — 9:47pm",
      "content": "For those who want to see a few more pages, to get the context:  \n [http://www.uni-mannheim.de/mateo/desbillons/aldus.html](http://web.archive.org/web/20131020175231/http:/www.uni-mannheim.de/mateo/desbillons/aldus.html)\n\nThe pagination of the volume is outlined in this library record:  \n [http://catalogue.nla.gov.au/Record/407399](http://web.archive.org/web/20131020175231/http:/catalogue.nla.gov.au/Record/407399)\n\n"
    },
    {
      "time": "14 Nov 2008 — 1:27am",
      "content": "Thanks a lot, this was really helpfull!\n\n"
    },
    {
      "time": "14 Nov 2008 — 6:06am",
      "content": "Signature marks, also called collation marks, such as the one shown above persisted in a variety of forms even into the early 20th century. As mechanization increased they became rarer.\n\nIf you work in the book production racket these days, you will be familiar with the current form of signature marks. If you look at a pile of F&Gs (folded and gathered signatures), you'll see black marks printed on the fold of each signature, stepping down the spine in order. As each book's signatures are gathered, these marks should always be in the same order. If they are out of order, an \"electronic eye\" sees this and shuts down the binding line. As recently as ten years ago, it was till regrettably common to find the occasional book with sigs out of order, or with two of the same sig, or with missing sigs. That has become far less common thanks to this system.\n\nThese new marks perform the same function as the collation marks shown in the first post and explained above by Wolfgang.\n\npowers\n\n"
    },
    {
      "time": "14 Nov 2008 — 11:02am",
      "content": "That was interesting! Thanks, Will.  \nF\n\n"
    }
  ]
}
