{
  "id": "51562",
  "title": "Brubecks Cube Italic",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "okay, here's what I'm working on... It's a new Italic version of my popular [Brubecks Cube](http://web.archive.org/web/20150317180428/http:/www.myfonts.com/fonts/chank/brubecks-cube/) font.\n\nI want it to be sensible, so I slanted it to the right, to be safe. That's the easy part.\n\nNow I can't decide where the shadow sides should fall.\n\nWhen the shadow-sides are on the bottom and right it makes all the letter look like they were cut out of sheetcake. Like a bunch of typographic cake laid out on the table in front of me. Mmmm. Tasty. But maybe it's a bit too safe. Not interesting enough.\n\n ![](http://web.archive.org/web/20150317180428im_/http:/typophile.com/files/15456_brubeck_ital1_5677.gif)\n  \nSo I did a second drawing, letting the shadows fall on the top and left instead. Now the letters don't look like cake anymore. They look a bit like buildings, like I'm flying in on a helicopter. Except the italicization makes it look like all the buildings are falling over. Oh no!  \n\n ![](http://web.archive.org/web/20150317180428im_/http:/typophile.com/files/15458_brubeck_ital2_3780.gif)\n\nShould it be shadows on top, or shadows on bottom?\n\n-chank\n\n",
  "author": "chank",
  "time": "11 Nov 2008 — 2:47pm",
  "uid": "1365",
  "comments": [
    {
      "time": "11 Nov 2008 — 4:56pm",
      "content": "With the slant - shadows at bottom seem better to my eye\n\n"
    },
    {
      "time": "11 Nov 2008 — 8:19pm",
      "content": "While I appreciate the second set of drawings I have always felt shadows should reflect the direction of design. Upper left to lower right. So as the sun shines from from the upper left the shadows would fall low and right.\n\nBut there again I am \"old and in the way\" (let's see which upstarts get that one) and the kids are doing whatever the hell they want to : ) And the second set would serve its own purpose as a variation.\n\nYou ain't no spring chicken either Chank, so go for broke. Double :: ))\n\nMichael\n\n"
    },
    {
      "time": "11 Nov 2008 — 9:30pm",
      "content": "#1 seems more natural to me too, but I can see #2 working too, and perhaps even better, on posters that might be hung vertically at eye-height or higher.\n\n"
    },
    {
      "time": "12 Nov 2008 — 12:48am",
      "content": "@Michael Clark:\n\nWhat, ho! A bluegrass fan lurking here? May such wonders never cease.\n\nBest,  \nRichard\n\n"
    },
    {
      "time": "12 Nov 2008 — 3:34am",
      "content": "Richard... have you learned to play Rocky Top on a bouzouki yet?\n\nMichael\n\n"
    },
    {
      "time": "12 Dec 2008 — 5:28am",
      "content": "okay, here's another sketch.  \nthis one's about 10 ft wide and 2 ft high.  \nit'll be on display in the neighborhood here in January I reckon.\n\n ![](http://web.archive.org/web/20150317180428im_/http:/typophile.com/files/15505_Obama_Hooray_5931.jpg)\n\nalso, the font is all done now. I opted for the more safe  \nand traditional shadows falling to the bottom right,  \nbut I think there might be another variation coming  \nsome day in the future.\n\nBrubecks Cube Italic, aka Brubecks Rhomboid is here:  \n [http://www.chank.com/font\\_detail.php?sku=5685](http://web.archive.org/web/20150317180428/http:/www.chank.com/font_detail.php?sku=5685 \"http://www.chank.com/font\\_detail.php?sku=5685\")\n\n-chank\n\n"
    }
  ]
}
