{
  "id": "51577",
  "title": "\"How important, do you feel , is the education of the grid?\"",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Is the study of grid structures essential in the education of a graphic designer?\n\n",
  "author": "N-Jay-G",
  "time": "12 Nov 2008 — 2:34am",
  "uid": "39545",
  "comments": [
    {
      "time": "12 Nov 2008 — 7:02am",
      "content": "Only if the book is closed it is one page, isn't it ?\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:28pm",
      "content": "I consider understanding how to use a grid very important to graphic design education. Maybe I'm old school, but I believe you must understand the rules in order to understand how to break them.\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:39pm",
      "content": "I see you've posted this same question 4 times in different areas. You will never have good, fluid conversation by doing this.\n\n"
    },
    {
      "time": "11 Dec 2008 — 10:42pm",
      "content": "I agree Miss Tiffany. But I don't think it is old school.  \n@ N-Jay-G: Have a look at this website: [http://www.markboulton.co.uk/journal/comments/simple\\_steps\\_to\\_designing\\_...](http://web.archive.org/web/20150416044123/http:/www.markboulton.co.uk/journal/comments/simple_steps_to_designing_grids/ \"http://www.markboulton.co.uk/journal/comments/simple\\_steps\\_to\\_designing\\_grids/\")\n\nWe all design for an audience. We should at least.  \nIn normal circumstances you want to aid the reader in reading the text.  \nBy giving this text (and other content) in small readible chuncks, you will help the reader.\n\nUsing a grid does the same. A well designed grid will present the content in a pleasant way and also presents a structure, an order in that content. This troughout a complete book or magazine.\n\nBut even when you are designing a flyer, your design could benefit from a well designed grid since a well designed grid is also a pleasant grid.\n\nIt is up to you to design a grid which will be true for your design style.\n\n"
    },
    {
      "time": "17 Dec 2008 — 7:45am",
      "content": "Extremely.\n\nI wish this site was around when I was in school - [http://www.thegridsystem.org/](http://web.archive.org/web/20150416044123/http:/www.thegridsystem.org/ \"http://www.thegridsystem.org/\")\n\n_\"If you hit a wrong note, it’s the next note that you play that makes it good or bad\" - Miles Davis_\n\n"
    },
    {
      "time": "17 Dec 2008 — 7:32pm",
      "content": "Yes.\n\nBut, grids themselves and how you use them are 2 different things, and both are important. I think most of the time the grid should be invisible to the viewer, but it can be used in a more dominant way to great effect too.\n\nIn the 90's grid-based design had a bit of a falling out thanks to David Carson, and the hordes of imitators, but thankfully grids, simplicity and logic are, and have been, making a comeback.\n\n"
    },
    {
      "time": "18 Dec 2008 — 10:04am",
      "content": "Grid systems and use of them are an essential part of design education. However, it should carry a small role in comparison to concept development. The message being communicated often decides the value of the final piece.\n\n"
    }
  ]
}
