{
  "id": "51588",
  "title": "Swift OT with SC & OSF",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Yes, that's what I've been looking for.  \nI've been working with an old PS version of Gerard Ungers Swift, but we wanted the OpenType version for our client, and so we went a-looking. But I can't find one that includes both small caps and old style figures. I've found the small caps in the PRO version but the OS figures are impossible to find. Or I could be going blind.  \nCould anyone of you with better eyesight and/or stamina direct me towards a proper version?\n\nIt would be appreciated.\n\nYours,\n\nƒ\n\n",
  "author": "fredo",
  "time": "12 Nov 2008 — 6:21am",
  "uid": "7230",
  "comments": [
    {
      "time": "12 Nov 2008 — 6:44am",
      "content": "Try Gerard Unger's website –  \n [http://www.gerardunger.com/fontstore/store-swift-form.html](http://web.archive.org/web/20131014032428/http:/www.gerardunger.com/fontstore/store-swift-form.html \"http://www.gerardunger.com/fontstore/store-swift-form.html\")\n\n"
    },
    {
      "time": "12 Nov 2008 — 8:09am",
      "content": "I've been there, but it's not really clear which glyphs are in his OT fonts. I could of course mail him, but I was hoping someone here knew before I bothered him.  \nThanks anyway.\n\nƒ\n\n"
    },
    {
      "time": "12 Nov 2008 — 11:01am",
      "content": "Check the character set in the Lino Complete OT.\n\nNope, wrongo. Even the Swift 2.0 doesn’t have the OSF and SC in the same font.\n\n"
    },
    {
      "time": "12 Nov 2008 — 2:26pm",
      "content": "Any reason why Lino's version doesn't have SC and OSF, Dan?\n\n"
    },
    {
      "time": "13 Nov 2008 — 12:25am",
      "content": "That is a good question! Unfortunately, I do not know the answer. Swift was originally produced at Hell, if I recall, which became part of Linotype in 1989. But by that time, there were may or may not have been other legitimate versions of Swift in distribution. I suspect that, as was the case with some other faces during their conversion to OpenType, Linotype may not have had its own SC and OsF font data available. If this were the case, the only way to include them in the OT fonts might have been to redraw the SC and OsFs glyphs directly. What goes into a legacy OpenType font is not as simple a decision as one might wish it to be, and it depends on a number of factors in the air at the time of the font's conversion.\n\nOn the other hand, I feel bad that we don't have an off-the-shelf solution for Fredrik, which is why I suggested Gerard's website. But that does seem to just offer PostScript and TT Swift 2.0 fonts. I'm sorry that I cannot be of more help :(\n\n"
    },
    {
      "time": "13 Nov 2008 — 7:52am",
      "content": "Oh well.  \nAs time conspires against me I'll have to settle for the current Swift OpenType option – the lesser alternative I'm afraid.  \nAt least there's a lesson to be learned here.\n\n(Dan, for our next client I'll make sure to get FF Chambers, I believe you'd like that)\n\n"
    },
    {
      "time": "13 Nov 2008 — 8:36am",
      "content": "Well, there are a couple of Linotype fonts that I like, too ;-)\n\nBut yes, as I wrote on my blog, I am a big fan of FF Chambers Sans… and all of Verena's other work, too.\n\n"
    }
  ]
}
