{
  "id": "51605",
  "title": "Burn my poster",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Well not burn, but I'd like some critique since my teacher seems to have a hard time giving some constructive argumentation. Isn't that what a teacher is supposed to do?\n\nAnyways...  \nThe assignment was to design a foldable poster for a fictional congress. The congress is about the expansion of urban areas and the problems of over-population in some areas. This is all taking place in the Netherlands, which is pretty crowded.  \nNaturally the text is in Dutch so I'll give a quick translation might that be of importance. I was hoping the image would speak for itself.\n\nSPACE  \nSPATIAL DESIGN(?)IN THE NETHERLANDS  \n22-25 JANUARI 2009  \nRAI(congress centre in Amsterdam)\n\n ![](http://web.archive.org/web/20130824195650im_/http:/typophile.com/files/RUIMTE1_6268.jpg)\n\nI've made the type myself and played with it a bit. The edges are supossed to be a bit ragged and so is the smaller text.\n\n",
  "author": "NapoleJon",
  "time": "12 Nov 2008 — 5:03pm",
  "uid": "22081",
  "comments": [
    {
      "time": "12 Nov 2008 — 6:57pm",
      "content": "I'm a videogame programmer, but I am really into design. So, use that to take whatever I say however you want.\n\nI don't like the blank spots. I feel like this poster is crowded intentionally. Which is fine, except for the dead space in the middle right-side and towards the bottom.\n\nAlso, I don't speak Dutch, and without your explanation I wouldn't have any idea what this poster was about. What does it say about urban expansion? Could you have used the text or color to more effectively get the point across?\n\nChuck\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:32am",
      "content": "Hi,\n\nPlease don't burn your poster- if that was exactly what your lecturer asked you to do, or his/her response just made you wanted to do that. (ask him to go and burn himself in hell instead if he said so... :P )\n\nHere are some quick comments and suggestions- hope they are helpful to you:\n\nThe entire poster does communicate the message pretty clear. You may want to work on the \"crafting\" to improve the aesthetic.\n\nYour attempt of using hand drawn letters is a good solution to such a topic- you may like to try \"hand-cut\" instead. In that way you can achieve the effect of \"natural\" and the font would appear to be more confident and less \"wobbly\". (again, hand cut can be wobbly too- so it depends on your skill of creating a font ).\n\nPlease work on the structural/ anatomical design of the display type:\n\nExample- the upper part of \"R\" in \"RUIMTE\" seems to be longer and bigger than the lower part. A healthy \"R\" has the upper part slightly shorter than the lower part so that the \"head\" doesn't appear to be heavy. The \"M\" also seems to be too big/ wide... On the forth line of the headline, the \"N\" of \"Natherland\" is too big comparing to the rest of the letters and the rest seem to get \"squeezed\" towards the end...\n\nGreen is the right colour to used for the topic of environmental (some might considered it too \"safe\"- but better save than wrong.) The gradient effect also adds flavour to the green- better than flat background of green. So, that's good move...\n\nPlease work on the details, especially with your typography:\n\n1. Apply some basic typographic rules on your text, such as reducing the diversity of fonts- keep to one or two fonts, preferably from the same family. That would bring some \"quietness\" to balance of the already busy looking design.\n\n2. Perfecting your spacing. (remember, great graphic designer always pay attention to details and is prefectionist in this area )\n\n3. Introducing \"grid\" to organize your text.\n\n4. Intensify the angles and increse the contrast of each headlines \"zigzaging\" into each others, to create a greater sense of visual dynamic and playfulness.\n\nRight now the zigzag effect is \"neither here nor there\"- which make the headlines less confident and wobbly...\n\nThe second line of \"RUIMTELIJKE\" seems to suffer from \"optical illusion\" caused by the top and bottom lines, which made it appears not to be horizontally straight. Either give some space in between the lines or you might as well make the second line slant more obviously.\n\n(please view my attachments for a visual suggestions).\n\nThese are basic design fundamentals- your school should have taught you these. Start applying them. School is a good, safty ground for learning (and failing) Your client/ boss in future is not always that forgiving.\n\nWelcome to the real world and happy designing...\n\n(BTW- despite of being a practioner, I am also a lecturer...)\n\nweng\n\n ![](http://web.archive.org/web/20130824195650im_/http:/typophile.com/files/sample1_5864.jpg)\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:33am",
      "content": " ![](http://web.archive.org/web/20130824195650im_/http:/typophile.com/files/sample2_3536.jpg)\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:34am",
      "content": "Better sense of visual dynamic with zigzag typography design.\n\n ![](http://web.archive.org/web/20130824195650im_/http:/typophile.com/files/16112008_6307.jpg)\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:50pm",
      "content": "Since it supposed to be foldable, I would assume the poster still has value even when folded. Show the various folds to see what happens.\n\nChrisL\n\n"
    },
    {
      "time": "16 Nov 2008 — 10:25pm",
      "content": "sorry i missed out that one- yes, that's important point to consider. Thanks, chris...\n\n(this actually sounds like a fun project- they should have it on the \"Battle\"...)\n\n"
    },
    {
      "time": "16 Nov 2008 — 10:38pm",
      "content": "Sorry- the last sample posted is too big and should be vertical. Let me try again... Here you go- better.\n\n ![](http://web.archive.org/web/20130824195650im_/http:/typophile.com/files/16112008_4050.png)\n\n"
    },
    {
      "time": "17 Nov 2008 — 11:04am",
      "content": "Wow, thanks for the very useful response(s).\n\nWith the example of sans serif text in front of my nose, i can see why it's probably the better choice. Especially with something as neutral as univers to counter-balance the more extravagant type. I also think you may be right about the hand-cut thing. I thought i liked how the hand drawn type was wobly and and bit torn edged, but maybe it's a bit too much.\n\nAbout the fold... I haven't exactly kept that in mind while making this poster. Afterwards I tried out some different folds, but none are really good. I think I'm just gonna do it over with you're critique in mind.\n\nThanks again for all the help and your time. When i've tweaked it, i'll post a new example. This assignment isn't really running anymore so it could take a while.\n\n"
    },
    {
      "time": "18 Nov 2008 — 8:43pm",
      "content": "Cool- have fun.\n\nFeel free to post more of your works here in future. It's sometime refreshing to see what students have done.\n\nI happened to read from other post that Peter Verheul was your lecturer? Man, if I were you, I would \"squeeze\" the best out of him- get hold of him, buy him lunch and endless cup of coffees, visit his studio (with his permission, of course) and get him talk for hours on all his works. If you are good, you might even get to help up with some small jobs for him... I bet you would learn much better that way form a guy like that than sitting in the class room alone.\n\n(when you are doing that make sure your have your skype on visual for me- I like to sit in as well... :p)\n\n"
    },
    {
      "time": "19 Nov 2008 — 12:25am",
      "content": "haha, well, his coffee is free and he always brings his own lunchpack so i guess i'll have to think of somethin else to buy his attention. It's a shame i only see him once every two weeks. He's first and foremost a lecturer vor the type and media department at my school, while I'm studying graphic design and two classes require his attention.  \nHe does like what i'm doing so that's fun to hear. Right now we're working on our first complete typeface. I'm still in the sketching fase, but when I have something decent to show i will.\n\n"
    }
  ]
}
