{
  "id": "51601",
  "title": "Identity font for Dutch government",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The Dutch government contracted type designer Peter Verheul to design one coherent font style for all of its hundreds of sub-branches. The results, appropriately (yet unoriginally) called \"Rijksoverheid Serif\" and \"Rijksoverheid Sans\" (\"Govn't Serif, Sans\"), will be presented tomorrow.\n\nSome initial information can be found on the designer's website: [http://www.studiodumbar.com/main.php](http://web.archive.org/web/20150322042659/http:/www.studiodumbar.com/main.php \"http://www.studiodumbar.com/main.php\")\n\nNow, was it money well spent? The font samples look good -- but I'll have to await the next tax form before deciding \"I like it\".\n\n",
  "author": "Theunis de Jong",
  "time": "12 Nov 2008 — 2:20pm",
  "uid": "29994",
  "comments": [
    {
      "time": "12 Nov 2008 — 4:05pm",
      "content": "Ha, he's my teacher. I remember him showing some sketches, but I can't find the samples on the dumbar website.\n\n"
    },
    {
      "time": "12 Nov 2008 — 5:45pm",
      "content": "There are dream jobs, and then there is designing the identity of the Dutch government. Congrats to Studio Dumbar and Peter Verheul!\n\n"
    },
    {
      "time": "12 Nov 2008 — 5:46pm",
      "content": "Try [www.farhill.nl](http://web.archive.org/web/20150322042659/http:/www.farhill.nl/ \"www.farhill.nl\") -Peter Verheul's personal home page.\n\nyou'll see some samples there.\n\n"
    },
    {
      "time": "12 Nov 2008 — 6:38pm",
      "content": "Went to his site...\n\n\"American't.\" What the hell is that all about?\n\nMichael\n\n"
    },
    {
      "time": "13 Nov 2008 — 8:39am",
      "content": "I saw it on Peter's website yesterday. There was also an article in the Dutch newspaper NRC Handelsblad about it. It had a large high res abc image of the typefaces with it. The article itself was also set in the typefaces (normally typeset in Lexicon and Lexicon Headline).\n\nThe serif is reminiscent of Versa (which isn't a bad thing) and looks pretty neat in my opinion. It stood up perfectly to the newsprint (although NRC is a pretty high quality printed paper). The sans however, feels a bit awkward to me. I can't decide if I like it or not. It doesn't have as much character to it as the serif. The general style of the typefamily doesn't really shine though, so to speak. It looks slightly 'common'. But it's possible that that is because it has similar metrics / dimensions to default system fonts (Arial or something) so that existing documents don't shift too much?\n\nBut I'm quite sure that it will look excellent when it is applied in some typographic work.\n\n"
    },
    {
      "time": "14 Nov 2008 — 2:47am",
      "content": "I attended the introduction yesterday, Wim Crouwel had a wonderful speech about concise and consistent use and implementation with a typeface in a brand identity. Peter Verheul had a presentation of the design process of the typefaces Rijksoverheid Sans & Serif.\n\nThere is also a booklet published with the complete story, I have written about it at my weblog [http://www.designworkplan.com/typography-fonts/rijksoverheid-sans-serif.htm](http://web.archive.org/web/20150322042659/http:/www.designworkplan.com/typography-fonts/rijksoverheid-sans-serif.htm \"http://www.designworkplan.com/typography-fonts/rijksoverheid-sans-serif.htm\")\n\n"
    },
    {
      "time": "14 Nov 2008 — 4:36am",
      "content": "\\>\\> _I attended the introduction yesterday_\n\nLucky man :P I wanted to attend it as well, but I couldn't arrange to go to. Busy at work with looming deadlines.\n\nAlso, I've studied the Sans a bit better, since there are more images around at the moment, and I'm beginning to like it. It has much more character than I initially thought.\n\n"
    },
    {
      "time": "14 Nov 2008 — 6:35am",
      "content": "Enjoyed the meeting last night!\n\nDo you have any scan of the article Jelmar? I unfortunately can't find it on NRC's website.\n\n"
    },
    {
      "time": "14 Nov 2008 — 7:02am",
      "content": "Gerben: I will scan it on monday.\n\nI don't have it here, it's at G2K (ja, je ouwe stagebedrijf, als ik het goed heb begrepen. Ik loop daar nu stage) :)\n\n"
    },
    {
      "time": "16 Nov 2008 — 2:31am",
      "content": "Luck guy! we don't live in Dutch and it's a long way to get there from this part of the world.\n\nIs the book available for sale? Any idea how I can buy one? (I know SanderB offers a copy to the winner who comments in his blog, which I don't think I would be able to win even if I do comment...)\n\nAny English translation in the book? Don't read Dutch...\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:53am",
      "content": "I guess you could get a copy [here](http://web.archive.org/web/20150322042659/http:/www.nijhoflee.nl/) or straight from the [publisher](http://web.archive.org/web/20150322042659/http:/www.uitgeverijdebuitenkant.nl/). The book is mainly Dutch, though some bits and pieces are translated into a few other languages in order to show the character set in use.\n\n"
    },
    {
      "time": "16 Nov 2008 — 6:30am",
      "content": "Thanks- I clicked on your links for some strange reasons they don't work...any idea why?\n\nI suppose it doesn't matter if it's in Dutch... I also bought some Fontshop magazines entirely in Dutch, but still enjoy \"reading\" it though don't understand a word. :p\n\n"
    },
    {
      "time": "16 Nov 2008 — 7:54am",
      "content": "(Moderator's maessage)  \nThe a href tages were not typed in properly. I went into his post, and fixed that. Now the links work.\n\n"
    },
    {
      "time": "16 Nov 2008 — 8:00am",
      "content": "[Here is a link](http://web.archive.org/web/20150322042659/http:/www.uitgeverijdebuitenkant.nl/grafisch_ontwerpen/#167) to the publisher with the book (on top).\n\nAlthough it seems Peter Verheul has a [different cover](http://web.archive.org/web/20150322042659/http:/www.farhill.nl/images/01_typefaces/rijksoverheid/OmslagLetterrijk01.jpg) on his website?\n\n"
    },
    {
      "time": "16 Nov 2008 — 10:25am",
      "content": "Thanks Dan! I tried to edit the post but it seems like that isn't possible nowadays (or just today?).\n\nJelmar, the cover differs a little bit from what you see from the publisher's website, although what you see from Peter's website is a kind of dust jacket. A folded posterlike thingy wrapping the booklet its cover.\n\n"
    },
    {
      "time": "16 Nov 2008 — 12:33pm",
      "content": "I apologize for snoring.\n\nhhp\n\n"
    },
    {
      "time": "16 Nov 2008 — 12:57pm",
      "content": "Thank you for sharing.\n\nƒ\n\n"
    },
    {
      "time": "16 Nov 2008 — 3:31pm",
      "content": "[OT] Fredo,\n\nNice to see a contemporary use of the old Dutch guilder sign! Evidently it's still there, even in brand new fonts (for example, in [Aller](http://web.archive.org/web/20150322042659/http:/www.typophile.com/node/51198)).\n\n"
    },
    {
      "time": "16 Nov 2008 — 5:11pm",
      "content": "Thanks for fixing the links- it's working now.\n\n"
    },
    {
      "time": "16 Nov 2008 — 6:20pm",
      "content": "\\>\\> _Thanks Dan! I tried to edit the post but it seems like that isn’t possible nowadays (or just today?)._\n\nI think editing posts has changed a while back. I think there is a timer on it now. You can't edit posts anymore after a certain time has passed.\n\n\\>\\> _the cover differs a little bit from what you see from the publisher’s website, although what you see from Peter’s website is a kind of dust jacket._\n\nAh, ok that clears that up. :) Is the book any good? I'm thinking about ordering it.\n\n"
    },
    {
      "time": "16 Nov 2008 — 11:00pm",
      "content": "i think I like the dust jacket...\n\ni like the font too.\n\nThe fact that a government is serious about their identity and appointed a designer to create a new font for them is just GREAT! (Sorry, I come from a country where the government doesn't give a damn about fonts and identity. To them, Arial could be as good as Helvetica...)\n\ni wonder how many government would do that?- UK? France? US? Italy?... well it's one thing to work on a new ID for a government, but quite another to get a specialist to design a new set of font- probably just Dutch government would go to that extent?\n\nA friend of mine who had a chance to work with Dumbar couple of years back - I remember him showing me an identity and logo he had worked on with Dumbar - if I am not wrong- it's this government's logo- the older one.\n\n"
    },
    {
      "time": "16 Nov 2008 — 11:21pm",
      "content": "To me, Dutch design (including font) always appear to be kind of \"cold\". They are always \"undecorative\" and \"quiet\", very \"minimalist\" (unlike the others countries, say, the US- The American are always very warm, energetic and passionate...)\n\nJust look at Peter Bil'ak's. It has got the same kind of qualities too... (now, again, that's my personal view...)\n\nI remember reading from the book \"lifestyle\" by Bruce Mau- Bruce talked about an experience he had with a Dutch client, introduced by his associate, Ram Koolhaa, the great architect. At the end of the day, Bruce thought the clients were not interested because they didn't seem to display much enthusiasm.\n\nThis is what Rem said:\" Don't be fooled, the Dutch see enthusiasm as a sign of weakness.\"\n\nI thought that reflected in their design too...\n\n"
    },
    {
      "time": "17 Nov 2008 — 12:47am",
      "content": "Dutch design doesn’t excisit.\n\nPieter\n\n"
    },
    {
      "time": "17 Nov 2008 — 2:42am",
      "content": "\\>\\> _Dutch design doesn’t excisit._\n\nWhat are people trying to describe if they refer to 'Dutch Design'?\n\n"
    },
    {
      "time": "17 Nov 2008 — 3:03am",
      "content": "I think what they see as Dutch design is the work of Wim Crouwel and the designers who are working in the same way. Very clean and grid wise. But that’s not Dutch design because it doesn’t excist.\n\nPieter\n\n"
    },
    {
      "time": "17 Nov 2008 — 3:38am",
      "content": "\" I am much more influenced by arthitecture, than by graphic design\" -Wim Crouwel\n\n[www.youtube.com/watch?v=I5y3px4ovxE](http://web.archive.org/web/20150322042659/http:/www.youtube.com/watch?v=I5y3px4ovxE \"www.youtube.com/watch?v=I5y3px4ovxE\")\n\n[www.youtube.com/watch?v=i-HVW-0eoe0&feature=related](http://web.archive.org/web/20150322042659/http:/www.youtube.com/watch?v=i-HVW-0eoe0&feature=related \"www.youtube.com/watch?v=i-HVW-0eoe0&feature=related\")\n\n(just look at 1:44 - 1:50)\n\nI think this guy has a lot of passion. It's amazing how omeone who can talk about something which can potentially be \"rigid\" or \"boring\", which is the gird and \"constructionism\", with such great passion and fun...It's inspiring.\n\nAnd new alphabet is realy cool-even until today...\n\n"
    },
    {
      "time": "17 Nov 2008 — 3:48am",
      "content": "Let's go for an emotional roller coaster-\n\n[www.youtube.com/watch?v=DKXmfRllQIc&feature=related](http://web.archive.org/web/20150322042659/http:/www.youtube.com/watch?v=DKXmfRllQIc&feature=related \"www.youtube.com/watch?v=DKXmfRllQIc&feature=related\")\n\n"
    },
    {
      "time": "17 Nov 2008 — 5:48am",
      "content": "\\>\\> _But that’s not Dutch design because it doesn’t excist._\n\nWhat do you call it then?\n\n"
    },
    {
      "time": "17 Nov 2008 — 6:27am",
      "content": "Good question.  \nIt think it’s just called graphic design.  \nWhat makes design nowadays done by designers from The Netherlands typical? I don’t know. Is it typical?\n\nBut we are going off topic now. :)  \nPeter Verheul designed a good typeface for the government!\n\nPieter\n\n"
    },
    {
      "time": "17 Nov 2008 — 7:26am",
      "content": "off topic also ... but, by the way, did you see the new 5 euro-coins of the netherlands? [http://www.fontblog.de/wunderbare-euromuenze](http://web.archive.org/web/20150322042659/http:/www.fontblog.de/wunderbare-euromuenze \"http://www.fontblog.de/wunderbare-euromuenze\")\n\n"
    },
    {
      "time": "17 Nov 2008 — 8:45am",
      "content": "I think compared to Europe overall, Dutch design (which most certainly exists) isn't at all cold. But at least in the realm of fonts things _are_ starting to get too formulaic. And there will be a reaction.\n\nThat coin though rules.\n\nhhp\n\n"
    },
    {
      "time": "17 Nov 2008 — 8:59am",
      "content": "<cite>Now It Has Been Done Before.</cite>\n\nI didn't double post! I did **not**! Honestly!\n\n"
    },
    {
      "time": "17 Nov 2008 — 8:57am",
      "content": "My brother e-mailed me an image some time ago. When I saw the coin I thought: \"Why didn't _I_ think of that!?\"\n\nI don't think I will add circular text to my font-warping-into-image program (see [this old discussion](http://web.archive.org/web/20150322042659/http:/typophile.com/node/45299)). After all, Now It Has Been Done Before.\n\n"
    },
    {
      "time": "17 Nov 2008 — 10:34am",
      "content": "\\>\\> _Is it typical? But we are going off topic now. :)_\n\nI agree. Last thing... there is a style of type design that is considered 'Dutch'. You know; 'that typeface looks really Dutch to me'. Couldn't the same in some way apply to design in general?  \nProbably more difficult to pinpoint, but I think it exists.\n\n"
    },
    {
      "time": "18 Nov 2008 — 5:05am",
      "content": "Agree...there is such thing as Dutch design, and is characteristically very strong-including the font design.\n\nIt's something that once you see it, you would go, \"AHH! That's Dutch!\"\n\nwe might not be able to describe or quantify it with words, but they sure exist!\n\n\"Cold\" might not be the best word (excuse me for my limited vocab)- \"formulaic\"..may be... but all that don't mean it's \"boring\" or \"rigid\".\n\nOne can't help but to admire the highly discipline of these Dutch designers in adhering to straight rules and regulation, yet at the same time be creative and acheive a high sense of aethestic which is often very pure and serene- only skillful designers with great craftmanship can achieve this ...hats off to them...\n\nI would think it's easier to quantify Dutch Design than the Australian...I was trained in Australia...\n\n"
    },
    {
      "time": "18 Nov 2008 — 6:14am",
      "content": "<cite>Nice to see a contemporary use of the old Dutch guilder sign! Evidently it’s still there, even in brand new fonts (for example, in Aller).</cite>\n\nYeah, considering the florin has a 400+ year history…\n\nBeing a Dutch designer, I can assure you that Dutch Design is as passionate as —say— Argentinian Design. But perhaps Dutch patrons are not as passionate as Argentine ones…\n\nOT I am not as happy as other Typophiles about this One Identity to superside Dozens of Disparate Identities. I like diversity. And whether my Tax Forms are laid out in Thesis, Arial or whatever, paying is just as painfull to the same measure…\n\n(Could not resist that one, sorry…)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "18 Nov 2008 — 9:14am",
      "content": "\\> “formulaic”..may be... but all that don’t mean it’s “boring” or “rigid”.\n\nTo me, in a way it does.\n\nIt would be highly interesting to study for example the evolution of student work at KABK: is the difference between the first efforts and the final results basically injecting Dutchness into it? The reason I worry is that I see people going to the Netherlands from South America for example and suddenly producing very Dutchy work. It's a shame.\n\nAnother problem I have is that Dutch type is blindly devoted to chirography, so as pretty as it looks, it's still regressive.\n\nhhp\n\n"
    },
    {
      "time": "18 Nov 2008 — 4:32pm",
      "content": "\\>\\> _Another problem I have is that Dutch type is blindly devoted to chirography_\n\nThat's exactly what I like about it.\n\n\\>\\> _did you see the new 5 euro-coins of the netherlands?_\n\nForgot to comment on those. They are excellent. Especially the negative space on the '5 euro' side, forming the shape of The Netherlands (which I only saw when looking at it for a bit longer).\n\n"
    },
    {
      "time": "18 Nov 2008 — 8:28pm",
      "content": "Hrant, I see your point.\n\nThe same arguement has been made about Basel and the Swiss too. What we need to see is some \"rebels\" emerge from within Dutch, who disagree with the traditional approach and start doing something entirely different.\n\nDavid Carson kind of played that role.\n\nAlthough unintentionally, he did carry the entire trend to the other extreme for awhile and kind of loosen everyone else up a bit. I doubt that his crazy style can be widely accepted by the Dutch even today, but at least on the level of international, it was refreshig to see his works and it opened up lots of alternatives and experimental treatments of type arround the world...\n\n"
    },
    {
      "time": "18 Nov 2008 — 9:23pm",
      "content": "\\> What we need to see is some “rebels” emerge from within Dutch\n\nIndeed. Evert Bloemsma was such a person, although rebels are rarely so humble and mild! Tellingly I think, Evert mostly lived geographically away from the Netherlands after his education. This is also the case with two other Dutch rebels: RvL, and De Groot\\*. Perhaps I'm reading too much into this, but I would posit that Western cultures are typically very good at focusing and refining an ideology, but perhaps not as good at harboring the fruitful self-doubt so necessary for true progress, and the elevating of tolerance beyond merely accepting the presence of opposing viewpoints; to me true tolerance involves embracing and even reveling in the presence of things you don't agree with. When tolerance is limited to simply allowing coexistence without showing any \"we're all human\" warmth towards your antagonist, that antagonist is never going to be really happy, and is going to end up leaving anyway. When dissent is cherished instead of merely coldly tolerated, that's when society truly benefits. People need to think and say: \"Please tell me what I'm doing wrong.\" And that's rare, East or West.\n\n\\* Luc[as] has in fact told me that Amsterdam was too small for him, and that's why he moved to Berlin. And this \"size\" issue might in fact be an allegory of sorts for differing varieties of ideology.\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2008 — 5:04am",
      "content": "It's evident that the less you know about a country and their respective \"scene\", the easier it gets to generalize.\n\n"
    },
    {
      "time": "19 Nov 2008 — 6:48am",
      "content": "Very true. That explains why I had a bit of trouble. I've been observing The Netherlands and its people for over 30 years, and its type designers for over 10. I've talked to them, read their books, and analyzed their work. I used to be in love with them; now I just like them more than most. To be fair, that happens to most everything with age.\n\nBut also:  \n- Generalization is a human tool. Denying that is disingenious.  \n- When you're too close to something you can't see it clearly.  \nDon't trust an Armenian to give the best insights about Armenia.\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2008 — 7:15am",
      "content": "Well put! But You're still the nº1 goto-guy when it comes to anything Armenian here at Typophile. Or has that mysteriously changed?\n\n"
    },
    {
      "time": "19 Nov 2008 — 7:21am",
      "content": "I try. Plus fonts are much easier than peoples.\n\nhhp\n\n"
    },
    {
      "time": "20 Nov 2008 — 3:08pm",
      "content": "hrant wrote:  \n<cite>It would be highly interesting to study for example the evolution of student work at KABK: is the difference between the first efforts and the final results basically injecting Dutchness into it? The reason I worry is that I see people going to the Netherlands from South America for example and suddenly producing very Dutchy work. It’s a shame.</cite>\n\nhm. i think it's a shame for you to make such statements without actually being there, knowing the people & their work etc.\n\n- gustavo\\*\n\n\\* rio de janeiro / brasil + type&media 2005-06\n\n"
    },
    {
      "time": "20 Nov 2008 — 3:25pm",
      "content": "What, I have to marry them?  \nBut a good \"before-after\" study might shed some great light.\n\nhhp\n\n"
    },
    {
      "time": "20 Nov 2008 — 3:35pm",
      "content": "It is called academism for a reason — there is always the chance of developing talents taking up the examples of their instructors, especially when they are inspiring. It has happened before (I saw it amongst the painters when I attended Art School, when dozens of graduates turned out the same neo-abstract shit as the two most famous of their professors) and no doubt it will happen again.\n\nBut I don’t think it is a bad thing — people evolve and find their own ways. Hopefully.  \nSo — let’s wait and see…\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "20 Nov 2008 — 10:39pm",
      "content": "Hrant,\n\nNo, marriage isn't necessary.\n\nOne of the instructors has actually expressed dismay that it is a shame all the work from KABK is bunched together and dismissed as being 'Dutch'. The thing is that each student has their own flavour and their own ideas of what makes good type (of course some people have a taste for the construction of type our instructors utilize). But because of the diverse range of backgrounds and the variety of tools we are taught to use the end results are actually very rooted in the ideals of the student. Not to mention that all our instructors (in their classroom teachings and personal work) are very different and have many different opinions on type design, it's up to us to pick and choose our path based on the whole array of techniques. Reading your comments I get the impression that you haven't seen too much of the past work from students in Type and Media (though I must say an online gallery showcasing past graduation typefaces would be nice).\n\nAnd I assure you: the South American in our current year is still producing very South American work :)\n\n"
    },
    {
      "time": "21 Nov 2008 — 2:08am",
      "content": "<cite>The reason I worry is that I see people going to the Netherlands from South America for example and suddenly producing very Dutchy work.</cite>  \nHave you actually seen the work of this south-american student before he enrolled at Type & Media? Do you know anything about his background at all? This statement is offensive to every south-american person.\n\n<cite>Another problem I have is that Dutch type is blindly devoted to chirography, so as pretty as it looks, it’s still regressive.</cite>  \nAnd this ever-recurring mantra is just as formulaic, boring, rigid and downright wrong. Repeating the same message over and over again doesn't make it more true, unfortunately.\n\n<cite>I apologize for snoring.</cite>  \nYou may apologise for insulting, but I know you won't.\n\n-Paul van der Laan  \n [www.type-invaders.com](http://web.archive.org/web/20150322042659/http:/www.type-invaders.com/ \"www.type-invaders.com\")\n\n"
    },
    {
      "time": "21 Nov 2008 — 7:23am",
      "content": "\\> This statement is offensive to every south-american person.\n\nNot to the ones who fight for their culture.  \nLook at the winners of the last Morisawa awards.\n\nAnd don't talk to me about mantras. \"There's no essential difference...\"  \nSheesh. If it weren't a religion, it would be a joke.\n\n--\n\nI do apologize for thinking that this thread would be boring. But I can't apologize for my feelings of boredom when I look at _formulaic_ design, and for expressing those emotions. I do try to keep my emotions in check however, and I would ask that you try to do the same.\n\nThe only saving grace is that any type id for a government probably can't escape being formulaic, so I guess the brief was followed very well, and that's the primary goal of any good designer. So maybe my complaint can be seen in that light.\n\nhhp\n\n"
    }
  ]
}
