{
  "id": "51620",
  "title": "converting text to different languages - helvetica",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone know if its possible to find helvetica or something very similar that will work in arabic, hebrew, greek and such like. Basically languages that dont use english letters for the alphabet? Russian and greek too. Unfortunately my knowledge of opentype/cycrillic fonts is minimal (if indeed that is relevant) so any help/pointers would be greatly appreciated.\n\nThanks\n\n",
  "author": "Arran",
  "time": "13 Nov 2008 — 8:10am",
  "uid": "33990",
  "comments": [
    {
      "time": "13 Nov 2008 — 8:14am",
      "content": "Linotype.com - \"Helvetica World\" or somesuch\n\n"
    },
    {
      "time": "13 Nov 2008 — 8:17am",
      "content": "Linkie... [http://www.linotype.com/48344/helveticaworld-family.html](http://web.archive.org/web/20130821042931/http:/www.linotype.com/48344/helveticaworld-family.html \"http://www.linotype.com/48344/helveticaworld-family.html\")\n\n"
    },
    {
      "time": "13 Nov 2008 — 9:10am",
      "content": "The Helvetica World fonts, to which Si links, should meet all your needs except perhaps Arabic. The fonts do contain Arabic support, but the design of the Arabic is not harmonised to Helvetica in the way that the other scripts are (it is a revised version of the Yakout simplified Arabic design). Also, in order to fit the Arabic into the vertical metrics of the existing Latin design, without compromising backwards compatibility or clipping the Arabic descenders, the Arabic has a raised baseline.\n\nIf you need Arabic as well as the other scripts, I would recommend getting Helvetica World for everything else but using another font for the Arabic.\n\n"
    },
    {
      "time": "13 Nov 2008 — 3:02pm",
      "content": "Great, thanks alot for your help guys, much appreciated.\n\n"
    },
    {
      "time": "6 Jul 2013 — 9:41am",
      "content": "I like your blog, it's interesting. Check this out [Press Release Service](http://web.archive.org/web/20130821042931/http:/www.wiredworx.net/).\n\n"
    },
    {
      "time": "6 Jul 2013 — 2:14pm",
      "content": "The ordinary Helvetica font on my Mac OS X includes support for Greek and Cyrillic.\n\n"
    }
  ]
}
