{
  "id": "51622",
  "title": "Medium Capitals",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi, I'm setting a newsletter in Minion and it contains a high proportion of abbreviations, repeated throughout the text in columns. I started with regular capital letters for the abbreviations (such as INGOs, USAID and DFID) but the size of the capitals seems to interrupt the smooth reading of the sentences. I tried small caps but their size does the same, and looks out of place to my eye in running text.  \nI read somewhere that it was common to use normal caps reduced by 1 point size or small caps increased by one point. What are others' preferences here?  \nI got to wondering about Medium caps, but Minion Pro doesn't have them...is this a common feature? Even Google didn't turn up much about Medium caps.\n\n",
  "author": "<a href=\"/web/20100129024119/http://www.typophile.com/user/20652\" title=\"View user profile.\">Bendy</a>",
  "time": "<br>",
  "uid": "20652",
  "comments": [
    {
      "time": "",
      "content": "You could jump up to a medium weight if you are currently using the regular weight and then reduce the normal caps by a point or so. Increasing the weight keeps the overall color the same. Use your eye; it will tell you what is right.\n\n(And no, medium caps are not common.)\n\n"
    },
    {
      "time": "",
      "content": "Yes; the colour does go a bit off when the sizes change, but I think that's less noticeable than full-size abbreviations jarring the eye.\n\nNot sure I have the medium weight, there was certainly a semibold at work; I'll have to check. Thanks.\n\nI'll consider putting Medium caps in any text fonts I design. I'd say they'd be more useful than small caps for certain type styles.\n\n"
    },
    {
      "time": "",
      "content": "Yes, that solution works very well. In 11 pt regular, 10pt medium caps worked ok for those abbreviations, which were an appropriate size and kept the colour almost exactly right.\n\nI suspect there are no rules on mid caps above what fits with a particular typeface? Three questions:\n\n- Has anyone here ever needed/used mid caps? For what?\n\n- Would it be a benefit to have small AND mid caps in a font? Or just small caps of a nice height (more than lowercase x-height)\n\n- Would mid caps be halfway between the height of small and full caps? Or nearer full height?\n\nThanks ;)\n\n"
    },
    {
      "time": "",
      "content": "[FF Atma](http://web.archive.org/web/20100129024119/http:/www.fontshop.com/features/fontmag/002/02_atma/) is one example of a typeface with multiple small cap sizes.\n\nA number of designs also feature petite caps in addition to small caps; in this case, the small caps are noticeably larger than lowercase x-height, while the petite caps are x-height.\n\nI can see that different small cap sizes may be preferable for different uses the small caps are put into (acronyms in running text, caps with small caps, all small caps...), but I generally prefer small caps that are significantly larger than x-height.\n\n"
    },
    {
      "time": "",
      "content": "Yes, as Jongseong said: ‘petite caps’ is the proper term for what you describe. There is a ‘pcap’ OpenType feature.\n\nSome more fonts that have petite caps:  \n [Mrs Eaves](http://web.archive.org/web/20100129024119/http:/typophile.com/node/51576)  \n [Vendetta](http://web.archive.org/web/20100129024119/http:/www.emigre.com/EF.php?fid=130)  \n [Delargo Pro](http://web.archive.org/web/20100129024119/http:/typophile.com/node/43245)  \n [P22 Underground](http://web.archive.org/web/20100129024119/http:/typophile.com/node/37089)  \n [Clarise](http://web.archive.org/web/20100129024119/http:/typophile.com/node/21293) (this thread might be of particular interest)\n\nAlso: Nick’s thoughts on the [many ways that small caps can work](http://web.archive.org/web/20100129024119/http:/typophile.com/node/40920#comment-252257).  \nF\n\n"
    },
    {
      "time": "",
      "content": "Wonderful! I'll take some time to have a look through. Thanks :)\n\n"
    }
  ]
}
