{
  "id": "51637",
  "title": "On Ideas from Italy - ideas, not ideals",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": "Italy has always been a key player in Hebrew type design, and also was the place of modern-day Hebrew printing.\n\nThe landmarks of Hebrew printing are listed here: [http://www.jerusalembooks.com/jap/bookb1.htm](http://web.archive.org/web/20150414014139/http:/www.jerusalembooks.com/jap/bookb1.htm \"http://www.jerusalembooks.com/jap/bookb1.htm\").\n\n",
  "author": "gohebrew",
  "time": "13 Nov 2008 — 1:02pm",
  "uid": "18444",
  "comments": [
    {
      "time": "13 Nov 2008 — 1:05pm",
      "content": "It says there:  \n<cite>The first book printed entirely in Hebrew letters, Rashi's commentary on the Pentateuch was printed in Rome about 1470, only 14 years after Gutenberg printed his bible. Within a decade Hebrew printing had spread from Italy to Spain and Constantinople with the press of Gerson and Joshua Solomon at Soncin near Cremona being the most active.</cite>\n\nHere are a few landmark dates and events in early Hebrew printing:  \n1475 - First dated Hebrew work is printed in Reggio di Calabria  \n1482 - First Spanish Hebrew book printed in Guadaljara  \n1492 - Expulsion from Spain and destruction of Hebrew books  \n1503 - David Nahmias begins printing in Constantinople  \n1512 - Beginning of Hebrew printing in Salonika  \n1475 - 1530 The Soncinos print in Mantua, Naples, Brescia, Cassal Maggiore, Barca, Fano, Pesaro, Ortona, Rimini and Constantinople  \n1513 - Press of Gershon Solomon Cohen in Prague prints prayer book  \n1520 - Daniel Bomberg of Venice prints the first complete Talmud edition. The Venice community sends a copy to Henry VIII of England as a gift  \n1533 - Hayim ben David Schwartz moves his press from Prague to Augsburg Germany  \n1542 - Beginning of censorship of Hebrew books by the Roman Curia  \n1550 - Giustiniani and Bragadini enter into competition with Bomberg in Venice  \n1554 - The burning of the Talmud at Ferrara and closing of the Venice printers  \n1556 - First edition of Zohar is saved in Mantua but Zioni commentary is burned  \n1565 - Printing resumes in Venice and first edition of Shulkan Aruch appears  \n1569 - Isaac ben Aaron of Prossnitz prints in Cracow  \n1578 - The Talmud begins to appear in Basel  \n1627 - Gutel the daughter of Leb Setzer prints in Prague  \n1627 - Menasheh ben Israel and Daniel De Fonseca begin printing in Amsterdam  \n1658 - Uri Phoebus begins printing in Amsterdam and in Zolkiev in 1692  \n1697 - Jacob Proops begins printing in Amsterdam\n\n"
    },
    {
      "time": "13 Nov 2008 — 1:05pm",
      "content": "A great pioneer was Gershon Soncino of the famed Soncino Press.\n\n ![](http://web.archive.org/web/20150414014139im_/http:/typophile.com/files/soncino_logo_5897.jpg)\n  \nThe Soncino logo\n\nToday, the Soncino Press lives on through the efforts of the late Jack Goldman and his son-in-law Aryeh ?????.\n\nAnother great pioneer was Daniel Bomberg, the first major publisher of the Talmud.\n\n ![](http://web.archive.org/web/20150414014139im_/http:/typophile.com/files/sukka_bomberg_6469.jpg)\n  \nA page from tractate Sukkah, typeset by Daniel Bomberg. \n"
    },
    {
      "time": "13 Nov 2008 — 1:46pm",
      "content": "Another pioneer to help making printing in general possible were the Jews of Ehnheim, Italy, which made this fledging industry possible, as these selection show:\n\n ![](http://web.archive.org/web/20150414014139im_/http:/typophile.com/files/guten_1_5397.jpg)\n\n ![](http://web.archive.org/web/20150414014139im_/http:/typophile.com/files/guten_2_6701.jpg)\n\n**The Makers of Hebrew Books in Italy** , David W. Amram, Holland Press, 1962, 1988, pp. 12, 13\n\n"
    },
    {
      "time": "14 Nov 2008 — 4:59am",
      "content": "I have just found an old issue of the english Baseline magazine with a brief (illustrated) article on Hebrew books printing history.  \nWould you like me to see if there's some useful info and/or scan something to post?\n\n"
    },
    {
      "time": "15 Nov 2008 — 10:57pm",
      "content": "Yes, please.\n\nExcuse my ignorance, but who is Baseline magazine? Do they have a web site, and archive?\n\n"
    },
    {
      "time": "15 Nov 2008 — 10:58pm",
      "content": "How come you don't post anything at [www.gotalmud.org/blogs](http://web.archive.org/web/20150414014139/http:/www.gotalmud.org/blogs \"www.gotalmud.org/blogs\")?\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:18am",
      "content": "Hi israel. Baseline magazine on the web is here: [http://www.baselinemagazine.com/](http://web.archive.org/web/20150414014139/http:/www.baselinemagazine.com/ \"http://www.baselinemagazine.com/\") although the issue I mentioned is probably from around 1989…\n\n<cite> How come you don’t post anything at <a href=\"http://web.archive.org/web/20150414014139/http:/www.gotalmud.org/blogs\" title=\"www.gotalmud.org/blogs\">www.gotalmud.org/blogs</a>? </cite>  \nDo you mean starting new threads? I left comments, but I have not a particular issue to post about. Maybe we could do this collecting about history of Hebrew printing there, but it would be a duplicate of the thread you have here at Typophile. As you prefer, anyway… :)\n\nEDIT: The Baseline issue I was reffering to is this one: [http://www.baselinemagazine.com/browse\\_buy/magazine/back\\_issues/13/](http://web.archive.org/web/20150414014139/http:/www.baselinemagazine.com/browse_buy/magazine/back_issues/13/ \"http://www.baselinemagazine.com/browse\\_buy/magazine/back\\_issues/13/\")  \nIt has a 4 page illustrated article about Hebrew printing history, nice images.\n\n"
    },
    {
      "time": "16 Nov 2008 — 5:43am",
      "content": "piccic,\n\nI couldn't find any comments. Are they there by you?\n\nDid you register? I think only registered people's posts are posted.\n\n"
    },
    {
      "time": "16 Nov 2008 — 7:56am",
      "content": "Thanks, gohebrew, for your amzing posts on the printing history of Hebrew.\n\nYou should check out this guy who designs some reeeeeally cool Hebrew fonts, if you have not already knew about him-\n\nezerdesign.com\n\nI find his works really inspiring!\n\nI live in a country with Muslims majority and this is what I discovered recently- Muslims forbid any form of \"visualization\" of any living creatures and human being, since that can be associated with idolatry. As the result, the Muslim artists and craftmen over the century have learned to express their creativity mainly through calligraphy and typography. As the result thay become so good in this area. I assume Jews are probably in the same situation, since the Torah also forbids the \"idolization\" of living creatures. Ezer's work is the classic example of this theory. His works is so Typographical driven and they are so \"pure\"...\n\n"
    },
    {
      "time": "16 Nov 2008 — 8:58am",
      "content": "Yee Weng Chiang,\n\nThank you for turning me onto this talented designer, with many new appealing design.\n\nIf you add a \"www.\" before ezerdesign.com, you get [www.ezerdesign.com](http://web.archive.org/web/20150414014139/http:/www.ezerdesign.com/ \"www.ezerdesign.com\"), which is a link.\n\nMore later.\n\n"
    },
    {
      "time": "16 Nov 2008 — 1:41pm",
      "content": "Israel, hey, it seems you are a little absent-minded, aren't you? :=)  \nI'm saying this with affection, of course! :=)\n\n1) I registered, and left at least 3-4 comments as \"piccic\";  \n2) I talked you about Oded (Ezer) at least two times before weng addressed you to his website (which I already linked before in another thread). Oded has studied at the Bezalel Academy of arts, and he had the talented Yanek Iontef among his teachers. Yanek's site is here: [http://www.fontef.com/](http://web.archive.org/web/20150414014139/http:/www.fontef.com/ \"http://www.fontef.com/\")\n\nGive me some time and in the next days I hope to manage to do some scans from another book I have…\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:08pm",
      "content": "Absent minded?\n\nThat's kind. I'd chicken with no head!\n\nLet me check out Yanek.\n\nThank you. I'll look forward to the scans.\n\nDid you succeed to post blogs at [www.gotalmud.org/blogs](http://web.archive.org/web/20150414014139/http:/www.gotalmud.org/blogs \"www.gotalmud.org/blogs\")?\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:09pm",
      "content": "Sorry, just reread your post about \") I registered, and left at least 3-4 comments as “piccic”;\".\n\n"
    },
    {
      "time": "16 Nov 2008 — 4:25pm",
      "content": "I saw your posts and will respond, b\"n.\n\nAs administrator, I had to approve them first, before the posting was visible. A person could become a power freak.\n\nYou wrote interesting things. I studied Metafont in the mid-eighties and thought it was brilliant. Sinclair QL even years earlier had an even more brilliant font technology that would put MetaFont to shame. It had no documentation, bo name, but was Sir Clive's toy for the QL.\n\nDo you knw the QL (Quantum Leap - though arrogant, it fit in the eighties: a Motorola processor like a Mac, a DOS interface, and Unix-like multi-tasking! Too bad the tape-based disk drie the size of a matchbox killed it. I regret I gave my nephew it.\n\nI once typeset a few chapters on Maimonides and transfered the data to CompSet typsetter, to the amazement of the Israeli distributor. Some guy in Israel made it work in Hebrew, too. Amazing.\n\n"
    },
    {
      "time": "17 Nov 2008 — 8:31am",
      "content": "<cite> As administrator, I had to approve them first, before the posting was visible. A person could become a power freak.</cite>  \nI thought they'd be viewable, as I saw them. Yes, definitely we should not get so excited while wondering at the possibilities of technology… :=)\n\nRead more slowly! (this goes a great deal for me as well…) :=)\n\n"
    },
    {
      "time": "17 Nov 2008 — 12:15pm",
      "content": "The Administrator only sees at the administrator level. No viewer.\n\nThe Writer sees, but only to preview and edit. No one else really sees.\n\n"
    },
    {
      "time": "17 Nov 2008 — 4:36pm",
      "content": "<cite> &gt;The Administrator only sees at the administrator level. No viewer. The Writer sees, but only to preview and edit. No one else really sees.</cite>\n\nThis should be a mantra for everyone in the publishing industry.\n\n"
    },
    {
      "time": "18 Nov 2008 — 11:13am",
      "content": "hi pp (!),\n\n\\><cite>...No one else really sees.</cite>\n\ni really like your screen name, pica pusher.\n\ni'm chassidic, so my mantra is: \"G-d is one\". ummmm...\n\nHappy 20th day of Cheshvan!\n\n"
    },
    {
      "time": "19 Nov 2008 — 12:00am",
      "content": "The Talmud and the Mikraot Gedolot (from the press of Daniel Bomberg) are fully digitized and available online:\n\n[http://aleph500.huji.ac.il/nnl/dig/books/bk001725628.html](http://web.archive.org/web/20150414014139/http:/aleph500.huji.ac.il/nnl/dig/books/bk001725628.html \"http://aleph500.huji.ac.il/nnl/dig/books/bk001725628.html\")\n\n[http://aleph500.huji.ac.il/nnl/dig/books/bk002008397.html](http://web.archive.org/web/20150414014139/http:/aleph500.huji.ac.il/nnl/dig/books/bk002008397.html \"http://aleph500.huji.ac.il/nnl/dig/books/bk002008397.html\")\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414014139/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "19 Nov 2008 — 10:18pm",
      "content": "Welcome back, Chajke\n\nThank you for the links.\n\n"
    },
    {
      "time": "20 Nov 2008 — 8:05am",
      "content": "@ Israel: please, have patience! I have not had the time yet for some scans… :=(\n\n@ Chajm, thanks for those links. I seem the DJVu plug-in works just with Safari (and not Firefox) on the Mac, but maybe I am wrong… With Safari the books are downloadable for offline browsing…  \nI have looked at your page and the current post sounds very interesting, although [not knowing German] I had to guess from an online translation. I especially like when the Rabbi quoted says <cite>\"I want to be among people who profess and act with their faith intact, does not matter what their faith is, they deserve my respect.\"</cite>  \nIf it could be edifying I could add (as a catholic) the highest esteem for me goes not only to those who, not matter what their faith is, profess and act with their faith intact, but especially for those which do this for love, absolutely. :=)\n\n"
    },
    {
      "time": "21 Nov 2008 — 4:38am",
      "content": "@piccic: Offline browsing should be a nice alternative, even with the hughe size of the files... It is also possible to print the whole document - very smart!  \nYou had a look at a very difficult discussion about a rabbi who said he left judaism because he is upset about the situation of german judaism.  \nYou'll find typo stuff in the \"siddur\" or \"seforim\" category. Siddur for example [http://www.sprachkasse.de/blog/category/siddur/page/1/](http://web.archive.org/web/20150414014139/http:/www.sprachkasse.de/blog/category/siddur/page/1/ \"http://www.sprachkasse.de/blog/category/siddur/page/1/\")\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \n [http://www.sprachkasse.de/blog](http://web.archive.org/web/20150414014139/http:/www.sprachkasse.de/blog \"http://www.sprachkasse.de/blog\")  \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n"
    },
    {
      "time": "22 Nov 2008 — 9:53am",
      "content": "@Israel, did you receive the link I sent you by email?\n\n@Chajmke: Thank you! About the discussion, I think I got the overall sense, I understand it must be very delicate, but nonetheless it's very interesting not to see that he seemigly \"left\" (although he seems to be in a reflective position), but to see he's disturbed by what he saw as fragmentation.\n\n"
    },
    {
      "time": "22 Nov 2008 — 7:37pm",
      "content": "picic,\n\nI got the link. The pictures were fascinating.\n\nI must admit that I forget what I was trying to look ar in them. (I had a very hecdic (sp) week last week.) I didn't answer you, yet because the Sabbath came, which for many religious Jews means Friday before the early sundown is extremely busy, as when the Sabvbath comes at sundown, we turn into pumkins! :)\n\n"
    },
    {
      "time": "23 Nov 2008 — 8:12am",
      "content": "Don't worry: I just wished to know if you got them. I don't have so much about Hebrew printing history, but I think a summary and a collection of pictures like you started would be nice (to be integrated and corrected in progress).  \nHowever, I think we should leave the thread clean of unrelated comments. We have too much a tendency to go constantly off-topic, and it's not good… :=(\n\n"
    },
    {
      "time": "23 Nov 2008 — 9:59am",
      "content": "piccic,\n\nYou are right.\n\nIn this day and age, people try to be politically correct.\n\nIn my circles, we don't care.\n\nIronically, we're Chassidim, and you might think every rule is holy. In my circles, a rule is only valid, if you break it. :)\n\n"
    }
  ]
}
