{
  "id": "51644",
  "title": "Help with my personal logo?",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20081208085205im_/http:/typophile.com/files/bplogo_wbground_5274.jpg)\n\nHello,\n\nI would love some criticism on my personal logo design. I’m finishing school right now, so this would be going on business cards and stationary that I will be giving to potential employers in the graphic design industry.\n\nI’m going for something simple and clean, but I also want it to be more masculine than feminine. I’m planning on using letterpress or an embossing for the final product on a fairly heavy stock.\n\nMy name is Bekka Palmer, hence the bp.\n\nAny advice/criticism/comments would be greatly appreciated.\n\nThanks  \nBekka Palmer\n\n [‹ logo for business students work fair](http://web.archive.org/web/20081208085205/http:/typophile.com/node/52381 \"Go to previous forum topic\") [Wedding Mongram ›](http://web.archive.org/web/20081208085205/http:/typophile.com/node/52321 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081208085205/http://typophile.com/user/22647\" title=\"View user profile.\">bekka5280</a>",
  "time": "<br>",
  "uid": "22647",
  "comments": [
    {
      "time": " 13.Nov.2008 8.40pm",
      "content": "Square, 4-fold rotationally symmetrical logo on a 45 degree angle brings to mind another one:\n\n ![](http://web.archive.org/web/20081208085205im_/http:/typophile.com/files/images_4898.jpg)\n\n- Lex\n\n"
    },
    {
      "time": " 13.Nov.2008 9.33pm",
      "content": "But if you live in Germany or backwoods Mississippi . . .\n\npenn\n\n"
    },
    {
      "time": " 13.Nov.2008 10.03pm",
      "content": "@ Lex:\n\nNegative connotations aside, I think we can agree that symbol was effective.\n\n@ Bekka:\n\nFirst thought is beefing-up slightly the thin parts of your logo. They may get lost when you size them down for letterpress printing. Second, is there a reason for the cartwheeling logo? It does not say “clean and simple” IMO. What would it look like without the spinning?\n\nI think letterpress on heavy stock will be a great first impression—like a really firm handshake. Good luck out there!\n\n"
    },
    {
      "time": " 13.Nov.2008 10.52pm",
      "content": "@ Ace:\n\nOh definitely - it’s a good-looking logo. I really like the choice of colours. I agree that the thins need to be thicker as well.\n\nThe spinning could work if it were tiled as a wallpaper and used as a background image. The logo itself doesn’t need to be rotated like that.\n\n- Lex\n\n"
    },
    {
      "time": " 14.Nov.2008 7.58am",
      "content": "I’m trying to post an updated version with your very helpful comments, but I keep getting an error message... I will try again later.\n\nThanks for the input though!\n\n@ Ace:\n\nI have been told I have an excellent handshake...\n\n"
    },
    {
      "time": " 4.Dec.2008 8.51pm",
      "content": "Do you really need 8 of the same elements? It seems like it is overly busy. I think you could simplify it but thats my .02 cents.\n\n"
    },
    {
      "time": " 4.Dec.2008 10.45pm",
      "content": "i do agree, it is currently very busy.  \nif you shrink it down 1/4” x 1/4” in BW, can you recognize it?\n\nthe essence of any good mark can be recognize at a small scale in BW.\n\n"
    }
  ]
}
