{
  "id": "5164",
  "title": "Wedding Mark",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This mark is in the works for a couple. Emily and Eric, The couple is going to be getting married this fall. They wanted something to symbolize their bond together. Logo will be used on usual wedding stuff, invites, thank you notes, etc.   \n   \nOpinions Please...   \n ![](http://web.archive.org/web/20131022202002im_/http:/www.typophile.com/forums/messages/29/37984.jpg)\n\n",
  "author": "david_g",
  "time": "10 Jun 2004 — 11:34am",
  "uid": "3472",
  "comments": [
    {
      "time": "10 Jun 2004 — 11:49am",
      "content": "I wasn't trying to alienate a his and her aspect or their relationship. I really wanted to put that part aside and focus on unity, strength, compromize and balance.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:44pm",
      "content": "![](http://web.archive.org/web/20131022202002im_/http:/www.typophile.com/forums/messages/29/37988.jpg)\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:12pm",
      "content": "Enron? :-/   \n   \nIt's _too_ austere - like some kind of corporate merger.   \nCertainly most people see marriage as an \"organic\" thing, no?   \n   \nCheck out this logo instead: [http://www.thtfct.com/](http://web.archive.org/web/20131022202002/http:/www.thtfct.com/)   \nMaybe do some abstract two-part heart?   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:24pm",
      "content": "i think miss tiffany is subconciously wanting to see this mark look more like the fontlab logo. ;^)   \nif it were me, i'd make one of the E's a different shade of gray, but that might destroy the unity concept yer going for (but i don't think so)\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:31pm",
      "content": "![](http://web.archive.org/web/20131022202002im_/http:/www.typophile.com/forums/messages/29/38009.jpg)\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:40pm",
      "content": "How are you envisioning the printing of this? I know it's best to design in b&w to work out proportions and overall design etc. But right now the mark looks a little severe and institutional. The ink and paper choice could give it a very different feel. An ivory stock with a silvery gray ink could transform severe into sophicated & elegant. I also want to add an ampersand (either a simple geometric one to go with your design or a very organic curvy one to contrast) it might be too cliche, but it might also help to lose the corporation feel.\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:44pm",
      "content": "Hmmm Interesting. My gut is a bodoni filosophia type thing but I haven't played to much with that yet. Maybe Tonight.\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:48pm",
      "content": "I am really not feeling that cooperate with this mark. In fact I struggle with the cooperate comments. The truth is I want this couple to be able to stamp this on their mail in 50 years and it still be effective.\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:50pm",
      "content": "Maybe even engrave it on their slabs.   \noooooh erie huh.\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:55pm",
      "content": "You wrote \"cooperate\" - did you mean \"corporate\"?   \n   \nWhat about this, if you really want the \"E\"s in there: have a square, but make the dividing line like a flowy river. You know, progressive flow of married life, getting old together, Love Boat, those dark kissing canals at theme parks, etc. etc. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:59pm",
      "content": "oops to bda thsi thnig deosn't hve spelll czeck\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:09pm",
      "content": "I originally used curves but it started to look to sexual.\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:19pm",
      "content": "?   \nPardon me for putting it so coarsely, but are they spayed and neutered? :-/   \nI don't mean to be offensive, but at the very least I think I can suggest that you could read _sensuality_ into it instead, and I hope they'll at least have some of that in their union. I don't mean to impose my ideals unto anybody, but I'd have to note that it would have to be a very... \"special\" marriage to really match such an austere logo. Or am I from the wrong planet?   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:21pm",
      "content": "an what's wrong with that??? ;^)\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:29pm",
      "content": "With what?\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:29pm",
      "content": "I didn't mean to put you off with the comparison to a corporate logo. An E balancing on point is going to remind people of Enron though. At the time of my posting I hadn't seen the peach colored version which I believe gives the mark a more humanistic feel. Your design does evoke the adjectives you hoped to express and in addition the ying yang effect of the Es does say man/woman, joining, marriage etc. Looking forward to seeing how you lay it out with the other type elements.\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:31pm",
      "content": "Thanks, Me 2\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:52pm",
      "content": "David, I like the mark if you use it as a pastel foil emboss on an uncoated stock, hardly corporate\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:11pm",
      "content": "Sure, but isn't some form of _human affection_ a factor in marriage?   \nNow I'm feeling like an old-fashioned westerner... Very strange. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:19pm",
      "content": "I think if you made the logo look like it was stone or something more organic it would add alot to the logo. In other words add texture and soften it.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:22pm",
      "content": "You don't the color softens it enough.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:22pm",
      "content": "Sorry, You don't think the color softens it enough.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:31pm",
      "content": "Tiffany, I am really happy that you can sense the emotion I was hoping this logo would give off.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:33pm",
      "content": "Oh, I might have jumped the gun a little. But I do agree what about a 50% grey.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:33pm",
      "content": "Oh, I might have jumped the gun a little. But I do agree, what about a 50% grey.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:35pm",
      "content": "The first color came from the idea of a flesh tone.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:37pm",
      "content": "\\> You are into PDAs aren't you. ;)   \n   \nYou mean like PalmPilot stuff? I don't even have a cellphone. Not having one is a status symbol. As in: \"If I need you, _I'll_ call _you_.\" ;-\\>   \n   \n\\> flesh tone   \n   \n:-/   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:44pm",
      "content": "![](http://web.archive.org/web/20131022202002im_/http:/www.typophile.com/forums/messages/29/38032.jpg)\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:47pm",
      "content": "Maybe it should only appear embossed white on white\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:53pm",
      "content": "Wait a second:   \n\\> it doesn't mean the whole world has to know.   \n   \nBut isn't a logo an inherently public thing?   \n   \nAnyway, don't mind me, I guess.   \nI'll close the door as I leave - we wouldn't want the A/C you're blasting to go to waste...   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:55pm",
      "content": "I struggle with color. I need a good concept to spell the color out to me.\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:57pm",
      "content": "100%man + 100%woman = 50%GREY\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:00pm",
      "content": "LINOTYPE DIDOT is very elegant, good suggestion\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:00pm",
      "content": "\\> (P)ublic (D)isplays of (A)ffection   \n   \nOh.   \nNo, I'm actually pretty reserved in person - not sure why though.   \nLike I'm no Thomas on the dance floor...   \n   \nBTW, how did you get that image to show up in the emailed post? That's only the second time I've ever seen that work. Did you embed it in a certain way?   \n   \n\\> = 50%GREY   \n   \n\"Soylent Green is people!\" ;-)   \n   \nSorry, I'm leaving pronto, promise...   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:06pm",
      "content": "It's been fun folks. I'll continue to grind away at this. Have a good night or day and thanks for all the suggestions.   \n   \nDavid\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:09pm",
      "content": "Oh yeah, I'm glad filosophia doesn't work. Now I won't have to purchase it from Emige.\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:33pm",
      "content": "miss tiffany, is PDA just a utah term? that's the only place i ever really used it, since it's so prevalent there in provo. and using two different tones looks really great (in the example you posted) that's what i was talking about. and a DWR fan too... man i like your sense of aesthetics!\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:58pm",
      "content": "_am I from the wrong planet?_ sometimes i think you are, hrant, but i'd hafta agree with you on this.\n\n"
    },
    {
      "time": "11 Jun 2004 — 9:56am",
      "content": "I have been reading the debate about the mrk looking too corporate. I have to agree with Hrant however. BUT!...   \n   \nOne has to ask whether the COUPLE will like it, and I am guessing the designer does know them.   \n   \nThis does not mean I dislike the mark, but the way it is printed and the colour decision with count for a lot.   \n   \nmwah   \nk\n\n"
    },
    {
      "time": "10 Jul 2004 — 11:54pm",
      "content": "I just happened to land on this page and would like to offer a comment, although it is probably to late. The straight 90\n\n"
    },
    {
      "time": "10 Jul 2004 — 11:53pm",
      "content": "I just happened to land on this page and would like to offer a comment, although it is probably to late. The straight 90\n\n"
    },
    {
      "time": "10 Jul 2004 — 11:54pm",
      "content": "I just happened to land on this page and would like to offer a comment, although it is probably to late. The straight 90\n\n"
    },
    {
      "time": "11 Jul 2004 — 5:47am",
      "content": "I, too, just landed on this page for the first time ... have you considered the sexual connotations. Or am I just being a dirty old man?   \n   \n--   \nS\n\n"
    },
    {
      "time": "12 Jul 2004 — 8:05am",
      "content": "I too am with Hrant on this one. I think a marriage symbol should be more organic and less rigid and mechanistic than this. A marriage is not a static thing, it is a living thing that grows over time. The taiji symbol would be the ultimate example.   \n   \n ![taiji symbol](http://web.archive.org/web/20131022202002im_/http:/www.typophile.com/forums/messages/29/40440.gif)   \n   \nOn the other hand, kumbuniko makes a good point about the clients' preferences. And if S\n\n"
    },
    {
      "time": "12 Jul 2004 — 9:42am",
      "content": "Oh, this old thing. Unfortunatley this project fizzled out as quick as it fizzled in. Nice that it came up again though. The Reason why I intitally wanted to use a more rigid solution was because I felt that using curved lines would add a more feminine quality to the mark. I wanted the mark to be both feminine and masculine in a unified form. I also wanted show stability and balance which I felt curved lines would have been unable to represent. Yes, the Ying yang symbol shows balance, However we are dealing with two capital E's here. The Letter E naturally and simply interlocks with itself, I felt it unecessary to force some fancy curved lines upon this solution to try and mimic some ancient chinese symbol.\n\n"
    },
    {
      "time": "12 Jul 2004 — 9:57am",
      "content": "Sorry the project fizzled out. Of course I wasn't suggesting you actually use or mimic the taiji symbol, but I think it should have been of interest as the most ancient and enduring symbol for the constantly revolving interplay of the feminine and the masculine (the dots express the idea that each contains the seed of the other). In the taiji symbol, btw, the black represents the femine and the white the masculine.   \n   \nThe interlopcking Es were nice and would have been fine, I'm sure.   \n   \nin innocence we see the beginning   \nin passion we see the end   \ntwo different names   \nfor one and the same   \n --Laozi\n\n"
    },
    {
      "time": "12 Jul 2004 — 8:35pm",
      "content": "perfect mark for two robots sharing circuits.\n\n"
    },
    {
      "time": "13 Jul 2004 — 7:26am",
      "content": "What if you trimmed the longer part of each 'E' so that they lock as you have them, but you have a little cutout in two of the corners?\n\n"
    },
    {
      "time": "10 Jun 2004 — 11:41am",
      "content": "Very austere. I like it. What if you turned it onto a point? 45 degrees? Perhaps too corporate in general, but if it represents the couple then that shouldn't matter.\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:18pm",
      "content": "ha. ok. i guess i see that. but i actually like the austerity. it is too obvious to be warm and cozy and organic for wedding invitation. ooooh. i'm probably asking for it now.   \n   \n;)\n\n"
    }
  ]
}
