{
  "id": "5168",
  "title": "Information about 2 typeface designers: Campbell Jerry & Jacquette Cynthia",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Recently, I'm following a course to become a graphical designer. As a task for my course I have to search information about 2 typeface designers: Campbell Jerry & Jacquette Cynthia.   \nThe problem is that it's very hard to find some information about them. I even consulted the national library here in Belgium... nothing...   \n   \nNow my question is: Is there anyone who heard of these typeface designers before or is in the possesion of some information, links, etc.?   \n   \nIf somebody could provide me some info, I would be very thankfull...   \n   \n(by the way: sorry for my bad english)\n\n",
  "author": "pillgrim",
  "time": "10 Jun 2004 — 12:37pm",
  "uid": "3953",
  "comments": [
    {
      "time": "10 Jun 2004 — 12:43pm",
      "content": "\\> Campbell Jerry & Jacquette Cynthia   \n   \n [http://www.myfonts.com/person/campbell/jerry/](http://web.archive.org/web/20131018110816/http:/www.myfonts.com/person/campbell/jerry/)   \n [http://www.myfonts.com/person/jacquette/cynthia/](http://web.archive.org/web/20131018110816/http:/www.myfonts.com/person/jacquette/cynthia/)   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:47pm",
      "content": "I also found those pages... but my teachers want a full biography of 1 page long. And I don't want to start making up things about there life. I really don't want to be THAT student :-)\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:09pm",
      "content": "Did you do a Google search? More stuff certainly comes up, such as [this story about the Zapfest with Jerry Campbell in it](http://web.archive.org/web/20131018110816/http:/www.creativepro.com/printerfriendly/story/14912.html). And [this tells you where Cynthia Jacquette went to school](http://web.archive.org/web/20131018110816/http:/graphicdesign.about.com/library/schools/newyork/blny7.htm) (for at least part of her schooling).\n\n"
    },
    {
      "time": "10 Jun 2004 — 1:16pm",
      "content": "With Google, searching those names results in many websites, mostly about a font or an event... and not about the person in question.   \nOther search engines gave the same results.\n\n"
    }
  ]
}
