{
  "id": "51688",
  "title": "How to properly typeset a.m. and p.m.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey all,\n\nI've recently run into a slight dilemma. I did a document and formatted the times in this method: hh:mm xx,(4:50 pm)\n\nMy client wants the times to all be in this format: hh:mm X.X. (4:50 P.M.)\n\nPersonally, I cringe at the thought of visually disturbing the flow of the text like that, but it made me wonder.\n\nWhat is the proper way, I know all forms xx, x.x., XX, and X.X. are accepted, but what is the most widely accepted, what do you as designers do, and are there prominent examples of use?\n\nThanks in advance for your insight on this matter, I never considered that I didn't know this before.\n\n",
  "author": "innovati",
  "time": "14 Nov 2008 — 1:05pm",
  "uid": "28142",
  "comments": [
    {
      "time": "14 Nov 2008 — 1:26pm",
      "content": "Small caps.\n\nCurt Akin\n\n"
    },
    {
      "time": "14 Nov 2008 — 1:28pm",
      "content": "oh, of course, the one thing I omit from my post.\n\nso small caps, but with or without periods?\n\n"
    },
    {
      "time": "14 Nov 2008 — 2:12pm",
      "content": "Without.\n\n"
    },
    {
      "time": "14 Nov 2008 — 3:28pm",
      "content": "I agree--without.\n\nYou will meet resistance to both lc and no periods. I have a customer who runs for The Chicago Manual of Style every time I make a style decision like this. CMoS goes with a.m. and p.m. So, she comes running to me waving the examples in 9.42. She never looked carefully enough to see the \"often appear in small capitals..., in which case periods are unnecessary.\"\n\nYou will be much happier if your face includes true sc rather than a set-small large cap.\n\nCurt Akin\n\n"
    },
    {
      "time": "14 Nov 2008 — 3:52pm",
      "content": "I had been hoping to use Myriad Pro regular SemiCondensed. No such luck with true small caps, but I could maybe beef it up to Myriad Pro semibold SemiCondensed and go for a smaller point size?\n\nWhat's average for Small Caps, 20% smaller than the cap-height of Full Caps?\n\nI just can't do full caps _with_ periods. I won't do it!\n\n"
    },
    {
      "time": "15 Nov 2008 — 1:02pm",
      "content": "It's better to use lowercase than fake small caps. There are many different acceptable styles for am/pm. Most important is to remain consistent throughout your project/identity.\n\n"
    },
    {
      "time": "15 Nov 2008 — 1:53pm",
      "content": "Full caps with periods just doesn't work with OSF. It's not so bad with lining figs.\n\n"
    },
    {
      "time": "17 Nov 2008 — 6:34am",
      "content": "In Ireland the 24-hour clock tends to be preferred... but it's considered bad form to omit the full stops from \"a.m.\" Why? Because while \"a.m.\" and \"p.m.\" are used in English, both are also used in Irish, and \"am\" is a noun meaning 'time' in Irish. So for consistency (particularly in light of bilingual invitations and so on) \"a.m.\" is recommended here.\n\nIn Irish \"roimh nóin\" and \"iarnóin\" are also used for \"before noon\" and \"afternoon\"; the abbreviations are \"r.n.\" and \"in.\" though \"i.n.\" is also seen.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "17 Nov 2008 — 10:24am",
      "content": "I'm sticking to small caps with periods. No ambiguities, and it just looks better to my eye.\n\npowers\n\n"
    },
    {
      "time": "17 Nov 2008 — 6:40pm",
      "content": "Yours is a more experienced eye than mine, Will, but I find that mildly surprising. Seems like redundant formatting. Wouldn't that be akin to underlining _and_ italicizing titles, or spacing out _and_ indenting paragraphs? Would you set \"The NASA launch is set for 10:30A.M.\" (with NASA and A.M. all in small caps)?\n\n"
    },
    {
      "time": "18 Nov 2008 — 2:00am",
      "content": "Certainly; acronyms and abbreviations are different. When speaking, you pronounce NASA, but you spell out A.M.\n\n"
    },
    {
      "time": "18 Nov 2008 — 4:16am",
      "content": "‘Periods are equally unnecessary in acronyms and other abbreviations commonly written with small or large capitals. Thus: 3:00 AM and 450 BC [small caps]; Washington, DC, and Mexico, DF;’\n\n_The Elements of Typographic Style_ Robert Bringhurst\n\nThe Oxford Guide to Style would have it as 4.50 p.m.\n\nPersonally I would prefer the small caps version with no stops.\n\nTim\n\n"
    },
    {
      "time": "18 Nov 2008 — 4:43am",
      "content": "Point taken; how about \"The FBI briefing is set for 10:30A.M.\"?\n\n"
    },
    {
      "time": "18 Nov 2008 — 9:32am",
      "content": "Craig,  \nThat 10:30A.M. looks bad to me. It just dominates too much.\n\nChrisL\n\n"
    },
    {
      "time": "18 Nov 2008 — 9:49am",
      "content": "Here are a few tries. Look at the last line which requires a period as an ending of a sentence. The double period looks awkward. What is done in that case?\n\n ![](http://web.archive.org/web/20150218043642im_/http:/typophile.com/files/1030am_6318.png)\n\nChrisL\n\n"
    },
    {
      "time": "18 Nov 2008 — 10:59am",
      "content": "To make matters even more complicated: What's up with the space between the time and the 'a.m.'/'p.m.' markers (however those may be formatted)? Some of you put in a space, some of you don't. To me personally, it looks rather horrid without the space, but I wouldn't know.\n\n"
    },
    {
      "time": "18 Nov 2008 — 11:10am",
      "content": "Dez, all those and you forgot to put FBI in small caps. :P\n\n"
    },
    {
      "time": "18 Nov 2008 — 11:54am",
      "content": "I hate seeing the space omitted. It seems to be quite common these days, but it looks wrong to me.\n\nT\n\n"
    },
    {
      "time": "18 Nov 2008 — 1:44pm",
      "content": "_‘Periods are equally unnecessary in acronyms and other abbreviations commonly written with small or large capitals. Thus: 3:00 AM and 450 BC [small caps]; Washington, DC, and Mexico, DF;’_\n\nThe Elements of Typographic Style Robert Bringhurst\n\nI love that book. i do agree though, small caps keep the flow, where as periods sometime stops it (I'm personally not a fan of the periods in the AM and PM).\n\ncourtney\n\n"
    },
    {
      "time": "18 Nov 2008 — 4:01pm",
      "content": "I'm not sure I can justify this any better to my friend the art history prof than by saying \"After many years this is what I prefer.\"\n\nMaybe on the grounds of disambiguation: the periods prevent \"A.M.\" from becoming \"AM,\" which is a word. I know, I know: in books for readers with any degree of smart much beyond a brick, this will not be an issue; they'll dig that it is time we are talking about here, not a state of existence.\n\nMaybe for some the periods \"stop the flow.\" Not for me.\n\nDez's dubble-period example is indeed horrid. But he needn't worry. In this case the period serves equally as part of the abbreviation and as the sentence terminal. You could look that up in Chicago at 9.42 (\"The first train leaves at 5:22 a.m. and the last at 11:00 p.m.\").\n\nWhich leads me to say, once again: Following Chicago or Bringhurst should always take second place to our own well-considered ideas of what helps a page. As long as they are indeed \"well-considered.\"\n\nHorrid also is the lack of a space following the hour number.\n\npowers\n\n"
    },
    {
      "time": "18 Nov 2008 — 4:37pm",
      "content": "Now all you guys have to do is find a publisher (or client) where the publisher's house style doesn't trump the latest typographic fashion. When you find them, please share.\n\n"
    },
    {
      "time": "18 Nov 2008 — 5:56pm",
      "content": "oh, not to worry on that count, Charles. By the time that client is found the typographic fashions will have been changed again. Sic semper tyrannis.\n\npowers\n\n"
    },
    {
      "time": "18 Nov 2008 — 6:10pm",
      "content": "10:30 ante meridiem\n\nChuck\n\n"
    },
    {
      "time": "18 Nov 2008 — 7:43pm",
      "content": "wow! tremendous insight everybody, thanks a ton! I'd love to keep hearing different persepctives on it.\n\nSome more specific information about the actual situation I'm dealing with right now. I am making a flyer equivalent to a conference schedule for a series of training sessions happening at a college here in my town. Space is at a premium and the chart has to fit within the width of a standard letter-sized sheet.\n\nI haven't be fortunate to have the shortest workshop names, and the names on the chart are literally usually half of the actual full name of each session already!\n\nI put the format as _'5:00 pm'_ and my supervisor requested _'5:00 P.M.'_ \"because that's the proper way to do it, and also to change the times throughout the body copy to that format as well to be consistent.\"\n\nI can understand including the 'pm' so people don't show up at 5 am to the college, but I think making the times that big and spaced out will ultimately break the flow of the chart, and if I do it my way in the chart, I must remain constant throughout the whole document.\n\nI am using Myriad Pro SemiCondensed, which unfortunately, doesn't have Small Caps that I could find anywhere. Here's a picture of what I've got so far:\n\n ![](http://web.archive.org/web/20150218043642im_/http:/typophile.com/files/chart_4587.png)\n\n"
    },
    {
      "time": "18 Nov 2008 — 7:58pm",
      "content": "Is it set in stone that you should be using Myriad? There are tons of sans serif fonts that look rather similar, and give you the same weight on the page. A little play on words early. I have found a new love...Stone Sans. It might not be what you're looking for, but just throwing that out there. I think the SC are the best option, it will satisfy both parties, and look good :)\n\ncourtney\n\n"
    },
    {
      "time": "18 Nov 2008 — 8:21pm",
      "content": "Yeah I'm locked into using Myriad, she tried forcing me to use Trebuchet like all of her previous print work and I fought for one we could both stand. Since she often wants to fit too much text into too little space, I found Myriad was one we both like, and the semi-condensed allowed us to save as much space as we could per line, without being too small and condensed to read.\n\nI have checked out Stone Sans, and I do like it, but I don't think I have the liberty of using it here unfortunately.\n\nI'm also worried, she wants me to create a power-point template using MSoffice fonts and I'm pretty sure she's going to revert back to using Trebuchet for all of her on-screen work. I like the feel of Lucida Sans but I don't know what to tell her to use for on-screen and web use.\n\n"
    },
    {
      "time": "20 Nov 2008 — 4:00pm",
      "content": "I haven't used this feature, but PowerPoint (Windows) has the ability to embed, or include, font files in its documents. There's also the option to package the presentation into a self-sufficient file with everything (fonts included) already in the package. You would have to verify the legality of this for the particular licenses of the font files you're using, but it may be worth looking into.\n\n[http://office.microsoft.com/en-us/powerpoint/HA010348241033.aspx](http://web.archive.org/web/20150218043642/http:/office.microsoft.com/en-us/powerpoint/HA010348241033.aspx \"http://office.microsoft.com/en-us/powerpoint/HA010348241033.aspx\")\n\n"
    },
    {
      "time": "20 Nov 2008 — 5:31pm",
      "content": "oooh wow, thanks for that **agarzola**! I had no idea that existed. I thought that sort of thing only started in the past couple of years and I never expected to look for it in office.\n\nI checked out the article, and the limitation is that it's only able to do this with TrueType fonts, but worth trying!\n\nNow lets check those fonts and licences.....I wonder what Truetypes I have that allow this sort of use.\n\n"
    },
    {
      "time": "20 Nov 2008 — 6:07pm",
      "content": "Glad to be of service, innovati. I only stumbled unto that article last week, while researching PowerPoint behavior regarding font substitution for a small rush project. In the end I didn't need to embed anything, as Georgia saved the day and, thus, I could get away with not worrying about font substitution. (A good thing, too… I use the Mac OS version of PowerPoint, which sadly —yet predictably— doesn't have embedding capabilities.)\n\nGood luck with your project!\n\n"
    }
  ]
}
