{
  "id": "51760",
  "title": "Arabic on Bilingual Signage",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "Arabic Typography & Type Design"
  ],
  "content": "I am a information designer in the UK and obviously know about using English typefaces on wayfinding and signage, but I know very little about using [Arabic](http://web.archive.org/web/20150415090310/http:/typophile.com/wiki/Arabic) Typography.\n\nI have a project coming up in Doha where bilingual signage will be used and wondered if anybody had any advice on using Arabic Type on signage? What are good font's to use? How to kern Arabic type? General rules of thumb?\n\nThanks\n\nHB\n\n",
  "author": "hb28",
  "time": "17 Nov 2008 — 4:10am",
  "uid": "14437",
  "comments": [
    {
      "time": "17 Nov 2008 — 5:20am",
      "content": "Click on my avatar and explore what is what?!  \nAll the Best with a bundle of Flowers  \n [http://okocin.blog.so-net.ne.jp](http://web.archive.org/web/20150415090310/http:/okocin.blog.so-net.ne.jp/ \"http://okocin.blog.so-net.ne.jp\")\n\n"
    },
    {
      "time": "17 Nov 2008 — 5:21am",
      "content": "Hi,  \nI would recommend a few things:  \n. decide in the first step on the hierarchy (which is more important or are they equal?)  \n. regarding kerning, the typeface will have that in it; if you meant tracking so as to space it out, you can insert kashidas (horizontal strips) but the place where you can add them depends on the words themselves.  \n. I find it much better if the Arabic is on top of the Latin or on its left  \n(if you look at the icon of my Frutiger Arabic you'll see what I mean)\n\nI hope this helps :)\n\ncheers,  \nNadine\n\n"
    },
    {
      "time": "17 Nov 2008 — 6:09am",
      "content": "\\>\\> I have a project coming up in Doha but  \nI know nothing about using Arabic Typography.\n\n1. Do not worry if you know nothing about using Arabic Typography,  \n... Just be fonty when you meet one of the Big Heads of Doha.\n\n2. I am not welcomed in Doha, though I know Arabic Typography.\n\n3. Congratulations with Flowers\n\n"
    },
    {
      "time": "17 Nov 2008 — 6:11am",
      "content": "Thanks Nadine that is a really great start...I was looking at Janna too.\n\n"
    },
    {
      "time": "17 Nov 2008 — 9:27am",
      "content": "Hello HB\n\n\\>\\>What are good font’s to use?\n\nFortunately our small community of type designers is growing. I \\*tried\\* compiling a quick inclusive list of links to browse through on my site, I hope it will be useful for you:\n\n[http://arabetics.com/more/more.html#Links](http://web.archive.org/web/20150415090310/http:/arabetics.com/more/more.html#Links \"http://arabetics.com/more/more.html#Links\")\n\nSaad Abulhab  \n [http://arabetics.com](http://web.archive.org/web/20150415090310/http:/arabetics.com/ \"http://arabetics.com\")\n\n"
    },
    {
      "time": "18 Nov 2008 — 2:21pm",
      "content": "Whatever you do, don't try to make the two scripts appear comparable in size. Sure, you shouldn't exacerbate the issue by using a Latin font with a huge x-height and/or a particularly delicate Arabic font, but the two scripts use the Cartesian area very differently, so if you think you've managed to make the Arabic appear almost as large as the Latin, that means you've probably ruined the Arabic. :-/\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2008 — 2:01am",
      "content": "Thanks for that. We typically use a cap height of 75mm on our signage when using a Latin font. How is this comparable. What part of the arabic font is measurable (ie and equivalent to x-height or cap-height)?\n\n"
    },
    {
      "time": "19 Nov 2008 — 7:07am",
      "content": "That's the thing, there's nothing like an x-height (and trying to force one has been the undoing of countless \"Latin-matching\" efforts). Furthermore, the ascenders and descenders don't always end horizontally. You really have to eyeball it. And to help things along you should allow the Arabic to take up more vertical space than the Latin, and maybe even allow it a darker weight than the Latin.\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2008 — 11:59am",
      "content": "Try to balance the visual weight of the two scripts, rather than height or other proportions. In the case of something like signage, you may find that this means using different relative sizes at different scales, and dependent also on the text. This sort of thing often freaks out signage designers, because they tend to like grids and want to be able to spec sizes that can be applied across a system to arbitrary texts. But if you are working with a small amount of known text, then it is easier to work in this way (similar to the way in which a stonecutter or calligrapher will lay out and balance a design).\n\n"
    },
    {
      "time": "22 Nov 2008 — 6:53am",
      "content": "John wrote:\n\n\\>\\>Try to balance the visual weight of the two scripts, rather than height or other proportions.\n\nThis is really the best way to put. John always has his way with words! I think matching weight and visually harmonizing few \\*abvious\\* ascenders and descenders would be very sufficient for balancing the two.\n\n-Saad\n\n"
    },
    {
      "time": "22 Nov 2008 — 10:19am",
      "content": "Why not try making English letters sit on Arabic Kashidas like \\_\\_\\_Road\\_\\_\\_?!  \nJust an alternative with [Flowers](http://web.archive.org/web/20150415090310/http:/www.typophile.com/node/51401)\n\n"
    },
    {
      "time": "22 Nov 2008 — 11:02am",
      "content": "[http://www.myfonts.com/fonts/fontbureau/magneto/](http://web.archive.org/web/20150415090310/http:/www.myfonts.com/fonts/fontbureau/magneto/ \"http://www.myfonts.com/fonts/fontbureau/magneto/\")\n\nhhp\n\n"
    },
    {
      "time": "22 Nov 2008 — 11:42am",
      "content": "Sorry Hrant for not making my point clear.  \n\"Road\" should be placed on the Kashida of شـــــارع\n\n"
    },
    {
      "time": "22 Nov 2008 — 3:01pm",
      "content": "Oh. Wow. That might be cool!\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2008 — 8:33am",
      "content": "\"This sort of thing often freaks out signage designers, because they tend to like grids and want to be able to spec sizes that can be applied across a system to arbitrary texts\"\n\nVery true especially when it comes to accessability. We like measurements we can check against tables to measure reading distances and so on. Are there any accessability guidelines in Arabic typography?\n\n"
    },
    {
      "time": "19 Dec 2008 — 2:11pm",
      "content": "From experience, Hrant comment in 19 Nov is the most accurate one, short from defining your Latin font choice and asking for a suitable Arabic one, you will start getting more confused rather than helped.  \nJohn\n\n"
    },
    {
      "time": "20 Dec 2008 — 2:54am",
      "content": "Sorry wrong node\n\n"
    },
    {
      "time": "16 Jan 2009 — 12:48pm",
      "content": "Worth Exploring:  \n [http://www.signsanat.com/cataloge.html](http://web.archive.org/web/20150415090310/http:/www.signsanat.com/cataloge.html \"http://www.signsanat.com/cataloge.html\")  \nHappy Downloading with [Flowers](http://web.archive.org/web/20150415090310/http:/www.typophile.com/node/51401)\n\n"
    },
    {
      "time": "18 Jan 2009 — 6:04pm",
      "content": "In Marrakech nearly everything was bilingual French and Arabic with an attempt to give the two equal weight\n\nOften the French was done in a monoline (or close enough to one). The Arabic had a much larger height, but resulted in the horizontal stroke of the Arabic to be actually slight thinner in general than the thickness of the Latin strokes. I thought it was odd but it matched okay. I should have taken more pictures but I didn't but I'll post later an example\n\nOddly in the airport they had the Arabic on the right and French/English on the left, both aigned rather unnaturally, with the French/English right aligned and the Arabic left aligned =\\\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "19 Jan 2009 — 3:58pm",
      "content": "As promised here's the sign.\n\n ![](http://web.archive.org/web/20150415090310im_/http:/typophile.com/files/IMG_3788_5454.jpg)\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
