{
  "id": "51794",
  "title": "21st Century Design Movements?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've got a dilemma trying to find a design period after the Postmodern Movement?\n\nCan anybody tell me if is there a design period after Postmodernim?....\n\nThanks\n\n",
  "author": "Bites of Life",
  "time": "17 Nov 2008 — 4:02pm",
  "uid": "30149",
  "comments": [
    {
      "time": "17 Nov 2008 — 6:43pm",
      "content": "Well, I'm no expert, but I think that a part of the post-modernism movement was pluralism in society, the acceptance of multiple concurrent styles in varying directions.\n\nI don't see that ending, and I certainly see it in the world around me. There will always be certain Milestones in design, be it good or bad, that all of the styles have to endure and survive through.\n\n'Web 2.0' and whatever the heck that means anyway, is certainly purported to be a 'design style' that people want and misapply. I'm sure this will be remembered as a failed sidenote of design history in the future.\n\nHope that at least gives you some idea that might help you spring off and find some information that could be valuable to you.\n\nBest of luck on your search!\n\n"
    },
    {
      "time": "18 Nov 2008 — 4:06am",
      "content": "Thank you innovati,\n\nI've posted a new topic in the design section. It has few questions about my research, it would be great if you fancy to participate.\n\nThanks very much for your comment. I've recently heard about Web 2.0 and, I didn't have any idea about it. Your argument is very sensible and I reassures my point of view.\n\nMany thanks.  \nBest wishes,  \nLaura\n\n"
    },
    {
      "time": "19 Nov 2008 — 9:42pm",
      "content": "Laura,\n\nMy humble opinion is that we are too close in time, to the period that we call \"postmodern design\", to give a name to what came afterwards. However, there is an excellent essay/interview with Rob Giampietro that appeared in Emigre 65 (or was it 64?), \"Default Systems in Graphic Design,\" which you can find [here](http://web.archive.org/web/20150122202400/http:/www.studio-gs.com/writing/index.html).\n\n(For some more comments on Emigre 64, a.k.a. \"Rant\" see the Speak Up discussion [here](http://web.archive.org/web/20150122202400/http:/www.underconsideration.com/speakup/archives/001794.html#001794).)\n\n"
    },
    {
      "time": "20 Nov 2008 — 7:09am",
      "content": "Postmodernism emerged before digital culture.  \nAs something that is more related to the technology of the present era, perhaps Populism--meaning that whereas before, design was the preserve of a professional minority, now it is something that anyone can do.  \nPerhaps not in every field of design, but certainly in graphic design and typography.\n\nRelated to this, and the idea of Defaultism, is that as with any technological revolution that makes a previously professional skill do-able by anyone, automation is a feature of Digitalism, so amateur practitioners will stick with the pre-sets, and this most basic mode will be adopted by professionals, as they shift their attention to meta-levels of design.\n\nNot to say that Populism wasn't around before--the Last Whole Earth Catalogue (1970) advocated a grassroots socio-political revolution riding the technology of photocopiers and IBM Selectrix (golf ball strike-on) typesetting. Punk-rock zines followed through on that.\n\n(Fontism.com is presently under construction, as the making of fonts is getting in the way of making that a movement. But perhaps it already is.)\n\n"
    },
    {
      "time": "20 Nov 2008 — 12:55pm",
      "content": "I think we have to watch the art world a bit on this. The whole \"Post\" tag is a bit problematic in a way because it is so presumptive. How could art be created in contemporary culture that is not post-modern? I guess the answer is authentic primitivism, which given the current economic situation may be the hot new thing, but then we would have to completely lose the thread of history to get there.\n\nWe also flirt with the idea that artists no longer have to produce an object of commerce. Simple actions or perceptions can be art. Do they then have to be documented? What are the rules? Maybe this is post-art? If we conclude that artists are held up as great primarily to feed institutions that perpetuate the elevated value of the individual rather than on the basis of some super esoteric measure of skill that requires an expert to define, then the act of making art becomes naive, or simply no more revered than any other act. I'm totally wanking so I'll stop.\n\n"
    },
    {
      "time": "28 Nov 2008 — 1:55pm",
      "content": "Laura, I did not mention the term \"post-modern\" as an actually viable or reliable expression. Nick is right by saying changes happen on different levels, and often the formal and artistic movement express ideas which are also independent from them.  \nI like Innovati's answer, since he sees what are the positive elements following the many ideologies we could call \"modernity\". Although it could be misleading, it's maybe useful to relate modernity with the industrial revolution, but the idea of a fascination with \"modern\" is prone to emerge in any moment in history, so I would simply say I use \"post-modern\" to indicate a span of time where previous ideas are discussed, while looking for a balance renewal.\n\n<cite> I’m totally wanking so I’ll stop. </cite>  \nI agree… :LOL:\n\n"
    },
    {
      "time": "28 Nov 2008 — 2:11pm",
      "content": "Wasn’t it Elvis Costello who wisely noted that writing about art is like dancing about architecture, or something like that…\n\n"
    },
    {
      "time": "28 Nov 2008 — 6:59pm",
      "content": "Wiki.\n\n-=®=-\n\n"
    },
    {
      "time": "29 Nov 2008 — 2:39am",
      "content": "<cite> writing about art is like dancing about architecture </cite>  \nI firmly believe it all depends on how you write.  \nWe lack a broader language conception.\n\n"
    },
    {
      "time": "29 Nov 2008 — 8:16am",
      "content": "Well I guess having some opinion about the limitations up front probably yields better results. I don’t believe I’m the only person that has found the oddity in the post-modern tag. Everything now produced after 1954 can’t all be post-modern. I guess the neo prefix subverts the post power in some way. Outsider and naive art can include artists that never made it to a modern sensibility. Maybe I’ve just read the word conflate one to many times.\n\n"
    },
    {
      "time": "29 Nov 2008 — 6:07pm",
      "content": "<cite>I don’t believe I’m the only person that has found the oddity in the post-modern tag.</cite>\n\nYou're not alone! I made a comment about that over [here](http://web.archive.org/web/20150122202400/http:/typophile.com/node/52083).\n\nWords denoting a time period are fine, but when their meaning is synonymous with \"the present\" the term is immediately obsolete as time moves on, and then gets silly when appended to make it mean \"after the present\" (but isn't \"futurism\" which was a subset of \"modernism\" from nearly a century ago).\n\nWhat do we do when now becomes then and we need to describe the next now?  \nWithout indicating a guiding design feature or more general philosophy these words are nothing more than calendar markers, and ambiguous ones at that.\n\n"
    },
    {
      "time": "29 Nov 2008 — 7:26pm",
      "content": "[Neo-modernism](http://web.archive.org/web/20150122202400/http:/www.shinntype.com/Writing/NeoModrn.pdf)\n\n"
    },
    {
      "time": "29 Nov 2008 — 7:35pm",
      "content": "Brown space \\< perfect\n\nJust say no to post Post Toasties.\n\n"
    },
    {
      "time": "30 Nov 2008 — 2:15pm",
      "content": "What about the Aesthetics Age (Style and design)?\n\nI was reading the essay written by Mr.Keedy for Emigre No.67 (I had it in my notes...cant find it online anymore) the name is 'STYLE IS NOT A FOUR LETTER WORD'\n\nIt is really good! I found very interesting the points he make about the use of the ornament in graphic design today, how culture is understood through sytle, how modernism made the issue of style much easier for designers to deal with, since it gave them a style that they could pretend was not a style\n\n"
    },
    {
      "time": "5 Dec 2008 — 6:30am",
      "content": "Thanks, Nick… :=)  \nSince it's from 2000, have you written some other thing afterwards? (maybe more general and not only related to these designers)\n\n<cite>«Symmetry suggests repose, but we wanted activity»</cite>  \nInteresting, with all that it may imply… :=) I guess I am for an alternation of the two, and it's also what I see in history.\n\n<cite> What about the Aesthetics Age (Style and design)? </cite>  \nMaybe you have a point, related to the purely modern incapacity of judging often the substance in favor of an appearance…\n\n<cite> I was reading the essay written by Mr.Keedy for Emigre No.67 </cite>  \nWell, Mr. Keedy's notes used to be sometimes disjointed, although he improved considerably later on.  \nI remember his feature in Emigre #15: in the end he had to make sense out of Keedy Sans, to release it as a typeface, and it came out really good.\n\n"
    }
  ]
}
