{
  "id": "51795",
  "title": "Amarantino, ready for critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "After a long (but very beautiful...)path I'm about to consider finished the first weight of Amarantino. But I want some feedback from the community of well in(formed) typeface and typography designers.\n\nAmarantino ExtraLight has been developed over a period of 10 months (January to October 2008) as a sans serif versatile family with clean visual presence. The family is still in development and it will be formed by 5 weights (ExtraLight, Light, Regular, Bold, ExtraBold) and italics designed to communicate confidence and authority.\n\nAs always, existing designs have often been the source of inspiration for the creations of new ones. Amarantino is no exception and similarities can be found in the Sebastian Lester Soho™ typeface. My goal was not to copy but respect this source and turn my creation into something unique and with personal flavour.\n\nThe name Amarantino comes from the natural born from the city of Amarante in Portugal. The author is an Amarantino.\n\nAmarantino is suitable for a variety of applications including medical, finance, transport, culture and high tech industries.\n\nThanks in advanced  \nAntónio Fonseca\n\n| Attachment | Size |\n| --- | --- |\n| [Amarantino.pdf](http://web.archive.org/web/20150414230712/http:/typophile.com/files/Amarantino.pdf) | 549.88 KB |\n| [AmarantinoExtraBold\\_text1.pdf](http://web.archive.org/web/20150414230712/http:/typophile.com/files/AmarantinoExtraBold_text1.pdf) | 930.73 KB |\n| [AmarantinoExtraBold\\_text2.pdf](http://web.archive.org/web/20150414230712/http:/typophile.com/files/AmarantinoExtraBold_text2.pdf) | 847.47 KB |\n\n",
  "author": "afonseca1974",
  "time": "17 Nov 2008 — 4:08pm",
  "uid": "22399",
  "comments": [
    {
      "time": "17 Nov 2008 — 6:29pm",
      "content": "Overall, I think this is great. The \"s\" is the one thing that really jumps out at me. The curves just don't feel quite right, maybe the bottom could be a bit heavier than the top and not be such a mirror. In the numbers, digits like 5, 6, 8, 9, felt a bit more geometrically forced than the alphabet, which feels really well resolved. Other than that, none of the other characters bothered me, and felt very natural to the typeface.\n\n"
    },
    {
      "time": "17 Nov 2008 — 7:57pm",
      "content": "I think you need more space between the dot and the body of i and j - they run together to form \"exlstlng deslgns\" etc.\n\nr (and t?) might be a little too narrow.\n\nSomething about these letters reminds me of those plastic lettering stencils you can run a pencil around.\n\n"
    },
    {
      "time": "20 Nov 2008 — 10:07am",
      "content": "Hello Antonio.\n\nYou should check the kerning on lowercase \"fo\". Other than that it flows very nicely. I like it!\n\nKeep up the good work!  \nPedro Peixoto\n\n"
    },
    {
      "time": "20 Nov 2008 — 11:59am",
      "content": "The S and s seem to flat.  \nThe stem that follows the point where the stem and curve join on the m, n, a, d, r, q, and g seem quite short (especially at the text sizes). I might suggest making those a bit deeper. Especially if you make bolder versions you'll find you'll have to compensate quite a lot more.  \nThe P, R, M, N, and W seem a little wide.\n\nGo Portugal!\n\n"
    },
    {
      "time": "24 Nov 2008 — 5:19pm",
      "content": "Hi everyone!\n\nThanks for the comments.  \nAfter a carefully analises I made some changes:\n\nNew S and s.  \nMore space between the dot and the body of i and j. Made the same adjust in accents.  \nNew r and t.  \nStem a little deeper on m, n, a, d, r, q, g.  \nNew P, R, B, M, N, W and w.  \nNew d and g.  \nPlease let me know your opinion\n\nThanks in advance  \nAntónio Fonseca\n\n"
    },
    {
      "time": "25 Nov 2008 — 9:47am",
      "content": "This looks very nice and as an aspiring type designer I admire anyone who has the courage to post their designs here.\n\nI was told a long time ago by a man called Bernd Möllenstadt that you should design the bold version of your face first or at least draw some bold characters early on in the design process.\n\nYour design – which looks very fresh and clean– seems completely monoline. What will happen when the weight increases and the counters get smaller? Will it remain monoline which I don't think it can in heavier weights or will it become more stressed?\n\nI am really looking forward to seeing the bolder cuts and the very best of luck with it.\n\n"
    },
    {
      "time": "25 Jan 2009 — 3:22pm",
      "content": "Hi everyone!\n\nAfter some weeks I’m about to consider finished the ExtraBold weight of Amarantino (see link in first post).  \nPlease give me your feedback!  \nI would like also to know your opinion if you consider that they share the same \"DNA\"...the ExtraBold and ExtraLight (some letters look a little different...)\n\nThanks in advance!\n\nAntónio Fonseca\n\nPS- No spacing or kerning\n\n"
    },
    {
      "time": "26 Jan 2009 — 2:32am",
      "content": "مدهش  \nAmazing..\n\n"
    },
    {
      "time": "26 Jan 2009 — 2:38am",
      "content": "They look good as a whole. Although \"j\" and \"J\" bottom curve distracts me as well as \"w\" middle leg as it's on op top nor in the middle, think you need to find a comfortable position for it. \"5\" also could use a tweak or two.\n\nBut as I said, they look great overall.\n\nKeep it up!\n\nPedro Peixoto\n\n"
    },
    {
      "time": "28 Jan 2009 — 12:05pm",
      "content": "I like you typeface. Here some comments. In the thin version I think you will have to redraw your S, s at my point of view. Here my suggestion : your design as a kind of “square” look in their curves and I don't find that in the S. The outside of the s is too round, try to work with the curve of the c, g. I wonder if the problem come from the spin, it could be less oblique to leave more space to draw a higher curve on both side. Some letters in the extra bold are a bit out of your thin version. Look your k the two oblique join the vertical stem nor in the thin version. Also there are some bump in the cure (pqbdnm) and the horizontal line in the number seems a bit to large. Hope this will help you.\n\n"
    },
    {
      "time": "20 Feb 2009 — 6:16pm",
      "content": "It's been a long time since i saw your typeface on the \"Anatomia Tipografica\" course. I think it's coming out really well, I'm really interested in seeing how you are going to solve the other weights.  \nThe other users already gave you some great hints, so i won't repeat what they said.\n\n**Keep up the good work & keep in touch!!!**  \nPedro Leal\n\n"
    },
    {
      "time": "31 Aug 2009 — 4:05pm",
      "content": "Hi everyone!\n\nAgain...after a long path I’m about to consider finished the extrabold weight of Amarantino, but as always I want some feedback from the community! (Please see AmarantinoExtraBold\\_text1.pdf and AmarantinoExtraBold\\_text1.pdf in first post)\n\nI decided to place some text in several language that the typaface can be used in order to get some special feedback, special on diacritics. I did study a little their construction but I think is easier to see them on text and ask a native reader to get some input.\n\nI noticed that some more arragement on the Kerning are necessary.  \nPlease let me know your comments on my work!  \nThanks in advance.\n\nAntónio Fonseca\n\n"
    },
    {
      "time": "1 Sep 2009 — 1:33am",
      "content": "I really like it! :) Except for the numbers, those don't have the same style like the letters. Also, the top joint of the \"g\" needs some enhancement. ;(\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "4 Dec 2009 — 10:19am",
      "content": "Did you draw in Fontlab or Illustrator\n\n"
    },
    {
      "time": "5 Dec 2009 — 8:26am",
      "content": "Very nice - delicate but firm.\n\nI'm only looking at the base alphanumerics for now.\n\nFirst thing: spacing too tight (even though this be used mostly very large).\n\nI would shorten the descenders, and raise the tittles.\n\n6/9: I like them, but I wonder if they clash.  \nBut maybe since they're not alphabetic it's OK.\n\nL: Too wide.\n\nM: Try splaying it.\n\nP: Bigger head.\n\nQ: Tail no good. Maybe try a detached one?\n\nW: Too narrow.\n\nX: Too wide.\n\nk: Unhappy. I'd put some curve in it.\n\nhhp\n\n"
    },
    {
      "time": "28 Oct 2010 — 3:35pm",
      "content": "hi - beautiful work! I am very interested in using this font! I am designing a label for a Portuguese wine. Is it available for purchase?\n\n"
    },
    {
      "time": "29 Oct 2010 — 2:19am",
      "content": "Ask the designer:  \n [http://typophile.com/user/22399/contact](http://web.archive.org/web/20150414230712/http:/typophile.com/user/22399/contact \"http://typophile.com/user/22399/contact\")\n\n"
    }
  ]
}
