{
  "id": "51822",
  "title": "Does anybody know this font? It looks like Century Gothic, but not quite the same",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Hi,\n\nI'm looking to match this typeface. It looks like Century Gothic, but it is exactly the same.\n\nThanks  \n-Dave\n\n ![](http://web.archive.org/web/20130129042559im_/http:/typophile.com/files/sample_3420.jpg)\n\n",
  "author": "popinfresh",
  "time": "18 Nov 2008 — 8:36am",
  "uid": "3520",
  "comments": [
    {
      "time": "18 Nov 2008 — 8:42am",
      "content": "Futura Heavy  \n [http://www.fontshop.com/fonts/singles/elsner\\_flake/futura\\_heavy/?sample\\_...](http://web.archive.org/web/20130129042559/http:/www.fontshop.com/fonts/singles/elsner_flake/futura_heavy/?sample_text=WATSON-FORSBERG \"http://www.fontshop.com/fonts/singles/elsner\\_flake/futura\\_heavy/?sample\\_text=WATSON-FORSBERG\")\n\n"
    },
    {
      "time": "18 Nov 2008 — 8:50am",
      "content": "Perfect. Thanks!\n\n"
    },
    {
      "time": "18 Nov 2008 — 9:00am",
      "content": "I guess it’s an amateur free font, cause it’s so horrible.  \nJust look at the counter of the ‘O’!  \nIf this is a Futura at all it’s the worst cut of it I’ve ever seen.\n\n"
    },
    {
      "time": "18 Nov 2008 — 9:28am",
      "content": "It's the bad old Adobe version, from the first batch of Type 1 fonts they released back in the Eighties. It was fixed years ago, but a lot of people never upgraded.\n\n"
    },
    {
      "time": "18 Nov 2008 — 11:35am",
      "content": "Yecch. I was thinking it could be a badly traced logo...\n\n- Lex\n\n"
    },
    {
      "time": "18 Nov 2008 — 5:37pm",
      "content": "Was the data at that time Adobe's? Or were they importing someone else's data to create the font?\n\n"
    },
    {
      "time": "18 Nov 2008 — 7:59pm",
      "content": "That's a good question. I don't know the answer. I just remember that the early Adobe fonts were a little uneven. I still have the floppy disks. I got my \"Futura 2\" disk from Linotype through a service bureau. The Linotype and Adobe font data was identical, as I recall. I'm sure the tools they used to make those early fonts was nothing like what we have now. They probably had to work out the outlines on graph paper, type raw PostScript code into a terminal and send it to a Laserwriter to see what it looked like, for all I know.\n\n"
    }
  ]
}
