{
  "id": "51832",
  "title": "Arts organization getting ready to re-logofy",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello friends,\n\nI think I posted this logotype here a while ago, but I wanted to run it by you again, as we're getting ready to do a little rebranding.\n\nThe Fort Wayne Dance Collective is a 30-year old non-profit arts organization in Fort Wayne, Indiana, which focuses on movement, rhythm and language as a performance art. Although the organization started as a modern dance studio, it's grown to be much more than just dance, and it incorporates a school with dozens of kinds of classes, a taiko drumming ensemble, a jenbé drumming ensemble, yoga, t'ai chi, etc.\n\nThere has been talk of changing its name, since \"Dance Collective\" is no longer completely accurate, but since that has been our name for 30 years, and that's what everyone knows us by, that may not happen.\n\nWe're waiting to get a grant for a big rebranding campaign from a local Advertising & PR firm, and although they'll be doing a lot of work for us, something I wanted some preliminary help with from you fine folks is our logo. It is (hopefully) going to get redesigned.\n\nI have some background in design, but not so much as I think I could take on this task. I want to run our current logo by you and see what you might do to make it looks better, so when I go to them with some basic ideas, I won't sound like an idiot.\n\nAnyway, here's the logo and the wording:\n\n ![](http://web.archive.org/web/20131108224145im_/http:/typophile.com/files/FWDClogotype_6330.jpg)\n\nBefore I came, the little pair of people dancing were not enclosed in a circle, so everytime they were displayed, it looked insignificant and too engulfed by white space. I inversed the dancers and enclosed them in a purple circle, which is FWDC's main color. I haven't had the heart to nix the little spirally things and the confetti, as my director really loves it.\n\nThe type is in DaVinci, which was brought to the table by a cheap freelancer 8 or 9 years ago. I like what it is trying to accomplish, but I just don't like how the letters connect together. I tried to bring in the kerning a little bit, but it just doesn't do it for me.\n\nI would like this to morph into something that is a really nice, tight, self-contained design. At the same time, though, I want to convey that the Dance Collective is a progressive, revolutionary arts org that is on its way up in profile, but still maintains its grassroots, something that's few and far between here in conservative northeast Indiana.\n\nAny suggestions or ideas? I would love to hear any of them.\n\nThanks!\n\n-Andy Welfle\n\n",
  "author": "awelfle",
  "time": "18 Nov 2008 — 12:00pm",
  "uid": "39747",
  "comments": [
    {
      "time": "20 Nov 2008 — 2:01am",
      "content": "The mark is too complex. Simplify it.\n\nUse lettering instead of type.\n\n- Lex\n\n"
    }
  ]
}
