{
  "id": "5184",
  "title": "Nomad Typeface",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "Flash movie is 464k and includes sample alphabet, typing platform and design notes.   \n   \n_{Moderator's Note: This is a must-see and is well worth the download._}\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150418174527im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">nomad<br><a href=\"http://web.archive.org/web/20150418174527/http:/www.typophile.com/forums/messages/29/nomad_typeface.swf\"><b>nomad_typeface.swf</b></a> (464 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n",
  "author": "anonymous",
  "time": "19 Sep 2001 — 9:56am",
  "uid": "1203",
  "comments": [
    {
      "time": "19 Sep 2001 — 10:55am",
      "content": "Sorry to post a negative comment, but I just have to say I can't stand irritating interfaces like this. Whatever typographic design message you are trying to send is completely lost on me, for one.\n\n"
    },
    {
      "time": "20 Sep 2001 — 9:39am",
      "content": "Byoungil, an idea: have you thought of \"programming\" the letters to react to other letters around them? Maybe even to change over time, like in the game of Life.   \n   \nDavid: It's not just the dictionaries that have a problem distinguishing legibility and readability...   \n   \nhhp\n\n"
    },
    {
      "time": "20 Sep 2001 — 10:50am",
      "content": "I think it's certainly legible (one is able to   \ndistinguish one letter from another) with some   \neffort. In fact there's a great surprise in   \ndiscovering that they are indeed letters. I think   \nthat's what makes this experiment so interesting,   \nit engages the viewer/user in ways other faces   \ncannot.   \n   \nRudy Vanderlans had this to say about legibility:   \n   \nIn regards to legibility, the Dutch designer Peter   \nMertens once said it best: \"Typefaces are legible.   \nIf some things are not legible, then they are not   \nletters. Illegible letters do not exist.   \nIllegibility does not exist.\" That, as far as I'm   \nconcerned, pretty much answers the question   \nregarding illegibility.   \n   \nThe full text of the interview is at   \n [http://www.emigre.com/VanderLans.html](http://web.archive.org/web/20150418174527/http:/www.emigre.com/VanderLans.html).   \n   \nIt's worth noting that this has nothing to do with   \nreadability...   \n   \n//joe\n\n"
    },
    {
      "time": "20 Sep 2001 — 11:41am",
      "content": "Thanks for making the distinction between legibility and readability. But by doing so you have effectively validated the relevance of both! The RvL quote is really too simple-minded. Saying \"legibility does not exist\" is like saying \"communism does not exist\". No concept can exist in its pure state, sure. But even though the Soviet Union was not -and could not have been- a \"pure\" communist state, it was certainly more communist than the USA. In the same way, Quadraat is more legible (and certainly more readable) than FF Extra. Pretending otherwise is often an escape from having to take the non-artistic issues in typography/type\\_design seriously, and this leads to inferior communication.   \n   \nNote that intentionally downplaying legibility is something else. It's OK, as long as you have good reason to do it. But legibility \\*does\\* exist, and how!   \n   \nhhp\n\n"
    },
    {
      "time": "20 Sep 2001 — 11:59am",
      "content": "Hah. Good points. I should say that I haven't   \nbought RVL's argument outright. But I do think it's   \nuseful as a way to put legibility in context.   \n   \nYou can see how, in the case of Nomad (and even in   \nthe some of the old Ray Gun stuff) how the seeming   \nabandonment of legibility is just another design   \n'element' or 'treatment' (for lack of a better   \nword). That diminished legibility requires readers   \nto participate more closely or more actively. When   \nthis is used properly it can be powerful or   \ndelightful or engaging. Used improperly you could   \nlose your audience and fail to communicate your   \nmessage.   \n   \nIn essence I agree with you Hrant. It takes a good   \nunderstanding of the rules of legibility and   \nreadability (and the distinctions of the two) in   \norder to intentionally break them and achieve a   \ndesired result.   \n   \n//joe\n\n"
    },
    {
      "time": "19 Sep 2001 — 11:19am",
      "content": "Dear Byoungil   \n'Astonishing' is the only word that comes to mind. A great tutor of mine from many years ago, Antony Froshaug RIP, would have loved the innovation and the lateral thinking behind 'Nomad'. I can't wait to see it used on the cinema screen...perhaps innovation will breed innovation with some enterprising typo0grapher out there...Congratulations again!   \n   \nTony Fahy\n\n"
    },
    {
      "time": "19 Sep 2001 — 2:19pm",
      "content": "Help! I think my childhood Spirograph set is posessed!   \n   \nI am really impressed by the interaction of the various cells, and the surprising gestalt legibilty. This really would be an interesting face for movie or web page titles. And it's fun to poke at the interactive characters and see how they react. ![:)](http://web.archive.org/web/20150418174527im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nMy only major design concern is that the \"D\" and the \"O\" are a bit too similar, making them hard to distinguish. Have you tried making an \"O\" out of three overlapping concentric cells, rather than overlapping portions of the cells, as in the \"D\"?   \n   \nCongratulations on a truly interesting experiment.   \n   \nDavid Thometz\n\n"
    },
    {
      "time": "19 Sep 2001 — 9:12pm",
      "content": "Biologically speaking the cells which make up the basic building   \nblocks of the human body are structurally the same. Yet, in the face   \nof this, we still develop into recognizable individuals. How it this   \nso? Because each individual has a distinct DNA code which differs   \nfrom all others. The result of all this blending of individualism is a   \nactive structure called society.   \n   \nNomad is an interactive typeface based on this socio-biological   \ndiagram of human society, where basically each character   \n(biological entity) consists of independent cells each with their   \nown given code. Once typed, these codes work together to form the   \nNomad characters. As these characters grow into words, sentences   \nand eventually paragraphs they in turn from lager reactive structures   \neach with their own unique identities.   \n   \nUnlike other typefaces in its similarity to biological creatures,   \nNomad relies on its complex structure and its ability to react to   \ntouch to create a more fluid relationship between the user and itself.   \nBased on the aforementioned principles, I have designed two prototype   \nversions of the Nomad typeface. One, which manifests its independent   \nof external stimuli through motion, and the second which has an   \ninteractive component that reacts to external stimulus, thus allowing   \nit to recognize the presence of the user.   \n   \nHandwriting allows one to establish the existence of its creator as it   \ndiffers from person to person. Nomad act like handwriting in a network   \nsituation expressing the existence of the other user through the state of   \nits interactivity or motion. As a result of this type of mediation we can   \nbegin to be felt across the network.   \n(originally Nomad was developed for touch screen)   \n   \nThanks for the advice. It encourage me to do another project.\n\n"
    },
    {
      "time": "20 Sep 2001 — 12:51am",
      "content": "Whow, that's one of the most interesting graphical type experiments I've seen in a long time. But I wouldn't use the word legibility anywhere near it. It's art based on letters, but would fail as a means of passing on information. And it just kept me from work for a surprisingly long time :-)\n\n"
    },
    {
      "time": "20 Sep 2001 — 8:54am",
      "content": "Gerhard:   \n   \nI agree, this isn't a typeface that anyone should use to set a text block. That's why I was careful to use the word \"gestalt\" when describing its legibility. (Is \"readability\" perhaps the preferred term here? All of my dictionaries give almost identical definitions for the two words, i.e., \"capable of being read.\")   \n   \nIn any event, it is fascinating how the cells' overlapping shapes coalesce into recognizable glyphs that can and do, in fact, succeed in communicating information. Not large amounts of information, mind you, but with proper attention paid to spacing, setting and context, this typeface certainly lends itself to display/head information.   \n   \nDavid Thometz\n\n"
    },
    {
      "time": "26 Dec 2001 — 2:21pm",
      "content": "that's a lot of fun.   \n   \nhave you seen peter cho's   \ntype me, type me not ?   \n   \n [http://acg.media.mit.edu/people/pcho/portfolio/typemenot.html](http://web.archive.org/web/20150418174527/http:/acg.media.mit.edu/people/pcho/portfolio/typemenot.html)   \n   \nIt makes me wonder what animation between letterforms would look like....   \n   \nsmall points:   \nSeemed a little slow on my mac. Is there something that can be done to speed it up/make the file size smaller? If the animation is tweened, try adding a blank 1 sec audio sample set to stream. It'll force the movie to keep up with the audio and drop frames...   \nAlso, I'm not sure how I feel about the small interior circles...   \n   \n-zach\n\n"
    },
    {
      "time": "19 Sep 2001 — 10:50am",
      "content": "Dear Byoungil,   \nI don't know what to say! This is simply too cool to exist. A lot of people talk about making letters move, taking them into the 4th dimension, blah blah blah, but 99% of it is just boring crap. This is the real thing, and I for one will be spending a lot of time looking at/into it, and I'm sure I'll learn a lot from it. Keep it up!   \n   \nhhp\n\n"
    }
  ]
}
