{
  "id": "5185",
  "title": "New (Poster and Font)",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I am new to typophile and wanted to post this font I started working on. It is a hybrid font consisting of helvetica and bodoni. I am thinking of making a serif face from this face and just wanted to know what people thought. Thanks.   \n ![UC](http://web.archive.org/web/20131023031903im_/http:/www.typophile.com/forums/messages/29/38103.jpg)   \n ![LC](http://web.archive.org/web/20131023031903im_/http:/www.typophile.com/forums/messages/29/38104.jpg)\n\n",
  "author": "calbuc",
  "time": "11 Jun 2004 — 9:28am",
  "uid": "3954",
  "comments": [
    {
      "time": "11 Jun 2004 — 9:47am",
      "content": "Welcome to Typophile!   \nThis design would have been a big hit... in the 90s. :-/   \nI wouldn't want to discourage you, and if it's something you're motivated to finish you should definitely do so - at the very least it would be a good learning exercise. Just know that many people will think \"there's another one\", even if it's actually unique in some way.   \n   \nTry this, if you like: figure out what you really like about Helvetica and Bodoni, and make a totally new font based on that. Make the forms not by literal splicing, but by... \"abstract synthesizing\"?   \n   \nBTW, that loaf on your site makes me hungry! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jun 2004 — 9:56am",
      "content": "En el mundo tipografico existen mitos que te pueden sacar de apuros en momentos de respuestas rapidas.   \nUno de esos mitos es que bodoni y helvetica se aman, las pongas, como sea siempre funcionan.   \n   \ncreo que es un enriquecedor ejercicio tomar las dos y hacer un hibrido en la que ninguna tranza con su forma y encontramos una \"heveticoni\". No se como funcione impresa eso si.   \n   \ni think is very important, before you combine both families you must equal the x heights.   \nif you work with the same x height, you must avoid the monster characters like the \"s\", the \"g, \"c\", and \"S\".\n\n"
    },
    {
      "time": "11 Jun 2004 — 9:58am",
      "content": "En el mundo tipografico existen mitos que te pueden sacar de apuros en momentos de respuestas rapidas.   \nUno de esos mitos es que bodoni y helvetica se aman, las pongas, como sea siempre funcionan.   \n   \ncreo que es un enriquecedor ejercicio tomar las dos y hacer un hibrido en la que ninguna tranza con su forma y encontramos una \"heveticoni\". No se como funcione impresa eso si.   \n   \ni think is very important, before you combine both families you must equal the x heights.   \nif you work with the same x height, you must avoid the monster characters like the \"s\", the \"g, \"c\", and \"S\".\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:42am",
      "content": "Hrant--I know the concept behind this font is dated and could have been done in the '90's and I am in the process of doing just what you described. I am working on a new face that would blend the characteristics of a classic serif and modern sans serif font. I still think that a hybridized font still has it place in today's typography, even though this needs a lot of work. I want a versatile font that can hopefully add to some of my motion graphic work. Thanks for you response.\n\n"
    },
    {
      "time": "11 Jun 2004 — 2:43pm",
      "content": "I agrre with Hrant. Nice work but dated. In some ways I miss the 90's and all the great experimental type design that was going on.   \nI have wondered if this type of design still worth doing as commercial work, but when I am honest with myself I realize it must be extraordinary (in execution as well as concept) if it needs to sell., and still I doubt it can be successful. Your work is nice but not exceptional. Similar fonts have already been fused and I think you need to make this more unique if it is intended to make you money. For personal use who cares as long as you enjoy building it and learn from the experiment. Good luck.   \nTo help you with any research check out Michael Worthington, Geoff Kaplan (Sucker), Stephen Farrell (Missive, Entrophy), Jonathan Barnbrook (Drone), Max Kisman (Fudoni). Rodney   \nFehsenfeld (Canadian Photographer)   \nOf all the hybrids out there I think the Frakture/Sans hybrids are the nicest.\n\n"
    },
    {
      "time": "12 Jun 2004 — 11:43am",
      "content": "_if it's something you're motivated to finish you should definitely do so - at the very least it would be a good learning exercise_   \n   \nHi, Calvin. I agree with hhp's comments. I'm sure that it will be a good learning experience for you to keep working on this design. You'll gain knowledge that you can apply to your next typeface.\n\n"
    },
    {
      "time": "28 Jun 2004 — 2:55pm",
      "content": "Random thoughts from the padded cell:   \n   \nMy very first reaction to your sample was _\"Why the funky serifs?\"_  \n   \nAfter examining the letters a bit more, it seemed to me that there was no particular reason for _any_ of the serifs to be where they are. Some of them don't even make any sense at all (uppercase **E** for instance). This may be fine for a headline in some trendy magazine but I would _hate_ having to read a full page of text set in this.   \n   \nI'm sure you devoted some time formulating the underlying design-concept of this font but I'm sorry to say that it doesn't show up in this specimen at all. The first word that does come to mind here is _\"random\"_ and that is never a good word in the context of a font (unless you are Erik van Blokland of course).   \n   \nThat being said, I would ask you to carry on and refine your design, despite the slashing here. It wouldn't be fair if your very first effort became the next Univers, right?\n\n"
    }
  ]
}
