{
  "id": "51855",
  "title": "Roman type, Blackletter type, Gaelic type",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Over on the Wikipedia I'm involved in a rather frustrating [dispute about typographic classification](http://web.archive.org/web/20150420085343/http:/en.wikipedia.org/wiki/Template_talk:Typography_terms). It seems that most mainstream classifiers (from Vox on) have just ignored Gaelic types. Though some specialist literature describing them exists (incliuding a [page of my own](http://web.archive.org/web/20150420085343/http:/www.evertype.com/celtscript/fonthist.html), there doesn't seem to be anything generic that deals with classification or subclassification.\n\nI'm sort of wondering how this oversight can be corrected. I'll raise the issue with Mary Anne Bolger [tomorrow](http://web.archive.org/web/20150420085343/http:/typophile.com/node/51766) but I wonder what people here think.\n\nMichael Everson  \nevertype.com\n\n",
  "author": "evertype",
  "time": "19 Nov 2008 — 2:40am",
  "uid": "6281",
  "comments": [
    {
      "time": "19 Nov 2008 — 4:08am",
      "content": "I'm no historian, but I know that the Insular scripts and uncials predate the carolingian script which evolved into the blackletters.\n\nOne reason I've been told that uncials and Lombardic versals are tossed in with blackletter is that they were seen on the same page— as in the hierarchy of scripts. Personally I think they should be classified separately even if the number of typographic samples is a short list. Although type is a product of scribal manuscripts, its history in the western world began with blackletter. Even so, if someone creates a type design based on Gaelic script or uncial, the history if these forms remains.\n\n"
    },
    {
      "time": "19 Nov 2008 — 8:44am",
      "content": "Uncials per se are a bit of an odd animal. There are Greek uncials.\n\nI doubt that Vox would have classed Gaelic typefaces with Blackletter had he treated them in 1954.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "22 Nov 2008 — 10:49am",
      "content": "Hello Michael,\n\nI missed the Bolger lecture because the first I knew of it was when I saw an item in 'The Irish Times' at around 9:00 p.m. on the same evening. Obviously, I should come here more often ...\n\nOn the subject of type classification, it is self-evident that Irish type cannot be classified as a variety of either Roman or Blackletter type. Neither can it be promoted to the status of a distinct alphabet alongside Greek or Cyrillic. Neither can it be consigned to the 'rubbish bin of history' given that new designs are still being produced and used - albeit more for decorative purposes than for continuous text these days.\n\nIn reality, Irish type represents a third distinct variety of the Latin alphabet alongside Roman and Blackletter, having come into existence as the expression in metal of the insular minuscule hand just as the others were originally the expressions in metal of the humanist and textura hands respectively.\n\nIt is true that some of the more recently designed Irish typefaces show other influences - ranging in period from insular majuscule in your 'Ceanannas' to art deco in my 'Slimchló' - but they still fall within the broad classification of Irish type. This is defined less by stylistic considerations such as weight, contrast or x-height, and more by the basic structure of the letters: 'a', 'd', 'f', 'g', 'i' (always dotless), 'r', 's' (long variant) and 't' are particularly distinctive.\n\nIf Irish type has previously been overlooked by type classifiers, this is hardly surprising: whereas Roman and Blackletter type came to dominate western/southern and northern Europe respectively (with the contest for dominance in England not being decided in favour of the former until around 1700), the use of Irish type was always restricted to an unofficial language spoken on a small island on the western edge of the continent - and even in this role it faced strong competition from Roman type before finally losing the battle in the mid-20th century.\n\nBy the way, given that the type has never been used in Highland Scotland (although the insular minuscule hand remained in use there until around 1700), I feel that it is more accurate to speak of 'Irish type' than of 'Gaelic type'. This also reflects the established usage in Lynam's 'Irish Character in Print' and McGuinne's 'Irish Type Design'.\n\nVM\n\n"
    },
    {
      "time": "29 Nov 2008 — 12:24pm",
      "content": "Sorry you couldn't make it to the lecture, Vincent. I was looking forward to seeing you there.\n\nAs it turns out I seem to have made my case over on the Wikipedia, and Gaelic type is now being treated as a top-level\n\nI have to say, I disagree with 'Irish type' as a translation of _cló Gaelach_. While it is true that in Scottish Gaelic only standard Roman types were used I think \"Irish\" is ambiguous. Antiqua or Blackletter types made in Ireland or by Irish designers could be called \"Irish\".\n\nÓ Dónaill gives **cló gaelach, gotach, iodálach, rómhánach**'gaelic, gothic, italic, roman, type'.\n\nI appreciate your argument, but I think \"Gaelic type\" is the better term, with due respect to Lynam and McGuinne, who as I noted were not trying to classify our types in the context of a top-level distinction with other Latin types. So it seems to me that Blackletter/Roman/Gaelic is a better fit than Blackletter/Roman/Irish.\n\nNothwithstanding \"Irish coffee\" = _caife Gaelach_....\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "3 Dec 2008 — 8:40am",
      "content": "Hello Michael,\n\nThinking about this matter since, it struck me that there is (or was) another expression in metal of the insular minuscule hand - namely the Anglo-Saxon types that were used to print editions of Old English texts. See for example:  \n [http://www.lib.umich.edu/tcp/docs/dox/asax.html](http://web.archive.org/web/20150420085343/http:/www.lib.umich.edu/tcp/docs/dox/asax.html \"http://www.lib.umich.edu/tcp/docs/dox/asax.html\")\n\nI'm no expert in this area, but it appears that no complete font was ever produced in the Anglo-Saxon style. Instead, it seems that Anglo-Saxon and Roman sorts were mixed, giving the resulting texts a rather schizophrenic appearance to the modern eye. Of course, the first Irish font took the same approach.\n\nIn any event, the Anglo-Saxon face is clearly a first cousin of the fonts we have been discussing (whether they are called 'Irish' or 'Gaelic') so there would appear to be a need for an umbrella term that would cover them both. 'Insular' perhaps?\n\nV.\n\n"
    },
    {
      "time": "3 Dec 2008 — 12:28pm",
      "content": "Yes, indeed the Anglo-Saxon faces are interesting. I mention two of them alongside the 1571 Queen Elizabeth type at my [Gaelic Typefaces: History and Classification](http://web.archive.org/web/20150420085343/http:/www.evertype.com/celtscript/fonthist.html) page. The 1567 Anglo-Saxon type seems to have preceded Kearney's type, and in 1667 another Saxon face was made for Old English. I wonder how many there were in all. I have an early copy of Johnson's dictionary which uses it in the Old English etymologies.\n\nIt would take some study to find out whether a complete font was ever made for Old English; that page you pointed to is quite interesting.\n\nRegarding classification, however, I would not go for the term \"Insular Type\" as a substitute for \"Gaelic Type\". The reason is that while both the Kearney's Queen Elizabeth type and Day's Anglo-Saxon type were what I call _Hybrid_ Gaelic Types, the ones for Old English were a dead-end, and did not develop past hybridism into a full class of types as the Gaelic types did. I'd class the Anglo-Saxon types as a minority variety of Gaelic Types, regardless of what language they were used for.\n\nNow _here's_ something I bet you haven't seen. I've got an old 9\" x 12\" map of Ireland, undated but clearly very old. In two places it writes the word **Greenwich** in Gaelic script, but as **Greenƿich** , with a proper insular _wynn_!\n\n[Mid-day in Greenwich](http://web.archive.org/web/20150420085343/http:/www.evertype.com/celtscript/images/learsgail.jpg) from the legend of the map.\n\n[Latitude West of Greenwich](http://web.archive.org/web/20150420085343/http:/www.evertype.com/celtscript/images/greenwich.gif) from the bottom of the map.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "3 Dec 2008 — 12:32pm",
      "content": "One thing that this makes me think of, Vincent, is the recommended character set for Gaelic fonts. I'm including _ƿynn_ in mine these days alongside the _þorn_ and _eð_ I've always supported. (I've been updating my fonts for Unicode lately). I've seen your basic character set. I suspect we ought to discuss requirements (must-haves, nice-to-haves) at some stage.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "3 Dec 2008 — 3:05pm",
      "content": "I've added wynn, yogh, and tironian \"et\" to some recent new types I've developed.  \nThose have Unicode points.  \nI was also rather taken with the shape of \"insular g\", but it doesn't have a separate code point, so I left that out.\n\n_a rather schizophrenic appearance_\n\nI had particular difficulty adapting yogh to the modern style, as all the precedents I found were old-style, and the design of the character seems to have never evolved as type has.\n\nIMO, typefaces are ideas that can be expressed in a variety of scripts, within the related Greek-Latin-Cyrillic continuum (and no doubt beyond), which includes Gaelic. So there is no such thing as a Gaelic typeface, or for that matter a Greek, Latin, or Cyrillic typeface.\n\n"
    },
    {
      "time": "4 Dec 2008 — 1:10am",
      "content": "Insular letters are now in Unicode, because of their use alongside Carolingian letters in some books on Irish phonetics and in Edward Lhuyd's 1707 _Archaeologia Britannica_. See this [list of codepoints](http://web.archive.org/web/20150420085343/http:/en.wikipedia.org/wiki/Gaelic_type#Gaelic_script_in_Unicode).\n\nYogh can be a problem, true.\n\nWhile Cyrillic has long been adapted to Roman letterforms (_graždanskij šrift_) its first typographic expression was Slavonic type, which I would likewise distinguish from Roman and Blackletter and Gaelic. The difficulty in talking about these things is often a question of which level of abstraction one is using the words at. For instance, you say in your last line \"a Greek Latin, or Cyrillic typeface\". But these words are polysemous, and \"Latin\" is out of context here.\n\nLatin, Greek, and Cyrillic are scripts. Roman, Blackletter, Gaelic, and Slavonic are typeface classifications.\n\nLatin script was widely been written in Roman type and Blackletter type throughout Europe, with a minority development of with insular letterforms in Ireland's Gaelic type.\n\nGreek script was first set in script typefaces festooned with ligatures, mimicking the manuscript tradition. Greek lower-case certainly developed on its own, though its upper-case has pretty much always conformed to Roman type (not Latin script!) conventions, and in the last 50 years has certainly seen a lot of development (successful or unsuccessful) in Roman letterforms for its lower-case.\n\nCyrillic script was first set in Slavonic typefaces (from 1574), but Peter I introduced Roman type to Cyrillic letterforms in 1708 and they've been used there ever since.\n\nThere has always been a continuum (not least because Greek typefaces were made in Italy, for instance), but in terms of _classification_ I think that Roman type, Blackletter type, Gaelic type, and Slavonic type are solid distinctions which can be described and applied fairly clearly, modulo hybridism.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "4 Dec 2008 — 6:21pm",
      "content": "You're right Michael - I haven't come across wynn in an Irish text before. Thinking about it, its use is quite logical, although it must have caused a few heads to be scratched when that map appeared (around 1900 would be my guess).\n\nI'm afraid I can't follow your argument that Anglo-Saxon typefaces were 'a minority variety of Gaelic Types'. While the use of 'Gaelic' instead of 'Irish' is merely imprecise, its application to the Anglo-Saxon types is simply wrong: they were cast to print Old English, they lacked characters essential for printing Irish, and they contained characters not used in Irish (with the interesting exception of your map). Also, if you apply the term 'Gaelic' to both the Irish and the Anglo-Saxon typefaces, what will you call the Irish typefaces (given that you've already ruled out 'Irish')?\n\nIt seems to me that Irish and Anglo-Saxon type are two independent expressions of the same script. The fact that the latter was used only for antiquarian purposes proved to be an obstacle to its further development, but in principle it should be given equal status with Irish type in any system of categorisation.\n\nIt's interesting that both Nick and the Wikipedia article (did you write it?) use the term 'insular' when referring to particular letter forms, so I still think that is the obvious umbrella term for all the metal typefaces inspired by the insular scripts.\n\nYes, I agree that it would desirable to give some thought to agreeing a minimum character set for Irish/Gaelic fonts. You'll be familiar with Ciarán Ó Duibhín's arguments against a separate encoding for the tall 's' and 'r'. I always felt that he was right at the level of pure logic but the practical utility of having those letters in the same font as the short forms has weighed more heavily with me. However, the assignment of new code points to those letters, as well as to insular 'd', 'f', 'g' and 't', has greatly increased the scope for confusion. Ideally, one should be able to set an Irish text in Duibhlinn or Seanchló or Gadelica, and then change to Times New Roman, Courier, Helvetica or any Unicode-compliant font. I can't see that happening if these insular code points are used and I'm drifting toward's Ciarán's view that every 's', irrespective of the shape of the glyph, should be coded to 00A2. Open Type features may provide a practical way of including alternative glyphs in the same font in due course. I'll need to think it over some more, but that's the way I'm leaning at present.\n\n"
    },
    {
      "time": "4 Dec 2008 — 9:23pm",
      "content": "_Latin, Greek, and Cyrillic are scripts. Roman, Blackletter, Gaelic, and Slavonic are typeface classifications._\n\nI don't think those are typeface classifications, not any more, not with large OpenType fonts.  \nIt is possible to produce Roman, Blackletter, Gaelic and Slavonic variants of the same typeface, as stylistic sets within the same font.  \nSurely this is the logical outcome of the OpenType/Unicode distinction between character and glyph?\n\nI guess I wasn't up to date with \"insular g\" etc. being Unicoded.\n\nIsn't wyn just an archaic glyph form for w?  \nWhy does \"insular g\" warrant a separate Unicode point when, for instance, both single bowl g and double bowl g share one Unicode point?  \nIt seems to me that a lot of Unicode proliferation is just for the sake of it.\n\n"
    },
    {
      "time": "5 Dec 2008 — 2:58am",
      "content": "<cite>It is possible to produce Roman, Blackletter, Gaelic and Slavonic variants of the same typeface, as stylistic sets within the same font.</cite>.\n\nAny comprehensive system of typeface classification has to be diachronic rather than synchronic: i.e. it should be equally applicable to metal typefaces from the 18th century as it is to the latest Unicode-compliant digital font. It follows that it can't be based on current design practice but rather on the lines of development through the ages. Arguing that Greek should be merged with Roman because their appearances have converged is a bit like saying that dolphins should be reclassified as fish because their legs have turned into fins.\n\n<cite>It seems to me that a lot of Unicode proliferation is just for the sake of it.</cite>\n\nI have to agree that I don't see any merit in assigning code points to insular 'd', 'f', 'g' or 't' - if it is necessary to mix those glyphs with Roman it would be preferable to use a second font. The situation with tall insular 'r' and 's' is somewhat different in that there was a practice, in both manuscript and early printing, to use the smaller forms at the end of words. This practice was also followed in Roman type with 'ſ' and 's' and it is still found in Greek with 'σ' and 'ς'. I think it made good sense to use the code point for 'ſ' in Irish fonts, although the situation with respect to the insular 'r' was less satisfactory and a reasonable case could have been made for giving that character its own code point.\n\n"
    },
    {
      "time": "5 Dec 2008 — 6:45am",
      "content": "Nick,\n\nThere is a difference between a face and a font. We don't classify fonts, but faces. That classification is done by shapes and features. (I'm not trying to lecture! But I think a lot of these words are used differently by many of us.)\n\nWynn is not an archaic form of W. It is a borrowing into the Latin script from the Runic script. Wikipedia has an [article](http://web.archive.org/web/20150420085343/http:/en.wikipedia.org/wiki/Wynn) about it.\n\nInsular g was encoded because of contrastive use in Irish phonetic publications where \"ᵹ\" [ɣ] the voiced velar fricative is contrasted with \"g\" [ɡ] the voiced velar stop. See [my proposal](http://web.archive.org/web/20150420085343/http:/std.dkuug.dk/jtc1/sc2/wg2/docs/n2641.pdf) which got the letter encoded at U+1D79.\n\nNote too that the IPA letter 'ɡ' _script g_ is defined as not ever being a _double-bowl g_; that character has been encoded for a long time (U+0261).\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "5 Dec 2008 — 7:29am",
      "content": "Vincent,\n\nI don't mean to say that the Anglo-Saxon typefaces _were_ a minority variety of Gaelic Types; I mean to say that they _are_ a minority variety of Gaelic Types. We're the ones who do classification. Back in the day, those were basically just Roman types to which they added some insular letters and letterforms. I call these \"hybrids\" since Roman types (properly speaking) really are Carolingian, not insular. The fact that they were devised for the Old English language is irrelevant. It would not be irrelevant had they continued to develop; if a rich variety of Anglo-Saxon faces had developed, it would be quite proper to classify both the ones used for English and the ones used for Irish as \"Insular Types\". They didn't, however, and the Anglo-Saxon types were a design dead-end. Both the Anglo-Saxon faces and the Queen Elizabeth face were incipient Gaelic Types, both hybrids in terms of their relation to the class of types which developed subsequently which have features which we (or I) call Gaelic.\n\nYour comment that \"they lacked characters essential for printing Irish\" is not relevant; we have Blackletter faces that have similar character-set restrictions. Traditional French _bastarda_ Blackletter fonts are unlikely to have characters for Latvian or Icelandic, though Fraktur Blackletter faces used in Latvia and Iceland do. Again the fact that \"they contained characters not used in Irish\" doesn't matter either in terms of classification, because classification has to do with letterform, not character set. [Your own recommended character set](http://web.archive.org/web/20150420085343/http:/www.gaelchlo.org/unicode.html) contains ß and Ðð and Þþ, after all. (Doubtless for modern computing reasons, but even so.)\n\nYou ask \"if you apply the term ’Gaelic’ to both the Irish and the Anglo-Saxon typefaces, what will you call the Irish typefaces (given that you’ve already ruled out ’Irish’)?\" but I don't follow this. It may be a level-of-abstraction problem with vocabulary. Typefaces have names; Day's might be called \"Anglo-Saxon\" but De Walpurgus' is called \"Saxon\" and Peter Baker's is called \"Junius\". You and I have monospaced fonts called \"Aonchló\" and \"Doire\" respectively, which were developed with the Irish language in mind, but that doesn't, for me, mean that either \"Anglo-Saxon\" or \"Irish\" are sub-classifications within the class Gaelic type, because sub-classifications are based on the design shapes, not the intended use. Did I misunderstand you?\n\nI have comments too on the other interesting things you've said, but will get to them bit by bit.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "5 Dec 2008 — 7:42am",
      "content": "Vincent,\n\nI ought to have put this in my previous note... You say:\n\n<cite>\"It seems to me that Irish and Anglo-Saxon type are two independent expressions of the same script.\"</cite>\n\nand I have no quarrel with that.\n\nBut then you say\n\n<cite>\"The fact that the latter was used only for antiquarian purposes proved to be an obstacle to its further development, but in principle it should be given equal status with Irish type in any system of categorisation.\"</cite>\n\nBut categorization isn't based on intended usage, but rather the design of specific shapes. Even individual insular letterforms (litirchruthanna inseacha) themselves can be rendered in Roman or Blackletter or even Slavonic type styles. The bottom part of a double-bowl g is actualy quite insular in effect if not in origin (must check that). But I do think that \"Gaelic Type\" is the best translation for \"Cló Gaelach\", and I can hardly imagine \"Cló Éireannach\" or \"Cló Inseach\" being candidates.\n\nI think that Day's Anglo-Saxon font and Kearney's Queen Elizabeth font are of equal status as Gaelic-Roman hybrids within the class of Gaelic Types.\n\nI find this discussion quite stimulating.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "5 Dec 2008 — 11:52am",
      "content": "Michael,\n\nSorry, but I still think wynn is w.  \nIgnoring sound shift, The \"w\" sound was represented in Anglo Saxon originally by uu.  \nThen for a while scribes borrowed the rune glyph for this character, before returning to uu and thence w.  \nIt has been standard practice during recent centuries to represent \"wynn\" by \"w\" in Anglo-saxon texts that otherwise employ eth and thorn, so isn't it creating unnecessary complication to introduce another code point?\n\nThere is a separate Unicode point for the Runic wynn, so why does \"Latin\" wynn need its own point?  \nIt's just the character \"w\" with a different shape (glyph) and non-English name.\n\nLong s is another alternate glyph that doesn't merit its own code point.  \nConsider older glyph-forms of other letters, that don't have their own code points, such as two-bowl g. (How does IPA have a bearing on this? Note that several new typefaces in OpenType format offer alternate forms of \"g\" with a single code point.)\n\nIn your continuing program of Unicode proliferation, might I suggest you investigate Trissino's \"omega\"?  \nCertainly, one can point to Actual Printed Books in which the borrowed Greek \"long o\" shape indicates a phonetic distinction. :-)\n\n_We don’t classify fonts, but faces._\n\nExactly.  \nIf I produce a font, with a consistent typographic style, which has both the standard Latin glyphs and \"Gaelic\" alternate glyphs, (with the same code points), as a Stylistic Set, why would this not be considered as part of a single typeface? Although, as you imply, another version of the font could be made with \"Gaelic\" glyphs as the default. However, in that case, one would be classifying Gaelicness by font. Ergo, there is no such thing as a Gaelic typeface.\n\nIf I were to produce a Gaelic Stylistic Set, within that set \"insular g\" would not have its own code point.\n\nI guess my point is, that if one wants to encourage more authentic digital reproduction of ancient texts--and facilitate the production of new works in the old/national styles, it would be more useful to do so via stylistic sets of exisiting characters, rather than with special encoding.\n\nThe special character requirements of grammatical works that address pronunciation, shouldn't that meta-world of typography be kept separate from vernacular and literary usage? As science and math characters are?\n\n"
    },
    {
      "time": "5 Dec 2008 — 2:58pm",
      "content": "Well, Neil, I've got to say you're just wrong here.\n\nLetters have histories. The Latin letter \"C\" is the same letter as Greek \"Γ\" _gamma_, both deriving from Phoenician \"\n\n"
    },
    {
      "time": "5 Dec 2008 — 3:11pm",
      "content": "Regarding Trissino's omega I found on the internet this: <cite>'Arrighi added to his italic the new characters proposed by Trissino for the Italian alphabet.\"[i.e. differentiating between the open and closed \"o\" and \"e\" and by using Greek omega and epsilon; the replacement of consonantal \"i\" and \"u\" by \"j\" and \"v,\" and a distinction between hard and soft.\"]'</cite>\n\nNow I haven't seen the text Trissino proposed (scan, anyone?) but Latin letter open e is encoded at ɛ U+025B. We do lack currently a Latin letter omega but you will see one in the draft proposal I mentioned above, for the Initial Teaching Alphabet.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "5 Dec 2008 — 3:53pm",
      "content": "I said \"We don’t classify fonts, but faces.\"\n\nNick said: <cite>\"Exactly. If I produce a font, with a consistent typographic style, which has both the standard Latin glyphs and “Gaelic” alternate glyphs, (with the same code points), as a Stylistic Set, why would this not be considered as part of a single typeface? Although, as you imply, another version of the font could be made with “Gaelic” glyphs as the default. However, in that case, one would be classifying Gaelicness by font. Ergo, there is no such thing as a Gaelic typeface.\"</cite>\n\nProduction of a font isn't typeface classification. You can put whatever you want into a font. And you can mix and match and hybridize fantastically. Typeface classification was devised long before digital type. You can do whatever you want with OpenType trickery. That's a whole different level of abstraction from typeface classification. And doing what you suggest would not obliterate the classification of some types as Gaelic; yours would just be an anomalous exception that proves the rule.\n\nYou say: \"I guess my point is, that if one wants to encourage more authentic digital reproduction of ancient texts—and facilitate the production of new works in the old/national styles, it would be more useful to do so via stylistic sets of exisiting characters, rather than with special encoding.\"\n\nThe people who actually _do_ need to do authentic digital reproduction of ancient texts do not agree with you. They insist—rightly—on plain text character distinction. [A proposal to encode medievalist characters](http://web.archive.org/web/20150420085343/http:/std.dkuug.dk/jtc1/sc2/wg2/docs/n3027.pdf)—which was successful—begins with a short essay on why this is so.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "6 Dec 2008 — 2:04am",
      "content": "Vincent,\n\nYes, I remember Ciarán Ó Duibhín's arguments against a separate encoding for the insular-r and insular-s in a given Irish font. Once again we come to the question of characters and glyphs. From a practical standpoint, back in the early 1990s when there was no OpenType fanciness available, we took the decision to map insular-r to \"ɼ\" U+027C (an IPA character formerly used for Czech \"ř\") and insular-s to \"ſ\" U+017F. In fact, insular s-with-dot was encoded at \"ẛ\" U+1E9B to support our legacy character sets.\n\nCiarán also argued that the Tironian et sign \"⁊\" U+204A should be encoded on the ampersand \"&\" U+0026 but I successfully made the case to the encoding committees, since in origin the former was an ancient Roman symbol and the latter a ligature of e+t. On the Mac OS, the shipping Irish Extended keyboard layout places ⁊ on shift-option-7 (shift-7 is & and option-7 is ¶).\n\nAt the end of the day it really is a matter of the use to which data is put as well as the shapes the user wants. If you want to be able to change a font from Duibhlinn to Times, you _certainly_ want a correspondence between the glyphs set in one and the glyph set in another. These days there are character considerations as well—and it's muddy, and there's no \"right\" answer. The 1964 Dolmen press edition of _An Béal Bocht_ was typeset in a version of Times which used insular-t and insular-f. Actually, nowadays it's possible to represent that text in Times right alongside text with ordinary t and f—because those insular letters were encoded. On page 51 in italics we have _áilneaċꞇ_ (for _áilneacht_) in Irish and afactaiv in \"English\" with insular-t on the first and carolingian-t on the second. (Chances are you may not see the insular-t as it is new to Unicode and there is not likely to be too much support for it yet.)\n\nWhy were the insular letters encoded? Not for the Béal Bocht. And not for Gaelic type either: these were encoded for use in Roman type. Edward Lhuyd's _Archaeologia Britannica_ uses them as phonetic characters in his orthography for Late Cornish. Turned insular g (\"ꝿ\" U+A77F) is used for [ŋ]; insular-t (\"ꞇ\" U+A787) is used for [θ]; insular-d is used for [ð]. The others were also encoded to support lexicographical practice, such as in Johnson's Dictionary where he writes Old English with insular letters. [My proposal](http://web.archive.org/web/20150420085343/http:/std.dkuug.dk/jtc1/sc2/wg2/docs/n3122.pdf) gives the evidence for these. (I waffled about insular-e because I could not really find any contrast.)\n\nYou said: \"I can’t see that happening if these insular code points are used and I’m drifting toward’s Ciarán’s view that every ’s’, irrespective of the shape of the glyph, should be coded to 00A2.\" As I say, it depends on what the intent of your document is. If you're typesetting something for print, it sure is handy to be able to distinguish these letters without having to worry whether or not the application you're using is smart enough to recognize the OpenType tables in your font. Most aren't and will never be. If you're putting something on the web, you need to take searching into account if you want people to find your text. (I don't know how Google treats insular-s. I know that if you search _congreſs_ you get 200 million hits including _congress_; you have to do an advanced search \"congreſs -congress\" to get 200 hits with the long s.\n\nAs you know my own Gaelic faces had not been updated to Unicode for many years. I've been rectifying this recently and in general have been supporting a larger character set, iIncluding the insular letters, simply because you can't trust users not to want to use them.\n\nOne of the really interesting things we need to do is ensure that old Gaelic fonts that support the manuscript abbreviations are encoded appropriately. We ought to do that after settling some things about general character set recommendations though.\n\nMichael Everson  \nevertype.com\n\n"
    },
    {
      "time": "6 Dec 2008 — 10:45am",
      "content": "Michael wrote:\n\n<cite>But categorization isn’t based on intended usage, but rather the design of specific shapes. Even individual insular letterforms (litirchruthanna inseacha) themselves can be rendered in Roman or Blackletter or even Slavonic type styles.</cite>\n\nCategorisation should not be based purely (or even primarily) on superficial appearances - if it were, dolphins would be fish and snakes would be worms. The categorisation of typefaces should be approached in the same way as the categorisation of organisms, or languages, or religions - or of any set of elements that have evolved over time. The categorisation, when complete, should take the form of a family tree showing, for example, how humanist script begat humanist type which begat old style type which begat transitional type which begat modern type - of which (say) Bodoni is an example.\n\nThere may be exceptions in other parts of the world (Cherokee or similar), but in Europe all of our modern type styles can be traced back to a particular script, which in turn had about two thousand years of evolution behind it before it was adapted for use in movable metal type. While the insular minuscule hand arose in Ireland and was introduced to Britain from here, it didn't stop evolving when the English got hold of it. By the tenth century at the latest, Anglo-Saxon minuscule was easily (even I can do it) distinguishable from Irish minuscule - the lower case letters are wider and rounder but the most striking differences are in the capitals which developed forms rarely or never seen in Ireland and which resembled Roman rustic capitals rather than the insular-style capitals that were the norm here. Then look at the capitals in Anglo-Saxon typefaces and the same feature appears - this is a striking divergence from even the earliest Irish typefaces.\n\nSo the reason why there should be two sub-categories for Irish and Anglo-Saxon typefaces isn't because one was used to print Irish and the other to print Old English, it is because they represent two lines of evolution.\n\n<cite>But I do think that “Gaelic Type” is the best translation for “Cló Gaelach”, and I can hardly imagine “Cló Éireannach” or “Cló Inseach” being candidates.<cite></cite></cite>\n\nIrish and English are very different languages and, as with any pair of languages, cognate terms often have different semantic ranges. In English, 'Gaelic' has linguistic and ethnic connotations, but in Irish 'Gaelach' is not often used in either of those senses: for example, 'Gaelic grammar' or the 'the Gaelic nobility' would typically be expressed as 'gramadach na Gaeilge' and 'uaisle na nGael' respectively. Instead, 'Gaelach' is commonly used for a spectrum of over-lapping ideas ranging from 'Irish' through 'native' to 'homely' and on to 'rustic'. It can have either positive ('unaffected') or negative ('unsophisticated') connotations, depending on the context. Thus 'cnó Gaelach' ('Irish nut') means the indigenous hazel nut, whereas the imported walnut is 'cnó Francach' ('French nut').\n\nIn short, 'Gaelic' ≠ 'Gaelach'.\n\nThe nomenclature I would suggest is:  \nInsular type ('cló inseach'), subdivided into Irish type ('cló Gaelach') and Anglo-Saxon type ('cló Angla-Shacsanach').\n\n<cite>If you’re typesetting something for print, it sure is handy to be able to distinguish these letters without having to worry whether or not the application you’re using is smart enough to recognize the OpenType tables in your font. Most aren’t and will never be.</cite>\n\nI agree that OpenType's day has not yet come - but I do believe it will come. When the applications in MS Office and OpenOffice are able to use its 'tricks', and then save the resulting document in PDF format, OpenType will have arrived and this debate will be largely redundant (except perhaps for some legacy issues). But until that great simplification occurs, I'd prefer not to make things more complex than they already are. You've explained why the insular letter forms were included in Unicode, and not being familiar with mediaeval Welsh manuscripts or obsolete phonetic systems, I am happy to accept that there were sufficient reasons for doing so. However, I would not like to encourage anyone to use those specialised characters when processing ordinary text in Irish. Lower case 'r' and 's' are arguable exceptions, but on balance I'm tending towards the view that it might be 'less bad' to stick with the existing encoding until the OpenType cavalry rides to the rescue.\n\nThe Irish scribal contractions are another issue entirely. I had understood it was Unicode policy to ignore abbreviations, but the document you referenced above indicates that a great many have now been recognised - including some of the Tironian notes that were commonly used in both Irish manuscripts and type down to the mid-19th century. If some of these are admitted to Unicode, then why not all? The set of contractions in my Bunchló na Nod is not fully comprehensive, but I think it includes all the common contractions, and I had been thinking of preparing a keyboard layout that would allow them to be keyed more easily - but if there is any likelihood of Unicode taking on this area I would definitely wait for the results of their work and recode the font before producing a keyboard ...\n\n"
    },
    {
      "time": "6 Dec 2008 — 10:40am",
      "content": "Yes, I can see that from the paleographer's perspective it may appear quite convenient to have character alternates separately encoded. It makes it easy to accurately transcribe, transport, and recreate, a manuscript document.  \nBut what of the words?  \nFor instance, consider medieval Latin abbreviations. If they are hard-coded in plain text, then the same writing, rendered by different scribes willy-nilly for purposes of squaring off the line, will suffer a diaspora. But perhaps I am mistaken, and search engines will track down \"similar to\" texts, enabling scholars to assess the significance, if any, of the abbreviations.\n\nNonetheless, it does seem to me that the either/or nature of the character-glyph distinction is too uncompromising a map of subtle terrain, and that some form of triad would be better.\n\nAre the medievalists who support encoding medieval characters fully aware of the potential of OpenType fonts?\n\nWhy not utilise an OpenType feature--Stylistic Sets--to represent Latin abbreviations in the form of \"rich text\" documents? Regarding polyvariance: even though \"q with stroke through descender\" may indicate quam, que, qui, etc., in any given document the underlying character string is specific, and decomposition will return to it. For the rare occasion where there is some doubt as to the underlying string, then perhaps a precomposed abbreviation may be set. However, even when the transcription of the underlying characters is incorrect, if the digital document is rich text, e.g. PDF made with Quark, InDesign or LaTeX, it will still be faithful to the appearance of the original manuscript.\n\nHere are three things which are getting muddled up, because the third is not factored in:\n\n1. Typeface: a style of letter design which may be applied to any character in any script  \n2. Font: a collection of Unicoded and non-Unicoded glyphs, in the same typeface style  \n3. Template: a set of culturally related basic letter forms--individual instances may or may not have distinct Unicode points.\n\nSo, a typeface may be Gaelic, in the sense that the first (or possibly only) fonts produced in its style followed the Gaelic template.  \nBut this doesn't preclude that the typeface may be applied, as Michael says, to other scripts and templates.  \nA font may be Gaelic, in the sense that its default glyphs follow the Gaelic template, even though it may have alternates which follow the main Latin template. But in a multi-template font, the default is unlikely to be Gaelic, and will probably follow the keypad glyphs of the dominant market.  \nA template may be Gaelic, in the sense that it is a set of letter forms associated with Gaelic culture, although its various letter forms and encodings may or may not be shared with other templates.\n\nThe prime example of a template is italic.  \nAnother is the \"Bolgaritsa\" version of the Cyrillic alphabet used in Bulgaria.  \nThe alphabets used by languages are templates.\n\nA comprehensive medievalist font, as pointed to by the proposal of Mr Everson et al, would contain templates for many languages, and superceed single-language-specific fonts. Such a font could not be classified as Gaelic, Nordic, or whatever, and neither could the typeface it represented. This kind of font is not an anomaly, but the shape of system fonts to come, if not already. Not to mention Old Standard.\n\nAs for \"OpenType trickery\", there is nothing to stop type designers from making fonts with stylistic sets (as per my \"Bolgaritsa\" for the Modern Suite) that render alternate templates. What we should do is make two sets of glyphs. So, for Gaelic \"t\", in the Stylistic Set, it should be \"t.gael\", with the basic t encoding uni0074. And quite isolated, another uniXXXX, accessible only though a glyph palette or typing in the code--a more laborious method. Is the essence of the insular t really that it is a quite distinct character from standard t?--surely in most circumstances it is a stylistic alternate, and best accessed through a single keypad and a font/layout modifier. Indeed, in the arguments for the legitimacy of encoding the Gaelic template, the Gaelic forms are said to have been used in stylistic opposition to Carolignian. Art direction, not writing.\n\nDoesn't the encoding of templates restrict the accessibility of texts? The more general reader, for instance, prefers not to read pre-1800 literature with long s's. For Gaelic typesetting of recent writing, it seems reasonable to assume that foundries will cover the template as a stylistic set within a megafont \"Meta\" or \"Garamond\", not with a separate Gaelic-only font, and that non academic users will \"get\" that. I create a few extra glyphs, assign their substitution to a stylistic set, et voilà.\n\nWhen I first created the \"scripty\" variants of the basic alphabet that are included in the Greek Unicode block, for the Modern Suite, I decided to make them accessible via a Stylistic Set; it was then that I realized I would have to duplicate the glyphs (a similar thing is necessary with superior figures) to maintain plain text. Then I ended up categorizing my Greek stylistic sets, as usage practice varies for the characters/glyphs. Interestingly, in InDesign, stylistic sets may be applied additively. There is an example of this on page 42 of the specimen PDF: [http://www.shinntype.com/Figgins\\_Scotch.pdf](http://web.archive.org/web/20150420085343/http:/www.shinntype.com/Figgins_Scotch.pdf \"http://www.shinntype.com/Figgins\\_Scotch.pdf\")\n\n"
    }
  ]
}
