{
  "id": "5186",
  "title": "Thredbo Logo-Identity Design",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is my first design post for this forum.   \n   \n ![Thredbo](http://web.archive.org/web/20131022202014im_/http:/www.typophile.com/forums/messages/29/38110.jpg)   \n   \nThis is for THREDBO, a Ski Resort in Australia. A few years ago they had a tragic accident at Thredbo so I decided to use a friendly - organic feel to the identity, to communicate it as a friendly place, while still providing that FUNKY, SAVVY edge -   \n   \nWhat do we think? I still have a few weeks until I hand it in.   \n   \nTake care\n\n",
  "author": "gareth",
  "time": "11 Jun 2004 — 9:44am",
  "uid": "3514",
  "comments": [
    {
      "time": "11 Jun 2004 — 10:27am",
      "content": "It's very cool and fun, but I think it is more appropriate for a snow sports T-shirt design than a ski resort. It seems a little too trendy for something as permenant as a resort. I could see you working the type alone successfully, then using the other elements (snowflakes, skiers, boardriders) as part of a new identity launch campaign.\n\n"
    },
    {
      "time": "11 Jun 2004 — 1:57pm",
      "content": "It looks like an idenity for a Japanese Cartoon Network. I would do a focus group of Australian skiers to find out how they preceive themselves. Accidents happen in any sport (mine bicycle racing), everyone who participates in the sport knows the dangers. So you can't candy coat the idenity and expect it to be Disneyland. You have alot more work to do, and research.\n\n"
    },
    {
      "time": "11 Jun 2004 — 3:07pm",
      "content": "The Powerpuff Girls hit the slopes!\n\n"
    },
    {
      "time": "11 Jun 2004 — 3:54pm",
      "content": "i think these logos are very cute and definately would look great on a tee shirt but I dont think it works as their identity.   \n   \nI really like the one doing the air. I like simple and cute things like this but I would try to thumbnail some more ideas. I would look at some other resort logos. And try to do more research.   \n   \nOk I said what everyone else said   \n   \nbut they are so damn cute!\n\n"
    },
    {
      "time": "11 Jun 2004 — 8:52pm",
      "content": "Scott - I shall be working the type-logo alone. The characters I added as an extra to launch the identity like you said.   \n   \nDaniel - The accident was due to a building collapsing due to poor structure... where 80 people died, all but one survivor. Since then the resort has been associated with tragedy. Hence why people know what it is just by name alone.   \n   \nI was planning on using the charcters on things such as stickers, merely to helppush the new type-logo. Maybemock up some snowboard designs that the resort hires out to seasonal skiiers and snowboarders. So I did not mean to include them as part of the logo itself. Just to push the identity.   \n   \nThanks for all your feedback. I was going for cute and have asked many people for their feedback - including Australians who snow-surf.   \n   \ntake care   \nk\n\n"
    }
  ]
}
