{
  "id": "51881",
  "title": "Kerning in InDesign",
  "forum": "Build",
  "tags": [

  ],
  "content": "My Quark officially bit the dust yesterday so I am finally jumping ship.\n\nI have been using InDesign (ID) for \\<24h.\n\nFrom my experience in the old days, I understand that when creating a typeface in a piece of software like Fontographer, you could pre-determine kerning pairs.\n\nIn ID, when I look at the kerning options, there are three choices:\n\n1. Optical  \n2. Metrics  \n3. None\n\nI understand that optical takes advantage of an algorythm in ID which attempts to counterbalance the negative space between glyphs based upon the typeface itself. Serif’s and all.\n\nIt is very important that I recreate materials using the type designers original kerning pairs, not ID’s interpretation of what it considers “good” kerning to be, and not all kerning pair set to zero.\n\nRepeat, I need the text to be set using the original type designers kerning pairs.\n\nDo I do this by using “metrics” or “none?”\n\nAdobe technical support was unable to answer this question.\n\nThank you.\n\n [‹ Fontlab Metrics.txt: Can I create classes for individual letters?](http://web.archive.org/web/20081203235603/http:/typophile.com/node/52204 \"Go to previous forum topic\") [Enclosing combining marks ›](http://web.archive.org/web/20081203235603/http:/typophile.com/node/52199 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081203235603/http://typophile.com/user/15065\" title=\"View user profile.\">Christopher Dean</a>",
  "time": "<br>",
  "uid": "15065",
  "comments": [
    {
      "time": " 19.Nov.2008 2.06pm",
      "content": "I’m pretty sure metrics uses the font’s built-in kerning pairs.\n\nDavid\n\n"
    },
    {
      "time": " 19.Nov.2008 2.07pm",
      "content": "<cite>Adobe technical support was unable to answer this question.</cite>\n\nI am stunned. [The online help](http://web.archive.org/web/20081203235603/http:/livedocs.adobe.com/en_US/InDesign/5.0/help.html?content=WSa285fff53dea4f8617383751001ea8cb3f-6e0a.html) explains it quite obviously, and under the help item “Kerning and tracking” as well!\n\nIn short, **Optical** uses ID’s build in system, and — reportedly — works best with large type. It kinda gets slow for running text, but according to people in the know, it adds too much space.\n\n**None** puts no extra space inbetween characters (or takes it out), so, essentially, all that’s left is the space that’s in the letter boxes itself. Kind of what you’re seeing in your browser.\n\n**Metrics** “uses kern pairs, which are included with most fonts” (yeah, that’s what the help sez!), and this is what you obviously want: just what the designer decided, no more no less.\n\nFor Quark there was this plugin (oh yeah, sorry: ’XTension’) that allowed you to create custom kern tables for fonts, but sadly, ID lacks this and nobody who can write plugins cares enough to write one.\n\n"
    },
    {
      "time": " 20.Nov.2008 5.36pm",
      "content": "<cite>For Quark there was this plugin (oh yeah, sorry: ’XTension’) that allowed you to create custom kern tables for fonts, but sadly, ID lacks this and nobody who can write plugins cares enough to write one.</cite>\n\nUrm, “Cool Kerning” from Knowbody Software has been around for years now.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 20.Nov.2008 7.05pm",
      "content": "<cite>Urm, “Cool Kerning” from Knowbody Software has been around for years now.</cite>\n\nCool Kerning runs on that dreadful operating system designers don’t like to use.\n\n"
    },
    {
      "time": " 21.Nov.2008 12.26am",
      "content": "Thank you all very much. It is appropriate to ask the occasional InDesign questions here if i get stuck while this old dog learns a new trick?\n\n"
    },
    {
      "time": " 21.Nov.2008 5.15pm",
      "content": "<cite>Cool Kerning runs on that dreadful operating system designers don’t like to use.</cite>\n\nOh, good idea, start platform wars.\n\nIn any case, it’s available for _both_ Mac and Windows. If you’re going to hold that against it, you shouldn’t use QuarkXPress or Adobe InDesign, either.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 30.Nov.2008 8.10pm",
      "content": "heehee, nice thomas!\n\n:-)\n\n"
    },
    {
      "time": " 30.Nov.2008 10.08pm",
      "content": "<cite>In any case, it’s available for both Mac and Windows.</cite>\n\nI stand corrected. I didn’t realize that it’s now cross platform.\n\n"
    }
  ]
}
