{
  "id": "519",
  "title": "Carol Twombly Adobe Caslon",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Carol Twombly Adobe Caslon   \n   \ni'm trying to find out what sources she used to design Adobe Caslon? ( i know that one of them published by Caslon in 1734)   \n   \nis there an interview with her? (about the design)   \n   \nthank you   \n   \nDavid\n\n",
  "author": "hawk",
  "time": "3 Jul 2003 — 1:35pm",
  "uid": "1895",
  "comments": [
    {
      "time": "3 Jul 2003 — 2:04pm",
      "content": "In Serif magazine there was:   \n1) An interview with Twombly.   \n2) An article about Caslons.   \n   \nBut good luck tracking down Don Hosek for back issues... He split with my subscription money, with no issue #7 in sight. And to think he's a founding board member of TypeRight, an _ethics_ organization.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Jul 2003 — 2:37pm",
      "content": "thank you\n\n"
    },
    {
      "time": "3 Jul 2003 — 3:23pm",
      "content": "There is also the small Adobe specimen dating back the launch of the face with some comments and showings of drawings methods.\n\n"
    },
    {
      "time": "5 Jul 2003 — 3:20am",
      "content": "The Serif article (Number 3, Fall 1995) says that \"Twombly worked primarily from a 1924 specimen from the Caslon foundry, although she refered also to specimens from 1738 and 1768...\"\n\n"
    },
    {
      "time": "5 Jul 2003 — 6:32am",
      "content": "John,   \n   \nThat agrees with my recollections of conversations with Sumner Stone previous to Adobe's release.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "5 Jul 2003 — 1:08pm",
      "content": "In this thread: [http://www.typophile.com/forums/messages/30/12111.html?1056150118](http://web.archive.org/web/20141118003448/http:/www.typophile.com/forums/messages/30/12111.html?1056150118) John Hudson posted a sample of the 1924 example. And as I said in that thread, when I typed Adobe Caslon at the same size over it, it matched very closely, except for the ink spread.\n\n"
    },
    {
      "time": "5 Jul 2003 — 1:16pm",
      "content": "William,   \n   \nCan you tell me what you recall about that. Was there more weight in the Adobe version, or in Hudson's posting?   \n   \nWe are digitizing display Caslon No. 437 to work with our Lanston Caslon 337.\n\n"
    },
    {
      "time": "5 Jul 2003 — 1:33pm",
      "content": "I think there is more weight in Hudson's posting, but I can't be sure. Hudson's sample is scanned, and is what I believe what they call aliased - it has half-tone pixels around it. I think he said it was 14 point, but to match it on screen I had to type 60 point Adobe Caslon. So with all this scaling, I don't have the technical know-how to say how the originals would compare. But in my test, yes, John Hudson's sample of the 1924 Caslon in general seemed to have more weight, but it wasn't consistent.   \n   \nJohn Hudson's 1924 sample is significantly different from my sample of Linotype Caslon Old Face, and from the printed sample I have of metal Caslon 337, which I am assuming your digital version matches. I am pretty sure it is more regularized than the Linotype or your version - or, I suspect, the work of old William himself.\n\n"
    },
    {
      "time": "5 Jul 2003 — 2:18pm",
      "content": "Unfortunately, I don't have any close-up photographs of the 1924 Caslon 12pt, which would probably be the best to compare to Carol's Adobe Caslon. If I'm able to take some in the near future, I'll make a graphic comparing the two. I have the camera equipment and the book here, but no decent lighting equipment.\n\n"
    },
    {
      "time": "6 Jul 2003 — 5:34am",
      "content": "John,   \n   \nWhat kind of camera equipment are you using? I am using a 4 x 5 sheet film camera. You may remember Lanston used to have a copy camera and darkroom in the loft. But this 4 x 5 camera seems to do the trick. I am just wondering if you have ever used one with high contrast film?   \n   \nOur Caslon 437 was based on a Caslon model previous to the Caslon Foundry refit in 1924.   \n   \nAbout Adobe's Caslon however I have new recollections. I recall Sumner Stone mentioning Adobe looked at all pt sizes choosing not to base theirs on any specific size. I may remember wrong.   \n   \nDo you know anything about that?   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "6 Jul 2003 — 10:38am",
      "content": "I'm using a digital camera, a Nikon 930 with a built in macro lense. Using the macro lense, I can pretty much fill the frame with a couple of 14pt punches, which is pretty good for a relatively inexpensive and portable camera.   \n   \nRegarding Adobe Caslon, I believe you are correct in characterising it as a kind of amalgamation of details from many different sizes of the metal type. The was Adobe's approach at that time and is also seen in their Garamond. Later they got into optical sizing, but using interpolation, which is very different from approaching each size as an individual design.\n\n"
    },
    {
      "time": "6 Jul 2003 — 10:44am",
      "content": "Looking again at the relatively heavy impression in the 1924 specimen, I'm reminded that the revival of interest and usage of Caslon Old Face in Britain was initiated, in the late 19th century, by the Chiswick Press. I used to have a copy of a Chiswick Press edition of _The Golden _, and the printing was very heavy. They used a large size of Caslon, possibly 18pt but certainly no smaller than 14pt, and a _very_ black ink. This may have contributed to a fashion for over-inking Caslon in Britain to make it look heavier.\n\n"
    },
    {
      "time": "6 Jul 2003 — 10:48am",
      "content": "Ahem! It seems Typophile objects to ancient Roman donkeys.\n\n"
    },
    {
      "time": "6 Jul 2003 — 11:41am",
      "content": "I wonder if it was just in fashion to over-ink \"all types\" in England and not just Caslon.   \n   \nI hired an Englishman, generally a good pressman but I was never happy at the quantity of ink. It's not that I am cheap, black does not cost much and it goes far. But many pressman overink. Scott Fruetel formerly of Spring Valley Press was a superb Monotype Keyboard operator and pressman. Friend of Clifford Burke, had another characteristic which was \"almost\" as bad.   \n   \nHe would \"underink\". His type was sharp but the printing looked like it was through a washer. So there are many opinions.   \n   \nMy personal taste is well known. I leaned towards the qualities of Font le Roy. He was John Henry Nash's pressman.   \n   \nBut that point I am tired of labouring. One nice thing about the typophiles is their liking for diversity of opinions and the appreciation for humour. Not to mention the ongoing quest for knowledge.   \n   \nIn any event, I have earned my opinions.   \n   \nDon't you think.   \n   \nBy the way I tried to see you many times when I was in Vancouver in the fall, I was disappointed not to find you. I would like to attend ATPi this year in Vancouver but I am doing a speaking tour in Europe on the \"National Hand of Finland\" and some on printers fleurons. I would like to run this National Hand of Finland by you but this is not the topics heading so maybe I should just summarize it and e-mail it to you. This is a transitional face I have followed in early stone cuttings.   \n   \nBut I do look forward to anything you have on Caslon as reading and resource material in Finland is scarce, especially in English.   \n   \n  \n   \nGerald Giampa\n\n"
    },
    {
      "time": "6 Jul 2003 — 2:51pm",
      "content": "_Ahem! It seems Typophile objects to ancient Roman donkeys._   \n   \nIsn't this silly?   \n   \nBut the censor is monoglot: Culo! Schei\n\n"
    },
    {
      "time": "6 Jul 2003 — 4:02pm",
      "content": "\\> many pressman overink   \n   \nBingo.   \n   \nAlso:   \n1) Not just many, but most.   \n2) Not just over-ink, but also over-impress.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Jul 2003 — 4:38pm",
      "content": "The fashion in 'fine' printing in Britain in the late 19th and early 20th centuries was heavily influenced by Morris and St John Hornby, of course, who both favoured blackletter and what might be called the Italian black roman, derived from the Schweynheym & Pannartz types. Heavy black type driven deeply into heavy rag paper was the style of the day, and probably made a lasting impression (sorry for the pun) on generations of British printers, even when they were using types not intended for this kind of treatment.   \n   \nSorry I missed you in Vancouver, Gerald. I was in Rome and Britain in the autumn. The National Hand of Finland sounds very interesting.\n\n"
    },
    {
      "time": "6 Jul 2003 — 11:47pm",
      "content": "John,   \n   \nThankfully that disgusting habit came to pass by \"wiser\" printers in North America. Some techies foolishly find it desirable and want to enshrine overinking. Reminds me of \"fake graining in wood\". Fake inking, \"let me shake my head\". I can\n\n"
    },
    {
      "time": "7 Jul 2003 — 8:33am",
      "content": "\\> But each to their own   \n   \n\\> I just like to be able to see the letterforms   \n   \nAnd I like Lapsang Souchong. But I don't know anybody else who does.   \n   \nThinking that personal preference should be the main guide is anathema to _craft_.   \n   \n\\> I am not a type designer   \n   \nYes, I think you're too much of an artist to be one.   \n   \n--   \n   \nBTW, don't understimate the very human relevance of freedom _from_ choice.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Jul 2003 — 9:30am",
      "content": "Hrant,   \n   \nHow nice of you to say.\n\n"
    },
    {
      "time": "7 Jul 2003 — 11:07am",
      "content": "Gerald   \n   \nI went to your site to look at the award for Bodoni 26. I think you may have misdirected the URL. All I could find was the Paul Shaw listing. Is this the same? It's not listed in the Awards section(?).\n\n"
    },
    {
      "time": "19 Jul 2012 — 6:32pm",
      "content": "...\n\n"
    },
    {
      "time": "7 Jul 2003 — 12:06pm",
      "content": "You don't like poetry, do you, James.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Jul 2003 — 12:25pm",
      "content": "James,   \n   \nI am glad you pointed that out, it is most embarrasing. Frankly I don't think much of it. Paul Shaw has a nice list though don't you think.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "7 Jul 2003 — 1:24pm",
      "content": "James,   \n   \n [http://www.lanstontype.com/GiampaWonders.html](http://web.archive.org/web/20141118003448/http:/www.lanstontype.com/GiampaWonders.html)   \n   \nHrant, everyone like poetry, artists too.   \n   \n [http://www.lanstontype.com/GiampaPipePress.html](http://web.archive.org/web/20141118003448/http:/www.lanstontype.com/GiampaPipePress.html)   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "7 Jul 2003 — 1:31pm",
      "content": "Hrant,   \n   \nPalatino, sorry that's not \"Ink Trapping\". Its \"Optical Scaling\".   \n   \nGerald Lange agrees with me. Read the comment from the unknown one?   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "7 Jul 2003 — 1:35pm",
      "content": "Wrong thread.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Jul 2003 — 1:49pm",
      "content": "Gerald   \n   \nThis was me only comment on the Palatino:   \n   \n\"Amazing the difference between the metal version of Palatino compared to the digital. The explanation of this at   \n [http://briem.ismennt.is/2/2.3.1a/2.3.1.02.contents.htm](http://web.archive.org/web/20141118003448/http:/briem.ismennt.is/2/2.3.1a/2.3.1.02.contents.htm)   \nis completely unfantomable to me.\"   \n   \nThis had nothing to do with optical scaling or ink trapping but with the makeover of the letterforms themselves. Please don't take poetic license with my words for your own purposes, whatever the hell those may be.\n\n"
    },
    {
      "time": "7 Jul 2003 — 2:00pm",
      "content": "Gerald,   \n   \nWrong thread.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "7 Jul 2003 — 2:10pm",
      "content": "Gerald   \n   \nBut you do agree with me don't you. It is a great job of \"optical scaling\"?   \n   \nBut maybe you two should move back over to the other wrong thread and prepare for your really big show. You might have it right this time? Garamond, can't wait. You just might get it right.   \n   \nI hope so.   \n   \nGerald Giampa   \nP.S. I hope so. You know, we all hope so.\n\n"
    },
    {
      "time": "7 Jul 2003 — 2:26pm",
      "content": "This would be maddening, if it simply weren't so much more pathetic.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Jul 2003 — 3:13pm",
      "content": "Actually, Gerald, I find it hard to agree or disagree with anything you say, as everything you say is completely self-referential.\n\n"
    },
    {
      "time": "7 Jul 2003 — 5:59pm",
      "content": "John,William   \n   \ni'm trying to find out if Carol used Caslon old face - Stephenson, Blake & Co., ; ATF Caslon 471 is much close to Stephenson - then 540.   \n   \nwith Linotype, Monotype, and ATF - you're going to find inconsistencies.   \n   \ni'm going to have some original - by Stephenson ( to compare to Adobe)   \n   \n   \nDavid hamuel\n\n"
    },
    {
      "time": "7 Jul 2003 — 6:40pm",
      "content": "Just a note here:   \n   \nCouldn't hurt to ask someone who really knows Caslon.   \n   \nJustin Howes has done some rather extensive scholarly study on the Caslon punches and matrices, including an inventory, which was published in \\_Matrix 20\\_.   \n   \nIt might be worth asking him. He is, as you all know, the producer of Founder's Caslon, but he is also currently the Curator of The Type Museum, the depository for the Caslon materials of Stephenson Blake and the earlier Caslon foundry.   \n   \n [http://www.typemuseum.org/](http://web.archive.org/web/20141118003448/http:/www.typemuseum.org/)   \n   \nGerald Lange\n\n"
    },
    {
      "time": "7 Jul 2003 — 7:03pm",
      "content": "david   \n   \nI had completely forgotten about this, and did not at first understand that yours was the initiating post here. Last year I had published an article on \"digital type with an affinity for letterpress\" for \\_Parenthesis\\_ that included a review of Founder's Caslon and dfTYPE's Rialto. In that I state that the Adobe Caslon was based on Caslon foundry specimens sheets from 1738 and 1786. This information would have come from an earlier review I did on the initial Adobe Originals releases. Carter's Big Caslon was based on titling sizes that appeared in the famous broadsheet specimen of 1734. The metal typeface, Lanston Monotype Caslon Oldstyle 337 is considered the \"closed rendition\" to the [American] Laurence J Johnson Caslon (1859), which was derived from \"borrowed Caslon foundry punches,\" and which marked the beginning of the American Caslon revival. This was inspired by the British revival of Caslon in 1844 through its use in Chiswick Press books. Caslon had fallen out of popularity by the nineteenth century. The Caslon specimen book of 1805 does not show the Old Style typeface.   \n   \nGerald Lange\n\n"
    },
    {
      "time": "7 Jul 2003 — 10:46pm",
      "content": "Gerald   \n   \nI have reviewed my poets license. It is good until my sixtieth birthday unless I return to Canada. There I have an honorary lifetime licence.   \n   \nSo I take that as a yes. You do agree.   \n   \nThe following I do not require any license for and this is not a loaded question. For now lets bookend the other little matters.   \n   \nI am interested in reading anything you wrote on Caslon. Have ever printed anything with Kennerly Oldstyle? I seem to have remembered something. Also, do you happen to know when the Caslon Foundry introduced the st tied ligature? Or should I ask Justin? By the way, you guys nicely inked the type for Hrants scan. Are you using a reproduction proof press?   \n   \nI am still very interested in your Gutenberg material. I may know somethings that would interest you. You could write me at [sales@lanstontype.com](mailto:sales@lanstontype.com).   \n   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "7 Jul 2003 — 11:12pm",
      "content": "Okay Gerald   \n   \nNo more games.   \n   \nLast thing I wrote on Caslon was in \\_Parenthesis\\_, The Journal of the Fine Press Book Association, Number 7, November, 2002.   \n   \nI'd have to check previous writings. There was one on Lanston. Affirmative by the way. I'm sure a copy was sent to you.   \n   \nAs a beginner, yeah, I was enamored with Goudy. I've printed with Kennerly, Goudy Old Style, Garamont, Forum, Goudy Text, Goudy Thirty, California (thought you were going to bring that out?), Village, etc. Been through the Goudy thing.   \n   \nI do not know when Caslon introduced the tied ligature. Justin is the best information source.   \n   \nI did not ink the Hrant piece. He did that himself. And we did not hold hands, jackass.   \n   \nYes, a reproduction press.   \n   \nGutenberg. He's not my man. What have you got on Schoeffer?   \n   \nGerald\n\n"
    },
    {
      "time": "8 Jul 2003 — 12:07am",
      "content": "Gerald   \n   \n\"And we did not hold hands, jackass.\"   \n   \nJust teasing, sorry. Hrant did a good job. Not teasing. \"Might be sorry later, hope not.\"   \n   \nYes, I have digitized California except for several characters, xy and z of the small capitals. The original patterns Goudy made in his studio at Deepdene are in Squamish BC. I have to figure out how to get them here. These are not made of brass but of lead so the freight will be substantial. Also I don't have a proof press. Hrant seems to be good at inking. Hmmm!   \n   \nThe personage that has the patterns would not know how to separate the characters I need. Those three missing characters would hardly cost anything to ship. Maybe I should consider that. Just thinking out loud. Perhaps I could bribe him.   \n   \nYou would not know anyone that would want to buy the patterns do you? Almost all of them are lead made by Goudy, the others are brass made by Lanston when they cut it for the University.   \n   \nI do not have anything you wrote on the Caslon unless it was contained in that beautiful broadside your printed.   \n   \nThat went the way of the tidal wave. My books on the top most shelves survived. The others readable but valueless otherwise.   \n   \n\"What have you got on Schoeffer?\"   \n   \nNothing, but have you looked \"very\" closely at all the supposed Gutenberg material. Think \"hand set\", you may find it an interesting study.   \n   \nThe st tied ligature, I will ask Justin.   \n   \nThank you.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "8 Jul 2003 — 8:03am",
      "content": "As I wrote (in the _correct_ thread), the inking you saw in that Pascal \"bd\" was intended to extract the outlines, traps and all. This resulted in too-light bodies, which to me makes the inking inadequate in terms of typography, which is the craft of communicating, not showing letterform outlines.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jul 2003 — 9:35am",
      "content": "Hrant,   \n   \nBut I thought   \n   \n\"Thinking that personal preference should be the main guide is anathema to craft.\"   \n   \nYou said that. But now this.   \n   \n\"which to me makes the inking inadequate in terms of typography, which is the craft of communicating, not showing letterform outlines.\"   \n   \nA Marshall McCluan fan I knew it.   \n   \nBut no matter. I think we need not chew cud.   \n   \nCan you do me a favour and repeat the URL for me. I am worried we are going around the \"ink spread enhances type routine\". I thought we established you had \"preferences\" for bolder types. That's OK with me. I have no problem with that. Also we have already agreed about the ink spread matter. Remember. So lets leave it at that.   \n   \nBeside I think that type is very bold compared to Caslon. Maybe to you it is not yet bold enough.   \n   \nBut your inking is good. And I trust we will eventually start talking about optical scaling which I happen to know you are interested in. So am I. So maybe we should think about that? There is no point in disagreeing with something we both agree about.   \n   \nSo please tell me about your flowers? This is not a loaded question.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "8 Jul 2003 — 9:43am",
      "content": "Gerald   \n   \nDon't have much time for the back and forth today but your comment...   \n   \nNothing, but have you looked \"very\" closely at all the supposed Gutenberg material. Think \"hand set\", you may find it an interesting study.   \n   \n   \n...is of interest. I try to keep up on current findings regarding early printing. I have recently been entertaining the notion that B-42 was not done in what we now consider the traditional way. There are far too many anomalies that don't fit the accepted pattern. And I find it hard to believe that our great benefactor had limited his interests to this one technique.   \n   \nFor what faces do you have \"patterns.\" There may be an instituion that would be interested.   \n   \nGerald\n\n"
    },
    {
      "time": "8 Jul 2003 — 10:41am",
      "content": "\\>\\> Thinking that personal preference should be the main guide is anathema to craft.   \n   \nYes, and I myself prefer letterform fidelity over solid bodies (even if it means lower readability). This is because I design type myself, and appreciate the letterforms for their own sake in a way that the layman doesn't (and shouldn't have to). I also prefer darkish letterforms, but on the type design side, not the printing side: the latter is counter to my fidelity preference.   \n   \nBut the point is that what I prefer is moot. When I create/print a piece, it is targeted at a certain demographic (and that's never me). Otherwise it's selfish art.   \n   \nThat's not to say one can exclude personal preferences from anything one does - that's not possible. The key thing in _craft_ is to let such preferences manifest naturally, in the context of the communicative requirements of the piece. When you frame and celebrate your preferences, it is less craft.   \n   \n\\> ink spread enhances   \n   \nI was avoiding explicitly refuting this (and your other distortions), because I didn't (and still don't) think it will stop you from twisting people's words (and \"awards\") in order to feed your psychological coping mechanism with respect to your dying past. But since people reading this don't necessarily have the benefit of reading the source thread (which for some reason you keep avoiding, hijacking this one instead):   \n1) I don't think ink spread enhances type, in the same way that I don't think a fender-bender enhances driving. But their _existence_ means that traps and seatbelts are useful.   \n2) I think optical scaling is an extremely valuable technique, that was undermined by the pantograph, and that most foundries (including Lanston) do not properly address. But I don't think you have the analytical mettle to be useful to me.   \n   \n\\> Also we have already agreed about the ink spread matter. Remember.   \n   \nI don't remember any such thing, but I'm glad to hear that you've now changed your mind 180 degrees.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jul 2003 — 10:41am",
      "content": "Gerald   \n   \nI am not sure what patterns we have, mainly those I planned to digitize, also Centaur I believe. The Californian went to BC. I was in the middle of working on that face. The others sit on the east coast of Canada. I will try to get an inventory of them. I would need access for proofing but that usually comes with the territory for a limited time.   \n   \nOtherwise I could proof them first.   \n   \nWhen I get a chance I will try to look through some of the Gutenberg material and then I can send you to the correct lines. Certainly, at least one book was not \"printed\" from hand set type.   \n   \nAt least from what I can make of it. I am always suspicious about using words like never, impossible, so lets replace certainly with unlikely. Maybe certainly unlikely.   \n   \nSo perhaps we could work together a little and make it impossible. That has a better ring to it. We can probably make it impossible. Certainly I believe that is possible.   \n   \nGerald Giampa   \nP.S. Don't bother reading those last few lines. I will look for the material and see what you think. How about that?\n\n"
    },
    {
      "time": "8 Jul 2003 — 11:02am",
      "content": "Hrant,   \n   \nI knew a fireman / arsonist once, he reminded me of you. You seem to want to put the ink on just so you can take the ink off?   \n   \nWhat's your point?   \n   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "8 Jul 2003 — 11:21am",
      "content": "Hrant,   \n   \nAs far as high-jacking this thread goes I think you should read through these posts. Your interest in Caslon is well established.   \n   \nSo if the other thread is where you think it belongs, Caslon also??? Go write some material and see who's interested. Optical scaling, yes I am interested. Chewing cud, I am not.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "10 Jul 2003 — 12:24pm",
      "content": "I've never understood why, economic considerations apart, the digital font makers have generally chosen to revive earlier adaptations rather than going back to source. Lanston's so-called authentic Caslon, for instance, is an authentic rendering \\*not\\* of the types cut by William Caslon I and his son, but of Lanston Monotype's twentieth-century rendering -- of types probably supplied not by Caslon & Co, but by an American foundry which had, in the mid-nineteenth century, acquired strikes of variable authenticity to the original designs. What's authentic about that? My recollection of the Caslon Challenge, incidentally, is that it involved comparison between (1) Lanston's digital cutting, and (2) Lanston's original cutting. It wasn't a comparison of Lanston's digital, and Caslon's original - perhaps Gerald Giampa could clarify?   \n   \nWhy revive a twentieth-century interpretation, influenced by the aesthetic of the 1920s, rather than go back to the original and start over? Going back to the original you can either create an interpretation for our own time (as Twombly has done, using ) or else attempt a facsimile (as in my own Founder's Caslon. I don't, for instance, see that it's really legitimate to use a digital version of Centaur, when there's an opportunity to go back to Bruce Rogers' source material, and improve on his rendering. If we need type revivals (I'm not saying that we do) let's revive types that were true to their own time.   \n   \nAdobe brought out a small publication in 1990, titled \\_Adobe Caslon\\_ (California, Adobe Systems Incorporated, 1990), in which it's clear that Adobe Caslon, designed by Carol Twombly for use in sizes ranging from 6 to 14pt, was based on photographic enlargements of the 9, 10, 11, 12 and 14 pt designs shown in Jones 1924. Twombly `found that the proportions of x-height to capital height and ascender and descender length varied only slightly from size to size within this text range. She made careful sketches of every letter at each size, and after this thorough examination of the types, made rough drawings for one master design that incorporated common elements from the five original text sizes. The letterforms were drawn at a weight between the extremes of the sharp metal impressions observed under the microscope, and the overweight, amorphous shapes of the enlarged letters.' The Caslon Ornaments were adapted for Adobe by Wesley Tanner.   \n   \nThe st ligature, which someone's asked about, was never offered by the Caslon foundry. In the eighteenth century, until at least the 1780s, use of the long s was all but mandatory in most English printing (there are a few interesting exceptions), which meant that the ligature offered by Caslon was longs-t. I'm not sure who first added one to a version of Caslon, however: I've a vague memory of seeing something in a book printed by Field and Tuer in the 1880s, but a more likely culprit would be ATF, who added some luxuriantly nasty swash characters to their fonts of Caslon - some of which were taken over by Lanston, Adobe, et al. I'm rather ashamed of the fact that I included short st in my Founder's Caslon, though it does come with a health warning in the documentation.   \n   \nI'm writing, I should say, without access to most of the books I'd usually refer to, and realise that I may have confused details of the American Caslons.   \n   \nJustin Howes\n\n"
    },
    {
      "time": "11 Jul 2003 — 3:51am",
      "content": "Oh, for heaven's sake!   \nJustin's fonts are extremely good.   \n   \n...and I'll even put my name on this.\n\n"
    },
    {
      "time": "12 Jul 2003 — 7:10am",
      "content": "Thanks John!\n\n"
    },
    {
      "time": "12 Jul 2003 — 8:24am",
      "content": "I second that John,   \n   \nI am happy the person likes our Caslon 337. However I suggest the writer take another look at Justin's work. He seems to have missed the importance of it.   \n   \nWhat Justin has done is most remarkable. A tribute to Caslon. I, for one, know how much work that project would have been.   \n   \nAnd two rights don't make a wrong.   \n   \nUnfortunately I do not have time to add anything more. My situation at present does not allow that.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "13 Jul 2003 — 1:31am",
      "content": "What I should have said in my first posting is that each of these versions of Caslon - my own, Gerald's, Adobe's - can have a place in the designer's toolkit. I've frequently suggested people take a look at 337, or at Big Caslon, all depending on what they want to do. Founder's Caslon's fine for those who have a need for a real eighteenth-century type, but wouldn't be the right choice for office documents.\n\n"
    }
  ]
}
