{
  "id": "51905",
  "title": "Logo for a typography exhibition",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all,\n\nI'm creating a logo for an imaginary gallery/exhibition dealing with all aspects of typography, that I have named Display/Type.\n\nI can't seem to get the logo quite right - there are some issues with letterspacing, particularly TYP and LA. Any solutions to the letterspacing, or comments on the logo in general are much appreciated.\n\nThe logo is set in Akzidenz Grotesk, but I'm sure most of you would identify it easily enough =)\n\nCheers,\n\nGary\n\n| Attachment | Size |\n| --- | --- |\n| [picture3.png](http://web.archive.org/web/20100204141506/http:/typophile.com/files/picture3.png) | 20.9 KB |\n| [Picture 8.png](http://web.archive.org/web/20100204141506/http:/typophile.com/files/Picture%208_10.png) | 10.55 KB |\n\n",
  "author": "<a href=\"/web/20100204141506/http://typophile.com/user/39816\" title=\"View user profile.\">Mr Austin</a>",
  "time": "<br>",
  "uid": "39816",
  "comments": [
    {
      "time": "",
      "content": "Also tried it in Akkurat (added it to the original post)...\n\nI think 'PLAY' looks more balanced now, although I'm not sure if I have made the L too narrow or not.\n\nStill having issues with TYP - I don't want them touching at the top as it doesn't look right.\n\n"
    },
    {
      "time": "",
      "content": "the L seems too narrow, and also a bit too far away from the P and too close to the A\n\nthe AY seems a bit too far apart as well. maybe make the stem of the T longer to combat the Y ? i think the only way you're gonna make it work is to connect them somehow, or the Y is always going to come to prominence\n\n"
    },
    {
      "time": "",
      "content": "Unfortunately \"LAY\" and \"TY\" are tough letter combinations to get right. I think your best option may be to letterspace them out a bit, especially if you don't want the letters to touch. Or, you could try using a more condensed typeface, Trade Gothic Bold Condensed, or Univers Condensed.\n\n"
    },
    {
      "time": "",
      "content": "Try making the angled lines the same angles an in the specific typeface, as it is, more or less on the second logo (picture8). I think a bolder typeface works better for this. Try aligning letters more, you can modify the letters to fit what you want. I agree with both gerald and chris, space out the letters a little.\n\nJonE.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the tips folks. After a bit of tinkering, I think I'm getting there...\n\n ![](http://web.archive.org/web/20100204141506im_/http:/typophile.com/files/pic2_5056.png)\n\nI much prefer it reversed out, looks more interesting.\n\nGerald - L has been extended - you confirmed my concerns about it. Was trying to reduce the negative space between L and A, but I think it's alright now. I've also extended the stem of the T a little.\n\nChris - I've spaced them out a bit more, do you think it looks more balanced now? I had tried some condensed faces, but didn't like the results. I'm a huge fan of condensed faces, but on this occasion they didn't suit the sloping lines, and it looked rather squashed.\n\nJeo - You're right about the bolder typeface working better. I didn't have a bold enough version of Akkurat, so I've fattened it up a bit. The angled lines are taken from the angle of the Y.\n\n"
    },
    {
      "time": "",
      "content": "Way better. The kerning with 'TYPE' is as good as it can get by itself. The only thing now would be to align the edges of the letters to each other...for instance, aligning the bottom left edge of the L with the right, inside part of the Y, this will 'lock' everything in place.  \nAlso the line to the most right is kind of far away from the 'Y' creating a more visible part of the word. Since there are two lines in the beginning, that 'cuts' up the word more in the front then in the back. Don't be afraid to take away more of the E. I like the spacing of the last line as it is in picture 3.\n\nJonE.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100204141506im_/http:/typophile.com/files/pic3_6011.png)\n\nThanks very much for that suggestion - I've shifted TYPE so the Y and L lined up, and almost magically T lined up with P, and Y with E! Looks a lot better now, cheers.\n\nI see your point regarding the cropping, although I feel 'E' looks strange when cropped too much, and when the diagonal line is too close to the Y, it creates an awkward trapped space between them. Plus, with there being so much empty space at the bottom left, a little space between Y and the line provides a bit of balance (I think!).\n\n"
    },
    {
      "time": "",
      "content": "Also looking into how it could be used for different events...\n\n ![](http://web.archive.org/web/20100204141506im_/http:/typophile.com/files/pic9_5810.png)\n\n"
    },
    {
      "time": "",
      "content": "Sorry, double post!\n\n"
    },
    {
      "time": "",
      "content": "whatever you do, make sure you don't end up doing this [http://www.designmiami.com/](http://web.archive.org/web/20100204141506/http:/www.designmiami.com/ \"http://www.designmiami.com/\")\n\n"
    },
    {
      "time": "",
      "content": "I love this. Really.  \nOnly detail I find irritating are those \"bumps\" that look like tiny overshoots of the diagonal lines over the cap height – should those really be there?\n\n ![](http://web.archive.org/web/20100204141506im_/http:/typophile.com/files/overshoot_3434.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Illustrator does some funny things when zoomed out - those bumps don't really exist, and certainly wouldn't be seen in print.\n\n"
    },
    {
      "time": "",
      "content": "Ah, OK. In your posted image there was some weirdness going on in the antialiased edge up there.\n\n"
    }
  ]
}
