{
  "id": "51904",
  "title": "New magazine - body copy ideas",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all,\n\nFirst post here, so be kind!\n\nI work at a contract publishers in London and we’re taking on new magazines by the bucketload at the moment. We’re about to start initial designs for an A5 travel publication, and I’m looking at headlines and complimenting body copy. I’m thinking sans serifs for both, although I’m not averse to having a secondary headline font which we can mix and match.\n\nThe client has specified they like clean, smooth, smart, modern fonts, they have been impressed with some other publications of ours that use Bliss and Franklin Gothic. I’m a big fan of Din but am finding it difficult to match a body copy or a secondary serif headline.\n\nWe’ve got a large library of fonts that have already been purchased, but the list is a bit out of date. if anyone can recommend some old classics or sources of any freebies/trial downloads, feel free!\n\nIf you want to see some of our work, visit [our website](http://web.archive.org/web/20090608094910/http:/www.absolutepublishing.com/). The site isn’t up to much visually, but the printed work is nice!\n\nLook forward to your thoughts!\n\nChris\n\n",
  "author": "<a href=\"/web/20090608094910/http://typophile.com/user/39813\" title=\"View user profile.\">chudies</a>",
  "time": "<br>",
  "uid": "39813",
  "comments": [
    {
      "time": " 20.Nov.2008 8.07am",
      "content": "Have you looked at the Freight family?  \nThere’s a massive variety of styles...  \n [http://www.dardenstudio.com/typefaces/](http://web.archive.org/web/20090608094910/http:/www.dardenstudio.com/typefaces/ \"http://www.dardenstudio.com/typefaces/\")\n\nVillage have a pretty cool selection of sans serifs like National, Router and Galaxie Polaris...  \n [http://vllg.com/](http://web.archive.org/web/20090608094910/http:/vllg.com/ \"http://vllg.com/\")\n\nYou’re not looking for freelance magazine designers by any chance? ...  \n [http://boico.net/](http://web.archive.org/web/20090608094910/http:/boico.net/ \"http://boico.net/\")\n\nM\n\n"
    },
    {
      "time": " 20.Nov.2008 8.17am",
      "content": "Darden Studio has a number of faces that are getting a lot of play in publication design.  \n [Darden Studio](http://web.archive.org/web/20090608094910/http:/www.dardenstudio.com/typefaces/). I’m diggin’ Jubilat.\n\nFont Bureau also seems to be releasing some of their custom pub faces for licensing.  \n [Magazine Fonts](http://web.archive.org/web/20090608094910/http:/www.fontbureau.com/magazine/fonts/). Popular, and Boomer Sans and Serif are nice.\n\nOf course [Christian Schwartz](http://web.archive.org/web/20090608094910/http:/christianschwartz.com/stag.shtml) has designed a lot of great typefaces.  \nStag, Stag Sans.\n\n[Village](http://web.archive.org/web/20090608094910/http:/www.vllg.com/fonts/) has a lot of great faces available.\n\nFor a general workhorse body copy typfaces I would recommend [Whitman](http://web.archive.org/web/20090608094910/http:/www.fontbureau.com/fonts/Whitman).\n\n"
    },
    {
      "time": " 20.Nov.2008 9.09am",
      "content": "boicozine,\n\nUnfortunately we’re not looking for freelancers, at the moment, sorry!\n\nThanks for these suggestions guys, I do like a few of these. Purchasing fonts isn’t something I’ve done a lot of...\n\nDo you guys know if libraries are willing to let you ’try out’ some of these before buying? I’ve got to persuade my own editors before we even get as far as the client, so some testing might be in order...\n\nOtherwise, any more classics I might be able to dig out of my library?\n\n"
    },
    {
      "time": " 20.Nov.2008 9.58am",
      "content": "\\> Do you guys know if libraries are willing to let you ’try out’ some of these before buying?\n\nNo idea if [Museo Sans](http://web.archive.org/web/20090608094910/http:/www.myfonts.com/fonts/exljbris/museo-sans/) might fit the bill, but the 500 and 500 italic are free. [Museo](http://web.archive.org/web/20090608094910/http:/www.myfonts.com/fonts/exljbris/museo/) (perhaps for headlines?) even has three free weights.\n\n"
    },
    {
      "time": " 20.Nov.2008 12.31pm",
      "content": "I do think some of these foundries will offer you a testing license, but I’ve never done it. You will have to contact them directly.\n\n"
    },
    {
      "time": " 20.Nov.2008 12.54pm",
      "content": "Information about Font Bureau’s testing policy can be found here: [http://www.fontbureau.com/help/testing](http://web.archive.org/web/20090608094910/http:/www.fontbureau.com/help/testing \"http://www.fontbureau.com/help/testing\")\n\n— Kent.\n\n"
    },
    {
      "time": " 21.Nov.2008 3.23am",
      "content": "Hey chudies, thanks. It never hurts to ask. :)\n\nI don’t know how much luck you’ll have trying to get any free samples.  \nI think Chris has the best advice. Just ask and see,  \nthey tend not to advertise these sorts of things for fear people won’t buy the real thing.\n\nM\n\n—  \n [http://blog.boico.net/](http://web.archive.org/web/20090608094910/http:/blog.boico.net/ \"http://blog.boico.net/\")\n\n"
    },
    {
      "time": " 24.Nov.2008 8.47am",
      "content": "Thanks for the advice guys. I’m going to plough on with Din for now on its own, and try and find a smart body copy...\n\n"
    },
    {
      "time": " 24.Nov.2008 9.34am",
      "content": "Hey Chudies,  \nYou might want to check out a few combination for body copy I’ve found on Typophile if you are going ahead with din:\n\nDin with Warnock  \nDin with caecillia  \nDin with scala (serif)\n\nRobert Slimbach’s Warnock is my favorite combination with Din. Enjoy!\n\n"
    }
  ]
}
