{
  "id": "51919",
  "title": "Otl Aicher's and Gudrun Zapf von Hesse's secret love child",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[This](http://web.archive.org/web/20131017031921/http:/www.myfonts.com/fonts/dootype/ninfa/) is what [Rotis Semi Serif](http://web.archive.org/web/20131017031921/http:/www.fontshop.com/fonts/downloads/monotype/rotis_serif_and_semiserif_pro_vp/) would've looked like if it had been drawn by [Gudrun Zapf von Hesse](http://web.archive.org/web/20131017031921/http:/www.fontshop.com/fonts/designer/gudrun_zapf_von_hesse/). ;^)\n\n[http://www.myfonts.com/fonts/dootype/ninfa/](http://web.archive.org/web/20131017031921/http:/www.myfonts.com/fonts/dootype/ninfa/ \"http://www.myfonts.com/fonts/dootype/ninfa/\")\n\n",
  "author": "Bald Condensed",
  "time": "20 Nov 2008 — 12:16pm",
  "uid": "110",
  "comments": [
    {
      "time": "21 Nov 2008 — 1:45am",
      "content": "As I see it, anything mixing the genetic code with Rotis is a given stillborn. In all honesty Ninfa is better than that.\n\n"
    },
    {
      "time": "21 Nov 2008 — 9:05am",
      "content": "Rotis is unfairly criticized. Although there are many things about it I would change, it nonetheless contains more of value than 95% of fonts out there. Most of all, its _intent_ puts almost all the current Pretty font design to shame. I recommend reading Aicher's monumental book.\n\nhhp\n\n"
    },
    {
      "time": "21 Nov 2008 — 10:05am",
      "content": "The book's good though.\n\n"
    },
    {
      "time": "21 Nov 2008 — 10:56am",
      "content": "_I recommend reading Aicher’s monumental book._\n\nWhat's the title? (Wikipedia lists \"The Kitchen is for Cooking\" (1982); \"Walking in the Desert\" (1982); \"Critique of the Automobile\" (1984); and \"Inside the War\" (1985)).\n\n"
    },
    {
      "time": "21 Nov 2008 — 11:08am",
      "content": "\"Typographie\", 1988 (and 2005 apparently).\n\nhhp\n\n"
    },
    {
      "time": "21 Nov 2008 — 11:56am",
      "content": "Found a copy, thanks for the tipoff!\n\n"
    },
    {
      "time": "22 Nov 2008 — 8:41am",
      "content": "Aicher's book [Typographie](http://web.archive.org/) is very good, but it's less about designing typefaces than his philosophical dialogues about communication and the influence of contemporary culture and environment on our ability to comprehend visual language. I haven't seen the reprints so I can't compare it to the original edition printed by [Druckhaus Maack](http://web.archive.org/web/20131017031921/http:/www.wiedler.ch/felix/books/story/106) in Germany.\n\n[Otl Aicher](http://web.archive.org/web/20131017031921/http:/typophile.com/wiki/Otl%20Aicher) was by no means a type designer and was best known for his graphic design, corporate brands and informational systems. As Hrant stated, Rotis was more about Aicher's intent. If he had collaborated more with Adrian Frutiger there may have been a more successful attempt with Rotis.\n\nPersonally I truly enjoyed my time working with Herr Aicher in bringing Rotis to the marketplace, though we had to heavily rework his font data to meet Agfa's quality standards. Yes, Rotis is not among my favorite typefaces, but neither will I bash it.\n\n"
    },
    {
      "time": "22 Nov 2008 — 8:51am",
      "content": "The reprint is of surprisingly substandard quality. The pages are reproduced, not reset. Some of the type was blurry in some of the copies I saw. I recommend trying to track down a used copy of the first edition, if you can.\n\nThere are a number of things I do not understand about the book, but the chief among them is this: Aicher was not a fan of uppercase letters, as he deemed them to authoritarian. The book's text is in German and English; the columns sit side by side on the page. The German text does not use any capital letters—quite a statement in German, where capitals play an important role. However, the English translations DOES uses upper and lowercase letters. This I cannot understand. Are English-speaking people not as equally oppressed by the (albeit less frequent) use of capital letters? Did he just overlook this aspect of the book's production? I do not know.\n\n"
    },
    {
      "time": "22 Nov 2008 — 8:53am",
      "content": "Indeed, what's so impressive and deserving of respect is  \nthat Rotis was basically his first typeface. Let's all look  \nback at our own first efforts to grasp the implications...\n\nWhether you look at it in terms of commercial success  \nor culture, Rotis is something to be studied seriously.\n\nhhp\n\n"
    },
    {
      "time": "22 Nov 2008 — 11:48am",
      "content": "Hrant: _Rotis is something to be studied seriously_\n\nMost seriously, perhaps, one can ask 'Why doesn't this type design really work?' Of course, this is a question one can ask of many typefaces, but few so prominent as Rotis. It provides a good case study in the problems of producing letter shapes that are, individually, interesting, but which don't work together as a typeface.\n\n"
    },
    {
      "time": "22 Nov 2008 — 1:27pm",
      "content": "Dan -- <cite>The reprint is of surprisingly substandard quality.</cite>\n\nIf it is the one I remember having seen, it's indeed an outright dilettantish reprint. They must have scanned entire pages in grey, rather than scanning the text part in black/white ...\n\n"
    },
    {
      "time": "22 Nov 2008 — 4:17pm",
      "content": "John, if that's a good question (and it probably is) it leads to the converse: why does such-and-such font have -what is considered- harmony in all its glyphs? Is it because the designer truly understood readability, or is it because the designer understood how to mimic fonts that people simply don't complain about? In virtually every single case, it's sadly the latter. In fact in most cases the designer doesn't even give a hoot about understanding readability; he is content to celebrate and imitate. It makes him feel warm, and helps pay the bills. At least Aicher was not a performing monkey, a cultural hanger-on.\n\nhhp\n\n"
    },
    {
      "time": "22 Nov 2008 — 10:38pm",
      "content": "I think you are talking about orthogonal topics here, because I don't believe that Aicher had a clue about readability or even much of a concern about it.\n\nHow a set of necessarily differentiated signs is made to create a unified visual whole is indeed an interesting question. [It is the theme of a lecture I am preparing; details later.] In those terms, the Rotis-inspired lettering in the floor of the great court at the British Museum is interesting, because a strategy (flaring the stems) has been employed to create greater visual unity between the disparate letter shapes. It almost works.\n\n"
    },
    {
      "time": "22 Nov 2008 — 11:09pm",
      "content": "Have you read Aicher's book?  \nWe can argue whether he understood readability well (there is in fact reason to believe he didn't) but his _dedication_ to improving readability while tossing out stagnant conventions is quite apparent, and to me highly commendable. The same cannot be said of the great majority of type designers, who are either too busy being artistes or too afraid to think.\n\nhhp\n\n"
    },
    {
      "time": "23 Nov 2008 — 1:30am",
      "content": "I consider Rotis a landmark typeface, and I was surprised when years ago I learned it was criticized for some reasons. They seem irrelevant to me. Besides the convinction about the uppercase Dan mentioned adds to the puzzle…\n\n"
    },
    {
      "time": "23 Nov 2008 — 4:23am",
      "content": "@Norbert: _If he had collaborated more with Adrian Frutiger there may have been a more successful attempt with Rotis._\n\nAs if Rotis is not already successful as it is? Maybe you mean Rotis would have been more conventional, conformist and to your liking, more like other type designs? Maybe you mean something else. Don't let me put words into your mouth.\n\n@John: _Most seriously, perhaps, one can ask ’Why doesn’t this type design really work?’ Of course, this is a question one can ask of many typefaces, but few so prominent as Rotis. It provides a good case study in the problems of producing letter shapes that are, individually, interesting, but which don’t work together as a typeface._\n\nI think Rotis \"works\" just fine. Its disparate forms work together as a typeface if you let go of some of your preconceptions about what makes a \"good\" type design.\n\n==============================================\n\nThe widespread assumption that disparate letterforms are a bad thing or somehow undesirable in a type design may be due to the general flaw in Western thinking which tends to regard non-conformity and inconsistency, no matter how small, as inherently \"bad\" and undesirable.\n\nRotis' **c** and **e** are depart structurally from the face's **o**. Ho boye, what a liberty! How terrible, they say, those Rotis haters. I don't know much about Rotis' creation or history, or the man who designed it, but I think the differentiated **c** and **e** are the main features of Rotis that cause its detractors to dislike it so readily.\n\nYou see the problem? Rotis and its **c** and **e** are not the problem. One-eye black & white Western thinking is the problem. It's a typeface, not a flipping army you know. Don't take it personally, it's aimed at everybody who thinks Rotis doesn't work.\n\nThere is nothing fundamentally wrong with the Rotis design. Its differentiated **c** and **e** , once assimilated by the human mind, should result in enhanced readability. Nothing could make more sense to a guy like me who thrives on non-conformity.\n\n@Hrant: _. . . his dedication to improving readability while tossing out stagnant conventions is quite apparent, and to me highly commendable. The same cannot be said of the great majority of type designers, who are either too busy being artistes or too afraid to think._\n\nPrecisely. Convention is good for the sake of standards and having a mainstream, for better or worse. At the same time convention, or more accurately—conformity—is the enemy of typeface design.\n\nIn other words, Jenson and Griffo's roman type designs are very pretty because they follow the renaissance ideal of harmony in art & design. But how much grasp did those two men possess of readability theory? I think we can safely assume both Jenson and Griffo had a solid grasp of the need for a typeface to be readable since they were inventing Western Latin neo-classical type design & typography at a time when the so-named gothic style, complete with all its strengths and foibles, remained very strong, and neo-classicisim was relatively new.\n\nStylistic uniformity (artiste-ry) is one thing, and structural sophistication is something else.\n\nWe can ask the question then: is \"visual unity\" or a \"unified visual whole\" the be-all and end-all of typeface design, or should this kind of stylistic preoccupation be demoted, and should it be informed by the structural principles that make blackletter forms diverse?\n\nCan Western type designers ever relinquish their preoccupation with stylistic unity? Fear of thinking holds us back.\n\nI am not afraid to think. I am not afraid to die either. My only fear is coming to the end of the second life before my work is complete.\n\nIf it doesn't kill you, it's good for you.\n\nj a m e s\n\n"
    },
    {
      "time": "23 Nov 2008 — 9:07am",
      "content": "Well said.\n\nAnd there is something else, which is going unsaid: many people  \noppose Rotis essentially because it violates the pen. They strike it  \ndown not because they have any evidence about divergence (or  \nanything else really) but because it ignores their pet religion.  \nThey can't stand to look at it, so they cry: Heresy! They would  \npaint -and I do mean paint- a scarlet \"A\" on its proud chest.\n\nhhp\n\n"
    },
    {
      "time": "23 Nov 2008 — 9:18am",
      "content": "Funny I did not even think about single forms in Rotis before this talk. I always looked at it and enjoyed how it's accomplished. Maybe it is a little stiff, or \"cold\" for my taste, but this goes most for the Sans version. The SemiSans and the Serif are great, and lively.  \nCould you tell me precisely when the face was designed?\n\n<cite> The widespread assumption that disparate letterforms are a bad thing or somehow undesirable in a type design may be due to the general flaw in Western thinking which tends to regard non-conformity and inconsistency, no matter how small, as inherently “bad” and undesirable. </cite>\n\nI would say more \"non-conformity\". \"Inconsistency\" does not make a good element, unless it's provisional. Besides, I have the impression a part of Eastern thinking may have opposite flaws.\n\n"
    },
    {
      "time": "23 Nov 2008 — 9:20am",
      "content": "<cite> […] oppose Rotis essentially because it violates the pen. </cite>  \nWhile it just moves the pen to a different angle.  \nWonder what they would say of my approach… :=P\n\n"
    },
    {
      "time": "23 Nov 2008 — 9:59am",
      "content": "Regarding c and e: these are a problem, more so in the semi serif and sans faces.  \nIt's too easy to mistake c for e.  \nA combination of similar counter shape, and the suggestion of a horizontal bar which is made by the flat bottom of the terminal, create a \"notan\" that is similar for the two letters.\n\nNow you may ask, why isn't this a problem in, say, Helvetica? The answer is that the counters of the two letters are quite different sizes in Helvetica.\n\nThe design of the Rotis \"c\" defines a \"broken\" counter, with a semi-circular top part that is similar to the enclosed counter in \"e\", and an open bottom half; whereas in Helvetica, the counter of \"c\" is one big oval, quite distinct from the two semicircular counters in \"e\"\n\nSurely this is a design flaw in a text face?  \nAnd as this is a key characteristic of the face, isn't it fundamentally flawed?\n\n ![](http://web.archive.org/web/20131017031921im_/http:/typophile.com/files/ces_4385.png)\n\n"
    },
    {
      "time": "23 Nov 2008 — 10:06am",
      "content": "I agree with your general direction, but one has to always factor in real text in discussions of readability. How many word-pairs are there where one has a \"c\" and the other an \"e\" in a given spot? Almost zero. Compare that to the much greater \"swappability\" between \"e\" and \"o\", and one would start thinking that Helvetica's \"e\" is too close to its \"o\", and it would be better if it diverged towards the \"c\" instead (promoting at least some stylistic consistency).\n\nhhp\n\n"
    },
    {
      "time": "23 Nov 2008 — 12:14pm",
      "content": "James, I don't find divergent shapes per se a problem: what bothers me about Rotis is that the shapes pull in all sorts of different directions and are out of proportion to each other. The problem with the Rotis **c** and **e** , in particular, is not that they are 'wrong' because the don't follow the shape of other bowled letters, but that they are massively wider and more open than any of the other letters, so much so that they appear out-of-scale, and have a pronounced visual thrust toward the upper-left while other letters have either a vertical or slight rightward lean.\n\nThe **c** and **e** also draw attention to themselves because they are, in fact, the only interesting shapes in the design: if you look at the Rotis types without the **c** and **e** present, you see that they are, in fact, rather dull and _very conservative_ designs. Is introducing two eccentric but high-frequency shapes into an otherwise pedestrian typeface really a non-conformist or avant garde exercise, or is it a bit of typical graphic design sleight of hand, giving the appearance of greater novelty than is actually present? Compared to genuinely ground breaking work such as Evert Bloemsma's types, Rotis looks pretty thin in both conception and execution.\n\n"
    },
    {
      "time": "23 Nov 2008 — 12:59pm",
      "content": "_How many word-pairs are there where one has a “c” and the other an “e” in a given spot?_\n\nTrue, but one should also consider that people might read words that aren't real, especially if they follow familiar lexical forms. For instance, \"graphie\" is not a word, but it looks and sounds like one; \"-ie\" is a reasonable word ending, and \"graffy\" does exist, as the ending of typography, for instance.\n\n"
    },
    {
      "time": "23 Nov 2008 — 2:35pm",
      "content": "Here are some off the top of my head\n\narc are  \ncar ear  \nscar sear  \ncat eat  \nscat seat  \ncel eel  \ncon eon\n\nNot _that_ rare...\n\n"
    },
    {
      "time": "23 Nov 2008 — 2:49pm",
      "content": "I think that John Hudson's latest post nailed it: the problem isn't just that the c and e look odd, but that they look odd in the company of the other letters. That is really not good. You can do almost anything with a letter, but it has to work with the other letters in the design. That's probably as near to a 'law' as you get in type design.\n\n"
    },
    {
      "time": "23 Nov 2008 — 3:30pm",
      "content": "Discussions of \"c\" versus \"e\" versus \"o\" are a side-show.  \nRotis is relevant not really as a collection of letters, but  \nas a design philosophy (or rather, the beginnings of  \none). When John feels compelled to compare it against  \nthe work of Bloemsma, that's already saying a lot.\n\nhhp\n\n"
    },
    {
      "time": "23 Nov 2008 — 10:33pm",
      "content": "I wasn't comparing, I was contrasting: Bloemsma's work is serious, thorough and challenging; Rotis is half-baked, lazy and superficial. Was I compelled to make such a contrast? More importantly, was I compelled _by Rotis?_ -- no, I was responding to James' comments, which I thought gave Rotis far more credit than it is due. Seriously, take out those two dramatic lowercase letters that don't fit with the others, and what is left? Some very arbitrarily proportioned but conservative shapes. Rotis is a bit like listening to a very tentative musical composition in which a couple of 'daring' dischordant harmonies are thrown in to make it seem avant garde.\n\nI doubt if I have anything more to add to this thread, and I don't enjoy criticising typefaces, especially when the designer isn't alive to respond.\n\n"
    },
    {
      "time": "23 Nov 2008 — 10:36pm",
      "content": "\\> superficial\n\nIf you can find the time, do read the book.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2008 — 1:21am",
      "content": "I just pulled the ('88 edition, _obviously_) book from out of the office library – it's excellent. Both in research and writing.  \nI've just read van Krimpens _On Designing and Devising Type_, and _man_, the guy cannot finish a sentence. It just goes on and on and... So it's refreshing to read Aichers prose. Well illustrated and a nice layout. But the only thing that disturbs the discriminating eye is, well, the type. I'm sorry.\n\n"
    },
    {
      "time": "24 Nov 2008 — 6:17am",
      "content": "I think John's observations are limited by what he sees as the only functional and artistic process to design an alphabet. Evert Bloemsma and Otl Aicher (besides living in entirely different places and times) worked with letters in different means. It's clear Bloemsma strived to refresh and perfection arrangements of forms, while Otl was working on a visual level with cultural and ideologic elements. Since the latter are not planned in John's approach (but they are present, since they are unavoidable), he sees Rotis only on a functional/formal level, while the life of a typeface can by no means be measured by that alone.  \nI don't know what Bloemsma could have designed, if he witnessed nazism (Aicher was 17 when he got involved in the White Rose movement) and lived in Germany during World War Two.\n\nNick's observations about the [c] and [e] are important, but I never noticed them, since I was always fascinated by Rotis as a whole. It shows it sometimes doesn't work so well, but I don't have to set books with it, maybe catalogues or some magazine.\n\n"
    },
    {
      "time": "24 Nov 2008 — 7:04am",
      "content": "OK, I think you should forget Bloemsma, his oeuvre isn't part of John's point anyway, far as I understand it.  \nWhatever engagement Aicher had against the Nazis has absolutely no value in determining if Rotis is good or bad (it's bad, by the way).  \nIf you want to discover genius at work, I suggest You rather take a look at Aichers [visual identity work](http://web.archive.org/web/20131017031921/http:/www.1972municholympics.co.uk/) for the 1972 Olympics in Munich. It's superb graphic design.\n\n"
    },
    {
      "time": "29 Nov 2008 — 7:01am",
      "content": "@Fredo: I did not speak of \"engagement\", I was talking about historical context.  \nI consider a work by that angle as well, it makes no sense to consider just \"functionality\" if you forget all the rest…\n\nI still have not found a convincing argument about Rotis being \"badly designed\", as I look at it I still think it's very good, (and innovative), until someone shows me some other author did a similar thing a years before Aicher.\n\n"
    },
    {
      "time": "29 Nov 2008 — 8:29pm",
      "content": "_Since the latter are not planned in John’s approach (but they are present, since they are unavoidable), he sees Rotis only on a functional/formal level, while the life of a typeface can by no means be measured by that alone._\n\nThe life of a typeface, no, but then lots of not very good typefaces have been very popular indeed, including typefaces that functionally are very much worse than Rotis. The life of a typeface -- how it is used, the place it comes to have in design or cultural history -- is often a reflection of 'cultural and ideologic elements' that are external to the design. The life of Helvetica is an obvious example.\n\nThe historical context of a thing is often interesting, and can sometimes suggest criteria for judging that thing which might not otherwise have been considered. But when the thing in question is a typeface there are prerequisite criteria.\n\n"
    },
    {
      "time": "2 Dec 2008 — 4:39pm",
      "content": "What a funny title for a post. To me Ninfa was one of the best brazilians type designs of 2008. The cadence of the forms are beautiful, mainly in regular and bold. What you guys think about her?\n\n"
    },
    {
      "time": "2 Dec 2008 — 6:08pm",
      "content": "Ninfa? Oh. Yeah. :-)\n\nI like the hybrid effect: a lot of bulges and a lot of flats too. And I like seeing the trapping (although I wonder why the caps don't have any). The only thing that bothers me is the ungainly vertical serifs, like in the \"T\" (and the \"Z\"/\"z\") especially in the Bold. Oh, and I like the fact that it doesn't have italics.\n\nSome smaller crits:  \nThe \"M\" is out of balance; the \"t\" is out of character; the florin should slant; the daggers are ugly; and the eszet could without the stub.\n\nhhp\n\n"
    },
    {
      "time": "3 Dec 2008 — 6:08am",
      "content": "I could never understand all this criticism towards Rotis. Though it's not my favorite typeface ever, there is not much I dislike in it. The unusual e and c give a nice twist of personality to a somewhat conservative design, thus making it very useful for specific works where seriousness and readability must go together well with uniqueness (bank identity, corporate communication). The sans serif - serif variations are among the best I've seen (and also among the very first ones). And saying that it's easy to read e instead of c is irrelevant - you really must have a serious problem to make this kind of mistake when reading a text.\n\nI'm glad I dedicated a chapter of my book to Rotis. It deserves it.\n\ndr\n\n"
    }
  ]
}
