{
  "id": "51926",
  "title": "Jost Hochuli to speak at St Bride",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20081202022835/http:/typophile.com/user/108 \"View user profile.\") : 20.Nov.2008 4.40pm \n\nJost Hochuli: Systematic book design?  \n=====================================  \nLecture on Thursday 27 November 2008 at 7pm\n\n\\* In the Bridewell Hall, St Bride Foundation  \n \\* Admission £7; concessions £5; Friends of St Bride £3  \n \\* Pay on the door\n\nThe adjective ’systematic’ (from the Greek word ’systematikos’) means, in one dictionary definition: ’proceeding from a system, methodical, planned; corresponding to a system’. Systematic book design thus means: book design that follows a plan fixed before the work begins. A conscious, rational procedure sooner or later reaches an end: the unconscious — or that which is a matter of feeling — plays a large and often decisive role in design. Using examples from some of his own works, Jost Hochuli will try to show where the irrational has resolved rational decisons.\n\nAfter this talk Jost will be happy to answer questions both on book design and aspects of typographic detailing, the subject of his new book Detail in typography. Copies of this book published by Hyphen Press will be available for on sale on the evening at a specially discounted rate.\n\nAbout our speaker  \n————————-\n\nJost Hochuli is a Swiss typographer and graphic designer. After study at the Kunstgewerbeschule St.Gallen, he trained as a compositor with the printer Zollikofer and at the Kunstgewerbeschule Zürich; his education was completed in 1958-9 in Adrian Frutiger’s class at the Ecole Estienne. Since then he has practised as a freelance graphic designer, eventually specializing in book design. In 1979 he co-founded the co-operatively run publishing company VGS Verlagsgemeinschaft St.Gallen, for which much of his book design work has been done. He has taught at the schools at Zurich and then St Gallen since 1967. As writer and editor, his books include Book design in Switzerland (1993), Designing books (1996), and a major monograph on his work: Jost Hochuli: Printed matter, mainly books (2002). An English-language edition of his Detail in typography was published earlier this year. He has edited and designed the annually published ’Typotron’ series of booklets (1983-98) and the Edition ’Ostschweiz’ (from 2000).\n\n[http://stbride.org/events?show=josthochuli](http://web.archive.org/web/20081202022835/http:/stbride.org/events?show=josthochuli \"http://stbride.org/events?show=josthochuli\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20081202022835/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 20.Nov.2008 4.40pm",
  "uid": "108",
  "comments": [

  ]
}
