{
  "id": "51977",
  "title": "Extended Cyrillic Italic",
  "forum": "Design",
  "tags": [

  ],
  "content": "Continuing my policy of NLLB I’m working on adding in italics for Coruña in the Cyrillic block. I’ve already finished the standard cyrillic but I’m stumped on whether there are changes in the italic forms for certain older letters and if so what they might be.\n\nFor instance, the yat while normally looking like a b with a bar, turns into a shape more like an n with a loop.\n\nI figure many might not have changes, but since Cyrillic has some of the large changes like Latin best to check with the experts.\n\n [‹ Arabic Fonts](http://web.archive.org/web/20081201172725/http:/typophile.com/node/38807 \"Go to previous forum topic\") [What kind of type style are these logos? ›](http://web.archive.org/web/20081201172725/http:/typophile.com/node/51976 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081201172725/http://typophile.com/user/16708\" title=\"View user profile.\">guifa</a>",
  "time": "<br>",
  "uid": "16708",
  "comments": [
    {
      "time": " 22.Nov.2008 3.28am",
      "content": "Have you looked at fonts on the ParaType site?\n\n"
    },
    {
      "time": " 22.Nov.2008 3.57am",
      "content": "Paul,\n\nThose gave me an idea for some of them. But other letters that don’t seem to show up in most fonts anyways like Ҩ I don’t have any samples for them in italic. Almost all the komi letters I’m quite clueless on how to do in italic.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 22.Nov.2008 9.08am",
      "content": "I believe that the Komi letters are not necessary, as they haven’t been used since the 1930s and before that were only current for about a decade.\n\n"
    },
    {
      "time": " 22.Nov.2008 9.47am",
      "content": "This doesn’t really answer your question but in case you haven’t noticed yet, several changes have been made to the glyphs displayed on the Cyrillic Unicode block chart starting in version 5.1 [http://www.unicode.org/versions/Unicode5.1.0/erratafixed.html](http://web.archive.org/web/20081201172725/http:/www.unicode.org/versions/Unicode5.1.0/erratafixed.html \"http://www.unicode.org/versions/Unicode5.1.0/erratafixed.html\")\n\nAnd more changes are coming (in v5.2?) [http://www.unicode.org/errata/](http://web.archive.org/web/20081201172725/http:/www.unicode.org/errata/ \"http://www.unicode.org/errata/\")\n\n"
    },
    {
      "time": " 22.Nov.2008 5.55pm",
      "content": "I did see that, part of it went with the type of descender used (I asked a question on that a while back because only some times it seems like the descenders are contrasting and if there was a logic or to whether it got a right-sided-, left-sighted-, spiked-, or cedilla- style descender though it seems like no one really knew)\n\nAnd yeah I know they’re not used. But, I’m trying to be complete, since I’m one of the freaks who uses the odd character that tends to never be available I figure I might as well make sure it doesn’t happen to anyone with my font. (and of course the standard “learning experience” from it all :) )\n\nAlthough rereading over the errata, while it mentions that some are changes due to current taste (the e with the tag and descender thingy) and others due to style consistency (uk lig), the broad omega changed but I’m not sure what the reason is for it.... the beautiful omega keeps the old open style while the others have changed to the W style. Is the open style wrong or is it simply a readjestment for stylistic purposes?\n\nI guess I can just go ahead and make guesses and post the results ... for most I suppose I’ll just do them inclined with the more italic style curved terminals etc and see how that works.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
