{
  "id": "51980",
  "title": "An unguided attempt.",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello all, though it is still early in the process, I still want to show this before I continue. It'll be obvious that I'm looking at the forms of Franklin Gothic for cues. Every now and then I feel like it's not original enough. So I ask you, trained experts — is this too similar to Franklin Gothic? In the end, I hope for it to be a strong but friendly and soft, grotesque face. I'm thinking it'll have more personality once I get to the bold/black weights. Should I just jump to those instead and neutralize the unique features for the text weights?\n\n| Attachment | Size |\n| --- | --- |\n| [unnamed.pdf](http://web.archive.org/web/20140713230859/http:/typophile.com/files/unnamed.pdf) | 254.31 KB |\n\n",
  "author": "kosal",
  "time": "22 Nov 2008 — 4:04am",
  "uid": "4186",
  "comments": [
    {
      "time": "6 Dec 2008 — 10:45am",
      "content": "Really? nobody?\n\n"
    },
    {
      "time": "6 Dec 2008 — 10:44pm",
      "content": "A few thoughts:\n\n- I'm not sure the slanted crossbar of e is working in this grotesque face.  \n- Where rounded forms merge into straight stems, I think the combination of the thinned stroke and the ink-trap like cut are too strong - they seem to sever the rounded stroke. (I wonder if the \"inktrap\" should bite a bit into the straight stroke as well?)  \n- Shouldn't bottom of b angle away from bowl (compare a and d)?  \n- Leftmost stroke of A is too thin.  \n- Round dots of 'i' with square period is a bit weird to my eye.  \n- Your space character may be too wide, making the font's function in running text more difficult to gauge.\n\n"
    },
    {
      "time": "7 Dec 2008 — 1:59pm",
      "content": "Thanks for the comments, eliason. I really want to make the slanted crossbar of e to work. It gives an almost casual feel the whole face. Any ideas on how to work on that? I'll definitely take a look at the convergence of round to straight. It was my goal for it to have a smooth, monolinear quality, it's important not to sever the strokes. The W is bothering me, too but I can't seem to find good examples of that shape. Any recommendations would help.\n\n"
    },
    {
      "time": "7 Dec 2008 — 4:42pm",
      "content": "Maybe _more_ slant on the e crossbar would work, then - so it's clearly a design feature rather than a misprinted letter. Look at [Kabel](http://web.archive.org/web/20140713230859/http:/www.myfonts.com/fonts/linotype/itc-kabel/)'s e (the first example of a sans with such a feature than comes to my mind) - a much more assertive angle.\n\nMaybe someone else will weigh in on suggestions for the W - I agree it needs work.\n\n"
    }
  ]
}
