{
  "id": "51985",
  "title": "Two Lines English Egyptian",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everybody  \nMaybe this topic was already discussed on Typophile, but I wondered if William Caslon IV's Two Lines English Egyptian (1816), considered the earliest example of Sans Serif, had ever been revived as a software font ?  \nThank you very much\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/Caslon_5938.gif)\n\n",
  "author": "Celeste",
  "time": "22 Nov 2008 — 9:14am",
  "uid": "11083",
  "comments": [
    {
      "time": "22 Nov 2008 — 11:12am",
      "content": "A Google search for Caslon Egyptian will give you lots to look at, including this:  \n [http://www.orangeitalic.com/caslon.shtml](http://web.archive.org/web/20150312143939/http:/www.orangeitalic.com/caslon.shtml \"http://www.orangeitalic.com/caslon.shtml\")  \nand this:  \n [http://cavedoni.com/2007/11/introducing-micerino.pdf](http://web.archive.org/web/20150312143939/http:/cavedoni.com/2007/11/introducing-micerino.pdf \"http://cavedoni.com/2007/11/introducing-micerino.pdf\")\n\n... but neither seems to be available.\n\n"
    },
    {
      "time": "22 Nov 2008 — 6:02pm",
      "content": "Yes it has, by Miko McGinty.  \nBut not released.  \n [http://www.amazon.com/Crumbs-Heroes-Blues-Jazz-Country/dp/0810930862](http://web.archive.org/web/20150312143939/http:/www.amazon.com/Crumbs-Heroes-Blues-Jazz-Country/dp/0810930862 \"http://www.amazon.com/Crumbs-Heroes-Blues-Jazz-Country/dp/0810930862\")\n\nI've revived, and extended, an early sans by Vincent Figgins, from the 1830s.  \n [http://www.shinntype.com/figgins.html](http://web.archive.org/web/20150312143939/http:/www.shinntype.com/figgins.html \"http://www.shinntype.com/figgins.html\")\n\n"
    },
    {
      "time": "23 Nov 2008 — 8:10am",
      "content": "Covered in this thread: [http://typophile.com/node/39432](http://web.archive.org/web/20150312143939/http:/typophile.com/node/39432 \"http://typophile.com/node/39432\")\n\nCyrus Highsmith and Christian Schwartz helped finish out Miko McGinty's work for _Red Herring_. Some info and a showing at Christian Schwartz's: [http://www.orangeitalic.com/caslon.shtml](http://web.archive.org/web/20150312143939/http:/www.orangeitalic.com/caslon.shtml \"http://www.orangeitalic.com/caslon.shtml\")\n\nFont Bureau has the source data for these fonts, but I don't know whether they have any plans (or the rights) to ever release it.\n\n-- Kent.\n\n"
    },
    {
      "time": "26 Nov 2008 — 3:08am",
      "content": "Thank you everyone — the \"Red Herring\" Caslon is a real beauty, too bad it isn't available.\n\n"
    },
    {
      "time": "27 Nov 2008 — 12:26am",
      "content": "Well, let's work on it all over again and make it available. there is nothing as sad as a fully working, good looking historical typeface desperately waiting on some computer's dark corner for someone to use it on a printing device.\n\ndr\n\n"
    },
    {
      "time": "27 Nov 2008 — 1:17am",
      "content": "In his book on the Underground typeface, [Justin Howes](http://web.archive.org/web/20150312143939/http:/www.typophile.com/wiki/Justin%20Howes) notes that [Edward Johnston](http://web.archive.org/web/20150312143939/http:/www.typophile.com/wiki/Edward%20Johnston) referred to this sample before he began drawing his face. Although there are some obvious differences between the Underground type and Caslon's sanserif, I think that the underlying structure is much the same.\n\n"
    },
    {
      "time": "30 Nov 2008 — 1:38am",
      "content": "_In his book on the Underground typeface, Justin Howes notes that Edward Johnston referred to this sample before he began drawing his face._\n\nJust for the record, it may be worth pointing out that this isn’t quite what Justin claimed. He suggested that the maker of the Egyptian and Edward Johnston might both have been independently using the capitals of the first William Caslon’s roman type as a model. It’s a point of view, although it’s not one I agree with; and perhaps Justin would not have pushed the idea very far. At all events, it is unlikely that Johnston ever took any notice of the Caslon Egyptian. I think the resemblances between the two sanserif types, striking though some of them are, were coincidental. It would be safer to say that in both cases the model – at quite some distance – was inscriptional lettering. Johnston’s type, although he claimed in 1937 that it was ‘based on classical Roman capital proportions’, has two letters, G and M, that resemble 15th-century Italian designs and have nothing to do with Rome, nor with the first Caslon type.\n\nAnyone trying to make a font based on the Caslon Egyptian has problems. The original type appears as a single line in a specimen that was issued by one of the two Caslon typefoundries in London in about 1816.\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/Caslon%20-%202E%20Egyptian%202%20a%20det%20a%20500_3492.jpg)\n  \nThe materials of this foundry were bought in 1818 by Blake, Garnett, a typefoundry newly established in Sheffield, Yorkshire, which recast the Egyptian in about 1838 under the name of _English two line Sans-Surryphs_ and continued to show it in specimens until the 1850s, when the name of the foundry had become Stephenson, Blake. (Remember that ‘English’ in the name of the type is the body above Pica; the ‘two line’ version was cast on a body roughly equivalent to 28 points.) The type then seems to vanish from British use, but rather strangely it appears as the _Two-line Small Pica Gothic_ that can be seen as late as 1895 in the _Seventeenth book of specimens_ of Mackellar, Smiths & Jordan, Philadelphia.\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/2E%20Sans%20Surryphs%201838%20500_3903.jpg)\n  \nThe page above is from the specimen of Blake & Stephenson of about 1838. Several sorts in the newly cast type had changed for the worse. The new C was now a clumsy design, D was narrower than the original, and O had also been remade. You can see more detail of the original C in the image (which happens to be my own) that is used in the first post at the head of this thread. Had the first matrices been lost or damaged? We do not know, but it seems clear that whoever supplied the new ones was not a skilled operative. The surviving matrices are among the materials of Stephenson, Blake, now with the Type Museum, London. A fount was cast from them for Ian Mortimer, wood engraver and hand press printer in London, who printed a booklet on the type, _Caslon’s Egyptian, the first sanserif type_, in 1988.\n\nSo recreating the ‘original’ Egyptian type is not simple. It is not difficult to make a more authentic C, D and O from the showing of 1816, although copies of this are pretty heavily inked. But the punctuation in the surviving matrices is square, like that of some early slab-serif types. Is it original? There is no sure way of telling, since there is no punctuation in the original showing, which is one reason, among several, for thinking that the type was perhaps experimental and incomplete. There are no figures. And there is a curious kink halfway along the middle stroke of S, a sort that was not replaced.\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/Dulwich%20Gallery%20sign%202%20JM%205-2000%20det%20500_5389.jpg)\n  \nJustin Howes and I both made our own digital versions of the Egyptian in 2000. Mine is called _Tivoli_, and I sometimes use it in my own work. Justin’s was adopted for the exterior signs of the Dulwich Picture Gallery in London, a building designed by John Soane, who was of course a pioneer user of sanserifs. \n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/English%202%20line%20Grotesque%20SB%20c1850%20500_6380.jpg)\n  \nWe were both unhappy with the G in the revived type, which can be seen in a specimen of the 1850s, above – a letter that it was vital to get right for the Dulwich project. We each made our own versions, based on drawn or architectural sanserif lettering of about 1800. I think it is fair to say that, after several experiments with different designs, some of which were interesting and some of them very odd, Justin adopted a G that was quite close to mine. They were both made by adapting the original C. I made a new Q too.\n\nOne might say that making a font of the original Caslon Egyptian is a bit like making Gutenberg’s press. Since there is no complete authentic original to refer to, it calls for a leap of imagination.\n\n"
    },
    {
      "time": "30 Nov 2008 — 3:58am",
      "content": "Thank you, James, for that interesting account.\n\n"
    },
    {
      "time": "30 Nov 2008 — 4:03am",
      "content": "I’ll add to James Mosley’s post: my _Micerino_ is nothing else than an excercise directly based on James’ own _Tivoli_ type. Instead of using the source material – which I never had access too – it tries to wrap bezier outlines around the traced glyphs in James’ Type 1 font. It also includes the alternate glyphs from Blake & Stephenson, also in James’ own _Tivoli_ and makes them available as OpenType stylistic alternates. For many reasons, chiefly my own incompetence at the time when I did it, it’s an unsatisfactory typeface. The issues raised by James, Justin Howes’ version – which I wasn’t aware of – and the Font Bureau type are enough for me to safely say I won’t keep on working on this project for now. In fact I haven’t been working on it since early 2007.\n\nBut as this thread attests, there is continued interest in the type: the Whitney museum has used one of the various versions – I think it’s the Font Bureau one – for its [Biennial 2008 Web site](http://web.archive.org/web/20150312143939/http:/whitney.org/www/2008biennial/www/?section=home), for example.\n\n"
    },
    {
      "time": "30 Nov 2008 — 11:50am",
      "content": "Sorry to hijack this Caslon thread with Figgins again, but there isn't much material on the Caslon font, so perhaps the Figgins Sans can throw some light on the early days of sans.\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/Figgins_6688.png)\n\nOne thing to note is that the Figgins design varied significantly in different sizes, with, among other differences, square punctuation at one size, round at another. It's hard to know whether they were flummoxed as to how to execute this style, or were perhaps experimenting with the idea that more stroke contrast may be appropriate at larger sizes.\n\nI recently came across the Brevier size of the Figgins face in _Bentley's Miscellany_, November 1, 1837; so this is how sans faces were used in job work.\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/Fig_Boz_Spread_5365.jpg)\n  \n.  \n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/Figgins_Boz_5029.jpg)\n\n"
    },
    {
      "time": "30 Nov 2008 — 12:22pm",
      "content": "They really struggled with the C, too. Weird that they recognized the utility of terminals perpendicular to the stroke on the S but not the C.  \nStrange, also, that they used the more clotted design for the smaller Q.\n\n"
    },
    {
      "time": "30 Nov 2008 — 4:29pm",
      "content": "Props to NIck:\n\nI'd like to add that Nick's Figgins Sans is a very nice face, beautifully realized and lavishly full-featured. It doesn't match the Caslon, but for people looking for that \"flavour\" it's very suitable.\n\nIt's more useful than any Two Lines English Egyptian revival is likely to be.\n\n"
    },
    {
      "time": "1 Dec 2008 — 12:38am",
      "content": "I agree with Nick that the Figgins ‘Sans-serif’ types (so called) are well worth looking at. In fact it might be said to be that with these types the Figgins typefoundry brought the design into typography, since the original Caslon Egyptian appeared only briefly in a specimen and has never been seen in commercial use. One size of the Figgins Sans-serif appears in a specimen dated 1828 (the unique known copy is in the University Library, Amsterdam). Here is an image from a specimen dated 1832.\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/1%20Figgins%20-%205P%20Sans-serif%201832%20det%20500_4143.jpg)\n  \nIt is a self-confident design, which in the larger sizes abandons the monoline structure of the Caslon letter for a thick-thin modulation which would remain a standard model through the 19th century, and can still be seen in the ATF Franklin Gothic.\n\nNote that there is no lower-case. That would come, after 1830, with the innovative condensed ‘Grotesque’ of the Thorowgood foundry, which provided a model for type that would get large sizes into the lines of posters. It gave an alternative name to the design, and both the new features – the condensed proportions and the addition of lower-case – broke the link with Roman inscriptional capitals.\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/2%20Thorowgood%20-%207P%20Grotesque%201834%202%20a%20500_6041.jpg)\n  \nThe appearance of the Figgins and Thorowgood designs marks the acceptance of the sanserif in typography, after a long period when it can be found in other media but when its odd appearance and perhaps the lingering flavour of antiquarian associations seem to have deterred the typefounders. But the antiquarian associations of the design were still there, at least in the smaller sizes, as the specimen of the Pearl size (four and three quarters points) of Figgins’s type shows. It uses the text of the Latin inscription prepared for the rebuilt London Bridge, which was opened on 1 August 1831.\n\n ![](http://web.archive.org/web/20150312143939im_/http:/typophile.com/files/3%20Figgins%20-%20Pe%20Sans-Serif%20500_6108.jpg)\n\n"
    },
    {
      "time": "1 Dec 2008 — 1:19am",
      "content": "Thank you for correcting my statement, James, and for your enlightening posts! very interesting...\n\n"
    }
  ]
}
