{
  "id": "51992",
  "title": "my new typefaces",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello, I'm new here and wanted to get some opinions about my typefaces. Could you please comment it?\n\n ![](http://web.archive.org/web/20140713223300im_/http:/typophile.com/files/byk_5857.gif)\n  \n\n ![](http://web.archive.org/web/20140713223300im_/http:/typophile.com/files/kiriscan_capital_6632.gif)\n\n",
  "author": "bkiriscan",
  "time": "22 Nov 2008 — 2:08pm",
  "uid": "11697",
  "comments": [
    {
      "time": "28 Nov 2008 — 5:42pm",
      "content": "They look good. Any free versions?\n\n...er...at least a sample PDF? Just for my own interest.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "28 Nov 2008 — 6:26pm",
      "content": "First one looks ready for prime time.  \nIn the second one, C looks too condensed.  \nAm curious to see j, k, w, x, y, z in both.\n\n"
    },
    {
      "time": "20 Dec 2008 — 12:57am",
      "content": "I like First Style.\n\n"
    },
    {
      "time": "21 Dec 2008 — 12:55am",
      "content": "Hi bekir. Both faces look well crafted and well thought out. The typographic design is good too. The first one (do they have names yet?) is too closely spaced for text setting. The second one also requires some tracking out to make it more readable in a text setting. That is not to say you should increase all your side bearings. If you are using Fontlab you can create a simple internal tracking program using positioning commands which users can switch on and off as an OpenType feature.\n\nBoth fonts have a basic challenge ahead if you intend to release them for retail sale. Lots and lots of competitors. The first one in particular, a lot of that sort of thing has been done over the past decade. The second face is quite similar to a number of existing types.\n\n_In the second one, C looks too condensed._\n\nIt is a bit on the narrow side as far as the width goes, but this anomaly is not extreme enuff to be of concern. The C is not terribly distracting and does not compromize the color. Making it wider will affect color more, so I recommend leaving it as it is.\n\n_Am curious to see j, k, w, x, y, z in both._\n\nThe choice of Geeking Latin text is one of the silliest things type designers & typographers do. No offense to those who use it, but really, why use Latin text when it leaves out so many letters of the Latin alphabets we use, and gives no comprehensible clues about how your font performs with regard to linguistics?\n\nYou're better off setting samples in languages currently in use such as English or Turkish. The traditional typo-cred inferred by retro Latin samples is one thing, and practical useful testing methods are something else.\n\nj a m e s\n\n"
    },
    {
      "time": "8 Jan 2009 — 8:08am",
      "content": "Thanks for critiques, I'm to make use of all critiques, all characters of typeface are here...\n\n ![](http://web.archive.org/web/20140713223300im_/http:/typophile.com/files/font_5919.gif)\n\n"
    },
    {
      "time": "13 Jan 2009 — 12:25am",
      "content": "In \"Kiriscan Capital\", the parentheses are much too shallow; it's hard to distinguish the left parenthesis from the right parenthesis without looking closely. I like the structure of the ampersand very much, but the end that tapers to a point is completely out of place.\n\n"
    }
  ]
}
