{
  "id": "51995",
  "title": "Digital Letterpress",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm in a book arts program at a school that has both metal type and polymer plates for printing letterpress. I'm looking for more information on the digitizations of originally metal type. I'm concerned with the fact that most digital fonts don't have optical scaling, whereas most metal faces did (although does anyone know of any detailed information on optical scaling of metal types? There is some information in Richard Southall's Printer's type in the twentieth century).\n\nI'm also curious about whether types were digitized from actual impressions or the original drawings. When ink hits paper there is gain (i.e. ink spread) and ideally I'd like to know if that has been taken into account in digitizations. Any references would be greatly appreciated!\n\nI see from previous forum posts that people think Centaur was digitized from drawings and thus looks weak but this means it would look fine printed letterpress. And I know from taking proofs of 72 pt monotype centaur, that at this size there really is no comparison; the metal type is so much more refined.\n\n",
  "author": "Shrdlu",
  "time": "22 Nov 2008 — 3:27pm",
  "uid": "25592",
  "comments": [
    {
      "time": "22 Nov 2008 — 4:27pm",
      "content": "Hi Daniel,\n\n<cite>I’d like to know if that has been taken into account in digitizations. Any references would be greatly appreciated!</cite>\n\nThere have been quite a few threads on the topic of the digitization of metal faces. I guess you might find the bigger part of them by [searching typophile.com for ‘inkspread’](http://web.archive.org/web/20131020192010/http:/www.google.com/search?q=site:typophile.com%20inkspread).  \nF\n\n"
    },
    {
      "time": "22 Nov 2008 — 7:08pm",
      "content": "Steven Stinehour (Rocky's son) probably has as much practical experience with polymer plates as anyone. I believe he is now at at Capital Offset in New Hampshire. If he'll talk to you, that would be a good source.\n\nWill Powers who frequents Typophile has done a lot of printing with metal. I don't know if he's worked with polymer plates, but he has a good eye & might be able to steer you toward some sources.\n\n\\* \\* \\*\n\nI have done some work with revivals, but I should mention that my interest is entirely practical. I have no professors to satisfy, only my eye -- and of course, customers.\n\nThat said, there are a lot of differences between printing letterpress and printing offset, particularly letterpress pre 1960 -- papers and inks as well as the type. Ink spread is not linear, so more than just the letterforms themselves matter. Moreover, even though \"letterpress,\" a polymer plate will not give the same final printed letter in all details as metal, and again, ink and paper are different.\n\nThe \"reviving\" of metal era fonts that I've done is for typesetting by our company only. The only successful way I've found to proceed is to adjust the letters, print them however you will be doing the final printing (offset in our case), then re-adjust your letters looking at the printed work. Eventually, you get it pretty much right. With experience, your initial work gets closer to what you want, but you always need to come back for final adjustments.\n\nNothing new here -- you might want to read <cite>Counterunch</cite> by Fred Smeijers. Adjusting the letterform after looking at how it prints is as old as type itself. It was just faster in the old days.\n\nYou cannot mirror metal letterpress with offset no matter how careful you work. I doubt you can mirror it with a polymer plate. The differences in the cast letters -- 5 different instances of, say, \"e\", will be significant with metal & letterpress. They will be virtually identical CTP-offset. I'd bet that with a polymer plate, they will be very close -- much closer than with metal. There are other differences, too. The \"baseline\" with metal is not constant, there are slight differences when you assemble individually cast letters, whether Linotype or Monotype. I doubt this happens much with polymer plates, and of course, is absent in CTP-offset.\n\nFor revivals, the most you can do is capture some of the feel of metal letterpress. Perhaps this can come closer with a polymer plate, but the little I've seen (I'm no expert with polymer plate letterpress), I prefer well done offset, when I can specify the paper, and control the ink by choosing the printing firm.\n\nBTW, it would be a mistake to say that Centaur or Perpetua were fine in metal, bad in offset. There were particular \\*sizes\\* of Centaur & Perpetua that were wonderful in metal, but as I remember, it was about 1 size. With Perpetua, it was 14-point italic, wasn't it?\n\nFWIW\n\n"
    },
    {
      "time": "22 Nov 2008 — 9:24pm",
      "content": "Threads on this topic inevitably descend into scrabbles over Bembo; you will probably get better results on this topic by contacting people directly. People at Linotype and Monotype have plenty of experience in this area, as they did those early photo and digital revivals that weren’t so great and are now doing things differently. And of course, there are some very talented/friendly type designers in New England who do great revivals and are happy to talk about their work when time allows.\n\n"
    },
    {
      "time": "23 Nov 2008 — 7:12am",
      "content": "Thanks. I was hoping someone had a great reference to an article in the Monotype Recorder or an Adobe specimen book.\n\nStill I'd be interested if people would share their opinions about revivals that are too weak or thin but may work well when printed letterpress via photopolymer.\n\n"
    },
    {
      "time": "23 Nov 2008 — 7:57am",
      "content": "<cite> &gt; I’m also curious about whether types were digitized from actual impressions or the original drawings. </cite>\n\nFor the standard workhorse typefaces that have been in pretty much constant use and production, the answer is really \"neither.\" Keep in mind that for these faces, the transition from metal to digital was not direct.\n\nMany, many Linotype and Monotype faces went through some version of phototype. Some of these same faces might also have been produced in one of the earlier digital formats (pre-Postscript). Digital data may have been converted. Rounding errors may have been introduced. Etc.\n\nIn large production environments, each subsequent technological advance tends to evolve out of the previous. So in case of some familiar classics, there may be years of accretion, attrition, and general evolution in the letterforms (sometimes intentional, sometimes unintentional).\n\n-- Kent.\n\n"
    },
    {
      "time": "23 Nov 2008 — 4:03pm",
      "content": "Shrdlu:\n\nI promise not to mention Bembo, and on James’ behalf I issue an injunction to all other posters on this thread to avoid that subject also.\n\nI do not really have much to add to what charles\\_e and Kent have said. I do know anecdotally of one conversion of Centaur from metal to photo that at least started out going the right way. This photo-ization of Centaur was done from printed impressions of Monotype-set Centaur. The impressions were not done on the hard, non-absorbent coated stock known as “repro paper,” but were printed onto newsprint on a Vandercook proof press. Talk about “ink spread”! The idea was to incorporate that spread of ink into paper into the phototype source. So far so good. But then the publication that used the resulting type was itself printed on porous newsprint, so the type ended up being far too heavy, especially since it was set far too small.\n\nI am not so sure this is what Kent meant when he used the term “evolution,” since that term is generally used to refer to an improvement. Often debatable, I know.\n\n\\*\\*\\*  \nIf you cannot find “Monotype Recorder” articles about this, or Adobe specimen books, try this: search out recent books or magazines printed offset or gravure in faces designed for letterpress printing, then take a look at books printed during the heyday of letterpress in those same faces. Do your own analysis of differences in the typefaces, and inquire why you see them.\n\n\\*\\*\\*  \nHave you read Gerald Lange’s book “Printing digital type on the hand-operated flatbed cylinder press” (gotta love that “down” style in the book title: way to go, Lange!)?\n\nIf you go here:\n\n[http://www.bielerpressxi.blogspot.com/](http://web.archive.org/web/20131020192010/http:/www.bielerpressxi.blogspot.com/ \"http://www.bielerpressxi.blogspot.com/\")\n\nand scroll down you’ll find more about it and how to get it. I admit that I’ve not looked at it, but because I know Lange’s commitment to good work, and because it is one of a very few works you can read on this subject, I’d say it should be available in the libraries of all schools that teach book arts.\n\netaoin\n\n"
    },
    {
      "time": "24 Nov 2008 — 8:49am",
      "content": "Will, I guess I was actually being fairly Darwinistic in my use of the term \"evolution.\" I meant that there may have been adaptations to a given letterform -- perhaps due to technological constraints, perhaps due to some inadvertent error in copying, whatever. (You could even call them \"mutations.\") These adaptations may have been essential to survival in a new technological environment. Or a \"random mutation\" might just have gone unnoticed and so didn't have any immediately detrimental effect on sales, and thus the adaptation persisted. Either way, the results are what I call an \"evolution\" of the letterform(s). Not necessarily an improvement -- just part of survival through different environments, if you like.\n\nMy point is that for some faces, the question of whether they were digitized \"from actual impressions or the original drawings\" is overly simplistic. (Not meant as a criticism of the original poster.)\n\n-- Kent.\n\n"
    },
    {
      "time": "25 Dec 2008 — 10:46pm",
      "content": "Kent\n\nTake a look at this\n\n[http://bielerpressii.blogspot.com/2007/07/digital-type-foundries-respond...](http://web.archive.org/web/20131020192010/http:/bielerpressii.blogspot.com/2007/07/digital-type-foundries-respond-to.html \"http://bielerpressii.blogspot.com/2007/07/digital-type-foundries-respond-to.html\")\n\nIt's a tad old now but things in the digital type world haven't changed an awful in the last several years. Certainly not like the 1990s.\n\nGerald\n\n"
    },
    {
      "time": "27 Dec 2008 — 6:41pm",
      "content": "[http://bielerpressii.blogspot.com/2007/07/digital-type-foundries-respond](http://web.archive.org/web/20131020192010/http:/bielerpressii.blogspot.com/2007/07/digital-type-foundries-respond \"http://bielerpressii.blogspot.com/2007/07/digital-type-foundries-respond\")...\n\nFast glance says that Gerald's, as Gerald's observations often are, worthy of deeper thought than one may wish.\n\nIt is true that Monotype, (England) as opposed to Lanston (Monotype America) P22 chose different paths, paths not neccesarily of their own making. However they merged to meet again with distant conclusions. Gerald, the other Gerald not myself, has pointed out correctly that there is variances from metal to polymer no matter how hard one tries. Gerald, the other knows I pioneered polymer, owned Lanston, digitized directly from patterns, preserving as closely as \"we at Lanston could, which was, very, very close\" (15 thousand per cent more so than is possible with \"Type One Fonts, not to mention source material) the original letter forms, noting that this has met with criticism from those suffering from mind altering drugs. Barring lugubrious opinions, my work is worthy of new-review, Important, not embarrassing, and unfortunately for you, not possible.\n\nClosely I have not followed P22, trustfully they have at least preserved original data. The data was taken from patterns, the final form for mechanical typesetting. Different, sometimes more often than not, the abundance of direct human creations by cutting punches with the human hand/eye produced products without mechanical direction produced masterpieces. Re-read what I just said, view as a clue. Almost all is lost. I was not won over by Stanley Morrison's letters to Jan Van Krimpen. There fore you ar not lost. Unless you so choose.\n\nMy conclusion, as is yours is obvious, metal type is far different than digital than we would wish. Imitation, at this point without resources as I was greatly honoured, by owning the Lanston Library, could we say is, now legendary. And legendary as it is, was not, should we say, completely possible, but, I must part with you, beautiful.\n\nFinal note: optical scaling was offered by Lantston and American Type Foundery in type three format. This is not a foundry problem it is a format problem. Maybe you could take this issue up with John Hudson, Hrant certainly seems to have retired on this subject.\n\nIn any event, talk to your local format dealer!\n\nFinal final note: revisit, Frederic Goudy.\n\nGiampa\n\n"
    }
  ]
}
