{
  "id": "51997",
  "title": "Tightrope",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I've been working on a continuous line typeface with the geometry of a geometric sans. I like the flow of Morice produced by Letterbox, so I wonder if the glyphs I have constructed so far are too stiff. I'm not sure my characters follow a good standard of proportions. I wonder how difficult lowercase, numerals and special characters will be. I'm having a hard time envisioning how lowercase are going to work at this point (except for maybe a lowercase b and d - they  \ncould be based off of the P). Thanks in advance for your feedback.\n\nHere's a quick overview of my current concerns with each of the glyphs:\n\nA - Is the crossbar too low?  \nB - Does the lower bowl protrude too little or too much?  \nC - This is one of the few glyphs without a overlap. Do you think that  \nbreaks the system too much? I know that Cs, Os and other rounded glyphs  \nextend above the cap height and below the baseline a little, but I'm not  \nsure how far to extend them.  \nD - I'm not sure if the curves are constructed ideally.  \nE - This was the first glyph I constructed on the computer. I'm not sure  \nif the crossbar extends too far or too little.  \nF - Same concern with the F as the E. Should the F be based off of the  \nE?  \nG - I wonder if the top of the G is too flat. Should the G relate more  \nto the C? Or should the C relate more to the G?  \nH - Is the height of the crossbar too centered?  \nI - Should the I have an overlap?  \nJ - Does the J get too flat and geometric at the bottom?  \nK - The join around the crossbar seems kind of stiff  \nL - Should there be more contrast between the vertical and horizontal  \nstrokes  \nM - The M gets kind of messy and challenging. I wonder if a sideways E  \nwould be a good place to start?  \nN - Should I figure out the N before the M?  \nO - I wonder if I need some sort of overlap.  \nP - This is probably my favorite glyph. The P was the initial glyph that  \nI sketched. I wonder if the transition between the horizontal lines and  \nthe curves are too abrupt.  \nQ - This character just doesn't quite sit well with me. I would prefer  \nit be constructed as one continuous line.  \nR - Not sure I placed the right leg in the right spot.  \nT - I kind of just guessed on the width of the T.  \nU - I prefer to have an overlap of some sort. I wonder if the transition  \nbetween the vertical lines and the curves are too abrupt.  \nV - I am kind of bothered by the open bottom portion of the V.  \nW - Two Vs don't seem to create a very good W. I'm not sure where to  \nplace the intersection.  \nX - I haven't tried an X yet  \nY - The Y isn't a perfect continuous line. I feel the same way about the  \nY that I do about the Q. There must be a better solution.  \nZ - The Z doesn't really fit with the other glyphs. I'd like to explore some more options.\n\n| Attachment | Size |\n| --- | --- |\n| [TYcontinuousline.pdf](http://web.archive.org/web/20150417190646/http:/typophile.com/files/TYcontinuousline.pdf) | 417.75 KB |\n| [TYcontinuousline2.pdf](http://web.archive.org/web/20150417190646/http:/typophile.com/files/TYcontinuousline2.pdf) | 15 KB |\n\n",
  "author": "Ty Wilkins",
  "time": "22 Nov 2008 — 4:52pm",
  "uid": "2664",
  "comments": [
    {
      "time": "22 Nov 2008 — 8:40pm",
      "content": "This is great.\n\nA: no.  \nB: no.  \nC: I think no overlap is fine on some glyphs. Don't want to be too dogmatic with the gimmick. see Y.  \nD: they look fine to me.  \nE, F: crossbar is perfect.  \nG: the flat top is fine, but don't use one that flat on the C. The C could be a bit more open, though.  \nH: B, E, F, H, K, P and R should have the same crossbar height. Otherwise strings of text will look weird when those letters are next to each other.  \nI: a few with no overlap is fine, see C.  \nJ: no, it looks good.  \nK: no, it looks good.  \nL: no. Dude, the font looks good. Don't second guess every single letter. :)  \nM, N: Start from what you did with the V. Do them together... try different things until you find something that looks right.  \nO, Q: The first thing I noticed was not the lack of overlap in the C and the I but the fact that the O and Q are the only two glyphs with more than one continuous line. I think the O \\*should\\* have overlap... maybe at the top, or in the upper left, make the inside and outside strokes switch position. The Q should have a similar switch but incorporated into the crossbar. These are the two most problematic glyphs.  \nP: it's rad.  \nR: The diagonal foot should match the K, which it does. Looks good.  \nS: Do you have something against S? Like the O, I think the S should have an overlap, maybe in the center.  \nT: Width looks good.  \nU: I think this one is ok without an overlap too. The bowl should match the bottom half of the O.  \nV: Don't be bothered. It looks good. Copy it for the M and N.  \nW: I say copy the V, with more vertical diagonals. Or copy the M when you design it.  \nX: This one's going to be tough. :)  \nY: This looks bad. I think the Y could get away without any overlap, like the way the diagonals of the K come together. Or you could make it more lowercase looking, where the right diagonal descends in a straight line all the way to the bottom of the glyph. Then you could do an overlap like the one in the A.  \nZ: If you keep the V and make the M, N and W to match then the Z will fit just fine.\n\nThe lowercase b, d, p and q definitely should not just match the P. They should be more like a vertical with a lowercase o attached.\n\nIf you're stuck on some of the glyphs you might go and design the numbers. Doing a few more glyphs might get you more familiar with the pattern of the face and make the remaining letters more straightforward.\n\nThat's my $0.02, take it all with a grain of salt. Post another PDF when you get further, I'd like to see it.\n\n-matt\n\n"
    },
    {
      "time": "22 Nov 2008 — 11:50pm",
      "content": "Y is a three-way intersection, so it should be able to work just like the better glyphs. I'd say fold the upper right arm from a gap in the lower left. Also, the arms as you've designed it are rather thin.\n\nZ might look better if you keep the top fold but remove the bottom one, squaring that corner.\n\nFor my other suggestions, well, forgive me if I just draw them rather than try to put them into words.\n\n ![](http://web.archive.org/web/20150417190646im_/http:/typophile.com/files/qx_4141.png)\n\n"
    },
    {
      "time": "23 Nov 2008 — 5:58am",
      "content": "You are right - the Q needs more work\n\n"
    },
    {
      "time": "25 Nov 2008 — 11:54pm",
      "content": "Thanks Matt, Kevin and Bob for the feedback. I have added a few more characters. I still need to figure out a solution for the N and Q. I decided to round the corners to help facilitate the flow of the continuous line. I wonder if the V and Z are too angular. I think the Y is probably too narrow and maybe a few glyphs are too tall. What do you think of having the M and W as mirror images? I'm looking forward to your feedback. The new PDF is added to the first post. Thanks, TY\n\n"
    },
    {
      "time": "26 Nov 2008 — 1:01pm",
      "content": "I much prefer the right-angled corners of the first version, so I still like the V and Z. The M and W are great, and the X and Y much improved too. I'd like to see them, along with the previous version, with right-angled ends.\n\nI think the C and S should only have one cross-over... keep the cross-over at the tops. And the extra cross at the top of the G is overkill.\n\nI prefer the weird overlap in the J and G of the first version -- the second version's overlaps feel more formulaic and have less personality.\n\n"
    },
    {
      "time": "27 Nov 2008 — 6:23am",
      "content": "Maybe something like:\n\n ![](http://web.archive.org/web/20150417190646im_/http:/typophile.com/files/Qidea_4505.gif)\n\n"
    }
  ]
}
