{
  "id": "52",
  "title": "Fundamental",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "please review this site to view this new font;   \n [http://www.tipografia.cl/proyectos/proyecto\\_fundamental.htm](http://web.archive.org/web/20150414142654/http:/www.tipografia.cl/proyectos/proyecto_fundamental.htm)\n\n",
  "author": "Miguel Hernandez",
  "time": "28 Mar 2002 — 8:12am",
  "uid": "1109",
  "comments": [
    {
      "time": "28 Mar 2002 — 10:10am",
      "content": "Very fine font set! I like it, especially the LC characters m, n, s, & g.   \nThe UC Q looks strange but still legible. Perhaps the D and the upper part of the B looks too square, but it's rare to see bitmap fonts with a real style like this one.   \nGood luck distributing it!   \n   \nGreg.\n\n"
    },
    {
      "time": "29 Mar 2002 — 12:35am",
      "content": "Uppercase Q is strange but very nice. I like it but I think it may have legibility issues.\n\n"
    },
    {
      "time": "5 Apr 2002 — 11:38am",
      "content": "![fundamento.gif](http://web.archive.org/web/20150414142654im_/http:/www.typophile.com/forums/messages/29/1069.gif)\n\n"
    },
    {
      "time": "8 Apr 2002 — 2:40am",
      "content": "Great text block...not so sure about the lc 'w' - it seems too wide, but its a minor gripe.   \n   \nOverall, the most stylish 8 pt font I have ever seen.   \n   \nMatthew\n\n"
    },
    {
      "time": "8 Apr 2002 — 1:12pm",
      "content": "Hi Miguel. I have looked at this face with amazement since its post, so here is my critique. There is nothing that I can see that needs to change. I could sugggest a set of lining numerals to be added to an alternate version and perhaps the lc w is a bit wide, I can however not suggest a better way of doing it so leaving it might be best. The lc 'g\" is really nice, as well as the old style numerals. I would buy this. Ole\n\n"
    },
    {
      "time": "8 Apr 2002 — 1:36pm",
      "content": "As usual very nicely done.   \n   \nAt the risk of stating the obvious, you're   \ndeliberately using the limitations of the   \nmedium (straight lines, 45 degree diagonals)   \nto improve the design. (Especially referring to   \nthe curves of the m, n, s, w, g, and even the b   \nand q.)   \n   \nBravo.\n\n"
    },
    {
      "time": "10 Apr 2002 — 2:09pm",
      "content": "Thanks for the comments and this is only a part of a complete family character set whith many versions in all the ways that i can design.   \nThe idea is to distribuying the complete pack of fonts(9)   \nPlease tell me what you think, Typophilers?   \n   \nMiguel Hernández.   \n   \n   \n ![family.gif](http://web.archive.org/web/20150414142654im_/http:/www.typophile.com/forums/messages/29/1122.gif)\n\n"
    },
    {
      "time": "10 Apr 2002 — 2:23pm",
      "content": "I think it's stellar - consider asking money for it (if you haven't already).   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2002 — 3:04pm",
      "content": "Miguel - let me know as soon as it's available!\n\n"
    },
    {
      "time": "11 Apr 2002 — 7:34am",
      "content": "Please let me know if any of this alternative \"w´s\" is better than the original to reprace if it´s works well.   \n   \nMiguel   \n   \n ![new_w.gif](http://web.archive.org/web/20150414142654im_/http:/www.typophile.com/forums/messages/29/1133.gif)\n\n"
    },
    {
      "time": "11 Apr 2002 — 7:44am",
      "content": "To me, maybe the second, but definitely the third is better than the original.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Apr 2002 — 11:44am",
      "content": "I agree with Hrant. The second is more in line with the overall feeling of the font.   \n   \nMatthew Brown\n\n"
    },
    {
      "time": "22 Apr 2002 — 5:23pm",
      "content": "3... that's the magic number.\n\n"
    },
    {
      "time": "23 Mar 2003 — 5:39am",
      "content": "Hola Typophiles,   \n   \nHere is the new version of fundamental, please take a look, compare and decide if this example is more close to a final version, i need to launch this font soon so i will apreciate a lot your sugestions.   \n   \nThanks for your time,   \n   \nMH.   \n   \n   \n ![](http://web.archive.org/web/20150414142654im_/http:/www.typophile.com/forums/messages/29/7933.gif)\n\n"
    },
    {
      "time": "23 Mar 2003 — 3:43pm",
      "content": "Hi Miguel,   \n   \nFundamental is very fine pixeldesign   \nbut, I see with attention:   \n   \n- lc \"s\" (For me he seems strange. The   \nterminals are too short. In the minimental   \nhis is good!   \n   \n- lc \"t\" (The Cross Stroke is short. I think one   \npixel more.   \n   \n- up \"J\" (too wide for me)   \n   \n- up \"Q\" (I thought this tail could bigger, no?   \nI liked the old version, make it as alternative   \nopition. Cool ;D)   \n   \nPor enquanto\n\n"
    },
    {
      "time": "24 Mar 2003 — 12:35pm",
      "content": "Ok guys, here is the corrections in the same paragraph text as the old one, you can compare the color of the pagraph text, if is more readable or not, and of course the new ligatures that works on this version.   \nPlease Critique, thanks to Fabio Augusto ![:-)](http://web.archive.org/web/20150414142654im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nMH   \n   \n   \n  ![](http://web.archive.org/web/20150414142654im_/http:/www.typophile.com/forums/messages/29/7966.gif)\n\n"
    },
    {
      "time": "24 Mar 2003 — 2:16pm",
      "content": "Just as with your other work, fundamental is great! Is there any chance that Detroit 45 might be published as well?\n\n"
    },
    {
      "time": "9 Apr 2003 — 5:22pm",
      "content": "I'm blown away by how legible this is. and yet it's very characteristic as well. you seem to have a true grasp on pixels - how they infer letterforms, from the ground up. well done.   \n   \nthe only thing that I'm so sure of are the ligatures - even though they certainly are a nice touch.   \n   \nI want to see the italic version! I would buy this (assuming I have $$$ that month)   \n   \n- andrew\n\n"
    },
    {
      "time": "9 May 2003 — 4:00pm",
      "content": "looking again at it now i realise what a beautifull screen font this is. certainly one of my all-time screen fonts favorates.   \n   \nand congratulation on joining the atomic media team. i somehow missed that.\n\n"
    }
  ]
}
