{
  "id": "520",
  "title": "Super pixel fonts",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "fontsforflash.com and truthindesign.com are releasing something called \"super pixel fonts\".   \n   \nIs this \"revolutinary\" stuff? How are they built?\n\n",
  "author": "striker2",
  "time": "3 Jul 2003 — 2:02pm",
  "uid": "1580",
  "comments": [
    {
      "time": "10 Jul 2003 — 10:35pm",
      "content": "This is big...   \n   \nBut why would they not come out as nice in Photoshop, for example?   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jul 2003 — 8:00am",
      "content": "Interesting... Thanks!   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jul 2003 — 9:54pm",
      "content": "| It could have something to do with the way   \n| FFF expands the outlines slighty to prevent   \n| filled-in counters in Flash.   \n   \nIt is due to expanded outlines. Flash renders characters on the left glyph margin, but Photoshop will include glyph spillover, if any. Most FFF fonts include these optimizations for the Flash renderer. However, they are not part of the Super Pixel technique. The newest Super Pixel font 'Halogen' is trimmed to the margin instead and does not blur in Photoshop or Flash. (it does lighten a little in Dynamic vs. Static mode in Flash, see image below)   \n   \nThe second poster was right, the technique adds hand-antialiasing to pixel fonts without all that dangerous mucking about with hinting.   \n ![Business & Halogen in Flash & Photoshop](http://web.archive.org/web/20131011113957im_/http:/www.typophile.com/forums/messages/4101/12951.gif)\n\n"
    },
    {
      "time": "18 Jul 2003 — 12:48pm",
      "content": "What accounts for the differences in Halogen and Business?   \nIs one better than the other (I mean technologically)?   \n   \nHalogen's Photoshop output is much better, but what's the reason for its variability in Flash (Static/Dynamic)?   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jul 2003 — 12:52pm",
      "content": "The font would look fine in Photoshop if you set anti aliasing to \"none\" wouldn't it? Or did I miss something?\n\n"
    },
    {
      "time": "18 Jul 2003 — 12:59pm",
      "content": "Nevermind. Obviously it needs to be anti-aliased.\n\n"
    },
    {
      "time": "18 Jul 2003 — 2:13pm",
      "content": "What is the formula to make them in fog or fontlab?   \n   \n Bitfonter 2 have to come with this function?   \n   \nWhat if i need to use this font in a color background?   \n   \ncan i use super pixel fonts at 200%?\n\n"
    },
    {
      "time": "18 Jul 2003 — 5:04pm",
      "content": "Hrant, Garf,   \n   \nAntialiasing must be turned on, unless you're in Flash with a dynamic text field. In that case, the operating system itself draws the text. So I get the following results. Notice that at low quality, Halogen and Business lose their grey pixels, but Halogen retains them in the dynamic text field. In every example, dynamic is lighter than static, because it's being rendered by Windows 2000 with basic font smoothing (circa 95 plus pack). The black block is a difference filter between Medium and Best quality - no difference.   \n   \n ![Super Pixel Fonts in low quality, static and dynamic text](http://web.archive.org/web/20131011113957im_/http:/www.typophile.com/forums/messages/4101/13105.gif)   \n   \nBusiness and Halogen were built differently - Walter Apai of FFF designed Business after seeing my prototype super pixel fonts. Walter improved the use of the technique visually, and I improved the technical side. About a month after Business came out, I released Halogen, using a further refined technical approach. FFF has access to the full \"Super Pixel Fonts\"\n\n"
    },
    {
      "time": "18 Jul 2003 — 9:15pm",
      "content": "Christopher, thanks for the elaboration.   \n   \n\\> When our patent is complete   \n   \nI'm no lawyer, but I think what's called \"Prior Art\" might prevent your patent from actually holding up in court.   \nIn fact off-hand I can think of three cases of such \"Prior Art\" that might qualify, but I can't be sure.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jul 2003 — 12:57pm",
      "content": "Question:   \nIs there a difference between Flash5 versus MX in using Business and/or Halogen?   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jul 2003 — 1:29pm",
      "content": "Hi Hrant, I know you're interested in hand antialiasing. I hope you will consider releasing a Super Pixel font through FFF.   \n   \nPrior art: that may be. I've found potential cases but none are in the Flash+TrueType+unhinted sandbox.   \n   \nThere should be no difference between Business and Halogen output in MX vs. Flash 5 or 4. Has anyone tried 3 or 2 format? These also have antialiased rendering for embedded glyphs.   \n   \n-chris\n\n"
    },
    {
      "time": "19 Jul 2003 — 3:47pm",
      "content": "Yes, I've been working on an \"immersive on-screen reading\" font called Mana on and off since '98...   \nI've even managed to \"deliver\" it through some funky CGI scripting: make each letter a tiny GIF and convert ASCII text to an image stream... :-/ But the raw HTML code size was prohibitive for long texts.   \n   \nHere's a snippet:   \n ![mana.gif](http://web.archive.org/web/20131011113957im_/http:/www.typophile.com/forums/messages/4101/13119.gif)   \n   \nI actually contacted FFF, but they said the amount I expected for my design didn't make sense for their business.   \n   \nWhat about through you guys?   \n   \nI can always go solo, but having a high profile home would help Mana's sales a lot.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jul 2003 — 4:00pm",
      "content": "BTW:   \n\\> These also have antialiased rendering for embedded glyphs.   \n   \nI don't get this part.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jul 2003 — 5:58pm",
      "content": "\\> \\> These also have antialiased rendering for embedded glyphs.   \n   \n\\> I don't get this part.   \n\\> hhp   \n   \nI meant to say, each version of Flash down to the original FutureSplash uses antialiasing. When a font is decomposed into geometry for display as static text, it will be antialiased. So, it's likely that very old versions of Flash will support Super Pixel Fonts.   \n   \nBTW, I like Mana. TiD's not yet set up to sell fonts though. Mana's grey fringing is far more refined than typical ClearType output. I would further lighten pointed forms like the crux of the y.   \n   \np.s. what is a 'juvenile' or 'kiddie' letter y?   \n   \n-chris\n\n"
    },
    {
      "time": "19 Jul 2003 — 6:17pm",
      "content": "\\> what is a 'juvenile' or 'kiddie' letter y?   \n   \nBasically where the body is a \"u\", not a \"v\".   \nOr like a \"u\"+\"j\" ligature without the dot. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jul 2003 — 7:33pm",
      "content": "I dont want to be rude but..if anyone can build an alternative method to make grey dots on vectors on a font, why buy a patent to Truth? A friend tell me an alternative method so i am making pixel fonts with greys too.   \n   \nM.\n\n"
    },
    {
      "time": "30 Jul 2003 — 7:41pm",
      "content": "Well, I don't think it's rude. But I don't get what you mean by \"buy a patent to Truth\". Do you mean: Why would somebody pay a licensing fee to Truth for the \"technology\"? Who knows. Maybe to avoid a lawsuit (even if it wouldn't hold up in court), or maybe to avoid the trouble of figuring it out? Remember what Christopher said about the process being technically pretty tricky - and I believe him.   \n   \n\\> i am making pixel fonts with greys too.   \n   \nOh yeah?!... Hey, me too! :-) What PPEM size is yours?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jul 2003 — 8:00pm",
      "content": "I mean that, thank you Hrant.I am beginning to experiment with the method, is pretty tricky i know. But i hope that is not the same of Truth, but i works! i hope that others can do the same now to make this technology free for all. If anyone knows an alternative method, please post your comments here, Thanks.   \n   \nM.\n\n"
    },
    {
      "time": "30 Jul 2003 — 8:05pm",
      "content": "Hi Miguel, Hrant,   \n   \nThis is not a rude question and it comes up a lot. The generic name for greyscale pixel font methods is \"sub-pixel fonts\".   \n   \n\"Super Pixel fonts\" describes a patent pending technique which provides reliable rendering on all TrueType environments. Your grey dot fonts will probably be great (disclaimer, I love your fonts) but they won't be \"Super Pixel fonts\" unless you license with us and build them like we do. Hrant is right, it takes more than sub-pixels.   \n   \nIn many countries, It is still legal to protect a method even if you are not a rich corporation. A patent holder is not obligated to extort and coerce, only to assert ownership. We hope to do this right.   \n   \n-chris\n\n"
    },
    {
      "time": "30 Jul 2003 — 9:13pm",
      "content": "btw Miguel, how do you get Circa to show up with white and black components here: [http://www.atomicmedia.net/font.php?font\\_name=Circa](http://web.archive.org/web/20131011113957/http:/www.atomicmedia.net/font.php?font_name=Circa)   \n   \nis there a 'fills' as well as a 'forms' variant?   \n   \n-c\n\n"
    },
    {
      "time": "31 Jul 2003 — 9:41am",
      "content": "It is not necesary if you know how to use the path tools on illustrator or freehand, then just paint. Make a variant version of CIRCA for this is unnecesary.   \n   \nM.\n\n"
    },
    {
      "time": "13 Sep 2003 — 9:05pm",
      "content": "Hand Antialiasing Explanation,   \n   \n [http://www.airwindows.com/inventions/HAFonts.html](http://web.archive.org/web/20131011113957/http:/www.airwindows.com/inventions/HAFonts.html)   \n   \n   \nPost your comments,   \n   \nmh.\n\n"
    },
    {
      "time": "13 Sep 2003 — 10:36pm",
      "content": "I like it.   \n   \nThere were not a lot of 48 point bitmap fonts available for MacPaint so I made a few by doubling a 24 point font and smoothing it out in ResEdit in much the same way.   \n   \nA similar method was actually applied by the Apple LaserWriter when printing 72 dpi images (from MacPaint) - a mechanical, but competent, interpolation up to 300 dpi. I think some paint software was capable of the trick as well.   \n   \nI do not agree that his scheme's \"errors and inaccuracies would likely be insignificant\". No scheme is the equal of the eye, reader or typographer. But it's a big step up from nothing. the author of SmoothType should try it out as a rendering option. This would help old designs keep up with antialiased outline fonts.   \n   \n-chris\n\n"
    },
    {
      "time": "14 Sep 2003 — 1:30pm",
      "content": "Miguel, I remember seeing that page a while back. But Christopher is right: there's no way a mechanical method can match hand crafting, especially in delicate glyphs such as a humanist binocular lc \"g\" at 10 pixels high.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Sep 2003 — 12:03pm",
      "content": "yes we use fontographer, why?\n\n"
    },
    {
      "time": "20 Sep 2003 — 1:00pm",
      "content": "I have used Fontographer a lot since the old days of outline Mac fonts. It's great, but FontLab is better. Pixel fonts can be really tweaky to make (cutting counterforms, pixel snap, etc) and FontLab does a lot of it for you. I haven't tried the Mac version, apparently it's better.\n\n"
    },
    {
      "time": "21 Sep 2003 — 3:31am",
      "content": "So fontlab is better than Fontographer when creating pixel fonts?   \nDo people create the fonts in PS and then import in Fontographer?\n\n"
    },
    {
      "time": "21 Sep 2003 — 1:28pm",
      "content": "\\> So fontlab is better than Fontographer when creating pixel fonts?   \n   \nNow that FlashFonter (Pixelator? :-) is coming up, definitely.   \n   \n\\> Do people create the fonts in PS and then import in Fontographer?   \n   \nActually, as a rule people who use both Fog and FontLab go the other way (and only because they've become comfortable with the former's interface, especially when it comes to drawing).   \n   \nhhp\n\n"
    },
    {
      "time": "21 Sep 2003 — 2:27pm",
      "content": "Hey Darryl   \n   \nBitFonter is built for the job. PixFont also makes pixel fonts. It's touchy, incomplete, and inexpensive. (Neither can create sub-pixel fonts)   \n   \nYou may be able to cut and paste from Photoshop into Fontographer, but I couldn't. I switch between PS and FL and copy by eye.\n\n"
    },
    {
      "time": "21 Sep 2003 — 2:38pm",
      "content": "HHP: you mean people who are comfortable in Fontographer draw there first, then test in Photoshop?   \n   \nI'm lost in indefinite articles\n\n"
    },
    {
      "time": "21 Sep 2003 — 2:48pm",
      "content": "No, they create in Fontographer, then move to FontLab to polish and export.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Sep 2003 — 5:29pm",
      "content": "Fog lets you create Outline and Bitmaps on 50% less price than Fontlab or Bitfonter.   \n   \nIn my opinon,Flashfonter is NOT an application like Fontastic or Fog. Is a small app who lets you open fonts from your system and export a .VFB file on a pixel grid vector, thats it. The other is a pluging for fonlab, to draw those pixels as vector.   \n   \nI believe that pixelfonts deserve a $99 app like Typetool, no way to pay $500 to buy bitfonter or fontlab if you can do the same ob fog, you guys from Fontlab are on the time to build something like this. A Pixeltool 1.0 for $99 makes a sound for all who build pixelfonts.   \n   \nmh.\n\n"
    },
    {
      "time": "21 Sep 2003 — 8:26pm",
      "content": "Hrant, I think by \"PS\" Darryl means Photoshop, not Postscript. (Darryl, most people on Typophile probably think \"Postscript\" when they see \"PS.\")   \n   \nSome people do the design work in Photoshop, then produce the font in FOG or FL. I've never used this method, so I don't know what's involved. I use BitFonter for the design stage and then import the resulting bitmap font into FOG where it can be traced.\n\n"
    },
    {
      "time": "23 Sep 2003 — 3:58pm",
      "content": "Just curious...   \n   \nFontsforflash is not exactly 'innovating' here -- just marketing. adding smaller pixels to a bitmap to control smoothing isn't a new thing, though I'd have a hard time coming up with good examples of 'prior art'. What does this mean for the supposed 'patent'?   \n   \nI'm a major patent opponent in the tech field. If you look at what tech patents have done to stagnate progress... meh. ick.\n\n"
    },
    {
      "time": "23 Sep 2003 — 4:05pm",
      "content": "\\> adding smaller pixels to a bitmap to control smoothing isn't a new thing   \n   \nWho did it before? No name, no game.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Sep 2003 — 3:06am",
      "content": "AFAIK, nobody did. The idea of using an outline font to produce one font size is asinine. If not for pixel fonts, I would have been stringing together grayscale bitmaps like Hrant did with Mana.   \n   \nBut they were there and I figured you could 'fraktur' them to get gray. Did I mention the level of gray is different in every rasterizer? And every user asks me if they can use it at 12 point as well as 8? Sorry, no - It's a hack!   \n   \nIt's not a software patent. There's no software, just technique. (as we all know at this point)\n\n"
    },
    {
      "time": "24 Sep 2003 — 3:15am",
      "content": "Apologies to Rob who said \"tech\" not \"software\". Considering I said \"technique\", his last point stands pretty strong.   \n   \nBut I disagree that it's not innovation. Six months ago you couldn't get sharp antialiased text in Flash, now you can, provided you can find the point size you want.   \n   \nI'm sure Macromedia will innovate me right out of the market by next year. Look for it!\n\n"
    },
    {
      "time": "25 Sep 2003 — 2:35am",
      "content": "Chris take a look here [http://www.pixietype.com/news.html](http://web.archive.org/web/20131011113957/http:/www.pixietype.com/news.html)   \nThis pretty much looks like super pixel fonts.\n\n"
    },
    {
      "time": "25 Sep 2003 — 7:40am",
      "content": "Chris ive been to many blogs/forums. I've always noticed people saying that FFF introduces Super Pixel Fonts. But never Truth In Design. Why?   \n   \nAlso one more Question..   \n   \nare these super pixel fonts made in Fontlab or Fontographer?\n\n"
    },
    {
      "time": "25 Sep 2003 — 10:24am",
      "content": "Joseph is correct. We chose a partner with big marketing and credibility in pixel fonts. Flash designers feared grey smudging, so only FFF could offer something with grey pixels that could be trusted. TiD is known only in the Pocket PC and Flash arenas, so we are more or less invisible.   \n   \nPixieType's PixelFX appeared a month after Super Pixel Fonts. It looks like they're using our method. I can't speak to PixelFX' compatibility, different subpixel styles yield different results.   \n   \nWe use a lot of tools, including some in-house tricks. FOG is great, FontLab's better at the moment.\n\n"
    },
    {
      "time": "25 Sep 2003 — 2:44pm",
      "content": "\\>only FFF could offer something with grey pixels that could be trusted..   \n   \nsorry but flash mx 2004 dont have the filled bug, so anyone can buid trusted pixel fonts that works...   \n   \nAbout the misterious wathever name of greys.., they can EASYLY make on the old good fog, of course is abouth math, and 25% - like mini magic pixel on every grey angle   \n   \nI thinks there is no exclusive licence technique when every one can buy fog or fontlab and making such effects. In two months all the pixel font designers will be using it.   \n   \nNow, back to the essential think..   \nQuality and talent on type design, that could be trusted, thats credibility, and a niche on the market.   \n   \nKeep on the good work pixel pals,   \n   \nmh.\n\n"
    },
    {
      "time": "25 Sep 2003 — 11:44pm",
      "content": "mh said:   \n\\> flash mx 2004 dont have the filled bug,   \n\\> so anyone can buid trusted pixel fonts that works...   \n   \ngood to know. I meant to say, people come to FFF for clean, non-smudging fonts. And now, apparently, for Flash 4/5/6 compatibility.   \n   \n\\> I thinks there is no exclusive licence   \n\\> technique when every one can buy fog or   \n\\> fontlab and making such effects.   \n   \nEveryone can buy MSVC and write their own GFX apps too, but if they put tabbed palettes in the UI, Adobe can sue them. Look Miguel, we are not going to stop microfoundries from making \"super subpixel misterious FX wahtever name of MX greys font fonts\". But if you start selling a lot of them, dont be surprised if at some point we ask you for 5% of the price. Unless you were doing it a year ago and got it notarized. But you weren't, you did it cause I did it. Get a time machine. I've got one, how do you think I invent these things.   \n   \n\\> In two months all the pixel font designers   \n\\> will be using it.   \n   \nI know. I am really, really happy about this. I knew you all would make brillant work with it. Hitting you up for a piece of the action is the hard part. It could have been HP, Apple, or some godawful \"patent holding company\" controlling this thing. It's just me and my little company Miguel, and we freaking love you. Be glad.   \n   \n\\> Keep on the good work pixel pals,   \n\\> mh.   \n   \nYou too. See if you can beat me to the next idea, I got 2 more.   \n-c\n\n"
    },
    {
      "time": "26 Sep 2003 — 12:59am",
      "content": "\\> See if you can beat me to the next idea, I got 2 more.   \n   \nThats not the idea. You guys are the first in the market doing that vector greys, you are.   \n   \nBut legally, this point of get a patent of a trick, i really dont know if it could be compared with other stuff, you got Coca cola first, pixietype do pepsi maybe? i really dont know.   \n   \nI dont know if pixietype or others or myself, have to pay a 5 %. I think that whe are talking about 50% at less, i dont know if Truth or FFF can hit pixietype for 5%.   \n   \nmh.\n\n"
    },
    {
      "time": "26 Sep 2003 — 1:51am",
      "content": "So is atomic media comming up wih something?\n\n"
    },
    {
      "time": "26 Sep 2003 — 2:12am",
      "content": "Miguel could you tell me how you do sub pixel rendering in FoG?   \n   \nI got some wiked fonts here which hunger for it ![:-)](http://web.archive.org/web/20131011113957im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "26 Sep 2003 — 2:30am",
      "content": "hunger for Pepsi or Coke?   \n   \nStill testing, but you have to do a math opetation, control the blur that images produce on a vector is not to hard to understand on numbers. You have to try on your fab font edit app.   \n   \nI am shure that you could do your own stuff too there in India...   \n   \n   \nmh.\n\n"
    },
    {
      "time": "26 Sep 2003 — 2:50am",
      "content": "I used to like Pepsi better, it does not have a sticky aftertaste. Now I drink imitation Coke. maybe there is a conflict? dang it Miguel I'm staritng to mimic you .   \n   \n\\> I dont know if pixietype or others or myself,   \n\\> have to pay a 5 %. I think that whe are   \n\\> talking about 50% at less, i dont know if Truth   \n\\> or FFF can hit pixietype for 5%.   \n   \nI surrender no rights. ;)   \n   \nDarryl - if you don't know how to do it at this point - you did not read this page. Lazy man! Read it again!   \n   \nGo ahead and tell him the Pepsi way. I've been thinking about this for 6 months now, Pepsi has to catch up.   \n   \nYou people, I swear.   \nxoxo, -c\n\n"
    },
    {
      "time": "26 Sep 2003 — 8:00am",
      "content": "Are you sure about the No Rights Part?   \n   \n   \nAtomic media has a lot of potential to become bigger than FFF.\n\n"
    },
    {
      "time": "26 Sep 2003 — 8:06am",
      "content": "\\>I am shure that you could do your own stuff too there in India...   \n   \nSure its a free country.\n\n"
    },
    {
      "time": "26 Sep 2003 — 8:12am",
      "content": "Ohhhh and Chris I do know how the method works but it just doesnt seem to be working yet. You could be bit more nicer when you speak to me.\n\n"
    }
  ]
}
