{
  "id": "52015",
  "title": "The Purpose of CV Writing",
  "forum": "NancyBaker's blog",
  "tags": [

  ],
  "content": "CV writing is integral in every person’s dream of climbing the corporate ladder, getting that dream job, or applying for a research grant. A CV ( [Curriculum Vitae](http://web.archive.org/web/20090608094915/http:/www.whatisacv.com/)) summarizes a person’s achievements, life and work history, and skills related to the position applied to.\n\nMany are confused with a resume and _curriculum vitae_. Although individuals use both documents for application processes, the length and purpose of writing one of these vary. Resume writing limits only to one to two pages with bulleted and summarized personal, academic, and professional information. On the other hand, CV writing requires two to three pages of document, with expounded description of one’s achievement.\n\nCVs represent one’s accomplishments in detail. It is vital that the individual writes this document with good quality so the employer or academic committee will accept the application. In CV writing, the individual is like writing an advertisement in a form of a narrative document. The said document is like a brochure that informs target consumers and then persuades them to purchase a product or utilize a service.\n\nCV writing helps an individual promote himself or herself by literally describing one’s possessed skills. Nowadays, companies and educational institutions not only look for a person’s EQ, IQ, and educational background. They also look out for work experiences, social activities, grants, publications (if any) and active memberships as well.\n\nSimilar to resume writing, CV writing also includes an individual’s personal information so companies and institutions applied to can immediately call him or her for a scheduled meeting or interview.\n\nRemember, CV writing also requires the applicant’s goal and objective. If the applicant targets to apply to a different company with the same industry, the he or she must highlight those reasons. If the applicant wants to qualify for a position in the same company, he or she must write the CV in a convincing way. Finally, if the individual has nil background in the industry, he or she must present skills and experiences that can be applied in the vacant position.\n\nA CV is like a long personal essay describing one’s self. Similar to resume writing, CV writing also includes an individual’s personal information so companies and institutions applied to can immediately call him or her for a schedule meeting or interview.\n\nRemember, CV writing also requires the applicant’s goal and objective. If the applicant targets to apply to a different company with the same industry or to qualify for a position in the same company, then he or she must highlight those valid reasons. If the individual has nil background in the industry, then he or she must present skills and experiences that can be applied in the vacant position.\n\n**MY PROFILE  \nNancy Baker** is a Recruitment Officer working for the [Human Resources](http://web.archive.org/web/20090608094915/http:/en.wikipedia.org/wiki/Human_resources) Department of an Oil Company. With almost a decade of recruitment experience, Nancy regularly shares [CV writing](http://web.archive.org/web/20090608094915/http:/www.resumesplanet.com/) tips in her blogger account. An animal lover, she now has four dogs, two cats, and two rabbits.\n\n",
  "author": "<a href=\"/web/20090608094915/http://typophile.com/user/39899\" title=\"View user profile.\">NancyBaker</a>",
  "time": "<br>",
  "uid": "39899",
  "comments": [
    {
      "time": " 23.Nov.2008 7.45pm",
      "content": "She had me at 2 rabbits!\n\nMichael\n\n"
    }
  ]
}
