{
  "id": "52024",
  "title": "Help with swash - men's fashion stylist logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello everybody!\n\nMy client is a fashion stylist and runs a (stylish) men's clothes boutique.\n\nFor the logo I've settled on the Versailles Bold typeface but I felt the caps with their sharp serifs could be sweetened with a swash of the \"y\". Also, the swash would imitate a signature, in my mind.\n\nNow I'm not a type designer and I shouldn't probably play with things I don't quite grasp.\n\nI'm very curious about what you think.\n\n| Attachment | Size |\n| --- | --- |\n| [logo.png](http://web.archive.org/web/20150414225844/http:/typophile.com/files/logo_7.png) | 60.42 KB |\n| [swash.png](http://web.archive.org/web/20150414225844/http:/typophile.com/files/swash_0.png) | 136.43 KB |\n\n",
  "author": "Boros",
  "time": "24 Nov 2008 — 8:20am",
  "uid": "37779",
  "comments": [
    {
      "time": "24 Nov 2008 — 11:11am",
      "content": "I tried to insert the images in the message, but it didn't work.\n\n"
    },
    {
      "time": "24 Nov 2008 — 2:07pm",
      "content": "The swash for the y needs lots of work...\n\nVersailles looks similar to Luxury from House Industry.\n\n"
    },
    {
      "time": "24 Nov 2008 — 3:07pm",
      "content": "I love the \"R\" in Luxury Diamond\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/luxuryR_5594.jpg)\n\nIt reminds me of Prada's \"R\".\n\nThank you for answering, Fabulous. Please, give me some hints about what is there to be done. Is the loop too tight? Is the diagonal too thick? Is the whole thing completely bogus and I need to start all over again? How much liberty can one take when creating a swash? What are the rules?\n\nI am a self-thought graphic designer and I never took typography classes. It may sound silly, bu here's what I reasoned when drawing the swash: I imagined holding a broad pen in my hand and drawing the \"y\" with the flourish. The diagonal of the swash parallel with the stem in the y should end up being of the same visual thickness. Other than that, I figured the whole thing should look harmonious (the length of the descender + the swash I tried to balance with the rest of the uppercase letters).\n\nI know that professionally speaking I should let someone who actually draws type do this thing, but I'm passionate about typography and I aspire to understand the upper crust of its mysteries.\n\nI hope I did not offend anybody. I'm not looking for a quick tutorial, I want to understand what would be some basic guidelines in creating this swash.\n\n"
    },
    {
      "time": "24 Nov 2008 — 3:44pm",
      "content": " ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/logo_7_5464.png)\n  \n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/swash_0_5699.png)\n\nI've managed to place the images now. From my home computer the Internet seems to be more forgiving.\n\n"
    },
    {
      "time": "24 Nov 2008 — 4:11pm",
      "content": "kinda looks like a deflated baloon or a dying leaf or something at the moment.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20150414225844/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20150414225844/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "24 Nov 2008 — 4:31pm",
      "content": "You don't want those straight parallel lines in that tail. Better yet, get a broad-nibbed pen and do some real-life experimentation with shapes.\n\n"
    },
    {
      "time": "24 Nov 2008 — 5:29pm",
      "content": "Thank you both for your thoughts. I hope this post is amusing rather than revolting.\n\nEliason, I think I know what you mean. I'll try sketching. Beware!\n\n"
    },
    {
      "time": "27 Nov 2008 — 1:18am",
      "content": "Hi Boros!\n\nWell, I’m certainly not qualified to teach you much about calligraphy nor drawing. However, if you did try drawing this y, even just a little—even if you have bad penmanship then you can get a better feel for how the loop is supposed to behave. Script and swashes are elevated forms of our human writing.\n\nI’m really not much help, but I for sure like your concept thus far.\n\nMikey :-)\n\n"
    },
    {
      "time": "27 Nov 2008 — 2:09am",
      "content": "hi boros ... i grabbed two recent examples that i've done (right two) and simulated something quickly in illustrator (left). Maybe these will be helpful.\n\nbest suggestion is to NOT drop the loop down, just across.\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/y_4597.png)\n\ntypically, you want to match the stress of your roman, if it has one.\n\nperhaps you could scrap the roman 'by' and try italic forms?\n\nalso, there's a great opportunity to use a loopy/swashy tail (bottom horiz. stem) on your Z to add some Zest. Maybe a tail on your R/\n\ngood luck\n\n"
    },
    {
      "time": "27 Nov 2008 — 5:50am",
      "content": "Y would probably benefit from lowering the descender and then making the swash more \"flowy\"...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "27 Nov 2008 — 8:42am",
      "content": "Thanky you! Indeed, trying to draw the swash with a fountain pen revealed more natural shapes than what I had in my mind.\n\nAs an added bonus, the results also filled the space below the \"b\".\n\nHere's what I settled on. This one seems to me more \"alive\", although I'm not sure if it isn't a bit too sharp. Or if the loop reads like a \"v\".\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/logosharpswash_3796.jpg)\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/sharpswash_4052.jpg)\n\nA loopier one, like the ones in Beejay's beautiful drawings, may also seem to be a good idea, but I need to work on this one:\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/logo%20roundswash_3621.jpg)\n\nAs for setting the \"by\" in cursive italics, I'm not sure, although maybe a sans serif \"by\" would do the trick here. Here's a very lame version with Avenir Medium Oblique for \"by\". Why not?\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/sansseriflogo_6686.jpg)\n\n----\n\nI'm afraid to start working on the R and the Z, as Beejay suggested. First of all, I couldn't do it, second I think it would crowd things a little for this heavy face. It would probably work with a lighter one, though.\n\n----\n\nThank you again. I kind of like the first version, the one with the sharp swash. What do you think?\n\n"
    },
    {
      "time": "27 Nov 2008 — 10:30am",
      "content": "The first of the last three here is the one that looks the best to my eyes. Everything is consistent.\n\n"
    },
    {
      "time": "27 Nov 2008 — 10:34am",
      "content": "I like the first version too!!!\n\n"
    },
    {
      "time": "27 Nov 2008 — 1:02pm",
      "content": "the first one looks great!\n\nnice job\n\n"
    },
    {
      "time": "27 Nov 2008 — 1:05pm",
      "content": "have you thought about connecting the tail of the Y to the A ?\n\nit's almost connecting already and might really make everything sing\n\n"
    },
    {
      "time": "27 Nov 2008 — 5:46pm",
      "content": "the tail of the _y_ could form the crossbar of the _a_? It's worth a try, I wonder how it would look!\n\n"
    },
    {
      "time": "28 Nov 2008 — 12:53am",
      "content": "I tried that first thing, but I didn't quite like it. I'll post a pic a liitle later.\n\n"
    },
    {
      "time": "28 Nov 2008 — 4:03am",
      "content": "Here it is, with the swash joined with the crossbar of the \"A\".\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/joined_5907.jpg)\n\nI had to make the straight line thicker, to match the weight of the crossbar. I feel it's a little dull like this. Also, the line is now too close to the bowl of the \"b\" (wich is a problem at small sizes) and I'd have to make the \"by\" a few points smaller to have some extra space in between, wich I don't want (it would also make it more difficult to read at small sizes).\n\nThis is a version I like more:\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/better_5137.jpg)\n\nBut I still feel the first disconnected one is better.\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/logosharpswash_5770.jpg)\n\nHere they are, smaller:\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/3%20examples_5570.jpg)\n\nMy vote goes for the original. You guys are really great!\n\n"
    },
    {
      "time": "28 Nov 2008 — 7:06am",
      "content": "Agree, the original is best.  \nMy eye wants the \"by\" to be a little lower, and the thin downstroke of the y looks too thin. Actually, I think you need a different font as a starting point for \"by\", as beejay suggested above. A more pen-written, italic form, that has the same kind of thick/thin patterns your tail has.\n\n"
    },
    {
      "time": "28 Nov 2008 — 8:13am",
      "content": "to my the _x-height_ of the **by** is just a smidgen higher than the _cap-height_ of the **Adina**.\n\nI like the joined better version, or the middle of the three bog ones is the best, just nudge the _by_ down a bit and see how it works!\n\nLooks good! Nice work. I have worked in fashionable clothing retail in the past and still have an interest in mens fashion. This seems like a mark you'd expect to see as a tag in a fashionable blazer.\n\nfor not considering yourself a type designer I think you really hit on something good here. Looks like you've got an intuitive typgraphic sense, you ought to develop it if you enjoy this at all!\n\n"
    },
    {
      "time": "28 Nov 2008 — 1:44pm",
      "content": "Physically, the top of the \"y\" is aligned with the top of the \"A\", if I understood correctly what eliason and innovati suggested. But it may not be a thing of mathematics here, and now that you told me, the \"by\" seems to me also to be a bit high. I'll do some tests tomorrow at work that follow your suggestion.\n\neliason and beejay I think you're asking too much from me. I will look in my archive for italic forms and test them with the swash. For amusement I will try drawing the \"by\" myself, although I'm certain I couldn't do a better job than what I ended up with here (+ minor tweaks). I feel that this swash is a sensitive area in the whole concept. Maybe contrast added by a different typeface than Versailles would be very welcomed here. I am still afraid, though, about one thing: Versailles is a pretty complicated typeface (to my eyes) and adding another detailed face next to it might be too much. If the main font would be a sans serif, a swashy italic form for the \"by\" would surely look sweet, I think.\n\nBut as I've learned in my short time here, rationalizing may not lead to the best results. So enough talking - on to testing.\n\ninnovati, your thoughts are very encouraging. I enjoy this more than I can say.\n\n"
    },
    {
      "time": "29 Nov 2008 — 10:57am",
      "content": "Haven't read every word of the thread, but... in those last couple versions, you are drawing WAY to much attention to the \"by\". This is the least important word in your logo and is drawing the most attention. I could actually see it working better without the \"by\" in it all together. Just come up with some other way to separate \"trends\" and the name.\n\n[www.cotdamn.com](http://web.archive.org/web/20150414225844/http:/www.cotdamn.com/ \"www.cotdamn.com\")\n\n"
    },
    {
      "time": "2 Dec 2008 — 2:55am",
      "content": "Here's a quick and almost accidental one from the Coke side of life, in Palatino:\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/westerswash_3433.jpg)\n\nIt is not in the right direction - I find it has a western saloon feel (besides the Cola flavor), but I like it. The point is that I think beejay and eliason were right about the italic forms - they go better with swashes. But they also seem to be more feminine and a little bit too much for my concept. Maybe cotdamn is right and I shouldn't emphasize the \"by\" so as not to overwhelm the important stuff.\n\nAnyway, the \"Original\" with the sharp signature-like swash is still the best to me.\n\nI'll have to think about it more and do some more tests, but right now things are pretty crowded at the office. Cheers!\n\n"
    },
    {
      "time": "8 Dec 2008 — 3:06am",
      "content": "Alright, this is the version close to completion. The \"by\" is now set in Versailles Black, like the rest and the swash is therefore thicker than before. I tried various italic writings for \"by\", but, as cotdamn intuited, another font draws too much attention to the preposition, or maybe I'm not skilled enough to make it work.\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/final%20version_5109.jpg)\n\nHere it is, smaller:\n\n ![](http://web.archive.org/web/20150414225844im_/http:/typophile.com/files/final%20version%20lo%20res_4295.jpg)\n\nFeel free to share any thoughts. Thank you, everybody!\n\n"
    },
    {
      "time": "8 Dec 2008 — 5:48am",
      "content": "It's a really tricky one - when I looked at this recent one I felt it was a bit of a step back due to the swash not lining up with the crossbar on the 'A'. Having reviewed it alongside the earlier versions though, I think you're right about it 'integrating' better.\n\nRegardless, I think it's very well done, and I don't think you should be in any way worried about your skill level. Great work.\n\nTake care, Andi\n\n[[semibad](http://web.archive.org/web/20150414225844/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": "8 Dec 2008 — 11:17am",
      "content": "Thanks, Andi! I'm glad you like it!\n\n"
    }
  ]
}
