{
  "id": "52058",
  "title": "Typeface for a school book",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi there, I'm sure this matter has been raised before, but I'd like to share some thoughts about it. I'm planning a book for a primary school; it's about the local history of our town, and it should help the kids (age 6-10) in knowning its main historical facts, the public characters, the old jobs, etc. It will be filled with pictures, drawings and illustrations, and will feature exercises too - eg, the young readers will have to answer questions and fill the empty spaces provided in the pages. Now, one of the main thing here of course is the choice of typeface. The first typefaces I have thought about are, for obviuos reason:\n\n- Sassoon Primary  \n- Century Schoolbook (ATF)\n\nWhich are very different indeed. Sasson seems a natural choice but I'm wondering if Century Schoolbook could work as well. I'd also like to discuss some other choices.\n\nPS The book will be probably set in two colums, with text flush-left, set at about 12 points with no hyphenation.\n\n",
  "author": "ncaleffi",
  "time": "25 Nov 2008 — 2:58am",
  "uid": "23726",
  "comments": [
    {
      "time": "25 Nov 2008 — 8:17am",
      "content": "Hi\n\nsome time ago I read about a new typeface over at Fontsmith  \n [http://www.fontsmith.com/news.php](http://web.archive.org/web/20130216011550/http:/www.fontsmith.com/news.php \"http://www.fontsmith.com/news.php\")  \nfor exactly this purpose. You might also wanna try ff schulbuch  \n [http://www.myfonts.com/search?search[text]=schulbuch](http://web.archive.org/web/20130216011550/http:/www.myfonts.com/search?search%5Btext%5D=schulbuch)\n\nOr you want to read this articles;  \n [http://www.fonts.com/AboutFonts/Articles/SituationalTypography/Typograph...](http://web.archive.org/web/20130216011550/http:/www.fonts.com/AboutFonts/Articles/SituationalTypography/Typography+for+Children.htm \"http://www.fonts.com/AboutFonts/Articles/SituationalTypography/Typography+for+Children.htm\") and this  \n [http://www.kidstype.org/The%20project/Testing%20typography/Typefaces/typ...](http://web.archive.org/web/20130216011550/http:/www.kidstype.org/The%20project/Testing%20typography/Typefaces/typefaces.html \"http://www.kidstype.org/The%20project/Testing%20typography/Typefaces/typefaces.html\")\n\n"
    },
    {
      "time": "25 Nov 2008 — 8:51am",
      "content": "I don't want to sound ignorant here, but wouldn't the best typeface for a children's book just be a very legible and clear face?\n\nI mean, helvetica is clear and has a large x-height which I think would help young eyes recognize familiar shapes. I'm certainly no helvetica evangelist, but it's just the most obvious for my argument.\n\nAlso, there is a school of thought that would lean towards serifed faces, in which case wouldn't a slab serif be legible?\n\nI wonder if, like talking baby-talk to a baby can prolong its actual understanding of language, I wonder if novelty fonts that adults recognize but require more experience and intelligence to read could make it impossible for a child to read?\n\nI had a look at the ones you suggested here and they do look good, I'm just wondering.\n\n"
    },
    {
      "time": "25 Nov 2008 — 11:55am",
      "content": "Evidence indicates that around age 10 kids start moving from: reading individual letters and compiling them into words; to directly reading multi-letter clusters. The latter benefits from serifs; the former does not benefit, and might very well suffer from serifs.\n\nIt's useful here to distinguish between learning to read versus reading to learn. So if you're teaching 8-10 year olds to read [better], you might want to use serifs; but if your main purpose is to allow 6-10 year olds to read about something as easily as possible, I would avoid serifs. It's not that most kids simply freeze when they see a serifed letter of course, it's that some will become frustrated (without necessarily even realizing it). By the same token, ideally you would use a looser font with a large x-height, at a somewhat large point size (although those approaching 10 might be held back by such typography).\n\nThat said, there are about 2 million\\* choices that would be better than Helvetica. For one thing, this book is about your town, which is in northern Italy today, not in Switzerland 50 years ago. Issues of legibility and readability do not preclude cultural considerations.\n\n\\* Well, OK, not 2 million. More like 2000.\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2008 — 2:12pm",
      "content": "_Evidence indicates that around age 10 kids start moving from: reading individual letters and compiling them into words; to directly reading multi-letter clusters. The latter benefits from serifs; the former does not benefit, and might very well suffer from serifs._\n\nWhat is the evidence for this? I haven’t seen anything that would suggest this is true. I believe that once children learn to decode words (have phonemic awareness and understand the spelling to sound correspondences) that there are few changes to the reading process. People become more efficient readers the more time they spend reading. This continues throughout one’s life, not just in childhood.\n\nCheers, Kevin\n\n"
    },
    {
      "time": "26 Nov 2008 — 3:30pm",
      "content": "\\> What is the evidence for this?\n\nI've seen two sources that concluded that age 10 was the average of this shift. One I forget (I can find it if you... pay me? :-) the other is \"Legibility in Children's Books\", Watts and Nisbett, 1974.\n\nWhatever the age is, I believe there must be a shift at some point, because I believe adults can read blurry clusters of letters (otherwise they would have no trouble reading long novels in sans, but THEY DO HAVE TROUBLE). The only way there wouldn't be a shift is if adults read by compiling letters into words, as young children do (if more efficiently). You know what I think of that theory.\n\nDon't underestimate puberty. :-)\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2008 — 5:22am",
      "content": "I am unfamiliar with Watts & Nisbett, though look forward to reading it eventually. What evidence to they provide that supports your point?\n\nThe typical understanding is that brain structures become less capable of changing at puberty. The brain is incredibly malleable at birth, but reaches critical windows for learning, where learning becomes more difficult afterwards. For example before the age of 5, learning a new language is nearly effortless. Learning a new language after 5 but before puberty is harder, but it’s very likely that you’ll learn to speak it without an accent. Learning a new language after puberty is certainly still possible, but more difficult, and few will sound like native speakers. I wouldn’t expect any brain organization to change at puberty, such as a change in reading mechanisms. If there was a change I would expect to find a drop in reading speed at this time while adapting to the new reading technique (perhaps you would expect a sudden increase?), but reading speed gradually increases during primary school, high school, and all the way through college. A long gradual increase sounds to me like improving a single reading technique with years of practice.\n\n"
    },
    {
      "time": "28 Nov 2008 — 10:16am",
      "content": "Watts and Nisbett was a long time ago for me! Sadly I'm not the organized professional scientist that you are. I [have to] rely more on the nebulous aggregate impression of all the things I've read and processed. This makes it harder for me to formally convince people (well, at least Westerners), but I feel it also makes my conclusions more likely to lead to practical improvement. For example there seems to be no room for anecdotal evidence in your method; it's as if it never existed. The stance that \"serifs cannot help reading because my model of reading says they can't\" is not what I call Science. Doubt is the catalyst.\n\nPuberty: what I've read does not match what you state. My belief is that puberty is not the end of a phase, it is itself a period of pronounced transition from one phase to another. Many parents almost don't recognize the behavior of their children when they enter puberty! And when they come out they're not who they were before. Many things change in the brain, and I include reading strategy in that. Simply put, puberty is a transition from learning to doing. Learning the letters, to reading text. Not the same thing.\n\n\\> A long gradual increase sounds to me like improving  \n\\> a single reading technique with years of practice.\n\nIt's strange to think that the human brain must be so one-dimensional and clunky. In my reading model (using the term loosely) there is a gradual introduction of the \"adult\" reading strategy\\*, applied in a way as to avoid a performance drop. The brain being obsessed with efficiency, it refuses to suffer a drop in performance. And in order to do this it gradually moves from letterwise decipherment to immersive reading (picking up blurry clusters of letters). So bouma reading replaces letterwise reading to the extent that the former is ready to take on the responsibility. And it never replaces it fully, because letterwise reading still makes more sense in the fovea. This last bit is what your field testing is picking up; but it's failing to pick up immersion. When it comes to reading, good field testing is very very very hard. It's like Huey said. And he knew what he was up against even though he was a century behind us not because of some study he read, but because he had good instincts. We are not robots, and scientists who try to think like robots are just wasting time/money.\n\n\\* Which gets better over time all the way into senility because the brain gets increasingly assured in taking guesses at boumas, through increased exposure to real, contextual boumas in text. It starts getting better at guessing at increasingly blurry (deeper into the parafovea) and low-frequency boumas.\n\nThis transition from full-letterwise to mostly-bouma reading is sort of like a really good automatic transmission in a car: your speed does not drop when upshifting, without you doing or thinking anything consciously different. It's a somewhat complex trick, and the brain is much more complex.\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2008 — 1:36pm",
      "content": "A serif typeface would be appropriate for a history book.  \nSome children, those, for instance, who are interested in history books, might appreciate the allusion.\n\nIn the days when all children's books were set in serif type, rates of literacy were higher than now.  \nCoincidence?  \nCould it be that we have been dumbing down children's literature in recent years, with negative results?  \n(Or is it just TV that's to blame?)\n\n[http://www.coldtype.net/Assets.08/pdfs/1108.Reader31.pdf](http://web.archive.org/web/20130216011550/http:/www.coldtype.net/Assets.08/pdfs/1108.Reader31.pdf \"http://www.coldtype.net/Assets.08/pdfs/1108.Reader31.pdf\")\n\nA page from a book of my father's, when he was 6-10, in the 1930s:\n\n ![](http://web.archive.org/web/20130216011550im_/http:/typophile.com/files/Kings_5325.jpg)\n\n"
    },
    {
      "time": "28 Nov 2008 — 1:51pm",
      "content": "Dyslectic and pseudo-dyslectic kids need clues to discern some glyphs from look-a-likes and it is quite evident that serifs help in this.  \nIn a sans the d, p, q and b are essentially identical forms, whereas the serifs in the same glyphs of a serifed face help with the orientation and ‘reading’. Whether mirrored, or upside down, a serif d is hard to mix up with a serif p.\n\nWhich leads to this conclusion:  \nIf the choice is between Century Schoolbook and Sassoon Primary: Century is a more distinct typeface. Use that.\n\nOn a side note: Sassoon P was intended to help in the process of learning to write, not so much in the process of learning to read. And there have been done tests that indicate that starting to learn reading with ALL CAPS only texts is the best way to do this. Caps differ more from each other than lower case glyphs. But we are talking four and five year olds now. Your target audience is probably a bit older…\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "28 Nov 2008 — 2:23pm",
      "content": "<cite>Sassoon P was intended to help in the process of learning to write, not so much in the process of learning to read. </cite>\n\nSorry, that’s not quite correct.\n\n<cite>The Sassoon Primary project started as research with children, asking them what features of letters and spacing they liked best and what was easiest for them to read. The findings are reported in Computers<br>\nand Typography (Sassoon 1993) published by Intellect. […] The original Sassoon Primary Type was a typeface<br>\ndesigned with children and for children to replace the type they read. […] Educational publishers were quick to recognise the usefulness of a typeface that could represent handwriting yet not be a strict model.</cite>  \n— from: [Dr. Rosemary Sassoon & Adrian Williams: Why Sassoon?](http://web.archive.org/web/20130216011550/http:/www.clubtype.co.uk/fonts/sas/sassoonfonts.html)\n\nThere is the Typographic Design for Children Project at the University of Reading: [kidstype.org](http://web.archive.org/web/20130216011550/http:/www.kidstype.org/)  \nAnd a related thread: [Type for kids](http://web.archive.org/web/20130216011550/http:/typophile.com/node/14206)  \nF\n\n"
    },
    {
      "time": "28 Nov 2008 — 5:57pm",
      "content": "\\> Coincidence?\n\nNick, you're sounding like a US tabloid...  \nEven if I agree that serifs help (starting from maybe  \naround age 8) you're giving our craft too much credit.\n\nhhp\n\n"
    }
  ]
}
