{
  "id": "52083",
  "title": "What category would you classify Meta, Scala, and Thesis?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I know there are many classification systems for fonts,  \nbut in all of them, I really could not place contemporary  \nfonts like [Meta](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/FF%20Meta), [Scala](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/FF%20Scala), and [Thesis](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/Thesis).\n\nI was wondering where people place these fonts, using  \nwhichever of the classificatory systems they use; or name,  \ndefine a class or category in which we can place these  \ntypefaces.\n\n",
  "author": "richard_a",
  "time": "25 Nov 2008 — 9:02pm",
  "uid": "21094",
  "comments": [
    {
      "time": "25 Nov 2008 — 10:04pm",
      "content": "Scala and Thesis would in common parlance be called humanist sans-serifs. Meta is a bit colder, farther away from handwriting, but it would be a contemporary sans.\n\n"
    },
    {
      "time": "25 Nov 2008 — 10:38pm",
      "content": "I can agree on calling the Thesis family as humanist;  \nbut I feel Scala is a bit more deliberate. Meta of course  \nis much colder than both. Is there any other name that  \none can give to \"contemporary sans\"?\n\n"
    },
    {
      "time": "25 Nov 2008 — 10:51pm",
      "content": "hmmm - how does 'really nice' sound for a classification?\n\n"
    },
    {
      "time": "26 Nov 2008 — 12:57am",
      "content": "Because Meta is the first of its kind and sparked many more like it, I call it after its designer: a [Spiekersans](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/Spiekersans).\n\n"
    },
    {
      "time": "26 Nov 2008 — 1:10am",
      "content": "First, all of them are [superfamilies](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/Superfamily).  \nThere is a classification scheme by [Wolfgang Beinert](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/Wolfgang%20Beinert), which takes those multi-style suites into consideration: the [Matrix Beinert](http://web.archive.org/web/20140901111217/http:/www.typolexikon.de/m/matrix-beinert-schriftklassifikation.html). See #4: ‘Corporate Typography Fonts’, with subsections ‘Dual type systems [Corporate Fonts Serif/Sans Serif]’ and ‘Triple type systems [Corporate Fonts Serif/Sans Serif/Slab Serif]’.  \nF\n\n"
    },
    {
      "time": "26 Nov 2008 — 1:12am",
      "content": "why do you need a more specific genre than something like contemporary humanist sans-serif? anything more than that and you're getting into serious hair-slitting territory.\n\n"
    },
    {
      "time": "26 Nov 2008 — 3:16am",
      "content": "using my favorite classification scheme, these all fall into the category of 'fonts that don't suck'. the only other category in this scheme is, of course, 'fonts that suck'.\n\n"
    },
    {
      "time": "26 Nov 2008 — 7:14pm",
      "content": "Types with two-syllable names.\n\n"
    },
    {
      "time": "26 Nov 2008 — 7:23pm",
      "content": "@john - that made me laugh! it's so true!\n\n"
    },
    {
      "time": "26 Nov 2008 — 7:30pm",
      "content": "<cite>why do you need a more specific genre than something like contemporary humanist sans-serif?</cite>\n\nBecause \"contemporary\" only describes when the thing was made, rather than any defining characteristic of the design. It also has the same problem as describing something as \"modern\" as they both refer to the time period of \"now\", and when now becomes then, what do we have left to call things in the next now?\n\n"
    },
    {
      "time": "27 Nov 2008 — 4:52am",
      "content": "_when now becomes then, what do we have left to call things in the next now?_\n\nPostcontemporary?\n\n"
    },
    {
      "time": "27 Nov 2008 — 1:09pm",
      "content": "How about: low contrast translation typefaces?\n\n"
    },
    {
      "time": "29 Nov 2008 — 11:21am",
      "content": "@john - What would come after Postcontemporary, Postpostcontemporary? And then the ones after that would be Postpostpostcontemporary?\n\nLike sometimes I still wonder what came after postmodernism. I am not so sure if it was postpostmodernism.\n\nWouldn’t it be simpler to classify according to their date of birth. I was looking more at classification based on forms. A historical classification is quite accurate and easy to construct; but I don’t think it as useful as a form based one.\n\n"
    },
    {
      "time": "29 Nov 2008 — 11:34am",
      "content": "I was joking about 'postcontemporary'.\n\n_Like sometimes I still wonder what came after postmodernism._\n\nNeo-Eclecticism.\n\n"
    },
    {
      "time": "29 Nov 2008 — 2:10pm",
      "content": "<cite>Scala and Thesis would in common parlance be called humanist sans-serifs</cite>\n\nI've always felt that Scala was a serif font that had a companion sans. I think of TheSans and TheSerif as equals.\n\nAnd tongue not quite fully in cheek, I'd say that postmodernism falls into Paul's category of \"things that suck.\" As for what's following, \"still sucking.\"\n\n"
    },
    {
      "time": "29 Nov 2008 — 2:32pm",
      "content": "The thing is — classifications are necessary to explain to people who do not know, what they should know. People who are into type know exactly what kind of type Meta (and so on) is.\n\nClassifications are BS.\n\nBut if you really want to explain, go literary, eg:\n\nMeta is a staunch and worklike typeface, that has a sense of irony — it walks around with curling lips, because it knows it is superior to — for instance — Helvetica; lovely to the people that it meets on the paper or on the screen; a welcome guest to a party, the guy who tells the funniest jokes. Meta is your friend when communication skills are needed, and maybe the one that gets you off the hook when you are stopped for speeding.\n\nTry this with other typefaces…\n\nCheers!  \n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "29 Nov 2008 — 3:46pm",
      "content": "Hannes, are Meta, Scala and Thesis really translation-based?\n\nFor Meta at least, I would have said expansion-based. Humanist is often used with sans serifs to indicate there is modulation in the strokes, but historically humanist is associated with translation, and expansion with neoclassicism and romanticism. Among sans serifs, I think only Today is truly based on translation, and Legato, though not based on translation, but a clever derivative of expansion, is a low contrast serifless face that approaches the condition of translation.\n\nThe sans serif version of Scala has to be a derivative of the serif version, which came first. The serif version is, to me at least, a post-modern derivative of the expansion-based egyptiennes, with a nod in some places to the stroke modulation characteristic of translation. I use post-modern here in Robert Bringhurst's sense, as elaborated in 7.2.11 of the original edition of _The Elements of Typographical Style_.\n\nA word of caution though. Hrant has said he thinks my analysis of Legato is hopelessly contorted. He might think this of my analysis of Scala as well.\n\n"
    },
    {
      "time": "30 Nov 2008 — 5:24am",
      "content": "To add to my post just above, what characterizes Thesis is it's strong reliance on a 'returning' construction model. This can be seen, for instance, in the b and p and q and d. The bowl tops come out of the stems as if an up-stroke was being used. There is a hint of this in Scala but there it's not nearly as marked. I think in its serif structure Thesis reveals itself as a post-modern mix as well.\n\n"
    },
    {
      "time": "30 Nov 2008 — 8:54am",
      "content": "I said, above, about the b and p and q and d. The bowl tops come out of the stems as if an up-stroke was being used.\n\nThat's not really accurate. It's true for the bowl tops of the b and p, but the bowl bottoms of the q and d flow into the stems as if and up-stroke is being used. The returning construction model is invoked in all four, but it works out differently in each pair.\n\n"
    },
    {
      "time": "30 Nov 2008 — 11:59am",
      "content": "_Meta is the first of its kind._\n\nWhat about Quay Sans?\n\n"
    },
    {
      "time": "30 Nov 2008 — 12:36pm",
      "content": "Hmm, maybe. But to be frank and perhaps off-topic, Quay just [really isn't that great](http://web.archive.org/web/20140901111217/http:/www.flickr.com/photos/stewf/310121006/). I think of it more as a mangled Frutiger.\n\n"
    },
    {
      "time": "30 Nov 2008 — 1:16pm",
      "content": "Bringhurst puts the ancestry of Meta as being in Goudy Sans. Meta is narrower and more simplified, but I think you can see some inspiration there.\n\n"
    },
    {
      "time": "7 Dec 2008 — 4:14pm",
      "content": "William could you please tell me the source, where Bringhurst puts the ancestry of Meta as being in Goudy Sans?\n\n"
    },
    {
      "time": "7 Dec 2008 — 5:24pm",
      "content": "Bringhurst makes the comment that Goudy Sans is the \"spiritual father\" of Meta and Officina on p. 242 of the edition I have, which is the second edition. It is within a comment on Goudy Sans. I don't know what Spiekermann says about it.\n\n"
    },
    {
      "time": "7 Dec 2008 — 6:06pm",
      "content": "Everything created since 1989 can be categorized as Post-Retro-Futurism, so why don't we leave it at that.\n\n"
    },
    {
      "time": "7 Dec 2008 — 6:08pm",
      "content": "And anyone who takes Bringhurst seriously should have their head examined.\n\n"
    },
    {
      "time": "7 Dec 2008 — 6:31pm",
      "content": "The bent stem top on the mnr, and the general humanist proportions of Goudy Sans bear some resemblance to Meta. Meta is narrower and different in very many ways, but I don't know of anybody before Goudy that did that kind of thing. So it could be one inspiration.\n\nI'd like Spiekermann to declare Bringhurst totally wrong. Then I'll get my head examined :)\n\n"
    },
    {
      "time": "7 Dec 2008 — 6:33pm",
      "content": "James: Why? [to both your posts] Peter\n\n"
    },
    {
      "time": "7 Dec 2008 — 11:34pm",
      "content": "Quay Sans was released in 1990, five years after Meta was designed and three years after the story of its making was published in Baseline magazine. We used Meta for our design studio (whence the name) a few years before it was released as a FontFont in 1991. It wasn’t the first time David Quay was ”inspired” by another typeface – ask Neville Brody.\n\nThen again, we are all influenced by what happens around us. I designed Meta because we could not find anything that was suitable for setting forms and other printed material for the German Post Office (Bundespost). I analyzed 10 faces, among them News Gothic because it was narrow, Helvetica because it was a standard, Syntax because it was a fresh alternative to all the boring geometric sans faces, and Letter Gothic because it had solved issues of surviving on bad paper with bad printing. That is where the bent-out top strokes come from. I had not understood Noordzijs theories of expansion or translation and I didn’t know what a humanist sans was either. I simply looked at the problem in hand and drew some letters that had squarish counters to create contrast, robust and open shapes, was about 12 percent narrower than Helvetica, had narrow caps (German uses a lot of them) and used little devices to avoid filling in at small sizes on bad paper.\n\nI feel that Meta is quite warm. That is partly due to the fact that there are lots of details which add noise at small sizes and that Meta was designed over a period of time, with many designers adding bits of the family after I designed the first two weights in 1985. It is actually quite messy, which some people call charming. Thesis, on the other hand, is 110 percent perfect.\n\n"
    },
    {
      "time": "7 Dec 2008 — 11:50pm",
      "content": "thanks erik!\n\nhow do you feel about the goudy sans assertion?\n\n"
    },
    {
      "time": "8 Dec 2008 — 12:36am",
      "content": "_how do you feel about the goudy sans assertion?_  \nI was not aware of Goudy Sans until ITC brought out the revival, some time in the late 80s. Goudy Sans shares a few traits with Meta, but comes from a totally different approach. Bringhurst obviously only looked at it, but didn’t go any deeper.\n\n"
    },
    {
      "time": "8 Dec 2008 — 1:47pm",
      "content": "Ok, so I need my head examined. I tend to take everybody too seriously. On the other hand I don't believe those I take seriously, but I try to check out what they say and find out the truth. Only a partial excuse, I admit.\n\nSo whom should I seek out for therapy? Certainly not dyspeptic Brooklynites. They can never find anything good to say about anybody. Maybe Mario Feliciano, the sunny Portuguese and wonderful type designer. Yeah, next conference I'll try to find him and see if he can cure me :)\n\nOn the issue of the value of the Noordzij style analysis of the 'stroke'. Personally, I take this very seriously :) I do find it very helpful when designing to think how I am modifying the stroke in relation to what a pen would do.\n\nStill, I think it is of limited use in understanding the design of faces beginning in the 19th century, and especially now. Erik says his constraints were his brief of a font useful for the post office, and his looking a ten different fonts--for different reasons. The solution incorporated elements from these other fonts, plus his own idea about more square, open counters. So the bent stem didn't come from a pen stroke, but rather from another font. Admittedly it is conceivable that that other font may have been inspired by Goudy, who spent the first part of his career lettering. But still the most of his considerations about width, weights, shapes and proportions had more to do with the brief and his ideas about what would work, rather than what a pen would do or not do.\n\nIn other words, most of the story is not about the stroke, but other things.\n\n"
    },
    {
      "time": "8 Dec 2008 — 3:19pm",
      "content": "Bill, Erik story is a micro-narrative about his process. Noordzij's story is a macro-narrative about what happens to the stroke in writing and then in type. Noordzij's analysis are designed to place Eriks actions within a larger coherent narrative of type design, even though Noordzij's analytic constructs didn't play an active role in Erik decisions.\n\nI'd be interested to know, Erik, what other six faces you analyzed.\n\n"
    },
    {
      "time": "10 Dec 2008 — 3:10pm",
      "content": "I think describing Goudy Sans as ‘spiritual father’ of Meta and Officina is a fair comment, and one that doesn't imply any direct connection between them or influence of Goudy Sans on the design of Meta or Officina. It implies that they share the same spirit or, in more prosaic terms, the designs involve some of the same ideas and hence, some similar shapes and treatments.\n\n"
    },
    {
      "time": "14 Oct 2009 — 8:37pm",
      "content": "It’s been 9 months, but I want to revive this thread with a return to the original question. My current favorite term for these faces is _neo-humanist_. Maybe lame, but I like it because [FF Meta](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/FF%20Meta) and [TheSans](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/Thesis) are humanist typefaces, yet they belong in a monolinear, contemporary class of their own, just like Helvetica and its friends deserve the [neo-grotesque](http://web.archive.org/web/20140901111217/http:/typophile.com/wiki/neo-grotesque) tag.\n\n"
    },
    {
      "time": "14 Oct 2009 — 9:32pm",
      "content": "<cite>…just like Helvetica and its friends deserve the neo-grotesque tag.</cite>\n\nThe more I look at old type, the more I think Nick Shinn is right: neo-grotesque is a BS term. Letterform designs in the neogrotesques was not especially new, most of the ideas can be spotted in designs decades older. What really stands out about the neogrotesques is the planning of Universe as a large family with one head designer, and that’s not something that constitutes a stylistic break. I’m going to say the same of Meta and TheSans: what really makes them so much different from Frutiger, Syntax, and Stone Sans that they need to be deemed neohumanists?\n\n"
    },
    {
      "time": "14 Oct 2009 — 10:45pm",
      "content": "And, what are you going to do with the _next_ generation, once you give the \"neo\" tag to the current one? :-\\>\n\n"
    },
    {
      "time": "15 Oct 2009 — 2:13am",
      "content": "_what are you going to do with the next generation?_\n\npost-neo\n\n"
    },
    {
      "time": "15 Oct 2009 — 5:58am",
      "content": "<cite>what are you going to do with the next generation?</cite>\n\nor \"Next\" ;-)\n\n"
    }
  ]
}
