{
  "id": "52087",
  "title": "Typographic Sins",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am a 3rd year degree student currently undertaking a typographic brief based around the seven deadly sins.\n\nI was just wondering if anybody could give me an opinion on what they consider to be the worst sins committed  \nin typography today?\n\nI would be grateful if anybody can help me out\n\ncheers!\n\n",
  "author": "Phil T",
  "time": "26 Nov 2008 — 1:41am",
  "uid": "37718",
  "comments": [
    {
      "time": "26 Nov 2008 — 3:20am",
      "content": "For starters…\n\n- Stretching the type (horizontally or vertically).\n- Trying to fake a heavier weight by stroking the outline.\n- Justifying text in a way that results in huge gaps in between words (and thus, rivers are formed).\n\n- — - — - — - — - — - — - — -  \nWill food for type.\n\n"
    },
    {
      "time": "26 Nov 2008 — 3:27am",
      "content": "not using the proper quotation marks/apostrophe. however, as with all sins there are always exceptions to the rule. for example: [_To Squoosh™, or Not to Squoosh™?_](http://web.archive.org/web/20130216003603/http:/www.pilcrowtype.com/blog/archives/6)\n\n"
    },
    {
      "time": "26 Nov 2008 — 4:38am",
      "content": "[Crimes against typopgraphy](http://web.archive.org/web/20130216003603/http:/www.papress.com/thinkingwithtype/resources/crimes_scale.htm)\n\n"
    },
    {
      "time": "26 Nov 2008 — 4:45am",
      "content": "letterspacing blackletter\n\n"
    },
    {
      "time": "26 Nov 2008 — 5:21am",
      "content": "Having your head inserted in a dark place and spinning off theories about good and bad typography.\n\n"
    },
    {
      "time": "28 Nov 2008 — 7:58am",
      "content": "My typography teacher would say: \"don't hurt the type\" meaning not to stretch the type, and people did throughout my entire college course.\n\nI would have to say things that 9/10 times don't work for beginners are:\n\n**Modifying glyphs** for logos, unless you can really get inside of the typeface and work it from the inside-out\n\n**Stretching type** , it always looks...stretched. Much better to invest in condensed or extended weights\n\n**Type on a busy background** or a background without adequate contrast make it illegible. Happens way way too much\n\n**Using Novelty Fonts in the wrong context** can lead to disaster. Comic Sans and Papyrus are the easiest targets, but I think I will slaughter whoever typesets something in _Bleeding Cowboys_ or another _DaFont.com special_ next.\n\n**Script Fonts** don't replace real script. It's _so_ hard to set script fonts convincingly or even decently unless you invest in a professional font family with plenty of alternate characters and swashes. And then it takes a preposterous amount of time to tweak and finesse the words individually. And then you still run the risk of it being hard to read, or virtually illegible to a non-english speaker who may not have extensive recognition capability of hand-written latin characters.\n\n**Reversed type** with poorly sized coloured boxes behind them. As I understand it we value the top half of a letterform more then the bottom, so anything that would diminish the recognition of the top of a character would diminish the legibility of that character. If you're going to put a box behind it and make it white, make sure you have enough of a box so it's still readable.\n\n**FULL CAPS** are always the wrong answer. Small caps are like a beautiful little kitten when handled well, full caps are like a dog who has chased a muskrat through a ditch and then wants to cuddle with you.\n\n**_creative_ punctuation** or lack of it see if you enjoy reading this sentence but guess what its not just one I actually ran a bunch of sentences together here I am so avantgarde or whatever because I dont use periods\n\nYou're not going to change the world or appear creative and 'cool' because you ignored all normal conventions for writing english (or whatever you may be writing), no, you'll look like a fool.\n\n**Using hyphens everywhere** looks bad. There are times for en-dashes –, and em-dashes —, and hypens -; learn their proper context and don't just use the hyphen for everything.\n\n**Not using ligatures** makes your work worth less than the paper it's printed on.\n\n**U sing Microsoft W ord or P owerP oint F or Anything** leads to horrible kerning and it's no acceptable for presentations, resumes, or pretty much anything other than draft versions or spellchecking work. If you need to do a presentation, I think every designer has the tools to make a PDF, and you can kern your letters like a real man/woman! I hate seeing people who _ought_ to have type sensitivity (like my typography teacher) using powerpoint and think it's okay because that's just the standard of quality powerpoint does. Dont' settle for inferiour product, because you're lowering your standards, and then other lower their respect of you to those same standards.\n\nThere's my little rant about the type-related sins that make me annoyed. It's hard sitting in a room full of 40 designers and being one of maybe 5 who actually care enough about typography to open up a glyphs palette, or figure out what these _Small Caps_ things are. Type is communication, and improper type is improper communication.\n\n"
    },
    {
      "time": "28 Nov 2008 — 8:30am",
      "content": "Reading the rules of typography in textbooks and assuming that they’re always right.\n\n"
    },
    {
      "time": "28 Nov 2008 — 9:05am",
      "content": "\\>FULL CAPS are always the wrong answer\n\nWhat if you're Stanley Morison, or Bruce Rogers,  \nor even Aldus Manutius?\n\n"
    },
    {
      "time": "29 Nov 2008 — 6:54am",
      "content": "There are too many… :=)\n\n"
    }
  ]
}
