{
  "id": "52099",
  "title": "logo design",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi\n\nwould you tell me your opinion about my works?  \nThese are my \"homeworks\" and maybe i'll use them in my musicbusiness, at least in the \"real world\" too.\n\n| Attachment | Size |\n| --- | --- |\n| [vani02.jpg](http://web.archive.org/web/20130216005328/http:/typophile.com/files/vani02.jpg) | 12.72 KB |\n| [vani01[1].jpg](http://web.archive.org/web/20130216005328/http:/typophile.com/files/vani01%5B1%5D.jpg) | 12.9 KB |\n\n",
  "author": "vanessapoka",
  "time": "26 Nov 2008 — 8:32am",
  "uid": "40049",
  "comments": [
    {
      "time": "26 Nov 2008 — 8:55am",
      "content": "I think you may need to repost the images smaller. Right now they are ginormous.\n\n"
    },
    {
      "time": "26 Nov 2008 — 9:28am",
      "content": "thx  \nthese are smaller.  \nlike it?\n\n"
    },
    {
      "time": "26 Nov 2008 — 9:47am",
      "content": "I think now they're a bit small to be able to see the detail.\n\n"
    },
    {
      "time": "26 Nov 2008 — 10:07am",
      "content": "Oh for god'sake, there's no pleesing some peeple. Ignore this grumbling person Vanessa.\n\nHello Vanessa and welcome to Typophile.\n\nI like the purple one with the circle and the putti (cherub), but you cood do more with the type there, and add a few small details, like a shadow or something coming off the putti. Also the size of the putti may be a bit large relative to the circle. Making him smaller will add refinement and give it a more polished look.\n\nThe script logo in cyan is nice but kinda neither here nor there, if you know wot I mean. The squiggly line around \"Vani\" doesn't look like anything specific so I presume it is abstract but I'm not clear on wot it represents, so that may have a mystifying effect on spectators, leaving them scratching their heads.\n\nKeep working on the purple one with the putti. Good potential there.\n\nj a m e s\n\n"
    },
    {
      "time": "26 Nov 2008 — 10:33am",
      "content": "I prefer the green script Vani in the circle. The colour needs to be rethought and refining the visual elements a bit more. The small line at the bottom of the circle looks out of place. The cherub on the other hand means nothing to me.\n\n@James: I believe it's supposed to be the end of a guitar.\n\n"
    },
    {
      "time": "26 Nov 2008 — 12:24pm",
      "content": "ooh, I don't know who these are for (I assume they are for you?) and I don't know what you are trying to communicate with them, but I'll tell you my impressions of both of them, so maybe those will help you see whether or not they are working\n\n**Green one**\n\nI get: music, almost a 1950s feel, I think of Fender Guitars.\n\nI think that to me, this represents somebody who is classical, jazzy, modern, musical and probably a fun person\n\n**Purple one:**\n\nI get: classical, roman, artistic\n\nI think that this one communicates somebody who is quiet, classical and mature.\n\nI would love to see them, and bigger next time. (I can handle big images) keep it up!\n\n"
    },
    {
      "time": "26 Nov 2008 — 12:34pm",
      "content": "_I believe it’s supposed to be the end of a guitar._\n\nOh. Thank you. The _headstock_ of a guitar.\n\n_oh, I don’t know who these are for (I assume they are for you?)_\n\nGood guess. It's sufficiently obvious, surely.\n\n_get: classical, roman, artistic_\n\nClassical yes, but not really Roman. Not even Greek. Putti (cherubs) are a later neoclassical post-classical antiquity Roman Catholic invention.\n\n_I don’t know what you are trying to communicate with them. . ._\n\nBut you figured it out anyway.\n\nj a m e s\n\n"
    },
    {
      "time": "27 Nov 2008 — 10:53am",
      "content": " **@James**\n\nI don't know what you are hoping to accomplish by that post, it feels very sarcastic and counter-productive to me, and is unlike any of the other insightful and helpful posts I'm used to seeing here on Typophile.\n\n**_Oh. Thank you. The headstock of a guitar._**\n\nWell, not just any _headstock_, I do believe we're looking at a Fender Stratocaster 6-in-line headstock, to be exact.\n\n**_Good guess. It’s sufficiently obvious, surely._**\n\nOh I'm sorry, I must have missed the bit where it was explicitly said that is was for herself, would you mind quoting that from the original post for me, I'm obviously too blind to see it.\n\n**_Not really Roman. Not even Greek. Putti are a later .... invention_**\n\nWow, I had no idea that the words it reminded me of were in fact _not_ the words it reminded me of. How fortunate for me that you know better what it made me think of than I do thanks to your extensive knowledge on _Putti_, which are **not** Cherubs by the way if you were to actually look them up for yourself.\n\n**_But you figured it out anyway_**\n\nDid I? I haven't heard back from the OP to see if the impressions I got from viewing her work were in fact the impressions she was trying to give. Of course I figured out what it made _me_ think of, I just don't know how close that is to what she intended.\n\n**@James** , I think there are a couple of things here, 1) you can't be sarcastic and rude unless you're willing to be entirely devoted to the facts first, because the smallest little factual error in your rant turns what would have been a mean elitist remark into just a bitter and uninformed comment amidst a forum of helpful and nice people. That's the kind of thing that breaks our hearts and have pity for you.\n\n**@Vanessapoka** , well, I hope this hasn't scared you away, there are plenty of nice folks here on this forum who would love to help you, keep us updated with your revisions as you keep working on these. For future reference, posting a PDF or an image about 500-800pixels wide is a good medium size that's small enough to see all at once, and big enough to get a good look at the logo.\n\n_Best of luck,  \ninnovati_\n\n"
    }
  ]
}
