{
  "id": "52150",
  "title": "Thesis Comic Sans",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nMy name is Liesbeth Bonner and I am a graphic design master student at Sint-Lucas Ghent (Belgium). This year I have to write a thesis and I chose Comic Sans as my subject. I will mainly investigate the social aspects of the font: the reasons why so many people use it and so few designers like it. Offcourse I've never used Comic Sans, but for my thesis I am looking for great designers who did, with or without a twist of irony.\n\nI've heard that Will Holder used it one time, but I can't find visual material on the web about it or in books. There's also Gorik Lindemans who made posters for the dance production Rosas (by Anne Teresa De Keersmaeker) and was inspired by the colours of an ad for Aldi (a cheap supermarket), I can't find this poster either.\n\nDoes anyone know where I can find these or are you a Comic Sans expert and do you know other designers who used it in a good way?\n\nThe tips would be very welcome,  \nThank you in advance,\n\nLiesbeth\n\n",
  "author": "Liesbeth",
  "time": "27 Nov 2008 — 12:20pm",
  "uid": "39779",
  "comments": [
    {
      "time": "27 Nov 2008 — 12:30pm",
      "content": "Hi Liesbeth,\n\ncheck out this thread: [Bad Fonts Used Well](http://web.archive.org/web/20130630064142/http:/www.typophile.com/node/39353).  \nAlso: [Comic Sans](http://web.archive.org/web/20130630064142/http:/typophile.com/wiki/Comic%20Sans).  \nF\n\n"
    },
    {
      "time": "27 Nov 2008 — 7:52pm",
      "content": " ![](http://web.archive.org/web/20130630064142im_/http:/typophile.com/files/NewMills_6275.jpg)\n\n"
    },
    {
      "time": "27 Nov 2008 — 8:18pm",
      "content": ":-)\n\nnice!\n\n"
    },
    {
      "time": "28 Nov 2008 — 4:48am",
      "content": "Whoa — reading the title of this thread I thought Luc[as] de Groot went crazy and did an extra cut for his Thesis family.\n\nPffff... Thank G, it aint true.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "28 Nov 2008 — 11:03am",
      "content": "My favourite bad use of Comic Sans: [shiny metal facade lettering in Berlin](http://web.archive.org/web/20130630064142/http:/www.fontwerk.com/208/typosuppe-15/), captured by Ivo.\n\n@Bert: I’d love to see that TheComicSans! After all, there’s [LF Nebulae](http://web.archive.org/web/20130630064142/http:/www.lucasfonts.com/fonts/nebulae/about/).\n\n"
    },
    {
      "time": "28 Nov 2008 — 1:54pm",
      "content": "Not to mention Luc[as]’s naughty fonts…\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "28 Nov 2008 — 3:48pm",
      "content": "Comic Sans expert: [Vincent Connare](http://web.archive.org/web/20130630064142/http:/typophile.com/wiki/Vincent%20Connare)\n\n"
    },
    {
      "time": "1 Dec 2008 — 7:04am",
      "content": "\\>Offcourse I’ve never used Comic Sans\n\n...kind of like, \"I'm writing my thesis on the beers of Belgium, of course I'd never drink the stuff, tastes like \\*\\*\\*\\*\"\n\n"
    },
    {
      "time": "1 Dec 2008 — 9:24am",
      "content": "My favorite was on a wreath sent by Pakistan  \nfor the funeral of a prominent Indian politician.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2008 — 10:04am",
      "content": "hi Liesbeth !\n\nRecently i found some unconventional web usage of comic sans.  \nHere is the my blog post about that. [http://designjunction.wordpress.com/2008/10/17/who-says-you-cant-use-com...](http://web.archive.org/web/20130630064142/http:/designjunction.wordpress.com/2008/10/17/who-says-you-cant-use-comic-sans/ \"http://designjunction.wordpress.com/2008/10/17/who-says-you-cant-use-comic-sans/\")\n\nPlease have a look !\n\n"
    },
    {
      "time": "1 Dec 2008 — 10:15am",
      "content": "\\>Offcourse I’ve never used Comic Sans\n\nWhy not combine hands-off perusal of vices, focusing your research on Comic Sans as used in online pornography?\n\n"
    },
    {
      "time": "1 Dec 2008 — 3:44pm",
      "content": "Usages of Comic Sans abound but what is your thesis statement? You could gather some anecdotal information of funny or hideous uses of the typeface (tee hee, _look at this example_ kind of stuff,) but what are you trying to define? Finding examples will only ratify its usage in almost any context you want to refer to.\n\nSome of its existence and prolific usage is because;  \nIt is owned by Microsoft,  \nIt is a default typeface on a couple of Microsoft programs,  \nIt is readable at small sizes for dialog on computer screens,  \nIt is free.\n\nOn the other hand, why is a typeface like **_Coop Forged_** by House Industries [view here,](http://web.archive.org/web/20130630064142/http:/www.houseind.com/index.php?page=showfont&id=12&subpage=viewfontspecimens) used so little? It is similar as maybe a dozen other comic-looking fonts. The argument my boil down to…it's not a default, not common and not free?\n\nA defined thesis statement will focus your intention, or what you are really trying to discover.\n\n"
    },
    {
      "time": "1 Dec 2008 — 3:45pm",
      "content": "Coop Forged is not used often because it isn't in every person on the planet's drop-down font menu. People specifically looking for hand-written fonts, more than likely, also want alternates. Coop Forged doesn't have alternates.\n\n"
    },
    {
      "time": "1 Dec 2008 — 3:58pm",
      "content": "Well, now that you have edited your comment it looks as if I said something redundant. :^/\n\n"
    },
    {
      "time": "2 Dec 2008 — 8:12am",
      "content": "Sorry, had to change a word.  \nYou are right, no alternates. Still, some that only have access to a limited font library and use programs such as Word or Publisher will click the little buttons that have a **B** or an _I_ at the top of their tool bar for incorrect alternates such as **Bold** or _Italic_ anyway. Right now, the thesis argument is not stated. Anyone that owns a computer has free access to Comic Sans, therefore, someone is going to use it, poor choice or not.\n\n"
    },
    {
      "time": "2 Dec 2008 — 9:08am",
      "content": "Think of Comic Sans like this: Two people need to traverse across a large public park. Lets just assume that dogs are also allowed off leash to roam, play fetch or do their thing, there may be a few geese or other wildlife, etc. With those two people, one walks across while wearing utility boots, the other person, just in their bare feet while carrying their flip-flops. One person will be more concerned as to where they step while traveling to the other side while the other person possibly could care less. Both make it to the other side but one has more probability to really stink when they hop onto some public transit at the other side of the park. It is the same concept. It (Comic Sans,) is out there, it is possible to _step in_ and you may stink if you don't care how you get to the destination.\n\n"
    },
    {
      "time": "3 Dec 2008 — 7:24am",
      "content": "There is a group in Facebook called....hey wait a second there are many groups! well, I thought it was one but there are around 20\n\n[http://www.facebook.com/home.php?#/s.php?q=comic%20sans&init=s%3Agroup&n...](http://web.archive.org/web/20130630064142/http:/www.facebook.com/home.php#/s.php?q=comic%20sans&init=s%3Agroup&n=-1&k=200000010&sid=0b735f231c994e34a9f1cac42ab2deff \"http://www.facebook.com/home.php?#/s.php?q=comic%20sans&init=s%3Agroup&n=-1&k=200000010&sid=0b735f231c994e34a9f1cac42ab2deff\")\n\nHope it helps\n\n"
    },
    {
      "time": "5 Dec 2008 — 11:34am",
      "content": "I was kicked in the eyes by Comic Sans on the front of Cardiff Castle. There were huge banners all over the entrance to the castle with comic sans emblazoned across them.\n\nIt was literally the first thing that visitors would see before entering the beautiful landmark!\n\nDiscover 2000 years of history in the heart of the city is the tagline on the website.\n\nIf I'm out tomorrow, I'll get you a photograph.\n\n"
    },
    {
      "time": "5 Dec 2008 — 12:40pm",
      "content": "Signage for a Chinese restaurant in San Francisco. WTF!\n\n"
    },
    {
      "time": "5 Dec 2008 — 2:35pm",
      "content": "I feel that Comic Sans adds an appropriate layer of character to the [dopeyhead site](http://web.archive.org/web/20130630064142/http:/www.dopeyhead.com/).  \n; )\n\n"
    },
    {
      "time": "7 Dec 2008 — 9:54am",
      "content": "First of all, thanks for all the reactions.\n\nsecond, I shall explain the sentence quoted a couple of times above:\n\n'offcourse i've never used comic sans'.\n\nI said that as a graphic design student who never dared to use it because it's such a difficult typeface to use in an art-environment. I can understand that comic sans is appropriate for applied graphic design, for example a hairdresser's shop (i picked this one because i've seen one with CS in the logo). At school during practice, it's easier to use typefaces that are allready proven to be good ones like Didot, Futura, Baskerville, Garamond, Univers, all the big names in typeworld. I think the only way to use comic sans (and in a design approved by my teachers :)) is in a design that refers to the commercial world and uses it's elements but without just copying them. There has to be an additional value. And layered meanings. Irony is not necessarily a part of it.  \nThis way of adopting elements of the 'low culture' can also be seen with other artists: Arne Sierens ( [http://www.arnesierens.be/](http://web.archive.org/web/20130630064142/http:/www.arnesierens.be/ \"http://www.arnesierens.be/\"))is a playwright who's stories are situated in for example fastfood restaurants, but his plays are considdered art because of the layers and the additional value. Also designer Walter Van Beirendonck ( [http://www.waltervanbeirendonck.com/](http://web.archive.org/web/20130630064142/http:/www.waltervanbeirendonck.com/ \"http://www.waltervanbeirendonck.com/\")) adopts elements of low culture and gives them a new meaning. It's in this way i would like to find some famous graphic designers who used comic sans, but i haven't found one yet. Maybe at the end of this year i myself can design something good with comic sans.\n\nAnd about my thesis statement:\n\ni'm still just researching and i'm following different paths at the same time. But i think i will mostly investigate the social aspects of the type: which people use it and for which purposes? which are the motives of the persons who use it? the things that are said by skinny\\_tires are indeed some of the important reasons of the popularity of comic sans, but even if we just look at the fonts delivered with every computer, comic sans is still the most popular. Is it, as some organisations who researched dyslectia say, the best readable type? is it good for children who are just learning to read?\n\nI hope you all get a nicer image of me and my thesis :) I haven't got the intention of turning my thesis in a freakshow to tell everyone how bad and ugly comic sans is. I want to investigate comic sans properly and if the solution is that comic sans a bad font is, then be it. But up to now, 'i believe in comic sans' (this is also my working titel of my masterproject)\n\n"
    }
  ]
}
