{
  "id": "52156",
  "title": "Kerning? Old Eurostile vs Eurostile Next",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi Guys,\n\nI have two questions for you,\n\n1) Does anyone have any complains about the kerning in this design with any of the letters?, have I broken any don't do's?  \n2) Would you notice any change if I was to purchase \"Eurostile Next\" and changed the font to that? It is currently set in the old Eurostile and I can't really see a difference between the two, I have only used \"try font\" on a font website for me to determine this.\n\nThanks heaps for your time\n\n ![](http://web.archive.org/web/20130804043342im_/http:/typophile.com/files/SNAG_4033.jpg)\n\n",
  "author": "Michael Palmer",
  "time": "27 Nov 2008 — 8:39pm",
  "uid": "14158",
  "comments": [
    {
      "time": "27 Nov 2008 — 9:07pm",
      "content": "Metrically the SNAG component looks dead on– optically the word looks weighted because of the SN; really it's the negative space of the Cap A. Have you thought of kerning the A in s it touches the N and then kerning in the G?\n\nI have a real problem with tracked-out punctuation as in CO. – it's just wrong; sorry. There are no rules pertaining to it but it's a \".\" lost in space. ; )\n\n"
    },
    {
      "time": "27 Nov 2008 — 9:25pm",
      "content": "Yeah Good point on the \".\" it really is lost in space haha. What do you mean by \"optically the word looks weighted\" because of the SN; really it’s the negative space of the Cap A\". If you could help break that down that will be awesome. Your help is much appreciated. So you think the A and N need to touch?\n\n"
    },
    {
      "time": "27 Nov 2008 — 9:26pm",
      "content": "How much would you bring in the \"G\"\n\n"
    },
    {
      "time": "28 Nov 2008 — 3:16am",
      "content": "I think what Mac\\_56 means is that the SN pair seems to form a solid, structured block, whereas the AG pair seems a lot more loose. I agree with him on that, and also agree that it must be because of the extra negative space afforded by A.\n\nBTW, what weight is SNAG set in? I realize that Eurostile comes in an extended variety, but somehow it seems to me a tiny bit stretched on the horizontal.\n\n- — - — - — - — - — - — - — -  \nWill food for type.\n\n"
    },
    {
      "time": "28 Nov 2008 — 4:41am",
      "content": "OK, Here’s what I think:\n\n ![](http://web.archive.org/web/20130804043342im_/http:/typophile.com/files/SNAG_spacing_4450.jpg)\n\nWhat you need to aim for is a balance between innerspace (space within— lightblue) and intraspace (space between — pink).  \nStart with the largest of the innerspaces, in this case N or G, and then try to make the intraspaces equal to that. In your sample the S is way to close to the N.  \nOnce you have balanced everything you can either substract or add equal amounts of space between the glyphs, depending on what your aiming for (tension, or light colour, etc.).\n\nThe other line: Wordpace is excessive. Wordspace equal to the innerspace of N is adequate. The dot should be way closer to the O, and do not line it up with the topline, but let it stick out somewhat.\n\nAnd try looking at this up-side-down or in a mirror.  \nHope this helps.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "28 Nov 2008 — 6:25am",
      "content": "Wow… that was a great critique. Right on.\n\n- — - — - — - — - — - — - — -  \nWill food for type.\n\n"
    },
    {
      "time": "28 Nov 2008 — 12:51pm",
      "content": "It seems to me that the overshoots on S and G are too small.  \nI noticed that, but not anything about the kerning.  \nThe N overpowers the other letters.  \nThe way Novarese designed it may be OK in general, but for a four-letter logo, some tweaking of the glyph may be necessary.\n\n"
    },
    {
      "time": "28 Nov 2008 — 4:53pm",
      "content": "You guys have all be really fantastic with your comments, thank you so much to you all. Special thanks to bert\\_vanderveen for your critique....many thanks\n\n"
    },
    {
      "time": "28 Nov 2008 — 6:32pm",
      "content": "Is this any better? I now feel that the words \"clothing co.\" are to big would anyone agree or disagree?  \nI want the words and line to all line up so I cant make font any smaller. Thanks Heaps\n\n ![](http://web.archive.org/web/20130804043342im_/http:/typophile.com/files/SNAG_4204.jpg)\n\n"
    },
    {
      "time": "28 Nov 2008 — 6:56pm",
      "content": "That is definitely better. HIN might need a little spreading out.\n\n"
    },
    {
      "time": "29 Nov 2008 — 6:23am",
      "content": "The line needs shortening ever so slightly & that’s pretty much it, I think.  \nCheers!  \n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "1 Dec 2008 — 12:55am",
      "content": "yves? any thoughts? i know how much you love eurostile...\n\n;-)\n\n[http://fontfeed.com/archives/newspaper-front-pages-proclaim-obama-victory/](http://web.archive.org/web/20130804043342/http:/fontfeed.com/archives/newspaper-front-pages-proclaim-obama-victory/ \"http://fontfeed.com/archives/newspaper-front-pages-proclaim-obama-victory/\")\n\n"
    },
    {
      "time": "1 Dec 2008 — 6:28am",
      "content": "I'm with Nick on this one. There are competing factors in spacing. One is how far apart the closest blacks are. Another is visual equality between the letters. Another is balance between inner and outer. Your first goes for the first one. I think that is OK, if you want compactness, which you might want in a logo. The other way is what Bert said, but if you want to go that way I think you need the S still further away.\n\nAs Nick says, the joins on the N may be too heavy. Try slightly reducing the width of the verticals.\n\nOn the bottom line the OT looks too wide, but slightly tweaking the whole thing is probably needed for perfect balance. I don't see why you need the period at all.\n\n"
    }
  ]
}
