{
  "id": "52162",
  "title": "Steeling sheep - a proverb?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone,\n\nI have a question concerning the proverb \"Stealing sheep\".  \nEnglish is not my mothertongue and this could be the reason for my ignorance.  \nI have tried to pick up the meaning of this proverb, that I have seen used a few times now. i.e. in the title of Erik Spiekermanns book 'Stop stealing sheeps and find out how type works'. And in Robert Bringhursts book 'Elements of typographic style' -(letterspacing is like stealing sheeps). In my confusion I have searched on Google to find an explanation, but without luck. That's why I have come to you guys!\n\nCan anyone help me explain this apparently well-known (typographic?) proverb?\n\nThanks in advance!  \nJacob\n\n",
  "author": "yakobu3000",
  "time": "28 Nov 2008 — 4:58am",
  "uid": "31561",
  "comments": [
    {
      "time": "28 Nov 2008 — 5:10am",
      "content": "I believe the saying comes from Frederic Goudy who once said \"Anyone who would letterspace blackletter would steal sheep.\" Although it is commonly misquoted as \"Anyone who would letterspace lower case would steal sheep.\"\n\nI can't remember why, I think someone gave him an award with letterspaced blackletter that he did not like.\n\n"
    },
    {
      "time": "28 Nov 2008 — 5:25am",
      "content": "OK! So I guess one could translate it into: Letterspacing lowercase(/blackletter) is bad typography manners?\n\nThank you!\n\n"
    },
    {
      "time": "28 Nov 2008 — 5:45am",
      "content": "From what I understand Goudy said that anyone letterspacing blackletter would be the kind of person who'd pull a Gill on the poor sheep.  \nAs we don't use blackletter much these days and the reference to zoophilia would steal the focus from the typographic lesson to be learned, a cleaned up version is now the common one.\n\n"
    },
    {
      "time": "28 Nov 2008 — 5:46am",
      "content": "The Stop Stealing Sheep book tells the story, if I remember correctly. The original verb Goudy used was _shag_. And also of note, letterspacing blackletter was a established way of adding emphasis. But yeah, bad manners is the implied meaning.\n\n"
    },
    {
      "time": "28 Nov 2008 — 6:06am",
      "content": "Thanks again!  \nSo, fredo... You think there was also a clear reference to Gill's zoophilia in that sentence or...?\n\n"
    },
    {
      "time": "28 Nov 2008 — 6:49am",
      "content": "No - Goudy had died many decades before Gill's zoophilic experiments became publicly known.\n\n"
    },
    {
      "time": "28 Nov 2008 — 6:51am",
      "content": "Yes, the Gill reference was my very own.\n\n"
    },
    {
      "time": "28 Nov 2008 — 7:53am",
      "content": "Thanks guys!\n\n"
    }
  ]
}
