{
  "id": "52166",
  "title": "Type Out of Context? Lucky Charms.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was surprised to see Process Type Foundry's [Locator Display](http://web.archive.org/web/20140824214232/http:/www.processtypefoundry.com/typefaces/locatordisplay/index.html) on this box of Lucky Charms. I'm not sure whether it works or not, but I am sure I never would have thought of using it in this situation.\n\n ![](http://web.archive.org/web/20140824214232im_/http:/typophile.com/files/luckycharms_3708.jpg)\n\n",
  "author": "Chris Keegan",
  "time": "28 Nov 2008 — 7:59am",
  "uid": "1115",
  "comments": [
    {
      "time": "28 Nov 2008 — 12:22pm",
      "content": "\\>I was surprised to see Process Type Foundry’s Locator Display on this box of Lucky Charms.\n\nBoth General Mills and Process are based in Minneapolis - might be a connection.\n\n"
    },
    {
      "time": "28 Nov 2008 — 12:43pm",
      "content": "EEK! it looks so weird! In canada every package is bilingual english/french.\n\nY'know, our packages are cleaner than that too...\n\nSomething I noticed walking through American grocery stores is that, even thought they only had 1 language to deal with, they english-only packaging was WAY more crowded and busy than our Canadian bilingual packagine (and I'm also not a fan of american typography, much more 'novelty' than 'style' for my taste.\n\nThe _only_ clean and legible packages in the US were multi-national copmanies, whose designers would have had to design multi-lingual packaging in other countries (canada, europe) like Kraft, Knorr and others like that.\n\nI wonder, is our bilingual packaging in Canada busier and more loaded down than European Multi-lingual packaging? I know one of the impediments here are the 'equal representation laws' that require english and french to have (often times) equal point sizes, even though the french runs 20% longer on average.\n\nIt might be nice to have predominantly english or predominantly french packaging, with some bilingual elements.\n\nSorry about this whole thing, it's just so foreign \\*not\\* to see _le french_\n\n"
    },
    {
      "time": "28 Nov 2008 — 12:47pm",
      "content": "\"packagine\" is to packaging what margarine is to butter?\n\n"
    },
    {
      "time": "28 Nov 2008 — 5:47pm",
      "content": "haha, I can't believe it's not _packaging!_\n\n"
    },
    {
      "time": "30 Nov 2008 — 5:00pm",
      "content": "\\>I was surprised to see Process Type Foundry’s Locator Display on this box of Lucky Charms.\n\nMe too!  \nI think the same white calcium/vitamin banner is applied to many cereals so it tends to look a little plunked into place.\n\n"
    }
  ]
}
