{
  "id": "52171",
  "title": "Interaction/Industrial Design Studio Logotype",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all, first post — thanks in advance for your critique.\n\nHoping for some final feedback for my company’s identity before I lock it down for stationary, website, etc... I’ll hold off on divulging the intended concept so I don’t bias anyone’s feedback. To give some context — I am an aspiring industrial designer and currently work as an interaction designer/photographer.\n\nAlso, any suggestions for additional fonts to include in my short list for collateral would be great.\n\nThanks,\n\n-C\n\n[View the concept medium size](http://web.archive.org/web/20081205065545/http:/farm4.static.flickr.com/3028/3062385932_645b50e94d.jpg)  \n [View the concept large](http://web.archive.org/web/20081205065545/http:/farm4.static.flickr.com/3028/3062385932_07f7514693_o.jpg)\n\n [‹ Talking Heads](http://web.archive.org/web/20081205065545/http:/typophile.com/node/52242 \"Go to previous forum topic\") [Cafe Logo ›](http://web.archive.org/web/20081205065545/http:/typophile.com/node/52108 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205065545/http://typophile.com/user/31634\" title=\"View user profile.\">PCM</a>",
  "time": "<br>",
  "uid": "31634",
  "comments": [
    {
      "time": " 28.Nov.2008 10.31am",
      "content": "Well, assuming it’s too late to start from scratch :-/ the only thing  \nthat jumps out is the ascender of the “f”: it’s not harmonizing well.\n\nhhp\n\n"
    },
    {
      "time": " 28.Nov.2008 12.40pm",
      "content": "I might try bottom serifs on the r’s and f - maybe just on the right side.  \nRight half of k gets too black.\n\n"
    },
    {
      "time": " 28.Nov.2008 1.01pm",
      "content": "Yes, and the “w” is too serify as well.\n\nBTW, the right side of the stem of the “r” isn’t  \na totally straight line - is that intentional?\n\nhhp\n\n"
    },
    {
      "time": " 28.Nov.2008 1.39pm",
      "content": "@eliason <cite>I might try bottom serifs on the r’s and f - maybe just on the right side.<br>\nRight half of k gets too black.</cite>\n\nwill play around with this. thanks.\n\n@hrant <cite>and the “w” is too serify as well.</cite>\n\nCan you elaborate please? Too wide, tall? Too black?\n\n@hrant <cite>Well, assuming it’s too late to start from scratch :-/ </cite>\n\nCan you elaborate, please? Assuming you are not a fan of the base font?\n\n"
    },
    {
      "time": " 28.Nov.2008 1.59pm",
      "content": "It’s what I would call heavily inspired by the Carhartt-logo. And apart from the implications of this, the execution is just sub-par.\n\nStart again by looking for a font that has the desired character and don’t fiddle around too much with the letterforms — they were probably drawn by a person with more experience that you. Be respectful of that.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 28.Nov.2008 2.33pm",
      "content": "@ Bert — not sure I see the Carhartt reference (see attached), but I don’t mind the fact it came to mind when you saw the logotype. I will revisit the font to give it another shot (I do like the base font).\n\nYour points are well taken but there’s no need to be short.\n\n ![](http://web.archive.org/web/20081205065545im_/http:/typophile.com/files/logo_4774.jpg)\n\n"
    },
    {
      "time": " 28.Nov.2008 2.35pm",
      "content": "I suspect [this](http://web.archive.org/web/20081205065545/http:/www.dntproducts.com/images/carhartt_logo_jsut.jpg) is the one Bert’s thinking of.\n\n"
    },
    {
      "time": " 28.Nov.2008 4.16pm",
      "content": "Thanks for the link. I do see that they are both slab-serif’s but I’m not sure if I would call it “heavily-inspired” (EF Dynamo vs ITC Lubalin is a bit of a stretch)?\n\nI’d like to hear some other opinions if possible before I go back to the artboard with the original font (which I plan to do). You can view the original typeface at this link to compare to the concept. [http://www.myfonts.com/fonts/ef/dynamo/ef-medium/](http://web.archive.org/web/20081205065545/http:/www.myfonts.com/fonts/ef/dynamo/ef-medium/ \"http://www.myfonts.com/fonts/ef/dynamo/ef-medium/\")\n\n"
    },
    {
      "time": " 28.Nov.2008 5.41pm",
      "content": "I actually don’t think it’s close enough to Carhartt to worry.  \nBut to me the “base font” is 2-3 decades off. :-/\n\nAs for the “w”, it might be better if you removed the middle serif up top.\n\nhhp\n\n"
    },
    {
      "time": " 28.Nov.2008 6.09pm",
      "content": "Ahh I see. Thanks for explaining your perspective. I know the basis for the EF Dynamo typeface is “vintage” but I’m ok with that. I’m going to try everyone’s suggestions and post another draft.\n\n"
    },
    {
      "time": " 29.Nov.2008 8.51am",
      "content": "I kind of like it, though it seems to need much love.\n\n"
    },
    {
      "time": " 29.Nov.2008 6.49pm",
      "content": "Ok here’s a revision.\n\n[http://farm4.static.flickr.com/3032/3069105547\\_59e82f43c5\\_o.jpg](http://web.archive.org/web/20081205065545/http:/farm4.static.flickr.com/3032/3069105547_59e82f43c5_o.jpg \"http://farm4.static.flickr.com/3032/3069105547\\_59e82f43c5\\_o.jpg\")\n\nIn this revision I returned the “C” to the original (which adds harmony to the “t”), changed the ascender of the “f” a bit, used the original “w” (Avante Garde), and toned down the serifs which helped overall. I still don’t like the k. Honestly this combination of letters looks horrible in just about any typeface. Here’s a snapshot of the logo with the Avante Garde “k” to give an idea of what the letterform would look like untouched. Any advice?\n\n[http://farm4.static.flickr.com/3044/3069105517\\_7980c3ea9c\\_o.jpg](http://web.archive.org/web/20081205065545/http:/farm4.static.flickr.com/3044/3069105517_7980c3ea9c_o.jpg \"http://farm4.static.flickr.com/3044/3069105517\\_7980c3ea9c\\_o.jpg\")\n\n"
    },
    {
      "time": " 29.Nov.2008 7.32pm",
      "content": "Try this wonderful slab:  \n [http://www.myfonts.com/fonts/stone/silica/bold/](http://web.archive.org/web/20081205065545/http:/www.myfonts.com/fonts/stone/silica/bold/ \"http://www.myfonts.com/fonts/stone/silica/bold/\")  \n [http://www.myfonts.com/fonts/stone/silica/black/](http://web.archive.org/web/20081205065545/http:/www.myfonts.com/fonts/stone/silica/black/ \"http://www.myfonts.com/fonts/stone/silica/black/\")\n\nhhp\n\n"
    },
    {
      "time": " 29.Nov.2008 8.38pm",
      "content": "the whole thing is really messing with my eyes. there’s so much direction and optical illusion everywhere.\n\nthe ’k’ especially makes me think the logo is 3-d\n\n"
    },
    {
      "time": " 29.Nov.2008 9.31pm",
      "content": "@gerald: good point about it being too multi-directional, I turned it upside down and it really starts to look crazy. The black against the stark white isn’t helping either — maybe I’ll tone it down for future concepts.\n\n@hrant: thanks for the suggestion — I really like the Silica Light and Regular but the serifs and letterforms on the Bold and Black feel a bit too playful for my taste.\n\nI am working again from scratch with the base typeface. I’ll check back in with another revision.\n\n"
    },
    {
      "time": " 2.Dec.2008 1.36pm",
      "content": "Ok, here’s another revision. I went back to the [typeface](http://web.archive.org/web/20081205065545/http:/www.myfonts.com/fonts/ef/dynamo/ef-medium/) and tried to execute the concept again taking into account everyone’s feedback.\n\nHere is a comparison of the original to the new. I must say though that with some small kerning adjustments to the original and changing the color to dark gray rather than black, legibility improved significantly. I’m still not completely happy with this revision (the “t” in particular), but I think I am hopefully getting closer. Feedback appreciated.\n\n[http://farm4.static.flickr.com/3170/3078420996\\_20deb23524\\_o.jpg](http://web.archive.org/web/20081205065545/http:/farm4.static.flickr.com/3170/3078420996_20deb23524_o.jpg \"http://farm4.static.flickr.com/3170/3078420996\\_20deb23524\\_o.jpg\")\n\n"
    },
    {
      "time": " 2.Dec.2008 2.31pm",
      "content": "the ft is kinda ... getting there but something seems off ... too many angles where the loop of the f, head of the t and cross bar of the f meet perhaps?  \nI do like the base and font you’ve got going though. The revision is deifnitely a step in the right direction.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081205065545/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20081205065545/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": " 2.Dec.2008 4.45pm",
      "content": "i don’t get the inclusion of some slabs and the exclusion of others...\n\n"
    },
    {
      "time": " 2.Dec.2008 7.02pm",
      "content": "I like the vertical terminal on the bottom of the C on the first logo, like the r gets in the way. If the angle on the top of the C matched the r’s serif’s angle, that might complete the idea that the r is blocking out the C, or that they share their space more harmoniously.\n\nI do like the revised w though. A little bit lighter on the serifs, and better spaced. But I’d leave a bit of a serif on the k.\n\n"
    },
    {
      "time": " 2.Dec.2008 8.07pm",
      "content": "thanks for the replies.\n\n@ Ratbaggy - good point I will try to harmonize the geometry. Thanks I’m happy to start to hear at least somebody likes the logotype LOL.\n\n@ jpolo - the only letter to which i added slabs from the original typeface is the “w”. That “k” is stock, although I agree that it’s just not right. like it almost was stuck on. Any ideas?\n\n@maxticket - creating the “k” has been terrible — the original EF Dynamo “k” as well as the original “ftw” relationship are way off very weird negative space going on. To Bert’s point about leaving the typeface alone, the relationship between those letters is a dealbreaker for the stock typeface so something has to be done about them. The “k” from my original concept was my best attempt at a harmonious serif k — but I think it creates too much of a jagged look and weird direction. I’ll see if I can harmonize with the new concept. And also I like your point about the “C” although do you think the descender of the “t” will harmonize if it loses that relationship?\n\n"
    },
    {
      "time": " 2.Dec.2008 8.20pm",
      "content": "the new one is definitely an improvement, but the the ’ft’ is still very awkward. i really think you should either make the negative space more even or try to actually connect them as a ligature, maybe try a tiny stroke from the f to the t ? maybe play around with something like this?\n\n ![](http://web.archive.org/web/20081205065545im_/http:/typophile.com/files/craftwerk_6111.gif)\n\nalso the w serifs are so in-your-face that it really calls a lot of attention to itself. the ’c’ and the ’k’ look a ton better in the new version, in my opinion\n\n"
    },
    {
      "time": " 2.Dec.2008 11.10pm",
      "content": "The eye is totally interrupted by the f t ligature. Basically this is Rockwell on speed – ditch the non slab-serif stuff. Coming late to this conversation and seeing where you started I have this to say: originally there was a forward ( left to right) movement of the slab serif. While overboard it’s now gone; the “C” and the “w” contain it, and to some extent the “o”. It now comes to a dead halt in the “r” and “k”.\n\nThe reader must still move forward at the end of the word– it should be sold to the client as “forward thinking” yet “traditional” - as indicated by the meaning implicit in the word.\n\nGo back somewhat to your original ideas. Best of Luck.\n\n"
    }
  ]
}
