{
  "id": "52189",
  "title": "Robothon 2009: March 5, 6, The Hague",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The RoboFab developers would like to invite you to a new Robothon conference, Thursday March 5 and Friday March 6, 2009, at the Royal Academy of Arts in The Hague.\n\nThis time around we want to focus on the type design and production workflow. Sessions will address drawing, managing sources, class kerning, interpolation and generating and testing OTF. And of course scripting to glue it all together. We'd like to have some tool demo's as well. And of course a couple of parties, people to meet and letters to look at.\n\nThere will be other type related events at the same time and venue: an exhibition of the work of Tobias Frere-Jones will open Friday afternoon, and the new winner of the Gerrit Noordzij Award will be presented.\n\nRegistration info and programme will be posted on [http://Robofab.com](http://web.archive.org/web/20130821050118/http:/robofab.com/)\n\nCheers!  \nErik\n\n",
  "author": "vanblokland",
  "time": "29 Nov 2008 — 11:13am",
  "uid": "1078",
  "comments": [
    {
      "time": "16 Dec 2008 — 7:48am",
      "content": " ![](http://web.archive.org/web/20130821050118im_/http:/typophile.com/files/logo_erik_small_4861.gif)\n\nRegistration info, accomodation hints:  \n [http://robofab.com/robothon/index.html](http://web.archive.org/web/20130821050118/http:/robofab.com/robothon/index.html \"http://robofab.com/robothon/index.html\")\n\n"
    },
    {
      "time": "16 Dec 2008 — 8:40am",
      "content": "Would Robothon be worthwhile to someone who is new to Python/Robofab and looking to get started, or will the sessions be targeted at advanced programming?\n\n"
    },
    {
      "time": "16 Dec 2008 — 10:55am",
      "content": "Yes.\n\n"
    },
    {
      "time": "16 Dec 2008 — 11:05am",
      "content": "\\*tracking\\*\n\n"
    },
    {
      "time": "16 Dec 2008 — 11:30am",
      "content": "Well then, I guess I’ll finally be meeting up with the European Typophiles!\n\n"
    },
    {
      "time": "21 Jan 2009 — 2:40am",
      "content": "I just wanted to point out the new updates to the Robothon schedule that were not available when the original announcement was made.\n\n[http://robofab.org/robothon/index.html](http://web.archive.org/web/20130821050118/http:/robofab.org/robothon/index.html \"http://robofab.org/robothon/index.html\")\n\nas I recall there were no talks listed yet back in December.\n\n"
    },
    {
      "time": "25 Jan 2009 — 4:04am",
      "content": "Just received my ticket today. I'm really looking forward to it.\n\n"
    },
    {
      "time": "28 Jan 2009 — 2:30pm",
      "content": "I will be in Den Haag, along with Mr. James \"JimmyG\" Grieshaber, and hopefully Shu Lai, plus Yves and Lolo and Type-o-Tones and so many more Typophiles! The SOTA crew is staying in a lovely apartment off Denneweg, can't wait to get back to Dutch goodness.\n\n"
    },
    {
      "time": "29 Jan 2009 — 12:09am",
      "content": "I am booked, too. I am so excited that I already have goosebumps. How I will manage the next few weeks is anybody's guess…\n\n"
    },
    {
      "time": "29 Jan 2009 — 3:01am",
      "content": "I’m in too, together with Eben Sorkin, Claus Eggers Sørensen, Amélie Bonet, Dave Crossland and a couple of others current MATD students. Paolo Mazzetti from Italy is coming too. I’m looking forward to it!\n\n"
    },
    {
      "time": "29 Jan 2009 — 8:51am",
      "content": "Registration for Robothon 09 is now officially closed!\n\nThe response has been overwhelming and with more than 100 attendees we have twice as many people as last conference.\n\nA big thanks to everyone who registered and I'm looking forward to meeting you there!\n\n-Paul van der Laan  \nCo-organiser Robothon 09 conference\n\n"
    },
    {
      "time": "30 Jan 2009 — 12:18am",
      "content": "i wasn't sure if wanted to go, but there is no need for that anymore\n\n"
    }
  ]
}
