{
  "id": "52188",
  "title": "A different kind of thought",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "<dl>\n<dt>Sixty years ago, Penguin published a series of book titled <em>The Things We See.</em> The jacket notes:<br>\n</dt>\n<dd>The aim of the authors in this series is to encourage us to look at the objects of everyday life with fresh and critical eyes. Thus while increasing our own daily pleasure we also become better able to create suroundings which will give us permanent pleasure. To achieve this in the furnishing and the equipment of our homes, we must buy with discrimination and so prove to designers, who set the machines to work, that we are no longer bound by habit or indifference to accept whatever is offered.</dd>\n</dl><dl>Books in the series covered Houses, Furniture, Pottery and Glass, Public Transport, and Ships. They were exquisitely designed, set, produced and printed, with rotogravure plates. My favourite is <em>Ships</em>, by David Pye. His philosophy of design is well put, and bears applying to type, so I will quote him at length:\n<dd>\n   Just as a style can become too much for the designer, so also can functional requirements. Indeed it is perfectly possible for requirements to be so intractable that a designer has the utmost difficulty in finding any satisfactory compromise which will meet them. Too little freedom of choice can be as fatal to good design as too much--more fatal in fact, because designers of outstanding ability can put up with a great deal of freedom, but even they are helpless with none at all. It may be no fault of the designer's that a ship looks badly designed: it is his misfortune always to be judged by results: the public at large are not to know that he may have been asked to put a quart into a pint pot--nor that he may have almost succeeded!<br>\n   There are probably some types of ship which are incapable of being made to take the eye, and anyone criticising a ship's design or her designer should remember this. Only an expert will be able to judge whether the designer's problem could be solved; and if so, whether he has solved it well.<br>\n   To appreciate the beauty of good design, on the other hand, requires no expert knowledge; but it is one thing to appreciate it and quite another to explain what it is, how it is recognised and understood. The designer himself cannot explain the quality of his design. He arrives at a good design by choosing one set of shapes in preference to another, but he may be too much preoccupied with meeting requirements to be conscious that he is doing so; and even if he is conscious of choosing, he will not be able to give any real explanation of the mental process that decides his choice; for just as the mental process of logical reasoning can find expression in words but not in the notes of music, so can the mental process of designing find expression only in shapes but not in words. It is impossible to give a reasoned explanation of the beauty of design, simply because it is not the product of logical reasoning but of a different kind of thought. Looking at good design will help to understand it more than reasoning about it--or than reading about it. The illustrations will speak for themselves better than I can speak for them.<br>\n   There are qualities of good design which can be described; but it is not possible to point to a beautiful ship and a commonplace one and to say, \"this one is beautiful<em> because</em> she has a pronounced sheer, which the other has not; or because she has a rounded front to the bridge, or a raking stem, or a flaring bow.\" A ship may have all these things and be ugly, or none of them and still be beautiful.</dd>\n</dl>\n\n.\n\n ![](http://web.archive.org/web/20130216011431im_/http:/typophile.com/files/Ships2_5328.jpg)\n  \n.  \n\n ![](http://web.archive.org/web/20130216011431im_/http:/typophile.com/files/SHIPS_page_5236.jpg)\n  \n(Nice use of lining and oldstyle figures in the captions.) \n",
  "author": "Nick Shinn",
  "time": "29 Nov 2008 — 11:07am",
  "uid": "2021",
  "comments": [
    {
      "time": "29 Nov 2008 — 2:34pm",
      "content": "Thanks for posting this Nick. I for one wish, no hope and prey that craftsmanship can once again be elevated to where it once was. We have many fine craftsmen and women in modern type design and typography, but alas their number are few compared to the masses.\n\n"
    },
    {
      "time": "29 Nov 2008 — 2:35pm",
      "content": "[OT]  \n<cite>a series of book entitled ... </cite>\n\nSee [Americans are entitled to free (albeit grammatically warped) speech](http://web.archive.org/web/20130216011431/http:/www.agriculture.purdue.edu/agcomm/ontarget/0506/GrammarTraptitledvs.entitled.htm). The same must be true for Canadians :-)\n\n"
    },
    {
      "time": "29 Nov 2008 — 7:04pm",
      "content": "Thanks.  \nFixed.\n\n"
    },
    {
      "time": "29 Nov 2008 — 7:39pm",
      "content": "The irony is that the first paragraph refutes the second.\n\nNobody can fully capture a piece of art or craft by words alone, of course. But that is really a straw man. For words can often shed light both on the finished product and the process that produced it; and that is all writing about art tries to do. Indeed the first paragraph does give interesting insight into the process of a ship designer.\n\nIn fact creativity in art, and science and craft share that they are constrained problem-solving processes, and so have a lot in common even though they are in different fields.\n\nAnd writing about literature, music, or visual is often delightful. Some of us even greatly enjoy reading about type--including when Nick Shinn writes about it on Typophile, which fortunately is pretty often :)\n\n"
    },
    {
      "time": "30 Nov 2008 — 1:16am",
      "content": "@Graham: _I for one wish, no hope and prey that craftsmanship can once again be elevated to where it once was._\n\n\"prey\" \\> pray.\n\nCareful what you pray for. You're the first to mention \"craftsmanship\". Isn't this thread about design?\n\nDid you have a specific time or place in mind for \"where it once was\" ? It sounds a lot like classical ancient Greeks looking back with starry eyes to their \"golden age\" and the \"silver age\" that came after it, then the great fall from grace into the Greek dark age before their reinventing themeselves in classical form.\n\nIn other words the Golden Olden Days syndrome in which design (or craft) was always better in the recent past than it is today. In some instances this way of viewing history is proven valid, and in ass many other instances it turns out to be a load of wishful romanticism and nothing more.\n\nI'm curious about what you mean by \"where it once was\", since that implies a certain time & place.\n\n_We have many fine craftsmen and women in modern type design and typography, but alas their number are few compared to the masses._\n\nSounds like a sweeping and generalized view based on a personal impression of the world. Do you have any figures or statistical studies to back it up? Or can you be more sepcific? Are you referring to professional graphic / visual designers versus non-designers (untrained) and other folks who aren't designers by instinct or trade but have the means to design using a computer and software?\n\nAlso, \"modern\" is a very loosely employed word that can refer to people, places and things ranging in date from the present back to the Italian renaissance of the 15th century. I think the word(s) you really want there are \"contemporary\" or \"present day\".\n\nj a m e s\n\n"
    },
    {
      "time": "30 Nov 2008 — 1:38am",
      "content": "ooops, yes...I need to proof read my posts. Thanks for the correction James, it indeed should have been \"pray\".\n\n"
    },
    {
      "time": "30 Nov 2008 — 4:05am",
      "content": "James. Implicit in my 'generalized' remarks following Nick's very fine post is the characteristic 'vagueness' that one may find in cooking recipes for example. The vagueness is not confusion or ambiguity but a recognition that the actual fitting together of the components is up to the individual's perception and experience.\n\n"
    }
  ]
}
