{
  "id": "52195",
  "title": "Wordmark critique please",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Any thoughts on the concept ?  \nIs the wordmark worth considering to begin with given the length of the name ?\n\nThanks\n\n ![](http://web.archive.org/web/20090605215857im_/http:/typophile.com/files/pn-wordmark_4480.png)\n\n",
  "author": "<a href=\"/web/20090605215857/http://typophile.com/user/39971\" title=\"View user profile.\">epsilicon</a>",
  "time": "<br>",
  "uid": "39971",
  "comments": [
    {
      "time": " 30.Nov.2008 4.29am",
      "content": "I think the concept looks quite nice! I read “PRECISION ETWORKING” though.\n\n"
    },
    {
      "time": " 30.Nov.2008 1.31pm",
      "content": "Yeah, visually is nice, but name needs work. “Precision Etworking” doesn’t convey precision work to me.\n\npenn\n\n"
    },
    {
      "time": " 30.Nov.2008 2.33pm",
      "content": "Well, the name is actually mangled on purpose.\n\nThe idea is that _if_ it reads as two words that overlap at the ’n’, the quirky spelling is that something extra that makes the name more memorable.\n\nMy assumption was that since ’etworking’ is an obvious non-word the shared nature of ’n’ was going to be obvious. Do you guys read it in fact as an ’etworking’\n\nGood point about missing letter not relating well to the ’precision’ part of the name, Penn. Never occurred to me to look at it from this angle.\n\n"
    },
    {
      "time": " 30.Nov.2008 2.53pm",
      "content": "_The idea is that if it reads as two words that overlap at the ’n’_\n\nIt doesn’t.  \nTypographically, the N belongs to the “PRECISION” part without any ambiguity.\n\n"
    },
    {
      "time": " 30.Nov.2008 3.00pm",
      "content": "precisely\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20090605215857/http:/www.solid-creative.com/)  \n [Short Film Festval](http://web.archive.org/web/20090605215857/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": " 30.Nov.2008 3.14pm",
      "content": "OK, thanks.\n\nAny thoughts on how to make ’n’ ambiguous ? I considered using bold type for the ’n’ alone, but the result looks somewhat visually unbalanced. Neither does underscored, mirrored or accented ’n’ work. Perhaps I’m just not giving it the right treatment.\n\nAny thoughts or hints are welcome. I seem to be running quite low on the ideas :-|\n\n"
    },
    {
      "time": " 30.Nov.2008 3.36pm",
      "content": "Just a thought – it may really suffice to have one good idea in your concept instead of two that don’t rely on each other. In my opinion, if you add the missing ’n’ and explore detail treatments from there, this may become quite a memorable, if minimalist, logo.\n\n"
    },
    {
      "time": " 30.Nov.2008 4.11pm",
      "content": "• Maybe try to conceptualize “precision registration” of the middle N. Eg with a light weight side and a black side. where they overlap is knocked out forming an in-line N.\n\n• Or maybe extend the diagonal, shifting the second half down and physically networking the two words.\n\nI agree with above, don’t need 2 ideas in a logo, just one.\n\nBTW, it feels to me like the whole precisio(n)etworking idea came from domain availability rather than a real concept. If so, a gimmicky url is only adding confusion to would-be website visitors. I would avoid this if possible (understanding sometimes it’s not).\n\nLast thought: In your current version the bold and regular don’t have enought contrast for me.\n\nGood luck!\n\n"
    },
    {
      "time": " 30.Nov.2008 11.47pm",
      "content": "Let me tell you all something. People tend to read words as patterns and not letter-by-letter, therefore PRECISIONETWORKING in this example reads just fine. I think there would be a really insignificant minority that wouldn’t be able to read it correctly.\n\nIt’s true that our eye also catches the misspelling, but we still read it correctly.\n\nThe other question is whether this idea goes well with “precision”. Which probably doesn’t. But the idea is very nice and very well done. It probably just needs some polishing. Maybe actually using double overlapped letter N would solve the trick and positioning those triangles on them. We also get a mark: double N with triangles.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 1.Dec.2008 12.08am",
      "content": "_Let me tell you all something. People tend to read words as patterns and not letter-by-letter, therefore PRECISIONETWORKING in this example reads just fine._\n\nI think there are two factors here that hinder this kind of “pattern reading”: (a), that the name is set in all caps which makes me “decipher” it rather than fluidly read it; and (b), that the bold–thin contrast introduces a “break” so to speak right before the E of ETWORKING, thereby setting that apart as a word. That’s just how it works for me …\n\n_Maybe actually using double overlapped letter N would solve the trick and positioning those triangles on them._\n\nI was thinking about that too – but wouldn’t that actually be an image for _im_precision?\n\n"
    },
    {
      "time": " 1.Dec.2008 1.27am",
      "content": "Thanks a lot for comments, they are very helpful.\n\nRandy - your guess is close. The availability of the domain played its role, but it wasn’t **the** deciding factor. As I said before the whole idea was to use quirky spelling as one of the logo attributes to improve its memorability. Even though it’s an unconventional approach, I still think it has a lot of merit if used in moderation.\n\nNina, Robert - I am of an opinion that lies somewhere between yours, but closer to Robert’s. When set without any visual accents, the mark reads as “Precisio Networking”, simply because Networking is easy to spot and Precisio looks like a probable proper name. For this reason I tried forcing N into the first word and assumed that borrowing N to complete ’etworking’ is an obvious thing to do.\n\nRegarding the double overlapping N. I tried few variations of this (before I started this thread) and they all looked quite busy. Re-positioning arrows above the NN would probably not help matters either. Though it’d be certainly nice to have a standalone mark as a byproduct.\n\n"
    },
    {
      "time": " 1.Dec.2008 7.15am",
      "content": "Actually, if you DO want to merge the two words, PRECISIONETWORKING works better (for met) than PRECISIONETWORKING\n\nSzabolcs\n\n"
    },
    {
      "time": " 1.Dec.2008 7.16am",
      "content": "Hey! Where did my HTML markup get lost??\n\nAnyway, if you make the N belong to networking, visually (i.e. same font weight), there is less trouble identifying the concept, IMHO.\n\nSzabolcs\n\n"
    },
    {
      "time": " 2.Dec.2008 2.37am",
      "content": "aszszelp: use \\< strong \\> .. \\< / strong \\> and \\< em \\> .. \\< / em \\> etc, for bold/italic (without the spaces).\n\n"
    },
    {
      "time": " 2.Dec.2008 1.40pm",
      "content": "Alex, I recommend you take this view that the N belongs to ’precision’ and “typographically” isn’t part of ’networking’ with a large grain of salt. Litera has a good point and I happen to agree with him. I can read it one way or the other, with the N belonging to both words.\n\nThe opinions of typophiles can be useful, with some of them even managing to be authoritative. But just because one or two typophilers say a thing is so does not make that phenomenon real, official or even half obvious to the rest of the world. Some typophilers are full of themselves and their own personal dogma, and some just aren’t very flexible. Typophile “expert” opinion is one thing, the real world and its broader perception (perception not informed mostly by looking at fonts) is something else.\n\nWhat really counts is what ordinary people think, the people who will encounter your logo on a daily basis. With this in mind, if It were my logo design I would test as few paste-ups (try variants) on people your work and do business with. You will soon find out how your design really works—for the people whose perception of it really matters.\n\nj a m e s\n\n"
    },
    {
      "time": " 2.Dec.2008 1.43pm",
      "content": "Also, the thin stroke capitals give an impression of precision as per your brief, but you may consider adding bold caps to the mix to make more friendly. If you can find matching bold caps that still give off a precision feel (not too difficult).\n\nj a m e s\n\n"
    },
    {
      "time": " 3.Dec.2008 4.47am",
      "content": "That’s definitely some good advice, and not just on Typophile - there’s been a few times that I’ve killed an early idea off because friends have given me doubts, only to go back to it later and find that I should have taken it further! That said, I personally see Precision Etworking too - the ’N’ does seem to belong to _precision_ and not _networking_ because of the weight change.\n\nRegarding using it as a domain name, I’d be careful doing this if _precisionnetworking_ is taken by someone else. Having a clever stylistic touch in a logo is one thing - but if the company’s name is ’Precision Networking’, people are not necessarily going to remember to drop an N in a URL.\n\nJust a thought - it might well look terrible, but have you tried using two Ns which overlap, one in each weight? Might lose the ambiguity - on the other hand, it’ll probably just look shit!\n\nLove the crop mark, by the way, and aside from the possible ambiguity I think this is a really tasteful wordmark. Nicely done - I’m sure the right solution is right around the corner!\n\nAndi\n\n[[semibad](http://web.archive.org/web/20090605215857/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": " 3.Dec.2008 9.08am",
      "content": "I’ll leave te mark alone as I don’t have much to add to the others comments, but as an interaction designer, I would agree with others and definitely advise against any confusing URL (i.e. precisionetworking.com). By combining the words in the URL, you are already creating an instance of user friction which will affect direct hits, and for those users who care enough to find the company, they will have to do a Google search — a definite no-no. By the time they’ve arrived at the correct URL (and likely found your competitor who already owns precisionnetworking.com), they have already spent way too much time finding you and you have an uphill battle to keep their attention and prevent bouncing.\n\n"
    },
    {
      "time": " 3.Dec.2008 9.28pm",
      "content": "Thanks for the comments, everyone. This is the sort of a feedback I was looking for. Even though it may not look like it is _very_ helpful, but it actually is.\n\nJames, I hear you regarding showing the sketches to the “ordinary people” :-) I did just that before I posted here and the feedback never focused on Etworking being hard to parse. Frankly I was surprised to see that quite a few people here couldn’t recognize Etworking for what it was. I still am actually.\n\nAndi, the domain name being misspelled is actually not as big of deal. Majority of those searching for a web site are going to skip the guessing step and head straight to Google. If the company is notable, it will be on top of the list. Regrading using NN in the middle - it doesn’t look fitting in pretty much all variations I tried. In the best case it looks like a moderately interesting mark, but I think the pointy triangles work better.\n\nPCM, regarding the use of Google when searching for the company being a definite no-no - care to elaborate ? As I just said above it seems counter-intuitive to me. I certainly agree that a straight-forward URL is always better, but I don’t think that not having it is that big of deal _if_ the company name has a top placement in a Google search.\n\n"
    },
    {
      "time": " 3.Dec.2008 10.50pm",
      "content": "Sorry if I was vague. Using Google to find a company is absolutely ok, but IME many people try a direct URL if they are repeat visitors (Company-name+.com) or if they’ve already received marketing materials either through an interactive campaign or print or mailers. If they then have to hit Google after finding your competitors page or a squatter page, you’ve already used up a valuable couple clicks of their time, and their impression is slightly affected. It might not seem like much, but when you are dealing with metrics in the tens of thousands, and trying to minimize bounce rates it can definitely make a difference. And if they Google search and a competitor or squatter is at the top with you, it’s another layer of friction (cognitive decision) for people to deal with. i know it sounds like BS but little things like that IMHO can really affect brand value and impression and ultimately translate into lower conversion rates.\n\nSo to make a short story long, I would assume that most people would not carry over the visual combination you’ve created into the URL. They would likely parse the thought: “precision+networking”. I would offer to buy precisionnetworking.com, even if it sets you back a bit. It’s a good investment.\n\np.s. I like the mark by the way — it’s a nice clean typeface and carries the concept — although I share the concerns about the potential for confusion, especially since “precisio” seems to be a somewhat popular name. I would really like to see some color get worked in.\n\n"
    },
    {
      "time": " 3.Dec.2008 10.54pm",
      "content": "By the way, I’m not necessarily saying to abandon the mark with the single “N”, just that I do think it would be helpful to get the full URL if you can.\n\n"
    },
    {
      "time": " 4.Dec.2008 12.50am",
      "content": "_I did just that before I posted here and the feedback never focused on Etworking being hard to parse._\n\nInteresting. I’m always amazed at how un-nitpicky ’ordinary people’ are :)\n\nI am sorry if I came across as too harsh; and I totally agree with Andi in the feeling that “the right solution is just around the corner”.\n\nSure I could ’recognize’ what you were trying to get at, I’m just not sure it’s good strategy. I personally feel that ’witty spelling’ would need to be both catchy and compelling to really add to the mark / name being memorable; lacking that, it just ends up being difficult to remember (just like the ’compromise’ URL probably won’t help in making it easy for potential or existing clients to find you).\n\n"
    },
    {
      "time": " 4.Dec.2008 10.05am",
      "content": "Here’s a quick concept for how to address the combination N-N in the current wordmark.\n\nDo not take this visual as a literal suggestion, as I threw it together sloppily in 30 seconds. Maybe play around with this idea using the correct typeface and a better treatment i.e more appropriate spacing, etc?\n\n ![](http://web.archive.org/web/20090605215857im_/http:/typophile.com/files/nn_rough_6624.jpg)\n\n"
    },
    {
      "time": " 4.Dec.2008 11.02am",
      "content": "You already have a strong concept with the precision marks and the I. The issue of the ’N’ is just adding too much to the mark, IMHO.\n\n"
    },
    {
      "time": " 4.Dec.2008 11.34am",
      "content": "Or maybe flip the second ’N’ to unify or ’network’ them.\n\n ![](http://web.archive.org/web/20090605215857im_/http:/typophile.com/files/NN_5235.jpg)\n\n"
    },
    {
      "time": " 4.Dec.2008 2.46pm",
      "content": "Well, I actually tried both versions you guys suggested. While it _is_ possible to make the NN look decent and unobtrusive, this turns NN into a second feature of the wordmark (in addition to the “I” ticks) and the result looks a bit too complicated.\n\nI am now (almost) convinced to drop the name mangling and just go with simple ..ION NET.. instead. I was just not sure if the accented “I” could pull the wordmark on its own.\n\n"
    },
    {
      "time": " 4.Dec.2008 3.05pm",
      "content": "sorry to muddle it up even more but what about moving the “I” ticks over to the center above the N’s, as if (like jayyy suggested) you are networking the two words. Just a thought. Have to tell you, while I’ve gotten some great feedback from here, sometimes I leave more confused than before. Take the advice and go off and do what feels right. good luck!\n\n"
    },
    {
      "time": " 4.Dec.2008 3.36pm",
      "content": "I agree with all of the suggestions. And also that it is fine as is. I don’t think it is perfect but i do think people will like figuring out the name on their own.\n\n"
    },
    {
      "time": " 4.Dec.2008 6.05pm",
      "content": "_“Andi, the domain name being misspelled is actually not as big of deal. Majority of those searching for a web site are going to skip the guessing step and head straight to Google.”_\n\nI hear you that the majority of people will head straight to Google, which is fine. But what about the minority? Put another way, shouldn’t your wordmark be in service of your client’s brand name, and not the other way around?\n\nEven assuming top rank on Google (which can _never_ be assured), if 99% of people search and find the site no problem, then 1% of people don’t, and use the URL directly. How many of those people will this affect? Is your design vignette going to improve sales or increase traffic enough to make up for that usability hit (however small)? As designers, our job is to come up with a solution which will benefit our client - (almost) everything else is secondary.\n\n_“While it is possible to make the NN look decent and unobtrusive, this turns NN into a second feature of the wordmark (in addition to the “I” ticks) and the result looks a bit too complicated.”_\n\nYeah, I can see how that would happen. But to be honest, isn’t dropping the second ’N’ purely for stylistic reasons a second feature?\n\n_“I was just not sure if the accented “I” could pull the wordmark on its own.”_\n\nI think it probably can, to be honest. It’s a very likeable mark, simple and effective.\n\nHope none of the above came across as hostile in any way, or anything other than constructive. Remember that a domain name is an important part of SEO. Someone with the ’proper’ domain name has an instant advantage - which is something to think about if your strategy is based around ranking first on Google.\n\nAndi\n\n[[semibad](http://web.archive.org/web/20090605215857/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": " 8.Dec.2008 11.31pm",
      "content": "PCM, Andi, thanks for the comments.\n\nOK, so I played with using full words and I can’t seem to make it work. Double N in the middle appears to looks visually distracting regardless of a type setting and colors.\n\nPrecision or Networking alone look pretty decent. In fact I really like the Precision one, but it is clearly not an option.\n\nAny ideas or hints ? Something to nudge me in a proper direction.\n\n ![](http://web.archive.org/web/20090605215857im_/http:/typophile.com/files/precision_4469.png)\n\n"
    },
    {
      "time": " 9.Dec.2008 1.36am",
      "content": "That really does look good by itself!\n\nAgain, might look terrible, but have you tried setting _networking_ in lowercase? That might set them apart, and let you get away with the two N’s. Just an idle thought.\n\nTake care,\n\nAndi\n\n[[semibad](http://web.archive.org/web/20090605215857/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": " 9.Dec.2008 11.57am",
      "content": "Reminds me of the Cision logo\n\n ![](http://web.archive.org/web/20090605215857im_/http:/typophile.com/files/Cision%20logo_4862.JPG)\n\n"
    },
    {
      "time": " 10.Dec.2008 11.04pm",
      "content": "eh.. that’s pushing it a bit\n\n"
    }
  ]
}
