{
  "id": "52208",
  "title": "FF Meta Sans/Serif Kerning in InDesign CS3",
  "forum": "Build",
  "tags": [

  ],
  "content": "hey all,\n\nmy work finally got FF Meta sans/serif and i love it.\n\none thing that is bothering me though is the kerning.\n\ni have a title that is set at 50pt in the bold variant, but for some reason the metrics setting make the spacing look weird to me. setting it to optics seems better.\n\nis this normal?\n\nis this an indesign or meta thing?\n\nany ideas?\n\nthanks!\n\n| Attachment | Size |\n| --- | --- |\n| [Meta\\_Kerning.pdf](http://web.archive.org/web/20081202022856/http:/typophile.com/files/Meta_Kerning.pdf) | 396.82 KB |\n\n [‹ Renaming Fonts // Cache Problems](http://web.archive.org/web/20081202022856/http:/typophile.com/node/52252 \"Go to previous forum topic\") [reaaally good font design software ›](http://web.archive.org/web/20081202022856/http:/typophile.com/node/50819 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202022856/http://typophile.com/user/8398\" title=\"View user profile.\">Simon Robertson</a>",
  "time": "<br>",
  "uid": "8398",
  "comments": [
    {
      "time": " 30.Nov.2008 9.21pm",
      "content": "Kerning is more of an art than a science. While I would say the ’oc’ pair in the Metrics sample is too loose, there are many pairs in the Optical sample that are too tight, and the ’ry’ is too loose. Remember also that text fonts are kerned for text sizes (check the samples at 11pt) and Optical spacing is best left for headlines and used with care.\n\n"
    },
    {
      "time": " 30.Nov.2008 9.55pm",
      "content": "hmmm... interesting. in this sample, i still prefer the optical overall in this sample.\n\nin the serif - the ’ry’ seems fine in both to me. and around the ’o’ seems better in the optical.\n\nin the sans - your’re right about thr ’ry’, but check out the ’om’! the optical is heaps better! even is the ’sub-head’ the ’o’ seems to cause probs for metrics.\n\nthanks stephen!\n\n"
    },
    {
      "time": " 1.Dec.2008 12.20pm",
      "content": "Not only is kerning more an art than a science, opinions differ, with few completely “right” or “wrong” answers. With really bad kerning, you might get 98 out of 100 people to agree it is bad.\n\nAs Stephen Coles pointed out, text fonts are kerned at text sizes. Moreover, foundry kerning has to assume any mix of letters. WA has to be kerned for a following “L” or a following “V”; only one value permitted in the font.\n\nThe rule at our shop (composition) is that display type must always be hand kerned. No font-based kerning can cover the all the sizes, the variations in letters used, the variations in the number of words in the title. These are all at play.\n\n"
    },
    {
      "time": " 1.Dec.2008 3.09pm",
      "content": "thanks charles. it’s clear i have a lot to learn!\n\n"
    }
  ]
}
