{
  "id": "52205",
  "title": "Home bookbinding kits & ideas?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am looking for an easy home bookbinding kit i can buy (cheap is good) or pick up at my local craft store. Any ideas? I don't really have any preference on stitching or glue or anything, just looking for some ideas to try out.\n\nThanks!  \n-Jesse\n\n",
  "author": "j_polo9",
  "time": "30 Nov 2008 — 5:27pm",
  "uid": "13221",
  "comments": [
    {
      "time": "30 Nov 2008 — 8:19pm",
      "content": "I don't know of any home kits apart from various ring binder sets. What sort of binding are you thinking of? You can make a few simple home made tools and jigs to make binding easier. If you want to know what direction contemporary hand binding is going in check out The Bonefolder newsletters [a contemporary book binders sight with lots of info: [http://www.philobiblon.com/bonefolder/index.html](http://web.archive.org/web/20150419090005/http:/www.philobiblon.com/bonefolder/index.html \"http://www.philobiblon.com/bonefolder/index.html\")  \nAlso look here for some ideas on simple and not so simple hand bound books: [http://myhandboundbooks.blogspot.com](http://web.archive.org/web/20150419090005/http:/myhandboundbooks.blogspot.com/ \"http://myhandboundbooks.blogspot.com\")  \nThere are a number of very good, easy to follow books on home made bindings using readily found and made tools. If you can provide some more specific aims then I could recommend some books.\n\n"
    },
    {
      "time": "1 Dec 2008 — 10:02am",
      "content": "Ahh very interesting, thanks for the links!\n\nI think i will want to work on some journals in the future but for now I just want to put together some very small books with normal printer paper, probably a glued spine with a bit more sturdy cover...\n\nAny ideas?\n\n"
    },
    {
      "time": "1 Dec 2008 — 3:02pm",
      "content": "Jesse, I would recommend that if you are serious about case binding then forget about those 'paper craft' style of books you will find in most bookshops and look for the titles such as \"The Thames and Hudson Manual of Bookbinding\" by Arthur Johnson. This should still be available and it has been invaluable to me (I am a bookbinder). Another smaller & cheaper book by Johnson is \"The Practical Guide to Craft Bookbinding\". Craft in this context refers to hand made books using traditional hand tools as opposed to the use of machines as in contemporary mass production. When I was in college we were tutored in hand tools and traditional binding first before commercial binding.  \nBoth books offer clear easy to follow instructions with excellent illustrations. All tools are easy to get or make yourself. Another good book if you can get it is \"Bookbinding as a Handcraft\" by Manly Banister (Stirling publishing NY). This book uses B/W photos which are not always clear, however it does have instructions and diagrams for making your own tools including a home made nipping press.  \nThe bookbinders bible in my day was \"Bookbinding its background and technique\" by Edith Diehl in two volumes, but also available in a paper back single volume. But for those just starting I would suggest the Johnson books.\n\n"
    },
    {
      "time": "1 Dec 2008 — 3:36pm",
      "content": "Ahh, this brings back memories. There used to be a great Soviet book-binding kit in the late eighties / early nineties. Compact, versatile and inexpensive. Haven't seen anything comparable since then.\n\n ![](http://web.archive.org/web/20150419090005im_/http:/typophile.com/files/05602_5109.jpg)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20150419090005/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    },
    {
      "time": "2 Dec 2008 — 8:00am",
      "content": "ahh thanks, I purchased The Practical Guide to Craft Bookbinding. It may be more in depth than what i was searching for but I find it fascinating to learn about a craft for which I have no current knowledge!\n\n"
    },
    {
      "time": "3 Dec 2008 — 1:02am",
      "content": "_“...I just want to put together some very small books...\"_\n\nIf you mean small trim sizes, you might be interested in [ZoomAlbum.net](http://web.archive.org/web/20150419090005/http:/www.zoomalbum.net/what_is.php).\n\nAlso, although it takes away the fun and pride (or sorrow and shame) of doing your own binding, you might take a look at [Blurb.net](http://web.archive.org/web/20150419090005/http:/www.blurb.com/).  \n&nbsp;  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ~~~~~~~~~~~~~~~~~  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_When going from A to Z,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;I often end up At Oz._\n\n"
    },
    {
      "time": "3 Dec 2008 — 5:27am",
      "content": "[http://www.nytimes.com/2008/12/03/nyregion/03library.html?\\_r=1&scp=4&sq=...](http://web.archive.org/web/20150419090005/http:/www.nytimes.com/2008/12/03/nyregion/03library.html?_r=1&scp=4&sq=%24126,000&st=cse \"http://www.nytimes.com/2008/12/03/nyregion/03library.html?\\_r=1&scp=4&sq=%24126,000&st=cse\")\n\n...shows what can be done on the up-side of this market.\n\nCheers!\n\n"
    },
    {
      "time": "4 Dec 2008 — 4:49pm",
      "content": "Talas ( [http://www.talasonline.com](http://web.archive.org/web/20150419090005/http:/www.talasonline.com/ \"http://www.talasonline.com\")) has some interesting kits, and with their impending move to Brooklyn, may well start discounting them -- they have almost everything else.\n\nI also recommend the first three books by Alisa Golden as good primers for beginning bookbinders: Graham beat me to the punch in suggesting The Bonefolder, although it does tend to be geared more towards \"serious\" bookbinding and book artists.\n\n(That being said, Peter actually published a picture of one of my books -- in Vol. 5, No. 1, which is the current issue -- and I don't think it's all that serious a book.)\n\n"
    },
    {
      "time": "5 Dec 2008 — 6:44pm",
      "content": "You need:\n\nawl  \nbeeswax  \ntwine  \n(can substitute twine and beeswax for dental floss)\n\n"
    }
  ]
}
