{
  "id": "52202",
  "title": "Mathcing type face",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI'm George, new to typophile. I know little about typography and I find this site very useful.\n\nI don't generally make logos, I do one or two every year. This year a friend of mine asked for one and left me with a pretty open brief: the company's name is zoo station, they import hardware and sell it.\n\nI had a lot of ideas about, zoo, animals, africa, stations, technology, computers, etc.\n\nOf all my proposals they chosen this one:\n\n[http://flash.quietroot.org/zs/ZooStation\\_3a.jpg](http://web.archive.org/web/20131023133015/http:/flash.quietroot.org/zs/ZooStation_3a.jpg)\n\nI don't know if I made the right choice when it comes to chosing the right type face.\n\nI made this choice:\n\n[http://flash.quietroot.org/zs/ZooStation\\_3\\_final.jpg](http://web.archive.org/web/20131023133015/http:/flash.quietroot.org/zs/ZooStation_3_final.jpg)\n\nI don't know wether it helps the logo graphic or not.\n\nAny tips will do.\n\n",
  "author": "orgicus",
  "time": "30 Nov 2008 — 9:40am",
  "uid": "40186",
  "comments": [
    {
      "time": "30 Nov 2008 — 12:06pm",
      "content": "You used a soft, humanistic typeface with a sharp, angled and blocky mark. The type contradicts or contrasts with the mark, which ever way you want to look at it. If you want to use Myriad try different layouts (bolder, lighter...) also tighten up the letter spacing a little. Conventional wisdom dictates that the two elements either contrasts or compliments each other.\n\nOf course their are many humanistic sans that could replace Myriad...Or you can try to match the style of the mark with a sharp, rugged and utilitarian typeface. Either way I like that you gave the mark and type the same importance.\n\nJonE.\n\n"
    },
    {
      "time": "30 Nov 2008 — 2:57pm",
      "content": "As has been said ... the two aren't sitting together at all.\n\nthe icon/mark needs more work too. the basic concept can work ... it's just missing some legibility.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131023133015/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20131023133015/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "1 Dec 2008 — 12:03pm",
      "content": "Thanks for your feedback, much appreciated. I will try a few of the usual sans ( Gill Sans, Univers, that area ) and see what I can get out of it. Something was bugging me about the choice in font, but I couldn't point the finger.\n\nThanks again.\n\n"
    }
  ]
}
