{
  "id": "52242",
  "title": "Talking Heads",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello guys and gals\n\nA friend pointed me to this forum and it seems like you can get quite a bit of good critique here. I recently made a logo for a company that does ghostwriting, helps companies with social media and tracks brand mentions for other companies.\n\nWondering what you guys think!\n\n(Logo and business card design for now)\n\n ![](http://web.archive.org/web/20081208085214im_/http:/typophile.com/files/talkingheads_6384.gif)\n\n[Talking heads (.png)](http://web.archive.org/web/20081208085214/http:/www.wolfslittlestore.be/dump/talkingheads.png)\n\n [‹ Business Card Critique](http://web.archive.org/web/20081208085214/http:/typophile.com/node/52313 \"Go to previous forum topic\") [Interaction/Industrial Design Studio Logotype ›](http://web.archive.org/web/20081208085214/http:/typophile.com/node/52171 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081208085214/http://typophile.com/user/40218\" title=\"View user profile.\">Wolf</a>",
  "time": "<br>",
  "uid": "40218",
  "comments": [
    {
      "time": " 1.Dec.2008 1.51pm",
      "content": "I think their business name might have some heavy lifting to do to overcome what most folks think of first when they hear Talking Heads.\n\nBut, given that, the mark is interesting, if perhaps a bit abstract.\n\nNot sure what I think about the super-tight tracking. I think I like it.\n\n"
    },
    {
      "time": " 2.Dec.2008 3.47am",
      "content": "Yes, the business name is a bit of a problem, since there is a computer/human experiment called Talking Heads, a music band called Talking heads, and they are two non-unique english words. But that’s the company’s choice :).\n\n"
    },
    {
      "time": " 2.Dec.2008 6.46am",
      "content": "The extended, connecting serifs work pretty well. Without benefit of serifs to connect them, the straight-to-curve NG and curve-to-curve DS look too close.  \nFor the mark, I see a head but I don’t see it talking...  \nThe bold font on the info in white gets kind of clogged, though you’d have to see it in print to judge.\n\n"
    },
    {
      "time": " 2.Dec.2008 9.03am",
      "content": "I don’t like the weight differences between Talking and Heads. They either need to be the same (probably my preference) or more contrasting than they are at the moment.\n\n"
    },
    {
      "time": " 3.Dec.2008 12.02pm",
      "content": "agree with aluminum. more contrast or none at all in the large type. the connecting serifs could be a nice idea but unfortunately you have letters that don’t work well with this application. i’d nix it? i like the narrowness of the type with the narrowness of the mark. feels right looking at it at this size\n\nw|m\n\n"
    }
  ]
}
