{
  "id": "52256",
  "title": "17 & looking to buy a new font...suggestions?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi, I'm 17 and I just came into some money that I'd like to use (partially) to buy a new font for my Mac. I've only bought a couple of fonts before but I download a lot from free websites. I am kind of a font maniac, as most of you probably are, I can identify almost any font from sight and have trouble reading books in fonts I dislike.\n\nAnyway, some of my favorite fonts are: Adobe Garamond, Granjon, and Caslon. I like really classic fonts with nice rounded question marks and apostrophes, and if something's too off or weird about a font I have trouble writing long things in it (I'm a novelist). For instance, I have Deepdene on my computer and I thought I would love it, but it's just too quirky for me.\n\nI'd love some suggestions about what I could buy that's similar to the fonts I like, but a little bit different. I was thinking Sabon, but I'm not sure. Any thoughts? Please, give me some of your fontaholic expertise!\n\n- Molly\n\n",
  "author": "southeasttitan",
  "time": "1 Dec 2008 — 4:36pm",
  "uid": "40236",
  "comments": [
    {
      "time": "1 Dec 2008 — 5:46pm",
      "content": "How about [Corundum](http://web.archive.org/web/20131018053019/http:/www.dardenstudio.com/typefaces/corundum_text)?\n\n"
    },
    {
      "time": "1 Dec 2008 — 5:58pm",
      "content": "Do you have a program like InDesign or Quark to make full use of your fonts? If not, the student pricing on InDesign is similar to the price of a nice font family, and I think you'd enjoy it. Also, at least InDesign CS2 let you get Garamond Premiere Pro for free once you registered it.\n\nAdobe's Type Collection for Students is a good deal as well--quite a few good families in it.\n\nOther typefaces you might like: Baskerville (I like Storm's Baskerville 10 Pro the best), LTC Caslon (a nice Caslon), Minion Pro (has a very rounded question mark--I think it comes in the Type Collection for Students), and Bembo Book\n\n-Justin\n\n"
    },
    {
      "time": "1 Dec 2008 — 6:03pm",
      "content": "Personally I love [Dolly](http://web.archive.org/web/20131018053019/http:/www.underware.nl/site2/index.php?id1=dolly&id2=overview) from Underware (or [here for a pdf](http://web.archive.org/web/20131018053019/http:/www.underware.nl/site2/index.php?id1=dolly&id2=pdf)). I use it regularly, and it works beautifully for book typography, plus it is quite affordable.\n\nIf I had the money or a good project for it, I would also buy [Fresco](http://web.archive.org/web/20131018053019/http:/www.fontshop.com/fonts/singles/ourtype/fresco_lf_normal/) from OurType.\n\nIf you like classic fonts, take a look at [Requiem](http://web.archive.org/web/20131018053019/http:/www.typography.com/fonts/font_styles.php?productLineID=100020) from Hoefler & Frere-Jones. Also quite afforable.\n\nI've also been looking at DSTYPE's [Capsa](http://web.archive.org/web/20131018053019/http:/www.dstype.com/capsa.html). Yet again, very afforable.\n\n[Augustin](http://web.archive.org/web/20131018053019/http:/www.ludwiguebele.de/item.php/Typefaces/Text/Augustin) also seems quite nice, but more angular.\n\nFeliciano Type Foundry has [Rongel](http://web.archive.org/web/20131018053019/http:/www.felicianotypefoundry.com/main/?page_id=22), which is also a nice classic typeface (unfortunately only Type 1 format).\n\nIf you want a real classic looking face, [Jannon](http://web.archive.org/web/20131018053019/http:/www.stormtype.com/typefaces-fonts-shop/families-21-jannon) from StormType could be interesting.\n\nFor more suggestions, check out the [Choosing a font for book design?](http://web.archive.org/web/20131018053019/http:/typophile.com/node/39592)-thread.\n\n"
    },
    {
      "time": "1 Dec 2008 — 6:11pm",
      "content": "Thanks guys! These are great ideas, I'm still undecided but it'll help!\n\n"
    },
    {
      "time": "1 Dec 2008 — 7:24pm",
      "content": "One vote for Storm’s Walbaum as well. And, have a look at MVB Verdigris—the more I look at it the more I like it.\n\n"
    },
    {
      "time": "2 Dec 2008 — 6:42am",
      "content": "Are you only looking for serif faces?\n\n"
    },
    {
      "time": "2 Dec 2008 — 8:09am",
      "content": "Yes, Serif.\n\n"
    },
    {
      "time": "2 Dec 2008 — 9:01am",
      "content": "A 17 year old novelist who has an affinity for fonts and extra money?\n\nGo away before we all get serious inferiority complexes.\n\n;o)\n\n"
    },
    {
      "time": "2 Dec 2008 — 9:16am",
      "content": "Check some of the free font threads.\n\n"
    },
    {
      "time": "2 Dec 2008 — 10:48am",
      "content": "Your favourites are original old-styles.  \nMight I suggest [Montype Bulmer](http://web.archive.org/web/20131018053019/http:/www.fonts.com/findfonts/detail.htm?pid=202823) as being next in line chronologically, if not Baskerville.\n\nStaying closer to what you like, Robert Slimbach (who redesigned Garamond for Adobe twice) has produced two new designs in the classic old style vein, Minion and Arno. Arno Pro is his final word (so far) on the genre, a face of truly awesome scope.\n\nIf you are interested in sophisticated book typography, being able to handle such things as footnotes--with special glyphs for superior figures, and optically scaled type for the smaller text at the bottom of the page or the back of the book--then you need this kind of Pro (OpenType font). So I would concur with Justin that the route to take is via InDesign, which will enable you to set proper typography, and which comes with Arno bundled, AFAIK.\n\n"
    },
    {
      "time": "2 Dec 2008 — 1:14pm",
      "content": "take a look at [Mrs. Eaves!](http://web.archive.org/web/20131018053019/http:/www.emigre.com/EF.php?fid=109)\n\n"
    },
    {
      "time": "2 Dec 2008 — 3:32pm",
      "content": "Mrs. Eaves... not really appropriate for books or longer stretches of text in general.\n\n"
    },
    {
      "time": "2 Dec 2008 — 10:03pm",
      "content": "What a nice read.I wish I was that wise, clever and trying to do the right thing at 17.  \nI wish you all the good fortune you receive Molly.  \nYou're a legend.  \nHope you grab a font you really love.  \nCheers  \nDrj\n\n"
    },
    {
      "time": "3 Dec 2008 — 3:40pm",
      "content": "Hi guys! I ended up going with Requiem, which I absolutely love (especially the question marks)! I just turned in my linguistics paper in it. Thanks to everybody for being so helpful and nice!\n\nAs a side note, I recognize Mrs. Eaves from a series of young adult novels I read...I love the font, but I remember thinking it was a strange choice for 400 some pages too. Haha.\n\nMolly\n\n"
    },
    {
      "time": "3 Dec 2008 — 7:31pm",
      "content": "you go gurl!\n\n"
    },
    {
      "time": "4 Dec 2008 — 3:15am",
      "content": "Requiem, a good choice. Glad I could make a good suggestion. ;)\n\nI think it's an excellent typeface. I was thinking about purchasing it as well, for a book project I'm working on, I only hate the fact that it doesn't have a bold weight. Which I need for the book.\n\n"
    },
    {
      "time": "5 Dec 2008 — 9:21am",
      "content": "Nick & Molly:\n\nArno Pro is indeed bundled with InDesign CS3, but is not being bundled with CS4.\n\n"
    },
    {
      "time": "5 Dec 2008 — 5:30pm",
      "content": "IIRC Arno was not bundled with CS3. It was a registration incentive option.\n\nEdit: Arno was bundled with CS3, it was Hypatia that was the registration incentive.\n\n"
    },
    {
      "time": "6 Dec 2008 — 7:28pm",
      "content": "Now that you've made your selection --\n\nI notice that you have both Adobe Garamond and Granjon, and were thinking about Sabon. These are all based on <cite>Garamont</cite> or <cite>Garamond</cite> fonts. The Adobe Garamond is probably the best in PostScript digital format. In metal -- there was no Adobe of course -- the Granjon was probably superior. Sabon was a compromise, designed by Tschichold so that the same letterforms could be set by hand, and by either the Monotype machine or the Linotype linceaster. It was an admirable & beautiful compromise; well worth it. And as things turned out, it was also one of the best fonts for the early Linotype digital photocomposers, such as the Linotron 202. For reason none of us completely understand, Sabon didn't fare so well in the conversion to PostScript. Sabon \\*Next\\* isn't really the Tschichold font, simply another Garamond revival.\n\nThe point of all this is that type is used to put ink on paper, and what the ink is, the paper is, and the method of applying it all have a considerable effect on what looks good.\n\nSo pay attention to how your fonts look when printed on the inkjet or laser printer, and how the same fonts look when printed offset, especially the Trade edition of the book (before the mass market edition). This is just knowledge, so if you wind up a successful novelist, you aren't pestering the publisher to use a font that looks good on your laser printer, but is rather less successful when printed offset.\n\nAnd if you find your interest in fonts runs deeper than that, you might consider purchasing a font editing tool like FontLab. You can then work over fonts -- at least, those where the license permits -- to your own taste and needs. Adobe allows this.\n\nWhether your interest in type remains one of appreciation or grows larger, good luck to you.\n\nCharles\n\n"
    },
    {
      "time": "8 Dec 2008 — 10:40am",
      "content": "Molly:\n\nCharles' comment about paper, ink, and press is very solid. Spend some time in bookstores looking at new books—ones that identify the typefaces—and the paper they were printed on, and then at books from other eras.\n\n& since you are in Minneapolis, I invite you to visit the Minnesota Historical Society Press at the Minnesota History Center in Saint Paul. I'm Design & Production Manager there, and I can show you quite a few recent typefaces and how they print on various kinds of stock.\n\nwilliam[dot]powers[at]mnhs.org\n\npowers\n\n"
    }
  ]
}
