{
  "id": "52281",
  "title": "How to make a pdf open in full screen?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all\n\nDoes anyone knows how can i make a pdf open automatically in full screen mode?  \nI assume that it's done trought acrobat, but i counld't find how to...\n\nThanks in advance  \nRegards\n\n",
  "author": "kiko",
  "time": "2 Dec 2008 — 8:28am",
  "uid": "17987",
  "comments": [
    {
      "time": "2 Dec 2008 — 8:40am",
      "content": "I can only tell by rough transaltion from my german Adobe Acrobat:\n\nOpen File:Properties (CTRL+D/Apple+D)  \nGo to »View at Start« or something like this …\n\nThen there are »windows-options«:  \n»Open in Full Screen« or something like that.\n\nPress OK.\n\n"
    },
    {
      "time": "2 Dec 2008 — 8:42am",
      "content": "It's under Properties in the File menu. Go to the \"Initial View\" tab and you'll see all the options you need.\n\n"
    },
    {
      "time": "2 Dec 2008 — 8:47am",
      "content": "Just as an outsider providing a personal opinion - and who views PDFs of all different types for countless different reasons - I absolutely cannot stand when I've received a pdf that hijacks my computer and automatically opens in full screen because invariably I then have to find my keyboard, hit \"esc\" and hope I don't spill anything in the process. Not to mention I'm too lazy to see if there's a way I could prevent these things from automatically taking over my screen. That's just my two cents, which in today's market is worth more like slightly under a penny. I would just suggest taking into consideration how some might react to having their screen all but taken over by any potential presentations you're attempting to ... um ... present.\n\n"
    },
    {
      "time": "2 Dec 2008 — 9:00am",
      "content": "^ That's why I don't even install acrobat reader on my Mac.\n\n"
    },
    {
      "time": "2 Dec 2008 — 11:16am",
      "content": "This was possible prior to OS-X, but Apple now subverts the opening of Acrobat files in Acrobat, using its own lesser-featured Preview as the default PDF-viewing application. Shame.\n\n"
    },
    {
      "time": "2 Dec 2008 — 11:21am",
      "content": "Nick, this is not true…\n\nYou can determine (on a per document-basis, as well as) systemwide which application will be used with certain file types.  \nIn your case. Select a PDF in the Finder. Open its info panel (Command-I).  \nChange the default program in the “Open with\" drop-down. Click “Change All…”.\n\nEasy peasy.\n\nOTOH Preview is a far better behaving program when you need to print your PDF. Acrobats dialogs are hidden in a maze of possibilities.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "2 Dec 2008 — 11:49am",
      "content": "Bert, it is true.  \nThe person making a PDF file can specify in Acrobat that it should open in full screen mode, but that won't happen on a Mac unless the user changes the default.\n\n"
    },
    {
      "time": "2 Dec 2008 — 1:49pm",
      "content": "<cite>but that won’t happen on a Mac unless the user changes the default.</cite>\n\nIs that true?  \n...Not good, this pdf will probably be opened mainly by Mac users...\n\nCheers\n\n"
    },
    {
      "time": "2 Dec 2008 — 2:01pm",
      "content": "\"using its own lesser-featured Preview as the default PDF-viewing application. Shame.\"\n\nShame? Nah...feature!\n\nI put Acrobat Reader in the same camp as Norton...the cons far outweigh the pros of the applications.\n\n"
    },
    {
      "time": "2 Dec 2008 — 2:31pm",
      "content": "I make it a practice to have multiple PDF viewers because, especially when dealing with Linux-using clients you need to see how a PDF will render in multiple programs. It's almost like browser wars for a while there, some didn't support transparency, some didn't show certain effects.\n\nI'm typically not a big fan of proprietary solutions that give the creator all of the power and not the user. Like you called it, it is _hijacking_ and if your first impression of a file is a bad one, that really sets the mood for the whole thing.\n\nIt's like when you go to a horrible flash website and their stupid ambient techno loop clashes with your beautiful Nine Inch Nails playing in iTunes and you end up having to pause your wonderful song because they didn't have the knowledge or foresight to put a _mute music_ button on the site.\n\nA solution I would consider if I was putting a PDF online or sending to multiple users instead of presenting on my own machine, is to save the PDF as normal and give them advanced warning. As much as I hate splash pages, it would be far more courteous to have a splash page that said something like, _This project is designed to look best when viewed fullscreen. Press **Control-L** or **Command-L** to enter fullscreen and press **esc** to return to your desktop. Enjoy!_\n\n"
    },
    {
      "time": "2 Dec 2008 — 2:57pm",
      "content": "I was just commenting about the ability to change the default viewer for PDF’s on a Mac ; -)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "2 Dec 2008 — 3:16pm",
      "content": "Do not make something go fullscreen without asking the user about it first.\n\nThe only thing a fullscreen PDF will make people do, is hit esc, or just close the file alltogether.\n\nMight as well just skip that step, and don't do fullscreen.\n\n"
    },
    {
      "time": "2 Dec 2008 — 7:37pm",
      "content": "Yes it makes sense, I'm will probably skip the auto full screen idea.  \nAt least I got to know how it's done...\n\nThanks for all opinions and help.\n\nRegards\n\n"
    },
    {
      "time": "4 Dec 2008 — 2:29pm",
      "content": "You could add a button on the first page so the user could choose to open the PDF full screen. If they don't click it, it stays in whatever view you defined in the document properties. Then on the last page, you'd put another button to drop out of full screen mode. See [http://typophile.com/node/40961](http://web.archive.org/web/20150225002848/http:/typophile.com/node/40961 \"http://typophile.com/node/40961\") for info on how to create buttons with actions.\n\n"
    }
  ]
}
