{
  "id": "52318",
  "title": "Bad shop signage - but what makes it bad?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi typophiles.\n\nI am doing a school project on bad shop signage, and that is a huge area, since almost every shop sign is terribly designed (At least i southeast London where I live).\n\nI have been collection research material in the form of photographs of several hundreds of signs, which I have analyze.  \nI have created a list of certain errors that are often seen in shop signs. I have my own thoughts on why the errors are errors, but I am sure that you guys know so much more about typography than me.\n\nThe list is as follows:\n\nUse of capital letters only\n\nUse of 2 or more contrasting colors - Red, blue, green, yellow\n\nWarping effects - you know those wavy effects etc.\n\nUse of clipart\n\nUse of shadow effect, outline/stroke effect, and diagonal effects\n\nCompressed texts\n\nSeveral typefaces\n\nWrong letter spacing/word spacing\n\nMaybe you can contribute to an explanation of why these errors are actual errors. I know the obvious reasons but maybe  \nyou guys have a different take on it? I am waiting in excitement :-)\n\n",
  "author": "Lasse Kristensen",
  "time": "3 Dec 2008 — 8:13am",
  "uid": "40074",
  "comments": [
    {
      "time": "3 Dec 2008 — 8:17am",
      "content": "If you want to see photos of signs, here is the link [http://flickr.com/photos/32480523@N02/sets/72157609709927694/](http://web.archive.org/web/20120415130550/http:/flickr.com/photos/32480523@N02/sets/72157609709927694/ \"http://flickr.com/photos/32480523@N02/sets/72157609709927694/\")\n\n"
    },
    {
      "time": "3 Dec 2008 — 8:50am",
      "content": "I think if you could find out who put the sign up, who designed it, and you were able to look into their practice and or design education, you would probably fin that these signs weren't made by designers at all...\n\n"
    },
    {
      "time": "3 Dec 2008 — 9:07am",
      "content": "I think you're right about that. I talked to a \"proper\" sign maker who told me, most sign makers are just sign makers and not sign designers. It's all about getting money from the client and they really don't think about the quality of the sign.\n\n"
    },
    {
      "time": "3 Dec 2008 — 9:22am",
      "content": "I don’t see many examples in your photos, but what’s really been bugging me lately are designers who think they’re doing a great job by using a really great book face for signage. A book face that works at ten points looks as chunky as Cooper Black when it’s three feet tall. Anyway…\n\n_Use of capital letters only_\n\nNot necessarily bad if the type is well-chosen and tracked appropriately. Unfortunately most signshops use the blackest faces around and track them like it’s 1979.\n\n_Use of 2 or more contrasting colors - Red, blue, green, yellow_\n\nThis one tends to look really tacky because the intense colors call attention to cheap materials and poor workmanship.\n\n_Warping effects…Use of clipart…effects_\n\nBlatant evidence of cutting corners. Why pay someone to think when the letters can wave with a mouseclick?\n\n_Compressed texts_\n\nBad because they’re always used in all caps and set too tight, turning them into a block of vertical lines.\n\n_Several typefaces_\n\nThis is another trick used to cut corners. Don’t be creative, just let the fonts do the work!\n\n_Wrong letter spacing/word spacing_\n\nImpairs readability and looks like someone wasn’t really thinking about the work.\n\nAnd as for who makes the signs, just watch job listings for these positions. You’ll see plenty of software experience requirements, and none even ask for a strong portfolio.\n\n"
    },
    {
      "time": "3 Dec 2008 — 9:38am",
      "content": "Thank you James, that was exactly the kind of feedback I was hoping to get :-) I appreciate your help.\n\n"
    },
    {
      "time": "3 Dec 2008 — 9:59am",
      "content": "Don't forget massive grammar failure. The use of straight keyboard marks instead of proper apostrophes and quotation marks is bad design, but it is compounded when those marks shouldn't be there at all.\n\n"
    },
    {
      "time": "3 Dec 2008 — 10:03am",
      "content": "Something else I probably should have brought up: seriously consider the possibility that some shop owners and signmakers know that their signs are crap, and make them that way on purpose. In a working-class neighborhood putting up a great sign might make a business seem haughty or expensive. Similar things happen in advertising: rock bands pay designers to give them the ”authentic” look of the indie music scene, government contractors and discount stores demand that their advertising look cheap to convince people that the money is really being spent elsewhere, etc.. You might try asking shop owners if they’re just trying to fit in.\n\n"
    },
    {
      "time": "3 Dec 2008 — 10:31am",
      "content": "_You might try asking shop owners if they’re just trying to fit in._\n\nBut be sure to don a goalie mask first, lest you catch a solid poke in the nose. ;)\n\n"
    },
    {
      "time": "3 Dec 2008 — 11:15am",
      "content": "So it's like an evil design circle almost :-) One make a bad design and the other people follow to fit in\n\n"
    },
    {
      "time": "3 Dec 2008 — 11:35am",
      "content": "I sometimes suspect that signmaker's who use apostrophe's in their plural's get paid by the character.\n\n"
    },
    {
      "time": "3 Dec 2008 — 12:22pm",
      "content": "I agree with James.  \nSame here in good old New Zealand (well some of the places anyway).  \nIt's also called the Tall Poppy Syndrome -  \ntry to stand out and you get cut off  \n [http://en.wikipedia.org/wiki/Tall\\_poppy\\_syndrome](http://web.archive.org/web/20120415130550/http:/en.wikipedia.org/wiki/Tall_poppy_syndrome \"http://en.wikipedia.org/wiki/Tall\\_poppy\\_syndrome\")\n\n"
    },
    {
      "time": "3 Dec 2008 — 12:55pm",
      "content": "<cite>I sometimes suspect that signmaker’s who use apostrophe’s in their plural’s get paid by the character.</cite>\n\nThey probably just went to the same crummy public schools that I did.\n\n"
    },
    {
      "time": "3 Dec 2008 — 1:59pm",
      "content": "Hermann Zapf wrote an essay about this. One of his points, I remember, is that most shop signs are just too big.\n\n"
    },
    {
      "time": "3 Dec 2008 — 2:10pm",
      "content": "<cite>One of his points, I remember, is that most shop signs are just too big.</cite>\n\nVery true. People try using size to make signs readable at distance, but forget that in urban environments people seeing a sign from far away are often at a sharp angle and cannot read it anyway.\n\n"
    },
    {
      "time": "3 Dec 2008 — 6:19pm",
      "content": "Once upon a time... Not to wax too nostalgic on how it was \"always better in the old days\", but Once upon a time signs were made by people who had trained for many years to learn the skills of painting signs, and when they weren't designed by the sign painters themselves, they were designed by professional designers. There was no other way, unless you were going to make the sign yourself. Then along came desktop publishing and vinyl plotters,and anyone who could afford the equipment could become a \"sign maker.\" people with absolutely no graphics background at all could get work by charging less than they guy down the street who knew what he was doing.\n\n@ james: Graphic design is communcation. A Crazy \"Joe's Discount Carpet\" sign is going to look different from an up-scale Presian rug store's sign, and if Crazy Joe's sign is a little loud and crass, that would be appropriate,, and wouldn't necessarily entail bad or artless design.\n\n"
    },
    {
      "time": "3 Dec 2008 — 6:44pm",
      "content": "William\n\nCan you please site this essay by Hermann. Thank you.\n\n@ James... I doubt that those signmakers paid any more attention in those lousy public schools than you or I did : ) I did not start \"paying attention\" until I found letters!\n\nMichael\n\n"
    },
    {
      "time": "3 Dec 2008 — 7:59pm",
      "content": "[This book](http://web.archive.org/web/20120415130550/http:/www.amazon.com/Hermann-Zapf-design-Philosophy-Bibliographical/dp/B000WW4H5U/ref=sr_1_11?ie=UTF8&s=books&qid=1228363014&sr=8-11), I think. I had it from a library and it is since returned so I can't be sure.\n\n"
    },
    {
      "time": "3 Dec 2008 — 8:21pm",
      "content": "Thought I remembered it.. less about size of the companies and more about \"design illiterates\" (his words) as is the case in much of the DTP. Finish your Caslon and let them hack it to death on signs : )\n\nI am more concerned with the new illiterate individual \"sign franchise owner\" than the established \"houses\" of ANY size!\n\nEdit: design challenged may be better than illiterate! And boy am I dumb... I thought you guys were saying the shops were too big. Are you in fact saying the signs are too big? I am confused... let me read again.\n\nMichael\n\n"
    },
    {
      "time": "3 Dec 2008 — 8:36pm",
      "content": "Yes guys, I read your posts wrong and he does speak of restricting proportion. I am duly self admonished. A bit of dyslexia involved, I saw sign shops instead of shop signs.\n\nMichael\n\n"
    },
    {
      "time": "4 Dec 2008 — 9:01pm",
      "content": "Here's an example for ya...\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/sane-tech_3753.jpg)\n  \nWhy would a computer store would use a calligraphy font and brush script (shudder)? The owners were Asian foreigners; I'm guessing the signmaker created this using his own taste, and they thought it looked slick. They've since gone out of business. \n\nI guess it is slick compared to this, in the same neighborhood:\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/trift_5424.jpg)\n  \nObviously this poor guy had NO money for a sign.  \nHe's gone out of business, too. \n\nNow this one really is slick for White Center (the same hood for which I am trying to design a logo for their summer festival, asking for feedback in another design thread). I can't decide if I hate this, but it does seem to attract the target audience - this is a popular raucous nightclub.\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/evolucion_3893.jpg)\n\nAnd here's a special treat, something I photographed last Christmas. The owner created a quaint, nostalgic Christmas display in the window of his \"adult superstore.\" I knew  \nno one would believe this without the photo as evidence.\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/xxnativity_3705.jpg)\n\n"
    },
    {
      "time": "4 Dec 2008 — 11:11pm",
      "content": "mcdonalds at the orange county (CA) airport\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/styx_5228.jpg)\n\n"
    },
    {
      "time": "5 Dec 2008 — 12:04am",
      "content": "<cite>over-extended ligature</cite>\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/100_1684_5394.jpg)\n\n"
    },
    {
      "time": "5 Dec 2008 — 12:22am",
      "content": "@beejay  \nHa! Zen Buffet. I always laugh when passing this place and seeing that awful swipe.\n\n"
    },
    {
      "time": "5 Dec 2008 — 12:23am",
      "content": "<cite> letter omission </cite>\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/100_1818_3599.jpg)\n\n"
    },
    {
      "time": "5 Dec 2008 — 12:33am",
      "content": "<cite> (left) mixing serif and sans indiscriminately </cite>\n\n<cite> (right) poor font choice :/ </cite>\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/100_1670_6238.jpg)\n\n"
    },
    {
      "time": "5 Dec 2008 — 3:05am",
      "content": "Hi\n\nYour project sounds like areally good one to work on and with so many awful signs out there, you have the subject matter to make it great.\n\nI'm sure that much of the horror we see in our streets is a result of signage not being in anyones budget, resulting in 'expensive' designers being cut out of the equation ( a false economy).\n\nMany signwriters I've come into contact with just don't have any care for the personality, or era a font has come from, resulting in horrible clashes of typefaces seen in the examples above. If I were you, I'd grab a copy of 'The Elements of Typographic Style' by Robert Bringhurst. This has some brilliant advice on matching fonts and will allow you to critique the BAD signage.\n\nAs with logo design, there should always be clearspace around the lettering of your signage. In my experience, this is what can make even a fairly good sign look awful. The examples above illustrate this perfectly, with the signs being cropped just inches after the type. Everything is cramped and probably due to the fact that if they've paid for something that size, they want something on every square cm! Again a false economy.\n\n"
    },
    {
      "time": "5 Dec 2008 — 3:44am",
      "content": " ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/Head_5812.jpg)\n  \nAs you can see, this shop appears to sell heads, or some sort of personal service. It is very poorly letterspaced, in a font that won't be legible at distance and with the type far too close to the edge of the sign.\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/Bad%20sign_5081.jpg)\n  \nThis sign is cramped also, with none of the typography conforming to any sort of grid. Poor hierarchy and placement take the viewers eye to the centre first, then to the left and down. 'Stationery' is spelled incorrectly, unless they mean that their fancy goods and bedding literally stand still. This becomes a good selling point if it is true.\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/Funny_4319.jpg)\n  \nI don't think that I need to point out why this amuses me. Again, there is not enough room around the type. In my opinion this affects legibility a lot.\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/Chinese%20sign_6408.jpg)\n  \nAnother amusing one - this undersells itself quite a bit. Quite an odd font choice for this one I think. Again the clear space around the font is lacking and letterspacing on f o o d is horrible. Colourchoice also is rather odd for a Chinese Takeaway. The yellow makes it look awful.\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/Sign_5947.jpg)\n  \nI actually quite like this one. The slab serif gives the feel of the wild west. There has been a lot in the media about the stray apostrophe in signage and here is one of the little blighters in DVDs.\n\nPair up a good designer with an architect and bad signage would be a thing of the past. I must admit that without pointing out all of the bad signage on my days out, I would have no reason to leave the house.\n\nI hope some of this helps you on your project and good luck with it.\n\n"
    },
    {
      "time": "5 Dec 2008 — 11:48am",
      "content": "<cite>consider the possibility that some shop owners and signmakers know that their signs are crap, and make them that way on purpose.</cite>\n\nJames, I really hope this is not true. Bad signage is something that bothers me every day. I find it really irritating that sign shops make such crap daily that they know will be in public view for many years. As a customer of a sign shop the very least you should expect is good typography and grammar. Unfortunately, the average customer lacks all of these skills and buys solely on price.\n\nWhat is the answer?\n\n"
    },
    {
      "time": "5 Dec 2008 — 1:08pm",
      "content": "“Unfortunately, the average customer lacks all of these skills and buys solely on price.\n\nWhat is the answer?”\n\nZoning regulations. When I was in Alaska I went through Ketchikan, a Klondike gold-rush era town turned tourist trap. Zoning laws require all signage to be hand—painted in historically accurate styles. It sounds cheesy, but it looked a hell of a lot better than many contemporary urban streets. I’ve been through a town with similar requirements in West Virginia—as soon as you drive into the city limits everything, even the porno store, has a sign that looks like something John Downer painted.\n\nIf stick on letters, backlit plastic, and vinyl banners were all banned it would dramatically enhance the aesthetics of our world.\n\n"
    },
    {
      "time": "5 Dec 2008 — 1:30pm",
      "content": "What if the customer wants top design and wants to pay 10 bucks for the whole thing? (60\"x100\")... I remember back when there was one guy in town with a compugraphic worth hundreds of thousand$. Working was joy.\n\nNow, anybody got a epson and a Coreu. Is to shot oneself ...\n\n“Progress”...\n\n"
    },
    {
      "time": "5 Dec 2008 — 3:19pm",
      "content": "Some good examples here:  \n [http://typophile.com/node/20998](http://web.archive.org/web/20120415130550/http:/typophile.com/node/20998 \"http://typophile.com/node/20998\")\n\n"
    },
    {
      "time": "5 Dec 2008 — 3:56pm",
      "content": "James, what you wrote reminded me of this, the most beautiful CPA sign I've ever seen. It was on Lopez Island in Puget Sound.\n\n ![](http://web.archive.org/web/20120415130550im_/http:/typophile.com/files/hawley-nicholson-sign-s_5937.jpg)\n\n"
    },
    {
      "time": "5 Dec 2008 — 7:14pm",
      "content": "... <cite>If stick on letters, backlit plastic, and vinyl banners were all banned it would dramatically enhance the aesthetics of our world.</cite>\n\nWhoa! Good luck with that one. those are the bread an butter of the sign induatry. Actually,stick on letters, backlit plastic, and vinyl banners are the sign industry now. :o)\n\n-=®=-\n\n"
    },
    {
      "time": "5 Dec 2008 — 7:25pm",
      "content": "I used to have a little sign biz. My clients were all small business owners. Some not so small. Almost all of them had a difficult time getting their head around the idea that the design work I did was something they needed to pay for.\n\n-=®=-\n\n"
    },
    {
      "time": "6 Dec 2008 — 10:53am",
      "content": "Are we saying that signage is not much different from any other rules in design? If so, why focus on signage? So, just a suggestion and depending on how long this writeup is supposed to be, you might want to focus on how signage is DIFFERENT from the rest of design rules. If they aren't, then maybe just talk about which design relationships are most important. Distance is a major factor - how does that affect how the designer thinks differently about a sign project versus a brochure project?\n\n"
    },
    {
      "time": "6 Dec 2008 — 12:59pm",
      "content": "There are different rules to designing signs, and yes, size and spacing relative to intended viewing distance and speed is among the considerations, and usually the most significant factor, but:\n\nThere are also often arbitrary restrictions on size and style imposed by local ordinances.\n\nSometimes, the design is limited by the space available in an existing frame that might have fit the name of the original business well but is an awkward proportion for a new tenant, as demonstrated in some of the examples already shown.\n\nThere is also a tendency of clients to demand too much information be included on a sign (also demonstrated above).  \nHow much information can and should be in a sign is related to its size and placement. A small sign on a door can have much more information than a large sign at the roof line, since it is meant to be read by someone walking up close to it rather than be noticed and identified by someone driving by.\n\n"
    },
    {
      "time": "6 Dec 2008 — 1:24pm",
      "content": "<cite>Are we saying that signage is not much different from any other rules in design?<cite></cite></cite>\n\nTo a certain extent, I think so. The basic principles of design apply to signs just like everything else.\n\n<cite>If so, why focus on signage?</cite>\n\nBecause so much of it is just abominably bad. And because when an abominable sign goes up, people get stuck looking at it. There’s really no reason for me to care about the poor design in, say, a magazine about pro-wrestling, because I’ll never see it anyway. But I think many people get sick of otherwise gorgeous old urban neighborhoods covered with signs that look like the work of a myopic, colorblind, illiterate lunatic.\n\n"
    },
    {
      "time": "6 Dec 2008 — 9:08pm",
      "content": "What makes bad signage bad? There are many variables, including the fundamentals of design, rules of typography, etc, but it also depends on the people. What is aesthetically pleasing to one may not be to another. Additionally, this variance applies to different cultures as well.\n\nFor example, in my country, what is aesthetically pleasing for the traditional mindset is that negative space should be filled. Obviously, this is an eyesore, as there is not enough space for the letterforms to breathe. Case in point, the Philippines didn't have a typographic history like the west had, and was colonized before it could even develop its own national identity, thus restricting any native cultural developments. However, since the colonizer was a European country, Spain, there was an influence of western aesthetics. But the treatment of Spaniards towards Filipinos was very condescending, and thus they generally would not teach Filipinos what they know in typography and design, so the Filipinos would resort to imitating their colonizer, which is actually a quite bad way to learn, if left unguided. Thus, different views and takes on typography and design emerged in the Filipinos' consciousness, which would lead and shape the current design aesthetics we have today.\n\nThen, there's the Americans, but this post would become too long and I think you get the point. If any of you guys find this offensive, I'm sorry. I was just citing history and trying to speculate how a culture's take on design came to be.\n\nThe shaping of good signage (or design, generally) might first depend on the culture that shaped and continuously shapes it. Through this, though, we encounter contradictions with the purpose of communication on some levels, like typography (illegible, overstuffed signs, etc), but what the people find aesthetically pleasing might be contradictory to foreign eyes. Even if cognitive psychology comes in and discovers which is good signage or bad, it is the people's cultural preference that might come first.\n\nI know that some of you are thinking that there is a union: a marriage of cultural differences and design concepts backed by psychology, history, and tradition which need not contradict, which lies in good, well-researched design. And indeed there is.\n\n"
    },
    {
      "time": "7 Dec 2008 — 6:59am",
      "content": "Reference your image IMG\\_8100, O'Crea's Cash & Carry. The letters are ok on the awning, even with--maybe because of the vertical rhythm of--the rectangular primes instead of typographically correct apostrophes.  \nSo two expressions of a single idea. Signs are not typography. Formally they are the visual distribution, patterns, of shapes, some of which may be letters and numerals. Such signs involving letters and other standardized symbols representing language, work between two extremes; the largest number of ideas within the smallest possible space vs. the single idea in the largest possible space. Letters possess \"shapeness\" and \"symbolness\"--here I wish I wrote in German. When many ideas are presented in the smallest possible space, then attention to the graphic properties of the shapes must give way to the visual rules of writing, instead of exploiting the grammar of shape, attribute, and context.  \nSeen from a typo-aesthetic point of view, the problem with such signs as you have shown is the over abundance of \"shapeness\" and not enough attention to the niceties of polite visual discourse. From a socio-economic perspective, that of the proprietors, the visual form of the signs is determined by the desperation/aspiration by which they are driven. The need of the proprietors to survive and succeed doesn't allow them the luxury of aesthetic detachment. As Albertine Gaur says, \"If all writing is information storage, then all writing is of equal value. Each society stores the information essential to its survival …. If a form of information storage fulfils its purpose as far as a particular society is concerned then it is (for this particular society) 'proper' writing.\"\n\n"
    },
    {
      "time": "7 Dec 2008 — 7:21am",
      "content": "One important issue that hasn't been brought up, and I think that Zapf's point about the size of signs relates to, is the relation of the signs to the architecture and the 'streetscape'. Here in the US, you often have signs each trying to be bigger than the other, and the overall effect is chaotic and ugly. That is what argues for regulation on size, materials, etc. But how to do this best is something I don't know. It would be very interesting to see the effect of different regulations on different streetscapes. Perhaps there are books about this.\n\n"
    },
    {
      "time": "7 Dec 2008 — 6:09pm",
      "content": "Even taking the client out of the equation, sign design is different from any other type of design. There are limits imposed by factors unrelated to any other graphic form. Time (the time it takes the viewer to understand your message verses the time it takes for them to pass your sign and no longer care) and distance (does the whole sign turn into an artistic blur from any distance) are factors. The worst negative design factors are clutter, a lack of negative space, too much info and incorrect font choices. Proper typography is important, but only insofar as it relates to getting the message across.\n\nAs for all signs being made by true sign writers (these artists are not the same as sign painters), it might work in Alaska, probably not anywhere else. And, please, save me from the deathly combination of an architect and a designer. Batman never faced such villains as this dastardly duo.\n\n"
    },
    {
      "time": "7 Dec 2008 — 10:07pm",
      "content": "I only read about halfway through this thread, so sorry if anyone has touched on this already.\n\nI went in for a job interview with a sign maker who'd been in the business for many years who \"hated the corporate design world\". He informed me that he, as general practice on billboards and signs would purposely insert typos so that it would attract more attention.\n\npenn\n\n"
    },
    {
      "time": "8 Dec 2008 — 7:21pm",
      "content": "Another aspect is that many shop signs must function during day and night. The project might address how different kinds of lighting (i.e. warm, soft lighting vs. neon) give different impressions of a company. In that sense, certain types of lighting could be \"errors\".\n\nDurability in various weather conditions and over time, how colors reflect and change over time of day, dimensionality.. lots of factors are fairly unique to store sign design and could be addressed, although those are more on the construction side of design...something designers often lose touch with by looking at a monitor.\n\npenn, you reminded me of a billboard I saw over thanksgiving holiday. It had a few sentences (!) and I have no idea what it was about, but the one part I caught was, \"It's not to late to educate.\" I wanted to go back and read the rest to see if it was on purpose, but the next u-turn/exit was several miles away.\n\n"
    }
  ]
}
