{
  "id": "52325",
  "title": "Trying to find a site about different scripts used in Bible manuscripts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A while ago I came across a website about scripts used in Bible manuscripts and other books. Black background, some text, and lovely examples of pages sum up the content. Unfortunately I can’t remember the URL or where I found a link to it. I know the information above is sketchy, but does anyone know what I am talking about? Other resources concerning the same subject are welcome. Thank you.\n\n [‹ Preparing a book about forgotten typefaces: help needed](http://web.archive.org/web/20081207065731/http:/typophile.com/node/52275 \"Go to previous forum topic\") [21st Century Design Movements? ›](http://web.archive.org/web/20081207065731/http:/typophile.com/node/51794 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207065731/http://typophile.com/user/26157\" title=\"View user profile.\">dbeltechi</a>",
  "time": "<br>",
  "uid": "26157",
  "comments": [
    {
      "time": " 3.Dec.2008 1.54pm",
      "content": "Printed or written?\n\nMichael\n\n"
    },
    {
      "time": " 4.Dec.2008 12.52am",
      "content": "Hello, Michael. Painstakingly written.\n\n"
    },
    {
      "time": " 4.Dec.2008 4.24am",
      "content": "Well lets see, the original languages were Hebrew, Aramaic and Greek.\n\nSince then it has been translated into many languages. Latin was common for western civilization and many monks spent years illuminating latin bibles. Gutenberg printed bibles in german, which have been compared in quality to existing german manuscripts (in blackletter) so I imagine after that german manuscripts became popular as well.\n\nI think by the time the english bible came into existence, the era of hand-written manuscripts was over.\n\nWhat did the pages look like: where they all text, or did they have colour or illustration on them. I think of the Book of Kells first when you said this.\n\nA blackletter bible would also be easy to recognize because of the unique script used.\n\n"
    },
    {
      "time": " 4.Dec.2008 5.19am",
      "content": "The site contained different samples of manuscripts. The treasure was in the images. It had examples of illuminated manuscripts, with exquisite drop caps, borders and other visual elements. I think it presented different manuscripts and the evolution of the writing style.\n\n"
    },
    {
      "time": " 4.Dec.2008 5.36am",
      "content": "I don’t know if it’s what you are thinking of, but [Here’s something of interest](http://web.archive.org/web/20081207065731/http:/www.asia.si.edu/exhibitions/online/ITB/html/introduction.htm) like that.\n\n"
    },
    {
      "time": " 4.Dec.2008 6.28am",
      "content": "Not what I mean, but thank you William! It looks like a great resource.\n\n"
    },
    {
      "time": " 4.Dec.2008 7.44am",
      "content": "Some other resources (thanks for making me think about this…) :=)  \n [http://www.schoyencollection.com/aram-heb-syr.htm](http://web.archive.org/web/20081207065731/http:/www.schoyencollection.com/aram-heb-syr.htm \"http://www.schoyencollection.com/aram-heb-syr.htm\")  \n [http://www.schoyencollection.com/easteuropbkscr.htm](http://web.archive.org/web/20081207065731/http:/www.schoyencollection.com/easteuropbkscr.htm \"http://www.schoyencollection.com/easteuropbkscr.htm\")  \n [http://ccat.sas.upenn.edu/rs/rak/earlylxx/earlypaplist.html](http://web.archive.org/web/20081207065731/http:/ccat.sas.upenn.edu/rs/rak/earlylxx/earlypaplist.html \"http://ccat.sas.upenn.edu/rs/rak/earlylxx/earlypaplist.html\")  \n [http://www.schoyencollection.com/](http://web.archive.org/web/20081207065731/http:/www.schoyencollection.com/ \"http://www.schoyencollection.com/\")\n\n"
    },
    {
      "time": " 4.Dec.2008 11.21am",
      "content": "Thank you for taking the time, Claudio. This is great! My only complaint is I have more Times New Roman to look at :)\n\n"
    },
    {
      "time": " 4.Dec.2008 3.57pm",
      "content": "Was it in fact a contemporary manuscript? Sorry I was so long in responding Dan (Is the logo working o.k.?). Could it have been the site for the St John’s Bible out of Michigan done by Donald Jackson and his bunch?\n\nMight want to try cynscribe.com as a starting point.\n\nMichael\n\n"
    },
    {
      "time": " 5.Dec.2008 3.13am",
      "content": "Also try the book “The Cambridge History of the Bible”. Ch 2 in Vol 1 goes into detail on the scripts.  \nAlso look at thecalligraphyalphabet.blogspot.com\n\n"
    },
    {
      "time": " 5.Dec.2008 7.32am",
      "content": "@Michael,  \nI appreciate your suggestions. No, it’s not those sites, but the links you gave me are helpful as well. As for the logo, it’s great! I did not get a chance to use it officially yet, as we ended our summer camp season, but will start work on the website soon and next year’s materials (i will send you a couple of samples). You didn’t get my last e-mail when I confirmed the final version of the logo?\n\n@ Graham,  \nThank you for the link.\n\n"
    },
    {
      "time": " 5.Dec.2008 9.35am",
      "content": "<cite>Gutenberg printed bibles in German</cite>\n\nUrm, no, he printed Bibles in Latin. The first German Bible was the Mental Bible of 1466. That was the only German translation until Martin Luther’s edition of 1522.\n\nCheers,\n\nT\n\n"
    }
  ]
}
