{
  "id": "52321",
  "title": "Wedding Mongram",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am working on a monogram for a wedding.  \nNorman and Helene are the names of the couple to be wedded.  \nHer initial feedback is that it is a little too abstract and the \"h\" looks like a lama.  \nCan I get some feedbacks?\n\nthanks for your time!  \n:tony\n\n ![](http://web.archive.org/web/20140915195641im_/http:/typophile.com/files/nh_monogram_6248.jpg)\n\n",
  "author": "designtn",
  "time": "3 Dec 2008 — 10:27am",
  "uid": "21101",
  "comments": [
    {
      "time": "3 Dec 2008 — 11:34am",
      "content": "Hi Tony,\n\nDid you try playing with the uppercase of these two letters, it could be more successful. The uppercase N and H have a similar form and could be played with without the llama effect happening.\n\nAnother option is to keep the serif on the lowercase n and remove it from the ascender on the h part.\n\nGood luck!  \nDiane\n\n"
    },
    {
      "time": "3 Dec 2008 — 11:34am",
      "content": "the cut in the stem feels too high. doesn't read as an \"n\" as much as an \"h\". perhaps the notch could be more elegant than a solid boxed shape?\n\nw|m\n\n"
    },
    {
      "time": "3 Dec 2008 — 12:03pm",
      "content": "If this looks like a lama...\n\nYou have a good concept here, it is creative and does exactly what it needs to, I'm sure the main issue with the client is that she is expecting a mono using a script wedding face, which will not work with this concept. I think you could try a few different faces as well as Will's idea to finesse out the cut creating a more styled 'n' and 'h'. I do think you need a face that has a visual tie in the 'h' character so when you do make the split the pieces still look part of the same realm.\n\nOf course, as a married person, this concept could be crushed the minute someone say it represents a break up not a union.\n\n-titz\n\n"
    },
    {
      "time": "3 Dec 2008 — 12:34pm",
      "content": "Thanks everyone for your feedbacks.  \nI totally appreciate your time.  \nI tried a few other variations.\n\n ![](http://web.archive.org/web/20140915195641im_/http:/typophile.com/files/hn_5185.jpg)\n\nI am leaning towards version A.\n\n:tony\n\n"
    },
    {
      "time": "3 Dec 2008 — 1:01pm",
      "content": "titz is right on in my opinion. the letters should be making sweet type love and not be disconnected a bit. the implications of such a break up could be disastrous. Good idea w/ the uppercase letters (Diane) but I like the hairline serifs for the font. This is just to spark some ideas...\n\n ![](http://web.archive.org/web/20140915195641im_/http:/typophile.com/files/HN_4740.png)\n\n"
    },
    {
      "time": "3 Dec 2008 — 1:04pm",
      "content": "thanks again everyone for your feedbacks.\n\n:tony\n\n"
    },
    {
      "time": "3 Dec 2008 — 5:09pm",
      "content": "loving nachos' idea. i suggest definitely playing with the joining aspect more than the disconnected aspect\n\n"
    },
    {
      "time": "3 Dec 2008 — 9:46pm",
      "content": "The original mark is very fitting if either of them is a physicist :-)\n\n[Planck's constant](http://web.archive.org/web/20140915195641/http:/en.wikipedia.org/wiki/Planck%27s_constant)\n\n ![](http://web.archive.org/web/20140915195641im_/http:/typophile.com/files/planck_3502.gif)\n\n"
    },
    {
      "time": "4 Dec 2008 — 12:36pm",
      "content": "I like Nacho's idea too. It ain't gonna get better than that IMO.\n\n"
    },
    {
      "time": "4 Dec 2008 — 6:15pm",
      "content": "Nacho  \nyour idea was a good starting point for me to veer another direction.  \nSo here is your idea refined. It works beautifully in 2 colors but does not work in BW so well.\n\n ![](http://web.archive.org/web/20140915195641im_/http:/typophile.com/files/nh_monogram_4188.jpg)\n\nI am revisiting my original idea in an italic version.  \nIt still looks a bit bland. I am going to try to enclose it in an ornate shape.\n\ni'll just keep playing with it. Thanks again everyone.\n\nWHURD!\n\n"
    }
  ]
}
