{
  "id": "52334",
  "title": "Photofont WebReady Released by Fontlab",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [tharrson](http://web.archive.org/web/20091011031024/http:/www.typophile.com/user/1878 \"View user profile.\") : 3.Dec.2008 4.24pm \n\n**Introducing Photofont WebReady**  \n_Use any font on your own website_\n\nFor Immediate Release  \nDecember 3, 2008\n\nPort Angeles, WA, USA — December 3, 2008. Fontlab Ltd. announced today the release of Photofont WebReady, a font converter for Mac OS X and Windows that allows users to enhance their web pages with custom fonts of their choice.\n\n ![](http://web.archive.org/web/20091011031024im_/http:/www.typophile.com/files/SnellBlack_3960.jpg)\n  \nFontLab’s product and marketing manager Adam Twardoch explains: “Creators of web pages often wish to use custom fonts on their web pages instead of standard fonts such as Verdana, Georgia or Arial. The use of non-standard fonts can dramatically increase the attractivity of a website and help apply corporate branding on the web. However, the traditional way of creating custom website headlines by applying typographic effects to text and saving the result as a PNG or GIF graphic has many disadvantages. The text saved as a graphic is not ‘visible’ to search engines, screen readers or the Find function of the browser; it also does not perform well on small-size screens on mobile phones. However, with Photofont WebReady, you can customize the typographic appearance of your website without sacrificing searchability and standards compliance of your web pages.”\n\nWith Photofont WebReady’s flexible Flash®-based solution, compatible with the popular sIFR technology, the headlines on the website can be displayed using any OpenType or TrueType font. Going beyond the capabilities of sIFR, Photofont WebReady can also create dynamic headings using the Photofont® font format. Developed by FontLab, Photofont® brings the beauty of full-color bitmap fonts (with alpha transparency) to print and web. The Photofont WebReady solution is seamless: if a website visitor’s browser does not support Flash® or JavaScript (for example on mobile phones), the visitor will still see the text rendered in the default web font specified by the CSS stylesheet. Also, regardless of the browser used, the text always remains searchable and visible to search engines.\n\n ![](http://web.archive.org/web/20091011031024im_/http:/www.typophile.com/files/Flame_36_3484.jpg)\n  \n“People call and write us all the time asking for color fonts. Now they can actually do it,” said Ted Harrison, President of FontLab.\n\nPhotofont WebReady retails at US$79.95. For more information visit the Photofont WebReady product page at [http://www.fontlab.com/photofont/webready/](http://web.archive.org/web/20091011031024/http:/www.fontlab.com/photofont/webready/ \"http://www.fontlab.com/photofont/webready/\") and the Photofont technology page at [http://www.photofont.com/](http://web.archive.org/web/20091011031024/http:/www.photofont.com/ \"http://www.photofont.com/\")\n\nFor a limited period of time (until December 31) Fontlab is offering a 25% discount to readers of Typophile. Just click [here](http://web.archive.org/web/20091011031024/http:/www.fontlab.com/photofont/webready/) and use coupon code ZZ1-NE8-W31 for the Windows version or coupon code G16-GW6-3AR for the Macintosh version.\n\n###\n\n",
  "author": "<a href=\"http://web.archive.org/web/20091011031024/http:/www.typophile.com/user/1878\" title=\"View user profile.\">tharrson</a>",
  "time": ": 3.Dec.2008 4.24pm",
  "uid": "1878",
  "comments": [

  ]
}
