{
  "id": "52385",
  "title": "A.B. Dick Screen Plate set",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I recieved this as a gift. Anyone know what it is actually used for and how to use it? Some googling turned up nothing helpful.  \nThanks!\n\n ![](http://web.archive.org/web/20081207065735im_/http:/typophile.com/files/ab_dick001_4465.jpg)\n\n [‹ Birthday Linda Hop! Kick up and be Happy!](http://web.archive.org/web/20081207065735/http:/typophile.com/node/51172 \"Go to previous forum topic\") [Preparing a book about forgotten typefaces: help needed ›](http://web.archive.org/web/20081207065735/http:/typophile.com/node/52275 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207065735/http://typophile.com/user/7730\" title=\"View user profile.\">scruggsdesign</a>",
  "time": "<br>",
  "uid": "7730",
  "comments": [
    {
      "time": " 5.Dec.2008 6.36am",
      "content": "I’m not sure, but looks to be an intaglio burnisher/stylus set.\n\n"
    },
    {
      "time": " 5.Dec.2008 11.17am",
      "content": "If I recall correctly, Mimeograph was that high-inducing process of reproducing handouts back in elementary and high school. You know, the handouts with the purple ink and intoxicating aroma.\n\nThe masters for these were “stencils” of sorts. Usually you fed the master right into the typewriter and typed the text right on it. You could also mark the master directly, drawing right on the cover sheet. These masters were then combined with the smelly solvent to cause a transfer of the image. The number of copies was limited, and toward the end of a long run, they could get quite faded.\n\nI think there were other similar, but different, technologies that went by the same general name. So, maybe these tools are for something different than my purple memories.\n\nBut, in any event, the tools look like they’re made for marking these stencils. Some, like the yellow ones on the left, look like they’re for marking directly — basically like empty ball-points. The translucent yellow pattern piece looks like you place it behind the master, and then rubbing the front with one of the burnishers, like the black and green ones on the right, you transfer a dot pattern to the master, essentially creating a halftone or Ben Day pattern. That’s pretty sophisticated: I don’t remember any mimeograph handouts that ever went to that extent.\n\nThat’s my guess.\n\n— K.\n\n"
    }
  ]
}
