{
  "id": "52411",
  "title": "please help to id this font",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "could someone with a bit of historical type knowledge help me id this typeface... it was taken from an old hudson bay catalogue poster....\n\n ![](http://web.archive.org/web/20081207214641im_/http:/typophile.com/files/HBC_4594.jpg)\n\n [‹ [script] Bufe Tarifesi 1937](http://web.archive.org/web/20081207214641/http:/typophile.com/node/52089 \"Go to previous forum topic\") [Lovely serif font... But what's it called?! ›](http://web.archive.org/web/20081207214641/http:/typophile.com/node/52416 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207214641/http://typophile.com/user/37735\" title=\"View user profile.\">Bart Piwowarczyk</a>",
  "time": "<br>",
  "uid": "37735",
  "comments": [
    {
      "time": " 6.Dec.2008 8.35am",
      "content": "We had this question recently, and I believe it was agreed that this was a custom blackletter, not available as a commercial font. In fact, it seemed that there were several different versions of this logo we have looked at — all custom, i think.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 6.Dec.2008 3.02pm",
      "content": "i don’t remember an agreement being made. Additionally the variance in the font appearance is simply dictated by the process through which the signs were created. This sample is from a CATALOGUE, a PRINTed piece therefore a typeface must have been set and named. As well 200,000+ fonts ... right. Please someone else take a stab at this.\n\n"
    },
    {
      "time": " 6.Dec.2008 4.18pm",
      "content": "Bart, I don’t think the fact that the catalog was printed means a typeface had to be used. There are any number of ways that hand-drawn lettering could be reproduced as part of a printed page. For example, a metal plate could be made and used for the printing. Do they ever use the same lettering for anything except the logo?\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 6.Dec.2008 4.26pm",
      "content": "You also said this was from an “old .. catalogue poster”. If ’old’ is before the 1980’s, the 200,000+ font statement doesn’t apply. Digital fonts were only starting to be widely used by the mid-to-late ’80’s, and the number of fonts was not so large until relatively recently.\n\nI have looked at books I have on type, and so far I have not been able to match this blackletter style.\n\n- Mike Yanega\n\n"
    }
  ]
}
