{
  "id": "52410",
  "title": "Defiant Battle Type Progress",
  "forum": "Randy's blog",
  "tags": [

  ],
  "content": "Hi all,\n\nI’ve been banging away turning [what started as a harmless diversion](http://web.archive.org/web/20090924021827/http:/www.typophile.com/node/51521) into a working typeface. This is my first script type, so it took some doing getting high/low joins and alts. At the moment I’m fleshing out the uppercase which is trickier than I expected.\n\nHere are some talking points:\n\n• I’m thinking of calling it Moped Script. Thoughts?  \n• I have alts that create a non-looped version. Should loops be default, or straight?  \n• Occasionally loops crash into neighbors. I don’t want to add letterspacing. What do you think of the contextual alts in these cases? (I like the descenders, but not ascenders)  \n• Should I make the caps work in all cap setting? Is it important that they physically connect to the lowercase  \n• Any other thoughts or ideas that could make this better?\n\n ![](http://web.archive.org/web/20090924021827im_/http:/typophile.com/files/moped_5504.gif)\n\nCheers,  \nRandy\n\n",
  "author": "<a href=\"/web/20090924021827/http://typophile.com/user/7783\" title=\"View user profile.\">Randy</a>",
  "time": "<br>",
  "uid": "7783",
  "comments": [
    {
      "time": " 5.Dec.2008 5.17pm",
      "content": "Sweet. The high joins are looking right to my eyes, FWIW.\n\n"
    },
    {
      "time": " 5.Dec.2008 5.34pm",
      "content": "Randy! I’m glad you took my advice. I’ll take credit for it, even tho all I did was complain that you don’t release enough. It looks beautiful.\n\n\\> • I’m thinking of calling it Moped Script. Thoughts?\n\nPerfect\n\n\\> • I have alts that create a non-looped version. Should loops be default, or straight?\n\nStraight. Loops in the Swash or salt slots. No connectors is Moped Sans.\n\n\\> • Occasionally loops crash into neighbors.\n\ncalt or ligs.\n\n\\> • Should I make the caps work in all cap setting? Is it important that they physically connect to the lowercase\n\nNot if there is a Moped Sans\n\n\\> • Any other thoughts or ideas that could make this better?\n\nAdd a light weight. I think there is enough character in the bones of this thing that you won’t lose much when the stroke is thinner.\n\n"
    },
    {
      "time": " 5.Dec.2008 7.35pm",
      "content": "From your name sample “Moped” the “p” almost reads to me like a “js” ligature. It could be the looped tail that’s causing my confusion. I see you already have an unloopy alternate version (except for the g, q, and y, hmm...), so maybe that’s taken care of already, but it’s something to think about\n\n"
    },
    {
      "time": " 5.Dec.2008 8.10pm",
      "content": "Thanks for the input.\n\nJupiter: thx.  \nStephen: Aak! I thought I was nearly done?! Thanks for the encouragement.  \nCuttlefish: Interesting. I totally didn’t see that till you mentioned it. Seems I have mashed it again :-)\n\n"
    },
    {
      "time": " 10.Mar.2009 3.55pm",
      "content": "great stuff. i think this style of script is a largely unfilled niche (in type). great work at being one of its pioneers. :D\n\n"
    }
  ]
}
