{
  "id": "52428",
  "title": "Futura Condensed vs. Futura for Logo",
  "forum": "Design",
  "tags": [

  ],
  "content": "hi typophiles-\n\nI’d greatly appreciate any advice. I’ll try to provide details as per forum guidelines...\n\nI’m a newish designer, working with a great client. They’re called Sins Invalid, and they do performance and political organizing around disability and sexuality, etc. I’ve been designing most of their new materials over the past few months, and now I’m working with them to redesign their website. Here is their current site: [http://www.sinsinvalid.org/events.html](http://web.archive.org/web/20081207163831/http:/www.sinsinvalid.org/events.html \"http://www.sinsinvalid.org/events.html\"). They are very attached to their current logotype, which is just the group’s name in Futura Condensed (see below). I have no formal typography training, but the condensed font for this use just rubs me the wrong way! My feeling/guess is that condensed fonts should only be used when space is really at a premium, not for a display purpose. The Futura condensed letter shapes just scream “smooshed” to me. I am trying to convince them to at least use a non-condensed Futura (also see below), which to me is elegant, especially by comparison.\n\nI’m not sure if there’s anything I can do to convince them, but perhaps your pearls of (more experienced) wisdom will help me either a)realize I’m wrong or b)give them solid typographic reasons that they should switch logo fonts.\n\nThanks! Micah\n\n ![](http://web.archive.org/web/20081207163831im_/http:/typophile.com/files/sins_invalid_logo1_6470.gif)\n\n ![](http://web.archive.org/web/20081207163831im_/http:/typophile.com/files/sins_invalid_logo2_6264.gif)\n\n [‹ Sketch for personal logo](http://web.archive.org/web/20081207163831/http:/typophile.com/node/52427 \"Go to previous forum topic\") [17 & looking to buy a new font...suggestions? ›](http://web.archive.org/web/20081207163831/http:/typophile.com/node/52256 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081207163831/http://typophile.com/user/22520\" title=\"View user profile.\">micahbazant</a>",
  "time": "<br>",
  "uid": "22520",
  "comments": [
    {
      "time": " 6.Dec.2008 10.20pm",
      "content": "I don’t have any problem with using Futura Condensed as a logotype, and I think it’s more important to be consistent. Just be glad they didn’t settle on Comic Sans ...\n\n"
    },
    {
      "time": " 7.Dec.2008 6.13am",
      "content": "I agree that there is no reason not to use a condensed letter style for a logotype. But I can see a few problems with Futura condensed in this particular instance. The nature of the cap S is to be beautifully balanced, but arrayed against the lower case i the upper and lower counters appear too balanced and the S becomes somewhat unstable. I would be tempted to make a minor—and carefully crafted—adjustment to the S, slightly enlarging the lower space. The caps in Futura condensed can appear slightly too heavy and, in my opinion, the weight of the S, I, and extended l need adjustment. The spacing also needs some fine tuning. Ironically slightly open space may work better with Futura condensed, and especially in cases where it is a stark white on black, and may be all that is required to make the font work for this application\n\nGood luck.\n\n"
    }
  ]
}
