{
  "id": "52443",
  "title": "InDesign Question",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all\n\nI want the same image to appear on every page of a document. My question is if I put it on a master page instead of on every single page individually, does that reduce the file size when building a pdf?\n\nThanks in advance  \nRegards\n\n [‹ Type Battle 27 // Draw Typophile a new logo](http://web.archive.org/web/20081209030548/http:/typophile.com/battle27 \"Go to previous forum topic\") [How do you draw the letter \"o\"? ›](http://web.archive.org/web/20081209030548/http:/typophile.com/node/52432 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081209030548/http://typophile.com/user/17987\" title=\"View user profile.\">kiko</a>",
  "time": "<br>",
  "uid": "17987",
  "comments": [
    {
      "time": " 8.Dec.2008 2.12am",
      "content": "Hi Kiko,\n\nno, it shouldn’t affect the file size.  \nBut there are other reasons for having repeating elements on a master page – it’s just so much tidier.  \nF\n\n"
    },
    {
      "time": " 8.Dec.2008 6.57am",
      "content": "I wouldn’t think it would...but I echo Florian’s comment. Makes it a lot neater, and a lot easier to change with consistency.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": " 8.Dec.2008 10.18am",
      "content": "<cite>no, it shouldn’t affect the file size.</cite>\n\nOk, that’s what I thought so.  \nThanks for reply.\n\n"
    },
    {
      "time": " 8.Dec.2008 12.39pm",
      "content": "The proof is in the pudding of course.\n\nA fast test:  \nDocument 10 pages.  \nImage (to be once on every page): 119282 bytes  \nDocument with image placed separately on each page: 2238884 bytes  \nDocument with image on Master A, 10 pages based on Master A: 20444950 bytes  \nDifference: almost 9%.\n\nDraw your own conclusions.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 8.Dec.2008 1.05pm",
      "content": "I found that rather than Exporting to pdf, printing the same file to PS and distilling reduces the image overhead to nearly nothing — apparently storing it only once.\n\nIn one case I sent a client vastly downsampled proofs — up to the point he started complaining — because of a single huge image that occurred every other few pages. Even after downsampling, the PDF exceeded 10 MB. After his final approval, I made a PS file for the printer, converted it to PDF to double check — and it was about 5 MB, with the highest image rez possible. Embarrassed looks all around.\n\nYour mileage might vary.\n\n"
    },
    {
      "time": " 8.Dec.2008 2.15pm",
      "content": "Yes, I was referring to the final PDF file size. The InDesign document might grow bigger, depending on the way you build it.\n\n"
    }
  ]
}
