{
  "id": "52442",
  "title": "Type specimens?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What makes a good type specimen document?  \nWhat are the required basics.  \nWhat kind of extras are popular.  \nShould they be completely serious?  \nShould it include gallery style images of the use of the type in question?  \nDoes anyone have links to those specimen documents they find exceptional?\n\n [‹ the digital print](http://web.archive.org/web/20081211102604/http:/typophile.com/node/52451 \"Go to previous forum topic\") [New My Fonts beta site! When did it come out? ›](http://web.archive.org/web/20081211102604/http:/typophile.com/node/52511 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081211102604/http://typophile.com/user/37869\" title=\"View user profile.\">phrostbyte64</a>",
  "time": "<br>",
  "uid": "37869",
  "comments": [
    {
      "time": " 7.Dec.2008 10.23pm",
      "content": "Oh my ... given the nature of the crowd here, phrostbyte, I offer you my pre-emptive sympathy and implore you not to allow subsequent posts - if there are any - to bring you down or discourage you. I’m only hoping one of this site’s real champions manages to find his or her way over to this thread and can provide you with their valuable insight.\n\nMy less-valuable insight: I’ve always been rather impressed with specimens that manage to visually match the theme of the font itself without going hideously overboard. For example, if your typeface is a circus-themed display face, you could perhaps as a background use a collage of circus visuals (pictures, paint, etc.) with an especially dominant center (clown, perhaps?), sepia-tone it, set it at maybe 15-percent transparency and then display your font.\n\nIf you prefer something even more conservative, consider using a cut-out ferris wheel as a cover with the font’s name inside it and all-white background, and just put in the bottom right corner of the following pages a stand-alone clown or other circus icon, perhaps with a slight bevel or shadow. You have your own artistic sense, so you can do it. I just feel matching the font’s theme works well. I’ve seen several gorgeous specimens for book/text-engineered fonts that incorporate pictures of opened books shot at various extreme angles and set on an all black background with the type displayed in white.\n\nAs for basics, you will likely hear several different opinions. Already I can hear one you’d almost certainly have received if I didn’t just mention it here: it depends on for whom it’s being created. Yeah, thanks buddy - ’preciate the educated response. My opinion is a bit more streamlined: create 2-4 specimens of varying size but make sure they all match (in color, use of graphics, art, etc.) Make a single page with just the type’s name and perhaps a sentence or two describing who you are, and why it was created. Then make one a few pages larger and include a basic character set. After that go even larger and include full-page presentations ... meaning, cover, character set, pretty third page with your font in action but not splattered all over the page, and a purely artistic final page. Then at the end make a big mondo-sized specimen and blow that sucker up. I’ve seen some specimens with a single letter per page! I think if you keep the theme the same, making multiple specimens would be easier and would certainly keep you prepared for anything you might encounter or need. It may be you never use two of the four. Or maybe you send the big daddy only to prospective vendors, etc., and use No. 2 on a sale page.\n\nAs for the rest, there are tons of links out there to specimens, which you can find rather easily if you have advanced knowledge of Google.\n\nGood luck.\n\n"
    },
    {
      "time": " 7.Dec.2008 10.34pm",
      "content": "The best pdf specimen I’ve seen lately is Jeremy Tankard’s [Kingfisher](http://web.archive.org/web/20081211102604/http:/www.typography.net/type/font/kingfisher). It contains a 12-pages essay about the concept and development of the typeface set on spreads (double pages), so if you print it you can have a real example of text setting.  \nI also like the specimens made by students at the [Reading University](http://web.archive.org/web/20081211102604/http:/www.typefacedesign.org/2008/)\n\n"
    },
    {
      "time": " 8.Dec.2008 12.05am",
      "content": "I quite enjoyed the Specimen PDF that came with [Yanone Kaffesatz](http://web.archive.org/web/20081211102604/http:/www.yanone.de/cgi-bin/download.pl?file=kaffeesatzpdf)\n\nI also have enjoyed the various settings and graphics for [Hypatia Sans](http://web.archive.org/web/20081211102604/http:/www.adobe.com/type/browser/landing/hypatia/hypatia.html)\n\nFor some fun Specimens from Underware check [Auto](http://web.archive.org/web/20081211102604/http:/www.underware.nl/download/auto/pdf/auto-press-announcement.pdf), [Sauna](http://web.archive.org/web/20081211102604/http:/www.underware.nl/download/sauna/pdf/sauna.pdf), and [Bello](http://web.archive.org/web/20081211102604/http:/www.underware.nl/download/bello/pdf/bello.pdf)\n\nAs for what I think makes a good specimen? One that shows off the typeface in an environment that makes the typeface look the best it can. Here’s a simple checklist of the basics:  \n  \n_- does it show off all of the characters in the set_\n\n- does it show the typeface properly set\n\n- does is include imagery that matches the typeface (if any imagery at all)\n\n- does it use a variety of contrasts to show off the typeface (colour, size etc etc)\n\n- does it include the typeface set in a realistic way somewhere so they can see what it will honestly look like when they go to use it for some mundane setting\n\n- does it make you want to buy the typeface all over again  \n  \nI hope this helps, and for the record we’re a bright cheery helpful community here, enjoy your stay!\n\n"
    },
    {
      "time": " 8.Dec.2008 7.08am",
      "content": "I always enjoy the simple but complete specimen Village makes for their types.\n\nUnderware indeed also has nice specimen, they always try to do something extra with them.\n\nTypetrust has very clean, well designed specimen PDF’s too.\n\nDTL (Dutch Type Library) has some excellent specimen, very well designed, pretty complete and extensive. Just good looking.\n\nDSTYPE has an excellent specimen for Capsa. One of the best I’ve seen in a while.\n\n"
    },
    {
      "time": " 8.Dec.2008 7.29am",
      "content": "Actually, seeing Jelmar (Quincunx) posting here has reminded me that [his own type specimens](http://web.archive.org/web/20081211102604/http:/www.typehigh.nl/) were recently pointed out in one of the battle threads as being particularly good. In particular, check out the _sixtypound_ specimen under _type design_.\n\nI don’t have a huge mental repository of type specimens like many Typophiles seem to, so I can’t really point to any specifics other than the one above. That said, as a designer, I find that the typefaces I purchase on impulse are ones which have a really strongly designed specimen like this. As Tom said, I think it really helps to see instantly how somebody has actually used the face. To a designer at least, typography is only partly about actual letterforms - the context they’re used is obviously of immense importance.\n\nHope this is of some small help!\n\nTake care, Andi\n\n[[semibad](http://web.archive.org/web/20081211102604/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": " 8.Dec.2008 8.52am",
      "content": "Andi: Thanks. I also posted the (preliminary) specimen of [Furet](http://web.archive.org/web/20081211102604/http:/www.flickr.com/photos/11494488@N05/3061740854/in/set-72157601588061188/). (Preliminary, since I haven’t yet designed the italics). I have tried to show how the different weights work best. So Regular and Bold for text and medium display sizes, and Black for huge, massive pointsizes on a A0 poster.\n\nThe PDF version of the specimen is coming up soon. I haven’t put it up on my site yet (because I currently don’t have Flash installed), so flickr instead. :)\n\n"
    },
    {
      "time": " 8.Dec.2008 10.31am",
      "content": "I second the comment made by genericboy regarding Quincunx’s specimens. Effective and clean yet still acutely artistic. Not to mention another important aspect of his specimens: they’re well-protected from extraction. I love to see that and wish it would be some kind of unspoken ordinance for designers ... a dream that seems to continue falling on the deaf ears of those unaware of how prevalent pdf extraction is in the piracy community.\n\nIf you don’t know how to prevent such extraction, FIND OUT before ever beginning your first specimen. Every time I open a .pdf I go to the properties menu and check which fonts are used in the file ... a reflex I developed after seeing a specimen of a font someone called something like “Tamara” in the speciment text but according to the properties listing had called “superbitch” when saving it. Even though having milk come out of your nose is unpleasant, seeing something so funny has resulted in my catching all kinds of interesting things regarding names, etc. Regardless, it only takes an extra 17 seconds to employ this kind of protection and I’ve yet to hear a reasonable argument against it. Even if piracy did not thrive on pdf extraction, why not just take the extra measure anyway?\n\n"
    },
    {
      "time": " 8.Dec.2008 11.40am",
      "content": "Whether print, PDF-printable, or online interactive, I prefer type specimens that refer to the genre of type specimens, rather than being faux versions of other kinds of document.\n\nFor print specimens, it’s important to show what the typeface looks like at specific sizes, as this is the most help for typographers in imagining how it will look in use. Sure, these days we have wysiwyg, but all the more reason to have a printed specimen to elucidate the distinction between a laser-print made in one’s studio, and “real” typesetting as printed by offset lithography.\n\nThe new MyFonts “type tester” interface is awesome, but there are other ways that testers can show type uniquely—I especially like how Darden and Dalton Maag foundries allow comparison of types of the user’s choice, side by side. For my site/type tester, I tried to get the feel of a large page with lots of white space, not boxing in the type.\n\n"
    },
    {
      "time": " 8.Dec.2008 12.05pm",
      "content": "\\> _Not to mention another important aspect of his specimens: they’re well-protected from extraction._\n\nI think I actually just converted the fonts to curves, which is not really the ideal solution for type. It does indeed prevent people from ripping the PDF, but it also removes all the hinting and such. But I decided to do it anyway (since the specimen in question contain mostly large text sizes).\n\nBut there are also ways to secure a PDF, in a way that prevent you from placing the PDF in InDesign, opening it in Photoshop or ripping it through Distiller. Though, I don’t know if it prevents extracting fonts too, since I have no idea how that is done.\n\n"
    },
    {
      "time": " 8.Dec.2008 3.48pm",
      "content": "Since all I ever deal with (well, 95%) is text types for books, I’d like to see type specimens that look like books. That is:  \n\\*\\* full paragraphs,  \n\\*\\* 24-26 pica line length,  \n\\*\\* a combo of justified and ragged,  \n\\*\\* all the figures,  \n\\*\\* all the small caps and other specials (but I don’t need to see all the accented sorts),  \n\\*\\* all the weights (of course, I’ll use only text weight, a semibold, and a display weight),  \n\\*\\* and, as Nick mentioned, a variety of size and leading,  \n\\*\\* smalls and italic set within the roman to see how compatible their weights are.\n\nGo to a library with a good printing section, and see if you can see the 3-volume specimen set from Kingsport Press circa 1960. Monotype Baskerville is a good example of how they show a book face. There is a single page that shows the roman and italic sorts at 6, 7, 8, 9, 10, 11, and 12 point. These pages also show the character-per-pica count and the roman alphabet length. Following each of the full-alphabet pages we see the face set at 6 solid, 6/7, 6/8; 7 solid, 7/8, 7/9; 8 solid, 8/9, 8/10; 9 solid, 9/10, 9/11; 10 solid, 10/11, 10/12, 10/13; 11 solid, 11/12, 11/13, 11/14; 12 solid, 12/13, 12/14, 12/15. At a line measure of 22 picas justified. The paras show italic, smalls, and all caps.\n\nSpecimens such as these were an immense help to designers. Since type was not at all mutable, such data as the cpp count and roman alpha length were set. Therefore, with all this info, a good designer could cast off a book to a very accurate degree.\n\nI realize this is an unattainable goal these days; economics are against it. But something approaching this is a help.\n\nSo is an offset-printed specimen. I purchased an expensive font family from a small foundry a while back. I based my purchase on what I saw on screen, and on laser proofs I had to badger the foundry to send. I found I did not like the look of the face quite so much when I printed a book with it.\n\nPerhaps the possibility of seeing acceptable specimens of book faces is why I have slowed down adding types to the library of late. I hate to do it, but I want to know pretty well what I’m getting.\n\npowers\n\n"
    },
    {
      "time": " 10.Dec.2008 12.52pm",
      "content": "I wonder who’s interested in seeing printed the full character sets of all available weights. Or would, say, an overview of just the regular and the italic be enough. Any thoughts?\n\n"
    }
  ]
}
