{
  "id": "52445",
  "title": "Neutraface Slab: Mini Preview!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20131107051107im_/http:/typophile.com/files/neutra%20slab_3587.jpg)\n\nIt doesn't look like anyone's posted yet about the tiny sneak preview that [House Industries](http://web.archive.org/web/20131107051107/http:/www.houseind.com/) has released of its \"forthcoming Neutraface Slab font collection.\" Four of their new [products](http://web.archive.org/web/20131107051107/http:/www.houseind.com/index.php?page=accessories), two pillows and two totes, are covered in an all-caps alphabet in what looks to be one of Neutra Slab's lighter weights. Aside from a few small preview images, information is scarce -- though the description for the large pillow states, \"Type designers Christian Schwartz, Kai Bernau, Susana Carvalho, Ken Barber and Ben Kiel spent countless hours seated at their desks and toiling over our forthcoming Neutraface Slab font collection, so we designed this type-patterned pillow to remind their respective lumbar areas that typography can provide visual and physical comfort.\" Quite the type design team!\n\nNeedless to say, I'm excited!\n\n",
  "author": "Reed Reibstein",
  "time": "8 Dec 2008 — 3:19am",
  "uid": "11702",
  "comments": [
    {
      "time": "8 Dec 2008 — 8:42am",
      "content": "Ooh nice. But I'll have to see how it compares to the beautiful Archer. No way I can afford both.\n\n"
    },
    {
      "time": "8 Dec 2008 — 10:58am",
      "content": "Looks like a high-end contemporization of Memphis. And now that I think of it, Gotham Light Slab would make a killer display face. Of course, the only way I can afford new fonts in this economy is to make my own.\n\nAnd yes, I made up the word contemporization. I think it kind of works for this, tho.\n\n"
    },
    {
      "time": "8 Dec 2008 — 12:36pm",
      "content": "I agree, James. Given how much character Neutraface has, I hope the full slab font will be a knockout. If not, it's Archer for me. I already have Memphis, Rockwell and Stymie.\n\n"
    },
    {
      "time": "8 Dec 2008 — 5:35pm",
      "content": "Neutra Slab is going to be different enough from Archer that you'll want both. Seriously. Archer is a really feminine, friendly slab. Neutra Slab will be as cold as Lubalin. But I like cold too.\n\n"
    },
    {
      "time": "8 Dec 2008 — 5:53pm",
      "content": "How about if I just have clients willing to spring for either one?\n\n"
    },
    {
      "time": "8 Dec 2008 — 9:32pm",
      "content": "i am very excited about neutra slab!\n\n"
    },
    {
      "time": "8 Dec 2008 — 10:17pm",
      "content": "But Tiff, srsly if I have Stymie etc, will I want/need Neutraface? Archer represents a departure. I'm kinda feminine myself, when my talons are sheathed.\n\n"
    },
    {
      "time": "8 Dec 2008 — 10:33pm",
      "content": "That's true. If you have Stymie or even Lubalin Graph you might not need Neutra Slab. I'll be interested to see a comparison.\n\n"
    },
    {
      "time": "16 May 2009 — 3:05am",
      "content": "[Neutraface Slab](http://web.archive.org/web/20131107051107/http:/www.houseind.com/fonts/neutrafaceslab) is available now!\n\n"
    },
    {
      "time": "16 May 2009 — 10:50pm",
      "content": "They have some nice shirts using the slab, too.\n\n ![](http://web.archive.org/web/20131107051107im_/http:/typophile.com/files/slabtee_6214.jpg)\n\n"
    },
    {
      "time": "18 May 2009 — 11:24am",
      "content": "It seems odd that so many of the sample/promo images all set in all caps. The thing that sets Neutra Slab apart (for me) is the low x-height.\n\n"
    },
    {
      "time": "18 May 2009 — 1:42pm",
      "content": "Slabs look more impressive in an all-caps setting. :-)\n\n"
    }
  ]
}
