{
  "id": "52496",
  "title": "Model Logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there,\n\nI am designing a logo for a start-up. I has to do with models (predominantly fashion) dating.\n\nThe business is mainly online but will require a little print promotion also.\n\nThe design is in its first iteration and has been done very roughly - but I didn't really need to say the last part as this is fairly obvious.\n\nI would appreciate members option on the design...\n\n| Attachment | Size |\n| --- | --- |\n| [date.moss\\_.1.jpg](http://web.archive.org/web/20131018070325/http:/typophile.com/files/date.moss_.1.jpg) | 53.05 KB |\n\n",
  "author": "Chris Hunt",
  "time": "9 Dec 2008 — 1:16pm",
  "uid": "39800",
  "comments": [
    {
      "time": "9 Dec 2008 — 1:55pm",
      "content": "This is a good start. But for this to work well you’ll need to spring for some contemporary fonts. Gill Sans just doesn’t connect well to contemporary high fashion, and that script is too pudgy and the simple flourishes look dated. Museo Sans or Gotham Light would work better, combined with one of [Ale Paul’s sweet scripts](http://web.archive.org/web/20131018070325/http:/www.veer.com/search/results.aspx?keyword=alejandro%20paul&producttype=TYP) should do the trick. You also need to crank up the volume with the color—this is sedate!\n\n"
    },
    {
      "time": "12 Dec 2008 — 4:04pm",
      "content": "Hi James,\n\nThanks for the constructive feedback.\n\nI'm going to go with the Museo Sans for three reasons. Firstly I really like the 'M'. It feels more appropriate. And I could try the Museo Sans 500 for free - I'm going to buy the 300 to see which one looks better once the script is sorted out.\n\nI have looked at the page you suggested and have a strong preference to Burgues Script. Is there any reason that you feel that this isn't appropriate?\n\n"
    },
    {
      "time": "16 Dec 2008 — 3:05pm",
      "content": "Hi James,\n\nI was wondering if you had any further thought on the Script. I would still like to go with Burgues but I would like to check that this is the script that you had in mind. I would just buy it and try it but at a cost of GBP 69.00 it isn't exactly cheap!\n\n"
    },
    {
      "time": "28 Dec 2008 — 10:58am",
      "content": "I have be trying various things using Burgues script and Museo Sans - which has been fun. After playing around with using images in 'Date' it didn't look right. In the end I started trying other stuff and having the different Museo weights I have done the following. I prefer it to the original. I was wondering if anyone had any feedback with regards to leading, kerning or position.\n\n ![](http://web.archive.org/web/20131018070325im_/http:/typophile.com/files/logo_6144.jpg)\n\n"
    },
    {
      "time": "28 Dec 2008 — 1:56pm",
      "content": "To my eye, the \"o\" needs to be moved slightly to the left. My initial impression is that I would prefer a little more space between the two lines, but I can see how the overlap of the caps might not then work as well. Sometimes you fix one problem only to create another, and then one has to choose the lesser of two evils (although it is so much better to be able to choose the better of two \"goods\" -- smile).  \n&nbsp;  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ~~~~~~~~~~~~~~~~~  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_When going from_ A to Z,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_I often end up_ At Oz.\n\n"
    },
    {
      "time": "28 Dec 2008 — 2:39pm",
      "content": "I see what you mean, I have moved it over and it looks better. Thanks!\n\n ![](http://web.archive.org/web/20131018070325im_/http:/typophile.com/files/logo_5992.gif)\n\n"
    },
    {
      "time": "29 Dec 2008 — 4:12am",
      "content": "Hello Doors. I was reading these coments and i'd like to add some considerations, in hopes this might help you. a) the word date seems to fall down to the right because of its hard angle, maybe it needs some compensation upwords; b) i don't like the thickness of the word moss, but if it's something you enjoy, then maybe it would work better if you tried to have it smaller but with more space between the letters, or with a lighter color; c) my eye gets fixed on the detail of the left top of the M in the middle of the D curve, i think it woul be interesting to take it off... ?  \ni'm sorry for my rough english... hope you understood my ideas :P\n\n"
    },
    {
      "time": "29 Dec 2008 — 1:45pm",
      "content": "You might consider joining the \"D\" and the \"t\". I do agree though with James that you may want to look at more contemporary fonts. Something like neutraface by house industries for moss maybe?\n\n"
    },
    {
      "time": "30 Dec 2008 — 4:56am",
      "content": "To my eye, the \"Moss\" is way to dominant! For that reason and since \"Date Moss\" is a really nice pun/paronomasia, I would use the same font for both words to underline the pun.\n\n"
    },
    {
      "time": "1 Jan 2009 — 2:00am",
      "content": " ![](http://web.archive.org/web/20131018070325im_/http:/typophile.com/files/logo_final2_3942.jpg)\n\n@faraqat Your comments were helpful! I have altered the angle of 'Date' and I think it does improve the 'D'. After lighting 'Moss' I then tried less weight and it I'm digging it. Originally I took the 'D' out of the 'M' the design lost something, but now that it is more balanced it doesn't seem to need it anymore.\n\n@jdewtt I really like Museo Sans for 'Moss'. I had a look at Neutraface, it's super nice! I would like to use it for future projects. I didn't like \\*some\\* of House Industries other type faces - I appreciate that they are well executed and in the right situation they would work but they wouldn't get into my top 20!\n\n@trickynicky I really like the pun as well. I'm not a big pun fan; a magazine I used to work for had a pun jar so I have been conditioned not to like them but in this case I found it hilarious and sharp witted.\n\nYour comment about underlining the pun played a part in bringing the logo into more balance. I think the improved balance goes a long way to underlining the pun!\n\n"
    }
  ]
}
