{
  "id": "52509",
  "title": "which software for a beginner?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi,  \ni am an absolute beginner in the world of type design, but it is something i’m keen to get stuck into. so far i have just sketched a few ideas for fonts but as yet have not looked into software.\n\ni’m aware that fontlab studio is ’the one’ but at the minute i just dont have the money to shell out on it. The alternatives seem to be type tool at $99 and fontforge which is free.\n\ndoes anyone have any experience of the latter two and can advise me what to get? at the minute i’m not too concerned about the fancy stuff - ligatures and the like, i’d just like to create a basic font in maybe regular and bold. i have illustrator and a reasonable grasp of beziers, although i believe it is better to create the characters within the font software - do these programs have this facility?\n\nmany thanks for any replies.\n\nJonny\n\n",
  "author": "<a href=\"/web/20090804053459/http://typophile.com/user/39755\" title=\"View user profile.\">jonnyboyle</a>",
  "time": "<br>",
  "uid": "39755",
  "comments": [
    {
      "time": " 9.Dec.2008 3.37pm",
      "content": "You can design directly in any of the above mentioned programs. TypeTool is slicker than FontForge and will ease you into FontLab, should you desire to go that route. FontLab does have a trial version, so download that and FontForge and see which you like better and which fits with your budget better.\n\n"
    },
    {
      "time": " 10.Dec.2008 12.51am",
      "content": "TypeTool is a simplified version of FontLab Studio, so whatever you learn in TypeTool, you’ll be able to apply in FontLab Studio later. Also, the file format (.vfb) is fully compatible.\n\nAdam\n\n"
    },
    {
      "time": " 10.Dec.2008 3.10am",
      "content": "thanks, guys, i’ve downloaded the demo of type tool and am about to start reading the manual.\n\nis it much more basic than fontlab? will there be a point where i just cant do what i want with type tool?\n\n"
    },
    {
      "time": " 6.Jan.2009 4.29am",
      "content": "Class-based metric editing is probably the one thing that you’ll be missing out (it is only available in FontLab Studio).\n\nA.\n\n"
    },
    {
      "time": " 7.Jan.2009 3.36am",
      "content": "For a newbie (I should know, I’m one ;) ) Typetool is more than enough. I wouldn’t know how to do class-based kerning even if I could :)\n\nBig recommendation for typetool, if you outgrow it I do believe you can upgrade tyeptool—\\>fontlab\n\n"
    },
    {
      "time": " 8.Jan.2009 2.38am",
      "content": "thanks for further replies. i downloaded typetool last week and am trying to get to grips with it. amateur fonts will soon be forthcoming!\n\n"
    }
  ]
}
