{
  "id": "52503",
  "title": "Double Crown Club",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Trying to dig up a little info on the Double Crown Club after a conversation with Mike Parker.\n\nI find a link in a thread to the wiki here:\n\n[http://typophile.com/node/29722](http://web.archive.org/web/20140802204913/http:/typophile.com/node/29722 \"http://typophile.com/node/29722\")\n\nbut when I click it, it takes me to a \"compose email\" entry form of sorts.\n\nIs this a browser/OS issue?\n\n",
  "author": "Chris Dean",
  "time": "9 Dec 2008 — 2:03pm",
  "uid": "/web/20140802204913/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "9 Dec 2008 — 5:25pm",
      "content": "Hi Christopher,\n\nis it really a ‘compose e-mail’ entry form, or rather a ‘Submit Wiki’ one?  \nIf it is the latter, than you don’t have to worry about your browser.\n\nThe [Wiki](http://web.archive.org/web/20140802204913/http:/typophile.com/typowiki) is …  \n<cite>“a user-created encyclopedia of all things type and design-related. Users create and edit Wiki entries with the aim of becoming a collaborative, useful, balanced and relevant resource.<br>\nTo reference a wiki entry from a forum post or review anywhere within Typophile, simply wrap the name of the wiki entry within double brackets, like this: <a href=\"http://web.archive.org/web/20140802204913/http:/typophile.com/wiki/typography\" class=\"freelinking\" rel=\"nofollow\">typography</a>. Your published post will automatically format the Wiki link.”</cite>\n\nAs long as there is no entry for the word in question, you will be taken to the ‘Submit Wiki’ page, so that you can directly start writing an article about it. Potential headwords that don’t have a Wiki entry yet are marked with a little red W, like this: [Double Crown Club](http://web.archive.org/web/20140802204913/http:/typophile.com/wiki/Double%20Crown%20Club). That is, someone thought it might be a good idea to have a Wiki entry for it and created a link.  \nF\n\n"
    },
    {
      "time": "10 Dec 2008 — 1:51am",
      "content": "_Trying to dig up a little info on the Double Crown Club_\n\nWhat do you want to know? The 399th dinner was last night, at the Savile Club, Brook Street, where after a Pressed Game Terrine we had Roast Breast of Goose finished with Mustard-flavoured Brussells Sprouts and Potato Fondant, followed by Warm Chocolate Fondant finished with Cinnamon Ice-cream and Mulled Wine Syrup. There was a good white wine from the Ardèche. The red was a decent claret. The choice of pudding was artful, since the speaker was Jerry Cinamon, who spoke on Rudolph Koch, showing slides of original artwork that he made at the Klingspor Museum and which were completely new to most of us. The menu was set in Koch’s Jessen type, the one for which he cut the punches directly in the metal without making drawings, or so he said.\n\nIf you want to go further back, the official history is by James Moran, _The Double Crown Club : a history of fifty years_ (1974), but there are references, complimentary ones on the whole, scattered over several studies of the British typographical scene in the 20th century.\n\n"
    },
    {
      "time": "10 Dec 2008 — 4:54am",
      "content": "Christopher --\n\nLet me guess: Mike was telling you one of his Stanley Morison stories, eh? ;-)\n\n-- Kent.\n\n"
    },
    {
      "time": "10 Dec 2008 — 9:42pm",
      "content": "Thank you Florian. Are you a member? Judging by your description of the meal I am guessing yes. As a starving student, I'm not adding to my library at the moment, but I did come across a link to that book. Is this a members only club? If so, how does one get accepted? I am particularly interested in the menus you design. Is there somewhere online where one can view them? It would make a wonderful site.\n\nKent, you are correct. What a marvelous storyteller Mike is. I was looking for some information on Times Ten as I am using it for some materials in an experiment. Stephen Coles suggested I contact him directly.\n\nAnd I figured out the wiki stuff. It makes sense now.\n\nThank you both.\n\n"
    },
    {
      "time": "11 Dec 2008 — 12:46am",
      "content": "Well, I’m not Florian, but I’ll do my best to tell you how to join the Double Crown Club. Get to know a member, and maybe he or she will propose you for membership, and if the members like the sound of you, and the look of what you have designed or printed, you are in. It’s a dining club, though, and you need to get to dinners regularly. Still, if a member takes you as a guest, you get a free dinner, and if you get too many such free dinners, people think you should join and pay for your own. Like most such groups it tends to think of itself, rightly or wrongly, as (literally) an élite. At any rate, it did in 1924 when Stanley Morison and Oliver Simon were among the founders. Mike thinks that it was a conspiratorial coterie of men (they were all men) who thought rather too well of their superior good taste. I wouldn’t say that he is wrong.\n\nWe are quite different now, of course. But whatever the quality of the speaker (being human, they vary), we still appreciate attention to a decent standard of food and wine, as well as good typography, like the club’s founding fathers. Here is a detail of Tuesday’s menu. (There are plenty of other examples in James Moran's book.) If I understood the story that was given out at dinner, Jerry Kelly (one of the club’s Honorary Overseas Members) provided the Jessen-Schrift.\n\n ![](http://web.archive.org/web/20140802204913im_/http:/typophile.com/files/DCC%20dinner%20399%20-%20menu%20500_5121.jpg)\n\n"
    },
    {
      "time": "11 Dec 2008 — 1:17pm",
      "content": "Thank you James. Is it to much to ask to be provided with a list of current members?\n\nI'm also curious if there are \"satellite clubs\" of sorts out there.\n\nShould I ever receive a guest invitation, I like the sound of a free meal, but, as a staving student, flying to London for dinner is certainly beyond my means. Unless of course I can write an extremely clever grant proposal.\n\nAlso, I understand that it is someone's responsibility to \"design the menu.\" Does that mean typographically as well as select the food, or simply the typographic design? If it is just the typography, does the chef send the evening's meal in advance to the selected presenter?\n\nPlease keep me informed regarding the 400th dinner, and thank you very much for the image. If you have any others that you would care/are allowed to share, I would love to add them to my presentation archive. You may email them directly to me at\n\n[typographer@gmail.com](mailto:typographer@gmail.com)\n\nThank you.\n\n(I am going to try to have the title of this thread changed to \"Double Crown Club\" without the broken wiki mention.)\n\n"
    },
    {
      "time": "12 Dec 2008 — 9:25am",
      "content": "There is nothing quite like the Double Crown Club, or so its members would have you believe. In London there is also the Wynkyn de Worde Society, set up in the late 1950s, which has lunches in the middle of the day instead of dinners in the evening. I am not sure it would like to be thought of as a satellite. It used to be business-like rather than gentlemanly, and it was hard-drinking, and thick with smoke too I should think. But it has probably settled down in its old age, and appeals to people who do not live in London and who want to get back home in the evening. And who can spend three hours or so on lunch. A few people belong to both clubs. A great many people have never heard of either of them.\n\nA different designer is responsible for each menu and for the invitation or advance notice of the dinner, and some of these are well worth looking at. As I said, Moran’s book reproduces several from the past, but there is nothing quite like seeing the the colours and special papers of the originals. The designers and the speakers are not encouraged to interfere with the choice of the food.\n\nAs for the names of members of the Club, these are for other members only. Maybe not everyone wants his or her membership to be widely known.\n\nHere is the only other bit of printing for the club that I could find immediately, quite a small one. (I’ll send one or two others to you directly if I can find them.) It is the invitation to the 140th dinner, which was in 1957, a joint event with the Gezelschap Nonpareil, a Dutch typographical club. It took place at All Souls College, Oxford, and the speaker was Harry Carter, talking about ‘Dutch Types and Oxford Printing’. The invitation was set in the ‘Fell’ types and printed at the University Press. I am not quite sure how I got it, but I kept it because it uses an ornament that I am fond of, a 16th-century design that is attributed to Robert Granjon. It used to be cast at Oxford from a pair of original matrices.\n\n ![](http://web.archive.org/web/20140802204913im_/http:/typophile.com/files/DCC%20-%20invitation%20to%20Dinner%20140%201957%20500_6595.jpg)\n\n"
    },
    {
      "time": "23 Feb 2014 — 3:53pm",
      "content": "Chris,  \nDOUBLE CROWN CLUB 1924 - FIRST RULES & MEMBERSHIP LIST  \n [http://www.ebay.com/itm/DOUBLE-CROWN-CLUB-1924-FIRST-RULES-MEMBERSHIP-LI...](http://web.archive.org/web/20140802204913/http:/www.ebay.com/itm/DOUBLE-CROWN-CLUB-1924-FIRST-RULES-MEMBERSHIP-LIST-VERY-SCARCE-/151187037738?pt=Non_Fiction&hash=item2333731e2a \"http://www.ebay.com/itm/DOUBLE-CROWN-CLUB-1924-FIRST-RULES-MEMBERSHIP-LIST-VERY-SCARCE-/151187037738?pt=Non\\_Fiction&hash=item2333731e2a\")\n\n"
    }
  ]
}
