{
  "id": "52510",
  "title": "Rating the Importance of Features",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Something I’ve been thinking about the past few days and figured would spark an interesting discussion.\n\nWhat features / styles / etc are most important in a font family to you? Eg, list first the ones you absolutely must have, followed by ones that you would have to think twice about buying if not present, to ones that are really nice and useful, then ones that you think are nice but probably won’t use and lastly ones you find quite useless (edit: or add your own category of use-full/less-ness)\n\nSo out of this in-no-particular-order list, which features are most important? Least important? What other features do you find particular useful/worthless? In principle this question is more about text faces than display faces.\n\n- italic\n- reverse italic\n- upright italic\n- \\>1 italic angle\n- bold\n- \\>2 weights (light demi extra)\n- reverse italic\n- small caps\n- multiple scripts (if so which)\n- extra ligatures\n- double struck\n- outline/contour\n- hinting\n- arrows\n- dingbats\n- math symbols\n- other symbols\n- super-/subscript numbers\n- super/sub-script letters\n- script-script numbers/letters\n- language-specific glyphs\n\nEdit: some other potential categories to fill in\n\n- bold italic\n- caption/text/display variants\n- serif/sans in same family\n\nAlso, to which extent should any of these glyphs (scripts / small caps) be spread out across the weights and inclines?\n\n [‹ Pricing for one page real estate listing web site](http://web.archive.org/web/20081211012527/http:/typophile.com/node/52547 \"Go to previous forum topic\") [Legibility/Aesthetics - Improving the reader experience. ›](http://web.archive.org/web/20081211012527/http:/typophile.com/node/50834 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081211012527/http://typophile.com/user/16708\" title=\"View user profile.\">guifa</a>",
  "time": "<br>",
  "uid": "16708",
  "comments": [
    {
      "time": " 9.Dec.2008 5.32pm",
      "content": "By “\\>1 italic angle” do you mean (1) there is a font with an italic angle, and it is greater than one, or (2) there are multiple italic fonts, with different angles? Which ligatures do you consider basic, that “extra ligatures” are an addition to? By “hinting” do you mean that the alternative is an unhinted font? What the heck are “script-script numbers/letters”?\n\nThat aside, here is a first take at some answers, from my personal POV as an end user of type, rather than as a type designer (nor in terms of Adobe’s priorities):\n\nFeatures should be present in all weight and inclines unless they really make no sense in that font.\n\nMust have:  \n- italic  \n- bold  \n- hinting\n\nUnlikely to buy without:  \n- small caps\n\nReally nice, useful:  \n- \\>2 weights  \n- extra ligatures  \n- super/subscript numbers  \n- super/subscript letters\n\nNice but won’t use much:  \n- upright italic  \n- arrows  \n- dingbats  \n- math symbols  \n- other symbols  \n- multiple scripts\n\nNot much use to me personally:  \n- language-specific glyphs\n\nJust plain silly:  \n- reverse italic  \n- double struck\n\n"
    },
    {
      "time": " 9.Dec.2008 5.45pm",
      "content": "<cite>By “&gt;1 italic angle” do you mean (1) there is a font with an italic angle, and it is greater than one, or (2) there are multiple italic fonts, with different angles? Which ligatures do you consider basic, that “extra ligatures” are an addition to? By “hinting” do you mean that the alternative is an unhinted font? What the heck are “script-script numbers/letters”?</cite>\n\n\\>1 italic angle I meant having two or more distinct angles (say, 10 and 20º). Basic ligatures would be the ones that more easily slide into the background like fi that correct for potential collisions etc, with the “extra” ones being of the more flashy ct/it/st style. script-script would be a superscript to a superscript optimized form (some of the things I threw in the list like script-script, reverse italic and such I knew had very specific uses but I figured I’d open the field up as wide as I could).\n\nAnd re hinting, by including hinting I mean a designer going beyond what any font program’s autohint would provide.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 9.Dec.2008 6.04pm",
      "content": "<cite> Just plain silly</cite>\n\nWell, double struck characters are used in mathematical notation, which doesn’t strike me as silly.\n\n"
    },
    {
      "time": " 9.Dec.2008 6.59pm",
      "content": "Okay, so that would move to “not much use to me personally” instead....\n\nI’m assuming that these double-struck characters have a usage distinct from bold characters? (Double-strike is how “bold” used to be simulated on typewriters.)\n\nT\n\n"
    },
    {
      "time": " 9.Dec.2008 7.48pm",
      "content": "Oddly enough, the most important feature for me is that it be relatively easy to obtain permission to modify the font. Modifications I’ll make would be (1) to add characters, esp. easy-to-create ones such as glyphs with diacriticals, extra ligatures, true-cut superiors, etc., and (2) to add or modify features, usually just to include the extra characters just made up — such as “extra” (but functional) ligatures (fb, fk, fh, f-with-accented vowels, etc.), angle brackets to swap out the greater & less symbol when the text includes \\< http \\>, and on & on.\n\nI don’t think it is possible for the font designer to include everything that will come up, and a text interior designer often doesn’t take into account what a font has before specifying it. The comp gets stuck with setting the text, and it is just easier to make the changes in the font than to make them in the file.\n\nMost text designers I know (which includes me) don’t purchase a font because of it’s features, we select it because we like it, or sometimes just because it fills a need. We might, with reluctance, rule it out because it lacks needed features or characters. Big things that might rule out a purchase (rather than a use for a particular title), include the lack of an italic, roman small caps, and both old-style and lining numbers. Most of the many other things needed can be filled out by someone who has only workman-like skill.\n\n"
    },
    {
      "time": " 10.Dec.2008 6.44am",
      "content": "I do often choose to add fonts to our type library based on the features they may include. That’s because I’m lazier than Charles and have never learned any of the font editing tools. So since modification is not an option for me, I must find types that have what I want. I have rejected some very nice faces because the font set lacked certain features.\n\nSo my basic features list will include roman and italic small caps; true-drawn superior figures; a full range of f ligs (given all the work we do about Norway, I really need that fj lig for fjords); and good set of made fractions, along with all the elements to create piece fractions that match the made ones.\n\nI don’t want a bold, but I do want a medium, or a semibold or demibold, depending on what it is called and its color. I’d like the features listed above to be present in the medium also.\n\nI’m drawn toward the idea of a matching sans, but it is not of utter importance.\n\nI’ve never been interested in this critter known as the “caption” variant. I seem to do OK with italic or sans for captions. Old-school, I guess.\n\nTrue-drawn superior letters will be nice also.\n\nGiven the nature of the work I have done, do now, and will likely do in the future, that about fills my needs.\n\nIt is interesting that this topic comes up just a few days after a topic has been started about type specimens: [http://typophile.com/node/52442](http://web.archive.org/web/20081211012527/http:/typophile.com/node/52442 \"http://typophile.com/node/52442\"). It is a well-made specimen that allows us to see just what lives inside a font, and thus whether or not we should get a license for that font.\n\npowers\n\n"
    },
    {
      "time": " 10.Dec.2008 8.04am",
      "content": "Here are my thoughts, based on the sort of books I’m used to working on.\n\nEssential (I won’t ordinarily pick a text face without them):  \n- italic  \n- small caps  \n- basic math symbols (the ones in MacRoman at minimum)  \n- semibold, or a bold that isn’t too heavy\n\nVery important (a text face with them is much more likely to be considered):  \n- multiple scripts (Polytonic Greek, Cyrillic): I regularly need polytonic Greek for the books I set; Cyrillic I don’t really use as much as Hebrew or Arabic, but Greek and Cyrillic are different in that their designs typically have enough relation to the Latin that the visual dissonance when they aren’t quite coordinated is unpleasant  \n- hinting  \n- super-/subscript numerals  \n- language-specific glyphs: either lots of them or, as Charles suggests, easy permission to modify the font  \n- multiple cuts (e.g. caption/text/display): most of the things I set have footnotes, and a page really does look better if the chapter head, the text, and the footnotes are not all generated from the same outlines  \n- extra ligatures: it depends on the meaning of “extra”; I’m assuming you mean anything beyond f\\_i and f\\_l\n\nNice and useful (will be considered but probably not the deciding factor):  \n- super-/subscript letters  \n- \\>2 weights  \n- arrows  \n- additional math symbols and other symbols\n\nThe rest may be nice but not terribly useful to me; the only ones I would pick out as being really useless for me are reverse italic and upright italic. The multiple cuts need to be available for all the scripts; I’ve had Greek show up everywhere from footnotes to chapter heads. I can live without a regular-italic distinction for Greek, if the regular is fairly calligraphic.\n\n"
    },
    {
      "time": " 10.Dec.2008 8.20am",
      "content": "Is “caption” variant simply letterforms tuned to small settings (lower contrast, higher x-height)?\n\n"
    },
    {
      "time": " 10.Dec.2008 9.33am",
      "content": "Craig —\n\nThere are two different variants that “caption” might conjure in this context.\n\nThe earlier one is the sort of alternative italic, like the one that accompanies the digital version of Fairfield (not part of the original design, BTW). This approach and nomenclature is patterned after what Matthew Carter did for some custom work for <cite>National Geographic,</cite> where he created a more open, simplified italic for their use in captions, and thus called “Caption.” (This is many years back; not currently employed.)\n\nThe other variant is the small optical size that Adobe calls “caption” in its typical suite of optical variations. This is what you’re referring to, I presume.\n\nI don’t know which Will is referring to.\n\n— K.\n\n"
    },
    {
      "time": " 10.Dec.2008 10.04am",
      "content": "Will was referring to the alternative italic. Will likes optical sizes. He regrets he did not make this clear.\n\npowers\n\n"
    },
    {
      "time": " 10.Dec.2008 2.17pm",
      "content": "Must have:  \n1) Italic  \n2) Small Caps\n\nWould think twice about buying if not present:  \n4) Black weight\n\nPlus, I appreciate the presence of other Scripts and mathematic or scientific symbols, and historical variants or ligatures if I need to use them in a project, to avoid unpleasant pairing with other unrelated types.\n\n"
    },
    {
      "time": " 10.Dec.2008 4.10pm",
      "content": "<cite>It is interesting that this topic comes up just a few days after a topic has been started about type specimens</cite>\n\nActually, it was the other long long running thread(s) about what people want in licenses that inspired this (I didn’t see the specimen thread until just now). After seeing what people wanted from a licensing perspective I figured I’d be interesting to see what people wanted from a design perspective. Charles makes a good point that a font needs to be user-editable, and while that works well if you need a letter or two that’s not been doing or you need to make a customized letter that’s not otherwise expected or something, I don’t think most (any) people would take the default Times they get on their Mac and rework it to add in a full range of small caps and sub/superscript letters... that could be a week or two of work which ultimately makes it cheaper to just get a font that already has it.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
