{
  "id": "52511",
  "title": "New My Fonts beta site! When did it come out?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Wow, the new My Fonts site looks great:\n\n[http://new.myfonts.com/fonts/adobe/helvetica-neue/helveticaneue-ultralight/](http://web.archive.org/web/20111027034743/http:/new.myfonts.com/fonts/adobe/helvetica-neue/helveticaneue-ultralight/ \"http://new.myfonts.com/fonts/adobe/helvetica-neue/helveticaneue-ultralight/\")\n\nDoes anyone know when it was first made available? :-)\n\n",
  "author": "<a href=\"/web/20111027034743/http://typophile.com/user/16849\" title=\"View user profile.\">abattis</a>",
  "time": "<br>",
  "uid": "16849",
  "comments": [
    {
      "time": "",
      "content": "Huge improvement! The \"related tags\" sidebar on the right is a great idea. The scalable bar for the samples is nice too.\n\n"
    },
    {
      "time": "",
      "content": "Not just a huge improvement over MyFonts, but over most of the industry.\n\n"
    },
    {
      "time": "",
      "content": "I'd like to know who is responsible for the Rawhide joke.\n\n"
    },
    {
      "time": "",
      "content": "where's the joke?\n\nthe site looks good.\n\n"
    },
    {
      "time": "",
      "content": "The reborn Mefonts is facking great! If only they had remonikered it \"Mefonts\" I would be ecstatic. As it is I'm merely a very happy man. I mean, they've come up to speed with their technology and visitor experience, but the brand experience still lacks somewhat in \"want it\" vibes. Notwith-standing I'm giving the new site a top rating.\n\nHave you guys tried out the OT feature switching palette? It's facking great! You can turn on and off all three levels of ligation in my new [Jabberwub font](http://web.archive.org/web/20111027034743/http:/new.myfonts.com/search/jabberwub/fonts/). Click the \"ff\" lig Advanced typography widget then try checking and unchecking LIGA, DLIG, CALT, SALT, HIST and FRAC. Of course this thingy works for other fonts with OT features ;^)\n\n_Not just a huge improvement over MyFonts, but over most of the industry._\n\nExactly! They've raised the bar for everybody else. Whaddaya mean \"most\"? Whacha talkin'bout Willis? \\*All\\* of the industry buddy, all of it.\n\nWhat was it about the Fontshop website and interface all those peeple were saying is so great only a week ago? There goes that.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Wow. A 1000% improvement!\n\n"
    },
    {
      "time": "",
      "content": "It doesn't look like 1992 anymore! Awesome.\n\n"
    },
    {
      "time": "",
      "content": "Nick & the rest have been working a long, long time on this. I wish I could take some credit but all I did was sit on the sidelines and say \"wow, that looks great\" as they added useful, well-integrated features.\n\nI am really proud to be part of this company and to work with people like Nick, John, Kevin, Laurence, Adam, Jan and the few other folks I've worked with directly.\n\nIt really is not just an improvement but a terrific and terrifically useful new site and a showcase for some excellent type. And it's finally an honest and apt representation of the dedication these people have to this company and to type design in general.\n\nIt's not 100% finished, either, although it may seem it ... look for more to come!\n\nJoshua\n\n"
    },
    {
      "time": "",
      "content": "James - scroll quickly through the Family Members widget. I was amused.\n\nCongrats to Nick (my favorite visiting [foosball teammate](http://web.archive.org/web/20111027034743/http:/flickr.com/photos/hellotheresa/3066399324/)) and the other boys for a rejuvenation well done.\n\n"
    },
    {
      "time": "",
      "content": "@Stephen - ok, i did it , but they have like 3 or 4 sayings, so when i looked earlier i missed it... :)\n\n"
    },
    {
      "time": "",
      "content": "I'm optimistic that font buyers will be able to get a good look at how well glyphs are drawn, and how the OpenType features in fonts work.\n\n"
    },
    {
      "time": "",
      "content": "Absolutely great. Can't wait to see it live.\n\nThe \"Buy it!\" yellow rectangle and the new \"Buying choices\" page are a huge improvements too. On the old site it happens quite often that people make double purchases.\n\n"
    },
    {
      "time": "",
      "content": "That is a very nice redesign. Major improvement. :)\n\n"
    },
    {
      "time": "",
      "content": "How similar is it to the [new open font library site](http://web.archive.org/web/20111027034743/http:/openfontlibrary.fontly.org/)?\n\nIs the similarity a good or a bad thing?\n\nI've been involved in the OFLB redevelopment that started in September, and AFAIK they are independent designs!\n\n"
    },
    {
      "time": "",
      "content": "<cite>.. how the OpenType features in fonts work</cite>\n\nA small (small!) nag -- there's no new web site without it.\n\nSelecting 'terminal forms' changes every possible character to its terminal, whether at the start of a word, in the middle, or at the end.\n\n"
    },
    {
      "time": "",
      "content": "Unless you count the white background and blue links, the new Myfonts site is not similar at all to the new open font library site. There are loads of other sites with a similar look and feel to the new open font library site. Bet you fifty bucks I can find one much closer to it than the new Myfonts.\n\n_Is the similarity a good or a bad thing?_\n\nI don't think it matters. So many websites are so similar, and at a resolution of not much more than 100 dots to the inch on the viewing end (average screen resolution), this similarity is about as far as you can get from surprizing and it isn't hard to understand why either.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "_A small (small!) nag — there’s no new web site without it._\n\nWhat?  \nSorry, what?  \nWhat do you mean?  \nNo new website without it?  \nLet's assume you mean only font websites. Fontshop site doesn't have OT features display, neither does Phil's Fonts. I'm not going to fonts.com to find out they don't have it either. Don't make me visit fonts.com\n\n_Selecting ’terminal forms’ changes every possible character to its terminal, whether at the start of a word, in the middle, or at the end._\n\nYes? It's early days hombre, what do you honestly expect, a fully developed web application with all the bugs knocked out of it ryte off the bat?\n\nI think the purpose of the type tester is to show font buyers what a font has under the hood. I don't think it's meant to show OT features working in context the way they would in a desktop application. If it was meant to do that Myfonts would give font buyers the ability to choose paper color and font ink color, surely. Yes I think so. I'm pretty shure about that.\n\nYou know, if you give it some thought before you start typing you can figure out the answers to most of these questions.\n\nThink.  \nJust think.  \nWait stop, don't think too much, you'll get into trubble like I do.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Looks good. Just one small thing; the (OT) samples would look better if the features were enabled, (looking at the hot new fonts page). But I'm not complaining. :^)\n\nNick Cooke\n\n"
    },
    {
      "time": "",
      "content": "<cite>What? Sorry, what? What? What? What? What? What? What?<br>\nNo new website without it? What? What? What?</cite>\n\nSmall nags.\n\nIt appears you didn't pick up the emphasis on \"small\". That's what the repeated phrase with the exclamation point was for: \"(small!)\"\n\n<cite>You know, if you give it some thought before you start typing you can figure out the answers to most of these questions.</cite>\n\n(restraining myself here)\n\n"
    },
    {
      "time": "",
      "content": "The presentation of OpenType Layout features and character maps is still in development stage, you should see more improvements in the coming weeks.\n\nRegards,  \nAdam Twardoch  \ntypographic consultant  \nMyFonts\n\n"
    },
    {
      "time": "",
      "content": "Adam, any clue on when the new site will go live?\n\n"
    },
    {
      "time": "",
      "content": "Well, they really couldn't have gone any other way than up from what they had.\n\n"
    },
    {
      "time": "",
      "content": "it's great you've noticed the new beta site, hopefully you've also noticed the forum for feedback:  \n [http://new.myfonts.com/feedback/](http://web.archive.org/web/20111027034743/http:/new.myfonts.com/feedback/ \"http://new.myfonts.com/feedback/\")\n\nif you scroll to the bottom of this page, you notice that the first notes regarding fixes are dated sept 19, 2008, so imagine that it was 'announced' right around this time. i was able to see a version at typecon in July and give Nick some feedback. the redesign certainly is something for the myfonts folk to be pround of, for sure.\n\n"
    },
    {
      "time": "",
      "content": "I love the new site. It really shows off the fonts. It's neat how, when you are scrolling through a list of search results, it automatically loads new ones at the bottom as you scroll up. The first version I saw (at TypeCon) didn't have that yet--it had a \"load more results\" link at the bottom instead. The new way is much nicer and an efficient use of bandwidth since it doesn't load more results than necessary.\n\n"
    },
    {
      "time": "",
      "content": "Just took a look at the Open Font Library site, \"typefaces we can all share\", and am pleased to see that Helvetica is its corporate face.\n\n"
    },
    {
      "time": "",
      "content": "I think it's just awesome and I can't wait for it to go live.\n\nI've been watching 'em build it for a few weeks now,  \nand I've been so impressed to watch a website get just  \na little bit better \\*every day\\*. It just keeps getting smarter,  \neasier and prettier.\n\nI like the tags clouds a lot. But I think my favorite part is  \nchecking out all my fonts displaying headlines from  \nThe Onion. It's a great, funny new way for me to look at  \nmy fonts that I sell there. It makes me so proud to see  \nmy fonts (and MyFonts) looking so good and being so clever.\n\nIt's just a great new site and it's so great to see such a  \nsmart, functional marketplace available to all the indie  \nfont producers of the world. We are lucky.\n\nGood job, MyFonts!\n\n"
    },
    {
      "time": "",
      "content": "I love the new ways fonts can be viewed, but I found the scroll down auto loading feature problematic. If you click on one of the more common tags like \"handwriting\" the number of loads seems too much for even faster connections. I would scroll down near them bottom and then get stuck as it loaded another batch. I think a 100 or so samples per page would be more stable when you've got thousands of samples to load.\n\n"
    },
    {
      "time": "",
      "content": "My internet connection is fairly fast (17-20 Mbps down), so the samples \"below the fold\" are usually there by the time I scroll to see them. With a slower connection I guess it might not be so seamless. FWIW, I don't think it's pre-loading more than a screen-full at a time, so even if there are hundreds, they aren't all being loaded at once.\n\n"
    },
    {
      "time": "",
      "content": "Theunis, I was only winding you up. It was a joke, a satirical style of post designed to parody the absurdity of online discussion fora.\n\n_It appears you didn’t pick up the emphasis on “small”. That’s what the repeated phrase with the exclamation point was for: “(small!)”_\n\n[... ...]\n\n(restraining myself here)\n\nApparently you assumed I made my remarks in bad faith. How anybody could take a cartoon performance like mine for real is beyond me.\n\nFacking Jesuz, it's like talking to bricks around here.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "[Official newsletter on Underware.nl](http://web.archive.org/web/20111027034743/http:/www.underware.nl/site2/index.php?id1=underware&id2=case-studies&id3=03&id4=&id5=&idpic=1#pictloader) about the new logo, posted today.\n\n_\"It has a secret bonus for those who get it, but still functions as a contemporary hand-painted logo for those who don’t.\"_\n\nI already thought that 'My' part in the logo was somewhat odd, but I hadn't connected the dots. Now I like it even more.\n\n"
    },
    {
      "time": "",
      "content": "_I already thought that ’My’ part in the logo was somewhat odd, but I hadn’t connected the dots._\n\nSame here. Took me some time to see the hand eventually.\n\n"
    },
    {
      "time": "",
      "content": "Yes, I think it's awesome. :)\n\n"
    },
    {
      "time": "",
      "content": "wow, i didn't see it until now either! that is awesome! (now i get it!)\n\n"
    }
  ]
}
