{
  "id": "52523",
  "title": "What's this Trajan-like font, please?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "At first glance this has some similarities to Trajan but it's clearly not that. Can anyone help me find out what it is? Thanks.\n\n ![](http://web.archive.org/web/20141113044511im_/http:/typophile.com/files/Playhouse-logo_4185.jpg)\n\n",
  "author": "riffian",
  "time": "10 Dec 2008 — 4:22am",
  "uid": "40516",
  "comments": [
    {
      "time": "10 Dec 2008 — 4:29am",
      "content": "That is a really crap alteration of Trajan by an amateur, It is SO bad.\n\nNick Cooke\n\n"
    },
    {
      "time": "10 Dec 2008 — 5:11am",
      "content": "The reason I think it's a font in its own right is that the W and U are so different, and so are the serifs, so I don't think it's Trajan that's been altered.\n\nI'm pretty sure I've seen this font or something similar a long while ago, but I can't remember the font's name - my memory is so bad these days...\n\n"
    },
    {
      "time": "10 Dec 2008 — 5:53am",
      "content": "Although it is not Albertus it is an eerily similar light version of Wolpe's work from the 30's with a bit more thick/thin variation. I believe the O is implanted and this could be a bad redrawing of his work. Note the structure of the W and the leg of the R. The weights are all over the place so it could have possibly been drawn/painted by a drunk signpainter : )\n\n.Michael\n\n"
    },
    {
      "time": "10 Dec 2008 — 6:40am",
      "content": "I don't think so. It must have been done for Norwich Playhouse. It's so uneven, who'd want to pay good money for it?\n\nGet in touch with NP and ask them who did it.\n\nNick Cooke\n\n"
    },
    {
      "time": "10 Dec 2008 — 7:21am",
      "content": "\"It’s so uneven, who’d want to pay good money for it?\"\n\nPeople with no taste! And who said they paid : )\n\nMichael\n\n"
    },
    {
      "time": "10 Dec 2008 — 7:47am",
      "content": "Went to the site and the logo there is not reflective of the one above. Completely different. I think the above is maybe from a sign or something custom done. Oddly enough, as I went through the site guess what type appeared... are you ready... ALBERTUS! Those stem to \"serif\" transitions are pretty hard to mistake!\n\n ![](http://web.archive.org/web/20141113044511im_/http:/typophile.com/files/Picture7_6064.png)\n\nMichael\n\n"
    },
    {
      "time": "10 Dec 2008 — 7:13pm",
      "content": "Edit: Never mind... it was snide.\n\nMichael\n\n"
    },
    {
      "time": "13 Dec 2008 — 3:55am",
      "content": "\"The weights are all over the place so it could have possibly been drawn/painted by a drunk signpainter : )\"\n\nThat gave me a chuckle! The logo as I've been given it, which is the image in my first post, (even though I asked for a high resolution image!) looks like it's a photo of a bad photocopy of a scan, which might explain some distorting effects. Certainly the U has bleached out a lot, becuase looking at the sign on the Playhouse building the counter of the U joins up to the spur; there isn't a gap as in the image above.\n\nThanks to all for your helpful posts. I still haven't found the font.\n\n"
    },
    {
      "time": "13 Dec 2008 — 6:30am",
      "content": "My guess is Weiss Std - one of Adobe Font Folio collection:  \n [http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=...](http://web.archive.org/web/20141113044511/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFont&code=WSSQ10005000 \"http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFont&code=WSSQ10005000\")\n\nOnly that the image might be suffering from some retouch.\n\n:D\n\n--- pinky kinky winky ---\n\n"
    },
    {
      "time": "13 Dec 2008 — 2:50pm",
      "content": "Mark\n\nWhen I saw the Albertus on the windows I figured they brought in someone to do some additional work and they probably said \"can you emulate this?\" But as I said if you look at the stem to serif transitions you can definitely see the relation. When I first looked at your attachment the Albertus alarm went off because some of the critical characters are direct draws with perhaps a little bit of inexperience with thick and thin thrown in. The upper left join of the N is different and the terminals of the E, C and S don't match but that is why I said he/she was inexperienced. If you look at the playroom piece you can see the same small O that is monoline and the \"serif\" structure I am talking about.\n\nBut then it could just be an ugly free font : )\n\nMichael\n\n"
    },
    {
      "time": "13 Dec 2008 — 2:57pm",
      "content": "No, the logo on the window is surely based on Albertus (but it's for \"Playroom\").  \nThe main \"Playhouse\" logo is surely handlettered, no matter bad or good.  \nThey should give you the logo, otherwise they do not care in the first place, it seems…\n\n"
    }
  ]
}
