{
  "id": "5252",
  "title": "Whither typographi.ca?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I haven't been able to log in to typographi.ca for the last few days. What's the buzz?\n\n",
  "author": "kristin",
  "time": "Thu, 2004-06-17 05:56",
  "uid": "1553",
  "comments": [
    {
      "time": " Thu, 2004-06-17 06:17",
      "content": "Its part of a massive crackdown by the US government on .ca domain names registered to a sleeper cell of typographic insurgents located in the US and Sweden. Actually I think Stephen mentioned somewhere that the issue was with the .ca domain.\n\n"
    },
    {
      "time": " Thu, 2004-06-17 06:45",
      "content": "The Canadians are the ones getting feisty, I believe.\n\n"
    },
    {
      "time": " Thu, 2004-06-17 07:45",
      "content": "I miss Typographica...   \n   \nBoo Hoo. Boo Hoo Hoo.... Hoo.   \n   \n ![:-(](http://web.archive.org/web/20050825061947im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": " Thu, 2004-06-17 07:51",
      "content": "the .ca name expired and canada needs an ID to prove the owner is canadian (or something like that). Last I heard, they're faxing the stuff in.\n\n"
    },
    {
      "time": " Thu, 2004-06-17 09:03",
      "content": "CIRA, the Canadian Internet Registration Authority, took acceptation to the declared ownership of the typographi.ca domain, which they have the right to do according to their charter and rules. The domain wasn't exprired, per se, but suspended - and the name server entries deleted from the domain record. Without those entries, your browser can't locate the server. Regardless of the rational behind the situation, the way that CIRA deals with these issues is extremely heavy-handed.   \n   \nI mentioned some more tidbits regarding this debacle over [here](http://web.archive.org/web/20050825061947/http:/blog.veer.com/archives/000512.html).\n\n"
    },
    {
      "time": " Thu, 2004-06-17 09:16",
      "content": "Sounds like another violent reaction to being generally considered as just another US state.   \n   \n\"Porous border?! You should see the one between California and Arizona!!\"   \n   \nhhp\n\n"
    },
    {
      "time": " Thu, 2004-06-17 10:38",
      "content": "Given the generally lax state of law enforcement on the Wild West that is the Internet, all I can say is,   \n\"Kick , Canuck bureaucrats, you rock!\"   \n   \n(2bad Typographica got caught in the sweep tho'. Hope you are handling the DT's OK, Hrant.)\n\n"
    },
    {
      "time": " Thu, 2004-06-17 10:45",
      "content": "Actually the Canadian timing is exquisite: I have only two more days to finish preparing my talk for Greece! :-\\>   \n   \nhhp\n\n"
    }
  ]
}
