{
  "id": "52530",
  "title": "British / American font issues",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi there,\n\nNewbie on here and after some pretty specific advice as I'm pretty baffled.\n\nLong story short, I work for an American company in the UK. I get and back-up work to a US based server. All of my fonts are owned by the company in the US and emailed over / downloaded from the States, so are the same fonts used by my American colleagues.\n\nWe're all running CS4 on OS 10.4 or later.\n\nNow, here's the catch: when I open a document in InDesign from the American server, the fonts (normally Helvetica Neue or Gotham, both OTF) are appearing as the same font but as a T1 version, which means that I have to convert all the fonts back to OTF even though technically they should already be the same. We've had this issue in all of the Creative Suite as well as opening them up on PC here in the UK as well, and it seems to happen in any document, no matter what version of CS it was created in.\n\nI'm running out of ideas now and although it's not a major problem converting the fonts, it is a little annoying and certainly adds to potential for a cock-up somewhere down the line.\n\nAll advice or ideas welcome, many thanks!\n\n",
  "author": "Pimpmasterjazz",
  "time": "10 Dec 2008 — 8:30am",
  "uid": "40526",
  "comments": [
    {
      "time": "10 Dec 2008 — 9:45am",
      "content": "I don't really understand what you are saying. You are using the same fontfiles (which is already somewhat dubious, licensing wise), and they automatically change from OTF to T1?\n\nThat's impossible.\n\n"
    },
    {
      "time": "10 Dec 2008 — 5:04pm",
      "content": "This title is misleading...I was hoping for something more interesting. The problem probably somehow relates to the company using both versions of the same fonts. You can always use features like File \\> Package... to see what fonts the document is using as well as collecting them out.\n\nMore importantly, do Britons think that Tobias Frere-Jones' Interstate should be called Dual Carriageway? Come to think of it, what font do UK highway signs use...? Gill Sans? I suppose I could look it up...\n\n"
    },
    {
      "time": "11 Dec 2008 — 2:23am",
      "content": " **\"That’s impossible.\"**\n\nThat's what I thought, but apparently it's not.\n\nI can only conclude that the program is reading the original fonts as T1 which seems very, very odd, but still doesn't really help me.\n\nBut outside it being impossible, do you have any constructive suggestions or ideas?\n\ncanderson: Many thanks. I've delved a little further and it seems that the font type isn't actually recognised, but it would seem to be defaulting to naming it (T1) in the type palette.\n\nThis may be of interest: [http://www.cbrd.co.uk/media/fonts/](http://web.archive.org/web/20131108014131/http:/www.cbrd.co.uk/media/fonts/ \"http://www.cbrd.co.uk/media/fonts/\")\n\nI think 'Interstate' is safe - I don't think that 'Dual Carriageway' has quite the same romantic connotations... ;-)\n\n"
    },
    {
      "time": "11 Dec 2008 — 1:27pm",
      "content": "\"Interstate\" has romantic connotations?\n\n"
    },
    {
      "time": "11 Dec 2008 — 4:57pm",
      "content": "This is what happens when we start monkeying around with our fonts. ;^) I would email the foundries from whom you licensed the fonts and ask for their help.\n\n"
    },
    {
      "time": "11 Dec 2008 — 5:09pm",
      "content": "Hi Neil,\n\nThis all sounds ominous and more than a little unpleasant, but please contact our office for any technical assistance regarding the Gotham fonts that you or your employer have licensed. Our contact details are here: [http://www.typography.com/about/contact.php](http://web.archive.org/web/20131108014131/http:/www.typography.com/about/contact.php \"http://www.typography.com/about/contact.php\")\n\nYours,\n\nJonathan Hoefler\n\n"
    }
  ]
}
