{
  "id": "52540",
  "title": "Sentinel Jabberwub type",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello!\n\nNow and then the odd type designer makes a truly spontaneous display type graphic designers find inspiring & irresistable.\n\nIntroducing ----- [Sentinel Jabberwub](http://web.archive.org/web/20140821033036/http:/www.myfonts.com/fonts/sentinel/jabberwub/)-----\n\n ![](http://web.archive.org/web/20140821033036im_/http:/typophile.com/files/jabberwub_fonta_poster_6525.gif)\n\n============begin news release==============\n\nA fresh new decorative display face bubbling with life & spontaneity, Jabberwub belongs to a rare genus of creature fonts that type forgot—casual animated. A fun & bouncy eye-catcher dancing a whacky line between discord & rhyme, Jabberwub packs tons of fun into a state-of-the-art OpenType font loaded with 270 extra glyphs, including stylistic alternates, discretionary ligatures, word ligatures and capitalized ligatures, allowing creative typographers to achieve a custom hand-lettered look without all the mess & spilt glue of a manual paste-up job.\n\nJabberwub is ideal for whatever zany stuff springs to mind. It takes an outline with no problem-o, and you can squish & squoosh it as the occasion takes your fancy. Optimal results are achieved by hand setting each individual glyph. Available in OpenType only.\n\nJabberwub can be viewed and test driven now at Myfonts:  \n [http://www.myfonts.com/fonts/sentinel/jabberwub/](http://web.archive.org/web/20140821033036/http:/www.myfonts.com/fonts/sentinel/jabberwub/ \"http://www.myfonts.com/fonts/sentinel/jabberwub/\")\n\n==============end news release==============\n\nj a m e s\n\n",
  "author": "James Arboghast",
  "time": "10 Dec 2008 — 12:51pm",
  "uid": "9349",
  "comments": [
    {
      "time": "10 Dec 2008 — 2:40pm",
      "content": "Good thing, too! James released it just in time for me to use it for the current Type Battle! :-)\n\n ![](http://web.archive.org/web/20140821033036im_/http:/typophile.com/files/DezstackPig_4827.png)\n\nChrisL\n\n"
    },
    {
      "time": "12 Dec 2008 — 9:09am",
      "content": "Hah! This is good. It's always fun to see a new baby in use.\n\nj a m e s\n\n"
    },
    {
      "time": "13 Dec 2008 — 6:59pm",
      "content": "By now you must already have been contacted by any number of bubblegum producers, so I won't propose that.  \nBut governments could adopt it, for making their bleak signage look friendlier. For example,\n\n[This image was removed at the request of Sentinel Type and James Arboghast.]\n\n(I searched for that old chestnut \"Communism is 50 miles away\" but couldn't find it -- too bad!)\n\n"
    },
    {
      "time": "13 Dec 2008 — 9:42pm",
      "content": "I know from my sales records you haven't purchased Jabberwub, so you must have done this with the type tester on the new myfonts site. That's unauthorized use of the font and a breach of the Myfonts site copyright and use of content terms and conditions. Congratulations you just got into my bad book.\n\nIf Stephen Coles or anybody else comes in here and says the position I choose to adopt on this is ridiculous or \"just silly\", I recommend they talk to Erik Spiekermann or John Collins about why thier companies have these terms and conditions governing site content use on their websites in the first place.\n\nj a m e s\n\n"
    },
    {
      "time": "14 Dec 2008 — 8:09pm",
      "content": "hold on JAmes mate---I thought you said this was s bit of a joke?!?! i Didnt realise you were selling the bloody thing!! good one mate!! Does this mean thatn the jokes on them???\n\n-----------------------  \nChopper Reid says \"Harden the \\*\\*\\*\\* up\".\n\n"
    },
    {
      "time": "14 Dec 2008 — 10:47pm",
      "content": "If you're going to be strict about copyright James, better not to use Fanta in your promotion.\n\nBTW, that's a very silly typeface :-)\n\n"
    },
    {
      "time": "16 Dec 2008 — 9:04am",
      "content": "Nick—it's \"Fonta\", not \"Fanta\". Fonta may look like a rip-off of Fanta to some eyes. But you should know I have redefined what an \"o-n\" ligature looks like. I'm waiting for Coca-Cola's branding communications peeple to tell me I've violated their Fanta trademark. They will have a very hard time trying to prosecute me for violation of the Fanta trademark.\n\nClue: it's done with permission, and aesthetic license.\n\n@Muzzer: _I thought you said this was s bit of a joke?!?!_\n\nYou said it was a joke. I only said I like a good joke now and then. This is for real.\n\nj a m e s\n\n"
    },
    {
      "time": "16 Dec 2008 — 9:08am",
      "content": "Fonta is more our type of drink--Fanta is more for people who like to flick their wrist to make a breeze :-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Dec 2008 — 10:19am",
      "content": "_I have redefined what an “o-n” ligature looks like._\n\nYes, like \"a-n\"!  \nBut don't worry, I suspect that people are aware script is a more personal expression than type, done with aesthetic licence, and employ \"reading licence\", turning up the readerability knob a notch and enjoying the mayhem. Or maybe script plays up the game-like, puzzle-solving dimension of reading.\n\n"
    },
    {
      "time": "16 Dec 2008 — 10:56am",
      "content": "I ain't worryin'. And yes I think you're ryte as usual, script lettering is a personal expressiveness type of thing. In effect I'm scaling the edge of readerability / readability while firing a shot into the trademark maelstrom to see what happens there.\n\nI always do research before deciding on a retail font's name, to find out how widespread prior use (if any exists) of the name has been in the public domain. A google search of \"fonta\" turns up soome fascinating prior uses of it as a trademark, none of them registered. So the Coke peeple, if they ever bother hassling me about this) will have to admit widespread prior use of the letter string \"fonta\" by numerous companies and private individuals, whose use of \"fonta\" as a business name / brand has not diluted Coke's registered Fanta trademark. If Coke go for similar wordmark conflict, well, we'll see about that. Their claim would have to include an argument for dilution of the Fanta wordmark, and that could take a long time to hammer out out-of-court. Meantime I get a free ride with my Fonta mark acting as the pivot for the Jabberwub branding communications scheme.\n\nFor readers interested in prior use of \"Fonta\", here are some relevant links:\n\nGoogle: \"fonta\"  \n [http://www.google.com/search?hl=en&q=fonta&btnG=Google+Search&meta=](http://web.archive.org/web/20140821033036/http:/www.google.com/search?hl=en&q=fonta&btnG=Google+Search&meta= \"http://www.google.com/search?hl=en&q=fonta&btnG=Google+Search&meta=\")  \nbout 1,420,000 for fonta\n\nFonta.org is the creation of an individual named Andrea Fontanesi  \n [http://www.fonta.org/Welcome.html](http://web.archive.org/web/20140821033036/http:/www.fonta.org/Welcome.html \"http://www.fonta.org/Welcome.html\")\n\n[http://www.fonta.com/](http://web.archive.org/web/20140821033036/http:/www.fonta.com/ \"http://www.fonta.com/\")  \nThank you for your interest in fonta.com.  \nThis domain is for sale. Please visit the fonta.com auction page at Sedo.\n\n[http://www.robtex.com/dns/fonta.com.html](http://web.archive.org/web/20140821033036/http:/www.robtex.com/dns/fonta.com.html \"http://www.robtex.com/dns/fonta.com.html\")  \nfonta.com is a domain controlled by two nameservers. They are on different IP networks.\n\n[http://www.fonta-motor.com/](http://web.archive.org/web/20140821033036/http:/www.fonta-motor.com/ \"http://www.fonta-motor.com/\")  \nGUANGZHOU FONKWANG INDUSTRIAL CO., LTD, is specialized in production and sales of FONTA and FKMEO brand motorcycles.\n\n[http://fibresystems.org/cws/company/B400014626](http://web.archive.org/web/20140821033036/http:/fibresystems.org/cws/company/B400014626 \"http://fibresystems.org/cws/company/B400014626\")  \nFonta Industries CO.,LTD is a professional company of fiber-optic components in HongKong, China.\n\n[http://www.who.is/whois-com/ip-address/fonta.com/](http://web.archive.org/web/20140821033036/http:/www.who.is/whois-com/ip-address/fonta.com/ \"http://www.who.is/whois-com/ip-address/fonta.com/\")\n\nHeh! I love that \"Fonkwang Industrial\" tag. Apparently \"Fonkwang\" in Japanese translates to \"Fonta\" in queen's English. What a world :^)\n\nj a m e s\n\n"
    },
    {
      "time": "16 Dec 2008 — 11:01am",
      "content": "Dez, if Fonta is your type of drink, the fonta.com domain is up for sale.\n\n@Nick: _. . . turning up the readerability knob a notch and enjoying the mayhem._\n\nI'm forcing type users to reassess what they think they know. That's our job as type designers. I want the world guessing where the truth begins.\n\nj a m e s\n\n"
    }
  ]
}
