{
  "id": "52562",
  "title": "Font management software",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "What do you all use and why?  \nWhat do you think of Extensis Suitcase compared to Linotype Font Explorer X?  \nAnd what about Font Agent Pro?  \nWhat are the pluses and minuses for each?  \nWhat would make a font management app essential for you?\n\n",
  "author": "ilynam",
  "time": "11 Dec 2008 — 3:39am",
  "uid": "11033",
  "comments": [
    {
      "time": "11 Dec 2008 — 4:34am",
      "content": "This question gets asked here once every fortnight… The consensus seems to be that FEX is an excellent font manager (and free), that FontAgentPro is sturdy and quick to update necessary Plug-Ins and everything from Extensis somewhat shady.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "12 Dec 2008 — 12:48am",
      "content": "Good summary, though it might not be fair to throw out the Suitcase until the latest Fusion is tested.\n\n"
    },
    {
      "time": "13 Dec 2008 — 6:22am",
      "content": "That is the problem with Extensis: they produce a multitude of updates, which is a surefire way of making things too complicated for the end user.  \nWhen I was using MasterJuggler in the OS 9 days (THE font manager omhp), they had like three updates in a period of seven, eight years, whilst Suitcase went to something like 20, 25.\n\n. . . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "13 Dec 2008 — 1:57pm",
      "content": "Well, there is something to be said for releasing bug fixes as they are noticed, rather than to hold off releasing an update for months or years while there is a known flaw in the current release, then charge for a full upgrade price for what amounts to making the thing you bought work as originally advertised plus a token new feature.\n\nNot to say that's necessarily the case with any of the above programs, but I have experienced the latter treatment from some vendors.\n\nI prefer the approach that releases (as) frequent (as necessary) updates with a built-in notification mechanism in the application. Of course it's nice when they get it totally right the first time, but that just doesn't happen in the world of software development anymore (and was rare when it did).\n\n"
    },
    {
      "time": "14 Dec 2008 — 5:19am",
      "content": "OTOH: Releasing a lot of bug fixes in a short time means that one’s quality control is soemwhat lacking & the programming sloppy.  \nMJ was very stable in every version, All the Extensis stuff very much the contrary.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "14 Dec 2008 — 10:24am",
      "content": "<cite>Releasing a lot of bug fixes in a short time means that one’s quality control is soemwhat lacking &amp; the programming sloppy.</cite>\n\nI must respectfully disagree.\n\nIn the absence of specific evidence to the contrary, I'd assume the same number of bugs are getting fixed per year, regardless of number of updates. Any program of really large size such as a serious font management application has hundreds, maybe even thousands of \"known issues.\" In and of itself, the difference between an update every three years and three updates a year tells you nothing in particular about sloppy programming or quality control.\n\nPersonally, I'd prefer more frequent updates, but I really consider it a personal preference rather than anything else.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "14 Dec 2008 — 10:31am",
      "content": "<cite>OTOH: Releasing a lot of bug fixes in a short time means that one’s quality control is soemwhat lacking &amp; the programming sloppy.</cite>\n\nThis is true; known issues should be eliminated before release whenever possible. However, when problematic issues do make it into a release, they should be addressed as quickly as possible.\n\nI look back to the last year a certain small yet significant developer was around as a graphics software company. They had many products which were incomparable with their feature sets, but released on a schedule determined more by marketing concerns than whether the software was really ready. Some had so many bugs as to be barely workable. But, rather than releasing an immediate patch to address these issues, they let them go for extended periods of time until put forth as an omnibus upgrade. All in the interest of _looking like_ their quality control wasn't as sloppy as it was.\n\nThen, for some reason they decided the would become an \"internet company\" and sold off all their graphics software properties to other companies (in some cases back to the original developers they licensed them from). I haven't heard from this company since.\n\n"
    }
  ]
}
