{
  "id": "52560",
  "title": "Thomas Phinney to leave Adobe?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "On German [Fontblog](http://web.archive.org/web/20150123043842/http:/www.fontblog.de/entlassung-bei-adobe-type#comments), Jürgen Siebert just announced that [Thomas Phinney](http://web.archive.org/web/20150123043842/http:/typophile.com/wiki/Thomas%20Phinney) is to leave Adobe.  \nIf it is true that Adobe cut his job, then – well, I don’t know what to say. That would be sad news for the typographic world.  \nF\n\n",
  "author": "Florian Hardwig",
  "time": "11 Dec 2008 — 2:57am",
  "uid": "16911",
  "comments": [
    {
      "time": "11 Dec 2008 — 3:48am",
      "content": "Every company is reducing costs, it is the times we live in now.\n\n"
    },
    {
      "time": "11 Dec 2008 — 4:07am",
      "content": "In Thomas’s words (as posted on the OpenType List):\n\n<cite>Hi all,</cite>\n\nWell, I never knew if or when this day would come, but I am leaving Adobe after 11 1/2 years. Adobe HR made me an offer I can't refuse, so away I go. On the plus side, I needed to spend some more time with my family due to my younger daughter's medical needs anyway. I will be looking at consulting, writing and teaching gigs, and perhaps going back to a full time job at some time next year. Let me know if you have any good prospects for somebody with lots of type background/skills and an MBA from UC Berkeley. :)\n\nIt has been both a great pleasure and an honor to work with so many smart, knowledgeable and decent people in my time at Adobe, and to help make some great typefaces and applications.\n\n[deleted]\n\nRegards,\n\nT\n\n(End of citation)  \nStill, I hope to still see around you in future, T. Maybe at the next TypoBerlin? (Cite tags not working, sorry)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "11 Dec 2008 — 4:56am",
      "content": "Best wishes to Thomas.\n\nAnd I hope we still get a Hypatia Sans italic!\n\n"
    },
    {
      "time": "11 Dec 2008 — 5:08am",
      "content": "I too, would like to extend my best wishes to Thomas. What a loss for Adobe!\n\nI don't know anything about his daughter's problems, but I certainly pray that she gains full health soon.\n\nThomas, our thoughts are with you.\n\n"
    },
    {
      "time": "11 Dec 2008 — 5:34am",
      "content": "That's a shock. I'm grateful that Thomas has been so generous with his time to the type community. All the best, Thomas!\n\n"
    },
    {
      "time": "11 Dec 2008 — 6:37am",
      "content": "Adobe announced 600 job cuts on the 5th...\n\n[http://www.marketwatch.com/news/story/Adobe-Provides-Preliminary-Q4-Fisc...](http://web.archive.org/web/20150123043842/http:/www.marketwatch.com/news/story/Adobe-Provides-Preliminary-Q4-Fiscal/story.aspx \"http://www.marketwatch.com/news/story/Adobe-Provides-Preliminary-Q4-Fiscal/story.aspx\")\n\n"
    },
    {
      "time": "11 Dec 2008 — 7:03am",
      "content": "Si, your link didn't work for me but [this one does](http://web.archive.org/web/20150123043842/http:/www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2008/12/04/BUE114DS4L.DTL).\n\n"
    },
    {
      "time": "11 Dec 2008 — 7:17am",
      "content": "He will indeed be missed - and I join James in hope for a Hypatia Sans Italic\n\n"
    },
    {
      "time": "11 Dec 2008 — 7:22am",
      "content": "Good luck Thomas.\n\n// Jacques\n\n"
    },
    {
      "time": "11 Dec 2008 — 8:02am",
      "content": "a significant loss – for Adobe. i'm confident Thomas will visit these forums as frequently as he did in the past.\n\n"
    },
    {
      "time": "11 Dec 2008 — 8:09am",
      "content": "Good thoughts for you, Thomas, both for your career and the health of your child. You have always been helpful to us in the type world and very giving of your time and energy. Adobe is losing more than an expenditure in accounts payable. They are losing leadership and a good human being.\n\nChrisL\n\n"
    },
    {
      "time": "11 Dec 2008 — 8:42am",
      "content": "I too would like to extend my best wishes, and hope to continue to see Mr. Phinney's sage advice on these boards.\n\nSM\n\n"
    },
    {
      "time": "11 Dec 2008 — 9:21am",
      "content": "I hope this is the start of a great new adventure for you Thomas. Hopefully Adobe's loss will be your gain.\n\nNick Cooke\n\n"
    },
    {
      "time": "11 Dec 2008 — 9:51am",
      "content": "Thomas, best of luck to you and your family. I hope we will continue to see your (virtual) face here.\n\n"
    },
    {
      "time": "11 Dec 2008 — 3:32pm",
      "content": "Thomas, you are one of the exceptions to the old aphorism \"Those that can't do, teach.\"\n\nWishing the best for you and your family,\n\nCharles\n\n"
    },
    {
      "time": "11 Dec 2008 — 4:43pm",
      "content": "This is sad news! From about 1995 to 2000, David Lemon was Adobe's universally admired online type community voice, and since then Thomas has filled his shoes so well. I have been a well-known thorn in his side for most of these years, but as Thomas's technical and institutional wisdom grew with every year, it has become harder and harder to find fault. I do think it's a shame for Adobe to part with someone who has done so much for the company in so many ways, and whose loyalty is so admirable. It is impossible to think of the contemporary online type community without Thomas's unflagging generosity. Very best wishes, Thomas!\n\n"
    },
    {
      "time": "11 Dec 2008 — 5:41pm",
      "content": "Thank you all for the kind words and good wishes.\n\nI have every intention of remaining involved in the type community, including here on Typophile. I am just a little busy these first few days with the transition. Amazing how many sites and services have my Adobe email address... and my inbox and phone have both been very busy.\n\n(I've tried to post several times today, but somehow my web browser and Typophile are not liking each other today.)\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "12 Dec 2008 — 5:30am",
      "content": "all the best thomas, for you and your child.\n\ni look forword to seeing you around here still.\n\n"
    },
    {
      "time": "12 Dec 2008 — 5:38am",
      "content": "Best wishes, Thomas!\n\n"
    },
    {
      "time": "12 Dec 2008 — 5:53am",
      "content": "hey THOMAS! THANK YOU so much for all the incredibly geeky font tricks you've shared with us on Adobe's behalf over the years. I just solved a HUGE font problem of mine by tracking down a post you made about six years ago and it really saved the day. Thanks a ton for all the info, advice and insights. Looking forward to your continued presence in a new position in the type world. good luck to you and your family!\n\n"
    },
    {
      "time": "12 Dec 2008 — 7:37am",
      "content": "T, best wishes and good luck in everything!\n\n"
    },
    {
      "time": "12 Dec 2008 — 10:45am",
      "content": "I forgot to say, the Hypatia Sans italics are something like 80% done, and my colleagues will be finishing them up and they'll still be released. I hope to still have some involvement to keep an eye on things. Hmm, somehow I avoid the nightmare of kerning yet again - starts to look like a pattern! (Does anybody actually enjoy kerning a 3000-glyph typeface?)\n\nT\n\n"
    },
    {
      "time": "12 Dec 2008 — 10:51am",
      "content": "I'd like to use this opportunity to go on record to state that I am deeply saddened by Thomas' departure, and that he will be genuinely missed. I know of no one who can fill his shoes. I think we should all take comfort in knowing that he will continue to be active in this field.\n\nIt was a pleasure and honor to work with Thomas for many years. I raise my glass in your name.\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    },
    {
      "time": "12 Dec 2008 — 11:00am",
      "content": "Looks like the [blog](http://web.archive.org/web/20150123043842/http:/blogs.adobe.com/typblography/) will keep going! From this...\n\nTypblography, the Phinney-us Blogg\n\nto this...\n\nTypblography, the Phinney-less Blogg\n\n:-(\n\nBest regards, Si\n\n"
    },
    {
      "time": "12 Dec 2008 — 11:07am",
      "content": "This makes me worry a lot about the management of one of America's great companies.\n\n"
    },
    {
      "time": "12 Dec 2008 — 11:33am",
      "content": "good luck with your next chapter Thomas!\n\n"
    },
    {
      "time": "12 Dec 2008 — 12:53pm",
      "content": "\\>This makes me worry a lot about the management of one of America’s great companies.\n\nThey're probably banking on a bail-out like everyone else. ;-)\n\n"
    },
    {
      "time": "12 Dec 2008 — 2:52pm",
      "content": "Look on the bright side, one of you type foundries or developers is going to gain a super knowledgeable team member.\n\nAnd lest we not forget, Thomas is still the Treasurer for ATypI.\n\n"
    },
    {
      "time": "12 Dec 2008 — 7:05pm",
      "content": "_This makes me worry a lot about the management of one of America’s great companies._\n\nThat's capitalism.\n\nA company with billions in annual revenue and dominant in its field, that has enjoyed a lengthy period of growth and profits, cooly lays off thousands of workers (\"everyone's doing it, we're matching average industry rates\" according to the boss) when there's a downturn in the economy. Somewhat callous, but sensible business practice apparently, although there are always apologists lamenting that those companies are losing their best and brightest.\n\nFrom the employee perspective, loyalty is not reciprocated, but on the up side, it's during recessions that discarded workers form the start-ups that become the kernels of the next wave. I was laid off during downturns a couple of times, long ago before I started working for myself, and it was always a great opportunity.\n\n"
    },
    {
      "time": "12 Dec 2008 — 8:13pm",
      "content": "I'm excited for your new adventures and glad you're gonna be sticking around!\n\nEnjoy the change in pace Thomas :-)\n\n"
    },
    {
      "time": "12 Dec 2008 — 9:48pm",
      "content": "Nick: To be fair to Adobe, \"only\" 600 people were laid off this month, not thousands. :/\n\nAnd while one hand taketh away, another giveth. You see, \"college hires\" are a different bucket than all other employees at Adobe.... (I'd comment more, but that would be out of place.)\n\nDan Gayle wrote:  \n<cite>Look on the bright side, one of you type foundries or developers is going to gain a super knowledgeable team member.</cite>\n\nThat would be cool, but I think everybody's hurting right now, business-wise. Makes it hard to hire anybody....\n\nSo mostly I'm going to try to enjoy a much more relaxed holiday season with my family who really need my time right now. At work I was always famous for not being able to stop answering email and such, even when nominally on vacation. Not actually \\*having\\* work email will make that easier, I guess. :)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "14 Dec 2008 — 5:42pm",
      "content": "The news of your leaving Adobe is sad but your talents and contributions to our industry gives me great optimism that we will in fact be enjoying your future successes that much more . . .\n\nThe best to you and your family Thomas . . .\n\nStuart\n\n"
    },
    {
      "time": "15 Dec 2008 — 1:58pm",
      "content": "May the road rise up to meet you. All the best to you and your family, Thomas.\n\nRahim\n\n"
    }
  ]
}
