{
  "id": "52568",
  "title": "Avenir is the New Helvetica",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm getting really bored of the overuse of Avenir. In an effort to not use Helvetica, people have been trying to show how Type-smart they are and use the superbly designed geometric Avenir instead of Helvetica. And now it's overused.\n\nLike the good song thats played over and over and over on the radio until you hate it. Poor Avenir. I did love you.\n\n",
  "author": "tevih",
  "time": "11 Dec 2008 — 8:07am",
  "uid": "14737",
  "comments": [
    {
      "time": "11 Dec 2008 — 8:16am",
      "content": "Try Myriad, no one uses that.\n\n"
    },
    {
      "time": "11 Dec 2008 — 8:29am",
      "content": "Maybe it's that we're seeing a lot of both Gotham and Avenir, and since their lower cases are fairly similar at first glance it seems like we're seeing more of both of them than we really are.\n\n"
    },
    {
      "time": "11 Dec 2008 — 8:37am",
      "content": "I've been seeing Gotham everywhere, but I haven't seen Avenir much myself. Helvetica, on the other hand, is still king of over-exposure.\n\n"
    },
    {
      "time": "11 Dec 2008 — 3:29pm",
      "content": "2009 will be the year of Avenir, Gill Sans, and anything else that can kind of pass for Gotham when the budget isn’t big enough for Gotham. There is no escape from the Obama look!\n\n"
    },
    {
      "time": "24 Dec 2008 — 4:00pm",
      "content": "It just might be!\n\n"
    },
    {
      "time": "24 Dec 2008 — 4:54pm",
      "content": "I am really tired of seeing Avenir. But I am not that tired of seeing Myriad.\n\nGotham is very rarely used in a way that looks pleasant to me... I like the way it looks in Good Food Magazine and that’s probably it.\n\nPTL Speech looks like a nice alternative to Avenir.\n\n"
    },
    {
      "time": "25 Dec 2008 — 2:19am",
      "content": "Avenir is an excellent font and so is Myriad, however I prefer most if not all of Adrian Frutiger fonts.  \nI see allot of Helvetica usage these day's, it's so overused. However it remains as one of the top fonts no matter how much it's been used. Gotham is also great, however it is not as over used as the fonts mentioned above.\n\nGuerrizmo\n\n ![](http://web.archive.org/web/20130126110831im_/http:/typophile.com/files/Nochance_5279.jpg)\n\n"
    }
  ]
}
