{
  "id": "52583",
  "title": "importing images size problem (indesign) question",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hey guys,\n\ni have a question about placing images in indesign CS3, all the images i'm placing are at 150DPI 21x29.7 in size (jpeg), now when i place them in the image rectangle they turn out very small. Does anybody know why indesign does this and how to avoid this, i would like to have the correct image size when placing my images in indesign.\n\ndoes scaling up by dragging them in indesign result into pixeled images knowing they are 150DPI (can't check cause i have no printer atm)\n\nthnx in advance\n\n",
  "author": "omar",
  "time": "11 Dec 2008 — 8:51pm",
  "uid": "25150",
  "comments": [
    {
      "time": "11 Dec 2008 — 11:57pm",
      "content": "It sounds like your document settings in InDesign are set to a higher resolution like 300 dpi or higher. 300 dpi would cause a 150 dpi image to import at half the original size.\n\nJac  \n_\"pronounced by saying 'Jake' without conjuring imagery of lumberjacks or mans best friend.\"_\n\n"
    },
    {
      "time": "12 Dec 2008 — 12:23am",
      "content": "hey Jac\n\ni always tought you don't set resolution in indesign? besides that, the image appears really small\n\ni opened up a pic in photoshop and its a 18.5 x 15 cm pic at 250pix/inch\n\nwhen placing in indesign on a 21 x 29.7cm document all i get is this really small image\n\n"
    },
    {
      "time": "12 Dec 2008 — 1:37am",
      "content": "\\> _does scaling up by dragging them in indesign result into pixeled images knowing they are 150DPI (can’t check cause i have no printer atm)_\n\nWith the image is selected, you can look at the info bar if the image is placed at 100% or not. If it is placed at 100% or smaller, it will print fine. If it's placed smaller than 100%, enlarge it until it's back at 100% (well... if that is the size you want it to be...)\n\nPixels will only appear if you place it larger than 100%, especially at 150dpi, which is rater lowres. :)\n\n"
    },
    {
      "time": "14 Dec 2008 — 12:07pm",
      "content": "Resolution is not set in InDesign. InDesign always places images at 100% of size except when you are re-linking an old image with a new one.\n\nNominal resolution will change for imaging purposes if you scale a raster image up or down when placed in InDesign.\n\nI tried to duplicate your problem but could not. I have seen a similar problem in old versions of Quark but don't remember what caused them and even then, though the image showed to be very small when placed, it still printed at the correct size and resolution. I have been using InDesign since v2.0 and have never encountered what you describe.\n\n<cite> &gt;&gt; does scaling up by dragging them in indesign result into pixeled images knowing they are 150DPI (can’t check cause i have no printer atm) &lt;&lt; </cite>\n\nIf the small image you are seeing is 100% then you cannot scale it up without losing all hope of quality. Try scaling it by two or three hundred percent then view it in InDesign's hi-res mode; that should tell you what you need to know.\n\nSorry I don't have a definite solution for you.\n\n"
    },
    {
      "time": "14 Dec 2008 — 3:18pm",
      "content": "thanks for the reply's guys, mmmm...i guess i'll find out why indesign scales down images ...one day :p\n\n"
    },
    {
      "time": "15 Dec 2008 — 3:36am",
      "content": "You probably set your default container to behave like this.  \nDrag the InDesign Preferences folder to your Desktop, start up ID again and find out if the problem persists.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "24 Jan 2013 — 1:00am",
      "content": "wow this thread is four years old...  \nbut in case someone is googling this like i was, I just zoomed in on my image, print screened it and copied it into indesign and it stopped being incredibly small\n\n"
    },
    {
      "time": "24 Jan 2013 — 5:11am",
      "content": "Ah. Four years old. There goes my first thought, which was if your images really were 20 x 29.7 **inches** that may be the problem. But probably not, I've placed images bigger than the document size before, and they behaved normally. Never tried poster-size images though...\n\nAs a note, if you're going to reduce the size of an image, best to do it in Photoshop, or some software that doesn't simply scale. That way you can retain/improve resolution.\n\n"
    }
  ]
}
