{
  "id": "52601",
  "title": "En dashes and spaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I know there has been some discussion on en dashes and spaces before, but I wonder if anyone knows an authority that supports what I have always considered good practice. I don't think it's my idea, but something I was taught years ago.\n\nI believe that the range en dash should have no space around it if it joins the same units, so:\n\nJuly–August  \nFebruary 25–28  \n1975–1996\n\nbut should have spaces around if the range is being expressed by different units, so:\n\nJuly 5 – August 6  \n4 July 1965 – 7 January 1966\n\nThis approach seems particularly better in the second case, because \"4 July 1965–7 January 1966\" results in a moment of confusion as the reader perceives the range as \"1965–7\", but even the first case \"July 5–August 7\" creates an unnaturally strong visual unit between the 5 and August.\n\nI know the Chicago disagrees with me, but I think the Chicago is wrong.\n\nAny thoughts?\n\nrgh\n\n",
  "author": "Richard Hunt",
  "time": "12 Dec 2008 — 8:41am",
  "uid": "5966",
  "comments": [
    {
      "time": "12 Dec 2008 — 8:54am",
      "content": "I prefer spaces. IMHO by using no spaces for em dashes and spaces for en dashes we can make reading easier via by providing context clues that can be picked up in parafoveal vision.\n\nIt’s also (IMHO) to keep things less complex. That way one is less likely to confuse weaker readers and it creates fewer trivial rules for designers and editors to deal with.\n\n"
    },
    {
      "time": "12 Dec 2008 — 10:12am",
      "content": "I'm in between. I like a little bit of space, but not a full space, which is just too much. I don't think the dash should touch whatever figures are before or after it.\n\n"
    },
    {
      "time": "12 Dec 2008 — 10:18am",
      "content": "The Chicago is a standard but ultimately the designer does what communicates best. I prefer no space and if the relationship between the dash and the letter/number is troublesome just kern the thing. A full space looks a little too much.\n\n"
    },
    {
      "time": "12 Dec 2008 — 10:26am",
      "content": "One of the best functions \"Chicago\" serves is to get folks like you wondering what is indeed good practice, and then—if you are convinced you are on the right track—convincingly to carry that practice through, disagreeing all the while.\n\nIt has many other good functions, too.\n\npowers\n\n"
    },
    {
      "time": "12 Dec 2008 — 10:52am",
      "content": "<cite>. . . ultimately the designer does what communicates best</cite>\n\nDepends. With the projects I work on (books), this would be the editor's decision.\n\n"
    },
    {
      "time": "12 Dec 2008 — 11:06am",
      "content": "I agree with Bruce. I like having some space, but depending on the situation, a full character space may be too much. Inserting a smaller space in InDesign may be a better practice. Ultimately I believe these considerations are based upon the larger context of the piece on which you are working. The \"negative/whitespace\" that surrounds each letterform and each word must be carefully managed to create the feeling you want and effectively convey the information. Looking at the spacing attributes of an en dash in relation to the whole, as opposed to a general rule of practice, is very important. I also think that different typefaces require different spacing. I have always viewed the Chicago manual (and all such style manuals) as grammatic usage guides which are not specifically geared toward the needs of typographers and graphic designers. As such I design according to the benefit of the piece.\n\n"
    },
    {
      "time": "12 Dec 2008 — 11:24am",
      "content": "<cite>It has many other good functions, too.</cite>\n\nIt makes a great doorstop.\n\n"
    },
    {
      "time": "12 Dec 2008 — 3:20pm",
      "content": "Style guides are for people who don't have the time to create their own -- I own most of the common North American ones, and they all have their strengths and weaknesses.\n\nWhat's most important is consistency, although being able to say \"xxx says it's OK to do this\" when your boss asks why you have made a \"different\" editorial choice doesn't hurt.\n\n:-)\n\n"
    },
    {
      "time": "12 Dec 2008 — 3:50pm",
      "content": "Thanks for the thinks. Yes, I prefer the thin space (if I am putting a space in) over the word space, and I will often globally kern en dash/number relationships (thanks to Quark XPress's kerning table edit)\n\nIt is, as Charles says, the editor's call, and on this job I will be doing it what I think is the \"wrong\" way. But what I'm curious about is if there is any documentary support for this approach (determined by function, not aesthetics) to dashes in these cases, i.e., July–August (no space) and July 5 – August 12 (space).\n\nI wonder if it is a British approach, because their traditions on the relationship between quotations and other punctuation has usually been determined by usage more that appearances. For example, the British would favour 'He said he was \"sick\".'\n\nBecause \"sick\" is quoted within the sentence, the period must fall outside. In North America, the sentence would be:\n\nHe said he was \"sick.\"\n\nwith the period inside the quotes.\n\nSo perhaps it's a mstter of national philosophy.\n\n"
    },
    {
      "time": "12 Dec 2008 — 4:13pm",
      "content": "With the rise of computers, the British approach to punctuating quotations has gained a lot of ground in North America, because it is logical. Many people in the last few generations, who have at some point learned at least a little programming, tend to feel that something that is not part of the string quoted has no business being inside the quotation marks.\n\n"
    },
    {
      "time": "12 Dec 2008 — 7:20pm",
      "content": "Illogically, the British system of quote marks doesn't work with Smarty Pants.\n\nI agree with Linda, have your own style--and I think this will be intimately related to the typefaces that you prefer, and the way that you use them.\n\nAnd having your own style is something that the boss should respect, especially if you publish it. Type houses used to have their own house styles, but as they are no more, doesn't that responsibility succeed to those graphic designers and art directors, the digital typographers who have assumed the mantle?\n\n"
    },
    {
      "time": "12 Dec 2008 — 11:33pm",
      "content": "It's all in the suit that you wear.\n\nj a m e s\n\n"
    },
    {
      "time": "12 Dec 2008 — 11:37pm",
      "content": "@jamesP:_IMHO by using no spaces for em dashes and spaces for en dashes we can make reading easier via by providing context clues that can be picked up in parafoveal vision._\n\nI find this method speeds reading up. And as you point out, there are less decisions to be made.\n\nj a m e s\n\n"
    },
    {
      "time": "13 Dec 2008 — 2:37pm",
      "content": "Charles is right - in book design the designer does not get to decide. We are stuck with Chicago – tight dashes and loose ellipses.\n\nGenerally in the US there isn't a formal space before and after the en-dash but I do often cheat a little in there for aesthetic purposes. In QUARK (I know, shoot me, I still use it sometimes) you could add that space in via kerning tables, but Adobe has not seen fit to incorporate that feature into InDesign.\n\n"
    },
    {
      "time": "13 Dec 2008 — 11:22pm",
      "content": "I'm sure everybody would agree that \"The Elements of Typographic Style\" by Robert Bringhurst is one of the most authoritative books on typography ever, and it says:\n\n5.2.1 Use close-set en dashes or three-to-em dashes between digits to indicate a range.\n\nThus: 3--6 November; 4:30--5:00 PM; 25--30 mm. [...]\n\nWhen compound terms are linked with a dash in the midst of running prose, subtle clues of size and spacing can be crucial, and confusion can easily arise. A sentence such as _The office will be closed 24 December -- 3 January_ is a linguistic and typographic trap. When it stands all alone in a schedule or list, the phrase _25 December -- 3 January_ will be clear, but in running prose it is better both editorially and typographically to omit the dash and insert an honest preposition: _25 December to 3 January_.\n\n"
    },
    {
      "time": "14 Dec 2008 — 6:20am",
      "content": "<cite>I’m sure everybody would agree that “The Elements of Typographic Style” by Robert Bringhurst is one of the most authoritative books on typography ever . . .</cite>\n\nActually, no, and I'm not alone here. I'll allow that from time to time, it is useful.\n\nI like the rest of your post, but again, it is the editor's call in a author \\> editor \\> designer \\> (maybe comp) workflow.\n\n\\* \\* \\*\n\nPatty,\n\nI've always gotten around certain editorial prejudices on small matters by doing the work in the font. Ever since PostScript fonts and Fontographer became available, I've gone into the fonts & reworked them. Mostly this is kerning, and if you wanted to kern the digit-dash-digit combinations, thats how to do it.\n\nI started using an em dash of three-quarter's em length with 1/8-em l&r sidebearings to help Richard Eckersley (British) reach a compromise with his editors at Nebraska. In the end, Richard preferred this to either the word-spaced en-dash or full-length em dash. With this dash, I've only been called by an editor once in 16 years, and the explanation of \"that's how it is in the font\" seemed to satisfy them.\n\nFurther refinements can be to set the width of the \"ink\" in the dash to the width of a capital M or W, whichever is longer, again with the small but significant sidebearings.\n\nThe en-dash needs work too, as all too often it has no sidebearings. This may be the source of the original post. I usually start by giving the en-dash the same sidebearings as the hyphen, & work from there. Kerning is still needed.\n\nThis post is a bit off topic, because all these treatments of the dash build the spacing into the dash itself, so it is the same for all contexts. Still, it seems to be this \\*sameness\\* that gets things by most editors -- and it has been my experience that the few with a good enough eye to notice appreciate the work & go along with it.\n\n"
    },
    {
      "time": "14 Dec 2008 — 10:47am",
      "content": "Thanks Henry, I think my source might have been a Bringhurstism. He doesn't appear to say it explicitly, but in \"The office will be closed 24 December — 3 January\" he clearly includes spaces (I did refer to the book itself) around the dash (though he says a \"to\" is better), and does explicitly say that \"between digits\" and \"in a range\" the en dash should have no space. So my belief is (sort of) in line with Bringhurst. Like Charles, I don't necessarily agree with Bringhurst, but when he agrees with me, I think he's very authoritative....\n\n"
    },
    {
      "time": "10 Oct 2012 — 9:36am",
      "content": "Don't add a full space, it's too cluttered. I agree with what Pattyfab says about the kerning as well.\n\n"
    },
    {
      "time": "15 Dec 2008 — 2:44pm",
      "content": "I like Richard's ideas expressed in the opening of this thread. I don't know if a full space is quite right for my taste; I'll have to experiment and see. It may depend on the typeface/setting as well....\n\nCheers,\n\nT\n\n"
    }
  ]
}
