{
  "id": "52637",
  "title": "Fontlab/Superpolator/Font Remix Tools workflow questions",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I’m trying to plan a workflow that will allow me to build out a mega family leveraging interpolation and macros. My plan would use Superpolator to interpolate and Font Remix to generate additional masters that can be fed into Superpolator. Does the following workflow makes sense?\n\n• Design the ultralight, regular and bold weights  \n•&nbsp;Use Superpolator to interpolate light and semibold and extrapolate super  \n• Manually tweak the regular into a book weight  \n• Create an MM font and tweak it into a black weight with Remix  \n• After working out the design of condensed and extended widths, create masters by using Remix to do the heavy lifting, finish the work manually, then use Superpolator to interpolate the additional weights\n\n",
  "author": "blank",
  "time": "13 Dec 2008 — 10:24am",
  "uid": "14722",
  "comments": [
    {
      "time": "13 Dec 2008 — 4:09pm",
      "content": "Is there a reason for designing the regular weight between the ultralight and bold, I mean could you not design the regular and generate it with Superpolator using the ultralight and bold ?\n\nI haven't really used MM to design fonts, but if I did I thought I should design the extremes and then interpolate the weights between.\n\nRr\n\n"
    },
    {
      "time": "14 Dec 2008 — 9:32am",
      "content": "<cite>Is there a reason for designing the regular weight between the ultralight and bold</cite>\n\nBecause the progression of changes in size and shape across weights is not linear. Then again, maybe it should be…\n\n"
    },
    {
      "time": "14 Dec 2008 — 3:36pm",
      "content": "How functional linear interpolation will be, will depend a lot on the nature of the design, and how extreme your heaviest weight is. Is this serif or sans? In what general style? What kind of thick/thin contrast?\n\nIf you're using Superpolator, why build an MM \\*afterwards\\*? Or, if you're building an MM, why use Superpolator for interpolation first?\n\nNote that I've never used Superpolator, just seen it demonstrated, so my questions may reflect my own ignorance of how it interacts with MM tech.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "14 Dec 2008 — 5:18pm",
      "content": "It’s a gothic sans, here’s a sample. If it looks a little screwy that’s because I haven’t generated new weights of light and bold since I changed n and it’s derivati:\n\n ![](http://web.archive.org/web/20130302112623im_/http:/typophile.com/files/whateley_6397.png)\n\nAs for jumping from Superpolator back to MM, I would need an MM font to use Remix, not because I actually want to do much MM interpolation. I could probably do the same stuff with Glyph Tweaker and Interpolated Nudge, but I think Remix would probably do a better job of simultaneous narrowing and thickening.\n\n"
    },
    {
      "time": "15 Dec 2008 — 5:46am",
      "content": "\\> but I think Remix would probably do a better job of simultaneous narrowing and thickening.\n\nI think you're right on this. I use both Superpolator and Tim's Font Remix tools and have found the latter to be better suited for this task (narrowing/thickening). I think this may be one of its real strengths. As for your wider plan, I'm a little confused but I'm all for trying things!\n\n"
    },
    {
      "time": "15 Dec 2008 — 6:46am",
      "content": "<cite>As for your wider plan, I’m a little confused but I’m all for trying things!</cite>\n\nI’m in the same boat—confused and trying things! I’m still very new to type design, so all this weirdness is, to some extent, an excuse to experiment with process.\n\n"
    },
    {
      "time": "22 Dec 2008 — 8:27am",
      "content": "I'd say, worry first about getting your g right. Making a superfamily is a pointless exercise in complexity until you've got A-z perfect. All you'll be doing is proliferating errors. Here you've got the classic problem of a glyph design that, light, just might print well at 8 points, but that, bold, will certainly clog. Do you redesign the character to something that interpolates more successfully, or do you change the design more radically, and uninterpolably, as weight progresses? Use a lot of paper!\n\n"
    },
    {
      "time": "24 Dec 2008 — 7:53am",
      "content": "Tom: \"Is this serif or sans? In what general style? What kind of thick/thin contrast?\"  \nThanks, I needed that.\n\n\"It’s a gothic sans, here’s a sample.\"  \nThanks, as I know it's hard to show in such an early state.\n\n\"...the progression of changes in size and shape across weights is not linear. Then again, maybe it should be…\"  \nI do everything you list, to a subset of the complete glyph set, in FontLab. I think maybe you should let go of your feelings for tools and let the force be with you. Translated that means: Draw your thin, regular and fat, extra compressed thin, regular and fat, extra extended thin, regular and fat —&nbsp;until each of those nine works using whatever tools help your eyes. Then find the common point structure, if you have not already, then make more styles.\n\nCheers!\n\n"
    },
    {
      "time": "30 Mar 2009 — 11:24am",
      "content": "James, don't forget what normal MM inter/extrapolation in FL can do. Some of the things you describe can simply be done with FontLab's \"Generate Instance\" or \"Assign Mask\" commands.\n\nOf course, Superpolator and Remix Tools have their special superpowers but for ordinary (global, isotropic) inter/extrapolation the results of MM/FontLab's tools will be identical.\n\n"
    }
  ]
}
