{
  "id": "52651",
  "title": "Sean Cavanaugh's FontSite",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Joyce Lukaczer, who posted today this entry\n\n[http://typophile.com/node/52648](http://web.archive.org/web/20150122201819/http:/typophile.com/node/52648 \"http://typophile.com/node/52648\")\n\nclaims that FontSite is a \"type design company\".\n\nI have a different opinion about this outfit.\n\nSee my short documentation for legal authorities:\n\n[http://www.sanskritweb.net/forgers/fontsite.pdf](http://web.archive.org/web/20150122201819/http:/www.sanskritweb.net/forgers/fontsite.pdf \"http://www.sanskritweb.net/forgers/fontsite.pdf\")\n\n",
  "author": "Uli",
  "time": "14 Dec 2008 — 2:20am",
  "uid": "11274",
  "comments": [
    {
      "time": "15 Dec 2008 — 6:10am",
      "content": "I wondered about that one, too...  \nSo unfortunately it seems like the Wiki is vulnerable to persons posting neutral-looking entries for their own shady subjects - in the hope of generating a bit of credablity for themselves?  \nWhy don't you edit the wiki entry, Uli?\n\n"
    },
    {
      "time": "15 Dec 2008 — 11:26am",
      "content": "Extending a typeface's character set is generally considered to be type design.\n\nThe difficulty is that \"design\" is an extremely broad term.  \nType design is not like music, where composition, arrangement, and performance are quite distinct--although even in music digital culture has produced difficulties concerning the legitimacy of sampling.\n\n"
    },
    {
      "time": "15 Dec 2008 — 12:43pm",
      "content": "Ten years ago, Sean Cavanaugh supplied the following legal explanations in a bulletin board as a reply to a question by a certain person called Phan:\n\n<cite><br>\nFrom: Sean Cavanaugh<br>\nDate: Mon, 27 Jul 1998</cite>\n\nPhan, I appreciate your comments, but labeling me a pirate or a thief is  \nunjustified (not to mention totally lame). Let me explain.\n\nA couple of years ago I used to work for a company called SoftMaker,  \nInc., which was later acquired by Kingsley/ATF and merged into a company  \ncalled SoftMaker/ATF. Prior to the merger, SoftMaker, Inc. developed and  \nsold a Type 1 font scaler for DOS applications (DOS!) such as Word and  \nWordPerfect. SoftMaker also licensed and sold a large number of URW  \ntypefaces. SoftMaker, Inc.'s parent company, SoftMaker GmbH of Nurnberg,  \nhad (and has, I believe) a close working relationship with URW's founder  \nPeter Karow.\n\nMaybe some people will look down their noses at URW, but URW's  \ncontribution to digital typography is undeniable. URW performed the  \noriginal digitization of many of today's popular fonts for a number of  \nleading foundries. The digitization wasn't cheap. When a foundry approached  \nURW to do the work, URW would say, \"OK, we'll do the whole font for $X,\"  \n(sound of foundry representative gasping), \"Or, we'll do it for $X minus $Y  \nif we can retain the right to resell and re-license the outlines.\"\n\nWell, in a great many cases, the foundries opted for Door #2. In other  \nwords, they entered into agreements with URW. This isn't theft or piracy.  \nIf you accuse URW of anything, accuse them of being shrewd. Or maybe accuse the original foundries of under-valuing their assets.\n\nBack to SoftMaker. At the time of the \"merger\" with Kingsley/ATF, it  \nbecame apparent that Kingsley/ATF only wanted SoftMaker so they could get  \nback into the type business (ATF was defunct at the time) and basically  \ncollect on overdue trademark license fees from companies that had been  \nusing ATF trademarks for free.\n\nNone of that money went into the company, but rather into the pockets of  \na handful of lawyers and businessmen. At that point I had been working  \nwithout pay for a couple of months, under the idea that the merger would  \nturn things around, and we'd all be one happy type company. (sound of  \nlaughing lawyers)\n\nI left the company disgusted, to say the least. I was then approached by  \nan agent to write a book about typography and design. I thought it was a  \ngreat idea, and being unemployed, I'd have plenty of time to spend writing.  \nAnd then a light bulb went off in my head: Instead of taking SoftMaker/ATF  \nto court for the thousands of dollars they owed me, I requested the company  \ngrant me a license to distribute a number of the URW and ATF fonts from  \ntheir collection. I had no intention of starting a type company (and still  \ndon't) -- I just wanted to include a companion CD of typefaces with the book.\n\nAnd that's how Digital Type Design Guide was born, along with its  \ncompanion CD, and the follow-up CD to that, The FontSite 500 CD (which  \ncontains the 220 fonts from the first CD, plus an additional 280 fonts).\n\nIt's a decent type collection. I've worked on many of the included URW  \noutlines, making improvements to hints, bitmaps, and in some cases metrics  \nand kern pairs -- that was my job, after all, at SoftMaker. I guess you  \ncould say I'm proud of it, but still, if you look on page 166 of my book,  \nyou'll find the following:\n\n\"My hope is that if you become sufficiently excited about the world of  \ntype, you will migrate to some of the higher-end vendors such as Adobe,  \nMonotype, and Agfa.\"\n\nSee, the thing is, I'M NOT IN THE F\\*CKING TYPE BUSINESS, and I have no  \nplans of ever getting back into it. I absolutely despise the business end  \nof type -- both the practices of the foundry barons of yore and the lawyers  \nof today. I don't sell anything in stores or mail order or in any other  \nchannels. I have my own website, and I will continue to promote my book and  \nthe small collection of fonts I acquired from SoftMaker/ATF. I've almost  \nsold enough to pay for the site's expenses. After taxes, I'll be a f\\*cking  \nHUNDREDAIRE! Yippee!\n\n\\> and Zapf (who goes into convulsions whenever he sees pirated designs)\n\nYou'll notice on my CD is a face named URW Palladio, which is a  \nknock-off, of sorts, of Palatino. But do you know who designed URW  \nPalladio? The same guy who designed Palatino -- Hermann Zapf! (You'll also  \nfind Zapf's URW Antiqua and URW Latino on the CD) So you can spare me the  \nsermon on Zapf, who also happens to be a friend of Peter Karow.\n\nTo wrap this up (and sorry for the length, but you did ask for a  \n\"justification\"), I'm not in the same boat with snakes like Paul King of  \nSSI and their ilk, and I resent any implication otherwise. If you and Roy  \nwant to take some bullshit high and mighty approach with me, I suggest you  \ndo a little research first to find out what the hell you're talking about.\n\nBut thanks for asking, anyway. And I really do appreciate your concerns.  \nWe're on the same side of the copyright issue. You have to keep in mind  \nthat holding a copyright does not preclude one from entering into licensing  \nand distribution arrangements as many companies did with URW.\n\n- Sean\n\nIn my document about the FontSite outfit, I do not blame Sean Cavanaugh for distributing fonts. I only blame him for falsely claiming to be the \"copyright owner\" and the \"trademark owner\", which he is definitely not.\n\nIf he removed the copyright notices and the trademark notices from the fonts and discarded the EULA, nobody could blame him for cheating.\n\n"
    }
  ]
}
