{
  "id": "52685",
  "title": "Right/left eye dominant",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Here's a question I have procrastinated over.\n\nI am right eye dominant and I perceive that the glyphs I am drawing look balanced with normal vision (obviously), or just my right eye. When I close my (dominant) right eye and look with my left eye my glyphs look skewed.\n\nDoes this mean that a right eye dominant audience perceive the glyphs in the same way as me, but the left eye dominant audience does not?\n\nI just looked at a few other typefaces this way, I perceived them the same way, right eye balanced, left eye skewed.\n\nTry it yourself and post your observations/thoughts.\n\n(I guess this is a theoretical anxiety, after all, there's not much anyone can do to reconcile it!)\n\n",
  "author": "1985",
  "time": "15 Dec 2008 — 2:47pm",
  "uid": "16140",
  "comments": [
    {
      "time": "15 Dec 2008 — 3:42pm",
      "content": "This is probably the most interesting question I’ve seen on Typophile. Hopefully someone has an answer!\n\n"
    },
    {
      "time": "15 Dec 2008 — 3:59pm",
      "content": "Thanks, any thoughts yourself James?\n\n"
    },
    {
      "time": "15 Dec 2008 — 5:32pm",
      "content": "What exactly do you mean by skewed?\n\nI'm strongly left-eye dominant, but when I use my right eye, the letters are not skewed, merely blurrier (yes, with my glasses).\n\n"
    },
    {
      "time": "15 Dec 2008 — 5:39pm",
      "content": "Do you move the letter so it's in the same position relative to your left eye that it was when you were seeing it with your right?\n\n"
    },
    {
      "time": "15 Dec 2008 — 6:20pm",
      "content": "No, I didn't move the letter. That's an interesting idea – to ensure that I am seeing the letter from the same angle. Sounds hard to compensate for/calculate but it could very well explain what I am seeing.\n\nBy skewed I meant it looks less harmonious, for example an overhang appears to project more or the tension of the shape changes. Take a letter like 's' for example. I perceive it first as upright, then leaning forwards.\n\n"
    },
    {
      "time": "16 Dec 2008 — 1:24pm",
      "content": "I looked again today with less tired eyes but the effect is still the same.  \nNow I am worried about my vision.\n\n"
    },
    {
      "time": "17 Dec 2008 — 1:17am",
      "content": "Go get your eyes tested.\n\n_Does this mean that a right eye dominant audience perceive the glyphs in the same way as me, but the left eye dominant audience does not?_\n\nI don't think so. I think the phenomenon you are experiencing is unique to you and peeple with the same or similar eyesite conditions as yours.\n\n_I guess this is a theoretical anxiety, after all, there’s not much anyone can do to reconcile it!_\n\nWanna put money on that? I have had many eye tests in the last two years to find out more and more about the impairment to my eyesite caused by the cerebral aneurysm I had in January 2007. I think you would be very surprized by what opthalmologists can tell you about your eyesite and the things they can do to correct numerous types of distortion and malfunction.\n\nWhat I don't get is what you mean by \"right eye dominant\". Dominant in what way? Sharpness, luminance, focal length, or what?\n\nj a m e s\n\n"
    },
    {
      "time": "17 Dec 2008 — 4:41am",
      "content": "[Eye dominance](http://web.archive.org/web/20131023232925/http:/en.wikipedia.org/wiki/Ocular_dominance)\n\n"
    },
    {
      "time": "17 Dec 2008 — 10:46pm",
      "content": "Thanks for the link Craig. It's interesting that the article reckons approximately two thirds of \"the population\" (human population?) is right-eye dominant. I think what 1985 experiences is \". . .unique to you [1985] and peeple with the same or similar eyesite conditions as yours.\" because I don't experience dominance of one eye compared to the other, and neither do any other peeple I know. So, this is the first time I've come accross occular dominance, so I guess the two thirds of the population said to be right eye dominant are mostly mild cases.\n\n_. . .a question I have procrastinated over._\n\nprocrastinated \\> pondered?\n\nj a m e s\n\n"
    },
    {
      "time": "18 Dec 2008 — 5:38am",
      "content": "I never knew about it until my son's pediatrician checked him. He handed him a piece of paper with a small hole in it and asked him to look through it. He looked through it with his left eye. I would naturally hold it to my right eye.\n\nMy son has mixed dominance. He throws with his right hand and kicks with his right foot, but very definitely prefers to sight through his left eye. Makes shooting a free throw the correct way difficult, as the ball will normally hide the left eye if you are right handed.\n\n"
    },
    {
      "time": "18 Dec 2008 — 9:37am",
      "content": "James, pondered over question, procrastinated about posting!\n\nI had wrongly assumed that people were either right or left dominant, I had not heard of mixed dominance.\n\nI think I will be taking another trip to the opticians, my left eye is lazy and I want answers!  \nI may be attributing problems to dominance when they are in fact caused by something else.\n\nThanks for all responses, interested in hearing more.\n\n"
    },
    {
      "time": "18 Dec 2008 — 11:38am",
      "content": "\\>\\>\\> my left eye is lazy and I want answers!\n\nJoin the other two thirds of the world!\n\n"
    },
    {
      "time": "19 Dec 2008 — 5:20am",
      "content": "If the image is skewing, then it may not be strictly an issue of dominance, but rather one of astigmatism in your non-dominant eye.\n\n"
    },
    {
      "time": "19 Dec 2008 — 9:10am",
      "content": "That is what I am beginning to think kentlew!\n\n"
    },
    {
      "time": "19 Dec 2008 — 3:14pm",
      "content": "Astigmatism isn't really a big deal; it is readily corrected with prescription lenses. (I know, I have it.)\n\n"
    },
    {
      "time": "21 Dec 2008 — 11:38am",
      "content": "That's good to know, thanks to everyone who posted.\n\n"
    },
    {
      "time": "2 Mar 2009 — 10:22pm",
      "content": "This is indeed an interesting topic.  \nAnything new on it, Andrew?\n\nhhp\n\n"
    },
    {
      "time": "3 Mar 2009 — 2:04am",
      "content": "I have relatively high astigmatism (3.50), and from my years of visits to the ophthalmologist, I believe it gets harder to correct accurately once you pass 3.0 diopters. I've resigned myself to living with some level of distortion.\n\n"
    },
    {
      "time": "3 Mar 2009 — 2:06am",
      "content": "sounds like a defect on your left eye 1985, not a plus or minus but cylindrical defect,\n\n\"Astigmatism (cylindrical defect): When some-one has a cylindrical defect, the eye is not spherical. Mostly this appears on the cornea, but it can also be somewhere else. Because of this, the light is not broken in one direction, and because of that the sight will be distorted. Often this occurs combined with long- or short sightedness. It is possible to put this right by using cylindrical glasses, lenses or a laser treatment.\"\n\n"
    },
    {
      "time": "3 Mar 2009 — 4:27am",
      "content": "It’s not the eye that sees, but the brain. Images passed on by both eyes are processed into a representation and that is where it becomes muddy: the brain makes decisions about what we want to see and what not. Eg if you are focused on things being level, your perception gets tuned to that (the famous carpenters’ eye).\n\nMost important is the fact that most people use two eyes and the brain mixes inputs. When you use just one eye it takes some time for the brain to adapt.\n\nExample: a few years ago I had my eyes lasered. The right one has perfect vision now, which means it is perfectly suited for seeing far off. My left eye has been corrected to about minus 2.5 and is well suited for distances from 60 cms to about 120 cms (I can use my computer without needing glasses — reading is a different matter). My brain picks what it needs — learning that took just a few weeks.  \nAnecdote: My eye doctor told me that elderly people who have their vision restored (removing cataracts and such) sometimes can not adapt and remain virtually blind. Or fall over all the time.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "3 Mar 2009 — 6:45am",
      "content": "This might very well be moot, but:  \nThe retina is actually physically part of the brain!  \nIt just extends all the way into the eye cavity.\n\nhhp\n\n"
    },
    {
      "time": "3 Mar 2009 — 3:25pm",
      "content": "Not moot, maybe veering off-topic, but wow this is a great piece of knowledge!  \n(Wikipedia says not part of the brain proper, but of the CNS? Just to be nitpicky.)\n\n"
    },
    {
      "time": "4 Mar 2009 — 12:02am",
      "content": "Thanks to all who reawakened this thread, interesting to read. I have no updates but will be sure to post when I do owing to the interest.  \nAnyone know of any decent opticians in London (UK)?\n\n"
    },
    {
      "time": "4 Mar 2009 — 2:16pm",
      "content": "\\>\\>\\>Anyone know of any decent opticians in London (UK)?\n\nSpecsavers?\n\n"
    },
    {
      "time": "4 Mar 2009 — 8:45pm",
      "content": "1985, have you been to the optician?\n\nA couple of years ago, I was on a subway platform, looking at the tiles on the wall, and I noticed that the grid looked distorted... But only when I looked at it with my left eye (I am right-eye dominant... I had [strabismus](http://web.archive.org/web/20131023232925/http:/en.wikipedia.org/wiki/Strabismus) as a child). Anyway, I went to see my optician and sure enough I had a (temporary) problem! There is a test you can do with a simple grid printed out on paper... If any of the lines look round or diagonal, then you might have the same condition I had.\n\n"
    },
    {
      "time": "5 Mar 2009 — 12:37am",
      "content": "Thanks Ricardo. I am trying to get an appointment scheduled! I had to wear an eye patch as a child to correct what everyone referred to as a squint, I guess that might have been a strabismus? I went last year to an opticians but something didn't feel right about the prescription, the frames were expensive etc and it never materialized. I really ought to sort it. Thanks again.\n\n"
    },
    {
      "time": "5 Mar 2009 — 6:30am",
      "content": "You're welcome, 1985! I had to use an eye patch, too. :-) I would alternate between covering the right eye one day and the left eye the next. It's usually used for what they call \"lazy eye,\" or [amblyopia](http://web.archive.org/web/20131023232925/http:/www.preventblindness.org/children/amblyopiaFAQ.html). The idea is that you will force the \"lazy\" eye to work harder on the days you cover the \"stronger\" eye. Strabismus is when you are cross-eyed, and that can be corrected with surgery. Read more about strabismus and amblyopia [here](http://web.archive.org/web/20131023232925/http:/www.strabismus.org/amblyopia_lazy_eye.html) (they are not the same thing!).\n\nTry to go to an eye doctor (that is, an optometrist or an ophthalmologist) rather than an optician. In my experience, at least, an optometrist or ophthalmologist will do a more thorough check-up on your vision. An optician is just going to give you glasses.\n\nBest of luck!\n\n"
    },
    {
      "time": "5 Mar 2009 — 8:31am",
      "content": "Hey, you two would make great moles for catching font sharers!\n\n\\> [Strabismus] can be corrected with surgery.\n\nOr botox.\n\nhhp\n\n"
    },
    {
      "time": "20 Apr 2009 — 6:22am",
      "content": "Thought I would post an update because people were kind enough to show an interest.\n\nThe optician concluded I 'exhibit an exophoria' in my left eye.\n\n[http://en.wikipedia.org/wiki/Exophoria](http://web.archive.org/web/20131023232925/http:/en.wikipedia.org/wiki/Exophoria \"http://en.wikipedia.org/wiki/Exophoria\")\n\nShe prescribed a 'prismatic' lens to bring the eye back into line, but I have to wait to see an opthalmologist to confirm the exact prescription. I'm a bit frustrated but nevertheless it is something that seems correctable.\n\nThanks again for all your advice!\n\n"
    },
    {
      "time": "20 Apr 2009 — 11:27am",
      "content": "Thanks for the update, 1985. At least now you can name your condition, and you know that there's a remedy. :-)\n\nThanks for the Wikipedia link, too. Good luck!\n\n"
    },
    {
      "time": "20 Apr 2009 — 12:20pm",
      "content": "Cheers Ricardo\n\nAndy\n\n"
    },
    {
      "time": "1 Nov 2012 — 5:22am",
      "content": "_The retina is actually physically part of the brain!_\n\nAll five sensory systems are; it is only the Sixth Sense—the Sense of Self—which resides entirely within the brain…\n\n"
    },
    {
      "time": "1 Nov 2012 — 6:11am",
      "content": "No, the other senses send signals through the nervous system; the cells in the retina (along with the pathway leading from the main body of the brain to the retina) is actually made of brain cells. This is because there's too much data that sometimes needs to be acted upon very urgently; in fact we couldn't even walk efficiently without this feature.\n\nhhp\n\n"
    }
  ]
}
