{
  "id": "5269",
  "title": "Dictionary Typeface",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can I get some opinions about something I've been thinking about for awhile?...   \n   \nA typeface optimally tuned for foreign-language dictionaries; here are some of the primary concerns that I can see:   \n   \n1) Length of reading time. This depends on the kind of reading (definitely not long-term literature reading, but 2 or 3 pages of speed reading, or \"speed-glancing\", in order to find the desired item, which leads us into #2).   \n   \n2) Vertical, rather than horizontal, reading. This poses the biggest question to me... the vertical motion is similar to that which we experience while browsing a scrolling website (which, of course, uses a sanserif--could any respectable work on paper use sanserif and be taken seriously?)   \n   \nI believe typefaces with heavy or bulky serifs make a dictionary's usability difficult (it's an industry concerned way more with content than practical aesthetics). I wonder, what about a face with soft serifs (that is, something less obtrusive than, say, the in-your-face serifs of an \"s\" in Times Roman), something somewhere just on the edge of having no serifs at all...\n\n",
  "author": "<a href=\"/web/20100619085231/http://typophile.com/user/3373\" title=\"View user profile.\">A. Scott Britton</a>",
  "time": "<br>",
  "uid": "3373",
  "comments": [
    {
      "time": "",
      "content": "Lexicon?   \n   \n [http://www.teff.nl/fonts/lexicon/lexicon.html](http://web.archive.org/web/20100619085231/http:/www.teff.nl/fonts/lexicon/lexicon.html)   \n   \nVictor\n\n"
    },
    {
      "time": "",
      "content": "Lexicon--looks like a nice face; to be honest I was unaware of its existence until you pointed it out, so thanks Victor. But the post wasn't a riddle, I can see the cryptic tone after looking at it now. What I really want is some opinion on what might work best (or better than that used currently) in dictionaries, especially foreign-language dictionaries, and specifically dictionaries covering indigenous languages of the Americas.   \n   \nHaving worked directly in the field of lexicography for the past 3 or 4 years (and still going--much to the dismay of my eyes!), I've noticed the distinct tendency on the part of publishers to give a dictionary's typeface very little thought at all. I believe the criteria at present is the same as any other work of literature--and this just isn't right.   \n   \nJust wanted to pool the \"in-the-know\" expertise of typophiles. And of course, theoretical arguments between Hrant Papazian and John Hudson on legibility are welcome.\n\n"
    },
    {
      "time": "",
      "content": "Involved arguments from me (theoretical, rhetorical, gastronomical, any kind really :-) will have to wait until July 6, but what I can advise is to read anything you can find by Paul Luna, a major heavy at Oxford Dictionary, and a devout typophile. FYI, Luna is a big fan of Unger's work, but also recommends good 'ol Nimrod as a fallback.   \n   \nAs for multi-script work, you're right, there's a huge lack of thoughtfulness and quality, and you can't blame the typographers entirely, because they lack the \"tools\" (ie fonts) to do it right.   \n   \n [http://www.themicrofoundry.com/ss\\_rome1.html](http://web.archive.org/web/20100619085231/http:/www.themicrofoundry.com/ss_rome1.html)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "So much depends on the size/leading of the type (ie, how much does the publisher want to minimize the number of pages), and the paper stock.   \n   \nMy old Penguin Dictionary from the '60s is set in 7/7 Plantin, and the stock is little better than newsprint, but the general effect is excellent (were it not disintegrating).   \n   \nChris Burke's new \"Celeste Text\" looks quite interesting for small size work.\n\n"
    },
    {
      "time": "",
      "content": "why not chucara serif?   \nlooks like appropiate   \n   \n [http://www.typophile.com/forums/messages/29/16859.html?1072247686](http://web.archive.org/web/20100619085231/http:/www.typophile.com/forums/messages/29/16859.html?1072247686)   \n   \nall gerard unger fonts may do a great work, dont forget it.\n\n"
    },
    {
      "time": "",
      "content": "I have designed two dictionnaries with last winter using some newspapers fonts that I have designed 10 years ago. I see good similarities in booth medium: narrow columns, hierarchy, strong contrast between various elements, economy, small sizes used, etc.   \n   \n [http://www.typofonderie.com/alphabets/view/LeMondeJournal](http://web.archive.org/web/20100619085231/http:/www.typofonderie.com/alphabets/view/LeMondeJournal)   \n [http://www.typofonderie.com/alphabets/view/LeMondeSans](http://web.archive.org/web/20100619085231/http:/www.typofonderie.com/alphabets/view/LeMondeSans)   \n [http://www.typofonderie.com/alphabets/view/LeMondeJournalIpa](http://web.archive.org/web/20100619085231/http:/www.typofonderie.com/alphabets/view/LeMondeJournalIpa)   \n   \nIf interested, I be will be probably able to post some images of the results on the web.   \n   \n\"ie, how much does the publisher want to minimize the number of pages\"   \n   \nAt my big surprize, the publisher wanted more pages than what my fonts and design proposed: to give to the potential buyer the feeling that he got heavy, so a complete dictionnary. If it was too light and thin, the future reader \"impression on the object\" can be very wrong: \"Hey, for the same price between two dictionnaries, this one is more heavy and features more pages, its better one for sure!\"\n\n"
    }
  ]
}
