{
  "id": "5270",
  "title": "(x) http: collect - AT Futura Maxi {Marc O}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "![](http://web.archive.org/web/20090704130709im_/http:/www.typophile.com/forums/messages/83/38627.gif) ![](http://web.archive.org/web/20090704130709im_/http:/www.typophile.com/forums/messages/83/38628.gif)\n\n",
  "author": "<a href=\"/web/20090704130709/http://typophile.com/user/1394\" title=\"View user profile.\">david_leonard</a>",
  "time": "<br>",
  "uid": "1394",
  "comments": [
    {
      "time": " 18.Jun.2004 10.22am",
      "content": "Looks like some variety of bold Futura with clipped ascenders.\n\n"
    },
    {
      "time": " 18.Jun.2004 11.12am",
      "content": "Specifically, AT Futura Maxi Bold from Elsner + Flake:   \n   \n [http://www.myfonts.com/fonts/agfa/atfutura-maxi/atfutura-maxi-bold/testdrive.html?s=http%3A+collect&p=72](http://web.archive.org/web/20090704130709/http:/www.myfonts.com/fonts/agfa/atfutura-maxi/atfutura-maxi-bold/testdrive.html?s=http%3A%2Bcollect&p=72)\n\n"
    },
    {
      "time": " 18.Jun.2004 11.15am",
      "content": "Looks right to me -- good eye, Marc!\n\n"
    },
    {
      "time": " 18.Jun.2004 11.16am",
      "content": "How did you find that? I did a search of \"futura\" on MyFonts and it wasn't listed. Very strange.\n\n"
    },
    {
      "time": " 18.Jun.2004 11.29am",
      "content": "It's a dirty little secret, but that's why they call it \"MyFonts.\" What shows up for you is often extremely different than what shows up for someone else, say, Marc. It's based on a number of factors, including shoe size, hair color, and how good you were back when you were seven years old, among others. (Frankly, I was surprised at the one regarding right-handedness, left-handedness, and ambidexterity, but all the other ones seem appropriate to me.)\n\n"
    },
    {
      "time": " 18.Jun.2004 11.30am",
      "content": "Chesh, I've always had a soft spot for this version of Futura, with its \"obese x-height\" (as Hrant might put it).   \n   \nMark, I had a hunch it was the Maxi version, so I used that word in my search term. But you're right, it doesn't come up in a search of \"Futura\" alone.   \n   \nAlso, to amend my ID, the version I linked to is from Agfa-Monotype, not E+F (although I'd swear I've seen a version from them, too).\n\n"
    },
    {
      "time": " 18.Jun.2004 12.05pm",
      "content": "Marc, you might be interested to know that I will soon be digitizing Phil Martin's Fotura Biform family, which is also based on Futura. It has an even more \"obese\" x-height than Futura Maxi. It also has \"biform\" or \"commoncase\" alternate caps which are like giant lowercase characters the same size as the caps. Sort of the opposite of small caps. It's going to be a lot of fun to do.\n\n"
    },
    {
      "time": " 18.Jun.2004 1.39pm",
      "content": "Mmmmm, commoncase/biform -- sounds tasty, Mark. Can't wait to see it!\n\n"
    }
  ]
}
