{
  "id": "52729",
  "title": "Logo for handmade jewelry artist",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I finished this logo a while ago and I just wanted to see what you guys thought and if you had any major critiques. I designed this for a friend's girlfriend who is starting her own jewelry company. For all the non-french speakers out there, the name means \"the little gift\".\n\n ![](http://web.archive.org/web/20120913065502im_/http:/typophile.com/files/le_petit_cadeau_final_5008.jpg)\n\n",
  "author": "SecretFun",
  "time": "16 Dec 2008 — 6:44pm",
  "uid": "20245",
  "comments": [
    {
      "time": "16 Dec 2008 — 9:03pm",
      "content": "For what it's worth - I think the mark is not a good fit for a jewelry business, _especially_ if it's a handmade jewelry. It's too geometrical, which implies precision, which in turn implies by-the-book execution and therefore a lack of creativity.\n\n"
    },
    {
      "time": "16 Dec 2008 — 10:13pm",
      "content": "Got to agree with Alex, this looks too static for something crafty & fun. But having said that I really like the bird illustration and overall composition. Have you tried to redraw this whole thing by hand? It might just spring to life.\n\n"
    },
    {
      "time": "17 Dec 2008 — 4:18am",
      "content": "\"...which implies precision, which in turn implies by-the-book execution and therefore a lack of creativity.\"\n\nI had typed a response and then deleted it. But I have come back because I can't let it go, sorry.  \nWhile I agree that the mark and the type do not work well for hand made jewelry I find the above statement to be, well, ridiculous.  \nMy apologies for digressing, but it hit a nerve.\n\n"
    },
    {
      "time": "17 Dec 2008 — 5:05am",
      "content": "I like it, and if it \"looks\" like her designs and herself, even better. After all, there's all sorts of hand made jewellery out there from simple geometric, perhaps wooden ones to frilly complicated ones with precious stones.\n\n"
    },
    {
      "time": "17 Dec 2008 — 6:06am",
      "content": "Spacing needs attention; for example, I think there needs to be more vertical spacing between the lines.\n\n"
    },
    {
      "time": "17 Dec 2008 — 6:59am",
      "content": "I agree with Graham on the comment above - none of these things are necessarily implied by the logo. Hand-made jewellery is a very general term - I know a fair few people from university who make and sell jewellery in this way. This logo would suit some of them very well, and others not at all.\n\nIt's difficult to give anything more than vague feedback on the logo without knowing a bit more about the type of jewellery the client makes. One thing I would say is that I don't really feel that the type is a good match for the mark. It's a little bit po-faced compared to the cute, fun feel of the logo. I think a nice characterful sans is definitely the right choice, but I'm pretty sure this isn't the right one! I find the diagonal negative space caused by the left aligned text a little jarring as well, but that might just be me. Does it read oddly if 'le petit' is on the same line?\n\nAnyway, a good start and a likeable mark. Good stuff :)\n\nTake care,\n\nAndi\n\n[[semibad](http://web.archive.org/web/20120913065502/http:/www.semibad.com/)]\n\n"
    },
    {
      "time": "17 Dec 2008 — 1:26pm",
      "content": "_I find the above statement to be, well, ridiculous._\n\nGraham, the statement when taken out of its context of course sounds ridiculous. It wasn't meant to be a generic observation, merely an attempt to rationalize why this particular mark isn't working.\n\n"
    },
    {
      "time": "17 Dec 2008 — 11:01pm",
      "content": "I like the bird illustration - I think it fits the indie jewelry market, but the type doesn't work. Changing the typeface to something with a little more personality would go a long way to suggesting handmade.\n\n"
    },
    {
      "time": "18 Dec 2008 — 7:30pm",
      "content": "I think the logo of the bird is rather cute b/c the wings look like the ends of nicely cut ribbon. I think this bird graphic looks different from all the other bird graphics I've seen from independent jewelry artists where they look like illustrations. I agree with the majority of everyone here that maybe you should try another typeface with more character. It's nice to see a sans serif since a lot of indie artists use serif.\n\n"
    },
    {
      "time": "18 Dec 2008 — 9:18pm",
      "content": "I like the mark, and I like the type. I think they could play together a little more nicely.\n\n- Lex\n\n"
    },
    {
      "time": "19 Dec 2008 — 2:46am",
      "content": "I like the bird icon, reminds me a lot of 60's, 70's illustrations! So i think the 30's, 40`s style of your typeface does not fit well.\n\nI would try another style for keeping that flavour:  \nHow about [Chalet paris nineteen sixty](http://web.archive.org/web/20120913065502/http:/www.fontshop.com/fonts/singles/house_industries/chalet_paris_1960/), lowercase, negative tracking  \nor the same face/weight, all caps, with relatively tight setting.\n\nOr if you want full contrast between the icon and type:  \nHow about a script?\n\n"
    }
  ]
}
