{
  "id": "52737",
  "title": "Does a slow text font exist?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "For an article on legibility, Hannes Famira and I have measured reading speed (200-word passages from a mystery novel) for many fonts. Display-font speeds are all over the place, as one might expect. However, we were surprised to find that all the text fonts we tested are fast (more than 200 word/min).\n\nCan you think of a font that might be an exception to this rule? Does there exist a slow text font?\n\n",
  "author": "Denis Pelli",
  "time": "17 Dec 2008 — 12:50am",
  "uid": "39548",
  "comments": [
    {
      "time": "17 Dec 2008 — 1:49am",
      "content": "If it exists my guess is it has wide spacing. Emigre's Mrs. Eaves for example. It isn't really a text font but some peeple insist on setting text with it. The designer Zuzana Licko has said she spaced it out to slow things down a bit, and it does work that way.\n\nYou can slow down the reading experience of just about every text font around by tracking it out.\n\nI'm fascinated by your description of the reading test you devised. 200 word passages from a mystery novel, eh? Did you use only material from that one book, or did you try other kinds of literature such as non-fiction texts or newspaper articles?\n\n_However, we were surprised to find that all the text fonts we tested are fast (more than 200 word/min)._\n\nThat's the least surprizing thing I've heard all week. I would expect a text font to read at least that rapidly.\n\nj a m e s\n\n"
    },
    {
      "time": "17 Dec 2008 — 2:28am",
      "content": "Note: if my memory is correct, Zuzana Licko also says Mrs. Eaves is not a text font, nor is it meant to be one.\n\nj a m e s\n\n"
    },
    {
      "time": "17 Dec 2008 — 2:45am",
      "content": "Any text font reads slowly if you set mathematical content with it. Or anything in a language you've just started to learn.\n\nAs reading slows down, if you're like me, you start paying attention to the forms of the letters and not the content, further slowing yourself down.\n\n"
    },
    {
      "time": "17 Dec 2008 — 3:31am",
      "content": "Mathematical content is not text so that has zero relevance. We're not really interested in the dynamics of unfamiliar language systems versus reading speed or readerability either. Denis wants to know about Latin text fonts that read slowly when set with Latin text in a language familiar to whoever reads it, I think. I could be wrong about that tho. It's impossible to know because Denis has neglected to include relevant information like that.\n\nj a m e s\n\n"
    },
    {
      "time": "17 Dec 2008 — 3:38am",
      "content": "Hi Denis. Did you try a Bodoni?\n\n"
    },
    {
      "time": "17 Dec 2008 — 3:54am",
      "content": "I was also thinking of Bodoni. And maybe Helvetica. How about Rotis?\n\nCouldn't what you are looking for be formulated as a \"not very readable text font\"? Or, therefore simply a \"not very well designed text font\"? That would certainly get you lots of suggestions from Typophiles here.  \nOr is \"slow\" a more specific quality?\n\n"
    },
    {
      "time": "17 Dec 2008 — 4:07am",
      "content": "Which Rotis Tim? Serif, sans, semi sans or semi serif? That you don't specify tells me more about you as a person than about the Rotis series of typefaces. Rotis serif reads at 200 words per minute or better for those of us possessing a clear conscience and an open mind.\n\nHelvetica is not a text font so that doesn't count.\n\nj a m e s\n\n"
    },
    {
      "time": "17 Dec 2008 — 4:35am",
      "content": "\" Does there exist a slow text font?\"  \nCourier and other monospaced fonts have previously tested slower than proportionally spaced types for text.  \nAnd I know one could make something on purpose. Meanwhile Denis, I'm delighted to hear you quoting _words_ per minute. ;)\n\nCheers!\n\n"
    },
    {
      "time": "17 Dec 2008 — 4:36am",
      "content": "(DP)\n\nCheers!\n\n"
    },
    {
      "time": "17 Dec 2008 — 6:17am",
      "content": "<cite>Note: if my memory is correct, Zuzana Licko also says Mrs. Eaves is not a text font, nor is it meant to be one.</cite>\n\nI need to find that quote and put it on a t-shirt.\n\n"
    },
    {
      "time": "17 Dec 2008 — 7:18am",
      "content": "\\>Does there exist a slow text font?\n\nBlackletter?\n\n"
    },
    {
      "time": "17 Dec 2008 — 7:40am",
      "content": "Well, fonts commonly used for text all have good rhythm and evenness of color, and also have a narrow range of darkness, so I'm not surprised that they all do well. I would expect some differences, though.\n\nFirst, even with good text fonts you could slow people down, I think, by long measure (line width) and very tight leading (space between the lines).\n\nI mention this because of the issue of Bodoni. Through a lot of the 19th century text was set in this style of type. Toward the latter part of the century people began to recognize that old style fonts--with less high contrast--were more readable, and lower contrast fonts have been used ever since.\n\nHowever, if you look at the old text settings of Bodoni--style fonts, you will see that they tend to increase word spacing and line spacing in an effort to make them more readable.\n\nSo if you test a high contrast Bodoni in text with the same layout specifications as old style, I think you will get a slower result. I think it would still be slower with the the kind of setting that was once preferred for these, but the difference would be attenuated.\n\nAlso, as I have mentioned before here on Typophile, I think that if you test extended text for both speed and comprehension, you will get more differentiation between type facess and settings. My suggestion has been to do eg three hours continuous of reading tests from the SAT, with the testing for comprehension. Because our perceptual and mental apparatus is very robust--can compensate for difficulties--it can overcome difficulties.\n\nBut if the reader is given more adverse or demanding circumstances, then I think measurable differences will show up. Also I think these differences will correspond to perceived reading comfort.\n\n"
    },
    {
      "time": "17 Dec 2008 — 7:36am",
      "content": "<cite>Mathematical content is not text so that has zero relevance.</cite>\n\nI should have been clearer. I don't know what you took 'mathematical content' to mean, but I meant something like this (from [\"Modular elliptic curves and Fermat's Last Theorem\" by Andrew Wiles](http://web.archive.org/web/20130823224904/http:/modular.fas.harvard.edu/edu/Spring2004/129/references/flt/flt.pdf)):\n\n ![](http://web.archive.org/web/20130823224904im_/http:/typophile.com/files/elliptic_4034.gif)\n\nThis doesn't count as text?\n\n"
    },
    {
      "time": "17 Dec 2008 — 8:03am",
      "content": "I wonder how ITC Garamond plays out in this test. Granted, as a type person it slows me down just because I can't help looking at it in all of its ugliness, but when I'm not paying attention it's still slower to read for me.\n\n"
    },
    {
      "time": "17 Dec 2008 — 8:50am",
      "content": "I read in a book from the 60's called \"Physicological Study of Typography\" and within this it said that Bodoni was the slowest of the bunch that they tested and people complained about it's illegibility because of the contrast in form. Whereas, Imprint was the fastest. The book also has charts of appropriate point-sizes in correlation to ages. The book also provided results of comprehension for the group of about 15 typefaces. I believe Imprint was again the best of the bunch. However, it wasn't completely a direct correlation of reading speed to comprehension. I'd have to get the book again to recall the rest of the results.\n\nThis study also used Walbaum which, I believe, performed only slightly better than bodoni, but similar issues were brought up.\n\n"
    },
    {
      "time": "17 Dec 2008 — 10:08am",
      "content": "Dan - a friend (who is not a type fan) recently showed me a book set in ITC Garamond and mentioned how much she liked it and how easy it was to read. I think the disdain for the face comes mostly from those who know type.\n\n"
    },
    {
      "time": "17 Dec 2008 — 11:52am",
      "content": "\\<\\< I wonder how ITC Garamond plays out in this test. \\>\\>\n\nI just read about 900 pages set in ITC Garamond (in 1992). This was a trade book slightly bigger than 6\" x 9\". I'm guessing it had 40 lines per page of what looks like maybe 10.5/13 ITC Garamond. The reading was so easy, and the text so compelling, that I was able to ignore the typeface, and I had no interest in delving into the type specs.\n\nI fancy myself as one of those who \"know type\" (in Stephen's phrase), so obviously I knew the face as soon as I picked up the book, and my type-ish prejudices came into play. But from page 3 I did not care what the face was. I felt the text read very well. The setting was \"normally\" tight in letterfit and wordspace, and it appears to have been set by a professional typographer or typesetter. There were false small caps for a.m. and p.m., but they were not obtrusive.\n\nThe book was a revelation, for I do not recall that I had ever read that much massed ITC Garamond. I doubt I will be tempted to set any political biographies in the face, though. The experience was not that compelling.\n\nFWIW, the book was \"Truman,\" by David McCullough. At times it veered toward hagiography, but it would be hard to write a more moving and uplifting fictional life story than Harry Truman's as written in this book. A perfect read for this political season in the USA. Highly recommended for those who read that sort of thing.\n\npowers\n\n"
    },
    {
      "time": "17 Dec 2008 — 11:58am",
      "content": "Denis, what text typefaces have you tested so far?\n\nAs others have mentioned, the high stroke contrast Bodoni style types (or related Didot and Scotch Roman) are notoriously considered to be less readable than lower contrast and oldstyle types. Linotype Didot would be a particularly good test case, I think, because the stroke contrast is extreme and the bowl shapes very tenuous.\n\n"
    },
    {
      "time": "17 Dec 2008 — 12:08pm",
      "content": "Tim -- <cite>Couldn't what you are looking for be formulated as a \"not very readable text font\"? Or, therefore simply a \"not very well designed text font\"? That would certainly get you lots of suggestions from Typophiles here. Or is \"slow\" a more specific quality?</cite>\n\nActually I like the 'slow'/'fast' because it says what it measured rather than inferring from reading speed to qualities like 'readable' or 'well designed'.\n\nKarsten\n\n"
    },
    {
      "time": "17 Dec 2008 — 12:46pm",
      "content": "\\>I like the ’slow’/’fast’ because it says what it measured\n\nSo do I, but if you don't include comprehension, you don't get a full picture. Because the goal is speed with comprehension. I would add comfort, but that's more difficult to measure than speed and comprehension. My suggested measure of comfort is decline of either speed or comprehension or both with time reading demanding material, as in the experiment I have suggested above.\n\n"
    },
    {
      "time": "17 Dec 2008 — 1:13pm",
      "content": "<cite>This study also used Walbaum which, I believe, performed only slightly better than bodoni, but similar issues were brought up.</cite>\n\nThen they probably used those display size versions. I got a book in original Walbaum letters here and the smaller sizes are pretty robust with very litte contrast.\n\n"
    },
    {
      "time": "17 Dec 2008 — 1:40pm",
      "content": "Ralf: _I got a book in original Walbaum letters here and the smaller sizes are pretty robust with very litte contrast._\n\nThat is also true of Bodoni's original types, and I have early Didot printings that also do not suffer from the extreme stroke contrast of most modern versions, which have tended to emphasise dynamic extremes.\n\nBill: _...if you don’t include comprehension, you don’t get a full picture. Because the goal is speed with comprehension._\n\nTrue, but from Denis' comments it doesn't sound like they are pushing any speeds at which comprehension (or retention, another important measure) would likely to be a problem. He defines 'fast' as 'more than 200 word/min', which is certainly not speed-reading.\n\n"
    },
    {
      "time": "17 Dec 2008 — 2:14pm",
      "content": "_...all the text fonts we tested are fast..._\n\nGreat news! Within the standard parameters of a text font (including ITC Garamond), it looks like \"readability\", as an empirically measurable quality, doesn't exist. Unless researchers can come up with some measure other than speed.\n\nSo could we please have a little less of this nonsense?\n\n"
    },
    {
      "time": "17 Dec 2008 — 2:28pm",
      "content": "Not meaning to be unkind, but this isn't news. Lots of studies have been done controlling other factors, varying the typeface, and finding minimal differences in reading speed between any vaguely reasonable text faces.\n\nThat doesn't mean that there's no such thing as readability, nor does it deny the existence of other important differences in the reading experience. But reading speed for short passages is not much affected by variance within the realm of vaguely readable text faces.\n\nI'd be curious to see if speed of reading more extended text would be affected more by such differences. How much Arial will somebody read in an hour versus Walbaum versus Minion? Quite possibly this has been done as well, and I just haven't seen it.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "17 Dec 2008 — 3:04pm",
      "content": "_That doesn’t mean that there’s no such thing as readability,_\n\nNo, I'm quite sure it exists. But it can't be measured, or attributed to a typeface.  \nIt's a quality of typography.\n\n_How much Arial will somebody read in an hour versus Walbaum_\n\nAt what size, leading, and measure, and on what paper stock or monitor?  \nRagged or justified?  \nWhich cut of Walbaum?  \nWhat demographic of reader, what genre of writing?  \n&c. &c.\n\nThere is no quid pro quo in assessing one typeface against another; different typographers will optimize them differently, bearing in mind the task at hand.\n\n"
    },
    {
      "time": "17 Dec 2008 — 3:49pm",
      "content": "\\>How much Arial will somebody read in an hour versus Walbaum versus Minion?\n\nThat's the kind of test I've repeatedly suggested before here on Typophile, but more challenging, as the more challenging is more likely to get a differentiation among typefaces.\n\n"
    },
    {
      "time": "17 Dec 2008 — 6:20pm",
      "content": "Great story, Will. I feel duly humbled. Shared it with the said friend and she was very pleased to have confirmation of her experience from one of my kind.\n\n"
    },
    {
      "time": "17 Dec 2008 — 10:55pm",
      "content": "Great thread. If only I had time to read it. Will have to come back to this one.\n\nBriefly, I think Nick gets the cigar: _No, I’m quite sure it exists. But it can’t be measured, or attributed to a typeface. It’s a quality of typography._\n\nThis is good. This is true in my formal estimation and experience. One of the most valuable things Nick taught me soon after I started making fonts was that any display font can be made to give readable results with a bit of judiciously-applied tracking out. It's true. It works, and I've been experimenting with those effects on text fonts in development for five years now.\n\nThank you Nick!\n\nj a m e s\n\n"
    },
    {
      "time": "18 Dec 2008 — 4:51am",
      "content": "\"That is also true of Bodoni’s original types...\" which is to say, without proper knowledge of output...\n\n\"He defines ’fast’ as ’more than 200 word/min’, which is certainly not speed-reading.\"\n\nAs Hannes knows, specification, specification, specification. Who's reading it? How's it being composed? What's the output? Otherwise, who _nose?_\n\nI suggested monospace as a rubber tomahawk to the patella, (the diagnosis is that the patient _may_ be dead), but maybe, yo'all should _try_ read'in this:\n\n[http://eric.ed.gov:80/ERICDocs/data/ericdocs2sql/content\\_storage\\_01/0000...](http://web.archive.org/web/20130823224904/http:/eric.ed.gov/ERICDocs/data/ericdocs2sql/content_storage_01/0000019b/80/32/06/cf.pdf \"http://eric.ed.gov:80/ERICDocs/data/ericdocs2sql/content\\_storage\\_01/0000019b/80/32/06/cf.pdf\")\n\n...and let me know how that goes down. :)\n\nCheers!\n\n"
    },
    {
      "time": "18 Dec 2008 — 8:48am",
      "content": "\"At what size, leading, and measure, and on what paper stock or monitor?  \nRagged or justified?  \nWhich cut of Walbaum?  \nWhat demographic of reader, what genre of writing?  \n&c. &c.\"\n\nI believe at least that the test was done with all the fonts set in 14/16 and tested a variety of demographics.  \nActually, as I begin to remember a little more they did test scientific writings, drama, and another area and tested some specialists in each area.\n\nOne part that i do remember is that the scientists preferred certain fonts in preference that they were more capable of showing mathematic notation.\n\n"
    },
    {
      "time": "18 Dec 2008 — 10:31am",
      "content": "Are there good definitions of _text font_?\n\nI suspect that the definition of text font is any font that can be read fast. There is little else in common with such different typefaces as Bodoni and Helvetica. Conversely, I suspect that display fonts are fonts that cannot be read fast.\n\n"
    },
    {
      "time": "18 Dec 2008 — 11:11am",
      "content": "Kevin, your logic is somewhat circular, and as usual not informed by type culture.  \nFor instance, both Bell Centennial and Freight Micro, which were designed specifically for the most legibility-challenging text usage, have found favor as headline faces.\n\nIt is a premise of the science of categories that strict definitions are not possible.  \ni.e. if one attempts to define the category \"text type\", it will be possible to find text types which have none of the features in one's definition list, and vice versa, types which have all the features, but are not text types.\n\n"
    },
    {
      "time": "18 Dec 2008 — 11:21am",
      "content": "The category 'text type' is indeed somewhat loose, though there is the common place that text types can be used for display, but not necessarily visa versa. For me the terminology is somewhat beside the point, and the interesting question is what qualities in a type design makes it highly readable for extended text at small sizes (roughly 9-12 point printed, similar visual angles on screen). By highly readable I mean can be read with high comfort, speed, and comprehension.\n\nDifferent types have different ideals as far as setting: size, leading etc., so this would need to be part of the study. But, contrary to Nick, I see no insuperable barrier to quantifying the combination of variables.\n\n"
    },
    {
      "time": "18 Dec 2008 — 11:56am",
      "content": "_...but not necessarily visa versa._\n\nMany typefaces that originated as display faces have been adapted for text.  \nFrom my own catalog--Brown and Fontesque.  \nBasically, they just need to have wider sidebearings, and for serif faces, get beefed up a bit.\n\nIt is not the typeface design per se that determines whether a typeface is a text face, but (a) how the typeface is \"scaled\" in anticipation of use at particular sizes in particular media, and (b) whether a typographer decides to use it at text size.\n\n_I see no insuperable barrier to quantifying the combination of variables._\n\nThe sheer number of variables, many of which are difficult to simulate in a laboratory setting, makes it extremely impractical.\n\nAnd what of the typographer?  \nAre fonts such dull instruments that it doesn't make a blind bit of difference who sets them?  \nIs one typographer as good as the next?\n\n"
    },
    {
      "time": "18 Dec 2008 — 7:45pm",
      "content": "Wow! 33 replies in 24 hours. this is very helpful. thanks. by way of response, i'll begin with three general remarks before responding to some of the particular points raised in your many kind postings.\n\nGENERAL\n\nfirst, we are doing other things, as well, in the paper. we are keenly aware that there is more to readability than just reading speed, and that one might question whether speed is even essential. (i think it is; people who read slowly because of low vision, e.g. 30 word/min, complain bitterly.) still, we were suprised by this result and hoped that typophiles might illuminate it and help us look for counter examples. you have. thank you.\n\nsecond, the possibility of a \"slow text font\" hinges critically on how one defines \"text font\". the usual definition is \"suitable for setting large blocks of text\". one might argue that any font that is slow is thus unsuitable and, by definition, cannot be a \"text\" font.\n\nthird, please do not mistake a two-sentence summary for a paper. the rules of publication are strict. what we submit for publication has to be previously unpublished (and public web sites count as publication), so we can bring up (and answer questions about) some specific points here, but the bulk of our paper has to appear for the first time in the manuscript that we submit for publication.\n\nSPECIFIC\n\n**James Arboghast:** _If it exists my guess is it has wide spacing. Emigre’s Mrs. Eaves for example. You can slow down the reading experience of just about every text font around by tracking it out._  \ni'm a Licko fan, but we haven't yet tested Mrs Eaves. Thanks. we are looking at the effect of tracking (see below).\n\n_Zuzana Licko also says Mrs. Eaves is not a text font._  \nthis seems fanciful to me. i've mostly seen it used as a text font, whatever her intention. This is like Tschichold's claim that Palatino is a display font, not a text font (as reported by Noorzij, link below). At some point, one must question the authorities.  \n [http://www.letterror.com/noordzij/interview/index.html](http://web.archive.org/web/20130823224904/http:/www.letterror.com/noordzij/interview/index.html \"http://www.letterror.com/noordzij/interview/index.html\")\n\n_passages from a mystery novel, eh? ... did you try other kinds of literature?_  \nin this particular project, no, but we are about to try another text, chosen to be very difficult (a bit like the mathematical text, Fermat's last theorem, suggested by Jongseong).\n\n_\"However, we were surprised to find that all the text fonts we tested are fast (more than 200 word/min).\"  \nThat’s the least surprizing thing I’ve heard all week. I would expect a text font to read at least that rapidly._    \nYou've put your finger on a key issue. Suppose we do find a slow text font (perhaps Mrs Eaves), that people read at a tedious 50 word/min. Would you accept our finding? Or would you immediately reclassify the font as a display font and deny our claim? It depends on how you define \"text font\".\n\n**Jongseong:** _Any text font reads slowly if you set mathematical content with it. Or anything in a language you’ve just started to learn._  \nYes, indeed. See my comments about Fraktur, below.\n\n**Stephen Coles:** _Did you try a Bodoni?_  \nnot yet, we're about to collect more data on a larger group of fonts, including Bodoni. we're asking here now so that typophile suggestions might better inform our choices. thanks.\n\n**Tim Ahrens:** _I was also thinking of Bodoni. And maybe Helvetica. How about Rotis?_  \nwe tested Helvetica Neue, in regular 55, ultralight 25, and black 95 weights. all gave a similar high speed: 300 word/min.\n\n**James Arboghast:** _Helvetica is not a text font so that doesn’t count._  \nReally? Wow. I'm shocked to hear this. In my mind, Helvetica more than satifies all the criteria to be a text font. The modern/Swiss movement recommended it for all text.\n\nDo other typographers agree with James, denying that Helvetica is a text font?\n\n**dberlow:** _Courier and other monospaced fonts have previously tested slower than proportionally spaced types for text._  \nMy hazy recollection, from past projects, is that Courier is as fast as other fonts. we're including it in our next round of testing.\n\n_And I know one could make something on purpose._  \nPlease, please, this is a tease. Tell us how!\n\n**sii:** _Blackletter?_  \nOh, yes, that is a VERY interesting case. Fraktur (the German blackletter) was common before WWII in Germany, widely used for all text, and considered a text font (or family of fonts). It was outlawed during the war, and is now uncommon. People who are unfamiliar with it find it hard to read. It is now considered a display font, unsuitable for large blocks of text. This suggests that the definition of \"text font\" may not allow for the possibility of being slow. we're including a Fraktur in our next round of tests. we're also tring to find a fluent reader of Fraktur, for comparison. (we'd be very grateful to hear from anyone who reads a lot of Fraktur and might like to participate in a reading test. [denis.pelli@nyu.edu](mailto:denis.pelli@nyu.edu))\n\n**William Berkson:** _First, even with good text fonts you could slow people down, I think, by long measure (line width) and very tight leading (space between the lines)._  \nYes, that's true. However, I think that you would assume that calling a font \"slow\" would be based on reading speed under favorable conditions (easy content, reasonable line length and leading, good lighting).\n\nWe have measured effect of tracking, over a wide range. it has little effect on speed unless the letters overlap or are so far apart that the words disintegrate.\n\nComprehension is important but hard to measure with sufficient precision to be useful as a dependent measure. We ask our observers to read \"as fast as possible while maintaining comprehesion\". After each passage, we ask the observers to provide a gist of what they've read, which we score. Knowing that they will have to provide this gist encourages them to maintain comprehension while reading.\n\n**DanGayle:** _I wonder how ITC Garamond plays out_  \nGaramond (Monotype) is fast: 300 word/min.\n\n**paulstonier:** _I read in a book from the 60’s called “Physicological Study of Typography” and within this it said that Bodoni was the slowest ..._\n\nOh! I didn't know of this book. I'm ordering a used copy now. Very interesting.\n\nBurt, C.L. (1959). _A psychological study of typography._ Cambridge, UK: Cambridge University Press.\n\nThis is the (in)famous Sir Cyril Burt who studied inheritance of intelligence.  \n [http://en.wikipedia.org/wiki/Cyril\\_Burt](http://web.archive.org/web/20130823224904/http:/en.wikipedia.org/wiki/Cyril_Burt \"http://en.wikipedia.org/wiki/Cyril\\_Burt\")\n\nThanks!\n\n**Stephen Coles:** _ITC Garamond ... she liked it and how easy it was to read_  \nNice.\n\n**will powers:** _I just read about 900 pages set in ITC Garamond (in 1992). This was a trade book slightly bigger than 6” x 9”. I’m guessing it had 40 lines per page of what looks like maybe 10.5/13 ITC Garamond. The reading was so easy, and the text so compelling, that I was able to ignore the typeface, and I had no interest in delving into the type specs._  \nWow. That's a compelling testimonial. Thank you.\n\n**John Hudson:** _Denis, what text typefaces have you tested so far? As others have mentioned, the high stroke contrast Bodoni style types ... are notoriously considered to be less readable ..._  \nSo far, we have tested the following text fonts: Garamond (Monotype version 2.35), Helvetica Neue 25, 55, 95, Meta, Proforma, Quadraat, and Times New Roman. We also tested Python Sans, which not everyone would call a text font, and lots of display fonts, e.g. P22 Albers.\n\n**Nick Shinn:** _it looks like “readability”, as an empirically measurable quality, doesn’t exist. Unless researchers can come up with some measure other than speed._  \nWe're working on it. You're a tough critic, so we'll be very interested to see what you think of our paper when we get it out.\n\n**Thomas Phinney:** _Not meaning to be unkind, but this isn’t news. Lots of studies have been done controlling other factors, varying the typeface, and finding minimal differences in reading speed between any vaguely reasonable text faces._  \nYes, you are correct (and not unkind). As you say, there is a large literature showing little effect of typography on speed (e.g. Tinker, 1963). Still, naive as I am, I was surprised. I thought one or another font would be an exception. Not so.\n\nTinker, M. A. (1963). _Legibility of print._ Ames, Iowa: Iowa State University Press.\n\n_I’d be curious to see if speed of reading more extended text would be affected more by such differences. ... Quite possibly this has been done as well, and I just haven’t seen it._  \nI don't think it's been done, though William Berkson has suggested it here more than once.\n\n**James Arboghast:** _One of the most valuable things Nick taught me soon after I started making fonts was that any display font can be made to give readable results with a bit of judiciously-applied tracking out. It’s true. It works, ..._  \nHmm. That's interesting, I didn't know that. But aren't you overstating the case? There are many display fonts whose letters have strange shapes that are hard to decipher, e.g. Psychedelic or Pop-Two. I doubt that generous tracking would overcome the effect of the strange letter shapes.  \n [http://www.myfonts.com/fonts/t26/psychedelic/](http://web.archive.org/web/20130823224904/http:/www.myfonts.com/fonts/t26/psychedelic/ \"http://www.myfonts.com/fonts/t26/psychedelic/\")  \n [http://www.identifont.com/show?2D3](http://web.archive.org/web/20130823224904/http:/www.identifont.com/show?2D3 \"http://www.identifont.com/show?2D3\")\n\n**dberlow:** _try read’in this:  \n [http://eric.ed.gov:80/ERICDocs/data/ericdocs2sql/content\\_storage\\_01/0000...](http://web.archive.org/web/20130823224904/http:/eric.ed.gov/ERICDocs/data/ericdocs2sql/content_storage_01/0000019b/80/32/06/cf.pdf \"http://eric.ed.gov:80/ERICDocs/data/ericdocs2sql/content\\_storage\\_01/0000019b/80/32/06/cf.pdf\")  \nand let me know how that goes down. :)_    \nyes, that's a great example. it's hideous. it takes a great effort to make oneself read it, yet, extrapolating from other tests we've done in the past, i suspect that reading speed is unimpaired. this nicely illustrates Nick Shinn's point that there is more to readability than just reading speed. thank you.\n\nthanks to all.\n\n"
    },
    {
      "time": "18 Dec 2008 — 8:40pm",
      "content": "On the difficulty of testing for comprehension. The SAT tests are supposed to be standardized for difficulty of the material. So if you do the SAT test on somebody, and the variation is more than it would normally be for SAT tests, you will see an indication of effect of the typography.\n\nI really don't think calling something a 'text type' or not for purposes of scientific testing is that useful. It will get into a verbal debate, as it has already to some extent. The issue is really what promotes readability. Now it is reasonable to start with fonts widely used for extended text assuming they represent a high standard, but that's only a starting point.\n\nI don't think the variables are all that huge for usual text types: you have 1. x-height 2. extender heights 3. stem width 4. contrast 5. width of characters 6. point size 7. presence or absence of serifs 8. weight of serifs. 9. width of round strokes. 10. with of rounds counters 11. rhythmic unity of face--measurable using Fourier transforms.\n\nYou can add more, but if you have two fonts that are all the same on these 11, they're probably going to behave quite a lot alike, when it comes to ideal leading and measure.\n\nThe point is, the list is long, but it doesn't go on forever.\n\nNick if you think that your Fontesque and your Goodchild are equally readable, I think you're wrong and probably that Denis's methods, whatever they are, could refute you. Fontesque is charmingly irregular, but I think that makes it less readable than Goodchild, which follows classic proportions.\n\n"
    },
    {
      "time": "18 Dec 2008 — 9:54pm",
      "content": "_if you think that your Fontesque and your Goodchild are equally readable_\n\nBill, I mentioned Fontesque as an example of a display typeface which was later adapted for a text version.  \nIts readability vis-a-vis Goodchild would depend on context; it is not an absolute.  \nReadability is not a quality of typefaces, but of typography; it does not exist until graphic designers, art directors and typographers create typespecs for specific projects.  \nCompare with music: is one instrument more \"listenable\" than another?--it depends on who's playing what, where, and to whom.\n\n"
    },
    {
      "time": "18 Dec 2008 — 10:49pm",
      "content": "\\>\\> DanGayle: I wonder how ITC Garamond plays out  \n\\> Garamond (Monotype) is fast: 300 word/min\n\nAhh, but ITC Garamond is a [very different](http://web.archive.org/web/20130823224904/http:/www.designobserver.com/archives/entry.html?id=205) animal than any other Garamond.\n\n"
    },
    {
      "time": "19 Dec 2008 — 5:37am",
      "content": "Your comparison with a violin in a way begs the question, because it implies that the question of which typeface to use is purely aesthetic.\n\nBut the issue is whether there is such a thing as greater readability among text designs, which you declare as \"nonsense\".\n\nBut you do concede that some faces need to be adapted to work better as text.\n\nI am arguing that some designs are better for readibility. To take your example of the violin. If you have one with a beautiful sound, but too soft to fill a concert hall, then it is not suitable for un-miked concert work, no matter what its aesthetic qualities.\n\nFontesque has aesthetic qualities that makes it well suited to conveying the emotion of some messages, and not others. But I just don't think it would work that well for reading small, extended text. Has anyone ever set a novel in 11 pt Fontesque?\n\nAlso your argument about 'typography' being readable, not fonts, begs the question as well. The question is whether the typeface, when well used as far as measure and leading, is readable in text. There is some flexiblity on the rules for what is a reabable text block, given the features of the type. But the flexibility is not infinite, and the rules are well known, and laid out, for example in Mitchell & Wightman's Book Typography.\n\nThus the fact that the readability of Fontesque is not an absolute and will vary with the context does not make your case. The point is that that variability is restricted, and even with modifications you have made for text, Fontesque will not be as readable as Goodchild when both are set for maximum readability.\n\nDenis, you don't address the issue of declining speed + comprehension as a measure (an inverse) of readability. Will pushing readers to read for a long time on difficult material show up differences in readability that the robustness and adaptability of our perceptual apparatus would otherwise mask?\n\n"
    },
    {
      "time": "19 Dec 2008 — 9:51am",
      "content": "_The point is that that variability is restricted, and even with modifications you have made for text, Fontesque will not be as readable as Goodchild when both are set for maximum readability._\n\nWhy not?  \nIf Will can do 300 pages of ITC Garamond....\n\nBut seriously, why do people consider novel-length durability the sine qua non of readability?  \nThat's Updikean snobbery.  \nAre shoes only \"runnable\" if you can do a marathon in them?  \nWhat about middle distance?  \nSprints?  \nHurdles?  \nLong jump?  \nFootball? Tennis? Basketball?\n\nBill, as you imply (\"...pushing readers to read for a long time...\") length of text is one more variable to be added to the list.  \nIn practice, typography is so multi-variant that only aesthetics can deal with it.\n\n"
    },
    {
      "time": "20 Dec 2008 — 3:06pm",
      "content": "Track\n\n"
    },
    {
      "time": "20 Dec 2008 — 4:37pm",
      "content": "<cite>Do other typographers agree with James, denying that Helvetica is a text font?</cite>\n\nWhile I wouldn't choose to set a large block of text in it, I cannot deny that it is a text font.\n\nDenis, are your test subjects both American and European? I suspect Europeans are more likely to read larger stretches of something like Helvetica comfortably, as opposed to Americans. (Humanist sans are different; I've read many things by Zapf set in Optima, and I'm very comfortable with it.)\n\n"
    },
    {
      "time": "21 Dec 2008 — 8:27am",
      "content": " **Denis** : how one defines “text font” [is critical]. the usual definition is “suitable for setting large blocks of text”.\n\nI think that's an unusual definition, but thanks. Normally, text refers to length not size, and to type not text, and to reading not setting. I will continue to think of it as \"type composed suitably for reading a text\", and I often add where applicable, \"which the reader cannot see the end of from the beginning.\"\n\n**Me** : _And I know one could make something on purpose._   \n**Denis:** Please, please, this is a tease. Tell us how!\n\nI've given you a specific suggestion for piecewise non-linear word-shape busting. There is only one face better at slow-down in this class of eye-beater. _Someone_ could even take Courier, and piecewise non-linearly replace the word space, fijlmrt and w, _and then_ you can test Courier against its better self! And if that's too complex, use Letter Gothic, which could be even slower against it's better self.\n\nBesides that, \"how-to\" retard reading is a topic with such a vast range of anti-relevance to our work, it's too simple: Reader-ability? Give tiny kids Einstein's theory of relativity; Output? Give 'em Cleartype@96 dpi; Composition? Use Word or Photoshop; Type selection? See the Sung & Schwartz study. Any one of these meta-varibles can be used to effect the results of \"reading\" studies, and each has hundreds, some say thousands of variables, while yet others have millions and billions of variables.\n\nWhy do you think there are so many fonts to choose from?\n\nCheers!\n\n"
    },
    {
      "time": "21 Dec 2008 — 10:56am",
      "content": "_Why do you think there are so many fonts to choose from?_\n\nCapitalist excess, comrade.\n\n"
    },
    {
      "time": "22 Dec 2008 — 6:49am",
      "content": "\"Capitalist excess, comrade.\"\n\nProgress, dude.\n\nCheers!\n\n"
    }
  ]
}
