{
  "id": "5274",
  "title": "Sexual Assault postcard",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm designing a postcard for a benefit play for a sexual assault support center and I'm looking for some typographical advice.   \n   \nThe postcard has a large watercolor flower (a lily, I think) and is going to have either a black or PMS 689 (kinda purple) background.   \n   \nI'm looking for a font that's (obviously) strong and feminine at the same time. The text is going to be knocked out of the background, so it can't be ultra-thin.   \n   \nI was thinking that Curlz is really nice.   \n   \nJust kidding.   \n   \nCentaur Swash looks pretty good, but I'm not really excited about the serif coming off the top of the \"P\", and Jennifer isn't bad, but it might be a little too curly and Jennifer Light is too light. Lorrenne? Help?\n\n",
  "author": "lq15",
  "time": "18 Jun 2004 — 1:41pm",
  "uid": "2623",
  "comments": [
    {
      "time": "18 Jun 2004 — 2:02pm",
      "content": "What about Filosofia Italic   \nor Novarese Medium Italic.   \n ![](http://web.archive.org/web/20131020215123im_/http:/www.typophile.com/forums/messages/4100/38658.gif)\n\n"
    },
    {
      "time": "18 Jun 2004 — 5:09pm",
      "content": "Strong and feminine?   \nMaybe Adobe Nueva. Or something Dutch.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jun 2004 — 12:46pm",
      "content": "The client ended up choosing Centaur, though I did like the Novarese.   \nJust thought you might like to know where it went.   \n   \nThanks for your input, guys.   \n   \nGirls, where were you on this one?\n\n"
    },
    {
      "time": "27 Jun 2004 — 6:10am",
      "content": "May I suggest handwriting in a good legible hand? Reinforce the deeply personal aspect.\n\n"
    },
    {
      "time": "27 Jun 2004 — 5:20pm",
      "content": "\\>Girls, where were you on this one?   \n   \nThe title of this thread may have been offputting.   \nIf you don't get a good response to a thread, you can always try again a few days later (time of the week can have an effect too) with a different title.\n\n"
    }
  ]
}
