{
  "id": "52770",
  "title": "Logo for a programming language",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "The Haskell community is looking for a new logo.\n\nHaskell is a functional programming language, featuring laziness and purity. You don't have to know what these mean to help me. The current logo is pretty bad, in my opinion: you can see it at [http://haskell.org/haskellwiki/Image:Haskellwiki\\_logo\\_big.png](http://web.archive.org/web/20131013175832/http:/haskell.org/haskellwiki/Image:Haskellwiki_logo_big.png).\n\nI'd appreciate the comments of people from people whose geekiness tends towards design rather than mathematics, both on my own logo proposals and (if you have time) other proposals at [http://haskell.org/haskellwiki/Haskell\\_logos/New\\_logo\\_ideas](http://web.archive.org/web/20131013175832/http:/haskell.org/haskellwiki/Haskell_logos/New_logo_ideas).\n\nExplanation of some symbolism: the mathematical theory of monads has had a big impact on Haskell, and this uses the operators \\>\\> and \\>\\>= which appear in some of the logo designs. A lowercase lambda is used to denote functions (and, less commonly, an uppercase lambda for a related concept of type-function). The language is named after the logician Haskell Curry.\n\n| Attachment | Size |\n| --- | --- |\n| [haskell-logos.pdf](http://web.archive.org/web/20131013175832/http:/typophile.com/files/haskell-logos.pdf) | 2.09 KB |\n\n",
  "author": "mr",
  "time": "17 Dec 2008 — 9:37pm",
  "uid": "19503",
  "comments": [
    {
      "time": "17 Dec 2008 — 9:41pm",
      "content": "In case all the comments about free fonts on that page bother you, please note that it's legally tricky for an open-source program to have a non-open-source logo. So free means free as in open source, not as in free junk (hopefully).\n\n"
    },
    {
      "time": "17 Dec 2008 — 10:38pm",
      "content": "The principal comment I have is that the λ-based mark is probably not a very good idea simply because Lambda calculus is not unique to Haskell.\n\nI think first two marks in your PDF and ( [this mark](http://web.archive.org/web/20131013175832/http:/media.nokrev.com/junk/haskell-logos/logo6.png)) are good, but they don't really associate with _Haskell_. Looking at the mark it's easy to see it's for one of the functional programming languages, but it could be for Erlang for all I care. In fact, the **L** isp is going to be a more reasonable guess, because L _is_ λ.\n\nI would probably look at using a wordmark, perhaps working the λ or the \\>\\> into a negative space of \"Haskell\". At the very least I'd consider working the H letter into the graphical mark. The mark needs to be tied to \"Haskell\" somehow.\n\n"
    },
    {
      "time": "17 Dec 2008 — 11:50pm",
      "content": "I gave in to the temptation and submitted my own entry. Max, thanks for the link !\n\n ![](http://web.archive.org/web/20131013175832im_/http:/typophile.com/files/haskell_4749.png)\n\n"
    },
    {
      "time": "18 Dec 2008 — 3:17am",
      "content": "Well the best ones to my eyes (and seeing them as logos that can be applied across various applications and are also memorable) were from \"Jeff Wheeler\" and the one that's also posted here from \"Apankrat\".\n\nI think both of them are very similar in style and work well. And if I had to decide between the two it would be Jeff's.\n\nOther's are either not logos at all, to playful/busy/unprofessional...\n\nBut if yours would be the one to progress even further I'd progress... Well I can't associate the arc with anything. And if I remove it, I'm with Jeff's version again. Well at least the third one is not appropriate.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "18 Dec 2008 — 7:50am",
      "content": "I agree with litera, Wheeler's is quite nice. Epsilicon's is as well. Perhaps a tad trendy, but I was drawn to the 'gem H' logo as well.\n\n"
    },
    {
      "time": "18 Dec 2008 — 10:54am",
      "content": "_Well at least the third one is not appropriate._\n\nHow so?\n\n"
    },
    {
      "time": "18 Dec 2008 — 8:11pm",
      "content": "My vote is for Jeff Wheeler's.\n\npenn\n\n"
    },
    {
      "time": "19 Dec 2008 — 9:26am",
      "content": "How so? Because it could be a logo for something else. Not Haskell. It doesn't resemble symbols you need to push forward.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "19 Dec 2008 — 1:28pm",
      "content": "Well perhaps it is a little generic but it does represent the \\>\\>= operator.\n\n"
    },
    {
      "time": "20 Dec 2008 — 1:56am",
      "content": "Stay away from the lambda sign (completely in my opinion, if you can) inside of a closed circle . . . when I saw the lambda sign I immediately thought of Half-Life.\n\n"
    }
  ]
}
