{
  "id": "52787",
  "title": "Research study of critique and the use of online forums",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "All,\n\nI am a faculty member in the Department of Computer Science at the University of Illinois. I am interested in studying the use of online discussion forums for critique and how they can be improved. I have a short (11 question) survey and I would like to invite you to complete and return it to me.\n\nThe survey contains background questions about the value and role of critique and ends with specific questions about the use of technology. It would be most helpful if you could focus on assessing the use of forums such as this one in forming your response to the technology-specific questions. The data will be kept confidential and only ever presentd in aggregate form. I would appreciate hearing about your experiences and learning from them. My return email address is in the survey.\n\nSurvey (to download with IE, right click, save target as):  \n [https://agora.cs.uiuc.edu/download/attachments/9643943/critique-research-study.doc](http://web.archive.org/web/20130823190127/http:/typophile.com/wiki/https%3A/%252Fagora.cs.uiuc.edu/download/attachments/9643943/critique-research-study.doc)\n\nThank you for considering,  \n-Brian Bailey\n\n",
  "author": "bpbailey",
  "time": "18 Dec 2008 — 11:43am",
  "uid": "40856",
  "comments": [
    {
      "time": "18 Dec 2008 — 6:54pm",
      "content": "So, Brian, you want us to respond to your survey on _online_ discussion fora by loading a Microsoft Word document, which we can do by “right-click[ing]” in “IE”?\n\nWhy can’t we just use stone tablets or a slate and chalk?\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20130823190127/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "19 Dec 2008 — 5:58am",
      "content": "Now, Joe, don't be so mean. Just have a scribe copy the document on vellum and send it back via carrier pigeon. What's so hard about that?\n\n"
    },
    {
      "time": "19 Dec 2008 — 5:54pm",
      "content": "Wow. I was excited about getting to fill this survey out since I think Typophile is the very model of a well-functioning online community. But a .DOC file? There are at least a couple hundred free survey websites out there, and you're sending us a .DOC file? Can you maybe mail it to me on a floppy? (5 1/2 inch, please.)\n\n"
    },
    {
      "time": "19 Dec 2008 — 6:15pm",
      "content": "The worst part is that Brian is a member of the Computer Science faculty. If he can't, at least one of his colleages should be able to code an HTML form.\n\n- Lex\n\n"
    }
  ]
}
