{
  "id": "52786",
  "title": "OTF / Any Issues working Cross Platform?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi guys,\n\nI am working on InDesign CS3, Mac version. My client sent me the files with Postscript 1 fonts for Mac. Since more people will be working with similar files PC workers included i persuade my client that will all user Open Type Fonts to avoid Cross Platform issues.\n\nMy questions is:\n\n1 - The fonts for this design are very common: Helvetica Neue, Adobe Garamond, Zap Dingbats (for bullets). Can i just replace an Helvetica Neue Postcript for and Helvetica Neue with OTF without having any noticeable change in the design? I don´t know maybe older Postscript Helveticas Neue to the more modern OTF version has some difference somewhere i cannot appreciate, letter X height or else. I just would not like my 60 pages design to move text frames when changing fonts.\n\n2 - I am checking Font Folio 11 (OTF) and there is Adobe Garamond Pro (or Garamond 3 LT Std or Garamond Premier Pro), not just plain Garamond. Is there any difference at all with its Postscript 1 version for Mac?\n\n3 - I cannot find Zap Dingbats in Font Folio 11, but ITC Zapf Dingbats Std. Is the same?\n\nSorry for the long text. Thanks for any info!\n\nCheers,  \nSebastian\n\n",
  "author": "<a href=\"/web/20101225125656/http://www.typophile.com/user/9533\" title=\"View user profile.\">uzapucax</a>",
  "time": "<br>",
  "uid": "9533",
  "comments": [
    {
      "time": "",
      "content": "\\> _Can i just replace an Helvetica Neue Postcript for and Helvetica Neue with OTF without having any noticeable change in the design?_\n\nYes.\n\n\\> _I just would not like my 60 pages design to move text frames when changing fonts._\n\nYou should be able to switch from the Type 1 version of the fonts to the OpenType version with very little or no reflow at all. If some glyph metrics were changed during the conversion to OpenType, it was because the metrics in the Type 1 were considered a bug.\n\n\\> _Adobe Garamond Pro (or Garamond 3 LT Std or Garamond Premier Pro)_\n\nThe only thing guaranteed these three families have in common is the name \"Garamond\". They are different families and are NOT interchangeable. They share the stylistic design and that's about it. They have many differences in terms of design, metrics, weights, styles, character coverage, OpenType features, etc.\n\n\"Adobe Garamond Pro\" is the OpenType counterpart of Type 1 \"Adobe Garamond\".  \n\"Garamond 3 LT Std\" is the OpenType equivalent of Type 1 \"Garamond Three\" (a.k.a. \"Garamond 3\")  \n\"Garamond Premier Pro\" only ever existed in OpenType format.\n\n\\> _not just plain Garamond_\n\nThere are many [Garamond](http://web.archive.org/web/20101225125656/http:/www.typophile.com/wiki/Garamond) \"cuts\". If \"Garamond\" is the only name that appears on the application's fonts menu, perhaps you're using the [Monotype version](http://web.archive.org/web/20101225125656/http:/www.microsoft.com/typography/fonts/family.aspx?FID=28).\n\n\\> _I cannot find Zap Dingbats in Font Folio 11, but ITC Zapf Dingbats Std. Is the same?_\n\nThe Type 1 version was named \"ITC Zapf Dingbats\". \"Zapf Dingbats\" is probably the TrueType version that comes installed on Windows(?). There's no guarantee that the TrueType version be equivalent to the Type 1 or OpenType versions, but they should be similar for the most part.\n\n"
    },
    {
      "time": "",
      "content": "Miguel, Great info and very good feedback. You almost gave me a master class in fonts!\n\nThanks 1000\n\nCheers,  \nSebastian\n\n"
    },
    {
      "time": "",
      "content": "BTW, the PC Type 1 fonts (`.pfb` and `.pfm` files) can be used in Adobe applications running both on Mac OS X and Windows.\n\nOn Mac OS X, the system won't let you install PC Type 1 fonts.\n\nHowever, if you put the `.pfb` and `.pfm` files into one of the following folders: `/Library/Application Support/Adobe/Fonts/` or `~/Library/Application Support/Adobe/Fonts/` (where ~ is your user folder) then the fonts will be visible in all Adobe Creative Suite applications (but they will not work in non-Adobe applications such as TextEdit, Apple Keynote or Microsoft Word).\n\nOn Windows, you can install the fonts on your system as you normally would. Alternatively, you can put them into the `C:\\Program Files\\Common Files\\Adobe\\Fonts` folder. This way, they will be only available in Adobe applications but not the other Windows applications.\n\nBy putting these fonts into the folder `/Applications/Adobe InDesign CS3/Fonts/` on Mac or `C:\\Program Files\\Adobe\\InDesign CS3\\Fonts` (or appropriate, depending on your InDesign version), you will make the fonts available only within InDesign but not other applications.\n\nThe Adobe-specific font folders on both Mac and Windows accept OpenType and TrueType fonts (`.otf` or `.ttf`) and PC Type 1 fonts (`.pfb` and `.pfm`), On Mac, they also accept Mac Type 1 font suitcases.\n\nAlso note that rather than copying files into those locations, you can put shortcuts/aliases that point to font files or even entire folder trees. The last possibility is particularly attractive.\n\nFor example, I often keep copies of the fonts that I used in a certain project in a specialized folder for that project, along with the actual project documents and assets. To open the project, I quickly drag the shortcut/alias for the project fonts folder into the Adobe-specific font folder, and the fonts are instantly installed within InDesign, Illustrator and Photoshop. I can quickly drag the folder shortcut/alias for an entire folder tree that holds several hundred fonts into the Adobe-specific folder, and I don't have to bother activating all those fonts in my font management app. This is very quick and does not clutter the font menu in the other applications.\n\nSometimes it helps me to get a somewhat \"dodgy\" font to work. Even if it does not work in the system, it may work just in InDesign, where I often need it.\n\nSo: the Adobe-specific font folders are a useful alternative to system font installation, allow use of folder shortcuts pointing to entire folder trees, and allow using PC Type 1 fonts on Mac OS X.\n\nA.\n\n"
    }
  ]
}
