{
  "id": "52796",
  "title": "Mixamatosis - New Hybrid font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is my latest font Mixamatosis. Its slightly out there and slightly unpolished, which is what I going for. I tried to make each letter have their own personality and not be too rigid with guidelines for making the font.\n\nZoom in for best detail.\n\nType Specimen\n\n[http://i6.photobucket.com/albums/y239/Jumpsuit/TypeSpecimenMixamatosis-2...](http://web.archive.org/web/20150417185050/http:/i6.photobucket.com/albums/y239/Jumpsuit/TypeSpecimenMixamatosis-2.jpg \"http://i6.photobucket.com/albums/y239/Jumpsuit/TypeSpecimenMixamatosis-2.jpg\")\n\nType Poster\n\n[http://i6.photobucket.com/albums/y239/Jumpsuit/Mixamatosisposter-3.jpg](http://web.archive.org/web/20150417185050/http:/i6.photobucket.com/albums/y239/Jumpsuit/Mixamatosisposter-3.jpg \"http://i6.photobucket.com/albums/y239/Jumpsuit/Mixamatosisposter-3.jpg\")\n\nLet me know what you think.\n\n",
  "author": "A-type",
  "time": "18 Dec 2008 — 2:18pm",
  "uid": "19413",
  "comments": [
    {
      "time": "18 Dec 2008 — 2:58pm",
      "content": "It's not an attractive font, however It may have some purpose as a display font.\n\n"
    },
    {
      "time": "18 Dec 2008 — 3:55pm",
      "content": "It wasn't intended to be an \"attractive font\".\n\n"
    },
    {
      "time": "18 Dec 2008 — 6:43pm",
      "content": "It reminds me of the \"Outback\"... something native to Australia.\n\n"
    },
    {
      "time": "27 Dec 2008 — 7:49am",
      "content": "Seems the backward D is likely to be a problem. It works when there's enough context, but people will read it as O or A in a lot of situations.\n\n"
    },
    {
      "time": "5 Jan 2009 — 10:17am",
      "content": "It reminds me of tree rings and rock paintings mixed together. I like the organic look, it's fun.\n\nI couldn't read the D though so that may need rethinking.\n\nAre the two colours going to be separate fonts overlaid?\n\n"
    },
    {
      "time": "13 Jan 2009 — 6:16pm",
      "content": "I thought the font was going to get trashed in this critique, which when constructive isn't always a bad thing. However, I'm pleased with some of the impressions you guys are receiving.\n\nIn concerns with the backward D, I agree and have made the changes to reverse it.\n\nTo Bendy: The two fonts are going to be as one. I've never seen a font that was constructed like that and I think it was part of what drew me to making the complete letter set. I enjoy this font but I'm unsure what I am going to do with it as of right now, it kind of feels like a wild animal.\n\nOne thing for sure is I'm going to touch up some of the inside portions of the letters a little and play around with the M and the W a little more.\n\n"
    },
    {
      "time": "29 Jan 2009 — 7:53pm",
      "content": "I think Bendy was getting at the technical challenges involved in making multicolor fonts. As far as I'm aware, the available options are to either make them as vector clip art, in PS Type 3 font format (which is a largely obsolete format, for which tools and compatibility are limited), or make a separate font for each color with the same spacing and overlay them in use. That sort of layered font set has been done before, but for the moment I'm blanking on the names\n\nI love what you've done with the thing, though. What a fun poster!\n\n"
    }
  ]
}
