{
  "id": "528",
  "title": "Color Fonts",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm looking for a Windows bitmap font editor that supports color... or is it possible to create color vector fonts?   \n   \nit's all new to me so feel free to laugh :P\n\n",
  "author": "__implements__",
  "time": "4 July, 2003 - 1:37pm",
  "uid": "2008",
  "comments": [
    {
      "time": " 4 July, 2003 - 3:45pm",
      "content": "You can create Type 3 fonts with colour, though I don't know how to use them.   \n   \nType 3 fonts are basically a collection of EPS images mapped to character locations.\n\n"
    },
    {
      "time": " 6 July, 2003 - 7:07am",
      "content": "Paul,   \n   \nAlso I am not sure what you are aiming at. We have colour fonts but the designer has some work to do. Picking the colours is one of them and recommended I would think.   \n   \nYou may look at this and tell me if that is what you are after. I expect it will be a alphabet rather than the example shown here.   \n   \n [http://www.lanstontype.com/WaterGardenMulti.html](http://web.archive.org/web/20051125212637/http:/www.lanstontype.com/WaterGardenMulti.html)   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": " 6 July, 2003 - 8:42am",
      "content": "Using Type 3 fonts is problematic. ATM can't render them so you will only be able see on-screen whatever bitmap fonts were created for the font. As far as I know, these bitmap fonts can only be black and white. You will also only be able to print them on PostScript devices. And no hinting, either.\n\n"
    },
    {
      "time": " 6 July, 2003 - 10:52am",
      "content": "See [http://www.photofont.com/](http://web.archive.org/web/20051125212637/http:/www.photofont.com/)\n\n"
    },
    {
      "time": " 6 July, 2003 - 2:28pm",
      "content": "Actually the fonts will not be alphabets. I don't need to print them either. Gerald... how were those created... what software package?   \n   \nI'm close to abandoning the whole thing. I can't seem to find what I'm looking for... Full color fonts, bitmap or vector, and the software to create them.   \n   \nAnyone know where I can find the .ttf and other file format specs?\n\n"
    },
    {
      "time": " 6 July, 2003 - 4:17pm",
      "content": "What John said.   \nYou need Pyrus BitFonter.   \nAnd avoid the T3 format.   \n   \nOr (if you have only a few colors in your design), you can layer regular outline fonts that are -very careful- made of parts, giving each \"part-font\" a different color. FontShop has one or two fonts like that.   \n   \nhhp\n\n"
    },
    {
      "time": " 6 July, 2003 - 5:09pm",
      "content": "yeah... BitFonter is the only app I've found... unfortunately I'm on a PC.\n\n"
    },
    {
      "time": " 6 July, 2003 - 5:17pm",
      "content": "Paul,   \n   \nThink of it this way. Design the font in one colour. Determine how many colours are to be in the font. Make copies of your \"finished\" outline fonts. Then work by subtraction.   \n   \n\"Keep notes.\"   \n   \n [http://www.lanstontype.com/JacobeanInitials.html](http://web.archive.org/web/20051125212637/http:/www.lanstontype.com/JacobeanInitials.html)   \n   \nGerald Giampa\n\n"
    },
    {
      "time": " 7 July, 2003 - 11:43am",
      "content": "Letterror's [LetterSetter](http://web.archive.org/web/20051125212637/http:/www.letterror.com/cgi-python/letterror/shop/LetterSetter?accept_entities=%DA%DC%E8%CF&package=all&page=interface&id=c1a4d8ede4f2296e97e3fb43e1511&sampletext=Spui&fontmenu=Federal9) can export multicolored, multi-layered PDF vector files. It's only suitable for headlines right now, but they do license the technology to select interested parties.\n\n"
    },
    {
      "time": " 7 July, 2003 - 12:10pm",
      "content": "[http://typographi.ca/000381.php#000381](http://web.archive.org/web/20051125212637/http:/typographi.ca/000381.php#000381)   \n   \nhhp\n\n"
    },
    {
      "time": " 8 July, 2003 - 1:31am",
      "content": "Paul,   \n   \nOne of the other things I did not mention, but you would figure out quickly, is the path direction after subtraction.   \n   \nThere are hinting considerations. I would have to think through them again. Unless you sell the fonts I would not worry much about that.   \n   \nThe other method for colouring fonts is the kerning method.   \n   \nYou make the font in the same method but you assemble them differently. Colour the elements with the kerning off, turn the kerning on and the character assembles. For simple arrangements this is rather nice. Especially if you wish to make a subtle change in colour. The other method you must wade through layers. Both have advantages.   \n   \nThis example is shown by the central birds and tree.   \n   \n [http://www.lanstontype.com/FleuronsBird.html](http://web.archive.org/web/20051125212637/http:/www.lanstontype.com/FleuronsBird.html)   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": " 17 July, 2003 - 8:57pm",
      "content": "BTW, I own the domain colorfonts.com which expires in September.   \n   \nIf you'd like to purchase it please make an offer: [hrant@inverselogic.com](mailto:hrant@inverselogic.com)   \n   \nhhp\n\n"
    }
  ]
}
