{
  "id": "5280",
  "title": "Elitist Community",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I didn't realize you need \"credentials\" to participate in these forums.   \n   \nI tried to edit a post and someone (a moderator?) played a joke on me and suddenly a font class tag appeared in my post that said font class = \"don't look like crap\". The humor/humour was lost on me, but the \"hint\" or \"snub\" wasn't.\n\n",
  "author": "twila",
  "time": "Sat, 2004-06-19 10:36",
  "uid": "3691",
  "comments": [
    {
      "time": " Sat, 2004-06-19 10:55",
      "content": "Nobody played a joke on \\*you\\*, and there was no hint or snub. If you look at the source for any page with posts, that's actual code they're using on the pages, for everybody. Nothing to do with you personally.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " Sat, 2004-06-19 10:59",
      "content": "That may happen to EVERYONE editing a post..   \n_( It happened to me before and I am a 'Uppercase' member of this 'elitist community'.. )   \n   \nIf you are editing a post, just make sure to remove the 'fontclassdontlooklikecrap' tags and comments.._   \n      \n   \n( I think this has to do something with CSS / style tags.. With html.. With code.. Not with an elitist community.. ![:-)](http://web.archive.org/web/20050518125043im_/http:/www.typophile.com/forums/clipart/happy.gif) All the people I 'met', until now, at Typophile, are nice and sincere, so, please, dont take this too serious.. And a warm 'Welcome' to Typophile.. )\n\n"
    },
    {
      "time": " Sat, 2004-06-19 11:04",
      "content": "Oh, that happened to me too Twila Olson!   \nI thought it was the worm within ![:-)](http://web.archive.org/web/20050518125043im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n [http://fray.com/drugs/worm/](http://web.archive.org/web/20050518125043/http:/fray.com/drugs/worm/)\n\n"
    },
    {
      "time": " Sat, 2004-06-19 11:51",
      "content": "A while back, about a year ago I think, some Typophile members were complaining about how the Typophile forums looked in their browser of choice on their platform of choice. This lead to some attempts by Joe and Jared to control the code produced by the engine which runs this discussion group. They were only partially successful (as I recall) and, apparently out of frustration over the difficulty of doing this, named one of the styles they created \"dontLookLikeCrap\". Unfortunately, the way they did it must have been something of a hack, since the style declaration shows up when you try to edit your post and then becomes part of the post when you save it (unless you know to remove it). It adds it in every time you edit a post, so you might end up with several littering the beginning of your message.   \n   \nUntil Joe and Jared find a better solution, the only thing you can do is try to remember to remove the offending tags when and if you change your mind about something you post.   \n   \nIn the mean time, I have a suggestion to Joe and Jared: Maybe you could rename the style \"RemoveThisFontTagMarkUpIfYouEditYourPost\" or something similar.\n\n"
    },
    {
      "time": " Sat, 2004-06-19 17:16",
      "content": "Thanks, Mark, and everyone, for explaining what happened.   \n   \nAnd please accept my apology for my impulsive overreaction.   \n   \nI guess either way, the joke's on me, but now I see the humor in it (only I'm more embarrassed than anything).\n\n"
    },
    {
      "time": " Sun, 2004-06-20 14:45",
      "content": "I dont think the type community is elitist, anymore than I think the bongocero community is, its just not well understood or known about.   \n   \nSpending your life explaining to people that yes, new typefaces do sometimes need to be created, or that no, I can't \"just\" send the font files for that job to you, or that there is a good reason why you chose Verdana over Helvetica for that website is often lonely and frustrating.   \n   \nTypophile reminds us that there are other like-minded nerds out there too. And thats cool.\n\n"
    },
    {
      "time": " Mon, 2004-06-21 07:40",
      "content": "Yea, these forums kind of suck in terms of technology. They're great in terms of content, though, and, as always, content trumps technology. ;o)\n\n"
    },
    {
      "time": " Mon, 2004-06-21 08:55",
      "content": "David   \n   \n\"like-minded nerds\"   \n   \nSpeak for yourself. [http://lanstontype.com/EarlyDiefenbaker.html](http://web.archive.org/web/20050518125043/http:/lanstontype.com/EarlyDiefenbaker.html)   \n   \nTwila, some of us are grumpy. [http://lanstontype.com/GiampaHouse.html](http://web.archive.org/web/20050518125043/http:/lanstontype.com/GiampaHouse.html)\n\n"
    },
    {
      "time": " Mon, 2004-06-21 09:48",
      "content": "Ihana kotona!\n\n"
    },
    {
      "time": " Mon, 2004-06-21 10:23",
      "content": "My mirror at home has the same \"Don't look like crap\" message on it, but I try not to take that one personally either.\n\n"
    },
    {
      "time": " Mon, 2004-06-21 10:45",
      "content": "Mine says \"you look like crap\" when I get up in the morning, so I guess I'm overly-sensitive \\<img\\>   \n   \n(insert bigsmile.gif there if it doesn't show...I'll never get the hang of posting in here)\n\n"
    },
    {
      "time": " Mon, 2004-06-21 10:55",
      "content": "After 890-odd posts here, I'm still too lazy to learn how to get those smilies to show up. I just use the old method. :-)   \n   \n(It drives me a little crazy that you have to use non-standard markup for links here. It's gotten so I sometimes type backslashes, commas and curly brackets when I'm writing HTML code. Argh.)\n\n"
    },
    {
      "time": " Mon, 2004-06-21 12:19",
      "content": "I never liked emoticons, so I've tried to avoid them, but that just make people think I'm hating.   \n   \nWell yeah, explaining why we need new typefaces usually makes people smile and then turn to talk to other people, like car designers, who somehow never have to explain why we need new cars.\n\n"
    },
    {
      "time": " Mon, 2004-06-21 12:37",
      "content": "Good one Kenn.\n\n"
    },
    {
      "time": " Mon, 2004-06-21 21:19",
      "content": "Perhaps we should set all of their dashboard control labels in Garamond and ask their opinion of new typefaces a few months later.   \n   \n\"How fast are we going?\"   \n   \n\"Um, I'm not sure... I think... hey, why are all the numbers so funny looking?\"   \n   \n\"I have to drive. I can't read the speedometer and drive at the same time. There's a magnifying glass in the glovebox, it came with the car.\"\n\n"
    },
    {
      "time": " Tue, 2004-06-22 17:53",
      "content": "\\>...There's a magnifying glass in the glovebox, it came with the car.\"\\<   \n   \nAsk Alice what trouble that got her into   \n:-)\n\n"
    }
  ]
}
