{
  "id": "52821",
  "title": "Which curve is your favorite?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I want to do a real quickie user study for my thesis, and would like your help. All you have to do is look at the curves below and choose your favorite. Then, in the thread below, tell me which one it is. It would be best if you don't look at the responses first.\n\nWhat are you looking for? Above all, smoothness (or \"fairness\" in the CAD lingo). Anything that looks like an unsmooth transition should be rejected. All these curves are fairly smooth, so you're just choosing the best. Another way to think about it is, if you put down points at the peaks and valleys and asked the computer to draw a smooth curve through them, which one would you prefer?\n\n ![](http://web.archive.org/web/20131017090749im_/http:/typophile.com/files/aesthetic_4003.png)\n\nLater I plan to do this as a more controlled user study, with an interactive slider. But I want to get a rough idea of the range of curves that people find most attractive.\n\nThanks greatly!\n\n",
  "author": "raph",
  "time": "19 Dec 2008 — 10:10am",
  "uid": "4406",
  "comments": [
    {
      "time": "19 Dec 2008 — 10:17am",
      "content": "(1.5) and i'm not sure why.\n\n"
    },
    {
      "time": "19 Dec 2008 — 10:19am",
      "content": "I like the 1,5 best, but when I try to draw a curve, the end result comes out something like 2,5 on the top parts and 1,5 at the bottom.  \nHope this helps.\n\n"
    },
    {
      "time": "19 Dec 2008 — 10:22am",
      "content": "1.5 and I promise I didn't look at the other responses first\n\n"
    },
    {
      "time": "19 Dec 2008 — 10:28am",
      "content": "1.5\n\n"
    },
    {
      "time": "19 Dec 2008 — 10:39am",
      "content": "2\n\n"
    },
    {
      "time": "19 Dec 2008 — 10:40am",
      "content": "3\n\n"
    },
    {
      "time": "19 Dec 2008 — 10:46am",
      "content": "While I'm feeling slightly seasick, I choose 2, but I suspect if you included more curves at either end, I'd probably go for the middle.\n\n"
    },
    {
      "time": "19 Dec 2008 — 10:56am",
      "content": "I think it might be a mistake to present the curves sorted by \"sharpness\". The order might influence which one people choose. For instance, people might assume that the \"correct\" answer should be somewhere towards the middle of the list and so they ignore the top and bottom curves. It probably would have been better to have the curves in random order.\n\nFor your interactive test, you might consider e.g. presenting two curves at a time and ask the test subject to select the smoother one. You could also ask about other properties than smoothness, to hide intention of the study from the subjects. Things like, idunno, hard/soft, organic, natural/artificial, aesthetically pleasing. You could even throw in a few silly things like happy/sad or purple. Then again, asking for other things than smoothness might also make the subject focus less on the smoothness and make the answers less useful. I don't know.\n\nOh, and I liked 2.\n\n"
    },
    {
      "time": "19 Dec 2008 — 10:57am",
      "content": "None of the above.\n\n"
    },
    {
      "time": "19 Dec 2008 — 11:16am",
      "content": "0.5. It seemed friendliest. Plus it was the easiest for me to look at individually without being distracted by the others. I agree with the previous comment about presenting them in a random order.\n\n"
    },
    {
      "time": "19 Dec 2008 — 11:21am",
      "content": "1.5\n\n"
    },
    {
      "time": "19 Dec 2008 — 12:15pm",
      "content": "1.5 or 2.\n\n"
    },
    {
      "time": "19 Dec 2008 — 1:16pm",
      "content": "Well it's switches and ashes for you Nick : )\n\nMichael\n\n"
    },
    {
      "time": "19 Dec 2008 — 1:55pm",
      "content": "1 and 1.5\n\n"
    },
    {
      "time": "19 Dec 2008 — 2:13pm",
      "content": "1 or 1.5\n\n"
    },
    {
      "time": "19 Dec 2008 — 2:27pm",
      "content": "_...switches and ashes..._\n\nAw Michael, don't I get any kudos for suggesting that in matters aesthetic a plain ol' peak-to-trough mathematical curve is not worth considering? Can't we have something more nuanced, more human, more attractive to ponder? Something more typographically apropos?\n\n"
    },
    {
      "time": "19 Dec 2008 — 3:21pm",
      "content": "Absolutely Nick. Picasso's line drawing of a nude would be better don't you think? I was going to put up my last EKG... I like the spikes better than the curves. It's edgier : )\n\nMichael\n\n"
    },
    {
      "time": "19 Dec 2008 — 3:22pm",
      "content": "1\n\n"
    },
    {
      "time": "19 Dec 2008 — 3:37pm",
      "content": "1.5\n\n"
    },
    {
      "time": "19 Dec 2008 — 3:51pm",
      "content": "2\n\n"
    },
    {
      "time": "19 Dec 2008 — 4:06pm",
      "content": "1\n\n"
    },
    {
      "time": "19 Dec 2008 — 8:22pm",
      "content": "1.5 Smooth and not rigid. The lower ones feel a little stiff.\n\n"
    },
    {
      "time": "20 Dec 2008 — 3:38am",
      "content": "1.\n\n"
    },
    {
      "time": "20 Dec 2008 — 3:48am",
      "content": "1,5\n\n"
    },
    {
      "time": "20 Dec 2008 — 4:18am",
      "content": "I must be nuts, I like 4. The zing ... hair stands on end.  \nprgr\n\n"
    },
    {
      "time": "20 Dec 2008 — 6:21am",
      "content": "2\n\n"
    },
    {
      "time": "20 Dec 2008 — 7:35am",
      "content": "2\n\n"
    },
    {
      "time": "20 Dec 2008 — 1:06pm",
      "content": "0.5\n\n"
    },
    {
      "time": "20 Dec 2008 — 1:29pm",
      "content": "I prefer the blue one.\n\n"
    },
    {
      "time": "20 Dec 2008 — 1:31pm",
      "content": "Number 2 for me.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2008 — 2:01pm",
      "content": "Sorry but: nonsense question. Even with a category like smoothness at hand -- what kind of curve may fit best depends on the typeface one is designing. Sometimes rounder (0.5) and sometimes edgier (4) is more appropriate ...\n\n"
    },
    {
      "time": "20 Dec 2008 — 3:04pm",
      "content": "None, they are all ugly and mechanical.\n\n"
    },
    {
      "time": "20 Dec 2008 — 3:18pm",
      "content": "2\n\n"
    },
    {
      "time": "20 Dec 2008 — 3:40pm",
      "content": "1.5\n\n"
    },
    {
      "time": "20 Dec 2008 — 7:32pm",
      "content": "1.5 or 2 ..which one is the exact sine curve y-sin(x) ? I am keenly aware how illustrations in physics texts (including my own) sometimes incorrectly draw the typical wave-form sinusoidal curve as anything from 0.5 to 3.5\n\n"
    },
    {
      "time": "20 Dec 2008 — 8:01pm",
      "content": "2 i guess\n\n"
    },
    {
      "time": "20 Dec 2008 — 10:01pm",
      "content": "2.5: the earlier curves look, for some reason, dopey, and the later ones looks too severe. I suspect the presentation of these curves creates bias, though. If you had presented the curves one by one, and I wasn't looking at each in the context of all of the others, I might have felt differently.\n\n"
    },
    {
      "time": "20 Dec 2008 — 11:42pm",
      "content": "Number 2.\n\n"
    },
    {
      "time": "21 Dec 2008 — 1:13am",
      "content": "I would say I like all of these curves equally and see no reason or rhyme to choose any one in particular. I would say that but have decided not to because I don't really like any of them. Not just saying that because Nick said \"none of the above\".\n\nMy main reason is Raph is studying for a computer science degree. If this was for a Master of Arts in Graphic Design or Typeface Design it would have relevance to typeface design and typography.\n\nMy answer: none of them because none of this is relevant.\n\nj a m e s\n\n"
    },
    {
      "time": "21 Dec 2008 — 1:30am",
      "content": "1/1.5\n\n"
    },
    {
      "time": "21 Dec 2008 — 2:12am",
      "content": "0.5 but then again if this has to do with type design it all depends on the feel you are going for\n\n"
    },
    {
      "time": "21 Dec 2008 — 3:36am",
      "content": "3\n\n"
    },
    {
      "time": "21 Dec 2008 — 4:40am",
      "content": "testing one two one two... two it is... but I do believe it depends on what the usage is...\n\n"
    },
    {
      "time": "21 Dec 2008 — 5:57am",
      "content": "<cite>My main reason is Raph is studying for a computer science degree. If this was for a Master of Arts in Graphic Design or Typeface Design it would have relevance to typeface design and typography.</cite>  \nI think Raph's questions are in deep connection with Spiro, which is a nice way to draw glyphs – but computer has some limited and controlled freedom connecting main points, not knowing what is “smooth”. Raph, am I right? I would like to read your thesis when you finish it.\n\nOh, and the nicest smooth curve is 1.5 … or 2 :)\n\n"
    },
    {
      "time": "21 Dec 2008 — 3:47pm",
      "content": "1 or 1.5\n\n"
    },
    {
      "time": "21 Dec 2008 — 4:24pm",
      "content": "None seem quite right to me. I'd like to see something in between 1 and 1.5. At 1 and less the curves tend toward becoming semicircular while at 1.5 and up they look distinctly sharp to me.\n\n"
    },
    {
      "time": "21 Dec 2008 — 8:06pm",
      "content": "0.5  \nit just seems friendlier, i dont know why.\n\n"
    },
    {
      "time": "21 Dec 2008 — 8:39pm",
      "content": "I'm with Nick on this one, but I do like the strobe effect of scrolling over the image quickly. Then, they all look good.\n\n-=®=-\n\n"
    },
    {
      "time": "21 Dec 2008 — 9:36pm",
      "content": "_I think Raph’s questions are in deep connection with Spiro, which is a nice way to draw glyphs – but computer has some limited and controlled freedom connecting main points, not knowing what is “smooth”._\n\nIt would help if Raph had explained that to begin with. He still has the opportunity to add this information to the thread header.\n\nHow about it, Raph? What is this actually for, and how does it relate to typography / type design?\n\nj a m e s\n\n"
    },
    {
      "time": "21 Dec 2008 — 10:39pm",
      "content": "How about it, Raph? What is this actually for, and how does it relate to typography / type design?\n\nFrankly, I'm a bit shocked and appalled at your parochialism. Making a mathematical model of how smoothness is perceived is uninteresting if the person doing it is a computer scientist? What of the pursuit of pure knowledge?\n\nThat said, yeah, this is for Spiro, and I've used these curves extensively in my own font designs. 1 represents the Cornu spiral, and 2 and 3 are other shapes that can emerge from the four-parameter curve equation. All of these are instances of the so-called \" [aesthetic curve](http://web.archive.org/web/20131017090749/http:/www.yoshida-lab.net/aesthetic/index-e.html)\", which is coming out of Japan. I'm particularly interested in the family because I think going down the line (choosing a higher number) may make the curve solution more stable, less wiggly. Originally, I was thinking that existing models of perception of smoothness (such as MEC energy) would predict that 1 would be the smoothest and other exponents less so, and that I'd be sacrificing smoothness to get better stability, but now it seems like you might get both by choosing an exponent around 1.5 or maybe 2.\n\nHope you find that edifying, and I will definitely post a link to the chapter with the results when I get it done.\n\n"
    }
  ]
}
