{
  "id": "52846",
  "title": "Error message help please.",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi,  \nI'm a newbie creating my first font and trying to learn as much as possible at the same time.\n\nI've created all my glyphs, kerned etc and generated a Truetype Font.  \nI'm just in the early days of testing and tweaking.  \nI'm not too precious about the font as it's the learning that matters.  \nHave run the font through FontValidator and I am getting an Error message E6039 (in red) , see below,  \n--------------------------------------------------------------------------------  \n_Message: E6039  \nRasterization Test: Point out of range_\n\nEither the zero-based point value exceeds the larger of the maxp table values of maxPoints - 1 and maxCompositePoints - 1, or the zero-based point value exceeds value for the number of points in outline - 1, including phantom points.  \n--------------------------------------------------------------------------------\n\nFontvalidator, via a link, then directs me to Microsoft were I now need to download the set of 4 Truetype Word Instructions documents.Done.  \nI have started to read these(without understanding all I'm reading!)and I was wondering if someone could explain my Error message more easily in layman's terms, and if this message seriously effects my font. The font so far works fine in Word, illustrator and Indesign.Is there an easy fix I'd understand?\n\nIt gets a bit overwhelming when I try to learn and fix up a problem, only to find I need to study and understand another whole branch of typography just to get ahead.  \n(I'm probably only whining like a newbie, so please forgive me.)\n\nAny...and I mean any help would be greatly appreciated.\n\nThanks in advance guys.\n\nDrj\n\n",
  "author": "Dr jack",
  "time": "20 Dec 2008 — 3:42am",
  "uid": "36432",
  "comments": [
    {
      "time": "20 Dec 2008 — 6:16am",
      "content": "Hi, this appears to be a problem with the way the TrueType file was generated; either incorrectly calculating the maxp table, or incorrectly recording values in the glyf table.\n\nThese are things that should be done automatically by your font creation program. Could you give us some more info about what programs you used to draw the glyphs and create the font?\n\nJason C\n\n"
    },
    {
      "time": "20 Dec 2008 — 9:21pm",
      "content": "Hi Jason,  \nIllustrator for the glyph creation.  \nNo visible problems bringing them in.  \nFontLab for font creation.  \nI also have no error (red) arrows generated by FontAudit.  \nCheers\n\n"
    }
  ]
}
