{
  "id": "52870",
  "title": "Sans for Feijoa?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "If [Feijoa](http://web.archive.org/web/20131106085612/http:/vllg.com/KLIM/Feijoa/mudTyper+Weights/) is the main body text in a book, what sans would work well for headings, captions, and back cover text?\n\nI'm thinking of [Vista Sans](http://web.archive.org/web/20131106085612/http:/www.emigre.com/EF.php?fid=200), a squarish sans to complement the curves of Feijoa. Or would such a contrast be jarring? Does a curvy serif absolutely need a curvy or neutral sans?\n\nThoughts/alternatives?\n\nThank you.\n\nRahim\n\n",
  "author": "RahimSnow",
  "time": "21 Dec 2008 — 3:21am",
  "uid": "28631",
  "comments": [
    {
      "time": "21 Dec 2008 — 3:44am",
      "content": "Maybe [Section](http://web.archive.org/web/20131106085612/http:/vllg.com/Lux/Section/mudTyper+Weights/).\n\n"
    },
    {
      "time": "21 Dec 2008 — 7:41am",
      "content": "Can you post a couple screenshots pieced together to get a look at that combination? Since this is a book - I would probably go with something that is more stylistically related. If it were a magazine, I think you could play more with the headings.\n\n"
    },
    {
      "time": "21 Dec 2008 — 9:22am",
      "content": "Not so easy, I just have PDF.\n\n ![](http://web.archive.org/web/20131106085612im_/http:/typophile.com/files/feijoasection01_6520.png)\n\n"
    },
    {
      "time": "21 Dec 2008 — 11:53pm",
      "content": "Here's a sample with Seravek and Vista Sans. The Seravek/Feijoa pair look like a safe choice to me. Does the Vista Sans/Feijoa pair work or clash?\n\n ![](http://web.archive.org/web/20131106085612im_/http:/typophile.com/files/ricoeur2_5162.gif)\n\n"
    },
    {
      "time": "22 Dec 2008 — 2:36pm",
      "content": "Section has the square look but not the elegance I was looking for. And now that I've been staring at my own sample, Vista Sans doesn't look right either. Seravek Bold starts looking generic. Seravek Medium looks a little better (sample below).\n\nThe search continues...\n\n ![](http://web.archive.org/web/20131106085612im_/http:/typophile.com/files/ricoeur_seravek_feijoa_5669.png)\n\n"
    },
    {
      "time": "22 Dec 2008 — 2:42pm",
      "content": "It's hard to see, I'm too distracted by the hinting.\n\n"
    },
    {
      "time": "22 Dec 2008 — 3:25pm",
      "content": "How about [Quadraat Sans](http://web.archive.org/web/20131106085612/http:/www.fontshop.com/fonts/singles/fontfont/ff_quadraat_sans_regular/)?\n\n"
    },
    {
      "time": "22 Dec 2008 — 8:19pm",
      "content": "Quadraat Sans, interesting, could work.\n\nI'm also looking into [FF Milo](http://web.archive.org/web/20131106085612/http:/www.fontshop.com/fonts/downloads/fontfont/ff_milo_2_ot/) and [Parisine](http://web.archive.org/web/20131106085612/http:/www.typofonderie.com/alphabets/view/ParisinePTF).\n\n"
    },
    {
      "time": "23 Dec 2008 — 3:16pm",
      "content": "I think Seravek seems to work well.\n\n"
    },
    {
      "time": "23 Dec 2008 — 4:27pm",
      "content": "Why not Kris's [National](http://web.archive.org/web/20131106085612/http:/vllg.com/KLIM/National/mudTyper+Weights/)?\n\n"
    },
    {
      "time": "23 Dec 2008 — 4:58pm",
      "content": "I did consider Kris's National but then decided I wanted a more humanist sans for this project.\n\nRahim\n\n"
    },
    {
      "time": "23 Dec 2008 — 5:37pm",
      "content": "The lowercase a in Seraveck is _very_ distracting... almost cartoony.\n\nHow about Relato Sans, Mundo Sans, even Myriad???\n\nMilo is neutral and very geometric also worth a try.\n\n"
    },
    {
      "time": "23 Dec 2008 — 6:41pm",
      "content": "\\> <cite>The lowercase a in Seravek is very distracting... almost cartoony.</cite>\n\nMike, do you mean the lowercase 'a' in Vista Sans? That's the one some people often point out as problematic.\n\nRelato (i like the regular, but don't like the italics)  \nMundo (possible)  \nMyriad (i tried it out and didn't give me the warm fuzzies)\n\nI'm looking at a printed sample of FF Milo right now and getting lots of warm fuzzies while still getting that neutral look from it. It looks really good paired with Feijoa.\n\nAlso, it works out better to get the single weights because the bundles don't offer a significant difference in price.\n\nSo I'm leaning toward licensing the Text, Text Italic, Regular, Regular Italic, Medium, and Bold of FF Milo right now and sorta creating my own bundle.\n\nRahim\n\n"
    },
    {
      "time": "23 Dec 2008 — 11:07pm",
      "content": "Hi Rahim:\n\nI love the lowercase a in Vista but as for pairing it with Feijoa... it feels too technical. Seravek is too wobbly.\n\nI’m thinking you should go with something, such as Milo, that is so neutral and geometric to the point of being invisible.  \nThe reason for this being that Feijoa has so much personality, it might create a busy page.\n\nWhat is your book about?\n\nAlso look at Maurea (similar to Kievit but much less expensive)\n\nRonnia is another alternative to Milo if you can chance it.\n\n"
    },
    {
      "time": "24 Dec 2008 — 12:00am",
      "content": "Hi Mike:\n\nThanks for the clarification. I see what you're saying now.\n\nYou know what made me think Vista Sans could be literary as well as technical? There are [specimens on Emigre's website](http://web.archive.org/web/20131106085612/http:/www.emigre.com/EFfeature.php?di=200) that have text that starts off with, \"I sit in the shade of an ancient, dying juniper tree...\" I read that and thought, wow, this might work for some more literary stuff too. But you're right, Feijoa \\*and\\* Vista Sans saturate the page with so much character that it would be difficult to create a harmonious contrast.\n\nYup, I've 95% decided to go with FF Milo. It just looks better than anything else I've seen.\n\nMaurea was a total surprise. I had not heard of it. Looks nice. Lots of weights. OpenType. And so affordable. Thanks for letting me know.\n\nI'm waiting to use Ronnia somewhere in the distant future. I like it very much.\n\nMy book is about how people today can use the wisdom of the world's religions in practical ways to raise the quality of the happiness in their actual daily lives. You could say I am taking those wisdom teachings, removing all foreign terminology, unhelpful dogma, and uncritical mythology, and putting them in a blender and making a smoothie that is both tasty (relevant) and nourishing (effective).\n\nAnd it will be set in Feijoa and FF Milo (unless I change my mind again). Ha! :)\n\nRahim\n\n"
    },
    {
      "time": "24 Dec 2008 — 12:58pm",
      "content": "Milo looks good to me. There are just enough subtle design details to keep it from being another generic, neutral sans. Good luck on your project, it sounds interesting.\n\n"
    },
    {
      "time": "24 Dec 2008 — 1:13pm",
      "content": "I don't know how well it goes with Feijoa, but thanks for mentioning Milo. I hadn't looked at it before, and it's quite impressive. You'd think after so many humanist sans recently, another would be ho-hum, but this one manages to be strong while being not severe, but a bit soft and inviting.\n\n"
    },
    {
      "time": "26 Dec 2008 — 3:13pm",
      "content": "If you like the general form of Section but want something with a little more elegance and slightly more expanded, try [Apex](http://web.archive.org/web/20131106085612/http:/vllg.com/Thirstype/ApexNew/mudTyper+Weights). I use this quite often lately - it's a great headline face, and also works for limited runs of body text.\n\n"
    }
  ]
}
