{
  "id": "52949",
  "title": "Setting of H1, H2, Body etc to share same baseline",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I may be a bit misleading in the subject but Robert Bringhurst and David Blatner have mentioned it their books about setting H1, H2, Body etc so they share the same baseline without having to set to baselne, okay not so well explained but will try again\n\nIf I set the H1 to be 18/10 H2 12/16 and Body as 10/18 that is should share the same baseline or be lining up when I have columns of text, its just that I dont have my books with me to check this out and know that both those books explain how to do it so they line up with having to set in indesign align to basegrid etc.\n\nDid I kinda make sense or you know what Im trying to say?  \nAll critique welcome! ›\n\n",
  "author": "Monsta",
  "time": "24 Dec 2008 — 3:53am",
  "uid": "34545",
  "comments": [
    {
      "time": "24 Dec 2008 — 4:26am",
      "content": "Achieving true shared baselines is very hard. You can never be sure which typefaces are used to display a webpage & most browsers use the top offset of a font to render type, and not the baseline like most page design programs. The different x-heights mess up sharing baselines.\n\nAlistapart published an informative article about this:\n\n[http://www.alistapart.com/articles/settingtypeontheweb](http://web.archive.org/web/20130516052555/http:/www.alistapart.com/articles/settingtypeontheweb \"http://www.alistapart.com/articles/settingtypeontheweb\")\n\nRob Goodlatte built a small bookmarklet to help check whether you are on the right track:\n\n[http://robgoodlatte.com/2007/07/31/syncotype-your-baselines/](http://web.archive.org/web/20130516052555/http:/robgoodlatte.com/2007/07/31/syncotype-your-baselines/ \"http://robgoodlatte.com/2007/07/31/syncotype-your-baselines/\")\n\nHope this helps.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "25 Dec 2008 — 4:39pm",
      "content": "Hey Bert,\n\nThanks for your reply but the effect that I am trying to do is for print work, though those links are good too.\n\n"
    },
    {
      "time": "26 Dec 2008 — 3:23pm",
      "content": "Sorry, I read H1 etc. and assumed it was for a website.\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
