{
  "id": "5296",
  "title": "Harry Potter End Credits",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "No, I didn't see the movie, and no, I don't have a sample.. I wouldn't bother posting this if it weren't for this: My girlfriend went to see the movie with her brother, and when she returned she commented on how she liked _the typeface they used for the end credits_!   \n   \nI was so proud! ![:-)](http://web.archive.org/web/20071010134858im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nSo she asked me what typeface it was, but I have no idea.. I don't want to disappoint her, so here's my question: Did anyone catch the movie and can you remember the end credits?\n\n [‹ &#40;x&#41; STIHL logo - custom designed {Yves}](http://web.archive.org/web/20071010134858/http:/typophile.com/node/5260 \"Go to previous forum topic\") [&#40;x&#41; Slane logo - Charlemagne, ITC Tiffany {Franz, Eduardo} ›](http://web.archive.org/web/20071010134858/http:/typophile.com/node/5300 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071010134858/http://typophile.com/user/2181\" title=\"View user profile.\">franz</a>",
  "time": "<br>",
  "uid": "2181",
  "comments": [
    {
      "time": " 21.Jun.2004 9.46am",
      "content": "We are poisoning our girls. It's a fact ![:-)](http://web.archive.org/web/20071010134858im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 21.Jun.2004 10.13am",
      "content": "I did see the movie and I wondered this myself. The typeface is first seen on the Mirauder's map. and the end credits take cue from that. I was reminded of Poetica, but it was distressed and Poetica is not.\n\n"
    },
    {
      "time": " 21.Jun.2004 11.05am",
      "content": "To me it looked like a custom version of [Nicholas Cochin](http://web.archive.org/web/20071010134858/http:/www.myfonts.com/fonts/ef/nicolas-cochin/). I was very impressed that the main credits appeared to be hand-lettered. Once they got into the thousands of other people who worked on the film, it's clearly type, with some alternate characters thrown in liberally. My guess is that is was one or more custom fonts and quite a bit of calligraphy.   \n   \n(I quite enjoyed the Mirauder's Map-inspired end credits which twisted and turned as if it was a pop-up map designed by M.C. Escher. The type treatment was fun, too.)\n\n"
    }
  ]
}
