{
  "id": "52975",
  "title": "Marian Banjtes",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Aloha~~~  \nI'm currentely doing a project on a selected typographer where i have to do a exhibition for her and design stuffs to promote that exhibition. I have chosen Marian Banjtes as my designer, i'm going to produce a poster,invitation card and commenmorative book to promote her exhibition. The outcomes must related to her style and the themes i have chose, which is 'Ornament, MB's way to rationalize emotions'.\n\nPlease leave any comment for the piece of art work i have done...Thank you very much=)\n\n ![](http://web.archive.org/web/20140807061723im_/http:/typophile.com/files/poster%203_4791.jpg)\n  \nPoster design\n\n ![](http://web.archive.org/web/20140807061723im_/http:/typophile.com/files/colours_3964.jpg)\n  \ninitial design \n\n ![](http://web.archive.org/web/20140807061723im_/http:/typophile.com/files/book%20cover%207_3513.jpg)\n  \nbook cover design\n\nThe fact that the ornament being 'boxy' is because i draw it according to the graph paper, this is the way of MB's working method. I was trying to use her way to do it, hopefully...it comes out soemthing similar with her.\n\n",
  "author": "pris",
  "time": "26 Dec 2008 — 4:12pm",
  "uid": "39206",
  "comments": [
    {
      "time": "26 Dec 2008 — 7:00pm",
      "content": "Your design is perhaps the most un-Banjtes thing I have ever seen.\n\nHave you actually looked at any of her work?\n\n"
    },
    {
      "time": "27 Dec 2008 — 6:21am",
      "content": "You could start by spelling her name correctly: Marian Bantjes. ;)\n\n"
    },
    {
      "time": "27 Dec 2008 — 7:13am",
      "content": "My typo isn't going to have any effect on that poster design. It looks like a quilt from some old lady's home.\n\n"
    },
    {
      "time": "27 Dec 2008 — 8:30am",
      "content": "I'm still digging her piece/s in Sagmeister's book. Sugar type!\n\n[http://www.bantjes.com/index.php?id=218](http://web.archive.org/web/20140807061723/http:/www.bantjes.com/index.php?id=218 \"http://www.bantjes.com/index.php?id=218\")\n\n_\"If you hit a wrong note, it’s the next note that you play that makes it good or bad\" - Miles Davis_\n\n"
    },
    {
      "time": "27 Dec 2008 — 9:03am",
      "content": "Wow, harsh crits.\n\nI think Bantjes style is hard to knock off because I'm still not convinced she was born on this planet. Her work has an other-world quality. To me her work shares a biological/organic quality similar to Margo Chase, but with smaller, more detailed ornament. If I were to try to mimic her work, I would try to imagine drawing an organic form on a grid, yet not always bound to symmetric growth.\n\nGood luck with it, and with luck maybe MB will pop in to give her opinion.\n\n"
    },
    {
      "time": "27 Dec 2008 — 11:14am",
      "content": "I'm afraid I have to agree with James (terminaldesign): this design really fails to capture what Marian's work is all about. Marian deliberately avoids using fonts in her work: it is all about melding lettering and ornament in ways that are only possible when both are made in the same way by the same hand. You can't get that effect by taking some fonts and some ornaments and slapping them together. It is worth noting that Marian's rejection of the use of fonts extends to her own typeface design, Restraint. For Marian, the Restraint font is the design, not something to be used in design. Of course, other people can use it, and perhaps it is something that you should consider: it is the easiest way to inject some genuine Bantjes elements into your poster.\n\n[http://www.tiro.com/Restraint/index.html](http://web.archive.org/web/20140807061723/http:/www.tiro.com/Restraint/index.html \"http://www.tiro.com/Restraint/index.html\")\n\n"
    },
    {
      "time": "27 Dec 2008 — 12:55pm",
      "content": "I am seeing something in your work that reminds me of Marian’s work: the idea of drawing a complex design out geometry. That reflects the isometric perspective work she did for Typecon 2007 and the gridded sustainability piece she did for a paper company. I think that you can do much better by throwing this away and focusing on the kind of deep and thoughtful process behind Marian’s work, so that you have something really special of your own instead of a poorly-informed attempt at aping her work.\n\nTry contacting Marian and see if she can send you the presentation she gave about the process behind the sustainability piece. Once you see that you’ll understand what I mean and be in a better position to respond to her work with some of your own.\n\n"
    },
    {
      "time": "27 Dec 2008 — 2:41pm",
      "content": "Her presentation at Pop!Tech was lovely too.\n\n[http://www.poptech.org/popcasts/popcasts.aspx?lang=&viewcastid=210](http://web.archive.org/web/20140807061723/http:/www.poptech.org/popcasts/popcasts.aspx?lang=&viewcastid=210 \"http://www.poptech.org/popcasts/popcasts.aspx?lang=&viewcastid=210\")\n\n"
    },
    {
      "time": "28 Dec 2008 — 12:35pm",
      "content": "Perhaps it would be worth purchasing Marian’s typeface [Restraint](http://web.archive.org/web/20140807061723/http:/www.tiro.com/Restraint/index.html) and using it throughout your campaign. It will give you a better understanding of Marian's work and make your pieces look great. Plus, it will be a win for Marian.\n\n"
    },
    {
      "time": "28 Dec 2008 — 12:43pm",
      "content": "I would abandon an initial execution directly on the computer. Start with hand-drawn elements if you wish to \"replicate\" her style. There's value in drawing first, even if you're hand skills are terrible. Immersion is another element that will help. Surround yourself visually with things she has done that inspire you rather than interjecting your own interpretation of how she approaches her process. Have you contacted her directly? There may be some insight you can garner with specific questions that will help direct you.\n\n"
    },
    {
      "time": "28 Dec 2008 — 2:40pm",
      "content": "Your design isn't completely hopeless.  \nI like the colours, and your small geometric components.  \nBut there are several serious lapses of taste.  \nFirstly, the square proportions are nasty.  \nSecondly, the typefaces you have chosen are horribly kitsch; yeah they are fancy and ornamented, but not in a way that is relevant to design today, where designers are more thrilled by encrusting Helvetica with flourishes--a quite different kind of ornamentation.  \nSo I would say change the proportions, and choose a face that Ms Bantjes might use in her work, such as FF Sanuk (for TypeCon 2007).  \nAlso, you have three or four kinds of ornamentation going on: the quilt panes, the spirals, the star, and the type flourishes--it's better to limit the number of element classes.\n\nBear in mind that it's Your design for a gallery, you're not trying to do it as if she is self-publishing a book, so you could try to establish some kind of dialectic between what represents the work shown in the gallery, and the brand of the gallery. The usual way galleries do this is by going totally \"neutral\" and bland with their layout and typography, letting the work depicted create the vibe.\n\nSo, any one of the elements, contrasted against a plain type. But then, the viewer would wonder, is that ornamental thingy one of Bantje's?\n\nShow some Restraint?!\n\n"
    },
    {
      "time": "28 Dec 2008 — 7:48pm",
      "content": "Design-wise: the elements need to be more integrated and complex. If you built onto this about 50 times further you would get something beginning to resemble something inspired by her work.\n\nHowever, I believe the trick to faithfully and respectfully represent Marian Bantjes is to get inside her head and work out from there. Pattyfab gave you gold with that link to her talk, but I think you have to dig even deeper into her, which probably means you have to dig inside your own head too.\n\nP.S. Thanks Pattyfab, I hadn't seen that talk yet.\n\n"
    },
    {
      "time": "28 Dec 2008 — 8:00pm",
      "content": "I have never seen an exhibition catalog or associated collateral that attempted to mimic a featured artist’s work. Certainly being chosen for a show would intimate that the work was original in voice to an extent that you should not try and do something in the style of. Having said that, most exhibitions do have access to images of the artist’s work, and in some cases participation or original pieces specifically for a publication.\n\nI would rethink a bit from the start.\n\n"
    },
    {
      "time": "29 Dec 2008 — 8:27am",
      "content": "Good point, jupiterboy. My assumption is this is an assignment where the professor has asked the students to replicate a designer's style in the form of promotional materials in order for the students to learn about the designer. The exercise is probably more about learning deconstructing how someone work than appropriately presenting an exhibit. However, this would be a great point to bring up at critique and discuss.\n\n"
    },
    {
      "time": "30 Dec 2008 — 11:27am",
      "content": "You don't necessarily have to imitate her style literally to be effective. You could opt to showcase a singular piece, using your own layout and typographic flavor and then elements of Bantjes work could be added for emphasis. Artistry that unique is hard to duplicate. As some contributors noted, exhibition promotional pieces are not always replications of featured work.\n\nBecause her work is so stunning, I wouldn't try to compete with it, it's so distinctive that it speaks for itself. Possibly you could use a san serif sparingly where bits of her work could \"lop\" over it, all against a simple background. Start with her website to see how she mixes the \"organic\" with a serious underlying of geometric structure and work from there.\n\nBut because this is \"your\" project, you should come through too.\n\n"
    },
    {
      "time": "30 Dec 2008 — 11:39am",
      "content": "If you're looking for inspiration, why not contact her directly? Most designer types are quite flattered when someone, especially a student, shows an interest in their work. The impression I've always gotten from her writings is that she's not completely full of herself. She might even be able to suggest an archetypal piece of hers that you can use to build your program around.\n\nI agree that you should probably not try to duplicate her style. She's a one-off, not prone to much imitation. Find a way to present her designs in a supporting context that can show your understanding of her work. I assume that's the real point of the class project anyway.\n\n"
    },
    {
      "time": "30 Dec 2008 — 11:41am",
      "content": "x2 on contacting her. You might even get permission to use images of some work in your project—wouldn't that be legit.\n\n"
    },
    {
      "time": "30 Dec 2008 — 12:19pm",
      "content": "Not sure if I even agree with the premise of the challenge: To promote a particular visual artist that has a very strong and unique visual style by emulating their own style?\n\nNo matter how talented of a designer one may be, they're still just trying to emulate someone else's well-known style, so it'll always pale in comparison.\n\nSo, in many ways, pris is trying to do the impossible.\n\nIf you must do this project, I'd suggest going for an 'essence' rather than a 'duplicate' of her style. Do your own thing with some tie to what she does, but don't try to emulate her actual style.\n\n"
    },
    {
      "time": "30 Dec 2008 — 12:46pm",
      "content": "Well you are getting at it. I might have not picked the talent I most liked but rather have a go at a historical figure or movement. A group show is an interesting in. That usually dictates you can't feature one artist over another or someone gets hurt about it. That is a fine time for a committee to decide they need a typographic approach.\n\n"
    }
  ]
}
