{
  "id": "530",
  "title": "Creating fonts...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Ijust recently got a new computer and the main programs I have is Photoshop 7, Image Ready, and Paint shop pro. Anyways, I have been creating fonts that can be scanned into the computer. I know I don't have the appropriate software, but is there anyway I can just work with what I have and not have to get Font lab or Fontographer? Now, sure I would love those programs but there is no way I can afford that stuff now. Maybe someone can give me some helpful advice as far as how can I create the fonts using the programs that I have if it is possible.\n\n",
  "author": "longlegzs80",
  "time": "5 Jul 2003 — 6:36pm",
  "uid": "1940",
  "comments": [
    {
      "time": "5 Jul 2003 — 8:27pm",
      "content": "Photoshop, Image Read, PSP, they're all bitmap programmes, they don't deal with vectors (which is what fonts are) except in a very limited fashion.   \n   \nIf you don't want to spend the money on Fontlab or Fontographer, you can try FontTool from the people who make Fontlab. It's a \"light\" version of Fontlab, perfect if you don't need to take advantage of all the high end features. You can check it out at [www.pyrus.com](http://web.archive.org/web/20131016215859/http:/www.pyrus.com/).   \n   \nIf you know German, there is a free tool out there called Manutius. [http://www.typeforum.de/print.php?sid=126](http://web.archive.org/web/20131016215859/http:/www.typeforum.de/print.php?sid=126)\n\n"
    },
    {
      "time": "7 Jul 2003 — 8:00pm",
      "content": "What about piracy?? It\n\n"
    },
    {
      "time": "7 Jul 2003 — 9:06pm",
      "content": "\\*cough cough\\* of course.\n\n"
    },
    {
      "time": "8 Jul 2003 — 6:48am",
      "content": "TypeTool is a good place to start as its cheap, good, and there is an upgrade path to the full FontLab for when you get more adventurous. You're also supporting an active developer community, unlike Macromedia's shameful treatment of Fontographer.   \n   \nIncidentally, if you are pondering stealing font software, do bear in mind the people who produce it. In the case of FontLab, its a few eager enthusiastic developers who want to create a great product for the type community and hopefully make a living from their efforts. In the case of Fontographer, its a bunch of idiotic short-sighted suits with a cash cow who they never feed.   \n   \nGive some money to the nice Russians, thats what I say.\n\n"
    },
    {
      "time": "8 Jul 2003 — 11:36am",
      "content": "Photosop 7 has vector capability...\n\n"
    },
    {
      "time": "8 Jul 2003 — 11:54am",
      "content": "Yes it does, hence my \"they don't deal with vectors except in a very limited fashion\" comment.   \n   \nPhotoshop's vector capabilities are crippled compared to Illustrator's.\n\n"
    },
    {
      "time": "8 Jul 2003 — 11:57am",
      "content": "I agree it's limited, but still capable if bezier curves etc - might work on a limited budget.\n\n"
    },
    {
      "time": "10 Jul 2003 — 6:53pm",
      "content": "Sarah, are you the student, BFA, visual communication....you asked about type design (a month ago ?)? 1. do you have a pen? pencil? paper? 2. do you have illustrator/freehand? 3. start to draw. then buy FontLab - ONLY leagal copy!!!!!!!! 4. try to obtain : \"anatomy of a typeface\" by Alexander Lawson. ? \"letters of credit\" by Walter Tracy. ? \"creative lettering today\" by Michael Harvey. 5. go to [www.gillbell.com](http://web.archive.org/web/20131016215859/http:/www.gillbell.com/) - great artist. 6. go to [www.waterslettering.com](http://web.archive.org/web/20131016215859/http:/www.waterslettering.com/) - Julian Waters - THE MASTER of the fine art of lettering (englishman, of course ![:-)](http://web.archive.org/web/20131016215859im_/http:/www.typophile.com/forums/clipart/happy.gif) and there is Hermann Zapf, of course ![:-)](http://web.archive.org/web/20131016215859im_/http:/www.typophile.com/forums/clipart/happy.gif). by the way - Waters was his student ).\n\n"
    },
    {
      "time": "10 Jul 2003 — 7:12pm",
      "content": "Hey david, nice list!   \n   \nSome variations:   \n- Probably TypeTool instead of FontLab.   \n- I'd be careful about getting so calligraphic.   \n   \nBTW, it's \\*Jill\\* Bell.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jul 2003 — 7:24pm",
      "content": "ohhhhhpsssss. sorrrrry. thanks.\n\n"
    },
    {
      "time": "11 Jul 2003 — 8:00am",
      "content": "thank you to all that have responded. Thanks to David for his list, I do appreciate it, but I don't have illustrator or freehand. My computer only has Photoshop 7, Image Ready 7, Paint Shop Pro for only 30 days trial run, and that is it. So, instead of me going out and buying software with what little amount of money I have, I am going to work with what I have. I really appreciate everyone helping me out. I will take your suggestions DAvid and get the books and study and read and do all that good stuff. Thanks again.\n\n"
    },
    {
      "time": "13 Jul 2003 — 12:51pm",
      "content": "Sarah,   \n   \nyesterday i was at a friend's house and saw the latest MacAddict (i think it is the August issue, #84). it has a tutorial on TypeTool, and at the end there is a sidebar about a \\*free\\* font editor you can get on the web. this program is called PfaEdit and it is open source (i think the article said it was UNIX-based, but i'm not sure)... according to MacAddict this program is very buggy and even the author of the program recommends saving often. the website includes a manual and many comments on installing, etc. this program lets you create new fonts or edit existing ones. i have not tried it myself, but if you are interested, here is the link:   \n   \n [http://pfaedit.sourceforge.net](http://web.archive.org/web/20131016215859/http:/pfaedit.sourceforge.net/)   \n   \ngood luck,   \nRic\n\n"
    },
    {
      "time": "13 Jul 2003 — 3:24pm",
      "content": "You gotta love OpenSource.   \n   \n   \nEven if we didn't have the benefit of it pissing Microsoft off, we still get all sorts of cool software.\n\n"
    },
    {
      "time": "14 Jul 2003 — 2:23am",
      "content": "Hey!   \nThe site \"Notes on type design\" is the only complete type design handbook free and on line.   \nVery useful IMHO...   \n   \n [http://briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm](http://web.archive.org/web/20131016215859/http:/briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm)\n\n"
    },
    {
      "time": "30 Apr 2004 — 3:05pm",
      "content": "TypeTool was given away (full version) on the Computer Arts coverdisc, April 04 issue, also there was a tutorial in the magazine. You should be able to get an issue from [www.computerarts.co.uk](http://web.archive.org/web/20131016215859/http:/www.computerarts.co.uk/)\n\n"
    },
    {
      "time": "16 Jun 2004 — 4:20pm",
      "content": "Write the alphabet on a sheet of paper, scan it into your computer and save it as a .jpg or whatever you are comfortable with. Crop each seperate character and save it as A.jpg, a.jpg, etc. Go to:   \n   \n [http://www.high-logic.com/](http://web.archive.org/web/20131016215859/http:/www.high-logic.com/)   \n   \nDownload their pdf or check out their online manual, download their Font Creator Program for a 30 day free trial. Open a \"new font\" and name it. Copy your letters one at a time and paste them into the appropriate edit windows. Look at the results in \"Test Font.\" Start making corrections and adjustments.   \n   \nYou will soon know if you want to continue on or not.\n\n"
    },
    {
      "time": "8 Jul 2003 — 10:32am",
      "content": "Don't let the lack of font software stop you from using your   \nfonts.   \n   \nIf you want to use your type in a limited way - to set a   \nheadline or a logotype - you can treat your glyphs (each   \nindividual letter) like you would line-art or illustration. It   \njust requires that you compose them as individual shapes,   \ninstead of using it like a font (with the type tools). But, like   \nChris said, you'll most-likely want Illustrator or Freehand if   \nyou go that route.   \n   \nOf course this is not an ideal long-term solution, but it will   \nsave you having to buy and learn font software. Unless of   \ncourse, you're willing and ready to do that, then don't let   \nme discourage you!\n\n"
    },
    {
      "time": "14 May 2004 — 2:17pm",
      "content": "I do have Illustrator, Photoshop, IR, and other stuff. I want to make a font of my handwriting. Can anybody give step-by-step instructions (or where to find) for how to do this?   \n   \nThanks\n\n"
    }
  ]
}
