{
  "id": "53018",
  "title": "Implausible",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Lemme have it.\n\n| Attachment | Size |\n| --- | --- |\n| [reganjohnson.jpg](http://web.archive.org/web/20150417194215/http:/typophile.com/files/reganjohnson.jpg) | 636.3 KB |\n\n",
  "author": "reganfredjohnson",
  "time": "29 Dec 2008 — 2:55pm",
  "uid": "41076",
  "comments": [
    {
      "time": "29 Dec 2008 — 3:07pm",
      "content": "Brilliant idea, well-executed. I'd start the 'V' the same way you do the 'W' and 'Y'. It feels like it's facing the wrong way.\n\n"
    },
    {
      "time": "29 Dec 2008 — 6:15pm",
      "content": "I think V is meant to look that way --- like the ryte half of W. Anyway there is no ryte way or orientation for elements in this font as it defies the rules of perspective and three dimensions.\n\nRegan—helo and welcome to Typophile. This type design looks to be in the spirit of Roger Penrose's impossible triangle, Moebius strips, M.C. Escher et al.\n\nj a m e s\n\n"
    },
    {
      "time": "30 Dec 2008 — 5:55am",
      "content": "Stephen is right: brilliant and well-executed. You did a great job designing this with letterforms that feel totally contemporary!\n\n"
    },
    {
      "time": "31 Dec 2008 — 8:23am",
      "content": "I am digging this! I also have a client for whom I've been looking for something like this. So, please finish it ;-) I'd buy it.\n\n"
    },
    {
      "time": "31 Dec 2008 — 3:56pm",
      "content": "Dang Reg, someone's been productive over the break.\n\n"
    },
    {
      "time": "31 Dec 2008 — 4:56pm",
      "content": "This is cool. That 8 is blowing my mind.\n\nI'd enlarge the period (and dot of exclamation/question marks).\n\nOf the glyphs that lose the \"dimensionality\" on some horizontal parts (ESZ25), I think the 5 crossbar misses it most - but shortening it might be all it really needs.\n\n4's trunk looks too stubby, and 2 seems to be falling rightwards.\n\n"
    },
    {
      "time": "1 Jan 2009 — 3:23pm",
      "content": "Looks excellent. I do think the characters that miss some of the dimensionality need to have it too (ESZ25). I could try to explain how you could fix them, but I'm quite sure you know how to do that yourself. :)\n\n"
    },
    {
      "time": "14 Jan 2009 — 1:27pm",
      "content": "This is really funky. You could even do a shaded version to overlay? I love that K!  \nIt reminds me of a childhood book, [Adventures with Impossible Figures](http://web.archive.org/web/20150417194215/http:/www.amazon.com/Adventures-Impossible-Figures-Bruno-Ernst/dp/0906212545).  \nIn a way it is difficult to critique this as it plays tricks on my eyes.  \nSo this is to do with the underlying shapes: I think J could be narrower, and the top bowl of B and R smaller. Y should be wider.  \nAnd i think the 3-d needs to be resolved slightly on N, S, and B.  \nHope that's helpful! It's pretty good in every way. Are you going to do lowercase? (Not that it needs lowercase)\n\n"
    },
    {
      "time": "3 Feb 2009 — 7:49am",
      "content": "Wow, I didn't even see the multi-direction feel until I looked at the \"6\"!! This is great, I love it. It reads so well, but then it has some spunk. I'd buy it too, please finish and let us know where to buy it! :)\n\ncourtney\n\n"
    },
    {
      "time": "15 Feb 2009 — 8:32am",
      "content": "Very impressive! Feels fresh and modern. Some thoughts: I reckon the ! could stand to be a touch taller; not sure about the crossbar on the 5; think J is a little wide and Y a little narrow.\n\n"
    },
    {
      "time": "20 Feb 2009 — 4:39am",
      "content": "Great concept! Now, where (somewhere here) did I see that five-legged elephant that would go so well with this?\n\n"
    },
    {
      "time": "20 Feb 2009 — 7:16am",
      "content": " ![](http://web.archive.org/web/20150417194215im_/http:/typophile.com/files/pic014%20(Custom)_6718.jpg)\n\n"
    },
    {
      "time": "24 Feb 2009 — 2:32pm",
      "content": "Yes, you could include a set of impossible dingbats as ornaments in the font!\n\n"
    },
    {
      "time": "3 Mar 2009 — 7:21pm",
      "content": "[http://www.typophile.com/node/28413](http://web.archive.org/web/20150417194215/http:/www.typophile.com/node/28413 \"http://www.typophile.com/node/28413\")\n\n—  \nCarlos Fabián Camargo G.\n\n"
    }
  ]
}
