{
  "id": "53023",
  "title": "Do you set text to the baseline GRiD?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Wanted to ask what most of you may do with setting your text in large documents, do you set your paragraph styles with text to stick to baseline grid then space your baseline grid instead of the leading?\n\n",
  "author": "Monsta",
  "time": "29 Dec 2008 — 4:37pm",
  "uid": "34545",
  "comments": [
    {
      "time": "29 Dec 2008 — 6:21pm",
      "content": "No.\n\n"
    },
    {
      "time": "29 Dec 2008 — 7:15pm",
      "content": "Yes, when I work on large, multi-page documents, I use the baseline grid feature and create my style sheets accordingly.\n\n"
    },
    {
      "time": "29 Dec 2008 — 7:30pm",
      "content": "Yes, specially in large documents like books. You can make your paragraph style align to the baseline, and edit the baseline grid offset later if you want.\n\n"
    },
    {
      "time": "29 Dec 2008 — 7:29pm",
      "content": "I have just started to do it, I thought it use to be a bodgey way to do it but it does work out alright. It was a bit tricky sometimes not to have so much space in between paragraphs\n\n"
    },
    {
      "time": "29 Dec 2008 — 9:13pm",
      "content": "I always use the baseline grid when setting large bodies of text (even in brochures). I usually use a divisor of the primary body text leading as the measure for the grid, which helps with the paragraph spacing, but still keeps things aligned nicely.\n\n"
    },
    {
      "time": "30 Dec 2008 — 1:14am",
      "content": "Im using 10/14pt for body and have 7pt spacing for the grid\n\n"
    },
    {
      "time": "30 Dec 2008 — 6:45am",
      "content": "I always use sticky baselines AND I always use baselineshift to compensate for bad distribution of space (esp with subpars). Go figure…\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "30 Dec 2008 — 8:11am",
      "content": "Yes, I do use a baseline grid. Often, I find myself using a baseline grid that is an increment of the leading that I want to use.\n\n"
    },
    {
      "time": "30 Dec 2008 — 10:40am",
      "content": "I generally rely on a baseline grid that is equal to the basal text leading (or sometimes one-half) and feel that this is usually a very useful reference to aid the underlying harmony in a complex design.\n\nHowever, I \\*never\\* use the Align to Baseline feature. I feel this is far too Procrustean and makes it inconvenient to work with syncopated rhythms. When I'm designing a book with many elements and many levels of text, simple ratios like 1:2 are not always enough.\n\nI have other techniques that I've developed for maintaining absolute precision with a baseline grid, while still offering plenty of flexibility.\n\nI happen to think the Align to Baseline feature is superfluous, and in some cases enables sloppy work habits and lazy design thinking (not a personal criticism of anybody in particular, just my general opinion about the feature).\n\n-- Kent.\n\n"
    },
    {
      "time": "30 Dec 2008 — 11:41am",
      "content": "Kent, can you be more specific as to which sloppy work habits you're referring to? I find that a baseline grid forces designers into \\*good\\* design habits like carefully considering space between paragraphs and heads, or paying attention to horizontal alignments between columns.\n\nIn many-paged documents, if I can, I like to use a baseline grid that is 1/2 or even 1/3 of my body leading. I try not to baseline-shift except for special cases like heads. Then I make sure to set leading, space-before, space-after, etc. to multiples of the grid increment.\n\n"
    },
    {
      "time": "30 Dec 2008 — 12:27pm",
      "content": "Thanks for sharing your thoughts on this, Kent.\n\n"
    },
    {
      "time": "30 Dec 2008 — 2:09pm",
      "content": "In The Elements of Typographic Style: by Robert Bringhurst he talks of setting up your text without using align to baseline grid feature and gives an example of how to align all text to share the same baseline as well as in the Indesign CS3 book by David Blatner he mentions it too.\n\n"
    },
    {
      "time": "30 Dec 2008 — 2:37pm",
      "content": "You want an even longer answer from Kent? Perhaps he wishes he never started . . .\n\nHere is an experiment. Get a copy of <cite>Art of the Printed Book, 1455-1955</cite>, by Joseph Blumenthal (printed by Godine). Take whatever design manual you favor as having the best \"design rules,\" and go through the books Blumanthal has selected. Likely, according to the set of design rules you followed, most of the books are poorly designed and set. Yet most <cite>are</cite> works of art, and belong. In fact, they are still fairly easy for a modern audience to read, assuming you know the language. Why is that?\n\nLong texts are to be read. That is the designer/compositor's primary job, facilitating reading. Snapping copy to a baseline grid doesn't much facilitate this, in spite of what some might tell you. Pleasing spatial arrangements are more complex.\n\n"
    },
    {
      "time": "30 Dec 2008 — 4:47pm",
      "content": "\"Snapping copy to a baseline grid doesn’t much facilitate this, in spite of what some might tell you. Pleasing spatial arrangements are more complex.\"\n\nI can agree with you on that, sometimes the rules dont work in full favor, though you need to be educated when to use or disregarded the rules : )\n\n"
    },
    {
      "time": "30 Dec 2008 — 9:25pm",
      "content": "Like some have suggested, I do use the baseline grid and I set it to 1/2, 1/3 or 1/4 of the body leading. It depends on many things: type, size, page dimensions, column width, what other kinds of information I'm trying to allow for. I don't regularly do book settings, but have set 100-200 pages a few times and found it useful -- even in shorter 8-20 pagers its helpful if you get used to it.\n\n"
    },
    {
      "time": "31 Dec 2008 — 2:36am",
      "content": "I too use the snap to baseline grid features, usually with the grid set to half the leading of the body copy, for body copy and often for subheads and captions, but not always for heads, by universally adjusting the space before and space after on them you can achieve pleasing spatial arrangements for simpler setting. Some books, through their matter, call for each page (or each type of page) to be set page by page.\n\nTim\n\n"
    },
    {
      "time": "31 Dec 2008 — 5:56am",
      "content": "The truth of the matter lies somewhere between never snapping to the grid and using this feature without any thought. Like Kent, I never use it. However, I have received files from designers who do use the feature. But as I have worked with these files, I have seen the designers have also used what pica pusher has called \"\\*good\\* design habits like carefully considering space between paragraphs and heads, or paying attention to horizontal alignments between columns.\"\n\nIf one does pay this close attention to detail, there should be no need to use the snap to grid. Perhaps the designers used the snap as insurance.\n\nRE Charles' comment about the Blumenthal book: I'm the guy who did the page composition on that book. I know that if one examined Blumenthal's book as well as the books discussed therein, one would find plenty of divergence from the book's supposed grid. I had to do that to get things to fit and to look good. I did try to start all the shoulder heads on the baseline of the adjacent text. One of the most valuable tricks I learned as an apprentice comp was how and when to \"cheat\" certain spacings in order to achieve other pleasing spatial arrangements. This lesson came not from a design classroom nor from a textbook, but from a skilled journeyman.\n\npowers\n\n"
    },
    {
      "time": "31 Dec 2008 — 5:59am",
      "content": "<cite> &gt; Kent, can you be more specific as to which sloppy work habits you’re referring to? </cite>\n\nTo clarify: It's the use of the Align to Baseline Grid feature (sometimes referred to as \"sticky baseline\" or \"snap to baseline\") that I think leads to sloppy work habits -- an inattentive designer can end up with several elements all specified with a mish-mash of leadings, paying no attention to relationships, and then all of them will magically snap to a grid: the results may look clean, but the work habits are sloppy.\n\n(Believe me, I've had to come in and revise documents done this way -- you can't trust the readout of leading values, because the program isn't using them if it's snapping to a grid; the stylesheets are usually a mess, because there's little consequence to overriding everything, or no motivation to update and clean them up, etc.)\n\nAs you say, working with a baseline grid (but not necessarily \"snapping\" everything to it automatically) can encourage more attentive design, by highlighting alignments and relationships. To be clear: it's the \"snapping\" feature that I find problematic.\n\nWith regard to my \"lazy design thinking\" comment, this goes along with what Charles was getting at. Over-reliance on a baseline grid (especially \"snap to\") promotes a cookie-cutter approach.\n\nSometimes, you have to turn the grid off and use your eyes. Just because it's on the grid, doesn't make it right.\n\nAs Charles so eloquently put it, \"pleasing spatial arrangements are more complex.\" I like that.\n\n-- K.\n\n(Long enough for you ;-)\n\n"
    },
    {
      "time": "31 Dec 2008 — 7:09am",
      "content": "Yes where i work at all we use is the grid layout. it makes all of our work more uniform and cleaner. every now and then you need to break the grid with some text. I love the way it makes all my work look.\n\n"
    },
    {
      "time": "31 Dec 2008 — 10:13am",
      "content": "Ditto Kent's comments on the snapping feature. I always respecify the baseline grid to the text leading I'm using for a book, but it is just there to aid the eye. With InDesign, I spend at least half the time working with it turned off.\n\nPerhaps we can sum it up this way: It is a tool, and like any tool, under some circumstances can aid (speed) production, but used without thought, can \"foul\" [things] up beyond all repair.\n\nFair enough?\n\n(& unending kudo's to Will for the Blumenthal. It is the best manual I have.)\n\n"
    },
    {
      "time": "31 Dec 2008 — 6:12pm",
      "content": "I used the music/rythm paralell in an earlier post on the same topic. I think it is relevant here as well: Music composed on a computer, with every detail snapped to the \"rythm grid\" gives a robotic, mechanical and cold impression. The human factor – a little unperfection – makes for a much more lively composition.\n\n"
    },
    {
      "time": "1 Jan 2009 — 3:44pm",
      "content": "I use Align to Baseline Grid 9 out of 10 times. Mostly to make sure that lines align on two opposite pages, and don't shift for whatever reason. But it depends on what kind of project I'm working on. I design alot of poetrybooks, and for those Align to Baseline Grid is ideal.\n\n"
    }
  ]
}
