{
  "id": "5303",
  "title": "Chunky Book-Faces.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So what's the story on the chunky book-face phenomenon of late? I'm noticing more and more faces that abandon the perfect symmetry that seems to have become the standard (like 'Loreto' [[http://www.typophile.com/forums/messages/29/loreto\\_post1-34991.pdf](http://web.archive.org/web/20131019004114/http:/www.typophile.com/forums/messages/29/loreto_post1-34991.pdf) ], and 'Quetzal' [[http://www.typophile.com/forums/messages/29/6757.html?1077083089](http://web.archive.org/web/20131019004114/http:/www.typophile.com/forums/messages/29/6757.html?1077083089) ]).   \n   \nWhat's the theory, that obviously jointed contours and asymmetry mimic the imperfections that ink can lay on paper even when the typeface is near-perfect in its symmetry? (Seems like a good-enough reason.)   \n   \nI'll revert to my Lamarckian views on letterform recognition for a moment... Have people gotten used to the [accidental, or at least naturally occuring] roughness of letterforms? And could it be that now they accept these types of contours as the norm and crave them?\n\n",
  "author": "A. Scott Britton",
  "time": "21 Jun 2004 — 11:07am",
  "uid": "3373",
  "comments": [
    {
      "time": "21 Jun 2004 — 1:31pm",
      "content": "A.   \n   \nI suspect it has more to do with fish breath and beer drinking than anything else. Seems popular with the young uns.   \n   \n [http://lanstontype.com/Pabst.html](http://web.archive.org/web/20131019004114/http:/lanstontype.com/Pabst.html)\n\n"
    },
    {
      "time": "21 Jun 2004 — 2:27pm",
      "content": "Gerald,   \n\\> suspect it has more to do with fish breath and beer drinking than anything else.\\<   \n   \nYou may not be aware but there is a very bad American beer (I drank it in my youth) called \"Pabst Blue Ribbon\". Your font looks nothing like it, you will be happy to know :-)   \n   \nChrisL\n\n"
    },
    {
      "time": "21 Jun 2004 — 6:51pm",
      "content": "Hmm, my dictionary says that 'chunk' is a 'thick piece' or a 'corpulent animal'.   \nSo, I guess 'chunky' typefaces are more about weight and proportions, not asymmetry and roughness. Also, I see that most 'chunky' faces have wedge serifs.   \n   \nPersonally, I think some of these 'chunky' typefaces are too dark. That's my only complaint about them. Of course, some fonts like digital Electra, are too light. But Avance, on the other hand, it's too dark (serifs are too big).   \nSmeijers' typefaces (Quadraat, Renard, Arnhem) are well-balanced, I think (I've read books set in Renard and Arnhem FWIW). He usually makes thick stems but the serifs aren't so big or heavy.   \n   \nThis is a interesting topic. I'd like to hear more opinions.\n\n"
    },
    {
      "time": "21 Jun 2004 — 6:52pm",
      "content": "Here is the lable Gerald:   \n ![Pabst Blue ribbon](http://web.archive.org/web/20131019004114im_/http:/www.typophile.com/forums/messages/30/38901.gif)\n\n"
    },
    {
      "time": "21 Jun 2004 — 9:06pm",
      "content": "Chris,   \n   \nMaybe in this case it would be \"pepperoni breath\" and beer. Looks like a sausage label.\n\n"
    },
    {
      "time": "22 Jun 2004 — 2:24am",
      "content": "By 'chunky', are we meaning that Dwiggins-y thing where what should be a curve becomes a vertex? Like [Prensa](http://web.archive.org/web/20131019004114/http:/www.fontbureau.com/fonts/font_frames.tpl?cart=10878958366508148&fontname=Prensa) for example?   \n   \nThis is related to what Hrant has been calling the Fauve style, yes? Derived equally from Dwiggins and Czech modernist faces?   \n   \nI really like all this stuff -- it seems to me to point toward a real possibility for freshness in book setting. I'd like to know more about where it's coming from, too, and to see some more of these great [Czech faces](http://web.archive.org/web/20131019004114/http:/just.letterror.com/ltrwiki/AlessandroColizzi_2fAfstudeerProject).   \n   \n(nb this article also references Dwiggins -- haven't had time to read it this morning; maybe some clues here?)   \n   \nR\n\n"
    },
    {
      "time": "22 Jun 2004 — 3:46am",
      "content": "I think it's a reaction to perfectionism in computer technology, printing and paper. I feel that a lot of people want to see the \"human hand\" in stuff. It makes the stuff look more \"unique\".\n\n"
    },
    {
      "time": "22 Jun 2004 — 4:33am",
      "content": "_\\>You may not be aware but there is a very bad American beer (I drank it in my youth) called \"Pabst Blue Ribbon\". Your font looks nothing like it, you will be happy to know :-)_    \n   \nChris -- I'm sure Gerald's comment was not a mere coincidence. Goudy's Pabst Oldstyle typeface was in fact originally based on lettering that he did for advertisements for the Pabst Brewing Company in the late 1890s or early 1900s. Goudy was later asked to develop a typeface based on this lettering style, which was eventually cut and cast by ATF in 1902.   \n   \n-- K.\n\n"
    },
    {
      "time": "22 Jun 2004 — 6:33am",
      "content": "Funny you should write in, Kent--I almost included Whitman in my list of examples (because, and forgive me if I'm wrong at all, it seems some glyphs have what I at first called \"chunky\" features. I'll now call them \"clunky\" [but this is not at all bad, as the dictionary may imply]).   \n   \nI apologize for using chunky, Eduardo. For me, the word has come to imply more than just thickness and weight; it now alludes to objects that are chunk-like in their appearance (tear off a chunk of something and look at the break, it's not clean, but \"chunk-like\").   \n   \nThe interior contour of lowercase 'h' in Kent Lew's Whitman is \"chunk-like\" in its appearance.\n\n"
    },
    {
      "time": "22 Jun 2004 — 7:16am",
      "content": "Oh, thanks for clarifying the meaning of 'chunky'.\n\n"
    },
    {
      "time": "22 Jun 2004 — 8:01am",
      "content": "I believe that maybe the \"clunkiness\" you refer to is an attempt to add life to digital type. Some think digital types are overly homogenized and monotonous--especially compared to the subtle varieties in a letterpressed page. Whitman is surprisingly simple (in some ways) and angular at larger sizes, but at text sizes the angles blend with the curves and it becomes a very readable font. This is true of the roman and italic.   \n   \nI think Scala and Tyfa may fall into this category as well. (was Tyfa first designed for letterpress?)   \n   \nAlso, I know I've at least read about it on Typophile, the Dwiggins experimental newspaper font (which is mentioned on the Quetzal post and in Mr. Johnson's Czech link above) does have these qualities. I have a Fine Print issue with a sample, I'll have to post it when I get a chance. Again, at small sizes, these features become more subliminal, right?\n\n"
    },
    {
      "time": "22 Jun 2004 — 8:04am",
      "content": "Kent,   \n   \nI assumed Chris knew Goudy designed Pabst Col. Fred Pabst of Pabst Brewing Company.   \n   \nOn the other hand many others would not.   \n   \nBut Kent, I am having trouble with the essence of the question in this thread. I have developed a theory but am not sure it applies in this case.   \n   \nFor instance, would they call this chunky? [http://lanstontype.com/Jenson.html](http://web.archive.org/web/20131019004114/http:/lanstontype.com/Jenson.html)   \n   \nOr Pabst. Pabst is obviously a less serious face, meaning it is for display, where Jenson could be both. But there has been mention of false inking. For me Pabst is somewhat playful on \"false inking\", as if Goudy was making fun of bad presswork. Although, as we know it probably has nothing to do with that, Goudy cut it in hot metal. It is merely playful, nothing serious, nothing that would sound the drums from the \"inkist camp\". They would blush to use Pabst as an example. After all it makes them look ridiculous.   \n   \nAlso I get confused when anyone speaks of \"too bold\", or \"too light\". Non of this makes sense unless in context of a specific use. Some faces simply are light, or are bold. Using the word \"too\" would have value in historical work, in other words if a face was light and the revival was much darker, you could consider it \"too bold\". Otherwise it really does not have \"too\" much meaning.   \n   \nOr does it? Which is where my theory may apply.\n\n"
    },
    {
      "time": "22 Jun 2004 — 9:04am",
      "content": "This \"digital type\" theory is old news. Sturdy (as opposed to Chunky\") typefaces such as Scala and Charter were produced in the early days of digital, to deal with the exigencies of the new process, in particular 300 dpi laser printers. Adobe Garamond also addressed the issue.   \n   \nA similar problem existed in the phototype era: the hairlines of types such as Galliard and ITC Garamond were prone to disappear during the production process.   \n   \nYou can even go back to the early 20th century, and look at the problem printers had with using the same font on both uncoated and coated paper (where fine details were hard to keep right in big print runs) -- and the need for convergence in that era produced the uber-chunky Cheltenham.   \n   \nSo, this is an ongoing technical engagement with \"druk\".   \n   \nDigitally, we have been through the rough early days, emerging into digital mastery -- with extreme high-res typography (admittedly, planar lithography can never achieve the palpability of letterpress, or the density of toner, but its resolution is superior).   \n   \nSo, I would say that the present vogue for chunky type, if there is such a trend, is a reaction against the recent high-res phenomenon of typographers spec'ing tiny, ultra-light/ultra-fine type on smooth coated stock, a communal indulgence to \"push it\" to a limit that was previously unattainable.\n\n"
    },
    {
      "time": "22 Jun 2004 — 9:53am",
      "content": "Nick,   \n   \n\"This \"digital type\" theory is old news.\"   \n   \nNot my theory.\n\n"
    },
    {
      "time": "22 Jun 2004 — 12:40pm",
      "content": "\\>Not my theory.   \n   \nNo, not your theory.   \nWhat is your theory?\n\n"
    },
    {
      "time": "22 Jun 2004 — 1:11pm",
      "content": "Nick,   \n   \nI didn't think of types like Charter, and Oranda as well, being built to withstand typical laser printing. But I guess I'm referring to the more crisp, geometric quality some of these types have (I may be missing the point of this thread entirely). Adobe Warnock is another example of what I'm thinking of--sharp angles and points mixed with curves as opposed to a type with no straight lines such as Hoefler Text or your own Walburn. I suppose it may still be just a trend...   \n   \n-Addison\n\n"
    },
    {
      "time": "22 Jun 2004 — 2:15pm",
      "content": "Nick.   \n   \nCheltenham was a \"retro-fashion statement\", not a \"production solution\". Don't become a victim of \"cognitive dissonance\". There is reason I pointed to\n\n"
    },
    {
      "time": "22 Jun 2004 — 5:45pm",
      "content": "Gerald is one of the funniest people around here. I can always depend on him for the days best laugh.   \n   \n\\>Maybe in this case it would be \"pepperoni breath\" and beer. Looks like a sausage label.\\<   \nI assume Gerald is referring to the meatpacking factories in that part of Wisconsin. The factory workers (meat packers) were the Milwaukee beer maker's best customers. The Green Bay Packers football team was named in honor of them too.   \nI believe that many more were of German decent than Italian so it was probably \"Bratwurst and Beer Breath\" after all :-)   \n   \n\\>I assumed Chris knew Goudy designed Pabst Col. Fred Pabst of Pabst Brewing Company. \\<   \nI\n\n"
    },
    {
      "time": "22 Jun 2004 — 7:18pm",
      "content": "![chelt](http://web.archive.org/web/20131019004114im_/http:/www.typophile.com/forums/messages/30/39015.jpg)   \n   \n\\>Cheltenham was a \"retro-fashion statement\", not a \"production solution\".   \n   \nCheltenham was too innovative a design to be retro. On reflection, perhaps I overstated by saying that the need for convergence (one typeface for many printing situations) produced its design: rather, convergence made it hugely popular, because with its sturdiness it would hold up under abuse, and yet with its precisely drawn features, it had a neatness that worked in many different media, and sizes right up to display.   \n   \nYes, its chunkyness gave it appeal to the \"Arts and Crafts\" set, but its appeal was more widespread than that, and in fact it co-existed with the major trend of expressively rendered retro faces of the early 20thC, typified by Goudy's work, Kennerley, Garamont, Goudy Old Style, etc.   \n   \nUltimately, I agree with you on cognitive dissonance -- the best designs are created intuitively, and we seek to rationalize them afterwards. That is the case with Cheltenham, which exists on its own terms.   \n   \nIn this sample, taken from an ad in \"New Idea\" women's magazine, September 1905, you can see that display-size Cheltenham has a mechanically drafted precision quite at odds with the Arts & Crafts ideal. At text size, its heft holds up against the rule at right (about 2 pt.).\n\n"
    },
    {
      "time": "22 Jun 2004 — 10:24pm",
      "content": "Cheltenham I dislike a lot, it seems to me one of the ugliest typefaces ever, why is it so popular? It looks like if it was drawn so naively, it has no balance.\n\n"
    },
    {
      "time": "22 Jun 2004 — 11:18pm",
      "content": "Nick,   \n   \nI hope you don't think I am picking on you. I am attempting to share something with you.   \n   \nTo do that I must point out that when you say . . .   \n..._\"you can see that display-size Cheltenham has a mechanically drafted precision quite at odds with the Arts & Crafts ideal.'_   \n   \nIt is plain as the nose of Michael Jacksons' face that you kids got lots to learn.\n\n"
    },
    {
      "time": "22 Jun 2004 — 11:31pm",
      "content": "Here is the \"h\" I left out of the \"where\". Got some tweezers?\n\n"
    },
    {
      "time": "22 Jun 2004 — 11:57pm",
      "content": "OK Nick,   \n   \nI heard you laughing at my typo. Now I am going for the jugular.   \n   \n**This weasel dies**   \n   \n_Yes, its chunkyness gave it appeal to the \"Arts and Crafts\" set, but its appeal was more widespread than that, and in fact it co-existed with the major trend of expressively rendered retro faces of the early 20thC, typified by Goudy's work, Kennerley, Garamont, Goudy Old Style, etc._\n\n"
    },
    {
      "time": "23 Jun 2004 — 6:48am",
      "content": "I'm going to try to respond to what I think the original point was meant to get at. I think the terms \"chunky,\" \"clunky,\" and even Nick's \"sturdy\" are misleading. They imply a quality of weight and a stubbiness that, while often present in some of the examples cited, is not necessarily inherent in the kind of unexpected geometry that I think is the primary characteristic.   \n   \nI think that what A. Scott was referring to is what I have called a \"digital vernacular\" -- a quality of simplified and often unexpected geometry being applied in otherwise traditional forms. From my perspective this trend traces back through faces like Downer's Vendetta (1997) and Majoor's Scala (1991) to van Blokland's Proforma (1988) and Carter's Charter (1987) and ultimately to Unger's Swift (1985). Pre-digital influences include Dwiggins's experiments on the one hand and the Czech \"school\" (Menhart, Preissig foremost, Tyfa also) on the other.   \n   \nIt strikes me that there are two threads of motivation in these precedents -- one technical and the other aesthetic. The early digital faces I cited were, as Nick pointed out, to a large extent confronting technical constraints, and their simplified geometry comes from efforts to create robustness in the face of coarse resolutions, as well as to conserve memory. The character that comes through is influenced strongly by the problems set before the designers.   \n   \nThe other thread is an aesthetic one. The Czech designers were essentially operating within the general \"expressionist\" zeitgeist. The willfully coarse finish of Menhart and Preissig comes from a desire to infuse energy into traditional letterforms while at the same time stripping them of any excess typographic baggage.   \n   \nDwiggins, in his own way, was also motivated primarily by aesthetic concerns. His experiments in what he called the \"M-formula\" were foremost an attempt to infuse a certain \"snap\" and \"action\" to the letterforms. His newsface efforts also professed to combat certain optical/technical constraints as well. But I think primarily he was exploring a type aesthetic that was influenced by his own cultural milieu -- Art Deco and Cubism, among others. This aesthetic is seen more overtly in his stencilled ornament and illustration.   \n   \nNowadays, the technical constraints facing Unger and Carter are largely overcome (at least in print), and yet Swift and Charter still seem fresh and vital. The continued exploration of this formal territory in contemporary designs seems primarily for aesthetic effect.   \n   \nSpeaking for myself, there is a fascination with taking seemingly inexpressive, reductive elements -- straight lines and simple curve segments -- and carefully combining them to create an unexpected grace or an organic tension. The yin/yang of the geometric vs. the organic is an ages-old formal dichotomy that can be found interspersed throughout the history of visual culture. The trend that we see in some contemporary type designs is just another expression of that exploration.   \n   \nI use the term \"digital vernacular\" because this kind of expression seems to embody an inherently digital aesthetic: there is a sense of \"truth to the material\" that is appealing. I say _\"seems to\"_ because strictly speaking, of course, this isn't true at all -- there is nothing about beziers that lends them more to straight lines or simple curves; in fact, the wonderful inventiveness of bezier curves is exactly the opposite, that they can be so complex and supple.   \n   \nSimilarly, there is nothing inherent in the woodcut medium that demands the rough, coarse cuts of the Expressionist work of Kirchner as opposed to the fine detail of engravings by Bewick, for example. And yet the raw woodcuts seem to evince a greater \"truth to the material.\" [But now, I've wandered far afield.]   \n   \nAnyway, those are some of my reflections on the matter.   \n   \n-- K.\n\n"
    },
    {
      "time": "23 Jun 2004 — 7:03am",
      "content": "I agree (ack) with Gerald G. about Cheltenham being redolent of the arts & crafts aesthetic - not of the Jenson influence in type, but of the furniture and architecture. The tall, narrow, rectangular look is very much the same.   \n   \nAs to the popularity of Cheltenham, which Hector finds inexplicable, I think it is due to its filling a niche. It is narrow, dark, with tall ascenders and chunky, square serifs. This makes it quite readable at medium size in newspaper ads and article headlines.   \n   \nIt does work well in the New York Times as a titling face for articles. Matthew Carter recently tweaked it for the NYT. It would be interesting to see a comparison of the old and new - maybe he fixed some of the awkwardness that Hector objects to. Part of the awkwardness I suspect is in what also makes it work well in some specific situations: the narrowness, darkness, tall extenders, and chunky serifs.\n\n"
    },
    {
      "time": "23 Jun 2004 — 7:08am",
      "content": "Well put Kent. Incidentally, I think Whitman is really great. You've done something superb in my opinion.\n\n"
    },
    {
      "time": "23 Jun 2004 — 7:17am",
      "content": "\\>taking seemingly inexpressive, reductive elements -- straight lines and simple curve segments -- and carefully combining them to create an unexpected grace or an organic tension.   \n   \nWow. I am also a fan of Whitman - now I understand better why.   \n   \nI think some of the confusion in this thread about 'chunkiness' is that both paths - exploration of the angular/geometric and of heavier weights with sturdier serifs - have been pursued in digital type.\n\n"
    },
    {
      "time": "23 Jun 2004 — 8:20am",
      "content": "I recently used Cheltenham for signage in Eudora Welty's mother's garden--at larger sizes I found it quite graceful, especially the italic. I had to noodle with it more in the printed materials--the spacing and leading were tricky. It is quite different from anything else I've used, it's kind of a \"chubby\" type... How's that?   \n   \nFurther proof of aesthetic features born from technical necessity is Amplitude. The traps aren't needed, but they've become desirable. And Kent, I really am interested by your take on the \"truth in materials\" because it's usually associated with an \"unfinished\" quality (coarse cuts in a wood print, visible strokes in a painting, loose lines in a drawing...). I use the word \"unfinished\" for lack of a better word--I would never call a Van Gogh unfinished. But could this same quality be applied to type?\n\n"
    },
    {
      "time": "23 Jun 2004 — 8:45am",
      "content": "Chiming in with my graphic designer (as opposed to type designer) perspective:   \n   \nI was under the impression that a lot of these newer, sturdier faces were/are a reaction to the anemic digitizing of metal type that used the metal rather than the printed form as the basis for the digital design. These new faces were never metal, so they are designed through-and-through with the final product in mind by type designers who want to achieve the sturdier forms of earlier type. For a while, I didn't like these newer sturdier faces because I held some of the thinner digital versions as the standard of judgement without realizing some of the history. Now I've warmed to them completely and lust after beauties like Whitman.   \n   \nI don't have any scans of old typesetting to back this up with here, but this is my impression. Am I over-simplifying things with this mindset?\n\n"
    },
    {
      "time": "23 Jun 2004 — 10:11am",
      "content": "Gerald, Kent,   \n   \nI have admitted that Cheltenham has Arts & Crafts characteristics, in its heft, and perhaps in its proportions (by \"tall\" I presume you mean a small x-height), but the mechanical qualities of its drafting are at odds with the dominant feature of Arts & Crafts/Revivalist type design of the early 20thC, which is its hand-made quality, which is essentially anti-mass production.   \n   \nCertainly, there were formal qualities in Arts & Crafts era design in architecture and design (such as simplicity and geometric pattern -- eg in Macintosh, Wright), which was proto -Deco, -Modern, and -Moderne, but in graphics, typography and type design the movement was resolutely old-world, and as I said, expressive of the hand in its execution. Again, Goudy's types, and Benton faces such as his Garamond and Cloister, and Cooper's Black -- these are the defining, most used faces of that era, and they bear no trace of the ruler, set square, or compass: Cheltenham is very different from these. And Century.   \n   \nBut enough of Cheltenham. I'd rather discuss the present day. We do tend to lapse into kicking the old chestnuts around, don't we? In the post where I mentioned Cheltenham, I gave equal space to phototype, but no-one wants to talk about that. ITC Garamond is persona non grata!   \n   \nChris, you are right in your observation about \"anemic digitizing\", many type designers (including myself) wrestled with this in the early days of digital type. But \"anemic phototype\" was also a problem -- as an art director in the '70s and '80s, I found that the funkiness of old metal type and hand-lettering (which I saw in old books and magazines) was something sorely missing in the slick smoothness of commercial typography.   \n   \nSo really, this is an endless phenomenon, the battle of art against commercial slickness -- it is what propelled Morris into type design, among others.   \n   \nHector, I agree with you that Cheltenham lacks subtlety in execution. This can be a virtue in a typeface: it will accomodate sloppy printing, and will not embarrass typographers who use it without much skill. There are many faces like this.   \n   \nPersonally (with the precedent and advice of Oz), I have designed typefaces that could have been slicker and smoother, but some judicious awkwardness adds character. But no, I don't like Cheltenham, although I did use it for an ad once, and it worked well.\n\n"
    },
    {
      "time": "23 Jun 2004 — 10:45am",
      "content": "One small thing.   \n   \nThere has been much a-doe about papers, impression ink and the what-nots that affect design. I suggest that the biggest inputs, _(not always positive)_ in type design is not far from the drawing board. The biggest influence on type making is the _\"tools and methods\"_ used by the creator.   \n   \nOriginally type designer, type founder, ink maker, paper maker and printer were one and the same. A most desirable situation\n\n"
    },
    {
      "time": "23 Jun 2004 — 11:05am",
      "content": "Nick,   \n   \nThat is the result of your observation flaw about the \"Arts & Crafts Movement\". Stress the \"Movement\".   \n   \nMorris said, \"keep nothing in your house that is not usable, or that you do not consider beautiful\". He did not dictate beauty. He left room as big as a mansion for other artisans to participate.   \n   \nTake a look at Tiffany glass. Nothing like Stickley furniture.   \n   \nHowever, that said, the biggest defeat to your point is that Goodhue, like it or not, was greatly influenced directly by Morris.   \n   \nRead again\n\n"
    },
    {
      "time": "23 Jun 2004 — 12:31pm",
      "content": "Nick,   \n   \n_Again, Goudy's types, and Benton faces such as his Garamond and Cloister, and Cooper's Black -- these are the defining, most used faces of that era, and they bear no trace of the ruler, set square, or compass: Cheltenham is very different from these. And Century._\n\n"
    },
    {
      "time": "23 Jun 2004 — 12:37pm",
      "content": "Gerald,   \n   \nYou should look at the typeface with your own eyes, rather than through the lens of monolithic, conventional, histories based on fine books. (With which I am well aware, you don't have to \"educate\" me, thank you.) I prefer to look at magazines, by the way.   \n   \nMatt McGrew suggest that there were many contributors to the Cheltenham design, including Goodhue, Kimball, Benton, and Phinney.   \n   \nEven if all these were ardent Morrisonians, with every intention of producing an \"Arts & Crafts\" typeface, does that mean that the finished product will end up worthy of such a pedigree?   \n   \nNo, with original designs (more so than for revivals/copies), things don't always turn out as originally intended. One can set out to produce a work that will have a particular appeal, and people will take to it for a quite different reason.   \n   \nDid these folks consider themselves to be part of an Arts & Crafts movement? had the category even been invented? Were they open to other influences? Of course -- yet history distills and simplifies.   \n   \nYes, the shift was away from the 19th century modern faces, but these persisted well into the 1920s, and other new (in 1890s) faces such as Century built on that Modern tradition. While a revival of that era, it should be pointed out that Bodoni was not an A&C old style.   \n   \nTake a look at Cheltenham. It is novel. It has, as you said, the look of having been drawn with an architect's tools. I agree. And this is my point: it has a structural modernity of finish quite different to the mainstream of \"revival era\" faces, with their expressive, hand-drawn detailing.\n\n"
    },
    {
      "time": "23 Jun 2004 — 1:08pm",
      "content": "I agree wholeheartedly with almost everything Nick just said.   \n   \nFrom my study of them, I am fairly sure that Benton and paricularly Phinney did not particularly consider themselves part of the Arts & Crafts movement per se, but they were both responsible for the mainstreaming and commercializing of it, getting it into the mass media of the time.   \n   \nJ.W. Phinney in particular saw something that was clearly prime for mass-market popularity, and was got ATF to be the first (AFAIK) big foundry to really jump on what would become the bandwagon, directing knockoffs, revivals, and stuff inspired by older models. The part of A&C he saw value in was turning back to historical models for type. The auteur-like private press and careful craftsmanship part of A&C, well, I don't know if that was such a big concern to him. Perhaps it was just irrelevant, insofar as ATF was solely a retail foundry and not really a printer/publisher (its glorious specimen books notwithstanding). So they just made the type, and what folks did with it was up to them. But certainly supplying people who were part of the A&C movement could have been only a tiny part of ATF's sales.   \n   \nBTW, when ATF knocked off Morris, they didn't just do a straight knockoff, but \"fixed\" some of the letters in ways that make me cringe a little. Although the general character is still present, some of the more interesting details have been eliminated. Reminds me a little of ITC's revivals of the 70s.   \n   \nSorry if I'm taking this off topic. The 1880s-1920s has long been my favorite period in type design.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "23 Jun 2004 — 2:10pm",
      "content": "\\>by \"tall\" I presume you mean a small x-height   \n   \nI was referring to the tall ascenders - the descenders are short. And my name is William, not Gerald or Kent. And you didn't address the point that Cheltenham looks like other aspects of the arts and crafts movement - mission furniture and architectural decoration.   \n   \nIt doesn't look like the A&C revivals of old syle types, but this wasn't the whole movement. Goodhue was an architect, so it is not suprising that the look of the furniture and architectural decoration - which regularly use narrow rectangles with heavy square frames - seem to be more the inspiration.\n\n"
    },
    {
      "time": "23 Jun 2004 — 2:24pm",
      "content": "Nick,   \n   \n_Take a look at Cheltenham. It is novel. It has, as you said, the look of having been drawn with an architect's tools. I agree. And this is my point: it has a structural modernity of finish quite different to the mainstream of \"revival era\" faces, with their expressive, hand-drawn detailing._  \n   \nArchitect like tools are not new to this industry Nick. Remember Tory's book on letter design.   \n   \nBut chunkiness is certainly indicative of Golden/Jenson. Unless we are not agreeing on what chunkiness is.   \n   \nCheltenham has the \"look and feel of early \"Arts & Crafts Morris/Roycroftonian\" book faces. Sorry but it does. I am not calling it a revival of letterforms, but look and feel it has.   \n   \nIn fact Morris's Golden, or Jenson is based on \"the work of Nicolas Jenson\". Here is Jenson as revived by the \"Kelmscott Press\". [http://lanstontype.com/Jenson.html](http://web.archive.org/web/20131019004114/http:/lanstontype.com/Jenson.html)   \n   \nBut here is Jenson revived by Bruce Rogers as shown in Metropolitan in 1914. [http://lanstontype.com/Metropolitan.html](http://web.archive.org/web/20131019004114/http:/lanstontype.com/Metropolitan.html)   \n   \nDo you see the difference? Naturally you do, Metropolitan is not chunky. Although still typography, and Bruce Rogers was under the great inspiration of the \"Arts & Crafts\" movement. In particular, note Rogers' work with ornamentation.   \n   \nTake a good look at the two \"Revivals\"   \n   \nNow here is the work of Nicolas Jenson. Morris seems to be the reincarnation of Hrant by \"adding ink on\"   \n   \nShown by the first dark example of the type face. Scroll downwards to black text.   \n   \n [http://histoire.typographie.org/venise/chapitre2.html](http://web.archive.org/web/20131019004114/http:/histoire.typographie.org/venise/chapitre2.html)   \n   \n**Now scroll down and go to this link same page** Here they have used Rogers revival for analyses\n\n"
    },
    {
      "time": "23 Jun 2004 — 2:27pm",
      "content": "\\>Reminds me a little of ITC's revivals of the 70s.\\<   \nDo you mean the \"X-height uber alis\" era? :-)   \n   \n\\>I am fairly sure that Benton and paricularly Phinney did not particularly consider themselves part of the Arts & Crafts movement\\<   \nWe humans in retrospect find it intelectually stimulating to make arguments about in which categories (of our own definition) to place historic figures. I suppose It never mattered much to me in which hole to place a pigeon. We have to remember above all that these were individuals who made wonderful \"individual\" contributions to their field. I can't imagine them getting together one day and setting up the one and true doctrine to which they all would adhere and calling it their collective movement. We \"monday-morning-quarterback\" them into tidy groups long after the fact because this is a much enjoyed intelectual pursuit. They probably were a mix of things like we are today. What we now categorize as movements is just our long away perspective reflected in our need for ordered discourse. Don't get me wrong, this thread is a beautiful thing full of great information and a mirror on the nature of humankind. It is also a lot of fun to read so keep up the good work.   \n   \nChrisL\n\n"
    },
    {
      "time": "23 Jun 2004 — 2:36pm",
      "content": "Thomas,   \n   \n_J.W. Phinney in particular saw something that was clearly prime for mass-market popularity, and was got ATF to be the first (AFAIK) big foundry to really jump on what would become the bandwagon, directing knockoffs, revivals, and stuff inspired by older models.\"_   \n   \nBandwagon is the key word. He may not have considered himself part of the \"Arts & Crafts\" movement, but sorry you are wrong, he was.\n\n"
    },
    {
      "time": "23 Jun 2004 — 2:48pm",
      "content": "Sorry William, no slight intended -- I read a whole bunch of posts (Gerald & Kent's were longest) and didn't check back when I was writing mine.   \n   \n\\>you didn't address the point that Cheltenham looks like other aspects of the arts and crafts movement - mission furniture and architectural decoration.   \n   \nYes I did, but I'll take another stab at it.   \n   \nYou're right to say that Cheltenham has something in common with, and may have been inspired, by the crude craftsmanship of A&C furniture. But one also finds the forms you mention in the engineering and industrial machinery of that era. The G has always struck me as being very nautical, the bottom right feature suggesting a capstan, or the prow of a Dreadnaught.   \n   \nTo me the effect of Cheltenham, and the systematic way it was used in the high tech mass media of the day (see the ad sample in my earlier post), takes it into a completely different realm. And this is what Thomas mentioned too, that the A&C forms were exploited and integrated into a non-craftsman milieu. Really, once the face was developed by a team of foundry engineers such as Morris Benton (wearing lab coats, not smocks, I suspect) for mass production, that's when it stopped being A&C.\n\n"
    },
    {
      "time": "23 Jun 2004 — 3:10pm",
      "content": "BTW, from our Post-modern perspective, it may seem that the A&C movement, preceding 20thC modernism, and harkening back to guild days, was retro. But many aspects of it were forward-looking. Progressive socialism was a feature of the movement. Morris was some kinda feminist, and he and Jane Morris pioneered sensible clothes (especially progressive for women of the time). The holes we put them pigeons in now, are not the same as was around back then.   \n   \nOne sees a similar dichotomy in the origin of the sans, early 19thC -- some would say (me) a feature of early industrial modernism, others (Mosley, the Nymph and the grot), a neo-classical phenom. Why not both, or perhaps of some historical significance yet to be invented?!\n\n"
    },
    {
      "time": "23 Jun 2004 — 3:44pm",
      "content": "\\>crude craftsmanship of A&C furniture   \n   \nI don't this this is quite accurate. Some of it was extremely well made, and looks like new a hundred years later. But they do have a heavy, sometimes even crude look to the designs. The heavy, sturdy, square and simple forms seem to derive from an certain aesthetic: they go for it even at the cost of looking clumsy or ungainly. At its best, in the right setting, it really has charm -like Cheltenham?   \n   \n\\>takes it into a completely different realm   \n   \nGood point. Like mass produced mission furniture, it is no longer in the retro, personal craft realm, which Morris seems to have had as an ideology, if I get it right. It just takes the aesthetic and goes somewhere else with it. From ideology and innovation to style to fad - how many times has that happened!\n\n"
    },
    {
      "time": "23 Jun 2004 — 4:44pm",
      "content": "\\>Your objection is that anything old is bad, making it hard for you to reconstruct and review Goodhue's Cheltenham in a traditional context.   \n   \nGerald, that's not me. I love old stuff. It's just that I think as much as A&C was traditional, it was also really new, modern, and cutting edge at the time, and that's the quality of it that interests me most.   \n   \nIt's also a connection with how this thread started.   \n   \nCould someone post an image of some new chunky book faces (at work, preferably)?\n\n"
    },
    {
      "time": "23 Jun 2004 — 5:27pm",
      "content": "Nick,   \n   \n_I love old stuff. It's just that I think as much as A&C was traditional, it was also really new, modern, and cutting edge at the time, and that's the quality of it that interests me most._   \n   \nThanks Nick, that is probably the nicest thing anyone ever said about me.\n\n"
    },
    {
      "time": "23 Jun 2004 — 7:53pm",
      "content": "Tomas and others.   \n   \nI realize that many do not understand the \"Arts & Crafts Movement\". Some mistaking, obviously, that there was some intended look, rather than, and intended philosophy.   \n   \nThe \"Arts & Crafts Movement\" seems to lead many into thinking that it is about some French painter sitting by the river in Paris foisting off his painting of posies so he can wax his moustache and charm some floosie out of her knickers.   \n   \nWilliam Morris was an \"Art Manufacturer\". This was what the movement was about. It was to improve the state of man, to enrich peoples lives by ornament. To make their homes, their cities, their books, their beds a nicer place for all to live. Never forget that you are speaking of a \"Manufacturing Movement\". William Morris was not a tear jerking, poverty ridden painter, living in a hovel with coal miners from Newcastle.   \n   \nBless their hearts.   \n   \nATF; I am not sure you not aware of all manifestations of that company, all the participants that that company was made up of. It was a conglomerate. Lanston was more precise in its focus. With that in mind I can suggest Linotype was much the same. Lanston was very aware that they were\n\n"
    },
    {
      "time": "23 Jun 2004 — 8:09pm",
      "content": "Goudy,   \n   \n [http://www.pointlessart.com/education/loyalist/typeTalk/alphabet/page4.htm](http://web.archive.org/web/20131019004114/http:/www.pointlessart.com/education/loyalist/typeTalk/alphabet/page4.htm)   \n   \n_This sparked his interest in books, and Frederic soon began a new position at the rare book department, of A.C. McClurg. Here he came into contact with some of the finest editors of the English private presses like Kelmscott, Doves, Erangny and Vale. His passion was born._   \n   \nWho, by the way, taught Dwiggins.   \n   \n [http://www.pointlessart.com/education/loyalist/typeTalk/dwiggins/](http://web.archive.org/web/20131019004114/http:/www.pointlessart.com/education/loyalist/typeTalk/dwiggins/)   \n   \n_Prior to book design, Dwiggins studied art under Frederic W. Goudy at the Frank Holme School in Chicago, then moved to Massachusetts to work with Goudy and his Village Press soon after. During his early career he supplied art to Boston advertisers making use of both his artistic and calligraphic skills. After Goudy's departure to New York, Dwiggins settled in Hingham for the rest of his life, and also maintained a design studio in Boston for a number of years._  \n   \nBoys, you are surrounded by the \"Arts & Crafts Movement\". Put your hands up.\n\n"
    },
    {
      "time": "23 Jun 2004 — 8:23pm",
      "content": "\\>Boys, you are surrounded by the \"Arts & Crafts Movement\". Put your hands up. \\<   \n   \nLOL!!! \"Raise the Roof\" Gerald!!! and thank you all for the passionate lesson, one of the best \"lectures\" I've ever \"heard\"..   \n   \nChrisL\n\n"
    },
    {
      "time": "23 Jun 2004 — 8:24pm",
      "content": "Yup,   \n   \n_On shelves are the 400 books he designed_\n\n"
    },
    {
      "time": "24 Jun 2004 — 9:05am",
      "content": "\\>William Morris was an \"Art Manufacturer\". This was what the movement was about. It was to improve the state of man, to enrich peoples lives by ornament. To make their homes, their cities, their books, their beds a nicer place for all to live.   \n   \nGerald, That's not quite right. The main focus was not, as you say, to give consumers more art-full products.   \nWith an emergent \"Marxist\" understanding of the way industrial civilisation works, it addressed the relationship between art, artefacts, and the means of production.   \n   \nThere were no easy answers. For instance, Morris & Co did not use machine printing of wallpaper in their factory for two reasons: because the quality was poor, and because it alienated the workers. Subsequently he allowed machine printing of some patterns, to produce affordable versions of his designs for the lower classes.   \n   \nAt Roycroft, a hard core commune stuck to its guns. They were the ones who were surrounded.   \n   \nThe broad ideals of the Arts & Crafts movement influenced the socialist structure of the modern state, especially in Northern Europe. But so did the altruism of enlightened industrialists from Wedgwood on.   \n   \nNothing is neat and tidy, everything overlaps.   \n   \nNow, how about some samples of contemporary chunky book faces, please?!\n\n"
    },
    {
      "time": "24 Jun 2004 — 10:36am",
      "content": "Nick,   \n   \n_Morris & Co did not use machine printing of wallpaper in their factory for two reasons: because the quality was poor, and because it alienated the workers. Subsequently he allowed machine printing of some patterns, to produce affordable versions of his designs for the lower classes._   \n   \nYou must be a member of the \"Fabian Society\".   \n   \nThis imaginary contradiction proves my point about \"Art Manufacturing\".   \n   \nRoycrofters books used more paper than their communal paper making department was able to produce. But that's not what they said in their advertising literature. You could call it, \"Marketing the Arts\". Know anything about Dard Hunter? That's one of the reasons he left.   \n   \nAnyway, as I have shown, there is nothing contemporary about chunky book faces.\n\n"
    }
  ]
}
