{
  "id": "53036",
  "title": "New House Industries Website",
  "forum": "Release",
  "tags": [

  ],
  "content": "My apologies in advance if this is a repost, but House Industries just announced a new website via their _Show and Tell_ blog ( [http://www.houseind.com/showandtell/](http://web.archive.org/web/20100203030527/http:/www.houseind.com/showandtell/ \"http://www.houseind.com/showandtell/\")):\n\n<cite>In the spirit of our initial contempt of the world wide waste of time as a delivery medium, we have tried to keep our reliance on third-party plug-ins and other digital trickery to a minimum for this new design. The site is more searchable, easier to use and actually generates simple readable urls.</cite>\n\nI agree. Check it out at [http://www.houseind.com/](http://web.archive.org/web/20100203030527/http:/www.houseind.com/ \"http://www.houseind.com/\")\n\nKen\n\n",
  "author": "<a href=\"/web/20100203030527/http://typophile.com/user/13868\" title=\"View user profile.\">kensoliva</a>",
  "time": "<br>",
  "uid": "13868",
  "comments": [
    {
      "time": "",
      "content": "Handsome and a lot more functional. Me likes.\n\n"
    },
    {
      "time": "",
      "content": "They still don’t show the complete character set.\n\nThere are also some price increases too.\n\nBut the look is much cleaner.\n\nmikey :-)\n\n"
    },
    {
      "time": "",
      "content": "Folks,\n\nThanks for noticing and posting up about the new site design. Also thank you for the kind words. I would like to make a clarification and a comment.\n\nSuperUltraFabulous, we did not have any price increases. We did, however make the following changes to our multiple device licensing structure:\n\n1. Increased number of devices covered under the base licensing fee to ten from six.\n\n2. Got rid of the \"Locations\" restriction on the license. So, the \"devices\" just need to be owned by the same company or \"entity\". We wanted to make it easier for smaller companies and individual designers to properly license our font while making the fees more proportional for bigger companies and organizations.\n\nTo your other point, we agree that we need to show complete character sets. We are working on that now. In the mean time, we are using a newer version of Lettersetter that can preview any glyph in the character set. Thanks to Erik van Blokland and Tal Leming, Lettersetter can also read and preview any OpenType feature in the our fonts.\n\nThanks again for your comments and happy new year!\n\nRegards,\n\nRich Roat\n\n"
    }
  ]
}
