{
  "id": "5305",
  "title": "(x) Nicely curving S and G - Souvenir {Karl, Chesh}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "This is a delightful serif font, the \"G\" especially has a very nice bottom curve, where the vertical part doesn't rest on the bottom line. ![Curvy \"S\" and \"G\"](http://web.archive.org/web/20150427234124im_/http:/www.typophile.com/forums/messages/83/38866.jpg)\n\n",
  "author": "innocentdesignr",
  "time": "21 Jun 2004 — 2:37pm",
  "uid": "2775",
  "comments": [
    {
      "time": "21 Jun 2004 — 2:39pm",
      "content": "[souvenir](http://web.archive.org/web/20150427234124/http:/www.myfonts.com/fonts/linotype/itc-souvenir/)\n\n"
    },
    {
      "time": "21 Jun 2004 — 2:41pm",
      "content": "[Souvenir Demi](http://web.archive.org/web/20150427234124/http:/www.myfonts.com/fonts/linotype/itc-souvenir/demi/testdrive.html?s=LE%2BROFG%2BA%2BSIDING&p=48)\n\n"
    },
    {
      "time": "21 Jun 2004 — 3:03pm",
      "content": "Heh, the seventies are truly gone when Souvenir shows up here.\n\n"
    },
    {
      "time": "21 Jun 2004 — 3:09pm",
      "content": "I never thought I would be able to say this, but Souvenir has become a favorite of mine these days.\n\n"
    },
    {
      "time": "21 Jun 2004 — 5:59pm",
      "content": "I rest my case. :-)\n\n"
    },
    {
      "time": "22 Jun 2004 — 8:22am",
      "content": "Is this the Comic Sans effect? The world can only manage one \"most hated font\" at a time, so Souvenir having been displaced by Vincent's little baby, a full-scale rehabilitation is inevitable?   \n   \n(How long will it be before Comic Sans shows up here? ![:-)](http://web.archive.org/web/20150427234124im_/http:/www.typophile.com/forums/clipart/happy.gif))\n\n"
    },
    {
      "time": "22 Jun 2004 — 9:24am",
      "content": "I'm not surprised to see fonts like Souvenir showing up in design today, nor am I surprised to find it here. Souvenir's increased use reflects a break from the ubiquitous technology inspired design that so proliferated during the last five or seven years. I find the homeliness of Souvenir slightly charming when compared against the sea of techno-industrial Lineto, Test Pilot Collective, and T26 fonts.   \n   \nHad I lived through the 70s, I imagine I might feel differently about the issue. ![:-)](http://web.archive.org/web/20150427234124im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nMy 2\n\n"
    },
    {
      "time": "22 Jun 2004 — 10:54am",
      "content": "I think Souvenir was a well-designed font with a strong flavor. But it got so popular for a while that designers just got tired of looking at it. Now that you don't see it so much anymore, I can see it making a comeback, but it will probably never be as big as it once was (at least as long as boomers are around).   \n   \nIt's funny that you mention \"technology inspired design.\" Souvenir, which was originally released as a foundry face in the 1920s but never caught on, was revived in the 1970s because it held up well on phototypesetting equipment, which tended to soften corners and such.\n\n"
    },
    {
      "time": "22 Jun 2004 — 11:19am",
      "content": "After being so familiar with Souvenir for so many years, I was surprised to hear about Souvenir Gothic, which was forced on me by a client (I will forever be sorry I showed her MyFonts). Though Souvenir Gothic -- not designed by Benton/Benguiat, by the way -- has the debatable advantage of not currently being in use by anyone else (as far as I know), I think I would have preferred plain old Souvenir.   \n   \nAnd hey, if Souvenir is making a comeback, can we make some room also for Serif Gothic? That was my favorite as a 12-year-old, so it still has a special place in my heart.\n\n"
    }
  ]
}
