{
  "id": "53082",
  "title": "Obama/Cigarettes",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Almost any store that sells cigarettes on the eastern seaboard has elements from this campaign for Camel up right now. Is this shameless capitalization or am I reading too much into this?\n\n ![](http://web.archive.org/web/20110703012814im_/http:/typophile.com/files/386px-Camel_crush_steal_4846.jpg)\n\n ![](http://web.archive.org/web/20110703012814im_/http:/typophile.com/files/obama-change_4211.jpg)\n\nAnd these ads are <cite>ubiquitous</cite> right now.\n\n",
  "author": "<a href=\"/web/20110703012814/http://typophile.com/user/16884\" title=\"View user profile.\">Ehague</a>",
  "time": "<br>",
  "uid": "16884",
  "comments": [
    {
      "time": "",
      "content": "_Almost any store that sells cigarettes on the eastern seaboard has elements from this campaign for Camel up right now. Is this shameless capitalization or am I reading too much into this?_\n\nIt's an exploitation ad campain.\n\nIt's getting harder and harder to believe Obama can change America.\n\n\\*Americans\\* must change America.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "What struck me about the poster was the wording and image. Camel used to have a bit of a reputation for subliminal ads. That could be hype, but the \"squeeze, click\" combined with that image seems more gun like than a cigarette.\n\n"
    },
    {
      "time": "",
      "content": "We are getting ads from car dealers here using \"yes, we can\". It makes me want to puke.\n\nSharon\n\n"
    },
    {
      "time": "",
      "content": "This is one of the classier knockoffs I’ve seen. At least Camel licensed Gotham instead of just using Gill or Avenir.\n\n"
    },
    {
      "time": "",
      "content": "I wish there was a \"green\" message and the extra device in the tobacco was meant to protect others from the second hand smoke in some way–then I could forgive them slightly. But nope, it's just a cheesy menthol option.\n\nMaybe they're trying to taunt Obama since he used to have a smoking habit.\n\n"
    },
    {
      "time": "",
      "content": "\\>Camel used to have a bit of a reputation for subliminal ads.\n\nYou see a gun? I see something else long and hose-like, squirting out fluid. Which ties in to the guy with the erection in the camel on the original pack.\n\nObama hasn't quite quit his smoking habit as I understand it. Menthol cigs are generally aimed at African-Americans. It's not such a stretch.\n\n"
    },
    {
      "time": "",
      "content": "apparently he still does burn a few each day:\n\n[http://news.yahoo.com/s/nm/20081207/pl\\_nm/us\\_usa\\_obama\\_smoking\\_3](http://web.archive.org/web/20110703012814/http:/news.yahoo.com/s/nm/20081207/pl_nm/us_usa_obama_smoking_3 \"http://news.yahoo.com/s/nm/20081207/pl\\_nm/us\\_usa\\_obama\\_smoking\\_3\")\n\n"
    },
    {
      "time": "",
      "content": "Completely despicable – everyone knows he smokes [Marlboros](http://web.archive.org/web/20110703012814/http:/mediamatters.org/items/200701180010)!\n\n\\>That could be hype, but the “squeeze, click” combined with that image seems more gun like than a cigarette.\n\nAnd there's \"the smoking gun\".\n\n"
    },
    {
      "time": "",
      "content": "\\>We are getting ads from car dealers here using “yes, we can”. It makes me want to puke.\n\nAnyone with a two year old knows that Obama stole that line from \"Bob the Builder\".\n\n"
    },
    {
      "time": "",
      "content": "_his is one of the classier knockoffs I’ve seen. At least Camel licensed Gotham instead of just using Gill or Avenir._\n\nWhat evidence do you have they purchased a license to use Gotham? They could have commissioned a Gotham clone or used Gotham without paying the going fee.\n\n_I wish there was a “green” message and the extra device in the tobacco was meant to protect others from the second hand smoke in some way–then I could forgive them slightly. But nope, it’s just a cheesy menthol option._\n\nHow is a \"green\" message supposed to redeem an act of plagiarism?\n\nThere is still no solid proof second hand smoke causes cancer. Personally I know about thirty non-smokers who grew up or lived their entire lives in houses with full time smokers. Not one of them ever contracted cancer. There must be something in that.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "_Anyone with a two year old knows that Obama stole that line from “Bob the Builder”._\n\nPoliticians top the pile of greatest plagiarists.\n\n[Bob The Builder sues Barack Obama for plagiarism.](http://web.archive.org/web/20110703012814/http:/www.thespoof.com/news/spoof.cfm?headline=s2i31534) A spoof news item.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "_There is still no solid proof second hand smoke causes cancer. Personally I know about thirty non-smokers who grew up or lived their entire lives in houses with full time smokers. Not one of them ever contracted cancer. There must be something in that._\n\nSure, and there are people who chain smoke for six decades who don't get cancer. That doesn't mean that smoking doesn't cause cancer, it means that some people are genetically less susceptible to cancer than others.\n\nIt is a red herring to say that second-hand smoke is not proven to cause cancer, as if this implies that second-hand smoke is harmless. It has been linked fairly conclusively to asthma, bronchitis, pneumonia, otitis media and other diseases in children. It doesn't necessarily 'cause' the disease, but it contributes to susceptibility and is statistically linked to increased occurence. Likewise, it has been linked to increase risk of heart attack. I recommend a search through the Lancet papers related to second-hand smoke.\n\n"
    },
    {
      "time": "",
      "content": "How is a “green” message supposed to redeem an act of plagiarism?\n\nTying a pro-active environment measure to Obama would certainly be a lot more reasonable than simply trying to gain sales on the coattails of his campaign platform. I'm not condoning plagiarism but we all know advertisers are simply mimics for the most part and tend to make campaign decisions based on thorough research of ideas that have proven success.\n\nAs far as the second hand smoke issue goes–that's out of my realm. But I, for one, don't enjoy breathing it–regardless of the health effects.\n\n"
    },
    {
      "time": "",
      "content": "How do you guys make type italicized in your replies? I tried tags but those aren't in the allowed HTML tags list and I couldn't find anything in the More information about formatting options.\n\n"
    },
    {
      "time": "",
      "content": "_Allowed tags below..._\n\nEM is the one you want.\n\nCould have also used \"show source\"\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "Ah right, emphasize. It's been awhile since I've coded with HTML. _Ta!_\n\n"
    },
    {
      "time": "",
      "content": "We're going to start seeing this a lot. In my eyes, it's going to be a bit more tolerable than the radio ads for everything under the sun that have been constantly milking \"economic stimulus package\".\n\n"
    },
    {
      "time": "",
      "content": "_There is still no solid proof second hand smoke causes cancer._\n\nLike John, I don't buy that either, James. And it doesn't make much difference, because if you don't get it from second-hand smoke, you'll get it from all of the cars and chimneys that surround you.\n\n"
    },
    {
      "time": "",
      "content": "_Camel used to have a bit of a reputation for subliminal ads. That could be hype, but the “squeeze, click” combined with that image seems more gun like than a cigarette._\n\nUsed to? The drawing of the camel on their packaging **still** has subliminal images... They've never modified it, as far as I know!\n\nThe word \"gun\" can be interpreted more than one way... :-) Sometimes a cigar is **not** just a cigar!\n\n ![](http://web.archive.org/web/20110703012814im_/http:/typophile.com/files/camels_5461.png)\n\n"
    },
    {
      "time": "",
      "content": "To be honest, I remember hearing about the Camel crush cigarettes awhile ago, and it was supposed to be some sort of reinvention of the company, and I don't see any correlation between Obama's campaign and the Camel ad, other than the word \"Change\". I think you're giving them more credit than they deserve in this particular case. Because of the prominent visibility of the term \"change\", you're going to naturally see it more than before. If women in a one-piece bright red bathing suit started becoming forefront in the media, you would probably start noticing those dingy, dusty Budweiser ads again.\n\nNow, I can say that there will be a flux in ad campaigns based on Obama's campaign because that is the nature of advertising. This is the case with anything that garnishes mass attention, I believe the term is \"jumping on the band wagon\".\n\n"
    },
    {
      "time": "",
      "content": "\" \\*Americans\\* must change America.\"\n\nThis should have been the realization from the very beginning.\n\nBut your insight is spot on.\n\n"
    },
    {
      "time": "",
      "content": "On second-hand smoke:  \n [http://www.youtube.com/watch?v=nrub3dt7R5U](http://web.archive.org/web/20110703012814/http:/www.youtube.com/watch?v=nrub3dt7R5U \"http://www.youtube.com/watch?v=nrub3dt7R5U\")  \nAnything that makes Penn Jillette recant has to be pretty solid.\n\nOn \"\\*Americans\\* must change America\":  \nThat's exactly what Obama says, which is why I think he's going to help.\n\n"
    },
    {
      "time": "",
      "content": "\\>”\\*Americans\\* must change America.”\n\n\\>This should have been the realization from the very beginning.\n\nWell I guess we'll never know - a few hundred years ago a bunch of Europeans turned up and their brand of \"change\" kind of messed things up for folks living here. :-(\n\n"
    },
    {
      "time": "",
      "content": "\\>To be honest, I remember hearing about the Camel crush cigarettes awhile ago, and it was supposed to be some sort of reinvention of the company, and I don’t see any correlation between Obama’s campaign and the Camel ad, other than the word “Change”.\n\nDoes anyone know the timing? Maybe Obama stole the idea from Camel, perhaps on a midnight undercover cig run to his local convenience store?\n\n"
    },
    {
      "time": "",
      "content": "@John: _Sure, and there are people who chain smoke for six decades who don’t get cancer. That doesn’t mean that smoking doesn’t cause cancer, it means that some people are genetically less susceptible to cancer than others._\n\nAh yes, we're getting into some useful logic here. I want to agree with your argument John, but I can't. I don't think medical science knows enuff about what really causes cancer for the \"susceptability\" syndrome to be a reliable or knowable factor. More and more evidence has surfaced that numerous kinds of virus are involved in numerous types of cancer, as both generators and pathogens. Probably you are right, but we will find out more as we look further into the nature and mechanisms behind cancer.\n\n_It is a red herring to say that second-hand smoke is not proven to cause cancer, as if this implies that second-hand smoke is harmless._\n\nRed herring, yes, I'll pay that one. You make a good point about my line of reasoning. To clarify, I don't mean to imply second hand smoke is harmless. I'm more of the belief it's something we've yet to to fully understand the effects of.\n\n@Ricky he's so fine: _Like John, I don’t buy that either, James. And it doesn’t make much difference, because if you don’t get it from second-hand smoke, you’ll get it from all of the cars and chimneys that surround you._\n\nYepp. So, why does the mainstream demonize cigarettes and tobacco but not other sources of environmental carcinogens? Doesn't anybody think that's a double standard? Furthermore (instead of saying \"that said\"), are double standards, an aspect of the dictatorship of reason we live with, really as bad as we make them out to be?\n\nQ. What happened to Voltaire's secular humanism and freedom of thought?  \nA. It got swallowed up by the dictatorship of reason in the West.\n\n@James Deux: _” \\*Americans\\* must change America.”_\n\nThis should have been the realization from the very beginning.\n\nBut your insight is spot on.\n\nWhen the world outside the U.S watches your federal elections we're amazed by all the hoopla and ceremonial banners and bunting and carrying on of the campain and national conventions. Political messages and policy seem to get lost in all that. Obama had to have a message to ride on and for supporters to climb aboard.\n\nThat Americans must change for the U.S to change should have been the realization at the start, but employing that as a slogan at the outset would have been letting the cat out of the bag to soon. I believe it is possible tho, that Americans themselves can change their ways and change their wider culture for the better, and I am with you all on that one. I'm supportive, not antagonistic.\n\nAmerican foreign policy is the area of U.S. politics driven and controlled by the U.S industrial-military machine that must change. Northrop, North American Aviation, Boeing, Lockheed, McDonald Douglas, Colt Arms, the Springfield armory, Ratheon, IBM and other electronics manufactureres, Haliburton etcetera. Too many jobs tied up in munitions, warplane and firearms manufacture, too much investment in the implements used to make war. These are the industries and companies that buy senators and buy political influence to virtually set U.S foreign policy agenda.\n\nThat's just for openers, and of course there is much else in America that could benefit from change.\n\n@Sii: _Well I guess we’ll never know - a few hundred years ago a bunch of Europeans turned up and their brand of “change” kind of messed things up for folks living here._\n\nIt's never too late to try something else. Put the mistakes of the colonial era behind you and design a way forward. I think the biggest thing holding back change is the general fear of trying new things. Change isn't a hard thing to do to start off. Living with the changed circumstances is the challenging part\n\n_Does anyone know the timing? Maybe Obama stole the idea from Camel, perhaps on a midnight undercover cig run to his local convenience store?_\n\nI'll try to find time to look further into it today. I think \"yes we can\" is an old, old one from way back. Bob the Builder probably got it from somebody else and it will turn out to be an old proverb by anonymous. Camel branding communications taking up the slogan \\*at this time\\* is the exploitative part.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Is it shameless capitalization to use a popular typeface in a stereotypical manner?\n\nTimes have changed from when I first started in the ad biz (those not wishing to endure GenXYZ-bashing old fartism can tune out now).\n\nBack in tha day, it was a point of honor and strategic principle (enshrined in creative theory) that there should be a visible Point of Difference between brands, which in some way represented the Key Benefit that was presented to consumers as to why they should prefer one brand over another.\n\nSo product managers and creative directors made sure that each brand had its own creative treatment--and its own typeface, set in a distinctive manner.\n\nAm I correct in the observation that this practice is still followed, but to a lesser degree?\n\n"
    },
    {
      "time": "",
      "content": "_Is it shameless capitalization to use a popular typeface in a stereotypical manner?_\n\nThat's a loaded question. Using a popular typeface in a stereotypical fashion typifies things other than just shameless capitalization. For a moment there I read that as \"capitalism\". The best answer I can think of is, Top marks are given for mimicry in the ad biz now days, with ads for one brand imitating those of another brand. Looking back at advertising design over the 20th century evidently the principle of mimicry is not new, but there was a time, not so long ago, when better ethics interceded to limit the degree of mimicry.\n\n_So product managers and creative directors made sure that each brand had its own creative treatment—and its own typeface, set in a distinctive manner. Am I correct in the observation that this practice is still followed, but to a lesser degree?_\n\nYes, correct. Yes sir. Visible Point of Difference began to take a beating starting in the early 1990's at the ham-fisted hands of salad boys.  \nJoke—What's the opposite of ham-fisted? A. Cheese-fisted. If only the salad boys I'm talking about understood they don't have to use ham in every sandwhich.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Reading this thread reminds me of the Adobe book [\"Branding with Type,\"](http://web.archive.org/web/20110703012814/http:/www.alibris.com/search/books/qwork/790950/used/Branding%20with%20Type) which among other things contained extensive survey results on the usage of specific typefaces identified with certain industries.\n\nAt the time Apple was using their custom ITC Garamond condensed (eccch, I know) as were dozens of other computer companies. Volkswagen's use of their custom Futura (of which I own a copy-Mmm-Tasty) caused many in the auto industry to use it immediately as well. And Optima and its many humanist cousins appear to be the only typeface you're allowed to use if you're selling cosmetics.\n\nIt's up to designers to decide whether to be sheep and make Gotham so ubiquitous as to lose all its power through improper usage. I've lived through enough trends, watching colleagues hop on the latest faces that I see them coming a mile away and vow never to use them. I'm pretty sure I know who did this ad, they're here in Philadelphia. And they've never exactly been known for their originality.\n\nGotham's a beautiful face, no doubt about it. And versatile as hell in the right hands. It's been around since 2000, but its first exposure to the public at large as well as designers who weren't paying attention occurred with Obama. The word \"CHANGE\" set in that face has become as iconic as identifying Neo Contact forever with the word \"Marlboro.\"\n\nPatrick\n\n[http://typographyshop.com](http://web.archive.org/web/20110703012814/http:/typographyshop.com/ \"http://typographyshop.com\")  \n [http://kinggroupmedia.com](http://web.archive.org/web/20110703012814/http:/kinggroupmedia.com/ \"http://kinggroupmedia.com\")\n\n"
    },
    {
      "time": "",
      "content": " **Iconic** has become the biggest buzzword for typophilers lately.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "I used to smoke Camels. Cool stuff. I even have a exact copy of a Camel box I made back when I learning the basier tool. The only difference is that the colors I used were primary.\n\nOnce a friend of mine showed me the images within the camel and couldn't believe it! I am sure that the artist who first created the illustration did not want any of that in there —probably an accident that later on paid itself ...\n\nThese days you can see ”change” in any cheap news-paper or home made commercial on tv.\n\nYeahah!\n\n"
    },
    {
      "time": "",
      "content": "I think [this Pepsi ad](http://web.archive.org/web/20110703012814/http:/www.refresheverything.com/) is trying to get on the same bandwagon.\n\n"
    },
    {
      "time": "",
      "content": "I don't know if \"Iconic\" has become a buzzword for the typophiles of the world so much as it has become a buzzword in general usage in the business and media worlds over the last few years. Having been trained as a painter as well as a designer, the word has a dual meaning for me.\n\nWe're all unfortunate victims of the lexicon of the moment. Why else would otherwise intelligent people be so enamored of the word \"AWESOME?\" For more than half my life the word was reserved for such things as the Grand Canyon or Niagara Falls. Maybe an apparition of the Virgin Mary or an earthquake. But never, thankfully, was it used to describe French Fries or haircuts.\n\nI'm happy to see that this community uses the word sparingly. And when it comes to our love of type, there are certain faces and talents for whom that \"a\" word would indeed be used appropriately.\n\n[http://typographyshop.com](http://web.archive.org/web/20110703012814/http:/typographyshop.com/ \"http://typographyshop.com\")  \n [http://kinggroupmedia.com](http://web.archive.org/web/20110703012814/http:/kinggroupmedia.com/ \"http://kinggroupmedia.com\")\n\n"
    },
    {
      "time": "",
      "content": "Getting back to cigarettes... This just in: [\"Third-hand smoke\"](http://web.archive.org/web/20110703012814/http:/www.nytimes.com/2009/01/03/health/research/03smoke.html?ref=science).\n\n"
    },
    {
      "time": "",
      "content": "I think Pepsi was at least trying to make it a little less obvious. It’s not a good campaign, tho—the altered logo and crazy colors don’t suggest Pepsi, and I’ve seen their crazy orange billboards all over Manhattan and not been sure what they’re even for!\n\n"
    },
    {
      "time": "",
      "content": "This is turning ugly. I snapped this from the evening news last night. A couple of locals apparently so objected to the advertising that they pulled a pair of shotguns on a convenience store clerk.\n\n ![](http://web.archive.org/web/20110703012814im_/http:/typophile.com/files/IMG_2525_6163.JPG)\n\n"
    },
    {
      "time": "",
      "content": "The new Pepsi design is growing on me. It looks much better on actual packaging than it does in photos. And that ad is great.\n\nAlso, that Pepsi ad used Gill, not Gotham. But you already knew that.\n\n"
    },
    {
      "time": "",
      "content": "James, in one thread you've managed to try and get a debate going on the abilities (or lack thereof) of Barack Obama, questioning whether or not second hand smoke causes cancer, the legitimacy of large ad agencies font licensing, and the problems with the US Military Industrial Complex.\n\nWell played. ;)\n\n"
    },
    {
      "time": "",
      "content": "Time to switch the topic to guns.\n\n"
    },
    {
      "time": "",
      "content": "Darrel, thanks for the compliment, even tho I'm only one contributor with specialized interests and knowledge, and others on this thread with their own specilizations have added excellent material. We do it together and the best part is seeing so many smart peeple have an intelligent and eclectic discussion. It makes me proud to be a typophiler. I take my hat of to you and Ricardo, John, Nick, Patrick, James Puckett, Patty Fab, Sharon, Shari, Sii, André and others.\n\nBut most of all thank you Eric for starting us off.\n\nPatrick—guns. Guns and firearms and the uses they are put to, and the politics of the gun in the U.S, constitute a special interest of mine. I'm out of time for the moment, have to finish constructing an angel, but I'll join you later.\n\nThere's so much to discuss about guns, so go for it. Don't hold back, as long as you keep it civil.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Like, there is still no solid proof guns cause bulletholes?\n\nƒ\n\n"
    },
    {
      "time": "",
      "content": "I'm glad you took it as a compliment (as that was the intent). This is an impressive thread!\n\n"
    },
    {
      "time": "",
      "content": "Dude, assumption of good faith counts for so much in our text-based environment. We sometimes disagree, but we don't need to be antagonists. Our shared interest in typography unites us.\n\nLet's make this impressive thread a good start to a better year for Typophile.\n\n@fredo: _Like, there is still no solid proof guns cause bulletholes?_\n\nHeh! As the cop-out \"proverb\" goes, 'Guns don't kill peeple. Peeple kill peeple'. The second part of that statement is true, but the first part glosses over how much easier peeple find it to kill each other using guns, so it's a kind of non sequitur.\n\nDoes anybody have a transcript of the U.S. Constitution handy? Does the second ammendment grant civilians, \". . . the right to bear arms . . . \" or does it say, \". . . the right to take up and bear arms if attacked . . . \" ? I'm paraphrasing from memory.\n\nWikipedia article------ [Right to keep and bear arms](http://web.archive.org/web/20110703012814/http:/en.wikipedia.org/wiki/Right_to_keep_and_bear_arms)------is extensively referenced with plenty of inline citations for the important stuff, and since it deals with such a controversial issue the written content of that article was no doubt thoroughly contested by its editors.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "_Also, that Pepsi ad used Gill, not Gotham. But you already knew that._\n\nThe sloping sides of M suggests it's neither Gill nor Gotham, actually.\n\n"
    },
    {
      "time": "",
      "content": "Actually Pepsi had the swoosh in the circle red-white-and-blue thing going long before Barack was on anybody's horizon so they can hardly be accused of ripping him off. Altho I agree that their logo update borrows a page from his book.\n\nBest Pepsi campaign ever was the hideous 80s neon look which, when you stacked the three cans vertically, unmistakably read SEX, like Farrah Fawcett's hair in that poster.\n\n"
    },
    {
      "time": "",
      "content": "_...unmistakably read SEX, like Farrah Fawcett’s hair in that poster._\n\nHer hair wasn't the only thing that read SEX in that poster... Ahem. :-)\n\n"
    },
    {
      "time": "",
      "content": "I'm glad the topic turned to more important issues such as Farrah Fawcett's hair. What would be the best typeface to pair with her hair?\n\n"
    },
    {
      "time": "",
      "content": "Gotham?\n\n"
    },
    {
      "time": "",
      "content": "uh, wait a sec… Obama and Camel aren't competing brands, are they?\n\nPersonally, I think corporations and advertisers have always seen advantages in both branding to stand out from their competitors and riding competitors' coat tails, if there seemed to be an advantage in doing so. There is certainly a long tradition of referencing current events in one way or another to create a connection beteen a particular zeitgeist and their products. Some people may call that a scandalous co-opting of the positive image and goodwill built up by another brand, and others may call it exploiting an opportunity. It's really not news when it happens.\n\nWithout discussing the health concerns that go with smoking or the promises of hope that go with Mr. Obama, which are not pertinent to a discussion about typographic branding, what get's peoples' ire here is that cigarettes and smoking is a widely despised practice these days, and with the (quite obvious) co-opting of a piece of Mr. Obama's branding, the owners of the Camel brand are in essence saying that \"Camel ciggies, now include hope\"\\*, which is obviously a provocative thing to say to an anti-smoker. However, I don't think it is any more dishonest than other vague & unsupported aspirational promises made by thousands upon thousands of other products, including politicians.\n\n\\*I dunno about you, but suggesting that \"Camels now include hope.\" is less offensive than the cartoon camel of a few years ago that seemed to say, \"Hey kids, smoking is FUN.\" By tyhe way… The illustration looks like some kind of bong diagram. What up wid dat?\n\nTo make a discussion of firearms relevant on this forum, I think you'd 'ave to start off with... \"If modern life were a typeface, would guns be exclamation points?\" or… Like that.\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "Can we make laconic a buzz word?\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "_\\*I dunno about you, but suggesting that “Camels now include hope.” is less offensive than the cartoon camel of a few years ago that seemed to say, “Hey kids, smoking is FUN.” By tyhe way… The illustration looks like some kind of bong diagram. What up wid dat?_\n\nIt's CAMEL. It's BS. (Howz dat for laconic?)\n\n"
    }
  ]
}
