{
  "id": "53085",
  "title": "Johannes Wagner",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was looking for some information about the German type designer Johannes Wagner and his typefaces, in particular in Aurora Grotesk (released by the C.E. Weber foundry around 1912 or earlier).  \nIf there is some resource I'd like to know more about the C.E. Weber foundry, and the whereabouts of Wagner's work.\n\nI have checked most of what's available on the web but I haven't found so much, apart from the informations provided by Linotype on their site:  \n [http://www.linotype.com/630/johanneswagnerfoundry.html](http://web.archive.org/web/20150416044809/http:/www.linotype.com/630/johanneswagnerfoundry.html \"http://www.linotype.com/630/johanneswagnerfoundry.html\")\n\nUnfortunately I do not understand German, but I would be grateful for any suggestion or indication of offline resources.\n\n",
  "author": "piccic",
  "time": "1 Jan 2009 — 1:30pm",
  "uid": "1316",
  "comments": [
    {
      "time": "1 Jan 2009 — 3:35pm",
      "content": "_type designer Johannes Wagner_\n\nThat is not the name of a typedesigner, but of a foundry. Johannes was the son of Ludwig Wagner. One of Wagner’s companies folded in 1942 and some of their materials were taken over by C.E. Weber in Stuttgart. Johannes Wagner moved his foundry from Leipzig in East Germany to Ingolstadt in the West, shortly after World War II. (Ingolstadt is a town in Bavaria, today also the home of Audi). The company existed as Letternservice Ingolstadt until 2002. The remaining equipment is now in the Museum für Druckkunst in Leipzig.\n\nI don’t know much else of the top of my head, but if you search for Letternservice etc, you’ll find stuff. Perhaps all in German, but that is what we speak over here.\n\n"
    },
    {
      "time": "1 Jan 2009 — 3:40pm",
      "content": "Just found this on [James Mosley’s blog](http://web.archive.org/web/20150416044809/http:/typefoundry.blogspot.com/2006/01/materials-of-typefounding.html):\n\n¶ Johannes Wagner, Ingolstadt \\*  \nAlso known as ‘Letternservice Ingolstadt’. The foundry incorporates several firms which originated in Wagner & Schmidt, matrix makers, established in Leipzig in 1875. Johannes Wagner (1888–1965) transferred his foundry from Berlin to Ingolstadt in 1949. In 1971 it acquired a large part of the materials of C. E. Weber, Stuttgart. In 1978 the foundry took over the current production of H. Berthold, Berlin, casting types from ori ginal matrices which are held in the foundry.  \nThe foundry is reported to have ceased casting type for sale: an account of its current status and that of its materials would be welcome.  \nEinhundert Jahre Wagner-Schriften (Die Handsatzletter, Heft 8), Ingolstadt, November 1975.\n\n"
    },
    {
      "time": "2 Jan 2009 — 10:24am",
      "content": "Erik, thank you so much. I appreciate a lot!\n\nI have already found most of the things on the web, including Mosley, but I'll check also for \"Letternservice Ingolstadt\".\n\nNow, main questions:\n\n- Who is the actual designer of Aurora Grotesk? I understand Wagner and family run the Schriftgießerei, which bear their name, but Aurora is credited to him, and seems to be a C.E. Weber release from 1912 (but I have strong reasons to believe it came out earlier, and it's a key point in my research, which is related to Italian type designs).\n\n- There is also Romana, a typeface which is credited to Gustav F. Schroeder, and the date reported is 1892, but it is also credited as a Wagner face from 1930. May it be that the Wagners re-cast it and added weights to the family?\n\nEDIT: I also wrote to the Museum and I am waiting for a reply.\n\nMany thanks again!\n\n"
    }
  ]
}
