{
  "id": "53083",
  "title": "Logo for Portfolio - Critique",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I've created a personal logo for my webdesign portfolio. Please critique these. Which do you prefer? Thanks.\n\n ![](http://web.archive.org/web/20140725182357im_/http:/typophile.com/files/logo_samples_4081.jpg)\n\n",
  "author": "jamis82",
  "time": "1 Jan 2009 — 6:57am",
  "uid": "40361",
  "comments": [
    {
      "time": "1 Jan 2009 — 8:25am",
      "content": "#4 is far more interesting.\n\nWhat has been your thought process?  \nWhat are you going for?\n\n"
    },
    {
      "time": "1 Jan 2009 — 8:50am",
      "content": "Paul,\n\nThis will fit into my portfolio site. For the site I'll be using a minimalist style that emulates some of the old newspaper look.\n\nThe style I am going for is somewhat like these 2 sites:\n\n[http://www.danielmall.com/](http://web.archive.org/web/20140725182357/http:/www.danielmall.com/)  \n [http://www.robweychert.com/](http://web.archive.org/web/20140725182357/http:/www.robweychert.com/)\n\n"
    },
    {
      "time": "1 Jan 2009 — 10:14am",
      "content": "Logo nº1 with the \"sun and titles\" from nº3 but with tha same size as nº2\n\n"
    },
    {
      "time": "1 Jan 2009 — 11:05am",
      "content": "The two links you cited as models suggest 19th-Century typography. Your designs refer to 18th-Century styles. It matters because the former says \"industry\" and the latter says \"enlightenment.\" What fits better with the way you want to present yourself?\n\n"
    },
    {
      "time": "1 Jan 2009 — 11:58am",
      "content": "While I reiterate the questions asked by PublishingMojo, I also believe that the fourth logo is more interesting.\n\n"
    },
    {
      "time": "1 Jan 2009 — 5:51pm",
      "content": "Mojo, Dsgoen,\n\nMy current portfolio is at [www.jamischarles.com](http://web.archive.org/web/20140725182357/http:/www.jamischarles.com/)\n\nI am trying to redo it completely because I think I missed the mark on this one.\n\nSo for my new portfolio, to which the above is going to be the logo, I'll be using Garamond Premier Pro as my main typeface for the headings. It'll be a fairly simple site the main emphasis being the pieces of work, based on a grid.\n\nI used Hoefler Text in the 4th piece above. I'd like to present myself as a competent designer/developer who enjoys beautiful typography. Hope that helps. Thanks for the help guys.\n\n"
    },
    {
      "time": "2 Jan 2009 — 1:46am",
      "content": "I'd like to see your name in the two different weights used in no. 4 in combination with the titles on either side as no.1, however, I would suggest removing the graphic as it doesn't seem to have any relevance other than to separate your titles which could be done without a graphic. I feel like the graphic was thrown in as an after-thought, but only because your using the rules above and below your typography to essentially frame your name.\n\nIf you would like to go with the style of the bottom three samples, where you're titles are going to be below your rules, then I might suggest \"Designer/Developer\" with a bit of space between, and playing with the weights of those as well. I wouldn't use the same weight usage as your name with the heavier weight on the left, because then your logo will become unbalanced. One other thing to consider is what your message is going to be through your logo. With emphasis on your name, the logo is about you, and with emphasis on your titles, the emphasis becomes about what you're providing.\n\n"
    },
    {
      "time": "2 Jan 2009 — 4:29am",
      "content": "Thanks for all the comments. Here's another sampling with the changes you guys suggested. Let me know what you think.\n\n ![](http://web.archive.org/web/20140725182357im_/http:/typophile.com/files/logo_samples_6221.jpg)\n\n"
    },
    {
      "time": "2 Jan 2009 — 12:25pm",
      "content": "I like the latest no 4, because of the cleanliness. It gets your point across concisely, and the separations between you and what you do make the message have a bit more authority. It might be an optical illusion, but it looks like the bottom rules don't match the same spacing as your top rules, I didn't notice it until now. I'd be interested to see your thoughts on it, as it is your logo.\n\nSide note: I had a typo in my previous post, I was referring to no. 3 weights, not no. 4. However, I think that the latest versions work much better.\n\n"
    },
    {
      "time": "2 Jan 2009 — 11:07pm",
      "content": "I also vote for the new no. 4 version (with the top and bottom spacing for the rules adjusted to match).\n\nBy the way, I think you're right about your web site needing a redesign. The wood grain background and flashy picture frames fight against your desired image of a competent, careful designer interested in good typography.  \n&nbsp;  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ~~~~~~~~~~~~~~~~~  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_When going from_ A to Z,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_I often end up_ At Oz.\n\n"
    },
    {
      "time": "3 Jan 2009 — 10:43am",
      "content": "Imavery,\n\nYou're right about the spacing. I'll adjust it and then repost no. 4.\n\n"
    },
    {
      "time": "5 Jan 2009 — 5:02am",
      "content": "Final Run: I've made a few adjustments. Tried to fix the spacing issue (if it's still there, I'll fix it later). I've also thrown in some possible monograms.\n\nLet me know which ones you like best or if any of them work for you.\n\nThanks again.  \nJamis\n\n ![](http://web.archive.org/web/20140725182357im_/http:/typophile.com/files/logo_samples_4603.jpg)\n\n"
    },
    {
      "time": "6 Jan 2009 — 6:57pm",
      "content": "Once again, I prefer the newest version 4, EXCEPT that the bottom rules need to be a top-to-bottom mirror image of the top rules.\n\nCan't say that I particularly like any of the monograms. It seems to me that since the C in Charles is basically a circular shape (however elipical it is) that you should be able to come up with a good-looking monogram of a J inside (or overlapping) a C.  \n&nbsp;  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ~~~~~~~~~~~~~~~~~  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_When going from_ A to Z,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_I often end up_ At Oz.\n\n"
    },
    {
      "time": "7 Jan 2009 — 11:57am",
      "content": "No. 4 still. I agree with with a2z on both accounts. If you want a monogram, you could do something with the second from the left. I'd try out JC within the two circles. I'd also loose the fill effect between the two circles, and I'd play with the weights of their strokes. You don't want your frame to overpower.\n\n"
    }
  ]
}
