{
  "id": "53091",
  "title": "cyan color?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hello,  \ni am doing a corporate design with \"RGB Colors\".  \nFor print purposes i am using the Pantone neon colors (801-812).  \nBut i am missing a real RGB \"cyan\" like RGB:00ffff.\n\ndoes anyone know a special color, which could fit for this?  \ni didn't find it in Pantone, HKS, nor in RAL.  \n(everything i found, was more light blue or mint green.)\n\n",
  "author": "lexter17",
  "time": "2 Jan 2009 — 3:31am",
  "uid": "37738",
  "comments": [
    {
      "time": "2 Jan 2009 — 6:38am",
      "content": "Looks impossible to achieve. You could try to talk your printer into doing some tests with combinations of iridescent, neon and cmyk. Maybe a mix of a PMS 801 tint and and iridescent white?\n\n[http://www.freepatentsonline.com/4017326.html](http://web.archive.org/web/20150125063730/http:/www.freepatentsonline.com/4017326.html \"http://www.freepatentsonline.com/4017326.html\")\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "2 Jan 2009 — 12:09pm",
      "content": "Perhaps you could go metallic?\n\nIMO metallics give a classier print effect than fluorescents.\n\n"
    },
    {
      "time": "3 Jan 2009 — 5:41am",
      "content": "I do not think that you can get the bright RGB cyan in print: RGB colours are made by combining lights (i.e. bright, or 'additive mix' in geek) while printing inks work by reflection/absorption (i.e. darker, or 'subtractive mix').  \nprgr\n\n"
    },
    {
      "time": "3 Jan 2009 — 5:58am",
      "content": "i know this would sound ridiculous, and i'm just a beginner in this, but perhaps a work done with light-produced colors, can be made on a transparent film? print it with bright pantones, holding it against light, with a good print, may bring good and colorfull results?\n\n"
    },
    {
      "time": "3 Jan 2009 — 10:06am",
      "content": "There isn't a PMS neon blue that has the same lightness as that RGB blue.\n\nPMS 305C has a similar tone, and printed on good stock (read: non absorbant) it is probably also nice and bright. Unfortunately that one isn't neon...\n\nOtherwise you might have to experiment with a 'custom' ink mix, like Bert Vanderveen already mentioned. Maybe 'lightening up' one of the PMS neon blue's?\n\n"
    },
    {
      "time": "3 Jan 2009 — 12:36pm",
      "content": "Beware:\n\nIn many cases ink companies don’t actually sell a true 801 blue.\n\nThey will make this color from cyan, white, and a touch of green from bases then add optical brightener, a fluorescent agent.\n\nThis is what we call in the ink industry “falsifying color”.\n\nAlso mixing (true) fluorescent inks with _any_ non-fluorescent ink will ruin all the fluorescent effects. Even the most pure non-fluorescent inks will add “dirt”—another industry term meaning “reduction in chroma”... more grey, less brilliant.\n\nI suggest you tell your printer you want pantone 305c with optical brightener added.\n\nAlso:\n\nUse paper the has bluing/fluorescents add— you can test this by dropping a couple of drops of isopropyl alcohol on a sheet of paper. If it does have these properties when the paper dries you should see a pretty indigo halo.\n\nBetween you and me, lexter, most of the audience that will view the result of your project will not have sufficient color memory/perception to even differ amongst these shades of blue.\n\nIf this corporate design of yours will also be used in signage, you must know that fluorescent pigments are not fade resistant to the sun, in fact, the most fugitive of all the the colors.\n\nYou will have to use standard cyan pigments anyway... I recommend pantone 305 with o.b. for indoors and pure cyan outside.\n\nMike Diaz :-)\n\n"
    }
  ]
}
