{
  "id": "53097",
  "title": "2009 Type Events",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "For those who, like me, prefer a tangible ink-on-paper calendar to the virtual/digital thing, and therefore go through the annual ritual of transferring important dates into the new year right about now, I thought it might be useful to accumulate some of the important typo-event dates worth saving for this year.\n\nI'll start with **TypeCon2009: 1419 July, 2009,** in Atlanta this year.   \n_(Those dates include the Tue & Wed pre-conference workshops, in addition to the conference proper -- Thursday through Sunday.)_\n\nThere's another thread started already about **TypoBerlin: 2123 May, 2009.**\n\nDoes anyone know when ATypI Mexico City is going to be? Couldn't find any information on the ATypI website.\n\n",
  "author": "kentlew",
  "time": "2 Jan 2009 — 10:50am",
  "uid": "1215",
  "comments": [
    {
      "time": "2 Jan 2009 — 12:03pm",
      "content": "No official dates for Mexico City, but Roger Black & co. plan for it to back into the \"Day of the Dead\" celebrations, so that would place it at the end of October.\n\nCheers, Si\n\n"
    },
    {
      "time": "2 Jan 2009 — 12:05pm",
      "content": "[http://robofab.org/robothon/index.html](http://web.archive.org/web/20130824013600/http:/robofab.org/robothon/index.html \"http://robofab.org/robothon/index.html\")\n\n\"The RoboFab developers would like to invite you to a new Robothon conference, Thursday March 5 and Friday March 6, 2009, at the Royal Academy of Arts in The Hague.\"\n\n"
    },
    {
      "time": "2 Jan 2009 — 12:15pm",
      "content": "Though there haven't been frequent posts to the main content on [Typographica](http://web.archive.org/web/20130824013600/http:/typographica.org/), I try to keep the Happening sidebar up to date.\n\n"
    },
    {
      "time": "2 Jan 2009 — 2:50pm",
      "content": "I believe the St Bride Conference will be around the 23rd of April, but have not seen this publicly posted yet.\n\n"
    },
    {
      "time": "2 Jan 2009 — 3:15pm",
      "content": "For those who prefer to be in the sun & drinking beer during February, there is [TypeSHED11](http://web.archive.org/web/20130824013600/http:/typeshed11.co.nz/) from 11–15 Feb in Wellington, NZ. Check out the [lineup of speakers](http://web.archive.org/web/20130824013600/http:/typeshed11.co.nz/speakers)—it'll be a great event.\n\n--K\n\n"
    },
    {
      "time": "4 Jan 2009 — 7:37am",
      "content": "If you are interested in Mexican food & fiestas, the other thing to keep in mind for the ATypI Mexico City trip will be the 3-week molé festival in San Pedro Atocpan, in the very southern reaches of Mexico City. Last year's was 4-26 October; I can't find dates for the 2009 event yet.\n\nThis site is in Spanish (I've not found a lot of info about this festival in English):\n\n[http://www.feriadelmole.com/index.htm](http://web.archive.org/web/20130824013600/http:/www.feriadelmole.com/index.htm \"http://www.feriadelmole.com/index.htm\")\n\nNor have I attended this. But I have tasted molés from this area, and they have been excellent.\n\nI guess I better plan on a month in Mexico City: molé festival, ATypI, then day of the Dead.\n\nHasta luego.\n\npowers\n\n"
    },
    {
      "time": "5 Jan 2009 — 3:54am",
      "content": "Another thought, more serious this time:\n\nOrganizers of events may want to think about advance polling of people to see how many think they may be able to attend. As budgets shrink, fewer folks may be able to travel.\n\nOrganizers of a conference I attend every year have called it off entirely because so few university press production and design staff members have sufficient loot in their budgets to attend this year. Anticipated low attendance meant not enough money coming in as fees; the organizing press felt it was impossible to stage the conference. University presses are cutting back on travel budgets these days. I do not expect that our annual general meeting will be cancelled, but I expect attendance will be down.\n\nInstitutional, corporate, and individual travel budgets are among the first to feel the knife when money is tight. I hope to go to Mexico City; ten months out I am not at all sure I'll be able to afford it. I hope enough others feel differently, and I hope the organizers can put on a vibrant event.\n\npowers\n\n"
    },
    {
      "time": "5 Jan 2009 — 6:32am",
      "content": "Will -- I don't know about \"polling,\" but an anticipated drop in attendance is certainly something that the SoTA board has discussed regarding TypeCon. I don't think we would ever consider canceling TypeCon, since it remains the primary _raison d'être_ for SoTA. But we've already decided not to raise our fees at all, keeping them the same as last year, in a small effort to keep the gathering as affordable as we can. Of course, travel and accommodations are always the big-ticket items.\n\nSorry to hear that the AAUP Production meeting was cancelled.\n\n-- K.\n\n"
    },
    {
      "time": "5 Jan 2009 — 10:42am",
      "content": "Such a poll would not be that hard to do, at the start. It would, I admit, be far from definitive. E-mail address lists exist for organization members and for people who have attended conferences in the past. Sending out an e-mail to the list, asking a few questions about attendance would be done easily. Toting up replies and making sense of them will be more work, though. On top of the already tough task of setting up a conference.\n\nThe group I referred to that cancelled its meeting is a fairly tight-knit group of around a hundred folks, I'd guess. So that's easier. It took one e-mail from the organizer, a batch of responses, and in a couple of weeks the decision was made.\n\nBest of luck for TypeCon, TypoBerlin, and ATypI. Best of luck for everything in 2009. We need it.\n\npowers\n\n"
    },
    {
      "time": "5 Jan 2009 — 1:21pm",
      "content": "We are currently working on a calendar for Typophile that will contain all of this information and more…\n\nWe'll keep you up to date on the progress. Keep posting stuff as you here about it in this thread, and we'll get it loaded into the calendar.\n\nThanks!\n\n"
    },
    {
      "time": "5 Jan 2009 — 1:58pm",
      "content": "One additional note, the typography conferences help in far-flung exotic locations seem to attract a good number of locals, as well as the usual suspects (more often than not the speakers). If the goal of the organizers is typographic education/evangelism then they don't need all of us to attend - but it does make for more fun and better parties.\n\nAnother note - these events could not be run without corporate sponsorship, subsidized/free local venues, volunteers and in some cases government funding. So the best thing anyone with any influence could do to support them is get their sponsorship $'s and tangible offers of help in early.\n\n"
    },
    {
      "time": "5 Jan 2009 — 2:53pm",
      "content": "I would love for some type event to be held in Los Angeles.\n\nMikey :-)\n\n"
    },
    {
      "time": "5 Jan 2009 — 3:01pm",
      "content": "\\> We are currently working on a calendar for Typophile\n\nYay! I can drop that from the new Typographica then.\n\n"
    },
    {
      "time": "6 Jan 2009 — 7:16am",
      "content": "The TypeCon site could use some updating. It's still promoting the '08 event in Buffalo. Any idea on who the speakers in Atlanta will be?\n\n"
    },
    {
      "time": "6 Jan 2009 — 10:45am",
      "content": "Yeah, we know the site needs updating. Our amazing web volunteer (Brian Crick) was all set to work on it, then Life happened and he got otherwise occupied. The plan was to return the site to a neutral design temporarily. But now the 2009 Atlanta identity is underway (by Armin Vit and Bryony Gomez-Palacio), and timing might be such that it makes sense to wait until the identity is done and do the whole update at once. Tamye's still working on speakers, etc. It's still a little early.\n\nBut stay tuned . . .\n\n-- K.\n\n"
    },
    {
      "time": "19 Jan 2009 — 1:50pm",
      "content": "ATypI: Mexico City, 26–30 October 2009!\n\n"
    },
    {
      "time": "19 Jan 2009 — 2:28pm",
      "content": "Eighth annual Friends of St Bride Library Conference  \nSt Bride Library, London, 23 and 24 April 2009\n\nTheme: Revival!\n\n[http://stbride.org/events/revival](http://web.archive.org/web/20130824013600/http:/stbride.org/events/revival \"http://stbride.org/events/revival\")\n\n"
    },
    {
      "time": "19 Jan 2009 — 4:33pm",
      "content": "\"But I have tasted molés from this area, and they have been excellent.\"\n\nBut, do they kill them humanely?\n\nCheers!\n\n"
    },
    {
      "time": "19 Jan 2009 — 5:01pm",
      "content": "\"But, do they kill them humanely?\"\n\nNot before Molésting them :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Jan 2009 — 5:33pm",
      "content": "They usually escape by \"burr(l)ow\"ing to Boston before you can catch them Chris : )\n\nMichael\n\n"
    },
    {
      "time": "20 Jan 2009 — 6:33pm",
      "content": "LOL!!!  \nor at least Martha's Vineyard.\n\nChrisL\n\n"
    },
    {
      "time": "20 Jan 2009 — 7:20pm",
      "content": "Anybody up for an informal gathering in the San Jose, CA area? Say at the Coffee Society at the Pruneyard? We could totally take it over, man.\n\n"
    },
    {
      "time": "21 Jan 2009 — 6:36am",
      "content": "\"They usually escape by “burr(l)ow”ing...\"\n\nFortunately, my property is protected by a very sophisticated satellite-guided mini-rocket-firing whack-a-molé game I can play from FL's actions window, which, as you probably know, is way too dangerous to use on fonts.\n\nCheers!\n\n"
    },
    {
      "time": "21 Jan 2009 — 10:55am",
      "content": "Hi Everyone,\n\nWe have put together a Google calendar especially for type and design related events, activities and of course, the Typophile birthday calendar.\n\n[http://www.typophile.com/events](http://web.archive.org/web/20130824013600/http:/www.typophile.com/events \"http://www.typophile.com/events\")\n\nFor the time being, it is read only, with write access given to moderators. So, if you have events you would like to add, please feel free to contact one of us (Tiffany, myself).\n\nIf you have any recommendations on how to make this calendar more useful for everyone, please drop me a line. zara \\< at \\> punchcut \\< dot \\> com.\n\nThanks!\n\n"
    }
  ]
}
