{
  "id": "53099",
  "title": "Celebrities condemn Israeli attacks on Gaza",
  "forum": "James Arboghast's blog",
  "tags": [

  ],
  "content": "----- [ABC News story](http://web.archive.org/web/20100324050042/http:/www.abc.net.au/news/stories/2009/01/03/2458430.htm?section=justin)-----\n\n\"By Europe correspondent Emma Alberici\n\nPosted 42 minutes ago\n\nA group of high-profile celebrities in London have joined a campaign calling for an end to Israel's bombing of the Gaza Strip.\n\nSinger Annie Lennox led a press conference stating that the television footage of the attacks in Gaza had left her shaken to the core.\"\n\nj a m e s\n\n",
  "author": "<a href=\"/web/20100324050042/http://typophile.com/user/9349\" title=\"View user profile.\">James Arboghast</a>",
  "time": "<br>",
  "uid": "9349",
  "comments": [
    {
      "time": "",
      "content": "The never ending battle between two enemies with so much in common. It is a shame that so many innocent people die because two groups cannot get along. Split the damn country in half and make it two state instead of one, end this shit now. Muslims, Jews, and, Christians, we are all the same.\n\n"
    },
    {
      "time": "",
      "content": "\\>Split the damn country in half and make it two state instead of one\n\nThat's what Hamas doesn't want to do. Their stated goal is to destroy the present state of Israel, and make it a Muslim state. Hence their bombing Israel \\*after\\* it quit Gaza, and the coup d’état against the Palestinian Authority in Gaza. Both the Palestinian Authority and Israel want a two state solution. So do many Arab countries in their plan. Hamas and the Iranian government don't want any Jewish state.\n\n"
    },
    {
      "time": "",
      "content": "It certainly is an ongoing mess and a terrible waste of life. Author and philosopher Sam Harris has developed a progressive way of viewing religious intolerance. From Wikipedia:\n\n_Harris acknowledges that he advocates a benign, corrective form of intolerance, distinguishing it from historic religious persecution. He promotes a conversational intolerance, in which personal convictions are scaled against evidence, and where intellectual honesty is demanded equally in religious views and non-religious views. He also argues for the need to counter inhibitions that prevent the open critique of religious ideas, beliefs, and practices under the auspices of \"tolerance.\"_\n\n----- [Read the rest here](http://web.archive.org/web/20100324050042/http:/en.wikipedia.org/wiki/Sam_Harris_(author))-----\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "\\> Split the damn country in half and make it two state instead of one\n\nIf you do not want to share your own house with me,  \nam I given the right to kill you(r) children then  \nsplit the damn house in half and make it two houses instead of one?!  \nIs that allowed in Democratic US?!  \nIs that allowed in Christianity?!  \nIs that allowed in Judaism?!\n\nMore here:  \n [http://typophile.com/node/30209?page=1#comment-175307](http://web.archive.org/web/20100324050042/http:/typophile.com/node/30209?page=1#comment-175307 \"http://typophile.com/node/30209?page=1#comment-175307\")\n\n"
    },
    {
      "time": "",
      "content": "It is a never ending battle for land that belongs to not one, but many. I choose no side for both parties are equally guilty of crime against humanity.\n\n"
    },
    {
      "time": "",
      "content": "\\> It is a never ending battle for land that belongs to not one, but many?!\n\nArab Muslims, Arab Jews, and, Arab Christians were living there peacefully before Israel was wrongfully created in 1948 and non-Arabs Jews were cheated to migrate to the land that never belonged to non-Arabs. Emphasizing, the land did not belong to non-Arabs, but Jews were brought to it from troubled corners from all around the world.\n\nDo you know why? To make it a never ending battle? Again why?  \nTo keep on selling arms to the surrounding countries on the the condition that they would never use them against Israel that has been made at all times to be superior in armaments.\n\nIf it is still hard to understand why, I will comment more with Flowers.\n\n"
    },
    {
      "time": "",
      "content": "@William: _Both the Palestinian Authority and Israel want a two state solution. So do many Arab countries in their plan. Hamas and the Iranian government don’t want any Jewish state._\n\nIt isn't hard to understand why some parties don't want any Jewish state. The clock keeps ticking and more peeple are being killed, all the while the White House shows its bias by saying nothing. The Australian Federal Labor Government is conspicuous in its silence too:\n\n[Greens pressure Govt to condemn Gaza Strip violence](http://web.archive.org/web/20100324050042/http:/www.abc.net.au/news/stories/2009/01/03/2458565.htm)\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "Typedog, from a Jewish point of view it looks like the \"crime of Israel\" in the eyes of many of its opponents, including Hamas, is simply wanting to exist. The United Nations declared a two-state solution, and the united Arab countries did not accept it, and in 1948 tried to drive the Jews into the sea, as they put it.\n\nThere followed a series of wars and terror campaigns against Israel up until today. Israel was able to defend itself, which is not a crime to me. There was the high cost that almost everyone in Israel has a relative or friend who died in these defensive wars.\n\nIsrael also, led by Ariel Sharon, engaged in a long and brutal occupation of Gaza and the West Bank, which compromised it morally and, in my view, undermined its security.\n\nAfter this long history of war and folly there is finally acceptance of the existence of Israel by it seems most Arab governments, and agreement on a two-state solution--which was the original decision of the UN.\n\nHamas and Iranian leaders and other radicals still don't accept the right of Israel to exist. So when ironically Sharon himself, chief author and leader of the Israeli brutality that has taken place, stopped the occupation and pulled out of Gaza, Hamas's reaction was to make a coup d'etat against the Palestinian Authority and wage war on Israel.\n\nYou need to understand that peace has been possible for 60 years if Israel's neighbors were willing to accept its right to exist. That is shown by the fact that when Jordan and Egypt were willing to make peace, it happened quickly, and the peace has been kept. It is those who believe like Hamas who have been the destroyers of the possibility of peace.\n\nI pray that the guns and bombs on both sides will stop, the killing will stop, today, and peace will at last come this year to all in this long suffering region.\n\n"
    },
    {
      "time": "",
      "content": "I remember, from a QI episode (Stephen Fry's trivia/comedy quiz), that Edward de Bono recommended offering them Marmite to put on their bread, the theory being that yeastfree bread contains no zinc, a lack of zinc makes people belligerent.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "\\> The United Nations declared a two-state solution, and the united Arab countries did not accept it.\n\n1. Who created the United Nations?  \n2. From where did/does UN take Commands?  \n3. Did the map of the 2 states show the borders of Israel?  \n4. Or borders were left to expand as far as the 2 Blues Lines?!\n\n\\> .. and in 1948 tried to drive the Jews into the sea, as they put it.\n\nHow could that be? Who tried to drive who?  \nRemember Israel was created in 1948.\n\n\\> Israel also, led by Ariel Sharon, engaged in a long and brutal occupation of Gaza and the West Bank, which compromised it morally and, in my view, undermined its security.\n\nAbsolutely true, Ariel Sharon was a Bloody Terrorist?!\n\n\\> After this long history of war and folly there is finally acceptance of the existence of Israel by it seems most Arab governments, and agreement on a two-state solution—which was the original decision of the UN.\n\nWhich one of those Arab governments was democratically elected?  \n1+2 Mobark+Hosayan have been respectively ruling Eygpt+Jordan for more that 30 years.  \n3. Tribe of Saud wrongfully converted the land of Muslims to a Kingdom  \nand named it after their Tribe confiscating by that rights of all other tribes.\n\nMoreover, all the 3 corrupt Rulers have been backed by US and all backed Saddam;  \n [http://typophile.com/node/29708?page=4#comment-171294](http://web.archive.org/web/20100324050042/http:/typophile.com/node/29708?page=4#comment-171294 \"http://typophile.com/node/29708?page=4#comment-171294\")\n\n\\> Hamas’s reaction was to make a coup d’etat against the Palestinian Authority and wage war on Israel.\n\nBut Hamas was democratically under the eyes of UN watching team.  \n1. Was the team bribed by Hamas?  \n2. Or the Majority of Gaza people were terrorists?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nP.S. I do not believe in Democracy but in True Islamic Leadership (Be it Arab or non-Arab).\n\n"
    },
    {
      "time": "",
      "content": "Tim, that's a nice example of wit & satire used as incisive social criticism. Thanks!\n\nWilliam, thanks for the excellent summary / revision history.\n\nThere is something wrong with the world's most powerful \"democracy\", something basic and terrible, if the Washington has nothing to say about this horrific conflict, in effect allowing it to take place. Silent complicity!\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "\\> Here's another example of the world’s most powerful “Democracy”  \n [http://www.wtv-zone.com/Mary/NEWUSEMBASSYINIRAQ.HTML](http://web.archive.org/web/20100324050042/http:/www.wtv-zone.com/Mary/NEWUSEMBASSYINIRAQ.HTML \"http://www.wtv-zone.com/Mary/NEWUSEMBASSYINIRAQ.HTML\")  \nThanks for building my country (with Flowers)\n\n"
    },
    {
      "time": "",
      "content": "Thanks for building my country (with Flowers)\n\nIf not with flowers then with what? Some poor confused peasant strapped with bombs blown-up to the liking of Hamas?  \nRemember Husseini?\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/4-Husseini-nazi_jpg_jpg_jpg_3763.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Thank you Aziz for that WTV ZONE link.\n\nIn the face of the complicit silence from the government of the world's most powerful \"democracy\", the [peeple have taken to the streets in protest](http://web.archive.org/web/20100324050042/http:/www.abc.net.au/news/stories/2009/01/04/2458664.htm). More than 21,000 in Paris, setting alite three cars and overturning twenty. In London protestors lobbed their shoes at the door of #10 Downing street and yelled \"shame\" out to Gordon Brown, whose spokesman issued a bullshit press statement.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "@William Berkson\n\nAgreed, thanks for the info.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "\\> Remember Husseini?\n\nReferring to the above picture, I have spotted 2 nazi-crosses but failed to associate them with Husseini. Things do not appear natural.  \nIs that a fabricated one?\n\nScrutinize it before replying.\n\n"
    },
    {
      "time": "",
      "content": "Aziz, the Wikipedia biography includes a detailed discussion of al-Husayni's Fascist and Nazi sympathies and collaboration, and his role as leader of radical anti-Jewish efforts in Palestine.\n\n[http://en.wikipedia.org/wiki/Amin\\_al-Husayni](http://web.archive.org/web/20100324050042/http:/en.wikipedia.org/wiki/Amin_al-Husayni \"http://en.wikipedia.org/wiki/Amin\\_al-Husayni\")\n\nHad Arab leaders had a policy of tolerance and taking full advantage of the talents of the new Jewish immigrants from Europe--as we in America have had for immigrants into the US--there would have been peace and prosperity, and by the way in all likelihood no majority Jewish state. Al-Husayni and other Jew-haters seem to have had a key role in creating Israel, though that of course was not their intention.\n\nAs to the Israeli war of independence, there is no doubt whatsoever that Arab countries attacked the Jews in an effort to eliminate the newly declared Jewish state. That was their declared policy, while the Jews accepted the partition.\n\nIf you accept the UN partition, there is no doubt that this was Arab aggression. Of course, you might interpret the partition as Western agression that the Arabs were fighting against. But the Jews themselves were not the ones starting the war. They were pawns in the game, though pawns who wanted to live and were willing to fight for it.\n\nAbout the partition itself, I have just been reading about it, and it's very interesting. The first thing to understand about it is that while the Jews and Arabs were the ones doing the fighting and dying, it was the big powers who created the situation. And that was true going way back: The Arabians conquered the near East--which if I'm not mistaken is why you speak Arabic rather than Aramaic--then the Persians and Turks and finally British had their turns as powers--which is why you and I can communicate in English.\n\nIf you just focus on demonizing the Jews I think you will radically misunderstand the realities of the history, and its true lessons.\n\nAlso the idiocy and tragedy of the initial years of Bush policy in Iraq is not all there is to democracy. Unfortunately democracy is no guarantee of good leadership; it does enable you to remove bad leaders without bloodshed, but only when the society respects democratic process. That respect for democratic process in turn depends on rule of law, education, a free press, and respecting the rights of minorities. Had you had these conditions for sustainable democracy, Saddam could have never remained in power for so long.\n\nAlso there is, unfortunately, little democratic control over foreign policy. When the British were developing democracy and were prospering at home partly because of it, they were doing all kinds of horrible things as colonial power which they would never do at home. An indication of the positive power of democratic influence is that even Bush had to listen to a democratically elected government in Iraq.\n\n"
    },
    {
      "time": "",
      "content": "Until the 1970s biographies of the mufti were written by Zionists, such as Moshe Pearlman, Joseph Schechtman, and Eliahu Elath, who attempted to vilify him...  \nAnd the link you mentioned is not an exception\n\nHere are some extractions from a relatively less biased site:  \n [http://www.answers.com/topic/amin-al-husayni:](http://web.archive.org/web/20100324050042/http:/www.answers.com/topic/amin-al-husayni: \"http://www.answers.com/topic/amin-al-husayni:\")\n\nAs a Moslem scholar/leader, Husayni sought to establish an Arab state in Palestine. Unable to end JEWISH IMMIGRATION, he led a violent Arab revolt (1936-1939) against the Zionists and the British but failed, as did his attempt to STOP the creation of Israel in 1948.\n\nBecause he feared Zionism would cause the eventual domination or expulsion of the Palestinians from their homeland, he participated in an anti-Zionist demonstration in 1920.\n\nIndeed, he cooperated with the British Palestine government in the 1920s and early 1930s, attempting to change British policy by appealing to the British and by holding a General Islamic Congress in 1931 to galvanize the Arab and Islamic world against Zionism and to goad them to pressure Britain. Instead, the British allowed Jewish immigration to increase to 61,854 in 1935, which radicalized the Palestinians...\n\n\\> If you accept the UN partition, there is no doubt that this was Arab aggression.  \n1. Proven today that UN is worse than useless.  \n2. Israel+US have constantly proved to be UN-Resolutions Makers+Breakers.\n\n\\> Had you had these conditions for sustainable democracy, Saddam could have never remained in power for so long.\n\nHad US had these conditions for sustainable democracy, Saddam could have never come to power. We never asked for help. All we aske(d) not to disturb.\n\nUS created Sanyora of Lebanon against Narollah.  \nUS created Abbas of Palastine against Hamas.  \nUS created Al-Maliki of Iraq against Al-Sadr.  \n++ created ...\n\n\"Get out of our land\" has been translated into a shoe-throwing show?!\n\n\\> An indication of the positive power of democratic influence is that even Bush had to listen to a democratically elected government in Iraq.\n\nA Big Joke? Iraqis has realized that they have been fooled democratically?!\n\n"
    },
    {
      "time": "",
      "content": "Is this better? He had allot to do In planting the seed of evil in Palestine. Nazi Ideology was supported by him and his followers. Many fabrications can be made in photoshop, however this is not fake he wanted and did form an alliance with Hitler in-order to derail the Jews train to Palestine. If you do not believe me do the research.\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/mufti_6663.jpg)\n\n"
    },
    {
      "time": "",
      "content": "\\> Many fabrications can be made in photoshop\n\n... as done to the first picture you posted.\n\n2nd. In [Islam](http://web.archive.org/web/20100324050042/http:/almanar.com.lb/NewsSite/HomePage.aspx?language=en)  \n1. Fighting defensively+morally in the way of God is a must.  \n2. Starting a war aggressively for any reason is forbidden.  \n3. Working against 1+2 is hypocrisy.\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/OlMobarak_4169.jpg)\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/Tantawi_3421.jpg)\n\n4. Islam holds the Sate + Religious Authority inseparable.  \n5. The 2 heads — State + Religious Authority— could be be One.  \n6. The 2 heads complements one another.  \n7. The Religious Authority has to interfere if the State affairs worsen.  \n8. The State is not allowed to interfere in the affairs of Religious Authority.\n\nThe enemy of God exploit Religion + corrupt in the land:  \n [http://typophile.com/node/29708?page=4#comment-172838](http://web.archive.org/web/20100324050042/http:/typophile.com/node/29708?page=4#comment-172838 \"http://typophile.com/node/29708?page=4#comment-172838\")  \n [http://www.independent.co.uk/opinion/commentators/fisk/robert-fisk-the-r...](http://web.archive.org/web/20100324050042/http:/www.independent.co.uk/opinion/commentators/fisk/robert-fisk-the-rotten-state-of-egypt-is-too-powerless-and-corrupt-to-act-1220048.html \"http://www.independent.co.uk/opinion/commentators/fisk/robert-fisk-the-rotten-state-of-egypt-is-too-powerless-and-corrupt-to-act-1220048.html\")  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n1. Does your religion hold the Sate + Religious Authority separable or inseparable?  \n2. Could the 2 heads — State + Religious Authority— be One?  \n3. Should the 2 heads go complementary or in different/opposite directions?  \n4. Is the Religious Authority allowed to interfere in the State affairs?  \n5. Is the State allowed to interfere in the affairs of Religious Authority?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nShort + Accurate Answers without mix-up, please!\n\n"
    },
    {
      "time": "",
      "content": "the big question for us should be; can we help both parties with good typography?\n\n"
    },
    {
      "time": "",
      "content": "people! please take this elsewhere.  \nsome us would appreciate a respite  \nfrom the awful daily news.\n\n"
    },
    {
      "time": "",
      "content": "ak, you are at liberty to ignore this thread. We have freedom of speech here at typophile and my typophile blog is no exception. If this discussion is offputting for you then please ignore it & walk away.\n\nThis thread exists because, like all the other peeple protesting the hell on earth in Gaza, I am outraged, sickened, utterly disgusted by the violence & bloodshed.\n\nMicha—that's a nice idea, if everybody could give that some thought.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "\"Both the Palestinian Authority and Israel want a two state solution.\"\n\nThat is categorically untrue. It was always (and is) in Israels power to make two states, but it willfully chose to expand its own territory through settlements and territorial expansion using walls and Israeli citizens as a tool of colonialism. Whenever it has offered a two-state solution, it has been in terms that would be unacceptably to any state or people. To put a long story short, Israel is no different than Hamas in thinking that it owns exclusive rights to Israel and Palestinian territory, and if you think the Israelis are willing to co-exist with the Palestinians you are sadly mistaken - this is the very reason they have explicitly denied the Palestinians their right to return to their homes in Israel (and the very reason they are not recognized as citizens of any state).\n\n"
    },
    {
      "time": "",
      "content": "@ Dontbugme: ..they have explicitly denied the Palestinians their right  \nto return to their homes in Israel...\n\n... because their homes were confiscated to HIGHLY TALENTED NEW JEWISH IMMIGRANTS from Europe\n\n@ William Berkson: Had Arab leaders had a policy of tolerance and taking  \nfull advantage of the talents of the new Jewish immigrants from Europe...\n\nHope Dontbugme has answered you.\n\n"
    },
    {
      "time": "",
      "content": "Aziz, dontbugme is wrong about the history, but I don't time to post right now, and give references and links. I will later.\n\n"
    },
    {
      "time": "",
      "content": "ak—some of us enjoy the respite from the awful daily apathy. It's nice to have somewhere with a variety of sources being referenced and an open, tolerant, and intelligent discussion. If you don't want a part of it, don't click on it.\n\n"
    },
    {
      "time": "",
      "content": "I'll agree that a thread like this is dangerous, but putting it a blog is probably the only place it belongs on Typophile. Please consider this an intellectual discussion and leave play school antics at the door.\n\n"
    },
    {
      "time": "",
      "content": "AzizMostafa\n\nNo the photo's are as real as the problem that continues in Israel.\n\n\\>Starting a war aggressively for any reason is forbidden+Hamas\n\nThere are two sides to a coin\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "\"Is the State allowed to interfere in the affairs of Religious Authority?\"  \nThe struggle by religions to govern the material and by states to govern the spiritual, just is, and they work it out or not. Or, do you mean, can one country allow some of it citizens to lob rockets into Israel on Christmas Day? Or, do you mean, can a State take an equally prized parcel of holy property away from one Religious Authority and give it to another?\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "Where does typography and type design have anything to do with politics?\n\nHamas are cowards, like anyone hiding behind the veil of terrorism. Yes, Hamas are cowards, whose choice victims are innocent civilians.\n\nIt is huge hypocracy to condemn Israel's efforts to destroy Hamas, when these same voices which criticize Israel, are silent when Hamas missiles are aimed at Israeli citizens.\n\nLet us not forget that the people of Gaza elected Hamas, and support them to this day.\n\nGet off the hypocritical soap box, dump Hamas into the trash can (trash is too good for them, although they are filthy garbage), and peace will follow.\n\n(Have an easy fast.)\n\n"
    },
    {
      "time": "",
      "content": "Forty plus years HOT potato!\n\nIt is Goliah agaisnt the little guy! Interestingly enough is the timing : US is on a transition.\n\nEnd quotes.\n\n"
    },
    {
      "time": "",
      "content": "AGL,\n\nGoliah was an evil human monster. His interest was ONLY harm.\n\nKing David was the defender of Israel's honor and protector of his people.\n\nTo twist each other's role is deceitful.\n\nIn the Hagada (booklet read of Passover), we Jews state that in every generation, enemies like Hamas rise up against, and are destroyed.\n\nMay the decietful not stand in the way. Yes, you.\n\n"
    },
    {
      "time": "",
      "content": "The only solution is two create TWO countries, separate religion from state.  \nRid the country of it's evil elements on both side's.  \nThe country houses not one religion, but three major religions.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "The solution is teach Hamas that they must live with others who reject their views, namely Jews.\n\nBut can you teach an old dog a new trick?\n\nI think an Islamic fanatic who worships Jewish blood that spills can not be taught anything except when a bullet rests in his head!\n\nOnly after this happens, then the Islamic fanatic realizes that Allah wishes him or her dead.\n\n"
    },
    {
      "time": "",
      "content": "\\>Where does typography and type design have anything to do with politics?\n\nWhat excludes typographers and type designers from having an _interest_ in those who govern us?\n\nWould it be anti-democratic to note that past elections and future elections loom over this whole fiasco, and that if the enfranchised do not take an active interest in their politicians they are just as guilty as their _representatives_. The coincidence of lame ducks and the possibly-soon-to-be-unempowered is creating an atmosphere that can be exploited for the purposes of garnering positive public opinion and reaction. Would the overwhelming reaction to Hamas’ rockets have anything to do with the relatively ineffective action taken in 2006 in Lebanon where Hezbollah were almost able to claim victory by virtue of not being heavily defeated?\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "gohebrew\n\nI agree Hamas is the thorn in the lions paw, however violence solves nothing only pain.  \nIsrael, is where I want to go one day and visit both sides in peace.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "Typedog,\n\nIn an ideal world, we can turn another cheek, like Jesus taught, and Gandhi practiced.\n\nBut we live in a cruel world. Therefore, the Jewish Bible teaches us to be realistic. There are Bin Ladens and Hamas hypocrites. It teaches to destroy the enemy before they destroy us.\n\nAfter all the Hamas' and the Bin Ladens are irradicated, then we can bury violence, too.\n\n"
    },
    {
      "time": "",
      "content": "gohebrew\n\nSad but it's true. We must liquidate these evil beings.\n\nI am a Catholic and I know Christians also have it tough in the EAST.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "Tim,\n\nHere is not the place to debate these matters.\n\nInstead of coming closer through our talents, sympathizers for the \"poor Palestinian people\" become pitted against those who see it like Israel.\n\nNasrallah and his fakes, like Hamas, are only placated by their destruction.\n\nWhen we feel sorry for the people or children they stand behind, these murderous creeps rise up later to continue.\n\nMercy means to destroy them, even if the so-called innocent are destroyed as well.\n\nDo not forget that they voted in Hamas, and cheered when Nasrallah dislocated hundreds of thousands of Israeli civilians.\n\nDon't expect me to feel sorry for them.\n\n"
    },
    {
      "time": "",
      "content": "_But we live in a cruel world. Therefore, the Jewish Bible teaches us to be realistic. There are Bin Ladens and Hamas hypocrites. It teaches to destroy the enemy before they destroy us._\n\nIt's pretty sad when _both_ sides are taught that by their religions.  \nIt's even sadder when the people who are taught such things believe them to  \nthe letter and don't see through the venom and misguided pride they breathe.\n\nCan you see there are _humans_ on the other side? Humans, who live, breathe, work, talk, pray, meet friends, buy food (if they can get some), eat, sleep, crap, laugh and cry? Humans who design type, for God's sake? Humans who are scared, and humans who then suddenly live no more? –  \nI'm not trying to make you \"feel sorry for them,\" and please note that I'm not aiming to play down their crimes, their violence, their killings. I'm trying to make you see what this is, on a very basic level.\n\nPalestinians are not abstract personifications of violence, hate, and evil, \"so-called civilians\" whose _raison d'être_ is to be worthless moving covers for the Bad Guys. They are humans, and they have hope, and dreams, they have pride, and they have a sense of home. And they have a right to live. Just like you do – and rightfully so. But their feelings aren't any less rightful than yours, and that's the painful and difficult part that is sometimes blotted out by gunfire and war rhetoric.\n\nSo, which path are you going to choose? One would be for Israelis _and_ Palestinians to stop viewing each other as \"enemies to be destroyed\", but as _partners_ calling the same land their home\\*; and trying to find a way to live together in something resembling peace. That's going to be hard, and painful, and you're not going to get your way all the way.  \nThe other option of course is to attempt to kill them all, completely subjugate them, or drive them out of their homeland. Although you might consider that's been tried before; it doesn't work particularly well, and it doesn't look good either.\n\n\\* And please don't suppose I don't think _both_ sides would need to do serious homework for this.\n\nNot that I'd really still believe people would learn from history. And I realize much of this post is a hopelessly romantic appeal. But hey, it's worth a try to remind people not to realize the horror of humanitarian catastrophes only after the fact. Like what happened to the Jews themselves (and part of my own family with them, by the way). To the Armenians. Want a list?\n\nCan you see that a Palestinian's life is not any less valuable than an Israeli's?\n\n"
    },
    {
      "time": "",
      "content": "a...\n\nHypocracy.\n\nIf someone is so evil, he or she seeks your destruction, then kill them first. (Bible)\n\nIf you stand behind fake kindness, fake compassion, then you die and the evil-doer is free to do more evil.\n\nYou can not compare self-defense to murder. This is clear hypocracy.\n\n"
    },
    {
      "time": "",
      "content": "_You can not compare self-defense to murder._\n\nSo which definition applies to Israel bombing that mosque, killing the people who were praying in there?\n\nYes, that was a rhetorical question.\n\nYes, it's very easy to always be the victim. It entitles you to whatever.  \nIsrael is not the victim anymore. Israel is killing people. Israel has power. And Israel needs to learn to use it in a responsible way.\n\n"
    },
    {
      "time": "",
      "content": "If a mosque houses the Hamas terrorists, it must be destroyed. That is kindness. Because as a result, real innocent civilians will not be murdered.\n\nIt seems that this simple logic is beyond you.\n\n"
    },
    {
      "time": "",
      "content": "The Bible says that happy is the one who smashes their babies against the wall.\n\nIf that baby murders later in life, happy is the one who smashes him or her early on.\n\nDo you agree?\n\n"
    },
    {
      "time": "",
      "content": "Um… no.\n\nI also don't think we speak the same language.\n\n"
    },
    {
      "time": "",
      "content": "It's a shame that you think that kindness means allowing a murderer to live and kill another person.\n\nAfter hearing the widespread hypocracy from many people, many liberals, etc., who never spoke out when kassams reigned in Sderot year after year, but now when some Arab dies as a human shield for a Hamas terrorist, they scream and yell that Israel is the bad guy.\n\n"
    },
    {
      "time": "",
      "content": "First, let me dissociate myself from gohebrew's comments. Where in the Bible does it recommend smashing babies? That is just revolting, and I would certainly repudiate it if it says so with approval, which I very much doubt. Your interpretation of the 'rodef' law is dangerously close to that of the assassin of Yitzchak Rabin, and is false and dangerous. I hope you think better of it.\n\nFortunately, the prophets and Jewish post-biblical sages make clear that the chief Jewish values are kindness, justice and humility. Not joy in killing the \"enemy\". Even though self-defense is legitimate, it is against Jewish values to rejoice in your enemy's suffering.\n\nAziz, let me address your comments, first generally. We all have a choice about whether to see the solution of the world's problems either in effective cooperation with others different from us, on one hand, and, on the other hand, in destroying our \"enemies\". The dividing the world into \"us\" and \"them\", the enemy, is the first step to dehumanizing others, and giving an excuse for brutality and suffering.\n\nThe \"us and them\", black and white thinking is also destructive of peace, prosperity, and love.\n\nI see the same kind of \"us and them\" thinking in your comments, and in gohebrew's comments. In your case, you seem to think that stopping Jewish immigration into Palestine was sufficient justification for al-Husayni's leading anti-Jewish riots, and seeking Hitler's help. (For the latter, see the Telegram from Himmler to Husayni in the Wikipedia article.)\n\nI, on the contrary, think that is exactly the kind of backward, tribal, us-and-them thinking that keeps the middle east in war and the Arab peoples in poverty. It is leaders who exploit nationalism to keep in power and control the populace, against its own true interests.\n\nAs I said, the US has been at times far more enlightened as concerns immigration. Currently, about 10% of US residents are foreign-born. And during one earlier period great immigration, 1890-1910, millions of Jews came to the US, including my grandparents. While we have our scoundrels also--such as the infamous Madoff--the US as benefited greatly from this immigration, as well as from immigrants from other groups all over the world.\n\nFor example, one of those immigrants was the Jewish (but irreligious) John von Neumann, the math genius who invented the architecture of the computer you are using to design your Arabic fonts. Cooperation = productivity.\n\nThe key issue to me is the ability to see the faults and sins of your own group, and the humanity and merits of the other. That is the foundation of peace and cooperation, and I am saddened that I haven't read in any of your comments acknowledgment of the evil done by anti-Jewish Arab terrorists, or of the good done by Jews in Israel and around the world.\n\nI am sickened by the current war, and do fault Israel for its settlement policies under Begin and Sharon. I don't know enough about the situation to know whether the current war could have been avoided by wiser Israeli policy. But I certainly do see the Hamas policy of attacking Israel with the declared intent to destroy it, even after Israeli withdrawal from Gaza, as very wrong.\n\nI pray that both sides will be able to think beyond \"us and them\", and make peace.\n\n"
    },
    {
      "time": "",
      "content": "I don-not want to offend my Jewish brothers in any way, but smashing babies against the wall is something Nazis did in order to silence crying children.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "I don-not want to offend my Jewish brothers in any way, but smashing babies against the wall is something Nazis did in order to silence crying children.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "I don-not want to offend my Jewish brothers in any way, but smashing babies against the wall is something Nazis did in order to silence crying children.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "WTF? why is this site so slow and I have a fast connection.\n\n"
    },
    {
      "time": "",
      "content": "Typedog, I found the passage that Gohebrew refers to.\n\nIt is at the end of Psalm 137. This poem is a bitter lamentation and cry for vengeance by those who were themselves subject to mass murder and exile from Jerusalem into Babylon. It begins with the famous lines about weeping by the waters of Babylon, and concludes by crying out for vengeance against those who urged the Babylonian armies to killing and destruction. Here are the concluding lines in the recent translation of Alter: \"Recall, O Lord, the Edomites, on the day of [the destruction of] Jerusalem, saying \"Raze it, raze it, to its foundation!\" Daughter of Babylon the despoiler, happy who pays you back in kind, for what you did to us. Happy who seizes and smashes your infants against the rock.\"\n\nIt is a total perversion of Judaism to read this as anything but a cry of despair. It is never interpreted as a divine commandment. On the contrary, the Torah is generally against vengeance, having many passages against it. The exception is a defensive war, but even there, strict limits exist, including doing everything to avoid the death of non-combatants. The written Torah was interpreted extensively in later Jewish tradition, generally pushing everything in the direction of being as humane and peaceful as possible, while preserving the right of self-defense.\n\nIndeed, in the current war the Israeli phone calls to civilians to vacate anything to be bombed is a reflection of Jewish law on protecting non-combatants.\n\nUnfortunately today's weaponry is so powerful and hard to control that it often kills non-combatants, against traditional Jewish law. This leads to difficult moral dilemmas even for the most conscientious leaders of a war. (Of course Hamas has no problems about targeting non-combatants, including any Jew around the world they feel like targeting.)\n\nHere is a very thoughtful discussion of Jewish and other views on war, in the current context of the Israel-Palestine wars:\n\n[http://www.gmu.edu/departments/crdc/docs/j\\_limitsofwar\\_and\\_cr.html](http://web.archive.org/web/20100324050042/http:/www.gmu.edu/departments/crdc/docs/j_limitsofwar_and_cr.html \"http://www.gmu.edu/departments/crdc/docs/j\\_limitsofwar\\_and\\_cr.html\")\n\nIn crediting the Israelis for their efforts to limit civilian casualities, I am not saying that this war was necessary. It may well have been, but I just don't know enough to judge the situation from this distance.\n\nI do know that it is horrible and sickening. I fear that nothing good will come of it, though I would be very happy if it turns out to be the last battle of a 60 year war.\n\nIn any case I pray for the safety of non-combatants, and for a quick and lasting peace.\n\n"
    },
    {
      "time": "",
      "content": "William Berkson\n\nThank you for the most useful website link.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "William,\n\n\\> First, let me dissociate myself from gohebrew’s comments. Where in the Bible does it recommend smashing babies?\n\nI am surprized that you are not familiar with this famous statement from King David. Over a million Jews say it daily, as we recite it as an introduction to the Grace After Meals in chapter 137, verse 9. Look it up.\n\nHow can the Bible advise such a cruel response to a seemingly innocent baby?\n\nIf you knew that baby would eventually grow up and murder your grandchildren as a suicide bomber, you would then see that act of smashing as true kindness.\n\nHamas would prefer that you think otherwise.\n\n"
    },
    {
      "time": "",
      "content": "Typedog,\n\n\\> I do not want to offend my Jewish brothers in any way, but smashing babies against the wall is something Nazis did in order to silence crying children.\n\nOffense is based upon understanding. The Nazis smashed babies out of cruelty and hatred.\n\nWhen the Bible advises this extreme behavior, the aim, is not cruelty and hatred. Rather, the goal is pure kindness and compassion.\n\nIn order to prevent later cruelty and hatred, such as action is recommended, recommended, now.\n\n"
    },
    {
      "time": "",
      "content": "Again, Judaism is NOT Christianinty.\n\nWe reject fake kindness. We look at the whole picture. That's why we are longing lasting people, because we seek to embrace the truth.\n\n"
    },
    {
      "time": "",
      "content": "William,\n\n\\> It is a total perversion of Judaism to read this as anything but a cry of despair.\n\nWhere do you invent your interpretations?\n\nAyn am haaretz chossid. (Pirkei Avot)\n\nTrue, the superficial meaning is as you say. But sheeveem pahneem leTorah, Torah has many explanations.\n\nIf any decent human being realizes that mass destruction will come through a seemingly innocent party, certain that decent human being will desire to erradicated that innocent party.\n\nI am certain every decent person will desire this, for it is pure and simple logic.\n\n"
    },
    {
      "time": "",
      "content": "GoHebrew, you have not read my discussion of the passage, above. Your reasoning about it--\"If you knew the baby would grow up\" etc.--is odious and would license every kind of cruelty. It is the reasoning of dogmatists and fanatics. It assumes that you are both certain to be right, and certain about the future--both of which are impossible, but fanatics regularly assume they know. This arrogance licenses war and cruelty.\n\nSuch reasoning is not part of Jewish law, and it is very irresponsible to misrepresent it as you have. It gives a very false and perverted impression of Jewish tradition.\n\nSuch statements are not scholarship or piety, but poisonous rubbish. Read Rabbi Gopin's thoughtful and fair discussion of these issues, linked above.\n\n"
    },
    {
      "time": "",
      "content": "William,\n\n\\> In any case I pray for the safety of non-combatants, and for a quick and lasting peace.\n\nI pray that Hamas and all evil-doers are destryoed forever.\n\nI disagree with your phrase: \"non-combatants\". This is real cruelty. If one wishes that innocent Israelis should die, then I pray they die a cruel death first.\n\nAccording to the Bible as explained in the Talmud, lasting peace refers to demonstration superior strength to your enemy, so that he sees it doesn't pay to start up with you.\n\nWhat you are stating has no basis in Torah. Perhaps, only in Christianity and liberal non-religious thinking.\n\n"
    },
    {
      "time": "",
      "content": "Bill,\n\nCome on. You know what I'm saying.\n\nIf an Arab wants to kill a Jew, it is a mitzvah, a mitzvah, to kill him first.\n\nMaybe, a goy in Swiss. can not relatee, but you should.\n\nWhy did G-d instruct us to eradicate Amalek, even their babies? Why was King Saul punished when he negleced to do so?\n\nI'm not advocating a license to kill babies, just those that will end up murdering Jews. Are you such a liberal non-religious Jew to prefer not to see this?\n\n"
    },
    {
      "time": "",
      "content": "gohebrew\n\nAs far as religion are you saying Christians and our beliefs are fake?\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "\\>What you are stating has no basis in Torah.\n\nGohebrew, read Rabbi Gopin's essay, above and see the plentiful basis. He has the references to Torah and Talmud and Maimonides: go, read and learn, and stop spouting rubbish.\n\n"
    },
    {
      "time": "",
      "content": "Typedog,\n\n\\> If America and all its allies turn its back on Israel, Israel would be nothing. As far as religion are you saying Christians are fake and our beliefs?\n\nFirst, I believe that even if America and its allies turn its back..., I trust G-d would do open miracles for Israel, like in the Six Day War and when Irag sent 39 missiles over Israel. America and its allies support Israel for their own interests.\n\nNo, I am not saying this at all. The Talmud advises us to accept wisdom from every source, not only Jewish. There are many great wise terachings from Jesus, and great examples of selfless humanity from among the Christians.\n\n"
    },
    {
      "time": "",
      "content": "_\"Maybe, a goy in Swiss. can not relatee, but you should.\"_\n\nI suspect anyone who hasn't been brainwashed by hate speech can not relate.\n\n"
    },
    {
      "time": "",
      "content": "altaira,\n\n\\> I suspect anyone who hasn’t been brainwashed by hate speech can not relate.\n\nI personally agree that truth is universal.\n\nSome 'goyim' and also Jews by birth are 'pig-headed', and refuse to believe the truth even when it stares them in the face.\n\nWe are promised that if we conduct our life in accord with either 613 mitzvot or 7 Noahide laws, then these truths become easy to accept.\n\n"
    },
    {
      "time": "",
      "content": "gohebrew\n\nUnderstood, Thank you for clearing things up and yes I believe in GOD miracles.  \nAs far as the Six Day War yes it was a blessing from GOD.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "Bill,\n\nI read the article.\n\nBesides being long winded, like many scholarly papers, I failed to see the basis in Torah writings. It seemed closer to his own thinkin, with a few scattered sources. It you looked at his footnotes, he fails to show how even one source applies to his point.\n\nPerhaps, you want to summarize in a few paragraphs his main points.\n\nWhat I presented above is pure and simple logic. No Israeli wants to go to war, to conquer, to die in battle. All Israelis would much rather picnic with their families.\n\nI think that the tolerance level for Hamas crap and their missiles led Israel to say, 'enough is enough'.\n\nWhen Hamas is destroyed, and Palestinians want to coexist, there will be lasting peace. In the meantime, those that seek Israel's destructiom will be destroyed.\n\n"
    },
    {
      "time": "",
      "content": "Israel, Gopin is an Orthodox Rabbi as well as an academic expert on negotiation and peace. He has very extensive knowledge of the sacred texts on this issue. In his article he only cited the most key ones, because his audience were not Torah scholars.\n\nI see now that Gopin is on the Board of Brit Tzedek v'Shalom, the pro-Israel pro-peace organization.\n\nI listened to [this long discussion](http://web.archive.org/web/20100324050042/http:/btvshalom.org/resources/20090107_au.html) of the current situation, which he did in a phone call from Jerusalem to Brit Tzedek people in the US. I felt for the first time that I was starting to understand what is going on.\n\nI would be interested in what Aziz's reaction to it is. It is, as you say, long winded, but very good also.\n\nI found his statement that the key to progress involves \"deep compassion for both sides\" moving and true, and what I was trying to say to Aziz above.\n\nAs to \"pure and simple logic\", I don't think you understand logic, because your argument is anything but logical. I will post later on this, and also answer Aziz's question on religion and state.\n\n"
    },
    {
      "time": "",
      "content": "\\>Here is not the place to debate these matters.\n\nBut it is apparently the place to promote infanticide.\n\n\\>Do not forget that they voted in Hamas\n\nI had not forgotten that either.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Israel, you quote sources with such adeptness, I fear that someone may think that you actually understand them. As far as I'm concerned you show about as much understanding as my neighbor's cat.\n\n\\>If an Arab wants to kill a Jew, it is a mitzvah, a mitzvah, to kill him first.\n\nNo it is an averah, a sin, known as murder. You are NOT permitted to kill someone for what they think or want. If someone raises a knife to me I am permitted to stab him first, or raises a gun to shoot me, can shoot him first. But that is something he DOES, not thinks, and it puts me in immanent danger of losing my life. Only then is lethal self-defense permitted. Even then, Maimonides says that if I have another way to stop him, it is murder if I don't instead use the non-lethal method to stop him.\n\nI'm sure my wife wanted to kill me quite a few times, but that doesn't give me permission to kill her first. By your standards, every husband and wife would be dead in short order.\n\n\\>I’m not advocating a license to kill babies, just those that will end up murdering Jews. Are you such a liberal non-religious Jew to prefer not to see this?\n\nNo, I prefer not to advocate wickedness. You don't know what that baby will do when he or she grows up and it is height of arrogance and wickedness for anyone to decide in advance that an innocent baby will one day deserve death, and to act on that now. That is terrorist thinking, and everyone should repudiate it.\n\n"
    },
    {
      "time": "",
      "content": "Bill,\n\n\\> No it is an averah, a sin, known as murder. You are NOT permitted to kill someone for what they think or want.\n\nThis is clearly inaccurate according to Torah or Biblical law.\n\nSee Rashi's commentary about Abraham, when non-Jews merely plotted in their thoughts to harm him. As a result of these wrongful thoughts, thoughts, they were rendered 'chayav meetah m'ya'dei shamayim' - they are liable for heavenly death.\n\nAlso, the law in Shulchan Orech regarding non-Jewish bandits who seek to steal wheat on the border, then even if the day is the Sabbath,and the victims are law-abiding Sabbath-observant folks, nevertheless Shulchan Orech instructs the victims to exit their home on the Sabbath, and kill, yes kill, the non-Jewish bandits on the Sabbath. Why? If they only intended to steal, really they also intended to kill.\n\nJudaism promotes murder if the purpose is save Jewish life, regardless of whether you think it's mennshickiet or not.\n\n"
    },
    {
      "time": "",
      "content": "Bill,\n\n\\> I’m sure my wife wanted to kill me quite a few times, but that doesn’t give me permission to kill her first. By your standards, every husband and wife would be dead in short order.\n\nThis is foolish. As an intelligent articulate person, how cn you present such silly argument?\n\nDomestic tranquilty, knowns as 'shalom bait', is the aim of observing every detail of Torah laws. The goal is not to promote watton murder of the heads of a household, but rather to do almost everything tobring the coupl together. Look at Moses' older brother Aaron who even lied to bring a couple to love each other again.\n\nDon't you know this story?\n\n"
    },
    {
      "time": "",
      "content": "William,\n\n\\> ... is terrorist thinking, and everyone should repudiate it.\n\nRepudiate. Big deal!\n\nERADICATE. Are you going to shake your finger at a Hamas terrorist, as he pulls the trigger to kill you.\n\nIs this Reform Judaism? No wonder it is shrinking year after year? In the end, it will simply become another form of modernday Christianity!\n\n"
    },
    {
      "time": "",
      "content": "timd,\n\n\\> the place to promote infanticide\n\nAn Israeli baby in Sderot doesn't count. Only a poor Palestinian.\n\nThe Israeli baby may be murdered by a Hamas missile, but heaven forfend if the Palestinian baby is hurt. His or her p[arents who raiise him or her to become a suicide bomber is really innocent, just a product of his or her poverty.\n\nBut the Israeli baby deserves to dies, because he or she has a few bucks.\n\ntimd, is thathow you think?\n\n"
    },
    {
      "time": "",
      "content": "Israel, Rashi's commentary is about what GOD decided to do, not what men and women are permitted to do. It doesn't surprise me that you mix up Man and God, given that the rest of your analysis is so muddled. I have had enough, and won't track down how you've misinterpreted the passage from Shulchan Aruch.\n\nI really hope another Chabadnik will come on here and repudiate your pseudo-scholarship. Meanwhile, have a peaceful Shabbat, and I hope next week you'll stop posting this hateful stuff.\n\nAnd yes, though I don't know whether Israel should have started this latest battle, I pray that they win a better situation afterwards: no rockets coming into the South, and no suicide bombers. I also pray that the leaders in Gaza will be devoted to building up their people, instead of being obsessed with tearing down Israel.\n\n"
    },
    {
      "time": "",
      "content": "gohebrew, some link to help you to open your mind.\n\n[History of the Jews in Morocco](http://web.archive.org/web/20100324050042/http:/en.wikipedia.org/wiki/History_of_the_Jews_in_Morocco)  \n [The Jews of Morocco](http://web.archive.org/web/20100324050042/http:/www.sefarad.org/publication/lm/017/morocco.html)  \n [Pact of Umar](http://web.archive.org/web/20100324050042/http:/en.wikipedia.org/wiki/Pact_of_Omar)  \n [Islam and Judaism](http://web.archive.org/web/20100324050042/http:/en.wikipedia.org/wiki/Islam_and_Judaism)\n\n"
    },
    {
      "time": "",
      "content": "\\>timd, is thathow you think?\n\nNo, that is your interpretation of how I think. I would never consider that killing babies is a solution. I believe you suggested it, by justifying those actions to preserve your grandchildren you justify the actions of your _“enemies”_.\n\n_The Bible says that happy is the one who smashes their babies against the wall._\n\nIf that baby murders later in life, happy is the one who smashes him or her early on.\n\nIf you knew that baby would eventually grow up and murder your grandchildren as a suicide bomber, you would then see that act of smashing as true kindness.\n\n"
    },
    {
      "time": "",
      "content": "[http://podblanc.com/video-holocaust-lies-told-by-zionists-now-public](http://web.archive.org/web/20100324050042/http:/podblanc.com/video-holocaust-lies-told-by-zionists-now-public \"http://podblanc.com/video-holocaust-lies-told-by-zionists-now-public\")\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/rumsfeld-saddam_4620.jpg)\n\n"
    },
    {
      "time": "",
      "content": "In order to logicaly debate, the issues upon which we disagree must be delineated and understood, and the issues upon which we agree must also be delineated and understood.\n\nWhat do we agree upon?\n\nThe currently ruling government in Gaza of Hamas rejects Israel's right to exist, and has acted violently to murder Israelis for many years through missiles and suicide bombers.\n\nIf Hamas ceased to exist or be of no influence upon the Gazan people, then there would be no more war in Gaza, and the Israelis would harm no one anymore in Gaza.\n\nDo we agree upon this?\n\nDoes Israel have the right to defend its people?\n\nIf Hamas hides behind the Gazan people, does Israel have a right to defend its people, even if Gazans will be harmed or killed in the process of innocent Israeli people?\n\nUpon what do we disagree?\n\nI agree that no human being can decide that a baby will ultimately become a murderer or a suicide bomber, and be killed still as a baby.\n\nNo ordinary human being is so endowered in determining the future.\n\nMy point is with regard to clear obviously factors. What are those? They are nothing that we are familiar with.\n\nIn Torah laws, there is a distinction between chayav mitah b'yadei shamaya'im, and ...b'yadei adam.\n\nIn the example of Abraham, this is a case of chayav mitah b'yadei shamaya'im, where a person is liable to be killed through the agency of heaven. Certainly, a nation which seeks the destruction of Israel is in the category of being liable to be killed through the agency of heaven.\n\nIn the case brought in Shulchan Orech and quoted repeatedly by the late seventh Lubavitcher Rebbe of thieves who steal wheat on a border town, this is a case of people who are liable to be killed through the agency of people. Certainly, a nation which seeks to harm Israel is in the category of being liable to be killed through the agency of people.\n\nNo Chabadnik, like no yirat shamayim, would dispute these words.\n\nI also hope that Israel's enemies are completely eradicated. I hope the Palestinians too have a government interested in making people, and having a people grow to their true potential.\n\n"
    },
    {
      "time": "",
      "content": "Aziz,\n\nThe source that you bring above is white supremacy trash. Do you really adhere to the nonsense?\n\nI thought that you are more intelligent than beinving such lies.\n\nThe Quran rejects this garbage, and similar untruths which cause people to hate each other.\n\nWhen people live together in harmony, love, and truth, the differences between us is never interfere. A trully beautiful piece of art is not bland, but weaves different colors and patters together.\n\nOnly the foolish leader in Iran promotes such a lie. I am really shocked that you bring this link.\n\n"
    },
    {
      "time": "",
      "content": "It's  \n垃圾  \n쓰레기  \nотброс  \nbasura  \nGarbage  \n-----\\>\\>Whttp://podblanc.com/video-holocaust-lies-told-by-zionists-now-public\n\nGuerrizmo+Design\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/new7_jpg_4796.jpg)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/US-UN_5542.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I guess if the poor Palestinians can not defend themselves through missiles aimed at civilians or suicide bombers, then they are helpless. Yes, poor poor Palestinians.\n\nNo wonder that they say 'war is hell'!\n\n'I guess that they could always move into Aziz's house. But I'm sure that his wife wouldn't want 'em.\n\n"
    },
    {
      "time": "",
      "content": "AzizMostafa\n\nSo do you believe now? You brought up the past history with bias point of view. I showed you the the parts of history you neglected to show along with your claim.\n\ngohebrew\n\nWhy are you so angry? It is a crime when an innocent child (people) falls victim to war no matter what side. Having said that it is not a crime to liquidate terrorist, suicide bombers, and , any other merchant of chaos.\n\nGuerrizmo+Design\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/muftiattrench-1_4891.jpg)\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/bosnia1_4049.jpg)\n\n ![](http://web.archive.org/web/20100324050042im_/http:/typophile.com/files/ss008_6404.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Typedog,\n\nWhy am I angry?\n\nI am angry due to widespread hypocracy.\n\nReal type designers are creative folks, and creativity requires attention to detail and intellectual honesty.\n\nYet, here intellectual dishonesty is widespread.\n\nTo sympathize with the poor Palestinians on account of Israeli aggression exists in the same breath as condemnation of Israeli civilians, even if they are school children, because Israel's army is stronger that Hamas and do not deserve our pity.\n\nWhen the Israel Defense Force systematically destroys Hamas, these creative giants shout in protest. The poor Palestinians are being harmed!\n\nLet's us recall that Hamas came to power because of these same Palestinians. Let us not forget that when Iraq threw SCUD missiles to destroy innocent Israelis, but were miraculously saved by open miracles from G-d, while the Palestinians danced on roof-tops, hoping the missiles would kill innocent Israelis. On 9/11, these same Palestinians distributed candies to their children, as Allah was great and innocent people died in the US. Aziz can confirm this sick custom.\n\nSo, do you understand my anger at such hypocracy? Do you understand why I have not even a drop of sympathy for the Palestians?\n\nIf Hamas are buried in mass graves together with the poor Palestinians, then after a very short time, nobody in Europe will blink an eye. Their death will be quickly forgotten. So, we see how limited is their concern.\n\n"
    },
    {
      "time": "",
      "content": "Though the game was over with you:  \n [http://typophile.com/node/48217?page=9#comment-301298](http://web.archive.org/web/20100324050042/http:/typophile.com/node/48217?page=9#comment-301298 \"http://typophile.com/node/48217?page=9#comment-301298\")  \nBut you like playing more games.\n\n\\> Let’s us recall that Hamas came to power because of these same Palestinians.\n\nSo you don't care if Palestinians elections were democratic!  \nDemocracy is what Israel decides it is?!\n\n\\> When Iraq threw SCUD missiles to destroy innocent Israelis ...  \n... the Palestinians danced on roof-tops  \n\\> On 9/11, these same Palestinians distributed candies to their children.\n\n1. The 2 above-mentioned crimes were not commmited by Palestinians.  \n... You know better who!  \n2. The so called \"Israelis\" are not innocent.  \n.... They made Palestinians homeless+prisoners in their homeland?  \n [http://typophile.com/node/53099#comment-320712](http://web.archive.org/web/20100324050042/http:/typophile.com/node/53099#comment-320712 \"http://typophile.com/node/53099#comment-320712\")  \n3. Non-Palestinians danced also, will you launch more aggressions on non-Israelis?! Or you are too tolerant with Non-Palestinians?\n\nHope you understand my anger at such hypocracy?\n\n\\>\\> If Hamas are buried in mass graves together with the poor Palestinians,  \nthen after a very short time, nobody in Europe will blink an eye.  \nTheir death will be quickly forgotten.\n\nSummarized here:  \n [http://podblanc.com/video-holocaust-lies-told-by-zionists-now-public](http://web.archive.org/web/20100324050042/http:/podblanc.com/video-holocaust-lies-told-by-zionists-now-public \"http://podblanc.com/video-holocaust-lies-told-by-zionists-now-public\")\n\n"
    },
    {
      "time": "",
      "content": "gohebrew\n\nSo then your no better then Jewish separatist (criminals), I should of known this before hand.\n\nAzizMostafa\n\n\\> On 9/11, these same Palestinians distributed candies to their children-----\\> such bull shit!\n\nAgain you keep putting up that biased web link with no credibility.  \nI sympathize for the victims who become collateral damage.\n\n"
    },
    {
      "time": "",
      "content": "Aziz, why do you think that that web site has any credibility? It is by white racists and neo-Nazis who have as much contempt for you as for me. It is full of lies.\n\nBy linking to that, it seems to me that you are just looking for reasons to hate, not to understand both sides, and get to peace.\n\nIf you want to understand the thinking of a liberal Jew who is sympathetic to Israel and also treasures Palestinian lives and sincerely wants peace, I can help you. If you just want to collect reasons to hate, no matter how false or incredible, I can't help you.\n\nHere is what your new \"friends\" are up to [in France,](http://web.archive.org/web/20100324050042/http:/unitywebring.com/unity/?p=591) and [here is what they are doing in Germany.](http://web.archive.org/web/20100324050042/http:/www.islamophobia-watch.com/islamophobia-watch/2008/6/22/nazis-attack-german-muslims.html)\n\n"
    },
    {
      "time": "",
      "content": "... and in Australia too!  \n [http://www.barossa-region.org/Australia/The-Israel-Lobby........Jon-Kore...](http://web.archive.org/web/20100324050042/http:/www.barossa-region.org/Australia/The-Israel-Lobby........Jon-Korein.html \"http://www.barossa-region.org/Australia/The-Israel-Lobby........Jon-Korein.html\")  \nSorry William Berkson , I am a bit calculative.\n\n"
    }
  ]
}
