{
  "id": "5311",
  "title": "Design Studio Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I would love some feedback on my logo for my freelance design studio (Makaio Design). I do have a feminine edge to much of my design which is reflected in this logo; I am concerned that it might be too feminine? Or does it communicate refined, artistic elegance?   \n   \nI design a broad range of projects including identities/ websites/ print/ invitations & announcements/ as well as freelance photography (mostly portraits and still life).   \n   \nI welcome all input! Thanks.   \n   \n ![](http://web.archive.org/web/20131020164131im_/http:/www.typophile.com/forums/messages/29/38907.jpg)   \n   \n ![](http://web.archive.org/web/20131020164131im_/http:/www.typophile.com/forums/messages/29/38908.jpg)\n\n",
  "author": "sbarlow",
  "time": "21 Jun 2004 — 9:27pm",
  "uid": "4035",
  "comments": [
    {
      "time": "21 Jun 2004 — 10:09pm",
      "content": "What does makaio represent? Is your studio in Hawaii? Or Japan? I don't think the design feels too feminine at all.   \n   \n\"design\" seems to be sinking to the right. Either rotate a smidgen counter clockwise or raise the whole word a little.\n\n"
    },
    {
      "time": "22 Jun 2004 — 8:14am",
      "content": "Ah . . . the story behind the name . . .   \n   \nIn the extensive \"research\" of names for my son, I came across the name \"Makaio\" ?x?+x?P?that means \"gift from God.\" I loved the name and the meaning, but my husband didn't like it for our son's name, so I adopted it for my company.   \n   \nThanks for the feedback about \"design\" sinking, I will definitely make adjustments to fix that.\n\n"
    },
    {
      "time": "22 Jun 2004 — 8:30am",
      "content": "woah, I don't know what happened with that crazy \"?x?=xP?\" thing up there . . . what that said was that Makaio is a Hawaiin name . . .\n\n"
    },
    {
      "time": "30 Jun 2004 — 9:18am",
      "content": "I have made a few modifications:   \n- I tilted \"design\" like Scott suggested   \n- I have also shown two samples here, one with without the shading (the top ones)   \n- I have also debated on whether the white \"streak\" on the top petal is distracting (so the bottom ones have this adjusted)   \n   \nDoes anyone have any input or suggestions?   \n   \nThanks!   \n   \n ![](http://web.archive.org/web/20131020164131im_/http:/www.typophile.com/forums/messages/29/39625.gif)\n\n"
    },
    {
      "time": "2 Jul 2004 — 3:06am",
      "content": "I would recommend two changes:   \n   \n1   \nYou could say that there are three points of interest in the design (a)the typeface/calligraphy contrast (b)the picture/words contrast (c)the fact that the 'o' is handwritten.   \nWhy is the 'o' handwritten? If there isn't a good reason for it, it would change it to regular type. In that way the two other points of interest seem stronger.   \n   \n2   \nI would move the illustration just a bit away from the lettering, in northwestern direction. As it is now, the southeast corner of the square fits just snugly over 'ak' and 'm' is precisely aligned with the vertical division of the square. It seems cramped/crowded when you align things like that ... at least in my opinion.   \n   \n--   \nS\n\n"
    }
  ]
}
