{
  "id": "53112",
  "title": "Proto-neoclassical roman",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A few months ago, there was a [lively discussion](http://web.archive.org/web/20150123190342/http:/www.typophile.com/node/37310) -- taking off orthogonally from a discussion of Noordzij's distinction between rule and law -- regarding the origins of the English neoclassical style of type associated with John Baskerville. During this, James Mosley brought to our attention a plate from George Shelley's _Alphabets in all the hands_ of 1715, along with Beatrice Warde's observation that ‘Baskerville was only the first to admit into the typefoundry a type that had been clamouring outside its door for at least half a century.’\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Shelley1715_5145.jpg)\n\nThis sent me in search of other examples of neoclassical roman letters among the works of writing masters, and the earliest I found was in an earlier work by Shelley: _Natural Writing in all the Hands, with Variety of Ornament_ of 1709.\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Shelley1709_3900.jpg)\n\nWhat struck me about Shelley's roman letters, even in the earlier, rougher example, is how mature the style seemed, and I wondered if Shelley could claim to have invented this form of written letters, or only to have perfected it.\n\nRecently, I came across _The Pen-man's Paradise_ of 1695 by John Seddon (in a fine facsimile edition produced by Jan Tschichold in 1966), which contains these two examples of what I will call proto-neoclassical roman:\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Seddon1695_5514.gif)\n\nThe larger example at the bottom occurs on the title page of the book, amid various other styles, and the specimen above in a plate dated 1695 (a few plates in the book are from the previous year or undated). There are many interesting aspects of this. I call it proto-neoclassical because some of the characteristics that we associate with neoclassical letters are only shakily present: the axis is predominantly vertical, or close to vertical, but is not consistent; the lowercase y is a form rejected from the mature style, as are the serifless descenders on p and q. On the other hand, if one looks at the lowercase a and g, one sees immediately the characteristic forms that we identify as 'Baskerville'.\n\nSeddon was born in 1644 and died in 1700. He was a master at Sir John Johnson's Free Writing School at Priest's Corner, Foster Lane, London. _The Pen-mans Paradise both Pleasant and Profitable_ was the second of three exemplars with which he is associated, the previous being _The Ingenious Youth's Companion_ of 1690. The plates in both volumes were engraved by one John Stuart.\n\nThe third book bearing Seddon's name was published posthumously in 1705 under the title _The Penman's Magazine,_ but what is most interesting and exciting about this book is that only the decorative flourishes were by Seddon: the writing exemplars were by George Shelley. The subtitle of the book is _a new copy-book, of the English, French and Italian hands, after the best mode; after the originals of John Seddon. Perform'd by George Shelley._ So there is a direct connection between the proto-neoclassical roman of John Seddon and the fully mature style written by George Shelley. Given Shelley's dates (c.1666–c.1736), we can assume that he knew Seddon personally; certainly he was familiar with Seddon's published works.\n\nI hope to track down copies of the 1690 and 1705 books.\n\n",
  "author": "John Hudson",
  "time": "3 Jan 2009 — 9:39am",
  "uid": "1262",
  "comments": [
    {
      "time": "3 Jan 2009 — 10:18am",
      "content": "Here is a higher resolution scan of the Seddon roman:\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/SeddonLarge_6291.gif)\n\n"
    },
    {
      "time": "3 Jan 2009 — 12:22pm",
      "content": "Good work, John.\n\nI found the 1705 Seddon in the Library of Congress catalog (Z43 .S395). I’ll take a look at it when I get back to DC (after Jan. 10). It looks like I can access it in the general reading room, so I might even be able to get pictures or go back with a scanner. If you want to correspond with the librarians to see if they might have the 1690 and I just can’t find it I’ll look at it, too.\n\n"
    },
    {
      "time": "3 Jan 2009 — 8:19pm",
      "content": "That's great, James. I'm very keen to see how Shelley ‘perform’d’ Seddon’s roman.\n\nThe idea of performing a script is a nice one, and not metaphorical (or not only metaphorical). In linguistics, there are concepts of competence and performance that can be applied directly to writing (Tom Milo has made good use of these in his analysis of Arabic writing).\n\nI reckon that if we were to collect together all the specimens of George Shelley’s writing between 1695 and 1715 we would see the maturation of this style of lettering into the form that, some decades later, John Baskerville asked John Handy to cut as type. What I'm intrigued to know now is how soon in that period Shelley began perfecting what John Seddon had, apparently, initiated.\n\n\\_\\_\\_\n\nOn a related topic, it occurs to me that because of its origin in the commercial and educational exemplars of the writing masters, the neoclassical roman is -- in the normal typographical way of looking at things -- unusual in that it postdates the development of the neoclassical italic. Seddon's roman plate also includes an italic, of which I can post a scan if people are interested. It didn't seem to me terribly interesting, though, because a far more accomplished neoclassical italic is already fully evident in _Les Ecritures Financiere, et Italienne-Bastarde_ of Louis Barbedor (1647), in a form that is recognisably the model behind Fournier's italic types.\n\nThere is a single plate in the Barbedor book showing a roman specimen, but although the letteforms display some influence of the split nib pen, they are essentially oldstyle.\n\n[There is another interesting aspect to Barbedor's book: the specimens of non-Latin scripts at the end of the book are identical to those produced by George Bickham at the end of _The Universal Penman_, almost a hundred years later. Only the arrangement on the page and the quality of the engraving differs: the sample texts and letterforms are exactly the same. This leaves me wondering if Barbedor was the first to use these, or if he too copied another master, and whether Bickham copied them directly from Barbedor, or from another, intermediate copy. In any case, I used to think that Bickham was the first—and perhaps only—person to have attempted to write Arabic with a split nib, but apparently it was Barbedor, or someone else in the 17th century.]\n\n"
    },
    {
      "time": "4 Jan 2009 — 1:08am",
      "content": "_...its origin in the commercial and educational exemplars of the writing masters..._\n\nWhat of other media?  \nEngraving, for instance, or lapidary inscriptions such as on grave stones.  \nPerhaps there was more cross-pollination between those media than with typography.  \nYou would have to examine the style of lettering on engraved book title pages contemporary with and before Seddon, to verify your pen-driven theory.\n\nBaskerville must have been aware of Pine's famous \"completely engraved\" Horace, in which all the text was hand engraved, rather than typeset. Pine's style was neoclassical. I don't have an example of the text, but here is the title page:\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Pine1_5874.jpg)\n\n"
    },
    {
      "time": "4 Jan 2009 — 11:45am",
      "content": "Nick, I certainly don't discount either engraved or carved lettering from the development of neoclassical type, although in terms of grave stones I have not seen anything as directly linked to the Baskerville style as is evident in the writing exemplars. But the engraving and the stone carving themselves need to be seen in the context of the pen because the split nib had, before the mid-17th Century, almost completely replaced the broad nib in European text production. The split nib defined the relationship of thick and thin strokes that are one key aspect -- and certainly not the only aspect -- of neoclassical (and later romantic) lettering. It is this that made it possible for Barbedor to produce, by pen, something akin to Fournier's neoclassical italic more than a hundred years prior.\n\nPine's title page is grand. It is also 1733, by which point we have ample evidence of the neoclassical roman being a _standard style_ offered and taught by the writing masters. I agree that it would be a good idea to look at engraved title pages of the late 17th Century, around the time that Seddon was writing: there may well have been cross-fertilisation. On the other hand, the split nib had been in use, and increasing dominance, for over a hundred years at that point, and I don't think it is possible to extract an origin for neoclassical letters independent of the influence of that tool on the textual aesthetics of the age.\n\n"
    },
    {
      "time": "4 Jan 2009 — 1:12pm",
      "content": " ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Qwho_6704.png)\n\n"
    },
    {
      "time": "4 Jan 2009 — 1:18pm",
      "content": "_the split nib had been in use... for over a hundred years at that point_\n\nThis would seem to disprove a theory of direct causality through technological determinism.  \nIf the exemplar had been so apparent for so long, why was it not acted upon?\n\nWe tend to see a continuity of form across media, but did they?  \nOn the subject of gravestones, many of those carved during the 17th and 18th century featured sans serif and unstressed letter forms, yet these did not make their way into type until the 19th century, and even then, the influence came from elsewhere (Ancient Greece?!) despite the fact that God-fearing typefounders would have passed by a potentially inspiring cornucopia of letter forms every Sunday.\n\nPerhaps the intense conservatism of English type culture was a result of the dead hand of the Company of Stationers. Caslon may never have had a chance to create his new Romans (which were not even particularly radical), had he not made a name for himself with his scholarly (Arabic, IIRC) fonts.\n\nNot surprisingly, the first evidence of neoclassicism/modernism in British type came during the Scottish Enlightenment--Wilson's work for the Foulis--which may be associated with the relaxation of the copyright laws there in the early 18th century, and the subsequent boom in Scottish publishing.\n\nThis pre-dates Baskerville:\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Mu49-e5titlepage_5802.jpg)\n\n"
    },
    {
      "time": "4 Jan 2009 — 2:26pm",
      "content": "Nick: _This would seem to disprove a theory of direct causality through technological determinism._\n\nI never argued causality through technological determinism; I don't believe in technological determinism. The making of things is the meeting of ideas and tools, and what we recognise as neoclassical letters of the form later cast in type appears to originate in the work of certain London writing masters around the turn of the 17th–18th Centuries. What enables us to identify these letters as neoclassical is the larger intellectual and cultural milieu in which they developed (the ideas) -- and how they express those ideas -- but what gives them their shape is the characteristics of the split nib pen (the tools). You need both ideas and tools in order to make something, and the nature of the ideas combined with the nature of the tools will guide the making and contribute to the nature of the thing made. If you change the mix, you end up with a different thing; so, for example, if the ideas of neoclassicism were applied to text but in the absence of the split nib pen, the letters we would identify as neo-classical would look quite different from what, in fact, were produced during that cultural period. The fact that the dominant use of the split nib pen preceded the ideas of neoclassicism, I would argue, defined the context within which those ideas were applied to lettering.\n\nThroughout the 17th Century, new writing styles were being developed and perfected, using the split nib pen, which are not neoclassical. The tool does not determine that neoclassical letters will be made: it can be used to make a variety of letterforms, one of which is the neoclassical roman, which occurs when people start to apply ideas of neoclassical aesthetics to formal lettering.\n\n"
    },
    {
      "time": "4 Jan 2009 — 2:42pm",
      "content": "David, yeah that Q is really something. This is another reason why I classify this as proto-neoclassical: it ain't quite there yet! I would say that even in George Shelley's 1715 'French Cannon' he hasn't figured out a very satisfactory treatment for this letter.\n\n"
    },
    {
      "time": "4 Jan 2009 — 6:10pm",
      "content": "_...the neoclassical roman, which occurs when people start to apply ideas of neoclassical aesthetics to formal lettering._\n\nThat's not what happened.  \nCertain letter forms present in writing manuals may have been subsequently incorporated into typographic works with a neo-classical or modern aesthetic, but it's hard to see how such an aesthetic influenced the calligraphers, as they embellished their specimen pages with a \"Variety of Ornament\"--compare with the austerity of the Foulis title page. Also, the roman letter was a small part of their repertoire, as the commercial hands they taught were mainly cursive scripts. As calligraphers, they approached the roman as they had for centuries, as the classical part of their repertoire, rendering it with an upright stress and delicacy of treatment at large size, nothing neo about that.\n\nThe published writing master manuals were not literal photographic reproductions of pen work, but were showcases of the engraver's art which took liberties with the calligraphic image to present it in as favorable a light as possible. 18th century \"photoshopping\" providing the illusion of perfect interminable one-stroke flourishes. It would be fascinating to compare Shelley or Bickham's originals with the printed page.\n\nThe proto-neoclassical roman letter, as conceived of by George Bickham in the _Universal Penman_, was a bit player in a sumptuously engraved Rococo extravaganza:\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/3968521_5544.jpg)\n\nSo perhaps it was by contrasting roman letters with ornate calligraphic scripts, in the same elaborate layout, and driving them further apart stylistically, that calligraphers and engravers refined and evolved the classical element of their roman lettering to a point where modernist/neoclassical typographers could say, hey, that's cool, but kill the gingerbread.\n\n"
    },
    {
      "time": "4 Jan 2009 — 7:56pm",
      "content": "Nick: _As calligraphers, they approached the roman as they had for centuries, as the classical part of their repertoire, rendering it with an upright stress and delicacy of treatment at large size, nothing neo about that._\n\nExcept that there's a long period in which the roman effectively disappears from the repertoire of the writing masters, presumably because it so successfully became the domain of the typographer. There was little or no call for it to be written; instead, a large variety of regional and commercial cursive hands developed, first with the broad nib (e.g. Civilité) and then with the split nib. It isn't until the late 1600s that there seems to be a desire to reintroduce the roman letter, but with the attendant problems of how to write it with the split nib. And Seddon's examplar in _The Pen-man’s Paradise_ shows just how problematic it was: this is not something that scribes had been 'doing for centuries', it was something new that needed to be worked out. Why did this happen at this time? I think it was due to a couple of factors: one was the developments within the cursive styles that had produced forms that were sympatico to the aesthetics of the day, and the other was the massive increase in the amount of written material being produced by scribes and their pupils as Britain's overseas trade and empire flourished. The oldstyle roman letter offered by the typographers didn't fit within this new context, and the writing masters responded by developing a new form of roman letter. I think it is probably fair to say that this development was, in some respects at least, in collaboration with the engravers: engraving was the medium by which writing exemplars -- for which there seems to have been an almost inexhaustible market in the first half of the 18th century -- were reproduced and published. The writing masters worked closely with their engraver/publishers, and in some cases we can see directly how the latter refined the quality of the written model (the non-Latin specimens at the end of _The Universal Penman_ are a case in point, because the engraving is superior to the identical forms in the end of Barbedor's book from which they were copied).\n\n_So perhaps it was by contrasting roman letters with ornate calligraphic scripts, in the same elaborate layout, and driving them further apart stylistically, that calligraphers and engravers refined and evolved the classical element of their roman lettering to a point where modernist/neoclassical typographers could say, hey, that’s cool, but kill the gingerbread._\n\nYes, I would agree with that. Although I'd like to stick with the label neoclassical, rather than 'modernist'.\n\nBy the way, although the ornamental context of Bickham's roman (and Shelley's, and Champion's, and Brook's, and Austin's, and Clark's, etc.) might not strike us as properly austere enough to be called classical, the letterforms are fully realised by about 1730, and not in any way 'proto'. The context might not fit with our ideas of classicism, but the letters themselves are 'all the way there'.\n\n"
    },
    {
      "time": "4 Jan 2009 — 11:06pm",
      "content": "John, why \"neoclassical\"?  \nWhat's wrong with the traditional typographic term, \"transitional\"?\n\n"
    },
    {
      "time": "5 Jan 2009 — 8:55am",
      "content": "As I explained in the earlier discussion, the term 'transitional' suggests that, somehow, Baskerville and his contemporaries were interpolating between oldstyle and the yet to be created 'modern' (i.e. romantic) style. It is ahistorical.\n\nI have not used any of those 'traditional typographic terms' for well over a decade, because even when I first encountered them they seemed to me silly. They don't relate to anything except themselves, and they contribute to the false impression that the history of typography is somehow unrelated to any other history. Further, it is a specialised lingo that alienates discussion of typography from discussion of culture that any reasonably educated person might understand. We call painting, architecture, sculpture, music, etc. produced during a particular period and showing evidence of shared aesthetic concerns 'neoclassical'. I call types produced during that same period and showing evidence of the same aesthetic concerns by the same name.\n\n"
    },
    {
      "time": "10 Jan 2009 — 11:58am",
      "content": "\"...the term ’transitional’ suggests that, somehow, Baskerville and his contemporaries were interpolating between oldstyle and the yet to be created ’modern’...\n\nMaybe to you, but I thought later scholars invented the term _because it fit_, (as it does in many disciplines for the many transitions relative to specifics in each discipline where neither 'proto-' or 'post-' are apt).\n\nTrying to herd all the \"shared aesthetic concerns\" and terms together into a straight formation; I think Pericles, Aristotle and Mozart, all reached their peaks of Classical-ness without peaking at each other's shared aesthetic concerns, much less each other.\n\nBesides which, where does a shared aesthetic of 16th century, (or any of the many ages of) neo-classicism appear with proto-modern serif typography? It seems decidedly anti-classical typographically to me, in the same way that Zapf's faces of the early 50's were anti-modern, (or is all the shared aesthetic of that era 'Atomic';). The history of typography is somehow related to every history I think, but it's appearance is often not, as in this case.\n\nI really like the pictures though. :)\n\nCheers!\n\n"
    },
    {
      "time": "10 Jan 2009 — 4:59pm",
      "content": "_It seems decidedly anti-classical typographically to me._\n\nRight. The transitional letterform was clearly heading in the direction of the modern (Didone) letter, which is informed by a quite different sensibility than the brush-driven strokes of antiquity, or the broad-pen shapes of the Carolignian revival during the Incunabula, either of which, one would think, would be the prime candidates for a neoclassical approach to type design during the 18th century. But in fact, the big neoclassical era of type design was the historicist era of the early 20th century--yet the graphic design history books are all about that being a modernist era, taking their cue from fine art. So the problem with trying to relate type history to other histories is, we end up with someone else's history, a false history.\n\nAnd yet the transitional letter was well suited to the Foulis' neoclassical layouts, just as the modern letter was well suited to those other great publishers of classical texts, the Didots.\n\nAnd the transitional letterform was developed in a Rococo environment?\n\nIt just doesn't make any sense at all if we try and fit type design into traditional cultural categories, and theorize that the aesthetics of letter design are driven by the aesthetics of page layout.\n\nType design and page layout (graphic design/art direction) don't serve the same master.\n\nI think people such as Richard Austin, who in 1819 wrote of Didot's invention of the \"Modern\" style of type, and pinned it on technological progress, had it right, and type terminology has always had it right with its oldstyle--transitional--modern timeline.  \nTypography was modernised during the age of revolutions--and there is no reason that fact can't be related to other historiographies, closer to the history of science, politics and technology than to the fine arts.\n\n"
    },
    {
      "time": "10 Jan 2009 — 8:00pm",
      "content": "Nick: _The transitional letterform was clearly heading in the direction of the modern (Didone) letter, which is informed by a quite different sensibility than the brush-driven strokes of antiquity, or the broad-pen shapes of the Carolignian revival during the Incunabula, either of which, one would think, would be the prime candidates for a neoclassical approach to type design during the 18th century._\n\nThe term neoclassicism should not be confused with classicism. Neoclassicism refers collectively to particular movements in painting, architecture, music, applied arts, etc. -- each with its own distinctive characteristics and timeframe, but also with what I've called 'shared aesthetic concerns' -- which recognisably rose to prominence between the mid-18th century and, in various guises, through to the end of the 19th century. Of course, they overflow on either end of this period, and hence you do get the development of a letterform that becomes characteristic of English neoclassical typography during the later baroque period and influence of rococo. The idea that neoclassical lettering would reference letterforms of antiquity directly mischaracterises the nature of neoclassicism, which was a new style based more on an ideal of classical beauty than on actual classical models.\n\nThe 'Didone' letter is a romantic development and, like romanticism in music, it takes the structures of neoclassicism and pushes all the dynamics to extremes.\n\n"
    },
    {
      "time": "10 Jan 2009 — 8:21pm",
      "content": "_The idea that neoclassical lettering would reference letterforms of antiquity directly mischaracterises the nature of neoclassicism, which was a new style based more on an ideal of classical beauty than on actual classical models._\n\nAt least in the realms of painting, sculpture, and architecture with which I am most familiar, I think you're understating the prominence of antique works as formal models in Neoclassicism. ( [Here's](http://web.archive.org/web/20150123190342/http:/www.metmuseum.org/toah/hd/neoc_1/hd_neoc_1.htm) a useful overview of Neoclassicism in sculpture and painting.)\n\n"
    },
    {
      "time": "10 Jan 2009 — 8:30pm",
      "content": "_So the problem with trying to relate type history to other histories is, we end up with someone else’s history, a false history._\n\nBringhurst's \"Historical Interlude\" strikes me as a case in point.\n\n"
    },
    {
      "time": "11 Jan 2009 — 7:36am",
      "content": "_I think you’re understating the prominence of antique works as formal models in Neoclassicism._\n\nI don't think so. Classical antiquity certainly provides the _thematic_ models for neoclassicism, but neoclassicism produces distinctive forms. The gallery of images at the top of the painting and sculpture page to which you link provides a good illustration of this: the antique works are immediately distinguishable from the later ones. This isn't always the case when looking at works of renaissance classicism, which referenced antique models much more directly. Neoclassicism involves idealisation of classical forms and themes.\n\nI'll also draw attention to the level of decorative detail in the neoclassical works, as compared to the antique. Earlier, Nick was objecting to the rococo ornamental setting and eclecticism of the proto-neoclassical lettering in Bickham's dedication page as being contrary to classicism, but neoclassicism doesn't always imply a rejection of ornamentation, as e.g. [Würth's wine coolers](http://web.archive.org/web/20150123190342/http:/www.metmuseum.org/toah/hd/neoc_1/ho_2002.265.1a,b,.2a.htm) demonstrate. These are worth considering, and asking oneself the question 'What kind of letters harmonise best with these forms?'\n\n"
    },
    {
      "time": "11 Jan 2009 — 9:29am",
      "content": "So, presuming that I had labelled this thread 'Proto-transitional roman' instead of 'Proto-neoclassical roman', might the discussion have differed? I'm less interested in the art historical classification than in the process by which an attempt to create a formal roman letter written with a split nib in the late 17th Century results eventually in the types of Baskerville and his contemporaries. I'm particularly interested in this because, after the manner of people with a product to push, and in an age characterised by narratives of innovation as much, or more, than by innovation itself, Baskerville's types have long been presented as novel inventions. Justin Howes, who was a fine historian of the 18th Century obsession with progress, documented the early development of a narrative in which type founders and printers beginning with 'Mr Baskerville of Birmingham that enterprising place' produced a new and improved type without any reference to non-typographical sources.\\* Unfortunately, I think Justin accepted too readily this account, and gets it exactly backwards when he writes that the impact of belief in 'perpetual improvement' that he associates with the development of new types was less evident in 'other forms of letter design (such as hand- or sign-writing, inscriptional and engraved lettering) ..., other than where these were affected by fashions in type design'. This simply doesn't stand up to the evidence of the artefacts, in which the letters that became the 'new types' exist in written and engraved forms long before they were cast in type.\n\n\\* ‘Extreme type: progress, “perfectibility” and letter design in eighteenth-century Europe’, in _Typography Papers 7,_ 2007.\n\n"
    },
    {
      "time": "11 Jan 2009 — 11:40am",
      "content": "John, I agree with you about the origins of the transitional style in non-type media (if not about terms of classification), but Shelley's influence on Baskerville isn't news. For instance, it is mentioned on page 107 of David Consuegra's _American Type Designers_ (2004).\n\nAnd as I mentioned above, Alexander Wilson was an earlier proponent of the transitional form in type, with his work being published in trade quantity, in minimalist layouts by the Foulis. So notwithstanding his very real merit and influence, the famous Mr Baskerville will perhaps in future attract less credit for innovation in certain areas.\n\n"
    },
    {
      "time": "11 Jan 2009 — 11:40am",
      "content": "I haven't done a broad survey, but it seems to me that in the arts generally there was a diversity of lettering styles employed during the neoclassical era. For instance, on his antique-style bust of the abolitionist Abbé Raynal, Espercieux used the modern letter, but in his painting of the bust in _Portrait of C(itizen) Belley_, Girodet adopted a more antique letter. These from the 1790s.\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/raynal_3531.png)\n  \n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/belley_4657.jpg)\n\nIn one of his least classical works, _The Death of Marat_ (1793), David presents us with a near sans, and as with Girodet, something of the Florentine Renaissance about it--low contrast, negligible serifs, inscriptional.\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/466px-Death_of_Marat_by_David_6425.jpg)\n\nGilray, at the same time, made no classical allusions in the manner of his satirical prints, employed the constructed modern form of letter:\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Gilray_3490.jpg)\n\n"
    },
    {
      "time": "11 Jan 2009 — 12:01pm",
      "content": "Transitional as a name clearly expresses an academic label afterthought where what went before and after both did not match the rules of categorization imposed by the academics. The folks who did the lettering or type design work were not looking to make a bridge between neat eras. They were just doing their own work in their own time. It may be fun for some to sort and label but this is always after the fact, not because of it.\n\nChrisL\n\n"
    },
    {
      "time": "12 Jan 2009 — 8:49am",
      "content": "\"...presuming that I had labelled this thread ’Proto-transitional roman’ instead of ’Proto-neoclassical roman’, might the discussion have differed?\"\n\n...and what if you called it pre-modern or pre-proto-modern, and left the 'transitional', 'classic' and 'roman' out all together?\n\nAnd, Nick, if you kill Marat on this forum One More Time, just to make a point, I'm going to Disney World.\n\nCheers!\n\n"
    },
    {
      "time": "12 Jan 2009 — 9:15am",
      "content": "_I don’t think so. Classical antiquity certainly provides the thematic models for neoclassicism, but neoclassicism produces distinctive forms. The gallery of images at the top of the painting and sculpture page to which you link provides a good illustration of this: the antique works are immediately distinguishable from the later ones. This isn’t always the case when looking at works of renaissance classicism, which referenced antique models much more directly._\n\nI agree that the neoclassical and antique works are readily distinguishable, but I'd argue that the same is true of renaissance classicism. In each case you have formal emulation of the antique, but in a style that can't help being of its own day. (Even in cases where fidelity to an older style is paramount - as in forgery or restoration - the passage of time often reveals how the newer work is of a piece with its contemporary style.)\n\nNapoleon's monuments were even more \"antique\" than those of the Renaissance popes.\n\n_but neoclassicism doesn’t always imply a rejection of ornamentation, as e.g. Würth’s wine coolers demonstrate._\n\nThe text on that page argues that the ornamentation was a \"Viennese interjection\" into neoclassicism, not exemplary of neoclassicism itself. But your point that this hybrid aesthetic existed and your question about how letters might fit it remain.\n\n(The history of type-design labels is my current research project, but you're right that it is not what this excellent, informative thread is about.)\n\n"
    },
    {
      "time": "12 Jan 2009 — 9:27am",
      "content": "How would you classify these letters (from 1643)?\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Louis_XIII_douzieme_d'ecu_3913.jpg)\n\n[source](http://web.archive.org/web/20150123190342/http:/cngcoins.com/)\n\n"
    },
    {
      "time": "12 Jan 2009 — 12:20pm",
      "content": "_...same aesthetic concerns..._\n\nSuch as removing the trace of process.  \nIn painting, meticulous finish with no evidence of brushwork.  \nIn architecture, covering up brickwork with stucco.  \nIn type, constructed letterforms banishing the influence of pen and brush.\n\n"
    },
    {
      "time": "12 Jan 2009 — 2:49pm",
      "content": "_...but Shelley’s influence on Baskerville isn’t news._\n\nIndeed not -- although it seems to be news to some --, but what interests me and sent me on the search that led to Seddon is how Shelley and his contemporaries arrived at the widespread mature roman style seen everywhere by the 1730s. Although Shelley's 1709 sample was the earliest I had found, I couldn't be sure that he was primarily responsible for the development of the style, since it appears so widely thereafter. Now, having discovered Shelley's relationship with Seddon, and the latter's prototypical style, I am reasonably confident that Shelley's work was influential in propagating the style among the writing masters. I especially look forward to seeing images from the 1705 _Penman’s Magazine._\n\n"
    },
    {
      "time": "25 Feb 2010 — 8:34am",
      "content": "FWIW, there are some terrible quality reproductions of _The Ingenious Youth's Companion_ of 1690 at Early English Books Online.  \n [http://eebo.chadwyck.com/search](http://web.archive.org/web/20150123190342/http:/eebo.chadwyck.com/search \"http://eebo.chadwyck.com/search\")\n\n"
    },
    {
      "time": "25 Feb 2010 — 8:47am",
      "content": "Thank you very much, Craig. I did some more research on John Seddon and his contemporary writing masters when I was in London in November. I'm considering making a presentation on this subject at TypeCon this year, although ideally I'd like to follow up some other loose ends first. There are a couple of other names that crop up in the late 17th Century, but only single copies of their writing exemplars are known to exist (in the British Library) and these are undated (because their owner, Samuel Pepys, didn't bother to keep the titlepages!). I don't yet know whether these might include an early roman and can't know, if they do, whether this would pre-date Seddon's. I doubt it, based on what I've found so far, but it is possible.\n\n"
    },
    {
      "time": "25 Feb 2010 — 9:00am",
      "content": "John, do you happen to know what that last page of _Alphabets in All the Hands_ that looks like some kind of calligraphic foreign script is?\n\n"
    },
    {
      "time": "25 Feb 2010 — 9:10am",
      "content": "I don't have a copy of that, I'm afraid. Do you have an image or a link?\n\nOne of the interesting things I have discovered is that the showings of non-Latin scripts reproduced at the end of Bickham's _Universal Penman,_ and I'm guessing elsewhere, is copied directly from earlier engraved sources. They are found in Barbour's _Les Ecritures Financiere_ of 1647, almost a full century before Bickham's publication.\n\n"
    },
    {
      "time": "25 Feb 2010 — 9:17am",
      "content": "I'm not equipped for a proper photograph, but this is roughly what it looks like:\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/Photo-22_6029.jpg)\n\n"
    },
    {
      "time": "25 Feb 2010 — 9:49am",
      "content": "Ah, this is what is known as English Court hand (although in reality it is only one, late model of writing used in English court and financial writing). Yes, that's the Latin script. Think of it as the English equivalent of the ornamented Ottoman diwani style of Arabic script: a style that evolved to be difficult for the uninitiated to read. Most letters take multiple forms, and the relationship to the typical forms of the Latin majuscule and miniscule letters is frequently difficult to analyse.\n\nThe standard book on the subject is Hilary Jenkinson's _The Later Court Hands in England from the Fifteenth to the Seventeenth Century._\n\n"
    },
    {
      "time": "25 Feb 2010 — 11:34am",
      "content": "Thanks for the info. I'd suspected that it was some kind of Latin but distrusted my own suspicions.\n\n"
    },
    {
      "time": "25 Feb 2010 — 11:47am",
      "content": "More bibliography on the topic of this thread:  \nAnother great source from this era is Charles Snell's _The Art of Writing in Theory and Practice_ (1712), which, among its scripty plates, has a Baskerville-like roman.  \nThis citation and others appear in \"John Baskerville and the Writing Masters,\" an unsigned article in _The Monotype Recorder_ 23 no. 201 (1924).  \nThat article also reproduces a plate by Abraham Nicholas from 1722 which appears in _Penmanship in its Utmost Beauty and Extent_ ed. by Bickham.\n\n"
    },
    {
      "time": "25 Feb 2010 — 1:02pm",
      "content": "Shelley's influence on Baskerville came as news to me. What it implies to me is that at the time, an alternative letterform was seen as 'better' than Caslon or at least more natural or fashionable, and so John Baskerville was inspired by the spirit of the times rather than proposing something completely novel and original.\n\nBoth Garamond and the roman of Nicholas Jensen were revived by ATF before Monotype gave us their own revivals not only of those faces, but Bembo, their revival of the Aldine roman, and Plantin, and so many others.\n\nIs the fact that apparently Garamond, for example, was not revived much earlier someting that asks for an explanation, or is it a perfectly natural consequence of the technology available at the time? It could be that an attempt to revive Garamond wouldn't have been a reasonable thing to do until the pantograph came along, and so if ATF revived it very shortly after Morris F. Benton invented it, there is no real mystery. And, of course, as is well known, the high quality - in the sense of sheen and gloss, although his face had plenty of real quality as well - of Baskerville's face was ahead of the printing technology of the day, leading other printers to understandably feel that he might set quality standards that were not possible to meet at the time without inordinate effort.\n\n"
    },
    {
      "time": "25 Feb 2010 — 2:38pm",
      "content": "Here's a relevant piece from that aforementioned _Monotype Recorder_ article, which I'd guess was written by Morison:\n\n“Abraham Nicholas’ plate (No. 53) in _Penmanship in its Utmost Beauty and Extent_ is one of the most interesting in this series of pieces of writing collected from the writing books of contemporary masters by that most prolific and expert of copperplate engravers, the celebrated George Bickham, senior. The volume cited is his first collection, and not to be confused with his more complete folio, _The Universal Penman_, published in 1743. The plate mentioned was originally published in the year 1722, some fifteen years before Baskerville cut his first type. Of the writer Bickham says that he was a very “valuable artist to whom I have many obligations, a judicious person who was a correct and bold performer, and in every other respect an accomplished gentleman.\"  \n“A glance at his alphabet (shown in our fig. 1) will discover to the reader a notable similarity with the general form of Baskerville’s first roman and italic (shown in our figs. 3 and 4). This is a similarity, of course, only to be expected, since during the years 1730-5 Baskerville flourished as sign-writer, tombstone-cutter, and writing-master. Thus he shared with his colleagues the same models, taught the same hands, and, if the truth must be told, had a similar conceit of himself.\"\n\n"
    },
    {
      "time": "25 Feb 2010 — 8:05pm",
      "content": "Quadibloc: _Is the fact that apparently Garamond, for example, was not revived much earlier someting that asks for an explanation, or is it a perfectly natural consequence of the technology available at the time?_\n\nIt's a perfectly natural consequence of the correlation of typography with writing and other aspects of culture prior to the 19th Century. Why would you revive a late renaissance typeface when your modes of writing, music, sculture, painting, architecture and everything else is moving in a different direction? Revivalism begins in the 19th Century, in so many areas of culture that it can be seen as a movement in itself; by the 20th Century, it has become a free-for-all raid and reinterpretation of the past.\n\n"
    },
    {
      "time": "22 Mar 2014 — 3:21am",
      "content": "Pine's Horace is now available online, and so here is a sample of the text:\n\n ![](http://web.archive.org/web/20150123190342im_/http:/typophile.com/files/horace_4094.jpg)\n\n"
    }
  ]
}
