{
  "id": "53140",
  "title": "Please comment Gesta",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hi,\n\nI'm now finishing my new type design. It's a sans family called Gesta.  \nI wanted to show this here before closing it, and hear any suggestion you might have.\n\nIs there something you feel it is awkward or not working, or something you might do differently?\n\nThanks in advanced. And a great 2009:)\n\n ![](http://web.archive.org/web/20150421093019im_/http:/typophile.com/files/img_gesta_3460.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [gesta.pdf](http://web.archive.org/web/20150421093019/http:/typophile.com/files/gesta_0.pdf) | 106.7 KB |\n| [gesta Spec 3.pdf](http://web.archive.org/web/20150421093019/http:/typophile.com/files/gesta%20Spec%203.pdf) | 106.63 KB |\n\n",
  "author": "rui abreu",
  "time": "5 Jan 2009 — 3:50am",
  "uid": "12433",
  "comments": [
    {
      "time": "5 Jan 2009 — 6:18am",
      "content": "I like it. I don't see anything that looks awkward right now.  \nYou might think about making a second g, a double-story one. I think such a g would work well with the squarish style of the design.\n\n"
    },
    {
      "time": "5 Jan 2009 — 6:40am",
      "content": "Thanks Jelmar, I think a double-story g might look good on this. I think I will try that.\n\n"
    },
    {
      "time": "5 Jan 2009 — 7:08am",
      "content": "I like it as well. Looks like a lot of the contemporary square sans serifs, but looks good.  \nI'd try the 2nd g, but I'd be afraid that it would be distracting and disjointed from the rest of the forms.\n\nNit-pickin': the bottom of the a feels a little awkward. I see what your doing by making the bowl hang a little, but it's distracting me. Perhaps it needs to stay thinner a little further. Same kind of thing happening with the b (you notice it most in the bold).\n\nThe placement of the accent on the á feels like it's placed a little weird.\n\nKerning on the o seems a hair wide.\n\n"
    },
    {
      "time": "5 Jan 2009 — 7:53am",
      "content": "Paul, I think see what mean. You think the round base on a and b are too heavy? I think I see that on the regular and the heavier weights. Would you say the same about the light weight?\n\n"
    },
    {
      "time": "5 Jan 2009 — 10:11am",
      "content": "On the **a** and **d** , I think the bottom triangle bit could be opened up a bit more. Maybe make the bottom curve more like that of the **u** , which has more room. The **g/q** seem to have the same curve as the **a/d** , maybe those can use the **u** curve as well. Especially in Medium/Bold. Exactly the same goes for the italics. (Am I referring to the same as Paul?)\n\nI like your **k**'s, with the little straight bit. I wonder, though, what it would look like if this little detail would be flipped horizontally. I.e. if the little straight bit would be on the top arm. But for the rest leaving the arms themselves intact. Maybe it looks crap, but just wondering. :)\n\n"
    },
    {
      "time": "7 Jan 2009 — 2:29am",
      "content": "It looks nice on the guillemets, but I think the rounding of lessthan and greaterthan may prove impractical.\n\n"
    },
    {
      "time": "7 Jan 2009 — 9:01am",
      "content": "Thanks, your suggestions on the curves were very helpful I'm already working on them, and they are Improving.  \nthey implied some other adjustments but I'll show them later.\n\nKevin, I agree, the less and greater were already on my ToDo list.\n\n"
    },
    {
      "time": "7 Jan 2009 — 9:43am",
      "content": "I like this. These monoline ones must be very tricky to achieve. It's very neat and precise without being sterile or cold. I like the curves and the knee of the K and k and the numerals.\n\nI know it's very subjective but I think your dieresis and tilde seem to float a bit high when top-aligned with the circumflex, acute and grave. I think I'd pull them down to centre-align with those.\n\nI'm not sure about the comma and quotes. The shapes could be simpler, somewhere between straight and curved, with the tail thicker. The square head seems too aggressive to me. Just because I'm working on those glyphs in my own font at present, I'm paying extra attention to how they're constructed.\n\nOtherwise I really like it.\n\n"
    },
    {
      "time": "7 Jan 2009 — 10:37am",
      "content": "I agree with many of the above comments. I noticed some misspellings/typos in your sample that you may want to fix, too (shown here in CAPS):\n\n\"This page shows it working in text compositions at various sizes. Gesta is friendly and CHARISMATIC with ITS generous  \nx-height and slightly curved strokes. This new Sans is AVAILABLE in four weights from light to bold with four matching italics. It is intended for CORPORATE and editorial PURPOSES & it is EQUIPPED with Small Caps for every weight and also old style figures.\"\n\n"
    },
    {
      "time": "10 Jan 2009 — 8:50am",
      "content": "Hello,\n\nHere is how it turned out.\n\nI fixed the curves on the bottom of a, b, d, p, q and made them closer to the curve on the u. This turned into a big improvement i think, especially in the heavier weights.\n\nAlso remade the comma and quotes, the less and greater, and the tild and dierensid position.  \nI left out the to storied g, because I think it would be to complicated for this font.\n\nI think it has improved a lot, thanks to your comments.\n\nI also uploaded a new Pdf file on top.\n\n ![](http://web.archive.org/web/20150421093019im_/http:/typophile.com/files/notebook_5893.jpg)\n\n"
    },
    {
      "time": "10 Jan 2009 — 1:37pm",
      "content": "Perfect!\n\n"
    },
    {
      "time": "10 Jan 2009 — 6:18pm",
      "content": "Those quotation marks are much improved.\n\nThe ball-and-stem lowercase letters (b, d, p, q, maybe g) look too narrow to me.\n\n"
    }
  ]
}
