{
  "id": "53230",
  "title": "Type Suggestions for rebrand",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am currently beginning a project to rebrand a small fine furniture business. Most of the work is high design wooden pieces, the focal point being the wood most times.\n\nThat being said, we are moving away from the craft feel, to better capture the refinement of his business and convey these pieces as art, rather than craft –&nbsp;which they most certainly are!\n\nHe leans towards the modernist approach, which is great as I tend to as well. However, as I have fallen behind on a lot of current faces, I thought someone may be able to recommend a few fonts that I may benefit from seeing / comparing.\n\nProbably going sans serif on this one, but was hoping for a slightly rougher / humanist sans... if there is such a thing! Trying to avoid slabs even, and a heavier weight is ideal.\n\nThank you in advance.\n\n",
  "author": "bamaurer",
  "time": "7 Jan 2009 — 12:43pm",
  "uid": "13776",
  "comments": [
    {
      "time": "7 Jan 2009 — 12:46pm",
      "content": "And... if you try with Century expanded?  \nWhy not?\n\n"
    },
    {
      "time": "7 Jan 2009 — 12:56pm",
      "content": "Surely why not, however as I said, probably gunning for a nice sans serif, I appreciate the suggestion though. Perhaps as a secondary, but probably will not fly.\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:05pm",
      "content": "hoping for a slightly rougher / humanist sans... Papyrus!\n\n;^/\n\nNick Cooke\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:06pm",
      "content": "I hear you, guess I am asking a slightly annoying question on this one!\n\nTo your point Nick, his current type / logo is Papyrus!\n\nI suppose to revise this inquiry, I would not say Humanist, just a slightly rougher nice sans out there, if there is anything that has come around of late.\n\nUnderstandable to let this post rest though I suppose. Thanks.\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:09pm",
      "content": "There are only few quality \"sans\" (more or less the same number of the quality \"serif\").  \nFutura, Helvetica, Univers, Gill Sans, Fruriger, Meta, Rotis, Eurostile... Scala.  \nMaybe also Avant Garde sounds good on wooden surfaces.  \nBut if you're looking for something \"rougher\" you must use a serif. Mantinia by Matthew Carter, is perfect!\n\ncf\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:14pm",
      "content": "[Neutraface](http://web.archive.org/web/20130821072020/http:/www.houseind.com/fonts/neutraface)\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:18pm",
      "content": "I would consider mid century humanists like Gill Sans, Humanist 521 (also designed by Eric Gill) to be a little rougher then the humanists of today. I would suggest you do a search for humanists in the new MyFonts site. You'll surely find a good face for your needs.\n\nJonE.\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:29pm",
      "content": "will do, thank you all for your feedback, it is very helpful as usual.\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:31pm",
      "content": "incidentally... neutraface is pretty appealing at first glance, so thanks on that one.\n\n"
    },
    {
      "time": "7 Jan 2009 — 1:35pm",
      "content": "The Dutch school of contemporary sans serif faces is considered to be humanist, due to the influence of Gerrit Noordzij's theories of _The Stroke._\n\nSomething by Lucas De Groot, perhaps, or Underware's Auto.\n\n"
    },
    {
      "time": "7 Jan 2009 — 2:50pm",
      "content": "I'm curious to know what you mean by \"rougher\". My first thought — before your last paragraph — was a geometric sans like Futura or Neutraface, but none of those would pass as a humanist sans.\n\n"
    },
    {
      "time": "7 Jan 2009 — 2:54pm",
      "content": "And I wouldn't qualify Neutraface (or Futura) as rough either.\n\n"
    },
    {
      "time": "7 Jan 2009 — 3:26pm",
      "content": "Check out the Museo/Museo sans family. It occupies a wonderful intersection of humanism, geometric modernism, and contemporary digital “perfection” that could work well.\n\n"
    },
    {
      "time": "7 Jan 2009 — 4:08pm",
      "content": "Thinking of a rough, humanist sans:  \nCarl Crossgrove's [Beorcana](http://web.archive.org/web/20130821072020/http:/www.beorcana.com/)\n\n"
    },
    {
      "time": "7 Jan 2009 — 4:51pm",
      "content": "Gotham\n\n"
    },
    {
      "time": "8 Jan 2009 — 12:47pm",
      "content": "These suggestions seems to be coming from different realms ;)\n\n"
    },
    {
      "time": "8 Jan 2009 — 12:57pm",
      "content": "Museo is a nice suggestion. I would look at Pakt as well.\n\nAlthough, when I think of wood, intuitively, Garamond comes to mind.\n\n"
    },
    {
      "time": "20 Jan 2009 — 12:14pm",
      "content": "Thank you all for the suggestions. I understand the question was a bit \"off,\" and some of the responses (especially mine) reinforced that I was not sure exactly where I was headed.\n\nI guess by rough / modernist, I actually meant not flawlessly resolved. I commented on Neutra not because I thought it met these specific criteria, but because it seemed to be an alternate approach to type for this... to the rougher idea anyway. Since most of his pieces are very architectural, it seemed appropriate due to it's inspirations / style.\n\nThat being said, there was one suggestion that won it for me... can't seem to locate it now, but it was the type with blown out (not sure the name, but the ink overflow allowance things for letters) but designed to extremes. That, to me read rougher, and a bit more unique in the sans world, and spoke to \"process,\" which was my goal.\n\nIn the end, all proved to scarily offensive to him to purchase, so back to working with Berthold Akzidenz... which I love, and will work, just not quite as custom.\n\nThank you all for your suggestions, and sorry I was a bit here and there on it!\n\n"
    },
    {
      "time": "20 Jan 2009 — 2:11pm",
      "content": "Ink traps? Good luck anyhow!\n\n"
    },
    {
      "time": "21 Jan 2009 — 2:44am",
      "content": "BTW  \nBell Gothic might be considered as a \"rough sans\" candidate.\n\n"
    },
    {
      "time": "30 Jan 2009 — 7:03am",
      "content": "From the sounds of it, you're looking for something like Meta.\n\n"
    },
    {
      "time": "30 Jan 2009 — 8:16am",
      "content": "If you're into ink traps and a \"rough\" feel, [Olga](http://web.archive.org/web/20130821072020/http:/www.tdc.org/news/2007Results/Olga.html) (see also [here](http://web.archive.org/web/20130821072020/http:/www.krizbi.de/)) might be right up your alley. It's not a sans though, and I'm not sure it's available, but may be worth havin' a look at.\n\n"
    }
  ]
}
