{
  "id": "5323",
  "title": "Archive through June 12, 2004",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "last night i was sitting with my pal, talking about all kinda things and sketching together, and i said to him - 'isnt it wierd that typographers i know are apathic about graffiti? because me personaly, i think graffiti is a peak in typography and caligraphy's history. people all around the world are exploring letters in amazingly innovative ways, and its an artform of the masses.. so men and women of all ages, and all sorts of social backgrounds, are writing. i know that when i think of a typography utopia.. its something very much like whats going on in graffiti today. and even though sometimes graffiti is very diffrent from type, it remains an incredibly exciting thing - its a movement of more-or-less neo-typographers and calligraphy masters. if i was a type designer, i think it would make very happy to know that in my area kids are working hard to improve their letters. more so, to know that great calligraphers live and work in my lifetime'.   \nwhat do you guys think about graffiti? do you see it as something thats a part of the history of typography or calligraphy? do you write graffiti?\n\n",
  "author": "seg",
  "time": "4 Jun 2004 — 6:22am",
  "uid": "940",
  "comments": [
    {
      "time": "4 Jun 2004 — 7:59am",
      "content": "I like graffiti, and I think it can have a positive influence on type - but it's not type, it's lettering. On the other hand, now with OpenType especially the lines are more blurred.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Jun 2004 — 8:53am",
      "content": "I've never tried graffiti.   \nIt's gestural: for the arm, as calligraphy is for the wrist.   \nEven in simple tagging, graffiti is nowhere near as formalized as calligraphy, so it's very resistant to being type-formed.   \n   \nIt's also cryptic. I know of one situation a few years ago where the name of a rave was rendered in graffiti in a flyer, and few showed up, presumably because not many could figure out what the event was called.   \n   \nIt's also illegal, so advertisers are by and large not going to want to be associated with it. However, that's a good reason why it could catch on, in this time of bad behavior.\n\n"
    },
    {
      "time": "4 Jun 2004 — 1:06pm",
      "content": "Graffiti artists are wanna-be-protologist run amuck.\n\n"
    },
    {
      "time": "4 Jun 2004 — 1:18pm",
      "content": "Even if they tag classical Italian poetry? Gerald, do you like poetry Gerald?   \n   \nhhp\n\n"
    },
    {
      "time": "4 Jun 2004 — 1:45pm",
      "content": "Hrant, you know as much about poetry as you do about art. Squat diddly. There is nothing poetic about graffiti. Areosol cans are bad for the environment. What kind of chump are you anyway? A right wing Rumsfeld/Bush supporting Armenian American against the Kyoto Agreement\n\n"
    },
    {
      "time": "4 Jun 2004 — 1:48pm",
      "content": "I mess around with graf forms in sketch books,   \nbut have never tagged anything   \nthat didn't belong to me.   \nOnce in a while, I pick up a graf magazine   \nat Tower Records. I also have a copy of   \nThe Art of Getting Over by Stephen Powers.   \n   \nAs Nick mentions, a lot of it is purposely   \nunreadable, which I find very intriguing.   \n   \nBut graffiti is not always illegal.   \nWe used to commission work from   \nan Art Center student who was known   \nfor his graffiti art\n\n"
    },
    {
      "time": "4 Jun 2004 — 2:11pm",
      "content": "The Graffiti in Manhattan is extrodinary only because of where the artists choose to post it. Some of the highway overpasses and sheer cliffs make you wonder how they didn't get killed posting it. Most of the Graffiti here is gang related and is about territories, not positive at all.\n\n"
    },
    {
      "time": "4 Jun 2004 — 6:18pm",
      "content": "nick, i found the diffrence between calligraphy and graffiti quite non-existing on several occasions. most of the time i find the two mixing into each other. if you write in someone's sketchbook, for example, thats both calligraphy and graffiti, its a point were the two meet and blend into each other. most of the time i just see my typographic experiments leaking and mixing with my graffiti sketchs, or vice-versa, until i cant tell which is which. its true that graffiti uses diffrent tool then calligraphy.. thus forcing you to use your whole arm. but even though the technique's an importent thing to learn its not the real issue. the really importent thing is how you write, how beautiful and original are your letters.   \n   \n ![](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/37573.gif)   \n   \nbj, i havnt read that book. does it have pictures of ESPO's (aka Stephen Powers) work inside?   \nhe's considered by many a lousy writer because he only did blockbusters, no bombing or complex pieces. his work is plainly typographic in comparison to the general nyc graffiti trends and traditions.\n\n"
    },
    {
      "time": "5 Jun 2004 — 11:28am",
      "content": "![flow](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/37611.jpg)   \nThis is a face that one of my students at York University (Toronto) did last year.   \n   \nThe project: design a unicase.   \n   \nFlow, by Tanya Chong\n\n"
    },
    {
      "time": "5 Jun 2004 — 11:28am",
      "content": "![espo](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/37617.jpg)   \n ![sever](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/37618.jpg)   \n ![peeta](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/37619.jpg)   \n ![giant](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/37620.jpg)   \n   \njust some pieces which are not too 'cryptic' ![:-)](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "5 Jun 2004 — 2:42pm",
      "content": "Itay, he includes some of his pieces in the book.   \n   \nI can post some scans on Monday or Tuesday.   \n   \nbj\n\n"
    },
    {
      "time": "8 Jun 2004 — 9:42am",
      "content": "\"_There is nothing poetic about graffiti._\"   \n   \nDepends on whose poetry you read... or listen to.   \n   \nI'll also add that, like all forms of craft and art, there is good graffiti and bad graffiti. Also, there are appropriate venues (highway walls, parking structures, and concrete overpasses) and inappropriate venues (preexisting art, non-public architecture, homes, churches, sculpture, etc.).\n\n"
    },
    {
      "time": "8 Jun 2004 — 4:39pm",
      "content": "I agree with you Itay. I see so many wonderful   \nexamples of something that is clearly dealing   \nwith letterforms, but in a way that I can't properly   \n\"read\". I find it utterly fascinating. Some of the   \nmore impressive bombs in New Zealand are   \norganic, harmonious contemporary examples   \nof type as image. It is a new (ish) aesthetic that   \nseems to evolve in a most peculiar manner.   \nQuite a few adverts round these parts are picking   \nup on it as a short cut to TARGET YOUTH. So I   \nreckon that it will soon be diluted and wrecked.\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:19am",
      "content": "And then there's the stencil graf.   \nSome of that blurs the boundaries between legible type and street art. It's more this kind of stuff that event coordinaters are looking to for cheap, wide-reaching publicity, that catches the eye, but often mostly due to its repetition.   \nSome is really interesting though.\n\n"
    },
    {
      "time": "10 Jun 2004 — 5:18am",
      "content": "My brother and I found a huge box of giant white chalk sticks in a parking garage years ago. We spent the rest of the afternoon drawing cartoons and type everywhere. And since it would all wash away, we did our deeds in broad daylight.   \n   \nSince then, I've never tagged illegally.   \n   \nI do love getting 'stuck' at railroad crossings; it's a free graffiti show, from boxcar to boxcar to...\n\n"
    },
    {
      "time": "10 Jun 2004 — 8:42am",
      "content": "I suppose professional typographers/lettering artists rarely get in to graffiti since they already have a channel for their creativity and self expression. I work with graffiti artists that are channeling their skills toward design and typography, they do less graffiti now.\n\n"
    },
    {
      "time": "10 Jun 2004 — 11:01am",
      "content": "i'd give my right hand to see some of the typographers on this board try and do graff. not neccaserly on walls, because i see how many of you dislike the illegal factor of the craft, but on paper too.. to do a battle for typophiles only on the 12ozProphet.com board :] wouldnt that be great?   \n   \nBJ - are the pics in the book of his blocky works?   \n   \n\\> That three-dee piece is mind-boggling!   \n\\> If lettering/calligraphy is music, this   \n\\> is free jazz.   \n   \nor maybe its rap? :]\n\n"
    },
    {
      "time": "10 Jun 2004 — 11:47am",
      "content": "I've been doing research for some grafitti/ stencil graf-based design work. I'm really drawn to the stencil stuff.\n\n"
    },
    {
      "time": "10 Jun 2004 — 11:49am",
      "content": "Wow, I can't believe i missed this post ALL week long!   \n   \nI have been working on a type foundry/ book project for the past year. Working with artists documenting, converting and digitizing their handstyles into fonts. Currently we are working with:   \n-ESPO (Philly, and NYC, mentioned and flicked above)   \n-JOKER (Portland)   \n-SABE (NYC)   \n-MESK (DC,Philly, NYC)   \n-MESH AOK (NYC)   \n   \nSimiliarly to Itay K's notion that there are similiarities between graf and calligraphy, our premis is that their is a huge connection, particularly in the practice of and development of style. Outsiders rarely notice, but anyone who will take the time to look will notice that their is a cohesive style connected with regions and cities not unlike calligraphic style development.   \n   \nSouthern California has always had an angular Cholo/Mexican style to their letterforms. Philly has tall prints where the letters overlap at a very aggessive script style, NYC has very bold and loud styles, particularly the throwup, which could be argued is an invention brought about as a result of trying to write in New York, where the streets are always busy, and it pays to cover the most real estate in the shortest ammount of time to paint it.   \n   \nYou can check out the thesis at our website:   \n [http://handselecta.com/one.html](http://web.archive.org/web/20150418111115/http:/handselecta.com/one.html)   \n   \nOur sites a little outdated but we are hoping to have it updated with new info and online font sales sometime this fall.   \n   \nUnfortunately I can't yet post samples of the fonts in progress but after they are approved and finished working through with their respective artists, I'll try to post some. And yes we are implementing OT (as soon as I figure it out. FL is a massive program to teach yourself, 2 years and I only utilize about 1% of what it can do).   \n   \nItay K and any others interested in finding out more can email me.   \n   \nChristian   \n   \nPS, Yes, I write graffiti (actually I retired, from it) And I also have a formal Design education as well.\n\n"
    },
    {
      "time": "10 Jun 2004 — 12:28pm",
      "content": "Itay K - Quote:\"bj, i havnt read that book. does it have pictures of ESPO's (aka Stephen Powers) work inside? he's considered by many a lousy writer because he only did blockbusters, no bombing or complex pieces. his work is plainly typographic in comparison to the general nyc graffiti trends and traditions.\"   \n   \nAu Contraire Monfraire, Don't you even go there. Me without a mic is like a beat without a snare....   \n   \nCheck out ESPO's work here.   \n   \n ![Espo Tag](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38002.jpg)   \n ![Espo Truck](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38003.jpg)   \n ![Espo Wall](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38004.jpg)   \n ![Espo Throwie](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38005.jpg)   \n   \nHe's put in LOTS O' Work through the years, and his blockbuster styles only represent the last few. Tags, Throwups and crazy pieces. His stuff is very typograpjically influenced though, which I've always like personally.   \n   \nThe book is worth checking out. short biographical chapters about specific writers and their stories. Lots of good pictures.   \n   \nChristian\n\n"
    },
    {
      "time": "10 Jun 2004 — 2:44pm",
      "content": "Chris,   \n   \ndo you know of Logan Hicks and workhorse?   \n   \n [http://www.workhorsevisuals.com/phpBB2/loganbutton.html](http://web.archive.org/web/20150418111115/http:/www.workhorsevisuals.com/phpBB2/loganbutton.html)   \n   \nChristian\n\n"
    },
    {
      "time": "10 Jun 2004 — 3:56pm",
      "content": "Not grafitti but great sidewalk drawings.....keep in mind the surfaces are FLAT!   \n   \ngln   \n   \n ![2.jpeg](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38056.jpg)   \n ![6.jpeg](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38057.jpg)   \n ![4.jpeg](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38058.jpg)\n\n"
    },
    {
      "time": "11 Jun 2004 — 10:51am",
      "content": "Here are an example of my work.   \n   \nDEZER.DE   \n   \n [www.OBSekte.de](http://web.archive.org/web/20150418111115/http:/www.obsekte.de/)   \n   \nRESPECT ANY ARTFORM   \n   \nPEACE   \n ![Sickmoves](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38113.gif)\n\n"
    },
    {
      "time": "11 Jun 2004 — 10:58am",
      "content": "Nice.   \n   \n\\> many of you dislike the illegal factor   \n   \nActually, to me that's its redeeming virtue! :-)   \n   \n\\> i'd give my right hand to see some of the   \n\\> typographers on this board try and do graff.   \n   \nThen I hope you're left-handed. ;-)   \nOr do you already only have a right hand? That would explain the all-lc. ;-\\>   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:09am",
      "content": "Itay - I brought the book to the office today   \nso I'll throw something up when i have   \nsome time this afternoon.   \n   \nMarcus, welcome to Typophile.   \n   \nChristian, I have a license to Sailor Gothic. Nice work. I'm very interested   \nto see what's in store with Handselecta.   \n   \nbj\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:15am",
      "content": "I really like the sick moves logo. Great chisel tip work. Focusing on the forms alone, I think this is a great example of digitized handlettering, that isn't so far from a stage that could become a font witha little work at finding a rhythm and regularity throughout it, sometimes it's as easy as setting a definite x and cap heights. Marcus, I encourage you to blow this out into a full character set. I really like it's feel.   \n   \nBJ, thanks for the kind words. I'd love to know what you've done with it.\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:24am",
      "content": "BJ,   \n   \nA couple of your fonts in the reverb project on your site are pretty successfull as graffiti fonts. From what I could tell on screen at least, they fly by pretty fast in the flash animation.   \n   \nC\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:34am",
      "content": "Marcus,   \n   \nIt took me a while to decode.   \nSick Motels? Stick Models?   \n   \nSo, (and with no disrespect, I'd just like to know) two questions:   \n   \n1. Are authenticity and legibility mutually exclusive?   \n   \n2. Why is \"Magazine\" so default and easy to read?\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:35am",
      "content": "whatever is on there is really old.   \nwe haven't updated   \nin about 20 months, but we haven't   \nabandoned that\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:40am",
      "content": "also:   \n   \nMarcus -- it might create a nicer effect if you fill in the interior (white) counters ... dunno.\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:42am",
      "content": "Have you guys checked out 'Writing' from Die Gestalten Verlag? [http://www.die-gestalten.de/flash.php](http://web.archive.org/web/20150418111115/http:/www.die-gestalten.de/flash.php)   \nit's brilliant, it's about what they call urban calligraphy and has a beautiful flow from tag to throw-up (not as in 'vomit') to piece and beyond.   \n   \nI think that graffiti is too broad to be treated as one thing, there are tags, throw-ups, pieces, posters, stencils and wayyyy more stuff that's sort of hard to categorise simply as 'graffiti', ZAST and AKIM and loads of other people are doing some pretty cool 3D things, sort of like graffiti-sculpture.   \n   \nIf you're into stencils, I have a few that you can download, print out, glue on to cardboard and cut out at my site, in the Type section, sorry about the self plug...   \n   \nThe illegal factor of graf is a bit dodgy to me, I live in a house that is constantly bombed by crap 'artists'. (on top of that, I'm the guy responsible for cleaning the building.) On the other hand, I'd find my town more dull without graffiti. I also appreciate the fact that risk and urgency is part of the craft.\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:51am",
      "content": "Nick,   \n   \nI think it may just be a case of practice, outsider vs insider. Blackletter is damn near impossible for most people outside of our community to read, even I wouldn't want to read any substantial text in it, yet it's legibility is something that changes with a viewer who is accustomed to it. there are blackletters that are more legible and blackletters that are more ornate.   \n   \nThe word magazine in the extended sans simply adds a contrast.   \n   \nLegibility is obviously important, but sometimes not as important as other things though. Judging everything based upon legibility is a slippery slope. It can deny innovation.   \n   \nI agree with BJ, the outline version above may be better seved as an alternate version, focusing on the forms in black without the outline would be better serving.   \n   \n\"Writing\" is a very cool book, great concept.\n\n"
    },
    {
      "time": "11 Jun 2004 — 11:58am",
      "content": "Graffiti (especially the complex pieces) are definitely 'coded', I agree with Christian on the blackletter comparison, back in the day, Northern Europeans found latin script hard to read.\n\n"
    },
    {
      "time": "11 Jun 2004 — 12:05pm",
      "content": "\\> Are authenticity and legibility mutually exclusive?   \n   \nMaybe for Graffiti they are, to some extent (as Kenn says). But in general not necessarily: like in contemporary Armenian type design the best way to regain functionality\\* is to revive authenticity.   \n   \n\\* In this case readability though, not legibility.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jun 2004 — 1:40pm",
      "content": "\\>outsider vs insider   \n   \nI don't accept that this concept has anything to do with legibility.   \n   \nCertain groups of people (to whom graffiti speaks), are able to decode it because (a) they have some familiarity and expectation of what the words will say. \"Sick Moves\" is not a general figure of speech.   \nAnd (b), they are willing to take the effort to decode the text, because they realize it's targeted at their demographic.   \n   \nConsequently, I suspect that if a blind scientific test were to be given, showing fresh graffiti to two groups of people (1) graffiti-philes and (2) graffiti-indifferent, with text that was well-known to both groups, that there would be no difference in \"legibility scores\".   \n   \nThe cryptic quality of graffiti is perverse and elitist. Graffiti artists don't want to share the meaning.   \nWhich is fine, but it has nothing to do with learning how to read a style of typography.   \n   \nPerhaps a better comparison than Blackletter script would be Psychedelic rock posters.   \nBTW, Victor Moscoso will be at TypeCon -- is that cool or what?!   \n   \nThere is a problem if graffiti is to be considered a legitimate typographic art form, rather than as graphic decoration: it's a little too easy to hide a lack of design skill behind cryptic forms.   \n   \n\\>Judging everything based upon legibility is a slippery slope. It can deny innovation.   \n   \nConversely, it's easy to be innovative when you don't have to be legible -- and that devalues the quality of innovation.   \n   \nLegibility is the \"sine qua non\" of typography -- which is why I can respect graffiti as graphics, but not as typography.   \n   \nPerhaps I am expecting too much, and it's impossible to create graffiti art that communicates broadly without selling out.   \n   \nHowever, it has been done -- Keith Haring was able to transcend the genre.\n\n"
    },
    {
      "time": "11 Jun 2004 — 2:12pm",
      "content": "Nick, they are very legibitable to the audience they want to reach. Other gangs. It says don't try to sell your drugs here or die. Simple. There is really nothing nice about graffitti, at least not in NYC.\n\n"
    },
    {
      "time": "11 Jun 2004 — 2:19pm",
      "content": "Wow, Daniel, I don't think I've ever heard someone speak so loudly on a topic they were so evidently ignorant of. First of all, NYC graffiti has nothing to do with gangs, and wether you appreciate or hate the legality of it. at least you could acknowledge that this discussion is based around letterforms and thir relationship form typography to graffiti.\n\n"
    },
    {
      "time": "11 Jun 2004 — 2:31pm",
      "content": "Well Christian, you live in a fairyland if you don't understand the symbolism of grafiti. Why do you think its a crime to create graffiti. They just convicted a 32 yr old graffiti artist here today. Its not about art or letterforms\n\n"
    },
    {
      "time": "11 Jun 2004 — 2:43pm",
      "content": "again, graffiti is so many things and the purpose of graffiti differs across the whole range.   \nIn my opinion a tag is what a dog does when it's out walking, it's marking the territory, it's showing off, hell all graffiti is about showing off to some extend, but then again all art is... I'm going nowhere with this.   \n   \nWould it make more sense to compare graffiti to musical notes or hobo signs? They're secretly coded languages too, one could argue that 'normal' written language is that too.   \n   \nDaniel, are you saying that there are no aesthetic value in graffiti whatever?\n\n"
    },
    {
      "time": "11 Jun 2004 — 2:50pm",
      "content": "Nick, I appreciate your skepticism, it helps to decvelop this conversation further.   \n   \nI think you raise some good points, first of all, your correct graffiti is not typography, not yet, at least in any quality form. It is absolutely a form of contemporary calligraphy however. A very established and probably much more practiced form than most traditional calligraphy styles today. And within this world of contemporary graffiti (which is less than 50 years old) different cities (in the states) established different styles. Most writers within a city will have a similiar style ie) my reference to blackletter earlier. This is what intrigues me, the developments of scripts that have geographical characteristics.   \n   \nAs for point A) peoples familiarity and expectations:   \n   \nMost graffiti writers are primarily writing their nicknames (a nom de plume) which is usually a 4-6 letter word or acronym or just a rediculous group of letters that the artist thinks look good together. It's not always a pop cultural reference, which means that there is not always an in to deciphering it based on hip hop lingo.   \n   \n\"Conversely, it's easy to be innovative when you don't have to be legible -- and that devalues the quality of innovation.\"   \n   \nThat is a very good point, however I think that there is room for an evolution in craft, and applying the rules developed for modernist typography is hardly fair to apply to art forms developing independent of that. There are certainly great things to take from the modernist or classicists but in this case I find that these traditions can be limiting, and the new forms worth pursuing .   \n   \nI have been looking to the development of type based upon calligraphy, to draw corelations. I have been reading Tracy, Chappel, and Bringhurst, and found a good book called Calligraphic Type Design in the Digital Age, which focus' on Zapf. If anyone has any suggestions of authors who look at the development of typography from a calligraphic standpoint, please share. I'd greatly appraciate it.   \n   \nC\n\n"
    },
    {
      "time": "11 Jun 2004 — 3:04pm",
      "content": "Daniel, I live in a borough of Fairyland called Brooklyn.   \n   \nI think we can disagree civily don't you? If you have honest criticism of where graffiti and type do not mix, by all means we would love to hear your insites, but the belief and statement that graffiti is no more than gang vandalism is either a gross exageration on your part or a missunderstanding and lack of experiencing any of the best this artform has to offer. At it's heart it is an art about letterforms, the same way that calligraphy, and typography are.   \n   \nI hope we can continue to disagree in a way that is beneficial to the conversation as a whole.   \n   \nWould you mind sharing where you saw that story or who the artist was who was arrested in NYC today?   \n   \nChristian\n\n"
    },
    {
      "time": "11 Jun 2004 — 3:29pm",
      "content": "\\> they have some familiarity and expectation of   \n\\> what the words will say. \"Sick Moves\" is not   \n\\> a general figure of speech.   \n   \nAnd \"sick motels\" is?   \nGraffiti-aware people also have some familiarity with the \"coded\" letters themselves, and/or the _ways_ in which they might be encoded - you of all people should note that.   \n   \n\\> they are willing to take the effort to decode the text, because they realize it's targeted at their demographic.   \n   \nSome people -like me- are willing to make the effort even if they know the message isn't for them. They might find that stimulating/fun. Like watching a movie in a language you don't know - I personally can't get enough of that.   \n   \n\\> The cryptic quality of graffiti is perverse and elitist.   \n   \n?   \nI'd rather see it as playful, challenging.   \n   \n\\> it's a little too easy to hide a lack of design skill behind cryptic forms.   \n   \nBut good \"encryption\" is a design challenge of itself! And I don't think you can really innovate if you totally ignore legibility - it's in _twisting_ it properly that there is creativity.   \n   \nThat said, graffiti is not typography. Not because it's less developed, but because the letters are 100% contextual. And it's not calligraphy either, because ductus is not its essence. It's lettering.   \n   \n\\> Why do you think its a crime to create graffiti.   \n   \nBecause it costs the rich money?   \n   \nBTW, Daniel, you race bikes? Street luge is so much more interesting. And it's illegal too.   \n   \n\\> They just convicted a 32 yr old graffiti artist   \n   \nYeah, they convicted Nelson Mandela too once.   \n   \n--   \n   \nChristian, it's nice to see you studying the past, but looking to the future. However, concentrate on lettering, not calligraphy.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jun 2004 — 3:37pm",
      "content": "Hrant,   \n   \nyeah, I've spoken to a couple of designers who've mentioned similiarities in my hypothesis about geographic styles to sign painters/letters, but I have found this a hard subject to research outside of one or two picture books on English pubs or Inn's.\n\n"
    },
    {
      "time": "11 Jun 2004 — 3:43pm",
      "content": "There are a number of lettering gurus, especially in the US (like John Downer), and they're generally accessible - like at TypeCon - see you there? Plus there's more lettering litterature coming out lately, not to mention fonts. Ask around here and you'll be flooded, I'm sure.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jun 2004 — 3:56pm",
      "content": "Does anyone have A History of Calligraphy by Albert Gaur? Pretty good for the most part. A lot of info on non Latin, Arabic and Asian forms of calligraphy.   \n   \nWhen looking at tags (albeit the least favorite form for non practioners) what most people who are not accustomed to reading graffiti miss is that each artist usually has very consitent forms from one tag to the next. Its the free play in scale and dimension that makes it hard to look at it in a similiar light as historic calligraphy, but when they are measured and rythmic on purpose, it creates a new thing, a hybrid of graffiti and calligraphy. My interest lies in the in between stage, regularizing calligraphy (or in this case, graffiti).   \n   \nThats it for now. I'll be back later, with some examples of geographic styles.\n\n"
    },
    {
      "time": "11 Jun 2004 — 10:47pm",
      "content": "Weird, how we got from graffiti to English pub lettering... (Which is brilliant BTW, funny how that skill is far better developed in Britatin than enywhere else I've been.)   \n   \nI used to hate the tag too, because it was just a scrawl, but something has happened, both with me and on the tag scene, more differing styles now. I still don't like throw-ups much.   \n   \nI think that tags can be compared to calligraphy, but I agree with Hrant that pieces are lettering.\n\n"
    },
    {
      "time": "12 Jun 2004 — 6:22am",
      "content": "QUOTE:   \n\"I think that tags can be compared to calligraphy, but I agree with Hrant that pieces are lettering. \"   \n   \nI think thats a good distinction, Kenn\n\n"
    },
    {
      "time": "12 Jun 2004 — 8:47am",
      "content": "perheps the most important distinction to make is that writers are artists and not designers. their biggest objective it self expression. like realism is for the visual artist, legibility is a tool for the writer. to get your name known, it is sometimes most rational to simply paint your name over some highway or factory building in big  fat letters (thats called a blockbuster). usauly though, there are more importent things then having everyone know you're around, and sometimes having a distinct style is more 'profitable' (in terms of getting your name known) to the writer.   \n   \nalot of times writers do pieces which are abstract and complex. they dont do that because they are elitist or because they dont care about the structure of letters, but because they have a more important objectives then to be legible.   \n   \n ![Daim](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38186.jpg)   \n   \nthe funny thing, nick, is that ive met some writers who think alot like you. they belive that graffiti should be legible all the time. some of them think graffiti has rules, like typography styles have.   \ni think that once you make graffiti into a branch in typography it loses all its charm.   \n   \n\\> Then I hope you're left-handed. ;-)   \n\\> Or do you already only have a right hand? That would explain the all-lc. ;-\\>   \nlol.. that would be a grand excuse! unfortunetly im just plain lazy :D   \nuhm, i'd give my remaining hand if everyone here would speak in my mother tongue..   \n   \nwhat, nobody wants to battle?   \nwhat are you.. men or typographers..?   \n   \n\\> Would you mind sharing where you saw that story or who the artist was who was arrested in NYC today?   \nmaybe he's reffering to COPE2...?   \n   \nchristian, have you seem Os Gemeos' handstyle?   \n ![Os Gemeos (\"The Twins\")](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38187.jpg)   \n   \ndaniel, christian has done graffiti.. so when he says that graff aint about gangs nowadays, i think its safe to belive him. i have seen writers get violent, but it was just average urban bad-tempered people.   \n   \n\\> Have you guys checked out 'Writing' from Die Gestalten Verlag?   \nyeah, i own a copy. its an awesome book. highly recommended. the pictures are beautiful and the articles interesting.   \nthe only downside is that they concentrated too much on german writers.   \n   \n ![Akim](http://web.archive.org/web/20150418111115im_/http:/www.typophile.com/forums/messages/30/38188.jpg)\n\n"
    },
    {
      "time": "12 Jun 2004 — 9:33am",
      "content": "Os Gemeos is great. awsome control of a roller. almost cholo/SoCal in his letterforms. Where is he from?\n\n"
    },
    {
      "time": "12 Jun 2004 — 9:51am",
      "content": "\\> their biggest objective it self expression.   \n   \nIf it was _communication_ instead, that would be more useful.   \n   \n\\> some of them think graffiti has rules   \n   \nIt must. And [controlled] illegibility could be one of them.   \n   \nhhp\n\n"
    }
  ]
}
