{
  "id": "53266",
  "title": "1935 Optima-like type from Gill",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In my copy of _Twentieth Century Type Designers_, Sebastian Carter writes,\n\n\"In September 1935 Gill drew for Monotype a stressed sans-serif type with many prophetic qualities: it looked forward to Hermann Zapf's 'serifless roman' Optima of nearly a quarter of a century later. Although it was given a series number (430), and a few trial sorts were cut, it was never issued to the trade.\"\n\nHas anybody here seen these trials or reproductions thereof?\n\n",
  "author": "<a href=\"/web/20100213085541/http://www.typophile.com/user/3254\" title=\"View user profile.\">eliason</a>",
  "time": "<br>",
  "uid": "3254",
  "comments": [
    {
      "time": "",
      "content": "I saw the original Gill drawings for this series in a folder in the Monotype Type Drawing Office. From what I can remember it was not very good. To say it was like Optima would be giving it too much credit, probably closer to Albertus in its design. My last view of it was over 20 years ago, perhaps someone from Monotype can tell what has become of the originals.\n\n"
    },
    {
      "time": "",
      "content": "I'd expect that the engineering drawings would still be at Salfords, as the collection seems to be intact. The library doesn't consist of many original designer drawings, these were usually returned to the designer, but you never know. Robin Nicholas should be able to let you know, and I'm sure you could set up a visit if you're in the area.\n\n"
    },
    {
      "time": "",
      "content": "I dug around a little this morning and found the engineering drawings for Series 430, as well as a copy of the trial setting. I've posted a scan of the trial, a bit more information, and a few rough pics of the drawings themselves here:\n\n[http://www.ultrasparky.org/archives/2009/01/unreleased\\_unti.html](http://web.archive.org/web/20100213085541/http:/www.ultrasparky.org/archives/2009/01/unreleased_unti.html \"http://www.ultrasparky.org/archives/2009/01/unreleased\\_unti.html\")\n\n"
    },
    {
      "time": "",
      "content": "As far as this proposed face's \"looking forward\" to Optima, it may also be worthwhile to look backward a few years to R. Hunter Middleton's Stellar, cut for the Ludlow Typograph.\n\nIt is an interesting progression from Stellar to series 430 to Optima. The idea of the stressed sans was certainly in the air among typeface designers and manufacturers.\n\nThere are a few takes on Optima available today:\n\n[http://new.myfonts.com/fonts/spiecegraphics/stellar-classic-sg/](http://web.archive.org/web/20100213085541/http:/new.myfonts.com/fonts/spiecegraphics/stellar-classic-sg/ \"http://new.myfonts.com/fonts/spiecegraphics/stellar-classic-sg/\")  \n [http://new.myfonts.com/fonts/agfa/stellar/](http://web.archive.org/web/20100213085541/http:/new.myfonts.com/fonts/agfa/stellar/ \"http://new.myfonts.com/fonts/agfa/stellar/\")\n\nThanks very much to Craig and Dan for sparking this look at the Gill project.\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "<cite>There are a few takes on Optima available today:</cite>\n\nSurely you mean Stellar.\n\n"
    },
    {
      "time": "",
      "content": "yes. i do mean stellar. too early when i did that. thanks\n\n"
    },
    {
      "time": "",
      "content": "Dan, sweet post! Are you working on this?\n\n\"A new Knowledge Transfer Partnership  \nThe Department of Typography & Graphic Communication and Monotype Imaging Ltd, a leading supplier of fonts and digital imaging technologies to a global customer base, have been awarded KTP funding to develop a strategy for bringing to market fonts based on the company's archive of historic drawings for legacy typemaking technologies.\"\n\n(from [http://www.rdg.ac.uk/typography/about/typ-news.asp](http://web.archive.org/web/20100213085541/http:/www.rdg.ac.uk/typography/about/typ-news.asp \"http://www.rdg.ac.uk/typography/about/typ-news.asp\"))\n\nIf so, how's it going? Can you reveal what you're working on? Or is it all super secret?\n\n"
    },
    {
      "time": "",
      "content": "_As far as this proposed face’s “looking forward” to Optima, it may also be worthwhile to look backward a few years to R. Hunter Middleton’s Stellar, cut for the Ludlow Typograph._\n\nIn fact Carter uses almost the exact same phrasing he used with Gill when he gets to Middleton: \"Stellar,...while not being a conspicuous success foreshadowed in some respects Hermann Zapf's Optima of thirty years later.\"\n\n@ultrasparky: amazingly helpful and interesting - thanks so much for posting this!\n\n"
    },
    {
      "time": "",
      "content": "Yes indeed, I am the associate for the Knowledge Transfer Partnership, as of last month. I'll spend the next two years working with Monotype on non-Latin fonts, and digging for more treasure in the archives when I have the chance. (I get really giddy when I see some of the stuff tucked away in there, especially stuff like this that never made it to the light of day.)\n\n"
    },
    {
      "time": "",
      "content": "This is Stellar, from the American satirical magazine _Ballyhoo_, Feb. 1932.  \nPrinted rotogravure with dark brown ink. Not sure how white the stock was originally.  \nThe text is in Vogue, an American Futura clone with a less austere \"a\" and really big dots on the \"i\".\n\n ![](http://web.archive.org/web/20100213085541im_/http:/typophile.com/files/Stellar_4130.jpg)\n  \n\n ![](http://web.archive.org/web/20100213085541im_/http:/typophile.com/files/Stellar2_6468.jpg)\n\nSpeaking of presaging, this spoof has something of the famous DDB Chivas ad (art directed by Helmut Krone) that heralded the \"Creative Revolution\" of 30 years later.\n\n ![](http://web.archive.org/web/20100213085541im_/http:/typophile.com/files/chivas_4691.jpg)\n  \nSet in Caslon, but the type treatment is not too much different than the way he handled Futura in the VW ads.\n"
    },
    {
      "time": "",
      "content": "Something here reminds me of another current thread, the one dealing with the position of a colon. In Nick's Stellar example, the comp should have raised that hyph in AD-WRITER. This looks terrible. To say nothing of the spaces L & R of the hyph.\n\nThanks, Nick, for posting an example of the \"real thing.\" That's better than my ref to www pages. In the examples they show, subtle [or maybe not so subtle] changes may have been introduced as faces became adapted for different technologies.\n\npowers\n\n"
    }
  ]
}
