{
  "id": "5327",
  "title": "Bickham Script... I'm pissed...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I would love to know if anyone else is having trouble with Adobe with regard to Bickham Script... the full version... swashes... ornamentals... ligatures... the real deal.\n\n",
  "author": "<a href=\"/web/20090819100512/http://typophile.com/user/4045\" title=\"View user profile.\">es_watson</a>",
  "time": "<br>",
  "uid": "4045",
  "comments": [
    {
      "time": " 22.Jun.2004 8.20pm",
      "content": "Can you describe the kind of trouble you're having?\n\n"
    },
    {
      "time": " 23.Jun.2004 2.36pm",
      "content": "I've had Bickham since it came out and never had a problem.   \nWhat system, computer, software, version, etc., are you using and what is happenning that you call \"trouble\"?\n\n"
    },
    {
      "time": " 23.Jun.2004 4.37pm",
      "content": "Also, what version of Bickham Script? The old Type 1 MM version (Bickam Script MM), or the newer OpenType version (Bickham Script Std)?   \n   \nThere's also a Bickham Script Pro in the works, which exploits OpenType technology to the max. It is very very nice indeed.   \n   \nT\n\n"
    },
    {
      "time": " 1.Jul.2004 10.08am",
      "content": "If you're talking about the OpenType version, as far as I know, you can't utilize the swashes, etc. unless you have a program that can read its' Unicode encoding. Quark won't. So far, the only ones I've found that will are the new Adobe CS products. (insert glyph under the type menu)   \n   \nAnyone else finding the same thing?\n\n"
    },
    {
      "time": " 1.Jul.2004 2.34pm",
      "content": "i've always had a problem with the old type 1 MM version. specifically, the swash caps. i usually have to convert to outline in order to print. it sucks, but i gave up trying to figure it out...\n\n"
    },
    {
      "time": " 1.Jul.2004 4.21pm",
      "content": "Chey: What kind of printer were you printing to? Make, model, amount of RAM? If PostScript, Adobe PostScript or a clone? What exactly happened when it wouldn't print?   \n   \nAmber: You've basically got it. For what it's worth, Quark claims that QXP 7 is expected to know Unicode and OpenType layout features.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 2.Jul.2004 1.52am",
      "content": "_\\> Quark claims that QXP 7 is expected to know Unicode   \nand OpenType layout features._      \n   \n ![](http://web.archive.org/web/20090819100512im_/http:/www.typophile.com/forums/clipart/rofl.gif)\n\n"
    },
    {
      "time": " 2.Jul.2004 3.54pm",
      "content": "\\> Quark claims that QXP 7 is expected to know Unicode   \nand OpenType layout features. \\<   \n   \nI think Yves is quite right about Quark. Since it takes them at least 4 years to make a revision, it is unlikely that they will be in business long enough to discover Unicode. So to quote assorted Valley Girls, \"As IF!!!\"   \n:-)\n\n"
    },
    {
      "time": " 2.Jul.2004 3.59pm",
      "content": "![](http://web.archive.org/web/20090819100512im_/http:/www.typophile.com/forums/messages/30/39859.gif)\n\n"
    },
    {
      "time": " 2.Jul.2004 4.24pm",
      "content": "Alessandro,   \nDid you fall in love with a young lady at a hotel in Poland?\n\n"
    },
    {
      "time": " 2.Jul.2004 4.33pm",
      "content": "Yes, but the hostel was in Rome,   \n [www.hostelalessandropalace.com](http://web.archive.org/web/20090819100512/http:/www.hostelalessandropalace.com/)   \nI slept there during ATypI 2002.\n\n"
    },
    {
      "time": " 2.Jul.2004 5.15pm",
      "content": "Thomas: so now that i've opened my big mouth, i'm wondering if i don't just have a corrupt file or somesuch...   \n   \ni purchased bickham as a download from veer.com and, on my creaky old mac with shamefully old software (we're talking pre system 8.5, G3 upgrade card, Illustrator 8...), i get the \"can't print... missing outline file/ATM not turned on\" error when trying to use swash caps - even though i seem to have all appropriate files and ATM is turned on. plus, i can \"create outlines\" in Illustrator. i don't have this problem with any other fonts, but given the vintage of my system, i figured tech support would tell me i'm SOL.   \n   \ni did have a friend test it on her whizzy G4 a while back, and from what she said, it sounded like she saw a problem as well. though, in rereading her description (\"disappearing text\"), i'm wondering if she just didn't type in any actual caps. doh!   \n   \nin any case, if you have any suggestions (other than buy a new computer), i'd love to hear 'em! like i said, converting to outline works, but it would be nice to not have to do so. ![:-)](http://web.archive.org/web/20090819100512im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 2.Jul.2004 5.31pm",
      "content": "Chey:   \n   \nHmmm. I have to admit, that the vintage of your stuff is old enough, my memory of relevant details is starting to fail. So are you saying that the non-swash Bickham works, and the problem you're having is only with the swash caps?   \n   \nT\n\n"
    },
    {
      "time": " 2.Jul.2004 6.12pm",
      "content": "Thomas: yup! you got it. i'm working in the dark ages. non-swash is fine. swash is bad.   \n   \ni may try on hubby's newish powerbook because now i'm really curious to see what will happen...   \n   \nanything i need to know about MM typefaces and newer versions of the OS? is ATM no longer part of the picture, etc?\n\n"
    },
    {
      "time": " 2.Jul.2004 6.18pm",
      "content": "I have just retried Bickham. It is the old type 1 MM circa 1997. It worked fine on my old Mac 8500 with System 9 and just fine on my G5 2gig with Panther as well. I use Suitcase if that matters.   \nAttached is a copy of my test and a screenshot of the info about the font if that helps Thomas.   \n   \nChrisL   \n ![testfile](http://web.archive.org/web/20090819100512im_/http:/www.typophile.com/forums/messages/30/39869.gif)<!--attachment: Bickhaminfo-39870.pdf*mime_pdf.gif*application/pdf*23.6*infoscreen*Bickhaminfo%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20090819100512im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">infoscreen<br><a href=\"http://web.archive.org/web/20090819100512/http:/www.typophile.com/forums/messages/30/Bickhaminfo-39870.pdf\" target=\"_blank\"><b>Bickhaminfo.pdf</b></a> (23.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment-->\n"
    },
    {
      "time": " 2.Jul.2004 6.26pm",
      "content": "hrm... Chris' set up is similar to mine. i use suitcase as well (probably terribly old version, but i also think i tested bickham by putting straight into the fonts folder); however, i'm on an older version of the OS (8.1, anybody? \\*cringe\\*). but if bickham is circa 1997, it should work, yes? it's just odd because i'm limping along fine with all my other fonts. my vote is for corruption of some sort...\n\n"
    },
    {
      "time": " 2.Jul.2004 6.32pm",
      "content": "Chey: It could indeed be font corruption. That was always a problem, particularly on that era of OSes. If you can't find your original disks to reinstall from, you could either call customer service or nab something from a colleague (with the understanding that you are already licensed for this software).   \n   \nIf you want to run the same font in OS X with native apps, you don't need ATM. Just be sure you have 10.2 or higher, and read the notes on MMs and OS X which can be found here:   \n   \n\\< [http://www.adobeforums.com/cgi-bin/webx?13](http://web.archive.org/web/20090819100512/http:/www.adobeforums.com/cgi-bin/webx?13)@ [29.sxt4cq59l8t.0@.ef6eec0](mailto:29.sxt4cq59l8t.0@.ef6eec0)/78\\>   \n   \n(if the link doesn't work by clicking, try cutting and pasting the entire thing)   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 2.Jul.2004 6.57pm",
      "content": "Chey,   \nI am attaching a poster I did in 1999. I probably was using Sys 8.5 at the time. As you can see, the swash caps printed fine.   \n   \nChrisL ![poster](http://web.archive.org/web/20090819100512im_/http:/www.typophile.com/forums/messages/30/39873.jpg)\n\n"
    },
    {
      "time": " 2.Jul.2004 11.53pm",
      "content": "thanks for trying to help - it's much appreciated! ![:-)](http://web.archive.org/web/20090819100512im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nunfortunately, no disks. it was a download, and i think the prob is at veer's end o' things. bickham was actually a fairly recent purchase for me and i've had this problem since the first use. (i also seem to recall downloading a fresh copy on the chance the initial download got messed up - but had the same problems.) ah, well. i'll see what i can do...   \n   \nthanks again!   \n   \nChris: dig the poster!\n\n"
    },
    {
      "time": " 3.Jul.2004 2.36am",
      "content": "Mr. Chris Lozos, I dig your poster too!   \nHere is the inside of a wedding card I designed,   \nit was printed with a dark brown on a light yellow   \nFedrigoni paper.   \n ![](http://web.archive.org/web/20090819100512im_/http:/www.typophile.com/forums/messages/30/39883.gif)\n\n"
    },
    {
      "time": " 3.Jul.2004 5.07am",
      "content": "Chey --   \n   \nI have an old Mac that I still use periodically -- a first-generation G3 tower running OS 8.1 with 256 Mb RAM -- and Bickham Script MM works just fine. I use ATM Deluxe to manage my fonts. I don't happen to use (or have) Illustrator, so I can't verify that it works there. But it works fine in Quark 4.1, FreeHand 5.0, and FreeHand 8.   \n   \nIs it just the swash caps that give you trouble? What about the alternates, beginnings, and endings fonts?   \n   \n-- K.\n\n"
    },
    {
      "time": " 3.Jul.2004 5.24am",
      "content": "P.S.   \n   \n_\\>or nab something from a colleague (with the understanding that you are already licensed for this software)._   \n   \nI don't generally make a habit of this sort of thing, but if you really think it's corruption and you want to try again with fresh copies, then -- with Thomas's blessings -- I'd be willing to send you copies of the Bickham MM fonts that actually work on my OS 8.1 machine. Just to be on the up-and-up, though, I would want to see some proof of your Veer license/purchase. Contact me off-forum, if you want to pursue this.   \n   \nBut if the fonts are showing up properly on screen and the problem is just in printing, then I wonder if the culprit might not be a bad (or old) printer driver. What printer are you using?   \n   \n-- K.\n\n"
    },
    {
      "time": " 3.Jul.2004 11.38am",
      "content": "In principle, Veer's customer service should be willing to re-activate your download or otherwise re-send you the font, Chey.   \n   \nThis might be complicated by the fact that they no longer sell the MM version of the font, just the OpenType \"Standard\" version.   \n   \nT\n\n"
    },
    {
      "time": " 2.May.2006 4.27pm",
      "content": "Hi, I want to have a couple of sentences in Bickham Script Swash Caps but I have the Mac fonts and I work on a PC. Would anyone be willing to either send me the Windows version, or email me JPGs of the sentences I need in that font?\n\nMuch appreciated. Email me on [jallos@gmail.com](mailto:jallos@gmail.com).\n\nMany many thanks,\n\n"
    },
    {
      "time": " 3.May.2006 1.04am",
      "content": "“This might be complicated by the fact that they no longer sell the MM version of the font, just the OpenType “Standard” version.”\n\nHuh. I think we need a new pic of you without that smirk on your face. It’s starting to piss me off about Adobe. And I always had great respect for them.\n\nGerald\n\n"
    }
  ]
}
