{
  "id": "53296",
  "title": "UC Grotesk",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Not a typeface per se, but some letters I'm working on for a client. I'd love some crit! (Weight, curves, widths and such)\n\n ![](http://web.archive.org/web/20140713234003im_/http:/typophile.com/files/test_6417.png)\n\n",
  "author": "Frode Bo Helland",
  "time": "9 Jan 2009 — 9:20am",
  "uid": "17101",
  "comments": [
    {
      "time": "9 Jan 2009 — 9:37am",
      "content": "For a start:  \nS and R are too wide. The head of R is too big and too wide. There is too much weight difference on the S, make it more monoline. The upper curve could be shallower. A is too narow. E too wide. K too narrow, the upward stroke should sit higher. What happened to the H, man? Wasn’t there enough space? It’s the narrowest letter in there, very awkward.  \nThe spacing is very tight. Not a problem at this size, but if it’s going to be set smaller.\n\nBest, Jürgen\n\n"
    },
    {
      "time": "9 Jan 2009 — 12:25pm",
      "content": "Thanks, just what I'm looking for! I'm trying to do something along the lines of the irregular grotesks.\n\n"
    },
    {
      "time": "9 Jan 2009 — 2:20pm",
      "content": " ![](http://web.archive.org/web/20140713234003im_/http:/typophile.com/files/uc_grotesk_4513.png)\n\nSecond iteration. I think the R is what makes it charming. Thoughts?\n\n"
    },
    {
      "time": "10 Jan 2009 — 8:53pm",
      "content": "Good improvements.  \nThe break from horizontal to curved in the D seems too abrupt.  \nIs this the size it'll be? I find the ink traps a little distracting.\n\n"
    },
    {
      "time": "11 Jan 2009 — 3:21am",
      "content": "I agree on the ink traps. It'll be displayed in lots of different sizes.\n\n"
    },
    {
      "time": "11 Jan 2009 — 3:48am",
      "content": "At this size, the S looks somewhat thin in terms of stroke width.\n\n"
    },
    {
      "time": "11 Jan 2009 — 10:15am",
      "content": "In addition to the two comments above:  \nThe head of R hangs down (bottom curve), the leg is too light.  \nK: upward stroke a touch lighter, downward stroke a touch heavier and a bit steeper.\n\nIf it will be for lots of different sizes, i would do a version without ink traps for display sizes.\n\n"
    }
  ]
}
