{
  "id": "53341",
  "title": "Free/embeddable font similar to Helvetica",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi typemates,\n\nI am designing my new personal web site that is practically based only on typography (a sort of swiss style inspiration). The site is all set on Helvetica, but I know most of my visitors are Windows users and do not have it installed (and even if they had it, I think the rendering of Helvetica on a Windows browser wouldn't be nice at all).  \nSo I tried the fabulous [Typeface](http://web.archive.org/web/20140824071916/http:/typeface.neocracy.org/) script to replace my text and still make it accessible and gracefully degradable. My first choice was use Helvetiker, a ready-to-go Helvetica-like (actually Helvetica-clone) type, based on [MgOpen Moderna](http://web.archive.org/web/20140824071916/http:/www.ellak.gr/fonts/mgopen/index.en.html), but there's a serious problem: the font does not have some special characters I need, like cedilla (ç) and some accents (á, for example). These characters are essential for me, since the site has its main version on Portuguese.  \nI cannot use Helvetica itself since it is not embeddable. So anyone knows another free typeface very similar to Helvetica that has special characters?\n\nThanks\n\n",
  "author": "lailsonbm",
  "time": "10 Jan 2009 — 7:54pm",
  "uid": "17157",
  "comments": [
    {
      "time": "10 Jan 2009 — 8:09pm",
      "content": "Hum, I think I've already found it... =]\n\nSwansea  \n [http://www.fontspace.com/roger-white/swansea](http://web.archive.org/web/20140824071916/http:/www.fontspace.com/roger-white/swansea \"http://www.fontspace.com/roger-white/swansea\")\n\nLAILSON BANDEIRA\n\n"
    },
    {
      "time": "11 Jan 2009 — 3:12am",
      "content": "Arial?\n\n"
    },
    {
      "time": "11 Jan 2009 — 4:08am",
      "content": "Poor font! It's all bumpy and jaggy. I suppose that's what you get with a free font.\n\n"
    },
    {
      "time": "11 Jan 2009 — 5:09am",
      "content": "Bendy, I agree with you, but what can I do if big foundries does not cope with Internet reality? We need to embed fonts!\n\nLAILSON BANDEIRA\n\n"
    },
    {
      "time": "11 Jan 2009 — 5:09am",
      "content": "Bendy, I agree with you, but what can I do if big foundries does not cope with Internet reality? We need to embed fonts!\n\nLAILSON BANDEIRA\n\n"
    },
    {
      "time": "11 Jan 2009 — 5:51am",
      "content": "_\"but what can I do\"_\n\nBuild your site in Flash.\n\nI know that has other limitations; but if it's typographic control you're after, I personally don't see why you're putting up with HTML.\n\n"
    },
    {
      "time": "11 Jan 2009 — 5:59am",
      "content": "nops altaira,  \nbeing in html is more important than typography... =]  \naccessibility is a keypoint (I know flash has improved it, but HTML is still the king)\n\n"
    },
    {
      "time": "11 Jan 2009 — 5:28pm",
      "content": "[Τεχ Gyre Heros](http://web.archive.org/web/20140824071916/http:/www.gust.org.pl/projects/e-foundry/tex-gyre/heros).  \n—Joel\n\n"
    },
    {
      "time": "12 Jan 2009 — 4:54am",
      "content": "\"Bendy, I agree with you, but what can I do if big foundries does not cope with Internet reality? We need to embed fonts\"\n\nThat is funny. Helvetica/Arial is available on just about every computer in the universe.  \nSaying Arial is all bumpy and jaggy, or Helvetica on a Windows browser wouldn’t be nice at all, is puzzling.  \nWould another clone be better rendered if it's embedded? I don't think so. When you are making a web site, you don't have the choice of embedding universal quality because of the lack of embedding, in \"client agents\", not OS or fonts, or big foundries.\n\nCheers!\n\n"
    },
    {
      "time": "13 Jan 2009 — 10:09am",
      "content": "I was referring to the free font 'Swansea' as bumpy and jaggy, not Arial!\n\nArial is just dislikeable. But its ubiquity is an advantage here.\n\n"
    }
  ]
}
