{
  "id": "53358",
  "title": "2nd time around, do your worst!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Greetings comrades\n\nI have reworked my own business card and need some feed back before I print.  \nAny feed back would be great. Thanks!\n\n ![](http://web.archive.org/web/20131020222747im_/http:/typophile.com/files/Re_horizontal_businesscard_3520.jpg)\n\n",
  "author": "Typedog",
  "time": "11 Jan 2009 — 3:10pm",
  "uid": "37799",
  "comments": [
    {
      "time": "11 Jan 2009 — 5:55pm",
      "content": "Twer it me typedog, I would standardize the spacing between the letters (give them some air), and then I would futz with the \"counters,\" or interior spaces (open them up!!!), to reflect the spacing. That may counter the unfortunate double r's and z which unfortunately bring quite a bit of space to the equation. What I am saying is that there needs to be some daylight! You could probably heavy up the horizontals of the z's a tad also.\n\nMichael\n\n"
    },
    {
      "time": "12 Jan 2009 — 6:44am",
      "content": "Front: IMO there is no apparant relation between the upper and the lower half. No shared margins etc. Also the lower part is somewhat floating in space.\n\nBack is nice.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "12 Jan 2009 — 10:39am",
      "content": "Typerror and Bert both make good points...and I would suggest you definitely check your kerning on GUERRIZMO. I would also maybe bump up the weight of the rest of the text, because it looks mighty thin compared to your heavy type logo. For the G on the back, have you thought about using the same type as you have on GUERRIZMO? Throwing in a third typeface, like you have done, really separates the card into a Front and Back, instead of seeing this card as one complete unit.\n\nGood luck!\n\n"
    },
    {
      "time": "12 Jan 2009 — 12:12pm",
      "content": "Thanks for the advise people, There are only two font families in the whole design. I will rework with the suggestions.\n\nbert\\_vanderveen\n\nI intended to make the card as simple as possible because I not only work with younger people I also work with older business people.\n\nGuerrizmo+Design\n\n"
    }
  ]
}
