{
  "id": "53354",
  "title": "a",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "a\n\n",
  "author": "rbarker21",
  "time": "11 Jan 2009 — 12:24pm",
  "uid": "30659",
  "comments": [
    {
      "time": "11 Jan 2009 — 2:00pm",
      "content": "If I was that designer, I'd be pissed you were soliciting suggestions from third parties.\n\n"
    },
    {
      "time": "11 Jan 2009 — 2:23pm",
      "content": "You aren’t going to improve your designers results by undermining his work with ex parte advice.\n\n"
    },
    {
      "time": "11 Jan 2009 — 3:25pm",
      "content": "Should he not seek out all the advice he can get guys? I would not hesitate for one second.\n\nI just hate working with committees and if you, Richard, are going to pit one against the other then I agree with James and Nick. To be precise you become a pain in the ass customer.\n\nMichael\n\n"
    },
    {
      "time": "11 Jan 2009 — 3:44pm",
      "content": "my apologies, i meant i have a designer to work with me on the WEBSITE, not the logo, I forgot to include that, have been climbing all day and my grey matter is running on empty.\n\nI do not have a logo/brand designer as of yet, the developer specialises in web design, and does not have the time to design a logo, so i`m in the process of finding a suitable candidate.\n\nJust wished to get some advice from members on here, to see there initial thoughts/suggestions,\n\nforgive me for the initial confusion,\n\nRichard\n\n"
    },
    {
      "time": "11 Jan 2009 — 3:46pm",
      "content": "Gotham\n\n"
    },
    {
      "time": "11 Jan 2009 — 3:55pm",
      "content": "That's what I figured Richard since you had been so heavily vested in the \"adelto\" logo a bit back. Pays to have a good memory : )\n\nMichael\n\n"
    },
    {
      "time": "12 Jan 2009 — 3:23am",
      "content": "I was really happy how that turned out, the adelto website should be launching soon and the blog is going really well, alot of organic search results coming in, and some really interesting and unique range of products on offer. Hopefully will go from strength to strength!\n\n"
    }
  ]
}
