{
  "id": "53362",
  "title": "Almost but no cigar...",
  "forum": "SuperUltraFabulous's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20100806234701im_/http:/typophile.com/files/014381195521_3528.jpg)\n\nLovely Illustration really.\n\nI even like the murky watercolor sky.\n\nAnd Bookman Swash is always fun.\n\nBut what was the designer thinking with Monotype Corsiva?!\n\nThis is one of those “_Made in New York City ?!?!?!?!?!_” moments.\n\nMikey :-)\n\n",
  "author": "<a href=\"/web/20100806234701/http://typophile.com/user/12479\" title=\"View user profile.\">SuperUltraFabulous</a>",
  "time": "<br>",
  "uid": "12479",
  "comments": [
    {
      "time": "",
      "content": "Maybe Monotype corsiva was the best available choice of complementary font the designer had in his toolbox? I don't know. I don't know much, if anything, about this piece or the circumstances of its creation.\n\nSounds like you don't either.\n\nMake a better one.\n\nNo I'm not taking it too seriously. Just sayin', you can do better, so go for it. Make something better. Make you feel good. Make the world a better place. Fill it with your love. Do what makes sense to you. Do what you are good at doing . Do what you enjoy doing.\n\nAll comments made in good faith.\n\nj a m e s\n\n"
    },
    {
      "time": "",
      "content": "All you say is true and beneficent James\n\nnevertheless\n\nCorsiva and the designers that use it should be mocked to the corners of the Earth.\n\nMost people hate on Comic Sans or Papyrus but I say Corsiva needs the big sleep.\n\nMikey :-)\n\nPS... this thread is totally tongue-n-cheek\n\n"
    },
    {
      "time": "",
      "content": "Illustration is okay nothing to get all worked up about.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "The illustration and ITC Bookman Swash come from a poster from this film's 1976 theatrical release. Monotype Corsiva wasn't designed until the 90s, so the Corsiva text clearly is a later (careless) addition for the DVD packaging.  \nThe original poster fairly screams 1970s, and its designer was obviously a big fan of Milton Glaser. (It could have been Glaser himself, though I can't find any evidence that it was. The Bookman looks too gimmicky to be Glaser's; he occasionally used swash characters, as on his 1962 jacket for the first Peter Paul & Mary album, but his use of type is never this busy.)\n\n"
    },
    {
      "time": "",
      "content": "yep, i totaly agree with PublishingMojo - it seems like a careless addition, done by a layman. this totaly wrecks the composition, and it looks bad. the name credits above seem also a later addition.\n\nthis monotype cursiva is horrible. i bet it's a standart in pc computers!  \neugh!\n\n"
    },
    {
      "time": "",
      "content": "It's not good at all\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "",
      "content": "PublishingMojo is correct: the original poster is from the 1970s... [1976](http://web.archive.org/web/20100806234701/http:/www.imdb.com/title/tt0075161/), to be exact [EDIT: Oops, I see you already said that, PM. Sorry!]. I actually remember seeing newspaper ads for this film back then.\n\n[Here's the original movie poster](http://web.archive.org/web/20100806234701/http:/www.impawards.com/1976/sailor_who_fell_from_grace_with_the_sea.html), which is slightly different than the DVD cover. :-)\n\n"
    },
    {
      "time": "",
      "content": "Thanks PublishingMojo for the info\n\nThanks Ricardo for the link on the poster.\n\nMikey :-)\n\n"
    }
  ]
}
