{
  "id": "53375",
  "title": "Everything Type! Book recommandation",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nIf you were to recommend two typography, type design book(s) which will they be?  \nI have been searching and searching and probably think to find the better type books out there. but please share yours.\n\nthank you!\n\nI own copies of:\n\nThe Elements of Typographic Style  \nThinking with Type: A Critical Guide for Design  \nMade With FontFont  \nLetter Forms and Design of Eric Gill  \nFred Smeijers - Type Now\n\n",
  "author": "battlefield",
  "time": "12 Jan 2009 — 6:40am",
  "uid": "15052",
  "comments": [
    {
      "time": "12 Jan 2009 — 6:55am",
      "content": "Counterpunch by Fred Smeijers appears to be a great read. Unfortunately it is out of print, but I think Hyphen Press was going to make a second edition.  \nI hope, since I don't have a copy :-(\n\n"
    },
    {
      "time": "12 Jan 2009 — 7:23am",
      "content": "Depends on if you want to design typefaces by yourself or just design \\_with\\_ typefaces.\n\nHave look at:  \nDesigning Type by Karen Cheng  \nIn the typography class here in Basel we call her book «Anatomie der Buchstaben» the «Bible». ;) I just don't know if Designing Type is the English version of it.\n\nAlso great books, which I didn't find in English editions, are:\n\nDetailtypografie by Rald de Jong  \nLesetypografie by Friedrich Forssman and Hans Peter Willberg\n\nBasic Knowledge about the use of typography:  \nTypography by Emil Ruder\n\nGreat typographic design books are:  \nType One by Robert Klanten, Michael Mischler and Silja Bilz  \nFresh Type by Andres Janser and Christina Reble\n\n"
    },
    {
      "time": "12 Jan 2009 — 8:38am",
      "content": "_\"In the typography class here in Basel we call her book «Anatomie der Buchstaben» the «Bible». ;) I just don’t know if Designing Type is the English version of it.\"_\n\nYes, it is. Not to be confused with \"Anatomy of a Typeface\", which is a different book.  \nI'm in the type design class in Zürich, and some of us have the Cheng book in German, some in English, and it looks like it's pretty much exactly the same.\n\n"
    },
    {
      "time": "13 Jan 2009 — 12:15am",
      "content": "And if you are looking for the very best book about the history of typography, I would suggest you to learn french and buy \"Histoire de l'ecriture typographique\" by Yves Perrousseaux. There is simply no english equivalent, and I sincerely pity the non-french speaking for not be able to have access to this wonderful, definitive book. Oh please make an english version.\n\ndr\n\n"
    },
    {
      "time": "13 Jan 2009 — 6:50am",
      "content": "<cite>Designing Type by Karen Cheng</cite>\n\nI think this is a terrible book. A waste of money IMO.\n\n"
    }
  ]
}
