{
  "id": "53395",
  "title": "Ernestine, a wide slab",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Dear Typophiles,\n\nHere is the first version of the lowercase alphabet of my first typeface\\*, Ernestine\\*\\*. Backstory is [here](http://web.archive.org/web/20150423013702/http:/typophile.com/node/50670).\n\n\\* I have made a little family of bitmap fonts before, but I'm not counting this here because Curves Are Hard.  \n\\*\\* See below.\n\n ![](http://web.archive.org/web/20150423013702im_/http:/typophile.com/files/ernestine_lc_v1-1_5490.gif)\n\nThe intended use for this is twofold, my main focus being small text (thanks to Hrant, as well as Hans Jörg Hunziker in class, for bringing this idea to mind); the other, possibly, display: The plan is to first finish this \"base\" cut shown above, and then deduce two additional optical sizes from it, which will likely be of more practical use than the base itself. First, an optically corrected small size cut with more weight & looser spacing; intended point size is 3 to 8\\*. And second, if time permits, a display cut with less weight & more detail.\n\n\\* Some quick experiments with ink traps, opened counters, and the like revealed that this can be surprisingly legible at 3pt, and rather comfortable at 4.\n\nI'd be very grateful for crits, and any opinions really. I've been \\*very\\* immersed in this over the past couple of weeks or so, so I presume I don't really see most of the issues myself. (I must say a monoline typeface really seems to be quite a beast to try to tackle, too.) Spacing btw is still quite preliminary.\n\n\\*\\* Oh, and the name. Ernestine is the working title that I kind of got stuck on. I think it matches the feel of this rather nicely, but the word looks uh, suboptimal (very long, and somewhat boring) when set in the typeface, so I'm open for different naming ideas that would also look good. :-)\n\nSo, I'm throwing her out there. Please don't hold back, and don't be gentle for the sake of it: I'm trying to learn, and I'm wanting to actually make this usable.\n\n—Nina\n\n",
  "author": "nina",
  "time": "12 Jan 2009 — 3:19pm",
  "uid": "13487",
  "comments": [
    {
      "time": "12 Jan 2009 — 4:07pm",
      "content": "Good work Nina. I like the thick serifs and especially the readability of this face at the smaller point size (8pt is my favorite).\n\nThe ball terminals seem to be more compelling on the 'k','r' and 'y'. For some reason on the 'c', 'g' and 'f' are not pulling it off as well. I prefer the third 'g' as well.\n\nOtherwise, well done!\n\n"
    },
    {
      "time": "12 Jan 2009 — 5:53pm",
      "content": "Great to see this. Here are some thoughts. (Keep in mind I'm only about one awkward set of caps ahead of you in type-design experience, so take with a grain of salt.)\n\nThis is a personable font that is already working well both small and big.\n\nI prefer g #1 as far as fit with the character of the font goes.\n\nThere's something I very much like about the b.\n\nThe blunt terminals at the bottom of c, e, s, and t seem too crude. I wonder if there are other solutions.\n\nLeast successful are k and s: k because the mismatch of a structural straight arm and an unfurling curve (something sort of Cyrillic looking to this), and s because it's a bit lumpy and struggling to be wide.\n\nIn some cases the ball terminals seem too tacked-on, rather than developing gracefully out of a curve. This is particularly true where the curve leading to it is flattening out to reach horizontally, as in c, f, and s most noticeably.\n\nThe top join of q seems odd to me - it has no analogues in the other letters that I could find. Did you try it with an intersection like the bottom of b has?\n\nSomething about the thickness of the arm of the r doesn't look right to me.\n\nThe serifs at the tops of v, w, x, and y seem too heavy. I never thought about it before, but I suppose if you adjust diagonals for optical balance you might have to adjust slab serifs at the ends of them. v and w may be a bit too spread at the bottom, and thus light (topheavy).\n\nI might consider raising the intersection of the y, and maybe bringing the top-right vertex of the z leftward a touch.\n\nSeems to me like this has a great deal of both charm and function - very impressively so for a first font!\n\n"
    },
    {
      "time": "13 Jan 2009 — 12:10am",
      "content": "sorry for writing german, i wrote this for german typografie.info, then deciding to add it here for more coherence:\n\nganz kurz, spontan und unvollständig, und mit Bedacht zu genießen:\n\ndas sieht schon sehr sehr ausgewogen und ruhig aus, spitze! Ich wünschte ich hätte den Nerv, so lange am Grundalphabet zu bleiben, bevor ich mich aus Neugierde und Langeweile in Zeichensatz- und Schnitt-Orgien verliere :)\n\n- die jeweils rechten Teile von y und v, vielleicht auch bei w und x, stechen im PDF in den kleinen Punktgrößen dezent heraus, sind zu dunkel. Das mag am Rendering liegen (PDF-Vorschau von OSX) oder wirklich ein Problemchen sein.  \n- der obere Teil vom \"k\" wirkt mir eine Spur zu verspielt. Ich sehe dass das mit dem \"r\" korrespondiert, aber dort ist es irgendwie weniger \"curly\". Vielleicht braucht das \"k\" eine gerade Serife, keinen Tropfen? Tropfen hängen bei dir sonst immer nur an Rundungen, der Tropfen beim \"k\" macht das auch \"rund\", auch wenn's das eigentlich nicht ist.  \n- das \"s\" ist mir links oben und rechts unten eine Spur zu eckig. Auch links unten macht es einen recht abrupten Schwenk nach oben. Vielleicht mal neben ein \"a\" stellen und wirken lassen. Außerdem ist es oben zu schwer, und/oder in den senkrechten Teilen etwas zu leicht. Für mich (neben dem verfluchten \"d\" und den Schrägen) der schwierigste Buchstabe.  \n- das \"z\" hat einen leichten Hang nach links.  \n- das \"u\" hat im rechten Teil seines Bogens einen leichten Knick, es geht eine Spur zu gerade nach oben.\n\nDinge die vielleicht mit der Industria zu tun haben, die ich natürlich nicht wie du aus dem FF kenne:  \n- ich bevorzuge #1 der drei \"g\" (ggf. mit etwas weniger gekräuseltem Ohr), wenn das nicht, dann #3. Das mittlere steht in den vertikalen Proportionen zwischen den Stühlen und könnte durch das \"Schmuckelement sogar fleckig werden. Hier kann man aber sicher auch zwischen Display und kleinem Text streiten ...  \n- das \"q\" sieht mir noch am unfertigsten aus. Oben ist es mir eine Spur zu rund, d.h. die Rundung geht rechts eine Spur zu weit nach unten. Die Serife gehört für mich rein gefühlsmäßig genau in die andere Richtung.\n\n"
    },
    {
      "time": "13 Jan 2009 — 4:19am",
      "content": "Thanks for your feed-back guys! Much appreciated.\n\nThe ball terminals are one of my big \"question marks\" about this. I had a lot more of them at one point (like on the head of the \"a\", and both ends of the \"s\") but realized they close up the shapes too much. Now I don't know if they are too few and far between to still make sense as a principle. Also, it's true they don't work equally well in all their instances – thanks for pointing this out.\n\nJesse,\n\n_\"I prefer the third ’g’ as well.\"_  \nIt seems to come down to the first or the third. While I do heart the second one, I agree it doesn't work very well in text; I'll probably keep it as an alternate for the display cut though. The first is the one most closely following the metal face I was (partly) working off. Only beef I have with the third really is that it keeps reminding me of Souvenir. :-|\n\nCraig,\n\n_\"The blunt terminals at the bottom of c, e, s, and t seem too crude\"_  \nOh … I wonder what could be done about this. I was actually quite happy to come up with this solution; as noted above, I had more ball terminals before, but that was getting too much. Also I felt I needed to add a little weight / \"determination\" to the terminal at least in the \"s\", otherwise it was starting to feel top-heavy (and the \"t\" keeps toppling over anyway). Hmm.\n\n_\"Least successful are k and s\"_  \nYeah, touch me where it hurts! :-)  \nThose were the ones I was struggling with most. I had no idea how difficult it is to make a \"k\" (especially at this kind of width). With the \"s\", I was at least expecting it (which of course didn't make it easier). In any case, I agree those aren't done yet.\n\n_\"The top join of q seems odd to me\"_  \nThat's actually one of the details that carried over from said metal face I was working off; I must say I like that little corner that doesn't say where it's coming from :-). Although I guess I should also try a \"b\"-like smooth intersection & compare.\n\n_\"The serifs at the tops of v, w, x, and y seem too heavy\"_  \nI was noticing some weirdness there too, but must say I feel quite insecure generally with all of those \"diagonal\" lettershapes.  \nI wonder how much of the impression of excessive serif weight is due to the diagonals, and how much to the fact that they're on the x-height; they're the same weight as the ones sitting on the baseline, but I guess they also look heavier when they're up there. I wonder if I should thin them overall (throughout vwxy) or maybe just on the insides or something?\n\nSebastian,\n\nHope you don't mind if I reply in English to \"tie in\" your comments with the rest :-).\n\n_\"- die jeweils rechten Teile von y und v, vielleicht auch bei w und x, stechen im PDF in den kleinen Punktgrößen dezent heraus, sind zu dunkel\"_  \nDo you think this excessive weight on the right hand side of yv/wx might have something to do with the serif weight discussed above? Or is it just the stem weight that's off? (There's something fundamentally wrong with the \"y\" in particular that I'm still looking to pinpoint. Is it weight?)\n\n_\"Vielleicht braucht das “k” eine gerade Serife, keinen Tropfen?\"_  \nHm – I had a version with a straight serif on the \"k\" and it looked like an industrial clamp or something ;-) – although the ball terminal may be too cute (if it works at all).\n\n_\"[q] Die Serife gehört für mich rein gefühlsmäßig genau in die andere Richtung\"_  \nInteresting. While it may well be unbalanced yet, the _principle_ of having the serif of the \"q\" face rightwards feels right to me, and seems to make a lot of sense too\\*. Does it look very confusing/weird? (Does it look weird to others too?)  \n\\* Readability, stressing of reading direction, disambiguation with \"p\"/\"g\". To give credit where credit is due, most of the thought that went into the \"q\" serif comes from reading about Hrant's alphabet reform work – and I then kept finding \"q\"s with rightwards-facing terminals/serifs in \"real life\" too, and felt they work/read nicely.\n\n--\n\nThanks again! This is extremely helpful. Keep'em coming. :-)  \n—Nina\n\n"
    },
    {
      "time": "13 Jan 2009 — 7:11am",
      "content": "re: c/s/t terminals, I can see why a little added weight serves you well. Could you just soften those corners a little?\n\nI do think, if you're going to stick with the ball terminals, that you should have one on the head of the a, too. (I confess that my printout on US Letter paper cut off half that letter so I didn't catch its absence at first.)\n\nOne new comment: on the central intersection of the x. It looks like you've offset the / stroke but not the \\ stroke. In a contrast face I think that would work well but here where the strokes are even I'd expect the intersection to be more symmetrical, too. As it is, you get a little clockwise torque to that crossing.\n\n"
    },
    {
      "time": "13 Jan 2009 — 7:50am",
      "content": "A friendly and jolly face, this! I see great potential for expansion here. I think you have to work more on most of the curves, though, especially the c, s, u, n, m, f and e, and the y and j descender hooks look quite wobbly and uneven to me, making them look kind of bent iron-ish. The r looks a little weak, too. Is that u a little too wide? I'd try a ball terminal on the a once more, and try compensating by making the bowl smaller.\n\nYour b, p and k are truly beautiful! Definitely keep that k.\n\nThat first g is my favourite. I'm looking forward to see this revised.\n\nS.\n\n"
    },
    {
      "time": "13 Jan 2009 — 10:50am",
      "content": "Heh, looks like the \"k\" is a love/hate character. Which kind of makes me want to keep it.\n\nDo you guys really think this is better?\n\n ![](http://web.archive.org/web/20150423013702im_/http:/typophile.com/files/ernestine-aa_5625.png)\n\nI was all excited about the left hand shape at first, but chucked out the ball terminal after looking at this in text size. Somehow I felt it was mannered and a bit too \"pretty\"; most of all, it seems to stand in the way of readability, especially in smaller sizes. Closes up the counter too much (and looks too dark, given that the \"a\" is a pretty dam busy character already). Also, I wouldn't want to make the bowl of the \"a\" \\*much\\* smaller, since it'd then lose all reasonable proportion, as well as any connection with the eye of the \"e\".\n\nOther points well taken. Craig, thanks for pointing me to the \"x\"; I realized while I was making it I really don't know much about \"x\"s. Need to look at some others some more.\n\n_\"re: c/s/t terminals, I can see why a little added weight serves you well. Could you just soften those corners a little?\"_  \nSoften? As in round? Or as in, cut at a different angle?\n\n_\"The r looks a little weak, too.\"_  \nYeah, that's a defiant little thing that doesn't know if it wants to be straight or curved, and ends up being kind of both (and too light in the process).\n\n_\"Is that u a little too wide?\"_  \nHuh, might be. I just checked and it is narrower than the \"n\", but only a little. I haven't checked its width after changing serif shape/size around a few times, and looking at this I agree it looks wide.\n\nIs the \"w\" too narrow btw?\n\n"
    },
    {
      "time": "15 Jan 2009 — 12:59pm",
      "content": "(I was worried, but I'm happy to see that Typophile is  \nstill a good place to get a type crit - keep it up guys!)\n\nNina, are you sure this is your first font? :-) Because it's coming together quite well, and has much more depth than a beginner usually shows. Heck, many old-timers just play on the surface their whole careers. It's certainly frightening jumping into that dark, luscious jungle.\n\nFor example, the decision of putting a ball on the \"a\" or not, of how to do the top-right of the \"q\", these are things that you can either just formally mimic precedent, or really think about first. When I was making Patria I tried to make the letters be what they needed to be in terms of reading, as opposed to just something that other type designers would applaud. I like to leave the terminal of the \"a\" pretty \"weak\" because I believe it helps readability (without looking ugly - in fact it can look quite elegant and graceful). I think your \"q\" however is going in the wrong direction, it's neither attractive nor harmonious. Not the descender mind you - that's wonderful! I mean the top-right. I would try giving it a vertical spike/serif, like in the \"z\". If that doesn't work I might try making it like the \"b\" (even though many type design will definitely go \"uuugh\"). Divergence is extremely important in a text face, it's just very easy to go too far, and too tempting to do it semi-randomly. You need some method (and you seem to be good at that).\n\nCraig says that the \"terminals at the bottom of c, e, s, and t seem too crude\". I agree, and I think it's because they're gently flaring (in the \"a\" as well). If you make them totally monoline, or maybe even taper gently, I think that might fix it.\n\nThe first \"g\" is more harmonious, but the third one might be just what the font needs in terms of making its mark. I would make the third one the default and the first the alternate. Don't worry about any Souvenir connection. Oh, and dump the second one. :-)\n\nThe \"k\" I actually like very much! And like Spiekermann has said, a love/hate glyph can be a veritable gold-mine! You might need to tweak it later, but I would let it live until there's reason to believe there's a problem.\n\nThe ball of the \"r\" needs to be larger.\n\nThe head of the \"s\" is recoiling. You might pull it to the right a hair.\n\nThe very top of the \"t\" is boring. Not sure how to best fix it though.  \nAnd I would make the leftward bar flat on the bottom, slanted on the top.\n\nI think I would make the \"u\" serifs like the ones in the \"v\". That's one convention that seems to make sense (even though it seems counter-intuitive).\n\nI would make the \"z\" serifs longer.\n\nThe exclamation mark is way too blah.\n\n--\n\nI also have some macro crits:  \nIf this is really a text-size cut, and you're planning on making a small-size cut, the problem is this cut is already very wide and large on the body\\*. If this will be used small, it needs to be darker. If there will be another smaller cut, what's THAT going to look like?! :-) I'm not sure what to recommend, because the large width of this design is part of its charm and character... Normally I would recommend making a bit narrower. Another way is to shoot for small text with this (and probably give up on making a smaller cut) and make it darker.\n\n\\* Like Jesse said, it's happy at 8 (and maybe even 7).\n\nIn any case, the vertical proportions are a bit off. Assuming the x-height will stay this size, if this is shooting for small text I would shorten the descenders; if it's shooting for 9-10 point I would lengthen the ascenders.\n\nNina, this is great stuff - please keep it up!  \n(But don't forget to eat and breathe.)\n\nhhp\n\n"
    },
    {
      "time": "15 Jan 2009 — 6:46pm",
      "content": "Hrant, thanks for your critique; it's much appreciated.\n\nDepth: I'm glad to hear the thought that is behind at least some of this is showing. I generally can hardly do any work without a semi-solid concept. And actually,  \nmany of the things you criticize are those I hadn't really thought about, but rather \"assumed\" as sort of a starting point – like the vertical metrics, for instance.\n\n_\"Divergence is extremely important in a text face, it’s just very easy to go too far, and too tempting to do it semi-randomly.\"_  \nYes! And I find it very hard to tell how much irregularity is OK in terms of doing  \nwhat feels right, or what seems to work; and how much \\*must\\* be standardized.  \nLike serif size: most of them are slightly longer on the right-hand side, those in  \nthe more symmetrical and/or busy glyphs are symmetrical, and I have made them significantly longer on the right-hand side of the \"f\" and \"r\" because I felt these glyphs got stronger / more stable this way – and I have no clue if it's a good idea (theoretically) to work them like this.  \nThe mysterious convergence of Brain and Gut makes this a very interesting process. :-)\n\n--\n\nSelected details: the others aren't forgotten, but on the checklist for the next round.\n\n_\"I like to leave the terminal of the “a” pretty “weak”…\"_  \nI didn't consciously realize this before, but I like Patria's \"a\" a lot.  \nAs well as the one in Constantia (which is also \"weak\").\n\n\"g\": It's awful, but I've realized I don't \\*like\\* the third one. We're just not friends.  \nI'll search for this shape some more. Maybe something between the first and the third one, with the join of the descender at an intermediate angle, might be interesting.\n\n\"k\": I'm glad to hear you like this one! Because I've decided I do like it,  \nand hope to be daring enough to keep it (or something conceptually close to it). :-)\n\n_\"The very top of the “t” is boring. Not sure how to best fix it though.\"_  \nMaybe something like this? (Please try to ignore the ugly bottom.)\n\n ![](http://web.archive.org/web/20150423013702im_/http:/typophile.com/files/taper-t_4747.png)\n\n_\"I think I would make the “u” serifs like the ones in the “v”. That’s one convention that seems to make sense (even though it seems counter-intuitive).\"_  \nHuh. Extremely counter-intuitive. I'll have to play around with that.\n\n--\n\nOn the macro level: You know, I have no idea what this cut should do. In fact,  \nI don't really think of it as doing something, more as being the \"master design\"  \nof sorts; like a cell that hasn't differentiated, & can still grow into something really small, or something really large. But that may not make that much sense as a plan.\n\nI don't know. I guess it's definitely not for standard text sizes (I just honestly can't picture anyone using this at 11 or 12pt, and yes I'm reluctant to make it narrower). I agree it feels quite happy at around 8; so how about I make this the base cut for say 7–10, and then derive one for 3–6 (I do want to see how low I can go with this). Does that make sense?  \n(Because the \"tiny\" cut needs traps, and if there's something I loathe in type,  \nit's visible ink traps at larger point sizes. And the traps I've experimented with  \nare visible at 10.)\n\n_\"If there will be another smaller cut, what’s THAT going to look like?! :-)\"_  \nHey, remember the downright absurd proportions (I called them \"funky\" back then!) of [that metal face](http://web.archive.org/web/20150423013702/http:/typophile.com/node/50670)? :-)  \nSeriously though: I'd like the \"tiny\" cut not to look substantially wider than this, just slightly heavier. Though I don't know yet if I can make that work.\n\n--\n\nI'm letting this rest for a couple more days, as I'm currently facing a heap  \nof (other) work; I'm planning to get back to working on it in the weekend,  \nand hoping to post a revision maybe next week. No worries: This is my project  \nfor the Zurich course after all, so I'll need to finish \\*something\\* by June!\n\nI'm not that petrified of the jungle anymore. After all, I'm armed with coffee,  \nchocolate, and beer. And I feel like I'm at least beginning to see a path.  \nAnd it's great to have Typophile! (Especially now that school's on spring break.)\n\n—Nina\n\n"
    },
    {
      "time": "15 Jan 2009 — 7:01pm",
      "content": "\\> I have made them significantly longer on the right-hand side  \n\\> of the “f” and “r” because I felt these glyphs got stronger\n\nThat is a classic and smart feature.\n\nConstantia's \"a\": it's my favorite glyph in that font. I'm pretty sure that John had seen Patria while making Constantia, and I think he's said that he liked my \"a\", but I can't be sure mine was a direct influence. Proforma has a great \"a\" too.\n\nYour new \"t\" seems too... sophisticated?  \nDunno, maybe your original form is good.\n\n\\> being the “master design”\n\nCool.\n\nhhp\n\n"
    },
    {
      "time": "15 Jan 2009 — 7:11pm",
      "content": "Man, you're quick.\n\n_\"I’m pretty sure that John had seen Patria while making Constantia\"_  \nOh. Neat!\n\n_\"Your new “t” seems too... sophisticated?  \nDunno, maybe your original form is good.\"_    \n:-D  \nI'll play around with it in the weekend.\n\n—Nina\n\n"
    },
    {
      "time": "16 Jan 2009 — 4:41pm",
      "content": "_[terminals]  \n\"If you make them totally monoline, or maybe even taper gently\"_\n\nThis feels like a pretty major breakthrough.\\*  \n(Although the bowl isn't done yet.)\n\n ![](http://web.archive.org/web/20150423013702im_/http:/typophile.com/files/a-a_5874.png)\n\n\\* It's pretty weird to have \"major breakthroughs\"  \nthat \"normal people\" don't even see!\n\nMore soon.\n\n"
    },
    {
      "time": "16 Jan 2009 — 9:45pm",
      "content": "Yes, far better; the tapered terminal now relates nicely to the serifs.\n\n"
    },
    {
      "time": "17 Jan 2009 — 1:36am",
      "content": "Hi Nina  \nI saw this one starting off on your blog and like the direction you're taking.  \nThe tapered hood of your a looks great; not too noticeable but keeps the lightness and openness you want. My solution would have probably been to raise the terminal up more horizontal, to keep the line thickness even, but that would have destroyed the shape of the glyph completely. The tapering will really help your s.  \nI prefer the souvenir g, but do see what happens when you mix it with the first one, with the tail starting between those two versions.  \nThe k doesn't work for me, but it's not the curl, it's the crossbar...for me it's too wide and I'd bring the knee in a notch or two. Would that do odd things to the angle of the arm and leg?  \nYou're right about monolines being the most difficult! I haven't ventured into them yet. Good luck! :)  \nI'm also a beginner so\n\n"
    },
    {
      "time": "17 Jan 2009 — 4:00pm",
      "content": "Thanks, guys! I'm glad to hear this terminal works for people other than me too;  \nI am quite happy with the way it seems to unify the letterform to appear like more of a consciously designed whole, if that makes any sense (though I know that bowl is still lumpy).  \nAlso, I honestly wasn't expecting it to work. :-\\>\n\nIt's going to be an interesting process to work the different offending terminals in such a fashion; without the added weight of a flaring terminal, I expect quite a few letters to fall apart (like the \"s\" and the \"t\"), which is probably a good thing because it'll show me how they don't work.\n\nBen: Thanks for your comments!  \nRe the \"a\", I'm finding it pretty difficult not to make the shapes too angular &  \nstill make them fit into these wide proportions. I would indeed rather keep this kind of curvy.\n\n_\"The k doesn’t work for me, but it’s not the curl, it’s the crossbar...for me it’s too wide and I’d bring the knee in a notch or two.\"_  \nInteresting. To be honest, I was actually wondering if I had to make it wider.  \nNeed to look at this in context / some more / seriously / … :-)\n\n_\"Would that do odd things to the angle of the arm and leg?\"_  \nIt probably would, though I'd have to test. As it stands, at least the angle of the arm corresponds (roughly) to the \"x\".\n\n_\"I’m also a beginner so\"_  \nWow… did you fall asleep mid-sentence? :-)\n\n"
    },
    {
      "time": "18 Jan 2009 — 5:00am",
      "content": "oh dear!  \nI think I meant 'so don't take my comments too seriously'!\n\nWhat about trying to make the crossbar on the k flow into the lower leg, smoothly, as a curve? I think that might harmonise better with the ball terminal and help keep the overall texture curvy, which seems to be your direction.\n\n"
    },
    {
      "time": "27 Jan 2009 — 4:42pm",
      "content": " ![](http://web.archive.org/web/20150423013702im_/http:/typophile.com/files/ernestine_v2_3793.gif)\n  \n(Also, new PDF up top: ernestine\\_lc\\_v2.)\n\n--\n\nI've found that trying to work out a cut that isn't supposed (or capable)  \nto do anything by itself is too abstract for me to figure out (and also started feeling kind of pointless). So, I am shooting for 8–10 with this – which seemed  \nto necessitate some rather deep changes. (I'm keeping the old contours, though,  \nas a possible starting point for an eventual small size cut.)\n\nSince this starts off in a bit of a new/refined direction, which also seems a bit scary, I'd love some feed-back before diving into all the detail refinements that I'm aware this needs.  \nI have done quite a bit of detail work, but most of that was _before_ re-thinking proportions, darkness, and contrast. So I concede the old version has more even color than the new, but I'm hoping that's just due to the fact I haven't done nearly as much detail tweaking on the new one yet. Also, spacing is still quite basic.  \nI'm also aware that the weights are still kind of all over the place, and they seem to behave pretty unpredictably when printed small-ish. I guess this isn't a project I can pull off with my 600 dpi laser printer; I'm hoping to be able to buy a better one soon (which is one reason why I'd rather not start out with the small size cut yet).\n\nSo I guess the most important question is: Does this make sense?  \n(= Does it read better, or at least promise to do so after further tweakage?)\n\nI'm sure this new direction runs me into a slew of new problems I'm not even seeing yet (yay! and I mean that). Don't hold back. I'm really trying to learn and understand what makes a text face work; and I'm up for redoing & changing this until it can do what I need it to (as long as I can sometimes still find time to sleep, and do the work that feeds me).\n\n--\n\nSome detail notes:\n\n\"q\": I couldn't make it work with a vertical serif on top. That thing kept looking tacked on, kept messing with the bowl in ways I didn't appreciate, and I couldn't really see why it'd _need_ to be there. So, here's a \"q\" with a join like in the \"b\",  \nand it's actually one of my very favorite glyphs! So, I'm officially challenging  \nall of you (except for Hrant I guess) to go \"uuugh\", and then tell me why.\n\n\"g\": The other one has not been voted off the show, I just haven't adapted it yet.\n\nHrant:  \n_\"I think I would make the 'u' serifs like the ones in the 'v'.\"_  \nI officially don't get this.&nbsp;&nbsp;:-{&nbsp;&nbsp;I tried making them flat on top and angled on the bottom, and that looked positively weird, especially next to glyphs like \"i\" or \"n\" where I'd expect the same serif shape. It kind of makes the \"u\" look like a flipped \"n\", or like it's hanging from the x-height rather than standing solidly. Or did you mean something else? I'm confused.\n\n--\n\nI'm very grateful for any pointers, opinions and crits. I'll let this hang around\\* for a few days – and am looking forward to then resuming work on it in full blast. :-)\n\n—Nina\n\n\\* [I like the way my office wall looks.](http://web.archive.org/web/20150423013702/http:/altaira.de/posted/ernestine-wall.jpg)\n\n"
    },
    {
      "time": "27 Jan 2009 — 6:02pm",
      "content": "Salt ready?\n\nYour strategy of getting right to a target size design is sound, and the helpful side-by-side comparison demonstrates at a glance how well the revised design is fulfilling that function. Even on my likewise low-res printer's version, it's impressive to see that the charming character comes through at small sizes while remaining perfectly legible.\n\nHere are the things I would (or might) take another look at:\n\nc/e/s : I sung the praises of this taper before, but I wonder if starting the taper a little later (letting the bottoms of these letters stay thick a little longer) would serve you well. At small sizes the c and e lose that end and look like they have an overbite. s actually winds up looking inverted: maybe reconsider the relative width of the counters as well as shortening the taper? (All that said, s's curves have picked up a lot of grace since v.1.)\n\ng : might be a little too prominent. Does the tail reach around too far? Maybe also consider reducing the scale of the entire upper bowl by lifting it up off the baseline? (I'm not sure but I think that the bottom of that bowl need not align with b, q, etc.)\n\nq : yes, it's quirky, but if you're going to let the foppish k into the party, maybe you can't say no to the nice bald guy, too!\n\nv/w/x/y : relative stroke weights on these diagonal letters need work. In general these don't have near the same confidence as the rest of the alphabet. I wonder if w might be a touch too wide. The / stroke of x is too thin, and the optical offset isn't lining up for me (but obviously fix the former first).\n\nI'm impressed with your patience on this, getting one thing right before moving on to the next.\n\n(and jealous of the hanging space!)\n\n"
    },
    {
      "time": "27 Jan 2009 — 10:49pm",
      "content": "I'm glad the tapering clicked. Although I think you've lost some of the \"butch\" character of where you used to be. Maybe pull the tapering back just a bit? On the other hand, other glyphs have a fair amount of modulation too now. Dunno. Is the modulation ruining things? I'm not sure, but I think maybe the old monoline look had more character (although it was less versatile/readable).\n\n\\> I am shooting for 8–10 with this\n\nGreat - go for it. But you need more weight.\n\nBTW, 600dpi is indeed misleading (especially for smaller  \nsizes) but if you get a 1200dpi printer you're 90% there.\n\nThe \"q\": love it.  \nThe \"u\": don't sweat it - do your thing.\n\nLooking at the PDF:  \n- Some of your ball terminals are malformed (like the \"r\").  \n- I'd make the \"g\" narrower, and pull in the rightward bulge of the descender. And that ear isn't working. :-(  \n- The dot of the \"j\" is slightly right.  \n- The spine of the \"s\" is bumpy and unorthodox. I would go traditional and have the most weight towards the middle.  \n- The \"t\": the head is confused, and the bottom curl needs work.  \n- The \"w\": you need more weight in the middle \"v\".  \n- I think the \"x\" has too much stroke contrast.\n\nKeep at it - this is going to end well!\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2009 — 6:46am",
      "content": "Thanks for your feed-back, Craig & Hrant!\n\nRegarding the tapers: I'm glad I put them in, but I might be overdoing that.  \nAs well as this:  \n\"_Is the modulation ruining things?_\"  \nI hope not. Though I've been wondering too.  \nBut while I'm working out the weight, I'll try out different degrees of modulation  \nas well. I guess I will eventually have to make a decision to push either practicality at the expense of character, or the other way round. (I'm slowly beginning to understand your [statement](http://web.archive.org/web/20150423013702/http:/typophile.com/node/50153?page=1), Hrant, a few months ago that \"trying to make a font some sort of 'ultimate' always ends in tears.\")\n\nI'm glad nobody has objected to the narrower proportions (yet). They do seem to read better (plus make it a \\*hint\\* less \\*impossible\\* to make certain glyphs work, which is also nice).\n\nI'll be working on the details / individual glyphs both of you mentioned, most of which is touching me right where it hurts :-). I'm quite uncomfortable with all those diagonals (vwxyz), the \"s\" is driving me nuts from a technical perspective  \n(I was actually trying to make the spine heaviest in the middle!), and the \"t\" is just confusing me – I can't seem to figure out what matters in that strange little letter, & how it relates to others (most significantly the top).\n\nThe ball of the \"r\" was sort of an experiment to make it clog less at smaller sizes (well, and on my printer) and still have it be kind of pronounced – though I admit it looks quite silly.&nbsp;&nbsp;:-)\n\n_\"I’m impressed with your patience on this, getting one thing right before moving on to the next.\"_  \nCraig, that ain't patience. But you may call me obsessive, or a control freak.  \nBoth of which feel rather futile in the face of this!\n\nHanging space: Magnetic wall paint rocks for flexibility. It's not like Ernestine is always allowed to take up _all_ that space.&nbsp;&nbsp;;-)\n\nCheers!\n\n"
    },
    {
      "time": "28 Jan 2009 — 7:10am",
      "content": "Nina, this might be counter to your nature, but it's a technique that I've used and heard of others using: at a certain point it might be highly fruitful to put this away, for at least a month but probably longer, and then pick it up again; you might be surprised at how much more objectively and effectively you will then approach the various issues. The design process becomes less emotional and more \"big-picture\"; it becomes almost like critiquing somebody else's work (which for me at least is easier to get right).\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2009 — 10:17am",
      "content": "Hell yeah that's counter to my nature, Hrant.&nbsp;&nbsp;\\<:-{  \nThough part of me is thinking it's wise advice…\n\nClasses (& thus, guided project work) are resuming in 3 weeks. I'll have to see  \nhow I deal with that.\n\n"
    },
    {
      "time": "6 Feb 2009 — 1:32pm",
      "content": "A hiatus has been a good idea (thank you, Hrant). And it's not over.\n\nLittle interim musing: I'm beginning to think I've tried to cram too much into this one (and first) font. Too many ideas – and concepts too complex, of which I'm honestly just beginning to grasp some nebulous contours.  \nThinking about going back to more basic principles, I can see that modulation die. Mostly because I don't truly understand modulation. And I can't help feeling like an impostor when I try to make this font speak in tones that aren't mine, or that I can't master, or that I don't understand. In fact, being on a Beginner's Steep Learning Curve makes this process pretty crazy – many ideas that give me the warm buzz of accomplishment one week seem plainly deficient the next.\n\nIt'll be at least two weeks until I'll resume work on this!  \nIn a way, I can't wait; but I will. :-)\n\n"
    },
    {
      "time": "9 Feb 2009 — 12:41am",
      "content": "I really like it. Reminds me a little of a wide archer (I swear its the ball terminals) but it's got a nice open feel to it. Keep going!\n\n"
    },
    {
      "time": "13 Feb 2009 — 1:10am",
      "content": "Thanks, Yehan. Glad you like it (which incarnation?).  \nArcher: In the beginning I was looking at it a lot, though not so much anymore. But I guess the combination of slab serifs + ball terminals is more or less automatically reminiscent of Archer.\n\nThe show will go on soon-ish. I'm beginning to see more clearly where this can/should be going.&nbsp;&nbsp;:-)\n\n"
    },
    {
      "time": "15 Feb 2009 — 3:29pm",
      "content": "So. Young Ernestine was a bit large, a bit butch, loud, and jolly; then she suddenly got a serious office job and ended up buying stiff waisted clothes she never really got comfortable in (and couldn't afford, either)… :-/  \nFont psychology aside: A little temporal distance really seems to make v.2 look pretty cramped.\n\nThis time, before I spend forty hours cooking up an whole new alphabet, and derail somewhere along the way without noticing, I'd like to throw a few preliminary new glyphs out there that show the changes I've been thinking about. Those are mainly  \n- making it monoline  \n- making it heavier (& with thicker serifs too)  \n- and a little bit wider again (but not so wide as to be uncomfortable at text sizes – still aiming for let's say 8–11 with this).  \nThere is also a new attempt at a \"g\", and I must say I dig this one!  \n- vertical metrics aren't quite sorted out yet.\n\nWhat do you guys think?\n\n ![](http://web.archive.org/web/20150423013702im_/http:/typophile.com/files/honigmohn_5879.gif)\n\n"
    },
    {
      "time": "15 Feb 2009 — 5:54pm",
      "content": "I like the direction it's going. I think the new g is a vast improvement over the old one. However (and you knew that was coming), I'm not sure I like the terminal of the tail. honim look very good.\n\n"
    },
    {
      "time": "16 Feb 2009 — 2:32am",
      "content": "Glad to hear that, Steve!  \nAbout the terminal of the \"g\": Can you say if you wonder about the ball terminal per se,\\* or its execution?  \n\\* Which looks a bit lonely in this word, too, since it's the only one…\n\n--\n\nBy the way:  \n_\"Nina, are you sure this is your first font?\"_  \n [http://typophile.com/node/54857](http://web.archive.org/web/20150423013702/http:/typophile.com/node/54857 \"http://typophile.com/node/54857\")  \n:-[\n\n"
    },
    {
      "time": "16 Feb 2009 — 6:38am",
      "content": "Just throwing this out there; have you considered making a fixed-width version of this? I can see it having huge potential as a Courier-replacement. Which is to say that I love the design and see it in a universally-useful light.\n\n"
    },
    {
      "time": "16 Feb 2009 — 6:49am",
      "content": "I'm not entirely certain. What does you c look like?\n\n"
    },
    {
      "time": "16 Feb 2009 — 7:21am",
      "content": "Steve, that \"honigm\" up there is all I have of the new version yet (and an \"l\"). But I was expecting to keep the placement of the ball terminals pretty much the same as in previous versions, which would mean there would be balls on the descenders of \"g\", \"j\", and \"y\", as well as on the \"c\", the top of the \"s\", the \"r\", the arm of the \"k\" and the top of the \"f\".\n\nAlex, thanks! I hadn't thought about a monowidth; but I've heard quite a few comments that this has a \"nice typewriter feel\". I might give it a shot once this is finished. Though highest on the list is a small size cut, maybe a display cut, at least one additional weight, possibly italics… so it may be 2020 or so until I get to a monospaced version. ;-)\n\n"
    },
    {
      "time": "16 Feb 2009 — 11:26am",
      "content": "Nina, this is looking great. The color and vertical proportions\\* seem very good. And that \"g\" is da bomb! Definitely a keeper, with little need for an alternate. The only thing I _might_ tweak is the ear: it seems possibly too close to the x-line half-serifs; I'd try making it higher.\n\n\\* Here you've moved from ~8 to 9-10 point size.\n\nI would give this warning however: you've moved pretty firmly into the \"contemporary\" sphere (even with that \"g\") whereas before it had a distinct and arguably nicely anachronistic flavor. This move will make the font more versatile, but also perhaps less memorable. Considering this is only your... second :-) outline font I actually think this is a very good move. You can revert to a more old-school version later - and in fact having the two (daughter and mother?) would make for a nice subtle contrast, the sort we don't have enough of in type.\n\nBTW, am I noticing that you've made the tittle a hair \"too\" dark? Is that  \na Patria influence? :-) Be prepared for the flack from other type designers.\n\nhhp\n\n"
    },
    {
      "time": "16 Feb 2009 — 12:32pm",
      "content": "Thanks, Hrant! I'm very glad to hear you say that. Figuring out darkness and vertical proportions has seemed especially hard to figure out, so it's great to hear this may work. (There is no \"talus\" however. So I guess I should scale the whole thing down. :-/)\n\nI wasn't \\*consciously\\* trying to make it more contemporary-looking; that kind of happened, and I like it. But, I love your idea about the \"old\" and \"new\" sort of \"family\"! It's a pretty exciting thought to come back to this later and try to play a subtle variation with a slightly more \"historical\" feel. Though of course right now I'd have no idea how to go about it; that sort of subtlety is way beyond me. But I'll definitely keep this in mind for when I've done another twenty fonts or so. ;-)\n\n_\"you’ve made the tittle a hair “too” dark? Is that a Patria influence?\"_  \nReally, would that be considered \\*too\\* dark? I realize it is rather large, but it looks good to me that way. Not sure if it's directly influenced by Patria – I've been partial to larger tittles for a while :-\\> – but Patria has certainly strengthened my conviction that they can look dam good.  \nAnyway, I've been seeing a lot of Patria lately, so I won't be surprised to see some elements of it crop up in Ernestine. One thing that is consciously informed by Patria is the ear of the \"g\", although rather subtly so. (And I do see what you mean about its height.)\n\n_\"Be prepared for the flack from other type designers.\"_  \nWith that \"q\" and that \"k\" (and maybe the \"a\"), I'm not expecting to be taken down over the tittle. What's the problem – does it just look bad to some, or is there one of those underlying minefields I'm not seeing?\n\n"
    },
    {
      "time": "16 Feb 2009 — 2:26pm",
      "content": "\\> There is no “talus” however.\n\nYou will most probably need some (although less now with the  \nsmaller x-height). The amount depends a lot on your cap height,  \nso figure that out first.\n\n\\> would that be considered \\*too\\* dark?\n\nYou'd have to show a PDF to be sure.\n\nBut as you might guess, in my book it _has_ to look a hair too dark  \nto the average type designer (if that means anything :-). When  \na type designer casually points out Patria's, I smile on the inside.\n\n\\> I’ve been partial to larger tittles for a while\n\nHmmm...  \n(Then they say type is boring! ;-)\n\n\\> With that “q” and that “k” (and maybe the “a”),  \n\\> I’m not expecting to be taken down over the tittle.\n\nGood point!  \nAnd that \"g\" might nicely distract from _all_ of those.\n\n\\> does it just look bad to some, or is there one  \n\\> of those underlying minefields I’m not seeing?\n\nIt's just another symptom of misguided Modernism, wanting  \nto goddam \"harmonize\" everything. Most people don't really  \ngrasp that information comes from contrast and nothing else.  \nYou just have to keep everything under the radar of the _reader_.\n\nhhp\n\n"
    },
    {
      "time": "16 Feb 2009 — 4:04pm",
      "content": "Hrant,\n\nTalus: Good to know! In that case, I'll get back with that question once I have caps.\n\nBTW, I still think somebody should come up with good type-nerdy t-shirts involving tittles. Might attract a bit more attention to type design(ers). ;-)\n\n_\"It’s just another symptom of misguided Modernism, wanting to goddam “harmonize” everything.\"_  \nI've been wondering if this attitude might be furthered by the fact that many type designers see to come from graphic design (not entirely excluding myself there). Though that's still quite a half-baked theory.\n\n_\"You just have to keep everything under the radar of the reader.\"_  \nWhich from my experience even Patria, which may look rather extreme to some of \"us\", does extremely well.\n\nAnyway, about Ernestine: I'll work on those other letters and post a full alphabet with PDF in due time. Cheers!\n\n"
    },
    {
      "time": "19 Feb 2009 — 9:17am",
      "content": "Actually, it's still going to be a little while until I can post a full alphabet (too much other work ahead), so:\n\n_\"You’d have to show a PDF to be sure.\"_\n\nWhile this is still quite half-baked, I \\*am\\* curious about that tittle. Just if you have the time to take a look, Hrant – thanks. (:\n\n[http://www.altaira.de/posted/ernestine\\_v3\\_tittle.pdf](http://web.archive.org/web/20150423013702/http:/www.altaira.de/posted/ernestine_v3_tittle.pdf \"http://www.altaira.de/posted/ernestine\\_v3\\_tittle.pdf\")  \n(No corrections in there yet, this corresponds to the version posted above.)\n\n"
    },
    {
      "time": "19 Feb 2009 — 9:40am",
      "content": "Tittle: I'd make it a hair larger.  \ng: I think the inside cusp between the bottom stroke and the ball should be abrupt, not smooth.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2009 — 9:53am",
      "content": "I think a large tittle befits a ball-serif font of this character.  \nIs it a little clotted at the join of g's ear?  \nThis new g does contemporize this font - I wonder if it's no longer an \"Ernestine\"...\n\n"
    },
    {
      "time": "19 Feb 2009 — 11:34am",
      "content": "Thanks guys.\n\nTittle: Craig, I think so too.  \nI thought it was already on the largish side, and didn't want to make it completely indecent; but I'll gladly try making it a bit larger still!\n\n\"g\": Hrant, thanks for that! That little thing has been a difficult detail. Making it abrupt is an interesting idea; gonna try that.  \nCraig: I haven't done anything really in the way of optical correction of the join yet – actually the shapes aren't even merged. You might see some overlap artifacts in the PDF.\n\n_\"This new g does contemporize this font - I wonder if it’s no longer an “Ernestine”...\"_  \nInteresting.\\* Does \"Ernestine\" sound more old-fashioned than this looks?\n\n\\* I say that because the \"g\" is shamelessly influenced by the Heavy weight of Kabel, which after all is a pretty old design (though not quite as old as my original \"Industria\").\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:31pm",
      "content": "Hi Nina  \nYou seem to be doing very well on this so I don't have anything further to offer I'm afraid, but just wanted you to know I am following your developments and choices with interest and even excitement! Ernestine is looking very neat and good-humoured.\n\nIs your tittle a bit off to the right (optically)?\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:49pm",
      "content": "According to [this cool site](http://web.archive.org/web/20150423013702/http:/www.babynamewizard.com/voyager#prefix=ERNESTINE&ms=true&sw=f&exact=true) Ernestine peaked as a baby name in the 1920s, right when Kabel was developed and released.\n\nBut Kabel has never struck me as 1920s-looking.\n\nAt any rate, yes, I think this is losing its grandmotherliness. Now it's more like a hip young woman. (But one who still knits!)\n\n"
    },
    {
      "time": "19 Feb 2009 — 3:07pm",
      "content": "Thank you, Bendy, for the encouragement! It's been a rocky but highly enjoyable road indeed.\n\n_\"Is your tittle a bit off to the right\"_  \nI'll have a closer look.\n\nCraig,  \n_\"According to this cool site Ernestine peaked as a baby name in the 1920s, right when Kabel was developed and released.\"_  \nSee, they are cousins of sorts! Funny. Now I only need to find out who Patria is in that family. Possibly the godfather? And Archer & Caecilia the aunts? :-\\>  \n(They're all pretty young either in spirit or actual age or both, so I guess that works. Not sure who among them knits, though!)\n\n"
    },
    {
      "time": "19 Feb 2009 — 3:27pm",
      "content": "[In some circles, knitting is very glamourous, you know :)](http://web.archive.org/web/20150423013702/http:/www.worldknit.com/celebrityknitters.html#celeblist)\n\n"
    },
    {
      "time": "19 Feb 2009 — 6:46pm",
      "content": "Knit Hop in da Hood!\n\n"
    },
    {
      "time": "21 Feb 2009 — 1:41pm",
      "content": "So I knitted a new tittle and played around with the \"g\" a bit.\n\n ![](http://web.archive.org/web/20150423013702im_/http:/typophile.com/files/honigm_2a_6201.gif)\n\n--  \n(PDF here: [http://altaira.de/posted/ernestine\\_honigmohn\\_2.pdf](http://web.archive.org/web/20150423013702/http:/altaira.de/posted/ernestine_honigmohn_2.pdf \"http://altaira.de/posted/ernestine\\_honigmohn\\_2.pdf\"))\n\nThe tittle feels really indulgent now. I'll confess I like that; but I'm wondering if I'm overdoing it.\n\nI'm not quite sure about that ball on the \"g\". I'm thinking it may need to be larger, but then it starts seriously closing up the tail at smaller sizes, which I don't want it to do. Kind of reminds me of the \"a\". I might try making one without a ball – but in a way I don't want to give up on the few ball terminals that are left.\n\nBTW, feedback from a few of my type design class peeps today showed that the \"g\" _is_ a love/hate glyph. I like that. I was beginning to worry this font was getting boring. :-\\>\n\n"
    },
    {
      "time": "21 Feb 2009 — 2:18pm",
      "content": "I love the new \"g\" - don't change a thing! (For now... :-)\n\nThe tittle: nothing to worry about - I myself  \nwould actually make it a bit larger still!\n\nhhp\n\n"
    },
    {
      "time": "21 Feb 2009 — 2:26pm",
      "content": "I think it's beautiful. Unlike Hrant, I wouldn't make the tittle larger, but right not I don't think it's too big.\n\n"
    },
    {
      "time": "21 Feb 2009 — 2:55pm",
      "content": "_feedback from a few of my type design class peeps today showed that the “g” is a love/hate glyph_\n\nI would keep developing both this one and the previous one (like the first one in the first post of this thread), and use one or the other as a stylistic alternate. Then everyone's happy!\n\n"
    },
    {
      "time": "21 Feb 2009 — 3:05pm",
      "content": "Hi, Nina!  \nI wanted to express Ernestine had taken a nicer direction, if possible: she looks really great and very exciting.  \nAbout the g, I'd keep it as is in the current pretty version, though I'd like to see how it looks with a larger ball, since optically it seems small a bit against, let's say, the c (it's a subjective appreciation, for sure).  \nI assume you've not completely spaced it, otherwise the \"go\" kerning would need to be revised (below I read \"mig o\"):\n\n ![](http://web.archive.org/web/20150423013702im_/http:/typophile.com/files/migo_4576.png)\n  \nI'm [dealing with the g](http://web.archive.org/web/20150423013702/http:/typophile.com/node/54942) right now, and think it's amazing the synthesis you've achieved in yours.  \nWho could say such a young lady is boring?\n\n**MarS**\n\n"
    },
    {
      "time": "21 Feb 2009 — 3:13pm",
      "content": "Actually, yes, I agree the ball should be larger.  \nBut don't change anything else! :-\\>\n\nhhp\n\n"
    }
  ]
}
