{
  "id": "534",
  "title": "Possible contests....TO TYPOPHILE",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "On this site as its own main category, there should be a list of contests that go on each month. Afew suggestions could be promoting a new font by making a poster for it, promotional pieces etc. That is only one suggestion. IT could be anything. Just a contest that people who are appart of this forum can participate in if they are interested. I know I want to make some promotional pieces and a decent logo for myself, that could be one of the contests that people can participate in if interested. What does everyone think?\n\n",
  "author": "longlegzs80",
  "time": "Sun, 2003-07-06 09:00",
  "uid": "1940",
  "comments": [
    {
      "time": " Sun, 2003-07-06 16:04",
      "content": "I think that's a great idea.   \n   \nhhp\n\n"
    },
    {
      "time": " Thu, 2003-07-10 09:45",
      "content": "Sounds like fun. I'm still upset that I missed out on the tshirt contest, though admittedly I would not have had much of a chance.\n\n"
    },
    {
      "time": " Thu, 2003-07-10 11:51",
      "content": "Type contests suck.   \n   \nIt's not like you can just mail in the tear-sheet for an ad. You have to specially create a specimen. Pay for the print-out. Get it mounted. Pay for the courier.   \n   \nContest-books are an even bigger rip-off: Free content for publishers!   \n   \nAnd then some bunch of celebs (does not correlate with having a critical faculty) gets to pick and choose.   \n   \nIt's spec work, frowned upon by the AIGA, GDC, etc.   \n   \nDon't waste your time and money on a crap-shoot -- invest in advertising and support the fifth estate!\n\n"
    },
    {
      "time": " Fri, 2003-07-11 16:07",
      "content": "Yeah, most of them are crap. But if you find a free one that's prestigious, it's worth it. Like Morisawa. They even give cash prizes.   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2003-07-12 05:44",
      "content": "Maybe you already know it, but:   \n   \n\"And yet, although thanks to the support of so many people the Morisawa Awards have come of age on an international scale, I must regretfully announce that, due to various changes over the twenty years we have been holding this contest in the surrounding landscape, this will be the last holding of the Morisawa Awards.\" (Yoshiaki Morisawa, President, Morisawa & Co., Ltd./ excerpt from Morisawa Awards 2002 Booklet).\n\n"
    },
    {
      "time": " Sat, 2003-07-12 05:45",
      "content": "Any Typophile contest would be great anyway. :-)\n\n"
    },
    {
      "time": " Sat, 2003-07-12 09:54",
      "content": "That's some really sucky news.   \n   \nBut I guess it's not suprising. It was too good for this age.   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2003-07-12 20:04",
      "content": "OK, bring on the Typophile contest. Being online it can hopefully avoid the stuff I was slagging in my previous post.\n\n"
    },
    {
      "time": " Sun, 2003-07-13 07:58",
      "content": "Jared, I haven't received my t-shirt for the [100-em dash](http://web.archive.org/web/20050516050328/http:/www.typophile.com/forums/messages/72/5074.html?1044054075) contest. :-P I know I was late and all, but they were really good links(!) And it was humanly impossible to post 100 quality links in 28 days.   \n   \nBut I think I'll just buy the tee. Do you ship to Asia? Please do.\n\n"
    }
  ]
}
