{
  "id": "53422",
  "title": "Simonson on Type Spec'ing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Mark Simonson posted this on his site back in September. I missed it until I now when I saw a link by Michael Bierut on Design Observer...\n\n[The Lost Art of Type Spec'ing](http://web.archive.org/web/20120710150752/http:/www.marksimonson.com/article/232/the-lost-art-of-type-specing)\n\nSince I couldn't comment on Mr. Simonson's website, I thought I'd do it here. No words can thank Steve Jobs and Apple enough for emancipating us. Having to run through that protocol to get type set for something as simple as a business card, and then hoping it turns out right, is up there with sticking a hot, rusty fork in my eye. And that was only twenty something years ago! What a pain in the arse graphic design had to be. And then there was photo editing which could only be done with airbrush, or sending out for hundreds of dollars an hour.\n\nThanks for the historical reflection Mr. Simonson.\n\n",
  "author": "BlueStreak",
  "time": "13 Jan 2009 — 9:34am",
  "uid": "9700",
  "comments": [
    {
      "time": "13 Jan 2009 — 10:41am",
      "content": "I gotta tell ya, though: for me, there are few things more satisfying in typography than marking up a long manuscript for a compositor. I've been doing it for decades, from hot-metal Monotype through phototype through several generations of digital typesetting. I still love it.\n\nOn a complex book ms, I do not make a style sheet for every element. I do make a Quark START file for the compositor. But then I mark the whole ms, to make sure I know what is going on, as well as to instruct the compositor. I could do this all day; every day.\n\nIn one of the first (maybe the very first) issues of \"Typography Papers,\" Paul Stiff wrote a wonderful article called \"Instructing the Printer.\" It deals in part with specifying type, but also with the whole range of interactions among the people who make a book. It is one of the best things I've ever read about our craft. It is from an historical perspective, but I think much is—or could be—relevant today. Read it.\n\nIt was so much fun to work with those Minneapolis composition shops in the late 1980s, maybe the same one that set Mark's type. I'd send the jobs out at 5 p.m. and in the morning they'd be at my desk. There was one proofreader I'd allow to call me as late as midnight if there were questions on a job. He was so damn good. He could spot my flubs in a minute and a minute later he'd have the fix in mind and be able to tell me on the phone. Then I'd go back to bed and rest easy. I bet Mark knows who that guy is. He plays a lot of pool now, the state of the proofreading trade is so degraded there's very little work any more. But that is meat for another thread.\n\nI'm glad that I still get to specify type.\n\npowers\n\n"
    }
  ]
}
