{
  "id": "5345",
  "title": "Fonts in QuarkXPress6 on Mac OS/X",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "As you may know, Quark has made the decision not to support OpenType and Unicode in their Mac OS/X product. Most font problems in QuarkXPress 6 relate to the use of language fonts like CE, Greek, Cyrillic, or any Type1 font that has a non MacRoman encoding.   \n  \nType1 fonts in Mac OS/X rely on the new Apple Quartz system to define a codepage for the correct encoding. This however is not performing as expected, and is unlikely to be addressed by Apple as the Type1 font format is seen by Adobe and Apple as redundant.   \n  \nThe DTP Types hfont Format   \n  \nAt DTP Types Limited, we have developed a hybrid font format that performs like a Type1 font in QuarkXPress for Mac OS/X for any encoding. We call this new format 'hfont' format. hfonts also work well in all other Mac OS/X applications that we have tested (Adobe InDesign, Illustrator, Photoshop, Microsoft Word, Nisus Writer, Apple Text Edit). They perform like any other font in the system and can be installed via 'Fonts' folders or by any font manager software (e.g. Suitcase). The new format does not solve the problem of passing non-Unicode text to Unicode applications or Unicode text to non-Unicode applications. The new hfonts will not work in Mac OS/9.   \n  \nDTP Types hfont Availability   \n  \nAll DTP Types fonts are available in hfont format at the same cost as Type1 fonts. We can also create hfont format fonts from any other font manufacturer, providing their license agreement allows this, or there is permission from the manufacturer for us to create the fonts for you. The creation of fonts from other foundries is a chargeable service, the price is available on application.   \n  \nA trial hfont format font is available from our web site. [http://www.dtptypes.com](http://web.archive.org/web/20050525001614/http:/www.dtptypes.com/)\n\n",
  "author": "malcolm",
  "time": "Thu, 2004-06-24 07:39",
  "uid": "3320",
  "comments": [
    {
      "time": " Wed, 2004-07-07 23:34",
      "content": "Although QXP 6 does not do these things, reportedly QXP 7 will. Only time will tell, of course.   \n   \nT\n\n"
    }
  ]
}
