{
  "id": "53456",
  "title": "Outstanding Resume Designs?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all:\n\nI need inspiration— really bad!\n\nA case of designers block.\n\nI can find great business cards, brochures, annual reports, and even a fabulous poster here and there.\n\nBut...\n\nI can’t seem to find résumé designs that are not tacky or from MS Word templates.\n\nI would like see designs from actual graphic designers.\n\nPlease post links and images if you can.\n\nMikey Diaz :o)\n\n",
  "author": "SuperUltraFabulous",
  "time": "13 Jan 2009 — 11:02pm",
  "uid": "12479",
  "comments": [
    {
      "time": "14 Jan 2009 — 4:59am",
      "content": "Hi!  \ni don't have any pictures to show you... but i do have some examples. I think this is kind of confidential, but well, it's just ideas... :)\n\n1- The first CV i ever sent was a bottle of Tonic Water, i changed the label of the bottle and put my own info (same design, same font). for example, the code bar had my ID number...  \n2- A friend of mine sent a CV to a design agency cald \"Claw\", so she hand-made a cat holding her cv.  \n3- i heard of a girl that sent a bottle of ferment, saying that she would make the agency grow... (i realy like this idea!)\n\njust have to be creative, and make something special for each place you send you cv... i think this realy works :P\n\n"
    },
    {
      "time": "14 Jan 2009 — 8:16am",
      "content": "\"just have to be creative\"\n\nWell, I'd say the resume is pure raw data and isn't always the place to be creative. The portfolio? Sure. But resumes have a very specific purpose and should be streamlined to suit that sole purpose.\n\nSadly, that's often a Word file with keywords to survive a pass through the corporate key-word-scanner. ;0)\n\n"
    },
    {
      "time": "14 Jan 2009 — 9:33am",
      "content": "I had a conversation about this very topic with one of my teachers yesterday. Her advice was that the first person to look at your resume will probably be someone in HR, not necessarily a design-minded person, so you shouldn't get too \"cute.\" Just do everything you would do for a conservative text design; keep it clean, and be just as anal over the little things as you normally are. You can maybe get a little creative with your name, but not too much.\n\nI've actually seen a pretty cool design that uses a two-column layout. It's just distinctive enough to be unique, but still a bit conservative. I'm trying to work my own resume into that sort of design now, but I don't think I have enough content to warrant it.\n\nOh, and do it in InDesign, not Word.\n\n"
    },
    {
      "time": "14 Jan 2009 — 3:45pm",
      "content": "Some of my friends have great resume/CV designs, PDFs are available from their websites:\n\n[http://florencetruong.com/](http://web.archive.org/web/20131201004021/http:/florencetruong.com/ \"http://florencetruong.com/\")  \n [http://www.sincerelyross.com/](http://web.archive.org/web/20131201004021/http:/www.sincerelyross.com/ \"http://www.sincerelyross.com/\")  \n [http://gracepartridge.com/](http://web.archive.org/web/20131201004021/http:/gracepartridge.com/ \"http://gracepartridge.com/\")  \n [http://alanwoo.ca/about/](http://web.archive.org/web/20131201004021/http:/alanwoo.ca/about/ \"http://alanwoo.ca/about/\")  \n [http://keithtam.net/about.html](http://web.archive.org/web/20131201004021/http:/keithtam.net/about.html \"http://keithtam.net/about.html\")\n\nand here are two version of mine:  \n [http://abiabiabi.com/index.php?/about-this-site/](http://web.archive.org/web/20131201004021/http:/abiabiabi.com/index.php?/about-this-site/ \"http://abiabiabi.com/index.php?/about-this-site/\")\n\n"
    },
    {
      "time": "14 Jan 2009 — 9:15pm",
      "content": "Mikey, [here's a Google search with previous Typophile threads about resumes](http://web.archive.org/web/20131201004021/http:/www.google.com/search?hl=en&lr=&safe=off&client=safari&rls=en-us&as_qdr=all&q=resume+site%3Atypophile.com&btnG=Search)... maybe some of these will be helpful.\n\nP.S. Here are some results from [AIGA's website](http://web.archive.org/web/20131201004021/http:/www.google.com/search?hl=en&lr=&safe=off&client=safari&rls=en-us&as_qdr=all&q=resume+site%3Aaiga.org&btnG=Search).\n\n"
    },
    {
      "time": "15 Jan 2009 — 3:34am",
      "content": "In the end it depends on to were you'll be sending your CV. well, i can only talk about what I see here around me: a) most agencies here are too small to even have a HR or someone dedicated to recieve the CVs, normaly they are simply sent to the Criativity Director; b) in a design office here, everybody expects you to be different when you apply to a job; c) i think that if your CV is the first thing employers see, it should be a window to what/who you are. \"very specific purpose\" does not mean, in my opinion, that it should be \"uncreative\".\n\n"
    },
    {
      "time": "15 Jan 2009 — 3:37am",
      "content": "in the end, i agree with all of you, but nevertheless, there's always different ways to do things. :)\n\n"
    },
    {
      "time": "20 May 2009 — 10:10pm",
      "content": "I would like thank everyone for their comments.\n\nAbi I especially appreciate you contribution. And I love your resume very much.\n\nMikey :-)\n\n"
    },
    {
      "time": "21 May 2009 — 8:15am",
      "content": "I'd sooner wash dishes before I use my skills to create colourfull land-fill (note the dotless ı).\n\n ![](http://web.archive.org/web/20131201004021im_/http:/typophile.com/files/ctdcv_top_10_3740.jpg)\n\n"
    },
    {
      "time": "21 May 2009 — 8:48am",
      "content": "I'm on the job hunt these days and have two resumes. My pretty PDF that I tend to send to design firms and the plain Jane .doc file that I tend to send to more IT related firms and recruiters.\n\nI had a recruiter the other day say that \"Oh, can you send me the nice version with the graphics and stuff?\". It's nice to be reminded that, at least when put side-by-side, people do notice the better designed piece.\n\nI guess my next challenge is to make my .doc resume a bit more 'designed'.\n\n"
    },
    {
      "time": "21 May 2009 — 12:46pm",
      "content": "Christopher,\n\nItem number ten; \"need's?\" Seriously, with an apostrophe? Is that a Nova Scotia thing?\n\nPuzzled,  \nAK\n\n"
    },
    {
      "time": "21 May 2009 — 5:42pm",
      "content": "@ Alaskan: Heh. Nope. It's just wonderfully ironic. A typographer that can't spell. Thanks for the proof-read!\n\n(I actually didn't notice it before now)\n\n"
    },
    {
      "time": "21 May 2009 — 8:37pm",
      "content": "Resume spelling is one area where creativity is discouraged. :)\n\n"
    },
    {
      "time": "23 May 2009 — 1:48am",
      "content": "Christopher Dean \\>\\>\\> Baseline shift the “@” symbol in the email address included in your résumé.\n\nMikey :-)\n\n"
    },
    {
      "time": "23 Nov 2013 — 12:38am",
      "content": "I am going through this post and thinking of it’s theme and trying to understand what is this post about. At last I can have found something from this post which feels pretty good.\n\n"
    },
    {
      "time": "23 Nov 2013 — 12:42am",
      "content": "This is very much great and hope fully nice blog. Every body can easily found her need able information. I am visit first time but I fond many use full article. I will back again when get time.\n\n"
    }
  ]
}
