{
  "id": "53461",
  "title": "Peggs",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi everyone,\n\nLong time watcher, first time register/poster here.  \nI'm currently working on a typeface that I designed for a mens boutique in Brighton, UK.\n\nIt started off as a bold variant, but i've carried on as a regular weight.  \nThe actual typeface generation (everything except the characters 'Peggs & son.') were created for a two week uni project.\n\nI'm now working on it in fontlab studio. A lot of the metrics still need to be tweaked as well.\n\nAny criticism, pointers, help etc would be hugely grateful!\n\nThanks  \nEdd\n\n| Attachment | Size |\n| --- | --- |\n| [peggs\\_regular.pdf](http://web.archive.org/web/20150417162727/http:/typophile.com/files/peggs_regular.pdf) | 444.58 KB |\n\n",
  "author": "Colophon-Foundry",
  "time": "14 Jan 2009 — 4:09am",
  "uid": "41485",
  "comments": [
    {
      "time": "14 Jan 2009 — 5:06am",
      "content": "I think it's quite nice.  \nSome ot the glyphs could probably be improved (I see a kink in the e, the S looks too wide to me) but worth working on.  \nprgr\n\n"
    },
    {
      "time": "14 Jan 2009 — 7:40am",
      "content": "I think that you have the potential for a really nice font.  \nThe serifs feel optically too heavy compaired to the other strokes within the forms.  \nMost of the joints especially where a bowl meets an ascender are too heavy.  \nThe tight radius curve on the ascender of your lowercase letters are a little broken (see Karen Cheng's book Designing Type on \"the bone effect\" to solve these issues.  \nMy last comment is that the extension stroke on commas, etc. are too long.\n\nGreat structure and good luck, I would like to see the finished result.\n\n"
    },
    {
      "time": "16 Jan 2009 — 3:57am",
      "content": "Nice work. This looks really promising. I do think you should change UC letters to incorporate that curvy serif transition. Righ now it's just K and L that have it. LC is more consistent with it.\n\nOtherwise UC letters remind too much of some other typography.\n\nThe same thing's with LC from v on. No distinction and not really looking like a part of the same family.\n\nBut it may just be me.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "16 Jan 2009 — 2:13pm",
      "content": "Hi,\n\nThanks for your thoughts on this!  \nA lot of the small kinks, and the like occured when I brought all of the glyphs into fontlab. I initially drew it in illustrator, and then brought it in, and as it wasn't drew on a correct grid, nodes got pulled around creating odd thicknesses etc. I'm currently going through it all and trying to tidy it all up.\n\nThe overall idea for the face is taken from old typewriter fonts where the bowls of characters sometimes don't connect, so this little feature was taken as a major inspiration for the face. In characters like the v, w etc, I couldn't replicate this feature, so got a bit stuck. I'll see what I can come up with though!\n\nThankyou everyone for your thoughts! Its always nice to get another pair of eyes on something that I've been looking at for a while.\n\n"
    },
    {
      "time": "17 Jan 2009 — 12:03am",
      "content": "What works beautifully for the lowercase ascenders does not look good on the uppercase at all. In contrast to Robert, I think you should remove that element from K and L.\n\n"
    },
    {
      "time": "19 Jan 2009 — 6:38am",
      "content": "Some little thing for now. I think your OSF 3, 4 and 5 number should be below the baseline. The top S should have his serif.\n\n"
    }
  ]
}
