{
  "id": "53476",
  "title": "A Kewl Story and a sweet release",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "**[A Kewl Story](http://web.archive.org/web/20131015032006/http:/www.veer.com/download/pdf/kewlscript.pdf)** was produced to illustrate the use of **[Kewl Script font](http://web.archive.org/web/20131015032006/http:/sudtipos.com/fonts/112)**, one of the 2 new Sudtipos releases. All illustrations were specially done by the argentinian artist Catnez . Grab it!\n\n ![](http://web.archive.org/web/20131015032006im_/http:/typophile.com/files/kewl1_5955.jpg)\n\nKewl Script is the result of being caught in the afterimage of one design project while conceptualizing another one. Just before finishing the final tests on Mrs Blackfort, the first of what became a long series of Charles Bluemlein fonts, some of the letters began morphing differently in my mind. The idea was to go on the heavier and more playful side, but with a South American sign letterer’s twist, rather than just good handwriting. I did some sketching, took some notes, then got busy with other projects. Some of that stuff eventually seeped into Candy Script and, to a lesser extent, the Whomp font. But it was only a matter of time before I got back to the original concept and finished it. Kewl Script is ideal for food packaging, book and music covers, magazines, and window splashes.\n\n///////////////////////////////////////////////////////////////////////////  \nA sweet release - Sugar Pie  \n///////////////////////////////////////////////////////////////////////////\n\n ![](http://web.archive.org/web/20131015032006im_/http:/typophile.com/files/sugar2_3759.jpg)\n\nI called it **[Sugar Pie](http://web.archive.org/web/20131015032006/http:/sudtipos.com/fonts/111)** because it has a sweet taste, quite similar to Candy Script, mostly because of its round-to-sharp terminal concept. This in turn echoes the concept of the clean brush scripts found in the different film type processes of late 1960s and early 1970s.\n\nWhile Candy Script’s main visual appeal counts on the loops, swashes, and stroke extensions working within a concept of casual form variation, Sugar Pie is artistically a straight forward packaging typeface. Its many ligatures and alternates are just as visually effective as Candy Script’s, but in a subtler and less pronounced fashion. The alternates and ligatures features of Sugar Pie contain quite a few nice variations on the main character set. Use them to achieve the right degree of softness you desire for your design.\n\nThe **[Sugar Pie PDF](http://web.archive.org/web/20131015032006/http:/www.veer.com/download/pdf/sugarpie.pdf)** specimen illustrates some possible uses of the font.\n\n ![](http://web.archive.org/web/20131015032006im_/http:/typophile.com/files/specimens_6332.jpg)\n\n",
  "author": "Ale Paul",
  "time": "14 Jan 2009 — 12:43pm",
  "uid": "827",
  "comments": [
    {
      "time": "14 Jan 2009 — 12:58pm",
      "content": "When do you sleep?\n\n"
    },
    {
      "time": "14 Jan 2009 — 1:55pm",
      "content": "or  \nWhen you sleep, where do your fingers go?\n\n"
    },
    {
      "time": "15 Jan 2009 — 4:26am",
      "content": "what is sleep? lol\n\n"
    }
  ]
}
