{
  "id": "53472",
  "title": "Therapist Logo Critique",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello all,\n\nIt's been some time since I last posted a logo for critique, but you have all been so helpful [in the past](http://web.archive.org/web/20120715221631/http:/typophile.com/node/10008 \"Critique of a law firm logo\") that I thought I would throw another one your way.\n\n ![](http://web.archive.org/web/20120715221631im_/http:/typophile.com/files/Logo%20-%20Full%20Color%20(low%20resolution)_6151.png)\n\n&nbsp;  \nThis was a full identity package that needed to work across multiple media: web, print, etc. It needed to be inviting but still professional.\n\nI really wanted to push myself on this one and get the identity to ride purely on the strength of the type, the color, and the layout. Too often I try to solve a logo problem by just finding the magic shape or illustration. The result is often that I don't spend enough time exploring type and color as a way of unifying and carrying the overall brand identity. So any thoughts along those lines would be much appreciated.\n\nHere's how it came out on the [website](http://web.archive.org/web/20120715221631/http:/www.beukematherapy.com/), the [business card (PDF)](http://web.archive.org/web/20120715221631/http:/www.beukematherapy.com/marketing/Business%20Card%20-%20Vertical.pdf) , and [the letterhead (PDF)](http://web.archive.org/web/20120715221631/http:/www.beukematherapy.com/marketing/Letterhead.pdf).\n\nThe design is done, so this is just a learning exercise for me.\n\nPeter\n\n",
  "author": "Peter G.",
  "time": "14 Jan 2009 — 11:59am",
  "uid": "6256",
  "comments": [
    {
      "time": "14 Jan 2009 — 12:02pm",
      "content": "It's quite nice. Only thing I would have suggested is that the rules are perhaps superfluous.\n\n"
    },
    {
      "time": "15 Jan 2009 — 12:06am",
      "content": "I think the type is Droid right? Maybe the second line is too big and it takes importance from the doctors name. Should be second in attention.\n\n"
    },
    {
      "time": "15 Jan 2009 — 6:16am",
      "content": "Luciano,\n\nThat was one critique I had of the logo as well. But I was stuck with the second line. What could I have done with the second line to de-emphasize it? (Other than shrinking it).\n\n"
    },
    {
      "time": "15 Jan 2009 — 2:31pm",
      "content": "\\>What could I have done with the second line to de-emphasize it? (Other than shrinking it)\n\nWhen dealing with any kind of design you want to focus on breaking down the elements into their respective hierarchies. In this case I would assume that the doctor's name is the most important element. Assuming it is, I would have done three things differently.  \n1. Make the doctor's name bigger. His name is his brand so emphasis on that is important. I would also have made that the colored element instead of regular ol' black.  \n2. Drop the medical credentials down right underneath the doctor's name. They are necessary only for validation that he is a medical professional.  \n3. Drop the rules to tighten up the whole package. If you (or your client) feel that they are necessary, keep them in but take them down a point size or two and tighten them up. Too much negative space in your composition will make it feel like it isn't cohesive.\n\nI always find it's fun to revisit a logo even when it's out the door. It's a great way to learn from your mistakes and grow as a designer!\n\n"
    },
    {
      "time": "15 Jan 2009 — 4:46pm",
      "content": "Those are very helpful. Regarding #1: That's interesting, I actually made his name black because I thought that would emphasize it more. And regarding #3, you're spot on about tightening it up. That was probably my biggest hesitation about the logo when I handed it off though I don't think I could have articulated the problem at the time.\n\nMany thanks for the comments.\n\n"
    }
  ]
}
