{
  "id": "535",
  "title": "Richmond Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi   \n   \nThis is the start of a new font I am working on, it's the first time I've attempted a sans serif, so advice and help please.   \n   \nThanks   \n   \nJim / [http://www.unionfonts.com](http://web.archive.org/web/20131012104054/http:/www.unionfonts.com/)   \n   \n ![RichmondSans](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/12563.jpg)\n\n",
  "author": "union",
  "time": "6 Jul 2003 — 3:39pm",
  "uid": "614",
  "comments": [
    {
      "time": "7 Jul 2003 — 9:52am",
      "content": "Hi Jim,   \n   \nI like the basic idea, but I think you are using two different styles. The 'a h m n y' are a little flattened on the top and/or bottom and have a very nice serif. But with the 'b d g p q' you use a different kind of serif. Perhaps you should try to use the same serif style.   \nI would also remove the lower serif on the 'q'.   \nI can't really see if the serifs have a pointy or block end. I kind of like the look on the 'n'. But I see that the 'm' has a block-end serif (does this make sence? My English is rosty).   \n   \nHow about serifs like this?   \n ![Richmond serifs](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/12598.gif)   \n   \nKeep it up, I think you're on the right way.   \n   \nRen\n\n"
    },
    {
      "time": "7 Jul 2003 — 12:04pm",
      "content": "Ren\n\n"
    },
    {
      "time": "7 Jul 2003 — 1:25pm",
      "content": "i saw that i probably had problems, good advice!\n\n"
    },
    {
      "time": "8 Jul 2003 — 2:07am",
      "content": "some letters like m,u,h,n are way too wide\n\n"
    },
    {
      "time": "8 Jul 2003 — 11:55am",
      "content": "I think the m look ok, but the h, n, and u are wide. Currently the u looks like the n rotated 180. If you leave it at that the u will look especially wide. Once you have the n right, rotate then narrow it 10% (guess?).   \n   \nRandy\n\n"
    },
    {
      "time": "8 Jul 2003 — 12:25pm",
      "content": "interrupting:   \n   \nRandy -- take a face such as Myriad, create outlines,   \nand overlap the the r, n and u (rotated 180) for a good primer   \non the relationship between these characters.   \n   \nbj\n\n"
    },
    {
      "time": "8 Jul 2003 — 1:28pm",
      "content": "Hmm... thanks BJ. Went back and examined a bunch of faces:   \nMyriad, Frutiger, Adobe Garamond, Sabon. The width of the   \nn and u are almost exactly the same.   \n   \nI think I remember seeing something on this subject at the   \nUnderware site. But when I went back it looked like they   \nhad taken it down. 10% is probably a bit much. Even in   \nthese cases where they are exactly the same the result is   \nthat the u looks optically wider. Bear in mind, I don't   \npretend to know more than Frutiger, Tschichold, Slimbach   \nand Twombly.   \n   \nRegards,   \nRandy\n\n"
    },
    {
      "time": "8 Jul 2003 — 1:54pm",
      "content": "\\> the u looks optically wider   \n   \nYes, and that's because the tops of letters bear more weight. And of course in a serif face the inside has two half-serifs in the \"n\" but only one in the \"u\", and that amplifies the effect.   \n   \nIf somebody has made the counters of the \"n\" and \"u\" mathematically the same, it means he's either oblivious to this optical issue... or he simply wants the \"u\" to look wider!   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jul 2003 — 2:04pm",
      "content": "I have to admit, it's because this is my first sans serif attempt, if you know of a good website, where I can read up on this stuff I'd be grateful.   \n   \nHere are two of the letters a bit bigger, I have altered the b to try and bring in more in line with the a. Any comments would be great. ![ab](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/12670.gif)\n\n"
    },
    {
      "time": "23 Jul 2003 — 11:40am",
      "content": "I'd like to see a version of \"b\" without the tail/spur, to distinguish it from the \"d\". You might try leaving it rounded, or bringing it to a subtle corner instead of using a spur or a tail.   \n   \nAlso, whatever solution you use for \"h\", \"m\", \"n\", \"r\" and \"u\" should harmonize with the \"y\", at least in the form you have chosen for it.   \n   \nI would also suggest shortening to top end of the \"s\" slightly, to avoid the appearance that it is about to fall over to the right.   \n   \nI'd be curious to see what roman serif faces this design might complement. It seems to me to be a fairly original sans serif design. I'm excited to see what you can do with it.   \n   \nDavid\n\n"
    },
    {
      "time": "23 Jul 2003 — 4:22pm",
      "content": "Thanks David, I've tried the b without the tail. I've also put the new c Iam playing with on this jpg. ![richmond_ps2](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/13238.jpg)\n\n"
    },
    {
      "time": "23 Jul 2003 — 8:44pm",
      "content": "Jim, don't use JPEG for type specimens - I can see the stretch marks.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jul 2003 — 5:25am",
      "content": "shite, I guess it's time to think of a new name.   \n   \nHrant - Do you think the b should have a tail to match the d or do you prefer it not matching?   \n   \nThanks for your time\n\n"
    },
    {
      "time": "24 Jul 2003 — 8:39am",
      "content": "Definitely no tail on the \"b\".   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jul 2003 — 9:02am",
      "content": "You could call it Sheen, since Richmond was Sheen before they changed it and name Richmond and Richmond VA after Richard. or maybe Richmond and Sheen or Ham and Sheen. But really names just happen so I wouldn't worry, it's the design that matters.\n\n"
    },
    {
      "time": "24 Jul 2003 — 9:26am",
      "content": "\\> But really names just happen so I wouldn't worry, it's the design that matters.   \n   \nIt's interesting how some designers think a name is tangential, while others think it's very important, while still others just enjoy naming too much to care either way.   \n   \nI think a name is very important, especially in the retail world. And not just euphonically, but alphabetically too: Zapf's fonts are used a lot not just because they're good, but because people (laymen - the vast majority) go through their font menu and if they get to the end they have to choose _something_!   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jul 2003 — 3:01pm",
      "content": "Following on nicely from Hrant's comment about the importance of a good name, my new working name for the font is BenchSans.   \n   \nIf you compare it to the first version os Richmond at the top you'll hopefully see I've sorted a lot of the harmanizing problems.   \n   \n ![](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/13366.gif)\n\n"
    },
    {
      "time": "27 Jul 2003 — 3:28pm",
      "content": "It's getting there!   \n   \nThe \"e\" is leaning backwards - try making the bar straight.   \nThe \"f\" seems too plain.   \nThe \"g\" seems to need an ear.   \nI'd make the \"i\"/\"j\" dots square.   \nThe upper arm of the \"k\" is too thick.   \nI'd give a top-left corner to the \"p\".   \nThe \"x\" is top-heavy.   \n   \nThe descenders are too long.   \nI think all your stroke shears should be \"uphill\" (like in the \"d\"), or flat.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jul 2003 — 7:52pm",
      "content": "\\> The \"e\" is leaning backwards - try making the bar straight.   \n   \nOr try shortening the bottom stroke a bit to compensate.   \n   \nDavid\n\n"
    },
    {
      "time": "27 Jul 2003 — 7:55pm",
      "content": "(Duplicate post)\n\n"
    },
    {
      "time": "27 Jul 2003 — 8:49pm",
      "content": "\\>\\> if you know of a good website, where I can read up on   \nthis stuff I'd be grateful.   \n   \nJim, I know it's not helpful now, but...   \n   \nLeslie Cabarga   \n   \n [www.flashfonts.com](http://web.archive.org/web/20131012104054/http:/www.flashfonts.com/)   \n   \njust finished a book, The Logo, Font & Lettering Bible.   \n   \nHe previewed some of it   \nat his workshop at TypeCon.   \n   \n   \n [http://www.flashfonts.com/flashsite/entries.html](http://web.archive.org/web/20131012104054/http:/www.flashfonts.com/flashsite/entries.html)   \n   \nIt's expected to be out this fall.\n\n"
    },
    {
      "time": "31 Jul 2003 — 4:07pm",
      "content": "Thanks for the further advice. Here is a new 'e', I tried both Hrant and David's suggestions, but making the bar straight seemed to work better for me.   \n   \nHere is a before and after.   \n   \n ![](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/13531.gif)\n\n"
    },
    {
      "time": "1 Aug 2003 — 1:07am",
      "content": "Hi Jim,   \n   \nsome little things come to my eye seeing your font:   \n- In all the ascenders are diagonally cut of at the top. Why not do the same with the 'L'?   \n- the lower part of the 'e' could be a little shorter. Like this it optically gives you the feeling of 'falling backwords'. (\\*Maybe\\* then you could keep the tilted bar??? I kind of liked it.). The same goes for the 'c'. The lower part just a little shorter. (blue arrows)   \n- the 'a' is now the only glyph with a tail. Why not remove that also? This optically makes the bulb a little bigger. That also benefits the readability. (yellow arrow)   \n- I would think about making the dots on the 'i' and 'j' a little less higher. Keeping them under the body height doesn't optically stretch those glyphs too much.   \n- the 't' looks a little bit to unsofisticated, 'simple'. you should try to get a little more character in there.   \n- Can it be that the 'x' is too thin compared to the oter glyphs? You also have to optically correct the center of it, where all the legs come together. Try looking for other fonts. There you will see that those legs don't really meet in the middle. But optically they seem to do so.   \n- Maybe it's the display, but the 'n', 'u', 'v', 'x' seem all a little too thin to me.   \n- Last but not least. It looks like the round parts are half circles. Maybe you could just take the symmetry out of them by pushing one side a little bit out (look for the red arrows). By doing that they will look a little bit more like the 'b' and 'd'. Because they have a little straight part in their bulb, the tend to look more squared. I think you want it to look a little bit squared, so try to force the glyphs to do that.   \n   \n ![Corrected](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/13539.gif)   \n   \nPhoei, that took me some time to write that out. I hope this makes sence and will help you a little farther on the way.   \nI like the font and would like to see it ready. I'm very curious about your numbers.   \n   \nRegards,   \nRen\n\n"
    },
    {
      "time": "1 Aug 2003 — 5:04am",
      "content": "I get this message after every update, but the update is on the website. I see now that my image is uploaded.   \n   \nAny thoughts on this \"Administrator\"???   \n   \nRen\n\n"
    },
    {
      "time": "10 Oct 2003 — 10:11am",
      "content": "![](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/18301.gif)\n\n"
    },
    {
      "time": "10 Oct 2003 — 12:20pm",
      "content": "Jim, I think you may have taken a step backward here, or maybe you're just evolving the face in a direction that doesn't suit my personal taste.   \n   \nI preferred the tail-less b, h, i and spur-less g. (The t is too tall, but that looks like it might be scaling mistake, not a design decision.) I also miss the flared join that you used on the m, n and u. (The new m is kinda homely. Consider using a common approach on both arches.)   \n   \nFinally, the descenders on the g and y seem too deep for the shortish ascenders.\n\n"
    },
    {
      "time": "10 Oct 2003 — 1:09pm",
      "content": "Hi   \n   \nIt's interesting that you both prefer the older design. I came back to this font after a few months, and maybe I've taken a wrong turn, I look forward to hearing what everyone thinks of the caps   \n   \n ![](http://web.archive.org/web/20131012104054im_/http:/www.typophile.com/forums/messages/29/18318.gif)\n\n"
    },
    {
      "time": "23 Jul 2003 — 4:48pm",
      "content": "Jim - A heads-up: Jim Parkinson just released a [Richmond](http://web.archive.org/web/20131012104054/http:/www.myfonts.com/fonts/parkinson/richmond/).\n\n"
    },
    {
      "time": "1 Aug 2003 — 9:38am",
      "content": "From what I've experience Ren\n\n"
    },
    {
      "time": "10 Oct 2003 — 12:28pm",
      "content": "Jim -- maybe you've started a new version? -- what I meant to add, was .... don't abandon what you had previous to this last version. I prefer the sterility of that one as opposed to the clever additions of this new one.\n\n"
    }
  ]
}
