{
  "id": "5351",
  "title": "BRAVO Tiffany, the EULA G\\_enius!",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "SoTA's Interrobang 2 contains a great article, \"The case for a User-Friendly EULA,\" by Tiffany Wardle. It just might have been inspired by a thread here on Typophile where she volunteered to put together a matrix of EULAisms from assorted foundries. GREAT JOB Tiffany!!   \nOh, and there is a bunch of other reallly good articles too :-)   \n   \nChrisL\n\n",
  "author": "dezcom",
  "time": "24 Jun 2004 — 2:13pm",
  "uid": "3135",
  "comments": [
    {
      "time": "11 Aug 2004 — 12:22pm",
      "content": "You should've seen her tongue-lash the near-sighted font houses in person at TypeCon.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Aug 2004 — 6:08pm",
      "content": "\\>You should've seen her tongue-lash the near-sighted font houses in person at TypeCon. \\<   \n   \nNot our sweet meek-mannered Tiff :-)   \n   \nYou go girl!\n\n"
    },
    {
      "time": "13 Aug 2004 — 11:37am",
      "content": "hey, how can i get my own copy of Interrobang?! I'd like to read the article myself.\n\n"
    },
    {
      "time": "13 Aug 2004 — 1:20pm",
      "content": "\\>how can i get my own copy of Interrobang?\\<   \nThe trick is to join SoTA and it comes with the membership.\n\n"
    },
    {
      "time": "15 Sep 2004 — 5:05am",
      "content": "Tiffany's article is online, [here](http://web.archive.org/web/20150414063911/http:/fontlab.wikidev.net/The_Case_for_a_User-Friendly_EULA).   \n(via [Chez Porchez](http://web.archive.org/web/20150414063911/http:/www.porchez.com/article/196/eula-article))\n\n"
    },
    {
      "time": "24 Sep 2004 — 3:51am",
      "content": "EULAs don't protect anything\n\n"
    },
    {
      "time": "24 Sep 2004 — 4:05am",
      "content": "Yes, just collections of words, like the Carta Magna, Amurabi's Code (I don't know the correct spelling in English) or the US Constitution: just words.   \n   \nThe Word, the Law, Writting: this is Civilization.\n\n"
    },
    {
      "time": "24 Sep 2004 — 11:23am",
      "content": "Hmmm.   \nWho was more/less civilized, the American Indians, or the invading Europeans and settling Americans?   \n   \nFormalism, visible language, etc. are merely avenues through which civilizations express themselves, and very often \"civilizations\" that are well-dressed and nicely smelling are constituted of SAVAGES.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Sep 2004 — 2:07pm",
      "content": "Who was more/less civilized, the American Indians, or the invading Europeans and settling Americans?   \n   \nc\n\n"
    },
    {
      "time": "24 Sep 2004 — 2:34pm",
      "content": "The Savage beast is present in any and every human grouping, whether we deem them civilized or not. This goes for those who may inhabit the loftiest of White houses, regal palaces, terrorist cave hideouts, or grass huts. It does not matter how they smell, dress, or what language they speak. There have always been exploiters among us and, sadly it seems, there always will be. Judge individuals by there individual deeds, not easily identifiable groups by association.   \n   \nChrisL\n\n"
    },
    {
      "time": "24 Sep 2004 — 2:34pm",
      "content": "The Savage beast is present in any and every human grouping,...   \n   \nI might suggest that the beast is present in _every human._ It seems to me that even the clearest thinkers and kindest folk can be occasionally exploitive, just as those who appear self-involved or angry can often surprise us with their sensitivity and generosity.   \n   \nJudge individuals by there individual deeds...   \n   \nI think this might be the key; although it is often (for me, at least) difficult to accomplish.   \n   \ncheers,   \nDana\n\n"
    },
    {
      "time": "24 Sep 2004 — 3:08pm",
      "content": "Well, they **do** protect things. They protect typefaces, their designers, and founderies. If you break a EULA, you can be sued in court, which happens occasionally.\n\n"
    },
    {
      "time": "24 Sep 2004 — 3:10pm",
      "content": "Perhaps EULA\n\n"
    },
    {
      "time": "24 Sep 2004 — 3:58pm",
      "content": "\\>Judge individuals by there individual deeds...   \nI think this might be the key; although it is often (for me, at least) difficult to accomplish.\\<   \n   \nIndeed it is very difficult for us to accomplish but it is the only chance the Human race has to actually become civilized (instead of just giving the appearance of it).   \n   \nChrisL\n\n"
    },
    {
      "time": "26 Sep 2004 — 4:51am",
      "content": "Hi, Hrant.   \n   \nI've come back.   \n   \n\"Who was more/less civilized, the American Indians, or the invading Europeans and settling Americans?\"   \n   \nThe American Indians had their words, their laws and their \"writting\". That's American Indians Civilization.   \n   \nI think it's very easy to forget that we, europeans, were invaded a lot of times, and with every invasion a lot of important things were completly lost.   \n   \nIberians, for instance, had their words, their laws and their writting. That was, or is, Iberian Civilization. You can see some of its productions in archaeological museums.   \n   \nEvery cultural environment has its own laws and any individual inside this environment knows she or he gets in a bad situation if she or he forget that.   \n   \nBy the way, I forgot the Berne Convention in my previous post...   \n   \njmc \\_=+\n\n"
    },
    {
      "time": "26 Sep 2004 — 5:11am",
      "content": "Of course Europe has been the victim of countless atrocities and acts of violence over the ages. I don't think that anyone would deny that. But most of the invaders who came to Europe eventually settled down, and assimiliated into the location population (changing it, of course\n\n"
    },
    {
      "time": "26 Sep 2004 — 5:29am",
      "content": "\"and then say: \"remember, Europe was a victim once, too\" is just condescending\".   \n   \nI didn't mean that, Tiff.   \n   \nIt was just an example. We are \"cogiendo el r\n\n"
    },
    {
      "time": "26 Sep 2004 — 6:41am",
      "content": "OK, I understand that\n\n"
    },
    {
      "time": "26 Sep 2004 — 8:24am",
      "content": "Tiffany, I guess I can take my statement back if we both agree that words control people. They do, in a way. What I say to you might or might not\n\n"
    },
    {
      "time": "11 Aug 2004 — 12:11pm",
      "content": "Thanks, Chris. One baby-step at a time we can get it done.\n\n"
    },
    {
      "time": "11 Aug 2004 — 12:12pm",
      "content": "Thank you, Chris. One baby-step at a time, designers (those who license type) can make change happen. BTW ... The chart would not have been possible without Nathan Matteson's constant help.\n\n"
    },
    {
      "time": "11 Aug 2004 — 12:36pm",
      "content": "Ok. I wasn't that bad was I? As I started to speak I realised who was in the room and panicked a little bit. Hehehe. My defense, when in a business situation and a little nervous, is to be more out-spoken.\n\n"
    },
    {
      "time": "11 Aug 2004 — 1:13pm",
      "content": "Agreed, Chris. Thanks to Tiffany and Nathan foundries are   \nreexamining their EULAs. A few even changed their docs when   \nthey saw a preview of the chart and saw how unreasonable or   \nunclear their EULAs were.\n\n"
    },
    {
      "time": "14 Sep 2004 — 7:09pm",
      "content": "Yes, Join SOTA or go to TypeCon.   \n   \nTiffany, we talked about running the article again here on   \nTypophile. Is it within your ability as author to put it online?   \n   \n(No pressure. Heh.)\n\n"
    },
    {
      "time": "15 Sep 2004 — 2:07am",
      "content": "Hey wait! I had dibs on it first! Let's [BATTLE!](http://web.archive.org/web/20150414063911/http:/www.homestarrunner.com/20x6vs1936.html)\n\n"
    },
    {
      "time": "15 Sep 2004 — 8:33am",
      "content": "The \"here\" mentioned by Eduardo is actually the EULA Wiki which is open to the public. As for fighting in between Typophile and Typographica I won't stand for it! Hihihihi!   \n   \n [http://fontlab.wikidev.net/The\\_Case\\_for\\_a\\_User-Friendly\\_EULA](http://web.archive.org/web/20150414063911/http:/fontlab.wikidev.net/The_Case_for_a_User-Friendly_EULA)\n\n"
    },
    {
      "time": "15 Sep 2004 — 9:42am",
      "content": "\\> \\> \\> Are you asking for a CHAAHHLLLLENGE!? \\> \\>\n\n"
    },
    {
      "time": "24 Sep 2004 — 2:36pm",
      "content": "Sergej -- those are pretty strong words. I wonder why you think that.\n\n"
    },
    {
      "time": "24 Sep 2004 — 3:26pm",
      "content": "If a person is caught with their hand in the cookie jar the EULA also serves to protect the foundry ... whether that hand is one who has licensed the type but is in violation of the EULA or if the hand is someone that went to a blog of disrepute and downloaded it for free.   \n   \nGood point, Dana. And the cliche works for in this instance without being sappy.\n\n"
    }
  ]
}
