{
  "id": "53513",
  "title": "Type/lettering/calligraphy clubs/classes in NYC?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In roughly a month I’ll be settling into a new apartment just south of Union Square in New York. I would love to get involved with the type, letting, and calligraphy scene. What should I look into aside from the TDC and the Society of Scribes?\n\n",
  "author": "blank",
  "time": "15 Jan 2009 — 7:10am",
  "uid": "14722",
  "comments": [
    {
      "time": "15 Jan 2009 — 8:33am",
      "content": "James\n\nYou might want to get in touch with Paul Shaw. If you wish, you can e-mail me and I will give you his particulars.\n\nDid you get a job in NY? If so congratulations.\n\nP.s. what is letting : )\n\nMichael\n\n"
    },
    {
      "time": "15 Jan 2009 — 10:12am",
      "content": "I’ll drop you an email. And letting is what happens when I type faster than these buggy Firefox betas can keep up.\n\n"
    },
    {
      "time": "15 Jan 2009 — 10:51am",
      "content": "Hope you enjoy your new life in Babylon, James! ;-)\n\nThe Cooper Union usually has one or two [Continuing Education courses in type and calligraphy](http://web.archive.org/web/20150316060115/http:/cooperunion.augusoft.net/index.cfm?fuseaction=1011&CategoryID=2&SubCategoryID=19). I see that this semester they have a letterpress course.\n\n[The Center for Book Arts](http://web.archive.org/web/20150316060115/http:/www.centerforbookarts.org/) is another place to check every now and then, even if typography is not their main interest.\n\n"
    },
    {
      "time": "15 Jan 2009 — 12:25pm",
      "content": "Those Cooper Union classes sound great. I need to scrounge up some temp work to pay for them!\n\n"
    },
    {
      "time": "15 Jan 2009 — 10:31pm",
      "content": "James, shoot me an e-mail if you're interested in getting work through temp agencies -- it probably won't be typeface design, but it'll help pay for those classes. :-)\n\n"
    },
    {
      "time": "23 Jan 2009 — 1:18pm",
      "content": "SVA just asked me to teach a type design class for their continuing ed program. It starts on Tuesday Jan 27 and it runs through April. Hopefully it will be an ongoing thing.\n\n"
    },
    {
      "time": "23 Jan 2009 — 1:27pm",
      "content": "I probably wouldn’t be able to make the first two classes of your spring class, James. But if it becomes a regular thing I’ll sign up for a later session.\n\n"
    }
  ]
}
