{
  "id": "53520",
  "title": "Copyright symbol - spacing and order",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi people!\n\nI was just about to send a pdf to the printer when it struck me - how should a copyright line really be written, are there any rules?\n\nI opened five books from respectable publishers (mainly US/UK) and found five alternatives (not to give undue credit/critique to anyone I've replaced the copyright holder with a random name):\n\nCopyright © 2009 colaboy  \ncopyright © colaboy, 2009  \nCopyright © 2009 by colaboy  \nCopyright © colaboy 2009  \n© colaboy 2009\n\nI've also come across:\n\n©2009 colaboy  \n©colaboy, 2009  \netc\n\nWhat usage do you makers/users of the symbol suggest?\n\nDaniel\n\n",
  "author": "colaboy",
  "time": "15 Jan 2009 — 9:29am",
  "uid": "36448",
  "comments": [
    {
      "time": "15 Jan 2009 — 9:54am",
      "content": "Copyright © 2009 by colaboy  \nis preferred, since it satisfies the requirements of the Universal Copyright Convention.\n\nCurt Akin\n\n"
    },
    {
      "time": "15 Jan 2009 — 9:54am",
      "content": "I tyically use this format:\n\nCopyright © colaboy 2009\n\nIn theory, if you have the symbol, you don't need the word copyright. I suspect people started using both in the days of 8-bit character sets, when one couldn't be sure that the symbol would be correctly displayed if the document were opened on another platform; now it seems to have become conventional.\n\n"
    },
    {
      "time": "15 Jan 2009 — 10:37am",
      "content": "Thanks for your replies. Thanks also for the theory behind the duplication that I logically dislike but still find more aesthetically pleasing.\n\n"
    },
    {
      "time": "15 Jan 2009 — 1:29pm",
      "content": "Assuming we're talking about the U.S. here, this is addressed in §401b of the U.S. Copyright Code:\n\n(b) Form of Notice.—If a notice appears on the copies, it shall consist of the following three elements:  \n&nbsp; (1) the symbol © (the letter C in a circle), or the word “Copyright”, or the abbreviation “Copr.”; and  \n&nbsp; (2) the year of first publication of the work; in the case of compilations or derivative works incorporating previously published material, the year date of first publication of the compilation or derivative work is sufficient. The year date may be omitted where a pictorial, graphic, or sculptural work, with accompanying text matter, if any, is reproduced in or on greeting cards, postcards, stationery, jewelry, dolls, toys, or any useful articles; and  \n&nbsp; (3) the name of the owner of copyright in the work, or an abbreviation by which the name can be recognized, or a generally known alternative designation of the owner.\n\nYou can find this information in Chapter 4 of Title 17:  \n [http://www.copyright.gov/title17/](http://web.archive.org/web/20150110032726/http:/www.copyright.gov/title17/ \"http://www.copyright.gov/title17/\")\n\nThis doesn't necessarily prescribe the order \"Copyright, date, author\", but that's how I usually see it and do it myself. Redundancy of word and symbol is optional.\n\n-- Kent.\n\n"
    },
    {
      "time": "15 Jan 2009 — 2:42pm",
      "content": "I usually do it as:\n\n**Copyright © 2009, author**\n\nOr if colophon is typeset with little headings:\n\n**_Copyright_  \n© 2009, author**\n\n(so only when are also:\n\n_Design_  \nName of designer\n\n_Printing_  \nName of printer\n\netc.)\n\nOr:\n\n**Copyright © 2009, author, place of publication**\n\n"
    },
    {
      "time": "15 Jan 2009 — 3:11pm",
      "content": "Copyright-notice is obsolete. The fact that you publish establishes copyright.  \nOne less thing to worry about.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "15 Jan 2009 — 3:43pm",
      "content": "\\> Copyright-notice is obsolete. The fact that you publish establishes copyright.\n\nA physical notice is useful if you have to prosecute an infringement case. Putting a notice on your material means that the defendant can't claim innocent infringement:\n\n`401.d) Evidentiary Weight of Notice. — If a notice of copyright in the form and position specified by this section appears on the published copy or copies to which a defendant in a copyright infringement suit had access, then no weight shall be given to such a defendant's interposition of a defense based on innocent infringement in mitigation of actual or statutory damages...`\n\n[http://www.copyright.gov/title17/92chap4.html#401](http://web.archive.org/web/20150110032726/http:/www.copyright.gov/title17/92chap4.html#401 \"http://www.copyright.gov/title17/92chap4.html#401\")  \n [http://www.copyright.gov/circs/circ1.html#noc](http://web.archive.org/web/20150110032726/http:/www.copyright.gov/circs/circ1.html#noc \"http://www.copyright.gov/circs/circ1.html#noc\")\n\n"
    }
  ]
}
