{
  "id": "53542",
  "title": "No, thank you",
  "forum": "paragraph's blog",
  "tags": [

  ],
  "content": "",
  "author": "paragraph",
  "time": "15 Jan 2009 — 3:20pm",
  "uid": "40601",
  "comments": [
    {
      "time": "15 Jan 2009 — 5:44pm",
      "content": "paragraph\n\nI don't want to sound like dick but there are tons of fonts out there to choose from big names like Adobe, people like me shoot for. It might be the font then again it could be the price, who knows. It's a tuff market with no guarantees buddy. In the real world we might only use two fonts or three and the rest of them are collecting digital dust somewhere in the back-burner.\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "15 Jan 2009 — 11:15pm",
      "content": "Definitely a better sample image. It shows the typeface’s versatility, not just for nouveau stuff which is not much in fashion right now.\n\n"
    },
    {
      "time": "16 Jan 2009 — 8:06am",
      "content": "The new icon is much better, mostly because the colors in the old one are very dull. But tweak that green to have a more intense feeling that works better with the colors of the new MyFonts.\n\nMore importantly, you MUST do a new specimen, because this one is terrible. What you’re showing is a period-inspired design that fits in contemporary settings, but the specimen does not get that across at all. This specimen feels like it took about five minutes, zero thought, and in no way complements all the work you put into the typeface. Include an essay about your inspiration and working process to help people understand what’s going on. You’ve got a versatile face, so use it! Show Galette on a cover, as headlines and as copy in magazines, on packaging and in logos! If you don’t have the time hire a handful of cool young designers from Coroflot and get them do some good stuff. But don’t expect people to grasp the depth of your work from three pages of black-and-white text dumped unceremoniously onto the page.\n\n"
    },
    {
      "time": "16 Jan 2009 — 10:04pm",
      "content": "This is great. Thanks Stephen and James. Shall do.  \nAs you say, I do not seem to mind spending months on a typeface but I hate spending more than minutes on the marketing of it.  \nprgr\n\n"
    },
    {
      "time": "18 Jan 2009 — 12:50am",
      "content": "Understandable. Might want to [submit it to a foundry](http://web.archive.org/web/20131013115602/http:/typographica.org/001157.php) next time.\n\n"
    },
    {
      "time": "18 Jan 2009 — 4:52pm",
      "content": "James,  \nis this what you meant (here is the new cooler green)?\n\n ![](http://web.archive.org/web/20131013115602im_/http:/typophile.com/files/galette-200_6191.png)\n\nprgr\n\n"
    },
    {
      "time": "19 Jan 2009 — 3:09pm",
      "content": "Honestly I would have to see it on MyFonts to see how an intense color looks best. It seems like a cooler color will probably pop best against the red/orange hues that dominate the myFonts icons, but then again a yellowish green could do well, too. Try loading a screenshot of MyFonts into Photoshop and doing ten different versions each in a few different positions to see what works well consistently.\n\n"
    }
  ]
}
