{
  "id": "5355",
  "title": "Time to Design Ligatures?!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am working on a logo mark. It seems appropriate that I may want to design my own ligatures for the company name. The company name is 9 letters long.   \n   \nMy question is: On average how long does it take to design 9 ligatures?   \n   \nI don't have the time frame to spend too much time doing this, but I feel this undetaking could prove   \nto be a great result.   \n   \nAny suggestions would be appreciated.\n\n",
  "author": "franklin_new",
  "time": "24 Jun 2004 — 4:10pm",
  "uid": "3164",
  "comments": [
    {
      "time": "24 Jun 2004 — 6:45pm",
      "content": "Wait a minute, either my Math is off our yours: Nine letters do not work out as nine separate ligatures, more like four and a half. ;)   \n   \nIdeally you should probably strive to end up with a lot less ligatures than that, that is unless you don't need the mark to be legible at all. Ligatures are neither always appropriate nor possible, as certain letter combinations resist attempts at (\\*ahem\\*) ligaturization in a most stubborn manner. Maybe you could single out one or two interesting letter combinations in your mark and see how you go.   \n   \nAnyway, if you really do feel your idea could end up producing a great result, then don't waste time: get to it ![:-)](http://web.archive.org/web/20131018085607im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 Jun 2004 — 10:35pm",
      "content": "oh man...I am afraid I made a confusing statement.   \nWhat I meant to say: I was thinking of creating   \n9 new LETTERS (which consists of the company name)   \n   \nSo to clarify: create 9 letters from original   \ninspiration. Too ambitious? Too much time? Or   \njust plasible?\n\n"
    },
    {
      "time": "24 Jun 2004 — 10:36pm",
      "content": "double post. ignore\n\n"
    },
    {
      "time": "25 Jun 2004 — 6:37am",
      "content": "Sure its possible. Many typefaces start out as word shape sketches. When you are designing a logo, you have much more freedom than in a typeface. For instance, in the word Typophile, the letter T will only be followed by the letter y, o by p, and so on. In a typeface, the letter T must be able to be followed by 255 other characters.   \n   \nOf course, what style you want to use, plus what materials you will be using (and your skill with them) will determine the time needed.   \n   \nWhat is the company name?\n\n"
    }
  ]
}
