{
  "id": "53586",
  "title": "New Pepsi Logo: What Grade Do You Give It?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/pepsi_5268_4921.jpg)\n\nI was in the supermarket last week and had the chance to take a photo of the new PEPSI logo side-by-side with the old version (see attachment).\n\nDo you feel it's a successful redesign? If you had to grade it, would would you give it?\n\nI've read reviews of this new logo on other websites and to my surprise I found that many people didn't like the change. For those who are wondering, the PEPSI circle is supposed to be a smirk (or smile face). There are two other PEPSI products that have similar circles, meant to express a smile, to a varying degree.\n\nIn my opinion, I love the new sans-serif geometric typeface in all lower case. I think it's forward-thinking. Does anyone know what font that is? The salient feature is that lowercase \"e.\"\n\nMy score: A\n\n| Attachment | Size |\n| --- | --- |\n| [Pepsi logo.jpg](http://web.archive.org/web/20150330010424/http:/typophile.com/files/Pepsi%20logo.jpg) | 374.36 KB |\n\n",
  "author": "Glenn Kramer",
  "time": "16 Jan 2009 — 3:26pm",
  "uid": "41071",
  "comments": [
    {
      "time": "16 Jan 2009 — 4:00pm",
      "content": "I like that they've finally moved away from the gradients that plauged us for such a long time in \"new logos\". I swear half the companies of the past ten years when they made a new logo all it was was the old one but with some gradient or 3D effect. This is a nice evolution of the logo, and the font goes well with it.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "16 Jan 2009 — 4:08pm",
      "content": "Holy manoly, they are both so bad. a little wave going through the e? Please stop the nonsense, please. they have also destroyed the red-blue circle.  \nHUGA!\n\n"
    },
    {
      "time": "16 Jan 2009 — 4:37pm",
      "content": "Is it just me, or does the lowercase \"e\" look like it's belching?\n\nHow appropriate.\n\n"
    },
    {
      "time": "16 Jan 2009 — 5:02pm",
      "content": "The old Pepsi logo has been the only link with the west for some of us Eastern block kids, so it carries a certain sentimental value. Now, I guess I can finally switch to Coke.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20150330010424/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "16 Jan 2009 — 5:05pm",
      "content": "I'm sure the designer chose that font because the wave in the little \"e\" is reminiscent of the wave in the PEPSI circle. I think the logo relates perfectly with the typeface. It was a great choice in my opinion.\n\n"
    },
    {
      "time": "16 Jan 2009 — 5:17pm",
      "content": "Scott, I also thought the \"e\" is belching.\n\nI think the new packaging looks like it was made for either one of these:  \n(a) slim cigarettes aimed at an aging but style-conscious female audience.  \n(b) female hygiene products.\n\n"
    },
    {
      "time": "16 Jan 2009 — 5:36pm",
      "content": "I think it sucks.\n\n"
    },
    {
      "time": "16 Jan 2009 — 6:45pm",
      "content": "If that's supposed to be a smiley face, where are the eyes?\n\nAs the old saying goes, \"If it ain't broke, don't fix it.\"\n\n"
    },
    {
      "time": "16 Jan 2009 — 8:34pm",
      "content": "As mentioned earlier, I'm happy it doesn't have yet another gradient.\n\nFor a grade: D-\n\nI feel like it was a bold attempt, but was poorly executed. It seems to be throwing away a lot of the brand's historical connection. The Mountain Dew and Sierra Mist revamps are also bad, but slightly better than the various Pepsi labels.\n\n"
    },
    {
      "time": "16 Jan 2009 — 9:33pm",
      "content": "_I love the new sans-serif geometric typeface in all lower case. I think it’s forward-thinking._\n\nIt was when Herbert Bayer did it in 1925.\n\n"
    },
    {
      "time": "16 Jan 2009 — 9:40pm",
      "content": "It was VERY forward thinking in the 1920s...Arts & Crafts movement was in high gear.\n\n"
    },
    {
      "time": "16 Jan 2009 — 11:33pm",
      "content": "Hmm, six years. [I think I see exactly what they're working up to.](http://web.archive.org/web/20150330010424/http:/bttf.wikia.com/wiki/Image:Pepsilogos.jpg)\n\n"
    },
    {
      "time": "16 Jan 2009 — 11:41pm",
      "content": "Even with the odd zero and the bulge, it's newer and, therefore, better.\n\n"
    },
    {
      "time": "17 Jan 2009 — 12:25am",
      "content": "I wish the circle had been left as it was, now it looks like some airline logo. The overall change is not bad, pretty nice and clean. The e would work better with the old circle.\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/pepsi_5268.jpg)\n\n"
    },
    {
      "time": "17 Jan 2009 — 12:30am",
      "content": "Hi Mili, thank you for posting that great image of the various Pepsi can designs. It shows the subtle differences in the logo.\n\n"
    },
    {
      "time": "17 Jan 2009 — 1:06am",
      "content": "A belch, a smirk and an odd wavy feeling...sounds like a very successful logo for a ridiculous drink like Pepsi.\n\n"
    },
    {
      "time": "17 Jan 2009 — 5:05am",
      "content": "Looks a bit like the old Diet Pepsi logo. Pepsi and lame design have always gone hand in hand except around 1990 when they had the \"UH HUH!\" and the stripe theme cans going on. Obviously, the swoosh mimics the Coke swoosh. Pepsi has never had a good logo/can design. From the old wanna-be Coke style logo, to the 1960-1980s motor oil look to the 1990s techno . . . motor oil look.\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/diet-pepsi_4625.jpg)\n\n"
    },
    {
      "time": "17 Jan 2009 — 7:33am",
      "content": "I like the new version of pepsi\n\nmostly the font and the clean design\n\nthe logo seems... a little bit weird\n\ni think it needs to be rotated some how\n\n"
    },
    {
      "time": "17 Jan 2009 — 7:57am",
      "content": "Typodermic: how did you place the image directly into the thread, rather than a link? Do you just copy and paste into the text? That was a good find, by the way. I remember those old cans.\n\n"
    },
    {
      "time": "17 Jan 2009 — 10:06am",
      "content": "Does the new logo remind anyone else of a lot of logos that disappeared between 1985 and 1995?\n\nI can understand the desire to simplify the very over-the-top packaging and ad campaigns. But rather than produce a contemporary design informed by modernism the designers just went with more blatant anachronism.\n\n"
    },
    {
      "time": "17 Jan 2009 — 11:03am",
      "content": "_...how did you place the image directly into the thread, rather than a link? Do you just copy and paste into the text?_\n\nHey, Glenn. Just beneath the comment box where you insert text, there is a link that reads \"Insert image\". If you can't see it, you may need to upgrade to a newer version of the Flash Player.\n\nYou'll find more info on posting images [here](http://web.archive.org/web/20150330010424/http:/www.typophile.com/node/18067).\n\n"
    },
    {
      "time": "17 Jan 2009 — 11:45am",
      "content": "At first I thought 'oh god, this is lame' but then I thought hey, they got rid of the gradient, and got rid of some outline/shadow type BS.. I think It's a clear improvement from the last one..\n\ngrade: solid B.\n\n- Scott Sullivan\n\n"
    },
    {
      "time": "17 Jan 2009 — 12:53pm",
      "content": "Ah, I really like it now that I see how it was designed to change a bit depending on the exact type. Still a tad bland, but any logo for worldwide companies these days almost has to be, iconic but bland.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "17 Jan 2009 — 5:32pm",
      "content": "I don't think getting rid of the gradients automatically makes the new identity an improvement.\n\nPersonally, I think pretty much everything of the new logo(s) is poorly executed. The smile concept of the logo doesn't really work; it hardly resembles a smile. The only nice element I can see in these is that the logo changes for the different types of cola.\n\nThen the typography... it just looks slightly off. It tries too hard to fit with the logo. But the waving crossbar of the 'e' is over the top. It's just one element too many in my opinion. The letters themselves also became strangely geometrical because they tried to fit it to the logo.\n\nUnderconsideration's ['Best & Worst of 2008'](http://web.archive.org/web/20150330010424/http:/www.underconsideration.com/brandnew/archives/brand_new_best_worst_2008.php) placed it on no. 1 of the Worst section, rightfully so in my opinion. More posts about Pepsi on Underconsideration [here](http://web.archive.org/web/20150330010424/http:/www.underconsideration.com/brandnew/archives/the_new_pepsi_challenge_guess.php) and [here](http://web.archive.org/web/20150330010424/http:/www.underconsideration.com/brandnew/archives/pepsi_revealed_sort_of.php).\n\nIt seems they are trying to follow [Coca Cola](http://web.archive.org/web/20150330010424/http:/www.underconsideration.com/brandnew/archives/the_real_thing.php) again by going back to a more classic, retro look. Where Coca Cola succeeds, Pepsi fails.\n\n"
    },
    {
      "time": "18 Jan 2009 — 1:14am",
      "content": "Well, I also dislike the new graphic mark. It looks like a monster's evil smirk. But the new wordmark is nice with futuristic tinge while the old one reveals a whiff of old industrialness (It's better appropriate for a heavy machine manufacturer,say, like Caterpillar. )  \nGrade: B\n\n"
    },
    {
      "time": "18 Jan 2009 — 2:14am",
      "content": "Coca-Cola rules.\n\n"
    },
    {
      "time": "18 Jan 2009 — 9:02am",
      "content": "I'm amazed that no one has mentioned the obvious influence of the Obama logo yet, not to mention the timing of the release of the new Pepsi logo. It's discussed a bit in [this thread](http://web.archive.org/web/20150330010424/http:/typophile.com/node/53082?page=1), but I think the overall impression the two give from a distance shows a great deal of similarity.\n\n[http://typographyshop.com](http://web.archive.org/web/20150330010424/http:/typographyshop.com/ \"http://typographyshop.com\")  \n [http://kinggroupmedia.com](http://web.archive.org/web/20150330010424/http:/kinggroupmedia.com/ \"http://kinggroupmedia.com\")\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/ObamaLogo_4727.jpg)\n\n"
    },
    {
      "time": "18 Jan 2009 — 9:10am",
      "content": "<cite>I wish the circle had been left as it was, now it looks like some airline logo.</cite>\n\nBut it's arguably a move away from this:\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/ka_6216.jpg)\n\n"
    },
    {
      "time": "18 Jan 2009 — 9:33am",
      "content": "look, gradients being gone DOES make the design better, and a huge multinational corporation is not going to completely ditch all of the money they've invested in their brand. Pepsi made a genuine effort to improve their design, and THEY DID IMPROVE THEIR DESIGN.\n\n- Scott Sullivan\n\n"
    },
    {
      "time": "18 Jan 2009 — 12:23pm",
      "content": "\\> _look, gradients being gone DOES make the design better_\n\n\"Oh, it does not have gradients! It must be a great design now!\"\n\n"
    },
    {
      "time": "18 Jan 2009 — 1:10pm",
      "content": "<cite>I’m amazed that no one has mentioned the obvious influence of the Obama logo yet…</cite>\n\nWe had that thread the week before last.\n\n"
    },
    {
      "time": "18 Jan 2009 — 6:46pm",
      "content": "I think it's bland and boring,  \nIt looks like a de-energised energy drink.  \nTheres simplistic sophistication, and there is oversimplification.\n\n"
    },
    {
      "time": "18 Jan 2009 — 7:10pm",
      "content": "The e in DIET is a bit much (I like it on the product). I don't like the bottom curve of the swoosh on any of the \"weights\". Not so bad…\n\nGrade: B-\n\npbc\n\nAll ideas, theories and statements are subject to change without notice.\n\n"
    },
    {
      "time": "19 Jan 2009 — 6:27am",
      "content": "The icon is a failure. I don't see a smirk. It is a real mistake to completely discard the equity in that graphic. They type and color looks like it would be right at home in a 70's era nightclub. I'm glad that product packaging is moving back towards a simpler, cleaner approach, but this is not appealing to me. But, if you love Pepsi, it won't make a difference I guess.\n\n"
    },
    {
      "time": "19 Jan 2009 — 7:57am",
      "content": "Coca-Cola wins in all its variations.\n\nMarS\n\n"
    },
    {
      "time": "19 Jan 2009 — 9:28am",
      "content": "Absolutely, Drink Coke. Stop Pepsi before they can do another yawning redesign.\n\nCheers!\n\n"
    },
    {
      "time": "19 Jan 2009 — 10:13am",
      "content": "I actually think this is a reasonably successful redesign. It doesn't really appeal to me personally, because I'm not a big fan of the Bayer Bauhaus extreme roundedness, but I think it \"works\" in principle. Sure, it's retro, but for a classic brand that's over 100 years old, that's okay.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "19 Jan 2009 — 11:16am",
      "content": "Not a huge fan of the mark. (The \"angry eyeball\" as my wife calls it.) I don't mind the typography as much, although I think the \"e\" is trying too hard. Can't a company just rely on good type and not try so hard to mash it into the mold of their brand? I'd probably give it a C+; maybe a B- if they could give a good explanation for the mark.\n\n"
    },
    {
      "time": "19 Jan 2009 — 12:14pm",
      "content": "I hate the new logotypes and logo and packaging. It is cheap looking. Blech.\n\n"
    },
    {
      "time": "19 Jan 2009 — 3:08pm",
      "content": "I appreciate the great comments so far. However, some people are not saying why they don't like it, just that \"they don't.\"\n\nWhen you see both designs next to each other, it is easier to compare the two.\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/Pepsi-logo_6461.jpg)\n\n"
    },
    {
      "time": "19 Jan 2009 — 3:57pm",
      "content": "It's like the wave is migrating from the symbol to the wordmark.\n\n\\*\\*\n\nPepsi Classic:\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/pepsi_5628.png)\n\n"
    },
    {
      "time": "19 Jan 2009 — 7:23pm",
      "content": "The new design couldn't be much more different from the old. The logotype went from ultrabold-italic-Americana to a friendly-belch type of elegance. It's not there yet, IMHO; the \"e\" in Pepsi is to cute and the shape of the white wave in the logomark feels unresolved. I, too, think of some kind of (carbonated) hygiene.\n\n"
    },
    {
      "time": "20 Jan 2009 — 2:36am",
      "content": "After seeing [this interpretation](http://web.archive.org/web/20150330010424/http:/onethatknows.com/?p=106) I have a hard time taking it seriously. It's even more fitting when you se that the \"crack\" is bigger for the sugar-version. The e is just horrible.\n\n"
    },
    {
      "time": "20 Jan 2009 — 3:00am",
      "content": "After seeing the two logos together, I do prefer the newer one. But the image is wrong, I think the proportions of the 'smile' are all wrong. It nearly works for the Max logo, as the white is a bit more like a smile. I do like the new typeface though.\n\nGrade: C\n\n"
    },
    {
      "time": "20 Jan 2009 — 4:40am",
      "content": "True genius in my opinion. They should have stuck to this.\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/steel_pepsi_can_6207.jpg)\n\nI love type!\n\n"
    },
    {
      "time": "20 Jan 2009 — 9:01am",
      "content": "The \"smile\" of the logo has been a similar shaped wave up until this logo. Sure the logo is clean and updated look but I'm just wondering if the drastic shift in brand identity is a sign of desperation on the part of Pepsi. If you had looked at the new red/blue mark alone without the word \"pepsi\" would you know that it was Pepsi's logo? Brand recognition plays a big part in how I see this design change as not poorly designed but inappropriate at best.\n\n"
    },
    {
      "time": "20 Jan 2009 — 9:24am",
      "content": "Apparently they have a full page ad in today's NYT - with an Obama message, not seen it - but apparently all the O's and 0's are Pepsi logos.\n\n"
    },
    {
      "time": "20 Jan 2009 — 9:25am",
      "content": "It's (primarily) a packaging identity.  \nYou shouldn't judge an identity by its logo.\n\n"
    },
    {
      "time": "20 Jan 2009 — 10:51am",
      "content": "You're right. Their internal brand standards probably stayed constant, but the packaging identity is what is in question here. It is what people recognize (or don't) when they are scanning the aisles at the grocery.\n\nMy question is, why have there been so many iterations of Pepsi's [packaging] identity including the logo? Plenty of design elements on the packaging can be changed without warping the logo. The logo, by the way, is the visual representation of a corporation and the building block of any strong identity. The changes in Pepsi's logo says to me that they are desperately trying break into some new demographic, struggling to compete, or trying find an identity that works.\n\nThis hasn't changed much in over 100 years:\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/coca-cola_logo_3728.jpg)\n\n"
    },
    {
      "time": "20 Jan 2009 — 3:12pm",
      "content": "I have this vintage pepsi sign on my wall. It's about 47 cm in diameter (18.5 inches), and I think it is awesome. ;)\n\n ![](http://web.archive.org/web/20150330010424im_/http:/typophile.com/files/pepsisign_5276.jpg)\n\n"
    }
  ]
}
