{
  "id": "5362",
  "title": "Cap- and baseline extensions.",
  "forum": "Design",
  "tags": [

  ],
  "content": "When designing round uppercase characters such as \"O\" and \"C\" and \"Q\", should the extensions beyond the base- and caplines be proportionate to the average width of all characters in the set? I'm working on an especially skinny \"O\" (the width of which will apply to all characters more or less uniformly throughout the entire font) and I'm not sure if base-30 and cap+30 is too much. Any ideas?\n\n",
  "author": "A. Scott Britton",
  "time": "Fri, 2004-06-25 12:05",
  "uid": "3373",
  "comments": [
    {
      "time": " Fri, 2004-06-25 12:24",
      "content": "I don't know if you can say such and such is a good number for overshoot. But 30 seems a bit much for a 1000 unit per em setup, how big is your em square?   \n   \nGenerally I think the intended point size has more bearing on the overshoot than the width of alphabet. The smaller the intended point size (or longer the viewing distance) the greater the overshoot (I think).   \n   \nLet us see :-)\n\n"
    },
    {
      "time": " Fri, 2004-06-25 12:56",
      "content": "Oh sorry I forgot to mention my UPM--I'm actually going 2048.   \n   \nYeah I think you're right, 30 probably is a bit much. Ultimately, I think somewhere between 20 and 25 is going to work best for this face. I was just curious if some kind of \"proportional standard\" existed that I wasn't aware of.   \n   \nThanks for your input Randy.\n\n"
    },
    {
      "time": " Fri, 2004-06-25 13:56",
      "content": "Here's an interesting historical tidbit on this matter.   \n   \nIn a footnote in his translation of Fournier's _Manuel Typographique_, Harry Carter (Matthew's father, for those who didn't know) points out this rule of thumb:   \n   \n\"To satisfy the eye a 6-pt. o has to be about one-eighth taller than the x, a 12-pt. one-twelfth, a 36-pt. one-fifteenth, and a 72-pt. one-eighteenth. The amount of difference required varies with the degree of extension of the type and shape of the shading.\" [_Fournier on Typefounding_, pg. 148, Darmstadt 1995 facsimile edition]   \n   \nBy these last two, I think HC may be talking about relative width (extended v. condensed) and the type & degree of contrast (oldstyle v. modern, etc.). But, unfortunately he does not elaborate.   \n   \nSo, Randy is right, the smaller the intended size, the more overshoot; the larger the size, the less overshoot. If you survey a number of typefaces, I think you'll find a reasonable average on a 1000 em square is in the range of 12-18 units.   \n   \nIt is also my experience (albeit limited in this area) that a condensed type may tolerate a little less overshoot than an equivalent regular width. Presumably the reason for this is that as you condense a round character, it tends to become more oblong (even approaching squarish) and with proportionately more of the curve coinciding with the baseline or x-height, the optical disparity is reduced somewhat.   \n   \n-- K.\n\n"
    },
    {
      "time": " Sat, 2004-06-26 10:41",
      "content": "Good point Kent.   \n   \nMuch also depends on whether the face is a sans or serifed.   \n   \nAnd the weight of the stems.   \n   \nIf you have a very light sans, UNDERshoot of O etc. would, in theory, be called for!   \n   \nStandard ratios and rules of thumb are not much use if one departs from the limited class of type that Fournier presupposes, although his general principal is sound. Use the Force. I mean, the best method is to try some variations, print them out, and see which \"satisfies the eye\".\n\n"
    },
    {
      "time": " Fri, 2004-07-16 22:41",
      "content": "\\> should the extensions beyond the base- and   \n\\> caplines be proportionate to the average   \n\\> width of all characters in the set?   \n   \nIn the same way that triangular shapes need to overshoot more than round ones, I would guess yes. But maybe Kent is right.   \n   \nBTW, in general, for a text face, 30 units in an Em of ~2000 actually isn't too much.   \n   \n\\> Harry Carter (Matthew's father, for those who   \n\\> didn't know) points out this rule of thumb:   \n\\> ....   \n   \nI remember how I once made this observation myself, pretty much out of instinct, at which point a Famous Type Designer said I was full of crap. Then over a year later I encountered this statement of Carter, and brought it to the FTD's attention. Heh heh heh.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-07-18 04:14",
      "content": "It is sometimes hard to keep straight that **Harry** Carter was Matthew's father, but **Sebastian** Carter (author of _Twentieth Century Type Designers_) is of no relation.   \n   \n-- K.\n\n"
    },
    {
      "time": " Sun, 2004-07-18 09:55",
      "content": "Then there's Will Carter (who passed away recently), maker of fine books, author of Klang, and co-author of Octavian, one of my most favorite fonts.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-07-18 10:19",
      "content": "_Then there's Will Carter (who passed away recently), maker of fine books, author of Klang, and co-author of Octavian..._   \n   \n...father of Sebastian Carter.\n\n"
    }
  ]
}
