{
  "id": "53635",
  "title": "The font ERETSHAZVI with Nikud & Teamim",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": "Here is a hebrew font I am working on these days.  \nthe font was developed as OT using MS-VOLT  \nthe font know to place the nikud+taam as one under the letter, which means that the nikud is brought back acourding to the width of the spesific taam so both the Nikus & Taam are placed optimaly under the letter.\n\nthere are still acouple of 'Dibukim' I yet to check but they are being worked on\n\nhere is a sample file of Megilat Ester With Nikud And Taamey Mikra.\n\nWould to here your proffessional opinion.\n\nEli Fried\n\n| Attachment | Size |\n| --- | --- |\n| [Ester.pdf](http://web.archive.org/web/20150414033618/http:/typophile.com/files/Ester.pdf) | 113.85 KB |\n\n",
  "author": "Typograph",
  "time": "18 Jan 2009 — 7:46am",
  "uid": "31385",
  "comments": [
    {
      "time": "18 Jan 2009 — 8:27am",
      "content": "The main issue is the spacing -- too tight;\n\n"
    },
    {
      "time": "18 Jan 2009 — 8:45am",
      "content": "leading can be Tight or Loose that is not the issue, in hebrew traditional books letters tend to be very tight and do not comply with ordinary hebrew typography. looking at Sidurim Or Chumashim will indicate the same.\n\nthe sample was uploaded to get critics on the Teamim placements and technique.\n\nEli Fried\n\n"
    },
    {
      "time": "19 Jan 2009 — 12:58pm",
      "content": "\\> the sample was uploaded to get critics on the Teamim placements and technique.\n\nWelcome to typophile.\n\n\\> leading can be Tight or Loose that is not the issue\n\nWho's talking about leading? Spacing, kerning, glyph metrics - right & left sidebearings -- that's the issue;\n\n ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/Hebrew2_4863.gif)\n\n"
    },
    {
      "time": "26 Jan 2009 — 5:20pm",
      "content": "The positioning of the nikkud and taam, and the combination of nikkud and taam, should fine-tuned.\n\nThere are rules on positioning single diacritics which the sample doesn't adhere.\n\nIt's not very bad. The average eye would admit that it's ok.\n\nHowever, it's not exact. You see this clear in many examples of double diacritics.\n\nIn MS Volt, this is no big deal to correct, if the projects was created correctly.\n\nIf the type designer knows MS Volt well, and is not just a type technician, but a very precise designer, this all can be corrected in a relatively short time.\n\n"
    },
    {
      "time": "1 Feb 2009 — 4:14pm",
      "content": "gohebrew: i would love to learn more about this rules.\n\nif you have any experience i would be more than happy to learn a thing or two from you.\n\n"
    },
    {
      "time": "1 Feb 2009 — 6:28pm",
      "content": "As Raphael Freeman explained based upon Mr. Eliyahu Koren's approach to correct Biblical Hebrew typography, itself rooted in ancient Hebrew manuscripts, multiple Hebrew diacritics are not centered under vertical aspects of Hebrew letters.\n\nRather, the nikkud is centered, and the meteg or taam on the nikkud's left is positioned off-centered.\n\nUsually, the combination of nikkud with meteg and/or taam, is treated as one unit. Then, the whole unit is centered.\n\nThis is incorrect.\n\nUnder a reish, for example, this incorrect approach often will lead to \"bumping\", where the nikkud/tam/meteg combination under the previous letter will \"bump\" into the combo under the reish.\n\nThis is a basic rule. There are many exceptions, as we will explain. I will post visual samples to demonstrate them.\n\n"
    },
    {
      "time": "1 Feb 2009 — 11:59pm",
      "content": "Hi GoHebrew:  \n Their are two approaches to this issue.\n\n1. Visualy  \n2. Functionly\n\nLet me explain.\n\nVisualy, Having the Nikud+Taam As one unit is better, in the exeption Of Dalet,Vav,Yod,Resh where indeed the taam comes of centered to the nikud.\n\nBut, Function wise, we devide Letter, Nikud, Taam.  \nWhere the letter is the most important  \nnext In Line comes the Nikud, and at last TAAMIM.  \nThetefor  \nNikud sould be lighter than letter, and taam lighter than nikud, approaching this arrgument' you are correct, taam comes of centered the nikud.\n\nso, My fonts support the two methods  \nnormaly, in MARK proceedure, the Taam comes of centerd the Nikud.  \nBut activating a style allows moving back the Nikud accourding to width of taam, and relink taam to nikud wich was demonstrated in the example that i uploeded.\n\nhowever, I would love to hear what you have to say about this issue.\n\n"
    },
    {
      "time": "2 Feb 2009 — 7:07am",
      "content": "Typograph,\n\nYou raised many valid points and interesting ideas.\n\nAs a graphic artist, I lean strongly to the visual. I prefer to let the funtional be secondary, particularly in light of the fact that the reader rests his or her eyes upon the small configuration of letter+nikkud(+taam+meteg). If functional appearance would take precedence, then to that reader's eye, the configuration would look odd.\n\nI don't see how it is possible to easily support two different positioning systems with MS Volt. To my limited knowledge OpenType and InDesign ME support only one positioning system.\n\nChanging the weight in the font between the letter, which is darker, the nikkud which is lighter that the letter, and the taam, which is lighter than both the letter and the taam, is a very good technigue - as the visual approach can be maintained. In fact, the actual design of the letters, nikkud, and taam, seem to aim at this approach.\n\nRaphael Freeman told me that Mr. Eliyahu Koren also employed a heirichal system, where the nikkud was positioned closer to the letters, and the taam were lower, farther from the letters. Personally, I do not subscribe to this approach. I have noticed Hebrew publishers intentionally position the meteg lower than the nikkud; this is logical, as the roleof the meteg is special, different than the sounds associated with the nikkud.\n\nThe tav has an interesting form, in which the center zone is smaller and more to the right, that the entire width of letter. Hence, visual centering is really off-center. Similarly, the tzaddi's horizontal base is further to the left in many designs, making its visul center really off-center.\n\n"
    },
    {
      "time": "2 Feb 2009 — 11:53am",
      "content": "GoHebrew:  \nHi, From earlier threads in the forum i see you have great interest in hebrew typography, biblical diacritics issues and opentype development.\n\nfirst let me introduce my self.  \nmy name is Eli Fried.  \nLives in Israel.  \nHebrew type designer.  \n(designed over 100 typefaces where over 50 faces are sold through MasterFont).\n\nover the years i have studied and learned hebrew typography to depth and discovered much wich i am going to make an attempt to share with you.\n\nas an israeli, my point of view of hebrew typography might differ from Raphael Freeman's point of view.\n\nnow, lets divide this post into 2 parts  \n1. Nikud and Teamim: the way they were applied troughout the years.  \n2. tech issues regarding volt and opentype.\n\n1] biblical literature had meny approaches as technology had developed. so lets examine some of them.\n\nthe first Chumashim, Tikuney Koreem were manualy set.  \nthere were no underlaying rules, every word got its own treatment for nikud and taam as they went along. but mainly they placed the taam ofcentered.\n\nlater, computer programs were developed.  \na well known dedicated program for Holi literature is called TAG By Daniel Weissman.\n\nTags font used Guttman And Palron fonts.  \nthe way TAG preferes to deal with Teamim is by bringing the Nikud Back and placing both Nikud & Taam As one unit.  \nTaam does not come of centered of the nikud as in the  \nmanual settings.\n\nthis is the way daniel weissman programs his kern tables.  \nusers if tag might kern the table differently.\n\nGuttman's Teamim are not lighter than the Nikud, thay are both same weight.  \nin this approach taam and nikud act as one in are only hints and nothing main. so we do not approach the taam with less importance than the nikud.\n\nnext to open type fonts were developed.  \n1. Sil Ezra  \n2. Guttman Vilna by yoel ganzburg\n\nboth tried bringing back nikud when there is a taam.  \nboth used Mark and/or MarktoMark Positioning but could not utilize the pair abjusments because indesign CS did not Support this fuction in right to left.\n\ntrying to do so, indesign would shift the nikud forwards rather than backwards this bug was only fixed in CS2  \n(Office 2003 allready did support this)\n\ninstead, both projects use 3 minus spaces glyphs in order to shift back the nikud. this resulted unaccurat positioning because glyphs were treated as THIN SPACE, MIDSPACE and WIDE SPACE.\n\ntoday, hebrew fonts can use Pair abjusments in order to move back the nikud rather than minus spaces, this results much more accurate positioning.\n\nNow, in my fonts Normal does not include The Pair abjusment feature. with a Stylistic Set you may use a pair abjustment and then replacing taam to nikud.\n\nthis featur must come after feature.\n\nTRY IT OUT.\n\n"
    },
    {
      "time": "2 Feb 2009 — 12:11pm",
      "content": "Israel,\n\n\\> If the type designer knows MS Volt well, and is not just a type technician, but a very precise designer\n\nare you building an F-15 Eagle aircraft ? :^)\n\n"
    },
    {
      "time": "2 Feb 2009 — 2:29pm",
      "content": "...vroooom..\n\n"
    },
    {
      "time": "12 Feb 2009 — 7:41am",
      "content": "Typograph,\n\nSorry for the delay - just been building an F-15.\n\nEli, where is Israel are you? I lived in the eighties in Kfar Chabad. Did font work for Georgian (Gruzini) newspaper, when it went digital to Apple Macintosh.\n\nWeisman/Guttmam and Tzika/Masterfont were just starting. Does Tzvika still have his bicycle? (I personally think his work is very poor.) Tag came later. I don't think it ever worked on XP and Vista.\n\nMy font development work is based on InDesign ME CS/x, any MS Windows or Apple Macintosh System X (3 and higher). That's why I have an interest in sophisticated OpenType, which is needed for correct Biblical Diacritic Placement, and other fascinating things, like (automatic) shva-na, komatz katan, and meteg placement.\n\nHow, as an Israeli, do you that your practice of typography differs significantly from Raphael Freeman? He appears very talented, and his typographical principles are based upon Eliyahu Koren a\"h, who in turn was based upon drawings of very old typography.\n\n"
    },
    {
      "time": "12 Feb 2009 — 7:56am",
      "content": "Eli,\n\n\\> 1] biblical literature had meny approaches as technology had developed. so lets examine some of them.\n\nthe first Chumashim, Tikuney Koreem were manualy set.  \nthere were no underlaying rules, every word got its own treatment for nikud and taam as they went along. but mainly they placed the taam ofcentered.\n\n----------------------------------------------\n\n\\> Many approaches  \nAccording to Raphael, multiple appraches existed because of the limitations of the equipment. This was confirmed to me by Scott Kesofsky of Philidor Company, see [www.philidor.com](http://web.archive.org/web/20150414033618/http:/www.philidor.com/ \"www.philidor.com\"), an excellent master typographer who worked as a youth using previous generation typesetting equipment.\n\n\\> there were no underlaying rules  \nI disagree. Perhaps, you do not see any patterns in manually set typography. I think that they are there. Rather, one may determine that there is no pattern, because of the repeated inconcistancies or exceptions. Either this was due to the limitations of the equipment, or the \"creativeness\" of the typesetter.\n\nMany non-religious and even some semi-religious find it difficult to be disciplined and express their creativity in different ways.\n\nI am not being condescending or self-righteous at all. I am just calling a spade a spade, as they say.\n\nWait a second, Eli. Let me get off my high horse, and hide behind thee barrel to dodge the rotten tomatoes.\n\n"
    },
    {
      "time": "12 Feb 2009 — 8:02am",
      "content": "Eli,\n\n\\> later, computer programs were developed.  \na well known dedicated program for Holi literature is called TAG By Daniel Weissman.\n\nTags font used Guttman And Palron fonts.  \nthe way TAG preferes to deal with Teamim is by bringing the Nikud Back and placing both Nikud & Taam As one unit.  \nTaam does not come of centered of the nikud as in the  \nmanual settings.\n\n-------------------------------------------------------\\\n\nTag is Weisman, they use fonts from Guttman? So, Guttan are just fonts, used by Tag. Are they two separate companies, with two separate people?\n\n"
    },
    {
      "time": "12 Feb 2009 — 8:42am",
      "content": "\\> later, computer programs were developed.\n\nWell, first there was Quark XPress, using the English or demestic operating system of either MS Windows or Apple Macintosh. It was the early or mid ninties.\n\nThis was the \"backwards\" font solution.\n\nSince Quark could \"flip the text box\", take left-to-right text, and flip it over, the text appeared from right-to-left. Furthermore, text entered in such a flipped text box, could be entered and edited from right-to-left.\n\nI was working at FontWorld, see [www.fontworld.com](http://web.archive.org/web/20150414033618/http:/www.fontworld.com/ \"www.fontworld.com\"), then. I and a few of our customers, used it for a while, before other competitors offerred less expensive solutions.\n\nIt was a simple solution for Hebrew typesetting in a Western computing enviroment.\n\n"
    },
    {
      "time": "12 Feb 2009 — 1:11pm",
      "content": "In those days, the only Hebrew typesetting program was on the Apple Macintosh, called \"Ready Set Go for Hebrew\". It was made for Arabic by the London based Diwan, see [www.diwan.com](http://web.archive.org/web/20150414033618/http:/www.diwan.com/ \"www.diwan.com\"), through the wizardry of Adir Allawi, the brilliant son of Diwan's owner.\n\nThere also was the Israeli Rav Ktav, but it had a very poor feature set. There was nothing on MS Windows.\n\n\\> Tag used... Palron fonts  \nIs this Meir Palron? He must be a very old man today.\n\nMeir represented Varityper then, a line of dedicated Hebrew typesetting mini-computers. I had a Sinclair QL personal computer, around the time the IBM PC was becoming popular in Israel. I edited a book of Rambam (Maimonides) on it. I convinced my customer that instead of retyping all the data, I would \"dump\" it to the Varityper. The customer called Meir for some technical help. In those days, a cusstomer simply called a vender, \"Hey, Meir, come over, I need some help.\" I think Meir wanted to see if my $400 personal computer could really do what the mini he sold for $8,000 could also do.\n\nMeir looked on in disbelief when after a few glitchs, it succeeded in 10 minutes.\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:07am",
      "content": "\\> a well known dedicated program for Holi literature is called TAG By Daniel Weissman.\n\nA few years ago, most holy books were created in Tag. This was mainly because Tag infiltrated in Jewish world.\n\nTag is code-based and not WSIWYG. It handled fonts in a non-standard way. Tag was rejected by most book producers.\n\nToday, Adobe InDesign CSx ME is the accepted standard. It is becoming more and more powerful, particularly with well-made OpenType fonts.\n\nI am creating well-made OpenType fonts for classic Hebrew typography, such as Biblical Hebrew, Hebrew Poetry, and Hebrew Primers. Each year, my Hebrew OpenType fonts are becoming more sophisticated.\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:11am",
      "content": "\\> the way TAG preferes to deal with Teamim is by bringing the Nikud Back and placing both Nikud & Taam As one unit.  \nTaam does not come of centered of the nikud as in the  \nmanual settings.\n\nPlease explain. What do you mean \"bringing the Nikud Back\" and \"both Nikud & Taam As one unit\" and \"Taam does not come of centered of the nikud as in the manual settings\".\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:12am",
      "content": "\\> Guttman Vilna by yoel ganzburg\n\nWho is he?\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:25am",
      "content": "\\> Guttman’s Teamim are not lighter than the Nikud, thay are both same weight.\n\nIn the famous Romm family typefaces of Vilna, Lithuania, popularly known as Vilna, the taam symbols were created lighter than the nikkud, unlike most other Hebrew fonts.\n\nDid Yoel Ginsburg do this like the original? My guess is not.\n\nIf we look at all the incarnations of Vilna, this feature is dumped, like even many of the letterform designs.\n\nFrederick Goudy reports in his little book that the father Romm traveled to Italy with old drawings of the correct Vilna typefaces, and his original metal type masters were created based upon these drawings by the students of the famous Bodoni school of Type Design.\n\nMy Romm/Vilna seeks to be a faithful re-creation of these typefaces.\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:30am",
      "content": "\\> next to open type fonts were developed.  \n1. Sil Ezra  \n2. Guttman Vilna by yoel ganzburg\n\nYou didn't mention John Hudson's SBL-Hebrew. I didn't see Yoel Ganzburg's Guttman Vilna. But the Sil Ezra typefaces are poor.\n\nOpenType has many features, which are not part of FontLab Studio. Hence, if an OpenType Hebrew font was not editing in MS Volt, it is very limited. Even in Volt, there are different levels of quality.\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:33am",
      "content": "\\> both tried bringing back nikud when there is a taam.  \nboth used Mark and/or MarktoMark Positioning but could not utilize the pair abjusments because indesign CS did not Support this fuction in right to left.\n\ntrying to do so, indesign would shift the nikud forwards rather than backwards this bug was only fixed in CS2  \n(Office 2003 allready did support this)\n\ninstead, both projects use 3 minus spaces glyphs in order to shift back the nikud. this resulted unaccurat positioning because glyphs were treated as THIN SPACE, MIDSPACE and WIDE SPACE.\n\ntoday, hebrew fonts can use Pair abjusments in order to move back the nikud rather than minus spaces, this results much more accurate positioning.\n\nNow, in my fonts Normal does not include The Pair abjusment feature. with a Stylistic Set you may use a pair abjustment and then replacing taam to nikud.\n\nthis featur must come after feature.\n\n----------------------------------------------\n\nThis is very abstract. Please break the ideas up into units, and explain each one at length.\n\n"
    },
    {
      "time": "13 Feb 2009 — 10:41am",
      "content": "\\> In the famous Romm family typefaces of Vilna, Lithuania, popularly known as Vilna, the taam symbols were created lighter than the nikkud, unlike most other Hebrew fonts.\n\nThis is not quite right. Do you have any book, sample? if the taam is lighter or darker than the nikkud -- this is a matter of taste; there's nothing wrong or right. So, what is the big deal: \"Did Yoel Ginsburg do this like the original? My guess is not.\"\n\n"
    },
    {
      "time": "13 Feb 2009 — 12:44pm",
      "content": "David,\n\nWhen I created these faces, I clearly recall this, but I also thought it was a matter of \"taam v'rayach\". Recently, Raphael Freedman suggested the reason was to set apart the taamim from the nikkud.\n\nNevertheless, I will scan and post samples next week.\n\nI have never seem a version of Vilna created exactly like the original Widow and Brothers Romm version, which I replicated in detail. Hence, I concluded that I doubted that Gansbourg did so in Guttman Vilna.\n\nThe reason Raphael suggests is fascinating, and makes a lot of sense.\n\nWith all due respect, David, I don't buy your explanation. It's like saying, the ink spilled and created the Vilna face.\n\n"
    },
    {
      "time": "13 Feb 2009 — 12:48pm",
      "content": ".\n\n"
    },
    {
      "time": "13 Feb 2009 — 12:47pm",
      "content": ".\n\n"
    },
    {
      "time": "13 Feb 2009 — 1:12pm",
      "content": ".\n\n ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/aleph_4614.jpg)\n\n"
    },
    {
      "time": "13 Feb 2009 — 1:14pm",
      "content": "Nikkud\n\n ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/nikkud_5423.jpg)\n\n"
    },
    {
      "time": "13 Feb 2009 — 1:15pm",
      "content": "Taam\n\n ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/taam_5523.jpg)\n\n"
    },
    {
      "time": "15 Feb 2009 — 8:27am",
      "content": "if you are interested in SHEVA NA-NACH, DAGESH HAZAQ-KAL and QAMATS QATAN here is a sample of ERETSHAZVI doing all this\n\nShevaNa = 2 sqr  \nShevaNACH= 2 circles  \nDagesh kal = Circle  \nDagesh hazaq=Sqr  \nqamats qatan= Long qamats\n\ncheck it out...\n\n"
    },
    {
      "time": "15 Feb 2009 — 8:28am",
      "content": " ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/Tehilim2_5777.pdf)\n\n"
    },
    {
      "time": "15 Feb 2009 — 8:33am",
      "content": "heres a link\n\n[www.eftype.prog.co.il/tehilim2.pdf](http://web.archive.org/web/20150414033618/http:/www.eftype.prog.co.il/tehilim2.pdf \"www.eftype.prog.co.il/tehilim2.pdf\")\n\n"
    },
    {
      "time": "15 Feb 2009 — 8:48am",
      "content": "this is not for a forum  \nits too much to write  \nand i dont write english well.  \nif you think i can help you i would be more than happy to talk with you/  \nmy Phone number is at home  \n02-9919841\n\ni guess you would hav to dial a prefix (+927)?\n\nmy mail is  \n [studiofried@gmail.com](mailto:studiofried@gmail.com)\n\nhow ever you wish\n\n"
    },
    {
      "time": "15 Feb 2009 — 2:09pm",
      "content": "\\> I will scan and post samples next week.\n\nIsrael,\n\nwell? :^)\n\n ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/VilnaA_6608.gif)\n\n ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/VilnaB_3463.gif)\n\n ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/VilnaC_4676.gif)\n\n---------------------------\n\n ![](http://web.archive.org/web/20150414033618im_/http:/typophile.com/files/OneMoreA_3999.gif)\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:39pm",
      "content": "Well, what?\n\nI forgot whatever you were trying to show me by this. Please remind me. Landeinu, rabbeinu. :)\n\n"
    }
  ]
}
