{
  "id": "53656",
  "title": "GO!",
  "forum": "GoodLoud's blog",
  "tags": [

  ],
  "content": "So I feel a little lame in that this is a) my first personal blog entry and b) the first entry is of the class assignment variety. Nevertheless, this will also enable me to kill two birds with one stone (assuming I've still got a good throwin' arm).\n\nAlright, down to brass tacks. The assignment was to find a book cover that interests us and analyze the interaction between image and text. The book cover I chose is from the newest chronicle by one of my favorite authors, John Hodgman (of the <cite>Daily Show</cite> and Apple's [commercials](http://web.archive.org/web/20131019131131/http:/video.google.com/videosearch?hl=en&rls=en&q=stephen%20colbert&um=1&ie=UTF-8&sa=N&tab=wv#q=apple%20commercial%20john%20hodgman&hl=en&emb=0)). His latest creation, <cite>More Information Than You Require</cite> (much like its predecessor, <cite>The Areas of My Expertise</cite>) is positively German in its efficient, effective, and hilarious use of space. Even the front cover (see image) could be considered a chapter or prologue on its own. Large shadowed block lettering lets you know exactly what this book is. One of the jokes that you may have to be familiar with is the concept of utter shamelessness and boldfaced faux self-righteousness exhibited by Hodgman (others include the likes of [Stephen Colbert](http://web.archive.org/web/20131019131131/http:/video.google.com/videosearch?hl=en&rls=en&q=stephen%20colbert&um=1&ie=UTF-8&sa=N&tab=wv#) and [Jesse Hughes](http://web.archive.org/web/20131019131131/http:/www.someamerican.com/musicculture/2008/9/2/because-when-i-think-of-rock-n-roll-dennys-is-the-first-thin.html)). Finally what I consider to make these covers true success stories is that the contents of the inside of the book are just not enough to quench my thirst for this man's writing. I absolutely need every bit of word play, outlandish language, and absurd non-information, and if it takes using the front cover, back cover and both inside sleeves to do it, then anchors away.\n\nJohn Hodgman book covers:  \n [<cite>More Information Than You Require<cite></cite></cite>](http://web.archive.org/web/20131019131131/http:/farm4.static.flickr.com/3276/2806930269_acf2539e47_b.jpg)\n\n[<cite>The Areas of My Expertise<cite></cite></cite>](http://web.archive.org/web/20131019131131/http:/www.umsl.edu/~chemist/books/halspicks/Covers/AreasOfMyExpertise.jpg)\n\nOKAY! Thats all out of the way. Seriously though, these books are a riot on wheels and you'd do yourself good to snag a copy.  \nUntil next time, dear readers. Remember to eat your vegetables and tell your mother you love her.\n\n",
  "author": "GoodLoud",
  "time": "18 Jan 2009 — 4:36pm",
  "uid": "41397",
  "comments": [
    {
      "time": "18 Jan 2009 — 5:56pm",
      "content": "holy grid batman! but i agree there is something retro packaging  \nabout this and am definitely picking these little gems up...\n\n"
    },
    {
      "time": "2 Feb 2009 — 1:57pm",
      "content": "[http://ecx.images-amazon.com/images/I/51AJV9KT0NL.\\_SL500\\_AA240\\_.jpg](http://web.archive.org/web/20131019131131/http:/ecx.images-amazon.com/images/I/51AJV9KT0NL._SL500_AA240_.jpg \"http://ecx.images-amazon.com/images/I/51AJV9KT0NL.\\_SL500\\_AA240\\_.jpg\")\n\nThere's the book I told you about forever ago. It's a really manly book to carry around.\n\n"
    }
  ]
}
