{
  "id": "53657",
  "title": "Logo for Web Design Business",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nJust wondering what you thought of this as the new logo for my web design business:\n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/logo_d_6117.png)\n\nAny feedback is appreciated...\n\n",
  "author": "Tintin81",
  "time": "18 Jan 2009 — 4:51pm",
  "uid": "19464",
  "comments": [
    {
      "time": "18 Jan 2009 — 5:07pm",
      "content": "I like the concept of the d/b combo only i do not like the edited outer curve of the d looks off. You might try moving the de a space to the right and moving the ts a space to the left to tighten up the kerning.\n\n"
    },
    {
      "time": "18 Jan 2009 — 9:45pm",
      "content": "Have a look [David Airey's list](http://web.archive.org/web/20131015182331/http:/www.logodesignlove.com/similar-original-logos) of look alike logos. It includes three logos that have similar 'b' treatment.\n\n"
    },
    {
      "time": "19 Jan 2009 — 6:49am",
      "content": "OK, thanks for your input. I've made some very subtle adjustments, as you suggested. Please give me some more feedback if you can. Thanks!\n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/logo_d2_6566.png)\n\n[Webdesign Agentur](http://web.archive.org/web/20131015182331/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "20 Jan 2009 — 3:14am",
      "content": "OK, not sure if anyone is reading this thread, but this would be my next version:\n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/logo_d3_6588.png)\n\nI used Illustrator this time and if you look closely enough you will see that the shape inside the \"d\" is actually a copy of the \"b\" in \"designbits\". I also adjusted kerning a little. Do you think this logo has got potential?\n\nThanks for any input...\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015182331/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "20 Jan 2009 — 8:13am",
      "content": "I think the stylized d is a bit too close in spacing to your wordmark - in the sense that my brain is trying to figure out why is there 2 \"d\"'s? Although the size difference does help create \"space\". Also the white oval within the d looks...I don't know, too stark. The colors overall are good and I generally like the feel of what you have going. But what if you had a capital B on the reverse of the d but pixelate it? Just another idea. Good luck.\n\n"
    },
    {
      "time": "20 Jan 2009 — 8:40am",
      "content": "I agree - try a capital 'B' (or just the counters from one).\n\n- Lex\n\nP.S. It really depends on how important seeing the 'b' is to you. This iteration is probably too subtle for most people, but maybe you want that. Personally, I'd make it a little more apparent.\n\n"
    },
    {
      "time": "20 Jan 2009 — 9:22am",
      "content": "I get a bit of a cartoon eye from the most recent one.\n\n"
    },
    {
      "time": "21 Jan 2009 — 1:06am",
      "content": "Hi and thanks for your comments. This is the updated version:\n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/logo_d4_4457.png)\n\nBut: Why would I add a capital B on the reverse of the d? There's no capital B in the actual wordmark... I have tried variations with a lowercase b on the reverse, but it looked too much like a xxxx.\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015182331/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "21 Jan 2009 — 2:42am",
      "content": "And this would be another concept:\n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/logo_pixels_5360.png)\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015182331/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "21 Jan 2009 — 5:35am",
      "content": "I like this last one...overall I think you have a good concept here. In fact I'm having a hard time thinking of anything that I would change. Maybe change the white square \"pixel\" to the lighter blue. I'm thinking the contrast is a bit much which maybe why people see an eye as opposed to the counter of the \"d\".\n\n"
    },
    {
      "time": "22 Jan 2009 — 1:52am",
      "content": "The last one's nice, but I think a different font should be used with the mark  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "22 Jan 2009 — 4:52am",
      "content": "Hi,\n\nI concur. The second concept is better. Also, I can use the \"pixel\" theme throughout my website (pixelated backgrounds, bullet points, etc) which will give it a nice edge.\n\nI would also prefer a font that feels more \"boxy\" and squarish but I'm lacking experience in this area. Can anybody suggest a good font here? Thanks...\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015182331/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "22 Jan 2009 — 1:50pm",
      "content": "OK, this would be another iteration:\n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/logo_pixels2_5271.png)\n\nI changed the font to Myriad Pro and the subline to Infotext (since Myriad Pro isn't available in small caps). I also made some of the boxes smaller to make it look more dynamic.\n\nPlease let me know what you think.\n\n[Webdesign Agentur](http://web.archive.org/web/20131015182331/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "22 Jan 2009 — 2:13pm",
      "content": "Resizing the boxes gives a sense of depth, which actually I don't think fits here.\n\n"
    },
    {
      "time": "28 Jan 2009 — 12:04pm",
      "content": "I just happened to run through this logo in a PC magazine.\n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/bluebeam_logo_4288.jpg)\n  \n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/Bluebeam%20Logo%20-%20C_5272.gif)\n\n"
    },
    {
      "time": "28 Jan 2009 — 7:34pm",
      "content": "[http://img.skitch.com/20090129-gibiddusq3mxniusq7a25xfwbj.jpg](http://web.archive.org/web/20131015182331/http:/img.skitch.com/20090129-gibiddusq3mxniusq7a25xfwbj.jpg \"http://img.skitch.com/20090129-gibiddusq3mxniusq7a25xfwbj.jpg\")\n\nDid some quick help in photoshop. The few things I have are check your spacings (regardless of the logo you are choosing) See what lines up with what else. Make conscious efforts about how thing should grid and correspond together. Should designbits text be as tall as the d? Should the bottom of design bits line up with the white circle in the middle? Web Design should be just as wide as the left side of the lowercase n and right end of that word. Bottom image: I don't like the thickness of the d, I think you should move the lowercase d so that it keeps the same thickness all the way around. Would improve the over all \"flow\" of the mark. I like this first font you used, the second ones are popular font and have more of a fun cartoony feel. Take it for what its worth. my 2 cents :)\n\nP.S. Guides are your friends, you have the power to make things perfect (computer) so why not do it?\n\n"
    },
    {
      "time": "22 Feb 2009 — 10:50am",
      "content": "Hi everybody and thanks for all your comments and a big thank you to chadengle in particular for the \"quick help in photoshop\".\n\nI decided to start from scratch and use a more minimalistic approach instead: [Link to new website](http://web.archive.org/web/20131015182331/http:/www.designbits.de/). This will give my portfolio the attention it deserves rather than distract from it.\n\nI think it looks good on the website, but can this be a long term solution?\n\nThe font I'm using is AvantGarde. Is there anything that can be done to make it stand out more? To make it more memorable?\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015182331/http:/www.designbits.de/)\n\n"
    },
    {
      "time": "22 Feb 2009 — 12:24pm",
      "content": "I like the way your name looks on the website, but I'm not wild about the headings when you go to the pages. When you go to the page Agentur, for instance, I don't like the way the title Agentur looks with DESIGN BITS. I think that looks awkward. Otherwise, nice site. Love the colors.\n\nSharon\n\n"
    },
    {
      "time": "22 Feb 2009 — 6:41pm",
      "content": "It is a clean and pleasant looking logo, but it does indeed look generic. Some small design element to customize the type may go a long way. Something as simple as turning T into 6 spaced squares (bits) or pixelating \"design\". Perhaps even using some form of \"designer pixels\", something with a bit of a flare.\n\n"
    },
    {
      "time": "6 Mar 2009 — 2:47am",
      "content": "Hi,\n\nThanks for your comments.\n\nI liked epsilicon's suggestion and slightly changed the shape of the \"T\". I also put the whole thing on a business card. Please let me know what you think of the logo and the composition on the card. Thanks!\n\n ![](http://web.archive.org/web/20131015182331im_/http:/typophile.com/files/vcard_6685.jpg)\n\n[Webdesign Hamburg](http://web.archive.org/web/20131015182331/http:/www.designbits.de/)\n\n"
    }
  ]
}
