{
  "id": "53700",
  "title": "Mac OS X vertical metrics",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm having this problem with the vertical metrics of my Print Clearly font on my Mac (OS X). The vertical metrics for Print Clearly and Print Dashed are extremely tall. This happens with the font preview, font book and TextEdit. The fonts match exactly as they should in Photoshop. Here's a screen grab:\n\n ![](http://web.archive.org/web/20131013085233im_/http:/typophile.com/files/verticalsmac_4851.jpg)\n\nI've checked all the vertical metrics, looked for glyphs that might cause the problem, in fontlab and see nothing that would cause this problem. I'm perplexed.\n\n",
  "author": "bvfonts",
  "time": "19 Jan 2009 — 11:27am",
  "uid": "2951",
  "comments": [
    {
      "time": "19 Jan 2009 — 1:13pm",
      "content": "Have you tried clearing the system font caches?\n\n"
    },
    {
      "time": "19 Jan 2009 — 3:55pm",
      "content": "I haven't, where are they located? I know how to find the adobe font cache.\n\n"
    },
    {
      "time": "20 Jan 2009 — 9:52am",
      "content": "Ascender has some good info about this on their support FAQ:\n\n[http://www.ascendercorp.com/support/#cache](http://web.archive.org/web/20131013085233/http:/www.ascendercorp.com/support/#cache \"http://www.ascendercorp.com/support/#cache\")\n\nI use the FontExplorer X, which has a utility built in for clearing font caches.\n\nI actually try to avoid clearing font caches as much as I can since it requires a restart every time. When I have a font under development, I change the font name with each new version I want to test. This sidesteps the cache issue since the system sees different names and assumes they are different fonts (which, if you think about it, they are).\n\n"
    },
    {
      "time": "22 Jan 2009 — 12:28pm",
      "content": "Open the generated fonts (not the .vfbs) in FontLab Studio and make screenshots of Font Info / Metrics and Dimensions / TrueType-specific metrics. Upload the screenshots here.\n\n"
    },
    {
      "time": "24 Jan 2009 — 12:53pm",
      "content": "I've seen both extra vertical space and negative vertical space (lines squish together or display as half height) in fonts generated by FontLab where the ascender is lower than the cap height.\n\nThe way I see it, if the ascenderr line is lower than the cap height, the ascender line really serves no purpose, other than as a guide while editing/creating a font. Once you're done with the font you can ignore the actual ascender height and set the line a couple of em spaces higher than the cap height and that seems to usually fix the problem you're seeing.\n\nAt least that's been my experience.\n\n"
    },
    {
      "time": "26 Jan 2009 — 5:37pm",
      "content": "I solved the problem. The Aring was sticking over the ascender line about 20 points. I'm still not sure why that happened. Shouldn't it be ok to have the accents above the ascender line?\n\n"
    },
    {
      "time": "2 Feb 2009 — 5:10am",
      "content": "<cite>Shouldn’t it be ok to have the accents above the ascender line?</cite>\n\nYes, of course, where should they else be? :)\n\nYou have to take a look at ALL your vertical metrics, if you do as Adam suggests, you'll get good help.\n\n"
    }
  ]
}
