{
  "id": "5382",
  "title": "Free Fonts and the Internet",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is distributing free fonts over the internet immoral?\n\n",
  "author": "dan_reynolds",
  "time": "28 Jun 2004 — 4:26am",
  "uid": "1085",
  "comments": [
    {
      "time": "28 Jun 2004 — 4:51am",
      "content": "Depends on the license and its ownership, and what your opinion on intellectual property rights are?   \n   \nI'd say no. Providing you designed the fonts yourself, or have permission from the person who did, of course ![:-)](http://web.archive.org/web/20131014165758im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nOf course there are levels of grey - would a typeface designed as a parody of the McDonalds logo be acceptable?\n\n"
    },
    {
      "time": "28 Jun 2004 — 1:06pm",
      "content": "but should designers give away there work for free?\n\n"
    },
    {
      "time": "28 Jun 2004 — 2:23pm",
      "content": "Is it immoral?   \nStrictly speaking, yes. It is pandering to greed (something for nothing), which is one of the sins.   \nNow it could be argued that it's altruistic to provide fonts for the poor souls who can't afford them.   \nBut the fact is, everyone who has access to the Web is on a computer which comes supplied with fonts sufficient for the basic necessitties of typesetting.\n\n"
    },
    {
      "time": "28 Jun 2004 — 2:54pm",
      "content": "As one who distributes my own fonts for free, I'd have to say that it's not stupid, because quite honestly the quality of my fonts (I can admit it) isn't such that I could expect any money for them.   \n   \nThe only negative aspect I could see is that it dissuades people from buying the fonts of people who design and sell good ones. But no one is owed a living doing XY and Z... if you can make a living at it, well and good. If you can't, do something else.\n\n"
    },
    {
      "time": "28 Jun 2004 — 2:59pm",
      "content": "Nick: I don't see how the pandering to greed argument works here. To reverse the argument, isn't charging money for something just pandering to the greed of the seller? Everybody wants something, whether it's fonts or money.   \n   \nT\n\n"
    },
    {
      "time": "28 Jun 2004 — 3:03pm",
      "content": "I used to run a free font site (.ttf for anyone who's interested). Obviously there's a difference between home users who just want fun fonts and professional users prepared to pay for a quality product. I got some nice mails from folks who'd used my fonts in church missives and things like that. That said, I also saw my work cropping up in shop displays, on the sides of buses, one was even used in a TV news feature.   \n   \nI'd say it's not immoral as long as they're your own designs (not derivative) and you make no claims over quality, that could lead to a muddying the typographic waters. There are many more immoral things to do......\n\n"
    },
    {
      "time": "28 Jun 2004 — 3:04pm",
      "content": "A few students from Offenbach and I have formed a type collective, and we are putting together a website (I'll post the URL after it launches in a week and a half).   \n   \nWe want to open our platform up to other interested students at our school as well. Last week, we began to think about what we wanted to be as a group, what we stood for, etc... This way, it would be easy for us to figure out which other students/work would be a good fit for us and our collective's site.   \n   \nSeveral of us have worked \"in the nearby type industry.\" We all have strong feelings about type design, and plan to continue focusing our studies/lives/etc. toward that. Anyway, here are our general guidelines for type that can be displayed on the site:   \n   \n1. the work may not be derivative   \n2. the work may not be available anyhere as a free font at the moment   \n3. the work should be \"good\" enough. By good enough, we mean, that we as a group should all be able to sit and talk about it. Of course, none of us are professional type designers, so \"good\" is still relative. But we have to set the bar for ourselves somewhere.   \n   \nUnfortunately, there are students at our school who make typeface design experiments that are derivative. As a group, we are all in agreement that derivative work is bad, and that we should not support it.   \n   \nWhile we all agree that we don't want to create a free font site, I'm not so sure that we are all in agreement about the distribution of free fonts in general. I tend to agree with Nick, and think that free fonts hurt the industry and individual designers, perid. I would not like to support this practive with my time, money, and creative efforts.   \n   \nI just wanted to see what the general opinion is. I don't want to seem like a reactionary; if I'm out of line, we might re-consider our free font position.\n\n"
    },
    {
      "time": "28 Jun 2004 — 3:33pm",
      "content": "A lot of designers I speak to, ask why should they buy fonts, when they can download font for free...\n\n"
    },
    {
      "time": "28 Jun 2004 — 3:50pm",
      "content": "Free fonts are WMD and should be treated accordingly.\n\n"
    },
    {
      "time": "28 Jun 2004 — 3:58pm",
      "content": "I should add that although I don't think giving away fonts for free is immoral, I do think it tends to devalue type, and is usually bad for the type industry and those who wish to make their living at type.   \n   \nSo, if the question is, should we give away some fonts, given that we don't care whether we make money, I'd say \"that depends.\" Personally, I'd suggest you decide what you think the fonts are worth, and charge that amount for them. They might be quite cheap. I guess the problem with that is that getting into the whole e-commerce setup might be expensive and troublesome, given that you don't expect to charge much. I wonder what one would do for sort of \"poor man's e-commerce\"? Maybe let people pay with PayPal, and email them their fonts afterwards? Say, you could auction the fonts on e\\*Bay! Okay, now I'm getting silly....   \n   \nSeriously, though, one element of the problem is that most users don't understand the quality difference between most of the free and shareware fonts and high quality well crafted fonts. So as long as there are lots of free fonts, they think people are \"greedy\" or something if they want to charge for fonts.   \n   \nWhat I do think is unethical is making knockoffs of existing retail fonts (whether free or not), or distributing other people's retail fonts illegally (piracy).   \n   \nMy two cents.   \n   \nT\n\n"
    },
    {
      "time": "28 Jun 2004 — 4:06pm",
      "content": "\"_Everybody wants something, whether it's fonts or money._\"   \n   \nThomas, when you make tshirts bearing this quote, I will buy one.\n\n"
    },
    {
      "time": "28 Jun 2004 — 4:17pm",
      "content": "\\>To reverse the argument, isn't charging money for something just pandering to the greed of the seller?   \n   \nThomas: no, because a sale is a (hopefully fair) exchange of value, money for goods.   \n   \nGetting something for nothing is greedy, unless it would have otherwise gone to waste. Because really, there's no such thing as something for nothing, someone always ends up paying, one way or another -- and with free fonts a number of posts to this thread have pointed out how third parties can suffer.   \n   \nBut nowadays, it's generally considered smart to get something for nothing, not an embarrassment -- shows the immorality of the age, doesn't it?\n\n"
    },
    {
      "time": "28 Jun 2004 — 4:35pm",
      "content": "What about releasing a font as opensource,   \nletting people modify and resell as they please,   \nbut leaving the source code freely downloadable?\n\n"
    },
    {
      "time": "28 Jun 2004 — 4:55pm",
      "content": "I'm very intrigued by the idea of an opensource type movement. There could be say various starting ideas, and people to add a glyph at a time, or punctuation, or metrics. The fontographer files could be downloadable as would be various incarnations of the typeface. People could add their name to the devlopment of the growing high-quality typeface. I think if there isn't opensource type, we should start something ![:-)](http://web.archive.org/web/20131014165758im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nPS\\> I in no way condone font piracy and support the type industry, but this opensource is a different altogether. And IMHO, it's far from immoral.\n\n"
    },
    {
      "time": "28 Jun 2004 — 7:32pm",
      "content": "Distributing free fonts (with the designer's permission) hardly seems immoral to me.   \n   \nI understand the argument that it may devalue the work of type designers in general, but I'd present [the Yale typeface](http://web.archive.org/web/20131014165758/http:/www.yale.edu/printer/typeface/typeface.html) as a good counter example. Granted, it's not free to _all_, but it is free to students and faculty. It's an example, in my opinion, of an organization absorbing the cost for the general betterment of their typographic environment. This strikes me as a moral act, or at the very least an act that isn't immoral. Proper credit and emphasis are also given to the designer and the intentions associated with the font family's designs, which contributes to my support for this project.   \n   \nPersonally, if taking things that're free means I'm greedy, then I was greedy by reading Typophile before contributing, where I got insights, opinions, and help for free. I also offered them up without the promise of reciprocation from any individual I helped (and still do). Distribution of free fonts (or software, for that matter) can be done in the name of public good and open exchange of ideas, which has little to do with commerce and a lot to do with growth and community.   \n   \nI buy fonts, but I also download and appreciate generous free offerings such as Unibody and Silkscreen. I don't think honest, well-intended distribution of personal work is the problem. The gauging of type's value by the public at large is influenced much more thoroughly by Microsoft, Apple, and Adobe than by John Doe's Personal Font Site with his free _Star Wars_ font knockoffs.   \n   \nNote: I do not condone font piracy, and my argument does not apply to those who publicly redistribute fonts outside of the terms of their licenses, or seek to make money from the designs of others.\n\n"
    },
    {
      "time": "28 Jun 2004 — 7:38pm",
      "content": "The Yale Typeface project is an abuse of taxpayers hard earned money.   \n   \nAlso Yale should not be in the business of competing with business. Shame on them.\n\n"
    },
    {
      "time": "28 Jun 2004 — 8:03pm",
      "content": "\"_Also Yale should not be in the business of competing with business. Shame on them._\"   \n   \nThey hired a type designer to design type for them. Carter did, and they paid him for it (I presume). I fail to see the problem. The type is forced on no one, and exists as its own reason for being, not as a bullet point in a product sell sheet. I take it that the manner of its distribution is the problem? They aren't distributing it against Carter's wishes, are they? I'm also not sure what you're referring to when you write about \"an abuse of taxpayers hard earned money,\" could you elaborate? I get the sense I'm not aware of the full picture.\n\n"
    },
    {
      "time": "28 Jun 2004 — 8:14pm",
      "content": "Yale is a private school and not publicly funded, fwiw.   \n   \nT\n\n"
    },
    {
      "time": "28 Jun 2004 — 8:36pm",
      "content": "Nick,Gerald: you are both so greedy!!!!! Of course there are plenty of free and good things in life, the best things are luckily free.   \n   \nWas it immoral to vaccine the world population in the sake of the pock erradication (without charging individuals for it) even if this pandered greed?   \n   \nGoods are made to satisfy human needs, not only to be traded. Human creations are done to be shared, not to be hoarded. So I don\n\n"
    },
    {
      "time": "28 Jun 2004 — 9:03pm",
      "content": "Thomas,   \n   \n\\>_Yale is a private school and not publicly funded, fwiw._  \n   \nThank you, a better reason to \"not act charitably\" towards the Yale project. Reason to lobby for stronger \"anti-dumping laws\".\n\n"
    },
    {
      "time": "28 Jun 2004 — 9:12pm",
      "content": "Good point in the previous post Chris. To add onto your argument that distributing free font does not neccessarily devalues the work of type designers in general, take a look at Gaultney's Gentium too:   \n [http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&item\\_id=Gentium](http://web.archive.org/web/20131014165758/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium)   \n   \nI'm also intrigued by the idea of open source type, James. Although in many ways, type seems like much more difficult area for open source development than software for example.   \n   \nSome free fonts can be \"WMD\" Gerald, but also type business can never be what it used to be before. And it souldn't. Technology changes every aspect of life, so it should change type business as well. Just like software, additional fonts can be manufactured with zero marginal cost now:   \n   \n [http://levine.sscnet.ucla.edu/general/intellectual/coffee.htm](http://web.archive.org/web/20131014165758/http:/levine.sscnet.ucla.edu/general/intellectual/coffee.htm)   \n [http://levine.sscnet.ucla.edu/papers/ip.ch.1.m1004.pdf](http://web.archive.org/web/20131014165758/http:/levine.sscnet.ucla.edu/papers/ip.ch.1.m1004.pdf) (pdf)   \n   \nand I do think that most EULAs are too restrictive. Note that I feel very strongly against any kind of piracy too.   \n   \nSooo sorry if I'm straying off topic\n\n"
    },
    {
      "time": "28 Jun 2004 — 9:13pm",
      "content": "Jajaja, ok, taken advice Gerald =)\n\n"
    },
    {
      "time": "28 Jun 2004 — 9:22pm",
      "content": "Gerald,   \n   \nUnless I misunderstand, Yale commissioned the typeface for the use of its staff and students. How is this \"worse\" than a company commissioning a typeface? Should companies and educational institutions not be allowed to commission new original typefaces for their own use?   \n   \nT\n\n"
    },
    {
      "time": "28 Jun 2004 — 9:53pm",
      "content": "Buffooey,   \n   \n [http://levine.sscnet.ucla.edu/papers/ip.ch.1.m1004.pdf](http://web.archive.org/web/20131014165758/http:/levine.sscnet.ucla.edu/papers/ip.ch.1.m1004.pdf)   \n   \nNothing to do with fonts in America.   \n   \nFor starters, in America there is no such thing as copyright protection for fonts.   \n   \nTrademarks are the effective ingrediant. Nothing intellectual about them. In fact most of them are baseline retarded.   \n   \nTechnology changing is fine. If anyone here knows about changes it would be I. That said I value the digital work in the Lanston Library, I am sure, even though Thomas may disagree, I suspect Adobe values their cheap or free fonts that are bundled. Also I am sure that Carter values his time and puts a dollar figure on it.   \n   \nThe fact that the technology changes does not mean I wish to stopped eating.   \n   \nSo if type should be free, why should not books also be free, not to mention electric lights.   \n   \nYou and Hector must be the last card carrying members of the Wobblies. That's it, isn't it?   \n   \n [http://www.fortunecity.com/tinpan/parton/2/iww.html](http://web.archive.org/web/20131014165758/http:/www.fortunecity.com/tinpan/parton/2/iww.html)   \n   \nSay hello to Woody Guthrie, tell him I enjoyed his song about the dog with the wooden leg?\n\n"
    },
    {
      "time": "28 Jun 2004 — 10:04pm",
      "content": "Tomas   \n   \n_Should companies and educational institutions not be allowed to commission new original typefaces for their own use?_   \n   \nOf course they should. What kind of a question is that?   \n   \nI thought we were speaking of free fonts. Am I on the wrong thread?   \n   \n**\"Free Fonts and the Internet\"**   \n   \nMaybe there is some confusion, perhaps. Why in Dickens didn't anyone point that out to the fellow with the link. Geezads.\n\n"
    },
    {
      "time": "28 Jun 2004 — 10:06pm",
      "content": "Thomas,   \n   \nI am trying with the name. I feel so stupid. I had this friend. So sorry, I did it again.\n\n"
    },
    {
      "time": "28 Jun 2004 — 10:23pm",
      "content": "Besides,   \n   \nThey should have commissioned Lanston to digitize Yale Janson by Sol Hess. No respect for their own tradition. To think I was going to donate to Yale University, patterns, punches, cutting cards and all materials in the docket. But ooooh no.   \n   \nNow if that was a public University it would never have happened. The public has respect.\n\n"
    },
    {
      "time": "28 Jun 2004 — 10:28pm",
      "content": "I agree with Brian.\n\n"
    },
    {
      "time": "28 Jun 2004 — 10:30pm",
      "content": "Gerald,   \n   \nYes, that's the title of the thread, but the message about the Yale typeface said: \"Granted, it's not free to all, but it is free to students and faculty. It's an example, in my opinion, of an organization absorbing the cost for the general betterment of their typographic environment.\"   \n   \nAnd I don't mind you confusing my name with that of a friend of yours. It's rather sweet, and not at all offensive.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "28 Jun 2004 — 10:32pm",
      "content": "I am one of the people who have been reading here, trying to educate myself about type. Brian, you mention children and favorite typefaces. As a child I loved to read and I loved to read books that had a certain type in them. I never learned the names of the type I liked, but I did recognize that certain types made the reading experience better, the way good paper did.   \n   \nNow I'm working in a specialized web design field and I need to build a type library. I have purchased a lot of type recently but I have also downloaded free type. When I found type that was obviously ripped off or downright stolen, I realized that I didn't have the knowledge to recognize which free fonts were original and which weren't. So I went back and deleted the free fonts, except for a very few that I feel certain about.   \n   \nI see nothing wrong with someone offering a free font if you purchase a font. But I think that we should respect the artists who design type and pay them what they deserve or we will find that we are left with a lot of cheap, crappy type and not much else.\n\n"
    },
    {
      "time": "28 Jun 2004 — 10:49pm",
      "content": "Sharon,   \n   \nI can assure you, you are one of the most learned people here. I could not have said that better myself.   \n   \nRefreshing.\n\n"
    },
    {
      "time": "28 Jun 2004 — 11:11pm",
      "content": "Thomas,   \n   \n_Yes, that's the title of the thread, but the message about the Yale typeface said: \"Granted, it's not free to all, but it is free to students and faculty. It's an example, in my opinion, of an organization absorbing the cost for the general betterment of their typographic environment.\"_   \n   \nThomas, you have to look at it this way. If you want that font, first you have to have very good marks, have lots of money, and be accepted into Yale University.   \n   \nWhat is free about that?\n\n"
    },
    {
      "time": "29 Jun 2004 — 1:30am",
      "content": "If you are the designer of a font, why should you not be able to give it away free? I'm glad someone mentioned Gentium, which is a great example.   \n   \nPeople in the past have drawn comparisons with music - no-one asks why we need music, so the argument goes, so why should we ask why we need new fonts. Likewise on font distribution, surely?   \n   \nI dont think that too many people would hold with the argument that ALL music HAD to be charged for (or not released or performed), so that those who are at the top of their profession should not feel somehow devalued, and I dont see why that analogy isn't fitting here.   \n   \nType design isn't all about the money. Some people are designing fonts simply because they enjoy it and may want to share it with others. Others are learning (this is where I am at). Others to provide an altruistic service to the wider community. And many people are trying to make their living from it.   \n   \nAll are surely acceptable, if not welcome?\n\n"
    },
    {
      "time": "29 Jun 2004 — 2:03am",
      "content": "Educating the public about type is a great idea, but it is also more of a lofty goal than a small group of other students and I can bull off at the moment. Instead, we want to educate our own fellow students first. There are 700 students who study with us, most of whom have no idea about type. Many of them probably just assume that it is automatically generated by the computer itself!   \n   \nWe want to to show them what is interesting about type design, why some students at the school do it, and why stealing fonts is bad (everyone knows that students steal typefaces). We would also like to say, \"hey, be carefull about free fonts.\" They might not be good. And using them might even prevent newer, better typefaces from ever being released.\n\n"
    },
    {
      "time": "29 Jun 2004 — 2:08am",
      "content": "Free font websites are a secondary problem. Font pirarcy is something which needs to be looked at as the major enemy to the industry, peer to peer networks are full of pirated fonts and unlike pop stars who have there songs traded in these networks, font designers are not rich.   \n   \nIn the end it will probably be the music industry that closes down these places. But what message does a peer to peer free for all world send to students studying design... 'if I can get this stuff free, then why pay for it...'.   \n   \nI agree that education is key.\n\n"
    },
    {
      "time": "29 Jun 2004 — 3:16am",
      "content": "I agree with you to a point, Stephen, but I think the analogy still holds as they are still license-based intellectual property products based on creativity, no matter what their end \"purpose\" may be.   \n   \nTo tie it back in with the original question, as with most things in life, somethings morality is very much linked with its intention. If I release a load of rip off fonts for free on the web to spite a foundry, then that's probably immoral (there are always exceptions, of course). But if I release my own designs, that I have created for my own amusement, and share them, then surely thats a whole different ballgame.   \n   \nSurely it would be immoral to charge a competitive industry price for a font that does not meet the standards of, say, JFP or Mr Carter?\\</font\\>\n\n"
    },
    {
      "time": "29 Jun 2004 — 8:24am",
      "content": "Free fonts do nothing for an education about typography. How could they? What would the message be?   \n   \nIs this your message?   \n**\"you don't have to pay for fonts\".**   \nDuh, hyuk, my name is Bob!   \n   \nRemember students go to Yale just so they can get that \"Yale font by Carter\", they are paying the highest price in the world for a font.   \n   \nThat font is so expensive Yale is like Adbobe and others. Yale has to bundle in a free education with their font. And Yale is in the education business. If you want to teach people open up your own private university and hire Carter.   \n   \nIf you are giving away quality fonts\n\n"
    },
    {
      "time": "29 Jun 2004 — 9:05am",
      "content": "\"But nowadays, it's generally considered smart to get something for nothing, not an embarrassment -- shows the immorality of the age, doesn't it?\"   \n   \nSo, you side with MS saying that open source software is immoral? ;o)\n\n"
    },
    {
      "time": "29 Jun 2004 — 10:04am",
      "content": "My friend,   \n   \nFonts are not software, they are documents.\n\n"
    },
    {
      "time": "29 Jun 2004 — 10:25am",
      "content": "Darrel,   \n   \nI don't know anything about open source software.   \nI was presenting a very traditional, spiritual even, version of morality. (Not something I necessarily subscribe to).   \n   \nIt's interesting that when MTV polled a group of music stars on the 7 deadly sins, the general response was, \"Those are sins?\"   \n   \nThis is a very venal age, is it not? -- and the the ease of digital copying has kicked the  out of traditional intellectual property rights. If we can't decide whether something is immoral, we won't be able to legislate against it, and as we can't police it anyway, just stick to busting B&E perps.   \n   \nBTW, I have not patented or copyrighted the PANOPTIC alphabet. (The particular Panoptica typefaces I created using the alphabet are, however, copyright, and the name is a trademark.)   \n   \nSo if other type designers want to create unicase, monowidth typefaces (can't think why, but...) please feel free to use the \"Panoptic\" model. Consider it \"open source\".   \n   \nThere, H\n\n"
    },
    {
      "time": "29 Jun 2004 — 3:07pm",
      "content": "personaly, i don't believe that giving something away for free is immoral. i don't beleive that accepting something for free is necesarily immoral either. i do believe that ingratitude is immoral, however.   \nwhy do some people offer free fonts? i think they do so for advertising purposes\n\n"
    },
    {
      "time": "29 Jun 2004 — 7:04pm",
      "content": "\\> _music is entertainment and fonts are tools._   \n   \nPersonally, I find many fonts extremely entertaining.   \n   \nAdditionally, many of the folks in the music industry that I have worked with are, quite frankly, tools.   \n   \n\\>_Fonts are not software, they are documents._   \n   \nGerald, in the sense that fonts are designed, developed, compiled, programmed, and distributed in a digital format... they can indeed be classified as software.\n\n"
    },
    {
      "time": "29 Jun 2004 — 9:13pm",
      "content": "\\>Fonts are not software, they are documents.   \n   \nGerald, you left the \"u\" out of \"founts\".\n\n"
    },
    {
      "time": "29 Jun 2004 — 10:54pm",
      "content": "Nick,   \n   \nThank you   \n   \nFounts are not software, they print documents.\n\n"
    },
    {
      "time": "29 Jun 2004 — 11:32pm",
      "content": "Of course, it's possible for people of good will to disagree on all sorts of things. I just note that the US Copyright Office and US Federal Courts have ruled pretty clearly that outline computer fonts ARE software. I gather many other countries have made similar determinations.   \n   \nIn the broader area of what it's okay to do, I'll note that in my book just because a given action doesn't benefit the type industry as a whole, doesn't necessarily mean it's either illegal or immoral.   \n   \nAs a separate point, there are plenty of things which I think are immoral, and would never do, that I do not believe should be legislated to make illegal. Governments legislating morality has always seemed like a bad idea to me.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "29 Jun 2004 — 11:47pm",
      "content": "Thomas,   \n   \n_In the broader area of what it's okay to do, I'll note that in my book just because a given action doesn't benefit the type industry as a whole, . . ._   \n   \nWhy doesn't that surprise me?   \n   \nBy this, I take it you are denying you are a communist.\n\n"
    },
    {
      "time": "30 Jun 2004 — 12:33am",
      "content": ""
    },
    {
      "time": "30 Jun 2004 — 7:50am",
      "content": "\\>Governments legislating morality has always seemed like a bad idea to me.   \n   \nI agree, because I think it's impossible to legislate morality, in the sense of trying to use legislation to change a person's value system.   \n   \nThere is a distinction between someone's broad morality (or value system) and anti-social, or socially disruptive behavior, which is frequently justified on moral grounds, and which government is entrusted to legislate against.   \n   \nA lot hinges around the issue of whether an \"immoral\" act has a victim. Governents are more likely to legislate against anti-social behavior when there is a clear victim.   \n   \nIt's one thing to say that the government has no business telling people how to behave when their behavior only effects themselves, quite another to use this as an argument to excuse activity which harms others.   \n   \nOf course, there are grey areas, such as \"is a foetus a person\" (sorry if the example offends, but I am not raising this as a partisan issue). And so the question with fonts is, does giving away free fonts on the internet harm anybody?\n\n"
    },
    {
      "time": "30 Jun 2004 — 10:33am",
      "content": "Brian, to be honest, I was a little surprised they could pay attention to my lecture. I got them in front of a white board and drew a few Bodoni letters and a few Garamond-ish forms to discuss stroke axis. Then I told them that this comes from the cant of a chisel-tip pen, and historical movements, etc. I followed with a few points about stroke contrast. Then, I pointed out x-height and character width. I used this to demonstrate the far more subtle differences between Times and Garamond, now that they understood the terms. Then I said, imagine the number of characters on a single page in a book. Now multiply that by the number of pages. Now you see why such little differences are so important, etc., etc.   \n   \nWith some dry-erase markers and about 10 minutes, I was able to communicate most of that info. However, I also had a willing and intelligent audience of one.   \n   \nI also got into kerning and kerning pairs, how many characters are actually in a font, and how many weights a truly versatile text font requires (emphasizing that the bold is not just a computer extrapolation, but an actual unique design, etc.). But that was more aimed at demonstrating why font families can cost 100s of dollars when you get them packaged with software that costs about as much as one font. That was probably an additional 10 minutes or so.\n\n"
    },
    {
      "time": "1 Jul 2004 — 12:23am",
      "content": "Free fonts are the result of free font formats. As are most of the indie foundries. How many foundries pay for the use of the PostScript Type 1 format? None. Hey, its free. But it wasn't always.   \n   \nThis whole argument is nonsense. If you piggie back on the format you have no reason for discussion.   \n   \nThere is no reason why PS1 or TT or OT should be free to foundries, developers, software providers, or whatever. The fact that they are, to me, makes the whole free font movement, or even the indie font movement, argument, nonsensical.   \n   \nYou are riding on someone's back for free and complaining about someone climbing on your back.   \n   \nGive me a break.   \n   \nGerald\n\n"
    }
  ]
}
