{
  "id": "53849",
  "title": "SP-font [PeGGO]",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": " ![](http://web.archive.org/web/20150417062030im_/http:/typophile.com/files/SP-font_SHOW_6425.png)\n\nA regular and very simple font done for write technical things, over machines, mechas or so.  \nI believe this work so clear in any case for short phrases or for long paragraphs.. if you have some coment or critique please let me know. I'm so thanksful for C&C.\n\nFor view details please check [this PDF FILE](http://web.archive.org/web/20150417062030/http:/typophile.com/files/SP-font_SHOW_TRC.pdf)\n\n",
  "author": "peggo",
  "time": "22 Jan 2009 — 2:30pm",
  "uid": "30293",
  "comments": [
    {
      "time": "1 Feb 2009 — 12:50am",
      "content": "verry nice, but i do think the lower case g could use some work\n\n"
    },
    {
      "time": "1 Feb 2009 — 7:40am",
      "content": "I like the g, but worry that the counters in e and a are too small.\n\n(And why is the v in \"reserved\" different?)\n\n"
    },
    {
      "time": "4 Feb 2009 — 5:24pm",
      "content": "Joostmarcellis: maybe I can use the other simple version of \"g\" instead of that \"g\" but When you see that square gliphs on first time, you can't sure which is wiuch... and I want to make several differences between number \"9\" and letter \"g\" when Alphanumeric series appear on same line.\n\nSpeter: About counters I believe that can be greater.. I remember try this and honestly now I see this need a better counter space. And .. oh god.. about that messy \"v\" when I write that I haven't ready my last version \"v\" and I temporary used another typo there and forgot change to last version, sorry. xD\n\nThanks guys for that useful observations, I'll try to improve taking your words.. =D  \nPeGGO\n\n"
    },
    {
      "time": "4 Feb 2009 — 11:26pm",
      "content": "as you can see opinons vary, in the and you should do what you want\n\nmaybe i can show you later on what i mean with the g, dont go for the normal g that makes it boring. The small counters shouldn't be a problem if you don't use to small\n\n"
    },
    {
      "time": "5 Feb 2009 — 1:41am",
      "content": "I fooled arround with something simular years ago, different curves but simular.\n\n ![](http://web.archive.org/web/20150417062030im_/http:/typophile.com/files/G-Alternate_4296.jpg)\n\n"
    },
    {
      "time": "12 Feb 2009 — 9:33am",
      "content": "oh no no, is not what I want only... I respect and hear your opinion.. so and I thank you for let me know about this other solutions.. =) you deserve my effort for this \"g\" and small counter topics, when I have ready a new examples I'll show here.. thanks for help me to improve y work.  \nPeGGO\n\n"
    },
    {
      "time": "15 Feb 2009 — 1:16am",
      "content": "heh in the end it only matters what you want, i'm looking forward to your other work\n\n"
    },
    {
      "time": "15 Feb 2009 — 8:19am",
      "content": "I like it, but there are two small things that stand out for me. I think perhaps D and O are a bit too similar. Is there anything you could do to differentiate them more - perhaps a bottom serif for the D? Also I'm not sure how well the long f fits in with the lower case. But of course these are both entirely subjective - perhaps they won't be problems for other people. I'll look forward to seeing any future versions.\n\n"
    },
    {
      "time": "11 Apr 2009 — 10:14pm",
      "content": "thank you a lot **Joostmarcellis** for pay attention on it.. :D\n\n**frunt** thanks for help me to improve this work.. since start I need this kind observations.. and well.. so I'm going to learning more.. I need review that details between \"O\" and \"D\" and \"f\" of course need a litle compare test with a short version. hope leave soon a new version of this work..!!! thanks for your time spent here.. :D  \nPeGGO\n\n"
    }
  ]
}
