{
  "id": "53860",
  "title": "New Orleans Signs",
  "forum": "jftorres's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20130629023540im_/http:/typophile.com/files/CIMG2959_4550.JPG)\n  \n\n ![](http://web.archive.org/web/20130629023540im_/http:/typophile.com/files/CIMG2971_6422.JPG)\n  \n\n ![](http://web.archive.org/web/20130629023540im_/http:/typophile.com/files/CIMG2972_3928.JPG)\n\nIn New Orleans, there are some pretty unique signs. Most of them, however, have a few characteristics in common. First of all, most signs in New Orleans appear old and worn, as in the Ignatius sign above. Some signs are on wooden planks hung in front of the business, others are places directly on the exterior walls of the buildings. Either way, the wood is warped or the paint is chipped. There are water marks and rust, dirt, grit and grime. This is because New Orleans is surrounded with a deep rooted tradition. New Orleans is unique because of its culture. In order to preserve the diverse cultural history of New Orleans, people tend to cling to their traditions and heritage.\n\nSecondly, Most of the signs in New Orleans are hand painted, as in the Reina Gallery sign above. The personal touch gives New Orleans an artful quality. New Orleans has always been an artful city. The business owners most often choose hand painted signs over big, gaudy mass-produced plastic signs. Another typical characteristic of signs in New Orleans is the presence of a Fleur de lis. One unique type of sign I found in New Orleans is the street signs. While most street signs in the US are printed on those little green sheets of metal and mounted on a post, in New Orleans, street signs are also tiled into the sidewalks. This also adds to the artistic nature of New Orleans.\n\n ![](http://web.archive.org/web/20130629023540im_/http:/typophile.com/files/CIMG2963_5265.JPG)\n\nHere is another sign that I found in New Orleans. I just thought that it was hilarious and I HAD to post it.\n\nHere are a few more interesting signs..\n\n ![](http://web.archive.org/web/20130629023540im_/http:/typophile.com/files/CIMG2953_3568.JPG)\n\n ![](http://web.archive.org/web/20130629023540im_/http:/typophile.com/files/CIMG2956_5124.JPG)\n\n ![](http://web.archive.org/web/20130629023540im_/http:/typophile.com/files/CIMG2962_4091.JPG)\n\n ![](http://web.archive.org/web/20130629023540im_/http:/typophile.com/files/CIMG2969_5330.JPG)\n\nOkay.. so typophile doesn't seem to want to work for me today. I inserted all of my pictures properly, about 7 times, but none of them are showing up on the preview. This is starting to get on my nerves, so if the pictures don't show up, I apologize.\n\n",
  "author": "jftorres",
  "time": "22 Jan 2009 — 9:01pm",
  "uid": "41417",
  "comments": [

  ]
}
