{
  "id": "53878",
  "title": "Queue terrible Ace Of Base song...",
  "forum": "GoodLoud's blog",
  "tags": [

  ],
  "content": "We had to make our rounds through the city and take photographs of different signage. I don't think that these signs are necessarily \"New Orleans\" but they were just some signs I have always thought were particularly neat.  \nFirstly, I thought it was pretty funny how there is a sign for a sign making business, also it has a sort of vintage quality. But mostly it just tickles my ribs cause its a sign... advertising signs... hopefully I'm not the only one who gets joy out of that.  \nMike the Bike Guy has a nifty sign too, clever really. 'Mike' and 'Bike' share three letters, and all he did was keep the '-ike' on the sign once and have both the 'M' and 'B' there sharing that ending.  \nThe Royal Sonesta Hotel in the French Quarter doesn't have a sign that is really that 'New Orleans,' rather its reminds me of old-timey New York City Broadway signs with its retro typeface and lightbulb-filled interior. Something about it makes me feel classy, like I should expect to see Kong carrying Fay Wray up the Empire State Building. Again, hopefully thats not just me.\n\nI'm not really sure what to make of things when people ask about stuff (in this case, signs) that are 'New Orleans.' When I think of signs in New Orleans, old saloon-style typefaces, classic Industrial Revolution-era and elegant carvings come to mind. However, not many of this type of sign are present anymore, and have been replaced with newer signs. In my opinion, New Orleans signs could be compared to signage in many other southern cities.\n\n ![](http://web.archive.org/web/20131022051022im_/http:/typophile.com/files/SIGNS_6122.gif)\n\n",
  "author": "GoodLoud",
  "time": "23 Jan 2009 — 7:38am",
  "uid": "41397",
  "comments": [
    {
      "time": "27 Jan 2009 — 10:55am",
      "content": "Hurricanes tend to also destroy some of the great signage every year!\n\n"
    },
    {
      "time": "5 Feb 2009 — 12:07pm",
      "content": "Very true. Its unfortunate.\n\n"
    }
  ]
}
