{
  "id": "539",
  "title": "Graphology",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anyone knowns any designer/typographer who use the Graphology knowledge of Handwriting Analysis on typographic design?   \n   \nCant it be really a usefull tool, what do you think about it guys?   \n   \nMH\n\n",
  "author": "Miguel Hernandez",
  "time": "6 Jul 2003 — 11:53pm",
  "uid": "1109",
  "comments": [
    {
      "time": "7 Jul 2003 — 11:26am",
      "content": "Graphology is useless pseudoscientific cack claiming to tell us something about a person's innermost drives based on their handwriting. It is an insult to both science and art. I beg you, please do not waste any of your time on it.   \n   \nThere is an organization that offers training in graphology claiming it can be a lucrative expert-witness gig in court. This is also cack. There are true Questioned Document Examiners who can detect (using conventional scientific means) whether two samples of writing were produced by the same hand, but their training is completely different from \"graphology\" and they regularly distance themselves from graphologists. But those not familiar with this conflict are easily led to confuse the two groups. Questioned Document Examination is a worthwhile career to pursue (although about as livable as type design) whereas graphology is not. Know the difference.   \n   \n [http://www.abfde.org/fde.htm](http://web.archive.org/web/20131010223219/http:/www.abfde.org/fde.htm)   \n   \nGraphology belongs in the same bucket as New Age religions, UFO and conspiracy theorists, homeopathic medicine and magnetic insoles.\n\n"
    },
    {
      "time": "7 Jul 2003 — 12:24pm",
      "content": "\\> conspiracy theorists   \n   \nPlease don't use that blanket term. It breeds complacent social idiocy.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Jul 2003 — 2:58pm",
      "content": "I've heard stories of employers who request handwriting samples from job candidates... they believe in this - if it is - crap?\n\n"
    },
    {
      "time": "7 Jul 2003 — 11:47pm",
      "content": "_I've heard stories of employers who request handwriting samples from job candidates..._   \n   \nThis is part of a screening process by which intelligent people looking for a job can identify stupid companies for whom they don't want to work.\n\n"
    },
    {
      "time": "8 Jul 2003 — 8:24am",
      "content": "[Do it yourself Handwriting analysis.](http://web.archive.org/web/20131010223219/http:/www.uncommongoods.com/item/item.jhtml?catId=3&itemId=12479&nextItemIndex=19&style=&pageId=144&templateId=2&famName=books%2B%2B%2Bdecks&subCatId=32)   \n   \nIf anybody analyzed my handwriting they would probably find out what a lazy bum I am.\n\n"
    },
    {
      "time": "5 Mar 2011 — 8:49pm",
      "content": "I'm fascinated by the fact that I haven't read anything about people trying to do analysis on other people's calligraphy, in the same way that they analyze handwriting. This has me very perplexed because in calligraphy, we can often tell who wrote what, even if we are all scribing in the same style of writing.\n\nI'm still at a state where I'm not completely sold on what I have read, and I haven't applied what I've learned to my work. Still, I find this subject to be really interesting.\n\nI've noticed reading extensively on it, that I tend to agree with the graphology experts who have extensive psychology backgrounds and apply it to the analysis they do. I feel the more modern approaches to Graphology make a lot more sense because they realize that a lot of people think the subject is perceived as a irrelevant or inaccurate.\n\nLila\n\n"
    },
    {
      "time": "5 Mar 2011 — 8:55pm",
      "content": "Calligraphy is far less varied/individual than handwriting, hence less insightful.\n\nhhp\n\n"
    },
    {
      "time": "6 Mar 2011 — 10:55am",
      "content": "I agree, that writing in more traditional hands can be less individual because we are striving to write in a certain way. However, when a calligrapher is just writing in their own style using a broad edge or pointed pen, doesn't it have the potential to reveal a lot about them?\n\nDoes it really matter if they are writing with a crayon versus writing with a ballpoint pen?\n\n"
    },
    {
      "time": "6 Mar 2011 — 11:02am",
      "content": "The thing is calligraphy instruction is much more formal and imitative than the teaching of handwriting (at least these days). For example, our oldest does innovative things with some of his letters and his teachers don't complain (luckily), but when I took a calligraphy class there was essentially only one way to make a letter.\n\n\\> Does it really matter if they are writing with  \n\\> a crayon versus writing with a ballpoint pen?\n\nI would say the more complex a tool the more potential for revelation.\n\nhhp\n\n"
    }
  ]
}
