{
  "id": "53962",
  "title": "Type use for dummies",
  "forum": "Release",
  "tags": [

  ],
  "content": "I'm just starting freelance. For my whole design career I worked in an environment where I had three type families to work with, and that's it, so I'm ignorant (though wanting to learn) to the legalities of using type.\n\nIf I design someone's resume (and get paid for it), I would need commercial licensing for any fonts I use, correct? If I don't get paid, that would fall under personal use?\n\nRight now I'm volunteer designing for a non-profit. They have no style guide, they have a pretty unattractive logo (that can't be changed), I'm starting from scratch trying to give them well designed publications from here on out. They use Arial and AvantGarde in the logo. Am I allowed to use those fonts that the company has to create the style guide and other publications?\n\nOne more topic... If I purchase fonts with commercial licenses, am I then allowed to use them for any client on any project? And if the font is in a logo can the client then use their logo, that I created, however they want?\n\nThanks, I know it's a lot of questions.\n\n",
  "author": "<a href=\"/web/20100203033128/http://typophile.com/user/7895\" title=\"View user profile.\">aheep</a>",
  "time": "<br>",
  "uid": "7895",
  "comments": [
    {
      "time": "",
      "content": "In general commercial fonts, and system fonts, as well as legitimate open source fonts can all be used in producing work that you get paid to produce, and that your clients can print, publish, and generally commercially exploit. Many licenses don't even mention this because, er, that's what fonts are for. Occasionally you might find a commercial font license that includes some kind of exclusion - but these are rare. General advice is read the license (AKA the EULA.)\n\nWhere things do become somewhat murky is the free fonts you find floating around on the web, which often come with no written license, or one that makes little sense. So in short paying your $20 for a font doesn't guarantee a well written EULA but it certainly increases the odds.\n\n"
    },
    {
      "time": "",
      "content": "also, i have bought fonts from some vendors and read that their EULA have won't allow some things like logo use, but as i work for a non-profit and thought this was a little weird, i simply emailed the font designer and he cleared it up for me.\n\npoint being - being in doubt ask.\n\nall the best!\n\n"
    }
  ]
}
