{
  "id": "53976",
  "title": "Ligatures",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi there typophiles I was hoping that you could help me.\n\nI'm currently working on a little project involving ligatures and I'm struggling to find some nice fonts (sans or serif) that have a good amount a ligatures in them.\n\nIdeally I'd like something with the standard ones in and maybe ct fy fä etc. Free or something that I might already have would be good but I dont mind buying a nice font that will work. (though being a student not too expencive)\n\nSo I was hoping that people on here could help me out and suggest a few.\n\nthanks also I'm trying to make a full list of ligatures and so far I have:\n\nTh ch ck ct fä ffä fb ffb ff fh ffh fi ffi fj ffj fk ffk fl ffl ft fft ftt tt gi gj im in  \nip ir it iw ix iy sh sk sp st ky fl gg gy oe sp ggy ft st ft ip py tw tt tw tty  \nwww & æ œ ae ee AV fs fs ae THE AE  \nAA MB OC MD ME FF OG HE FI UB NK FL LA NT OO MP TE TR UD TT UP VA TW UL TY UR\n\nif people would like to add to the list that would be brilliant. (please note font suggestions dont have to have all of these)\n\nThanks\n\n",
  "author": "itsluke",
  "time": "26 Jan 2009 — 4:21am",
  "uid": "41753",
  "comments": [
    {
      "time": "26 Jan 2009 — 4:35am",
      "content": "[Mrs. Eaves](http://web.archive.org/web/20150120233358/http:/www.emigre.com/EF.php?fid=109) from Emigre? It would make a good investment.\n\n"
    },
    {
      "time": "26 Jan 2009 — 4:36am",
      "content": " ![](http://web.archive.org/web/20150120233358im_/http:/typophile.com/files/PMEJLigR_6061.GIF)\n\n"
    },
    {
      "time": "26 Jan 2009 — 4:55am",
      "content": "Thanks, I've been looking for that font but couldn't remember the name, a bit on the pricey side but I guess I could just get the ligatures package for what I want to do. Any other suggestions?\n\n"
    },
    {
      "time": "26 Jan 2009 — 5:40am",
      "content": "Quite a few of Ale Paul's scripts at Sudtipos – [www.sudtipos.com](http://web.archive.org/web/20150120233358/http:/www.sudtipos.com/ \"www.sudtipos.com\") – sport huge amounts of ligatures, but I guess that's not quite what you're after. Jeremy Tankard's [Aspect](http://web.archive.org/web/20150120233358/http:/www.typography.net/type/aspect) is a ligature heavy sans, but it's really ugly. Also [Feijoa](http://web.archive.org/web/20150120233358/http:/klim.co.nz/feijoa_samples.php) by Kris Sowersby have some unusual ones.\n\n"
    },
    {
      "time": "26 Jan 2009 — 5:45am",
      "content": "Check out this thread as well: [http://www.typophile.com/node/13838](http://web.archive.org/web/20150120233358/http:/www.typophile.com/node/13838 \"http://www.typophile.com/node/13838\")\n\nAnd I'll have to retract my previous statement about Jeremy Tankard's Aspect. Check out this lovely example: [http://www.benmulkey.com/vac.jpg](http://web.archive.org/web/20150120233358/http:/www.benmulkey.com/vac.jpg \"http://www.benmulkey.com/vac.jpg\")\n\n"
    },
    {
      "time": "26 Jan 2009 — 5:50am",
      "content": "Thanks\n\n"
    },
    {
      "time": "26 Jan 2009 — 8:17am",
      "content": "\\>I’m trying to make a full list of ligatures\n\nA list of languages you care about might be useful. As soon as you get beyond English the combinations (esp accented ones) will change.\n\n"
    },
    {
      "time": "26 Jan 2009 — 8:40am",
      "content": "Mainly Roman ligatures or ones that you would come across in england, so for instance though not english you would probably come accross spanish and french words in editorial etc if it was appropriate, where as you proably wouldn't come across arabic or chinese.\n\nHope that makes sence.\n\n"
    },
    {
      "time": "26 Jan 2009 — 11:14am",
      "content": "[http://new.myfonts.com/fonts/processtype/lingua/](http://web.archive.org/web/20150120233358/http:/new.myfonts.com/fonts/processtype/lingua/ \"http://new.myfonts.com/fonts/processtype/lingua/\")  \nBTW, Lingua's ligatures are based on linguistics.\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2009 — 3:18pm",
      "content": "_I’m trying to make a full list of ligatures_\n\nI'm trying to make a full list of dance steps.\n\nA ligature is a technical solution (one of a number of possible solutions) to implement in type the phenomenon of ligation in writing systems. This is understood when one realises that everything that involves the joining or merging of letters in writing can be described without using the term ligature, as varying kinds of ligation, whereas in type one needs a word to describe the _thing_ that implements ligation, whether it be a piece of metal or a glyph ID in a GSUB table.\n\nA full list of ligatures is, like a full list of dance steps, an empirical impossibility: one can conceive of it, but as soon as one considers that any new type style, and certainly any new writing style, may lend itself to new kinds of ligation, the impossibility of compiling an exhaustive list of ways to implement these as ligatures is evident. One may compile a list of common or garden ligatures, or even rare species encountered in the wild, but even this is not useful unless one is also documenting the styles of type or writing in which they occur and to whose ecosystems they belong (sorry to switch metaphors from dancing to botany). I have, for example, a fairly exhaustive summary of the ligations that occur in Byzantine cursive miniscule, and have seen similar lists of those that occur in Devanagari when used to write Sanskrit, but these lists are particular to both style and language. The summary of Byzantine cursive ligation is not a 'list of Greek ligatures'; it has no general application to the Greek script.\n\n"
    },
    {
      "time": "26 Jan 2009 — 6:49pm",
      "content": "<cite> BTW, Lingua’s ligatures are based on linguistics.</cite>\n\nWhat exactly does that mean?\n\n"
    },
    {
      "time": "26 Jan 2009 — 7:17pm",
      "content": "[http://www.processtypefoundry.com/typefaces/lingua/info.html](http://web.archive.org/web/20150120233358/http:/www.processtypefoundry.com/typefaces/lingua/info.html \"http://www.processtypefoundry.com/typefaces/lingua/info.html\")  \nBTW, the idea for that \"ligature counter\" came from yours truly.  \nAnd the Letterror boys took up the idea from Olson shortly afterwards.\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2009 — 8:07pm",
      "content": "I still fail to see how it's based on linguistics. (Perhaps because I'm a linguist.)\n\n"
    },
    {
      "time": "26 Jan 2009 — 8:19pm",
      "content": "The letter combinations meriting ligature treatment were not decided by the physical criteria of letter shapes, but according to those combinations most frequent in language.\n\n"
    },
    {
      "time": "26 Jan 2009 — 8:36pm",
      "content": "_...according to those combinations most frequent in language._\n\nLetter combinations don't have frequency in language: they have frequency in spelling.\n\nConsider the Lingua n\\_g ligature: it indicates no more distinction between siNGing and raNGoon than the unligated letters do. Or consider the word 'When' in the sample at the top of this page:\n\n[http://www.processtypefoundry.com/typefaces/lingua/info.html](http://web.archive.org/web/20150120233358/http:/www.processtypefoundry.com/typefaces/lingua/info.html \"http://www.processtypefoundry.com/typefaces/lingua/info.html\")\n\nIt is displayed with the glyphs W h\\_e n, but linguistically the h forms a consonant sound with the W and has no independent connection to the e as suggested by the ligature.\n\nI apply frequency analysis for determining sets of Devanagari conjunct ligatures, but in that case there are contextual layout behaviours based on those ligatures which differ from the layout of the same letter sequence using half forms, so having a good idea which ligatures are important to include is critical. But I've never thought of this analysis as 'linguistic', despite having a Sanskritist on my team.\n\n"
    },
    {
      "time": "26 Jan 2009 — 9:15pm",
      "content": "Steve, what Nick said.\n\n\\> A ligature is a technical solution (one of a number of possible solutions)  \n\\> to implement in type the phenomenon of ligation in writing systems.\n\nMimicking handwriting facilitation might be what people  \nusually think of, but there are better reasons to ligate.\n\n\\> But I’ve never thought of this analysis as ’linguistic’\n\nThat's OK - you still know what we mean. :-)\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2009 — 11:13pm",
      "content": "_Letter combinations don’t have frequency in language: they have frequency in spelling._\n\nLingua references language to draw a contrast between the traditional criteria for ligatures (aesthetic, typographic) with its non-visual methodology; language, in this comparison, being implicitly non-visual. This core idea would not have been so well expressed if the face had been named Spella and character frequency explained in relation to spelling.\n\n... [in] _W h\\_e n, ... linguistically the h forms a consonant sound with the W and has no independent connection to the e as suggested by the ligature._\n\nLinguistically\\*, the \"h\" forms a frequent pairing with \"e\"--this is what is indicated by their ligaturing in Lingua, if any suggestion of linguistic significance is called for.\n\n\\*This is the normal usage, even though \"Spellingistically\" may be more accurate. For instance, [this document](http://web.archive.org/web/20150120233358/http:/www.math.uic.edu/~leon/mcs425-s08/handouts/char_freq2.pdf) is not named \"Frequency of Character Pairs in English Spelling Text\".\n\n"
    },
    {
      "time": "27 Jan 2009 — 2:56am",
      "content": "In our language (hungarian) can be used the \"fü\" or \"fö\" liagture too.\n\n"
    },
    {
      "time": "27 Jan 2009 — 11:33am",
      "content": "[http://www.fontshop.com/fonts/downloads/presence\\_typo/classica\\_prestige/](http://web.archive.org/web/20150120233358/http:/www.fontshop.com/fonts/downloads/presence_typo/classica_prestige/ \"http://www.fontshop.com/fonts/downloads/presence\\_typo/classica\\_prestige/\")\n\nScroll down for a huge selection of Cap ligs.\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:17pm",
      "content": "Hrant: _Mimicking handwriting facilitation might be what people usually think of, but there are better reasons to ligate._\n\nNote that I referred to 'the phenomenon of ligation in writing _systems_', not to handwriting. By writing system, I mean the analysable totality of the graphical system of a script, which necessarily incorporates different media and technologies, not just writing by hand.\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:31pm",
      "content": "Nick: _Linguistically\\*, the “h” forms a frequent pairing with “e”—this is what is indicated by their ligaturing in Lingua, if any suggestion of linguistic significance is called for._\n\nNo, the h forms a frequent pairing with e in English spelling. But linguistically this is neither significant nor interesting, because it does so in larger combinations whose pronunciations are unrelated -- che ghe phe she the whe etc. -- and in all those combination the pairing with the preceding consonant is more significant, in terms of what it represents in language, than the pairing with the e.\n\nIt's fine to use terms loosely much of the time, but when a word is used, as I believe it is in the case of the Lingua font, to suggest something that is not in fact the case -- that the font is the product of linguistic analysis --, then I think one needs to insist on a more precise usage in order to be able to critically engage with that suggestion.\n\n_For instance, this document is not named “Frequency of Character Pairs in English Spelling Text”_\n\nBut 'English Language _Text_ already implies that something other than language is being analysed, i.e. frequency of letter pairs in text, according to the spelling norms of written English. Note that this document is a handout in a mathematics class on cryptography, not in a linguistics class. Linguistics largely ignores conventional spelling.\n\n"
    }
  ]
}
