{
  "id": "54012",
  "title": "Line Break Rhetoric",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "If a line break creates a hiccup in readability, does it make for bad typography?\n\nOn a client's business card:\n\n_special gifts  \nadorned with  \npuppy and teddy  \nbear illustrations_\n\nThe measure is short to showcase a portion of the client's illustration.\n\nIn visual context, the line breaks are exactly where they need to be, but the interruption of \"teddy bear\" is unnerving to me.\n\nOnly, not as unnerving as the alternative...\n\n_special gifts  \nadorned with  \npuppy and teddy bear  \nillustrations_\n\nThoughts?\n\n",
  "author": "microspective",
  "time": "26 Jan 2009 — 8:24pm",
  "uid": "14473",
  "comments": [
    {
      "time": "26 Jan 2009 — 10:24pm",
      "content": "Can you go to 5 lines?\n\nBTW, try an ampersand.\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2009 — 11:31pm",
      "content": "Are they as good as chimp pix?\n\n_special gifts  \nadorned with  \nillustrations of  \npuppies and  \nteddy bears_\n\nor Hrant's:\n\n_special gifts  \nadorned with  \npuppy and  \nteddy bear  \nillustrations_\n\n"
    },
    {
      "time": "27 Jan 2009 — 7:53am",
      "content": "Excellent! Thanks, gentlemen.\n\nHrant, I've got the curse of the Grammar Nazi, and I can't conscionably use an ampersand if it's not in a title or the like.\n\nThese are fantastic solutions to the specific problem I used as an example. But what about the theory behind it? What if I did have to keep it to four lines? When it comes to design, is it better to break the line for readability and have an inappropriately ragged edge, or is it best to keep them looking balanced and break up words that should probably be kept together?\n\n"
    },
    {
      "time": "27 Jan 2009 — 8:24am",
      "content": "\\> is it better to break the line for readability\n\nThe idea of readability tends to apply to long, immersive text only. For such short text looks surely trumps readability every time. Frankly any problem people will have reading that smoothly will be momentary and immediately forgotten.\n\nBTW, if you center the text you can (and in fact often should) have great variance in line length.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2009 — 9:14am",
      "content": "\\> _...text looks surely trumps readability every time._  \nI think you're right.\n\n\\> _...center the text..._  \nAgreed! Unfortunately, it does not apply in this particular case, as it is only on a business card, left edge, to make room for the illustrator's graphic on the the right.\n\n"
    },
    {
      "time": "27 Jan 2009 — 9:28am",
      "content": "Do you need a hyphen with that compound modifier?\n\n"
    }
  ]
}
