{
  "id": "54015",
  "title": "Marquet No. 14 et Titulaires de Theophile Beaudoire",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "This is a continuation of a previous thread: [http://typophile.com/node/7596](http://web.archive.org/web/20150417104157/http:/typophile.com/node/7596 \"http://typophile.com/node/7596\").\n\nWhere you will notice the biggest change is in the italics, which are really what are most this face. The nice thing about having made the contrast very low in the roman is that it gives an even, dark impression that well suited to academic papers which require to be set double spaced.\n\nI had pretty much stopped working on this for a few years except for minor tweaks as I used if for my academic papers. I've refined the outlines, improved the kerning (maybe going a bit overboard), added some IPA characters, accents, logical symbols, etc. Currently I am developing lining figures and am trying to prep these fonts for release. (It is a lot of work!) I may release the titling caps with just caps and punctuation for free and then sell the roman and italic as companion faces. Haven't quite worked that out yet.\n\nIf you print this out I think you will see that the roman reads very well, with a dark, even color and good legibility. The roman strikes me as quite neutral, making it a typeface well suited to the demands of academic publishing in the humanities; the italic adds a pleasant contrast to the roman but needs redesigned figures and improved spacing.\n\nI will post more samples over the next while for italic issues and the design of the lining figures. Special thanks goes out to Hrant who really helped and encouraged me so much back when I started work on this (and back when you were posting 250 times per day). I knew absolutely nothing about font design then, and have learned much thanks to your help as well as the help of other typophilers.\n\nI have also made a few other fonts that I will post for discussion, although this crit boards seem pretty slow these days.\n\n| Attachment | Size |\n| --- | --- |\n| [Meditations-Marquet.pdf](http://web.archive.org/web/20150417104157/http:/typophile.com/files/Meditations-Marquet.pdf) | 59.56 KB |\n| [MarquetTitling2009-Spec.pdf](http://web.archive.org/web/20150417104157/http:/typophile.com/files/MarquetTitling2009-Spec.pdf) | 60.9 KB |\n\n",
  "author": "nepenthe",
  "time": "26 Jan 2009 — 11:13pm",
  "uid": "4886",
  "comments": [
    {
      "time": "29 Jan 2009 — 4:21pm",
      "content": "The Display or Titling version will be available soon, hopefully within the next week. I attached a sample to the initial post. I guess I will make it available on MyFonts, but I have to decide what I want the EULA to be.\n\n"
    },
    {
      "time": "30 Jan 2009 — 12:46am",
      "content": "it works pretty wel, nicely balanced\n\n"
    },
    {
      "time": "30 Jan 2009 — 9:56pm",
      "content": "Has it been more than four years?! Wow. I certainly missed that 5! Grrr...\n\nI wish I could claim some sort of magnanimity for helping out previously, but frankly I do it because I enjoy it. On the other hand I'm certainly happy to hear you say it's been useful to you. I do hope more people will join in though. Font crits are still the most valuable thing about Typophile.\n\n--\n\nThis has a very old, confident air about it. Reminds me of Quadraat in that way, although this is more... British; it's quaint in a different dimension. I'll have to print it to get a good feel for its color and spacing, but it looks promising onscreen. As for the italic, it's the sort that appeals to me, but it does seem quite loose. Is that intentional?\n\nMost of all: could you provide a character set?\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2009 — 4:07pm",
      "content": "Wow, this is a truly _gorgeous_ face. Will it be available for purchase? I'd buy this for that marvellous G alone. I have to agree that the italic could benefit from a little tighter spacing, though. Otherwise, I cannot fault this at all. Great work!\n\n"
    },
    {
      "time": "23 Mar 2009 — 10:29am",
      "content": "Although I find this typeface pretty nice don't you think the stem of the t is a bit too large in the roman? See the difference between the t, the f and the r. Keep going.\n\n"
    },
    {
      "time": "23 Mar 2009 — 11:24am",
      "content": "I don't want to discourage you but I take a second look at your typeface and I'm pretty sure there is something that could improve your typeface. The stem of some letter are too wide or the rounded letter are too thin. Take a closer look at the word like “not, brought, very, sides” to name a few. However the oblique one, v,w, x fit well with the e, o, s but the t, h, r don't.\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:29pm",
      "content": "Sindre, thanks for the compliment :) I'm assuming you mean the titling font. I like it quite a lot and rarely use other fonts for titles.\n\nAndré, thanks for the feedback. Are you referring to the text weight or the display? I'll have to ask you to clarify what you mean so that I know how to respond to you. If you're saying that the h and n are too wide in relation to the round letters, I think you'll find that quite the opposite is true in relation to many contemporary faces. If I have a minute, I try to comp a comparison so we can discuss it that way.\n\nKeep in mind that my goal for this was to produce a faithful revival, rather than an lovely text face. It turns out, however, that it is highly useable. I've used it in as bad conditions as 9pt at 600dpi, and it still holds up. It is certainly more robust than it is beautiful! (I'm talking strictly about the text weight here.)\n\nAlso bear in mind that I've done _very_ little work on the titling lowercase. I'm not even sure I will include it in a final release. Any critique for aspect?\n\n"
    },
    {
      "time": "24 Mar 2009 — 6:07am",
      "content": "I was referring to the width of the stem of some letters for the text weight. Yesterday the print out of the text weight shows the t, r and h to name a few, with a stem wider than the other stem. That thing showed a weird effect on reading the text giving not a regular gray. This morning I printed the same page and the stem of the latter was better but still too wide. I just wanted to say to you this, be sure your stem are the same width on all letters to assure a regular gray and an easier readability. It also could be a print out problem, so probably what I saw it's not real.\n\n"
    },
    {
      "time": "24 Mar 2009 — 9:55pm",
      "content": "Andre, this is not good that the stems are not printing consistently for you. I wonder why this is? Mathematically, the stems are very simple in this font which why I thought I it gives good results at a variety of resolutions. Both straight and bowl vertical stems of the lowercase letters are all the same, 80 units on a 1000unit em. They can be the same because of the angle of the stroke on the bowls. The o, being vertical, has heavier sides of 96. I have the basic stems defined accurately in the font info, so I am not sure why it would be printing inconsistently. It might be that to produce a more even color I would have to adjust the contrast of some of the letters. But then I would lose authenticity.\n\nThanks for taking such a close look at it. Any comments on the lowercase display? I haven't given that part much thought yet.\n\nP.S. Sorry for accidentally typing your name wrong last post!\n\n"
    }
  ]
}
