{
  "id": "54026",
  "title": "Logo needs REAL help",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello friends\n\nI am trying to learn as much as possible about logo design... it is really interesting\n\nthis is my first logo, give me your thoughts\n\nfirst... what do you think of the idea? ok? good?... or under average?\n\nthen, the font... I always find a huge problem when it comes to fonts\n\nit is something experimental... so feel free to say anything might help me to improve  \nmy learning process\n\nthanks in advance\n\nthere are new designs in the second folder... have a look plz\n\n| Attachment | Size |\n| --- | --- |\n| [dotmanagement.pdf](http://web.archive.org/web/20131101113344/http:/typophile.com/files/dotmanagement_0.pdf) | 465.3 KB |\n| [dot management 2.pdf](http://web.archive.org/web/20131101113344/http:/typophile.com/files/dot%20management%202_0.pdf) | 120.07 KB |\n| [dot management 3.pdf](http://web.archive.org/web/20131101113344/http:/typophile.com/files/dot%20management%203_0.pdf) | 604.61 KB |\n\n",
  "author": "illustarellite",
  "time": "27 Jan 2009 — 6:18am",
  "uid": "41563",
  "comments": [
    {
      "time": "27 Jan 2009 — 7:17am",
      "content": "Hi,\n\nYou could play with the eye/perception and in this way create a visual reflection – linking with the ability to manage.\n\n ![](http://web.archive.org/web/20131101113344im_/http:/typophile.com/files/Perception_3431.jpg)\n\nUsing this above, or not... but the o in Dot is also a 'dot'. But I'm sure you've seen that.\n\nWhich do U want to emphasise? ability to manage or the unique name 'Dot'?\n\n"
    },
    {
      "time": "27 Jan 2009 — 7:18am",
      "content": "Hi\n\nOf all those logos, the third one down appeals to me the most, but I think you probably need to keep going with it and develop it more.\n\nAlso is it me or is the O in dot doing odd things? And I think you need to tighten up the space between the first a and the first n in management.\n\n"
    },
    {
      "time": "27 Jan 2009 — 7:27am",
      "content": "Also...\n\n ![](http://web.archive.org/web/20131101113344im_/http:/typophile.com/files/DotsInOrder_5905.jpg)\n  \nit is intersting to know that the size/distance of a space between items is what makes our brains group them together.  \nAgain this could be used to reflect the ability to manage 'things'.  \nI'm very fascinated by perception. The eye sees, but it transmits different information to the brain. One kind of information is the info about size, shape, colour and alike. The other is orientation, where it's placed and it's position in relation to other objects.  \nThat's is why illusions confuses us. \n"
    },
    {
      "time": "27 Jan 2009 — 8:26am",
      "content": "I think you're onto something with the first logo. However you need to work on the placement of the dots within the letters - on screen the center of the o looks off-center and the dot of the t looks a bit wonky (yep, that's a technical term!). I would suggest using a dot in the center of the d as well to see how that looks.\n\n"
    },
    {
      "time": "27 Jan 2009 — 9:45am",
      "content": "illux\n\nlove your nickname... it plays with perception.. also reminds me of mine ;)\n\nabout the 0 in dot.... I tried to take advantage but I gave up...\n\nvisual perception... a good way to start again... I think this may bring some thoughts.... ok one thing i have to ask about.... what is the link between perception & managing? do you mean that a good perception leads to god managing?\n\nfor the logos i did... all of them deals with the name of dot... now i will work on the other side youve mentioned... management\n\naha aha... now i get you ... you mean the ability to connect dots for example = the ability to manage and understand.....\n\nthanks for the precious advices ... this is what i had in college ' cognition '... thanks alot you have been really helpful\n\npeter\n\nwhich one is the third down? i should add numbers....sorry\n\nsure... i will work on it & show you the results\n\nalso i will try to work on the O .......... thnx alot\n\n"
    },
    {
      "time": "27 Jan 2009 — 10:22am",
      "content": "Yes, yes. You got it. To manage. To show that the company totally manage what they do... by totally manage their logo. illix it is : )\n\n"
    },
    {
      "time": "29 Jan 2009 — 2:41am",
      "content": "I did some new designs\n\ntried to use the O as you all mentioned\n\nand the perception...\n\nSo? what do u think ?\n\n"
    },
    {
      "time": "30 Jan 2009 — 1:40am",
      "content": "What does the company do? What kind of feeling do you want it to have?\n\n"
    },
    {
      "time": "30 Jan 2009 — 1:42am",
      "content": "I'm looking at it now, but needs to know the kind of business in order to give you constructive feedback ; )\n\n"
    },
    {
      "time": "30 Jan 2009 — 2:49am",
      "content": "I've done 'some thoughts'... you can use them if U like. I think the dot-thing sld be a subtle thing, not in the face of the viewer. More like a ahhhh---now I get it... thing. After all if it was my company I'd prefer to show that I'm good at managing. And U have to decide if the logo exist with or without the whole company name. If it with the whole name always – then U cld take advantage and create a very sophisticated logo, bacause the name will then explain the 'squiggle'.  \nI'll try to link to my doc... let's see.... [doty.jpg](http://web.archive.org/web/20131101113344/http:/typophile.com/wiki/doty.jpg)\n\n"
    },
    {
      "time": "30 Jan 2009 — 2:56am",
      "content": "Does my doc show when U click on it?  \nI read the guide, I don't understand how to link to a file I've got on my 'puter'?? double square bracket... and then what, with the name inside...? but how can that be enough to link to the work?\n\n"
    },
    {
      "time": "30 Jan 2009 — 5:06am",
      "content": "I thought that these two were the most promising:\n\n ![](http://web.archive.org/web/20131101113344im_/http:/typophile.com/files/Picture1_3813.png)\n\n ![](http://web.archive.org/web/20131101113344im_/http:/typophile.com/files/Picture2_4851.png)\n\n"
    },
    {
      "time": "30 Jan 2009 — 6:53am",
      "content": "it provides general management services for other companies... & the feeling is ... umm..  \ni would like it to be simple, a little trick in the name.. but also formal and all business.\n\nand yes ... i wish it would be more subtle\n\nI open youe decument... i can see the first 4 design but i think something is missing in the last 4 ideas because they look the same.... i think something is missing.  \nyes i get you when u say putting the name of the company will allow the logo to be more subtle...\n\nthnx illix\n\nheheh... i dont know how to add an image!!\n\n"
    },
    {
      "time": "30 Jan 2009 — 6:58am",
      "content": "paragraph\n\nwhich one would you choose from the 2 ?\n\n& what about the font?\n\n"
    },
    {
      "time": "30 Jan 2009 — 9:28am",
      "content": "illix's sketches got me thinking - have you considered something like \".management\" or stylizing 'g' into a couple of dots ?\n\n"
    },
    {
      "time": "30 Jan 2009 — 12:05pm",
      "content": " ![](http://web.archive.org/web/20131101113344im_/http:/typophile.com/files/doties_3838.jpg)\n here it is.  \nI'll explain short.. \n"
    },
    {
      "time": "30 Jan 2009 — 12:17pm",
      "content": "top right:  \nthe grey-dot-name has same colour as the background bar, therefore belongs/has a relationship with it. The bar bar is curved (here only in one end) and it could be understood as being a 'slice' of a massive dot.\n\nBlack bar with grey name:  \nwas an earlier stage. And experimenting with the dot, as a dot only. And a thought that missing letters rarely is an obstical in reading, one often 'fill in' the missing parts in order to make up a meaning.\n\nBlack dot:  \njust as it is, using same process as above.\n\nNext 3:  \nPlaying with the negative space in the d. And funny enough.. placed behind it, and moved a bit - it's an door opening inwards for the viewer. A nice welcome I thought, maybe not appropriate... U know.\n\nLast 4:  \nthe grey ink-dot could on all items produced be placed at a different position. The Biz card might have the dot below the name, the letterhead above, the comp-slip behind it and so on... managing the dot in reality. I made it 'ink-like' to create a contrast to the typed out name, to add life and emotion/excitement.\n\n: ) roger over\n\n"
    },
    {
      "time": "30 Jan 2009 — 1:42pm",
      "content": "No. 4 from the original post has the most potential. What if you tried some different fonts, maybe gave all caps a shot? You could easily use the 'dot' of the O to make it a 2-color design.\n\n"
    },
    {
      "time": "30 Jan 2009 — 9:18pm",
      "content": "Yep, try different fonts and colour combinations. The first one is clearer, the second one more fun. The 'back to front' t worries me a bit, though. How about something like this:\n\n ![](http://web.archive.org/web/20131101113344im_/http:/typophile.com/files/dots_3414.png)\n\n"
    },
    {
      "time": "31 Jan 2009 — 3:34am",
      "content": "Now that is nice! The dot is now truly a dot. It's gentle on the eye and it has a 'stop effect'. Nice one Mr. Paragraph.\n\n"
    },
    {
      "time": "31 Jan 2009 — 6:24am",
      "content": "epsilicon :\n\nyes.... I am thinking about them now\n\nillix:\n\nSure I will use the .management .... It will look great in the business card, Bag & letterhead. brilliant\n\nI like the 4th one ( bnack dot) ....... so simple, creative at the same time\n\nArtful as :\n\nUmm .... thank you... I will try different fonts & all Caps\n\nParagraph :  \nThanks!! the first one is just great... simple effective trick !!\n\nThank you alot guys... you all have been a great help....\n\n"
    },
    {
      "time": "1 Feb 2009 — 3:48pm",
      "content": "management of dots\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20131101113344/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20131101113344/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": "1 Feb 2009 — 10:10pm",
      "content": "Ratbaggy :\n\n:D\n\n"
    },
    {
      "time": "1 Feb 2009 — 11:35pm",
      "content": "so how would/does one manage dots?\n\nsounds fun.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20131101113344/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20131101113344/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": "2 Feb 2009 — 5:01am",
      "content": "Why didn't you try epsilons suggestion, to change \"g\" into two dots. I think it may be the best one. and above it you could also position the word dot so that o becomes a dot and creates a three dot pattern vertically with that double dot g.\n\nWorth a try?\n\n#4 in the second batch may be the strongest one but it doesn't look that professional to my eyes. Probably because of the typography choice. Probably. I would use lighter weight, but lighter weights wouldn't work with this kind of mark.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "2 Feb 2009 — 7:19am",
      "content": "ratbaggy:\n\nSounds real fun........ anything of dots would be  \nfantastic right, but dot something is not :P\n\nlitera :\n\nwhile i am having my white icing krispy kreme doughnut... I thought, let me try\n\nactually typography is the hardest part ever.... i am always in trouble when it comes to it..... help?\n\n"
    },
    {
      "time": "2 Feb 2009 — 11:52pm",
      "content": "If you're trying to go with dotted G, go with geometric type like Avantgarde, Avenir, Lubalin, Futura, ... It will make things easier on you. Shapes won't look odd because they are rounded already.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "4 Feb 2009 — 3:03am",
      "content": "Hi\n\nTime to ARTFUL AS advice\n\nDifferent fonts....... I was surprised how does changing the font change the whole thing!!\n\ncan u all have a look plz?\n\nlitera :\n\nyes.... thnx... I made some designs with the 3 dots idea...\n\npersonally i prefer 7 & 1\n\nP.S : dont mind what is on the right :P\n\n"
    },
    {
      "time": "4 Feb 2009 — 4:00am",
      "content": "Pic?\n\n"
    },
    {
      "time": "4 Feb 2009 — 4:01am",
      "content": "umm\n\ni added it to the first post as pdf\n\n"
    },
    {
      "time": "4 Feb 2009 — 5:27am",
      "content": "I don't think that any of these actually work... Most of them are too busy to me. I was more looking into simplifying it than overcomplicating. I had something like this in mind (I know it's always bad to show what you think, but here I had to do it. YOu can use it anyway you want it if you like it)\n\n ![](http://web.archive.org/web/20131101113344im_/http:/typophile.com/files/dot-management_6130.jpg)\n\nNow looking at this image I can see that the last \"dot\" should have it's shape tweaked, because it doesn't look the same to the first two. Visual perception. :) Anyway. It's a mockup and it should be treated that way too.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "7 Feb 2009 — 11:28pm",
      "content": "It's probably too late, but how is this for a mark:\n\n ![](http://web.archive.org/web/20131101113344im_/http:/typophile.com/files/dot-management_4604.png)\n\n"
    },
    {
      "time": "9 Feb 2009 — 12:40pm",
      "content": "litera:\n\nthnx alot......... you'r right.. alot was going on... i didnt realize that i was using the logo with hidden O while working on the 3 dots :)\n\nSo simple.....and clever\n\nepsilicon:\n\nIt is not late at all....  \nThis mark makes me want to stare at it for a while.... it feels that there is something happening to the dot in the middle... right?  \nI love it too.....thnx\n\n------------------------  \nSana\n\n"
    }
  ]
}
