{
  "id": "5404",
  "title": "Companion font for Whitman",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,   \n   \nI'm working on a corporate book with lots of text and pages. I'm considering using Whitman for the body text. Does anyone know of a good sans companion?   \n   \nThanks for your help.\n\n",
  "author": "starlux",
  "time": "29 Jun 2004 — 10:49am",
  "uid": "4094",
  "comments": [
    {
      "time": "29 Jun 2004 — 12:12pm",
      "content": "You know what's eerie, Tamara? I just dropped into the Design thread to ask the _exact same question_. I don't mean to hijack your thread, so I'll just observe and contribute what I can to your design problem.   \n   \nMy initial thought was to use a strong, clean geometric grotesque like Hoefler's Gotham or a modern sans like Font Bureau's Interstate, but I realized it's the all-caps settings that I'm drawn to with those faces, not necessarily the mixed settings, which is how I'll most likely need to set the heads. Those are also probably my personal preferences coming through, and they may not give the right tone to the setting for a corporate publication. However, I haven\n\n"
    },
    {
      "time": "29 Jun 2004 — 12:38pm",
      "content": "I would not use a neo-grotesque such as Univers or Helvetica. They're from a distinctly later era and feel a little too modern to me.   \n   \nI think a range of things would work, whether Gill Sans, Futura, Metro or Franklin Gothic (just a few possibilities). Metro in particular was a Dwiggins sans serif.   \n   \nOf course, Kent Lew hangs out here, and as the designer of Whitman I'm sure he's thought about this a lot. I'll be curious to hear his take on it.   \n   \nT\n\n"
    },
    {
      "time": "29 Jun 2004 — 1:26pm",
      "content": "So am I...\n\n"
    },
    {
      "time": "29 Jun 2004 — 1:49pm",
      "content": "You know, I could swear I posted something on this in another thread, not that long ago. I get this question a lot.   \n   \nIt's hard to separate out my own personal tastes. (For instance, I personally really don't like Futura or Helvetica and I'm tired of Gill Sans, but that doesn't mean that a skillful designer couldn't make them work with Whitman, maybe.) So don't take anything I say as gospel.   \n   \nChris, if you're interested in a bold condensed, then I think the bolder weights of Franklin Gothic Condensed might be worth a look. I've been mostly using both Gotham and Franklin Gothic with Whitman lately.   \n   \nI think Thomas's suggestion of Metro might make an interesting pairing, given the pedigree. But you'd have to try it out.   \n   \nAh, here's that other thread (Workhorse Serif Suggestions):   \n [http://www.typophile.com/forums/messages/4100/34037.html](http://web.archive.org/web/20131019074634/http:/www.typophile.com/forums/messages/4100/34037.html). Scroll down to April 23.   \n   \nBut _I'm_ really curious what others think works well.   \n   \n-- K.\n\n"
    },
    {
      "time": "1 Jul 2004 — 3:51am",
      "content": "Here's another possibility I forgot to mention earlier.   \n   \nI've heard that the New York 2010 Olympic bid committee has chosen to pair Whitman with HTF's Knockout for their campaign. Could be an interesting combination if handled carefully. I'm curious to see what they come up with.   \n   \nTamara and Chris, I would love to know what you end up trying, what works and what doesn't work for you.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "4 Jul 2004 — 9:49am",
      "content": "I love Whitman. It was expensive but well worth it. I usually use it with Malm\n\n"
    },
    {
      "time": "6 Jul 2004 — 9:07am",
      "content": "It seems to me that [FTF Stella](http://web.archive.org/web/20131019074634/http:/www.myfonts.com/fonts/feliciano/stella/) would make a good mate Whitman. Maybe [Quadraat Sans](http://web.archive.org/web/20131019074634/http:/www.myfonts.com/fonts/fontfont/ff-quadraat-sans/) would work nicely as well? Something more edgy that might work well is [Anomoly](http://web.archive.org/web/20131019074634/http:/www.veer.com/products/typedetail.aspx?image=ALT0000140)--seems like a nice contrast.   \n   \n-Addison\n\n"
    },
    {
      "time": "8 Jul 2004 — 8:50am",
      "content": "FF Scala Sans would be a good match -- like Whitman, it's not a revival of a specific face, but a face in a traditional \"humanist\" style, and the proportions are similar.   \n   \nGiacomo (from Terminal) would perhaps be better -- it has a similar roundness to its curves.\n\n"
    },
    {
      "time": "8 Jul 2004 — 10:32am",
      "content": "Thanks for your help everyone. I decided to go with Metro. It's working out pretty nicely. Unfortunately, I don't own some of the suggestions so I couldn't test everything. Franklin Gothic worked nicely...but Metro has a friendlier, less heavy feel that works better for the dry subject matter.\n\n"
    }
  ]
}
