{
  "id": "54055",
  "title": "Request : shapes like letters, but not letters",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am working on materials for a lecture and workshop I am planning, involving shapes that could be letters but are not, in fact, part of commonly recognised alphabets. These will be used to examine strategies for harmonising arbitrary shapes into sets, in the same way that we harmonise different letters into typefaces.\n\nI have come up with some shapes myself, but I thought it would be interesting to invite Typophilers to contribute possible shapes. I can't promise to use them all, but if I use yours I will include your name in acknowledgements at the end of my lecture.\n\nI am looking for roughly monoline shapes. They will be given to students, who will have the job of drawing the shapes in ways that harmonise with various type styles and scripts. I will post some images of the results here, and the students' responses to the experience will be incorporated into the lecture. I may revise the submitted shapes slightly, if I think this will provide particular kinds of challenges for the students that will increase the value of the exercise.\n\nImages can be posted in this thread. Thanks in advance to anyone who chooses to participate.\n\n",
  "author": "John Hudson",
  "time": "27 Jan 2009 — 12:24pm",
  "uid": "1262",
  "comments": [
    {
      "time": "27 Jan 2009 — 12:57pm",
      "content": "1) Check out the insides of: [http://typophile.com/courses/type101](http://web.archive.org/web/20130821091022/http:/typophile.com/courses/type101 \"http://typophile.com/courses/type101\") and [http://typophile.com/courses/type110](http://web.archive.org/web/20130821091022/http:/typophile.com/courses/type110 \"http://typophile.com/courses/type110\") .  \n2) I have over a hundred \"pseudo-letters\" that I did for Trajic notRoman.  \n [http://themicrofoundry.com/ss\\_trajic.html](http://web.archive.org/web/20130821091022/http:/themicrofoundry.com/ss_trajic.html \"http://themicrofoundry.com/ss\\_trajic.html\")  \nThey're not monoline, but you can easily see their structure.  \n3) You might get away with using actual letters from obscure alphabets. I'm thinking of things like Cherokee and IPA.  \n4) Matthew Carter made such letters a while back in support of font copyrighting efforts; they were supposed to illustrate the separation of design and utility. Not that the government was paying attention of course.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:15pm",
      "content": " ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/letters_3857.png)\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:20pm",
      "content": "My modest proposal for a new uppercase germandbls glyph from [this thread](http://web.archive.org/web/20130821091022/http:/dev.typophile.com/node/33647?page=8) might work:\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/Picture_4718_6676.GIF)\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:28pm",
      "content": "I guess I'm moving into some asian stuff, not really latin looking.\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:33pm",
      "content": "Something I doodled with several years ago. Looks a bit Cyrillic in places.\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/alien-web_6548.jpg)\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:34pm",
      "content": "That's fine, Frode, the shapes don't have to look Latin, although I may tighten up some of the shapes to make things a little easier for the students.\n\nThere is a tricky second part to their assignment that I don't want to share yet. I like it when the second morning of a workshop begins with a collective groan of disbelief :)\n\n"
    },
    {
      "time": "27 Jan 2009 — 1:38pm",
      "content": "This in the news today -\n\n[http://www.telegraph.co.uk/earth/wildlife/4357829/Immortal-jellyfish-swa...](http://web.archive.org/web/20130821091022/http:/www.telegraph.co.uk/earth/wildlife/4357829/Immortal-jellyfish-swarming-across-the-world.html \"http://www.telegraph.co.uk/earth/wildlife/4357829/Immortal-jellyfish-swarming-across-the-world.html\")\n\n- seems like it could be the basis of a symbol for immortality.\n\n"
    },
    {
      "time": "27 Jan 2009 — 2:20pm",
      "content": " ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/newletters_3452.jpg)\n  \nuppercase\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/lowercase_3531.jpg)\n  \nlowercase\n\nNo matter my intentions, almost every glyph winds up being just an inverted or backwards version of an existing glyph..\n\n"
    },
    {
      "time": "27 Jan 2009 — 2:23pm",
      "content": "Something of an aside: John, your description made me think of a workshop that Cyrus has conducted a couple times recently, which he calls \"The Eleventh Digit.\" He describes a bit about it in the second half of this blog post: [http://type101.fontbureau.com/archives/114](http://web.archive.org/web/20130821091022/http:/type101.fontbureau.com/archives/114 \"http://type101.fontbureau.com/archives/114\")\n\n"
    },
    {
      "time": "27 Jan 2009 — 2:54pm",
      "content": " ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/sbpx_6662.gif)\n\n"
    },
    {
      "time": "27 Jan 2009 — 3:15pm",
      "content": "Tim Donaldson's got some cool 'coulda been' letters in his wonderful new book, Shapes for Sounds (Mark Batty Publisher)\n\nHis \"family tree\" approach to the historic development of the modern 'romalingian' glyph set also has a branch with three 'possible' leaves for each letter. Tim is a consummate pen-man (pace, Hrant) and his 'evolution' of the letters makes good use of that understanding.\n\nSee [http://www.markbattypublisher.com/servlet/book\\_view?number=66](http://web.archive.org/web/20130821091022/http:/www.markbattypublisher.com/servlet/book_view?number=66 \"http://www.markbattypublisher.com/servlet/book\\_view?number=66\")\n\nCheers\n\nPF\n\n[http://slowprint.com/almostfreelp](http://web.archive.org/web/20130821091022/http:/slowprint.com/almostfreelp \"http://slowprint.com/almostfreelp\") (Almost Free Letterpress!)  \n [http://fraterdeus.com](http://web.archive.org/web/20130821091022/http:/fraterdeus.com/ \"http://fraterdeus.com\") - Galena, Illinois\n\n"
    },
    {
      "time": "27 Jan 2009 — 3:30pm",
      "content": "Here's a couple odd characters from my notebooks...\n\n￼\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/Piola-letters_3747.jpg)\n\n[http://tinyurl.com/pf-notebooks-01](http://web.archive.org/web/20130821091022/http:/tinyurl.com/pf-notebooks-01 \"http://tinyurl.com/pf-notebooks-01\")\n\nCheers!  \npf\n\n[http://slowprint.com/almostfreelp](http://web.archive.org/web/20130821091022/http:/slowprint.com/almostfreelp \"http://slowprint.com/almostfreelp\") (Almost Free Letterpress!)  \n [http://fraterdeus.com](http://web.archive.org/web/20130821091022/http:/fraterdeus.com/ \"http://fraterdeus.com\") - Galena, Illinois\n\n"
    },
    {
      "time": "27 Jan 2009 — 3:36pm",
      "content": " ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/letterlike_3622.gif)\n\n"
    },
    {
      "time": "27 Jan 2009 — 5:28pm",
      "content": "This is pretty bad, but maybe it helps?  \n(From a school assignment to make \"fantasy numerals\", six years back.)\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/work_nina-18_4609.gif)\n\n"
    },
    {
      "time": "27 Jan 2009 — 5:58pm",
      "content": "Err Codex Seraphinianus?  \n [http://en.wikipedia.org/wiki/Codex\\_Seraphinianus](http://web.archive.org/web/20130821091022/http:/en.wikipedia.org/wiki/Codex_Seraphinianus \"http://en.wikipedia.org/wiki/Codex\\_Seraphinianus\")\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/seraph_5602.gif)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20130821091022/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    },
    {
      "time": "27 Jan 2009 — 7:05pm",
      "content": " ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/Untitled-1_6385.gif)\n\n"
    },
    {
      "time": "27 Jan 2009 — 9:54pm",
      "content": "Hahahaha. Thanks, David, that is really a funny shape. It looks almost pronounceable. Shpa?\n\n"
    },
    {
      "time": "28 Jan 2009 — 1:42am",
      "content": "I don't have any image but italian designer Bruno Munari made something similar: scritture illegibili di popoli sconosciuti (illegible writings of unknown people). If I find some picture I will post here.\n\n"
    },
    {
      "time": "28 Jan 2009 — 3:19am",
      "content": "The great Max Ernst designed a book called Maximiliana in a phantasy script. [Here](http://web.archive.org/web/20130821091022/http:/gramatologia.blogspot.com/2007/10/max-ernst-do-livro-maximiliana-ou-o.html) is a little image (couldn’t find a bigger one right now).\n\n"
    },
    {
      "time": "28 Jan 2009 — 3:34am",
      "content": "Ah right, Alessio Leonardi made something like that too, his \"Alberobanana\" alphabet. There is some info on that [here](http://web.archive.org/web/20130821091022/http:/alessio.de/alberobanana/albero_03.html).\n\n"
    },
    {
      "time": "28 Jan 2009 — 6:29am",
      "content": "Hi John its a bit late in the evening here but I felt like making a few fun doodles!\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/doodles_6304.GIF)\n\n"
    },
    {
      "time": "28 Jan 2009 — 7:05am",
      "content": "Two more sources of invented letters that I remembered: Gurtler's singular \"Experiments With Letterform & Calligraphy\"; and Catich's \"Reed, Pen and Brush Alphabets for Writing and Lettering\".\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2009 — 7:19am",
      "content": "John, I did a screengrab of the folder showing the thumbnails of the various experiments:\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/TrajicSet_6130.gif)\n\nMany of these can be flipped to end up with more. In fact that might help because the Trajic forms are supposed to evoke actual letters, which you might not want.\n\n(Note that at that point the outlines were generated with the \"help\" of Adobe's Trajan. But I've never sold a copy of Trajic -even though I was asked a dozen times- and my plan has always been to redraw the outlines myself if it came to distribution.)\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2009 — 9:38am",
      "content": "John -- Shpa, or even shpal :)\n\nFrom Russia with Light:\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/UntitledC_5333.gif)\n\n"
    },
    {
      "time": "28 Jan 2009 — 11:00am",
      "content": "\"These will be used to examine strategies for harmonising arbitrary shapes into sets, in the same way that we harmonise different letters into typefaces.\" It's of course an interesting problem to give, compared to the class I've just given the low resolution san serif assignment to do.:)\n\nThe way that we harmonise different letters into a typeface are aimed to render meaning to others via matter and energy with some sort of tone of voice. So, there is a harmonization strategy leading to Gutenburg, to 11 point Old Dreadful 301, another leading to Helvetica, and yet another very slightly different leading to 11 point 96 dpi Arial\n\nThe wide range through abstract, pictoral, and alphabetic signs yields a long history of harmonization strategy improvement efforts, but they are mostly based on improvement to the speed, depth or breadth of meaning, (or better performance, quality and functionality), imparted to readers from letters. So, as you know, the best solutions usually start with a good specification.\n\nIf you only give monoline for a spec. and the meaning is absent, this leaves meaningless spaces to adjust contained by properly contrasted lines, doesn't it? So, what strategy(s)? The assignment can look more or less like real text, (the tools ya know), but at the end of the day what's the advantage of knowing how to make meaningless marks when there're but 26 of the real thing to make?\n\nCheers!\n\n"
    },
    {
      "time": "28 Jan 2009 — 11:19am",
      "content": "David, I can think of one very good advantage: getting used to making fonts for scripts you can't read.\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2009 — 12:56pm",
      "content": "Getting to understand how different tools work – creating sharp angles, curves, spirals and corners – without the distraction of meaning. Kinda like kerning upside down.\n\n"
    },
    {
      "time": "28 Jan 2009 — 2:56pm",
      "content": "Have you seen this book by Alessio Leonardi, The Cow and the Typewriter. He sort of re/predesigned the alphabet. He presented the book in AtypI Helsinki, and it was hilarious, and also very educating. I did some digging, and found this image from the book. I now regret I didn't buy the book at the conference.\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/FromTheCow_Pages124-125_5232.png)\n\n"
    },
    {
      "time": "28 Jan 2009 — 6:40pm",
      "content": "All of this is pretty wonderful...let's not forget Mayan and Egyptian hieroglyphs, Chinese characters, Naxi pictographs all of which emerged from this sort of abstraction of real objects.\n\nOne can generate new shapes randomly by using analog methods: Examples: 1- In Japan girls have a game where they peel an apple into as long a length of skin as they can, then toss the skin into the air behind them. When it lands on the floor it is supposed to spell the (Latin) letter of the person they will marry - most often an S ! 2- The old game when the nose on a card is made up of a thin chain and if you shake it horizontally the nose takes on different shapes. 3- Divination by throwing bones and studying the shapes.\n\nFor the purposes of the typographic study a number pieces of wire of different shapes connected or unconnected to short lengths of rope can be tossed to generate an infinite number of proto-glyphs. A variation of this would be to toss a frame shape onto a large jumble of such objects on the floor, and the frame 'selects' the glyph by outlining the random shapes within. Or simply use a frame to look around you (or on photographs) and pick out the outlines of objects - the outline of a tree branch meeting the straight side of a house would be one line of the glyph, for example.\n\n"
    },
    {
      "time": "29 Jan 2009 — 9:22am",
      "content": "I have not read everything with attention, but I think David Berlow is quite right (if I understand correctly) in saying the specifications are too loose to obtain a set of forms which could compose an unexisting alphabet.  \nBesides the immediate advantage told by Hrant, if forms are too complex, without some shared thing, and done by various people without knowing what inspired the others', well you end up in a quite arbitrary collection, where many forms could have an excess of detail, while others have just a few strokes and so on…\n\nSo, to get \"scriptural\", I would not enjoy drawing an arbitrary alphabet composed by some Kanji ideograms, a few Arabic or Georgian letters, and so on…\n\nIf you are not in an excessive hurry, try to fix some rules, i.e.: no more than two closed forms in a glyph, a sort of \"x-height\" or something like that.\n\nAlberobanana by Alessio Leonardi is basically the same thing, but done by him as an exercise. The shapes are not arbitrary, but based on an invented stylization of different objects, i.e. a tree (Albero in Italian), instead of the usual \"Alif/Alef/Aleph/A\"…\n\nEDIT: Tomi, if you want to have a spec of Alberobanana, it's published in [Italic 1.0](http://web.archive.org/web/20130821091022/http:/www.aiap.it/libreria.php?ID=78)  \nOr maybe just send an email to [Alessio Leonardi](http://web.archive.org/web/20130821091022/http:/www.alessio.de/) and ask if he sends you a PDF or something…  \nI'm sure he will reply…\n\n"
    },
    {
      "time": "29 Jan 2009 — 7:50pm",
      "content": "David, Claudio,\n\nPerhaps I could have been clearer: I am _not_ looking for shapes from which to create an unexisting alphabet. I am looking for a smallish number of shapes to present to students to harmonise with regular Latin letters in a variety of typeface styles. Some of the shapes will be similar to the construction of Latin letters, in which case the strategies for harmonisation are expected to be similar to those used within the existing typefaces, but some of the shapes will be more difficult to harmonise, demanding the kind of strategies that are used when trying to harmonise different scripts.\n\nAs David notes, there are multiple strategies, and one of the deliverables for the workshop will be student reflections on process and strategies tested or employed.\n\n[I'm not interested in imposing rules on the contributions made by people to this thread, since I can pick and choose which shapes, if any, to use in my workshop.]\n\n"
    },
    {
      "time": "30 Jan 2009 — 2:16pm",
      "content": "\"... I am looking for a smallish number of shapes to present to students to harmonise with regular Latin letters...\"  \nI think there are 4 useful goals; using either meaningful or unmeaningful signs, to blend with a given design or not to blend. We know that all the glyphs in your garden variety modern font layout are not aimed at just one of these goals, and we know that blending with text can be a term massively relative to many things. But, per style presented, as I think we all know deep down, there is one best strategy per goal, per glyph, and per beyond (into things like output method, display environment and audience). I tend to stress the whole ball of wax to make each detailed decision mean something, at least in the learning stage, as opposed to allowing \"because I felt like it\" to rule.\n\n\"...I am not looking for shapes from which to create an unexisting alphabet...\"  \nThen you'll never run out and need to make stuff totally up, or at least not until 2134 when every student will already know how to draw all of unicode and beyond. ;)\n\n\"Alberobanana by Alessio Leonardi is [...] shapes are [...] based on [..] stylization of different objects\"  \nI think this is a great exercise assuming the students already appreciate fairly deeply the object stylization leading to the signs they usually use, or you plan to teach them that next. A single workshop has got to be tough unless they're pretty advanced.\n\nCheers!\n\n"
    },
    {
      "time": "30 Jan 2009 — 5:33pm",
      "content": "Koch's Book of Signs is full of stuff you could slip right into Latin alphabets. P22 already has the [font](http://web.archive.org/web/20130821091022/http:/www.p22.com/products/kochsigns.html).\n\n"
    },
    {
      "time": "30 Jan 2009 — 7:21pm",
      "content": "David: _But, per style presented, as I think we all know deep down, there is one best strategy per goal, per glyph..._\n\nI agree. But we're seldom obliged to think about and find ways to describe that strategy, or how the strategy for one glyph in a typeface relates to the strategy for another glyph, and because we're usually starting with familiar letters and a whole typographic history, would-be type designers can achieve a lot by referencing 'tried and true' strategies, even those only partially understood. So what I want to do is to present unfamiliar shapes, in part in order to get the students thinking about the strategies they use for the familiar ones.\n\nAnd, as I mentioned, one of the key deliverables of the exercise will be reflections on process, and if the students were all to come back and say 'This is a stupid workshop and I didn't learn anything', that would be a viable result.\n\n"
    },
    {
      "time": "30 Jan 2009 — 7:50pm",
      "content": "The Cypriot syllabary has a number of Greek/Latin/Cyrillic-like shapes that might be useful. Some examples:\n\n ![](http://web.archive.org/web/20130821091022im_/http:/typophile.com/files/Picture7_5583.png)\n\n"
    },
    {
      "time": "30 Jan 2009 — 8:44pm",
      "content": "Flam Grav?\n\n"
    },
    {
      "time": "31 Jan 2009 — 4:24am",
      "content": "I’m looking forward to see the results of the workshop ;-)\n\n"
    },
    {
      "time": "31 Jan 2009 — 4:55am",
      "content": "Something like this could be the seed of an interesting Type Battle.\n\n"
    },
    {
      "time": "31 Jan 2009 — 5:13am",
      "content": "I like the way you're thinking about it. Good luck with the live version,\n\nCheers!\n\n"
    }
  ]
}
