{
  "id": "54052",
  "title": "Elien generative monospace typeface",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "Hello!\n\nI've designed and developed elien in Processing. Its glyphs are generated by metaballs. A varying number of balls random sizes is overlain on a letter skeleton. The interactive application generating elien allows you to input text and alter different parameters – scale, spacing, density, contrast, levels and dissolve. This approach yields unlimited variations of styles and weights. You  \nmay export the generated graphics in PDF Format.\n\nA demo version is available here:  \n [http://elien.tatssachen.de/launch](http://web.archive.org/web/20150317202055/http:/elien.tatssachen.de/launch)\n\nMore infos about how elien works can be found here:  \n [http://elien.tatssachen.de](http://web.archive.org/web/20150317202055/http:/elien.tatssachen.de/)\n\n",
  "author": "Tatevik",
  "time": "27 Jan 2009 — 12:10pm",
  "uid": "24221",
  "comments": [
    {
      "time": "27 Jan 2009 — 12:17pm",
      "content": "This is cool.\n\n"
    },
    {
      "time": "27 Jan 2009 — 2:26pm",
      "content": "This is quite nice (including the great web interface).  \nI do keep reading \"meatballs\" however. :-)\n\nAlthough this is already quite accomplished  \n(PDF export too?!) I do have two suggestions:  \n1) Allow the customization of the skeletons. For one thing this would lead to support of non-Latin scripts.  \n2) Have a mode where all the letters in a string can be connected, with the same style of rendering; either by having a simple line going through the text, or maybe something more complex, like some letters with the tops connected and others with the bottoms. I think that bring the \"circuit\" look full circle, and allow for some wonderful texture generation (like those DNA \"imprints\" or something).\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2009 — 2:10pm",
      "content": "Wow, great job!\n\n"
    }
  ]
}
