{
  "id": "54060",
  "title": "Not Non-Latin (and not Latin either)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm sure this must have come up before here on Typophile, but I'm not sure even how to google this topic, so I'm starting a fresh discussion. (If you can find an old one to point me to, I'd be glad to read that too) So here's the question:\n\nWhat is a better term (if any) for Non-Latin scripts without using 'non' or 'Latin' to qualify them? I typically think of 'other' scripts as 'exotic', but I feel that maybe even that is a bit ethnocentric. Is there a solution to this dilemma?\n\n",
  "author": "paul d hunt",
  "time": "27 Jan 2009 — 1:56pm",
  "uid": "7006",
  "comments": [
    {
      "time": "27 Jan 2009 — 2:07pm",
      "content": "Personally I've come to terms (pardon the pun) with it.  \nIn fact that \"non\" can be a great motivator.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2009 — 2:35pm",
      "content": "Non-Latin seems far less loaded than non-English or non-Western. How about, \"beyond Latin\", and as 99% of international fonts include basic Latin support, maybe \"Latin plus...\" or CP1252+?\n\nAlso Adobe doesn't need a phrase for this. A cute little shaded icon set in Adobe Gauge is what's needed, right? ;-)\n\n"
    },
    {
      "time": "27 Jan 2009 — 2:39pm",
      "content": "I don’t really see non-Latin as ethnocentric; it’s simply a fact that those other writing systems are non-Latin. It’s not as if the Latin alphabet is limited to any particular nation or ethnicity.\n\n"
    },
    {
      "time": "27 Jan 2009 — 4:19pm",
      "content": "I'm curious, do speakers of, say Russian, refer to types as non-Cyrillic? I'm guessing that non-whatever is based on what language/script is being used.  \nAlso, please do not confuse my personal views, discussions as originating from Adobe.\n\n"
    },
    {
      "time": "27 Jan 2009 — 4:23pm",
      "content": "\\>Also, please do not confuse my personal views, discussions as originating from Adobe.\n\nSorry :-( your picture made me think you might be wearing your Adobe hat.\n\n"
    },
    {
      "time": "27 Jan 2009 — 4:25pm",
      "content": "nope, just a pixel-stetson\n\n"
    },
    {
      "time": "27 Jan 2009 — 4:31pm",
      "content": "Why do you need to use the term at all?  \nWhy not just refer specifically to whatever scripts you're talking about?\n\n\\*\\*\\*\n\nIs there a term that groups the Cyrillic-Greek-Latin triad of scripts?\n\n"
    },
    {
      "time": "27 Jan 2009 — 4:34pm",
      "content": "The reason why non-Latin can often be a useful term where for example non-Cyrillic rarely can is that type production and typographic education has been so Latin-centric. That's why many of us speak of the problem of Latinization but very few people complain about Latin fonts that are made to look Russian for example.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2009 — 4:50pm",
      "content": "Because of the way in which I work, and the way in which Tiro is organised, I'm blessed not to have to worry about such terminology: we do multiscript type design, and Latin is just one of the scripts. The relative importance of one script over another is project-specific, not part of our general outlook. Sometimes, a client needs a typeface in which one script ‘sets the tone’, as it were, for harmonised companions, but we don't have a Latin type department and a Non-Latin type department. It is in the latter situation that I think the term originated. Traditionally, type manufacturers and typesetters alike, in Europe and the Americas, have distinguished between ‘our typography’ and ‘everyone else's typography’, with the latter sometimes referred to as non-Latin and sometimes as exotics.\n\nHrant, I don't think using the term non-Latin ever stopped anyone from Latinising a ‘non-Latin’ script. Rather, it maintains a status quo in which the identity of other writing systems are expressed relative to Latin.\n\nPaul, I would look at it this way: if you find yourself needing a term with which to refer to ‘everyone else’s typography’ maybe you need to reorganise the way in which you work. When you lose the need for such a term, you can be fairly confident that you are treating the typographic citizens of the world as equals.\n\n"
    },
    {
      "time": "27 Jan 2009 — 5:13pm",
      "content": "John, I didn't mean that the term \"non-Latin\" has affected how much Latinization has gone on; I meant that the existence of the term and the general perceptions of cultural migration in type are related. So if we accept that the latter exists, it makes sense that the former does too.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2009 — 6:29pm",
      "content": "\\>Cyrillic-Greek-Latin\n\n\"Pan-European\", \"WGL4\", but these exclude Vietnamese and African languages to name but two\n\nCheers, Si\n\n"
    },
    {
      "time": "27 Jan 2009 — 6:58pm",
      "content": "Well, if it is the \"non\" that is bothersome, yet you have a need to speak of them as a common group, you could say \"scripts that do not use the Latin alphabet.\" That is about all they have in common, no?\n\nNow for the problem of the set of all sets . . .\n\n"
    },
    {
      "time": "27 Jan 2009 — 7:00pm",
      "content": "- _I typically think of ‘other’ scripts as ‘exotic’, but I feel that maybe even that is a bit ethnocentric._\n\n‘Other’? Other than what? ‘Exotic’... (‘bizarre’? ‘weird’?). Are you joking? ‘Peculiar’ is another great way to define them non-Latins:\n\n<dl>\n<dd>‘As we have divisions of mankind, so we also have similar divisions among letters. In general, type faces take five forms, as follows: Gothic, Roman, Italic, Block and Script. These five are the basis of all type faces, except in those languages like Hebrew and Russian, which have peculiar styles of their own.’ [<em>A Manual of Style, Containing Typographical and Other Rules for Authors, Printers and Publishers, Recommended by the University of Chicago Press, Together with Specimens of Type</em>. Chicago: The University of Chicago Press, 1949.]</dd>\n</dl>\n\nI personally find the above entry to the Chicago Style Manual unbeatable.\n\n- _In fact that “non” can be a great motivator._\n\nDefinition by the absence of something is hardly reliable. Besides, there is always something disparaging about such definitions. Unfortunately, that was the pattern for centuries: infidel, non-white, un-american, unchristened, sans-culotte, etc.\n\n- _I’m curious, do speakers of, say Russian, refer to types as non-Cyrillic?_\n\nI do, on occasion.\n\n- _Is there a term that groups the Cyrillic-Greek-Latin triad of scripts?_\n\nI use ‘LGC’ (cf. ‘CJK’).\n\n"
    },
    {
      "time": "27 Jan 2009 — 7:13pm",
      "content": "LGC isn't unheard of, but the order of the languages could be seen as a \"ranking\", as is sometimes the case with CJK.\n\n"
    },
    {
      "time": "27 Jan 2009 — 7:53pm",
      "content": "- _LGC isn’t unheard of, but the order of the languages could be seen as a “ranking”, as is sometimes the case with CJK._\n\nOf course, when it comes to ‘LGC’ (or ‘GLC’) we are talking scripts, not languages, so the potential problems with ‘ranking’ could only relate to the genetic seniority, which is pretty obvious, not the perceived superiority. From the oldest—the ‘G’—to the youngest, the ‘C’. I don’t see it as an issue.\n\n"
    },
    {
      "time": "27 Jan 2009 — 8:01pm",
      "content": "\\>I don’t see it as an issue.\n\nMaybe, but between language, culture, type, there's plenty of room for people to get offended.\n\n"
    },
    {
      "time": "27 Jan 2009 — 8:35pm",
      "content": "\\> Are you joking?\n\nWhy would he be? \"Exotic\" is a common synonym  \nfor non-Latin. In fact at least one font classification  \nsystem uses that (although I forget which it was).\n\nBTW I'm currently working on a commission involving  \nCyrillic and Armenian fonts, and the subject line of the  \nclient's emails is \"exotic fonts\"!\n\n\"Peculiar\" BTW suffers from being already used in type,  \nto mean -loosely- non-alphanumeric metal sorts (and by  \nextension glyphs). Being old-fashioned, I've used it here:  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20130821045523/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\n\\> Definition by the absence of something is hardly reliable.\n\nReliability is only one factor, and nothing exists without  \nits opposite. In my case that \"non\" does in fact motivate me,  \nin giving me something to counteract, to refute, to improve.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2009 — 9:45pm",
      "content": "Charles: _you could say “scripts that do not use the Latin alphabet.”_\n\nI don't see what one gains from such an awkward formula. In any case, I would only use the phrase ‘the Latin alphabet’ to refer to the subset of letters used to write the Latin language and their order (as I refer to the English alphabet or the Finnish alphabet, etc.). What we call the Latin script would be better called the Roman script, but ‘Latin script’ is too ingrained in our usage for even me to try to change it.\n\n"
    },
    {
      "time": "27 Jan 2009 — 11:22pm",
      "content": "not that i use any of these terms except when trying to write or talk about certain things, i definitely don't think in any of these terms because i don't believe that thinking is in words. but i was missing having some engaging (for me) discussion on typophile and it's always insightful to hear all your thoughts.\n\n"
    },
    {
      "time": "28 Jan 2009 — 7:11am",
      "content": "<cite>I don’t see what one gains from such an awkward formula.</cite>\n\nYes, that was my point.\n\n"
    },
    {
      "time": "28 Jan 2009 — 8:42am",
      "content": "The DIN classification scheme has a – quite ethnocentric – extra group: [Gruppe XI: Fremde Schriften](http://web.archive.org/web/20130821045523/http:/de.wikipedia.org/wiki/DIN_16518#Gruppe_XI:_Fremde_Schriften) [foreign scripts]. There is an [issue of Spatium magazine](http://web.archive.org/web/20130821045523/http:/www.spatium-magazin.de/gruppe-11/6.php) dedicated to this questionable dump drawer.\n\n"
    },
    {
      "time": "28 Jan 2009 — 9:52am",
      "content": "I started out doing fonts in the Latin script, although I didn't think of them as such -- I just produced the standard encoding in my neck of the woods, at the time.\n\nWhen Adobe started bundling fonts with Greek and Cyrillic characters, I decided to give it a try (not the bundling!)  \nMy relationship with the Greek and Cyrillic scripts has become too intimate for me to think of them as \"non-\" anything, they are Greek and Cyrillic.\n\nAt the ATypI conference in St Petersburg, I realized on numerous occasions that many of the Russians I was speaking with about type knew far less about the \"exotica\" of Cyrillic than I had recently learned, for instance, its history, and non-Russian Cyrillic characters, such as the Big Yus that Maxim had persuaded me to include in my fonts--one fellow though it was a funny looking Zhe.  \nAnother young designer thought the 19th century form of lower case \"p\", with its forked extenders, was unusable today: a good understanding for me to have, but I explained to him that an authentic revival shouldn't have anachronisms--so this is the same situation I face in my own script culture, where there is often a tendency to compromise otherness, to make it more acceptable to convention.\n\n"
    },
    {
      "time": "28 Jan 2009 — 9:59am",
      "content": "\\> there is often a tendency to compromise otherness, to make it more acceptable to convention.\n\nGood point. And it's worth pointing out that most non-Latin scripts have less of this baggage than Latin (which can be both good and bad - it depends how you use that).\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2009 — 10:05am",
      "content": "Paul, I wonder if the CNN solution might work. They refer to everything as \"International\" and then label each country by name, the US, France, China, etc. Usually by 'International' CNN means non-American, but it's sufficiently flexible as to not alienate non-American viewers by calling them 'foreigner' in their own countries. It seems to work pretty well.\n\nIncidentally I heard that CNN will fine a newscaster if they use the word 'foreign' instead of 'international'.\n\nSo International Scripts, and then Latin, Greek, Arabic, Chinese, etc. Then if you want to you can label groups positively: European scripts (Latin, Greek, Cyrillic), East Asian (CJK), South Asian, Semitic, etc. Also if you know you are discussing with other native readers of a particular script, I don't see anything wrong with non-latin, non-cyrillic, etc.\n\n"
    },
    {
      "time": "28 Jan 2009 — 1:15pm",
      "content": "<cite>Incidentally I heard that CNN will fine a newscaster if they use the word ’foreign’ instead of ’international’.</cite>\n\nVeterans of International Wars?\n\n"
    },
    {
      "time": "28 Jan 2009 — 1:40pm",
      "content": "<cite>Paul, I wonder if the CNN solution might work. They refer to everything as “International”[...] Incidentally I heard that CNN will fine a newscaster if they use the word ’foreign’ instead of ’international’. </cite>\n\nI recall that this edict applied to all Turner networks, and for the time that they owned the WCW pro wrestling league, they referred to weapons brought into the ring as \"international objects\".\n\n"
    },
    {
      "time": "28 Jan 2009 — 2:18pm",
      "content": "_they referred to weapons brought into the ring as “international objects”._\n\noh the joys of terminology, remind me not to talk terms ever again. please.\n\n"
    },
    {
      "time": "28 Jan 2009 — 2:46pm",
      "content": "\\>Incidentally I heard that CNN will fine a newscaster if they use the word ’foreign’ instead of ’international’.\n\nFines, in which currency? Also we need to reduce our dependence on international oil.\n\nI’d also like to see “foreign man acting suspiciously” turn into “international man of mystery” and then get sued by Austin Powers.\n\n"
    },
    {
      "time": "28 Jan 2009 — 5:08pm",
      "content": "@sii - ha! :-) i'd like to see that too!\n\n"
    },
    {
      "time": "29 Jan 2009 — 10:12pm",
      "content": "Maxim, I take the editors of the _Chicago Manual of Style_ to be using the word peculiar in its original sense of belonging or pertaining to, not in the common colloquial sense of odd or strange.\n\n"
    }
  ]
}
