{
  "id": "54080",
  "title": "Font matching choice for interactive website",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi everyone, hope this is the correct place to post this (the typography/composition forum seems inactive). I am involved in creating a flash website for a client and am trying to pair a header font with a good legible choice for body text. The header is set at 18pt Brauer Neue Bold. The client likes the body set in Brauer also but I find it is somewhat hard to read. I have made a mockup below with it set in 14pt Brauer Neue and also in 12pt Helvetica Neue. I was wondering if anyone has a favorite or maybe even a suggestion for another font that would pair nice with the Brauer header. Thanks so much!\n\n ![](http://web.archive.org/web/20140725203438im_/http:/typophile.com/files/test_3414.jpg)\n\n",
  "author": "Jeremiah",
  "time": "27 Jan 2009 — 9:47pm",
  "uid": "32815",
  "comments": [
    {
      "time": "28 Jan 2009 — 3:31am",
      "content": "The color of the text is too dark! Think contrast. If you want a second typeface i would pair Brauer with a Serif, Helvetica looks dull in this combination. Think contrast. BTW Brauer is not that bad, instead of messing around with a second typeface go with Brauer and try to improve the reading comfort. Color contrast, line-length, eventually spacing, rendering options inside Flash for dynamic text, etc.\n\n"
    },
    {
      "time": "28 Jan 2009 — 10:35am",
      "content": "Hey thanks, I guess I should have posted a more accurate background color, the color is actually a brown. I just used the black background on the mockup, I will certainly look at the things you mentioned. I find the idea of pairing with a serif very interesting. Anyone else?\n\n"
    },
    {
      "time": "28 Jan 2009 — 1:21pm",
      "content": "Brauer looks much better than Helvetica. As for a serif, I would try Melior.\n\n"
    },
    {
      "time": "29 Jan 2009 — 1:44pm",
      "content": "I would also suggest trying Verdana, a safe bet when having lots of text on screen, then again you may want to think about breaking that paragraph up as well.\n\n"
    }
  ]
}
