{
  "id": "541",
  "title": "Scriptorium Update #126 - Hesperides Font",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Featured Font - Hesperides   \n [http://www.fontcraft.com/scriptorium](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/scriptorium) - follow link   \n   \nMaking the Captain Kidd Font   \n [http://www.fontcraft.com/scriptorium/kidd](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/scriptorium/kidd)   \n   \nNew Fonts Available Online   \n [http://www.fontcraft.com/store/display.html](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/store/display.html)   \n   \nSpring Specials   \n [http://www.fontcraft.com/store/specials.html](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/store/specials.html)   \n   \nWill Low Borders   \n [http://www.fontcraft.com/scriptorium/lowsamp.jpg](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/scriptorium/lowsamp.jpg)   \n   \nNew Renaissance Fonts & Art Collection   \n [http://www.fontcraft.com/scriptorium/renaissance](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/scriptorium/renaissance)   \n   \nFontClub Info   \n [http://www.fontcraft.com/fontclub](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/fontclub)   \n   \n   \nNEW FONT RELEASE - Hesperides   \n Hesperides is based on samples of Colonial period calligraphy. Rather than being entirely based on any one sample, some common characteristics have been emphasized to give it a more coherent and distinctive look, with the accentuated single-looped strokes on many of the characters suggesting a fully flourished style, but not going quite as far as a font like Platthand or John Speed. The ultimate effect is really striking, in the tradition of our Queensland and Allegheny fonts, but even more distinctive. The full font includes alternate versions of many of the key characters designed to reduce loop interference and add variety   \n To try out Hesperides for free, just follow the links from our main page at [http://www.fontcraft.com](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/)   \n   \nCAPTAIN KIDD FONT PROJECT - Part 2   \n The saga of the development of the Captain Kidd font continues. The second article carries on to the challenges of developing a more extensive character set from 8 good character samples and a number of very hard to work with and indistinct screen captures.   \n You can find both installments of the article article at [http://www.fontcraft.com/scriptorium/kidd](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/scriptorium/kidd)   \n   \nMORE NEW SINGLE FONTS ONLINE   \n We've just added another slew of single fonts to our online ordering system. This time the goal was to make the Display Fonts section as complete as possible. The result is the addition of 22 more fonts, some of which are fairly obscure To get to the Display Fonts section just go to [http://www.fontcraft.com/store/display.html](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/store/display.html)   \n The added fonts include:   \n Acadian - Lovely ornate Victorian font   \n Adamantine - Very dramatic heavy weight title font   \n Asphodel - Ornate Art Nouveau font   \n Atkinson Eccentric - Interesting Art Nouveau sign lettering font   \n Averoigne - Attractive Victorian capitals   \n Bad Acid - Classic psychedelic lettering font   \n Chambord - Attractive Victorian titling font   \n Circuit - Decorative font with electrical circuit patterns   \n Dunsany - Fantastical and dramatic lettering   \n Engrossing - Classic early 17th century script style   \n Iphegenia - Very nice classic script font   \n Joyeuse - Attractive Arts & Crafts titling font   \n Manegrim - Heavy Germanic uncial   \n Mayhem - Rough and demented font   \n Mazarin - Attractive Victorian titling font   \n Praitor - Unusual Roman lettering font   \n Primer - Reminiscent of embroidered lettering   \n Rousseau - Very nice Arts & Crafts font   \n Slither - Modern stylized title font   \n Tenebris - Attractive titling script   \n Terpsichore - Appealing script style   \n Vasilisa - Type in the style of Russian calligraphy   \nThis brings the selection of single fonts on the ordering site to a pretty impressive level. Every single font isn't there yet, but we're getting much closer.   \n   \nSPRING SPECIALS   \n We've also put a new selection of products on special discount for the Spring season. They include some really good deals on popular items. For example, we've got the phenomenal Arthur Rackham CD reduced, plus the Celtic Fantasy package for those who have the first Celtic package and want to get the new one as well, and even an extra special deal on the Horror Fonts and Art collection because it's so very non-seasonal. There are more than a dozen sale items all together. You can find out what's on special by going to [http://www.fontcraft.com/store/specials.html](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/store/specials.html)   \n   \nWILL LOW BORDERS   \n We're working on a special new package of borders based on the designs of Will H. Low. This package isn't ready yet, but you can see some nice samples of his works from his illustrated edition of Shakespeare's 'As You Like It' on a page at [http://www.fontcraft.com/scriptorium/lowsamp.jpg](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/scriptorium/lowsamp.jpg)   \n Look for this package to be ready for release in a few weeks. If it goes well we may even include a font based on his lettering.   \n   \nRENAISSANCE FONTS & ART   \n We're slowly filling in the gaps in our chronologically based historical fonts collection, and this time we have a key entry which many have been anticipating.   \n The Renaissance saw the development of new lettering styles which combined rediscovered Roman period calligraphy with the needs of a very active literary community for efficient, readable scripts. The result was the move away from medieval gothic lettering to the humanistic forms which are the ancestors of modern handwriting.   \n Our Renaissance fonts collection features 10 fonts based on lettering styles of the period, from humanistic and Italian cursives to formal Roman styles. It also includes a set of Renaissance decorative initials, and as a bonus a collection of Renaissance frames and borders by Evelyn Paul. Alltogether this makes it just what you need to create documents with a Renaissance look.   \n The Renaissance package is available at a reduced price for a limited time. To check it out and see samples of the fonts and the frames and borders, go to [http://www.fontcraft.com/scriptorium/renaissance](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/scriptorium/renaissance)   \n   \nGET NEW FONTS EVERY 2 WEEKS w/ THE FONT CLUB   \n A lot of people seem to like the idea of getting the full versions of all our new featured fonts as they're released. You can join the Font Club too, and get new fonts every two weeks, plus a bonus font for joining. You can get all the info at [http://www.fontcraft.com/fontclub](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/fontclub)   \n We're also offering a special package deal. If you order the new release of our complete fonts CD you can get a one year Font Club membership thrown in for only $20 more. That's a holiday treat that's hard to pass up. Just go to [http://www.fontcraft.com/store/specials.html](http://web.archive.org/web/20131015042540/http:/www.fontcraft.com/store/specials.html)\n\n",
  "author": "Jared Benson",
  "time": "30 Apr 2002 — 6:22pm",
  "uid": "3",
  "comments": [

  ]
}
