{
  "id": "54103",
  "title": "Thoughts and examples of collaboration in the type design process?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I had a discussion mainly with John Hudson about the potential for collaboration in the type design process over on the technical OpenType mailing list a while ago, and promised to bring up the subject here on Typophile, and then became busy with other things.... But I was reminded of this when Thomas Phinney [recently wrote](http://web.archive.org/web/20130821034152/http:/typophile.com/node/53444#comment-322796):\n\n_\"As noted previously, one key difference between Linux and a typeface in an open source perspective is that the latter can benefit from contributions from lots of people, and the former will not work if too many people are working on it.\"_\n\nI'm not sure this is true, because I've not yet heard of anyone trying to do a collaborative type design process with many people involved, and failing.\n\nStill, I'd be very interested to here people's good and bad examples of collaboration in the type design process at any scale.\n\nMost type designers who work as individuals seem to collaborate with a font developer on the actual production of the final files that users have on their computers, and small foundries seem to share both the design and production around a bit between their overall group.\n\nHas anyone had a great internship doing the \"unglamourous\" work of 'filling out' character sets?\n\nOr mentored an \"appentice\" in that way? :-)\n\nI would guess that, before the MA courses that are now so popular, this was the way that most people learned digital type design...?\n\nBest,  \nDave\n\n",
  "author": "abattis",
  "time": "28 Jan 2009 — 11:04am",
  "uid": "16849",
  "comments": [
    {
      "time": "28 Jan 2009 — 11:21am",
      "content": "Recent Collaboration: Adrian Frutiger & Akira Kobayashi: Avenir Next and Frutiger Serif\n\n"
    },
    {
      "time": "28 Jan 2009 — 12:11pm",
      "content": "\\>Still, I’d be very interested to here people’s good\n\nMost East Asian language fonts, Sakkal Majalla (Windows 7 version)\n\n\\>and bad examples of collaboration in the type design process at any scale.\n\nDeja Vu\n\n"
    },
    {
      "time": "28 Jan 2009 — 12:27pm",
      "content": "I would be inclined to agree with Dave in that type design has historically been a collaborative process. Isn't it only thanks to the Digital Age that a single individual can hope to create a whole typeface from start to finish? Even now, I most CJK typefaces are produced through collaboration, as they require thousands of glyphs.\n\nHowever, this needs to be a strictly controlled variety of collaboration. A single creative vision must be applied consistently throughout the design. This might be achieved by having a single individual make the creative decisions and leaving the rest to do mechanical work, or by having a small group of individuals closely discuss the creative decisions they make throughout the process. I believe the latter option describes many of the more recent collaborations, such as that for Meta Serif.\n\nI think Thomas Phinney might have just wanted to make the point that Linux-style decentralized, democratic collaboration would not work for type design.\n\n"
    },
    {
      "time": "28 Jan 2009 — 12:43pm",
      "content": "\\>I think Thomas Phinney might have just wanted to make the point that Linux-style decentralized, democratic collaboration would not work for type design.\n\nBut, it could work if there were a strong man / dictator / figurehead who could pass judgment, accepting or rejecting the submissions from the proletariat - however I doubt the people in the industry best suited to that role would be interested.\n\n"
    },
    {
      "time": "28 Jan 2009 — 12:47pm",
      "content": "I hope that my later comments made it clear that what I think is that with more people working on a typeface, more structure and central vision is needed. Type design and production is poorly suited to a free-for-all approach like wikipedia. I do think one \\*could\\* have a bunch of people collaborate to make something that is ultimately released in FOSS form, and have it be really well done.\n\nMy own Hypatia Sans had kerning done by Robert Slimbach and Miguel Sousa, major production assistance from Miguel, and is going to have the finishing touches on the italics, plus some character set expansion, from Paul Hunt.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "28 Jan 2009 — 12:55pm",
      "content": "@Sii and chrisherron: Could you describe how Avenir Next and Frutiger Serif and Sakkal Majalla were developed in more details, or links to articles on such? :-)\n\n@sii: And what is unfortunate about Deja Vu's modifications to Bitstream Vera? :-)\n\n@Jongseong: I'm not aware of any type designs that have come about through decentralized, democratic collaboration, so I'm not convinced it would not work at all. Deja Vu is an existing type design, so its a different animal, too.\n\nIf the first type designs that are done in this way turn out to be low quality, I look forward to thinking about and discussing the design of their design process. I note that before the mid 90s (now well over 15 years ago, a long time...) programmers used to say the same thing about incredibly complex programs like kernels, before the Linux kernel project proved them wrong.\n\n"
    },
    {
      "time": "28 Jan 2009 — 1:10pm",
      "content": "\\>@sii: And what is unfortunate about Deja Vu’s modifications to Bitstream Vera? :-)\n\nQuality control, fragmentaion, and lack of ongoing involvement from the original designer. So perhaps I should have said Vera instrad of Dejavu.\n\n\\>@Sii and chrisherron: Could you describe how Avenir Next and Frutiger Serif and Sakkal Majalla\n\nNothing published on Majalla as far as I'm aware.\n\n"
    },
    {
      "time": "28 Jan 2009 — 3:51pm",
      "content": "@Thomas Phinney: Thanks for the detail about Hypatia; I like the design :-) When you say Miguel did major production assistance, did he collaborate on the design of the outlines? And could you clarify if when you say kerning you mean only kerning, or the generic metrics too? :-)\n\nAnd I must apologise if you feel quoted out of context; thanks for your clarification and encouragement - I was happy to see that you're open to consulting on these kinds of projects, and I hope one day a \"Free Font Foundation\" might be able to take people up on that kind of offer :-)\n\n_Type design and production is poorly suited to a free-for-all approach like wikipedia._\n\nSince wikipedia is a collection of many pages, like the open font library is a collection of many fonts, IMO a better comparison is between a type design and a wikipedia page.\n\nWikipedia pages tend to have maintainers who patrol for poor quality additions, and trim them out. This means sometimes people come across pages before they are trimmed, and end up writing in their newspaper that [\"This football club wears hats of old shoes\"](http://web.archive.org/web/20130821034152/http:/www.guardian.co.uk/media/mediamonkeyblog/2008/sep/23/mirror.digitalmedia) ;-)\n\nFree programs are not developed \"live\" like this, though. A free program has a life cycle from an cutting edge, experimental sideline source code version, to a \"mainline\" source code version, to an experimental \"alpha\" pre-compiled binary version, to a testing \"beta\" binary version, to a stable \"release\" binary version, to being obsolete.\n\nWith Wikipedia pages, there is only the cutting edge version, and this is why the Wikimedia Foundation has discussed publishing a 'stable' version akin to the way free programs are released.\n\nFor programs, the life cycle before the pre-compiled binary versions is not linear like the part that follows, though: Wikipedia's is faily simple - no 2 people can edit the same page at the same time, for example.\n\nBut with distributed version control, there is an official/golden/master or 'trunk' copy of the source code, and each developer makes a complete copy of this, a 'branch.' They change their branch however they want to, and then they publish the branch for others to compare with the trunk. Another developer might maintain a branch that collates a number of different, non-overlapping branches with some theme. The maintainers of the master copy can choose to integrate any set of branches as they like.\n\nIf someone makes changes that aren't accepted into the 'trunk,' they are already publishing their own version. So if the maintainers misjudged it, and that version is actually more useful for people, its already available, and so it comes into use quickly - and likely causes the maintainers to re-evaluate it.\n\nTo make this visual, [http://oandrieu.nerim.net/monotone-viz/Screenshot-git-viz.png](http://web.archive.org/web/20130821034152/http:/oandrieu.nerim.net/monotone-viz/Screenshot-git-viz.png \"http://oandrieu.nerim.net/monotone-viz/Screenshot-git-viz.png\") shows two branches, the column on the left being the 'master' trunk, the right side col being the 'experimental' branch, and the trunk twice merging in the branch, that continues to develop in parallel.\n\nThis is how Sii's comment about a maintainer who \"passes judgment\" works in practice.\n\n@Sii: Yes, people whose business models depend on the source code being secret probably won't participate. But people with business models that depend on source code being public probably will. I certainly hope that when those business models are proven, we'll see people change from one way of doing business to another :-)\n\n"
    },
    {
      "time": "28 Jan 2009 — 5:04pm",
      "content": "\\>@Sii: Yes, people whose business models depend on the source code being secret probably won’t participate.\n\nActually no, I wasn't thinking of those folks. I was thinking of people who have a proven record of coordinating large projects using paid type designers, engineers, and hinters. And who probably wouldn't work for free themselves (not to say they don't give to the community in other ways), wouldn't expect others to work for free, and wouldn't have the patience to work with a group of amateurs or even professional volunteers.\n\n"
    },
    {
      "time": "29 Jan 2009 — 7:21am",
      "content": "@Sii: Work for free? Who is suggesting this? I'm not :-)\n\n"
    },
    {
      "time": "29 Jan 2009 — 9:36am",
      "content": "\\>@Sii: Work for free? Who is suggesting this? I’m not :-)\n\nPerhaps, but no one is suggesting a framework that would include paying people.\n\n"
    },
    {
      "time": "29 Jan 2009 — 12:13pm",
      "content": "Sii: I think you're making an assumption about the background for the question. This isn't the thread solely about open source fonts. :)\n\nDave regarding Hypatia Sans: To the best of my memory, With the exception of the \"hook\" accent for Vietnamese, for which Robert did the outlines, I did all the outline work, and all the sidebearings (but with a \\*lot\\* of verbal input from Robert on both). Miguel did a lot of work setting up scripts, revised my feature coding, did actual builds using scripts plus the AFDKO, and generally patrolled my work to make sure I didn't miss anything. Plus the \"small matter\" of kerning, which Robert and Miguel collaborated on and I pretty much didn't touch, except to suggest a couple of additional things that needed to be covered.\n\nRegarding the free-for-all development approach....\n\nI am not sure whether a single Wikipedia page is a good analogy for a font (or font family) either. Maybe a set of related pages? But in any case, speaking as somebody who does both writing and font work for money: I am pretty sure that an open free-for-all model is a crappy model for developing high-quality fonts; even though I enjoy participating in Wikipedia, I am pretty sure I would be frustrated by that same model for font development.\n\nOne major problem with that model for fonts is that it's harder to judge the quality of an edit/contribution in just a few seconds, the way one can on Wikipedia. How do you \"diff\" the changes? If what has been changed is a sidebearing, you need to see it in context of other sidebearings. If it's an outline, you need to both see the previous outline \\*and\\* in many cases compare against other outlines.\n\nThen there's the ripple-through problem. If somebody changes the design of the cap \"R\" in the regular, it probably needs to be changed in all the other weights and the italics too... and maybe have kerning adjusted as well.\n\nI think it would be an interesting open-source project to devise a set of tools/scripts or what-not just to better \\*enable\\* type design collaboration by addressing those two issues.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "29 Jan 2009 — 12:24pm",
      "content": "\\>This isn’t the thread solely about open source fonts. :)\n\nSorry I was specifically responding to questions about _Linux-style decentralized, democratic collaboration_ which by definition means unpaid volunteers are involved at some levels of the effort.\n\n"
    },
    {
      "time": "29 Jan 2009 — 2:52pm",
      "content": "@Sii: Unpaid volunteers are involved at some levels of the effort to write the Linux kernel, yes. Off the top of your head, what would you guess the percentage is? :-)\n\n@Thomas Phinney: That's interesting details indeed about how the collaboration in Hypatia actually breaks down :-) I 100% agree with you that font development tools with collaboration-specific features are required - this is what I meant when I said \"the design of the design process\" earlier.\n\nIts too bad that these features aren't seen as desirable by mainstream type designers, and there is no existing practice to examine.\n\nYour concept of the 'ripple through' problem is a great insight - I wonder if you think the ideas behind font synthesis tools like [Ares Font Chameleon would help? I saw [[http://www.thomasphinney.com/about/about-long-version/on your new blog you mentioned you held some software idea patents about \"glyph synthesis\"](http://web.archive.org/web/20130821034152/http:/download.adobe.com/pub/adobe/fontchameleon/discontinued.txt). Are those patents published online anywhere? :-)\n\nHas anyone got access to Ares Font Chameleon and could post some screencasts? Or is (going to be) in Europe, as I'd love (to hang out and) see it in action :-)\n\n"
    },
    {
      "time": "29 Jan 2009 — 3:22pm",
      "content": "@sii: Thousands of companies' profits are based on things that are freely sharable and modifiable, so perhaps no one needs to suggest a framework that would include paying people, when [plenty](http://web.archive.org/web/20130821034152/http:/www.blender.org/blenderorg/blender-foundation/) [of](http://web.archive.org/web/20130821034152/http:/www.mojolin.com/) [frameworks](http://web.archive.org/web/20130821034152/http:/www.redhat.com/) [are](http://web.archive.org/web/20130821034152/http:/o-hand.com/) [visible](http://web.archive.org/web/20130821034152/http:/www.fsf.org/resources/jobs/listing) [to](http://web.archive.org/web/20130821034152/http:/www.openmedianow.org/) [anyone](http://web.archive.org/web/20130821034152/http:/www.openmoko.com/) [who](http://web.archive.org/web/20130821034152/http:/www.symfony-project.org/) [cares](http://web.archive.org/web/20130821034152/http:/blogs.magnatune.com/buckman/2008/06/short-film-abou.html) [to](http://web.archive.org/web/20130821034152/http:/magnatune.com/) [look](http://web.archive.org/web/20130821034152/http:/schoolforge.org.uk/index.php/Support#Consultancies)? :-)\n\n"
    },
    {
      "time": "29 Jan 2009 — 3:36pm",
      "content": "I'm not sure why you're giving me a hard time. :-)\n\nI was disagreeing with an interpretation of Tom's claim…\n\n\"I think Thomas Phinney might have just wanted to make the point that Linux-style decentralized, democratic collaboration would not work for type design.\"\n\nBy stating that it could work with a \"strong man\" in charge.\n\nI still stand by my claim that the people best suited to the strong man role have no interest in it, and would likely have no interest even if they personally were paid. However, this is all academic as no one is stepping forward to pay them.\n\nI'm completely happy to be proved wrong. I'd love to see funded projects, and I'd love to see the leaders in type community run them. It would be extremely fun and entertaining to watch.\n\n"
    },
    {
      "time": "29 Jan 2009 — 4:20pm",
      "content": "@Sii: Sorry I seem to be giving you a hard time, that's certainly not my intention! :-) I agree with your 'strong man in charge' idea - free software projects work like that anyway, such as the Linux kernel and Linus Torvalds, or Python and Guido van Rossum, or the Ubuntu GNU/Linux distribution and Mark Shuttleworth.\n\nAlthough, I do think that this phrasing of the idea gives the wrong impression; the free software community uses the term 'package maintainer,' which implies a more accurate picture of consensus and harmony rather than conflict and force.\n\nAnd I agree this is academic and speculative topic, which is why I hoped to discuss examples of collaboration in some detail :-)\n\nMy question about your guess at the ratio of paid to unpaid work in the Linux kernel relates to your point about type professionals not wanting to work as maintainers even if they were paid, which I don't understand, and hope you can clarify.\n\nI would have estimated it was 20%, but after spending the last while researching it, it seems [its actually 10%.](http://web.archive.org/web/20130821034152/http:/lwn.net/Articles/222773/) So I think thats a good ballpark figure to suggest that a paid-up, collaborative, libre font project would involve \"a group of amateurs or even professional volunteers ... involved at some level of the effort\" - say, 10-20% of the effort.\n\nSince type design is a patient activity, I wonder if you could explain why you think the patience of working at a type design on your own is less frustrating/needing-patience than working collaboratively? :-)\n\nI would agree that the unsuitability of current font development tools means it is frustrating. But since I'm familiar with working collaboratively with plain-text tools, and that process isn't frustrating - though surely different to writing alone - I see no reason collaborative type design would require unreasonable levels of patience if the tools facilitated it.\n\nSince you say it would be extremely fun and entertaining to watch such projects develop, do you agree that its the available tools that are the problem? Or is there something else inherent in the process of type design that I'm missing?\n\nI'm very much a beginner at type design, so I can't tell :-)\n\n"
    },
    {
      "time": "30 Jan 2009 — 1:28am",
      "content": "<cite>Since type design is a patient activity, I wonder if you could explain why you think the patience of working at a type design on your own is less frustrating/needing-patience than working collaboratively? :-)</cite>\n\nI would venture that people who care enough about type design to put in the huge amount of time and effort are also more likely to seek creative control over their work. I don't know much about the free software community, but I suspect the contributors wouldn't be quite as hung up on maintaining their own creative vision.\n\nEarlier, you said you weren't convinced that type designs that have come about through decentralized, democratic collaboration would not work at all, as you haven't seen any examples. I'm not sure such designs can even exist, since competing creative visions will be hard to reconcile without central direction, and the result will hardly be coherent enough to stand as a typeface design.\n\nI'm still trying to understand how you picture this would work. Perhaps A designs some of the letters, B comes and contributes a couple, C comes and tweaks some of the existing letters done by A and B, D comes and fills out the remaining letters, A comes back and retweaks the letters... How would design consistency be maintained over this whole process when A, B, C, and D will have differing creative visions? Unless the collaboration process takes place at a different, well-defined level (i.e. someone designs the basic glyphs, another adds diacritics, yet another takes care of the naming and production), I just don't see a coherent typeface coming about as a result.\n\nJust so you understand, I would love to see a workable collaborative model for type design set up, as it would make type design more approachable for people who are intimidated by the prospect of taking on the entire process by themselves. I am just trying to point out how it might not work, as I'm not convinced the open software or Wikipedia models of collaboration will translate to the type design process.\n\nI see a modular approach as being necessary for successful collaboration. It could go like this:\n\nA designs the basic lowercase and uppercase alphabet.  \nB designs the numerals to harmonize with the alphabet.  \nC and D design punctuation and diacritics to fill out the basic character set.\n\nThroughout, the designers give each other feedback, but rather than freely editing one another's designs, allow the original designer to incorporate the others' suggestions in modifying his or her design. A sort of creative director over the entire project may come handy if there are disagreements over creative direction. Constant cooperation would be required just in order to maintain consistent spacing and design detail for the characters.\n\nLater on, teams consisting of the same members or new ones could add italics, different weights, expand into different writing systems, etc. using this modular approach.\n\nIn practice, it would be more efficient were these modules to be combined where possible; it is easier to get a consistent result with a single designer working on all the glyphs of the basic character set rather than with multiple designers. But then people might be more willing to contribute if the workload is less. The trouble would be to determine which contributors are competent enough and to maintain a high standard of design throughout the modules. This doesn't look to be at all easy.\n\n"
    },
    {
      "time": "30 Jan 2009 — 8:21am",
      "content": "Here's something that was done collaboratively - letters were designed by the crowd and submitted via email:  \n [http://www.bittbox.com/freebies/bb-free-font-conglomerfont/](http://web.archive.org/web/20130821034152/http:/www.bittbox.com/freebies/bb-free-font-conglomerfont/ \"http://www.bittbox.com/freebies/bb-free-font-conglomerfont/\")\n\nIn any case, a benevolent dictator (read \"manager\") is needed to ensure a final, serviceable product. Although I suppose a team of managers would also work as long as there was an overarching and agreed upon vision.\n\n"
    },
    {
      "time": "30 Jan 2009 — 10:01am",
      "content": "\\>Since you say it would be extremely fun and entertaining to watch such projects develop, do you agree that its the available tools that are the problem? Or is there something else inherent in the process of type design that I’m missing?\n\nNo I don’t think it’s a matter of tools. Managing large collaborative font development projects is hard for a variety of reasons, even when everyone involved is employed by a single company, with a clear spec, with set milestones and deliverables. I think adding the prospect of including many unpaid, part-time resources to such a project would make it even more difficult, and unappealing, and somewhat outside the comfort zone of the people best suited to running such projects.\n\nOne alternative option might be to have a trinity of strong-men run the project… “the father” an upstanding leader from the type world as the figurehead, “the son” the person who does all the actual co-ordination passing the work to the father to be blessed, and the “holy ghost” someone from the OSS world who can ensure all the OSS religious rites are adhered to.\n\n"
    },
    {
      "time": "31 Jan 2009 — 5:45am",
      "content": "\"Isn’t it only thanks to the Digital Age that a single individual can hope to create a whole typeface from start to finish?\"  \nI don't think so, as both metal and film fonts were created individually for decades. Manufacture changed in the digital age and distribution changed in the internet age. Specification has apparently changed in the idiot age.\n\n\"It could go like this: A designs the basic lowercase and uppercase alphabet. B designs the numerals to harmonize with the alphabet.  \nC and D design punctuation and diacritics to fill out the basic character set.\"  \nGeeeeeze. Can three women have a baby in 3 months now because of technology?\n\nCheers!\n\n"
    },
    {
      "time": "31 Jan 2009 — 10:38am",
      "content": "Collaboration in action thanks to Typophile, apparently: [Open Baskerville](http://web.archive.org/web/20130821034152/http:/klepas.org/openbaskerville).\n\n"
    },
    {
      "time": "31 Jan 2009 — 9:37pm",
      "content": "Two things:\n\nI think that lack of good tools/workflow for collaborative type design is a problem, but absolutely not the \\*only\\* problem for such an effort.\n\nI think I disagree with Si that none of the people who could reasonably be master architect of such an effort would be interested, even for pay. However, I'll believe that perhaps \\*most\\* of the people who could do so would not be interested.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "1 Feb 2009 — 7:17am",
      "content": "I know 'proyectodemo'\n\n[http://www.proyectodemo.cl/blog/](http://web.archive.org/web/20130821034152/http:/www.proyectodemo.cl/blog/ \"http://www.proyectodemo.cl/blog/\")\n\nThis is not 'open source type design' project at all, but is a collaborative 'game' when many Argentines and Chileans recognized typographers worked in a font design, the 'football typo match' lasted 8 weeks\n\nProbably these designers never heard about 'open source / collaborative font design', but I do not think that is an eccentricity suggests the possibility of collaborative projects like this in the FLOSS context if some typographers are interested, the internet promote spontaneous collaborative projects all the time..\n\nproyecto demo team\n\nÁrbitro Andreu Balius\n\nChile  \n Francisco Gálvez (DT)  \n Rodrigo Ramírez  \n Tono Rojas  \n Kote Soto  \n Luciano Vergara  \n Felipe Cáceres\n\nArgentina  \n Alejandro Paul (DT)  \n Eduardo Tunni  \n Alejandro lo Celso  \n Eduardo Manso  \n José Scaglione  \n Pablo Cosgaya\n\n[http://www.proyectodemo.cl/blog/?page\\_id=3](http://web.archive.org/web/20130821034152/http:/www.proyectodemo.cl/blog/?page_id=3 \"http://www.proyectodemo.cl/blog/?page\\_id=3\")\n\n¿por qué demo? (why Demo?)  \n[...]  \n3.- Demo, de demostrar que es posible juntar a un grupo de amigos, ¡simplemente para pasarlo bien, haciendo algo que nos gusta!\n\n(3- Demo, from 'demostrate' that is possible to gather a group of friends, Just for fun, doing something we love!)\n\nmany open source projects started as fun and ended up as business...\n\nsaludos!\n\n"
    }
  ]
}
