{
  "id": "54125",
  "title": "Wordmark + logo for a wedding photographer",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm currently working with a wedding photographer to develop a wordmark, logo (to be used primarily as a watermark), and business card.\n\nI've attached the wordmark and logo for critique. The client loved the wordmark and has approved it, but I would still like to hear your thoughts.\n\nI'm new here and hope to post more work in the future. Thanks for your feedback.\n\n ![](http://web.archive.org/web/20140414005614im_/http:/typophile.com/files/NBP_4417.png)\n\n ![](http://web.archive.org/web/20140414005614im_/http:/typophile.com/files/NBP2_5564.png)\n\n",
  "author": "jrdn.clrk",
  "time": "28 Jan 2009 — 7:04pm",
  "uid": "40660",
  "comments": [
    {
      "time": "28 Jan 2009 — 7:11pm",
      "content": "so much to look at ... and Christmas theme?\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20140414005614/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20140414005614/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": "28 Jan 2009 — 7:27pm",
      "content": "Are you referring to the birds? I'm not sure how I feel about them, but the client is pretty adamant that they be included. I think it is a decent idea in theory, I just hope it doesn't look corny. Perhaps one should be a bit smaller, like the rings in the wordmark.\n\n"
    },
    {
      "time": "28 Jan 2009 — 7:49pm",
      "content": "I didn't read them as birds to begin with not till I saw the comment. I don't think that the top logo with the huge k e r n i n g is that effective. You have high kerning in everything. Tighten up the letters in nicole brown. Also, I don't know if I would go with both of those n's. I like one because it is unique two makes it look repetitive and they are not quite the same so its a little weird. I would also make the rings just a tad thicker than what they are (I don't feel like they would communicate in a 1inch x 1inch space like a good logo should.\n\n"
    },
    {
      "time": "28 Jan 2009 — 9:03pm",
      "content": "thanks for the comments.\n\nI agree about the rings, they should be a bit thicker. Interesting note about the kerning; the 'nicole brown' is kerned very little, if at all. The typeface (Novarese) is naturally loose, and that coupled with the modified 'o' could be leaving things looking too spaced out.\n\n"
    },
    {
      "time": "28 Jan 2009 — 9:25pm",
      "content": "I think you can do away with the italicised \"n\" on the logo. I'm not so sure about the birds. Maybe just a simple circle?\n\n"
    },
    {
      "time": "29 Jan 2009 — 1:01pm",
      "content": "re: ratbaggy's sentiments, I'd try simplifying. the 'rings' idea works best and reads quickest, so focus efforts there. the other ligatures are distracting. like the colors.\n\n"
    }
  ]
}
