{
  "id": "5412",
  "title": "Indesign. Films printed using Font vs. paths",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I hope someone is still up and can help me on this.   \n   \nI've always used PC and had several problems on some os the works I've done on Xpress regarding the fonts and mac transmigration. The last one was a CD where I've used Requiem, built the deisgn on Xpress and as the printing of the films would be made on Germany, so I've sent the files to them. The result was a disaster, the font output gave me type A LOT SMALLER. They never replied to my technical question, so now that I'm on the process of printing a new work on a mac I question:   \n   \n1. I've switched to InDesign. Just finished a new work and will develop the films tomorrow. Before outputing to films, I've printed the same page using a PDF output (font included) and the Indesign document with the font converted to paths. There is a hugeeeeee diference. The convert to path gives the text a more black text. The PDF print is much more soft. Would you print the FILMS from the Indesign with the fonts (would have to give them to the films company, install etc) or use the convert to paths?   \n   \n2. That Requiem example, where I got a so much smaller type, can anyone explain? I can place a PDF with the original PC output and a photo of the final artwork.   \n   \nThanks!\n\n",
  "author": "adriano",
  "time": "29 Jun 2004 — 5:30pm",
  "uid": "1735",
  "comments": [
    {
      "time": "29 Jun 2004 — 5:45pm",
      "content": "Interestingly, neither of these issues really has anything to do with PC versus Mac. They're both general workflow issues. There are two things going on:   \n   \n- when outputting a PDF from Acrobat, in the print dialog there is an option (in English, in Acrobat 6) in the \"Paper handling\" section called \"Paper scaling\" with the setting \"shrink to paper.\" This is often ON and needs to be set instead to \"None.\"   \n   \n- Converting text to outlines always results in slightly heavier text, due to differences in the way PostScript fills text as opposed to graphics.   \n   \nI hope this is helpful.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "29 Jun 2004 — 6:11pm",
      "content": "Thanks Thomas.~Tomorrow I'll upload images of that particular problem I had. I also believe that it was somekind of \"human\" error, tomorrow we'll see.   \n   \n\"Slightly\". hum... Interesting, maybe I did printed the PDF with that option selected. As a general rule do the typophiles people make Films with fonts or with convert to paths?\n\n"
    }
  ]
}
