{
  "id": "54130",
  "title": "Fanline",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "First actual font (and by that I mean the first one that has made it this far!)\n\nI started this font about three days ago from a sketch of the letter 'a' I did on Sunday. At the moment, only lowercase letters have been completed. It's not one of those fonts you would set a book in, but it might be useful for the occasional heading.\n\nAny tips would be greatly appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [Fanline.png](http://web.archive.org/web/20140714014404/http:/typophile.com/files/Fanline.png) | 69.96 KB |\n| [Fanline2.png](http://web.archive.org/web/20140714014404/http:/typophile.com/files/Fanline2.png) | 49.09 KB |\n| [Fanline.pdf](http://web.archive.org/web/20140714014404/http:/typophile.com/files/Fanline.pdf) | 16.72 KB |\n\n",
  "author": "cdavidson",
  "time": "28 Jan 2009 — 9:16pm",
  "uid": "37459",
  "comments": [
    {
      "time": "29 Jan 2009 — 9:34pm",
      "content": "this would make a good italic of another font – something along the lines of Joanna and its accompanying italic.\n\nCouple of things for me: 1. the \"t\" crossbar so high really breaks the rhythm when you set it with other characters 2. the tilt on the top of the \"k\" & \"b\" have you thought about it being straight?\n\n"
    },
    {
      "time": "30 Jan 2009 — 5:33am",
      "content": "Good work. At my own, I find the “e” and the “o” should be less italic compare to the a and the c. I agreed the “t” crossbar is too high\n\n"
    },
    {
      "time": "31 Jan 2009 — 1:18am",
      "content": "Added the caps and some symbols.\n\nLowercase looks okay (and I'd be happy with it if it was only lowercase), the caps still need a lot of work. I don't think they go to well with the lowercase... they almost look too flowery.\n\nI've lowered the \"t\" crossbar and adjusted the rotation on the \"o\" and the \"e\".\n\n[http://typophile.com/files/Fanline2.png](http://web.archive.org/web/20140714014404/http:/typophile.com/files/Fanline2.png \"http://typophile.com/files/Fanline2.png\")\n\n"
    },
    {
      "time": "31 Jan 2009 — 4:32am",
      "content": "It would be a better idea to post a pdf of your file. Some letters in the caps have to be fixed. The crossbar of the J is too large, it looks like the T wiht a bottom curve. The H is not wide enough. The top crossbar of the F should be more to the right than to the left, the F is almost [but not] an E without the bottom bar, the middle bar could be a bit lower than the E one to avoid to have a large white space under. I hope this will help you.\n\n"
    },
    {
      "time": "4 Feb 2009 — 8:49pm",
      "content": "Here's another revision.\n\n[http://typophile.com/files/Fanline.pdf](http://web.archive.org/web/20140714014404/http:/typophile.com/files/Fanline.pdf \"http://typophile.com/files/Fanline.pdf\")\n\nI have reworked the capitals and fixed some of the kerning. I'm still not liking the fact that some lowercase letters such as the \"g\" and the \"y\" clash with characters such as the \"h\" and the \"l\" on the line below, but hopefully there will be a way to fix that.\n\nIn the example, you can also see the \"ff\" ligature. This was just a bit of testing I was doing, and I forgot it was included when I built the font.\n\n"
    },
    {
      "time": "9 Feb 2009 — 10:18pm",
      "content": "ff ligature is nice..but the kerning between the i & the ff is odd. I would watch the spaces..give it a little more room. Also, the dots on the i & j get lost in smaller sizes..something to look into maybe?\n\n"
    }
  ]
}
