{
  "id": "54170",
  "title": "Design Periods",
  "forum": "srquresh's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20131017185441im_/http:/typophile.com/files/LivemontPrivat_5533.jpg)\n  \nArt Nouveau: Absinthe Robette by Livemont Privat  \nI did a project on art nouveau last semester, and so Ive become very familiar with many designers, and font faces from that period. This is a great poster, done by one of the designers regaurded as one of the masters of the poster industry at that time. Art Nouveau posters tend to have very curvilinear shapes (as you can see in this poster) and make use of many lines and motifs found in nature. There is alot of use of flowers and vines, along with the female figure. Fonts used in this time period include Avant Guarde, Benguait, and Arnold Boecklin.\n\n ![](http://web.archive.org/web/20131017185441im_/http:/typophile.com/files/VonStuckFranz_5663.jpg)\n  \nSuccession by Von Stuck Franz  \nThe Vienna Succession was also known as the Union of Austrian Artists. The movement was a protest of the younger generation against traditional art. It was a separation from the past towards the future(like most periods, right?). The first chairman was Gustav Klimt. I like the type used in this period. It's very long and narrow, and much like art nouveau in terms of stylized type. It has influences from the arts and crafts movement. \n\n ![](http://web.archive.org/web/20131017185441im_/http:/typophile.com/files/Fischer-NovischDorothea_5278.jpg)\n  \nMarilyn Monroe by Fischer-Nosbisch, Dorothea  \nPop art is a design movement that emerged in the late 1960s in the United States. One of the most memorable designers from this period is Andy Warhol. I chose this poster to protray pop art, because I feel like everyone has already seen Andy Warhol's works. So here is Marilyn Monroe. In German. I love how the type fills the dress. The type is a san serif font and it is a little distorted in order to follow the curves in the dress. \n",
  "author": "srquresh",
  "time": "29 Jan 2009 — 2:47pm",
  "uid": "41403",
  "comments": [
    {
      "time": "3 Feb 2009 — 5:47pm",
      "content": "love your pop art example! what a great example of text  \nreplacing image...nice!\n\n"
    }
  ]
}
