{
  "id": "5417",
  "title": "Al Nadeem Information Technology",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Dear please look this alnadeem's existing logo. i am trying to redesign this logo   \n   \n ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/39590.jpg)   \n   \nI changed new fonts but still i am not satisfied   \n   \n ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/39591.jpg)\n\n",
  "author": "gopan",
  "time": "30 Jun 2004 — 2:36am",
  "uid": "4029",
  "comments": [
    {
      "time": "30 Jun 2004 — 2:51am",
      "content": "I think the Arabic and the roman letters are too close, I don\n\n"
    },
    {
      "time": "30 Jun 2004 — 5:01am",
      "content": "![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/39598.jpg)   \n   \nplease check this\n\n"
    },
    {
      "time": "30 Jun 2004 — 7:20am",
      "content": "R. A couple of suggestions that apply to you and to alot of other people. Consider reading the books, Elements of Typographic style by Robert Bringhurst, The New Typogrqaphy by Jan Tshichold, and Treasury of Alphabets and Lettering by Jan Tshichold. These books will help you make quality design desicisions based on the central principles of typography and graphic design. No the rules before you break the rules. As for the logo presented, it kind of reminds me of an acitve wear company for lazy men and women. My advice is to dig deep deep deep into your soul and you will most likely find the solution you are looking for.\n\n"
    },
    {
      "time": "30 Jun 2004 — 8:29am",
      "content": "Rule#1 Never be satisfied.\n\n"
    },
    {
      "time": "30 Jun 2004 — 9:28am",
      "content": "I agree that the symbol needs work. The illustration of the man should probably take on more characteristics of the Arabic forms used, to bring a cohesiveness to the whole that isn't quite there yet. The logo you present (the one with the small type) is certainly a step in the right direction, but it's a small step. Try ideas that push you far from the original (unless you were told not to) and use those new ideas to find a good balance.   \n   \nSince the symbol seems to be the most important part, I'd focus on that first, and let the type choice follow. Also think of ways to mirror curves from the type in the symbol, or the symbol in the type.\n\n"
    },
    {
      "time": "30 Jun 2004 — 9:56pm",
      "content": "please reffer me some books for good in brand and identity.\n\n"
    },
    {
      "time": "30 Jun 2004 — 10:08pm",
      "content": "Please check this ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/39685.jpg)\n\n"
    },
    {
      "time": "30 Jun 2004 — 10:19pm",
      "content": "![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/39688.jpg)\n\n"
    },
    {
      "time": "30 Jun 2004 — 11:42pm",
      "content": "I think we may not be totally qualified to judge the design of Mr.Gopakumar, being most of us so \"occidentals\". I don\n\n"
    },
    {
      "time": "1 Jul 2004 — 12:15am",
      "content": "Dear all   \n   \nThank you all for your suggestions. Bahrain (meaning of the name \"Bahrain is four seas\") is a country in the Middle East.   \n   \nAl Nadeem ( [http://www.alnadeem.com](http://web.archive.org/web/20131019234703/http:/www.alnadeem.com/))is one of the major web solutions (ISP)   \nCompany in Bahrain.   \n   \nWe have represented leading Ministries, Gov. Sectors, Airlines ( [http://www.gulfairco.com](http://web.archive.org/web/20131019234703/http:/www.gulfairco.com/) ) Banks ( [http://www.bbkonline.com](http://web.archive.org/web/20131019234703/http:/www.bbkonline.com/)), our main focus is in to Web designing, Multimedia, eCommerce, software solutions, networking, IT telephony etc\n\n"
    },
    {
      "time": "4 Jul 2004 — 4:35am",
      "content": "![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/39920.jpg)   \n   \nsome forms related my logo\n\n"
    },
    {
      "time": "5 Jul 2004 — 9:49pm",
      "content": "please guide me\n\n"
    },
    {
      "time": "7 Jul 2004 — 9:51pm",
      "content": "no body is responding my logo what happened please tell your comments\n\n"
    },
    {
      "time": "7 Jul 2004 — 10:24pm",
      "content": "Hey R.   \n   \nIt is a bit hard to respond when you don't post specific questions or thoughts to let us know where you are at in the identity design process . . .   \n   \nWhat do you want the new logo to communicate? Do you want to keep a figure similar to the one in the original logo, or is it a possibility to create a whole new image?   \n   \nKeep experimenting with different logo ideas--maybe it would help to post a few logos that are each taken in very different directions . . . right now it still seems like you are still at the conceptualizing point and it is hard to critique in that situation.   \n   \nOverall, from what you have posted, the logo looks like it is for something to do with sports, very action-oriented.   \n   \nKeep working at it!\n\n"
    },
    {
      "time": "8 Jul 2004 — 12:17pm",
      "content": "I feel that the symbol is very individually oriented, it doesn\n\n"
    },
    {
      "time": "17 Jul 2004 — 11:49am",
      "content": "In the West the swoosh is overdone, but maybe in the Middle East it can be used to good effect. Although the first thing I think of when I see the logo is a fitness club, I like the idea of combining the Arabic \"noon\" (on top, good) and the Latin \"n\" (although I think you need a small stem on the top-left - that would actually be a nice clue that it's letters - otherwise I think it's too subtle).   \n   \nAs for the name settings, because Arabic is small on the body you'll always have some trouble getting the relative apparent weight/importance to match up. Your first solution (bigger Arabic type, but in a lighter tint) isn't bad. Although the Kufi style matches neither Palatino nor the logo, I don't think.   \n   \nI think Eurostile might work (another element overused in the West but maybe OK there), but you need to make a nice-looking Arabic Eurostile match (not what you have now). BTW, if you make an Arabic font to match an existing Latin font, make sure not to make it too Latinized - although a little bit is OK here, considering the subject.   \n   \nBTW, in your setting with the curved text lines top and bottom, I'm not sure a kasheeda can go between the \"noon\" and the \"daal\".   \n   \n\\> \"Bahrain is four seas\"   \n   \nNot TWO seas? The \"ain\" suffix in Arabic means \"two of them\". The singular is \"bahr\", and the plural \"bihaar\", I think. (In Arabic the plural of a feminine word gets an \"aat\" suffix, but masculines are irregular - and it can get pretty funny, like when a foreign word gets pluralized: \"jante\" means a car wheel in French, and in Lebanon the plural is either \"jnaat\", \"jantaat\", \"janat\" or \"jnoot\" - you can actually tell which part of the country somebody's from depending on how they pluralize \"jante\". ;-)   \n   \n--   \n   \nIf you need further help, you might try these two experts: Nadine Chahine, and Habib Khoury.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Sep 2004 — 12:21am",
      "content": "![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/49892.jpg)   \n   \nPlease disguise my new alnadeem information technology logo\n\n"
    },
    {
      "time": "27 Sep 2004 — 12:37am",
      "content": "Please disguise my new alnadeem information technology logo\n\n"
    },
    {
      "time": "3 Oct 2004 — 3:58pm",
      "content": "Hi R.G (Hi typophile members)   \n   \nI like your original mark, I just think it's a little weak to be placed on the blue/gray background as a negative cut-out. Why not try the \"guy\" in one one solid colour with just a ring around him and go with the type from your last posting.\n\n"
    },
    {
      "time": "4 Oct 2004 — 12:16am",
      "content": "Thanks for your suggestion i will do my best please check this logo also ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50423.jpg)\n\n"
    },
    {
      "time": "4 Oct 2004 — 1:26am",
      "content": "another sample ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50430.jpg)\n\n"
    },
    {
      "time": "4 Oct 2004 — 3:36am",
      "content": "![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50433.jpg)   \n   \nsee this also\n\n"
    },
    {
      "time": "4 Oct 2004 — 3:49am",
      "content": "A rule of thumb with strong designers is don't go for trendy techniques like gradiations. They distract from the idea, try your dancing person with a double circle around it and loose the gradient. I do like the blue and gray color combination.\n\n"
    },
    {
      "time": "4 Oct 2004 — 5:51pm",
      "content": "My favorite is the 4th one in your next-to-last post (1:26 am), the negative dancer in the circle. But I would make the outward arm and the outward leg stick out of the circle (and of course become positive). For one thing that would make the figure larger.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Oct 2004 — 9:05pm",
      "content": "I was trying to post this earlier this morning, but I wasn't having any luck. It still seems valid, so here it is\n\n"
    },
    {
      "time": "5 Oct 2004 — 1:51pm",
      "content": "I personally like the last logo of the post 45. I mean, the rectangle with the ball as representing the idea of connection. I would try to do a circle instead of a rectangle and to put two balls on an equilibrate way on it.   \n   \nAs Daniel says, avoid the gradations and the circle with relief.   \n   \nAlso, why dont try making the man holding on airthe \"balls queue\" you made on post 44?   \n   \nFinally, it would work to make the man bigger and to put it aligned horizontal with typo \"alnadeen\".   \n   \nWell, those are my little suggestions..\n\n"
    },
    {
      "time": "6 Oct 2004 — 10:22pm",
      "content": "Please see this ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50683.jpg)\n\n"
    },
    {
      "time": "7 Oct 2004 — 8:02am",
      "content": "The type is nice and the icon is nice, but I'm not sure that they go together. The letterforms are simple and have fairly consistent weight, while the icon is a little more complex and has significant weight variance. Have you tried knocking the figure out of a solid gray oval? I think that would be a good start in simplifying the icon to a level consistent with the type.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "8 Oct 2004 — 9:40pm",
      "content": "please see this ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50859.jpg)\n\n"
    },
    {
      "time": "8 Oct 2004 — 10:13pm",
      "content": "see this also ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50862.jpg)\n\n"
    },
    {
      "time": "9 Oct 2004 — 2:17am",
      "content": "check this also ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50871.jpg) ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50872.jpg)\n\n"
    },
    {
      "time": "11 Oct 2004 — 1:41am",
      "content": "i like this also ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50953.jpg)\n\n"
    },
    {
      "time": "11 Oct 2004 — 5:28am",
      "content": "just playing with some ideas you done before   \n ![alnadeemgp](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50965.jpg)\n\n"
    },
    {
      "time": "11 Oct 2004 — 8:04am",
      "content": "thank you very much for your implimentation.i think the first one is more clear, this text is by drawed or fonts?\n\n"
    },
    {
      "time": "11 Oct 2004 — 9:51am",
      "content": "it's a font (aero display Ssi), I think it works well.\n\n"
    },
    {
      "time": "11 Oct 2004 — 12:47pm",
      "content": "I didn't read through all the comments but I just had one concern - the symbol - it's very reminecent of the Olympic pictograms and even closer to those used by \"Les Jeux de la Francophonie\"\n\n"
    },
    {
      "time": "11 Oct 2004 — 12:59pm",
      "content": "here's a visual of their logo - which includes the symbols that are used extensively throughout their identity and event pictograms   \n ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/50990.jpg)\n\n"
    },
    {
      "time": "11 Oct 2004 — 1:39pm",
      "content": "I think its time for you to show some of your ideas and let the decision makers point you in the direction that expresses the companies vision of itself. You are beginning to go all over the map. You need to focus the design now.\n\n"
    },
    {
      "time": "12 Oct 2004 — 2:49am",
      "content": "I did Gian Pablo logo reverse but feeling not much strong than old ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/51019.jpg)\n\n"
    },
    {
      "time": "12 Oct 2004 — 5:00am",
      "content": "Hi,   \n   \nI've been reading these posts with interest. I'm certainly less qualified to give advice than most of the other people posting but I'm going to voice my opinion anyway ![:-)](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nWhat does a little dancing man have to do with hosting or bandwidth? I presume he's supposed to be happy because of the excellent service he receives from alnadeem? That could be used to justify using a little character dancing for almost every business in the world. I'd drop the little man, he doesn't give anything to the logo.   \n   \nWhilst it's a little predictable, I like post #44. I think it's way stronger than anything else here. Firstly it's simple and abstract which feels like a telecommunications based company. Secondly, a wave is relevent to what alnadeem seem to do.   \n   \nFinally I would not drop the double language. By keeping arabic and latin alphabets united you imply an international identity which fits nicely into the idea of world commerce and breaking national boundaries that the web (and one might presume, your customers) aspire to.   \n   \nThat's what I think anyways.\n\n"
    },
    {
      "time": "12 Oct 2004 — 12:45pm",
      "content": "I agree that post #44 is the strongest of the bunch.   \n   \nHowever, don't underestimate the impact of a little active man...   \n   \n ![AOL IM running man](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/51051.gif)\n\n"
    },
    {
      "time": "12 Oct 2004 — 1:01pm",
      "content": "![directrash](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/51054.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "12 Oct 2004 — 3:31pm",
      "content": "Hrant, is that Armenian On Line?\n\n"
    },
    {
      "time": "12 Oct 2004 — 4:33pm",
      "content": "Just doing my part in their Direct Trash campaign.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Oct 2004 — 3:49am",
      "content": "First of all thank you for your comments. Still I am in bit confusion; whether I need to go through the dancing man or stick on abstraction of modulating signal.   \n   \nPersonally I feel that the second option would be the best. So I need to concentrate on this and I request to send your valuable comments on this for the final touch.   \n   \n ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/51105.jpg)\n\n"
    },
    {
      "time": "23 Oct 2004 — 4:33am",
      "content": "dear all please give me a final comments for my new logo.   \n   \n ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/51883.jpg)\n\n"
    },
    {
      "time": "23 Oct 2004 — 10:54am",
      "content": "I like the more flowing style of post 44 in contrast to this pixel looking version. Post 44's icon seems to go better with the curves of the Arabic writing. Maybe it will help if you take this last icon and give the small squares radius edges like the larger one. While you're at it, increase the radius to match the arc in the Arabic writing's radius.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "23 Oct 2004 — 10:08pm",
      "content": "Hi Scott,   \n   \nI appreciate your response on this post, I value all of your comments on my Logo.   \n   \nAs a matter of fact, I am refering to Pixel (the basics of digital world) and a lot of pixels rythm to modulation. I am posting the changes as suggested by Scott and will appreciate further comments... ![](http://web.archive.org/web/20131019234703im_/http:/www.typophile.com/forums/messages/29/51916.jpg)\n\n"
    },
    {
      "time": "25 Oct 2004 — 3:37am",
      "content": "I also prefered the smooth curves for the icon.   \n   \nI'd move the arabic writing closer to the icon. Because it has a sense of continuous line it would feed nicely into the wave and there seems to be an appropriate metaphor there.\n\n"
    },
    {
      "time": "1 Nov 2004 — 6:02am",
      "content": "i agree with benjie\n\n"
    }
  ]
}
