{
  "id": "54172",
  "title": "Le Monde redesign (26 January 2009)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "_Le Monde_ went through what I think is the first major design overhaul since November 2005 (mentioned in [this old thread](http://web.archive.org/web/20130821084346/http:/typophile.com/node/16071)) on Monday, 26 January.\n\nThere is an [audio slideshow](http://web.archive.org/web/20130821084346/http:/www.lemonde.fr/actualite-medias/portfolio/2009/01/23/le-monde-renove-sa-maquette_1145482_3236.html) on the _Le Monde_ homepage about the redesign, narrated in French. There is also [an editorial](http://web.archive.org/web/20130821084346/http:/www.lemonde.fr/opinions/article/2009/01/24/renovation-par-eric-fottorino_1146007_3232.html#ens_id=1142910) about the redesign, also in French. However, neither goes into any real detail about the typographical aspect of the redesign. In fact, I am having trouble finding any in-depth information at all about this redesign.\n\nI finally have this week's issues of _Le Monde_ in my hands, and I can see that [Rocky](http://web.archive.org/web/20130821084346/http:/www.fontbureau.com/fonts/Rocky) and Fenway by Matthew Carter are no longer, although [Benton Sans](http://web.archive.org/web/20130821084346/http:/www.fontbureau.com/fonts/BentonSans) has been retained. So what are the new typefaces for headlines and body text? Actually, they seem to be using the same serif typeface for both headlines and body text; I'm not even sure they are different cuts. I haven't been able to identify the typeface, but I'm sure someone here can tell me (or should I make a separate request at the Type ID forum?).\n\nHas anyone else seen the redesign? What do you think of the new typeface?\n\n",
  "author": "Jongseong",
  "time": "29 Jan 2009 — 2:59pm",
  "uid": "12009",
  "comments": [
    {
      "time": "29 Jan 2009 — 5:13pm",
      "content": "The headline serif could be [TheAntiqua Light](http://web.archive.org/web/20130821084346/http:/www.fontshop.com/search/?q=TheAntiqua&x=0&y=0).\n\n"
    },
    {
      "time": "29 Jan 2009 — 11:59pm",
      "content": "Thanks Jan! Both the headline and body text are indeed TheAntiqua. I think it's the regular weight of TheAntiqua B used for both; the headline is of course tightly tracked and might be slightly condensed. I was pretty sure I'd seen the typeface before, but I started doubting when I couldn't come up with anything.\n\nIn headlines, TheAntiqua comes across as more friendly to me than the somewhat austere Rocky, perhaps too informal. I guess it's the lack of sharp corners. Maybe I'm just used to headlines employing display cuts with greater stroke contrast and fine details.\n\n"
    }
  ]
}
