{
  "id": "54221",
  "title": "When critique matters",
  "forum": "Marcelo Soler's blog",
  "tags": [

  ],
  "content": "After considering several opinions on my newspaper aimed typeface [Novena text](http://web.archive.org/web/20150419044012/http:/typophile.com/node/54211) I released a [new beta version](http://web.archive.org/web/20150419044012/http:/typophile.com/node/54211), completely renewed in its details.  \nIn the meanwhile, I won the attention of some locale publisher who looked at sketches and a couple of hardcopies I left under a table, so the encouraged me to work in order to apply Novena in their publications.\n\n ![](http://web.archive.org/web/20150419044012im_/http:/typophile.com/files/Novena_Typophile_5841.jpg)\n  \nThere is an attachment for printing: a light-weight 4 pages PDF that better demonstrates how it actually prints, that's its main target.  \nSo, next steps are finishing my regular text version and accelerating the work on the rest of the family.  \nI hope not to disappoint expectations and, for that reason, I need a lot of critique from Typophiles.\n\n**MarS**\n\n| Attachment | Size |\n| --- | --- |\n| [Novena\\_Typophile.pdf](http://web.archive.org/web/20150419044012/http:/typophile.com/files/Novena_Typophile_4.pdf) | 50.92 KB |\n\n",
  "author": "Marcelo Soler",
  "time": "30 Jan 2009 — 4:27pm",
  "uid": "32203",
  "comments": [
    {
      "time": "31 Jan 2009 — 5:12am",
      "content": "I'm sorry there's so little critique on this one. I've seen it posted several times now and it's definitly good enough to get some attention. It's a lovely typeface, but there's really nothing about it that strikes me.\n\nThe terminal on lc \"a\" could be more exciting. The same goes for the ear on lc \"g\". The ear also forms a dark spot which you might want to correct optically. The leftmost stroke in uc \"Æ\" should lean that much, in my opinion. The letter is a bit wide. I love the lc \"t\". Lc \"x\" has some problems with the serifs on the thick diagonal.\n\nAll in all, I'm bothered by the lack of human details despite the leaning stress. It feels very mechanical.\n\n"
    },
    {
      "time": "31 Jan 2009 — 6:06am",
      "content": "Thank you, Frode!  \nI'll keep on working.  \nAs I use to say, I love the way better than the destination.  \nBy the way: what your think about these two previous version of lowercase a?\n\n ![](http://web.archive.org/web/20150419044012im_/http:/typophile.com/files/a_or_a_4027.jpg)\n  \nThanks again. \n"
    },
    {
      "time": "31 Jan 2009 — 9:04am",
      "content": "I'm talking about the top terminal. I'm not really familiar with the terminology:)\n\n"
    },
    {
      "time": "31 Jan 2009 — 11:50am",
      "content": "I feel a bit like Frode about this. It looks so polished that it's hard to see where there might be some room for work – especially for a beginner like myself.  \nIt's quite impressive! Though I do agree about the \"mechanical\" look; it feels very \"cool\", and could maybe be more distinctive. I must say I'm impressed with this, but it doesn't excite me on a deeper level, or feel like something I've never seen before. Though I guess that's not the worst thing that can be said about a newspaper face.\n\nOne thing I've been wondering about is some of the proportions (and bear in mind this is coming from someone working on her first font – so take with a big grain of salt).  \nSpecifically, the \"n\" (& thus, the \"h\") looks a hair narrow to me when compared to say the \"o\" and \"bdpq\". Actually, the \"n\" even seems narrow compared to the \"m\" and the \"u\", the \"m\" looking like it's about 2 units short of being a perfect duplication of the \"n\", and the \"u\" almost exactly equal in width to the \"n\". Is that intentional?\n\nSpeaking of the \"u\", its bottom left might be a tad heavy/lumpy (the same is true for the analogous curve in the \"n\"). And the (unparalleled?) upwards motion of the \"u\" serifs feels odd – but I think I have a personal problem understanding \"u\" serifs. ;-)\n\nAnd I dare hardly say this, but the \"9\" still feels a bit unbalanced, though I can't really say why.\n\nApart from that, I don't think I can offer much helpful input. I wonder where the experts are?\n\n"
    },
    {
      "time": "31 Jan 2009 — 5:19pm",
      "content": "Wow! I'm really shocked by your latest comments, at the point I feel myself strange and confused —I cannot blame anybody for that.\n\nAfter reading, I put hands on work trying to correct what I did bad and... oops! I forgot to backup the original version so I made a disaster. Fortunately I recovered it from the OT font, though I missed a lot of stuff like masks, guidelines and so.\n\nNevertheless, it did not discourage me: curiously I love to hear critiques and start over again and again —even when I lose an entire font file ;-)\n\n**Nina:** _Actually, the “n” even seems narrow compared to the “m” and the “u”, the “m” looking like it’s about 2 units short of being a perfect duplication of the “n”, and the “u” almost exactly equal in width to the “n”. Is that intentional?_\n\n1. Look at these four pictures, where I compare proportions of the pair “m-n” on Novena (before I broke it) and Georgia (quite different, I guess) by placing the “n” within the mask:\n\n ![](http://web.archive.org/web/20150419044012im_/http:/typophile.com/files/m1_5374.jpg)\n\n ![](http://web.archive.org/web/20150419044012im_/http:/typophile.com/files/m2_6489.jpg)\n\n2. Almost the same happens by turning the “n” upside down and comparing against the “u” (the “n” is within the mask space again):\n\n ![](http://web.archive.org/web/20150419044012im_/http:/typophile.com/files/u1_5343.jpg)\n\n ![](http://web.archive.org/web/20150419044012im_/http:/typophile.com/files/u2_6678.jpg)\n\n3. I loved your newborn Ernestina at a first glance (I'll make my comments later).\n\nHuh! I think that **there** is the reason by which you friends find the face so “mechanical”: in my obsessive search of matching the propper measurements and proportions, I missed the fact that type design —design as a whole— is the triumph of sensitivity over given rules to create its own rules.\n\nWell, it's late now to deal with philosophy, and I must face a hard work on that wretched font.  \nThank you.\n\n**MarS**\n\n"
    },
    {
      "time": "1 Feb 2009 — 2:55am",
      "content": "Marcelo,\n\nI'm sorry if I came across too harsh. I honestly think this is an impressive, and already very polished, font, which could maybe just use a little treatment with the diamond file here and there :-). And since you seemed quite desperate to get more feed-back on it, I figured I'd note some things that struck me – but like I said:  \nYou really shouldn't follow \\*my\\* opinion to the letter! (Ignore the bad pun.)\n\n_forgot to backup the original version so I made a disaster_  \n:-{  \nGet a backup strategy. I've been there, & since then I've become quite religious about doing daily backups of all the stuff I'm working on. (Also, keeping multiple [dated] versions is a good idea.)\n\nRe the \"m\" and \"n\", I guess we're looking at different fonts for guidance/input ;-). Here's Swift and Constantia:\n\n ![](http://web.archive.org/web/20150419044012im_/http:/typophile.com/files/swift-mn_5270.png)\n  \n\n ![](http://web.archive.org/web/20150419044012im_/http:/typophile.com/files/constantia_mn_4170.png)\n\n--\n\nDon't worry so much. :-)\n\n—Nina\n\n"
    },
    {
      "time": "1 Feb 2009 — 2:56pm",
      "content": "BTW, I remembered a good thought from Carl Jung I had forgotten:\n\n_\"The creation of something new is not accomplished by the intellect but by the play instinct acting from inner necessity.  \nThe creative mind plays with the objects it loves.\"_\n\nThough I am not a Jung supporter, I believe he is quite right in this matter.\n\n**MarS**\n\n"
    }
  ]
}
