{
  "id": "54229",
  "title": "Can anyone help me find a good font for a music studio logo?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can anyone help me find a good font for a music studio logo? The studio mainly does mixing and mastering, but mostly mastering. People give us songs that were mixed. Sometimes we just really make them sound great. Other times, we actually have to fix a number of things with them that are actually mixing problems (if we didn't mix it).\n\nI'm not really sure about the name yet either, which I suppose might direct the font that is used. This has just been a side business up until this point, but now our network is getting bigger, so actually putting some effort into a brand/logo will help us out a little ;)\n\nAny ideas or types of fonts I should be looking into?\n\n",
  "author": "mystic",
  "time": "31 Jan 2009 — 3:28am",
  "uid": "5212",
  "comments": [
    {
      "time": "31 Jan 2009 — 7:32am",
      "content": "I immediately think of typefaces with a technical appearance.\n\nA few you can check out:\n\n[Klavika](http://web.archive.org/web/20130821052813/http:/www.processtypefoundry.com/typefaces/klavika/index.html)\n\n[Stratum](http://web.archive.org/web/20130821052813/http:/www.processtypefoundry.com/typefaces/stratum2/index.html)\n\n[Gotham Rounded](http://web.archive.org/web/20130821052813/http:/www.typography.com/fonts/font_overview.php?productLineID=100030)\n\nGood luck.\n\n"
    },
    {
      "time": "31 Jan 2009 — 7:46am",
      "content": "Shatter? :-)  \nCheesy, but possibly effective.\n\nWhat I'm really picturing though can't be done just with a font\\*, you'd need to work on the individual glyphs\\*\\*: you'd have a name that's 4-7 letters, and they would gradually change from left to right, becoming more refined, or stronger, or something. Maybe have the letters made of up circles, and the circles get slightly larger towards the right.\n\n\\* Unless it's a very special MM font.\n\n\\*\\* Which is however the real way to make a logo.\n\nhhp\n\n"
    },
    {
      "time": "31 Jan 2009 — 9:12am",
      "content": "I might add [Etelka](http://web.archive.org/web/20130821052813/http:/new.myfonts.com/fonts/storm/etelka/).\n\n"
    },
    {
      "time": "31 Jan 2009 — 2:14pm",
      "content": "Thanks for the suggestions everyone! I'll check out the technical looking fonts that I have too. I have some that look similar. I'll post a logo draft soon for you guys to critique soon!\n\n"
    },
    {
      "time": "1 Feb 2009 — 5:14pm",
      "content": "Museo?\n\n"
    }
  ]
}
