{
  "id": "54227",
  "title": "Help needed with adding a missing accented character",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello. for my language (Slovene), I need the character c with caron. Many fonts don't have it, but do have both `c' and `caron'.\n\nWhat is the best way to get my accented character? Is there a way to just compose the two (in InDesign?) or is it better to add it to the font?\n\nI've had good results with FontForge but would still like to clarify some issues. With some fonts, I've seen the empty space for the glyphs (ccaron, Ccaron) and it was easy to add them. But with others, those glyphs weren't defined. When I told FontForge to generate fonts (otf), they appeared. Now I'd like to know if this is the correct procedure and whether the quality is compromised in the process.\n\nThanks for any suggestions,\n\nAndrej.\n\n",
  "author": "omeld",
  "time": "31 Jan 2009 — 2:57am",
  "uid": "41766",
  "comments": [
    {
      "time": "31 Jan 2009 — 6:01am",
      "content": "There is no simple answer. Some layout engines have a \"floating accent\" routine, but as far as I know, InDesign isn't one of them. Maybe an ID expert will chime in here.\n\nThe other way is to add the character to the font, wich constitutes \"modifying\" the font. There are both legal and technical matters with this.\n\nTo the legal issue: I believe the laws in the EU are different than the States, and I believe I've seen posts that stated some European countries have laws which supercede the foundry EULA in some situations. I'm not a lawyer, and have no idea. Moreover, several foundries (including Adobe) allow modifying fonts for this purpose, for your own use.\n\nTechnically, making up Ccaron and ccaron is easy. They are both precomposed characters in Unicode (in Latin Extended A), so there is no need to use any special OpenType feature such as ccmp or mark. I would simply copy and paste the C,c in the correct spots, then copy the caron and paste it over the c. If the caps have flatter accents than the lower case, a caron is usually the same a horizontally and vertically flipped circumflex, so the circumflex from a any cap letter can be copied & used after the double-flip. (If that isn't to your taste, modify as you want.) Center the accents over the C,c as desired, and write off the font. If you want/need to add the Ccaron/ccaron to the kerning, that is a separate step, and you will have to understand how the kerning in the font is presently constituted.\n\nIf you use type a lot, for your own projects, understanding how to make this simple kind of modification is worth the time it takes to learn the ins and outs. The hardest part will probably be dealing with existing class kerning and OT features. Even if InDesign has a floating accent feature (or comes out with one in a future release), you will run across situations where you have to modify the font -- for example, any accent over a lower-case \"h\" that has to center on the stem will defeat a simple \"floating accent\" routine.\n\nGood luck to you\n\n"
    },
    {
      "time": "31 Jan 2009 — 7:07am",
      "content": "All of [our](http://web.archive.org/web/20130821075641/http:/www.terminaldesign.com/) font families contain the ccaron glyphs.\n\n"
    }
  ]
}
