{
  "id": "5424",
  "title": "Typophile Quote Graveyard",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Or perhaps this should be called the Quote Garden.   \n   \nPlease paste in insightful quotes you've found in these forums. Please include the author.\n\n [‹ Chunky Book-Faces.](http://web.archive.org/web/20080110085637/http:/www.typophile.com/node/5303 \"Go to previous forum topic\") [The Art of The Letter ›](http://web.archive.org/web/20080110085637/http:/www.typophile.com/node/5044 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080110085637/http://www.typophile.com/user/2403\" title=\"View user profile.\">drewheffron</a>",
  "time": "<br>",
  "uid": "2403",
  "comments": [
    {
      "time": " 30.Jun.2004 8.22am",
      "content": "No matter what we do we're living in a post-modern world. The beauty of it is we agree on disagreeing. No matter how 'Modernist' a piece of work might be, we won't be seeing it under the same light as our predecessors, because our world is not the same any more. So, a so-called 'Modernist' piece of design is simply a 'style' we pick from the 'big closet' in order to sell something to a particular group of 'target audience', who happen to be hip and cool and trendy yuppies. The same goes for 'traditionalist' designs.   \n   \nI think we not only live in a post-modern world, we also live in a multicultural world (at least in this part of the world). That even renders so-called 'movements' like Post-modernism and/or Modernism at best redundant, or at worst, meaningless. It's time to lose the 'isms' and focus more on what we are supposed to do: to communicate visually. As long as we keep our goal in mind, and to continue to be passionate about what it is that we're doing, then we'll be alright.   \n   \nI have two opposing views about typography: one of which is that typography is first and foremost about communicating the textual content as efficiently as possible; the other is utilizing the semantics of type to give design work particular 'atmospheres' or emotional responses. The first one is based on linguistic requirements and it's what 'traditional' (book) typography was (is) all about. The latter is based on visual requirements, which is what graphic design is about, mostly. Of course, these two views are not mutually exclusive and it is up to us to strike a balance between the two   \n   \n- Keith Chi-Hang Tam from \" Helvetica and 'new media designers'\"\n\n"
    }
  ]
}
