{
  "id": "54248",
  "title": "Goodbye Mr Apostrophe?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I read in (my dad's) Telegraph this morning that some bright sparks want to eliminate the apostrophe. Particularly the possessive. It all started, apparently, with Birmingham city council in the UK deciding to drop it from all road signage in the city.\n\nThoughts?\n\nI'll miss it!\n\n",
  "author": "buddhaboy",
  "time": "1 Feb 2009 — 9:01am",
  "uid": "17410",
  "comments": [
    {
      "time": "1 Feb 2009 — 9:24am",
      "content": "Your dads telegraph? How many dads do you have?\n\n"
    },
    {
      "time": "1 Feb 2009 — 10:41am",
      "content": "indeed! Were all going to hell in a handcart!\n\n"
    },
    {
      "time": "1 Feb 2009 — 11:51am",
      "content": "Well down here in Devon they seem to have never heard of the possessive, none of the road signs use them.  \nWe have recently rebranded a local school and were over ruled by the board of governors on the use of the possessive in the logo, which we found amusing as the school was holding a spelling bee competition shortly after it reopened.\n\n"
    },
    {
      "time": "1 Feb 2009 — 12:23pm",
      "content": "Oh, the apostrophe. Its a shame that some people dont appreciate its value. Well all miss it when its gone. Ill bet youre upset you spent all that money on your childrens education.\n\n"
    },
    {
      "time": "1 Feb 2009 — 1:00pm",
      "content": "dogs dog dogs dogs dog\n\nWho's doing what to whom?\n\n"
    },
    {
      "time": "1 Feb 2009 — 1:01pm",
      "content": "[http://typophile.com/node/50444](http://web.archive.org/web/20130820184327/http:/typophile.com/node/50444 \"http://typophile.com/node/50444\")\n\n"
    },
    {
      "time": "2 Feb 2009 — 7:57am",
      "content": "I read it courtesy of Peter Stanbridge via Typo-L ; here is the [NYT article](http://web.archive.org/web/20130820184327/http:/www.nytimes.com/aponline/2009/01/31/world/AP-EU-Britain-No-Apostrophe.html).\n\n"
    },
    {
      "time": "2 Feb 2009 — 1:09pm",
      "content": "Plenty of people have lamented the disappearing possessive apostrophe. Nothing new there.\n\nBUT . . . let's keep in mind that this lack may be offset by the far too frequent addition of an apostrophe where none is needed. Many folks think one is needed to make a noun plural. This sentence just came around in an internal e-mail:\n\n\"The Parking Booth will continue to be staffed on Monday’s.\"\n\nSo perhaps the world supply of apostrophes will remain stable thanks to both correct and incorrect use.\n\npowers\n\n"
    },
    {
      "time": "2 Feb 2009 — 1:19pm",
      "content": "I'm certainly no authority on latin, and I'm curious... should that be the supply of apostrophi? Technically incorrect I'm sure, but it sounds good :)\n\n"
    },
    {
      "time": "2 Feb 2009 — 2:40pm",
      "content": "I think _apostrophe_ is Greek, like _ephemera_. I once saw an article (in the _Chronicle of Higher Education_, no less) that used the word _ephemerae_, thus affixing a bogus Latin plural ending to a Greek word that was already plural.\n\n"
    },
    {
      "time": "2 Feb 2009 — 7:36pm",
      "content": "Speaking of oddities -- and correct me if I'm wrong -- but those of us who use English are accustomed to words of Greek origin with an \"f\" sound being spelled with a \"ph\". As in 'philosophy'. Now the Germanic languages allow an \"f\" in these words. But why a mix, as in <cite>filosophy</cite>?\n\n"
    },
    {
      "time": "2 Feb 2009 — 7:53pm",
      "content": "What's interesting is how a company's use of an apostrophe use will tilt in either direction, without regard to context or distinction. McDonald's and Walgreens are both giant corporations, yet McDonald's kept theirs while Walgreens did not.\n\n"
    },
    {
      "time": "2 Feb 2009 — 9:10pm",
      "content": "I would miss it as well. Found this informative, if not sadly designed site (apparently, punctuation is patriotic):\n\n[http://www.nationalpunctuationday.com/](http://web.archive.org/web/20130820184327/http:/www.nationalpunctuationday.com/ \"http://www.nationalpunctuationday.com/\")\n\nThey list at least one example of how important a comma can be:\n\n_It’s also a day to remind business people that poor punctuation can cost your business millions of dollars._\n\n_Rogers Communications, for example, one of Canada’s largest telecommunications companies, learned the hard way just how important proper punctuation could be, when an attorney misplaced a comma in a contract with a company that agreed to lay Rogers’s cables across the Maritimes. A Canadian court said ignorance of correct punctuation was no excuse and invalidated what was believed to be an ironclad five-year contract. That errant squiggle alone cost Rogers $2.13 million. There’s a link to the newspaper article about this case below._\n\nThe power of punctuation!\n\n ![](http://web.archive.org/web/20130820184327im_/http:/typophile.com/files/prod-tshirt-apostrophe-lg_6114.jpg)\n\n"
    },
    {
      "time": "3 Feb 2009 — 6:33pm",
      "content": "I wonder if there's any significance to the fact that National Punctuation Day is 5 days after [Talk Like a Pirate Day](http://web.archive.org/web/20130820184327/http:/www.talklikeapirate.com/piratehome.html).\n\n"
    },
    {
      "time": "3 Feb 2009 — 7:18pm",
      "content": "=) There's got to be some link!\n\nWith names like:\n\n_\"Cap'n Slappy and Ol' Chumbucket spent Talk Like A Pirate Day 2008 in Philadelphia as…\"_\n\nI think you're on to something…those two would be looking for new names without the good 'ol apostrophe.\n\n"
    },
    {
      "time": "4 Feb 2009 — 11:23am",
      "content": "Case in point: I think you mean _good ol'_...\n\n"
    },
    {
      "time": "4 Feb 2009 — 11:28am",
      "content": "Apostrophe misuse drives me nuts, but just think: if they do away with the great apostrophe, all those well-educated high-schoolers who paint _Class of \"09\"_ (or _'09'_ / _09'_ / _09\"_) on their cars will be that much better off.\n\n"
    },
    {
      "time": "4 Feb 2009 — 2:13pm",
      "content": "_Case in point: I think you mean good ol’..._\n\nBusted! I'm definitely guilty of abuse and misuse of a few apostrophes. My apologies.\n\nFull disclosure: I lost the 5th grade spelling bee by misspelling \"it's\"…so this has been with me a long time =)\n\n"
    },
    {
      "time": "4 Feb 2009 — 2:38pm",
      "content": "5th grade and a spelling bee word was _it's_? Really?\n\n"
    },
    {
      "time": "4 Feb 2009 — 2:41pm",
      "content": " ![](http://web.archive.org/web/20130820184327im_/http:/typophile.com/files/rron11l_4541.jpg)\n\nGuerrizmo+Design\n\n"
    },
    {
      "time": "4 Feb 2009 — 3:25pm",
      "content": "\\>_5th grade and a spelling bee word was it’s? Really?_\n\nPretty sad, I know…they must have viewed it as trick question…it still burns a little.\n\n"
    },
    {
      "time": "4 Feb 2009 — 8:58pm",
      "content": "Whilewereatit,letsgetridofwordspacestoo!Theyjusttakeup...space,asitwere.\n\nNOWAIT...IKNOW!LETSDOAWAYWITHTHOSEPESKYMINUSCULESTOO!YEAH!!!\n\n"
    },
    {
      "time": "5 Feb 2009 — 4:10am",
      "content": "Ricardo, did you come across Iain M. Banks and his novel _FEERSUM ENDJINN_? If not, you might enjoy it ...\n\n"
    },
    {
      "time": "5 Feb 2009 — 5:24am",
      "content": "Just looked it up, paragraph -- thanks for the tip! [Looks \"innaresting\".](http://web.archive.org/web/20130820184327/http:/en.wikipedia.org/wiki/Feersum_Endjinn) ;-)\n\n"
    }
  ]
}
