{
  "id": "54256",
  "title": "Palatino Nova question",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Good day all . . .\n\nI'm about to buy one of the Palatino Nova packs from Linotype, to be used primarily for history/classics related papers. It will be a Garamond replacement, and hopefully good enough to replace the classical digital version of Palatino.\n\nI must confess, however, that I have a fondness for the classic Palatino that we've had up until the Nova series. I understand it wasn't quite suitable for modern printing, but I grew up reading that style of Palatino (Linotron) and I've used the font quite happily. But if Palatino Nova is supposed to be what Zapf always intended, then so be it. It looks good and as a lover of Palatino I think I should be using it. And besides, I'm a sucker for beautiful, quality fonts.\n\nI'm a bit confused, however, when it come to the weights.\n\nHere, we've got Light and Medium:\n\n[http://www.linotype.com/255812/palatinonova1-valuepack.html](http://web.archive.org/web/20130821060005/http:/www.linotype.com/255812/palatinonova1-valuepack.html \"http://www.linotype.com/255812/palatinonova1-valuepack.html\")\n\nWhich is the book/Roman face? I've used Palatino Roman, so Im not sure if it resembles the Light variant or the Medium variant.\n\nTo add to the confusion, we have a Regular and Bold here:\n\n[http://www.linotype.com/255812/palatinonova1-valuepack.html](http://web.archive.org/web/20130821060005/http:/www.linotype.com/255812/palatinonova1-valuepack.html \"http://www.linotype.com/255812/palatinonova1-valuepack.html\")\n\nI'd appreciate any help.\n\nCheers.\n\n",
  "author": "_Palatine_",
  "time": "1 Feb 2009 — 12:32pm",
  "uid": "37663",
  "comments": [
    {
      "time": "2 Feb 2009 — 5:37am",
      "content": "You want the Palatino Nova Regular weight. That's the direct correlative to Palatino Roman.\n\n"
    },
    {
      "time": "2 Feb 2009 — 8:01am",
      "content": "Thanks, Kent.\n\n"
    },
    {
      "time": "2 Feb 2009 — 8:53pm",
      "content": "\\> a Garamond replacement\n\nNote that the vertical proportions are quite different however.  \nIn fact Zapf intended his Aldus font for extended text, not Palatino.\n\nhhp\n\n"
    }
  ]
}
