{
  "id": "54253",
  "title": "Lead Type up for auction in Toronto",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey All,\n\nI'm a fourth year student in the York/Sheridan joint program in Design (York University in Toronto) and we're throwing a fundraiser next week for our fourth year grad show in May.\n\nThere is a ton of lead type up for auction including full fonts (most include all majuscules, minuscules, punctuation and figures) of Univers, Kennerley, Goudy, Times New Roman, Lydian Cursive and almost full fonts of Cooper Black, Bodoni, Bembo, News Gothic. There's also mystery bags of type that include all sorts of different pieces of type in various fonts and weights as well as beautiful paper weights crafted from lead type. This is a once in a lifetime kind of opportunity if you live in the GTA!\n\nOur event, Ultraviolet, is happening next Sunday (February 8, 2009) at Bar 244 (at the corner of Duncan & Adelaide) and tickets are $22. The night is going to include live music, comedy, hors d'oeurves, dancing, lots of door prizes and a silent auction!\n\nFor more info and to buy tickets check out our [website](http://web.archive.org/web/20130821054830/http:/ultraviolet.apassionatecuriosity.com/).\n\nCheck out auction [Flickr photostream](http://web.archive.org/web/20130821054830/http:/www.flickr.com/photos/ysdn_ultraviolet/).\n\nAll money raised from this event will go towards the 2009 YSDN Grad Show, Wonderlust, May 10-14 at Steam Whistle Brewery.\n\nThanks!!\n\n",
  "author": "KelsRock",
  "time": "1 Feb 2009 — 11:23am",
  "uid": "14916",
  "comments": [
    {
      "time": "1 Feb 2009 — 11:44am",
      "content": "I'll be there!\n\n"
    },
    {
      "time": "1 Feb 2009 — 1:03pm",
      "content": "It's only six hours by train...my classes start pretty late...I could use some more Bodoni...a ton is a lot of type, at least compared to what I have...I probably shouldn't go.\n\n"
    },
    {
      "time": "2 Feb 2009 — 8:54am",
      "content": "Too bad you're not having the auction in May. Maybe I'll be down there in time for the grad show at least.\n\n"
    },
    {
      "time": "2 Feb 2009 — 9:05am",
      "content": "Too bad about the type that is now made into paperweights...and the thought of type in \"bags\" banging around and damaging each other. I guess it is still a way to appreciate type.\n\n"
    },
    {
      "time": "2 Feb 2009 — 11:16am",
      "content": "It is just a nice way to appreciate type... which otherwise was just going to be melted down.\n\nKeeping in mind it is used type from a university (that doesn't have space for it anymore), although it banging around isn't really possible. It's pretty darn heavy.\n\nIt's just a cool opportunity to collect some which for most people is pretty impossible.\n\n"
    },
    {
      "time": "2 Feb 2009 — 11:24am",
      "content": "What a shame that the University is throwing this out. Sure, it is great that you can raise a little bit of money for yourselves with it. But you are earning that cash at the expense of future generations of students.\n\nSigh…\n\n"
    },
    {
      "time": "2 Feb 2009 — 11:27am",
      "content": "Lead type only lasts so long...\n\n"
    },
    {
      "time": "4 Feb 2009 — 1:59pm",
      "content": "The university could have put it in someone's basement like mine did, but, considering that people are quite unlikely to use it, I don't mind that some of it is being somewhat frivolously sold as gimmicky type souvenirs as having those teaches them something about type too.\n\n"
    }
  ]
}
