{
  "id": "54270",
  "title": "Cyrillic-Using Countries - Plain or Extended?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have a client who has asked me to figure out which countries in a list use \"plain\" [Cyrillic](http://web.archive.org/web/20150214062658/http:/typophile.com/wiki/Cyrillic) and which use an extended alphabet/encoding. I told the client I need help to do that reliably, so here I am. Below is the list, with what I know or think (the latter marked with a question mark) shown. (Note that some of these countries have a completely non-Cyrillic primary alphabet, but still use some flavor of Cyrillic as a secondary system).\n\nArmenia: P\n\nAzerbaijan: E?\n\nBelorussia: P\n\nGeorgia: P\n\nKazakhstan: E\n\nKirghizistan: E\n\nMoldova: P?\n\nRussia: P\n\nTajikistan: E?\n\nTurkmenistan: E?\n\nUkraine: P\n\nUzbekistan: E?\n\n_Many thanks for any confirmations/corrections._\n\nhhp\n\n",
  "author": "hrant",
  "time": "1 Feb 2009 — 3:10pm",
  "uid": "1250",
  "comments": [
    {
      "time": "1 Feb 2009 — 4:16pm",
      "content": "I'm no expert (just somebody with a couple of Ukrainian friends), but I believe Ukrainian (the language) is written with a localized variant of the Cyrillic script. They have tittles. :-)\n\n ![](http://web.archive.org/web/20150214062658im_/http:/typophile.com/files/ukrainian_3579.gif)\n  \n[Screenshotted from [Wikipedia](http://web.archive.org/web/20150214062658/http:/en.wikipedia.org/wiki/Ukrainian_alphabet), which also says Ukrainian is sometimes Romanized – don't know if that matters in your context.] \n"
    },
    {
      "time": "1 Feb 2009 — 4:33pm",
      "content": "Argh, editing doesn't work. Just wanted to add – if you're only going to cater to Russian-speaking Ukrainians, what I said before is obviously a moot point.\n\n"
    },
    {
      "time": "1 Feb 2009 — 5:44pm",
      "content": "This depends on what is meant by \"plain Cyrillic\", which is a nebulous concept considering the history of the script and various reforms that took place for different languages. (Trying to define \"plain Latin\" runs into similar problems, believe it or not.)\n\nFor simplicity's sake I'll consider the letters encoded in [ISO 8859-5](http://web.archive.org/web/20150214062658/http:/en.wikipedia.org/wiki/ISO_8859-5), which never caught on but whose Cyrillic letters form the basic Cyrillic block of Unicode, to be \"plain Cyrillic\". Then Bulgarian, Belarusian, and Russian are covered by plain Cyrillic.\n\nHere are the rest, and the letters not supported by ISO 8859-5.\n\nAzerbaijani: ғ, ә, ҝ, ө, ү, һ, ҹ  \nKazakh: ә, қ, ғ, ҳ, ө, ұ, һ  \nKyrgyz: ң, ө, ү  \nMoldovan: ӂ  \nTajik: ғ, ӣ, қ, ӯ, ҳ, ҷ  \nTurkmen: ә, җ, ң, ө, ү  \nUkrainian: ґ  \nUzbek: қ, ғ, ҳ\n\nI haven't been able to find much data on Cyrillic as used for Armenian and Georgian.\n\nCaveats: I've listed the above in terms of languages, but of course in reality Russian dominates Belarus and some parts of Ukraine, Russia also hosts a lot of minority languages that use their own extended versions of Cyrillic, etc. Also, pre-reform Russian or Bulgarian had letters that wouldn't be considered \"plain Cyrillic\".\n\nETA: It's interesting how Unicode organizes Cyrillic characters. There is a block called \"Basic Russian alphabet\" and another called \"Cyrillic extensions\"; these together make up what I've called \"plain Cyrillic\" above. If we restrict ourselves to the \"Basic Russian alphabet\", then even Russian has a letter that is not supported, ё, which, to be fair, can be replaced with е in most circumstances. Belarusian ў is also not supported. Bulgarian ѝ, while not considered part of the alphabet, is used in the orthography, and also is not supported in the \"Basic Russian alphabet\".\n\n"
    },
    {
      "time": "1 Feb 2009 — 5:34pm",
      "content": "I find this [Wikipedia](http://web.archive.org/web/20150214062658/http:/en.wikipedia.org/wiki/Cyrillic_alphabet_variants) listing useful. The [Ethnologue](http://web.archive.org/web/20150214062658/http:/www.google.com/custom?q=Cyrillic&sa=Google+Search&cof=LW%3A188%3BL%3Ahttp%3A%2F%2Fwww.ethnologue.com%2Fimages%2Fethno_logo.jpg%3BLH%3A36%3BAH%3Acenter%3BAWFID%3A52df09fa64b787e4%3B&domains=ethnologue.com&sitesearch=ethnologue.com) collection of links is not bad either. I don’t know how reliable or up-to-date all that data is, though. Also, note that that information is on Cyrillic-using _languages_, not countries.\n\n"
    },
    {
      "time": "1 Feb 2009 — 5:55pm",
      "content": "- _This depends on what is meant by “plain Cyrillic”_\n\nI take it, that is the character set covered by the ‘standard’ Cyrillic (Windows 1251 / Mac Cyrillic 10007) codepage. It supports the typesetting of many Slavic languages: Belarusian, Bulgarian, Macedonian, Russian, Rusyn, Serbian, and Ukrainian. Maybe more.\n\n"
    },
    {
      "time": "1 Feb 2009 — 6:22pm",
      "content": "The Paratype catalog (Fontbook format) has a nice reference section in the back that lists these out.\n\n"
    },
    {
      "time": "1 Feb 2009 — 8:41pm",
      "content": "I usually make a distinction between Slavic Cyrillic ('plain') and non-Slavic Cyrillic ('extended'). This seems to work quite nicely because, so far as I recall, all the non-Slavic orthographies require at least one letter that is not found in any Slavic orthographies. This, in turn, allows you to quickly identify the two sets based on linguistic group.\n\n"
    },
    {
      "time": "1 Feb 2009 — 8:42pm",
      "content": "PS. It is better to base the differences on language rather than country, since languages tend to spill across borders.\n\n"
    },
    {
      "time": "2 Feb 2009 — 1:34am",
      "content": "tracking\n\n"
    },
    {
      "time": "15 Feb 2009 — 6:08pm",
      "content": "Just wanted to say thank-you for everybody's help.  \nIt's mostly clear now, although it's difficult to keep  \none's head wrapped around all of it!\n\n--\n\n\\> It is better to base the differences on language rather  \n\\> than country, since languages tend to spill across borders.\n\nAcademically, yes. But clients tend to have geographic  \ndomains; they sell their products based on agreements  \nwith individual countries, so fonts have to work for  \nfor all (or virtually all) writing in a given country.\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2009 — 7:47pm",
      "content": "You may want to add Mongolia to the list.\n\n"
    },
    {
      "time": "16 Feb 2009 — 10:00am",
      "content": "Hrant: _clients tend to have geographic domains; they sell their products based on agreements with individual countries, so fonts have to work for for all (or virtually all) writing in a given country._\n\nRight, but a mapping of characters -\\> countries is actually a mapping characters -\\> languages -\\> countries, even if you hide the middle step from the client.\n\n"
    }
  ]
}
