{
  "id": "5427",
  "title": "Redesigning Porto Carras",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello everybody   \n   \ni have just started to redesign a logo   \nfor a \"chateau\". The company is very famous   \nin Greece for their hotel in an amazing landscape   \nin Chalkidiki (northern Greece). Wine production   \nis a secondary activity of the company   \nand the \"chateau\" is placed in the same   \nlandscape to the hotel. There is no need   \nto be a connection between the two -i just   \nmention the whole thing for the story.   \n   \nI tried to make the design as clearer i can,   \nthough i kept all the basic shapes in the buildings   \nsince i don't know how much i can omit.   \n   \nFor the moment i prefer A though i am not sure   \nabout the sizes (that's why A1 and A2).   \n   \nI am looking forward for comments about   \nthe typography and the clarity of the design.   \nI was trying to find a good combination to make   \na ligature but i couldn't see such a case.   \nIf anybody have a suggestion on it i will be   \nvery pleased to know.   \n   \nThanks in advance and have you all a nice day.   \n   \nchristos   \n   \n ![sign](http://web.archive.org/web/20131018214152im_/http:/www.typophile.com/forums/messages/29/39630.gif)   \n   \n ![proposals](http://web.archive.org/web/20131018214152im_/http:/www.typophile.com/forums/messages/29/39631.gif)\n\n",
  "author": "tsoler",
  "time": "30 Jun 2004 — 9:26am",
  "uid": "1058",
  "comments": [
    {
      "time": "30 Jun 2004 — 8:13pm",
      "content": "I like very much the way that you have used the thinning lines to convey the landscape, but I wonder if the oval shape retained from the original isn't keeping the whole design somewhat rigid. Is that oval shape a requirement from the client?   \n   \nOtherwise, I don't like the versions with the borders around the image as I find that they make the design heavy. If pressed, however, I would prefer the borders in B, C, D and F because they mirror the lines in the image.   \n   \nGenerally I prefer the versions without the thin-thick line at the bottom as they are more open and welcoming, although the F and H are fun. My favourite example is G.   \n   \nI hope that these comments are helpful; I look forward to seeing the final decisions for this project.\n\n"
    },
    {
      "time": "30 Jun 2004 — 11:14pm",
      "content": "I like the logo without an oval border, and I   \nlike the KAPPA? (?) with the swash K, like in   \nC,D,E. I also like KTHMA in italics, like in B.   \n   \nBut these are the details and I think that you   \nhave the core of an excellent mark.\n\n"
    },
    {
      "time": "30 Jun 2004 — 11:26pm",
      "content": "Christos, you have made an excellent mark. Of those that you show here I like A2. No border on the oval and the double rule below the type looks both fresh and modern to my eye but also provides a nice foundation for the type.   \n   \nIn general the oval is very active and is eyecatching. I wonder if the buildings could be simplified, removing the window details and providing a calmer centre like the pupil in the iris of an eye.   \n   \nNo matter what, your revision of this mark is a huge step forward for the chateau.   \n   \nJon\n\n"
    },
    {
      "time": "1 Jul 2004 — 3:26am",
      "content": "Hello and thank you for the immediate response.   \n   \nRobert\n\n"
    },
    {
      "time": "1 Jul 2004 — 6:56am",
      "content": "Hello Christos,   \n   \nDon't get me wrong, I think the oval works as well. I like the play between the curve of the edge of the   \noval and the various straight lines. Were it bothers me is in how the oval shape isolates the image   \nfrom the type.   \n   \nMaybe it is just me, but I would put the type aound the oval (like in the original) as that would unify the   \ntwo, however I didn't want to suggest that when I put up my first post (as I felt that it would not be   \ninteresting for you to be too similar to the original) so I wondered about modifying the oval instead.   \n   \nBy the way, I like the modifications you made; they have lightened everything up considerably.   \n   \nThe Italics in III are to my taste; they go very well with the other elements.   \n   \nJust a question, what kind of applications will this have other than letterhead etc. Will this be on signs,   \nwine bottles, menus?   \n   \nAnd best of luck to the Greek team today! We will be watching from here (if we can find space   \nin a caf\n\n"
    },
    {
      "time": "1 Jul 2004 — 8:07am",
      "content": "Hello   \n   \ndon't worry Robert and of course i didn't get you   \nwrong. I was wondering about the oval after   \nyou mentioned it, so i tried different shapes.   \n   \nIt was a good coinsidence because now that   \ni opened typophile to send them, i find your post.   \n   \nI think you are right about the type.   \nIt works better in the way it is now.   \n   \nThe sign will be applied on everything   \nyou mentioned and even more...   \n   \nThanks about the support but Czechs have a great   \nteam. I hope we will win, but if not at least   \nthe competitor is a worthy one.   \n   \ncheers, christos   \n   \n ![new2](http://web.archive.org/web/20131018214152im_/http:/www.typophile.com/forums/messages/29/39734.gif)\n\n"
    },
    {
      "time": "1 Jul 2004 — 8:48am",
      "content": "Wow, these look great!   \n   \nIt occurs to me that by removing the \"sky\" the image has opened up, which really lets the   \ntype into the image. It think that a version with a rounded bottom might embrace more the type   \non top, but I like these versions too.   \n   \nIt's funny, I wasn't partial to the swash caps in the previous versions, but I like them in this   \nlatest post. I think that the angles of the swashes are working well with the lines in bottom right of   \nthe image. But I find the middle version the most elegant typographicaly.   \n   \nThis is really a beautiful project. I'd stay at the chateau if I were in town...   \n   \nRobert\n\n"
    },
    {
      "time": "1 Jul 2004 — 2:36pm",
      "content": "This design has progressed very nicely, terrific job Christos. From your last posting I prefer the logo (in the grouping of five with no type) that is in the middle. It has the sky (?, I thought it was more landscape) and the land on the left breaks out of the rectangle shape. to me, it makes the overall design more interesting and dynamic. As for the type I like the version on the left, with the swash K's. One thing that looks off to me is the swash k next to the cap T and then small caps for hma. I don't read Greek so I'm assuming that is gramitically correct, but how would it look with thma all in small caps?\n\n"
    },
    {
      "time": "2 Jul 2004 — 2:16am",
      "content": "good morning.   \n   \nRobert and Kirsten i tried your suggestions.   \n   \nKirsten you are right that the \"T\" doesn't fit   \nto the \"K\". Actually i was thinking about that   \n...i just needed someone to say it.   \nI also tighten the kerning and now i think   \nthe swashes work better.   \n   \nRobert it seems your wish worked as we won   \nthe Czechs yesterday. I have to admit that   \nthey really were the best team in Euro 2004   \nbut the psycology was with us (around 15.000   \nGreeks were at the stadium) and our defence   \nwas strong. If i wasn't Greek i would support   \nthe Czechs and even that i am pround we passed   \non the other hand i feel sorry that   \nthey didn't make it, because they deserved it.   \n   \nThanks for the feedback, au revoir   \n   \nchristos   \n   \nmake it ![new3](http://web.archive.org/web/20131018214152im_/http:/www.typophile.com/forums/messages/29/39783.gif)\n\n"
    },
    {
      "time": "2 Jul 2004 — 3:53am",
      "content": "Let's stay out of soccer comments, please? Now on point - is there a seashore on the old logo? I can't see it in your redesign...\n\n"
    },
    {
      "time": "2 Jul 2004 — 7:47am",
      "content": "You are right Ivan. There is a seashore in the original logo, but i decided to \"sacrifice\" it for the favor of simplicity (or i didn't find a way to keep it). Of course if the client will insist on it i will have to find a way.   \n   \n...no more words about soccer. Not everybody share this discussion with the same pleasure...   \n   \nchristos\n\n"
    },
    {
      "time": "2 Jul 2004 — 4:45pm",
      "content": "Regarding the sea--perhaps the straight lines at the left could be parallel curves? This would gently indicate the shore but not become too important. The 2 sets of straight lines now seem to be attacking a fort.   \nI like the last 2 in \"C\" best. Perhaps the length of the curved type \"Porto Karras\" could equal the width of the drawing. The word \"KTHMA\" could be smaller, lighter, and wide letterspaced to also equal the width of the drawing?   \n   \nChrisL\n\n"
    },
    {
      "time": "2 Jul 2004 — 5:14pm",
      "content": "I have not drawn the curves but here is a crude idea of what I meant with the type:   \n ![lable](http://web.archive.org/web/20131018214152im_/http:/www.typophile.com/forums/messages/29/39865.gif)\n\n"
    },
    {
      "time": "5 Jul 2004 — 1:15am",
      "content": "chris: i agree that the straight lines are disturbing and that there is a need for more contrast between \"KTHMA\" and the name. One the other hand i disagree with the need to fix everything in the same width first because i think it will be so over-symmetric for my taste and second the letters will be very small. About the contrast i prefer to keep the lc italics as in B2 and C2 (i think i will keep C2).   \n   \nGood day to all, christos\n\n"
    },
    {
      "time": "5 Jul 2004 — 6:57am",
      "content": "Hi Christos,   \n   \nThat is lovely. The only thing I notice is the strange perspective change between the two towers. The tall tower looks like it is falling to the right. I think it will need to be flatter on top (showing less of the back wall. Either that, or the tower with the roof may need to show more roof. Speaking of this roof, did you try the left side dark and right side light\n\n"
    },
    {
      "time": "6 Jul 2004 — 2:29am",
      "content": "randy thanks...how couldn't i see all that before. You are completely right!\n\n"
    }
  ]
}
