{
  "id": "543",
  "title": "Minion with What?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What goes with Minion?   \n   \nModern text face   \n   \nanyone?\n\n",
  "author": "kidokay",
  "time": "7 Jul 2003 — 7:37am",
  "uid": "2014",
  "comments": [
    {
      "time": "12 Jul 2003 — 3:21pm",
      "content": "I've seen Myriad used as a sans-serif companion to   \nMinion. As both were designed by Robert Slimbach,   \nthere's something of a natural synergy between them.   \n   \nDavid\n\n"
    },
    {
      "time": "12 Jul 2003 — 3:25pm",
      "content": "(Of course, Carol Twombly also designed Myriad. I didn't mean to leave out her credit. ![:-)](http://web.archive.org/web/20131018023917im_/http:/www.typophile.com/forums/clipart/happy.gif) )\n\n"
    },
    {
      "time": "12 Jul 2003 — 7:46pm",
      "content": "Trivia Quiz:   \nWhat's the most tangible evidence that somebody besides Slimbach co-designed Myriad?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jul 2003 — 8:42pm",
      "content": "Their name is listed as co-designer of the font?   \n   \n??\n\n"
    },
    {
      "time": "12 Jul 2003 — 9:22pm",
      "content": "No kerns below 3 units?\n\n"
    },
    {
      "time": "12 Jul 2003 — 9:35pm",
      "content": "Chris: Duh, no. It's in the outlines.   \n   \nAlan: Huh? Please explain!   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jul 2003 — 9:58pm",
      "content": "Last time I remember looking at one of Slimbach's fonts, I saw kerns of -3, -2, and even -1. Kerns like that don't make much sense to me. I don't think it was the result of interpolation, but I could be wrong\n\n"
    },
    {
      "time": "12 Jul 2003 — 10:05pm",
      "content": "\\> -1   \n   \nYeah, that's nuts. I don't go below 2 units (per 1000) on my _base_ spacing...   \n   \nBut it probably _is_ interpolation, no?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jul 2003 — 10:15pm",
      "content": "Hey, I forgot that you were guessing!   \n   \nSo you're saying that Slimbach would have put tiny kerns, but Twombly successfully resisted that?   \nInteresting - but it seems far-fetched, for a number of reasons. Do you have more supportive evidence?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jul 2003 — 10:22pm",
      "content": "[Ink traps?](http://web.archive.org/web/20131018023917/http:/www.typophile.com/forums/messages/83/5042.html)\n\n"
    },
    {
      "time": "12 Jul 2003 — 10:22pm",
      "content": "No evidence. It was just a shot in the dark. For all I know, Twombly does the same thing. I just don't have any Slimbach fonts lying around to take an \\*educated\\* guess, that's all.   \n   \nFor what it's worth, I usually delete kerns below 7 that are a result of interpolation. 7, 8, and 9 get rounded up to 10. I'm adamantly multiples-of-5 when it comes to kerning, for slightly arbitrary reasons, but also because it often makes a search/replace much faster.\n\n"
    },
    {
      "time": "12 Jul 2003 — 10:40pm",
      "content": "Karen: Bingo. (Have I become too predictable to you? :-)   \n   \nSlimbach is an avowed anti-trapping guy, while Twombly has used trapping since day one (check out Mirarae).   \nI think that's probably one reason they didn't get along - and they don't enjoy reminiscing about Myriad...   \n   \n--   \n   \nAlan, how is your 5 fetish only _slightly_ arbitrary? :-) Actually, I start with multiples of 5 too, but move down to 2 if clearly necessary. On the other hand, I don't see a reason to mess with interpolated results (at least not when it comes to spacing).   \n   \nBTW, I don't get the search/replace bit.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jul 2003 — 10:43pm",
      "content": "BTW, I should really make an effort to answer the original question...   \nIt's just that Minion simply doesn't turn me on.   \n   \nSen, when you say \"with\", do you mean as a titling face to complement Minion in text, or do you mean for close interspersed use, or what?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jul 2003 — 11:47pm",
      "content": "\"Slighty\" arbitrary, because it's multiples of 5. But also not arbitrary, because it forces a decision. It limits my choices (not really, but I like to think so), and was easy to tap out in the Fontographer metrics window (Command-Option-something).   \n   \nI only look for interpolated results that are below 10, those are the only ones I change. The rest can exist happily in their multiple-of-17 status if they must. Oh, and the search/replace happens in BBEdit, when I change a sidebearing or something. I don't know, it's been a while, now that I'm on FontLab and that is no longer an issue.   \n   \nI'm forever off-topic.   \n   \nAlan\n\n"
    },
    {
      "time": "13 Jul 2003 — 7:19am",
      "content": "\\> Karen: Bingo. (Have I become too predictable to you? :-)   \nHa ha. I happen to remember that thread. The first time I heard about ink traps.   \n   \n\\> Slimbach is an avowed anti-trapping guy, while Twombly has used trapping since day one (check out Mirarae).   \nWhat are his reasons for being anti-trapping though? Maybe he feels that they are no longer relevant today.   \n  \nWhere can I read more about Slimbach and his anti-trapping tendencies?\n\n"
    },
    {
      "time": "13 Jul 2003 — 9:27am",
      "content": "Attempting to stay on topic as much as possible to help Sen Voorens with his original inquiry of six days ago:   \n   \nRobert Bringhurst also used Scala Sans with considerable success as a sans-serif companion to Minion in \"The Elements of Typographic Style\".   \n   \nDavid\n\n"
    },
    {
      "time": "13 Jul 2003 — 10:23am",
      "content": "Karen, Slimbach rarely says anything in public, and in my 5+ years on discussion groups I haven't seen a single piece of participation from him. So any \"documentation\" about this is going to be second-hand, but also through observation. If I'm not mistaken David Lemon (on maybe it was JFP) has pointed out that Slimbach doesn't use trapping, but if you just look at his work, it's obvious anyway.   \n   \nHis reasons are probably the same as for any accomplished type designer who doesn't put trapping:   \n1) Even if he thinks it helps a little bit, it's not cost-effective: the gain is too small compared to the effort.   \n2) In large sizes trapping (generally) looks ugly.   \n3) There's no methodical way of putting in traps, and that's a Modernist/Western turn-off.   \n   \nI can't argue with #1 too much - it's a personal balance of craftsmanship versus delivery of goods. On the other hand, pretty soon this reason will disappear... As for #2, I would counter that the people who notice traps at larger sizes are the same people who know they should be using the display cut of the font instead anyway! And when it comes to #3, I'd say it's all in your head. A desire for absolute consistency shouldn't trump real-world quality.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jul 2003 — 12:06pm",
      "content": "1. I don't think that Minion will go with a modern serif = vertical stress typeface.   \n   \n2. This is not what you asked, but Minion is a match to Slimbach's Poetica (as Bringhurst notes). The italic of Minion, which I think is very good, harmonizes with Poetica, whereas the italics of other typefaces I tried really clashed.   \n   \n3. I found, as I noted elsewhere, that Open Type version of Minion is a distinct improvement on the original.\n\n"
    },
    {
      "time": "13 Jul 2003 — 12:29pm",
      "content": "You mean even over the MM version?   \nIf so, could you remind me/us exactly where it's improved?   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jul 2003 — 12:56pm",
      "content": "Hrant, I asked about the different weights of Minion on this thread:   \n   \n [http://www.typophile.com/forums/messages/4100/7027.html?1056591110](http://web.archive.org/web/20131018023917/http:/www.typophile.com/forums/messages/4100/7027.html?1056591110)   \n   \nI learned from Kent Lew there that Slimbach had made changes from the regular to the MM version (no longer sold), and then again to the Open Type version. And John Nolan said he thought the Open Type version was best, even though in general he liked the MM technology.   \n   \nThis led me to get the Open Type version, and also (with your encouragement) to upgrade from PageMaker to InDesign - which is wonderful.   \n   \nNow, checking the new version with my own eyes, and setting my book in progress in the OT Minion, I find that the regular weight has gone on a diet, and is now slimmer and prettier. It is between the old regular and display weights. I also sets at nearly the same width as the old display weight - perhaps 5% more narrow than the old regular (I haven't measured it).   \n   \nWhat led me to my first post here at typofile was the feeling that something was wrong with the regular Minion. It looked too clotted to me at 11 points (though not at 10 points); too closely spaced or something I couldn't exactly put my finger on.   \n   \nI am still not sure what all went into the changes Slimbach made, but I sure think they are an improvement. My former feelings that something was wrong have now vanished, and I think it is a real solid workhorse for text, with some elegance.\n\n"
    },
    {
      "time": "13 Jul 2003 — 3:38pm",
      "content": "Quote:   \nChris: Duh, no. It's in the outlines.   \n   \n-----   \n   \nWell, I'm not the Mister Miyagi of type design like you are. Forgive me Sensei! I shall go wax the cars once again to atone.   \n   \n:runs:\n\n"
    },
    {
      "time": "13 Jul 2003 — 9:33pm",
      "content": "Grasshopper, in waxing, make you sure to do so in the counter-clockwise motion for outside bodywork, while instead the clockwise for inside cabin... ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jul 2003 — 10:58pm",
      "content": "Hai, sensei san, wokarimasu!\n\n"
    },
    {
      "time": "14 Jul 2003 — 7:51am",
      "content": "::tart a whole new topic...   \nI'm following a precedent started by another designer of using Minion for Headers - a sans for text (arial actually).   \n   \nI like scala sans here, but for Headers- I'd prefer to have Myriad as the text face if not at all.\n\n"
    },
    {
      "time": "13 Jul 2003 — 11:37pm",
      "content": "CHRIS   \n   \nWhy you're not going to sleep?   \n   \nSans Serif\n\n"
    },
    {
      "time": "1 Aug 2003 — 3:48pm",
      "content": "Bringhurst also implies that Syntax is a fitting companion to Minion. At least i think that's what he's saying (p. 106).\n\n"
    },
    {
      "time": "10 Aug 2003 — 9:12am",
      "content": "I like DTL Caspari as a companion to Minion, although I'm hard-put to explain exactly why. I guess they both set rather conservatively without looking too compressed.\n\n"
    }
  ]
}
