{
  "id": "54304",
  "title": "Gift a font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Good idea or bad? Online font retailers should have a function that allows you to 'gift a font' to another user: basically purchase a license on someone else's behalf and shoot them an email with download, installation and EULA instructions. What do you think?\n\n",
  "author": "paul d hunt",
  "time": "2 Feb 2009 — 11:56am",
  "uid": "7006",
  "comments": [
    {
      "time": "2 Feb 2009 — 1:21pm",
      "content": "Great idea!!! They should also add a wish list URL so you can send that to people :)\n\nLooking at some of the stuff I get for christmas, I'd rather have had Gotham, or Meta Serif!\n\n"
    },
    {
      "time": "2 Feb 2009 — 2:11pm",
      "content": "I agree, great idea!! Or even a gift card for a particular font foundry for those of us who can't afford to give an entire font!\n\n"
    },
    {
      "time": "2 Feb 2009 — 5:49pm",
      "content": "Re: wishlist\n\nI find that amazon's universal wishlist button does the trick for me in keeping track of all those goodies i want from various sites. if only i could convice some poor sap to actually purchase something from that list for me now... :^p\n\n[http://www.amazon.com/wishlist/get-button](http://web.archive.org/web/20131106162606/http:/www.amazon.com/wishlist/get-button \"http://www.amazon.com/wishlist/get-button\")\n\n"
    },
    {
      "time": "2 Feb 2009 — 7:23pm",
      "content": "i don't use amazon much so was not aware of that button... it looks good!\n\nre gift a font - i think the voucher idea would be better.\n\n"
    },
    {
      "time": "2 Feb 2009 — 11:51pm",
      "content": "I think both are a grat idea (the \"gift a font to another\" and the \"gift card for a specific font foundry\"). The ideal Christmas gift for a student or professional.\n\n"
    },
    {
      "time": "3 Feb 2009 — 8:28pm",
      "content": "or typewhore like me...\n\n"
    },
    {
      "time": "14 Dec 2009 — 4:21am",
      "content": "So, a few months later: Are there any foundries out there that offer something like a gift card/voucher?  \nI'm facing another Christmas wish list where I'll probably settle for type books because for my relatives, the idea of buying me a font is… odd, and the process scary. But if there was the option for laymen to purchase a pretty gift card in a simple process (without having to think of licences, and EULAs, and all), and make a poor type-nut very happy, that'd be awesome.\n\n"
    },
    {
      "time": "14 Dec 2009 — 6:41am",
      "content": "Great idea, Nina!\n\nChrisL\n\n"
    },
    {
      "time": "17 Dec 2009 — 4:12pm",
      "content": "It has been brought to my attention off-list (thanks!) that MyFonts [still] has a Gift Certificate purchase option. It just hasn't been migrated over to the new site yet, which however does not mean it's not offered anymore:\n\n[http://www.myfonts.com/info/gift-certificates/](http://web.archive.org/web/20131106162606/http:/www.myfonts.com/info/gift-certificates/ \"http://www.myfonts.com/info/gift-certificates/\")\n\n"
    }
  ]
}
