{
  "id": "54309",
  "title": "SF Chronicle Redesign",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The San Francisco Chronicle rolled out a redesign yesterday. I don't know any of the details about who did what, or what they are now using (Archer for section heads and subs). The old design was one I often lauded in these forums, especially the sturdy elegance of Parkinson's Electra adaptations. From a type perspective, I'd have liked to see them update their headline sans and call it good. Now it feels like they did a trendy typographic mashup with no cohesive style. Nothing wrong with the individual types they used mind you; I'm sure this largely just my reaction to change. It will be interesting to see the broader reaction and how it evolves. In the mean time... Michael Phelps smoked pot \\*wow\\*\n\n",
  "author": "Randy",
  "time": "2 Feb 2009 — 12:36pm",
  "uid": "7783",
  "comments": [
    {
      "time": "2 Feb 2009 — 12:55pm",
      "content": "The IOC has already determined that pot is not a performance enhancing drug.\n\n"
    },
    {
      "time": "2 Feb 2009 — 12:55pm",
      "content": "But yes, I'll pick up a paper and have a look at the new design choices.\n\n"
    },
    {
      "time": "2 Feb 2009 — 1:07pm",
      "content": "SF weekly.com has [some photos and analysis](http://web.archive.org/web/20131023174628/http:/blogs.sfweekly.com/thesnitch/2009/02/chron_redesign_its_a_brave_new.php).\n\nAlso, [_The Chronicle_'s editor talks about the redesign](http://web.archive.org/web/20131023174628/http:/www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2009/02/02/MNCD15KIK3.DTL) (but, alas, no images).\n\n"
    },
    {
      "time": "2 Feb 2009 — 1:59pm",
      "content": "You can grab a PDF of the front page of the new design over at the Newseum's Front Pages section.\n\nLooks like Farnham for both headlines and text, Antenna for sans, and Archer for section heads, et al. Some interesting choices -- as you say, Randy, a bit of a mash-up.\n\nSeems a bit less serious and more lifestyle oriented than hard-hitting news.\n\n-- Kent.\n\n"
    },
    {
      "time": "2 Feb 2009 — 4:00pm",
      "content": "[Today's Front Pages](http://web.archive.org/web/20131023174628/http:/www.newseum.org/todaysfrontpages/) is a great resource, Ken! Thanks for mentioning it.\n\n"
    },
    {
      "time": "2 Feb 2009 — 4:18pm",
      "content": "Sorry I was too lazy to link. Thanks, Ricard. ;-)\n\n"
    },
    {
      "time": "2 Feb 2009 — 6:07pm",
      "content": "Archer definitely feels out of place, IMHO.\n\n"
    },
    {
      "time": "2 Feb 2009 — 6:48pm",
      "content": "I like the use of Archer in the section heads, but I feel like it clashes with Farnham where they've stuck the two together.\n\nI also think they've misused Farnham for the big bold headlines. On the main head of Sunday's front page, the combination of somewhat loose leading and jamming it up against the photos to the left looks really clunky to me.\n\nI'd like to see them use a lighter weight of the Farnham for the headlines (and possibly a slightly larger type size to compensate) and let the idiosyncrasies of the face shine through. Also, the mix with Archer for the kickers might work better if the two faces were more similarly weighted. The bold Farnham works better in smaller headlines -- the leading looks like it's the same as in the larger headlines -- perhaps it just works better smaller.\n\n"
    },
    {
      "time": "3 Feb 2009 — 1:37am",
      "content": "The choice of typefaces don't bother me nearly as much as the ragged-left columns, separated by rules running down the length of the body.\n\nUgh, did they actually **want** me to read this? It's not a serious redesign at all, and reader response has been mostly disgust (as far as I can tell from the SF Gate comments). For a paper that mostly prints wire stories and drastically reduced their number of writers, the redesign is a classic example of fixing the one thing that wasn't broken.\n\nOh, and the newsstand price is now 75¢ a copy. Draw your own conclusions.\n\n"
    },
    {
      "time": "3 Feb 2009 — 1:38am",
      "content": "Some of the older readers are complaining that the new type is set too small. Are they sure they want to lose their subscriber base?\n\n"
    },
    {
      "time": "3 Feb 2009 — 4:58pm",
      "content": "Some older readers will complain that the type is set to small if it's anything less than 18 pt. I wouldn't want to alienate a core customer, but they probably weren't happy about the type size before, either.\n\n"
    },
    {
      "time": "3 Feb 2009 — 5:49pm",
      "content": "Their website hasn't caught up to the paper as it still shows the old nameplate:\n\n ![](http://web.archive.org/web/20131023174628im_/http:/typophile.com/files/chronbanner_4194.gif)\n\nCompared to the new one in print:\n\n ![](http://web.archive.org/web/20131023174628im_/http:/typophile.com/files/chronbannernew_4295.gif)\n\nMy initial reaction is along the lines of Ken that it's less newsy feeling. Pictures of columnists are larger, makes it feel like an LCA (Less Content Alert) is on the horizon.\n\nI find it hard to judge something like this until I've read several issues, but it is hard to put aside your initial reaction.\n\n"
    },
    {
      "time": "3 Feb 2009 — 7:38pm",
      "content": "_My initial reaction is along the lines of Ken_\n\nMy misspelling of Kent's name is catching on, I fear.\n\n"
    },
    {
      "time": "4 Feb 2009 — 7:41am",
      "content": "How about spelling it Ken(t)?\n\n"
    },
    {
      "time": "4 Feb 2009 — 10:44am",
      "content": "You mean like Luc(as)? Uh . . . nah, I'll pass. ;-)\n\n"
    },
    {
      "time": "5 Feb 2009 — 12:04pm",
      "content": "Sorry - I thought this was the \"Kent Lew Name Redesign\" thread. :-)\n\nMy dad doesn't have any vision problems, but as an avid reader of just about everything, he commented that the SF Chronicle is now harder to read.\n\n"
    },
    {
      "time": "6 Feb 2009 — 11:04am",
      "content": "@cheshiredave - I think the reason that Farnham doesn't seem to work is because it allows no contrast with the flag. I still don't think Archer was the right choice. I appreciate it, but not in this instance. Can anyone confirm if they used display or text? If they were using a sans instead of Farnham or a less formal serif Archer might work. Even still, the flag is old school blackletter and I'd argue it still wouldn't work.\n\n"
    },
    {
      "time": "6 Feb 2009 — 2:41pm",
      "content": "not saying that I know anything at all about the art of newspaper design.. but as previously stated.. Archer just seems really awkward on those section heads..\n\n- Scott\n\n"
    },
    {
      "time": "6 Feb 2009 — 4:20pm",
      "content": "Tiff -- Do you mean text or display for Archer? Are there different cuts? I thought Archer was one-size-fits-all.\n\nThe Chronicle is using both Farnham Display (heads) and Text (text).\n\nRegarding the heads: I can't help but think that the overall look might have been stronger and a tad more serious if they had commissioned a custom, slightly narrower version of Farnham specifically for headlines.\n\nBut, I'm not looking at the paper in hand, and it's a bit unfair to judge a newspaper from a PDF.\n\n-- K.\n\n"
    },
    {
      "time": "6 Feb 2009 — 5:31pm",
      "content": "Kent - No, I was asking about Farnham. I agree, a narrower width might've done the trick.\n\n"
    },
    {
      "time": "9 Feb 2009 — 12:24am",
      "content": "I think the overall feeling is that despite all the money they've spent licensing what are in general, nice looking fonts, the design in general is a let down.\n\nSome more pics up at ISO50's blog see them for yourself, along with more comments, [here](http://web.archive.org/web/20131023174628/http:/blog.iso50.com/author/alex/)\n\n"
    },
    {
      "time": "10 Feb 2009 — 6:09pm",
      "content": "My mother and I were just looking at the paper. She is a die-hard Chronicle reader and a fan of the paper, but she cannot stand the redesign. I'm surprised at how lightweight it appears now. Not impactful.\n\n"
    }
  ]
}
