{
  "id": "54312",
  "title": "Blackletter in American Newspapers",
  "forum": "Blackletter",
  "tags": [
    "Blackletter"
  ],
  "content": "Hello to All,\n\nThis is my first post here, though I've been reading this forums for quite a time now and found them to be very helpful.There is one topic however on which I am doing research on and couldn't find information on (please correct me if there was a thread on this).\n\nAre you aware of any article published on the use of blackletter type in American newspaper titles? Why has been the use of blackletter so popular amongst publishers an designers of many diferent kinds of newspapers in the US, big and respected as well as small and local ones?\n\nI will also appreciate your own thoughts and theories.\n\nThank you,  \nMarek\n\n",
  "author": "Marek Ozyhar",
  "time": "2 Feb 2009 — 1:49pm",
  "uid": "31383",
  "comments": [
    {
      "time": "2 Feb 2009 — 5:28pm",
      "content": "Blackletter simply looks formal, I guess. Probably the same reason that we keep using them for our diplomas and degrees and such. But since we're not used to reading it, we just keep it as the title and nothing more.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "3 Feb 2009 — 5:48am",
      "content": "Thank you for your response. I thought this might be the line of reasoning -it evokes formality, authority etc.  \nBut what does it mean \"simply looks formal\" after all? Why does Americans associate blackletter with authority? It certainly doesn't look very formal to me, but rather pretentious. We, i.e. in Poland, for intance never use it for diplomas etc., and I am not aware of any country in Europe where this would be the case.\n\n"
    },
    {
      "time": "3 Feb 2009 — 5:22pm",
      "content": "According to Jim Parkinson, blackletter began to be used for newspaper nameplates in the 1860s in England. The papers wanted to attract attention by using the darkest type available, which in most print shops at the time was blackletter.\n\nSee Jim Parkinson, \"More than you ever wanted to know about nameplates\" in John D. Berry, ed., <cite>Contemporary newspaper design</cite>, 2004, Mark Batty Publisher, 159--169.\n\n"
    },
    {
      "time": "3 Feb 2009 — 6:44pm",
      "content": "Thank you Steve.\n\nThe idea that they used the darkest type available sounds very interesting as it shiftes the reasoning from evoking authority to catching attention. I'll read the article to see how the authors support their claim.\n\nHowever, as far as America is concerned many papers used blackletter already in the 1790. According to Kevin G. Barnhurst, John C. Nerone in The Form of News: A History ( Guilford Press, 2002) many papers used blackletter \"because [it] provided a visual germanic clue, referring to the Teutonic origin of the English people and their ancient order\" (p. 54, book is available on google books).\n\n"
    },
    {
      "time": "17 Feb 2009 — 4:00pm",
      "content": "Interesting. But I wonder why people would want the link to Germanic history.\n\nI think the formalness comes in part from the complexity and calligraphic quality of the letters. I'm talking out of my ass now, but I'd assume in the olden days degrees were considered important enough to be handlettered instead of typeset, and might have been done in an English blackletter. Once universities started issuing so many degrees that they couldn't economically handletter the degrees, they wanted to maintain the style and simply switched to a blackletter font. This is pure speculation, but might be worth some investigation.\n\nThen again, most European degrees I've seen are butt ugly (Spain's top university uses around seven different fonts on one sheet of paper including the largest type in Georgia—a great SCREEN font)... I'll take my pretentious blackletter :)\n\nAlso keep in mind that many things are culturally \"learned\". I could definitely see newspapers using blackletter for attention. But we have \"learned\" that now for newspapers which are more serious. I'm thinking about things like the USA Today etc, that use sans serif for their titles which then emphases an idea of blackletter=serious/formal. Again, just tossing ideas around.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "15 Sep 2009 — 3:44pm",
      "content": "I am also looking into this topic. Any other input would be appreciated. Especially any reference materials.\n\n"
    },
    {
      "time": "15 Sep 2009 — 3:45pm",
      "content": "sorry double post\n\n"
    },
    {
      "time": "22 Sep 2009 — 6:08pm",
      "content": "@marek and @thompson  \nWhile I don't have references on newspaper history at hand, you might recall that blackletter types were in common use when the first journals appeared, so the idea of authority is most probably based on its early appearance in print.\n\nI'm not familiar with the Barnhurst & Narone book, but this conclusion seems rather broad, and would look at actual examples of newspapers and see if there is any text in those papers themselves that would support this assertion. Plus recall that blackletter is as much english as german as french etc. by manuscript (pre-typographic) tradition.\n\nHope this helps.\n\n"
    },
    {
      "time": "11 Oct 2009 — 9:37pm",
      "content": "I was about to post more or less exactly what Peter says in his 22sep09 note.  \nI don't know that there was any \"desire for Teutonic identity\" involved, certainly, I've never considered any such reference before except, obviously, in German mastheads.\n\nThe fact that \"Blackletter\" is also widely called \"Old English\" is a better clue, and likely one would find English broadsides printed with 'mastheads' in such type back nearly to Caxton. This would then be a simple path to seeing the same structural form persist, if anachronistically, in the New York Times, et al, to the present day.\n\nAlthough my favorite \"Old English\" is BM Harley 2904...\n\n[http://www.british-library.uk/catalogues/illuminatedmanuscripts/ILLUMIN....](http://web.archive.org/web/20150317091640/http:/www.british-library.uk/catalogues/illuminatedmanuscripts/ILLUMIN.ASP?Size=mid&IllID=21019 \"http://www.british-library.uk/catalogues/illuminatedmanuscripts/ILLUMIN.ASP?Size=mid&IllID=21019\") etc... (what an incredible book. I've had the pleasure/honor of paging through this treasure, when I was studying calligraphy under Ieuan Rees in the early 1980s. Ieuan wrote a letter of introduction for me, and I was admitted to the rare book room at the British Library. Would love to get back there some day.)\n\nThe evolution of blackletter's cultural semantics is well documented in Peter Bain's and Paul Shaw's book:  \n [http://www.amazon.com/Blackletter-National-Identity-Paul-Shaw/dp/1568981252](http://web.archive.org/web/20150317091640/http:/www.amazon.com/Blackletter-National-Identity-Paul-Shaw/dp/1568981252 \"http://www.amazon.com/Blackletter-National-Identity-Paul-Shaw/dp/1568981252\")\n\n[http://slowprint.com/](http://web.archive.org/web/20150317091640/http:/slowprint.com/ \"http://slowprint.com/\") Letterpress for Typographers!  \n [http://alphabets.com/](http://web.archive.org/web/20150317091640/http:/alphabets.com/ \"http://alphabets.com/\")\n\n"
    }
  ]
}
