{
  "id": "5432",
  "title": "Tattoo font...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Some time ago I saw a font that somone had designed that was based on that old tattoo style lettering, similar to something like bremuda (sp). They were offering it for free download, and I cant seem to find this now that I need it ![:-)](http://web.archive.org/web/20131014173248im_/http:/www.typophile.com/forums/clipart/happy.gif) Anyone remmeber seeing anything like this?   \n   \nHildebrant.\n\n",
  "author": "Hildebrant",
  "time": "30 Jun 2004 — 2:08pm",
  "uid": "1286",
  "comments": [
    {
      "time": "30 Jun 2004 — 5:16pm",
      "content": "Don't know which one is bremuda (sp?) but this one maybe?   \n   \n [http://www.cubanica.com/font/sailorgothic/index.html](http://web.archive.org/web/20131014173248/http:/www.cubanica.com/font/sailorgothic/index.html)   \n   \nNot free though.\n\n"
    },
    {
      "time": "30 Jun 2004 — 5:38pm",
      "content": "Hey fellows, wait a few weeks and you'll have your hands on my brand spakin' new tattoo font as part of the new font set I'm releasing BEFORE Typecon!   \n   \nI may post a graphic to tease you with! You are however correct about a previous post in that our pal Christian Acker of Cubanica created a nice Tattoo font family as well!   \n   \nBest,   \nStuart :D\n\n"
    },
    {
      "time": "30 Jun 2004 — 5:43pm",
      "content": "For your viewing pleasure . . .   \n   \n ![Tattoo Open Face](http://web.archive.org/web/20131014173248im_/http:/www.typophile.com/forums/messages/30/39676.gif)   \n   \n ![Tattoo Ornamental Face](http://web.archive.org/web/20131014173248im_/http:/www.typophile.com/forums/messages/30/39677.gif)   \n   \n:D\n\n"
    },
    {
      "time": "30 Jun 2004 — 6:07pm",
      "content": "Argh, matey. Shiver me timbers, tis a fine one   \no|-)\n\n"
    },
    {
      "time": "30 Jun 2004 — 6:24pm",
      "content": "Let me guess, this is based on the work of legendary tattoo artist Marv Zimblephist, who died in 1927, but you tracked down one of his last clients in a San Diego retirement home...\n\n"
    },
    {
      "time": "30 Jun 2004 — 7:02pm",
      "content": "Somboedy e-mailed me a few years back and asked for an authentic tattoo font. This was an amalgum of my research. I also was aware of Christian's font so I decided if I was gonna do one that I had to do a convincing job of one that was original enough to bring to the masses.   \n   \nIt was doubly verified for 'street cred' with tattoo barren fellow type designer Brian Bonislawsky of Asigmatic.   \n   \nStuart :D\n\n"
    },
    {
      "time": "30 Jun 2004 — 7:50pm",
      "content": "Looks like a cousin to the Art Deco lettering style that Benton turned into \"Broadway\". Or Cooper's modernistic \"Boul Mich\". Was the 1930s the classic era for tattoo art?   \n   \nThe decorated version has a real circus/fairground feel. But as a device, it seems much older, 19th century -- I suspect circus/fair tradition preserved that look. There is an old wood type called \"Circus\" that has the \"half & half\" motif. Did tatoo artists travel with the show?\n\n"
    },
    {
      "time": "1 Jul 2004 — 12:38am",
      "content": "kyle, here's another by [daniel gauthier](http://web.archive.org/web/20131014173248/http:/moorstation.org/typoasis/designers/gaut/) check out the one cleverly called \"Tattoo Lettering\"\n\n"
    },
    {
      "time": "1 Jul 2004 — 7:10am",
      "content": "The decorated version is indeed kind of tacky. I'm personally rather smitten to the \"shaded\".   \n ![](http://web.archive.org/web/20131014173248im_/http:/www.typophile.com/forums/messages/30/39725.gif)\n\n"
    },
    {
      "time": "1 Jul 2004 — 8:12am",
      "content": "Yeah, that's nice -- a different feel again, evocative of vintage funny pages.\n\n"
    },
    {
      "time": "1 Jul 2004 — 8:24am",
      "content": "Thanks guys.   \n   \nAnd Armin, I think im going to purchase sailor gothic, its quite perfect for my application.   \n   \nCheers!\n\n"
    },
    {
      "time": "1 Jul 2004 — 9:36am",
      "content": "You think you could e-mail me a copy of it once you buy it?   \n   \nHa, sorry. Just kidding, just kidding.\n\n"
    },
    {
      "time": "1 Jul 2004 — 6:48pm",
      "content": "You know these guys cant even take a joke of that nature ;)   \n   \nHildebrant.\n\n"
    },
    {
      "time": "2 Jul 2004 — 4:57pm",
      "content": "I know! Not a single laugh\n\n"
    },
    {
      "time": "2 Jul 2004 — 5:09pm",
      "content": "It was actually a very vitty remark :-)\n\n"
    },
    {
      "time": "2 Jul 2004 — 6:42pm",
      "content": "I never \"laugh\" when people apologize for their \"jokes\".   \n   \nBut show me a rotating emoticon...\n\n"
    },
    {
      "time": "3 Jul 2004 — 4:44am",
      "content": "Stuart, I really admire your Tattoo type, Its lovely..   \nPlease keep us, fellow Typophiles, updated on when you are going to release it.. ![:-)](http://web.archive.org/web/20131014173248im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nThanks..\n\n"
    },
    {
      "time": "3 Jul 2004 — 7:40am",
      "content": "\\>Nick, don't tell me you're annoyed with me using   \nthose \"extravagant\" emoticons every once in a while...   \n   \nOh no; \"nuclear blue\" is my favorite color!   \n(ie favourite colour, as I was taught to spell.)\n\n"
    },
    {
      "time": "3 Jul 2004 — 11:55am",
      "content": "\\> You're way too shy about these kinda \"risqu\n\n"
    },
    {
      "time": "7 Jul 2004 — 8:07pm",
      "content": "\\>You think you could e-mail me a copy of it once you buy it? Ha, sorry. Just kidding, just kidding.   \n   \nHA HA. :D I thought it was funny.   \n   \nStuart, your face is looking really nice. It definately has a much more refined feel to it than Sailor Gothic, much more of a typophiles version of Tattoo type . Nicks comment to Benton or Cooper are interesting, because I think your version does have a bit of their spirit to it. It does a nice job of elevating the vernacular to a different place than where it started. Mine tends to keep a lot of the quirks of the \"unedumicated\" letterer.   \n   \n\\>Was the 1930s the classic era for tattoo art?   \n   \nSort of. The motifs started in the late 19th Century but really came into their own by WWI & II. The American Tradition was established between 1920 and 1960, with some designs by guys like Gus Wagner dating as far back as 1900. Most of the design motifs we see today are revivals of the highpoint in American designs from the 50's and 60's, artists like Sailor Jerry, Don Hardy, Bert Grimm to name a few who helped define the aesthetic. By this point the motifs had been established for years and the craft was stressed more.   \n   \n\\> There is an old wood type called \"Circus\" that has the \"half & half\" motif. Did tatoo artists travel with the show?   \n   \nAgain, sort of, think ports and sailors, in New York it was Coney Island,Times Sq and the Bowery. In LA it was the Pike, in Honolulu it was Hotel Street. Carneys, Tattoos and Sailors always seemed to go together.   \n   \nCheers,   \nChristian\n\n"
    },
    {
      "time": "3 Jul 2004 — 3:09am",
      "content": "![](http://web.archive.org/web/20131014173248im_/http:/www.typophile.com/forums/clipart/rofl.gif)\n\n"
    },
    {
      "time": "3 Jul 2004 — 3:22am",
      "content": "You should wait one post before apologizing, Armin.   \nYou're way too shy about these kinda \"risqu\n\n"
    },
    {
      "time": "3 Jul 2004 — 2:29pm",
      "content": "_\\> (ie favourite colour, as I was taught to spell.)_   \n   \nJust like I was, as you might've noticed: Belgium teaches   \n\"British\" spelling.   \n   \n_\\< \"nuclear blue\" is my favorite color!_   \n   \nI agree: all Typophile emoticons should be stylish gray   \n(or is it \"grey\"?) like the plain smiley ![:-)](http://web.archive.org/web/20131014173248im_/http:/www.typophile.com/forums/clipart/happy.gif) The \"special\"   \nones look pretty cheap in comparison.\n\n"
    },
    {
      "time": "11 Jun 2008 — 1:52pm",
      "content": "I'm a maniac for written tattoos. I got one that goes from my shoulder to my hip and it's in Greek using specific characters. It was hard to get it. At first I got the wrong text and had to get an appointment at the [Houston tattoo removal](http://web.archive.org/web/20131014173248/http:/www.newlookhouston.com/) clinic to get it out. I didn't quit, found the right text, the right font and got me my tattoo. It says: Lasciate ogni speranza voi ch'entrate! And it's the curse from Dante's book, the one placed above the gate of hell.\n\n"
    }
  ]
}
