{
  "id": "5434",
  "title": "Business Card for Graphic Design Firm",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I've been struggling for some time with a variety of ideas for a business card layout for my graphic design studio. I've settled into a basic logotype and color pallette that I like and that I've recently deployed across my company website ( [http://www.bainbridgestudios.com](http://web.archive.org/web/20081121165510/http:/www.bainbridgestudios.com/)). What I'm looking for in my business card is something that blends well with the look of the website and that has a bit of punch to it (a style that won't just blend in with every other business card in a person's pocket, for example). I've whittled my way down through about 15 different designs to two that I like, but I'm a bit stuck at this point. I'd love to get some feedback on these two looks, including preferences, further edits, refinements, etc.   \n   \nRight now I'm personally tending towards the first sample, as I feel that the rectangular look goes well with the headings on the website and because I think it's a bit of a different look for a card front. My main concern with it is that it may come off as being too busy (the second sample was a reaction to that particular concern, something with a bit more white space).   \n   \nFor either design, I'm planning on a fairly simple dark grey back with the website's URL. I'm likely going with a heavy white card stock in a matte finish.   \n   \n ![Business Card Sample 1](http://web.archive.org/web/20081121165510im_/http:/www.typophile.com/forums/messages/29/39666.gif)   \n   \n ![Business Card Sample 2](http://web.archive.org/web/20081121165510im_/http:/www.typophile.com/forums/messages/29/39667.gif)   \n   \n ![Business Card Back](http://web.archive.org/web/20081121165510im_/http:/www.typophile.com/forums/messages/29/39668.gif)   \n   \nAny feedback and critiques would be greatly appreciated! Thanks for taking the time to look and review my work.   \n   \nRegards,   \n   \nTom\n\n [‹ Design Studio Logo](http://web.archive.org/web/20081121165510/http:/www.typophile.com/node/5311 \"Go to previous forum topic\") [Theatre Alliance Logo ›](http://web.archive.org/web/20081121165510/http:/www.typophile.com/node/5414 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121165510/http://www.typophile.com/user/4101\" title=\"View user profile.\">tomcarmony</a>",
  "time": "<br>",
  "uid": "4101",
  "comments": [
    {
      "time": " 30.Jun.2004 4.10pm",
      "content": "go with yer gut! it looks good\n\n"
    },
    {
      "time": " 30.Jun.2004 10.49pm",
      "content": "Personally, I prefer the second one, but the first one does better match your site. So...if that's important to you, then go with the first.   \n   \nBoth look nice, and you'll be fine either way!   \n   \nGood work!\n\n"
    },
    {
      "time": " 1.Jul.2004 7.14am",
      "content": "#1\n\n"
    },
    {
      "time": " 1.Jul.2004 12.59pm",
      "content": "Thanks all! The feedback is much appreciated. Paul, I agree with you as far as \"going with my gut\"; it's something I've always been pretty good doing with clients' work, but I often tend to over think and second-guess my own self-promo stuff...\n\n"
    },
    {
      "time": " 1.Jul.2004 1.32pm",
      "content": "I prefer #2. But you might consider making your name smaller, and setting it U&lc. As it stands, your name and the studio name are roughly the same size/shape, and they're fighting for dominance. I think the quiet confidence of a smaller name would add a little sophistication to the presentation.\n\n"
    },
    {
      "time": " 1.Jul.2004 2.30pm",
      "content": "Number one is closed to 'horror vacui' but the best of the two. Number two: I think it's too crowded around the 'B' ... I think the light grey and ochre elements says \"decoration without purpose\" ...   \n   \nGenerally I like your choice of colours.   \n   \nI think the 'B' in the circle is problematic. You have drawn it in perspective, haven't you ... but something is wrong in the bottom ... it looks warped. And the tiny dark grey background just under the 'B' (inside the circle) must be hard to print in small versions.   \n   \n--   \nS\n\n"
    },
    {
      "time": " 1.Jul.2004 6.29pm",
      "content": "Yeah I would definately reduce the size of the name because it is very dominant but just one thing I would watch out. Have the name and email been sized to be the same width? or was that just coincidence? It may be tough to keep the same format for longer or shorter names on other cards.\n\n"
    },
    {
      "time": " 1.Jul.2004 11.19pm",
      "content": "Thanks again for the continued feedback. S\n\n"
    },
    {
      "time": " 2.Jul.2004 12.01am",
      "content": "As I continue tinkering with the design, I've got a couple other layouts I'd like to toss out for consideration and see what you all think. For both, I've added additional information in the main \"box\" (added a title and moved the phone number up from the bottom of the card) and tried aligning it both left and right. I added color to the title simply to break up the block of text a bit. I think it the color also serves to help to emphasize the individual's name without it dominating the studio's name (as in the initial mockups).   \n   \nI also played around with the size and positioning of the logo. I left it in place (lower left) for the first design below (#3) but scaled it 125% and moved it into the color block on the left (version #4). I like the contrast of the colors, which makes the logo appear to \"pop\" a bit more, and it also makes visible the outermost dark grey ring on the logo (which more closely matches my presentation of the logo on my website - [http://www.bainbridgestudios.com](http://web.archive.org/web/20081121165510/http:/www.bainbridgestudios.com/)), but it does seem to shift the balance of the layout quite a bit -- it feels more \"top heavy\" and less anchored with the logo moved up.   \n   \nOf these two I prefer the first (#3) and am somewhere between the revised #1 (#1B -- previous post) and this one.   \n   \n ![](http://web.archive.org/web/20081121165510im_/http:/www.typophile.com/forums/messages/29/39778.gif)   \n   \n ![](http://web.archive.org/web/20081121165510im_/http:/www.typophile.com/forums/messages/29/39779.gif)\n\n"
    }
  ]
}
