{
  "id": "54365",
  "title": "House Industries Releases Fonts and Objects Inspired by Mid-Century Designer Alexander Girard",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20100204121804/http:/typophile.com/user/108 \"View user profile.\") : 3.Feb.2009 1.43pm \n\n(Yorklyn, Del.) February 3, 2009 –– House Industries, a font design and illustration studio, has released a new collection of typography and objects inspired by the work of mid-century designer Alexander Girard.\n\n ![](http://web.archive.org/web/20100204121804im_/http:/typophile.com/files/PRESS_4403.girard_3Dtype_script.jpg)\n\nAs a textile designer for Herman Miller from 1952 to 1973, Alexander Girard collaborated with Charles and Ray Eames and George Nelson to form what is widely known as the Camelot of design. In the mid-century era of Modernist sterility, Girard's folk art sensibilities softened the hard edges of the prevailing style. His love for typography and use of illustrative lettering was evident in his personal work as well as high-profile pieces such as the renowned International Love Heart.\n\nIn creating its own interpretation of the Girard aesthetic, House Industries undertook an extensive research project, exploring four decades of the designer's work archived at Vitra in Germany and Herman Miller in Zeeland, Michigan. A pilgrimage to New Mexico unearthed more reference materials, including Girard's famous Unitarian Church mural in Albuquerque, his collections at the Folk Art Museum in Santa Fe, and more treasures at the home of the Girard family.\n\nFor the Alexander Girard fonts, House Industries designers took inspiration from a variety of source materials.\n\nGirard Script was loosely based on Girard's signature as it was always printed on the selvedge of fabrics he designed, as well as an assortment of obscure personal illustrations.\n\nGirard Slab is a practical slab-serif family of four weights and three widths, inspired by the cover of Herman Miller's 1972 fabric designs catalog and the Girard Miller logo. A special features allows the user to toggle the letter connections on and off.\n\nGirard Sky was based on alphabets drawn by John Neuhart and Karl Tani for Girard's famous rebranding of the Braniff International airline in the 1960s.\n\nGirard Sansusie combines a folksy flair with a lettering style evident throughout the Girard oeuvre, most notably on his 1955 Herman Miller fabric catalog.\n\nIn the spirit of the Herman Miller Textile and Objects store that served as a showplace for Girard's thoughtfully-curated fabric designs, toys and folk art in the 1960s, the House Industries' Alexander Girard Collection features its own set of Girard-inspired objects. Each of these objects tells its own story while gracefully taking its place in any contemporary living space.\n\nSunny faces beam from a set of children's alphabet blocks, originally designed for the San Francisco MoMA show in 2006.  \nHand-made dolls, designed exclusively for House Industries by Marilyn Neuhart, are made from Mexican cotton with the same loving care as the originals she sewed for the opening of the T&O store in 1961.  \nA nativity set of 11 solid maple pieces is based on an original Girard illustration that hangs in his son's house.  \nSnakes, rabbits, fish and foxes form a menagerie of mystery in a childrens’ puzzle based on a Girard carpet design.  \nGirard’s folk sensibilities abound in the cornucopia of illustrative delights found in a 72-piece wood memory game.  \nTo purchase House Industries' Alexander Girard fonts and objects, visit the House Industries website at [www.houseind.com](http://web.archive.org/web/20100204121804/http:/www.houseind.com/).\n\n[Click Here](http://web.archive.org/web/20100204121804/http:/girard.houseind.com/) to view the House Industries Alexander Girard Microsite.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100204121804/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 3.Feb.2009 1.43pm",
  "uid": "108",
  "comments": [

  ]
}
