{
  "id": "5437",
  "title": "The Brick Lane",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "i am pretty new to typofile--there are some great threads with tons of feedback!   \n   \nso far i haven't had too many \"bites\" on what I have posted, but I try again, welcoming any thoughts/ideas/suggestions. . . .   \n   \nI am working on a restaurant logo that I would love some feedback on . . .   \n   \nThe interior is half brick (hence the name) and the other walls have impressionistic european wall murals (which is where the window inspiration came from in the top example).   \n   \nwhat i want to convey:   \nunique elegance   \nsophisticated, but cozy   \nexcellent dining experience   \n   \n ![](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/messages/29/39682.gif)   \n   \nAny thoughts?   \n   \nThanks in advance for taking the time to give me your input!\n\n",
  "author": "sbarlow",
  "time": "30 Jun 2004 — 9:47pm",
  "uid": "4035",
  "comments": [
    {
      "time": "1 Jul 2004 — 5:46am",
      "content": "What kind of food does the restaurant serve?   \nThe logo seems contradictory to the name. It is kind of nice that way. I like it's feminine quality.However,it is very feminine and might alienate most of the male population. How is the place decorated? Your script style is quite elegent and sophisticated. I like the script in the top version but feel like the widow thing is a little much. I think I need more info for an accurate assesment.\n\n"
    },
    {
      "time": "1 Jul 2004 — 7:30am",
      "content": "Thanks, David, for the response!   \n   \nThe restaurant will serve unique gourmet food, dinners will be quite sophisticated and \"fancy\" (like Macadamia Nut Crusted Sea Bass) and lunches will have a more casual feel (like Porcini-Gorgonzola Burgers).   \n   \nIt is a long restaurant, half brick walls; the other half of the walls are painted with impressionistic european murals (many have the shape of the window in the top example.) The owners don't necessarily want any correlation to the \"brick\" or the literal name persay, but they do really like the unique paintings.   \n   \nHere is another sample that is just the script writing but not quite as \"much\" as sample \"f\".   \n   \nAny ideas on how i might create a logo to represent the ambiance and type of food without being so \"feminine\"?   \n   \n ![](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/messages/29/39728.gif)\n\n"
    },
    {
      "time": "1 Jul 2004 — 7:36am",
      "content": "I don't think restaurant logos NEEDS to echo the specifics of the food. That's what the food is for...the food will generate its own reputation without the need of the logo. Of course, you need to hint at the differences between a drive in burger joint and fine dining, but I think that's about the extent of it.   \n   \nThe logo should represent the 'vibe' though, IMHO. And I think yours does a wonderful job. I like both implementations and I think they can both be used together just fine.   \n   \nIs that your own calligraphy?\n\n"
    },
    {
      "time": "1 Jul 2004 — 9:32am",
      "content": "Good work Sally. I like \"f\". As compared to \"e\", it offers more versitility\n\n"
    },
    {
      "time": "1 Jul 2004 — 12:33pm",
      "content": "Thanks for the input Darrel and Scott . . .   \n   \nAh, not my own calligraphy (i wish it was!) . . . just a bit modified   \nEscrita ( [http://www.fontpool.com/search/escrita/page1.html](http://web.archive.org/web/20131023141954/http:/www.fontpool.com/search/escrita/page1.html))   \n   \nThanks for the link, Scott, that is a cool site. I completely agree with you about a typeonly logo (that is also a great idea to take cropped portions of the murals -- I will probably use that in creating their identity pieces.   \n   \nHere is one more idea (this is the one the client likes best so far).   \n   \nDo you think the bricks add something or take away fromthe typeonly logo? Thanks again for the feedback.   \n   \n ![](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/messages/29/39749.gif)\n\n"
    },
    {
      "time": "1 Jul 2004 — 1:11pm",
      "content": "I really like the hand-lettered look of Escrita, but I don't think the addition of the bricks does the logo justice. I agree with Scott's point about the versatility of a type-only logo. If the owners like the use of the brick imagery, I think it could be more effectively included elsewhere in some of the collateral, such as a separate, subtle graphic element on menus, promo materials, etc. The type-only logo is elegant and seems to fit your description of the restaurant on it's own; no need for added bells and whistles.   \n   \nNice work Sally!\n\n"
    },
    {
      "time": "1 Jul 2004 — 2:13pm",
      "content": "Sally,   \n   \nGood job on the designs. I agree with some of the other postings in that I prefer the type only version. And I'd like to see it paired with the murals as mentioned. One small thing though, to me the \"r\" sometimes looks like a \"z\" especially in version e, not so much in the later designs but still enough that when I glance quickly it looks like Bzick.   \n   \nWill the logo be black or color?\n\n"
    },
    {
      "time": "1 Jul 2004 — 3:37pm",
      "content": "Thanks for the feedback . . .   \n   \nI am scrapping the bricks and any other sort of icon as part of the logo . . . i agree that it is much stronger as a type-only unit. (it seems to \"junk up\" the logo and take away from the elegance)   \n   \nI have refined the type and here are three examples of the type-only logo. There are just subtle differences between them -- any thoughts?   \n   \nany suggestions?   \n   \noh, and this will probably just be a one-color logo. I am not sure if it will be black or a color yet.   \n   \n ![](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/messages/29/39759.gif)\n\n"
    },
    {
      "time": "1 Jul 2004 — 4:08pm",
      "content": "I definitely like B the best in the large size. It may need to be a little heavier for the small size (or close some of the breaks/gaps at small sizes). I think \"Lane\" might need to be pulled a bit tighter to Brick (k-L).   \n   \nThey look great.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "1 Jul 2004 — 11:56pm",
      "content": "I think you ought to draw 'THE' as well as three small typeset letters don't mix very well with a lot of calligraphy. They look out of place as regards style. They may be uppercase-regular-serif like they are now ... but not typeset.   \n   \n--   \nS\n\n"
    },
    {
      "time": "2 Jul 2004 — 6:47am",
      "content": "I vote for B. And agree with Scott that in the smaller version you may need to make adjustments for readability. Note especially the swoosh from the k as it loops back over the i - it's starting to look like a t (and thereby making it look like a completely different word)\n\n"
    },
    {
      "time": "2 Jul 2004 — 7:41am",
      "content": "I like B's calligraphy most (the forms and the quality of line), but the word 'The' in the circle stroke just seems like too much emphasis on an unimportant element (or, perhaps it's the type with the caligraphy, like S\n\n"
    },
    {
      "time": "2 Jul 2004 — 8:51am",
      "content": "Thank you for the feedback!   \n   \nS\n\n"
    },
    {
      "time": "2 Jul 2004 — 9:31am",
      "content": "I like D, however, I'd like to see the line break effect like on the \"L\" (as shown) and the \"B\" seems a little heavy at the bowls and the thick part of the left loop-T-loop\n\n"
    },
    {
      "time": "2 Jul 2004 — 11:24am",
      "content": "My understanding of S\n\n"
    },
    {
      "time": "2 Jul 2004 — 12:23pm",
      "content": "Sally -- I may have been a little unclear, English is not my native language.   \n   \nWhat I meant: 'THE' was a \\*font\\*, the rest was calligraphy. And I thought that 'THE', being just three letters, looked out of place with the rest. And should be executed as calligraphy as well, to be in harmony with the rest. Another way of looking at it, if you were to keep the font, you would need more letters, say 'THE RESTAURANT' or similar length. Then it would be strong enough to play a role in a font/calligraphy contrast.   \n   \nThen I said (and you didn't understand this): while calligraphing the word 'THE' you can \\*still\\* make it capitals, and make it upright (regular) (not slanted), depending of what's looking good.   \n   \nHaven't said so yet, but I think you're a skilled calligrapher.   \n   \nAnd I think getting rid of the pictoral element I saw in your first posting was an improvement.   \n   \nGoing to London for three days now, see you later.   \n   \n--   \nS\n\n"
    },
    {
      "time": "6 Jul 2004 — 9:13pm",
      "content": "Thanks everyone for the feedback . . . I have refined the lettering, and am getting close to the final version.   \n   \nAlthough the owners originally said they did not want \"restaurant\" part of the logo, they now want restaurant to be used in some applications (such as their outdoor sign, etc). So this is what I have come up with . . .   \n   \n ![](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/messages/29/40056.gif)   \n   \nany further suggestions for final refinement, etc?   \n   \nThanks! ~ Sally\n\n"
    },
    {
      "time": "7 Jul 2004 — 12:06am",
      "content": "If possible, I would separate \"RESTAURANT\" from the logo. Just drop it below. Niether of the versions you have here are working and restaurant is definitely too small for outdoor signage.\n\n"
    },
    {
      "time": "7 Jul 2004 — 1:52am",
      "content": "I agree with Scott. 'RESTATURANT' can't be placed there. You have in versions H and I created an unbalanced arrangement where all the elements are placed east-south-east of each other ... (sorry, if my English is inadequate: first 'the', then a little down ... then 'Brick', then a little down ... and so on).   \n   \nMaybe, as Scott said you should drop 'RESTAURANT' underneath, and then, for balance, 'the' (or 'The'?) should be placed somewhere above 'ick' or 'ckLa' ...   \n   \nWhether or not 'RESTAURANT' needs a bolder face as regards to signage ... well that depends on the technique of the sign, the colours, the walking speed of the specific street and so on. Although I wouldn't make the so bold/heavy that it were to compete with 'Brick Lane'   \n   \n--   \nS\n\n"
    },
    {
      "time": "7 Jul 2004 — 7:03pm",
      "content": "Thanks Scott and S\n\n"
    },
    {
      "time": "7 Jul 2004 — 8:19pm",
      "content": "Very nice work.   \n   \nThe only thing I might consider altering is \"the\". It seems to me that it needs just a hair more weight, especially at the small size. Other than that, there is nothing I would change. You should be proud.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "8 Jul 2004 — 4:13am",
      "content": "Yes, 'the' needs a little more weight, if the marks has got to be printed in small sizes.   \n   \nDetermine what is the 'worst case' as regards to small size and printing on coarse materials. (Paper napkin?) Then look at the counters of 'h' and 'e' ... do you want them to be filled when printing very small sizes? No? Well, then you have an indication of just how big and how heavy the 'the' should be. (But as Scott says, it shouldn't be very much).   \n   \nHave you considered/tried a capital-T in 'the'? It certainly would fit in with the rest as regards to style (calligraphy, old times and so on). Moreover, it wouldn't add some weight to the element. But then again, maybe it doesn't work -- but it think it should be tried, before you declare the design finished.   \n   \nLooks nice now, positive as well as negative. I can just imagine it applied to signage, matchboxes, menues and so on.   \n   \n--   \nS\n\n"
    },
    {
      "time": "8 Jul 2004 — 8:53am",
      "content": "Thank you for the positive feedback Scott & S\n\n"
    },
    {
      "time": "9 Jul 2004 — 11:44am",
      "content": "Okay, here we go again . . . ![:-)](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI have done a little experimenting with the capital T (might as well not dismiss it without trying a few things!)   \n   \nI have adjusted the weight of the as well as a few other minor adjustments to some of the letters.   \n   \nany thoughts?   \n   \nThanks!\n\n"
    },
    {
      "time": "9 Jul 2004 — 11:46am",
      "content": "![](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/messages/29/40270.gif)\n\n"
    },
    {
      "time": "9 Jul 2004 — 2:23pm",
      "content": "The weight is better.   \n   \nI prefer an UC \"T\" to the LC, but I think this one is a little too frilly for the small size. It needs to be simple. If the lower case \"t\" that you've used had an UC arm across the top, I think you'd be close.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "9 Jul 2004 — 4:42pm",
      "content": "Thanks, Scott, for the advice.   \n   \n . . . i don't know what i was thinking with that capital \"T\" I posted above -- WAY too much. \"too frilly\" is an understatement! ![:-)](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nHere is a toned-down captial T -- although i am still questioning whether the capital t is the best choice:   \n   \nwhat i want to convey:   \nunique elegance   \nsophisticated, but cozy   \nexcellent dining experience   \n   \ndoes the capital t make it just a bit \"too\" sophisticated, taking away the \"coziness\" aspect?   \n   \nAh, the art of finding the balance of \"simple elegance\" . . .   \n   \n ![](http://web.archive.org/web/20131023141954im_/http:/www.typophile.com/forums/messages/29/40291.gif)\n\n"
    },
    {
      "time": "10 Jul 2004 — 3:32am",
      "content": "Yes, this is what I meant. I simply think this calligraphic arrangement looks better with a UC T ... it suits the UC B and L ...   \n   \nGoethe said: \"Some projects are never finished. You have to \\*declare\\* them finished\".   \n   \nI think this mark is finished now ... and you ended up with a solution you will be proud to put in your portfolio.   \n   \n--   \nS\n\n"
    },
    {
      "time": "10 Jul 2004 — 8:11am",
      "content": "Thank you everyone for your feedback . . . especially to you, Scott & S\n\n"
    }
  ]
}
