{
  "id": "54395",
  "title": "Strange things in Word2007 fontmenu",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello all,\n\nWhen I install one of my OpenType typefaces on Windows XP, strange things happen in the Word2007 fontmenu. The .notdef glyph appears a couple of times after the fontname. Why is this? Do I have to change a setting? The fonts are generated using FontLab on a Macintosh computer.  \nThanks in advance!\n\nPieter\n\n ![](http://web.archive.org/web/20121215135234im_/http:/typophile.com/files/fontmenu_word2007_6188.jpg)\n\n",
  "author": "Pieter van Rosmalen",
  "time": "4 Feb 2009 — 2:49am",
  "uid": "5585",
  "comments": [
    {
      "time": "4 Feb 2009 — 11:21am",
      "content": "My guess is that you have a code-page or Unicode range bit set, eg Arabic, Hebrew or Thai, and you don't have any characters from that range in the font.\n\nCheers, Si\n\n"
    },
    {
      "time": "5 Feb 2009 — 12:30am",
      "content": "Hi Si,\n\nYes, thanks. It was the Greek codepage what was the problem. There are no Greek glyphs in the fonts.  \nThanks!\n\nPieter\n\n"
    },
    {
      "time": "5 Feb 2009 — 1:53am",
      "content": "When you have a fonts that contain Latin 2, Turkish and/or Baltic, it is recommended that you set the Greek codepage for MS Word.  \nI think it has to do with the PFM default character.  \nIn Adobe Caslon Pro and Garamond Pro the Greek codepage is set, and the PFM default character is \"space\". Font names look good in Word. In Tekton Pro the PFM Default character is \"bullet\",and not \"space\", and this is what you get\n\n ![](http://web.archive.org/web/20121215135234im_/http:/typophile.com/files/tektonWord_5074.jpg)\n\n"
    },
    {
      "time": "5 Feb 2009 — 2:06am",
      "content": "Hi Micha,\n\nThanks for you answer.\n\nPieter\n\n"
    },
    {
      "time": "5 Feb 2009 — 3:14am",
      "content": "_When you have a fonts that contain Latin 2, Turkish and/or Baltic, it is recommended that you set the Greek codepage for MS Word._\n\nWhy would that be recommended?\n\n"
    },
    {
      "time": "5 Feb 2009 — 3:28am",
      "content": "Please look at fonts from Adobe and Linotype, containing Latin 2, Turkish and Baltic, but not Greek and/or Cyrillic. These fonts all have Greek flagged. As far as I can remember this had something to do with Word not recognizing the extra Latin characters. Couldn't find were the info is, so it might also have to do with another program.\n\n"
    },
    {
      "time": "5 Feb 2009 — 7:35am",
      "content": "Thanks. Indeed I found the Greek codepage bit in some fonts, for example Adobe Caslon Pro. Hm. I had never heard of this before.\n\n"
    },
    {
      "time": "5 Feb 2009 — 10:09am",
      "content": "Is it possible that certain programs will place a font with extended Latin at the very bottom of the font menu (despite alphabetical order) and by setting the Greek, it will place the font back within the main/top font menu?\n\n"
    },
    {
      "time": "5 Feb 2009 — 11:12am",
      "content": "I've not heard of any Word specific reason to include such a hack in OTF fonts. Perhaps the hack is there to support other applications?\n\n"
    },
    {
      "time": "5 Feb 2009 — 12:35pm",
      "content": "I started writing an explanation of this, but it got so long I made it into a blog post instead.\n\n[http://www.thomasphinney.com/2009/02/greek](http://web.archive.org/web/20121215135234/http:/www.thomasphinney.com/2009/02/greek \"http://www.thomasphinney.com/2009/02/greek\")  \nShould be live within a minute or two.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "8 Feb 2009 — 12:28am",
      "content": "Thanks all, you are a great help!\n\nPieter\n\n"
    }
  ]
}
