{
  "id": "54393",
  "title": "Alpha Mack: Blank Glyphs",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "You notice, in the font Alpha Mack, there are lots of blank glyphs, like †§¶ß™µø¬ƒ“”‘’÷‡·‚„¦Þþ¹²³½¼¾Łł≠∑∫Ω√Δ◊⁄ﬁﬂ and evenly Apple. The fl ligature, in Gulim was drawn incorrectly. The thorn was similarly used for Icelandic, but you haven't used it. Alpha Mack even has blank small Ø, where you use Complete Composites to make the missing contours glyph. You mean, AOE has added Žž to the fonts. If you have FontCreator, select the glyphs, trademark and oslash, which is circled as empty glyphs. And click Complete Composites at the toolbar. Because you mean, you have a blank glyph named quoteleft and quoteright. It's just needing empty glyphs will change to simple glyphs when imported. If you have the empty fraction slash, just click the empty glyph, called fraction, then use Complete Composites. Make the glyph simple, then move the slash with Shift-Click. Use the glyph transformer script, called Superscript. It will add the missing ¹²³ glyphs and the missing superscript four to nine glyphs. Cut the glyphs with the PS names onesuperior, twosuperior and threesuperior. Use the glyph transformer script called Superscript. Then select OK. Use Ctrl+E to paste the PS names. When you launched the glyph transformation script, just fix the superscripts. You validated the superscripts. But, you selected a intersecting coordinate in the glyph ² and fixed it. But you removed off-curve extreme coordinates, contours with one or two points and redundant points over the glyph ³. Then you removed the intersecting coordinate over the glyph ³. Then the glyph ³ became no problems detected. You remove the off-curve extreme coordinate and the redundant point over superscript four and removed the superscript fix. You removed 3 points from superscript six and fixed the glyph. And added on-curve extremes, removed redundant points, contours with one or two points and fixed an intersected coordinate over superscripted seven. Superscript eight has no problems, but narrator speaks the number eight. You have an off-curve extreme coordinate and have a redundant point over superscript nine and removed the point. You remove 2 contours over superscript + glyph. Then removed the other points. You also have a contour with unknown direction for minus superscript symbol. And removed the others for superscript equal symbol. You removed 3 points from superscript six and fixed the glyph. And added on-curve extremes, removed redundant points, contours with one or two points and fixed an intersected coordinate over superscripted seven. Superscript eight has no problems, but narrator speaks the number eight. You have an off-curve extreme coordinate and have a redundant point over superscript nine and removed the point. You remove 2 contours over superscript + glyph. Then removed the other points. You also have a contour with unknown direction for minus superscript symbol. And removed the others for superscript equal symbol. Then sorted glyphs by Macintosh ordering. You selected empty glyphs called onehalf, onequarter and threequarters and used Complete Composites to complete the glyphs called ½¼¾.\n\n",
  "author": "386sky",
  "time": "4 Feb 2009 — 1:28am",
  "uid": "40268",
  "comments": [
    {
      "time": "4 Feb 2009 — 8:04am",
      "content": "These are the voyages of the Starship Enterprise…\n\n"
    },
    {
      "time": "4 Feb 2009 — 8:07am",
      "content": "\\*rotfl\\*\n\n"
    },
    {
      "time": "4 Feb 2009 — 8:51am",
      "content": "I see a future in politics.\n\n"
    },
    {
      "time": "4 Feb 2009 — 11:10am",
      "content": "[http://www.thedenverchannel.com/news/18637190/detail.html#-](http://web.archive.org/web/20130821061101/http:/www.thedenverchannel.com/news/18637190/detail.html#- \"http://www.thedenverchannel.com/news/18637190/detail.html#-\")\n\n"
    },
    {
      "time": "4 Feb 2009 — 8:52pm",
      "content": "In [another thread](http://web.archive.org/web/20130821061101/http:/typophile.com/node/53854) TightNotTouching posted the following comment about a similar item (also posted by 386sky):\n\n_The OP is from Seoul, where a form of spoken Mad Libs called “Type Scat” is sweeping the nation. Unfortunately it loses something when translated from the original Korean._  \n&nbsp;  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ~~~~~~~~~~~~~~~~~  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_When going from_ A to Z,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_I often end up_ At Oz.\n\n"
    }
  ]
}
