{
  "id": "54399",
  "title": "First Typeface / First Post",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "So I've taken my first shot at designing a face. This is very much trial by fire for me so there are many mistakes in here and any criticisms would honestly be excellent. Outside of just general criticism I was also looking for advice on how to make the z and x work because they seem to fly in the face of what had been done previously with the serifs, and also if there is a better way to handle the letters r-v because they seem much too small in relation to the other letters.\n\n| Attachment | Size |\n| --- | --- |\n| [Untitled-1.pdf](http://web.archive.org/web/20150416052723/http:/typophile.com/files/Untitled-1_0.pdf) | 209.75 KB |\n\n",
  "author": "poor mans superman",
  "time": "4 Feb 2009 — 6:37am",
  "uid": "42049",
  "comments": [
    {
      "time": "4 Feb 2009 — 7:10am",
      "content": "Real nice display type. Kind of Zuzana Licko meets Margo Chase. Good luck!\n\n"
    },
    {
      "time": "5 Feb 2009 — 7:06am",
      "content": "Thanks, with some luck there will be more not too far behind this one.\n\n"
    },
    {
      "time": "10 Feb 2009 — 12:59am",
      "content": "The first few letters come across as HUGE compared to the ones at the end. My advice, don't use the same sized circle, but optically adjust it so that all the letters look equal. The \"s\" also has a rather squashed/pained look about it\n\n"
    },
    {
      "time": "13 Mar 2009 — 2:24pm",
      "content": "I don't think the \"R\" and the \"S\" need to be based on a more narrow circle than the other circular letters. It might be worth a try to make the top right of the R curve down, instead of drop off. Also, maybe incorporate your slanted serif/terminator strokes into the R and S. Just my 2 cents.\n\nIt's like blackletter meets Futura! I like it.\n\n"
    },
    {
      "time": "14 Mar 2009 — 10:09am",
      "content": "I really like this typeface! At first glance, my eye wanted to make the B into an H. Maybe consider elongating the rounded line just slightly. With the R, possibly rounding out the top a little will help. Very good job!!!\n\n"
    },
    {
      "time": "15 Mar 2009 — 8:15pm",
      "content": "Like the typeface, the second I saw it my eyes just shot open. The contrast between thick and thins is really nice.\n\nThe only thing that I saw that was vaguely odd was the way the \"r\" and the \"f\" don't have the slant serif at the bottom like the \"h\" and the \"m\", for example, do. Just noticed the \"l\" does the same, is there a reason you did those particular letters different from the others?\n\n"
    }
  ]
}
