{
  "id": "54411",
  "title": "“Grammar” of comic-book typography",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Blambot (apparently a member here; [previous discussion](http://web.archive.org/web/20100522182030/http:/typophile.com/node/21084)) published an entire guide to [Comics Grammar & Tradition](http://web.archive.org/web/20100522182030/http:/www.blambot.com/grammar.shtml) that seems almost as rigorous as the BMW style manual. (Actual author credit is Nate Piekos.) Who knew there were so many rules about italics (actually obliques)?\n\n",
  "author": "<a href=\"/web/20100522182030/http://typophile.com/user/7076\" title=\"View user profile.\">joeclark</a>",
  "time": "<br>",
  "uid": "7076",
  "comments": [
    {
      "time": "",
      "content": "The one thing he neglects is the series of five or more dots alone in a word balloon, sometimes accompanied by punctuation or a breath syllable. It is not an ellipsis, which he does cover. This is more of a tradition in Japanese comics, indicating a speechless hesitation with ambiguous meaning. Since this is a guide for comic letterers, this might be an important addition, considering the volume of translations that are published these days (and the domestic writers that are influenced by them) that they might be called to work on.\n\nHe makes a good point about the use of the crossbar \"I\", which is something to consider in developing a comic lettering font.\n\n"
    },
    {
      "time": "",
      "content": "The guide by Nate is solid & perfect.\n\nLettering by Todd Klein (\"Special thanks to Todd Klein, Clem Robins, Scott Allie and Jason Arthur for their time and contributions.\"), 1996, Batman b/w:\n\n ![](http://web.archive.org/web/20100522182030im_/http:/typophile.com/files/ComicA_4332.gif)\n\n ![](http://web.archive.org/web/20100522182030im_/http:/typophile.com/files/ComicB_3771.gif)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100522182030im_/http:/typophile.com/files/watchmen_4531.jpg)\n\nThis is Watchmen 1986-87 lettering by Dave Gibbons. He mixed serif and sans in his I's so I put serifs on CS since the 'l' and 'I' could be different and he seems to follow the personal pronoun rule.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100522182030im_/http:/typophile.com/files/gram_whisper_6645.jpg)\n  \nI've always thought it funny that comic book whispers don't relinquish the exclamation point.\n"
    },
    {
      "time": "",
      "content": "I generally write in all-caps, and I also use the vestigial serifs on the personal pronoun.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I’ve always thought it funny that comic book whispers don’t relinquish the exclamation point.</cite>\n\nBut you can still be emphatic while whispering.\n\n"
    }
  ]
}
