{
  "id": "54431",
  "title": "Remake of Aurora Grotesk",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi Everyone,\n\nI recently discovered on a website what looked a lot like Aurora Grotesk, an old metal face used a lot in the early 20th century. I emailed the webmaster and he directed me to [this link](http://web.archive.org/web/20150215060633/http:/www.urbanfonts.com/fonts/Reservoir_Grunge.htm).\n\nHas someone done a digitisation of Aurora Grotesk before, making this just a rip off, or has someone genuinely made a digital replica of this old metal family?\n\n",
  "author": "Rafe Copeland",
  "time": "4 Feb 2009 — 6:55pm",
  "uid": "26154",
  "comments": [
    {
      "time": "4 Feb 2009 — 9:07pm",
      "content": "Can you elaborate on how you define the difference between a rip-off and a genuine digital replica in this case?\n\n"
    },
    {
      "time": "4 Feb 2009 — 9:29pm",
      "content": "Check out [Announce](http://web.archive.org/web/20150215060633/http:/new.myfonts.com/fonts/canadatype/annonce/) at MyFonts.  \n&nbsp;  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ~~~~~~~~~~~~~~~~~  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_When going from_ A to Z,  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_I often end up_ At Oz.\n\n"
    },
    {
      "time": "5 Feb 2009 — 2:11am",
      "content": "The Berthold AG made PS Type 1 fonts of 7 different Staromat styles (light, bold etc. etc.) of Aurora in the years 1991 and 1992. This was shortly before the bankruptcy. The Hunt ripoff outfit does not sell these due to trademark conflict with the name Aurora which could not be registered by Harvey and Melissa Hunt. The Bitstream outfit made PS fonts of two narrow Aurora styles selling them also under the name \"Swiss 939\" (see [http://www.sanskritweb.net/forgers/bitstream2.pdf](http://web.archive.org/web/20150215060633/http:/www.sanskritweb.net/forgers/bitstream2.pdf \"http://www.sanskritweb.net/forgers/bitstream2.pdf\"), page 2).\n\n"
    },
    {
      "time": "5 Feb 2009 — 2:31am",
      "content": "Note for historians:\n\nThe Weber foundry offered 12 different cuts of the Aurora handcomposition type:\n\nsee [http://www.sanskritweb.net/temporary/aurora.gif](http://web.archive.org/web/20150215060633/http:/www.sanskritweb.net/temporary/aurora.gif \"http://www.sanskritweb.net/temporary/aurora.gif\")\n\n"
    },
    {
      "time": "5 Feb 2009 — 10:04am",
      "content": "I am quoting from the blurb on Myfonts website\n\n‘  \nAnnonce is a digitization and expansion of a 1912 Johannes Wagner Foundry classic called Aurora Grotesk, which also circulated later on in metal under the name Annonce.\n\nBold, extended and clear as a bell, Annonce stood out as the definite big sign font long before Helvetica and Venus.’\n\nI am not sure that you can be clear that it was an original design of Johannes Wagner; the same typeface appears under a multiple of names in the Handbuch der Schriftarten, p210, 1926:\n\nKrupp-Hallo, Wagner & Schmidt and then Ludwig & Mayer  \nVenus-Grotesk, Breite fette, Bauersche Gießerei  \nAkzidenz-Grotesk, Breite fette, Haas’sche Schriftgießerei  \nSiegfried-Grotesk, D. Stempel  \nKoloß, Breite, J. John Söhne, Hamburg  \nKlassische Grotesek, Breite fette, J. D. Trennert & Sohn  \nEdel-Grotesk, Fette, Ludwig Wagner  \nProgreß-Grotesk, C. E. Weber  \nFavorit-Grotesk, Otto Weisert\n\nNow which is the original? It seems to me that the design is quite different from the regular width and weights of Aurora, suggesting that is not part of the original design. More likely that it was added to the family at a later date, and then given the name Aurora to benefit from the ‘brand name’\n\n"
    },
    {
      "time": "5 Feb 2009 — 4:52pm",
      "content": "Thanks for all the information!\n\n@twardoch i wondered if anyone had already made a digital version which this Reservoir Grunge ripped off, or if it was the first digital version of the font to pop up.\n\nIt seems that the font has been around digitally for a while as Annonce though.\n\nOn another note, it seems that many old faces held a multitude of names credited to a multitude of different designers. Was this because of laxer copyright rules back then, or because of a different attitude to sharing and collaborating and/or the need to claim the credit?\n\n"
    },
    {
      "time": "6 Feb 2009 — 1:54am",
      "content": "Paul, see also Cairoli by Nebiolo. Me and Claudio Piccinini have been trying to find the origins for this for a couple of years now, and indeed we came upon most of the faces you mentioned.\n\n"
    },
    {
      "time": "6 Feb 2009 — 2:01am",
      "content": "Also relevant: [Dada Grotesk](http://web.archive.org/web/20150215060633/http:/www.optimo.ch/pages/departement/index.php?id_categorie=1&id_font=18) by Alexandre Dimos & Gaël Étienne, deValence, and sold by Optimo.\n\n"
    },
    {
      "time": "7 Feb 2009 — 3:55am",
      "content": "Hello Rafe, Antonio addressed me to this thread.\n\nAs Uli already said, Aurora is a C.E. Weber typeface. I have not been able to determine a precise date yet, the earliest records I have found would state a date around 1912. The narrower weights came later.  \nThe cut of Aurora Grotesk you are looking for is the boldest version of the extended weights: Aurora-Grotesk Breitfett (\"Garnitur V\").  \nThe Aurora family has been generically credited to Johannes Wagner, but the family is described in Weber specimens (I have two) as an \"Hauschnitt\" (in-house) design. While I'm pretty sure the original version is Weber's, at the time the design was so widespread that almost every German foundry had its version (some with very small differences). It may even be that some of them were produced as authorized versions after the original. In Italy we had Nebiolo's own version, Cairoli, and in Spain they had Grotesca Ideal, produced by the Gans foundry.\n\nIt's quite difficult to find faithful digital versions of the Aurora family outside the two condensed weights mentioned by Uli, which are well done and available from Bitstream in Type1 and Truetype format. Optimo's Dada Grotesk is an interpretation steering towards a less geometric and late 19th century feeling, but not really faithful to the original.  \nI don't know about the quality of Annonce; in general Canada type's digital versions do not look accurate to me.\n\nEDIT: A thank you to Henning Krause, Erik Spiekermann and Elena (from Spain) for the help in my research so far.\n\n"
    },
    {
      "time": "7 Feb 2009 — 4:20am",
      "content": "For those who do not have volume 2 of the book \"Alphabete\" by Stiebner/Huber, published in 1990, I scanned the 7 Aurora alphabets contained in this book.\n\nsee [http://www.sanskritweb.net/temporary/aurora1.gif](http://web.archive.org/web/20150215060633/http:/www.sanskritweb.net/temporary/aurora1.gif \"http://www.sanskritweb.net/temporary/aurora1.gif\")\n\nsee [http://www.sanskritweb.net/temporary/aurora2.gif](http://web.archive.org/web/20150215060633/http:/www.sanskritweb.net/temporary/aurora2.gif \"http://www.sanskritweb.net/temporary/aurora2.gif\")\n\nsee [http://www.sanskritweb.net/temporary/aurora3.gif](http://web.archive.org/web/20150215060633/http:/www.sanskritweb.net/temporary/aurora3.gif \"http://www.sanskritweb.net/temporary/aurora3.gif\")\n\nNo additional information is given in the \"Alphabete\" book about the source of these fonts. My guess is that the fonts depicted were photocomposition fonts, perhaps drawn from some of the old Berthold Staromat photo-typesetting fonts, but Berthold offered twelve Aurora alphabets, not only seven.\n\n"
    },
    {
      "time": "9 Sep 2010 — 12:59pm",
      "content": "Thirteen, actually. But the last was more of a \"cousin\", it has circular forms; I have it on a specimen which is probably from the 1930s-1940s and it's called \"Garnitur 13\" \"Rund-Grotesk Kursiv\"…\n\nJust found out this thread again… :-)\n\n"
    }
  ]
}
