{
  "id": "54502",
  "title": "Logo for minimalsites.com",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "i designed a logo for [www.minimalsites.com](http://web.archive.org/www.minimalsites.com \"minimal design website gallery\")\n\nany thoughts?\n\n",
  "author": "the2ndday",
  "time": "6 Feb 2009 — 12:13pm",
  "uid": "11148",
  "comments": [
    {
      "time": "6 Feb 2009 — 12:42pm",
      "content": "Pretty nice, but at the time of posting your link stays local (to a typophile blog).\n\n"
    },
    {
      "time": "6 Feb 2009 — 2:12pm",
      "content": "I like the M treatment a lot. It is unique and relates well to the concept of minimalism.\n\nHowever mixing the uppercase M into lowercase text is visually disturbing. When the label is read, the eye first catches the leading M and the \"minimal\" is perceived as an uppercase text. Then there's a visual break after \"L\" and a lowercase part starts. Something like this:\n\n ![](http://web.archive.org/web/20131023024415im_/http:/typophile.com/files/yadda_3626.png)\n\n.  \nSo the resulting impression is that the text is set in two parts - uppercase and lowercase - which have the same vertical size. This looks strange and not exactly visually pleasing.\n\n"
    },
    {
      "time": "7 Feb 2009 — 10:01am",
      "content": "I agree with epsilicon. There was something bugging me about it, and you put your finger right on it. What would it look like for the rest to be small caps (rather than lowercase)?\n\npenn\n\n"
    },
    {
      "time": "8 Feb 2009 — 11:06pm",
      "content": "M treatment does look nice, but I think it doesn't play well with this logo because lower case letters tend to be round. Because Ms have cut outs they are even more sharp than normal.\n\nIt's also quite distracting that \"al\" are stronger/heavier compared to other letters. So the whole logo does look nice to some degree but it should be finished properly.\n\nSomeone else's comment on having upper case letters to represent minimalism does hold water here. I guess.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
