{
  "id": "54510",
  "title": "A shame that digitized Electra and Fairfield look so lifeless",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I tried to increase the print density from 3 to 5, to no avail. These two otherwise gorgeous classics haven't survived the trip to digital.\n\nI've got Corundum Text, and although it looks like an Electra-ish, Fairfield-ish revival, it's too far removed. Same for Prensa.\n\nAre there any others I should be looking at?\n\nThanks.\n\n",
  "author": "_Palatine_",
  "time": "6 Feb 2009 — 2:57pm",
  "uid": "37663",
  "comments": [
    {
      "time": "6 Feb 2009 — 4:32pm",
      "content": "Quiosco is a little bit more weighty Electra-ish design:\n\n[www.fontbureau.com/fonts/Quiosco](http://web.archive.org/web/20131021023925/http:/www.fontbureau.com/fonts/Quiosco \"www.fontbureau.com/fonts/Quiosco\")\n\nNot available for Retail license yet, however.\n\n"
    },
    {
      "time": "6 Feb 2009 — 6:32pm",
      "content": "Fairfield looks pretty solid to me on pulpy paper. I must be reading the 55.\n\n"
    },
    {
      "time": "7 Feb 2009 — 5:26am",
      "content": "You might take a look at Whitman. It is a little light for these tired old eyes, but the contrast (thick/thin stroke ratio) is just right for direct-to-plate offset printing. Pretty good with PostScript laser printers, too.\n\nA font that looks interesting but I haven't tried is Emerson. It <cite>looks</cite> like they have adjusted the contrast for modern printing, but no guarantees.\n\nThese fonts are not revivals of Electra or Fairfield, but 21st century interpretations of the same kind of thinking.\n\n"
    },
    {
      "time": "7 Feb 2009 — 7:11am",
      "content": "I'll give Fairfield 55 another shot, on different paper. Whitman as well.\n\nWho makes Emerson?\n\nThanks for the replies.\n\n"
    },
    {
      "time": "7 Feb 2009 — 8:13am",
      "content": "Emerson can be found at\n\n[http://www.nonpareiltype.com/](http://web.archive.org/web/20131021023925/http:/www.nonpareiltype.com/ \"http://www.nonpareiltype.com/\")\n\nI wonder if here is no f\\_i ligature?\n\n"
    },
    {
      "time": "7 Feb 2009 — 8:26am",
      "content": "I see one in the PDF, and an ff as well.\n\n"
    },
    {
      "time": "7 Feb 2009 — 9:28am",
      "content": "I have Nonpareil's Emerson. I haven't had occasion to use it yet, and I am unconcluded as to how I feel about it. I love metal Emerson, and this doesn't feel quite the same. Perhaps no one is more qualified to revive Emerson than Jerry Kelly, but still . . . .\n\nPerhaps it's just that _je ne sais quoi_ that seems to always prevent any revival from recapturing the essence of metal. It's certainly more comfortable than the digitizations of Electra, Caledonia, et al.\n\nThere are f and double-f ligatures; but oddly enough, the fi and ffi don't connect. Actually, now that I look at my metal example, the fi ligature doesn't connect in the original either. But the digital revival retains the tittle, rather than arching the arm over to shelter the i as in the metal.\n\nPerhaps I can post comparisons later.\n\nBTW, the new Whitman Semibold is just a tad heavier than the Roman and might appease those looking for a slightly darker Whitman, especially on coated stock.\n\n-- K.\n\n"
    },
    {
      "time": "8 Feb 2009 — 8:02am",
      "content": "Here's a comparison of metal and digital Emerson. The metal sample is taken from a 1992 checklist of an exhibition held at The Grolier Club, <cite>German Fine Printing 19481988</cite>, designed by Jerry Kelly and composed and printed at The Stinehour Press. The digital is my recreation of the same excerpt using Jerry Kelly's digital revival of Emerson.\n\n ![](http://web.archive.org/web/20131021023925im_/http:/typophile.com/files/Emerson_GermanFinePrinting_3615.png)\n  \n\n ![](http://web.archive.org/web/20131021023925im_/http:/typophile.com/files/Emerson-digital_GFP_4182.png)\n\n&nbsp;  \nObviously, the metal/letterpress has ink gain which the digital does not presume to reproduce. The digital is fitted overall a bit looser. (In order to preserve the same line breaks, I had to set the measure about 3% longer.) The overall contrast is not bad, as Charles observed. I think I might have liked just a touch more weight in the serifs, myself.\n\nI've been hoping to see this Emerson set and printed in a typical trade setting to properly gauge the face.\n\nThere are some unexplained idiosyncrasies in the digital version. Notice the fi ligature in \"first\" in the sixth line. That is indeed the so-called ligature in the digital recreation. The arm of the f is pulled back and the tittle is retained, as I mentioned above. In addition, the spacing seems a little tight in relation to the looser fitting.\n\nI am also at a loss to explain the tightening of the double quotation marks so much. Granted, the original may have been individual single-quote sorts and is a bit loose. But the digital is too tight for my taste.\n\nThese are minor quibbles. The overall production looks sound to me. As I said, certainly preferable to most current digital versions of other popular book typefaces from that period.\n\n-- Kent.\n\n"
    },
    {
      "time": "8 Feb 2009 — 6:21pm",
      "content": "Thanks Kent. I do find the digital version too light (especially if what Kent is showing us is a typical laser printer printout. DTP-offset would be lighter, and with more contrast).\n\nOn this whole notion of ink gain: If we are to believe what Smeijers said in <cite>Counterpunch</cite>, the people who made metal punches took that into account. My conclusion is that \\*most\\* of what is termed \"ink gain\" is on purpose; the form of the raw punch is not correct.\n\n\\* \\* \\*\n\n\"Lifeless\" can mean different things to different people. To me, the sparkle in a typeface comes from the thick/thin stroke ratio. Baur Bodoni has a lot of sparkle. Bodoni Book, less so. But Baur Bodoni has too much sparkle, and the fine lines are too fine, to be successful for setting extended text.\n\nAn interesting font is Matthew Carter's Galliard. The Carter & Cone version is PostScript, made when the printing chain with PostScript fonts was still repro/negative/plate. This font had just the right sparkle, or life. When output changed to direct-to-plate, the fine lines were too fine. A lot of the Gallaird users got down on printers, or assumed \"bad digitization.\" But Galliard was already digitized, the technical change that took some of it's life came farther down the production stream.\n\nFairfield 55 strikes me as having a similar problem, at least as far as its \"lifeless\" goes. We have a customer who likes it; I was trying to discourage her as I figured it would take me about 100 hours to rework the contrast to get it to print right DTP. And no guarantees, I could easily hash it up. Moreover, given licensing, the font could only be used in our shop for books we set. When I asked the designer what she liked about Fairfield, she also mentioned liking Electra (in metal). With that clue, I recommended Whitman. We'll see how she likes it.\n\nBTW Kent, that press has had to cut back & put people on reduced work, so quite rightly they aren't sending any more work out if they can set it in house. If she likes Whitman, how about selling me a gift certificate so they can have the font properly licensed, & I'll pay the bill?\n\n"
    },
    {
      "time": "9 Feb 2009 — 4:43am",
      "content": "I don’t believe I’ve ever heard this point made about direct-to-plate. Here is a Fairfield sample from a contemporary pulp paperback. I don’t know which weight was used, but it looks to be set right at 8 pt. To me the weight looked pretty good, but that may be because I had just finished a book set in Bembo.\n\n ![](http://web.archive.org/web/20131021023925im_/http:/typophile.com/files/FF_6630.jpg)\n\n"
    },
    {
      "time": "9 Feb 2009 — 6:35am",
      "content": "Charles, I didn't take time to print out and scan back in the digital sample above. It's rasterized from PDF, so purely virtual reproduction. I would expect maybe a slight softening and gain in weight (if not reduction in contrast) from D2P and offset.\n\n<cite> &gt; On this whole notion of ink gain: If we are to believe what Smeijers said in Counterpunch, the people who made metal punches took that into account. </cite>\n\nIn my opinion, it's not so much that they \"took that into account.\" The ink is what they were looking at. What I mean is, I don't think they were trying to imagine what it would look like (i.e., accounting for); they were looking at what it looked like. I believe even a smoke proof adds a bit, as the card was slightly damped in order to take a decent proof impression. Not arguing with you, just a different semantic take. Yes, I come to the same conclusion as you.\n\nRe: Whitman license. Sounds reasonable. I'm sure something can be worked out. If it comes to pass, e-mail Harry Parker and copy me on it.\n\n-- K.\n\n"
    },
    {
      "time": "9 Feb 2009 — 7:28am",
      "content": "Mark -- 8 point? Really? That's pretty small by today's standards. The ~12-pt letterforms look a little narrow to me at 8 pt. But overall color seems passable.\n\nJust for kicks, here's an excerpt from the original Fairfield specimen, 9/12 pt and 8/11. Tried to scale so that the 8pt sample is approximately the same as yours.\n\n ![](http://web.archive.org/web/20131021023925im_/http:/typophile.com/files/FairfieldSpec_9-8pt_4300.jpg)\n\n"
    },
    {
      "time": "9 Feb 2009 — 7:41am",
      "content": "It isn’t a really big trim size, but then I’m just laying a Schaedler over the top,\n\n ![](http://web.archive.org/web/20131021023925im_/http:/typophile.com/files/8pt_5730.jpg)\n\nso it might be bigger.\n\n"
    },
    {
      "time": "9 Feb 2009 — 7:52am",
      "content": "Is that Schaedler gauge based on cap height? Do you know what the basis for assumption is? 70%? I think that's the typical assumption. Digital Fairfield cap height is 678, so that would make your guess about right.\n\n"
    },
    {
      "time": "9 Feb 2009 — 8:12am",
      "content": "Actually, I believe I’m not using the scale correctly and had assumed it was a rework of the more common “E” scale.I’ll get a more precise answer, but there are just under 60 characters per line at a 22 pica measure. Probably 9 pt is a better guess.\n\n"
    },
    {
      "time": "9 Feb 2009 — 8:42am",
      "content": "The Emerson samples are quite telling. The digital version is obviously a bit lighter, but I think it comes close enough in certain respects. I hesitate to increase the print density for fear of distorting the forms, though.\n\n"
    },
    {
      "time": "9 Feb 2009 — 9:36am",
      "content": "<cite> &gt; assumed it was a rework of the more common “E” scale.</cite>\n\nWhat I assumed too, Mark. Good assumption. Could it be em square? Can you just measure that little square and see?\n\nChristian, there's a good deal more \"magic\" going on in letterpress than just increased print density. Getting the same feeling in digital -- without being anachronistic and literal warts-and-all -- is perhaps something of a holy grail for some, and certainly no mean feat.\n\n"
    },
    {
      "time": "9 Feb 2009 — 9:50am",
      "content": "Color me chastised. If I bend it back on itself it matches the rule weight scale.\n\n"
    },
    {
      "time": "9 Feb 2009 — 11:45am",
      "content": "How common were double-quote sorts in metal type?\n\n"
    },
    {
      "time": "9 Feb 2009 — 2:10pm",
      "content": "For the fun of it, here is Fairfield medium, (just a bit reworked, but not reweighted or contrast changed), set 9/12. This is a gif image of the InDesign file, so of course no printing is involved. But if it occurred in a piece with halftones, the printer would need to hold the dotgain to as little as possible, and the contrast would stay much different than what Kent showed above. I imagine it would stay pretty much as is even if there weren't halftones . . .\n\n ![](http://web.archive.org/web/20131021023925im_/http:/typophile.com/files/Fair-1%20copy_5420.gif)\n\n"
    },
    {
      "time": "9 Feb 2009 — 4:41pm",
      "content": "Good question, Craig. A quick look through the Big Red Linotype specimen and the 1923 ATF catalog reveals mostly just singles in the alphabet showings. And the scheme for a Monotype C-arrangement matrix seems to have positions only for singles.\n\n"
    },
    {
      "time": "9 Feb 2009 — 6:32pm",
      "content": "Interesting; I wonder if the double-quote only became conceived as a glyph unto itself with the advent of monospaced printing (e.g. typewriters).\n\n"
    },
    {
      "time": "10 Feb 2009 — 6:43am",
      "content": "My recollection from Monotype keyboard and hand work days is that you needed to twice tap a single quote when you wanted double open or close quotes. This makes sense given the limited number of positions for 5-unit characters in a Monotype matrix case. The number of slots in a Linotype magazine would have imposed the same necessity, to make room for more mats. (At least I think the quote is 5 units: no material here to check that.)\n\nMaybe that's why the Monotype shop I worked in adopted the 'English' style of using single quotes rather than the \"American\" style of doubles. Perhaps there was an efficiency expert lurking somewhere who saw a way to reduce the number of keystrokes and thus improve our efficiency. ;-)\n\npowers\n\n"
    },
    {
      "time": "10 Feb 2009 — 6:59am",
      "content": "Yes, Monotype single quote is 5 units (in C arrangement, at least).\n\nAnd looking now at several Linotype keyboard diagrams, I can confirm that there were only keys for singles there as well.\n\n"
    },
    {
      "time": "10 Feb 2009 — 8:18am",
      "content": "With the 8-bit PostScript fonts, we did the same thing when using TeX. Since we ran TeX out of a DOS box, we could use any encoding vector we wanted. By using two single quotes (kerned) for double quotes, two character positions were saved, and sometimes you needed them.\n\nWhile not an issue with metal, the only compromise was that space after a letter to a quote was the same whether it was an apostrophe or a close double quote. I suppose you could argue the merits of separate characters, but it didn't seem to affect the quality of the work, and we kept with it until 2007, when we shifted to InDesign & 16-bit fonts. A 65,000+ character typecase sure changes things.\n\n"
    },
    {
      "time": "10 Feb 2009 — 1:47pm",
      "content": "I have always loved that U in metal Fairfield, imho the digital one seems not really an improvement. Ugly.\n\n"
    },
    {
      "time": "11 Feb 2009 — 6:17am",
      "content": "In digital we only get \"Light\" and \"Medium \" variants of Fairfield. Under normal printing conditions the light falls apart and the medium tries to beat you over the head with a club. Simply horrible. I tried to use some thick, creamy paper, but to no avail.\n\nOn the other hand, after playing with digital Electra a bit more I've noticed that it puts up quite a fight. Digital's battle against metal in this case is still a losing one, but perhaps with creamier, slightly darker paper it'll look half decent. It would seem this version needs only a bit of tweaking here and there to make it work. Perhaps someone, someday, will take up the challenge. We don't need a \"revival\" of Electra. We need someone to just fix what we've already got. After all, Dante survived. I'm not sure why or how, but it did.\n\nI don't know what to make of Kent's Emerson samples. The digital version looks like a completely different beast. It lacks presence. Then again, I can't tell for sure unless I see it on a page.\n\n"
    },
    {
      "time": "11 Feb 2009 — 6:41am",
      "content": "My assessment of digital Electra is that it needs more than just a \"bit of tweaking here and there.\"\n\nWe went through a lengthy and roundabout discussion of Electra on Typophile many years ago, but I think that thread is fragmented and buried in the archives.\n\nFrom my explorations into the matter, I believe the digital Electra suffers from more than just high contrast. The proportions in the existing digital were inherited from a phototype version which was adapted for an 18-unit constraint early in the evolution of Linotype's phototypesetters. The differences are subtle, but enough to produce a different rhythm, in addition to weight/contrast issues.\n\nAlso, I suspect that some of the curves have lost something in translation, compared to the original. I know this for a fact in the case of Caledonia, as I've spent some time analyzing the original drawings. I would expect similar divergence in Electra.\n\nI agree, what's needed is not so much a \"revival\" as a careful \"restoration.\"\n\n-- Kent.\n\n"
    },
    {
      "time": "11 Feb 2009 — 7:13am",
      "content": "Just a correction to my Fairfield comment: we do get more variety than just the light and medium, but the others aren't much better, although the bold weights are as good as any bold weights can be.\n\n[http://www.linotype.com/363/electra-family.html#](http://web.archive.org/web/20131021023925/http:/www.linotype.com/363/electra-family.html# \"http://www.linotype.com/363/electra-family.html#\")\n\n\"Electra had received a Certificate for Typographic Excellence in Type Design in 1998 from the Type Directors Club ( TDC ) of New York.\"\n\nI assume this wasn't for the digital version.\n\n"
    },
    {
      "time": "11 Feb 2009 — 7:56am",
      "content": "Well, it was; and quite frankly the award baffles me. The TDC on-line competition archives don't go back far enough to know who was on that jury.\n\n"
    },
    {
      "time": "13 Feb 2009 — 2:25pm",
      "content": "So I’ll toss this on top of the pile.\n\n<cite><br>\nYou are partly right as to the intended use of the hairline open boxes marked with \"pt\" sizes on our 18\" Schaedler Precision Rule. Most users would place the empty boxes over a piece of printed text to identify the pt (point) size of the typeface being used. It is much easier to identify the size of letters inside an enclosed box rather than using the tiny calibration marks on the points/picas calibration scales.<br>\n<cite><br>\n       BUT, and this is a big \"but,\" measuring should be done from the highest ascender of a typeface to the lowest descender of the lower case letters -- not the capital letters as with most E-scales. I usually look for words in the text-to-be-measured which have an ascending letter (like an \"l\" or \"h\") right next to a descending letter (like a \"p\", \"g\" or \"y\") so I can view both letters at the same time in my viewing boxes.<br>\n<cite><br>\n       Do not measure capital letters because they vary in size depending on the style of the typeface. Keep in mind, point sizes are always measured from the highest ascender to the lowest descender.<br>\n<cite><br>\n       Now, I hate to complicate your life, but many typographers insert 1 or 2 or more points of empty space between lines to increase legibility (and to prevent lowest descenders of the line above from actually touching highest ascenders from the line below). This space is called \"leading\" because years ago in the days of metal typefaces, strips of lead were inserted between lines of metal type.<br>\n<cite><br>\n       So, when measuring point sizes of text typefaces, it's usually a good idea to measure from baseline to baseline (rather than from highest ascender to lowest descender). This will catch any leading between lines. Typographers generally use two numbers to indicate size of face plus leading. For example, the term \"10/12\" means a point size of ten plus a 2 pt space for leading totaling 12 total points.<br>\n<cite><br>\n       Hey, if it were easy, everybody would be a typographer and we'd all be out of a job. Thanks again for your inquiry.</cite></cite></cite></cite></cite></cite>\n\n<cite> ........................................................ John Schaedler<br>\n<cite></cite></cite>\n\n"
    },
    {
      "time": "13 Feb 2009 — 4:38pm",
      "content": "The older faces, for which there are no extant working drawings, have of necessity been digitized with reference to printed specimens. Ironically, better-documented designs such as Electra and Fairfield have suffered through not being digitized in this manner.\n\nWhich are the 20th century faces that have been digitized from printed specimens, with the attempt to create, in high-res offset output, a facsimile of letterpress typography?\n\n"
    },
    {
      "time": "13 Feb 2009 — 6:08pm",
      "content": "Nick, that is an excellent question.\n\nMy first answer would be the Fell Revival faces (Marini), but I don't think those are 20th century. ;)\n\n"
    },
    {
      "time": "13 Feb 2009 — 7:01pm",
      "content": "Probably Storm’s Walbaum.\n\n"
    },
    {
      "time": "17 Feb 2009 — 8:01am",
      "content": "\"Well, it was; and quite frankly the award baffles me.\"  \nLinotype's revivals were not intended to replace the metal fonts used in letterpress and they were done too early to be targeted at anything narrower then \"a 12 pt master for text and display\" expanded in styles and glyphs. Today, it sounds like a simple job for size masters and grades, but in the mean time, some people have made some use of these families quite nicely.\n\nCheers!\n\n"
    },
    {
      "time": "17 Feb 2009 — 8:26am",
      "content": "These \"revivals\" were not intended to replace metal, yet they are called \"Electra\" and \"Fairfield\", and Linotype's site claims the following:\n\n------------------------------------------  \nElectra® Bold belongs to the Electra® Font Family which is part of the Linotype Originals.  \nElectra is an original face designed for Linotype in 1935 by William. A. Dwiggins, the eminent American artist and illustrator who also created the Caledonia series. The type, which falls into the 'modern' family of type styles, is not based upon any traditional model and is not an attempt to revive or reconstruct any historic type. Because it avoids the extreme contrast of thick and thin elements that mark most modern faces, Electra provides a new 'texture' in book pages. Although in x-height it is amost large as Times Roman, the narrow set of Electra makes it very economical in composition. The italic is really a sloped roman, of almost the same weight as the roman; it is so comfortable to read that it can be used for whole texts, and is particularly suitable for poetry.  \nIn 1988 Linotype has extended the Electra to a complete type family with four different weights, it was made with true Italics and as a specialty was made available in a lighter end more elegant Display version.  \nThe Caravan fonts offer a broad variety of fitting ornaments and border elements which had been designed by Dwiggins.  \nElectra had received a Certificate for Typographic Excellence in Type Design in 1998 from the Type Directors Club ( TDC ) of New York.  \n ----------------------------------------\n\nSo what are these \"Linotype Originals\" intended to be? They certainly don't look like \"originals\", yet these \"revivals\" don't claim to be anything but originals.\n\nI'm not questioning Linotype's failure to mention that these fonts have little to do with what was intended with the metal forms (other than in name), which is questionable enough. I'm simply wondering why this version of Electra deserved an award when the type does nothing more than ape Electra, and poorly at that.\n\nI suspect the judges dropped the ball on this one and it's only become clear in retrospect.\n\n"
    },
    {
      "time": "17 Feb 2009 — 12:23pm",
      "content": "\"These “revivals” were not intended to replace metal, yet they are called “Electra” and “Fairfield”  \nPink Panther movies are sometimes cartooooons. or star Steve Martin instead! OS IX did not look at all like OS X, yet they are both called Macintosh, and Ford changed the damn Mustang again... let's sue 'em! sue 'em all.\n\n\"So what are these “Linotype Originals” intended to be?\"  \nI think they are intended to be a faithful representation of the drawings updated for ununitized composition in modern ('88) desktop computer layouts and styles, sharing the same names as their metal, film and pre-postcript digital predecessors. They are quite separate in delivery format... I mean, if you get the metal version in the mail, you don't confuse it with the digital version you download, even before you use 'em and find out they produce different images. That's a plus, right?\n\nAnd if you do have to make plates from the digital version you should be able to simply add a tiny little value to the stroke variable of all the outlines. And if you mean the \"Originals\" tag, I think Adobe started that and their licensees followed to distinguish their home made products from those, (in '88), made by others and distributed via licenses, trades and acquisitions.\n\n\"I suspect the judges dropped the ball on this one and it’s only become clear in retrospect.\"  \nThe 'in retrospect' is where we may differ. But sue the judges, the jury and the bailiff too!\n\nCheers!\n\n"
    },
    {
      "time": "24 Feb 2009 — 3:16pm",
      "content": "an aside: I was just now rooting through MyFonts and was surprised to see that Monotype Imaging is still selling the old Compugraphic face \"Elante,\" the CG version of Electra.\n\nthen I also see that Linotype sells Elante and attributes it to Dwiggins. But on the page for Electra they do not attribute it to Dwiggins.\n\nCurious. I'm surprised to see those old CG faces still sold after Mono & Lino hooked up.\n\npowers\n\n"
    }
  ]
}
