{
  "id": "54539",
  "title": "Typeface Suggestions for a Small Arts and Literature Publication",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm helping with the design of a small art and literature publication on campus, where students submit their work to be published to all students and faculty.\n\nOur editor has already chosen a theme, 'death and the passing of time', which the work we've received (photos, prints, paintings, etc.) is centered around. The body is all student work, no articles or ads; it is set in a theme each year based what we receive, which is 'death and the passing of time'.\n\nThe dilemma I'm having is choosing a typeface to incorporate that 'theme'. I know of typefaces for books, but I'm also having trouble selecting one.\n\nMy request may sound odd, but if you know of any typefaces that can incorporate that theme (e.g. carvings in headstones, memorials, plaques, or in the rustic/medieval/classical realm) or are great for books, I'd appreciate any suggestions.\n\nThank you.\n\n~ corey\n\n",
  "author": "glazerlicious",
  "time": "7 Feb 2009 — 8:20pm",
  "uid": "34967",
  "comments": [
    {
      "time": "9 Feb 2009 — 3:51pm",
      "content": "Maybe like a roman carved type font (all caps) which suggests marble. Then again if you have to set a whole book something like Mrs Eaves would serve you better since it would allow you a whole font family that has a slightly formal feel. The last thing you want is a casual feel for \"death\".\n\n"
    },
    {
      "time": "9 Feb 2009 — 4:20pm",
      "content": "Trump Mediaeval?\n\n"
    },
    {
      "time": "10 Feb 2009 — 12:19am",
      "content": "Requiem? \\*no Trajan please:P\n\nOr you can try Centaur(good for books) and Mantinia(for headlines)\n\n"
    },
    {
      "time": "10 Feb 2009 — 1:27am",
      "content": "I keep thinking of Dante.\n\nBut it would help to define the intended tone of your typography more deeply.  \nAre you trying to design something that \"accommodates\" death and presents it in a \"digestible\" way – much like you'd probably do if you were designing an identity for an undertaker –, or something that retains, and reflects, some of the primal, mortal fear?\n\n"
    }
  ]
}
