{
  "id": "54541",
  "title": "Type/font app for Apple iPhone",
  "forum": "Build",
  "tags": [

  ],
  "content": "Can someone build a Shazam-like, typeface-identification application for the iPhone?\n\nHere's how it would work: 1) you point the camera at the text in question; 2) you take a picture; 3) and then you let the app identify the typeface for you while you wait. (Maybe there's an intermediate step between 2 and 3 where you verify that you've taken the correct photo and that you didn't make it come out all blurry.)\n\nScenario 1:  \nYou're reading a beautiful old book and are wondering what type it's set in; you check the colophon and copyright pages--nothing doing. No problem, you take out your iPhone, open the type-identification app, snap a photo of the book, and wait a second. A second later, the app tells you the name of the type that the book was set in.\n\nScenario 2:  \nYou and your friends are arguing about the typeface that Wes Anderson always uses--the one that looks a bit like Futura but isn't Futura. Is it Avenir? No one can agree. Someone takes out her/his iPhone and . . . you get the idea.\n\n--Justin\n\n",
  "author": "<a href=\"/web/20101125152940/http://typophile.com/user/42134\" title=\"View user profile.\">ginnetti</a>",
  "time": "<br>",
  "uid": "42134",
  "comments": [
    {
      "time": "",
      "content": "Hello,\n\nWith regards to your problem, I think that main problem with the current iPhones (first and second model) is the camera—it's no good at macro unless you use something like [this](http://web.archive.org/web/20101125152940/http:/www.griffintechnology.com/products/clarifi).\n\nOther than that rather large obstacle, it shouldn't be too hard to develop a service to upload a photo from your iPhone library and generate a TinyURL-style address for you to enter into What The Font. It may already be possible to do this with a combination of available applications, but I haven't tried.\n\nSo until the iPhone camera/lens improves, scenario 1 is going to be hard.\n\nScenario 2:  \nIt is Futura (bold).\n\nIf/when the iPhone camera can do macro well, I look forward to something like this being developed (along with something like [ShopSavvy](http://web.archive.org/web/20101125152940/http:/www.biggu.com/) from the Android Market).\n\n"
    },
    {
      "time": "",
      "content": "Hello\n\nat least for the second part there is the free app from FontShop: [FontShuffle](http://web.archive.org/web/20101125152940/http:/itunes.apple.com/WebObjects/MZStore.woa/wa/viewSoftware?id=298268157&mt=8) (iTunes Link)\n\nGeorg\n\n"
    },
    {
      "time": "",
      "content": "Just you wait…\n\n"
    },
    {
      "time": "",
      "content": "That sounds interesting Nick.  \nDoes what you're working on work _despite_ the iPhone's lack of macro?\n\nEither way, I really hope the next model iPhone has major improvements to the camera (and more RAM).\n\n"
    },
    {
      "time": "",
      "content": "I now see that MyFonts has released a WhatTheFont iPhone application (I won't post the link) and I suspect that the original poster Justin, who only joined to post this \"request\", is part of a not-so-subtle marketing attempt. Justin, Nick Sherman and MyFonts are all based in (or near) Boston, Nick is a MyFonts employee.\n\nIf I'm wrong, sorry—it's just a coincidence that the comment was made after the application was submitted to Apple—but if I'm right, Justin and Nick should be ashamed. Couldn't you have simply made a post announcing the availability of the free application, or is that against the rules of the forum? MyFonts is a Typophile sponsor, so surely this could have been arranged.\n\nFor what it's worth, I think the application icon is awful.  \nBoth the FontShop's FontShuffle application and this MyFonts one have terrible icons considering they are by and for designers and typographers.\n\nOnce again, if I am wrong, I am sorry for being so suspicious; maybe my tin foil hat is on too tightly.\n\nAndrew\n\n"
    },
    {
      "time": "",
      "content": "Believe it or not, I've never met Justin (I'm assuming that's ginnetti's real name?) before, and his inquiry was a total coincidence.\n\nI actually did submit a formal announcement for the official Typophile [news board](http://web.archive.org/web/20101125152940/http:/typophile.com/news) but it has yet to be approved/posted. I've been anxiously biting my tongue in hopes of receiving most of the feedback on that thread if/when it goes up, but couldn't help posting the \"just you wait\" comment.\n\nIronically, because of the decentralized quality of the MyFonts \"office\", our close proximity doesn't imply a co-conspirator relationship as much as you might think; the main person that I worked with on the iPhone app is Chris Lewis, and he lives in Japan :)\n\n"
    },
    {
      "time": "",
      "content": "... This damn tin foil hat!\n\nI'm actually glad that my powers of deduction have failed me in this case.\n\nI think this application will be much more useful when the iPhone camera is up to the task; so far I haven't had much luck with small text and certainly nothing as small as Justin's \"scenario 1\" book text. I imagine the Griffin Clarifi I linked to in my first post would make a big difference, but that's far from ideal.  \nI'd like to read your thoughts on the current iPhone camera in relation to the intended purpose of WhatTheFont.\n\nI still think the icon is awful, is there any chance it could be made a bit more iPhone-y? I think it's the off-centre magnifying glass that bothers me most. I think the icon metaphor should be about finding a match rather than the search itself (magnifying glass).\n\nMaybe my problem with the magnifying glass is just further evidence that I am no Sherlock Holmes.\n\nSorry.\n\n"
    },
    {
      "time": "",
      "content": "An Accident,\n\nindeed, I believe this is purely co-acccidental. ;) This type of guerilla marketing is not our style at MyFonts :)\n\nHere's some information about the iPhone WhatTheFont application:  \n [http://blog.myfonts.com/archives/177](http://web.archive.org/web/20101125152940/http:/blog.myfonts.com/archives/177 \"http://blog.myfonts.com/archives/177\")\n\nA.\n\n"
    },
    {
      "time": "",
      "content": "I believe the correct term would be \" [astroturfing](http://web.archive.org/web/20101125152940/http:/en.wikipedia.org/wiki/Astroturfing)\" :)\n\n"
    },
    {
      "time": "",
      "content": "Nick,\n\nI was going to say that, but I thought I'd already made enough enemies for one day.\n\n"
    },
    {
      "time": "",
      "content": "Nick, apologies about your news not getting approved. Next time must drop me or any of the other moderators a note and we'll see to it promptly.\n\n"
    },
    {
      "time": "",
      "content": "Not a problem, TIff. Thanks for approving it (and just moderating this forum in general).\n\nI didn't realize until now that items on the official news board didn't allow comments. Knowing that, I suppose this thread would be just as good as any to solicit any feedback anyone might have about the app. Comments appreciated!\n\n"
    },
    {
      "time": "",
      "content": "Hmm. I think the results are less than stellar...\n\n ![](http://web.archive.org/web/20101125152940im_/http:/typophile.com/files/IMG_0001_3646.PNG)\n\n"
    },
    {
      "time": "",
      "content": "Yeah, unfortunately, because of the limitations of the iPhone camera, close-up shots for smaller text don't work as well as we'd like. The blurriness doesn't sit well with the shape recognition process.\n\n"
    },
    {
      "time": "",
      "content": "Good app but indeed Apple should update the camera! For larger samples like headers in newspapers and few type specimens it worked beautifully.\n\nWhat I miss is a kind of the app's internal library where all my cropped photo identifications would be archived together with approved corresponding fonts for later use.\n\nMaybe it's already implemented but I wonder if that such a user input could be used to improve the identification mechanism (computer finds few similar samples but users 'approve' one or two closest matches thus limiting potential errors)?\n\n\\_\\_\\_\\_\\_\\_\\_\\_  \n [AL](http://web.archive.org/web/20101125152940/http:/www.lenart.pl/) [▪](http://web.archive.org/web/20101125152940/http:/www.lenart.pl/news) [▪](http://web.archive.org/web/20101125152940/http:/www.lenart.pl/work) [▪](http://web.archive.org/web/20101125152940/http:/www.lenart.pl/about) [▪](http://web.archive.org/web/20101125152940/http:/www.lenart.pl/contact)\n\n"
    },
    {
      "time": "",
      "content": "i still wish i had an iphone and could try this out...\n\n"
    },
    {
      "time": "",
      "content": "I'm loving it.\n\nMy only criticism specific to the app is that I have had trouble using the touch-screen interface to combine broken-up glyphs. I have managed it twice, in my varied fumbling attempts, but I'm not sure how, and I can't yet do it at will. Where exactly am I meant to touch on the screen? And where am I meant to move my fingers to?\n\nSecond comment is probably one applicable to What The Font generally - is the database restricted to MyFonts-licensed typefaces?\n\n"
    },
    {
      "time": "",
      "content": "Yeah, the glyph combination isn't quite as fluid as we'd like. Hopefully we can improve that in a future update. In the mean time, it helps if you perform the glyph-combining pinch action with a bit of extra force. Chris Lewis describes it as though you're \"poking someone's eyes out\" :)\n\nAs for the fonts the app is able to recognize... they don't have to be fonts that we have permission to _license_ necessarily, but they do have to be fonts that we have permission to have in our database. For example we've gotten permission from [FontFont](http://web.archive.org/web/20101125152940/http:/www.fontfont.com/) to use their fonts for matching images submitted to WhatTheFont…but we don't have permission to sell licenses to end-users on their behalf.\n\nNow, if the font someone is trying to identify with WhatTheFont is something we don't have in our database _at all_, we can only suggest close matches. A perfect example: WhatTheFont gets tons of submissions of images of Obama posters that are set in Hoefler & Frere-Jones' [Gotham](http://web.archive.org/web/20101125152940/http:/www.typography.com/fonts/font_overview.php?productLineID=100008); but because we don't have permission to have any H&FJ fonts in our database — for sale or otherwise — we're unable to provide a perfect match.\n\nWith that said, MyFonts represents the world's largest collection of fonts (that I know of), so the matches for most images (of reasonable quality) submitted through WhatTheFont are pretty good, if not dead on. In that regard, a comparison between MyFonts and Amazon could be made: you might not find everything in the world, and some of what you do find might not be for sale, but it's a good place to start.\n\n"
    }
  ]
}
