{
  "id": "54545",
  "title": "For a better Animal Planet...",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm a noob.  \nBtw.\n\nIn school, I was assigned to pick a logo that we didn't like. (I choose Animal Planet becuase they recently changed the entire identity of Animal Planet, and the new logo is horrid.) I've been working on this for weeks, but I still don't feel completely satisfied with it. I almost feel like there is something missing... Any suggestions would be grand.  \nIll post all three logo so you can see the evolution..hah\n\nP.s, my illustrator skills are limited so there are lines around my birds... they are not gonna be there when I tweak it.\n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/finalmaybe_5228.jpg)\n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/animal-planet-logo_3535.jpg)\n\n",
  "author": "Wording",
  "time": "8 Feb 2009 — 6:38am",
  "uid": "40276",
  "comments": [
    {
      "time": "8 Feb 2009 — 8:11am",
      "content": "I think their new logo is cool - it reflects wilderness. But they shouldn't have simply squooshed the letters like that - the \"N\" especially looks like a starving elk or something.\n\nhhp\n\n"
    },
    {
      "time": "8 Feb 2009 — 8:56am",
      "content": "It's a good choice. I think it's a horrid identity. Other than the squooshed N and A, I don't understand what the lone rotated M is trying to communicate. I can see their attempt for wildness, but the execution is poor.\n\nAs for the project improvement, it's not executed very well either. The lines are not smooth and appear jagged, especially on the elephant's trunk. You should read up on bezier curves and optimal node placements, to get the understanding of how bezier curves (with Illustrator's pen tool) work. Also, try adding a secondary colour to add some dimensionality.\n\nWhat typeface are you going to use for the Animal Planet logotype?\n\n"
    },
    {
      "time": "8 Feb 2009 — 10:03am",
      "content": "As I've said my Illustrator skill are VERY limited. I have to do some tweaking with the pen tool, I was having some trouble with it...  \nI haven't really decided to do the logotype. At this point I think I'm going to stick with a logo, and make a separate wordmark later.\n\nFunny thing about the new logo and new design for animal planet, is that in the press release, the stated that they wanted to reach a more \"Adult Audience.\"  \n...They have a bunch of new shows like the Puppy Bowl. It is frightening.  \nSo the idea I had here was to add the three elements...Air Land and Sea, surround them with a globe shaped object, and make them part of the \"world.\" My logo doesn't have quite so much \"personality\" as the new logo... Maybe i can try to demonstrate this with color..\n\nYou mentioned my horrible illustrator skills, but what about the design? Color? Any ideas are greatly appreciated.\n\n"
    },
    {
      "time": "8 Feb 2009 — 7:35pm",
      "content": "Try making the animals look more like land-masses. Then maybe fill in the gaps with blue to make it look more like a planet. This way everything's a bit subtler.\n\npenn\n\n"
    },
    {
      "time": "8 Feb 2009 — 9:11pm",
      "content": "\\> Try making the animals look more like land-masses.\n\nBrilliant!\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2009 — 5:13am",
      "content": "have any suggestions on HOW to do that? haha I need an example..\n\n"
    },
    {
      "time": "9 Feb 2009 — 6:47am",
      "content": "Make the shapes more imperfect. Right now you have the same bird shape replicated three times. Make them look more like an island chain. Have smaller islands as offshoots. Try sketching it out on paper first to get the general feel of creating land-masses that look like animals, rather than animals that look like land-masses.\n\npenn\n\n"
    },
    {
      "time": "9 Feb 2009 — 10:07am",
      "content": "It might be a good inspiration to look at some of those old pictorial maps; there are also some modern examples (just don't copy these):\n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/humorous_diplomatic_atlas_6387.jpg)\n  \n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/animalisland_crab_4778.jpg)\n  \n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/animalisland_fox_6241.jpg)\n\nThe first image is \"A Humorous Diplomatic Atlas of Europe and Asia\" (detail) by Kisaburo Ohara, 1904. The two \"Imaginary Animal Maps\" were designed by Mitsuharu Yamaoka, Japanese Geographical Survey Institute, 1999.\n\nI recommend Katharine Harmon's beautiful book \"You Are Here: Personal Geographies and Other Maps of the Imagination\" (from which the above pictures were quickly snapped), as well as the [Strange Maps](http://web.archive.org/web/20130629050302/http:/strangemaps.wordpress.com/) blog.\n\n"
    },
    {
      "time": "9 Feb 2009 — 12:45pm",
      "content": "this is a really good idea...I'm gonna work on it and post the updates later, if anyone else has suggestions throw them out there. you are all my new friends. :D lol\n\n"
    },
    {
      "time": "9 Feb 2009 — 1:26pm",
      "content": "If you'd like a simpler idea - how about the elephant head entering the circle of the globe/world?\n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/idea_3575.png)\n\n"
    },
    {
      "time": "9 Feb 2009 — 2:11pm",
      "content": "But you don't want just one animal on there, otherwise it would be seen as the Elephant Channel or something. Sure you can't have Noah's ark, but just two animals would be much better than one; and two animals at some sort of polar opposites. So I'd suggest one very large, one very small. So an elephant... and something famous for being small.\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2009 — 2:55pm",
      "content": "Not a mouse though unless it's for a Comedy Channel :)\n\n"
    },
    {
      "time": "9 Feb 2009 — 4:44pm",
      "content": "hahahah thats clever!\n\n"
    },
    {
      "time": "10 Feb 2009 — 3:32am",
      "content": "Have you looked at the new identity for Airplot, designed by Airside? It's not dissimilar to the Animal Planet identity, but a bit more sophisticated in its execution. You can read more about the processes involved [here](http://web.archive.org/web/20130629050302/http:/www.airside.co.uk/blog/?p=129)\n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/Airplot_5514.gif)\n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/Airplot_Type_6391.gif)\n\n"
    },
    {
      "time": "10 Feb 2009 — 2:24pm",
      "content": "The Airplot thing DOES ROCK\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20130629050302/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20130629050302/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": "11 Feb 2009 — 12:59am",
      "content": " ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/newkids_4427.JPG)\n\n"
    },
    {
      "time": "11 Feb 2009 — 9:29am",
      "content": "I think if the Animal Planet logo wasn't so clean, it would have been a better look. The Airplot design looks a hell of alot better simply because it looks hand drawn, and real.\n\nStill working on some updates, I should be in school now, but I'm behind. Sadly I have to turn in some unfinished work, but I think my rational will save my ass.  \nI will be returning to this project though, as soon as I can get my feet back on the ground.  \nThe land mass idea is a go, I'm working on sketches now. I epically like the idea of the birds being a string of islands... :D\n\n"
    },
    {
      "time": "12 Feb 2009 — 11:25am",
      "content": "@ Bemerx - I like your idea. Keep it simple. Anyway, the original only had one animal (the elephant), right?\n\n@ Matthew - Sweet post. Wood type is where it's at. Those condensed fonts just look more appealing than the computerized squished letter look.\n\n"
    },
    {
      "time": "12 Feb 2009 — 11:36am",
      "content": "Yeah - I thought the elephant silhouette was pretty identifiable. Putting it in the \"globe\" would echo the past logo while updating it. I mean the shapes from my approach are simply \"Animal + Planet\". Obviously there can be other ways to resolve the design problem at hand - we'll let Wording come up with something they can call their own.\n\n"
    },
    {
      "time": "12 Feb 2009 — 11:43am",
      "content": "While wood type is great, read the makings of the logo...It's not actually wood type.\n\n"
    },
    {
      "time": "3 May 2009 — 8:19am",
      "content": "Hello! Updated the logo since I am finished the semester :D I still want to go further with it, but ..I think this is a great improvement. I've even been workign on my illustrator skills.  \nCheck it out!\n\n ![](http://web.archive.org/web/20130629050302im_/http:/typophile.com/files/large_Logo%20Updated_4317.jpg)\n\n"
    },
    {
      "time": "3 May 2009 — 4:29pm",
      "content": "ok ... playing a sort of devil's advocate ... why do you feel this is a great improvement?\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20130629050302/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "3 May 2009 — 5:39pm",
      "content": "Ratbaggy,  \nYes, that's a really great question. I'm looking forward to the OP's answer. I'd also like to hear what the class critique was like, and what grade the professor bestowed on this revised logo. Subjectivity can be fascinating and humbling.  \nAK\n\n"
    },
    {
      "time": "6 May 2009 — 12:39pm",
      "content": "Ouch..well then\n\nWell maybe not GREAT.  \nBut it is an improvement. (I have a word mark now. Also added another color, tried to smooth out lines...gained some exp from illustrator \\*thumbs up\\*...the horn looking object about the elephant needs a fix up though, the opacity is still too high on that. but anyway.........)  \nI have not gotten a mark...strangely...for assignments anyway. I get a \"that's very good\" or \"good for you\" \"good work\" ...I received a 90 in the course though, so I guess I did well.  \nCritique didn't happen either!\n\n"
    },
    {
      "time": "6 May 2009 — 12:57pm",
      "content": "\"Critique didn’t happen either!\"\n\nMight be time to rethink spending money on getting an art/design degree at this particular school.\n\n"
    },
    {
      "time": "8 May 2009 — 8:18am",
      "content": "Well, I'm doing production/design.  \nWe have done critiques in other classes, ie. typography. But this class was scattered and very unorganized!  \nWhich was the reason I threw the logo onto a post. I need constructive criticism and maybe some other ideas and options. Inspiration. um..all kinds of things. But because I am doing a Production course, we only do the design part so that we understand it and we have knowledge about it.  \nBut I really enjoy design. And I want to be better.  \nSo...lol Something constructive anyone??\n\n"
    },
    {
      "time": "8 May 2009 — 10:11am",
      "content": "Here goes...\n\nYour lines are too sharp, they don't look like land masses. The birds are obviously copied and flipped, need some variation. The huge open space between the trunk(?) and the seal(?) is too obvious. The gradients are too subtle to make an impact, either tweak them or lose them altogether. The green stroke around the whole planet takes away from that \"planet\" look and meeting a the 2 points on the left looks weird. The green and blue you've chosen are too similar values, needs more contrast. The text and graphic aren't centered with each other. The font looks like some woodland-fairytale serif. I think the programming on Animal Planet is a lot more varied than that.\n\n"
    },
    {
      "time": "8 May 2009 — 10:18am",
      "content": "Well, for some constructive advice...\n\nThe value of the green and blue is almost identical. When that happens, it becomes difficult to discern the forms. I'd consider trying a much lighter blue.\n\nSome of the details in the mark seem a bit too subtle and maybe a bit random. The highlight seems to neither indicate the mark is 3-D nor does it seem to refer to anything specific. Perhaps that is superfluous.\n\nThe lower left of the globe outline, where its pinched, seems random as well (maybe it's not, but that's my gut reaction).\n\nThe type is OK, but you really need to keep in mind where this logo will be used most of the time: in the lower right of the TV channel on a TV.\n\nAs such, I find the details of the typeface and the gradient are going to be totally lost in that particular medium.\n\nFinally, look at the relationship between the size of the letterforms and the mark. Seems that the type could much larger.\n\nWhile I think there's definitely a lot that can be improved with the Planet Green logo, I think that's something to look at. Note how it's a very simple form and works quite well on TV.\n\nI do really like the concept of the 'earth, air, water' thing. I'd maybe think about that conceptually a bit more as well and see if you can build some other illustrations off of that idea.\n\nHTH!\n\n"
    },
    {
      "time": "8 May 2009 — 7:17pm",
      "content": "Excatly! Well done! :) Thank you. And I will work on all of these things. \\*HighFive\\*\n\n"
    }
  ]
}
