{
  "id": "5455",
  "title": "Music venue identity",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hey. i posted this in another forum on typophile, and it was recommended i post here, so here.   \nthis is an identity for a music venue called the Eaves that it is an attic like space with slanted ceilings. it will be mostly for experimental/independent music... the main colors will be brown and blue, although exact choices are undecided. The type will be displayed on posters, handbills, a backlit sign and maybe a wood cut sign.   \non the advice of my last posting, i had made the v more pointed on the bottom, and moved the THE around a bit. (thanks sally).   \noh and before i forget to say - the main type is LHF becker monogram english, although its pretty modified at this point - especially the E. the THE is charlemagne.   \n ![](http://web.archive.org/web/20131108092712im_/http:/www.typophile.com/forums/messages/29/39788.gif)\n\n",
  "author": "bwhitla",
  "time": "2 Jul 2004 — 5:35am",
  "uid": "2820",
  "comments": [
    {
      "time": "2 Jul 2004 — 7:12am",
      "content": "To improve legibility you have to separate 'a' and 'v'. I like the first arrangement better than the second.   \n   \n--   \nS\n\n"
    },
    {
      "time": "2 Jul 2004 — 9:16am",
      "content": "Yes. Perhaps you can keep the lig at the base of the a-v, but I agree with Soren that there needs to be some space between them. I would create it by moving them apart just a little, then disconnecting the them at the top.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "2 Jul 2004 — 9:18am",
      "content": "Hmmm\n\n"
    },
    {
      "time": "2 Jul 2004 — 9:24am",
      "content": "i hate to tell you \"i told ya so\" Ben! ;) (lol)   \n   \n( [http://www.typophile.com/forums/messages/29/39360.html?1088525008](http://web.archive.org/web/20131108092712/http:/www.typophile.com/forums/messages/29/39360.html?1088525008))   \n   \nWhat do you think about the placement of \"the\"?\n\n"
    },
    {
      "time": "2 Jul 2004 — 9:26am",
      "content": "I have \"0\" knowledge of this style of typography however I do sense the word \"the\" needs to be is a different font. Possible san serif? Right now \"the\" just seems way to French.\n\n"
    },
    {
      "time": "2 Jul 2004 — 9:28am",
      "content": "Or possible in the same gothic style as Eaves.\n\n"
    },
    {
      "time": "3 Jul 2004 — 7:19am",
      "content": "thanks for all the feedback. here are the changes made:   \n   \non the v, after making it more pointed on the bottom, the line above that wasn't quite right.. i reckon it needed to be more like a calligraphic brush stroke - so the line width wouldn't vary in a space like that. uuh.. that may or not make sense, but trust me, the line widths are more regular on the v. so thats the changes on the top one.   \n   \nfor the bottom one i changes the a-v realtionship. i dunno how i feel about. im not sure i executed it correctly.. thoughts? ![](http://web.archive.org/web/20131108092712im_/http:/www.typophile.com/forums/messages/29/39896.gif)\n\n"
    },
    {
      "time": "3 Jul 2004 — 8:54am",
      "content": "I like the changes to the bottom one more. All of the letters only connect with eachother in one area and to me the v's looses a bit of legibility when attached to the a in two spots so I would keep going with that one.   \n   \nJust looking back at the other post that Sally linked up. I liked the placement of the \"the\" when it was above the a and the v. It to me just seemed more of a part of the logo that way. Except I would make it a little bit smaller then what you had it at in the last post and bring it closer to the eaves type.\n\n"
    },
    {
      "time": "7 Jul 2004 — 12:05pm",
      "content": "I may be the only one...but   \n   \nCould you give the top of the UC E a hard angle, and refine the loop? It seems the other letters do well going from hard edge to curly, whereas the UC cant make up its mind at time whether to be hard or loopy.   \n   \nThe \"aves\" is kickass though.   \n   \nAndrew\n\n"
    },
    {
      "time": "7 Jul 2004 — 12:13pm",
      "content": "something about the v still does not seem quite right . . . maybe the upper left serif type thing (sorry, i don't know fontography lingo!) could imitate the curve of the \"a\" -- does that make sense? Having it the way it is still creates an akward space between the a and the v, although opening it that bit did help.   \n   \nTHE still seems to be floating, it doesn't seem like it is part of the logo.\n\n"
    },
    {
      "time": "7 Jul 2004 — 3:00pm",
      "content": "Maybe a direction to try that would create a hard edge above the \"E\", like Andrew suggested, and a solution for \"THE\", addressing Sally's concern, could look something like this (with much refinement\n\n"
    },
    {
      "time": "8 Jul 2004 — 6:08am",
      "content": "![](http://web.archive.org/web/20131108092712im_/http:/www.typophile.com/forums/messages/29/40172.gif)\n\n"
    },
    {
      "time": "13 Jul 2004 — 10:52pm",
      "content": "I really like the last suggestion andrew just made because it solidifies the roofline into the design which will help capture the whole idea - perhaps on the side that is falling away you can use a similar geometry to show a longer falling away starting with the curly of the v that might also help attack some of the v issues people have noted. (boy is that ever clear as mud)\n\n"
    }
  ]
}
