{
  "id": "54562",
  "title": "Looking for a high-quality free serif font for essays and reports",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've chosen Gotham as my primary san-serif font.\n\nNow I need a serif font that I'll use primarily for school write-ups and essays and things of that nature.\n\nI've considered Bitstream Vera Serif and Justus, but I'm open to suggestions.\n\nI'm looking for legibility and appropriateness for academic writing.\n\nAny help is appreciated!\n\n",
  "author": "Johnny V",
  "time": "8 Feb 2009 — 1:14pm",
  "uid": "42147",
  "comments": [
    {
      "time": "8 Feb 2009 — 1:38pm",
      "content": "Sorry for the slighty off-topic question. But Gotham is hardly cheap - why pay for Gotham and look for a free serif font?\n\nCheers, Si\n\n"
    },
    {
      "time": "8 Feb 2009 — 2:06pm",
      "content": "I've chosen a Bentley as my main car.\n\nNow I need a high quality, free truck in addition.\n\n[Gentium](http://web.archive.org/web/20131023195830/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium), [Lido](http://web.archive.org/web/20131023195830/http:/www.stormtype.com/typefaces-fonts-shop/families-27-lido-stf),  \n [Cardo](http://web.archive.org/web/20131023195830/http:/scholarsfonts.net/cardofnt.html), and  \nJos Buivenga has some amazing fonts [here](http://web.archive.org/web/20131023195830/http:/www.josbuivenga.demon.nl/index.html).\n\n"
    },
    {
      "time": "8 Feb 2009 — 2:39pm",
      "content": "Yes Johnny, it makes no sense to pay handsomely for a sans  \nthen skimp on the text. If anything, a good text font is worth  \n_more_ than a good display font. Also, you should ideally choose  \nyour text font first.\n\nhhp\n\n"
    },
    {
      "time": "8 Feb 2009 — 3:54pm",
      "content": "Why wouldn't you just use LaTeX for all of that? It's entirely free in both senses and has loads of similarly free awesome fonts.\n\nLook at Linux Libertine.\n\n"
    },
    {
      "time": "8 Feb 2009 — 4:31pm",
      "content": "It's hard to beat speter's suggestions when it comes to free text type. Jos Buivenga's fonts are beautiful, and I'm really looking forward to [Calluna](http://web.archive.org/web/20131023195830/http:/exljbris.wordpress.com/2008/05/14/calluna-calluna-sans/).\n\nAnother typeface I absolutely love is [Elpis](http://web.archive.org/web/20131023195830/http:/www.raissaki.gr/pages/work.html), available through the [Greek Font Society](http://web.archive.org/web/20131023195830/http:/www.greekfontsociety.gr/pages/en_typefaces20th.html). I think Elpis is a beautiful typeface, and I love it especially because it includes Greek characters (something I wish was more standard).\n\nThe Droid family of fonts, used in Google's Android, is also pretty nice (it's available in different places, if you google for it).\n\n"
    },
    {
      "time": "8 Feb 2009 — 4:37pm",
      "content": "LOL you guys are hilarious.\n\nI bought Gotham because I wanted to use it extensively for some posters last year (which I did and I don't regret the purchase).\n\nI might use something like Cambria as my main serif since I have it... I'd like to avoid spending a lot of money since I've already spent quite a lot on fonts.\n\nAnd thanks I will check out LaTeX, I've been meaning to look into that, its been recommended to me in the past.\n\nCheers.\n\n"
    },
    {
      "time": "8 Feb 2009 — 4:39pm",
      "content": "And thanks for the recommendations I'll check them all out.\n\n"
    },
    {
      "time": "8 Feb 2009 — 4:54pm",
      "content": "My personal experience is that if you use anything other than Times New Roman or Palatino, university professors will give you a lower mark and make comments about your style choices. They are suspicious that the different aesthetic of other fonts is the student trying to cover up a lack of quality research. And since they none of them actually have enough time to read your paper from beginning to end, they have _no choice_ but to assume that there is something wrong with your paper. I'm dead serious about this.\n\nIf you _really_ want an alternative font that your professors won't get suspicious about, try using Monotype Baskerville. That's about as far as you should go.\n\n"
    },
    {
      "time": "8 Feb 2009 — 5:11pm",
      "content": "So next time your font fund is sufficiently replenished hopefully you'll go for a good text face. Just because most people don't go goo-goo-ga-ga over something doesn't mean it's pointless.\n\nhhp\n\n"
    },
    {
      "time": "8 Feb 2009 — 5:43pm",
      "content": "I should probably clarify what I meant in my last post. What I meant is that if you try using a font that professors actually notice, then you risk losing marks. I have been told this by more than one professor. For example, when I've used my Marquet font then nobody notices, so its okay. But if I use my Garamont, then teachers get suspicious because its too \"fancy\" looking (long extenders are a no-no for profs).\n\nThat being said, if you're looking for text face for non-academic use, then you are free to choose—and here you will want to get the best quality you can afford.\n\n"
    },
    {
      "time": "8 Feb 2009 — 5:50pm",
      "content": "John-Paul, I'm wondering whether telling a prof that you've  \ndesigned the font yourself makes things better or worse.\n\nhhp\n\n"
    },
    {
      "time": "8 Feb 2009 — 5:57pm",
      "content": "Cambria might be a good one to experiment with - as the default in Mac Office you have a baked-in excuse. Plus it has the math characters if you ever need them.\n\n"
    },
    {
      "time": "8 Feb 2009 — 6:01pm",
      "content": "Why do you assume I got these comments after I told them it was my font? I'm talking about (a) getting written comments on papers from profs who don't know this, and (b) differences on the marks of papers of similar quality with different fonts. Anyway, I don't mean to derail the conversation, here. I was just trying to give some advice based on my experience. I've also received similar comments when using one of the new cleartype fonts; I think it was Constantia. When a prof says \"use 12pt Times or equivalent\" they mean use a standard windows text font. This might well be different in a design program, or at other universities.\n\nI should also mention that one professor thought it was really cool that I was using a font of my own making. In this case there was no effect on the mark.\n\n"
    },
    {
      "time": "8 Feb 2009 — 6:05pm",
      "content": "Actually I assumed you generally don't tell them first. But I'm wondering if you tried the tactic of telling them in an attempt to damped their prejudice, and whether it worked, or backfired! I guess at least in one case the results were pleasant.\n\nhhp\n\n"
    },
    {
      "time": "8 Feb 2009 — 6:11pm",
      "content": "OIC. It depends entirely on the prof. Most profs don't even notice a change in font. But if they do, the result is usually negative whether or not its mine and they know it. That's what pleases me of using Marquet. I get the pleasure of asserting my personality on the work but I don't get dinged for it!\n\nWhen it comes to \"appropriateness\" for academic papers, though—as was originally asked—TNR can't be beat. It's what professors expect to see. Plus it's got every glyph you'll ever need,looks decent on screen, and prints well on any crappy 600 dpi printer.\n\n"
    },
    {
      "time": "8 Feb 2009 — 6:34pm",
      "content": "I appreciate the forewarning nepenthe.\n\nI guess I will use Cambria until I can afford a better alternative (maybe Mercury?) and use TNR when that is what's asked for.\n\n"
    },
    {
      "time": "8 Feb 2009 — 7:33pm",
      "content": "You might also consider [Skolar](http://web.archive.org/web/20131023195830/http:/www.type-together.com/ampl_font.php?idpuente=21), which was design specifically to suit the demands of scholarly publishing. Looks like it was just released in the last few days. I'd like to get it myself when I can afford it!\n\n"
    },
    {
      "time": "8 Feb 2009 — 9:25pm",
      "content": "Pretty interesting trapping there in Skolar!\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2009 — 8:16pm",
      "content": "@Nepenthe: Funny, my experiences as a student were different. I never got the idea anybody minded my use of different typefaces. Mostly they didn't notice, but for instance when I started using PMN Caecilia for my papers in my MBA program, that's pretty visibly not Times or Arial, and I'm pretty sure nobody marked me down for it.\n\nThen again, I didn't get the perfect GPA I had in my previous Master's program... maybe I should blame my typeface selection. :)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "9 Feb 2009 — 8:49pm",
      "content": "I just reread my original posts and realized that I forgot one crucial aspect of the whole thing that probably makes me seem like a complete blockhead: if there are typographic requirements (such as typeface) specified for the assignment, it turns out it's counts as part of following the assignment and can affect your mark. But if the prof doesn't specifically ask for a font, or doesn't notice you used a different one, then it might not matter. I just assumed that everyone had these requirements specified on their papers, but apparently not!\n\n"
    },
    {
      "time": "9 Feb 2009 — 9:14pm",
      "content": "Oh, well, that's different. If a prof requires a particular typeface, one defies that at one's own risk. (Of course, if the prof requires a 2000-word paper to be submitted in Arial, I might have a talk with them....)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "10 Feb 2009 — 12:44am",
      "content": "Urgh..this reminds me of the TNR rule when I was at school. I happily substituted Lido instead. \\*grin\\* I doubt they were any the wiser.\n\n"
    },
    {
      "time": "11 Feb 2009 — 3:05am",
      "content": "If I were you, I might think about using Hoefler Text, if possible.\n\nWhat JP says about profs and typefaces completely rings a bell with me. When I was in graduate school a million years ago, I remember going up to the department one day to pick up my mail and overhearing a wistful [Brooks](http://web.archive.org/web/20131023195830/http:/en.wikipedia.org/wiki/Peter_Brooks) sigh: \"Oh, I absolutely _love_ Palatino.\" That got around like wildfire, and almost overnight no one was turning in anything anywhere that wasn't set in Palatino. I actually like Palatino now. I didn't like it then.\n\n"
    },
    {
      "time": "11 Feb 2009 — 4:21am",
      "content": "Being the rebel that I was, anytime anything required TNR, I set it in Times. I'm not a fan at all of the sharp angled accents of TNR.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "11 Feb 2009 — 3:10pm",
      "content": "(Addendum to above: I guess I should mention that because of an affiliation that Apple had with the school at the time, we were all on Macs and were using the ttf version of Palatino that came bundled with the OS.)\n\n"
    },
    {
      "time": "12 Feb 2009 — 4:28am",
      "content": "Gentium. It has been called \"lotion for the eyes.\"\n\ngulfa:\n\nWould you mind noting some of the differences between Times and Times New Roman? Which is preferable in your opinion and why? Thank you.\n\n"
    },
    {
      "time": "12 Feb 2009 — 10:28am",
      "content": "I had a nice discussion with an English prof during my freshman year. I helped her with type requirements for text & display sizes, and disabused her of the standard \"double space after each period\" beliefs.\n\n"
    },
    {
      "time": "14 Feb 2009 — 9:48am",
      "content": "@Palatine:\n\nHere are a few of the many differences between the two cuts. One of the biggest is that the \"F\" is substantially narrower in TNR. TNR has sharper serifs in general. TNR has vertical serifs on the S, TR's are angled. TNR has a K in which the arm and the leg join the stem in a V, while TR's K leg sprouts off the arm. Ascender serifs are at a flatter angle in TR, and cut off vertically instead of at an angle as they are in TNR. The \"t\" has a bunch of features cut off at right angles in TNR, which are angled in TR.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "14 Feb 2009 — 10:02am",
      "content": "Thomas, useful! Thank you.  \nAny notable differences in the italics or bolds?\n\nhhp\n\n"
    },
    {
      "time": "14 Feb 2009 — 2:43pm",
      "content": "I only ever did a careful comparison of some glyphs of the roman (upright, regular weight) face. In the context of the forged document I was looking at, that was the overwhelming majority of the text, maybe all (I'd have to go back and look).\n\nI wouldn't be surprised if there were even bigger differences between the two cuts in the italics or bolds....\n\nT\n\n"
    }
  ]
}
