{
  "id": "54563",
  "title": "FONTLAB Problem!",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi fellows!  \nDoes anybody knows why fontlab crashes unexpectedly?  \nI don´t know why, but when I'm drawing something it creates strange shapes with points that I didn´t drew.  \nA very strange thing. I already uninstall and install again the program. It worked fine until this weekend...  \nPlease help me! I really appreciate it!\n\n",
  "author": "J VILAS BOAS",
  "time": "8 Feb 2009 — 2:17pm",
  "uid": "24562",
  "comments": [
    {
      "time": "8 Feb 2009 — 2:17pm",
      "content": "\\>Jota itsa J85\\<\n\n"
    },
    {
      "time": "8 Feb 2009 — 2:33pm",
      "content": "You must be new here ;)\n\nFontlab is very buggy. And it’s not a universal binary, so when Rosetta hiccups Fontlab crashes.\n\nSet your auto-save to every minute. Fontlab autosaves to files in the preferences directory and not to your working files, so don’t worry about it saving and crashing and simultaneously.\n\n"
    },
    {
      "time": "8 Feb 2009 — 2:35pm",
      "content": "I've had some funky lines and nodes suddenly appear out of nowhere too, especially when using the Undo command and then touching the curves again.\n\n ![](http://web.archive.org/web/20130330095911im_/http:/typophile.com/files/weird-error_5781.gif)\n  \nMine didn't crash though, and the above was undoable, FWIW. \n"
    },
    {
      "time": "8 Feb 2009 — 2:47pm",
      "content": "I get those weird shapes all the time, but undo usually fixes things. What really drives me crazy is the tendency of Fontlab to mash overlapping fonts together during a copy/paste, because that forces me to do multiple copy/paste or use components, and that can really slow things down.\n\n"
    },
    {
      "time": "8 Feb 2009 — 3:06pm",
      "content": "Hi James Puckett and altaira!  \nThanks for the replies! :D\n\nYes, Im new in fontlab! I LOVE typography!  \nWat happens to altaira is the same what happens with me.  \nThe big problem is that I cant work more than 10 seconds. I cant do anything.... Stranges lines appears and undo turns things slower... :(\n\n\\>Jota itsa J85\\<\n\n"
    },
    {
      "time": "8 Feb 2009 — 3:10pm",
      "content": "How can I completely remove Fontlab and all information in a Macbook Pro?  \nI already uninstall it but when I installed it again it didn´t ask me for the serial number.  \nI totally lost! :(\n\n\\>Jota itsa J85\\<\n\n"
    },
    {
      "time": "8 Feb 2009 — 3:24pm",
      "content": " **James:** _I get those weird shapes all the time, but undo usually fixes things._  \nThis probably has to do with the way FL manages undo (it is: one thread by glyph, so as, after some glyph jumps, one increases geometrically undo memory usage) through multiple dynamic pointers; eventually, it may occur that, when you try to go back i.e. by typing a fast keystroke, you “catch” FL —which is modestly slow due to its complexity— performing another background task; that's why you can fix it —actually, not exactly a bug, but an undesired undoable behavior— by repeating the command: after recovering its “conscious”, FL finishes all pending tasks and brings you where you wanted to.\n\n**MarS**\n\n"
    },
    {
      "time": "8 Feb 2009 — 3:42pm",
      "content": "Since we are piling on with FL problems here: can anybody print from FLS 5.0.4 under Mac OS X 10.5.6? I get blank pages. If I absolutely need to print, I have to go back to my old laptop running 10.3.\n\n"
    },
    {
      "time": "8 Feb 2009 — 4:01pm",
      "content": "altaira ,\n\nThat point and line Blitzkrieg behavior is very common and drive me nuts as well.\n\nChrisL\n\n"
    },
    {
      "time": "8 Feb 2009 — 4:05pm",
      "content": "Chris, it's just that it can be so… shocking. When I took the above screenshot,  \nI'd just spent I don't know how much time mini-tweaking that terminal in highest-grade concentration. And then everything exploded.  \nI needed no coffee for the rest of that day ;-)\n\n"
    },
    {
      "time": "8 Feb 2009 — 4:11pm",
      "content": "Nina, Remember to click \"undo\" right afterwards to regain your sanity. Sometimes, you may need to undo twice to stop the scoundrel from driving you to drink!\n\nChrisL\n\n"
    },
    {
      "time": "8 Feb 2009 — 4:29pm",
      "content": "I did that, Chris. My adrenalin took a bit longer to come down though :-)\n\n"
    },
    {
      "time": "8 Feb 2009 — 5:23pm",
      "content": "Steve: I guess although time goes by FontLab still keeps a strong Russian accent Intel's processors cannot deal with :-p\n\n"
    },
    {
      "time": "8 Feb 2009 — 6:49pm",
      "content": "As soon as a path starts behaving oddly, I do this: First, if necessary, undo to the point where the outline looks okay. Then select the entire path, cut and then paste. This seems to always clear up erratic path behavior for me.\n\nI also have a habit of saving frequently. I don't trust auto-save because it may save the font in an undesirable condition, like right after I've done something I shouldn't have to the font. I also use the option to save .bak files, so I can always roll back one version. Failing that, TimeMachine on OS X is my fallback (and it has saved me at least once).\n\n"
    },
    {
      "time": "9 Feb 2009 — 9:19am",
      "content": "Hey! I dont know how but Fontlab starts running well!  \nI didn´t know what happen! I thought my Mac has a virus or something... I hope not. ;)\n\n\\>Jota itsa J85\\<\n\n"
    },
    {
      "time": "9 Feb 2009 — 11:38am",
      "content": "may be worth posting to:  \n [http://forum.fontlab.com/fontlab-studio-problems-b5.0/](http://web.archive.org/web/20130330095911/http:/forum.fontlab.com/fontlab-studio-problems-b5.0/ \"http://forum.fontlab.com/fontlab-studio-problems-b5.0/\")\n\n"
    },
    {
      "time": "9 Feb 2009 — 11:51am",
      "content": "The sad thing, paul, is that they have other known bugs but never seem to bother fixing them, I wish they would be more responsive.\n\nChrisL\n\n"
    },
    {
      "time": "11 Feb 2009 — 3:52am",
      "content": "\"Does anybody knows why fontlab crashes unexpectedly?\"\n\nYou can't run it for too long, run long with several other applications running, with a large glyph repertoire refreshing, or edit a high resolution font at large magnification, without crashes likely to occur. Any time FL fails to immediately respond to edits, it is coming soon so I save and restart. And any time it does edits different from mine, it's also time to restart. Once or twice a year it gets me bad by not saving work anywhere, the latest version simply vanishing to font heaven when you quite FL.\n\nIt beats little pieces of metal trapped your teeth, but you have to be careful at all times to observe its behavior and react accordingly a the right time. I've found it to be truly unique in this versus all the other post-1999 Mac apps I've used.\n\nChrisL! There is a whole forum set up for your kind of whining at the FL site where it can now be less obviously ignored.\n\nCheers!\n\n"
    },
    {
      "time": "11 Feb 2009 — 7:30am",
      "content": "Thanks, David! I am ready to now be ignored in a higher place in the good company of other fellow whiners :-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Feb 2009 — 9:22am",
      "content": "\\>The sad thing, paul, is that they have other known bugs but never seem to bother fixing them, I wish they would be more responsive.\n\nI don't think Fontlab is unresponsive because of unwillingness, but because they have so much work. Twelve or thirteen years ago, in the v. 2 and 2.5 days (PC only), you could not possibly have asked for more responsive attention to customers. As the program(s) have grown more complex and more successful, it is no longer easy to get Yuri's ear. But we wouldn't want to be back in the comparatively simple days of 2.5 either. We just have to deal with it. That said, I have noticed that public complaints are the best way to get the company's attention. So strike here! You will be heard!\n\n"
    },
    {
      "time": "12 Feb 2009 — 11:00am",
      "content": "And don't forget to upload your (priceless) images/videos to the FontLab Errors Flickr group at [http://www.flickr.com/groups/fontlaberrors/](http://web.archive.org/web/20130330095911/http:/www.flickr.com/groups/fontlaberrors/ \"http://www.flickr.com/groups/fontlaberrors/\")\n\n"
    },
    {
      "time": "15 Feb 2009 — 9:21am",
      "content": "That's a wicked Flickr group! What amazing errors!\n\n"
    }
  ]
}
