{
  "id": "54576",
  "title": "The design and non-design of philosophical papers",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "(Apologies for the length. **For the short but incomplete version, just follow the bolds.** )\n\n**It seems that typographic criteria are an important factor in how philosophers distinguish scholarly from non-scholarly philosophical papers.** First, scholarly articles use black text only. Probably because it is too expensive to print, I have never seen color in the body text of an academic journal. Second, visual structuring of the text is kept to an absolute minimum. The clearest visual cues to semantic or logical structure likely to be found are the numbers in sequentially numbered arguments. Lastly, diagrams are rare, always sharply separated from the body text, and usually redundant—clarifying as they do material already expressed in the body text. **These tendencies reflect a desire to evade the influence of design on inquiry, to present the content of philosophical inquiry as somehow free from the constraints of having a visual form.**\n\nTo make things complicated for myself, **I’ve come to want to defend a conception of philosophy that demands I question the typographical norms of the academy.** (In short, since philosophy seeks knowledge of self-consciousness, it cannot deliberately ignore the necessity of its products being physical and visual things. I will likely develop some of these ideas on my blog, rather than in a discussion forum thread.) **But when I expressed interest in writing on this topic for my honors thesis, such that I would use the design of my paper as well as the written words to convey its argument, it generated somewhat of a controversy.** Responses ranged from interest and encouragement to the warning that if my paper did not show up to the ball wearing a suit and tie, it would not even be admitted.\n\n**Consequently, I tried to find contemporary examples to justify my project: contemporary philosophical works that use their visual presentation as an integral part of their meaning. But except for Derrida’s _Glas_ and Wittgenstein's works—hardly contemporary anymore—my search turned up nothing in the scholarly realm.**\n\nWhat seems to be the case most of the time is that when an artist or designer creates a text as an art or design object, they use whatever visual techne they can to construct a meaning as complex or simple as they desire to; but when it comes to writing as a scholar, the complexities and layers of meaning—or even improvements in clarity and reader engagement—that can be developed this way are immediately abandoned.\n\nI can infer a number of reasons why this might be a practical requirement of articles that are to be printed cheaply in academic journals and their equivalent, not the least of which is that good design takes a lot of time. But it is unclear how one would justify these practical considerations as law, as practices both good for their own sake and definitive of philosophical practice. One would either have to maintain a Platonic distinction between ideas and their expression, or an arbitrary distinction between historically diverse forms and contemporary narrow forms of philosophical writing, or that philosophical inquiry is no different than scientific research (scientific papers being the exemplars of the scholarly journal article).\n\nI apologize if this seems like a strange thing to post on the typophile discussion boards. Without offering my reasons for why I think the visual structure of a philosophical work is philosophically relevant, it might not seem very important. That having been said, **my question to you is this:**\n\n**Do you think there are scholars (especially philosophers) who do as I say—not just write _about_ visual aspects of philosophical writing, as many unintelligible French authors do, but _write inquiry visually_—or do you think there are good reasons to maintain a mutual exclusivity between inquiry and design?**\n\nI've attached an example of a book that I think exemplifies one way graphic design can perfect inquiry: _Das Bildnerische Denken_ by Paul Klee, designed by Robert Büchler. Here Klee’s writings and diagrams are given perfect expression by Büchler’s layouts and diagram redesigns. Obviously not everything could be produced at this level, but I don’t see this as a philosophical argument against trying.\n\n| Attachment | Size |\n| --- | --- |\n| [Klee--2-3.jpg](http://web.archive.org/web/20150419223930/http:/typophile.com/files/Klee--2-3.jpg) | 188.12 KB |\n| [Klee--16-17.jpg](http://web.archive.org/web/20150419223930/http:/typophile.com/files/Klee--16-17.jpg) | 270.49 KB |\n\n",
  "author": "nepenthe",
  "time": "9 Feb 2009 — 1:31am",
  "uid": "4886",
  "comments": [
    {
      "time": "9 Feb 2009 — 2:58am",
      "content": "I am a philosophy student as well (and I am a student at the KABK). I believe a further example could be Paul Feyerabend's \"Against Method\" when it was first designed and published (I will put up some pictures when I get home). It is not current, but sadly the only example I can think of.\n\nI think there are good reasons to combine design and inquiry (although I think it must be combined as a last step). There was a special typography class by G. Unger at my university and his lectures strengthened the idea to intertwine content and design in academic papers and journals in general and philosophy in particular.\n\nTerence\n\n"
    },
    {
      "time": "9 Feb 2009 — 5:08am",
      "content": "I pawed through a couple of Deleuze & Guattari editions and found one small visual model related to another writer’s work. I suspect that there is a long tradition of wanting to separate the field from mysticism which has always produced impressive looking visual representations of interior space.\n\n"
    },
    {
      "time": "9 Feb 2009 — 6:30am",
      "content": "As long as the author's main tool is language and he is not good at visualizing things, there is no need for illustrations or charts. Semioticians sometimes use charts to illustrate relations, and don't forget Peirce who visualized logic, see his entitative and existential graphs (nice book about this by Don D Roberts at IUP) or George Spencer Brown's Laws of Form. Just reading Kurt Flasch's Das philosophische Denken im Mittelalter which includes a short chapter about -- Leonardo.  \nMy question however is: What do you mean by \"write inquiry visually\"? And what point do you intend to make?\n\n<cite>There was a special typography class by G. Unger</cite> ...\n\nWhat was the outcome?\n\n"
    },
    {
      "time": "9 Feb 2009 — 6:53am",
      "content": "It might be interesting to consider, in cases where the philosopher/scholar in question also teaches, how visual his or her presentation of inquiry is in the classroom. I bet quite a few scholars who publish in text streams without concern for visuals might use quite a few on the chalkboard etc. as they teach that same material to a live audience.\n\n"
    },
    {
      "time": "9 Feb 2009 — 7:48am",
      "content": "Interesting thread!  \nI was going to suggest Deleuze & Guattari too.\n\nFrom my experience producing educational materials and tools for my local university, and working with scholars and teachers from diverse fields, I got the very strong impression that while the natural sciences are quite comfortable working with visual methods to corroborate their findings (and even use visualization as a heuristic tool), the humanities seem to have an almost surprising fear of the visual. Some more, some less, of course; history, for example, has been working with charts, graphs, and maps for quite a while, especially so in teaching. Philosophy, I would suspect, being a very \"verbal\" field from the beginning (I'm surmising), probably retains a strong distrust vis-à-vis the visual, and may be somewhat unconsciously striving to produce \"naked\" text untouched by the transformative powers of the visual world.  \nMy impression will be culturally biased, however, as the German-speaking countries tend to have a more difficult relationship to visuality than the Anglophone world in various aspects.\n\nI don't know if this is interesting to you – or if there are other such programs closer to you and your cultural context –, but there's an interdisciplinary, nationally-funded [\"iconic criticism\" research program](http://web.archive.org/web/20150419223930/http:/www.eikones.ch/starte.html) going on here that focuses mainly on the role and impact of images, but they do branch out into visual vs. non-visual (i.e. also designed vs. \"non-designed\") presentation of content as well. I've used their library, which is small but quite interesting. Maybe someone there could give you some pointers as well.\n\n"
    },
    {
      "time": "9 Feb 2009 — 10:07am",
      "content": "I'm at work right, so I can't post a proper response until this evening. It's interesting that none of the philosophers mentioned here so far—Feyerabend, Deleuze, Guattari, Flasch—are taught in my university. Neither is Derrida or anything in that vein. A few years ago a new prof tried teaching a class on Husserl and almost everyone dropped it. Our department is sort of a mix of analytical and historical philosophy. I think maybe it's becoming more analytical, but I'm not sure. I wanted to focus my attention on continental philosophy, particularly Derrida, but it was suggested to me that since I found it so difficult to interpret, that I should further back in the discussion. I am focusing on the thought of Alexandre Kojève, whose interpretation of Hegel was highly influential on later French thought. And his language is clearer to understand than his influences and those he influenced—Heidegger, Hegel, and Marx on the one hand, and Merleau-Ponty, Foucault, and Derrida on the other—although it is not without its difficulties.\n\n@Terence & Craig: One the things which led me to be interested in this topic is the complete incongruity between how lectures and seminars are conducted and how papers are written. It led me to wonder this: if a paper is the visual expression of philosophical activity, then why do papers not draw on the same resources? For example, in class, discussion and diagrams are significant aspects of the activity, but philosophical papers are without either. It is as if philosophizing were the \"preparatory stages\" of the final paper, as Wittgenstein would have it. But if the goal of philosophy is to produce a particular kind of product, then why deny this by forbidding philosophizing about the production itself. What could be more philosophical than this? To this end, last year I wrote a paper as a series of dialogues and correspondences, where the correspondences incorporated diagrams. The idea was to structure the writing according to actual philosophical practice. (This was for one of the professors who supports these kinds of ideas.)\n\n@James: I think this certainly has something to do with it. As Socrates would have it, the philosopher should point his soul toward being, not becoming. Since the visual partakes of becoming, it should be avoided. But of course Socrates didn't write to get promotions, whereas today's academics do.\n\n@Karsten: I don't think one could make a knock-down argument against the linguistic use of diagrams. As long the diagrams are developed in a systematic fashion such that their use follows objective rules, they should be just as linguistic as using glyph in sentences. E.g., the diagrammatic work of cartoonist [Chris Ware](http://web.archive.org/web/20150419223930/http:/nowordsnoaction.files.wordpress.com/2007/03/jimmyspread3.jpg).  \nI'll have to write you a proper response later, but I think that if you accept certain of Kojève's premises, it is possible to deduce many the claims I wish to make.\n\n@Nina: that site you referred to me is perfect! I wish I had found this months ago. I'll have to respond in more detail later. Gotta get back to work!\n\n"
    },
    {
      "time": "9 Feb 2009 — 11:15am",
      "content": "\"The typographical norms of the academy\" were certainly challenged by \"The Telephone Book\" by Avital Ronnell, designed by Richard Eckersley and published by University of Nebraska Press in 1989. Take a gander at that one.\n\nOdd: I made note of this book in another thread recently, one about colored text stock for books.\n\n[http://www.nebraskapress.unl.edu/product/Telephone-Book,671074.aspx](http://web.archive.org/web/20150419223930/http:/www.nebraskapress.unl.edu/product/Telephone-Book,671074.aspx \"http://www.nebraskapress.unl.edu/product/Telephone-Book,671074.aspx\")\n\npowers\n\n"
    },
    {
      "time": "9 Feb 2009 — 2:30pm",
      "content": "Well, I ended formal studies in philosophy 40 years ago, so I may be a bit out of date. With that caveat, what you might consider is that analytic philosophy, as a scholarly discipline, has abandoned areas of thought over the centuries. These areas, these kinds of truth, are no longer considered \"philosophical,\" and properly so. For example, religious arguments are not applicable, as the basis of religion is revealed truth. Empirical arguments are not applicable; they have a scientific basis. If there are aesthetic \\*truths\\*, they are perhaps revealed, but most of us would like to take them as empirical, allowing that the science hasn't gotten quite that far yet.\n\nBy the way, several things Wittgenstein said about philosophy remain current, no matter how much the academic study has changed . . .\n\n"
    },
    {
      "time": "9 Feb 2009 — 2:43pm",
      "content": "How is Bergson holding up?\n\n"
    },
    {
      "time": "9 Feb 2009 — 3:39pm",
      "content": "k.l. -- <cite>As long as the author's main tool is language and he is not good at visualizing things, there is no need for illustrations or charts.</cite>  \nj.p.k. -- <cite>I don’t think one could make a knock-down argument against the linguistic use of diagrams.</cite>\n\nJust to clarify, neither do I intend to knock anything down -- I mentioned Peirce and Spencer-Brown as admirable examples -- but said that obviously most authors feel more comfortable to express themselves in words rather than in graphs.  \nWhich premises of Kojeve do you mean?\n\n"
    },
    {
      "time": "9 Feb 2009 — 3:48pm",
      "content": "_...my search turned up nothing in the scholarly realm..._\n\nMcluhan had to crash the party, and those at the ball ignored him.\n\nTexts which visually deconstruct the medium in which they are presented cannot be considered part of academic philosophy at your level.\n\nWhat you are interested in is not viable as philosophy, where it vanishes up its own ass, but is better as cultural theory, such as:\n\n[http://muse.jhu.edu/login?uri=/journals/modernism-modernity/v002/2.3br\\_d...](http://web.archive.org/web/20150419223930/http:/muse.jhu.edu/login?uri=/journals/modernism-modernity/v002/2.3br_drucker.html \"http://muse.jhu.edu/login?uri=/journals/modernism-modernity/v002/2.3br\\_drucker.html\")\n\nAnd:\n\n[http://www.tate.org.uk/collections/glossary/definition.jsp?entryId=467](http://web.archive.org/web/20150419223930/http:/www.tate.org.uk/collections/glossary/definition.jsp?entryId=467 \"http://www.tate.org.uk/collections/glossary/definition.jsp?entryId=467\")\n\n"
    },
    {
      "time": "9 Feb 2009 — 5:38pm",
      "content": " **Will:** That \"Telephone Book\" looks like it is pretty far out. I checked and we also don't have that one in our library. Google Books is pretty generous with that one, though. Authors whose works this bring to mind, of those I've encountered, include [Maurice Blanchot](http://web.archive.org/web/20150419223930/http:/books.google.com/books?id=f-b2RPA8NF8C&printsec=frontcover&rview=1&source=gbs_summary_r&cad=0) (on the very fringes of being called a \"philosopher\"?) and [Mark Danielewski](http://web.archive.org/web/20150419223930/http:/en.wikipedia.org/wiki/Mark_Z._Danielewski) (a Derridean literaturist, perhaps, though not a philosopher). Neither author, it could be easily argued, deviates from the norms to clarify their!\n\n**Nick:** McLuhan is a notable exception to the rule, and I'm surprised I forgot to mention him. I don't think his trains of thoughts would always be accepted by philosophers as good arguments, though. Nobody in my department, at least, would be likely to call him a philosopher.\n\nI have Drucker's _The Visible Word_ on loan from another library at present. We have no such books in our library, unfortunately. I have just started to read it. But it is interesting to note that it is presented in a conventional visual academic style, despite its subject matter.\n\n_where it vanishes up its own ass_  \nThis is priceless. I think that it must seem like I'm wanting to follow the deconstuctionist path. But I am among the persons who thinks that much of this work is unintelligible. \"Onto-typo-logy, thus inflected, that is, thus 'reversed' and brought back to the 'subjectal' sphere, finally proceeds from a 'modification of transcendence,' that is, from the transformation of transcendence into 'rescendence', wherein transcendence itself founders and disappears...\" (_Typography_, Phillipe Lacoue-Labarthe, 55–56)\n\n**James:** All the Bergson I've seen is continuous blocks of text. Yet another philosopher not taught in my department, so once again my familiarity is not extensive. I think I was told at some point that he's no longer considered important, so not to bother too much with him. But I could be mistaken on that.\n\n**Karsten:**\"I don't think one can make a knock-down argument against x\" is just an analytic philosophy expression meaning one thinks x is a defensible position. I think I may have picked it up from Davidson ... As for Pierce, I have not encountered any diagrams in his writings, but I have not read him extensively. Are you thinking of symbolic logic, or did you have something else in mind? I forgot to mention symbolic logic as a diagrammatic form of scholarly writing. Oddly, the use of symbolic logic in papers is also discouraged in my department. And I must confess that I had never heard of Spencer-Brown before. I'll have to check out what we have in our library. Google Books only has snippet views.\n\nI'll respond specifically about Kojeve in awhile. I have a few chores to do before I can work on a proper response.\n\n"
    },
    {
      "time": "9 Feb 2009 — 5:55pm",
      "content": "Nick: Ouroboros is an old one. Probably predates any known philosophy department. But then there is no doubt a distinction to be made between disappearing up one’s own a$$ and consuming oneself. The end sum is still zero either way, pick your poison.\n\n"
    },
    {
      "time": "9 Feb 2009 — 6:33pm",
      "content": "I don't think you have yet articulated the problem clearly enough.\n\nA big part of the reason that philosophical papers are not particularly well designed is money, that the essays are just put through a template and libraries buy the stuff. Another part of the reason is that most philosophers are not design-aware.\n\nBut neither of these problems is a philosophical problem--a problem of understanding or explaining something. They are instead important practical problems: how to you improve the design of journals and books, and how do you improve education and awareness?\n\nWhat is the philosophical problem here?\n\nI am not saying that you don't have one; I am saying that you haven't made it clear. I have taught philosophy and discussed plenty of essays with students. If you were my student, I'd say: a 'topic' or even a thesis ( eg \"academics should be design-aware\") isn't good enough, you need a problem. Something concerns you, and that is a good start. But what is the problem? What are you trying to understand? What isn't clear? What are the different points of view in the existing literature on the issue you are concerned with? Try to answer those questions and they will give your inquiry more focus and direction.\n\n"
    },
    {
      "time": "9 Feb 2009 — 9:46pm",
      "content": "Interesting and thorny issue. You're gonna need one helluva crowbar.\n\nNot contemporary, but: Beaumarchais expended great energy/funds  \nto acquire the original Baskerville materials for the setting of his  \ncomplete works of Voltaire (although AFAIK he didn't get the ink and  \npaper to JB's level).\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2009 — 10:58pm",
      "content": "I have attempted to provide a very brief summary of why I think the design of philosophical works is philosophically relevant. However, I have retained the terminology and the diagrams are quite rough, so the meaning may be opaque at times. Any question you can offer will only help me to better clarify what I am presently unskilled at communicating.\n\nIn Kojève’s philosophy, the philosopher is defined in terms of desire, the desire to become wise, that is, to become a sage. Wisdom (_Sagesse_, en français) is a form of self-consciousness, viz., it is the answer to every question that a self-consciousness can ask of itself about itself:\n\n ![](http://web.archive.org/web/20150419223930im_/http:/typophile.com/files/argument-002_3797.jpg)\n\nA self-consciousness has two aspects: consciousness for-itself, and consciousness for-another. In other words, the self-consciousness is both subject and object. Thus, the philosopher desires to answer every question that can be asked of himself both as subject (concept) and as object (thing). What I will argue is that by accepting these premises, one can deduce a conception of philosophy with two aspects corresponding to the two aspects of self-consciousness: philosophy as conceptual inquiry and philosophy as poietic (forming/making) activity. The overall scheme, from the perspective of the philosopher as thinker, looks something like this:\n\n ![](http://web.archive.org/web/20150419223930im_/http:/typophile.com/files/argument-003_5140.jpg)\n  \nThis scheme can be understood as an answer to the question: “How does the philosopher become a sage?” \n\nThe question from the perspective of the philosopher as maker would be “How do the things I make tell me what and who I am?”, which would (somewhat chaotically) like this:\n\n ![](http://web.archive.org/web/20150419223930im_/http:/typophile.com/files/argument-001_3568.jpg)\n\nLastly the philosopher as slave or servant would ask, “How do I dialectically oppose the opposition between mastery and slavery?” The answer overlaps in all cases; Kojève would say the answers are identical, but this is not precise.\n\nI should note that the schema of presenting this as three questions and three different diagrams or schemas is not to be found in this form in Kojève’s text. But I think that, as I said earlier, one can deduce them given his conception of man as self-consciousness and his basic terminology. This is a pretty scant overview of the thesis I’m working on, but I am halfway through the section so I can’t really provide too many details about the whole thing. The important point for typophiles is that Kojève seems to present a conception of philosophy that demands the philosopher to be as contemplative about the methods by which he incarnates his thought as the thought itself, for they are dialectically related in this argument. Kojève argues that wisdom, ultimately, must appear in the book form, because only a physical incarnation of thought can dialectically overcome the opposition between spirit and nature which parallels the overcoming of the opposition between mastery and slavery and between eternity and time. (Does that ever need unpacking!) As a philosopher who desires wisdom, only by incarnating my full thought concerning self-consciousness in its both aspect can I make progress toward the goal of self-knowledge.\n\nAt this point I should probably suggest I don’t post any more of this stuff in the general discussions. However, as I develop my rough sketches of diagrams, I would greatly appreciate feedback from anyone who cares to examine them. This will take place on my blog.\n\n"
    },
    {
      "time": "10 Feb 2009 — 2:50pm",
      "content": "Well, I don't know Kojève, but I fear you are getting into a muddle from which there is no exit--and for all I know Kojève is already there.\n\nIf you are going to get anywhere productive, I think you need to look at the problem Kojève was trying to solve. Are there competing theories of what a sage is? What are the conflicts? Why do the folks who advocate becoming a sage think it is a good thing?\n\nThese kinds of questions look at the 'problem situation' (from the German: problemstellung), and can be very helpful in giving you guidance.\n\nSo far as I know, academic philosophers are not generally regarded as sages. More typically folks like the Confucius, Buddha, Epictetus, and Hillel are called sages. And this name is given because they have some insight into ethics and the conduct of life, not just mystical insight.\n\nYou may get into something very interesting with this, but there is a real danger in landing in a bucket of B.S.\n\n"
    },
    {
      "time": "10 Feb 2009 — 5:35pm",
      "content": "I continued this discussion in a [blog thread, 54648](http://web.archive.org/web/20150419223930/http:/typophile.com/node/54648). Thanks for your feedback everyone. I hope I continue to receive your criticism and suggestions!\n\n"
    }
  ]
}
