{
  "id": "54618",
  "title": "Great comic book design",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "The inspiration for this post essentially is my love of comics books. I always loved drawing when I was younger which left me in good stead for my later progress into graphics. At a young age I would spend ages copying scenes from comic books of my favourite characters so this was, pretty much, how I learned to draw. But heres the thing, yes I love comic books and think they are wonderful pieces of art, but I actually (and I am sure this will upset a few people) don’t always think they are wonderful pieces of graphics. Yes, the ideas are usually great, and the artwork is usually fantastic, but its the combination of this with typography and all the other information that doesn’t always work and can sometimes look cluttered. The covers often don’t feel like a designed piece of art in their own right, but rather a great picture with everything else slapped on top. But of course this obviously depends on the comic. In fact there are some wonderfully creative covers out there, with a f f f fabulous use of type in a minimal fashion to accompany the artwork. So that’s what this article will concentrate on. Hope you enjoy these as much as I do and appreciate them as works of art AND design in their own right. I have kept it short but hopefully sweet.\n\nJoker\n\n ![](http://web.archive.org/web/20130516091704im_/http:/typophile.com/files/JokerCover_6600.jpg)\n  \nThis is a fantastic cover from penciller Lee Bermejo, majority inker Mick Gray, colorist Patricia Mulvihill and letterer Robert Clark and definitely my favourite. Firstly a word about the illustration. Actually someone told me that it was this comic which influenced the movie Dark Knight and the graphic illustration and artwork inside as well certainly portray a far darker joker than previous versions that just show a well made up clown which wouldn’t be scary without the psychotic character. But this cover is actually quite a scary image. It shows decaying teeth, smudged make up on a lined face and a mouth that more resembles the scarred version in both the movie and interior of the comic. It has a wonderful hand drawn gritty feel to it which add to the darker feel. Also, you just have to love the white and black contrasting colours that offer such a dramatic tone. This obviously emphasises the dash of red as well which lead your eyes into the disturbing mouth and teeth of the illustration. \n\nAgain, typographically I love this one. It is beautifully done in a hand written font which adds to the chaotic and dark feel to the cover and also makes it seem so carefully crafted which only adds to the quality. The whole comic on this has a kind of limited edition feel with this, and the matt textured coat of the cover compliment this feeling of something special. The type also displays a funny kind of topsy turvy balance. Again this draws the eye up towards the centre mouth on the page which seems to be the focal point of the cover. It also could represent the fine balance of the psychotic mind that lurks within the character. Whatever the reasons it works. The type doesnt conflict with the image but rather works with it.\n\nWatchmen\n\n ![](http://web.archive.org/web/20130516091704im_/http:/typophile.com/files/watchmen_4641.jpg)\n  \nThis is another of my personal favourites and a real original in a cover I think, as it does not really feature much character artwork. It features a section of a yellow smiley face which is cropped close in an abstract way, making it not obvious to what it actually is. The face is featured throughout the comic in various places giving it a consistent red thread throughout, and the cover draws back to this building on an already strong identity. It also adds a drop of blood to it which is seemingly important. For one, it is a detail placed over a hard graphic flat colour which makes it stand out. Also, a yellow smiley face is considered to be a classic symbol of innocence and the drop of blood also contrasts with this. It spoils the innocence and provides the perfect visual opposite which is what the comic is all about. \n\nThe colours of black and yellow are used in a bold and hard fashion and compliment each other well. Black and yellow are thought to contrast with each other better than any two colours, even black and white, which is why they are used so often in high visibility signage for roads and construction. A straight edged large and bold san serif runs down the side which again is not that common in comic cover design. Indeed, the cover has a more graphic feel than that of a traditional comic making it a true original.\n\nCaptain America\n\n ![](http://web.archive.org/web/20130516091704im_/http:/typophile.com/files/96474-11499-106788-1-captain-america_super_5158.jpg)\n  \nThis is not a comic I know much about to be honest, but I know that I really love this cover. I guess its probably not that original to use newspaper headings to show the title in comic terms, but it is especially effective here. The type is bold and cropped off the page which gives it a more real feel, be it a real in the comic book world as opposed to our reality. Again like the watchmen comic the splattered blood adds an element of darkness to it. The character is simply represented through a hand which lies across the newspaper. This gives the sense of mystery and makes the reader want to look inside, a compliment and aim in surely all cover design. It also adds a dark feel as the flopped arm portrays helplessness. The whole thing just works together as a whole and looks balanced. It does not look cluttered at all and the information is kept to a minimal.\n\nWell I hope you reading this article. Do you have anything to add?\n\n",
  "author": "chasteauneuf",
  "time": "10 Feb 2009 — 6:06am",
  "uid": "29870",
  "comments": [

  ]
}
