{
  "id": "54622",
  "title": "God that Brioni is nice!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just a shout-out in appreciation of the beautiful work by Typotheque.\n\nChrisL\n\n",
  "author": "dezcom",
  "time": "10 Feb 2009 — 7:48am",
  "uid": "3135",
  "comments": [
    {
      "time": "10 Feb 2009 — 8:24am",
      "content": "I thought the same thing this morning. Beautiful!\n\n"
    },
    {
      "time": "10 Feb 2009 — 8:31am",
      "content": "It looks even nicer here than it does on the Typotheque site.\n\n"
    },
    {
      "time": "10 Feb 2009 — 8:37am",
      "content": "I got the mail piece weeks ago. I could do much with Brioni and Skolar I think. Get the promo piece if you can. It is often that question of what’s not to like. In this case I see nothing. God I sound negative.\n\n"
    },
    {
      "time": "10 Feb 2009 — 8:41am",
      "content": "You mean the specimen booklet? I got that a while ago too. It's high on my \"look at these frequently, and buy as soon as you find a project that may fit\" pile. :-)\n\n"
    },
    {
      "time": "10 Feb 2009 — 2:58pm",
      "content": "And is it ever expensive: $145 CDN per style!\n\n"
    },
    {
      "time": "10 Feb 2009 — 5:51pm",
      "content": "And is it ever expensive: $145 CDN per style!\n\nThat's just a little over 7 cents a character!\n\n"
    },
    {
      "time": "10 Feb 2009 — 6:18pm",
      "content": "You're comment is about as relevant as mine was, which is probably your point. Sorry I mentioned it!\n\n"
    },
    {
      "time": "10 Feb 2009 — 6:39pm",
      "content": "I do agree... $145 is a lot. I was just being silly posting the per character price. Still 995 characters is also a lot.\n\n"
    },
    {
      "time": "10 Feb 2009 — 7:52pm",
      "content": "Let the saving begin:P\n\n"
    },
    {
      "time": "11 Feb 2009 — 5:42am",
      "content": "Chris is a man with a Brionic eye.  \n[insert the Six Million Dollar Man sound here, or a groan.]\n\n"
    },
    {
      "time": "11 Feb 2009 — 7:25am",
      "content": "For as many pieces of high-tech hardware surgeons have stashed in my body, I might actually qualify :-)\n\nI'll have some Brie and cheese with that!\n\nChrisL\n\n"
    }
  ]
}
