{
  "id": "54629",
  "title": "Alt weekly redesign - Headline font suggestion?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i'm working on a redesign of an alt weekly over here. our competitor uses [FB's Amplitude](http://web.archive.org/web/20131018040030/http:/www.fontbureau.com/newspaper/fonts/Amplitude) as a headline font so I'd like to stray as far away as possible from that.\n\nAt the moment I'm using Aaux Pro Medium for subheads, Aaux Pro Poster for section titles and I think I've settled on Melior for body copy, but a well balanced, possibly serif headline font is hard to find. A condensed option would be grand. Actually, my only real \"want\" is for the headline and the subhead to be opposite - one sans, and one serif. I'd like to achieve some balance and texture through those choices.\n\nDoes anyone have any suggestions? I'd greatly appreciate any ideas, or love/hate combinations, or general discussion.\n\nThanks a bunch, I really enjoy reading these boards!\n\n",
  "author": "veekee",
  "time": "10 Feb 2009 — 10:50am",
  "uid": "28741",
  "comments": [
    {
      "time": "10 Feb 2009 — 11:23am",
      "content": "What did you think of [Pratt Pro](http://web.archive.org/web/20131018040030/http:/www.shinntype.com/pratt.html)? (Featured Font a couple of weeks ago).\n\n"
    },
    {
      "time": "10 Feb 2009 — 11:59am",
      "content": "Pratt is gorgeous, but sadly a little dressy for us...I'm actually in LOVE with [FB's Antenna](http://web.archive.org/web/20131018040030/http:/fontbureau.com/fonts/Antenna) but at $1400 for the set, we can't afford it. Can anyone think of a comparable font that's significantly, significantly cheaper? We're just a small indie outfit, so large corporate backing isn't in the equation for delicious font purchases. $200, we could do. $1400? Not so much. Sigh!!\n\n"
    },
    {
      "time": "10 Feb 2009 — 1:04pm",
      "content": "Yes, but do you neeeeed all 56 styles? Why not carefully select 6 styles of Antenna -- your choice -- for US $180?\n\nBut I'm not convinced Antenna is far enough away from Amplitude. What styles of Amplitude is your competition using -- wide or narrow, light or black?\n\nWhat would you be looking for in a serif headline (if Pratt is too \"dressy\")? Even bolder? Less contrast? More slabbish? More compact?\n\n-- Kent.\n\n"
    },
    {
      "time": "10 Feb 2009 — 1:13pm",
      "content": "oh but kent, don't we all NEED 56 styles of everything and always?! ha! good point -- but an even better point is that amplifier and antenna may not be dissimilar enough. the Other Guys are using what looks to be amplifier black wide.\n\nI still like the heaviness of a bold font with the headlines. something that's more slabbish, more punchy, less suit-and-tie, less conservative and more scrappy-underdog-we're thriving against all odds-plus-we're-cool kinda thing. What a tall order - maybe it should be a sans, i can balance it out with a serif subhead (ie. Belizio or clarendon).\n\nOuf. How does one choose?! Where to start?!\n\n"
    },
    {
      "time": "10 Feb 2009 — 1:50pm",
      "content": "[http://www.typography.net/type/the\\_shire\\_types](http://web.archive.org/web/20131018040030/http:/www.typography.net/type/the_shire_types \"http://www.typography.net/type/the\\_shire\\_types\")\n\nhhp\n\n"
    },
    {
      "time": "10 Feb 2009 — 2:15pm",
      "content": "Okay, what about [Dispatch](http://web.archive.org/web/20131018040030/http:/www.fontbureau.com/fonts/Dispatch) Normal & Compressed, Bold & Black?\n\n ![](http://web.archive.org/web/20131018040030im_/http:/typophile.com/files/Dispatch2_3783.png)\n\n&nbsp;  \nDon't know how you'll like it with your Melior.\n\n ![](http://web.archive.org/web/20131018040030im_/http:/typophile.com/files/Melior_ScrappyUnderdog_3438.png)\n\n"
    },
    {
      "time": "10 Feb 2009 — 3:34pm",
      "content": "Dispatch is exactly the right idea, and I've looked at it as well, but I worry it's still too similar. It's like I need the exact opposite-yet-twin of that font (no, not Stainless, though).\n\nI'm obviously going to base body font off of the headline, though, so Melior's flexible.\n\nI was considering Gotham, but Obamarama has unfortunately made that option too cliched. And Giza's really fun, but I worry it's too swirly. At the moment I've got one template using Belizio Bold as the headline, that's not looking too bad.\n\nCan I eke one last final suggestion from you in the vein of the anti-Dispatch? I'd greatly appreciate it!\n\n"
    },
    {
      "time": "10 Feb 2009 — 4:56pm",
      "content": "<cite> &gt; exact opposite-yet-twin </cite>\n\nHmm, Vikki. Really not sure where to go with that. Can you say more about what would be anti-Dispatch for you?\n\nGotham . . . Giza . . . we're all over the map here ;-)\n\n-- K.\n\n"
    },
    {
      "time": "11 Feb 2009 — 1:14pm",
      "content": "I'm not really sure what you after, either. Have you looked at anything from DSType, such as [Dobra](http://web.archive.org/web/20131018040030/http:/www.dstype.com/index.php?id=59) or [Priva](http://web.archive.org/web/20131018040030/http:/www.dstype.com/index.php?id=55)? Dobra in particular is really \"cool\", and it is hot off the shelf.\n\n"
    }
  ]
}
