{
  "id": "54643",
  "title": "New fonts from TypeTogether",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "We are happy to announce the release of two new font families.\n\nOne is the award-winning [Skolar](http://web.archive.org/web/20131018094431/http:/www.type-together.com/ampl_font.php?idpuente=21), by David Březina, a 4 weight family which has been designed specifically for scholarly multilingual publications. Prominent serifs and low-contrast modulation give the typeface a fairly robust character. Its relatively large x-height sets the typeface proportions somewhere between book and newspaper typefaces. The capitals are rather low in comparison to the ascenders to give the typeface even texture and more space for capital diacritical marks. These characteristics were introduced to improve readability in smaller sizes. Additional 2 weights are planned for April 2009.\n\n ![](http://web.archive.org/web/20131018094431im_/http:/typophile.com/files/Skolar_6316.jpg)\n\nThe other release is the beautifully poetic [Alizé](http://web.archive.org/web/20131018094431/http:/www.type-together.com/ampl_font.php?idpuente=20) by Tom Grace, a three-weight typeface inspired by the chancery italic of the 16th century. It is a high-contrast face, created with syncopations in axes and proportions and subtle irregularities that form a lively and delicate weave, suitable for setting a single word, a special expression, or a short block of prose. The family does not contain a roman, and instead promotes the italic as a primary style, a common printing convention in the 16th and 17th centuries.\n\n ![](http://web.archive.org/web/20131018094431im_/http:/typophile.com/files/Alize_4112.gif)\n\nFor more information visit [http://www.type-together.com](http://web.archive.org/web/20131018094431/http:/www.type-together.com/).\n\n",
  "author": "viko",
  "time": "10 Feb 2009 — 3:49pm",
  "uid": "13737",
  "comments": [
    {
      "time": "10 Feb 2009 — 7:27pm",
      "content": "always happy to see a st ligature. Looks pretty nice.\n\n"
    },
    {
      "time": "11 Feb 2009 — 6:43am",
      "content": "I really like Skolar. The ink trap (A, v, etc) is surprising me, but probably pretty efficient. I also like the subtle broken line between curves and straight lines. Nice typeface to use in corporate or advertising document. Good work!\n\n"
    }
  ]
}
