{
  "id": "5466",
  "title": "Viennavigator",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "yesterday i got a little job from a friend that has to be finished on monday. they need a logotype for a cd-rom student guide in vienna. its called \"viennavigator\". it has to work on that blue background because it's the ci color of the publishing house which distributes the product.   \n   \ni'd be thankful for any suggestions.   \n   \n ![draft 1](http://web.archive.org/web/20131020190041im_/http:/www.typophile.com/forums/messages/29/39886.gif)   \n ![draft 2](http://web.archive.org/web/20131020190041im_/http:/www.typophile.com/forums/messages/29/39887.gif)\n\n",
  "author": "titus n.",
  "time": "3 Jul 2004 — 2:37am",
  "uid": "3177",
  "comments": [
    {
      "time": "3 Jul 2004 — 8:47am",
      "content": "I like the handwritten/script font much better than the more corporate looking sans serif logos. The handwritten ot me fits better and sort with the theme. I am not sure you need all of the arrows on either side. Maybe some sort of mark with just one arrow like the north arrow on a map in the same sort of style as the type like you have done. I don't know if thats been overplayed, just an idea.\n\n"
    },
    {
      "time": "3 Jul 2004 — 9:03am",
      "content": "thanks for your comment tom, it is encouraging to hear my own thoughts from another person!   \n   \nbut it definitely needs a lot of adjustment. hope the time will be sufficient.\n\n"
    },
    {
      "time": "3 Jul 2004 — 9:20am",
      "content": "first feedback from the customer:   \nas usual. always the opposite. ![:-)](http://web.archive.org/web/20131020190041im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nso i reworked number one and i am quite satisfied. your thougths?   \n   \n   \n ![](http://web.archive.org/web/20131020190041im_/http:/www.typophile.com/forums/messages/29/39908.gif)\n\n"
    },
    {
      "time": "3 Jul 2004 — 12:46pm",
      "content": "Always the case haha it seems with clients. Looks like Thesis (I love that typeface).   \n   \nI don't understand why the n and the a are highlighted, and the directional arrow to me is a bit lost with the modifications to it. Although I do like how it is more stylized and skewed to match the italic letters.\n\n"
    },
    {
      "time": "4 Jul 2004 — 1:56am",
      "content": "n and a re highlighted because they are the letters where the two words \"vienna\" and \"navigator\" merge. the intention is to make that clear (and it obviously doesn't work)   \n   \none should be able to read vienna and/or navigator.\n\n"
    },
    {
      "time": "4 Jul 2004 — 5:59am",
      "content": "fine tuned version.   \ni think it's better.   \n   \n ![](http://web.archive.org/web/20131020190041im_/http:/www.typophile.com/forums/messages/29/39923.gif)\n\n"
    },
    {
      "time": "5 Jul 2004 — 7:53am",
      "content": "why don't you try to colorize the \"a\" only? It will give it more ...erm, centered look. Colors are nice, blue/orange scheme looked too much Microsoft-ish ![:-)](http://web.archive.org/web/20131020190041im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "5 Jul 2004 — 8:25am",
      "content": "titus   \n   \ni like it, but have you tried to include the arrows to your letters, i mean that your \"v\" can start with your left arrow, the decender of your second \"n\" can be your down arrow, the second \"v your up arrow, and the \"r\" your right arrow, i would also see how it works with less arrows (as someone commented), maybe three or two.   \n   \nnice work   \n   \nCG\n\n"
    },
    {
      "time": "7 Jul 2004 — 11:52am",
      "content": "I am late into this, and your project is most definitely over, but is this a possible solution to dual readability?   \n   \n   \n   \nAndrew   \n   \n   \n ![](http://web.archive.org/web/20131020190041im_/http:/www.typophile.com/forums/messages/29/40106.jpg)\n\n"
    },
    {
      "time": "8 Jul 2004 — 10:34am",
      "content": "thanks for your comments, i haven't checked it recently because it's already over. they like it now, the only comment was that the colors are a bit \"medical\".   \n   \nbut i'll try your suggestions, just for personal pleasure!\n\n"
    }
  ]
}
