{
  "id": "54673",
  "title": "Use of illegally uploaded fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is it illegal to download illegally uploaded fonts? And is it illegal to use them?\n\n",
  "author": "Laurentius",
  "time": "11 Feb 2009 — 12:41pm",
  "uid": "42110",
  "comments": [
    {
      "time": "11 Feb 2009 — 12:46pm",
      "content": "Do you like people to use your work or services without compensating or paying you? That's basically what it boils down to.\n\n\"Legal\" as a definition really depends on the laws at a given location and time. But in most cases, yes, it is illegal to download illegally uploaded fonts. You could be found liable. But I'm not a lawyer.\n\n"
    },
    {
      "time": "11 Feb 2009 — 12:49pm",
      "content": "Of course.\n\n"
    },
    {
      "time": "11 Feb 2009 — 12:52pm",
      "content": "why would it not be illegal?\n\n- Scott\n\n"
    },
    {
      "time": "11 Feb 2009 — 12:57pm",
      "content": "I assume that Laurentius is hoping that only the anonymous person who illegally uploaded the fonts is liable, and the person who downloads them and uses them in a project is somehow absolved of any responsibility.\n\nIn my opinion in real life the opposite is true, the anonymous uploader stands little chance of being brought to justice, but the person who associates their name with a project that uses unlicensed fonts is 100 times more likely to find themselves in hot water.\n\n"
    },
    {
      "time": "11 Feb 2009 — 1:49pm",
      "content": "To nit-pik, I'm not sure in what context it'd ever be illegal to 'upload' a font.\n\nPutting a file on a server, in and of itself, doesn't typically have any 'illegal' connotations to it.\n\nNow if this server happens to be public, and advertises the fact you can download copies of the file from it, then one could argue there was intent involved and said intent could be construed as being illegal.\n\nBottom line, if the digital files are protected by copyright or licensing or the like, then yea, any use outside of those parameters could easily be illegal.\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:08pm",
      "content": "Even if it is only for private, noncommercial use?\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:21pm",
      "content": "You are an accomplice. Anything you print can and will be used against you in a court of law.\n\nWell sure, you can use a pirated version of Palatino to write your school paper if that is what you mean. If you want to know more about licencing and what you can and cant use legally and where I would recommend reading [Pricing and Ethical Guidelines](http://web.archive.org/web/20131017043015/http:/www.amazon.com/gp/product/0932102131). Any other reads on this subject?\n\nMovies, music and fonts are handled in different ways.\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:11pm",
      "content": "The reason I ask the question this way, is that I have been told, that downloading movies (from torrents) is not illegal; only uploading (I see no reason to put that in quotation marks) them is.\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:14pm",
      "content": "More practically: would anyone ever ask someone, who noncommercially, perhaps in an academic context, used a font, to shew his licence for it; could that (with legal force) be demanded?\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:19pm",
      "content": "If you know that what you're acquiring was stolen, then you are complicit in the theft.\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:24pm",
      "content": "\\> Is it illegal to download illegally uploaded fonts?\n\nGenerally speaking, you must distinguish two cases:\n\n1) If the design for the downloaded font had been registered (e.g. at the design office in Alicante for Europe) and the registration was valid and is has not yet expired, then downloading of fonts whose design was registered is illegal, if the downloader lives in Europe or in the country where the font had been registered.\n\n2) If the design for the downloaded font was not registered and if the downloader of the uploaded font never concluded any contract with the seller of the font, there does not exist any contractual (or EULA) link between downloader and seller of the font with the consequence that the downloader can only be sued, if the seller proves that the font is a computer program the source code of which was written by a natural person. Nobody can prove this, because fonts are not computer programs written by natural authors. Even Chief Justice Roberts (who was recently seen at the Obama swearing ceremony) would never swear that fonts are computer programs (see [http://www.sanskritweb.net/forgers/publicdomain.pdf](http://web.archive.org/web/20131017043015/http:/www.sanskritweb.net/forgers/publicdomain.pdf \"http://www.sanskritweb.net/forgers/publicdomain.pdf\"), pages 2). The fairy tale that fonts are computer programs or \"software\" was invented to cheat dimwitted font buyers. No sane person believes this rubbish, let alone the American Chief Justice Roberts.\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:37pm",
      "content": "Thanks. Are you saying that one can use any unpaidfor font for any purpose so long as one's computer is not seized and searched? With regard to registration, specifically speaking: Garamond Premier Pro in Europe (not EU, if it makes any difference) -- ?\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:49pm",
      "content": "If you use the font and the foundry happens to notice it and happens to decide to track you down and you don't have a license they can take you to court. It is a risk you take.\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:54pm",
      "content": "\\> Garamond Premier Pro in Europe\n\nYou can search for European font designs here\n\n[http://oami.europa.eu/RCDOnline/RequestManager](http://web.archive.org/web/20131017043015/http:/oami.europa.eu/RCDOnline/RequestManager \"http://oami.europa.eu/RCDOnline/RequestManager\")?\n\nFor more information about registration see\n\n[http://www.sanskritweb.net/forgers/segoe.pdf](http://web.archive.org/web/20131017043015/http:/www.sanskritweb.net/forgers/segoe.pdf \"http://www.sanskritweb.net/forgers/segoe.pdf\")\n\nand the other documents mentioned therein.\n\n"
    },
    {
      "time": "11 Feb 2009 — 2:58pm",
      "content": "\"Are you saying that one can use any unpaidfor font for any purpose so long as one’s computer is not seized and searched?\"\n\nYou rob a bank if you want.\n\nYou'll only go to jail if you get caught and convicted.\n\nI'm still not sure what you are specifically trying to ask.\n\n"
    },
    {
      "time": "11 Feb 2009 — 3:20pm",
      "content": "Uli,\n\nDanke. Die Seite, die Sie mir gezeigt haben, scheint mir zu sagen, dasz die Schütze in allen Fällen nicht auszer der EC gelten. -- Oder habe ich miszverstanden?\n\n"
    },
    {
      "time": "12 Feb 2009 — 1:05am",
      "content": "Laurentius:\n\nAs you have a command of the German language, you should read this German document:\n\n[http://www.sanskritweb.net/forgers/eula.pdf](http://web.archive.org/web/20131017043015/http:/www.sanskritweb.net/forgers/eula.pdf \"http://www.sanskritweb.net/forgers/eula.pdf\")\n\ndealings with \"The EULA Fraud and How to Get a Legal Remedy\".\n\nSince e.g. the German Fontshop ( [www.fontshop.de](http://web.archive.org/web/20131017043015/http:/www.fontshop.de/ \"www.fontshop.de\")) claims that fonts are \"computer programs\" (\"software\") and sells \"licences\" to such claimed \"computer programs\", you may do the following:\n\nInsert the name of the desired font into the German-language affidavit form on page 5 of the above document eula.pdf and send it to Fontshop in Germany for signing this written affidavit concerning the desired font.\n\nIf Fontshop refuses to sign the affidavit, you know that Fontshop falsely claims that fonts are \"computer programs\" and that Fontshop \"sells licences\" to non-existing copyrights.\n\nIt is evident that you cannot grant a copyright licence to something that is not copyrighted, as everyone understands who is \"sane in the brain\".\n\nIf Fontshop refuses to sign the affidavit, you know that the desired font is not copyrighted, and therefore you can do with this font whatever you want to do, as far as the **copyright law** is concerned.\n\nThis means that all this does not apply to fonts as far as the **design law** is concerned and which have been validly registered as designs as mentioned above in this thread, because the valid registration as font design protects all forms of the font, even font computer files which are no computer programs. It should be noted, however, that most registered font designs are invalid, because most font designs do not meet the requirements of novelty and individuality (see e.g. the Segoe-Frutiger lawsuit).\n\n"
    },
    {
      "time": "12 Feb 2009 — 1:23am",
      "content": "First of all: Excuse my English skills.-I know they are worst.\n\nDear Uli, I know that it isn’t up to you to justify this never ending European Union Regulations nonsense. Once again we are discussing about a »curvature of a cucumber« EC Regulation.\n\nRefering to the Microsoft vs. Linotype (Segoe / Frutiger Next) case:\n\nHow can an EC Regulation determine that »similar« is »identical«.\n\nFurthermore, if similar is identical; - how can a judge establish the criteria what is similar or identical in case of a typeface?\n\nPerhaps a stupid example: I suppose everybody knows »Marilyn«, an artwork of Andy Warhol. My question: Is Marilyn 1 similar to Marilyn 2 or 3 or 4 …….. . If they are similar, they are identical (in the opinion of the EU). That means buying Marilyn 1 I bought even Marylin 2, 3, 4, etc. because they are identical. - »Good night Europe«\n\nAnother example: Personally I’m »forging« fleurons, ornaments etc. from old »Foundry Specimen Books«. Actually I’m »forging« calligraphic ornaments from Richard Gans Foundry, Madrid. If you look at this [example](http://web.archive.org/web/20131017043015/http:/www.typoatelier.com/muster/RGans.jpg) from a Gans Specimen Book from 1922 you will note, that the ornaments are similar but not identical. Why should Gans map those similar ornaments in his specimen if they are identical? Because of their different size? -I don’t think so.\n\nAn additional point: It seems that no one in the EU knows the difference between a typeface and a font file. It’s the same difference as between a vector graphic and a .svg file. The graphic is artwork the .svg file is markup or better: code. And code is software.-At least in my humble opinion.\n\n"
    },
    {
      "time": "12 Feb 2009 — 2:38am",
      "content": "Vertex:\n\n\\> And code is software\n\nDa Sie Österreicher sind, zitiere ich das österreichische Urhebergesetz:  \n<cite><br>\n§ 2. Werke der Literatur im Sinne dieses Gesetzes sind: 1. Sprachwerke aller Art einschließlich Computerprogrammen (§ 40a);<br>\n...<br>\n§ 40a. (1) Computerprogramme sind Werke im Sinn dieses Gesetzes, wenn sie das Ergebnis der eigenen geistigen Schöpfung ihres Urhebers sind.<br>\n</cite>  \nDamit gelten meine urheberrechtlichen Erläuterungen\n\n[http://www.sanskritweb.net/forgers/computerprogramm.pdf](http://web.archive.org/web/20131017043015/http:/www.sanskritweb.net/forgers/computerprogramm.pdf \"http://www.sanskritweb.net/forgers/computerprogramm.pdf\")\n\nauch für Österreich.\n\nVerwenden Sie bitte nicht das unklare Wort \"Software\", denn das österreichische Urhebergesetz spricht von \"Computerprogramm\", nicht von \"Software\". (Das amerikanische Urhebergesetz spricht übrigens auch nicht von \"software\", sondern nur von \"computer program\".)\n\nUmstritten ist beispielsweise, ob die Hints von PS und OTF fonts als Computerprogramm einzustufen sind. Aber selbst, wenn man sie als solche einstuft, scheitert die Schutzfähigkeit derselben daran, daß sie **nicht**\"das Ergebnis der **eigenen** geistigen Schöpfung ihres Urhebers sind\".\n\nWenn man z.B. Adobe-AFDKO startet und dann\n\nautohint -a AGaramondPro-Regular.otf\n\neingibt, wird dieser OTF-Font automatisch gehintet. Aber diese Befehlzeile ist keine \"eigene geistige Schöpfung ihres Urhebers\", und folglich sind die Hints bei sämtlichen Adobe-Fonts nicht urheberrechtlich geschützt, weil sie allesamt automatisch generiert wurden.\n\n"
    },
    {
      "time": "12 Feb 2009 — 3:26am",
      "content": "Moderator?\n\n"
    },
    {
      "time": "12 Feb 2009 — 1:49pm",
      "content": "Do any of our moderators sprechen sie argumentative bullschtt?\n\n"
    },
    {
      "time": "12 Feb 2009 — 1:57pm",
      "content": "In TV the metaphor for going too far is called jumping the shark. At Typophile it's called Uli interprets the law.\n\n"
    },
    {
      "time": "12 Feb 2009 — 10:54pm",
      "content": "Stumbling across this post counts as my weekend abroad. I \"hear\" foreign languages spoken with verbosity, I witness possible illicit activities and I enjoyed all while drinking.\n\nThanks for the trip, expect postcards.\n\n"
    },
    {
      "time": "13 Feb 2009 — 12:48am",
      "content": "\\> argumentative bullschtt\n\nIn order to prove that EULAs are \"argumentative bullschtt\" designed to deceive gullible font buyers, I sent various font orders to managers and lawyers of various font houses requesting them to fill in the accompanied affidavit form:\n\n**Affidavit:**\n\nThis is to certify that \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_, called \"font software\" in the EULA, is a computer program, i.e. a set of statements, as defined by the Copyright Law, that the source code of this set of statements was written by \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_, and that this \"font software\" is protected by copyright.\n\nI solemnly swear that the foregoing statements are true and correct to the best of my knowledge and belief.\n\nSignature of \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nNone of the managers and none of the lawyers of font houses certified that the \"font software\" is protected by copyright.\n\nThis means that the font EULA is \"argumentative bullschtt\" drafted by lawyers for the purpose of deceiving dimwitted, gullible font buyers, who are expected to certify via EULA that fonts are protected by copyright, while the managers of font houses and their lawyers would never certify that fonts are protected by copyright.\n\n"
    },
    {
      "time": "13 Feb 2009 — 1:10am",
      "content": "Definitively certifiable.\n\n"
    },
    {
      "time": "13 Feb 2009 — 1:51am",
      "content": "\\>Definitively certifiable\n\nGood pun.\n\nFor example, the Linotype lawyers request \"certifiable\" font buyers to certify this legal \"bullschtt\":\n\n<cite>\"3.2 The licensee agrees that the Font Software and documentation, and all copies thereof, are owned by Linotype GmbH; and its design, structure, organization and encoding are valuable property of Linotype GmbH and/or its suppliers. The licensee agrees that the Font Software and documentation are protected by German trademark and design patent laws, by the copyright and trademark laws of other countries, and by international treaties. In addition, the licensee agrees to treat the Font Software and documentation in the same manner corresponding to other copyrighted and trademark-protected products, e.g., books. With the exception of the points explicitly mentioned here, copying the Font Software and documentation is not permitted. Any and all copies that the licensee is permitted to produce on the basis of this agreement have to have to contain the same copyright, trademark and other property clauses as those on or contained in the Font Software and documentation. The licensee declares not to modify, adapt or translate the encoding of the Font Software, nor reproduce, decompile, disassemble, change, modify or otherwise attempt to reveal the source code of the Font Software.\"</cite>\n\nBut the Linotype lawyers would never certify this legal \"bullschtt\".\n\n"
    },
    {
      "time": "13 Feb 2009 — 4:23am",
      "content": "There we go again (rolls eyes).\n\n"
    },
    {
      "time": "13 Feb 2009 — 7:53am",
      "content": "A non-freeware or non-shareware font is uploaded in violation of its user agreement, which prohibits illegal distribution. Similarly, when it is downloaded and used, the user agreement is violated.\n\nNo police or recourse will likely occur, unless there is substantial business being made.\n\nMost designers and font makers make very little money with this kind of software. Such illegal action causes them to make even less.\n\nIn Orthodox Judaism, such illegal conduct has brought respondsa from leading Rabbinic authorities prohibiting explicitly this action. As a result, ones share in the world to come is jeopardized. Imagine for a $25 to $50 cost, the resulting transgression may cause a person to forego \"heaven\" and receive instead time in \"hell\".\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:21am",
      "content": "Israel, very well put. A person's **font sins** will catch up with them in this life or the next. Those of us with font sins in our past make atonement by endlessly contributing to typophile threads like this one.\n\n"
    },
    {
      "time": "13 Feb 2009 — 9:47am",
      "content": "And if I release a sins serif design, will this assure my place in heaven?\n\n"
    },
    {
      "time": "13 Feb 2009 — 10:05am",
      "content": "@sii - endlessly? or needlessly?  \n@speter - shouldn't that be \"sans sins serif\"? I think \"sins serif\" would be a bit warmer!\n\n"
    },
    {
      "time": "13 Feb 2009 — 10:19am",
      "content": "Cool, I'm atheist. I wasn't going to heaven anyways. Off to download illegal stuff!...\n\n"
    },
    {
      "time": "13 Feb 2009 — 11:20am",
      "content": " ![](http://web.archive.org/web/20131017043015im_/http:/typophile.com/files/leviticus_5952.png)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131017043015/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    },
    {
      "time": "13 Feb 2009 — 11:32am",
      "content": "Ivan, your copy is surely suspect. I believe the original says: \"...they shall stone them with Stone Sans...\"\n\n"
    },
    {
      "time": "13 Feb 2009 — 11:41am",
      "content": "\\>Cool, I’m atheist.\n\nI did say this life or the next. The type gods walk among us.\n\n"
    },
    {
      "time": "13 Feb 2009 — 11:45am",
      "content": "And as we stand on their shoulders we're somewhat in a precarious position.\n\n"
    },
    {
      "time": "13 Feb 2009 — 11:57am",
      "content": "Steve:  \nDepends on the translation. The twelfth ecumenical council passed a retroactive ruling that effectively removed all mentions of StoneSans, making any further (or prior) references to it tantamount to heresy.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131017043015/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "13 Feb 2009 — 11:58am",
      "content": "Uli standeth on the shoulders of a dwarf! A very small, diminutive dwarf of no particular influence whatsoever.\n\nHere endeth the leththon! (fack-fack-fack-fack-fack! quack-quack-quack! Quack-facker. Uli need him a psyche doktor. Yah boo, we think yoo stink, hehe! And it vewy vewy funnaye.)\n\nYou have just witnessed an ad hominem attack.\n\nMoo. I been entertained. Hello I must be going etcetera.\n\nj a m e s\n\n"
    },
    {
      "time": "13 Feb 2009 — 12:51pm",
      "content": "Perhaps I will publish my correspondence with major font sellers at my website. Look, for example, at Linotype and Monotype:\n\nHow come that neither Jan Kaestner as the \"European Legal Counsel\" nor Frank Wildenberg as the \"General Manager\" of the Linotype GmbH had the courage to certify what they expect font buyers to certify by way of EULA? The answer is quite simple: If Jan Kaestner and Frank Wildenberg certified that the fonts sold by Linotype and Monotype are copyright, they would commit the crime of false affidavit, and therefore they are frightened to make the false statement that the fonts they sell are copyright. But they still expect their font buyers to make this false statement via EULA.\n\n"
    },
    {
      "time": "13 Feb 2009 — 2:43pm",
      "content": "Uli, what will happen to all the little people like me (independent type founder, designer of original typefaces) when you have blown down this house of cards?\n\n"
    },
    {
      "time": "13 Feb 2009 — 3:46pm",
      "content": "If this happens, I suppose we'll have to stop appealing to non-enforceable laws, and concentrate on basic human decency, values of good craftsmanship and personal dignity. Yeah..that's gonna work...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131017043015/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "13 Feb 2009 — 6:38pm",
      "content": "(sorry) get to repost.\n\n ![](http://web.archive.org/web/20131017043015im_/http:/typophile.com/files/repost_3981.jpg)\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:04pm",
      "content": "\"they shall stone them with Stone Sans\"\n\nLMAO!\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:40pm",
      "content": "We'll never get anywhere arguing over the legality of piracy with people who believe the inherent basis of licensing is extralegal.\n\nWhy not use an ethical argument instead? For any even slightly ethically consistent human being, ethics are - or should be - INFINITELY more important than the legality of any particular practice.\n\nIf you think it's ethical to, for personal entertainment or material enrichment, take the fruit of another's labor without remuneration, then I'm afraid that you are a stunted and malformed human being who can never truly appreciate the work of another individual.\n\n"
    },
    {
      "time": "13 Feb 2009 — 10:10pm",
      "content": "_And if I release a sins serif design, will this assure my place in heaven?_\n\nSteve, I hear that [indulgences are once again available](http://web.archive.org/web/20131017043015/http:/www.nytimes.com/2009/02/10/nyregion/10indulgence.html?em)... Much easier than designing a typeface sans sin. ;-)\n\n"
    },
    {
      "time": "13 Feb 2009 — 10:13pm",
      "content": "[Doritos, fonts, what's the dif?](http://web.archive.org/web/20131017043015/http:/www.youtube.com/watch?v=VILrWeO5QYs)  \n.\n\n-=®=-\n\n"
    },
    {
      "time": "13 Feb 2009 — 10:34pm",
      "content": "jlt:\n\n\\> <cite>If you think it’s ethical to ... take the fruit of another’s labor without remuneration ...</cite>\n\nThat's what's done by the major font sellers. Most font designers receive no royalties at all for the fonts sold by Linotype, Monotype, Berthold, etc. If fonts were copyrightable, then even decades after the designers's death, their heirs could claim royalties. But neither Max Miedinger nor his heirs receive royalties from Linotype for the sale of Helvetica. This means that Linotype, Monotype, Berthold, etc. <cite>\"take the fruit of another's labor without remuneration\"</cite>, as you put it. There are exceptions to this rule (Adrian Frutiger, Hermann Zapf, etc.), but for more the majority of fonts sold by Linotype, Monotype, Berthold, etc., this rule is valid.\n\n"
    },
    {
      "time": "14 Feb 2009 — 1:53am",
      "content": "@Ricardo: \"... indulgences ...\"\n\nWhat a hoot! Nearly spilled my morning coffee while laughing.\n\n"
    },
    {
      "time": "14 Feb 2009 — 10:05am",
      "content": "Nice initials, rcc! ;-)\n\nGetting back to indulgences... Where's [Martin Luther](http://web.archive.org/web/20131017043015/http:/en.wikipedia.org/wiki/Martin_Luther) when we need him?\n\nRC\n\n"
    },
    {
      "time": "14 Feb 2009 — 5:15pm",
      "content": "Laurentius,\n\nThe short answer to your question is, yes.\n\nUsing stolen property, transporting stolen property, or passing on stolen property is against the law. Like any lawbreaker, sometimes you get caught, sometimes you don't.\n\nChrisL\n\n"
    }
  ]
}
