{
  "id": "5471",
  "title": "Futura-inspired geometric sans",
  "forum": "Design",
  "tags": [

  ],
  "content": "I've been sketching on a typeface that is pretty heavily inpsired by Futura, but at the same time completely different. It will be elegant yet futuristic.   \n   \nBut has it all been done already? There's only so many ways you can design a simplistic single-story geometric sans 'a' that you can design. And would it be considered plagiarism if some of the glyphs share common features?   \n   \nI think, pretty much, that subconsciously I just want someone to give me an okay (\"go and do it\") before I can start on this project. =)   \n   \nThanks!   \n   \n   \nP.S. How long do typeface copyrights last?\n\n [‹ American Arlines using Sophisto for their magazine???](http://web.archive.org/web/20081121104859/http:/www.typophile.com/node/13223 \"Go to previous forum topic\") [Looking for reversed out versions of Helvetica and Garamond ›](http://web.archive.org/web/20081121104859/http:/www.typophile.com/node/13018 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121104859/http://www.typophile.com/user/3247\" title=\"View user profile.\">antiphrasis</a>",
  "time": "<br>",
  "uid": "3247",
  "comments": [
    {
      "time": " 3.Jul.2004 11.34am",
      "content": "In the USA, as far as I know, copyright applies to the font software, not the typeface design. You can trademark the name, and you can register a design patent for the design. However, registering patents and trademarks costs money, and even if you get a design patent it will cost more money to enforce it.   \n   \nSpeaking as somebody who has recently designed a sort-of-geometric sort-of-sans serif typeface, I think there's still room for original design in this area. Of course, I went for a two-story \"a\"....   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 3.Jul.2004 12.04pm",
      "content": "Thomas,   \n   \nThank you so much for your help. That's all the push I need. I think I will try to step away from Futura though, there are several Futura-inspired typefaces already... Avant Garde and Century Gothic to name a few.   \n   \nWhat I think I would want to create in my typeface is a sense of simplicity... something that could have been easily drawn using a stroke or two, but at the same time have a quality that says \"I wish I could've thought of that\".   \n   \nI will start working on the font and use it in my own work, and maybe put it on myfonts if it looks okay. Because I know I would get a kick out of it if I saw other people using it as well.   \n   \nThomas, thanks again. I admire your work a lot!\n\n"
    },
    {
      "time": " 3.Jul.2004 12.06pm",
      "content": "Thomas,   \n   \nI forgot to ask. Did you publish that creation of your anywhere? I'd be curious to see what it looks like.   \n   \nThanks!\n\n"
    },
    {
      "time": " 3.Jul.2004 12.16pm",
      "content": "\\> I would want to create in my typeface is a sense of simplicity...   \n\\> something that could have been easily drawn using a stroke or two,   \n   \nA stroke or two but which tool with, Mr. Lauri Johnsen?\n\n"
    },
    {
      "time": " 3.Jul.2004 2.02pm",
      "content": "Lauri:   \n   \nWhich work are you speaking of? I'm wondering if perhaps you have me confused with somebody else? My actual type design work has been seen by hardly anybody; most people know me mostly as a technical guy and occasional writer. This is not an entirely bad thing, since most of my early type design attempts were pretty uninspired. ![:-)](http://web.archive.org/web/20081121104859im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nHowever, my latest typeface is not too bad, and will be released as an Adobe Original in, oh, maybe 5-8 months? The upright Latin portions are pretty much done, but I have more grunt work to do on the italics (though the Latin italic designs are pretty much locked down), the Cyrillic still needs some work, and the Greek is only now starting to not suck too badly.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 3.Jul.2004 4.24pm",
      "content": "\\>and the Greek is only now starting to not suck too badly. \\<   \n   \nThomas,   \nJust spray some Windex on it :-)\n\n"
    },
    {
      "time": " 3.Jul.2004 7.35pm",
      "content": "Alessandro,   \n   \nI was thinking of using an even stroke for this typeface... not sure what real-life tool that what require. =)   \n   \nBTW: Thanks for calling me mister, people usually think I am of the female gender because of my name.\n\n"
    },
    {
      "time": " 3.Jul.2004 7.41pm",
      "content": "Thomas,   \n   \nI was mostly referring to your cool career, being the head typography honcho at Adobe and being active in the typography circuit. I haven't seen any of your typefaces though, I'd be very interested in seeing what your geometric sans looks like.   \n   \nThanks.\n\n"
    },
    {
      "time": " 4.Jul.2004 10.14am",
      "content": "Ah, well thanks then!   \n   \nBut, my job title notwithstanding, I'm not really the head typography honcho at Adobe. IMO, the closest you'd come to that is David Lemon, who manages the type group at Adobe. Now, that being said, there are really three independent reporting structures, so I guess you could say that between David (engineering), Harold Grey (marketing) and me (program management), we run the joint. But Harold and I don't have anybody who reports to us, so I dunno.   \n   \nI look forward to being able to show the typeface formerly known as Geode publicly, but it is not currently scheduled. Frankly, we have a number of more impressive releases slated ahead of it, such as the new \"Pro\" version of Bickham Script, Robert Slimbach's new \"Garamond Premiere,\" and another new design of Rob's we haven't even talked about yet.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 4.Jul.2004 10.24am",
      "content": "BTW, one random piece of advice: geometric typefaces are rarely \"really\" geometric. They still have all the same kinds of optical compensation found in other typeface designs. Or at least they usually do if they're any good. So circles are rarely circular but are slightly taller than wide, vertical parts are a little thicker than horizontals, all that usual stuff.   \n   \nIn this regard, it's quite interesting to study the difference between the drawings Paul Renner did for Futura, and what Bauer did with them to make a real typeface.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 4.Jul.2004 11.20am",
      "content": "Thomas,   \n   \nThanks for the great advice. I was debating with myself whether or not to optically compensate the typeface or not. Aesthetic side of me won over my mathematical side that prefers everything to be even and square (and never crossing the lines, as in the 'o' crossing the baseline). I just have to fight the instinct. =)   \n   \nI've read Paul Renner: The Art of Typography by Burke (well, mostly looked at the pretty pictures), and I was amazed by his drawings. The early renderings for Futura were really groundbreaking. He had some really nice alternative characters, many looking stencilized. I'm not really familiar with Bauer though, is that the same guy who did Bauer Bodoni?   \n   \nLooking forward to seeing Geode and Garamond Premiere.   \n   \nBy the way happy 4th to everyone here in the US.\n\n"
    },
    {
      "time": " 5.Jul.2004 7.39am",
      "content": "Bauer was, at the time Futura's release, one of the largest German type foundries. They had offices all over Europe, but I think that their headquarters was in Frankfurt. They no longer exist as a unified company, but one of their subsidiaries is still chugging along in Barcelona.   \nThey own the name and the trademarks, etc\n\n"
    },
    {
      "time": " 5.Jul.2004 12.07pm",
      "content": "Dan,   \n   \nThanks for the history lesson. It was very informative. I guess there's a good reason why I associated Bauer with Bodoni. I'll also check out myfonts.   \n   \nThanks!\n\n"
    },
    {
      "time": " 5.Jul.2004 12.34pm",
      "content": "Chris: Thanks for the Windex suggestion. My Greek is now squeeky-clean!   \n   \nLauri: You really do have to do the optical compensation stuff. If you don't, the typeface will just look \"wrong.\" Futura would have been a flop if Bauer had just cut Renner's original drawings.   \n But obviously you understand this already.   \n   \nBauer Bodoni was the best of the early 20th-century Bodonis. However, personally I give ITC Bodoni the nod as being the best Bodoni revival as far as what's available in digital form today.   \n   \nI used to not think much of Bodoni, based on the crummier digital versions kicking around. But my perspective changed dramatically when I first got to look through an original copy of Bodoni's \"Manuale Tipografico\" about 9 years ago. It's just a stunning piece of work, and really shows off his original metal type designs to their best advantage. His original types had a number of subtleties not found in most revivals, and the letterpress printing process on the softer papers of the time really softened and warmed the lines that so often seem harsh and cold in digital versions today.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 5.Jul.2004 12.54pm",
      "content": "If you are interested, a very nice CR-Rom on Bodoni's works   \nhas been published by the Public Library of Saluzzo,   \nVia Volta 39, I-12037 Saluzzo (Cuneo) - Italy.   \nFax: +39 0175 211328\n\n"
    },
    {
      "time": " 5.Jul.2004 6.41pm",
      "content": "Thomas,   \n   \nMaybe it's time for Adobe Bodoni Pro? ;)   \n   \nI was comparing the sketches of my typeface to some geometric sans faces at myfonts and I discovered that ITC Ronda had some of the same features that I had drawn. Darn Herb Lubalin beat me to it. ;) I will have to modify my sketches further. I think this will be a fun project and I intend to finish it, one way or another.   \n   \nThanks!\n\n"
    },
    {
      "time": " 5.Jul.2004 7.08pm",
      "content": "The book Thomas is talking about is also available as a very nice PDF at:   \n [http://www.octavo.com/collections/projects/bodtip/index.html](http://web.archive.org/web/20081121104859/http:/www.octavo.com/collections/projects/bodtip/index.html)   \n   \nI don't know if this is the same one Alessandro is talking about.   \n   \nChrisL\n\n"
    },
    {
      "time": " 6.Jul.2004 3.25am",
      "content": "Amazing link, thnx for that Mr. Chris Lozos,   \nyes, that is the book I was talking about,   \nwhich is one of the works by Bodoni   \nshown in the CD-rom.   \n ![](http://web.archive.org/web/20081121104859im_/http:/www.typophile.com/forums/messages/4100/39992.gif)\n\n"
    },
    {
      "time": " 11.Jul.2004 9.11pm",
      "content": "Here's a sample of the typeface I am working on. It's turning out to have some humanistic forms. This is only a sketch... I know there's some major issues I have to work on. More optical adjustments, the loop on the 'f' should lean more to the left, the way the line connects to the circle in the 'p' should be a lot softer, the 'e' needs the angled cut, etc, etc. This is just to show where the typeface is heading.   \n   \nAny feedback is appreciated. Thanks!   \n   \n ![sample letter of typeface](http://web.archive.org/web/20081121104859im_/http:/www.typophile.com/forums/messages/4100/40393.gif)\n\n"
    },
    {
      "time": " 12.Jul.2004 1.55am",
      "content": "Hmmm. Interesting. The diagonal cut stroke ends are interesting, and give it a more playful feel, making it feel less harsh than, say, Bauhaus or some of the other faces that have some of the same design principles. Definitely going to be a display face, though!   \n   \nLots of optical fixing needs to happen, but it's kinda cute so far. One shape that just fundamentally isn't working for me is the \"y,\" though. Also, the \"m\" seems awfully narrow. Not that it should be twice as wide as the \"n,\" but it should definitely be noticeably wider than the \"n\" in a geometric face like this. (Same for the \"w.\")   \n   \nAnyway, that's my two cents. I'll be interested to see the next rendition....   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 12.Jul.2004 11.41am",
      "content": "Thomas,   \n   \nThank you for your feedback. I really appreaciate it. I will fix the widths of 'm' and 'w'. Yeah, the 'y' does look a little bit weird. I was experimenting to see how many shapes I could reuse. For example: 'b' -\\> 'd', 'p', and 'q'; 'm' -\\> 'w'; 'f' -\\> 't'; and I was playing around with 'h' -\\> 'y'.   \n   \nYou're right, this is turning into a display face. I was thinking of maybe having a diagonal crossbar on the 'e', but I'm not sure about that yet. Also, I'm not really sure how to approach the the uppercase letters since I want the same soft feel to them, and uc's are often \"harder\". I'm also planning to have several weights of the typeface...starting from really light.   \n   \nBut I have to take a break from the development for a couple of weeks, I'm going on a tour with a band as a stage manager (nice way of saying \"roadie\"). I will post a thread in the critique section when I have at least a full lowercase character set, and and when I've done the modifications you suggested.   \n   \nThanks!\n\n"
    },
    {
      "time": " 26.Apr.2005 5.32am",
      "content": "can anyone help me?   \n   \ni am currently trying to research the field of dyslexia and typefaces available for dyslexic people. i was wondering if anyone would know where i would be able to obtain information on what would be required to make the face more legible for a dyslexic person... what the lengths of ascenders and descenders should be, for example, and how symetry effects the way the typrface is read.   \n   \nmany thanks,   \n   \nleigh middleton.\n\n"
    },
    {
      "time": " 26.Apr.2005 6.10am",
      "content": "that probably dererves it's own thread, leigh...   \n   \nbut, now that I've discovered this thread, I wonder if anyone has a current link to (or could email) that Bodoni PDF... the above link no longer works. :-(\n\n"
    },
    {
      "time": " 26.Apr.2005 6.18am",
      "content": "\\> ah, ok. How do I create a thread? Thanks. How do I create a thread?\n\n"
    },
    {
      "time": " 21.Jun.2005 9.38am",
      "content": "No one has written here for a while but I was reading it and went to the link and you cannot find the Manuale tipografico as PDF there anymore.  \n [http://www.octavo.com/collections/projects/bodtip/index.html](http://web.archive.org/web/20081121104859/http:/www.octavo.com/collections/projects/bodtip/index.html \"http://www.octavo.com/collections/projects/bodtip/index.html\")\n\nDoes anybody knows where to find it as PDF?\n\nThanks\n\nJason\n\n"
    }
  ]
}
