{
  "id": "54728",
  "title": "So I guess this is what they call notan",
  "forum": "nina's blog",
  "tags": [

  ],
  "content": "Not directly type related: I visited an exhibition of African & Oceanic Arts at [Fondation Beyeler](http://web.archive.org/web/20131023190541/http:/www.beyeler.com/fondation/e/html_11sonderaus/01_aktuelle/intro.htm) today and was stunned by these anthropomorphic figures from Papua New Guinea alternately called _yipwon_ or _aripa_.  \nTheir proportions are a bit impractical for the web. :-)\n\n ![](http://web.archive.org/web/20131023190541im_/http:/typophile.com/files/yipwon_3542.jpg)\n\nThey're fairly large, some almost life-size, some even slightly taller; and the ones I saw were between 200 and (probably) close to 500 years old. According to this little leaflet I got at the exhibition, these figures were supposed to (spiritually) help the hunt; they are embodiments of spiritual beings moving back and forth between the spheres of the real and the spiritual, and (this is not in the leaflet) their formal execution seems to echo this (non-exclusive) duality by making the \"empty space\" just as palpable as the \"real material\", giving equal value to the tangible and the imagined. They're thereby also implying impressive volume while in fact they're usually fairly two-dimensional (this is in the leaflet again).\n\nI tried to find a book on these, but books on Oceanic Art seem to treat these figures rather marginally, and the exhibition catalog was prohibitively expensive. :-| Does anyone know about these? There isn't even a Wikipedia page.\n\nBy the way, being in a museum that usually shows modern art, the exhibition combined these figures with Matisse paintings hung in the same room. I couldn't help but feel his modern treatment of the white (like here in [\"Algue blanche sur fond rouge et vert\"](http://web.archive.org/web/20131023190541/http:/www.passion-estampes.com/deco/affiches/matisse/matissealgueblanche.jpg)) feels strangely forced in comparison with the gracious whitespace in the yipwon.\n\nMore yipwon pictures:  \n(Googling for those is… funny.)  \n [Ego Design: Oceania](http://web.archive.org/web/20131023190541/http:/www.egodesign.ca/fr/article.php?article_id=342&page=3)  \n [Metropolitan Museum](http://web.archive.org/web/20131023190541/http:/www.metmuseum.org/toah/ho/10/ocm/ho_1978.412.854.htm)  \n [French Encarta](http://web.archive.org/web/20131023190541/http:/fr.encarta.msn.com/media_461550081_761572534_-1_1/Yipwon_(Papouasie-Nouvelle-Guin%C3%A9e).html)  \n [Denver Art Museum](http://web.archive.org/web/20131023190541/http:/www.denverartmuseum.org/explore_art/collections/objectDetails/objectId--104907)  \n [Michael Hamson Oceanic Art](http://web.archive.org/web/20131023190541/http:/www.michaelhamson.com/Sept-06158.htm)\n\n",
  "author": "nina",
  "time": "12 Feb 2009 — 4:41pm",
  "uid": "13487",
  "comments": [

  ]
}
