{
  "id": "54725",
  "title": "(x) Hans Ulrich Obrist / Bob Nickas / serif - Genath {self (Jelmar)}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Wondering what the serif is. Probably really obvious... but I can't seem to ID it.\n\n ![](http://web.archive.org/web/20131010224352im_/http:/typophile.com/files/BC_brief_01_4465.jpg)\n\n ![](http://web.archive.org/web/20131010224352im_/http:/typophile.com/files/BC_nickas_01_5929.jpg)\n\nMore samples: [Documents Series](http://web.archive.org/web/20131010224352/http:/www.jrp-ringier.com/pages/index.php?id_r=4&id_t=&id_p=18).\n\n",
  "author": "Quincunx",
  "time": "12 Feb 2009 — 3:05pm",
  "uid": "14604",
  "comments": [
    {
      "time": "12 Feb 2009 — 3:13pm",
      "content": "The 'a' and 'N' is a but wacky to me. You sure it's not customized?\n\n"
    },
    {
      "time": "12 Feb 2009 — 3:17pm",
      "content": "Looks like a Fleischmann revival. But which one?\n\n"
    },
    {
      "time": "12 Feb 2009 — 3:21pm",
      "content": "Stephen: I've no idea if it's customized or not.\n\nJan: Yeah, WhatTheFont did spew out a few Fleischmann's, but not this one.\n\n"
    },
    {
      "time": "12 Feb 2009 — 3:24pm",
      "content": "The italic \"y\" is very unique, with the descender out of the left stroke.\n\n"
    },
    {
      "time": "12 Feb 2009 — 10:13pm",
      "content": "that \"y\" looks like DTL Fleischmann but the serifs on the caps (even the display caps) are different. I agree with Stephen..the N & the a look way out.\n\n"
    },
    {
      "time": "13 Feb 2009 — 8:07am",
      "content": "I think that N is fantastic! :)\n\nThe a does look a bit like the odd one out -- compared to the other Fleischmann's out there -- although I think it's not really a problem.\n\nI will e-mail the publisher / designer about it later today if no one can find it here. :)  \nDoesn't happen often that there is no ID on the forum :P\n\n"
    },
    {
      "time": "13 Feb 2009 — 1:37pm",
      "content": "This is an odd creature. Many of the letterforms seem like Garamond to me, particularly the 'a', but that 'y'seems to be only in Fleischmann. There are four other fonts that Yves once wrote were based on Fleischmann: Mercury by Schwartz, Farnham by Highsmith, Fenway by Carter, and Eudald by Feliciano. From what I could see of them, at least the first three do not have that italic 'y' (I did not have an italic sample for both Eudald versions).\n\nThis seems like a new font to me, so I will be curious to hear what you learn from the publisher.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "13 Feb 2009 — 3:55pm",
      "content": "Mercury by Hoefler and Farnham by Schwartz, that is ;-)\n\n"
    },
    {
      "time": "13 Feb 2009 — 4:31pm",
      "content": "LOL..I'm curious too! The \"odd-ness\" is beginning to grow on me...:)\n\n"
    },
    {
      "time": "13 Feb 2009 — 7:26pm",
      "content": "Jan, Of course, you're right. I wrote down the font names from Yves article, but didn't write the designers. I recalled badly, as often happens at my age.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "14 Feb 2009 — 10:08am",
      "content": "I have e-mailed the publisher about this one. I'll post later if I get a reply.\n\n@Mike: yes, some of the letters remind me of Garamond as well. I would be surprised, though, if this would turn out to be a hodge-podge.\n\n"
    },
    {
      "time": "15 Feb 2009 — 5:06am",
      "content": "Who is the designer?\n\n"
    },
    {
      "time": "16 Feb 2009 — 5:56am",
      "content": "I e-mailed the publisher, and he told me the typeface is called Genath, designed by [François Rappo](http://web.archive.org/web/20131010224352/http:/www.identifont.com/show?L7G), who also designed [La Police BP](http://web.archive.org/web/20131010224352/http:/www.bpfoundry.com/fonts/cuts.htm?font=1).\n\nI can't find anything about Genath, though, so it might be that it isn't available commercially (yet).\n\n"
    },
    {
      "time": "17 Feb 2009 — 12:26am",
      "content": "Rats... Keep your finger's crossed:D\n\n"
    },
    {
      "time": "18 Feb 2009 — 2:49pm",
      "content": "I tried to post on this a few days ago, and I see it never made it (my internet connection has been flaky recently). In an odd (probably not) coincidence, François Rappo has designed fonts for Optimo, and Optimo has a serif family called Stockmar that is based on a design of Johann Rodolf Genath, done by Matthieu Cortat. One of the italic versions of Stockmar has a y quite like the odd one we have been commenting about. I have samples in my [Serif Font ID Guide](http://web.archive.org/web/20131010224352/http:/www.bowfinprintworks.com/SerifGuide/serifsearch.php). You can search by designer, as well as font name.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "18 Feb 2009 — 2:51pm",
      "content": "I should add that Stockmar is NOT the font we have been looking at. The serifs are quite different for one thing, but there is a sort of family resemblance.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "18 Feb 2009 — 3:20pm",
      "content": "Very zainy lowercase a kinda rocks. I love the lowercase italic g— very sweet.\n\n"
    },
    {
      "time": "18 Feb 2009 — 5:03pm",
      "content": "LOL @ Mike...I went to Optimo too! But it was based on the face that publishing company's logo was in Didot Elder...I thought why not give it a try..but of course..there wasn't a match.\n\n"
    },
    {
      "time": "18 Feb 2009 — 8:05pm",
      "content": "Thanks Mike, that [Stockmar](http://web.archive.org/web/20131010224352/http:/www.chastellun.net/nonpareille/en/typefaces/stockmar-en.html) is interesting. Especially the resemblance in that italic y is nice to see. I think Genath is more balanced and refined though.\n\nLet's hope Genath will be available for license someday, it's definitely a typeface I would use.\n\n"
    },
    {
      "time": "20 Feb 2009 — 9:45am",
      "content": "Genath is my free, simple rendering of a baroque type from the Genath Foundry in Basle, Switzerland. It's based on a 1720 specimen likely showing Johann Wilhelm Haas first design in Basle. Haas, Basle, the foundry produced two centuries later a better known typeface.\n\nLike JM Fleischmann, JW Haas (1698-1764) was trained in Nürnberg, probably by Johann and Pankraz Lobinger. Both Fleischmann and Haas epitomize a consistent typographic style, specific to Northern Europe. Spreading from Prague to, some extend, London. Truely ‘baroque’, slightly condensed, highly contrasted, with playful, fancy details.\n\n(All my informations about Genath and Haas come from: Albert Bruckner ‘Schweizer Stempelschneider und Schiftgiesser’ Benno Schwabe, Basle, 1943.)\n\nGenath is still a private font, but following the interest of Gilles Gavillet and David Rust (Optimo, Geneva) the designers of the JRP Ringier book collection, I will probably release it in a near future.\n\n-François Rappo\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:25pm",
      "content": "François\\>\\>\\>\n\nI love your La Police and Genath is truly special as well. It happens to function well at both at display _and_ text sizes.\n\nCongrats and I {we} look forward to when you release it for mass consumption!\n\nMikey :-)\n\n"
    },
    {
      "time": "20 Feb 2009 — 6:08pm",
      "content": "Thanks for the infomation François. I should have linked to this thread in the short e-mail correspondence I had with Gilles Gavillet, which was CC'd to you. I forgot, but good to see that you found it.\n\nJust as Mike above me, I'm looking forward to when it is released as well!\n\n"
    },
    {
      "time": "5 Nov 2009 — 4:45am",
      "content": "Anyone knows when will Genath be released? I'm looking forward too...\n\n"
    },
    {
      "time": "5 Sep 2011 — 5:31am",
      "content": "Genath is available now.  \n [http://www.optimo.ch/typefaces.html](http://web.archive.org/web/20131010224352/http:/www.optimo.ch/typefaces.html \"http://www.optimo.ch/typefaces.html\")\n\n"
    }
  ]
}
