{
  "id": "54772",
  "title": "What to charge in this economy?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm a young designer/illustrator, and in this economy I know I can't afford to be too picky or ask for too much. I've been offered a job by a large stationery/gift packaging company that will be buying out the small company I currently work for. I'm lucky to even be offered a job as the majority of my coworkers have already been laid off at this point.\n\nI was offered a full-time salaried position nearly identical to the one I hold now, but at this point I think I would rather work as an independent contractor, negotiate a higher hourly rate and purse other freelance and personal projects at the same time. I currently feel like I am underpaid and would like to ask for more. However, I don't want to alienate the new management so I am worried about asking for too much.\n\nI know you don't know my exact situation but what would you do if you were in my shoes, my savvy fellow designers?\n\n",
  "author": "julia.warren",
  "time": "13 Feb 2009 — 1:50pm",
  "uid": "22389",
  "comments": [
    {
      "time": "13 Feb 2009 — 2:15pm",
      "content": "My advice is - take the full-time position while building up your freelance client base on the side. Then, when you have enough clients and leads make the jump. This is what I did back in 2000. Unless you're incredibly good at selling yourself, marketing and networking - which most designers aren't that great at, myself included - it will be tough getting new business right now in this economy. Good luck.\n\n"
    },
    {
      "time": "13 Feb 2009 — 2:38pm",
      "content": "Go for it. If not now, when?  \nDamn the torpedoes.\n\n"
    },
    {
      "time": "13 Feb 2009 — 4:43pm",
      "content": "It is nice to know you're having a consistent paycheck coming, though it may not be as much as you think your design is worth. Hopefully you could keep a few solid paying clients on the side if you can handle that and the full-time position.\n\n"
    },
    {
      "time": "13 Feb 2009 — 4:49pm",
      "content": "I have one ongoing freelance project currently and another strong lead for some freelance work that would require travel (although I'm not sure how consistent it would be). I am also trying to open my own design studio and build up a collection of illustration and design available for licensing. To really pursue my leads, I need more flexibility. On top of that, I already work from home and the offer with this stationery company is only guaranteed through September as the companies merge and transition. After September they could cut me loose or keep me.\n\nTo me it makes sense to contract and have my hand in other pursuits, but I guess I could be wrong. And again, I'm not sure what kind of hourly compensation to ask for if I do.\n\n"
    },
    {
      "time": "13 Feb 2009 — 5:10pm",
      "content": "Best advice I can give you is NEVER fear you're asking too much. More often than not, if you're at the point where you're discussing salaries, they want you, and will do their best to come to an agreeable salary.\n\nAlso, as a graphic designer, throughout your career you will likely work for a company, miss freelancing, so then eventually quit and freelance, then miss the paycheck and benefits, so will then go back to work for a company, and then repeat that for 40 years or so.\n\n"
    },
    {
      "time": "13 Feb 2009 — 10:28pm",
      "content": "Julia, I think that Chris K. and aluminum have both given you some good advice...\n\nI understand that as a freelance graphic designer, you can charge between 80 and 100 an hour, but I have no idea what an illustrator would charge.\n\nAlso, if this is of any help, AIGA and Aquent conduct a yearly salary survey among designers... The latest one is [here](http://web.archive.org/web/20150122202406/http:/www.aiga.org/content.cfm/salary-survey).\n\n"
    },
    {
      "time": "14 Feb 2009 — 7:23am",
      "content": "I think Chris Keegan's advice sounds good. Stay with the full-time job. You can always go freelance later. If you quit now, go freelance and it doesn't work out, it might be more difficult to get a full-time position again.\n\n"
    },
    {
      "time": "14 Feb 2009 — 7:35am",
      "content": "Given the economy, I would stick with the stationery job as long as possible while writing up a business plan, designing promotional materials, and networking. I would also spend a lot of time researching what kind of rates other local designers charge and find out if those rates are profitable, and consider whether you can survive on lower rates in a year when there are more freelancers competing and businesses have less to spend.\n\nAs for asking for more money, be very careful unless research shows that you are VERY underpaid. They can probably just drop you and hire a desperate laid-off designer/illustrator to work for even less, so you’d better have a lot to bring to the table when you start that negotiation.\n\n"
    },
    {
      "time": "17 Feb 2009 — 3:44am",
      "content": "Not too keen on offering advice, but having a reliable safety net in place seems wisest. Chris Keegan nails it re freelance-on-the-side and, typically, Ricardo's advice on salary summary is spot on. Banking on a swift economic turnaround would be foolhardy to say the least.\n\n"
    },
    {
      "time": "17 Feb 2009 — 8:17am",
      "content": "Out of curiosity, said 'larger' company wouldn't be based in MN, would it?\n\n"
    },
    {
      "time": "17 Feb 2009 — 9:16am",
      "content": "Hey, you guys are great. Thanks for the advice. I'm probably going to take the full-time position and build up my client base on the side for the next few months and see what happens! Wish me luck.\n\nNot based in MN, by the way.\n\n"
    },
    {
      "time": "17 Feb 2009 — 11:17am",
      "content": "Best wishes, Julia!\n\n"
    },
    {
      "time": "17 Feb 2009 — 1:02pm",
      "content": "Never make your employer believe that you would be prepared to work for less money or that you would think your work would not be worth more than the company is paying for it. Asking for a lot more money and then simply staying at the company with your present salary is not a credible option either. So maybe proposing to discuss your salary based on your qualifications, your actual work and responsibilities, and the economic situation of the company is the way to go, and leaves you several options how to proceed based on their response. -- cs\n\n"
    }
  ]
}
