{
  "id": "54789",
  "title": "SLANTED #8 – »2D3D«",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [patrick.s](http://web.archive.org/web/20100204121348/http:/typophile.com/user/10234 \"View user profile.\") : 14.Feb.2009 5.25am \n\n ![](http://web.archive.org/web/20100204121348im_/http:/typophile.com/files/slanted_8_call_6311.jpg)\n\nBeiträge gesucht – in Slanted Magazin #8 mit dem Thema »2d3d« wird sich alles um die Dimensionssteigerung von Linearität in den Raum und dem, was dazwischen liegt, drehen.\n\nIm Wesentlichen interessiert uns Typo & Raum in 2 verschiedenen Formen:\n\n– Einerseits das Vortäuschen einer dritten Dimension, obwohl alles immer noch im 2-dimensionalen, im flachen Raum stattfindet.\n\n– Andererseits Typografie und Grafik in der Welt um uns herum als Installation, Applikation, Architektur, Skulptur usw.\n\nWir suchen Arbeiten von Studierenden und Professionellen, die selbst etwas eigenes/interessantes zur Thematik vorschlagen möchten, etwas kennen, über etwas schreiben möchten usw. Diese können auch aus nicht-typografischen Bereichen stammen – wir sind stets daran interessiert, auch andere Bereiche der Gestaltung einzubeziehen.\n\nZusätzlich stellen wir in der Rubrik Studienarbeiten/Typostories interessante Studienprojekte und Diplomarbeiten vor, die nicht notwendigerweise zum Thema passen müssen – Einreichungen willkommen!\n\nBitte sendet eure Vorschläge in Form von visuellem Material (bitte als Ansichts-pdf) und einer kurzen Beschreibung bis einschließlich Sonntag, 05. April 2009 an magazine(at)slanted.de. Nach Einsendeschluss wird das Material von uns gesichtet – ihr werdet dann auch von uns per Email benachrichtigt.\n\nWir freuen uns auf eure Einsendungen!\n\nPS: Auch die Themen für #9 und #10 stehen bereits fest:  \n#9 / das Prinzip Stencil  \n#10 / Fraktur- bzw. gebrochene Schriften.  \nAufruf folgt ...\n\n--\n\nCall for entries – Slanted magazine #8 with the topic \"2d3d\" will center on a step-up of dimensions – from linearity to space and everything intermediate.\n\nBasically we are interested in type & space in two different forms:\n\n- On the one hand simulating a third dimension although everything still happens in the 2-dimensional, plain space.\n\n- On the other hand typography and graphics in the world around us in form of installations, applications, architecture, sculptures and so on.\n\nWe are looking for projects from students and professionals who want to suggest something interesting matching to our topic, like to write something about it and so on. The projects needn't to be necessarily (typo-)graphic – we are always interested in other parts of design.\n\nAdditionally we present student- and diploma-projects in our section Studienarbeiten/Typostories which needn't essentially suit to the topic of the issue – contributions welcome!\n\nPlease send your suggestions in form of visual material (please prepare screen-pdf) and a short describtion to magazine(at)slanted.de up to and including Sunday, 5th of April 2009. After that date we will spot the received material – then you will be informed per e-mail.\n\nWe are looking forward to your contributions!\n\nPS: The topics for slanted magazine #9 & #10 are fixed already:  \n#9 / principle stencil  \n#10 / black letter!  \nCall for entries follows ...\n\n ![](http://web.archive.org/web/20100204121348im_/http:/typophile.com/files/slanted_8_call_3537.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [slanted\\_8\\_call.jpg](http://web.archive.org/web/20100204121348/http:/typophile.com/files/slanted_8_call.jpg) | 49.66 KB |\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100204121348/http:/typophile.com/user/10234\" title=\"View user profile.\">patrick.s</a>",
  "time": ": 14.Feb.2009 5.25am",
  "uid": "10234",
  "comments": [

  ]
}
