{
  "id": "5479",
  "title": "Sooker",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello!   \n   \nI've been lurking for a while now, but I reckon it's finally time to subject my fonts to scrutiny.   \n   \nI've been designing fonts on-and-off (mostly off) for a few years, purely as a hobby. Most of my designs so far aren't hugely original - Sooker is my first attempt at something a little more unique. I wanted to try and create something idiosyncratic, yet legible too.   \n   \nLower and uppercase characters are complete, as well as some punctuation.   \n   \nI would be extremely grateful for any comments and feedback before I start work on the bold weight.\n\n<!--attachment: Sooker-39946.pdf*mime_pdf.gif*application/pdf*9.6*Sooker+pdf*Sooker%2epdf --><!--attachment: Sooker-39946.pdf*mime_pdf.gif*application/pdf*9.6*Sooker+pdf*Sooker%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150123133931im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Sooker pdf<br><a href=\"http://web.archive.org/web/20150123133931/http:/www.typophile.com/forums/messages/29/Sooker-39946.pdf\" target=\"_blank\"><b>Sooker.pdf</b></a> (9.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nBy the way, feel free to visit [www.andrewgraham.co.uk/type.html](http://web.archive.org/web/20150123133931/http:/www.andrewgraham.co.uk/type.html) which has some of my other attempts at typeface design.   \n   \nRegards   \nAndrew\n\n",
  "author": "andrewgraham",
  "time": "5 Jul 2004 — 10:47am",
  "uid": "4126",
  "comments": [
    {
      "time": "5 Jul 2004 — 9:44pm",
      "content": "Wow, first post and it's in the critique section...   \n   \nAndrew, this looks nice. It has a lot of stature. I like the straight sides of the letters and some glyphs like the e and the g are especially nice.   \n   \nThe cap S looks a little top heavy to my eye, maybe the top could be smaller and/or the waistline of the glyph moved up a little.   \n   \nTo get back to the e. I like it. The angled bottom on its eye is nice and the taper to the back is a nice touch. Where the taper connects to the vertical stem though it has a little blobiness. You might need to curve the stem into the intersection or employ some trapping to mitigate against this. At larger sizes, I think the eye looks a little large, but at the smaller sizes it seems to do well.   \n   \nYou might want to bring the dot on the i down a little.   \n   \nThe g seems to tip a little to the right. I'd also look at beefing up the bar on the f.   \n   \nNice work Andrew. Welcome to the forums.   \n   \nJon\n\n"
    },
    {
      "time": "6 Jul 2004 — 1:21am",
      "content": "looks good.   \n   \nthe first flaws i recognized are the t and the f. t is leaning backwards and a bit heavy on the bottom while the f is heavy on top, left curve.   \n   \nin general nice work!\n\n"
    },
    {
      "time": "6 Jul 2004 — 10:10am",
      "content": "I really like the overall feeling of the type. Jon's word stature goes a long way towards describing what's working already. It does feel as though it needs polishing everywhere. But on the other hand - I think it looks like that work would be absolutely worthwhile.\n\n"
    },
    {
      "time": "7 Jul 2004 — 1:38pm",
      "content": "....when Paralucent met Pill Gothic....Nice work, usablility a plus. Good job.\n\n"
    },
    {
      "time": "8 Jul 2004 — 4:46am",
      "content": "Hi all,   \n   \nThanks for the comments - it's gratifying to know that it's worth taking this further.   \n   \nUsability is exactly what I was striving for. The goal was to create something distinctive that could be used as body text but isn't too quirky.   \n   \nI'm trying to make the glyphs a bit more consistent at the moment (especially stroke width) and I've also toned down the t and f. It seems to work a bit better as a result.   \n   \nI will post another pdf when it's done.   \n   \nThanks everyone   \nA\n\n"
    },
    {
      "time": "6 May 2006 — 6:17am",
      "content": "After nearly two years it's probably about time I updated this thread!\n\nSince my last post, my first fonts (Exuberance and Exuberance Primary) are now commercially available from [T-26](http://web.archive.org/web/20150123133931/http:/www.t26.com/) and I've rediscovered Sooker in an effort to add to my portfolio. Sooker is now a four weight family, with italics to follow.\n\nThe spacing and kerning have yet to be completed but would be grateful for your thoughts before I continue. Who knows, it might even be ready by the end of the decade!\n\nPlease take a look at [this PDF](http://web.archive.org/web/20150123133931/http:/www.andrewgraham.co.uk/files/pdfs/SookerFamily.pdf) and feel free to give your comments.\n\nThanks in advance  \nAndrew\n\n"
    },
    {
      "time": "6 May 2006 — 7:00am",
      "content": "Just looking at the lc for now:  \nMany of the glyphs, like the \"k\"\\*, are lacking the stroke contrast that seems to be inherent to this design. Your \"g\" is wonderful (except for the weak ear) but it's out of character - in fact I would love to see a whole new font spawned from it!\n\n\\* BTW, may I ask how you drew that?\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 11:31am",
      "content": "Thanks for the comments Hrant. I'm loath to get rid of the g, but now I can see it doesn't quite gel with the rest of the font.\n\nI drew the k using the following method:  \n1) start with a letter l  \n2) copy it and rotate 40ish degrees clockwise, trim to size  \n3) copy the l in step 1, rotate 40ish degrees anticlockwise and trim  \n4) realise it doesn't look great, start panicking and move points around until I get something a bit better.\n\nI find that I rely on step 4 quite a lot when I draw glyphs!\n\nNeed a bit of help here. Where else do you suggest modifying the stroke contrast?\n\n"
    },
    {
      "time": "17 May 2006 — 11:45am",
      "content": "Actually, if you're not doing #4, there's something wrong. :-)\n\n\\> Where else do you suggest modifying the stroke contrast?\n\nGuys?...\n\nhhp\n\n"
    },
    {
      "time": "20 May 2006 — 7:22am",
      "content": "I just found this again. I agree with Hrant - the g is really interesting but that yes - it should be stripped from this font for the overall effectiveness of the face. In general I find that the face is very pleasant - suprisingly so given the lack of humanistic contrasts in general. Maybe it's just the ratios in the shapes. It's very pleasing in running text.\n\nI wonder if it would be a good idea to soften some of the more unusual features a little such as in the lower case 'e'. The pure geometry of the C is causing an illusion to my eye which makes it appear weak or wobbly. Maybe a softer join would be better. ( G too) The same contruction is used in the O of course but it doesn't bother my eye there. Probably because it is closed. The on the bottom of the Cedilla the hook could feel more exhuberant and it would feel more at home in the face I think. Same with the tail of the Q and the ear of the g. I think the % sign needs to be weightier. Now it looks indecisive. Is it mean to be a ligher weight than the other glyphs for some reason or no? It's too liminal now. The a seems like it is maybe wider than it needs to be and I wonder if the e should take some of it's flavor from the a somehow. Please take all this witha grain of salt. It's all observed on a laptop screen I have no printer where I am today. I have some spacing comments too but I would rather wait to see what you do with some of what I see as the problem glyph shapes before mentioning anything. Keep going.\n\nCheers!\n\n"
    },
    {
      "time": "21 May 2006 — 1:10pm",
      "content": "Thanks Eben - very helpful comments.\n\nPerhaps there are two coherent fonts lurking in here somewhere - a straightforward text face and something a little more suited to display. The latter could incorporate the unusual features of the a, e and, yes, that g.\n\nI think at the moment I'm trying to negotiate that thin line between producing something distinctive and producing something familiar. When can \"unusual\" be absolutely right? If I knew the answer I'd be a happy man. Anyway I shall certainly keep trying. Thanks once again for the comments!\n\n"
    },
    {
      "time": "27 May 2006 — 12:04am",
      "content": "I think your right about it being possible to make things that are both distinctive & which nevertheless work - & work well. In fact I think all really tasty/solid typographic innovation falls into this category. But it isn't easy. It seems like you are resonably close to having a viable face with Sooker that you could go for the low hanging fruit & just concentrate on testing the font really well & generally doing a solid workman like job of the thing. Which is no small feat in fact. If you do that really well then you may even create innovatiuon which is less obvious but valauble nonetheless. And then yes maybe a display font too.\n\nOn the other hand you could stick to your guns 7 work & rework the ideas until they fit into the face in a more organic way. Or you could put it down & come back when you have trained your eye further... or ....\n\nWhatever keeps you working away at type is probbably the right choice.\n\nI hope you post the next edition for us to see. Cheers!\n\n"
    }
  ]
}
