{
  "id": "54840",
  "title": "Strange Didone from \"He's Just Not That Into You\" poster",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20140724145639im_/http:/typophile.com/files/notthatintoyou_5722.png)\n\nI was staring at a poster for this movie while waiting for the subway, and was struck by the odd lowercase g, y and the slightly-off serifs on the cap C and S. Identifont and Whatthefont weren't much help, but I did learn that those lowercase oddities suggest a Vibert-influenced Didot. The closest I can find is [Ambroise](http://web.archive.org/web/20140724145639/http:/www.typofonderie.com/alphabets/view/Ambroise), but there are some definite differences (t, K, and j to name a few).\n\nAny clues? Is this perhaps a custom mash-up of Didones?\n\nThanks!\n\n—Noam\n\n",
  "author": "exfish",
  "time": "15 Feb 2009 — 4:00pm",
  "uid": "29486",
  "comments": [
    {
      "time": "15 Feb 2009 — 5:19pm",
      "content": "I was going to say [Ambroise](http://web.archive.org/web/20140724145639/http:/www.typofonderie.com/alphabets/view/Ambroise), but the lc s is not the same. I'll keep checking ...\n\n"
    },
    {
      "time": "15 Feb 2009 — 5:24pm",
      "content": "Looks like that s is probably an alternate that comes with Ambroise after all.\n\n"
    },
    {
      "time": "16 Feb 2009 — 1:01am",
      "content": "Is it? I don' see it in the PDF specimen. It's not just the s. The cap K and lc k, f in Ambroise are funky in ways that this poster is not. The lc t has a different top, the Ambroise cap G has a downward-pointing spur, and all the ball terminals in the poster feel a tad more lachrymal than your average Didone. I'm going to try getting a photo of the poster next time I take the train.\n\n—Noam\n\n"
    },
    {
      "time": "16 Feb 2009 — 1:50am",
      "content": "It's probably [Didot Elder](http://web.archive.org/web/20140724145639/http:/www.optimo.ch/pages/departement/index.php?id_categorie=1&id_font=9) from Optimo\n\n"
    },
    {
      "time": "16 Feb 2009 — 7:36am",
      "content": "@Cubic\\_DS, good call! Didot Elder accounts for those arrowhead serifs on the cap C and S. However, in the poster the lc s has lachrymal terminals on both ends, instead of an arrowhead at the top. I'm guessing the lc s is an alternate glyph. Thanks for the help, folks!\n\n—Noam\n\n"
    }
  ]
}
