{
  "id": "54841",
  "title": "Eternal (New Thread)",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi\n\nI thought fellow typophiles might like to see the attached pdf for the most recent iteration of my Eternal font.\n\n ![](http://web.archive.org/web/20150417143229im_/http:/typophile.com/files/ideal_3876.jpg)\n\nI think I'm finally beginning to crack the numerals: gosh they've been a struggle!\n\nPlease feel free to crit!\n\nSpecifically I'm not sure if the small caps are dark enough.\n\nAlso, I'm wondering about certain shapes: M, B, Q, T, Z, a, f, x, y, Ae and Th.\n\nI realise some of the shapes are not merged where contours cross. Not sure what happened to the threequarters fraction. Also some of the accented characters need to be recomposed with the current base characters.\n\nIs Uhorn allowed to have its serif missing like that? Does the contextual alternate r work?\n\nDoes the spacing work? What about the smallcap spacing?\n\nThanks a lot :)\n\n| Attachment | Size |\n| --- | --- |\n| [Eternal Regular Feb 2009.pdf](http://web.archive.org/web/20150417143229/http:/typophile.com/files/Eternal%20Regular%20Feb%202009.pdf) | 480.32 KB |\n| [Eternal Regular Feb 20092.pdf](http://web.archive.org/web/20150417143229/http:/typophile.com/files/Eternal%20Regular%20Feb%2020092.pdf) | 871.1 KB |\n| [eternaldummy.pdf](http://web.archive.org/web/20150417143229/http:/typophile.com/files/eternaldummy.pdf) | 409.78 KB |\n| [alternateajry.pdf](http://web.archive.org/web/20150417143229/http:/typophile.com/files/alternateajry.pdf) | 416.59 KB |\n\n",
  "author": "Bendy",
  "time": "15 Feb 2009 — 4:20pm",
  "uid": "20652",
  "comments": [
    {
      "time": "15 Feb 2009 — 4:31pm",
      "content": "hmm..is it me or the PDF has some problems...some letters are missing.\n\nAntónio\n\n"
    },
    {
      "time": "15 Feb 2009 — 4:38pm",
      "content": "Um, not sure. It works ok for me even when restarting Internet Explorer. Anyone else got problems with the pdf?\n\n"
    },
    {
      "time": "15 Feb 2009 — 4:57pm",
      "content": "Hmm...now its OK.  \nWill check it and post my comments.\n\nAntónio\n\n"
    },
    {
      "time": "15 Feb 2009 — 7:15pm",
      "content": "Looks really elegant. Very nice.\n\nI like the Th. The leg on the M could be toned down a bit more to make it more consistent with the R or X, for example, but I do like it the way it is.\n\nI feel like the baseline is a little uneven in the text samples--the v and w seem to hang down a little too low, for example.\n\nWhy Thai?\n\n"
    },
    {
      "time": "16 Feb 2009 — 12:43am",
      "content": "Thanks for the comments. I'll check that baseline once I've printed out some larger samples, and see what can be done with the M. I wondered if it was too narrow perhaps too?\n\nHa, I thought Thai would be a big challenge, with all sorts of combining marks and interesting shapes. Also because I can speak some Thai and know the language more than others aside from English.\n\n"
    },
    {
      "time": "16 Feb 2009 — 6:44am",
      "content": "I'm really enjoying where you've gone with this one... looks good! (was going to note the intersection issues but you already know those.)\n\n"
    },
    {
      "time": "16 Feb 2009 — 3:50pm",
      "content": "I really enjoy. Looks very nice.  \nMy comments go to:  \nThe \"i\" terminal has a point in the middle (not sure if this is the correct english) that I dont find in any other terminal. Error or something that you want?  \nI also think that the \"x\" is to \"broken\" when compared to \"X\".  \nCongratulations!\n\nAntónio\n\n"
    },
    {
      "time": "16 Feb 2009 — 4:07pm",
      "content": "This is quite nice! A rare combination of handsome forms and  \ncompelling flair. The only lc glyph that's not working is the \"t\".  \nAnd I'd make the \"Q\" much more special than that!\n\nI'll try to find time for a fuller crit.\n\nhhp\n\n"
    },
    {
      "time": "16 Feb 2009 — 4:20pm",
      "content": "Thanks Hrant; I know you're not keen on chirographic stres so it's great to hear your positive words! The way you mention the lc as mostly working makes me think I need to spend more time on the uc. Would you like a swashy tail on the Q? Is it the top of the t that bothers you?\n\nAntonio, yes, I don't know when that point appeared in the tail of the i but it probably needs to get lost. Thanks for pointing out the x. I think I've pushed the limbs too far apart.\n\nI'm making the smallcaps a few units heavier and increasing the sidebearings. Also I had lots of discretionary ligatures in an old version which need redrafting.\n\nThanks very much guys :) Please do give me your worst!\n\n"
    },
    {
      "time": "16 Feb 2009 — 4:28pm",
      "content": "\\> The way you mention the lc as mostly working makes  \n\\> me think I need to spend more time on the uc.\n\nActually it's just that I spent more time (but not much  \nyet frankly) looking at the lc, and that's because the lc  \nis 95% of text.\n\nhhp\n\n"
    },
    {
      "time": "17 Feb 2009 — 7:34am",
      "content": "Nice to see a new iteration of Eternal.\n\nBut you know what, I will refrain from posting any crits at this moment, so you can get some valuable ones from other poeple than James and me... ;)\n\n"
    },
    {
      "time": "17 Feb 2009 — 11:02am",
      "content": "This is looking pretty good.\n\nTwo small things jumped out in a first look:\n\n1) Seems there are overlapping paths for the crossbars of t and f, and perhaps their ligatures. This is visible at some zoom levels in Acrobat 9 when the overlapped sections reverse out.\n\n2) To my eye, optically the S and s seem to lean just slightly to the left. Given the traditional Roman forms being used, I'd think they should either be balanced, or if they lean, go ever so slightly to the right.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "17 Feb 2009 — 11:42am",
      "content": "Hi  \nJelmar; yes :) good to see at least you're still following the progress of this one.  \nThomas, also yes. I have quite a lot of overlaps which I should have merged before posting the pdf, sorry!  \nI'll take a look into those Ss and push the top over a unit or two.  \nThat's once I've fixed the x, which I've ripped to pieces right now...\n\n"
    },
    {
      "time": "17 Feb 2009 — 2:23pm",
      "content": "I've changed the top of the t, added some subtle curves to the x and sheared the s slightly.\n\n ![](http://web.archive.org/web/20150417143229im_/http:/typophile.com/files/extras_3638.jpg)\n\n"
    },
    {
      "time": "17 Feb 2009 — 2:45pm",
      "content": "'t' is much improved.\n\n'x' still is very distracting - in fact the curves (though handsome in themselves) only add to the torquing that comes from the offset not aligning optically.\n\nI'm not sure about the 'A' crossbar not connecting. I fear that reduces the versatility of this font quite a bit. ('B' & 'R' are fine on that score, I think.)\n\nTail of the oldstyle '3' looks kinda limp!\n\nShould the lead-in serif of VXY be flatter (like that of UW)?\n\n"
    },
    {
      "time": "17 Feb 2009 — 3:08pm",
      "content": "t...yes since starting on the italic I've been able to work backwards and use some of the features there to make the regular work better. That was the original t but obviously needed a rethink. Good.\n\nx...oh dear! I wondered why it still looked like the arms were too far apart even though I'd brought them inwards. Think I need to come back to this one!\n\nVXY, I don't know. The serif needed tension with the heavy stroke. On those letters the stroke is rotated so the serif seemed to fit best rotated too. I'll have another look at that.\n\nThanks for the comments.\n\n"
    },
    {
      "time": "18 Feb 2009 — 6:13am",
      "content": "Ben,  \nyour font is very nice, charming and comfortably legible.\n\nTexts are easy to read and vibrant, so one experiments the delight of reading by –paradoxically– ignoring that the type face contributes or, even better, produces that feeling.\n\nI agree with Craig about the crossbar of the uc A (and probably the same for the ∆), and the optical disalignment in the uc/lc x –glyphs which however I loved, the same as delicious D, R, U, V, W, Y, Z, n, v, w, z and old style numerals–; I think the thin stroke gap (very noticeable at a large size) should not exceed one quarter of its width.\n\n ![](http://web.archive.org/web/20150417143229im_/http:/typophile.com/files/X_5508.png)\n\nI also believe like Hrant, that your Q could be more quirky; I enjoy the correction made to the t: now it absolutely fits the elegance of its sisters.\n\nNevertheless, your work is really amazing for both brain hemispheres.\n\nLet us know when it's for sale.\n\n_[Just a minor thing, beyond the design: the æ/Æ and Œ/œ are not exactly ligatures in the original meaning of the word, but distinct letters; by the other hand, the German ß is a real one –long s over round s–, with the notable fact that the ſ (long s) does not exist anymore in German.]_\n\n**MarS**\n\nPS: Next time, merge outlines, please; it's a shame not to enjoy so wonderful creation because of bad PDF rendering. BTW, at some scales, Acrobat seems strangely to miss some characters, as António told before.\n\n"
    },
    {
      "time": "18 Feb 2009 — 6:36am",
      "content": "I suppose it'd also be helpful to address your questions!\n\n_Specifically I’m not sure if the small caps are dark enough._\n\nThey do look very slightly light in color, but they also seem large to me, so adding weight might make them too loud. It's kind of a tricky question with this font, because your lowercase is (I think) more condensed than your uppercase: should the small caps likewise squeeze together like their short brethren or should they retain more typical width like their cap antecedents?\n\n_Also, I’m wondering about certain shapes: M, B, Q, T, Z, a, f, x, y, Ae and Th._\n\nB, a, and f look great to me. Those other caps aren't easy to find in your text setting so they're harder to judge.  \nMore space between the T-part and the h-part of 'Th' might be helpful.\n\n_Does the spacing work? What about the smallcap spacing?_\n\nLetterspacing looks too tight all around to me (maybe smallcaps especially). Difficult to read, though, because I think the wordspacing is too large. This in turn is difficult to judge because you have fully justified the paragraphs, so maybe that excess space is in part due to the layout stretching the lines. But even in the most crammed line, I think the letters looked too bunched and the space between words relatively too large. What's a rag-right paragraph look like?\n\n"
    },
    {
      "time": "18 Feb 2009 — 6:44am",
      "content": "Hi Marcelo, thanks for your positive comments! I'm glad you like my font!  \nI did wonder about the crossbar on A, but initial comments when I posted the start of this font were positive about the disconnected stroke, so I left it. Perhaps it needs to evolve again.  \nIt's interesting you like the D as that was one that didn't really seem to work for me. What do you like about it in particular?\n\n\\>I think the thin stroke gap (very noticeable at a large size) should not exceed one quarter of its width.\n\nDo you mean I should reduce the gap in the B and R **by** a quarter or **to** a quarter of its current width?\n\nI hadn't thought of this as saleable! I wouldn't have a clue how to do that (it's my first font) so when I'm nearer completion I'll need someone to help with that I guess :)\n\nYes, I did wonder if Ae and Oe should count as ligatures. I'll move them into the latin extended set and get the sharp s moved into the ligatures section! Thanks.\n\nSorry sorry sorry about the overlap problem. I like to keep the outlines un-merged until I'm sure they are finalised!\n\nCan you tell me what outlines are missed in Acrobat (I haven't noticed any problems) and I'll check the unicode indexes.\n\n:)\n\n"
    },
    {
      "time": "18 Feb 2009 — 6:50am",
      "content": "Craig, thanks :) I'll set block text in all caps and mixed case rag right later on.  \nI'll have another tweak of the Th. I was playing with a rather nice gj ligature as well. Hopefully there is some language where that can be used!  \nI just noticed yesterday the word spacing too. Good to have my thoughts confirmed. I'll knock a bit off there.  \nThanks,\n\n"
    },
    {
      "time": "18 Feb 2009 — 7:02am",
      "content": "Be careful with experimental ligatures - once you get going you can really generate a lo **gj** am of custom characters to draw. ;-)\n\n"
    },
    {
      "time": "18 Feb 2009 — 7:04am",
      "content": "<cite> should the small caps likewise squeeze together like their short brethren or should they retain more typical width like their cap antecedents?</cite>\n\nThat's a good question, Craig. Looking at the PDF, I think the small-cap A is definitely too wide. I think condensing the small caps might just be what the doctor ordered.\n\n"
    },
    {
      "time": "18 Feb 2009 — 7:12am",
      "content": "Aah! Yess! Interesting solution: making the small caps more condensed will give text more melody I think. I was sticking to the convention of widening the proportions for small caps but I think they should be the same proportions as the caps or perhaps a bit narrower!\n\nCraig. Yes. A while back I created a lot of useless and ugly ligs which have since been deleted. I promise I'll only keep the pretty ones! Yesterday I was puzzling over f with igrave and iacute; that's a tough call!\n\n"
    },
    {
      "time": "18 Feb 2009 — 7:15am",
      "content": "This has charm and some nice drawing. I think it has some craft problems, though, that need to be resolved to make it work in text.\n\nThe verticals are, I suspect a little too light. And for sure the spacing is too tight for text sizes. When I zoom in on the 'in' combo, for example, I see that the space between letters is only 80% of the width of the n counter. In Minion, which is a tightly spaced text font, the space between two n's (stem-to-stem) is 95% of the width of the counter--actually the amount that Walter Tracy recommends in his great \"Letters of Credit\".\n\nHandling the widths of your mnh is tricky with the hooked right foot. I wonder if the h or n are a trifle wide. The m to me is definitely cramped. It is hard to judge these things, though, with the letter spacing so tight.\n\nThe light verticals go with the tight spacing to make this very good large--though even there it could be a little looser. But the tightness really hurts at text size.\n\n9-12 point is really a different animal than big, and what it looks like best on the screen will deceive you about what is best small.\n\n"
    },
    {
      "time": "18 Feb 2009 — 8:06am",
      "content": "Hi William, I noticed that as soon as I printed it out the other day! Perhaps this is more a display face after all.  \nI think I've been looking too long at it on screen and not enough in print. I think the serifs may also need strengthening for small text use. I wasn't intending to do optical sizes so it looks like I have a decision to make!\n\nDo you know the percentage letterspacing vs counter width for the display cut of Minion?\n\nI'll redo the spacing completely. It's good to hear there's a bit of a convention as I was trusting just my (amateur) judgment so far. I'll leave the hnm as they are until the spacing is fixed.\n\nThis is exactly the feedback I need, many thanks.\n\n"
    },
    {
      "time": "18 Feb 2009 — 8:34am",
      "content": "I think overall it is a great, legible font. It reads well and I would have to say you've done a great job with it! What plans do you have for distributing it once you are done with all the tweaks?\n\n"
    },
    {
      "time": "18 Feb 2009 — 8:44am",
      "content": "Thanks for the feedback. I'm taking one step at a time :) The next step (after getting the spacing and glyphs right) will be learning how hinting works, wondering what else needs to go into a font, and finally working out what this font is good for and getting advice on marketing and distribution (if it turns out good enough to sell). The other thing is that I'd want to have at least the italic ready as well before thinking about licensing.  \nFonting is a very painstaking process. I suspect there's still a whole lot of work to do on this!\n\n"
    },
    {
      "time": "18 Feb 2009 — 11:07am",
      "content": "_\"I did wonder about the crossbar on A, but initial comments when I posted the start of this font were positive about the disconnected stroke, so I left it. Perhaps it needs to evolve again.\"_  \n—Nevermind. I just expressed my personal taste.\n\n_\"It’s interesting you like the D as that was one that didn’t really seem to work for me.\"_  \n—To my eyes, the lack of the bottom serif makes it originally exciting; in context, it keeps its own balance and elegance. I don't know if you kerned it, but in your sample text, the wide space between the D and the o makes me tend to read \"D own\" instead of the right word. But probably it's because the entire spacing is very tight (BTW, I'd reconsider this).\n\n_\"Do you mean I should reduce the gap in the B and R by a quarter or to a quarter of its current width?\"_  \n—I was talking about the optical correction in the X/x (the offset between upper and lower segments in the thin stroke).\n\n_\"Can you tell me what outlines are missed in Acrobat (I haven’t noticed any problems) and I’ll check the unicode indexes.\"_  \n—I guess it is neither your PDF nor your font indexes, but a random bug in Adobe Reader rendering. Mac OSX Preview hasn't that problem.\n\nIf you don't want to sell Eternal, you probably wanted to distribute it among a limited scope of supporters ;-)\n\n**MarS**\n\n"
    },
    {
      "time": "18 Feb 2009 — 12:30pm",
      "content": "I really agree that the X thin stroke offset is much too large.\n\nT\n\n"
    },
    {
      "time": "18 Feb 2009 — 1:47pm",
      "content": "\\> If you don’t want to sell Eternal, you probably wanted to distribute it among a limited scope of supporters ;-)\n\n:)  \nYes, why not?! Do other people here do that?\n\nI was considering joining up all the disconnected shapes (ABR) as alternates. That would cater for different tastes.\n\nHow's this x?\n\n ![](http://web.archive.org/web/20150417143229im_/http:/typophile.com/files/extras_5170.jpg)\n\n"
    },
    {
      "time": "18 Feb 2009 — 3:08pm",
      "content": "I feel the curvy stroke is somehow distracting...  \nLook at that simple experiment (the upmost image is your original):\n\n ![](http://web.archive.org/web/20150417143229im_/http:/typophile.com/files/extra_5460.png)\n  \nProbably it is just matter of slightly shifting the almost linear stroke:  \n\n ![](http://web.archive.org/web/20150417143229im_/http:/typophile.com/files/X_5118.png)\n  \n(Sorry, don't wanna be annoying on this)\n\n**MarS**\n\n"
    },
    {
      "time": "18 Feb 2009 — 3:35pm",
      "content": "Interesting. I did a little experiment measuring glyphs in pdfs...\n\nI've compared the letterspacing with the counterspacing for a handful of fonts as William noted above.\n\nThe tightest spacing is in Fedra Serif Display, where the space between two n's is just 63% of the space between the n's legs. Palatino comes in next at 72%.\n\nThe loosest spacing is in Enschedé Collis, which is 102%.  \nMelior LT comes in at 100%\n\nA modern display font (Guardian Egyptian Display) turned out at 77% and fonts with condensed proportions seemed to have wider spacing: Newlyn's Verona and Joanna MT had 91 and 93%\n\nFonts like Type Together's Karmina, Underware's Dolly, ITC Stone Serif, and Guardian Egyptian Text had ratios of 85-87%.\n\nThe median was 89%. Fedra Serif text, FF Olsen and Utopia have this ratio.\n\n**Conclusion:**  \nFor a text size, I think I'll aim for a 90% ratio of spacing to counterspace, or another 20 units on each side of my n, and see how that looks as a starting point. Putting in the extra space means the serifs look stumpy and will need lengthening.\n\nI'll keep developing the existing font as a display cut and come to the text size afterwards (if I don't grow tired of beziers!)\n\n"
    },
    {
      "time": "18 Feb 2009 — 3:44pm",
      "content": "Thanks Marcelo; I'll try that. My reason for the curves was that the other letters which I like best have slight curves and modulations in them and the wxyz looked a bit flat and mechanical for a humanist-influenced font. I might try also just one curve continuing on both arms rather than an opposite curve on each arm. I'm finding this silly letter really hard, just like o was initially for me.\n\nIt's funny because they're essentially very simple shapes and you wouldn't imagine much could go wrong with them! Oh, how many things about type design seem so simple before you start actually developing a font! :)\n\n"
    },
    {
      "time": "18 Feb 2009 — 5:07pm",
      "content": "Ben, I think what works best as far as letter spacing is also affected by how thick the stems are, and how wide the font is overall, as well as the serifs--and the intended size of use.\n\nOne way to proceed is to print it out at intended size, and then try tracking it out and in, and see what works best. Because the different factors interact in ways that nobody fully understands, you just need to try variations and use your eyes any your own personal judgment. This is the approach Briem recommends on his web site, and I think it's right.\n\nI would also recommend comparing thickness of stem, normalized for x height, with other faces you admire, and also play with this in your own font, with a limited set of letters, and in print-out look also at the affect on letter spacing.\n\nHow wide your n and o are, the weight of their strokes, and their spacing is a lot of the 'DNA' of your font, so I agree with Tracy that it is worth taking time over to make sure you are happy with it.\n\n"
    },
    {
      "time": "18 Feb 2009 — 5:16pm",
      "content": "Got it!  \nThe problem with the initial PDF is that there are some isolated outlines embedded among the text –I mean, outlined text, instead of the font itself– that cause Reader renders unexpectedly; it is probably related to overlapping unmerged outlines within the font.  \nI apologize myself for distracting from the core point, but I thought it is worth to learn a bit from “artifacts”.  \nThanks,  \n**MarS**\n\n"
    },
    {
      "time": "18 Feb 2009 — 6:45pm",
      "content": "_The median was 89%. Fedra Serif text, FF Olsen and Utopia have this ratio._\n\nFor a text size, I think I’ll aim for a 90% ratio of spacing to counterspace, or another 20 units on each side of my n, and see how that looks as a starting point. Putting in the extra space means the serifs look stumpy and will need lengthening.\n\nI’ll keep developing the existing font as a display cut and come to the text size afterwards (if I don’t grow tired of beziers!)\n\nAs some were saying in forums elsewhere (about other fonts/types), if you intend to develop this as a text face, I wouldn't be afraid to lean a bit towards tighter spacing.\n\nI had the opposite reaction in terms of spacing from your sample: that if anything the spacing was too loose. I think there was some unevenness or kerning work to be done with the spacing, but I wasn't left with a global impression of it being too loose.\n\nI'm not sure what to say about the x. I like the curvature, but can't decide if I like it more than the more linear route.\n\n"
    },
    {
      "time": "18 Feb 2009 — 7:53pm",
      "content": "\\> _I had the opposite reaction in terms of spacing from your sample: that if anything the spacing was too loose. I think there was some unevenness or kerning work to be done with the spacing, but I wasn’t left with a global impression of it being too loose._\n\nSo, first you find the spacing too loose, and then you wasn't left with the impression of it being too loose? ;)\n\nAt any rate, a text face will pretty much always need looser spacing than a display face. So since this face was -- as far as I know -- intented for text, the spacing shouldn't be too tight. I think it might either be just right or slightly too tight as it is right now (I'm talking about a few units here). But I'm not an expert on spacing, really. :)\n\n"
    },
    {
      "time": "18 Feb 2009 — 9:12pm",
      "content": "_So, first you find the spacing too loose, and then you wasn’t left with the impression of it being too loose? ;)_\n\nSigh...it's been a long day. So I'm losing my capacity for language.\n\n_At any rate, a text face will pretty much always need looser spacing than a display face._\n\nI guess there's text and then there's text. Who knows? It's a subjective thing in the end. I like text tighter--I think if it's spaced too much, you lose a certain amount of \"chunking\".\n\nI agree with you, though, in that it's just about right now overall, with a little bit of wiggle room.\n\n"
    },
    {
      "time": "18 Feb 2009 — 9:15pm",
      "content": "very nice!\n\n"
    },
    {
      "time": "18 Feb 2009 — 9:42pm",
      "content": "\\> It’s a subjective thing in the end.\n\nYou could say it's subjective in the display realm\\* but when it comes to text you can't let the counters overpower the interletter space. Based on the current preference for tight display setting, it's entirely fair to say \"text fonts need to be tighter than display fonts\".\n\n\\* One could imagine a future where people prefer loose titling.\n\nhhp\n\n"
    },
    {
      "time": "18 Feb 2009 — 10:35pm",
      "content": "i often feel that when i read books from the 60's (mostly space opera set in Times or Plantin) they are set quite tight, tighter than book today. is that often the case?\n\n"
    },
    {
      "time": "18 Feb 2009 — 10:43pm",
      "content": "_but when it comes to text you can’t let the counters overpower the interletter space_\n\nRight--I see what you're saying with that. I guess the issue for me was that, _overall_, the spacing seemed about right, but there's some unevenness--some of it seemed too tight, but other areas seemed a bit too loose (e.g., \"Do\" and \"ow\", as Marcelo points out). Because the more spaced pairs were dragging my gaze, the idea of increasing the spacing equally throughout didn't quite seem right to me--maybe redistributing or something.\n\n"
    },
    {
      "time": "18 Feb 2009 — 10:48pm",
      "content": "_i often feel that when i read books from the 60’s (mostly space opera set in Times or Plantin) they are set quite tight, tighter than book today. is that often the case?_\n\nI don't know. That's an interesting question. I pulled a pseudorandom sample of books off my shelf. I first, I thought no, but comparing them, the older books do look a little tighter.\n\n"
    },
    {
      "time": "18 Feb 2009 — 10:48pm",
      "content": "_i often feel that when i read books from the 60’s (mostly space opera set in Times or Plantin) they are set quite tight, tighter than book today. is that often the case?_\n\nI don't know. That's an interesting question. I pulled a pseudorandom sample of books off my shelf. I first, I thought no, but comparing them, the older books do look a little tighter.\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:09am",
      "content": "\\> it’s entirely fair to say “text fonts need to be tighter than display fonts”.\n\nHrant, do you mean looser?\n\nI guess the spacing ended up looking tight because I've read a lot of Plantin and Palatino!\n\nThis seems more subjective than I thought. I think what I'll do next is print out at various sizes up to say 144pt, play with the tracking and see which size the font shines best at, then optimise the spacing and stem widths for that. I'll have to trust my eye in the end.\n\nWilliam, yes, I'll look at stem widths too, for the same set of fonts.\n\nI haven't done any kerning yet.\n\n"
    },
    {
      "time": "19 Feb 2009 — 5:43am",
      "content": "Note that Palatino is really a display face; Aldus is its text companion and--just checking--Aldus has wider letter spacing.\n\nThe only real rule here is that you need to look at your design in the final intended size and medium (print, computer screen, phone). Then it's your font, you decide. And next of course customers decide if they want it.\n\n"
    },
    {
      "time": "19 Feb 2009 — 7:59am",
      "content": "\\>\\> it’s entirely fair to say “text fonts need to be tighter than display fonts”.\n\n\\> Hrant, do you mean looser?\n\nYes!! :-/ Sorry.\n\n\\> Palatino is really a display face\n\nIndeed. A very good point, usually lost.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2009 — 12:10pm",
      "content": "I hadn't realised Palatino was a display font, given its prolific (mis)use, and thought the other fonts in that series were for titling (E.g. Sistina/Michelangelo).\n\nFor a display font, Palatino makes a really comfortable read for longer text.\n\nI'll get back to the spacing now...\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:38pm",
      "content": "Titling and display are kind of overlapping categories. Michelangelo and Sistina are caps-only. It's tricky identifying Palatino in text, because Aldus has forms so similar, you can mistake it for Palatino. It is subtly but decisively changed for text.\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:50pm",
      "content": "I find the shape of the a in Palatino very distinctive. Will certainly keep an eye out for Aldus though now!\n\nTalking of stroke offset, what about the 8? You can also see in the pdf (the bigger offset is in the lining figures and the narrow offset in the oldstyle ones).\n\n ![](http://web.archive.org/web/20150417143229im_/http:/typophile.com/files/88_6164.jpg)\n\nIs it falling right slightly or is that me?\n\n"
    }
  ]
}
