{
  "id": "54859",
  "title": "Toulouse's new typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi there!  \nMy name is Laure Afchain, I'm currently studying in the Type]Media master in the Hague.  \nI just wanted to share with you some good news from a french type design project I was involved in:\n\nSince the beginning of 2009, the city of Toulouse, in France, has a brand new typeface, named Garonne. Toulouse is actually the first french city to get its own exclusive typeface. Garonne is a type system which contains four fonts: a regular and its italic for the running text, an ultra-bold, and a condensed version dedicated to display. It will be soon used by the municipality on its logo, publications, posters, invitations, newspapers.\n\nWe've been designing it during my fourth and fifth year in the visual communication department of the Fine Arts School in Toulouse. To be more precise, it has been designed by [Alejandro Lo Celso](http://web.archive.org/web/20150411021304/http:/www.pampatype.com/), [François Chastanet](http://web.archive.org/web/20150411021304/http:/www.francoischastanet.fr/), Géraud Soulhiol and [me](http://web.archive.org/web/20150411021304/http:/www.lo-circonflexe.fr/)\n\nHope it will have a nice \"avenir\" :)\n\n ![](http://web.archive.org/web/20150411021304im_/http:/typophile.com/files/Garonnes_3810.jpg)\n\n ![](http://web.archive.org/web/20150411021304im_/http:/typophile.com/files/GaronneCharSet_5000.jpg)\n\n ![](http://web.archive.org/web/20150411021304im_/http:/typophile.com/files/GaronneA_6285.jpg)\n\n",
  "author": "Lô A",
  "time": "16 Feb 2009 — 5:23am",
  "uid": "40160",
  "comments": [
    {
      "time": "16 Feb 2009 — 5:59am",
      "content": "Very nice, in my opinion. Hints of a ton of other faces with its own unique flair.\n\n"
    },
    {
      "time": "16 Feb 2009 — 6:56am",
      "content": "While I don't normally ascribe national feelings to typefaces, I \\*do\\* think this one has a definite French feel to it. Well done.\n\n"
    },
    {
      "time": "16 Feb 2009 — 7:42am",
      "content": "What's the deal with the top connection on the bowl of your regular \"a\"? This look amazing. Love the \"y\". Have you considered adding an alternate \"G\" and perhaps \"k\"?\n\n"
    },
    {
      "time": "16 Feb 2009 — 9:41am",
      "content": "<cite> &gt; While I don’t normally ascribe national feelings to typefaces, I *do* think this one has a definite French feel to it. </cite>\n\nPerhaps, Steve; but I also see quite a bit of Alejandro (and thus perhaps a hint of Argentina) in it. See also [www.pampatype.com](http://web.archive.org/web/20150411021304/http:/www.pampatype.com/ \"www.pampatype.com\") -- Arlt. Which in turn was probably influenced a bit by Jannon and French Baroque (perhaps via Frantisek Storm).\n\nNot meant as any criticism or disparagement. Garonne looks very nice. I hope it is well received by the local community.\n\n"
    },
    {
      "time": "16 Feb 2009 — 9:44am",
      "content": "_While I don’t normally ascribe national feelings to typefaces, I \\*do\\* think this one has a definite French feel to it._\n\nWhy do you think that is?\n\nI was going to say that it vaguely reminds me of letterforms in art nouveau, which I associate with France. Originally I thought it was the roundness, together with greater weight on the top of the glyph, but I think there's more to it than that.\n\nNice.\n\nBut maybe you were thinking something totally different when you said it has a \"French feel.\"\n\n"
    },
    {
      "time": "16 Feb 2009 — 9:51am",
      "content": "coco-rico !\n\n"
    },
    {
      "time": "16 Feb 2009 — 10:56am",
      "content": "<cite>I was going to say that it vaguely reminds me of letterforms in art nouveau</cite>\n\nThat's probably part of it. I think the narrow version is the one that really does it for me, especially the g.\n\n"
    },
    {
      "time": "16 Feb 2009 — 12:14pm",
      "content": "Bravo\n\n"
    },
    {
      "time": "16 Feb 2009 — 8:12pm",
      "content": "Very nice. :)\n\n"
    },
    {
      "time": "17 Feb 2009 — 4:26am",
      "content": "Ah I quite enjoy the Ultra Bold and Condensed, it manifests the subdued flavour of the regular quite well. Good job, eh.\n\n"
    },
    {
      "time": "17 Feb 2009 — 5:53am",
      "content": "I really like it and it motivated me so much on my graduation project which is also a very similar approach. Hope I will manage to do such a beauty and 'avenir' too.\n\n"
    },
    {
      "time": "17 Feb 2009 — 11:23am",
      "content": "Beautiful!\n\nSharon\n\n"
    },
    {
      "time": "17 Feb 2009 — 11:50am",
      "content": "Congrats for this beautiful project!  \nJust to be a bit more precise, Toulouse is not the first French city to get a custom design. Franck Jalleau did a type family for the city of Brive-la-Gaillarde back in 2002.\n\n[http://www.typographe.com/article/565/IN-Brive](http://web.archive.org/web/20150411021304/http:/www.typographe.com/article/565/IN-Brive \"http://www.typographe.com/article/565/IN-Brive\")\n\nNow that this truly great part of work is done, what really counts is how the typeface will be used by the mayor's offices. And this has obviously been a big issue for Brive. I have documents coming from them that still burn my eyes.\n\nBy the way, I'm always curious as to which extend a typeface design can claim itself being \"collaborative\". Could you tell a bit more about the design process?\n\n"
    },
    {
      "time": "17 Feb 2009 — 9:13pm",
      "content": "Very nice, I like the lowercase g.  \nKeep up the good work and good luck\n\nGuerrizmo\n\n"
    },
    {
      "time": "18 Feb 2009 — 11:10am",
      "content": "I'm with Kent on this one. And possibly Hubert, if by coco-rico he means rococo - in the roman at least. The italic looks straight out of the dutch school - see quadraat italic. I admire Lo Celso's work, and his influence here is no exception. Heaps of character, yet functional. Congratulations... I'm envious of your learning experience and of the people of Tolouse!\n\n"
    },
    {
      "time": "19 Feb 2009 — 8:46am",
      "content": "Very nice, though I do think the uc G is distracting. Very ambitious (in a good way) for a city to have it’s own face. The French provincial flags are beautiful—perhaps the provinces will be inspired by Toulouse’s example.\n\n-------------------------------------  \n_Inventor of the DVD rewinder_\n\n"
    },
    {
      "time": "19 Feb 2009 — 1:09pm",
      "content": "This is a charmer. I hope to see it used well. This could be a really fun type system to work with, especially with the ultra-bold and condensed weights.\n\n"
    },
    {
      "time": "19 Feb 2009 — 6:54pm",
      "content": "I love it... awesome!!!\n\n"
    },
    {
      "time": "20 Feb 2009 — 3:36pm",
      "content": "Laure,  \nit's beautiful. I’m with Jean-Baptiste, I want to know how a group of four ended up designing something this good. Unless you'd prefer not to divulge this ...\n\n"
    }
  ]
}
