{
  "id": "5486",
  "title": "'Whitney' by Hoefler & Frere-Jones",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just curious, but what are everyone's impressions of [Whitney](http://web.archive.org/web/20131107010123/http:/www.typography.com/catalog/whitney/) by Hoefler and company? I've been eyeing the face since they recently announced availability, and from what I can tell it seems like a very clean, versatile face that could offer a refreshing (though not entirely different) break from Meta, Fago, Avenir, and other similar faces. But is it distinctive enough? I'm considering getting the basic / small caps families and was curious what others thought.\n\n",
  "author": "tdominey",
  "time": "5 Jul 2004 — 5:43pm",
  "uid": "3619",
  "comments": [
    {
      "time": "6 Jul 2004 — 4:53am",
      "content": "Wow, I didn't know the Whitney Sans had been released. Where was I when this was announced?   \n   \nI first noticed Whitney when Matthew Carter selected it for his Critic's Award in the first _Critique_ competition back in 1998. I was under the impression that it was created for the Whitney under the auspices of the Font Bureau, so I'm a little curious that Tobias is now able to release it through H&F-J.   \n   \n-- K.\n\n"
    },
    {
      "time": "6 Jul 2004 — 7:37am",
      "content": "Whitney Sans?   \nYeah, I went to to the website to check it out.   \nApparently it's named after a museum, not a naked diva.   \nType geeks -- gotta love 'em.\n\n"
    },
    {
      "time": "6 Jul 2004 — 10:09am",
      "content": "Whitney Sans was featured in a magazine ad recently ... HOW, Print, one of those.   \n   \nThe ad also mentioned the HTF name change.   \n   \n [http://www.typography.com/press/pr\\_06\\_08\\_04.html](http://web.archive.org/web/20131107010123/http:/www.typography.com/press/pr_06_08_04.html)\n\n"
    },
    {
      "time": "7 Jul 2004 — 7:03am",
      "content": "Yeah, interestingly, the advertisements for Whitney hit magazines a few weeks before Hoefler updated their web site.\n\n"
    },
    {
      "time": "5 Jul 2004 — 6:58pm",
      "content": "Do you have a particular project in mind, or are you just wanting   \na versatile font family?\n\n"
    }
  ]
}
