{
  "id": "54890",
  "title": "Graphic Design Ad",
  "forum": "jftorres's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20150403082428im_/http:/typophile.com/files/grocery_5300.jpg)\n\nI absolutely LOVE this add. Old school pen and paper, pure art and beauty. It is a very successful advertisement, in my opinion.\n\n",
  "author": "jftorres",
  "time": "16 Feb 2009 — 10:06pm",
  "uid": "41417",
  "comments": [
    {
      "time": "17 Feb 2009 — 9:11pm",
      "content": "Wonderful!\n\n"
    },
    {
      "time": "18 Feb 2009 — 4:31am",
      "content": "I would guess this is Photoshoped onto the notepad, but still a beautiful image. The shear creative play between image and lettering is outstanding.\n\n"
    },
    {
      "time": "18 Feb 2009 — 6:23am",
      "content": "this is freaking cool! I didn't even notice the words in the images until a second look. I love this..\n\n"
    },
    {
      "time": "18 Feb 2009 — 12:38pm",
      "content": "It's odd how rare seeing something done by the human hand has become. 20 years ago no one would have blinked over someone using such archaic instruments as pen and paper to produce an illustration. Unfortunately, once the object of the ad has been properly \"trained\" he or she will probably never pick up a pen, preferring a way to produce this entirely digitally.\n\n"
    },
    {
      "time": "19 Feb 2009 — 9:37am",
      "content": "wow! sensual stuff.. the illustration jump out of the page. so simple so effective\n\n"
    },
    {
      "time": "20 Feb 2009 — 6:26am",
      "content": "This is a lush add. Think that it is amazing how we don’t believe what we see anymore. As nice as it is looks a part of me just doubts that it is a real pen and paper job. I would have to see the pad with my own eyes to believe it, I suppose that’s the Photoshop curse though.\n\nI hope that the illustration was created by the pen in the pic, it would be nice for an advert not to lie for once, and give me hope that there are still free handers out there being recognized for what they do.\n\nStef\n\n"
    },
    {
      "time": "20 Feb 2009 — 8:56am",
      "content": "Looks freehand, maybe photoshoped a bit tho. Its probably safe to assume that the guy/gal who did the art for this ad has a decent job and is doing what they love. Go artists and designers!\n\n"
    },
    {
      "time": "21 Feb 2009 — 12:48pm",
      "content": "That composition would make a great etching.\n\n"
    },
    {
      "time": "21 Feb 2009 — 6:25pm",
      "content": "great this !\n\n"
    },
    {
      "time": "22 Feb 2009 — 4:09pm",
      "content": "This is gorgeous. And though agreed that it may be photoshopped, the hand done quality is amazing.\n\n"
    },
    {
      "time": "23 Feb 2009 — 1:31pm",
      "content": "Its a nice ad, but i can safely say its photoshopped onto the notepad. You can tell because a ballpoint pen is not transparent enough to allow the lines of the paper to show through. It was probably placed on with a multiply blend mode - nice drawing none the less. very clever.\n\n"
    },
    {
      "time": "25 Feb 2009 — 10:48am",
      "content": "Lovely ad. Great idea and great execution. I would hazard a guess that it was first drawn roughly in pencil to bring all the elements together and ensure a nice composition.\n\nMy only complaint is I hate drawings in blue Biro - in fact, I wish blue Biro had never been invented (every time I look for a pen it always seems to be blue!) My fickle complaints aside, it has definitely been drawn by hand and I love it!\n\n"
    },
    {
      "time": "25 Feb 2009 — 4:11pm",
      "content": "This ad would not hold the visual weight it does if the blue ballpoint pen was not a ubiquitous instrument for note jotting. Therefore, props to everything we think is cliche or overdone. Just another weapon in my design arsenal.\n\n"
    },
    {
      "time": "25 Feb 2009 — 4:34pm",
      "content": "What feast for the eyes...simply delectable...  \nI agree it was well thought out, carefully drawn and likely digitized, to overlay the tablet. I applaud the final product, however it arrived.\n\nThe physical aptitude to draw well is so compelling, that I found ways to make ink washes on paper, which can be very unforgiving, behave in a true gestural style...on demand...  \nby completing several ink washes of the same subject, then using a collage technique to marry the best areas into one perfect (to me) ink drawing...like layers.\n\n"
    },
    {
      "time": "19 Mar 2009 — 9:31am",
      "content": "This is great. It takes the everyday, the hum drum, and the mindless and transforms it into an art form. I make lists everyday, to do lists, grocery lists, anything that is running through my head constantly until I get onto a piece of paper. The list above represents the trivial things we use and need in our daily lives that we might forget to appreciate. What would you do if you didn't have access to bread and milk, and toilet paper!?  \nJess\n\n"
    },
    {
      "time": "20 Mar 2009 — 7:15pm",
      "content": "I agree Jessica. I can't tell you how happy I was when I came across this on the internet. Unfortunately, I am too busy to make my everyday lists look this amazing because of school, but I have let it inspire me in other ways. For example, I have been much more creative when it comes to writing titles on my philosophy notes, and when a teacher uses a funny word or something really important is said, I take the time to make that word or phrase into something special in the margin of my notebook.\n\n-Jessica\n\n"
    },
    {
      "time": "20 Mar 2009 — 7:15pm",
      "content": "I totally agree with what you said Jessee...I LOVE how the designer incorporated type into the objects in the drawing. It just looks so amazing! :)\n\n"
    },
    {
      "time": "21 Mar 2009 — 11:35am",
      "content": "In my opinion, one of the best parts about this work is that it appears as though the designer started with an image and forced the text into it. What I mean is that this piece looks very thought out so that the pictures become text rather than text become image, if that makes any sense.\n\n"
    },
    {
      "time": "1 Apr 2009 — 8:45am",
      "content": "The designer is Alison Carmichael\n\n[http://www.alisoncarmichael.com/](http://web.archive.org/web/20150403082428/http:/www.alisoncarmichael.com/ \"http://www.alisoncarmichael.com/\")\n\n"
    },
    {
      "time": "22 Jun 2009 — 11:37pm",
      "content": "Hey guys... all these comments are super encouraging!!  \nBut just wanted to clarify the source of the piece. My name is Amritraj Gupta and i am an art director at TBWA (Dubai). I illustrated this piece last year as part one of three visuals for a recruitment company (Career Junction: part of Arab Media Group) The piece was illustrated on the same pad of paper and the only photoshopped bit on the image is the header that says 'GROCERY LIST'\n\nJacqueline.. i think Alison Carmichael's work is quite nice but unfortunately is not really the owner of the piece.\n\nThis was a older post on my blog dating back to the time when the piece was made - [http://www.artraj.com/blog/2008/04/](http://web.archive.org/web/20150403082428/http:/www.artraj.com/blog/2008/04/ \"http://www.artraj.com/blog/2008/04/\")\n\nThanks for all the comments guys. it was tons of fun to work on the project.\n\n-Raj  \n [www.artraj.com/blog](http://web.archive.org/web/20150403082428/http:/www.artraj.com/blog \"www.artraj.com/blog\")\n\n"
    },
    {
      "time": "9 May 2013 — 10:14am",
      "content": "Its awesome work, i love illustration, u r creativity is great,no words to say this work, really really love it\n\n"
    }
  ]
}
