{
  "id": "5489",
  "title": "Nebiolo's 'Semplicit",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Do you know Nebiolo's 'Semplicit\n\n",
  "author": "titi",
  "time": "5 Jul 2004 — 8:55pm",
  "uid": "1786",
  "comments": [
    {
      "time": "5 Jul 2004 — 9:24pm",
      "content": "Nope. Care to elaborate?\n\n"
    },
    {
      "time": "6 Jul 2004 — 2:26am",
      "content": "It is a great face based on Futura,   \nit was cut in three weights + slanted, condensd and shadow.   \nIf you wish (Mr. Lauri Johnsen?) I could post a scan later.\n\n"
    },
    {
      "time": "6 Jul 2004 — 2:46am",
      "content": "'Semplicit\n\n"
    },
    {
      "time": "6 Jul 2004 — 2:47am",
      "content": "1930/1950.\n\n"
    },
    {
      "time": "6 Jul 2004 — 3:35am",
      "content": "Semplicita is nice, but I wouldn't want to read a novel set in it.\n\n"
    },
    {
      "time": "6 Jul 2004 — 3:39am",
      "content": "Sure, my friend.   \n'Semplicit\n\n"
    },
    {
      "time": "6 Jul 2004 — 3:52am",
      "content": "I am not sure Mr. Miles Davis, sincerely, I would like to.   \nIt has pleasant differentiations, and the Uc are Roman Capital   \nproportions based -- moreover, Futura is a text face, and I see   \nmore Futura than Gill Sans in Semplicita'.\n\n"
    },
    {
      "time": "6 Jul 2004 — 3:59am",
      "content": "Here is 'Semplicit\n\n"
    },
    {
      "time": "6 Jul 2004 — 4:24am",
      "content": "Great prof. Fabrizio Serra!   \nMy scan from Pellitteri's Atlante Tipologico   \nwould have been big time less crispy.   \nThank you.\n\n"
    },
    {
      "time": "6 Jul 2004 — 7:50am",
      "content": "I don't think it's based on any particular face such as Futura.   \nYou can see bits of Erbar, Bernhard Gothic, Kabel, etc., in it, plus some unique features.   \nNo Gill.   \nThere were a lot of \"mash-ups\" in that era, as different type designers from different foundries from different countries did their own version of the look du jour, the geometric sans.   \n   \nIt would be like saying that all present day sans serif faces that are slightly squarish, semi-condensed and open-fitted, with a 4-letter name, are versions of Meta, forgetting other sources like Quay Sans, and the general lettering aesthetic of the day.\n\n"
    },
    {
      "time": "6 Jul 2004 — 4:22pm",
      "content": "Is this font available in digital?\n\n"
    },
    {
      "time": "6 Jul 2004 — 4:27pm",
      "content": "No.   \nAre you in a hurry? Can you wait three years? :-)\n\n"
    },
    {
      "time": "6 Jul 2004 — 4:50pm",
      "content": "Who did publish Novarese's Recta, Mr. Stephen Coles?\n\n"
    },
    {
      "time": "6 Jul 2004 — 10:12pm",
      "content": "In Derren Wilson's [www.iliveonyourvisits.com](http://web.archive.org/web/20150322223957/http:/www.iliveonyourvisits.com/) you can download an 'amateur fashion Recta'.   \nIs someone working on Novarese's 'Garaldus', 'Magister' or Nebiolo's 'Forma'?\n\n"
    },
    {
      "time": "6 Jul 2004 — 4:37pm",
      "content": "I would not be surprised if more than one designer is working   \non a digitization right now. That was the story with Nebiolo's Recta.\n\n"
    },
    {
      "time": "6 Jul 2004 — 9:01pm",
      "content": "Not published yet, but someone reputable is working on it.\n\n"
    },
    {
      "time": "27 Aug 2011 — 3:06am",
      "content": "And now we have two \"interpretations\", one worse than the other, from Durotype and Canada Type.  \nDon’t know who was the \"someone reputable\" mentioned by Stephen, but I have been working very sporadically on a \"philological\" digital version for a few years, and I admit I am pretty disturbed by these bad quality \"hacks\", made without a care.\n\nIf you have to reinterpret and use something as a basis, Kris Sowersby’s Karbon is a serious effort, not these.\n\nWhile I am at it, I just received FontShop's newsletter  \nIn this statement:  \n«Aldo Novarese’s work for the Nebiolo Foundry in the 1930s led to several types that were rigid and modernist, but always designed the Italian way, with the hand and human proportion in mind. One such was Neon, the model from which Canada Type’s Patrick Griffin developed the Gala family.»  \nthere are more errors than words. Very professional. :)\n\n"
    },
    {
      "time": "29 Aug 2011 — 6:22pm",
      "content": "> who was the \"someone reputable\" mentioned by Stephen\n\nThey never released their version because they couldn't get in touch with the rights holders or Novarese’s estate.\n\n> FontShop's newsletter\n\nI didn't write this newsletter (nor have I since August 2010), but I imagine the errors come from the writer relying on the foundry's description. Care to make some corrections? I'm sure FontShop would oblige.\n\n"
    },
    {
      "time": "29 Aug 2011 — 8:00pm",
      "content": "In the 30’s Aldo Novarese was in his teens. He had barely started at Nebiolo at the end of the 1930’s, if I remember correctly. Maybe he’s talking about Alessandro Butti instead? Neon is a design by Giulio Da Milano, it has nothing to do with Novarese.\n\n"
    },
    {
      "time": "16 Nov 2011 — 12:15pm",
      "content": "Antonio has already made the corrections.  \nI add that Novarese never designed typefaces \"rigid and modernist\", and neither Butti, for what matters. The first efforts by Butti, dating from the 1920s, show a fascination with the sinuous forms of late-19th century letters, and he never designed anything \"rigid\".\n\nThe first works by Novarese should be the Etruria series, from 1939 onwards, if I recall correctly. Ah, Stephen, I hope if someone chooses the Canada Type \"reinterpretation\" of Semplicità, he will dig deep. I would not do it.\n\n"
    },
    {
      "time": "18 Nov 2011 — 9:18am",
      "content": "Claudio, would you care to explain why you think Semplicita Pro is a \"bad quality hack\"? It took me and Bill Troop almost three years to finish that family. Reputable veteran type designers and art directors served as consultants on its development. We have received nothing but kudos from people who have licensed it.\n\nHelp me understand your perspective please.\n\n"
    },
    {
      "time": "18 Nov 2011 — 11:22am",
      "content": "It's not a quality issue, but one of interpretation.  \nI suspect, by his use of the term \"philological\", that Claudio thinks that in updating the type (rather than producing an authentic revival) you have strayed too far from the original.\n\n"
    }
  ]
}
