{
  "id": "54897",
  "title": "ABgD's Identity",
  "forum": "ABgD's blog",
  "tags": [

  ],
  "content": "[![Photobucket](http://web.archive.org/web/20110314165031im_/http:/i118.photobucket.com/albums/o96/desAyn/ABgDCC.jpg)](http://web.archive.org/web/20110314165031/http:/s118.photobucket.com/albums/o96/desAyn/?action=view&current=ABgDCC.jpg)\n\nWord mark, I am designing to reflect my own identity.\n\nWord ABgD (pronounced Abjad) literally means letters A B G and D representing the original order of Phoenician alphabets. The closest example today can be seen in Greek (Alpha, Beta, Gama, Delta). Abjad is a type of writing system in which each symbol stands for a consonant; the reader must supply the appropriate vowel. This is the very philosophy that I practice under brand name ABgD - I provide consonants and the client provides the vowel. The contribution of client is important as it gives meaning to my work.\n\nAll known abjads belong to the Semitic family of scripts. These scripts are thought to derive from the Proto-Sinaitic alphabet (dated to about 1500 BC) which is thought to derive from Egyptian hieroglyphs. The abjad was significantly simpler than the earlier hieroglyphs. The number of distinct glyphs was reduced tremendously, at the cost of increased ambiguity.\n\nThe first abjad to gain widespread usage was the Phoenician abjad. Unlike other contemporary scripts, such as Cuneiform and Egyptian hieroglyphs, the Phoenician script consisted of only about two dozen symbols. This made the script easy to learn, and Phoenician seafaring merchants took the script wherever they went. Phoenician gave way to a number of new writing systems, including the Greek alphabet, the first \"true\" alphabet, and Aramaic, a widely used abjad. Greek evolved into the modern western alphabets, such as Latin and Cyrillic, while Aramaic became the ancestor of many modern abjads and abugidas of Asia.\n\nAramaic spread across Asia, reaching as far as India and becoming Brahmi, the ancestral abugida to most modern Indian and Southeast Asian scripts. In the Middle East, Aramaic gave rise to the Hebrew and Nabataean abjads, which retained many of the Aramaic letter forms. The Syriac script was a cursive variation of Aramaic. It is unclear whether the Arabic abjad was derived from Nabatean or Syriac.\n\nI hope you like the concept and design. I am open to ctritique - to learn and to proceed.\n\n| Attachment | Size |\n| --- | --- |\n| [ABgD.jpg](http://web.archive.org/web/20110314165031/http:/typophile.com/files/ABgD.jpg) | 89.34 KB |\n| [ABgDcolr.jpg](http://web.archive.org/web/20110314165031/http:/typophile.com/files/ABgDcolr.jpg) | 134.27 KB |\n| [ABgDapplied.jpg](http://web.archive.org/web/20110314165031/http:/typophile.com/files/ABgDWordpressBlog2.jpg) | 79.81 KB |\n\n",
  "author": "<a href=\"/web/20110314165031/http://www.typophile.com/user/42349\" title=\"View user profile.\">ABgD</a>",
  "time": "<br>",
  "uid": "42349",
  "comments": [
    {
      "time": "",
      "content": "@ It is unclear whether the Arabic abjad was derived from Nabatean or Syriac...\n\nFrom neither one. Derived from Himyari of Yemen 4000 B.C.\n\n ![](http://web.archive.org/web/20110314165031im_/http:/typophile.com/files/Himyari_3461.jpg)\n  \nAs proven by these 2 distinguished books:  \n [http://www.almanar.com.lb/NewsSite/NewsDetails.aspx?id=72693](http://web.archive.org/web/20110314165031/http:/www.almanar.com.lb/NewsSite/NewsDetails.aspx?id=72693 \"http://www.almanar.com.lb/NewsSite/NewsDetails.aspx?id=72693\")  \n [http://rapidshare.com/files/197960046/khatwakitaba.pdf](http://web.archive.org/web/20110314165031/http:/rapidshare.com/files/197960046/khatwakitaba.pdf \"http://rapidshare.com/files/197960046/khatwakitaba.pdf\")\n"
    },
    {
      "time": "",
      "content": "oh that's something new for me, I will sure look into that :)  \nThanks Aziz\n\n"
    },
    {
      "time": "",
      "content": "the concept seems a tad esoteric but I like the mark!\n\n"
    },
    {
      "time": "",
      "content": "Thats the word to describe it aluminium. I am inspired with asotericism. Thanks for liking the mark :) The first wordmark I designed was itslft very esoteric (the mark itself) but i redisigned it to this after critiques i got, as it was too much esotericism.\n\nFeel free to suggest anything u like, I am open to learning:)\n\nABgD\n\n"
    }
  ]
}
