{
  "id": "5490",
  "title": "Hello, we are tart.",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "My girlfriend (who's also a designer) and I are starting our own design studio here in Seattle... we're calling it **tart** because of an inside joke (and also because of the yummy tasty pastry). We spent most of the day brainstorming and working on this logo and would like to get some outside thoughts on it.   \nThe type is a tweak of Franklin Gothic.   \n   \n   \n ![tart.](http://web.archive.org/web/20131011025426im_/http:/www.typophile.com/forums/messages/29/39971.gif)\n\n",
  "author": "antiuser",
  "time": "5 Jul 2004 — 10:02pm",
  "uid": "1231",
  "comments": [
    {
      "time": "5 Jul 2004 — 10:13pm",
      "content": "looks good so far, could we see it smaller as well? ![:-)](http://web.archive.org/web/20131011025426im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "5 Jul 2004 — 10:18pm",
      "content": "Here's a smaller version with the colours we'll be using (yeah, all of those... not all at the same time, of course).   \n   \n   \n ![](http://web.archive.org/web/20131011025426im_/http:/www.typophile.com/forums/messages/29/39974.gif)\n\n"
    },
    {
      "time": "5 Jul 2004 — 10:29pm",
      "content": "it looks good small.   \n   \nthe \"ar\" pair seems tight compared to the others although of course if you increase kerning there you might need to do the same elsewhere. it's just the neg space between the \"r\" and the last \"t\" that is bothering me: too big compared to the others.   \n   \nthe symbol is not doing much for me as it is, the logotype is the star here. i'm not sure what to suggest tho.   \n   \nlast thing: i like the period. gives it character and this sense that this is part of a larger story.\n\n"
    },
    {
      "time": "6 Jul 2004 — 6:43am",
      "content": "hi adriano   \n   \ni like a lot, my only comments about the tart are, what if you do a simplify version in the tart (less curves), and this is just an idea, but what if your extraction looks more like a bite.   \n   \nBTW, i agree with marcelo about the ar.   \n   \nnice, i like it   \n   \nCG\n\n"
    },
    {
      "time": "6 Jul 2004 — 6:44am",
      "content": "Reminds me of a cotton company. I agree with marcelo, \"right now\" the symbol seems unecessary.   \n   \nWhen I read the word \"tart\" I immediatly smack my lips..... then I wonder what the cotton ball has to do with the sour taste in my mouth.\n\n"
    },
    {
      "time": "6 Jul 2004 — 7:22am",
      "content": "I think you should reconsider the name if the 'inside joke' isn't absolutely fantastic. Or ... if we should comment on it here ... we ought to know about the joke.   \n   \nWhat I see is a pretty good logotype (together with the period, which I like too ... like the case of the british EAT. the period adds uniqueness to the mark) ... and the symbol is a tart of which someone has taken a bite. I think the tart/bite illustration isn't executed very well ... should look more natural.   \n   \nI agree that 'ar' is too tight.   \n   \nBut first of all ... give us the story behind tart. As it is now, I can't make any meaning of it.   \n   \n--   \nS\n\n"
    },
    {
      "time": "6 Jul 2004 — 7:26am",
      "content": "I like it. And I like it that you're not roping yourself into a single color combo.   \n   \nOne nice thing about the word \"tart\" is that it carries at least three connotations (in English) that I'm aware of -- the sour flavor, a pastry, and a hooker. That gives you a lot of edginess. Good stuff!\n\n"
    },
    {
      "time": "6 Jul 2004 — 9:14am",
      "content": "The name and the tweaked Franklin type are nice and clean.   \n   \nI'm wondering (like cristian and david) if the symbol and it's relation to the company could be made clearer to the viewer. Personally, I'm unclear as to what message the symbol is trying convey?   \n   \nHope this helps.\n\n"
    },
    {
      "time": "6 Jul 2004 — 11:15am",
      "content": "Adriano (and girlfriend):   \n   \nLike some of the others here, I also stared at your logo design for a little bit, trying to figure out what the connection was between the graphic and the type\n\n"
    },
    {
      "time": "6 Jul 2004 — 11:56am",
      "content": "I like the name, but not the typeface. This begs for something a bit more fun and a bit more display-oriented, rather than typesetting-oriented. A bit more geometric and a bit less industrial gothic. The design seems aimed towards the fun and friendly, but the type is pulling it in another direction.   \n   \nPersonally, I don't think the mark is such a big deal, but it definitely doesn't say 'this is a tart' to me at all, but if you both agree that this is a visual element that captures the essence of your studio, then convention be damned. If you'd like it to be more accessible, perhaps you should do something with crust and filling. Right now it looks like a bite, but the bite and the tart edge read as the same thing, which confuses both. Here's a photograph of a [stage prop tart](http://web.archive.org/web/20131011025426/http:/www.proppersource.com/images/foods/tart-rasp.jpg), which could be a good model for judging proportions of various details, since stage props are designed to read from a distance.   \n   \nThat said, it's a good sTart. (I couldn't help myself.) You've got an intriguing concept to work with.\n\n"
    },
    {
      "time": "6 Jul 2004 — 1:16pm",
      "content": "I personally think the logo would be more effective if it were more neutral. It's not a candy it's a design studio.\n\n"
    },
    {
      "time": "6 Jul 2004 — 6:47pm",
      "content": "Exactly, it's a design studio, not a hospital or a law firm. We don't need or want neutral.   \nThanks for the comments, everyone. Everything is being taken into account.\n\n"
    },
    {
      "time": "6 Jul 2004 — 8:02pm",
      "content": "How about if only the \"T\" in tart were reversed out of the cloud shape and the \"art\" would stay black? This would make a double meaning with the word ART so that it would read \"T\" \"ART\" as well as TART. The \"T\" could mean typographic, TEAMED (since there are 2 of you), or suit you to a \"T\". The ART would refer to your business function, an art/design studio.   \nIt would still be fun and playful but at least give the viewer a hint as to what you do. As it stands now, it could mean anything from a florist toi a baker.   \n   \nChrisL\n\n"
    },
    {
      "time": "15 Jul 2004 — 8:30am",
      "content": "I like what I see, but I have to be honest. when I first saw this, for a split nanasecond I saw \"Fart\" with a little poof cloud.\n\n"
    },
    {
      "time": "15 Jul 2004 — 8:33am",
      "content": "Peter, That is hilarious\n\n"
    },
    {
      "time": "15 Jul 2004 — 8:44am",
      "content": "\\> cool. I'm not the only one. I agree. i don't think it matters. \\> Probably only 2% will think this. Hopefully they won't be wealthy \\> clients!\n\n"
    },
    {
      "time": "27 Jul 2004 — 6:46pm",
      "content": "I just have to say that I love the name \"tart.\" With it's semi-sexual connotation, it's very edgy, but not to the point of being tasteless. On the contrary, I find it quite yummy. Good choice. ![:-)](http://web.archive.org/web/20131011025426im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "15 Jul 2004 — 8:38am",
      "content": "ha. ok now that peter has said that i saw it too. but ... BUT i don't think it matters. i like the tweaked franklin, i like the full-stop, and i like the pastry. i just wonder if bite out of the pastry could be more toothy looking. and i also think the color should be tart. like acid green or something.\n\n"
    },
    {
      "time": "15 Jul 2004 — 8:51am",
      "content": "kinda sad if the people that do notice it won't have a sense of humor about it. it is like our office phone number. the boss had a thing for ducks (it was the yuppie 80s) and so the last four digits of the phone number spell duck. but, unfortunately, that isn't the only thing it spells. the only clients i've had that have noticed that have had a sense of humor about it.\n\n"
    }
  ]
}
