{
  "id": "54911",
  "title": "Digital revivals of 20th century metal faces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The older faces such as Garamond and Bodoni, for which there are no extant working drawings, have of necessity been digitized with reference to printed specimens. Ironically, more recent better-documented designs such as Electra and Fairfield have perhaps suffered through not being digitized in this manner.\n\nWhich are the 20th century faces that have been digitized from printed specimens, with the attempt to create, in high-res offset output, a facsimile of letterpress typography?\n\n",
  "author": "Nick Shinn",
  "time": "17 Feb 2009 — 9:41am",
  "uid": "2021",
  "comments": [
    {
      "time": "17 Feb 2009 — 11:37am",
      "content": "Charles Nix's Nix Rift is a warts-and-all revival of Dwiggins's Eldorado with emphasis on rich letterpress-style color. David Berlow's revival of Eldorado was also undertaken without specific reference to the original drawings, if I recall. DB's digital revival of Juliana (which is on the docket for upcoming retail release this year) also referenced specimens.\n\nMatthew Carter's restoration of Monticello started from ancient digital data (which presumably came direct from drawings at some point in the evolution) but was reworked considerably specifically to get back the feeling of the letterpress Oxford and Linotype Monticello. There was a nice poster produced comparing the three versions when digital Monticello was released.\n\n(Of course, you could argue that the original Oxford was not 20th century, and so it's progeny don't qualify for your survey.)\n\n-- K.\n\n"
    },
    {
      "time": "17 Feb 2009 — 1:28pm",
      "content": "My Caslon will be another, as I studied the ink spread of letter press Lino Caslon Old Face. But I'd better get back to it :)\n\n"
    },
    {
      "time": "17 Feb 2009 — 1:53pm",
      "content": "But again, is that a 20th century face? Not quite sure what Nick's criteria is here.\n\n"
    },
    {
      "time": "17 Feb 2009 — 2:11pm",
      "content": "If the source material is printed from a 20th century cut, that would qualify.\n\nBut I think Bill's references are more diverse than just making a facsimile of Lino Caslon.\n\n"
    },
    {
      "time": "17 Feb 2009 — 2:39pm",
      "content": "Nick:\n\nCan we consider Bulmer & Dante here? If I'm following right, they can be considered \"twentieth-century\" faces. Both have survived well the transition to current-generation fonts. & you know I all but abandoned use of digital versions of metal faces years ago; so few came up to the mark.\n\nI use Bulmer quite a bit, and I am happy with its dense color on the page. Usually I do not care for the results when a metal face has had weights and other bells and whistles added. But with Bulmer I find the semi to be a useful addition. & some of the added-on sorts in expert and alternative fonts help me use that face. I was happy to see this when it came out, for I was not happy with the Alphatype Bulmer, which was all we had for a while, if I recall right. & even the lead Monotype Bulmer was difficult to make look good at times.\n\nI do not use Dante myself, but it appears to have survived also.\n\nI have no idea what the source material was for making these renditions. Maybe someone here does. I do recall that Monotype made a rather elaborate brochure about the \"new\" Bulmer in the early 90s. Don't ask me where my copy has gotten to, though.\n\nMonticello is quite well done, I agree.\n\nI rarely use Caslons, but I'm eager to see what Berkson comes up with.\n\npowers\n\n"
    },
    {
      "time": "17 Feb 2009 — 2:58pm",
      "content": "\\>references are more diverse than just making a facsimile of Lino Caslon.\n\nAs far as letter forms I am following more the original Caslon--and departing from it too--but I trying to capture the effect of 19th & 20th century letter press. The 18th Century, pre-Baskerville stuff is much heavier and more irregular--an undesirable 'antique' effect as far as I'm concerned.\n\n"
    },
    {
      "time": "17 Feb 2009 — 8:32pm",
      "content": "I started working on a digital adaptation of ATF Garamond from printed samples. It's useable but I never finished it. Fyris fonts also made a multiple master version which I believe was based on scans of printed materials, but they don't seem to be around anymore. I'd attach a PDF of my work, but it seems that only works for thread originators. The capitals are not perhaps not faithful in structure to the original, but the lowercase letters are, and both of them have some pretty realistic ink squash happening.\n\n ![](http://web.archive.org/web/20131019145416im_/http:/typophile.com/files/garamont_5468.gif)\n\n[Raph Levien](http://web.archive.org/web/20131019145416/http:/www.levien.com/type/myfonts/) made a few digitizations from the ATF specimen book, so these should qualify as well.\n\nCarter's digitization of Monticello is sweet; I'd like to be able to buy it someday.\n\n"
    }
  ]
}
