{
  "id": "54942",
  "title": "Besides the g",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/my_g_4803.png)\n\nHi, TPh's! This is a glyph I've been working for a while and need some help in deciding which trend to follow, if there's one:  \n---excuse me by relating the image---\n\n- #1 is the most 'normal', being the loop dominates the width\n- #2 is a variation I like: the link is wider than the loop (which is narrower) by its left side\n- #3 is similar to #1, except for the inflection in the link\n- #4 –quirky– is similar to #2 (narrower loop), but the sharp link\n\nForgive the noticeable imbalances: it is the shape as a whole what I'm trying to choose among these.  \nI guess the upper counter and the ear work fine for a text font, even though I need to refine the contrasts and the overweight in junctions, but there'll be time to.  \n [Here I post a PDF](http://web.archive.org/web/20150317190637/http:/typophile.com/files/my_g.pdf) for better inspection.\n\n**MarS**\n\n| Attachment | Size |\n| --- | --- |\n| [my\\_g.pdf](http://web.archive.org/web/20150317190637/http:/typophile.com/files/my_g.pdf) | 2.52 KB |\n| [my\\_g-evolution.pdf](http://web.archive.org/web/20150317190637/http:/typophile.com/files/my_g-evolution.pdf) | 1.61 KB |\n| [Typophile.pdf](http://web.archive.org/web/20150317190637/http:/typophile.com/files/Typophile.pdf) | 38.71 KB |\n| [KindaTest.pdf](http://web.archive.org/web/20150317190637/http:/typophile.com/files/KindaTest.pdf) | 41.71 KB |\n| [SpringKindaTest.pdf](http://web.archive.org/web/20150317190637/http:/typophile.com/files/SpringKindaTest.pdf) | 42.05 KB |\n\n",
  "author": "Marcelo Soler",
  "time": "18 Feb 2009 — 4:49am",
  "uid": "32203",
  "comments": [
    {
      "time": "18 Feb 2009 — 7:01am",
      "content": "As you say, 1 and 3 are good, normal forms. I like 2 as well, but wonder how it will fit with the rest of the glyphs. I also wonder if you could lengthen the descender a bit as well, at least for display settings. 1 & 2 together might give some interest for words with two gg's (eggs, for example).\n\n4 is odd, but not unserviceable. What would it look like if the like joined the bowl a tad bit higher? (The angle of the straight edge of the sharp link catches my eye.) Or perhaps drop the right part of the loop a bit to balance.\n\n"
    },
    {
      "time": "18 Feb 2009 — 7:33am",
      "content": "Steve,\n\nI think it's a very nice idea to create the gg glyph from the 1/2 variations.\n\nI'll experiment your suggestions and post the results, as well as some words to see how my g's work among other characters.  \nThanks,\n\nBRB\n\n**MarS**\n\n"
    },
    {
      "time": "18 Feb 2009 — 8:55am",
      "content": "Personally I feel the most for #1. I don't like it when the link extends so far out as the second one. :)\n\nFollowed by #3, but that depends if the cut shape of the link can be found somewhere else in the typeface too.\n\n"
    },
    {
      "time": "18 Feb 2009 — 10:26am",
      "content": "Well: I made two tests using options #1 and #2.  \nTry #1:\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/my_big_g_3733.png)\n  \n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/my_g_text_3880.png)\n\nTry #2:\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/big_g_4227.png)\n  \n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/g_text_3639.png)\n\nActually, I prefer my original (#1) try the most:\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/Gg_5595.png)\n  \n(May be I must work on the ear connection)\n\nLet me know your thoughts.\n\nCheers,\n\n**MarS**\n\n"
    },
    {
      "time": "18 Feb 2009 — 10:31am",
      "content": "Option 2 does look wonky. (How about the gg with 1&2?)\n\n"
    },
    {
      "time": "18 Feb 2009 — 11:24am",
      "content": "Ah, the hardest [Latin] glyph!\n\nThe thing about the \"g\" is, I feel there's a large gulf between what the reader needs and what other type designers expect. There are very few binocular \"g\"s that I personally like, and there's a lot of room for improvement on the conventional forms.\n\nSpecifically:  \n- The closed bottom makes the form too complex - almost Chinese. It does not belong in the Latin alphabet (even though we're consciously used it to by now). I'm a big fan of the open bottom - although it's much harder to pull off. Even Baskerville's is non-ideal - too apologetic.  \n- The thick top of the bottom bowl should not be very horizontal, and -assuming your font has stroke contrast- should get thicker on the right. To me the conventional flat, evenly-thick stroke is a disaster\\*. HOWEVER, you probably cannot make the bottom of \"g\" entirely like [most of] the rest of the alphabet; it's better to emulate the \"s\". Thanks in part to Roy Preston's designer's intuition many years ago, I personally arrived at this:\n\n\\* Unless maybe you have a \"z\" with thick horizontals.\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/g_6558.gif)\n\nhhp\n\n"
    },
    {
      "time": "18 Feb 2009 — 11:25am",
      "content": "Steve:  \nOnly for fun purposes (though one can think a lot about it):\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/eggs_5109.png)\n  \nEven in that rough example, the first option –secong g has its loop narrower– works better, for me, than the second one. Ain't it?  \nA further exploration could include some kind of ligature...\n\n**MarS**\n\n"
    },
    {
      "time": "18 Feb 2009 — 12:12pm",
      "content": "In context, #1 is immensely better than #2 to my eyes.\n\nThe funkiest wide-link g I know is Fenice:\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/Picture_5944.gif)\n\nLooks like a king cobra to me!\n\n"
    },
    {
      "time": "18 Feb 2009 — 12:58pm",
      "content": "<cite>Even in that rough example, the first option –secong g has its loop narrower– works better, for me, than the second one.</cite>\n\nI completely agree. I think the combination is rather pleasing.\n\n"
    },
    {
      "time": "18 Feb 2009 — 1:00pm",
      "content": "See also [Borges, by Argentine designer Alejandro Lo Celso](http://web.archive.org/web/20150317190637/http:/www.fontshop.com/search/?q=Borges&btnG.x=24&btnG.y=10&site=d). Its g has a rare wide-broken link.\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/borGes_5562.png)\n\n**MarS**\n\n"
    },
    {
      "time": "18 Feb 2009 — 1:43pm",
      "content": "Hey, Hrant:\n\nhave this rough try...\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/odd_g_3768.png)\n\n**MarS**\n\n"
    },
    {
      "time": "18 Feb 2009 — 4:01pm",
      "content": "I like open tails too. The one with the non-smooth link to the bowl, number 3 is my favourite of the original four you posted. But, as Jelmar said, that kind of feature should be repeated in other glyphs or it won't fit.\n\nHave you tried flipping the ear vertically?\n\nWhat was Fenice designed for? It's an odd-looking creature all round!\n\n"
    },
    {
      "time": "18 Feb 2009 — 5:38pm",
      "content": "Marcelo, I think that open \"g\" is pretty good.  \nIt's leaning right a bit (although I think mine is too).\n\nhhp\n\n"
    },
    {
      "time": "18 Feb 2009 — 6:55pm",
      "content": "I like 1 and 3, although I think it depends on what you do with the rest of the glyphs--if there's a theme, then either one could be equally fine.\n\nI like the open tail as well--you should set that in your login burger example.\n\n"
    },
    {
      "time": "19 Feb 2009 — 3:22am",
      "content": " **Ben, Hrant, Merkri:**  \nI'm working hard in that open loop you like. Initially I was not much enthusiastic, but I need to tell that Hrant triggered my never-answered ancient doubts (concerns) about the causes of current _\"too complex - almost Chinese\"_ shape of lc closed loop g.  \n I can easily assume the transition from the UC to the open lc –it is very appropriate considering lc were tied to manuscript writing–, but when I had to face production, and the original design was a 'traditional' closed loop g, I felt a big confusion: the unnatural changes in the thicknes of strokes, and even the disruption between the top and the bottom ones, made me think there was some kind of undecipherable secret formula. I don't know why I gave in and went along with the crowd.  \nFinally, I believe my g will be open tail.\n\n**Craig, Merkri and Steve:**  \nHere it goes a \"flogger\" (by the moment I cannot write _hamburgefons_ and anyway it doesn't match my purposes) new sample of the quasi-ligature g\\_g, where one can realize that the first uneven solution is much better than the second (duplicated g) one. I guess it will be a good –and funny– step for futher investigation.\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/ligatures_4001.png)\n\nCheers,  \n**MarS**\n\n"
    },
    {
      "time": "19 Feb 2009 — 4:15am",
      "content": "I wonder if the left g –forgive the unsolved terminal– wouldn't be less eye catching and more pleasant than the right one...\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/toggle_3653.png)\n  \n**MarS**\n"
    },
    {
      "time": "19 Feb 2009 — 4:23am",
      "content": "In your 'flogger' picture, the difference in the lower bowl size is distracting to me. Could the lower bowl extend further to the right side to compensate for the inward movement of the left side?\n\nIn 'toggle', I think the difficulty will be solving the terminal. It needs to stay in the style of the rest of the font, so I guess that depends on s. It may not need to be as strong a serif as the one on the right. I do prefer the left one, so perhaps it could take its lead from the terminal on the letter e?\n\n"
    },
    {
      "time": "19 Feb 2009 — 4:43am",
      "content": "Like Bendy, I don't like the different bowls in consecutive 'g's. Might be worth trying, in the case of consecutive 'g's, offsetting the bowls away from each other (and maybe reducing their size by the same amount) rather than what you have done in the first 'flogger'.\n\n"
    },
    {
      "time": "19 Feb 2009 — 5:54am",
      "content": " **Ben and Craig:**  \nSomething like that?\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/flogger_6347.png)\n  \n[Perhaps it's me, but the second loop seems now optically bigger and needs to be narrowed a bit]  \n**MarS**\n"
    },
    {
      "time": "19 Feb 2009 — 6:07am",
      "content": "Yes, that looks better to me. Bottoms are still close to each other, but actually I think you could simply space the letters apart a touch. I would do that first, then see if your eye still wants some narrowing of the loop.\n\n"
    },
    {
      "time": "19 Feb 2009 — 6:20am",
      "content": "You are right, Craig.  \nThe quiz now will be making that open loop g fits...\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/login_6671.png)\n  \nMay be it will be easier not to deal with the counter, though I still think it heavily falls to the right.  \n[Gods! I'm being too much feedback demanding]\n\n**MarS**\n\n"
    },
    {
      "time": "19 Feb 2009 — 7:13am",
      "content": "It's satisfying to hear that my open \"g\" argument clicked. You should know however that some big names in type design do not agree, and this includes people who cannot be accused of being slaves to precedent, such as David Berlow. But perhaps you can change his/their mind with a result they can't help but like! :-)\n\nIn your post of 4:15am, the first \"g\" still needs polish of course, but it could work depending on other glyphs in the font, especially the \"a\": will it have a tapering top or a serifed one? What about the \"s\"? I'm guessing that will have serifs on both ends.\n\nhhp\n\n"
    },
    {
      "time": "19 Feb 2009 — 9:46am",
      "content": " **Hrant** :  \nThe answer to your question about the s is immediatly above your post, together with my first sketch for inserting a slightly smaller serif to get some air in the tail of the g otherwise I'd missed.  \nThe a is still under construction.\n\n**MarS**\n\n"
    },
    {
      "time": "19 Feb 2009 — 10:12am",
      "content": "_—Daddy, what is this letter?  \n—It's a letter \"g\".  \n—No, it's not.  \n—Yes, it is. It's just a lowercase letter. A small one.  \n—But, what's the squiggle at the bottom?_\n\n:-)\n\n**MarS**\n\n"
    },
    {
      "time": "19 Feb 2009 — 11:26am",
      "content": "If you go back to the closed form you can always use the open one as a horned-o-with-cedilla. :-)\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:12pm",
      "content": "I'm a member of the Open Tailed Lower Case g Society as well. The secret handshake involves grasping the hands but never closing them. But I've said too much already.\n\nMy experience with opening the tail on a g usually ended with narrowing the lower bowl a bit and/or slightly expanding the upper bowl (less often). Otherwise, the g can look like it's unraveling at large size and under 12 point can look too light.\n\nWhat seems like (and is) an intriguing treatment requires whole new tricks to achieve balance and even coloring with the other letters. But it can certainly be worth it and I like the direction you're heading.\n\n"
    },
    {
      "time": "20 Feb 2009 — 3:39am",
      "content": "My \"horned-o-with-cedilla\" looks very sexy.\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/cedilla_4334.png)\n\nWhere do I get a membership for the OTLCgS Xtian?  \n ;-)\n\n**MarS**\n\n"
    },
    {
      "time": "20 Feb 2009 — 7:52am",
      "content": "Too Cheltenham. Occupational hazard of combining architecture and type design. :-)\n\n"
    },
    {
      "time": "20 Feb 2009 — 8:36am",
      "content": ":-\\>  \n(Still, better than photography.)\n\nI think that \"g\" is good for a display cut, but maybe too dramatic for text.\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2009 — 10:27am",
      "content": ":-D\n\nI just was kidding on Craig's comment _\"If you go back to the closed form you can always use the open one as a horned-o-with-cedilla\"_.  \nForget about it. :-S\n\n**MarS**\n\n"
    },
    {
      "time": "21 Feb 2009 — 1:06pm",
      "content": "I've tried these two alternatives:\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/gg_4223.png)\n  \nThe first is softer. The second is more s alike (the serif is slightly clockwise rotated to avoid an undesired horizontal).  \nI guess the way is probably the second one, with minor adjustments, which matches the font _ductus_:  \n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/got_6444.png)\n  \n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/login_3554.png)\n  \nOr even the same, but making its bottom stroke thicker:  \n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/burger_3679.png)\n  \nI'll see them tomorrow, when my eyes get some rest.\n\n**MarS**\n\n"
    },
    {
      "time": "21 Feb 2009 — 2:14pm",
      "content": "The second one, especially since overall your serifs are strong.\n\nhhp\n\n"
    },
    {
      "time": "21 Feb 2009 — 2:22pm",
      "content": "Definitely the second one, and the bottom one looks better (but that might be hinting).\n\n"
    },
    {
      "time": "22 Feb 2009 — 9:58am",
      "content": "My open loop g evolved to that:\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/Picture_1_4789.png)\n  \nThe ear is now bolder and points up.  \nThere are subtle optical corrections in the outline of the bowl.  \nEven when the link is shorter, it keeps the original starting angle.  \nThe tail has been softened and its spine leans to the right enough to avoid the previous left tilting of the figure.  \nThe serif is larger (the same size of the s's one), but doesn't sacrifice the air needed to make the loop looks open at small sizes.\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/Picture_2_6037.png)\n  \nI like the way it works between the nn (the ear plays well with the top serif at the stem of the n) and oo, though I wonder if the bowl is light a bit in comparison –may be my idea–.\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/Picture_3_3782.png)\n  \nIn context, it seems to me elegant and very readable.\n\n—There's [a new PDF](http://web.archive.org/web/20150317190637/http:/typophile.com/files/my_g-evolution.pdf) for a closer inspection.\n\nPlease, let me know your thoughts.  \nCheers,\n\n**MarS**\n\n"
    },
    {
      "time": "22 Feb 2009 — 10:13am",
      "content": "That's one of the best open \"g\"s I've ever seen - good job!  \nMinor tweak: the inside of the join looks thick.\n\nSpacing: move it slightly left.\n\nhhp\n\n"
    },
    {
      "time": "22 Feb 2009 — 1:33pm",
      "content": "Wow! That is an amazing g. I agree with Hrant that it should sit to the left a bit more, but I disagree about the join looking too thick.\n\n"
    },
    {
      "time": "22 Feb 2009 — 1:42pm",
      "content": "Just to be clear: I didn't mean the point where the bottom comes out of the top (that might actually be a hair too _thin_) but just below the extrema on the inside.\n\nhhp\n\n"
    },
    {
      "time": "22 Feb 2009 — 2:11pm",
      "content": "Ah, _now_ I see what you mean. Yes, that is too thick. (And I agree that the join I was looking at seems a bit too thin.)\n\n"
    },
    {
      "time": "22 Feb 2009 — 2:41pm",
      "content": "I was working on that \"excess\" earlier.  \nThe child (corrected), the parent:\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/legacy_6394.png)\n  \nI think the first improves the second one.\n\nBetter spacing:\n\n ![](http://web.archive.org/web/20150317190637im_/http:/typophile.com/files/lego_4046.png)\n\nThanks, guys!\n\n**MarS**\n\n"
    },
    {
      "time": "22 Feb 2009 — 3:41pm",
      "content": "I think you went too far left.  \nBut to be sure we need \"ngn\" and \"ogo\" for starters.\\*  \nThen after control strings I use adjacency frequency:  \n [http://www.themicrofoundry.com/other/kf\\_adj.pdf](http://web.archive.org/web/20150317190637/http:/www.themicrofoundry.com/other/kf_adj.pdf \"http://www.themicrofoundry.com/other/kf\\_adj.pdf\")  \nSo for the \"g\" I would first look at \"n\" on the left and \"e\" & \"h\" on the right, then \"a\" & \"i\" on the left and \"g\", \"o\" & \"r\" on the right, etc.\n\n\\* Assuming of course that \"n\" and \"o\" are properly spaced.\n\nAbout that PDF:  \n1) I apologize that it's so ugly.  \n2) That email address no longer works.\n\n(BTW, not \"extrema\" but \"extremum\", sorry.)\n\nhhp\n\n"
    },
    {
      "time": "22 Feb 2009 — 3:49pm",
      "content": "Looks like a really useful pdf, thanks Hrant, but what does 'decimal order of magnitude lower frequency' mean for the letters with asterisks one or both sides? And the hyphens?\n\n"
    },
    {
      "time": "22 Feb 2009 — 6:01pm",
      "content": "Decimal order of magnitude lower means ten times less frequent. Maybe overly fancy language, especially considering I don't show any numbers, but it _is_ actually a reflection of the numeric cutoffs I chose, so to some extent hopefully useful. The hyphens are sort of the same thing, so anything beyond a hyphen is really quite rare (and if that side is asterisked to boot I probably should've just dumped it). I guess I should replace the hyphens with asterisks... except that would make the thing even uglier!\n\nhhp\n\n"
    },
    {
      "time": "22 Feb 2009 — 10:40pm",
      "content": "Wow! Thanks for sharing that, Hrant. I was asking around for something like this recently but didn't find out about the Brown corpus.\n\nMarcelo: There's not so much I can help or offer I think, but wanted to say I'm all excited about your new \"g\". Congratulations! I think it is really beautiful, and adds a lot of determination & personality to your font.\n\n"
    },
    {
      "time": "23 Feb 2009 — 1:00am",
      "content": " **Hrant:** Thank you for your valuable help with your _frequency sampler_. I'll need to build one for Spanish and Portuguese texts in order to adjust the font to its main intended usage.\n\n**Steve & Nina:** Thanks for your support.\n\n**Nina:** Do you ever sleep, girl? :-)\n\n**MarS**\n\n"
    },
    {
      "time": "23 Feb 2009 — 3:59am",
      "content": "I've been working for a while in a Letter Frequency Meter I think may be useful.  \nGiven a text, it counts the number of characters, their occurrence, the number of words, consontants, vowels, accented, ascenders and descenders, the word length, the letter frequency, and the occurrence of sequences of two (pairs) and three associated characters.  \nI'll post the web address when it becomes available.\n\n**MarS**\n\n"
    },
    {
      "time": "23 Feb 2009 — 8:34am",
      "content": "IIRC since I made that table (by hand :-) there have been a couple of online tools that let you dump text into them, and they spew out all kinds of stats.\n\nBTW, this might sound far-fetched, but lacking language-specific data, using data from a similar language is better than nothing. For example English and Spanish are more similar than different; and Spanish & Portuguese are brothers. Although of course if you have language-specific data (and you're reasonably sure the font will mostly be used for one language) that's much better.\n\nhhp\n\n"
    },
    {
      "time": "23 Feb 2009 — 12:53pm",
      "content": "I'm thinking that locating, or even making, tools to evaluate given data is likely to be much less of a concern today than first finding a data base that is comprehensive enough to make sense on a somewhat general level. Which is why I'm all excited about that Brown corpus.  \nNot to completely hijack this thread though… FWIW, the other one is here: [http://typophile.com/node/54971](http://web.archive.org/web/20150317190637/http:/typophile.com/node/54971 \"http://typophile.com/node/54971\")\n\n"
    },
    {
      "time": "23 Feb 2009 — 3:46pm",
      "content": "Perhaps you've got every reason on earth, Nina, but unfortunately:\n\n1. I'm not sure about what criteria one must follow to build such a comprehensive database:\n  1. Processing all words of a given language (let's say, at least 30 K to 60 K words), though... what about punctuation and other characters?\n  2. Processing large amounts of relevant text written in a given language (countless books) as is, though... what is relevant at all?\n  3. Processing thes large amounts of relevant text written in a given language, and its capitalized version.\n2. Solved the first question, how many pairs one must consider relevant for kerning? (I assume over 600 pairs become unmanageable for both, the designer and the font spacing processor).\n3. How can one discard without pain those pairs that don't need individual kerning, i.e.: \"no\", \"on\", \"nn\", \"oo\", etc.\n\n[My modest unfinished engine](http://web.archive.org/web/20150317190637/http:/www.bycsrl.com.ar/gallery/lfm.php) is just a try in the sense of finding frequent occurrences of letter pairs (\"no\") and neighbors (\"non\") by mining in the web.\n\nWhen finished, it will automatically search among pages written in a given language, and then will process them in order to create an evolving (evolutive?) database of recurring associated letters, so as, for the end user, the interface will only show a sortable list of instances to research on, something like it displays once you process the entered text in the alpha version.\n\n**MarS**\n\n"
    },
    {
      "time": "23 Feb 2009 — 4:08pm",
      "content": "_\"I’m not sure about what criteria one must follow to build such a comprehensive database\"_  \nNeither am I!  \nI believe this is an issue best tackled by scientists and serious researchers (and must have been). There's a load of knowledge and brain power behind making a serious selection, and I believe that shouldn't be taken lightly.\n\nYour engine looks interesting – what did you program it in, is that just PHP string analysis?  \nSo it's going to crawl web pages? Cool approach. That may be highly interesting for developing screen fonts at the very least. (It would be interesting to have a comparison of words / letter combinations used in web sites and in print – I wonder how much of a difference there is.)\n\n"
    },
    {
      "time": "23 Feb 2009 — 4:49pm",
      "content": "_\"It would be interesting to have a comparison of words / letter combinations used in web sites and in print\"_\n\nNice-clever consideration.\n\nIntuitively, I tend to believe that web crawling will return much more typical pattern redundance than analyzing printed text, being the (conscious/un conscious) concision of online writing. I guess it will bring a lot of punctuation marks, as well.\n\n;-)\n\n[BTW, you can sort the colums of the engine by clicking on their headers.]\n\n**MarS**\n\nPS: I forgot to say that I have built a 216,555 English words pure-text-database, weighing 2.19 MegaBytes... :-S\n\n"
    }
  ]
}
