{
  "id": "54954",
  "title": "Do designers make great lovers?",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "Thats right, you read the title correctly and yes this is the worlds most soppy blog post and probably also the most embaressing, but im going to post it anyway. With Valentines day just passed came a wave of fantastically creative gift ideas from all great designer partners out there. So the purpose of this post is to show some of the (hopefully) creative ways in which I have spoiled that special someone.\n\n101 reasons to fall in love\n\n ![](http://web.archive.org/web/20130516091903im_/http:/typophile.com/files/jo1_4282.jpg)\n\n ![](http://web.archive.org/web/20130516091903im_/http:/typophile.com/files/jo2_4420.jpg)\n\n ![](http://web.archive.org/web/20130516091903im_/http:/typophile.com/files/jo3_6068.jpg)\n\n ![](http://web.archive.org/web/20130516091903im_/http:/typophile.com/files/jo4_5028.jpg)\n\n ![](http://web.archive.org/web/20130516091903im_/http:/typophile.com/files/jo5_5725.jpg)\n\nOK, so there are tones of 100 reasons why I love you, so I wanted to do something a tiny bit different and added 1. I also did vector illustrations for 50 reasons and. The book was professionally printed with a hard back front and back cover. I stuck with avante garde throughout and with primary colours of black and pink consistent to maintain the identity.\n\nA chapter of a story every day\n\n ![](http://web.archive.org/web/20130516091903im_/http:/typophile.com/files/book1_5112.jpg)\n\n ![](http://web.archive.org/web/20130516091903im_/http:/typophile.com/files/book2_4076.jpg)\n\nSo this was for a woo week thing type event we had at work. The idea is that you draw someones name from a hat and spend the week wooing that lucky someone in secret. I teamed up with the creative copywriter of the company, and together we made and illustrated stories with a different chapter everyday. The story featured that lucky girl in question as the hero as she enjoyed an underwater adventure. I used one basic illustration style and make tweaks to the layout and colours on everypage to offer some variation. The primary colours also changed daily, but because of the consistent elements it kept its identity. Style wise I kept it prtty simple with vector style geometric shapes. Was very influenced by Keane under the sea album.\n\nCards\n\nThis should be a standard for all Graphic Designers as far as im concerned. These are a couple of examples I have done for friends. They are out of an A3 card on a heavy HP media paper. The paper is so nice and textured that a simple design works best. Add a message on the flap, fold three ways and tie with a ribbon. The fact that all thirds of a three way folded card are the same makes it pop up which gives the ribbon a really nice effect. Ultimately the result is a lovely hand made card, personalised. What more could any girl or boy want?\n\n ![](http://web.archive.org/web/20130516091903im_/http:/typophile.com/files/cards_5681.jpg)\n\nSo thats it from me...thats what I have done...any thoughts, feedbacks or opinins welcome!\n\nany one else done anything graphically romantic recently, would love to hear about it?\n\nseen anything great that would work on a special occasion?\n\nAll the best and keep the design love alive! x\n\n",
  "author": "chasteauneuf",
  "time": "18 Feb 2009 — 8:33am",
  "uid": "29870",
  "comments": [
    {
      "time": "18 Feb 2009 — 8:36am",
      "content": "Yes. Yes we do.\n\nWhen we aren't too into ourselves.\n\n"
    },
    {
      "time": "18 Feb 2009 — 9:29am",
      "content": "charming\n\n"
    },
    {
      "time": "18 Feb 2009 — 12:05pm",
      "content": "only if both (or all) parties are designers.. or megalomaniacs\n\n- Scott\n\n"
    },
    {
      "time": "18 Feb 2009 — 2:20pm",
      "content": "because you make someone a card?\n\n"
    },
    {
      "time": "18 Feb 2009 — 2:29pm",
      "content": "hah no! I was talking about 'lovers' in a more biblical sense:\n\nq: Do designers make great lovers?  \na: only if both (or all) parties are designers.. or megalomaniacs\n\njoke!\n\n- Scott\n\n"
    }
  ]
}
