{
  "id": "54967",
  "title": "logo critique please",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "[http://www.sharieaton.com/typophile/type.png](http://web.archive.org/web/20140725124903/http:/www.sharieaton.com/typophile/type.png \"http://www.sharieaton.com/typophile/type.png\")\n\n",
  "author": "salisae",
  "time": "18 Feb 2009 — 1:22pm",
  "uid": "12896",
  "comments": [
    {
      "time": "18 Feb 2009 — 2:21pm",
      "content": "I have no idea what it says!\n\n"
    },
    {
      "time": "18 Feb 2009 — 2:26pm",
      "content": "Yes tough to read. Does it say \"coded colors\"?\n\n"
    },
    {
      "time": "18 Feb 2009 — 2:39pm",
      "content": "Too trendy. This means nothing.\n\npenn\n\n"
    },
    {
      "time": "18 Feb 2009 — 2:45pm",
      "content": "my apologies -- this is for a web development company that also does some print work.\n\n"
    },
    {
      "time": "18 Feb 2009 — 4:10pm",
      "content": "Woops\n\nEdit: Must have pushed the wrong button... but while I am here, those are some wonderfully conceptual forms and you should explore them in your off time.\n\nI do agree with the others, kinda tough to discern. But do not go away downtrodden : )  \nMichael\n\n"
    },
    {
      "time": "19 Feb 2009 — 5:20am",
      "content": "I didn't really have the same legibility issues the others seemed to have.. Other than the fact that I spell colors 'colours' it looks cool, if not a tad hip.\n\n"
    },
    {
      "time": "19 Feb 2009 — 7:59am",
      "content": "Trendy? Sure. But it's lovely. Trendy isn't always bad...especially for design firms, who tend to be trendy and change their logo routinely anyways.\n\nYea, it's hard to read, but seems appropriate given the name.\n\nonly nit-pick is the overlap. Fudge the height of the L so it perfectly meshes with he form above it and odesn't leave that hairline or red.\n\nOr, possibly try it without the lower red node of the d. Instead have the l form the lower part of the d. Just an idea.\n\n"
    },
    {
      "time": "19 Feb 2009 — 3:50pm",
      "content": "Legibility does become an issue. If the general public is supposed to sort this out you will need to hand out decoder rings with the business cards. It's an interesting start, keep working at it.\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:54am",
      "content": "looks like a fontstruct font to me? am i right?\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:46pm",
      "content": "no but thank you for reminding me of fontstruct. perhaps i can get this sorted there.\n\n"
    },
    {
      "time": "20 Feb 2009 — 2:31pm",
      "content": "any better?\n\n[http://www.sharieaton.com/typophile/codedcolors2.png](http://web.archive.org/web/20140725124903/http:/www.sharieaton.com/typophile/codedcolors2.png \"http://www.sharieaton.com/typophile/codedcolors2.png\")\n\n"
    },
    {
      "time": "20 Feb 2009 — 4:15pm",
      "content": "I like this quite a bit…a tad hard to read but fun. The way the \"l\" knocks out the lower-left of the \"d\" works better for me than the first, transparent overlay, version…but I miss the colors of the first sample…the grey feels cold next to the blue.\n\nEverything reads good for me except the \"e\". It's nice visually, but without the other letters creating the word, I wouldn't be able to fill it in…adds to the \"coded\" angle though!\n\n"
    },
    {
      "time": "20 Feb 2009 — 7:52pm",
      "content": "i was able to easily read it in a few seconds with no question whatsoever\n\n"
    },
    {
      "time": "22 Feb 2009 — 3:34pm",
      "content": "thank you for your feedback!\n\n"
    },
    {
      "time": "15 May 2009 — 1:55pm",
      "content": "Last version is definitely better than the first. I like it. As Gerald mentioned, it was easy to read (the second version).\n\n"
    },
    {
      "time": "17 May 2009 — 2:30am",
      "content": "Hey sea\\_sea,\n\nI agree that the second one works better than the first. I was able to read it quite easily, but agree that others may not. The only \"trouble\" I have with it, is with the 's'. The top-right and bottom-left part seem to break your grid.\n\n"
    }
  ]
}
