{
  "id": "54969",
  "title": "Could you help me to find a mate for Futura?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey fellas!\n\nIt’s the first time I’m writing something around here, even though I’ve been following you for quite some time. And the reason I’m writing is that I really need some help.\n\nI’m a graphic design student and currently an intern at the Marketing Department of the university I study in. I’ve been assigned to redesign their brand guidelines, since the ones they have aren’t that good.\n\nThe issue I’m struggling with is that their primary typeface is Futura, but they don’t have a secondary one. I want to define a serif typeface as secondary, you know, for the sake of contrast. This serif family would be used to set long texts, letters and other stuff like that. I am aware of Bringhurst’s suggestion – to use a modern one, like Bodoni – but this combination looks too vanguardistic to me, as they define themselves as a regional, social institution.\n\nI was thinking in something more humanistic. Any suggestions on that? Oh, and it’s not possible to change Futura, since they already are well known for it.\n\nI’d really appreciate any help!\n\nThanks in advance.\n\n",
  "author": "hbeier",
  "time": "18 Feb 2009 — 1:47pm",
  "uid": "41309",
  "comments": [
    {
      "time": "18 Feb 2009 — 2:33pm",
      "content": "So far I've got ITC New Baskerville. Any thoughts?\n\n"
    },
    {
      "time": "18 Feb 2009 — 4:27pm",
      "content": "I went through a phase where I used Futura with Century Oldstyle a lot. They don't have a lot in common, other than a sturdy, no-nonsense appearance, but I do like the way they look together.\n\n ![](http://web.archive.org/web/20150415105503im_/http:/typophile.com/files/Futurabold_4792.gif)\n  \n\n ![](http://web.archive.org/web/20150415105503im_/http:/typophile.com/files/CenturyOS_5926.gif)\n\n"
    },
    {
      "time": "19 Feb 2009 — 11:41am",
      "content": "Thanks Victor!  \nThey sure look interesting together. I'll try that.  \nIf anybody else got another opinion, please share it.\n\n"
    },
    {
      "time": "19 Feb 2009 — 1:36pm",
      "content": "_...regional, social..._\n\n[http://www.myfonts.com/country/br/](http://web.archive.org/web/20150415105503/http:/www.myfonts.com/country/br/ \"http://www.myfonts.com/country/br/\")\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:40pm",
      "content": "Take a look at the Ikea catalogue, they pair Futura (or modified Futura) with a nice serif.\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:55pm",
      "content": "Charter might also work well. -- cs\n\n"
    },
    {
      "time": "23 Feb 2009 — 5:08am",
      "content": "I think the serif in the IKEA catalog is Century Schoolbook and I find it does go very well with Futura. It takes up some of the geometrical simplicity while providing a pleasant contrast in rhythm...\n\nThat being said, I'd stay away from looking just like IKEA. It's such a well known contemporary design that people will notice and wonder why your university's design looks like a furniture catalog.\n\nMaybe Frutiger's \"Egyptienne F\" would be something... It has a lot of simplicity is more geometric than Century Schoolbook... I think this could work, what do you think?\n\n ![](http://web.archive.org/web/20150415105503im_/http:/typophile.com/files/fe_4411.jpeg)\n\n"
    },
    {
      "time": "23 Feb 2009 — 11:22am",
      "content": "There is something contrasting about the strong x-height of futura and the expanded look of Schoolbook.\n\nMaybe a separation between the text and header would mitigate the effect but it doesn't seem likely.\n\n"
    },
    {
      "time": "24 Feb 2009 — 5:47pm",
      "content": "@ Nick Shinn: Well, thanks for the link. I really hadn’t thought about that. Unfortunately, Brazilian typography never had that much tradition and it consists basically of display typefaces. The only decent serif I found was Adriane Text, by Marconi Lima and Silas Dilworth. I’ll test it with Futura and I’ll post my thoughts later.\n\n@ Artur and Lars: IKEA catalogs really look good, but I got to agree with Lars: it would look just like IKEA, and that’s not what we’re looking for. And even though I like the combination Futura/Egyptienne, I’m not sure whether a slab serif typeface would suit the ‘social institution’ image they’re trying to pass. Or maybe I’m wrong?\n\nThanks again, folks!\n\n"
    },
    {
      "time": "24 Feb 2009 — 9:02pm",
      "content": "_Brazilian typography never had that much tradition and it consists basically of display typefaces._\n\nI find that hard to believe.\n\n"
    }
  ]
}
