{
  "id": "54999",
  "title": "Franklin Gothic - can it be a text face?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm in the process of making a text face comparision for non-designer colleagues, using familiar fonts bundled with various operating systems and programs. And also a few unfamiliar (to them) text faces for contrast.\n\nI know Franklin Gothic is known as a newspaper & advert headline face, but since it also comes with a lighter weight, is it ever suitable as a text face?\n\nTo me it looks businesslike, certainly not elegant, but preferable to Arial, for instance.\n\nThanks in advance.\n\n",
  "author": "dinazina",
  "time": "19 Feb 2009 — 8:33am",
  "uid": "21120",
  "comments": [
    {
      "time": "19 Feb 2009 — 8:45am",
      "content": "I wouldn't want to read anything longer than a brief memo in Franklin Gothic.\n\n"
    },
    {
      "time": "19 Feb 2009 — 8:47am",
      "content": "Trade Gothic would be a better choice.\n\nChrisL\n\n"
    },
    {
      "time": "19 Feb 2009 — 9:27am",
      "content": "Another vote for Trade Gothic.\n\n-------------------------------------  \n_Inventor of the DVD rewinder_\n\n"
    },
    {
      "time": "19 Feb 2009 — 9:52am",
      "content": "Franklin Gothic is perfectly suitable for text as long as you choose the right weight and point size. I use 9.5 pt. ITC Franklin Gothic Std Book Condensed for short articles and sidebars. I will choose it, News Gothic or Trade Gothic over Helvetica or Arial every day of the week.\n\n"
    },
    {
      "time": "19 Feb 2009 — 10:08am",
      "content": "Thanks everyone, this is useful.\n\n"
    },
    {
      "time": "19 Feb 2009 — 12:08pm",
      "content": "Franklin Gothic works for short text, as others have commented. For longer text, I prefer News Gothic or Benton Gothic/Benton Sans over Trade Gothic. However, I haven't examined the Trade Gothic Next series, which might be improved.\n\nWouldn't really use any of them for extended reading. More like sidebars and box text.\n\n"
    },
    {
      "time": "19 Feb 2009 — 2:29pm",
      "content": "I'm right there with Stan and Kent. I almost always use the condensed cuts of Franklin Gothic. It is one of my favorite typefaces.\n\npowers\n\n"
    }
  ]
}
