{
  "id": "54996",
  "title": "Mr. Carter Comes to Washington (on Monday at the Corcoran)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Matthew Carter will be lecturing at the Corcoran in Washington DC on Monday evening at 7:00PM. If any DC area type whackos are interested, it will be $25 bucks. See you there!\n\nChrisL\n\n",
  "author": "dezcom",
  "time": "19 Feb 2009 — 7:18am",
  "uid": "3135",
  "comments": [
    {
      "time": "19 Feb 2009 — 7:41am",
      "content": "Mike Duggan forward this earlier today from the Washington Post...\n\n[http://www.washingtonpost.com/wp-dyn/content/article/2009/02/18/AR200902...](http://web.archive.org/web/20131023222906/http:/www.washingtonpost.com/wp-dyn/content/article/2009/02/18/AR2009021803330.html?hpid=artsliving \"http://www.washingtonpost.com/wp-dyn/content/article/2009/02/18/AR2009021803330.html?hpid=artsliving\")\n\n\\>Matthew Carter will be lecturing at the Corcoran in Washington DC on Monday evening at 7:00PM.\n\nMy understanding is that this might start late if Matthew's meeting with Obama over-runs. I know our president has some questions around the design philosophy of Georgia's old-style-figs.\n\n"
    },
    {
      "time": "19 Feb 2009 — 7:40am",
      "content": "That's cool! Have fun!\n\n"
    },
    {
      "time": "19 Feb 2009 — 7:52am",
      "content": "It would happen a week after I leave town! I know the Corcoran students are very excited to have Matthew Carter coming to visit them.\n\n"
    },
    {
      "time": "19 Feb 2009 — 8:11am",
      "content": "Dez, I'll be there, too, with my friend Steph Doyle. Would love to meet you if possible.\n\n-------------------------------------  \n_Inventor of the DVD rewinder_\n\n"
    },
    {
      "time": "19 Feb 2009 — 8:37am",
      "content": "I'll be there, Bruce. I'll keep a lookout for you.\n\nJames, Bummer! Would have liked to have met you as well.\n\nChrisL\n\n"
    },
    {
      "time": "23 Feb 2009 — 10:03am",
      "content": "Anyone else going? I'm leaving shortly to make the 2-hr. trek. See you there! By the way, Chris, my friend Steph Doyle isn't the more famous one.\n\n--Bruce\n\n-------------------------------------  \n_Inventor of the DVD rewinder_\n\n"
    },
    {
      "time": "23 Feb 2009 — 11:12am",
      "content": "Bruce, fame is over-rated :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Feb 2009 — 11:32am",
      "content": "Alas, I have a conflict and can't make it :( Enjoy, everybody.\n\n"
    },
    {
      "time": "23 Feb 2009 — 11:37am",
      "content": "<cite>fame is over-rated</cite>\n\nThe movie or the TV show? ;-)\n\n"
    },
    {
      "time": "23 Feb 2009 — 12:24pm",
      "content": "Ask lady Di,\n\nChrisL\n\n"
    },
    {
      "time": "24 Feb 2009 — 3:08pm",
      "content": "Chris, how did it go? Any pearls of wisdom for us?\n\n"
    },
    {
      "time": "25 Feb 2009 — 12:02pm",
      "content": "First, I enjoyed meeting Chris. He's a great guy. During the Q&A at the end of Carter's talk, someone asked a great question that I'd never thought of before: \"Do you as a type designer find that what you want to put into a font differs greatly from what I, the graphic designer need from a typeface?\" Carter said that, yes, the needs are sometimes very different, but necessary to take into account.\n\nAbove, Chris makes the point about fame being overrated. Carter was introduced as a famous type designer, but humble, and I'd have to say that seems to be true. He's funny and self-effacing.\n\nThe title of Carter's talk was \"Why New Typefaces?\" His premise is that there are so many typefaces out there already, why would the world need new ones? He answered that question from his point of view.\n\nHe provided a bit of his background, which includes the fact that his dad worked in a type foundry, but did not push or encourage Matthew to follow in his footsteps. Carter sees himself as a technician, having carved type into metal, designed it for photolettering processes, and then digitally.\n\nCarter used his titling face Mantinia as a case study. He points out that it is a Renaissance face, not a classical Roman one like Trajan. He had been studying writings, sketches and etchings made by Andreas Mantegna and his friends as they made their way around an Italian lake. THe letters Carter saw in Mantegna's work and that of his friend Felici Feliciano inspired the typeface Mantinia (Latinized version of the name Mantegna).\n\nCarter also talked about his work for the Walker Art Center in Minneapolis. One innovative thing that came out of that was his development of Walker Sans, which has with it 3 different styles of serif that can be applied to the characters using particular keyboard commands. Personally, I thought this was really wild, and can see where such a concept could become more popular in the future.\n\nCarter talked about his work with Newsweek, which he was not originally commissioned for. A friend of his had mentioned a need for a certain kind of typeface, which fit the description of Vincent, a face Carter had started on, but was no where near finished, and had kind of been on Carter's back burner. Months later, the friend said, \"By the way, Newsweek likes Vincent.\" Carter said, \"Who's Vincent?\" And the friend said, \"That typeface you sent me—they love it and want to proceed with it.\" Carter was dumbfounded, as he described the typeface as being in a crude state. So, that turned into a set of 5 versions of Vincent for Newsweek. At this point, Carter said that he's not really into seeing his typefaces used in fine books, posters, annual reports, etc., in which the designer has the time to really craft how the type looks. He prefers to see his work used in quickly designed things like newspapers and weekly periodicals, because that shows how well he really designed the typeface.\n\nCarter briefly mentioned work he's done for Sports Illustrated and other publications.\n\nWhen asked about the trend of designing matched pairs of serif and sans serif typefaces, Carter said he prefers that there be as much contrast as possible between serif and sans faces used together. He said he thought Frutiger looked good with his Galliard face.\n\nWhen asked if there were any typefaces out there he wished he'd designed, he said there were many, and that he thinks there are more really good young type designers out there today than at any point in history, but he wouldn't name any so as not to create bias or hurt the feelings of folks he might leave out.\n\nChris, or any others who were there, feel free to edit.\n\n-------------------------------------  \n_Inventor of the DVD rewinder_\n\n"
    },
    {
      "time": "25 Feb 2009 — 2:45pm",
      "content": "Bruce, thank you very much for that recap!\n\n"
    },
    {
      "time": "26 Feb 2009 — 7:04am",
      "content": "You're welcome, Florian. There is one thing I forgot. At one point, Matthew Carter showed a slide (yes, a real slide, not Powerpoint) of outlines of 3 versions of a lc h from one of his typefaces, overlayed on one another. This was to show the differences between the three weights, including width of strokes, width of characters and placement of the bezier points. He walked over to the screen and pointed to one area that showed the differences in point location between the three weights and said, \"That right there is where I make my money.\" He was emphasizing the importance of detail in the craft, and that those details are what separates excellence and quality from the rest of the pack.\n\n-------------------------------------  \n_Inventor of the DVD rewinder_\n\n"
    },
    {
      "time": "26 Feb 2009 — 7:26am",
      "content": "Thanks, Bruce!\n\nI remember suddenly realizing, after hearing Carter at TypeCon and talking with him, that he is first of all an enthusiast, a fan of great type. It made me happy to realize that the love of type unites the master, the tyro, the journeyman. I think that's what great about the type design community: you're not in it unless you love it.\n\n"
    },
    {
      "time": "26 Feb 2009 — 1:46pm",
      "content": "That's true, William. And it's nice to have the sanctuary that is Typophile in which to gather.\n\n-------------------------------------  \n_Inventor of the DVD rewinder_\n\n"
    }
  ]
}
