{
  "id": "55041",
  "title": "Cheltenham Sketches",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In [another thread](http://web.archive.org/web/20131014072646/http:/typophile.com/node/54972), James Mosley notes with respect to [Cheltenham](http://web.archive.org/web/20131014072646/http:/typophile.com/wiki/Cheltenham) that \"the type that resulted is a long way from the lively original sketches by Goodhue\". I'd love to see those sketches. Are they available anywhere?\n\n",
  "author": "speter",
  "time": "20 Feb 2009 — 9:06am",
  "uid": "2663",
  "comments": [
    {
      "time": "20 Feb 2009 — 9:30am",
      "content": "If they are I want to see them!\n\n"
    },
    {
      "time": "20 Feb 2009 — 11:10am",
      "content": "From J. Ben Lieberman's\\* book \"Type and Typefaces\":\n\n ![](http://web.archive.org/web/20131014072646im_/http:/typophile.com/files/chelt_3702.jpg)\n\n(\\* Our Bill Berkson's uncle.)\n\n"
    },
    {
      "time": "20 Feb 2009 — 11:14am",
      "content": "Beautiful. Is there anything like this available for licensing?\n\n"
    },
    {
      "time": "20 Feb 2009 — 11:31am",
      "content": "If that’s what Goodhue’s original designs looked like I can see why ATF and Linotype toned it down so much. This might work on greeting cards, or as a titling face (with alternate figures to keep it from getting too wonky) but as a text face it would be incredible irritating.\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:00pm",
      "content": "Cheltenham, yes, a seminal design in so many ways.  \nI wonder why Benton made it a slab serif.\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:16pm",
      "content": "Dwiggins was a great admirer of Cheltenham (having selected it for his subject when asked by the Eastern Paper Company to create a broadsheet specimen of his choice for them).\n\nAt one point, he toyed with his own design inspired by and based on some of the Cheltenham proportions and characteristics. In the end it came to nothing.\n\nDuring the course of this short-lived experiment, C.H. Griffith sent to WAD a package with this note: \"For such interest as it may have, I am enclosing a photostat reproduction of the original Goodhue drawings of Cheltenham. These drawings were subsequently modified by Morris Benton, resulting in the present Cheltenham Old Style letter. Benton's drawings were used for our cutting.\"\n\nTo this Dwiggins replied: \"The Goodhue drawing most interesting -- shows that he was a better architect than he was type-designer.\"\n\n-- Kent.\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:18pm",
      "content": "Do we really know that the toned-down slab design wasn’t done by Goodhue? Is the image above from a drawing or is that the Cheltenham press version? The Linotype version is very similar to the ATF version, so it could be that both versions descended from the final metal weights by Goodhue. Of course ATF and Linotype could have been cross licensing from each other, it’s not like anybody kept records of that stuff…\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:21pm",
      "content": "Re: the text, I guess his trust was misplaced! Doubly sad, because the guy was so honest that he didn't even kern his _drawing_! (CHEL TENHAM)\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:28pm",
      "content": "I think the signature rounded slab serifs it ended up with would have been created at the stage of large-scale drawing for big type.  \nAt the time, that would have been for foundry type, as hot metal didn't go large enough to warrant that subtle an attention to detail.\n\n"
    },
    {
      "time": "20 Feb 2009 — 12:55pm",
      "content": "James -- in case you missed it, as CHG says in the note that I quoted above (probably while you were posting), Mergenthaler Linotype used Benton's drawings for their version.\n\n"
    },
    {
      "time": "20 Feb 2009 — 1:01pm",
      "content": "I would guess that it's a drawing, not type. There is a lot of variation among the a's, e's, and other repeating letters. Notice how some of the e's are closed and some are open (as in the final Cheltenham Old Style Italic).\n\nI think it's interesting that he uses \"font\" and \"type\" interchangeably.\n\n"
    },
    {
      "time": "20 Feb 2009 — 1:03pm",
      "content": "Nick -- I'm not sure why you're referring to Benton's cleaned up and regularized Cheltenham as a \"slab serif,\" or even a \"toned-down\" slab (as James qualified it). The original ATF Cheltenham shows, for the most part, rather thick, stubby, and heavily bracketed serifs. Not quite as filled-in on the hard stock of the 1923 catalog as the somewhat fuzzy reproduction that Mark posted, but still, not what I would call slab.\n\n"
    },
    {
      "time": "20 Feb 2009 — 1:12pm",
      "content": "_I think it’s interesting that he uses “font” and “type” interchangeably_\n\nHe may have preferred _font_ but needed _type_'s 'p' for his pangram attempt! ;-)\n\n"
    },
    {
      "time": "20 Feb 2009 — 2:27pm",
      "content": "_I’m not sure why you’re referring to Benton’s cleaned up and regularized Cheltenham as a “slab serif,”_\n\n ![](http://web.archive.org/web/20131014072646im_/http:/typophile.com/files/chelt_3946.jpg)\n\nIt's a low-contrast face with thick serifs, so that's what makes it a slab, IMO. The roundedness of the brackets is so slight at text size, given the stubbiness of the serifs, as to not be much of a feature. However, the novel \"s\" shape of the bracket is quite distinctive at display size.\n\n"
    },
    {
      "time": "20 Feb 2009 — 2:31pm",
      "content": "Thanks Kent. Your post appeared after I wrote mine.\n\n"
    },
    {
      "time": "20 Feb 2009 — 9:47pm",
      "content": "I call those Doric serifs.\n\nhhp\n\n"
    },
    {
      "time": "21 Feb 2009 — 6:14am",
      "content": "Okay, Nick. I suppose it's a matter of semantics. I consider the Cheltenham serifs more of a Clarendon structure -- bracketed, low-constrast, squarish ending. I suppose some consider Clarendon a slab-serif. But for me it doesn't become slab until there's no bracketing.\n\nI'm not contesting the essence of your point; clearly Benton shifted the design toward a low-contrast finish even while trying to maintain Goodhue's underlying letterforms.\n\nI think it's a little misleading, though, to compare the later Cheltenham family additions as the Benton characteristics became more pronounced as the family developed, especially in heavier wider styles.\n\nI think the original Oldstyle actually retains a fair amount of Goodhue's quaintness.\n\n ![](http://web.archive.org/web/20131014072646im_/http:/typophile.com/files/ATFCheltOS_3619.gif)\n\n"
    },
    {
      "time": "21 Feb 2009 — 6:22am",
      "content": "And a handful of the quirkier italic forms were offered as alternates (but not that funky lc. delta d):\n\n ![](http://web.archive.org/web/20131014072646im_/http:/typophile.com/files/ATFCheltOSItaAlts_6652.gif)\n\n"
    }
  ]
}
