{
  "id": "55040",
  "title": "WinSoft Introduces Tasmeem 4 with a rich set of TypeFaces",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [WinSoft Tasmeem](http://web.archive.org/web/20100204112207/http:/typophile.com/user/26001 \"View user profile.\") : 20.Feb.2009 8.35am \n\nGrenoble, France – February 19, 2008 – WinSoft, multilingual software publisher, unveils Tasmeem 4, the new version of Tasmeem, set of plug-ins and fonts for Adobe InDesign CS4, Middle Eastern version, dedicated to Arabic users.\n\nTasmeem 4 is taking a step forward with new features and a wider range of fonts to express the very distinctive edge of Tasmeem.\n\nTasmeem 4 introduces new features, such as the outstanding Position tuner. It allows creative users to easily move by simple drag and drop searchable text, even diacritics or dots.  \nExisting features are also improved, like the **Word shapping** , which lets you express your creativity by choosing from dozens of variant forms for Arabic text, or the **Text shapping** , which provides precise and unrivalled control of Arabic text.  \nCombined with Tasmeem other major features such as **Arabic Spacing** , to adjust the space between words and the space between word segments, and **Selection Helper** , which will turn the editing of complex text into an easy task, this new Tasmeem 4 brings new levels of power and expressiveness for Arabic typesetting and design.\n\nTasmeem 4 brings an unprecedented choice of high-quality fonts :  \nThe Classics, are a series of high-end Arabic typefaces with an unmatched range of features known from the Arabic script. Based on historic models, they are the technologically most advanced Arabic typefaces ever created ( **Naskh** and **Emiri** are already available, **Nastaliq** will be proposed in the coming weeks, and **Ruqa** is under development).  \nThe Beh-Class typefaces (including **Basim Marah, Nassim** and **Qarandash** ) and the Alef-Class typefaces (including **Aramedics Medhi, Hasan Hiba, Hasan Noor** and **AlQuds** ) are a range of new typefaces from independent designers coming from widely varying backgrounds and approaches enrich the collection of Tasmeem.\n\nTasmeem has been specifically developed for Arabic to express, with new technologies, the refinement of the Arabic writing in digital documents. Tasmeem 4 overcomes the traditional challenges faced by the printing and publishing industry in regards to Arabic typography – namely that current typesetting technologies based on letter analysis are simply unable to render the richness of the Arabic script.\n\nTasmeem and its high-quality fonts give freedom to create Arabic calligraphic documents and editable text without a calligrapher on hand.\n\nTasmeem also opens up new creative possibilities for advertisements, front pages, greeting and business cards. It is regularly used by the Creative and Design Department of the Saudi Research & Marketing Group for advertising in magazines like Sayydati and Al-Jamila or in newspapers like Al Sharq Al Awsat.\n\nTasmeem is also intended to create sophisticated Arabic literary and academic books as well as shape prose, poetry, create rings and catchwords on a large number of pages.  \n“The biggest project to use Tasmeem is a digital version of the holy Koran. The project started last Ramadan (Sept 2008) when the Ministry of Awquaf and Religious Affairs of Oman selected Tasmeem and organised a ceremony in the Grand Mosque to launch the project.” says Kamel Gaddas, WinSoft ‘s Senior Vice President, Business Development.\n\nTasmeem 4 is the result of a maturation process which led to a better understanding of the market.  \n« The idea behind Tasmeem came from the early ‘90s, when we saw how difficult it was to express, with existing technologies, the refinement of Arabic script in digital documents.” adds Kamel Gaddas.  \nOriginally Tasmeem was created to meet the demand of a limited market of top-specialist customers. It opened the way for publications where high quality Arabic typography is mandatory. The first academic publication to use Tasmeem is an extraordinary book from Laban Kaptein: Dürr-i meknûn (The hidden pearl) ( [www.labankaptein.com/english-book.html](http://web.archive.org/web/20100204112207/http:/www.labankaptein.com/english-book.html \"www.labankaptein.com/english-book.html\")).  \nThe second step addressed a larger public of design and publishing professionals, introduced a full complete range (Limited, Creative and Publisher Edition).  \nTasmeem 4 is now an improved version based on the feedback of Arabic users, with innovative new features and a range of high-quality typefaces to fit expectations from both modern and calligraphic designers. The product range has been simplified to propose a single product that offers all the features and enhancements, in addition to a range of fonts that can be purchased separately.\n\nExplore all Tasmeem possibilities and discover Tasmeem high-quality typefaces, thanks to a time limited edition automatically installed with each Adobe InDesign CS4, Middle Eastern version.\n\n**Tasmeem 4** and **Tasmeem fonts** are available to purchase on WinSoft estore ( [http://www.winsoft-international.com/en/store/all-products](http://web.archive.org/web/20100204112207/http:/www.winsoft-international.com/en/store/all-products)). Tasmeem fonts range will keep growing and are available for purchase separately or in font collections. Users can then keep the freedom to buy the typefaces they need.  \nFor more information, visit [www.tasmeem.eu.](http://web.archive.org/web/20100204112207/http:/www.winsoft-international.com/en/products/tasmeem.html)  \nTasmeem 4 is also available from our Middle Eastern distributor GraphEast Computers LLC ( [http://www.winsoft-international.com/en/find-a-reseller/28-grapheast-computers-llc.html](http://web.archive.org/web/20100204112207/http:/www.winsoft-international.com/en/find-a-reseller/28-grapheast-computers-llc.html)).\n\n**About WinSoft SA** ( [www.winsoft-international.com](http://web.archive.org/web/20100204112207/http:/www.winsoft-international.com/en/))  \nWinSoft, French software company based in Grenoble, founded in 1985, is specialized in the design, development, localization and publishing of software in emerging markets. As a strategic partner for Adobe Systems and FileMaker, Apple Computer subsidiary, WinSoft expertise ranges from software engineering and localization, to production and sales, right through to in-country marketing and distribution.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100204112207/http:/typophile.com/user/26001\" title=\"View user profile.\">WinSoft Tasmeem</a>",
  "time": ": 20.Feb.2009 8.35am",
  "uid": "26001",
  "comments": [

  ]
}
