{
  "id": "5507",
  "title": "FL kern accents?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I've finished the kerning of the basic characters and I need to apply the same kerning to the accent characters.   \n   \nI would've used Peter Bilak's \"AccentKernMaker\" if it hadn't been discontinued.   \n   \nSo the font has been generated from Fog & I've now imported it into FL and I've also imported the kerning.   \nI've made classes of all the accent charaters (and the base character as the reference.   \n   \nI was stupid enough to think that this would link them immediately, and that I didn't have to define the right and left classes in the kerning assistant. But that was not the case. Or is it?   \n   \nAnyone with a solution? Why isn't there a feature in FL that does connect the accent characters automatic ( with an option to turn it off)?\n\n",
  "author": "peterbruhn",
  "time": "7 Jul 2004 — 2:33am",
  "uid": "799",
  "comments": [
    {
      "time": "7 Jul 2004 — 4:22am",
      "content": "Peter,   \n   \n\\> I was stupid enough to think that this   \n\\> would link them immediately, and that I   \n\\> didn't have to define the right and   \n\\> left classes in the kerning assistant.   \n   \nYou need to define the left and right classes in Kerning Assistance. The simplest case is to open Kerning Assistance, click on the left classes list, click on \"Select All\", click on the right classes list, click on \"Select All\". That's a 5-seconds job.   \n   \nThen, you can go and manually deselect the appropriate side of the class for those that are noth both-side classes (if you have such classes).   \n   \n\\> Why isn't there a feature in FL that   \n\\> does connect the accent characters   \n\\> automatic ( with an option to turn it   \n\\> off)?   \n   \nThis can be done with a Python script. Such script is in development at Fontlab Ltd. and will be available as an add-in for FontLab Studio 5.   \n   \nRegards,   \nAdam Twardoch   \nFontlab Ltd.\n\n"
    },
    {
      "time": "7 Jul 2004 — 7:04am",
      "content": "Thank you Adam for you quick answer.   \n   \n\"That's a 5-seconds job.\"   \n   \nUsually I prepair these things in advance but it couldn't be done this time. The font is a bit special so usual kerning pairs doesn't apply. That's why I hoped to keep the kerning pairs I've made in FOG & just apply the same settings to the diactritics - AccentKernMaker would've done the trick. Making right classes will take a while (long time) in this case. Maybe I should just print the atm- file and go through which pairs need to be fixed?   \n   \n\"add-in for FontLab Studio 5. \"   \nLooking forward to it's release... many nice features.\n\n"
    },
    {
      "time": "7 Jul 2004 — 7:15am",
      "content": "Peter,   \n   \nmake up just a few classes, then save the classes into an .flc file from the Classes panel. Open the .flc file in a text editor. You will see that the font has a fairly simple structure. Of course the other classes still need to be added, but editing this text file should be fairly fast.   \n   \nNote that in the Kernig Assistance dialog, you are also able to save a .flk file which has a similar structure but in addition contains information on left-side, right-side and both-side classes. So perhaps you may want to edit this one.   \n   \nBest,   \nAdam\n\n"
    },
    {
      "time": "7 Jul 2004 — 7:36am",
      "content": "Ah yes and then I can just add new classes there for each letter? Smart ![:-)](http://web.archive.org/web/20131106082540im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nIt's a pity one has to be a math genius to make fonts   \nthese days ;)   \n   \nThank you again, Adam ![:-)](http://web.archive.org/web/20131106082540im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
