{
  "id": "55080",
  "title": "Namemark spacing with \"Mc\" prefixed surname",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": " ![](http://web.archive.org/web/20140721022013im_/http:/typophile.com/files/brianmcfann_5504.gif)\n\nThis is my namemark for a new business adventure. I wanted to see a little space between the \"Mc\" and the \"Fann\" although I don't know of any typographic precedent for it. So I moved the \"c\" closer to the \"M\", and the \"F\" further away from the \"c\". Does it look OK? Or does it look like just the goofy sort of thing that a newbie would do? And what about the rest of the spacing?\n\nThe font is Big Caslon at 36pt. For the web, should I use instead a font that doesn't have such fine hairlines. Like maybe a text font even though I wouldn't use it at 36pt in print?\n\nHere is what it looks like at 48 pt.\n\n ![](http://web.archive.org/web/20140721022013im_/http:/typophile.com/files/brianmcfann_48pt_5505.gif)\n\nThanks,\n\nBrian\n\n",
  "author": "bmcfann",
  "time": "21 Feb 2009 — 3:09pm",
  "uid": "41468",
  "comments": [
    {
      "time": "21 Feb 2009 — 7:19pm",
      "content": "Why not try spacing the whole name just a little bit looser? Looser letterspacing is common for uppercase letterforms, and you might decide you don't need the extra space after **Mc**. Don't increase the space between **F** and **a** , though; that's about as loose as you want to get.\n\n"
    },
    {
      "time": "23 Feb 2009 — 12:51am",
      "content": "Thanks for the suggestion, PublishingMojo. I will try it.\n\nAssuming that the MacArthur Foundation can afford to hire an experienced typographer, their namemark might be a good model:\n\n ![](http://web.archive.org/web/20140721022013im_/http:/typophile.com/files/logo2_4950.gif)\n\nSo, with that model in mind, here is my namemark with more spacing and more-or-less evenly spaced:\n\n ![](http://web.archive.org/web/20140721022013im_/http:/typophile.com/files/brianmcfann2_5914.gif)\n\nAnd here it is with a little space after the prefix in an attempt to give it a little style:\n\n ![](http://web.archive.org/web/20140721022013im_/http:/typophile.com/files/brianmcfann3_3491.gif)\n\nWhat do you think?\n\n"
    },
    {
      "time": "24 Feb 2009 — 5:40am",
      "content": "B too close to R, F too close to A, M too close to C...\n\nI also don't like the too obvious stroke contrast between UC an LC. Because they more look like fake Small Caps... (that may as well be)...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "24 Feb 2009 — 10:46pm",
      "content": "Thanks for the input, Robert. How is this?\n\n ![](http://web.archive.org/web/20140721022013im_/http:/typophile.com/files/brianmcfann4_6134.gif)\n\n ![](http://web.archive.org/web/20140721022013im_/http:/typophile.com/files/brianmcfann5_6504.gif)\n\nI used the small cap font (type 1, both Caps and small caps in the font file) of Big Caslon.\n\nBrian\n\n"
    },
    {
      "time": "25 Feb 2009 — 1:22am",
      "content": "Does B look like it's a bit elevated? I'd lower it a bit...\n\nIs the first image old and second new? or are they two new iterations? I'll comment on the second (thinking it's a new one)... Still Kerning problems. Turn it upside down to see... B still a bit to close to R. And probably M to C as well... Should there be space between Mc and Fann? should it be like Mc Fann or McFann?\n\nBut since you letterspaced it a bit more than before it doesn't look as if you'd be using fake sc's... ;)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
