{
  "id": "55082",
  "title": "Sub-fonts lurking inside Cambria Math",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just noticed [this](http://web.archive.org/web/20150124051720/http:/www.tiro.nu/Articles/Cambria/Cambria_Math_Basic_Spec_V1.pdf) on the Tiro site. TWO weights of a new Fraktur, TWO new script weights, a double-struck weight with a black weight left over when the incisions are removed... remarkable stuff.\n\nOh yeah, and two weights of a Cambria Sans as well, plus their italics. I would be surprised if they stop here and don't expand it further in the future.\n\n",
  "author": "johnbutler",
  "time": "21 Feb 2009 — 4:32pm",
  "uid": "851",
  "comments": [
    {
      "time": "21 Feb 2009 — 8:48pm",
      "content": "Makes sense to me. Crazy mathematicians have uses for all those letters in proofs!\n\n(I know, I was one in undergrad before changing career direction...)\n\n"
    },
    {
      "time": "22 Feb 2009 — 3:59am",
      "content": "Yes, great link! Thank you, John.  \nIs there a clever way to access all these characters? I mean, other than via the glyph palette?\n\nThe ‘new Fraktur’ is actually a variation on Wittenberger. “Based on Schelter & Giesecke’s School Fraktur which was in turn based on type favored by early 16th century printers in Wittenberg” — [Adobe](http://web.archive.org/web/20150124051720/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1495).  \nEspecially the uppercase ‘K’ has been altered – I assume to distinguish it more from the ‘R’. While I’m not a fan of the original Wittenberger ‘K’ either, I must say that the new ‘K’ is my least favourite character in Cambria’s blackletter. Its head looks stretched.\n\nThe script letters are absolutely lovely! I wonder what their source is. Similar charm as that of [Kursivschrift](http://web.archive.org/web/20150124051720/http:/www.fontshop.com/search/?q=kursivschrift) or [Fiona](http://web.archive.org/web/20150124051720/http:/new.myfonts.com/fonts/brassfonts/fiona-script/).\n\nIt seems Cambria is the new Lucida, in terms of style variety – and all in one single font.\n\n"
    },
    {
      "time": "22 Feb 2009 — 8:52am",
      "content": "Most of the mathalphanumeric characters were designed by Cambria's original designer, Jelle Bosma at Monotype. The 'ssty' optically adjusted scaleable variants used by the MS math handler for super- and subscript variants were made by Ross Mills at Tiro, as were the new math monospace letters that will be included in the new Windows 7 version (along with a lot of other non-math stuff that I made, with some help from David Brezina, including polytonic Greek and massively extended Latin and Cyrillic support).\n\nThe thing to note about the math alphanumerics is that they are limited character sets, generally no more than A-Z and a-z. They are encoded using Unicode Plane 1 codepoints for math alphanumerics, and they are also spaced more for use as math symbols than for regular text.\n\n"
    }
  ]
}
