{
  "id": "5514",
  "title": "Typographic puzzles, are they a matter of style?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I recently started work on a financial document that contains some interesting typographic situations. I'm curious what your opinions are on methods for handling them, and whether there's an accepted way in these cases, or whether they're just judgement calls.   \n   \nEx 1   \nI'm using small caps for acronyms, such as NYSE and NAV, but there's a proper name which is written 'InvestPLUS'. Now, assuming that the 'PLUS' is an acronym at the end of a proper name, would you set the name with UC & LC for 'Market' and SC for 'PLUS', or would you leave 'PLUS' in UC. (I can hear Bringhurst groaning and mumbling about \"candy and drugs.\")   \n   \nEx 2   \nThe proper name S&P 500 set in body text. I used OsF to maintain the texture of the page, but is there a compelling argument to use LF to make S&P 500 set more like a unit? Or is this more needless logogram-ery in typography?   \n   \nEx 3   \nThere's a term 'collateralized mortgage obligations', which is referred to as \"CMO\" in the copy. However, the writer pluralized the acronym at one point as \"CMOs\". When setting a pluralized acronym, would you use a LC 's' or a SC 's'? I used a LC 's', but it looks \\<i\\>very\\<i\\> close to the size of the SC letters in the acronym. Part of me thinks that the pluralizing is just incorrect writing.   \n   \nEx 4   \nA bond can be rated with figures such as B, or B+ or Ba or Ba1. If you're setting the rating Ba1 in body text, would you use a LF for the 1 or the OsF? The issue is that the 1 next to the 'a' becomes a bit confusing when it's an OsF, but the LF is, of course, more visually intrusive. Are there any rules for ratings?   \n   \nFor the initial versions of the document I just made visual and cognitive judgements and then used them consistently, since (I'm told) consistency in typography is more important that correctness used inconsistently. However, I'd really prefer both.   \n   \nA related question: any recommendations for a style manual? The one I know of off the top of my head is _[The Chicago Manual of Style](http://web.archive.org/web/20131013030852/http:/www.chicagomanualofstyle.org/cmosfaq.html)_. Is this a safe bet?   \n   \nPS: The text face I'm using is [Whitman](http://web.archive.org/web/20131013030852/http:/www.kentlew.com/Type.html).\n\n",
  "author": "Chris Rugen",
  "time": "7 Jul 2004 — 8:47am",
  "uid": "2172",
  "comments": [
    {
      "time": "7 Jul 2004 — 9:13am",
      "content": "As a professional lawyer (and typographic amateur) I come across this sort of problem a lot. I don't think there is a \"right\" answer, but I'll give you my gut instinct, for what it is worth.   \n   \n1. InvestPLUS: use whatever looks least bad. How about the P large caps and the \"lus\" small caps? This really is a one-off decision.   \n   \n2. + 4. If you are using OSF, use OSF consistently except in headlines with full caps. If S&P is in small caps, then the OSF 500 will look fine anyway. Even if it isn't it will look OK. (The problem with X&Y acronyms is when there is not a small-caps height version of the ampersand, but Whitman is such a well-conceived face I bet it has one.) No-one reading it will have any trouble with the OSF, I'm sure. They will read S&P 500 as a unit because they are familiar with it and for them it is obviously a unit.   \n   \nI would not, incidentally, put bond or security ratings B or BB+ and the like in small caps. I   \n   \n3. Lowercase s definitely. The rule is: how would you set it if you were using large caps. The answer, surely is CMOs. You do the same with small caps. There is no justification for capitalizing the s under any circumstances. (But the writer is at fault, surely if the acronym is plural to start with and then being pluralized again, i.e. if CMO = \"collaterlized mortgage obligationS\" to start with, it should never be CMOs.)   \n   \nWhere text has a mass of acronyms I find it often is hard to use small caps for them (though I prefer them). As soon as an acronym starts a sentence one hits trouble. In those circumstances I find it generally less troublesome to use a font with a low cap-height anyway, rather than small caps.   \n   \nOn style, I always liked Hart's Rules--the old little version not the bloated modern OUP style guide. But for US usage I think Chicago is probably the safest thing.\n\n"
    }
  ]
}
