{
  "id": "5518",
  "title": "Silvertone Woodtype",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "![silvertonexcond.jpg](http://web.archive.org/web/20150414230154im_/http:/www.typophile.com/forums/messages/29/402.jpg)   \n   \nThis is another font inspired by woodtype. I found the original uc forms and numerals in a specimen book, and made my own adjustments. The lc and all punctuation and other symbols are of my own design.   \n   \nComments and critique appreciated.   \n   \nDavid Thometz\n\n",
  "author": "anonymous",
  "time": "6 Oct 2001 — 5:49pm",
  "uid": "1203",
  "comments": [
    {
      "time": "6 Oct 2001 — 7:43pm",
      "content": "On the lc f j t and actually r, I'd like to see something like the terminals the \"s\" has. The bottom section of the lc g is nice, but the top section doesn't look right somehow. Can't explain exactly how I'd remedy it as you probably need to keep some semblence of a super ellipse there for consistency's sake.\n\n"
    },
    {
      "time": "10 Oct 2001 — 11:03am",
      "content": "I like this one! And I don\n\n"
    },
    {
      "time": "11 Oct 2001 — 7:49am",
      "content": ":-)   \nI commended you once before in another one of your faces - I didn't want to sound like an ascending \"2\" is \\*that\\* important! But I'm happy I've convinced at least \\*one\\* person... :-)   \n   \nBTW, I think traps are as almost as old as type design itself. Any dates, anybody? I bet Jared knows somebody who knows...   \n   \nhhp\n\n"
    },
    {
      "time": "11 Oct 2001 — 12:54pm",
      "content": "David,   \n   \nOn your ascending and descending figures proposal...   \nI think it's perfect. I can't understand why it isn't   \nalready the convention. Make it so.   \n   \nStephen\n\n"
    },
    {
      "time": "11 Oct 2001 — 9:50pm",
      "content": "This is tricky stuff.   \n   \nI started writing a mini treatise, but the time and place are both wrong, so let me ask some questions instead:   \n   \nWhat are the numerals suppose to do in a text face? I mean beyond the obvious \"convey numeric information\". \\*How\\* does a numeral string do its job during immersive reading? Why are oldstyle numerals more readable? Is it only because their divergent extenderness helps differentiate between them? Or is also (perhaps more so) that they form better word shapes (just like lc versus UC), in particular in common numerals strings (eg \"1968\")?   \n   \nThe answers to these questions will greatly help determine things. Tradition does have a role to play, but especially in the case of numerals a lot less than some old[er] folks would have us believe.   \n   \nReaders don't consciously care if a \"2\" is ascending or not. The question is, what does the subconscious -which is largely responsible for immersive reading anyway- really cherish?   \n   \nBTW, concerning the even distribution of extenderness, note that:   \n1. In running text (even more so than in the Latin alphabet itself), ascenders are much common than descenders.   \n2. Numeral frequency is not \"flat\": some numerals are much more common than others.   \n3. And another question: should numeral strings perhaps \\*diverge\\* to some extent from running text in vertical span/location?... This is similar to the question: does some degree of -probably- controlled irregularity help readability? I for one think that there is such a thing as too much even color.   \n   \nChew on that, dudes... :-/   \n   \nhhp\n\n"
    },
    {
      "time": "12 Oct 2001 — 9:22pm",
      "content": "As long as we're all asking questions I'll ask   \nmine...   \n   \nWhy has this come to even be an issue? It's   \nnot like we ever question the descender on   \nthe lower case p.   \n   \nDoes it all really stem from the fundamentally   \ndistinct origins of the Roman alphabet and   \nArabic numerals? (A more or less geometric   \nalphabet clashing with more or less scripty   \nfigures). Is there something more to it?   \n   \n//joe\n\n"
    },
    {
      "time": "15 Oct 2001 — 1:06pm",
      "content": "This is great stuff, guys! But I need to be   \nmissing in action for the rest of the month. :-/   \n   \nI'll be back!   \n   \nhhp\n\n"
    },
    {
      "time": "15 Oct 2001 — 3:29pm",
      "content": "That's a shame, Hrant. Especially if we solve it   \nby then. :P   \n   \nDavid, I'm impressed with your one-paragraph   \nhistory. Also, I think it was Bringhurst's book that   \nfirst introduced me to the topic of Arabic   \nfigures versus Roman alphabets...   \n   \n//joe\n\n"
    },
    {
      "time": "17 Oct 2001 — 9:42am",
      "content": "A brief history of Arabic numerals :   \n   \nThe mathematical system\n\n"
    },
    {
      "time": "7 Dec 2001 — 3:45pm",
      "content": "OK, where were we...   \n   \nThe true nature of the functionality of the numerals is still beyond my grasp, so I'll have to think about that off-line (even though talking out loud -not to mention listening to others- helps me think better).   \n   \nBut there are some things I can bite into:   \n   \nJoe:   \n\\> Why has this come to even be an issue?   \n\\> It's not like we ever question the   \n\\> descender on the lower case p.   \n   \nWell, I try to question everything all of the time, or at least as time and circumstance permit.   \nDuring my Alphabet Reform work one of the things I realized early was that -ideally- some letters should have their very extenderness changed. For example, perhaps the best candidate for this is the lc \"e\": making its jaw descend (maybe not all the way down) would really help form more distinctive word shapes, and would provide better vertical balance to text. Part of the reason is that its structure can easily accomodate such a modification, and part of it is that it's the most common letter (maximum impact with minimum application/learning) and another part of it is that the \"e\" is too similar to the \"c\" and \"o\". However, anticipating stiff resistance (even the best idea is useless if not enough people go for it), I decided to limit it to tweaking the extenders of letter which already had extenders.   \n   \n\\> Does it all really stem from the fundamentally distinct origins of the Roman alphabet and Arabic numerals? (A more or less geometric alphabet clashing with more or less scripty figures).   \n   \nAs far as I know, yes. But it's not just a matter of degree of calligraphy. The stress of Arabic is horizontal (as opposed to Latin's vertical), and that's what bugs me the most.   \n   \n\\> Is there something more to it?   \n   \nProbably.   \n   \nDavid:   \n\\> the upper case characters being descendants of the Cretan pictographs via Phoenecian characters via Roman inscriptions   \n   \nJust to nitpick: Anything going \"back\" from the Phoenecians is highly disputed among scholars.   \n   \n\\> It was the notion of enhanced legibility of word shapes (and ease of writing), in part, that contributed to the decision to merge the two systems into our current bicameral alphabet.   \n   \n!   \nThat would have been inspiring, but the earliest known indication of us realizing the importance of word shapes is towards the end of the 19th century (Javal). Not only that, but even today many (perhaps most) designers are in denial about it, or simply don't care.   \n   \nAnders:   \nGreat numeral history!   \nAnd killer links too.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Dec 2001 — 9:52pm",
      "content": "I don't think I get your drift.   \nDid I fail to commend David on his excellent presentation? I guess I did - sorry.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Dec 2001 — 5:09pm",
      "content": "So, to get back to David's alphabet, I would like to point out that I would like to see another version of the \"ß\", which seems to me too marshmallow-y. I know that this a condensed typeface, but it could stand to be a little sprucer, you know, have a bit more juice in its pectorals. Also, I love the detail on the \"1\", very distinctive. I would love to see it somewhere else, but I can't think of where as it is obviously the \"distinctor\" (can you say that?) between the \"1\" and the lc \"l\". Also, I noticed that it is very strong in smaller size, would you consider making an attempt to design it as a screen font?   \nAlso: the }{ guys seem wrong to my eye...too round, too much like a bird's beak. And the $ has a weird optical thing happening, where the stroke seems to tweak the inside arcs in a bad way. I don't know if the solution is to try a broken stroke or to tweak the counter space to make it breath a little bit more.   \n   \n\\*L\\*\n\n"
    },
    {
      "time": "17 Jun 2002 — 6:57am",
      "content": "I like it.I have working on wood type now for quite a while, also working from old specimens as well as seeking inspiration for types of my own, all ot [http://www.woodentypefonts.com/](http://web.archive.org/web/20150414230154/http:/www.woodentypefonts.com/)   \nNot all of these fonts are complete, i.e., all characters upper and lc, etc. I think you commented on the ascending number 2, yes, a bit weird, but I am a big fan of non-lining numbers, old-style. I have to sit down and read all of these comments before I can make more, but in general think the fonts is quite successful.   \nJordan\n\n"
    },
    {
      "time": "15 Jan 2004 — 1:15pm",
      "content": "I'm happy to announce that   \nDTD Silvertone Woodtype has finally   \nbeen released through MyFonts.com:   \n   \n   \n [http://www.myfonts.com/fonts/thometz/silvertone-woodtype/](http://web.archive.org/web/20150414230154/http:/www.myfonts.com/fonts/thometz/silvertone-woodtype/)   \n   \n   \nDTD Silvertone Woodtype is available in both   \nPostscript Type 1 and TrueType formats   \nfor Macintosh and PC/Windows platforms.   \n   \n   \nTYPOPHILE.COM DISCOUNT:   \n   \nAs a special thank-you to Typophile.com   \nmembers, from now through February 29, 2004,   \nsave 25% off the total price when purchasing   \nDavid Thometz Design font licenses with this   \nMyFonts.com Electronic Gift Certificate:   \n   \nEnter code: typophilerocks   \n   \nThis MyFonts.com Electronic Gift Certificate   \nis valid from January 15\n\n"
    },
    {
      "time": "6 Oct 2001 — 6:03pm",
      "content": "Thanks for the comments, Martin. ![:)](http://web.archive.org/web/20150414230154im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI don't currently have a website, no. It's in progress, though. I'll post a link on the news forum when it's up.   \n   \nWhat specific changes would you like to see to lc f, g, j and t?   \n   \nDavid\n\n"
    },
    {
      "time": "9 Oct 2001 — 12:33pm",
      "content": "Hmmm.... I like the ideas on the lc \"f\", \"j\", \"t\" and \"r\" (and maybe I can work it into a few others as well). Maybe I'll work the original forms into an alternates set.   \n   \nAs for the lc \"g\", perhaps the ear isn't quite right. I'll play with that one too, and see what happens.\n\n"
    },
    {
      "time": "10 Oct 2001 — 1:43pm",
      "content": "Anders:   \n   \nActually, I know what you mean. You are referring to ink traps (a.k.a. light traps). To be honest, that's one of the things I like about the caps that this fonts was based upon; it has that old woodtype naïveté, well before the idea of light trapping became popular. As such, a lot of old wood types have an uneven color that is part of their charm.   \n   \nStill, I agree with you that more balanced characters should at least be offered with the font, so I'll likely include those with either the main font or with an alternate set.   \n   \nAs for the lc \"g\", I've been resisting the idea of doing a monocle form, but perhaps that would solve the problem?   \n   \nOn another subject, now that the font has been posted, I've noticed that the daggers are much too heavy....   \n   \n(And no comments from Hrant about my ascending lc \"2\"? ![:)](http://web.archive.org/web/20150414230154im_/http:/www.typophile.com/forums/clipart/happy.gif) )   \n   \nDavid\n\n"
    },
    {
      "time": "11 Oct 2001 — 11:54am",
      "content": "Hrant:   \n   \nI agree that traps aren't really a new design element. My wording was careless in my previous post. The point I intended to make is that some faces are charming without them, and with the resulting uneven color.   \n   \nThe New York Times Magazine has used a woodtype-style (more or less) untrapped gothic (the name of which I do not know) with a very uneven color which is extremely inviting to read. Does anyone know the name of the font to which I'm referring?   \n   \nAs far as numerals go, I'm still not entirely sure about the ascending \"2\", although it makes a great alternative to a \"2\" that would otherwise look unnaturally squished if constrained to the x-height. I'm also finding that the \"4\" can work equally well ascending or descending, depending on the design, although in most (if not all) of my faces, I have designed it descending.   \n   \nI wonder if a good rule of thumb might be to have the even numerals \"2\", \"4\", \"6\" and \"8\" ascend, and have the odd numerals \"3\", \"5\", \"7\" and \"9\" descend, while keeping \"0\" and \"1\" constrained to the x-height? That might seem to evenly distribute ascenders and descenders without departing too far from recognized type conventions. Any thoughts?   \n   \nDavid\n\n"
    },
    {
      "time": "11 Oct 2001 — 10:33pm",
      "content": "Indeed, it is tricky stuff.   \n   \nOne of the reasons I have always designed the \"4\" as descending is that early on in my own experience, I registered that the bars of \"2\", \"1\" (when it has the base serif) and a descending \"4\" line up attractively and guide my eye as I read. At least to my own perception, this helps form a \"better\" word shape, although I'm not sure I could put my finger on what makes one word shape \"better\" (or more readable) than another. Certainly variety of ascenders/descenders plays a part, but the case-by-case design of the letter must be taken into account as well, I think.   \n   \nYou also make some interesting and valid points on \"extenderness distribution\" ( ![:)](http://web.archive.org/web/20150414230154im_/http:/www.typophile.com/forums/clipart/happy.gif) ). However, specifically regarding your third point about vertical span divergence of numerals, two fonts which tried this with the numerals spring to mind: Richard Austin's \"Bell,\" which gave the numerals three-quarters the height of an otherwise lining-numeral design; and Jan van Krimpen's \"Spectrum,\" which keeps to the x-height but has very short (about one-third proportion, to my eye) ascenders and descenders.   \n   \nI'm not sure that either design is really successful as regards the design numerals. Spectrum's ascenders and descenders are too close to the x-height to offer any assistance to the word-shape, while Bell's numerals miss the argument entirely by employing dwarfed lining figures rather than text figures. They don't stand out from the text like full lining figures do, but they create bland, rectangular word shapes that also offer no additional assistance to gestalt comprehension.   \n   \nIn short (no pun necessarily intended), I'm not sure if varying the vertical span for numerals offers any practical net assistance to legibility/readability. Still, I will grant you, it's an idea that is far from having been fully tested.   \n   \n(Chewing away... and intrigued by the idea nonetheless....)   \n   \nDavid\n\n"
    },
    {
      "time": "13 Oct 2001 — 3:35pm",
      "content": "That's probably a big part of it.   \n   \nAnd, of course, we can't forget the divergent histories of the alphabet itself, which is the reason we have upper and lower case characters at all; the upper case characters being descendants of the Cretan pictographs via Phoenecian characters via Roman inscriptions, and the lower case diverging at this point and developing through the uncial hand forms via half-uncials into the familiar ascender/descender forms we know today. It was the notion of enhanced legibility of word shapes (and ease of writing), in part, that contributed to the decision to merge the two systems into our current bicameral alphabet. (Tricameral, if one counts the small caps; insert prefix of your choice if one counts the italics as well.)   \n   \n(Apologies for restating the condensed history of the alphabet, but it's integral to the discussion, and besides, at least I crammed it all into one paragraph. ;) )   \n   \nIt seems that the same considerations of legibility led to the lining and text figure dichotomy of the Arabic script numerals: lining figures seem best suited for titles, tabular settings and other display applications, while text figures seem to be more legible and aesthetically pleasing in text settings.   \n   \nWhich came first, the lining figures or the text figures? To be honest, I don't know for sure -- most of the books I have either ignore completely or gloss over the history of the figures. I suspect the original forms were closer to lining figures, and the text figures developed from them (much like the lower case figures derived from the capitals).   \n   \nWhile text figures didn't derive (directly, at least) from the uncial hand, they seem to have been intended to emulate it. This, I think, helps to alleviate the problem that Joe pointed out: a script-based figure set becomes more harmonized with a geometric-based alphabet when it carries visual elements in common, i.e., ascenders and descenders, and the rhythm and gestalt that they create.   \n   \nDifferent type designers have achieved this harmony in different ways, designing some figures to ascend and others to descend, or altering the length of the extenders relative to the alphabetic characters, or even doing away with the extenders completely.   \n   \nIn Bell's time (mid-eighteenth century), the fashionable solution was the three-quarter-height lining figure, rather than text figures. Many nineteenth and twentieth century type designers attempted to do away with the text figures altogether (as well as the lower case set, in many cases), which helps to explain why there is such a dearth of typefaces with complete lining AND text figure sets today (to say nothing of superiors, inferiors and titling sets).   \n   \nIt is only relatively recently that the value of the text figures (and the larger value of word shapes and legibility) has enjoyed a sort of renaissance, which is why we're all here discussing the subject today. ![:)](http://web.archive.org/web/20150414230154im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nCredit must be given to Robert Bringhurst for most of the above history, and his book, \"The Elements of Style\" -- it holds a solid place among my favorite typographic references.   \n   \nDavid Thometz\n\n"
    },
    {
      "time": "13 Oct 2001 — 7:38pm",
      "content": "Argh... Bringhurst's book is, of course, \"The Elements of Typographic Style.\" (Of all the things to screw up.... \\<:] )   \n   \nDave, the Embarassed\n\n"
    },
    {
      "time": "16 Oct 2001 — 3:51pm",
      "content": "Hrant: We'll miss you! You pretty much started us on this sub-thread, and I for one will miss your input on its discussion. Hurry back, and jump back in when you return! ![:)](http://web.archive.org/web/20150414230154im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nJoe: Thank you. And back to your original question, I suppose we can't completely rule out the effects of the Bauhaus movement and its call for a unicase alphabet in our discussion as well. The Bauhaus did, in fact, \"question the descender on the lower case p,\" as well as the entirety of the bicameral alphabet system. ![:)](http://web.archive.org/web/20150414230154im_/http:/www.typophile.com/forums/clipart/happy.gif) Many of the Bauhaus fonts questioned the lining-/text-figure dichotomy as well, although ironically, many designers still fashioned lining as well as text figures for their fonts from this period.   \n   \nI'd be very interested if anyone can offer more history on the Arabic script numerals that we use today.   \n   \nDavid\n\n"
    },
    {
      "time": "17 Oct 2001 — 11:20am",
      "content": "Anders: Thanks for the interesting references!   \n   \nIt all seems plausible to me except for the bit about the supposed geometric origins of the Arabic numerals proposed by M. Erhayiem. ( [http://www.arabicnumerals.cwc.net/](http://web.archive.org/web/20150414230154/http:/www.arabicnumerals.cwc.net/)) I must admit that I am skeptical about this \"number of angles\" theory.   \n   \nTwo elements of the theory specifically raise red flags in my mind.   \n   \nFirst, many of the forms that Erhayiem proposes (especially the \"7\" and the \"9\") seem contrived to fit the theory rather than being derived from it.   \n   \nSecond, these forms don't seem to match what we know about the early development of many of the figures, notably \"4\", \"5\", \"7\" and \"8\".   \n(Review J J O'Connor's and E F Robertson's article at [http://www-groups.dcs.st-andrews.ac.uk/~history/HistTopics/Arabic\\_numerals.html](http://web.archive.org/web/20150414230154/http:/www-groups.dcs.st-andrews.ac.uk/~history/HistTopics/Arabic_numerals.html))   \n   \nThe rest of it, however, pretty much sustains what I remember from history classes and my own research.   \n   \nI also seem to remember reading somewhere that the Indo-Arabic figures had their basis in cuneiform impressions, and it was curiously similar in many respects to systems used by pre-Columbian civilizations in South and Central America. \"1\" was represented by a single horizontal line segment, \"2\" was represented by two stacking horizontal line segments, and \"3\" was represented by three stacking horizontal line segments. (The system altered from this pattern for numbers above \"3\".) A theory suggests that when drawn quickly (at least in left-to-right writing), connecting lines formed between the stacking lines forming characters resembling our current figures \"1\", \"2\" and \"3\".   \n   \nI'll see if I can track down some references to this theory.   \n   \nDavid\n\n"
    },
    {
      "time": "7 Dec 2001 — 5:22pm",
      "content": "Um, a credit for the origin of the uppercase perhaps?\n\n"
    },
    {
      "time": "6 Oct 2001 — 5:57pm",
      "content": "I love to see good work inspired by wood types. This is very very nice. I love the \"s\" and the \"S\". I would prefer less modern shapes for cetain letters though - if you wanted to have something more \"woody\". The letters I don't like so much for this reason are the lower case: f, g, j and t. Very nice @ symbol. Do you have a website?\n\n"
    }
  ]
}
