{
  "id": "55192",
  "title": "Logo Critique for Agricultural Equipment Company",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I have just started with this project and would love to hear feedback from other designers.  \nDesigning for the agricultural industry is always a challenge.\n\nThe client has selected these two logos as his preferences so far.  \nThe logo to the left - Client would like to see JD style bolder (Any recommendations for a bolder style / I’m thinking more masculine?)  \nThe logo to the right - Client sees a crown / I was going for more of an abstract wheat / arrow / agriculture + technology (moving forward)\n\nI am limited to the yellow / green colors. The company is a seller of John Deere equipment plus other industrial brands.\n\nAg stands for the agriculture customer base the customer serves and tech is for the technology that is a key part of their products and services they offer.\n\n| Attachment | Size |\n| --- | --- |\n| [jd.jpg](http://web.archive.org/web/20131108191929/http:/typophile.com/files/jd_0.jpg) | 13.41 KB |\n\n",
  "author": "sjjstar",
  "time": "24 Feb 2009 — 6:12pm",
  "uid": "42592",
  "comments": [
    {
      "time": "24 Feb 2009 — 6:16pm",
      "content": "I am looking for suggestions for a masculine typestyle that could represent agriculture and technology merged too.\n\n"
    },
    {
      "time": "26 Feb 2009 — 5:53am",
      "content": "Does anyone have any suggestions?\n\n"
    },
    {
      "time": "27 Feb 2009 — 1:21pm",
      "content": "Looks like the client is trying to become John Deere through the color choices and initials! As far as fonts go...hmmm. Univers Black? Perhaps Frutiger? Helvetica Neue? Those would provide kind of a masculine feel while also hinting at technology without being too overbearing if used carefully.\n\n"
    },
    {
      "time": "27 Feb 2009 — 1:27pm",
      "content": "I'd also see if you could perhaps steer the client away from the painfully obvious John Deere colors. It just seems too - copy-cattish? Try to find some different color schemes. Also as far as agricultural imagery go, your leaf/crown is a bit too sharp - makes it seem unfriendly. Try to add some curves to it, make it less angular. Anyway, that's my thoughts. I'm sure I'll have more.\n\n"
    }
  ]
}
