{
  "id": "55197",
  "title": "event logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hi everyone\n\ncan I get your input on the execution of this idea?  \nthe client likes the initial concept, i am now designing variations around the idea.\n\nthanks in advance for your input.\n\n:tony\n\n ![](http://web.archive.org/web/20131101125427im_/http:/typophile.com/files/dine_5754.jpg)\n\n",
  "author": "designtn",
  "time": "24 Feb 2009 — 9:44pm",
  "uid": "21101",
  "comments": [
    {
      "time": "24 Feb 2009 — 9:58pm",
      "content": "First, it's a very cool concept, and I think the diner/neon feel is perfect for this concept. Nice work so far!\n\nSecond, I think there's a weight problem. The width of the e-fork is much broader than the other letters. Have you tried drawing the D and the N with more overall width to unify the letters more? I think doing that may help the e-fork feel less cluttered or \"tacked on\" (and, bonus, it will give you more room to enlarge DOWNTOWN so it's more legible when scaled down.)\n\nThis may also enable you to comfortably reduce the stroke weight of DIN to match the e-fork, too. I'd also smooth the inner joint of the fork handle to match the rest of your curved corners.\n\nAK\n\n"
    },
    {
      "time": "25 Feb 2009 — 6:33am",
      "content": "This is a good concept. I'd make the handle of the fork monoline rather than using two lines to define it, and not let it touch the 'n'. Widen D and N, and lose the gap in the 'D', which distracts the eye from the fork.\n\nGood luck\n\n"
    },
    {
      "time": "26 Feb 2009 — 3:49pm",
      "content": "agreed re: concept ... however it's looking very techy - certainly not something I associate with food.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20131101125427/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20131101125427/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": "26 Feb 2009 — 6:19pm",
      "content": "Paul\n\nyou just reinforced my thought.  \nI am mos def rethinking the typographic execution.\n\n:tony\n\n"
    }
  ]
}
