{
  "id": "55217",
  "title": "A pirate site...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There is a pirate site featuring a huge collection of commercial fonts for free...  \n\\*Link removed by moderator\\*\n\nAll foundries should ask to remove their stuff... Would be better for everybody!\n\nCheers!\n\n-xa\n\n",
  "author": "xa",
  "time": "25 Feb 2009 — 9:18am",
  "uid": "16983",
  "comments": [
    {
      "time": "25 Feb 2009 — 10:25am",
      "content": "Thanks for the heads up about this site. However, it is our policy to keep links to these sites out of the forums, that is why I have edited your post.\n\nWe most definitely encourage people to make the community aware of font piracy, but we'd rather not become the starting point for people to access these sites.\n\nThanks!\n\n"
    },
    {
      "time": "25 Feb 2009 — 11:03am",
      "content": "Zara speaks the truth. And the foundries are aware of this particular site. In the future if anyone has information about a site that is sharing fonts and you know they shouldn't be it is better to contact the foundries directly or you can email one of the moderators and we will pass the information along to the appropriate people.\n\n"
    },
    {
      "time": "26 Feb 2009 — 6:17pm",
      "content": "Have any of you been following the trial in Sweden against the Pirate Bay people? Amazingly, the first day the charges were dropped by 50%. I haven't heard anything since - have you?\n\n"
    },
    {
      "time": "26 Feb 2009 — 6:25pm",
      "content": "\\>the first day the charges were dropped by 50%.\n\nFortunately the music and movie companies were able to download some additional charges they found on the Web.\n\n"
    },
    {
      "time": "2 Mar 2009 — 8:25am",
      "content": "Day 10 - [http://torrentfreak.com/the-pirate-bay-trial-day-10-calls-for-jail-time-...](http://web.archive.org/web/20131023204822/http:/torrentfreak.com/the-pirate-bay-trial-day-10-calls-for-jail-time-090302 \"http://torrentfreak.com/the-pirate-bay-trial-day-10-calls-for-jail-time-090302\")\n\nPreceding days are covered there too, should be easy to find.\n\nAll in all, the prosecutors don't have a chance. If TPB is found guilty, then any other search engine is at fault for the exact same reasons. RIAA/MPAA's only argument is that TPB doesn't cooperate with them in removing \"unwanted material\" (while Google allegedly does), but until there's a law that tells TPB to do that, they are in the clear.\n\nIt's really interesting how all this plays out.\n\n"
    },
    {
      "time": "2 Mar 2009 — 9:06am",
      "content": "<cite>It’s really interesting how all this plays out.</cite>\n\nIt’s going to get a lot more interesting when the Swedes find out what it’s like to be a first-world nation getting third-world-dictator trade deals because the US, Canada, and the rest of Western Europe get sick of Sweden harboring the Pirate Bay. Russia caved on pirate sites and they have huge stocks of oil and natural gas to leverage. How long does the Swedish parliament think that everyone is going to play these games with them?\n\n"
    },
    {
      "time": "2 Mar 2009 — 10:17am",
      "content": "The Washington State National Guard are amassing on the border of Ikea in Renton. If things don't go well they'll move in and occupy the building - they have a map showing the short-cuts so as to avoid department to department hand to hand fighting.\n\n"
    },
    {
      "time": "2 Mar 2009 — 10:20am",
      "content": "Good thing my Volvo's engine failed, or else I would be at the mercy of exorbitant parts prices if trade deals go south with Sweden.\n\nWait a second...\n\n"
    },
    {
      "time": "2 Mar 2009 — 10:46am",
      "content": "\\> Russia caved on pirate sites\n\nI can assure you that this is simply not true. Even the closure of the infamous allofmp3.com was a staged farce. It was closed alright, but it reopened under a different name in A DAY and it is still in operation.\n\nAlso keep in mind that bulling Sweden or shutting down TPB won't help the cause. The technology is out of the bottle and it effectively invalidated established licensing methods. There is simply no going back to the old ways. That's pretty much like giving people a taste of driving a car and then forcing them back on a donkey. It ain't going to work, scaremongering or not.\n\n"
    },
    {
      "time": "2 Mar 2009 — 10:56am",
      "content": "<cite>The technology is out of the bottle…</cite>\n\nI agree with you there. But I expect the Pirate Bay and Sweden’s laws on the issue will eventually become a diplomatic circus as everyone else tries to figure out what to do about it.\n\n"
    },
    {
      "time": "2 Mar 2009 — 10:58am",
      "content": "Oh, certainly. That's why I said it was interesting to see how it all develops :)\n\n"
    },
    {
      "time": "2 Mar 2009 — 2:30pm",
      "content": "I found some of my stuff on a website in Russia (initials tr). Is it advisable to ask for removal of links?\n\n"
    },
    {
      "time": "2 Mar 2009 — 4:05pm",
      "content": "_There is simply no going back to the old ways. That’s pretty much like giving people a taste of driving a car and then forcing them back on a donkey._\n\nActually, someday we will run out of oil. We will probably need to find an alternative. So I'm not sure about that analogy. ;-)\n\nAnyway, just because something is being pirated, doesn't mean that EVERYONE will go running to get pirated wares, digital or not. In New York City, I see people selling pirated DVDs and knock-off items all the time, but the bona fide items also do good business.\n\n"
    },
    {
      "time": "3 Mar 2009 — 1:55pm",
      "content": "\"How long does the Swedish parliament think that everyone is going to play these games with them?\"  \nhave you even _tried_ their fish? anyone else see the Colbert Répor last night?\n\nCheers!\n\n"
    }
  ]
}
