{
  "id": "55211",
  "title": "A Simple Pledge",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20100923100346im_/http:/typophile.com/files/promise_poster_4675.jpg)\n\nPoster by Jeff Matz, of Lure Design.\n\nOrder it [here](http://web.archive.org/web/20100923100346/http:/www.luredesigninc.com/pledge/).\n\n[Via [design:related](http://web.archive.org/web/20100923100346/http:/designrelated.com/).]\n\n",
  "author": "<a href=\"/web/20100923100346/http://typophile.com/user/7716\" title=\"View user profile.\">Ricardo Cordoba</a>",
  "time": "<br>",
  "uid": "7716",
  "comments": [
    {
      "time": "",
      "content": "Thirty seconds after that goes up on the wall your best client is going to call and ask you to do his daughter’s wedding invites in her favorite font…\n\n"
    },
    {
      "time": "",
      "content": "LOL! Of course. :-D\n\n"
    },
    {
      "time": "",
      "content": "Nice poster - but I think the Cap \"R\" should have been avoided too. Although I'm sure Ricardo would disagree.\n\n"
    },
    {
      "time": "",
      "content": "I could always change my Typophile icon, sii... ;-)\n\nYours truly,  \nicardo\n\n"
    },
    {
      "time": "",
      "content": "I PROMISE I WILL  \nNEVER USE LARGE  \nSLAB SERIF FACES  \nTO EVOKE OVERLY  \nTRENDLY FAUX WOOD  \nTYPE POSTERS AGAIN\n\n"
    },
    {
      "time": "",
      "content": "(not that I don't love overly trendy faux wood type posters...)\n\n"
    },
    {
      "time": "",
      "content": "TRENDLY\n\nI like that. It makes trends seem more inviting.\n\n"
    },
    {
      "time": "",
      "content": "Hobo?\n\nI can see comic sans and Papyrus, but I don't recall seeing Hobo in many places.\n\nMaybe I'm just repressing my memories of it or something.\n\n"
    },
    {
      "time": "",
      "content": "\\>I can see comic sans and Papyrus, but I don’t recall seeing Hobo in many places.\n\nSeems as if you interpret this as sending a message to designers to avoid over-used fonts? I interpret this as a deeply personal poster. The chap who made it obviously has remorse over past font choices.\n\n"
    },
    {
      "time": "",
      "content": "\\>TRENDLY  \n\\>I like that. It makes trends seem more inviting.\n\nYou're talking rubblish!\n\n"
    },
    {
      "time": "",
      "content": "_I can see comic sans and Papyrus, but I don’t recall seeing Hobo in many places._\n\nmerkri, this is just for you! :-)\n\n[Hobo: Photos of a typeface](http://web.archive.org/web/20100923100346/http:/thedesignoffice.org/hobo/)\n\n"
    },
    {
      "time": "",
      "content": "[[http://www.flickr.com/photos/arkadian/3310259750/in/pool-hobo/|Wow!]] I had always heard kids came from somewhere else... Too bad they couldn't turn used clothing into real quotation marks or an n that sits on the baseline.\n\n"
    },
    {
      "time": "",
      "content": "Handpicked\n\n"
    },
    {
      "time": "",
      "content": "_Wow!_ [\"Kiducation\"]\n\nNot Hobo.\n\n"
    },
    {
      "time": "",
      "content": "There's an overpriced pizza place near me that uses Hobo exclusively for their identity, menu, etc. Surprisingly, it looks okay. I think the reason Hobo usually looks bad is because it's usually used by people who want to use all the fonts they have at the same time, and _nothing_ goes _with_ Hobo.\n\n"
    },
    {
      "time": "",
      "content": "Some of the Indian tribes here in California have been running ads illustrating how their casinos are benefiting their people and society in general.  \nI notice that on many of the official buildings shown in these ads, the signage is lettered in Hobo.\n\nJust sayin' what I'm seein'.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Not Hobo.</cite>\n\nNick's right. \"Kiducation\" is set in Berlin Sans (possibly squooshed). No Hobo in sight there.\n\n"
    },
    {
      "time": "",
      "content": "_merkri, this is just for you! :-)_\n\nAhh...now I remember.\n\nThanks for retraumatizing me with things I had obviously pushed to the dark recesses of my memory.\n\n:)\n\nFor some reason, Hobo still doesn't rub me the same way as Comic Sans or Papyrus, but I see your point.\n\n"
    },
    {
      "time": "",
      "content": "I think this would only be a big challenge if you do a lot of work for spas and Thai restaurants (Papyrus), an elementary school (Comic Sans), and for Hobo... I guess maybe Korean nail salons in strip malls? I don't know if Hobo is really overly used anymore, although I guess it was 10, 20 years ago. But I don't think I've ever been forced into using those typefaces, and I would imagine a good portion of designers have never used them either. Just because they're visible in the American (and probably global) landscape doesn't mean graphic designers are to blame -- I think it's usually churn and burn signmakers who are so cheap they only have the fonts pre-installed on Windows at their disposal.\n\nThat said, this pledge can't hurt anything. Although maybe a more interesting challenge (possibly a Typophile challenge?) would be to use these three typefaces in an appealing way.\n\n"
    },
    {
      "time": "",
      "content": "FeeltheKern:\n\nwas that a challenge, or a suicidal death wish? personally, i'm all for it. even if it does kill me in the end.\n\n"
    },
    {
      "time": "",
      "content": "again?\n\n- Scott\n\n"
    },
    {
      "time": "",
      "content": "_churn and burn signmakers_\n\nGreat term!\n\n"
    },
    {
      "time": "",
      "content": "<cite>churn and burn signmakers</cite>\n\nI resemble that remark\n\n"
    },
    {
      "time": "",
      "content": "_@speter:_ The best (i.e. worst) thing about the \"Kiducation\" sign is that it's a twofer: Not only is \"Kiducation\" set in Berlin Sans (which could be described as Hoboid), but \"ADULT & CHILDREN\" is set in another never-again font, Souvenir (so is the trademark symbol).\n\n"
    },
    {
      "time": "",
      "content": "What typeface is used in the poster (asks the greenhorn...)?\n\n"
    },
    {
      "time": "",
      "content": "Ask Ricardo :)\n\n"
    },
    {
      "time": "",
      "content": "Wow this poster must of taken a long  \ntime to create (being sarcastic.)\n\nGuerrizmo+Design  \nNo man is an island unto himself\\_John Donne\n\n"
    },
    {
      "time": "",
      "content": "Visit your friendly neighborhood Applebees and see Hobo for yourself. Before you walk in the door, there it is. A wooden plaque denoting regular business hours.\n\nIf your name is Scott Sullivan you should check out [Applebees.com](http://web.archive.org/web/20100923100346/http:/www.applebees.com/) for all the Cooper Black you can handle.\n\n"
    },
    {
      "time": "",
      "content": "_What typeface is used in the poster (asks the greenhorn...)?_\n\n_Ask Ricardo :)_\n\nThat would be [Giza](http://web.archive.org/web/20100923100346/http:/www.fontbureau.com/fonts/Giza), from Font Bureau. :-)\n\nI am also partial to (okay, madly in love with) [The Proteus Project](http://web.archive.org/web/20100923100346/http:/www.typography.com/fonts/font_overview.php?productLineID=100019), from H&FJ.\n\n"
    },
    {
      "time": "",
      "content": "@ricardo - all great fonts!\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Ricardo.\n\n"
    },
    {
      "time": "",
      "content": "FeeltheKern - Creative Review ran a Comic Sans special where they had a handful of designers do posters using only Comic Sans. Julian Morey did a phenomenal one. It can be viewed on his website - [http://www.abc-xyz.co.uk/online.htm](http://web.archive.org/web/20100923100346/http:/www.abc-xyz.co.uk/online.htm \"http://www.abc-xyz.co.uk/online.htm\")\n\n"
    },
    {
      "time": "",
      "content": "great fonts\n\n"
    },
    {
      "time": "",
      "content": "_FeeltheKern: and burn signmakers_ I like that.\n\nIt's not that signmakers are necessarily too cheap. They just don't have the software/fonts budget the Ivory Tower graphic designers have.\n\nI've always thought it was humorous in a gruesome sort of way that most folks will pay out the nose when they go to a graphic designer, but quibble over every nickle when it comes to getting their signs made.\n\nAs for the fonts, you should see the mess a CNC router table makes of Papyrus, one of my boss's favorite fonts. And yes, he is too cheap.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20100923100346/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "",
      "content": "_...Papyrus, one of my boss’s favorite fonts._\n\nThe horror... The horror...\n\n ![](http://web.archive.org/web/20100923100346im_/http:/typophile.com/files/apocalypse-brando2_6509.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Just annoying....\n\nHorror is the client with 10 revisions for a $65 project...ARGH!!!\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20100923100346/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "",
      "content": "I think the reason Papyrus is used so much these days is that it is a font that says \"non-Western\" but which doesn't seem to invoke any bad ethnic stereotypes.\n\nSo it's heavily used because it is an obvious choice that fills a real pressing need in today's world.\n\nAnd, thus, of course it's used for purposes that have nothing to do with Ancient Egypt, but instead, say, India or the Far East - one place I see it every day is in advertisements for \"Trade Winds for Success\", a local program of pre-apprenticeship training offered to persons of Native American descent.\n\n"
    },
    {
      "time": "",
      "content": "…  \n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "My complaint isn't necessarily that Papyrus is overused. For signs, it is too light and too node heavy. The software for the CNC machine faints when it is mentioned, and plotters chew it up on the vinyl.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20100923100346/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "",
      "content": "While Hobo is often misused, probably by people who have a choice of either Hobo or a heavy sans-serif for a sign, here is an appropriate use of Hobo to simulate humorous hand lettering:\n\nhttp://www.girlgeniusonline.com/!.images.ads/comicad/comicad\\_mythsplosion.jpg\n\n"
    },
    {
      "time": "",
      "content": "I suppose someone's already posted [this](http://web.archive.org/web/20100923100346/http:/prttyshttydesign.blogspot.com/2010/01/open-letter-to-james-cameron-from.html) elsewhere on Typophile, but since it's about Papyrus... ;-)\n\n"
    },
    {
      "time": "",
      "content": "And, in 2010, I resolve to use punctuation.\n\nTim\n\n"
    }
  ]
}
