{
  "id": "5524",
  "title": "Logo - Webdesign studio",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everybody,   \n   \ni just came across this great forum the other day. ![:-)](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nAs i am currently working on creating a new logo for my own (web)design business i thought i would post the current status here for criticism. Its basically a refinement of ideas that were used before. I just now finally went to use plain vectors ;)   \n   \n ![rush.media logo](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/40125.jpg)   \n   \nThe symbol stands for energy and speed, attributes that are linked to the word \"rush\".   \nI am interested in hearing your opinions on this logo, how does it work?   \n   \nThanks,   \nMartin\n\n",
  "author": "rush",
  "time": "7 Jul 2004 — 3:03pm",
  "uid": "4149",
  "comments": [
    {
      "time": "8 Jul 2004 — 5:47am",
      "content": "This logo could be used for a million different companies, what makes it represent your \"personal\" web company.\n\n"
    },
    {
      "time": "8 Jul 2004 — 5:49am",
      "content": "I guess what I am trying to say is that in my personal opinion the symbol is just a symbol and doesn't connect me to your name. Another way to put it would be to take away the name and try and figure out what kind of company the logo is for.\n\n"
    },
    {
      "time": "8 Jul 2004 — 6:08am",
      "content": "Don't mind me I'm just the Devil's advocate.\n\n"
    },
    {
      "time": "8 Jul 2004 — 6:20am",
      "content": "You could come up with so many different ideas for rush, its hard to see you settle on this solution.\n\n"
    },
    {
      "time": "8 Jul 2004 — 6:22am",
      "content": "I keep getting hung up on the period. It doesn't seem like a natural part of the mark -- more so that it is (forgive my presumption) an onstentatious addition to make the mark more \"cool.\"   \n   \nAs I type this, I wonder if you meant it as a \"dot com\" reference? If so, I guess it makes sense, but I think it needs to \"get there\" quicker.   \n   \nAs for the symbol, I like the vortex idea and suggest you roll with it. Good luck!\n\n"
    },
    {
      "time": "9 Jul 2004 — 5:11am",
      "content": "First off, thanks for the critiques, it's very appreciated.   \nYou are raising some good points here.   \n   \nEspecially the complaint about the connection between the symbol and the name. It probably is not a literal illustration of the word rush by any means. Like stated before i am rather thinking of it as an expression of movement, exitement and power. However i understand your concerns.   \nObviously opinions differ on this one, as i have two voices against the idea and one confirmation. Anybody else? ![:-)](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nIf i stick with the symbol, is there anything you would change about it?   \n   \nI am glad John B. is talking about the dot in rush.media. My reasoning behind it was to kind of seperate the two words rush and media visually. I definitely don't like it to be one word, as it looks too crowded and unimpressive. Yet, i still wanted them linked somehow, hence the dot.   \nHow would you go about it, have separate words or a different solution?\n\n"
    },
    {
      "time": "9 Jul 2004 — 5:13am",
      "content": "First off, thanks for the critiques, it's very appreciated.   \nYou are raising some good points here.   \n   \nEspecially the complaint about the connection between the symbol and the name. It probably is not a literal illustration of the word rush by any means. Like stated before i am rather thinking of it as an expression of movement, exitement and power. However i understand your concerns.   \nObviously opinions differ on this one, as i have two voices against the idea and one confirmation. Anybody else? ![:-)](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nIf i stick with the symbol, is there anything you would change about it?   \n   \nI am glad John B. is talking about the dot in rush.media. My reasoning behind it was to kind of seperate the two words rush and media visually. I definitely don't like it to be one word, as it looks too crowded and unimpressive. Yet, i still wanted them linked somehow, hence the dot.   \nHow would you go about it, have separate words or a different solution?\n\n"
    },
    {
      "time": "9 Jul 2004 — 5:44am",
      "content": "A suggestion about the symbol would be to simplify it.   \n   \nA suggestion about the type separation would be a forward slash instead of a period.\n\n"
    },
    {
      "time": "9 Jul 2004 — 7:04am",
      "content": "First off, thanks for the critiques, it's very appreciated.   \nYou are raising some good points here.   \n   \nEspecially the complaint about the connection between the symbol and the name. It probably is not a literal illustration of the word rush by any means. Like stated before i am rather thinking of it as an expression of movement, exitement and power. However i understand your concerns.   \nObviously opinions differ on this one, as i have two voices against the idea and one confirmation. Anybody else? ![:-)](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nIf i stick with the symbol, is there anything you would change about it?   \n   \nI am glad John B. is talking about the dot in rush.media. My reasoning behind it was to kind of seperate the two words rush and media visually. I definitely don't like it to be one word, as it looks too crowded and unimpressive. Yet, i still wanted them linked somehow, hence the dot.   \nHow would you go about it, have separate words or a different solution?\n\n"
    },
    {
      "time": "9 Jul 2004 — 7:07am",
      "content": "For some reason my first response, which would've been the first responsive post on this thread, didn't post.   \n   \nBasically, all I said was that I got more of an organic growth impression from the mark, rather than \"energy and speed\". I think this impression might be resulting from the seedlike shapes that are repeated in the graphic.   \n   \nThe dot doesn't bother me at all. It is a natural symbol to use for any web related business. \"media\" could refer to a myriad of different kinds of business, so the dot helps to identify you as a web media business.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "9 Jul 2004 — 7:40am",
      "content": "I, like Scott, get more of an organic feel with your logo . . . I saw it more as a flower-type image and it also actually kind of reminds me of one of a child's pinwheel . . . of course these types of different interpretations will happen with such a generic-type icon. . .   \n   \ni actually don't mind the dot -- but some other ideas to try to separate the words would be each word in a different font or color or maybe even try putting the dot in a different color other than black.   \n   \nMaybe come up with a few more ideas and take this one in a few different directions as well . . .\n\n"
    },
    {
      "time": "9 Jul 2004 — 7:54am",
      "content": "Or, another classic way of separating the two words is to have one in bold and the other regular.   \n   \nOr, italicized type seems to be rushing...\n\n"
    },
    {
      "time": "9 Jul 2004 — 10:40am",
      "content": ".\n\n"
    },
    {
      "time": "9 Jul 2004 — 10:40am",
      "content": ".\n\n"
    },
    {
      "time": "9 Jul 2004 — 10:41am",
      "content": "Sorry for the double/triple/whatever post ![:-(](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/clipart/sad.gif)   \nI kept getting an internal server error when posting, but it actually was added to the thread it seems.   \n   \nI will pick up your suggestions and make some variations of the logo.\n\n"
    },
    {
      "time": "10 Jul 2004 — 10:55am",
      "content": "I don't think the symbol expresses swift motion and energy. When I look at it, it is very static ... if there is a motion implied, it would something like slowly rotating. Nothing like 'rush'. I think you should reconsider the symbol.   \n   \nThe period in the name is okay with me.   \n   \n--   \nS\n\n"
    },
    {
      "time": "10 Jul 2004 — 11:23am",
      "content": "Following your advices i thought about different or changed symbols to use for the logo.   \n   \nOn the first one i did something completely different. Basic idea is to use a gradient to again convey the idea of movement or speed. I decided to make it a mosaic to give it a nice touch. Of course you could also read it as reference to screen design, i.e. pixels. Now, i am not sure if that is all too far fetched to make sense.   \n   \nThe second one is taking the vortex idea a little further and making it more prominent. Also that way the symbol is more simple and easier to grasp than in the original.   \n   \nThird is basically the original, i just took out one layer of shapes to make it a little less complex as well. Those of you that said they got an impression of organic growth from it are right. There is a certain resemblance to a flower as well. I actually had this in the back of my mind when i made it.   \n   \nFor the type, i really liked the suggestion by Sally to use a different color on the dot. I think it works well because it makes the dot less dominant so you don't trip over it when looking at it, while it still works to separate the two words.   \nIn earlier incarnations of design i did use italics and bold type on rush and media like suggested, but this time i would rather not do that as i found it makes the name look unbalanced.   \n   \n ![Variations](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/40321.jpg)   \n   \nWhat are your ideas on these designs, what direction do you think i should go?\n\n"
    },
    {
      "time": "10 Jul 2004 — 12:04pm",
      "content": "What do you want your logo to convey about your company?   \n   \n(you mentioned \"an expression of movement, exitement and power\" . . . is that what you want to communicate with your logo? how does that relate to your company?)   \n   \nJust a couple of questions to get a better understanding of what the goal of your logo is . . . hard to say what will work best without knowing that.\n\n"
    },
    {
      "time": "10 Jul 2004 — 12:11pm",
      "content": "the square is no good. it's completely static and if you have to use it sometime in grayscale at a small sice it will look quite bad.   \n   \ni think the second solution has most motion, but is still a bit too friendly/calm to me. perhaps you could make those shapes sharper or let the narrow side look outwards.\n\n"
    },
    {
      "time": "11 Jul 2004 — 2:02am",
      "content": "I don't think the period should be yellow. It is almost invisible as it is here, let alone if it should be photocopied.   \n   \nBut the main thing that bothers me is your symbol. It is static.   \n   \nWhat do you want the symbol to convey? If it is swiftness and energy (thus acting together with the word 'rush'), I don't think you can achive it by using this symetric vector graphic.   \n   \nI think motion can be designated two ways with graphics:   \n   \nA   \nThe picture designates a thing that is moving. (Examples: a drawing of hunting falcon, a picture of Superman with his one arm outstretched). Explanation: we see the thing move because we know it moves.   \n   \nB   \nThe picture is an arrangement of elements placed dynamicly (Example: a line of dots placed with increasing distance) Explanation: The gestalt laws determine this arrangement \"moves\" before our eyes.   \n   \nYour abstract symbol does not move. On level A, it could be a fan, rotating very slowly -- but it resembles a flower just as well. On level B, it hardly moves, because it is too symetric.   \n   \nIf you want your symbol to tell a story, and the story has to be swiftness, I think you should reconsider it. Or else, let the symbol tell another story (like when you started to draw pixels instead).   \n   \n--   \nS\n\n"
    },
    {
      "time": "12 Jul 2004 — 4:55am",
      "content": "Hi all,   \n   \nthanks again for the feedback.   \nFirst let me try to explain what i would like to convey with a symbol for my firm. It should symbolize attributes like motion, energy and excitement. Not only because that is connected to the word rush, but also because these are desirable attributes for the work i do - at least in the case of excitement. If you haven't done so you can go to rushmedia.de to get an idea of my work.   \n   \nThat said, it seems my attempts so far didn't work well. As Soren pointed out the symbols i used are still too static.   \nI still like the idea of a vortex, and i wonder if i could change it in a way to make the element of motion apparent enough. However i also think about other images that could be used to symbolize motion. I want to stay with simple abstract shapes if possible.   \n   \nI will work on new/improved symbols. If you have any further suggestions i am happy to hear them.\n\n"
    },
    {
      "time": "12 Jul 2004 — 5:41am",
      "content": "I think their is something in the square mark that is intreaging. You have subtley created motion within the square shape by using variations of color. The contrast of elements is kind of nice. Plus you reference pixels which is a nice connection to the multimedia world. In fact, motion on screen is created by the changes of color from pixel to pixel.   \n   \nThere would be no need to round the edges of the square.   \n   \nAsymetry is what creats motion!\n\n"
    },
    {
      "time": "12 Jul 2004 — 10:10am",
      "content": "Soren makes good points. Initially I was thinking of a charging bison. I know thats been done. But its a viual stuck in my mind that I associate with rush(in a herd).   \n   \n2nd I enjoy most, but I would come up with more options.   \n   \nAndrew\n\n"
    },
    {
      "time": "12 Jul 2004 — 12:53pm",
      "content": "I agree with Soren also and a way to make your flower rush may be to spiral the petals outward (does that make sense?) increasing in size as they go and possibly also color intensity. That would give it a somewhat tunnel feel like a vortex.\n\n"
    },
    {
      "time": "13 Jul 2004 — 10:25am",
      "content": "In keeping with many of the other postings I agree that the spiral versions of your logo are not quite hitting the mark. They seem more representive of spinning (which can be more of a negative ie: spinning one's wheels but getting nowhere) than \"rushing\" or getting from here to there. At first I wasn't wild for the dot. Depending upon your clients, it could be confusing for them as they look for the url rush.media. Who are you branding yourself to? If they are tech savy it's not an issue of course but on the whole the general public still finds the web a little overwhelming and confusing. On your second go-around with the colored dot it became more of a graphic element and therefore less likely it would be misinterputed as part of an address.   \n   \nSo far I like the square/pixel version however, I would suggest making the dot a small square.   \n   \nOverall perhaps you should re-think your design elements. In your first posting you said these were refinements from previously used designs, are you trying to keep the old elements simply for recognition?   \n   \nJust went to your web site. The spiral logos do look like flowers and you use a lot of floral imagery on your site, perhaps it's the name that should be re-thought, flowers don't really convey the concepts of speed and energy.\n\n"
    },
    {
      "time": "14 Jul 2004 — 7:41am",
      "content": "Thanks for the continued support.   \nSome of you liked the idea of my pixel symbol, hinting to screen design and using the gradient to convey an idea of movement. I took the idea one step further to add the kind of rush i was looking for. Putting the square in perspective i think it combines the impression of motion and of the pixels as the elements of screen design.   \nI made two versions for now, with slightly different angles. Also i tried if i could place the symbol behind the word in the smaller version. Just food for thought.   \nI really prefer the rounded corners on the symbol for a number of reasons. First, it gives a nice resemblance to the image of a screen. Second, it \"holds together\" the single squares, making it look more like one unit. And last, it works well together quite well with the font used imho. I also made the dot between the words into a rounded rectangle to go along with the symbol.   \n   \nBelow, there is different versions of the vortex symbols. I tried to add more motion to them. I am not convinced though and the approach maybe just doesn't work. No matter what it always looks more like a flower than anything else. I wanted to put them here anyways though.   \n   \nI am very much leaning towards the \"pixel and screen\" symbol, it looks fresh and clean, and i really like the abstract approach.   \nYour comments?   \n   \n   \n   \n ![](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/40648.jpg)\n\n"
    },
    {
      "time": "14 Jul 2004 — 11:58am",
      "content": "The vortex idea is still not getting anywhere, so I favour the pixel direction.   \n   \nI wouldn't use the yellow colour for the dot. (1) It competes with the pixels above. (2) It will disappear when photocopied and in small sizes.   \n   \nWell, about the pixel idea:   \n   \nYou signal 'computer' with two elements:   \n1. The pixels   \n2. The screen shape   \n   \nYou signal 'movement' with two design desicions   \n1. The screen is warped   \n2. The pixels form an arrow-like shape as part of a colour gradation of the screen   \n   \nWell, just a thought: instead of four things, could you get down to maybe two? I'm thinking of, say, an arrangement of pixels, without the screen background, arranged so that some real movement occurs.   \n   \nBecause, to me, there's still something left of the drawback from the \"flower\": it doesn't move yet.   \n   \nLet me know if I'm into a personal thing here ... ;-)   \n   \n--   \nSoren O\\</font\\>\\</font\\>\n\n"
    },
    {
      "time": "14 Jul 2004 — 12:33pm",
      "content": "What if the pixels arrangement was never the same within the square. What if the the logo on the web was changing every 5 seconds or so. What if the color/hue arrangement on the buisnesscard logo was different than the color/hue arrangement on the letterhead logo. What if you created an \"r\". using the pixels. I already see an lowercase r in the square just subtract a few pixels.   \n   \n ![](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/40667.jpg) ![](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/40668.jpg)\n\n"
    },
    {
      "time": "14 Jul 2004 — 5:58pm",
      "content": "Not to change the subject back to the period, but I think the period detracts from your intention to convey speed and energy. It has a connotation of stopping, not rushing. I think it would be more consistent to use a slash, or a bullet, or have one word bold and one not as someone suggested.\n\n"
    },
    {
      "time": "14 Jul 2004 — 11:25pm",
      "content": "David -- I like the idea of a trademark that changes on the screen (but I don't think you should try to make a picture of 'r and dot' with pixels, it won't work).   \n   \nZach -- the period's connotation of stopping doesn't work well together with the idea of swiftness. I totally agree. But before we consider other signs as slash or bullets (that may cause trouble if somebody tries to type it as an URL) ... why not just skip the thing, and let the name be 'rush media'. Less is more.   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "15 Jul 2004 — 2:58pm",
      "content": "Another update, again i am trying to follow some of your ideas.   \n   \nThe two top symbols are my answer to Soren, who is never able to feel the movement in my creations ![:-)](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nIs this what you are having in mind when you were talking of an arrangement of pixels that would really create movement?   \nThose arrangements are definitely not perfect, in fact looking at it now it reminds me of fireworks.   \n   \nPlus i got rid of the dot to see how it looks. I agree that having a dot in the name is a flawed concept. Graphically however i still like to have it though, it just adds a little something. I think its true that you should be careful trying to replace the dot with something else, to make sure it does not confuse the viewer.   \n   \nI have to say that i like Davids of idea of making the colors on the pixels dynamic or vary them for different applications. That would be a real nice touch.   \nThe other idea of forming a letter \"r\" with the pixel colors is maybe too hard to convey. Nevertheless i made a quick example. It might be an option to alter the shapes of the pixels to form a letter that can be noticed.   \n   \n   \n ![rushmedia rebrand take4](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/40782.jpg)\n\n"
    },
    {
      "time": "16 Jul 2004 — 6:02am",
      "content": "Scrap the R concept. I like the skewed angle.   \nYour thoughts on dynamism are good.   \n   \nAndrew\n\n"
    },
    {
      "time": "16 Jul 2004 — 9:51am",
      "content": "I have been looking at your new designs with\n\n"
    },
    {
      "time": "16 Jul 2004 — 11:31am",
      "content": "Andrew-- Thanks for your thoughts. I also like the concept of the skewed square the most so far. To me it has a strong expression, yet its simple enough.   \n   \nSoren-- You are or have been thinking on a different level than i about the theories of movement and pixel placement it seems. While i think i can follow your ideas it seems i don't get down to what you are actually meaning. I have been playing with pixels on paper and in my mind, but i don't seem to be able to create that strong movement. How would you arrange a set of pixels that depicts \"rush\"? Something like streaks?   \nMy thoughts when i did the last designs was of a moving object (the bigger pixels) that will leave a trail (of smaller pixels). So the different pixels sizes were not meant as an information of distance, though i agree this is true also.   \n   \nThe other symbol of a \"screen\" could be animated, yes. I did not do this for now, as it has to work as well without it, it would just be a nice little enhancement for the web.   \n   \nI think i would agree, after all the different designs, that maybe one of these will work just as good in their own way.\n\n"
    },
    {
      "time": "16 Jul 2004 — 12:07pm",
      "content": "The pixels don't move. The color of the pixels change to create the movement. The only way to truley show motion is with film. Motion on a screen ISN't really motion at all. It is however pixels changing color to create the ILLUSION of motion. I LIKE THE IDEA OF THE LOGO ALWAYS MOVING ON \"SCREEN\". However each logo by itself on a given piece of \"PRINTED\" matter would unable to show motion because it is imposible. Think of it as taking a photo of a pixel arrangent. Or think of it as a freeze frame in a movie.\n\n"
    },
    {
      "time": "16 Jul 2004 — 2:01pm",
      "content": "The interactivity or motion of your logo will be fully realized in your web animation.   \n   \nI guess I just assumed this is the direction you were moving with your identity. That the pixels would alternate in a certain path on screen to create a rush of movement.   \n   \nIt is certainly what I envision now.   \n   \nAs a printed logo of course it lacks rush, and you can work out compositions with shape cutouts or pen and ink (Soren's point 4) to create more powerful movement than you have now.\n\n"
    },
    {
      "time": "19 Jul 2004 — 2:30pm",
      "content": "I think we are getting closer here, but i guess i need a little more help.   \n   \nThe idea of moving pixels inside the square on the webpage is great, as everybody agrees. I definitely want to do that.   \nWhat i am still fighting with is what to do with the symbol for print matters. Of course you are right when you say that a snapshot of this skewed square symbol is not showing as much of a motion. However the basic appearance of the square should remain, shouldn't it?   \nSo how are your thoughts (Soren and Andrew) about creating motion for a still version of the logo?   \n   \nAlso, i have followed your advice of playing with shape arrangements, but i admit for me it only works so far. Creating the impression of fast movement with only a few shapes i don't achieve in a convincing way.   \nThats why i used the gradient of color that, like a strong motion blur, resembles fast movement in a picture.   \n   \nIf you can give me some more ideas i'd be thankful.\n\n"
    },
    {
      "time": "19 Jul 2004 — 2:58pm",
      "content": "![](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/41092.gif)\n\n"
    },
    {
      "time": "19 Jul 2004 — 3:02pm",
      "content": "cool suggestion, Andrew. something like this could really give your logo some dynamics, M.\n\n"
    },
    {
      "time": "19 Jul 2004 — 3:28pm",
      "content": "Why would you try and show \"MOTION\" on \"PRINTED\" matter? The two ideas are totally contradictory to one another.\n\n"
    },
    {
      "time": "19 Jul 2004 — 3:32pm",
      "content": "One odd question: Why the color Orange?\n\n"
    },
    {
      "time": "19 Jul 2004 — 3:49pm",
      "content": "M., check out this book, it will help.   \n   \n [http://youworkforthem.com/product.php?sku=P0100](http://web.archive.org/web/20131023141930/http:/youworkforthem.com/product.php?sku=P0100)\n\n"
    },
    {
      "time": "19 Jul 2004 — 7:04pm",
      "content": "\"Why would you try and show \"MOTION\" on \"PRINTED\" matter? The two ideas are totally contradictory to one another.\"   \n   \nDavid: Is that a serious question? Am I missing something here? Why wouldn't you show motion on print? Unless I am misunderstanding the comment, it seems odd that a designer would question trying to represent anything in print. It's what we do.\n\n"
    },
    {
      "time": "20 Jul 2004 — 2:22am",
      "content": "Andrew-- Thanks for the suggestion, thats a good concept. I just wonder if you imagine to merge this into the idea of the square symbol, or if that is supposed to be a different idea. Looking at it i could imagine using the skewed square i have and blending it into this row of shapes. So that i am retaining the skewed square as a mark and at the same time use the stronger dynamics you propose.   \n   \nDavid-- Why would i want to show motion? That is the concept i want to base this mark on, so of course its supposed to show motion not only in a digital media context, i.e. on the webpage where it is actually possible to animate the symbol, but also if it is printed and not actually moving.   \n   \nThe color orange? First of all it was/is a personal preference, but beyond that orange is considered a color that represents energy, enthusiasm, creativity, to name a few. So it is very appropriate imho.\n\n"
    },
    {
      "time": "20 Jul 2004 — 5:33am",
      "content": "Maybe I'm crazy...Probably....but in the context of this particular critique I saw a potentially strong idea. I respoded to the idea of the logo acutally being motionless in print, and then \"IN Motion\" on the web.(Motion in the since of changing colors in a rigid square to create the idea of motion) My favorite logo in this whole post was M's post #12 top left(except for the round corners).   \n   \nHypothetical situation: Say I recieved a letterhead from your company. On that letterhead was a square with 6(maybe 4) squares in it of different color shades. Next to that square (motionless square) logo it said \"rich media, motion graphics\" I would think to myself what does this motionless logo have to do with motion graphics, Hmmmmm. Then I would go to your website and see the 6(maybe 4) squares constantly changing color on the website... And then I would realize why the logo on the PRINTED Piece was unable to show motion because it was a frieze frame of the logo on the web.   \n   \nAh Hell, Maybe I'm nuts!\n\n"
    },
    {
      "time": "20 Jul 2004 — 5:40am",
      "content": "Sorry, correction, 9(maybe 4) squares\n\n"
    },
    {
      "time": "20 Jul 2004 — 4:10pm",
      "content": "Mr. Neumann,   \n   \nI was just posting that because it seemed you were brainstorming more dynamic effects for your logo. I thought i might douse some fluid on your creative fire. I can't wait to see what you come up with. Especially on the site. Exciting stuff!   \n   \nIn reponse to Goldstein: You're not nuts, just taking it too literally. We know the squares aren't moving intellectually, but optically illusions can be made to \"vibrate\" or show movement. I'm sure you already know this.\n\n"
    },
    {
      "time": "25 Jul 2004 — 3:28pm",
      "content": "Hi everybody,   \n   \ni have spent some days thinking about this design and how to improve on its weak points. Also thanks to your input that i value a lot.   \nI have been stuck with the screen symbol that on one hand carries some good ideas but also has its shortcomings. Main point in question is the impression of movement it conveys. I could not come up with any convincing solution to fix that lack of motion. I tried with Andrew's suggestion, but the breaking point was to create a mark that is not becoming too complex.   \nI am still all for the idea of animating a symbol on the web and want to stick with the use of visible pixels. However the mark also has to work for print use in a non-animated state, which turns out to be a problem.   \nFollowing these thoughts i decided to come up with more distinct shapes. Since previous pixel designs were already hinting to arrows, this is what i went with here.   \nThe right one is something that just happened when playing around and i found it looks interesting. The left one is the serious suggestion, which is easy to recognize as arrows. At the same time i have made changes to the type, as it seemed that with a small and light symbol it works better to combine the two words and distinguish them by font weight.   \n   \nPlease let me know how your impression is.   \n   \n   \n ![](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/41380.jpg)\n\n"
    },
    {
      "time": "26 Jul 2004 — 9:26am",
      "content": "I think that if this was your first post for this critique, I would be very impressed with the concept on the left. I like it. It works as static print and I can see a world of potential motion applications for interactive media (eg. previous/next buttons, animated arrows directing the user, etc.).   \n   \nHave you considered any alternative colors for the logotype (eg. cool gray 11, 534, 548)? We all know, how difficult it can become to use black and orange in an identity without crossing the Halloween line. You don't have that problem with the logo here, but it might become an issue with other applications.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "26 Jul 2004 — 10:37am",
      "content": "going with arrows is a good idea i think. Separating them reduces the speed though.   \n   \nPlaying around,   \n   \n ![](http://web.archive.org/web/20131023141930im_/http:/www.typophile.com/forums/messages/29/41440.jpg)\n\n"
    }
  ]
}
