{
  "id": "55286",
  "title": "Banksy",
  "forum": "Lizzy\\_Jo's blog",
  "tags": [

  ],
  "content": "I admit I don't really have a favorite designer, and since this assignment is to find a piece by your favorite designer and tell what's so special about him/her and their work, I started looking up different designers online and looking at some of their work. I came across the designer Banksy, a British street artist. He was one of the first designers I looked at, and the one that my mind kept going back to. I find his work to be very interesting, as much of it is done on sides of buildings. On his website, there's even some things that he did in New Orleans, which I think is what really made him stand out even more. My favorite works of art on the website are the ones of the rats on the sides of the buildings. They're really cute and I think the \"I love NY\" rat best depicts pet rats because they really are very sweet, loving, and intelligent animals. The \"I love NY\" rat just reminds me of my former pet rats, especially my first one, with a sweet, innocent, and playful look to it. I think Banksy's work is great and pretty original.\n\n[http://www.banksy.co.uk/](http://web.archive.org/web/20130629061747/http:/www.banksy.co.uk/ \"http://www.banksy.co.uk/\")\n\n",
  "author": "Lizzy_Jo",
  "time": "27 Feb 2009 — 12:25am",
  "uid": "41418",
  "comments": [
    {
      "time": "1 Mar 2009 — 7:20am",
      "content": "his one piece is on st.claude, a few blocks off of esplanade of a young  \ngirl under an umbrella that is raining on her...check it out, it's great  \nto see in \"real time\"...\n\n"
    },
    {
      "time": "1 Mar 2009 — 7:37am",
      "content": "It can be quite a good sign not having a fav designers.  \nAnd it seems you still don't - Banksy is an _artist_. :-)\n\nhhp\n\n"
    },
    {
      "time": "1 Mar 2009 — 7:57am",
      "content": "I think the book is freakin cool (\"Wall and Piece\").\n\nBtw if there are some Banksy experts here, can anyone confirm if this is original, or a rip-off?  \n [http://sehsucht.files.wordpress.com/2008/10/affe.jpg](http://web.archive.org/web/20130629061747/http:/sehsucht.files.wordpress.com/2008/10/affe.jpg \"http://sehsucht.files.wordpress.com/2008/10/affe.jpg\")  \nSpotted in Zurich. I'm not sure he actually did some work there; it also looks kind of badly executed, but it's definitely a Banksy motif (\"laugh now, but one day we'll be in charge\").\n\n"
    },
    {
      "time": "1 Mar 2009 — 6:39pm",
      "content": "Lizzy, this guy is cool. nice find.\n\n"
    }
  ]
}
