{
  "id": "55336",
  "title": "David Carson",
  "forum": "jkstrong's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20141111095115im_/http:/typophile.com/files/carson_4605.jpg)\n  \nDavid Carson was a school teacher and pro-surfer before be began his career as a Typographer. His first graphic design book, The End of Print, is the highest selling graphic design book of all time, selling over 200,000 copies and printed in 5 different languages. Carson pushes the limits on both graphic design and typography. He experiments in new ways of communication through his designs and uses a variety of different mediums. He is a very inspirational designer and continues to follow his intuition to drive his work. \n\nCheck him out at DavidCarsonDesign.com\n\n",
  "author": "jkstrong",
  "time": "28 Feb 2009 — 2:57pm",
  "uid": "41459",
  "comments": [
    {
      "time": "28 Feb 2009 — 3:44pm",
      "content": "David Carson is also in Scandinavia concidered as a most likely lecturer not to show up.  \nHe has a record of two decades of not showing up for his agreed appointment.\n\n"
    },
    {
      "time": "1 Mar 2009 — 7:27am",
      "content": "great one for typographic experimentation...maybe not a great one to invite as  \na guest lecturer!\n\nit might be cool to begin a bit of carson-esque type in your work and then  \nwe can talk all about the cool type by that inspirational designer j. strong!!\n\n"
    },
    {
      "time": "1 Mar 2009 — 7:45am",
      "content": "Tomi, now I feel less special: for the Thessaloniki conference of 2002 (or was it 2004?) Carson canceled, then rescheduled at the last minute, causing a $6000 first class ticket to be bought, then canceled again.\\* The good news is that Spiekermann and Brody did a superb job filling in - much more satisfying than when I saw Carson speak at... I think it was ATypI99 (where a gaggle of fawning wannabes lined up for an audience afterwards).\n\n\\* This type of behavior reinforces my view that on the Art--Design axis Carson is closer to the former. Design is essentially about _other people_.\n\nhhp\n\n"
    }
  ]
}
