{
  "id": "55427",
  "title": "Q: designing for non-profit organizations",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "for any designers that have donated work to a non-profit organization:\n\nwhat made you want to contribute?  \ndo you feel that your pro-bono work was at all self-motivated? in what way?\n\nthis is research for my thesis, many thanks!\n\n",
  "author": "channing ritter",
  "time": "2 Mar 2009 — 6:28pm",
  "uid": "18372",
  "comments": [
    {
      "time": "3 Mar 2009 — 10:57am",
      "content": "\\<\\< at all self-motivated? \\>\\>\n\nMy wife worked for a non-profit enviro organization. She wrote a series of booklets for them. That was my motivation for designing them and setting the type and managing the printing.\n\npowers\n\n"
    },
    {
      "time": "3 Mar 2009 — 2:43pm",
      "content": "I've done pro-bono work for a non-profit association/organization I'm a member of. Contributing in \"my way\", and thereby hopefully enhancing the perceived value of their publications/materials, does feel like a good thing to do; and I also really enjoy working with them. But I'm an up-starting self-employed designer, and I'd be lying if I didn't say a large part of my motivation to donate my time and work has been to get some cool work done where I'd have more \"deciding power\" / artistic licence than in a usual job, and thus get some references under my belt (and into my portfolio).\n\nI interned as an art director at a smallish ad agency a few years ago and they seemed to handle this in a similar way, FWIW: The few \"free\" jobs for friends or benevolent organizations were valued as occasions to really let loose and do some creative work without the pressures of a budget and most of all a nagging client. When you do pro-bono, clients just tend to be grateful.\n\n"
    },
    {
      "time": "3 Mar 2009 — 3:48pm",
      "content": "Most non-profits pay for design work like everyone else - a professionally designed begging letter will likely generate more income than you’d save by cajoling a grumpy designer into designing one for you for free.\n\nIs your research around people doing free work or specifically about people doing free work for non-profits?\n\n"
    },
    {
      "time": "9 Mar 2009 — 6:46am",
      "content": "@sii\n\nIts specifically about people doing free work for non-profits & what inspires them to contribute. Any ideas?\n\nMore and more, I'm finding out in my research that for many, the work is largely self-motivated. This is not necessarily a bad thing because, as @altaira noted, many young designers rely upon this kind of work as a portfolio builder. However, in the project I'm proposing... a group of designers would collaborate on a piece of design work meaning that no singular person really has ownership or creative control over it.\n\nI'm trying to figure out if designers are willing to contribute when the personal gain factor is altered significantly—one stands to gain a really unique and collaborative social experience, rather than the opportunity to have full creative control over a portfolio piece.\n\n"
    },
    {
      "time": "9 Mar 2009 — 7:48am",
      "content": "I did some work for a gallery associated with the school I graduated from. They opened in the museum district where my wife worked. The museums had a tendency to hire from another school that was in the same city. I thought it might help graduates who wanted placement. I was/am also transitioning into more book design and thought it might be an opportunity. My motivations were mixed.\n\n"
    }
  ]
}
