{
  "id": "55429",
  "title": "Q: successful online communities",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In your opinion, why are certain websites with user-generated content like Wikipedia and Twitter so successful (in terms of the number and frequency of people contributing)?\n\nWhat makes you want to get involved with these or other online communities?\n\nthanks for your help all : )\n\n",
  "author": "channing ritter",
  "time": "2 Mar 2009 — 6:38pm",
  "uid": "18372",
  "comments": [
    {
      "time": "2 Mar 2009 — 8:20pm",
      "content": "Any context with these questions? They are far too open ended/broad.\n\n"
    },
    {
      "time": "2 Mar 2009 — 9:24pm",
      "content": "\\>What makes you want to get involved with these or other online communities?\n\nWikipedia... Mostly vanity… people like to prove that they know more on a given subject than anyone else.\n\nTwitter... Overinflated sense of self importance.\n\nTypophile... Pure goodness. People here are just plain nice and helpful.\n\n"
    },
    {
      "time": "2 Mar 2009 — 9:37pm",
      "content": "Wikipedia isn't really a community, and Twitter isn't really successful yet.\n\nTypophile has been going for almost 9 years, and is  \na past and present treasure. The secret: something  \nrelevant to talk about, not just one's self!\n\nhhp\n\n"
    },
    {
      "time": "3 Mar 2009 — 8:49am",
      "content": "@Hrantus: _Wikipedia isn’t really a community_\n\nHrant isn't really a Wikipedian and lacks the insite granted by participation in Wikipedia's community at close range. Wikipedia the free online encyclopedia isn't a community, but Wikipedia's community of Wikipedians is certainly a community in every sense of the online world. We even have a Village Pump.\n\nj a m e s\n\n"
    },
    {
      "time": "3 Mar 2009 — 9:24am",
      "content": "<cite>Twitter... Overinflated sense of self importance. </cite>\n\nHurm…\n\n"
    },
    {
      "time": "3 Mar 2009 — 9:46am",
      "content": "Wikipedia and Twitter are both communities, but rarely would someone actually define them as 'community sites'.\n\nWikipedia is reference.  \nTwitter is what you make of it. I use it as more of a mini-blog/professional networking.\n\nIf you're asking what makes a community site successful, it's the community and the content created by said community.\n\n"
    },
    {
      "time": "9 Mar 2009 — 6:59am",
      "content": "Hey all,\n\nThe term \"online community\" seems to have sparked some controversy. Let me specify that my research is centering around websites with user-generated content.\n\nI'm trying to determine why users are drawn to some of these sites over others? Think about the UGC websites that you contribute to, and why you have chosen those particular ones. What is it about those sites that is so conducive to a community feeling, that keeps users coming back and contributing?\n\nThanks for all the feedback, its really helpful so far!\n\n"
    },
    {
      "time": "9 Mar 2009 — 9:57am",
      "content": "\"What is it about those sites that is so conducive to a community feeling\"\n\nA community.\n\nEVERYONE wants to build a community web site. But only those that establish a community from the get-go get anywhere. As such it's a bit of a catch-22 and often, more than anything, a bit of luck.\n\nFacebook took off because it was developed in an incubator of a defined and attentive audience...Harvard students.\n\nTwitter took off because it's a service, not necessarily a content repository. It's the service that is successful moreso than any of the content.\n\nI'd hazard a guess that Typophile, like many narrow-topic discussion boards, was successful due to having a topic of interest that wasn't being addressed in any other forum or web site.\n\n"
    },
    {
      "time": "9 Mar 2009 — 12:22pm",
      "content": "I have had two leads for business from Twitter. I seldom post but it has created some genuine business opportunities for me here.\n\nSharon\n\n"
    },
    {
      "time": "9 Mar 2009 — 12:41pm",
      "content": "One thing everyone is missing so far is the dedication of the moderators/administrators. It takes a large commitment to do something like that, I know because I have done both. If a board like this gets spam-riddled or overly aggressive people start dominating, then it is probably not going to succeed.\n\nSo thanks to all the mods and admins here for allowing a very free flowing train of thought and heading off train wrecks (sometimes). :)\n\npbc\n\nMy mind is subject to change without notice.\n\n"
    },
    {
      "time": "9 Mar 2009 — 3:10pm",
      "content": "@sii RT Twitter... Overinflated sense of self importance.\n\nisn't that just a re-tweet of what all the journalists have been saying (who have about as much audience as the average twitter user?)\n\n"
    },
    {
      "time": "9 Mar 2009 — 3:24pm",
      "content": "I'm wondering: is Twitter something one can use (and benefit from) casually, or does it require dedicated attention? What I mean is, is there a high threshold where it becomes actually useful, or it simply useful in proportion to the time spent on it? This might sound like a stupid question, but I really don't want to sign up to something that's going to be a psychological drag. I have one of those already. :-)\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2009 — 5:47pm",
      "content": "Your sentences are too long Hrant. For Twitter that is.\n\n"
    },
    {
      "time": "9 Mar 2009 — 6:17pm",
      "content": "Typophile is amazing. Some ingredients in its success:\n\n1. There are lots of folks, but not too many for a community: hundreds who look at it regularly, daily.\n\n2. You have to love type with a passion to want to frequent it. Even people who disagree about everything else know they are among the rare birds who share their love of type. Which engenders a certain, um, pure goodness.\n\n3. People who work on type and with type are in front of computers all day--and sometimes night--quite a few don't have colleagues around to talk with about their work.\n\n4. The most experienced and knowledgeable people in the field and novices--and everyone in between--post regularly. The mix keeps things fresh, lively and informative.\n\n5. And thanks to Joe, Jared, Christian, the moderators, who made it and keep it functional.\n\n"
    },
    {
      "time": "9 Mar 2009 — 8:43pm",
      "content": "\\>isn’t that just a re-tweet\n\nYes\n\n"
    },
    {
      "time": "9 Mar 2009 — 9:39pm",
      "content": "<cite>I’m wondering: is Twitter something one can use (and benefit from) casually, or does it require dedicated attention?</cite>\n\nThat entirely depends on how one uses it. For some people it’s a casual screwball chatroom. For others—particularly writers with thousands or tens-of-thousands of followers—it’s turning into an incredible new search tool. I think that Twitter will be like Friendster and MySpace—interesting, but a little too raw, and waiting to be replaced by the next generation of tech.\n\n"
    }
  ]
}
