{
  "id": "55439",
  "title": "Print shop doesn't like fonts",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Is it normal that a big print shop requires that all the texts have to be converted to outlines? (I mean that is their _standard_ 'policy')\n\n",
  "author": "daniele capo",
  "time": "3 Mar 2009 — 4:04am",
  "uid": "24678",
  "comments": [
    {
      "time": "3 Mar 2009 — 6:26am",
      "content": "They don’t want to read the EULAs and they don’t want to buy the fonts. They just want to RIP the job, print it, and go on to the next. This is how they put the responsibility on you to get it right. They also dislike making changes and sending proofs out, which delays their schedule.\n\nLook around at all your alternatives and find the shop that has the right presses, operators, and work flow for you.\n\n"
    },
    {
      "time": "3 Mar 2009 — 7:04am",
      "content": "Thanks, in the specific case the shop was chosen by my client : (\n\n"
    },
    {
      "time": "3 Mar 2009 — 7:53am",
      "content": "Check it carefully, convert it, and charge the client to redo the preflight if they come back with changes.\n\n"
    },
    {
      "time": "3 Mar 2009 — 9:07am",
      "content": "Sounds like one of those two guys with a digital press in a garage working on tiny margins shops. Just outline the type and let the client live with the results; this is what he gets for being a tightwad.\n\n"
    },
    {
      "time": "3 Mar 2009 — 10:58am",
      "content": "James, it is a relatively big print shop (relative to the place where I live), but the mentality is still that of “two guys with digital press etc.”, very common in Italy (and particularly in central Italy, I suspect I also share the same behaviour). Another printer months ago _rasterized_ everything before printing without even calling me, and then he tried to put the blame on me for the results.\n\n"
    },
    {
      "time": "3 Mar 2009 — 11:09am",
      "content": "Perhaps you could enlighten them to the PDF workflow.\n\n"
    },
    {
      "time": "5 Mar 2009 — 2:08pm",
      "content": "Probably what they did was to create a workflow where font issues are over! All is converted to outlines by the designer. They are saving big time on the operation, cause fonts issues suck.\n\nA side-effect to this practice is that the files will be way bigger then if the text was regular embed fonts on PDFs, costing more time and memory to convert files.\n\nTell them!\n\n"
    },
    {
      "time": "5 Mar 2009 — 2:22pm",
      "content": "I also think that the print quality would suffer at text sizes, as hints are out. Is this right?\n\n"
    },
    {
      "time": "5 Mar 2009 — 5:50pm",
      "content": "Hinting is irrelevant at 2,000+ dpi used with offset printing today. I'm assuming this is \"printing,\" not xerography. In fact, in the early PostScript days, I use to strip the hints out of fonts because they sometimes caused trouble. Type was output to repro paper at \"only\" 1,200 dpi. But that was a true 1,200, not tricked.\n\n"
    },
    {
      "time": "10 Mar 2009 — 11:45am",
      "content": "_Probably what they did was to create a workflow where font issues are over!_\n\nI think you are correct. I suppose the so-called workflow was created to avoid problems and be able to print ‘just-in-time’ with the lowest prices. The quality problems are the last thing to be considered in that context. I find the approach really depressing.\n\n"
    },
    {
      "time": "12 Mar 2009 — 10:38am",
      "content": "- - Forgive - -  \n —— O H ——  \n—Highest Sireness—  \n= for =  \nI h a v e  \n\\*S\\*E\\*E\\*N\\*\n\n"
    }
  ]
}
