{
  "id": "5543",
  "title": "Logo help - What do you see?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Just wondering if anyone can help me out with something I'm working on - what do you see here?   \n   \n ![What do you see?](http://web.archive.org/web/20131023141816im_/http:/www.typophile.com/forums/messages/29/40220.gif)   \n   \nIt's supposed to be a crown, and (this might be a stretch) the negative space is a figure hugging/embracing/supporting. Can you see it, or is it too ambiguous?   \n   \nThanks very much for any help!\n\n",
  "author": "2vpe",
  "time": "8 Jul 2004 — 1:05pm",
  "uid": "4133",
  "comments": [
    {
      "time": "8 Jul 2004 — 1:35pm",
      "content": "I can see the apple/crown without any problem, but the negative figure would've been impossible to see without your explanation.\n\n"
    },
    {
      "time": "8 Jul 2004 — 1:39pm",
      "content": "i saw the crown right away . . . i don't see the figure that you are referring to . . . (although looking for a figure, the purple aspects of the crown remind me of a sumo wrestler)\n\n"
    },
    {
      "time": "8 Jul 2004 — 1:59pm",
      "content": "The the circle of negative space is the head, the edges of the crown are outstretched arms.   \n   \nThe problem is the figure has no hands and the base of the crown obstructs the figures body.   \n   \nI see the crown well.   \n   \nAndrew\n\n"
    },
    {
      "time": "9 Jul 2004 — 12:10am",
      "content": "the crown is visible, but the apple is also quite strong. i think the stroke on top is too \"applish\" ... and actually what first appeared to me was something clerical. i see no kings crown but something different which i cannot name exactly. ![:-)](http://web.archive.org/web/20131023141816im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "9 Jul 2004 — 1:32am",
      "content": "I could see the figure if I leaned back and kind of unfocused a bit, like looking at a 3D picture.\n\n"
    },
    {
      "time": "9 Jul 2004 — 2:05am",
      "content": "At first I saw a pumpkin with a curved line underneath ... then I saw the crown ...   \n   \nIf the success of the mark relies on people seeing a person embracing something, you should find a new idea.   \n   \n--   \nS\n\n"
    },
    {
      "time": "9 Jul 2004 — 10:18am",
      "content": "I saw the crown right away. I didn't see the figure, and at first I thought you meant the \"apple\n\n"
    },
    {
      "time": "9 Jul 2004 — 1:07pm",
      "content": "Thanks everyone for lending your eyes! This forum is ever so helpful.   \n   \nI'm trying to come up with something Crown-like, but with some added significance to it. My hometown of Regina (named in honour of Queen Victoria) recently adopted a [new logo](http://web.archive.org/web/20131023141816/http:/www.regina.ca/) I don't think does the City justice, so here I am trying to come up with something more fitting - something that recalls the royal ties, and at the same time more colourful, lively and friendly than just using a crown on its own (which was the old logo).   \n   \nHere's another one I came up with:   \n   \n ![Crown 2](http://web.archive.org/web/20131023141816im_/http:/www.typophile.com/forums/messages/29/40273.gif)   \n   \nA crown for our historical Queen City-ness and to symbolise civic authority; people linked both in celebration and in support, the community reaching forward; purple for our Royal past, green for the City's growing and prosperous present, red for our warm and passionate outlook to the future, all firmly planted on the golden Prairie.   \n   \nAny thoughts on how to approach rendering a crown? Other Crown-like logos that might lead me somewhere? Thanks again!\n\n"
    },
    {
      "time": "9 Jul 2004 — 1:43pm",
      "content": "Hmm. Its colorful.   \n   \nBut it looks they are saluting the fuhrer.\n\n"
    },
    {
      "time": "9 Jul 2004 — 2:09pm",
      "content": "\"But it looks they are saluting the fuhrer.\"   \n   \nHa ha. That problem might be avoided by straightening out the little \"limp wrists\" on the red and purple figures.   \n   \nThis one has that \"non-profit\" look. I liked the style of the first one more, FWIW. That one just didn't get the job done, though.   \n   \nmaybe if the three figures were one smooth shape. you could make the heads one color, the bodies another and the bottom \"u\" shape the third.\n\n"
    }
  ]
}
