{
  "id": "55455",
  "title": "Foundry EULAs - 100 years ago",
  "forum": "Release",
  "tags": [

  ],
  "content": "In 1910, the German foundries D. Stempel AG, Gebr. Klingspor, Ludwig & Mayer and J. G. Schelter & Giesecke used the same EULAs or rather the same Terms and Conditions of Sale concerning hot-metal composition foundry type (which at that time was sold by weight or by bill of fount). Here are some examples of what was allowed and what was forbidden:\n\nWhat was allowed?\n\n1) It was allowed to use the foundry type to typeset letterpress texts and to print the typeset text directly by letterpress (relief printing).\n\n2) It was allowed to make stereotypes and electrotypes of the typeset text and to print the stereotyped and electrotyped typeset text by letterpress.\n\nWhat was forbidden?\n\n1) It was forbidden to make photographs as such of the typeset text.\n\n2) It was forbidden to make rubber stamps on the basis of the foundry type.\n\n3) It was forbidden to lend or rent the foundry type to other typesetters and printers.\n\n4) It was forbidden to use the foundry type (or rather the photographs of typeset text) for making printing plates for lithography (offset printing).\n\n5) It was forbidden to use the foundry type (or rather the photographs of typeset text) for making printing plates for intaglio printing (rotogravure).\n\nThe German text of these old EULAs is here:\n\n- [www.sanskritweb.net/forgers/eula-seite1.jpg](http://web.archive.org/web/20100203034015/http:/www.sanskritweb.net/forgers/eula-seite1.jpg \"www.sanskritweb.net/forgers/eula-seite1.jpg\")  \n- [www.sanskritweb.net/forgers/eula-seite2.jpg](http://web.archive.org/web/20100203034015/http:/www.sanskritweb.net/forgers/eula-seite2.jpg \"www.sanskritweb.net/forgers/eula-seite2.jpg\")\n\nIf today's EULAs would specify that it is allowed to use fonts for printing by ink-jet printing and that it is forbidden to use fonts for printing by laser printing, then such EULAs would be similar to the EULAs of 1910.\n\n",
  "author": "<a href=\"/web/20100203034015/http://typophile.com/user/11274\" title=\"View user profile.\">Uli</a>",
  "time": "<br>",
  "uid": "11274",
  "comments": [
    {
      "time": "",
      "content": "No restrictions for web use or pdf embedding, huh? Surprised.\n\n; )\n\n"
    },
    {
      "time": "",
      "content": "That's cool:\n\nYOU SHALL NOT PHOTOGRAPH !\n\n"
    }
  ]
}
