{
  "id": "55476",
  "title": "Protection against Mass Usage...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As I'm in the early days of learning and creating fonts I'd love some enlightenment on this area of font usage.\n\nI have seen recently some Major Toy Brands that have released their seasonal Style Guides.  \nFor those that don't know what a Style Guide is, it is normally a book with all the Character poses, Brand Logos, Colours and Legal details and Fonts to use. It's like a bible for a Brand, do's and don'ts and all the necessary artwork and direction for an individual Supplier or Graphic Designer to apply to a product. Brands sell products. If you have a plain watch and are up against my Branded watch instore, guess which walks out the store first!\n\nA lot of these Style Guides tell you to use, say Font X, and purchase it at MyFonts.  \nSo the supplier who for instance, has a contract to use the character or brand goes off individually and buys the font as a single purchaser from MyFonts.\n\nBut then the supplier releases his box toy to his designated market, with the font used on the box or toy. If the supplier to store, sells 10,000 or 20,000 units of the toy, what is the best Licensing Agreement word usage to cover oneself and let the Font Designer get a piece of the action of his or hers now mass produced and distributed font in usage?\n\nAnd now seeing the other side of Font Usage. I believe so many Font Designers may be ripped off by Brands having Fonts in their Style Guides that eventually point the Supplier to buy. The Brand Company knows there will be mass usage of the fonts they nominate for usage, but is the poor old Font Designer aware?\n\nAnd what wording in a Licensing Agreement is the best to catch this?\n\nCheers guys,  \nDrj\n\n",
  "author": "Dr jack",
  "time": "3 Mar 2009 — 7:41pm",
  "uid": "36432",
  "comments": [
    {
      "time": "3 Mar 2009 — 8:14pm",
      "content": "I'm not sure what the downside is on this for the type designer? Are you saying that they should include clauses in their EULA to limit the use of their fonts in packaging? Seems like they'd be shooting themselves in the foot?\n\nAlso a 10,000 to 20,000 print run seems like small potatoes. Fonts used in advertising may be printed billions of times over the course of a campaign.\n\n"
    },
    {
      "time": "3 Mar 2009 — 9:45pm",
      "content": "Si is right, Dr j.\n\nAnd if I understand your question correctly, you're saying that a typeface designer should be paid not by how many typefaces s/he licenses to others, but by how many times said typefaces are used/printed?\n\nP.S. As long as suppliers go to MyFonts and license a typeface, they are allowed to use the typeface... whether it will be used on a job that gets printed 100 times or 10,000 times. I believe stock photography houses have a system like the one you are talking about.\n\n"
    },
    {
      "time": "3 Mar 2009 — 9:48pm",
      "content": "You pay for the license.  \nYou buy the font.  \nWhat else do you want? For every unit  \nsold money should go the font designer?\n\nGuerrizmo+Design  \nNo man is an island unto himself\\_John Donne\n\n"
    },
    {
      "time": "3 Mar 2009 — 10:05pm",
      "content": "There are instances of enterprise licenses for exclusive use of certain fonts, based on the size of a company based on employees or income or another metric. Some may include allowing external use by contractors for package design or advertising. This may be more along the lines of your inquiry.\n\nI think the ancient logic behind the disallowance for copyright of fonts in the United States is based on a speculated scenario you describe. Font foundries would be able to claim royalties on each letter used by a typesetter, which would lead to suppression of the free press. It's an awkward argument, I admit.\n\n"
    },
    {
      "time": "3 Mar 2009 — 10:20pm",
      "content": "If you put a royalty clause like in a font EULA, two things will happen. First, you will lose sales when people read the EULA and assume that you’re a nut case. Second, people who do buy the font will just ignore the EULA because they know that most type designers don’t have the cash to pay a lawyer to file cease-and-desist, much less sue to enforce a EULA.\n\n"
    },
    {
      "time": "4 Mar 2009 — 11:27pm",
      "content": "I'm just saying that it seems such a sad, deep, chasm when I know someone has bought a font for individual use, and then there are Major companies splashing out minimum money for a font from MyFonts which will have millions of instances of use on a product, enhancing it and helping to sell that product.  \nI am aware of this.\n\nAs I progress through Font creation and Licensing, I will learn more about EULA's, the good ones and the bad ones. I understand the need also not to frighten off a sale by a ridiculous License. Catch 22.  \nI also know from Licensing, that the Licensing world wants us to think that way.\n\nIt's interesting the mindsets and set minds of some replies.  \nThank you for all replies.\n\nViva La Ripoff!!\n\n"
    },
    {
      "time": "5 Mar 2009 — 5:03am",
      "content": "IMHO House Industries are on the right track. They exclude certain commerical uses from their regular licence:\n\n<cite>A special license is required to use the House Font Software in logo design, with or in electronic books or games, goods for sale, retail packaging, signage or alphabet products such as scrapbook products or software, adhesive or rub on lettering, game playing or gaming devices irrespective of whether the Font Software itself is embedded into the device or if it is merely the designs of the Fonts embodied in the Font Software that are displayed. The terms of this Agreement are contractual in nature and not mere recitations.</cite>\n\nI feel that designers should benefit from commercial exploitation of their designs. Eg a commercial: agency, crew, networks, clients — all of these make plenty money and the guy who made the font used in the lettering gets less than 30 bucks? Not fair.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "5 Mar 2009 — 5:25am",
      "content": "James, what is the point of a EULA if a foundry is unwilling to enforce its terms? It would have no meaning and foundries would quit creating them altogether. And besides, there are more ways to enforce a EULA besides calling a lawyer. Depending on the breech, contacting the offending party and starting a conversation can work wonders.\n\n"
    },
    {
      "time": "5 Mar 2009 — 6:09am",
      "content": "Thanks for posting that, bert; I wasn't aware of HI's license. That certainly does sound like what you see in stock photography, where the license varies according to the intended use of an image. I suppose that if you have a set of quality display faces you can go the House Industries route. I'm not sure you could do that with text faces (but I could be wrong).\n\nIn response to what you and cuttlefish have posted, a few months ago I noticed that certain foundries on MyFonts have a price for home use (i.e., scrapbooking) and another price for professional use. Sadly, I can't remember any specific examples to link to right now! :-(\n\nAnd here's a similar example: I recently saw two versions of Microsoft Office for sale; one was for home use and one was for professional use, each one priced accordingly.\n\n"
    },
    {
      "time": "5 Mar 2009 — 7:55am",
      "content": "I think House is a special case, but they are not alone in having such carve outs. I wonder how successful they are at squeezing the extra payments out of their customers for the special licenses around rights that most other licenses provide as standard?\n\n"
    },
    {
      "time": "5 Mar 2009 — 9:15am",
      "content": "<cite>James, what is the point of a EULA if a foundry is unwilling to enforce its terms?</cite>\n\nUnwilling and unable are different things. Plenty of foundries would be willing if they had the deep pockets.\n\n<cite>It would have no meaning…</cite>\n\nEULAs have no meaning for many users. Probably even for most users. I have seen reports of font piracy rates by designers being as high as 50% in the USA, and 99% Eastern Europe and Asia—those people sure as hell aren’t worried about EULAs. And there is little reason to assume a EULA has much meaning in large design firms or in-house design departments whose purchases are handled by some non-designer for the sake of accounting practices. Given how many endless EULAs people click through without thinking these days—some Blu-Ray movies now have more than ten pages worth of EULA to access special features—I’m pretty sure that aside from knowing that they usually can’t use any font with non-Flash web embedding, most designers don’t have a clue what’s in font EULAs, nor do they care.\n\n"
    },
    {
      "time": "5 Mar 2009 — 9:41am",
      "content": "_... there is little reason to assume a EULA has much meaning in large design firms ..._\n\nOn the contrary, the larger a business is, the more likely it is to have institutionalized compliance, to keep its nose clean.  \nIt's a purchasing agent's job to make sure that software purchased is properly licensed.\n\n"
    },
    {
      "time": "5 Mar 2009 — 10:36am",
      "content": "@Nick: In theory those sort of policies exist. But in large organizations it’s very easy for things to slip through the cracks. In an old design firm that’s licensed thousands of fonts over the last twenty years it’s pretty easy to let things slip, newer employees might not even know such policies exist. And the bigger the client is, the more chances there are for someone to not have a clue; the biggest client I ever had, and international institution with an operating budget in the tens-of-billions, could not be convinced that they could not just buy one standard 5-computer license and redistribute the fonts however the employees wanted.\n\n"
    },
    {
      "time": "5 Mar 2009 — 11:02am",
      "content": "\\>the biggest client I ever had, and international institution with an operating budget in the tens-of-billions, could not be convinced that they could not just buy one standard 5-computer license and redistribute the fonts however the employees wanted.\n\n...my guess a letter from a good attorney would have changed this.\n\n"
    },
    {
      "time": "6 Mar 2009 — 6:31am",
      "content": "\\> Unwilling and unable are different things. Plenty of foundries would be willing if they had the deep pockets.\n\nI'll only say one last thing which is that you missed my point. You're assumption is that it takes money to enforce a EULA and that is simply untrue. I speak from experience on this. So, that a type designer's hands are completely tied because they don't have deep pockets is a myth. There are routes a foundry can take that require no cash, and if a lawyer does need to be called in, then it's probably worth the expense to do so.\n\n"
    },
    {
      "time": "6 Mar 2009 — 11:46pm",
      "content": "Nicole, I think it depends on how literally you take the word \"enforce.\" Taken literally, it requires legal or military action.\n\nI agree with you that well-handled personal communication can often work wonders. Whether this is worthwhile depends on the value placed on the person's time against the likely revenue and opportunity cost.\n\nFor the biggest foundries/vendors, there's also the question of whether the company structure even permits this approach by the business folks; in my Adobe days, such activity would have been pretty much forbidden for me or anybody else on my team. Legal and anti-piracy folks wouldn't want us going there.... Kinda funny.\n\nT\n\n"
    }
  ]
}
