{
  "id": "55486",
  "title": "Paris shopping typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone!\n\nAnyone here knows where in Paris I can find a good library to buy old type specimens books or other typography stuff?  \nThanks in advance\n\nAntónio\n\n",
  "author": "afonseca1974",
  "time": "4 Mar 2009 — 2:25am",
  "uid": "22399",
  "comments": [
    {
      "time": "4 Mar 2009 — 3:10am",
      "content": "This is more of a general suggestion: I highly recommend checking out the [bouquinistes](http://web.archive.org/web/20131021031250/http:/www.sitebits.com/2007/paris-bouquinistes.html)' book stands next to the Seine. They sell lots of old and out-of-print books – you might be able to find some type related stuff there as well. Last time I was in Paris, I found a gorgeous, out-of-print (afaik) book about embroidery alphabets there, and it was pretty cheap too.\n\n"
    },
    {
      "time": "4 Mar 2009 — 9:59am",
      "content": "I suspect the Imprimerie Nationale's bookstore is still there.  \nIf so, it should be your first stop. But after that, enjoy the city!\n\nhhp\n\n"
    },
    {
      "time": "4 Mar 2009 — 11:45pm",
      "content": "i am surprised to see the bord de seine's bouquinistes considered \"cheap\", though they are indeed a good source. for modern typographic stuff, you might also take a look at \"artazart\" on the canal saint martin (and plus, the area is very nice to stroll around), and the library at centre pompidou - lots of choice, but quite pricey. for the old typo books, i have no idea. i get mine from the net.\n\ndr\n\n"
    },
    {
      "time": "5 Mar 2009 — 1:20am",
      "content": "David, the few old/out-of-print books I have gotten from bouquinistes seemed reasonably priced. Dunno, I'd suspect the people who sell those books won't be equally savvy about all of the more specialized books they sell, and type, for one, might just be an obscure enough area to make for some good deals?\n\n"
    }
  ]
}
