{
  "id": "55517",
  "title": "Friends need help",
  "forum": "Design",
  "tags": [
    "Serif",
    "Design"
  ],
  "content": "Hello everybody,\n\nI had to create a logo for a local club called \"Friends' Club\" some time ago.  \nAs I was playing around with the logotype I had a sort of new look for a type.\n\n ![](http://web.archive.org/web/20150417193609im_/http:/typophile.com/files/friends1_5447.jpg)\n\nI have created the other letters and here they are.  \nI would like to know your opinion on it.\n\n ![](http://web.archive.org/web/20150417193609im_/http:/typophile.com/files/sample_4664.jpg)\n\nI would like to create the font and use it so before I go on I would like to know what you think.\n\nThe logo is here: [http://www.florin.reel.ro/folio/logos.html#friends](http://web.archive.org/web/20150417193609/http:/www.florin.reel.ro/folio/logos.html#friends)\n\nPlease comment/critique.\n\nThank you.\n\n",
  "author": "Florinf",
  "time": "4 Mar 2009 — 2:18pm",
  "uid": "9477",
  "comments": [
    {
      "time": "11 Apr 2010 — 1:08pm",
      "content": "Please comment.  \nThank you.\n\n"
    },
    {
      "time": "1 May 2010 — 8:12am",
      "content": "I think continuing this is a waste of Times.\n\n"
    },
    {
      "time": "1 May 2010 — 7:04pm",
      "content": "I think Artur is being a little harsh.\n\n"
    },
    {
      "time": "2 May 2010 — 11:53am",
      "content": "Artur is right.  \nIf you want to do some serious type design, modifying an existing font is not a good place to start.\n\n"
    },
    {
      "time": "2 May 2010 — 3:14pm",
      "content": "Florin, just do it!  \nNick, as I see it, it is not an existing font.  \n(I would like to change some letters, but that's different kettle of fish)\n\n"
    },
    {
      "time": "3 May 2010 — 3:32am",
      "content": "Janek, I think it is rather obvious that what we are looking at here is a modified version of Times.\n\n"
    },
    {
      "time": "3 May 2010 — 5:04am",
      "content": "Florinf, I hope you are trying to get to something that appears \"carefree\" and \"friendly.\"\n\nThe diagonals of the y, and perhaps the other l.c. diagonal features seem a bit light for the rest.\n\nPerhaps the k should be an alternate.\n\n\\>...to do some serious type design, modifying an existing font is not a good place to start.\n\nPerhaps Nick means \"to begin your education in doing some serious type design\" ? I've counted, and 96% of the serious type design I do begins with modifying an existing font. If I had to start digitizing from scratch every time, I'd be dead by now. It goes without saying that the vast majority of those modifications were to my fonts which might be the other thing Nick means.\n\nCheers!\n\n"
    },
    {
      "time": "3 May 2010 — 6:09am",
      "content": "Yes, it is clear that what we are looking at here is a modified version of Times.  \nI made some search and found several fonts looking similar to my favourite Frutiger. Take a look... (only commercial fonts)\n\n ![](http://web.archive.org/web/20150417193609im_/http:/typophile.com/files/frutiger_6130.PNG)\n  \nAs sure as shit some of them are modified versions of Frutiger, nay? \n"
    },
    {
      "time": "3 May 2010 — 6:53am",
      "content": "Haha are you serious?\n\n"
    },
    {
      "time": "3 May 2010 — 7:12am",
      "content": "Not in proper order: Frutiger roman, Gotham book, Free Set book, Museo Sans, Corbel, Informa pro, Raldo, Enzyme, Deja Rip, Prop Ten, Truth FB.\n\n"
    },
    {
      "time": "3 May 2010 — 7:56am",
      "content": "\\>As sure as shit some of them are modified versions of Frutiger, nay?\n\nDo all \\_\\_\\_\\_\\_\\_\\_ people look alike to you too? (fill in the blank with any ethnicity).\n\nCheers!\n\n"
    },
    {
      "time": "3 May 2010 — 10:12am",
      "content": "If you want to modify a font...go for it! But...don't sell it a brand new font either. Sure, a lot of people try to recreate parts of fonts...and they end up EXACTLY like one they were modifying. It's annoying and stupid. You can start with a basic font, like Helvetica...or something similar to what you are going for. But, have a plan. The current font you have brought forth....is just a change to an existing font. It looks like you sat down and said \"I want to change Times.\" Ok...well, you changed it! But, was there a purpose in changing it, or not? From what I'm seeing...there was no purpose to changing. That to me is the difference. Change with a purpose is cool because you can explain what you changed and why you changed it. Change for the sake of change...is just an experiment. Experiments aren't bad, but they should never be sold, or passed off as anything but a small change to an existing font.\n\n"
    },
    {
      "time": "3 May 2010 — 12:30pm",
      "content": "Janek: _As sure as shit some of them are modified versions of Frutiger, nay?_\n\nI very much doubt any of them were made by opening up the Frutiger fonts in a font editing application and modifying the BCP paths. Not only is that illegal, it is not something a professional type designer would want to get caught doing.\n\nDavid: _I've counted, and 96% of the serious type design I do begins with modifying an existing_ [my] _font..._\n\nI do that too, though not quite so much.\n\nWhat I mean is what I said; if you want to do some serious type design, don't start by transforming someone else's font files.  \nThis is a pedagogic principle; it's like, do life drawing rather than tracing over photos.  \nThe habits you start with form semantic grooves that inform your work, just as the school you go to and the companies you start working for color your subsequent career.\n\nI don't deny that there are skills to be acquired in cut-and-paste and morph and tweak &c., but learning how to construct a font from scratch is the most solid foundation. It especially gives you a grasp of the underlying mechanics of a font: vertical metrics, stem widths, sidebearings, overshoot, &c.\n\n"
    },
    {
      "time": "3 May 2010 — 1:48pm",
      "content": "Nick et al: Did You spot the sarcasm sign?  \n\"I very much doubt any of them were made by opening up the Frutiger fonts in a font editing application and modifying the BCP paths.\"  \nThat's all clear.  \nFlorinf's decorative fonts are definitely made from scratch, you know.\n\n"
    },
    {
      "time": "4 May 2010 — 6:16am",
      "content": "Thank you all for such a long debate.  \nActually I didn't expected to get a reply after more than a year since posting.\n\nAs I mentioned, I had to do a logo (in 2001) and wrote the name of that club.  \nI wasn't satisfied with it and did some adjustments to the letters.  \nEverything was fine and the logo was approved and maybe the year after, I thought it would be nice to have a font like that.\n\nI took Times, indeed, and modified the letters in CorelDraw and then exported them as a font. It's a font since then, but I never sold it, or offered it for free, so it's more like a set o letters in an image. Never used it again.\n\nAs I did it long time ago, I forgot how things started and developed, but it's my mistake, I should have mentioned it was based on Times.\n\n"
    },
    {
      "time": "4 May 2010 — 9:55am",
      "content": "_Florinf's decorative fonts are definitely made from scratch, you know._\n\nWhat made you think that?\n\n"
    }
  ]
}
