{
  "id": "55528",
  "title": "2 serif faces",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Dear typophiles,  \nHere are two serif faces that came out of my calligraphy study with Edward Johnston's writing manual. The first type is based on his \"simple-written\" method and the 2nd on the \"gothic\" variation of the \"built-up\" method.\n\nThese are intended to be used for continuous text (~8-12 pt) printed on paper.\n\nAll comments welcome.\n\n ![](http://web.archive.org/web/20150418202655im_/http:/typophile.com/files/simple-written_built-up_3803.png)\n\n ![](http://web.archive.org/web/20150418202655im_/http:/typophile.com/files/simple-written_5727.png)\n\n ![](http://web.archive.org/web/20150418202655im_/http:/typophile.com/files/built-up_6459.png)\n\n| Attachment | Size |\n| --- | --- |\n| [2009march19th-simple-written&built-up.pdf](http://web.archive.org/web/20150418202655/http:/typophile.com/files/2009march19th-simple-written&built-up.pdf) | 103.18 KB |\n\n",
  "author": "juhani",
  "time": "4 Mar 2009 — 8:30pm",
  "uid": "19089",
  "comments": [
    {
      "time": "5 Mar 2009 — 10:59am",
      "content": "I love them both. :)\n\n"
    },
    {
      "time": "5 Mar 2009 — 12:52pm",
      "content": "_ **Quincunx:**\"Although the examples you mention seem to be leaning to the right instead of the left. But I guess that is a matter of choice.\"_\n\nAs you can see in the first typeface of the sample, the counter of the O, the Q, the o and other letters leans to the left noticeably. And, yes: it's a matter of choice. ;-)\n\n**MarS**\n\n"
    },
    {
      "time": "5 Mar 2009 — 1:37pm",
      "content": "@Marcelo, yes, I noticed too. But I think the leaning is a bit more apparent in your design. :)\n\n@juhani, talking about the top image, the C, D, G, O, Q, and S are too heavy.\n\n"
    },
    {
      "time": "6 Mar 2009 — 8:02am",
      "content": "@juhani; by the way, what manual did you use? From a book like 'Writing & Illuminating & Lettering', 'Lessons in Formal Writing' or another one?\n\n"
    },
    {
      "time": "6 Mar 2009 — 9:44am",
      "content": "I'll check the heavier weights and the leaning counters. Both are unintentional. Although regarding the counters, overall balance is what I'm looking for. The 'o' has been tricky. The angularity & asymmetry can get a bit glaring, especially in small sizes.\n\nI've used the 2 books you mention. I didn't use a turkey quill, though.\n\nThanks for your comments.\n\n"
    },
    {
      "time": "19 Mar 2009 — 6:04am",
      "content": " ![](http://web.archive.org/web/20150418202655im_/http:/typophile.com/files/simplecapslighterstraighter_5413.png)\n\nA bit lighter, straighter & simpler round caps, I hope.\n\nI attached a PDF of the two types if someone would like to comment on a printed result.\n\n"
    },
    {
      "time": "19 Mar 2009 — 9:12am",
      "content": "Maybe bring in the bottom serif or lengthen the crossbar of 'T'? It looks a little too close to 'I' in the running text. 'C', 'G' and 'S' look a bit like they are dripping from their top terminals!\n\n'K' and 'Z' are the handsomest letters to my eyes. (Maybe 'K' could be a touch wider.)\n\n"
    },
    {
      "time": "2 Apr 2009 — 4:42pm",
      "content": "Thanks for your feedback, eliason.\n\nI added 20 units to the T-crossbar width (& took out 10 from the bottom serif). I don't know if that makes any difference...maybe the crossbar should be thicker as well.\n\n ![](http://web.archive.org/web/20150418202655im_/http:/typophile.com/files/simpleforexample_3521.png)\n\n&nbsp;\n\nYes, the C G & S terminals don't look like what they're supposed to. Perhaps the edge-stroke terminals are impossible (too ridiculous) to bring into type. I'm generally worried about doing a too literal calligraphy imitation anyway. On the other hand, I sort of like the 'drips' because they have a likeness to the thin baseline serifs in the lowercase. Here's a variation & without:\n\n ![](http://web.archive.org/web/20150418202655im_/http:/typophile.com/files/congos_6045.png)\n\n&nbsp;\n\nI did some numbers too:\n\n ![](http://web.archive.org/web/20150418202655im_/http:/typophile.com/files/simplenumbers_6291.png)\n\n"
    },
    {
      "time": "2 Apr 2009 — 8:24pm",
      "content": "Did you try a serif going the other way - up and to the right, away from the counter - at the top of C/G/S?\n\nFix to the T looks good, and those numbers/punctuation are very nice. (8 may be topheavy.)\n\n"
    },
    {
      "time": "3 Apr 2009 — 1:59pm",
      "content": "Really lovely. I cannot help but to love this style. I have a soft spot for the books printed at the turn of the last century. This would suit those nicely I would think.\n\nAnd I handpicked this thread to go to the front page. :^)\n\n"
    },
    {
      "time": "3 Apr 2009 — 3:38pm",
      "content": "I just want to say that you’ve inspired me to dig those books out and read them.\n\n"
    },
    {
      "time": "4 Apr 2009 — 7:07am",
      "content": "\\> _I just want to say that you’ve inspired me to dig those books out and read them._\n\nSame here, although I don't have them, so I have to get them first. ;)\n\n"
    }
  ]
}
