{
  "id": "55539",
  "title": "Mrs Eaves in Identity Design",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I've created the logo and identity for Lorri C. - A high fashion design & dress making business.\n\nIt's the first time I've used Mrs Eaves as a typeface so I wanted some clarifications on the usage:\n\nOn the business card, I've used Mrs Eaves Small Caps for most of the text (except Roman for one line) however it seems the numbers are a lot smaller than the rest of the letters and the brackets a lot bigger, I've had to make the brackets two point sizes smaller. Is this what I should be doing?\n\nAlso when is the right time to use petite caps? And I wish there was a bold small caps :(\n\nIn general, any feedback would also be appreciated. It's my first post on here but I want as much criticism as I can get so don't hold back.\n\nThanks in advance.\n\nJacob\n\n| Attachment | Size |\n| --- | --- |\n| [lorri-c-letterhead.pdf](http://web.archive.org/web/20131020193032/http:/typophile.com/files/lorri-c-letterhead.pdf) | 71.41 KB |\n| [lorri-c-businesscard.jpg](http://web.archive.org/web/20131020193032/http:/typophile.com/files/lorri-c-businesscard.jpg) | 272.17 KB |\n\n",
  "author": "JustCreativeDesign",
  "time": "5 Mar 2009 — 4:23am",
  "uid": "42798",
  "comments": [
    {
      "time": "5 Mar 2009 — 7:08am",
      "content": "Hi\n\nI learnt most of the design basics from you :)\n\nlove da LC logo..... good luck\n\nSana\n\n"
    },
    {
      "time": "5 Mar 2009 — 9:31am",
      "content": "<cite>Also when is the right time to use petite caps?</cite>\n\nFor abbreviations in running copy or to establish a hierarchy.\n\n• It feels more like haughty clothes for older women than creative couture. This is a combination of the monogram, only using a single color, type choices, and overuse of caps all combining into something stuffy.  \n• The use of bullets in ”• LORRI • C“ feels unbalanced within your compositions.  \n• The connection between the letters in the monogram looks bad and is not necessary. If you really want letters like this to connect in that way, draw them.  \n• “High Fashion and Dressmaking”, not “high fashion & dressmaking”. You’re resorting to gimmickry with the ampersand and all-lowercase. That makes the script, the small caps, and the monogram feel like gimmicks as well.  \n• Go easy on the small caps. They don’t harmonize well with the figures the LORRIC set in caps all over the place gets monotonous.\n\n"
    },
    {
      "time": "5 Mar 2009 — 1:22pm",
      "content": "\\> It feels more like haughty clothes for older women than creative couture.\n\nIt feels more like a wedding consultant or a wedding cake maker to me. Excessive cursive is pretty much a de facto cliche standard for this sort of a business.\n\n"
    }
  ]
}
