{
  "id": "55561",
  "title": "online font viewer",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I recently launched an online font viewer application [www.myfontbook.com](http://web.archive.org/web/20131021025957/http:/www.myfontbook.com/ \"www.myfontbook.com\") and I am interested in feedback from the design community. All ideas and criticisms are welcome.\n\n[http://www.myfontbook.com](http://web.archive.org/web/20131021025957/http:/www.myfontbook.com/)\n\nThanks,\n\nJeremy\n\n",
  "author": "tjeremyt",
  "time": "5 Mar 2009 — 1:44pm",
  "uid": "42811",
  "comments": [
    {
      "time": "5 Mar 2009 — 2:07pm",
      "content": "Won’t most people who have enough fonts for this to be useful already be running font management app that does everything your viewer does?\n\n"
    },
    {
      "time": "5 Mar 2009 — 3:06pm",
      "content": "James, you make a good point. Certainly the users of this forum would likely have such a tool installed. Which is why I hope to solicit some feedback from such power users.\n\nThough from my informal survey of colleagues, there are plenty of designers who have not licensed a font management application and might appreciate a free alternative. I think that a web-based version has the potential to offer some community resources and statistics that are uncommon in standalone applications. Thanks for the comment, James.\n\nAny other feedback?\n\n"
    },
    {
      "time": "6 Mar 2009 — 2:38am",
      "content": "Just tried it. Works stunningly fast. The purpose could be for people who work on different machines to gather the views of their fonts, to choose from. (If the samples are saved. Are they? Couldn’t verify it by now).\n\nFor some reasons my Museo-fonts aren’t displayed correctly. They appear as TNR …?!?\n\n ![](http://web.archive.org/web/20131021025957im_/http:/typophile.com/files/Museo_4028.png)\n  \nAlso if you have created a lot of tags the fontinfo panel below goes down and can’t be seen again.\n\nAnd I would like to have an option to select more than one font to tag. So it is a bit troublesome to select each weight and tag it.\n\n"
    },
    {
      "time": "6 Mar 2009 — 5:58am",
      "content": "Renko, Thanks for the feedback.\n\nThe application will store your fonts and settings from separate computers into your catalog, but will only display those fonts which are installed on your current system. As of this writing it will not render fonts that are not installed, in short because that would require an enormous library of font files on the server.\n\nI am aware of the tag window sizing issue and a fix should be online within a few days.\n\nGreat idea on selecting more than one font. I'll look into the Museo rendering.\n\n"
    }
  ]
}
