{
  "id": "55563",
  "title": "affordable fonts for students?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello There!\n\nI am a student and I was wondering if anyone knows of any good affordable font packages? Or perhaps an option to buy 1 font instead of the whole set? Just have a limited budget and I'm really getting bored of what I have and the free fonts are starting to disgust me.  \nAlso does anyone have this book? [http://www.fontshop.com/products/fontbook/](http://web.archive.org/web/20131020164730/http:/www.fontshop.com/products/fontbook/ \"http://www.fontshop.com/products/fontbook/\")  \nIs it useful? I so want it. It looks like it could be very helpful!!  \nI am drooling... mmmmm.......fontbook....\n\n",
  "author": "peachey",
  "time": "5 Mar 2009 — 3:22pm",
  "uid": "38785",
  "comments": [
    {
      "time": "5 Mar 2009 — 3:36pm",
      "content": "<cite>…good affordable font packages…</cite>\n\nMuseo/Museo Sans are quite affordable.\n\nWatch eBay for old copies of Corel Draw, which comes with 1000+ Bitstream/ITC fonts. Prices run from $50 to $500 depending on what version is selling and how many copies are available. Or drop $1500 at once to get the complete Bitstream Type Odyssey 2 which will get you through school and well into your professional career.\n\n<cite>…fontbook…</cite>\n\nIf you can’t afford fonts, there’s really no reason to buy a $100 font catalog.\n\n"
    },
    {
      "time": "5 Mar 2009 — 4:44pm",
      "content": "awesome! thanks! that helps. I've been looking around with no luck.  \nThat's the thing, fontbook is expensive. but it's kinda just like window shopping. I'm still a student and I want to feed my head with all that is out there. Just looking at type gets me all excited!! and if I like it enough I'll start saving up so I can eventually buy it.\n\n"
    },
    {
      "time": "5 Mar 2009 — 4:46pm",
      "content": "[font starter packs](http://web.archive.org/web/20131020164730/http:/typophile.com/wiki/font%20starter%20packs)\n\n"
    },
    {
      "time": "5 Mar 2009 — 4:50pm",
      "content": "@james are the fonts bundled with corel draw bitstream fonts? i know that there were some collections of bistream, letraset, urw++ fonts that came bundled with word perfect 8 and am curious to know if it's the same set...\n\n"
    },
    {
      "time": "5 Mar 2009 — 5:25pm",
      "content": "@Paul: CorelDRAW bundles a mix which is mostly Bitstream and URW++, so I think it's probably the same set.\n\n@Peachey: When I was at Adobe, we partnered with AIGA to assemble a new education collection of 500 fonts from 25 families, here: [http://www.adobe.com/education/products/fontfolioeducationessentials/](http://web.archive.org/web/20131020164730/http:/www.adobe.com/education/products/fontfolioeducationessentials/ \"http://www.adobe.com/education/products/fontfolioeducationessentials/\")\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "5 Mar 2009 — 7:30pm",
      "content": "Peachey: As a student, if you have a valid student ID you can buy CorelDraw dirt cheap. Like $100 ish. Go for it. Also, go get the pack that Mr. Phinney recommends. Were I a student, I'd buy it.\n\nThat'll give you a more than ample set of fonts to work with.\n\n"
    },
    {
      "time": "6 Mar 2009 — 1:21am",
      "content": "Thomas, thanks for posting the link to the Adobe education collection – looks quite interesting indeed! So is this meant for non-profit, educational work only, or does it come with the full licence so the fonts can also legally be used commercially? (I'm one of those people with a student ID who do paid work so I'm wondering.)\n\n"
    },
    {
      "time": "6 Mar 2009 — 2:32am",
      "content": "When You're a student it might also be a good idea to make a bit of an investment and buy Adobe Creative Suite, which costs quite a lot less when you're a student, brings you all the top design software you need (Illustrator, Photoshop, Indesign, Flash etc.) and comes bundled with a very good set of professional fonts to get you going.\n\ncheerio Queneau\n\n"
    },
    {
      "time": "7 Mar 2009 — 12:10am",
      "content": "@Altaira: All of Adobe's educational software licenses contain no restrictions on what you can do with the software above those placed on regular retail licensees, just more restrictions on who can license it. You can use it for commercial work while you're a student (or afterwards) as you wish.\n\nOf course, I'm not a lawyer, this is not legal advice, and they could have changed things when I wasn't looking, and you should certainly examine the license yourself prior to purchasing, and similar disclaimers.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "9 Mar 2009 — 2:52am",
      "content": "I actually priced my 2491 font low just to get it in many hands. My students tend to use it a lot for stuff, which sort of throws me. But it's only 5 bucks.\n\n[http://new.myfonts.com/fonts/steve-mehallo/twenty-four-ninety-one/](http://web.archive.org/web/20131020164730/http:/new.myfonts.com/fonts/steve-mehallo/twenty-four-ninety-one/)\n\nBut do watch for any Bitstream bundles out there - I got a batch with an old Mac Clone I bought many years ago and the (well-drawn) package is still incredibly useful today.\n\n"
    },
    {
      "time": "9 Mar 2009 — 4:00am",
      "content": "also, if you like type specimen books, check out the Indie Fonts series, they are a little more affordable to start with than FontBook, plus come with fonts on cd.\n\n[http://www.p22.com/indiefonts/](http://web.archive.org/web/20131020164730/http:/www.p22.com/indiefonts/ \"http://www.p22.com/indiefonts/\")\n\n"
    },
    {
      "time": "9 Mar 2009 — 6:56am",
      "content": "Maybe Thomas can clarify, but one issue with Macromedia Student purchases was that (IIRC) the software was not eligible for upgrades.\n\nNot that Macromedia was really upgrading anything near the end anyways.\n\nI assume Adobe's policies trumped Macromedia's after the take-over.\n\n"
    },
    {
      "time": "9 Mar 2009 — 9:45am",
      "content": "<cite>@james are the fonts bundled with corel draw bitstream fonts</cite>\n\nI think some of the postscript ITC fonts in Corel draw are not the Bitstream versions; I don’t know enough about the ownership history of ITC to theorize as to exactly where they came from.\n\n"
    },
    {
      "time": "9 Mar 2009 — 1:02pm",
      "content": "No exactly an answer to the question but...\n\nI remember at the TypeCon in Boston there were some break out sessions during the Educational forum which preceded the conference.\n\nOne such session was about creating low-priced font packs for students and teachers to use. Of the five or six people at the session four were from foundries. Only two instructors bothered to come by, and if I remember correctly they had very little to contribute. There was clearly an interest on the part of the type makers to create something of value for students, but I guess we were the only ones interested.\n\n"
    },
    {
      "time": "9 Mar 2009 — 1:54pm",
      "content": "One resource ALWAYS overlooked is the TeX packages. Utopia, Charter, a handful of URW typefaces that are great, if of questionable authority. For example, U001 is a URW typeface that was released publicly. But U001 is Univers, and Univers ain't supposed to be released publicly. Linotype's loss, I guess.\n\n"
    },
    {
      "time": "9 Mar 2009 — 2:25pm",
      "content": "Also, forgot about these (even though I have some fonts in them! Duh.)\n\nAscender's Font Marketplace is sort of based on what Monotype used to do (in the 1990s) with their discount font packages. They have packages and single user-based pricing:\n\n[http://www.fontmarketplace.com](http://web.archive.org/web/20131020164730/http:/www.fontmarketplace.com/ \"http://www.fontmarketplace.com\")\n\nFont Packs:\n\n[http://www.fontmarketplace.com/store/search.aspx?q=font+pack](http://web.archive.org/web/20131020164730/http:/www.fontmarketplace.com/store/search.aspx?q=font+pack \"http://www.fontmarketplace.com/store/search.aspx?q=font+pack\")\n\nAlso, when I started out (after school) I simply started purchasing a few specific packages that I'd save up for and end up using over and over again. At the time, Adobe Caslon became my mainstay. And eventually client work ended up paying for my investment up front. Ask yourself, what fonts would really last a lifetime?\n\n(And unfortunately, Monotype's Columbus package didn't; but their marketing really did suck me in. I will find a use for it someday!) :)\n\n"
    },
    {
      "time": "9 Mar 2009 — 3:03pm",
      "content": "You should look for some used fonts! Much better than buying new ones.\n\n"
    },
    {
      "time": "9 Mar 2009 — 7:02pm",
      "content": "URW's typefaces are not of questionable authority.\n\nIn the early days of font digitizing URW was one of the only digitizing games in town. It offered two price structures. The lower price delivered the digital data to the original company, but allowed URW the right to use the digital data.The more expensive option was to deliver the digital data to the source company with no reuse rights. Most companies chose the less expensive option which is why URW markets look-alike fonts under different names. All perfectly legal.\n\nAnd their Nimbus Sans Novus is the best digital Helvetica around.\n\nWhen I was still doing graphic design n the early 90s I advised all my clients to buy URW's Fontworks CDs to get themselves a high quality digital library at a reasonable cost.\n\n"
    },
    {
      "time": "10 Mar 2009 — 4:52am",
      "content": "is this really still the case regarding helvetica?\n\nand are urw still a good bet, after all these years?\n\nhow have they handled the transition to opentype?\n\n"
    },
    {
      "time": "10 Mar 2009 — 5:45am",
      "content": "MinionPro is probably on your computer already. Have you tried working with it?\n\n"
    },
    {
      "time": "10 Mar 2009 — 6:36am",
      "content": "terminaldesign:\n\n\\> I advised all my clients to buy URW’s Fontworks CDs\n\n\"Fontworks\" never existed :-)\n\nAt Ebay, someone offers Typeworks\n\n[http://cgi.ebay.de/URW-TypeWorks-1-2-3000-Type1-Fonts-kom-Vollvers-Win\\_W...](http://web.archive.org/web/20131020164730/http:/cgi.ebay.de/URW-TypeWorks-1-2-3000-Type1-Fonts-kom-Vollvers-Win_W0QQitemZ380097056824 \"http://cgi.ebay.de/URW-TypeWorks-1-2-3000-Type1-Fonts-kom-Vollvers-Win\\_W0QQitemZ380097056824\")\n\nat a price higher than the original price more than 15 years ago.\n\nAnd the seller copied and pasted the description from my website :-)\n\n"
    },
    {
      "time": "10 Mar 2009 — 8:28am",
      "content": "Dan...what are the TeX packages?\n\n"
    },
    {
      "time": "10 Mar 2009 — 8:29am",
      "content": "Typeworks, Fontworks, it was a long time ago. I licensed volumes 1 and 2 as well as something URW called Designworks.\n\nAll were very worthwhile. As to how URW has kept up with OpenType, I have no idea.\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:58am",
      "content": "@aluminum  \n [http://www.tug.org/fonts/](http://web.archive.org/web/20131020164730/http:/www.tug.org/fonts/ \"http://www.tug.org/fonts/\") to start. There is another resource that I'm thinking about, where the before mentioned U001.pfa and U001.pfm reside, but it's going to take a minute to find.\n\n"
    },
    {
      "time": "10 Mar 2009 — 10:08am",
      "content": "@aluminum  \nHere we go. The ghostscript fonts are the ones you want.  \n [http://ctan.org/tex-archive/fonts/](http://web.archive.org/web/20131020164730/http:/ctan.org/tex-archive/fonts/ \"http://ctan.org/tex-archive/fonts/\")  \n [http://ctan.org/tex-archive/nonfree/fonts/](http://web.archive.org/web/20131020164730/http:/ctan.org/tex-archive/nonfree/fonts/ \"http://ctan.org/tex-archive/nonfree/fonts/\")  \n [http://ctan.org/tex-archive/nonfree/support/ghostscript/AFPL/GhostPCL/](http://web.archive.org/web/20131020164730/http:/ctan.org/tex-archive/nonfree/support/ghostscript/AFPL/GhostPCL/ \"http://ctan.org/tex-archive/nonfree/support/ghostscript/AFPL/GhostPCL/\")\n\n"
    },
    {
      "time": "10 Mar 2009 — 10:59am",
      "content": "Thomas: Thanks for the info! That's good to know. I've asked back with Adobe (also because I couldn't find this in the European Education Store) but haven't heard back yet.\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:06pm",
      "content": "in regard to the Font Foilo Education Essentials package, Adobe Australia avised me it is not available outside the US, so they suggested just asking a friend in the US to buy it and send it to me, apparently that's ok.\n\nweird.\n\nso, that's what i am in the process of doing.\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:12pm",
      "content": "Huh, Simon, that is weird. So did they accept your study ID? I assume it's not American.\n\nBtw I like \"Font Foilo\". :-\\>\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:51pm",
      "content": "heehee, oops...\n\nand I'm still trying to sort it out, I have an American friend willing to help, we just need to sort out the details.\n\nyeah, when the aussie adobe rep said to just ask a friend in america to get it, i said 'are you sure that's legal and ok? adn she said, yeah, it's the best way'. so yeah...\n\nbut if enough of us ask, maybe Adobe will make the store international!?!\n\n:-)\n\n"
    },
    {
      "time": "25 Jun 2010 — 2:24pm",
      "content": "re: the CorelDraw Fonts\n\nAre the fonts still usable/ licensed if we dont' install CorelDraw on our computers?\n\n"
    },
    {
      "time": "25 Jun 2010 — 2:30pm",
      "content": "_Are the fonts still usable/ licensed if we dont' install CorelDraw on our computers?_\n\nAs long as the version of CorelDraw you have is licensable (i.e., not a pirated version), the fonts come as part of the package.\n\n"
    },
    {
      "time": "25 Jun 2010 — 2:36pm",
      "content": "Yves Peters, on the [FontFeed](http://web.archive.org/web/20131020164730/http:/fontfeed.com/archives/free-fonts-free-is-not-always-free/), has just argued to the contrary, that \"bundled fonts may only be used as long as the product (and version!) they’re bundled with is installed.\"\n\n"
    },
    {
      "time": "25 Jun 2010 — 3:12pm",
      "content": "_bundled fonts may only be used as long as the product (and version!) they’re bundled with is installed_\n\nDoes this apply to shrink-wrap licenses? Also, I can find nothing in the three CorelDraw manuals I have mentioning the installation requirement.\n\n"
    },
    {
      "time": "25 Jun 2010 — 5:23pm",
      "content": "Yves is very authoritative, but still fallible, and so, even, is David Lemon.\n\nI think there's a misunderstanding here. _Some_ fonts are restricted by Adobe's EULA for use with the app; see:\n\n[http://www.adobe.com/type/browser/legal/restricted\\_fonts.html](http://web.archive.org/web/20131020164730/http:/www.adobe.com/type/browser/legal/restricted_fonts.html \"http://www.adobe.com/type/browser/legal/restricted\\_fonts.html\")\n\nThese are governed by clause 16.4.6 in the EULA (I'm citing the one for InD CS5, and I quote some other clauses in the font section, because the modification and embedding rights in the Adobe EULA are notably liberal.)\n\n<cite>16.4 Font Software. If the Software includes font software:<br>\n16.4.1 You may use the font software with the Software on Computers as described in Section 2 and output the font software to any output device(s) connected to such Computer(s).<br>\n...<br>\n16.4.4 You may convert the font software into another format and install it for use in other environments, subject to the following conditions: A Computer on which the converted font software is used or installed will be considered as one of your Permitted Number of Computers. Use of the font software you have converted will be pursuant to all the terms and conditions of this agreement. Such converted font software may be used only for your own customary internal business or personal use and may not be distributed or transferred for any purpose, except in accordance with Section 4.6 of this agreement.</cite>\n\n<cite>16.4.5 You may embed copies of the font software into your electronic documents for the purpose of printing and viewing the document. If the font software you are embedding is identified as “licensed for editable embedding” on Adobe’s Web Site at <a href=\"http://web.archive.org/web/20131020164730/http:/www.adobe.com/go/embedding_eula_ae\" title=\"http://www.adobe.com/go/embedding_eula_ae\">http://www.adobe.com/go/embedding_eula_ae</a>, you may also embed copies of that font software for the additional purpose of editing your electronic documents. No other embedding rights are implied or permitted under this license.</cite>\n\nAnd, the clause that I think causes some confusion:\n\n<cite>16.4.6 As an exception to the above, the fonts listed at <a href=\"http://web.archive.org/web/20131020164730/http:/www.adobe.com/go/restricted_fonts_ae\" title=\"http://www.adobe.com/go/restricted_fonts_ae\">http://www.adobe.com/go/restricted_fonts_ae</a> are included with the Software only for purposes of operation of the Software user interface and not for inclusion within any Output Files. Such listed fonts are not licensed under Sections 16.4.1 through 16.4.5 above. You agree that you will not copy, move, activate, or use, or allow any font management tool to copy, move, activate, or use such listed fonts in or with any software application, program, or file other than the Software.</cite>\n\nClause 4.5 of the EULA discusses \"unbundling\", at first it seems to support Yves contention:\n\n<cite>4.5 No Unbundling. The Software may include various applications, utilities, and components, may support multiple platforms and languages, and may be provided to you on multiple media or in multiple copies. Nonetheless, the Software is designed and provided to you as a single product to be used as a single product on Computers as permitted by Sections 2 and 16.</cite>\n\n**Bu:t**\n\n<cite><strong>You are not required to install all component parts of the Software,</strong>(emphasis added) but you may not unbundle the component parts of the Software for use on different Computers. You may not unbundle or repackage the Software for distribution, transfer or resale. See Section 16 for specific exceptions to this Section 4.5.</cite>\n\nSo, you can't consider the font to have a license separate from the app, but if you hold a valid license, deleting some of the package doesn't void that license... otherwise we'd be required to keep all the sample file installed!\n\nAnd, furthermore:  \n<cite>2.8 Content Files. Unless stated otherwise in the “Read-Me” files or other license(s) associated with the Content Files, which may include specific rights and restrictions with respect to such materials, you may use, display, modify, reproduce and distribute any of the Content Files. However, you may not distribute the Content Files on a stand-alone basis (i.e., in circumstances in which the Content Files constitute the primary value of the product being distributed), and you may not claim any trademark rights in the Content Files or derivative works thereof.</cite>\n\nSo, I think you _can_ use the Adobe fonts without having the app installed. What can you do with other fonts in other bundles? Well, one would have to read _those_ EULAs.\n\nThat's what I think.\n\n"
    },
    {
      "time": "25 Jun 2010 — 6:18pm",
      "content": "What do you have that bores you so?  \nSurely OCAD provides you with exciting Shinntype and Canada Type fonts!\n\n"
    },
    {
      "time": "25 Jun 2010 — 6:53pm",
      "content": "[My Armitage family](http://web.archive.org/web/20131020164730/http:/new.myfonts.com/fonts/dunwich/armitage/) is available from MyFonts at a 50% discount for personal use, which includes use by students and teachers. That’s $15 per weight or $100 for the twelve-font family. I plan to keep this up with future DTF families.\n\n"
    },
    {
      "time": "29 Jun 2010 — 4:25am",
      "content": "Really appreciate the research/feedback everyone. I can't access the CorelDraw manuals online, but think it's a safe bet to go buy an older copy.\n\nCheers!\n\n"
    },
    {
      "time": "29 Jun 2010 — 5:01am",
      "content": "I wondered aout buying second hand corel software with fonts. How does this work licence wise. Normally fonts are licenced to a certain amount of users in one geographic location. The licence is transferrable, but often tis has to be arranged with the foundry. Reselling fonts is hardly if ever permitted. So how does it work if you buy a program (with fonts like corel) from someone who has the proper licence. Isn't this considered reselling. And what does the EULA of these fonts say about this? Is it actually legal to acquire fonts this way?\n\n"
    },
    {
      "time": "29 Jun 2010 — 3:33pm",
      "content": "If it hasn't been mentioned, you can get a scad ton of URW fonts on an old Macromedia Freehand disk that you can find on Ebay for cheap.\n\n"
    }
  ]
}
