{
  "id": "55560",
  "title": "greetings, and a request for feedback",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "greetings... :+)\n\nso glad i found this place!\n\nbeen looking for experts  \nin typography so i could  \nbounce ideas off of them,  \nand get feedback on stuff.\n\nand this looks like that place. ;+)\n\ni write e-book programs --  \nauthoring-tools and viewers.\n\nmy aim is to incorporate the  \nbest of p-book typography...  \nso i've tried to learn about it.\n\ni respect the centuries of craft.\n\ni want to carry a lot of it forward.\n\ni'm also willing to leave things  \nbehind, as no longer needed,  \nbut i want to know i'm doing it,  \nand doing it for good reasons...\n\ni do believe you can break the rules  \ncreatively even without knowing 'em;  \nif it works, it works, regardless if you  \nknew why it \"shouldn't\" work or not...\n\nbut i love p-book typography, so i've  \nbeen quite willing to learn the rules...\n\nafter all, it's only natural to be  \ncurious about what you love...\n\n\\*\\*\\*\n\ni'm about to release some stuff that  \ni would love to have you look at, and  \ngive me feedback on. in the meantime,  \ni've been spouting off in a few threads  \nabout \"what book typographers think\",  \nand it'd be great if you let me know of  \nany specifics that i've gotten \\_wrong\\_...\n\none thread is over at the \"if:book\" blog  \n-- future of the book -- on a blog entry  \nasking \"why is text on screens so ugly?\"  \ni made a couple of long comments there.\n\nthe second thread is on the \"toc\" blog  \n-- \"tools of change\" at the site of o'reilly,  \nthe computer-book publishers -- where  \ni discuss a free book they just released to  \ndemonstrate print-on-demand at a show.  \ni tell them all the things they did \\_wrong\\_,  \nfrom the perspective of a book-designer,  \nso i'd appreciate if you told me what \\_i\\_  \ngot wrong. you can do it there, or here...\n\ni'll put specific url's in a follow-up post,  \njust in case they would hold up this one.\n\nand when i release stuff into the wild,  \ni'll let you know so you can kick my ass  \nwith some of your excellent feedback... :+)\n\n-bowerbird\n\n",
  "author": "bowerbird",
  "time": "5 Mar 2009 — 1:30pm",
  "uid": "42797",
  "comments": [
    {
      "time": "5 Mar 2009 — 2:01pm",
      "content": "here's one:  \n\\> [http://www.futureofthebook.org/blog/archives/2009/02/why\\_is\\_text\\_on\\_scre...](http://web.archive.org/web/20131023121608/http:/www.futureofthebook.org/blog/archives/2009/02/why_is_text_on_screens_so_ugly.html \"http://www.futureofthebook.org/blog/archives/2009/02/why\\_is\\_text\\_on\\_screens\\_so\\_ugly.html\")\n\nand here's the other, which is a lot longer:  \n\\> [http://toc.oreilly.com/2009/02/best-of-toc-collection-now-ava.html](http://web.archive.org/web/20131023121608/http:/toc.oreilly.com/2009/02/best-of-toc-collection-now-ava.html \"http://toc.oreilly.com/2009/02/best-of-toc-collection-now-ava.html\")\n\nplease, you can be quite frank with me.  \ni have a very thick skin. :+)\n\n-bowerbird\n\n"
    },
    {
      "time": "5 Mar 2009 — 2:06pm",
      "content": "<cite>my aim is to incorporate the<br>\nbest of p-book typography...</cite>\n\nStart by using proper capitalization.\n\n"
    },
    {
      "time": "5 Mar 2009 — 2:25pm",
      "content": "I love it... on the site it says click to enlarge the images. WTF, If I can't read it in its natural environment then why would I want...... well you get my point : )\n\nOh and point well made James!\n\nMichael\n\n"
    },
    {
      "time": "5 Mar 2009 — 2:32pm",
      "content": "PERHAPS HE LIKES e e cummings?\n\n"
    },
    {
      "time": "5 Mar 2009 — 2:37pm",
      "content": "james said:  \n\\> Start by using proper capitalization.\n\nmy tools allow authors to use  \nwhatever capitalization they like.\n\n\\*\\*\\*\n\ntyperror said:  \n\\> on the site it says click  \n\\> to enlarge the images. WTF,  \n\\> If I can’t read it in its natural  \n\\> environment then why would I want...\n\nactually i'm looking for feedback  \non the accuracy of my comments,  \nnot your reaction to someone else's  \nblog entry... just so you know...\n\nthat's why i won't bother to explain why  \ni think what they did was a good thing...\n\n-bowerbird\n\n"
    },
    {
      "time": "5 Mar 2009 — 2:44pm",
      "content": "paragraph said:  \n\\> PERHAPS HE LIKES e e cummings?\n\ni am a poet. and lowercase is  \npart of my artistic expression.\n\nand yes, e.e. cummings is rad.  \nbut he often used mixed-case.\n\ni like ogden nash even better...\n\nwho knew you could make up words?\n\nand just because i know it will  \nbe coming up very soon, it's also  \npart of my artistic expression to  \ncontrol my linebreaks, thank you.\n\nnow, i'm sure the people who will  \nmake more substantive comments  \nwill be arriving here any minute... :+)\n\n-bowerbird\n\n"
    },
    {
      "time": "5 Mar 2009 — 5:22pm",
      "content": "I have a few random comments:\n\n- yes, hyphenation of ragged-right text is a legitimate choice. So is multi-line composition/line-breaking of ragged right text (which InDesign does, btw). Having a more even rag is considered desirable by many typographers.\n\n- the choice between sans and serif is not any more important than the specific choice of fonts: even if you prefer one or the other, there are lousy and better choices in either camp. I prefer sans for most current ebook settings, but I'd sooner be eviscerated with a spoon than read a 300-page ebook set in Arial or Helvetica.\n\n- \"mixed\" mode (cross between \"indent\" and \"block\" mode for paragraph separation) is something that would make most typographers barf.\n\n- have you consulted a lawyer about the repercussions of moving the copyright notice to the end? I'll bet you lunch at a nice restaurant that most copyright lawyers would say it's a bad idea because you want to warn people up front of the copyright.\n\n- On a side note, I was amused to see Sean Stewart's name crop up here. He was best man at my wedding. :) Last night I was playing with the stuff he did for the new \"Watchmen\" film.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "5 Mar 2009 — 5:41pm",
      "content": "OK, feedback . . . screech, whistle, screech . . .\n\n"
    },
    {
      "time": "5 Mar 2009 — 9:42pm",
      "content": "thomas, thank you so much for your reactions...\n\ni'll see if anyone else wants to take a shot as well...\n\n-bowerbird\n\n"
    },
    {
      "time": "7 Mar 2009 — 3:30pm",
      "content": "Like ebook design, pbook design is a compromise between the convenience of the reader and the limitations of the production process.  \nThe single biggest factor determining the production cost of pbooks is length: more words equals more pages, and more pages equals more paper, more press time, and more shipping weight. Justified columns are designed to fit the maximum number of words on a page, which in turn keeps the page count to a minimum. There's no justification for justification in ebooks, because there's no paper, press time, or shipping.  \nParagraphs beginning with an indented first line are another device to minimize length and save paper. Flush-left paragraphs with an extra line or half-line above make sense for ebooks.  \nAggregating metadata into frontmatter (the pages with Roman-numbered folios at the front of a pbook) is likewise an artifact of the space limitations of paper. Put the copyright notice on a splash screen, like other software products, or link it to menu bar or toolbar.  \nThe table of contents in a pbook is the ancestor of the home-page menu. Its column of page numbers is a navigation tool that pbooks required, but on ebooks it's as anachronistic as a foghorn on a space ship. Pbooks are littered with navigation and search tools (numbered pages, numbered footnotes, figure and table references, indexes) that were ingenious workarounds to the space limitations of the paper page, but don't belong in a hyperlinked medium.  \nWhat pbook design conventions _should_ we preserve or adapt for ebooks? Readable fonts, for sure, but what's considered readable is a moving target. Gutenberg cut blackletter type for his Bible because that's what 15th Century readers were comfortable with. When John Baskerville introduced his eponymous type in the 1750s, critics wailed that it would cause blindness in readers accustomed to Caslon. Given time, ebooks will evolve their own optimal letterforms, and readers may even set preferences for the font, size, and leading they prefer.  \nOne thing that seems fairly constant is line length, not measured in inches (or centimeters or picas), but in characters. The comfort zone seems to fall somewhere between 50 and 75 characters per line. Since ebook publishers have no minimum or maximum number of pages to worry about, they should optimize line length and let the number of lines be whatever it needs to be.\n\n"
    },
    {
      "time": "8 Mar 2009 — 6:39pm",
      "content": "thomas said:  \n\\> yes, hyphenation of ragged-right text is a legitimate choice.\n\nfor much of the infrastructure now in place, especially  \nhand-helds like the iphone, e-book programs simply  \ndon't have enough firepower to do hyphenation well.\n\nso i advocate turning off hyphenation entirely...\n\npeople are used to the absence of hyphenation,  \nsince most of the web hasn't been using it at all.\n\nplus, in the \"toc\" (\"tools of change\") .pdf that i was  \nanalyzing, the hyphenation was quite atrocious, so  \nmy advice to turn it off was extremely well-founded.\n\n\\> So is multi-line composition/line-breaking of ragged right text\n\ni absolutely agree that a multi-line method must be used.\n\nand you can achieve a very nice even rag if you do multi-line...  \n(at least in english, with bad-line exceptions being fairly rare.)\n\n\\> a more even rag is considered desirable by many typographers.\n\ni agree that it is very important,\n\nand i restate that a multi-line method can give it to you...\n\n(and even if it couldn't, we still don't have the firepower  \nin our hand-held machines to do hyphenation correctly.  \nso we're stuck here.)\n\n\\> the choice between sans and serif is not any  \n\\> more important than the specific choice of fonts:\n\ncertainly. i was merely relating the common advice, which is  \nto use a serif font for body-text, and sans-serif for headers.\n\nyet -- like you -- i prefer sans-serif myself. (and i said so.)\n\nbut again, with e-books (and print-on-demand for p-books),  \nall these either/or choices need to be decided by the \\_reader\\_,  \nnot by the \\_creator\\_ of the book.\n\n(and it is because of its fixed nature, which does not permit  \na reader to control these variables, that i hate .pdf so much.)\n\n\\> I prefer sans for most current ebook settings, but  \n\\> I’d sooner be eviscerated with a spoon than  \n\\> read a 300-page ebook set in Arial or Helvetica.\n\nand thus the importance of letting the reader decide... :+)\n\n(but you were exaggerating a little bit. weren't you?) ;+)\n\n\\> “mixed” mode (cross between “indent” and “block” mode  \n\\> for paragraph separation) is something that would  \n\\> make most typographers barf.\n\nwell, after you've seen how it looks, you'll probably change  \n\"most typographers barf\" to \"almost all typographers barf\".\n\nbut it paves the way to consider a reasonable \"compromise\",  \nwhich is to indent the paragraphs \\_and\\_ leave \"space above\"  \neach paragraph, just as most book-typographers do, right?\n\nand you can probably guess where i'll go with that, which is  \nto let the reader decide how much \"space above\" will be used.\n\n\\> have you consulted a lawyer about the repercussions  \n\\> of moving the copyright notice to the end?  \n\\> I’ll bet you lunch at a nice restaurant that  \n\\> most copyright lawyers would say it’s a bad idea  \n\\> because you want to warn people up front of the copyright.\n\ni try to \"consult a lawyer\" as little as possible.\n\nand most \\_especially\\_ the copyright lawyers...\n\nplus i'd be wary of any advice that anything is \"a bad idea\"  \ndue to a need to \"warn people up front of the copyright\",  \nbecause \"copyright warnings\" are now a laughing-stock...\n\nat any rate, here's what the government has to say:  \n\\> [http://www.copyright.gov/circs/circ03.html#intro](http://web.archive.org/web/20131023121608/http:/www.copyright.gov/circs/circ03.html#intro \"http://www.copyright.gov/circs/circ03.html#intro\")\n\nunder \"position of notice\" it says:  \n\\> The following locations and methods of affixation  \n\\> are examples of appropriate position of notice.  \n\\> These examples are not exhaustive.\n\nit gives these examples, under \"works published in book form\":  \n\\> Title page  \n\\> Page immediately following the title page  \n\\> Either side of the front or back cover  \n\\> First or last page of the main body of the work\n\nso it looks like the last page would be fine.\n\nor, if an e-book falls in the class of \"works reproduced  \nin machine-readable copies\", the first example there is:  \n\\> With or near the title or at the end of the work\n\nso again, it looks like the last page is fine.\n\nbut, you know, i'm not a lawyer, and i'm glad i'm not,  \nso if \\_you\\_ want to consult a lawyer, it won't be me...\n\nagain, thanks for the feedback thomas...\n\n-bowerbird\n\n"
    },
    {
      "time": "8 Mar 2009 — 8:56pm",
      "content": "Tracking.\n\n"
    },
    {
      "time": "8 Mar 2009 — 9:27pm",
      "content": "_indent the paragraphs \\_and\\_ leave “space above”  \neach paragraph, just as most book-typographers do, right?_\n\nI think that would be either/or, not both (if we are actually talking about first-line indents)?\n\n"
    },
    {
      "time": "9 Mar 2009 — 11:23am",
      "content": "christopher said:  \n\\> Tracking.\n\ni've found tracking isn't much good  \nwhen placing text on-screen.\n\nfirst of all, negative tracking is awful.  \nso bad i think nobody would like it...\n\nand some people might not \\_mind\\_  \npositive tracking, but realistically,  \nit just doesn't help too much either.\n\n\\*\\*\\*\n\nparagraph said:  \n\\> I think that would be either/or, not both  \n\\> (if we are actually talking about first-line indents)?\n\nyes, first-line indents...\n\nand my impression is that \\_most\\_  \nbook-designers use \"space above\"  \non the paragraph \\_in\\_addition\\_to\\_  \nthe standard first-line indentation...\n\nbut i can't point to a support reference  \nfor my position. can you, for yours?\n\n-bowerbird\n\np.s. mojo, i'll get to your post next! :+)\n\n"
    },
    {
      "time": "9 Mar 2009 — 12:20pm",
      "content": "If this is what a [\"p-book\"](http://web.archive.org/web/20131023121608/http:/www.penny-arcade.com/comic/2009/3/9/progress/) is, it's definitely as hilarious as I first thought. If I call myself a \"p-book specialist\" instead of a \"book designer\" do I qualify for a salary increase?\n\n"
    },
    {
      "time": "9 Mar 2009 — 12:54pm",
      "content": "\"i am a poet. and lowercase is  \npart of my artistic expression.\"\n\nBut this is a forum. Communication should probably trump artistic expression when seeking feedback from others.\n\n"
    },
    {
      "time": "9 Mar 2009 — 3:26pm",
      "content": "Bad boy, Christopher, tracking in public.\n\n"
    },
    {
      "time": "9 Mar 2009 — 4:04pm",
      "content": "_p.s. mojo, i’ll get to your post next! :+)_\n\nOoh, I'm getting goosebumps!\n\n"
    },
    {
      "time": "9 Mar 2009 — 4:08pm",
      "content": "_\"Communication should probably trump artistic expression when seeking feedback from others.\"_\n\nAgreed. My brain hurts trying to read this post. Time to cuddle up with well designed, non-fiction \"p-book\".\n\n"
    },
    {
      "time": "9 Mar 2009 — 5:11pm",
      "content": "christopher dean said:  \n\\> it’s definitely as hilarious as I first thought.\n\ngreat! glad that this thread is entertaining you!\n\nand you get extra credit for coming up with  \na topical link -- a comic from \\_today\\_ --  \nto illustrate your point. except you pointed  \nto a \\_web\\_comic\\_ (ohno!), not one in \\_print\\_,  \nso i now have to take away the extra credit  \n\\_and\\_ dock you two additional points as well.  \nsorry, but those are the rules of the luddites... :+)\n\nhowever, you \\_can\\_ get one of those points  \nreturned, if you mail me -- yes, snail-mail --  \na self-address-stamped-envelope (number 10).\n\n\\> If I call myself a “p-book specialist”  \n\\> instead of a “book designer”  \n\\> do I qualify for a salary increase?\n\num, yes, you do. go demand it from your boss.  \nif s/he gives you any trouble, just tell them that  \nthe lowercase poet said it, so it \\_must\\_ be true...  \nit'll be completely convincing and win your case.\n\nhowever, if you work for a major publishing house,  \nyou'll be laid off next quarter anyway, so it would be  \nbetter to skip the raise and just go find another job.\n\n\\*\\*\\*\n\naluminum said:  \n\\> Communication should probably  \n\\> trump artistic expression  \n\\> when seeking feedback from others.\n\ni don't need feedback \\_that\\_ badly... :+)\n\nso do please feel free to move along,  \nit won't hurt my feelings... ;+)\n\n-bowerbird\n\n"
    },
    {
      "time": "9 Mar 2009 — 8:39pm",
      "content": "I personally encourage e-book development quite fervently. And yes, many rules need to be seen for what they are: dumb legacies. One way an e-book should improve over the hardcopy legacy is that instead of presenting text on recto and verso pages that are flipped in pairs, the text columns should be presented in a continuous horizontal sequence (breaking only where it makes content sense).\n\nMy strongest bit of advice however is this: you will only serve your own ego, and never any reader, by classing your artistic expression above humble functionality, clear communication. Design is about servitude, not expression; being made by a human for other humans, personal expression will surely come out, but it must be allowed to do so only _in spite_ of you.\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2009 — 10:18pm",
      "content": "_Title: greetings, and a request for feedback_\n\nBody: i don’t need feedback \\_that\\_ badly... :+)\n\nI agree.\n\n"
    },
    {
      "time": "9 Mar 2009 — 10:44pm",
      "content": "Christopher Dean, thanks for shedding some light on the mysterious \"p-book\".  \nI found another definition [here](http://web.archive.org/web/20131023121608/http:/www.urbandictionary.com/define.php?term=p-book). ;-)\n\nAnd another one [here](http://web.archive.org/web/20131023121608/http:/www.wordspy.com/words/p-book.asp).\n\n"
    },
    {
      "time": "9 Mar 2009 — 11:07pm",
      "content": "hrant said:  \n\\> you will only serve your own ego,  \n\\> and never any reader, by classing  \n\\> your artistic expression above  \n\\> humble functionality, clear communication.\n\nyou seem to be confusing my posts  \nwith the tools that i've programmed.\n\nlike a film soundtrack, a requirement  \nfor my tools is to be fully transparent.  \nthey exist only to accent your content.\n\n-bowerbird\n\n"
    },
    {
      "time": "9 Mar 2009 — 11:16pm",
      "content": "i did indeed ask for feedback here...\n\nand i intend to reflect true appreciation  \nfor the feedback i receive in full measure  \nas my reciprocation for the value therein.\n\nbut if you think i'm gonna compromise  \nmy artistic integrity for that feedback,  \nyou're wrong. i don't need it that badly.\n\nso, are we clear?\n\n-bowerbird\n\n"
    },
    {
      "time": "10 Mar 2009 — 1:53am",
      "content": "I was going to comment further, but I won't help people who incite or encourage piracy. So I'm out of this thread.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "10 Mar 2009 — 6:56am",
      "content": "\\> you seem to be confusing my posts  \n\\> with the tools that i’ve programmed.\n\n1) I worry that there's a relationship. You are, after all, one person.  \n2) If you want us to read your posts easily, you will subvert your artistry and accommodate _other people_. You might think we're making a mountain of a molehill, but we care about details here, about optimal functional performance. It's not the only thing we care about, but many of us don't encourage making functionality a lower priority.\n\n\\> i don’t need it that badly.\n\nYou should consider that we cannot provide what you might need badly: blind gushing admiration. If you want to flame artistic, this is simply the wrong place, I'm sorry to say. Actually, I'm not sorry to say!\n\n\\> I won’t help people who incite or encourage piracy.\n\nMaybe we can -and should- help them  \nsee the damage that piracy causes?\n\nOr is this case hopeless?\n\n--\n\nBowerbird (note the cap), do you have any reaction to my columns idea? I wanted to get the elephant in your room more exposure first, but I do have some more technical ideas (like concerning resolution, tracking, etc.), I just don't want them to go to waste at your ego altar. Can you handle it?\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:51am",
      "content": "thomas said:  \n\\> I was going to comment further, but  \n\\> I won’t help people who incite or encourage piracy.\n\nwhat i was \"inciting and encouraging\" (in that other thread)  \nwas \\_some\\_thought\\_ about the \\_reality\\_ of the situation...\n\nbut, you know, if you'd rather stick your head in the sand,  \nor run away, feel free. you're not the first person to do that.\n\nlet me repeat the crux: the pirates laugh at your impotence.\n\n(and me personally? there's so much bona-fide free content  \nout there already that i feel absolutely no need to \\_pirate\\_,  \nor to buy anything at all from the corporate content cartel.  \nas for fonts, i'm gonna use helvetica, because i would \\_love\\_  \nto see you eviscerate yourself with a spoon some day.) :+)\n\n\\*\\*\\*\n\nhrant said:  \n\\> I worry that there’s a relationship.  \n\\> You are, after all, one person.\n\nthere's no need to worry. absolutely no need at all.  \nmy tools will not transform your work to lowercase.  \ni promise. (well, not unless you \\_want\\_ them to.)\n\n\\> If you want us to read your posts easily, you will  \n\\> subvert your artistry and accommodate other people.\n\nlet me proclaim it -- loudly and clearly -- for all to hear:  \nif you don't like my lowercase posts, then don't read them.\n\nor, in other words, i don't care if you read my posts or not.\n\nindeed, if lowercase bothers you, please just move along.  \nyou will be doing both of us a favor. yep, it's a win-win!\n\n\\> You might think we’re making a mountain of a molehill\n\nno, i think you're trying to bully me into conformity. :+)\n\nand it will not work. you aren't the first to try, believe me.  \nand probably not the last. but trust me, you won't succeed.\n\n\\> but we care about details here,  \n\\> about optimal functional performance.\n\ngosh, i bet that makes you feel proud of yourself...\n\n\\> You should consider that we cannot provide  \n\\> what you might need badly: blind gushing admiration.\n\nyeah, right, hrant, that's \\_exactly\\_ what i came here for,  \nthe blind gushing admiration typophiles are known for...\n\n\\_you\\_ in particular! :+)\n\n\\> Bowerbird (note the cap)\n\nhey, you do what you have to do, that's ok by me... :+)\n\n\\> do you have any reaction to my columns idea?\n\nto tell you the truth, i wasn't exactly sure what you meant.\n\nand i'm still not sure.\n\nbut perhaps you mean the way your website is structured?\n\ni think it stinks.\n\nif i came across a whole freakin' book like that, i would  \ngive it to thomas, in the hope he would eviscerate himself.\n\n\\> I just don’t want them to go to waste at your ego altar.  \n\\> Can you handle it?\n\ni buy flame-retardant foam -- you know, the kind they use  \nat the airport during crashes -- by the tanker-truck-load...\n\nthere's no question i can handle you.\n\ni'm not sure you can handle \\_me\\_, though... :+)\n\n(especially if you keep talking \\_about\\_ me,  \ninstead of about something that's on-topic,  \nbecause i can rip personal stuff to shreds.)\n\n-bowerbird\n\n"
    },
    {
      "time": "10 Mar 2009 — 11:18am",
      "content": "_\"if you don’t like my lowercase posts, then don’t read them.  \nor, in other words, i don’t care if you read my posts or not\"_    \nWell, that _is_ a worrisome attitude for someone who programs stuff that should be read. Do you have a split-personality thing going on? Or do you consider your posts to Typophile to be poetry, and separate from work?\n\nBowerbird, with a mind as closed as yours, don't think you'll ever learn anything. But it seems like you don't want that anyway. And by the way, it might help not to call the very people whom you turn to for feed-back \"sissies\", like you just did on that other thread.  \nOver and out.\n\n"
    },
    {
      "time": "10 Mar 2009 — 11:52am",
      "content": "There are uppercase people and lowercase people, as well as mixed case people.\n\n\"bb\" is most definitely a lowercase person.\n\n"
    },
    {
      "time": "10 Mar 2009 — 12:02pm",
      "content": "\\> there’s so much bona-fide free content out there already\n\nIf you don't mind using crap, sure. And if you can't taste that it's crap, that's not anybody else's fault. Oh, and Helvetica?! {Makes coughing sound that sounds suspiciously like \"loser\".}\n\nAnd if you can't tell what a good font looks like, your hopes of making a good e-book interface are completely delusional. All you can be good at is describing your navel.\n\n\\> my tools will not transform your work to lowercase.\n\nOf course that's not what I meant. I meant that the artist in you might be too strong to tame when it comes to anything you do. Including pretending to engage in discourse.\n\n\\> if you don’t like my lowercase posts, then don’t read them.\n\nHa-ha, we laugh at your impotence!\n\nSeriously: if you don't care whether people are reading your posts, please use your own blog. This is not expressyourselfwithakeyboard.com.\n\n\\> i wasn’t exactly sure what you meant.\n\nWhy didn't you ask?  \nThat's a rhetorical question, which you yourself have already answered.\n\n\\> especially if you keep talking \\_about\\_ me\n\nBut that's the only reason you're here.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2009 — 1:22pm",
      "content": " ![](http://web.archive.org/web/20131023121608im_/http:/typophile.com/files/lovethread_5997.jpg)\n\napologies to bb for the caps\n\nand, to make thomas happy, the image was found on lolcatz.net,  \nwhich carries a public domain notice. so no piracy was condoned\n\n"
    },
    {
      "time": "10 Mar 2009 — 1:51pm",
      "content": "publishingmojo said:  \n\\> Like ebook design, pbook design is a compromise  \n\\> between the convenience of the reader and  \n\\> the limitations of the production process.\n\nok.\n\n\\> There’s no justification for justification in ebooks,\n\nha! \"justification for justification\". wordplay at work. :+)\n\n\\> There’s no justification for justification in ebooks,  \n\\> because there’s no paper, press time, or shipping.\n\nwithout disputing your point about justification as a  \nspace-saving device, some people also believe that it  \naids readability. and there's also the other point that  \n-- whatever reasons that caused it to come about --  \nit's been here a long time and people now prefer it...\n\nso i'm not sure we can discard it so lightly...\n\n\\> Paragraphs beginning with an indented first line are  \n\\> another device to minimize length and save paper.\n\nthis one i'm even less sure about. there is a need to  \nindicate paragraphs, and indentation is a good way.\n\nindeed, indentation is better than \"block\" paragraphs  \n(a blank line between paragraphs) in some respects...  \n(e.g., if paragraph-break and page-break co-occur.)\n\nif all we wanted to do was \"save paper\" then pilcrows  \nwould be what we'd choose, and nobody uses them...\n\n\\> Flush-left paragraphs with an extra line or half-line  \n\\> above make sense for ebooks.\n\njust because it has made me curious, why do people  \nspecify \"flush-left\" like you did right there? how else  \nbesides flush-left would you think it could be done?\n\ncentered? flush-right with a ragged-left margin?\n\nsurely nobody would suggest those for a \\_book\\_.\n\n\\> Aggregating metadata into frontmatter (the pages  \n\\> with Roman-numbered folios at the front of a pbook)  \n\\> is likewise an artifact of the space limitations of paper.\n\ni'm not sure that i see how frontmatter \"saves pages\"...  \n(and the different numbering convention can't matter.)\n\n\\> Put the copyright notice on a splash screen, like other  \n\\> software products, or link it to menu bar or toolbar.\n\nexcept an electronic-book is \\_not\\_ \"a software product\".  \nat least we don't want people to perceive it in that way...\n\n\\> The table of contents in a pbook is  \n\\> the ancestor of the home-page menu.\n\nok.\n\n\\> Its column of page numbers is a navigation tool  \n\\> that pbooks required, but on ebooks it’s as  \n\\> anachronistic as a foghorn on a space ship.\n\nnot quite so sure about that. sure, in an e-book,  \nwe want hotlinks, and not (just) pagenumbers...  \n(more about that \\_just\\_ right there in a little bit.)\n\n\\> Pbooks are littered with navigation and search tools  \n\\> (numbered pages, numbered footnotes, figure and  \n\\> table references, indexes) that were ingenious workarounds  \n\\> to the space limitations of the paper page, but don’t belong  \n\\> in a hyperlinked medium.\n\nmore on this below, but what's telling here is your  \nperceptive observation; p-books are \"littered\" with  \n\"ingenious workarounds\" for navigation and search.\n\nthat's telling because it informs us that navigation  \nand search are \\_important\\_aspects\\_ with any book.\n\nindeed, i've called \\_navigation\\_ the most important  \naspect of a book. might be a stretch. or might not.\n\n\\> What pbook design conventions should we  \n\\> preserve or adapt for ebooks?\n\nthat's a good question. :+)\n\n\\> Readable fonts, for sure, but what’s considered readable  \n\\> is a moving target.\n\ni dodge that \"moving target\" with one very simple tactic;  \ni let the end-readers decide which font they want to use.  \nthat makes them happy, and that makes me happy too...\n\n\\> Given time, ebooks will evolve their own optimal letterforms,  \n\\> and readers may even set preferences for the font, size, and  \n\\> leading they prefer.\n\nthat time is now. :+)\n\n\\> One thing that seems fairly constant is line length,  \n\\> not measured in inches (or centimeters or picas),  \n\\> but in characters. The comfort zone seems to fall  \n\\> somewhere between 50 and 75 characters per line.\n\nright. that's the result found by most of the experiments.  \n(although it's interesting that 75 is 150% of 50, meaning  \nthere's a pretty big range regarding this \"comfort zone\".)\n\nthe 3 lines in the above paragraph are almost 60 characters.  \ni break almost all of my lines in that 50-75-character range.  \nand -- at least on some boards -- that pisses people off...  \nyou wouldn't believe how angry they get about it. or maybe  \nyou would, since some of you are that mad about my casing.  \n(imagine if you were that mad about \\_both\\_ of those things!)\n\nat any rate, this is another of the variables i let readers decide.\n\nand sometimes, it depends on the specifics of the situation...\n\nif you're reading on an iphone, for example, or even a kindle,  \nthat odds are that if the text is at a size you find comfortable,  \nthe line-length might be at the short end of the comfort zone.\n\nfor instance, we could consider a p.r. picture from amazon,  \nshowing a screenful of text as it gets displayed on the kindle.\n\nhere's that text, with each line's character-count to its right:  \n\\> he was slow in learning how to talk. \"my /41  \n\\> parents were so worried,\" he later recalled, \"that /50  \n\\> they consulted a doctor,\" even after he had begun /50  \n\\> using words, sometime after the age of 2, he /44  \n\\> developed a quirk that prompted the family maid /47  \n\\> to dub him \"der depperte,\" the dopey one, and /45  \n\\> others in his family to label him as \"almost /44  \n\\> backwards.\" whenever he had something to say, /46  \n\\> he would try it out on himself, whispering it softly /52  \n\\> until it sounded good enough to pronounce aloud. /48  \n\\> \"every sentence he uttered,\" his worshipful /43  \n\\> younger sister recalled, \"no matter how routine, /48  \n\\> he repeated to himself softly, moving his lips.\" it /52  \n\\> was all very worrying, she said. \"he had such /46  \n\\> difficulty with language that those around him /46  \n\\> feared he would never learn.\"1 n/a\n\nand here's a screenful of text as shown on the sony reader:  \n\\> boredom. thursday afternoons were usually a big /47  \n\\> peach day, with women getting ready for sunday /46  \n\\> cobblers, but not a soul stopped. n/a  \n\\> t. ray refused to let me bring books out here and /49  \n\\> read, and if i smuggled one out, say, lost horizon, /51  \n\\> stuck under my shirt, somebody, like mrs. watson /49  \n\\> from the next farm, would see him at church and say /51  \n\\> \"saw your girl in the peach stand reading up a storm. /53  \n\\> you must be proud.\" and he would half kill me. n/a\n\nso we're at (or below) the low end of the 50-70 \"comfort zone\".\n\nas you can imagine, the counts go down more with the iphone,  \nand down even farther on the phones with even smaller screens.\n\nbut newspapers have small columns too, so it's not a problem...\n\nwe have the opposite problem with the big monitors nowadays.  \nthey are now far too wide to present a comfortable line-length.\n\n(which is why blogs, and sites like this one, now use columns,  \nsuch that the \\_real\\_ content uses up about 1/3 of the screen,  \nwith the rest splattered with nonsense and ads and more b.s.)\n\nbut that \"problem\" now presents us with a great opportunity...\n\nour monitors are wide enough to do a \\_facing-pages\\_display\\_.\n\na 2-page view returns us to the familiar mode of the p-book...  \nwith each page being shown big enough for pleasant reading.\n\nmoreover, this 2-page view is useful with an e-book because  \nit allows \\_one\\_ of the pages to \"drop away\" in those situations  \nwhere we need some screen-space for some other purpose...\n\nfor instance, let's say the user wants to see the contents page.  \nyou \"drop away\" one of the pages, so as to show the contents.  \nthis allows the person to \"remain in contact\" with the body text  \n-- via the page which has not \"dropped away\" -- yet still have  \nroom for the other purpose. having this room as \"workspace\"  \ncomes in handy in all kinds of situations -- where the person  \nwants to view a larger version of a picture, or cycle through all  \nthe book's pictures, or when they want to make an annotation,  \nor if they want to view pages from different parts of the book,  \nor any number of other situations that arise in the experience...\n\n\\> Since ebook publishers have no minimum or maximum number  \n\\> of pages to worry about, they should optimize line length and  \n\\> let the number of lines be whatever it needs to be.\n\nif we were going to \"switch over\" entirely from paper to screens,  \nand all the paper-books were to disappear overnight, and we  \nwould never ever print out a book again for the rest of our lives,  \nthen we could throw out all of our past rules and \\_start\\_over\\_...\n\nbut that's not our situation.\n\nwe need to have a more-gradual transformation...\n\nso we need to do some more thinking... more on that later...\n\n-bowerbird\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:11pm",
      "content": "altaira said:  \n\\> Well, that is a worrisome attitude for someone  \n\\> who programs stuff that should be read.\n\nunless you're reading my source-code, why would you care?\n\nlook, it's pretty simple, so i'm sure that even you can understand:  \nit you enter mixed-case text into my programs, the .pdf output  \nand the .html output will be mixed-case text. just like the input.\n\nbut if you have any more questions, i'll be happy to answer them.\n\n\\> Do you have a split-personality thing going on?\n\nno. yes. why do you ask? i don't know. ask me tomorrow.\n\n\\> Or do you consider your posts to Typophile to be poetry,  \n\\> and separate from work?\n\nthe casing of my posts to this forum, or any other forum,  \ndo not have any effect on the output of my tools. none.  \nzero. zilch. nada. absolutely no effect. at all. capiche?\n\nis there anyone else who needs clarification on this fact?\n\n\\*\\*\\*\n\nhrant said:  \n\\> Oh, and Helvetica?! {Makes coughing sound that  \n\\> sounds suspiciously like “loser”.}\n\nhey, i agree. how did helvetica ever make its reputation?  \ni think it's a crappy font.\n\nyou know a font i like? comic sans. that's a nice clean font.  \ni don't know why people hate it so much. i think it's funny.  \nputs me in a good mood every time i see type in comic sans.\n\nbut most of the time i use the mac font, lucida grande.  \noccasionally i choose verdana. that's another nice font.  \nand when i have to use a serif, i usually choose georgia.  \nthe best things bill gates ever did were (1) verdana, and  \n(2) georgia, and (3) making a charity to fight malaria...\n\n\\> And if you can’t tell what a good font looks like,  \n\\> your hopes of making a good e-book interface  \n\\> are completely delusional. All you can be good at  \n\\> is describing your navel.\n\ni doubt you want to hear a description of my navel.\n\nand i \\_can\\_ tell you what a good font looks like.  \nin fact, i just did. i like comic sans. looks good.\n\nbut hey, i don't need to impose my taste on \\_you\\_.  \nor on any of my users. or on any of their readers...\n\nso i let the authors pick \\_whatever\\_ font they want,  \nas long as they have it on their machine, legal or not.\n\nthen i let the readers pick whatever font \\_they\\_ want,  \nas long as they have it on their machine, legal or not.  \nincluding comic sans.\n\n\\> But that’s the only reason you’re here.\n\nnow, hrant. you remember what your psychologist said  \nabout keeping your projection in check, don't you? :+)\n\n-bowerbird\n\n"
    },
    {
      "time": "10 Mar 2009 — 3:41pm",
      "content": "\\> i don’t need to impose my taste on \\_you\\_.\n\nFirst you would need to have some.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2009 — 3:44pm",
      "content": "umm-umm-good. comic sans. yummy! tastes great!\n\n-bowerbird\n\n"
    },
    {
      "time": "10 Mar 2009 — 3:59pm",
      "content": "i feel that most poets would be  \noffended by seeing your  \nself-important crap arranged  \nin stanzas as if it meant anything\n\n"
    },
    {
      "time": "10 Mar 2009 — 4:59pm",
      "content": "um, it's even more fun to offend \"most poets\"  \nthan it is to offend \"most typophile posters\"...\n\n-bowerbird\n\n"
    },
    {
      "time": "11 Mar 2009 — 2:07pm",
      "content": "_just because it has made me curious, why do people  \nspecify “flush-left” like you did right there? how else  \nbesides flush-left would you think it could be done?_\n\n_centered? flush-right with a ragged-left margin?_\n\nJust because you asked, \"flush left\" in this rather specialized context refers to the first line of the paragraph, which is flush left as opposed to being indented.\n\n"
    },
    {
      "time": "11 Mar 2009 — 3:12pm",
      "content": "publishingmojo said:  \n\\> “flush left” in this rather specialized context  \n\\> refers to the first line of the paragraph, which  \n\\> is flush left as opposed to being indented.\n\noh, ok, great, thanks for explaining that to me.  \ni knew there must be something i was missing.\n\n-bowerbird\n\n"
    },
    {
      "time": "11 Mar 2009 — 3:27pm",
      "content": "wow this thread is a clusterfuck\n\n"
    },
    {
      "time": "11 Mar 2009 — 3:58pm",
      "content": "\\> clusterfuck\n\nyes, i feel like i have been welcomed quite officially now! :+)\n\ni'd like to thank all the commenters here for making me feel at home...\n\nyou're a swell bunch of guys -- seriously, is there any estrogen here? --  \nand i'm sure we're gonna have \\_lots\\_ of fun interacting in the future...\n\n-bowerbird\n\n"
    },
    {
      "time": "11 Mar 2009 — 6:01pm",
      "content": "_look, it’s pretty simple, so i’m sure that even you can understand_\n\nThat sounds like you're insulting altaira. Why do you think we have to put up with insults?\n\nYou will lose friends and influence no one with that attitude.\n\nOver and out.\n\n"
    },
    {
      "time": "11 Mar 2009 — 7:23pm",
      "content": "but he doesn't need friends \\_that\\_ badly... :+++)\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2009 — 8:46pm",
      "content": "ricardo said:  \n\\> That sounds like you’re insulting altaira.\n\ni suppose you can make it sound however you want to make it sound.  \nbut don't try to make \\_me\\_ responsible for \\_your\\_ (mis)interpretations,  \nbecause i won't accept the charges on that collect call.\n\n\\> You will lose friends and influence no one with that attitude.\n\ni \\_disdain\\_ carnegie and his manipulative, deceitful philosophy...\n\n-bowerbird\n\n"
    }
  ]
}
