{
  "id": "55585",
  "title": "Critique | Shoe Store",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello everyone,\n\nI'm designing a logo for a Shoe Store named Arizona.\n\nThe palette was already created by the interior designers, with the typical turquoise/orange scheme you'd typically find in an Arizona theme. The store will eventually become a franchise, so I am keeping the design somewhat simple to accommodate future changes throughout the many applications it will be used.\n\nI used Saracen as the typeface. I love this, because it addresses the diamond shapes Arizona logos often use, without having to actually use them (because of it's chunky, pointy serifs). Right now I haven't gone into the stage of adding a visual element to make it unique, I just wanted to see what people thought of the typeface, colors, etc.\n\nOne problem I may have, is that it might look too Chunky or Rigid for a higher-end shoe store. I'd like to hear your opinions, but so far I think it looks pretty sexy. I just love the typeface.\n\nRight now the stores will be located in Quebec or Eastern Canada.\n\nThanks in advance!!!!!\n\n| Attachment | Size |\n| --- | --- |\n| [Arizona1.jpg](http://web.archive.org/web/20131020025116/http:/typophile.com/files/Arizona1.jpg) | 18.9 KB |\n| [ArizonaSignage1.jpg](http://web.archive.org/web/20131020025116/http:/typophile.com/files/ArizonaSignage1.jpg) | 50.82 KB |\n| [Arizona2.jpg](http://web.archive.org/web/20131020025116/http:/typophile.com/files/Arizona2.jpg) | 15.59 KB |\n| [ArizonaSignage2.jpg](http://web.archive.org/web/20131020025116/http:/typophile.com/files/ArizonaSignage2.jpg) | 50.67 KB |\n\n",
  "author": "DaveG",
  "time": "6 Mar 2009 — 10:12am",
  "uid": "8209",
  "comments": [
    {
      "time": "6 Mar 2009 — 12:13pm",
      "content": "Clean Design. Does seem a bit playful in the angles of the letters. Maybe if you couple it with a lighter sans serif that looks more \"high end\". Maybe Museo sans or Frutiger.\n\nYou know they wear sandals down in Arizona right? Dirty French.\n\n"
    },
    {
      "time": "6 Mar 2009 — 12:26pm",
      "content": "Thanks! I'm probably going to have to write \"Les Chaussures Arizona\" anyways... maybe trade gothic condensed or something\n\nArizona seems like an investment spot for French Canadians. Florida too!\n\n"
    },
    {
      "time": "6 Mar 2009 — 2:10pm",
      "content": "I'm really enjoying these. Like you said, it does a nice job of adding the \"diamond\" thing in there without it being obnoxious. I prefer the all caps version but both are nice.\n\n"
    },
    {
      "time": "6 Mar 2009 — 2:50pm",
      "content": "It works—Saracen really does fit into the Arizona retail signage context without looking cliche. It’s a very smart solution.\n\n"
    },
    {
      "time": "6 Mar 2009 — 4:37pm",
      "content": "I really enjoy what you have done here. I think the type chosen works very well. Considering it being a higher-end store I do prefer the all caps. The letter forms in the all caps version just seem to have a more serious tone and tend to be not as playful as the first version. Hope all turns out well! Keep us posted!\n\n"
    },
    {
      "time": "6 Mar 2009 — 8:40pm",
      "content": "Makes me think of candy...and shoes can be eye candy. I think the typeface looks great. It kind of has an \"indie\" feel. At first the touching serifs bothered me but I don't mind them now.\n\n"
    },
    {
      "time": "7 Mar 2009 — 5:28am",
      "content": "It doesn't say \"higher-end\" at all to me, but I think that's really tricky with the other givens of the commission (which this does serve well). I agree with Jeremiah that the all caps is appropriately more serious - I also like the play of Z and N in that version.\n\n"
    },
    {
      "time": "9 Mar 2009 — 8:45pm",
      "content": "we use saracen for our page headers and logos at the arizona republic, so i can't see that without thinking of the republic :)\n\n"
    },
    {
      "time": "17 Mar 2009 — 3:13pm",
      "content": "it's got potential ... but yeah it's not screaming \"high-end\" in fact it's doing the opposite. but perhaps with some great execution and interior design it can work.\n\nin brief .. it's not creating the feeling of somewhere I'd like to go (read: \"visit Arizona\") it's a great opportunity to great a sense of place - that does exist but doesn't necessarily have to exist in reality.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20131020025116/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20131020025116/http:/www.showusyourshorts.com.au/)\n\n"
    }
  ]
}
