{
  "id": "55609",
  "title": "Defiant Battle Type, More Progress",
  "forum": "Randy's blog",
  "tags": [

  ],
  "content": "Coming down the home stretch on the Moped Script. For the sake of getting it out the door, I’m going to release this, then possibly other weights or versions.\n\nIt features the straight and curl versions, contextual alternates for appropriate joins, and language support covering latin for Europe. Specifically: Afrikaans, Basque, Breton, Catalan, Danish, Dutch, English, Finnish, French, Gaelic, German, Icelandic, Indonesian, Irish, Italian, Norwegian, Portuguese, Sami, Spanish, Swahili, Swedish, Croatian, Czech, Estonian, Hungarian, Latvian, Lithuanian, Polish, Romanian, Serbian, Slovak, Slovenian, and Turkish.\n\n ![](http://web.archive.org/web/20091028123832im_/http:/www.typophile.com/files/moped_sample_6566.gif)\n\n",
  "author": "<a href=\"/web/20091028123832/http://www.typophile.com/user/7783\" title=\"View user profile.\">Randy</a>",
  "time": "<br>",
  "uid": "7783",
  "comments": [
    {
      "time": " 7.Mar.2009 1.27am",
      "content": "A beautiful thing. Great to see this born and developed all on Typophile.\n\n"
    },
    {
      "time": " 7.Mar.2009 5.03pm",
      "content": "Here’s a question: currently I have the high/low contextual alternates in the calt feature... which makes sense. Except that in illustrator (at least my version) calt is turned off by default. I’m wondering if it’s a problem to put it in liga instead, since it is “on” by default in most apps?\n\nThis just in:\n\n ![](http://web.archive.org/web/20091028123832im_/http:/www.typophile.com/files/sample_sups_4677.gif)\n\n"
    },
    {
      "time": " 7.Mar.2009 5.06pm",
      "content": "And thanks for your kind words Stephen.. it was a great battle brief!\n\n"
    },
    {
      "time": " 8.Mar.2009 3.28am",
      "content": "This is great. (I seem to have missed the battle itself, but this ’Moped Script’ is just great.)\n\n"
    },
    {
      "time": " 8.Mar.2009 9.01am",
      "content": "Very nice, Randy. And (as Stephen also said) wonderful that this one got born out of the Typophile battle.\n\n"
    },
    {
      "time": " 8.Mar.2009 9.25am",
      "content": "Coolíssimo!\n\n"
    }
  ]
}
