{
  "id": "55607",
  "title": "Fontlab Key Glyph",
  "forum": "Build",
  "tags": [

  ],
  "content": "In Fontlab, if a font is complete regarding all kerning classes and kerning pairs and the information is compiled into the OpenType kern feature… and you happen to copy and paste a non key glyph over a glyph that is marked with the red 'key glyph' mark… does anything actually change?\n\nI imagine nothing would change being that all the kerning and class information is already compiled but I'm still curious about this. I'd hate to 'update kern feature' and re-compile and have things change… It doesn't look like there's a quick way to re-tag a key glyph after it changes either… any thoughts?\n\nThanks,\n\nMike\n\n",
  "author": "<a href=\"/web/20111231004339/http://typophile.com/user/17099\" title=\"View user profile.\">Mike Jarboe</a>",
  "time": "<br>",
  "uid": "17099",
  "comments": [
    {
      "time": "",
      "content": "Mike,\n\nin FontLab Studio 5, to make sure nothing changes, you should have a \"kern\" feature generated in the OpenType panel, and also all the classes imported into the lower-right part of the OpenType panel (using _Import FontLab Classes_ from the OpenType panel flyout menu). Only then you can dump or freely rearrange your classes in the Classes panel.\n\nOf course once you've imported the classes into the OpenType panel (i.e. converted them from the FontLab syntax into AFDKO syntax), in Preferences / General Options / Unicode and OpenType, disable _Add all glyph classes to OpenType feature definition code_, and in Preferences / Generating OpenType & TrueType / Kerning, disable _Generate OpenType kern feature if it is undefined or outdated_.\n\n"
    },
    {
      "time": "",
      "content": "Thanks… this is a nice safe guard to know of (the problem for me would really only occur when moving on from my finished 'master' so to speak and working on other weights/variants, cutting/pasting and sorting through things where I worry some unwanted change could occur)\n\n"
    }
  ]
}
