{
  "id": "5565",
  "title": "(x) Gracie Films - Parsons {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "At the end of The Simpsons, there's a Gracie Films logo (in caps). I've done a Google search just to find a sample to no avail. Any ideas?\n\n",
  "author": "<a href=\"user/1203\" title=\"View user profile.\">anonymous</a>",
  "time": "<br>",
  "uid": "1203",
  "comments": [
    {
      "time": " 10 July, 2004 - 2:00pm",
      "content": "Here's a small sample. I'll leave it to others here to take a whack at it. Hand-drawn, obviously, but I'm guessing you want to know what inspired it.   \n   \n ![gracie](http://web.archive.org/web/20070318050348im_/http:/www.typophile.com/forums/messages/83/40329.jpg)   \n   \nJust an idea -- take a stroll through [Nick's Fonts](http://web.archive.org/web/20070318050348/http:/www.nicksfonts.com/). You might see something you like there.\n\n"
    },
    {
      "time": " 10 July, 2004 - 2:14pm",
      "content": "Try [Parsons](http://web.archive.org/web/20070318050348/http:/www.philsfonts.com/showing.html?sku=AI000025X1P1&start=1).\n\n"
    },
    {
      "time": " 14 July, 2004 - 2:55pm",
      "content": "By the way, that version of Parsons I linked to is not a very good version of Parsons, but the only digital one I could find. Also, it lacks the alternate G that is used on the Gracie Films logo. You can see better versions of this face in older type books.\n\n"
    },
    {
      "time": " 14 July, 2004 - 5:01pm",
      "content": "[Dieter Steffmann](http://web.archive.org/web/20070318050348/http:/www.moorstation.org/typoasis/designers/steffmann/index.htm) digitized a set of 3 Parsons Bold fonts under the name Puritan. The set contains the base font as well as an Alternates and a Swash variant. None of these include the G in the Gracie image, but Puritan Regular contains that M, which the Alphabets version doesn't.   \n   \nHerr Steffmann digitized Parsons Heavy and, for some reason, allowed it to keep its name. This also includes an Alternates font.   \n   \nFinally, for completeness sake, there's an old Compuworks font called [Churchman](http://web.archive.org/web/20070318050348/http:/www.grsites.com/modperl/fontview.cgi?dir=c&fn=CW_CHRCH). This is Parsons Light.   \n   \nNone of these fonts are terribly well made and the Compuworks font is missing some punctuation and all extended characters. They all look lousy on screen at even medium small sizes.   \n   \nI know how you all drool over Swash fonts, so here's Puritan Swash:   \n   \n ![](http://web.archive.org/web/20070318050348im_/http:/www.typophile.com/forums/messages/83/40711.gif)\n\n"
    },
    {
      "time": " 14 July, 2004 - 6:12pm",
      "content": "Here's Phil Martin's [Persons](http://web.archive.org/web/20070318050348/http:/mm2000s.net/PersonsGraphic.gif)\n\n"
    },
    {
      "time": " 14 July, 2004 - 8:37pm",
      "content": "Stephen, I knew about Persons but hadn't looked at it. I think that must be what they used. I just checked an old BB&S catalog and McGrew, both of which show the original metal version. Parsons looks just as funky in metal as all the digital versions mentioned so far. Only Persons has the simpler G, as in the Gracie logo.   \n   \nHuh! Two Phil Martin faces in one day.\n\n"
    },
    {
      "time": " 20 July, 2004 - 5:53am",
      "content": "Thanks! You're good! I went to Phil Martin's site and clicked on all three of Phil's distributors and none of them have Persons.\n\n"
    },
    {
      "time": " 20 July, 2004 - 8:50am",
      "content": "I think only about half of Phil Martin's fonts are available in digital format, and many of those are incomplete (basic character set only--no alternates, ligatures or swash characters). Persons is among the undigitized. Several parties are at work rectifying this situation, but it takes time.\n\n"
    }
  ]
}
