{
  "id": "55660",
  "title": "Is there a way...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "...to set text on the web with consistent leading amid footnote superiors, for every user?\n\n ![](http://web.archive.org/web/20131023204834im_/http:/typophile.com/files/Saccadeooblek_4585.jpg)\n\nThanks for any suggestions.\n\nCheers!\n\n",
  "author": "Emanual Dexterity",
  "time": "9 Mar 2009 — 6:45am",
  "uid": "2969",
  "comments": [
    {
      "time": "9 Mar 2009 — 6:48am",
      "content": "Maybe try the Unicode superscript code points (00B9 etc.,) rather than the HTML SUP tag.\n\nCheers, Si\n\n"
    },
    {
      "time": "9 Mar 2009 — 7:56am",
      "content": "Test:\n\nDavid Berlow entered the type industry in 1978¹ as a letter designer for the respected Mergenthaler², Linotype³, Stempel⁴, and Haas typefoundries⁵. He joined the newly formed digital type supplier, Bitstream, Inc⁶. in 1982. After Berlow left Bitstream in 1989, he founded The Font Bureau, Inc⁷. with Roger Black⁸.\n\n ![](http://web.archive.org/web/20131023204834im_/http:/typophile.com/files/IE7_4933.JPG)\n\nFallback from Georgia (esp the 6) looks pretty poor on this machine (Vista+IE7).\n\n"
    },
    {
      "time": "9 Mar 2009 — 8:26am",
      "content": "Ouch, but Thanks ¡¡Sii!! Why would anybody, (wikipedia in my example), use the SUP taginstead?\n\nAnd now, to perhaps answer myownquestion:\n\n ![](http://web.archive.org/web/20131023204834im_/http:/typophile.com/files/suptext_4079.jpg)\n\nSafari's display of Punchcut's site on a mac (top), seems to get 1, 2 and 3 from glyphs, and 4, 5 and 6 from scaling glyphs.  \nSii's Vista+IE7 (below) is rendering the 4 like bitmap and the 6 like another character's bitmap. ;)  \nSo, is that something the SUP (the original illustration), avoids... and if it only would get the leading into it's brain?\n\nCheers!\n\n"
    },
    {
      "time": "9 Mar 2009 — 8:57am",
      "content": "SUP, like the superscript option in most word processors will raise (and sometimes scale) the regular numerals. I'd imagine Wikipedia uses it because most system fonts don't contain a full set of the real thing\\* and because it's machine parse-able? There may be ways in CSS/HTML to lock leading, but my guess is that support will vary from browser to browser.\n\nLooking at the fonts on my machine, Calibri seems to have them all (Georgia does not), and the design and alignment seems consistent. Comparison with Outlook/Word's superscript option.\n\n ![](http://web.archive.org/web/20131023204834im_/http:/typophile.com/files/CaptureOutlook_6020.JPG)\n\n\\*not sure if this is their intended purpose.\n\n"
    },
    {
      "time": "9 Mar 2009 — 9:18am",
      "content": "Shooting from the hip, I believe you would have to set line-height to a specific fixed size for all inline elements within the block to work around this. Since most people set line-height, AKA bastardized leading, to relative em heights, it is sometimes difficult to accomplish.\n\nSomeone please correct me if I'm wrong, but I'm sure I'm right because I just did something like this.\n\nFor anything that requires Unicode, I make a specific HTML class to make darn sure that the fallback font is a full Unicode font. And even then it's iffy to get it to work because of the differences in browsers and OS.\n\n"
    },
    {
      "time": "9 Mar 2009 — 10:08am",
      "content": "DB -- FWIW, Firefox (2.0.0.20) seems to handle Si's Unicode sups a little nicer than your Safari. Not sure where it's pulling them from. Scaled Lucida Grande?\n\n ![](http://web.archive.org/web/20131023204834im_/http:/typophile.com/files/FireFox_sups_4806.png)\n\n"
    },
    {
      "time": "9 Mar 2009 — 3:41pm",
      "content": "Tracking. Thanks, gentlemen!\n\n"
    }
  ]
}
