{
  "id": "5566",
  "title": "Used books of interest",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "At a used bookstore just outside Philly, called Walk A Crooked Mile Books, I found some typophilic books that my be of interest to some of you.   \n   \n1. _This Fortunate Man: Edward DeWitt Taylor_   \nIt's a 1948 AIGA \"keepsake\", 1200 printed. It's a small, 32pg book, letterpress printed (I presume) by Stanford Univ. Press in Linotype Caslon Old Face and English Caslon (for the titling). It's only $10 and is in very good condition. Something for the AIGA completist. ![:-)](http://web.archive.org/web/20050525001848im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n2. _American Typestting Corporation Specimen Book_   \nIt's a tall, narrow book. Bound with a plastic comb binding, the cover's a bit worn, but the interior is in good condition. It has sections titled: Linotype, Monotype, Ludlow, Foundry, Copy Casting, along with an index. It's about 130 pgs, with 2 brochures from Bertsch + Cooper inside.   \n   \nThose 2 are interesting finds, but not anything amazing. The next book is very impressive.   \n   \n3. _Specimen Book of Type Styles: Mergenthaler Linotype Company_   \nThis is massive tome, around a foot wide and about 8 inches tall, was published in 1915. It has 1,078 pages of what appears to be _every_ bit of type Linotype had to offer. It's got a stamp in the front matter designating it 'Copy No. 138'. It's got a great hard cover that's well worn, but the interior is in very good condition. This is clearly a luxurious resource, because it features multi-color printing at various points, to showcase the multitude of layouts and design possibilities that the Linotype library can make possible. It also includes a comprehesive 'foreign types' section with Hebrew, Arabic, Armenian, Russian, 'German' (meaning blackletter) types, and others. The price on the interior cover is $200. I couldn't find an example of this publication on [Linotype.org](http://web.archive.org/web/20050525001848/http:/www.linotype.org/bibliography.html), so I don't have any info on it. I didn't have my digital camera with me, but I can go back and snap some shots if anyone would like. If I had the $$$, I'd buy it for myself. It's pretty astounding.   \n   \nHere's the info for the seller:   \n**Walk a Crooked Mile Books**   \nDevon at Gowen Street   \nPhiladelphia, PA 19119   \n215-242-0854   \n   \n(By the way, I'm not a representative of the store, I'm just posting this for the benefit of Typophile readers.)\n\n",
  "author": "crugen",
  "time": "Sat, 2004-07-10 15:29",
  "uid": "2172",
  "comments": [

  ]
}
