{
  "id": "55684",
  "title": "Otto Gotha",
  "forum": "jkstrong's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20130628074223im_/http:/typophile.com/files/original_3626.jpg)\n  \nOriginal\n\n ![](http://web.archive.org/web/20130628074223im_/http:/typophile.com/files/gotha_traced_4556.jpg)\n  \nComputer Edited\n\nYes, I believe it’s possible to make an image better once you’ve edited it on the computer, but there is also something about an image having a human touch that it makes it a bit more personal. Drawing by hand can be really good for practicing your drawing skills, but once you have that defined, crisp image on the screen, there’s something very fulfilling about that as well. Really my image is mostly enhanced by the consistency in shading that the computer offers. You can also create edges that are more defined. I chose a typographic piece from the German Art Nouveau section in our Typology text. I really enjoyed this era in art history, and so I wanted to incorporate this into my blog assignment. This piece specifically reflects the Jugenstil (the youth bohemian style) movement in Germany and was designed by George Auriol in the year 1900. I’m drawn to the organic, flowy movement of the art. This is just one of the many examples that I wish to emulate in my own art work.\n\n",
  "author": "jkstrong",
  "time": "9 Mar 2009 — 5:40pm",
  "uid": "41459",
  "comments": [
    {
      "time": "20 Mar 2009 — 4:33pm",
      "content": "Although your computer version looks as good as a scan from the textbook, I really love your original! I love the color variations of the marker and the black color. It has the feel of Chinese characters drawn in ink!\n\n"
    },
    {
      "time": "22 Mar 2009 — 8:14am",
      "content": "I love how true to form your rendition is, the only differences lie in the texture and subtle value gradients found in the original\n\n"
    },
    {
      "time": "23 Mar 2009 — 6:55pm",
      "content": "Well thank ya thank ya  \nJess\n\n"
    }
  ]
}
