{
  "id": "55691",
  "title": "\"moving text cannot be read\" (really?)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This experiment shows some text placed on a rotating helix. If you start to read from the top, your eye will follow the text and without paying attention, you will reach the bottom of the helix.\n\n[http://chronotext.org/lab/Babel.jnlp](http://web.archive.org/web/20131012224834/http:/chronotext.org/lab/Babel.jnlp)\n\nRequirements: Java (and the Georgia font) installed. The first time will be longer to load and at some point you'll have to \"trust\" Sun MicroSystems...\n\nIntructions: either watch and do nothing or drag your mouse horizontally to control spin. (You can try to double-click while saying amen as well...)\n\nThis is a follow-up to [this thread](http://web.archive.org/web/20131012224834/http:/typophile.com/node/55496) where some very categorical statement have been made regarding text in motion.\n\nYes, I think that this experiment is raising some interesting questions in the domains of art, design and information visualization. No, I don't think that some clear lines exist between the 3 mentioned domains.\n\nIs it possible to have a constructive discussion here, with mutual respect and doors left open?\n\nAriel  \n [http://chronotext.org](http://web.archive.org/web/20131012224834/http:/chronotext.org/)\n\n",
  "author": "arielm",
  "time": "10 Mar 2009 — 4:13am",
  "uid": "40421",
  "comments": [
    {
      "time": "10 Mar 2009 — 6:11am",
      "content": "_\"art, design and information visualization\"_\n\nI'm thinking if you want to reap meaningful and fruitful feed-back, it is still crucial for you to define exactly what it is you want this, primarily, to be/become. An art installation? A toy? Or a _tool_?  \nMaking this decision will influence how successful your \"experiment\" is / will be seen to be – what it will be judged as, and against. You say the lines between these fields are blurred; but I think at the very least, you need to prioritize your goals.\n\nThe following remarks are coming from a design/usability perspective.\n\n_\"If you start to read from the top, your eye will follow the text and without paying attention, you will reach the bottom of the helix.\"_\n\n1) It does look cool to me from an abstract, graphic design perspective. But this being text, my eyes want to read it.\n\n2) Immediately knowing where to start reading is not super-intuitive. That might seem stupid, but yes my eyes were confused for a moment.\n\n3) My eye must work differently from yours because (a) I get dizzy real quick when trying to focus on the text, which is not very pleasant, and (b) there is a hell of a lot of distraction / visual interference going on, which is annoying for the process of reading. I don't like having stuff move around in my field of vision when I'm trying to read, especially not high contrast stuff, and especially not other text.\n\n4) I think the controls need work. I got frustrated after exactly 6 seconds. How can I revert back after having double-clicked? I ended up restarting the application. Having no visible UI makes it even more of an \"experiment\", and definitely not a tool.\n\nI maintain my previous impression that it's fun in terms of being an artsy experiment, rather than something primarily meant to be \\*usable\\*.  \nIf it's your goal to make funky art, that's fine, have fun, go wild. But then don't call it \"design\" and \"information visualization\" if you're not prepared to get involved in what it takes to make \"design\" and \"information visualization\" _successful_ (which isn't the same as \"pretty\"). When you start arguing in these terms, do not be surprised when your work is measured by them; and at least in my view, in the _design_ game, you can't escape the usability/usefulness/readability discussion by calling up your grand artistic vision, or generally discarding the judiciousness of those who put up well-grounded arguments against the same.\n\n"
    },
    {
      "time": "10 Mar 2009 — 6:34am",
      "content": "Pretty much agree with Altaira.\n\nIt's fun to look at, but hell to read. I actually started to feel a bit queasy after a while (my eyes get easily tired). I lost the row and the text at the back confused matters even more, so I never made it to the end.\n\nI might be a bit old fashioned, but if the text is meant to be read I expect it to be relatively easy to read. There are exceptions, of course, but any text longer than a few words should be clear.\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:40am",
      "content": "Altaira, you're extremely serious (I'm adapting myself :-)  \nSo first, Thanks for the previous feedback!\n\n\\>I’m thinking if you want to reap meaningful and fruitful feed-back, it is  \n\\>still crucial for you to define exactly what it is you want this, primarily,  \n\\>to be/become. An art installation? A toy? Or a tool?\n\nIt started as a [processing experiment in the wild](http://web.archive.org/web/20131012224834/http:/chronotext.org/bits/029) more than 5 years ago. Then it was featured in a [commissioned work of art](http://web.archive.org/web/20131012224834/http:/chronotext.org/scriptorium) which is permanently exhibited side-by-side with the Dead Sea Scrolls in Jerusalem. Then it was reincarnated as a sketch for creating buzz around potential [iPhone toys](http://web.archive.org/web/20131012224834/http:/vimeo.com/3350149).\n\n\\>but I think at the very least, you need to prioritize your goals.\n\nIn parallel, I always dream of finding some more practical applications for the principle of \"helicoidal text\".\n\n\\>If it’s your goal to make funky art, that’s fine, have fun, go wild. But  \n\\>then don’t call it “design” and “information visualization” if you’re not  \n\\>prepared to get involved in what it takes to make “design” and “information \\>visualization” successful\n\nFor the purpose of reaching \\*usability\\*, I'm aware that I need to initiate a dialogue with actors from the various fields of design (interaction design, information visualization...)\n\nIf most of the feedback will be negative, if no one finds any seed of interest, nothing worth working on \"another round\" (we're talking about \"iterative design\"): then it's just fine with me.\n\nAs for the feedback received here up to this point:\n\n- I agree that the \"where to start reading\" point needs care.\n\n- Distraction / visual interference: right again, could be enhanced.\n\n- Dizziness: definitely, but that's a side-effect inherent to spirals (the principle of hypnotism...) Actually, I can see it as an advantage for reading metaphysical content. Maybe not a coincidence if Buddhist sacred texts are placed on spinable cylinders.\n\n- Controls need work: right (quick and dirty work as for now...)\n\nThe verdict is not that bad actually (room for another work iteration sometimes...)\n\n"
    },
    {
      "time": "10 Mar 2009 — 12:39pm",
      "content": "\\> without paying attention, you will reach the bottom of the helix.\n\nIndeed. But if you try to pay attention, you won't. :-/\n\nIt's fun for a few seconds, but that can't be enough reason. Don't you realize when you're reading it how slow -and hence annoying and uncomfrotable- it is? If you're not annoyed it's probably only because you made it yourself... People don't like going slow for no reason - they want the _content_, pronto. It's tedious because reading is very dynamic and \"interactive\" - for one thing it's not a smooth motion; plus it varies among people, especially with respect to age. Please check out this page for just a faint idea of strange reading is: [http://themicrofoundry.com/ss\\_read1.html](http://web.archive.org/web/20131012224834/http:/themicrofoundry.com/ss_read1.html \"http://themicrofoundry.com/ss\\_read1.html\")\n\nI'm really trying to be serious and constructive when I say that you can't subvert human nature to your artistic desires. Categorical? Saying humans can't digest tree bark is categorical too but if it prevents a restaurant from serving it that's a good thing.\n\nMake all the art you want, but it's not healthy to pretend it's highly _useful_ to many people. Now, if it turns you on, you should definitely keep doing stuff like this (and even showing it on Typophile if you like) but you should leave it to others to analyze/compliment the results, and don't expect everybody to cheer. Otherwise you won't get any useful feedback, and thus will not improve yourself and your work.\n\n--\n\nYou want to improve reading by using a dynamic interface? Try this, which I thought up many years ago: track the reader's focus, and make the word he's looking directly at sans serif with a large x-height, and the words to the right increasingly larger and with longer serifs and smaller x-height. And every time the reader saccades, the display changes. At first a reader will have trouble, but my guess is that the brain will quickly learn the trick, and you'll double reading speed, by doubling the average saccade distance. Sort of like using an atlatl.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2009 — 12:49pm",
      "content": "\\> I always dream of finding some more practical  \n\\> applications for the principle of “helicoidal text”.\n\nWhy?\n\nWhat are _other people_ dreaming of?\n\nBTW, I'm curious about something: how old were you where you started learning to read text set in the Latin script (presumably English)? I suspect it was at a young age, but I want to check. And how much English do you read regularly? On-screen or in print?\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2009 — 1:36pm",
      "content": "_Saying humans can’t digest tree bark is categorical too but if it prevents a restaurant from serving it that’s a good thing._\n\nSomebody stop [these people](http://web.archive.org/web/20131012224834/http:/www.balloonbuffoon.com/images/Cinnabon1.jpg)! ;-)\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:28pm",
      "content": "\\>BTW, I’m curious about something: how old were you where you started  \n\\>learning to read text set in the Latin script (presumably English)?  \n\\>I suspect it was at a young age, but I want to check.\n\nLol, I'm french, so I started to read in the Langue de Molière around 6 (note that my teacher in first grade was from Cameroun, even tough it was in Bagnolet, a suburb of Paris...)\n\n\\>And how much English do you read regularly? On-screen or in print?\n\nEndless quantities of english, hebrew and french. Left to right. Right to left. On screen, on books and magazines, on comics, on mysterious Bible codices, on 2000 year-old parchment rolls and even on fragments of broken pottery.\n\nDefinitely, I am fascinated by the history of writing.\n\nThat's it...  \nI don't want to convince anyone here of something in particular. My only \"public agenda\" is to make software experiments on text and exchanging ideas on the topic, for the fun of it.\n\n"
    },
    {
      "time": "10 Mar 2009 — 3:20pm",
      "content": "I actually found it surprisingly easy to read the text as long as one doesn't attempt to skip parts and stays on the line.\n\nHmm... this'd make an excellent way of viewing Trajan column.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131012224834/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "10 Mar 2009 — 3:53pm",
      "content": "Ariel, thanks for explaining your reading background. I was trying to see if perhaps you read English less fluently than Hebrew, and that was why you're possibly not annoyed by spiral moving text (in English).\n\nWill you have time to address my other points?\n\n\\> as long as one doesn’t attempt to skip parts\n\nExcept that's not \"skipping\". You're simply  \nfeeling your reading system _trying_ to go faster.\n\n\\> this’d make an excellent way of viewing Trajan column.\n\nThe spiral on the Trajan column shows images, not text.  \nThe text is flat.\n\n--\n\nSo the question is, how useful is it really to  \nsacrifice so much performance, for what gain?  \nWhen is the great discomfort caused to most  \nreaders of benefit? What is meaningful about  \nthat \"helicoidal\" vehicle?\n\nThese are the types of questions a designer would ask.\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2009 — 5:43am",
      "content": "\"So the question is, how useful is it really to sacrifice so much performance, for what gain?\"  \nWell, I don't think reading lots of moving text is a good idea either. But since I first saw Muriel Cooper's work, I thought that type in space would be a much sweeter interface than windows are. And getting from one place to another among of type elements in space, whereby the type moves you from one place to another, perhaps reading as you go, that I think is cool. In addition, I think it has more application for touch screen interfaces than mouse driven ones.\n\nCheers!\n\n"
    },
    {
      "time": "11 Mar 2009 — 7:23am",
      "content": "\\>Hmm... this’d make an excellent way of viewing Trajan column\n\nGreat idea indeed! I remember once standing near the column in Roma, more busy being mad at the Romans for inventing the principle 2K years before myself than thinking of practical applications :-)\n\nSo thanks oprion, there's nothing like a free and associative dialogue between creative people (no matter how you call them: scientists, designers, artists, intellectuals, avant-guardistes, all of this at the same time, etc.)\n\nThat is part of what's meaningful, as far as I'm concerned.\n\n\\>So the question is, how useful is it really to sacrifice so much performance,  \n\\>for what gain?”\n\nWorking with Adobe CS4 suite to design stuff can also be considered as a great sacrifice of performance but who cares, with today's computers? And actually, the experiment featured here is backed-up by OpenGL (hardware acceleration for free), eating a very few processor cycles.\n\n\\>But since I first saw Muriel Cooper’s work, I thought that type in space  \n\\>would be a much sweeter interface than windows are\n\nBingo! Muriel Cooper is one the pioneers to \"blame\". She started with all this at the M.I.T with the \"Visible Language Workshop\", then came John Maeda and his \"Aesthetics and Computation Lab\", then 2 of this students -- Fry and Reas -- came out with Processing.\n\nAnd then... an invasion of hybrid software experimentators :-)\n\n"
    },
    {
      "time": "11 Mar 2009 — 9:49am",
      "content": "\\> I first saw Muriel Cooper’s work, I thought that ...\n\nI certainly agree that human interfaces can benefit a lot from breaking the current boring metaphors.\n\n\\> there’s nothing like a free and associative dialogue between creative people\n\nAgreed. There's also nothing like a designer thinking on his own how to help other people.\n\n\\> Working with Adobe CS4 suite ... eating a very few processor cycles.\n\nI'm sorry but this is quite telling... You're always thinking on the side of the creator, not the user. I was actually talking about the user's reading performance! :-/\n\n--\n\nWill you have the time to address my idea about a dynamic reading interface?\n\nOr should I ask: will you have the inclination to listen to more than mere praise?\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2009 — 12:15pm",
      "content": "I read it easily. I found it curious and my mind tried to make sense of it within the first few seconds. Then I just started on the top and followed the line all the way down. After that, I allowed myself to just stare at it as a whole. Pretty easy to filter out everything but the word you're currently on. This is really interesting and look forward to different applications of it.\n\nI'm curious, have your read about how we read?  \n [Check it out](http://web.archive.org/web/20131012224834/http:/themicrofoundry.com/ss_read1.html)\n\ndaniel\n\n"
    },
    {
      "time": "11 Mar 2009 — 1:37pm",
      "content": "\\>Agreed. There’s also nothing like a designer thinking on his own how to  \n\\>help other people.\n\n\\>I’m sorry but this is quite telling... You’re always thinking on the side  \n\\>of the creator, not the user.\n\nhrant, let's face it: your reactions are also \"quite telling\" about yourself (infinite loop here...)\n\nBut it's not the point, we're not on war as far as I know. I'm sure there will be a place for both of us in the Pantheon of People that Influenced the History of Reading.\n\n\\>Will you have the time to address my idea about a dynamic reading interface?\n\nIf you talk about the \"how we read\" page, I was there: it looks very promising and I definitely respect this kind of research. I can't address it much for now because I'm not a very academic nature (need more time for digestion and assimilation, if you prefer...)\n\nThe way I'm \"assimilating\" would be more like taking this material as input on a long creative trip and to come out with a crazy mutant work, one that would hopefully help making some progress (as far as one doesn't look always only at the 1st degree of things...)\n\n"
    },
    {
      "time": "11 Mar 2009 — 8:17pm",
      "content": "\\> I’m sure there will be a place for both of us in the Pantheon of People ...\n\nLet's be practical: you need to find your place here.  \nI'm not trying to be mean - the benefit of this place  \nstems largely from its strong focus on functionality;  \nthat's what makes it... functional! :-)\n\nMaybe it's too far of a stretch for you, but I'm glad  \nto see you're trying, and I wish you luck. We're all  \nslaves to our respective natures, and our most  \nchallenging and significant battles are internal.\n\n\\> If you talk about the “how we read” page\n\nActually I was talking about something that does  \nstem from that, but specifically it was the last  \nparagraph in my first post in this thread.\n\n\\> I’m not a very academic nature\n\nWell, that's a problem, because the human animal  \nis very complex. Actually I'm not as academic as I  \nneed to be. You should know that I've been accused  \nby some of relying on \"wooly\" logic. To those people  \nyou must be Yeti! :-)\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2009 — 7:41pm",
      "content": "Oooh dear... I think I'm going to throw-up. The rotating column of text is quite lovely to look at, but really motion sickness-inducing to read.\n\n"
    },
    {
      "time": "12 Mar 2009 — 2:04am",
      "content": "\\>Oooh dear... I think I’m going to throw-up.\n\nAnd it's just the appetizer! A couple of years after placing text on a rotating helix, I made this series: [http://chronotext.org/Isaiah](http://web.archive.org/web/20131012224834/http:/chronotext.org/Isaiah) (try \"laser guided\" for instantaneous faiting ;-)\n\nUsually, the feedback from people varies between mesmerization and sickness. But of course the purpose of the work is far more to be an exploration than to harm anyone.\n\n\\>the benefit of this place stems largely from its strong focus on  \n\\>functionality; that’s what makes it... functional! :-)\n\nI agree that my work is mainly around aesthetics and computation, which makes senses when you're an artist and a programmer. Functionality is not my primary goal, but I will probably address the subject sometimes.\n\nIf I had to choose between 1st degree functionality like you are suggesting here and \"how we interact with text\" at the broader sense of interaction design, I will probably pick the second option.\n\n\\>Actually I was talking about something that does  \n\\>stem from that, but specifically it was the last  \n\\>paragraph in my first post in this thread.\n\nSmart guy! You knew that by using strange words like atlatl you would finally end-up catching my attention :-)  \nNow seriously: it looks like a great starting point for a great experiment. You should find an investor, build-up the right team and go for it (you have a startup!)\n\n\\>We’re all slaves to our respective natures, and our most  \n\\>challenging and significant battles are internal.\n\nI agree. And it applies to all of us. For example, if you had to create a startup on the basis of your idea, it would definitely be a stretch for your nature, no?\n\nThe Yeti, with a sarbacane\n\n"
    },
    {
      "time": "12 Mar 2009 — 3:27am",
      "content": "_I agree that my work is mainly around aesthetics and computation, which makes senses when you’re an artist and a programmer. Functionality is not my primary goal, but I will probably address the subject sometimes._\n\nWhich may mean Typophile is not the perfect place to turn to for feed-back.  \nBut thanks at least for clearing up that your experiments are not wanting to be tools.\n\n_\"I’m sure there will be a place for both of us in the Pantheon of People that Influenced the History of Reading.\"_\n\n:-\\> This is cute.  \nThe way you're going, I think you may well get into some Pantheon of People that Made Exciting iPhone Experiments, or maybe that of People Who Made Text Look Cool. And I know some artists can be ahead of their time and/or misunderstood by their audience; but I don't think you can expect to come close to touching the History of Reading as long as you don't learn about the intricacies of the reading process, and don't think from the user.\n\n"
    },
    {
      "time": "12 Mar 2009 — 6:35am",
      "content": "\\>I think you may well get into some Pantheon of People that  \n\\>Made Exciting iPhone Experiments, or maybe that of People  \n\\>Who Made Text Look Cool\n\nSlow down on 1st degree interpretation please...  \nTo place the \"Pantheon of People\" trick into context: it was mainly used to remind hrant that there's enough room for our two respective voices in the broad dialogue on reading that takes place all over the world.\n\n\\>Which may mean Typophile is not the perfect place to turn to  \n\\>for feed-back.\n\nAgain in the lines of that what you and hrant think. But are you the only voices out there? Besides, nothing to fear of: I don't have any plans to conquer the whole typophile.com land or even to make a small putsch.\n\n\\>I don’t think you can expect to come close to touching the History  \n\\>of Reading as long as you don’t learn about the intricacies of the  \n\\>reading process, and don’t think from the user\n\nYou know what? I think you're looking at the topics of Reading and User Experience from a very narrow point of view (and it brings us back to the beginning of that [other thread](http://web.archive.org/web/20131012224834/http:/typophile.com/node/55496)...)\n\nWhat would you create if you were commissioned by the home of the Dead Sea Scrolls (the most ancient fragments of the Bible) to create an installation featuring the same thousands year old text projected on a big wall and destined to be \"experienced\" by the visitors, just after they saw the original parchment fragments?\n\nThis is what I created: [http://chronotext.org/scriptorium](http://web.archive.org/web/20131012224834/http:/chronotext.org/scriptorium)\n\nAfter almost 3 years on public exhibit, I can tell that in term of \"user experience and reading\": some people really get immersed into it, other find themselves playing at recognizing passages from the Bible... I'm really not the best orator for describing the work, but it does have an impact on people, for sure...\n\n"
    },
    {
      "time": "12 Mar 2009 — 6:44am",
      "content": "\\> 1st degree functionality\n\nActually, as any text face designer will tell you, even the strictest text face has some personality, which can only come from its creator. As human beings, we can't help expressing ourselves; the issue is, do you make self-expression a purpose, or do you treat it as a quiet companion.\n\n\\> if you had to create a startup on the basis of your idea,  \n\\> it would definitely be a stretch for your nature, no?\n\nDo you mean creating a startup? Yes it would.  \nI've done it once, but then the internet scene imploded.\n\n\\> sarbacane\n\nNice.\n\n\\> are you the only voices out there?\n\nNo, but this _is_ what Typophile usually sounds like.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2009 — 7:06am",
      "content": "Ariel, I'm very interested in this from an information visualization, microscreen and readability point of view.\n\nAs a reading science sleuth I found the babel experiment very interesting. By fixating steadily at a point in the text the text moves easily through the foveal field and the foveal field is drawn slowly through the helix. Parafoveal vision is kept intact; that is, it isn't disabled as in RSVP presented text. So I think this engages and plays with the perceptual mechanics of reading quite effectively. I don't think this is like scrolling credits at all. I found sense-following to be effortless and enhanced by the underlying text presentational metaphor.\n\nI did find the show-through from the intersecting text from the back of the helix distracting and felt it needs to be knocked back at the point where the eye is fixating. This might require a device to monitor eye position. Also monitored could be eye movements so the speed of the rotation can be adjusted to the individual's reading speed. This could prevent saccading forward.\n\nOn microscreens your paradigm could be prove functional I think, and in terms of interpretive typography, your experiments are historically interesting and very smart. Think of Apollinaire's Calligrammes for instance.\n\nWho said this: \"Typography is not a police state.\" And doesn't John Hudson say \"readerability\" is quite elastic? I for one embrace what you are doing. But then I think the experiments of David Carson have a place in the historical pantheon as well. It's not just shrapnel. I say Bravo!\n\n"
    },
    {
      "time": "12 Mar 2009 — 7:22am",
      "content": "Peter: _And doesn’t John Hudson say “readerability” is quite elastic?_\n\nThat may give the wrong impression. It may be elastic, in the sense of accomodating new things by stretching, or it may simply be massive and we have yet to identify the limits of what it can accomodate. I'm not sure which, but instinctively I lean toward the view that it is massive.\n\nI do think horizontally scrolling text can be comfortably readable because, as you note, it provides for a constant fixation through which all the text moves, removing the need for saccades and hence for regressions. The application to microscreens is an interesting idea. What I found uncomfortable in the Babel spiral were the amount of stuff around the fixation and in the background and the top to bottom movement. The spiral is a nice piece of art, but from a 'reading moving text' perspective, a simple horizontal scroll through a limited field would be more interesting and revealing.\n\n"
    },
    {
      "time": "12 Mar 2009 — 7:42am",
      "content": "John, a single horizontal line of moving text deprives the reader of a sense of the lexical structure of the text, which is an important part of the cognitive processing side of reading. Books give it in their print domain. I like that the experiments address this.\n\n"
    },
    {
      "time": "12 Mar 2009 — 7:46am",
      "content": "_\"horizontally scrolling text … provides for a constant fixation…, removing the need for saccades and hence for regressions\"_\n\nNot knowing enough about the science of this, I wonder about it from a \"user perspective\": I noticed my eyes were still having to make regressions, and sometimes wanted to jump ahead faster than the text was scrolling, too. Also when reading static text, I _can_ try to make my eyes move continuously, but it seems to hinder optimal retaining of content.  \nIs there really such a thing as fixed-speed, continuous reading without saccades? And does it require the reader to (semi-)consciously use a certain technique?\n\n"
    },
    {
      "time": "12 Mar 2009 — 8:28am",
      "content": "\\>Ariel, I’m very interested in this from an information visualization,  \n\\>microscreen and readability point of view\n\nThanks... If you have an iPhone (\"microscreen\" enough?), I could send you some demos to play with (the offer is for everybody else interested as well...)\n\n\\>Think of Apollinaire’s Calligrammes for instance\n\nIn one of the poems called \"liens\" (\"chains\"), there is even a verse about \"Towers of Babel changed to bridges\" ;-)\n\n\\>I did find the show-through from the intersecting text from the  \n\\>back of the helix distracting\n\n\\>Also monitored could be eye movements so the speed of the rotation  \n\\>can be adjusted to the individual’s reading speed\n\nI could try a new version with highly dimmed background text and maybe with an overall cylindrical shape (instead of the current conus) so that rotation speed is at least constant.\n\nFinally, and without monitoring eye movements (low tech here...), I could also plug-in a keyboard (left / right) rotation-control scheme (have one in stock from a previous experiment, reminding the tool used by potters -- \"tour\", in french...)\n\nComing soon...\n\n"
    },
    {
      "time": "12 Mar 2009 — 8:34am",
      "content": "Tracking.\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:04am",
      "content": "\\> By fixating steadily at a point in the text the text moves easily through  \n\\> the foveal field and the foveal field is drawn slowly through the helix.\n\n1) You're wasting the parafovea.  \n2) The reader needs to control the [non-smooth] motion.  \n3) It doesn't need to be a helix (except to please the creator).\n\n\\> This might require a device to monitor eye position.\n\nYup. And if you follow this train of thought to its terminus you arrive at what I describe above.\n\n\\> I noticed my eyes were still having to make regressions\n\nYup. It's a natural part of reading. Without regressions reading cannot be efficient, because you're blocking the brain's powerful intelligent guessing ability. Of course regressions are not efficient per se, but they are evidence that something quite efficient is happening deep down. Basically, you're not going fast enough if you don't bump the curb sometimes.\n\n\\> Is there really such a thing as fixed-speed, continuous reading without saccades?\n\nNobody has ever seen that happen.\n\nThe eye can only smoothly follow a moving object, and if you have to perform a saccade from one part of a moving object to another (noting that a text is really one thing) you're much more likely to miss.\n\n\\> I could also plug-in a keyboard\n\nUsing the mouse (just the left-right axis) would be better; you might also use the left button for a regression. The problem is that no matter what you use you're moving a function from the subconscious realm to the conscious - that will not be pretty. It's like when a doctor asks a patient to \"breathe normally\" - the result is never normal!\n\nOn top of that, speed isn't even really what's at play. :-/ Saccade distance is highly variable (and sometimes backwards!), both between individuals and with one individual depending on so many variables. If the line must move, it must do so in tune with the jerky needs of the reader's visual cognition. This is very difficult to pull off.\n\n--\n\nFrankly, in the design field this is called a solution looking for a problem. Experimental art can be quite useful to society, but you need to gauge your dedication to moving into the functional realm. If you try to sort of make it more functional I fear it will still not be functional enough, and all you will do is detract from the art.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:16am",
      "content": "\\> a single horizontal line of moving text deprives the  \n\\> reader of a sense of the lexical structure of the text\n\nBut a helix (or really any such shape) is irrelevant there.\n\nIf you want to convey macro structure (which I agree is useful sometimes, although not always) what you might do is have large -perhaps colored- shapes sitting above and below the reading like, passively telling the reader what chapter etc. he's on - they do this in the mental background, where it belongs. The actual text should still be a single uncluttered line (two max).\n\nThe structure of a book for example is not really highly optimal - it arises not least from the needs of our arms and hands, which are irrelevant for reading per se.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:37am",
      "content": "This may not be quite so special, despite its brilliance.\n\nIsn't it like every project where a designer decides to insert a little _difficultas_ into the layout, departing from the comfort of convention, in order to challenge the reader, with the promise of reward that comes from successfully negotiating the puzzle?\n\nIt's best if there is some payback other than mere decipherment of text, and this is the sense of purpose, the recognition of meaning that comes from deciphering the designer's graphic metaphor. I say deciphering, but it's unlikely to be laborious, more like a flash of insight--you get it, or you don't.\n\nAlso there is a sense of participation, of belonging, that comes from immersing oneself in the style of a cultural artefact.\n\nSo, an example in a magazine may be the deck that's set with negative leading throughout. A little harder to read, but providing a frisson to the publication.\n\nSuch creativity has a low percentage of success in the wrong hands--and with copy (content) that is less than riveting. I've done challenging designs in the past which I thought were really cool, and perhaps other graphic designers thought so too. But we weren't the target audience, and I can look back at that stuff now and be sure nobody got past the first word. Nonetheless, designers have to take chances, to find the sweet spot that is different enough to be interesting, but not too difficult to negotiate, or else their work will suffer the opposite fate of being too dull to register with potential readers.\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:45am",
      "content": "_Nonetheless, designers have to take chances, to find the sweet spot that is different enough to be interesting, but not too difficult to negotiate_  \nYes, as do artists!\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:50am",
      "content": "I made a new version, FWIW.  \nThis is \\*just\\* experimentation after all:\n\n[http://chronotext.org/lab/Babel2.jnlp](http://web.archive.org/web/20131012224834/http:/chronotext.org/lab/Babel2.jnlp)\n\nAs promised:  \n- reduced noise  \n- cylindrical structure  \n- finer control on spin\n\n- Use the right or left arrow keys to control spin (switch back and forth between the 2 keys until you become a master of inertia...)  \n- Use the space key to brutally stop motion...\n\n"
    },
    {
      "time": "12 Mar 2009 — 10:27am",
      "content": "\\> It’s best if there is some payback other than mere decipherment of text\n\nGenerally it's best if the text is easily deciphered!\n\n\\> designers have to take chances\n\nIndeed. But being designers, functionality needs to be much more important than expression. For example one might put an open-bottom binocular \"g\" in an otherwise conservative font - that's a risk, but hopefully one backed up by a functional belief.\n\n(Ariel, I'll look at the new version soon.)\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2009 — 11:42am",
      "content": "it's funny. first they tell you it has to be functional.\n\nthen they say you can't make it functional enough.\n\nthen they say \"well, there's nothing special here\".\n\nbut of course, if there wasn't, they wouldn't post.\n\nkeep up the good work, ariel.\n\n-bowerbird\n\n"
    },
    {
      "time": "12 Mar 2009 — 12:19pm",
      "content": "Ariel, the new iteration is a big improvement. Could you try a mouse-controlled one, and with a finer stepping of speed?\n\nReading speed/comfort is much improved, surely because the reader controls the rotation speed. However I found myself exerting a lot of conscious effort to keep going, detracting from real understanding of the text; even though I was reading the words without too much trouble, when I asked myself to repeat what I had read, I couldn't. Having to use an input device is a big part of that I think (see below). Now, if it's a text that people already know the essence of, that's not so bad. Just like when you go to the opera, you know what's going to happen, but you still enjoy it, and it means something different (and possibly better) than reading a print version of an opera you don't know.\n\nSo you could say there needs to be a balance between conscious control and immersion. I think if you could figure out a way to have a single button control the motion effectively, that would be the most immersive (other than stopping the motion entirely :-). Maybe make the space bar\\* like a gas pedal, so holding it down speeds things up\\*\\* and letting it go slows things down. So if you feel like you're having trouble keeping up, you let go, wait a second, and saccade backwards\\*\\*\\* to catch up.\n\n\\* Or actually a smaller key to reduce resistance.\n\n\\*\\* Ideally up to a maximum pre-determined speed according to the reader's expertise. Or you might even intelligently guess at a good maximum dynamically based on the \"gas-down\" percentage! That would be great.\n\n\\*\\*\\* Not the same as a regression here however.\n\nAnd something minor: when I get to \"Shimar\" my eyes involuntarily jump back to the beginning, then I have to scramble back down-left, hitting the brakes. This must be because vision is attracted to moving things, and the beginning of the text stands out when it suddenly comes back in from the right. And this should be the case with virtually everybody (although at slower speeds it might be OK). I can't think of how best to solve this, because the display doesn't [need to] know where you you are in the text.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2009 — 12:20pm",
      "content": "_then they say “well, there’s nothing special here”._\n\nBirdy, I am not \"they\"  \nAnd that's not what I said.  \nFly away, jerk.\n\n"
    },
    {
      "time": "12 Mar 2009 — 12:42pm",
      "content": "ariel-\n\n\"readability\" may be the raison d'etre in these forums,  \nbut that's not going to be the situation for everything...\n\ni can see your experiments being used in music videos,  \npoetry visualizations, and a multitude of other places...\n\ni can even see ad agencies slurping them up, meaning  \nyour \"art\" projects could end up making you money...\n\nit looks like you're finally getting some useful feedback,  \nbut keep in mind that there's a whole big world out there.\n\n-bowerbird\n\n"
    },
    {
      "time": "12 Mar 2009 — 12:53pm",
      "content": "\\> it looks like you’re finally getting some useful feedback\n\nConsider why you failed to.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2009 — 12:58pm",
      "content": "I wonder which would be more comfortable to read:\n\n1) a text moving at constant speed (alterable by reader control) as you have; or\n\n2) a text moving at speeds that vary based on changing content (also overall alterable by reader control). I'm thinking of changes (based on theory or experiment) like:  \n- speed set per syllable rather than horizontal width (so \"through\" and \"so\" would pass by at the same rate; and \"amy\" would pass more slowly than \"yam\")  \n- slower at spaces (\"nevermore\" would be faster than \"never ore\")  \n- slower at punctuation like commas, periods, colons.  \n- slower with more complex syntax or vocabulary.\n\n(Many of these ideas are based on cadence of reading aloud - I recognize they may not translate to considerations of silent reading unproblematically.)\n\nIn other words, would the reader find a changing speed based on educated guesses of their own needs more, or less, annoying?\n\n"
    },
    {
      "time": "12 Mar 2009 — 1:07pm",
      "content": "bowerbird, thanks for the feedback and the spirit, and definitely: I can see the big world out there.\n\nI'm also sometimes confused by the reactions. Creative fight-back is what helps me the most to cope with all this.\n\nConcerning the feedback on the 2nd version of the experiment: great indeed to receive some practical input!\n\nLet's see where all this goes (noise of digestion and assimilation in the background...)\n\n"
    },
    {
      "time": "12 Mar 2009 — 2:09pm",
      "content": "hrant said:  \n\\> Consider why you failed to.\n\num, it's not about me.\n\n(or you, for that matter.)\n\nhave a hard time staying on-topic, don't you?  \nthat's ok. a little a.d.d. is a good thing, i say...\n\n-bowerbird\n\n"
    },
    {
      "time": "15 Mar 2009 — 12:32pm",
      "content": "\"As promised: - reduced noise - cylindrical structure - finer control on spin\"\n\nI like to make it go fast!\n\nCheers!\n\n"
    }
  ]
}
