{
  "id": "55703",
  "title": "Ultimate typography challenge: Designing using Arial and Times New Roman for designers",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everyone here on Typophile: I am working on this design assignment that has a strong social-political statement dealing with our difficult economic situation as designers. It's in a time like this, being resourceful and recycling resources is a common trend for designers. I am thinking going \"all the way\" with this political statement by typesetting this project in default system faces with Times New Roman and Arial. Knowing that this would be a huge challenge, since many folks would agree these two faces are the most difficult to work with (right up there with Comic Sans and Hobo...)\n\nCan somebody suggest what they think about this? Since the audience for this piece will be for the design industry. Also anybody tried to work with these two faces and come up with very good result? Tips on how to work around their physical limitations will be be also appreciated!\n\nI am thinking going a bit of an experimental route now... Thanks\n\n",
  "author": "weihengtang",
  "time": "10 Mar 2009 — 7:54am",
  "uid": "29011",
  "comments": [
    {
      "time": "10 Mar 2009 — 8:07am",
      "content": "As a political statement using Mac and Windows system fonts seems like a missed opportunity. Why not use some of the quality free and open source fonts out there. That would send a stronger message IMHO.\n\n"
    },
    {
      "time": "10 Mar 2009 — 8:14am",
      "content": "Hey Sii! That's a great opportunity. Can you suggest a few solid ones?\n\n"
    },
    {
      "time": "10 Mar 2009 — 8:16am",
      "content": "I wouldn't say that they're difficult to work with. They actually compliment each other fairly well. They're harder to make UNIQUE, of course, given their ubiquity.\n\nFor a super challenge, incorporate MS Word clip art. ;o)\n\nI'm stuck with Arial as our corporate face at my current gig. I've actually warmed up to it for use online. I spent some time at 3M which was Helvetica + Times and even though I griped and whined about it at the time (being a pretentious intern) in hindsight, they manage to do just fine with those two faces.\n\n"
    },
    {
      "time": "10 Mar 2009 — 8:26am",
      "content": "During your presentation, see if you can work in the phrase:\n\n_'Tis a poor craftsmen that blames his tools._\n\nMy Grandfather (Wilmot Dean) used to say that to me.\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:18am",
      "content": "Why not show some solidarity with your brother and sister (type) designers, and use new fonts from independent foundries, not ones designed many years ago and owned by corporations (Monotype and Microsoft).\n\nIf you take the idea of re-use to its logical conclusion, you will end up with default system design that puts yourself out of work, as clients will be quite happy to re-use old layouts and concepts, for instance templates that came bundled with their software, set in, uh, Arial and Times....\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:40am",
      "content": "<cite>…many folks would agree these two faces are the most difficult to work with…</cite>\n\nAnyone who considers TNR or Arial difficult to work with isn’t worth listening to. TNR is a dead-simple text face, there is no reason it should be any harder to use than Adobe Caslon. Which is probably why it’s still incredibly popular for paperback books. As for Arial, once one gets past the really deformed characters, Arial is a very usable sans available in five weights, three widths, with monospaced and rounded versions. If you have trouble using that one it’s time to head back to Typography 101 and do the damned homework this time around.\n\nEnough with the Arial/Time bashing. You’re a student, not a bitter old designer; you should be focusing on the better options! Your work will be more interesting and useful to others if you work with the Cleartype fonts that ship with Vista and MS Office (and can be obtained for other Windows for free by installing the latest Powerpoint viewer). Or you could cover good low-cost fonts, such as Museo and Museo Sans, or the $9 versions of Nick Shinn’s paradigm family. Try being creative instead of just digging up the old Times/Arial dirt that everyone has already seen and heard a million times.\n\n"
    },
    {
      "time": "11 Mar 2009 — 4:03pm",
      "content": "Or buy single weights of typefaces. Usually they sell for something like 30 euros or similar. Even a designer on a budget can buy that. :)\n\n"
    }
  ]
}
