{
  "id": "55705",
  "title": "Font Project for school",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hey guys, my name is Adam Jones, I'm a second year student and I'm working on a typeface design project for school. So this is the typeface I'm working on for school, currently these are all the letters I have finished in vectors and am moderately happy with.\n\nThe sketch at the bottom is what I've based the lower case off of.\n\nAny criticism would be a appreciated. Be ruthless.\n\n[sample image](http://web.archive.org/web/20150417124520/http:/img.photobucket.com/albums/v642/AdamJones0405/letters.jpg)\n\n",
  "author": "AdamJones87",
  "time": "10 Mar 2009 — 8:17am",
  "uid": "26627",
  "comments": [
    {
      "time": "10 Mar 2009 — 8:33am",
      "content": "read 'the stroke' by Gerrit Noordzij\n\n"
    },
    {
      "time": "10 Mar 2009 — 8:39am",
      "content": "Could you tell us the main usage your font is intended for?  \nIt's so geometrical and sharp that it would help to start analyzing.  \nThanks,\n\n**MarS**\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:20am",
      "content": "I suppose originally when I sketched out the G I had envisioned it for use with large amounts of text/body copy. I think the idea I had in my head was a old style typeface with some modern mixed in. Now as I keep looking at my original sketch vs. what I've done with the lower case, it seems to have moved away from my original style.\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:16am",
      "content": "I think there's potential here for a logo or display face, not a text face. Of course it gets harder now, moving beyond the ball-and-stick letters. I would start sketching letters like fksvwxz before going too far with perfecting these.\n\n(Serif to the left at the top of i and l and to the right at the bottom would seem more natural to me.)\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:20am",
      "content": "I like the \"G\", but not the lc.\n\nBTW, do read GN's writings, but keep a large bag of salt next to you.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:31am",
      "content": "_I think there’s potential here for a logo or display face, not a text face. Of course it gets harder now, moving beyond the ball-and-stick letters. I would start sketching letters like fksvwxz before going too far with perfecting these._\n\n(Serif to the left at the top of i and l and to the right at the bottom would seem more natural to me.)\n\nYea, it has definitely moved away from what I wanted it to look like. I've started working on my sketches for the other letters and I've pretty much hit a wall with it. So I'm meeting with my prof tomorrow to discuss what I can do and get myself on the right track.\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:35am",
      "content": "Body text –I suppose you think of printing purposes– has some usual guidelines you should go through, especially about metrics, strokes contrast and weight, counters, serifs and figure proportions.  \nI agree with you that the initial result has nothing to do with the original sketch –BTW, it seems more interesting, and it would be the most if it was even rougher.  \nOne more thing: **trust your eyes** better than geometry and math measurements; they can find here and there where strength and weakness are; type design seems to be a matter of modelling and shaping –in the sense of sculpting– more than of building.\n\n**MarS**\n\n"
    },
    {
      "time": "10 Mar 2009 — 9:33am",
      "content": "_I like the “G”, but not the lc._\n\nBTW, do read GN’s writings, but keep a large bag of salt next to you.\n\nhhp\n\nhaha, I will have my bag of salt at the ready.\n\n"
    },
    {
      "time": "10 Mar 2009 — 11:34am",
      "content": "One very important thing here is that the Latin caps and lc can never really be too compatible, so you can't move too much of what's promising from one set to the other, unfortunately.\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2009 — 3:43pm",
      "content": "Reading 'The Stroke' is a good idea, and personally I wouldn't bother too much with the salt. Hrant doesn't like the theories described in it, but I did. Plus, using the very same theories as a basis, the students at Type & Media keep designing very nice typefaces.\n\n"
    },
    {
      "time": "11 Mar 2009 — 5:19pm",
      "content": "Yes, very nice, salable typefaces. Kudos to them - that's no mean feat. But they are also very _safe_ typefaces\\*, and not the way forward culturally. Something like Legato is.\n\n\\* Except for Klimax - that's awesome.\n\nThe reason I dislike so-called \"ductal logic\" isn't because of anything emotional\\*; it stems from my understandings surrounding reading. They may be wrong, but at least I have some and I use them as a basis, instead of the other way around (if that).\n\n\\* I can't say the same for GN.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2009 — 11:07am",
      "content": "Yeah, I understand your reasons, and I agree with them in a way. Especially when seeing something like Legato. But I also have a soft spot for typefaces which have that ductal logic very strongly, I don't know why, I just do. ;) That has nothing to do with legibility/readability, but purely aesthetics.\n\n"
    },
    {
      "time": "12 Mar 2009 — 11:34am",
      "content": "\\> I also have a soft spot for typefaces which  \n\\> have that ductal logic very strongly\n\nActually I do too (I once bought Ex Ponto to use on my wedding invitation). And I think that's a very human preference, and one that has a relevant place in display setting. But for text face design, I have to force myself to see the problem.\n\nhhp\n\n"
    }
  ]
}
