{
  "id": "55715",
  "title": "Graphic Designer Erik Nitsche",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am trying to write an essay on Erik Nitsche but I am finding I have little information to work with...  \nAny Ideas?\n\n",
  "author": "Wording",
  "time": "10 Mar 2009 — 10:32am",
  "uid": "40276",
  "comments": [
    {
      "time": "10 Mar 2009 — 10:49am",
      "content": "Have you [Googled](http://web.archive.org/web/20130629052030/http:/www.google.com/search?client=safari&rls=en-us&q=erik+nitsche&ie=UTF-8&oe=UTF-8) his name?\n\n"
    },
    {
      "time": "10 Mar 2009 — 11:41am",
      "content": "Yes, I found a lot of images and work of his, but there aren't many Nitsche dedicated pages.  \nThere is an essay or two, mostly based around his work, I would like to find some things about his family or something about what his personality was like.\n\n"
    },
    {
      "time": "11 Mar 2009 — 3:59pm",
      "content": "Have you tried a library or something like that. Books?\n\nOr did you only unsuccesfully use Google and then decided the information does not exist? ;)\n\n"
    },
    {
      "time": "12 Mar 2009 — 1:59am",
      "content": "Well, there are a few books in my school that i was going through but i couldn't find anything on him. That is why I made this post :) If anyone has read anything about him in books, I wanna know what books. I know that the information exists, I just wanna know where before I spent 18 hours walking around looking through anything and everything.\n\n"
    },
    {
      "time": "12 Mar 2009 — 8:12am",
      "content": "Ask your librarian if the school has access to the _Design and Applied Arts Index_, a database that covers many art and design magazines that are not covered in most library databases. The DAAI made my research much easier in school and it is growing at very rapid pace. If your school doesn’t offer it, find a library that does and request (through the head of the design department) that the school get access to this database ASAP.\n\n"
    },
    {
      "time": "12 Mar 2009 — 11:15am",
      "content": "I was just saying it because students these days tend to quickly jump to the internet and only the internet. I'm a student myself, and I use the internet mainly as a means to start a search for information, and after that extend this search into books and magazines (and newspapers). We are actually _required_ to use books, and we usually have to quote parts from the books we use so the teacher verify it if he wants.\n\nAlthough, of course, the internet can be really good to find information about things that are happening at this very moment.\n\n"
    },
    {
      "time": "12 Mar 2009 — 4:48pm",
      "content": "In addition to Tiffany's Google link (above), which has some useful online articles, you can also try looking up Erik Nitsche on Amazon. You will get [a list of books](http://web.archive.org/web/20130629052030/http:/www.amazon.com/s/qid=1236901498/ref=sr_pg_1?ie=UTF8&rs=1000&keywords=Erik%20Nitsche&rh=i%3Astripbooks%2Ck%3AErik%20Nitsche&page=1) in which he is either mentioned or listed as author/contributor. But your best bet, as others have already said, is going to the library.\n\n"
    },
    {
      "time": "12 Mar 2009 — 5:35pm",
      "content": "Thank you folks. I had no luck with the library at school. Mun has a library on campus and I've heard it has quite a few more books then my school...  \nAlrhough, I read that Nitsche really didn't talk about his work, so maybe that has something to do with the lack of information on the net. But the essay is done and done well.  \nJames, I'm going to check that out first thing in the morning. I would love access to that. Thanks again b'y's. :D\n\n"
    }
  ]
}
