{
  "id": "55722",
  "title": "!!NEW!! Fitness store logo design",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is my design for a fitness store, just want any critique at all, i'm not to sure if the grey is a bit too much.\n\nType - Avenir\n\n| Attachment | Size |\n| --- | --- |\n| [heroes.jpg](http://web.archive.org/web/20150418195611/http:/typophile.com/files/heroes.jpg) | 12.96 KB |\n\n",
  "author": "Scott Robinson",
  "time": "10 Mar 2009 — 1:05pm",
  "uid": "42688",
  "comments": [
    {
      "time": "10 Mar 2009 — 3:47pm",
      "content": "I like the logo very much. I like the colors very much. But...\n\nThere's too much going on that distracts from these great elements. The rounded corners of the logo's frame square don't match the style of the logo, and frankly, it's altogether unnecessary. If it were me, I'd scrap the square altogether or use it to encompass both logo and logotype (perhaps knocking out the logotype in white or a lighter color?)\n\nThe yellow knobs on the barbell need a smidgen more air to match the logo's other spaces.\n\nThe multicolor logotype isn't working for me. I'd use the darkest gray (only) from the logo square for the logotype. The scale is off, too - why is it so small compared to the logo? If you're going to have the barbell crushing the logotype, it needs to be look more intentional. :)\n\nHave you searched for a font with more character? Perhaps something with more width (something burly like [Dienstag](http://web.archive.org/web/20150418195611/http:/new.myfonts.com/fonts/insigne/dienstag/black/) or even [Taku](http://web.archive.org/web/20150418195611/http:/new.myfonts.com/fonts/thinkdust/taku/)) may compliment the logo better. Right now, the logotype looks wimpy and disconnected - like an afterthought.\n\nNow that I've torn it apart, let me add that I think it's pretty cool and headed in the right direction. The colors are especially pleasing, and work well to attract men and women to a fitness store, which I think can be quite hard. Well done.\n\n"
    },
    {
      "time": "10 Mar 2009 — 5:19pm",
      "content": "I would use all caps in flavor that’s not so geometric, pull the type up into the box so the weight rests on it, and knock it and the weight out of the grey. Then use an ever-changing color palette to keep the identity fresh.\n\n"
    },
    {
      "time": "11 Mar 2009 — 10:12am",
      "content": "If you remove your first draft of the logo, the entire thread makes no sense.\n\n"
    },
    {
      "time": "11 Mar 2009 — 10:39am",
      "content": "hey alaskan\n\ni don't fully understand what you mean, sorry for sounding stupid, i just want it to look professional and it just doesn't, i cant see it as being professional and i have a exhibition of my work coming up and i want to show it off. I like the weight idea, also representing the H.\n\n"
    },
    {
      "time": "11 Mar 2009 — 10:54am",
      "content": "Rather than adding your newest draft in a new comment (in this thread of the forum) you edited your first comment, and removed the original draft. My top comment and James's comment refer to a logo that's been deleted -- and we can't edit our comments. Anyone who reads this thread will be confused.\n\nThe whole idea of this forum is to critique the progression of a logo, and you won't get any feedback if people can't figure out what's going on.\n\nYour new version needs some air. The logo is too close to the logotype, and the scale doesn't feel right. The two elements are competing with each other rather than working as a unit.\n\n"
    },
    {
      "time": "11 Mar 2009 — 11:33am",
      "content": " ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_3973.jpg)\n\ndoes this work better? i've added more air, but i don't know about the colour of 'HEROES' is that maybe why it might still seem like its competing? is the type better as well?\n\n"
    },
    {
      "time": "11 Mar 2009 — 12:15pm",
      "content": "Certainly better. The mark is a bit too small compared to the type though.\n\nAlso, and perhaps it's just me, the orange bar seems to be not centered vertically.\n\n"
    },
    {
      "time": "11 Mar 2009 — 12:26pm",
      "content": "what about this one? this is another idea i came up with?\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_4619.jpg)\n\n"
    },
    {
      "time": "11 Mar 2009 — 12:28pm",
      "content": "I also see the crossbar being uncentered.\n\n"
    },
    {
      "time": "11 Mar 2009 — 1:10pm",
      "content": "another variation for heroes fitness store.\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_4446.jpg)\n\n"
    },
    {
      "time": "11 Mar 2009 — 1:11pm",
      "content": "Sorry, I did not see the first draft of this logo but hope I can make some helpful comments on what has been posted.\n\n1. The newest version is now too spread out; The size of the letters is better but I would keep the kerning you had previously and move the type closer to the logo.\n\n2. The white between the handle and the darker weights is smaller than the other spaces. My eye also goes to the rounded corners on the crossbar as they are the only thing not geometric about this logo and type.\n\n3. There are too many gray's for my taste. Keep this version but make another that uses the darkest gray for the type and the weights (crossbar can stay orange).\n\nHope that helps. Good luck.\n\n"
    },
    {
      "time": "11 Mar 2009 — 1:23pm",
      "content": "What if you merge smaller weights (light gray disks) into the dark gray ones ? The concept behind the mark is a solid, but in its current form it looks too much like a weight and too little like an H. If the H were more obvious and the mark were a bit simpler, it'd look much better.\n\nAlso, agreed with Nachos regarding letter spacing. I think spacing in [this version](http://web.archive.org/web/20150418195611/http:/typophile.com/files/heroes_3973.jpg) worked really well.\n\n"
    },
    {
      "time": "11 Mar 2009 — 1:33pm",
      "content": "hey epsillcon, when you say light grey discs what do you mean? i've changed the letter spacing back to its original kerning, and it does look more bold. I think it is just missing something, it hasn't got that final piece.\n\n"
    },
    {
      "time": "11 Mar 2009 — 1:41pm",
      "content": "I mean something like this:\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/weights_5200.png)\n\nMore \"H\", less \"dumbbell\"\n\n"
    },
    {
      "time": "11 Mar 2009 — 1:56pm",
      "content": " ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes2_5891.jpg)\n\nis it slowly getting there?\n\n"
    },
    {
      "time": "11 Mar 2009 — 2:14pm",
      "content": "Instead of playing variations on a broken theme, try putting the two halves together to make a whole.\n\n"
    },
    {
      "time": "11 Mar 2009 — 5:10pm",
      "content": "I don’t know if this is what Mr. Puckett is getting at, but the dumbbell works well enough as an H. You might try it as the first letter in the word.\n\n"
    },
    {
      "time": "12 Mar 2009 — 3:33am",
      "content": "like this?\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_3749.gif)\n\n"
    },
    {
      "time": "12 Mar 2009 — 5:43am",
      "content": "Yes Chris. I’ll also mention that, through experience, I have bumped into a soft rule on this board that it is generally perceived as being more constructive to verbally direct than to offer a concrete visual solution. The exception is if a visual solution is requested. The thinking, I believe, is that it preempts the designers chance of arriving at the solution and puts them in the position of possibly using someone’s work other than their own.\n\n"
    },
    {
      "time": "12 Mar 2009 — 8:10am",
      "content": "i still want to keep the symbol but don't know if the alterations to the H work with it, i mean they don't necessarily need to be seen together.\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_5111.jpg)\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:24am",
      "content": "You want to keep the symbol, but there are too many dumbells in this logo. Instead of modifying the H, why not just replace it w/ the symbol?\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:30am",
      "content": "I would be inclined to go one way or the other, rather than both. Keep in mind a one color version. Have a look at your letter spacing. Consider the weight of the center bar of the H in relation to the rest of the font.\n\n"
    },
    {
      "time": "12 Mar 2009 — 10:19am",
      "content": "this is all the variations, i like the ones without the dark grey box. But i think just normal type is better than messing around with the H, i mean i need opinions, and i would like to say thank you to every one who has given me advice and help.\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_3669.jpg)\n\n"
    },
    {
      "time": "12 Mar 2009 — 11:27am",
      "content": "This is a good idea that needs refining. In my opinion the fastest way to a better solution is to make this black and white only - no grey. Then sort out what it looks like on a black background, and what it looks like on a white background.\n\nYou don't need the box on the dumbell, nor should you start the word with an H dumbell.\n\nOf the logos above, top left is teh best balanced to my eye.\n\n"
    },
    {
      "time": "12 Mar 2009 — 2:37pm",
      "content": "I agree with everyone.\n\n"
    },
    {
      "time": "12 Mar 2009 — 1:50pm",
      "content": "how about this design? i like it without the symbol, it works well without it.\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_3778.jpg)\n\n"
    },
    {
      "time": "12 Mar 2009 — 2:21pm",
      "content": "All three look rather unbalanced to me, too long and proportions are off.\n\n"
    },
    {
      "time": "12 Mar 2009 — 2:32pm",
      "content": "This last version looks more \"southwest\" than \"venice beaach\".\n\nI wouldn't put the logo in a box.  \nI wouldn't worry about putting the type under the logo.  \nI would concentrate on the mark.  \nKeep it simple.\n\nThe version posted at 10.19 (pst) has several that are good. I prefer no box and the type to be less dominant. But again, I don't think having the type weighted heavier than the logo is good.\n\n"
    },
    {
      "time": "12 Mar 2009 — 3:04pm",
      "content": "I don't agree with everyone.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20150418195611/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20150418195611/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": "12 Mar 2009 — 3:15pm",
      "content": "The 1:50 postings are a step backwards. The weights seem more like headphones in this round. Interesting idea and it's good to test all your ideas, but the earlier posting had stronger designs. I'd like to see the type come down in size a few points to add more contrast the mark and give the overall design more interest. I enjoyed seeing your progression on this, nice work.\n\n"
    },
    {
      "time": "13 Mar 2009 — 2:26am",
      "content": "i will update it when i get back, but i was just wondering who everyone works for or if your freelance student etc... i'm on my final year of a graphic communication course and just want some help or direction where to go.\n\n"
    },
    {
      "time": "13 Mar 2009 — 6:23am",
      "content": "Think rhythm and proportion. Decide which direction you like and use the stroke widths and other elements and repeat them in building and spacing the elements. This will help things hold together and not appear to float about.\n\nIt is not unusual that you will get differing opinions and directions here. In the end it is for you to decide.\n\n"
    },
    {
      "time": "13 Mar 2009 — 7:53am",
      "content": "i reduced the pt size of HEROES by 6 pts\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_3705.jpg)\n\n"
    },
    {
      "time": "13 Mar 2009 — 12:49pm",
      "content": "_In my opinion the fastest way to a better solution is to make this black and white only - no grey._\n\nI wholeheartedly agree here. Your issues with the form are being confused by the use of color and grayscale. Nail it down in black and white, then add color back where you want it. It helps tremendously.\n\nAs much as I love Avenir, the cap R is feeling a bit awkward. To make this work more as a logotype, I think you need to adjust it, lowering the crossbar of the R a little. I find it distracting.\n\n"
    },
    {
      "time": "13 Mar 2009 — 1:06pm",
      "content": "i dropped down the 'r'\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_3723.jpg)\n\n"
    },
    {
      "time": "13 Mar 2009 — 2:26pm",
      "content": "The type looks better now. The mark though still has way more of a dumbbell in it and not enough H. How about something like this ?\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_5127.png)\n\n"
    },
    {
      "time": "13 Mar 2009 — 4:38pm",
      "content": "how about this? maybe they are spaced too far apart?\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes_5821.jpg)\n\n"
    },
    {
      "time": "17 Mar 2009 — 2:55pm",
      "content": "it's not bad (and certainly getting there) ... I'm still not convinced it hits the spt though. but having said that at this early hour and with a fluey head, I can't offer anything more constructive.\n\njust throwing these out there:  \nit's feeling pretty clearly masculine - does that affect the female audience?  \nif masculine is the approach perhaps a different approach can be found ... with a different execution of the same concept ... it's just so ... plain. the simplicity is great, but the plainness is ... boring.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20150418195611/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20150418195611/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": "25 Mar 2009 — 5:37pm",
      "content": "Im thinking that H is pretty obvious so I would nix the alphaglyph (kind of like like cpalmeri) Build it directly into one cohesive wordmark. Then if you need to break it out on its own as a secondary glyph you're golden. Versus a contricting lock-up.\n\n"
    },
    {
      "time": "3 Apr 2009 — 3:14am",
      "content": "Thought it would like better in Antenna:\n\n ![](http://web.archive.org/web/20150418195611im_/http:/typophile.com/files/heroes-antenna_6744.png)\n\n"
    },
    {
      "time": "3 Apr 2009 — 7:17am",
      "content": "You're right about Antenna being better. I agree. But i think that this particular typface has a badly designed \"S\". No offence but I'd redesign it. It looks unbalanced and shape looks uneven. It jumps in my eyes...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "3 Apr 2009 — 11:10am",
      "content": "I actually think this logo has gotten worse as the more changes you make. Originally, I thought It was great the colors worked I thought, and the way the shapes formed an H and the weight. I liked the original better. And the typesetting in the original was better to. The new version I dont like the type at all. I dont that I like where its going... The original I thought was nice.\n\n"
    },
    {
      "time": "15 Apr 2009 — 3:45pm",
      "content": "Im going to have to disagree with that last comment. Though the colors in the original were certainly pleasing, there was discontinuity--none of the colors of the typography were matched in the mark itself. Using the same black from the type in the mark draws the two together.\n\nSimple is harder, but simple is better.\n\n"
    },
    {
      "time": "8 Jun 2009 — 8:49am",
      "content": "[http://incspring.com/brand\\_details.php?brand\\_id=4373](http://web.archive.org/web/20150418195611/http:/incspring.com/brand_details.php?brand_id=4373 \"http://incspring.com/brand\\_details.php?brand\\_id=4373\")\n\nI have told the guy that it was too close, but he decided to keep the logo and disable the comments instead - [http://logopond.com/gallery/detail/62634](http://web.archive.org/web/20150418195611/http:/logopond.com/gallery/detail/62634 \"http://logopond.com/gallery/detail/62634\")\n\n"
    },
    {
      "time": "8 Jun 2009 — 7:37pm",
      "content": "The issue has been resolved. John (\"the guy\") pulled to logo as he explained in [this comment](http://web.archive.org/web/20150418195611/http:/logopond.com/forum/viewtopic.php?pid=19006#p19006).\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:25pm",
      "content": "There is an old gym here in San Jose that has a very similar logo.\n\n"
    },
    {
      "time": "21 Jun 2009 — 10:30pm",
      "content": "I have seen this logo (or some iteration of it) several times in several different places. Here is one here: [http://logopond.com/gallery/detail/62634](http://web.archive.org/web/20150418195611/http:/logopond.com/gallery/detail/62634 \"http://logopond.com/gallery/detail/62634\")\n\nThough I like the general concept it would be nice to see something a bit more original. I think the concept where the barbells create the \"H\" is the best variation so far.\n\n"
    },
    {
      "time": "3 Feb 2013 — 10:38am",
      "content": "I would definitely go for the logotype concept of cpalmieri.\n\nYou can still use the H as a separate symbol in all kinds of applications.\n\nYour logo works great in just one colour. I definitely don't like the 'wooden colour' bar.\n\n"
    },
    {
      "time": "5 Feb 2013 — 2:06am",
      "content": "I would drop the whole dumbell concept tbh as to me it's not really 'fitness' but more like 'macho'.\n\nBut if that is a must, I'd indeed go with the solution Cpalmieri posted.\n\n"
    }
  ]
}
