{
  "id": "55727",
  "title": "Typefaces designed as a solution for a specific problem or issue?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Example:\n\nGeorgia for better on-screen legibility  \nBell Centennial for better reproduction on poor quality paper and the ability to fit more characters per line w/o sacrificing legibility.\n\nWhat are some other typefaces that were designed to solve a very specific problem/issue?\n\n",
  "author": "Fantômas",
  "time": "10 Mar 2009 — 1:40pm",
  "uid": "23247",
  "comments": [
    {
      "time": "10 Mar 2009 — 2:07pm",
      "content": "There are dozens of typefaces meant to solve some sort of printing or identity issue. Meta and Whitney are both great faces that addressed identity needs; Retina and Times New Roman address different aspects of printing on newsprint. Reading through the descriptions of fonts on the manufacturer web sites will turn up all kinds of stuff like this.\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:24pm",
      "content": "Times and Retina are on my list. Thanks James!\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:48pm",
      "content": "Clearview\n\n[http://www.clearviewhwy.com/](http://web.archive.org/web/20131018014038/http:/www.clearviewhwy.com/ \"http://www.clearviewhwy.com/\")\n\nChrisL\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:53pm",
      "content": "Pretty much every custom/bespoke font - even if the problem is the cost of licensing existing fonts.\n\n"
    },
    {
      "time": "10 Mar 2009 — 2:56pm",
      "content": "There was a series of typefaces designed by Mergenthaler Linotype, ca. 192641, to address specific constraints and issues with newspaper printing -- paper issues, ink issues, press speed issues, dry stereotype matrix issues, etc. These were collectively called the \"Legibility Group.\" They were Ionic No. 5, Excelsior, Opticon, Paragon, and Corona.\n\n-- Kent.\n\n"
    },
    {
      "time": "10 Mar 2009 — 6:29pm",
      "content": "All mine.\n\n"
    },
    {
      "time": "10 Mar 2009 — 7:17pm",
      "content": "dot matrix fonts\n\n-=®=-\n\n"
    },
    {
      "time": "11 Mar 2009 — 4:17am",
      "content": "[Minuscule](http://web.archive.org/web/20131018014038/http:/www.thomashuotmarchand.com/typographie/minuscule/) by Thomas Huot-Marchand, a typeface for extremely small sizes; also read [Erik Spiekermann's review](http://web.archive.org/web/20131018014038/http:/typographica.org/001145.php).\n\n"
    },
    {
      "time": "11 Mar 2009 — 6:02am",
      "content": "Nick, I think your answer is the most original one yet. But more detail would be nice, unless you want me to...gasp...research. Oh incidentally, I've been doing my research as well. ;)\n\n"
    },
    {
      "time": "11 Mar 2009 — 6:39am",
      "content": "As long as self-promotion is allowed, I'll throw my [Inconsolata](http://web.archive.org/web/20131018014038/http:/levien.com/type/myfonts/inconsolata.html) into the ring. It was designed explicitly for code listings in print, and it is being used for that (most recently in [liftbook](http://web.archive.org/web/20131018014038/http:/groups.google.com/group/the-lift-book)), but a lot more people seem to be using it for their onscreen terminal display anyway.\n\n"
    },
    {
      "time": "11 Mar 2009 — 6:45am",
      "content": "_... more detail would be nice..._\n\nIn that case, you could perhaps be more specific about what kind of problems, because it is the nature of design to solve problems.\n\nIn saying that all my faces solve problems, I should admit that mostly they are problems I've created, such as \"What would a slab serif designed by Bodoni look like?\" Most type designs could be described like that, e.g. \"What would my version of a squarish sans serif look like?\"\n\nAs I understand it, Erik Spiekermann's take on this is that types developed for use in specific projects have an inherent virtue.  \nSo those would concern problems a client has created, such as, \"What kind of face would work best in this particular corporate branding, for its particular media uses?\"\n\nDifferent from both these are types which address problems of reproduction in specific media (e.g. Verdana) or problems of legibility in specific media (e.g. Clearview), or problems of readability with specific categories of reader (e.g. Century Schoolbook).\n\n"
    },
    {
      "time": "11 Mar 2009 — 7:22am",
      "content": "I suppose it might be useful to note that the alternative to this would be to design somewhat randomly and let time and users sort out which faces are the fittest for whatever purposes fonts are used. This may well happen at the character or glyph level, even as languages evolve. However, for something as complex as a finished typeface I would think that most of what is regularly used for setting type was designed by someone for some specific purpose.\n\n"
    },
    {
      "time": "11 Mar 2009 — 8:28am",
      "content": "I am attempting to research whether typefaces are designed randomly, designed for a specific purpose, or are simply updated redesigns of older out of date typefaces. This is why I initially started this topic. So to answer Nick, I am researching this outside of Typophile as well. I simply want some opinions from type designers who are involved with this daily. Design doesn't always solve problems. Sometimes it creates them ;)\n\n"
    },
    {
      "time": "11 Mar 2009 — 11:57am",
      "content": "\"I am attempting to research whether typefaces are designed randomly, designed for a specific purpose, or are simply updated redesigns of older out of date typefaces.\"\n\nAll of the above.\n\nChrisL\n\n"
    },
    {
      "time": "11 Mar 2009 — 3:35pm",
      "content": "All of the above, indeed.\n\nA good example would be newspaper typefaces. Most of them are specifically designed for that purpose; keeping ink spread (dot gain kind of thing) in mind, etc.\n\n"
    },
    {
      "time": "11 Mar 2009 — 7:57pm",
      "content": "Cinecav for TV Closed Captioning.  \nAffluent and Lonsdale for blurry picture tubes.  \nBlue Highway Plasma (unpublished) for 1 inch letters cut in metal.  \nSayso Chic for short scrolling LED signs.\n\n"
    },
    {
      "time": "12 Mar 2009 — 3:12am",
      "content": "Ditto what Nick says. :)\n\nI have to mention the types designed for The Century Magazine, designed by father, then son Bentons, as being an incredible fall back collection for me. They were developed to work well with the magazine, tall x-height (appears larger on page), designed to fit space well, and as a result using up less paper in printing.\n\nCentury Old Style (and derivatives) are my 'copyfitting' standby whenever space is limited and copy is rich!\n\nVery usable problem solver.\n\n"
    },
    {
      "time": "12 Mar 2009 — 10:48am",
      "content": "Fantômas,\n\nI share your fascination with \"purpose-driven\" typefaces, designs like Bell Centennial, Georgia, Clearview etc. While Nick is right about all typefaces (and indeed all design work) solving some problem, I think you mean something a bit more specific, mainly dealing with physical/real-world constraints. I think his breakdown of these types of problems (reproduction in specific media, legibility in specific media etc) is a useful way to look at this stuff.\n\nFor a while I was working on a typeface meant for E-Ink screens, similar to how Georgia and Verdana were designed for monitors. Turns out there are E-Ink screens with good enough resolution that there wasn't really a need for the typeface, so I abandoned the project pretty early on.\n\nSomething I've done which addresses reproduction in specific media was a [stencil typeface for easy cutting by hand](http://web.archive.org/web/20131018014038/http:/exfishgeekgraf.wordpress.com/2008/04/23/first-test/). Most common stencil faces were designed to be produced by machines, and are very hard to cut by hand with a hobby knife. Gerard Unger gets close to a solution with [Decoder](http://web.archive.org/web/20131018014038/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns13.html). Lots of folks in the street art community use computers for designing their stencils, thouhg most don't have access to laser cutters. I've recently resumed work on this project, which was started at a time when I knew very little about letterforms and type design, and the results are naïve in many ways.\n\nGenerally speaking, what's been said here about \"all of the above\" seems to make sense, that there are many reasons that typefaces get made. I've been doing thesis research on type revivals and there are many different motivations that go into reviving a face. Could be a client wants it, could be your own fascination with a historical form, could be for academic purposes...the list goes on.\n\n—Noam\n\n"
    }
  ]
}
