{
  "id": "55749",
  "title": "FB properties......... any thoughts would help :)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi\n\nfrench bahrain properties is a new company works in properties & investments fields\n\nthis is a rough ideas..... I wanna know which of those might progress the best\n\nplz ignore the execution.... :)\n\nthnx n advance\n\n| Attachment | Size |\n| --- | --- |\n| [fb2.pdf](http://web.archive.org/web/20131021123752/http:/typophile.com/files/fb2.pdf) | 130.16 KB |\n| [fb4.pdf](http://web.archive.org/web/20131021123752/http:/typophile.com/files/fb4_0.pdf) | 116.9 KB |\n\n",
  "author": "illustarellite",
  "time": "11 Mar 2009 — 7:15am",
  "uid": "41563",
  "comments": [
    {
      "time": "11 Mar 2009 — 7:39am",
      "content": "b2 is interesting but I don't think it really captures \"properties\" - it has more of a technology feel to it. b3 though seems intriguing enough. It has \"architectural\" elements that can be useful for a property investment firm. I'm not sure disconnecting the bowl of the \"b\" is the right approach though. Maybe think of this more in terms of buildings, architecture or even investment concepts. Right now it seems a bit too focused on the first letters of the company's name. Which is a perfectly fine place to start, but yeah, play with some other concepts. Hope this helps.\n\n"
    },
    {
      "time": "11 Mar 2009 — 7:47am",
      "content": "I like 1B as having the most potential and looking less like Font Bureau.\n\nChrisL\n\n"
    },
    {
      "time": "11 Mar 2009 — 10:34am",
      "content": "I don't think any of these fit, sorry. That's unless they are going for a nontraditional, quirky brand. These options don't really project the \"upscale\" \"professional\" \"confidence\" (all three at once) that is expected from an investment managers.\n\n_Maybe_ 4C, but it's also kind of pushing it.\n\n"
    },
    {
      "time": "11 Mar 2009 — 11:35am",
      "content": "bemerx  \nSo... it is B3 But need to be more architetural  \nI'll try to make it more like squares?  \nyeah.... I mostly either start with letters or a symbol... it makes a kind of steps to use :)\n\ndezcom  \nWhat if I change the shape of circular B into 2 squares? wouldnt it be more... umm... easy on the eye?\n\nepsilicon  \npeople always say that my designs r nontraditional....I wish I can control this :(  \nshould I try to make 4c work.... or it doesnt worh the effort?\n\nSana\n\n"
    },
    {
      "time": "11 Mar 2009 — 11:54am",
      "content": "No, too confusing. You do need to improve those 2 curves on the B though. They are very lumpy.\n\nChrisL\n\n"
    },
    {
      "time": "11 Mar 2009 — 12:56pm",
      "content": "Speaking just for myself, I think these logos don't evoke associations they should given the context. So if they _are_ used, it will mean an extra effort in brand positioning. That's what non-traditional about them.\n\nRe: 4C - I think it needs to be simpler. It just has too much going on for it at the moment. Something like this perhaps (2 minute hack job):\n\n ![](http://web.archive.org/web/20131021123752im_/http:/typophile.com/files/fb2_6657.png)\n\n"
    },
    {
      "time": "11 Mar 2009 — 1:23pm",
      "content": "illustarellite ,\n\nNot necessarily like squares but have the letter-shapes almost feel like buildings or houses. Your designs need to invoke a feeling. Again I think you should explore different concepts beyond just the initials \"FB\". Maybe even think about cultural symbols from French and Bahrainian cultures (I'm assuming that the company is composed of people familiar with France and Bahrain). These designs right now just aren't clicking the \"property investment button\" in my mind.\n\n"
    },
    {
      "time": "12 Mar 2009 — 8:19am",
      "content": "I agree with the other posting that your designs aren't giving off a properties and investments vibe. That said, to me 1B and 2B have the most potential in becoming interesting icons to be used with the name. 1B could stand to be abstracted even more (imo) and 2B currently reads as EB. You really should be working with the name as well as the mark to develop the two together.\n\n"
    },
    {
      "time": "13 Mar 2009 — 7:20am",
      "content": "Hi\n\nI have done some changes\n\nBemerx  \nI agree........ well, when property feels like houses or buildings, what does investments should show?  \nI am trying to give it some... let's say pattern logo\n\nKristen Navin  \nI will try....\n\nepsilicon\n\nwhat you've done looks like ( & )... I like it :)\n\nI meant with nontraditional.... umm.... not funky.. classy & clean...\n\nplz have a look @ the new editing\n\nSana\n\n"
    },
    {
      "time": "13 Mar 2009 — 3:20pm",
      "content": "I'm sorry, but none of those seem at all workable. :-(\n\nI'm trying to find some glimmer of meaning (as opposed to just fooling around with shapes) and the only thing I'm seeing is something in b2: is that a falcon? Because I know falconeering is big in the gulf states.\n\nIn any case, two important things to ask/answer: who is the typical client of this business? What kinds of buildings/properties do they build/manage?\n\nhhp\n\n"
    },
    {
      "time": "14 Mar 2009 — 4:04am",
      "content": "hrant  \nin fact I was tring to make it look like an airplane above buildings & fb letters :S  \nfalcon? I didnt mean to, but it looks well  \nyes .. i've got a falcon :)..... but what is the connection between falconeering & properties?\n\nthe company buys & sells properties, they invest in properties, serving big companies and regular indevituals\n\nSana\n\n"
    },
    {
      "time": "14 Mar 2009 — 7:14am",
      "content": "\\> what is the connection between falconeering & properties?\n\nThe building shapes that make up the falcon connect to the properties; the falcon connects to Bahrain. Plus people like falcons, especially these days since they contrast against sleazy human real estate agents. Fly with it!\n\nhhp\n\n"
    },
    {
      "time": "14 Mar 2009 — 7:21am",
      "content": "BTW, I just realized the term is falconry not falconeering.\n\nhhp\n\n"
    }
  ]
}
