{
  "id": "55758",
  "title": "Logo wars : Re/Max vs Rehava",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.charleston.net/news/2009/mar/07/its\\_big\\_guy\\_vs\\_little\\_guy74198/](http://web.archive.org/web/20131109001145/http:/www.charleston.net/news/2009/mar/07/its_big_guy_vs_little_guy74198/ \"http://www.charleston.net/news/2009/mar/07/its\\_big\\_guy\\_vs\\_little\\_guy74198/\")\n\n_First of all, both names start with \"r\" and have logos with accent lines near the letter \"e,\" he said._\n\n\"It goes beyond that,\" Scoville added. \"If you chop the top off of the 'h,' you (almost) have the 'm' in Re/Max. The next letter is an 'a,' and if you take the 'v' then you have half of an 'x.'\"\n\nHilarious.\n\n",
  "author": "John Hudson",
  "time": "11 Mar 2009 — 11:12am",
  "uid": "1262",
  "comments": [
    {
      "time": "11 Mar 2009 — 11:17am",
      "content": "If Remax really cared about its logo it could hire a designer to come up with something that doesn’t appear to have been barfed up in the 1970s by a guy who had never worked with phototype before.\n\n"
    },
    {
      "time": "11 Mar 2009 — 11:19am",
      "content": "That is honestly ridiculous. This is almost as full of it as the \"leaked\" Pepsi branding PDF.\n\n_Almost._\n\n@James: I'll have to use that description for some of the more choice logos I see.\n\n"
    },
    {
      "time": "11 Mar 2009 — 12:26pm",
      "content": "RE/MAX might have a case if the new outfit also had a slash in their name, but this suit is as valid as Apple suing Applied Materials for having a similar name. I'm totally serial.\n\n"
    },
    {
      "time": "11 Mar 2009 — 12:44pm",
      "content": "There's really no such thing as bad publicity. With the economy the way it is, I hope both parties get some increased name recognition and business out of this.\n\n"
    },
    {
      "time": "11 Mar 2009 — 12:53pm",
      "content": "Its sad that companies (and individuals) feel they can exploit the judicial system in this way. rehava will most likely be the ones who benefit from the PR coverage of this unfounded/dismissible case. Oh yeah, and the RE/MAX logo is hideous (but recognizable).\n\n"
    },
    {
      "time": "11 Mar 2009 — 11:34pm",
      "content": "_never worked with phototype before_\n\nOr perhaps Letraset? I used to have sheets of Avant Garde 36 pt with all the straight (usable) letters gone and only the slanted alternates left ;-|\n\n"
    },
    {
      "time": "12 Mar 2009 — 2:57am",
      "content": "I always read \"RF/MAX\" and wonder why they never fixed such a clear failure of design.\n\nI suspect they may have been gearing up for a modern rebrand, which, as we have seen with Xerox et al, generally means setting the name in lowercase... and the Rehava logotype looks too much like what they wanted to change it to. To deal with that this way is even more ill-advised, but who among us can say they've met a realtor (er, \"REALTOR®\") with more sense than a fish?\n\n"
    }
  ]
}
