{
  "id": "55763",
  "title": "Ascender introduces new Goudy Pro fonts",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [billdavis](http://web.archive.org/web/20100204111822/http:/typophile.com/user/3095 \"View user profile.\") : 11.Mar.2009 1.54pm \n\n_Goudy Forum Pro and Goudy Borders are two new OpenType fonts featuring advance typographic features for creative professionals. The fonts are available for purchase and instant download from the [www.AscenderFonts.com](http://web.archive.org/web/20100204111822/http:/www.ascenderfonts.com/ \"www.AscenderFonts.com\") website._\n\nElk Grove Village, IL – March 11, 2009 -- Ascender Corporation, a leading provider of advanced font products, today announced two new OpenType fonts with historic significance. Goudy Forum™ Pro is a revival and dramatic expansion by Tom Rickner of Frederic W. Goudy’s 20th typeface design, “Forum Title”. Goudy Forum Pro features an extensive selection of swashes, ligatures and other advanced typographic OpenType features. Also introduced today is the Goudy Borders™ font, a special ornament font designed by Steve Matteson to complement Goudy Forum Pro.\n\n ![](http://web.archive.org/web/20100204111822im_/http:/typophile.com/files/goudyforumgraphic4_4054.png)\n  \nBoth Goudy Forum Pro and Goudy Borders are available immediately for download from the [www.AscenderFonts.com](http://web.archive.org/web/20100204111822/http:/www.ascenderfonts.com/ \"www.AscenderFonts.com\") website in TrueType and OpenType font formats for Mac OS X and Windows computers. OpenType-savvy applications that can access the advanced typographic features. Goudy Forum Pro retails for $30.00 and Goudy Borders retails for $20.00, both with a 5 workstation license. Special Introductory Offer: Goudy Borders is included free with the purchase of Goudy Forum Pro font.\n\n_Background on the typefaces:_  \n**Goudy Forum™ Pro** is a revival and dramatic expansion by Tom Rickner, type designer at Ascender Corporation, of Frederic W. Goudy’s 20th typeface design, “Forum Title”. Designed in 1911, the original typeface had only uppercase, figures, period, comma and an interpoint. Forum Title was inspired by Roman inscriptions on the Trajan’s column monument Goudy witnessed on a trip to Rome in the prior year. While Goudy strove to capture the feeling and character of what he witnessed, Fred stated clearly that Forum was no slavish copy of existing inscriptional forms. This new digital release begins with Tom Rickner’s careful and faithful rendering of Goudy’s original work. It was greatly and expanded with meticulously care, featuring over 500 glyphs and more than a dozen OpenType features, making it far more useful than simply imitating letters in stone.\n\nThe Goudy Forum Pro font began twenty years ago while Tom Rickner was a student at the Rochester Institute of Technology (RIT). Tom printed a type specimen using the Forum Title foundry hot metal types. Then in 1993 Tom began to digitize the font from that specimen while working as an independent type designer. Fifteen years passed before Tom dusted off the digital data and began working in earnest on font with a full Latin 1 character set. Steve Matteson, type director at Ascender, encouraged Tom to take this font further still, and soon the glyph repertoire and feature set blossomed to a robust Pro font with a myriad of advanced typographic OpenType features. In OpenType-savvy programs users have access to Swashes, Ligatures, Old Style Figures, Alternates, Ordinals and an Automatic Roman Numeral feature.\n\n**Goudy Borders™** was designed by Steve Matteson. He was inspired while working with Goudy Forum Pro and began work on a separate font of accompanying borders and ornaments. Goudy Borders is a special OpenType symbol font that contains three sets of ornament glyphs that can be arranged in a variety of ways in page design and illustration programs to create attractive borders for use with Goudy Forum Pro and many other fonts.\n\n**About Ascender**  \nAscender Corporation is a leading provider of advanced font products. Ascender's founders are font industry experts and have been involved in developing many of the most important and influential fonts used in computers, mobile devices, consumer electronics and software products. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises, software developers and hardware manufacturers. Ascender also provides an extensive collection of TrueType & OpenType fonts for download to graphic designers and consumers through its font websites, including [www.AscenderFonts.com](http://web.archive.org/web/20100204111822/http:/www.ascenderfonts.com/ \"www.AscenderFonts.com\").\n\n_Contact_  \nBill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225, Elk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730  \nFax: (847) 357 0731  \nEnglish: [http://www.ascendercorp.com](http://web.archive.org/web/20100204111822/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com\")  \nGerman: [http://www.ascendercorp.de](http://web.archive.org/web/20100204111822/http:/www.ascendercorp.de/ \"http://www.ascendercorp.de\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100204111822/http:/typophile.com/user/3095\" title=\"View user profile.\">billdavis</a>",
  "time": ": 11.Mar.2009 1.54pm",
  "uid": "3095",
  "comments": [

  ]
}
