{
  "id": "55774",
  "title": "~ vs −",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Sometimes a wavy tilde seems out-of-place. examples: wide techno, LED, very square. Are there any _display font_ situations where a tilde would need to be differentiated from a macron?\n\n",
  "author": "typodermic",
  "time": "11 Mar 2009 — 7:40pm",
  "uid": "14133",
  "comments": [
    {
      "time": "11 Mar 2009 — 7:41pm",
      "content": "derp. The topic title was supposed to be: ~ vs −\n\n"
    },
    {
      "time": "12 Mar 2009 — 8:38am",
      "content": "In linguistics it might not be a good idea, but since you say display font, it's probably not going to come up. A straight line is fine in Spanish but other languages that distinguish tilde vs acute might. In this font, how are you doing your macron vs your acute?\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "13 Mar 2009 — 4:12am",
      "content": "\"In this font, how are you doing your macron vs your acute?\"\n\nThey're identical.\n\n\"other languages that distinguish tilde vs acute might\"\n\nI don't think there are any. I suspect no languages include both macrons and tildes but I'm, not sure.\n\n"
    },
    {
      "time": "13 Mar 2009 — 5:59am",
      "content": "So how are you doing your acute vs your grave?\n\n"
    },
    {
      "time": "13 Mar 2009 — 6:46am",
      "content": "So if your macron, tilde, and acute are the same.... is the grave the same as well?\n\nPortuguese distinguishes á à and ã.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "13 Mar 2009 — 9:00am",
      "content": "You might have to include a disclaimer with the font:  \n\"Not suitable for Portuguese\"  \nBut you'd probably have to write that in Portuguese.\n\n"
    },
    {
      "time": "13 Mar 2009 — 11:08am",
      "content": "Portuguese is just the only one that came to mind. I'm sure there are others. Probably a lot of Native American and African languages, and some native South American ones as well.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "13 Mar 2009 — 9:12pm",
      "content": "Sorry about that. I completely botched the answer. Yes, my acute and grave look like a proper acute and grave. Only the macron and tilde are identical.\n\nAs for other languages, so far, I haven't come across one that includes both tildes and macrons. The exception being descriptions of long vowels, dictionaries etc. Nothing where you'd likely a display font.\n\n"
    },
    {
      "time": "14 Mar 2009 — 5:21am",
      "content": "You could probably still disambiguate the tilde from the macron by attaching small rungs of sorts on the edge of the macron design. Just putting a bottom rung on the left side, and a top one on the right. You won't have to curve it, and will be using a more traditional style to boot.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
