{
  "id": "5578",
  "title": "Toronto puts Clearview on street signs",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[Toronto chooses Terminal Design's Clearview for new street signs.](http://web.archive.org/web/20081121141419/http:/www.thestar.com/NASApp/cs/ContentServer?pagename=thestar/Layout/Article_Type1&call_pageid=971358637177&c=Article&cid=1089370222549&tacodalogin=no)   \n   \nThe article said \"That such tweaking makes Clearview easier for seniors to read is not the hollow assertion of designers but was proved out on the street by several tests.\"   \n   \nDoes anyone know how these tests are being conducted?   \n   \nIs upper lower case really more legible in this case? We're not talking about a paragraph, just a couple of words. Would contrast (weight?) be more important than shape of the words?   \n   \nI'm just thinking out loud, cos the [road signs](http://web.archive.org/web/20081121141419/http:/www.manic.com.sg/blog/archives/000170.php) from where I am are driving me loony. I find the old ones more readable, and I wish I knew why.\n\n [‹ Does this classic typeface fly in a technology piece?](http://web.archive.org/web/20081121141419/http:/www.typophile.com/node/5721 \"Go to previous forum topic\") [Things to do in Vienna ›](http://web.archive.org/web/20081121141419/http:/www.typophile.com/node/5710 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121141419/http://www.typophile.com/user/1451\" title=\"View user profile.\">karen</a>",
  "time": "<br>",
  "uid": "1451",
  "comments": [
    {
      "time": " 12.Jul.2004 10.09am",
      "content": "Karen, several reasons.   \n   \n1. Aesthetic: The old ones had a consistency of form and content, with embossed lettering. So, putting neatly printed flat \"expressway\" lettering (functionalist U&lc modernism) in funky old decorative frames just doesn't look right. these are aesthetic objects, as well as functional.   \n   \n2. Complex outline of signs. The irregular shape of the signs may create distracting irregular negative spaces with the irregular \"word envelopes\" of the names. Especially when the street name is crammed in with the neighbourhood graphics.   \n   \n3. Clutter. The integration of BIA (Business Improvement Area) \"neighbourhood\" designations, as shown in the Star article you linked to, is poorly executed. Hopefully the design consultants can get this standardized.   \n   \nOne good thing about the new system, it can be changed/repaired quickly. When the new signs were put up in our area, and \"Geoffrey St\" was mis-spelled \"Goeffrey St\", they fixed it within a couple of weeks.\n\n"
    },
    {
      "time": " 12.Jul.2004 10.39am",
      "content": "I think you're spot on with those three points. I found the old Toronto signs had a nice old world charm about them.   \n   \nBut do you know why all Caps (old) signs in my second link appear more readable than the Rotis (new) ones?   \n   \nI find the new ones very hard to read, and at least one other person (ok, another designer) claimed that the new signs almost caused him to have an accident. ![:-)](http://web.archive.org/web/20081121141419im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 12.Jul.2004 11.10am",
      "content": "In the sample of the new sign published in the Star article, the Mixed case Clearview legend is crammed into an uncomfortably sized white field. There is very little space top and bottom.   \n   \nWhen we were developing Clearview our field tests pointed to the need for a reasonalbe amount of space around the legend. Lack of such a field always reduced its legibilty.   \n   \nAlso it's hard for me to tell from the example what version of Clearview they are using. I have a feeling its an older version.   \n   \n3M, as part of their original investment in the early research funding was given around 100 sets of the fonts for their clients use. This may be one of those instances.   \n   \nKaren (and anyone else), if you are interested in the details of Clearview's development, I have a pdf that explains it some. It is rather large to post here, 1.4megs, but if you contact me I would be happy to e-mail it to you.\n\n"
    },
    {
      "time": " 12.Jul.2004 11.38am",
      "content": "Karen,   \n   \n1. Rotis has legibility problems, in particular it's too high-contrast for this kind of application. Also some letterforms are confusing, for instance the way the \"c\" is just the \"e\" without a fine horizontal crossbar.   \n   \n2. The letterpsacing is too large, particularly in relation to the word spacing. Or are they going for the DotCom look?   \n   \n3. I'm guessing this example is tracked out, and they use the condensed to accomodate really long names. But it would have been better to maintain a constant letterspacing on all signs, and here, for instance, just center the words.   \n   \n4. Perhaps not enough contrast between white lettering and green background.\n\n"
    },
    {
      "time": " 12.Jul.2004 12.38pm",
      "content": "Your new signs are letterspaced U&lc Rotis. That's bad any way you slice it.\n\n"
    },
    {
      "time": " 12.Jul.2004 1.12pm",
      "content": "\"Anyone who would letterspace lower case ...\"\n\n"
    },
    {
      "time": " 12.Jul.2004 6.14pm",
      "content": "I suspect they're going for the dot com look. The authorities try so hard to be trendy. And I'm gonna have a look around today, I suspect they letterspace all the signs, not just those with short words.   \n   \nI've seen a mall use Rotis really large, maybe about 2 feet tall, in 3D acrylic, nice colours, NO letterspacing, and it looks really good. Too bad they put them in the basement carpark, hard to get a good shot.\n\n"
    },
    {
      "time": " 17.Jul.2004 12.29pm",
      "content": "Congrats to James.   \n   \n\\> Is upper lower case really more legible in this case?   \n   \nUC has the advantange of size (important in road signs) but lc has the advantage of both distinctiveness (at least in groups) and familiarity. And when an lc setting is big _enough_ (you generally don't need to read a road sign from a dozen streets away) it's better, I think.   \n   \nThe UC forms _seem_ easier to read because you're looking at them deliberatively, not immersively. When time is of the essence (when accidents are more likely), lc forms \"lock in\" better.   \n   \n\\> Would contrast (weight?) be more important than shape of the words?   \n   \nWhich do you mean, contrast or weight? I think James has conveyed (from the extensive empirical testing) that there is a certain weight (depending on context though, I guess) that works best. As for stroke contrast, I personally think road signs should be pretty neutral, so monoline (or nearly so) is better.   \n   \n\\> the \"c\" is just the \"e\" without a fine horizontal crossbar.   \n   \nYeah, most fonts are not like that... :-/   \nThat's actually an alphabetic issue (and a serious one).   \n   \n\\> Is that supposed to be an insult?   \n   \nI hope so. Most designers have this pretention to be speaking empirically, when all they're really doing is repeating drivel from art school.   \n   \nhhp\n\n"
    },
    {
      "time": " 17.Jul.2004 7.30pm",
      "content": "\\>\\> the \"c\" is just the \"e\" without a fine horizontal crossbar.   \n   \n\\>Yeah, most fonts are not like that... :-/   \n   \nGood to have you back in the ring, Hrant.   \n   \nActually, many fonts have c's that are much narrower than the e, with an open counter.   \n   \nIn those where the c and e are more similar in form, most do not have a fine crossbar, and if they do, they have a quite distinctive terminal on the c, to mitigate the potential confusion.   \n   \n\\*\\*\\*   \n   \nBut really, this Clearview-for-street-name-signs is a lot of HOLLOW pseudo-ergonomic bs. What's the design brief here, that motorists searching for a street are driving by at expressway speed? Duh. Make the signs nice and traditional for pedestrians and cyclists to enjoy, I say, and if motorists can't read them, they should slow the  down, and if they still can't read them, their eyesight is too bad to be driving.\n\n"
    },
    {
      "time": " 17.Jul.2004 7.36pm",
      "content": "I think the fact that Clearview is good specifically for highways can still   \nbe a plus, since the alternatives have ZERO empirical backing anyway.   \n   \nhhp\n\n"
    },
    {
      "time": " 17.Jul.2004 7.39pm",
      "content": "On the other hand, the lady who stated that Interstate would be a good choice for voting ballots (after the debacle in 2000) should definitely be used in live vehicle-pedestrian collision experiments.   \n   \nhhp\n\n"
    },
    {
      "time": " 17.Jul.2004 8.20pm",
      "content": "Hello James,   \n   \nIts any optical cientist envolved to the Clearview proyect?   \n   \nRegards,   \n   \nmh\n\n"
    },
    {
      "time": " 17.Jul.2004 9.20pm",
      "content": "\\>ZERO empirical backing   \n   \nHrant, I thought you were against the empire.\n\n"
    },
    {
      "time": " 17.Jul.2004 9.31pm",
      "content": "\\> The UC forms seem easier to read because you're looking at them deliberatively, not immersively. When time is of the essence (when accidents are more likely), lc forms \"lock in\" better.   \nDo we read signs immersively? Don't we always read them deliberately?   \n   \n\\> Which do you mean, contrast or weight?   \nIn this case I use contrast and weight interchangeably because I don't mean stroke contrast. But that of the word and it's background.   \n   \n\\> As for stroke contrast, I personally think road signs should be pretty neutral, so monoline (or nearly so) is better.   \nWhy do you think that? For me I think less stroke contrast is better only because thin stroke tend to disappear even at quite short distances, esp at night.   \n   \nExpressways have a different kind of signages altogether (those are huge helvetical-ish signs). Speed limits on our small roads are 50\n\n"
    },
    {
      "time": " 18.Jul.2004 9.46am",
      "content": "The enviromental reading issues seem to be very different than in the press world. There are many radical differences, they need to be a different matter of study, specially because there are lives involved on highway accidents. So i think that cientifics, optics, etc, have a lot to say about neurological recognition, to the typographers.   \n   \nYou never read blocks of texts or paragraphs on highways, so you need to read and recognize words as familiar forms, your brain can easy be confused on this exercise;   \n   \nperu vs pare (stop in spanish)   \n   \nthe words as forms are very similar at certain meters so you dont read the counterforms because of many factors, bouma, movement, light, etc.   \n   \nWords as forms, can be more important than gliphs for the brain on highways?   \n   \nWhat happen to this study on typography (Clearview) with other languages like chinese?   \n   \nbtw, i think that monoline fonts does not help to the recognition of words better than serif ones, monoline end strokes disappear at distance, in the baseline specially, who union glips in words.   \n   \nSome of this thoughts are showed on the Optica font in the sans serif, but those fonts seems more close to a serif font.   \n   \nmh\n\n"
    },
    {
      "time": " 18.Jul.2004 10.53am",
      "content": "\\>I think that monoline fonts does not help to the recognition of words better than serif ones   \n   \n   \nFor all we know, Comic Sans, Caflisch or Panoptica may test better than any other font for signage legibility, but they will never make it to the lab short list.   \n   \nI believe that monowidth fonts such as Courier are inherently more legible than proportionally-widthed fonts, but it's unlikely that this proposition will ever be scientifically tested, because typewriters are so low-tech.   \n   \nEngineers have their own kind of hollow -- a prejudice for monoline sans serif types that look like they were made with a ruler and compass.   \n   \nIt's entrenched in highway engineer culture: once it made sense that types like DIN and Highway Gothic could be easily recreated to standard by works department crews anywhere, but now that everybody uses digital fonts, the simple geometric features are no longer necessary. Yet they persist.\n\n"
    },
    {
      "time": " 18.Jul.2004 11.23am",
      "content": "\\> Do we read signs immersively?   \n\\> Don't we always read them deliberately?   \n   \nI think it depends on the need of the reader. Immersive reading is faster, so it always works first. If you _then_ have time to read deliberatively, you naturally do that, and the results over-ride the more error-prone initial results. During deliberative reading almost anything is legible - I think our conscious preceptions of reading difficultly are mostly illusional - or at least they don't strongly indicate legibility during immersion. On the other hand, this pertains to contraints of time; when it's an issue of distance or poor weather, it's in the deliberative realm, and conscious \"decoding\" is what needs to be optimized. Also, at high speeds issues of distance/weather can become issues of time too, so I guess that means deliberation and immersion do have to be balanced after all, at least in certain types of signage.   \n   \n\\> .... the word and it's background.   \n   \nOh, I get it. We call that \"color\". :-)   \n(Although I admit \"contast\" sounds better.)   \n   \nStroke contrast: I agree that strokes can be too thin in term of function, but I also see an \"atmospheric\" reason to avoid [high] contrast: street signs generally shouldn't give opinions about their surroundings, just data. Unless it's a tourist trap gimmick or something.   \n   \n\\> You never read blocks of texts or paragraphs on highways   \n   \nWell, not never. Think of the big 2-3 line traffic incident message boards (there are a lot in Southern California at least). Sadly they're set in a really crappy, low-res \"bitmap\" font. Which is one reason why people slow down to a crawl to read them... causing more accidents!   \n   \n\\> Comic Sans, Caflisch or Panoptica may test better   \n   \nActually, for all we know (thanks to both empirical research and anecdotal evidence) we can pretty reliably guess that certain fonts (like Caflisch, certainly) are inferior to something like the proven Clearview in terms of legibiliy.   \n   \n\\> monowidth fonts such as Courier are inherently more legible   \n   \nHmmm.   \nYou mean because the letterspaces sometimes get confused with word spaces, and really cramped letters draw errant saccades? :-/   \n   \n\\> Yet they persist.   \n   \nYes, it's a cultural problem.   \nBut I find that because their work depends on obectivity, engineers tend to be more open minded to change than \"artists\", who really have nothing to gain by promoting functionality (at the extreme).   \n   \nWhen James confronted the sceptical establishment with clear evidence of Clearview's superiority, they changed their minds. Try that with Carson.   \n   \nhhp\n\n"
    },
    {
      "time": " 18.Jul.2004 12.13pm",
      "content": "Thinking about this some more, I realize that a font optimized for reducing accidents on highways (where reading something quickly in constraints of time, distance and weather is paramount) isn't the _ideal_ choice for inner city street signs (where performance can take a back seat, so to speak, to atmospheric/aesthetic issues), but they really could have done much worse than Clearview (and they usually do).   \n   \nhhp\n\n"
    },
    {
      "time": " 19.Jul.2004 12.44pm",
      "content": "\\>Actually, for all we know (thanks to both empirical research and anecdotal evidence) we can pretty reliably guess that certain fonts (like Caflisch, certainly) are inferior to something like the proven Clearview in terms of legibiliy.   \n   \nMy point is that prejudices exist about what is appropriate for a given use. Design is a process, and why rule out some options without exploring them in the design laboratory/studio?   \n   \nOpenType Caflisch, with its array of contextual alternates, structured according to the classic \"joining\" rules of fine writing, suggests a very fertile area of R&D for legibility concerns. And what if a designer theorized that the most ergonomic signs should be circular, have a red border, and Caflisch lettering quite small, centred in the middle? Sounds crazy, but what if, for some strange reason, it worked? Surely one should be open-minded about the whole design process.\n\n"
    },
    {
      "time": " 19.Jul.2004 1.15pm",
      "content": "Granted, prejudices do exist - and they're a constant impediment to progress.   \n   \nBut we can and should still use what we do think we (already) know   \nto _guide_ exploration - not least because there are so many fonts now!   \n   \nhhp\n\n"
    },
    {
      "time": " 19.Jul.2004 1.56pm",
      "content": "To an extent, Hrant, but times have changed.   \n   \nWith digital media, it's so easy to comp up a large range of alternatives, each of which looks like the finished thing, and test them all to see which works best.   \n   \nParadoxically, this has a conservative effect on design, because the client expects the finished piece to look like the comp which he/she chooses. And because all the comps are so thoroughly finished, it leaves no room for creative development during the production process.   \n   \nSo now it's a real challenge to put enough original thinking into all those slick comps, to break out of the prejudices and genres that are so easy to fall into.\n\n"
    },
    {
      "time": " 19.Jul.2004 2.09pm",
      "content": "I guess we mean very different things by \"test\"! To me setting the alternatives is indeed easy, but _testing_ them properly is extremely \"expensive\". I firmly believe that merely asking people what they thing doesn't cut it (even though that's still better than nothing).   \n   \nhhp\n\n"
    },
    {
      "time": " 20.Jul.2004 9.19am",
      "content": "\\>I guess we mean very different things by \"test\"!   \n   \nFor street name signs:   \n   \n1. Change all the signs in a neighborhood to option A.   \n2. Give the first test group, who are drivers unfamiliar with the area, instructions on how to get to a particular location.   \n3. See how long it takes them.   \n   \nThen change the signs to Option B and repeat with second test group, and so on. Kinda like a rally or scavenger hunt.\n\n"
    },
    {
      "time": " 20.Jul.2004 8.23pm",
      "content": "\\> Kinda like a rally or scavenger hunt.   \n   \nHa ha! What a fun idea! But it brings a whole lot of other factors into play.   \n   \nMy idea of testing road signs involves putting subjects in front of some kind of projector and zooming road signs at them at varying speeds to simulate driving conditions and the distance from which they will read the signs. Ie, the road signs come at them froma distance.   \n   \nDifferent fonts, different designs can be flashed. And then time taken is recorded. ![:-)](http://web.archive.org/web/20081121141419im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
