{
  "id": "5579",
  "title": "Cyrilic Problems",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello, I need some help to resolve some situation.   \n   \nSome client send me a work to do with cyrilic text (Microsoft Word), and when I open the file text the characters are change, the computer don't reconize this letters. This situation was repeted with the Macromedia Freehand. The original file was written with Times New Roman and works well with windows XP. I'm using a Mac OS 9.2 (English Keyboard) at my work but I'm confuse with the origin of the problem because Its my first time that I'm use cyrilic text. Did I must change the keyboard language? Or I must get a cyrilic version of Times New Roman to Mac OS?   \nthanks for any advice.   \n   \nRicardo\n\n",
  "author": "ricardo",
  "time": "12 Jul 2004 — 10:22am",
  "uid": "1180",
  "comments": [
    {
      "time": "12 Jul 2004 — 10:36am",
      "content": "Check out ParaType:   \n [www.paratype.com/default.asp?page=/library/languag/codepages.html](http://web.archive.org/web/20131012022806/http:/www.paratype.com/default.asp?page=/library/languag/codepages.html)\n\n"
    },
    {
      "time": "12 Jul 2004 — 10:40am",
      "content": "hi Ricardo. WinXp contain unicode opentype version of Times New Roman that includes cyrillic too. i'm not expert in mac'n'stuff, but i think easyest way - is to convert win's TNR into mac's..   \n   \nt80\n\n"
    },
    {
      "time": "12 Jul 2004 — 10:42am",
      "content": "Thanks Alessandro I hope this information will give me a light to resolve the problem.   \n   \nRegards   \nRicardo\n\n"
    },
    {
      "time": "12 Jul 2004 — 10:42am",
      "content": "Ricardo, install the Cyrillic language kit from the MacOS 9 CD. Then you can use the \"CY\" versions of system fonts. If your version of Word is 2000 or over, the text will open correctly, albeit with a wrong font. Reassign the font to any of the \"CY\" ones, then you can cut and paste to any layout application. However, unless you have some professional Cyrrillic fonts (you can buy quite a few at [www.paratype.ru](http://web.archive.org/web/20131012022806/http:/www.paratype.ru/)), you'll be stuck with these mediocre \"CY\" system ones.\n\n"
    },
    {
      "time": "12 Jul 2004 — 12:15pm",
      "content": "I also have this link you might dig:   \n [http://www.yt.cache.waseda.ac.jp/fontguide.html](http://web.archive.org/web/20131012022806/http:/www.yt.cache.waseda.ac.jp/fontguide.html)   \nAte' logo,   \nAS\n\n"
    },
    {
      "time": "12 Jul 2004 — 1:38pm",
      "content": "You can find more information about Russian typefaces and fonts at [http://euro.typo.cz](http://web.archive.org/web/20131012022806/http:/euro.typo.cz/). There are also links to free Cyrillic fonts.\n\n"
    },
    {
      "time": "12 Jul 2004 — 4:36pm",
      "content": "Thanks for all this great Links. I will see with more detail some of this informations during this night and I will try to resolve the problem tomorrow morning at my work. Regards to all.\n\n"
    }
  ]
}
