{
  "id": "55791",
  "title": "British Airways Poster",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "This is a design i came up with for a british airways world on sale campaign, i wanted to use mainly typography, but didn't know if this type worked too well.\n\n| Attachment | Size |\n| --- | --- |\n| [italy poster.jpg](http://web.archive.org/web/20140725151149/http:/typophile.com/files/italy%20poster.jpg) | 139.7 KB |\n\n",
  "author": "Scott Robinson",
  "time": "12 Mar 2009 — 8:45am",
  "uid": "42688",
  "comments": [
    {
      "time": "12 Mar 2009 — 8:58am",
      "content": "A few quick comments:  \n1) That uppercase bold sans speaks pretty dam loud, but then it takes a long time to read. Maybe consider a mixed-case setting?  \n2) The color scheme says France to me, not Italy. I'd change the blue to green. If you need the blue for CI reasons, I wouldn't use it on the word \"Italy\".  \n3) The colosseum in the corner, while I like its graphical treatment, looks a bit like an excuse to squoosh in an image after all. You might try making it more prominent and exploring ways the type can interact with the image.  \n4) On the detail level, there's some kerning to work out (\"AIRW A YS\").\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:38am",
      "content": "i took out the illustration and changed italy to green, i thought that wouldn't work, but now, it could represent that they are thinking about the environment.\n\n ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/ba_6481.jpg)\n\n"
    },
    {
      "time": "12 Mar 2009 — 9:51am",
      "content": "how about this one? for Australia, italy and america?\n\n ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_6192.jpg)\n\n"
    },
    {
      "time": "12 Mar 2009 — 8:29pm",
      "content": "It might work during the holidays...but red and green? Are you trying to offend the color-blind? :-) I'm not a fan of the color scheme. Try something a little less primary and a bit more sophisticated. And all-caps does suggest yelling, something that seems a bit off-message with the supposedly awesome and polite service British Airways offers.\n\n"
    },
    {
      "time": "13 Mar 2009 — 2:19am",
      "content": "i'm not trying to offend the colour blind, but if i was i think i was done a good job lol, i understand with the red, it was feeling like it was being burnt into my pupil against the green. I chose caps because in lowercase it seems to feel off, ill post it lowercase when i get back home. I did want to use british airways colour scheme, the red and blue as a gradient it. i just want more typographical then illustrative. something a little different.\n\n"
    },
    {
      "time": "13 Mar 2009 — 4:41am",
      "content": "Maybe choose a bit more of an airy color scheme? Something that suggests air-travel and freedom. Light blues. Maybe some dark blues, suggesting ocean. And if you pair it with a nice, clean sans-serif - upper and lower case as you want people to read it and not feel they were yelled at - you may be able to convince people that these flights are economical which may be a key selling point in these economic times. Maybe also throw in a flat, silhouette illustration of something unique and easily recognizable to the destination being served - but be careful that the illustration item is not too cliché (I'm specifically thinking of kangaroos).\n\n"
    },
    {
      "time": "13 Mar 2009 — 8:30am",
      "content": "what do you think of these variations, do you think i should use solid colours or gradients?\n\n ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_5487.jpg)\n\n"
    },
    {
      "time": "13 Mar 2009 — 8:34am",
      "content": " ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_4564.jpg)\n\n"
    },
    {
      "time": "13 Mar 2009 — 9:43am",
      "content": "I think before thinking about gradients and color, you should sort out your typography. I still agree with bemerx that \"you want people to read it and not feel they were yelled at\", which was also what I was trying to get at in my first reply to this.  \nThat said, your most recent mixed-case variation yells less, but looks a bit like you haven't spent a lot of time playing with different typefaces, font sizes, arrangements, with the leading and the line lengths, and the placement of the illustration (which might also benefit from a more refined treatment).  \nYou've got so many variables at your disposal – already in the \"purely graphical\" realm, i.e. before you reach color. Play with them! :-)\n\n"
    },
    {
      "time": "13 Mar 2009 — 10:18am",
      "content": "i just cant find the right typeface and advertising frustrates me, but thank you for help and i will try more variations now and then post them up again, i will rule out colour for now.\n\n"
    },
    {
      "time": "13 Mar 2009 — 10:18am",
      "content": "i just cant find the right typeface and advertising frustrates me, but thank you for help and i will try more variations now and then post them up again, i will rule out colour for now.\n\n"
    },
    {
      "time": "13 Mar 2009 — 12:40pm",
      "content": "DO you think the copy could be improved?\n\n"
    },
    {
      "time": "13 Mar 2009 — 12:55pm",
      "content": "i have stripped my design right back, is this any better? as a base?\n\n ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_5195.jpg)\n\n"
    },
    {
      "time": "13 Mar 2009 — 2:49pm",
      "content": "Read the sentence out loud. Pause where it makes sense to pause.  \nDo the line-breaks make sense to you?\n\nAlso, ask yourself where this should be on the classy vs. cheap axis. I know it's an ad for cheap flights, but it's still BA, not EasyJet… Defining this should help in the font selection process (and a lot of other decisions actually).\n\n"
    },
    {
      "time": "13 Mar 2009 — 4:16pm",
      "content": "Well the last image is the best yet but Nina's suggestions are spot-on. Think about what you're communicating and think of the \"tone\" and \"feeling\" that you want to communicate. Play with your typefaces and find a family (or two) that help capture that. Then use 1 or 2 fonts from those families in such a way that you capture that feeling while balancing it with the layout.\n\nDesign is about problem solving with multiple variables all which need to be balanced successfully. It's challenging yet very fulfilling. Advertising is design but with a focus on wish fulfilling. What's the wish? How will BA fulfill it? And I think it's less about \"cheap flights\" and more about \"good value and excellent service\".\n\nYou might want to check out ads in say, National Geographic or in some traveling magazine, and see how other designers solve similar problems. Look at the type that they use and see if it helps invoke feelings appropriate to the message.\n\nAnd finally, don't get frustrated. Stop and take a break by doing something completely unrelated to this project (or even design in general). Then come back to it later.\n\n"
    },
    {
      "time": "14 Mar 2009 — 3:56am",
      "content": "i think the type choice Goudy Old Style has improved, obviously this is still the base but has it improved at all? and thanks for your criticism Nina and Ben, it really is helping me a lot and i am slowly but surely learning.\n\n ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_4687.jpg)\n\n"
    },
    {
      "time": "14 Mar 2009 — 4:11am",
      "content": " ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_6162.jpg)\n\n"
    },
    {
      "time": "14 Mar 2009 — 1:14pm",
      "content": "A propos of line breaks, I'd make **huge discounts** a separate line. That's the value proposition, so you want it to scan as a single coherent idea.  \n**With our**  \n**huge discounts,**  \n**there has**  \n**never been a better time**  \n**to explore Italy**  \n**with British Airways.**\n\n"
    },
    {
      "time": "14 Mar 2009 — 2:20pm",
      "content": "should it be centered or left?\n\n ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_6450.jpg)\n\n"
    },
    {
      "time": "14 Mar 2009 — 4:55pm",
      "content": "That's not very comfortable at all. I would have to disagree, I think making \"huge discounts\" a separate line, it reads very choppy. Takes too much effort. You want someone to be able to read it quickly and with ease. I think the previous version does that more effectively. But it feels crammed - there isn't enough space around it. You want it the sentence to be comfortable in there. You wouldn't have to make too much room, it's just way too close to the edge as is.\n\n"
    },
    {
      "time": "15 Mar 2009 — 3:29am",
      "content": "i reduced the pt size is the base solid now? or does it need some more work?\n\n ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_5174.jpg)\n\n"
    },
    {
      "time": "15 Mar 2009 — 10:26am",
      "content": "Will this one be for the British Airways only?\n\nI think its getting pretty solid now. But the t and h look strange in the first \"with.\" Have you done any kerning?\n\n"
    },
    {
      "time": "15 Mar 2009 — 11:20am",
      "content": "Thats actually a good point Kelsey, since i am writing my own brief i could just advertise airports, instead of flights, i mean what's your suggestions? i will start kerning now.\n\n"
    },
    {
      "time": "15 Mar 2009 — 11:25am",
      "content": " ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_3505.jpg)\n\n"
    },
    {
      "time": "15 Mar 2009 — 3:54pm",
      "content": "Is your copy set in stone? Maybe it's a British thing, but the wording reads very awkwardly to me.\n\n- Lex\n\n"
    },
    {
      "time": "16 Mar 2009 — 12:19am",
      "content": "nope the copy isn't set in stone, any help with it would be great! im not a copy writer but as a student they make you the designer, copywriter, etc... what would you recommend it said?\n\n"
    },
    {
      "time": "16 Mar 2009 — 11:28am",
      "content": "As it stands:  \n1. Move the second \"with\" back down to the bottom line.  \n2. You don't need a comma at the end of a line.\n\nPossibilities:  \nMaybe call more attention to \"EXPLORE AMERICA\" or \"EXPLORE ITALY\" and have some of the wording above and below. It would read better \"there has never been a better time to EXPLORE AMERICA with huge discounts from British Airways\" or \"With huge discounts from British Airways, there has never been a better time to EXPLORE AMERICA\".\n\nI like your previous left justified approach, unless this is going on a wine bottle.\n\n"
    },
    {
      "time": "16 Mar 2009 — 12:52pm",
      "content": "what do you think? i added a gradient feather to add a bit of reflection but is it better?\n\n ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_6516.jpg)\n\n"
    },
    {
      "time": "16 Mar 2009 — 2:55pm",
      "content": "Not sure the reflection is necessary unless the client ask you to \"make it shiny\" which is not an unheard of request. This design looks more minimal and clean, so you might stray from the shiny look.\n\nNow that I look at it again, I'm not sure the \"British Airways\" is needed in the above text when you have the BA logo at the bottom.\n\n"
    },
    {
      "time": "16 Mar 2009 — 6:46pm",
      "content": "Scott,\n\nMy one and only comment is that nothing in that poster would look good italicized, as evidenced by one of the mockups you provided earlier.\n\nAlso, utilizing color schemes that are representative of the target Country's flag would be a nice touch.\n\n-JD\n\n"
    },
    {
      "time": "16 Mar 2009 — 10:16pm",
      "content": "I'd fix the spelling mistake in \"Austrlia\" before I handed this exercise in. Also, is it getting a wee bit plain?\n\n"
    },
    {
      "time": "17 Mar 2009 — 1:29am",
      "content": " ![](http://web.archive.org/web/20140725151149im_/http:/typophile.com/files/heroes_3580.jpg)\n\n"
    },
    {
      "time": "17 Mar 2009 — 1:25pm",
      "content": "Ok, I didn't comment after my last one cause I was getting confused..but this is what I ment ^^  \nI really liked the first one you posted for Italy, it would need some work, but I was thinking that each place would have a different poster...But if you are sticking with the same design for different places...a) it is getting quite plain. b) i would actually try something a little different for each..  \nI mean, Italy is a lot different then New York, you could give each poster a certain feel about it.  \nI sound confusing don't I?  \nOk. I would probably use the first idea for Italy..using the Italian colors...which even the color blind people would understand, becuase it is the color of their flag. And for somewhere like America, I would use ... [http://typophile.com/files/heroes\\_3505.jpg](http://web.archive.org/web/20140725151149/http:/typophile.com/files/heroes_3505.jpg \"http://typophile.com/files/heroes\\_3505.jpg\")\n\nSorry if this makes little or no sense ... hahaha I feel like I am confusing myself now... but hopefully I said everything right.\n\n"
    },
    {
      "time": "25 Mar 2009 — 8:10am",
      "content": "I like where you started with the very first poster. While it's not perfect, it has more interest than the watered down versions.\n\nWhile the all caps does look like yelling, perhaps de-emphasizing some of the less important words would make it more readable.\n\nwith our  \nHUGE DISCOUNTS  \nthere has never been a  \nbetter TIME TO  \nEXPLORE ITALY  \nwith BRITISH AIRWAYS\n\n...or something like that. Needs work, but the idea is get the consumer to see a more direct message right away.\n\nAlso, I like the graphic of the colusseum and the opera house. It has a nice negative/positive space feel to it - it just needs to be worked into the design better.\n\nhope that helps.\n\n"
    },
    {
      "time": "2 Apr 2009 — 5:24pm",
      "content": "I think your typography has improved in the most recent post.\n\nAll the copy doesn't need to be, and probably shouldn't be, the same size.\n\nYou really need to make the colors you choose match the country on the poster (Italy-green/red, America-red/blue, etc.).\n\nI think the Colosseum and the Sydney Opera house silhouettes looked good, they just needed to be incorporated better with the type and color schemes.\n\nTry making \"Explore Italy\" the biggest type, add the Colosseum illo back in, put the supporting type in 1/2 or 1/3 the size of your \"headline\" and incorporate the green/white/red color scheme.\n\n"
    }
  ]
}
