{
  "id": "55807",
  "title": "Copy Kerning & Classes",
  "forum": "Build",
  "tags": [

  ],
  "content": "Why is it that when you copy classes and kerning from an existing fontlab file to another, when you open the metrics window, it shows you have '0' pairs, when in the OpenType panel window and the Classes panel window it has all of the your kerning/class info… is there an easy way to compile the info so it shows all kerning pairs like it should in the metrics window?\n\n",
  "author": "<a href=\"/web/20100203155705/http://typophile.com/user/17099\" title=\"View user profile.\">Mike Jarboe</a>",
  "time": "<br>",
  "uid": "17099",
  "comments": [
    {
      "time": "",
      "content": "How do you copy classes and kerning from an existing FontLab file to another?\n\n"
    },
    {
      "time": "",
      "content": "In the OpenType panel I 'Copy features from a font…' which includes the 'kern' feature… and in the Classes panel I 'Copy classes from a font…'\n\nI guess in addition to that I'd need to, from the Metrics panel 'Save Metrics' and then 'Open Metrics' in the new font file to complete the process?\n\nI don't do this often but what happens is, sometimes I get caught up in the process of making changes to certain glyphs and/or making tweaks to additional weights of a particular font and I've often accidentally copy and pasted over some of the red marked 'key glyphs' to where, when I finish I basically want to just go back to the original un-touched weight and copy over all the kerning and class data to the additional weights or to the additional file I'm working in to ensure the data matches and nothing was 'thrown-off' in the process… not sure if that makes sense but that is why I was looking for ALL of the data to be copied over regarding kerning and classes…\n\nThanks,\n\nMike\n\n"
    },
    {
      "time": "",
      "content": "Mike,\n\nyes, the best method is to save a .flc file from the Classes panel and an .afm file from the Metrics Window, and then import those two.\n\nCheers,  \nAdam\n\n"
    }
  ]
}
