{
  "id": "55815",
  "title": "How do you increase the height of a font without distortion.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi, I apologize if this isn't the right forum, I'm new! I am wondering how to increase the height of a font, without increasing the width and without ruining its aesthetic by having it look stretched and distorted. Are there any tricks to do this. Thanks!\n\n",
  "author": "Ninth Kingdom",
  "time": "12 Mar 2009 — 6:33pm",
  "uid": "42946",
  "comments": [
    {
      "time": "12 Mar 2009 — 7:35pm",
      "content": "You'd have to edit it manually which would require having a license to do that. Alternatively, if you have a condensed face, just make that larger, or maybe a condensed light face.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "12 Mar 2009 — 7:55pm",
      "content": "If you have more than one weight of the font you can create a multiple master font and use Font Remix Tools to do it.\n\n"
    },
    {
      "time": "12 Mar 2009 — 8:13pm",
      "content": "Well, maybe you wouldn't \"ruin\" it, but of course you would be changing the aesthetic of a font quite deeply by making it narrower (which is a better way to think about it than \"taller\").\n\nAnyway, if quality is important, you have to do it by hand.  \nMore: [http://typophile.com/node/42930](http://web.archive.org/web/20131109011406/http:/typophile.com/node/42930 \"http://typophile.com/node/42930\")\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2009 — 5:44am",
      "content": "Thanks everyone for the replies. I am new here - are there professional typographers on these forums who can help with this type of work?! Actually, it's not an entire font. I have a wordmark with 5 letters, that I really like at certain sizes, but I think it's too expanded or something, because the lettering is too small when the mark is 100px wide. Most wordmarks are a decent size at 100px wide, but this one is just far too small, so I think the lettering needs to be narrowed, but I don't want to lose the look it has right now.\n\n"
    },
    {
      "time": "13 Mar 2009 — 7:23am",
      "content": "There are many people here who can help you.  \nMy email is: hpapazian at gmail dot com\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2009 — 1:17pm",
      "content": "Hi. Here is an image of the letters I have. Is it possible for someone to help with this. If this is the wrong forum for this request, please let me know. I need the height of these letters set to 100px, without changing the width of the letters.\n\n[http://i39.tinypic.com/9jlyj8.jpg](http://web.archive.org/web/20131109011406/http:/i39.tinypic.com/9jlyj8.jpg \"http://i39.tinypic.com/9jlyj8.jpg\")\n\nAlso, I only have an image file of the lettering, would it be easy to put these letters in a truetype font file?!\n\nThanks!\n\n"
    },
    {
      "time": "16 Mar 2009 — 1:19pm",
      "content": "If you have a budget please let me know what  \nit is - email: hpapazian at gmail dot com\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2009 — 8:33pm",
      "content": "Width 70% via MS Photo Editor\n\n ![](http://web.archive.org/web/20131109011406im_/http:/typophile.com/files/malib_5381.jpg)\n\n"
    }
  ]
}
