{
  "id": "55825",
  "title": "When Did Macintosh OS Change Early, If Not Original, System Fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Specifically, does anyone know when Avant Garde got dropped from the Mac's roster of system fonts and why? I've found something on my machine called Avant Garde Gothic. Is that supposed to be a replacement? Or the original renamed?\n\nThank you.\n\n",
  "author": "Steve Tiano",
  "time": "13 Mar 2009 — 4:26am",
  "uid": "20846",
  "comments": [
    {
      "time": "13 Mar 2009 — 4:26am",
      "content": "Stephen Tiano, Book Designer, Page Compositor & Layout Artist  \ntel. & fax: 631/284/3842  \ncell: 631/764/2487  \nemail: [steve@tianodesign.com](mailto:steve@tianodesign.com)  \niChat screen name: [stephentiano@mac.com](mailto:stephentiano@mac.com)  \nwebsite: [http://www.tianodesign.com](http://web.archive.org/web/20150414213907/http:/www.tianodesign.com/ \"http://www.tianodesign.com\")  \nblog: [http://www.tianodesign.com/blog](http://web.archive.org/web/20150414213907/http:/www.tianodesign.com/blog \"http://www.tianodesign.com/blog\")\n\n"
    },
    {
      "time": "13 Mar 2009 — 10:09pm",
      "content": "In answer to the question you meant to ask, I wasn't aware that Avant Garde ever was one of the Mac's system fonts.\n\nIn answer to the question that you actually asked, the original Mac OS fonts were the bitmapped \"city\" fonts: Chicago, Geneva, Monaco, New York, etc. One or two of them were dropped pretty early (my guess is probably with System 3 in 1986, when the preferred format changed from FONT to NFNT plus FOND resources), and some of the others never made the transition to outlines with System 7 in 1991.\n\n"
    },
    {
      "time": "14 Mar 2009 — 12:43am",
      "content": "I think that Avant Garde was one of the original 35 (?) PostScript fonts bundled with laser printers and Mac OS software, alongside Helvetica, Times, Courier, Symbol, Zapf Dingbats.\n\n"
    },
    {
      "time": "14 Mar 2009 — 6:01am",
      "content": "I think it was bundled with the LaserWriter (not entirely sure - I didn't have one myself, though I used one at work c. 1990), but I'm pretty sure it was never bundled with the Mac OS. I think they added bitmap versions of the original LaserWriter fonts to the OS releases - Times, Helvetica, Courier, and Symbol - starting around System 3, but not the later ones, until they used some of them (e.g., Zapf Dingbats) to replace \"city\" fonts in System 7.\n\n"
    },
    {
      "time": "14 Mar 2009 — 12:13pm",
      "content": "I think the first of the \"city\" fonts to go were Venice (sort of scripty) and San Francisco (ransom-note style) bitmap fonts. New York, Geneva, Chicago, Monaco and Symbol (the math Greek system font) got outlined updates at some point after System 6, when TrueType was introduced, at the time as a low cost alternative to PostScript, alongside the early Apple (rebranded from Canon) inkjet printers. The Chicago bitmap font had some changes earlier than that, removing the running man and a few other decorative characters from the font.\n\n"
    },
    {
      "time": "14 Mar 2009 — 2:48pm",
      "content": "Here are the 35 fonts:\n\n[http://www.ep.ph.bham.ac.uk/general/printing/psfonts.html](http://web.archive.org/web/20150414213907/http:/www.ep.ph.bham.ac.uk/general/printing/psfonts.html \"http://www.ep.ph.bham.ac.uk/general/printing/psfonts.html\")\n\n"
    }
  ]
}
