{
  "id": "5584",
  "title": "MicroVisions",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I just found this forum and boy am I lovin it. I'm glad I'm not the only branding nut out there. I will probably utilize this board some as I am kinda an island to myself at my job and don't really get much extra creative input. Anyway - here is one that I just wrapped up - I just want to get some feedback on it.   \n   \nThe company sells a couple of very specific software suites (ComputerEase - an accounting software and LaserFiche - a document management software) does networking, and sells some hardware. They came with more of a blaze orange color in their design history and a logo that was pretty dated.   \n   \nI wanted to subtly enforce the idea of a computer screen through the shapes in that particular font. I also wanted the logo to show support and partnership (the m and v were a bonus) as they move into a consultancy role. We also use that shape repetitively on some pieces as a pattern (see folder) and some broad solids of the orange and blue.   \n   \nLooking forward to comments/criticisms/snide remarks etc...   \n   \nI will try and post some of the other items later that go with this identity   \n ![MicroVision](http://web.archive.org/web/20131023131432im_/http:/www.typophile.com/forums/messages/29/40478.jpg) ![folder](http://web.archive.org/web/20131023131432im_/http:/www.typophile.com/forums/messages/29/40479.jpg)\n\n",
  "author": "hughfire",
  "time": "12 Jul 2004 — 2:24pm",
  "uid": "2923",
  "comments": [
    {
      "time": "12 Jul 2004 — 11:54pm",
      "content": "excellent.   \n   \nlove the fact that the icon is made up of the \"m\" and \"v\" and the subtle hint of the computer screen is great.   \n   \nnothing to critique really as it is a finished piece . . .although nothing i could think of would improve this logo...well, except the logo by itself that you posted looks as though you have centered the icon above the \"ov\" (where the two words join). i am not sure this works for me, it looks unbalanced. the logo works great the two ways you have it formatted on the folder (that is what it is, yes?)   \n   \nanyway. great job. i look forward to seeing more of your work and getting feedback from you as well with posts. welcome to the forum. ![:-)](http://web.archive.org/web/20131023131432im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
