{
  "id": "55891",
  "title": "Mint",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi,  \nHere's what I've been working on for the last week, taking a break from Eternal (in the serif crit section).\n\nI started with the intention of creating something very crisp and clean, following the current trend for roundy corners. I wanted the shapes to look slightly experimental, so tell me if they work or don't work yet.\n\nI wanted a large x-height and non-descending caps to work for small sizes and for screen use. It was a struggle to fit the tail of the g in there, and I had to break the rule with Q a little. I've got only autohinting at present, and need to work out how the off-verticals will work on screen (for example M anti-aliases rather badly).\n\nStrangely, it somehow looks like there's a bit of Optima in there, which I've only just noticed. I don't have numerals yet. Hate drawing numerals.\n\nI'll refrain from picking out individual characters for now to see what you guys think first.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/Mintbanner2_3942.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [Mint.pdf](http://web.archive.org/web/20150414232406/http:/typophile.com/files/Mint_0.pdf) | 433.4 KB |\n| [Mint Ultralight and Ultrablack First Draft.pdf](http://web.archive.org/web/20150414232406/http:/typophile.com/files/Mint%20Ultralight%20and%20Ultrablack%20First%20Draft_0.pdf) | 445.66 KB |\n| [Mint Booklet.pdf](http://web.archive.org/web/20150414232406/http:/typophile.com/files/Mint%20Booklet_0.pdf) | 506.35 KB |\n| [Mint Specimen May 2011.pdf](http://web.archive.org/web/20150414232406/http:/typophile.com/files/Mint%20Specimen%20May%202011.pdf) | 528.1 KB |\n\n",
  "author": "Bendy",
  "time": "15 Mar 2009 — 2:54pm",
  "uid": "20652",
  "comments": [
    {
      "time": "15 Mar 2009 — 3:11pm",
      "content": "strangely or not, i fancy the thing it looks like modern version of optima, with good innovation! nice start!\n\n"
    },
    {
      "time": "15 Mar 2009 — 3:29pm",
      "content": "Wow, a side project! Cool!  \nThis is very interesting, Ben. Mmm.\n\nI had a slight Optima association too at first glance – I think it comes from the large \"M\" with its flaring stems. Other glyphs have a very current flavor (something in my brain says PSY/OPS but without having a clear association to any one font – maybe a hint of Eidetic [Modern]?).  \nI think this contrast between more conventional and more experimental forms can be felt throughout the font, in the way you handle the contrast, or how \"independent\" the counterspace looks (oh here I go again…). Like, I'm quite intrigued by the counterspace in say the \"a\" and the Ss, and that feels quite \"new\". And oh I dig the asymmetric \"U\". Other glyphs seem to have a more conventional concept of contrast and stroke (like the bpdq). \"M\" and \"N\" might even feel a little quaint in this context? A pretty interesting mixture, this.\n\nThough of course this is just a spontaneous impression from a distance;  \nI'm looking forward to that PDF! Please post one soon. :-)\n\n"
    },
    {
      "time": "15 Mar 2009 — 3:46pm",
      "content": "Har, hi Nina! :) Thanks for your encouragement! It's funny I hadn't actually had Optima in my mind until I hit 'submit' for this thread. I'm glad you both like it anyway :D\n\nYou're right, I did look at Eidetic Modern! But that looked a bit scraggly to me so I didn't stay too close to its design. In fact the M and N were the only ones directly influenced by it. I guess the g is similar too.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/g_3674.gif)\n  \nIt's really interesting you mention the independent counters, as I had some ideas from that Legato thread to shape the inner and outer contours differently. I'm not sure how effective it is in improving readability as I haven't set a block of text to try it out yet.  \nI'm wondering about shaping the SE corner of the U a bit more cornerly. Like on the base of the b. \n"
    },
    {
      "time": "15 Mar 2009 — 4:13pm",
      "content": "Yeah great stuff. I dig how the white space seems to \"creep in\" on the black in this \"g\".\\* Some interesting figure/ground (or advancing/retreating) action. I have no idea what this would do for readability (one reason why I screamed for a PDF ;-) ), but it sure looks exciting up close. Makes me want to use it for display at about 200pt ;-)\n\n\\* At least South of the bowl – then the ear looks \"normal\" again.  \nBtw, might there be a slight left lean to the tail? Maybe try extending the terminal a bit further to the left, and/or bringing the right side down a bit? (Edit: on second thought, maybe not. Really hard to judge without context.)\n\nI'm pretty excited about this. But Ernestine's calling… I'll be back ;-)\n\n"
    },
    {
      "time": "15 Mar 2009 — 6:24pm",
      "content": "I can't seem to attach the pdf to the first post. Will try again tomorrow. Sorry! :(\n\n"
    },
    {
      "time": "15 Mar 2009 — 6:32pm",
      "content": "[Link to PDF](http://web.archive.org/web/20150414232406/http:/typophile.com/files/Mint.pdf)\n\n"
    },
    {
      "time": "15 Mar 2009 — 7:04pm",
      "content": "FYI, link doesn't work.\n\nWait a minute – aren't you in Europe? Welcome to the night owls' club ;-)\n\n"
    },
    {
      "time": "16 Mar 2009 — 1:29am",
      "content": "oh, yah, working on weekend hours!  \nlet's see what i can do with the pdf.\n\n"
    },
    {
      "time": "16 Mar 2009 — 7:03am",
      "content": "I like it, but I'll wait for that PDF to work to take a proper look at it. :)\n\n"
    },
    {
      "time": "16 Mar 2009 — 9:08am",
      "content": "Ben, maybe message an admin?  \nAlternately, I guess you could try posting a blog entry and trying to attach it there, then link from here.\n\n"
    },
    {
      "time": "16 Mar 2009 — 9:26am",
      "content": "Thanks, Nina, already e-mailed someone. I tried attaching it on my Eternal thread but not listing it there, that was the link that didn't work. Bums. We'll have to be patient :)\n\n"
    },
    {
      "time": "16 Mar 2009 — 12:16pm",
      "content": "Is my pdf working now? I do hope so! :)  \nI switched to Firefox.\n\n"
    },
    {
      "time": "16 Mar 2009 — 5:35pm",
      "content": "Yeah, the PDF works!  \nHere are some thoughts. Though you might need more salt with this than usual (I'm in a bit of a sleep-deprived state).\n\nI really like the direction of this, but you know that already. :-)  \nBefore getting into details, I think I have two \"bigger\" questions.\n\nThe first is how big a factor the idea of \"independent counterspace\" should be in the overall design. It's quite strongly present in some glyphs (like the \"g\"), more subtly present in others (like the \"O\" or \"U\"), and not very much there in the angular glyphs (where I'd imagine it's also hardest to pull off, at least if you want to keep the stems somewhat straight [see below]).  \nThat may be a factor in what I said earlier about some glyphs feeling more \"experimental\" than others. I'm thinking that there should be some reconciliation between (a) counters that feel \"active\" and creeping in on the black, like in the \"a\" or \"s\", and counters that feel more like they're just there because that's how the stroke goes (like in the \"n\"); or (b) terminals that feel like \"terminals\" of a \"stroke\" (like in the \"@\") or those that feel like (this is exaggerated) the rest of the black after the white has taken what it needs, like in the top of the \"a\".  \nThough this is where salt comes in; because personally, I'm quite interested in, and excitable by, designs with \"active\" whitespace, like your \"g\" (I've come back here multiple times just to look at its tail up close. I would want it on my wall, life-sized) – but that might not be what matters most to _you_ in this font!\n\nThe second question is about target usage/size. Isn't saying this is \"for text, display and web\" almost like saying \"for everything\"? I wonder if it isn't incredibly hard, if even possible, to make it work its best in text and on screen, _and_ look its best in display.  \nAs it stands, I personally think [as I said above ;-)] much of the special appeal of this font lies in the finer details of the contours, which of course only come out at large sizes. It makes me a bit sad to picture this on screen, where all of those subtle details will disappear into antialiased pixels… like I said above, I'd personally rather picture it large. Also, I feel it looks more \"novel\" at large sizes, since its \"current\" flavor depends to a degree on details. For instance, before you posted the \"g\" large (seems I can't stop talking about that glyph eh?), I was wondering if its architecture wasn't rather serious-serif-text-font-like for screen use, and didn't catch on to its exciting details at all.  \nAs for readability at text sizes, I wonder how much the \"independent whitespace\" action does for it (and this is more of an open question than an informed statement), since most of it happens in smallish details rather than the overall concept – for instance, your verticals are still vertical. (Referring back to Legato, the way I understood it was there the idea of \"independent counters\" was directly connected to breaking the \"picket fence\" of straight verticals for better cohesion of word-images. So that's something else than you are doing, I'd surmise.)\n\nI'll get back to details later… need to sleep. ;-)  \nBut this: the name rocks. Feels spot on.\n\n"
    },
    {
      "time": "16 Mar 2009 — 5:42pm",
      "content": "Wow! Gosh, what a lot of words! Thank you for this. Been playing with the numerals and have a delicious 4.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/4_5174.gif)\n I'm playing with rotated counters and making things like the Z less uniform (but not twiddly!)  \nYes, a life-sized g!  \nI'll have to come back to your comments tomorrow as I also need to sleep. ¦)  \nI wasn't sure about the name at first, wanted it to be more subversive; but now I like it, and it does fit really well. Crisp. \n"
    },
    {
      "time": "16 Mar 2009 — 5:45pm",
      "content": "Oh, yes, when I say 'text display & web' I mean short passages of text, subheadings and the like. I thought the large x-height and wide proportions would be good for funky websites. But you are right, it shines better at massive sizes!\n\n"
    },
    {
      "time": "16 Mar 2009 — 5:52pm",
      "content": "_\"what a lot of words!  \n[…] a delicious 4\"_    \nOh! Nice. It's really not all about quantity. :-)\n\nYeah that _is_ a yummy 4! I wonder if some of that could carry over to the \"A\"/\"V\"/\"W\", which I find a bit boring frankly (what happened to the rounded inside corner that you have in the \"N\" &c.?). But yeah, don't make them \"twiddly\". :-)\n\n"
    },
    {
      "time": "16 Mar 2009 — 5:53pm",
      "content": "Yes. Wait for the next exciting iteration (not done yet)!\n\n"
    },
    {
      "time": "16 Mar 2009 — 5:59pm",
      "content": "Of course. Please remember to sleep. (I know how it is!) :-)\n\n"
    },
    {
      "time": "16 Mar 2009 — 11:18pm",
      "content": "This is a great sans. I love it.\n\nIf I dig for something to improve about it, about the only thing I can say is that the lowercase t or its crossbar seems a little too short or something. I can't decide if I feel the same way about the f. Maybe I'm just tired, though.\n\nIt's great.\n\n"
    },
    {
      "time": "17 Mar 2009 — 7:22am",
      "content": "I'll post the other numerals in a bit. Why do they take me ten times longer than the alphabetic glyphs?\n\n"
    },
    {
      "time": "17 Mar 2009 — 8:46am",
      "content": "To answer Nina's ideas:\n\nRe the active counters, I wanted there to be a tension between the white and black, created through sometimes the white 'winning' and sometimes the black. That's why the white sometimes spills over and sometimes follows the ductus. I think if the counters were always eating the black it would somehow dissolve the overall solidity?  \nBut anyway, I'm hoping the black and white can look independent but yet equal in strength. (Both equally active)\n\nThere was some post somewhere here (I think) that said stuff about how some fonts look greyer than others, independently of the weight of the glyphs. It was more to do with how the shapes of contours and counters lock together affecting the crispness/contrast...wish I could find that. There were pictures of letters from different fonts of similar weights but some looked far clearer and sharper than others. I know there's been some admiration of how well Helvetica 'locks' the counterspaces within and between letters. (I don't claim I'll be able to achieve anything quite so bold here!)\n\nRe terminals, I'm going to redo the @ so the white space somehow is more active in the terminal. I might open out the apexes of VW etc to be slightly squared off like on the M. And of course the strokes need more flaring.\n\nI'll have a look at heightening the t.\n\nThanks!\n\n"
    },
    {
      "time": "17 Mar 2009 — 2:47pm",
      "content": "I am hoping other people will comment on this as well!\n\n_\"…sometimes the white ’winning’ and sometimes the black. That’s why the white sometimes spills over and sometimes follows the ductus. I think if the counters were always eating the black it would somehow dissolve the overall solidity?\"_\n\nThat's quite possible, yeah. Except maybe if you decide to make it an experimental display face and stop worrying about readability in text.\n\nYour \"battle\" imagery sounds like a Westernized notion of [Notan](http://web.archive.org/web/20150414232406/http:/typophile.com/wiki/Notan)\\*. ;-)  \nAnd right now it is a battle, much like you describe it; more of a to-and-fro between competing partners than an active, tension-based _balance_. Even without bringing in such \"big\" concepts, I'm wondering about consistency I guess. To me say your \"n\" looks like it belongs in a different font than your \"a\" (by a difference of a few em units mind you); I guess the big question is how much you want to even things out, even with the premise of this being somewhat \"experimental\".\n\nTo actually adress some glyphs:  \nI think that \"Q\" is looking a bit prude. :-) I might try making the tail short but strong, [very close to] horizontal, and cutting into the bottom of the bowl (not sticking in, more like the counter having a (near) straight horizontal on the bottom).\n\nAs you might guess, I love your spur-less \"b\", and of course I have to ask if you've tried that for the \"q\" as well? :-) And actually, also the \"u\". Like you said, I'd be curious too to see if it even works in the \"U\".\n\nYour \"c\" and \"e\" look to me like they have an underbite?\n\nI like the curve in the SW corner of the counter of the \"P\" (etc.), and am wondering how/if it would work in the hmn.\n\nYour \"K\" and \"k\" (for example) show that you're giving the verticals a lot of respect, which might make these straight and angular forms a bit boring in the overall context. I'm wondering if you might try playing with the straightness of the stems a bit. (Though this is precisely where I'm biased, because if you want to optimize this for screen use, you should probably introduce less detail strangeness and near-to-straightness than if it's a display face.)\n\n--  \nOh, I'd be interested in reading that other thread you mentioned, if you can find the link.\n\n"
    },
    {
      "time": "17 Mar 2009 — 3:27pm",
      "content": "Yep. That curve on the counter of the P is a good fit for the n. I'm not so sure about the a.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/pan_4593.gif)\n  \nI tried the spurless q, didn't work. I think I didn't try terribly hard as I liked the dq design. Might try again. Will also give the U and u a go. I think it might impair the u's readability. Especially small.  \nYes, c and e do need a dentist. (This really only took a few nights' work so lots of the shapes are significantly sketchy so far!) The Q is another one of those needing a makeover.  \nI'm not sure what you mean about K and k :?  \nOh, my numerals also need lots more work but here's a glance so you get an idea. You don't need to tell me 2 should also be in that queue for cosmetic surgery.\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/mintnumerals_3634.gif)\n  \nAlas, I was searching for that other thread and I can't even remember if it was here on T-phile. Sorry, will keep a look out. \n"
    },
    {
      "time": "17 Mar 2009 — 3:49pm",
      "content": " ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/MintW_5740.gif)\n I had something like this in mind for the VW and perhaps others. \n"
    },
    {
      "time": "17 Mar 2009 — 3:59pm",
      "content": "I think what you show in the MNW is something like what I meant about the Kk. Now there's whitespace pushing in. Before it looked a bit like you had a concept of active white space, but didn't really know how to apply it to the straights/angulars, so those got more \"exact\"/\"normal\" compared with the more \"free-flowing\" curvy glyphs.  \nWhat are you doing in the \"H\"? Can't see anything (except on the outside of the stems). The counters look as peaceful as a mountain lake in the dawn. ;-)\n\nBtw I really like your \"4\", but if that's where your \"2\" is going (I think it's intriguing), you might even try a \"4\" with a slightly curved diagonal? :-\\>\n\n_\"This really only took a few nights’ work\"_  \nYou know, that impresses me beyond belief. Let me apologize if I'm being too anal about details already.\n\n"
    },
    {
      "time": "17 Mar 2009 — 4:26pm",
      "content": "Ha! No, the H is pretty unsophisticated. I just put it there for the proportions. Somehow there needs to be balance and I can't see how yet. I'm worried it'll end up like Template Gothic if I start adding curves at all the corners. Actually that was another font I have been looking at a bit. It's not the look I want here. I really want it to stay 'clean' and already the M and N look slightly subversive! I think W works though. Think I need to move some inflection points.\n\n\\>“This really only took a few nights’ work”  \nOk, so what I meant was the constructing only took a few nights. I have been puzzling over a few of the letters and forms like the serif on a in my head for a few weeks. What a funny world in my head! :)\n\nDetails...yes, no the feedback is great. I'll try to keep up with you! There are so many things to fix. It seems we have different approaches to letterbuilding. You seem to do one or two letters at a time and figure them out in relation to the other existing ones. I think I'm just plunging into the whole lot and then joggling the hastily-made letters until they eventually look nice together with no real appreciation of the background and theory of type design. But it works for me ;) Creativity's a funny thing.\n\nThe only reason the 2 looks so wacky is I can't easily draw straight spined ones. I like the bottom and top and have to figure out the middle.\n\n"
    },
    {
      "time": "17 Mar 2009 — 4:52pm",
      "content": "Here's a go at the K. I tried making the connection have curved counters but that was too much. There had to be other ways to break up the straightness, so the two sides of the nonvertical stroke are now more independent. Left is the original one.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/MintKK_6539.gif)\n\n"
    },
    {
      "time": "17 Mar 2009 — 4:56pm",
      "content": "Does anyone else dislike the G?\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:37am",
      "content": "Overall, I think that this is more promising than Optima. Good stuff!  \nThe numerals seem more expressive than the letters, though.  \nWhere can I see the G, btw? The PDF is not linking for me.\n\n"
    },
    {
      "time": "18 Mar 2009 — 3:24am",
      "content": "The pdf link at the top on the original post should be working now.\n\n"
    },
    {
      "time": "18 Mar 2009 — 4:55am",
      "content": "Well, there is something about the G and the e that fights together. My 2¢\n\n"
    },
    {
      "time": "18 Mar 2009 — 11:25am",
      "content": "_Does anyone else dislike the G?_\n\nI didn't think about it before, but I would think about getting rid of the spur completely--I feel like it eliminates some opportunity for playing with curvature/counterspace dynamics, which are a strength of the typeface. Alternatively, you might play with smoothly extending the curvature all the way up to the arm; right now to me it feels like the spur sort overwhelms that part of the G--I feel like it's \"covering up\" something rather than being part of a single form.\n\n"
    },
    {
      "time": "18 Mar 2009 — 11:28am",
      "content": "I don't know--now that I look at it again, the spur seems to add some consistency vertically--e.g., with H, E, F, etc. The inside of the G still bothers me though.\n\n"
    },
    {
      "time": "19 Mar 2009 — 9:45am",
      "content": "Looking good! The bottom of 'j' looks a little too quaint for the font IMO. I would definitely try a tailed 'U'.\n\nWhat would it look like to introduce some of the unparallel contour independence in 'Z' to the horizontals of other letters like 'E' and 'F'?\n\nI like those 4:52 changes to 'K'.\n\n"
    },
    {
      "time": "19 Mar 2009 — 11:28am",
      "content": "t: Curve into the tail looks a little weak and out of character. It starts to high for one thing. Flip the n 180 and compare the transition.\n\nr: Looks like a chopped off n. It's decent, but could use more weight in the terminal, and possible a slightly lower join.\n\ne: a tad wide, and back leaning.\n\nzZ: More flair in the arms\n\nv: too wide.\n\nJL: too wide. The poor people LJUBLJANA!\n\nij: Dots a tad too small. Check to make sure they are the same size, they appear to hint differently. Also, conisder raising them a tad.\n\nround letters (o b d p q) consider a touch more squareness inside, and a little more width.\n\n@: I prefer the a to sit on the baseline for harmony with the lc. You can make it align with caps via case-sensitive forms. LC is more likely [Blahblah@blahblah.com](mailto:Blahblah@blahblah.com)\n\nH: tad wider?\n\nIt would be helpful to see a text setting that is more representative. Paragraphs various point sizes, starting at text sizes. As always, these are suggestions.. your instincts are obviously very good so listen with a grain of salt! :-)\n\n"
    },
    {
      "time": "19 Mar 2009 — 12:03pm",
      "content": "Wicked! These are all really helpful suggestions.\n\nI'm already working on some of those idiosyncrasies like making the Zz more flared and copying that over onto the EF for example.\n\nI'm especially interested to see what might happen if the counters on obdpq are more square as that would obviously make them very much independent of the base.\n\nWill get back to you with the results. Thanks :)\n\n"
    },
    {
      "time": "19 Mar 2009 — 2:06pm",
      "content": "So here's what happened to e:\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/Mintee_4831.gif)\n  \nThe crossbar is slightly lower, and the terminal is now left of the corner. \n"
    },
    {
      "time": "19 Mar 2009 — 2:30pm",
      "content": "And G went this way:\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/MintGG_3680.gif)\n\n"
    },
    {
      "time": "19 Mar 2009 — 2:56pm",
      "content": "\\>t: Curve into the tail looks a little weak and out of character. It starts to high for one thing. Flip the n 180 and compare the transition.\n\nInteresting. Actually I rotated the n by 180 degrees and the curve on it has a larger radius (both inner and outer curves of the n are highlighted in red).\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/mintt_3811.gif)\n\nStill, I have added more rigour to the t curve and you are right it looks better with a smaller radius and more weight on the tail.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/minttt_5576.gif)\n\nI can't decide (and this goes for the whole font) whether the terminals should be vertical or slanted and if slanted whether they should all be cut at right angles to the curves or something else. I actually prefer the angle the original t is cut off, though the terminal is not heavy enough. So many choices! :)\n\n"
    },
    {
      "time": "19 Mar 2009 — 3:01pm",
      "content": "So I wasn't happy with that last one and tried again:\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/minttt2_5598.gif)\n\n"
    },
    {
      "time": "21 Mar 2009 — 5:22am",
      "content": "I think my experiment with U crashed.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/futaleufu_5781.gif)\n  \nGreen dots show the original one. The other 4 are all different.  \nAnd I'm not convinced about the flaring arms of E either. Maybe too much? \n"
    },
    {
      "time": "21 Mar 2009 — 7:02am",
      "content": "I flared the thins on Z, reduced the flare on E and N, went back to the original U but tweaked the curve and made the right stem flare, and added a question mark.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/zambia_6461.gif)\n  \nIt's suddenly reminding me of Peignot, slightly, with the vertical stress and letterforms. \n"
    },
    {
      "time": "21 Mar 2009 — 8:30am",
      "content": "I actually like the upper right U in the U-experiment image. I don't know if it's necessarily better than the original, but it's worth exploring.\n\n"
    },
    {
      "time": "21 Mar 2009 — 9:43am",
      "content": "Of the variants of U, I like the one with the true tail best, but your tailless U looks great. I see Peignotesque flavor here too (particularly the A). To my eyes the Z's tapers get a touch too thin.\n\n"
    },
    {
      "time": "21 Mar 2009 — 12:05pm",
      "content": "The \"U\" experiment is interesting. I agree with Jelmar about liking the top-right most (and also about not being sure it's better; but it is intriguing). Though I'm not sure if the \"corner\" shouldn't come down a tiny hint more (but not as much as in the bottom-left one, the corner seems too black there?).\n\n\"Z\": Agree it is a bit much, but it \\*rocks\\* :-)  \nMaybe you could try something like this in the \"M\" too?\n\n"
    },
    {
      "time": "21 Mar 2009 — 12:32pm",
      "content": "This is evoving into a delicious typeface, I'm really sorry I haven't paid attention to it earlier, guess I was too deeply into my own work. The lowercase t is really glorious now, and the new Z is marvellous. However, the M doesn't quite match the N, Z, V and W in terms of \"whitespace-creeping\", perhaps you should gnaw a little on the middle peak and hollow out the armpits slightly more. I would have put some more weight on the middle stroke of the E, and perhaps slightly more tapering on the I and l. I'm really looking forward to see this further developed.\n\n"
    },
    {
      "time": "21 Mar 2009 — 1:17pm",
      "content": "\\>hollow out the armpits slightly more.\n\nhahahahahahahaha! Oh goodness! That's the funniest thing I've read on Typophile!\n\nHere's what I did with U.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/UUU_4983.gif)\n  \nI'm gonna keep the left one as the normal U, as the slightly flared right stem echoes the other caps. I might include an alternate. Nina's suggestion is on the right; the middle one is a kind of halfway stage. I like the asymmetry but it does kind of remind me of Dax/Barmeno. And I can't flare the right stem with the 'corner' there, it looks very odd. \n\nI'm enjoying making this. Here are the numerals with a bit more work done.\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/mintnumerals2_6705.gif)\n\n"
    },
    {
      "time": "21 Mar 2009 — 1:25pm",
      "content": "Here's a quick try with the A and M (gnawing the armpits)\n\n ![](http://web.archive.org/web/20150414232406im_/http:/typophile.com/files/mintzam_5800.gif)\n  \nI think they work nicely. \n"
    },
    {
      "time": "21 Mar 2009 — 1:28pm",
      "content": "Great stuff, Ben.  \nI think you're on a good way to lose any Optima connection too, FWIW ;-)\n\n"
    },
    {
      "time": "21 Mar 2009 — 1:34pm",
      "content": "Yes, that looks fab. Do you think the center point of the M wants to go a little to the left?\n\n"
    }
  ]
}
