{
  "id": "5589",
  "title": "(x) Script \"e\", similar to Isadora - Zapfino {Yves}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Zapfino Two, a little squished, looks about right to me. That was some quick-batter waffle right there.\n\n",
  "author": "cheshiredave",
  "time": "Tue, 2004-07-13 01:04",
  "uid": "1112",
  "comments": [
    {
      "time": " Tue, 2004-07-13 01:48",
      "content": "Gladly. When is that exactly?\n\n"
    },
    {
      "time": " Tue, 2004-07-13 02:25",
      "content": "(hint taken indeed!)\n\n"
    },
    {
      "time": " Tue, 2004-07-13 07:15",
      "content": "Back to the subject. I looked at the Zapfino family and tried to find any other close looks (skimming through the Yellow Book). Then I threw in two well-known elegant style scripts just for comparison. Admittedly, e is not the most distinctive letter in a script font, but at this size it's hard to argue with Yves. If this is NOT the answer I'd like to see whether someone found a Zapfino rip-off.   \n ![Various Script e's](http://web.archive.org/web/20050816153928im_/http:/www.typophile.com/forums/messages/83/40532.gif)\n\n"
    },
    {
      "time": " Tue, 2004-07-13 11:27",
      "content": "Maria, just wondering, what's this game you're talking about?\n\n"
    },
    {
      "time": " Tue, 2004-07-13 19:44",
      "content": "_...it's possible that exists another font identical to Zapfino, but with another name?_   \n   \nIf so, it would be a knock-off/pirated/rip-off version. Zapfino is a very distinctive typeface designed by one of the world's most revered living type designers, Hermann Zapf.\n\n"
    },
    {
      "time": " Wed, 2004-07-14 02:13",
      "content": "I have seen a number of these font identification games, because I was asked for help many times, and this wouldn't be the first time that someone used a renamed rip-off version of a font and thought it was something original. Most casual font fans are more familiar with the 'free' versions of things than the originals they are based on, and they don't even know that an original exists.   \n   \nI suspect that's what's happened here.   \n   \n(This is the reason I always try to show the true font names and designers in my Script Guide.)\n\n"
    },
    {
      "time": " Wed, 2004-07-14 11:53",
      "content": "Sorry, Maria. I (we) don't support the idea of ripping off fonts, and it would be proper and ethical if you wouldn't either. What you are talking about is font piracy, because there are no authorized 'free' versions of Zapfino.\n\n"
    }
  ]
}
