{
  "id": "55904",
  "title": "Font metrics for professional beginners! Help!",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I got already designed type faces in Illustrator but I need now to implement them in FontLab. What I need is to not screw something on the beginning! Like dimensions of my letters in Illustrator and dimensions of my letters implemented in FontLab like font height, width, ascender, descender etc. Need help or some good tutorial or guide for professionals not amateurs!!! cause I wanna do my first font well.\n\nMy font on which I currently working is non serif and modern looking. I need some spacing/kerning advices too. I need to make \"my beauty\" right! Help me!\n\n",
  "author": "Gorgoyle",
  "time": "16 Mar 2009 — 3:02am",
  "uid": "42993",
  "comments": [
    {
      "time": "16 Mar 2009 — 3:15am",
      "content": "Starting with the most important: vertical metrics (it is the \"worst\" to correct later if you get it wrong ;)\n\nIf you work with a UPM of 1000, try to import your capital letters around 700 in height in FontLab. This will make them pretty \"standard\" in height compared to other fonts.\n\nAs for spacing and kerning: try things out, test it, look at other (similar) fonts and learn from them ;)\n\nThere are some very good articles in the TypoWiki - look especially in the \"How-To\" section...\n\nGood luck! :)\n\n"
    },
    {
      "time": "16 Mar 2009 — 7:19am",
      "content": "RTFM, then read this: [http://www.kltf.de/downloads/FontMetrics-kltf.pdf](http://web.archive.org/web/20131106074745/http:/www.kltf.de/downloads/FontMetrics-kltf.pdf \"http://www.kltf.de/downloads/FontMetrics-kltf.pdf\")\n\n"
    },
    {
      "time": "16 Mar 2009 — 7:44am",
      "content": "On spacing, start with [Briem](http://web.archive.org/web/20131106074745/http:/briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm).\n\n"
    },
    {
      "time": "16 Mar 2009 — 7:44am",
      "content": "n.b.: \"RTFM\" = \"Read The FontLab Manual\" :-)\n\n"
    },
    {
      "time": "17 Mar 2009 — 12:28am",
      "content": "Yes I work with a UPM 1000. Thx guys! =D\n\n"
    }
  ]
}
