{
  "id": "55913",
  "title": "Constructive",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "(I don't know if that name is available, but that's what I have it called for internal purposes)\n\nAnyway, here is my first \"constructed\" typeface. I realized I had never built a geometric typeface before, so I started on this. I like the look of bitmap types and of course, constructivist types, so that's what I was going for here. Oh, and it's monospaced.\n\nCritiques welcome :)\n\n ![](http://web.archive.org/web/20150417061857im_/http:/typophile.com/files/constructive_6226.png)\n\n[Version .01 PDF](http://web.archive.org/web/20150417061857/http:/dangayle.com/ftp/constructive.pdf) (edited to show paragraph)  \n [Version .02 PDF](http://web.archive.org/web/20150417061857/http:/dangayle.com/ftp/constructive.02.pdf) (New forms and numerals)\n\n",
  "author": "Dan Gayle",
  "time": "16 Mar 2009 — 9:05am",
  "uid": "12948",
  "comments": [
    {
      "time": "16 Mar 2009 — 11:00am",
      "content": "The W seems a little uptight. And the diff between k and l (ell) seems a little odd. I guess you'd need to see a paragraph or two before really knowing? And the p and q. Maybe I'm not the target audience. ;^)\n\n"
    },
    {
      "time": "16 Mar 2009 — 11:18am",
      "content": "dp\n\n"
    },
    {
      "time": "16 Mar 2009 — 11:17am",
      "content": "Ascenders and descenders are certainly a problem, now that I look at it. The second I posted this I realized that the LC k was having issues. It looks bigger than the rest of the lower case. And I forgot the reason I made the LC l not ascender hight. I'll have to revisit that.\n\nThe W is going to feel cramped in any monospace, but I do see that there is some improvement I can make. The inside cuts should be lowered, that's what I notice right away.\n\nI'll set a paragraph in the font, but I assure you, it won't be pretty :)\n\n ![](http://web.archive.org/web/20150417061857im_/http:/typophile.com/files/constructive_4304.png)\n\n"
    },
    {
      "time": "16 Mar 2009 — 4:28pm",
      "content": "You’re being too conservative in a few ways (I ran into the same problem with the constructivist types I’ve worked on and never released). You stick to historical constructivist form in M and N, but then break to idealized serif form in E and F. And you’re trying to force some creativity with f, l, and p in a way that’s too academic. Loosen up some—the constructivists did some crazy things with their letters, but to find it you have to stay away from the the experiments of the Dutch and German designers whose funky letters make a nice-looking alphabet but bad-looking words; IMHO only the Stenberg brothers did regimented lettering very well. Check out the early chapter’s of Maria LaFont’s _Soviet Posters_ to see examples of the stuff that doesn’t turn up in every history book—there’s a lot more possibility when stuff gets weird and less conceptual.\n\n"
    },
    {
      "time": "16 Mar 2009 — 4:49pm",
      "content": "Have you seen [this Flickr set from user BPX](http://web.archive.org/web/20150417061857/http:/www.flickr.com/photos/bpx/sets/72057594117941491/)?\n\nHe has a nice selection of Stenberg posters and other constructivist materials. I'll have to check out that book though.\n\n"
    },
    {
      "time": "16 Mar 2009 — 5:16pm",
      "content": "Wow, that Flickr set is great—all the crazy letters in there are exactly what I’m talking about.\n\n"
    },
    {
      "time": "17 Mar 2009 — 7:56am",
      "content": "So I took your advise, and added a feature that I had previously contemplated. I cut wedges into the horizontal terminators in a way that I had seen, and surprisingly I think it helps the rendering of the fonts when at smaller sizes.\n\nAnd I finished my UC numerals. Don't know how I'm going to do the small caps numerals though, since there is only so much space to work with at that size.\n\n ![](http://web.archive.org/web/20150417061857im_/http:/typophile.com/files/constructive_5374.png)\n\nNew .pdf uploaded above.\n\n"
    },
    {
      "time": "19 Mar 2009 — 3:08pm",
      "content": "darned double posts\n\n"
    },
    {
      "time": "19 Mar 2009 — 3:07pm",
      "content": "For fun. Not the greatest design, but perhaps it shows sorta what I'm going for:\n\n ![](http://web.archive.org/web/20150417061857im_/http:/typophile.com/files/Picture-12_4044.jpg)\n\n"
    },
    {
      "time": "20 Mar 2009 — 9:33am",
      "content": "This is a more interesting direction, but why is the default spacing so wide? I think you’ll get a more interesting design by closing things up and working on interactions between the counters.\n\n"
    },
    {
      "time": "20 Mar 2009 — 10:46am",
      "content": "I did think of making the spacing normal, but I would also like to have full monospacing as well. I assume thats the kind of thing I can do with opentype. Duplicate all the glyphs, then create stylistic alternates.\n\nMy dual commission to myself is to create an interesting pixel-height font as well as an interesting display font.\n\nI will spend some time working on this more. Especially since I created the cuts on the left and the right, tightening things up will help everything flow better together.\n\n"
    },
    {
      "time": "1 Apr 2009 — 12:24am",
      "content": "@DanGayle\n\nThanks for the flickr link.\n\n"
    },
    {
      "time": "20 Apr 2009 — 5:05am",
      "content": "I think your small cap B looks like an 8. But, that z is darn sexy.\n\n"
    },
    {
      "time": "20 Apr 2009 — 8:44am",
      "content": "I guess it gets to the point in any geometrically constructed typeface that you need to start moving away from geometry into personal choice/flavor/optical adjustment/etc.\n\nThat time is now :)\n\n"
    },
    {
      "time": "20 Apr 2009 — 10:03am",
      "content": "You make your rules, and then you break them. :)\n\n"
    }
  ]
}
