{
  "id": "55922",
  "title": "First Font.. With Q-tips?",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Okay, so.. here is what I have so far. I'm still working out kinks on a few letters.. I'm still not sure of the width and angles of the A and the B. I'm also not sure if I should be varying the number of Q-tips more for line width(right now it's 4 for thick, 3 is the middle ground, and two is the thinnest).. Any suggestions are greatly appreciated!\n\n| Attachment | Size |\n| --- | --- |\n| [hamburfonts.pdf](http://web.archive.org/web/20150416061705/http:/typophile.com/files/hamburfonts.pdf) | 126.84 KB |\n\n",
  "author": "srquresh",
  "time": "16 Mar 2009 — 11:17am",
  "uid": "41403",
  "comments": [
    {
      "time": "16 Mar 2009 — 11:47am",
      "content": "Are your professors not teaching you anything other than how to take up space on typophile for a grade?\n\nAt least look at some historical material so that you can get the thicks and thins correct : )\n\nYou kids post and run... I have noticed this since you all signed on. What is the purpose of being a member here if all you are trying to do is... Hey Ms. Whoever, can you believe it. I had the intelligence to post to Typophile last night? Ain't I smart?\n\nAt least you are trying to do something with the info that is being thrown around in class. The rest of your buddies are just showing up for the grade.\n\nMichael\n\n"
    },
    {
      "time": "16 Mar 2009 — 11:48am",
      "content": "\"You kids post and run\"\n\nI'm pretty sure that is the sole point of the assignment.\n\nHave we tracked down this professor yet? We need to activate our hive mind powers and rap a ruler across this professor's knuckles... ;o)\n\n"
    },
    {
      "time": "16 Mar 2009 — 12:02pm",
      "content": "I did an AIGA lecture down there a number of years ago and their hero was Ed Fella and that told me a lot.\n\nDada regurgitation : )\n\nMichael\n\n"
    },
    {
      "time": "16 Mar 2009 — 12:01pm",
      "content": "Hey Darrel\n\nDo you remember the old cartoon with the stupid dog that used to sing \"Oh I'm bringin' home a baby bumble bee, won't my momma be so proud of me?\" That is what we are dealing with.\n\nSofia, sorry, at least you are doing something creative with the info. Even if it is uninformed by your professors.\n\nMichael\n\n"
    },
    {
      "time": "16 Mar 2009 — 7:01pm",
      "content": "Thanks for the direction, looks like I will be researching a bit more :)\n\n"
    },
    {
      "time": "18 Mar 2009 — 8:28am",
      "content": "It's interesting to see where you are going with this. You might consider bending or breaking some of the forms to get some more shapes. This could be used to make the letter forms more stadardized in width. The cross bar on the H as an example. If it bent in half downward the width of the character could be adjusted to be more in keeping with the rest of the characters. Right now it looks a little awkward. Good luck and have fun.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150416061705/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "19 Mar 2009 — 11:00am",
      "content": "I would much rather see the real things made into letters, instead of traced and digitized drawings of them. Or maybe both?\n\n"
    },
    {
      "time": "19 Mar 2009 — 11:50am",
      "content": "_I would much rather see the real things made into letters, instead of traced and digitized drawings of them. Or maybe both?_\n\nThat could be cool. Downside, I don't think high res jpgs can be made into a keyable font. It would still be cool.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150416061705/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "19 Mar 2009 — 8:42pm",
      "content": "You're right, they can't. But as a seperate project I think it could be interesting, a poster or something.\n\n"
    }
  ]
}
