{
  "id": "55927",
  "title": "Small Caps Font Versions: Useful or Redundant?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've seen fonts that were small caps due to the font's complexity. I've also noticed that other fonts with a standard lower case are sometimes release in a small caps versions. Are there any guidelines for creating a small caps version of a font. Are small caps version used, or are they redundant? Who thinks the question itself is redundant.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131019145239/http:/www.thefontry.com/)\n\n",
  "author": "phrostbyte64",
  "time": "16 Mar 2009 — 12:45pm",
  "uid": "37869",
  "comments": [
    {
      "time": "16 Mar 2009 — 12:48pm",
      "content": "Small caps is a must in editorial context.\n\n"
    },
    {
      "time": "16 Mar 2009 — 12:51pm",
      "content": "I won't buy a new text font if it doesn't have small caps.\n\n"
    },
    {
      "time": "16 Mar 2009 — 1:55pm",
      "content": "Interesting, but what about display fonts?\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131019145239/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:05am",
      "content": "It's arguable that small caps are even more useful in display settings, since the lack of descenders can make for a more compact line.\n\n"
    },
    {
      "time": "17 Mar 2009 — 1:59pm",
      "content": "I use small caps when I design metal plaques. My recent favorite for this is Jos Buivenga's Fontin. I use it where mixed case might be used (especially lists of names) but upper case is more formal. The larger first letter aids legibility. It is very satisfying to see my designs cast in bronze (and other metals, too).\n\n[bronze plaque](http://web.archive.org/web/20131019145239/http:/www.albanysigns.com/pictures/plaque_5.jpg)\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:52am",
      "content": "I understand that small caps are useful, but is it beneficial to have a typeface in small caps, particularly with a display typeface?\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131019145239/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "18 Mar 2009 — 10:07am",
      "content": "Depending on how \"showy\" it is. If it's an ultralight Didone that would never be used for text, I'd say for sure. If it's Curlz, I'd say, What's the point?\n\n"
    }
  ]
}
