{
  "id": "55948",
  "title": "Critique Please: Poster Typography Layout",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hey all—\n\nJust want to run this by you for the thoughts. This is the bottom end to a poster I'm designing for our SGA. I want to get your feedback on the Copy Set. Satisfactory? Lacking? Terrible? Readability is going to be an issue because the picture takes precedence so any suggestions on alternative arrangements?\n\nSo you don't have to look it up: The Font is Century Schoolbook. I'm going through a Slab Serif phase...\n\nThanks!!\n\n-JD\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.png](http://web.archive.org/web/20140725184113/http:/typophile.com/files/Picture%202_127.png) | 78.26 KB |\n\n",
  "author": "James Deux",
  "time": "16 Mar 2009 — 6:54pm",
  "uid": "36883",
  "comments": [
    {
      "time": "18 Mar 2009 — 12:32pm",
      "content": "In my opinion the B in Ben is really fighting with the copy above it, perhaps try it as a drop cap?\n\nAlso, I would really try and get Richard Nixon back up to that first line, the way that first line ends at the moment just doesn't feel comfortable to me.\n\nAnd maybe try something different with the event details. Perhaps set the details over two lines, slightly larger and the same size as the date?\n\nGood work overall.\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:14pm",
      "content": "Peter,\n\nThank you for the feedback! I'll take all things into account.\n\nThe B is inexcusable though. I might drop it from the side.\n\n"
    },
    {
      "time": "19 Mar 2009 — 1:55am",
      "content": "Maybe it's because I don't see the upper part, but I fail to see an inherent logic in the placement of the date (except perhaps that the column starts where the other ends). Because it seems a bit crowded, you could try to flush it with the right margin? In general, I think it lacks some breathing space as well as contrast. Both could be achieved with more generous spacing between the details and the body (if possible) or a different face.\n\nUse proper quotes in the text. Use a dash for ranges, not a hyphen.  \nWhat's with the slanted exclamation marks?\n\nI agree with the comment regarding the drop capital and the first linebreak.\n\n"
    },
    {
      "time": "19 Mar 2009 — 8:10am",
      "content": "What is the input on a Mac for proper quotes?\n\nAlso; I realize you are quoting larger typographic standards but I have consistently questioned the \"proper\" use of a dash concerning dates. For myself, I have always found that it consumed too much space on the page.\n\nRegardless, thank you for the suggestions! I'll work on it. I'll also post the full poster shortly.\n\n"
    },
    {
      "time": "6 Apr 2009 — 4:47am",
      "content": "I'd lose all of the superscript: 53rd, 1st and 7.00–8.30 PM (with PM in small caps after a space and an en dash instead of a hyphen).\n\n53 doesn't need to be in italic. Instead I would put the title What Matters Most in italic and lose the double quotes.\n\nAre these proper small caps or fake ones? I can't tell with the resolution of the image. If they're fake I would use a mixture of upper- and lower-case or all-caps in the title instead.\n\nFormer Presidents doesn't need initial caps. \"Late\" is also probably superfluous.\n\nWhy NYTimes? Do you mean The New York Times or are you only referring to the New York Times website. This could be more specific.\n\nModern-day renaissance man can lose the small-caps and the exclamation marks. I would lose the renaissance man completely anyway: it suggests that he has a wide range of talents in diverse fields whereas this person seems to be very successful in one field.\n\nGood luck.\n\nEd\n\n"
    },
    {
      "time": "7 Apr 2009 — 4:58am",
      "content": "Quotes…\n\n“ Alt+[  \n” Alt+Shift+[  \n‘ Alt+]  \n’ Alt+Shift+]\n\n"
    }
  ]
}
