{
  "id": "55940",
  "title": "Italian font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for Italian fonts for a logo, any suggestions would be helpful thank you.\n\n",
  "author": "petapi",
  "time": "16 Mar 2009 — 4:22pm",
  "uid": "42558",
  "comments": [
    {
      "time": "16 Mar 2009 — 4:29pm",
      "content": "Check out [Mostra](http://web.archive.org/web/20150214062949/http:/www.ms-studio.com/FontSales/mostra.html)\n\n"
    },
    {
      "time": "16 Mar 2009 — 5:43pm",
      "content": "Looking/feeling Italian, or by an Italian designer?  \nWhy?  \nWhat's the logo for?\n\n"
    },
    {
      "time": "17 Mar 2009 — 6:43am",
      "content": "I'm looking for all options so anything from Italian looking, to Italian designer is good.  \nIt's for a range of Italian food products.  \nThank you for your help\n\n"
    },
    {
      "time": "17 Mar 2009 — 8:39am",
      "content": "Check out this site with recent italian fonts:  \n [http://www.progetto-italic.org/](http://web.archive.org/web/20150214062949/http:/www.progetto-italic.org/ \"http://www.progetto-italic.org/\")\n\n(It's a site coupled with a wonderful book called “Italic 2.0”).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "22 Mar 2009 — 2:27am",
      "content": "It would be interesting to know what marks 'an italian design'. I've had a client recently ask me the same. He wanted an Italian style logo. He marked it as brown/yellow toned, modern and 'designerish'. That's not enough for me to make a good logo...  \nSo if anyone has some thoughts on how to make a good Italian style logo, please hook up here.\n\n®\n\n"
    },
    {
      "time": "22 Mar 2009 — 7:15am",
      "content": "Something that was done with our [Giacomo](http://web.archive.org/web/20150214062949/http:/www.terminaldesign.com/fonts/set/?ID=16)\n\n ![](http://web.archive.org/web/20150214062949im_/http:/typophile.com/files/crema_5065.jpg)\n\n"
    },
    {
      "time": "22 Mar 2009 — 7:19am",
      "content": "Pursuing Rene's line of thought:  \nWhat makes Giacomo Italian (beside the name)?\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2009 — 11:10am",
      "content": "Montalbano sounds kind of Italian :-)\n\n"
    },
    {
      "time": "22 Mar 2009 — 11:41am",
      "content": "[Montalbano, indeed, is the name of a famous detective in a series of books by the italian writer Andrea Camilleri (but the name of the detective is an homage to another writer: Manuel Vazquez Montalban).]\n\nI find Mostra so \" [Italy, 1930](http://web.archive.org/web/20150214062949/http:/en.wikipedia.org/wiki/Mussolini)\" that every time I see it I feel like I’m going to drink a bottle of [castor oil](http://web.archive.org/web/20150214062949/http:/en.wikipedia.org/wiki/Castor_oil#Use_as_a_means_of_intimidation_in_Fascist_Italy).\n\n"
    },
    {
      "time": "22 Mar 2009 — 12:47pm",
      "content": "Looking at Mostra and Giacomo, they seem to be quite different. Mostra is very sharp and geometric, where Giacomo is soft and warm.  \nI think the hard part is if you try to define a certain style that covers a few centuries. Perhaps we should narrow it down to the last 40 years?\n\nOk, let me make a kick-off (and I'm surely not an expert on Italian style fonts). Italian style fonts:  \n- are quite often 'fat' like Extra Bold or Black  \n- quite often have a slightly rotated backwards 'e', giving it a diagonal cross bar  \n- are mainly serif fonts  \n- can ofcourse be sans serif and then often have soft endings\n\nHow far am I off? ;-)  \nNow it's your turn.\n\n®\n\n"
    },
    {
      "time": "22 Mar 2009 — 1:23pm",
      "content": "I'm a Sicilian-American, not an Italian. I don't think Giacomo is particularly Italian. I do think that it is particularly me. The design of the Crema label does follow a particular vague Italian style, but it wasn't done by an Italian. Eurostyle, Microgramma, Egiziano were done by Novarese. Are they particularly Italian? Perhaps. The fonts shown on the Progetto-Italic site don't strike me as particularly Italian either.\n\n"
    },
    {
      "time": "22 Mar 2009 — 1:49pm",
      "content": "James, from your point of view, is there something particular that gives you a warm feeling when you thing of italian fonts?  \nPerhaps the possible smell of a really nice pizzzzzzza? ;-)\n\n®\n\n"
    },
    {
      "time": "22 Mar 2009 — 1:55pm",
      "content": "I googled Aldo Novarese and he's created an impressive portfolio of fonts! Them being all different makes the question even more difficult. Finding more and more italian style fonts takes me even farther away from the finish line.\n\nMy god, I still love Eurostyle. I'e used it throughout my complete academy time and it brings back a lot of good memories.\n\n"
    },
    {
      "time": "22 Mar 2009 — 4:58pm",
      "content": "BTW, there's a newborn magazine (for which I'm writing  \na review) that people into this thread might enjoy:  \n [http://www.tipoitalia.it/](http://web.archive.org/web/20150214062949/http:/www.tipoitalia.it/ \"http://www.tipoitalia.it/\")\n\nNeedless to say, they make a point of  \nusing fonts with a strong Italian angle.\n\nhhp\n\n"
    },
    {
      "time": "22 Mar 2009 — 7:21pm",
      "content": "I dunno, except for the obvious references, not very italian to me.\n\n"
    },
    {
      "time": "22 Mar 2009 — 8:12pm",
      "content": "My most Italianate faces: [Beaufort](http://web.archive.org/web/20150214062949/http:/www.shinntype.com/beaufort.html), [Eunoia](http://web.archive.org/web/20150214062949/http:/www.shinntype.com/eunoia.html), [Nicholas](http://web.archive.org/web/20150214062949/http:/www.shinntype.com/nicholas.html).\n\n"
    },
    {
      "time": "22 Mar 2009 — 8:29pm",
      "content": "_I find Mostra so “Italy, 1930” that every time I see it I feel like I’m going to drink a bottle of castor oil._\n\nThat made me laugh. :-)\n\n"
    },
    {
      "time": "23 Mar 2009 — 4:40am",
      "content": "Yesterday I was just talking with a friend calligrapher about what identify Italy, graphically. She suggested me that outside Italy, for example for food packaging, we are identified by smooth, curvaceous scripts, etc., and not by the sharpness of futurism (we are living a futurism revival for the 100th anniversary of the futurism manifesto, and everything become irritating when is coupled with the quasi-fascist social decline of our country).\n\nThen I suggest to look at some late 19th century typeface and, if you have the opportunity, at the actual packaging of the period.\n\n@Mark  \nI wish I could laugh\n\n"
    },
    {
      "time": "23 Mar 2009 — 7:59am",
      "content": "Sorry. I'm not saying it's funny what happened in Italy in the 1930s. I know what you meant. It was just that your reaction to the face was not the one I usually get.\n\n"
    },
    {
      "time": "23 Mar 2009 — 8:36am",
      "content": "Mark, don’t worry, it was only a joke :-)\n\n"
    }
  ]
}
