{
  "id": "55953",
  "title": "oppinions on two samples (poster/postcard/cover)",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I've been working on two designs for postcards. They're meant to advertise books. I think they could just as well be book covers (except that one should then be rotated and the stress changed to vertical).\n\nWhat do you think?\n\n_PS: the translations would be something like \"Dick Poems\" & \"The Flashing of Orange on Traffic Lights\"_\n\n_Edit: added a third one (\"Getting used to the Light\") to complete the series. Corrections to \"Flashing\"._\n\n| Attachment | Size |\n| --- | --- |\n| [kurcpesmi\\_kartica4.pdf](http://web.archive.org/web/20140725162117/http:/typophile.com/files/kurcpesmi_kartica4.pdf) | 31.2 KB |\n| [pepelnik\\_kartica5.pdf](http://web.archive.org/web/20140725162117/http:/typophile.com/files/pepelnik_kartica4.pdf) | 114.16 KB |\n| [hocevar\\_kartica\\_3.pdf](http://web.archive.org/web/20140725162117/http:/typophile.com/files/hocevar_kartica_3.pdf) | 411 KB |\n\n",
  "author": "omeld",
  "time": "17 Mar 2009 — 2:43am",
  "uid": "41766",
  "comments": [
    {
      "time": "19 Mar 2009 — 12:48pm",
      "content": "Double post, sorry.\n\n"
    },
    {
      "time": "19 Mar 2009 — 12:48pm",
      "content": "My thoughts:\n\n1. Too much space between R and C in \"KURC\". The name needs manual kerning, too. Look carefully at the spaces between the letters. Make the \"LUD Literatura 2009\" bolder, perhaps in all caps. Lose that star, it adds nothing.\n\n2. Good use of an often misused typeface. Mrs. Eaves was all the rage five or ten years ago. The background makes me slightly nauseous, but that's probably the intention. Good work.\n\n3. \"Privajanje\" looks too light, and the letterspacing in \"svetlobo\" looks weird.\n\n"
    },
    {
      "time": "20 Mar 2009 — 10:32am",
      "content": "I totally agree about the kerning, thanks for pointing it out. I guess I was just too eager to share the layouts with everyone here to even give kerning a thought. Lesson learned! I've also made \"Privajanje\" bold.\n\nI'm surprised though that you found the star superfluous. I thought the little sun-like dings on the orange one were maybe a bit too much, but if nothing else the author loved it. In my oppinion, they all have a rapport with the titles and contents. Believe me, however, I fully understand that no explanation or reasoning, no matter how brilliant, don't make up for bad art.\n\nThanks again for the input!\n\n"
    }
  ]
}
