{
  "id": "55962",
  "title": "The difference between a font and a typeface. Is there one?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Define the difference between a font and a typeface? Is there one?\n\n",
  "author": "photosynthesize",
  "time": "17 Mar 2009 — 6:53am",
  "uid": "24895",
  "comments": [
    {
      "time": "17 Mar 2009 — 6:54am",
      "content": "Font = Software  \nTypeface = Letters\n\n"
    },
    {
      "time": "17 Mar 2009 — 6:55am",
      "content": "i don't agree. the word 'fount' has been used for a very long time when referring to typesetting.\n\n"
    },
    {
      "time": "17 Mar 2009 — 6:59am",
      "content": "Don't we live today? :)  \nNo, of course I was generalizing but there is some truth in there I think.\n\nA typeface can be drawings on a piece of paper, that can never a font be.\n\n"
    },
    {
      "time": "17 Mar 2009 — 7:06am",
      "content": "The typeface is the design and the font is the means of reproducing that design.\n\n"
    },
    {
      "time": "17 Mar 2009 — 7:14am",
      "content": "Mark Simonson says [here](http://web.archive.org/web/20131023113624/http:/typographica.org/001124.php): “The physical embodiment of a collection of letters (whether it’s a case of metal pieces or a computer file) is a font. When referring to the design of the collection (the way it looks) you call it a typeface.”\n\n"
    },
    {
      "time": "17 Mar 2009 — 7:19am",
      "content": "\\*rubs head confusedly\\* i reckon the terms have become interchangeable today.\n\n"
    },
    {
      "time": "17 Mar 2009 — 7:39am",
      "content": "Too late to cast your vote, too early to read the results:  \n [http://www.thomasphinney.com/2009/02/font-name/](http://web.archive.org/web/20131023113624/http:/www.thomasphinney.com/2009/02/font-name/ \"http://www.thomasphinney.com/2009/02/font-name/\")\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:50am",
      "content": "The Helvetica available from Adobe, Linotype, Monotype, and Letraset are all the same typeface, but different fonts. It's a clear but not very important distinction. In practice, I'm happy if I can stop laymen from using \"font\" to describe hand lettering (\"He wrote a note on the chalkboard in a really big font.\" NO).\n\n"
    },
    {
      "time": "17 Mar 2009 — 10:15am",
      "content": "_i reckon the terms have become interchangeable today._\n\nThey're interchangeable until you need to make a distinction. In practice, this means that for the typical user, they are interchangeable, while for type professionals they are more like to be used in a more precise and differentiated way. I need to be able to distinguish between a design and an implementation of that design in a particular technology. As you say, the word ‘fount’ has been around for a long time, but it has always referred specifically to a particular implementation of a typeface: formerly a tray of metal type at a particular size -- e.g. ‘a 10pt font of Times New Roman’ --, then to a set of Linotype matrices or a Monotype matrix case, then to a variety of glass and film negatives or positives, and most recently to software.\n\n"
    },
    {
      "time": "17 Mar 2009 — 10:17am",
      "content": "True, with digital scalable lettering the distinction becomes less important. Prior to digital type a font was a complete set of characters of a certain weight and size i.e. **16pt Bodoni Bold** , whereas **Bodoni** would be the Typeface.\n\n"
    },
    {
      "time": "17 Mar 2009 — 3:06pm",
      "content": "I'm well into writing up my survey results, but have a way to go yet before I'm done.\n\nUnfortunately I'm traveling at the moment, and speaking at a conference tomorrow. But I should find time over the next few days to finish that up.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "17 Mar 2009 — 3:56pm",
      "content": "Very simply put: A typeface is a set of one or more fonts.\n\nTypeface = Parent;  \n Font = Child;\n\n"
    },
    {
      "time": "17 Mar 2009 — 11:40pm",
      "content": "If your mother tongue is Dutch, German, French or Spanish, and you are asked for the equivalents of \"font\" and \"typeface\", what do you say?\n\nPlease fill in:\n\n**font:**  \nDutch:  \nGerman:  \nFrench:  \nSpanish:\n\n**typeface:**  \nDutch:  \nGerman:  \nFrench:  \nSpanish:\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:02am",
      "content": "The problem is discussed in Robin Kinross, Unjustified texts\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:17am",
      "content": "I've always believed that -\n\nFonts are Typefaces generated specifically for digital use;\n\nAnd that Typefaces were inclusive of all lettering designed to be used for mass production and/or consumption.\n\nI could be wrong, though.\n\nI seem to recall author Simon Loxley of Type: The Secret History of Letters writing that he also believed this to be the definition.\n\n"
    },
    {
      "time": "18 Mar 2009 — 2:19am",
      "content": "There is most definitely a stark difference between a Font and a Typeface as can be found here: [http://blog.anthonyjones.biz/2009/01/typography-101-fonts-vs-typefaces/](http://web.archive.org/web/20131023113624/http:/blog.anthonyjones.biz/2009/01/typography-101-fonts-vs-typefaces/ \"http://blog.anthonyjones.biz/2009/01/typography-101-fonts-vs-typefaces/\")\n\n"
    },
    {
      "time": "18 Mar 2009 — 4:08am",
      "content": "gah, the anthony jones blog contradicts what other people are saying e.g. nachos' post.\n\n"
    },
    {
      "time": "18 Mar 2009 — 7:43am",
      "content": "Font: A single cut from a type family (one point size). ex. Helvetica Bold 10pt\n\nTypeface: The entire family (all sizes). ex. Helvetica\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:15am",
      "content": "Thank you, Ad\\_Junkie\\_At\\_Large for the correct answer. Although, the point size is not really a deciding issue any more with digital format.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023113624/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:16am",
      "content": "wow, so we're saying every instance of a typeface is an individual font? helvetica bold 10pt, helvetica bold 11pt, helvetica bold 12pt etc?\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:19am",
      "content": "Although, the point size is not really a deciding issue any more with digital format.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023113624/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:22am",
      "content": "so how do we know that you are correct, phrostbyte, and not anthony jones, who says the complete opposite?\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:33am",
      "content": "Ask anyone who has ever used metal type. Personally, I can only tell you what the old guys say. That is what a font and typeface was. What is it now? Maybe Anthony Jones can redefine things as he see fit.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023113624/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:42am",
      "content": "Because he is.\n\nIt just so happens that most digital typefaces are designed for one font size, say, 12pt for text, 18pt for display. The fact that we scale them to whatever we want doesn't mean that it isn't one cut, or font. Each different weight is a different cut, or font. Each style is a different cut or font. The size isn't specified any more, but it is implied, even though we ignore it.\n\nWhen you get into the optical sizes, then you even start to restore some more of the original meaning of a specific typeface cut for a specific size/weight/style. Garamond Premier Pro Light Italic DISPLAY, where DISPLAY is Adobe's way of saying 36pt or whatever.\n\n"
    },
    {
      "time": "18 Mar 2009 — 12:02pm",
      "content": "megax:_Very simply put: A typeface is a set of one or more fonts.  \nTypeface = Parent;  \nFont = Child;_\n\nNope, that doesn't work, because a ‘set of fonts’ may also imply a typeface family, which consists of more than one typeface, e.g. Time Roman, Times Italic, Times Bold, etc., all of which are separate typefaces. The best way to understand the distinction between typeface and font is not to try to define a relationship between the two -- e.g. parent and child --, but to realise that the distinction is meaningful precisely because the relationship is multivalent. And it is multivalent because of the variety of font technologies and how those technologies embody typefaces. For instance, a single typeface might be embodied in a single font (typically the case for OT fonts), but it might also be embodied in muliple fonts (as was the case with many typefaces in Type 1 format, requiring separate fonts for ligatures etc.), or multiple typefaces might be embodied in a single font (as is the case with individual Asian fonts containing both roman and italic Latin companions).\n\n"
    },
    {
      "time": "18 Mar 2009 — 12:13pm",
      "content": "Sorry about the double post.\n\n"
    },
    {
      "time": "18 Mar 2009 — 12:12pm",
      "content": "I would agree with John's comments.\n\n@ photosynthesize - Was there a specific instance in which you were confused on what term to use? Or was this just a general question to the typeaholics at large?\n\nLooking forward to seeing those survey results Thomas.\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:13pm",
      "content": "\\> Times Roman, Times Italic, Times Bold, etc., all of which are separate typefaces\n\nNo they aren't. They are all members of the Times typeface. They are separate fonts. (And at one time each size of them would be a separate font.)\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:51pm",
      "content": "Tracking\n\n"
    },
    {
      "time": "18 Mar 2009 — 2:09pm",
      "content": "Sorry, Don, but there has been consistent use of the term typeface in a way that distinguishes between major styles, weights and widths. Historically, the reason for this is obvious, because the idea of marketing e.g. roman and italic typefaces under a single name is a relatively recent phenomenon. Even as late as the 1930s, Eric Gill conceived his roman (Perpetua) and italic (Felicity) under separate names. It is also worth noting that some typefaces were independently conceived and only later, and sometimes erroneously, associated, e.g. the pairings of Garamond romans with Granjon italics.\n\nWe have a separate term -- typeface family -- to refer to a collection of separate-but-related typefaces under a single name.\n\n"
    },
    {
      "time": "18 Mar 2009 — 3:34pm",
      "content": "Are Bodoni and Garamond typefaces?\n\n"
    },
    {
      "time": "18 Mar 2009 — 7:20pm",
      "content": "They must be typefaces, Nick, for we often see colophons that tell us books have been set in \"Bodoni\" or \"Garamond.\"\n\nBut maybe there is more than one kind of Garamond, for sometimes we see colophons that tell us a book has been set in \"A Garamond.\" This leads me to believe there must be more than one type named Garamond, but I still don't know which of those possible Garamonds. This is all very confusing.\n\nStill more confusing are some of the other (often strange) words appended to typeface names. I see colophons that mention \"ITC\" or \"Monotype\" or \"Linotype\" Baskerville, for instance. And what is this \"Adobe\" I see with typefaces names? Is that stuff not mud and straw and ox blood?\n\nMaybe someone can help clear this up for me. Good night.\n\npowers\n\n"
    },
    {
      "time": "18 Mar 2009 — 8:12pm",
      "content": "Oh, c'mon, Bodoni and Garamond were people. ;)\n\nBut what I tell my students is the metal type definition (see above) and then relate that 'font' is a cool sounding word that we now apply to the whole thing.\n\nI even know someone who will refer to the plural, fonts, as font. Like: \"I use a lot of font.\"\n\nAnd I don't have the heart to correct her. Anymore. She wasn't listening. Hell, it might catch on eventually.\n\n\"I make font.\"\n\n\"I use font.\"\n\n\"Font: gooood.\"\n\nThen I point out: right now there really is no master committee that oversees all this, so like the English language, \"font\" is now a funky term that everyone knows, is used to sell a product; but at this point, who knows what it really, really is ... today.\n\n(if we actually knew, there wouldn't be so many posts on this page)\n\nSo ...\n\nThis is bugging me:\n\nAnyone have any idea what the term \"logo\" means these days??\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:36pm",
      "content": "I'll say this much about my survey results: I believe each of the statements below, made in this thread, would get a bit over half of all respondents agreeing.\n\nGoran (in post #2): <cite>Font = Software, Typeface = Letters</cite>\n\nMetalfoot (in post #5): <cite>The typeface is the design and the font is the means of reproducing that design.</cite>\n\nmegax (in post #12): <cite>A typeface is a set of one or more fonts. Typeface = Parent; Font = Child.</cite>\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:49pm",
      "content": "This issue is also discussed in [Font or Typeface?](http://web.archive.org/web/20131023113624/http:/fontfeed.com/archives/font-or-typeface/), on The FontFeed.\n\nAnd Allan Haley has his say on the matter in [\"They're Not Fonts!\"](http://web.archive.org/web/20131023113624/http:/www.aiga.org/content.cfm/theyre-not-fonts), on AIGA's website.\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:47pm",
      "content": "Even though, in my mind, there is a difference, I think Steve (mehallo) makes a good point. Words derive meaning from the way they are used, not from what people say they mean (or should mean).\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:52pm",
      "content": "_Words derive meaning from the way they are used, not from what people say they mean (or should mean)._\n\nYeah, that's true. The way the word \"font\" was used in the days of lead type has changed because the technology (and the access to that technology) has changed.\n\n"
    },
    {
      "time": "18 Mar 2009 — 10:17pm",
      "content": "Font is no longer size-specific, but still refers to a single style. Bulmer regular, Bulmer italic, Bulmer bold and Bulmer bold italic are four fonts, but one typeface.\n\n"
    },
    {
      "time": "18 Mar 2009 — 10:22pm",
      "content": "Wikipedia says that font has now become a metonym for typeface. It's great people here are trying to prevent that. Metonymy (IPA: /mɨˈtɒnɨmi/) (from the Greek: μετωνυμία, metōnymía, \"a change of name\", a suffix used to name figures of speech, \"name\") is a figure of speech used in rhetoric in which a thing or concept is not called by its own name, but by the name of something intimately associated with that thing or concept.\n\n"
    },
    {
      "time": "18 Mar 2009 — 10:29pm",
      "content": "Wikipedia is wrong on this. That may be the trend, but we're not \\*quite\\* there yet. At least, not among graphic designers. Maybe among the general public.\n\nT\n\n"
    },
    {
      "time": "18 Mar 2009 — 10:41pm",
      "content": "I completely agree! That's why i said it's really great that people here are trying to prevent that from happening\n\n"
    },
    {
      "time": "19 Mar 2009 — 12:49am",
      "content": "When I'm talking to other designers I use the word \"type,\" when talking to non-designers I say \"fonts.\"\n\nThey are the same thing to 99% of the population, who has no need to make a distinction because their only dealing with fonts/type is in Microsoft Word.\n\nOf course the distinction is an extremely important one to explain in design education, because talking about the aesthetic properties of a typeface is an entirely different conversation from the technical aspects of font production.\n\n"
    },
    {
      "time": "19 Mar 2009 — 1:03am",
      "content": "I’ve really been cranking on the survey analysis write-up late tonight (instead of, say, hanging out with Paul Hunt who has been good enough to put me up for three nights in San Jose). But I’m \\*still\\* not done, and I need to get some sleep now. pfeh. Even if Tiffany isn’t free for brunch tomorrow, I don’t think I can get it done before my flight. Bah, humbug!\n\nBut mmm, sleep.\n\nT\n\n"
    },
    {
      "time": "19 Mar 2009 — 7:03am",
      "content": "[Some of this repeats things already mentioned above. Following is my take.]\n\nLike the term 'leading', 'typeface' and 'font' evoke the metal era.\n\nA typeface was what was cut by the punchcutter, and a font or 'fount' was what was poured by the foundry. What was cut made up a cohesive set, and what was poured filled an order. In other words, the font was the deliverable, but what's on the face of the deliverable is what was categorized and named.\n\nPunchcutters cut _typical_ representatives of conventional or iconic letterforms. Hence the term 'type.' They cut them more or less according to a pattern, and as a set. The typeface is the 'cut set' originating in a specific time and place. It can be added to at a later date.\n\nThe cut set could include an italic and small caps. So that typeface encapsulates a roman, an italic and small caps. Another typeface might not. The italic, roman and small caps would be deliverable as separate fonts.\n\nIn the digital era a font became a deliverable item in a font-suitcase, and a typeface became what is digitally 'graphed.' As a design, for instance, the typeface univers has many weights and widths, as well as obliques; a full font suitcase contains a document for each of these. Some users will have univers but only as a selection of these fonts.\n\n"
    },
    {
      "time": "19 Mar 2009 — 7:47am",
      "content": "Well said enne\\_son, it's nice to know that not everyone has forgotten what type really used to be.\n\nIn my letterpress classes (and by my old-school design adviser) we were taught that a typeface is Helvetica and a font is Helvetica Bold (or italic, or whatever) and that point size usually didn't figure into the nomenclature, but I think that is mostly due to the digital age where point size is easily changed, and isn't a matter of going and finding the 35 pound drawer of type in a different size. I think all graphic designers should be required to take a letterpress class. It's one thing to say you get what leading is, it's another to hold a 10pt. lead in your hand and find out first hand why capital letters get called \"upper case\" and to smell the ink and... I'm getting all sentimental here.\n\nNext all of us young designers can take a compositing class and find out why the white space around your InDesign document is called the pasteboard...\n\n"
    },
    {
      "time": "19 Mar 2009 — 7:56pm",
      "content": "I know what a pasteboard is!\n\n(used to be a damn good paste up artist too; doesn't come in handy much anymore) :(\n\n"
    },
    {
      "time": "20 Mar 2009 — 3:29am",
      "content": "I miss the old paste up days. The rush that comes from 5pm deadlines and its 4:30. Stripping and re-using ancient paste boards because the boss is too cheap to buy anything new. The smell of hot wax and pizza on those all nighters. And, barely dry PMTs and wax, that was good too. Clip art that was actually clipped.\n\nI'm too old for that crap.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023113624/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "20 Mar 2009 — 7:10am",
      "content": "Here's an OLD GUY checking in, phrostbyte.\n\nWhen I was a young guy, daily working in letterpress book printing shops and in a Monotype house a \"font\" was a wrapped-up package of, say, 12-point Garamont. Another font would contain 12-point Garamont italic. Another would have 12-point Garamont small caps. Three other fonts would have those same typefaces, but in 11-point. And so forth.\n\nThe typeface was Garamont or Garamont italic or Garamont small caps. I disagree with enne\\_son that a typeface \"encapsulates\" roman, ital, and smalls. To the compositor on the floor, assembling a book or an ad, or to the guy who ties and wraps the fonts, the roman, the ital, and the smalls are different typefaces.\n\nYet it is indeed possible to speak of Garamont as a typeface in a more general sense, as in \"That beautiful book is set in Garamont.\" A more thorough description of the book might note that three typefaces (rom, ital, and smalls) had been used, each in several sizes.\n\nNowadays, sitting in front of a computer, a font is the digital data that allows me to see a typeface on a screen or to allow that typeface to be printed on paper. MyFonts describes LTC Garamont as \"a font family of 12 fonts.\"\n\nThe typeface is what I see on that screen or on that sheet of paper or on a tee shirt, etc.\n\nB U T : This may be an issue on which we must agree to disagree. Just in this short thread there are quite a few differences between font and typeface, based on good thought and experience. And then there is the wider world's use of \"font\" to describe everything from printed typefaces to the words \"I love Cheryl\" scratched in the oceanside sand with a pointed stick.\n\npowers\n\n"
    },
    {
      "time": "20 Mar 2009 — 7:37am",
      "content": "Will, I said: \"The cut set could include an italic and small caps. So _that_ typeface encapsulates a roman, an italic and small caps [my emphasis; gloss: meaning that particular]. _Another typeface might not._ [emphasis added]\" I think 'typeface' is a plastic term -- it had and has an elastic use. I like to tie it to a deliberately cohesive set of punches cut at a particular time and place.\n\nI suppose my post was as much a proposal as a description of actual or conventional use. ITC Garamond Italic can be the italic sorts in the ITC Garamond face. An added complication of course is that garamond became a generic name for a class of typefaces.\n\n"
    },
    {
      "time": "20 Mar 2009 — 8:09am",
      "content": "nachos, i was just interested in the opinion of the experts. :D\n\ni sure do like stimulating debate.\n\n"
    }
  ]
}
