{
  "id": "55966",
  "title": "Has MyFonts reduced the percentage they pay designers? (sign up by 3/31 to still get the better deal!)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "MyFonts had been giving type designers 65% of the retail price of their fonts since its inception. I just went to their page and saw that they now proudly claim they give a 50% share:  \n\"MyFonts is a highly efficient and high-volume vehicle for selling fonts. As a result, you will receive an unusually high 50% of the actual price paid by a customer for your fonts!\"\n\nI am really depressed. Say it isn't so!\n\nChrisL\n\n",
  "author": "dezcom",
  "time": "17 Mar 2009 — 9:10am",
  "uid": "3135",
  "comments": [
    {
      "time": "17 Mar 2009 — 9:17am",
      "content": "Here is the link to the MyFonts page I quoted above:\n\n[http://new.myfonts.com/info/prospectus/](http://web.archive.org/web/20150129061141/http:/new.myfonts.com/info/prospectus/ \"http://new.myfonts.com/info/prospectus/\")\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:20am",
      "content": "Mr Coles mentions a 65% rate here...\n\n[http://typographica.org/001157.php](http://web.archive.org/web/20150129061141/http:/typographica.org/001157.php \"http://typographica.org/001157.php\")\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:22am",
      "content": "Here you go - you can check these links and see at what point it changed...\n\n[http://web.archive.org/web/\\*/http://www.myfonts.com/info/prospectus/](http://web.archive.org/web/20150129061141/http:/web.archive.org/web/*/http:/www.myfonts.com/info/prospectus/ \"http://web.archive.org/web/\\*/http://www.myfonts.com/info/prospectus/\")\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:24am",
      "content": "Dammit dammit dammit! I was about to sign with them too. Does anybody else now offer a better deal?\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:24am",
      "content": "Here is a screenshot of the prior page with the 65% rate:\n\n ![](http://web.archive.org/web/20150129061141im_/http:/typophile.com/files/myfontsOld_3677.png)\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:45am",
      "content": "What do designers get for the extra 15%? For foundries 50% is still more than they get reselling their back catalogs through some of the other big vendors. But to a new font designer I don’t see much reason to go right to MyFonts at 50%—there of foundries that pay 50% and will go out of their way to help with the final design, production, and testing of the fonts. MyFonts marketing is good, but I don’t see it as being worth another 15% now that Twitter, Facebook, and YouTube have made online marketing much easier and less expensive than it used to me.\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:29am",
      "content": "Thanks, Si.\n\nThat is a HUGE cut and really depressing to see designers getting the shaft again :-(\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:33am",
      "content": "I hope Jos and other type designers who have been with MyFonts for a while will chime in and tell us if ther percentage went down for recent sales as well.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:40am",
      "content": "_...unusually high 50%..._\n\nActually, that is the norm.  \nSomeone just changed the number, without editing the sentence for meaning.\n\nMyFonts has always offered good added value while returning a high percentage royalty, and still does at 50%.  \nFor instance, there is no other foundry or reseller that has an interactive Type Tester that demonstrates OpenType features. If you are publishing OpenType fonts, that is \"priceless\".\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:40am",
      "content": "That is what I meant, Nick. Everybody pays 50% if you do all the work and submit release ready files. The percentage is less if they help you finnish and prep the fonts, though.  \nSo now what has MyFonts got as a big advantage? Nothing!\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:41am",
      "content": "Nick,\n\nDid your percentage go down for recent sales from MyFonts or has it stayed the same?\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:43am",
      "content": "As I said Chris, the OpenType type tester, and also a lot of other marketing services.  \nBTW, you are confusing reselling with manufacturing/publishing.  \nResellers/retailers pay 50% and do nothing to the font files.\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:46am",
      "content": "Chris, I can't discuss my percentage, for contractual reasons.  \nI'll big-up any and all of my distributors for what they do well, but I can't criticize them individually or talk specifically about the business arrangements I have with them\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:49am",
      "content": "James, MyFonts has established its brand and has massive traffic.\n\n\"Get a taste kid, you might like it.\"\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:51am",
      "content": "Thanks, Nick. I understand. I don't want you to get into a problem about it, sorry.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:53am",
      "content": "<cite>James, MyFonts has established its brand and has massive traffic.</cite>\n\nI’ll defer to you on the value of the MyFonts brand and assume that it’s worth the 15%, then.\n\n"
    },
    {
      "time": "17 Mar 2009 — 10:06am",
      "content": "It is actually more like a 25% reduction for the designer.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 10:43am",
      "content": "<cite>It is actually more like a 25% reduction for the designer.</cite>\n\nGood point. Math isn’t really my strong suit.\n\n"
    },
    {
      "time": "17 Mar 2009 — 10:52am",
      "content": "dezcom said:  \n\\> It is actually more like a 25% reduction for the designer.\n\ni'd say myfonts just raised their price by 42.85%.\n\nthey used to take a 35% cut, and now a 50% cut.\n\n-bowerbird\n\n"
    },
    {
      "time": "17 Mar 2009 — 11:30am",
      "content": "_...for the designer..._\n\nActually, these percentages are for the foundries that MyFonts distributes, not for the designer--unless he or she owns the foundry.\n\n"
    },
    {
      "time": "17 Mar 2009 — 11:42am",
      "content": "You are right, Nick. I was assuming most of the designers there were selling their own work.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 11:48am",
      "content": "\\> MyFonts had been giving type designers 65% of the  \n\\> retail price of their fonts since its inception.\n\nActually at the beginning it was 85%!\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2009 — 11:50am",
      "content": "85%?\n\nWow! I didn't know that. How long ago was that, Hrant?\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 12:03pm",
      "content": "Maybe the first two years?\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2009 — 12:52pm",
      "content": "Chris, the most important thing in a distribution agreement isn't the percentage that you get, but the number of transactions that your fonts have.\n\nIf you sell 100 fonts at $30 a piece on a site that gives you 65%, then you get $1950. But if you sell 300 fonts at $30 a piece on another site that gives you 50%, then you get $4500. And zero font sales at $30 a piece on a site that gives you as much as 85% of each sale will only net you $0. You shouldn't assume that any two sites will sell the same number of your fonts.\n\nIn fact, I'd go so far as to say that the MyFonts today is more likely to sell more of your fonts than say, the MyFonts of two years ago (or any arbitrary figure…). Look at MyFonts.com as a full package. They have a new site, with features that Nick already pointed out. Look at their newsletters. They didn't do as much promo a few years ago as they do now. They have regular content being written by (at least) Jan Middendorp, JLT, and Nick Sherman, at least that is how it looks to an outsider like me.\n\nAsk not what you can do for the site; ask what the site can do for you.\n\nOf course, I don't have any direct info to back it up, but I'll bet a good beer and donut that it is those newsletters (and other marketing and list activities) that sell fonts on MyFonts more than any other factor. If I were a designer considering whether or not to list my fonts there, those are the sorts of things that I would look at. Not the exact cut that you get.\n\nAfter you get a good look at what you'll really get at MyFonts, compare that with other options. Stephen Coles' Typographica article is a good start. Fill in the gaps with offline discussions with designers you know who have chosen different options. Many people aren't going to be able to talk about their contracts (or royalty figures) on a public forum. The internet is great, but it is not for everything :)\n\nIn the end, maybe MyFonts would be the best bet for you. Or maybe your research will point to better chances via another route. You won't be able to come to that conclusion just by comparing royalty rates.\n\n"
    },
    {
      "time": "17 Mar 2009 — 12:57pm",
      "content": "I wonder if this is a harbinger of the dropping of royalty rates at other venus? If MyFonts, with all of its perceived value is paying 50%, perhaps some of the other larger resellers, who may not offer as much, will rethink their 50% royalty. Race to the bottom?\n\n"
    },
    {
      "time": "17 Mar 2009 — 12:58pm",
      "content": "Looking at the MyFonts library, they appear to take pretty much anyone who submits, no? If so, perhaps that is part of the puzzle.\n\n"
    },
    {
      "time": "17 Mar 2009 — 1:17pm",
      "content": "James,  \nI think they do take all comers who can make a working product and who are not pirates. I don't think they would deny anyone who submitted a less than stellar design but I think they might not allow one that was technically unsound and buggy. They also expect a full character set--at least as full as the old type 1 model.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 1:18pm",
      "content": "Thanks, Dan. I am not sure how I could get all the other data on volume but I see your point.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 1:26pm",
      "content": "James, sadly I think you're right, on all counts.\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2009 — 1:46pm",
      "content": "Chris: Yes, you've got it. They expect a really basic level of technical functionality, that glyphs render and it doesn't crash anything, and a basic character set. Beyond that, there isn't a quality barrier at all.\n\nBut even so, they couldn't make money very effectively when taking only a 15% slice. At 35% they were able to be profitable. I'm sure they'll do very well for themselves at 50%.\n\nI think Dan put it very well regarding comparing different licensing arrangements to resellers, though.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "17 Mar 2009 — 1:58pm",
      "content": "Thanks, Thomas. I hope all is well with you and your family.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 2:02pm",
      "content": "I think MyFonts \"take all comers\" approach may have finally caught up with them, and they are lowering their royalty payments due to the expense of carrying all of that \"dead wood\".\n\nPerhaps the more discerning organizations like FontShop may be better able to keep their royalty at the current level.\n\n"
    },
    {
      "time": "17 Mar 2009 — 2:10pm",
      "content": "<cite>…due to the expense of carrying all of that “dead wood”</cite>\n\nWhat expense? Those old fonts just take up a tiny bit of disk space; they don’t need to sell very many of them to pay for that.\n\n"
    },
    {
      "time": "17 Mar 2009 — 2:26pm",
      "content": "@james (both, I guess)  \nDead wood = the hundreds of bad fonts that get in the way when searching for something good to license. It's not about file size at all, it's about shopping for nice fonts.\n\n"
    },
    {
      "time": "17 Mar 2009 — 2:54pm",
      "content": "It may cost more to do the labor of deciding which fonts make the grade than just allowing all comers. They may find a way to sort the crap to the bottom though to make searching quicker for thr better customers.  \nThe other thing is, who is to say that there are not plenty of customers who like crap? Never underestimate the taste of the average consumer. They could have a metadata search term called \"kaka\"added to keywords :-)\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 3:32pm",
      "content": "interesting seeing this post and that font designers get as much as 50% of the retail price from online font stores. Most of our clients who sell physical products to stores large and small get only 1/3 or less of the retail price.\n\n"
    },
    {
      "time": "17 Mar 2009 — 3:42pm",
      "content": "What products?\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 4:05pm",
      "content": "I see the business as a whole becoming more sophisticated.  \nAt the moment, ads are free, and there is no standard size.  \nNoting that MyFonts now has a sponsored font in its latest newsletter, I can imagine that in future, resellers will charge to place foundry ads in high-traffic positions, and that this would be a more significant means of generating revenue than cutting royalties.  \ntwo years ago I released a typeface, and provided all my distributors with advertising material and a launch date.  \nIt was a disaster; few of them even used my ads, or released the font anywhere near the suggested release date.  \nBut I am optimistic that things will improve and become less amateurish.  \nIf resellers want to charge for ads, they can't continue to make the ads themselves, and run them at their discretion.  \nAnd if I'm going to be paying for an ad, then the revenue from it must warrant the expense, which means there must be a balance between the cost of the ad, the number of fonts sold, and the royalty percentage.\n\n"
    },
    {
      "time": "17 Mar 2009 — 4:44pm",
      "content": "Nick,  \nWas the problem that they did not coordinate with your release date? I assume they allwere early.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 5:42pm",
      "content": "Hi Chris (and others),\n\nWe at MyFonts made the choice recently to switch to a 50/50 percentage agreement for several reasons, but the most notable is the simple fact—which Dan already pointed out—that MyFonts does a heck of a lot more to help sell fonts now than when the old 65% rate was put in place, back in 2003.\n\nConsider, for example, my personal employment as a full-time designer for the company. Before I was hired by MyFonts, they didn't have ANY full-time designers (and many of you would agree that the fact was painfully evident). I like to think that since I've started, the design level for the company has improved noticeably and, in turn, helps to sell more fonts.\n\nAnother huge factor is the new website. We started work on a completely rebuilt version of the site as soon as I was hired, so the version which is now up in beta mode represents more than 2 years of design and development time. And it isn't just re-skinning work; as Nick Shinn points out, the new site offers new OpenType testing functionality and a slew of other technical advancements (with more still in the works). Again, all the work we've put into (and continue to put into) the new site helps sell more fonts.\n\nAlso worth consideration is the increase in exposure that now is associated with our marketing campaigns. The MyFonts newsletters currently go out to more than half a million registered users (!). That beats the hell out of the number of people subscribed back in 2003, which was about a tenth of that. To add to that, we've also just started a blog which will take time and effort to maintain. Again, all of these things help sell more fonts.\n\nFor the foundries already signed up with MyFonts, we have no intention of changing their contracts. That is our way of thanking them for signing up in the earlier stages of the game. Having said that, we aren't planning on fully instituting the 50/50 contracts until the end of this month (so, cuttlefish, if you want to still get the 65% deal, get on it before April :)\n\nWe do take an equal opportunity stance on which fonts to sell through MyFonts. As long as the fonts are technically and legally sound, we let the customers decide what is worthy of buying or not. Since the fonts are just digital files, carrying that many more of them has little to no affect on our cost of operation. Anyone familiar with the \" [long tail](http://web.archive.org/web/20150129061141/http:/en.wikipedia.org/wiki/The_Long_Tail)\" business model understands how this works.\n\nI am one of the first to agree that we carry some less-than-desirable fonts on our site; however, the way our promotion system works, anything that doesn't prove itself as desirable pretty quickly settles to the bottom of the barrel, and the more successful stuff bubbles to the top.\n\nAnyhow, to summarize, MyFonts is a totally different product/service now than it was back in 2003, and that change is the result of a lot of work and building over time. Considering all the new benefits that we now offer, we're still more than confident that the 50/50 agreement is a great deal for people looking to promote and sell their fonts.\n\n"
    },
    {
      "time": "17 Mar 2009 — 5:45pm",
      "content": "Thanks for the explanation, Nick.\n\n"
    },
    {
      "time": "17 Mar 2009 — 5:50pm",
      "content": "Thanks Nick.\n\nIs leaving out the history 1999 to 2003 intentional?\n\n"
    },
    {
      "time": "17 Mar 2009 — 5:55pm",
      "content": "@Nick,  \n\"(so, cuttlefish, if you want to still get the 65% deal, get on it before April \"\n\nSince you offer Cuttlefish the 65% deal, I assume I too can qualify prior to April? If so, send me the 65% contract and I will sign it tomorrow.\n\nChrisL\n\n"
    },
    {
      "time": "17 Mar 2009 — 6:08pm",
      "content": "Nick,  \nis it possible to sign a contract but not immediately offer any fonts for sale?\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2009 — 6:10pm",
      "content": "sii, I made comparisons to 2003 specifically because that was the year the 65% rate went in to effect. Prior to that it was an even higher 80%.\n\nChris. indeed the 65% deal would apply to you and anyone else interested (I, for one, would be glad to have you!). Anyone who wants the 65% contract should just send an email to [foundry@myfonts.com](mailto:foundry@myfonts.com) saying so before the end of the month.\n\n"
    },
    {
      "time": "17 Mar 2009 — 6:13pm",
      "content": "Hrant: yes, you (and anyone else) could sign the contract now even if you don't offer the fonts immediately.\n\n"
    },
    {
      "time": "17 Mar 2009 — 7:59pm",
      "content": "Nick started working for MyFonts three years ago, so I guess he left out the pre-2003 history simply because he was ancient history for him. So let me join in an fill in some gaps.\n\nMyFonts was in fact my first professional involvement in the font industry — I was hired as part-time typographic consultant in mid-2000, some nine or so months after the site was launched. And I've been part of the team ever since. I never worked for MyFonts full-time but instead, I was involved in a number of projects with the large and small vendors in the industry, and in 2005, I started working half-time as FontLab's product and marketing manager. I hope that this allowed me to develop a reasonable understanding of all the aspects of the entire font industry.\n\nWhen MyFonts was set up ten years ago, the surrounding reality was that lots of promotion and advertising was done through print: printed catalogs and specimens, printed ads in magazines etc. MyFonts didn't offer that. In a sense, MyFonts offered little more than a convenient way to _just sell fonts online_: let the user select the font, collect the payment and forward the money to the foundry. Back then, there was no PayPal or Google Checkout so setting up an electronic shopping cart and accepting online payments was a challenge — so MyFonts was a fast, accessible and powerful platform that offered foundries an online shopping cart for their fonts.\n\nGradually, both MyFonts and the market evolved. Today, it is no longer sufficient to have an online \"presence\", it's necessary to put up some competition efforts in the online world. Having just a _sales platform_ is no longer sufficient, we need an effective platform for _both sales and promotion_.\n\nTen years ago, it was not a good idea for MyFonts to do extensive promotion using the print channel, because good print promotion is highly individual. Everything — from the design through the choice of paper, colors and printing process — should be done with extensive creative influence from the foundry and from the designers. So it is the foundries rather than the distributors who presumably will always do a better job at print promotion — therefore, it was logical that MyFonts consciously did not get involved in that, and offered a higher  \npercentage to the foundries.\n\nFrom 2000 to 2003, MyFonts gave 80% to the foundry and collected a 20% commission. It was a deal that it was unheard of in the industry, and it was clear from the day one for both MyFonts and the participating foundries that this was a sort of an \"introductory deal\". And indeed, in 2003, MyFonts changed the commission to 35%, which meant that 65% of the retail price went to the foundry. This was a realistic split that allowed MyFonts to cover the operational and development cost, and left some moderate means for some promotional activities — and it was still the best deal in the industry.\n\nTen years from MyFonts' inception, things have changed.\n\nWith \"Web 2.0\", the role of the internet has changed. More and more users can be effectively reached through various online promotional channels such as online ads, blogs or social networks. The visual fidelity of the online media has vastly improved, reducing the gap between online and print. Very few will remember that five years ago, the MyFonts newsletters (and most other e-mail newsletters) were plain-text-only, without any images or an actual layout!\n\nBut unlike print promotion, the online channels benefits much more from a solid technological background and the online-specialized know-how that a foundry might not necessarily have, but an online distributor should. For example, MyFonts does not host the website on one server but on a few dozens (!) separate machines connected by sophisticated load-balancing systems, so the website runs fast despite the heavy traffic, and the risk of the service not being available is minimal.\n\nAs MyFonts is well-rooted in font technology, things like online previewing of OpenType Layout features are not only possible but are also fast and reliable.\n\nLarger websites are more discoverable through search engines — just think of how much more likely is it to find the entry for a book at Amazon than it is on its publisher's website.\n\nThanks to sophisticated statistics, an online distributor such as MyFonts can detect trends, effectively position ads in search engines (larger clients can negotiate better rates when buying ads), and use various online communication channels to do good promotion in a more cost-effective way than an individual, small foundry. So at least it is not unreasonable to assume that the online distributor will spend the extra money well.\n\nJames writes: _I think MyFonts “take all comers” approach may have finally caught up with them, and they are lowering their royalty payments due to the expense of carrying all of that “dead wood”._ I think that James will be glad and relieved to hear that there is little, if any, expense of “carrying the dead wood.” With the highly automated infrastructure that MyFonts had, the marginal cost of adding new fonts is low, and the transaction cost is also independent of the overall number of products on sale. As Nick points out, MyFonts operates by the “long tail” principle (also known as the “80-20 rule”): roughly 80% of the expense is generated by 20% of the products, and 20% of the expense is generated by the 80% of the products. Indeed, this means that cutting off all those unpopular products wouldn't really have much influence on the costs.\n\nAlso, it is important to point out that the new standard contract rate to 50% applies to new foundries. **Existing contracts will keep the existing terms** and will not be automatically changed to the new scheme.\n\nBecause there seem to be some foundries that had the intention of signing up but \"haven't gotten around to doing it\", we have decided that they still have the chance to sign up **with the old rate of 65%** if they contact _foundry@myfonts.com_ by the end of this month (i.e. by March 31, 2009). So in a sense, the “early early birds” who have signed up with MyFonts 8–9 years ago were rewarded by the extraordinarily attractive rate of 80%, and a number of foundries that have joined so far, the “before lunch birds”, have profited from the attractive 65% rate. And this offer is now prolonged until lunch is over :)\n\nBut — why the change the rate at all? James rightly points out that it is desirable if distributors “keep their royalty at the current level”. But one way of looking at this is to ask: just how much MyFonts has achieved with the unusually low commission rate? Rather than being just a simple click-and-buy anonymous site, the MyFonts website has been in constant development for the last years.\n\nWe have collected excellent editorial content in form of articles, blog entries, interviews and newsletters — originally written by Laurence Penney, and more recently, by Jan Middendorp, Joshua Lurie-Terrell and Nick Sherman. We plan on continuing and expanding these activities. Better content, better educational materials, better instructions and explanations to the users — this will automatically benefit all participating foundries.\n\nWe have developed WhatTheFont, a massively popular online font recognition tool — which recently has been extended by the addition of an iPhone version, which has remained one of AppStore’s top 10 free applications in the “Reference” category. If you sign up with MyFonts and submit your fonts, they will automatically be searchable using WhatTheFont.\n\nWe have spent months and months tweaking the purchase process and the buying experience, in order to simplify the encoding and format selection and adjust to various licensing schemes required by the foundries. One example: after purchase, the customer can download the fonts as a ZIP archive or as a simple wizard-based installer for Mac OS X or Windows — which greatly simplifies the font installation process and reduces tech support calls.\n\nWe have invented various ways for customers to discover new fonts and quickly find the fonts they are looking for. We developed “More fonts like this”, introduced tags/keywords, flags and other concepts — and we were more than happy to find out that other font distributors have adopted these solutions. These concepts are industry standards now. We have a slew of great new ideas that, I'm certain, will benefit font vendors and customers.\n\nWe have invested two years of our time to design a new website from the ground up, bringing together great design talent (Nick), excellent web programming skills (Chris Lewis and Kevin Woodward), online marketing expertise, solid linguistic, typographic and font technology know-how, high-quality content as well as, simply, innovation. We have been rewarded with very positive feedback from both foundries and customers — and we are constantly working on “ironing out” some weak spots.\n\nBut the work is not finished, we have great plans. The extra money that will come from the increased commission on new foundries will certainly help further improving the MyFonts online platform. With our new design and editorial content, we have merely indicated the direction. Design and content is not everything, so our future activities will concentrate on online promotion and marketing. We will do some of the work ourselves. But more importantly, very much in-sync with our approach so far, we will develop new innovative easy-to-use online tools that will help foundries direct the marketing activities themselves.\n\nUntil this date, we have done all that work at a commission rate that _for years was way more attractive than anybody other's_. So I believe, so far, the participating foundries can safely say that the money (the commission) was, indeed, well spent — simply because they have been enjoying steadily increasing income from us since MyFonts' inception.\n\nAnd that money will continue to be well spent — for the existing foundries whose contracts we of course honor, for the new foundries that manage to snatch the old commission rate if they sign up by the end of this month, and also for the future foundries which will not enjoy the “early bird” privilege, but will nonetheless benefit from all the innovation and effectiveness that MyFonts has to offer.\n\nOK, everyone in the first row can wake up now. ;)\n\n"
    },
    {
      "time": "17 Mar 2009 — 8:02pm",
      "content": "zzzzzzzzzzzzzzzzz......\n\n"
    },
    {
      "time": "17 Mar 2009 — 8:10pm",
      "content": "twardoc-\n\nthat was extremely well-spoken...  \nsounds like myfonts earns its pay.\n\n-bowerbird\n\n"
    }
  ]
}
