{
  "id": "55988",
  "title": "Albertus Extra Bold origin",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am trying to find the origin of Albertus Extra Bold. There are a few digital fonts out there - most of dubious origian. I and a friend with much more reference material find no such critter in metal up through photolettering. Jaspert reveals that several variants of the original Albertus and Italic were added over the years, but no Extra Bold.\n\nThe earliest appearance I can find is a Font Company (defunct) font. Most of their fonts were apparently made for them by URW using Ikarus. Was URW in the habit of adding extrapolated weights to font families using Ikarus?  \n.  \nAlso, there was, it seems, an Albertus Extra Bold built into early HP Laserjet printers, but where did that come from?\n\nThe frustrating thing is that there are two very different \"models\" of Albertus Extra Bold that various companies followed. One was used by Font Company (via URW it seems) and Miles (gobbled up by Agfa). The other was used by Fontbank and Brendel. None of these companies (not including URW) created anything original so whose Albertus Extra Bold were they copying, why two different styles and, the thing I'm trying to deduce, which model came first and who designed it?\n\nDoes anyone have a sizeable showing (1/2 page at least) of an Albertus Extra Bold?\n\n",
  "author": "Mike F",
  "time": "17 Mar 2009 — 6:40pm",
  "uid": "3368",
  "comments": [
    {
      "time": "17 Mar 2009 — 8:17pm",
      "content": "I always thought Albertus was a Monotype trademark, so maybe you could ask them. I'm sure they could let you know if there are Extra Bold drawings at Salfords, and if so these would be the \"original\" source.\n\n[http://en.wikipedia.org/wiki/Albertus\\_%28typeface%29](http://web.archive.org/web/20150215061106/http:/en.wikipedia.org/wiki/Albertus_%28typeface%29 \"http://en.wikipedia.org/wiki/Albertus\\_%28typeface%29\")\n\n"
    },
    {
      "time": "17 Mar 2009 — 9:13pm",
      "content": "Done. Thanks for the suggestion, Simon.\n\n"
    },
    {
      "time": "18 Mar 2009 — 11:52am",
      "content": "On the Brendel version:\n\nIn 1993 I received a review copy of a CD called \"SERIALS TYPECOLLECTION,\" which was how the Brendel types were marketed in the USA at that time. The marketer was B & P Graphics from LaGrange, Illinois.\n\nOn that CD Albertus was named \"Adelon\". There are roman and italic, in Light, Regular, Medium, Demi Bold, Bold, and (yes!) Extra Bold.\n\nI have no idea what the source material was. The poster that came with the CD says the fonts were \"digitized using the latest IKARUS technology.\" & I don't know much about Brendel and these types he re-worked and marketed. Or about B & P. I think there was a lawsuit. I saw no good in these faces. No ligatures, for one thing.\n\nBut I could make a showing of Adelon Extra Bold.\n\npowers\n\n"
    },
    {
      "time": "18 Mar 2009 — 12:32pm",
      "content": "\\>\\>Was URW in the habit of adding extrapolated weights to font families using Ikarus?\n\nYou kidding? I have a set of URW fonts that came with Freehand 8, and practically every one of them was a piece o' interpolated garbagé. Out of 40 cuts of a single typeface family, I would venture to say that maybe 8 were originals. Perhaps more or less, but the vast majority are interpolations.\n\n"
    },
    {
      "time": "18 Mar 2009 — 12:57pm",
      "content": "There were at least a few display film font versions of Albertus that included bolder weights, sometimes called \"Albertus\", sometimes not. For example, Headliners International had a family called Neo-Albertus with four weights from Light to Extra Bold. I doubt any of them were licensed or sanctioned by Monotype, as such things rarely were back in the film font days.\n\n"
    },
    {
      "time": "18 Mar 2009 — 6:16pm",
      "content": "Thanks for all that info guys.\n\nSo, Mark, I mentioned that the existing digital version of AlbertusXB seemed to follow two very different models. Here's what I mean:\n\n ![](http://web.archive.org/web/20150215061106im_/http:/typophile.com/files/AlbXB_5012.jpg)\n\nI should clarify that what are actually shown in my image are AdelonXB - with Anthony being very similar, but not exactly the same - and Miles' AlbertusXB - with the Font Company's version being quite similar.\n\nMy question to you is which of the two models, if either, do you see in those earlier AlbertusXB film fonts? I just took a look back at the many ID requests on What The Font that turned out to be AlbertusXB and most were made by a film or digital font that looked like the Miles/Font Co. model.\n\n"
    },
    {
      "time": "7 Apr 2014 — 4:49am",
      "content": "Origin of Albertus XB: I do have a Scangraphic Font Index from 1989 that shows Albertus with 5 weights, including an ‘Albertus Extra Bold’. My URW Type Program from 1992 lists ‘Albius’, the URW clone of Albertus. The family looks very similar to the Scangraphic version. They are not the same as your Miles/Font Company sample though. Also: Neither the Scangraphic nor the URW catalogue shows a weight of Albertus that looks like the Fontbank / Brendel sample.  \nAlso I have a Brendel Informatik catalogue called ‘faces’ which contains ‘Adelon’ Light—Extra Bold, a family of six weights, indicated as ‘similar: Albertus’. That catalogue is from around 1990. The bold weight is wider than the Miles / Font Company sample. Many details, such as the counter of the lower case o, are different,. The extra bold weight resembles the one you list as Fontbank / Brendel.\n\nAccording to what I find in my catalogues, I think that Scangraphic digitized their Albertus from ‘artwork’ which was taken from a catalogue from an American headliners company. Scangraphic paid license fees to Monotype back then, but for reasons unknown to me, Scangraphic never digitized from Monotype artwork. At Scangraphic, many typefaces were digitized from Berthold Staromat 2\" strips as supplied by their customers :–) They were usually switching from Berthold, Linotype or other systems and often insisted on the availability of particular typefaces on the Scantext system before the deal was closed. Many of these typesetting houses also had large collections of headline fonts. Some of them belonged to Brendel’s Type Shop chain, so some of the typefaces ‘needed’ by our new customers may origin from the Type Shop collection as well. Berthold and Linotype did not have Albertus in their library, so the Scangraphic type studio must have taken it from another source. We had several headline catalogues, could have been VGC, Headliners or the like. That was done before 1987 when I started to work there, so I cannot come up with anything more precise. In the early years Scangraphic did not have an Ikarus system. When they switched from bitmaps to outline font technology, they had many typefaces digitized by URW. From the catalogue numbers of Scangraphic and URW, I think it is likely that URW digitized Albertus from artwork supplied by Scangraphic. The Font Company was a kind of subsidiary of URW who generated and distributed (PostScript) fonts from the URW typeface library in Ikarus format. Still, that does not explain the origin of the Miles / Font Company sample.\n\nThe second possibility would be that Brendel once digitized Monotype Albertus from whatever source, extrapolated a light and a black weight from these, polished them up a bit and then re-interpolated the family. This is how most of the Brendel typefaces were made. A closer look at Adelon Light–Bold suggests that this may have been the case here too. But that story does not explain the design of the extra bold weight. The extra bold weight is quite different from the rest of the family (top serifs, overall width, contrast). After URW and Brendel split up, URW had some of the first Brendel typefaces in their Ikarus library. But the early URW catalogues do not show Albertus. Ergo: URW obtained Albertus from Scangraphic and not from Brendel.\n\nAround 1990, Monotype had some of its major typeface families digitized by URW. Like Scangraphic a few years earlier, they also had to quickly change from a bitmap based typeface library to outline description. Typefaces such as Times, Plantin, Gill Sans, Bembo and Rockwell were in that package. But I do not recall that Albertus was amongst them. Also, that does not explain the bold weight, especially not the lower case. Monotype does not have any bold weights of Albertus that are as bold as these are.\n\n"
    },
    {
      "time": "8 Apr 2014 — 1:38am",
      "content": "Here is a sample of Adelon: [https://www.flickr.com/photos/albert-jan\\_pool/13710833673/in/set-7215764...](http://web.archive.org/web/20150215061106/https:/www.flickr.com/photos/albert-jan_pool/13710833673/in/set-72157643627853825/ \"https://www.flickr.com/photos/albert-jan\\_pool/13710833673/in/set-72157643627853825/\"), Brendel’s version of Monotype Albertus.\n\n"
    }
  ]
}
