{
  "id": "55998",
  "title": "type on wheels",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was just wondering what you good people thought of this typography / branding on these:  \nthe kerning seems to leave the type like broken tombstones in long forgotten graveyard..\n\n[http://www.light-bikes.de/website/new/wp-content/uploads/2008/03/cipo2.jpg](http://web.archive.org/web/20131019145029/http:/www.light-bikes.de/website/new/wp-content/uploads/2008/03/cipo2.jpg)\n\n[http://www.roadcycling.com/artman/uploads/lightweight\\_1\\_002.jpg](http://web.archive.org/web/20131019145029/http:/www.roadcycling.com/artman/uploads/lightweight_1_002.jpg)\n\n[http://www.zweiradpool.de/u/53aPic1B23508168\\_zz\\_LightweightStandardIII.jpg](http://web.archive.org/web/20131019145029/http:/www.zweiradpool.de/u/53aPic1B23508168_zz_LightweightStandardIII.jpg)\n\n(myself; i think it's completely dreadful, unique but terrible)\n\nit seems to me they are trying to go hand drawn script but they don't really know where to start. so they chose something 'scripty' and 'typed it in'\n\n[http://bikerepairman.com/campagnolo\\_logo.gif](http://web.archive.org/web/20131019145029/http:/bikerepairman.com/campagnolo_logo.gif)\n\n[http://home.pacbell.net/trh-arch/alfa/script.jpg](http://web.archive.org/web/20131019145029/http:/home.pacbell.net/trh-arch/alfa/script.jpg)\n\noh and these are not cheap wheels either.\n\n",
  "author": "jades",
  "time": "18 Mar 2009 — 4:56am",
  "uid": "2558",
  "comments": [
    {
      "time": "18 Mar 2009 — 8:01am",
      "content": "Hi,  \nI am a big cyclist myself and as much as i would want to have a pair of Lightweights, this branding with Apple Chancery would make me so slow. A shame because these wheels cost a fortune (for the prize of one pair you would get a good complete bike). As for Campagnolo: this is a rather old logo and not a retro one. This was the style in the Fifties. But Lightweight is poor. It tries to mimick the grandness and reputation of brands and products like Campagnolo. The ›Lighties‹ at current state are the best wheels you can have. But the wordmark really looks like a cheap inscription on a cheap tombstone, i agree. And it is not unique at all. Why? It is just typed Apple Chancery with loose spacing. The outcome of an engineer who knows how to build high-performance wheels and who therefor thinks he can make a good logo, too. As a matter of fact, many many professional cycling teams are equipped with those wheels, so success is on his side.\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:41am",
      "content": "i thought it was either zapf or apple chancery - i think it could be lucida calligraphy though...\n\n'clueless german rubbish' is what i thought... they'd be better off with some euro-germanic helvetica -- or even embrace a black letter!\n\n"
    },
    {
      "time": "18 Mar 2009 — 12:30pm",
      "content": "Which one it is actually i didn’t really examine, because i dislike this logotype.  \n’clueless german rubbish’: well; it is a German company after all ;-) They will soon discover DIN for themselves. Black letter, only if they want to address the young and cool kids. But they can’t afford those wheels.\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:37pm",
      "content": "It certainly doesn't scream cycling or modern. If they are making money, it is proof that good branding does not hurt good engineering.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131019145029/http:/www.thefontry.com/)\n\n"
    }
  ]
}
