{
  "id": "56003",
  "title": "rund - Display font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hey guys,\n\nI recently finished a display font. It is called rund which is Swedish for round.  \nIt is based on 12 circles laid out on a 3x4 grid.\n\nIt comes with a PDF poster that follows a similar 3-column grid, with the main copy laid out as the 3x4 grid used for the font. The color scheme is based on hue increments of 30, going from 0 to 360, thus completing the whole color wheel/circle.\n\nIt is downloadable for free from my site [| you can get it here](http://web.archive.org/web/20150416052825/http:/www.andersorrberg.com/index.php?/personal/rund---display-font/)\n\nLet me know what you think.  \nHope you enjoy it.  \n/Anders\n\n ![](http://web.archive.org/web/20150416052825im_/http:/typophile.com/files/rund_1_5483.jpg)\n\n ![](http://web.archive.org/web/20150416052825im_/http:/typophile.com/files/rund_2_4129.jpg)\n\n",
  "author": "andersOrrberg",
  "time": "18 Mar 2009 — 7:09am",
  "uid": "42083",
  "comments": [
    {
      "time": "18 Mar 2009 — 8:13am",
      "content": "It has some interesting shapes. I like the flow of the characters. The z, q & x mess with me, but I see no other alternatives considering the constraints of the design. My biggest problem is, from a sign design stand point, that it is too weak. It would get lost in the negative space from any distance at all. Still looks cool.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150416052825/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "18 Mar 2009 — 9:07am",
      "content": "Thanks for the feedback.\n\nYeah, some problems can't be avoided, following the constraints of the grid.\n\nYou're right, it wouldn't work on a sign, it wasn't really intended to do that either though. It might be a bit too weak in general but I quite liked it being so thin. I have been considering making a few other weights though, which would extend the possible areas where it could be used.\n\nIt works best in printed media and in fairly large point size on screen.\n\n/A\n\n"
    },
    {
      "time": "18 Mar 2009 — 10:05am",
      "content": "I could see it used on a sign or poster ad in a mall for an artsy boutique, even as light as it is.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150416052825/http:/www.thefontry.com/)\n\n"
    }
  ]
}
