{
  "id": "56008",
  "title": "Just another sans – Bruna Grotesk",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello Everybody,\n\nI thought I'd share another thing I'm working on with you. I started this a while ago for a rather big client who gave me a VERY specific and limiting briefing, which is why this typeface deliberatly borrows elements of Helvetica, DIN and Eurostile (!!). This is nothing I'd normally do, but I tried to have fun with it and somehow find a way to make this worthwhile, and in the end I really started to like this.\n\nWhen the job finally didn't happen, I stopped working on this, but now I have a client who wants to use this , so I have to finish at least the light style.\n\nAny comments are highly appreciated...\n\nCheers,  \n\\*H\n\n ![](http://web.archive.org/web/20150414171012im_/http:/typophile.com/files/Bruna_01_4941.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Bruna\\_Grotesk\\_1.pdf](http://web.archive.org/web/20150414171012/http:/typophile.com/files/Bruna_Grotesk_1.pdf) | 53.71 KB |\n| [Bruna\\_Grotesk\\_020709.pdf](http://web.archive.org/web/20150414171012/http:/typophile.com/files/Bruna_Grotesk_020709.pdf) | 61.05 KB |\n\n",
  "author": "hn2o",
  "time": "18 Mar 2009 — 10:34am",
  "uid": "4781",
  "comments": [
    {
      "time": "19 Mar 2009 — 10:20am",
      "content": "I think it works well, apart from the lowercase a. It looks too much forced into the grid, in my opinion. Especially apparent in the heavier weights (in the light version it isn't really that bad).\n\nPersonally I like the Eurostile influence, to be honest. Maybe it prevents it from becoming just another grotesk.\n\nAnd on a sidenote, really a coincidence; I used a very similar text for a specimen I made a while ago. With electromagnetic oscillating thermoplastic generators, etc. ;)\n\n"
    },
    {
      "time": "19 Mar 2009 — 11:06am",
      "content": "Thanks for your comment,\n\nI think you're right about the \"a\", I like where it's going, but it DOES feel a little forced. To be honest, the only style I really worked on, is the Light (because that one was initially required), the rest was quickly done in one afternoon. Anyway, I'll try to refine it...\n\nDoes anyone think the S is too wide? I've just looked at it too often, I guess...\n\n\\*H\n\n"
    },
    {
      "time": "19 Mar 2009 — 11:46am",
      "content": "I like it, and I second Quincunx' comment about the Eurostile influence. To be honest, do we need another grot that looks the same as the rest? Yours has a more industrial feel to it that I think works well.\n\nAnd I'm a sucker for light weights :)\n\n"
    },
    {
      "time": "19 Mar 2009 — 12:28pm",
      "content": "This is going to be a great typeface! I think the lc a of the light works perfectly fine, perhaps it needs a little thinning towards the terminal, but I agree that the bold a needs more work.\n\nI think the n, m and h shoulders perhaps need a little attention, I would have tried opening them a little bit more, perhaps by moving the center of the curve just a tiny bit to the right.\n\nHave you considered alternative ways of joining the k and K arms to their stems? Your solution works great, though.\n\nI think the S is as wide as it should be, but I'd have another a look at the curves, I think there is some very slight disharmony between the upper and lower part of the glyph.\n\nTo these Norwegian eyes, the Å with the ring joined to the A looks weird. I know a lot of typefaces do this, but to us Scandinavians, it's just wrong. Also, the eth doesn't work. (I read Old Norse, so I am very used to eths, thorns and o with ogoneks.) Have a look at [Gunnlaugur Briem's advice](http://web.archive.org/web/20150414171012/http:/briem.ismennt.is/2/2.11/2.1.4.eth.htm).\n\nPlease take these suggestion with several grains of salt, I'm a beginner at typedrawing.\n\nI have to say I'm quite envious of this typeface, I've tried something similar myself, but yours is way better. Drawing a good sans is far more difficult than drawing a serif, in my opinion. I'm really looking forward to seeing it developed.\n\n"
    },
    {
      "time": "20 Mar 2009 — 2:44pm",
      "content": "the S is tilting abit to the left ... maybe it is a bit wide, yes.  \na part from that, i like the direction and the balance. good one!\n\n"
    },
    {
      "time": "27 Mar 2009 — 5:47am",
      "content": "_To be honest, do we need another grot that looks the same as the rest?_\n\nThe client asked for it!\n\nDo we need another humanist sans or another serif or another blah blah? Come on, we're all here on Typophile because we do!  \n(All said in good faith!)\n\n"
    },
    {
      "time": "29 Mar 2009 — 9:18am",
      "content": "Andrew, it was a rhetorical question, Dan Gayle answered it in his own post. He said: _\"To be honest, do we need another grot that looks the same as the rest? Yours has a more industrial feel to it that I think works well.\"_ :)\n\n"
    },
    {
      "time": "3 Apr 2009 — 9:55am",
      "content": "I know, it was all said in good faith :-)\n\n"
    },
    {
      "time": "3 Jul 2009 — 8:33am",
      "content": "Hey,\n\nI didn't have much time to work on this recently, but I tried to refine some things and worked on the bold style. So far I haven't been able to incorporate all of your input, but please, keep it coming...\n\nThanks,  \n\\*H\n\n"
    },
    {
      "time": "3 Jul 2009 — 8:44am",
      "content": "Uh, I just realized there's an ugly mutated pseudo-inktrap in the bold \"A\". Please ignore that :-)\n\n"
    },
    {
      "time": "29 Jul 2009 — 11:33am",
      "content": "That's a very interesting one! You can imagine a type geek looking at this in a paragraph thinking that it's Eurostile from it's look and feel and then checking the individual letterforms and going: What the hell?!\n\nThe text setting is very convincing on paper. Maybe I was looking too close but the \"f\" and the \"t\" seemed to be a little too close to the letters preceding them and a little far from the letters following them.  \nThe notch on the \"r\" might be a tiny bit longer, it doesn't bother when reading but I don't know thought I'd mention that. In the bold version it would be awesome to have contextual alternates for the \"r\" where the notch is straight (like it is now) before an \"f\" or a \"t\" and then maybe a little curved down before round letters and maybe a little wider (longer notch) before straight letters.  \nI don't know just thinking.\n\n"
    },
    {
      "time": "31 Jul 2009 — 9:56pm",
      "content": "I like it a lot. It looks much more versatile than Eurostile, which I personally do not like much (overusage perhaps).\n\nI agree with s being a tad wide, I'd say r is a tad narrow. Keep it up!\n\nRodrigo Saiani\n\n"
    },
    {
      "time": "1 Aug 2009 — 1:13am",
      "content": "More than wide, I find the S just a little tiny bit too closed (i.e. the terminals look just alittle tiny bit too long after the curve).  \nThat said, great work! :-)\n\n"
    },
    {
      "time": "1 Aug 2009 — 7:48am",
      "content": "I really like it. :)\n\nMaybe you should remove the tail of the a, and make the a like in DIN. The tail of the g needs more curve imo.  \nAlso the horizontal bar of the 2 seems a little bit too long.\n\nKeep up the good work!\n\nKind regards,  \nMartijn van Berkel\n\n"
    }
  ]
}
