{
  "id": "56010",
  "title": "The Great MyFonts Purge of 2009",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Motivated by the honorable commitment on the part of MyFonts to remove fonts in their library that are plagiarized from other designs\\*, I would like to propose launching a concerted effort to purge MyFonts of such typefaces. I feel that this would be a great cultural service, as well as provide indirect financial support to scrupulous font designers in the long term. As such, foundries registered with MyFonts would be the main participants of this effort, although of course any qualified person should consider it.\n\n\\* [http://typophile.com/node/55966](http://web.archive.org/web/20140803072329/http:/typophile.com/node/55966 \"http://typophile.com/node/55966\")\n\nNeedless to say this should absolutely not become a witch-hunt, and we need to remain realistic. MyFonts is the referee, whose final decision cannot be contested; and we cannot use this opportunity to try to remove fonts simply because we think they're not well-made. Our only role would be to amplify the ability of MyFonts do its house-cleaning, to make it even better than it already is.\n\nThe question is, how do we organize such a \"committee\"?\n\nMy suggestion would be to:  \n1) Compile a list of willing volunteers, using this thread.  \n2) Implement an intelligent but fair mechanism of excluding saboteurs from volunteering.  \n3) Get a list from MyFonts of the alphabetic distribution of font quantities.  \n4) Assign the workload alphabetically to the volunteers.  \n5) Give the volunteers plenty of time (but still have some sort of deadline).  \n6) Require that the volunteers submit work-in-progress to the committee.\n\nIn the end, the committee would hand over a list  \nof fonts to MyFonts, and then promptly disband.\n\nPlease let me know what you think, and if you'd like to volunteer.\n\nhhp\n\n",
  "author": "hrant",
  "time": "18 Mar 2009 — 12:20pm",
  "uid": "1250",
  "comments": [
    {
      "time": "18 Mar 2009 — 12:28pm",
      "content": "\\>\\>In the end, the committee would hand over a list of fonts to MyFonts, and then promptly disband.\n\nIsn't that similar to what is said during every military coup?\n\nRegardless...\n\nIn your great \"purge\", how would people get access to the outlines, which IMO is the only concrete way to make sure that a typeface is unique?\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:16pm",
      "content": "I find Adam's suggestion (send an email to MyFonts) easier to pursue. Don't you think the committee idea is a tad too democratic or communistic for a monarchist? ;-)\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:32pm",
      "content": "Well, Dan, I think that in Stalin's day, a simple call to the local commissar did the trick.\n\nIf it looks suspiciously like somebody else's work, you can report it to MyFonts's & and their equivalent of the NKGB can get on the case.\n\nIs there a Siberia in Fontland?\n\n-=®=-\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:34pm",
      "content": "Sounds really dangerous to me.\n\nGood idea, but really easy to abuse.\n\nAnd since I teach design history, which includes some wonderful examples of things like this that have gone horribly, horribly wrong (the career of ernst deutsch comes to mind; and of course, the degenerate art exhibit as an extreme example)\n\nHow 'bout using the What The Font technology to simply look for similar strokes to existing digital types in their library (and others) - and go from there.\n\nAnd one thing about their contract is there is VERY STRONG language about copying existing fonts and posting them as your own. (At least that's what I remember signing, I'd have to go dig it up)\n\ns.\n\n"
    },
    {
      "time": "18 Mar 2009 — 1:53pm",
      "content": "This can only go horribly wrong.\n\n"
    },
    {
      "time": "18 Mar 2009 — 2:22pm",
      "content": "Of course the people involved in this would need to be secretive about their suspicions before MyFonts decides \"who to free and who to blame\".  \nBut I think some are overplaying the Great Danger here. Note point 2 in Hrant's post (which does sound like he's planning a guerrilla war of sorts, but also shows a good dash of prudence), and that the goal of this is stated as making \\*recommendations\\* to MyFonts – not going out on the streets at night and blindly massacre unsuspecting type designers who might be forging stuff.\n\nThat said, I also doubt the idea, while honorable, is actually practicable. For one thing, I wonder about the actual methodology of spotting the culprits. Dan makes a good objection, to start with. I worry that it sounds a bit too good/idealistic to be workable.\n\n"
    },
    {
      "time": "18 Mar 2009 — 2:25pm",
      "content": "I will say this however, \"The Great MyFonts Purge of 2009\" has a certain ring to it. Is that destiny I hear calling?\n\n"
    },
    {
      "time": "18 Mar 2009 — 2:52pm",
      "content": "What would the criteria be for \"plagiarized\"?\n\nThere are designs that are based on another's work, but digitized from scans rather than direct software copying. I know of one instance where work was scanned directly out of a lettering artist's instructional book (despite protests) and made into a fairly popular font.\n\n"
    },
    {
      "time": "18 Mar 2009 — 3:43pm",
      "content": "\\> how would people get access to the outlines\n\nThat's something MyFonts would do (as Adam says he's done before) as a \"stage 2\". BTW, I personally don't think plagiarism is limited to swiping outlines; for example if somebody makes an Industria copy from scratch, I would think it should be removed (even though it's not illegal, at least not in the US).\n\n\\> really easy to abuse.\n\nThe saving grace is that the decision remains with MyFonts. All we would be doing is bringing things to their attention. And the reason this makes sense is because: there are so many fonts in their library; and many eyes are better than a few. In fact I see this as a continuous process (I mean even with existing fonts, not new ones) with repetitive iterations slowly weeding out problem fonts; a person who did the \"P\" fonts could take on the \"Q\" fonts afterwards, and find something the first \"Q\" screener missed. Waiting in your dentist's lobby? Instead of playing that dumb iPhone game, make yourself useful! :-)\n\n\\> I find Adam’s suggestion (send an email to MyFonts) easier to pursue.\n\nThis is basically a scaled-up, organized version of that.\n\n\\> What would the criteria be for “plagiarized”?\n\nThat's a good question. But again, the criteria remain within MyFonts. Guidance from MyFonts would certainly help align our work with their \"actionability\".\n\n--\n\nBasically, it doesn't make sense to say: \"It's not fair, because without your help MyFonts would never have caught that font.\"\n\n--\n\nWhat I'm picturing is neither self-righteous nor highly robust. I see it basically as a way to provide free manpower to MyFonts, our collective culture, and each other.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2009 — 3:45pm",
      "content": "{An edit brought this down one spot.}\n\nBTW, I once had the similar -if less thorny- idea of having a Magazine Scout Task Force or something: a group of people where each person has the responsibility of scouring a given design magazine each issue, and reporting what type-related stuff it has to all interested. I thought of that simply as an efficiency too: I was spending too much time fishing for and looking through design magazines every stinkin' month for something interesting. Now, because that \"task force\" was not formed, I've had to stop looking almost completely.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2009 — 3:44pm",
      "content": "Now, that Magazine Scout Task Force idea sounds cool. That sounds like a blog idea. I'd contribute to that.\n\n"
    },
    {
      "time": "18 Mar 2009 — 3:47pm",
      "content": "\"Don’t you think the committee idea is a tad too democratic or communistic for a monarchist? \"\n\nLOL!!! funniest post of the day!\n\nChrisL\n\n"
    },
    {
      "time": "18 Mar 2009 — 3:50pm",
      "content": "A Committee of Font Safety. Hmmm. Let's dust off the Guillemet and lop off some serifs, terminals, and bowls.\n\n"
    },
    {
      "time": "18 Mar 2009 — 4:47pm",
      "content": "couldn't myfonts simply have some sort of built-in reporting on each font?\n\nso as i'm searching, i see a font that i think looks stolen from somewhere else, so i simply click the 'report this font' button and write a brief message to myfonts explaining my concern.\n\nalso, how would you handle the historically situation of fonts like Helvetica where there are numerous legal 'copies' by well-established foundries?\n\n"
    },
    {
      "time": "18 Mar 2009 — 5:01pm",
      "content": "_And since I teach design history, which includes some wonderful examples of things like this that have gone horribly, horribly wrong_\n\nSecret tribunals, anyone?\n\n ![](http://web.archive.org/web/20140803072329im_/http:/typophile.com/files/BattlestarGalactica_--_3x05_-_Collaborators_4654.jpg)\n\n"
    },
    {
      "time": "18 Mar 2009 — 5:04pm",
      "content": "_also, how would you handle the historically situation of fonts like Helvetica where there are numerous legal ’copies’ by well-established foundries?_\n\nWell, those wouldn't fall under scrutiny, I suppose. But there are plenty of \"revivals\" of typefaces that are given completely different names. What about those?\n\n"
    },
    {
      "time": "18 Mar 2009 — 6:25pm",
      "content": "ricardo said:  \n\\> Secret tribunals, anyone?\n\ni'm new here, so i can pretend i don't know  \nyou've all seen this a million times already...\n\n\\> [http://www.youtube.com/watch?v=i3k5oY9AHHM](http://web.archive.org/web/20140803072329/http:/www.youtube.com/watch?v=i3k5oY9AHHM \"http://www.youtube.com/watch?v=i3k5oY9AHHM\")\n\n-bowerbird\n\n"
    },
    {
      "time": "18 Mar 2009 — 8:40pm",
      "content": "Simon, I actually presented that idea in that other thread,  \nalthough I thought it would make sense to restrict the  \nfeedback source to registered foundries.\n\nGuys, cut the sinister angle eh? :-)\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2009 — 10:46pm",
      "content": "Well, Hrant, honestly, why should we purge MyFonts at all? Are they worried and want our help?\n\nIs the zeal itself not a worry? Nothing better to do, pehaps?\n\n"
    },
    {
      "time": "18 Mar 2009 — 11:07pm",
      "content": "I have found that sending an email to MyFonts is the better choice.\n\n"
    },
    {
      "time": "19 Mar 2009 — 8:55am",
      "content": "Honestly I don't know how badly \"infected\" MyFonts is - maybe the problem is minimal. But I have to think that if it was minimal they would have said so in the other thread; instead they expressed their encouraging desire to make/keep MyFonts clean, with people like Adam apparently previously spending a good amount of time checking stuff out. And I think the reason is simple: it's something reputable signatories to the MyFonts contract consider added value.\n\nTiffany, this _is_ sending an email to MyFonts. Just a large one that's a result of a concerted effort, instead of a group of headless chickens randomly running into stuff, and not even knowing the criteria that MyFonts would use to take their alert seriously or not.\n\n--\n\nUpdate:  \nI just read in that other thread Mike telling me that \"you overstate the frequency of plagiaristic fonts appearing on MyFonts.\" So maybe this would be wasted effort after all. On the other hand, from the rest of Mike's post in that thread I have to think that what I consider a good definition of \"plagiarism\" is broader than his, and by extension presumably that of MyFonts. But that's a MyFonts matter, so a better course of action right now might be to convince them to broaden their definition!\n\nhhp\n\n"
    },
    {
      "time": "19 Mar 2009 — 9:03pm",
      "content": "Actually, I think someone did say the problem isn't that big in the other thread.\n\n\\> _so as i’m searching, i see a font that i think looks stolen from somewhere else, so i simply click the ’report this font’ button and write a brief message to myfonts explaining my concern._\n\nUnfortunately such an option never really works. It gets abused very quickly.\n\n"
    },
    {
      "time": "19 Mar 2009 — 9:13pm",
      "content": "Did you read my \"Update\"?  \nI made that edit over 12 hours before your post.\n\n\\> Unfortunately such an option never really works.  \n\\> It gets abused very quickly.\n\nReally? Remember, only MyFonts makes the decision (and if they err it would probably be on the side of keeping the font). All third parties are doing is raising flags. Practically, the MyFonts \"engine\" could pass along a font to a human for possible purging only after it gets multiple flags.\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2009 — 11:46am",
      "content": "\\> _I made that edit over 12 hours before your post._\n\nOh right, this board is too confusing with posts jumping all over the place when someone edits them. I wonder why that hasn't been fixed yet, it's quite annoying.\n\n\\> _Really? Remember, only MyFonts makes the decision (and if they err it would probably be on the side of keeping the font)._\n\nI understand, but there will always be childish people who organize something so that a gang of people click the 'report this' button.\n\n"
    },
    {
      "time": "20 Mar 2009 — 12:06pm",
      "content": "\\> this board is too confusing with posts jumping  \n\\> all over the place when someone edits them.\n\nAgreed wholeheartedly.  \nBut that's not what happened in this case. I remember making the edit minutes after the original post, and furthermore the order of the posts was not affected. BTW, if an edit renders the order confusing I add a short caveat to that effect, at the top.\n\nIt's a good idea to read posts in their entirety before replying, instead of simply reacting to the first juicy thing one runs into and ignoring the rest, the latter approach being indicative of a greater desire to talk than to listen. In cases of lack of time/desire, it's useful to start off by stating that not all had been read.\n\nAll this is motivated by the desire for clear and gracious communication.\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2009 — 1:20pm",
      "content": "Hrant (and everyone else),\n\nIt's great to see that so many people are interested in making MyFonts even better! As I stated in the other thread, we encourage people to report anything they see on the site they think is plagiaristic. However, I wouldn't say we're at all worried or think that plagiaristic fonts are currently a problem.\n\nThe specialized \"report this font\" feature is interesting, but to be honest, email is still probably the most useful for us. It allows people to fully describe their concerns and requires no extra design, development, or implementation time (the cost of which would detract from other things we could be doing to more effectively help our foundries sell their fonts). I would hope that if someone thought a font was plagiaristic, they would take the time to quickly open a new email, drop the URL in and describe their concerns.\n\nWe obviously couldn't stop people if they wanted to make an organized effort to sift through the tens of thousands of fonts on the site looking for rip-offs… but in all honesty I don't think it would turn much up. We've taken our own efforts to eliminate plagiaristic material from the site quite seriously and I'm confident that very little has slipped through the proverbial cracks.\n\nBut, by all means, if anyone thinks I'm totally wrong and that the site is indeed riddled with plagiaristic fonts, please let us know by sending an email with your examples and we will be happy to investigate.\n\n"
    },
    {
      "time": "20 Mar 2009 — 1:50pm",
      "content": "Nick, thank you for the considered response.\n\nMaybe I'll do a judicious sampling and see if the proportion  \nof plagiarism is in fact worrisome. The only problem is I'm  \nnot an accomplished font hound - there are at least a dozen  \npeople much more qualified for such a scouting mission.\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2009 — 3:35pm",
      "content": "The few times I have seen potential rip-offs mentioned here on Typophile, they have been very quickly dealt with and removed by MyFonts (and other vendors as well). Granted, there are plenty of revivals of old classic faces around but I have not heard of real pirated stuff except on free sites. The bigger issue seems to be user to user donation rather than reputable sites selling stolen work.\n\nChrisL\n\n"
    },
    {
      "time": "20 Mar 2009 — 5:19pm",
      "content": "\\> _It’s a good idea to read posts in their entirety before replying_\n\nYou're absolutely right. My bad.\n\n"
    },
    {
      "time": "19 Jun 2011 — 12:21pm",
      "content": "[http://spiekermann.com/en/rip-off-explained/](http://web.archive.org/web/20140803072329/http:/spiekermann.com/en/rip-off-explained/ \"http://spiekermann.com/en/rip-off-explained/\")  \nSilkstone has been quickly removed. But Erik is a big name...\n\nYou want to make MyFonts more hospitable to reputable  \nfoundries, big or small? Don't be afraid of activism.\n\nhhp\n\n"
    },
    {
      "time": "20 Nov 2012 — 10:09am",
      "content": "This should not be on MyFonts:  \n [http://www.myfonts.com/fonts/softmaker/columbia-serial/](http://web.archive.org/web/20140803072329/http:/www.myfonts.com/fonts/softmaker/columbia-serial/ \"http://www.myfonts.com/fonts/softmaker/columbia-serial/\")\n\nhhp\n\n"
    },
    {
      "time": "20 Nov 2012 — 11:31am",
      "content": "You mean Optimaoff?\n\n"
    },
    {
      "time": "20 Nov 2012 — 6:48pm",
      "content": "I'm just surprised it even _exists_. I mean, there's Zapf Humanist and Ottawa, if you want to buy an imitation cheap (through getting an old version of Corel Draw)... and, more importantly, there's MgOpen Cosmetica.\n\nSo if you're prepared to pay _real money_ for Optima, I presume you would want the real thing.\n\n"
    },
    {
      "time": "21 Nov 2012 — 6:59am",
      "content": "There is a song in there:  \n\"Even better than the real thing\"\n\n"
    },
    {
      "time": "21 Nov 2012 — 9:04am",
      "content": "Maybe if you need a slightly higher x-height?\n\n"
    },
    {
      "time": "5 Dec 2012 — 1:59am",
      "content": "The problem, already profusely debated, is isn't specific to [http://www.myfonts.com/fonts/softmaker/columbia-serial/](http://web.archive.org/web/20140803072329/http:/www.myfonts.com/fonts/softmaker/columbia-serial/ \"http://www.myfonts.com/fonts/softmaker/columbia-serial/\")  \nIt's more generally related to [http://www.myfonts.com/foundry/SoftMaker/](http://web.archive.org/web/20140803072329/http:/www.myfonts.com/foundry/SoftMaker/ \"http://www.myfonts.com/foundry/SoftMaker/\")\n\n"
    },
    {
      "time": "5 Dec 2012 — 6:17am",
      "content": "My background is moral philosophy, and I'm trying to get my head/heart wrapped around the issue of this thread... there seem to be various 'streams' here, such as:\n\n1. Long-standing, historical, and institutional manipulations by large foundries (the multiple iterations and plundering of Linotype assets, the non-disguised Softmaker mass-theft, etc.). Perhaps I am unlearned in these matters, but it seems that this historical/institutional manipulation has gone largely unpunished... indeed... it seems to reverberate throughout various generations without a great deal of fanfare...\n\n1a. To take Avant Garde as an example, I'm still confused why the ITC release contains all the cool alternate characters, whereas the Adobe release of \"ITC Avant Garde\" does not... is there revenue sharing going on, or not? Why offer differing releases of the same typeface?\n\n2. The world of typography (even though the internet and other technologies have allowed for significant growth) is still a smallish world, and the politics of the players in this smallish world are human and prone to human frailties... such as recently witnessed in the case where Latinotype voluntarily withdrew a typeface:\n\nDear friends of Latinotype,\n\nWe feel it is a duty to inform you that we have removed the last typography published by Latinotype; \"Bon Apettite\" of Coto Mendoza.\n\nThe reasons for this decision are the similarities of \"Bon Appetit\" with the font of Sudtipos \"Lady Rene\", along with respect and admiration we have for the designer Laura Varsky, we assume that \"Bon Appetit\" has formal and stylistic similarities with Lady René .\n\nWe consider relevant assume our responsibility as foundry in our lack of rigor in the review of proposals with which we work with respect to those in the market; we ask  \napologies to Sudtipos and to Laura. We made this decision the same day he introduced us comment.\n\nAs a proposed solution company we are willing to recognize this fact a great opportunity for growth and improvement in our procedures in working with type designers from Latin America.\n\nMichael, Daniel and Luciano  \nLatinotype Team.\n\nNow, I am NOT a typographical expert, but most would admit that it is a real challenge to quantify that these two typeface are remotely similar to each other. Thus, it seems that politics, bad blood, or whatever you might call it, is simmering in this soup... and it is this human component that sometimes drives designers to \"call foul\"... I, for one, would not like to take responsibility to referee these tangled webs !!\n\nAnd, finally, 3: There seems to be almost a daily design of a new sans-serif typeface... and although it is laudable that people are creative... at some point, the tragedy of the commons kicks in... (and this is a pet complaint of mine: most of the new typefaces are simple affairs, not easily usable in professional settings which require condensed, compressed, narrow, variations, etc...)... I'm not sure what real benefit it is to go after all these \"minor\" offerings of a new sans-serif or other cute thing... their impact on typographical history will most likely be short-lived... so why go through all the effort to form committees, etc.?\n\nHmmm.. that should be a bit more than 2 cents worth...\n\n"
    },
    {
      "time": "5 Dec 2012 — 11:42am",
      "content": "The tragedy of the commons related to ﬁnite resources.  \nThis is the digital era, where the quantity of type designers does not limit and diminish what is possible, but rather enhances it. Long Tail culture.\n\nIMO the proliferation of foundries, each with its own version of the generic styles, subtly evolving in the marketplace, is to be lauded.\n\n"
    },
    {
      "time": "19 Mar 2013 — 11:00am",
      "content": "[http://www.myfonts.com/foundry/Elemeno/](http://web.archive.org/web/20140803072329/http:/www.myfonts.com/foundry/Elemeno/ \"http://www.myfonts.com/foundry/Elemeno/\")\n\nhhp\n\n"
    }
  ]
}
