{
  "id": "56020",
  "title": "Basics of Typography Presentation",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm going to be doing a BASIC typography presentation to my class (10th grade), and even though I don't really know everything about it, I think I have a pretty good grasp of type. I'm going to be doing a very basic presentation (\\<15 mins) and I'm just wondering if I've covered all the basics. It's a powerpoint in PDF form.  \n(Friendly) Critiques welcome.  \nThanks in advance!\n\n| Attachment | Size |\n| --- | --- |\n| [Typography PPT.pdf](http://web.archive.org/web/20150328232614/http:/typophile.com/files/Typography%20PPT.pdf) | 312.5 KB |\n\n",
  "author": "msutherland",
  "time": "18 Mar 2009 — 7:51pm",
  "uid": "43070",
  "comments": [
    {
      "time": "19 Mar 2009 — 1:25am",
      "content": "This seems like a pretty good intro to type for young students, although I have some comments about your recommendations.\n\n1. I'm not sure why the ubiquity of Times New Roman and Arial is a good reason not to use them. For school assignments, I have always found it helpful to check with teachers before changing typefaces, as the teachers may not appreciate this. Also, TNR is very useful when you need a typeface with a very economical fit, and has a full set of IPA characters which is quite rare, even in very expensive fonts.  \n2. Recommending high school students to use Caslon and Garamond (you show Adobe Garamond here) may lead them to illegally download these fonts. Remembering back to when I was that age, I suspect that young students would be unlikely to buy either these fonts or the software they come bundled with. If they have access to these fonts at school, of course that is a different matter. That being said, Adobe does make a font package available to students practically for free, called FontFolio Education Essentials.  \n3. Other alternatives to TNR and Arial you might want to discuss are the various free/inexpensive options that are out there. Among these, the Microsoft ClearType fonts are available without the purchase of Vista or Office 2007. These have extensive character sets, are well designed, and of course look excellent on screen (which will be the main way that students are likely to choose type.) If you search this site you will find a variety of threads about the topic of free/inexpensive fonts.  \n4. Why do you suggest to avoid heavy typefaces? I presume you are mean only for use in extended reading?  \n5. I like that you discuss typography and not just type choices. A decent font set well is usually better for the reader than an excellent font set poorly.  \n6. Finally, make sure that you communicate to students that there are people who actually spend a lot of time designing these fonts that magically appear in their font menus. It's a good thing to educate people about type, even better to include education about why commercial fonts cost money!\n\n"
    },
    {
      "time": "19 Mar 2009 — 4:29pm",
      "content": "Thanks! Yeah, I forgot to mention that we have Garamond and Caslon installed on the computers at school. And we're doing a project where we are compiling poetry, art, and essay writings into a small book. Thanks so much for the help!\n\n"
    }
  ]
}
