{
  "id": "56043",
  "title": "Public Enemies Poster Font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I bet this baby is called something that ends in gothic, but neither my specimen books, linotype's font-identifier nor whatTheFont can put a name to it.\n\nCan anybody here do it? :)\n\n ![](http://web.archive.org/web/20150312204050im_/http:/typophile.com/files/publicenemies_font_4046.jpg)\n\n ![](http://web.archive.org/web/20150312204050im_/http:/typophile.com/files/publicenemies_6700.jpg)\n\n",
  "author": "shockomotive",
  "time": "19 Mar 2009 — 10:13am",
  "uid": "28683",
  "comments": [
    {
      "time": "19 Mar 2009 — 3:09pm",
      "content": "With the slight difference between the three Es I think it is hand lettered, copying a simple signwriters grid-based gothic appropriate to the era.\n\n"
    },
    {
      "time": "20 Mar 2009 — 2:35am",
      "content": "Actually the slight differences stem from my resizing of the lettershapes in the poster, which have a slight gradient overlayed. I do believe that this really is a font and not hand-lettered type.\n\n"
    },
    {
      "time": "20 Mar 2009 — 3:17am",
      "content": "I just went to check out the official Public Enemies website hoping to find a press kit with the embedded font, but I did not get lucky. So instead I noticed that the preloader seemed to use the same typeface, so I took a peek inside the swf file and it uses Compacta, which is similar but not identical. Its M touches the baseline, the middle of the S is not straight but diagonal and the height-width relation does not quite match up either. But it's close.\n\n[http://new.myfonts.com/fonts/letraset/compacta/](http://web.archive.org/web/20150312204050/http:/new.myfonts.com/fonts/letraset/compacta/)\n\n"
    },
    {
      "time": "24 Apr 2009 — 9:11am",
      "content": "Should be [New Deal](http://web.archive.org/web/20150312204050/http:/www.grafikcache.com/?p=1109), designed by Neville Brody at Research Studios.\n\n"
    },
    {
      "time": "27 Apr 2009 — 2:44am",
      "content": "Thanks a bunch Ryuk, you've saved me some sleepless nights!\n\n"
    },
    {
      "time": "19 May 2009 — 9:46pm",
      "content": "shockomotive, how were you able to get access into the swf file/press kit? also, greeeeat font, and thanks for the find ryuk.\n\n"
    },
    {
      "time": "19 May 2009 — 9:56pm",
      "content": "I like how it says public enemies right near the lower abdominal area... good thing they had good proofreading on \"Public\"\n\n"
    }
  ]
}
