{
  "id": "56060",
  "title": "Kris made me happy",
  "forum": "Release",
  "tags": [

  ],
  "content": "Just released by Village: new cuts of National — Thin, Light and Black in roman and italic.\n\n",
  "author": "<a href=\"/web/20100203002732/http://typophile.com/user/3972\" title=\"View user profile.\">bert_vanderveen</a>",
  "time": "<br>",
  "uid": "3972",
  "comments": [
    {
      "time": "",
      "content": "Is the option to upgrade from basic to the (old) full version vanished? Darn!\n\n"
    },
    {
      "time": "",
      "content": "That option didn't vanish ($ 100)\n\n"
    },
    {
      "time": "",
      "content": "I can't seem to find it.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100203002732im_/http:/typophile.com/files/national_4560.jpg)\n\n"
    },
    {
      "time": "",
      "content": "That's not what I'm asking for. Previously you could upgrade from a basic to a full family for $100.\n\n"
    },
    {
      "time": "",
      "content": "kris made me happy too: just upgraded National... and licensed also Feijoa: maybe this will make Kris happy and thinking about expanding it a little bit: italic small caps can be useful... :^).\n\n"
    },
    {
      "time": "",
      "content": "That $100 upgrade is still one hell of a good deal for such quality work.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Frode, I apologize. You could contact Chester Jenkins by e-mail. He's a nice guy.\n\n"
    },
    {
      "time": "",
      "content": "I did. They'll put up a bundle with the old 6 weights soon.\n\n"
    },
    {
      "time": "",
      "content": "Just before this release I had the entire family and wow!!! So well kerned and the opentype programming is fabulous.\n\nI plan on snatching these new useful weights soon! BLACK POWER!!!!!!\n\nCopernicus is superluxe too.....ooohh and Karbon is in the works too.\n\nWhat savings account?!\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "Hurrah, finally: Karbon!\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100203002732im_/http:/typophile.com/files/NationalHappens_5934.png)\n\nChester and Kris made me happy today too.\n\nI completed National by way of the excellent Taste Test program (that is until we get the condensed styles which would be soo welcomed) _and_ I got a head start into Copernicus.\n\nBoth types are versatile, however Copernicus is increasingly so. It’s stylish, neutral, literary, corporate, historic and contemporary—all rolled into one by way of the fantastic stylistic sets.\n\nYou can be neutral and corporate as seen here:  \n [http://vllg.com/Village/GalaxieCopernicus/Example+About/](http://web.archive.org/web/20100203002732/http:/vllg.com/Village/GalaxieCopernicus/Example+About/ \"http://vllg.com/Village/GalaxieCopernicus/Example+About/\")\n\nOr you can go for “baroque” with handsome literary swashed italicized letters: J,v,w,z. And I use the word “handsome” correctly as even though there are elaborate forms at your disposal, industrial strength features have been applied globally; sheared terminals (like Charter), generous ink traps, and in the bolds—chunky slabs (like Meta Serif).\n\nAlso, I’m a huge fan of brushy foxtailed type. Gary Munch’s Really and Mark Jamra’s Latienne are my favorite examples. Really is elegant and designed for books. Latienne, the same but without restraint.\n\nCopernicus is neutral and fabulous, and in between if you like. This is the better Platin.\n\n[http://vllg.com/PDFs/vllg\\_GalaxieCopernicus.pdf](http://web.archive.org/web/20100203002732/http:/vllg.com/PDFs/vllg_GalaxieCopernicus.pdf \"http://vllg.com/PDFs/vllg\\_GalaxieCopernicus.pdf\")\n\nMikey :-)\n\n"
    }
  ]
}
