{
  "id": "56076",
  "title": "Broadcast/License Fonts Rules/Regulations/Laws?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello there, everybody! Been forever since my last post. Good to be back. Been busy.\n\nSo, my fiancee is working on a short animation film, and obviously, it will have titles/credits, etc. Being the designer, and her the animator, I thought I'd help out. However, her peers have been advising her about public broadcast of fonts used, stating there are certain restrictions one can get in legal troubles with. The last thing we want is to have her opus stifled by some legal restriction of a font used.\n\nMy question is this: If I buy my typefaces used at MyFonts (for example), paying the fee listed, are we able to use them for public/broadcast use, etc.? I guess I'm not sure if there are differences between print licensing for use, and broadcast licensing for use. I planned on designing a logotype of sorts to be used for her film, which could be used on the film, brochures, promos, t-shirts, whatever. It's possible these could somehow lead to profit, etc. But each and every font used, we will be purchasing for this purpose.\n\nI did find a post on here about this already:  \n [http://typophile.com/node/3701](http://web.archive.org/web/20130820052117/http:/typophile.com/node/3701 \"http://typophile.com/node/3701\")  \nBut his case was describing a freeware font issue.\n\nSo....after all that....Thoughts? Legal reference? If I purchase them, are we in the clear?\n\nThanks,  \n-Josh\n\n",
  "author": "jlusby",
  "time": "20 Mar 2009 — 9:42am",
  "uid": "9858",
  "comments": [
    {
      "time": "20 Mar 2009 — 10:08am",
      "content": "Reading the licenses for the fonts is a great way to find out what they do and do not permit.\n\n"
    },
    {
      "time": "20 Mar 2009 — 10:20am",
      "content": "James:  \nA case by case basis then?\n\n"
    },
    {
      "time": "20 Mar 2009 — 10:50am",
      "content": "It is a case by case basis, but broadly speaking, most EULAs would allow this.\n\nStill, as James says, it's always best to read the agreement for any font you're interested in.\n\n"
    },
    {
      "time": "20 Mar 2009 — 10:56am",
      "content": "I agree with John, it’s unlikely that any EULA would not allow broadcast use, but you still need to read the EULA to know.\n\n"
    },
    {
      "time": "20 Mar 2009 — 11:11am",
      "content": "I've been reading some online...but none specifically mention broadcast use. Most just say not to distribute, etc. So I guess unless they specifically prohibit broadcast?\n\n"
    },
    {
      "time": "20 Mar 2009 — 4:41pm",
      "content": "By 'distribute' they mean the fonts themselves (re-package, re-sell), not the product using the fonts, such as logo or typeset text, I think.\n\n"
    },
    {
      "time": "22 Mar 2009 — 12:30pm",
      "content": "So your fiancée’s “peers” think there are some cases where you can’t use a font to typeset words?\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20130820052117/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    }
  ]
}
