{
  "id": "56119",
  "title": "Licensing question",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hey! I was wondering exactly what I can do to a font after I buy it.. for example, if I got [Bell Gothic STD](http://web.archive.org/web/20131015145732/http:/www.linotype.com/13501/bellgothicbold-font.html?PHPSESSID=206854cce463abebc6694f5d56787cc1#technical) and wanted to use [roundingUFO](http://web.archive.org/web/20131015145732/http:/roundingufo.typemytype.com/) to change it, could I then use the resulting font commercially? could I sell it?\n\n",
  "author": "scottsullivan",
  "time": "22 Mar 2009 — 11:01am",
  "uid": "37489",
  "comments": [
    {
      "time": "22 Mar 2009 — 11:39am",
      "content": "_...what I can do to a font after I buy it..._\n\nYou should probably read the EULA **before** you buy it.\n\n"
    },
    {
      "time": "22 Mar 2009 — 6:12pm",
      "content": "For your next project you can get a digital text of \"Catcher in the Rye\" and use Word to find/replace Holden Caulfield's name to Colton Hallfield, then you could publish that as \"Catcher in the Wry\".\n\nThe answer to your question is no. You don't own the intellectual property of Bell Gothic, so you don't own the results of screwing around with the outlines. The EULA may allow you to do said screwing around, but that doesn't make the underlying design or software code your property.\n\nIf I came to your house and painted it a different color, could I then put it up for sale?\n\n"
    },
    {
      "time": "22 Mar 2009 — 7:37pm",
      "content": "great idea about 'Catcher in the Rye' that's gonna get me through the recession!\n\nI'm not saying that I was going to try to sell a round bell gothic or anything. I just want to know if I can change the outlines for the purposes of a project.. for example, I might do a branding project where the text would have a black line right through the center.. would it be all that different if I were to make it rounded?\n\nI read the EULA on linotype and of course I couldn't redistribute it, but I didn't see anything saying that I can't modify it..\n\n- Scott\n\n"
    },
    {
      "time": "22 Mar 2009 — 8:22pm",
      "content": "There is actually some variance in whether foundries allow making derivative fonts for internal use, which is why I recommend to read the EULA. My EULA allows it. I doubt any would allow modification and resale!\n\n"
    },
    {
      "time": "22 Mar 2009 — 8:42pm",
      "content": "Thanks Nick!\n\n- Scott\n\n"
    },
    {
      "time": "23 Mar 2009 — 7:04pm",
      "content": "I’m not saying that I was going to try to sell a round bell gothic or anything.\n\nYes. Yes you did:  \n...if I got Bell Gothic STD and wanted to use roundingUFO to change it, could I then use the resulting font commercially? could I sell it?\n\nAre you a Republican or something? Do you even pay attention to what you're writing or saying?\n\nAs Mr Shin suggests, you should read the EULA. Some of them allow you to screw with fonts for the purposes of making your work and others do not. Selling, on the other hand, is almost certainly completely fobidden by everyone.\n\nAnyhow, if you screw around with Bell Gothic, someone here is going to tell Matthew Carter, and he will come to your house - after I have painted it and put it up for sale - and he will kick your Republican ass.\n\n"
    },
    {
      "time": "23 Mar 2009 — 10:45pm",
      "content": "hahah calm down NewGuy! [link](http://web.archive.org/web/20131015145732/http:/en.wikipedia.org/wiki/Question_mark)\n\n- Scott\n\n"
    },
    {
      "time": "25 Mar 2009 — 10:23am",
      "content": "Thanks for the link, you patronizing little snot.\n\nCould I put my foot in your face?  \nThat's the same kind of question you asked. Not rhetorical in the slightest.\n\nIf you hope to ever be a professional designer you will have to develop some ethics.\n\n"
    },
    {
      "time": "25 Mar 2009 — 1:08pm",
      "content": "look, I had a couple QUESTIONS about licensing.. mainly the one about altering and using an altered typeface for my projects, I just threw the other one in as an afterthought. BOTH questions are absolutely rhetorical. the question was politely answered by Mr. Shinn.. and I get accused of being a Republican by of all people a fellow Ohioan! I really don't understand why you're getting so upset about these things. I have plenty of respect for type designers, EULAs, ethics.. etc.\n\n- Scott\n\n"
    },
    {
      "time": "25 Mar 2009 — 3:36pm",
      "content": "Hi, Scott. Linotype doesn't allow derivatives.\n\nSection 3.2 of their EULA: \"The licensee declares not to modify, adapt or translate the encoding of the Font Software, nor reproduce, decompile, disassemble, change, modify or otherwise attempt to reveal the source code of the Font Software.\"\n\nFor that matter just read the entire [Article 2](http://web.archive.org/web/20131015145732/http:/www.linotype.com/2061-28225/licenseagreementforfontsoftwarendashlinotypeeula.html).\n\n"
    },
    {
      "time": "25 Mar 2009 — 4:56pm",
      "content": "Thanks Miss Tiffany!\n\n- Scott\n\n"
    },
    {
      "time": "25 Mar 2009 — 5:30pm",
      "content": "Eh yeah there it is, article two.. I guess everything is EULA specific.. I kinda just threw out the Linotype thing.. hmmm....\n\n- Scott\n\n"
    },
    {
      "time": "25 Mar 2009 — 7:54pm",
      "content": "But Adobe sells Bell Gothic STD too. See the answer to \"Can I customize a font using font manipulation software?\" in this pdf:  \n [http://www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf](http://web.archive.org/web/20131015145732/http:/www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf \"http://www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf\")\n\nAgain, the lesson is to read the terms you're agreeing before you buy... if you don't like them, move on!\n\n"
    },
    {
      "time": "25 Mar 2009 — 8:40pm",
      "content": "ohhhh yeah good call John!\n\n- Scott\n\n"
    },
    {
      "time": "26 Mar 2009 — 2:48pm",
      "content": "Ah, but even though you can manipulate Adobe fonts it still does not allow for derivates. Or in other words, you can manipulate, but not re-sell.\n\n"
    },
    {
      "time": "26 Mar 2009 — 2:58pm",
      "content": "yeah I know, I don't wanna sell anything that's not mine!\n\n- Scott\n\n"
    },
    {
      "time": "26 Mar 2009 — 4:18pm",
      "content": "No, that would be a bad idea. ;^P\n\n"
    }
  ]
}
