{
  "id": "56169",
  "title": "Bitmap Font Advice: Formats",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello,\n\nI would like to create a script \"font\", based on a really nice handwriting.\n\nThe pencil created a unique texture which I would like to keep. This, to my understanding, prevents me from using outline font formats.  \nMonochrome bitmap fonts (e.g. bdf don't recreate that texture all to well, so I would like to know, _how could I create a grayscale bitmap font_, compatible with most applications.\n\nFontlab's [Photofont](http://web.archive.org/web/20131022025755/http:/www.photofont.com/) does what I want and more (e.g. full color), but it requires plugins, as it is a non-standard format.\n\nPlease excuse my ignorance. _Fontlab doesn't seem to support grayscale fonts_ (only monochrome bitmaps), is that correct?\n\nThank you,  \na typographic grasshopper\n\n",
  "author": "ikarus",
  "time": "23 Mar 2009 — 12:20pm",
  "uid": "43161",
  "comments": [
    {
      "time": "23 Mar 2009 — 11:41pm",
      "content": "Fontforge does support grayscale bitmaps. However be prepared to encounter some bugs, as the feature seems to be rarely used, so that the developer doesn't pay very much attention to it.\n\n"
    },
    {
      "time": "24 Mar 2009 — 3:46am",
      "content": "Fontforge seems to support _bdf_, but I didn't find support for _grayscale bdf_, yet.\n\nThank you, I'll have another go at it.\n\n"
    },
    {
      "time": "24 Mar 2009 — 5:07am",
      "content": "When you add a bitmap strike to a fontforge file, you can specify the desired bit depth. For example, adding 19@8 to the list of strikes will produce a 19 pixels bitmap with 256 shades of gray.\n\nBTW fontforge allows to generate various bitmap formats, not just BDF. I actually think TTF with embedded bitmaps may be better for your purposes.\n\n"
    },
    {
      "time": "24 Mar 2009 — 8:06am",
      "content": "<cite>Fontlab’s Photofont does what I want and more (e.g. full color), but it requires plugins, as it is a non-standard format.</cite>  \nAt this point it may be as \"standard\" as anything related to bitmap fonts. If there was a better way, I think they would be doing it. What specific OS and OS version were you planning to use? What applications?\n\n"
    },
    {
      "time": "24 Mar 2009 — 9:09am",
      "content": "Grayscale bitmaps is a part of the standard TrueType/OpenType specification. If they meet someone's requirements, then there is just no need to look for something more special. I think Photofont is intended for more complicated tasks.\n\n"
    },
    {
      "time": "24 Mar 2009 — 10:11am",
      "content": " **anagnost:** so, i managed to get 8bit bdf's out of fontforge (yey!). Thing is, ttf's don't work (\"no glyphs were exported\"). Photofont, I agree, it's to fancy for this.\n\n**canderson:** the font is intended as a \"gift\" of sorts for a friend. It's his handwriting. It will be used mostly on macs, with as many apps as possible (i.e. not necessarily meant for print). I'd like to us it in Adobe Flash too (not sIFR).\n\nAt this point I'm really heading for vector.\n\n"
    }
  ]
}
