{
  "id": "56166",
  "title": "Book typeface demands",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was wondering if you guys can help me compile a little list of things to keep in mind when designing a book typeface. For example, newspaper types have certain demands, which are usually much more clear, like relatively large x-height, short ascenders/descenders, different grades, very prominent details, etc.\n\nAre there such aspects you would pay attention to when designing a typeface for books? Or what makes a book typeface a book typeface.\n\n",
  "author": "Quincunx",
  "time": "23 Mar 2009 — 11:37am",
  "uid": "14604",
  "comments": [
    {
      "time": "23 Mar 2009 — 11:41am",
      "content": "I’ve never done one, but if I was going to I would probably re-read Gerard Unger’s book “While You Are Reading”.\n\n"
    },
    {
      "time": "23 Mar 2009 — 12:01pm",
      "content": "I have it and read it. I'll check if there is something in there about it (there probably is), can't remember.\n\nThe little factoids I'm looking for are basically major generalizations, like the examples I mentioned for newspaper types, but it's for a short presentation I'm going to give at my school, and it's nice to be able to list a few of those aspects so people understand what I mean.\n\n"
    },
    {
      "time": "24 Mar 2009 — 1:03am",
      "content": "It should be legible.  \nFor the rest of the details, look at books with text in it.\n\n"
    },
    {
      "time": "24 Mar 2009 — 6:48am",
      "content": "_...what makes a book typeface a book typeface._\n\nStatistically, a book typeface most resembles Times Roman, the face most used for pulp fiction.  \nIronically, it was designed for a newspaper.  \nOf course, other types are suitable for books, such as Univers 75, here used in _Ways of Seeing_:\n\n ![](http://web.archive.org/web/20131010230211im_/http:/typophile.com/files/WOS_5754.jpg)\n\n"
    },
    {
      "time": "24 Mar 2009 — 7:52am",
      "content": "Nick, that example should be cut into _A Clockwork Orange_ where Alex has to watch the movies non-stop while they put teardrops in his eyes.\n\n"
    },
    {
      "time": "24 Mar 2009 — 10:22am",
      "content": "The book in question is hugely influential, almost 40 years old, and has never been out of print.  \nIts design and choice of text type might have something to do with that.\n\n"
    },
    {
      "time": "24 Mar 2009 — 10:34am",
      "content": "I have that book. Interesting read.\n\n"
    },
    {
      "time": "24 Mar 2009 — 12:35pm",
      "content": "nick said:  \n\\> Its design and choice of text type  \n\\> might have something to do with that.\n\nor it might be hugely influential  \nin spite of its design and choice of text type.  \nwe'll never really know, will we?\n\ni'm guessing, though, that it is the \\_content\\_  \nthat makes it \"an interesting read\", as dan puts it.\n\n-bowerbird\n\n"
    },
    {
      "time": "24 Mar 2009 — 5:12pm",
      "content": "_...it might be hugely influential in spite of its design and choice of text type._\n\nThat's unlikely, given the extremely graphic nature of the book.  \nCheck it out:\n\n[http://www.scribd.com/doc/243296/Ways-of-Seeing-John-Berger](http://web.archive.org/web/20131010230211/http:/www.scribd.com/doc/243296/Ways-of-Seeing-John-Berger \"http://www.scribd.com/doc/243296/Ways-of-Seeing-John-Berger\")\n\nIf you can imagine this set in Bembo, that would undermine the author's polemic.  \nThe idea is found in Godard, that a revolutionary critique cannot be presented in a conventional manner.  \nAlso influential on this work, the McLuhan-Fiore production of _The Medium is the Massage_.\n\n"
    },
    {
      "time": "24 Mar 2009 — 8:26pm",
      "content": "\\> The idea is found in Godard, that  \n\\> a revolutionary critique cannot be  \n\\> presented in a conventional manner.\n\ni'll say one thing for that text type: it was a bold choice.\n\n-bowerbird\n\n"
    },
    {
      "time": "25 Mar 2009 — 7:19am",
      "content": "It's worth noting, if I remember correctly, _Ways of Seeing_ is a short book and much of the text comes in bursts. (Isn't there a whole chapter that's just pictures?) One might see it as a book that didn't require a book typeface.\n\n_The idea is found in Godard, that a revolutionary critique cannot be presented in a conventional manner._  \nAnd before him, [Brecht](http://web.archive.org/web/20131010230211/http:/en.wikipedia.org/wiki/Alienation_Effect), among others.\n\n"
    },
    {
      "time": "25 Mar 2009 — 8:47am",
      "content": "This is sort of off the question a bit ...\n\nHere's sort of something I do with my students when talking about setting type for books. I have them play around with what is available on the computers. Then when critiquing what they've come up with, I bring them into a detailed discussion that leads to:\n\n'Would you want to read this for, oh, 1,000 pages or so?'\n\nOnce put in that context, it really narrows the field of type choices - Times New Roman suddenly gets really heavy, any Sans seem to fall away (except for the Most Determined of the Bunch to make Futura Book actually work) and display faces are shown the door (sometimes) ;)\n\nWe seem to settle on faces that are traditional, but take into account Offset printing - the adaptations of Adobe's faces - Garamond, Jenson, Caslon - where thin strokes (which worked great in letterpress) have been modified to work well using current printing technologies - seem to hold up overall.\n\nAt least, after searching everywhere for a good Shakespeare collection for my wife, we settled on The Pelican Shakespeare because (1) it was the most legible complete set we could find and we after purchasing, the colophon noted (2) it was set in Adobe Garamond. :)\n\nThat doesn't really answer the question - but does lead to students exploring on their own what may constitute a good book face.\n\nSometimes they get it, sometimes they don't. But they start taking it apart on their own and its fun to see where they go with it.\n\nAnd I get to get to say things like: 'Courier? No.'\n\ns.  \nmehallo.com\n\n"
    },
    {
      "time": "25 Mar 2009 — 9:58am",
      "content": "_One might see it as a book that didn’t require a book typeface._\n\nAnd if one did, one would be guilty of reification.\n\n"
    },
    {
      "time": "25 Mar 2009 — 11:20am",
      "content": "\\> _We seem to settle on faces that are traditional, but take into account Offset printing - the adaptations of Adobe’s faces - Garamond, Jenson, Caslon - where thin strokes (which worked great in letterpress) have been modified to work well using current printing technologies - seem to hold up overall._\n\nI was more looking for short (generalizing) factoids that make those hold up overall, like; relatively long asc/descenders, relatively wide spacing, maybe slightly heavier captials, prominent interpuntion, etc.\n\nFor newspaper typefaces the demands are -- I think -- a bit more clear. Like every weight having more than one grade (to counter different presses / paper / dot-gain), large x-height (to be able to use small pointsize) and very prominent detailing and inktraps (so the inkspread is countered), etc. I was wondering if people here keep such things in mind when designing a typeface that is more for book usage.\n\nI understand the question was kind of silly, but I think such aspects make it clear for people to understand what kind of details a type designer might pay specific attention to when designing a typeface for certain kinds of use. :)\n\n"
    }
  ]
}
