{
  "id": "56179",
  "title": "Kerning technique question",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m refining kerning based on pages of words such as Kern King, printed from Indesign. Is there any reason to not make the kerning adjustments to the page, in Indesign, and then just implement the same values in Fontlab so that I don’t have to generate as many test fonts?\n\n",
  "author": "<a href=\"/web/20090521202625/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 23.Mar.2009 10.22pm",
      "content": "No reason not to, as long as the font is using a 1000-unit em (that’s what InDesign uses). Otherwise you’ll have to do some conversion.\n\nT\n\n"
    },
    {
      "time": " 24.Mar.2009 3.25am",
      "content": "A see a reason not to.\n\nI mean, why do the kerning two times?\n\nWhy not just open up your words in FontLab and kern directly there? You can prepare text files and load them into Metrics window.\n\nThen if you would like to see how it looks in InDesign, have the document ready and just update the font you are generating.\n\nI usually generate all test-fonts directly to the Adobe\\>Fonts folder for immidiate updates in InDesign. Works very handy.\n\n"
    },
    {
      "time": " 24.Mar.2009 5.37am",
      "content": "Twice? Just [export](http://web.archive.org/web/20090521202625/http:/www.kltf.de/downloads/ATypI2007-CrossingBorders-kltf.pdf) kerning from the ID document, for import into the font. (That could handle UPM conversion too.)\n\nKerning in ID is more comfortable than kerning in the FLS Metrics panel. Just my opinion.  \nBut better leave the test font unhinted. Hinting may interfere with glyph positioning on the screen, which means that what you see is not what you get.\n\n"
    },
    {
      "time": " 24.Mar.2009 12.34pm",
      "content": "I find it easier to kern things like ligatures and contextual alts in ID, or at least to spot the obvious errors and miscalculations. I still haven’t found the best way to do that in FL.\n\n"
    },
    {
      "time": " 24.Mar.2009 1.32pm",
      "content": "[Metrics Machine.](http://web.archive.org/web/20090521202625/http:/tools.typesupply.com/metricsmachine.html)\n\n"
    },
    {
      "time": " 24.Mar.2009 2.40pm",
      "content": "Karsten, where do I get the plugin you show in that PDF? Is that something you sell, something you’re working on, or something dependent on that no-longer-available plugin?\n\nAs for metrics machine, well, I’m broke and unemployed.\n\n"
    },
    {
      "time": " 24.Mar.2009 5.29pm",
      "content": "As to the export/import scripts, I made them for my own use — they identify glyphs by GID which has awquard side-effects like: don’t apply features in ID. If I have some time later this year I’ll write a new ID script for reading out ID kerning which should also consider features applied. But maybe others have done this already? I’d appreciate it.\n\nIndeed Metrics Machine currently looks like the best interface for manual kerning since it also helps with secondary things like producing kerning strings, creating classes and copying kerning values from glyph sets to other glyph sets (including adjusting values). I enjoyed the RoboThon presentation a lot.\n\n"
    },
    {
      "time": " 25.Mar.2009 8.18am",
      "content": "(posting to track the thread)\n\n"
    },
    {
      "time": " 25.Mar.2009 11.20am",
      "content": "Karsten, wow – that is cool!\n\n"
    },
    {
      "time": " 1.Apr.2009 9.57am",
      "content": "I have a script (javascript) to run in Indesign. It makes an afm file from the manual kerning. This can be imported in FontLab. I will put it on my page soon.\n\n"
    },
    {
      "time": " 1.Apr.2009 12.11pm",
      "content": "Now _that_ is cool!\n\nKarsten\n\n"
    },
    {
      "time": " 1.Apr.2009 12.35pm",
      "content": "Sign me up for that, Georg :)\n\n"
    },
    {
      "time": " 1.Apr.2009 3.40pm",
      "content": "Tracking. Wow\n\n"
    },
    {
      "time": " 5.Apr.2009 5.01am",
      "content": "I just uploaded the script to my page.  \n [http://schriftgestaltung.de/tools/IndesignScripts.html](http://web.archive.org/web/20090521202625/http:/schriftgestaltung.de/tools/IndesignScripts.html \"http://schriftgestaltung.de/tools/IndesignScripts.html\")\n\nLet me know if it is working for you.\n\nGeorg\n\n"
    },
    {
      "time": " 5.Apr.2009 7.16am",
      "content": "I’m trying to get the script to work in Windows XP with InDesign CS3, but so far no luck. I think it should be able to work...\n\nBut the actual paths to the file are giving me problems. I gave the location to the standard.nam file in the fontlab (common files) folder in the bit that is meant for the Windows path.\n\nI don’t know what I’m doing wrong. :)\n\n"
    },
    {
      "time": " 6.Apr.2009 12.03am",
      "content": "Georg, Worked very fine indeed. I have only trid with a few pairs, but I guess it will work with more pairs aswell.\n\nThanks for making this available. Cool :)\n\n"
    },
    {
      "time": " 23.Apr.2009 10.42am",
      "content": "Georg: any idea what I can do to get it to work in XP?  \nI can’t get those actual paths right?\n\nI’ve filled in the windows paths and removed the // to make the line of code active. But when I test the script in InDesign I get the message that the paths have to be filled in.\n\n"
    }
  ]
}
