{
  "id": "56177",
  "title": "Ligatures and history, tradition",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nI found this thread ( [http://typophile.com/node/28777](http://web.archive.org/web/20131023161909/http:/typophile.com/node/28777 \"http://typophile.com/node/28777\")) early today and was blown away by the kind of dialogue on the forum, it's very exciting.\n\nI've got a more general question about ligatures, not just about legibility, but more about their context. Wikipedia says (I know, I know) that ligatures are \"slowly coming back\" because of things like OpenType fonts. This made me wonder about the use of ligatures in typography today. I'm still relatively inexperienced in the field, but have the impression that ligatures are somewhat antiquated, especially to people who might only see Times New Roman, Arial, etc in their everyday interactions with type. I'm sure they would be surprised by them.\n\nThis might be more a matter of opinion, but are ligatures (like ct, for example) more functional, or a way to express typographic tradition? I recently used Abobe Myriad Pro for the draft of a long document, and had turned on ligatures in InDesign. I was partly taken aback by the flavor it added to the text, but it also felt \"older\" (part of that is probably in part due to using Caslon...). I'm curious to see what my advisor's comments will be.\n\nI couldn't find anywhere that seemed to tackle this question specifically, but feel free to direct me if there are other places to learn, etc. Otherwise, I'm looking forward to hearing thoughts.\n\nCharlie\n\n",
  "author": "Landdogger",
  "time": "23 Mar 2009 — 3:38pm",
  "uid": "43160",
  "comments": [
    {
      "time": "23 Mar 2009 — 4:00pm",
      "content": "Certain ligatures are certainly functional, others are more of an aesthetic/historical thing. In many fonts, the traditional Latin ligatures are functional. Looking at an old MS Word document set in Times, you'll see thye f clashing with the i and it's not very pretty. That said, there are many fonts where the f is designed in a way that it doesn't extend far enough to collide into the i, l, j or what have you. Often these fonts include ligatures anyway, which sometimes are inoffensive and other times look plain silly. Look at the Latin ligatures in Gill Sans or Futura for example...they end up drawing attention to themselves, which is exactly what an f-ligature is designed to avoid.\n\nLigatures in display faces can serve many aesthetic purposes. Matthew Carter's Mantinia is a good example. It takes a lot of inspiration from inscriptional carvings which sometimes used ligatures as a space-saving device.\n\nA more recent use of ligatures can be found in handwriting and script fonts. Zapfino and Bickham Script make heavy use of ligatures and contextual alternates to combat the uniformity of type, giving the impression of hand-drawn calligraphy. Many handwriting fonts similarly will use ligatures to imitate the pen strokes of the source material.\n\nThis is all, of course, relating to Latin typefaces. when you get into non-Latin scripts, ligatures are often an integral part of the writing system.\n\n—Noam\n\n"
    },
    {
      "time": "24 Mar 2009 — 5:30pm",
      "content": "Noam, well said.\n\nIt's hard for me to imagine that the antique-looking \"tied\" ligatures like 'ct' ever looked normal to readers, but I assume they did, since they were so widely used once.\n\nLigatures that solve optical problems certainly are not (should not be) going out of style, and I do think that OpenType layout has enabled type designers to think beyond the standard f-ligatures and consider other optical problems which can be solved with ligatures. The notorious 'Th' ligature in Adobe Originals is one such example. Not everyone likes these new ligatures, but ultimately it's up to the designer to decide how their typeface will serve the reader.\n\nIt's true that the standard f-ligatures get shoehorned into a font because of their presence in standard encodings. We (Adobe) eventually realized that some OpenType fonts in our library (particularly monospaced fonts) should have these ligatures off by default, because some look truly bad when they appear.\n\n"
    }
  ]
}
