{
  "id": "56178",
  "title": "Bad Font Detected",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I have a very basic typeface built in FontLab Studio that I've been having trouble with. (Based on a simple grid, composed of simple four node dots)\n\nI've exported and tested plenty of OpenType fonts with much success, yet this particular font/file seems corrupted.\n\nI've tried everything, from cutting and pasting into a new .vfb file.\n\nGoing over all the OpenType features, classes, kerning, metrics, font audit, ligatures, etc…\n\nI've deleted all the kerning info, class info, and OpenType features just to see if the problem would be on that end of things and generated it still without success.\n\nI've gone through the font naming, dimensions, encoding and unicode, and etc…\n\nThe Output panel reports NO errors.\n\nI've even sent it through the Fontlab tech support only to have the suggestions not render it a success.\n\nIt is a 2000 UPM font, but I've generated plenty that have worked exceptionally, I even changed it to 1000 just to try it at that UPM with no success.\n\nTHE ONLY THING THAT HAS WORKED which has allowed me to generate a working .otf font file is to delete about a third of the glyphs in my .vfb file which incidentally deletes the alternate characters and extended ligatures as well as numerous other standard characters.\n\nAt this point I'm completely baffled.\n\nThere's nothing in FontLab Studio that I can see or do that indicates a problem so I'm at a point that logically I don't know what else to do our how to continue troubleshooting.\n\nThe message reported when importing into FontExplorer X and Fontbook is as follows.\n\n\"A problem has been detected with the font Output S Regular, in the font file /Documents/Reserves/09-Output/Output S-Regular.otf. The system will attempt to disable this font, but to avoid future problems, you should quit all of your open applications and remove this font file or replace it with a new version.\"\n\nI would love to have someone like Adam T. take a look at the files even if it's just to get closer to what this problem could be as not having an answer is really bothering me.\n\nI'm almost at the point of just abandoning this particular font altogether and moving along but I'm really curious what this could be… trouble shooting is usually a simple, and pretty painless process but this has been out of control.\n\nAnyone have any suggestions?\n\nThanks,\n\nMike\n\n",
  "author": "Michael Jarboe",
  "time": "23 Mar 2009 — 4:33pm",
  "uid": "17099",
  "comments": [
    {
      "time": "23 Mar 2009 — 4:51pm",
      "content": "How many glyphs does it have normally, and what version of OS X are you running?\n\n"
    },
    {
      "time": "23 Mar 2009 — 4:56pm",
      "content": "FontForge can find a lot of problems in fonts, that FontLab wil not show.  \nAnd have you tried making a TrueType (Open)\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:05pm",
      "content": "301 glyph cells in the actual .vfb file but only 291 active and OS X 10.4.11\n\n(This isn't the first time I've deleted glyphs troubleshooting and had it work but if I recall I had to delete at least two rows which I could guesstimate would be about 60 glyphs, I'd really have to do one row at a time and then single it down to each glyph to find where it starts working)\n\nOff the top of my head I imagine some past fonts have had up to that number of glyphs, which isn't many, comparatively speaking…\n\nThanks,\n\nMike\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:10pm",
      "content": "That's really strange… I just generated a TrueType (Open) version (of the seemingly corrupted version, actually 290 glyphs) with all and it installed fine, activated and all… problem is, I've strictly been creating PS OT fonts and have been kind of set on one format, whatever it is I've learned about each, I recall PS is favored over TT?\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:10pm",
      "content": "How many glyphs does it have normally, and what version of OS X are you running?\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:20pm",
      "content": "I've been saying it since OS 7 and Windows 3.1 ... TrueType rules!!  \nIt's 1:15 here, and the wine is also not helping me.  \nMy guess is you have set \"use subroutines to compress outlines in CFF table\". Please uncheck that one, and all problems will vanish... if not, get some wine.\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:25pm",
      "content": "Thomas,\n\n290\n\nand\n\nOS X 10.4.11\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:27pm",
      "content": "But then again testing the font shows that many of the glyphs are missing… somethings still wrong…\n\nbut none of my preferences are set for TT, I just did a quick 'generate' as it was just to see… and I don't necessarily want to go in the TT direction…\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:30pm",
      "content": "I just have 'Use default export options' from PostScript export options\n\nand 'Use subroutines to compress…' is not checked\n\nThe thing is, I'm using the same settings (almost positive) as I've used with plenty of other OpenType PS fonts that have been fine, this is actually the first time I've had what I would consider a real problem, like font not installing, errors, etc…\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:31pm",
      "content": "And I'm definitely having something to drink tonight Micha, I know that will help a bit…&nbsp;haha : )\n\n"
    },
    {
      "time": "23 Mar 2009 — 5:37pm",
      "content": "Have you unchecked the \"use subroutines....\" at options; Generating OpenType and TrueType; OpenType PS ???? and than generated an OTF (PS)  \nAnd have \"decompose all composites\" checked/marked\n\n"
    },
    {
      "time": "23 Mar 2009 — 8:03pm",
      "content": "Micha…&nbsp;yeah did that, read the 2nd from above your most recent post…\n\n"
    },
    {
      "time": "23 Mar 2009 — 9:45pm",
      "content": "Something similar happened to me on one of my 'test' obliques. I ignored Font Audit warnings on extremum points just to be able to test the font, and half the characters were not shown in the font and a similar error message generated. A situation like this:\n\n ![](http://web.archive.org/web/20131020152726im_/http:/typophile.com/files/Picture1_4916.png)\n\n"
    },
    {
      "time": "23 Mar 2009 — 10:20pm",
      "content": "Paragraph…&nbsp;that's interesting.\n\nAt one point I deleted almost half the glyphs then went through each one by one and noticed that within 'registered' and 'copyright', two components had overlapped, and when decomposed and 'merged' the outlines became garbled and I had overlooked it… I assumed that was the problem, and now I have only one character that Font Audit is flagging and that is the apple symbol which is my 'R' logo, which is in every other font I've designed…\n\nSo even still I might try just deleting that one character… I keep thinking that since it's at 2000 UPM could it cause an error if, with accented characters the ascender height becomes too high?\n\nOr can an error occur if a character is too wide such as an FFL ligature?\n\nI have to get to the bottom of this and move on…\n\nFor such a simple, grid based type, built out of 4 node circles this sure is strange.\n\n"
    },
    {
      "time": "23 Mar 2009 — 10:39pm",
      "content": "If it's OpenType CFF, all coordinates in the font need to be no more than +/-4096, regardless of the em size.\n\n"
    },
    {
      "time": "25 Mar 2009 — 7:19pm",
      "content": "There is a shared problem of Apple, Adobe FDK for OpenType and FontLab when it comes to subroutine compression of highly modularized fonts. Disable the subroutine compression in OpenType PS generation preferences in FontLab Studio and you should be good to go.\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "25 Mar 2009 — 9:03pm",
      "content": "Adam… thanks I'll try that out in a minute… is this something that would be best left unchecked moving forward for all fonts, or just uncheck it in this case?\n\nI just want to make sure to note it moving forward if it's best left unchecked in general…\n\nThanks,\n\nMike\n\n"
    },
    {
      "time": "25 Mar 2009 — 10:28pm",
      "content": "Mike,\n\nif you leave it unchecked at all times, all your fonts will be slightly larger, and they will generate faster, but there will be no other impact on the functionality. In general, it is allright to leave the compression enabled. But in case of highly modularized fonts which are made of repetitive elements, you'll need to turn the compression off -- because of the bug.\n\nThe next version, FontLab Studio 6 (no release date yet) will use the new Adobe FDK for OpenType 2.5 which no longer has this problem so people will be able to leave compression enabled at all times.\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "29 Mar 2009 — 1:34pm",
      "content": "Cool thanks so much everyone that was the problem… subroutines…\n\nMicha you mentioned that earlier but a brief glance in my settings and it looked as if it was unchecked although 'use default settings' was checked…&nbsp;it wasn't until Adam mentioned it again that I finally realized this is something I have to have unchecked in preferences 'Generating OpenType PS (.otf)' and in 'PostScript export options'…\n\nMike\n\n"
    },
    {
      "time": "5 May 2010 — 2:13pm",
      "content": "I've just had this same problem and like Mike when I last tested it, it was fine.\n\nCan anyone shed any light as to why this suddenly happened, as I haven't altered the preferences in last few weeks?\n\nAndy\n\n"
    }
  ]
}
