{
  "id": "56176",
  "title": "Register OT feature",
  "forum": "Build",
  "tags": [

  ],
  "content": "What does it mean to register an OpenType feature such as SS01? From the manual it seems to mean defining the language range, how do you do this and what happens if you don't 'register' it and your only working in a limited range of supported languages?\n\n",
  "author": "<a href=\"/web/20100203162433/http://typophile.com/user/17099\" title=\"View user profile.\">Mike Jarboe</a>",
  "time": "<br>",
  "uid": "17099",
  "comments": [
    {
      "time": "",
      "content": "What manual?\n\nGenerally, the term ‘registered’ is used to refer to OTL features that are formally part of the feature annex to the OT spec, as distinct from private or custom features. But it sounds like you are using the term in some other sense.\n\n"
    },
    {
      "time": "",
      "content": "John,\n\nI was told that my SS01 feature was valid, but not registered, so I looked into that… the manual covers that topic, where it talks about the language system… I don't quite understand it all… trying to get to the bottom of it all.\n\n"
    },
    {
      "time": "",
      "content": "What is \"the manual\"? The user manual for FontLab Studio 5? Something else?\n\nEach lookup (~=\"feature\") needs to be associated with a particular language or set of languages. That could be 'dflt' (default), but it has to be something. Otherwise it will be in the font, but will never be used....\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Yes, the FontLab Studio 5 manual…\n\nI believe all features are set to default… when I compile and check in Open Type Features in the preview pane and select each feature the script is set to latn and language is set to DFLT… I've never had a problem with features working so… maybe it was just a misunderstanding I was thinking I was missing something else regarding this issue…\n\n"
    },
    {
      "time": "",
      "content": "_I was told that my SS01 feature was valid, but not registered..._\n\nAre you describing a Font Validator report message? Font Validator has not been updated recently, so OTL features that were registered in the spec annex after Font Validator was made will get this message. My guess is that other test tools will behave the same way when encountering layout feature tags that they do not recognise.\n\n"
    },
    {
      "time": "",
      "content": "John… yes, I guess that is what happend… thanks\n\n"
    }
  ]
}
