{
  "id": "56197",
  "title": "OurType presents Ludwig - a new typeface by Fred Smeijers",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Bald Condensed](http://web.archive.org/web/20100204112829/http:/typophile.com/user/110 \"View user profile.\") : 24.Mar.2009 5.52am \n\n**For Immediate Release**  \nDe Pinte, Belgium - March 24, 2009\n\n**OurType presents Ludwig — a new typeface by Fred Smeijers**\n\n**Ludwig – a contemporary grotesque for text**  \nOurType Ludwig is the latest typeface designed by [Fred Smeijers](http://web.archive.org/web/20100204112829/http:/typophile.com/wiki/Fred%2520Smeijers). Based on first German ‘grotesque’ sanserifs made in sizes suitable for texts, Ludwig embodies Smeijers’s personal vision of how an early 19th-century sanserif design might look and perform today.\n\n“Ludwig charms simply by being there, without looking too smooth and beautiful,” says Smeijers. “Capturing that charm -- a certain clumsiness typical of early sanserifs -- was not an easy task, yet Ludwig gets it right.”\n\nLudwig is designed as a companion to OurType Arnhem. Their contrasts are complementary while their proportions are the same. Ludwig and Arnhem also share most weights, which makes the two designs at once well suited and effective counterparts.\n\nGreat for packaging, striking in headlines, catchy in posters and, above all, remarkably pleasant in text, Ludwig surprises -- and delivers -- with its all-round qualities.\n\nLudwig comes in a family of forty-eight fonts, with eight weights and three widths of roman and italic designs, and is available in OpenType STD and PRO, covering Basic Latin and Latin Extended character sets. Display styles are underway and scheduled for release later this year.\n\n**About Fred Smeijers**  \nFred Smeijers is a type designer, writer and educator. He specializes in typographic research and development for product manufacturers. Among his retail typeface designs are FF Quadraat and FF Quadraat Sans, TEFF Renard, DTL Nobel and OurType Arnhem, OT Fresco and OT Sansa. Smeijers has also designed corporate type families for Philips, OCÉ, Canon-Europe, Heijmans and TomTom.\n\nBorn in the Netherlands, Smeijers studied graphic design at the Academy of Art in Arnhem. His career began in the mid-1980s with Océ, at that time just entering the field of typography with laser printers. Work there set the pattern for Smeijers’s long engagement with type design at its most functional -- as part of product design. In 1990, Smeijers co-founded the design group Quadraat in Arnhem, the name also given to his first typeface, FF Quadraat, published in 1992. His work of the 1990s included the expansion of the Quadraat family, type and lettering projects for Philips, collaboration on Martin Majoor’s Telefont type design, typefaces such as TEFF Renard and Romanée, and his first book Counterpunch (Hyphen Press).\n\nOn receiving the Gerrit Noordzij Prize in 2000, Smeijers’s achievements in typeface design practice, research and education were formally recognized. The prize included a retrospective exhibition of his work, opening first in The Hague in 2003 and in London the following year. The exhibition also marked the publication of his second book, _Type now_ (Hyphen Press).\n\nFred is the co-founder and creative director of [OurType](http://web.archive.org/web/20100204112829/http:/www.ourtype.be/).\n\n**About OurType**  \nFounded in 2002, OurType is an independent type foundry led by Fred Smeijers, Corina Cotorobai and Rudy Geeraerts. Its signature collection consists of premium typeface designs that respect traditional values and yet are tailored to contemporary needs. In addition to its reknown designers, Smeijers and Verheul, OurType also publishes fonts from some of the best young talents: Nikola Djurek, André Leonardt, Merel Matzinger, Artur Schmal, Thomas Thiemich, Hendrik Weber, and Maurice Göldner.\n\nThe OurType collection is available at [http://www.ourtype.com](http://web.archive.org/web/20100204112829/http:/www.ourtype.com/ \"http://www.ourtype.com\").\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100204112829/http:/typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": ": 24.Mar.2009 5.52am",
  "uid": "110",
  "comments": [

  ]
}
