{
  "id": "56191",
  "title": "Serif outline font from 1959 issue of Communication Arts",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I found this wonderful font in my current Communications Arts magazine (the 50th anniversary one) and am dying to use it for a book I'm designing. I can't find it anywhere, so I implore the wise minds of Typophile. Thank you for you help!\n\n| Attachment | Size |\n| --- | --- |\n| [justtype.jpg](http://web.archive.org/web/20130713103800/http:/typophile.com/files/justtype.jpg) | 104.88 KB |\n\n",
  "author": "Plaidjaney",
  "time": "23 Mar 2009 — 10:39pm",
  "uid": "41797",
  "comments": [
    {
      "time": "23 Mar 2009 — 11:32pm",
      "content": "It could be a typeface called ‘Sacramento’.\n\n"
    },
    {
      "time": "24 Mar 2009 — 12:03am",
      "content": "It is right?-darn it. Someone on whatthefont told me it was from a Solotype catalogue. This is not available for computer's right? It hasn't been digitized? Do you or anyone know of something really close to it with the hollow middle and drop shadow? I would really appreciate it.\n\n"
    },
    {
      "time": "24 Mar 2009 — 12:19am",
      "content": "_Someone on whatthefont_\n\nIt’s me. :)\n\nMaybe other experts might know of the typeface.\n\n"
    },
    {
      "time": "24 Mar 2009 — 12:32am",
      "content": "How funny! You're everywhere. Thanks for answering both of my pleas. I did some research and some Solotype fonts are sold on My Fonts, but not Sacramento.\n\nYes, please, if anyone has any suggestions on how I can locate or at the least, best imitate Sacramento, I would greatly appreciate it.\n\nThanks.\n\n"
    },
    {
      "time": "24 Mar 2009 — 4:27am",
      "content": "Looks like it is actually another Solotype example called Grand B from Dover Book Condensed Alphabets: 100 Complete Fonts\n\n ![](http://web.archive.org/web/20130713103800im_/http:/typophile.com/files/GrandB_5364.png)\n\n"
    },
    {
      "time": "24 Mar 2009 — 9:12am",
      "content": "Hi Bojev. Did you scan this in or is it available online somewhere? I've been searching for a while now and even contacted Dover, but no answer.\n\n"
    },
    {
      "time": "24 Mar 2009 — 10:24am",
      "content": "Scan from the Dover Book - would you like high res copy - e-mail address - to evansb - at PMC.edu - Leave out hypen after name\n\n"
    },
    {
      "time": "24 Mar 2009 — 11:40am",
      "content": "Thanks bojev.\n\nAny other suggestions of look-alike font would be greatly appreciated.\n\n"
    },
    {
      "time": "24 Mar 2009 — 11:52am",
      "content": "That scan from the Dover book is available digitally, I believe. It's called Grand Canyon and you can find it at MyFonts. Though to me, it only bears a passing similarity to the early CA example.\n\n"
    },
    {
      "time": "24 Mar 2009 — 2:59pm",
      "content": "If the drop shadow effect isn't a priority, Antique Condensed from Font Bureau is a decent match:\n\n[http://fontbureau.com/fonts/AntiqueCondensed](http://web.archive.org/web/20130713103800/http:/fontbureau.com/fonts/AntiqueCondensed \"http://fontbureau.com/fonts/AntiqueCondensed\")\n\n"
    },
    {
      "time": "24 Mar 2009 — 6:18pm",
      "content": "Thanks so much-Grand Canyon is very close and I'm going to mark this solved. Marcox, thanks, but the drop shadow was important.\n\n"
    }
  ]
}
