{
  "id": "56231",
  "title": "New Lions Logo Leaked",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.freep.com/article/20090324/SPORTS01/90324049/New+Lions+logo+a...](http://web.archive.org/web/20131019174646/http:/www.freep.com/article/20090324/SPORTS01/90324049/New+Lions+logo+apparently+leaked \"http://www.freep.com/article/20090324/SPORTS01/90324049/New+Lions+logo+apparently+leaked\")\n\nAn improvement, but how will it play on _mane_ street, and will it help them win?\n\nMaybe they traded that old circus font to the Cowboys along with Kitna.\n\n",
  "author": "Si_Daniels",
  "time": "24 Mar 2009 — 6:02pm",
  "uid": "1049",
  "comments": [
    {
      "time": "25 Mar 2009 — 7:28am",
      "content": "So rather than improve the players they are playing with the logo. That should move them up in the standings ... maybe as high as second worst team in the league.\n\n"
    },
    {
      "time": "25 Mar 2009 — 7:48am",
      "content": "Boring! Why do teams/companies have to make their stuff so amazingly boring? This may seem like a fanboy speaking, but the best \"update\" to a team's logo/mascot was done by the Seattle Seahawks. They are one of the few teams to go from boring --\\> cool. But a lot of team's old logos and uniforms were way cooler back in the day.\n\nThe days when teams wear their throwback uniforms are the best. The Cowboys' and Lion's throwbacks are especially improvements over their drab current uniforms.\n\nAnd Don is right: Spend some money fixing your team and someone might actually care if your logo has changed.\n\n"
    },
    {
      "time": "25 Mar 2009 — 8:09am",
      "content": "This is definitely better than the one that was floating around the internet a few months ago. [http://cdn3.sbnation.com/imported\\_assets/104800/3251978803\\_cc80d945ac\\_o.jpg](http://web.archive.org/web/20131019174646/http:/cdn3.sbnation.com/imported_assets/104800/3251978803_cc80d945ac_o.jpg \"http://cdn3.sbnation.com/imported\\_assets/104800/3251978803\\_cc80d945ac\\_o.jpg\")\n\nI'm glad they just added details to the classic silhouette. The type looks furry, which is cute, I'm not sure it's succeeds in being \"aggressive\" but at least it doesn't look like it's from the back part of Cedar Point anymore. In general the aesthetics of football has been a race to the bottom. The best thing we can hope for here is that the Lions use this logo update as an excuse to ditch the horrible black they added to the uniforms and go back to the awesome bright blue and silver everyone identifies them with.\n\n"
    },
    {
      "time": "25 Mar 2009 — 8:18am",
      "content": "You didn't hear? The Lions are ditching everything that had anything to do with Matt Mullen, and that includes the black unis. They will instead use their classic blue and silver throwbacks as their third uniform.\n\nAnd the woodtype of their name will be missed. Not too many people or companies had kept such a thing for so long.\n\n"
    },
    {
      "time": "25 Mar 2009 — 10:29am",
      "content": "No matter how much soap and deodorant they use, it's impossible to wash off the stink of 0-16.\n\n"
    },
    {
      "time": "25 Mar 2009 — 2:25pm",
      "content": "It kinda looks like some generic arena-league design.. kinda ironic cause they belong in that league (not that I can talk, being a Bengals fan)\n\n- Scott\n\n"
    }
  ]
}
