{
  "id": "56232",
  "title": "If Fred Smeijers was a typeface...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Would he be Ludwig? Or is it an early 1st of April joke? Discuss.\n\n",
  "author": "clauses",
  "time": "24 Mar 2009 — 6:05pm",
  "uid": "16321",
  "comments": [
    {
      "time": "24 Mar 2009 — 6:07pm",
      "content": "You may want to look at Ludwig before you weigh in.\n\n[http://www.ourtype.be/](http://web.archive.org/web/20131023193416/http:/www.ourtype.be/ \"http://www.ourtype.be/\")\n\n"
    },
    {
      "time": "24 Mar 2009 — 6:14pm",
      "content": "Or if you want a quick taste\n\n ![](http://web.archive.org/web/20131023193416im_/http:/typophile.com/files/clue2_3711.jpg)\n\n"
    },
    {
      "time": "24 Mar 2009 — 10:33pm",
      "content": "It's hard to know what to make of Ludwig. I have too much respect for Fred to dismiss it without seeing it in print, but the web showing isn't inspiring. Is that really how it is spaced?\n\n[The _Vancouver Sun_ newspaper has just rolled out a redesign, and they're using an incredibly loosly spaced sans for subheads. Maybe 2009 will be the year of the sans-you-can-drive-a-truck-through.]\n\n"
    },
    {
      "time": "24 Mar 2009 — 10:45pm",
      "content": "<cite>Is that really how it is spaced?</cite>\n\nNo. Here’s a link to a PDF: [http://www.ourtype.be/pdf/OT-Ludwig-Pro.pdf](http://web.archive.org/web/20131023193416/http:/www.ourtype.be/pdf/OT-Ludwig-Pro.pdf \"http://www.ourtype.be/pdf/OT-Ludwig-Pro.pdf\")\n\n"
    },
    {
      "time": "25 Mar 2009 — 1:26am",
      "content": "...and the PDF shows: Yes, that is how it’s spaced. :)\n\n"
    },
    {
      "time": "25 Mar 2009 — 4:15am",
      "content": "Goran,  \nperhaps it's worth having a second look. Flash does not use the original spacing, not for Ludwig, nor any other typeface on that site.\n\nSo, what qualifies it as an early 1st of April joke? The fact that this design that is less generic? or its obvious 'historical' perfume? If I look at all designs Fred ever did [part of them in [Type Now](http://web.archive.org/web/20131023193416/http:/www.hyphenpress.co.uk/books/978-0-907259-24-4), there is a great variety in styles and challenges. Like it or not, he never did much of the same over and over again, on the contrary - he defied the fear for uncharted waters. So, in this line of thought, I wouldn't dismiss Ludwig just for the simple fact that I [or you] did not expect something in that direction [= a design that is out of someone's comfort zone]...\n\n[Hyphen Press Music](http://web.archive.org/web/20131023193416/http:/www.hyphenpress.co.uk/music/morton_feldman_jazz_tributes) adopted Ludwig [together with Arnhem] for their identity; I bet EMI or SONY records would never do that. A recent Elmgreen & Dragset catalogue [by Hatje Cantz](http://web.archive.org/web/20131023193416/http:/www.hatjecantz.de/controller.php?cmd=detail&titzif=00002050) features Ludwig quite nicely, too. So maybe it's not for everyone, and everything... But then, besides Helvetica, what is?\n\n"
    },
    {
      "time": "25 Mar 2009 — 9:53am",
      "content": "Oh, I looked in the PDF, and the type is \"loosely\" spaced there also.\n\nBut honestly if I offended anyone I'm sorry, my intention was not make any harm with my quick statement, just a reflection. Probably stupid of me.\n\n"
    },
    {
      "time": "25 Mar 2009 — 8:23pm",
      "content": "It seems almost like the stems were spaced as if they were seriffed. Given the stated objective of the design, this might not be far off. In his Quadraat, for example, the vertical stems are spaced with a distance nearly equal to the counter widths. A similar approach seems to have been taken with Ludwig, even though it is a sans.\n\n"
    },
    {
      "time": "26 Mar 2009 — 3:17am",
      "content": "By the way, Robin Kinross had posted his view on this on [Hyphen Press website](http://web.archive.org/web/20131023193416/http:/www.hyphenpress.co.uk/journal/2009/03/25/ludwig)\n\n"
    },
    {
      "time": "26 Mar 2009 — 3:17am",
      "content": "sorry for the typo -- Robin Kinross\n\n"
    },
    {
      "time": "26 Mar 2009 — 4:20am",
      "content": "After printing the sample I can say I like. I don’t know exactly why but it seems better at small size.\n\n"
    }
  ]
}
