{
  "id": "56258",
  "title": "what typeface would they be?",
  "forum": "nab's blog",
  "tags": [

  ],
  "content": "this is inspired by the thread \"what typeface would michelle obama be?\"...i started thinking about what typefaces other historical figures might be? post away if you have any thoughts!\n\nhere's one i was playing with...\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/amelia_5135.jpg)\n\ni've always been a little fascinated by amelia earhart and chose SUBURBAN (emigre font) for her....there is a masculine/feminine feel to this font, that seems appropriate for earhart... i also like the loops where the strokes cross over each other that are reminiscent of loops an airplane might make (acrobatic airplane!)\n\nthere is also a vintage/retro/art deco feel to this font that seems appropriate (earhart's time period was the 20's-30's), the solidness of the strokes relate to earhart's courage and the loops of the \"l\" and \"E\" lend themselves to an unconventional \"prettiness\"...\n\nthe color? well, the first plane she was able to buy on her own was named \"canary\" (it was bright yellow...\n\n",
  "author": "<a href=\"/web/20100209040703/http://typophile.com/user/41318\" title=\"View user profile.\">nab</a>",
  "time": "<br>",
  "uid": "41318",
  "comments": [
    {
      "time": "",
      "content": "Aww, I was such an Amelia Earhart fangirl pre-high school. I think I did about three projects/presentations about her by the time I got to sixth grade, even...\n\nAnyway, my typographic tribute:\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/Untitled-1_5174.jpg)\n\nEccentric Std... nothing too exotic, but there's an undeniable resemblance. Something about the straight but playful lines, I suppose. Plus, there's something entertaining and adorable about the little serifs that make me think of his mustache.\n\nFor someone so potentially terrifying and evil, he does remind me an awful lot of a puppy.\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/Chaplin_6062.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I think I related Suburb to the 90s too much to see the Amelia Earhart connection. But I understand about liking it.\n\nEccentric really does suit Charlie Chaplin. Right down to how the exaggerated x-height mimics his pants being belted up far too high.\n\n"
    },
    {
      "time": "",
      "content": "i can definitely see the 90's connection...it's hard to look at type and not get stuck in an era isn't it? esp. depending on how it's been used in the past...i was trying to go in and see type \"blindly\" that's a challenge!\n\nthe charlie chaplin font does seem really appropriate! esp. when juxtaposed to the image you have inserted! great comparison with the pulled up pants and high x-heights/crossbars!\n\n"
    },
    {
      "time": "",
      "content": "I chose Marilyn Monroe as my historical figure. I knew right away, I'd need something pretty, but powerful. After doing a little research, I knew I wanted a mix between her signature and these two logos from the 50's I found:\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/Signature_4269.png)\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/HolleyLogo_5013.png)\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/Frigidaire_3792.png)\n  \nAfter searching high and low for a typeface, I narrowed it down to these two: \n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/BickleyScrpitPlain_3800.png)\n Bickley Script Plain and \n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/OPTICarmellaHandScript_5783.png)\n OPTICarmella Hand Script. I think I'm going to have to go with the latter though. It has a strong \"M\" and the stroke is thick enough so it won't fade into the background, giving it strength. The typeface has the 50's feel I was looking for and is in red like Monroe's famous shade of lipstick. Marilyn Monroe and OPTICarmella Hand Script are strong and seductive while remaining feminine.\n"
    },
    {
      "time": "",
      "content": "So I chose Lucille Ball as my figure. I looked online for her signature, which reminded me of the \"I Love Lucy\" logo as well.  \n [Lucille Ball's Signature](http://web.archive.org/web/20100209040703/http:/www.geocities.com/Hollywood/Set/5411/LBALLSIG.JPG)\n\nAfter searching online, I found a font called Donna Bodoni B. I chose an orange-red color like Lucille's hair color, which is something that is easily recognizable.\n\n... And for whatever reason, it \"could not copy image.\" AHHHH. I guess I'll see if I can edit this post and try again...\n\n"
    },
    {
      "time": "",
      "content": "For my \"If \\_\\_\\_\\_\\_\\_\\_\\_ were a font, what would it be?\" assignment, I chose Harry Houdini. No, I'm not magic-obsessed (a la Gob Bluth), and I'm not even remotely tricky or have any slight-of-hand ability. I DO, however, enjoy pretty much anything that happened a long time ago. The case of Harry Houdini was always one of those oddly tragic stories to me. He didn't die doing one of his tricks or anything, but instead was punched in the stomach so hard that it caused internal hemorrhaging. I'm not going out like that. Heres the tyeface that I chose to represent him: \"Angelface\"\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/harry_houdini_5883.jpg)\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/AngelFace_5627.png)\n\n"
    },
    {
      "time": "",
      "content": "So, the historical figure I chose for the \"what typeface would they be?\" was the American outlaw, Jesse James. They typeface I chose was, shockingly enough, and non other called \"Outlaw\"... sorry for the un-creativity. But, anywho! I chose a brownish-reddish color to represent not only the sand and dirt of the Wild West, but also the rustiness and antiquity [if you will] of the time. I love history, and I wanted a historical figure, typeface and color that took you back in time...\n\n-gabi\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/type-person-color2_6240.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I chose Mozart as my historical figure. My piano teacher was very much obsessed with the classical artists and therefore we spent many lessons learning their backgrounds and studying their musical compositions. To represent Mozart, I chose ChopinScript. Its flowing and beautiful strokes are reminiscent of hand drawn music notes. Each letter flows into the next as if it is dancing across the page. The typeface is both intricate and delicate, just as Mozart's music is played and heard. I left his name in black to stay true to the black and white of both the piano keys and the music sheets that go hand in hand with one another. While it is not my everyday choice of music, I think its important to study the classics of any genre, and having played the piano for a number of years I came to respect and appreciate the time and effort that each artist puts into their work.\n\nJess\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/mozart_2_6548.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I decided to do no one other than the great Ella Fitzgerald. Typically in the past Ella's name is written in fonts similar to Broadway. However, these bulky fonts are not characteristic to Ella Fitzgerald Jazz legend. When I think of Ella, I think of velvet melting you with her words of love. I think of someone who is very much feminine, yet strong, with a name like Fitzgerald, how could you assume anything different.\n\nI decided to use the font Cornet Mtd Std Bold. As you can see it is the perfect combination of femininity, found in the easy flow of the type and masculine in its nature, exemplified in the sharp, crisp serifs.\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/Ella_Fitzgerald_6238.jpg)\n\n"
    },
    {
      "time": "",
      "content": "For a very long time I have had this obsession with Josephine Baker. For those of you who have no clue who Josephine Baker was, she was an entertainer from the 1920s and 30s, and the first black international superstar. She was a very versatile entertainer and an amazing performer. She was very feminine, elegant, and sensual but she was also a very strong woman with attitude who stood up for her beliefs. She refused to play for segregated audiences and because of that Las Vegas night clubs became integrated. She was very popular in Paris.\n\nA font that I think matches Miss Baker perfectly is Parisian. Like Josephine, I think it and elegant and sensual typeface with it's thin and curvilinear strokes but at the same time strong and bold with it's thick and straight strokes. Now some may wonder why I chose pink for a color? It is very simple, for one of the first dances that Josephine performed in Paris her costume was nothing more than a girdle/ corset covered in pink feathers.\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/josephine_baker_3781.jpg)\n\nSRB\n\n"
    },
    {
      "time": "",
      "content": "Archimedes was a Greek mathematician, physicist, engineer, inventor, and astronomer. He is regarded as one of the leading scientists in classical antiquity.\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/archimedes_3715.jpg)\n\nThis is Mason Alternate. The m has the same shape of a pi symbol, and since Archimedes was a mathematician.. Mason also has this simple, geometric feel. The serifs are very long and the leg of the R is pointed with no serif. It reminds me of a Compass leg.\n\nI chose orange because orange and yellow are the colors he wears in the painting \"The School of Athens.\" I also did a quick google search on Archimedes and found that he was mainly portrayed in yellow and orange clothing..\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/bette_6575.jpg)\n\nI chose Bodega Serif Small Caps to represent one of my favorite movie stars Bette Davis. I knew I wanted a condensed serif typeface, that stood strong and regal. I didn't want a typeface that was too dated, because of the progressive roles that she was awarded. Granted the typeface was designed in the 90's, Bodega Serif has an older feel that would fit in during during her earlier acting years. I left it black and white, because I believe that her only roles were in black in white.\n\n"
    },
    {
      "time": "",
      "content": "I decided to choose Marie Laveau. She is known as the queen/mother of voodoo. While searching for a font that seemed to describe her, I found a slightly cheesey display font that I enjoyed. It's called VoodooHousePins.\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/marie_lavaeu_3489.jpg)\n  \nBut, the font I ended up choosing was: ATHandleOldStyle. It is a display font, that embodies the New Orleanian spirit, and the mysterious side of Marie Laveau herself.  \n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/marie_laveau_01_3692.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I chose the font called Modern No. 20 to represent the architect Frank Lloyd Wright. FLW is arguably one of the best architects in history and much of his aesthetic involved almost dangerously long cantilevers. So, in looking for a font, I wanted one with long/wide serifs that seemed to cantilever off their stems. In Modern No. 20, the first thing I noticed was the capital \"F\". It looked like as if it was any wider it would topple over. And I chose the color brown because of his work was organic: incorporating nature and the environment into his designs.\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/FLW_4965.jpg)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/meryl_streep_blog_6412.jpg)\n\nMeryl Streep is someone that I have admired for a very long time because of her ability to achieve a successful career as well as to raise four children. Through her movies, it is easy to see her class as well as her kind personality. In interviews she is witty and funny, and has a strong opinion about everything (and is not afraid to voice it). Though she recognizes her success, she is not overly outward about it and is very modest.\n\nI picked Minion Pro Regular to represent Meryl. It is simple yet classy. With its elegant serifs and variety of thick and thin lines, I think that it represents the professionalism and accomplishment that is found in Meryl. It's uniquely formed serifs and terminals make it special in the world of font, as Meryl's talent and beauty makes her special in the world of acting. Because she wears mostly blues, grays, and whites to award ceremonies and other public engagements, I chose to use a dark gray-blue as the color of the text.\n\n"
    },
    {
      "time": "",
      "content": "My historical person would be Cicero. Ancient Roman orator, lawyer, and philosopher, Cicero's speeches were composed of some the most beautiful and memorable prose of that time period. His speech was as strong as it was beautiful. I feel that Trajan Pro best exemplifies Cicero. The gentle curves of some of the strokes reinforced by the contrast of thick and thin strokes echoes Cicero's versatility in speech as well as in occupation. The all-caps typeface also adds gravity to the words, something for which Cicero was well known.\n\n...it won't let me insert the image? hmm... here's a link to it...  \n [http://s17.photobucket.com/albums/b82/abeck502/?action=view&current=Pict...](http://web.archive.org/web/20100209040703/http:/s17.photobucket.com/albums/b82/abeck502/?action=view&current=Picture5.jpg \"http://s17.photobucket.com/albums/b82/abeck502/?action=view&current=Picture5.jpg\")\n\n"
    },
    {
      "time": "",
      "content": "My grandmother shared her love for the the King of Rock'N'Roll and his music with my mother and then they both shared it with me. I've been listening to Elvis' music ever since I was a little girl and I still love it. His sound and style was very unique because of his diverse musical influences like country, pop, gospel, and R&B music. Elvis challenged the social and racial barriers of the time, he ushered in a whole new era of American music and popular culture. His talent, good looks, sensuality, charisma, and good humor endeared him to millions. He is regarded as one of the most important figures of twentieth century popular culture. I think Eccentric Std is a good typeface to represent him. Eccentric was designed in 1881 by Gustav F. Schroeder. Eccentric is an all-capital, narrow display face with high horizontal cross-bars and main junctures more than halfway up the letter forms. It has a tall look which reminds me of a microphone stand. Also, Elvis was tall and a singer that performed on a stage with a microphone. Eccentric looks edgy and classic at the same time. :)\n\n ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/Elvis_5118.jpg)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/BlakelyLight_6139.gif)\n  \nThis is the typeface I chose. It is Blakely Light. This font reminds me alot of George Clooney. It has that Batman/Gotham City feel to it. It is sort of a classy font, kind of an old style. It also reminds me of time of Dick Tracy or Roger Rabbit, which fits perfectly with this font or even sort of a 1930s, swing dance, chain wallet, top hat wearing feel. I guess I chose George Clooney because his character fits perfectly with this font.\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/edward_cullen_5687.jpg)\n\nI chose to pair Base 12 with Edward Cullen! Base 12 is a slick little  \nsans-serif; very clean. Edward Cullen is the super-sexy vampire hero of  \nthe Twilight series! He is very suave and well-put together- like Base 12.  \nWhat makes theses two the perfect pair are the font's sharp edges, seen  \nbest on the lowercase 'a'. Just like Edward, Base 12 has fangs too, and an  \nappetite for bright red blood!\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100209040703im_/http:/typophile.com/files/steve_buscemi_4608.jpg)\n\nThis typeface is Della Robbia BT. It reminds me of Steve Buscemi because it's a tall and quirky typeface (the f's look goofy) but has a subtle sophistication. It captures his directing roles by its elegance, but also his goofy roles with Adam Sandler, especially the lowercase f and the slanted lowercase e.\n\n"
    },
    {
      "time": "",
      "content": "just throwing it out there...but Edward Cullen [like all the vampires in Stephanie Meyer's series] doesn't have fangs...\n\n"
    }
  ]
}
