{
  "id": "56252",
  "title": "Who the hell designed Penny Farthing?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello Fellow Typophiles,\n\nI am desperately trying to find the name of the typographer who designed Penny Farthing, a Letraset font which appeared regularly in their catalogs in the seventies.\n\n ![](http://web.archive.org/web/20131019151731im_/http:/typophile.com/files/penny-farthing_4057.jpg)\n\nAnyone?\n\nThanks in advance.  \ndr\n\n",
  "author": "David Rault",
  "time": "25 Mar 2009 — 6:44am",
  "uid": "19074",
  "comments": [
    {
      "time": "25 Mar 2009 — 7:53am",
      "content": "Bob Newman. It was released by Letraset in 1974.\n\n"
    },
    {
      "time": "25 Mar 2009 — 9:02am",
      "content": "Mark, you just made your way to the \"Thank you\" page of my upcoming book. Thank you.\n\nOh and by the way, the typography book I have been working on for the last few years has been released by Perrousseaux (the french publisher of Blanchard and Frutiger books) march 19th in France, Switzerland, Belgium and Canada. Some of you typophiles are inside. I'm working on the english version right now. You can check the book there: [http://www.davidrault.com/guidetypo](http://web.archive.org/web/20131019151731/http:/www.davidrault.com/guidetypo \"http://www.davidrault.com/guidetypo\").\n\ndr\n\n"
    },
    {
      "time": "25 Mar 2009 — 9:24am",
      "content": "David,\n\nI just had a look at the site linked. The book looks nice. Look forward to the English version.\n\nCheers\n\n"
    },
    {
      "time": "25 Mar 2009 — 10:27am",
      "content": "Cool!\n\n"
    },
    {
      "time": "25 Mar 2009 — 11:52am",
      "content": "really cool, I need a new book.\n\nGuerrizmo+Design  \nNo man is an island unto himself\\_John Donne\n\n"
    },
    {
      "time": "25 Mar 2009 — 6:42pm",
      "content": "_...the name of the typographer who designed Penny Farthing..._\n\nDavid, I really hate to be a word snob, but in English, typographers set type. Type designers design typefaces. :-)\n\nAs Stefan says, looking forward to the English version of your book!\n\n"
    },
    {
      "time": "26 Mar 2009 — 1:12am",
      "content": "Ricardo: oops sorry bout that. thanks for the heads up.\n\nand thanks for the comments everyone. as soon as I have an english / american publisher, I let you know.\n\ndr\n\n"
    },
    {
      "time": "26 Mar 2009 — 1:13am",
      "content": "This being said,\n\nI can't find any information about this Bob Newman, who appears to have designed many iconic typefaces from the seventies (including Data 70). Anyone?\n\ndr\n\n"
    },
    {
      "time": "26 Mar 2009 — 4:49am",
      "content": "Hmmm... He is not listed in the most recent edition of _An A-Z of Type Designers_...\n\nMyFonts has some info on Letraset, and its designers, [here](http://web.archive.org/web/20131019151731/http:/new.myfonts.com/foundry/Letraset/).\n\nIdentifont's page on [Freda Sack](http://web.archive.org/web/20131019151731/http:/www.identifont.com/find?Name=sack) mentions Newman.\n\n"
    },
    {
      "time": "26 Mar 2009 — 7:25am",
      "content": "yes got these links too. not much... unbelievable. the guy disappeared.\n\ndr\n\n"
    },
    {
      "time": "26 Mar 2009 — 8:45am",
      "content": "A real shame, since he designed some really iconic 1970s faces -- but you said that already. :-)\n\nThere might be magazine articles about him in design journals... It might be worth checking out a library's online records.\n\n"
    },
    {
      "time": "26 Mar 2009 — 8:55am",
      "content": "You could maybe ask Dave Farey - he was one of the Letra-set back in the day.\n\n"
    },
    {
      "time": "26 Mar 2009 — 10:22am",
      "content": "I found a listing for a book called _Letraset: A Lesson in Growth_, by John Chudley (1974). But, according to Dave Nalle, who discusses it [here](http://web.archive.org/web/20131019151731/https:/listserv.heanet.ie/cgi-bin/wa?A2=ind0402&L=typo-l&P=958), the book is mostly about the business end of things.\n\nP.S.: Adding to Si's comment, Freda Sack or Colin Brignall would also know something about Newman.\n\n"
    },
    {
      "time": "27 Mar 2009 — 1:17am",
      "content": "hey, thanks a lot everyone. I will contact the people aforementioned and hope to actually get in touch with the man himself.\n\n"
    }
  ]
}
