{
  "id": "56254",
  "title": "Baskerville - Thoughts?",
  "forum": "Design",
  "tags": [

  ],
  "content": "So one of the types features in my Type 101 book is Baskerville (the Linotype variety I believe...) and I really don't understand it.\n\nIt certainly has appeal because it's much more readable than some of the older fonts out there, but I still am having trouble determining if its useful for (concise) paragraphs.\n\nIt sits so delicately on paper that I'm also reluctant to use it for something other than a header. Thoughts?\n\nAny general advice on transitional fonts, period?\n\n",
  "author": "<a href=\"/web/20111211230232/http://typophile.com/user/36883\" title=\"View user profile.\">James Deux</a>",
  "time": "<br>",
  "uid": "36883",
  "comments": [
    {
      "time": "",
      "content": "LT Baskerville is not a design that I think holds up well for use as copy—it’s just too light in the 8-11 point range. MT Baskerville (comes with Mac OS) is a little better but still not great. Storm’s John Baskerville and ITC New Baskerville are both much better options for text and the lighter Baskervilles can be used at display sizes. And there’s also the new Mrs. Eaves XL from Zuzana Licko, designed just for text settings, which I’ve only seen onscreen and won’t comment on further.\n\n"
    },
    {
      "time": "",
      "content": "You make a good observation about how delicately Baskerville sits on paper; John Baskerville created it in the 1750s for use on calendared papers, which were new at the time. 18th-Century critics wailed that it would cause blindness in readers accustomed to Caslon.  \nIt's difficult for modern readers to understand how Baskerville could once have been so controversial. Nowadays it falls into the limbo of Transitional types, neither as graceful and warm as the Aldine types that preceded it, nor as elegant and dramatic as the Moderns that followed it.  \nFor decades Baskerville was a workhorse for book and publication composition, though now there are many better choices. It suggests a quiet dignity, that quintessentially British virtue, and it's right for certain jobs. One of my clients used it on their holiday cards last year, and it was the perfect choice.\n\n"
    },
    {
      "time": "",
      "content": "@James Deux  \nYour observation, and James' comments, should help you to understand that types listed in Type 101 books are general, and cannot replace direct observation. Text faces in particular are hard to fully understand until you see a solid chunk of text using a particular cut of a particular font family, Baskerville in this case.\n\nBut you're going to have to qualify the \"it’s much more readable than some of the older fonts out there\" statement, since the typefaces prior to that, IMO, were much easier to read.\n\n"
    },
    {
      "time": "",
      "content": "<cite>. It suggests a quiet dignity, that quintessentially British virtue</cite>\n\nNow THAT is a statement I'm going to have to chew on for awhile! Which font is quintessentially Briton... that's an interesting question and it has me puzzled.\n\n<cite>But you’re going to have to qualify the “it’s much more readable than some of the older fonts out there” statement, since the typefaces prior to that, IMO, were much easier to read.</cite>  \nFor my own purposes I've just done a quick comparison of Time, Adobe Garamond, and Baskerville and it becomes immediately apparent that the contrast in the strokes of BV are much greater than either of the other two fonts. For that reason, there are sizes were you can barely notice the letters are present. At least that's my theory; I haven't copyset a book with it lately!\n\n"
    }
  ]
}
