{
  "id": "56269",
  "title": "Program for client to arrange pagination",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have a client that needs to be able to visualize a pagination and shuffle things around for a multi-page publication. ONLY page numbers and page titles. It has to be extremely easy to use. Can anyone recommend a solution for this? I'd think it could be done in MS Word. But i get greatly frustrated with that program within minutes of opening it.\n\n",
  "author": "dohdoh",
  "time": "25 Mar 2009 — 1:28pm",
  "uid": "16146",
  "comments": [
    {
      "time": "25 Mar 2009 — 3:31pm",
      "content": "If they use a mac you could send them a pdf and they can move the pages around using preview. If not then they could also use Acrobat Pro.\n\n"
    },
    {
      "time": "25 Mar 2009 — 3:32pm",
      "content": "I recommend post-it notes, marker pens and a large table or wall. Go lo-tech!\n\n"
    },
    {
      "time": "25 Mar 2009 — 5:34pm",
      "content": "Ben's low-tech method is by far the easiest method. But if you require asynchronous collaboration I'd say Tiff's approach is a viable solution. However it's success would depend on how familiar your audience is with using Acrobat Pro and knowing how to move pages around within it.\n\n"
    },
    {
      "time": "25 Mar 2009 — 6:31pm",
      "content": "you can reorder .pdf pages inside preview?\n\nhow? is that a feature that was new in 10.5?\n\n-bowerbird\n\n"
    },
    {
      "time": "25 Mar 2009 — 9:54pm",
      "content": "yep, 10.5 nevermind...\n\n-bowerbird\n\n"
    },
    {
      "time": "25 Mar 2009 — 10:53pm",
      "content": "Like it or not, you can also do this very easily in PowerPoint, which allows you a variety of ways of looking at page thumbnails.\n\nFor the magazine layouts at work we have sheets of paper with post-it notes citing article titles. These are in plastic sheet protectors in a binder. The page protectors have numbers on them in marker and we just shuffle the contents around between the protectors until we get an structure we like. You don't really need the sheet protectors (you could write the page numbers on the paper), but it keeps the post it notes safe when moving it around.\n\n"
    }
  ]
}
