{
  "id": "56278",
  "title": "another licensing question",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I asked about modifying typefaces and the legal ramifications of doing so, but what about the different versions Garamond for example where there's ITC, Adobe.. etc. etc. different versions. Can you get special permission to modify and redistribute a typeface? is Garamond so old that copyright laws don't apply?\n\n",
  "author": "scottsullivan",
  "time": "25 Mar 2009 — 5:20pm",
  "uid": "37489",
  "comments": [
    {
      "time": "25 Mar 2009 — 5:27pm",
      "content": "You should read Beatrice Warde (aka Paul Beaujon) on Garamond in Fleuron 5.\n\n"
    },
    {
      "time": "25 Mar 2009 — 5:34pm",
      "content": "@speter where can I find Fleuron 5?\n\n- Scott\n\n"
    },
    {
      "time": "25 Mar 2009 — 6:01pm",
      "content": "I think you're kind of conflating typeface (the design) and font (the actual working specimen of a typeface). There's different takes of Garamond because different designers and entities interpreted a similar \"family\" of typefaces differently. Yes, different Garamond fonts are actually based on different typefaces! If you had access to some of the original printed material, you too could make your own version of Garamond.\n\nBut you can't take Adobe's Garamond Pro and tweak it and sell it as your own (without some special agreement with Adobe) - even though Adobe's Garamond Pro is an interpretation of material that's out of copyright and in the public domain. In other words, if you draw it yourself - fine. If you just use somebody else's font file and just make a few tweaks here and there, try to sell it/pass it off as your own, all without having the appropriate okay's from the copyright holder of that font-file - heap o' big trouble and pretty unbecoming.\n\nTo stir up the mud some more, some EULA's actually allow you to modify the font but only for personal use and never for resale/redistribution. Hope this helps.\n\n"
    },
    {
      "time": "25 Mar 2009 — 6:09pm",
      "content": "definitely helps, thanks bem, so is this only for old typefaces that are in public domain? like... _hypothetically I'm not planning on actually doing this don't freak out on me_ ...if I got my hands on some printed material of 'Gotham bold' and redrew it slightly modified in FontLab.. could I use it then? sell it?\n\n- Scott\n\n"
    },
    {
      "time": "25 Mar 2009 — 6:26pm",
      "content": "In the US where letter-shapes cannot be copyrighted, yes you could legally copy a particular typeface's letter-shapes and use them as your own. Ethically or morally though is a whole different question. This may mean you could \"legally\" copy a particular font's letter-shapes and \"create\" your own font (although some would argue that this is not really creating). Again, there is a moral/ethical side to the question that should be addressed. In the end, it would be best if you drew your shapes from source material that exists in the public domain and keep a good record of your process and work. If there is any question, you can always point to your documented trail and prove that you did the work and the interpretation is yours and thus the font you developed is your own creation. Again, not a lawyer, so don't take my ramblings as legal advice. Rather it's just an opinion of a fellow typophile.\n\n"
    },
    {
      "time": "25 Mar 2009 — 6:35pm",
      "content": "yeah I would never actually do that.. I was just curious about the legalities.. stemming from the multiple versions of Garamond. Thanks!\n\n- Scott\n\n"
    }
  ]
}
