{
  "id": "56273",
  "title": "How does one do a drop-shadow like this?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi-I know how to do a basic one, but how to do these dimensional ones baffle me. Can anyone help? Thank you.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.png](http://web.archive.org/web/20140505020509/http:/typophile.com/files/Picture%201_228.png) | 39.37 KB |\n\n",
  "author": "Plaidjaney",
  "time": "25 Mar 2009 — 2:56pm",
  "uid": "41797",
  "comments": [
    {
      "time": "25 Mar 2009 — 3:06pm",
      "content": "This isn't so much a drop shadow as it is an extrusion with an outline. I'd guess from the look and feel of the reference material, that this is predating contemporary design tools. 1.) You could draw it, so you could have a better understanding of what is going on. 2.) You can do a standard drop, and \"connect your diagonal endpoints\"... 3.) There's a 3D tool within illustrator that will support this kitsch niche... I've been using it quite a lot lately to both devalue and inflate the importance of some personal maxims...\n\n(i.e. see my colourlovers link in my profile.)\n\n"
    },
    {
      "time": "25 Mar 2009 — 3:10pm",
      "content": "The way I would do that is in Illustrator.\n\n1: Type your word/line of text.\n\n2: Create Outlines.\n\n3: Do an \"Offset Path\" under objects. Play around with this until you get the right weight around your text.\n\n4: Take the background shadow element you just created, copy it, and paste it in back, moving it down and to the right, or whichever way you want. This is going to define how far out your shows will go.\n\n5: Go to \"Blend\\>Blend Options,\" choose \"Number of Steps,\" and put in something pretty high, like 100. Select the shadow piece in back of your text, and the one you moved down and to the right, and go to \"Blend\\>Make Blend.\" If it's too stepped, undo it and go back to blend options, setting the value higher.\n\n6: Use the Pathfinder tool to combine the shadow into one simple piece.\n\nThat's at least how I would do it. There are several other ways you could go about it, but that one is the quickest. Sorry if all the functions are not exactly the right name -- I'm not looking at Illustrator right now -- but it should give you a general idea of what to play with.\n\n"
    },
    {
      "time": "25 Mar 2009 — 3:54pm",
      "content": "Hi Janet\n\nThese guys are right of course, but if you want ongoing hardcopy reference this is covered pretty comprehensively on pages 180 - 185 of Leslie Carbarga's [\"Logo, Font and Lettering Bible\"](http://web.archive.org/web/20140505020509/http:/www.amazon.com/Logo-Lettering-Bible-Leslie-Cabarga/dp/1581804369/ref=sr_1_1?ie=UTF8&s=books&qid=1238021489&sr=1-1)\n\n"
    },
    {
      "time": "25 Mar 2009 — 4:06pm",
      "content": "Brock-the funny thing is that it's a type example from LHF Garner. I was hoping it looked like a 1950's sign, so from what you've said, I'm on the right track! Also, thank you for pointing me in the direction of colourlovers-what a great site!\n\nI'm going to try your lesson and that of Feelthekern. Also Ben, I've put your book on my need-to-purchase list.\n\nThank you so much for your help. Since I posted my first question about how to distinguish one sans font from the other, I feel like I'm back in college. With everyone's help here at Typophile, I've learned more about fonts than I knew in my four years working at my publisher. I've learned from every book mentioned, every website suggestion, every bit of advice, and appreciate all of your knowledge.\n\n"
    },
    {
      "time": "25 Mar 2009 — 4:48pm",
      "content": " ![](http://web.archive.org/web/20140505020509im_/http:/typophile.com/files/cheese_4903.png)\n\nCheesy — does it!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20140505020509/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "26 Mar 2009 — 10:30am",
      "content": "I did it. Thank you so much for your lesson, Feel the Kern. It was by far the easiest for someone who is not too skilled in Illustrator.\n\nIvan-thanks for your funny graphic and hello from Petaluma!\n\n"
    },
    {
      "time": "26 Mar 2009 — 5:58pm",
      "content": "Glad that worked out for you! One thing that can make it a lot smoother is once you've flattened the background shadow pieces into one shape, select all the points except for the far left and far right (or highest and lowest, depending on what kind of shadow you created), hit backspace, and then do an Apple+J \"Join\" command. Do this step for both sides with a lot of extra points. This gets rid of any of the stepping from the blending process, but if you used enough steps, it won't be visible. It will create a very large file, though, if you leave the steps.\n\n"
    },
    {
      "time": "26 Mar 2009 — 5:58pm",
      "content": "Glad that worked out for you! One thing that can make it a lot smoother is once you've flattened the background shadow pieces into one shape, select all the points except for the far left and far right (or highest and lowest, depending on what kind of shadow you created), hit backspace, and then do an Apple+J \"Join\" command. Do this step for both sides with a lot of extra points. This gets rid of any of the stepping from the blending process, but if you used enough steps, it won't be visible. It will create a very large file, though, if you leave the steps.\n\n"
    },
    {
      "time": "26 Mar 2009 — 8:16pm",
      "content": "Some tips on an old Typophile thread that explain how to do a \"live\" cast shadow effect using the Appearance panel in Illustrator:\n\n[http://typophile.com/node/4945](http://web.archive.org/web/20140505020509/http:/typophile.com/node/4945 \"http://typophile.com/node/4945\")\n\n"
    },
    {
      "time": "27 Mar 2009 — 9:39am",
      "content": "Thanks Feel and Mark. I haven't tried the Live one yet, but I'm excited to have an editable line of text!\n\nIf you don't mind, since you are very knowledgeable in Illustrator, would you happen to know how to make this effect? The artist has an shadow effect inside the letter. She also has an light shadow outside of the text.\n\n ![](http://web.archive.org/web/20140505020509im_/http:/typophile.com/files/shadowinside_5612.png)\n\n"
    },
    {
      "time": "27 Mar 2009 — 11:08am",
      "content": "I don't think there is a way to do the inner shadow on live text in Illustrator, at least not using the Appearance panel.\n\n"
    },
    {
      "time": "27 Mar 2009 — 11:14am",
      "content": "I agree with Mark, looks more like Photoshop filters.\n\n"
    },
    {
      "time": "27 Mar 2009 — 11:36am",
      "content": "Oh it doesn't need to be live text-I can do it from outlines. I know that the artist only uses illustrator from reading one of her interviews. Does it being outlines change your answer (I hope!)\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:26am",
      "content": "To make an inner shadow, convert the text to outlines, then:\n\n1. Copy the letters (shapes)  \n2. Paste in place (command-F) to make a copy of the letters directly on top  \n3. Offset the copy in the direction and distance you want the shadow to go  \n4. Make the color of the original letters darker (the color you want the shadow to be)  \n5. Select both the copy and the original and apply the Pathfinder \"Minus Front\" operation -- this is your shadow  \n6. Do a paste behind (command-B) to paste the original letters behind the shadow (the original letters should still be on the clipboard)\n\nHere is what it looks like:\n\n ![](http://web.archive.org/web/20140505020509im_/http:/typophile.com/files/innershadow_5964.gif)\n\nLeft to right: the original; the offset copy, with the darkened original beneath; the result of the \"minus front\" pathfinder operation; the original letter pasted behind the shadow.\n\n"
    },
    {
      "time": "29 Mar 2009 — 9:03am",
      "content": "Yay! Again, thank you Mark. I've been searching all over for this answer. The closest I came was this [http://vector.tutsplus.com/tutorials/illustration/making-a-tuts-style-sh...](http://web.archive.org/web/20140505020509/http:/vector.tutsplus.com/tutorials/illustration/making-a-tuts-style-shield-in-illustrator/ \"http://vector.tutsplus.com/tutorials/illustration/making-a-tuts-style-shield-in-illustrator/\")\n\n...not exactly as simple as your tutorial. I'm just about to try it so thanks again. By the way-love your blog and lesson on how to spot Arial. I will never mistake Arial for Helvetica again :o)\n\n"
    }
  ]
}
