{
  "id": "56296",
  "title": "Land Management Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "OK, been concepting this for a little bit and I feel I’m close, but still not quite there. Starting to resemble broccoli to me. Been looking at it for too long and need some feedback. appreciate any I can get. Thanks.\n\n ![](http://web.archive.org/web/20090515024802im_/http:/typophile.com/files/landmanagment_4347.jpg)\n\n",
  "author": "<a href=\"/web/20090515024802/http://typophile.com/user/20588\" title=\"View user profile.\">standardlipsum</a>",
  "time": "<br>",
  "uid": "20588",
  "comments": [
    {
      "time": " 26.Mar.2009 7.31am",
      "content": "What exactly is this? Is it a landscaping service? I think the concept is promising either way.\n\nYou need to give the tree a little more detail. Add branches where the trunk ends and the leaves start and maybe don’t have the tree all blacked out. That forces you to notice the outer shape that resembles broccoli. Have a few ’holes’ in between the leaves here and there. Also, add length to the trunk...that will help too.\n\nHave you tried anything else besides a wrench? I think it works to a degree, but I get more of a ’handyman’ feel from it.\n\nJonE.\n\n"
    },
    {
      "time": " 26.Mar.2009 2.59pm",
      "content": "while the concept is a good start, without more info I feel it’s a bit off the mark.  \nnature and tools = management?\n\nthe execution isn’t very strong either.  \nthe wrench isn’t really working at the moment and yes ... the tree does look like a head of broccoli.\n\nI think you need to re-evaluate the core/primary focus of the business ... land? trees? management? tools?\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090515024802/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20090515024802/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": " 3.Apr.2009 3.04am",
      "content": "Really like the concept. Just find some better tree clip art.\n\n"
    },
    {
      "time": " 3.Apr.2009 11.35am",
      "content": "Also you might want to try making the wrench head in the negative space on the treetop.\n\n"
    },
    {
      "time": " 6.Apr.2009 3.09pm",
      "content": "i really like the concept but i would tweak the way you are representing the spanner, maybe use the silhouette of one with an angular outside.\n\nwill\n\n"
    },
    {
      "time": " 6.Apr.2009 4.35pm",
      "content": "I agree with the others. You need a bit more detail with the tree part (let open spaces ’shine through’ the branches). The wrench part could use a tad more detail too.\n\nThere’s also the size issue. Technically, the root system of a tree roughly equates to the branch system. As such, I think the wrench part could be quite a bit larger to balance out the tree.\n\n"
    },
    {
      "time": " 7.Apr.2009 5.48am",
      "content": "Tree logo ideas here:\n\n[http://logopond.com/search/](http://web.archive.org/web/20090515024802/http:/logopond.com/search/ \"http://logopond.com/search/\")\n\n(enter keyword “tree”)\n\n"
    }
  ]
}
