{
  "id": "56303",
  "title": "(x) Ludlow metal face - Eusebius Open {William B}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "As you might know, I am supporting a german font collection with scans and informations about foundry, first year of production and artist:  \n [http://www.bleisetzer.de/cms/front\\_content.php?idcat=41](http://web.archive.org/web/20130221011502/http:/www.bleisetzer.de/cms/front_content.php?idcat=41 \"http://www.bleisetzer.de/cms/front\\_content.php?idcat=41\")\n\nNow we started production of lead lines with a Ludlow and we got 1,2 tons of matrizes. I have the scanned character sets and I have a text sample of each font we own. But no idea about first year of production and artist.\n\nShall I show all Ludlow fonts we got in a directory of above listet font collection? Would it make sense? Or is it easy enough for someone who's interested, to buy a Ludlow specimen?\n\nGeorg\n\n ![](http://web.archive.org/web/20130221011502im_/http:/typophile.com/files/Eusebius_Open_1_6436.jpg)\n  \n\n ![](http://web.archive.org/web/20130221011502im_/http:/typophile.com/files/Eusebius_Open_2_6490.jpg)\n\n",
  "author": "Bleisetzer",
  "time": "26 Mar 2009 — 9:18am",
  "uid": "14662",
  "comments": [
    {
      "time": "15 Dec 2009 — 5:06pm",
      "content": "There is a nice list of all Ludlow fonts in Mac McGrew's American Typefaces of the 20th Century.\n\nThis one is Eusebius Open, by Robert Hunter Middleton, 1929, based on Eusebius, by Middleton's teacher Ernst Detterer, 1923. Eusebius is Ludlow's version of Jenson. Lovely.\n\n"
    },
    {
      "time": "15 Dec 2009 — 6:30pm",
      "content": "Georg, I'd sure like to see samples of these typefaces. There must be some I would like to add as images for my Serif Guide. Will you plan to make samples to show on your web site? That would be a fantastic resource, because even though McGrew's book may have a list, the images in the book are not printed on high quality paper.\n\nBy the way, we once ID'd Helga (I think that was the typeface name), but I never got an image of it that I could use in the Guide. Perhaps you could e-mail me about that one?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Dec 2009 — 12:06pm",
      "content": "Georg, please do all the »digital born« people of the world a favour and provide samples of those fantastic typefaces. Pretty please und danke im voraus!\n\n"
    },
    {
      "time": "13 Nov 2012 — 6:39pm",
      "content": "I have some 1200 Fonts + on the floor of Ludlow, but a digital copy of the big red Ludlow book can be found here:  \n [http://www.circuitousroot.com/artifice/letters/press/noncompline/ludlow/...](http://web.archive.org/web/20130221011502/http:/www.circuitousroot.com/artifice/letters/press/noncompline/ludlow/typography/specimen-books/index.html \"http://www.circuitousroot.com/artifice/letters/press/noncompline/ludlow/typography/specimen-books/index.html\")\n\n"
    }
  ]
}
