{
  "id": "5630",
  "title": "Time travel",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Ok, nothing fancy here, just a school assignment.. ![:-)](http://web.archive.org/web/20131020010857im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nWe're supposed to come up with a mark (black/white) for a travel agency specialized in time travel. The name is to be a combination of the letters S, T and O and it has to be set in Futura (how's that for originality). No arbitrary design decisions, every single shape needs to be there for a reason.   \n   \nOur instructor told us to keep this quote in mind: \"A logo is a good logo if you can draw it in the sand with your toe\".   \n   \nSo this is what I have now, it's an hourglass with the sand flowing upwards (as in going backwards in time):   \n   \n ![](http://web.archive.org/web/20131020010857im_/http:/www.typophile.com/forums/messages/29/40718.gif)   \n   \nI wanted to keep the whole thing pretty clean and loose, so I went for bold shapes and emphasized the negative space.. I tried to echo the O's shape in the pictogram, and the lower curve is supposed to continue the flow of the S. I'm not sure about the line weight of the two curves.. I did make them thicker at one point but that kind of destroyed the image of the hourglass..   \n   \nAny suggestions?\n\n",
  "author": "franz",
  "time": "14 Jul 2004 — 5:53pm",
  "uid": "2181",
  "comments": [
    {
      "time": "14 Jul 2004 — 6:44pm",
      "content": "Franz,   \nThe pictogram seems totally devorced from the letterforms. Perhaps you can find a way to make your hour glass evolve from negative shapes in the letters?\n\n"
    },
    {
      "time": "14 Jul 2004 — 7:07pm",
      "content": "I would, but I don't think we're allowed to modify the letter shapes.. It's a pretty restrictive assignment. I'd love to marry the pictogram to the type and play around with the letterforms, but I don't think we're meant to. ![:-(](http://web.archive.org/web/20131020010857im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nThen again, I think I did attempt to combine the O and the hourglass in an early sketch, but that got too cluttered..   \n   \nThanks for the input!\n\n"
    },
    {
      "time": "14 Jul 2004 — 7:12pm",
      "content": "I agree with Chris. If you think your assignment will allow it, I would continue to look for some way combine the Futura O and the pictogram. Maybe there is someway of superimposing the O if it can't be altered. The pictogram, btw, is a little complex and might be simplified.\n\n"
    },
    {
      "time": "14 Jul 2004 — 11:31pm",
      "content": "I would like to see you drawin that thin line of falling sand with your toe.   \n   \nThere are lot of other symbols for time, other than the hour-glass. How about letting the O be the face of a watch by putting some hands on it.   \n   \nFirst step is to generate as many symbols for time as you can. Then choose the one that will work.   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "15 Jul 2004 — 7:19am",
      "content": "\"A logo is a good logo if you can draw it in the sand with your toe\".   \n   \nSo it should be blurry with poor contrast?   \n   \nI can't think of one logo that I could draw with my tow...let alone in sand...   \n   \nAs for the assignment, break the rules if it makes for a better mark. A big part of graphic design is knowing when to break the rules and how to break them correctly ;o)\n\n"
    },
    {
      "time": "15 Jul 2004 — 1:12pm",
      "content": "Darrel wrote: \"I can't think of one logo that I could draw with my tow...let alone in sand... \"   \n   \nHmmm, the McDonalds M ... the Nike swoosh ... the British National Rail's double arrow ... for starters.   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "15 Jul 2004 — 3:07pm",
      "content": "[Apparently](http://web.archive.org/web/20131020010857/http:/www.co-berlin.com/englisch/src_lectures/2003/lec6_03.html) this is a quote by Kurt Weidemann, so it _has_ to be right. ![:-)](http://web.archive.org/web/20131020010857im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "16 Jul 2004 — 6:27am",
      "content": "And what is the name of the company to be? OTS stands for what?   \n   \nI did a search on wormholes.   \n   \n [http://www.hypography.com/topics/wormholes.cfm](http://web.archive.org/web/20131020010857/http:/www.hypography.com/topics/wormholes.cfm)   \n   \nMaybe this will open up some ideas.   \n   \nAndrew\n\n"
    }
  ]
}
