{
  "id": "56309",
  "title": "Glyphs in Open Type Fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Greetings all,\n\nI am just wondering what you do when you find out ONE glyph is not available in an open type font like Eurostile LT Std...  \nI need to use 1/3 and apparently its not here... and well making a normal 1/3 as fraction in the open type menu of in design does not fix the problem apparently.  \nSO what I do (and yes I feel stupid) is build it on illustrator and simply stick it where it should be used... (damn design huh?)  \nAnyone has a suggestion? I am seriously annoyed! and would /embrace a kind answer from you!\n\nThanks\n\n",
  "author": "assalychris",
  "time": "26 Mar 2009 — 11:07am",
  "uid": "21448",
  "comments": [
    {
      "time": "26 Mar 2009 — 11:24am",
      "content": "If you're not a type designer without the necessary tools, then Illustrator might be your option.\n\nOtherwise, depending on your adherence to the EULA of the font and the availability of the proper font tools, you could cannibalize the ½ symbol and hack it in.\n\nOr, depending on the circumstances, you can use one from a different font. (Although, it's not going to be easy to match Eurostyle.)\n\n"
    },
    {
      "time": "26 Mar 2009 — 11:28am",
      "content": "You can build it in your layout application, by setting the superior \"one\", followed by \"fraction\" and superior \"three\", with appropriate baseline shift and kerning.\n\nI don't know if that process would produce a match for the other fractions in that particular font.\n\n"
    },
    {
      "time": "26 Mar 2009 — 11:29am",
      "content": "Thank you for your reply Dan, I can in fact do the hack... but ugh -.- too many pages to finish and so little time! and well the font is part of Adobe's font folio 11 so yeah once again ugh... EULA!  \nOf we go with illustrator, Cheers!  \nAny other suggestion is welcome!\n\n"
    },
    {
      "time": "26 Mar 2009 — 11:37am",
      "content": "Oooops, was typing so I just saw ur answer Nick. Again Thank you!  \nThere was a annoying difference with the fraction /  \nhowever the 1 and 3 worked great... :)  \nBOOOooo!  \nOnce again I appreciate your help!\n\n"
    },
    {
      "time": "26 Mar 2009 — 11:44am",
      "content": "Adobe's EULA is actually quite generous, and it's my non-lawyer's opinion that this is the exact kind of modification it allows, as long as you don't re-distribute.\n\n"
    },
    {
      "time": "26 Mar 2009 — 12:48pm",
      "content": "_There was a annoying difference with the fraction /_\n\nThe fraction character (a.k.a. \"virgule\") is different from the slash, and should be the same in the font when both an isolated character, or when part of a composite fraction.\n\n"
    },
    {
      "time": "26 Mar 2009 — 1:54pm",
      "content": "Dan Rodney has an InDesign [script](http://web.archive.org/web/20131019161100/http:/danrodney.com/scripts/properfraction.html) for proper fractions. I haven't tried it so cannot comment on this one, but am pretty happy with his Make Book Jacket script.\n\n"
    },
    {
      "time": "26 Mar 2009 — 2:13pm",
      "content": "<cite> The fraction character (a.k.a. “virgule”) </cite>\n\nShift-option-1 on the Macintosh keyboard.\n\n"
    },
    {
      "time": "26 Mar 2009 — 3:09pm",
      "content": "@Nick Shinn & kentlew  \nthe “virgule” in Eurostile LT Std is unfortunately the same as slash.  \n@k.l.  \nI haven't tested the Pro features however there is in fact a difference between the native otf fractions available and the ones \"styled\" by the script. So I don't know... has anyone tested the Pro version here? Any feedback? Would be informative!\n\nThanks for all the help folks!\n\n"
    },
    {
      "time": "26 Mar 2009 — 3:37pm",
      "content": "I think you better go with the Eurostile Next package, it seems to have self building fractions:\n\n[http://www.linotype.com/270804/eurostilenextproregular-charactermap.html](http://web.archive.org/web/20131019161100/http:/www.linotype.com/270804/eurostilenextproregular-charactermap.html \"http://www.linotype.com/270804/eurostilenextproregular-charactermap.html\")\n\n"
    }
  ]
}
