{
  "id": "56317",
  "title": "InDesign Page numbering question",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I have a document that I'm designing which has normal auto page numbering in the bottom left corner.\n\nI also have a section in the middle of the document that is going to change order as we edit.  \nI would like to find a way to have something like auto page numbering as well so that if I reorder these pages, they get auto-renumbered as well. Almost like having two sets of page numbers.\n\nHeres an example\n\npg. 1 TOC  \npg. 2 Content  \npg. 3 Content  \npg. 4 1.1  \npg. 5 1.2  \npg. 6 1.3  \npg. 7 Index\n\nIn this example, if I swap pages four and 5, the auto page numbering in the left is still correct, but now 1.2 comes before 1.1\n\nI hope this makes sense and would appreciate any help you can give.\n\nThanks,\n\n-Thomas\n\n",
  "author": "TGaskin",
  "time": "26 Mar 2009 — 2:02pm",
  "uid": "7714",
  "comments": [
    {
      "time": "31 Mar 2009 — 2:15pm",
      "content": "No one knows the answer to this? or am I being unclear?\n\n"
    },
    {
      "time": "31 Mar 2009 — 3:43pm",
      "content": "I was a-lurking, hoping someone else would chime in with a brilliant solution and/or a valid reason why it can't work...\n\nTry these ideas for size (OTOH and such disclaimers):\n\nInDesign can't 'flatten' auto pagination to real numbers [\\*]. So if you use real page numbers, you cannot move pages around keeping the same numbers. That's #1. Besides, you mention you already are using those 'real' numbers.\n\nHowever, moderately modern versions of CS (you don't mention a version number--hint) have _auto-numbering lists_. Now you _can_ convert these to text. On the other hand, it's not necessary if you create linked text frames from each page to the next, containing a paragraph with an auto number (so each paragraph appears once on each page), you can move the pages around at will. The original link connections between the pages will still be there, so the original order of the numbering stays the same. That's #2.\n\nFor hard core InDesign questions, feel free to subscribe to [Adobe's InDesign User to User Forums](http://web.archive.org/web/20130210003019/http:/www.adobeforums.com/webx/.3bbf275c/). The very best minds--as well as me--that work daily with ID hang out there, and occasionally an interesting question may attract actual Adobe employees. (Not endorsed by the firm--off the record, so to speak.)\n\n[\\*] If you feel it'd be a valued addition to the package, put it on [Adobe's InDesign Wish List](http://web.archive.org/web/20130210003019/http:/www.adobe.com/cfusion/mmform/index.cfm?name=wishform). Pers'nally, I prefer to stick to the natural order Descartes proposed. :-)\n\n"
    },
    {
      "time": "31 Mar 2009 — 3:45pm",
      "content": "This forum is type design related. Try the 'Design' forum.\n\n"
    },
    {
      "time": "31 Mar 2009 — 3:51pm",
      "content": "I'm sorry to (partially [\\*]) disagree.\n\n\"Build.  \nSoftware, file formats, and other technicalities\".\n\n--whereas the 'Design' forum sounds as if it's dedicated to designing fonts. Don't let the \"Design\" in \"InDesign\" fool you :-)\n\n[\\*] This being a typophile's hangout, one could state it's meant for 'typographic software' only--that's why I suggested the ID dedicated fora.\n\n"
    },
    {
      "time": "31 Mar 2009 — 6:37pm",
      "content": "Maybe I'm missing something here, but I'd just put my auto page numbers in in another set of master pages. When done, or just before printing a version, \"apply master to pages . . .\"\n\nI believe you can also \"delete master from pages\" if you absolutely have to reorder after applying. If so, just delete, reorder, and re-apply.\n\n"
    }
  ]
}
