{
  "id": "56321",
  "title": "!!Important Typophile.com Wikipedia Entry DELETED",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "To the great dismay of many, the Typophile.com listing in Wikipedia was removed.\n\nI put it back.\n\nThe reason it was removed was because the original wasn't good enough, and looked like something created by Punchcut, which it probably was.\n\nSo, for the sake of Typophile.com's integrity, I created a new listing. (Actually, I created two listings. The [Typophile disambiguation page](http://web.archive.org/web/20140803014522/http:/en.wikipedia.org/wiki/Typophile) and the [Typophile (Internet Forum)](http://web.archive.org/web/20140803014522/http:/en.wikipedia.org/wiki/Typophile_(Internet_Forum)) page.\n\nTo prevent any further disruptions, I encourage all to cite all relevant _external_ links and citations to the Typophile page.\n\nIf you are a type designer/foundry with their own website, external links can be used as sources for a new paragraph listing Typophile.com as a resource for type designers and foundries.\n\nIf you are an opentype font/application developer, external links that show Typophile as a resource for that work should be listed as a separate paragraph as well.\n\nWhat would also be helpful is a [full Interwiki integration](http://web.archive.org/web/20140803014522/http:/meta.wikimedia.org/wiki/Talk:Interwiki_map) with the [typowiki](http://web.archive.org/web/20140803014522/http:/typophile.com/wiki/typowiki) hosted here.\n\nI'll post further ideas as they happen to come to me.\n\n",
  "author": "Dan Gayle",
  "time": "26 Mar 2009 — 5:00pm",
  "uid": "12948",
  "comments": [
    {
      "time": "26 Mar 2009 — 5:27pm",
      "content": "As I understand it the Jedi council removed the entry as the Padawan apprentice Jedi were spending too much time here instead of independently researching the essays.\n\n"
    },
    {
      "time": "27 Mar 2009 — 7:36am",
      "content": "Sii, is there any official \"Microsoft love\" that is/can be pointed at Typophile? I could find stuff in the archives referencing off hand Typophile, but nothing directly about it being a resource for Opentype developers, etc. Could you help me find something about that?\n\n"
    },
    {
      "time": "27 Mar 2009 — 7:41am",
      "content": "We can certainly add some love. If you can suggest some good spots, maybe in the font developer resource pages Michelle can add some links.\n\nWe do have plenty of \"news links\" here...\n\n[http://www.microsoft.com/typography/links/](http://web.archive.org/web/20140803014522/http:/www.microsoft.com/typography/links/ \"http://www.microsoft.com/typography/links/\")\n\n...type \"typophile\" in the search box at the bottom of the page for results.\n\n"
    },
    {
      "time": "27 Mar 2009 — 7:58am",
      "content": "That was the specific page that I was expecting some sort of direct link, but it's obviously not there. A static link, I mean. I know that misc links to specific threads float through there regularly.\n\nWikipedia doesn't like links that come from directories, since most directories don't have any sense to them and most often do not point to specific web sites as authoritative on the relevant subject.\n\nMy suggestion is that you have a link referencing Typophile from that main links page, a simple one, but a more authoritative recommendation on the font developer overview page next to the Opentype List reference, or on the Type Developer Links page, that specifically mention Typophile's forums as a good place for questions concerning font development, etc.\n\n"
    },
    {
      "time": "27 Mar 2009 — 8:06am",
      "content": "Okay, I'll ask Michelle to add one - Jedi-council be damned!\n\n"
    },
    {
      "time": "29 Mar 2009 — 11:44am",
      "content": "We're going to add some links on Monday. Decided against posting them live on Friday afternoon, just in case it broke the site for the whole weekend... :-)\n\n"
    }
  ]
}
