{
  "id": "56375",
  "title": "FONTS | laws, copyright, distribution, etc…",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi there,\n\nI am basically interested in finding out more about (links would be great) fonts and its protection.\n\nI recently encountered a couple of situations with clients where they demanded the fonts/typefaces used. They wouldn't understand that we can't just give away $400+ family. Not to mention that costs can go up based on the users or system that will have this family installed.\n\nFor one client we actually stated that the purchase of a single weight would be necessary since we were going after something extremely unique. Client here was billed for the project, and of course the font purchase was part of the whole cost. Now couple of weeks later, they want that font because they said they paid for it. They say that they shouldn't pay for a font that we would end up using for a future clients some time.\n\nThen last week 2 programmers were having a discussion with some designers like myself, on fonts and its protections. They were arguing in favor of:  \n• purchasing a font, deleting it from your computer, and giving it away to the client after completion of the project. They couldn't say much after somebody asked about what would happen if the designer was to do another job for them. What do client need to delete the font again, and send it to the designer?  \n• they were saying that since fonts are software, nobody, not even type foundries can put exclusive rights or laws to the fonts, like limiting users. They said that it doesn't matter that foundries want to add to their legal blurbs, it's software and one SHOULD be able to transfer or give away the font without having to purchase another copy of it.  \n• they basically said all that stuff about foundries charging more if 5 users will use the font rather than 1 or if 50 will instead of 10, is BS. They said nothing foundries want should be taken seriously because in the end they are software and nothing else.\n\nSo, Can fonts be transferable? Can they be given away as long as they are deleted from the computer of the first user?\n\nIf a clients pays for a service, and a font is bought and added to the cost of the project, could the designer/programmer end up giving the entire family away to the client before deleting the family from the computers of the designers/programmers?\n\nWhat are the exact laws surrounding transferring fonts? How do you people charge for fonts if a projects calls for something that news to be purchased? How do you deal with people that want the font? How do you protect yourselves from clients that request the fonts?\n\nDo type foundries have actual legal voice on this regard since the programmers we talked to said that they can come up with every rule/limitations on the usage but it has NO legal valu in the end.  \nDo type foundries ever find out about users that have done something against their copyright info?\n\nThanx everybody for any possible input you might have.\n\n",
  "author": "VectorM",
  "time": "29 Mar 2009 — 6:29pm",
  "uid": "35596",
  "comments": [
    {
      "time": "29 Mar 2009 — 6:43pm",
      "content": "Seems as if everything here should be clearly called out in your contract with the font supplier (ie the font EULA you agreed to) and your legal contract with the client (which you also agreed to).\n\nIf you want to extract yourself from these legal obligations then you probably need to talk to an attorney and not a bunch of font geeks or programmers.\n\nIf your contract with the client calls for fonts along with all other assets to be handed over to them, and the font EULA does not allow for transfers then you're best bet would be to refund the client the cost of the license or simply license it on their behalf.\n\n"
    },
    {
      "time": "29 Mar 2009 — 6:46pm",
      "content": "But what about that argument from the programmers that nothing like the font EULA or anything set by the type foundry has any validity since fonts are software and as that all laws on Software overwrite any EULA or limitations given from the foundry?\n\nHow do you guys deal with this situations? How do you work this out with clients?\n\n"
    },
    {
      "time": "29 Mar 2009 — 6:51pm",
      "content": "\\>But what about that argument from the programmers that nothing like the font EULA or anything set by the type foundry has any validity since fonts are software and as that all laws on Software overwrite any EULA or limitations given from the foundry?\n\nI would not take legal advice from programmers. Even if you are a \"one disk company\" - ie one licensed copy of PhotoShop, one licensed copy of Visual Studio, one copy of Mac OS, installed on multiple machines that's one thing, you can take that risk. But are you in a position to pass on this level or risk to your clients?\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:03pm",
      "content": "Thing here is that one of the programmers has a BA on something I forgot, so he may have a few good points hard to argue. He does know about law and the legality of software. He understands just fine that one can't just make copies of photoshop and give them away. Since he is stuck in the middle of us as a studio and the client he is trying to benefit the client and keep them happy. This is why he is claiming that the fonts should be (THEY HAVE TO BE, coz foundries have no opinion on this matter according to him) able to be given away fully to the client as long as we delete them completely from our systems.\n\nif anybody has some links where I can see in detail font copyright information and a big plus would be if I could see if software laws overwrite ANYTHING set by the foundries.\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:21pm",
      "content": "So the license your company accepted for Photoshop is legally binding but the one you accepted for the fonts is somehow worthless?\n\n\\>Thing here is that one of the programmers has a BA on something I forgot,\n\nThe funniest thing I've heard all day! Thanks ;-)\n\nSad thing is that someone here will likely give you an answer that supports your desire to rip off the font designer, and you'll be happy. Best of luck with that.\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:38pm",
      "content": "What?\n\nDid I say I want to do the wrong thing? Did I \"f\" say I want to rip off the typographer? I don't ever want to do this, this is why i am asking for some good reads, comment and links so i can better articulate my reason to the client.\n\nI am arguing AGAINST giving the font away for free. I (we) support typographers, except the clients and the programmers who are giving us a hard time.\n\nWE DO NOT WANT TO GIVEN IT AWAY FOR FREE!! We already talked to all these people and politely explained the situation and we sent them to the proper links so THEY can purchase the font legally. WHY IS THIS MY FAULT NOW?\n\nIt's not about me! I just wanted some input, links, comments, thoughts on regards to the EULA of fonts and the general software laws so that I CAN MORE CLEARLY EXPLAIN THIS to the clients.\n\nJesus christ.\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:40pm",
      "content": "You have to decide how to deal with the situation where you can either expense a font purchase to a particular project (as \"materials\"), or cover its cost as part of general operating expenses (as a \"tool\").\n\nSorry, there are no easy answers.\n\nSome font EULAS do allow transfer, providing the new licensee accepts the terms of the EULA.\n\n_...if anybody has some links..._\n\nYou can study EULAs of different foundries online.  \nGoogle a foundry name and \"EULA\".  \nOr search a multi-foundry distributor such as MyFonts.\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:44pm",
      "content": "\\>Did I “f” say I want to rip off the typographer\n\nYes Jesus...\n\n\"a **big plus** would be if I could see if software laws overwrite ANYTHING set by the foundries.\"\n\nYou're specifically looking for a loop hole - not links that support the position that EULAs are legally binding.\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:44pm",
      "content": "Think about this…\n\nYou are young, never done anything illegal on regards to fonts and software… then you argue against some clients and a programmer that has a degree in law or some stuff like that and had a career change and turned into a computer geek and claims he actually does know about this. As a young person, it's hard to face this and properly state reasons to NOT give away or distribute fonts.\n\nSee what I am saying now? I just wanna be more armed and prepared so I can wisely discuss this stuff in favour of us (designers, typographers, etc…).\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:49pm",
      "content": "\\>Did I “f” say I want to rip off the typographer\n\n\\>Yes...\n\nNO I DID NOT. I Said the client and the know-it-all programmer want to do that and that I oppose to doing this as it is totally unacceptable for me.\n\n\\>“a big plus would be if I could see if software laws overwrite ANYTHING set by the foundries.”\n\n\\>You’re specifically looking for a loop hole - not links that support the position that EULAs are legally binding.\n\nExactly. These people are trying to find loopholes everywhere to argue in favour of pirating fonts. Not me.\n\nThis is why I came here to find out what some professionals and typographers that frequent this site can say. To see what my fellow posters could suggest since actual type designers post in here.\n\n"
    },
    {
      "time": "29 Mar 2009 — 7:55pm",
      "content": "Your company accepted a EULA, paid a type designer some money to licenses some fonts. Now \"these people\" say the EULA you accepted is worthless and you are free to do anything you like with the fonts. Surely it's up to \"these people\" to come up with links to support this, and for your attorney to decide if, under Canadian law, your company wants to take on the risk associated ignoring the EULA terms.\n\nSorry that you’re taking offense, but your posts so far have indicated that you're doing their work for them.\n\n"
    },
    {
      "time": "29 Mar 2009 — 9:17pm",
      "content": "First, if you want legal advice, HIRE A LAWYER. Do you know what smart people call guys who get their legal advice from the internet? Losers. Because when we end up in court with you, you lose, because we have the sense to hire a lawyer. At least pick up the Graphic Artists Guild Pricing and Ethical Guidelines. If you don’t learn to stop being lazy and thoughtless about legal issues now it’s going to cost you a lot of money one day.\n\nSecond you should put your font licensing terms in the contract and have it worked out BEFORE the client signs it. Third, if you have a repeat client who insists that the font license be transferred back to them at the end of the job, don’t buy non-transferable font licenses when working with that client. If you really, really want to transfer the license, pester the designer to grant a non-transferable license.\n\n"
    },
    {
      "time": "29 Mar 2009 — 9:22pm",
      "content": "Thanks for nothing.\n\n"
    },
    {
      "time": "29 Mar 2009 — 9:27pm",
      "content": "_Client here was billed for the project, and of course the font purchase was part of the whole cost. Now couple of weeks later, they want that font because they said they paid for it._\n\nI for one, being a simpleton, would think that the font licence now belongs to the client, not to the studio (i.e. the studio purchased the font on behalf of the client). The client then should ensure that their usage is in accordance with the original licence, or upgrade it as needed. The studio would not be allowed to keep a copy of the font for their own use. The client however could allow the studio to use the font for their own jobs.\n\nIn other words, you cannot have your cake and eat it too.\n\n"
    },
    {
      "time": "30 Mar 2009 — 12:06am",
      "content": "nvmd\n\n"
    },
    {
      "time": "30 Mar 2009 — 12:28am",
      "content": "\\> Client here was billed for the project, and of course  \n\\> the font purchase was part of the whole cost.\n\ndid you bill them \\_specifically\\_ for the font? if so,  \ni'd say that they bought it, so they own it, not you.\n\nand of course they will want the font, because they  \nmight need to change something in what you did...\n\nso give 'em the font, and erase it from your machine.  \nwhat they do with it will then be of no concern to you.\n\neven if you didn't bill them for the font \\_specifically\\_,  \nhanding it over is the easiest way to extricate yourself  \nfrom a situation which has already become unpleasant.\n\nso use your head.\n\nand if they want you to do any work for them again,  \ntell them your overhead cost will require a purchase  \nof a font in \\_your\\_ name, which \\_you\\_ will then own.  \nif they say that you can use \\_their\\_ copy of the font,  \nsay you don't roll that way, and don't want to start...\n\nbetter yet, turn down the job. unpleasant clients have  \na nasty habit of repeating their unpleasantness later...\n\n-bowerbird\n\n"
    },
    {
      "time": "30 Mar 2009 — 12:41am",
      "content": "<cite>did you bill them _specifically_ for the font? if so,<br>\ni’d say that they bought it, so they own it, not you.</cite>\n\nOne doesn't BUY a font. A font (or any other software) is LICENSED. Anyone who wants to use it needs to have a single license. So the fonts cannot be given to the client, even if they were charged for it. If the clients want to use it, they need to purchase their own license.\n\nOr if the font foundry would allow it: A transfer of the license from the studio to the client might be possible. But even this needs some written statement from the foundry. One cannot just give the fonts away like a book or something ...\n\n"
    },
    {
      "time": "30 Mar 2009 — 12:56am",
      "content": "_A transfer of the license from the studio to the client might be possible. But even this needs some written statement from the foundry._\n\nAbsolutely. Perhaps this is what the above-mentioned \"programmers\" meant?\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:55am",
      "content": "\\> One doesn’t BUY a font. A font (or any other software) is LICENSED.\n\noh please. get off the semantics. they don't help.\n\ni'm telling vectorm the client paid for the license...  \nso vectorm should hand over the font to the client.\n\nif he was gonna bill the client for the font (license),  \nhe should've bought it in their name to begin with.  \n(which is why concern with \"transfer\" is misplaced.)\n\nit seems he wants to bill them for the font (license),  \nand then keep it himself. it's no wonder, then, that  \nthe client is now calling bullcrap on the whole thing.\n\n-bowerbird\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:56am",
      "content": "why doesn't the system eliminate duplicate posts?  \ni mean, seriously, it can't be hard to detect them...\n\n-bowerbird\n\n"
    },
    {
      "time": "30 Mar 2009 — 3:16am",
      "content": "<cite>oh please. get off the semantics. they don’t help.</cite>\n\nSure they help. The difference between buying and licensing is the core of the VectorM's question.\n\n<cite>i’m telling vectorm the client paid for the license...<br>\nso vectorm should hand over the font to the client.</cite>\n\nAgain: it doesn't matter who paid for the fonts. What matters is who is has a license to install and use the fonts.\n\n<cite>if he was gonna bill the client for the font (license),<br>\nhe should’ve bought it in their name to begin with.</cite>\n\nNo, if they would license the font in the client's name, the studio would have no license to use the fonts for the design work in the first place.  \nThey client has to account for all the costs associated with the project, but that doesn't mean they \"own\" any of the tools (hard- or software) that were used to fulfill the project.\n\n"
    },
    {
      "time": "30 Mar 2009 — 3:47am",
      "content": "_why doesn’t the system eliminate duplicate posts?_\n\nOh, it's the system's fault. Does the lift come down faster for you when you push the button twice?\n\n"
    },
    {
      "time": "30 Mar 2009 — 12:45pm",
      "content": "i'm only clicking the button once.\n\nbut even if i clicked the button 83 times, is there any reason  \nwhy it should post the exact same message more than once?\n\n-bowerbird\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "\\> The difference between buying and licensing  \n\\> is the core of the VectorM’s question.\n\nthere's absolutely no difference between the two  \nthat is of relevance to any aspect of this question.\n\nnot in the mind of this non-lawyer, anyway...\n\n\\> Again: it doesn’t matter who paid for the fonts.  \n\\> What matters is who is has a license  \n\\> to install and use the fonts.\n\nvectorm's client paid for the font, so the license  \nto install and use the font belongs to that client.\n\nthe client let vectorm install and use the font to do  \nwork for them, and now that he's done, he should  \nerase that font from his machine. and the client  \nshould be given the font they have paid to license,  \nsince it appears that they do not have it presently.\n\nif vectorm thought the client would pay for the font,  \nbut vectorm would get to have the license in his name,  \nthen i'd say he is the one who is badly mistaken here...\n\nif vectorm hadn't billed the client specifically for the font,  \nbut rather bought it using money from his own company,  \nand bundled the cost into his overall billing for the project  \n(in exactly the same way that he bundles the cost of his rent  \nand his computers and all his other overhead), then fine,  \nthe license belongs to \\_him\\_ and not to the client, and he  \nhas every right to explain this in great detail to the client.\n\n\\> No, if they would license the font in the client’s name,  \n\\> the studio would have no license to use the fonts  \n\\> for the design work in the first place.\n\nif font-designers want to try to enforce such silliness,  \ngood luck... but that can only erode the willingness of  \nyour customers to actually do what's expected of them,  \nwhich will cause you even more problems down the line.\n\n-bowerbird\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:07pm",
      "content": "Experiment\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:08pm",
      "content": "Ooops! :-P\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:10pm",
      "content": "if you were going for 83, you fell short... :+)\n\n-bowerbird\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:14pm",
      "content": "I lost count so gave up early - I think every click generated a post though... and hey I'm top of the list too!\n\n ![](http://web.archive.org/web/20131019063032im_/http:/typophile.com/files/clickclickclick_6367.JPG)\n\nBut somehow 83 total for the week!\n\n"
    },
    {
      "time": "30 Mar 2009 — 1:16pm",
      "content": "Oh mighty sword-wielding Si, cheat route to Top Typophile.\n\n"
    }
  ]
}
