{
  "id": "56383",
  "title": "Beginner's font - All critiques welcome!",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi guys, I'm currently in my 2nd year of Graphic Design and I have to make my own typeface. I haven't named it yet. This is my first typeface, so I'm really a newbie so please teach me guys :) I've made all the lowercase, and haven't made any of the uppercase. Sorry if my English is bad though..\n\nIf anyone has any suggestion for the name, I'll gladly consider about it. This typeface is inspired by the shape of the leaf. And please don't mind the bad spacing..\n\nThanks :)\n\n| Attachment | Size |\n| --- | --- |\n| [lowercase.pdf](http://web.archive.org/web/20150414193113/http:/typophile.com/files/lowercase.pdf) | 224.09 KB |\n\n",
  "author": "Kageyoshi",
  "time": "30 Mar 2009 — 5:04am",
  "uid": "43293",
  "comments": [
    {
      "time": "30 Mar 2009 — 6:43am",
      "content": "Welcome!\n\nI too take inspiration from plants in a lot of my design. However, when I look at yours I see more digital than vegetable... I had the same problem in my first design, which was also modular. I think modular typefaces are a fine way to start out, but after building things based on modules, you often (always?) need to go through each letter, and add some \"life\" or \"personality\".\n\nI would try adding a little modulation, and perhaps a few curvier lines.\n\n"
    },
    {
      "time": "30 Mar 2009 — 7:05am",
      "content": "Hi!\n\nI was wondering if you have typography classes in you school. When I did graphic design the first thing they thought me was basic calligraphy, which was not neccesarily fun but thought me a lot about the shapes of letters, contrast, serifs, pen direction etc. This forms the basis of many classic letterforms and fonts. When I experimented with type myself, I also started with this kind of modular font, which is fun, though it's use is quite limited (A text set in this font would be quite difficult and tiresome to read)\n\nFor this font I would try to include some more variation, as it is pretty static now. Try to work more with curves, as it would make the font more lively. It's probably a lot easier to do some sketching by hand to try some more flowing forms and letters, based on what you have now. You can also have a look at this font, originally deisgned by Jan [Tschichold](http://web.archive.org/web/20150414193113/http:/www.fonts.info/info/en_iwan-reschniev.htm), which is a good example of a modular typeface.\n\nFor future fonts I would advise you to start with just writing and drawing letters by hand, perhaps with a broad-nip pen. This will give you a better understanding of the shapes of letters. Also study fonts you like, how are they made, make big copies of letters and imitate them. This will also help you to understand what makes a good font. After this comes kerning, letter- and wordspacing and a whole lot of stuff I won't bore you with now. Most important thing: have fun with letters, if this is the case, all the rest will follow naturally.\n\ncheerio Queneau\n\n"
    },
    {
      "time": "30 Mar 2009 — 7:38am",
      "content": "wow, thanks a lot for your fast replies!\n\nwell actually my first draft of this typeface (I made it on paper) wasn't as static as this. I add some natural curves, and made it looks like a leaf. But when I show them to my lecturer she told me that it looked too natural, and I should be more consistent with the shape. So when I revised it and show her, she chose this. And I didn't like it as much as my draft :( but you guys have a nice idea, and maybe if I try that she'll agree with me :)\n\n@Queneau:\n\nYeah, I have typography class but sadly they didn't teach me calligraphy. And hey, that's a good typeface! I'm sure I can come up with some inspirations :)\n\nThanks a lot guys, it means a lot for me. Cheers :)\n\n"
    },
    {
      "time": "30 Mar 2009 — 9:43am",
      "content": "Care to post those first drafts here as well? Of course, it's important to listen to critiques given by your teachers, but I think you should _always_ do what _you_ think is best!\n\nI agree with the others that the organic feel isn't really very clear, because the typeface is so angular. I think a bit more roundness will improve the design. For example, look at [FF Cocon](http://web.archive.org/web/20150414193113/http:/new.myfonts.com/fonts/fontfont/ff-cocon/). I'm not saying you should make your design like this, but you get an idea about what is possible with a given theme.\n\nI don't know what your school is like, but at my art academy they welcome a litte stubbornness. That you choose your own direction, even if they don't neccessarily agree with it. I'm sure if you tell your teacher that you have explored this direction now, but that you feel you should also explore other possibilities, that she will be ok with that. Or at least, I hope. :)\n\n"
    }
  ]
}
