{
  "id": "5639",
  "title": "Word and \"th\"",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "How do you turn off the superscripting of \"th\" after numbers in Word? (I'm running Office X).\n\n",
  "author": "scoffer",
  "time": "Thu, 2004-07-15 09:53",
  "uid": "2021",
  "comments": [
    {
      "time": " Thu, 2004-07-15 09:56",
      "content": "\\>why wouldn't you follow what microsoft wants you to do?   \n   \nI'd be embarrassed that knowledable typographers might happen to read the document, and hang a faux pas on me.   \n   \nYou know, I did try an OT font to see if proper superiors were supported, but that didn't happen.\n\n"
    },
    {
      "time": " Thu, 2004-07-15 10:15",
      "content": "\"WORD\" and all other programmes which don't give a toss about kerning and spacing should be taken out at dawn and shot by someone who's good at it.\n\n"
    },
    {
      "time": " Thu, 2004-07-15 10:17",
      "content": "On older versions of Word autoformat is under tools/autocorrect.\n\n"
    },
    {
      "time": " Thu, 2004-07-15 10:47",
      "content": "Also, you can undo instance by instance if you just have a few and want other autoformat to operate. put your cursor over the th in 5th and you will see a blue line appear. Click on the line and it will give you the option of undoing autoformat.\n\n"
    },
    {
      "time": " Thu, 2004-07-15 11:52",
      "content": "Thanks people, I had been looking under Preferences.\n\n"
    },
    {
      "time": " Thu, 2004-07-15 22:18",
      "content": "_\"WORD\" and all other programmes which don't give a toss about kerning and spacing should be taken out at dawn and shot by someone who's good at it._   \n   \nGary, that's a mite ambiguous. Shot by someone who is good at kerning and spacing, or shot by someone who is good at shooting people at at dawn? Being shot by someone who is lousy at shooting people at dawn might last longer and be more painful. Also more entertaining for spectators. ![:-)](http://web.archive.org/web/20050516051631im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " Fri, 2004-07-16 05:58",
      "content": "Microsoft's system of insane menus and illogical groupings of options continue to befuddle me. It's funny that Word is supposed to be so 'easy to use'. They really mean 'does a whole lot without asking'. It's actually tricky to get Word to act like a straight word processor, rather than a joke of a layout program that tries to guess whether you're writing a letter or making a bulleted list every three lines.\n\n"
    },
    {
      "time": " Fri, 2004-07-16 06:23",
      "content": "Chris, I have been using Word since 2.0, and find the menus quite logical. Can you give me an example of what you think illogical?   \n   \n\\>It's actually tricky to get Word to act like a straight word processor   \n   \nNo, just turn off auto formating options. You can get to the dialogue box either under 'format' or 'tools'. Logical, right?\n\n"
    },
    {
      "time": " Fri, 2004-07-16 07:46",
      "content": "Well, I didn't think so.   \nAs a Mac graphics user from way back, I usually look for the preferences under the Preferences menu item -- format is something to do with hard drives?   \n   \nBTW, prior to getting OS X in 2003, I had been using Word 5, which I acquired in 1991 -- so, despite all Word's other faults, props to Microsoft for making such a durable piece of software that didn't charge an annual upgrade tax.\n\n"
    },
    {
      "time": " Fri, 2004-07-16 07:53",
      "content": "I think what bothered me most was the distribution of the various 'auto-features' and other preferences in various menus. I just wanted a \"turn this feature off\" checkbox in a Preferences menu, rather than having various menu items spread about the applications, or having to turn off each bit individually.   \n   \nAs for illogical setups: for example, under the 'Format' menu there's an 'Autoformat' submenu. In that menu, you can click Options to change the options. That's logical. Well, the same options are under the Autoformatting preferences, which are stored under 'Tools\\>Autocorrect' then you have to choose the Autoformatting tab, which contains about 12 individual check boxes, which must be undone individually. Why the two methods? Why is Autoformatting under Autocorrect? Why can't I shut it off with one click?   \n   \nAnother 'feature' is Word's habit of replacing fonts it doesn't have without warning the user properly. I've had people _insist_ they had Gill Sans because Word blithely replaced it with Arial and didn't tell the user clearly, indicating that it was still using Gill Sans.   \n   \nNow that I am forced to use Word regularly (at work), I know where everything is. But when I had to use public PCs at school for a few years and all of the options would be turned back on each time I returned to the machine. Regardless, give me TextEdit any day. I'd use WordPad over Word all the time, but it lacks a spell check feature. 99% of the non-designer users I work with use Word's formatting features to create documents that are _much_ harder to read because they're bolding, italicizing, colorizing and underlining left and right. Word just epitomizes the too-many-features mentality of Microsoft. Instead of building apps that each do one task (or task set) really well, they try to cram a whole bunch of stuff into one thing. I understand the need for things to interoperate, but that's different from feature-bloat. This, in my opinion, just makes easy things more complex and complex things confusing. But I suppose this is a whole other topic in its own right.\n\n"
    },
    {
      "time": " Fri, 2004-07-16 08:18",
      "content": "Hmm. It seems to me pretty logical to put information about auto formatting under 'format'. If you want to go to 'preferences' I think you are conditioned by experience with the Mac, which is a different matter than logic. It is what you are used to.   \n   \nI do agree with you Chris about Word not having a single on-off button for all the autoformatting features. This is not a matter of logic, but of Microsoft deciding for you what is good for you, which is I agree very annoying.\n\n"
    },
    {
      "time": " Fri, 2004-07-16 08:28",
      "content": "When I said \"That's logical\" about the Autoformatting, I actually meant it. It's the additional path under Autocorrect that seemed illogical.   \n   \nWord is a good example of an app that has outgrown itself. It wants to do too much, but doesn't take the extra step towards becoming a proper layout program. It is, in my experience, an awkward middle step between WordPad and Publisher (not that I like Publisher, either). Granted, it's usable. I just don't like it.\n\n"
    },
    {
      "time": " Fri, 2004-07-16 08:55",
      "content": "I think the second path is just helping the user. What is most 'logical' is whatever you would first guess just looking at the names. You might guess either 'format' or 'options' for fiddling with autoformat. Having the redundency is actually a good usability feature in my opinion.   \n   \nAlso all the extra features wouldn't be bloat or 'having outgrown itself' as you put it, except that you are forced to use them as default and you have to go through a song and dance to turn them off. That is what I really object to.   \n   \nI find the automatic list formatting particularly maddening.\n\n"
    },
    {
      "time": " Fri, 2004-07-16 09:23",
      "content": "I find Word's Templates most unfriendly, and most patron's who come into the library only bring up problems after they have completely typed their resumes into these most uncooperative templates. I seem to have mush better luck recreating it for them on a plain document.   \n   \nI swear it consumes all my brainjuices.\n\n"
    }
  ]
}
