{
  "id": "564",
  "title": "Meta+ and Meta (differences)?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Dear Typophiles,   \n   \nI am looking for some information regarding the Meta typeface family by Erik Spiekermann. It is my understanding that the typeface was simply re-branded as Meta from it's original release as Meta+. Could anyone inform me if there are any typographic differences between the 2 versions, that I should be aware of?   \n   \nThanks for your time.   \n   \nWhat a great site.   \n   \nThanks   \nNeil\n\n [‹ Looking to source TF Arrow font](http://web.archive.org/web/20080415214033/http:/www.typophile.com/node/630 \"Go to previous forum topic\") [&#34;Misplaced&#34; Heller Article ›](http://web.archive.org/web/20080415214033/http:/www.typophile.com/node/654 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080415214033/http://www.typophile.com/user/1502\" title=\"View user profile.\">schaffs</a>",
  "time": "<br>",
  "uid": "1502",
  "comments": [
    {
      "time": " 17.Jul.2003 6.45am",
      "content": "Hi there,   \n   \nI think the difference is in the figures, in one release they are old style and in another there also titlely figures. Of course you know the story behind Meta? It started out life as a corporate font for Deutsche Post (German postal company) but half way through they pulled the plug on the project. Anyway, their loss; its a great font.   \n   \nChris\n\n"
    },
    {
      "time": " 18.Jul.2003 2.35pm",
      "content": "Hello there,   \nYes it is true that the FF Meta + has been rereleased as Meta.   \nThe Meta + came in the following weights:   \nBold Roman, Bold Italic, Bold Caps, Bold Caps Italic   \nBook Roman, Book Italic, Book Caps, Book Caps Italic   \nBlack Roman, Black Italic   \nMedium Roman, Medium Italic, Medium Caps, Medium Caps Italic   \nNormal Roman, Normal Italic, Normal Caps, Normal Caps Italic   \n   \nThe new Meta has lining figures and expert sets added to each weight.   \n   \nThe metrics of the font have also been changed.   \nUpon request FontShop provides customers who need to match the Meta+ for older documents with the old data along with the new version of the fonts. (1-888 FF Fonts)\n\n"
    }
  ]
}
