{
  "id": "5640",
  "title": "Typing around Corners",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi   \n   \nI am trying to use a font in Photoshop PS, typing in a circle. I want a fairly plain and wide font, like MicrogammaDMedext. However, when i do this and type the url the font looks odd, with the w's in www going skwiffy. See this gif for what i mean...   \n ![](http://web.archive.org/web/20050516051634im_/http:/www.typophile.com/forums/messages/30/40757.gif)   \nHow can i fix that, or can someone suggest another font which will 'curve' properly?   \n   \nAll help appreciated ![:-)](http://web.archive.org/web/20050516051634im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n",
  "author": "aquilaeagle",
  "time": "Thu, 2004-07-15 10:38",
  "uid": "4219",
  "comments": [
    {
      "time": " Thu, 2004-07-15 13:17",
      "content": "5{re are two factors affecting this.   \nFirstly, the characters are positioned on the path according to their base point, which is on the charcter's baseline, at the left of the character. So on a perfect circle, they would \"step\" as in your example.   \nSecondly, how perfect is the curve they are on?   \nYou may have more control if you create the path and type in Illustrator (and nudge the path to get the type nice), and then drag the graphic into Photoshop (I think you have to hold down the option, or perhaps the command key).\n\n"
    },
    {
      "time": " Thu, 2004-07-15 14:39",
      "content": "[http://www.warp-net.com/](http://web.archive.org/web/20050516051634/http:/www.warp-net.com/)   \nWhy don't you set that logo \"by hand\"?\n\n"
    },
    {
      "time": " Thu, 2004-07-15 15:08",
      "content": "Thanks for the replies guys. I am a novice in Photoshop, so i dont really know what you mean above - if anyone has idiot proof instructions on what i should do i might have a try! ![:-)](http://web.archive.org/web/20050516051634im_/http:/www.typophile.com/forums/clipart/happy.gif) (or I am willing to send a psd to someone if they know a quick solution ![:-)](http://web.archive.org/web/20050516051634im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " Thu, 2004-07-15 15:22",
      "content": "Do you have Freehand or Illustrator or Canvas?   \nI would use Pornoshop later.\n\n"
    },
    {
      "time": " Thu, 2004-07-15 15:35",
      "content": "Tiff where would i get the filter to do that?\n\n"
    },
    {
      "time": " Thu, 2004-07-15 16:03",
      "content": "If you are serious about setting type on a curve you do it with Illustrator's (10.0x and above) \"envelope distort\" tool. Under Object \\> Envelope Distort \\> Make with warp.  beautiful type on a curve. Makes you look like a professional letterer and stuff.\n\n"
    },
    {
      "time": " Thu, 2004-07-15 23:40",
      "content": "These are a couple of logos I'm working on using the warp with mesh tool. The top one got a little bit distorted (around tha \"and\") but nothing that a couple of hours of work can't fix. And the spacing of \"AND\" on the bottom one is off too, but these are just the initial comps.   \n   \n ![Purdy Curves](http://web.archive.org/web/20050516051634im_/http:/www.typophile.com/forums/messages/30/40833.gif)\n\n"
    },
    {
      "time": " Fri, 2004-07-16 08:41",
      "content": "I use Photoshop rather than illustrator - can i do it in that?\n\n"
    },
    {
      "time": " Fri, 2004-07-16 09:42",
      "content": "Thing no. 104 has type on a path...   \n   \n [http://www.thingoftheweek.com](http://web.archive.org/web/20050516051634/http:/www.thingoftheweek.com/)\n\n"
    },
    {
      "time": " Fri, 2004-07-16 14:59",
      "content": "I use Photoshop CS, but i dont see Object, Envelope distort?\n\n"
    },
    {
      "time": " Fri, 2004-07-16 15:16",
      "content": "I guess I'll have to give the warp tool a tryout.   \n   \nFor doing type on a path, the one tip I can give (which may help in Photoshop, though if I'm doing type on a path I only use Illustrator) is to adjust the type baseline (usually lower), so that the path runs through the middle of the cap height as opposed to along the baseline of the letter -- this will lead to a better hug on the curve, I thnk.\n\n"
    },
    {
      "time": " Fri, 2004-07-16 16:02",
      "content": "Thanks for all your help - your a nice bunch ![:-)](http://web.archive.org/web/20050516051634im_/http:/www.typophile.com/forums/clipart/happy.gif) Even to such a n00b like me, you are patient and kind - takes something on forums these days ![:-(](http://web.archive.org/web/20050516051634im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nI'll give it a try this weekend. ![:-)](http://web.archive.org/web/20050516051634im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
