{
  "id": "56415",
  "title": "how much do you kern?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I hate kerning and never feel I do it well. How much do you kern?\n\nLogos? Headlines? Everything? How much should we be kerning?\n\n",
  "author": "dl",
  "time": "30 Mar 2009 — 6:05pm",
  "uid": "20213",
  "comments": [
    {
      "time": "30 Mar 2009 — 6:51pm",
      "content": "Do whatever it takes for the type to look its best at the size it will typically be presented, but be consistent about it.\n\n"
    },
    {
      "time": "30 Mar 2009 — 9:33pm",
      "content": "I've always loved kerning headlines, and used to do it with a scalpel back in the day.  \nBut when making fonts I try and minimize the amount of kern pairs I include, and now put in less kerning than I used to when I started out.\n\n"
    },
    {
      "time": "30 Mar 2009 — 10:08pm",
      "content": "i was talking to Andrew Berry, a recent graduate of the MATD at Reading and I asked him if he kerned his numbers, because I was really impressed with how they worked together, and he just replied, no, just hours spent spacing.\n\n"
    },
    {
      "time": "30 Mar 2009 — 10:18pm",
      "content": "How much one kerns varies a good deal by what kind of work one does and what fonts one does it with. I tend to stick with fonts by foundries that are known for getting the spacing right for the intended use to begin with and I don’t believe that logos should be kerned/tracked in just for the hell of it, so I really only need to kern big headlines. I suspect that if I did book covers or advertising kerning would eat up much more time.\n\nIn the fonts I’m developing I try to avoid too many kerning pairs. It would be nice if I could find a database of pairs and what language they appear in so that I can feel comfortable ignoring pairs that are really only needed for phonetic transliteration of Chinese and other things that nobody would do with my fonts.\n\n"
    },
    {
      "time": "31 Mar 2009 — 12:55pm",
      "content": "Ever since a client of mine asked me to add such glyphs, for Pinyin vocalizations to a font family I have included them in all of our subsequent work. (acaron icaron ocaron ucaron udieresismacron udieresisacute udieresiscaron udieresisgrave. And their uppercase and small caps forms as well)\n\n"
    },
    {
      "time": "31 Mar 2009 — 5:53pm",
      "content": "nobody...?\n\n"
    },
    {
      "time": "31 Mar 2009 — 7:04pm",
      "content": "Not much, not much at all.\n\n"
    },
    {
      "time": "31 Mar 2009 — 9:23pm",
      "content": "If it looks obviously wrong, kern it.\n\nKerning, like design, is not an exact science. But it is a lot like a muscle. Train yourself to see where the problems arise in your design and kerning becomes easy.\n\n"
    },
    {
      "time": "1 Apr 2009 — 12:32am",
      "content": "I love kerning. Both when setting type and when making them. It's part of the fun.\n\n"
    },
    {
      "time": "1 Apr 2009 — 7:47am",
      "content": "I hate kerning. But, I'm more annoyed when I use the font and find a pair that I missed kerning.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131019091247/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "1 Apr 2009 — 7:49am",
      "content": "That doesn't amswer the question though, does it. I kern and adjust side bearings until I run out of thing to adjust. Or, when I get sick of kerning.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131019091247/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "1 Apr 2009 — 8:00am",
      "content": "Creating type aside, if your a graphic designer doing, say, a newsletter for a business or non-profit, do you kern just the masthead and headlines?\n\nHopefully not the whole body content?!\n\n"
    },
    {
      "time": "1 Apr 2009 — 8:13am",
      "content": "If by masthead you mean banner - yes, I kern it to my own aesthetics. If by masthead you mean the publishing info for the document, I just kern the title (banner) of the document. Headlines too, generally. Never the text unless it is as a group.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131019091247/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "1 Apr 2009 — 10:24pm",
      "content": "I will kern only if there are really obvious issues. normally, i would try to select a typeface with good spacing to being with.\n\n"
    },
    {
      "time": "3 Apr 2009 — 4:32am",
      "content": "Re reading this thread I see that the orthodox view has not been clearly stated even if it has been suggested.. That view is the vast vast majority of a design should work without kerning. Good spacing should come from good side bearings and from forms that fit well together. Of course you will need some kerning, but it will be only for exceptionally difficult combinations. Also Caps should be spaced to combine with lowercase, and Small caps with other small caps. Kerning should be done at the very end of the design process.\n\n"
    },
    {
      "time": "3 Apr 2009 — 5:26am",
      "content": "Eben -- you're addressing kerning primarily from the standpoint of type design and font development. However, I believe the original poster was asking the question from the standpoint of a designer, regarding manual kerning of display type.\n\n"
    },
    {
      "time": "3 Apr 2009 — 7:25am",
      "content": "Unfortunately the background of the original question seems to be technology and tools and how to cope with or avoid them, rather than design. A typeface needs as much kerning as it takes so it produces even [insert any other adjective] text. Whether one loves or hates to produce possibly required kerning is not relevant.\n\n"
    },
    {
      "time": "3 Apr 2009 — 8:56am",
      "content": "_Whether one loves or hates to produce possibly required kerning is not relevant._\n\nTrue. Proper kerning on the part of the type designer makes kerning on the part of the designer a function of aesthetics.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131019091247/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "3 Apr 2009 — 1:09pm",
      "content": "When I did page layout and magazine work, I made Illustrator files saves as outlines of mastheads/banners etc. I tweaked them to fit eachother by kerning and outline adjustment. For typical text that does not repeat, I rarely kerned anything at text sizes but almost always kerned larger headlines. If I was lucky enough to be using a well fitted font, this was easy. Some clients had to use some fonts that were not well crafted and they took more work. The truth is, the deadline wasthe master, if I didn't have time, I overlookd the less objectionable stuff. Granted, this was a few years back when the only thing available were type 1 fonts. Type quality is better now, at least by all the good designers.\n\nChrisL\n\n"
    },
    {
      "time": "3 Apr 2009 — 1:40pm",
      "content": "as little as possible\n\n"
    },
    {
      "time": "3 Apr 2009 — 1:54pm",
      "content": "Same here, as little as possible.\n\n"
    },
    {
      "time": "3 Apr 2009 — 2:50pm",
      "content": "as much as is needful\n\n"
    },
    {
      "time": "4 Apr 2009 — 12:21pm",
      "content": "Kent - ah, I see you are quite right. Karsten : bang on!\n\n"
    }
  ]
}
