{
  "id": "56423",
  "title": "Business cards",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been working on my collection for 15 years, and I _know_ I'm not the only one out there who does this obsessively.\n\nOut yourself and we can all do it together!\n\n[Dentist card](http://web.archive.org/web/20150225074256/http:/www.cuartoderecha.com/2328/)\n\n",
  "author": "Chris Dean",
  "time": "30 Mar 2009 — 11:14pm",
  "uid": "/web/20150225074256/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "30 Mar 2009 — 11:26pm",
      "content": "_[cardobserver.com](http://web.archive.org/web/20150225074256/http:/cardobserver.com/)  \n [fubiz.net/2008/06/04/70-amazing-business-cards/](http://web.archive.org/web/20150225074256/http:/www.fubiz.net/2008/06/04/70-amazing-business-cards/)  \n [creativebits.org/cool\\_business\\_card\\_designs](http://web.archive.org/web/20150225074256/http:/creativebits.org/cool_business_card_designs)_\n\n"
    },
    {
      "time": "31 Mar 2009 — 11:22am",
      "content": "I collect business cards and have a few friends that save them for me also. I do have a rival in Memphis who has an amazing collection organized in notebooks; one notebook for wooden cards, one for metal cards, one for plastic cards, etc.\n\nThere are a few organizations and small conventions too.\n\nYou are not alone my obsessive friend.\n\n"
    },
    {
      "time": "31 Mar 2009 — 12:40pm",
      "content": "There are also two large Flickr pools:\n\n[http://www.flickr.com/groups/artofthebusinesscard/pool](http://web.archive.org/web/20150225074256/http:/www.flickr.com/groups/artofthebusinesscard/pool \"http://www.flickr.com/groups/artofthebusinesscard/pool\")  \n [http://flickr.com/groups/bizcard/pool](http://web.archive.org/web/20150225074256/http:/flickr.com/groups/bizcard/pool \"http://flickr.com/groups/bizcard/pool\")\n\nThey are low quality, but there are some real gems that I haven't seen in other places.\n\n"
    },
    {
      "time": "1 Apr 2009 — 8:33am",
      "content": "I wonder, If you like, whoever reads this thread, perhaps you could scan and upload _your own_ business cards.\n\nThat could create an absolutely wonderful thread.\n\nThink of it as a dance-off, only instead of settling it with dance, we settle it with business cards.\n\n(I think I may need to talk to my therapist about this)\n\n"
    },
    {
      "time": "1 Apr 2009 — 10:05am",
      "content": " ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/PFbizcardfront_5088.jpg)\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/PFbizcardback_5924.jpg)\n\nDidn't need to scan them - they were already electronic.\n\nNow that I found a place to print them cheaply (but good quality) I feel more license to change them periodically. Altho I have 500, which should last me the rest of my life.\n\n"
    },
    {
      "time": "4 Apr 2009 — 1:21pm",
      "content": "My friend [Jason Prini](http://web.archive.org/web/20150225074256/http:/www.jasonprini.com/) sent me this link about [how to make a business-card catapault](http://web.archive.org/web/20150225074256/http:/www.boingboing.net/2009/04/04/howto-make-a-busines.html). Impressive.\n\n"
    },
    {
      "time": "4 Apr 2009 — 7:09pm",
      "content": "I’ll play—would love to see others’ work.\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/Card_6296.jpg)\n\n"
    },
    {
      "time": "4 Apr 2009 — 8:44pm",
      "content": "As an age of empires freak, I have to have a cardapult.\n\n"
    },
    {
      "time": "4 Apr 2009 — 9:22pm",
      "content": "[Cardapult video](http://web.archive.org/web/20150225074256/http:/www.youtube.com/watch?v=13Z7o5Tum_E)\n\n"
    },
    {
      "time": "5 Apr 2009 — 7:14am",
      "content": "mark nice work  \nhow long have you been in buffalo?  \nim in the falls and just getting out of school so was wondering the route you took to get where you are today\n\n"
    },
    {
      "time": "5 Apr 2009 — 5:49pm",
      "content": "[American Psycho business card scene](http://web.archive.org/web/20150225074256/http:/www.youtube.com/watch?v=qoIvd3zzu4Y). It had to be done.\n\n"
    },
    {
      "time": "26 Apr 2009 — 6:43am",
      "content": "[Make a business dard disappear](http://web.archive.org/web/20150225074256/http:/howto.wired.com/wiki/Make_a_Business_Card_Disappear).\n\n"
    },
    {
      "time": "30 Jul 2009 — 7:49pm",
      "content": "[Russell McGorman's business card](http://web.archive.org/web/20150225074256/http:/www.typophile.com/node/60314).\n\n"
    },
    {
      "time": "30 Jul 2009 — 7:54pm",
      "content": "[Etan Chan's business card](http://web.archive.org/web/20150225074256/http:/typophile.com/node/59792).\n\n"
    },
    {
      "time": "30 Jul 2009 — 8:18pm",
      "content": "I didn't realize how popular the pronunciation guide thingy was. I had designed some business cards for New York Organ Donor Network a while back that used a dictionary entry for the word “donate”. It was very well received, but unfortunately the project never panned out.\n\nMark, it looks like you could use a new cutting mat!\n\n"
    },
    {
      "time": "12 Aug 2009 — 9:16am",
      "content": "[Planetary gear calling card](http://web.archive.org/web/20150225074256/http:/www.thingiverse.com/thing:211).\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:51am",
      "content": "[Yu Chen's business card](http://web.archive.org/web/20150225074256/http:/typophile.com/node/61134).\n\n"
    },
    {
      "time": "19 Aug 2009 — 8:26am",
      "content": "Some of my favorites from my collection\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/cards-033_4585.jpg)\n\n"
    },
    {
      "time": "19 Aug 2009 — 10:24am",
      "content": "\\> Planetary gear calling card.\n\nWow.\n\n"
    },
    {
      "time": "31 Aug 2009 — 10:13pm",
      "content": "I get tons of business cards, and whether they are drab and uninspired or brilliamntly designed, almost all share one quaslity: they are almost impossible to read because they are set in type so tiny it makes the fine print of an insurance policy compare favorably with the NYTimes Large Type Edition. There is, I imagine, nothing to be done about the people who design such cards but the people who print them ought to speak up to their customers--and maybe even suggest that the backs of the cards be printed in a very plain design using a typeface that scans readily.\n\n"
    },
    {
      "time": "2 Sep 2009 — 4:10pm",
      "content": "My roommate's fresh-off-the-press cards. Olde-timey.\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/sasha_5187.jpg)\n\n"
    },
    {
      "time": "2 Sep 2009 — 5:07pm",
      "content": "@ gillo: Why the two versions? Two kinds of stock?\n\n"
    },
    {
      "time": "2 Sep 2009 — 5:22pm",
      "content": "One of my favorites from my collection. Probably the best example of vernacular design I have ever seen. I was at the farmer's market one morning speaking with a cabinet maker. I asked him if he had a business card so he grabs a scrap of wooden veneer that he uses for inlays, pulls the carpenters pencil out from behind his ear and writes down his name and number. Efficient, environmentally conscious, appropriate and cost effective. And he didn't even need to hire a brand strategist.\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/woodcard_3904.jpg)\n\n"
    },
    {
      "time": "2 Sep 2009 — 5:56pm",
      "content": "LOL\n\n"
    },
    {
      "time": "2 Sep 2009 — 7:22pm",
      "content": "Yes, the two versions are just different stocks. Actually most of the cards were printed on a nice thick white blotter-type paper, the others were just playing around. We liked the brown ones best (kraft-utility paper duplexed to my very favorite discontinued purple Wausau Royal Complements 100lb cover stock, which has nothing to do conceptually with the design of the card but I happened to have laying around, having recently been experimenting with the mysterious art of bulk paper lamination).\n\nAesthetic inspiration/encouragement found [here](http://web.archive.org/web/20150225074256/http:/library.duke.edu/digitalcollections/eaa.SB0077/pg.1/)—this site bearing witness to the long history of business card collecting...\n\n"
    },
    {
      "time": "2 Sep 2009 — 8:42pm",
      "content": "My other roommate's card. It's a glass slide...no she's not a scientist, just a sculptor. She admits that glass is somewhat impractical for a business card.\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/erincard_5538.jpg)\n\n"
    },
    {
      "time": "3 Oct 2009 — 10:24am",
      "content": "[A real estate business card](http://web.archive.org/web/20150225074256/http:/typophile.com/node/62328) that [Hardin](http://web.archive.org/web/20150225074256/http:/typophile.com/user/48457) designed for his wife. I still prefer #2.\n\n"
    },
    {
      "time": "29 Nov 2009 — 11:26am",
      "content": "[This one](http://web.archive.org/web/20150225074256/http:/cardobserver.com/gallery/strathmore-business-card) may not seem like much, but I think it is an excellent example of letterpressing that doesn't take over the card design. Subtle, but still adds a ton of character.\n\n"
    },
    {
      "time": "29 Nov 2009 — 9:21pm",
      "content": "I'm a big fan of \"kiss impression\" myself. Letterpress that  \nyou can see from across the room is way too garish for me.\n\nHere's my current card:  \n [http://www.flickr.com/photos/48413419@N00/4121700633/](http://web.archive.org/web/20150225074256/http:/www.flickr.com/photos/48413419@N00/4121700633/ \"http://www.flickr.com/photos/48413419@N00/4121700633/\")\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/cards2_s_4683.jpg)\n\nhhp\n\n"
    },
    {
      "time": "29 Nov 2009 — 9:56pm",
      "content": "Do you have a shot of card's back ?\n\n"
    },
    {
      "time": "30 Nov 2009 — 11:01am",
      "content": "{An edit brought this post ahead one spot.}\n\nActually the back of the card in that photo is the solid burgundy you can see in there, between the three face-up cards. The face is a paper that was too thin for a business card - but I just liked it and wanted to use it. So then I found a thick paper of a matching color and stuck it to the back! I think the result was better than what I thought I was getting myself into... I also did this design on a thick ecru stock that didn't need a backing. On that one you can see a faint show-through of the impression. Which to me is embarrassing. So I also did it on a thin version of the ecru paper, and added the backing. I also did one on peach paper. The first generation card (see the other Flickr photo) I did on half a dozen different papers, but no backing.\n\nThis BTW is my favorite thing about letterpress: the process is very custom and iterative. On the fly you can try different papers, impression pressures, number of inkings\\*, etc.; and it's all under your hands - no mystery print shop decisions between you and the object that represents you. What most people laud about letterpress - that it's \"organic\", \"irregular\", \"warm\" and whatnot - doesn't do much for me. On the other hand, I do have this crazy theory that letterpress text does in fact enjoy greater readability than offset, due to the gentler edges of the letterforms (assuming nothing greater than a kiss impression).\n\n\\* Changing your mind about the ink color is a pain though!\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2009 — 10:57am",
      "content": "Ah, so you got the front laminated to another piece of paper. That's why I asked - how you managed the letterpressing imprint on the back :)\n\n"
    },
    {
      "time": "30 Nov 2009 — 11:04am",
      "content": "Alex, yes, it's two different paper stocks.  \nLuckily it's not too obvious from the edges.\n\nBTW, if you want the back to have a color without  \nsticking two sheets together, you could always just  \nprint the back with a solid color. You will however  \nget some color/texture variance that way.\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2009 — 11:20am",
      "content": "These are my letterpress business cards. I designed them also as a small type specimen.\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/card_s_5282.jpg)\n\n"
    },
    {
      "time": "30 Nov 2009 — 4:24pm",
      "content": "@hrant - I did the lamination for one of my cards before, but I decided to show my originality and glued Plike to Touche, two stocks that are way too different. The poor thing didn't take that lightly and once the cards were cut, they bent. They could be un-bent back to flat by hand, but doing that for 200+ cards was not fun.\n\n ![](http://web.archive.org/web/20150225074256im_/http:/typophile.com/files/card-precision_3756.jpg)\n\n[http://www.flickr.com/photos/37230902@N04](http://web.archive.org/web/20150225074256/http:/www.flickr.com/photos/37230902@N04 \"http://www.flickr.com/photos/37230902@N04\")\n\n@Jos - Beautiful card. What's on the back ? :)\n\nBy the way consider submitting your card to cardobserver.com, it generates a respectably steady stream of traffic, plus you will be in a very good company there.\n\n"
    },
    {
      "time": "30 Nov 2009 — 6:28pm",
      "content": "@ hrant: re the truncated lines on your last post, are you pulling a bowerbird on us?\n\nzing!\n\n"
    },
    {
      "time": "30 Nov 2009 — 7:27pm",
      "content": "What is  \na bower-  \nbird, Cris-  \ntopher?\n\n:o)\n\n…  \n-=®=-\n\n"
    },
    {
      "time": "30 Nov 2009 — 8:24pm",
      "content": "Alex, I had some curling in mine. Fortunately I was expecting it so I tested things out with one sheet first. Luckily the two paper stocks were close enough that leaving the sheets between some heavy books -before cutting them- did the trick.\n\nBTW, I love that dark gray of yours.  \nAnd the measurement lines in the logo really worked out.\n\nChristopher: what truncation? You mean my manicured right rag?\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 12:56am",
      "content": "<cite> What’s on the back ? </cite>\n\nNothingness ;)\n\n"
    },
    {
      "time": "1 Dec 2009 — 7:07am",
      "content": "Hi Hrant whats the type on your business card?\n\n"
    },
    {
      "time": "1 Dec 2009 — 7:14am",
      "content": "Patria, in various weights - one of mine.  \nAnd the logo is made from the Armenian \"eh\" in my Roupen.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 7:18am",
      "content": "hats off\n\n"
    },
    {
      "time": "1 Dec 2009 — 8:21am",
      "content": "@ Jos Buivenga:  \nMan that's a lovely business card!  \nLove it.\n\n"
    },
    {
      "time": "1 Dec 2009 — 8:46am",
      "content": "Great! Thanks.\n\n"
    },
    {
      "time": "1 Dec 2009 — 11:53pm",
      "content": "Gary - thank you.\n\nhhp\n\n"
    },
    {
      "time": "2 Dec 2009 — 3:16am",
      "content": "With all due respect pattyfab, your electronic card is quite badly dithered, seems a shame, you would be disappointed with that quality in print, I am sure.\n\n"
    },
    {
      "time": "2 Dec 2009 — 6:30am",
      "content": "That's just JPEG artefacts, in what must be merely a \"preview\".  \n(BTW, \"dithering\" is when too-few colors are intermixed to create  \nthe illusion of more colors; this happens typically in GIF images.)\n\nhhp\n\n"
    },
    {
      "time": "2 Dec 2009 — 6:35am",
      "content": "I may be wrong on the technical details, but I'm sure you see my point, it's not an attack! How the card is presented here in this forum is not reassuring. Agree?\n\n"
    },
    {
      "time": "2 Dec 2009 — 6:36am",
      "content": "I really had no intention of causing offense!\n\n"
    },
    {
      "time": "2 Dec 2009 — 7:07am",
      "content": "If you mean that she should have used GIF, I certainly agree. With two hues in there, you only need 32 individual colors (16 shades x 2 hues) to get an optimal rendering.\n\nIn fact GIF is typically very nice to type. JPEG is illiterate.\n\nhhp\n\n"
    }
  ]
}
