{
  "id": "56447",
  "title": "New Dollar Sign Proposed by Congress to Reflect Economic Conditions",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [billdavis](http://web.archive.org/web/20120203032321/http:/typophile.com/user/3095 \"View user profile.\") : 31.Mar.2009 10.42am \n\n**New Dollar Sign Proposed by Congress to Reflect Economic Conditions**\n\nWASHINGTON D.C. — APRIL 1, 2009  \nTo help stem the downward spiral of the United States economy Congress has proposed a new dollar symbol.\n\n ![](http://web.archive.org/web/20120203032321im_/http:/typophile.com/files/April1DollarSymbol530_4912.png)\n\n“Updating fonts on the world’s computers and devices would be a huge economic stimulus” said one representative after a late night session of the newly formed House Subcommittee – Font Economic Stimulus Technology Relief (FESTR). “The dollar is a shadow of its former self and the new design reflects this.”\n\nOfficials with the International Currency Authority were notified of the change and agreed that other currencies should be updated to aid other countries feeling the effects of the economic debacle.\n\nTo move forward quickly, Ascender Corporation (Elk Grove Village, IL) has been granted TARP money to begin production on, what it calls, “shovel ready” font designs. FESTR reviewed hundreds of submissions and selected the design for the New Dollar sign by Ascender’s Steve Matteson for its formulaic simplicity and visual clarity..\n\nTo be consistent with the value of the world’s currencies, Ascender is offering the new currency symbols at half-off. For more information on the new currency symbols visit [www.ascendercorp.com/custom/currency/](http://web.archive.org/web/20120203032321/http:/www.ascendercorp.com/custom/currency/ \"www.ascendercorp.com/custom/currency/\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20120203032321/http:/typophile.com/user/3095\" title=\"View user profile.\">billdavis</a>",
  "time": ": 31.Mar.2009 10.42am",
  "uid": "3095",
  "comments": [

  ]
}
