{
  "id": "56449",
  "title": "Top 5 Olympic Poster Designs",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "Having recently read about German graphic designer otl aiche and in build up to the London 2012 games, I have decided to do a post about the different designs for olympic posters. This is in fact not a very original subject, but in my research I did find that there was lots of pictures and not THAT much actual critique from a design point of view. So thats what im gonna try to offer hopefully. Obviously there has been a massive amount of designs over the years, so what follows is my top 5 favourite poster designs. Hope you enjoy.\n\n1980 Moscow, USSR\n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/rus2_5702.jpg)\n\nThis was a strange one for me, so I have decided to feature it as much over interest as design reasons. Moscow actually had the most featured events to any previous olympics the olympics with 203 in total. Also, the United States, followed by 60 further countries, boycotted in protest of the Soviet war with Afghanistan. In total there were over 250 types of posters with 18.75 million copies printed which is a massive amount. Unlike most olympics, there was actually not that much consistency throughout the different poster designs. Below are some examples of the different different posters and contrast in styles. As you can see, the illustration is very varied and whilst this makes for interesting viewing from our part, probably didnt make for building a consistent brand and identity for the Moscow Olympics across all media. Even the use of the logo/emblem is varied with some of the below skewing it directly out of shape - a big no no in any design theory, surely! Also, some of the artwork was thought to rip off that of the 1976 Olympics, with a redesign, which didnt change much, of the ever popular and influential pictograms of the 1976 Olympics (featured later in this post).\n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/rus1_3540.jpg)\n\nSo for the purpose of this blog I have decided to talk about the main design which I actually really like. It was designed by Wladimir Arsentjev and consists of a flame type shape stemming from the olympic rings with a red star at the top of some the crisp lines. It has a simple flat colour quality, with such strong flat colour and use of shape giving it a clean, and almost retro and modern feel at the same time. I also love the gold and red together. It is a combination I would not have automatically considered, but the red stands out perfectly. And of course, the was the symbolic colour of the soviet union, so it is approriate too.\n\nThe poster also has a symetrical quality which reflects the olympic logo itself. I suppose this would be one of the challenges when working with a logo as well known as the olympic 5 rings. Where do you position it? This poster almost works solely around it which is definetely the right idea. In fact in terms of showing the rings in the best way, it could be considered one of the more effective poster designs.\n\nMontreal 1976, Canada  \nThe Montreal Games were designed by the Graphics and Design Directorate, and featured 2 sets. The first concentrated on the flag, mascot and stadium, and the second on the sports themselves. The mascot consisted of a beaver called ‘Amik’ wearing a ribbon of COJO colours. The stadium poster involved geometric drawings overlaying flat coloured stripes.\n\nThe second set of posters concentrated on the individual events and a photographic route was favoured with action based photography.\n\nI really like the beaver. Its such a simple form with basic geometric shapes. Its also undeniably kinda cute! And the three stripes down the middle really emphasise the shape and add a stroke of positivity and contrast to the hard black shape.\n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/MON1_5519.jpg)\n  \n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/mont2_6219.jpg)\n  \n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/mont3_5226.jpg)\n  \n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/mont4_5452.jpg)\n\nI also love the logo. I suppose it is quite strange in a way as it is directly editing the classic olympic rings which is obviously contraversial. But the form is really elegant. George Huel was also keen on the minimal approach, ‘Munich used two symbols, I wanted to work with one symbol, clean and simple’. The three curves sprouting up are actually meant to represent three things, a podium, a running track and also an M for Montreal. The podium definetely stands out the most for me, and although it doesnt really resemble an M much in my opinion as this has 2 points and not 3, I still kinda see it. But like I say, its still much more about the basic form for me.\n\n1972 Munich, Germany  \nThis is one of the most memorable and celebrated of designs from renound German graphic designer otl aiche. The idea and the brief in the Munich olympics, was to erase the memory of the last German held olympics in 1936, often dubbed the ‘nazi games’. So the thought was for the design to contain a colour sequence that had no resemblance to anything ‘agressive nationalism’. And indeed the posters did this, with colours almost illuminous and a cheerful feeling throughout. Missing is the hard black and red of the German National flag.\n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/munich_4504.jpg)\n  \n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/munich2_3981.jpg)\n  \n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/munich3_5432.jpg)\n\nPersonally I love this design, it is classic and elegant, but even now has a contemporary feel to it as well. The imagery, following the pallette is knocked out to a few simple colours, and the brightness combined with the photographs have such energy to them. The different colours and the variations within the posters, also give it a national feel, almost symbolic of flags themselves.\n\nThe logo itself is a kind of spiral symbol, again containing an optimism that is evident throughout. I also love the way they apply it, with beautifully crafted typography seperated with the thin lines. This cleaness and elegance in fact is evident throughout all the materials with a clean use of colour, simplicity and good typography. Essentially this clean approach is what everything comes down to for this set.\n\nAnd the designs too were influential, with a new set of pictograms that have been used in sport ever since and have also influenced public signs on a broarder field. There were literally hundreds of these, and the way they boil the detail down to the simplist form is to be admired. To differentiate each must have been an enormous challenge whilst still keeping it recognisable to the native disciplines. Easy to see in fact why this has since become such a design classic.\n\nTokyo 1964, Japan  \nI have put this one in because of its lovely simple form and simplicity. This was designed by Prof. Cho Yong-je of Seoul National University in 1984 and it is probably the simplest of all designs, but also arguably the most noticable. Like some other posters it makes a big use of the olympic logo and leaves this unchanged. The whole poster seems to work round them, which is good designing right? It also has a real kind of japanese art quality, even though it is made using such simple text and shapes.\n\nThe other posters in the set, use dramatically lit photography with a hard contrast between the dark and light colours. The design on the original poster is carried through these posters too in the form of a bottom strip at the bottom. It maintains the boldness and simplicity that makes it so effective. All the posters were used using photoengraving, which highlighted the technology of the Japanese printig idustry and actually resulted in the whole project winning several awards including the prestigious Milan Design Award.\n\n1968 Mexico\n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/mex_5686.jpg)\n  \n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/mex3_4556.jpg)\n  \nThroughout my research, I found lots of criticism for olympic posters altogether but especially for this one. However, despite that and although I can understand claim of illegibility and head aches through the hypnotic patterns, I have to say I really like this. Again it has a contemporary feel to it. Looking at it, it is imediately impactful with stark uses of colour applied well to the complex forms of repeating lines. The concept as well though is fascinating with the black and white lines taking influence from the famous patterns created by the Huichole Indians, an indigenous ethnic group of western central Mexico. The poster itself was a joint creation from Pedro Ramirez Vazquez (an architect), Eduardo Terrazas (President of the Organizing Committee of the Games) and an American, Lance Wyman (who also originally designed the Mexico 86 logo).\n\nThe logo itself links in with the olympic rings which looks pretty good. I suppose one criticism could be that it is not all that easy to see, but it is also almost central to the whole design and especially on the black and white ones, the colours help it stand out.\n\nThe colours generally are quite bright and positive with some more sombre ones as well. The imagery is dealt with in a similar way to some of the other olympic posters, with simplified tonal colour uses. Overall it is simple and works pretty well.\n\nMy favourite part though is definetely the logo. I love the circular ketter forms and the way it all feels linked.\n\nAfter thought.  \nSo there we have it…thats some thoughts and facts around various olympic posters. Hope you enjoyed. To end this post, I would like to say a bit about the London 2012 design. There is no official poster yet, but we have all seen the logo. I remember reading an article about the logo and finding it really interesting. Much of the idea of placing different images inside of the forms and the flexibility of this is really interesting. I also like some of the angles they have. I just think that overall the design looks really like an intro to a kids show. I definetely dont like the choice of font for London. It also looks like its a lowercase l. Most odd. My design colleague pointed me toward the logo by Daniel Eatock the other day, which I thought was fantastic. The simplicity of the form is great and the idea is a really simple one, but one not really noticed before. Looking at all the poster designs over the years, the ones that stick out for me are the more simple approaches. It is just my opinion, but I think that because the process requires you to combine a new style with the olympic rings, it requires a simplistic approach. Sometimes design is as much about restraint as creativity. Anyway - hope you enjoyed the post. Would love to hear your comments.\n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/lon_4247.jpg)\n\n",
  "author": "chasteauneuf",
  "time": "31 Mar 2009 — 9:23am",
  "uid": "29870",
  "comments": [
    {
      "time": "31 Mar 2009 — 9:54am",
      "content": "The 1968 Mexico poster has always been a favorite.\n\n------------  \n [http://nerdski.com](http://web.archive.org/web/20130516074717/http:/nerdski.com/ \"http://nerdski.com\")\n\n"
    },
    {
      "time": "31 Mar 2009 — 10:21am",
      "content": "¡Handpicked!\n\n"
    },
    {
      "time": "31 Mar 2009 — 11:28am",
      "content": "chasteauneuf, a wonderful post. one minor correction: it is Otl Aicher not Aiche.\n\n"
    },
    {
      "time": "31 Mar 2009 — 11:48am",
      "content": "Thanks for your selection! Very nice.\n\nI really like the Otl Aicher designs, the colors, the logo and especially the consitant use of great design, even for such things as tickets:\n\n ![](http://web.archive.org/web/20130516074717im_/http:/typophile.com/files/EquestrianSports_lrg_3461.jpg)\n\nIt set the standard for all olympics that were to follow, but I personally think none of them can match it, and some were no more than poor rip-offs. Nowadays it's pretty normal to have consistant house styles for everything, but it was still quite new back then (no computers back then, hello typewriters ;-) ) and therefore it has had a lot of influence as well in the the field of corporate identity. Unfortunately they often took just took a few elements Aicher used, slapped a grid over it and squeezed all the life and fun out of it.... :-(\n\nOh well... at least we still have the chance to admire the originals now and again! Have a look [here](http://web.archive.org/web/20130516074717/http:/www.1972municholympics.co.uk/index.php) for instance\n\ncheerio Queneau\n\n"
    },
    {
      "time": "31 Mar 2009 — 12:53pm",
      "content": "Mexico 1968 was a love to see from the very first. Also, it was one of the first things I saw after retuurning from Viet Nam in 1968.\n\nI also liked the 1972 Munich but the thought of it saddens me still to this day.\n\nChrisL\n\n"
    },
    {
      "time": "31 Mar 2009 — 3:31pm",
      "content": "Two of my favourite posters of **any** kind: the Max Bill one from the artist series in 1972 and the repeating lines Wyman affair from 1968.\n\n"
    },
    {
      "time": "1 Apr 2009 — 6:17am",
      "content": "forest\\_young, glad you enjoyed the post, and thanks for the correction :-) guess I missed a letter.\n\nThanks for the comments guys, the munich ones are indeed special and like you say, influenced so many future games. So many of the others looked kinda similar and like you say sometimes a lil too similar.\n\n"
    },
    {
      "time": "5 Apr 2009 — 2:42pm",
      "content": "Mexico rules. The London 2012 logo is supposed to be something that people will like by the time we reach 2012, but as you say, it's very 80s Saturday morning kids' TV, and the totally free colour usage results in some deeply unpleasant iterations at the top of my utility bills, which make me almost as sad and bitter as the bills themselves. Thanks for posting.\n\n"
    },
    {
      "time": "9 Apr 2009 — 6:34am",
      "content": "to add something:\n\nwho is interested should visit  \n [http://olympic-museum.de](http://web.archive.org/web/20130516074717/http:/olympic-museum.de/ \"http://olympic-museum.de\")\n\nits a terrible ugly and unusable site, but it has so much material, like ...\n\n(all?) official reports as PDF files (3 books on Munich!): [http://olympic-museum.de/quickview/all\\_oreports.htm](http://web.archive.org/web/20130516074717/http:/olympic-museum.de/quickview/all_oreports.htm \"http://olympic-museum.de/quickview/all\\_oreports.htm\")\n\nPosters: [http://olympic-museum.de/quickview/all\\_poster.htm](http://web.archive.org/web/20130516074717/http:/olympic-museum.de/quickview/all_poster.htm \"http://olympic-museum.de/quickview/all\\_poster.htm\")\n\nMascots, Torches, Diplomas, Medals, Tickets, Stamps, Programme, Pictos, ...  \nJust scroll down from the starting page and use the drop downs on the right side to navigate.\n\nI always enjoy when \"re-exploring\" it after some month.  \nMy favourite designs are tokyo, moscow and of cause munich.\n\n"
    },
    {
      "time": "11 Apr 2009 — 10:59am",
      "content": "Wonderful post. Munich. I was scrolling through, and was shocked at the billboard poster for 2012, it deffinetly stays with you / has an impact, but for all the wrong reasons.\n\n"
    }
  ]
}
