{
  "id": "56450",
  "title": "Floop medium",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all. I'd appreciate your thoughts on this typeface. It's currently the 26 upper and lowercase letters and I hope to expand it to bold and light weights with the full set of glyphs. I think I've identified the \"problem\" letters but I'd like to get opinions on that.\n\nThe initial plan was to create a straightforward, functional sans-serif but it morphed into more of a headline/display face as I went along and figured out its personality. Now I could see this being used primarily as a headline face, maybe part of an identity system, who knows.\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_01_3796.gif)\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_02_5048.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [floop\\_01.pdf](http://web.archive.org/web/20150414191035/http:/typophile.com/files/floop_01.pdf) | 67.97 KB |\n| [floop\\_02.pdf](http://web.archive.org/web/20150414191035/http:/typophile.com/files/floop_02.pdf) | 64.8 KB |\n\n",
  "author": "50pointtype",
  "time": "31 Mar 2009 — 9:56am",
  "uid": "43269",
  "comments": [
    {
      "time": "31 Mar 2009 — 8:03pm",
      "content": "That lowercase g is memorable. But I think you need to make your lettershapes harmonize together a bit more. Some lettershapes (especially in contrast to others) seem a touch awkward and unbalanced.\n\n"
    },
    {
      "time": "1 Apr 2009 — 1:34am",
      "content": "some nice signature shapes on this one, but agree with bemerx25 that you need to work on balancing the colour and rhythm\n\n"
    },
    {
      "time": "1 Apr 2009 — 2:36pm",
      "content": "I think you could dial back the lift of v/w/y. The idea is a nice one but it just goes a bit too high IMO.  \nMy eye wants the bottom of l (lowercase L) to taper in the other direction. i too.  \nSome lingering \"straightforward functional sans\" remains in many of the caps - basically every curveless capital letter (AEFHILMNTXYZ) needs more \"floop\"!  \nThe \"harmonization\" already mentioned would include reconciling the different terminals (e.g. bottom ends of j and t.  \nI like the capital U and V particularly.\n\n"
    },
    {
      "time": "2 Apr 2009 — 7:31am",
      "content": "I like it. I'd made one suggestion for now. Did you try to reverse the lower storey of the g? It's seems to sit on his back or unhappy to my eyes. I'd also reduce a bit the bowl of the R and increase the one on the P or only increase the P. Let's make some test.\n\n"
    },
    {
      "time": "2 Apr 2009 — 1:36pm",
      "content": "I'll be going back to the lab with this one. Good comments all.  \nThere's a lot of curves and \"pointy parts\" to wrangle here. One concern I had is that some of the lowercase letters are too wide. (a,b,d,p,q,r,u) Probably some culprits with my rhythm problem there. Good catch on the j and t terminals.  \nCould you better explain the reversing of the g? That was actually my starting letter and I want to make sure I get that one right. :)\n\n"
    },
    {
      "time": "4 Apr 2009 — 8:46am",
      "content": "I made a fast sample, but here what I would want to say. To my point of view it looks more happy, but you have the final decision.\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/Yogurt_2_5248.png)\n\n"
    },
    {
      "time": "5 Apr 2009 — 11:00am",
      "content": "Thoughts on these g's? The original intent was to bypass the link on the g altogether to get one big sweeping loop. I've been staring at this thing for so long that I'm not sure what the right balance is. Thus...the other options you see.\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_g1_3686.gif)\n  \n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_g2_6145.gif)\n\n"
    },
    {
      "time": "5 Apr 2009 — 12:54pm",
      "content": "One more...\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_g3_3959.gif)\n\n"
    },
    {
      "time": "5 Apr 2009 — 1:15pm",
      "content": "you could move the lower bowl to the right.... I know that would be more conventional but it might work.\n\n"
    },
    {
      "time": "5 Apr 2009 — 1:19pm",
      "content": "That last one sure is interesting. It looks like a fruit (with the ear like a leaf) or a sleeping baby curled up. What about disconnecting the bowl from the tail completely? I love it.\n\nIf I were to suggest one main thing it would be to make it more quirky. It looks a bit like a standard sans with some customised bits added on. Take N for example. It has a very different style to B or E. Or Z and K. Now you've got the underlying shapes there, I'd go really mad with the curves, see which ways they can be pushed then start bringing the glyphs back in towards each other so they harmonise. Like Craig said, add more floop!\n\nDid you try B with the top curve continuing into the counterspace rather than the bottom one? And what about an arched M rather than pointy? T looks dark. E and F have dark middle strokes. In fact generally the horizontal strokes 'should' be a few units thinner than the vertical ones. j descends too far. Crossbars on f and t could be a touch lower.  \nThe caps look quite narrow.\n\nJust my thoughts, see what you think, play with the floop and see what happens :)\n\n"
    },
    {
      "time": "5 Apr 2009 — 1:21pm",
      "content": "IMO the g was already about as busy as could work in a typeface; 2, 3, and 4 look like logos to me. Nice logos, to be sure, but I think a font with every g looking like any of those will be not that functional.\n\n"
    },
    {
      "time": "15 Apr 2009 — 5:44pm",
      "content": "Just wanted to provide an update on the lower case while I find the time to work on the uppers. I think the rhythm and consistency are a lot better on these, but will probably experiment with the quirkiness factor. Note the more standard looking g.\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_03_3780.png)\n\n"
    },
    {
      "time": "26 May 2009 — 5:50pm",
      "content": "Here's an update for everyone while I further refine some of the letterforms and spacing issues. All of the sharp corners are gone and the \"g\" in question has gone back to basics. Still trying to figure out the B, P, R, and W.\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_04_4654.png)\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_05_3417.png)\n\n ![](http://web.archive.org/web/20150414191035im_/http:/typophile.com/files/floop_06_3823.png)\n\n"
    }
  ]
}
