{
  "id": "56458",
  "title": "Gradient (type): Illustrator or InDesign",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI want to apply a gradient to some text in a poster, I'd prefer to use InDesign to do this, but for some reason im thinking illustrator may give better results.\n\nWould it?\n\n",
  "author": "Captain Kidd",
  "time": "31 Mar 2009 — 4:25pm",
  "uid": "29076",
  "comments": [
    {
      "time": "31 Mar 2009 — 4:58pm",
      "content": "Create a raster gradient in Photoshop and place it inside outlines of the letters.\n\n"
    },
    {
      "time": "31 Mar 2009 — 5:08pm",
      "content": "In InDesign:  \n1. Create a gradient swatch  \n2. Create a text frame and type the text  \n3. Apply the gradient color to the text\n\n"
    },
    {
      "time": "31 Mar 2009 — 5:10pm",
      "content": "Actually that makes perfect sense, do you think InDesign gradient should be avoided?\n\n"
    },
    {
      "time": "31 Mar 2009 — 5:17pm",
      "content": "Vector gradients in any program can result in some nasty banding at large sizes, so I would be loathe to use one on a poster unless I really trusted the printer to work with me and make sure that the printing comes out right. And if you do the whole thing in Photoshop it’s easier to add some noise and make the whole thing look more natural.\n\n"
    },
    {
      "time": "31 Mar 2009 — 7:25pm",
      "content": "Thanks but I know how to create the gradient, im more concerned about which application is favoured because of the results.\n\nWould there even be a difference between Illustrator and InDesign?\n\nThanks\n\n"
    },
    {
      "time": "31 Mar 2009 — 7:50pm",
      "content": "Thanks James, much appreciated\n\n"
    },
    {
      "time": "31 Mar 2009 — 9:26pm",
      "content": "I’m not sure that there’s even a difference in the way Indesign and Illustrator produce a vector gradient, I’m pretty sure it’s all Postscript.\n\n"
    },
    {
      "time": "31 Mar 2009 — 11:04pm",
      "content": "I second doing the gradient in photoshop and adding a tad bit of noise to it. Vector-based gradients can go horribly wrong. There's quite a discrepancy between math-based formulas for color gradations and real-world printed fades. The only time I'll use a gradient in Illustrator or Indesign is if it's a very subtle fade between similar values of the same color.\n\n"
    },
    {
      "time": "1 Apr 2009 — 4:40am",
      "content": "Hi David\n\nYears ago I knocked up this one for my own amusement; all gradients applied within Indesign.\n\n ![](http://web.archive.org/web/20131108235431im_/http:/typophile.com/files/Somedays-poster_5638.jpg)\n\nAs James says, the postscript routines in both Indesign and Illustrator are pretty much the same thing. However – _vector-based gradients can go horribly wrong_ – the only time this happened to me was on an A1 poster in which the banding was a direct result of the shift between two colours being _too subtle over too wide a distance_. A 10 or 15% shift on one of the plate colours was not enough, and the gradient was replaced with a blend containing the maximum number of steps. Wearing the cost of remaking the film & proof certainly learnt me a lesson...\n\n"
    }
  ]
}
