{
  "id": "56485",
  "title": "I'm looking for some test for my new font",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi,\n\nI'm new here.  \nJust signed the agreement with one font foundry about releasing new fonts.  \nI've just made one font and I'd like to test it, but I don't wanna send them font files until I check everything I can.\n\nDo you have any files you're willing to share that are made only for testing fonts?  \nDo you know where to find it?\n\nThanks\n\n",
  "author": "<a href=\"/web/20100203170008/http://typophile.com/user/43106\" title=\"View user profile.\">nettoo</a>",
  "time": "<br>",
  "uid": "43106",
  "comments": [
    {
      "time": "",
      "content": "[http://yanone.de/typedesign/autopsy/](http://web.archive.org/web/20100203170008/http:/yanone.de/typedesign/autopsy/ \"http://yanone.de/typedesign/autopsy/\")\n\n"
    },
    {
      "time": "",
      "content": "[http://www.fontqa.com/](http://web.archive.org/web/20100203170008/http:/www.fontqa.com/ \"http://www.fontqa.com/\")\n\n"
    },
    {
      "time": "",
      "content": "Besides these two good things to do, as mentioned above, these are som basic hands-on logical tests you also can do just make sure everything is working fine.\n\n• Make a full set of characters (every one of them) to see if every character is visible in a layout application.\n\n• Make outlines of all character in InDesign or Illustrator to see that everything is OK.\n\n• Install the font on a PC and a Mac and try the fonts in all available applications you might have (both professional apps and everyone-have-apps like Word, Powerpoint etc) . You could try all the different install methods available also when installing the fonts.\n\n• Make sure the font is appaering in the font menus with the proper name in the applications.\n\n• Put them in Suitcase/Linotype Font Explorer to see how they look there. Does it activate properly etc, is the font info looking OK?\n\n• Print from different applications.\n\n"
    },
    {
      "time": "",
      "content": "Thanks!  \nMacro's don't work for me on Vista (64bit).  \nI'll have to try somewhere else.  \nThanks once again.\n\n"
    },
    {
      "time": "",
      "content": "For more \"technical\" (I hate that term but everyone seems to know what I'm talking about) testing:\n\nI would recommend Microsoft Font Validator, but it's hard to do that effectively these days as it does not appear to be readily link-able anymore. Perhaps sii or Sergey or someone at MS can post a current download link (and while we're at it: any news on an updated version being released anytime soon?). Font Validator is mainly geared towards TrueType-based fonts, but still provides useful feedback for CFF-based fonts.\n\nI would also recommend 'compareFamily' in the Adobe Font Development Kit for OpenType: [http://www.adobe.com/devnet/opentype/afdko/](http://web.archive.org/web/20100203170008/http:/www.adobe.com/devnet/opentype/afdko/ \"http://www.adobe.com/devnet/opentype/afdko/\") ; bit of a different approach than FontValidator (and suffers from an even worse signal-to-noise ratio), but can help spot major problems.\n\n"
    },
    {
      "time": "",
      "content": "I found link to FontValidator:\n\n[http://download.microsoft.com/download/f/e/9/fe9795a3-756e-4f60-8989-03d...](http://web.archive.org/web/20100203170008/http:/download.microsoft.com/download/f/e/9/fe9795a3-756e-4f60-8989-03dc9870f189/FontValSetup.msi \"http://download.microsoft.com/download/f/e/9/fe9795a3-756e-4f60-8989-03dc9870f189/FontValSetup.msi\")\n\nThanks\n\n"
    },
    {
      "time": "",
      "content": "Ahem, that fontQA thing. It outputs an xsl file, but how do I display in a humanly readable format? Safari 4 beta only shows some jibberish, Internet Explorer 8 shows the file content as does Firefox 3. Am I dim?\n\n"
    },
    {
      "time": "",
      "content": "Duh, I opened the wrong file. Sorry. I should have opened the XML, not the XSL file.\n\n"
    },
    {
      "time": "",
      "content": "I've started Python and macros in Vista x64, just needed to use Python version lower then 2.4\n\nMay help someone...\n\n"
    },
    {
      "time": "",
      "content": "Leslie Cabarga's [Kern King](http://web.archive.org/web/20100203170008/http:/www.logofontandlettering.com/kernking.html) file might be helpful.\n\n"
    },
    {
      "time": "",
      "content": "@Ricardo Cordoba - So, if your kern all those 'non-sense' words you are right to go ? :)  \nsorry for this noob question!\n\n"
    },
    {
      "time": "",
      "content": "_So, if your kern all those ’non-sense’ words you are right to go ? :)_\n\nI think that the more tests you do, the better. Kern King is a file [Cabarga](http://web.archive.org/web/20100203170008/http:/www.lesliecabarga.com/) made to test kerning pairs, but notice that it doesn't contain too many punctuation symbols. Quotation marks need to be kerned, too, and Kern King only has a few apostrophes (single quotes) in it. Ideally, you need to test every possible kerning pair, including punctuation.\n\nAlso, Kern King is not a substitute for the tools James Puckett, Tim Ahrens, nettoo, and j. hadley linked to earlier.\n\n"
    },
    {
      "time": "",
      "content": "You might want to consider putting together a proofing file for whatever encoding you plan to be using in the near future. Mine currently shows a variety of juxtapositions of almost every glyph in the font against every other organized into sections for easy printing. I’m actually about to add more pages that only show common kerning pairs. It’s also worthwhile to run a paragraph of text in every language the font supports; just get copy from the Universal Declaration of Human Rights web site.\n\n"
    }
  ]
}
