{
  "id": "56502",
  "title": "Wood type collection for sale",
  "forum": "woodtype's blog",
  "tags": [

  ],
  "content": "My large personal collection of classic and rare wood type fonts is now for sale: 373 fonts in eleven type cabinets, plus 129 related items.\n\nThe collection is about one-third historic and fancy fonts, one-third modern 20th century fonts, and one-third gothics. Also included are two smaller collections, one of borders, catchwords & ornaments and one of sorts, as well as several wood type catalogs and books and a 36-inch wood type composing stick from the old print shop at St. Meinrad's Abbey Press. Asking price is $172,000 (about $425/font).\n\nFor an inventory and prospectus with additional photos, please email me at **[malcolmdean@mac.com](mailto:malcolmdean@mac.com)**\n\n ![](http://web.archive.org/web/20130818004100im_/http:/typophile.com/files/ClarendonXXXCc_6037.jpg)\n\n ![](http://web.archive.org/web/20130818004100im_/http:/typophile.com/files/PaintersRoman72_4661.jpg)\n\n ![](http://web.archive.org/web/20130818004100im_/http:/typophile.com/files/TuscanExtended72_6431.jpg)\n\n ![](http://web.archive.org/web/20130818004100im_/http:/typophile.com/files/ArcadianNo172_5490.jpg)\n\n ![](http://web.archive.org/web/20130818004100im_/http:/typophile.com/files/TuscanCd72_4170.jpg)\n\n\"In closing, I'd like to recount an interesting incident which adds another dimension to the allure of wood type… a mother and child incident [at an antiques mall not long ago]. The boy, about 11 years old, was unhappy with the mall experience; but his eyes lit up on spotting [our] array of type cases holding type, cuts and other seductive what nots. After inspecting things for a while, he started on a second tour despite his mother's tuggings. The mother persisted, the boy resisted. My wife, who had been observing this with quiet amusement (having raised three sons) asked him why he found the type of such interest. He caressed the piece he had in hand - thought a bit and said, \"It's real.\"\n\n- Stan Harris, writing in Greg Ruffa's **[The Art of Wood Type](http://web.archive.org/web/20130818004100/http:/www.theartofwoodtype.com/)**\n\n",
  "author": "woodtype",
  "time": "1 Apr 2009 — 12:33pm",
  "uid": "43316",
  "comments": [

  ]
}
