{
  "id": "56516",
  "title": "Greater Albion Releases Bonning. 40 percent Introductory Discount",
  "forum": "Release",
  "tags": [

  ],
  "content": "Greater Albion Typefounders has just released Bonning on [Myfonts.Com](http://web.archive.org/web/20100203003757/http:/new.myfonts.com/fonts/gatf/bonning/). Bonning is a Roman face full of the spirit of the 1920s.\n\nIt was inspired by a (real)estate agent’s For Sale board seen in an old sepia photograph from that era and combines visual flair and period with good clear legibility.\n\nA range of Opentype features including alternate forms, old style numbers and fractions, as well as discretionary and standard ligatures are included. Three weights are offered, including a shadowed black form are offered, all in a choice of three widths. It’s the ideal face for signage with a period feel, as well as posters, headings and feature paragraphs.\n\nA full (and fully licensed) version of Bonning Wide Bold can be downloaded completely free of charge from [Myfonts.Com](http://web.archive.org/web/20100203003757/http:/new.myfonts.com/fonts/gatf/bonning/)  \n. The restof the family can be purchased there.\n\nIn the meantime Greater Albion's [blog](http://web.archive.org/web/20100203003757/http:/gatf.wordpress.com/) has some examples of the Bonning family in use.\n\n4/4/09 = We're now running a 40% introductory discount on Bonning at [Myfonts.Com](http://web.archive.org/web/20100203003757/http:/new.myfonts.com/fonts/gatf/bonning/).\n\n",
  "author": "<a href=\"/web/20100203003757/http://typophile.com/user/30818\" title=\"View user profile.\">Rasendyll</a>",
  "time": "<br>",
  "uid": "30818",
  "comments": [
    {
      "time": "",
      "content": "Yer links are messed up, laddie.\n\n"
    },
    {
      "time": "",
      "content": "Aye, so they were, thanks for pointing it out. I've corrected them now.\n\nMeanwhile we're offering a 40% introductory discount on Bonning for the next few weeks, as well as making one family member available free.\n\n"
    }
  ]
}
