{
  "id": "56548",
  "title": "Unified Arabic by Nasri Khattar",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "Arabic Typography & Type Design"
  ],
  "content": "I have been reading the postings from this group, and recently received a Google alert that I have set up with my father's name.\n\nLet me introduce myself: I am Nasri Khattar's daughter, and would be delighted and honored to be accepted as a full-fledged member of this group. Although I work in a completely different although related field - marketing communications - I do know some things about type, obviously, from my father, and did study Arabic. A U.S. citizen, I live in the U.S. after growing up in Lebanon and then living in France for 25 years. My father was a dual national, American-Lebanese, and my mother is American - her family is in Illinois.\n\nI now have time to dedicate myself to my father's work. He designed several typefaces during his lifetime - he was also an architect and disciple of Frank Lloyd Wright - and the later fonts were connected systems, \\*based\\* on Unified Arabic (TM), and they connect beautifully. He designed them to meet the ASMO 449 standard. Since he passed away in Lebanon in 1998, I have been slowly recovering his originals, and am now ready to, hopefully, begin to market them, and I am very interested in this group's discussion to learn more about the industry.\n\nI believe that his work is by no means \"extreme\" but rather in advance for his time, although I do know that font systems available on the Web show only his very first designs used to obtain his patent. At the time, in 1947, his font system was considered an \"invention,\" since there was no Arabic form of printed type, resembling Indo-European characters.\n\nI sincerely hope to receive some replies to this posting, and welcome all discussion and comments.\n\nIn all sincerity and respect,\n\nCamille Khattar Hedrick\n\n",
  "author": "Camille Khattar...",
  "time": "2 Apr 2009 — 11:26am",
  "uid": "43365",
  "comments": [
    {
      "time": "6 Apr 2009 — 1:18am",
      "content": "@ At the time, in 1947, his font system was considered an “invention,” since there was no Arabic form of printed type, resembling Indo-European characters.\n\n“Al-Shamas Abdullah Zakher” founded the first Arabic printing press in Lebanon in 1734. The press is located in “Deir Mar Youhana” in “Khinshara”.\n\nMore with Flowers:  \n [http://29letters.wordpress.com/2009/01/05/the-first-arabic-press](http://web.archive.org/web/20150414221931/http:/29letters.wordpress.com/2009/01/05/the-first-arabic-press \"http://29letters.wordpress.com/2009/01/05/the-first-arabic-press\")\n\n"
    },
    {
      "time": "1 May 2009 — 10:28am",
      "content": "Dear Camille\n\nWelcome to this group, I have visited your introductory page about the late Khattar designs a year ago through Nadine's blog. Thank you for preserving his work. I think he had truly loved Arabic.\n\nAlthough I had never heard about your father's work or others in 1990s when I started working on my project to design Arabic fonts sharing similar in principle to his, I was happy to learn in 2003 about Mr. Khattar's hard work, through an article by Ma'mun Saqqal. I was born in the US and have been living in New York for the past 30 years. You can visit my site: [http://arabetics.com](http://web.archive.org/web/20150414221931/http:/arabetics.com/ \"http://arabetics.com\")\n\nIt is interesting to know that the first known attempt ever to design an Arabic font with isolated letters was made by an American engineer and typographer, Homan Hallok, who lived in New York (Manhattan) back in the 1865s. He had also designed great traditional Arabic fonts in the 1830s. I am an engineer too, and I have started my design work in Manhattan! It must be some thing about the air here -:) Was your father living in Manhattan, too, when he worked on his Unified Arabic in the 1950s?\n\n\\>\\>At the time, in 1947, his font system was considered an “invention,” since there was no Arabic form of printed type, resembling Indo-European characters.\n\nMy approach to Arabic fonts is that we must keep type design open and must not impose any rigid rules. Calligraphic and non calligraphic fonts are both beautiful and NEEDED. There should be no \"allowed\" and \"not allowed, or \"extreme\" and \"non extreme\" work. We need to keep options open and let users choose. This approach was the secret behinde the success of the magnificant Arabic calligraphy long centuries ago. The Arabic script is by nature flexible and open to change. New Arabic type design styles should be added not as replacements of the \"old\", but as additions to enrich the it.\n\nThe only clear red line that no one should cross is attempting to \"replace\" Arabic letters by Latin or other scripts letters, like the work of Saad Akel on the \"Lebanese font\", or Turkish the fonts created under Kamal Atatatuk, with the pretext that Arabic can not support modern needs.\n\nYour father perseverance and design works were not extreme at all. His project was a pioneering work. If the internet was around during his peak working days, his fonts would have had much better chance to succeed. The best way to enrich Arabic typography today is to get to work and introduce more Arabic fonts and designes to ensure that Arabic is fully prepared and compatible with current known, and future unknown, developments.\n\n-Saad\n\n"
    },
    {
      "time": "13 Sep 2009 — 11:12am",
      "content": "Dear Saad,\n\nMy apologies for taking so long to respond. Yes, my father was in Manhattan in 1947 when he came to his groundbreaking idea which led to the patented design called Unified Arabic (TM). This is very strange indeed! He also married my mother there, and that is where I and my siblings were born. We are all U.S. citizens.\n\nKhattar then spent the rest of his life creating up to seven other typefaces based on Unified Arabic, some of which actually connect automatically, without any ligatures, and some of which remain disconnected. Since he was also an architect and disciple of Frank Lloyd Wright, he continued to practice architecture as well.\n\nIn no way did he wish to replace any previous forms of Arabic; his wish was to \\*add\\* the printed form of Arabic which still does not exist as in Indo-European languages. His eight typefaces are easily read by anyone who can read Arabic characters, used in many other languages besides Arabic, as you know.\n\nI am taking up his work now after a long hiatus since his passing in 1998, and will soon be creating a new Web site, [www.unifiedarabic.com](http://web.archive.org/web/20150414221931/http:/www.unifiedarabic.com/ \"www.unifiedarabic.com\") on which I will post samples of each typeface. You can see a small sample today here: [www.unifiedarabicalphabet.com](http://web.archive.org/web/20150414221931/http:/www.unifiedarabicalphabet.com/ \"www.unifiedarabicalphabet.com\").\n\nI sincerely hope that we can continue this discussion. Since I cannot see your e-mail address here, would you like to follow us on Twitter at [http://twitter.com/unifiedarabic](http://web.archive.org/web/20150414221931/http:/twitter.com/unifiedarabic \"http://twitter.com/unifiedarabic\")? Otherwise, I would send you an invitation. I will see if you are there so that I can follow you as well.\n\nIn all sincerity,\n\nCamille\n\nCamille Khattar Hedrick  \nPresident, Daughter of Nasri Khattar  \nUnified Arabic, LLC\n\n"
    },
    {
      "time": "25 Oct 2009 — 9:15am",
      "content": "Dear Camille,\n\nIt is great that you have started this thread to discuss the work of your father Nasri Khattar. When i was a student at AUB in the late fifties and early sixties he organized an exhibition (and perhaps a lecture) about his Unified Arabic Script. I forgot the exact date but remember that the exhibition was held at West Hall, where I met him. I was very impressed by his work and the zeal with which he promoted his ideas. الله يرحمه.\n\nIn fact that really inspired me to start my own research in Arabic type design. That was the start for me, thanks to that wonderful man's dream. Over the years, and further inspired by the writings and example of Eric Gill I designed connected simplified letter shapes that were the median between all the different ways of writing Arabic, but then after the 1967 war other interests diverted me from type design. A few years ago the advent of computers and the Internet revived my interest and I have made digital versions of my AlQuds font more or less based on the same pen-and-ink designs of 45 years ago.\n\nThrough this forum and by email contacts I have made many friends from those who are now expert and active in the flourishing field of Arabic typography. They gave me much valuable advice about the technical aspects of digital typography. Things have changed a lot since since the days of lead type and Letraset (and not always to the better). The question of abridging the number of glyphs is no more a technical necessity, and there is a bewildering abundance of Arabic types, both connected and unconnected, of variable quality and legibility and graphic sense. I am sure you will find valuable support and advise to continue to honor Nasri Khattar's legacy by introducing his very elegant designs as digital fonts and making his writings available on your website. Good luck!\n\nVladimir\n\n"
    },
    {
      "time": "2 Apr 2012 — 5:45pm",
      "content": "My curiosity being piqued when a web search led me to the page mentioned here - which does not contain any images of the type style in question - I searched, and found [this page](http://web.archive.org/web/20150414221931/http:/www.sakkal.com/articles/Arabic_Type_Article/Arabic_Type5.html) on which Figure 4 contains an example of the Unified Arabic printing style.\n\nAnd later, in my search for something else, [this better page](http://web.archive.org/web/20150414221931/http:/29letters.wordpress.com/2007/05/28/arabic-type-history/) is considerably more informative.\n\n"
    }
  ]
}
