{
  "id": "56560",
  "title": "What do you think of my business card?",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "This is the first business card I've designed for myself. I want something I can give people when networking and that I can leave around places I visit to hopefully drum up freelance business.\n\nThanks for your feedback.\n\n[Business card](http://web.archive.org/web/20140725170040/http:/i41.tinypic.com/2lx9lc0.jpg)\n\n",
  "author": "aheep",
  "time": "2 Apr 2009 — 4:36pm",
  "uid": "7895",
  "comments": [
    {
      "time": "2 Apr 2009 — 7:05pm",
      "content": "Front - good & minimal  \nBack - not so good  \nThe all lower-case Avant Garde - is that what it is? - is just too difficult to read, it's too hard to differentiate the letters (shapes are too similar) and the lines seem to blend into each other too easily. Try a different font or using mixed case or even spacing the different lines of text further away from each other.\n\n"
    },
    {
      "time": "2 Apr 2009 — 8:31pm",
      "content": "I came up with these variations based on your suggestions.\n\n[http://i43.tinypic.com/16k8as7.jpg](http://web.archive.org/web/20140725170040/http:/i43.tinypic.com/16k8as7.jpg)\n\nI think I'll use the cropped a as my logo, too. I just redesigned my resume to include it.\n\n"
    },
    {
      "time": "2 Apr 2009 — 10:55pm",
      "content": "I would go a couple of points smaller for the text.\n\nAlso the sans you are using are particularly dull. Try something more interesting.\n\nIs the big purple lowercase ‘a’ a Kepler or Walbaum?\n\nMikey\n\n"
    },
    {
      "time": "3 Apr 2009 — 1:54am",
      "content": "The big 'a' is Justus.  \nI chose Avant Garde becasue it's very round and curvy and my name (in all lowercase) has lots of curves.\n\nThe point size on this version is 10pt. I don't want people to have to squint, though I don't want it to look like a big-print edition book either. A friend recommended trying all caps and moving my name.\n\n[http://i42.tinypic.com/f39yk0.jpg](http://web.archive.org/web/20140725170040/http:/i42.tinypic.com/f39yk0.jpg)\n\n"
    },
    {
      "time": "3 Apr 2009 — 4:44pm",
      "content": "Not all caps! All caps looks like you're yelling! Or that your font choice doesn't have elegant Small Caps.\n\nI liked the letter differentiation you had going in your 2nd posting, variation c. Much easier to read.\n\n"
    },
    {
      "time": "5 Apr 2009 — 1:22pm",
      "content": "I think it is very nice. Clean and simple. I am not a huge fan of that shade of purple, but It's a nice composition. I like to play around with Cicle, Geosans, Lane and Kabel when I am in need of a typeface that is round and curvy like Avant Garde. I am not familiar with Justus. Thanks for enlightening me. Are the lowercase g's as beautiful as the a's?\n\nj\n\n"
    },
    {
      "time": "6 Apr 2009 — 4:08am",
      "content": "I don't mind the all-caps so much. It's not as if it's body text or anything.\n\nStill, suggestions for more interesting typefaces: Gotham, Neutraface, Dax or Gill Sans, all in light weight might suit your purpose.\n\nThe side with just your name on might also look good with a lighter shade of purple as the background instead of white.\n\n"
    },
    {
      "time": "8 Apr 2009 — 1:12am",
      "content": "Thanks guys.  \nGotham is a really nice typeface, I wish I could afford all the families.\n\nHere's a try in Lane with variations of a light purple background. I took some cyan out of the purple, too.\n\n[http://i40.tinypic.com/2efhpa9.jpg](http://web.archive.org/web/20140725170040/http:/i40.tinypic.com/2efhpa9.jpg)\n\n"
    },
    {
      "time": "8 Apr 2009 — 6:19am",
      "content": "After seeing some design inspiration I'm also throwing this reversed version into the ring. I think it'd be striking to have one dark side and one white side. I'm also playing with the idea of rounded corners. The corners get all bent up and stuff anyway.\n\n[http://i43.tinypic.com/2nkng8y.jpg](http://web.archive.org/web/20140725170040/http:/i43.tinypic.com/2nkng8y.jpg \"http://i43.tinypic.com/2nkng8y.jpg\")\n\n"
    },
    {
      "time": "9 Apr 2009 — 3:40am",
      "content": "I like variation F and H the best out of these.\n\nThink I would like it more if the text on the back was set a little tighter (letter and linespacing) and if the name on the front was positioned a bit lower so it's in the vertical stretch of the curve of the \"a\".\n\n"
    },
    {
      "time": "29 Apr 2009 — 1:30pm",
      "content": "I like H. Nicely done.\n\nj\n\n"
    }
  ]
}
