{
  "id": "5658",
  "title": "(x) Daddy Yankee logo - calligraphy by Mark Allen {Valentine (self)}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I ran across this website earlier today. It is as BLING BLING as it gets... Anyways, the site incorporates 1 maybe 2 fonts for the logos. I am trying to figure out what script font was used.   \nAny Ideas... Anyone?   \n   \n [http://www.daddyyankee.com](http://web.archive.org/web/20141114081104/http:/www.daddyyankee.com/)\n\n",
  "author": "3d_envy",
  "time": "16 Jul 2004 — 8:59am",
  "uid": "4233",
  "comments": [
    {
      "time": "16 Jul 2004 — 9:16am",
      "content": "Took a quick look through Letterhead Fonts, but didn't see anything quite like it. It doesn't look like anything I have already collected for the Script Font ID Guide, so I'm inclined to guess it's a custom design. It does appear to be a font, and not hand drawn, I think, unless whoever lettered it is very consistent and steady.\n\n"
    },
    {
      "time": "16 Jul 2004 — 10:23am",
      "content": "Hey, Valentine, welcome to Typophile!   \n   \nJust a suggestion, when posting on the type ID forums, it helps if you give the thread a more descriptive name. A title like \"What font is this?\" makes it difficult to remember when you are browsing trough several threads...   \n   \ngood luck with this one!\n\n"
    },
    {
      "time": "16 Jul 2004 — 9:59pm",
      "content": "Thanks for the advice Jesus. Thanks for looking too Mike. Upon looking at the credits on the website, it appears that Mark Allen did the Calligraphy. He's released one font back in 1994.. the name of that murdered ceasar in \"The Gladiator\". But nothing else. It appears my chances of getting text that looks just like this is nill. I suppose Bickham Script is still my favorite ![:-)](http://web.archive.org/web/20141114081104im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "16 Jul 2004 — 2:32pm",
      "content": "Oh no, it's [Evil Bert](http://web.archive.org/web/20141114081104/http:/www.snopes2.com/rumors/bert.htm)!\n\n"
    }
  ]
}
