{
  "id": "56580",
  "title": ".sfp fonts? How can I get/make them?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi,  \nwhat are .sfp fonts? How do I get/make them? All I know is that they are printer fonts for special printers (for printing on tickets)? Can FontLab export them?\n\nAll I found on google was cryptic weird forum posts.\n\nThanks  \nHenning\n\n",
  "author": "dehac",
  "time": "3 Apr 2009 — 3:15am",
  "uid": "15122",
  "comments": [
    {
      "time": "3 Apr 2009 — 4:43am",
      "content": "Hi,\n\n.sfp is a bitmap format. Bitfonter can generate .sfp fonts.\n\nPieter\n\n"
    },
    {
      "time": "3 Apr 2009 — 9:05am",
      "content": "Thanks Pieter.  \nIs there any other tool? A free one maybe. I dont have Bitfonter and I only need to convert one font for one job.\n\nHenning\n\n"
    },
    {
      "time": "3 Apr 2009 — 10:57am",
      "content": "Many years ago, Laurence Penney made a little tool called TTFtoSFP, while allowed one to quickly make a size-specific SFP bitmap font from a TTF. It was a small and elegantly simple little program. I'm not sure if it is currently available, but have directed Laurence's attention to this thread.\n\n"
    },
    {
      "time": "3 Apr 2009 — 11:17am",
      "content": "Thanks for drawing me here, John. You speak the truth: I did make such a program. It worked fine for making SFP fonts in the Windows Latin 1 character set.\n\nI usually sold it along with Striker, a little program to edit SFP bitmaps, for £200. This is probably too much cash for a program that hasn't been updated since around 1997. I might decide to make both programs free from now on... let me think about that for a mo'.\n\n ![](http://web.archive.org/web/20150322044519im_/http:/typophile.com/files/striker_3895.gif)\n\n ![](http://web.archive.org/web/20150322044519im_/http:/typophile.com/files/ttftosfp_3437.gif)\n\n"
    },
    {
      "time": "8 Apr 2010 — 4:52am",
      "content": "Hi,\n\nI am interested in the program ttftosfp.  \nPlease contact me [gcholvi@gmail.com](mailto:gcholvi@gmail.com)\n\nThanks.\n\n"
    },
    {
      "time": "2 Sep 2010 — 8:49am",
      "content": "Hi, I too interested in the programa TTFTOSFP, my mail is [gabriel.sus@gmail.com](mailto:gabriel.sus@gmail.com)\n\nThanks\n\n"
    }
  ]
}
