{
  "id": "56582",
  "title": "Slightly UNUSUAL sans-serif?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nI’m working on series of book covers that deal with prophecies, past lives, life after death, psychic stuff, mediums etc. I need to choose the right cover headline typeface.\n\nI don’t want anything too scary looking but something that matches these delicate themes so I’m thinking it should probably be some humanist, sans-serif type since it deals women are main target here. I guess it might also be a type that’s slightly unusual (the way it’s cut or something) since these topics are unusual in itself aswell...\n\nI tried Cora for Headlines...and it looks better than any other I tried but I know it’s not the one so It would help to hear your suggestions.\n\nKeywords for choosing this type would be: unusual, not everyday, serious, delicate, women(?)...\n\n",
  "author": "<a href=\"/web/20090507185441/http://typophile.com/user/37579\" title=\"View user profile.\">Dot</a>",
  "time": "<br>",
  "uid": "37579",
  "comments": [
    {
      "time": " 3.Apr.2009 6.15am",
      "content": "For some reason, my brain says Dalliance. But that’s probably not what you’re looking for… too weird?  \nCora strikes me as _extremely_ clean-cut and “cool”, considering the topic at hand.\n\nHow about something from PSY/OPS? Their fonts might mostly specify as “just a little bit weird”. I think I’d try [Eidetic Modern](http://web.archive.org/web/20090507185441/http:/www.psyops.com/html/spec_eidetm.html) where the White sometimes creeps in on the black – like a past life creeps in on the present, or the “invisible” on the “visible” etc. Ha, you got a rationalization too! :o)\n\n"
    },
    {
      "time": " 3.Apr.2009 8.31am",
      "content": "For display purposes there is Mystic by Terry Wudenbachs.\n\n[http://www.p22.com/ihof/mystic.html](http://web.archive.org/web/20090507185441/http:/www.p22.com/ihof/mystic.html \"http://www.p22.com/ihof/mystic.html\")\n\n"
    },
    {
      "time": " 3.Apr.2009 8.54am",
      "content": "“I’m working on series of book covers that deal with prophecies, past lives, life after death, psychic stuff, mediums etc. I need to choose the right headline typeface... unusual, not everyday, serious, delicate, women(?)...”\n\nLet your readers do it. Just kidding. But I was at a party not too long ago, chatting with a person. When I asked what they did, they told me they were a psychic, which I said was really interesting. So when asked what I did, I of course said, _“You tell me!”_\n\nCheers!\n\n"
    },
    {
      "time": " 7.Apr.2009 12.00am",
      "content": "Hi...both Dalliance and Mystic are a bit too much. Eidetic modern is much better.\n\nI don’t want these books looking like they usually do- scary and crappy. I’d like them to look a bit more decent so I think I need a decent sans serif with some slight unusual differences in way it’s cut or something!?\n\nAny other suggestions?\n\n"
    },
    {
      "time": " 7.Apr.2009 1.06am",
      "content": "_“I think I need a decent sans serif with some slight unusual differences in way it’s cut or something!?”_\n\n[Legato](http://web.archive.org/web/20090507185441/http:/www.fontshop.com/search/?q=legato&x=0&y=0).\n\n"
    },
    {
      "time": " 7.Apr.2009 1.20am",
      "content": "Hmmm..OK, maybe it should be juuust a little bit more unusual. /Sigh/ This one’s tough!\n\n"
    },
    {
      "time": " 7.Apr.2009 2.45am",
      "content": "Altaira, Eidetic modern is the way I guess...The more I look at it the more I like it- it really looks the way you descibed it and it’s not toooo much. Can it be used for the main headline on the cover since I don’t think it’s display type??  \nOr is there display type similar to Eidetic Modern?\n\n"
    },
    {
      "time": " 7.Apr.2009 3.16am",
      "content": "_“Can it be used for the main headline on the cover since I don’t think it’s display type??”_  \nAs far as I understand things, text fonts can be used large: if it looks good,\\* do it. (Hardcore text fonts will likely look a bit strange at large sizes, but sometimes that effect is desired.) It’s just that display fonts can’t be used for text.  \n\\* I’d try via the type tester before buying.\n\n"
    },
    {
      "time": " 9.Apr.2009 6.56am",
      "content": "Maybe not unusual enough, but have you looked at our [Giacomo](http://web.archive.org/web/20090507185441/http:/www.terminaldesign.com/fonts/set/?ID=16).\n\n"
    }
  ]
}
