{
  "id": "56588",
  "title": "Which logo do you like best- Budget Printing",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Please tell me what logo you like best and why. If you would make a change to that logo what would it be?\n\nThese logo’s are for a printing Company I work with. They have been around for 30 years and want a logo update. They have 4 employees they do work for designers, the adverage Joe off the street and a few large corporations.\n\nThis printing co’s current logo has the letters BP very large hence my sphere with those letters. I’m really trying to pull them away from something that sounds like a gas station. the others are all built from the thought that they are the people that make a white sheet of paper look good (with ink) Hence, there is paper in the other three logos.\n\nPlease tell me what logo you like best and why. If you would make a change to that logo what would it be?\n\nThank you!\n\n| Attachment | Size |\n| --- | --- |\n| [NEW LOGO IDEAS.pdf](http://web.archive.org/web/20090406204002/http:/typophile.com/files/NEW%20LOGO%20IDEAS.pdf) | 181.88 KB |\n\n [‹ Logo for 'NBA Salary Cap FAQ'](http://web.archive.org/web/20090406204002/http:/typophile.com/node/56619 \"Go to previous forum topic\") [Land Management Logo ›](http://web.archive.org/web/20090406204002/http:/typophile.com/node/56296 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20090406204002/http://typophile.com/user/37159\" title=\"View user profile.\">Type Fix</a>",
  "time": "<br>",
  "uid": "37159",
  "comments": [
    {
      "time": " 3.Apr.2009 11.17am",
      "content": "A) I can appreciate what you’re TRYING to do, but it’s not working... too crowded, the “g”s look too stressed like that. I kinda like the fan coming off the B\n\nB) Too hard to read the BP, sphere makes no sense whatsoever to a printer. Text Boring (though that may be what they wanted)\n\nC) Nice and clean, but the green color is a little light/weak. Icon is nice, but seems off-center. HATE the stacked version\n\nD) I think i like this one the best, but i hate the Avant Garde (very hard to be original with since the first LaserWriter Plus). Love the icon over the other three. I dunno, maybe the Avant Garde is conveying the “budget” idea after all... but don’t mix it with another face (like on the right). If you do stick with it, Tighten/fix the kerning/letterspacing - as a logo, it’s gotta be PERFECT. Perhaps run the two words together with the color change.\n\n"
    },
    {
      "time": " 3.Apr.2009 2.11pm",
      "content": "Thank you for your suggestions Scott!\n\nI’ve made some changes to these logos. Please let me know what logo is your favorite and why (anyone). If you could change something about that logo what would it be?\n\n"
    },
    {
      "time": " 3.Apr.2009 2.11pm",
      "content": " ![](http://web.archive.org/web/20090406204002im_/http:/typophile.com/files/NEW%20LOGO%20IDEAS_#2_5868.png)\n\n"
    },
    {
      "time": " 3.Apr.2009 7.25pm",
      "content": "The mark in the version B - I’m certain I saw it used in one of existing logos posted on LogoPond not long ago. And that logo was said to resemble the [Elastic Digital](http://web.archive.org/web/20090406204002/http:/logopond.com/gallery/detail/908) one.\n\n"
    },
    {
      "time": " 4.Apr.2009 4.00am",
      "content": "None of them works.  \nSorry.\n\nWhat I would do would be plain type “Budghet Printing” in two lines on negative space (for BW version) with tear paper edge. Would be more suitable and original.\n\nI also think that if you do budget printing your logo should be simple in terms of shapes, type, colours and everything. I’m not saying it should be dull and down to earth trivial. It should be exciting, but budget oriented.\n\nThink of anything that says to you “Budget” and see if you can work out an idea out of it.\n\nYour logos may be ok for some other business (but majorly reworked) just not for your company’s business.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
