{
  "id": "56602",
  "title": "Forgot how to use Fontlab ?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Haven't been using Fontlab for a few weeks so I don't know if I've forgot something or I'm getting mixed up with a another application.\n\nIf a draw a rectangle with the rectangle tool then another rectangle (or any shape) on top of that, shouldn't both the shapes merge together. I'm sure that's the way FL worked but not now.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.png](http://web.archive.org/web/20110527132806/http:/typophile.com/files/Picture%201_232.png) | 19.5 KB |\n\n",
  "author": "<a href=\"/web/20110527132806/http://typophile.com/user/16986\" title=\"View user profile.\">RachelR</a>",
  "time": "<br>",
  "uid": "16986",
  "comments": [
    {
      "time": "",
      "content": "I don't think it's supposed to that automatically. You can merge it manually, though.\n\n"
    },
    {
      "time": "",
      "content": "Only if you select the colour of the rectangle as black, and likewise if if it is white then it will subtract.\n\n"
    },
    {
      "time": "",
      "content": "[Off topic : Rr, I notice that you're in Bristol. Do you know Laurence Penney, who also lives there? Any other Typophilers in the Bristol area?]\n\n"
    },
    {
      "time": "",
      "content": "I checked on an old machine with FL installed and overlapping outlines merged as I expected when I added another shape to the window. Is there a preference or something that would stop this behaviour\n\nThis first image shows a simple glyph made from two outlines.\n\n ![](http://web.archive.org/web/20110527132806im_/http:/typophile.com/files/Picture-1_4977.gif)\n\nIf I add an outline to the same window with the rectangle tool the two outlines are merged. I like working this way because it's a quick way to merge outlines while I can keep a copy of the un-merged outlines in the mask layer.\n\n ![](http://web.archive.org/web/20110527132806im_/http:/typophile.com/files/Picture-2_5619.gif)\n\nJH, I haven't lived in Bristol for a while now, I should update my profile. I didn't know Laurence when I was there or any other Typophilers, I don't know any other Typophilers. I love Tyophile but it's not exactly facebook.\n\n"
    },
    {
      "time": "",
      "content": "I don't know how to set it to do it automatically, but you can just click the Merge Contours button or press ctrl/cmd + F10 instead? ;)\n\n"
    },
    {
      "time": "",
      "content": "\"If I add an outline to the same window with the rectangle tool the two outlines are merged.\"\n\nThis sounds like a bug. I mean, who draws a rectangle in exactly the right place the first time? Merging contours should be a choice during the design phase in my opinion.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "It's a (slightly bizarre) feature, not a bug.\n\nWhen you draw using the primitives tools (rectangle and oval), or using the paint brush, there is a \"paint mode\" that affects what happens when you draw. It doesn't affect the line and curve drawing tools, but it will affect the paths you have already created with them as soon as you use one of the \"paint\" tools (the rectangle, oval, or brush tools). Here is the paint mode selector on the paint toolbar:\n\n ![](http://web.archive.org/web/20110527132806im_/http:/typophile.com/files/paintmode_4611.jpg)\n\nThe modes, from left to right, are:\n\nEmpty color  \nAuto color  \nBlack color  \nWhite color\n\nThese modes affect what happens when you create overlapping shapes with any of the \"paint\" tools. Unfortunately, they also affect any existing overlapping shapes that you have drawn with other tools as soon as you use one of the \"paint\" tools.\n\nTo prevent this automatic merging from happening, be sure that the \"Empty color\" mode is selected. The behavior you're seeing is because one of the other three modes is selected.\n\n"
    },
    {
      "time": "",
      "content": "Oh I see, sorry, no bug. I have never even opened that panel 'cause the regular primitives drawing does not do such 'favors'.\n\nCheers!\n\n"
    }
  ]
}
