{
  "id": "56615",
  "title": "Font for multilingual books",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've just been given the interesting task of redesigning a multilingual book series. The client was talking a lot about TNR Unicode and how it almost covers all the languages needed (Russian, Greek, Arabic, Hebrew, various languages with Latin script but special glyphs…, everything bar Chinese and Japanese). I'd love to be able use some font other than TNR, but is there an option?\n\n",
  "author": "mili",
  "time": "4 Apr 2009 — 12:43am",
  "uid": "7908",
  "comments": [
    {
      "time": "4 Apr 2009 — 1:00am",
      "content": "Warnock Pro, Minion Pro, Garamond Premier Pro and Arno Pro all offer a lot of ground, with latin, greek, cyrillic and a lot special glyphs, no Chinese or Japanese though.\n\ncheerio Queneau\n\n"
    },
    {
      "time": "4 Apr 2009 — 3:13am",
      "content": "Queneau, those don't have Arabic or Hebrew though. I'm working on a font that's designed precisely for situations like this, but it's still a loooong way from being released. Good to know though that it will have a market I suppose.\n\nThough I don't know any off hand, perhaps looking at fonts designed for biblical studies, as they should have at least the hebrew, greek, and latin, and if a font has greek and latin there's no reason it shouldn't have cyrillic as well. Then you'd just have to grab a somewhat matching arabic font.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "4 Apr 2009 — 4:08am",
      "content": "Take Andron.\n\n[http://www.signographie.de/cms/front\\_content.php?idart=282](http://web.archive.org/web/20140804045901/http:/www.signographie.de/cms/front_content.php?idart=282 \"http://www.signographie.de/cms/front\\_content.php?idart=282\")\n\n"
    },
    {
      "time": "4 Apr 2009 — 5:52am",
      "content": "Minion.\n\nWhen we bought CS4, two of the fonts included were (something like) \"Adobe Hebrew\" and \"Adobe Arabic\". Sorry, I'm at home & not planing to go back to work until Monday for once, but somebody can come up with the exact names.\n\nAnyway, the Latin character set included in these fonts turns out to be Minion. To use them as full-blown fonts, you probably don't want to merge just the glyphs into Minion, since they only work as intended with the OT features in the \"special\" fonts. But the size of the characters and their fit will be the same as the Minion Latin characters.\n\nI do a fair bit of special language work with the Latin alphabet. I always use Adobe fonts, for the simple reason that the EULA allows the end user to modify the fonts, subject to some restrictions -- the modified font counts as one of the allowed copies, no redistribution, etc.\n\nSome other foundries allow this as well. I don't know if Miss Tiffany has updated her EULA listings. If you really want to use a certain font, is worth asking the smaller foundries, a few I've talked to (some under the Village umbrella) have no problem with such a EULA.\n\nMaking up \"special characters\" usually involves simply adding a diacritical, which is pretty easy. To have a properly encoded text file for any later \"repurposing,\" you do have to be able to modify the OT features (lookups) to get the characters without a Unicode codepoint, just how depends on the font editing program you use. It isn't that hard with most of them.\n\nHope this helps\n\n"
    },
    {
      "time": "5 Apr 2009 — 11:28pm",
      "content": "Thank you all! The problem seems to be just as difficult as I feared it would be.\n\nAndron surely looks interesting, I'll put that forward for consideration.\n\nAs for Minion, the idea sounds good, but the series will be typeset by different people, and the font should be usable straight from the packet, as most people (myself included) don't have font editing applications.\n\nIf it's TNR Unicode after all, how do I get that for my mac? Do I have to buy a more recent Office package (my current one is X)?\n\n"
    },
    {
      "time": "6 Apr 2009 — 7:29am",
      "content": "Charles: _Anyway, the Latin character set included in these fonts turns out to be Minion. To use them as full-blown fonts, you probably don’t want to merge just the glyphs into Minion, since they only work as intended with the OT features in the “special” fonts. But the size of the characters and their fit will be the same as the Minion Latin characters._\n\nThat's not actually the case. The Minion used in the Adobe Arabic, Adobe Hebrew and Adobe Thai fonts are specially derived instances from the multiple master sources, which in some cases have also been scaled to harmonise with the non-Latin design. The latter were designed, and then we spec'd a width/weight instances of Minion to serve as companion Latin.\n\n"
    },
    {
      "time": "6 Apr 2009 — 8:01am",
      "content": "We're doing a cookbook in English and Polish. It's very easy to do with the default font in TeX.\n\n"
    },
    {
      "time": "6 Apr 2009 — 8:41am",
      "content": "Polish wouldn't be a problem even with InDesign, I've done package designs with Finnish, Swedish, Estonian, Latvian, Lithuanian, Polish, Russian and English in one document with relative ease (space was at the premium, I must admit).\n\n"
    }
  ]
}
