{
  "id": "56624",
  "title": "launching the website?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I built my website in dreamweaver, and now I want to buy a url and host it.\n\nI saw a deal online with Dreamhost that gives me $20 off. Is this good? Does dreamhost do everything?\n\n",
  "author": "fredcastle",
  "time": "4 Apr 2009 — 9:34am",
  "uid": "17767",
  "comments": [
    {
      "time": "4 Apr 2009 — 4:35pm",
      "content": "Dreamhost may not be your best bet for reliable hosting, according to various online sources/forums/boards. _(BUT — I never used them myself, so this is just what I 'heard' and read.)_\n\nI may as well recommend [NameCheap](http://web.archive.org/web/20131020151035/http:/namecheap.com/) _(for 'regular' domains)_ and [Pipni](http://web.archive.org/web/20131020151035/http:/pipni.com/) _(for inexpensive and solid hosting)_.\n\n_(Typophile is hosted by MediaTemple, for example.)_\n\n"
    },
    {
      "time": "5 Apr 2009 — 9:18am",
      "content": "thanks! anyone else?\n\n"
    },
    {
      "time": "5 Apr 2009 — 9:27am",
      "content": "I use Pair.com. Pair is not the cheapest host around, but they have rock-solid secure BSD servers and great customer support.\n\n"
    },
    {
      "time": "5 Apr 2009 — 9:37am",
      "content": "I never thought I'd have to worry about unreliable servers. That means the site could go offline temporarily or something?\n\nI know someone who was having trouble with they're email and mediatemple recently.\n\n"
    },
    {
      "time": "5 Apr 2009 — 9:52am",
      "content": "Mediatemple has a big custom server architecture that went bonkers over a recent weekend. That sort of thing is pretty atypical, and I would imagine that most shared hosting providers are susceptible to it given how complex those can be.\n\n"
    },
    {
      "time": "5 Apr 2009 — 4:32pm",
      "content": "Dreamhost will likely suit your needs. Their offerings are best suited to sites that don't get a \\*lot\\* of traffic (this being in excess of 100,000 visitors daily).\n\nI've hosted a number of sites with them for many years and couldn't be more pleased with the level of service for the price. Mediatemple is another solid host (which I also use), but the real advantages of their offerings aren't realized until you need to handle really substantial traffic or database loads. I'm talking about volume that's inappropriate for their less expensive packages.\n\nThings look bleak when you research hosts of a reasonable size online. The most vocal customer in that business is the upset customer during a temporary outage. Happy customers typically have little reason to say so.\n\nIf you're not really sure and you're deciding between these two, go with Dreamhost. If you outgrow them, it's fairly trivial to migrate to another host like Mediatemple when the need arises.\n\n"
    },
    {
      "time": "5 Apr 2009 — 5:50pm",
      "content": "[www.mister.net](http://web.archive.org/web/20131020151035/http:/www.mister.net/ \"www.mister.net\")  \nI don't have one single thing to complain about 'em.\n\n"
    }
  ]
}
