{
  "id": "56645",
  "title": "What kind of @font-face embedding license would you buy?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I’m considering offering my next release under a license that allows @font-face embedding. For SIFR I expect the user to buy a per-server font license, but for @font-face I think a per web site license is more appropriate. As a designer would you be willing to license a font for every web site you embed it in? And would you object to an @font-face license being priced higher than traditional licenses that allow unrestricted use for static content?\n\n",
  "author": "blank",
  "time": "5 Apr 2009 — 8:29am",
  "uid": "14722",
  "comments": [
    {
      "time": "5 Apr 2009 — 10:31am",
      "content": "James, have you seen the survey that [Ralf](http://web.archive.org/web/20140804021436/http:/typophile.com/wiki/Ralf%20Herrmann) did last year? One of its questions was ‘Which license model would suit you best?’  \n [http://opentype.info/blog/2008/04/19/font-face-survey-results/](http://web.archive.org/web/20140804021436/http:/opentype.info/blog/2008/04/19/font-face-survey-results/ \"http://opentype.info/blog/2008/04/19/font-face-survey-results/\")  \nF\n\n"
    },
    {
      "time": "5 Apr 2009 — 10:52am",
      "content": "Somehow I never saw that survey. Thanks!\n\n"
    },
    {
      "time": "5 Apr 2009 — 4:00pm",
      "content": "Tracking.\n\nAnd to save readers a step, [@font-face embedding](http://web.archive.org/web/20140804021436/http:/webfonts.info/wiki/index.php?title=Fonts_available_for_%40font-face_embedding).\n\n"
    },
    {
      "time": "6 Apr 2009 — 11:45am",
      "content": "<cite> For SIFR I expect the user to buy a per-server font license, but for @font-face I think a per web site license is more appropriate. </cite>\n\nWhy do you make a difference between the two?\n\n<cite>As a designer would you be willing to license a font for every web site you embed it in? And would you object to an @font-face license being priced higher than traditional licenses that allow unrestricted use for static content?</cite>\n\nWell, if you <cite>ask</cite> the users, they would probably say that a normal license should allow @font-face usage without any extra costs. The real question is: Will the pay extra when they have no other option? But that really depends on the font and (in most cases) the client of the designer.  \nA large corporation with a unique corporate font will probably be very happy to use their font online, even if they would have to pay an expensive server/website/annual fee. But for a fancy display font you might rather want to reach other users (but a lot of them) like bloggers who pay tiny fee.  \nIt's really hard to say at the moment. We usually establish the right price for something by comparison, but there is market for @font-face yet. So some vendors need to step forward and just try out different models.\n\n"
    },
    {
      "time": "6 Apr 2009 — 12:27pm",
      "content": "<cite>Why do you make a difference between the two?</cite>\n\nBecause SIFR does all the rendering server side while @font-face is redistributing my fonts for client-side rendering. And SIFR isn’t sending copies of my font to anyone who downloads it.\n\n"
    },
    {
      "time": "6 Apr 2009 — 12:39pm",
      "content": "Sure, but that's just the technical background. I understand your logic, but as a normal user I wouldn't understand why you would charge sIFR on a server basis and @font-face on a website basis. I wouln't care where the font the is rendered.\n\n"
    }
  ]
}
