{
  "id": "5667",
  "title": "Sequential Communications - Logo Refresh",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,   \n   \nI am extremely glad I stumbled across this forum. I've read a great deal of posts, and am extremely impressed by the quantity and quality of feedback.   \n   \nMaybe I could ask for your help. I designed this logo for my own freelancing business, but I think it could use an update.   \n   \nI want to emphasize the notion of sequentiality, building, and progression in the logo.   \n   \nMy second goal is to use a more modern design and (especially) typeface. I don't think I really like this font as much as I did when I designed the logo a while ago.   \n   \nThanks for any assistance rendered!   \n   \n ![Sequential Communications Logo](http://web.archive.org/web/20131020042213im_/http:/www.typophile.com/forums/messages/29/40873.jpg)\n\n",
  "author": "squigee",
  "time": "16 Jul 2004 — 2:26pm",
  "uid": "4238",
  "comments": [
    {
      "time": "16 Jul 2004 — 6:31pm",
      "content": "Nice start. colors look good together. Dots have been done a lot in the dot com boom, but I have not seen them done exactly in this sequence/composition. I am not sure, but perhaps a bit dated? I still like it. \"ti\" seem a little small. bowl on \"a\" a bit large with respect to negatiev space above bowl. \"o\"'s a bit small, should usually reach a bit above and below x-height. perhaps most characters are same width, they need to be optically adjusted. As is \"n\"s and \"u\" seem toog big as the negative space within the characters open it up too much. Try to un-focus your eyes as you look at this and you will notice these characters stand out from rest.   \nI personally like when letters with long verticals align, but this is not always possible.\n\n"
    },
    {
      "time": "17 Jul 2004 — 4:24am",
      "content": "Why is it Sequential, what does that mean? Maybe what you need is a tagline to frame the context of what Sequential Communications is/are.\n\n"
    },
    {
      "time": "17 Jul 2004 — 5:07pm",
      "content": "Ole,   \n   \nThanks for the tips about the font. I think that a complete change might be in order. Do you have any suggestions/names?   \n   \nDaniel,   \n   \nSequential was only chosen because I liked the name. As I mentioned above, I like the connotation of progression and building. As for a tagline, I suppose I left one out because I was concerned about overcrowding the visual space. Even so, I'm not sure what to add. I don't really specialize in anything and I almost feel like adding a tagline would be redundant...   \n   \nThanks for the comments so far!\n\n"
    },
    {
      "time": "17 Jul 2004 — 5:08pm",
      "content": "Sorry, double post!\n\n"
    }
  ]
}
