{
  "id": "56686",
  "title": "Sketches for a hangul text face",
  "forum": "Jongseong's blog",
  "tags": [

  ],
  "content": "Knowing fully well that there is no way I'll get the time to design a complete hangul (Korean alphabet) typeface in the foreseeable future, I started sketching out an idea for a hangul typeface that I had been carrying around in my head.\n\n ![](http://web.archive.org/web/20150124180151im_/http:/typophile.com/files/Hangaram_4476.gif)\n\nI'm just drawing around a dozen test glyphs. At this point, I'm most concerned with getting the basic proportions right. It's too early to fine-tune the stroke widths in the individual glyphs.\n\nThis would be a low-contrast serif text face, quite a bit darker than the text faces usually seen in Korean books. The biggest departure from the usual hangul faces of this genre is that for the moment I'm planning to do away with the 'serifs' on the ㅇ (the circular letter) completely. The glyphs are on the narrow side, with simplified and open forms intended to make it work for smaller point sizes. I've tried two different approaches for the 오: the first where the ㅇ and the ㅗ are connected and the connection vastly simplified, and the second where they are kept separate.\n\nI've no idea where I'll go from here, but it's fun designing hangul and I wanted to share.\n\n",
  "author": "Jongseong",
  "time": "6 Apr 2009 — 12:39pm",
  "uid": "12009",
  "comments": [
    {
      "time": "7 Apr 2009 — 3:27am",
      "content": "nice!\n\n"
    },
    {
      "time": "7 Apr 2009 — 5:36am",
      "content": "I know nothing about hangul script, but just looking at it as glyph design it feels to me like there's an inconsistency between the circular part and the other strokes. The others have a brush feel, and the circle does not.\n\nI just looked at the Wikipedia article on hangul, and I see that the circle comes from cursive where as the rest comes from the straight Chinese brush style. So I guess its an inherent problem getting it to look right. I see in the article that some of the circles are a longer ellipse, which looks more harmonious in the illustration in the article.\n\nI guess my feeling is that if the straight strokes look brushed--and they look lovely--then the circle should have more of that look for consistency of look.\n\n"
    },
    {
      "time": "7 Apr 2009 — 6:16am",
      "content": "Thanks for the comments, William. The circular letter ㅇ is indeed problematic. Most of today's hangul text faces add a tiny entry stroke to the ㅇ, as in the sample of Batang below:\n\n ![](http://web.archive.org/web/20150124180151im_/http:/typophile.com/files/ieung_4019.gif)\n\nThis solution isn't satisfactory for me because of the problems it causes in small sizes distinguishing between such pairs as 흥 and 훙, as shown above. Also, I would prefer my typeface to be extended to cover obsolete letters, among them ㆁ, which is a ㅇ with a small vertical stroke on top. A ㅇ with an entry stroke would be too easily confused with ㆁ.\n\nThe entry stroke on the ㅇ must be a recent innovation, because I don't recall seeing a pre-20th-century hangul typeface having this feature. The following is from _Oryun Haengsildo_ ('Illustrated Acts of the Five Relationships') of 1797, and shows ㅇ without any entry strokes.\n\n ![](http://web.archive.org/web/20150124180151im_/http:/typophile.com/files/oryun_4086.gif)\n\nI think it may have been the type designer Choe Jeongho who popularized if not invented the entry stroke on the ㅇ, presumably to make it look like it was written with a brush so that it would harmonize better with the other letters. Ironically, when actually writing hangul with a brush, this entry stroke appears only in some really cursive styles.\n\nI'll have to find a way to harmonize the ㅇ with the other letters without adding an entry stroke, perhaps by making the shape slightly more irregular. Perhaps I can do something with the counter shape to suggest the movement of a brush. Making the circles a longer ellipse, while widely applied on sans-serif designs, isn't really appropriate for this style, though.\n\n"
    },
    {
      "time": "7 Apr 2009 — 6:36am",
      "content": "I think you're right that the entry stroke does not make it consistent. I see the straight strokes are brushed top to bottom, left to right, so perhaps the circle can reflect that.\n\nGiving it some kind of asymmetry and molding may work. Also it's very tricky getting the weights of everything just right. This is one of the big issues in Roman type also--getting the round and straight strokes to play with each other happily.\n\n"
    },
    {
      "time": "7 Apr 2009 — 7:24am",
      "content": "Do you think breaking the strict left-right symmetry and going for an oblique stress may be a step in the right direction? Excuse the rough curves, but here's a quick sketch, with the old shapes for comparison on the right. I've never seen this oblique stress in a hangul text face, but in a way it recalls how the circular letter is formed when writing with a brush—by making two crescent-shaped strokes.\n\n ![](http://web.archive.org/web/20150124180151im_/http:/typophile.com/files/hano_4943.gif)\n\n"
    },
    {
      "time": "7 Apr 2009 — 7:27am",
      "content": "Yeah, the one on the left!\n\n"
    },
    {
      "time": "7 Apr 2009 — 8:28am",
      "content": "Yes, to my eyes, the one on the left is much better. I think it needs some more massaging, but yeah, that's it. That's what I was thinking of: the o shape should reflect the assymetry of the top down and left to right brush strokes.\n\nIf it hasn't been done before, then I think you've really got an improvement. You might try experimenting with a brush, to get ideas, though the final form you'll probably end up not being strictly by the brush.\n\nOf course, I'm looking at it with eyes accustomed to looking at latin type, so you'd need to see how those accustomed to reading Hangul script react, once you're happy with it.\n\n"
    },
    {
      "time": "7 Apr 2009 — 9:06am",
      "content": "I like the one on the left as well, once you ignore the uneven curves. I should probably see it in print to judge it properly, but on screen at least the oblique stress holds up surprisingly well.\n\nAs to why this hasn't been tried before, I'm not sure but I can guess that it's because it doesn't work well with the entry stroke.\n\n<cite>You might try experimenting with a brush, to get ideas, though the final form you’ll probably end up not being strictly by the brush.</cite>\n\nI haven't picked up a brush to write hangul in over a decade! But yeah, it's a good idea to experiment with different forms that way. The ㅇ comes to resemble an almost triangular shape in some writing styles, although that would be too distracting for a contemporary text face.\n\n"
    },
    {
      "time": "20 Jun 2009 — 1:25am",
      "content": "Hello, Jongseong.\n\nI came across this post while I was searching for a way to replace the ugly Korean system fonts installed by default in the Ubuntu Linux distribution, and found the discussions of Korean typeface on the forum very fascinating.\n\nI'm a fairly proficient non-native Korean speaker, and when I write a ㅇ (with a ball-point pen), not only is the stress obliquely centered on the upper right and lower left as you showed in your second illustration, but the ellipse itself is oriented obliquely. I think the obliqueness of the stressed portions of your ㅇ show its connection to a brush style, and I definitely agree with your decision to remove the top entry stroke, for the reasons that you pointed out above.\n\nHave you done any more tinkering with this typeface since your last post? I'm interested in seeing more.\n\n"
    },
    {
      "time": "23 Jun 2009 — 4:08am",
      "content": "Thanks Jeff, for that post. Sorry I didn't see it until now.\n\nI think in most examples of proficient handwriting (at least of the older generation), the ㅇ becomes an oblique ellipse as you described. Also, horizontal strokes will tend to slant upwards. This reflects writing speed. A text typeface will need to have a more static form, but just a touch of the obliqueness may make the design more lively.\n\nI'm glad you agree with dropping the top entry stroke. It's a pretty radical decision, so I would like to hear what people think about it.\n\nAs you might imagine, designing a Korean typeface is a time-consuming process. As I am a beginner, I'll have to figure everything out from scratch.\n\nI posted some proofs from a couple of weeks after my original post here in [this blog post](http://web.archive.org/web/20150124180151/http:/typophile.com/node/57311). It has been worked on since, but most of the work has been on setting up scripts to generate variations of the different consonants and vowels to be composed into the syllables. It's programming work  \nmostly; not much I can show at this point.\n\nI'm juggling a number of different, mostly non-Korean original typeface designs in my spare time, so I'm afraid progress will be very slow.\n\n"
    }
  ]
}
