{
  "id": "56695",
  "title": "Compile problem in OpenType Panel",
  "forum": "Build",
  "tags": [

  ],
  "content": "I need help to solve this problem. When I do “Compile” in the OpenType Panel I get this error message. I encounter this for the first time. I just want to test my OpenType feature in FL from my Black slab weight. The feature has been already used with success in other weight from that typeface family. Hoping somebody can help me. Thanks\n\nAndré\n\n ![](http://web.archive.org/web/20100203171849im_/http:/typophile.com/files/OTF_error_4107.png)\n\n",
  "author": "<a href=\"/web/20100203171849/http://typophile.com/user/5264\" title=\"View user profile.\">sim</a>",
  "time": "<br>",
  "uid": "5264",
  "comments": [
    {
      "time": "",
      "content": "I've seen this happen before, although I'm not sure how it happens. You've somehow got two glyphs (\"Q\") with the same unicode value. You need to change the unicode value of one of them (probably to unencoded if it's an alternate).\n\n"
    },
    {
      "time": "",
      "content": "After a closer look at each glyph, it seems there is no two “Q” with the same unicode value. What I've tried is to clear all unicode value and the problem seems to be solved, hoping that won't cause other problem.\n\nThanks Mark\n\nAndré\n\n"
    },
    {
      "time": "",
      "content": "When you said you have cleared all unicode values, you don't mean from each glyph, do you?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Andre,\n\nthere seems to be a problem in your OpenType panel. Please zip your .vfb file and attach it to the problem report at [http://www.fontlab.com/support/problem/](http://web.archive.org/web/20100203171849/http:/www.fontlab.com/support/problem/ \"http://www.fontlab.com/support/problem/\")\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "",
      "content": "\\> When you said you have cleared all unicode values, you don’t mean from each glyph, do you?\n\nYes I did, but I did that on a copy of my .vfb file.\n\nAndré\n\n"
    },
    {
      "time": "",
      "content": "To Adam\n\nI will send the file today. Thanks\n\nAndré\n\n"
    },
    {
      "time": "",
      "content": "Thanks to FontLab to solved the problem. I really had two Q. They suggested to look at my vbf file in the Index mode and the second Q was there. How this happened I have no idea, but when I've delete it, I was able to work with the OTF preview menu. The second Q was'nt visible in the Name mode neither in the Unicode one.\n\nThanks again :^)\n\nAndré\n\n"
    },
    {
      "time": "",
      "content": "You can also do a search for glyphs that begin with \"Q\".\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Helpfull Chris. Also thanks to you for that tips.\n\nAndré\n\n"
    }
  ]
}
