{
  "id": "56701",
  "title": "Much Ado about the legibility and spacing with Xerox Sans",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello, my fellow typophiles,\n\nI would like to invite you all to talk about Xerox Sans, a customized typeface based on FS Albert by FontSmith for Xerox. (Before writing this post, I already Googled the Typohile.com for Xerox Sans, and only found people talked about the logo wordmark in an old thread about Xerox’s rebranding).\n\nA couple days ago, I stumbled upon a [document at Xerox.com](http://web.archive.org/web/20140804094634/http:/www.xerox.com/downloads/usa/en/x/xerox_corp_capabilities_web.pdf) in which Xerox Sans is embedded. Out of typographic interest, I discussed a little about it with one of my friends (he is a visual communication professor in a university and a nonprofessional type designer). Personally, I like the Xerox Sans as much as FS Smith, but I don't think it’s optimal for Xerox as such a giant multinational company to use this soft, friendly and approachable typeface for its corporate branding. (I don’t like the GE Inspira too much.)\n\nA snapshot of the document:\n\n ![](http://web.archive.org/web/20140804094634im_/http:/typophile.com/files/xeroxsans_4479.png)\n\nHowever, my friend pointed out that Xerox Sans has severe problems with lowercase “a”& “o” and the tight & inconsistent spacing between letters. He did a “blurring test” to back up his opinion on the “a””o ”legibility problem, as shown below:\n\n ![](http://web.archive.org/web/20140804094634im_/http:/typophile.com/files/blurring%20test_6232.jpg)\n\nEssentially, he believes it at least takes 10 years to prove that one-story design of lowercase “a” in a sans serif typeface has good legibility (My friend think FontSmith should pick up two-story design with “a” instead of the single-story).\n\nOne of his major claim is no other popular and successful typefaces with good legibility have taken on the two-story design with “a” (and “g”). And he reckons that Xerox Sans has its ancestry in FF Meta (his point is FF Meta is the progenitor of ALL humanist sans serifs).\n\nI think the “a”and “o”is OK with the legibility (as in FS Albert and GE Inspira and others), and spacing is indeed tight in a way like Nokia Sans does. But I don’t know why he insist saying the spacing between letters is NOT inconsistent.\n\nSo, I would like to know what you think of Xerox Sans with its legibility and spacing. Thanks. (Sorry about this lengthy post)\n\nRegards,\n\nJZ\n\n",
  "author": "metaspace",
  "time": "7 Apr 2009 — 1:30am",
  "uid": "35965",
  "comments": [
    {
      "time": "7 Apr 2009 — 2:04am",
      "content": "Just to get this straight, your main questions are:\n\n– Single or double story a?  \n– Is spacing too tight and/or inconsitant?\n\nAm I right?\n\nWell the blur test seems to be very much in favour of the double story a, though I don't know if there are other tests for legibility (other typophiles probably know more. If this is used for the web (using font-embedding technology), I would have a look at the system fonts by [Matthew Carter](http://web.archive.org/web/20140804094634/http:/new.myfonts.com/search/matthew+carter/fonts), like Verdana and Tahoma. They have to be legible at small sizes and crude resolution, and they all seem to have a double-story a. This seems to indicate it is more legible. Several fonts by Spiekermann, like Meta, Officina, Info have been used a lot in signage, where legibility is a crucial factor as well. These also all have a double-story a. So I guess this is the better way to go in terms of legibility.\n\nAs for spacing, I do think it looks pretty tightly spaced, a bit choked up. Giving it more space to breathe would surely benifit legibility. But other experts probably fill you in on specific details.\n\ncheerio Queneau\n\n"
    },
    {
      "time": "7 Apr 2009 — 2:30am",
      "content": "Another question: You took a screenshot/capture off of a .pdf document, probably ment for printing? I don't/wouldn't really wonder about any problems _(weight or spacing)_ with on-screen showings. Adobe Reader is quite famous for not 'getting' it right, on screen. (Sooo — If this is ment to be print out, you should check with how it looks printed and compare the spacing again.)\n\n"
    },
    {
      "time": "7 Apr 2009 — 4:41am",
      "content": "@Queneau\n\nThanks for sharing your thoughts.:-) My words are sort of verbose. If I could desig my own typeface, I will favor the two-story \"a\" & \"g\" design. I want to point out that Xerox Sans is not a system font, like Georgia or Verdana. It's Xerox's corporate typeface which might show up on everything Xerox from corporate brochures to business cards (I tend to think so) except for the web. Aside pixelated Xerox Sans, Arial is still the web font at Xerox.com.\n\nI know Meta, Info and Officina use the more legible 2-story design of \"a\" & \"g\". Looks like there is a little difference between these Spiekersans and Xerox Sans. As I said before, Xerox Sans' legibility is OK for me, but it won't be legible at extreme point size.\n\nI don't know if the blurring test is one of measurment metrics for a typeface's legibility. Any info will be much appreciated.\n\n@David\n\nThanks for your input. :-) I will give it a try later.\n\nJZ\n\n"
    },
    {
      "time": "7 Apr 2009 — 6:46am",
      "content": "I think I have to agree that a double-story a and g are preferred when it comes to legibility. Basicallly, the more differentiation there is between letters, the better it reads. A one-story a could obviously be confused with an o. Although in practise you'll notice that you can perfectly read the texts set in Xerox Sans. But when you're talking about _immersive_ reading (which happens almost subconsiously) I think it could be detrimental.\n\nIf you're interested in what happens when we read and how this ties in with typefaces, read Gerard Unger's book 'While you're reading'. He goes into these kind of aspects as well.\n\n"
    },
    {
      "time": "7 Apr 2009 — 7:12am",
      "content": "Keep in mind that while type designers love to ponce on about the finer details of spacing and legibility they aren’t always so important. Sure this stuff is a big deal for a face like Clearview HWY that’s not set by typographers and is read from a distance while moving. But Xerox Sans is being read by people sitting down with a bright light and all the time they need to spot each word. Maybe readers will need an extra tenth of a second here or there to recognize a three-syllable word that contains a and o, but otherwise that single-story a is irrelevant. And I really doubt anyone is reading corporate documents under conditions that resemble a gaussian blur, no matter how convenient it is to whip one up and pretend it proves a point.\n\n"
    },
    {
      "time": "7 Apr 2009 — 7:39am",
      "content": "Is a double-storey g really clearly more preferable in a sans-serif design? A single-storey g wouldn't really be confused with any other letter, and there are several established designs (including most grotesques) that combine a double-storey a with a single-storey g. Personally, I find the double-storey g more classic-looking, but it does add unwelcome clutter in small sizes. There are arguments for and against both forms of g in sans-serif designs, but I wouldn't say one clearly wins out over the other in terms of readability.\n\n"
    },
    {
      "time": "7 Apr 2009 — 8:57am",
      "content": "I think the little hook on the tail of the \"a\" does the job.  \nBut the \"t\" is a bit gappy.\n\n"
    },
    {
      "time": "7 Apr 2009 — 9:17am",
      "content": "What does the 'blur test' demonstrate? That one typeface is less legible than the other _when blurred._ Unless the document you are reading happens to be blurred, how relevant is this observation to readability?\n\n"
    },
    {
      "time": "7 Apr 2009 — 10:03am",
      "content": " ![](http://web.archive.org/web/20140804094634im_/http:/typophile.com/files/Noise_6713.jpg)\n  \nFutura, noise filter. \n"
    },
    {
      "time": "7 Apr 2009 — 10:15am",
      "content": "<cite>Personally, I like the Xerox Sans as much as FS Smith, but I don’t think it’s optimal for Xerox as such a giant multinational company to use this soft, friendly and approachable typeface for its corporate branding.</cite>\n\nStructure and spacing issues aside, can you elaborate about what isn't optimal about a giant multinational corporation using a friendly, approachable typeface?\n\n"
    },
    {
      "time": "7 Apr 2009 — 10:39am",
      "content": " ![](http://web.archive.org/web/20140804094634im_/http:/typophile.com/files/filter_5586.jpg)\n  \nAvant Garde, Ocean Ripple and Lens Flare. \n"
    },
    {
      "time": "7 Apr 2009 — 11:42am",
      "content": "<cite>…can you elaborate about what isn’t optimal about a giant multinational corporation using a friendly, approachable typeface?</cite>\n\nEverybody knows that corporations are inhuman and oppressive agents of the system. It isn’t right for them to appear friendly and approachable! How else will we distinguish the work we do for nonprofits so we can win design awards?\n\n"
    },
    {
      "time": "8 Apr 2009 — 9:18pm",
      "content": "Thanks for you guys' feedback.\n\n@JP\n\nI agreed with you. Xerox Sans is merely a customized typeface for a corporation, which is slightly different from the mainstream commercial typefaces. So it doesn't need to go through a gaussian blur in the designing process. It's understandable that my friend split Xerox Sans's hair and insist saying the failed blur test undermines Xerox Sans' legbility because type deisgn runs through his blood. Blur test is one of knee-jerk reactions when he spot a new typeface.:-)\n\n@Jongseong\n\nI also know some typefaces take one-story \"g\" along with two-story \"a\". And there are also other typefaces which use two-story design \"a\" and \"g\", say E-Types Press Sans. I think a two-story \"g\" probably add some readability noise in text. With your reminder, I'd better reconsider the design of \"g\" for myself.\n\n@Nick\n\nThe little charming tail does the job in the way the same tail in Truvia's logo, shown below:-) (I don't know what typeface it is.):\n\n ![](http://web.archive.org/web/20140804094634im_/http:/typophile.com/files/Truvia_Logo_Sm_3654.jpg)\n\nAnd blurred Futura looks \"nice\".\n\n@John\n\nFor me, a blur test is irrelevant to one typeface's legibility and readability. I think my friend did the \"blur test\" only to butress his own opinion that ALL classic, popular and successful (sans serif) typefaces stick with the one-story design of \"a\". He's a little typographically draconian.\n\n@Jackson\n\nJP said exactly what I wanted to say in response to your question.\n\n@Eliason\n\nThanks for your picture, it's informative.\n\n@JP\n\nThanks for your nice remarks.:-)\n\nJamesZ\n\n"
    }
  ]
}
