{
  "id": "56718",
  "title": "Cronos by Robert Slimbach",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Nice to meet you all. I'm a growing typo-addicts and wish to acquire some knowledge based on this typeface. I wish this question wasn't brought onto the forum before and hopefully it isn't a sensitive subject, as the topic is a fairly censored conspiracy.\n\nI was browsing fonts for a better knowledge of san-serifs and I laid my eyes on this typeface.\n\nIt is really interesting of how Robert Slimbach created this typeface with such a calligraphic influence. I believed it is one of favorites for typefaces I may use in the future.\n\nUpon further research of Slimbach, I found out that he was obsessed with revivals and calligraphic nature of the older typefaces such as Garamond. However, a lot of books and information online did not mention how he concludes his design on cronos.\n\nThen I ran into an invisible filter that covers all the backgrounds of this typeface. I did not found out much but supposedly it was a copy of the typeface, Today San Serif, by Scangraphic. Yet Adobe declared Cronos was an original face developed by Slimbach himself.\n\nI wish to find out more information about this typeface and its relationship with the \"original\" and the \"Slimbach's version\". I hope the fellow typographers can direct me to some books or other sources to find out more information.\n\nThanks you for your time!\n\n",
  "author": "haletx2amehk",
  "time": "7 Apr 2009 — 6:10am",
  "uid": "43360",
  "comments": [
    {
      "time": "7 Apr 2009 — 9:43am",
      "content": "Countdown to nutty responses from Uli and Bill in 10…9…8…7…\n\n"
    },
    {
      "time": "7 Apr 2009 — 11:40am",
      "content": "\"Then I ran into an invisible filter\"\n\nwhoa.\n\n"
    },
    {
      "time": "7 Apr 2009 — 6:06pm",
      "content": "This has been discussed here before. And this \"invisible filter\" must be Luc.\n\n[Today Sans B/H/SB/SH ?](http://web.archive.org/web/20130306055541/http:/typophile.com/node/18567)\n\n"
    },
    {
      "time": "7 Apr 2009 — 8:22pm",
      "content": "Oh wow.\n\nThanks Miss Tiffany for the link.\n\n"
    },
    {
      "time": "7 Apr 2009 — 8:47pm",
      "content": "\\> Upon further research of Slimbach, I found out that he was obsessed...\n\nobsessed???\n\nRobert Slimbach, who joined Adobe in 1987, began working seriously on type and calligraphy four years earlier in the type drawing department of Autologic in Newbury Park, California. Since then, he has concentrated primarily on designing text faces for digital technology, drawing inspiration from classical sources. In 1991, he received the Prix Charles Peignot from Association Typographique Internationale for excellence in type design. Slimbach now directs Adobe's type design program. He has designed typefaces for the International Typeface Corporation, as well as the Adobe® Originals families Arno™, Brioso™, Caflisch Script®, Cronos®, Adobe Garamond®, Garamond Premier, Adobe Jenson®, Kepler®, Minion®, Poetica®, Sanvito®, Utopia®, Warnock®, and Myriad® (co-designed with Carol Twombly).\n\n[http://store1.adobe.com/cfusion/store/html/index.cfm?event=displayDesign...](http://web.archive.org/web/20130306055541/http:/store1.adobe.com/cfusion/store/html/index.cfm?event=displayDesignerInfo&code=SLIM&store=OLS-US \"http://store1.adobe.com/cfusion/store/html/index.cfm?event=displayDesignerInfo&code=SLIM&store=OLS-US\")\n\nCreated by Adobe type designer Robert Slimbach, Cronos is a new sans serif typeface family that embodies the warmth and readability of oldstyle roman typefaces. Because it derives much of its appearance from the calligraphically inspired type of the Italian Renaissance, Cronos has an almost handwritten appearance, setting it apart from most other sans serif designs and making it an effective choice for text composition. The italic design was inspired by early chancery style italics and is both elegant and distinguished.\n\n[http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=...](http://web.archive.org/web/20130306055541/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1733 \"http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1733\")\n\n"
    },
    {
      "time": "10 Apr 2009 — 12:57pm",
      "content": "I've never thought Bill's comments were nutty. I actually find them to be among the more interesting comments here on Typo.....\n\n"
    },
    {
      "time": "10 Apr 2009 — 1:18pm",
      "content": "My local Giant supermarket switched over to Chronos for all their signage. I don't know about its relationship to Today, but I find it a little annoying, though generally I'm a big fan of Slimbach. Is it just me, or do others see some kind of forced or false bonhomie about it. To me its softness feels laid-on, rather than organic. Of course the whole thing is very well drawn, but I still find it off-putting.\n\n"
    },
    {
      "time": "14 Apr 2009 — 6:41am",
      "content": "I find him quite obsessed with the typography history.(which I love, by the way). If you go on google book or something and search his name, there are a lot of mini-articles about him. I've read through his research on Garamond and Jenson, they are very fascinating to me. That he actually traveled around europe to find original prints and cuts, then redraw them, then, again, uses the historic calligraphic knowledge of his to determine Garamond's italics.\n\nSo, yeah, he's awesome like that in my opinion, haha.\n\n"
    },
    {
      "time": "14 Apr 2009 — 3:52pm",
      "content": "I really want to like Cronos, I really do. But I have yet to find any use for it. What's worse than having a typeface that you have no use for? Having 32 cuts of the same typeface.\n\n"
    }
  ]
}
