{
  "id": "56721",
  "title": "Who knows what this is? Wired uk",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Wired has just re-launched its uk imprint.  \nWho knows what this display face is?\n\n ![](http://web.archive.org/web/20150330072602im_/http:/typophile.com/files/test-Type_4956.jpeg)\n\n",
  "author": "Mr Brown",
  "time": "7 Apr 2009 — 6:38am",
  "uid": "12942",
  "comments": [
    {
      "time": "7 Apr 2009 — 10:01am",
      "content": "That seems to be a version of an old film type called \"Zelda\", shown in the Dover book \"Moderne Alphabets\" by Dan X. Solo. In the book it is shown as two-color lettering, with one part dark and the other light.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "7 Apr 2009 — 10:22am",
      "content": "Actually, the original name is \"Zelek\". \"Zelda\" is probably one of those \"similar to\" fonts.\n\n"
    },
    {
      "time": "7 Apr 2009 — 10:46am",
      "content": "Where did you find that Mark? We only have three letters here, and Zelda matches them exactly. I know Solo sometimes renamed typefaces.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "7 Apr 2009 — 1:32pm",
      "content": "I have a Mecanorma catalog from the early '70s where it is called Zelek Black. Bronislaw Zelek is credited as its designer. There were also some related fonts, Zelek Shadline, Zelek Bold, and Zelek Boldline. There is also another face he did called New Zelek that pops up here now and then.\n\nSolo probably didn't rename it. \"Zelda\" probably came from a pirate source, which was quite common if you look through catalogs from back in the film font days, even from major typesetting houses.\n\n"
    },
    {
      "time": "9 Apr 2009 — 5:22am",
      "content": "I think, it's all explained here:  \n [http://www.spd.org/2009/03/new-work-wired-uk.php](http://web.archive.org/web/20150330072602/http:/www.spd.org/2009/03/new-work-wired-uk.php \"http://www.spd.org/2009/03/new-work-wired-uk.php\")\n\n"
    },
    {
      "time": "9 Apr 2009 — 6:00am",
      "content": "I guess they're using the term \"Letraset\" generically, as in \"rub down type\". Letraset never carried Zelek, only Mecanorma as far as I know. The only difference I can see is that the lines dividing the shapes in the letters are thicker than in the original.\n\n"
    },
    {
      "time": "16 Nov 2009 — 1:57pm",
      "content": "Hi, I redrew this typeface for Wired UK, I found it in an old Typaedia catalogue although it was named 'Zoro', I couldn't find a digital version and I didn't know who originally created it. Great to find out it was Bronislaw Zelek, thanks Mark.\n\nRegards  \nSimon\n\n"
    }
  ]
}
