{
  "id": "56739",
  "title": "Drawing a river in InDesign",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Dear Typophiles,\n\nI realise this is more cartography than typography but thought someone might be able to help. I have to redraw a map using InDesign (or Photoshop I suppose). It exists only as a flipchart with marker pen drawing.\n\nThe map contains type and normal map icons such as hills and houses. There is a river on the map. I want to have the river growing in width as it nears the sea. I don't think a stroke can change width along its length so is there another way I can draw the line with a uniformly expanding width?\n\nThanks in advance :)\n\n",
  "author": "Bendy",
  "time": "7 Apr 2009 — 10:14am",
  "uid": "20652",
  "comments": [
    {
      "time": "7 Apr 2009 — 11:32am",
      "content": "Draw the map in **illustrator**.  \nDraw the river as a stroke, outline it, draw the river growing as a polygon and compound them.  \nOr leave them as to objects...\n\n"
    },
    {
      "time": "7 Apr 2009 — 12:20pm",
      "content": "What Allimac said.  \nUsually what I do (I love making maps) is draw the rough basis as a stroke, then duplicate the layer just to make sure, outline the stroke and manually edit the outlines (because depending on map style, a river especially might actually look better when it's not \"mathematically correctly\" growing in width).  \nBut yeah, definitely do it in Illustrator. Hell, you could even do it in FontLab. ;-)\n\n"
    },
    {
      "time": "7 Apr 2009 — 12:56pm",
      "content": "_you could even do it in FontLab._\n\nI've never bothered purchasing Illustrator, because I don't usually do the kind of work for which it would be useful. But very occasionally I do have a need to create a vector graphic. This is how my wife's wedding ring came to be designed in FontLab :)\n\n"
    },
    {
      "time": "7 Apr 2009 — 1:26pm",
      "content": "Use illustrator you have way more options then indesign, fontlab, and, photoshop.  \nObject-\\>Path-\\>Outline stroke\n\nGuerrizmo+Design  \nNo man is an island unto himself\\_John Donne\n\n"
    },
    {
      "time": "7 Apr 2009 — 4:13pm",
      "content": "This is the only kind of river you can get in InDesign :)\n\n ![](http://web.archive.org/web/20140804014746im_/http:/typophile.com/files/river_5550.gif)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20140804014746/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    },
    {
      "time": "7 Apr 2009 — 4:20pm",
      "content": "I thought it might be better to use Illustrator. I've only played with it a few times years ago and couldn't get tot grips with it. I need to get over that and download a trial of Illustrator I guess.\n\nI used InDesign to make a street map of central Bangkok this week (will post if anyone's interested) and liked the result so thought it could be ok to try rivers with it too.\n\nNot sure Fontlab will solve the problem as I need to design the river around the non-vector parts of the map.\n\nThanks for the tips, will play with it and post what happens.\n\n"
    },
    {
      "time": "7 Apr 2009 — 4:22pm",
      "content": "That is clever typography! I wonder how that would be set up in InDesign...can't be columns, just manual spacing I guess. Nice.\n\n"
    },
    {
      "time": "7 Apr 2009 — 4:31pm",
      "content": "Ben: It's just a simple text wrap applied to a shape that I put here to mimic the appearance of typographic \"rivers\" — unwanted gaps running through a block of text.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20140804014746/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "8 Apr 2009 — 5:09am",
      "content": "Ivan: FWIW, the same trick can (more or less) be pulled without leaving Word...\n\n ![](http://web.archive.org/web/20140804014746im_/http:/typophile.com/files/wordrivers_5206.JPG)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working. \n"
    },
    {
      "time": "8 Apr 2009 — 4:17pm",
      "content": "Leaving word? I don't even have it installed :)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20140804014746/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "9 Apr 2009 — 1:02am",
      "content": "LOL! What luxury...\n\n"
    },
    {
      "time": "9 Apr 2009 — 9:43am",
      "content": "Why not just DRAW the river with the pen tool, instead of fiddling around with strokes?\n\nStrokes are a pain in the ass, they are unreliable. Just trace the contours of the river with the pen tool, then remove any strokes and fill the shape with a solid color?\n\n"
    },
    {
      "time": "9 Apr 2009 — 10:24am",
      "content": "<cite>\"Why not just DRAW the river with the pen tool\"</cite>  \n?  \nI meant draw it, with the pen tool; just as one fat line. Then expand the stroke so you get contours, and fiddle with those. Of course you can just draw the individual contours to begin with; I've found I'm much faster the other way.\n\n"
    },
    {
      "time": "10 Apr 2009 — 4:55am",
      "content": "\\>Why not just DRAW the river with the pen tool\n\nThat's what I had done at first but it looked really uneven so I wondered if there was a way to have a stroke that fattened, so you could still edit the course of the river without having to reposition all the nodes you'd get with an outline.\n\n"
    },
    {
      "time": "10 Apr 2009 — 6:50am",
      "content": "Draw a very long and thin triangle. Drag onto the Brushes panel -- Illy wants to know what type of brush it will be; select \"New Art Brush\".  \nDraw your river as a single smooth line and apply the brush.\n\n ![](http://web.archive.org/web/20140804014746im_/http:/typophile.com/files/river_4844.png)\n\n"
    },
    {
      "time": "10 Apr 2009 — 10:20am",
      "content": "Yes, making a brush would be the way to create a thin-to-thick stroke.\n\n\\> _I meant draw it, with the pen tool; just as one fat line. Then expand the stroke so you get contours, and fiddle with those. Of course you can just draw the individual contours to begin with; I’ve found I’m much faster the other way._\n\nYes, it's faster. I use that method too from time to time. Although most of the things I trace I just do the contours at once.\n\n\\> _That’s what I had done at first but it looked really uneven so I wondered if there was a way to have a stroke that fattened, so you could still edit the course of the river without having to reposition all the nodes you’d get with an outline._\n\nWell, fair enough. Maybe an example image would have been convenient, so we know what exactly you are trying to achieve. :)\n\n"
    }
  ]
}
