{
  "id": "56779",
  "title": "Arhaic Geo - please critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I have found these Archaic Romanian typeface in an old Calligraphy notebook. There were no numbers so I did them.\n\n ![](http://web.archive.org/web/20150414193452im_/http:/typophile.com/files/sursa_4053.jpg)\n\n ![](http://web.archive.org/web/20150414193452im_/http:/typophile.com/files/plansa%20arhaic%20geo_5184.jpg)\n\nPlease tell me what you think.\n\nThank you.\n\nI also have other posts here requesting critique so if you like these kind of typefaces please check the others too and tell me your oppinion.\n\n[http://typophile.com/node/56778](http://web.archive.org/web/20150414193452/http:/typophile.com/node/56778) - Arhaic Cali  \n [http://typophile.com/node/55517](http://web.archive.org/web/20150414193452/http:/typophile.com/node/55517) - Friends - a personal creation font\n\n",
  "author": "Florinf",
  "time": "8 Apr 2009 — 1:22am",
  "uid": "9477",
  "comments": [
    {
      "time": "8 Apr 2009 — 1:32am",
      "content": "You're doing interesting font archeaology! That A is hilarious, like a little a sitting on a chair pretending to be a CAPITAL :)\n\nAs for the numbers: I think the 9 and the 6 are not quite there yet. The 6 looks like an 8 with a bit missing. Maybe you can use a bit more angular approach, like the P or the D.\n\nKeep it up!\n\ncheerio Queneau\n\n"
    },
    {
      "time": "8 Apr 2009 — 1:52am",
      "content": "Hello again Queneau,\n\nFont Archeology, nice words :). Yes, I would like to revive these Old Romanian typefaces.\n\nBeside these historic types I do have some sketches of my own for other typefaces trying to bring them in the new and modern trend and keeping the old tradition. They will have to wait for now.\n\nYou are right about the numbers and also about the A for which indeed I had the same feeling.\n\nIţll be back with these corrections.\n\nThank you very much for your comments.\n\n"
    },
    {
      "time": "8 Apr 2009 — 6:12am",
      "content": "I would have the same comment about the number 6 and 9 they look out of the typeface. Look at the O, P, Q it could be helpfull to draw the latter. There also something interesting to start with the C and the G. You could work on the 3 too. Keep going.\n\nAndré\n\n"
    },
    {
      "time": "11 Apr 2009 — 2:33am",
      "content": "I have worked on some of the numbers.  \nThe red ones are the new (2 variants).\n\n ![](http://web.archive.org/web/20150414193452im_/http:/typophile.com/files/Arhaic%20geo%20cifre%20corectate_5643.jpg)\n\nDo you think I'm getting closer?  \nWhich one of the variants would be better?\n\n"
    },
    {
      "time": "11 Apr 2009 — 4:34am",
      "content": "I think the second row is better, it's certainly an improvement. But I think they still need some work, as they still look a bit 'unsure', especially the 9 and 6. Try to experiment with the size and shape of the bowls. As for the 3, though I like the 3 in the first row better, the second one fits better with the rest. Maybe you can take the bowl of the 1st one, and make the top side more 'edgy', it's just too rounded now. Just keep at it!\n\nHope this helps.\n\ncheerio Queneau\n\n"
    },
    {
      "time": "12 Apr 2009 — 12:52am",
      "content": "I have adjusted them.\n\n ![](http://web.archive.org/web/20150414193452im_/http:/typophile.com/files/2%20numere%20corecturi_5602.jpg)\n  \nThese is the last update.  \n\n ![](http://web.archive.org/web/20150414193452im_/http:/typophile.com/files/3%20numere%20corecturi_6633.jpg)\n  \nAnd these are the testings I have done.  \nOut of them I think the best are chosen above.\n\nI feel them more closer together (same family, unity).  \nNow I think the number 4 has too little space inside.  \nMaybe I'll adjust that too.  \nNumber 8 is also a bit strange. Maybe I'll try something for it too.  \nWhat do you think?\n\nThank you very much Queneau.\n\n"
    },
    {
      "time": "24 Apr 2009 — 4:02pm",
      "content": "Your new red 3 is very exciting. I like 7 too :)  \nThis is such an unusual font I'm having a hard time thinking how to improve it.  \nW looks very plain. What about a chunky slab serif on the middle apex?\n\n"
    },
    {
      "time": "27 Apr 2009 — 11:51pm",
      "content": "@Bendy\n\nThanks for your comment.  \nW is not a regular letter for romanian so it is sort of artificially created and added. Maybe some vertical flip of would have been more appropriate.  \nI don't know if a serif, even a slab one, would be suited.  \nI will try it and post it here.\n\nThanks again.\n\n"
    }
  ]
}
