{
  "id": "56787",
  "title": "Personal branding: My resume",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I've been working on creating my freelancer/personal brand. I posted [my business card](http://web.archive.org/web/20140725170126/http:/typophile.com/node/56560) last week and going off the logo I developed there and the current typography I am using there, I've redesigned my resume. Right now my business card is designed in Lane, so I've used that typeface here as well. Unfortunately Lane doesn't include a bold or italic, so I'm relying on all caps when I want to make a typographic differentiation.\n\nHere's the current version:  \n [http://i41.tinypic.com/k9eyw6.jpg](http://web.archive.org/web/20140725170126/http:/i41.tinypic.com/k9eyw6.jpg \"http://i41.tinypic.com/k9eyw6.jpg\")\n\n",
  "author": "aheep",
  "time": "8 Apr 2009 — 6:13am",
  "uid": "7895",
  "comments": [
    {
      "time": "13 Apr 2009 — 2:53pm",
      "content": "Lane is pretty hard to read for body text. Could you use it only for headings and pick something more readable for the rest? Also the bullets look much darker than the text at the moment. A typeface change might improve that though.\n\n"
    },
    {
      "time": "14 Apr 2009 — 8:13am",
      "content": "The bullet points aren't really helping you. The distract the eye and don't really help navigate the document.\n\nAlso, I looked at the resume on your website and it is too small to read. JPEG is not a very good format for documents like this. If you aren't going to use HTML you should make a PDF.\n\n"
    },
    {
      "time": "22 Apr 2009 — 7:15am",
      "content": "The body type seems to large and cramped for me. It could use a little more leading and a shorter line, too, I think. I love the giant purple a though, it's very appealing.\n\n"
    },
    {
      "time": "23 Apr 2009 — 7:22am",
      "content": "I want to tweak the giant \"a\" in the corner. Where you cut it off at the bottom of the aperture is a little uncomfortable for me. It's probably intentional, but it doesn't look that way to me. I probably would cut it off more.\n\n"
    },
    {
      "time": "27 Apr 2009 — 5:32am",
      "content": "The all lc headers (\"experience,\" \"education,\" etc.) and all-caps titles (jobs, school, etc.) threw off the hierarchy for me a bit. I wanted to read the text in all caps first despite the side of the headers.\n\n"
    }
  ]
}
