{
  "id": "56791",
  "title": "Putnja - type for headlines",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi,  \nmy first post here:) I'm learning graphic design, and unfortunately there is no typeface design class, but type is my hobby, but anyhow - judge me hard!\n\nSo, for now there's only lowercase characters, and I need some serious feedback, as I want to be sure about lowercase before going to uppercase.  \nMy idea was that primary purpose for this type would be headlines and large sizes. But in the same time it would look good at small sizes.  \nPlease comment on which details should I leave and which should go away, and any other comments would help.  \nI will release it under CC, so all the comments will return in finished and good(hopefully) type for everyone to use.\n\n[Putnja test sheet 01](http://web.archive.org/web/20140713231411/http:/murelis.com/darbiftp/putnja/putnja-critics01.pdf)\n\n| Attachment | Size |\n| --- | --- |\n| [putnja-critics02.pdf](http://web.archive.org/web/20140713231411/http:/typophile.com/files/putnja-critics02.pdf) | 165.69 KB |\n\n",
  "author": "murelis",
  "time": "8 Apr 2009 — 7:21am",
  "uid": "42783",
  "comments": [
    {
      "time": "15 Apr 2009 — 1:57pm",
      "content": "I added \"putnja-critics02.pdf\" to first post!\n\n-\\>\n\nSo, its sad, that no-one responded.  \nAnyway, I finished uppercase - still struggling with details; I'm not sure which features to keep, and which to delete. Any suggestions?  \n\"S\" is still huge pain, as I went over 8 versions of it, and now it looks decent, but still...\n\nAny advice would be great and highly appreciated!\n\n"
    },
    {
      "time": "16 Apr 2009 — 10:55am",
      "content": " ![](http://web.archive.org/web/20140713231411im_/http:/typophile.com/files/putnja005a_3824.png)\n\nAdded some minor features, dropped all kerning, and decided to polish spacing alone, before adding kerning. As I still plan to change minor details.\n\n"
    },
    {
      "time": "16 Apr 2009 — 11:27am",
      "content": "Can you tell us a bit more about your intended use? I'm not sure I can feel a particular mood conveyed here. The wobbles and unevenness seem to have a purpose but I'm not sure I understand it.  \nThe spacing seems way too tight.  \nI think the letters need to harmonise better. Compare the bowls on ceg and o...the thickness and contours are quite different. I realise you're trying to have some liveliness in there so the curves shouldn't be identical but the stress is moving around a bit too much. See what I mean by looking at Do...the curve on D looks quite monoline but on o you have a pronounced vertical stress.  \nKeep going :)\n\n"
    },
    {
      "time": "18 Apr 2009 — 11:42am",
      "content": " ![](http://web.archive.org/web/20140713231411im_/http:/typophile.com/files/critics005_5617.png)\n\nThanks for pointing out about the thickness of D and o - many of my uppercase is wrong by that matter, as they looka monoline.  \nAbout the intended use - when I started I didn't had particular idea in mind. I knew that it will not be a font for body text, but that's it. And I see this font as for magazines, and maybe logo, as the flow for 'qactnumpdb' is very nice. But yeah, generally for magazines in 52pt and up. And it looks really nice if body text is serif(I will post some examples with next update).  \nI will try out different approaches for making everything more even, as now I tried to increase vertical stress. But it looks weird, as for example S thickest part is = o thickest part, but it looks much more bigger :/  \nwill update soon!  \nand thanks for comment! :)\n\n"
    },
    {
      "time": "20 Apr 2009 — 6:49am",
      "content": "Some stems look distorted and out of place.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "20 Apr 2009 — 2:36pm",
      "content": "S usually has the weight on the spine rather than on the bowls. Move it more towards the centre.\n\n"
    }
  ]
}
