{
  "id": "5681",
  "title": "Help",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi! I am trying ti create a font (using VOLT, but if anyone knows another tool, and how I could go through this, it would be appreciated too!) which uses contextual substitution. However, it does not seem to be working.   \nWould you give me some advise to complete this work?   \n   \nWhat I am trying to do is:   \n   \nsay you have families 1,2,3,4   \n   \nfam1=\\>b, k, n, w, plus a special character (consonantic group) sh   \n   \nfam2=\\>d, m, v, r + dj (left to right)   \n   \nfam3=\\>f, l, s, z + tsh (left to right)   \n   \nfam4=\\>g, p, t, y j   \n   \n##########################   \nThis is where my problem starts:   \n   \nnow l and r have 2 forms:   \n   \n-\\>one as a first letter in the syllab   \n-\\>one as a mark when folllowing another consonant   \n   \n-\\>m/n have two forms and become a mark when preceding a consonant.   \n   \n-\\> vowels (I forgot to say it before: y is considered a consonant) have 6 forms which are the followings   \n   \nfam1 + a=\\>a\\_1   \nfam2 + a=\\>a\\_2   \nfam3 + a=\\>a\\_3   \nfam4 + a=\\>a\\_4   \nany vowel in forms stand-alone; 1 and 3 + a=\\> a\\_5   \n   \nany vowel in forms 2 and 4 + a=\\> a\\_6   \n   \nand there is a form as a stand-alone letter (the above applies to each vowel), which is the same as when following a vowel in form 5 or 6   \n   \nHow do I specify this to Volt? As I said before, if anyone knows how to do this with another tool, it would gratly help too!   \n   \nI have tried using th add feature, then add substitution , then type in the letters it should apply to, but when trying to compile it, it doesn't work at all.   \nI am not using a standart script (I made-up one) maybe this is the source of the problem?   \nWhat if I change it to latn1, our arabic?   \nThe script is \"Mandombe\", it is not supported by Unicode yet, (well I couldn't find it listed in the unicode list, however, all characters are supported, but spread accross several scripts).   \n   \nThe language settings I am using in VOLT are:   \nlanguage=default   \nscript=mand   \nIf I change the language defaut to, say us, or English, will that help?   \nIf I change the scrip to a recognized one, will that change anything?   \n   \nIt would be great if you could find some time to help me with that, I am totally lost, and I hope there is enough information on what I a m trying to do, if not let me know.\n\n",
  "author": "anonymous",
  "time": "18 Jul 2004 — 1:13am",
  "uid": "1203",
  "comments": [
    {
      "time": "19 Jul 2004 — 8:30am",
      "content": "I'm looking at it now...\n\n"
    },
    {
      "time": "20 Jul 2004 — 9:32am",
      "content": "\\> I will look closer.\n\n"
    },
    {
      "time": "19 Jul 2004 — 7:40am",
      "content": "No, this is the reason why I am looking for advise.\n\n"
    },
    {
      "time": "19 Jul 2004 — 7:43am",
      "content": "Can you help?\n\n"
    },
    {
      "time": "20 Jul 2004 — 2:41am",
      "content": "Thanks, let me know if you find something... I'll keep trying...   \nFor now, I have tried setting script to latin, but no difference. Maybe something with my lookups.. Anyway, I'll keep trying until it works...\n\n"
    },
    {
      "time": "18 Jul 2004 — 1:08pm",
      "content": "\\> have you done this before?\n\n"
    }
  ]
}
