{
  "id": "56824",
  "title": "The future: to buy or not to buy?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I need some guidance on the Avenir typeface and I guess the Frutiger System:\n\nAn agency have mocked up some web designs for us using a non system standard font as a headline: Avenir Book 45.\n\nNot withstanding the issues of not being able to use it as live text, can I use '45' at variable sizes for print and if so is it a case of the layout package resizing it as obviously '45' should be of a fixed size and weight?\n\nThere's no way my company will shell out for the updated whole family (Avenir Next is £850) If resizing Book 45 to big sizes for exhibition stands etc is not going to work, can anyone suggest a decent system font (apart from Helvetica and it's Knock-off Arial) that I could use instead and thus avoid all of these issues?\n\nThanks a lot,\n\nOwen\n\n",
  "author": "Redemption_seek...",
  "time": "9 Apr 2009 — 4:45am",
  "uid": "29624",
  "comments": [
    {
      "time": "9 Apr 2009 — 5:15am",
      "content": "Relax! You can use 45 for what ever size you want. The number used in a font is a concatenation of two numbers. The first set defines weight, while the second defines width and position. The 45 refers to it's weight, width and style. 4 means it's light (or book), and 5 that it is of normal width, and 5 being an odd number that it is an upright (roman) design. If the second number is even, it's a oblique style.\n\nMore here: [http://en.wikipedia.org/wiki/Univers](http://web.archive.org/web/20140804012926/http:/en.wikipedia.org/wiki/Univers)\n\n"
    },
    {
      "time": "9 Apr 2009 — 7:23am",
      "content": "Thanks very much, got a bit bent up thinking that my layout packages were resizing it poorly like the bold feature in quark would do for some typefaces - what a muppet - unfortunately no-one here could tell me any different so thanks again.\n\n"
    },
    {
      "time": "9 Apr 2009 — 8:48am",
      "content": "850 can seem like a lot for a full typeface family, but surely that's just a fraction of the cost of the entire trade shoe exhibit budget, no?\n\n"
    }
  ]
}
