{
  "id": "56828",
  "title": "Fontlab Glitch?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Yesterday I was working on an OT font and double checking some kerning. In the metrics window kerning shows up as it should. It has a generated kern feature which I can turn on in the OT preview panel.\n\nWhat I noticed that was weird is kerning worked everywhere except letters kerned to the cap A in the OT preview panel. I even muddled through the kern feature code to check and it shows up there and generates with kerning. It just won't preview anything kerned to A. I wondered if it has something to do with A being the default first character.\n\n",
  "author": "<a href=\"/web/20100203170524/http://typophile.com/user/14650\" title=\"View user profile.\">Stephen Rapp</a>",
  "time": "<br>",
  "uid": "14650",
  "comments": [
    {
      "time": "",
      "content": "Check to see if kerning to A is marked in red in the metrics window or set to zero.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Its not. In the metrics window letters kerned into the A have a blue line mark showing the kern distance. They preview fine in the metrics window. The only place they don't is in the OT features preview. All other kerning shows up except letters kerned to A. It hasn't been a problem since I know the kerning is there, its just weird it doesn't show in that one preview window.\n\n"
    },
    {
      "time": "",
      "content": "There is probably a check box somewhere in the preferences that says, \"Show kerning with cap A in preview window\" that's not checked. (Kidding.)\n\nAre you using class-based kerning? If so, it may be that you have \"A\" in more than one kerning class. (Although, usually there is a warning about this when you compile the OT features.)\n\n"
    },
    {
      "time": "",
      "content": "I am using class based kerning. I just checked for duplicates, but found none. I might have to go with your first suggestion ;-)\n\n"
    },
    {
      "time": "",
      "content": "Make sure that your class definition is set up with single straight quote and not with an apostrophe. Text in the classes menu is so small that they end up looking alike.\n\n"
    }
  ]
}
