{
  "id": "56822",
  "title": "Monotype Imaging Announces More than 100 Fonts",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Monotype Imaging Announces More than 100 Fonts available from its Monotype, Linotype and ITC Typeface Foundries\n\nDesigns Range from an Update of a Classic Industrial Design to Fonts that Offer Unique Personalities\n\nMonotype Imaging Holdings Inc. (Nasdaq: TYPE), a leading global provider of text imaging solutions, has added more than 100 fonts to its Monotype®, Linotype® and ITC® typeface collections. The fonts can be previewed and licensed from the company’s e-commerce sites: Fonts.com, Linotype.com, ITCFonts.com and Faces.co.uk.\n\n“We place a high priority on continually enhancing our typeface selections with fresh new designs. Creative professionals can also count on our collections for timeless classics that never go out of style,” said Allan Haley, director of words and letters at Monotype Imaging. “Our latest releases span a wide range of inspiration, from new designs that reflect the past to selections that convey their own attitude, including a font that’s not only grumpy but also bucks the idea that legibility is all that necessary.”\n\nNew to the Monotype Library\n\nNamed after the Cyrillic alphabet, the Azbuka™ typeface family consists of 20 fonts that cover a wide range of “flavors,” from extra light to extra dark. The lighter weights offer a contemporary look for blocks of text, while the heavier selections lend authority to headlines and display copy. Created by Richard Dawson and Dave Farey, the Azbuka family, along with the previously announced Egyptian Slate™ family from Rod McDonald, are the latest exclusive members of Monotype Imaging’s collection from the Monotype foundry.\n\nNew to the Linotype Library\n\nThe 25-font DIN Next™ typeface family is a new addition to the Linotype Platinum Collection. The design is based on the DIN 1451 Engschrift (condensed) and DIN 1451 Mittelschrift (regular) fonts, industrial designs first used in the 1930s for German street signs and house numbers. Akira Kobayashi, type director at Linotype, supervised the design process to extend the versatility of the original design, while maintaining traditional qualities. For example, characters in the DIN 1451 font contain corners with pointed angles. However, the DIN Next design features slightly rounded corners, reflecting decades-old signage that was cut with routers, which resulted in a rounded typographic effect. The DIN Next family of fonts range from ultra light to black, available in regular, italic and condensed varieties, and each font includes small caps and old style figures, in addition to several alternate characters.\n\nAlso new to the Linotype Platinum Collection is the Trade Gothic® Next family, created by Kobayashi. Based on the Trade Gothic design that was released in the 1940s, Kobayashi enhanced the face to meet modern digital standards, including the addition of compressed widths and heavier weights. Kobayashi also added two designs to the Eurostile® Next family within the Linotype Originals Collection: the Eurostile Candy typeface, which offers a playful interpretation of the basic structured Eurostile design; and the Eurostile Unicase font, which features upper and lowercase characters drawn with identical heights and proportions.\n\nAlso new to the Linotype Originals Collection are three families from Hannes von Döhren. The Quench® font offers the impression of a square sans serif design, yet it is neither fully square nor truly a sans serif. Quench also suggests a handcrafted demeanor, despite its technical appearance. The Opal™ typeface family provides a hint of eastern European flavor and is available in roman, italic and bold designs, with a connecting script for occasions when a simple italic is not enough. The Snoogle™ typeface offers an overstuffed, amiable appearance and includes 99 ligatures and alternate characters that can be inserted automatically in OpenType®-friendly applications. Its companion “dingbat” font can be used to add spot illustrations and images to headlines set in Snoogle – or used on their own.\n\nThe Linotype Originals Collection now includes the JP2™ typeface from Polish designer Franciszek Otto, who based the design on the look created when using a fountain pen – but with results that resemble the handwriting of Pope John Paul II. Otto also designed the Waza™ typeface, based on copperplate script letterforms. Rounding out the new Linotype releases are the Tendria™ and Saussa™ calligraphic script typefaces by Patricia Pothin-Roesch, and the Jump™ handwriting font, by Sine Bergmann, who also designed the new Giacometti™ Letter handwriting design, along with Leonore Poth.\n\nNew to the ITC Library\n\nThe ITC Nova Lineta™ design is the first commercial typeface from Serbian designer Slobodan Jelesijevic. Although casual in appearance, ITC Nova Lineta was constructed to maintain legibility across a wide range of sizes. At first glance, ITC Nova Lineta resembles a sans serif design, yet subtle serifs become apparent at large sizes. Also new to the ITC collection is Bernard Philpot’s ITC Bolthole™ typeface, which seems to exude a grumpy demeanor. While not noted for legibility, the design is able to draw reader attraction.\n\nAvailability\n\nIndividual fonts, selection packs and typeface families can be viewed, purchased and downloaded from [www.fonts.com](http://web.archive.org/web/20140627132045/http:/www.fonts.com/ \"www.fonts.com\"), [www.linotype.com](http://web.archive.org/web/20140627132045/http:/www.linotype.com/ \"www.linotype.com\"), [www.itcfonts.com](http://web.archive.org/web/20140627132045/http:/www.itcfonts.com/ \"www.itcfonts.com\") and [www.faces.co.uk](http://web.archive.org/web/20140627132045/http:/www.faces.co.uk/ \"www.faces.co.uk\"). The fonts are also licensed through an integrated online store available through Linotype’s FontExplorer® X font management solution. Further information is available at [www.fontexplorerx.com](http://web.archive.org/web/20140627132045/http:/www.fontexplorerx.com/ \"www.fontexplorerx.com\"). In addition, customers may also contact Monotype Imaging in the U.S. toll-free at 800-424-8973, or in Europe at +44 (0)1737 765959, or 001781 970-6020, option 2. Linotype in Germany can be reached at +49 (0) 6172 484-418. Customers from other parts of the world may dial 001 781 970-6020 (U.S.).\n\n ![](http://web.archive.org/web/20140627132045im_/http:/typophile.com/files/Font%20round%20up%20press%20release_5276.gif)\n\n",
  "author": "jade.jennings",
  "time": "9 Apr 2009 — 3:22am",
  "uid": "43412",
  "comments": [

  ]
}
