{
  "id": "56838",
  "title": "On Goin' Legit",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nI know I'm going to touch on some topics which have definitely been written about at length here on Typophile. My intent is not to rehash any open threads...just point me in the right direction.\n\nI guess my question had its inception when I recently decided to weed out all the non-legit fonts on my system. I never really realized that there was a real connection between decisions I made when I loaded fonts onto my machine and decisions I made when deciding to spec a font for use. It’s hard to find a value in an otherwise masterful typeface when you may just as easily have a handful of equally apt alternatives on hand. Until recently (and this is true for the majority of designers I know) choosing a typeface for a job meant ticking through 1500+ typefaces (most of them non-legal) and occasionally buying something once something goes into production and you’re “forced to”.\n\nMy workflow has changed pretty dramatically now that the handful of fonts I use are ones I have researched, contemplated and purchased. It’s also difficult at times. There’s a lot of “standards” that I, frankly, just can’t afford. There are a handful of gems in the free-font world and I’ve also started to draw some of my own faces.  \nDo you all have any sage advice in the area of starting a type collection on a shoestring budget?  \nWhat, if any, great values are out there?\n\nThanks\n\nchris\n\n",
  "author": "csr",
  "time": "9 Apr 2009 — 9:19am",
  "uid": "3630",
  "comments": [
    {
      "time": "9 Apr 2009 — 10:01am",
      "content": "Buy a used copy of Corel Draw to get ~1200 Bitstream fonts that cover most of the classic faces and revivals of the twentieth century. You won’t get small caps or old-style figures, but otherwise they’re great. Prices run anywhere from $50 to $500 depending on what version you buy and how many people are selling.\n\n"
    },
    {
      "time": "9 Apr 2009 — 10:39am",
      "content": "Likewise, some old versions of Freehand/Macromedia Studio came bundled with a metric buttload of URW++ fonts, (also where I got Fontographer in the mid 1990s) but that would probably be a much rarer find than Corel.\n\n"
    },
    {
      "time": "9 Apr 2009 — 11:24am",
      "content": "Never thought of that. Thanks!\n\n"
    },
    {
      "time": "9 Apr 2009 — 1:24pm",
      "content": "I regularly weed out my font library, not for un-licensed fonts (which I don't have any of, thank you very much), but for cruft.\n\nIt's truly a thought provoking experience, going through things and asking yourself \"Do I need this?\" \"Do I want this?\" \"Will I ever use this, and why not?\"\n\nYou'll find that you can pare down your font menu significantly, without really impacting your ability to do your work.\n\nWhat I would do, because it is what I do, is if I see a font that I like, I try to visualize immediately what I would use it for. If not now, perhaps at a future date, but I always try to focus on actual use. Keeping in mind real-world use, not pie-in-the-sky wishfulness or greedy materialism, will really help you in adding to or paring down your font library.\n\n"
    },
    {
      "time": "9 Apr 2009 — 1:32pm",
      "content": "Would Corel Draw 9 do ?\n\n"
    },
    {
      "time": "9 Apr 2009 — 3:36pm",
      "content": "_What, if any, great values are out there?_\n\nDepends on your work.\n\nIf you go by price per glyph, you've got to figure whether you would ever need all the glyphs in a big font.  \nFor instance, if you buy a 10-member family of OpenType fonts with Latin Extended encoding and many features (small caps, OSF, etc.) for $300, is that a great value for you? Would you use all the weights? Would you use small caps, superior figures, fractions. etc? Do you need CE coverage?\n\nWould you be able to use the typeface for many years on work for different clients, or would it go out of fashion, or be too idiosyncratic (or too samey) for more than one client?\n\nBut most importantly, do you think it's the kind of typeface you'd be comfortable working with, that would fit your style and make _your_ work look good, and be effective for your clients?\n\n"
    },
    {
      "time": "9 Apr 2009 — 6:12pm",
      "content": "[font starter packs](http://web.archive.org/web/20150311095427/http:/www.typophile.com/wiki/font%20starter%20packs)\n\n"
    },
    {
      "time": "9 Apr 2009 — 8:36pm",
      "content": "Corel Draw 9 has a decent collection of fonts, if I recall correctly. I have X3 and it has way more fonts than I'll ever use.\n\n"
    },
    {
      "time": "9 Apr 2009 — 11:08pm",
      "content": "If you're using Adobe Creative Suite, you should already have some professional OT fonts installed by default (Adobe Garamond, Minion, Caslon, Trajan, Myriad, Chaparral, Arno - depends on which CS version, and more). Then there are some nice, low-budget packages which I strongly advice:\n\nAscender Creativity Font Pack  \n [http://www.fontmarketplace.com/font/ascender-creativity-font-pack.aspx](http://web.archive.org/web/20150311095427/http:/www.fontmarketplace.com/font/ascender-creativity-font-pack.aspx \"http://www.fontmarketplace.com/font/ascender-creativity-font-pack.aspx\")  \nYou should get this even only for Today Sans, one of the best digital sans serif ever made - it truly shines.\n\nAdobe Type Basics OpenType Edition  \n [http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=...](http://web.archive.org/web/20150311095427/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1902 \"http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1902\")  \nBesides some fonts featued in CS, here you can find a couple of Slimbach's jewels like Utopia and Kepler, in regular, italic, bold and bold italic, open type.\n\nI had the chance to buy, for a very small price, old font collections from Corel Draw (Bitstream) and Deneba Canvas (URW Library): both contains hundreds of fonts from the early digital era, with limited glyphs and functions, but they work fine (Deneba offers them in TT and PS format) and you can find some great stuff too (like Monotype Grotesque).\n\nYou could also have a look at the Softmaker MegaFont XXL 2.0 [http://www.softmaker.com/english/megafont\\_en.htm](http://web.archive.org/web/20150311095427/http:/www.softmaker.com/english/megafont_en.htm \"http://www.softmaker.com/english/megafont\\_en.htm\"), a package whose legimity is debatable but which contains lots of true type fonts (clone?), some with small caps and old style figures (but no ligatures). I haven't had the opportunity to test these fonts in high resolution press, anyway, while I can swear on the funcionality of the Bitstream and URW original fonts.\n\nAlso, Elsner and Flake site [http://www.fonts4ever.com/free\\_font.php](http://web.archive.org/web/20150311095427/http:/www.fonts4ever.com/free_font.php \"http://www.fonts4ever.com/free\\_font.php\") offers a free Alternate Gothic, a nice display font. And don't forget the top quality free fonts by Jos Buivenga [http://www.josbuivenga.demon.nl/](http://web.archive.org/web/20150311095427/http:/www.josbuivenga.demon.nl/ \"http://www.josbuivenga.demon.nl/\")\n\nThat said, holding very few fonts in one's system can be a limit, or a challenge. Many great typographers based their work in using a very limited range of typefaces. As Slimbach states in The Elements of Typographic Style, it's bettere to have one fully functional font than hundreds of crap typefaces.\n\n"
    },
    {
      "time": "9 Apr 2009 — 11:55pm",
      "content": "Ugh .. \"12000 fonts for $50\" looks very much like an exact opposite of \"going legit\" to me :-)\n\nThanks for the links though, good collection.\n\n"
    },
    {
      "time": "10 Apr 2009 — 1:53am",
      "content": "_Softmaker MegaFont XXL 2.0_\n\nCompulsory viewing—instructional video here:  \n [http://typophile.com/node/56766](http://web.archive.org/web/20150311095427/http:/typophile.com/node/56766 \"http://typophile.com/node/56766\")\n\n"
    },
    {
      "time": "12 Apr 2009 — 3:13pm",
      "content": "Agreed, the Adobe CS default install fonts are a good start...I'd consider that my \"base\".  \nNick, I really like the per glyph perspective of looking at it.  \nI used Swift at the last firm I worked for and really fell in love with it. While I probably didn't realize it at the time, I think I loved it because it was versatile but also didn't have too much of what I didn't need.\n\nI suppose I'm really keeping my eye out for a \"Sale\" (do those really exist with type vendors?) while saving up for a few of the things like Swift that I no longer have a license to use.\n\n"
    },
    {
      "time": "13 Apr 2009 — 11:47am",
      "content": "How about saving up the dough for good fonts?  \nJust a thought friend.\n\nGuerrizmo+Design  \nNo man is an island unto himself\\_John Donne\n\n"
    },
    {
      "time": "13 Apr 2009 — 11:54am",
      "content": "Chris,\n\nThanks for doing the right thing!\n\nChrisL\n\n"
    },
    {
      "time": "14 Apr 2009 — 12:21pm",
      "content": "typedog, i hope you're not suggesting i'm looking for a shortcut...  \nI would imagine there are plenty of overpriced fonts out there, and there are plenty of competetively priced options, as well. Just thought I'd ask those more knowledgeable than myself.\n\n"
    },
    {
      "time": "14 Apr 2009 — 4:25pm",
      "content": "You don't need a ton of fonts unless your collector.  \nBuy a family (serif and sans) combination. By no means  \nwas I suggesting for you to be dishonest. What I was saying is  \nsave your money shop around and buy what you like.  \nI as well as my fellow designers have scores of font however  \nwe only use 5 fonts at the least.\n\nGuerrizmo+Design  \nNo man is an island unto himself\\_John Donne\n\n"
    },
    {
      "time": "15 Apr 2009 — 4:40pm",
      "content": "Hey thanks for the input everyone!\n\nThe adobe base collection and the Linotype cambridge collection are a great start for me.  \nIf I get my $&\\*# together I'll be able to save for a few more gems.\n\n"
    },
    {
      "time": "15 Apr 2009 — 7:37pm",
      "content": "I did just that. Luckily I found Macromedia Studio with those beautiful fonts. No open types but I feel like swimming one thousand miles with only thirty bucks, with FH 2.2.\n\n"
    },
    {
      "time": "15 Apr 2009 — 8:07pm",
      "content": "hmmmm...i think i actually have an old copy of Macromedia Studio for Windows...maybe I can extract those ttf fonts using parallels or something.\n\n"
    },
    {
      "time": "15 Apr 2009 — 11:37pm",
      "content": "epsilicon:\n\n\\> <cite>Would Corel Draw 9 do ?</cite>\n\nVersion 9 contained the largest ripoff collection ever sold by Corel:\n\nsee [http://www.sanskritweb.net/forgers/index.html#CORELDRAW](http://web.archive.org/web/20150311095427/http:/www.sanskritweb.net/forgers/index.html#CORELDRAW \"http://www.sanskritweb.net/forgers/index.html#CORELDRAW\")\n\nsee also [http://www.sanskritweb.org/cdrfonts/index.html](http://web.archive.org/web/20150311095427/http:/www.sanskritweb.org/cdrfonts/index.html \"http://www.sanskritweb.org/cdrfonts/index.html\")\n\n"
    },
    {
      "time": "19 Apr 2009 — 8:12pm",
      "content": "Uli, is there anything special about the forged version of Palatino you mention in your link under the Softmaker section? Is it only historical for historical consideration, or are there actually discernible difference to digital versions available today?\n\n"
    },
    {
      "time": "20 Apr 2009 — 9:47am",
      "content": "\\> Uli, is there anything special about the forged version of Palatino you mention in your link under the Softmaker section?\n\nI am not quite sure what you mean, but if you are alluding to this sentence:\n\n\"It includes many original fonts of the Berthold period 1858–1993 no longer available elsewhere, e.g. the original Palatino by Hermann Zapf of 1950\"\n\nthen the situation is the following:\n\nIn the 1980s, Linotype brought out the original Palatino under the font name \"Palatino 1950\" (see e.g. catalog \"Linotype Collection 1989\"), and the same version was brought out by the now-defunct Berthold AG.\n\nThe digitalized 1950 Berthold version was used by me in the file\n\n[http://www.sanskritweb.net/forgers/scangraphic.pdf](http://web.archive.org/web/20150311095427/http:/www.sanskritweb.net/forgers/scangraphic.pdf \"http://www.sanskritweb.net/forgers/scangraphic.pdf\")\n\non page 13 for typesetting the body text of this page in order to contrast the 1950 font with the forgery \"Paxim\".\n\nThe original 1950 version differs noticeably from later Palatino versions, as you will see by enlarging/magnifying the character set contained in the above PDF file.\n\n"
    },
    {
      "time": "20 Apr 2009 — 9:48am",
      "content": "\\> Uli, is there anything special about the forged version of Palatino you mention in your link under the Softmaker section?\n\nI am not quite sure what you mean, but if you are alluding to this sentence:\n\n\"It includes many original fonts of the Berthold period 1858–1993 no longer available elsewhere, e.g. the original Palatino by Hermann Zapf of 1950\"\n\nthen the situation is the following:\n\nIn the 1980s, Linotype brought out the original Palatino under the font name \"Palatino 1950\" (see e.g. catalog \"Linotype Collection 1989\"), and the same version was brought out by the now-defunct Berthold AG.\n\nThe digitized 1950 Berthold version was used by me in the file\n\n[http://www.sanskritweb.net/forgers/scangraphic.pdf](http://web.archive.org/web/20150311095427/http:/www.sanskritweb.net/forgers/scangraphic.pdf \"http://www.sanskritweb.net/forgers/scangraphic.pdf\")\n\non page 13 for typesetting the body text of this page in order to contrast the 1950 font with the forgery \"Paxim\".\n\nThe original 1950 version differs noticeably from later Palatino versions, as you will see by enlarging/magnifying the character set contained in the above PDF file.\n\n"
    },
    {
      "time": "20 Apr 2009 — 11:13am",
      "content": "yep, that's what i was wondering. thanks for clarifying.\n\n"
    }
  ]
}
