{
  "id": "56843",
  "title": "Adobe Myriad CAD inside Acrobat Reader 9...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20140714145707im_/http:/typophile.com/files/Picture17_4606.png)\n\nMyriad CAD is a variant inside of Acrobat 9 Reader. Did you notice that lovely lowercase “a”?\n\nAnyone got any info on special font?\n\nPerhaps we’ll see this “a” in a future Myriad release.\n\nMikey :-)\n\n",
  "author": "SuperUltraFabulous",
  "time": "9 Apr 2009 — 12:44pm",
  "uid": "12479",
  "comments": [
    {
      "time": "9 Apr 2009 — 3:22pm",
      "content": "For comparison purposes:\n\n ![](http://web.archive.org/web/20140714145707im_/http:/typophile.com/files/Untitled_5519.png)\n\nI don't know why FontExplorer sizes them so differently in the viewer.\n\nIn any case, clearly modified are the a and the r, and the widths are noticably extended in the UC, which is wider than the widest available Myriad version, and the weight is lighter than the lightest available version also.\n\nI like!\n\n"
    },
    {
      "time": "9 Apr 2009 — 3:27pm",
      "content": "Is it really so strangely spaced?\n\n"
    },
    {
      "time": "9 Apr 2009 — 8:20pm",
      "content": "Just checked inside my Acrobat Reader and I didn't see this there? Where is it?\n\n"
    },
    {
      "time": "9 Apr 2009 — 11:21pm",
      "content": "For Mac OS X users you have open the application package.\n\nRight click on Adobe Acrobat 9\\>show application package\\>search for “myriad” using spotlight\\>open the result “MyriadCAD.otf”\n\n ![](http://web.archive.org/web/20140714145707im_/http:/typophile.com/files/Picture17_5075.png)\n  \n\n ![](http://web.archive.org/web/20140714145707im_/http:/typophile.com/files/Picture19_4156.png)\n  \n\n ![](http://web.archive.org/web/20140714145707im_/http:/typophile.com/files/Picture20_4803.png)\n\nMikey :-)\n\n"
    },
    {
      "time": "10 Apr 2009 — 12:20am",
      "content": "<cite>which is wider than the widest available Myriad version, and the weight is lighter than the lightest available version also.</cite>\n\nYou can extrapolate Myriad MM to get this weight and width. Some details of the design were changed of course.\n\n"
    },
    {
      "time": "10 Apr 2009 — 7:11am",
      "content": "Who has the MM? They stopped selling that years ago. I think I only have Tekton MM, which came with an old Adobe package, which isn't a font I have the greatest desire to make instances of :)\n\nI dunno, but I think the change to the a is a cool one. Just that minor adjustment makes the whole thing seem friendlier.\n\n"
    },
    {
      "time": "10 Apr 2009 — 11:51am",
      "content": "Speculation: CAD version was designed to be culturally acceptable to typographically illiterate CAD operators, who expect legends on printouts to be largely indistinguishable from handwriting templates of yore or from 1980s-style HP pen-plotter fonts.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20140714145707/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "12 Apr 2009 — 2:42pm",
      "content": "Perhaps Thomas Phinney would know...\n\n"
    },
    {
      "time": "12 Apr 2009 — 7:31pm",
      "content": "Without having examined the font closely, my guess is that this version of Myriad is intended to come close to matching the ANSI CAD lettering standard. A few years ago, we were hired to make a stricter implementation of the ANSI standard for a CAD software company (and also fonts for the weirder ISO standard), it it looked not unlike this version of Myriad.\n\n"
    },
    {
      "time": "12 Apr 2009 — 7:40pm",
      "content": "Here, top, is the implementation we made of the ANSI standard lettering for CAD. The Myriad CAD letters are pretty close to this, except for that lowercase _a._ We made this font in 2000, so perhaps the standard has changed since then. Below, is the weird ISO standard lettering.\n\nWe made these fonts for a CAD software company called Microcadam. A few days after we delivered the fonts, the company was bought by IBM, and the Helix design program for which the fonts were intended was removed from the market. I've no idea what happened to the fonts, but presumably IBM owns them, whether they realise it or not.\n\n ![](http://web.archive.org/web/20140714145707im_/http:/typophile.com/files/cad_4975.gif)\n\n"
    },
    {
      "time": "13 Apr 2009 — 10:39am",
      "content": "Thank you for info John!\n\n"
    }
  ]
}
