{
  "id": "56842",
  "title": "my logo: need advice please",
  "forum": "Design",
  "tags": [

  ],
  "content": "Okay so I am starting my stationary/wedding invite company that specializes in letterpress and silkscreen as well as pen and ink illustration.\n\nThe name is Anavi Ink. I have a logo that I like which combines the i from Anavi and the i from ink so there is just one i with an ink splotch for the dot on the i.\n\nHowever people have been reading it as Anav Ink which I don’t want since that is NOT my last name.\n\nI need suggestions for how I can do the same basic idea, but with people somehow reading the name with two (ii)s.\n\nthanks!\n\n",
  "author": "<a href=\"/web/20090507185451/http://typophile.com/user/25022\" title=\"View user profile.\">shielddesign</a>",
  "time": "<br>",
  "uid": "25022",
  "comments": [
    {
      "time": " 10.Apr.2009 8.54am",
      "content": "It’s hard to give feedback without seeing an image but it sounds like the ii confusion is going to be unavoidable in the format you have in mind. The problem is that Anavi is an unfamiliar name so readers are going to have a hard time separating AVANINK the two words. You could try using a color build on the I to demonstrate the combination eg. AVAN in cyan, NK in magenta, and I in an overprinted cyan/magenta. Otherwise, I think it’s time to start sketching two word solutions.\n\n"
    },
    {
      "time": " 10.Apr.2009 9.20am",
      "content": "What about arranging the two words perperndicularly using n as the crossover letter?\n\n"
    },
    {
      "time": " 10.Apr.2009 9.19pm",
      "content": "_Okay so I am starting my stationary/wedding invite company..._\n\nBe sure to spell “stationery” correctly. :-)\n\n ![](http://web.archive.org/web/20090507185451im_/http:/typophile.com/files/invitations_5405.jpg)\n\n"
    },
    {
      "time": " 12.Apr.2009 7.29am",
      "content": "funny! : )\n\nI also put this on the logo/crit section please have a look and weigh in it is called “logo crit pretty please”.\n\nthanks!\n\n"
    },
    {
      "time": " 12.Apr.2009 5.47pm",
      "content": "_I also put this on the logo/crit section please have a look and weigh in it is called “logo crit pretty please”._\n\nHere’s a link to that thread:\n\n[http://www.typophile.com/node/56865](http://web.archive.org/web/20090507185451/http:/www.typophile.com/node/56865 \"http://www.typophile.com/node/56865\")\n\nAnd by the way: the photo I posted is the correct way to spell “stationery” if you mean writing paper and envelopes. The way you’re spelling it in both your posts, “stationary,” means that something doesn’t move. So I say again, be sure to use the correct spelling, or people will stay away from your store.\n\n"
    },
    {
      "time": " 14.Apr.2009 11.46am",
      "content": "Thanks for linking to my post I did not know how to do that. Yes my spelling needs a bit of help : )\n\n"
    }
  ]
}
