{
  "id": "56869",
  "title": "Logo Critique and HELP",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I have created this logo... which I don’t know that to do about the type. It’s ITC Avant Garde... and my instructor and class critique agree it is good but... I don’t know. I need help deciding what subtext and body copy to use in the design manual. I decided on Verdana because the organization is an internet forum. I’ve thought about using Rockwell Light for subheadings, possible for the body in the manual. PLEASE HELPPP... so stuck.\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/cyan_4618.jpg)\n\nOh, poweredgreen.org is a forum which is supposed to attract technically minded and creative individuals with ideas for improving life on this planet with new alternative energy sources and other products. Wants to get government funding to make good ideas a reality and spread the technology at little cost if not free to individuals around the world who would benefit from it.\n\n",
  "author": "<a href=\"/web/20090416164046/http://typophile.com/user/28988\" title=\"View user profile.\">P. Halley</a>",
  "time": "<br>",
  "uid": "28988",
  "comments": [
    {
      "time": " 10.Apr.2009 8.58am",
      "content": "This is pretty cool, actually. My only real crit is that the icon feels a bit overbearing relative to the wordmark. But AG works well with the icon; if you choose a different family, though, you should probably stay within the geometric style (Futura, Gotham, Avant-Garde, etc) because of the icon. But AG works. What about that choice makes you so uncertain?\n\n"
    },
    {
      "time": " 10.Apr.2009 9.42am",
      "content": "the weight is overpowering... i guess there is nothing wrong with the font so much as the balance... any ideas for subhead and body that works with AV? ill put it in smaller... maybe that feels better\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/cyan_4705.jpg)\n\n"
    },
    {
      "time": " 10.Apr.2009 12.52pm",
      "content": "One thing that bugs me right away... Why are you telling me that green is blue? or is it vice-a-versa? Anyway...\n\nOther things: the IO doens’t really match bigger arcs; type probably too close to symbol; type almost certainly too small for this symbol; IO doesn’t look centrally positioned (it may be geometrically, but it’s not visually)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 10.Apr.2009 12.58pm",
      "content": "i second litera with seeing a conflict between the green ajenda and the blue button.\n\nalso, though i have no idea what could be done to prevent it, i initially saw powe red green org.\n\nWill\n\n"
    },
    {
      "time": " 10.Apr.2009 1.15pm",
      "content": "Maybe it’s me, but the power symbol is THE cliche of a tech logo world. For example see this collection:\n\n[http://www.logodesignlove.com/logos-using-the-standby-symbol](http://web.archive.org/web/20090416164046/http:/www.logodesignlove.com/logos-using-the-standby-symbol \"http://www.logodesignlove.com/logos-using-the-standby-symbol\")\n\n"
    },
    {
      "time": " 10.Apr.2009 1.21pm",
      "content": "Agree with litera and Will...you definitely need to lower the text, leave about 1.5 times the size of the text itself in between the symbol and the text. Also, as litera said, make the symbol smaller. And nudge until it looks visually centered.\n\nAs for body text, Gill sans will work good. Frutiger will also work. If its mostly web, go with the safe choices, Verdana and Georgia :)\n\nJonE.\n\n"
    },
    {
      "time": " 10.Apr.2009 5.12pm",
      "content": "well I made it blue to avoid cliche green for “green organizations” but, you got me with the standby symbol. It is tech oriented but far too late to go back on it. Making the symbol smaller would definitely help with the balance but then, I feel uncomfortable with the type being so extended. It isn’t measure centered, when it was it looked off when it was... now it’s not but it looks off to you \\>\\_\\<. I had tried stacking “powered” on “green.org” but was told it didn’t make the address flow... perhaps i should just leave out the “org” but then, it could get lost with the “.com”- you think?... oh you meant the power symbol itself, I could try moving that back to the original place with even spacing but people said it made the whole shape oblong... I’ll try some of your suggestions and repost later.\n\n"
    },
    {
      "time": " 10.Apr.2009 5.40pm",
      "content": " ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/cyan_3610.jpg)\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/cyan1_5851.jpg)\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/cyan2_6287.jpg)\n\nThe last one I tried in futura... this is 1x the height of the font distance the last one is 1.5x.... I do have it at the x height not at the ascender btw. The more space I put in the stranger it feels\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/cyan3_6404.jpg)\n\n"
    },
    {
      "time": " 10.Apr.2009 11.29pm",
      "content": "may be this?\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/logoother_4331.jpg)\n\n"
    },
    {
      "time": " 11.Apr.2009 1.30pm",
      "content": "Have you considered moving just the “.org” to the second line ?\n\n"
    },
    {
      "time": " 11.Apr.2009 2.13pm",
      "content": "The scale is still way off, IMO. Break out of the tunnel vision and REALLY shake up the relationship! In my experience, in order to find something that works, you must to completely let go of what doesn’t work. In other words: stop forcing it.\n\nIf it were me, I’d search for a font with more weight — right now, it looks like the mark could lose steam, fall, pulverize the type and roll off without even noticing. The type actually looks scared of the mark, all clustered together and cowering below. They aren’t visual peers.\n\nThe logotype needs the most work; as it is now, the kerning needs attention and the tracking is too tight. Have you considered capitalization (PoweredGreen.org) or using different tones/colors for each word? With only one ascender and all those round letters, “poweredgreen.org” is kinda one, long muddy worm.\n\n"
    },
    {
      "time": " 11.Apr.2009 5.36pm",
      "content": "I tend to agree with “litera” the colors are off. I also agree with “epsilicon” the power symbol icon is over killed.\n\nMy opinion: if you develop a symbol, similar to what you already have (without the “power” icon symbol), reduce its size, keep the text in AG, but set it in demi instead (a little heavier), adjust the kerning (a little open), and play with 2 different greens. Aqua or teal and warm green. So, you have a symbol w/ 2 color greens. For the text (use 2 same color greens): Powered (in Aqua/teal; Green (in warm green). “.org” could be med. grey. Then place the new symbol in front of the text (but don’t overpower it).\n\nsal\n\n"
    },
    {
      "time": " 11.Apr.2009 5.54pm",
      "content": "Another thought: if you set the text “poweredGreen.org” in AG demi (all in one color green)... you’ll notice the “G” it has a similar construction as the power symbol icon. Then you can repeat the same circles design in a very light green and place them behind the “G”.... it would look like a subliminal power symbol icon.\n\nsal\n\n"
    },
    {
      "time": " 13.Apr.2009 10.07am",
      "content": "I don’t know if this is what ’having font’ meant, but, after considering the comments, maybe try rotating the power symbol 90 degrees clockwise so it resembles a “G” for green. Then you can maybe try to abstract it a little so it has a unique treatment.\n\nJonE.\n\n"
    },
    {
      "time": " 13.Apr.2009 7.42pm",
      "content": "I got the power symbol from the Avant Garde “G” literally why I went with it. I’ve gotten a lot of suggestions and tried this out. Back to slight gradient. I was already using AG demi btw... it just wasnt working.\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/2cyan_6236.jpg)\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/12cyan_5034.jpg)\n\n ![](http://web.archive.org/web/20090416164046im_/http:/typophile.com/files/11cyan_4981.jpg)\n.... I dont think the 2color word works because it splits the singele web address... someone suggested myriad pro condensed.\n"
    },
    {
      "time": " 14.Apr.2009 2.22pm",
      "content": "Man,  \nLook at this link: [http://www.gradiente.com/site/home/index.asp](http://web.archive.org/web/20090416164046/http:/www.gradiente.com/site/home/index.asp \"http://www.gradiente.com/site/home/index.asp\")  \nFamiliar?\n\nIts a IT Company from Brazil.\n\nI like the last example, spacially the CAP “P”\n\n"
    }
  ]
}
