{
  "id": "56874",
  "title": "Web font usage stats",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anyone know of any research that lists the most commonly specified Web fonts. I can guess most of these, but it would be nice to have this broken out by style (bold and itlaic) and not just family.\n\nCheers, Si\n\n",
  "author": "Si_Daniels",
  "time": "10 Apr 2009 — 10:18am",
  "uid": "1049",
  "comments": [
    {
      "time": "13 Apr 2009 — 11:20pm",
      "content": "i'm interested in this too.\n\n"
    },
    {
      "time": "14 Apr 2009 — 7:10am",
      "content": "So far have drawn a blank on this. I did some eye-balling of the top 20 US sites (according to this [http://www.alexa.com/topsites](http://web.archive.org/web/20150331013533/http:/www.alexa.com/topsites \"http://www.alexa.com/topsites\")) and they mostly seem to use Arial, Arial Bold and Tahoma and Tahoma Bold. But I'm sure this isn't representative of the wider web.\n\n"
    },
    {
      "time": "14 Apr 2009 — 8:59am",
      "content": "Never figured you for a lister, Si.\n\n"
    },
    {
      "time": "14 Apr 2009 — 9:06am",
      "content": "I'm not a lister! Background: Some internet-browsing devices don't have enough memory for all the fonts we ship in full OS's so I'm looking to provide a prioritized list based in part in actual usage.\n\n"
    },
    {
      "time": "14 Apr 2009 — 8:11pm",
      "content": "Si, I'm not sure that this is what you need, but [Code Style](http://web.archive.org/web/20150331013533/http:/www.codestyle.org/css/font-family/index.shtml) has a pretty complete (and ongoing) survey of Web fonts - in fact, it's the best around. Their recent (April 11, 2009) [Full Windows font survey results](http://web.archive.org/web/20150331013533/http:/www.codestyle.org/css/font-family/sampler-WindowsResultsFull.shtml) are fascinating, if not incredible: Franklin Gothic Medium is on 97.62% of surveyed Windows machines? Gill Sans MT is on about half of all surveyed Windows machines?\n\n"
    },
    {
      "time": "14 Apr 2009 — 8:52pm",
      "content": "Thanks, yes I'm familiar with that one. However it doesn't seem to relate to the popularity of fonts specified on Web pages.\n\nRe. Franklin Gothic Medium - that is a core UI font in Windows XP, that stuck around. Gill Sans however most likely got installed with Office.\n\nCheers, Si\n\n"
    }
  ]
}
