{
  "id": "56888",
  "title": "Get the metrics/kerning values",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi Guys!  \nI was wondering Is there any way to get the metrics values from an existing typeface to import in your own one. I know it must need adjustments and it isn't something good but just wondering.\n\nwill appreciate any comment on this,  \nthanks!\n\n",
  "author": "<a href=\"/web/20100203172049/http://typophile.com/user/37792\" title=\"View user profile.\">mikej</a>",
  "time": "<br>",
  "uid": "37792",
  "comments": [
    {
      "time": "",
      "content": "The trick would be to find a typeface exactly like yours. Clear sailing after that.\n\n"
    },
    {
      "time": "",
      "content": "Yes, there are some similar to mine - I'm just learning, so nothing new :)  \nAny ideas how to get the values?\n\n"
    },
    {
      "time": "",
      "content": "If only there were a book devoted to just this sort of information! Some sort of…manual! Perhaps one could even be written about a specific piece of software, and given away for free at the web site of the company that makes the software!\n\n"
    },
    {
      "time": "",
      "content": "Would be really nice something like that - can be tricky but maybe with some adjustments could be good! Also for learning how to kern.\n\n"
    },
    {
      "time": "",
      "content": "You can select the glyphs in the font who's metrics you want to copy then in your font, Edit - Paste Special\n\nYou can paste the side bearings or kerning, I think there are a few other options as well.\n\n"
    },
    {
      "time": "",
      "content": "Yay! It works! Also I figure out that you can save classes and/or Features and import into your own - but I don't think this is good!\n\n"
    },
    {
      "time": "",
      "content": "Another option: export an AFM file (from the Preview/Metrics Window), then import it in the other font. This has always worked very reliably for me, even in MM fonts. It also gives you further options.\n\n"
    },
    {
      "time": "",
      "content": "Sounds to me like a pretty lazy and ethically bankrupt plan, extracting and using metrics and kerning from someone else's font. You should learn how to do this stuff the correct way.\n\n"
    },
    {
      "time": "",
      "content": "Surelly Jackson! No one is trying to do something bad - I was asking for learning proposes! I'm not making any money with my fonts!\n\n"
    },
    {
      "time": "",
      "content": "Cool. I'm just not sure what you'll gain, knowledge wise, by importing someone else's metrics.\n\n"
    },
    {
      "time": "",
      "content": "There's tons to learn from it. First of all you get an impression of the general approach, and you also get to see how they solved tricky characters. The tough spots in your own typeface will become more evident as well.\n\n"
    }
  ]
}
