{
  "id": "5688",
  "title": "Poster for Concert",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "hey. this is a poster for a concert at The Eaves (see logo forum). the main band is casiotone for the painfully alone. they are sort of lofi glitch pop. think 80s beats through a low tech casio keyboard with him singing over it. he sings alot about being lonely and that his house is full of mice.   \n   \nthe poster will be letterpressed on 17x23 mohawk superfine soft white paper. im going to do an edition of about 40 and sell them at the show for around $10 each.   \n   \nthis whole concept is really early. so ill be devloping it heavily over the next couple days. i like the first one waaaay more than the second, but thought i oughtta post both.   \n ![](http://web.archive.org/web/20131107211033im_/http:/www.typophile.com/forums/messages/29/40986.gif)  \n   \n ![](http://web.archive.org/web/20131107211033im_/http:/www.typophile.com/forums/messages/29/40987.gif)\n\n",
  "author": "bwhitla",
  "time": "18 Jul 2004 — 4:30pm",
  "uid": "2820",
  "comments": [
    {
      "time": "19 Jul 2004 — 12:28am",
      "content": "The first one has problems with legibility - the hand distracts too much. I also don't think the hand's style matches the type. What is the story behind the rat/mouse?   \n   \nThe second one is too messy, does the hands have to be there?\n\n"
    },
    {
      "time": "22 Jul 2004 — 11:00pm",
      "content": "He is (or used to be) from Portland, where I live. I haven't heard his music, as I have been scared off by the ridiculously awful band name. However, your poster is already looking better than any I've seen around town for his local shows. Thank you for not using shaky cursive script, pink, or anything that's blatantly too small (indie pop design clich\n\n"
    },
    {
      "time": "22 Jul 2004 — 11:23pm",
      "content": "He is (or used to be) from Portland, where I live. I haven't heard his music, as I have been scared off by the ridiculously awful band name. However, your poster is already looking better than any I've seen around town for his local shows. Thank you for not using shaky cursive script, pink, or anything that's blatantly too small (indie pop design clich\n\n"
    },
    {
      "time": "23 Jul 2004 — 5:41am",
      "content": "thanks for the words john. i certainly was trying to avoid hand scripted pink and blech. squiggly line drawings of.. anything. thanks for noticing. your from portland? i may be moving out there next year.   \n   \nhere's the next version-no major design changes, just had to add the name of our visiting artist and change the colors, which actually is apartial solution to the readability issue.   \n   \nthe two colors are pms 381 and 3115. if anyone besides me out there is a pantone whore i know youve already run for your books. anyway, ive done some testing, and on letterpress these two ink - when laid on top of eachother - create a green that is deeper and brighter and either by itself. should make the name pop. but a little readability trouble is fine with me. dont want to make it too easy on the viewer. ha.   \n   \nthat green looks super yellow on my moniter, but its green. like the pantone. thoughts?   \n   \n ![](http://web.archive.org/web/20131107211033im_/http:/www.typophile.com/forums/messages/29/41296.gif)\n\n"
    },
    {
      "time": "24 Sep 2004 — 8:58am",
      "content": "I really really love the hand/glove. Colours in the most recent revision look good.   \n   \nThe 80's type isn't strong enough to avoid being overpowered by the strength of the glove. I think you should fill the channel in the characters with either white (which would really pick it out), or if you're bothered about the number of colours, fill it in with either the green from the mouse or the background colour. Just to stop the glove interferring.   \n   \nI don't think the mouse and the hand are working together in the composition. It would be nice to see the hand over the mouse more implying protection, or the gap between the thumb and the forefinger cupping the mouse's body. At the moment they feel quite seperate.\n\n"
    }
  ]
}
