{
  "id": "56892",
  "title": "I've given in to Flickr.",
  "forum": "nina's blog",
  "tags": [

  ],
  "content": "Whenever the percentage of type-related entries on my [blog](http://web.archive.org/web/20150420054238/http:/sehsucht.wordpress.com/) exceeds a (very low) tolerance level, I get complaints from bored readers. So I decided to make Flickr my type-stuff-posting refuge. Apart from here I mean :-)\n\nHave a look if you like:  \n [http://www.flickr.com/photos/ninastoessinger/](http://web.archive.org/web/20150420054238/http:/www.flickr.com/photos/ninastoessinger/ \"http://www.flickr.com/photos/ninastoessinger/\")\n\n",
  "author": "nina",
  "time": "11 Apr 2009 — 4:47am",
  "uid": "13487",
  "comments": [
    {
      "time": "11 Apr 2009 — 6:03am",
      "content": "sweet\n\n"
    },
    {
      "time": "11 Apr 2009 — 7:32am",
      "content": "Welcome to Flickr then as well!\n\nChrisL\n\n"
    },
    {
      "time": "11 Apr 2009 — 7:39am",
      "content": "Thank you! Another nice type-related time-eating place to be… :-)\n\n"
    },
    {
      "time": "11 Apr 2009 — 9:24am",
      "content": "Nice pictures Nina, I like the headless people in your typespotting set!\n\nMy [Flickr page](http://web.archive.org/web/20150420054238/http:/www.flickr.com/photos/ohbendy/sets/) is mostly photos but there's a bit of fonty fun there too.\n\n"
    },
    {
      "time": "11 Apr 2009 — 9:48am",
      "content": "Wow, nice photos Ben. I'm quite envious you traveled to Burma BTW!\n\n"
    },
    {
      "time": "11 Apr 2009 — 10:13am",
      "content": "I used to live in Thailand so visited Burma many times from there, I love it :) But I need a new camera if I go back!  \nI should really learn how to save money so I can travel more...anyway glad you like them.\n\nHappy Easter! :)\n\n"
    },
    {
      "time": "11 Apr 2009 — 10:37am",
      "content": "Welcme to flickr then. I haven't put much new stuff on [my flickr page](http://web.archive.org/web/20150420054238/http:/www.flickr.com/photos/11494488@N05/) lately. Need to start exporting new things as png and photograph printed matter...\n\n"
    },
    {
      "time": "11 Apr 2009 — 11:06am",
      "content": "Cool, Jelmar. I love how your Furet font is looking...are you still working on it? Haven't seen it on the crit board for ages.\n\nI like your family portraits too, very good.\n\n"
    },
    {
      "time": "11 Apr 2009 — 12:01pm",
      "content": "Wow, some great pictures, Jelmar. I dig the duct tape project. And Furet looks very yummy!\n\nBen: Now I'm _really_ envious. I should say intrigued though. :-)\n\nHappy Easter guys.\n\n"
    },
    {
      "time": "11 Apr 2009 — 5:26pm",
      "content": "Ben: thanks, yes Furet is still in the works, although I've put it on the sideline for the moment, to return to it with a fresh eye. I made that preliminary specimen because it was a project I was doing at art academy, so I had to show it.\n\nAnd I was quite pleased with the family portraits myself too. ;)\n\nNina: Yeah, the duct tape project was quite fun to do. Unfortunately we had very little time to 'tack it on' so to speak. But in spite of that, I think it turned out pretty ok. :)\n\n"
    },
    {
      "time": "11 Apr 2009 — 10:28pm",
      "content": "At least it does not look too tacky :-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Apr 2009 — 12:28am",
      "content": "Hi Nina,\n\nWelcome to flickr!  \nKeep them coming, I want to see more...\n\nSome of my sets for typography:  \n [Typography](http://web.archive.org/web/20150420054238/http:/www.flickr.com/photos/23744134@N08/sets/72157616563946080/)  \n [Typography Exercises](http://web.archive.org/web/20150420054238/http:/www.flickr.com/photos/23744134@N08/sets/72157613827488696/)\n\nCheers,\n\nJuan\n\n"
    },
    {
      "time": "12 Apr 2009 — 1:59am",
      "content": "Thanks, Juan! I got quite absorbed in your Signs & Street Art set. Had to close that window now, otherwise I'll never do anything else today. ;)\n\n"
    },
    {
      "time": "12 Apr 2009 — 9:59am",
      "content": "Hehe Chris, no indeed. I wanted to listen to the Rolling Stones album Sticky Fingers when I was working on that project, but unfortunately I didn't bring my laptop... ;)\n\n"
    },
    {
      "time": "14 Apr 2009 — 5:26am",
      "content": "Hi Nina, lovin' Ernestine. 'A night with Ernestine' makes me want to see more... Is there more - like a pdf? I particularly love the 'g' which may be the 'signature' glyph.\n\n"
    },
    {
      "time": "14 Apr 2009 — 8:03am",
      "content": "Thanks Nick! I'm glad to hear that. (Especially about the \"g\"! My favorite glyph in there, and it took me a while to figure it out.)\n\nErnestine is hoggin' a long thread in the critique section,\\* of which an update is imminent – I'll post a PDF of the full alphabet (with caps, and hopefully a first draft of the numerals) very shortly, certainly this week. I'm not really wanting to show too much of it on Flickr before it goes up here.\n\n\\* [http://typophile.com/node/53395](http://web.archive.org/web/20150420054238/http:/typophile.com/node/53395 \"http://typophile.com/node/53395\")\n\n"
    },
    {
      "time": "14 Apr 2009 — 11:04am",
      "content": "How did I miss that? I guess I loiter in the Sans section mainly. I'll check it out properly soon though, you can be sure. Thanks for sharing it.\n\n"
    }
  ]
}
