{
  "id": "56891",
  "title": "Clean but not sterile sans, please critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This is a sans I've been fiddling with for a while. It's my first serious attempt at type design, and my eyes are already weakening so I've decided to ask here. Please butcher what I have:\n\n ![](http://web.archive.org/web/20150414223705im_/http:/typophile.com/files/Correla-Metrics-1_5442.jpg)\n\nThanks. It has a bit of contrast, I've tried making this have almost no contrast, but I didn't quite like it. Still struggling my way with the contrast for the figures, where to put the weight and how to balance it, etc.\n\n",
  "author": "thranduil",
  "time": "11 Apr 2009 — 2:09am",
  "uid": "42692",
  "comments": [
    {
      "time": "11 Apr 2009 — 3:08am",
      "content": "Quite like it. Shall leave it for the more experience members of this community to critique it.  \n- san ideos\n\n"
    },
    {
      "time": "20 Apr 2009 — 2:18pm",
      "content": "I like the idea, but I think the tail of the \"y\" is a little too short.  \nAlso the a curve (at top) is a bit too \"open\" and you could try to make the K and k merged instead of a horizontal line between the two parts.  \nI think you'd better use dots or (unrotated) squares instead of the shapes you now have as points.\n\nKeep up the good work! ;)\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "22 Apr 2009 — 9:32am",
      "content": "Thank you all for the feedback! Summer semester has started, so once again I have no time to update this as much as I would want to.\n\nAnyway, I'll critique myself:  \n1. vxy thin, add a little width to w  \n2. top of K looks too heavy  \n3. what's up with S?  \n4. UVW too narrow?  \n5. widths are not consistent, some look a bit heavy than the others. for example, B, w, x, etc  \n6. make this monolinear, I don't think the width differences work on this. I don't know.  \n7. g looks weak, as is j and a  \n8. proportions are really off\n\n"
    },
    {
      "time": "24 Apr 2009 — 4:18pm",
      "content": "It would be nice to see a pdf ;)  \nCrossbar on G is a bit low.  \nM has a heavy middle that seems to have sunk to the baseline.  \nB and S are funny shapes.  \nEye of e is too small?  \nI don't think the Kk with crossbar is a problem.  \np and d are not good curves.  \nu maybe too wide.  \nProportions of numerals are off. Bottom half should be bigger. Question mark should flow rather than the corner?\n\nI think you can definitely get a worthwhile font out of this, just need to make the shapes harmonise better :)\n\n"
    },
    {
      "time": "26 Apr 2009 — 12:49am",
      "content": "Now that I haven't looked at this thing for two weeks, I can see that B is weird in relation to the rest. Thank you Ben for the feedback. It's true that p and d are really off, due to the sharp curves that form from the stem. I seem to have trouble making them smoother like b and q with the x-height and width. And yes, the numerals are way, way off.\n\nI'll post a pdf when I update this over next week's weekend; I'll probably redraw this from scratch to reconsider things.\n\n"
    }
  ]
}
