{
  "id": "56919",
  "title": "Popular Typefaces used in Signages",
  "forum": "Design",
  "tags": [

  ],
  "content": "I wrote an article on signage typefaces last night. I hope it can be useful to you.  \n [http://www.coma.sg/articles/opinion/signage-typefaces/](http://web.archive.org/web/20090419081301/http:/www.coma.sg/articles/opinion/signage-typefaces/)\n\n",
  "author": "<a href=\"/web/20090419081301/http://typophile.com/user/43672\" title=\"View user profile.\">AenTan</a>",
  "time": "<br>",
  "uid": "43672",
  "comments": [
    {
      "time": " 12.Apr.2009 9.45am",
      "content": "Given how much has been written on the subject, your article does not add anything of significance. And where did you get that item that Clearview is legible up to 60 mph? Legibility is not about speed, it is about viewing distance!\n\n"
    },
    {
      "time": " 12.Apr.2009 10.21am",
      "content": "That is not an article, it is a collection of seemingly-related factoids and innaccuracies fluffed up with a pointless introduction and some photographs.\n\n"
    },
    {
      "time": " 12.Apr.2009 10.46am",
      "content": "<cite>For those of you who still don’t know the difference a typeface and a font, I will tell you now once and for all.<cite></cite></cite>\n\nAh, thanks, now we finally know! And no more discussions, please.\n\nSo, [Thomas Phinney’s survey](http://web.archive.org/web/20090419081301/http:/www.thomasphinney.com/2009/04/font-terms-survey-results) was in vain, what a pity.\n\n"
    },
    {
      "time": " 12.Apr.2009 10.57am",
      "content": "By the by, who uses Rotis for street signage?\n\n"
    },
    {
      "time": " 12.Apr.2009 6.10pm",
      "content": "Actually, Singapore uses Rotis for street name signs. I remember years ago providing 3M SIngapore with spacing charts similar to Clearview for them to apply to Rotis (optically condensed at that). Frightening, absolutely frightening!\n\n"
    },
    {
      "time": " 12.Apr.2009 8.34pm",
      "content": "Remind me never to go to Singapore.\n\n"
    },
    {
      "time": " 12.Apr.2009 8.49pm",
      "content": "Harsh comments.\n\n"
    },
    {
      "time": " 13.Apr.2009 7.50am",
      "content": "Sorry, I didn’t realize the author was from Singapore. Hopefully they don’t take our distaste for Rotis personally.\n\n"
    },
    {
      "time": " 13.Apr.2009 9.34am",
      "content": "The good bits are actually in the external links I included in the article, e.g. Clearview. I didn’t want to repeat anything that has already been written. It’s a window to some of the lesser known typefaces used in applications some might take for granted. I did not mean it to be some kind of scientific paper.\n\nAny typeface is a good typeface as long as it can be used effectively somewhere. I despise wannabe type experts who make childish claims like “Arial sucks”, “Who uses Rotis?”, “avoid Helvetica”. They obviously have no clue to make such fashionable comments.\n\nAnyway it’s my first post in these boards so I thought I start off with a bit of contribution. Sorry if wasn’t to your liking.\n\n"
    },
    {
      "time": " 13.Apr.2009 1.20pm",
      "content": "Nice to have them all in one place, thanks and welcome!\n\nCheers.\n\n"
    },
    {
      "time": " 13.Apr.2009 2.09pm",
      "content": "For a more detailed compilations read Ralf Hermann’s wiki: [http://www.typografie.info/typowiki/index.php?title=Schriften\\_auf\\_Verkehrszeichen](http://web.archive.org/web/20090419081301/http:/www.typografie.info/typowiki/index.php?title=Schriften_auf_Verkehrszeichen) and blog entries: [http://opentype.info/blog/category/traffic-typefaces/](http://web.archive.org/web/20090419081301/http:/opentype.info/blog/category/traffic-typefaces/) and this thread: [http://typophile.com/node/39661](http://web.archive.org/web/20090419081301/http:/typophile.com/node/39661)\n\n"
    },
    {
      "time": " 13.Apr.2009 8.54pm",
      "content": "@ Clauses. I didn’t know that existed. I thought I was googling pretty extensively. Wish the stuff was in English though. Thanks much.\n\n"
    },
    {
      "time": " 13.Apr.2009 11.53pm",
      "content": "@AenTan:  \nYou did not ask me for permission to upload this image of mine to your website.  \n [http://www.coma.sg/wp-content/uploads/2009/04/din1.jpg](http://web.archive.org/web/20090419081301/http:/www.coma.sg/wp-content/uploads/2009/04/din1.jpg \"http://www.coma.sg/wp-content/uploads/2009/04/din1.jpg\")  \nPlease remove it and check the rights of the images you use for your articles. It is NOT enough just to mention the source.\n\nRalf Herrmann\n\n"
    },
    {
      "time": " 14.Apr.2009 12.18am",
      "content": "Hello to a fellow Typophile from SG :)\n\nI agree with James - Much has been written on the subject. Perhaps calling it an article raised expectations?\n\nOn a side note: Sander Baumann’s blog - [DesignWorkPlan](http://web.archive.org/web/20090419081301/http:/www.designworkplan.com/) - is one of my favourite haunts for signage/wayfinding stuff.\n\n"
    },
    {
      "time": " 14.Apr.2009 1.29am",
      "content": "Also, check out the chapter on the carefully thought-out, but never used MoT Serif in the book “Type: The secret History of Letters”. Great reading, and I sort of like the unconventianal result - wish it were used somewhere, though maybe not in my hometown.\n\n"
    },
    {
      "time": " 14.Apr.2009 4.26am",
      "content": "Give him a break. I appreciate the contribution! Good stuff in your portfolio as well.\n\nAnd Ralf Hermann you should be ashamed of yourself claiming copyright to such a generic and overworked photo student image. It’s not like he is capitalizing on it is he...\n\n-  \nMax\n\n"
    },
    {
      "time": " 14.Apr.2009 4.54am",
      "content": "<cite>And Ralf Hermann you should be ashamed of yourself claiming copyright to such a generic and overworked photo student image. It’s not like he is capitalizing on it is he...</cite>\n\nI am not ashamed at all. For the last 2 years I travelled all over Europe to research this topic and to gather my own images. It took me a lot of time and money to collect all those images. If I let AenTan use it, it’s likely gonna get linked and re-blogged by others and soon the source will not even be known anymore. I can’t let this happen and it is my right to do so, whether you like the image or not.  \nBTW: This image is not “generic” at all. It may not win a contest for professional photographies, but it is at least very special to me, since it is a very rare finding of signs that survived from East Germany. It’s not something you can find on every corner here in Germany and it took me a very long time to track one of those signs down.\n\n"
    },
    {
      "time": " 14.Apr.2009 5.33am",
      "content": "Ralf, why not feel honoured that he choosed to use your image? I am sure that you at one some stage have used other peoples images as reference, for presentation etc.\n\nBut most importantly - why didn’t you email or PM him regarding this concern? Why did you have to jump on the bandwagon of critique against this first time poster at the forums. I am not a regular here since some time ago so I am not sure if this is a common way of treating people - I hope that’s not the case since it’s very unsympathetic!\n\nI am sure you’ve done one helluva job regarding your research and I am glad that there are people like you doing this kind of stuff with engagement as only investment (and no payment) I also think that’s the spirit of aentan’s writing as well. No matter my subjective view on the actual content.\n\n-  \nMax\n\n"
    },
    {
      "time": " 14.Apr.2009 5.50am",
      "content": "@jabez Thanks for the mention, appreciated!\n\n@AenTan Thank you for creating an article about signage typefaces. When it comes to designing signs using type you must make a difference between its surroundings in which the signs/wayfinding systems will be placed. Typefaces like ClearView and Interstate can work beautifully for road signs but will not work so good at for instance hospital wayfinding. Therefore it is difficult to compile a list of typefaces that will work under all conditions.\n\nFrom my findings, these are (some of) the characteristics of a good signage typeface:\n\n- Usage in a clear and straightforward design\n- Easy recognizable letterforms\n- Large x-height\n- Positive letter spacing to enhance the visual appearance\n- The typeface includes a package of many different weights\n\n"
    },
    {
      "time": " 14.Apr.2009 6.18am",
      "content": "<cite>Ralf, why not feel honoured that he choosed to use your image? I am sure that you at one some stage have used other peoples images as reference, for presentation etc.</cite>\n\nListen. It’s Ralf’s image, he is it’s copyright holder, and he does not have to justify that others can not use it. If you want to use other peoples copyrighted work, then you ask before hand. Using other peoples work fall under ’fair use’ doctrine (will vary from territory to territory) and AenTan’s blog entry is most certainly not fair use. Further I find it very unbecoming of you Max to bring this laissez faire attitude to this forum where we designers have enough trouble as it is informing people that theft of our intellectual property is not ’all right’.\n\n/Claus\n\n"
    },
    {
      "time": " 14.Apr.2009 10.24am",
      "content": "That’s like only having four flavors of jelly beans and you want chocolate. Fine for highway and airport signage, I guess, but extremely limiting.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090419081301/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 14.Apr.2009 10.40am",
      "content": "Let he who is without sin cast the first stone.\n\n"
    },
    {
      "time": " 14.Apr.2009 10.46am",
      "content": "Let he who is without sin cast the first stone.\n\n?\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090419081301/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 14.Apr.2009 10.46am",
      "content": "<cite>Typefaces like ClearView and Interstate can work beautifully for road signs but will not work so good at for instance hospital wayfinding. Therefore it is difficult to compile a list of typefaces that will work under all conditions.</cite>\n\nIn which way do you think the type design should differ between traffic signs and hospital signage? Sure there are some specific problems like retroreflectivity of road signs and limited space on hospital wall, but in general I think the problems and solutions are pretty similar. You want the information to be readable as soon as possible, even if the letters are small/far away (which has the same effect). If you have a typeface that achieves this, it should work in almost every signage situation (with a little tweaking of maybe spacing and stroke width).\n\n"
    },
    {
      "time": " 14.Apr.2009 10.59am",
      "content": "There are aesthetics to consider beyond readablity. Your font should work with the architecture and the landscaping.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090419081301/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 14.Apr.2009 11.16am",
      "content": "Clauses. You mean bringing my attitude to this forum where designers have enough trouble to be uptight and unwelcoming to a new guy that actually tries to contribute to the forums? And yes, he might have violated copyright laws. I just think people should relax a bit about this kind of copyright violations. He’s not trying to make money out of this, and seriously how many c violations have one been guilty of during years in design school, running a blog etc? Visit deisgnobserver.com and I guess they are guilty of a few, or newstoday, or similar. I know it is like swearing in church talking like this in forum for typedesigners that struggle hard to make a living out of their hard work. And it’s not that I’m not against copyright, but i am pro common sense and I can’t see the point of making this public in the forums (and being more unwelcoming) instead of just sending a mail about this. And as for me thinking ralf “should be ashamed” I just got angry about everyone being pricks towards aentan and I got it out on the last one saying something. I owe him an apology: I am sorry Ralf!\n\n-  \nMax\n\n"
    },
    {
      "time": " 14.Apr.2009 11.32am",
      "content": "\\>in general I think the problems and solutions are pretty similar.\n\nRalf, I’m surprised you say that. The problem of reading road signs at night is a pretty special problem, not shared by hospital corridors, which are generally well lit, at least in richer countries.\n\nReading a sign at night, whether it is reflective or not, is an added problem because of low light. The eye just doesn’t work as well at low light, particularly for older drivers. As I remember this was the main ’brief’ for James M’s Clearview: it had to work better than alternatives at night for older drivers.\n\nAlso in a hospital you can just move closer to a sign. You don’t have to worry about missing an exit, so there isn’t the same degree of demand for clarity at a distance.\n\nI would think that for hospital signage there would be much more leeway on readability under adverse conditions.\n\n"
    },
    {
      "time": " 14.Apr.2009 12.00pm",
      "content": "Hey Ralf. I’m from Singapore and only saw your reply a few minutes ago. I chose your image because it is the perfect image for the post.\n\n_If I let AenTan use it, it’s likely gonna get linked and re-blogged by others and soon the source will not even be known anymore._\n\nOk, tell me the difference between that happening beginning from your site and mine. The moment I included it in my post, it has already happened. Or should I say the moment you put in online.\n\nIt’s the perfect shot and I love it and many of your other photos. I want to tell people that you are the photographer. You will have to DMCA me to stop me from doing that. AND IT’S NOT FOR MONEY.\n\n"
    },
    {
      "time": " 14.Apr.2009 12.56pm",
      "content": "@William  \nI am aware of the different lighting environments of road signs and hospitol corridors, but I was asking about actual type design decisions for these situations. And I really think that those design decisions are not really different if you design a typeface for a road sign or a hospital sign. I don’t think I would make a different design for “low light” or “older viewers” or “hospital corridors”. I would just make it the most legible I can, and this is mostly about the skeleton of the letters, since weights, widths and spacing are easily changable with MM technology. But I am really curious to know, if there should be different design decisions made for road signs and hospital signs. (And I don’t mean decisions about “style”)\n\n<cite>You will have to DMCA me to stop me from doing that. AND IT’S NOT FOR MONEY.</cite>\n\nUploading a copyrighted image to your website without permission is a copyright infringement according to the law of almost all countries. Whether your site is commercial or not. By the way: Your site is commercial since you are offering design work under the company name “Communication Analysts Pte Ltd” on the same website. And I think you are very well aware what a copyright is, since you claim a copyright yourself on all your pages: “© 2009 COMA. All Rights Reserved”.  \nWell, I reserve the right not to show my image on your site and ask you one last time: Remove it by April, 17. 2009 or I will legally enforce it.\n\nBy the way: If you’re looking for a replacement for my image: Just check out Wikipedia Commons:  \n [http://commons.wikimedia.org/wiki/Category:Road\\_signs\\_by\\_country](http://web.archive.org/web/20090419081301/http:/commons.wikimedia.org/wiki/Category:Road_signs_by_country \"http://commons.wikimedia.org/wiki/Category:Road\\_signs\\_by\\_country\")  \nThere are thousands of road sign images with a Public Domain or Creative Commons license.\n\n"
    },
    {
      "time": " 14.Apr.2009 2.05pm",
      "content": "“There are aesthetics to consider beyond readablity.”  \nSo close...  \n“Your font should work with the architecture and the landscaping.”  \n...yet so far. :)\n\nYou can’t mean that. The difference in needs of way finding signage is not about architecture or landscaping, unless those too are not about the people using them.\n\nCheers!\n\n"
    },
    {
      "time": " 15.Apr.2009 12.35am",
      "content": "Oh dear..looks like this is getting alot of stick:( I’m from Singapore..and our street signs weren’t always in Rotis. The stuff they use on the roads and expressways is not rotis..so driving around isn’t that terrible I can assure you.\n\n"
    },
    {
      "time": " 15.Apr.2009 5.12am",
      "content": "_You can’t mean that. The difference in needs of way finding signage is not about architecture or landscaping, unless those too are not about the people using them._\n\nTry telling that to an architect.\n\nA clear reading sign is almost always the primary goal. But, wayfaring signs in an architectural setting, should not detract from the aesthetics of their surroundings.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090419081301/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 15.Apr.2009 5.29am",
      "content": "\\>if there should be different design decisions made for road signs and hospital signs\n\nBasically, I think the hospital situation is a lot less demanding in some ways, and so has a lot of scope for variety. You’re not flying down the corridor at 60 miles an hour, so you don’t have to make a decision before you get close to the sign. And you’re not looking at the sign with a flashlight at night, at a distance.\n\nFor the specific demands of the highway see the [New York Times article](http://web.archive.org/web/20090419081301/http:/www.nytimes.com/2007/08/12/magazine/12fonts-t.html?pagewanted=1) and [The Clearview Highway web site](http://web.archive.org/web/20090419081301/http:/clearviewhwy.com/ResearchAndDesign/index.php).\n\nI do think there are lessons that can be carried over for other signage from what Meeker & Montalbano did, but I doubt they are really a requirement for successful signage in less demanding situations.\n\n"
    },
    {
      "time": " 15.Apr.2009 8.34am",
      "content": "You might not be flying down a corridor at 60 mph in a hospital, or airport terminal (a much better example), but you would still want to be able to read a sign at a proper and reasonable distance. Nothing about the research we did had anything to do with speed. It was all about viewing distance. Now if you are traveling at 60 mph and you can read a sign at a greater distance, you will have more time to react, but it is all about increasing the viewing distance.\n\nWhat is a more or less demanding situation? I dunno, but some airport terminals I’ve been in are a helluva lot more dangerous than some roads I’ve driven down.\n\n"
    },
    {
      "time": " 15.Apr.2009 9.24am",
      "content": "James, a couple of things.\n\nFirst, as I noted, I think other designers can benefit from the superb work what you and Meeker did. The bit I found most interesting, because somewhat surprising, is that a medium weight is more legible at a distance than a bold one. The ’reading’ of more white in the counters is more important than a heavier stroke.\n\nSecond, what is a better example depends on what you want to exemplify. The airport is more like the highway, because the way many—not all—are designed, you need to see signs at greater distances. The hospital less so. That’s why I said it seems to me you have more leeway in a hospital situation—less need for legibility at a distance.\n\nI once was in the El Paso airport, and its signage is all in FB Eagle Bold or Black, including very bold and eccentric lower case. Somehow in that context it looks Tex-Mex and wonderfully lively and expressive. It is all legible at the distances you need to view it in that small corridor-style airport. But it would be rotten on highway signs.\n\n"
    },
    {
      "time": " 15.Apr.2009 12.12pm",
      "content": "“Try telling that to an architect.”  \nNo, you do it. I already had this conversation with my ex-architect’s friend. He asks what makes me think I can design my own house? I ask what makes him think he can design my house? Then it’s time for weather and sports.\n\n“But, wayfaring signs in an architectural setting, should not detract from the aesthetics of their surroundings.”  \nThey souldn’t but what’s the priority?\n\nCheers!\n\n"
    },
    {
      "time": " 15.Apr.2009 1.12pm",
      "content": "@ Ralf. I changed the image. Ever considered creative commons?\n\n"
    },
    {
      "time": " 15.Apr.2009 1.44pm",
      "content": "“They souldn’t but what’s the priority?”\n\nWhat ever the client wants to take priority. The only time people really want to notice signs is when they are relevant to them. Like any other design, signs must fit in their environment.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090419081301/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 16.Apr.2009 2.16am",
      "content": "<cite>airport is more like the highway, because the way many—not all—are designed, you need to see signs at greater distances. The hospital less so. </cite>\n\nBut distance is compensated by the type size. A small sign with small type sizes can be the same reading experience as a huge interstate sign. And if I am bleeding and rush into a hospital I want those signs to be readable as soon as possible ... ;-)  \nSo the distance itself is not really relevant for those typeface. As James said: it’s how you can design the typeface in a way in which the viewing distance is increased compared to other typefaces set in the same size.\n\nBTW: James, do you know why bright text on dark background is considered “positive” contrast when in comes to traffic signs in the US? Usually in graphic design “positive” and “negative” would be used the other way around. And also in Europe when it comes to traffic signs.\n\n<cite>@ Ralf. I changed the image. Ever considered creative commons?</cite>\n\nOf course. On my Wiki I have written hundreds of articles released under Creative Commons license. But for images that are special to me, I invite everyone to view them on my page but I reserve the right that they are not re-used on other pages.\n\n"
    },
    {
      "time": " 16.Apr.2009 8.49am",
      "content": "Ralf, I’m not buying your arguments because I’ve seen signage work fine, including as I mentioned at El Paso Airport, with type that is not optimal for distance viewing. Distance recognition just isn’t as important in many situations, though it’s paramount for highway signs.\n\nAnd entry signs—such as those directing you to Emergency—can be just made bigger. The cost factor of big highway signs just isn’t the same for a few entry signs in a building—which you’d probably want to make bigger in any case.\n\n"
    },
    {
      "time": " 16.Apr.2009 10.13am",
      "content": "There is a limit to how large exterior signage for hospitals, office complexes, etc. can be. These sizes are established by right of ways and city governments. These laws are not generally waved even for hospitals. Highways have only the restricions set by the governing body of the highway which are not answerable to city government or codes.\n\nThe most important consideration between archiectural wayfaring signs and highway signs (beyond scale) is speed. Because you only have a limited amount of time between reading a sign and taking action on a highway, visual distance is much more important. I don’t do 60+ mph in hospital corridors.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090419081301/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 16.Apr.2009 10.52am",
      "content": "<cite>BTW: James, do you know why bright text on dark background is considered “positive” contrast when in comes to traffic signs in the US? Usually in graphic design “positive” and “negative” would be used the other way around. And also in Europe when it comes to traffic signs.</cite>\n\nRalf,\n\nWhen we were first confronted with this terminology we were quite confused. As far as I can tell, from what traffic researchers tell me, is that it has something to do with the number one gets when calculating the reflection of the image. A positive contrast yields a positive number, negative contrast yields a negative number.\n\nWhen we were naming the different ClearviewHwy fonts, Phil Garvey, one of the researchers suggested that we use W to indicate White letters, and B to indicate black letters, rather than use Positive or Negative in the actual name.\n\n"
    }
  ]
}
