{
  "id": "56922",
  "title": "Inktrapping",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "In [my previous thread **(Beginning with/Besides the \"g\")**](http://web.archive.org/web/20150417121801/http:/typophile.com/node/54942) I obtained an unsuspected result in shaping an individual character, that obvioulsy influenced the rest of the typeface:\n\n ![](http://web.archive.org/web/20150417121801im_/http:/typophile.com/files/g-force_6019.png)\n  \nBeing the basic structure is almost done, now it's time to make some subtle adjustments.  \nThis is the current uppercase alphabet: \n ![](http://web.archive.org/web/20150417121801im_/http:/typophile.com/files/Picture1_5992.png)\n\n ![](http://web.archive.org/web/20150417121801im_/http:/typophile.com/files/Picture2_6068.png)\n  \nAnd these are some samples of what I'm starting to do about trap (BTW, thanks to [Hrant Papazian's technique guidance](http://web.archive.org/web/20150417121801/http:/themicrofoundry.com/ss_trapping1.html)): \n ![](http://web.archive.org/web/20150417121801im_/http:/typophile.com/files/Picture3_5975.png)\n\n ![](http://web.archive.org/web/20150417121801im_/http:/typophile.com/files/Picture4_5616.png)\n  \n[I'll post a PDF for best viewing, beyond the lack of hinting]  \nI'd like to hear some critique, the harder, the better.  \nThank you. \n",
  "author": "Marcelo Soler",
  "time": "12 Apr 2009 — 11:04am",
  "uid": "32203",
  "comments": [
    {
      "time": "12 Apr 2009 — 4:42pm",
      "content": "Nice, I think they look rather polished. Hrant's trapping technique looks interesting. What kind of diameter circles are those? I'll wait for the PDF to look at it more closely.\n\n"
    },
    {
      "time": "12 Apr 2009 — 5:33pm",
      "content": "Thanks, Jelmar.  \n_What kind of diameter circles are those?_  \nI'll post an explanatory PDF on this, ASAP.\n\n**MarS**\n\n"
    },
    {
      "time": "13 Apr 2009 — 5:37pm",
      "content": "I think the traps look promising, but to be honest, for me at least it's pretty futile to try and judge inktraps (of all things!) by staring at huge glyphs on a monitor. Hell, I can't even tell if you need traps. So, yup, looking forward to the PDF. :-)\n\nAlso, I'd second Jelmar, I'd love some explanation on how exactly you applied Hrant's method!\n\n"
    },
    {
      "time": "14 Apr 2009 — 8:44am",
      "content": "_\"...to be honest, for me at least it’s pretty futile to try and judge inktraps (of all things!) by staring at huge glyphs on a monitor.\"_  \nLOL! It's somehow a \"voyeuristical\" task, ain't it? Even in hard copies, I tend to think of ink traps more as a shape-for-the-shape-itself (BTW, not necessarily arbitrary) than as a functional unavoidable requirement.\n\n**MarS**\n\n"
    },
    {
      "time": "14 Apr 2009 — 9:49am",
      "content": "I agree that it is rather futile to judge inktraps on screen, to judge if you even need them at all. Although I think it's safe to say that you always need some form of optical correction (in the form of inktraps or in other ways). And yes, I think aesthetics also plays a role (shape-for-the-shape-itself).\n\nLooking forward to the PDF about the trapping technique (it's Hrant's technique, so he must be okay with it).\n\n"
    },
    {
      "time": "13 Jun 2009 — 6:44am",
      "content": "Hey, any update on this? Long time no see.\n\n"
    }
  ]
}
