{
  "id": "56935",
  "title": "Two tildes? Spanish, Portuguese and everything else",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've read (mostly on Typophile) that in Spanish typography the tilde should point upwards, with the middle segment almost horizontal. So I designed a tilde like that. Of course, a spacing tilde should have the more common angle (for use in URLs, mathematics, etc.).\n\nBut I have two worries. The first is that the tilde on my \"n\" doesn't match the others. Does Spanish use a tilde on other characters? What about Spanish words in other-language texts? Will it look awkward?\n\nMy other worry is other languages that use the ntilde. Are there any? Is the Spanish-style acceptable/correct in these languages?\n\nI know OpenType allows one to specify language-specific substitutions. Should I use them? What software actually implements this?\n\nLastly, have I got the shapes right?\n\n ![](http://web.archive.org/web/20131018115115im_/http:/typophile.com/files/tilde_4199.png)\n\n",
  "author": "mr",
  "time": "13 Apr 2009 — 3:50am",
  "uid": "19503",
  "comments": [
    {
      "time": "13 Apr 2009 — 4:59am",
      "content": "I can answer only a couple of your questions, because I speak for Spanish, only.\n\n1. Does Spanish use a tilde on any other characters? No. Just the N. I am fairly certain that Portuguese uses a tilde on either the a or the o, but you'll have to consult a Portuguese speaker on that one.\n\n2. I'd be curious to read more about the idea that the tilde should \"point up.\" The example you show of a tilde over the n seems to be \"flying away.\" It doesn't look right to me. The tilde example you show over the a looks more like what I would expect to see over an ñ in Spanish.\n\nHope that helps get the conversation rolling.\n\n"
    },
    {
      "time": "13 Apr 2009 — 5:15am",
      "content": "Portuguese definitely uses atilde. \"Pão\" is Portuguese for bread.\n\nI'm looking for a reference on the upward tilde.\n\n"
    },
    {
      "time": "13 Apr 2009 — 5:24am",
      "content": "[Matthew Stuckwisch's blog](http://web.archive.org/web/20131018115115/http:/mateo.elahorcado.net/blog.php?post=20080318152234) discusses the Spanish tilde, with examples of handwriting and several fonts.\n\nI do think the version above is a little extreme, and I've shortened the end strokes so it looks less like it's flying away. The middle bar still only dips very slightly, though.\n\n"
    },
    {
      "time": "13 Apr 2009 — 6:01am",
      "content": "\"I’ve read (mostly on Typophile) that in Spanish typography the tilde should point upwards, with the middle segment almost horizontal.\"\n\nI have not read that on Typophile, but this I can tell you — 15 or so years ago, when the Spanish-speaking market was embracing the new technologies for news, magazine and book publishing, (and Font Bureau was embracing back), I had a note passed onto me from a famous Spanish-speaking artist who had been using some of our fonts to compose a book. He was pleased our tildes did not look like \"the \\_\\_\\_\\_\\_\\_\\_\\_\\_ ones from Adobe which seem to be 'flying away'\".\n\nWith no Spanish-speaking clients complaining against a 'running' tilde since then, I came to the conclusion that the flying tilde may be proper for calligraphic or historic designs, but perhaps not for typographic designs. With the addition of the low-resolution/poor-print-quality appearance of a running tilde proving unique-r amongst the accents than the flying tilde, our die was/is cast.\n\nBut as always, if a 'special' is needed by anyone, in any of our fonts, for any language, we're happy to oblige whatever local designs apply.\n\nCheers!\n\n"
    },
    {
      "time": "13 Apr 2009 — 6:12am",
      "content": "I am from Brazil, speak portuguese.  \nPortuguese uses: \"a\", \"o\"  \nExample: \"Coração\" (heart), \"corações\" (hearts, the plural)\n\n"
    },
    {
      "time": "14 Apr 2009 — 1:00am",
      "content": "I grew up learning Spanish and English, in both the U.S. and in Argentina, and I have never, ever, seen a tilde that is flying away... until now, that is. And not one of my Argentine schoolteachers ever mentioned such a thing.\n\n ![](http://web.archive.org/web/20131018115115im_/http:/typophile.com/files/caslon_224_3989.png)\n\nThe above example is taken from [ITC Caslon 224](http://web.archive.org/web/20131018115115/http:/new.myfonts.com/fonts/bitstream/itc-caslon-no-224/itc-caslon-224-book/characters.html)... This is how the tilde should be placed.\n\n"
    },
    {
      "time": "14 Apr 2009 — 1:56am",
      "content": "Damnit I had just typed up a long response and IE at work deleted the whole thing. I need to update my blog posting as I've collected more examples to show in the past few months and also to simply clarify my position. But it's important to note it's primarily about the tilde in Spanish. Other languages, as I noted, probably (surely) have different traditions.\n\nBoth of your tildes are fine to me though I'd move the one on the n a little more to the right. Probably best though to go for something in between the two but that depends on what your tilde and acute are based on. The thing to avoid is one which appears to be heavily slanted the other way (even though the curves are properly placed).\n\nAs to do a language based swap, I know of handwriting fonts that do that for a number of differention langauge's diacritics, including making the ñ a macron, or in German making the umlaut a macron (or was it more like a tilde? I forget).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "14 Apr 2009 — 10:36am",
      "content": "I try to make tildes look flat, on the principle that grave and acute are the angled accents.  \nAFAIK, only (polytonic) Greek has both tildes and macron, although strictly speaking the Greek \"tilde\" is a\n\nI've noticed that the apparent angle of the tilde varies with optical size in faces with stroke contrast.  \nThis is because the tails are less significant at small sizes, causing the glyph to apparently rotate clockwise slightly.\n\n"
    },
    {
      "time": "15 Apr 2009 — 5:14am",
      "content": "<cite>\"…although strictly speaking the Greek “tilde” is a\"</cite>  \nA what?\n\n"
    },
    {
      "time": "15 Apr 2009 — 5:56am",
      "content": "... a circumflex\n\nSzabolcs\n\n"
    },
    {
      "time": "15 Apr 2009 — 10:20am",
      "content": "...perispomeni. I was just checking the spelling and was interrupted, but made the post anyway.\n\nIt can be rendered in either \"tilde\" shape, or \"circumflex\".\n\n"
    },
    {
      "time": "15 Apr 2009 — 10:28am",
      "content": "Thank you. It was an interesting cliffhanger :-)\n\n"
    },
    {
      "time": "15 Apr 2009 — 1:16pm",
      "content": "Make that either \"tilde\" shape or \"inverted breve\".\n\n"
    },
    {
      "time": "30 Apr 2009 — 1:58am",
      "content": "Just remembered the link to the Biblioteca Nacional Digital which Miguel had posted a while ago. One of the pages presents digitized books [in chronological order](http://web.archive.org/web/20131018115115/http:/purl.pt/index/livro/date/PT/index.html). Clicking through some of the books, my impression is that the \"flying tilde\" was the norm (e.g. in books from [1573](http://web.archive.org/web/20131018115115/http:/purl.pt/14441/1/P13.html), [1728](http://web.archive.org/web/20131018115115/http:/purl.pt/13832/2/P8.html), [1757](http://web.archive.org/web/20131018115115/http:/purl.pt/14440/1/P34.html)) and only shortly before 1900, in books typeset in classicistic type, the shape got more 'symmetrical' as is obviously expected today (e.g. [1838](http://web.archive.org/web/20131018115115/http:/purl.pt/1341/1/P11.html)).\n\n"
    },
    {
      "time": "30 Apr 2009 — 10:46am",
      "content": "_Clicking through some of the books, my impression is that the “flying tilde” was the norm (e.g. in books from 1573, 1728, 1757) and only shortly before 1900, in books typeset in classicistic type, the shape got more ’symmetrical’ as is obviously expected today (e.g. 1838)._\n\nNice links, k.l.!\n\nI notice that those first three books you've linked to are all Portuguese books. It would be interesting to compare with Spanish and French books from the same periods (late 1500s, early- and mid-1700s).\n\n"
    },
    {
      "time": "30 Apr 2009 — 11:01am",
      "content": "The wikipage [Libraries](http://web.archive.org/web/20131018115115/http:/typophile.com/wiki/Libraries) has many links to Spanish digital libraries available online.\n\n"
    },
    {
      "time": "30 Apr 2009 — 12:19pm",
      "content": "Thanks, Miguel!\n\n"
    },
    {
      "time": "1 May 2009 — 9:51am",
      "content": "mr said: \"I’ve read (mostly on Typophile) that in Spanish typography the tilde should point upwards, with the middle segment almost horizontal. So I designed a tilde like that\". (...)\n\nAs far as I know, there's no rule on how to design the tilde sign. Even if you think on a typeface for —let's say— spanish language purposes. Only tradition could fit in order to reach to a conclusion. And common sense, of course!  \nMy opinion is that a pointed upwards tilde is not very suitable and quite odd.  \nAnyway, we could find a pointed upwards tilde sample (for lowercase n) in the punches cut by Geronimo Gil, around mid XVIII century in Spain. I believe, it is because of calligraphic influences on his type work.  \nFurthermore, there shouldn't be any difference between spanish and portuguese \"tilde\" sign. Although it is better to design different versions for upper and lower cases (in order to fit better with the width and weight of the characters ‘n’ and ‘N’).  \nBest, andreu\n\n"
    },
    {
      "time": "2 May 2009 — 7:23am",
      "content": "Ab, you are correct (at least for Spanish). According to the Diccionario Panhispánico de Dudas:\n\n<cite>El castellano medieval escogió el dígrafo nn, que se solía representar abreviadamente mediante una sola n con una rayita más o menos ondulada encima; así surgió la ñ, adoptada también por el gallego. Esa rayita ondulada se llama «tilde», nombre dado también al acento gráfico</cite>  \n**Translation:** <cite>Medieval Spanish chose the digraph nn, which was normally abbreviated to a single n with a more or less undulated small line written above; whence the ñ came, also adopted for Galician. This small undulated line is called “tilde”, the same name given to the graphic accent.</cite>\n\nYesterday I saw the first handwritten (well painted) example of an inverted breve for a tilde. I've seen it occasionally in books, especially with large print but nothing made in the past hundred+ year. I'm so mad I didn't have the camera with me. If anyone lives in A Coruña and wants to drive the road from Oleiros to Santa Cruz with their camera for me....\n\n"
    }
  ]
}
