{
  "id": "5694",
  "title": "New magazine - we need help!",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "We launched Spaces magazine last July on a wing & a prayer and very little knowledge of typography. We're at the stage now where we really need to focus on getting the design & typography to work together to give the mag a clearer identity. It's a contemporary interiors and design mag, with a slightly quirky streak, for people who are passionate about their homes.   \n   \nWe currently use Adrenalin for the title, FF DIN Light for text, DIN Regular, Medium & Bold for captions etc, and OcrA for subheads and quotes. Helvetica neue and American Typewriter for heads.   \n   \n ![spaces-pages](http://web.archive.org/web/20131108032331im_/http:/www.typophile.com/forums/messages/29/41042.jpg)   \n   \nI don't know much about typography, but I'm not 100% convinced by the combination & I'm desperately looking for some advice on alternatives - any ideas?\n\n",
  "author": "polygon",
  "time": "19 Jul 2004 — 11:29am",
  "uid": "4240",
  "comments": [
    {
      "time": "19 Jul 2004 — 3:04pm",
      "content": "OCRA & American Typewriter? Yikes!   \none idea... hire a design professional. ;^D\n\n"
    },
    {
      "time": "19 Jul 2004 — 3:34pm",
      "content": "Well, I did say we had a quirky side!   \n   \nOur designer chose the basic fonts when we started and American Typewriter got adopted recently almost by accident when I said I liked Vogue's new look. You think I should have kept quiet?\n\n"
    },
    {
      "time": "19 Jul 2004 — 5:32pm",
      "content": "i was just giving you a hard time before. i think everyone who could best answer your questions is away at Typecon this week... so you might hafta wait a while until they can get back from San Fran.   \nWhat is it about your current shemata that isn't working for you? what kind of look are you wanting to zero in on better? Everything depends on how YOU want your magazine to look and without more information about what you want, i dunno if anyone here can properly guide you where you want to go. So far I've got contemporary and quirky... anything else someone making suggestions should know about?   \n   \nOne thing I would change is that I wouldn't use a san serif for long blocks of text, ie articles.\n\n"
    },
    {
      "time": "19 Jul 2004 — 5:35pm",
      "content": "It looks to me like you did hire a designer.   \nOther than \"...not 100% convinced by the combination,\" what do you specifically object to? The type is too small to see very well so I can't comment on the interaction of fonts.   \nPersonally, I rather like what I can see of it. It is modern and eccentric (much like my own tastes).   \nFor me, it is not so important what you or I think but what your target audience thinks. Why don't you do a letter from the editor asking your subscribers what they think of the design of your publication? Don't ask them about type faces or try to skew their thinking, just ask them to comment on the design. If most comments hate your type, that is one story. My guess is most won't even mention type face combinations. Remember, it is not your magazine, it is your subscribers'.   \n   \nIMHO, leave it as it is for at least a couple of years. It is hard enough to create an identity without changing it every few months. If you do change it, have a good reason. A good reason is NOT, \"I am not sure about this anymore.\"   \n   \nChrisL\n\n"
    },
    {
      "time": "19 Jul 2004 — 9:43pm",
      "content": "Since we are taking type here, I would suggest focusing on adapting font families that are extensive with wide range in weights, sans and serif versions as well as multiple numeral systems and ligatures. If you find your competitors use similar choices I would suggest not using the same. A custom face would be ideal but perhaps funding and time constraints does not allow for such.\n\n"
    },
    {
      "time": "20 Jul 2004 — 12:59am",
      "content": "I think the layout looks nice and clean and appropriate to its subject matter. I like the small gutters between images (reminds me a little of [Self Service](http://web.archive.org/web/20131108032331/http:/www.selfservicemagazine.com/)).   \n   \nThe type that's been chosen is a little over-familiar -- you might want to think about, for each typeface, choosing something similar but less common; similar enough to keep the feel (I agree with Chris L about not messing too much with the overall ID right at the start) but different enough to make it your own.   \n   \nI'm sure you could find good alternates by poking about the board a little -- I'm on my first coffee and have to go to work in 5 mins so can't think right now.   \n   \nBest   \n   \nR\n\n"
    },
    {
      "time": "20 Jul 2004 — 3:07am",
      "content": "OK - here are my concerns:   \n   \nDIN for body copy looks a bit 'lightweight' to me & is not easy to read. We've played with serifs but they change the feel too much.   \n   \nHelvetica neue - we started using Thin Extended for a couple of big headlines etc. but I'd really like to see something which is less cliched before we get stuck on using it regularly. We'd also use for big coverlines.   \n   \nAmerican Typewriter - as I said, we started using rather thoughtlessly. Should we be checking out some other typewriter fonts?   \n   \nI'd really like to choose a serif display font for some heads & subheads to add a little 'colour' where appropriate.   \n   \nOCRA is a bit painful at times, but I like it! The mag is contemporary but not particularly aloof - we like a touch of trashy too!   \n   \nMost of the feedback we get suggests that we are seen as standing out from the crowd (Elle Decoration & LivingEtc). Because the mag content is percieved as being innovative, I think it's very important to gently refine/evolve the design & typography to keep our readers hooked.\n\n"
    },
    {
      "time": "20 Jul 2004 — 8:28am",
      "content": "_We've played with serifs but they change the feel too much_   \n   \nThey say sans are more legible, while serifed faces are more readable. This is why most reading material you see is in a serifed font with sans headings.   \nThey say one's eyes tire after reading a large block of text in a san serif face, and I'd have to agree.   \nThese are two reasons i suggested switching to a serifed face.   \nA third reason is more personal, i guess: if i were to pick up a magazine and see all the articles were in a sans face, i would get the impression that the articles were more for filler than the actual meat of the publication. i'd view such text as big captions for the pictures... but that's just me.\n\n"
    },
    {
      "time": "20 Jul 2004 — 2:10pm",
      "content": "There isn't that much text to tire from in your layouts. Sans is more befitting your audience.   \nIf FF Din light is too light, use medium. Also look at Info, Klievit, Signa, or Dax.   \n   \nChrisL\n\n"
    },
    {
      "time": "20 Jul 2004 — 2:41pm",
      "content": "If you want something DIN-like but more flavored, with many weights and widths check out [Pill Gothic](http://web.archive.org/web/20131108032331/http:/www.veer.com/search/results.aspx?RM=1&RF=1&CD=0&resultsperpage=24&page=1&producttype=TYP&keyword=pill%20gothic&include=&exclude=&vendor=&origPage=-1). It was hatched here at typophile by Christian Robertson, and you can do a search here and read the thread. It has probably gotten the most enthusiastic reception of any face critiqued here.\n\n"
    },
    {
      "time": "20 Jul 2004 — 4:55pm",
      "content": "Pill Gothic looks really good!\n\n"
    },
    {
      "time": "20 Jul 2004 — 5:16pm",
      "content": "...agree with William and Ken , Pill Gothic would be choice. I mentioned earlier in the post there should be a matching serif version to really put it all together, but on second thought considering reader demographics, a straight up big Sans family would suffice, with Pill you also get something that (to most) is   \ncustom looking without the cost of a commisioned custom face.\n\n"
    }
  ]
}
