{
  "id": "56969",
  "title": "Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello everyone-\n\nI am creating this logo for a California health insurance company for public entities. The requirements they gave me was to use kelly green and navy blue, include the state of california, and use a script font for “Cal” and serif font for “HOPE”. I have attached what I came up with... any feedback, please?\n\n| Attachment | Size |\n| --- | --- |\n| [CalHope\\_Logo\\_Ideas.gif](http://web.archive.org/web/20090417115736/http:/typophile.com/files/CalHope_Logo_Ideas.gif) | 6.24 KB |\n\n",
  "author": "<a href=\"/web/20090417115736/http://typophile.com/user/43712\" title=\"View user profile.\">KristaB</a>",
  "time": "<br>",
  "uid": "43712",
  "comments": [
    {
      "time": " 14.Apr.2009 12.18am",
      "content": "so ... you’ve done the bare minimum ... is that good enough?\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090417115736/http:/www.solid-creative.com/)  \n [Short Film Festival](http://web.archive.org/web/20090417115736/http:/www.showusyourshorts.com.au/)\n\n"
    },
    {
      "time": " 14.Apr.2009 1.07am",
      "content": "Once again, I agree with Ratbaggy. There is a lot more to designing a logo than following literal directions of a client.\n\nHonesty? Ok, but it’s brutal.\n\nThe client could do what you’ve done by themselves. Where’s the polish? Where’s the relationship between the typefaces? Where’s any considerations of shape or style? Why would you draw a map of California _so literally_ it looks like grade school clip art?\n\nWarned you.  \nSorry...but sometimes honesty is needed.\n\n"
    },
    {
      "time": " 14.Apr.2009 9.10am",
      "content": "when I get such restricted direction from a client, I usually create one exactly as they discribed (even if it looks dreadful) and couple more versions of my own. Remeber, sudden clients already have a visual sets in stone and they just need someone to bring it to life.\n\n"
    },
    {
      "time": " 14.Apr.2009 9.40am",
      "content": "OK, thank you for the brutal honesty! (that’s why I came here instead of asking friends or family) I am a beginner with logos and I will take any advice you have.\n\nI did try a set that had different typefaces- mostly sans serifs, and some color variations. However, the client didn’t like those. I do agree that if I do something really great that stands out the client may just get rid of all the restrictions and choose that idea. Which would be ideal. Somehow I’m just not getting there. I sometimes get a mental block and find it hard to work on projects that are for things I don’t know much about/have much interest in- such as insurance companies.\n\n"
    }
  ]
}
