{
  "id": "57023",
  "title": "Vietnamese calligraphy using Latin-based script",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There was a discussion in the past few days here about \"the most beautiful alphabet\", and I put in a good word for Vietnamese, partly because of how impressed I've been seeing examples of Vietnamese calligraphy in Quoc Ngu. These calligarphers use Chinese and Nom as inspirations it seems, but because Vietnamese is a largely monosyllabic language it makes literary and philological sense to treat each syllable (with its accompanying diacritic overload) as a single conceptual unit.\n\nIt made me wonder how Vietnamese calligraphers see their work in its historical context - building on the past, relating to the past while avoiding pastiche, or developing new forms, etc. I studied Japanese at university in London and have access to SOAS library, which turned up precisely nothing - there doesn't seem to be anything in English on this subject. The situation of Vietnamese calligraphers might relate to Turkey too in its transition from Ottoman to modern Turkish - Emin Barın's work is example of someone crossing that bridge, working historically and creatively.\n\nFor Vietnamese examples, see [http://www.svcsaigon.com/index.php?thuphap=DetailView&cid=742&catid=23&P](http://web.archive.org/web/20131023205607/http:/www.svcsaigon.com/index.php?thuphap=DetailView&cid=742&catid=23&P \"http://www.svcsaigon.com/index.php?thuphap=DetailView&cid=742&catid=23&P\")...\n\nor just Google Image “thu phap” (calligraphy), and there are some wonderful results.\n\nI've been thinking that this whole subject might make an article if I can get some information together. Does anyone have any Vietnamese contacts with some knowledge about this, or does anyone know any books exploring either modern Vietnamese calligraphy, or the subject of, how shall I put it - transitional calligraphy, calligraphy at a time of script change?\n\nThe same considerations apply to fonts too of course, except perhaps that in font design there is more of an unhappy opposition between pastiche novelty fonts and wholesale adoption of an inappropriate - but inexpensive - Western model.\n\n",
  "author": "letterface",
  "time": "15 Apr 2009 — 6:33am",
  "uid": "42999",
  "comments": [

  ]
}
