{
  "id": "57063",
  "title": "The oldest font, still alive?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was wondering; what is the oldest font, which is now still alive. `[Bad link]` is the oldest one I could find (from 1496). `[Bad link]` is also very old (designed between about 1470 and 1600), but I don't know if it is the oldest one of all. Any ideas?\n\n [‹ Body Copy for Din](http://web.archive.org/web/20150428170244/http:/typophile.com/node/57105 \"Go to previous forum topic\") [On Goin' Legit ›](http://web.archive.org/web/20150428170244/http:/typophile.com/node/56838 \"Go to next forum topic\")\n\n",
  "author": "michielterpelle",
  "time": "16 Apr 2009 — 7:59am",
  "uid": "25755",
  "comments": [
    {
      "time": "16 Apr 2009 — 8:03am",
      "content": "`[Bad link]` is also very old (created around 1540).\n\n"
    },
    {
      "time": "16 Apr 2009 — 8:24am",
      "content": "You're going to have to define \"font\" very specifically. If you mean specific typefaces starting from the advent of cold metal type, then Gutenberg still gets credit, because you can still find that typeface available (digitally, of course), quality not-withstanding.\n\nIf you mean still being used from the original foundry cold metal font, then I think that maybe Caslon is the one of the oldest. I'm not an expert by any means though.\n\nI wouldn't know the very first \"font\", as in hot metal though, which would actually be interesting to know.\n\nGo to the library, find A Short History of the Printed Word by Warren Chappell, and you'll find exactly what you're looking for.\n\n"
    },
    {
      "time": "16 Apr 2009 — 9:49am",
      "content": "This is a difficult question to answer, because the typeface called bodoni is not neccesarily designed by Gianbattista Bodoni. Rather it is based on the work of Bodoni, with characteristics the typefaces he cut. Garamond is an even more complex story... I second Dan that it would be a good idea to read Warren Chappell's book, which is nice to read and gives you lots of insight into the history of type. The oldest 'font' is probably Gutenburg's fraktur used for his 42 line bible, but isn't used much now anymore, because fraktur gave way relatively quickly to roman typefaces (except in Germany). Venetian typecutters were very important in the development of these roman typefaces, which are still eminently readable and are the basis of popular fonts like Bembo. I think the fonts based on this period are probably among the oldest still in use.\n\ncheerio Queneau\n\n"
    },
    {
      "time": "16 Apr 2009 — 10:07am",
      "content": "Bembo? Garamond? Those youngsters! What about [Trajan](http://web.archive.org/web/20150428170244/http:/typophile.com/node/14496)? ;)\n\n"
    },
    {
      "time": "16 Apr 2009 — 10:10am",
      "content": "\\>\\>among the oldest still in use\n\nThat's the kicker isn't it. If we're talking about oldest font that we still use, then a Jenson gets the top nod, I should think. But then again, you bring up the point that we're not actually able to use a genuine Jenson because it doesn't actually exist anymore.\n\nSo the oldest typeface that a) is still used and b) is still original is the question.\n\nThat brings me back to Caslon, or thereabouts.\n\n"
    },
    {
      "time": "16 Apr 2009 — 10:14am",
      "content": "\\>\\>What about Trajan?\n\nTrajan Pro, etc., are interpretive digitizations of something that was never originally designed to be a font. Thus, Trajan gets a nod for probably being the oldest Roman character design still in use, but it's not a font.\n\n"
    },
    {
      "time": "16 Apr 2009 — 10:47am",
      "content": "I'm aware of that, but since the original question wasn't very clear, I took some liberties :)\n\nMichiel, what do you mean by alive? Still in use, or if the original metal punches/matrices have survived?\n\n"
    },
    {
      "time": "16 Apr 2009 — 11:04am",
      "content": "I started a thread here on \"oldest extant font\" some time ago, but can't find it of course.\n\n"
    },
    {
      "time": "16 Apr 2009 — 12:53pm",
      "content": "Nick, always at your service:  \n [The oldest?](http://web.archive.org/web/20150428170244/http:/www.typophile.com/node/21458)\n\n"
    },
    {
      "time": "16 Apr 2009 — 1:21pm",
      "content": "Thanks! That thread has some marvelous information.\n\n"
    },
    {
      "time": "16 Apr 2009 — 1:45pm",
      "content": "Wow. Garamond might actually be it then, considering the info in that previous link. Slimbach did go over there to study the \"originals\". I always thought that was a bit hyperbole, but considering...\n\n"
    },
    {
      "time": "16 Apr 2009 — 2:55pm",
      "content": "Next to speling, history is probably my weakest point, but I have been compiling a time-line of significant events &c over the past few years as I continue to extend my program. Most start with a random Wikipedia wander and I am seldom capable of ending up in the same place twice.\n\nIf we deviate slightly into the field of `[Bad link]` the oldest thing I have is `[Bad link]` at about 6600 BCE (Before Common Era. Means the same thing as BC, only Atheist). At some point I recall reading about markings on tortoise shells, but I can't find it.\n\nWith \"movable\" type, I've got `[Bad link]` clocking in at about 2000 BCE.\n\nAnd sorry to debunk Gutenberg, but the Chinese beat him to the punch by about 100 years as far as moving individual characters.\n\nI've had a lot of fun starting from that Wikipedia orthography link and seeing where it leads me. I love easy to rationalize avoidance behaviours. Just some food for thought.\n\n@ Nick, that was a pretty good thread. If anyone else wants to throw down some time-line info, feel free. I'm sure can all benefit from it.\n\n"
    },
    {
      "time": "16 Apr 2009 — 4:46pm",
      "content": "As a font:  \n [http://www.daleguild.com/B-42Blackletter.html](http://web.archive.org/web/20150428170244/http:/www.daleguild.com/B-42Blackletter.html \"http://www.daleguild.com/B-42Blackletter.html\")  \nI don't think Gutenberg's earlier D-K type has been revived.\n\n"
    },
    {
      "time": "16 Apr 2009 — 5:10pm",
      "content": "So there is a date, 1496. Makes a lovely number.\n\n"
    },
    {
      "time": "17 Apr 2009 — 7:02am",
      "content": "What I ment was: The font, which you can purchase today, who has the oldest date of creation.\n\n"
    },
    {
      "time": "17 Apr 2009 — 7:40am",
      "content": "\\>The font, which you can purchase today, who has the oldest date of creation.  \nOh, that'd be mine, 1989. I think Adobe's updated all their fonts since OT.\n\nCheers!\n\n"
    },
    {
      "time": "17 Apr 2009 — 8:10am",
      "content": "@David  \n1989? Type 1 was defined in 1990. True type came was on a Mac in what? 1991?\n\nIf we're limited to purely computer type, you might not be lying :)\n\nBut you can still buy real foundry fonts that are buttloads older than 1989, if you're into that sort of thing.\n\n"
    },
    {
      "time": "17 Apr 2009 — 8:35am",
      "content": "The PostScript Type 1 format goes at least as far back as 1985, when the first PostScript output devices were introduced. The internals of Type 1 were not public until Adobe had no choice but to make them public when TrueType was announced by Apple in 1989. TrueType debuted in 1991 with Mac System 7 and Windows 3.1.\n\n"
    },
    {
      "time": "17 Apr 2009 — 8:39am",
      "content": "Was 1990 the date that it was Type 1 was opened? I recall something about it being defined in something called the \"black book\"\n\n"
    },
    {
      "time": "17 Apr 2009 — 8:45am",
      "content": "Right, that's when the spec was published, making it possible for people outside of Adobe (or its partners) to make Type 1 fonts legally. Type 1 fonts already existed, but you could only get them from Adobe (or its partners). There were some attempts to reverse-engineer the format (notably by Bitstream), but that was all dropped when the spec was released.\n\n"
    },
    {
      "time": "17 Apr 2009 — 9:11am",
      "content": "As many of you noted, there are several ways this question can be interpreted.\n\nIf we allow for Bembo and Garamond, but disqualify Trajan and examples such as Jonathan Perez and Laurent Bourcellier's [Hiéroglyphes](http://web.archive.org/web/20150428170244/http:/www.typographies.fr/index.php?page=fontes&s=Hi%E9roglyphes), then a sensible set of criteria might be as follows:\n\n1. The font must be still in use, in a digital format (the prevalent format today), not collecting dust in a museum somewhere. This disqualifies the re-cut B-42 Blackletter type that Kegler mentioned, because it doesn't come as a font that can be used on a computer.\n\n2. The original design must be a 'font' as well, that is, a system for mechanical reproduction of writing that incorporates at least some basic analysis of the graphemes that make up writing so that they can be used to set a wide range of texts. Hand lettering does not count. Cylinder seals and woodblock printing, capable as they are of reproducing writing mechanically, can only reproduce the specific texts they are designed for and cannot be used to set other texts, so they don't count either. I don't think there is anything we can really call fonts before the invention of moveable type.\n\n3. The current digital incarnation must be a faithful revival of the original design, enough to be widely accepted as an adaptation into a different format of the same design rather than a design loosely inspired by the original. Much of this is up for debate; it helps when as in the case of Bembo or Garamond, they are marketed as digital versions of the original designs.\n\nThere was an essay in the 2005 _Geulkkol_ annual published by the Korea Font Development Center about a revival of the hangul (Korean alphabet) wood type used for _Dongguk Jeong-un_ ('Dictionary of Proper Sino-Korean Pronunciation'), published in 1447. I left the annual back in my old apartment in Seoul, so I couldn't tell you what came of it.\n\nI do know that Sandoll, a Korean foundry, are selling a revival of the hangul metal type used for _Worin Cheon-gang Jigok_ ('Songs of the Moon Shining on a Thousand Rivers'), also dating from 1447.\n\nThese are not straightforward revivals. They have been adapted for horizontal writing, and there is no support for archaic letters while syllables needed for modern Korean but not found in the original documents had to be filled in. In particular, the _Dongguk Jeong-un_ revival adds a post-modern twist by simply leaving the space for the syllable-final consonant blank instead of stretching out the other letters to fill the square (the _Dongguk Jeong-un_ orthography always marks the zero syllable-final consonant with 'ㅇ', so a syllable composed without a syllable-final consonant doesn't appear in the original).\n\nStill, I would submit that according to the criteria outlined above, they would be fonts still available in the digital age with some of the oldest dates of creation, preceding the Gutenberg Bible (but not some of Gutenberg's earlier efforts). I don't know about any revivals of the oldest Chinese-character fonts, but maybe others can fill us in.\n\n"
    },
    {
      "time": "17 Apr 2009 — 9:35am",
      "content": "Things could be narrowed down a lot if these new digital revivals of centuries old originals are left out of the argument. Otherwise a font created in 2009 but using an original font from the 12th century could be the oldest ever font, which I think is silly. I would rather look for fonts that have a long continuous history in typography. In this way you probably end up with fonts like Garamond, Caslon, Jenson etc. It is deceptive though that there are many fonts named Garamond, often with significant differences between them. In this case I think the name rather refers to a style of typefaces, rather than one single typeface/font. Garamont (!) cut several typefaces in his day, so deciding which one is the real one is probably impossible (as several of todays Garamonds even go back to the work of others than Claude Garamont's, for instance the work of Granjon). Another element to take into account is that there have been several changes in typography, like in the role of italics, boldtype and even in the adding of new characters. If one tries to find the font that is in use as it was designed until this day you probably end up at a later date (Caslon might be close in this case).  \nA hard nut to crack if you really want the definite answer. It could be the work of years of typography history research... :)\n\nA note on chinese type: Though the chinese invented movable type before Gutenberg did, the complexity and the sheer amount of characters in chinese made it hard to use, and most of the books in chinese have actually been made from woodcut texts of entire pages, rather than using movable type. It wasn't until the twentieth century that this really has changed.\n\ncheerio Queneau\n\n"
    },
    {
      "time": "17 Apr 2009 — 9:59am",
      "content": "@ Queneau\n\nInterestingly enough, a Chinese exchange student in the lab explained the \"page at a time from wood\" to me just last week. Someone mentioned Gutenberg, I mentioned Chinese, then he out of nowhere came up with his knowledge. He was very proud of himself. A psychologist learning a typographer. Excellent.\n\n"
    },
    {
      "time": "17 Apr 2009 — 10:23am",
      "content": "Wow, I didn't realize that the fact that woodblock printing involves carving an entire page out of a woodblock would be an unfamiliar concept to Westerners. But it makes sense. Once you had the breakthrough of moveable type for linear alphabets like Latin, there is no real need to go back to recreating whole pages from woodcuts except for illustrations. In Korea, woodblock printing was still in use alongside moveable type until the 19th century, because the lack of a printing press made moveable type cumbersome enough for woodblock printing to be a viable alternative.\n\n"
    },
    {
      "time": "17 Apr 2009 — 12:18pm",
      "content": "\\>1989?  \nThat's right. I was a walking talking pre- even then.\n\n\\>If we’re limited to purely computer type, you might not be lying :)  \nWell, date of creation and creation date, alive and font have all have to be defined. ;)\n\nCheers!\n\n"
    },
    {
      "time": "19 Apr 2009 — 12:42pm",
      "content": "Michiel:\n\nSince your first answers were Antiqua and Garamond, I assume you are looking for a digital revival. If that is true, then DanGayle is right: you can find revivals of the font used by Gutenberg, so that is the oldest you can find today (assuming it is really the oldest font, at least in the Western World).\n\nTwo digital interpretations of that design:\n\n`[Bad link]`  \n`[Bad link]`\n\n"
    },
    {
      "time": "19 Apr 2009 — 4:33pm",
      "content": "Dave Berlow: Adobe \\*still\\* sells Type 1 fonts, which have not had any OpenType-related updates. There are a few whose Mac versions have not been revised since as late as 1987-89. But I'm with those who think that interpretation of the question is kinda goofy. :)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "19 Apr 2009 — 7:41pm",
      "content": "\\>Dave Berlow: Adobe \\*still\\* sells Type 1 fonts, which have not had any OpenType-related updates.  \nHow 'bout Euros!?\n\nCheers!\n\n"
    },
    {
      "time": "20 Apr 2009 — 1:32pm",
      "content": "@DB: Back around 1998-1999, Adobe added euros to only those type families that had family members bundled in PostScript printers. Other families in the Adobe Type Library only got euros added as part of their conversion to OpenType, an effort which had started around the same time. So that affected maybe 1/4 of the Adobe Type Library, as a rough swag.\n\nThere might even be Adobe Type 1 fonts that were last rebuilt as long ago as 1985 or '86, but I couldn't swear to that. Certainly 1987 or thereabouts, though.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "20 Apr 2009 — 1:51pm",
      "content": "_Bembo is the oldest one I could find (from 1496)._\n\n???\n\nBembo is not that old! This reading of the Wikipedia article is misleading regarding the age of the typeface. Bembo (1927) is not the same typeface as the source of its inspiration, the De Aetna typeface (~1495). I hope that you are more thorough in the rest of your research.\n\n"
    },
    {
      "time": "20 Apr 2009 — 2:12pm",
      "content": "@David and Thomas  \nThis is great! We always talk about documenting past history, but it always happens that no one documents recent history. If those old guys had bothered to document their sources, their achievements, etc., we wouldn't even need to have discussions like this.\n\nIn 200 years, what will the people doing research on Postscript fonts ca. 1986-89 find as their results? (By my own accounting, Black  \nChancery has conclusively been proven to be the first/most important typeface of the era. —Dan Gayle IV, Type Historian)\n\n"
    }
  ]
}
