{
  "id": "57088",
  "title": "Typophile Film Fest 4 in Vancouver",
  "forum": "JuanMadrigal's blog",
  "tags": [

  ],
  "content": "[Typophile](http://web.archive.org/web/20110511184202/http:/www.typophile.com/wiki/Typophile) Film Fest 4 is presented by [Punchcut](http://web.archive.org/web/20110511184202/http:/www.typophile.com/wiki/Punchcut) in association with the Society of Graphic Designers of Canada\n\nTypophile Film Fest 4 will showcase a rare and unequaled selection of short typographic films. Hailing from Portugal, The Netherlands, Austria, Canada and the US, the films create a visual mashup of motion design, typographic animation and short stories. It includes broadcast motion design, documentaries and typographic eye candy from Trollbäck + Company, [Strange Attractors](http://web.archive.org/web/20110511184202/http:/www.typophile.com/wiki/Strange%20Attractors), Heebok Lee, [Nick Shinn](http://web.archive.org/web/20110511184202/http:/www.typophile.com/wiki/Nick%20Shinn), Juan Leguizamon as well as exclusive out takes from the acclaimed documentary film [Helvetica](http://web.archive.org/web/20110511184202/http:/www.typophile.com/wiki/Helvetica). Thanks to the Society of Graphic Designers of Canada, British Columbia, for helping make this presentation possible.\n\nSaturday April 25, 2009  \nDoors open: 7PM  \nFilms: 8PM—11PM  \nNote: All Justified West attendees receive free entrance to the Typophile Film Fest.\n\nCOST  \nGDC Members: $15  \nNon GDC Members: $20\n\n[BUY TICKETS NOW](http://web.archive.org/web/20110511184202/http:/www.gdc.net/about/store/product_category1/product43.php)\n\nLOCATION  \nPLAZA 500 Hotel, Vancouver  \nLocated at the corner of Cambie Street & 12th Avenue\n\n// ABOUT PUNCHCUT  \nPunchcut is a San Francisco-based user interface design company that specializes in improving mobile user experiences. To us, mobile is not a device, it is a lifestyle. We work with device manufacturers, operators and leading entertainment brands to design for people in motion. //\n\n// ABOUT TYPOPHILE  \nTypophile is an international collaborative community of visual designers, typographers and type designers. Typophile is driven by sharing and the idea that we are always learning. Now in its ninth year, it is one of the oldest design communities online. Typophile is a Punchcut brand. //\n\n// ABOUT THE SOCIETY OF GRAPHIC DESIGNERS OF CANADA  \nThe Society of Graphic Designers of Canada (GDC) is a member-based organization of design professionals, educators, administrators,students and associates in communications, marketing, media and design related fields.  \nSince 1956, the GDC has been an advocate, voice and resource for Canada's graphic design profession. We are a national certified body of graphic designers promoting high standards of visual design and ethical business practices for the benefit of Canadian industry, commerce, public service and education. Through the media, publications, seminars, events, conferences and exhibits, the GDC builds awareness of graphic design and its essential role in business and society.  \nThe GDC has more than 1,000 members in 9 chapters across Canada. In addition to our professional members, we are also lucky to have several hundred student members. Find out how you can be part of Canada's foremost graphic design association. //\n\n",
  "author": "<a href=\"/web/20110511184202/http://www.typophile.com/user/42536\" title=\"View user profile.\">JuanMadrigal</a>",
  "time": "<br>",
  "uid": "42536",
  "comments": [
    {
      "time": "",
      "content": "Thanks for posting, Juan. This post has been promoted to the homepage.\n\n"
    }
  ]
}
