{
  "id": "57095",
  "title": "Capitalized words opening a chapter",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello\n\nI've a clutch of questions relating to the practice of capitalising the first word or few words of the opening of a chapter e.g.  \n\"WE ALL HAVE THOSE DAYS when we wish we could just stay in bed.\"\n\n1: is there a name for this used in typography books / InDesign etc.  \n2: is this going out of use or still deemed ok to do?  \n3: any differences between using it in magazine vs book design?  \n4: are there any rules as to how many words capitalized, a limit or just what feels right?\n\nthanks for any advice\n\n",
  "author": "foggy",
  "time": "17 Apr 2009 — 5:18am",
  "uid": "43849",
  "comments": [
    {
      "time": "17 Apr 2009 — 10:30am",
      "content": "1. I do not know of any term other than something like \"all-cap lead-in\" or (better) \"all small-cap lead-in.\"\n\n2. If you wish to do it and can do it well, why not do it? If your phrase \"out of use\" refers to style or fashion, just don't worry about that.\n\n3. Depends on the overall design.\n\n4. Now this is the important part of your query, foggy. Far too often designers or editors issue a specification something like \"first 4 words in opening sentence, all small caps.\" So, the paragraph starts with a sentence such as \"I was not born in a tent in Canada\", and if you follow the spec you get the all-cap lead-in thus \"I WAS NOT BORN in a tent in Canada.\" And that just looks a bit silly, because the writer obviously had been born. So keep an eye on the syntax and the meaning of the chapter opening para.\n\nI use this design device quite often. It can require a lot of hard looking and thought, particularly if a book has a lot of chapters. Ideally you'd be able to keep the all-cap phrases to a somewhat similar length, but that rarely happens. You might start one chapter with 3 short words, and the next with 6, including a long one, to get the meaning right. But will it look OK? You have to decide. Once I got lucky and was able to set the entire first line of every chapter in tracked small caps, and they all had good syntatic sense. I hardly expect to see that repeated.\n\nAll small capitals will most often look better than all full capitals. & then give them some letterspacing so they can breathe a bit.\n\npowers\n\n"
    },
    {
      "time": "17 Apr 2009 — 2:26pm",
      "content": "_or (better) “all small-cap lead-in.”_\n\nI agree. As far as I know, usually it's done with (true) small caps rather than caps.\n\n"
    },
    {
      "time": "22 Apr 2009 — 2:18am",
      "content": "Thanks so much, that's dead helpful.  \nLove this forum :)\n\n"
    },
    {
      "time": "23 Apr 2009 — 1:11am",
      "content": "And you can easily do it in InDesign with nested styles on paragraph style. I use it all the time.\n\nWhen nested style doesn't have a fixed length (as in number of letters, words, lines) I usually end nested style with N-space, because it's easy to type (Ctrl-Shift-N). But you can also use the \"end nested style\" special character accessible from context menu or Type menu... But it's more cumbersome.\n\nIf N-space is too wide you better put a keyboard short-cut for \"end nested style\"... It'll make your life easier.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    }
  ]
}
