{
  "id": "57100",
  "title": "my client would like a second opinion",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all,  \nI haven’t logged in in a long time, but would very much value your opinion on this logo. My client (and friend) are at an impasse when it comes to the name font used in this logo. The “G” component is fine, but my client would like to see his name bolder, which I am not necessarily opposed to, but he has given me a couple suggestions as to fonts he would like to use which I have given a strong opinion against. I’d like to hear what you think of what’s there now, and what you think of any of his suggestions as well as any suggestions of your own. The font used now is (I hate to even say it) Helvetica Neue. Haha I know the most over used logo font out there. The fonts he has suggested are Verdana, Eurostyle, CopperPlate Gothic and Lucida Console. Any help would be much appreciated.\n\n ![](http://web.archive.org/web/20090515134659im_/http:/typophile.com/files/JPEG%20logo_5833.jpg)\n\n",
  "author": "<a href=\"/web/20090515134659/http://typophile.com/user/33741\" title=\"View user profile.\">Carolyn Connors</a>",
  "time": "<br>",
  "uid": "33741",
  "comments": [
    {
      "time": " 17.Apr.2009 8.44am",
      "content": "My two cents:\n\n“GOODWIN” looks great, and I see no reason why you shouldn’t use a heavier version of Helvetica or any other (Neo) Grotesk.\n\n“exteriors” tracked out and wide (streched?) needs work. Why not set it in the same width/spacing as the name, just smaller? I would also try to achieve equal colour on both lines, perhaps by using a slightly bolder weight for “exteriors”.\n\n"
    },
    {
      "time": " 17.Apr.2009 8.54am",
      "content": "god forbid! it’s not stretched, just the extended version of the font, but it is tracked wide.\n\n"
    },
    {
      "time": " 17.Apr.2009 9.35am",
      "content": "he’s now leaning towards Bell Gothic Black, any thoughts? He likes the serifs on the I and G but I find them a bit off balance.\n\n"
    },
    {
      "time": " 17.Apr.2009 10.26am",
      "content": "I can see what you mean by how it looks set in Bell Gothic. I actually tried it in Gill Sans Black and think it looks pretty good, much better balance at least.\n\n"
    },
    {
      "time": " 17.Apr.2009 10.51am",
      "content": "Gills Sans is nice, but it doesn’t have the slab serif on the I, he’s seems very particular about that\n\n"
    },
    {
      "time": " 17.Apr.2009 3.03pm",
      "content": "Can the image be any smaller? I like the G logo.\n\nGuerrizmo+Design  \nNo man is an island unto himself\\_John Donne\n\n"
    }
  ]
}
