{
  "id": "57103",
  "title": "Rambla Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I’m a beginner in type design; this is my first experience developing one.\n\nMy knowledge about type is really limited and I’m only just learning about my favourite types.\n\nI would like your advice and feedback.\n\nThanks, Martin\n\n| Attachment | Size |\n| --- | --- |\n| [rambla\\_typophile.pdf](http://web.archive.org/web/20150421203542/http:/typophile.com/files/rambla_typophile.pdf) | 248.92 KB |\n\n",
  "author": "trama",
  "time": "17 Apr 2009 — 10:40am",
  "uid": "3199",
  "comments": [
    {
      "time": "17 Apr 2009 — 3:17pm",
      "content": "Wow, this is amazing for a first try! I like condensed  \nThere are only two things I can pick out as distracting. The bars on the x seem to be broken; is that intentional? And While I like the curvy y, I wonder if a straight one might be nice?  \nI like all the quirks that seem very current; the a, c, e and f especially. I also like the echoes of Meta, with the terminals that curve slightly like on k and u. I'm not convinced about on d though.  \nThe trap on your cap A looks a bit big.  \nI'm very impressed! Keep going :)\n\n"
    },
    {
      "time": "20 Apr 2009 — 6:53am",
      "content": "This is really nice!  \nWhat I'd change is \"y\". I'd make it out of \"g\". Right now it doesn't really look it complement other letters.\n\nAll the rest look really sleek and astonishingly beautiful. GREAT JOB!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "20 Apr 2009 — 6:57am",
      "content": "One more thing. \"s\" looks leaning tid bit to the right. Just a small bit or maybe it's just my eye.\n\nHave you also tried to loosen spacing a bit to make it better in small sizes?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "20 Apr 2009 — 12:37pm",
      "content": "Hello Bendy and Litera. Tks for yours comments.  \n- Bendy:  \n- You were right, x bars was broken. It’s corrected now.  \n- I have worked on a straight ¨y¨ version. I have attached a new file whit changes. What are you thing about de changes.?  \n- And, I have changed a little the letter v.\n\nLitera:  \nI will try to construct the (y) from (g) THE shape, and then I’m gonna show you.\n\n[http://www.estudiotrama.com/rambla/rambla\\_typophile2.pdf](http://web.archive.org/web/20150421203542/http:/www.estudiotrama.com/rambla/rambla_typophile2.pdf)\n\nBye Martin.\n\n"
    },
    {
      "time": "20 Apr 2009 — 2:35pm",
      "content": "Double left quote is the wrong way round. They normally look like 66.  \ny works well, though I think it's got too much space in comparison with the other glyphs.  \nI wonder if w should have the same kind of apexes as v?\n\n"
    },
    {
      "time": "20 Apr 2009 — 4:00pm",
      "content": "Hello Bendy,\n\nyes, I need to work more on the w, I will still trying.\n\nThe y spacing was rushed.\n\n:)\n\n"
    },
    {
      "time": "21 Apr 2009 — 1:20pm",
      "content": "Creo que estaría bueno q pruebes las mismas terminaciones de ascendentes en las letras \"n\",\"m\",\"r\" y \"u\".....\n\nProbate una \"g\" d dos pisos con un ángulo en diagonal\n\nLa \"y\" esta muy buena, taría bueno tener de opcional la recta...\n\nBotas!\n\n"
    },
    {
      "time": "21 Apr 2009 — 1:48pm",
      "content": "Hola Sebotas,\n\nVoy a hacer esas pruebas en breve y subo para ver como caminan!!\n\ngracias por la ayuda.\n\nmartin\n\n"
    },
    {
      "time": "5 May 2009 — 7:48pm",
      "content": "trama,  \nmuy atractiva, elegante tu fuente!  \nYo que vos, acentúo un poco más esos pequeños quiebres que hacés en algunas ascendentes como la \"b\" o la \"l\" de Rambla.  \nEs tan solo para que no parezca \"error\", muchas veces las ideas cuando aparecen así, un poco tímidas, llevan a que sean vistas como desprovistos.  \nIntentá un poco mas acentuado el quiebre entonces, a ver como queda.  \nCreo, a su vez, que el doblez en la d, te pide la inclinación contraria, pero es a mi parecer nada más. Algo me hace ruido en la \"d\" particularmente.  \nBueno, ojala te sirva de algo mi crítica, que desde ya, es solo mi opinión, la typo está muy bien lograda.  \nBest!  \nMaximiliano R. Sproviero  \nLián Types.-\n\n"
    },
    {
      "time": "5 May 2009 — 10:32pm",
      "content": "Very nice. I wonder...perhaps the only thing that I might suggest is an ever-so slight (miniscule) round or champfering of the corners. The tiniest, teeny tiny.\n\n"
    },
    {
      "time": "7 May 2009 — 1:54pm",
      "content": "Hola Maximiliano, gracias por los comentarios.\n\nSon muy válidos los consejos, voy a darle un poco más de inclinación, apenitas a los quiebres y ver como resultan en la impresión.\n\nEl de la d ya decidí eliminarlo.. (no funciona tampoco en la dirección natural opuesta).\n\nEstoy en breve subiendo un nuevo pdf.\n\ngracias nuevamente.\n\n"
    },
    {
      "time": "12 May 2009 — 9:27pm",
      "content": "Hola, me gusta mucho en general, se ve muy bien el bloque de texto.\n\nLa \"a\" minúscula me gusta bastante, funciona muy bien y tiene mucho carácter. Nunca la cambiaría por la \"a\" alternativa.\n\nCoincido en que los quiebres deben ser un poquito más notorios.\n\nLa primera \"e\" alternativa se ve bien en Doblette o en Noel, pero yo la guardaría por si hay planes de hacer una versión itálica.\n\nSaludos\n\n"
    },
    {
      "time": "13 May 2009 — 7:50am",
      "content": "Tks, Gracias: maxispr, sarll, Miss Tiffany\n\nChanges:\n\nl,b,k (ascendent more tilted)  \nd (wihtout inclination)  \ny (another version of straight ¨y¨)\n\nCambios:\n\nl,b,k (más inclinación en el ascendente)  \nd (sin inclinación en el ascendente)  \ny (otra versión)\n\nLast version / Ultima versión  \n [http://www.estudiotrama.com/rambla/rambla\\_typophile3.pdf](http://web.archive.org/web/20150421203542/http:/www.estudiotrama.com/rambla/rambla_typophile3.pdf)\n\nPrevious version / Versión Anterior  \n [http://www.estudiotrama.com/rambla/rambla\\_typophile2.pdf](http://web.archive.org/web/20150421203542/http:/www.estudiotrama.com/rambla/rambla_typophile2.pdf)\n\nMartin\n\n"
    },
    {
      "time": "14 May 2009 — 9:27am",
      "content": "Hola Martín,\n\nCreo que las terminaciones deberían ser aun más notorias, tambien en las descendentes como la \"f\". Eso de daría más textura a los cuerpos de texto.\n\nLa \"y\" recta me parece mejor, aunque la otra también funciona bien.\n\nTal vez tengas tus dudas con la \"g\" de dos ojos, pero creo que con el quiebre de la \"a\" aplicado a la parte de abajo se ve muy bien. (me tomé el atrevimiento de hacerlo por ejercicio)\n\nLa fuente va por muy buen camino, ánimo\n\nSergio\n\n"
    },
    {
      "time": "15 May 2009 — 5:38am",
      "content": "Me gusta la idea de probar la g de 2 pisos con la inlinación :)\n\nGracias sergio.\n\n"
    },
    {
      "time": "16 May 2009 — 2:29am",
      "content": "I'm really loving this!\n\nThe only two things that catch my eye are the crossbar of the e and the comma. The crossbar seems to get heavier from left to right, so I'd move down the right hand node of the counter. The comma needs more weight?\n\nLooking good :)\n\n"
    }
  ]
}
