{
  "id": "57105",
  "title": "Body Copy for Din",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,  \n Currently I am creating a letterhead and resume for myself. I've used the typeface Din Bold-Condensed for my name, and important copy. I'm looking for something that pairs really well with it. I've been using Baskerville thus-far but something seems a little off. Does anyone have any suggestions? I think what is throwing me of is the fact that Din is so condensed. I would prefer not to change this because I'm happy with it, I just need to find the copy that goes well with it.\n\nThanks\n\n",
  "author": "bembo",
  "time": "17 Apr 2009 — 11:44am",
  "uid": "17203",
  "comments": [
    {
      "time": "17 Apr 2009 — 12:09pm",
      "content": "Eureka goes great with DIN because they both look pretty weird.\n\n"
    },
    {
      "time": "17 Apr 2009 — 5:43pm",
      "content": "@James Puckett  \nIf both of them are weird, doesn't it would make bembo's resume look like a freakshow? :)\n\n"
    },
    {
      "time": "17 Apr 2009 — 9:11pm",
      "content": "I'd think Eureka might actually work. Since DIN is so ... rigid, you need an angular serif (can't think of any at the moment) and maybe a semi-bold weight to match your DIN Bold Condensed. Baskerville is far too rounded and delicate to really \"compliment\" DIN.\n\n"
    },
    {
      "time": "18 Apr 2009 — 9:48am",
      "content": "I've been testing out different sans serifs actually, and I'm kind of liking frutiger. The question is.. If I'm going to do sans serif, should I just stay with DIN all the way. I'm still looking for a serif that works well tho\n\nThanks for the help so far\n\n"
    },
    {
      "time": "18 Apr 2009 — 8:24pm",
      "content": "Squarish serifs that would look good with DIN:\n\nCambria (available at no cost from MS)  \n [Walburn](http://web.archive.org/web/20150301011601/http:/shinntype.com/walburn.html)  \n [Meta Serif](http://web.archive.org/web/20150301011601/http:/www.fontshop.com/fonts/downloads/fontfont/ff_meta_serif_ot_collection/)  \n [Fedra Serif](http://web.archive.org/web/20150301011601/http:/www.typotheque.com/fonts/fedra_serif_a)  \n [Zapf Elliptical](http://web.archive.org/web/20150301011601/http:/new.myfonts.com/fonts/bitstream/zapf-elliptical-711/)/ [Melior](http://web.archive.org/web/20150301011601/http:/new.myfonts.com/fonts/adobe/melior/)\n\nThere are also many slab serifs which are squarish that might work well.\n\n"
    },
    {
      "time": "20 Apr 2009 — 12:08pm",
      "content": "Normally FF Din looks good in allcaps medium or bold weight, and set relatively large. Then try PMN Caecilia.  \nFor \"normal use\" try FF Nexus Mix or Nexus Serif.  \nHmm, generally i don't like the idea searching for a squarish serif to go with FF Din – and never saw a squarish serif going well with FF Din. Show me!\n\n"
    },
    {
      "time": "20 Apr 2009 — 8:27pm",
      "content": "I'm not sure if, say, Cambria would go with with FF DIN Bold Condensed (I haven't FF DIN), but I think it goes with DIN 1451 well enough. (Although I will not use these fonts in my actual EULA; I'll rather use my own.)\n\n ![](http://web.archive.org/web/20150301011601im_/http:/typophile.com/files/DIN-Cambria_5491.gif)\n\n"
    },
    {
      "time": "20 Apr 2009 — 10:43pm",
      "content": "Utopia?\n\n"
    }
  ]
}
