{
  "id": "57138",
  "title": "Bulgarian Cyrillic - how to?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello there. I have read my way through some of the previous threads on the Bulgarian 'peculiarities' in [Cyrillic](http://web.archive.org/web/20100204121003/http:/typophile.com/wiki/Cyrillic). I've looked at specimens, but I'm more confused now than before. Say I was to design these Bulgarian alternates, what would they look like? Are there consensus on the set and shape of the characters? And how should I implement them? In the 'locl' feature, stylistic alternate or both – or something else? In other words, help would be much appreciated.\n\n/Claus\n\n",
  "author": "<a href=\"/web/20100204121003/http://typophile.com/user/16321\" title=\"View user profile.\">clauses</a>",
  "time": "<br>",
  "uid": "16321",
  "comments": [
    {
      "time": "",
      "content": "I'd second some confirmation on this re the design. locl is definitely the option, though of course it doesn't hurt to include them as character alternates. I think it's basically giving them more Latinized shapes, but I also seem to recall someone saying that it's just one foundry that produces fonts with them in that style. I could be mistaken though.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "",
      "content": "I'd vote for a stylistic set. I wouldn't necessarily object to locl, but I think it makes more sense as a stylistic set. It is true that the style you are referring to is dominant in the Bulgarian typographic scene (though by no means universal). However, it is not specific to Bulgaria. Many of the so-called Bulgarian features are basically upright cursive forms, and can be found in other places like Ukraine and Russia. There may be a culture-specific difference between preferred upright cursive forms, though. For instance, I don't ever recall seeing a _yu_ with an ascender outside of Bulgaria (or _ka_ with an ascender, for that matter, although I might be remembering wrong). If I had a lot of time on my hands, I might even create several stylistic sets in addition to the default Cyrillic forms...\n\n"
    },
    {
      "time": "",
      "content": "my vote is for a stylistic set. this issue is similar to the capital eszett issue for German IMO: there is a vocal minority lobbying for its/their acceptance, but by and large most people likely prefer the traditional forms. but i could be wrong, this is just my sense.\n\nbut as for forms, basically they look like upright italic forms. Here is one model that you could follow: [http://www.flickr.com/photos/pauldhunt/428260560/in/set-72157600292550299/](http://web.archive.org/web/20100204121003/http:/www.flickr.com/photos/pauldhunt/428260560/in/set-72157600292550299/ \"http://www.flickr.com/photos/pauldhunt/428260560/in/set-72157600292550299/\")  \nof course there are other models. You might look at [Nick Shin](http://web.archive.org/web/20100204121003/http:/typophile.com/wiki/Nick%2520Shin)'s specimen for his Modern Suite. [http://shinntype.com/Figgins\\_Scotch.pdf](http://web.archive.org/web/20100204121003/http:/shinntype.com/Figgins_Scotch.pdf \"http://shinntype.com/Figgins\\_Scotch.pdf\") (p. 24). I believe he followed the model as set forth by the Bulgarian foundry Hermesoft.\n\nHope this helps.\n\n"
    },
    {
      "time": "",
      "content": "also, i agree that the yu with the ascender makes absolutely no sense (to me). maybe someone else can explain...\n\n"
    },
    {
      "time": "",
      "content": "_I believe he followed the model as set forth by the Bulgarian foundry Hermesoft._\n\nI did.  \nI included the Bulgarian alternates as a Stylisitc Set, rather than \"locl\" feature.  \nI made the Serbian alternates the \"locl\" default, and also included them in a stylistic set, for CS2 and glyph palette grouping.\n\n"
    },
    {
      "time": "",
      "content": "For the Serbian forms, I would agree with Nick that making them the locl default is a good idea, since I get the sense that they are mandatory for setting Serbian text.\n\n"
    }
  ]
}
