{
  "id": "5713",
  "title": "Typophile Forums 2.0!",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Typophiles,   \n   \nWe are proud to announce the reopening of the Typophile Forums. Thanks to some generous contributors, we have upgraded the board, and now you can enjoy dozens of new features in a frameless environment! Thanks for bearing with us while we worked to get the new code in place.   \n   \nA few of the new features include:   \n   \n\\_ Enhanced Email Capabilities : Now you can read \\*and\\* post to the board remotely. Talk typography from the comfort of your Inbox, without ever having to visit the board!   \n   \n\\_ New Architecture : We've reorganized the Forums architecture, and you'll find more focused discussions to support you throughout the typeface design/development cycle.   \n   \n\\_ New Forums : Whether it be Bitmaps, Blondes, or Boise Typographers, carve out your own niche in the Typophile Community by starting and moderating your own sub-community in our new Special Interest Groups.   \n   \n\\_ Members Forums : Exclusive forums for Typophile contributors!   \n   \n\\_ Enhanced User Profiles : Send and receive private messages from other board users! Add a personalized 60 x 60 icon next to your posts.   \n   \n\\_ Build Critique : If you thought the Typophile Critique was good, now you can download live font betas, posted by your peers. This secure environment will help those of you who are ready to take your work to the next level.   \n   \n\\_ Automated Password Recovery : If it's been a while since you've joined us, now you can easily get back into the swing of things.   \n   \nAs we celebrate our third year, we are now host to hundreds of thousands of regular visitors, and millions of hits a month. If you've enjoyed Typophile over the last couple of years, here's your chance to give a little back. Support Typophile by signing up for a membership, and we'll unlock the doors to exclusive areas of the Forums and give you some cool Thank You gifts, including the 2003 Typophile Tee! Your contributions will help us cover our bandwidth bills and enhance the site with better features and collaborative tools.   \n   \nFor a complete breakdown on Typophile Memberships, please see:   \n [http://www.typophile.com/needs/your/support/](http://web.archive.org/web/20131015084617/http:/www.typophile.com/needs/your/support/)   \n   \nWe'll look forward to seeing you in the Forums!   \n   \nJared and Joe   \nTypophile\n\n",
  "author": "Jared Benson",
  "time": "7 Jan 2003 — 5:03am",
  "uid": "3",
  "comments": [

  ]
}
