{
  "id": "57139",
  "title": "Design your Bag @ www.commontotes.com. Win US$300",
  "forum": "Design",
  "tags": [

  ],
  "content": "Dear Friends,\n\nWe’ve just launch a new tote bag crowdsourced site, “Common Totes”, and we’d like to invite you to check it out!\n\nIt’s a site calling for Graphic Design entries where anyone across the globe with a mean creative streak can submit designs for tote bags for the community to vote for a chance @US$300!\n\nThe best designs get manufactured into actual tote bags for sale and each winning design will be awarded a prize of US$300 - there will be two winners monthly in this ongoing competition.!\n\nCheck it out at:\n\n[http://www.commontotes.com](http://web.archive.org/web/20090422162257/http:/www.commontotes.com/ \"http://www.commontotes.com\")\n\nWe”d really appreciate you guys helping to spread the word to your designer friends and asking for their participation by submitting some of their designs.\n\nWe look forward to seeing you on Common Totes, and if you have any feedback or comments, please feel free to email us at [team@commontotes.com](mailto:team@commontotes.com).\n\nThanks and best wishes\n\nDamien  \nThe Common Totes Team  \n [http://www.commontotes.com](http://web.archive.org/web/20090422162257/http:/www.commontotes.com/ \"http://www.commontotes.com\")\n\nBe our Facebook fan:  \n [http://www.facebook.com/pages/Common-Totes/84670517779](http://web.archive.org/web/20090422162257/http:/www.facebook.com/pages/Common-Totes/84670517779 \"http://www.facebook.com/pages/Common-Totes/84670517779\")\n\nps: Dear administrator, do let me know if this post should be moved to another section. Thanks!\n\n",
  "author": "<a href=\"/web/20090422162257/http://typophile.com/user/43893\" title=\"View user profile.\">Common Totes</a>",
  "time": "<br>",
  "uid": "43893",
  "comments": [
    {
      "time": " 19.Apr.2009 10.13am",
      "content": "Bloody vultures.\n\n( image deleted by request )\n\n"
    },
    {
      "time": " 19.Apr.2009 10.41am",
      "content": "James, you should add that your message is now the standard greeting for first time posters on Typophile. You know, so people don’t get confused.\n\n"
    },
    {
      "time": " 19.Apr.2009 12.24pm",
      "content": "No, it’s just my standard greeting for pople trying to con designers into working for free in hopes of “winning” a pittance and no royalites.\n\n"
    },
    {
      "time": " 19.Apr.2009 1.26pm",
      "content": "Damien, thanks for posting in respectful way. This does seem to be the correct area for it so I will not move it.\n\nI will note that it would be better if you registered under a real and full name. It would show that you are willing to be accountable for the use of your Typophile account.\n\nIn response to James, this is the kind of post that seems very close to spam but isn’t going to get called that here simply because it has a plausible design/font relationship. I am not going to say “bloody vultures” but I will admit that this doesn’t seem like the kind of offer I would encourage someone to try.\n\n"
    },
    {
      "time": " 19.Apr.2009 1.31pm",
      "content": "Eben, feel free to nuke the image. In retrospect “bloody vultures” was ample.\n\n"
    },
    {
      "time": " 19.Apr.2009 3.24pm",
      "content": "“Bloody vultures” is pithy and communicates effectively. Image deletion started...\n\n"
    },
    {
      "time": " 19.Apr.2009 3.56pm",
      "content": "Speaking of graphics adding value to cloth products, Threadless gets it right.  \nThey put a link to a retail site for the font used in their “Type Tees”.\n\n"
    },
    {
      "time": " 19.Apr.2009 6.01pm",
      "content": "I wipe my arse with $300. I regret it afterwards but…\n\n"
    },
    {
      "time": " 19.Apr.2009 6.16pm",
      "content": "In fact, let me continue for a minute. I went to Camberwell art college in 2004, with depleted resources, lack of space, and double the numbers there should have been, tuition fees, top-up fees, major sacking of all first year tutors (too rock and roll) to be replaced by idiots, student bar closing at 8 on a Friday, only to leave college and work on my first pitch for the “Ethical Tea partnership”. This was ’brokered’ by some wank \\*\\*\\*\\* PR agency that made us pitch for free for 3 rounds, during which they revealed to us the ideas of other designers, suggesting directions. We got to the final 3 and didn’t make it, stating in the email that if we wanted further info they’d give it. We asked and they couldn’t be bothered. Total money made: none.\n\nAt the end of my degree I was sent a questionnaire by University of the Arts London, asking me what I was doing now. The letter attempted to persuade me by offering me the chance to enter a draw and win £100 worth of Topman vouchers; I threw that in the bin, and I humbly suggest sir, that you do likewise with your offer.\n\n"
    },
    {
      "time": " 19.Apr.2009 6.50pm",
      "content": "“tote bag crowdsourced site”\n\nThat’s a sign of the end of the internet, I believe.\n\n“This does seem to be the correct area for it so I will not move it. “\n\nI think the correct forum would be the SPAM forum.\n\n"
    },
    {
      "time": " 19.Apr.2009 11.21pm",
      "content": "Seriously, I think it’s a mistake to allow anonymous posters. Indeed, anonymous email is called ’spam’, and everybody knows what to expect. Why should anonymous posting to a forum result in something better? I am sure even Voltaire would be apalled at the concept of “anonymous free speech”. Over and out.\n\n"
    }
  ]
}
