{
  "id": "57136",
  "title": "Book Cover / Custom Type",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hey all,\n\nI'd love some micro/type-level feedback on this title/subtitle for a book cover.\n\n ![](http://web.archive.org/web/20150418221154im_/http:/typophile.com/files/covertype-tp_3656.gif)\n\nThe overall design (which has colors, and a photo, and stuff) has already been approved;\\* so this is just the type I'm now working on, which is all custom to varying degrees.\n\n\\* Actually, I'll have to submit a \"prefinal\" version of this tomorrow, for inclusion in the publisher's catalog. I'm expecting to be tweaking micro stuff between then and whenever I have to submit the final print files.\n\nThe headline was customized from Miso (Miso on top, my headline below):\n\n ![](http://web.archive.org/web/20150418221154im_/http:/typophile.com/files/miso-neuro-tp_4899.gif)\n\nAnything that strikes you as odd/wrong?  \n(I'm particularly wondering if the \"S\" is too wonky and/or wide, the \"K\" too wide, and the \"N\" too heavy?)\n\nThe font in the subline and author's name is my own work-in-progress, [Ernestine](http://web.archive.org/web/20150418221154/http:/typophile.com/node/53395), in a special cut (slightly heavier, and more display-ish, than the base cut, and the \"ft\" lig is new).  \nThis is going to be its first public appearance, so I'd be extra grateful for any opinions and comments!\n\n-Nina\n\n| Attachment | Size |\n| --- | --- |\n| [NeuroCover-TypePreview.pdf](http://web.archive.org/web/20150418221154/http:/typophile.com/files/NeuroCover-TypePreview.pdf) | 221.63 KB |\n\n",
  "author": "nina",
  "time": "19 Apr 2009 — 8:08am",
  "uid": "13487",
  "comments": [
    {
      "time": "20 Apr 2009 — 9:00am",
      "content": "Would bullets or mid-dots work better than dashes? I don't read German so I'm not sure of the context.\n\nKu looks a bit loose but the ball might be stopping them go closer. This K is somehow more convincing than the original cut. ft is lovely.\n\nI think you've done the right thing modifying the Miso. The A and H fit much better. I can't help with the spacing; I just can't see spacing so it always looks fine to me. Perhaps it looks tighter at the start of the word.\n\n"
    },
    {
      "time": "20 Apr 2009 — 9:10am",
      "content": "Cheers Ben!\n\nThe thing reads: _Neuro-Aesthetics. Art, [the] brain, [and] science._ (Does that ever sound stupid in English; it works better in German.)  \nFirst I had it with a comma and an ampersand, but the client said they want hyphens. Then I had middots, and they did look nice – but, the client said they want hyphens. But of course hyphens are grammatically wrong, so now they get dashes. I'm hoping they can't tell the difference, so at least I won't have to get into that argument.\n\n\"K\": There's less optical correction in this cut, so the arm isn't as thin. I admit it looks a lot nicer up close; it's just that at text sizes, the correction seems necessary to my printer. Dunno…\n\n<cite>\"Perhaps it looks tighter at the start of the word.\"</cite>  \nDang, you're right. \"NE\" is a lot tighter than \"IK\".  \nSomehow I always get really hard headlines to space. But I guess spacing just \\*is\\* hard. Better get used to it :-)\n\n"
    },
    {
      "time": "20 Apr 2009 — 9:25am",
      "content": "Hi Altaira!  \nI'm nothing close to an expert, so, take no notice if i'm not right :)  \nTo me it seems the \"neuro\" part needs a micro space less, and also OA (it looks like you want to brake the 2 words apart) and AS (it seems the S is going to spin (or fall) clockwise)... the THETIK part looks good to me :P just some thoughts...\n\n"
    },
    {
      "time": "20 Apr 2009 — 9:30am",
      "content": "Yes, hyphens would have been Very wrong ;)  \nI'd agree OA looks a bit spacey too.  \nSounds like an interesting book!\n\n"
    },
    {
      "time": "20 Apr 2009 — 9:42am",
      "content": ":-) Thanks for the pointers! (I'm not an expert either, especially not on spacing!)\n\n<cite>\"it looks like you want to brake the 2 words apart\"</cite>  \nActually, that was probably on my mind, not to make that \"break\" too tight. On the other hand, the \"NEURO\" will be black, and the \"ÄSTHETIK\" knocked out of the background image, so they'll probably be pulled apart enough without any help from the spacing ;)\n\nI'll have a closer look at the pairs you mentioned – thanks!\n\n"
    },
    {
      "time": "20 Apr 2009 — 1:20pm",
      "content": "Es sieht sehr gut an. Ich denke auch, dass Punkte werden besser sind, aber \"der Kunde ist immer recht\"... :(\n\n"
    },
    {
      "time": "22 Apr 2009 — 10:38am",
      "content": "Hey Nina,\n\nThe ft ligature is very cool and I also like the modded K.\n\nTo my eye the \"e\"s in Ernestine have too much space before them (the \"Ge\" pair in Gehirn and \"se\" pair in Wissenschaft).  \nSorry to hear you are working with another unenlightened client.\n\nGood luck with the project and with Ernestine.\n\n"
    },
    {
      "time": "22 Apr 2009 — 3:59pm",
      "content": "Cheers to both of you :-).  \n(Angechilada: nice German!)\n\nThanks for the spacing pointer Edward. (BTW, did you use to have some nice Miyazaki creature as an avatar, or am I mixing you up with somebody else?)  \nErnestine isn't properly spaced yet, and I tried to even it out in this thing…  \nbut I'm a bit worried about being somewhat space-blind. :-\\\n\n"
    },
    {
      "time": "23 Apr 2009 — 12:55am",
      "content": "Ja, das stimmt. Aber ich dachte dass Totoro war nicht ganz \"typographisch\". \"S\" ist mein magazinlogo. :-)\n\nI vote for midpoints/bullets/diamonds instead of dashes as well ...\n\n"
    },
    {
      "time": "23 Apr 2009 — 1:25am",
      "content": "Heh. What is this, German weeks on Typophile? :-\\>\n\nI would love to dig out the midpoints again.  \nBut I don't think I still have that option…\n\n"
    },
    {
      "time": "25 May 2009 — 12:52am",
      "content": "Now up on amazon: [http://www.amazon.de/dp/3865022162](http://web.archive.org/web/20150418221154/http:/www.amazon.de/dp/3865022162 \"http://www.amazon.de/dp/3865022162\")\n\nThis is still the provisional/\"preview\" version that doesn't have most of the changes discussed in this thread. But it shows the entire layout (horridly compressed), and it is the official first public appearance of my font :-).\n\n"
    }
  ]
}
