{
  "id": "57149",
  "title": "Do typophiles have a good handwriting?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Yes. As simple as that,  \nDo typophiles have a good handwriting?  \nAre you concerned with the meaning behind your handwriting and try to express something using it, or is it simply an uncontrollable aspect of you?\n\n",
  "author": "<a href=\"/web/20090425144025/http://typophile.com/user/43575\" title=\"View user profile.\">arch1k</a>",
  "time": "<br>",
  "uid": "43575",
  "comments": [
    {
      "time": " 19.Apr.2009 9.35pm",
      "content": "I don’t have good handwriting. It’s awful, actually.\n\n"
    },
    {
      "time": " 19.Apr.2009 9.44pm",
      "content": "[http://typophile.com/node/19878](http://web.archive.org/web/20090425144025/http:/typophile.com/node/19878 \"http://typophile.com/node/19878\")\n\n"
    },
    {
      "time": " 19.Apr.2009 10.32pm",
      "content": "Oh hells no!  \nI got into type design because I hate handwriting (not in general, just the transitive sense).\n\n"
    },
    {
      "time": " 19.Apr.2009 10.46pm",
      "content": "Not typophile-specific, but very interesting nonetheless:\n\n[http://www.themaninblue.com/articles/handwritten\\_typographers](http://web.archive.org/web/20090425144025/http:/www.themaninblue.com/articles/handwritten_typographers \"http://www.themaninblue.com/articles/handwritten\\_typographers\")\n\n"
    },
    {
      "time": " 20.Apr.2009 6.25am",
      "content": "Hi! I’m a designer... and I like my handwriting :)  \nactually, i’d only use handwriting if i could... I think if I stop exercising my handwriting I’ll have some trouble designing :P\n\n ![](http://web.archive.org/web/20090425144025im_/http:/typophile.com/files/faraqat_4810.jpg)\n\n"
    },
    {
      "time": " 20.Apr.2009 7.49am",
      "content": "Nah.  \nI have a crummy left-handed scrawl. Meaning behind it...? I wouldn’t subscribe to any deep graphology ideas, if that’s what you mean.\n\n"
    },
    {
      "time": " 20.Apr.2009 8.12am",
      "content": "My handwriting, both cursive and print, are excellant - when I want them to be. I just wish I had more time to practice calligraphy and sign lettering.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090425144025/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 20.Apr.2009 8.40am",
      "content": "Celeste - did you train as a doctor before becoming a designer?\n\nNick Cooke\n\n"
    },
    {
      "time": " 20.Apr.2009 9.02am",
      "content": "Nick, at least you got my name right! :)  \nit’s easier to write fast if you don’t take the pen off the paper, so I ended up with these examples... the second one is the one i use everyday, the last one is personal, just for me to read (notes, personal ideas, etc.) :)\n\n"
    },
    {
      "time": " 20.Apr.2009 11.39am",
      "content": "I used to have really nice handwriting, until I started using a computer. Now my handwriting is awful, as if the muscles in my hands have forgotten how to do it.\n\n"
    },
    {
      "time": " 20.Apr.2009 1.30pm",
      "content": "Mine is so unbelievably horrid, that upon graduation, my mom used examples of it to calm the parents of desperate preschoolers.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20090425144025/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": " 20.Apr.2009 4.02pm",
      "content": "graphology is to graphic design what phrenology is to neurology\n\n"
    },
    {
      "time": " 20.Apr.2009 9.22pm",
      "content": "Sometimes it takes me a while to read my own handwriting..\n\n- Scott\n\n"
    },
    {
      "time": " 20.Apr.2009 10.41pm",
      "content": "Pathetic handwriting, clumsy paws, useless for pencil, pen, brush. Geometry is the last refuge of the scoundrel :)\n\n"
    },
    {
      "time": " 21.Apr.2009 1.40am",
      "content": "I never thought of graphology as something to take notice, never found an example i could trust, but i know little about it to criticise. To some point i believe handwriting can be a reflex of something, but i think it has more to do with pratice, dedication, context (and this is why i posted that image) and usefullness. Then it evolves, and becames an extension of your arm... so, it’s like drawing. This is what I think, it might be naive...\n\n"
    },
    {
      "time": " 21.Apr.2009 2.07am",
      "content": "<cite>“i think it has more to do with pratice”<br>\n“Then it evolves, and becames an extension of your arm”</cite>  \n…or it doesn’t, especially nowadays. When people don’t write by hand every day and all the time, I don’t really see how some “signal” of their personality (assuming there can be such a thing to begin with), in their handwriting, wouldn’t be drowned out by the noise caused by troubled technique, and lack of practice.  \nLike, I know a bunch of people in computer jobs who all have similarly horrid, inconsistent, and illegible handwriting, while they’re vastly different people/characters. What unites them is, they don’t usually hand-write.\n\n"
    },
    {
      "time": " 21.Apr.2009 3.05am",
      "content": "...and I guess when they _do_, it’s with a ballpoint, which isn’t going encourage calligraphic strokes...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 21.Apr.2009 5.44am",
      "content": "Imagine a drunken rooster with itchy athletes feet trying to walk backwards up a muddy slope. His tracks in the mud would look better than my handwriting.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Apr.2009 6.29am",
      "content": "I would really like to know what the handwriting of Charles Borges de Oliveira is like :) I bet it’s good. Charles?\n\n"
    },
    {
      "time": " 21.Apr.2009 8.11am",
      "content": "I read the other thread and ChrisL said he was a victum of having to take quick notes. This totally rings true for me. I’ve had times where I’ve had to litraly decipher my own scrawl and re-write it just to make the information useful. I realy dont think that it can get better with practice, or maybe it can when your still younger, as long as you dont have to rush! Who knows? It’s nice to know that im not the only one who sufferd!!! nice topic idea btw.\n\n"
    },
    {
      "time": " 21.Apr.2009 8.20am",
      "content": "I too am in the no camp.\n\n"
    },
    {
      "time": " 21.Apr.2009 9.41am",
      "content": "In grade two, when we started to learn cursive writing instead of printing, mine was so bad that my teachers stopped asking me to try and just go back to printing. My dad printed in caps, and of course I wanted to be just like dad, so from then on, I printed in capital letters. After a while, (20 years) it got to a point that it was so messy that I couldn’t read my own notes half of the time.\n\nI had always known about the [Bouma](http://web.archive.org/web/20090425144025/http:/en.wikipedia.org/wiki/Bouma) model, so I decided to try an experiment.\n\nSo there I was, 20something years old, sitting on my deck in downtown Toronto with a stack of printouts with dashed lines on them and I literally practiced drawing a sheet of letter a’s, then b’s, then c”s… I did this for a little less than a week, and then simply forced myself to print in U&lc. It took about six months - one year to become comfortable with it, but once I had made the transition I noticed that I could go about 2x faster, have letters that were almost 2x messier, but due to the fact that I now had word-shapes that weren’t there when printing in all caps, I could read it 2x as easily. It’s still pretty bad though.\n\nEven more interesting, the day following a seizure, my handwriting is bad beyond belief. If I’m not sure I’ve had a seizure in my sleep, my handwriting the next day is often a give-away. I’m sure there’s a PhD thesis in there somewhere.\n\n"
    },
    {
      "time": " 21.Apr.2009 10.31am",
      "content": "I print in caps generally too.  \nI read somewhere that Joseph Muller Brockmann was interested in graphology.\n\n"
    },
    {
      "time": " 21.Apr.2009 10.34am",
      "content": "on a very basic, level I guess there is something to the concept of graphology - The perosn with a very tidy cursive who dots their i’s with little circles may have a different personallity than the person with hand writing that looks like it was done in total darkeness while he was blind drunk. Other than that... no.\n\nMine is like one of the above.\n\n-=®=-\n\n"
    },
    {
      "time": " 21.Apr.2009 10.38am",
      "content": "It is supposed to reveal something about the author’s personality rather than circumstance.\n\n"
    },
    {
      "time": " 21.Apr.2009 10.54am",
      "content": "I’m not being sexist here, but i think dotting i’s with little circles is generally a teenage girly thing to do... or maybe little hearts... aaaah.\n\nNick Cooke\n\n"
    },
    {
      "time": " 21.Apr.2009 11.03am",
      "content": "Heh. I actually still do the circle-tittle thing in my signature. But that’s because I ligate a lot, and if I do a normal tittle I’m going to ligate it to the following “n”, and then it looks like I’m called “nha”, or something. Not that anyone could read the top version…\n\n ![](http://web.archive.org/web/20090425144025im_/http:/typophile.com/files/circletittle_6247.jpg)\n\n"
    },
    {
      "time": " 21.Apr.2009 11.14am",
      "content": "Interesting topic, one I’ve always wondered about.\n\nI pretty much learned to type so that others could read my writing. When I do write it is more of a shorthand notation. You could not understand the individual words without the greater context. I think I learned that from my dad. When I do try to slow down and write legibly it usually comes out mixEd cAsE and I tend to run out of room on the right side of the sheet.\n\nAnd as far as content (like my graphic design) I usually need to spew it all out on the sheet then cut/paste/move it into some sort of logical order. Hard to do when it’s hand written.\n\n...I’m glad I’m not the only one :-)\n\n"
    },
    {
      "time": " 21.Apr.2009 11.21am",
      "content": "I guess I also “ligate” like Nina. Crossing T’s and dotting i’s can make a mess. And any letters that have similar adjacent strokes I sometimes merge together. The word “walk” would have w, a, l, and then I’d use the vertical from the l for the k. So if you didn’t know the context it would say “wak”. There are others, but I can’t think of them when I try.\n\n"
    },
    {
      "time": " 21.Apr.2009 11.28am",
      "content": " ![](http://web.archive.org/web/20090425144025im_/http:/typophile.com/files/hand_5597.png)\n\nTo me it is like enjoyable exercise... and part of maintaining hand skills.\n\np.s. I never did pay attention to the lines : )\n\nMichael\n\n"
    },
    {
      "time": " 21.Apr.2009 11.31am",
      "content": "Wow, Michael, do you really write like this every day? Shopping lists and all?\n\nThat “g” is amazing.\n\n"
    },
    {
      "time": " 21.Apr.2009 11.36am",
      "content": "Don’t even ask me about shopping lists!\n\nChrisL\n\n"
    },
    {
      "time": " 21.Apr.2009 11.49am",
      "content": "Yep!\n\nSomeone has to make up for Chris’s frailties : )\n\nEdit: when I got to the checkout line at the grocery store last week a woman looked at my list and complimented my wife on her handwriting. I told her it was mine. We got to talking and found out she was an art director. Gave her my card and she said she needed a lettering artist for a logo she was working on. Started on it yesterday. Cool huh?\n\nMichael\n\n"
    },
    {
      "time": " 21.Apr.2009 12.05pm",
      "content": "Michael,  \nWhen I was at the grocery, a women looked at my list and asked where I went to medical school. :-)\n\nChrisL\n\n"
    },
    {
      "time": " 21.Apr.2009 12.08pm",
      "content": "Another no here. I can’t always read my fast notes, which can be tricky after a briefing.\n\nAt school I often had a little message from the teacher in test papers to write more neatly (with pencil). In the upper secondary school I wrote all my notes with a fountain pen with ink cartridges. That was sometimes messy but mostly enjoyable, I should really replace the usual ballpoint pen with one of those.\n\n"
    },
    {
      "time": " 21.Apr.2009 12.20pm",
      "content": "My wife says I write in a Morse code. Not always, but frequent enough to miss some items when grocery shopping :-)\n\n(edit) @dezcom - hahaha, just read your last comment .. lol\n\n"
    },
    {
      "time": " 21.Apr.2009 12.38pm",
      "content": "Hey Chris\n\nHave you noticed that the doctors always write their handwriting sloppiness off to the harried pace. Last time at the doctors office I told him he could not use that as an excuse anymore because I sat in the little room for an hour while I heard him joking with the nurses. Told him I hoped that he was practicing his handwriting while I was waiting, otherwise I was going to start billing him for waiting time.\n\nMichael\n\n"
    },
    {
      "time": " 21.Apr.2009 2.04pm",
      "content": "Gone are the days when doctors were old guys and I was the young guy flirting with the nurses :-(\n\nChrisL\n\n"
    },
    {
      "time": " 21.Apr.2009 2.28pm",
      "content": "I have pretty good handwriting. So do a lot of other designers I know.\n\n"
    },
    {
      "time": " 21.Apr.2009 4.31pm",
      "content": "Michael, that’s beautiful. Your soul is connected to your hand in ways I cannot comprehend.\n\nI wonder whether my clumsiness in writing and drawing triggered my fascination with type?\n\n"
    },
    {
      "time": " 21.Apr.2009 5.56pm",
      "content": "I have incredibly ’immature’ handwriting in my opinion.\n\nMichael - clearly not the first to say ... but that is some awesome hand writing.\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090425144025/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 21.Apr.2009 6.27pm",
      "content": "Ratbaggy\n\nMaybe that is why my wife has kept all the notes I wrote her over the years : )\n\nIt is funny, I treasure the notes I have from my father he wrote over the years (dead ten years) and he too took pride in his handwriting. I guess the apple does not fall far form the tree.\n\nMichael\n\n"
    },
    {
      "time": " 21.Apr.2009 6.54pm",
      "content": "After years of graphite covered palms on my left hand, my printing style never evolved after 7th grade and my cursive looks something like Chank’s Yellabelly font which I only use to write out checks, otherwise I did make certain to spend many evenings as a kid developing a ’cool’ signature since I knew that’s what I’d be writing most often . . .\n\n:D\n\n"
    },
    {
      "time": " 21.Apr.2009 7.11pm",
      "content": "Paul... it is such an interal part of what I do that sometime I forget that what others call lettering I call handwriting with a different sort of pen. This is nothing more than handwriting with a “twist.”\n\n ![](http://web.archive.org/web/20090425144025im_/http:/typophile.com/files/Prayer_4793.png)\n\nSee the similarity to my ball point pen writing above?\n\nMichael\n\n"
    },
    {
      "time": " 21.Apr.2009 7.19pm",
      "content": "mine was never good, but I have improved it over the year, and now it is not really all that bad for things like, uh, lists.\n\nI make a good show of taking notes and meetings, but anything longer than a few lines though and it deteriorates to illegibility, and I give up and just doodle :o)\n\nI blame computers.\n\n-=®=-\n\n"
    },
    {
      "time": " 22.Apr.2009 10.12am",
      "content": "I always had quite meticulously written lecture notes in my (Maths) undergrad degree, which is probably why I eschewed Word in favour of LaTeX and consequently started caring about typography ... These days I hardly write anything by hand so it has deteriorated somewhat but I bought a calligraphy book last week. Will see where that takes me.\n\n ![](http://web.archive.org/web/20090425144025im_/http:/typophile.com/files/mathnotes_4892.jpg)\n\n"
    },
    {
      "time": " 22.Apr.2009 11.36am",
      "content": "When it comes to my handwriting, my love of type begins to look like a matter of pure pragmatism.\n\nMy handwriting is heavily influenced by my mother’s, which could be described charitably as “EKG-like.” As a result, I tend to write in all caps to slow myself down and make the letter forms more distinct. Additionally, I’m a lefty, which adds a whole other layer of handwriting impediments.\n\n"
    },
    {
      "time": " 22.Apr.2009 3.55pm",
      "content": "I made a free font of my Dad’s handwriting, called Chemist:  \n [http://cathydavies.com/fonts.html](http://web.archive.org/web/20090425144025/http:/cathydavies.com/fonts.html \"http://cathydavies.com/fonts.html\")\n\n ![](http://web.archive.org/web/20090425144025im_/http:/typophile.com/files/chemist-specimen_3943.gif)\n\nAnd, as an owner of several expensive coffee table tomes on Eric Gill, I’m certain he was a typophile.\n\nHe made some very unusual lettershapes, consistently. For example, lowercase e’s wth a distinct crescent shape, like an uncial e.\n\nHas anyone out there admired their parents’/grandparents’ handwriting?\n\n"
    },
    {
      "time": " 22.Apr.2009 4.15pm",
      "content": "Well, that’s depends. Not every designer have drawings skills but they’re great designer. Is the same, is a natural development. In elementary schools is where teach us to write... sometimes in our lives we could perform our writing but some times is other side.\n\n"
    },
    {
      "time": " 22.Apr.2009 6.20pm",
      "content": "my handwriting is bad. i have a theory that in general, girls write better than guys because as teens girls tend to write letters to each other, whereas guys don’t bother so much.\n\n"
    },
    {
      "time": " 22.Apr.2009 6.52pm",
      "content": "Everybody always complained about my handwriting.\n\nUntil I made a TTF out of it.\n\nNow it’s my most downloaded font ever and I keep getting e-mails asking permission to use it.\n\nSo I guess my hand-writing is OK, but my hand-kerning sucks:)\n\n"
    },
    {
      "time": " 23.Apr.2009 2.45am",
      "content": "Hey Cathy, I’d just found that font of yours online the other day.\n\nI certainly liked _my_ dad’s handwriting too; he was not hugely educated, nor particularly interested in “calligraphy”, but just brought up in a time when kids were taught to write “properly” more than they have been lately, I suppose...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 23.Apr.2009 2.45am",
      "content": "“Has anyone out there admired their parents’/grandparents’ handwriting?”\n\nCathy, my grandfather and my father had very similar handwriting, i find them beautifull, yet had totally diferent education levels, and they both also have some drawing skills. My mother has one of those rounded, huge, handwritings. Both my parents are primaryschool teachers, and their handwritings are not, by far, a reflex of what they teach at school :P  \nI think i was influenced by my father’s, i always tried to copy it... in the end, with no success, as you can see above, some say :P  \ni’ll try to find some examples to show you :)\n\n"
    },
    {
      "time": " 23.Apr.2009 11.15am",
      "content": "“graphology is to graphic design what phrenology is to neurology”\n\nI’ve actually been gathering research and books on graphology. Neurology as well, but that’s another topic.\n\nI run the risk of being stoned to death for supporting quackery, but mind you, handwriting analysis is respected in Europe, less so in the United States, and if for nothing provides an interesting and often times amusing take on letterforms from outside my profession.\n\nAntiquated systems of interpretation and description have their merits in the over all scheme of everything. It wasn’t that long ago that designers were seriously trying to find the corresponding geometric shapes for the colors red, blue, and yellow.\n\n"
    },
    {
      "time": " 23.Apr.2009 12.32pm",
      "content": "Do you have this?\n\n[http://www.amazon.com/Manual-Graphology-Eric-Singer/dp/0517616726](http://web.archive.org/web/20090425144025/http:/www.amazon.com/Manual-Graphology-Eric-Singer/dp/0517616726 \"http://www.amazon.com/Manual-Graphology-Eric-Singer/dp/0517616726\")\n\n"
    },
    {
      "time": " 23.Apr.2009 12.58pm",
      "content": "@ daniel\\_poeira : That happens to you too?\n\nMy scribbly hand printing was the basis of nearly the second font I made, which I released for free and of those early works is the most popular. Even had requests for embedding licenses, and seen it pop up places I wasn’t told about.\n\nWorking on polishing it up with an expanded character set for a pay release.\n\n"
    },
    {
      "time": " 23.Apr.2009 1.42pm",
      "content": "Nick, I do have that book, although I cannot say I have read through it.\n\nI have a whole stack of graphology books waiting for a rainy weekend, but the one that gives a nice general historical view of the differing schools of graphology is the recently published The Definitive Book of Handwriting Analysis: The Complete Guide to Interpreting Personalities, Detecting Forgeries, and Revealing Brain Activity through the Science of Graphology by Marc Seifer.\n\nI cringe at the words Definitive, Complete, and Science in the title.\n\nNo, I am not a new age freak burning scented candles in my isolation room.\n\n"
    },
    {
      "time": " 24.Apr.2009 5.34am",
      "content": "I have brutal handwriting, and my notes, usually hand-printed, are even worse. I will say that I developed some interesting ligatures; ing looks kind of like a yogh from a mediaeval manuscript. But yeah.\n\n"
    }
  ]
}
