{
  "id": "57212",
  "title": "Ellipsis, colon or dash?",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I don't know what punctuation is best in this odd sentence. Can anyone help?\n\n ![](http://web.archive.org/web/20140725173538im_/http:/typophile.com/files/coaching%20for_5222.jpg)\n  \nEverything I try looks weird. \n",
  "author": "Bendy",
  "time": "21 Apr 2009 — 5:43am",
  "uid": "20652",
  "comments": [
    {
      "time": "21 Apr 2009 — 5:48am",
      "content": "Hmm… I'd use a colon I think. And I might also substitute a comma for the semicolon after \"problems\". Or, any chance to turn that into a bulleted list?\n\nIf you stick with the ellipsis, wouldn't you need a space after it?\n\nBTW, wouldn't \"Who is coaching for?\" be considered somewhat bad English?\n\n"
    },
    {
      "time": "21 Apr 2009 — 5:59am",
      "content": "[HEAD]\n\nCoaching works for people at all levels.\n\n[COPY]\n\nExecutives and decision makers with complex problems.  \nOperational managers balancing conflicting priorities.  \nStaff with new practices designed to increase productivity.\n\nOr something like that. If you can’t simplify it, then put a period after levels and let the string of clauses stand on their own even though they are not a sentence.\n\n"
    },
    {
      "time": "21 Apr 2009 — 6:03am",
      "content": "I think title is good English...the style guides I've read say that 'For whom is coaching?' just sounds unnatural...is that what you meant? Maybe I could do 'Who can benefit from coaching?' and then take out the bit 'coaching works for people at all levels...'?\n\nI rather like semicolons for lists of long strings of text, they show more of a break than a comma would. I was thinking of bulleting it, but you can see the length of each item would be longer than a line and I don't have more space...always the same old problem with space!\n\nI think a colon might be the right answer. I don't know about space after an ellipsis and thought it looked unbalanced unless there was one in front too...I need a more comprehensive style guide!\n\n"
    },
    {
      "time": "21 Apr 2009 — 6:22am",
      "content": "Yeh, that's what I meant, Ben. Good to know! My English teacher used to almost rip my head off when I made sentences like that. Stupid teacher. (-:\n\n"
    },
    {
      "time": "21 Apr 2009 — 6:40am",
      "content": "Grammar teachers often give rules they think are right, when it just sounds fussy and over-formal in reality. I used to teach grammar :)\n\nThese days I tend to follow the Penguin style guide and the Campaign for Plain English guidelines: say what you mean and prefer spoken language to wordy constructions.\n\nI saw a sign on the train the other day: 'Emergency equipment is located on the train in the direction indicated', followed by an arrow. In my head I was correcting it: 'Emergency equipment this way'.\n\n"
    },
    {
      "time": "21 Apr 2009 — 8:17am",
      "content": "I'd go for a colon to introduce what is effectively a list, making it do the work that Fowler said it had made its own special function: 'that of delivering the goods that have been invoiced in the preceding words' (_Modern English Usage_, 2nd edn, rev. Gowers, p. 589).\n\nA list should either be separated into individual items either by semi-colons or by commas, never by both. Commas are used for most lists; semi-colons for lists in which one or more of the individual items already contain their own comma. As none of your items/examples contain their own commas, your list can be broken up with commas:\n\n_Coaching works for people at all levels: for senior executives and decision makers with complex problems, for operational managers who would like support as they work to balance conflicting priorities, and for individual staff members as they put into practice new learning designed to help them work more productively with others._\n\nAn ellipsis, which conventionally represents omitted material, a trailing off, or a pause intended to produce or recreate a 'dramatic, rhetorical, or ironic effect' (_Oxford Guide to Style_, p 129), isn't - I think - correct, and creates an arch and confusing effect in such straightforward, technical prose.\n\n"
    },
    {
      "time": "21 Apr 2009 — 8:43am",
      "content": "Thanks for the definitive answer :) I like it.\n\nI was beginning to think the ellipsis was completely incorrect and I'm glad Oxford agrees!\n\nI tend to use semicolons to separate items in lists of wordy phrases where a comma would separate lists of words. I find it avoids the confusion of thinking the commas might belong inside the item. I don't think I'm following any style guide by doing that so perhaps I should stop. I do like semicolons on the whole! :)\n\nIn this particular list, the repetition of 'for' emphasises where how the items connect distinctly.\n\nThanks :)\n\n"
    },
    {
      "time": "21 Apr 2009 — 8:57am",
      "content": "I realised it was a little guffy too:  \n\"as they put into practice new learning designed to help them work more productively with others\"\n\nnow reads: \"as they put into practice new ways to work more productively with others.\"\n\n"
    },
    {
      "time": "21 Apr 2009 — 8:59am",
      "content": "I have a tendency to do the same thing with wordy lists (i.e. separating them with semi-colons whether or not they contain internal commas), but I'm always more-or-less certain I shouldn't be doing it, so I was grateful for a reason to pull out the various style guides on the shelf to find out why.\n\nThe old _Hart's Rules_ is where I usually run for a pithy rule about where and how to use punctuation, but it isn't very helpful on the matter of lists and the use of colons and semi-colons in and around them.\n\nI was given pause for thought by the fact that my third example in my list of uses of an ellipsis contained a couple of commas. Whether or not I was right in sticking with commas to divide the overall list because the commas only occurred within a piece of quoted material, remains to be seen.\n\nI'm sure someone will correct me . . .\n\n"
    },
    {
      "time": "21 Apr 2009 — 9:11am",
      "content": "To my eyes, a semicolon would look funny before the last item in a list. I realise that contradicts what you said about sticking to either commas or semicolons.\n\nI thought your description of the ellipsis was perfectly punctuated.\n\nI liked the way you also moved the prepositional phrase and adjective next to the verbs they describe.\n\n"
    },
    {
      "time": "21 Apr 2009 — 9:18am",
      "content": "^ you are right that a semicolon breaks clauses within a list where one or more clause contains a list that has commas. A colon is the right choice in the example, but somehow it always feels like having a flashing red and a stop sign at an intersection. Em dashes are great but really make a dramatic pause, and you usually need a set. In ad copy it is common to use non-sentence phrases without a subject and verb and treat them as a sentence. IMHO, parellelism and brevity are most related to comprehension. Sometimes the correct punctuation or usage, if not understood by the reader, causes more confusion. I still can’t give up “more than” instead of over. Oh well.\n\n"
    },
    {
      "time": "22 Apr 2009 — 10:28am",
      "content": "I think you ended up at this conclusion anyway but I'm in favour of a colon at the beginning with the list items separated by semicolons. Putting a semicolon before the \"and ... \" is optional but might be helpful if your listed clauses are very long.\n\nMaybe the \"for\" at the beginning of each is unneccessary?\n\nCoaching works for people at all levels: executives and decision makers with complex problems; operational managers who require support to balance conflicting priorities; and staff working with new practices designed to increase productivity.\n\n"
    },
    {
      "time": "22 Apr 2009 — 12:11pm",
      "content": "Thanks everyone, nice conclusion reached :)\n\nEdward, I think in your example the semicolons do the job of the 'for', whereas if commas are used the 'for' shows where the listed items connect to the premise.\n\n"
    }
  ]
}
