{
  "id": "57241",
  "title": "resume",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "greetings, fellow typophiles!\n\nToday I would like to get some feedback on the design of my resume.\n\nI was always a big fan of various designs created with helvetica, it seems to make certain design treatments look very good. I am however not a big fan of the typeface, and never use it myself. I particularly hate the lc 'a'.  \nSo with this resume, I wanted to try and recreate a common helvetica layout without using helvetica.\n\nThe result uses Kris Sowersbys National.\n\n| Attachment | Size |\n| --- | --- |\n| [resume.pdf](http://web.archive.org/web/20131020071254/http:/typophile.com/files/resume_1.pdf) | 69.71 KB |\n\n",
  "author": "victor ivanov",
  "time": "22 Apr 2009 — 12:37am",
  "uid": "13653",
  "comments": [
    {
      "time": "22 Apr 2009 — 12:02pm",
      "content": "Hey, Victor,\n\nIn general, I like the bold look: the grid, the horizontal rows and rules, etc.\n\nThings I am not so keen about:\n\n1) I don't know what the custom is in Australia, but in the United States, at least, the word \"Résumé\" does not usually go on a résumé. This is even recommended in books about job-hunting. (Now, if you are going to keep it in there, I think it's much too big, and using all caps makes it stand out even more. Also, there should be accents on both instances of **e**.) I think it would be better if you gave the large, bold italic treatment to your name and contact info instead, without making the type as big as \"RESUME.\"\n\n2) IMO, the city and date in the first column of \"EXPERIENCE\" should be vertically aligned to the top, like the two columns to the right.\n\n3) I don't like seeing the word breaks in the company names (AKOL Technologies, Avral Technologies). Maybe the type could be a bit smaller, or that column could be a bit wider.\n\n4) The column of text under \"PERSONAL TRAITS\" and \"INTERESTS\" is too wide to be read comfortably. And after the earlier, narrower columns on the first two pages, it's a bit of a jump: you get to page three and don't feel like reading anymore. You might want to split the width into two columns, and maybe even break up the \"PERSONAL TRAITS\" text into more than one paragraph. Or just shorten the text. Remember, it's a résumé, not a curriculum vitae -- you should try to keep things brief and pique the employer's interest, so that you get an interview.\n\n5) The white space beneath the rules should always be the same height.\n\n"
    },
    {
      "time": "23 Apr 2009 — 1:42pm",
      "content": "I second Ricardo's suggestions.\n\nMy observations have more to do with content than design, I recommend changing your Personal Traits and Interests paragraphs and meld them into an \"objective\" paragraph that first would state the kind of job you are looking for. This can be loose and a little vague, something like: It is my goal to work at a fast-paced design firm that specializes in both print and web design. then segue into \"I embrace challenging projects that allow me to push myself creatively while meeting the needs of the client.\" and so on.\n\nProspective employers may not be hiring you for your writing skills but don't let your writing shoot you in the foot either. And so, I would also recommend that you re-write your job descriptions. Almost all them begin with either \"I have\" or \"I was\" introduce some variety.\n\nIt's probably a matter of personal preference, but I would only list the software and not the level of proficiency. They may say oh, he's not advanced at Java and not consider you when you truly have the skills required. The specific depth of your skills is probably best left for an interview.\n\nFinally, (and this may be a cultural thing since life seems to be very relaxed down under) but never tell a someone whom you are hoping will hire you that you enjoy hanging out with friends and having a couple of drinks. Even though almost everyone in the entire world enjoys that (including most bosses). It's unprofessional to put on a resume.\n\nBest of luck in your search.\n\n"
    },
    {
      "time": "23 Apr 2009 — 1:58pm",
      "content": "Was reading else where on-line that many people consider an Objective paragraph superfluous. I see it as a means of introduction before getting down to the nitty gritty, so decide for yourself. However, the posters (most of whom were hiring managers or recruiters) were all in agreement that listing personal information (hobbies, interests and etc.) does not shine favorably on you.\n\n"
    },
    {
      "time": "23 Apr 2009 — 5:05pm",
      "content": "A 3 page resume seems crazy to me but I think it's really fun and kinda ballsy.\n\n"
    },
    {
      "time": "23 Apr 2009 — 9:27pm",
      "content": "_Was reading else where on-line that many people consider an Objective paragraph superfluous._\n\nI never really thought it necessary, either, so in my résumés I replace it with a short profile -- like you say, it's an introduction before getting into the details of work history and education.\n\n"
    },
    {
      "time": "12 May 2009 — 2:29am",
      "content": "first and foremost thank you everyone who has commented. I'm sorry it took me so long to get back here, but my working machine's motherboard failed, so i am still waiting for my new computer which makes things very difficult. Once I've cought up with all my other stuff, i will review and modify the resume and post back for more opinions.\n\nkind regards,\n\nvictor\n\n"
    }
  ]
}
