{
  "id": "57256",
  "title": "images of arabic scrips",
  "forum": "Arabic Typography & Type Design",
  "tags": [
    "Arabic Typography & Type Design"
  ],
  "content": "Hi everyone,\n\nI’m writing my essay about the history of the different Arabic scripts, i’m having a hard time finding good images of the different scripts and was wondering if maybe someone here on typohile could help me out with some good quality images of the different scripts:\n\n- Kufi and ornament Kufi  \n- Naskh  \n- Thuluth  \n- Diwani  \n- Taliq  \n- Farsi  \n- Ruqaa  \n- Perzisch script  \n- Maghrebi\n\ni’m not asking for annyone to do all the work for me, its just that i’m absolutely no specialist in separating all the different scripts from one another, and i obviously don’t want to guess. i did find some images on the net but most of them are of poor quality. i checked the academie's library but there is absolutely nothing about this subject, of course i will mention the source of the images in my essay and be glad to send a copy.\n\ni would really appreciate all the help.\n\n",
  "author": "omar",
  "time": "22 Apr 2009 — 11:16am",
  "uid": "25150",
  "comments": [
    {
      "time": "2 May 2009 — 9:45am",
      "content": "Try to get hold of a copy of Mohamed Zakariya's _The calligraphy of Islam : reflections on the state of the art._ This is the best guide I have found to the different styles, demonstrating each with the same phrase for easy comparison. The book also shows a number of rare styles, and explains how they differ from related styles.\n\nMr Zakariya also contributed a 'compendium of Arabic scripts' to Nabil Safwat's _The art of the pen_ (see Appendix II). This includes an informative showing of paired scripts at different sizes, showing how they are related but how each is appropriate to a particular size of writing.\n\n"
    },
    {
      "time": "7 Sep 2009 — 12:13am",
      "content": "Hi Omar,\n\nFor the Lebanese computing magazine ACCE (Al Computer, Communications & Electronics) Mohamed Zakarya also created a series of original examples to correct the usual uninformed cliches when he reviewed a book about Arabic typography. You can download a copy here:\n\n[www.decotype.com/publications/2006-05-01\\_ACCE\\_HSAF-reviewEN/2006\\_ACCE-HS...](http://web.archive.org/web/20150414233627/http:/www.decotype.com/publications/2006-05-01_ACCE_HSAF-reviewEN/2006_ACCE-HSAF-review.pdf \"www.decotype.com/publications/2006-05-01\\_ACCE\\_HSAF-reviewEN/2006\\_ACCE-HSAF-review.pdf\")  \n(English)  \n [www.decotype.com/publications/2005-10-01\\_ACCE\\_HSAF-reviewAR/AlKumbyuutar...](http://web.archive.org/web/20150414233627/http:/www.decotype.com/publications/2005-10-01_ACCE_HSAF-reviewAR/AlKumbyuutar_cover_story.pdf \"www.decotype.com/publications/2005-10-01\\_ACCE\\_HSAF-reviewAR/AlKumbyuutar\\_cover\\_story.pdf\")  \n(Arabic).\n\nA bit late, but I hope this will help to get clear examples.\n\nThomas Milo  \nDecoType  \n [www.decotype.com](http://web.archive.org/web/20150414233627/http:/www.decotype.com/ \"www.decotype.com\")\n\n"
    }
  ]
}
