{
  "id": "57259",
  "title": "What's a good, elegant match for Mousse Script?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "My girlfriend has been looking for an upscale restaurant job in Seattle for months now. She has a great resume, but I finally realized we needed to do something to really make it pop.\n\nI'm not a designer, but I thought maybe we could pick a lovely display font for her name at the top of the page and make it big and bold so she has some distinctive branding. Then, instead of an \"Objective\" we could just put some kind of snappy one-line tagline.\n\nFor the display font, we both fell in love with Mousse Script Regular:  \n [http://new.myfonts.com/fonts/sudtipos/mousse-script/regular/](http://web.archive.org/web/20150417063555/http:/new.myfonts.com/fonts/sudtipos/mousse-script/regular/ \"http://new.myfonts.com/fonts/sudtipos/mousse-script/regular/\")  \nin a dark navy.\n\nBut... I'm having a hard time matching it to a good typeface for the rest of the document. She likes Palatino with its serifs and kind of swoopy Q's, but it seems to look kind of old-fashioned next to the splashy header. Is there some well balanced modern font (or a few suggestions) that might look good for the rest of her resume?\n\nAlso, what about the \"tagline\"? You think it should also be in Mousse Script, or the text font?\n\nAfter looking through hundreds of different typefaces my brain is starting to go numb. A talented eye would be so appreciated.\n\n",
  "author": "danieltalsky",
  "time": "22 Apr 2009 — 1:52pm",
  "uid": "43986",
  "comments": [
    {
      "time": "22 Apr 2009 — 4:58pm",
      "content": "You could use something equally inky. I want to suggest [Dolly](http://web.archive.org/web/20150417063555/http:/new.myfonts.com/fonts/underware/dolly/) but that might be cost prohibitive. What fonts do you already have access to?\n\n"
    },
    {
      "time": "23 Apr 2009 — 10:18am",
      "content": "I have access to Dolly and will try it. Thank you, that is an excellent suggestion.\n\n"
    },
    {
      "time": "24 Apr 2009 — 12:12pm",
      "content": "It looks great. It's true, the thick letterforms complement Mousse Script really well. Thank you for taking the time to look for me. It's not something I have a great talent for so your eye is really appreciated.\n\n"
    },
    {
      "time": "24 Apr 2009 — 5:00pm",
      "content": "Your are welcome and I'm happy to have helped. :^)\n\n"
    }
  ]
}
