{
  "id": "57311",
  "title": "Proofing fun",
  "forum": "Jongseong's blog",
  "tags": [

  ],
  "content": "I've just discovered that the printer I've been using at home, an old HP LaserJet 1200 inherited from my parents, actually supports printing at 1200 dpi by 1200 dpi. The driver I had been using only offered resolution up to 600 dpi, and I hadn't bothered to check. Silly me.\n\nI changed the driver, and printed a quick proof of my current type design experiment. Before, using the 600 dpi setting, I had judged the printer unusable for proofing type. Turns out that at 1200 dpi, it's actually quite serviceable, at least for my means and purposes.\n\nHere are some snapshots. The first and last images are of the type at 12 points; the middle two, at 14 points. The design is a continuation of the hangul text design I blogged about previously, to which I've tried adding matching Latin, Greek, and Cyrillic components. The latter two scripts in particular are very much incomplete, as are accented characters. Many glyphs are just place-holders left over from previous type design experiments.\n\n ![](http://web.archive.org/web/20101123023426im_/http:/typophile.com/files/proofing1_6458.jpg)\n\n ![](http://web.archive.org/web/20101123023426im_/http:/typophile.com/files/proofing2_3563.jpg)\n\n ![](http://web.archive.org/web/20101123023426im_/http:/typophile.com/files/proofing3_6019.jpg)\n\n ![](http://web.archive.org/web/20101123023426im_/http:/typophile.com/files/proofing4_6602.jpg)\n\n",
  "author": "<a href=\"/web/20101123023426/http://www.typophile.com/user/12009\" title=\"View user profile.\">Jongseong</a>",
  "time": "<br>",
  "uid": "12009",
  "comments": [
    {
      "time": "",
      "content": "Don’t forget to do some proofing at 600 DPI. Plenty of the people who buy your fonts will be running test prints at 600 DPI in their studios, and that includes your PDF specimens.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for pointing that out. Indeed, I'll also have to continue to do some proofing at 600 dpi, since one of my goals is to design a face that holds up well in less than ideal printing conditions. I'm flattered to hear the suggestion that people might actually buy my fonts, as I'm a hobbyist who has never finished a font in his life.\n\n"
    },
    {
      "time": "",
      "content": "Hey, that's the printer I happen to have. Was this on a Windows machine or Mac that you changed the driver?\n\n"
    },
    {
      "time": "",
      "content": "I'm on a Windows machine. I simply went into printer properties to change the driver, and the PS driver that supports 1200 dpi was among the list of available drivers.\n\n"
    }
  ]
}
