{
  "id": "57346",
  "title": "Square sans caps in \"PUB\" bumper ident for French television station TF1",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello!  \nI’m new and I need your help, because I’m desperate x)  \nI would like find the font of the “PUB” text on this picture(I know this text is very worked and in 3D): [http://sd-4.archive-host.com/membres/images/200069295556933682/PUB\\_TF1.p...](http://web.archive.org/web/20090428164534/http:/sd-4.archive-host.com/membres/images/200069295556933682/PUB_TF1.png \"http://sd-4.archive-host.com/membres/images/200069295556933682/PUB\\_TF1.png\")  \nMaybe there are several fonts for this 3 letters, i dont know...  \nI need know the name(s) of this font(s) for a new project (I’m fond of graphics arts since a lot of time).\n\nI hope you’ll help me and I wish you a very good afternoon ;)\n\nI’m sorry if I was not allowed to post here, I understood the rules with a lot of difficulty...\n\n(I’m a very young french who don’t speak english, also sorry for the bad english or the lot of errors!)\n\nThank you in advance (I’m not sure this sentence is good ^^’ )\n\nSincerely, Logan\n\n",
  "author": "<a href=\"/web/20090428164534/http://typophile.com/user/44062\" title=\"View user profile.\">Logan</a>",
  "time": "<br>",
  "uid": "44062",
  "comments": [
    {
      "time": " 25.Apr.2009 9.44am",
      "content": "These look like done by a furniturer, not a typedesigner necessarily. Nice, but no full font, methinks.\n\n"
    },
    {
      "time": " 25.Apr.2009 10.16am",
      "content": "I do not really, you think than the text was made manually, it’s not a true font?\n\n"
    },
    {
      "time": " 25.Apr.2009 10.21am",
      "content": "It almost looks like computer modeling to me, but I agree with Renko. I don’t think it is a font.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 26.Apr.2009 6.00am",
      "content": "Bonjour Logan,\n\nJe crains que cette annonce Pub de TFI est fait sur mesure. Les formes des caractères-immeubles sont très rigides et géométriques, et franchement pas vraiment bien dessinées. Il existe des typos sans sérif assez carrées donc s’est possible de trouver quelque chose de similaire (et meilleur). En plus ces formes là sont très simples à dessiner soi-même.\n\nQue recherches-tu exactement dans ce caractère? Que penses-tu par exemple de [Fiedler Gothic](http://web.archive.org/web/20090428164534/http:/www.fontshop.com/fonts/singles/creative_alliance/pl_fiedler_gothic_bold/&sample_text=PUB&sample_size=96)?\n\n"
    },
    {
      "time": " 26.Apr.2009 10.14am",
      "content": "J’ai pensé à [Countdown](http://web.archive.org/web/20090428164534/http:/www.fontshop.com/search/&q=countdown&x=0&y=0&sample_text=PUB) quand j’ai vu votre image.\n\n- Lex\n\n"
    }
  ]
}
