{
  "id": "57341",
  "title": "Letterpress, woodblock type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hey,  \nrecently i've really been enjoying the letterpress work of Anthony Burrill and Craig Ward....\n\ni found this ( [http://typophile.com/node/29280](http://web.archive.org/web/20150109083026/http:/typophile.com/node/29280 \"http://typophile.com/node/29280\")) previous post on here, and these suggestions for letterpress style fonts (Monotype Grotesque 1 & 2, Bureau Grotesque 1 & 2, Grotesque No. 9, Gothic No. 13),  \nbut as i have no access to an actual press, i was wondering if anyone has made any really nice authentic looking fonts directly from original woodblock or letterpress lettering with imperfections an' all....?\n\ni found some by Chank, but wasn't really digging them...\n\nor does anyone have any good photoshop tips on how to grunge up a font to make it look letterpressed....? i don't want a totally over the top grunge effect, just a look that is as real and subtle as possible, as close as possible to the real thing like the Burrill and Ward examples attached...\n\nall suggestions welcome!\n\n ![](http://web.archive.org/web/20150109083026im_/http:/typophile.com/files/anthonyburrill_5777.gif)\n\n",
  "author": "leif",
  "time": "25 Apr 2009 — 4:28am",
  "uid": "25735",
  "comments": [
    {
      "time": "25 Apr 2009 — 4:30am",
      "content": "sorry, here is the Craig Ward example...\n\n ![](http://web.archive.org/web/20150109083026im_/http:/typophile.com/files/craigward_6118.jpg)\n\n"
    },
    {
      "time": "25 Apr 2009 — 6:47am",
      "content": "There area variety of ways to weather type but none will look as authentic as the real thing, without a great deal of work. Look at the arrow in the sample above and how the ink works at the edge. This sort of thing could only be achieved on a character by character basis. A good basic approach would be to have a texture (wood grain, or solid letterpress coverage from a solid block) scan that, use threshold to reduce to black and white, lay texture under the type layer, and then cause the text layer to blend using the lighten function. Wherever the texture is white the type will appear to have decayed. Good luck.\n\n"
    },
    {
      "time": "25 Apr 2009 — 6:57am",
      "content": "thanks for the suggestion!  \nyeah i understand theres nothing like the real thing...\n\n"
    },
    {
      "time": "25 Apr 2009 — 10:08am",
      "content": "I know nothing about the quality of the “Wood Type Impressions” products, but they seem to fit your bill, so take a look and let us know what you think:  \n [http://withoutwalls.com/index.htm](http://web.archive.org/web/20150109083026/http:/withoutwalls.com/index.htm \"http://withoutwalls.com/index.htm\")\n\nI would also recommend the Machine Wash filters from Mister Retro; I used them to create two of the fonts in my [Black Monday](http://web.archive.org/web/20150109083026/http:/www.typetrust.com/fonts/font.php?id=ODEx) series and was very happy. They don’t necessarily do anything with Photoshop that you can’t do with stock images, layers, and blending modes, but they do it very quickly and conveniently at a great price: [http://www.misterretro.com/machine\\_wash\\_filters\\_bundle.html](http://web.archive.org/web/20150109083026/http:/www.misterretro.com/machine_wash_filters_bundle.html \"http://www.misterretro.com/machine\\_wash\\_filters\\_bundle.html\")\n\n"
    },
    {
      "time": "26 Apr 2009 — 6:05am",
      "content": "ah james, those links are great thankyou so much! the wood type impressions looks like exactly what i was looking for!  \nthanks very much for your help!\n\n"
    },
    {
      "time": "26 Apr 2009 — 8:59am",
      "content": "The Chank Fonts were 'digitally grunged'. The best way to get authentic looking letter pressed wood type is to get scans of authentic letter pressed wood type. AFAIK, that's exactly what the Wood Type Impressions product is.\n\nThat said, for that price, go talk to a local letter press studio and I'm sure they could give you the real thing.\n\n"
    },
    {
      "time": "26 Apr 2009 — 11:15am",
      "content": "Yves Peters has a tutorial, [The Worn/Weathered/Stamped Look](http://web.archive.org/web/20150109083026/http:/fontfeed.com/archives/tip-the-wornweatheredstamped-look/). (Be sure to read through the comments, especially the one from Heather Dicks about substituting one of the steps with an alternative filter.)\n\nThen the there is a series by Cameron Moll, [That Wicked Worn Look](http://web.archive.org/web/20150109083026/http:/www.cameronmoll.com/archives/000024.html).\n\nI've used Yves' technique with great results.\n\n"
    },
    {
      "time": "27 Apr 2009 — 2:02am",
      "content": "thankyou very much Aluminum and Ricardo!\n\n"
    }
  ]
}
