{
  "id": "57348",
  "title": "CodePeanut v.1 - Morse code font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": " ![](http://web.archive.org/web/20150416152713im_/http:/typophile.com/files/CodePeanut-one-sample_3793.png)\n  \nI came up with this to make a random looking texture pattern of large and small circular blobs. The pattern of the characters is based on Morse code, the dahs represented by circles three times the diameter of the dits, all enlarged slightly to overlap and then the joints were smoothed. I have only rendered the basic alphabet A-Z, copied to a-z. Other characters (punctuation, numerals, accented characters) are currently filled with a temporary 90° rotated I glyph.\n\nThe image above is from dummy text generated by [MacLorem](http://web.archive.org/web/20150416152713/http:/judebear.daveward.net/).\n\n",
  "author": "cuttlefish",
  "time": "25 Apr 2009 — 9:55am",
  "uid": "14556",
  "comments": [
    {
      "time": "31 May 2009 — 2:33pm",
      "content": "OK, so this is either completely perfect as is or it's so unappealing nobody wants to be the first to say anything. Is this an apt conclusion or a false dilemma?\n\nBut still, anybody with a Mac who is needing dummy text should go out and download MacLorem (linked in the first post). It's good stuff. I'm not affiliated with the author of that software in any way, just a fan of the product.\n\n"
    },
    {
      "time": "31 May 2009 — 2:41pm",
      "content": "It's a cool concept. I just can't read Morse Code so I didn't feel qualified to comment. :-\\>  \nIn any case, I could see this used for making cool looking textures/patterns with hidden meaning. Kinda like the the stuff on the [MyBook](http://web.archive.org/web/20150416152713/http:/en.wikipedia.org/wiki/Western_Digital_My_Book), but less \"technical\" looking, more bubbly and… Seventies? :-)\n\n"
    },
    {
      "time": "31 May 2009 — 3:06pm",
      "content": "Thanks, that's exactly the sort of purpose it's meant for--placing semi-secret messages on machine grates and similar things. It probably would have to be laser cut for a similar application to what the MyBook case has. A stamping die that fine might be difficult to create and maintain with all these curves. Something injection molded like a car grille shouldn't be as hard.\n\n"
    },
    {
      "time": "1 Jun 2009 — 10:33pm",
      "content": "well ... it looks kinda cool.\n\nwhat else is there to say? your kerning is off?\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20150416152713/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "2 Jun 2009 — 1:28am",
      "content": "Fair enough. I guess the question is should I proceed and extend the font with proper Morse code numbers, punctuation, and diacriticals, or release it as-is? Would someone who uses something like this really be interested in communicating more than rudimentary messages with it?\n\n"
    }
  ]
}
