{
  "id": "57359",
  "title": "Monospaced kerning??",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Sorry if this is a superb-noob question but: There are kern at monospaced typefaces? how that kind of fonts manage the equal width size for \"i\" and \"m\" the same?\n\nThanks and sorry! :D\n\n",
  "author": "mikej",
  "time": "25 Apr 2009 — 5:40pm",
  "uid": "37792",
  "comments": [
    {
      "time": "25 Apr 2009 — 10:02pm",
      "content": "I don't know how \"superb\" it is, but...\n\nIt sounds like you're not clear on the meaning of \"kerning\".\n\nEvery character in a font has a certain width. These widths are where the normal spacing in a font comes from.\n\nIn a proportional font, these widths vary, depending on the _proportions_ of the character. So, as you mention, the \"i\" and the \"m\" would be different widths.\n\nIn a monospaced font--also called non-proportional--, the characters are all made to fit into the same width. So, the \"i\" is made wider, or has more space around it, and the \"m\" is made narrower.\n\nKerning is a method of adjusting the spacing between certain pairs of characters, such as \"A\" and \"T\", for which the normal spacing is too loose or too tight. A monospaced font would never have kerning pairs. If it did, it would, in effect, cause some characters to have different widths, and then it wouldn't be monospaced anymore.\n\n"
    },
    {
      "time": "26 Apr 2009 — 2:28am",
      "content": "There are also mono style fonts which are made to give the look of a mono without actually being one. They have different widths and probably kerning as well but of course then, by definition they are not Monospaced.\n\nIt is not easy to make the width of the m & i that same. But if you look a many Monospaced fonts you will begin to see what the strategies being used are.\n\nYou may also ant to look at the Wiki\n\n[http://typophile.com/node/12054](http://web.archive.org/web/20150302020003/http:/typophile.com/node/12054 \"http://typophile.com/node/12054\")?  \n [http://typophile.com/node/12410](http://web.archive.org/web/20150302020003/http:/typophile.com/node/12410 \"http://typophile.com/node/12410\")?\n\nThe last wiki entry also has links to relevant threads\n\n"
    },
    {
      "time": "27 Apr 2009 — 1:42pm",
      "content": "A good example of what Eben mentions above is ITC American Typewriter. It is \"typewriter-like\" with the emphasis on the \"like\" part. It isn't monospaced like the typewriter fonts it imitates.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "13 May 2009 — 9:28am",
      "content": "[The logo of CBS's Early Show](http://web.archive.org/web/20150302020003/http:/www.cbsnews.com/sections/earlyshow/main500202.shtml) gets its distinctive look from manual kerning before and after the lowercase l of Andale Mono.\n\n"
    },
    {
      "time": "13 May 2009 — 10:34am",
      "content": "If you want to have a set of glyphs that will set both monowidth and proportionally spaced, then kerning will do the trick.\n\nOf course, the glyph widths should be all the same.  \nNext, kern the font.  \nSo, \"kerned\" will be the default. (But not in Word.)  \nBut if a typographer wants monospaced, then all that is required is to enter \"0\" in the kern field of the Character palette in InDesign.\n\nIt would be possible to do it the other way round, i.e. to kern a proportionately spaced font to set as though it were monospace, however, there would be a problem at the beginning of lines.\n\nThe easiest thing to do is two separate fonts, one monospaced, one proportional.\n\nI have actually had requests for a kerned (proportional spaced) version of Panoptica, but as the whole raison d'être of that typeface is to be monospaced-unicase, to provide a proportional version would negate its personality.\n\n"
    }
  ]
}
