{
  "id": "57369",
  "title": "Johnston: P22 or ITC ???",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i was wondering if anyone could advise me on the differences (if any) between the P22 and ITC johnston Underground fonts...?  \nare there any differences in the letter forms, and if so which do people prefer?\n\nonce before i caused abit of a rumpus when i asked which is the better Garamond , ITC or Adobe (adobe won hands down), so its always helpful and insightful to hear what more experienced people than myself think...\n\nthanks\n\n",
  "author": "<a href=\"/web/20111211235227/http://typophile.com/user/25735\" title=\"View user profile.\">neill k</a>",
  "time": "<br>",
  "uid": "25735",
  "comments": [
    {
      "time": "",
      "content": "When you are talking about a Garamond it seems like you have a fairly good idea about how it is likely to be used. In the case of Underground that seems less clear. And I think the use it is going to be put to may have a bearing on the choice. In many ways the best person to ask about differences is Paul Hunt because he was the man behind the P22 release. The P22 release Underground Pro is much more complex and covers more scripts than the ITC does.\n\n"
    },
    {
      "time": "",
      "content": "thanks for posting Eben, yes i had looked at the P22 pro version and it seemed extensive...  \nIts just a font ive seen used in some nice (and sometimes unexpected) ways lately, it really caught my eye on the Eat Your Own Ears promotional material for gigs....\n\n"
    },
    {
      "time": "",
      "content": "Hi Neill,\n\nlots of information in [this older thread](http://web.archive.org/web/20111211235227/http:/typophile.com/node/55495) and the links mentioned there.  \nF\n\n"
    },
    {
      "time": "",
      "content": "Paul can confirm this, but I believe the goals of the two revivals were different. ITC Johnston is an updating of the original design. It it \"regularizes\" the original, removing some of its quirkiness and clunkiness. For example, it tapers the joins more, in line with current thinking about letter design. But I see the redesign also changes a number of letters and in the process loses some of the distinctive charm of the original.\n\nI believe P22's Johnston Underground is more of an authentic revival, with all of the quirkiness and charm, and also a much expanded character set.\n\nAs Eben said, it depends on what you want it for. I think ITC Johnston was intended to for usage in signs where people were used to the original, but modernized a bit. I'm not sure I agree with the concept, but if that's what you want ITC Johnston is for you.\n\nPersonally, I loved the original signs in the Tube when I was a student in London back in the '60s, so I'd go for Paul's version.\n\n"
    },
    {
      "time": "",
      "content": "thanks for posting guys (and thanks for the link to the older thread!), learning that the P22 version retains some of the originals 'imperfections' is exactly what i was wondering about....  \nthanks again for posting!\n\n"
    }
  ]
}
