{
  "id": "57370",
  "title": "Metrolite with a double decker 'a'?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello type community!\n\nDoes such a thing exist? I'm looking for a more true-to-the-original version of Metrolite (No. 2 Comdensed) with that classic lowercase a, or at least one with the alternate a. I have this old type specimen that has both a's represented. The 2 story one is actually on there under Metrolight, rather than Metrolite. Was there an old knock-off? I always dismissed it as a typo, as the sheet was what seems to be a personal reference for a Linotype (that metal stuff) printer.\n\nI think I've asked this before, but the search function is revealing nil for me right now.  \nAny help appreciated.\n\n-David\n\n",
  "author": "dcastillo",
  "time": "26 Apr 2009 — 6:55am",
  "uid": "7765",
  "comments": [
    {
      "time": "26 Apr 2009 — 9:37am",
      "content": "According to McGrew's _American Metal Typefaces of the Twentieth Century_, pp. 216-7, the original version had two-storey a/g but in No.2 were replaced by one-storey a/g, with previous ones available as extras. _[edit]_ Linotype's normal version follows No.2 but there's [Metro Office](http://web.archive.org/web/20150214062702/http:/www.linotype.com/de/135960/metrooffice-schriftfamilie.html) which has the two-storey forms.\n\n"
    },
    {
      "time": "26 Apr 2009 — 11:31am",
      "content": "Thanks for the information. It seems like there's a sacrifice taken with both options--Metro Office has no light weight, and the M's don't have the towering angles. Both fonts don't have the Futura-like t's either.\n\nAfter a few minutes of deliberation, maybe I should bypass digital altogether and kick it old school.\n\nAny photo typesetters out there?\n\n"
    },
    {
      "time": "27 Apr 2009 — 4:49am",
      "content": "<cite> &gt; true-to-the-original version of Metrolite (No. 2 Comdensed) with that classic lowercase a, </cite>\n\nI'm not sure what the \"No. 2 Condensed\" is doing in your statement. There was never a Condensed style in the original Metro series. And No. 2 is not the \"original.\"\n\nAs Karsten points out. The two-story a and g were substituted by single-story versions for the release of \"No. 2\" in order to make it more directly competitive with the newly popular geometric sans serifs coming from Europe at the time (Futura, et al.).\n\nIn addition to replacing the a and g, the A G J M N V W v w comma semicolon and apostrophe were all replaced with more \"Futura-like\" versions as well. There were also Kabel-esque versions of W and e available as special orders.\n\nAFAIK, however, there was never a Futura-like t.\n\nIf you're going to kick it old school, then don't go photo -- find someone with a Linotype and a font of Metrolite matrices and get the truly \"true-to-the-original.\"\n\n"
    },
    {
      "time": "27 Apr 2009 — 5:01pm",
      "content": "re: kentlew:  \nWhat I was getting at with 'original' No. 2 was the first version of No. 2.\n\nLooking at this more carefully I'm realizing that my reasoning has been a bit flawed. I'm going off of this old sheet of Linotype-printed fonts which may be falsely named (Metrolight & Metrolite being listed--where No. 2 has the 2-story a). On top of that I'm looking at samples of old 45s that use a Futura-like font that I've somehow concluded to be Metrolite solely due to the 2-story 'a'. However, said labels have that Futura-like lowercase t.\n\nUltimately, I'm trying to find the font used on these labels. It's used with high enough frequency to make me believe it is something major and likely obvious, but I haven't ever encountered it in the digital domain, and I don't have any old type books or sheets that have it. The closest thing I have to it is Metrolite.\n\nI'm also trying to print labels like this the exact way they were printed 40 years ago, and I bet you're right in that it was metal rather than film. Here's a specimen:\n\n ![](http://web.archive.org/web/20150214062702im_/http:/typophile.com/files/not-metrolite_3734.jpg)\n\nExcuse my reasoning and lack of knowledge. I'm still trying to piece together how things were done before my time, how it all came to be, and so on.\n\n"
    },
    {
      "time": "27 Apr 2009 — 5:15pm",
      "content": "You might like this: [Metallophile Sp8](http://web.archive.org/web/20150214062702/http:/www.ms-studio.com/FontSales/metallophilesp8.html). It has both a single-story and two-story \"a\" (although I like how you call it \"double decker\").\n\n"
    },
    {
      "time": "28 Apr 2009 — 4:29am",
      "content": "Well why didn't you just say so? ;-)\n\nThat label looks like Tempo to me. (Designed by Robert Hunter Middleton; produced by Ludlow.)\n\nThe [digital Tempos](http://web.archive.org/web/20150214062702/http:/new.myfonts.com/search/Tempo/fonts/#undefined) offered by Adobe, Linotype, et al., only covered the one Bold Condensed style. But you might be especially interested in the warts-and-all version of [Tempo Medium](http://web.archive.org/web/20150214062702/http:/new.myfonts.com/fonts/redrooster/tempo-rr/) that Steve Jackaman did for Red Rooster.\n\n-- K.\n\n"
    },
    {
      "time": "28 Apr 2009 — 5:03am",
      "content": "Thanks to both of you for your help. I went on a long internet tangent last night and ran into Tempo, but only found bold samples (someone posted a headline with it on this forum). I'm assuming there was a light, medium, and regular version of this in the hot metal days?\n\nThis has me extremely interested in American Metal Typefaces of the Twentieth Century by Mac McGrew. How do you both rate it? I'm of the idea that this book would be in both of your libraries.\n\nMark, Metallophile looks great, it is distorted just right, whereas Tempo Medium is a bit too much for my taste. It will likely become a purchase in the near future, but right now all I can think of is a Ludlow press and a 4 year apprenticeship program.\n\n"
    },
    {
      "time": "28 Apr 2009 — 9:50am",
      "content": "According to McGrew, Tempo was produced in the following styles: Light, Light Italic, Medium, Medium Italic, Medium Condensed, Bold, Bold Italic, Bold Condensed, Bold Condensed Italic, Bold Extended, Heavy, and Heavy Italic.\n\nYes, McGrew is a oft-consulted reference in my library for just these sorts of questions. I find it useful and valuable.\n\n-- K.\n\n"
    },
    {
      "time": "28 Apr 2009 — 10:36am",
      "content": "Good Lord! Do we really need that \"warts-and-all version of Tempo Medium that Steve Jackaman did for Red Rooster\"? That's pretty terrible.\n\nAnd go here for a Typophile discussion of Tempo:\n\n[http://typophile.com/node/3673](http://web.archive.org/web/20150214062702/http:/typophile.com/node/3673 \"http://typophile.com/node/3673\")\n\n& yes, McGrew is an essential book if you want to study American metal type. Check out Tempo's different italics at different weights.\n\npowers\n\n"
    },
    {
      "time": "28 Apr 2009 — 1:52pm",
      "content": "McGrew is a must. Similarly, for type in Germany, \"Buchdruckschriften im 20. Jahrhundert\" by the TH Darmstadt.\n\n"
    },
    {
      "time": "7 Jun 2009 — 11:26am",
      "content": "My wonderful girlfriend ordered me McGrew's Preliminary Edition of _American Metal Typefaces..._ for my birthday. Any differences between this and the official release beside it being a photocopied edition?\n\n"
    }
  ]
}
