{
  "id": "57422",
  "title": "Ideal diacritics",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I appreciated reading the discussion about [Accurate glyphs for Romanian diacritics](http://web.archive.org/web/20131016084633/http:/typophile.com/node/53701). Especially the (so far) last post by [Florin Florea](http://web.archive.org/web/20131016084633/http:/typophile.com/node/53701#comment-343913), to me, raises a crucial issue: How helpful are samples that are contemporary and of typefaces that are not of, in this case, Romanian origin?\n\nCouldn't typophiles whose languages use of diacritics or \"special\" character --&nbsp;including non-Latin scripts like Cyrillic&nbsp;-- search local libraries for _historical_ documents and show scans or photographs, together with bibliographical data?\n\nIdeally, these documents would be pre-digital. Pre-Linotype/Monotype. Even better, manuscripts. Not only those that conform to what may be considered as good examples by _current_ standards but also those that do not conform. Personally, I am particularly interested in the variety of possibilities.\n\nSince many letters and diacritics are used in multiple languages, I think that there is no way around a certain amount of compromise. But with some background at hand one could at least make _informed_ decisions.&nbsp;&nbsp;;-)\n\nComments and samples are most welcome!\n\n",
  "author": "k.l.",
  "time": "28 Apr 2009 — 3:56am",
  "uid": "8664",
  "comments": [
    {
      "time": "28 Apr 2009 — 5:35am",
      "content": "Hi Karsten, I plan to scan samples of pre-digital diacritics used in the Czech language. I have many books, specimens, magazines, but the overall quality of the accents is often very poor due to many limits of the technology, printer skills etc. Once I will finish the scanning, i will upload the images to the database of the Diacritics Project at [http://diacritics.typo.cz](http://web.archive.org/web/20131016084633/http:/diacritics.typo.cz/ \"http://diacritics.typo.cz\").\n\n"
    },
    {
      "time": "28 Apr 2009 — 6:33am",
      "content": "I'm working on it for the Spanish tilde with both old scans, pictures of monuments and inscriptions, and 20th century hand-painted signs, but I'm going to wait until I've polished off a massive update to my blog post on its design. Of course, the tilde isn't the diacritic most people are left wondering about but, meh.\n\n"
    },
    {
      "time": "28 Apr 2009 — 1:35pm",
      "content": "Brilliant! Thanks to both of you in advance.\n\n<cite>but the overall quality of the accents is often very poor due to many limits of the technology, printer skills</cite>\n\nThis is indeed why I consider older documents as more important. And diacritics.typo.cz is a very good place for it.\n\n"
    }
  ]
}
