{
  "id": "5745",
  "title": "Lexia Readable - font for adult/adolescent literacy",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "LEXIA READABLE adopted by Dyslexia.com   \n   \n   \n\"I am not utterly convinced that Lexia is superior to ComicSans (my personal favorite), which is also available to our users -- but I do have to note that as soon as I converted our site to the Lexia readable view, I immediately spotted a typographical error on the page that had previously eluded me.   \n   \nLexia has been accepted for inclusion in the site customization feature of the Dyslexia.com web site.\"   \n   \nAbigail Marshall, Davis Dyslexia Association International, [http://www.dyslexia.com/](http://web.archive.org/web/20140803030043/http:/www.dyslexia.com/)   \n   \n   \nLEXIA and LEXIA BOLD are now available for free download from the K-Type website, [www.k-type.com](http://web.archive.org/web/20140803030043/http:/www.k-type.com/)   \nLEXIA Readable is totally free to use and distribute.   \n   \n   \nK-Type has designed it using Comic Sans, the font widely promoted by educationalists in the UK, as the basic model for legible weight and spacing, but has removed the sometimes problematical American childrens' comic book style in favour of more grown-up contemporary typographical elements, whilst still retaining a slightly hand-drawn feel.   \n   \nK-Type designer Keith Bates said, \"Comic Sans is considered culturally inappropriate or too whimsical for many uses, older students can feel patronized. It might be good for infant typography and 'Baby on Board' stickers, but its use risks undermining any serious message and appearing condescending to readers with greater visual maturity, and that's particularly important when applied to adolescent and adult literacy.\"   \n   \nTypographical concerns from recent educational publications and discussions, and some highlighted by the British Dyslexia Association have been incorporated into the design of Lexia - the simpler, handwritten forms of a and g, the non-symmetry of letters such as b and d, good sized descenders and ascenders, generous spacing and good screen clarity.   \n   \n   \n [www.k-type.com](http://web.archive.org/web/20140803030043/http:/www.k-type.com/)\n\n",
  "author": "keith",
  "time": "23 Jul 2004 — 2:14pm",
  "uid": "3477",
  "comments": [
    {
      "time": "26 Jul 2004 — 6:40am",
      "content": "hahahaha ... wait maybe you should have called it 'Our Kid'....   \n   \nit's comically funny every time!!!   \n   \nand dalton maag has been selling a font trademarked Lexia for 5 years... hahahahaha\n\n"
    },
    {
      "time": "1 Aug 2004 — 12:22pm",
      "content": "The research into the Lexia name was too scant, it's true - I've since discovered TWO fonts called Lexia, and I don't suppose this duplicate naming is a first in fontdom - I'm hoping that our font being Lexia Readable (and free for those with reading difficulties/dyslexics!) will dissuade Dalton Maag from suing K-Type for every penny it hasn't got.   \n   \nIf I have to change the name, I might take up Vincent's suggestion of 'Our Kid'. . . or maybe 'Comic Sons'?\n\n"
    }
  ]
}
