{
  "id": "57462",
  "title": "The Quintessential Font(s) of the Decade(s)",
  "forum": "Design",
  "tags": [

  ],
  "content": "Alright, so I thought this might be an interesting place to ask this question, and im sure the answers will very but what the hell.\n\nI’m a filmmaker and type-nut (though im not where as good as most of you). Since I’m such a nerd I always like to make sure my type is historically accurate, at least as of late.\n\nProblem is it’s tough to know exactly what are the best fonts to use from each time period. So I thought why not create a short list of the quintessential font(s) of the last few decades? That way if someone wants to make sure their type is historically accurate but doesn’t want to do a tonne of research they can quickly glance at the list and use one of the suggestions.\n\nSo what would you say? What are the quintessential fonts of certain decades?\n\nObviously this is a matter of opinion and no easy question but it still might be fun to get a ballpark idea.\n\nAlso we’re not necessarily looking for fonts that were simply DESIGNED during that decade, but ones that were around and preferably in use/fairly common for the era.\n\nSo while Helvetica was around in the 50’s, it didn’t really make its big breakout until the late 60s/Early 70s (if my memory of “Helvetica” the documentary is correct... which it probably isn’t). That means we’d probably list it in 60s/70s rather than 50s.\n\nI dont know, maybe this is only something myself and Mark Simonson give a crap about. All I know is these titles for this pseudo documentary that takes place in 2006 but tells this history of a school dating back to 1956 is FRUSTRATING. I dont know which way to go... argh.\n\n",
  "author": "<a href=\"/web/20090506122821/http://typophile.com/user/36180\" title=\"View user profile.\">adamschoales</a>",
  "time": "<br>",
  "uid": "36180",
  "comments": [
    {
      "time": " 29.Apr.2009 3.00am",
      "content": "ummmm...\n\nThis is a big and complicated question. It might help if you narrowed your search down to a certain decade or period, like the 60s or 90s. It’s very difficult to define a decade by a typeface. Helvetica probably fits everything from the 60s until today. Then there are typefaces that fit to a certain art/music history period (like art-deco, pop art, psychedelic music) and will mostly be used only when referring to this specific period. As I’m a kid of the 80s and 90s, it’s pretty hard to judge anything before that time, so I’ll stick to what I know (well, sort of):\n\n’Typefaces’ of the 80’s (in no particular order)  \n- LCD  \n- Squared typefaces (like Machine)  \n- [Rounded Atari typeface](http://web.archive.org/web/20090506122821/http:/www.racketboy.com/images/asteroids-box.jpg)  \n- [Back to the Future](http://web.archive.org/web/20090506122821/http:/www.mantripping.com/images/stories/back-to-the-future.jpg)  \n- Helveticanisms for everything serious and grown up... ;-)\n\n’Typefaces’ of the 90’s (in no particular order)  \n- Comic Sans/Arial  \n- Impact  \n- Pixel typefaces  \n- Techno typefaces  \n- Everything stretched and bent, blurred and embossed beyond recognition\n\ncheerio Queneau\n\n"
    },
    {
      "time": " 29.Apr.2009 3.58pm",
      "content": "Hmm thats a good idea. Any thoughts on what would be good for the 50s/60s era?\n\n"
    },
    {
      "time": " 29.Apr.2009 8.46pm",
      "content": "Hi Adam...\n\nI’ve found that it is much easier to point out when a typeface is used anachronistically in a film than it is to say what _would_ be appropriate.\n\nThat said, I would suggest doing some research at a library or somewhere you can look at magazines, advertising or books from the period in question. Another good resource for this kind of thing is the Taschen “All-American Ads” book series (assuming you’re looking for North American examples). Once you’ve got some examples of period typography that you like or would like to emulate, it’s just a matter of identifying the typefaces. If you need help identifying typefaces, resources like Typophile’s Type ID Board can come be handy.\n\n"
    },
    {
      "time": " 30.Apr.2009 7.59am",
      "content": "For set decoration and costumes, you might use an old Eatons or Simpsons catalog.  \nSo for type, look to ads in Macleans or Chatelaine from the appropriate era, or Art Directors Club annuals.  \nBut if your film is more niche, check out niche publications.\n\nAlso have a strategy for temporal span: not every car on the street in any given year is a late model, but you have to decide how aggressive the mise-en-scène is in locating the action at a particular point in time.\n\n"
    },
    {
      "time": " 30.Apr.2009 9.08am",
      "content": "With the 90s, you may have to specify which half you’re looking at. The early-mid 90s was all about grunge fonts and early Emigre stuff (Matrix, Bodega, etc.), and in the late 90s, once the web became prominent, things seemed to shift more towards cleaner and/or more “techno” fonts.\n\n"
    },
    {
      "time": " 30.Apr.2009 3.23pm",
      "content": "okay great, thanks for the advice guys. Perhaps a trip down the library won’t kill me. That or I could just re-watch Mad Men haha.\n\nCurrently I’m thinking I may use Neutraface. I know technically it wasn’t around in the 50s but its got a nice feel to it, and is absolutely beautiful.\n\n"
    },
    {
      "time": " 30.Apr.2009 5.05pm",
      "content": "You have to define usage, since definitive for text is different than definitive for adwork/display.\n\nBut here is my completely inaccurate, probably wrong analysis of the last 50 years. I don’t want to bother looking up the dates of the ITC fonts, so that is that.\n\n1960-1980  \nHelvetica\n\n1980-2000  \n ITC Garamond has got to fit into there somewhere. I dislike that face.  \n ITC Avant Garde has got to fit into there somewhere. I dislike that face also.  \n ITC Lubalin Graph has got to fit into there somewhere. Ditto. I notice a trend here.\n\n2000-  \n Myriad\n\n"
    },
    {
      "time": " 30.Apr.2009 6.16pm",
      "content": "Neutraface has more of a 30s-40s Art Deco vibe to my eye. 50s typography tended to be either pretty plain with all the creative energy channeled into hand-lettered display scripts. Some possibilities:\n\nGenerously spaced Futura or Trade Gothic caps  \nWide sans serifs like Venus Extended\n\nFor hand lettering, House’s Ed Gothic, Ed Script or Ed Roman would be pitch-perfect. Other possibilities would be Dom Casual, Balloon, Flash, or Murray Hill.\n\n"
    },
    {
      "time": " 1.May.2009 8.41am",
      "content": "Surely place matters as much as time: in the UK, most of the middle of the 20th century could be set in Gill Sans ;-D  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 1.May.2009 9.11am",
      "content": "Well its a pseudo-documentary about my Highschool which was built in 1956. Again, I was thinking Neutraface because it is just so freakin’ pretty, be it slightly inaccurate, but also Twentieth Century catches my eye.\n\nI’m also trying to think of a serif that might work... I’d be really nice if it matched the typeface used in their first yearbook but that might be pushing it...\n\n ![](http://web.archive.org/web/20090506122821im_/http:/typophile.com/files/chips1_6694.png)\n\n ![](http://web.archive.org/web/20090506122821im_/http:/typophile.com/files/chips2_3532.png)\n\n"
    },
    {
      "time": " 1.May.2009 11.35am",
      "content": "All the classics that came out of or were revived in the early 20th century were common in the ’50s: Century Schoolbook, Century Expanded, Caslon, Baskerville, Bodoni, Clarendon, Garamond... “CHIPS” appears to be some version of Century or Clarendon; the type on the title page appears to be Caslon Old Face or similar.\n\n"
    },
    {
      "time": " 2.May.2009 10.16am",
      "content": "A lot of the stuff on Mad Men is slightly off — and evidently done on a Mac (or PC). Which is anachronistic in a compeletely different sense, of course.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 2.May.2009 3.16pm",
      "content": "[I’ve noticed.](http://web.archive.org/web/20090506122821/http:/www.marksimonson.com/article/236/mad-men-mad-props)\n\n"
    },
    {
      "time": " 3.May.2009 6.36pm",
      "content": "Woah, holy crap! Mark Simonson responded to MY POST!? THE Mark Simonson!? I feel so honoured. That article (and the one you did for a bunch of films) is what got me thinking about all this and ensuring I at least TRIED to use all historically accurate type.\n\nSo... thanks for that! haha\n\n"
    },
    {
      "time": " 3.May.2009 7.35pm",
      "content": "Well, I guess my P.R. is working. :-)\n\nYou’re welcome.\n\n"
    },
    {
      "time": " 4.May.2009 10.37am",
      "content": "LOL\n\n"
    }
  ]
}
