{
  "id": "5747",
  "title": "Strange Mac Help",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,   \nI hope someone can help, my powerbook G4 has done this before and ive no idea how i fixed it the first time but Mac Help when I open it is just blank, if i try do a search nothing happens. Has anyone ever experienced this and has anyone any idea how i can fix it before im left with a clean install as my only option.   \n   \nthanks for any help,   \n   \ndavid.\n\n",
  "author": "david_leonard",
  "time": "23 July, 2004 - 3:12pm",
  "uid": "1394",
  "comments": [
    {
      "time": " 23 July, 2004 - 5:58pm",
      "content": "David,   \n   \nAssuming you're running OS X this means that   \n   \n~/Library/Documentation/Help/Help Center   \n(where ~ is your Home directory)   \nis missing.   \n   \nOr if you're launching Help from a specific application it means that that application's help files are missing. Applications Helps files are stored either in the Application bundle itself (not likely to be deleted unless you delete the application) or in /Library/Documentation/   \n   \nIt's the end of the day so I won't be able to go further than this. I'll check back this weekend.   \n   \nI can't seem to make mine come back either (i tested by moving it to the desktop) Maybe copy the file of another user?   \n   \nClicking the Home button in Help should take you to the main Help page (it may take a few moments. And go there each time after unless launched from a specific application.   \n   \nIf you are running OS 9 it means:   \n   \n1. Make sure the Apple Guide extension is installed in the Extensions folder, or is turned on in the Extensions Manager control panel.   \n2. Make sure the computer has enough memory to load the Apple Guide extension. Even if the Apple Guide extension is installed it may not load if there is not enough memory installed in the computer. This may be the case if you start up the computer from a CD-ROM disc with virtual memory turned off.\n\n"
    },
    {
      "time": " 26 July, 2004 - 1:04am",
      "content": "Thanks alot Jon, the files weren't missing. I have since made a clean install of OSX. Thanks again.\n\n"
    }
  ]
}
