{
  "id": "57492",
  "title": "What do we think of Vidange?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I can't say I care for it too much. I didn't like Barnbrook's [Priori Gill](http://web.archive.org/web/20131021123543/http:/typophile.com/wiki/Priori%20Gill) rework, but this goes a step further and takes Gill and tortures it into gimmicky shapes for no particular reason. Look at 'submit Forum topic' - up and down all over the place. It makes for an uncomfortable read.\n\n ![](http://web.archive.org/web/20131021123543im_/http:/typophile.com/files/Vid_5048.gif)\n\n",
  "author": "Nick Cooke",
  "time": "29 Apr 2009 — 9:41am",
  "uid": "3834",
  "comments": [
    {
      "time": "29 Apr 2009 — 9:53am",
      "content": "Lacks unity IMHO. The angled letters have a runic feel that doesn't mesh with the rounded letters from Gill.\n\n"
    },
    {
      "time": "29 Apr 2009 — 9:56am",
      "content": "I think it's interesting -- it seems to have some elements of some of the earlier Emigre typefaces like Manson/Mason, with a hint of Electrix and Lunatix. I think I'd like Vidage more if it was more its own thing, and didn't have characters that look so much like Gill (in particular, the lowercase \"t\").\n\n"
    },
    {
      "time": "29 Apr 2009 — 9:59am",
      "content": "Yeah, what a strange font. I'm not sure I get what it's about, and somehow I'm reluctant to believe there is no point behind its range of differing structures.\n\nSome details are awesome – I am very excited about its \"g\". And the \"q\" is interesting too. And the \"M\" seems very Jack Usine.  \nTo my eye, they just all seem to belong to slightly different fonts. :-\\\n\n"
    },
    {
      "time": "29 Apr 2009 — 10:25am",
      "content": "We loves it we does\n\n"
    },
    {
      "time": "29 Apr 2009 — 10:25am",
      "content": "What it's about: Jack is heavily influenced by vintage lettering seen on signs in France. Check out his fantastic [Jules Vernacular](http://web.archive.org/web/20131021123543/http:/www.vernacular.fr/) and you can see some of the forms that inspired Vidange. It's not a text face, folks. It's meant to be wacky.\n\n"
    },
    {
      "time": "29 Apr 2009 — 11:09am",
      "content": "The \"a\" kind of destroys the whole thing.\n\nThe smallcaps caught my interest; they look more like a coherent design somehow. This face might be best suited for all-caps uses, with the lowercase treated as ancillary just in case you need a lowercase character or two.\n\n"
    },
    {
      "time": "29 Apr 2009 — 11:11am",
      "content": "Thanks for the link, Stewf. Vindange makes much more sense in that context.\n\n"
    },
    {
      "time": "29 Apr 2009 — 11:34am",
      "content": "Yer. That’s wacky is what I thought until I saw by [whom](http://web.archive.org/web/20131021123543/http:/www.smeltery.net/) it was.\n\n"
    },
    {
      "time": "29 Apr 2009 — 2:48pm",
      "content": "I like Vidange and I love [Jules Vernacular](http://web.archive.org/web/20131021123543/http:/www.vernacular.fr/).\n\n-=®=-\n\n"
    },
    {
      "time": "29 Apr 2009 — 2:52pm",
      "content": "Good points. FWIW, I know (and have used some of) Jack's previous work, and love Jules Vernacular too; somehow my eyes still get a bit seasick from trying to reconcile the rounds and angles. Maybe it's just me.\n\n"
    },
    {
      "time": "29 Apr 2009 — 3:47pm",
      "content": "Me not like at all. (But I am a grumpy old guy, so what do I know…)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "29 Apr 2009 — 4:12pm",
      "content": "\\>I am a grumpy old guy, so what do I know\n\nHey, that's wisdom, don't knock it. As James Brown used to sing:\n\n:: SAY LOUD! :: I'M OLD AND I'M PROUD! ::\n\nOr something like that :)\n\n"
    },
    {
      "time": "29 Apr 2009 — 11:45pm",
      "content": "Wow, Stephen, with that background the forms make a lot of sense. I'm a fan. I can't think how I would ever recommend it to a client, but it's pretty great.\n\n"
    },
    {
      "time": "29 Apr 2009 — 11:52pm",
      "content": "to be cliche, when your local goth-club is seeking a new identity... Vidange!\n\n"
    },
    {
      "time": "29 Apr 2009 — 11:52pm",
      "content": "Wow. I like this one:\n\n ![](http://web.archive.org/web/20131021123543im_/http:/typophile.com/files/halle3_5253.jpg)\n\nThat should totally be cleaned up and turned into a font.\n\n"
    },
    {
      "time": "30 Apr 2009 — 12:09am",
      "content": "extra awkward, although the lowercase g is rather elegant.\n\n"
    },
    {
      "time": "30 Apr 2009 — 1:20am",
      "content": "_...grumpy old guy..._\n\nThere are some young fogies here too :-)\n\n\\*\\*\\*\n\nIt works for me, except when a sequence of letters is all Gill, e.g. \"topic\".  \nI'm like, why did the font change?\n\n"
    },
    {
      "time": "30 Apr 2009 — 1:43am",
      "content": "Was it Mark Twain who once said: _Wagner's music is not as bad as it sounds._  \nIf it does not look great before the explanations, why would it look great afterwards?\n\n"
    },
    {
      "time": "30 Apr 2009 — 8:04am",
      "content": "If you have an immediate dislike for something, are you condemned to despise it for eternity?\n\n"
    },
    {
      "time": "30 Apr 2009 — 4:36pm",
      "content": "Nope, you are right, Nick. Can I please dislike it until at least Monday?\n\n"
    },
    {
      "time": "30 Apr 2009 — 4:46pm",
      "content": "<cite>If it does not look great before the explanations, why would it look great afterwards?</cite>\n\nBecause type appreciation is cutural. The explanation allows me to appreciate why someone would design a font like this, why he thought that there are designers who might use it, and why he thought people wouldn’t have too much trouble reading it when they encounter it. I still wouldn’t use Vidange—it just isn’t my cup of rather orderly tea. But, having seen the photos that inspired it, I’m sure that there are plenty of designers in France who would just love to use Vidange.\n\n"
    },
    {
      "time": "30 Apr 2009 — 4:55pm",
      "content": "I used to hate how a Les Paul looked. Until I realized that the very nature of the Les Paul _defines_ what cool is. If it plays awesome, is awesomely useable, sounds great, works in any number of settings, etc., then almost magically it starts to look awesome as well.\n\nExcept for Vidange, which I don't think is that great because it doesn't look like it works for anything other than English Choral music filtered through a ring harmonizer.\n\nAnd that, my friends, is my personal interpretation of a David Berlow post. :)\n\n"
    },
    {
      "time": "30 Apr 2009 — 5:01pm",
      "content": "Dan, you’ve made me realize that I could use Dave’s posts as nonsense text in type specimens.\n\n"
    },
    {
      "time": "30 Apr 2009 — 5:17pm",
      "content": "James, I believe that in things visual and subjective (as well as in music), if you have to explain it at length, you've already lost.\n\n"
    },
    {
      "time": "30 Apr 2009 — 7:36pm",
      "content": "You've lost what? Or who? Subjectivity by definition means that some (given their background, culture, experience) might appreciate a piece of work while others will not. Vidange is not Gotham.\n\n"
    },
    {
      "time": "30 Apr 2009 — 11:23pm",
      "content": "Your public, Stephen? As in customers or consumers?\n\n"
    },
    {
      "time": "1 May 2009 — 12:04am",
      "content": "From another old fogey--Or as the Beatles would say, \"Let it Be\".\n\nChrisL\n\n"
    },
    {
      "time": "1 May 2009 — 12:08am",
      "content": "Thanks, Chris. Shall do :)\n\n"
    },
    {
      "time": "1 May 2009 — 1:29am",
      "content": "Me likes. Bucketloads. Fresh and unexpected. Puts you on the wrong foot; a sneaky, clever design. It is what it is -- no explanation needed, although knowing the cultural background is a nice bonus. Jack Usine is an original voice, and people comparing him to Barnbrook are only skimming the surface, they don't look closely enough. It's like saying TheSerif is too similar to PMN Caecilia. It only does so on the surface -- TheSerif is a decidedly masculine design while PMN Caecilia is unmistakenly feminine. Look closer.\n\nThree days a go I went to a [Wim Helsen](http://web.archive.org/) show, a brilliant Belgian stand-up comedian (although he does defy categorisation). Amongst the jokes and physical comedy there are some awkward and even truly painful moments, plus he gives the audience quite a bit of existential stuff to reflect upon. If you are a softie like me by the end you'll have shed the odd emotional tear. People could argue that he failed as a stand-up comedian, because when you leave you realise you only laughed two-thirds of the time. But then it hits you that more than just laughing you have _felt_ something, genuine emotions; that your heart is restless, that you want to do something, also with your life, and three days later you still have that existential stuff rummaging through your head.\n\nI like type that makes me _feel_ something. I don't know yet what I could use Vidange for, but boy does it make me feel alive.\n\n"
    },
    {
      "time": "1 May 2009 — 3:40am",
      "content": "I you want to read a small summary of an interview with Jack Usine and Fanny Garcia, you can download here – [http://www.slanted.de/eintrag/middle-nowhere](http://web.archive.org/web/20131021123543/http:/www.slanted.de/eintrag/middle-nowhere \"http://www.slanted.de/eintrag/middle-nowhere\") – at the end of the text an english and french pdf-version.\n\n ![](http://web.archive.org/web/20131021123543im_/http:/typophile.com/files/jack_fanny_6720.jpg)\n\n"
    },
    {
      "time": "1 May 2009 — 2:34pm",
      "content": "I don't really like it that much.\n\n"
    },
    {
      "time": "2 May 2009 — 6:30am",
      "content": "ok, so sure i have no idea where i would use it, but vidage is growing on me.\n\n"
    },
    {
      "time": "2 May 2009 — 12:09pm",
      "content": "\"What do we think of Vidange?\" I don't think it was Nick's original intent, but the phrasing suggest (at least to me) that typophiles can't make up their own mind without consulting the general opinion.\n\n"
    },
    {
      "time": "2 May 2009 — 12:48pm",
      "content": "I'm sure he meant \"What do you think of Vidange?\"\n\n"
    },
    {
      "time": "3 May 2009 — 3:14am",
      "content": "The function of this for of advertising is working - like Simon, it is growing on me! Si, thanks for the link. Awesome.\n\n"
    },
    {
      "time": "3 May 2009 — 8:40am",
      "content": "I meant Typophiles in general individually. ;^)\n\nNick Cooke\n\n"
    },
    {
      "time": "3 May 2009 — 12:55pm",
      "content": "'course, Nick :)\n\n"
    },
    {
      "time": "3 May 2009 — 1:30pm",
      "content": "To me it looks very well hand-crafted.\n\n"
    },
    {
      "time": "4 May 2009 — 6:42am",
      "content": "Here's what the creator thinks of it:\n\n ![](http://web.archive.org/web/20131021123543im_/http:/typophile.com/files/vidange_4976.png)\n\nGood on him, he has a sense of humour.\n\n"
    },
    {
      "time": "4 May 2009 — 9:47am",
      "content": "Nice one.\n\n"
    },
    {
      "time": "4 May 2009 — 3:47pm",
      "content": "paragraph: That's because he take his inspiration from things like manhole covers.\n\n"
    },
    {
      "time": "7 May 2009 — 7:40am",
      "content": "I agree with you Bald Condensed.\n\n"
    },
    {
      "time": "7 May 2009 — 8:18am",
      "content": "The 'strange' lowercase a reminded me of the 'original' shapes for Futura\n\n"
    }
  ]
}
