{
  "id": "57538",
  "title": "New from insigne: Olidia and Biscuit Boodle Ornaments",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20131020025803im_/http:/typophile.com/files/Olida-Poster_4804.png)\n\n[Olidia](http://web.archive.org/web/20131020025803/http:/new.myfonts.com/fonts/insigne/olidia/) is a script with tall sweeping ascenders packed with alternates and ligatures.\n\nOlidia Pro includes over 40 alternate characters and 20 ligatures. This allows designers to mix and match characters to create luxurious and graceful custom logotypes and headlines in OpenType capable applications such as Adobe‚s CS suite or QuarkXpress.\n\nThese alternates are also available in limited preset fonts that are available separately. Olidia Alternate One is highly ornamental, with plenty of sweeping ascenders and descenders, while Olidia Alternate Two is much more restrained and can be used for body copy. The Third strikes a balance between the two sets.\n\nOlidia Pro OpenType features include ending swashes, ornaments, ligatures, discretionary ligatures, titling alternates, contextual alternates, style sets and stylistic alternates. See the sample .pdf as a reference to quickly access desired alternate sets.\n\n ![](http://web.archive.org/web/20131020025803im_/http:/typophile.com/files/Biscuit-Boodle-Poster_5790.png)\n\n[Biscuit Boodle Ornaments](http://web.archive.org/web/20131020025803/http:/new.myfonts.com/fonts/insigne/biscuit-boodle-ornaments/) are the ornament complement to [Biscuit Boodle](http://web.archive.org/web/20131020025803/http:/new.myfonts.com/fonts/insigne/biscuit-boodle/), a fun and uplifting brush-drawn script.\n\n[Biscuit Boodle Ornaments](http://web.archive.org/web/20131020025803/http:/new.myfonts.com/fonts/insigne/biscuit-boodle-ornaments/) offer a total of 72 vignettes, crests, fleurons, frames and many other useful ornaments. These ornaments were brush-drawn by Portland Studios‚ Illustrator Justin Gerard and have just a slight amount of natural texture. These energetic and lively ornaments can be resized and rotated easily without any loss of quality and can easily be converted to outlines and modified.\n\nCombine them to form unique compositions or insert them into text to add some excitement to your designs. Please see the sample .pdf to see all 72 ornaments in action.\n\n",
  "author": "Jeremy Dooley",
  "time": "30 Apr 2009 — 9:06am",
  "uid": "8555",
  "comments": [

  ]
}
