{
  "id": "57532",
  "title": "The most beautiful font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was wondering what is the best type designed in your opinion.  \nI'm looking for references to learn and to find inspiration.  \nI think that some typefaces are not very elegant but it works very well (Quadraat) and others are really beautiful ...  \nTrinité is perhaps one of my favorites.  \nYours?\n\n ![](http://web.archive.org/web/20131020164943im_/http:/typophile.com/files/trinite_6293.png)\n\n",
  "author": "juandelperal",
  "time": "30 Apr 2009 — 8:24am",
  "uid": "14370",
  "comments": [
    {
      "time": "1 May 2009 — 1:59pm",
      "content": "Juan Pablo, what kind of learning and inspiration are you looking for ?\n\n"
    },
    {
      "time": "1 May 2009 — 2:27pm",
      "content": "Don't know about \"most beautiful\" but I think Georg Trump's [Delphin](http://web.archive.org/web/20131020164943/http:/new.myfonts.com/fonts/adobe/delphin/1/?testdrive=custom%3D0%26seed%3D23%26dock%3D0%26size%3D72%26w%3D720%26src%3Dcustom%26text%3DThe%2520MOST%2520beautiful%2520font%253F%26fg%3D000000%26bg%3Dffffff%26goodies%3Dot.liga) is pretty nice.\n\n"
    },
    {
      "time": "1 May 2009 — 2:29pm",
      "content": "As a matter of fact, Trinité is probably also my favorite.\n\n"
    },
    {
      "time": "1 May 2009 — 3:25pm",
      "content": "Hmmm… Lexicon, maybe. If only it had a different question mark.\n\n"
    },
    {
      "time": "1 May 2009 — 11:21pm",
      "content": "Trintié italic is really beautiful.\n\n"
    },
    {
      "time": "2 May 2009 — 11:16am",
      "content": "We should start by defining \"beauty.\" I recommend reading Edward Robert De Zurko, The Origins of Functionalist Theory. My copy is at the lab so I can't provide a full reference off hand. Strangely, it's not in my bibliography. While heavily slanted towards Western philosophy, it's still an amazing read.\n\n[Only one copy left!](http://web.archive.org/web/20131020164943/http:/www.amazon.com/Origins-Functionalist-Theory-E-Zurko/dp/0231021631/ref=sr_1_1?ie=UTF8&s=books&qid=1241288004&sr=8-1)\n\n"
    },
    {
      "time": "2 May 2009 — 3:37pm",
      "content": "My ideas about beauty in type have shifted towards doing a job well. Whereas the superficial prettiness of a specific glyph, especially if it gets in the way of utility has taken more & more of a back seat. There are plenty of type designs where you have both.\n\n"
    },
    {
      "time": "3 May 2009 — 4:39pm",
      "content": "<cite>what kind of learning and inspiration are you looking for ?</cite>\n\nMmm, I don't know really. I think that with time people becomes fan of some things. Type is –for the strange people like us– one of them.  \nI am thinking to design a new font and right now I want to think before start what I have to do and what not. I mean: in my last project I started to design but with no parameters or goals clearly defined. And this is not a good start point because you really don't have how to compare if you are right or wrong in the process.  \nIn typophile I learned a lot of things, and ask you a «top five» font ranking will be good to know another designs and oppinions about what are the cool and lovely things on type.\n\nJuan\n\n"
    },
    {
      "time": "3 May 2009 — 4:41pm",
      "content": "I know how hard are to define this things:  \nTop five movies  \nTop ten albums…  \nIt's like the Rolling Stone magazine\n\n"
    },
    {
      "time": "3 May 2009 — 7:00pm",
      "content": "Hammer or screwdriver. Which is more beautiful? Discuss.\n\n"
    },
    {
      "time": "3 May 2009 — 8:09pm",
      "content": "Hammers can used to drive screws, screwdrivers can't be used to pound in nails very effectively. Hammers are therfore 100% prettier than screwdrivers.  \nOne can't really comment on the beauty of a typeface without knowing how it will be used and in what context.\n\n-=®=-\n\n"
    },
    {
      "time": "3 May 2009 — 8:20pm",
      "content": "Trinité is truly beautiful. Screw your hammers.\n\n"
    },
    {
      "time": "4 May 2009 — 6:11am",
      "content": "<cite>One can’t really comment on the beauty of a typeface without knowing how it will be used and in what context.</cite>  \nAbsolutely. For books\n\n"
    },
    {
      "time": "4 May 2009 — 7:14am",
      "content": "What about improving your handwriting, would you do that ?\n\n"
    },
    {
      "time": "4 May 2009 — 8:56pm",
      "content": "If we agree that this is just for fun, then I'm a fan of\n\n1) SugarPie  \n2) Meta  \n3) Museo  \n4) Romeral  \n5) since you like TEFF typefaces, the one I like is Ruse.\n\nAnyone knows of a use case of Ruse? with images if possible?\n\n"
    },
    {
      "time": "4 May 2009 — 11:51pm",
      "content": " ![](http://web.archive.org/web/20131020164943im_/http:/typophile.com/files/Kent_4369.jpg)\n  \nI wouldn't say this is a particularly beautiful font, but the book is beautiful to read.  \nIt's _N by E_, by Rockwell Kent, published in 1930.  \nI bought a copy on Sunday at the bibliophile market.  \nOld publications with letterpress typography fascinate me, and not a few of my types have been attempts to transport the quality of yore to the digital-offset-pixel environment.  \n\n ![](http://web.archive.org/web/20131020164943im_/http:/typophile.com/files/kent2_6353.jpg)\n\n"
    },
    {
      "time": "5 May 2009 — 5:24am",
      "content": "<cite> &gt; Anyone knows of a use case of Ruse? with images if possible?</cite>\n\nElliot -- I believe I've seen bits of Ruse used in House Beautiful magazine here in the States. Unfortunately, no images for you. And I doubt you'll find a copy of it in Argentina.\n\n"
    },
    {
      "time": "5 May 2009 — 5:36am",
      "content": "Beautiful example Nick\n\n"
    },
    {
      "time": "5 May 2009 — 6:06am",
      "content": "Some of my favorites today (it always change)\n\nRayuela\n\n ![](http://web.archive.org/web/20131020164943im_/http:/typophile.com/files/rayuela_5565.png)\n  \nBorges  \nArcher  \n\n ![](http://web.archive.org/web/20131020164943im_/http:/typophile.com/files/archer-A-06_6474.png)\n  \nTrinité  \nLexicon  \nQuadraat - Quadraat Sans  \nMendoza  \nAldus (the italic is lovely)  \nPoliphilus  \nOn Sans - On Serif (textaxis.com)  \n\n ![](http://web.archive.org/web/20131020164943im_/http:/typophile.com/files/on_img_04_3975.jpg)\n  \nScala  \n… \n"
    },
    {
      "time": "5 May 2009 — 6:27am",
      "content": "Mr Shinn:\n\nAgreed.\n\nThat is a beautiful page. There's really nothing like letterpress.\n\nI love reading old E.B. White books. Most of them are set in either letterpress Electra or Fairfield. Whenever I read them I feel as if I'm part of an earlier, simpler time - on White's salt water farm in Maine during the late 30s or early 40s, maybe in early summer. I doubt that the same material set in today's laser-optimized, ultra-sharp fonts could achieve the same effect, respectfully.\n\nNo one could construct a sentence quite like E.B. White. Now combine that with a wholesome, warm, dark letterpress font on faintly musty, creamy paper, and what you've got is a kind of sensory and intellectual nirvana.\n\nBy the way, Mr Shinn, what type is being used on that page?\n\n"
    },
    {
      "time": "5 May 2009 — 10:01am",
      "content": "Mr Szabo, please call me Nick!  \nI believe the face is Fournier.\n\n"
    },
    {
      "time": "5 May 2009 — 10:25am",
      "content": "Kentlew, I have always been intrigued about who could buy the necessary Ruse weights to compose a book. Must be some publisher or big studio because Ruse is a bit expensive for the average freelance if you're going to use it only in special ocassions.  \nI don't think I'm wrong if I said that Teff are most expensive typefaces, but they look really good...\n\n"
    },
    {
      "time": "5 May 2009 — 7:33pm",
      "content": "Nick:\n\nDone. ;)\n\nFournier look so different in letterpress.\n\n"
    },
    {
      "time": "5 May 2009 — 8:26pm",
      "content": "My favourite?  \nThat is the hardest question ever heard.  \nBut, please look at this.  \nA page of \"The Book of Ruth\" printed 1904 by Alderbrink Press.  \nI find this blackletter very powerful!  \nIt is sad some have lost this spirit.\n\nMaximiliano R. Sproviero  \nLián Types.-\n\n ![](http://web.archive.org/web/20131020164943im_/http:/typophile.com/files/AlderbrinkBookOfRuth2_4690.jpg)\n\n"
    },
    {
      "time": "6 May 2009 — 10:09am",
      "content": "Maxi, that's great.  \n [ILC](http://web.archive.org/web/20131020164943/http:/ilovecolors.com.ar/)\n\n"
    },
    {
      "time": "6 May 2009 — 10:36am",
      "content": "Thanks. I consider that page a piece of art.  \nThough legibility may be at risk, its proportion, blackness  \nand minucious way it was made should never be forgot.  \nI think it is a must for typographers of nowadays to look up to, and follow, those presses, which, apart from printing/binding/designing wonderful books, used to design unique alphabets, with passion! always in order to look so elegant and hard to forget.\n\nVisit if you are interested: [www.elstonpress.com](http://web.archive.org/web/20131020164943/http:/www.elstonpress.com/ \"www.elstonpress.com\") or [www.bromer.com](http://web.archive.org/web/20131020164943/http:/www.bromer.com/ \"www.bromer.com\")\n\nBest,\n\nLián Types.-\n\n"
    },
    {
      "time": "6 May 2009 — 10:55am",
      "content": "Nice resources. Yeah, the T is pretty much illegible, but it makes up for a nice texture.  \nI'm more of the thinking that \"new technologies requires new typefaces\" but the spirit behind those compositions is surely something to remember and keep still in force.\n\n[ILC](http://web.archive.org/web/20131020164943/http:/ilovecolors.com.ar/)\n\n"
    },
    {
      "time": "7 May 2009 — 10:26am",
      "content": "\\> _Though legibility may be at risk,_\n\n\\> _Yeah, the T is pretty much illegible, but it makes up for a nice texture._\n\nI don't think it would be difficult to read for people at that time. Especially for people in countries where blackletter was used extensively at that time, like in Germany for example. If you are used to it, it's probably very legible.\n\n"
    },
    {
      "time": "7 May 2009 — 6:57pm",
      "content": "\\> \"I don’t think it would be difficult to read for people at that time\".\n\nThe \"reading times\", the way they used to read, were totally different than what they are nowadays.\n\nReading and calligraphy were considered religious acts. Every reader would take long hours in churchs and libraries reading, with the big \"In folio\" books, which were tied to the seat with a chain.\n\nThe aim of those calligraphers of medieval times, and of the PreRafaelist ideology followers (SXIX and part of SXX)  \nwas to generate a very dark black block on every page.  \nAlthough they were more used than we are, to read those pages, I bet they knew that if they looked at the page from a meter of distance the blackness would make the page illegible.\n\nI think the blackletter style is full of positive points, like the mystic spirit it has, but the risk of not achieving the communication it pretends is big.\n\nLián Types.-\n\n"
    },
    {
      "time": "8 May 2009 — 12:44am",
      "content": "Sanka... obviously:\n\n[http://www.fontalicious.com/super/sanka.html](http://web.archive.org/web/20131020164943/http:/www.fontalicious.com/super/sanka.html \"http://www.fontalicious.com/super/sanka.html\")\n\nMikey :-)\n\n"
    }
  ]
}
