{
  "id": "57542",
  "title": "measure twice, cut once",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i’ve been here on typophile for 8 weeks now!  \nthis is turning into quite a relationship, eh?\n\n\\*\\*\\*\n\nok, here’s a new question for all of you...\n\nfollowing an unspoken rule, printed books  \nalways use the same measure on every page.\n\nin an electronic-book, on the other hand,  \nthe measure can be set independently for  \neach page, according to the length of its  \nlongest line (or the second longest line)...\n\nso — just off the top of your head now —  \nwhat would you think of doing it that way?\n\nlater i’ll show you a book where it’s done,  \nso you can see what it actually looks like,  \nand make a judgment on the results, but  \nfor now, how does the \\_idea\\_ strike you?\n\n-bowerbird\n\n",
  "author": "<a href=\"/web/20090507185502/http://typophile.com/user/42797\" title=\"View user profile.\">bowerbird</a>",
  "time": "<br>",
  "uid": "42797",
  "comments": [
    {
      "time": " 30.Apr.2009 3.34pm",
      "content": "I recall noticing this in your earlier sample asking about loose justification and finding it extremely disconcerting. I didn’t bother to mention it at the time because it wasn’t the subject of your query.\n\n— Kent.\n\n"
    },
    {
      "time": " 30.Apr.2009 3.47pm",
      "content": "Bowerbird I just noticed that you are not using your real name in your registration. Unless you really do have a highly eccentric name. This isn’t the end of the world but it does tend to give your profile and certain questionable air. I encourage you to change this.\n\nAs to the idea, I don’t love it because I don’t really like justified text. I like ragged right far better, and particularly on a screen. There are all kinds of complex rendering related reasons for this. Still, I suppose I am open to having mind mind changed if I see something that impresses me.\n\n"
    },
    {
      "time": " 30.Apr.2009 4.28pm",
      "content": "kent said:  \n\\> and finding it extremely disconcerting\n\ncan you say why?\n\n\\*\\*\\*\n\neben said:  \n\\> because I don’t really like justified text\n\nin my e-book viewer-programs, people can  \npick ragged-right if they want, or justification.\n\nfor those who prefer and choose justification,  \nthere arises this question about the measure...\n\nit’s fully possible for me to let the user choose  \nwhether to use a specific or variable measure,  \nas well, so the question is “which is the default?”\n\nbut aside from user-choice as the trump card,  \ni wanted to see what the experts here think...\n\na variable measure will yield better spacing...\n\n-bowerbird\n\n"
    },
    {
      "time": " 1.May.2009 1.18pm",
      "content": "i guess nobody has any big objections,  \nwhich is a good thing for me to know...\n\n-bowerbird\n\n"
    },
    {
      "time": " 1.May.2009 1.54pm",
      "content": "_i guess nobody has any big objections_\n\n? What does “extremely disconcerting” mean to you?\n\n"
    },
    {
      "time": " 1.May.2009 2.32pm",
      "content": "_i guess nobody has any big objections,  \nwhich is a good thing for me to know..._\n\nDon’t mistake the lack of comments for lack of objections... It could also be lack of interest.\n\n"
    },
    {
      "time": " 1.May.2009 4.01pm",
      "content": "eliason said:  \n\\> What does “extremely disconcerting” mean to you?\n\nwhat matters is what it means to kent, and he didn’t explain,  \nso i have no information to go on. it might very well be that  \nany violation of an unwritten rule will make him feel that way.\n\nheck, i myself felt a bit queasy when i first thought of it, just  \nbecause it seems so unorthodox. but after a while, i decided  \nthat it wasn’t that big of a deal at all. of course, any time that  \nyou deviate from pure compulsiveness while laying out a book,  \ncosts must be paid. the question is whether benefits outweigh.  \nin this case, i think tighter lines outweigh the variable measure.  \nat least to the degree that i’m willing to extend the experiment.\n\n\\*\\*\\*\n\nricardo said:  \n\\> Don’t mistake the lack of comments for lack of objections...  \n\\> It could also be lack of interest.\n\ncertainly. but my experience here on typophile has been that  \nmany of you go out of their way to tell me your lack of interest.\n\nheck, ricardo, you did it just now...\n\nbesides, i just wanted to see if there was a mass of objections,  \nand learn the specific nature of whatever objections there are...  \ni think it’s pretty clear there is no mass. so even if the absence  \nis due to “lack of interest”, it continues to be meaningful to me.\n\n-bowerbird\n\n"
    },
    {
      "time": " 1.May.2009 6.35pm",
      "content": "_heck, ricardo, you did it just now..._\n\nNo, for once I was trying to... oh, never mind. Go on being as stubborn as you want to be, pal.\n\n"
    },
    {
      "time": " 1.May.2009 7.30pm",
      "content": "I have withheld comment on the bowerbird style, but the pretentious attempt at being a pedant and forced line breaks make my eyes bleed, my scroll finger cramp, and make me say “oh, never mind” also.\n\nSeriously bowerbird, you are going out of your way to make your posts more difficult to read than they need to be. If that’s your attempt, congratulations. If not... oh, never mind.\n\n"
    },
    {
      "time": " 2.May.2009 2.57am",
      "content": "@bowerbird: I object. To all.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 2.May.2009 4.05am",
      "content": "I meant that it was distracting and disruptive. Seemed like the worst of both worlds.\n\nJustification always leads to compromise in internal spacing. The reason one accepts such compromises — the payoff — is to have consistent, orderly margins and text blocks, relatively fixed from page to page. A fixed framework removes some of the external variables and allows focus to remain on the internal.\n\nFlush-left/ragged-right exchanges the priority, preferring internal consistency in spacing, and accepting a variable margin.\n\nYour sample had highly variable internal spacing married with constantly changing external margins. The changing margin was actually made more noticeable by the hard line of the alignment.\n\nI can imagine a changing measure working acceptably if the range of variation was kept quite small, so as to be essentially unnoticeable. But I’m not sure you’d gain anything by it.\n\n"
    },
    {
      "time": " 2.May.2009 7.58am",
      "content": "kent lew said:  \n\\> I can imagine a changing measure working  \n\\> acceptably if the range of variation was kept  \n\\> quite small, so as to be essentially unnoticeable.  \n\\> But I’m not sure you’d gain anything by it.\n\nwell, in an e-book, any change in variation will be  \n“noticeable”, because of the end-user’s ability to  \nrapidly thumb through the exactly-placed pages.  \nit’s quite easy to actually see the margins shifting.\n\nin a p-book, the normal vagaries of printing will  \nmake any such variation be much less noticeable,  \nsince the margins will be less exact to begin with,  \nand the inability to compare pages directly means  \nchanges in the margins would be harder to detect.\n\nbut e-books is what i’m interested in...\n\n\\> Your sample had highly variable internal spacing\n\nyou will remember that that was due in large part  \nto the nature of that experiment, which was to test  \nif justification could be done without hyphenation.\n\nif i’d used hyphenation with a variable measure,  \nthe “compromise” you talked about will not only  \nnot be as bad as usual, it will actually be better,  \nbecause most lines are not stretched as much...\n\nbut that’s really beside the point, because my aim  \nwas to see whether those three factors together —  \njustification-on, hyphenation-off, variable-measure  \n— would balance out. so your conclusion that it is  \n“the worst of both worlds” is directly relevant to me,  \nand i thank you so much for sharing your impression.\n\nit’s kinda hard to have a conversation amidst all this  \nhyperventilation, isn’t it? thanks for being on-topic.\n\n-bowerbird\n\n"
    },
    {
      "time": " 2.May.2009 11.29am",
      "content": "bowerbird,\n\nThe forced line-breaks made me think my browser was malfunctioning. And I have to agree with Sorkin. It _is_ a convention to use your real name here. When I first started, I too used a handle. Someone made a similar comment to me, so I changed it to my real name. In fact, I think I contacted [Tiffany Wardle de Sousa](http://web.archive.org/web/20090507185502/http:/typophile.com/user/108) directly, and she changed it within the hour. It’s also possible to keep your username and just add your real name to [your profile](http://web.archive.org/web/20090507185502/http:/typophile.com/user/42797). Immediately after doing this I got more and better responses to my questions and feedback. I strongly encourage you to do the same.\n\n"
    },
    {
      "time": " 4.May.2009 2.01am",
      "content": "Yawn.\n\nNick Cooke\n\n"
    },
    {
      "time": " 6.May.2009 12.59am",
      "content": "nick said:  \n\\> yawn.\n\nthanks for your contribution, nick.\n\n-bowerbird\n\np.s. where’s hrant when you need him?\n\n"
    },
    {
      "time": " 6.May.2009 8.27am",
      "content": "Yo\\_u\n\n’re\\_wel\n\nc\n\nome.\n\nNick Cooke\n\n"
    },
    {
      "time": " 6.May.2009 12.15pm",
      "content": "nick-\n\nwhy did you split your words across lines?\n\nand what do those underscores mean?\n\n-bowerbird\n\n"
    }
  ]
}
