{
  "id": "57540",
  "title": "Writing an EULA",
  "forum": "Eli's blog",
  "tags": [

  ],
  "content": "Hello friends!  \nI'm writing an **EULA** to distribute my typefaces through _MyFonts._  \nI have a lot of doubts and I hope you can help me with some of these points:  \nWhich points should I consider to start writing an EULA?  \nI know an _EULA_ is the way the foundry conceive the permission to use its fonts and I just want to protect my work as much as possible from piracy.  \nCan I submit an EULA, for example, to distribute my typefaces via _MyFonts_ and update it after a while?  \nWhat's the difference between selling fonts to 1-5 cpus or individually? I just want to know some advantages and disadvantages of these options.  \nDoes it make any sense to prohibit copying font files to a store device or sending them by email?  \nIs it convenient to allow font embeding for websites?  \nHow can I protect my typefaces from piracy if I allow font embeding for websites?  \nThanks in advance and sorry for my english.\n\n",
  "author": "Eli",
  "time": "30 Apr 2009 — 9:22am",
  "uid": "16579",
  "comments": [
    {
      "time": "30 Apr 2009 — 1:02pm",
      "content": "\"I just want to protect my work as much as possible from piracy\"\n\nA EULA has pretty much nothing to do with preventing 'piracy'. Those folks really don't care what's in the EULA.\n\nThe EULA is an agreement between you and your paying customers.\n\n"
    },
    {
      "time": "30 Apr 2009 — 1:51pm",
      "content": "The EULA is a license agreement, you make the rules for this license. You can make it as complex or simple as you like, as long as it's fair for both parties.  \nSelling fonts for 1-5 cpus, is that you can install it on 5 cpus, so 5 people can use the font at ones. Individually; only one person can use it on one cpu. Fonts for 1 cpu (1 person) are mostly cheaper than for 1-5 cpus.\n\n<cite>Does it make any sense to prohibit copying font files to a store device or sending them by email?</cite>\n\nTransactions will go slower if you only prohibit sending the fonts by email.\n\nPreventing piracy is very difficult, you can better make a good EULA, after that you can always take legal steps if you find someone is abusing your work.\n\nRudy\n\n"
    },
    {
      "time": "30 Apr 2009 — 2:00pm",
      "content": "I agree with both.\n\n- Most people who license your fonts, even single work-at-home freelancers have more than one computer. It really is more user-friendly to at least allow for 5 computers.  \n- Web embedding is the new frontier. I think foundries should allow for embedding in Flash (SIFR) but understand if they don't want to allow for @Font-Face because it is not protected.  \n- Consider allowing for PDF Print & Preview embedding as well as, and at least, distribution to clients and press houses.\n\nHere is [another useful thread](http://web.archive.org/web/20131013130642/http:/typophile.com/node/28852) about EULAs here on Typophile.\n\n"
    },
    {
      "time": "30 Apr 2009 — 2:00pm",
      "content": "Just to throw out some things to think about if you're going the EULA route...\n\nAs a designer, I'd love it if you licensed the font per users, rather than per CPU. I'm one user, but I own 2 computers and use them both. I'd love a license that allowed me to use the purchased font on computers I own.\n\nSo, one way to think about it might be a user license vs. small studio license vs. corporate license.\n\n"
    },
    {
      "time": "30 Apr 2009 — 2:30pm",
      "content": "Yes, you know I meant to say as Darrel said, by user not computer.\n\n"
    },
    {
      "time": "30 Apr 2009 — 7:54pm",
      "content": "I think SIFR embeding is not a threat for typeface designers and I´m agree with this permission but to store a font in a server is very risky, I found an interesting article about web fonts at [http://talleming.com/2009/04/21/web-fonts/](http://web.archive.org/web/20131013130642/http:/talleming.com/2009/04/21/web-fonts/ \"http://talleming.com/2009/04/21/web-fonts/\") Thanks for your help.\n\n"
    }
  ]
}
