{
  "id": "57562",
  "title": "Proportional Oldstyle: An anachronism, but quite nice",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "From the .pdf of the Modern Suite:\n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/Picture1_4279.png)\n\nThus saith Nick Shinn.\n\n@Nick  \nWere you meaning that as in \"Boy, those proportional oldstyles, they sure are old-fashioned. But they look pretty.\"\n\nor\n\n\"The Scotch Modern didn't originally have proportional oldstyle figures, but I figured, 'what the hey, I like them, so why not'\"?\n\n",
  "author": "Dan Gayle",
  "time": "1 May 2009 — 12:23am",
  "uid": "12948",
  "comments": [
    {
      "time": "1 May 2009 — 9:56am",
      "content": "Scotch Modern is a close revival of a \"Modern\" (Didone) face of the 19th century.  \nSuch faces never had oldstyle figures, then or until now, AFAIK.  \nTherefore it is anachronistic, not to mention ironic, to include oldstyle figures in a modern face!\n\nHowever, Adobe made me do it.  \nBy including \"Proportional Oldstyle\" and \"Tabular Oldstyle\" as non-bracketed options in the InDesign OpenType menu, it appears that there is an error in OpenType fonts that don't have oldstyle figures. (This is strange, not to mention ironic, as Adobe's own Trajan is without OSF.)  \nTherefore, to avoid looking like there is a mistake in the typeface, I decided to produce oldstyle modern figures for Scotch Modern. Or perhaps they are modern oldstyle figures. Other than massaging the proportions, the only structural change from the lining figures is the removal of the foot serifs on 4.\n\nAt any rate, they work surprisingly well, and are quite interesting. In fact, Michaël Amzalag uses them pointedly, and copiously, in his _Interview_ redesign, e.g.--\n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/Interview_contents_3572.jpg)\n\n"
    },
    {
      "time": "1 May 2009 — 10:16am",
      "content": "Very nice.\n\n\\>\\>Such faces never had oldstyle figures, then or until now, AFAIK.\n\nFrutiger's Didot has them, ditto ITC Bodoni.\n\nMaybe they are anachronisms also?\n\n"
    },
    {
      "time": "1 May 2009 — 10:41am",
      "content": "Right. The first modern faces, by Didot and Bodoni, had oldstyle figures. But the subsequent evolution, the Scotch Modern, did not.\n\n"
    },
    {
      "time": "1 May 2009 — 10:47am",
      "content": "Ah. They were a skoosh earlier. Your specimens came from ca. 1830s?\n\n"
    },
    {
      "time": "1 May 2009 — 11:52am",
      "content": "My Scotch Modern is based on an American type of the 1860s.\n\nJohn Bell was showing lining figures in the 1780s.\n\nI haven't made a thorough study of this, but from the early 19th century periodicals, books, and specimens that I have seen, it looks like oldstyle figures became extinct in the UK by 1830 or earlier, but lasted longer on the continent.\n\n"
    },
    {
      "time": "2 May 2009 — 6:23am",
      "content": "ok, so to be honest, when i first saw Scotch Mondern it did nothing for me. yes it was nice looking, but for some reason i've never been attracted to the didones or bononi's and related types.\n\nbut, i'm thinking i might have to give this typeface a try and it's looks just wonderful!\n\ni think the thing about these fonts that scares me is the extreme contrast, i have serious boubts about my ability to use them well.\n\ni guess the only way to learn if to just jump in...\n\nthanks nick for these beautiful faces!\n\n:-)\n\n"
    },
    {
      "time": "2 May 2009 — 9:40am",
      "content": "Simon, when did Australian printing kick up in earnest? I'm guessing that it must have been somewhere in the mid-1800s, right? With imported type? Depending on the dates, you might be able to find plenty of neat locals things printed in faces like this. Perhaps that might give you a hint as to how you might use fonts inspired by it today…\n\n"
    },
    {
      "time": "2 May 2009 — 10:34am",
      "content": "<cite>i think the thing about these fonts that scares me is the extreme contrast, i have serious boubts about my ability to use them well.</cite>\n\nDon’t let the rubbish from type textbooks scare you away from using high-contrast types. As Nick likes to point out, such types were the most popular types in use during the time when widespread literacy came into being, and they don’t seem to have held readers back. And back then they were being printed at smaller sizes, on crap paper, and often read under lighting conditions we would consider abominable. There’s no reason that a well-used transitional or modern face cannot be every bit as readable as an aldine, and the pedants who insist otherwise should be treated with suspicion. A few days ago I examined one of Baskerville’s original printings of Paradise Lost, and I assure you it is more readable (long s usage aside) than some of the best versions being printed today!\n\n"
    },
    {
      "time": "2 May 2009 — 12:25pm",
      "content": "\\>_they don’t seem to have held readers back. And back then they were being printed at smaller sizes, on crap paper, and often read under lighting conditions we would consider abominable_\n\nWell… back then, there was ink spread, since the pages were still being printed from metal type. Nick's fonts asde, many digital Didones are not optimised successfully for text. And it does not matter what your abilities as a type setter are… if the font isn't going to cut it, you aren't going to be able to pull off legible text with it. Every typeface has to be judged on its own merits. Styles are genres are only going to help you so far along when it comes to knowing what to do with a font.\n\n"
    },
    {
      "time": "3 May 2009 — 5:37pm",
      "content": "Thanks guys!\n\n@dan - i think you're right about the printing, but i haven't seen a lot of these types from that era, most stuff i've seen is from early 1900's.\n\n@james - thanks for encouragement!\n\n"
    },
    {
      "time": "3 May 2009 — 6:06pm",
      "content": "Since we don't live in the 19th Century anymore, I see no reason to rigorously abide by the traditions of that time (unless you are the kind who MUST). Go ahead and make oldstyle figures as part of any typeface that you feel would benefit from it. Until recently, sans were not accompanied by true italics but now it is the norm. Fire away and check your targets later--you may find you have hit a few bulls-eyes there :-)\n\nChrisL\n\n"
    },
    {
      "time": "3 May 2009 — 6:40pm",
      "content": "ok, i bit the bullet and have purchased a license for the roman and italic of scotch modern. now to see if i'm man enough to handle it...\n\n"
    },
    {
      "time": "3 May 2009 — 8:15pm",
      "content": "\"You can Handle, the truth\" :-)\n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/afewgoodmenjacktruth_4846.JPG)\n\nChrisL\n\n"
    },
    {
      "time": "3 May 2009 — 9:14pm",
      "content": ":-) thanks chris!\n\n"
    },
    {
      "time": "3 May 2009 — 9:48pm",
      "content": "<cite>Go ahead and make oldstyle figures as part of any typeface that you feel would benefit from it.</cite>\n\nThat’s certainly not a bad idea, but people should also be very careful about considering whether or not the proportions of a typeface lend themselves to old style figures—some of them just don’t.\n\n"
    },
    {
      "time": "3 May 2009 — 11:26pm",
      "content": "_...some of them just don’t._\n\nExamples please.\n\n"
    },
    {
      "time": "4 May 2009 — 6:03am",
      "content": "i showed a teacher at uni my new purchase and he mentioned ITC Century which i had not heard of, is that a scotch modern also? sorry if i'm missing the obvious.\n\n[http://new.myfonts.com/fonts/ef/itc-century/](http://web.archive.org/web/20120623052259/http:/new.myfonts.com/fonts/ef/itc-century/ \"http://new.myfonts.com/fonts/ef/itc-century/\")\n\n"
    },
    {
      "time": "4 May 2009 — 7:36am",
      "content": "Century evidently has some Scotch ancestry, but it is lower contrast.\n\nI disagree with you, James, that high contrast is equally readable in text. I really think it is objectively a problem. I can't prove it, but that's what my eyes have told me all my life.\n\nI do agree, though, about the old style numerals. Nick, in the discussion about ITC Franklin, James argued that old style numerals won't work well with faces with very short extenders, including ITC Franklin.\n\n"
    },
    {
      "time": "4 May 2009 — 7:46am",
      "content": "Anything from ITC in the 80s had short decencders and acsenders. It was their xheight über ales era.  \nWhat I said was, \"any typeface that you feel would benefit from it.\" Conversly...\n\nChrisL\n\n"
    },
    {
      "time": "4 May 2009 — 7:59am",
      "content": "\"xheight über alles\"\n\nLOL chris :-) that would make a great t-shirt!\n\ncheerio Queneau\n\n"
    },
    {
      "time": "4 May 2009 — 8:52am",
      "content": "Thanks, Queneau!\n\nChrisL\n\n"
    },
    {
      "time": "4 May 2009 — 11:23am",
      "content": "_...objectively a problem...what my eyes have told me all my life._\n\nYou're contradicting yourself.\n\nHowever, I have had the same view of high contrast faces, having tried various fonts in text settings from the 1970s on (for offset printed work), and always been disappointed with the results, in comparison with letterpress examples.\n\nI surmised that the genre is not ideally suited to offset, and also that the phototype and digital fonts available were lacking.  \nSo I thought I'd have a go, hence Scotch Modern. Even if I have been successful, it is still a difficult genre to use for typographers, as optical size, paper stock and ink gain are so critical. Added to which is the prejudice which exists against it.\n\n"
    },
    {
      "time": "4 May 2009 — 12:01pm",
      "content": "Nick I don't think I'm contradicting myself. My eyes say that high contrast is a problem. I can't prove it, but I think it's objective, in the sense that it's a problem for our visual apparatus to read high contrast text at small sizes.\n\nLetter press has a built-in minimum for thins, and so has a kind of built-in optical adjustment, so you may be right that they worked significantly better as letter press.\n\nMy prejudice against them for text arose when I was a student in high school and college in the early '60s, when almost all science books were in high contrast modern faces, on slick paper. [They had bigger character sets for math, I'm guessing.]\n\nThey have a lot of flavor in display, and yours captures that well.\n\nWith less contrast, they can work in text, though they are still not my favorite, though that, I admit, is subjective.\n\n"
    },
    {
      "time": "4 May 2009 — 12:12pm",
      "content": "<cite>Well… back then, there was ink spread, since the pages were still being printed from metal type.</cite>\n\nI’ve got old textbooks with hairlines that compete with contemporary display type. If anything, we’re better off with some of the current designs, which probably get far more testing and revision than was possible with metal.\n\nNick is right, though, that stock and ink gain are critical. But I think that these things are critical for most projects anyway, so with some testing, it should be possible to make a modern face work—or find out that it won’t, before going to press.\n\n"
    },
    {
      "time": "4 May 2009 — 12:27pm",
      "content": "\\> probably get far more testing and revision than was possible with metal.\n\nI kind of doubt that. I don't know how foundries worked in the 19th century, but in the 20th you had huge drawing offices, proofing in print, and masters like Chauncy Griffith vetting everything.\n\n"
    },
    {
      "time": "4 May 2009 — 2:20pm",
      "content": "_I don’t think I’m contradicting myself._\n\nBill, you offered your own experience, which is by definition subjective, as an argument against the idea that high contrast types are in general \"equally readable\".\n\nThe problem with high contrast types is not the contrast per se, but rather it's the too slight image of fine details, in particular serifs, in offset printing. So one might say that the difficulty in offset is actually the **low** contrast between paper and fine details. This is not an issue in letterpress, because even the slightest of serifs are substantial enough: on uncoated stock there is sufficient press gain, and on coated stock there is the bite of type into the paper, creating a crisp dimensional image.\n\n"
    },
    {
      "time": "4 May 2009 — 2:45pm",
      "content": "I always thought that one of the major issues with modern style type was the stress axis. I know it's the first thing I notice when I look at a page set in Bodoni, for instance. The high contrast certainly highlights that axis as well.\n\n"
    },
    {
      "time": "4 May 2009 — 5:15pm",
      "content": "The stress axis bothers you less if you see it more.\n\nChrisL\n\n"
    },
    {
      "time": "4 May 2009 — 9:58pm",
      "content": "On axis, I do think that higher contrast is less of a problem in old style type, such as Times New Roman, where the thins are more on the diagonal.\n\nOn objectivity, I am not basing myself only on my eyes, but also history. The high contrast types of the 19th century went into eclipse. I believe that almost all popular text faces now have lower contrast than things like Bodoni, Didot, and the 19th century Scotch romans. I haven't studied the 19th century stuff in letter press, so I may be wrong, but my impression is that things like Century, Miller Text, and Chronicle all have lower contrast than the 19th century stuff. I suspect that this history indicates an underlying reality about the physiology and psychology of how we read. So I don't think the \"prejudice\" is just prejudice, but rather a well founded belief that such high contrast, vertical stress stuff is a problem for the eye in extended text.\n\n"
    },
    {
      "time": "4 May 2009 — 10:24pm",
      "content": "Bill: _I suspect that this history indicates an underlying reality about the physiology and psychology of how we read._\n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/Women_s_Shoes_5754.jpg)\n\n"
    },
    {
      "time": "5 May 2009 — 7:13am",
      "content": "People generally acknowledge high heels are bad for the health of women's feet and harder to walk in. Do you deny that as well? All shoes are equally good for every purpose? If a woman wants to go on a 20 mile hike, those high heels you show are just as good as hiking boots? The same shoe design for the ball and for the hike?\n\n"
    },
    {
      "time": "5 May 2009 — 8:42am",
      "content": "_On objectivity, I am not basing myself only on my eyes, but also history. The high contrast types of the 19th century went into eclipse._\n\nSuppose you lived during the height of high-contrast didones. Wouldn't you then be able to make the argument that history has proven their superiority, since the low contrast types of the 17th-18th centuries have gone into eclipse?\n\n"
    },
    {
      "time": "5 May 2009 — 8:44am",
      "content": "Yes you would, but should you?\n\n"
    },
    {
      "time": "5 May 2009 — 9:41am",
      "content": "BIll, you argued that the the latest and most popular version of a cultural artefact, book type, is therefore better fitted to human physiology. Would you argue that for another cultural artefact, shoes?\n\nFlawed, dysfunctional products can become well entrenched for all kinds of reason. Success is no measure of virtue.\n\nAnd as Craig notes, if time and progress improve type, how come the preferred book type went from garalde to didone and then back again to garalde?\n\n"
    },
    {
      "time": "5 May 2009 — 10:43am",
      "content": "\\>how come the preferred book type went from garalde to didone and then back again to garalde?\n\nBecause fashion ruled for a time, but practicality--in this case readability--won out in the longer run.\n\n"
    },
    {
      "time": "5 May 2009 — 1:42pm",
      "content": "And mass literacy emerged and people lapped up Dickens _in spite of_ the high contrast type in which it was set?  \nNot to mention the lack of leading: didn't anybody figure out that was bad for readability?\n\nAren't you dismissing something that doesn't fit your prejudices of readability as mere fashion?  \nIt's hard to believe that something so supposedly impractical could be so predominant for so long, around the world (and in Cyrillic too).\n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/DickensTwist_4448.jpg)\n  \nThis is from _Bentley's Miscellany_, Nov. 1, 1837, the magazine in which _Oliver Twist_ was first published, in serial form.  \nThe size is small pica (approx. 11/11).  \n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/DickensCU_3991.jpg)\n\n"
    },
    {
      "time": "5 May 2009 — 4:58pm",
      "content": "Nick, those aren't bad. In your blow up of the pica, most of the thins are ok, so the overall contrast I wouldn't complain about so much. I have, however, seen others from the 19th century are much worse. As I said my complaint is high contrast with vertical stress, and this, as printed isn't such high contrast.\n\nAs to the tight leading, I think that people today have a fashion of thinking that huge leading contributes to readability, less so than it actually does.\n\nSo you see my views aren't just a matter of going along with what's happening today.\n\n\\>Aren’t you dismissing something that doesn’t fit your prejudices of readability as mere fashion?\n\nNo, I'm not dismissing anything. I'm expressing a well considered opinion, which may none the less be wrong, that vertical stress with high contrast is less readable in extended text. And judging by what most folks have done in designing fonts and setting text for over a hundred years, most agree with me.\n\n"
    },
    {
      "time": "5 May 2009 — 6:19pm",
      "content": "Feel free to refer me to the ID section, but since it was raised here: does anyone know what Michaël Amzalag is using in <cite>Interview</cite> for body copy?\n\n"
    },
    {
      "time": "5 May 2009 — 7:11pm",
      "content": "Nick, one of the results of having an interest in the English Catholic revival is that I've read quite a few books in 19th century editions set in Scotch types, often at ludicrously small sizes, and with little leading, and with huge gaping spaces at the end of every sentence. Are they hard to read? Well, no, not really, once you get into them, but on the other hand I don't think they're as easy to read as most 20th century publishing using lower contrast types based on renaissance models.\n\n"
    },
    {
      "time": "5 May 2009 — 8:57pm",
      "content": "_And judging by what most folks have done in designing fonts and setting text for over a hundred years, most agree with me._\n\nI don't think that's true.  \nSure, there was a revival of old-style types starting in the 1890s, but it took a long time for the Modern faces to be eclipsed.\n\nI just had a look at a couple of Linotype catalogs, 1923 and 1958, and most of the typefaces in them are high contrast with vertical stress -- including those named Old Style!\n\nPick any year in the 1950s or 60s and check the text type of the large circulation American magazines--you'll have a hard job finding anything that isn't high contrast and vertically stressed.\n\nEven in news type, following the introduction of the Legibility Series in the 1920s, one still finds the old numbered Moderns being well used in the 1950s and 60s.\n\n"
    },
    {
      "time": "6 May 2009 — 8:43am",
      "content": "There was a revival of oldstyles, but it when was it really that there were any decent ones in general use? The Doves press was nice, I guess, but very low in use. Caslon never really disappeared, but the others didn't come into use until almost the Depression\n\nGoudy's Garamont ~ 1920  \nBembo ~ 1929  \nCentaur ~ 1914/1929\n\nUnless I'm way off base on my history, of course\n\n"
    },
    {
      "time": "6 May 2009 — 9:51am",
      "content": "IMO, the \"killer\" oldstyle was Goudy's Kennerley of 1911, which was instantly huge, and widely used for at least 20 years.  \nTo be followed by many other Goudy oldstyles.\n\nFrom ATF and Benton, as Dan says, Centaur, but also Garamond (1919)  \nFrom Monotype: Imprint, Plantin, Caslon (recut) in the 'teens.\n\nI don't know about continental European types.\n\nCheltenham was extremely popular in many countries--would that be classified as an old style?!\n\n"
    },
    {
      "time": "6 May 2009 — 10:48am",
      "content": "Which came 1st? the readability or the popularity? (chicken egg).\n\nChrisL\n\n"
    },
    {
      "time": "6 May 2009 — 10:56am",
      "content": "What is the saying? What is read most is read best? Or something like that? Blackletter was \"readable\", but not anymore. Perhaps Moderns were perfectly readable too.\n\nPerhaps it is that oldstyles just happen to be among the first of typefaces, read by everyone first and thus readable by everyone first.\n\n"
    },
    {
      "time": "6 May 2009 — 10:59am",
      "content": "Caslon was first revived in 1844 with \"Lady Willoughby's Diary\", with the original matrices, I think. It caused something of a stir because it was so much more readable than the 'Moderns' that were then fashionable :) Updike, who admittedly was a Caslon fanatic, said the revival was \"The typographic event of the mid-nineteenth century\".\n\nFollowing this, foundries gradually issued a lot of typefaces called 'old style' based on Caslon, but with larger x-heights and I believe also less contrast. According to Mac McGrew's book, Bruce Old Style originated in 1869, Binny Old Style around 1863, and Bookman Old Style originates in 1860. Caslon itself was revived in the US supposedly from English electroplates at about the same time, also under the name 'Old Style'. Later in the century they put the name Caslon back on it, and with hot metal type every foundry had versions of both Caslon and \"Old Style\", often with shortened descenders. One of the most refined of the higher x-height revivals was Imprint, which I think you can still see used occasionally.\n\nI don't know, but I would guess from the 1860s on you will see a lot of 'old styles' in print. The peak of the craze for Caslon was probably 1900 to 1925. After the Bembo and Garamond were revived, it lost some of its mystique as there were other good and refined old style revivals available, as well as the new stuff from Goudy, which was very popular also in the US. Today I sense we are about due for a new Caslon craze :)\n\nBy the way, I think the Scotch style, such as Nick has revived, in my eyes was never as problematic in text as the real Didones, which have more starved horizontals.\n\n"
    },
    {
      "time": "6 May 2009 — 11:35am",
      "content": "_It caused something of a stir because it was so much more readable than the ’Moderns’ that were then fashionable :) Updike, who admittedly was a Caslon fanatic, said the revival was “The typographic event of the mid-nineteenth century”._\n\nLady Willoughby's Diary was influential, but the idea that it was \"so much more readable\" is a non sequitur.  \nIn fact, the revival was found wanting, and what grew out of it and did become popular, the Miller and Richard \"Old Style\" was, to all intents and purposes, a modern face, with high contrast and vertical stress! The same is true of the other \"Old Styles\" you mention.  \nSo don't be mislead by the term \"Old Style\" as it was used prior to the more authentic revivalism of the 20th century, that was sparked by Morris' work in the late 1890s.\n\nUpdike was extremely prejudiced against the trade typography of the 19th century, omitting it from his history (e.g. he shows no sans), so hardly a reliable source as to what was significant then.\n\n"
    },
    {
      "time": "6 May 2009 — 11:34am",
      "content": "_...the real Didones..._\n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/Didot_6414.jpg)\n  \n...were not \"starved of horizontals\", although one may get that impression from present day digital interpretations. \n"
    },
    {
      "time": "6 May 2009 — 1:25pm",
      "content": "Nick, unlike your scan of Scotch, I find that Didot pretty bad as far as readability. The weight of the stem in the Scotch is carried much further into the top arch, compared to Didot and Bodoni, where the horizontal arch is thinner throughout.\n\nThe result to my eyes is that there is a lot of shimmer from the 'picket fence' effect in your scan, because the heavy verticals are so dominant.\n\nAs far as the Old Style of Miller and Richard, here's what Jaspert's encyclopedia says: \"The stress is vertical, but though not abruptly so. Note the curves of the c, e, and p.\"\n\nRemember that Caslon's o has a vertical stress, as well as some of his caps in many sizes. The c, e, and p have a slight old style stress in the Monotype version of Old Style that Jaspert shows.\n\nBut the important point in that note is \"not abruptly so\". The gentler modulation is the main thing they took from Caslon, and with it lower contrast. Judging by the many later versions of Old Style, you are mistaken in saying that Phemister's original Old Style for Miller & Richard has high contrast. In fact, the low contrast and big x-height is overdone, in my opinion, in the \"Old Style\", though it is very readable. (I don't have a sample of the original Miller & Richard type.) My problem with the Old Style is an aesthetic one, namely that it is rather dull looking--something that certainly can't be said of the Scotches, including your revival.\n\nI never said that vertical stress was a problem in itself. There are great text faces with vertical stress, like Caledonia--a modified Scotch. What I do think is that those with vertical stress are less tolerant of higher contrast--you can push diagonal contrast a little more without getting into trouble.\n\nAnd in any case text type needs lower contrast, lower than in your scanned example immediately above, IMHO. Note that this issue also is not simply absolute thinness of the thins, but also how bold the stems are in relation to them. Here in your Didot scan the result is exactly the thing I have problems with in text. It is beautiful in display, but that is another story.\n\n"
    },
    {
      "time": "6 May 2009 — 3:55pm",
      "content": " ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/DidotCU_3561.jpg)\n  \nYou're right, the heavy verticals here do dominate.  \nI don't think the problem is in the \"important\" part of the letters, such as across the top of \"n\". It's more that the serifs and terminals are weak--and that's where the Scotch beefed up the Modern style, with long serifs and big ball terminals.  \nIf the serifs and terminals are strong, then I don't think the abruptness of the transition from thin to thick is an issue. Example of a Scotch Modern, 1872:  \n.  \n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/Sunday2_5133.jpg)\n\n\\*\\*\n\nBill: _Judging by the many later versions of Old Style, you are mistaken in saying that Phemister’s original Old Style for Miller & Richard has high contrast._\n\nIt depends how you define \"high contrast\".  \nI certainly get the impression of high contrast from this Victorian oldstyle (below, from the same magazine as the previous sample), looking at the hairline thickness of the crossbar in \"a\", horizontal strokes of \"b\" and \"d\", and the thin strokes of \"w\" and \"y\", but at the same time there is much less contrast in \"e\", \"h\" and \"n\" and across the top of \"a\".\n\n ![](http://web.archive.org/web/20120623052259im_/http:/typophile.com/files/Sunday1_3487.jpg)\n\n"
    },
    {
      "time": "6 May 2009 — 4:32pm",
      "content": "Thanks for those wonderfully revealing scans, Nick. There's a lot of food for thought there. I'll think about it post tomorrow...\n\n"
    }
  ]
}
