{
  "id": "57600",
  "title": "Technology's effect on type?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Beyond its use as a tool, has the computer affected type design?\n\nIn the process of researching a paper on the New Typography and its claims of correspondence to the world, i’ve been struck by the importance of photography to the movement. Not only have i run into accounts of design history that basically disregard anything that happened between Gutenberg and Niépce/Daguerre as unimportant, but photography is identified as a perfect match for the New Typography given its objectivity, clarity, and lack of individualism. Whether these characteristics are applicable, it’s clear that the ways in which photography affected worldviews in the late 19th and early 20th centuries had an effect on this particular theory of type design.\n\nIt’s got me wondering what sorts of effects computers have had upon type design. Not being a designer myself, i’m curious if folks have an opinion on this. Particularly if there are characteristics of the computer (such as its reliance on numbers and patterns, its use in networks, its close ties to scientificity...) that have had an effect on (your or other) design in recent decades.\n\n",
  "author": "<a href=\"/web/20090506030442/http://typophile.com/user/44265\" title=\"View user profile.\">k.brideau</a>",
  "time": "<br>",
  "uid": "44265",
  "comments": [
    {
      "time": " 2.May.2009 9.40am",
      "content": "Computers have had a rather dramatic impact on typography. Read Poyners [No More Rules](http://web.archive.org/%20Graphic%20Design%20and%20Postmodernism) to see an evolution of graphic design after the designers started doing the layouts and type themselves.\n\n"
    },
    {
      "time": " 2.May.2009 10.33am",
      "content": "Is water wet?\n\n"
    },
    {
      "time": " 2.May.2009 10.46am",
      "content": "Can you cite the paper?\n\n"
    },
    {
      "time": " 2.May.2009 11.18am",
      "content": "I’m thinking my question wasn’t stated clearly enough. It’s not whether the computer has had an effect on type; of course as a tool for design the computer has had an effect (water is indeed wet). What i’m getting at is a question about the philosophies of design in practice today. Does the computer as a cultural/social/scientific/... phenomenon affect the ways in which designers approach design at a conceptual level. Does it affect ideas concerning what typography is for; what a good design is; what the relation between form and function ought to be? And if so, what sorts of effects has it had?\n\nJames, thanks for the recommendation.\n\nChristopher, the paper i refer to is one that i’m in the process of writing, so can’t be cited.\n\n"
    },
    {
      "time": " 2.May.2009 11.40am",
      "content": "One of the reasons this thread isn’t getting much play is that question is huge. Really broad questions are hard to answer well.\n\nAlso nobody has time to write your paper for you.\n\nAlso I think that you will find that any kind of broad brush aesthetic relationship that you might theorize will be shot to pieces by the reality. The impact of on type/printing has not been to advantage one aesthetic as might be imagined but on specific technical aspects, the cultural, jobs, roles, etc and will require looking at printed things talking to people and observing things from there. Some things to begin looking at are font availability, methods of printing, printing costs, availability of letter making tools and well - that is maybe enough for now.\n\nMy advice is read and think more, maybe ask some older folks what happened to them and return with much much narrower questions.\n\n"
    },
    {
      "time": " 2.May.2009 12.14pm",
      "content": "_...what sorts of effects has it had?_\n\nNot only is water wet, you can swim in it, skate on it, add it to Scotch, listen to the ocean’s roar, mop the floor, heat by steam, be moved to tears, turn on the rear window wiper, shoot Niagara Falls by barrel or camera, &c, &c.\n\nWhat sort of effects hasn’t the computer had?\n\nSomething I wrote in 2001 about the effects of digitization on the design profession:  \n [http://www.shinntype.com/Writing/BottLine.pdf](http://web.archive.org/web/20090506030442/http:/www.shinntype.com/Writing/BottLine.pdf \"http://www.shinntype.com/Writing/BottLine.pdf\")\n\nRecently, continuing that thought, I’ve come to realize that the defining characteristic of a career in design is not the work one does, but dealing with tools that change constantly, designers being always at the mercy of technological progress. No doubt it’s true that for many professions one needs to be up to date with the latest technology in order to work, but it seems to be particularly so for graphic design.\n\n"
    },
    {
      "time": " 2.May.2009 8.16pm",
      "content": "For me, the most important thing is that, back in the day, if a someone designed a new font, it would take a long time to be able to test it, let alone see how it would look in different sizes. And after the font was ready, if someone was willing to publish it, it would take a titanic amount of work (and costs!) to make it available for use.\n\nToday you can design everything by yourself, test it quickly in a lot of different ways, and make it available for the entire world in the blink of an eye - without having to cast tons of metal to make your font usable.\n\nThis faster and cheaper way of working with type design allows much more experimentation, and what we see today is that instead of just slightly redesigning a previously available font, type designers are free to create whatever they want and see how it comes out.\n\nBy the other hand, this is misleading people to think that all you need to design a font is a Mac and some spare time... no need to study or read anything... :|\n\n"
    },
    {
      "time": " 2.May.2009 10.45pm",
      "content": "“Today you can design everything by yourself, test it quickly in a lot of different ways, and make it available for the entire world in the blink of an eye - without having to cast tons of metal to make your font usable.”\n\nI would hardly say a typeface can be designed in a blink of an eye. It takes much more work than you think—but yes, there is no manufacturing that needs to take place after the design is completed. Once completed, posting it on the web for sale is quick compared to previous technologies.\n\nChrisL\n\n"
    },
    {
      "time": " 3.May.2009 2.16am",
      "content": "Read this as well: [http://typophile.com/node/14636](http://web.archive.org/web/20090506030442/http:/typophile.com/node/14636 \"http://typophile.com/node/14636\")?\n\n"
    },
    {
      "time": " 3.May.2009 5.58am",
      "content": "All we really have is a change in tooling. The questions that have some slight interest is how people respond to new tooling, and the inevitable effect of commercial practicality.\n\nFor example, we could recreate much of machine-set letterpress with computer composition. But we don’t. Is that because it would take more effort than the result is worth, or because machine-set letterpress, in order to be commercially viable, itself involved compromises we would like to abandon. Etc., going back & back.\n\nAnd the answer is both.\n\nYou can chronicle such changes, but it isn’t terribly interesting save for historians, and I suppose psychologists.\n\n"
    },
    {
      "time": " 3.May.2009 10.06am",
      "content": "_photography is identified as a perfect match for the New Typography given its objectivity, clarity, and lack of individualism._\n\nAnd yet photography precipitated historicism: Emery Walker was a key figure, as photographer, incunabula bibliophile, and cutter (designer?) of the Kelmscott fonts for William Morris. Apparently, the Golden Type was drawn/traced over photographic images of Jenson’s printing.\n\nMorris Benton, who revived Jenson for the masses, as well as Bodoni and Garamond, was also a keen photographer—he had his own colour darkroom.\n\n_...it isn’t terribly interesting save for historians, and I suppose psychologists._\n\nOn the contrary, as I type designer I find the historical relationship between letter form and technology to be at the heart of my work.\n\n"
    },
    {
      "time": " 3.May.2009 11.08am",
      "content": "”...as I type designer I find the historical relationship between letter form and technology to be at the heart of my work.”\n\nWell said, to the point, to the present.\n\n”...it isn’t terribly interesting save for historians...”  \nOh? ;)\n\nCheers!\n\n"
    },
    {
      "time": " 3.May.2009 11.13am",
      "content": "I think the single designer/producer/seller is a key point to consider. Not long ago type designer would ’simply’ draw the letters by hand then they were digitized or otherwise turned into a working font by a larger foundry / someone else. This is not only during the metal era, also for phototype and a significant portion of the current digital age.\n\n“By the other hand, this is misleading people to think that all you need to design a font is a Mac and some spare time... no need to study or read anything... :|”\n\nThat is entirely true. Anyone can and does make fonts now! Same as everyone became a graphic designer when they got a computer, Word, Illustrator, or whatever.\n\nr.k\n\n"
    },
    {
      "time": " 3.May.2009 11.51am",
      "content": "<cite>On the contrary, as I type designer I find the historical relationship between letter form and technology to be at the heart of my work.</cite>\n\nIf that is meant as a personal, psychological statement — what motivates a type designer — then no quibble.\n\nIf not, the point I was trying, and obviously failed, to make was that if we chose, we could reintroduce \\*most\\* of the effects of the hot metal composition with computer type. Just a couple of instances — a randomization program could be used to introduce slight variations in letters, mimicking the variation from casting individual letters in a mould.\n\nInk spread could be compensated for. And on & on. Given that, the question could be asked: Do we not do this because the original “look” was itself an an aberration? Or if it was desirable, it must not have been so desirable as to be worth all the work to replicate it.\n\nYou can argue that some of look of metal type was an aberration, occasioned by the technology,  \nbut an equal answer is that many of those “aberrations” could have been banished with the technology of the time; they were not because the cost, both in type machines and time, couldn’t be commercially justified. And it was that commercial considerations that brought about that technology to start with, not aesthetic ones.\n\nThe technological change (now to computers) may have occasioned designers to move in different directions, but they could have moved that way anyway, albeit at a much higher cost.\n\nSorry, I believe tooling from a market perspective is essentially an historical, not aesthetic matter. Except, as always, for personal motivation.\n\n"
    },
    {
      "time": " 3.May.2009 12.14pm",
      "content": "Wow, I’m having a major flashback to this recent discussion:  \n [http://typophile.com/node/55783](http://web.archive.org/web/20090506030442/http:/typophile.com/node/55783 \"http://typophile.com/node/55783\")  \n(It’s almost surprising nobody has [directly] linked to it yet, but maybe that’s because not everybody was so much arguing in favor of a direct link between technology and form in that case as I was.)\n\n<cite>“the point I was trying, and obviously failed, to make was that if we chose, we could reintroduce *most* of the effects of the hot metal composition with computer type.”</cite>  \nYes, but we don’t (at least most of us). And why not? Because it doesn’t make sense, in my view.  \nIf I may reiterate a point I made over on the Legato thread, I still think that tools influence thinking, not just production specifics. Ideas are born in friction, and dialogue, with tools and materials. Or grossly oversimplified, tools —which of course aren’t born out of a vacuum, but out of a desire too— influence form-finding, which influences aesthetics, which cumulatively help shape some sort of zeitgeist, which in turn pushes aesthetics.\n\n"
    },
    {
      "time": " 3.May.2009 12.15pm",
      "content": "Personally, I have no desire to mimic the effects or artifacts of a previous technology—copying “the Look” seems pointless to me as a design effort. If others want to do this, I have no problem with that and will happily allow them to spend their lives as they wish.  \nI have years of memories of flat pen, handset, hotmetal, photo, coldtype, presstype, wood, linoleum block, silkscreen, and strike-on and all of their inherent issues good and bad so I have no need of a nostalgic fix. There is plenty enough for me to learn and do using today’s evolving troolset. Rather than going back to centuries old masters of prior times, I prefer to learn from those younger than I am today but who are better versed in the technology du jour than I am today.  \nI am not really fascinated by current tools, I am just in a hurry to learn them in time to make use of them before my clock stops ticking.\n\nChrisL\n\n"
    },
    {
      "time": " 3.May.2009 3.09pm",
      "content": "I’m a very mediocre designer, so I just blame the tools of today — still waiting for the right technology to unleash my potential. Direct brain-to-computer transfer, something like that.\n\n"
    },
    {
      "time": " 3.May.2009 6.11pm",
      "content": "@theunis - so am i! ;-)\n\n"
    },
    {
      "time": " 3.May.2009 8.57pm",
      "content": "Technology has always had an effect on type design — because it creates new possibilities, but also places limitations on what you can do (i.e., Monotype and Linotype). And the personal computer has had an effect not just on type, but on many other fields as well — look at what is happening in the music world. Nowadays, anybody can record a song in their bedroom; professional recording studios are slowly dying. Sound familiar?\n\n"
    },
    {
      "time": " 3.May.2009 11.56pm",
      "content": "Charles, it’s not just personal motivation.  \nThe discourse of type design concerns time and technology.  \nWith every new wave of technology, the classics are reinterpreted.  \nThey provide a benchmark against which to assess the qualities of new media, and a challenge for humanizing it.  \nAt the same time, new media interpretations provide a fresh perspective on how the classics were informed by previous technologies.\n\n"
    },
    {
      "time": " 4.May.2009 4.48am",
      "content": "Nick, I agree with that completely.\n\nIn passing, your words are a remarkably complete summation of an article written by A. J. Ayer on why philosophy continues through the centuries.\n\n"
    },
    {
      "time": " 4.May.2009 9.30am",
      "content": "Thanks all for the links, discussion, and historical facts. Very interesting comments — the impact being extensive: social, practical, aesthetic, zeitgeist-y.\n\nI’m struck by the apparent inseparability of the tool and at least some aspect of the product.  \nIn ancient Greek the word ’techne’ refered to both art and craft (not in the William Morris sense), to any kind of making that had an end product. Through a series of translations the two were separated, and for some art stands in opposition to technology with all its negative connotations. I’m thinking type is one of those places where art and technology are still joined — where something like utility and something like beauty are both present in the production and in the product itself.\n\nNo doubt, i’d add that the relation between letter form and technology has been of interest to philosophers as well.\n\n"
    },
    {
      "time": " 4.May.2009 10.45am",
      "content": "The beauty is in the artfulness of the success in utility.\n\nChrisL\n\n"
    }
  ]
}
