{
  "id": "57616",
  "title": "'Buster': a Fat Humanist Sans-Serif with a bad attitude",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi,\n\nI am creating this face with the goal of combining gestural graffiti-curves with no-nonsense geometric forms, effortless readablity at large sizes, and in-your-face poster thickness.\n\nI am working on a lightweight version of the face to contrast with this fat weight, but it is in a very rough stage as of yet.\n\nCriticism will be greatly appreciated!\n\nThanks.\n\n ![](http://web.archive.org/web/20150416033948im_/http:/typophile.com/files/buster1_6453.gif)\n\n",
  "author": "P Fisher",
  "time": "2 May 2009 — 10:29pm",
  "uid": "44229",
  "comments": [
    {
      "time": "3 May 2009 — 4:37am",
      "content": "If you're gonna be a bit wild I would take it a bit further and more consistently throughout the entire thing. Some characters are showing movement while others like T I F and Z are just straight. Of course, how you intend to use this would play a big part in how wild you want to go.\n\n"
    },
    {
      "time": "3 May 2009 — 4:02pm",
      "content": "Stephen,\n\nThanks for your input.\n\nThe font is intended mainly for use in headlines and on posters. I agree that the F looks too stiff right now. I may keep the I perfectly straight though, as the straight vertical lines provide an unwavering, authoritative quality to the design (I am inspired by fonts like Impact and Neutraface).\n\nI am thinking that perhaps I should ditch the perfectly straight horizontal upper-arms on the E,F,T, and Z and replace them with something a bit more lively and maybe include the perfectly straight versions as alternate characters.\n\nAnother concern of mine is that the L,O and T lack the thick/thin contrast that is so prominent in the Q,A,G,Y etc.\n\nIn regard to how wild I would like to go:\n\nIdeally all of the letters will be no wilder than the Y or G and no tamer than the H\n\n"
    },
    {
      "time": "4 May 2009 — 2:15pm",
      "content": "Casual uniformity? Maybe? You might make it work. I guess my thought (aside from the “wildness”) is that some of the weights of the glyphs are not consistant with others. JOLT is strong (bold). WAX is weak (medium to light).\n\nAs I said, just my thought... you get what you pay for.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150416033948/http:/www.thefontry.com/)\n\n"
    }
  ]
}
