{
  "id": "57629",
  "title": "Author requested permission to use my poster in his book, should I ...?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I received and email from an art history professor who’s writing a book on poster design, and he wants to include one of my posters. He purchased one directly from me off the internet a year ago. I’ve never had such a request before, and I’m not quiet sure how to reply.\n\nHe hasn’t offered any compensation, just asked for permission and a short bio to accompany the poster. He has a contract with a major publisher already, so I assume he’ll profit (off the work of several designers!)\n\nShould I reply with a payment request, or just allow him to use it for the PR?  \nIs he responsible for licensing the fonts I used in the poster?\n\nHas anyone else been published like this? If so, has it been beneficial or not?\n\nThanks for any advice you can offer.\n\n",
  "author": "<a href=\"/web/20090808194713/http://typophile.com/user/15843\" title=\"View user profile.\">Alaskan</a>",
  "time": "<br>",
  "uid": "15843",
  "comments": [
    {
      "time": " 4.May.2009 12.25am",
      "content": "Of course accept.\n\ndr\n\n"
    },
    {
      "time": " 4.May.2009 4.17am",
      "content": "Accept! Professors don’t really tend to make money off of their publications. Most tend to be pretty short run (there are of course exceptions) with little to no profits. In any case, if I understand you correctly, he’s wanting to put you in the canon, so to speak, which can be far more beneficial to you than a licensing fee.\n\nAs for fonts... no. Your poster is a finished work that you’ll probably be sending to him with the fonts outlined or otherwise rasterized, so licensing isn’t a concern.\n\n"
    },
    {
      "time": " 4.May.2009 5.54am",
      "content": "Go for it. Congrats!\n\n"
    },
    {
      "time": " 4.May.2009 6.12am",
      "content": "yeah, just say yes.\n\n"
    },
    {
      "time": " 4.May.2009 6.33am",
      "content": "Free publicity=good.\n\n"
    },
    {
      "time": " 4.May.2009 8.09am",
      "content": "Ask for a complementary copy.\n\nEven better: if that professor is (more or less) famous, ask for a _signed_ copy.\n\n"
    },
    {
      "time": " 4.May.2009 11.03am",
      "content": "The last posting is the best. Ask for a copy. Often that is all a professor gets in payment. If you ask for cash, you will never hear from him/her again.\n\n"
    },
    {
      "time": " 4.May.2009 8.19pm",
      "content": "Thanks for all your comments. I plan to ask for a copy of the book, but I’m still a little fuzzy on the licensing requirements.\n\nGuifa: Yes, the fonts are outlined in the file I’ll submit; but all the work I sell (publish or print) myself consists of outlined fonts when I submit the final file. Obviously I pay to license the fonts. Is that all a designer needs to do to avoid paying a license - rasterize or outline? That seems unethical and wrong to me.\n\nI always make clients license the fonts I use, even if it’s for a newspaper ad and they’ll never use the font again. So why wouldn’t this author be required to license the fonts? Can somebody clarify?\n\n"
    },
    {
      "time": " 4.May.2009 8.38pm",
      "content": "In most cases you only have to license a font once. If you already licensed the fonts when you created the poster, and aren’t sending the fonts along to use in the book, there’s no need to license to fonts again.\n\n"
    },
    {
      "time": " 4.May.2009 9.12pm",
      "content": "So I’ve been making my clients buy copies of fonts for no reason?\n\nHmm. If this is true; to all you type designers out there - you’re welcome. :)\n\n"
    },
    {
      "time": " 5.May.2009 12.22am",
      "content": "Well, if you make customers pay for the font again and again after you paid it once, assuming they will never use this font (because, well, you rasterize it), that makes you a guy I wouldn’t want to work with. And now you are wondering if you should make a professor pay for nicely selecting your work in an upcoming book for a big publisher... Damn, you \\*really\\* are into money.\n\ndr\n\n"
    },
    {
      "time": " 5.May.2009 2.13am",
      "content": "You have it all wrong, David. About 70% of the work I do is volunteer. I don’t have a greedy bone in my body, and my bank account proves it.\n\nI require clients pay for a font (once!) because THEY are the one printing the work, not me. I’m simply designing for them, and they’re not paying ME for the font, they’re paying the type designer directly. If I were an in-house designer, the company would buy the font, right?\n\nAs far as the book is concerned, I had no idea how to handle it. I simply didn’t want to be taken advantage of. I’ve had my work stolen so often that it’s extremely rare to have somebody ask permission beforehand. The book is on a very hot, historic topic and I expect it will sell very well. Seriously well, especially with an October release.\n\nIt doesn’t seem right that a publisher doesn’t pay anything to the artists whose art **is** the book. The author says it’s a 200 page book with 186 posters, very minimal writing. 186 artists, and the author and the publisher are the only people that profit?\n\n"
    },
    {
      "time": " 5.May.2009 2.40am",
      "content": "[Alaskan] <cite>I always make clients license the fonts I use, even if it’s for a newspaper ad and they’ll never use the font again. So why wouldn’t this author be required to license the fonts? Can somebody clarify?</cite>  \n[James] <cite>In most cases you only have to license a font once. If you already licensed the fonts when you created the poster, and aren’t sending the fonts along to use in the book, there’s no need to license to fonts again.</cite>\n\nApproaching it from the other end:  \nThe client needs to license fonts as soon as he is handed files (for InDesign, Illustrator, etc) which, for modification or printing or generating PDFs, require that fonts are installed on his computer.  \nBut if the client receives files with text converted to outlines or rasterized, or receives PDFs with fonts embedded (please check the EULA for this point), he can modify or print or generate PDFs without fonts being installed on his computer, and in this case does not need to license them.\n\n[Alaskan] <cite>... but all the work I sell (publish or print) myself consists of outlined fonts when I submit the final file.</cite>\n\nI assume that in the first place you get paid not for mere files but for design.&nbsp;&nbsp;:)\n\n"
    },
    {
      "time": " 5.May.2009 5.00am",
      "content": "_The author says it’s a 200 page book with 186 posters, very minimal writing._\n\nOh, this _is_ a worry. I think that we all assumed (jumped to the conclusion:) that this would be an academic endeavour with your poster as an example, to illustrate a point. That would be fair use and an acknowledgement of your authorship would be enough. If the bulk of the book are these images that’s a different ball game, IMO. Do you know what the other posters are?\n\n"
    },
    {
      "time": " 5.May.2009 5.19am",
      "content": "<cite>The book is on a very hot, historic topic and I expect it will sell very well. Seriously well, especially with an October release.</cite>\n\nSure, that’s why Wall Street brokers have surreptitiously gotten into publishing art books. (Did I mention that I can get you a good deal on ocean-front property in Arizona?)\n\nThere is an old saying about publishing — it is a good way to make a small fortune, as long as you start with a large one. And you can achieve this much faster with art books.\n\nAs far as the popularity of poster work goes, Tom Eckersley got an OBE for his poster work during World War II. Fame, but no fortune.\n\nAsk yourself this: would the author have a viable book without your poster? With only 187 images — or with 188, using one other than yours?\n\nI do wish you good luck, but check out the realities of book publishing before making a demand for a fee for including your work in a book.\n\n"
    },
    {
      "time": " 5.May.2009 5.22am",
      "content": "If it’s a 186 poster book with 200 pages, there could easily be a solid 30-60 pages of writing, which could indeed be a pretty serious bit of writing.\n\nWhile when I write an academic work on literature I can easily reference multiple works citing only the most relevant part since presumably any major library at a research university will have them or can quickly retrieve them with ILL, pieces on visual works (especially posters which can be have very short public lives and may not otherwise be published in any other place), illustrations are a necessity and may not be available in published form anywhere.\n\nI’d discuss the work some with the author, to see precisely how he wants to go about the work. If it’s a mere collection, then you’ll likely want to ask for compensation, but (I think I lean more to this) if it’s a substantial work that requires illustrations to be meaningful, I don’t think it’s necessary. Actually, just ask him to see a draft copy of the chapter he’s using your book and maybe the introduction too. Contractual obligations with the publisher aside, he’ll probably let you take a look, and from what you read you can decide how to proceed. Liberal arts publishing, at least from my experience in the literature world, isn’t quite as secretive as, say, science publishing.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": " 5.May.2009 8.52am",
      "content": "Alaskan, maybe I can cite a couple of examples from the type community... First example: Tamye Riggs recently posted a request here (and [elsewhere](http://web.archive.org/web/20090808194713/http:/www.facebook.com/group.php?gid=35678162623)) for work using certain typefaces considered to be classic, and [the book is due to be published in June](http://web.archive.org/web/20090808194713/http:/www.rotovision.com/description.asp?isbn=978-2-88893-043-3). The other example: When Leslie Cabarga was writing his [_Logo, Font and Lettering Bible_](http://web.archive.org/web/20090808194713/http:/www.lesliecabarga.com/products/logo-font-and-lettering-bible), he sent out requests to designers he knew, and he got many illustrations for his book this way. Everyone received credit, and got some exposure in exchange. A win-win situation for all involved, I suppose.\n\nI think that this author has gone about things the right way — he’s written you in advance to request your permission to use your work. Of course, you don’t know this professor the way you might know Tamye or Leslie, but you could find out if he’s published other books — that might give you some reassurance as to his intentions. Or, as Matthew suggests, ask him if you can see a draft, a chapter, etc.\n\n"
    },
    {
      "time": " 5.May.2009 12.20pm",
      "content": "Thanks for all your advice, Typophiles.\n\nI’ve gotten further clarification. The book is strictly a collection; several posters will fold out into full-sized posters, and several gate folds. It’s an “oversized deluxe” edition, and the only writing is an intro page and an index of artists with mini-bios at the end.\n\nThis is not an educational book about poster design techniques at all — it’s definitely a coffee table book. If it were “The History of Posters” I’d have jumped at the chance without a second thought. This book is a gift item, not a collegiate text. I guess I should have made that clear from the start of the thread, huh?\n\nSo, does that change how I should proceed? I still haven’t given him an answer, I’ve just been asking questions.\n\n"
    },
    {
      "time": " 5.May.2009 4.46pm",
      "content": "Hmmm... This might interest you: the other day, I saw the [Gig Posters book](http://web.archive.org/web/20090808194713/http:/gigposters.com/book/) at a store... It’s a similar project: coffee-table book with many rock concert posters, and I believe you can tear them out, too.\n\n"
    },
    {
      "time": " 5.May.2009 4.53pm",
      "content": "To my mind this is clearly a commercial (for profit) use of your work rather than academic one. In my experience, in these instances the publishers themselves negotiate fees/acknowledgements rather than the authors. Could it be that the author is building the content and then the publisher will negotiate a potential fee with you?\n\n"
    },
    {
      "time": " 5.May.2009 7.13pm",
      "content": "\\> Could it be that the author is building the content and then the publisher will negotiate a potential fee with you?\n\nI wouldn’t be so sure about fee. Anyway, I’d say yes. If you think this is going to be good for your résumé, accept. This is the best reason – maybe the only one.\n\nA coffee table book is always a pretty, impressive book. In addition, you say it’s a major publisher, so it’s going to be (hopefully) everywhere and therefore it’s going to be watched by many people (free publicity, as James says). And your poster will be among other great designs. It’s like saying, “See?, this people think I’m good on my job, just as good as the other rockstars included here!”\n\nI’d go for it, for sure.\n\n"
    },
    {
      "time": " 5.May.2009 7.42pm",
      "content": "Thanks everyone for the benefit of your experiences.\n\nYes, the book is going to be like the rock star book Ricardo linked to. I emailed the author and inquired about the publisher negotiating fees with artists, but I also let him know I was very interested in being part of the book and a fee wasn’t necessarily a deal breaker.\n\nI’ve read up on his bio, and I have no reason to think he’s inclined to pull the wool over my eyes. I found stuff online that he’s written about professional ethics and artist survival. So, I decided to simply trust he’s not likely to profiteer off the work of graphic artists. If there is no cash forthcoming from the publisher, I’ll simply give the author permission for the PR.\n\nI’ll post the end of the story when I know.\n\n"
    },
    {
      "time": " 6.May.2009 6.20am",
      "content": "I still say the best fee is a free copy of the book. If it is a coffee table work, then it will be priced in the $50 to $100 range. If there are 186 contributions, they won’t be paying all that much more than $100 anyway to the contributors. 186 x 100 = $18,600, a lot more than most publishers will pay for permissions.\n\nAnd if you have the free copy, then it becomes a great part of your portfolio (although perhaps a bit much to lug around).\n\n"
    },
    {
      "time": " 6.May.2009 3.56pm",
      "content": "Do you have a clear idea of how your poster will be described? If the author is big on professional ethics and artist survival, you probably don’t have to worry. But I’d make sure he’s going to say something nice about it, if anything at all. You wouldn’t want the poster to be held up as a bad example of something. :-)\n\n"
    },
    {
      "time": " 6.May.2009 4.24pm",
      "content": "My thoughts:\n\n- ask him if there is compensation involved.\n\n- Show us the poster!\n\n"
    },
    {
      "time": " 7.May.2009 3.14pm",
      "content": "Tell him you want your poster to make front cover and all the members of typophile get a free copy, thats a fair deal :) in all seriousness you must be chuffed to have been approached like that, nice one!\n\nI say submit your work with no fee request. An amazing opportunity!\n\nLets see the poster then!\n\n"
    }
  ]
}
