{
  "id": "57651",
  "title": "Using Spiro on a mac",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anybody know how to use Spiro on a mac?  \nIt is possible to work like a FontLab plugin or macro?  \nI tried to run ppedit app with no sucess. Thank you!\n\n",
  "author": "juandelperal",
  "time": "4 May 2009 — 10:35am",
  "uid": "14370",
  "comments": [
    {
      "time": "4 May 2009 — 10:56am",
      "content": "With fontforge you can use it.\n\n"
    },
    {
      "time": "5 May 2009 — 1:00am",
      "content": "Yes. With [FontForge](http://web.archive.org/web/20131020161145/http:/fontforge.sf.net/), not FontLab, as stated. You need to have X11 installed. If it's not on your Mac already, you can install X11 from your MacOS X install disk. libSpiro is a separate library that needs to be installed in addition to FontForge to make Spiro drawing mode work.\n\nSee the [FF Mac installation notes](http://web.archive.org/web/20131020161145/http:/fontforge.sourceforge.net/mac-install.html) for details and also install [these dependencies](http://web.archive.org/web/20131020161145/http:/sourceforge.net/project/showfiles.php?group_id=103338&package_id=302003&release_id=645772)\n\n"
    },
    {
      "time": "5 May 2009 — 6:46am",
      "content": "Thank you!  \nI will try FontForge\n\n"
    },
    {
      "time": "5 May 2009 — 9:41am",
      "content": "You can install the 'dependecies' (included spiro I think) here: [http://sourceforge.net/project/showfiles.php?group\\_id=103338&package\\_id=...](http://web.archive.org/web/20131020161145/http:/sourceforge.net/project/showfiles.php?group_id=103338&package_id=302003 \"http://sourceforge.net/project/showfiles.php?group\\_id=103338&package\\_id=302003\")\n\n"
    },
    {
      "time": "5 May 2009 — 11:52am",
      "content": "I want to use Spiro as well. But somehow with no success. I have fontforge working on X11 but can't seem to work with Spiro. I am attaching a screen shot of the active area in Spiro.\n\n ![](http://web.archive.org/web/20131020161145im_/http:/typophile.com/files/spiro_screen_6605.jpg)\n These are the only active knots visible in a very narrow left top corner. My mac is an IntelMac OSX 10.5.6. Any suggestions what the cause of it is? Many thanks! \n"
    },
    {
      "time": "5 May 2009 — 1:18pm",
      "content": "Yes!  \nSame issue here on Leopard 10.5.4. I can't export too…\n\n"
    },
    {
      "time": "5 May 2009 — 1:25pm",
      "content": "Raph may have to chime in on this. I recall ppedit has the save feature somewhat oddly enabled. Is FontForge not working for you either?\n\n"
    },
    {
      "time": "5 May 2009 — 3:42pm",
      "content": "Fontforge is working perfectly, on my computer, I've already started some design projects on it. But I can't seem to work with the Spiro. Although I remember using it once with my powerpc laptop on an earlier OSX. I discovered the active area only today actually, a tiny rectangular area which pen can work. Seems very odd...\n\n"
    },
    {
      "time": "5 May 2009 — 3:50pm",
      "content": "So that difficulty is with Spiro drawing mode within FontForge, or in the separate ppedit application?\n\nI think we're talking about two different things here and it's confusing.\n\nI haven't yet tried FontForge on an Intel Mac, so I can't really speak on that issue.\n\n"
    },
    {
      "time": "5 May 2009 — 3:53pm",
      "content": "I meant the ppedit application.\n\n"
    },
    {
      "time": "5 May 2009 — 5:47pm",
      "content": "ppedit's functions are very limited. It's a demonstration of the Euler/Cornu spiral drawing concept, not much more. It can be used for font production in a roundabout way. Raph Levien has done this himself, but he wrote the thing and knows stuff about its inner workings I can't tell you.\n\nIf you're trying to use it for font drawing, it's much easier to use Spiro mode in FontForge instead. ppedit's rendering is prettier, though.\n\n"
    },
    {
      "time": "5 May 2009 — 10:04pm",
      "content": "It is possible to use ppedit (it's how I did Inconsolata), but it's not for the faint of heart. You use ctrl-S to save (to a file called \"plate\"), and ctrl-P to convert to PostScript outlines (to a file called \"/tmp/foo.ps\"). I used additional commandline tools to import the PostScript outlines into FontForge, as well as to optimize them to minimal Beziers. Some of those utilities also ship in the spiro distribution.\n\nThese days, I'm more inclined to use FontForge's spiro drawing mode. I am frustrated by the UI clunkiness, and by the lack of rendering quality, but having the curves right there in the font instead of having to do conversions is a pretty major win.\n\nAt some point, I want to get a good, usable, and pretty editing environment out there, but I don't have much time for it right now, juggling too many other things as it is. I'm most inclined to do it in in-browser Javascript, as browsers have finally gotten good enough to pull that off, and it's truly cross-platform. I'm not inclined to do much further development on ppedit, unfortunately - it would take a _lot_ of work to make it into a real tool.\n\nI'm glad you guys are enjoying experimenting with Spiro.\n\n"
    },
    {
      "time": "6 May 2009 — 6:39am",
      "content": "Yes Raph. I tried FontForge and it works good but is not very comfortable to me. The rendering quality is not very good also…  \nBut it's very powerful work on Spiro!  \n [http://www.youtube.com/watch?v=rmxUJ\\_R\\_ySM](http://web.archive.org/web/20131020161145/http:/www.youtube.com/watch?v=rmxUJ_R_ySM \"http://www.youtube.com/watch?v=rmxUJ\\_R\\_ySM\")\n\n"
    },
    {
      "time": "30 Jun 2009 — 1:00pm",
      "content": "I only want to say that I have found that the development builds of Inkscape works with spiro.  \nIt is very good. You will need X11.  \nHope that be useful.\n\n"
    },
    {
      "time": "25 Nov 2009 — 5:18am",
      "content": "The new inkscape (0.47) has spiro support…\n\n"
    }
  ]
}
