{
  "id": "5768",
  "title": "What makes a typeface unique to a nation or culture?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was wondering if some of the knowledgable Typophiles around here could help me out.   \n   \nAside from culture-specific writing systems (Korean, Thai, etc.), what kind of type features can be demonstrated as being culture specific?   \n   \nAre there modern typefaces (as opposed to historical Gothic, Carolingina, etc.) that one can point out as being distinctly French, German, Dutch, etc?   \n   \nI was thinking about the subject after seeing some of the work Kontrapunkt has done for DSB, designing sans-serif typefaces based on uniquely Danish letterforms.   \n   \nPaul\n\n",
  "author": "anonymous",
  "time": "7 Jan 2003 — 1:40pm",
  "uid": "1203",
  "comments": [
    {
      "time": "8 Jan 2003 — 10:10am",
      "content": "one could suggest that script-like features are always present in Amharic. I havn't seen any grunge/sans serif/display or even x-height (well x-height dosen't even exist I guess) properties. I wouldn't be able to say for sure, but of all the Amharic/Fidel typefaces I've seen you can tell that they originated from a pen. They usually have a 7 degree angle on all stems.   \n  \nthen again, one could suggest the same for any ancient language that hasn't steped up to the information age, and or of which Microsoft & Adobe hasn't recognized yet.\n\n"
    },
    {
      "time": "8 Jan 2003 — 1:19pm",
      "content": "I'm more trying to get at distinctions within a single script, particularly the Latin script. Certainly there were differences before the printing press, and even afterwards we've had variations like German fraktur, \"western\" type, and even Celtic type. Are there such differences in modern text faces?   \n   \nHrant pointed out diacritics. Poles prefer more vertical accents. Germans can play with their umlauts more. French prefer simpler cedillas.   \n   \nI've seen East European faces with unusually flat-topped A's.   \n   \nHrant mentioned Czech faces being fauve. I can't think of any Czech type offhand, but some Latin American lettering would strike me as\n\n"
    },
    {
      "time": "8 Jan 2003 — 1:28pm",
      "content": "Hey Stephen, whip us up some primo Czech font samples, will ya?   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jan 2003 — 2:32pm",
      "content": "Fauve factor five.   \n(Thanks. Can I buy ya a drink? ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jan 2003 — 3:39pm",
      "content": "\\> what kind of type features can be demonstrated as being culture specific?   \n   \nCould this also include 'typographic' features? Such as the use of spacing??\n\n"
    },
    {
      "time": "8 Jan 2003 — 3:53pm",
      "content": "\\>Could this also include 'typographic' features? Such as the use of spacing??   \n   \nOnly if it was typeface-specific. For example, extra leading is not a German cultural preference, it simply makes text with lots of capitals look nicer.   \n   \nOn the other hand, a typeface specifically designed with tight \"ij\" digraphs might be considered Dutch in that respect.   \n   \nBut I'm no expert, which is why I asked. ![:-)](http://web.archive.org/web/20131019174038im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nPaul\n\n"
    },
    {
      "time": "8 Jan 2003 — 4:48pm",
      "content": "That's a little weird that you would want to cancel out every other written language simply because it dosen't follow Latin letterforms.   \n  \nThat's ALOT of culture specific data lost out on. And if your only going to include the G20, globalization will take care and melt away any specific features within them before long. Forget the fact that the written language looks different...its still an interesting \"culture specific typographic feature\" i.e. Nanuvut is very geometrical - hardly any curves: so I wonder if someone was to design a new font for that culture and if they introduced curves into the glyphs how it would be received. Their typographic features seem to emulate their arts and lifestyle, even landscape, could that be why the glyphs were forms that way? who knows.   \n  \nI wouldn't think that any written system that adapted Latin letterforms has much culture left in them for there to be enough data to write anything about. (tanya steps down from soap box)   \n  \nhow about Quebe\n\n"
    },
    {
      "time": "8 Jan 2003 — 6:05pm",
      "content": "Paul,   \n   \nYou should look at a copy of D.B. Updike's _Printing Types,_ which shows a country-by-country history of Western typeface design from the earliest printing in the 1400s up to the time the book was written (I have the two-volume 1937 edition). Here's the [current edition](http://web.archive.org/web/20131019174038/http:/www.amazon.com/exec/obidos/tg/detail/-/1584560568/qid=1042073777/sr=8-1/ref=sr_8_1/103-4063219-9562230?v=glance&s=books&n=507846). You can also find used copies, but this tends to be an expensive book (or books).   \n   \nThe first edition was written in the 1920s, then revised in 1937. I believe it was revised a couple of times later, but to me the most valuable information is the early history of printing and type design. The book includes numerous reproductions of book pages and type specimen sheets.   \n   \nWilliam Morris' Kelmscott Press books in the 1890s started a revival of interest in historical printing types. However, little was known of the history of type design, and one of the only ways to learn about it at the time was to look at antique books; little scholarship had been done. This is one of the earliest and is still the most exhaustive survey of printing history that I'm aware of. Updike can be opinionated and a little cranky at times - for instance, he obviously dislikes Baskerville's type, even though he used a very similar typeface for his own book.   \n   \nI'm not sure how much you know about the history of typography (so forgive me if I'm talking down to you), but you may be surprised at how old some of the typefaces we commonly use today are. The various versions of Garamond are based on French typefaces from the 1600s, and Baskerville and Caslon, two very popular English typefaces for modern book design, date from the 1700s (and were both used by Benjamin Franklin). Centaur and the various versions of Jenson are based on Italian designs from the 1400s.   \n   \nEarly Roman typefaces fell into rough groups that could be generally classified as Italian, French and Dutch/English, and modern revivals based on them still retain many of these characteristics. The best type designers are very aware of the characteristics across both time and place, and generally don't mix incompatible features from different traditions or eras. For instance, the modern Minion typeface looks very French.   \n   \nThe early European printers used blacketter typefaces (examples are Old English and the German Frakturs), which each had distinctive national characteristics. Roman type originated in Italy in the late 1400s. Originally used mostly for setting texts in Latin, it replaced blackletter for almost all printing within about 100 years. German-speaking countries were the main exception, and continued to use Fraktur (the German version of blackletter) up until the end of WWII. The Nazis decided that san-serif typefaces undermined German culture; in all seriousness, some designers who used san-serif type actually attracted the attention of the Gestapo.   \n   \nIt makes sense to be aware of the history of the typeface that you use for a particular project, to avoid making unintentional typographic jokes. For instance, it would look odd to use an classic English or Italian typeface for a book about Rennaisance French history when there are a large number of excellent Rennaisance French text typefaces to choose from. The same is true of things like menus and signage; you can often use type to reinforce a national or ethnic theme.   \n   \nTake care,   \n   \n- Paul\n\n"
    },
    {
      "time": "8 Jan 2003 — 6:39pm",
      "content": "\\> For example, extra leading is not a German cultural preference,   \n\\> it simply makes text with lots of capitals look nicer.   \n   \nI think this type of distinction is problematic. On the other hand, it might be smart to limit things (see below), and getting into cultural preferences of page layout is pretty scary. So what, do you only consider \"internal\" leading, maybe? :-/   \n   \n\\> That's ALOT of culture specific data lost out on.   \n   \nI think it's useful here to limit the scope to Latin (and that's me saying it). Maybe other scripts can be done subsequently - but Paul might choke if he bit off too much.   \n   \n\\> I wouldn't think that any written system that   \n\\> adapted Latin letterforms has much culture   \n\\> left in them   \n   \nThat's a good point - look at Turkish.   \nA related thing that _would_ be interesting though: analyzing the Latin designs of people for whom it's not native (or for whom it was a writing-system switch). Like my Latin fonts _still_ seem to have a certain Armenian flavor, as hard as I try to subdue that (important for text designs).\n\n"
    },
    {
      "time": "8 Jan 2003 — 9:37pm",
      "content": "Tanya:   \n   \n_That's a little weird that you would want to cancel out every other written language simply because it dosen't follow Latin letterforms._    \n   \nNo such exclusion is meant. Examining why _different_ scripts look different is just a much broader subject, whereas I was more curious about variation _within_ scripts (for a specific reason which is my own). I'm certainly no Latin-centrist - in fact, I'm currently learning Japanese _and_ Thai. Japanese is probably the coolest writing system in the world.   \n   \n_Nanuvut is very geometrical - hardly any curves: so I wonder if someone was to design a new font for that culture and if they introduced curves into the glyphs how it would be received. Their typographic features seem to emulate their arts and lifestyle, even landscape, could that be why the glyphs were forms that way? who knows._    \n   \nGreat subject, and if that's the direction this thread takes, no problem. Being Canadian, I intend to try incorporating suitable interpretations of Inuktitut (the language of Nunavut and northern Canada) into future typefaces I design. How would one reconcile those nifty geometric shapes with a serif face? Hmm...   \n   \n_I wouldn't think that any written system that adapted Latin letterforms has much culture left in them for there to be enough data to write anything about. (tanya steps down from soap box)_    \n   \nI agree whole-heartedly! This topic was partially an attempt to see if typographers can detect any vestiges of culture remaining in the Latin alphabet. Don't get off your soap box.   \n   \nPaul S:   \n   \nSounds like a terrific book. In fact, I found a similar old tome at the library today about hand-lettering type, and about a third of it is on historical letterforms. Probably not as exhaustive or scholarly as Updike, though.   \n   \nHrant:   \n   \nHow does one give Latin text an Armenian flavour? ![:-)](http://web.archive.org/web/20131019174038im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n   \nPaul\n\n"
    },
    {
      "time": "8 Jan 2003 — 10:41pm",
      "content": "\\> Japanese is probably the coolest writing system in the world.   \n   \nYeah, it's so \"layered\"! Many westerners think it's too complicated, the typographic color is messy, etc., but it turns out there are advantages to it. And I happen to believe the human mind can handle _way_ more complexity than that, in fact it relishes information overloading.   \n   \nBut I have to maintain, there is one writing system on top, and everything else below it: Korean Hangul. Grasping its power is really a humbling experience, not least because it was _consciously designed_.   \n   \n\\> How does one give Latin text an Armenian flavour?   \n   \nI don't know, man... If I did, I could control it better. Maybe it's what you eat, like lamb shish kebab with lard, and panjar tchga: literally \"there is no panjar\", a soup made when panjar -a funny green vegetable- is out of season...   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jan 2003 — 7:29am",
      "content": "To get back to the original (very interesting) question about culture-specific type features, I've been meditating on the case of Ireland and I have a few ideas to throw out at you.   \n   \nHaving abandoned the use of a distinct Gaelic alphabet, we've been using Times and Helvetica and whatever else we can get our hands since the 1960s, but I think there are still a few things that set us apart.   \n   \nAs Gaelic typefaces were never accompanied by matching italics, which had no cultural significance or practical use in Ireland at all, you can perhaps distinguish a historical tendancy to use punctuation (common) and obliques (rare) instead.   \n   \nA font that doesn't have a corresponding italic is already, for me, very slightly more Gaelic than one that does.   \n   \nA font that doesn't have distinct uppercase letterforms and simply uses a larger version of its lowercase (and is as a result generally more rounded) is also more Gaelic. It is not however always very readable.   \n   \nA font designed with no dots on its i or j is also a contender.   \n   \nAnything that corresponds to all that is the winner.   \n   \nMatha.\n\n"
    },
    {
      "time": "18 Jan 2003 — 9:39am",
      "content": "Tanya wrote: _Nanuvut [sic] is very geometrical - hardly any curves: so I wonder if someone was to design a new font for that culture and if they introduced curves into the glyphs how it would be received. Their typographic features seem to emulate their arts and lifestyle, even landscape, could that be why the glyphs were forms that way? who knows._   \n   \nThe Inuktitut syllabic writing system is directly derived from the Cree/Ojibwe system, originally conceived by the Methodist missionary James Evans. The Anglican missionary Edmund Peck introduced the successful writing system to the Inuit. It is not a script that originates in or has any connection to pre-Christian Inuit culture, but the Inuit have since made it their own and are very proud of it. [It is also worth noting that most Inuit art you see is not traditional: soapstone carving was introduced to the Inuit only in the later 20th century.]   \n   \nThe geometry of the Canadian syllabics derives from the very crude type making methods developed by James Evans in the far north of Manitoba. He carved matrices in the endgrain of wood, and found straight lines easier to work with. The difficulties of making type under such conditions also led to the most distinctive aspect of the script: the rotation of symbols to indicate different vowel sounds.   \n   \nWhen my colleague Ross Mills was designing the Pigiarniq and Uqammaq typefaces for the government and land use corporation in Nunavut, he found the Inuit to be quite open to novelties such as an increased number of rounded forms. This is a healthy sign: people are more conservative and protective of their writing system when they feel their culture to be under threat. When people are confident in their culture, they can afford to take a _laissez-faire_ attitude and allow experiment.   \n   \nFor more information on Inuktitut syllabics, see Ross' [website.](http://web.archive.org/web/20131019174038/http:/www.tiro.com/syllabics/) The section 'Typefounding on the Frontier' has photos of Ross' recreation of Evans's type making technology.\n\n"
    },
    {
      "time": "18 Jan 2003 — 10:15am",
      "content": "Thanks for the link, John. That's wonderful stuff.   \n   \nM.\n\n"
    },
    {
      "time": "18 Jan 2003 — 1:31pm",
      "content": "I'm familiar with Ross's website - he's done some great work. Once unicode is the _de facto_ computing standard and Inuktitut text processing is accessible for all Inuit, it will be interesting to see the development that script takes on. How would word gestalts in Inuktitut differ from Latin? Etc.   \n   \nMatha: killer monogram!   \n   \nPaul\n\n"
    },
    {
      "time": "18 Jan 2003 — 2:10pm",
      "content": "Paul Schliesser writes:   \n_The Nazis decided that san-serif typefaces undermined German culture; in all seriousness, some designers who used san-serif type actually attracted the attention of the Gestapo._   \n   \nMany of the sans designs appearing in Germany around that time were associated rather correctly with the Nazi's ideological competitors, the communists. Look at lots of the avant-garde designs and New Typography material from that time. The modern aesthetic was adopted first in service of socialism, then national socialism, two sides of the same coin.   \n   \n.....   \n   \nThere is indeed a connection between Nazism and blackletter: the NS outlawed it in 1941, calling the letters \"Judenlettern.\" The lingering misconception that blackletter implies sympathy for National Socialism is one of the many tragic myths that continue to cripple modern German culture (and modern Western culture in general.)\n\n"
    },
    {
      "time": "18 Jan 2003 — 2:51pm",
      "content": "_The lingering misconception that blackletter implies sympathy for National Socialism is one of the many tragic myths that continue to cripple modern German culture (and modern Western culture in general.)_   \n   \nInteresting, though, is that the Amish and Mennonites continued to practice this element of German culture when the Germans didn't.   \n   \nMy mother was born at the end of the war to German-speaking Mennonite parents in southern British Columbia. Many of the Canadian Mennonites at that time had (and still do have, I think) their own German schools and churches, and all the books my mom grew up with were typeset in blackletter (fraktur).   \n   \nAs such, as a child I was familiar with fraktur and even sang along from the German/fraktur hymnal at my grandpa's church; so frakture doesn't have the \"Nazi\" connotations for me that it has for most Westerners.   \n   \nPaul\n\n"
    },
    {
      "time": "18 Jan 2003 — 2:59pm",
      "content": "Matha, you have to balance tradition, expectation, progress and functionality...   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jan 2003 — 3:32pm",
      "content": "\\> Matha, you have to balance tradition,   \n\\> expectation, progress and functionality...   \n   \n   \nHrant,   \n   \nWhat post are you talking about there?\n\n"
    },
    {
      "time": "18 Jan 2003 — 3:46pm",
      "content": "For example, the bit about not having an italic: I'm sure you're right that it would make it more \"authentic\", but is it worth the functional sacrifice, what would readers think, and what's good for progress?   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:06pm",
      "content": "Hrant, a chara,   \n   \nI was thinking about what is \\*seen\\* as Gaelic at the moment. What I \\*want\\* to see is a different thing altogether. While Italic fonts have had very liitle meaning in Irish culture up to now, it is indeed true that they are increasingly needed. We have few models but we will think of something.   \n   \nDo chara,   \nMatha.\n\n"
    },
    {
      "time": "8 Jan 2003 — 2:03pm",
      "content": "To quote from and amend to Mr. Crewdson:   \n  \n _[Czech one](http://web.archive.org/web/20131019174038/http:/www.psyops.com/html/specimens.html), [Czech two](http://web.archive.org/web/20131019174038/http:/www.stormtype.com/pra.html), [Czech three](http://web.archive.org/web/20131019174038/http:/www.p22.com/products/czechmodernist.html), [Czech four](http://web.archive.org/web/20131019174038/http:/www.p22.com/ihof/lino.html), [Czech five](http://web.archive.org/web/20131019174038/http:/www.tdc.org/news/2001Results/Preissig.html)_   \n   \n [Identifont](http://web.archive.org/web/20131019174038/http:/www.identifont.com/show?6Z5) offers specimens for easy comparison of three of   \nthose, even though they toss some completely unrelated   \ngarbage in the \"similar fonts\".\n\n"
    },
    {
      "time": "7 Jan 2003 — 1:59pm",
      "content": "This is a very interesting question. Typeface nationality/ethnicity is seen by some as too subjective to bother with. Gerard Unger recently gave an entertaining talk in Thessaloniki showing how \"Dutch type design\" isn't such a clear-cut thing. Suburban and Collis couldn't be further apart, even though their designers had the same teacher.   \n   \nBut there _is_ something there. And sometimes (although rarely) it's pretty clear, like when Adam Twardoch points out that Polish diacritics should tilt more. Other times is highly contentious, like when Ladislas Mandel insists that French fonts must have smaller x-heights. I'd say that usually it's a matter of getting enough people to agree, like that Czech fonts have a certain \"fauve\" aspect... maybe?   \n   \nWhat would be killer is if somebody sat down and did a serious paper on this, collecting historic and contemporary samples, asking opinions, distilling the whole, and giving us a set of sufficiently usable conclusions for each culture, while noting how tenable each given \"conclusion\" really is.   \n   \nhhp\n\n"
    }
  ]
}
