{
  "id": "57702",
  "title": "Typography and lettering are:",
  "forum": "Home",
  "tags": [

  ],
  "content": "essentially the same discipline\n\n 10% (5 votes)\n\ndifferent disciplines: typography and lettering separate but equal\n\n 42% (20 votes)\n\ndifferent disciplines: typography is a subset of lettering\n\n 10% (5 votes)\n\ndifferent disciplines: lettering is a subset of typography\n\n 13% (6 votes)\n\ntypography and lettering have another relationship (please list)\n\n 25% (12 votes)\n\n Total votes: 48 \n\n",
  "author": "paul d hunt",
  "time": "5 May 2009 — 7:04pm",
  "uid": "7006",
  "comments": [
    {
      "time": "11 May 2009 — 5:58am",
      "content": "_Shame on you._\n\nUm, I confess to being blind about what was so disgusting about what I said. My post was intended as a lighthearted joke about us typophiles and our current [debates about lettering experience and type design](http://web.archive.org/web/20150305115231/http:/typophile.com/node/57747).\n\nApologies to anyone out there who took it as something more disrespectful than that.\n\n"
    },
    {
      "time": "10 May 2009 — 5:55pm",
      "content": "Okay, now I'm more confused than when this started. If you ask a letter or calligrapher if what they do is typography, they will say no. If you ask a typesetter if a letterer is a typographer they also will say no. The downside to this line of reasoning is that if you ask a typesetter if they are a typographer, they would most likely say no(assuming that there are any still around). So, what does a typographer do?\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150305115231/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "10 May 2009 — 4:03am",
      "content": "Terms in the lettering arts ( my attempt to grab all this and stuff it in a bag ) are and have been subject to change and inconsistency. I am not against trying to sort things out to make writing, especially academic writing, clearer. But I do think that given the actual historical legacy that you have be to settle for a potential improvement in clarity, particularly where the conversation is with lay people, or is pragmatic and business oriented as opposed to academic.\n\n"
    },
    {
      "time": "9 May 2009 — 9:08pm",
      "content": "Craig\n\nEdit: I removed my own post as it was way too caustic..\n\nSuffice it to say not every one is as enlightened as you. Don't know the emoticon for disgust.\n\nEdit again: It was his his own handwriting. Not a font. Written in lined binders if I remember correctly.\n\nShame on you.\n\nMichael\n\n"
    },
    {
      "time": "8 May 2009 — 7:01pm",
      "content": "@Paul - couldn't read, but he was equipped to make a hell of a typeface! :-)\n\n"
    },
    {
      "time": "8 May 2009 — 6:47pm",
      "content": "(I'll just carry on by myself here...)\n\nSo, I'm looking up the etymology of \"typography\" and \"type\". It's definitely is related to \"printing\" and \"striking\". I'm definitely leaning toward the opinion that lettering is not the same as or part of typography. Unfortunately, I don't think we have a word for the category that includes both, but I think that's what a lot of people take \"typography\" to mean.\n\n"
    },
    {
      "time": "8 May 2009 — 6:39pm",
      "content": "@Tiffany: type vs. typography\n\nHm. Just went back and re-read that. I'm probably equating the two in my analogies.\n\nI remember arguing that point with Hrant once on Typographica, that I thought lettering should be included under the tent of typography. Now I'm not so sure. If \"typography\" means \"the craft and art of letter forms\", then lettering should be included. If \"typography\" means \"the craft and art of type\", then, no.\n\n"
    },
    {
      "time": "8 May 2009 — 6:22pm",
      "content": "Very late to the party, but I've been following this intermittently during a hectic week...\n\nAlong the lines of William's analogy:\n\nLettering is to typography what clay is to Lego™.\n\nAlso:\n\nLettering is to typography what illustration is to clip art.\n\nThese two analogies capture a lot of the differences in my mind. Also, I would include calligraphy in the same category with lettering. They are different, but in relation to typography I would group them together.\n\n"
    },
    {
      "time": "8 May 2009 — 5:12pm",
      "content": "Nope!\n\nMichael\n\n"
    },
    {
      "time": "8 May 2009 — 3:14pm",
      "content": "@ Michael\n\nAnd hopefully he could read by the end of all that!?\n\n"
    },
    {
      "time": "8 May 2009 — 3:13pm",
      "content": "_I still think some of you aren’t separating type from typography._\n\nthat's because the traditional definition ties typography to type specifically. if you want to use your own definition of what typography is, that's fine, but don't expect people who 'buy' the dictionary's definition to just accept what your concept of typography is or isn't.\n\n[http://dictionary.reference.com/browse/typography](http://web.archive.org/web/20150305115231/http:/dictionary.reference.com/browse/typography \"http://dictionary.reference.com/browse/typography\")\n\n"
    },
    {
      "time": "8 May 2009 — 2:52pm",
      "content": "Actually there are probably more books written by calligraphers every day than there are new releases by all the publishing companies in a decade. Granted they are small, but they are books, hand bound and beautifully written, calligraphed or lettered. I also point out the massive undertaking of the St John's Bible in Minnesota. The costs are astronomical. There are many lenghty hand written books in production and existing that would blow you away.\n\nThere is one gentleman, illiterate I might add, who copied the Bible in his own idiosyncratic handwriting style. The whole Bible mind you, and he could not read, but was so committed, that he copied it... word for word.\n\nMichael\n\n"
    },
    {
      "time": "8 May 2009 — 2:03pm",
      "content": "<cite> only book that is hand written anymore </cite> Actually Korans are also hand written. And people decide to make Bibles by hand every once in a while.\n\n"
    },
    {
      "time": "8 May 2009 — 12:42pm",
      "content": "Tiffany, you're right, the letters are sculptures themselves. The key thing is whether you are building with 'prefab' letters--type--or sculpting the whole thing from scratch.\n\nAs usual, from scratch you have more flexibility and can do some amazing things, but it is hugely time consuming. Didn't Stanley Morrison say something about the whole thing about type being in 'multiplication'? And I think Matthew Carter always emphasizes that his core challenge is to make his type work beautifully when people have to throw a lot of it into a magazine or newspaper quickly, on deadline.\n\nI think the only book that is hand written anymore is the Torah, but then the scribes think God demands it :)\n\nVan Krimpen wrote somewhere that he didn't see the point of setting advertisements in type, because they could always be lettered better. He just left out the part about being better lettered by \\*him\\*.\n\nType is the first \"modern convenience\".\n\n"
    },
    {
      "time": "8 May 2009 — 12:20pm",
      "content": "@Will - That is a nice analogy. But I maintain that as the lettering artist works they are kerning, spacing, line-spacing, column-width adjusting... albeit \"on the fly\".\n\nI still think some of you aren't separating type from typography.\n\nOne could argue that typefaces are sculpture too, but I buy the sculptures pre-made and use them as they are. ;)\n\n"
    },
    {
      "time": "8 May 2009 — 11:51am",
      "content": "albeit, very nice bricks :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 May 2009 — 11:35am",
      "content": "Lettering is sculpture, typography is building with bricks.\n\n"
    },
    {
      "time": "8 May 2009 — 10:13am",
      "content": "What I meant, Tiff, is that lettering is always changing while in the process--letters are adjusted to accomdate neighbors on the fly. This does not happen in type, even with {calt}.\n\nChrisL\n\n"
    },
    {
      "time": "8 May 2009 — 9:40am",
      "content": "Type can change too. Nothing is sacred. And I always break rules. Maybe rules is the wrong word.\n\n"
    },
    {
      "time": "8 May 2009 — 7:59am",
      "content": "Tiff, in lettering, the letters can change so some rules need to change as well.\n\nChrisL\n\n"
    },
    {
      "time": "8 May 2009 — 4:53am",
      "content": "It is easier to think with an empty bladder.\n\n"
    },
    {
      "time": "7 May 2009 — 11:45pm",
      "content": "_One can apply these same guides to lettering._\n\ncan you also apply them to illustration? photographs? other design elements? \\>^p\n\nyou know i'm only doing this at this point to take the piss xxx\n\n"
    },
    {
      "time": "7 May 2009 — 10:14pm",
      "content": "Once again, I agree with Tiffany.\n\n"
    },
    {
      "time": "7 May 2009 — 10:05pm",
      "content": "Ok. I've avoided this thread because for some reason I'm taking this all personally. Go figure.\n\nI see typography as a set of rules (constraints, guides) that one applies to letters and words whether using type or lettering. Type is subject to the guides I choose (line length, word/line/letter spacing, size, etc). One can apply these same guides to lettering.\n\n"
    },
    {
      "time": "7 May 2009 — 8:42pm",
      "content": " **Chris said:**  \n_One is a one-time use, the other is a repurposing of a modular system of movable elements._\n\nYes!\n\n**Aegir said:**  \n_If I’m setting type on a computer, that’s typography, right? What if I draw my own ampersand to go with it? I’ve lettered the ampersand, but now it’s done I can treat it like type. Is the whole thing now lettering, or typography?_\n\nWell, I would call that typography and lettering.\n\n"
    },
    {
      "time": "7 May 2009 — 7:17pm",
      "content": "\"Just because two terms have a complex somewhat overlapping and relationship with feedback loops doesn’t mean that conflating is going on.\"\n\nI love polysyllabic banter : )\n\nMichael\n\n"
    },
    {
      "time": "7 May 2009 — 4:35pm",
      "content": "Just because two terms have a complex somewhat overlapping and relationship with feedback loops doesn't mean that conflating is going on.\n\nAll this talk about lettering sneaking into type makes me want to point out the other side of this - when type influences lettering - which it does all the time!\n\n"
    },
    {
      "time": "7 May 2009 — 11:23am",
      "content": "okay, so if Steve Heller calls lettering 'anti-type typography', who am i to argue?\n\n[http://themoment.blogs.nytimes.com/2009/05/07/graphic-content-hand-lette...](http://web.archive.org/web/20150305115231/http:/themoment.blogs.nytimes.com/2009/05/07/graphic-content-hand-lettering/?scp=1&sq=hand-lettering&st=cse \"http://themoment.blogs.nytimes.com/2009/05/07/graphic-content-hand-lettering/?scp=1&sq=hand-lettering&st=cse\")\n\n"
    },
    {
      "time": "7 May 2009 — 8:28am",
      "content": "I agree with Tiff. Lettering isn't typography, but that wasn't what was said originally; more that typography can include lettering, when you treat that lettering like type. Unless you're going to exclude everything that doesn't involve actual wood or metal type and bits of paper from the definition of typography, you're going to end up with a bit of uncertainty here and there. If I'm setting type on a computer, that's typography, right? What if I draw my own ampersand to go with it? I've lettered the ampersand, but now it's done I can treat it like type. Is the whole thing now lettering, or typography?\n\nIs this the _free will debate_ of the alphabetic arts, or should we just decide when to refer to things as typo_graphy_ or as being typo_graphic_?\n\n--  \nAegir\n\n"
    },
    {
      "time": "7 May 2009 — 2:27am",
      "content": "Good to know Darrin.\n\nMichael\n\n"
    },
    {
      "time": "6 May 2009 — 9:39pm",
      "content": "My apologies. Initially the previous comment seemed intelligent. On reflection, I see that it was a oversimplified restatement of previous comments.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150305115231/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "6 May 2009 — 7:33pm",
      "content": "Computers as tools for design have complicated this topic beyond all reason.\n\nIt's all a matter of perspective.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150305115231/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "6 May 2009 — 6:06pm",
      "content": "@ Michael:\n\n<cite>\"Maybe it is like reading... we do not read individual letters, rather we read words. I guess what I am saying is look at the whole.\"</cite>\n\nActually, this has been put to rest within the scientific community. We do not read word shapes. We do indeed read individual letters to recognize words. The \"parallel processing model,\" or some variant thereof, is by far the theory best supported by experimental evidence.\n\nKevin Larson of the Advanced Reading group at Microsoft posted [a very concise summary of the theories of reading](http://web.archive.org/web/20150305115231/http:/www.microsoft.com/typography/ctfonts/WordRecognition.aspx), their experimental support, and references to all the studies on the Microsoft website. It is very illuminating on the subject....\n\n"
    },
    {
      "time": "6 May 2009 — 4:02pm",
      "content": "Lettering and typography can share some usage in that they both attempt to present letterforms constructed as language and are meant to help convey content. One is a one-time use, the other is a repurposing of a modular system of movable elements. To create lettering, it takes a different kind of skill than it does to compose type. Part of this is technical in nature and part of this is a combination of skill, talent, and craft. The lettering artist can apply his skills to also be a typeface designer. A typographer can do the same but has more to learn about form creation to be successful(given he has the talent). I purposely omit the mention of tools since they have varied throughout the history of both disciplines (lettering being much older as well). Anyone has to learn the tools of his trade but learning the tools does not mean they will be applied to good end.\n\nChrisL\n\n"
    },
    {
      "time": "6 May 2009 — 3:34pm",
      "content": "Aye, I think that one could find themselves in an awkward position, suppose, looking at a [piece](http://web.archive.org/web/20150305115231/http:/www.flickr.com/photos/chardos88/2641695626/) that incorporates Avant Garde shapes w/ fabricated flourishes, wanting to say \"Hey, that's Avant Garde.\" In the case of the above link, it WAS Avante Garde before it was manipulated. As this was one of the top results running a flickr search of 'typography' I think an effort ought to be made to clarify, or attempt to prescribe, the meaning of the word 'typography'.\n\n"
    },
    {
      "time": "6 May 2009 — 3:18pm",
      "content": "Oh, to address Eric's comment, I agree that typography and lettering mean different things, in case I haven't stressed that enough. Conflating the terms is wrong, especially if merely as a result of the word 'typography' sounding more impressive than 'lettering'. It's just that the boundaries are not clear-cut. It's possible to distinguish typography and lettering, while at the same time acknowledging all the grey areas.\n\n"
    },
    {
      "time": "6 May 2009 — 3:04pm",
      "content": "I'm all for permissive rather than prescriptive use of language. Most of us here know what we would call typical, unambiguous examples of typography or lettering. Then there are all sorts of borderline cases as beautifully illustrated above. The disciplines have influenced each other plenty since the invention of type. With technological advances type is more and more able to imitate lettering, and in turn lettering may be used as elements in a typographical treatment.\n\nAs Miss Tiffany has pointed out, typography is itself a broad term, so there's more room for confusion. I think rather than try to rigorously define the terms for all situations, we should clarify what we mean by the different terms only when the need arises, and even then concede there are nebulous areas.\n\n"
    },
    {
      "time": "6 May 2009 — 3:00pm",
      "content": "I agree with Michael. 'Typography' and 'Lettering' are separate entities. I think that portfolios call 'lettering' 'typography' because 'typography' has a sense of prestige imbued in it and 'lettering' sounds kind of kindergartner-ish.\n\nUsing type as a model for lettering does not make 'lettering' 'typography', that would be a misnomer. I think the easiness/popularity of outlining type and manipulating causes one to forget that the process of manipulating individual letterforms is lettering.\n\n-Eric MacLeod\n\n"
    },
    {
      "time": "6 May 2009 — 1:28pm",
      "content": "Oh crap... I am now on the list of prolific posters. Now I am a moving target.\n\nBye\n\nMichael\n\n"
    },
    {
      "time": "6 May 2009 — 1:25pm",
      "content": "I understand your frustration Paul. It has been a bugaboo for many people and this thread has been a great dialogue. It points up the many points of confusion. As you said earlier, I too don't pay much attention to the verbiage. I just snicker and go about pleasing my clients as opposed to worrying about the arguments at hand. Just keep producing fonts of the quality of Zaner. Keep your head down and the mouth shut : ) Save the energy for your genius!\n\nMichael\n\n"
    },
    {
      "time": "6 May 2009 — 1:19pm",
      "content": "bring it on!\n\n"
    },
    {
      "time": "6 May 2009 — 1:16pm",
      "content": "so i guessed right. whew!\n\nit's typo-lettering\n\n\\>^p\n\ni think part of my problem is that in my mind 'typography' refers more specifically to text typography. but it's a nebulous mess in there, so i won't delve further. thanks for your insights, guys!\n\n"
    },
    {
      "time": "6 May 2009 — 1:13pm",
      "content": "Two unpublished analogue fonts that are cut and pasted in photoshop with the rubbing dropped out. Minor alterations were done. So where does it stand now that you know that.\n\nMichael\n\n"
    },
    {
      "time": "6 May 2009 — 1:17pm",
      "content": "’but sometimes typography does include some lettering. no?’\n\nNow wait a minute , are you saying I fell short in the design by it not being more nuanced? I coming to get you : )\n\nMichael\n\n"
    },
    {
      "time": "6 May 2009 — 1:09pm",
      "content": "@ Michael\n\ngood example of how boundaries can be blurred. i'm assuming this is a font (typography) that has some OT goodies that emulate lettering. so a bit of both...\n\nif this were purely lettered by hand, i would expect the letter shapes and fitting to be a bit more nuanced.\n\n"
    },
    {
      "time": "6 May 2009 — 1:03pm",
      "content": "James, in the strictest sense of what a lettering artist and a typographer does, I don't disagree. But, my argument is that typography is no longer just about movable metal.\n\n"
    },
    {
      "time": "6 May 2009 — 1:03pm",
      "content": "Paul\n\nLettering or typography? And forget the illustrative quality of the piece.\n\n ![](http://web.archive.org/web/20150305115231im_/http:/typophile.com/files/Ye_6414.png)\n\nMichael\n\n"
    },
    {
      "time": "6 May 2009 — 12:52pm",
      "content": "FWIW, when I think of a lettering artist I think of a person that can take a board and a brush and produce a convincing sign with a variety of styles.\n\nWhen I think of a typographer I think of someone that can set a solid page of type and also choose a page size and type block size with good margins, make the type fit to a grid with a very good measure, and accommodate every possible scenario an editor might produce from about any sort of manuscript.\n\n"
    },
    {
      "time": "6 May 2009 — 12:42pm",
      "content": "okay i can see your stance now, tiff. and i _almost_ agree :^D\n\ni think that in some cases lettering can be almost typographic in nature and when used together with actually type: sure i can lump that all together as typography.\n\ni guess my problem is that i usually think of lettering as something more lively and less bound by a typographic structure. but as everyone else has said there are continua (i've never used that word before!) with these things so that the boundaries and definitions overlap. i'll concede your point.\n\n"
    },
    {
      "time": "6 May 2009 — 12:42pm",
      "content": "Here's one that creates more mud.\n\n ![](http://web.archive.org/web/20150305115231im_/http:/typophile.com/files/3507677805_199e5fbb3e_6417.jpg.jpeg)\n  \n( [Original by Alejandro Paul](http://web.archive.org/web/20150305115231/http:/www.flickr.com/photos/17849178@N00/3507677805/sizes/m/))\n\nThis uses type and I'd qualify it as being more illustrative than typographic.\n\n"
    }
  ]
}
