{
  "id": "57716",
  "title": "Monoline Sans-Serif with Ligatures",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello all,\n\nAlthough I frequently browse through these forums my contribution to them is still scarce. But I enjoyed making this 'typeface' so much I wanted to share it with you. Hopefully you can give me some feedback to improve it.\n\nIt's a monoline sans with quite a few (discretionary) ligatures, it was inspired by the ligatures in Avant Garde Gothic (alternates). It misses optical correction and inktraps at the moment and that will cause 'darker spots', might address those in the future.\n\nThank you!\n\nAttachments;  \n_monoline\\_sans\\_serif\\_ligatures.pdf_ shows the original design  \n_monoline\\_alice.pdf_ updated letterforms and ligatures per 05/13/2009\n\n| Attachment | Size |\n| --- | --- |\n| [monoline\\_sansserif\\_ligatures.pdf](http://web.archive.org/web/20150415075201/http:/typophile.com/files/monoline_sansserif_ligatures.pdf) | 116.11 KB |\n| [monoline\\_alice.pdf](http://web.archive.org/web/20150415075201/http:/typophile.com/files/monoline_alice.pdf) | 117.02 KB |\n\n",
  "author": "neverblink",
  "time": "6 May 2009 — 4:26am",
  "uid": "21134",
  "comments": [
    {
      "time": "6 May 2009 — 10:52am",
      "content": "Your work is interesting. This, because it has, for example the fact of particular ligatures which are not very common.  \nIn my opinion, there are some ligatures that are working better than others.  \ns\\_a and s\\_o are better than s\\_c and s\\_e.  \nDespite the fact the first pairs I've mentioned need a bit of optical correction as regards to their connections (a more fluid curve), they are much better than s\\_e for example.  \nThis one is a bit forced yet, I mean, the sharp edge of the \"e\" is not working ok with the meeting. Maybe you should make \"e\"'s eye smaller, so the curve of the connection with the s should be longer.  \nI also think \"g\" should have a curve instead of that sharp part you are including on its tail. Your type is very curvy, the \"g\" is not following that parameter yet.  \nWell, hope this helps!  \nBest! and good luck!\n\nLián Types.-\n\n"
    },
    {
      "time": "6 May 2009 — 11:48am",
      "content": "The f- ligatures are most graceful of all in terms of structure (though they might need more spacing between the ligated letters). I agree that the g's tail needs rethinking.\n\nThis is a funky idea and I think if you can get it to work you'd wind up with a pretty interesting font.\n\n"
    },
    {
      "time": "7 May 2009 — 1:00am",
      "content": "Thank you both for your comments.\n\nThe s\\_c and the s\\_e do need some work. I believe the s\\_e can be saved, but am not sure of the s\\_c. I'm afraid it will keep looking like an s\\_e. Here are some alternatives to the s\\_e;\n\n ![](http://web.archive.org/web/20150415075201im_/http:/typophile.com/files/monoline_sevens_5536.jpg)\n\nI is the original, II has a more fluid curve without making the eye of the e smaller, III is a more fluid curve with a smaller eye & IV is a curvy e where I tried to maintain the same size eye as the original — I think I like option IV the most but am not sure if it is too big a difference from the normal e.\n\nThis 'hard' g is actually an alternative I had drawn at a later stage, I liked it more than the curvy, original g. But this was before I added a lot of the ligatures which changed the overall feel of the font. Here are both;\n\n ![](http://web.archive.org/web/20150415075201im_/http:/typophile.com/files/monoline_magemagic_5937.jpg)\n\n"
    },
    {
      "time": "7 May 2009 — 2:22am",
      "content": "Here are two more iterations of the curvy g\n\n ![](http://web.archive.org/web/20150415075201im_/http:/typophile.com/files/monoline_magemagic2_5675.jpg)\n\n"
    },
    {
      "time": "7 May 2009 — 9:37am",
      "content": "_Ok, I'll promiss this will be my last post of the day ;-)_\n\nHere's the complete alphabet (did away with the sharp corners on the N/v/V/w/W/z/Z).\n\n ![](http://web.archive.org/web/20150415075201im_/http:/typophile.com/files/monoline_abc_5742.jpg)\n\nAnd a test to see if the s\\_curvy-e ligature and the two-story a work.\n\n ![](http://web.archive.org/web/20150415075201im_/http:/typophile.com/files/monoline_seashore_3641.jpg)\n\n"
    },
    {
      "time": "13 May 2009 — 9:35am",
      "content": "I added a new pdf (monoline\\_alice.pdf) to the original post.\n\nChanges made since first pdf;\n\na - added two-story a, will keep original as alternative  \nb/q - removed kickstand/ear  \ng - curvy tail, option IV of two posts up  \ne - is now curvy, will keep original as alternative  \ny - redrawn to a more regular design\n\nto do;  \n- Add more space in s\\_\\* ligatures  \n- Widen small caps O  \n- Tighter small caps U\n\n"
    },
    {
      "time": "20 May 2009 — 10:10am",
      "content": "My friend,  \nive just been watching the pdf, and got to this conclusion:  \ns - needs adjustment on its superior left part, i mean, i can see a sharp connection of it with the middle part.\n\nt- has too much base. Maybe you should make it more \"condensed\", less base. the word you use: contemptuous, shows it: the inferior part of that t is giving kerning problems as a result.\n\nligature b\\_r has a similiar problems (the s problem), it still needs to be softer, i can see a sharp connection when it curves abruptly to ligate the r.\n\nSame with g\\_r, the g has a little sharp mountain on its top, be careful.\n\nAs regards the curvy e, and its ligatures, they are better! But, also make it a bit more fluid.  \nThe e, (the new one) should be more fluid on that new part of the eye.\n\ny- looks pro! congratulations, that one is very well done ;)\n\nBest, and good luck!\n\nLián Types.-\n\n"
    },
    {
      "time": "16 Jun 2009 — 6:52am",
      "content": "Thank you for the kind words and pointers I will look into all of them.\n\n"
    }
  ]
}
