{
  "id": "57727",
  "title": "\"How to catch a star\" Oliver Jeffers book - what font is it?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "What is the font used for the body copy inside the Oliver Jeffers book \"How to catch a star\"?\n\nMany thanks\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 11.png](http://web.archive.org/web/20100121180435/http:/typophile.com/files/Picture%2011_8.png) | 209.13 KB |\n\n",
  "author": "<a href=\"/web/20100121180435/http://typophile.com/user/35700\" title=\"View user profile.\">mcfee</a>",
  "time": "<br>",
  "uid": "35700",
  "comments": [
    {
      "time": "",
      "content": "Hi Vicky,\n\nthat looks like [FF Kosmik](http://web.archive.org/web/20100121180435/http:/www.fontshop.com/fonts/downloads/fontfont/ff_kosmik_ot/) by [Erik van Blokland](http://web.archive.org/web/20100121180435/http:/typophile.com/wiki/Erik%2520van%2520Blokland).  \nF\n\n"
    },
    {
      "time": "",
      "content": "Good spot Florian. That's one of the first times i have seen that font come up as a question here. I have always liked it, and especially the way it can flip forms in printing -- a very clever design from pre-OpenType days.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "_it can flip forms in printing_\n\n... like Beowulf – LettError’s type magic.\n\n"
    },
    {
      "time": "",
      "content": "Yes. Very ingenious. I have Beowolf too.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Yes Mike, I’m fond of Kosmik’s look, too. And yes, it pops up way too seldom here, for my taste!  \nF\n\n"
    },
    {
      "time": "",
      "content": "That's great thanks for finding the font guys.\n\nWhat does it mean \"flip forms in printing\", I've not come across that term before?\n\nThanks again\n\nVicky\n\n"
    },
    {
      "time": "",
      "content": "Being not all that familiar with programming and stuff it was the first time I realized that fonts on a computer are software when I came across Beowulf. There is a randomness built into the font that makes a glyph look slightly different every time it appears in a text when being printed - this to achieve an analog touch.\n\nfrom LettError:  \n_PostScript allows the designer to build a font program that modifies, changes or switches letterforms. Beowolf is the first font (1989) we build with a randomisation routine. All points on the contour of a (fairly) normal typeface are given a space in which they can freely move. So instead of each letter having one fixed form, the shapes move and wobble. Every single letter this typeface will print will be unique. If characters are repeated in a text they will have different shapes._\n\nKosmik works different – with contextual alternates (OpenType). Read about it - [here](http://web.archive.org/web/20100121180435/http:/www.letterror.com/foundry/kosmik/index.html)-.\n\nThere might have been a PS version of Kosmik once that worked like Beowulf, but I don’t know for sure.\n\n"
    },
    {
      "time": "",
      "content": "Vicky, in addition to what Jan said:  \nHave a close look at your sample, especially double characters as in ‘all’, ‘well’, ‘Books’. There are different forms (glyphs) for one and the same character.\n\n"
    },
    {
      "time": "",
      "content": "\"\"There might have been a PS version of Kosmik once that worked like Beowulf, but I don’t know for sure.\"\n\nYes there was, and I have it. It was simpler in implementation than Beowolf, because I think there were three versions of each (or certain) letter(s), and it rotated them as they appeared in the printing. It doesn't do it on-screen, as I recall.\n\n- Mike Yanega\n\n"
    }
  ]
}
