{
  "id": "57747",
  "title": "Lettering & Type Design",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "As there has been a lively and interesting discussion started by Paul on Typography & Lettering, I thought I would start a more controversial topic. I will probably have to board up my windows and move the family interstate to be safe, but...\n\nDo those who have a solid and complete historical knowledge and technically skilled background in hand lettering make the best type designers? My observation would point to an answer of a very strong, yes!\n\n",
  "author": "<a href=\"/web/20090511185127/http://www.typophile.com/user/3349\" title=\"View user profile.\">Graham McArthur</a>",
  "time": "<br>",
  "uid": "3349",
  "comments": [
    {
      "time": " 6.May.2009 6.07pm",
      "content": "Why? I’m not necessarily disagreeing. I am curious to read a more thorough statement of your reasoning.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090511185127/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 6.May.2009 6.15pm",
      "content": "I am more interested in other peoples opinions than spouting mine, but your question is a good one and valid. I will post my thoughts a little later.\n\n"
    },
    {
      "time": " 6.May.2009 6.19pm",
      "content": "A link to the T&L discussion would be interesting.\n\n"
    },
    {
      "time": " 6.May.2009 6.36pm",
      "content": "I think that designers with a background in hand-lettering make great types that look hand-lettered. I wouldn’t say that they’re so great at making type that looks like type. Slimbach and Stone are masters of both, but I get the impression that they would be great type designers even without the calligraphic skills.\n\n"
    },
    {
      "time": " 6.May.2009 6.40pm",
      "content": "although some of the greatest typeface designers have also been master lettering artists, i would say that your statement is not necessarily true.\n\n"
    },
    {
      "time": " 6.May.2009 6.47pm",
      "content": "In the past, wasn’t calligraphy the way into the business? So as the old guys are revered and considered the “best” – perhaps it’s too soon to judge the greatness of those who went straight to the computer and skipped that stage?\n\n"
    },
    {
      "time": " 6.May.2009 7.14pm",
      "content": "A sponge is as good as a stick. Sometimes better than a pencil. Eventually it all gets turned into digital outlines. Where you start is where you start. Who cares where you start. What matters is where you finish.\n\n"
    },
    {
      "time": " 6.May.2009 7.57pm",
      "content": "When you say “hand lettering” I assume you’re referring to natural media.  \nHowever, making letters with vector tools is every bit as much hand lettering, whether one is manipulating a stylus, mouse, trackball or trackpad.\n\nBut what’s so natural about “natural” media anyway?—all media is manufactured unless it’s a sponge or a stick.  \nSo the most natural way to work today, according to the precept of truth to materials, is to use digital tools for digital media.\n\nIt might seem there’s not much truthiness in making chirographically-informed letter shapes by stringing together BCP outlines, but by the same token, the punchcutting that started this whole affair was equally removed from the brush and the quill.\n\nNonetheless, Peter Schoeffer was a scribe before he became the first punchcutter.\n\n_What matters is where you finish._\n\nRight!\n\n"
    },
    {
      "time": " 6.May.2009 9.07pm",
      "content": "Nick: “What matters is where you finish.\n\nRight!”\n\nI couldn’t agree more. I am trying to stay out of this for a little while as I don’t want to lead anymore than I already have.  \nI will say that hand lettering is not restricted to a particular tool. As Nick says, what matters is where you finish. However, even Nick returns to the old hand lettering is hand writing tag and slotting ’lettering’ into brush or pen made ’hand writing’. The long time and experience hand letters here will understand me when I say it doesn’t matter what the tool is; brush, pen, stick, chalk, finger, nose, stone, chisel, clay, glass, straw, sponge, cardboard, computer, etc, etc and on & on for ever. Nor does it matter that the letters were originally carved, scratched, written or drawn on paper or directly on a computer screen, or pissing in the sand.\n\nThe tool of choice is not the point, nor does it matter how it was constructed, nor that the type face shows a ’hand made’ look. Nor is it about exalting or damming the past. My point is that those who have well developed hand skills and a complete working knowledge of the history of letterform construction and have developed an understanding of what can be physically achieved with the tools of their craft, produce more aesthetic, functional, practical and useful type design. Its about aesthetic, knowledge and practical skill. Type design is a craft whose content is substantially dependent on practical skill, and whose intention is discovered through the process of making the object. This requires tacit knowledge, a knowledge very different to that required to learning a computer program.\n\n"
    },
    {
      "time": " 6.May.2009 10.10pm",
      "content": "_However, even Nick returns to the old hand lettering is hand writing tag and slotting ’lettering’ into brush or pen made ’hand writing’._\n\nI don’t think that’s what I said.\n\n_...those who have well developed hand skills and a complete working knowledge of the history of letterform construction and have developed an understanding of what can be physically achieved with the tools of their craft, produce more aesthetic, functional, practical and useful type design._\n\nIsn’t your reasoning a bit circular Graham? — along the lines of “people who know how to make good fonts are the best people to make good fonts”.\n\n_This requires tacit knowledge, a knowledge very different to that required to learning a computer program._\n\nWhy don’t you consider the knowledge of how to create glyph outlines with vector drawing tools to be “tacit”? The process involves making shapes by manipulating a hand tool. How is this categorically different from pen or brush on paper?\n\n_Type design is a craft whose content is substantially dependent on practical skill..._\n\nWacom and FontLab are the tools of my craft.\n\n"
    },
    {
      "time": " 7.May.2009 6.43am",
      "content": "James\n\n“I wouldn’t say that they’re so great at making type that looks like type.”\n\nI am not sure that I understand where this statement came from. There would I assume be countless lettering artists, calligraphers etc. who might look at you dumbfounded by that.\n\nWhat is your definition of type please : )\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 7.18am",
      "content": "Tools, tools, tools, why is it always about the tools. Most people can learn to operate tools—how many can make something worthwhile out of it? I can say that my first job was as a laborer in building construction but that makes no difference in what I do now.\n\nZapf started out retouching photos for catalogs. Charles Ives started as an insurance agent...\n\nChrisL\n\n"
    },
    {
      "time": " 7.May.2009 7.24am",
      "content": "Me, I started as a brain surgeon... got tired of the music in the O.R. : ) and took up callographus.\n\nTo this day I use my scalpel to fix typos.\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 7.29am",
      "content": "At the risk of flames from the calligraphers, here’s my take: as a general rule it’s not about the skill of your hand, but of the skill of your eye. If I’m not mistaken, many of our best type designers, including Matthew Carter, are not particularly skilled calligraphers.\n\nI’m sure that skill in handling a pen and brush can only be a big help. And it is probably a necessity for developing faces that are close to hand written letters, such as Michael’s excellent type faces. But there are too many great type designers who are not calligraphers to view hand skills as a necessity.\n\n"
    },
    {
      "time": " 7.May.2009 7.35am",
      "content": "I remember several younger type designers stating they never scetch out anything on paper but draw right in FontLab or whatever (Kris Sowersby for example). This doesn’t necessarily mean they couldn’t hand letter or do calligraphy but it sure sounds like it.\n\n"
    },
    {
      "time": " 7.May.2009 7.53am",
      "content": "Seek cover William... here it comes... just kidding : )\n\nYou make great points. But I think the crux of this argument is in James’ hands. Unwittingly I think he has pointed to what I have suspected for a long time about the vast majority of perceptions on this site. I am not going to tip my hand yet, but there are clues to bias and prejudices in his statement. And not that I think they are erroneous, just different perspectives. Don’t jump off the deep end James, I am trying to get to a point... and I AM NOT ATTACKING YOU.\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 8.08am",
      "content": "_I don’t think that’s what I said._\n\nThats how I read it. Apologies if I misinterpreted.\n\n_Isn’t your reasoning a bit circular Graham?_\n\nNot really, but taken out of context of the whole post, possibly. I was saying that those with a sound back ground in traditional & historical methods of developing & constructing letterforms with traditional hand tools produce better type design than those who by-pass or merely glance at this rich history. There are many here on typophiles who denounce and ridicule the past (and the pen) and quite obviously have limited knowledge & understanding of the value in acquiring such knowledge and developing traditional skills.\n\n_Why don’t you consider the knowledge of how to create glyph outlines with vector drawing tools to be “tacit”? The process involves making shapes by manipulating a hand tool. How is this categorically different from pen or brush on paper?_\n\nI thought I made it very clear that it doesn’t matter what the tool is, nor how the letters are constructed. Vector or pencil makes no difference to me. The point I was making is that the skills and knowledge gained through intelligent study and practical hands on making of letterforms using traditional tools and methods is a very different set of skills and knowledge than that gained from by-passing the origins of our craft and beginning with helvetica, beziers and Fontlab.\n\nNick, do not forget what you bring to your wacom and fontlab. I have seen your work, there is informed knowledge and understanding of the craft of letter making inherent in it. You did not gain that knowledge or drawing ability via the wacom & fontlab only. It was already ingrained before fontlab was created.\n\n_Wacom and FontLab are the tools of my craft._  \nAs they are mine, along with the pencil, quill, steel pen, brush, chisel, sponge, stick......\n\n"
    },
    {
      "time": " 7.May.2009 8.35am",
      "content": "Jan\n\n” This doesn’t necessarily mean they couldn’t hand letter or do calligraphy but it sure sounds like it.”\n\nSuch a pity. I just reviewed a font for someone and there were problems, big problems and believe it or not they were all solvable if the artist had for once picked up a pen and understood branching, even a teeny bit.\n\nSleepy but right on, Graham!!!!!\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 8.44am",
      "content": "<cite>What is your definition of type please : )</cite>\n\nSorry, that post lacked specificity. I was referring to type in the sense of typefaces not modeled on written letters. For example, I can’t think of many great grotesques or didones by great calligraphers. But, as I noted before, there are obvious exceptions, such as Messrs. Slimbach and Stone, and now that I think of it Carl Crossgrove.\n\n"
    },
    {
      "time": " 7.May.2009 9.07am",
      "content": "_At the risk of flames from the calligraphers, here’s my take: as a general rule it’s not about the skill of your hand, but of the skill of your eye. If I’m not mistaken, many of our best type designers, including Matthew Carter, are not particularly skilled calligraphers._\n\nI’m sure that skill in handling a pen and brush can only be a big help. And it is probably a necessity for developing faces that are close to hand written letters, such as Michael’s excellent type faces. But there are too many great type designers who are not calligraphers to view hand skills as a necessity.\n\nNo flames from me. I think your right in that its not about the hand (nor the tool), but about your eye, discrimination and judgement.  \nMatthew Carter took an internship at the Enschedé type foundry when he left secondary school. He started with punchcutting and he worked as a freelance lettering artist for several years. Although he now works on computer (like all of us) he has a knowledge base that is steeped in the history of printing, punchcutting, lettering and type design. He actually learnt these skills on the job doing real work. This acquired knowledge shows in his type design and his type faces reflect his deep understanding.  \nIt is easy to see the obvious traits of the hand in some so called ’calligraphic fonts’, but it takes a knowledgeable and trained eye to spot them in some others. It is also possible to see in many favoured designs a lack of informed understanding.\n\n"
    },
    {
      "time": " 7.May.2009 9.34am",
      "content": "James\n\nCheck out the typefaces by Werner Schneider, Fritz Poppl, once again Zapf, Roger Excoffon, Aldo Novarese, Jose Mendoza, etc. There are many others but that is not the point. Edit:Schneider Libretto is one of my favorites.\n\nWhy are Didones and Grotesques considered “type” and say Zaner is not because it is a hand influenced face and not suitable for text in an annual report... or is that the real point? Titling is just a “subset?”. A bastard child, ’cause I really think Zaner is functional, beautiful and highly usable, as type. Remember James, I am just trying to get to a point of understanding and not railing against the machine.\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 10.21am",
      "content": "I think that people who have a background in hand lettering have a thorough understanding and feeling for lettershapes — through experience — I think that such knowledge can be beneficial for designing type.\n\nI don’t know if this makes them better at it _per sé_, but I can imagine that drawing type might be less naturual/efficient for people who _do not_ have this understanding. In other words, I think it can help. :)\n\n"
    },
    {
      "time": " 7.May.2009 11.18am",
      "content": "For clarity I think it should be pointed out that hand lettering is not calligraphy. I’ve done a lot of hand lettering in my day, but never any calligraphy.\n\n"
    },
    {
      "time": " 7.May.2009 11.48am",
      "content": "Graham; _...those with a sound back ground in traditional & historical methods of developing & constructing letterforms with traditional hand tools produce better type design than those who by-pass or merely glance at this rich history._\n\nJust to stir the pot, I would suggest the opposite is true, that being so heavily invested in the past is likely to produce designs which are technically and aesthetically adept, but conservative at the least, if not stale.\n\nAnd that’s the state of most script fonts today.  \nJust search “script font” at Veer, and see if you don’t end up in the 1950s.  \nAnd at FontFont, the majority of “handscripts” are rough and vernacular.\n\nThe exception is graffiti styles, eg [Highground](http://web.archive.org/web/20090511185127/http:/www.fulltimeartists.com/Fonts/FontMenu.htm), where you at least make it to the ’70s. Although a spray can may not be considered a “traditional hand tool”!\n\nSo, the old guys can do authentic truth-to-materials scripts, based on their drawing skills in traditional media, but they don’t have a contemporary vibe. While the young guys can draw up a storm with mad Illustrator skills (and mimic retro styles), but can’t originate new script styles of any sophistication, because they have never put in 1,000s of hours working with traditional media.\n\nHouse Industries and Font Diner position themselves squarely as retro outfits.\n\nWhere are the new script typefaces with elegant rendering, that would be anachronistic if transported to the past?\n\nTo start the ball rolling, Patrick Griffin’s [Memoriam](http://web.archive.org/web/20090511185127/http:/new.myfonts.com/fonts/canadatype/memoriam/).\n\n"
    },
    {
      "time": " 7.May.2009 12.59pm",
      "content": "@James\n\nJohn Downer. Roxy.  \nJim Parkinson. Balboa.\n\n"
    },
    {
      "time": " 7.May.2009 4.06pm",
      "content": "“which are technically and aesthetically adept, but conservative at the least, if not stale.”\n\nGee thanks Nick. I called P22 and they are pulling all my scripts off the site : )\n\nOh and thanks James M. I sometimes forget that some don’t realize this. It too presents its own set of of definitional problems.\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 4.21pm",
      "content": "On built-up letters vs writing. I think that if you can do letters with Beziers, you can do built-up letters on paper, and visa versa. You might not be as quick as somebody practiced, but it’s basically the same thing, I think. I was talking about skill in writing with pens or brushes in a continuous stroke. That’s the skill I was saying may be very helpful, but not a necessity for designing type—unless, as James P. said above, the script is immediately derived from such writing.\n\nAs to fresh looks in scripts, I’m very impressed with [Olicana](http://web.archive.org/web/20090511185127/http:/new.typographica.org/2008/typeface-reviews/olicana/) being fresh and different, as well as excellent.\n\n"
    },
    {
      "time": " 7.May.2009 5.00pm",
      "content": "Have at it William... I’ve been telling you for months to take up the pen : ) (Oh to be a fly on the wall) Tee hee\n\nSeriously though I think they are different skills. And as has been said above they can inform each other. Both are monkey skills...LOL\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 5.03pm",
      "content": "I’m late coming into this set of discussions, but thought I’d chime in a bit.\n\nI don’t think its necessarily useful to make generalizations of various peoples skills via their background. I do think the typographic criteria of anybody’s design is going to reflect their training, interests, natural talent, etc. If you’ve developed a skill with the broad-edged pen your eye will also be trained to recognize good form that is calligraphically based. Of course that works both ways. If you are a lettering artist and have reworked your letters digitally a lot, sometimes you learn to coax letters out of your pen that your hand was not ready for before.\n\nType designers that cut their teeth on modern sans serifs or grunge type are going to have a different eye for type and will work with whatever tools get the job done even though ultimately its all digital these days (except maybe folks like Dan Carr). I look at a lot of type and handlettering, but also tend to go in directions that evolve from my own background.\n\n«Where are the new script typefaces with elegant rendering, that would be anachronistic if transported to the past?»\n\nHow do you define contemporary script? Contemporary to a lot of graffiti artist these days seems to include a loose use of broad-edged lettering as well. Very rough unpolished lettering is very popular these days as handcrafted DIY movements flourish. I suppose that can make more skillfully rendered scripts seem anachronistic today, but they seem to fit segments of the market. I like some of the fifties scripts as well, but tend to not do a lot of that myself. I think we are all invested in the past to some degree. A lot of contemporary sans faces are based on older type but designed with digital use more in mind.\n\nI like that people come from all sorts of influences to type design these days. It brings a richer variety of type to the world.\n\n"
    },
    {
      "time": " 7.May.2009 7.30pm",
      "content": "Nick  \n_Just to stir the pot, I would suggest the opposite is true, that being so heavily invested in the past is likely to produce designs which are technically and aesthetically adept, but conservative at the least, if not stale._\n\nI am not advocating living in the past at all. I am not advocating copying the past at all. I am advocating that all type designers should study the history and development of letterform construction and to become at least familiar with, if not competent with the tools of their trade (including vector). The type designer needs two broad areas of knowledge: the knowledge of familiarity and the knowledge acquired through doing and making. The knowledge of familiarity is grounded in experiencing sensations; it is knowledge that is gained through the senses. A simple example is the smell of coffee. The only way one gets to know the smell of coffee is to smell it. No amount of description can give someone an understanding of what it is to experience the smell of roast coffee. Some would call it a connoisseurship or an aesthetic, either way, it is exceedingly valuable. I would argue it is essential. Not only in the connoisseurship of tasting food & wine, or in the connoisseurship of art/craft attribution, but in connoisseurship of diagnosis. It is quite surprising just how much diagnosis depends upon connoisseurship. The engineer, mechanic or type designer has a much need to acquire the familiarity of problems through his or her senses as a doctor. The way an engine sounds or the way a mechanism responds to the touch are revealing only to the knowledgeable engineer.  \nThe other area of knowledge needed is know how. The ability to get the job done. This is a physical process involving the physical handling of the medium. Understanding is gained through doing and making, not through theory. Theory has over taken practical knowledge and craft knowledge has been replaced with novelty and the gimmick.\n\nDebates about ’merit’ only make sense within an agreed system of values. Some times I wonder if talking or writing about the merit of a particular typeface in the context of contemporary Western typography and type design at this stage in our history is now a meaningless exercise. There is no agreed framework of values and consequently there can be no real connoisseurship; there are just private opinions publicly expressed and jostling for attention. So much of the anti-handcraft conventions and opinions of contemporary type design are so ingrained that it takes a considerable effort to question them.  \nThere are so many erroneous assumptions, myths and prejudices touted about craft knowledge to make any serious discussion impossible. Here on typophiles it is assumed that if you dare to pick up a pen or even acknowledge a liking to serifs you will become irresistibly, as though beguiled by Sirens into a never to be free entrapment of a souless, expressionless, conservative and stale world or archaic madness.\n\nIt is my belief that the anti-craft knowledge prejudices are mistaken; that type design benefits from a traditional approach, which recognizes that process and content are interdependent; that craft knowledge itself enriches individual experience and becomes a part of the self that is expressed in the final design.\n\nIf you are looking for conservative and stale, look at almost every sanserif design post Helvetica.\n\n"
    },
    {
      "time": " 7.May.2009 8.05pm",
      "content": "Oh my God, I think I am going to weep. Thank you Graham.\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 8.32pm",
      "content": "“If you are looking for conservative and stale, look at almost every sanserif design post Helvetica.”\n\nI have looked and I don’t see what you see at all. What is different now is shear volume. There are thousands more faces coming out each week and many by less than stellar designers. This is only because the technology of our day allows it. Prior to the 90s, you had a much greater investment required and you had to convince a foundry to produce your design. There is a respectable percentage of very good work coming out today, however. Even if you throw out all the crap and pirated works of today, there still is more good work done now than in any other time in history. That is not to say that there is more talent around today, it just means that there is more opportunity given by digital technology—along with the chaff commeth the wheat and sometimes even the wheat germ. We have planted many more acres of seed so we have more to harvest and more trash to clean up afterwards.\n\nChrisL\n\n"
    },
    {
      "time": " 7.May.2009 9.01pm",
      "content": "“I have looked and I don’t see what you see at all. What is different now is shear volume.”\n\nShear volume and in a lot of instances very little variation and creativity.\n\n“more trash to clean up afterwards.”\n\nI agree. And possibly I have added to the pile.\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 9.13pm",
      "content": "I don’t think the variation and creativity now is any less than any comparable time in history. Frankly, much of the lack of variation today is do to copying older designs. There is a tendency for excessive nostalgia. This may be just fear of failure. There has been some quality work out of this but it has not been original work. It is very difficult to be original if you rely too much on past forms as a models. We have to be willing to accept a high degree of failure to have any chance at originality. I say fire away in any way you wish without concern for fitting into a form reference and take your chances. You will see more originality and certainly more failure but you don’t have success without risk. If you follow old forms with skill you stand a good chance of making type which most will find beautiful. You won’t, however, stand a good chance of being original. Risk is the mother of invention and fortitude to push on is the father.\n\nChrisL\n\n"
    },
    {
      "time": " 7.May.2009 9.16pm",
      "content": "You have not added to the pile by any means, Michael. Besides, trash can be a good thing sometimes.:-)\n\nChrisL\n\n"
    },
    {
      "time": " 7.May.2009 9.20pm",
      "content": "“Frankly, much of the lack of variation today is do to copying older designs.”\n\nI agree and that what I was saying.\n\nGood points Chris.\n\n“trash can be a good thing sometimes.:-)” Not when you can’t get the wife to take it out : } I have to cook and take out the trash.\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 9.24pm",
      "content": "That is why my wife makes me empty it ;-)\n\nChrisL\n\nPS: just to move this below Michael’s post where it started\n\n"
    },
    {
      "time": " 7.May.2009 9.27pm",
      "content": "Chris\n\nCan you come down to Richmond and get me out of the trash can... she put those rubber bungies on the trash can again and left me out here... my laptop battery is going dead!\n\nMichael\n\n"
    },
    {
      "time": " 7.May.2009 9.44pm",
      "content": "Good points Chris. I think a great part of the problem is that many people can not tell good from bad or innovation from novelty. It is not only the old faces that get copied. The new stuff gets reconstituted regularly as well. This, I think, is due to the lack of craft. Without craft they have no knowledge of where to look to find solutions to the problem, nor do they have a base from which to build or to experiment from. Coupled with knowledge of only one tool, they are restricted in choice, they have to copy because that is all they can do. Hence, a slightly adjusted shape becomes the latest “innovation” ergo: 23, 789, 365, 812, 002 and counting, variations of helvetica, all equally ugly as the last.  \nThat reminds me, I have to take out the trash.\n\n"
    },
    {
      "time": " 7.May.2009 10.14pm",
      "content": "Graham, I’m no fan of Helvetica, but we must be living on different planets.  \nThe amount of well crafted, original type designs, in every genre, has sky-rocketed since 2000.  \nThe bar for new typefaces is now incredibly high: multi weight, OpenType features, extended language support.  \nAnd yet a remarkable number of such faces are released every month.  \nSure, there is a lot of dubious stuff at MyFonts, that’s what happens when no vendor is turned away.  \nBut look at FontShop, and check out Typographica’s “Best of 2008”.\n\n"
    },
    {
      "time": " 8.May.2009 3.52am",
      "content": "Nick, we could well be living on different planets. It often feels like a different planet in the land downunder :)  \nI would like to think that you are right, but I don’t see it that way.  \nYes the bar is set high, however many fall short, most by a long way. My opinion of course.\n\nI subscribe to the FontShop newsletter and a number of others, plus I visit quite a few sources on a daily basis.  \nI have had a look at Typographica’s Best of 2008. Typographica is a favourate place to visit.  \nBut I must say that most of the type in their best for 2008 reinforces my point of view.  \nWhile the sheer volume of type has increased and continues to grow, I think that the percentage of the very best remains about the same.\n\n"
    },
    {
      "time": " 8.May.2009 7.27am",
      "content": "@ Graham\n\n_Do those who have a solid and complete historical knowledge and technically skilled background in hand lettering make the best type designers? My observation would point to an answer of a very strong, yes!_\n\nYou would say yes! Your observation is bound to be at least tinged with the presumption that hand-lettered forms are the best forms, and those that design with this model are inevitably the best designers. I’m not sure you (or anyone else for that matter) are able to be objective when answering this question. All you’re doing is stating your preference.\n\n_There are so many erroneous assumptions, myths and prejudices touted about craft knowledge to make any serious discussion impossible._\n\nThe erroneous assumption you have made here is that everyone’s idea of the best designer is the same. (Your top 10 designers will no doubt be completely different from mine).\n\nHere’s an observation of mine: Some feel the need to fight the corner of handwriting as if it weren’t able to do so itself. Are you afraid that some people think that what you love is a bit dull and not that relevant any more, like all those 23,789,365,812,002 cuts of Helvetica, a few of which _I_ quite like?\n\n"
    },
    {
      "time": " 8.May.2009 8.05am",
      "content": "@Michael,\n\nI’ll be down just as soon as I can figure out how to get the deadbolt open that she clamped on me! :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.May.2009 12.06pm",
      "content": "@ Chris\n\nAre our wives evil twins: )\n\nMichael\n\n"
    },
    {
      "time": " 8.May.2009 3.32pm",
      "content": "If you want to see some really good 21st century drawing, check out this kid’s high school science project: [Asten](http://web.archive.org/web/20090511185127/http:/www.tdsb.on.ca/wwwdocuments/about_us/media_room/docs/ASTEN.pdf)\n\n"
    },
    {
      "time": " 8.May.2009 4.15pm",
      "content": "Yup, just your average high school kid, alright :-)\n\nChrisL\n\n"
    }
  ]
}
