{
  "id": "57785",
  "title": "MF Geometro Pro OT",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all,\n\nI collected my courage (as we say that in Holland) and I posted my font here.  \nIt's my first some kind of Sans-Serif-Display-OpenType font, based on circles and rectangulars and other shapes. Most drawn with FontCreator (my previous font maker program).  \n&nbsp;  \nHere's an (older) image, which I made with Illustrator at school:\n\n ![](http://web.archive.org/web/20150414162304im_/http:/typophile.com/files/geometro_4120.PNG)\n\nI've made a little test specimen, which I added in my attachment. Not all glyphs are listed, but it contains Latin, wide range of accented letters, Greek, Cyrillic, Small Caps and more.  \nI think I need to get InDesign somewhere and learn how to use, because PowerPoint (2007) can't access my OpenType glyphs and alternates, etc.\n\nPlease note:  \n- I'm 15 years old, so big way to go and enhance.  \n- Never had any lessons on type designing.  \n- My first \"meeting\" with FontLab Studio.  \n- My first OpenType project.\n\nThanks for your replies!\n\nKind regards,  \nMartijn van Berkel\n\n| Attachment | Size |\n| --- | --- |\n| [SpecimenBeta.pdf](http://web.archive.org/web/20150414162304/http:/typophile.com/files/SpecimenBeta.pdf) | 396.87 KB |\n\n",
  "author": "Martijn van Berkel",
  "time": "7 May 2009 — 2:22pm",
  "uid": "38279",
  "comments": [
    {
      "time": "8 May 2009 — 2:21am",
      "content": "Hey Martijn,\n\nNice to see you getting into font-design at such a young age. For a first attempt this looks really nice, and certainly very complete!\n\nThere are a couple of points I'd like to address, but they all seem to have the same origin; you following your grid very strictly (something I do too sometimes). But as you said you purposly based this design on geometrical forms, so I guess they are not really _flaws_. And all I will suggest to take a good look at how a font like Century Gothic (also based on geometrical shapes) sometimes breaks the grid a little to make sure there is not too much negative space between the glyphs, ensuring everything fits together a bit better.\n\nSucces ermee!\n\n"
    },
    {
      "time": "8 May 2009 — 9:51am",
      "content": "Hi Martijn,\n\nI agree with Wouter above me, nice that you're exploring type design at your age. How did you get interested in it? Anything in particular?\n\nI also think that you should 'let go of the grid' in certain situations. I understand that geometry is the basis of your design, but ultimately it all comes down to how it _looks optically_. You'll see that well known geometric typefaces, like Avant Garde or Futura aren't actually completely geometric.\n\nFor example, the strokes of the bowls in those typefaces taper when they meet the stem (where the rounds meet the straights the lines get thinner), to make sure that no 'black blobs' appear. That's one of many details you can use to make sure everything looks balanced.\n\nAnother thing you should probably take a look at are the dimensions of certain characters; some of them are very wide, while others are too narrow. This is probably also something that you can solve by letting go of the grid. For example:\n\nlowercase:  \n- The f is too wide on the top  \n- The h is quite wide (so the m, n and u as well)  \n- The ear of the r is also very wide  \n- The s is too narrow, and the spine (the middle part) could be a bit more smooth  \n- The t is too wide  \n- The v, w and z are probably also slightly too wide\n\nuppercase:  \n- The top bowl of the B should be slightly narrower, so that they are optically equal. As you can see now, the top bowl looks larger than the bottom one, eventhough they are the same size.  \n- A, H, M, U, W, X, Y, Z are too narrow  \n- L is too wide  \n- S spine again could be a bit more smooth\n\nnumbers:  \n- 3 top should be smaller, it now looks larger eventhough it isn't  \n- 4 the crossbar (horizontal) should probably come down  \n- 5 the bottom part should be larger / top is too high  \n- 8 same as 3, top probably too large, make them optically the same\n\nI would just take a look at Futura, and the dimensions of its characters in relation to each other. Not to copy them, but to learn from.\n\nVeel succes! :)\n\n"
    },
    {
      "time": "8 May 2009 — 2:28pm",
      "content": "Lol, it seems like I have to improve very much. xD\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "9 May 2009 — 8:58am",
      "content": "\\> Lol, it seems like I have to improve very much. xD\n\nWelcome in the wonderful world of typeface. Always redo the work to try to do better than before. ;^)\n\nDo not discourage you, put away for a while and see it later with new eyes, you will see lots of thinks that you would not see at the first sight. Keep going.\n\n"
    },
    {
      "time": "11 May 2009 — 4:27pm",
      "content": "You don't have to improve anything if you don't feel like it. :P\n\nAnd yes, you have much to learn, as do I and probably most type designers. ;)\n\n"
    },
    {
      "time": "11 May 2009 — 5:24pm",
      "content": "Greek support? Greek SMALL CAPS support? Oldstyle numerals in a geometric sans-serif? Case sensitive forms? Stylistic alts?\n\nRegardless of the actual letterforms, can anyone even name a HANDFULL of professional fonts with the same features?\n\n15? Let me know when you turn 21, because I'll personally buy you a beer!\n\n"
    },
    {
      "time": "12 May 2009 — 4:00am",
      "content": "Quincunx: I will improve most of the things you mentioned, but those ears of the \"r\" and the \"f\" i.e., I think they give some unique style to Geometro. But to not dissatisfy you, I will include alternates of them. Maybe I'll put those f's and r's with big ears in a alternate, perhaps that give it a more accesible sans look. :)\n\nDanGayle: Thanks for your reply, and you don't have to wait that long, because in the Netherlands you are allowed to drink beer from 16 years old. ;)\n\nThe font is of course not finished. I already discovered some missing glyphs (accented \"y\"'s and \"w\"'s) and some artifacts in some glyphs. I will do my best to make a nice, for me first, professional font. :)\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "12 May 2009 — 6:13am",
      "content": "I'm confused about the cedillas. I was sure that most of them (all but ÇçŞş) were supposed to be comma-accents instead. That's how they're described in Fontlab. But I opened up the character map and took a look at some system fonts and sure enough they all had them as cedillas. Is there a consensus on this?\n\n"
    },
    {
      "time": "12 May 2009 — 9:19am",
      "content": "cerulean: Examples of all glyphs to be drawn where shown in FontCreator (in Arial), so I created my glyphs based on those examples. Should I replace all but ÇçŞş with comma accents?\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "12 May 2009 — 4:35pm",
      "content": "I finally had the sense to check the [Unicode pages](http://web.archive.org/web/20150414162304/http:/www.unicode.org/charts/PDF/U0100.pdf). G, K, L, N, R all have cedillas; I'm going to have to correct this in my own fonts. Since so many people use Fontlab, I wonder how often this happens. For S and T, _both_ exist; make sure they're in the right codepoints. Though I get the impression that Romanians always use the cedilla codepoints and expect to see commas there anyway. Such are the trials of we, the obsessive-compulsive...\n\n"
    },
    {
      "time": "23 May 2009 — 2:07am",
      "content": "Ah Holland! So progressive! :-)  \nWell done!\n\n"
    }
  ]
}
