{
  "id": "57787",
  "title": "looking for some some nice Script faces with alternate, swash and ligature functions?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey guy's.\n\nI'm on the hunt for some scripts particularly ones that have good swash and alternate functions. I've had a gander around at the usual foundry's and found a couple, but not nearly as many as i expected. I was wondering wether there might be a foundry or designer that specializes or dedicates to this style of typography?\n\nI've attached something from my travels that interest's me and is kinda what i'm after from MYFONTS.COM (Mon Amour Script Pro) but would be nice to find something not so commercial or exposed shall we say.\n\n ![](http://web.archive.org/web/20131023071940im_/http:/typophile.com/files/24200_3754.png)\n\nAny help from you wonderful people would be muchly appreciated as always.\n\nWith Kind Regards  \nLuey\n\n",
  "author": "francis bold",
  "time": "7 May 2009 — 2:42pm",
  "uid": "30066",
  "comments": [
    {
      "time": "7 May 2009 — 2:53pm",
      "content": "You're looking for what are known colloquially as \"Ale Paul\" fonts. [http://www.sudtipos.com](http://web.archive.org/web/20131023071940/http:/www.sudtipos.com/)\n\n"
    },
    {
      "time": "8 May 2009 — 11:57am",
      "content": "Nice link dan, couple in there i really like but not quite there. I'm working on my next tattoo which will be all typography so being very picky with the choice of typography chosen.\n\nNeed to make sure I've left no stone unturned in exploring potential faces.\n\nThere must be so many more out there just gotta find them!\n\n"
    },
    {
      "time": "8 May 2009 — 12:26pm",
      "content": "Check [Burgues Script](http://web.archive.org/web/20131023071940/http:/www.sudtipos.com/fonts/97)\n\nSee [Tattoo 1](http://web.archive.org/web/20131023071940/http:/www.flickr.com/photos/17849178@N00/2091387707/) or [Tattoo 2](http://web.archive.org/web/20131023071940/http:/www.flickr.com/photos/17849178@N00/2740075122/) as references.\n\nBest,  \nA\n\n"
    },
    {
      "time": "8 May 2009 — 12:48pm",
      "content": "Hi Joe,  \nif it is for a tattoo, why does it have to be a font then? What you need is a lettering artist!  \nF\n\n"
    },
    {
      "time": "8 May 2009 — 3:45pm",
      "content": "I agree with Florian. I would never use a typeface for a tattoo, hire a lettering artist!\n\n"
    },
    {
      "time": "10 May 2009 — 7:00am",
      "content": "Doesn't necessarily need to be a font, I intend to only use the face as a structure and add my own embellishment and decoration. But I like the idea of using a word artist!\n\nLast tattoo i designed for myself was based on 15 century renaissance penmanship so will be looking for a style to contrast this.\n\nSo when you say word artist you mean the people in the tattoo parlor or people that just do word art only?\n\nappreciate the input!\n\n"
    },
    {
      "time": "11 May 2009 — 4:23pm",
      "content": "I meant a lettering artist, someone who does it for a living. But I've seen tattoos with some great lettering that the tattoo artist did himself/herself.\n\n"
    },
    {
      "time": "11 May 2009 — 4:54pm",
      "content": "[Poetica](http://web.archive.org/web/20131023071940/http:/www.linotype.com/1351/poetica-family.html)\n\n"
    },
    {
      "time": "11 May 2009 — 11:48pm",
      "content": "At Linotype, we just released [Libelle](http://web.archive.org/web/20131023071940/http:/www.linotype.com/5866/libelle.html), a new design by Jovica Veljovic. I don't know if an 18th century copperplate script is the direction that you are looking for. But it would offer quite a contrast to a 15th century Renaissance hand! Also, the font has a number of alternates that you could play with.\n\n"
    },
    {
      "time": "13 May 2009 — 4:04am",
      "content": "OK cool Quin i'll check that out. The last two suggestions on faces are delightful! Dan i really think you hit it on the button with this Libelle! Indeed it would sit well next to 15th century Renaissance hand. Defiantly one i shall add to the short list.\n\nThis is going better than i thought. I'm still really interested to hear any ones else's thoughts or personal favorites off scripts they have or know off or indeed any good references of word art that you have come across?\n\nI have been planning this in my head for some time now, kinda itching now to get started with it!\n\nThanks Guys\n\n"
    },
    {
      "time": "14 May 2009 — 3:15pm",
      "content": "This was found on Flickr. Really Really like this and is the style i am trying to achieve with my design. My penmanship is some what non excitant shall we say. so it begs the question is there a font out there that has any resemblance to this at all?\n\nI know a lettering artist could have this done in no time, but i really want to have a crack at the whip myself first.\n\n ![](http://web.archive.org/web/20131023071940im_/http:/typophile.com/files/Picture10_6361.png)\n\n"
    }
  ]
}
