{
  "id": "5779",
  "title": "SoCal Waves Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a pro bono logo (Is that enough O's, or what?) for a senior national league baseball team. I know this isn't the typical baseball look, but I think it captures the Southern California personality and the energy of sports. Once I started designing the logotype, I started thinking that this was a job for Andrew Baker, but I put my head down and plowed forward.   \n   \nI welcome any critique ya'll are willing to offer.   \n   \n ![SoCal Waves Logo](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/41456.jpg)   \n   \nMahalo!   \nScott\n\n",
  "author": "squeeze",
  "time": "26 Jul 2004 — 6:23pm",
  "uid": "2236",
  "comments": [
    {
      "time": "26 Jul 2004 — 6:40pm",
      "content": "overall, great job, scott.   \n   \ni definitely think the top right one works best witht he regular S.   \n   \nIt seems like the lines coming of the V should be thicker towards the V and get thinner towards the end like they are now. If that doesn't work, maybe just the lines like you have in the lower right would work best . . .   \n  \nIt also seems like the ball is too straight up in the air, i think it would look better if it were at more of an angle tilted right--the \"ERN\" of southern also looks crowded and squished together (moving the ball angle could also solve that)\n\n"
    },
    {
      "time": "26 Jul 2004 — 9:27pm",
      "content": "hi scott   \n   \ni like this a lot, i agree with sally on the V, i think the wavy effect you try to put on the S you should try to include it on the top right one on the V.   \n   \nfor me southern california is ok, but the vertical stem on the E of WAVES seems to need a little work.   \n   \nnice one though, i am visualizing the uniforms on the senior guys. ;-)   \n   \nCG\n\n"
    },
    {
      "time": "26 Jul 2004 — 9:54pm",
      "content": "hey scott --   \n   \n(sometimes i wish there was an option to edit comments already posted!)   \n   \nafter looking at your logo a second time, these are my revised comments . . . (i apologize for my somewhat fickle opinion in this case, but it might turn out to be beneficial (my first comment was my initial reaction; the second comments are after studying the logo a bit more . . .)   \n   \nAnyway, the bottom right logo is the one i think is best.   \n   \nAlthough I didn't notice it right away (which is why i didn't initially prefer the curvy S), i like the wave shape the S completes . . . it might work better if you have the blue lines meeting directly with the red. The lines look akward as part of the V, I did a little fiddling and they look even more akward making them transition from thicker to skinny, so i would suggest the detached line.   \n   \nI still think the ball should have more of a slant to the right and that the end of \"southern\" is scrunched.   \n   \nWell anyway, i guess that's my 4 cents. ;)   \n   \nIn any case, i do love the direction of this logo.\n\n"
    },
    {
      "time": "26 Jul 2004 — 10:08pm",
      "content": "What if you had the blue hairline meet a thick S in a \"standard\" clockwise wave shape? Just defining that curl and turning it downward might look nice.\n\n"
    },
    {
      "time": "27 Jul 2004 — 5:44am",
      "content": "Will the logo always say Southern California with the word Waves. I know most baseball team logos typically only use the name of the mascott on there jersey's,ex Giants, Mets, Braves. Maybe it could be nice to do an SC emblem for a hat or something. I guess my point right know is that the logo feels a little congested, Especially where the ball comes out of the V. There might also be some kerning issues in the word Waves. I'm sure your are probably been teeking it like crazy. IMPO take a look at MC ESCHER and Victor Vaserely for some fine art inspiration on how to maximize the potential of the curves to create the best optical effect.\n\n"
    },
    {
      "time": "27 Jul 2004 — 6:37am",
      "content": "I fail to see why the upper curve of the S should end in a very thin line. The same goes for the part of the V, meeting with the S. To me, it's decoration without purpose (and it may cause production/application problems in the future.   \n   \nThe lines coming out of the V shouldn't touch the ball -- I think it would look much nicer, if you could see the ball as a circle. To give you a hint about what I mean: if I were to make the correction in Illustrator, I would place a circle with white fill under the ball, cropping the red lines. The lines should be cropped approx as much as the distance from E to the line growing out of the V.   \n   \nOtherwise, I think it looks great!   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "27 Jul 2004 — 9:09am",
      "content": "Great suggestions! I will definitely apply a lot of them. These are some very valid critiques. Unfortunately, the nature of pro bono work, for me anyway, is that it often takes a backseat to the jobs that are paying my bills, so I'm not sure how quickly, I will be able to post some revisions, but I'll get to it as soon as I can. Thank you all.   \n   \nMahalo!   \nScott\n\n"
    },
    {
      "time": "27 Jul 2004 — 9:53am",
      "content": "Cool - I really like it - very sportsy - me and my made up words. I would like a mixture of the upper right and the lower right - let me clarify - I like the regular S better - I think it needs the weight at the top, but perhaps you can finesse the top curve just a hair so that it ontinues the wavy feeling. For me I like the line stopping rather than connected to the V because it makes the motion of the ball stronger and keeps the word together.\n\n"
    },
    {
      "time": "27 Jul 2004 — 9:55am",
      "content": "_I started thinking that this was a job for Andrew Baker_   \n   \nI would enjoy this job! Heh, thanks for the laugh, Scott.   \n   \nSome comments...   \n   \nSome of the channels between the letters need evening. The W is leaning into the A,   \nas the V is with the E.   \n   \nThe VES in my mind needs the most work. The sightline is broken visually on the bottom of the E, and should continue flowing with the S.   \n   \nI'd open the counters of the W and A, they are pretty clogged.   \n   \nThe baseball is great. I like the implied W in it. I also like the alternate S that tapers. The problem is no other letters taper. Maybe you could incorporate this effect into other letters.   \n   \nAlso the tapered S might need to hug the guideline above it for stability.   \n   \nSouthern California possibly in a lighter weight.   \n   \nThis is so cool! I could mess with this for hours!   \n   \nAndrew\n\n"
    },
    {
      "time": "27 Jul 2004 — 10:24am",
      "content": "Some curve ideas.   \n   \n ![](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/41519.jpg)\n\n"
    },
    {
      "time": "27 Jul 2004 — 11:08am",
      "content": "fun logo! I especially like the large cresting wave with SOCAL surfing on it. And Andrew's comments are dead on, with one exception: I think you should keep the cresting wave, the suggestion sketch looses that and seems more like a big flying V. However, the relationship between the letters on the sketch is a nice improvement. Before it seemed like the E was getting ready to eat the S. Maybe the wave should be more of a curving in wave (ie: Ocean Spray logo - see below) than doing a little flip out at the end. Finally, consider not making the taper on the underline and the S so severe, it seems too delicate for what the logo is for. Looking forward to seeing your revisions. I'll be waiting with my peanuts and CrackerJack.   \n   \n ![oceanspray](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/41532.jpg)\n\n"
    },
    {
      "time": "27 Jul 2004 — 1:53pm",
      "content": "Scott, I love the direction your're taking, expecially with the lower two.   \n   \nIt was already mentioned, but the hairline feels too thin, and the top of the \"S\" could use some more substance to aid in \"reading the wave.\"   \n   \nI would also like to see the \"E\" meet the \"S\" in a more friendly way- to me that transition is a bit harsh. (And you might consider softening some details in the other letters as well).   \n   \nI agree with David, that it might feel more like a baseball team logo, without including the \"SoCal\" in all versions - having a simplified version for typical use.   \n   \nI've included a logo that I came across a while back. I think it's a Japanese baseball team, but I wish I could remember more. I seem to remember something about surfrider or tsunami. anyway, I thing you could benefit from seeing this. The 3 Dimensionality really catches my eye.   \n   \n ![SurfRider or Tsunami](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/41547.jpg)\n\n"
    },
    {
      "time": "4 Aug 2004 — 3:08pm",
      "content": "Thank you all for your great commentary. I've been working on implementing some of the suggestions you have made\n\n"
    },
    {
      "time": "5 Aug 2004 — 7:58am",
      "content": "Sorry Scott the red graphic doesn't make a W to me. Its nice looking but I don't think the team will get it. I like the WAVES and how its used on the uniform.\n\n"
    },
    {
      "time": "5 Aug 2004 — 10:05am",
      "content": "This is coming along great. I prefer the first logo where the wave is implyed but not illustrated. However, the 's' in waves still doesn't seem quite right, and unfortunately I can't quite put my finger on what's not working about it. The shirts look terrific and I agree with Daniel that the 'W\" on the hats isn't clear. Perhaps the hat should have the ball and the \"W\" then if people see the big W it's a plus. Almost like finding the stolen money in \"It's a mad, mad, mad, mad world\" - it's under the big W\n\n"
    },
    {
      "time": "5 Aug 2004 — 11:25am",
      "content": "Wonderful work, Scott. I like the logos and jerseys, not sure about the cap.   \n   \nMy 1/2 cent. :-)   \n   \nSharon\n\n"
    },
    {
      "time": "5 Aug 2004 — 1:23pm",
      "content": "Scott, I think the S needs some work. WAVE is primarily angles, and the S is all curves. and if you wont taper the other letters, why taper the S? All the other letters hug the baseline but the S. THe gaps need to be filled between the E and S.   \n   \nThe ES is very open, while WAV is very congested.   \n   \nThe E is way too dominant. V should be more important i think.\n\n"
    },
    {
      "time": "5 Aug 2004 — 1:59pm",
      "content": "Daniel: Don't apologize. I was questioning that \"W\" in my last post. I was hoping to hear some feedback regarding it (thank you Kirsten and Sharon also). I think I'll develop an SC logo to replace it.   \n   \nAndrew: Do want to just take this over for me\n\n"
    },
    {
      "time": "5 Aug 2004 — 2:14pm",
      "content": "I agree with Andrew. I wish the negative spaces in general were considered a bit more. The line on top on the word waves seems a bit odd(not sure what it means)   \n   \nAn off the wall suggestion about the logo in general would be this: Right now the Wave is not in a aggressive position. Consider designing the word so that it is coming at you as if you were sitting on the beach and a tidlewave was about to pummle you. I feel like the logo in general is not aggressive enough. It might feel a little flat. Think Tsunami/TidleWave, not casual beach wave.... Just a thought. The W on the hat could also benefit from a perspective change.\n\n"
    },
    {
      "time": "5 Aug 2004 — 2:19pm",
      "content": "I also feel like the W in \"Waves\" would look better on the hat than the one presented.\n\n"
    },
    {
      "time": "5 Aug 2004 — 4:04pm",
      "content": "David: The line above \"WAVES\" is intended to help define/identify the crest of the wave. I tried working without it, but the shape of the wave becomes less obvious. I don't think I can change the perspective of the \"W\" on the hat because it is taken from the trail of the baseball in the logo and I don't want to lose that association\n\n"
    },
    {
      "time": "6 Aug 2004 — 6:18am",
      "content": "Scott, I feel your frustration with the S. Your extra effort will pay off though. Its a pretty slick logo. It just needs some rework.   \n   \nHere's another idea.   \n   \n ![](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/42203.jpg)\n\n"
    },
    {
      "time": "6 Aug 2004 — 6:45am",
      "content": "Hi Scott,   \n   \ndid you consider to use a more squarish 'S' ?   \n   \nAll the other characters used in the word WAVES are made up of straight lines.   \n   \nGreetings,   \n--Jacques\n\n"
    },
    {
      "time": "6 Aug 2004 — 7:35am",
      "content": "good morning Scott,   \n   \nI've been thinking about this logo. Perhaps you should try a less modified 's' and work on the 'es' relationship. Attached is a sketch (hope that's ok) which i think will clarify what I'm trying to say. The top one is more of an unmodified 's' with the 'e' being altered to meet the 's' and fill in some of the awkward space (pretty much just reiterating Andrew's original comments/sketch). Ignore middle sketch. The bottom one is basically the same with a cutting of the bottom curve of the s to help continue the flow of the baseline wave. Hopefully this will spark an even better idea from you. Just a few final tweeks and you'll have a home run.   \n   \n ![waves](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/42211.jpg)\n\n"
    },
    {
      "time": "6 Aug 2004 — 1:26pm",
      "content": "Maybe its just my monitor, or maybe I'm just daft, but to me it looks like there is a little inconsistency in the weight of the letters of SOUTHERN CALIFORNIA - I know its somewhat part and parcel with the perspective and wave, but it makes a couple of those letters feel a little cramped.   \n   \nLike you want to deal with that. Have you considered really making the swoosh of the ball an actual w by cutting out a piece from the point so that it has two tails? It might ruin the effect, but if they taper enough it might still give the feel of the swoosh trail of the ball and capitalize on the almost w going there.\n\n"
    },
    {
      "time": "7 Aug 2004 — 9:47am",
      "content": "I think it would make more sense to have the ball going with the wave. This would allow you to comfortably place southern california above it. I think you are adding too many elements having a ball come up through the wave because the two actions don't go together.   \n   \n ![](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/42314.jpg)\n\n"
    },
    {
      "time": "7 Aug 2004 — 9:55am",
      "content": "Or even make the lettering integrate with the ball like this:   \n   \n ![](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/42317.jpg)\n\n"
    },
    {
      "time": "7 Aug 2004 — 10:01am",
      "content": "Or this:   \n   \n ![](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/42321.jpg)\n\n"
    },
    {
      "time": "7 Aug 2004 — 10:07am",
      "content": "Here is another idea. I would use a more sporty playful font. Your font doesn't look like it is having fun riding the wave (ex. this logo is more of the style I would shoot for [http://store1.yimg.com/I/classicpins\\_1800\\_95331705](http://web.archive.org/web/20131023123538/http:/store1.yimg.com/I/classicpins_1800_95331705) )   \n   \n ![](http://web.archive.org/web/20131023123538im_/http:/www.typophile.com/forums/messages/29/42324.jpg)\n\n"
    },
    {
      "time": "8 Aug 2004 — 4:46am",
      "content": "What I like about what Tom has suggested is the W almost looks like a baseball mitt\n\n"
    },
    {
      "time": "9 Aug 2004 — 6:32am",
      "content": "Good solution on the S too.\n\n"
    },
    {
      "time": "9 Aug 2004 — 7:24am",
      "content": "The only thing is it feels as if the ball is traveling backwards - that feels slightly off - I like that it matches the curve, but I think now it has lost some of the dynamicsim - like a pop fly that you want to try and catch. Possibly the ball could follow the curve through W-A-V but then over shoot it just a bit to be both the pop fly and also somewhat surfing on the crest - does THAT make any kind of sense? I wouldn't want to ruin the feel of it, but I think keeping the vertical element - at least somewhat - captures excitement.\n\n"
    },
    {
      "time": "9 Aug 2004 — 2:23pm",
      "content": "It is a simple thing to remedy. Reverse the direction of the wave so that the ball can be on the right side (big \"w\" to a small \"s\")\n\n"
    },
    {
      "time": "9 Aug 2004 — 2:34pm",
      "content": "Scott, nice work so far, and the thread has   \nbeen very ... wavy.   \n   \nBenjamin, the wave logo upthread ...   \nthat was for the Surfrider Foundation,   \ndone by our very own Dylan Menges.   \n   \n [http://www.customartco.com/](http://web.archive.org/web/20131023123538/http:/www.customartco.com/)\n\n"
    },
    {
      "time": "10 Aug 2004 — 6:43am",
      "content": "Wow, Dylan made that.   \n   \nIts a nice mark.\n\n"
    },
    {
      "time": "11 Aug 2004 — 8:06am",
      "content": "Thanks for pointing that out BJ. Great stuff Dylan.   \n   \nI can picture Tom's idea working with the ball travelling the opposite direction (Good Idea), but I think I would miss the energy created by the \"pop fly\" version.   \n   \nHaven't heard from Scott in a while... He's probably got something in the works that is going to blow all of us away.\n\n"
    },
    {
      "time": "11 Aug 2004 — 10:52am",
      "content": "\"I think I would miss the energy created by the \"pop fly\" version.\"   \n   \nThe problem with the energy from \"pop fly\" is that it competes with the energy of the wave. It is too much and it is better to join the two movements into a single sporty fun movement.\n\n"
    },
    {
      "time": "11 Aug 2004 — 2:21pm",
      "content": "Hugh If you were the left fielder and saw that logo you wouldn't feel its going backward\n\n"
    },
    {
      "time": "29 Sep 2004 — 8:26am",
      "content": "Aloha!   \n   \nI didn't abandon this project, but in a sense it abandoned me. I was in that holding period, when you're waiting for your client to get back to you (feedback) to help you determine where to go before you invest too much time in a wrong direction, and you'll never believe what happened\n\n"
    },
    {
      "time": "5 Aug 2004 — 2:53pm",
      "content": "Scott, could the spaces in between the letters, especially W-A-V?   \n   \nI think the S is too tricky.   \n   \nDo you need that shape in the V on the shirt? It feels almost like a mistake.\n\n"
    },
    {
      "time": "5 Aug 2004 — 3:03pm",
      "content": "Didn't finish my thought. Oops!   \n   \n\\> Scott, could the spaces in between the letters, especially W-A-V?   \n   \nBe parallel? Even?\n\n"
    },
    {
      "time": "5 Aug 2004 — 4:09pm",
      "content": "perhaps the waves in between the letters aren't working because of the wave that is running perpendicular to it. waves that hit perpendicular cancel each other out. :^) i'd just focus on the word following the larger wave. as for the S i would go back to the orginal and use it, or at least draw an S that looks like it belongs to the other letters instead of trying to have it doing something conceptual.\n\n"
    }
  ]
}
