{
  "id": "57801",
  "title": "Typography Schools / Graduate Studies?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI'm new here. I've been hunting google for information regarding Graduate Studies in Typography but I am able to find very little. I was wondering if anyone knew of a list of Typography Programs or Typographic Educations? I live in Canada - any programs within Canada?\n\nThanks a lot,\n\n",
  "author": "Jp King",
  "time": "7 May 2009 — 9:09pm",
  "uid": "44413",
  "comments": [
    {
      "time": "7 May 2009 — 9:11pm",
      "content": "Hi, I might have already found my source on this very site:\n\n[http://typophile.com/node/12011](http://web.archive.org/web/20130907230438/http:/typophile.com/node/12011 \"http://typophile.com/node/12011\")?\n\n- If anyone else has anything, it'd be greatly appreciated\n\nthanks!\n\n"
    },
    {
      "time": "7 May 2009 — 11:49pm",
      "content": "There is an \"Advanced Typography, Communication and Ideation Design\" program at Langara College. The director is Dr. Shelley Gruendler, a close friend of mine. This isn't a master's program, but Shelley went to Reading and so you can assume the precedent has been set.\n\n"
    },
    {
      "time": "9 May 2009 — 9:59am",
      "content": "Great link King.\n\nBeen here for a few years now and I never knew that existed. Thanks.\n\nWhere did you do your undergrad?\n\n"
    },
    {
      "time": "9 May 2009 — 12:27pm",
      "content": "[NSCAD University, Master of Design program](http://web.archive.org/web/20130907230438/http:/nscadesign.ca/graduate.html).\n\n"
    },
    {
      "time": "9 May 2009 — 4:51pm",
      "content": "If you are willing to go to Europe there is also Reading, and KABK in Holland.\n\n"
    },
    {
      "time": "27 Sep 2009 — 5:32pm",
      "content": "The Universidad de Buenos Aires also has a new Master's in Type Design (Especialización en Diseño de Tipografía). In Ale Paul's interview with MyFonts, he said it started in 2009, but the information I've received from the University seems to indicate that the program doesn't start until 2011 (tho maybe it was founded this year?). I'm currently living in Buenos Aires, and I'm definitely looking at enrolling in 2011—it seems to have a stellar faculty, as well.\n\nThe info is in Spanish, but: [http://www.posgradofadu.com.ar/informacion.php?f=carrera\\_fundamentos&tipo=2&id=207](http://web.archive.org/web/20130907230438/http:/www.posgradofadu.com.ar/informacion.php?f=carrera_fundamentos&tipo=2&id=207)\n\nIf anyone has anymore information on this program that would be amazing! I know it's brand new, so the info is pretty much limited to what's on the University website (tho that is pretty comprehensive). Also, does anyone know if UBA charges any tuition for grad programs? Or what the selection process for enrollment is? Some info says I need to submit samples of my work, whereas other info says it has totally open enrollment.\n\n"
    }
  ]
}
