{
  "id": "57817",
  "title": "First use of the @ symbol?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "For those of you who are interested in [orthography](http://web.archive.org/web/20090926143235/http:/en.wikipedia.org/wiki/Orthography), I came across this which speaks of what may be [the first known use of the @ symbol](http://web.archive.org/web/20090926143235/http:/bits.blogs.nytimes.com/2009/05/05/internet-star-least-473-years-old/). Orthographic history is really \\*not\\* one of my stronger suits, so I can’t confirm or deny this. Just thought it may be of interest.\n\n",
  "author": "<a href=\"/web/20090926143235/http://www.typophile.com/user/15065\" title=\"View user profile.\">Christopher Dean</a>",
  "time": "<br>",
  "uid": "15065",
  "comments": [
    {
      "time": " 8.May.2009 12.47pm",
      "content": "Interesting.\n\n"
    },
    {
      "time": " 8.May.2009 2.04pm",
      "content": "That was a cool story.\n\n"
    },
    {
      "time": " 8.May.2009 3.41pm",
      "content": "I thought I had read somewhere that it might have been used as early as the 6th or 7th century for ’ad’ (at, to or toward). But yeah, 1536 is pretty early. :)\n\n"
    },
    {
      "time": " 8.May.2009 9.54pm",
      "content": "I like that Christopher Dean.\n\nthanks\n\npbc\n\n"
    },
    {
      "time": " 9.May.2009 12.12am",
      "content": "That claim by Professor Giorgio Stabile of his discovery of the @ sign in a document of 1536 has been doing the rounds for years, but to be fair to the professor he doesn’t claim it in quite these terms.\n\n“One can’t say this is the first example of its use, as ancient financial institutions may have earlier examples lying forgotten in their archives,” Stabile said over iced tea in Rome’s scenic Piazza Navona. The professor discovered the document while doing research for a visual history of the 20th century, which is due to be published by the Treccani Encyclopedia. In the document a trader called Francesco Lapi describes the arrival in Spain of ships bearing treasure from Latin America. “There an amphora of wine, which is one thirtieth of a barrel, is worth 70 or 80 ducats,” Lapi wrote in his letter, sent from Seville to a colleague in Rome. “No symbol is born by chance,” Stabile said. “This one has represented the entire history of navigation on the seas and has now come to typify travel in cyberspace.”\n\nI forget where I found this fancy piece of stuff, but it is all over the Web.\n\nWhat I wonder is, how many early financial documents Stabile looked at. Italy was the home of some very sophisticated accounting practice a long time before the 16th century, and there are plenty of surviving archives that have been studied. I shouldn’t be surprised to learn that there is a symbol looking like @ in much earlier documents from one of the big trading or banking centres like Venice, Genoa, Milan or Florence. It might be worth asking one of the economic historians who read these archives.\n\nAnd I’m no palaeographer, but I personally doubt if @ has anything to do specifically with amphoras of wine. (But just a moment. Wine imported to Europe from the New World in 1536. That has to be a first.) Or with the Spanish weight called the _arroba_. The term _arroba_ is derived from Arabic, and probably dates from a long time before the _reconquista_. Maybe there is a symbol for the _arroba_ (or even the amphora) that looks a bit like @. Incorrigibly sceptical as I am, I suspect that the term _arroba_ was only recently adopted as a convenient Spanish (and French) name for a symbol that didn’t have one. If there is proof to the contrary, please let us see it.\n\nLess excited historians do indeed seem to agree that the modern @ is simply a flourished form of Latin _ad_ (at), for use in repeated lines of accounts containing phrases like “so many pounds or barrels of something at – @ – so much per pound/barrel”. Commercial documents are full of abbreviations or symbols for other Latin commercial terms like £ (capital L) for _libra_ (pound as currency), _per_ (for which we keep the Latin word), % for _per centum,_ and & for _et_. The so-called _solidus_ or forward slash (maybe a long s) for dividing shillings and pence (_solidi_ and _denarii_) is another. So we are lucky that the computer keyboard – which is a typewriter keyboard (and typewriters were designed as office machines) – was not cluttered with the symbols for more of them, like _per_, which can be quite elaborate. These symbols were made as types for commercial printing and schemes for printers’ type cases in the 19th century show them.\n\nIf it’s of interest, here is @ in a specimen of the Miller foundry in Edinburgh dated 1822:\n\n ![](http://web.archive.org/web/20090926143235im_/http:/www.typophile.com/files/Miller%20P2%20p%201822%20with%20@%20-%20500_4030.jpg)\n\nIs this a typographical first? Or are there offers of something earlier?\n\nPerhaps Dr Stötzner can tell us. [http://www.signographie.de/cms/front\\_content.php?idart=145](http://web.archive.org/web/20090926143235/http:/www.signographie.de/cms/front_content.php?idart=145 \"http://www.signographie.de/cms/front\\_content.php?idart=145\")\n\n"
    },
    {
      "time": " 9.May.2009 6.30am",
      "content": "Nice topic. The link below has a few more illustrations, including a hand-written one from 1775 and some typographical ones of the early 20th century. Some of the other signs shown are good examples of James’ point about the variety of commercial symbols in type.  \n [http://hapax.qc.ca/Pourquoi\\_arrobe\\_dans\\_10646.html](http://web.archive.org/web/20090926143235/http:/hapax.qc.ca/Pourquoi_arrobe_dans_10646.html)\n\n<cite>(But just a moment. Wine imported to Europe from the New World in 1536. That has to be a first.)</cite>\n\nWandering off topic here, but I think it’s the other way around. I believe Lapi was commenting there on how high the price was of Spanish wine when shipped to the New World.\n\n"
    },
    {
      "time": " 9.May.2009 9.28am",
      "content": "That’s a great link, and it has badly dented my scepticism. In fact it sent me to the abbreviations at the back of my big dictionary of the Real Academia Español, 14th edition 1914 (didn’t think of looking there), where @ is shown for the arroba.\n\nAnd that document of 1775, with its well-shaped @s, is impressive. It’s pretty late, though. It would be good to have more and earlier examples, from Italy, Spain, England...\n\nThe examples of typographical @ for arroba given in the link are very English or North American in appearance, as Spanish types in the 19th century often are, so were maybe made for ‘at’ and adopted for the other purpose.\n\nAnd I’d clearly misread Lapi...\n\nWell now. What about a typographical @ earlier than 1822?\n\n"
    },
    {
      "time": " 10.May.2009 4.16am",
      "content": "While the current [DRAE](http://web.archive.org/web/20090926143235/http:/www.typophile.com/wiki/www.rae.es) has the symbol in its entry for arroba, at least up until mid 1900s I couldn’t find an example of its use in the dictionary. Not to say it wasn’t used as an abbreviation before computers, in fact the entry in the DPHD makes it sound like it was used before and then simply “popularized” because of computers, but in terms of being common enough to make it into the dictionary ... doesn’t seem so.\n\n"
    },
    {
      "time": " 12.May.2009 5.00am",
      "content": "I am delighted to see Mr. Mosley respond to that. I can not offer a printed sample antedating 1822 (one can hardly beat a St. Bride’s scholar in a matter like this ;-).  \nAs for paleography, surely more investigations into old manuscript archives would have to be undertaken. 1538 is impressively early. The only hint on a possible even earlier usage I found was in a paleographers manual from Portugal (see [http://www.signographie.de/cms/front\\_content.php?idcat=143](http://web.archive.org/web/20090926143235/http:/www.signographie.de/cms/front_content.php?idcat=143 \"http://www.signographie.de/cms/front\\_content.php?idcat=143\") ). The indication of “52” at the first @ in this image means “1520 decade”. Unfortunately, no original source is specified in that booklet.\n\nIf any further research upon the @ emerges I am prepared to register it under Signographie.de/Focus.\n\nFinally, cheers to Mr. Mosley for the “Dr” Stoetzner, but I have to refuse this honouring unless a kind of “Dr occ[assionis] c[ausa]” may apply ;-) .\n\n"
    },
    {
      "time": " 29.May.2009 12.38pm",
      "content": "In _Typographical Printing-Surfaces_ (1916), Legros and Grant present the at sign and the _Arrobas_ sign as two different signs (or three if you count italic).  \nAt is the familiar @, with a plain terminal that ends on the middle of the right side of the glyph.  \nRoman _Arrobas_ has a two-story a and a taller, thinner enclosure that ends in a ball terminal below the a’s stem.  \nItalic _Arrobas_ has a one-story a and ends in a somewhat swashy thickening at the bottom of the glyph.\n\n ![](http://web.archive.org/web/20090926143235im_/http:/www.typophile.com/files/atsignlegros_3669.jpg)\n\n"
    },
    {
      "time": " 29.May.2009 3.29pm",
      "content": "Interesting. It looks like the circle of the at sign didn’t traditionally trail below the baseline until it was conflated with the arrobas.\n\n"
    },
    {
      "time": " 30.May.2009 7.23am",
      "content": "<cite>“ … the at sign and the Arrobas sign as two different signs”</cite>\n\nAn interesting sample! But I would not term it “two different signs”. It’s just \\*three different glyphs\\* and two different uses. (See also the two different glyphs for Pound at the left side.)  \nAnd this bobble terminating the tail – punchcutters game, hardly more than that.\n\nHowever, the actual intersting aspect of this sample is that an upright two-storey (at) occurs in lead type \\*at all\\*.\n\n"
    }
  ]
}
