{
  "id": "5781",
  "title": "(x) Font Outlining",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "sorry to post here, but it's the only place i could post because i'm not yet registered... but you typophiles could probably help me out with this. i know this must be pretty simple, because i see it done everywhere, but how do you add an outline to fonts? i just cant seem to figure it out. here's an example of what i'm talking about..   \n   \n ![](http://web.archive.org/web/20081104035648im_/http:/www.typophile.com/forums/messages/83/41462.jpg)   \n   \nit just seems so easy, but for some reason i cant figure it out. hopefully one of you advanced in adobe or corel can help me out, unless its easier than that!\n\n [‹ &#40;x&#41; Porsche script - custom typeface {Yves}](http://web.archive.org/web/20081104035648/http:/typophile.com/node/5816 \"Go to previous forum topic\") [&#40;x&#41; Home Helpers - Park Avenue, Cochin {Marc O} ›](http://web.archive.org/web/20081104035648/http:/typophile.com/node/5817 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081104035648/http://typophile.com/user/1203\" title=\"View user profile.\">anonymous</a>",
  "time": "<br>",
  "uid": "1203",
  "comments": [
    {
      "time": " 27.Jul.2004 12.11am",
      "content": "easy..! here one version How-To-Do-How-Do-You-Do?!   \nuse illustrator..   \n2 layers with the text.   \nCreate Outlines.. which makes the type into an object.. so be sure you have not misspelled your text!   \nLayer 1 being on top with the text white.   \n2nd Layer with text black.. and then you outline the lines and make the stroke bigger... untill you get the amount of blackness around the white text.   \nWhen you are satisfied.. use (MAC CMD + Y or WIN CTRL + Y which will take you beneath the surface if you know what i mean...) and select the \"white arrow\" and select the inner lines and delete them. Get it? Then CMD+Y up to the surface again...   \n   \nso now you have 2 layers.. Group them if you want so that they will move together into one layer.. change colour etc etc.. and then you are all spiffed!!\n\n"
    },
    {
      "time": " 27.Jul.2004 12.36am",
      "content": "[Calvin & Hobbes](http://web.archive.org/web/20081104035648/http:/homepage.mac.com/tigershark/spacemanspiff/) rule!\n\n"
    },
    {
      "time": " 27.Jul.2004 12.40am",
      "content": "You don\n\n"
    },
    {
      "time": " 27.Jul.2004 6.32am",
      "content": "You don't even need separate layers, [this thread](http://web.archive.org/web/20081104035648/http:/www.typophile.com/forums/messages/30/36819.html) right here is brilliant.\n\n"
    },
    {
      "time": " 27.Jul.2004 8.01am",
      "content": "fantastic. anyone know where i could get illustrator for free? ![:-)](http://web.archive.org/web/20081104035648im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 27.Jul.2004 8.06am",
      "content": "Hehehehe. No can do, Ryan. ![:-)](http://web.archive.org/web/20081104035648im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 27.Jul.2004 8.25am",
      "content": "Ryan all those techniques are fine but the best way is create your type, make it white and go to the appearance pallet. There is a little arrow head at the top right of the pallet, hit it and under the pull-down menu add new stroke. Move the new stroke behind your type and scale it to suit yourself. Or select the stroke and under the edit menu select offset path and you can make it any size you need. The benefit of this method is you can change the typeface and the stroke changes too. Useful with clients who change their minds.\n\n"
    },
    {
      "time": " 27.Jul.2004 8.40am",
      "content": "I have to bookmark this thread! I play with Illustrator all the time, but I don't use these techniques enough to remember them. It feels like I have to re-learn each time I need to create an effect. I know this isn't an Illustrator forum, but it's nice to get tips from the pro's.\n\n"
    },
    {
      "time": " 27.Jul.2004 11.04am",
      "content": "Daniel: Yeah, that's the technique Mark describes in the thread I linked to.. Great timesaver! You can add all the offsets and effects you want and even save the whole apperance by clicking the \"New\" button in the Graphic Styles palette.\n\n"
    },
    {
      "time": " 27.Jul.2004 4.02pm",
      "content": "My usual approach in Illustrator is to set the type I want to outline, then make a copy and paste right behind the original, then add a heavy stroke to the copy. That way you get the original letterforms plus the part of the stroke from the copy that extends outward. The easy way to get at the copy is by selecting both by dragging the selection tool over both of them, then using shift and deselecting the top one.   \n   \nWhen you've got the stroke you want, and it's time to finish up the job, choose paths/outline stroke from the object menu, then use the unite tool in the Pathfinder palette to get rid of all the inner paths that the outline stroke command creates. To really finish it off, you may want to eliminate some of the little bumps that are created, such as what you see around the top of the C of \"Spaceman.\" Makes it look more like you did the outlining yourself instead of having the program do it for you. It will take some practice to get the hang of it (especially using the pathfinder palette successfully, as it sometimes does weird things), but it's a useful skill to have.\n\n"
    },
    {
      "time": " 28.Jul.2004 10.43am",
      "content": "well... i will stick and spiff to my layers..   \nfirst i make the text in one layer and then i just drag that layer to the \"Make New Layer\"-icon and then i will get a new identical layer e x a c t l y on top of the first layer. But that's me... i have always been awkward and spiffely un-mainstream.   \ni cannot help saying that this forum rocks! you can ask almost everything and get help or learn something new..   \nsometimes the internet is a great place to be..\n\n"
    },
    {
      "time": " 28.Jul.2004 1.01pm",
      "content": "On a related subject to Illustrator, if anyone has used Illustrator CS's 3D Revolve and tried to rotate the revolve, it re-renders but I have a way around this just write me, I made a PDF with simple instructions\n\n"
    },
    {
      "time": " 28.Jul.2004 1.11pm",
      "content": "Yes the other thread where Mark describes the letter-funkyfying secret is great.   \nSome times when I start up illustrator I have to keep myself from fiddling around with the appearance palette too much. Whenever I get started on that I just go on with that like a madman and forget all about time and space. ![:-)](http://web.archive.org/web/20081104035648im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nIt is a really neat feature.\n\n"
    }
  ]
}
