{
  "id": "57841",
  "title": "Early Rounded fonts late 70's - early 80's",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi everyone !\n\nFirst of all I would like to thank ALL the people involved in making this forum what it is !  \nHere is what I'm dealing with...  \nI've been looking for ages for this rounded font I've seen on many schoolbook covers from the late 70's- early 80's. -\\_\\_\\_\\_- ...\n\nI went through Myfonts and identifonts with no results...  \n [http://wtf2.myfonts.com/uploads/images/81/81b845e4ba288cfbe7e3845a6572b4...](http://web.archive.org/web/20100607041528/http:/wtf2.myfonts.com/uploads/images/81/81b845e4ba288cfbe7e3845a6572b4fb.28613.jpeg \"http://wtf2.myfonts.com/uploads/images/81/81b845e4ba288cfbe7e3845a6572b4fb.28613.jpeg\")  \n [http://wtf2.myfonts.com/uploads/images/34/34a54a9fc16c6a2c292626b7e406fd...](http://web.archive.org/web/20100607041528/http:/wtf2.myfonts.com/uploads/images/34/34a54a9fc16c6a2c292626b7e406fd2d.34803.jpeg \"http://wtf2.myfonts.com/uploads/images/34/34a54a9fc16c6a2c292626b7e406fd2d.34803.jpeg\")\n\nYour help will be highly appreciated.\n\nThx\n\n",
  "author": "<a href=\"/web/20100607041528/http://www.typophile.com/user/44451\" title=\"View user profile.\">Antares</a>",
  "time": "<br>",
  "uid": "44451",
  "comments": [
    {
      "time": "",
      "content": "There are some similarities to Glowworm.\n\n"
    },
    {
      "time": "",
      "content": "Indeed but with Glowworm, you have that kind of shiny reflect that appear on the font. I thought the font I'm looking for belonged to the same typeface company but didn't.\n\n"
    },
    {
      "time": "",
      "content": "Any ideas please ?  \nSeems like this font is nowhere to be found but it exists though...\n\n"
    },
    {
      "time": "",
      "content": "Still no ideas ?  \nSince this font is really similar to Mecanorma's Glowworm, I'm wondering if it didn't appear in old Mecanorma catalogues. Is there anyway to access old catalogues from the 70's or 80's ?\n\nthx\n\n"
    },
    {
      "time": "",
      "content": "I have an old Mecanorma catalog and you're correct in thinking they might be Mecanorma fonts. The fonts in question are Zelek Bold and Zelek Boldline.\n\n"
    },
    {
      "time": "",
      "content": "Waoow !!  \nThank you sooo much Mark for this clarification !!! I've been loonking the name of these fonts for ages. Where can I buy these ? (if they are available). If they're not, is there any identical/similar font that has been renamed ?\n\nMany thanks !!\n\n"
    },
    {
      "time": "",
      "content": "There's another font in a different style by the same designer called New Zelek that's available from ParaType, but as far as I know these have never been digitized.\n\n"
    },
    {
      "time": "",
      "content": "It's a real pity these fonts have never been digitized... I've seen New Zelek but this font has nothing more to do with the old one...\n\nOne day maybe... Who knows... rounded fonts seems to be trendy these days...\n\nAnyway thanks a lot for your help ! I appreciated ;-)\n\n"
    },
    {
      "time": "",
      "content": "Oh bummer. That's a seriously cute font. :-(  \nIn any case, thanks for pointing out the source, Mark!\n\n"
    },
    {
      "time": "",
      "content": "Isn't this about the third or fourth time we have talked about Zelek (a.k.a. Zelda, according to Solotype)? Wired recently had a version of Zelek revived as \"Zorro\" for their magazine, as I recall.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "_Isn’t this about the third or fourth time we have talked about Zelek..._\n\nYer, but that was the twisted Zelek Black.\n\n ![](http://web.archive.org/web/20100607041528im_/http:/typophile.com/files/Mecanorma_ZelekBlack_5533.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Is it possible to purchase this \"Zelda\" font from Solotype or even the \"Zorro\" one (much more difficult I guess)from Wired magazine ?\n\n"
    },
    {
      "time": "",
      "content": "The list I have of Solotype fonts (excluding those newer ones on MyFonts.com) that were put on CDs for Dover Books does not include anything by any of these names, and the Solotype Catalog shows primarily film types, I think.\n\nMy understanding with regard to Zorro is that it was a proprietary font designed for Wired magazine, but I suppose you could write and ask.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the information Mike !\n\n"
    },
    {
      "time": "",
      "content": "Just to say that I wrote to Wired magazine and get the following answer :\n\nMany thanks for your email.\n\nUnfortunately the font is not for sale, we commissioned it only for use by Wired UK.\n\nThanks so much for your interest though and sorry not to be of more help.\n\nI really hope that one day all the zelek font family will be digitized as it should !  \nThese fonts have been requested so many times on the Internet lately.\n\nAnybody interested by scanning them from an old Mecanorma catologue and digitized them under a new name ? lol\n\n"
    }
  ]
}
