{
  "id": "5785",
  "title": "ATypI survey 2004",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.typofonderie.com/gazette/articles/atypisurvey](http://web.archive.org/web/20110812201154/http:/www.typofonderie.com/gazette/articles/atypisurvey)   \n   \nWe asked 40 ATypI members (or past members) questions and compiled their answers here. The answers are (and remain) anonymous and mixed but they do give a good impression what ATypI needs to do.   \nPlease comments there directly: [http://www.porchez.com/comments/175](http://web.archive.org/web/20110812201154/http:/www.porchez.com/comments/175)\n\n",
  "author": "<a href=\"/web/20110812201154/http://typophile.com/user/1275\" title=\"View user profile.\">jfp</a>",
  "time": "<br>",
  "uid": "1275",
  "comments": [
    {
      "time": "",
      "content": "\"The Code Morale\n\n"
    },
    {
      "time": "",
      "content": "Nigel, Avenir is not a rip-off of Futura. It is an entirely different design which any competent typographer can distinguish at a glance without any careful inspection. Sure, it's a design in the same genre, and one which some folks think is better. It's not as \"in your face\" with its geometric underpinnings, which is either a good or bad thing, depending on one's point of view.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "The \"rip off\" comment was a phrase taken from the ATypI thread.   \n   \nIn any case Frutigers own words say that it is the \"better Futura\" so while the design is obviously not identical Linotype is certainly trading off the goodwill in the Futura name by using the quote.   \n   \nNigel\n\n"
    },
    {
      "time": "",
      "content": "Then explain what is the ethical difference between Monotype's Book Antiqua/Palatino and Linotype's Avenir/Futura?\n\n"
    },
    {
      "time": "",
      "content": "Book Antiqua looks almost exactly like Palatino, was made deliberately as a Palatino clone to avoid licensing restrictions, was made while the designer of Palatino was alive and working.   \n   \nAvenir does not look much like Futura (the bowl-stem connections follow the same model, but the proportions of the letters are very different), was not made as a deliberate clone, was made after the death of the designer of Futura.\n\n"
    },
    {
      "time": "",
      "content": "I'm not touchin' this thread with a ten foot composing stick.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "John, so if the designer's dead anything goes? What about the Renner estate that receives money from sales of Futura from Neufville?   \n   \nLinotype's Basic Commercial is a clone of Akzidenz-Grotesk (again probably to avoid licensing restrictions).   \n   \nWhy come down on Monotype when Linotype does the same thing according to the ATypI Code Morale (or whatever they are going to label it now)?\n\n"
    },
    {
      "time": "",
      "content": "The item should probably have gone in the news section because JFP is asking for feedback to be posted to his own forum.   \n   \nNot sure what the point is in picking out individual comments from anonymous ATypI ex/members and criticizing them - many of them are contradictory and some are clearly misinformed - no need to check facts when your answers are anonymous.   \n   \nJFP's survey is what it is - a cross-section of anonymous opinion - which the ATypI board should probably take time to review and address. However, as someone at TypeCon suggested there's little in the survey that should come as a surprise to the ATypI board.   \n   \nHaving said that - respect goes to JFP for running the survey - which in itself shows that senior people at ATypI are willing to discuss the future of the org and not stick their heads in the sand.   \n   \nSi\n\n"
    },
    {
      "time": "",
      "content": "Look at this:   \n   \n ![samples](http://web.archive.org/web/20110812201154im_/http:/www.typophile.com/forums/messages/30/41545.gif)   \n   \nI doubt anyone but Zapf would be able to tell which of the top two lines is Palatino (I would be surprised if even _he_ could). Very few people would have trouble seeing the differences between the bottom two.\n\n"
    },
    {
      "time": "",
      "content": "Nigel, please actually look at the typefaces before you take up an argument. If you look at at Book Antiqua and Palatino, you will see that one is a copy of the other. If you look at Avenir and Futura, you will see that they are different faces. For a start, their x-heights are very different.\n\n"
    },
    {
      "time": "",
      "content": "Then why does Linotype market it as the \"better\" Futura?   \n   \nWhy not just market Avenir rather than trade of the Futura name.   \n   \nAnd do people \"not want to touch this thread\" because Linotype pays for hosting Typophile, holds \"Design\" contests and Bruno buys drinks at TypeCon.\n\n"
    },
    {
      "time": "",
      "content": "_I doubt anyone but Zapf would be able to tell which of the top two lines is Palatino (I would be surprised if even he could)._   \n   \nBased on the x, I guess that the lower line is Palatino. I would be surprised if Zapf couldn't tell, but the intent of Book Antiqua is nonetheless clearly to rip off Palatino.\n\n"
    },
    {
      "time": "",
      "content": "Avenir as Futura have similar maining, ist all about 'future.'   \nWhen you design a new typeface, as a new music or book, there is natural references to predecessors. So, when Avenir Next booklet refer to Futura is pretty useful to explain from which ground came from Avenir. No typeface came from nothing.   \n   \nAbout the ATypI survey, yes, I tried first to post that on the news, last week, but nothing happened and the news wasn't posted (perhaps due to TypeCon, the moderator find something more interesting to do :-)   \n   \nSo, there is already 3 places where that survey is discussed, well why not? The problem is more wider than ATypI itself I think and all organisations should think a bit about their future?\n\n"
    },
    {
      "time": "",
      "content": "_And do people \"not want to touch this thread\" because Linotype pays for hosting Typophile, holds \"Design\" contests and Bruno buys drinks at TypeCon._   \n   \nGood Lord. It all all makes sense now. Obviously, Hrant and Yves are afraid that Bruno will pull the plug and leave them nowhere to post. That must be it. I'm so glad I paid for my drink that night.\n\n"
    },
    {
      "time": "",
      "content": "So we can eliminate Bruno's drink buying.\n\n"
    },
    {
      "time": "",
      "content": "We can also eliminate your whole premise. Not only are the two faces different, both Avenir and Futura are marketed by Linotype. Sorry to be so dismissive, but I think this whole line of reasoning is silly. If you want to talk about imitation and copying in type design, this is not a good example.\n\n"
    },
    {
      "time": "",
      "content": "Mark   \n   \n\"Linotype's Basic Commercial is a clone of Akzidenz-Grotesk (again probably to avoid licensing restrictions).\"   \n   \nIs this not copying/imitation?\n\n"
    },
    {
      "time": "",
      "content": "Yes, that would be more analogous to the Palatino/Book Antiqua situation. I don't know what the circumstance were that led to the creation of Basic Commercial though.\n\n"
    },
    {
      "time": "",
      "content": "I think Nigel wants to see how many trolls he can get into his first ten Typophile posts.   \n   \nMark, thanks for posting the comparison images. That should have been the end of the discussion for anyone who isn't blind.   \n   \nBook Antiqua is a deliberate and acknowledged clone of Palatino. One Monotype manager described it to me as 'a moment of moral weakness' on the part of his company.   \n   \nAvenir is a new typeface in the same genre as Futura, with totally different proportions and 'colour'. Yes, Linotype are marketing it, in some respects, at the expense of Futura by making comparative statements. This wouldn't be my approach to marketing a typeface, but there's a difference between this and cloning a typeface.\n\n"
    },
    {
      "time": "",
      "content": "John wrote:   \nBook Antiqua is a deliberate and acknowledged clone of Palatino.   \n   \nMark wrote:   \nYes, that would be more analogous to the Palatino/Book Antiqua situation.   \n   \nAt least Mark has some unbiased objectivity.\n\n"
    },
    {
      "time": "",
      "content": "time for that 10 foot composing stick...\n\n"
    },
    {
      "time": "",
      "content": "\\> I'm not touchin' this thread with a ten foot composing stick.   \n   \nI don't get it, ar arh! Care to explain, Hrant, gracias.   \nAS   \n   \nPS/   \nMr. Nigel Hamilton, put a little image under your name   \non Typophile, it is really cool.\n\n"
    },
    {
      "time": "",
      "content": "Nigel, I don't get your anger. Soon, Adobe will release a new Garamond from Robert Slimbarch (right Thomas?). I'll also bet that, based on this new Garamond's features, it will be marketed as \"the better Garamond.\" If it were up to me, I would be willing to say something like that.   \n   \nWould saying that hurt Robert Slimbach feelings, because it would imply that his new Garamond is better than his Adobe Garamond? I doubt it. What about all of Claude Garamond's descendents? Will they be peeved? I bet that they think that good old Claude made the best Garamond\n\n"
    },
    {
      "time": "",
      "content": "The best argument I can give that my Sabon Next is the best Garamond is simply that I live the more closer to a street called Rue Claude Garamond :-)   \n   \n18 mns to go by feet...   \n   \n\\*\\*\\*\\*\\*\\*\\*\\*\\*   \n0 m, 0H00   \n14 Rue Paul Bert Malakoff (92, France)   \nContinuer sur la Rue Paul Bert [230m]   \n   \n230 m, 0H03   \nContinuer sur l'Avenue Jules Ferry [270m]   \n   \n510 m, 0H07   \nPrendre\n\n"
    },
    {
      "time": "",
      "content": "Dan   \n   \nYour comments are expected as a Linotype employee and also detract from the issue.   \n   \nIn the ATypI thread Monotype was critized for Book Antiqua as being a clone of Palatino. Linotype is just as guilty. Basic Commercial is a clone of Akzidenz-Grotesk.   \n   \nAs pointed out in this thread the design of Avenir Next is different to Futura. Why does Linotype take the tasteless approach and quote Frutiger as saying \"Avenir is the better Futura\".   \n   \nMarket it as Avenir. Linotype should not trade off the good name of Futura.\n\n"
    },
    {
      "time": "",
      "content": "Nigel, this quote that you keep referencing is not even Linotype's main marketing push behind Avenir. This line appears on the inside cover of the broschure. It is not the \"tagline\" of the font family, just a quote from the designer himslef that is quite liked. Put this into perspective: Adrian Frutiger is one of the world's most respected type designers, living or dead. To insinuate that he is a font pirate is unfair.   \n   \nLinotype does sell basic commercial in its webs shop. The font description clearly states that it is based on the design of AG. I do not know anything about its design, but Linotype is not trying to cover up, or deny the existence of AG, or Berthold's right to sell it. BC is not a copyright infringement of their work in any country or jurisdiction.   \n   \nI hope that my views and opinions do not sound excessive. Although I am an employee of Linotype, I am not expressing any sort of official sentiments in my posts. This is all personal. To further elaborate, I will cease being an employee of LL on Sunday, as my German work permit has temporially expired. However, I would have gladly responded to your mis-formed opionions in the same fashion before I worked here, or knew any of its employees. And I can guarantee you that I will be just as feisty on Monday, because your viewpoint on Avenir is too complexly silly for me to possibly understand.\n\n"
    },
    {
      "time": "",
      "content": "Apparently, grey is the new black. I do appreciate, however, that many people will resent grey being marketed using black's good will and name. Its clearly a pale imitation? ;)   \n   \nThis is silly. I really like Avenir (whereas I'm not that fond of Futura), and I commend the honesty of attributing Futura as an influence, and as an alternative to. Let us remember that the two fonts are not the same, Nigel, and if you genuinely cannot see that, then can I recommend \"Elements of Typographic Style\" as the first book to add to your library.   \n   \nGrrr.\n\n"
    },
    {
      "time": "",
      "content": "Dan   \n   \nActually the line is taken from the Linotype webiste, I have not seen the brochure. And with all respect to Frutiger either it is or is not Futura. If it is then Linotype can make the claim it is a better Futura. If it is not, as most people on this thread agree, then why say a \"better Futura\".   \n   \n\"Linotype does sell basic commercial in its web shop.\" Really!   \n [http://www.linotype.com/webshop/view.linotype?viewmode=search&searchFields%5B%5D=0&searchFields%5B%5D=2&PHPSESSID=b17bdc3becef1e1824d021e3b703b408&ACT=quicksearch&searchLogic=and&searchContent=true&wildcard=1&searchType=as\\_families&GROUP=&DISPLAYC=full&productClassificationLanguage=%25&searchTerm=basic+commercial](http://web.archive.org/web/20110812201154/http:/www.linotype.com/webshop/view.linotype?viewmode=search&searchFields%5B%5D=0&searchFields%5B%5D=2&PHPSESSID=b17bdc3becef1e1824d021e3b703b408&ACT=quicksearch&searchLogic=and&searchContent=true&wildcard=1&searchType=as_families&GROUP=&DISPLAYC=full&productClassificationLanguage=%25&searchTerm=basic%2Bcommercial)   \n   \nI also remember in another thread Spiekermann said that Linotype licensed it from Berthold. Did Linotype use Berthold artwork to digitize it?   \n   \nLinotype has a lot of great typefaces, why do they want degrade their library by selling clones.\n\n"
    },
    {
      "time": "",
      "content": "Huh? My quote (that you quoted!) clearly states that Lino DOES sell BC in its webshop. The way that you responded, its seems as if you thought I wrote doesn't, which I didn't ;)   \n   \nI don't know the history of BC, so I can't answer your question. But AG is credited in its description. If Erik said that we licensed it from Berthold I'll belive him.\n\n"
    },
    {
      "time": "",
      "content": "This is my understanding of the situation:   \n   \nLinotype (D. Stempel AG) signed a license agreement with H. Berthold AG   \non Akzidenz Grotesk in 1977 and sells its versions of this typeface   \nsince then. No other existing type foundry has a longer, unbroken   \nhistory on this typeface.   \n   \nH. Berthold AG reported insolvency in 1993 and ceased to exist. This   \ncompany has no legal successor.   \n   \nThere is no designer on Akzidenz Grotesk to be credited. The design   \ngoes back to 1896, It is now a classic just as Bodoni, Garamond and   \nothers are. Linotype digitized its own version.   \n   \nBerthold Type Ltd., Chicago, received US Trademark   \nregistration on \"Akzidenz Grotesk\" on February 1st, 2000.   \n   \nAfter this, Linotype was forced to stop using the name \"Akzidenz   \nGrotesk\". Linotype decided to invest time and money on other projects rather   \nthan on another legal battle with (name withheld). Consequently, renamed the   \nfonts: \"Basic Commercial\".\n\n"
    },
    {
      "time": "",
      "content": "\\>then why say a \"better Futura\".   \n   \nIt's a rhetorical figure of speech, using \"Futura\" to represent the genre it started and still epitomizes, the geometric sans.   \n   \nLubalin could have said \"Avant Garde is the better Futura\".   \n   \nIt's like saying \"Oasis are the new Beatles\" -- it's not to imply that they are a tribute band.   \n   \nThe difference is between emulation and imitation.   \n   \nPink is the new black.\n\n"
    },
    {
      "time": "",
      "content": "Richard   \n   \nIf you search the German Trademark online database you will discover that H. Berthold's trademark Akzidenz-Grotesk was assigned in 1998 to Berthold Types Limited so there was a successor to the type assets.   \n   \nIf you are correct that Linotype had a license agreement and if they used Berthold artwork for digitization then it should not sell Akzidenz-Grotesk under any name.   \n   \nDan, my apologies for not correctly reading your response.\n\n"
    },
    {
      "time": "",
      "content": "Alessandro, here's my stick:   \n   \n ![mystick](http://web.archive.org/web/20110812201154im_/http:/www.typophile.com/forums/messages/30/41575.jpg)   \nBut it's only 18\" long.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, I though over your sentence,   \nI think you ment \"lots of words\" since in a 10 foot one   \nyou can put lots of letters. What would you say about   \nthis thread with a two inches long stick, just curious!   \nI have one from Nebiolo but it has no numbers on it.   \nAS   \n   \nPS/   \n [http://www.stickwork.net/](http://web.archive.org/web/20110812201154/http:/www.stickwork.net/)\n\n"
    },
    {
      "time": "",
      "content": "Hrant   \n   \nTwo words: rust remover.   \n   \n(thanks for showing it)   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "",
      "content": "Nigel, I've spent all night researching German Trademarks. From my preliminary research, \"Akzidenz Grotesk\" is NOT a registered trademark in Germany, as far as I am aware. Perhaps you can show me otherwise. To provide me with the exact details of Akzidenz's registration in Germany, you may contact me either on or off this board.   \n   \nAs Richard Hamilton stated above, Akzidenz Grotesk was registered by _he who must not be named's_ Berthold in Feb. 2000 as a trademark in the _United States._   \n   \n_Linotype_ has been selling Akzidenz Grotesk legally since the 1950s. This is impossible to dispute. All of the records are in its Bad Homburg office. A few years ago, the company changed the name of AG to Basic Commercial in its webshop soley to avoid a potential lawsuit from _he who must not be named_. BC is the same electronic font data that LL had previously been selling\n\n"
    },
    {
      "time": "",
      "content": "First you should get some sleep.   \n   \nIt is quite easy for anyone to lookup online in the German trademark database that all of H. Berthold AG's trademarks were assigned to Berthold Types Limited early in 1998. I am sure Linotype can help you with this.   \n   \nIn the ATypI survey people were harsh about Monotype and Book Antiqua. Linotype is no better, that's all. It is the nature of the type industry.   \n   \nIf Linotype \"officially\" is interested in this post then they should join in rather than have you be their voice.   \n   \nI also noticed the other day that Linotype has applied for the \"Eurostile\" trademark in the U.S. When did they acquire those rights exclusively?\n\n"
    },
    {
      "time": "",
      "content": "First of all, Linotype is well aware of its own rights and legal satanding, and does not need to officially respond to your statements on this forum, which as Yves pointed out, are deliberately troll-like. While they do not need to officially respond. I personally feel differently. I cannot understand how you can possibly agree with the statements you have entered here. Linotype, as a company, is not the one posting derogatory comments on several different web sites. It was you who started this discussion by trying to paint Linotype's Avenir Next in a false light. As I have recently designed a few promotional pieces for Avenir Next, I feel that your comments are a deliberate questioning of my ethical allegiances. I responding out of my own accord. I would not design type samples for stolen designs.   \n   \nHowever, the post that I made earlier this morning WAS slightly influenced by Linotype. Your defending of Berthold is a reiteration of a tired argument over the nature of that company. Linotype did assist me in a preliminary search of German trademark records. This preliminary search proved no apparent results for a Trademark on Akzidenz. The new Berthold DOES have many trademarks registered in Germany, however, I could not see AG on the list. Therefore, I am asking you directly to back up your statement, which I think is perfectly logical. I would do the same. If AG is registered here, Linotype would like to know that. As far as it is concerned, AG is not registered here at all. I am not denying Berthold's right to sell Akzidenz Grotesk. I also did a bit of asking around about Basic Commercial, since its provenance was specifically asked about. Again, for the last time, I am not a lawyer or spokesperson for the Linotype Library. I was, however, hired because in part because I am a native speaker (of English). I wrote the last post beacause I can write better English than most of the employees in the company (although I personally think that my writing is terribly awful! If I could be more concise, this argument would be over). If you would like to continue this discussion in German, I'm sure that you would get some interesting responses.   \n   \nAs far as I am aware, there will be no \"official statement\" from Linotype, because my above points are correct, and Linotype has nothing to hide.   \n   \nBesides, as far as I know, \"official statements\" are really something for the lawyers. None of us here are lawyers. Ideally, we would all friends talking about the things we love most.   \n   \nEurostil: On our website, it states that Eurostile is a registered trademark of Nebiolo. I do not know anything further about its case, however, Linotype would not register anything with anyone if it were a violation of any of its standing contracts.   \n   \nFirst you brought up Avenir Next in an attempt to paint Linotype in a bad light. No one held your argument for valid that Avenir is a Futura rip-off. Then you brought up Basic Commercial, which is not illegally sold (or named) either. Now, you are offended by some sort of purported moral violation on behalf of Eurostil. You seem to be grasping for straws.I am finding it difficult to maintain an appropriate level of coordial dialogue under these circumstances.\n\n"
    },
    {
      "time": "",
      "content": "Three posts up I typed \"Richard Hamilton\"\n\n"
    },
    {
      "time": "",
      "content": "Dan   \n   \nOne other impotant point that I neglected to mention. Linotype sold Akzidenz-Grotesk under one (Adobe) or two (H. Berthold AG) license agreements. One of the fundamental aspects of trademark law is that if you take a license for something you are prevented from challenging that which you licensed. Imagine the field day that Berthold would have with this.   \n   \nAlso the fact that Linotype assisted you and your post included the term \"generic\" (which I do not think Akzidenz-Grotesk is) could be grounds for Berthold to take action certainly in the U.S. against Linotype as it could be grounds that Linotype is \"impairing Berthold's rights\" and that would certainly be standard trademark language in the Adobe agreement.\n\n"
    },
    {
      "time": "",
      "content": "I did not say that the typeface Akzidenz Grotesk, which is sold by Berthold, is generic.   \n   \nI said that _for decades, the German government had held that \"Akzidenz Grotesk\" is un-trademarkable as a name, because, in the German language, it is a generic term_ .   \n   \nSee the diference? Saying that the two-word combination \"Akzidenz Grotesk\" _in the German language_ is generic does not infringe on anyone's legal rights. Especially when I am just repeating hearsay that was once iterated by a German government office.\n\n"
    },
    {
      "time": "",
      "content": "Yves   \n   \nYou will have to ask Berthold for that but Akzidenz-Grotesk existed in digital form before the Adobe PostScript version.   \n   \nDan from the German TM database   \n   \nQuery started: 30.07.2004\n\n"
    },
    {
      "time": "",
      "content": "Yves. You claim to be the Font Shop Benelux type expert.\n\n"
    },
    {
      "time": "",
      "content": "Thank you for the information, Nigel. I will pass it up Linotype's chain of command (I am at the very, very bottom of it\n\n"
    },
    {
      "time": "",
      "content": "\"Everything was fine back then.\"   \n   \nYou mean when FontShop was allowed to sell the Berthold Typefaces?   \n   \nSurely when FontShop sold both versions you as the \"type expert\" knew what the differences were?\n\n"
    },
    {
      "time": "",
      "content": "Resist temptation. Resist, everyone.   \n   \nThe sound of one mouth clapping.\n\n"
    },
    {
      "time": "",
      "content": "And always remember:   \nIt's very difficult to administer psychotherapy via ASCII.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Speaking from experience Hrant.\n\n"
    },
    {
      "time": "",
      "content": "Nigel Hamilton wrote:   \n   \n_\"If you search the German Trademark online database you will discover that H. Berthold's trademark Akzidenz-Grotesk was assigned in 1998 to Berthold Types Limited so there was a successor to the type assets. \"_    \n   \nNigel,   \n   \nYour _pars-pro-toto_-style of concluding is inadequate and pre-mature. What you have written perhaps suggests that there was a successor to the _trademarks_ in the type assets, but not to the type assets in its entirety. My understandins is that _type assets_ include designs, digital data and trademarks. To my best knowledge, Berthold Types Limited never obtained the entirety of type assets of H Berthold AG, which was recently confirmed by [rot13]Uneirl Uhag[/rot13] on Typophile.   \n   \n_\"If you are correct that Linotype had a license agreement and if they used Berthold artwork for digitization then it should not sell Akzidenz-Grotesk under any name. \"_   \n   \nLinotype used old H Berthold AG's artwork for digitization of the typeface. However, note that there is currently no copyright owner on the design of Akzidenz-Grotesk even in Germany. The design was created more than 100 years ago for a now defunct company. The copyright has expired and there is no current owner. Berthold Types Limited did not \"inherit\" the copyright for the design.   \n   \n_\"One other important point that I neglected to mention. Linotype sold Akzidenz-Grotesk under one (Adobe) or two (H. Berthold AG) license agreements. One of the fundamental aspects of trademark law is that if you take a license for something you are prevented from challenging that which you licensed. \"_   \n   \nYou seem to be ignoring the fact that trademarks are one thing and designs are another thing. While in the U.S. copyright does not generally apply to typeface designs, in the E.U. it does, or at least may. Speaking in European standards, and according to the Berne convention, the design of (the basic cuts of) Akzidenz Grotesk is public domain, the authors have been dead for a very long time and the company which marketed the designs is no more. The additional weights that have been created later by G.G. Lange may still be subject to copyright and they are not marketed by Linotype as \"Basic Commercial\".   \n   \nAdam\n\n"
    },
    {
      "time": "",
      "content": "Adam Twardoch wrote:   \n   \n\"My understanding is that type assets include designs, digital data and trademarks. To my best knowledge, Berthold Types Limited never obtained the entirety of type assets of H Berthold AG.\"   \n   \nIncorrect Adam.   \n   \nBerthold Types owns the entire remaining type assets of H. Berthold AG - including the Design Registrations, Copyright in the font software and Trademarks.   \n   \nHarvey Hunt\n\n"
    }
  ]
}
