{
  "id": "57915",
  "title": "Choosing a typeface for academical text",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm working on my PhD thesis and it struck me that I have been using Times New Roman for years without ever questioning the almighty manuals that most brazilian academics follow. Most ABNT (the brazilian ISO or DIN) manuals say that fonts must be either Arial or Times New Roman, but I'm willing to break this rule.\n\nAfter considering using a typewriter or a DOS font, I began more serious research on what substitutes could I use to make my text look exciting and smart.\n\nI started to research the subject and discovered that Yale solved the problem in a very simple way: they designed their own typeface:\n\n[http://www.yale.edu/universityprinter/typeface/](http://web.archive.org/web/20140307095959/http:/www.yale.edu/universityprinter/typeface/ \"http://www.yale.edu/universityprinter/typeface/\")\n\nI'd like to ask you all for more sugestions on what typefaces could be used for a PhD thesis, and if you know the rules used my other universities. Maybe even what faces were used in certain famous works, etc.\n\nThanks,\n\nDan\n\n",
  "author": "daniel_poeira",
  "time": "11 May 2009 — 8:59pm",
  "uid": "43996",
  "comments": [
    {
      "time": "12 May 2009 — 3:05am",
      "content": "Sorry for self-advertisement, but you shall have a look at Andron:  \n [http://www.signographie.de/cms/front\\_content.php?idart=69&changelang=2](http://web.archive.org/web/20140307095959/http:/www.signographie.de/cms/front_content.php?idart=69&changelang=2 \"http://www.signographie.de/cms/front\\_content.php?idart=69&changelang=2\")  \nAndron has been developed for scientific usage in books and papers. The character coverage is unique for a font such like this. A range of academic publishing projects do already make use of Andron successfully ( [http://www.signographie.de/cms/front\\_content.php?idart=212](http://web.archive.org/web/20140307095959/http:/www.signographie.de/cms/front_content.php?idart=212 \"http://www.signographie.de/cms/front\\_content.php?idart=212\") ; not quite up-to-date!).\n\n"
    },
    {
      "time": "12 May 2009 — 3:39am",
      "content": "[Skolar](http://web.archive.org/web/20140307095959/http:/www.type-together.com/Skolar) by [David Březina](http://web.archive.org/web/20140307095959/http:/typophile.com/wiki/David%20Brezina) is another font family that claims to be “designed specifically for scholarly multilingual publications”.\n\n"
    },
    {
      "time": "12 May 2009 — 4:03am",
      "content": "For my MA thesis at Auburn, typfaces like Times New Roman or Arial were \"highly preferred\" but not required. In the end though, I just submitted it in Times for the university purposes and made my own copy to be bound to test my own Coruña.\n\nRemember, a dissertation will (most likely) eventually be published, so unless it's a design or art-related one, I personally wouldn't worry too much about it (I know, I know, blasphemy on this forum)\n\n"
    },
    {
      "time": "12 May 2009 — 5:16am",
      "content": "It is a mistake to think there is an \"academic look.\" Different typefaces work well with different subjects. Even in your field, (Cinema?), I would choose different fonts depending on the subject. For example, if your thesis is \"Romantic Comedies starring Doris Day,\" it would likely get a different font than \"Film Noir, 1955-60.\"\n\nAs to Times Roman, It too has appropriate and inappropriate uses, though today, it seems few think it has any appropriate uses.\n\nI think it is decried for two reasons. The first is it is used a lot, and boredom sets in \"The Designer's Bored and the Reader Pays\" might make a good dissertation topic. The second and more important reason is the font hasn't moved gracefully from metal to photocomp and digital. Probably because everybody who's capable is bored with it.\n\n"
    },
    {
      "time": "12 May 2009 — 9:14pm",
      "content": "Thank you all very much for your input. I printed test pages of around 30 fonts to compare them, and will add Andron and Skolar to the tests.\n\nBut so far I'm sticking to Palatino. First of all because I prefer my text to be in serifs, both for faster reading, and also to make it look \"old school\". Besides, when compared with the other serif fonts I chose, it was the only one that looked slightly wider. Times New Roman printed in size 12 looks a bit thin to me: the thinner lines almost vanish.\n\nI was amazed to see how much different the line space differed from face to face. Even among fonts of the same foundry: Adobe Jenson looked way more compact than Adobe Caslon, even tho both showed the same line width.\n\nAnyway, thanks all again for the tips.\n\n"
    },
    {
      "time": "26 May 2009 — 2:50pm",
      "content": "I'm currently using Arno Pro for such a text, it works quite well so far (although I haven't officially picked it yet) ;)\n\n"
    },
    {
      "time": "26 May 2009 — 3:11pm",
      "content": "You want to get your PhD and in my experience the font in your dissertation is the least of your problems, providing it's readable. Don't make trouble for yourself.\n\nSo first find out if there is a problem with using another typeface than Times New Roman.If not and you have scope, then there are lots that will work, but if you are not a designer I would get feedback from a designer on your trial design.\n\n"
    },
    {
      "time": "27 May 2009 — 2:47pm",
      "content": "Well readability is or course important, but for academical texts it's also necessary that the typeface has certain specific characters -- at least in my opinion -- to name one example, superscript digits from 0 to 9 (and not only 123, like lots of typefaces) for footnotes. But preferably also optical sizes, so you can use a proper optical size font for footnotes at 6 to 8 points or so. Since these kind of texts potentially contain lots of numbers, like years and dates, old style figures would also be nice. But also tabular figures for things like tables.\n\n"
    },
    {
      "time": "27 May 2009 — 6:16pm",
      "content": "I imagine you'll be using Microsoft Word; perhaps more important than the font choice is the proper use of paragraph formatting, leading, etc. If you want your paper to stand out, don't use Microsoft's default settings, which are typographically atrocious. Don't double-space after punctuation (if that's how you learned to type, use find/change to change double spaces to single spaces), don't type multiple spaces for indents, etc. Learn to use the paragraph formats pane, and make adjustments as necessary.\n\nYou should read \"The Complete Manual of Typography\" by Jim Felici, and visit:\n\n[http://www.designingwithtype.com/](http://web.archive.org/web/20140307095959/http:/www.designingwithtype.com/ \"http://www.designingwithtype.com/\")\n\nGood luck!\n\n"
    },
    {
      "time": "27 May 2009 — 9:02pm",
      "content": "I always thought it would be really funny to typeset my Thesis in ... Thesis\n\n[http://www.fontfabrik.com/fofafon2.html](http://web.archive.org/web/20140307095959/http:/www.fontfabrik.com/fofafon2.html \"http://www.fontfabrik.com/fofafon2.html\")\n\n"
    },
    {
      "time": "29 May 2009 — 9:05am",
      "content": "Well, I'd probably not even bother with Word, it's going to be atricious from the get go. ;)\n\n"
    },
    {
      "time": "29 May 2009 — 10:36am",
      "content": "Yeah, Quincunx, but that’s the software just about everyone has.\n\n"
    },
    {
      "time": "30 May 2009 — 7:29am",
      "content": "@quincunx: oh, I dunno. If one knows what one's doing, it's possible to get perfectly decent results out of Word. About the only thing I've been unable to get it to do that I really would like is margin-hanging punctuation.\n\nBeyond the settings Cameron mentions above, the other one that vastly improves things (apart from \"always work with invisibles showing\") is that if you're doing fully-justified, to seek out and switch on the compatibility option for doing fully-justified text like WordPerfect (!). The end result still looks a bit naff on screen (appearing to squoosh the text at the right-hand end of the line) but prints out sensibly.\n\nEr, and switch on kerning in your Normal template (and/or whatever template you're doing the thesis in) for all the styles you expect to actually use (esp. the _Normal_ style\\* as new ones are likely to be based on it initially).  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n\\*Someone at MS was really imaginative with the names...\n\n"
    },
    {
      "time": "30 May 2009 — 11:43pm",
      "content": "<cite> If one knows what one’s doing, it’s possible to get perfectly decent results out of Word. </cite>\n\nWhat nowadays counts as decent...\n\n"
    },
    {
      "time": "31 May 2009 — 1:37am",
      "content": "Not atrocious? :-D\n\n"
    },
    {
      "time": "31 May 2009 — 4:35am",
      "content": "@EK: What nowadays counts as decent...\n\nOh, so true. Getting acceptable typography from Word requires twice the effort one needs to expend if one works in XPress or InDesign. And most Word users don’t or won’t expend the effort; instead of setting a tab in the required location, they’ll just hit _tab, tab, tab, tab_, until they arrive in the approximate neighborhood.\n\nAnd people like bowerbird (e-book posts) seem to value content above all else; he seems to think typographers are an outdated bunch of navel-contemplators.  \n_O Tempora! O Mores!_\n\n"
    },
    {
      "time": "31 May 2009 — 5:33am",
      "content": "It's so easy to cry foul whenever Word is mentioned. I don't like it either, but it's important to remember that choice of tool comes down to context and target. Word \\*can\\* be a good choice in certain circumstances; and just because it's so easy to produce ugly documents with it doesn't mean it's impossible to produce decent ones.  \nDo you really expect every person who writes a thesis to buy InDesign, oh and licence a large family of typefaces, and maybe take typography classes too? :)\n\n"
    },
    {
      "time": "31 May 2009 — 5:42am",
      "content": "@altira:\n\nNo, but I do expect the publishers of books, newspapers, advertisements, and corporate web pages to demand that level of competence. Daniel asked for advice, and I tried to offer some pointers; my last comment was to @EK, and, I’ll admit, somewhat off-topic. Apologies.\n\n"
    },
    {
      "time": "31 May 2009 — 3:39pm",
      "content": "For thesis work, I would recommend LyX. It won't crash, and will keep your footnotes and cross references in place, and your graphics too. It'll produce very satisfying output, and cost you nothing.\n\n"
    },
    {
      "time": "1 Jun 2009 — 10:38am",
      "content": "\\> _oh, I dunno. If one knows what one’s doing, it’s possible to get perfectly decent results out of Word. About the only thing I’ve been unable to get it to do that I really would like is margin-hanging punctuation._\n\nI don't know... 9 out of 10 attemps at proper typography from Word fail in my opinion. I see it as a tool to _write_ text with, not to do the typography with. Not to mention if you want to work with a few images... one of the most annoying experiences with software I've ever had.\n\nIf you have to the typography of your academical texts or disserations in Word, you'll have to accept mediocre results.\n\n"
    },
    {
      "time": "10 Jun 2009 — 6:06pm",
      "content": "How about [Whitman](http://web.archive.org/web/20140307095959/http:/www.fontbureau.com/fonts/Whitman)?\n\nAnd don't forget the free and multilingual [Gentium](http://web.archive.org/web/20140307095959/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium).\n\nAlso, being a recovering academic myself, I once thought Word was the tool to write text with, but actually it's not.\n\nIf you are working on anything bigger than a business letter, you should be using a tool that helps you capture, organize, search, and compare the snippets of your own research. You shouldn't have to force your thoughts into a single bottomless page that Word offers (much like an ancient scroll).\n\nI've started using [DevonThink](http://web.archive.org/web/20140307095959/http:/www.devon-technologies.com/download/index.html). Download it and try it out. It saves all your writing in Rich Text Format (RTF). You can then export all your notes into whatever other software you like to typeset the whole thing properly.\n\nBut most important of all, it helps you manage your information in a way that makes sense for the 21st century. Rather than trying to explain it all myself, I would ask you to read how author Steven Johnson uses it [to write his books](http://web.archive.org/web/20140307095959/http:/www.nytimes.com/2005/01/30/books/review/30JOHNSON.html?_r=1&oref=login).\n\nRahim\n\n"
    },
    {
      "time": "10 Jun 2009 — 11:32pm",
      "content": "Also check out Mark Simonson's [Grad](http://web.archive.org/web/20140307095959/http:/new.myfonts.com/fonts/marksimonson/grad/).\n\nRahim\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:34am",
      "content": "There is also the Stix project; [http://www.stixfonts.org/](http://web.archive.org/web/20140307095959/http:/www.stixfonts.org/ \"http://www.stixfonts.org/\")\n\n"
    },
    {
      "time": "28 Jul 2009 — 4:36am",
      "content": "Dear Daniel,\n\nABNT really doesn't specify which fonts you should use. You should check your department rules (which might not follow ABNT). Actually, I learned that ABNT rules even accept numbered citations (which most people in Brazil don't even know). The choice you have to make is if you want to use free/opensource fonts or commercial ones, or if you will use a real typesetting software (like InDesign or Latex) or Word. I use latex with Xetex (for fonts) and the ABNT package, which does all the dirty formatting work for me (biblio, citations, quotes, front page, etc.), and so far I've been trying Arno Pro for text and Hypatia Sans Pro for titles, with good results.\n\n"
    },
    {
      "time": "28 Jul 2009 — 9:02am",
      "content": "[Starling](http://web.archive.org/web/20140307095959/http:/www.fontbureau.com/fonts/Starling). The [Univers](http://web.archive.org/web/20140307095959/http:/www.linotype.com/53226/linotypeunivers-family.html) of serifs.\n\n"
    }
  ]
}
