{
  "id": "57941",
  "title": "Lettering v. Calligraphy: Are they the same or different?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "After the thread from last week I'm now wondering what differentiates lettering from calligraphy?\n\n",
  "author": "Miss Tiffany",
  "time": "12 May 2009 — 3:31pm",
  "uid": "108",
  "comments": [
    {
      "time": "12 May 2009 — 3:42pm",
      "content": "In theory calligraphy is a method of lettering focused on rendering letters by writing them with a pen or brush. In practice I don’t think that there’s really a difference, and that calligraphy is becoming associated with certain styles of writing.\n\n"
    },
    {
      "time": "12 May 2009 — 3:44pm",
      "content": "o noes! i opened pandora's box!\n\n"
    },
    {
      "time": "12 May 2009 — 3:57pm",
      "content": "@Paul Nah. After our convo on Saturday I started thinking about stuff. Not a bad thing. :^)\n\n@James So you see lettering as a sort of subset to Calligraphy? Or are they distinct?\n\nI'm hoping some of the typophile lettering peeps chime in on this.\n\n"
    },
    {
      "time": "12 May 2009 — 4:39pm",
      "content": "I would say lettering could be rendered in a number of ways -- you could draw the outline, carve it into wood, burn letters into your lawn, construct them out of paperclips, etc. Calligraphy would almost always be the result of a tool being dragged across a surface, leaving a trace of the movements of your arm and/or hand.\n\nOf course, much like the difference between art & design, there's a million examples you could come up with that fall in a gray area.\n\n"
    },
    {
      "time": "12 May 2009 — 4:49pm",
      "content": "All right let us settle this for all intents and purposes now: )\n\nStephen, Graham, James M, Charles, Gerard, Fred ( I know you lurk ), Nick, Paul, John, Peter, and all you other letter bastardizers. Belly up!\n\nCalligraphy: the art of beautiful writing. (period) Now whether you want to include the brush, ruling pen, etc. is up to you. Straight out of the pen... no futzing what so ever. That is what I consider my calligraphic side.\n\nLettering is, TO ME, letters built up, drawn, touched up, futzed with, noodled ........ ad infinitum. A more lengthy process.\n\nLet me go further! Typography: The application of letters to design... primarily TYPE but not discounting the use of calligraphy, lettering etc. in the commission of a \"layout.\"\n\nIt is a concept that I have been using for almost thirty years, and you guys are not the only ones who struggle with this. Calligraphers think amending letterforms is cheating. Go figure.\n\nMichael\n\n"
    },
    {
      "time": "12 May 2009 — 4:45pm",
      "content": "Lettering is a superset that includes calligraphy (which I define in terms of intentionally beautiful writing, with the intentional part being important: calligraphy is writing that someone has set out to make beautiful, not just writing that we happen to find beautiful).\n\n"
    },
    {
      "time": "12 May 2009 — 4:46pm",
      "content": "I'd also say that calligraphy is always lettering, but lettering is not necessarily calligraphy.\n\nNot something I've thought about before, but an interesting question.\n\n"
    },
    {
      "time": "12 May 2009 — 4:57pm",
      "content": "Excellent point John... as always, incisive!\n\nMichael\n\n"
    },
    {
      "time": "12 May 2009 — 5:03pm",
      "content": "It has occurred to me that calligraphy might also be as much an end as it is a means.\n\n"
    },
    {
      "time": "12 May 2009 — 5:12pm",
      "content": "I can't argue with calligraphy meaning \"beautiful writing,\" because that's what it literally means in Greek: kallos+graphe, beauty+writing.\n\nHowever, one could go to the store, buy a set of pens marketed as a \"calligraphy set,\" go home and attempt to make something very ugly with them. And god knows that although many people may believe their calligraphy is beautiful, it definitely is not to the rest of the world. I don't think that someone producing bad or ugly calligraphy is not creating calligraphy, just as someone playing an instrument poorly or purposefully \"ugly\" doesn't cease to produce music.\n\n"
    },
    {
      "time": "12 May 2009 — 5:16pm",
      "content": "I agree with John and Michael.\n\n"
    },
    {
      "time": "12 May 2009 — 5:30pm",
      "content": "Don't muddy the waters Josh... nobody is talking about beginners. Beautiful writing requires practice.\n\nEdit: did not mean for that to sound mean... it was not!\n\nMichael\n\n"
    },
    {
      "time": "12 May 2009 — 5:57pm",
      "content": "Eek! Please DO NOT bring typography into this conversation. kthxbai\n\n"
    },
    {
      "time": "12 May 2009 — 6:21pm",
      "content": "Pure edification Miss Tiffany!\n\nAnd what the heck is kthxbai????????\n\nMichael\n\n"
    },
    {
      "time": "12 May 2009 — 6:56pm",
      "content": "kthxbai = Ok. Thanks. Bye.\n\nThank you lolcatz for further devolving our language...\n\n"
    },
    {
      "time": "12 May 2009 — 6:59pm",
      "content": "Regarding the relationship of 'calligraphy' and 'lettering', I am certainly familiar with Michael's distinction vis the latter, but I believe this is 'lettering' used as an abbreviation of 'drawn lettering', which should not be confused with the superset of lettering that encompasses both written and drawn -- and carved, and sand-blasted, and chain-sawed, etc. -- letters.\n\n"
    },
    {
      "time": "12 May 2009 — 7:10pm",
      "content": "@typerror: My point is that even if someone sucks at calligraphy or is a beginner, they are still engaged in the practice of calligraphy. In terms of the \"beauty\" part meaning they are consciously attempting to make their letterforms beautiful, I would agree that this is almost always the goal of calligraphy, but then that opens up another can of worms: if a 6 year old is practicing drawing their letters with a pencil, and is trying really hard to make them look perfect, does this count as calligraphy? I think most people would say \"Obviously not.\" To me, it's much clearer to define the difference between calligraphy and lettering in terms of the tools or methods used to make them rather than an abstraction like \"beauty.\"\n\n"
    },
    {
      "time": "12 May 2009 — 8:01pm",
      "content": "To me, they are different. Calligraphy is writing and lettering is building letters either with older tools like brush or newer ones like vector graphics tools. Lettering can be used for signs or for reproduction in print media.\n\nChrisL\n\n"
    },
    {
      "time": "12 May 2009 — 8:15pm",
      "content": "Michael. What about signwriting (a seemingly dying and ignored art) which is lettering/calligraphy with a brush and paint? The letter forms are not necassarly built up, just single strokes. A friend of mine, used to always make a distinction between calligraphy and what she called her \"money stroke\" lettering (mostly casuals) for signs, showcards etc.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150312203925/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "12 May 2009 — 9:17pm",
      "content": "I think those two totally different meaning. not even a subset of one another.\n\nIMHO, dump down to the basic\n\nCalligraphy = Beautiful Writing, a way of art\n\nLettering = the process of create letter from tool (think i'm using this mark to make this shape on this surface)\n\n"
    },
    {
      "time": "12 May 2009 — 9:25pm",
      "content": "A word means whatever it generally means to people. If you use it another way, it will confuse them. Here is the Concise Oxford on the definition of Calligraphy:\n\n\"1. Handwriting, esp. when fine or pleasing. 2. The art of handwriting.\"\n\nThat pretty much lines up with Noordzij's distinction between writing with a continuous stroke and built up lettering.\n\nThe important thing, as far as history, is that with a continuous stroke, the tool has a very big influence on the final shape of the letters and words. With built up letters, such as punch cutting (actually take-away letters) and pencil (pantographic punch cutting afterward) and Bezier curves, the tool doesn't have as dominant an affect on the shape.\n\nWith letters built with extended, but overlapping brush strokes, as is evidently the case with sign painting--and perhaps the original of the Imperial Caps--is sort of an in-between category as far as production of letters.\n\nThe skills involved are, obviously related but different. Skill in using a brush or a pen in a continuous stroke, or the overlapping strokes of the sign painter, are obviously special skills that take a lot of practice, and talent, aside from a person's ability to do built-up letters.\n\nMy impression is that people would not normally use the term 'calligraphy' to apply to sign painting techniques. But I think it is important not to get bogged down in definitions. Meanings are in normal usage somewhat vague, and to assume they are precise is to go on a frustrating wild goose chase.\n\nFor producers of letters, I think Noordzij's distinction--continuous vs built up--is quite useful.\n\n"
    },
    {
      "time": "12 May 2009 — 9:29pm",
      "content": "I am reluctant to chime in on this too early, or even 'have a go' after last week. I will come back to this after some thought and when I have a spare hour. I am a little too busy right now to post something worth reading (if I can ever manage that aim at all).\n\n"
    },
    {
      "time": "12 May 2009 — 9:34pm",
      "content": "I think calligraphy is different from lettering because it uses special tools (pen nibs, bambu dip pens) with special techniques (ductus, traslation, rotation, expansion), obviously the calligrapher needs a kind of skills to make beautiful letters. On the other hand, lettering can be made with any instrument over any surface or support and not necessarily with calligraphic techniques, it has a wider scope of options to make letters.\n\n"
    },
    {
      "time": "12 May 2009 — 9:42pm",
      "content": "Not all forms of sign painting involve overlapping strokes. As I have tried, unsuccessfully, to explain, some lettering done by sign painters (or more properly - sign writers) is done with single strokes, not overlapping, not built up. There are several scripts, casuals, and even some gothics (called single stroke gothics) of this variety.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150312203925/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "12 May 2009 — 9:49pm",
      "content": "What John said.  \nCalligraphy is a subset of lettering.\n\nHowever, I often use the terms in contrast--\"lettering\" to mean constructed letters and \"calligraphy\" to mean written letters. (What Chris said.)\n\n"
    },
    {
      "time": "12 May 2009 — 11:08pm",
      "content": "Sorry, a 2 minute break from work to stick my nose in and stir the pot.  \nFrom the definitions presented above (most of them) history needs to re-classify the following 'traditional calligraphic hands' and re-label and tag them as lettering?  \nRustic Script, Square Capitals, Latin Uncials, Insular Half Uncials, Prescissus Gothic, Textura Gothic, Caroline Capitals, English Capitals, Early Gothic Capitals, Rotunda Gothic, Humanist Square Capitals, Humanist Minuscules (to name just a few) and about 75-85% of today's contemporary calligraphy. These are all 'built up' with a number of strokes and not actually written in the strict sense of the definitions posted above.\n\nI am just asking the question.\n\n"
    },
    {
      "time": "13 May 2009 — 4:13am",
      "content": "Calligraphy is the more difficult one to define as it could potentially have several meanings. I doubt that a consensus will be reached on that one. Lettering, I believe, is simply creating letters which could include calligraphy. The most traditional forms of calligraphy are associated with the broad-edged pen in western calligraphy and brush in eastern traditions. Calligraphy is usually associated as being more direct, but then again… so is showcard writing and even common handwriting. I remember hearing a well known calligrapher once dismiss all pointed pen scripts as not being calligraphy. Where I work, if they say to do something 'calligraphic' it usually means broad-edged letters. I think of calligraphy as being more directly written, but I wouldn't consider that a definition.\n\nThe root of the word means beautiful writing, but that doesn't necessarily constitute a definition. A piece of lettering could be purposefully made ugly or frightening to achieve a specific effect.\n\nGraham: Good point about the traditional built up letters.\n\nMaybe this is why Calligraphy Review was changed to Letter Arts Review back in the 90's.\n\n"
    },
    {
      "time": "13 May 2009 — 4:18am",
      "content": "@Chris\n\nI thought that was what I said : )\n\n@ Graham... I knew you were going to bring up Versals... party pooper : )\n\nMichael\n\n"
    },
    {
      "time": "13 May 2009 — 12:10pm",
      "content": "Calligraphy, by my understanding, is a subset of lettering which implies emphasis on the artistic quality of letters themselves, as opposed to just their message. Consider Grotesk types, for example (Akzidenz, Helvetica, etc.)--they're designed specifically so that the letterforms themselves are not particularly noticeable. However, compare these typefaces with lettering done using a calligraphy nib: the difference is extremely obvious. You pay attention to the curls and flourishes of calligraphy. You don't pay attention (unless you're a typographer--then the rules are different :) to the straight lines or even widths of sans-serif type (or in the case of most people, serif type as well). i'm reminded of Brioso, a Robert Slimbach font based on Italian lettering written using quill pens. Brioso effectively sits on the fence between utilitarian lettering and calligraphy--one notices the letterforms and the way they're drawn, but the unique features of the typeface are subtle enough that the letters don't hog the attention from the text itself...\n\n"
    },
    {
      "time": "13 May 2009 — 12:41pm",
      "content": "_These are all ’built up’ with a number of strokes..._\n\nThey are written in the sense that there is a close connection between the size of the nib/brush and the stem width.\n\nConstructed lettering is like, \"outline and fill\".\n\n"
    },
    {
      "time": "13 May 2009 — 2:26pm",
      "content": "@Michael Great minds...:-)\n\nChrisL\n\n"
    },
    {
      "time": "13 May 2009 — 7:36pm",
      "content": "@ Chris\n\n& old minds fall apart : )\n\nMichael\n\n"
    },
    {
      "time": "14 May 2009 — 1:02am",
      "content": "To me they are closely related but very different disciplines. An analogy would be the relationship between topiary and bonsai.\n\n"
    },
    {
      "time": "14 May 2009 — 9:29am",
      "content": "This is a very thorough discussion, but I can add a few elements not addressed. For me, having studied both Asian calligraphy and Western for 30+ years, gesture is at the heart of it. The stroke begins off the page, in motion. And when the hand lands on the page it makes marks, the other part of my definition--markmaking. I don't really include \"beauty\" in my definition except to note that when there is a coming together of tactile awareness of tool, medium, surface, and intention it often results in something you can't NOT look at, because it communicates such focused intensity and connection of hand and mind.\n\n"
    },
    {
      "time": "14 May 2009 — 10:25am",
      "content": "Iskara, welcome to Typophile.\n\nVery insightful comment. I think your comment indicates why even in more 'typographic' fonts, a feeling of motion of the hand is often a desirable thing. It is key to imbuing a typeface with a feeling of warmth and humanity.\n\n"
    },
    {
      "time": "14 May 2009 — 10:39am",
      "content": "Watch it William... she will get you for spelling her name wrong : )\n\nWelcome Iskra. And great points, but they do not understand the \"getting into a landing pattern\" with the tool. For most here the mark begins with the ink appearing on the page : )\n\nHope you are staying busy, well and happy.\n\nMichael\n\n"
    },
    {
      "time": "14 May 2009 — 11:38am",
      "content": "Iskra: very true (I have always considered calligraphy to be a performance art), but I don't think it differentiates lettering from calligraphy. Because the gestural stroke can be as much of a factor in the detailed finish of constructed lettering as in the main strokes of written calligraphy. The shape of a curve is no less important in \"outline and fill\".\n\n"
    },
    {
      "time": "14 May 2009 — 2:57pm",
      "content": "Nick\n\nNever thought of calligraphy as performance art as I rarely have an audience... but it is the most fun you can have when you are by yourself : )\n\nMichael\n\n"
    },
    {
      "time": "14 May 2009 — 7:05pm",
      "content": "You don't need an audience as long as it's recorded.\n\n"
    },
    {
      "time": "14 May 2009 — 7:14pm",
      "content": "[http://www.youtube.com/watch?v=5AmpyiR6kj8](http://web.archive.org/web/20150312203925/http:/www.youtube.com/watch?v=5AmpyiR6kj8 \"http://www.youtube.com/watch?v=5AmpyiR6kj8\")\n\n"
    },
    {
      "time": "14 May 2009 — 7:22pm",
      "content": "Iskra: _The stroke begins off the page, in motion._\n\nThis is a very important insight that, as Michael notes, most type people don't intuitively grasp. You have to see it being done.\n\nThere's a lovely thing one sees in Arabic calligraphy sometimes, notably in the larger thuluth style, where the calligrapher lifts the pen in the middle of an extended stroke and then drops it down again a little later, leaving a small gap in the stroke. It makes Iskra's point visible: the stroke is a motion in space making contact with the page for a time.\n\n"
    },
    {
      "time": "15 May 2009 — 5:01am",
      "content": "_Constructed lettering is like, “outline and fill”._\n\nNot always.\n\n"
    },
    {
      "time": "15 May 2009 — 11:05am",
      "content": "I was contrasting \"outline and fill\" with lettering where the nib/brush size relates closely to stem width.\n\nThe examples you gave of \"built up\" styles, mostly with \"jiggled\" or \"small backstep\" serifs at the ends of main stems, do not, IMO, constitute construction, as they occur, formalized, within the sequence of the calligraphic flow.\n\nSo I would define construction as being outside that temporal flow of performance.\n\n(Admittedly, certain calligraphic features, such as flourishes, may be added later.)\n\n"
    },
    {
      "time": "15 May 2009 — 11:26am",
      "content": "Outline-fill constructed letters vs calligraphy is the the difference between Cartesian and Existential philosophy.\n\nChrisL\n\n"
    },
    {
      "time": "16 May 2009 — 5:57pm",
      "content": "I have just come across this thread and as both a calligrapher and lettering artist /craftsman with over 40 years experience I find all the various diverse comments interesting. I believe that Michaels comments, to me, are nearer the mark than most. I am a different person when I perform with a square edged pen than when i am designing or carving letters. Designing letters for print satisfies the designer in me, carving satisfies the craftsman in me while calligraphy satisfies the artist in me. So I feel blessed that the diverse commissions I receive always pleases and fulfills one or more aspect of me. To me calligraphy is more spiritual and emotional and allows, at times, my Welsh spirit to escape.  \nLettering in many guises on the other hand satisfies the perfectionist in me and gives me an outlet to solve visual problems which I love. But if my finances would allow it I would only carry out large scale freely written calligraphy as it would involve all my senses and be an extension of myself.\n\nIf you don't mind I would like to share a personal experience with you which I feel has a bearing on this thread.\n\nIn 1988 my wife Barbara died at the young age of 44. At the time my daughter Victoria was 13 years old and Angharad was just 6. I had no relatives near at hand so I had to look after them on my own without financial help for nearly 7 years. How I managed to look after them and carry out commissioned work still baffles me. But the interesting thing, as far as this thread goes, is that for the following 11 years after Barbara died I could not do any calligraphy at all however hard I tried. But designing letters and carving I managed to do because there was no emotion involved and I could stop and start around my family demands and duties. But with calligraphy as it is instant and personal I could not get fully involved and totally engrossed as calligraphy demands.\n\nSo to me Calligraphy is more personal and it needs a totally different type of involvement than lettering so that all my senses can work together and perform without any interuption. Lettering on the other hand allows for interruptions and that makes a big difference.\n\nI agree that calligraphy that needs manipulation or add ons is not true calligraphy in the same way that paper folding that nedds scissors is not true origami.\n\nIeuan Rees\n\n"
    },
    {
      "time": "16 May 2009 — 7:35pm",
      "content": "Ieuan: _I agree that calligraphy that needs manipulation or add ons is not true calligraphy..._\n\nWhat if the style of writing relies upon such methods in order to fulfil its normative forms?\n\nIs this calligraphy or not? [http://www.youtube.com/watch?v=RdQgBk59z-8](http://web.archive.org/web/20150312203925/http:/www.youtube.com/watch?v=RdQgBk59z-8 \"http://www.youtube.com/watch?v=RdQgBk59z-8\")\n\n"
    },
    {
      "time": "16 May 2009 — 8:46pm",
      "content": "John  \nWatching the video it appeared as though Hermann Zapf and Arthur Baker were channeling each other : )\n\n@Ieuan... crap I have forgotten all my Welsh greetings! A greeting across the pond is not so different than one across a \"holler.\"  \nPut your site address up here so they can see what a brilliant Welshman can do! I would've but did not think it proper.\n\nMichael\n\n"
    },
    {
      "time": "16 May 2009 — 11:16pm",
      "content": "I've seen Zapf do gorgeous calligraphy with the side of a piece of chalk 2 feet high on a blackboard--you had to have seen the guy work.\n\nChrisL\n\n"
    },
    {
      "time": "17 May 2009 — 3:45am",
      "content": "Michael\n\nThanks for your kind words and here is my site address which I hope will be of some interest\n\n[www.ieuanreeslettering.co.uk](http://web.archive.org/web/20150312203925/http:/www.ieuanreeslettering.co.uk/ \"www.ieuanreeslettering.co.uk\")\n\nTo answer John's question\n\n'What if the style of writing relies upon such methods in order to fulfil its normative forms'\n\nYes I would agree that scripts that need manipulation to aid legibility such as Rotunda for example is calligraphy, but we must take into account that Rotunda was written with a flexible quill and would allow for easy manipulation. Trying to do the same with a modern steel nib is not so easy and fluent an the results too often appear too conscious, constructed and laboured. If manipulation can be done easily and effortlessly and allows the writer to perform flowingly then yes I would call that calligraphy. But if on the other hand manipulation and add ons prevents natural flow and needs too technical an approach then I would not call it calligraphy. However I do a lot of calligraphy for graphic purposes that need manipulation and add ons to gain certain visual affects but I call such work 'Calligraphics'\n\nIeuan\n\n"
    },
    {
      "time": "17 May 2009 — 9:40am",
      "content": "Fabulous work, Ieuan Rees !\n\nChrisL\n\n"
    }
  ]
}
