{
  "id": "57951",
  "title": "Finding a Japanese match for Helvetica",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have posted an article on matching Helvetica with Japanese  \nfonts on my blog for those who are interested –  \n [http://www.andseen.com/?p=353](http://web.archive.org/web/20141201055514/http:/www.andseen.com/?p=353 \"http://www.andseen.com/?p=353\")\n\nIt would be nice with some input from these forums too.  \nAs I say in the article, there really is no right choice, but  \nit would be interesting to do further comparisons and  \nto hear from more people.\n\nI may also continue with more articles dealing with other  \nfonts and how to mix the two languages.\n\n",
  "author": "andseen",
  "time": "12 May 2009 — 10:29pm",
  "uid": "44538",
  "comments": [
    {
      "time": "13 May 2009 — 12:28am",
      "content": "When I was living in Tokyo, I bought a CD Rom with about 200 fonts, and some of them were the exact equivalent of Helvetica, as I could test at the time by pairing them on a page. Unfortunately, this was 11 years ago and the CD Rom is long gone in my many archive boxes, as well as the name of the font. But the point is, I disagree with you, there is a right choice. You simply didn't find it.\n\ndr\n\n"
    },
    {
      "time": "13 May 2009 — 1:52am",
      "content": "If you check the article you can see that Midashi Go MB31 matches Helvetica  \npretty closely, but it is not an exact match. There is no legitimate font that matches  \n100%. Pretty much all the best designers here in Tokyo use either Midashi Go MB31 or Gothic MB101.\n\nIf there exists a perfect match then somebody has just made the swap for you,  \nreplacing the roman characters of the Japanese font with Helvetica. I don’t know  \nthat I would trust someone else to make that swap for me.\n\nThere are not that many well drawn Japanese fonts to choose from, I would guess  \nbecause of the sheer amount of characters that have to be included in a complete  \nfont. I think I have included most of the really well made ones in the comparison,  \nbut if you find out the name of the font you used before then I would love to know.\n\n"
    },
    {
      "time": "13 May 2009 — 4:40am",
      "content": "I've given much thought to the issue of matching hangul (Korean alphabet) typefaces with Latin ones, and I have a fairly good idea of what style of hangul sans-serifs would go with grotesks such as Helvetica. But it's impossible to set up exact parallels between the styles of two writing systems that developed separately. I think you would run into the same issue when you look for a Japanese match for Helvetica.\n\nA Japanese match would have to be a monolinear sans-serif, with attributes like openness of the letterforms, squareness, smoothness or abruptness of curves, relative counter size etc. somewhat comparable to Helvetica. But since the structures of Japanese and Latin letterforms are so different, this is not an exact science.\n\nThe Latin glyphs included in the Japanese font can be a guide to what Latin designs would match the Japanese glyphs, but don't rely too much on them. Typically, the Japanese glyphs would be designed first and then the designers would look through their catalogue of Latin typefaces to pick one that they decide is a good match. Then they will base the design of the Latin glyphs on that model, modifying the proportions and weight to match the Japanese glyphs as needed. There are exceptions such as Axis, of course, but this is why the Latin glyphs in Japanese Gothic typefaces are mostly derivatives of Helvetica, Frutiger, and other well-known Latin sans-serifs.\n\nAre there subgenres within Japanese Gothic typefaces to which Helvetica is better suited than other subgenres? Quite possibly; I don't know enough about Japanese typefaces. But I think just because the font designer chose a Frutiger derivative for the Latin glyphs doesn't necessarily mean that Helvetica wouldn't work just as well.\n\nIn the end, I suspect all the typefaces mentioned in the post are generally stylistic compatible with Helvetica. In this case, consideration of proportion and stroke weight trumps all else, including what style of Latin glyphs the designers included in the Japanese font.\n\n"
    }
  ]
}
