{
  "id": "57961",
  "title": "Clementhorpe",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Clementhorpe is Greater Albion's latest project. It's based on some 'found' lettering (about a dozen letters in all) in an early 1900's enamel advertisment for chocolate. A sampling of work to date is shown below. All feedback greatfully received...\n\n ![](http://web.archive.org/web/20150417120647im_/http:/typophile.com/files/Clementhorpe-_5753.jpg)\n\n",
  "author": "Rasendyll",
  "time": "13 May 2009 — 7:31am",
  "uid": "30818",
  "comments": [
    {
      "time": "13 May 2009 — 7:59am",
      "content": "I think a lot of the forms are very appealing, and I definitely think the style and feel of the original translates nicely.\n\nMy issues with it involve some of the vertical strokes, especially on the lowercase. A lot of them just seem too thick and weight the letter one way or the other, like with the \"p.\" I'm also not a big fan of the \"S,\" I think the upward bulge in the bottom curve is just a bit much.\n\nThese are the first impressions of a novice typophile, so take them for what they're worth. A well-executed revival, I say!\n\n"
    },
    {
      "time": "19 May 2009 — 6:13am",
      "content": "Here's the latest update on Clementhorpe-quite a bit of progress:\n\n ![](http://web.archive.org/web/20150417120647im_/http:/typophile.com/files/test%20table_4255.png)\n\n"
    },
    {
      "time": "19 May 2009 — 6:34am",
      "content": "The LC z looks...awkward. And the quote marks need a bit more of the \"hand-brushed\" feel that you have going throughout the rest of the characters. I really like the leg of your UC R though. That's pretty!\n\n"
    },
    {
      "time": "19 May 2009 — 7:35am",
      "content": "Actually-the quote marks re a mistake-the actual ones aren't done yet and my proof document has added in default ones! On reflection I think know what you mean about the 'z'..... I'm still trying to decide what to do with that one. Thnks for the comments :)\n\n"
    },
    {
      "time": "23 May 2009 — 7:25pm",
      "content": "Here's the latest progress on the Clementhorpe family:\n\n ![](http://web.archive.org/web/20150417120647im_/http:/typophile.com/files/Clementhorpe%20_5251.png)\n\nor a more detailed set of previews of five faces can be found [here](http://web.archive.org/web/20150417120647/http:/gatf.files.wordpress.com/2009/05/clementhorpe2.pdf).\n\n"
    }
  ]
}
