{
  "id": "57979",
  "title": "The British grotesque S",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In a grotesque typeface styled after British designs from the late nineteenth and early twentieth centuries, would anyone actually want to have the too-dark and about to fall over S, or would you rather see it replaced with a more continental design?\n\n",
  "author": "<a href=\"/web/20090521100308/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 13.May.2009 4.13pm",
      "content": "Surely there is more than one kind of british grot s... no? What about samples?\n\n"
    },
    {
      "time": " 13.May.2009 4.15pm",
      "content": "Wouldn’t they depend upon how cloyingly accurate you want your grotesque to be?\n\n"
    },
    {
      "time": " 13.May.2009 4.36pm",
      "content": "This is the British style S that I’m referring to. I get the impression that this style turned up in Britain late in the nineteenth century. Some similar stuff turns in America (ATF Lining Gothic) but the British version is just so unbalanced it’s kind of funny.\n\nI think I’ll make it an alternate.\n\n ![](http://web.archive.org/web/20090521100308im_/http:/typophile.com/files/grotS_4055.png)\n\n"
    },
    {
      "time": " 13.May.2009 4.57pm",
      "content": "That is fugly. I guess you could include is as an historical alternate.\n\n"
    },
    {
      "time": " 13.May.2009 5.08pm",
      "content": "Those are pretty dreadfully executed for what I’d imagine they were trying to do, but it does have a charm. The lc is especially wonky. If the inconsistencies were more consistent, it could succeed in a modern context and have a feel that not a lot of sans faces accomplish.\n\n"
    },
    {
      "time": " 13.May.2009 5.20pm",
      "content": "Check out the history of Maple, from Process Typefoundry. When Eric Olson revisited his Process Grotesque (a fairly faithful adaptation of the British grots), the s was one of the characters that changed significantly.\n\n[http://processtypefoundry.com/typefaces/maple/info.html](http://web.archive.org/web/20090521100308/http:/processtypefoundry.com/typefaces/maple/info.html \"http://processtypefoundry.com/typefaces/maple/info.html\")\n\n"
    },
    {
      "time": " 13.May.2009 5.26pm",
      "content": "Thanks for the link, Marc. My project is very similar; a mashup of the Stephenson Blake grotesques and 19th century poster lettering with the contrast cranked up beyond Franklin Gothic. The SB types are a strange mix of fabulous and disastrous but so fun to jump off from.\n\n"
    },
    {
      "time": " 13.May.2009 8.35pm",
      "content": "James, I don’t think you’re seeing this right.  \nYou had a similar problem with the S in Recovery.  \nThis is the way the S is supposed to look in this style, if you’re doing a fairly close revival.  \nTry and keep the personality and balance it according to your eye (use drag skew tool), rather than departing from the model entirely.  \nBTW, the SB grots are distinctive and British, but not typically British, as there were other sans faces at the time that weren’t so funky.\n\n"
    },
    {
      "time": " 13.May.2009 9.33pm",
      "content": "<cite>…if you’re doing a fairly close revival.</cite>\n\nI’m not doing a revival so much as sifting through a pile of fonts and letting for things that work and trying to find a mix that work together. As fun as my various sources are, none of them presents a compelling target for a revival, but a remix seems like a nice possibility.\n\n"
    },
    {
      "time": " 13.May.2009 9.55pm",
      "content": "The S isn’t fugly! It’s sitting back and smiling! I suspect the road you’re traveling down (Mash Up Blvd) is going to end in extreme frustration, as what’s working in one alphabet most likely won’t work well in another.\n\n"
    },
    {
      "time": " 14.May.2009 1.06pm",
      "content": "I guess sitting back and smiling is another way to look at it. Maybe the smile is from a few gin & tonics.\n\n"
    },
    {
      "time": " 14.May.2009 2.51pm",
      "content": " ![](http://web.archive.org/web/20090521100308im_/http:/typophile.com/files/article-1146066-000213BB00000258-27_468x286_4910.jpg.jpeg)\n\n"
    },
    {
      "time": " 14.May.2009 3.04pm",
      "content": "Maybe I would get a more authentic feel if I had fish & chips and two pints for lunch.\n\n"
    }
  ]
}
