{
  "id": "57991",
  "title": "Make the Logo Smaller: winner of our first buyer's poll",
  "forum": "TypographyShop's blog",
  "tags": [

  ],
  "content": "[TypographyShop](http://web.archive.org/web/20131018220512/http:/typographyshop.com/) has just released three new themes on four shirts. We polled our buyers and a few friends, presenting 9 ideas for new shirts. By an overwhelming majority they chose [\"Make the Logo Smaller](http://web.archive.org/web/20131018220512/http:/typographyshop.com/make-the-logo-smaller-large-mens-t-shirt.html),\" followed by [\"Sans\"](http://web.archive.org/web/20131018220512/http:/typographyshop.com/sans_m.html) and [\"Serif](http://web.archive.org/web/20131018220512/http:/typographyshop.com/serif_m.html).\"\n\nOur respondents were split over whether the phrase \"Make the Logo Smaller\" should be quite small or very large, to drive home the point. So we decided to offer both.\n\nAll who responded expressed a great deal of enthusiasm for the entire range of designs presented and we plan on releasing new themes on a much more regular basis. For the past year we had a grand total of two designs available. The workload at my firm, [The King Group](http://web.archive.org/web/20131018220512/http:/kinggroupmedia.com/) was overwhelming, thankfully, and just keeping up with orders for TypographyShop was enough work without adding to it all with an extended line.\n\nNow that we've had a bit of a lull we've managed to jump back on the shop and are working on a proper redesign of the site complete with a merchant banking shopping cart instead of the current PayPal system.\n\nWe've also got some big news involving several well known practitioners from the fields of design, web and type design. Look for designs by or homages to your favorite folks soon. Part of the business model of TypographyShop is the donation of a portion of each sale to design education programs, so each of our guest designers will be choosing the recipient of the donation from the sales of their products.\n\nNext month we'll be having our first buyer's design contest. We've got some very talented customers, many of you among them. I'm very anxious to see what they come up.\n\n ![](http://web.archive.org/web/20131018220512im_/http:/typophile.com/files/typophile509_4159.jpg)\n\n",
  "author": "TypographyShop",
  "time": "14 May 2009 — 5:34am",
  "uid": "30318",
  "comments": [

  ]
}
