{
  "id": "58025",
  "title": "Graphic Design Education",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am about to enter into the graphic design program at California College of the Arts. I will have to get into a lot of debt to go. Have other people done this and is it worth it. I have worked in branding and am just now at a little family company before I go back to school. I am skilled with the tools but have to learn design. Am I crazy to study graphic design and go into serious debt (even if my dad will help pay?) It’s all I know and have ever done...\n\n",
  "author": "<a href=\"/web/20090521202651/http://www.typophile.com/user/44596\" title=\"View user profile.\">micah.min</a>",
  "time": "<br>",
  "uid": "44596",
  "comments": [
    {
      "time": " 14.May.2009 8.24pm",
      "content": "There seem to be many parallels in your description to the current Iraqi war, so pardon me for asking, what’s your exit strategy?\n\n"
    },
    {
      "time": " 14.May.2009 8.28pm",
      "content": "work at a branding firm and work my way up/out. maybe start my own or partner? i’m not sure really\n\n"
    },
    {
      "time": " 14.May.2009 8.30pm",
      "content": "As someone who just went from a career to art school, trust me, it’s not worth it. A degree from an independent art school is extremely expensive, and because they’re small schools, financial aid is especially limited. Entry-level design jobs are not easy to get and many don’t pay. And if you want to specialize in branding (or anything but web development and interactive design) you’re really limiting the number of job possibilities that you’ll have.\n\nIt also doesn’t help that at a private art college your study will be focused even more on art and design than it might be at a larger school, which makes the degree less valuable when job hunting. You might hear stories about how big companies want to pay lots of money to smart creative people with art degrees because they can solve problems, but it’s a myth. I’ve had interviewers tell me that they won’t hire me just because I went to a private art school; they don’t want arrogant creatives who only know how to think about big concepts around.\n\nGo to a state school. Instead of taking a bunch of high-minded arty classes learn how to handle Flash, ActionScript, and web CMS systems like Drupal and Joomla. Your degree will be worth more because non-designers will have heard of the school and won’t think you spent four years in figure drawing. You also won’t have nearly as much debt after school, and not having that burden on your psyche will probably make your life easier and your work better.\n\n"
    },
    {
      "time": " 14.May.2009 10.04pm",
      "content": "Your education should last a lifetime, way beyond when all today’s design tools are obsolete.  \nI’ve never regretted going to art school. I’ve seen peers marginalized and squeezed out of creative work as changing technology made their niches untenable—designers, photographers, illustrators,—but I’ve managed to stay in the game by being flexible, and I’d like to think that my high-minded, arty education, made that possible.  \nI sympathize with James, but you can hope that the economy will have picked up by the time you graduate.  \nIt’s a bit of a crap shoot picking a college, hard to know if the intellectual climate, as determined by faculty and fellow students, will be “just your speed”, so pay particular attention to grad shows and other examples of student work.\n\n"
    },
    {
      "time": " 14.May.2009 10.36pm",
      "content": "In these economic times, I’m not sure debt pursuing any career makes a whole lot of sense at the moment...\n\nThat said, a good design school is a good design school. A prestigious school is prestigious, but I’d argue only marginally better than a good school. It can make sense to put prestigious alma mater on your resume if you are going into law or politics but not necessarily that important in this field.\n\nHowever, there are also a lot of really crappy design programs in those trendy-major-of-the-month trade/tech schools. Those are rarely worth the paper the degree is printed on. If the school advertises on TV during the Price is Right, scratch them off your options list.\n\n"
    },
    {
      "time": " 14.May.2009 10.41pm",
      "content": "“Your degree will be worth more because non-designers will have heard of the school and won’t think you spent four years in figure drawing.”\n\nIt really depends on what kind of job you are after.\n\nA good design firm will often opt for the four years of figure drawing.\n\nIf your focus is more on web technologies, then an IT/CS degree might make more sense.\n\n"
    },
    {
      "time": " 14.May.2009 11.04pm",
      "content": "<cite>I sympathize with James, but you can hope that the economy will have picked up by the time you graduate.</cite>\n\nNo matter how good the economy gets, entry level design salaries aren’t likely to keep pace with the explosion in tuition over the last decade. Tuition alone at CCA is $16,452 per term. There might be some nice lasting benefits that go along with that tuition, but there are some lasting benefits to not being 22 and over $100,000 in debt.\n\n<cite>A good design firm will often opt for the four years of figure drawing.</cite>\n\nThat’s great for people who graduate and land in a design job. Not everybody does. I’ve known designers who spent a couple years do receptionist jobs while they wait for a design job to come up. And not everybody who goes to design school wants to be a designer after school. In those cases I see a degree from a private art school as a liability.\n\n"
    },
    {
      "time": " 15.May.2009 1.17am",
      "content": "what you all should do is become an Australian citizen, my university costs are covered by a government loan that i only pay back when i earn over a certain amount (i think it’s A$45,000) and it’s taken out with my tax, so easy to manage. PLUS, if i choose to move overseas and not earn the money in Australia, i do not have to pay it back. i only pay it back based on what the Australian government taxes me for.\n\nlink: [http://www.goingtouni.gov.au/Main/Quickfind/PayingForYourStudiesHELPLoan...](http://web.archive.org/web/20090521202651/http:/www.goingtouni.gov.au/Main/Quickfind/PayingForYourStudiesHELPLoans/Default.htm \"http://www.goingtouni.gov.au/Main/Quickfind/PayingForYourStudiesHELPLoans/Default.htm\")\n\n"
    },
    {
      "time": " 15.May.2009 1.26am",
      "content": "Try to figure out first what \\*exactly\\* your expectations for study are. Then try to figure out what program/school might fit. If you find something, ask your self how he feels about the debt.  \nYou want to learn to design? Well, what’s that. It has a lot to do with being able to SEE, to THINK, to DRAW. To see like a bee or like an eagle. To think like a maniac or like a manager, to draw like a dancer or like an architect … and to connect all these perspectives like a genius.  \nHiring a single professional for teaching you for three weeks privately en bloc might be an alternative to college, at more modest rates. Interested?  \nTest your skills with this little exercise:  \nDesign two brands, one for “Jim Potter – Gardener”, the other for “Ann Gardener – Pottery” – and find out what you expect from learning ‘Design’.\n\n"
    },
    {
      "time": " 17.May.2009 6.08am",
      "content": "I attended 3 art colleges totaling 7 years. The 3 years at the Royal College of Art in the 1960’s was a total waste of time as far as tuition went, but I had a grant from the government so I went my own way and used the facilities and ignored the biased, narrow minded and inflexible tuition.  \nBut the situation here is totally different as payment is involved.  \nI spend 90% of my time carrying out commissioned work which includes graphics and calligraphics, and spend sometime, mainly in the USA, holding workshops in lettering, calligraphy, calligraphics and drawing as well as giving private tuition. In the past I have taught at 5 different arts schools, on a part time basis, but at no time for more than 2 days week but mostly just for 1 day a week.  \nMore time teaching would have destroyed my freelance work as the most important requirement to succeed as a freelance artist/designer/craftsperson, is not talent, creativity, reliability or how much tuition or time spent at art school or design colleges but being available. If we are not available then it does not matter one bit how many attributes or qualifications we have as we won’t be able to take on the work and the client will go elsewhere probably not to return,  \nDon’t get me wrong, talent, creativity, individuality, reliability, the ability to communicate etc etc are all extremely important things but if we are not available what is the point. A client would rather have a second best piece of work done on time and within budget than an unfinished masterpiece.\n\nSo what advise would I give a young hopeful graphic designer ?\n\nThe most important requirement is not to be too blinkered in you approach. Be open to all possible avenues and constructive advise and base everything on drawing. To be versatile we must learn to OBSERVE before we can really SEE the things we look at. Without observing, questioning, reasoning and evaluating what we see then we can’t do justice to it. The purpose of drawing is not to produce pretty pictures but to learn something about the subject, be it proportion, movement, color, mood, structure, contrast, trick of light or optical illusions etc but most importantly learning and appreciate the importance of NEGATIVE SPACE. Too much emphasis is based on images rather than the background that reveals the images. To me its the balance of the negative shapes that takes up most of my time, get that right and the rest will fit into place.  \nToo much of the wrong kind of diverse and conflicting opinions, especially in art schools and design studios, causes confusion and uncertainty. it is far better to start trusting your own judgement, difficult as that is, but if we question and observe more then the subject itself will be our best teacher. All design work have their own visual problems and our role is to identify those visual problems through observation and offer alternative solutions until the job in hand tells us that it is happy. No set of concrete rules will find all solutions but observing the work and communicating with it and respecting it and be versatile in suggesting possible solutions will eventually find an acceptable answer. There is no quick fix but rather the enjoyment of finding acceptable solutions through experimentation, failures, discoveries and faith in our own judgements. You don’t need colleges to help with these, we need to learn by DOING especially from the failures. Failures are never failures if we learn from them.\n\nDon’t be tide down by non constructive ’rules’ as they can stifle creativity and individuality. Constructive flexible advise- yes, concrete rules-no. I would like to think that my versatility comes from the lack of past conflicting rules as I have always been free to experiment without constrictions, so I don’t break rules as I have none. If a job does not look visually right then don’t look elsewhere for an answer or advise because the answer will be found in front of you as long as you identify the problem or problems and work with them. It may take some time but well worth it.  \nDon’t forget also the importance of market research. What bugs me with many graphic designers is that their work may well be visually creative and often exciting but too often they do not clearly communicate. it is obvious that the so much work is done on the computer-nothind wrong with that- but when you see logos for example on moving vehicles they usually fail miserably as no market research had been done. Work on livery needs to be more spaced out and clearer due to foreshortening and movement. The artwork may well look acceptable on screen inches from the nose but in situ is something else.\n\nI feel this is going on too long as there are so many things to consider, so I will stop and just conclude by saying that under current situations I would not waste my money by going to get help in an art schools or design college. Concentrate instead on having more faith in yourself, learn by questioning ’failures’, seek advise but draw your own conclusion from them, be humble rather arrogant and don’t let ego in any form get in the way. Draw, draw, draw and OBSERVE, experiment and trust your instincts. At times you may need to learn to be a loner and not blindly follow the crowd. If you are interested you may have a look at my website where you can read more about my beliefs under the ’About’ tab.\n\n[www.ieuanreeslettering.co.uk](http://web.archive.org/web/20090521202651/http:/www.ieuanreeslettering.co.uk/ \"www.ieuanreeslettering.co.uk\")\n\nIeuan Rees\n\n"
    },
    {
      "time": " 17.May.2009 8.19am",
      "content": "Hi James, consciously picking a school is a thing not many people can do. It’s a great opportunity.\n\nIf I had to go trough school againg I would pick a big school because there you will find more chances to know people, teachers, ideas, etc. You will have a more diverse learning environment.\n\nAlso I would prefer a program focused on design instead of art. Art and design thinking are different, you need to learn the designers’ way.\n\nFinally I think the student is way more important than the school. A good student will learn much, wherever he is. School is good if it provides you with chances of learning, that’s why I would choose a big design centered school.\n\nIn landing a job nothing is more important than your portfolio, school is second term and after 4 years it becomes almost irrelevant as long as you attended one.\n\nHéctor\n\n"
    },
    {
      "time": " 17.May.2009 10.00am",
      "content": "You will get out of a school only what you are willing to put into it. As Héctor said, go to a design school, not a fine art school (unless you intend to be an artist). You will meet many people. The students there are just as important as the faculty. This is the time in your life when your mind is open to absorbing at a higher rate than you will ever see again. Use that time. Don’t squander it “waiting” for the perfect moment.  \nThe choice to be made is if you want to become a designer or not. If yes, then go to design school. If you are looking for a field that brings wealth then choose another. That too, can be a crap shoot.  \nAsk yourself, if I don’t go to design school, then what else will I do? What would be an alternative either school or career? Whatever you do, don’t sit around and bemoan the poor economy. You can’t fix it so you just have to go on. There will be people who succeed in bad times, but the ones who do will never be the ones who just sit and wait. You can’t grab the ring if you don’t reach for it with all your being. Fearing failure is the greatest inhibitor to success.\n\nChrisL\n\n"
    },
    {
      "time": " 17.May.2009 10.26am",
      "content": "Chris,\n\nI I like your last line:\n\n’Fearing failure is the greatest inhibitor to success’.\n\nSpot on.\n\nieuan\n\n"
    },
    {
      "time": " 17.May.2009 3.16pm",
      "content": "Rather than go to design college, take part of that $100,000 you would spend and buy a computer, some software, a lot of books on design, and get to it. Supplement that with some well chosen Continuing Ed courses, and you will most likely wind up ahead of the game.\n\n"
    },
    {
      "time": " 17.May.2009 4.09pm",
      "content": "“take part of that $100,000 you would spend and buy a computer, some software, a lot of books on design, and get to it”\n\nThat’s required for going to school as well.\n\n"
    },
    {
      "time": " 18.May.2009 12.35pm",
      "content": "You would be better off in another field.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090521202651/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 18.May.2009 3.13pm",
      "content": "Come to the North of England to study design and experience an environment where you can imagine, innovate, and explore ideas and materials. You will experience truth and produce original and authentic design.  \nAfter this experience you can practice and develop your design language how you want to.  \nI would advise you to surround yourself with people who care about you as a person first and foremost and that are not bothered about who you know or where you studied.  \nIn short your work will reflect how you observe life and represent your world citizenship.\n\n"
    },
    {
      "time": " 18.May.2009 4.22pm",
      "content": "I attended a university bachelor’s program in design, not an art/design school. The graphic design program there was small by comparison to the graduating class at most art schools, but the instructors were very talented and committed to connecting their students to the real world job market. That leads to quality internships (my peers went to Pentagram, The Attik, Martha Stewart Living, H&FJ, Merkeley, Design MW, Aveda, The Moderns, etc.) which turn into jobs. Portfolio is everything and networking is also everything.\n\nI was able to carve out a digital program in a print-centric school and take coursework from other departments like advertising, “web publishing” — love that dated term — anthropology, Russian, world religions, etc. I have no regrets.\n\nOf course I know people at quality schools like [CCA](http://web.archive.org/web/20090521202651/http:/www.typophile.com/wiki/CCA) and [Art Center](http://web.archive.org/web/20090521202651/http:/www.typophile.com/wiki/Art%252BCenter) but they’ll have to answer from their own experience.\n\n"
    },
    {
      "time": " 18.May.2009 4.28pm",
      "content": "some thoughts, without much interconnection:\n\nI left a design program that taught me nothing about type for various internships with typesetters and printers where I learned far more - and got paid at the same time.\n\nSome programs are better than others. CCAC (I still call it that, even though I realize it’s just CCA now) has a good, interdisciplinary program.\n\nAvoid, at all costs, “graphic design” programs that are NOT interdisciplinary. Our field, above many others, requires its practitioners to be well versed in language, popular and historic culture, technology, and several other fields.\n\nThat said, $100,000 could save the lives of an awful lot of people. I can’t imagine it’s worthwhile to pay that for a graphic design “education,” one you could probably acquire with more efficacy elsewhere.\n\n"
    },
    {
      "time": " 19.May.2009 12.02pm",
      "content": "I think it isn’t right when you only consider the paycheck or job / career that follows a study. Yes, it’s important, but for me the fact that you will be learning, expanding your horizon/knowledge, experiment, make friends and just generally have fun is much more important.\n\nI understand that finances play a big role, especially with the tuition fees being so rediculously and astronomically high in the U.S.  \nIn the Netherlands tuition fees are relatively low (approx. 1500 to 1700 euro’s a year, with exceptions), and basically all paid by the government, so effectively it’s free.\n\n"
    },
    {
      "time": " 19.May.2009 12.07pm",
      "content": "A formal design education is valuable for learning “best practices.” You will learn from others (peers as well as instructors) what you might not learn through learning on your own.\n\nDepending upon your goals, you may not need an expensive four-year school. Many community colleges offer outstanding design programs. I’d already had (unrelated) degrees and (related) experience when I attended classes in City College of San Francisco’s Graphic Communications department. I didn’t go for a certificate, just the knowledge.\n\nMany students in my classes who’d been in four-year art colleges commented that the CCSF courses were better than many they’d had. I had many fine instructors.\n\n"
    },
    {
      "time": " 19.May.2009 12.28pm",
      "content": "_“In the Netherlands tuition fees are relatively low (approx. 1500 to 1700 euro’s a year, with exceptions)”_  \nIn [ex-East] Germany, I paid 35 euros a semester. No lie. I don’t know if it is a bit more expensive for overseas students, but nowhere near the astronomical fees charged in the States. So if tuition fees are the main obstacle, studying abroad might really be an option to consider.\n\n"
    },
    {
      "time": " 19.May.2009 2.05pm",
      "content": "I am just graduating from an intense design program (Drexel University in Philadelphia) and I can pretty much say my education in design was the most valuable thing I have gotten in life. That being said, I don’t feel a lot of students get the same rigorous and professional design education at every school; I chose a great program that was geared to being a design professional, and I specifically DIDN’T choose an art school for the lack of real-world preparation they tend to send students off with. To each their own. Had I not gone to a design school (40K a year I might ad) I wouldn’t stand a chance in the local job market, and I wouldn’t get taken seriously. And I also would never have considered any future ambitions of going to grad school (which is eventually my plan) to pursue higher levels of design culture, criticism and theory.\n\nSo yes, expensive, but my education was worth every penny.\n\n"
    },
    {
      "time": " 20.May.2009 12.43am",
      "content": "“No matter how good the economy gets, entry level design salaries aren’t likely to keep pace with the explosion in tuition over the last decade. Tuition alone at CCA is $16,452 per term.”\n\nI don’t think this is remotely relevant to the question you’ve asked. If you shape education solely around what it’s going to give you monetarily, then you’re really not thinking about what an education is.\n\nI don’t regret for a minute my expensive art school education (and yes, I’m still paying it off.) I learned how to think, how to problem-solve, the relevance and anecdotes of art history, how to use my hands to design, how to look at type that isn’t in Illustrator, and quite importantly, I learned directly from experienced thinkers and superb teachers.\n\nWe also had to learn a minimal amount of software on the way. Anyone remember Director? I’m sure glad I didn’t spend time at a State school with 30,000 other students just to learn obsolete programs.\n\n"
    },
    {
      "time": " 20.May.2009 5.20am",
      "content": "So much can be said on this subject.\n\nI recommend you search for the answer to your question within your program. If there is justification for the debt you will owe, then by all means, accrue the debt. What bad is there to be had if you’re getting something from the fees you pay? If you feel like you will achieve nothing, however, then by all means either find another program, or enroll into another college. Really, only you know what is valuable to yourself. Other people can tell you what is important outside you, but within you, we can’t answer that.\n\nI also must contest the idea by some others here that one cannot learn design at an art school. Granted they require different subtleties (pre-press and Web development classes will be scant), but the idea that design and art are two separate fields—in total isolation—is elitist at best. I know that both fields demand different things, but their mediums are virtually one in the same. Developing your artistic mind will keep certain faculties well-groomed and polished for your design mind. Obviously, it is 95% sure that exiting with a BFA in anything but design (or a BFA in design from a very artsy school) will not IMMEDIATELY prepare you for the field, but several years of practice, or an “Eh” job in design will temper you.\n\nAs a student in a Liberal Arts college right now, I’ve seen professors of Law who majored in Shakespeare studies and excellent Sociology professors whose original BAs are in Economics. You have a fair share of Business folk who all did God knows what prior to college, and the very common doctor and dentist who studies history or music in undergraduate. If a scholar can make the leap, a designer certainly can.\n\n"
    },
    {
      "time": " 20.May.2009 7.05am",
      "content": "\\> _So if tuition fees are the main obstacle, studying abroad might really be an option to consider._\n\nYes, exactly, I should have added that to my previous post. :)\n\n"
    }
  ]
}
