{
  "id": "58037",
  "title": "Fun with interpolation (but remember to save your work)",
  "forum": "Jongseong's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20090521100328im_/http:/typophile.com/files/a_interpolation_6511.gif)\n\nOf course the software had to crash before I had saved any of my work (and I had prepared extra-light versions of several other letters as well), but at least I now know how to interpolate. And I at least salvaged a screen-grab to prove it.\n\nThe heaviest _a_ is from a grotesque I’ve been working on for the past few days. It’s quite heavy, almost a demi-bold, so I wanted to know that I could produce lighter weights as needed by drawing an extra-light extreme and interpolating. I can probably do the same thing for darker weights. This, of course, isn’t news to any of you type-design wizards, but it’s the first time I’ve tried this thing, all right? Please carry on...\n\n",
  "author": "<a href=\"/web/20090521100328/http://typophile.com/user/12009\" title=\"View user profile.\">Jongseong</a>",
  "time": "<br>",
  "uid": "12009",
  "comments": [
    {
      "time": " 16.May.2009 10.35am",
      "content": "Looks like you’ve figured it out quite nicely!\n\nIf I may make a stray design comment. I don’t think you need quite that much tapering in the extra-light master, at the lower join of the bowl to the vertical stem. Not saying you should get rid of it entirely, just reduce it a bit.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 16.May.2009 3.49pm",
      "content": "You’re right, that lower join is way too thin. I’ll have to draw the extra-light master again anyway, and when I do so I’ll be extra careful to keep the stroke thickness nice and even.\n\n"
    },
    {
      "time": " 18.May.2009 8.58am",
      "content": "I agree with Thomas, a little less tapering on the light version would be good.\n\n<cite>I can probably do the same thing for darker weights.</cite>\n\nDo you mean interpolating intermediate weights? Yes, that’s possible as well but you will find that it requires a little more reworking than in the lighter weights.\n\nNote that you can even generate the heavier weights from your light and regular using extrapolation (essentially the same as interpolation). Just enable extrapolation in the FontLab settings and drag the weight slider “into the yellow” and see what happens. Sometimes the results are more entertaining than useful but it’s definitely worth a try.\n\n"
    },
    {
      "time": " 18.May.2009 4.36pm",
      "content": "Thanks, Tim. I do expect drawing the heavier weights to require a lot more reworking. Meanwhile, quick and dirty extrapolation from the light and regular masters for your amusement:\n\n ![](http://web.archive.org/web/20090521100328im_/http:/typophile.com/files/a_extrapo_6168.gif)\n\nNot happy with the curves (I had to draw the extra-light again since I lost my previous work), but I can fix that later when I have the time. I think it makes sense to use an extrapolated bold weight as the basis for an extra-bold master. Lots of tweaking will be necessary, of course. Then I could interpolate the resulting master with the regular master to generate the intermediate weights. So I’ll be using three masters (extra-light, regular, extra-bold) to generate all the weights in this scheme.\n\nJust how I’m going to find the time to do all that remains to be seen.\n\n"
    },
    {
      "time": " 19.May.2009 5.19am",
      "content": "Is it Superpolator, FL Blend or some custom Application?\n\n"
    },
    {
      "time": " 19.May.2009 6.28am",
      "content": "It’s FontLab with RoboFab. I used the script presented [here](http://web.archive.org/web/20090521100328/http:/www.robofab.org/talks09/robofab_session5.html) with minimal modification.\n\n"
    },
    {
      "time": " 19.May.2009 4.24pm",
      "content": "In case you are interested in this design, I’ve put it up for critique:\n\n[http://typophile.com/node/58183](http://web.archive.org/web/20090521100328/http:/typophile.com/node/58183)\n\n"
    }
  ]
}
