{
  "id": "58030",
  "title": "Digital Branding Demands Custom Typography",
  "forum": "Joe Pemberton's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20131018211252im_/http:/typophile.com/files/typ_nytimes_reader_5528.png)\n\n_The image has been scaled down sample to fit this page._\n\nAdobe and The New York Times recently announced the [Times Reader](http://web.archive.org/web/20131018211252/http:/timesreader.nytimes.com/timesreader/). The [Adobe AIR](http://web.archive.org/web/20131018211252/http:/www.adobe.com/products/air/) desktop application is well designed and stays true to the New York Times brand, largely owing to the reinforcing quality of the Time's custom typeface.\n\nThis is web content. It's web content that is neatly poured into a desktop application. Why is this news? It shouldn't be, except that somewhere back in pre-history when the browser was being forged in the fires of mount Doom it made sense to render content with fonts installed on the client device, not native to the server where the files were hosted. (Sure, it also makes practical sense where 14.4 modems are concerned, even if it seems like an evil plot to control the races of middle earth.)\n\nThat was then. But why are we still stuck with a lack of web type options? We hear about technologies but aren't sure about implementing them. Font makers licensing agreements are only part of this equation but it's time for them to recognize their culpability -- even if it's not solely their problem. It's also time for digital designers to embrace font embedding technologies and show that they're willing to buy licenses for embedding quality fonts. Every major brand understands the connection between type and brand identity. It's time to embrace technologies that will let fonts have a rich and pervasive digital presence. It's time to sell type to designers and brands, and not to every single reader, viewer, and consumer.\n\nCan you imagine if ESPN had to display sports tickers in the fonts natively installed on your television? Absurd. But that's what may happen when you start seeing Facebook and YouTube television widgets. (It's true, you can buy these TVs today from Panasonic or Samsung.) One of the promises of Adobe's [Open Screen Project](http://web.archive.org/web/20131018211252/http:/www.openscreenproject.org/) allows designers and brands to embed type into applications and widgets across devices: desktop, mobile, and TV. The foundries who already allow Flash embedding (which is increasingly permitted by many foundries) will win here.\n\nTypography is a means for brands like the New York Times to hold onto an identity that is tied to a rich history in printed media, a media that is becoming harder for them to justify. And yet, as they move increasingly to digital channels they have to find ways beyond the browser to reinforce their brand identity. Isn't this obvious? It was back in 1996 when I started my career making web pages and cutting up hundreds, thousands of little GIFs. But somehow under the numbing weight of Sauron's browser we all grew apathetic. \"Fonts are for print guys\" or \"I need a font when I design a logo.\" If you are lucky you get a client who will let you use [sIFR](http://web.archive.org/web/20131018211252/http:/typophile.com/wiki/sIFR) because the days of all-Flash sites are dwindling. We saw the power of designing for machine-readability which good search engine optimization demands and gave up on GIFs (and at some point our souls).\n\nThe broader context and opportunity for designers, is creating digital experiences beyond the browser. Thinking beyond the browser extends to the desktop PC to handheld mobile devices, televisions, in-car experiences, etc. One of the gaps here is type.\n\nThe AIR app side-steps the browser discussion, but it underpins a much bigger discussion that is yet to happen on a broad scale in the design community. Designing for internet content that lives outside the browser will become a major discussion among web and branding firms in 2010. It's already a major discussion happening among consumer device UI companies like [Punchcut](http://web.archive.org/web/20131018211252/http:/typophile.com/wiki/Punchcut) and in foundries focused on device type like [Ascender](http://web.archive.org/web/20131018211252/http:/typophile.com/wiki/Ascender) and [Monotype](http://web.archive.org/web/20131018211252/http:/typophile.com/wiki/Monotype). Questions about brand identity and user experience consistency naturally surface when content and functionality get poured onto TVs, desktops and handheld devices.\n\nI have to finish with a more personal note. Many of my friends and digital acquaintances are type designers. Many of them are graphic designers who pursue this passion on the side. Fewer of them make a real living solely from font sales and I have sympathy for their business when I write this. It's simply the basic economics of demand. A web that is friendly to font embedding, and designers that embrace font embedding, will create demand for embedded type that will help type designers flourish.\n\n\\_\\_\\_\\_\n\n_For more about the Times Reader check out the video interview with Adobe's Jeremy Clark, \" [Ahead of the Times](http://web.archive.org/web/20131018211252/https:/xd.adobe.com/#/featured/video/200)\" on Adobe's Inspire publication discussing the user experience design thinking behind the app. Also on Inspire is \" [Reading the Paper with Khoi Vinh](http://web.archive.org/web/20131018211252/https:/xd.adobe.com/#/featured/article/189)\". Mr. Vinh is the New York Times' Design Director and the blogger behind one of my favorite design blogs [Subtraction](http://web.archive.org/web/20131018211252/http:/www.subtraction.com/)._\n\n",
  "author": "Joe Pemberton",
  "time": "14 May 2009 — 10:49pm",
  "uid": "1160",
  "comments": [
    {
      "time": "14 May 2009 — 10:59pm",
      "content": "\"Every major brand understands this.\"\n\nTo play devil's advocate (for the sake of discussion):\n\nIn the 10+ years of web publishing we've had thus far, rarely has the lack of custom font selection been seen as the major hindrance to the success or lack thereof of a particular web site by those of us that build them or use them.\n\nI think we web designers would be happy for an easy solution, but we'll keep on building web sites even if one doesn't materialize. At this point, it's a nice bonus rather than any sort of necessity.\n\nOf course, that doesn't change the intent of your message...to encourage more progressive font licensing to accommodate the web...which I agree with.\n\nAs for the NYTimes reader, it's definitely neat and looks great. However, PDF embedding, Flash Paper, now Air...rarely have the 'it's like print on your screen' concept Adobe has always pushed really ever stuck enough to make any dent in HTML. However, potentially the advent of new devices (iPhone, Kindle) will finally provide a surface for it to stick to more permanently.\n\n"
    },
    {
      "time": "15 May 2009 — 2:41am",
      "content": "Picking a \"web-safe\" font is the modern analogue of the decades ago typewriter and early desktop printing dilemma: \"You can have any font you want, as long as it's Courier.\" Now there are are a dozen choices, which isn't all that much better since it basically reduces to Times New Roman or Arial.\n\nThere's no technological reason why viewing a website in a browser shouldn't be like viewing a printed page or PDF, custom fonts included. The embedding a font in an image workaround should be a thing of the past.\n\n"
    },
    {
      "time": "15 May 2009 — 6:40am",
      "content": "As a type designer who does make a living at this I agree with Joe in many ways. The primary thing I am interested in is being paid for the work I do and the fonts I license. Creating custom fonts for branding that allows web embedding seems like a no brainer to me. Custom font solutions have always been sold on two levels, both equal. 1. Unique type for the brand 2. Unfettered licensing restrictions.\n\nI have no trouble with fonts being embedded I only ask for a modicum of protection. 99% of the consumers of web sites have no idea how web sites are delivered, even a @fontface font would be safe with these users. There are those nasty few who do go to great lengths to pirate, but wonder how much their impact really is.\n\nI talked to my attorney about allowing some sort of web embedding (coming soon in our new EULA and website) and his response was to strongly suggest that I formally copyright the font software with the USPTO. Doing so allows one to sue for both damages and costs, and makes it a little easier to go after blatant commercial infringement\n\n"
    },
    {
      "time": "15 May 2009 — 10:41am",
      "content": "Joe's post also makes me think the the current font licensing model of a price for a particular number of computers will also have to be rethought. Perhaps with the desire for web embedding, font licensing will take on more aspects of an enterprise model.\n\n"
    },
    {
      "time": "15 May 2009 — 11:30am",
      "content": "One of the key elements of why I find the new version of the Times Reader so good is how well the type reads on screen. To read up on the technology behind that you can read Miguel Sousa's (Adobe) post over at Typblography, [Times Reader Take Two](http://web.archive.org/web/20131018211252/http:/tr.im/ljcD).\n\n"
    },
    {
      "time": "15 May 2009 — 1:28pm",
      "content": "The Times Reader does have very nice on-screen type.\n\nAs an application, though, I'm still kind of scratching my head a bit. OK, it reads like the paper version. But it's more cumbersome than paper and a lot slower and smaller.\n\nI'm not yet sold on print-newspaper column layouts making a whole lot of sense on my laptop screen.\n\nI like it, it's neat, I hope it sticks around, but I don't think the Times Reader will be replacing HTML anymore than PDFs or Flash did.\n\nWhich, I suppose, is more of an argument for everyone to figure out how to best tackle @font-face.\n\n"
    },
    {
      "time": "16 May 2009 — 9:46pm",
      "content": "Lately I’ve been wondering if the solution is for somebody to start a new MyFonts style foundry just to allow the handful of font designers who want to allow font linking to stand out. Having such a resource might encourage others to follow, and would make it easy for web designers to find type designers who will do custom work, allow linking, and not expect a substantial increase in the fee.\n\n"
    },
    {
      "time": "14 Dec 2010 — 9:57pm",
      "content": "It is used as a general term to describe to creating and involve in any type of web page.The intent of web design is to create a website—a collection of online content including documents and applications that reside on a Web server/servers. The website may include text, images, sounds and other content, and may be interactive. Web design is a broad term used to encompass the way that content (usually hypertext or hypermedia) [web designing](http://web.archive.org/web/20131018211252/http:/www.antasoft.com/) that are delivered to an end-user through the World Wide Web, using a Web browser.\n\n"
    }
  ]
}
