{
  "id": "5805",
  "title": "(x) Overline fonts",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi, I wasn't sure where to post this question...   \n   \nI'm looking for a font that has all the letters overlined. It seems to be the only way to use overlined characters in Powerpoint, and those tend to be handy for scientific presentations. As long as the letters themselves are rather simple - no fancy stuff or anything - I'll be happy with about anything you might know about. TIA.\n\n",
  "author": "anonymous",
  "time": "28 Jul 2004 — 2:11am",
  "uid": "1203",
  "comments": [
    {
      "time": "28 Jul 2004 — 7:14am",
      "content": "Apparently, you can have overlining if you can use Unicode -aware software. See the [information from MyFonts.com](http://web.archive.org/web/20141226010930/http:/www.myfonts.com/unicode/203e/).   \n   \nI tried my suggestion about a blank underline above the letters, and it would only work in Word if you used a Tab. Not likely to be useful that way.   \n   \nI also have the nagging impression that I saw a new font recently that had an overline for all the lower case characters, but I can't recall where I saw it.   \n   \nI think the Unicode approach sounds the most promising, if someone knows of applications that can use that protocol.\n\n"
    },
    {
      "time": "28 Jul 2004 — 2:18am",
      "content": "I'm not sure what you mean with \"overlined\", Alicja? Do   \nyou mean something line [this](http://web.archive.org/web/20141226010930/http:/www.philsfonts.com/detail.html?sku=FF00296102P2) or something like [this](http://web.archive.org/web/20141226010930/http:/www.philsfonts.com/detail.html?sku=LI15330149P1)?\n\n"
    },
    {
      "time": "28 Jul 2004 — 2:29am",
      "content": "Uhm... Neither. I meant overlined as in opposite to underlined, so with a line going above the characters...   \nKind of like Header 1 over [here](http://web.archive.org/web/20141226010930/http:/www.w3schools.com/css/tryit.asp?filename=trycss_text-decoration) - except that's css, not a font by itself.\n\n"
    },
    {
      "time": "28 Jul 2004 — 2:41am",
      "content": "I fear you won't find that in a font, that's something that   \nyou typically achieve by using text or paragraph styles.\n\n"
    },
    {
      "time": "28 Jul 2004 — 2:49am",
      "content": "Yes... Problem is, Powerpoint has a very limited range of those, and both me and my father (who's the intended user of the font) have searched the thing thoroughly and found nothing that could be of use.   \nUnfortunately, if no one here knows of any font like that, I'll have to either create a font myself (a first for me) or create appropriate images and work with those, which is a none too nice prospect.   \nHence my still holding out hope that someone here might know of something, somewhere, that looks somewhat similar.   \nEither way, thanks for the quick response, Yves - very much appreciated!\n\n"
    },
    {
      "time": "28 Jul 2004 — 2:53am",
      "content": "Wait a little till the Typophiles in the Americas wake up.   \nWho knows? ![:-)](http://web.archive.org/web/20141226010930im_/http:/www.typophile.com/forums/clipart/happy.gif) Bye for now!\n\n"
    },
    {
      "time": "28 Jul 2004 — 7:03am",
      "content": "If your using powerpoint, click on View, Toolbars and enable the Drawing toolbar. It normally will be at the bottom of the window. You can then draw a line to the proper length and place it above the letters. You can then right click the line to adjust it width properties.\n\n"
    },
    {
      "time": "28 Jul 2004 — 8:15am",
      "content": "Hmm, got new info from dad - apparently, what he really wants (wish he'd told me earlier) is just the lowercase letters 'bcdnpqstu' be available \"overlined\", and, preferably, all the standard letters and numbers in the same style. At least if I end up creating the font from scratch, I won't have a lot of work, heh...   \n   \nOut of curiosity, could you post the links to the two fonts you mentioned with lines over and under, Mike?   \n   \nDoubtful if blank underlines will work in Powerpoint. Any sensible program, yeah, but I doubt it as far as MS is concerned.   \n   \nAs far as the Drawing thing is concerned, yes, I know about that, thank you, Bill. The problem is that drawing these every few seconds is bound to get tiring, and the slideshow my father's preparing is gonna be full of them.   \n   \nUnicode-wise, I'll have to see if I can work that into Powerpoint - might be my best chance yet (though I still doubt MS products and their workability, so we'll see).   \n   \nAnyway, thanks!\n\n"
    },
    {
      "time": "28 Jul 2004 — 6:54am",
      "content": "The closest I can think of that has only lines above the letters is [ITC Simran](http://web.archive.org/web/20141226010930/http:/www.myfonts.com/fonts/linotype/simran-itc/simran-itc/testdrive.html?s=ABCDEFGHIJKLMNOPQRSTUVWXYZ&p=24). Most of the uppercase letters have 'overlines', as you called them, but some of those with ascenders do not.   \n   \nI know two fonts with lines over and under the letters, but that doesn't seem to be what you want.   \n   \nOffhand, I would say using a blank underline in the line above a character would be your easiest method to accomplish this. Depending on the application you are using (such as Word?), that might not be easy, because of the ways MS tries to 'help' you format everything.\n\n"
    }
  ]
}
