{
  "id": "58053",
  "title": "Legally printing PDF documents with embedded fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m sure this topic must have come up on here at one point, but I’m not finding anything by searching, so I appologize if this is a repeat topic.\n\nI work for a commercial printer, and we would like to start accepting PDF documents from our clients and the general public and print them. For example, a small dentist may want to print a letter or invoice for his/her clients. The issue that I have run up against is the legality of printing fonts. It appears that in many instances, font vendors/creators (Microsoft and Adobe included) may provide a font with the product that was sold (such as Word) but only allow that font to be used and printed on the machine the product was purchased for.\n\nSome vendors state a font can be used in certain ways, but not for commercial printing, unless the commercial printer has a license. In addition, some fonts have fields- such as fsType that specify whether or not a font is allowed/not allowed to be embedded, previewed and printed, or edited. But then in many instances it seems contrary to the statement of checking with the vendor to verify if a font can be printed. For example, from fonts.com EULA, it states:\n\n“14. You may take a digitized copy of the Font Software used for a particular document, or Font Software embedded in an electronic document, to a commercial printer or service bureau for use by the printer or service in printing such document but only if the printer or service bureau represents to you that it has purchased or been granted a license to use that particular Font Software.”\n\nThe fact is that we would not purchase any fonts/licenses for our servers, especially given the wide range of fonts, costs, etc and the number of servers these files could pass through before they are actually printed. Furthermore, it seems that many font vendors/providers have similar EULAs so it could quickly become cost ineffective to try and obtain all possible fonts (or even try to contact the software vendors for each possible print job).\n\nDoes anyone know what would make it legal to print via a PDF document or if it is legal by embedding the fonts and what makes it legal? How have companies like Fedex/Kinkos/Staples/Office Depot avoided huge lawsuits in this matter if it weren’t legal? Are there previous legal cases to establish a basis from?\n\nPersonally, I couldn’t imagine why someone would purchase a font or product if they couldn’t take it to a commercial printer. It seems to be a huge can of worms that I wish I hadn’t been stuck with.\n\n",
  "author": "<a href=\"/web/20090531082759/http://typophile.com/user/44618\" title=\"View user profile.\">captain_smack69</a>",
  "time": "<br>",
  "uid": "44618",
  "comments": [
    {
      "time": " 15.May.2009 3.14pm",
      "content": "I would imagine the person who accepted the font EULA would be responsible for complying with its terms. You are accepting document files, locked for editing, temporarily storing them, and outputting them - you are essentially an output device - think of yourself as a Canon Bubblejet printer. Just as the EULA is not the BJC250C’s concern, I don’t see how the font EULA could be your problem.\n\nPS. Adobe and Microsoft both allow font embedding, with few restrictions. Microsoft’s most recent EULAs specifically call out a users rights to embed fonts in documents as defined by the OpenType spec.\n\nPPS. Warning: This here legal advice is provided by someone with no legal training on a sunny Friday afternoon in Seattle.\n\n"
    },
    {
      "time": " 15.May.2009 3.18pm",
      "content": "I’ll second Si. (and I’m another non-lawyer.) More and more EULAs are allowing fonts to be embedded in PDFs to be taken to print. Most, however, are print & preview only. But that covers your needs.\n\n"
    },
    {
      "time": " 19.May.2009 11.31am",
      "content": "I think if it’s a locked PDF it isn’t an issue at all. Personally I don’t care much if it isn’t allowed. If outputting a PDF or embedding fonts in a PDF would be prohibited by most foundries (or even some), it would basically be impossible to get something printed these days, as most printers have a PDF-workflow.\n\nI can’t think of a specific example, but it’s very probable that I’ve embedded fonts in PDF’s when it wasn’t allowed in the EULA.\n\nAnd, as Tiffany already mentions, it’s usually a case of previewing and printing only anyway.\n\n"
    }
  ]
}
