{
  "id": "58051",
  "title": "FL Studio OT Feature Glitch?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I just ran into a strange OT Feature compile occurrence with a recently finished monospaced type I just completed.\n\nWhat happens is when I 'compile' the features FL Studio crashes. The whole application quits immediately.\n\nI immediately figured i'd do a trial and error by deleting all of the OT features and add them back one at a time but what was strange is after deleting all of them I added a basic ligature feature definition (as a quick test) and compiled only to have the same problem. Application quit immediately.\n\nThe feature was as stripped down as possible as well, like this:\n\nfeature liga {  \nsub F H by FH;  \n} liga;\n\nSo with troubleshooting my feature code solved (being that adding one simple feature definition, STILL caused the app to crash) no need to go back through all of the features I originally had in the file…\n\nI decided to just generate the font and test it.\n\nThe results of generating the font file are fine, all the features are intact, I tested them all, they work and show up fine, all the glyphs are there and everything seems good to go.\n\nThe one thing I noticed after 'generating' is the Output window contained this:\n\nsalt  \naalt  \ntitl  \nfrac  \nss01  \nss02  \nss03  \nss04  \nss05  \nss06  \nss07  \nss08  \n[WARNING] The feature file OS/2 overrides TypoAscender and TypoDescender do not sum to the font bbox size!\n\nAny ideas? Am I missing something?\n\nOpening any previous font build and 'compiling' is fine.\n\nIt just happens to be this particular font file and I have no idea why.\n\nAt this point since the generated file seems to be fine I'm assuming it is some type of glitch and proceeding forward but if anyone else has any similar experience or know what the problem might be please advise.\n\nThis problem is definitely the first of it's kind for me. I've had a few feature syntax errors in the past that would be described in the Output window that I've successfully fixed with no crashing of the app so this whole problem so far doesn't make sense.\n\nIf there was a real issue it seems the font wouldn't successfully 'generate', or the Output window would list a more serious problem when generating, correct?\n\nThanks,\n\nMike\n\n",
  "author": "<a href=\"/web/20100203082735/http://typophile.com/user/17099\" title=\"View user profile.\">Mike Jarboe</a>",
  "time": "<br>",
  "uid": "17099",
  "comments": [

  ]
}
