{
  "id": "58064",
  "title": "Logo for a soap company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey guys- just wanted to get some feedback/suggestions on this logo. Its for a brand new mom and pop soap company. They use high end ingredients so they are charging a premium price, and need a logo to reflect that. Any thoughts?\n\n| Attachment | Size |\n| --- | --- |\n| [sevensoapseal.jpg](http://web.archive.org/web/20110309084108/http:/typophile.com/files/sevensoapseal.jpg) | 118.49 KB |\n\n",
  "author": "<a href=\"/web/20110309084108/http://typophile.com/user/44619\" title=\"View user profile.\">mchalmbrero</a>",
  "time": "<br>",
  "uid": "44619",
  "comments": [
    {
      "time": "",
      "content": "It's okay. It works fine, and that's fine if fine works for you. It's not going to stand out on a shelf full of handcrafted soaps. Are you doing just the logo, or are you doing the packaging as well. If not, do you know what the soap looks like, and what the packaging looks like?\n\nHow about something that looks handcrafted?\n\nI think that there is huge potential for the logo.\n\n"
    },
    {
      "time": "",
      "content": "I agree with the hand-made feel. I think the idea is nice, but maybe try actually penning it out on paper first and bring that image into Illustrator to work with and perfect. Go from there and see what happens.\n\n-AB\n\n"
    },
    {
      "time": "",
      "content": "The highlight and shadow shapes are not geometrically correct. Is that intentional?\n\n"
    },
    {
      "time": "",
      "content": "Seven… soap… who's your client, David Fincher? :-)\n\nI like the colors, they seem fittingly soapy. I agree with the others though that the \"handmade\" quality isn't really represented.  \nIt might be interesting to consider what the soap itself looks like. For example, I had some handmade soap recently that's deliberately cut non-orthogonally and has extra ingredients that are kinda chunky and sticking out here and there, so that seemed/felt really handcrafted. If your soap looks like that too –not perfectly \"smooth\"– that should possibly reflect in the packaging/logo as well.\n\nThe difficult part in this case would be to find a look that communicates \"handcrafted\", with all the irregularities that entails – but make the irregularities feel like a sign of quality, not amateurism.\n\nSo I'd try some handlettered ideas. Carefully crafted faux type could really rock.\n\n"
    },
    {
      "time": "",
      "content": "I agree about the hand touch. Also, I feel like the 7 could be larger.\n\n"
    },
    {
      "time": "",
      "content": "in addition, perhaps some careful shadowing/faux embossing on the 7 might help. letters are usually pressed into soap bars, maybe that can come across subtly in the logo\n\n"
    },
    {
      "time": "",
      "content": "maybe you sould try beginnig with one color logo. I agree with the hand touch, maybe a lightly stamp look. You should look for hand writting font, something stylish, look at myfont.com.\n\n"
    },
    {
      "time": "",
      "content": "oups [www.myfonts.com](http://web.archive.org/web/20110309084108/http:/www.myfonts.com/ \"www.myfonts.com\")\n\n"
    }
  ]
}
