{
  "id": "58073",
  "title": "Small Clothing Business",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello  \nThis is a design for a very small female clothing business. For the age of 18-35. Simplistic, Japanese style was used for the store furnishing. This is the logo.\n\n| Attachment | Size |\n| --- | --- |\n| [camellialogo2[1].jpg](http://web.archive.org/web/20130623051347/http:/typophile.com/files/camellialogo2%5B1%5D.jpg) | 192.05 KB |\n\n",
  "author": "creativemilk",
  "time": "17 May 2009 — 2:42am",
  "uid": "44645",
  "comments": [
    {
      "time": "17 May 2009 — 2:47am",
      "content": "the top one is nice, but the colors scream grandma and not young female imo.\n\n"
    },
    {
      "time": "17 May 2009 — 8:49pm",
      "content": "second that, it's a dreadful color. but you can fix that anytime. go for the single heart as the point on the I in the first direction. the size of that heart in the first exampleis good too--the second direction has them too small and too big, attracting too little or too much attention. the first one's heart matches the weight of the serif on the top bar of the letter a next to it rather well.\n\n"
    },
    {
      "time": "17 May 2009 — 9:26pm",
      "content": "what are you recommendations on the coloring guys. this client specified pink and it seems that she is very satisfied with this. but i look forward to your suggestions! thanks in advance.\n\n"
    },
    {
      "time": "17 May 2009 — 9:46pm",
      "content": "Cotton candy pinks aren't really appropriate for 18-28 year olds. They might see it as either \"old lady\" or \"little girl.\"\n\nHonestly? Combined with the heart over the i, I'd have rolled my eyes at this logo when I was in my early twenties. A hot color could change that...I'd head towards richer, bolder shades of pink that pop - like a warm, saturated magenta.\n\nThis flower might be a good image to hit with the eyedropper:\n\n ![](http://web.archive.org/web/20130623051347im_/http:/typophile.com/files/magenta-flower_5339.jpg)\n\n"
    },
    {
      "time": "17 May 2009 — 10:09pm",
      "content": "Here goes the variations.  \n [http://img36.imageshack.us/img36/6949/camellialogocolorvariat.jpg](http://web.archive.org/web/20130623051347/http:/img36.imageshack.us/img36/6949/camellialogocolorvariat.jpg \"http://img36.imageshack.us/img36/6949/camellialogocolorvariat.jpg\")\n\n"
    },
    {
      "time": "18 May 2009 — 2:34am",
      "content": "This is nice. Of the new colours, the top right is my favourite.\n\nMy 2 öre, I think you should consider smoothing out the spikes in the top left flower petal.\n\n"
    },
    {
      "time": "18 May 2009 — 5:12am",
      "content": "I agree that the entire concept seems too old-fashioned to appeal to the intended market.\n\nThat aside, the centre of the flower seems almost perfectly circular. I think it would be better as a less geometric shape, as it's drawing my eye for no real reason.\n\nRoss\n\n"
    },
    {
      "time": "18 May 2009 — 10:24am",
      "content": "I like the three on the left, but it's hard to decide without seeing the typography, too.\n\n"
    },
    {
      "time": "19 May 2009 — 6:07pm",
      "content": "Guys. I am currently experimenting with Georgia. It is a font the client really likes. But I wonder if it's good to use such a commonly known typeface on a logo? Are there certain things I should be aware when I use Georgia, like its kerning or if I can modify the characters. Btw, is it legal to modify typefaces?\n\n"
    },
    {
      "time": "20 May 2009 — 3:16pm",
      "content": "i agree with rlynch, whatever the color the project looks for grandma and grandpa (mostly grandma)  \nand also is \"déjà vu\" soo much, the kind of stuff you can find on wallpaper. Sorry to be so harsch,  \nbut i think you have to start over or find a way to stylise this a more actual way.\n\n"
    },
    {
      "time": "21 May 2009 — 9:11am",
      "content": "You mentioned simplistic Japanese styling for the store furnishings. Was that supposed to be a source of inspiration? Could it be a source of inspiration?\n\nYour client may like what you've produced at this point, but with the heart on the 'i' it plays as kawaii kitsch, and not very hip or well-directed towards an 18-35 female demographic.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "21 May 2009 — 10:00am",
      "content": "Try pairing the pink with black instead of white to make it look more youthful.\n\n- Lex\n\n"
    },
    {
      "time": "21 May 2009 — 10:47am",
      "content": "Check the license agreement regarding whether or not you can mod the font. I don't envy your position; sometimes the customer (client) isn't always right, but getting paid is what you're after in the end.\n\n"
    },
    {
      "time": "21 May 2009 — 9:17pm",
      "content": "Imo your current styling does kinda lean toward \"grandma\" like others are saying, but it also leans toward rich conservative. Is this 18-35 demographic the young hipsters or the polo and pimm's crowd?\n\nI this Lex's suggestion of black type is a good idea.\n\nPerhaps a more graphic or geometric styling of the flower would bump up the vitality of the mark?\n\n"
    },
    {
      "time": "22 May 2009 — 10:51am",
      "content": "part of the problem could be alleviated if this wasn't a 100% computer generated project. an illustrative logo would seem so much more beautiful and engaging. inspiration for that could be in tattoo flowers, japanese tattoos, etc. That type of styling would certainly seem more fit for the age group.\n\n[http://fc06.deviantart.com/fs36/f/2008/247/4/5/Pink\\_Flower\\_heart\\_tribal\\_...](http://web.archive.org/web/20130623051347/http:/fc06.deviantart.com/fs36/f/2008/247/4/5/Pink_Flower_heart_tribal_TaT_by_2Face_Tattoo.jpg \"http://fc06.deviantart.com/fs36/f/2008/247/4/5/Pink\\_Flower\\_heart\\_tribal\\_TaT\\_by\\_2Face\\_Tattoo.jpg\")\n\nprob. lots of good floral henna examples out there--see the last image here  \n [http://www.madregear.com/item\\_201/Motherink-Maternity-Tattoos.htm](http://web.archive.org/web/20130623051347/http:/www.madregear.com/item_201/Motherink-Maternity-Tattoos.htm \"http://www.madregear.com/item\\_201/Motherink-Maternity-Tattoos.htm\")\n\n"
    },
    {
      "time": "22 May 2009 — 10:58am",
      "content": "I second the above recommendation.\n\n"
    },
    {
      "time": "22 May 2009 — 11:10am",
      "content": "I would think an \"illustrative logo\" would not work very well at the tiny sizes needed for clothing labels, which is one of the most important places this logo will need to play... that's one reason I liked the top design rather than the bottom in the original post.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "24 May 2009 — 1:06pm",
      "content": "What happened to green? as in greenhorns... Young inexperienced people. If this is for young people, maybe vibrant green should be a great colour, because red somehow saturates anger in me... ;) Especially in this very logo here.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "28 May 2009 — 12:39pm",
      "content": "Thank you for all the feedback, typophile!\n\nThis logo is actually hand drawn by me, then scanned into Illustrator. I like your idea, evanbrog, but like Phinney said that it wouldn't be ideal for a logo that will go onto clothing tags and such. To clarify, this shop targets the mid to upper-class, not very hipster and mainstream. And also this is a very small store, the floorplan just about the size of a single decker bus.\n\nAnd all those Grandma comments just make me laugh! Talk about how off-the-brief my work turned out. I wonder how Victoria's Angels manage to use so much pink and still look appealing!?\n\n"
    },
    {
      "time": "28 May 2009 — 5:21pm",
      "content": "well for the audience, it wouldn't have to look so punk rock. but i disagree as to this not being able to be done on a clothing tag.\n\n[http://img85.imageshack.us/img85/5577/EdHardy\\_BlackT-Shirt\\_Tag1.jpg](http://web.archive.org/web/20130623051347/http:/img85.imageshack.us/img85/5577/EdHardy_BlackT-Shirt_Tag1.jpg \"http://img85.imageshack.us/img85/5577/EdHardy\\_BlackT-Shirt\\_Tag1.jpg\")\n\n"
    },
    {
      "time": "28 May 2009 — 5:35pm",
      "content": "You wonder how Victoria's Angels look appealing? Seriously?\n\nHere's a clue: the pink is used to tone it down!\n\n"
    },
    {
      "time": "29 May 2009 — 1:08am",
      "content": "You are right evanbrog, perhaps that really isn't a problem! Apologies. Anyway let's see how things go with her store. She just opened and everything seems to be on the right track. Let's see if any customer is going to criticize on the logo's color.\n\nThanks again!\n\n"
    },
    {
      "time": "8 Jun 2009 — 11:14pm",
      "content": "Hmmm, good point, I was thinking of cases where the logo is essentially embroidered on the tag. But if it's printed CMYK process at press resolutions, well, you can do almost any darn thing you like.\n\nThat being said, in the long run logos may be used in all sorts of other ways, and an identity design generally should include a single-color version that can be reproduced under appalling conditions. :)\n\nCheers,\n\nT\n\n"
    }
  ]
}
