{
  "id": "58097",
  "title": "New Letterform Design Site: Iskra Design+Alphabet Roadtrip",
  "forum": "Release",
  "tags": [

  ],
  "content": "I have just stumbled onto Typophile. Where have I been all my life? What great forums and people and subject matters dear to my serifed heart. It is lovely to meet others equally afflicted by the alphabet.  \nI hope you will visit my new letterform design site at [http://www.iskradesign.com](http://web.archive.org/web/20100203015840/http:/www.iskradesign.com/ \"http://www.iskradesign.com\") and the attendant blog, [http://www.alphabetroadtrip.com](http://web.archive.org/web/20100203015840/http:/www.alphabetroadtrip.com/ \"http://www.alphabetroadtrip.com\"). The first is the portfolio for my lettering and calligraphic design business,and the second is a more freewheeling mostly visual blog about signage, poetics and process. Alphabet Roadtrip has a section called Signs I Like for which I am soliciting contributions. I'm looking for the naive, the quirky,and the painfully executed. And a story. Google has rendered information useless without story, and Flickr has done the same for imagery. Go see, and you'll see. Hope to hear.\n\nIskra\n\n ![](http://web.archive.org/web/20100203015840im_/http:/typophile.com/files/FaithSmall_5227.jpg)\n\n",
  "author": "<a href=\"/web/20100203015840/http://typophile.com/user/44526\" title=\"View user profile.\">spark</a>",
  "time": "<br>",
  "uid": "44526",
  "comments": [
    {
      "time": "",
      "content": "My only critique is that if you’re going to put so much work on your web site, people will tend to hang around looking at it all, and will want to know more about how it came into being. A section with photos of your sketches and work in process would be a delightful addition.\n\n"
    },
    {
      "time": "",
      "content": "Lovely new site Iskra. I've been an admirer of your work for years. Glad to see you discovered Typophile.\n\n"
    },
    {
      "time": "",
      "content": "James,  \nIn my next life I will do this, meanwhile maybe there is something to be said for mystery....? The idea of the blog is that eventually it will have my library of favorite books on it as well as some case studies of projects breaking down the process. Thanks for looking!\n\n"
    }
  ]
}
