{
  "id": "58098",
  "title": "rough draft of my spline PhD thesis",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been working on it for years, and recently pretty much gone into a cave to try to finish it, and, at long last, it's nearly ready. I finally have a reasonably complete draft of my PhD thesis on interpolating splines.\n\nIt's quite technical, and I'm not expecting too many people to follow along. Even so, I hope it gets across some of my motivation. Even though I hope the splines are useful in many applications, my primary reason for doing the work is to have a better tool for creating fonts. Also, I hope it gets across how deeply I have gone into the literature and theory.\n\nThe draft (in a compact format, not the actual thesis template) is here: [http://levien.com/phd/frame.pdf](http://web.archive.org/web/20141017115215/http:/levien.com/phd/frame.pdf \"http://levien.com/phd/frame.pdf\")\n\nIf anyone is inclined do detailed critique, chapters 1, 5, 6, 7, 8, and 10 are in near-final form. There's some reorganizing to be done of the elastica material, and integrating the results on the generator curve from the CAD paper. But overall I think it's pretty coherent. I'm excited!\n\nThanks to people here for expressing interest in the work, and responding to various queries and surveys I've thrown out over the years.\n\n",
  "author": "raph",
  "time": "17 May 2009 — 9:59pm",
  "uid": "4406",
  "comments": [
    {
      "time": "18 May 2009 — 12:04am",
      "content": "I’m excited too, I hardly wait to read it carefully. Congratulations!\n\n"
    },
    {
      "time": "18 May 2009 — 4:23am",
      "content": "\"The cipher reads “Qrzumu bapt dxqopddbbp...” and the key was published in the 1694 Curvatura Laminae with the detailed solution to the problem. Such techniques for establishing priority may seem alien to academics today, but are refreshingly straightforward by comparison to the workings of the modern patent system.\"\n\nlol :)\n\n"
    },
    {
      "time": "18 May 2009 — 7:21am",
      "content": "I've also downloaded it and am going to take a look either tonight or tomorrow. I figure you're not looking much for comments now in terms of general content and organization, so anything in particular —grammar, presentation, intelligibility by laypeople— you want us to keep an eye out for? It's the least we can do for bringing us spiro :)\n\n"
    },
    {
      "time": "18 May 2009 — 8:30am",
      "content": "I enjoyed chapters 5 and 6, but didn't read them closely enough yet to offer critique. I'll try to get back to you in a week or two when I have more free time.\n\n"
    },
    {
      "time": "18 May 2009 — 10:13am",
      "content": "Impressive work, Raph. I enjoyed the little chapter on real splines. There is a wooden boat building school on my island, and I'm now inspired to go down and look at their splines.\n\nThe chapter on the history of the elastica was fascinating.\n\n"
    },
    {
      "time": "20 May 2009 — 9:11am",
      "content": "Thanks so much for the kind words - it helps to hear as I'm on the final stretch.\n\n@guifa: I think what would be most helpful right now is identifying parts that are unclear or don't make much sense. Obviously if it says \"todo\" or has \\*\\*\\*'s, I already know about it, but I fear there passages that might have gotten munged in cut-and-paste, or older text that no longer makes much sense in context of newer work.\n\nThanks again!\n\n"
    },
    {
      "time": "20 May 2009 — 11:13am",
      "content": "Interesting stuff, will have a read through properly. You might already know section 2.1.1 (p5) ends mid-sentence?\n\n"
    },
    {
      "time": "20 May 2009 — 12:30pm",
      "content": "One thing that was a bit confusing was that chapter 3 referred repeatedly to equation 5.10, making the reader do a little non-linear run-around. Maybe the order of the chapters was reversed from an earlier version?\n\n"
    },
    {
      "time": "20 May 2009 — 12:56pm",
      "content": "Figure 2.7 also needs more explanation (a style of diagram used repeatedly later on). It's possible to figure out what it represents, but at first glance it's not clear what the points are or what the relation of top to bottom graphs is, especially since all the curvature definitions come in chapter 3.\n\n"
    },
    {
      "time": "20 May 2009 — 6:51pm",
      "content": "Raph, I did a browse-through. This looks fascinating. I hope to look more closely when some of the balls I'm trying to keep in the air clear up.\n\n"
    },
    {
      "time": "20 May 2009 — 7:42pm",
      "content": "Lovely work, congratulations. I just read the beginning so far...\n\n"
    }
  ]
}
