{
  "id": "581",
  "title": "Ripsaw",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I've been obsessed with tuscans and woodtype lately, and it was inevitable that I eventually create something in that area.   \n   \n ![ripsaw](http://web.archive.org/web/20150416053746im_/http:/www.typophile.com/forums/messages/29/1278.jpg)\n\n",
  "author": "glutton",
  "time": "5 May 2002 — 7:07am",
  "uid": "1204",
  "comments": [
    {
      "time": "5 May 2002 — 7:10am",
      "content": "I was thinking of adding some detailing to the letters... you think that's an idea or should I leave it as-is?\n\n"
    },
    {
      "time": "5 May 2002 — 7:39am",
      "content": "It's wonderful. ![:)](http://web.archive.org/web/20150416053746im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nI like the small irregularities in the enlarged \"E\", and if that's the detailing, I would go for it. The \"C\" could be a little bit wider (same goes for other round shapes).   \nBut other than that, I find it a solid.\n\n"
    },
    {
      "time": "5 May 2002 — 3:34pm",
      "content": "Wow. This is just astonishing!   \n   \nThe fishtails are super, and so is the leg on your 'R'. The irregularities and the misalignment of some letters only add flavour.   \n   \nHowever, that 'J' could all too easily be mistaken for a 'T'.\n\n"
    },
    {
      "time": "5 May 2002 — 10:30pm",
      "content": "Nice work! But to put a spanner in the works... I think the discussion about the irregularities is putting the cart before the horse, not least because they only seem apparent at 120 point or above. Personally I think the weight is wrong. I think you have a great idea here for a font that looks like a genuine 19th century Tuscan, but I think if they were making this design in those days they would have either made the stroke weight bolder and kept the ornamentation the same size, or they would have perhaps made the stroke weight slightly thinner and emphasized the ornamentation. I have yet to see an easy to read Tuscan, but there are beautiful ones, for sure.   \n   \nWithout going all the way and turning all the serifs into these ornamental \"claws\" - and possibly turning this font into something that has already been done 120 years ago - you might experiment more with the serifs and terminals.   \n   \nSorry if I sound negative. Despite the criticism I think you are onto something very nice here.\n\n"
    },
    {
      "time": "6 May 2002 — 4:48am",
      "content": "Good comments... I agree with everything everyone said.   \n   \nMartin -- yeah, a lot of tuscans seem to be very heavy... plus it would give me more surface area to add ornamentation to.\n\n"
    }
  ]
}
