{
  "id": "58121",
  "title": "Newsweek gets Martha makeover (was \"to get\")",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So says [mediabistro.com](http://web.archive.org/web/20090607101718/http:/www.mediabistro.com/unbeige/magazines/new_newsweek_out_with_straightforward_news_in_with_marthas_favorite_slab_serif_116768.asp).\n\n",
  "author": "<a href=\"/web/20090607101718/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 18.May.2009 2.04pm",
      "content": "It is amazing what 30 years and some PR will do.\n\nI find this genre dated, industrial looking and clunky. They are going to have to edit the copy to accommodate a long headline as Archer is not space conservative. Is not that the typeface tail wagging the editorial dog.\n\nAh, for the days when I did not even use Lubalin Graph but sporadically.\n\nMichael\n\n"
    },
    {
      "time": " 18.May.2009 2.33pm",
      "content": "I would be more impressed if Newsweek would just go back to being a credible news publication. I stopped reading Newsweek because the writing went downhill and they targeted the USA with a dumbed-down version targeted at Bush voters, complete with different covers that avoided contradicting Republican doctrine. No redesign is going to make up for that. Give me an intelligent editorial policy and design by Spiekermann—The Economist shows us why a real news magazine doesn’t need gimmicky graphics to sell.\n\n"
    },
    {
      "time": " 18.May.2009 2.37pm",
      "content": "When I read the article I couldn’t help but think about The Economist’s Spiekermann arrows vs Newsweek’s H&FJ Archer.\n\n"
    },
    {
      "time": " 18.May.2009 4.17pm",
      "content": "It’s already out, folks. Look for the “Obama on Obama” headline at your local newsstand.\n\n"
    },
    {
      "time": " 18.May.2009 5.23pm",
      "content": "I guess when you have a dead horse, you might as well beat the crap out of it since it can’t feel the pain anymore.\n\nChrisL\n\nPS: I am talking about Newsweek, not the font\n\n"
    }
  ]
}
