{
  "id": "58148",
  "title": "2d/3d version of a logo",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "I'm not sure about posting this on this site is right, since  \nyour about typo not logos but i'd like opinion about  \nmy logo. My 2d logo was created almost 10 years  \nago, it was created with a program by Adobe (i don't  \nrember the name) who made vector 3d and was much  \nbetter than the 3d function added to Illustrator.  \nSo basically my logo is a circle-thing mapped on a top  \nof a sphere. With cinema4d, added dimention to this  \nflat logo.\n\nwich one do you prefer? (and why if your kind)  \nthx\n\n| Attachment | Size |\n| --- | --- |\n| [lefty2.jpg](http://web.archive.org/web/20150317202154/http:/typophile.com/files/lefty2.jpg) | 16.96 KB |\n| [lefty3d.jpg](http://web.archive.org/web/20150317202154/http:/typophile.com/files/lefty3d.jpg) | 51.63 KB |\n\n",
  "author": "Lefty",
  "time": "19 May 2009 — 4:33am",
  "uid": "44690",
  "comments": [
    {
      "time": "21 May 2009 — 11:18pm",
      "content": "I actually prefer the lefty2.jpg  \nIt is traditionally 'correct' in respect to the laws of logo design.  \nIt scales well, its simple but eye catching. Its truly beautiful.  \nLess is more and just because gradients and three dimensional bells and whistles are sexy it doesn't mean they're practical. Imagine the 3d version at the top of a letter head photocopied three times over in black and white and then faxed across the country.  \nThe lefty2 would retain a true to form image.  \nAs it should.  \nIt's wonderful.\n\n"
    },
    {
      "time": "2 Jun 2009 — 12:51am",
      "content": "and 3d is dated.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20150317202154/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "21 Jun 2009 — 5:53am",
      "content": "Thanks for your answer. actually i only use the 3d logo for my Keynote presentation (PowerPoint if your PC) as a 3d looping animation for between two chapters and i wanted to try it in some flash real time 3d engine.  \nI have a friend who is 1000 times better than me in 3d and we are working on a new version that respect better the 2d logo.  \ni do a very little 3d, he is a specialist. I'll post here the new project when it's done, but now we have very little time to consume  \non this - not really important - project.\n\n@Ratbaggy: you maybe right, but for motion design it helps a lot.\n\n"
    },
    {
      "time": "19 Aug 2009 — 5:46pm",
      "content": "i have tried a new way to recreate my logo in 3d, whate do you think of the new version ?\n\n ![](http://web.archive.org/web/20150317202154im_/http:/typophile.com/files/lefty3dv2_5830.jpg)\n  \n\n ![](http://web.archive.org/web/20150317202154im_/http:/typophile.com/files/lefty3dv201_6232.jpg)\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:34pm",
      "content": "I prefer a simpler, subtler approach. This last one you posted just says you have a decent renderer on your machine. (Basically I like the one you're using as your avatar over this one).\n\n"
    },
    {
      "time": "19 Aug 2009 — 8:47pm",
      "content": "This 3d thing is not made to replace the 2d logo (i love it too much). but for example if you take only the alpha channel of the first image you basically have my 2d logo. It's not perfect but good enough to have fun with After Effect,so i can animate my logo and have fun with it. I don't know if i will ever use it for real, this is experimental.. i do 3d when i need to change idea because i'm stuck in other projects i don't really look forward that way for my job except for animations :P  \nand the (gold) texture with reflect is the better way to see the default of the model, i don't want to have a GOLD logo OMG no!! :D\n\n"
    }
  ]
}
