{
  "id": "58166",
  "title": "Eric Gill - decency in modern day type usage",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Assuming that the expert typophiles here have already discussed this matter, i apologise in advance for what i have no doubt will upset more than one of the visitors to this forum.\n\ni was recently asked to rework an outside designers input for promotional material prior to the receipt of final titles when i noticed that a bold Gill had been used (and pathetically stretched) in their \"signed off\" logo design. This work was for a family show across Scotland and as a borderline autistic typeface geek i rapidly recalled the somewhat shocking revelations of Gills life throughout the early to mid 90's where his extreme sexual misbehaviour was detailed. Not only was he prone to extra marital affairs (hardly unique) but also child abuse (his 2 daughters) incest (his sister) and most worryingly of all, \\*\\*\\*\\* (the family dog).\n\nI chose to avoid using Gill thereafter. Am i alone in this decision?\n\nJonathan S.\n\nInformation taken from;\n\nEric Gill by Fiona MacCarthy, Faber & Faber 1989.\n\n",
  "author": "onemandub",
  "time": "19 May 2009 — 10:26am",
  "uid": "7496",
  "comments": [
    {
      "time": "19 May 2009 — 10:28am",
      "content": "Clearly the correct English word for abuse of your family pet goes beyond Typophile rules.\n\nApologies.\n\nJS.\n\n"
    },
    {
      "time": "19 May 2009 — 10:36am",
      "content": "You are not alone. Aside from Gill I avoid all italic types as their inventor, Griffo, was a convicted murderer. I also avoid the work of contemporary type designers who support pot-smoking. Outside the world of type I never use the month name “July” due to the various crimes of Julius Cesar, or the word “Thursday” due to its association with the Norsk god of war.\n\n"
    },
    {
      "time": "19 May 2009 — 10:58am",
      "content": "Jonathan - you're the first I've heard of avoiding Gill's typefaces because of his personal behavior... Frankly I think there's enough evil in the world \\*right now\\* that I wouldn't be worrying about the morality of using a dead man's typeface.\n\n"
    },
    {
      "time": "19 May 2009 — 11:05am",
      "content": "I boycott museums because Picasso was a womanizer and Caravaggio a rapist, the Opera because Wagner was an anti-semite, modernism because it sprang from the minds of committed communists, religious cultists, vegetarians, and weirdos, and anything to do with Milton Glaser because he did a poster for that filthy hippie Bob Dylan.\n\n"
    },
    {
      "time": "19 May 2009 — 11:11am",
      "content": "There's humour here obviously. I'd still use the Anti-Nazi genius Paul Renner's work despite the fact that Martin Bormann decided \"Futura\" was perfect for their manifesto. Hardly Paul's fault after all. Several Nazi era German graphic designers were frowned upon by the party due to their refusal to take part in Third Reich matters - Otto Aicher (Rotis design genius) fell foul of his anti Nazi beliefs within Germany, finally being arrested after refusing to join the Hitler Youth...\n\nThe question is - where do you draw the line?\n\nUsing any English language that stems from Julius Cesar will bother few while obtaining design hints and tips from a self confessed child abuser from 80 years ago kind of changes the arguement a little.\n\n"
    },
    {
      "time": "19 May 2009 — 11:14am",
      "content": "As for the current trend in world wide nightmarish behaviour - agreed. I pay attention to that too. I am not suggesting we become some kind of moral arbitration service but i did wonder what was felt amongst yourselves so many thanks for the response.\n\n"
    },
    {
      "time": "19 May 2009 — 11:33am",
      "content": "There are many reasons not to use Gill. [May I suggest this as a starting point for alternatives.](http://web.archive.org/web/20150215061126/http:/typographica.org/001084.php) But there are at least a few reasons to use it. In my view, serving your clients needs is the \"higher ground\" to be found here. If that means using Gill, probably should gut it out. If you have latitude to look elsewhere, do it. This world is full of lovely typefaces who's first connotation is something other than dog-shagging.\n\n"
    },
    {
      "time": "19 May 2009 — 11:45am",
      "content": "Many thanks Randy - sorry for the delay in replying but i was listening to Gary Glitter for the last 15 minutes. You're absolutely correct regarding clients of course - most of whom appear clueless within the world of television graphics (my current lengthy domain) Typograhica certainly go to it where font alternatives are concerned. It's good to be reminded that the internet provides considerably more than pornography once in a while.\n\nYours gratefully\n\nJonathan S.\n\n"
    },
    {
      "time": "19 May 2009 — 12:04pm",
      "content": "People boycott all manner of products and businesses for their behavior. They may give some of their proceeds to organizations you disagree with. They may harm the environment more than you're willing to swallow. You may feel their EULA is totalitarian. And you may just plain not like them. To me this is all reasonable, and so is avoiding Gill Sans.\n\n- - -\n\nOne other thought: if you discovered that your dead uncle was a sexual predator, and also that he had left you something useful (eg. money) when he died, you have a couple of options. 1) Refuse the money on moral grounds, 2) Decide he was a jerk, but his money is fine and take a trip to Cancún, or 3) Give some or all of the money to an organization that helps victims of sexual crimes. Number three is the only solution with a redemptive element, which to me makes it a good option.\n\nNot sure what kind of \"Family Show\" this is, but using Gill might be akin to #3, even if you are the only one in Scotland who appreciates your redemptive intentions. Likely very few will recognize Gill Sans, know it's name, know the back story, and be offended. This is more about you.\n\n"
    },
    {
      "time": "19 May 2009 — 3:02pm",
      "content": "You're right - obviously. Your mention of the EULA is also somewhat coincidental as a recent arguement with one of London's current favourite type designers proved. How dare i fix his overpriced typeface with FontLab rather than waiting another 2 months and paying even more through the nose for a font that didn't work on an Aston caption generator. In future i'll tell the \"client\" to choose another more operation friendly typeface...\n\n"
    },
    {
      "time": "19 May 2009 — 6:06pm",
      "content": "_Otto Aicher (Rotis design genius)_\n\nUsually known as Otl Aicher...\n\n"
    },
    {
      "time": "19 May 2009 — 6:52pm",
      "content": "I love the man's type if not the man's behavior, so I'll go on using them.\n\nBut kudos to you for your decision. I can't fault that.\n\n"
    },
    {
      "time": "19 May 2009 — 8:20pm",
      "content": "Excuse me but that is unreasonable. Eric Gill did good type design work, and his type design work must be judged by it's own merits. Does it makes any difference on Eric Gill past behavior boicoting his work?\n\nHéctor\n\n"
    },
    {
      "time": "19 May 2009 — 9:41pm",
      "content": "I would be sensitive to the use of Gill typefaces in something like a brochure for survivors of childhood sexual abuse, simply because if someone were to draw attention to Gill's abuse of his daughters it would cloud the purpose of the brochure and may cause distress to the clients. This isn't a matter of principle, but of sensitivity.\n\n"
    },
    {
      "time": "20 May 2009 — 2:30am",
      "content": "2 things - 1: Otl Aicher was known to several acquaintances as Otto AND Otl...& 2: I never stated that Eric Gill was a poor typographer...he did however have a few bad decisions where his daughters, sister and their family dog were concerned. I didn't say NEVER use his fonts - i said that I had decided to do that. It IS however, VERY important that designers are aware what this man did to his own family during their youth the next time they rave about him...\n\n"
    },
    {
      "time": "20 May 2009 — 9:41am",
      "content": "Jonathan: _It IS however, VERY important that designers are aware what this man did to his own family during their youth the next time they rave about him._\n\nIs it? If they're raving about Eric Gill the man, then I would agree that they need to take into account the known actions of the man's life, including his known sins. But presumably most designers who rave about Gill are talking about his design work, not how he lived. Thanks to Fiona MacCarthy's book, I doubt if there are very many people interested in Eric Gill who are not aware of his abuse of his children or his ‘experiment with dog’. Indeed, if you look through the Typophile archives, you'll see that someone brings these things up almost every time Gill the man is mentioned.\n\nAnd if ‘what this man did to his own family during their youth’ is always to be acknowledged whenever his name is mentioned, then perhaps the coda needs also to be acknowledged: that he was contrite at least for what he did to his daughters and that his daughters forgave him.\n\nAnd I wonder, what is the purpose of calling to mind Gill's sins? What do you do with these sins once you have acknowledged them? You still have to judge the work on its own merits. You don't look at the Perpetua lowercase _a_ and think ‘Ah yes, there is the _a_ of a sexual predator if ever I saw one!’ You have, as I suggested above, a duty to your client to be sensitive to the appropriateness of using Gill's typefaces for particular projects, just as you would have to be sensitive to the playing of Wagner's wedding march at a Jewish wedding. There are contexts within which some things are inappropriate because of their associations. But there are also many contexts in which the same associations are irrelevant.\n\n"
    },
    {
      "time": "20 May 2009 — 10:39am",
      "content": "Jonathan, perhaps you could start a \"Ban Gill\" web-site. It would put you on the fast track to internet celebrity. In five or six years you may even get interviewed by the BBC.\n\n"
    },
    {
      "time": "20 May 2009 — 10:52am",
      "content": "\\>...shocking revelations of Gills life.. The question is - where do you draw the line?\n\nI draw the line when someone uses hearsay and innuendo as if there were established facts that can be substituted for a public record of a crime. But, we all have our own pencils.\n\nCheers!\n\n"
    },
    {
      "time": "20 May 2009 — 11:29am",
      "content": "\"I draw the line when someone uses hearsay and innuendo as if there were established facts that can be substituted for a public record of a crime.\"\n\nUnfortunately David - the information picked up by Fiona MacCarthy was in Gill's own volumous diaries. Hardly \"hearsay and innuendo\".\n\nAnyway - all i stated & asked in the first place was as follows;\n\n\"I chose to avoid using Gill thereafter. Am i alone in this decision?\"\n\nSome of the response to that clearly didn't help the discussion.\n\nPerhaps we can move along from this now.\n\nJonathan S.\n\n"
    },
    {
      "time": "20 May 2009 — 2:22pm",
      "content": "\\>the information picked up by Fiona MacCarthy was in Gill’s own volumous diaries... Hardly “hearsay and innuendo”.\n\nYou've hit the exact legal definitions of both hearsay and innuendo.\n\nYou are presenting as fact in your own decision, that what Gill wrote was true, that what Ms. MacCarthy read was accurate to what he wrote, and then, what she said she read of what he wrote is fact?\n\n\\>Am i alone in this decision?\n\nThere are so many possibilities for error in this string of past events from which you're building your facts, it would be inconceivable for me to base my typographic decisions on them.\n\n\\>Perhaps we can move along from this now.\n\nYes, now that you've asked us all what we think of your slime on someone who can't defend themselves, we can gladly move on.\n\nCheers!\n\n"
    },
    {
      "time": "20 May 2009 — 3:33pm",
      "content": "Very good David\n\nOne would have thought that you might already have studied this story far enough to know what is now commonly accepted as truth. My \"slime\" by the way is based upon the extreme disappointment of documentary evidence. I had absolutely no knowledge of Gill's extreme sexual behaviour prior to the BBC documentary or the MacCarthy biography.\n\nAre you suggesting that he simply chose to make up these appalling stories to ruin his character after his passing? Having seen several of Gill's erotic drawings prior to the 1980's & early 90's exposure, one merely compared it to several other artists work. You are clearly assuming his own written words were false because he wasn't prosecuted for his crimes of hellish abuse. He married in 1920 & died in 1940 David so his family were probably still coming to terms with his faults and flaws considering their potential ages at this point.\n\nYour criticism of what amounts to a fairly simple question says more about you than me. Considering the varied response to my first post i suspect i'm not entirely alone. I should point out that as a junior designer in the mid 1980's i couldn't see past Gill's type design and that even 20 years down the line when i see useage on a daily basis i find his work inspiring. Just not as much as i did back then.\n\nIn future i won't bother my arse seeking alternative opinion - but to explain clearly and finally;\n\nIf there had been ANY bullshit in MacCarthy's book or the BBC doc then The Eric Gill Society would have plenty to say about it. Even under English law MacCarthy would have been struggling to get away with work of this kind relating to a dead man if she was unable to provide the source. Which she did.\n\nThank you.\n\n"
    },
    {
      "time": "20 May 2009 — 4:04pm",
      "content": "<cite>Unfortunately David - the information picked up by Fiona MacCarthy was in Gill’s own volumous diaries.</cite>\n\nHave you ever come across an issue of _Penthouse Forum_ or _Heavy Metal_? There’s no shortage of guys who write about or draw sick sexual acts that never occur.\n\n"
    },
    {
      "time": "20 May 2009 — 4:35pm",
      "content": "Being that it's over 25 years since i've poured over Penthouse, i decided to check over some of the comments written since i read the biography in question (over a decade ago).\n\nNot sure where you are James but here in the UK it's still illegal to suggest sex with your sister, your daughters OR your dog whether it's true or not.\n\nThis article appeared in The Guardian online back in 2006.\n\n[http://www.guardian.co.uk/artanddesign/2006/jul/22/art.art](http://web.archive.org/web/20150215061126/http:/www.guardian.co.uk/artanddesign/2006/jul/22/art.art \"http://www.guardian.co.uk/artanddesign/2006/jul/22/art.art\")\n\nThis also corrects my statement that Gill married in 1920 - it was 1904.\n\nApologies for this - it is years since i studied Gill.\n\nJonathan S.\n\n"
    },
    {
      "time": "20 May 2009 — 4:55pm",
      "content": "<cite>Not sure where you are James but here in the UK it’s still illegal to suggest sex with your sister, your daughters OR your dog whether it’s true or not.</cite>\n\nFortunately I live in a country with a rather liberal constitution, so I can suggest that I rape bats, cook them, and hand them out on Halloween without much fear of persecution.\n\n"
    },
    {
      "time": "20 May 2009 — 5:17pm",
      "content": "Bats? Now that i could deal with.\n\n"
    },
    {
      "time": "20 May 2009 — 5:47pm",
      "content": "I'm not aware on any serious challenges to MacCarthy's exposé or even any denials.\n\nOne of Gill's granddaughters -- Juliana, the daughter of Petra Gill and Denis Tegetmeier -- lives in Vancouver. I met her husband a few years ago and she very kindly sent me a copy of the catalogue of beautiful works that David Jones made as gifts for her mother. Her husband alluded to Gill's sexual escapades when we spoke, with no suggestion that the stories were untrue or that the family sought to deny them.\n\n"
    },
    {
      "time": "20 May 2009 — 5:54pm",
      "content": "There was a discussion about this on Typographica in 2002, and I think these comments I made about the art-historical significance of the revelations are still valid:\n\n_Fiona McCarthy had a legitimate reason to expose Gill's sexual biography, since it is part of the history of the communities (communes, really) which he formed, and also relates directly to the tension of the religious and the erotic in his art. There is an interesting unpublished essay by the English novelist and critic Alan Wall, which analyses some of Gill's art in light of his 'priapic adventurism'. It is unpleasant stuff, but it informs the work and necessarily shades interpretation._\n\n"
    },
    {
      "time": "20 May 2009 — 6:02pm",
      "content": "Thank you for that comment John. Perhaps that'll inform certain others here.\n\nBeing attacked over this was particularly unfair when you consider my original point. Something that was never intended to add new scandal to an existing tale with factual backing.\n\nThat said, it IS now time that we leave this before someone else adds to a problem of some greater proportion.\n\n"
    },
    {
      "time": "20 May 2009 — 8:57pm",
      "content": "That's it. I propose that all font designers be bonded to avoid this sort of problem in the future.\n\n"
    },
    {
      "time": "21 May 2009 — 2:11am",
      "content": "Interesting thread - besides anyone's personal ideas, it raises the question of the relationship between a man's life (or ideas) and his work. Take, just to remember a few examples, Martin Heidegger, Celine, Ezra Pound and Knut Hamnsun, who were all, in different ways, supporters of nazism and fascism - proudly and in a public form. We are talking of some of the greatest cultural personalities of the XX century, four men who had a very strong influence (to say the least) on philosophy, poetry, literature. Should we ban their ideas or their books because of this?\n\n"
    },
    {
      "time": "21 May 2009 — 3:03am",
      "content": "\\>Should we ban their ideas or their books because of this?  \nAnd it doesn't stop there; Layla and Other Assorted Love Songs (the drummer killed his mom), Mozart, ( or 'most tarts', slept with teenage girls), The Who (their lead guitarist is a Nazi), The Beatles, (were all adulterers) and Elvis (must have dome something illegal or Nixon wouldn't have given him an FBI badge); they should all make you turn off the radio?\n\n\\>Her husband alluded to Gill’s sexual escapades when we spoke, with no suggestion that the stories were untrue or that the family sought to deny them.  \nBy \"the stories\", John, do you mean the stories of alleged abuse, or the usually run-of-the-mill man talk?\n\n\\>so his family were probably still coming to terms with his faults and flaws  \n\"Were probably still... \"? Why are you persisting?\n\n\\>Bats? Now that i could deal with.  \nI think that says more about you than about me. ;)\n\n\\>here in the UK it’s still illegal to suggest sex with your sister, your daughters OR your dog whether it’s true...  \nIf that is true of a private diary, (and you assume he wanted people to read it), no wonder most of the English have left.\n\nCheers!\n\n"
    },
    {
      "time": "21 May 2009 — 5:21am",
      "content": "Hopefully David this draws a close to a conversation that lost its way far too quickly.\n\nAs part explanation to yourself and NOT to the fool who's raping bats in his spare time -\n\nThe last job prior to the family show I was working on was in fact for a charity completely geared towards victims of child abuse. I did it for free from the word go. As did the producers and directors. These are not fun to work on at all and given the spiraling increase in child abuse cases and the a fact that when working on television news (something i did for 14 years as graphic operator/designer) you are hit with facts and information that simply cannot be broadcast. Appalling tales of cruelty and misery. I point blank refuse to accept the behaviour of paedophile trash irrespective of their abilities elsewhere. That comment applies across the board and is NOT aimed at Eric Gill.\n\n"
    },
    {
      "time": "21 May 2009 — 6:38am",
      "content": "On the relation of a person's sins and failings to their work, I think the answers are complicated, and have to be taken on a case by case, and even work by work basis. In the case of Gill, I think his type work is fine, honest work, and not much affected by his reprehensible side.\n\nGill's figural art is a different story. Though otherwise excellent I find it a bit repellent, and think it is influenced by his warped personality.\n\nOthers where the personal shortcoming influence the work include Heidegger, where his philosophy gives permission to fanaticism, in his case Nazism. Also for me it includes Woody Allen, who has now I think done at least three movies where people get away with murder, and it is condoned by the viewpoint of the movie.\n\n"
    },
    {
      "time": "21 May 2009 — 6:58am",
      "content": "\"Bat Raper\" would be an interesting name for a font.\n\n"
    },
    {
      "time": "21 May 2009 — 7:36am",
      "content": "_In the case of Gill, I think his type work is fine, honest work, and not much affected by his reprehensible side._\n\nDo you mean \"not much,\" or \"not at all\"? And if the former, what might the implied \"little bit\" be?\n\n"
    },
    {
      "time": "21 May 2009 — 10:24am",
      "content": "“Bat Raper” would be an interesting name for a font.\n\nWould that be \"Bat Raper\" Bold - Normal or Abnormal?\n\nI'd check over at Dafont now because the name'll have  \nbeen used already along with;\n\n\"I stole this from Fontworks via ISOHUNT and altered it's name only\" Ultra...\n\n"
    },
    {
      "time": "21 May 2009 — 10:29am",
      "content": "I remember John Hudson writing on typophile that Gill said he liked to shape his \"droopy\" D's that way because they reminded him of the shape of a girl's bottom. But I regard that as pretty normal eccentricity. His figural stuff can be creepy.\n\n"
    },
    {
      "time": "21 May 2009 — 10:34am",
      "content": "David: _By “the stories”, John, do you mean the stories of alleged abuse, or the usually run-of-the-mill man talk?_\n\nI mean the revelations in the MacCarthy book, which I'm not inclined to catalogue or attempt to calssify in terms of ‘alleged abuse’ vs. ‘man talk’. The less I have to think about them, the better. So far as I am aware, no one in the family has ever denied any of the revelations.\n\nThat's my last post on this topic.\n\n"
    },
    {
      "time": "21 May 2009 — 10:39am",
      "content": "\\> I point blank refuse to accept the behaviour of paedophile trash irrespective of their abilities elsewhere.\n\nYou can do and say anything you want about the convicted.  \nI agree that baby-bat-raping type designers should be avoided.  \nI wonder what effect the war had on Gill.\n\nCheers!\n\n"
    },
    {
      "time": "21 May 2009 — 11:08am",
      "content": "BTW we've [been here before](http://web.archive.org/web/20150215061126/http:/typophile.com/node/30280).\n\n"
    },
    {
      "time": "21 May 2009 — 1:52pm",
      "content": "_I wonder what effect the war had on Gill._\n\nGill was a conscientious objector. Though I suspect pacifists as a group are no more likely to commit sex crimes than their more belligerent brethren.\n\n"
    },
    {
      "time": "21 May 2009 — 3:22pm",
      "content": "\\>Gill was a conscientious objector.  \nGill is claimed to have believed a just war to be possible and was neither pacifist or CO by all accounts I am aware of.\n\nCheers!\n\n"
    },
    {
      "time": "21 May 2009 — 3:49pm",
      "content": "_Gill . . . was neither pacifist or CO_\n\nMy mistake, I was thinking of Stanley Morison. If you've seen one eccentric early 20th-Century British book-arts celebrity who converted to Catholicism, you've seen them all.\n\n"
    },
    {
      "time": "21 May 2009 — 3:53pm",
      "content": "As a skilled mason, it is unlikely that Gill joined up during the 1st World War. Engineers and technically skilled workers regularly avoided the army as they were so important to the home war effort. Conscription did not take place in Great Britain until later in 1916 'til the end of the \"Great War\" in 1918/19. Conscientious objector or not, his abilities as an artisan would be too important to send him off to the Somme where he would have probably died within 24 hours along with 60,000 others on day one. Conscientious objectors were treated terribly in the UK and potentially ended up in jail during both wars for refusal to fight. If one became an objector AFTER joining up then court martial and death sentence were inevitable for many young men. As for the facts of Gill, I don't have either of the biographies to hand to check on this but i dare say one of you does.\n\n"
    },
    {
      "time": "21 May 2009 — 4:19pm",
      "content": "\"In 1913 he became a convert to Roman Catholicism and was commissioned to make the Stations of the Cross at Westminster Cathedral, fourteen relief carvings which he carried out in 1914-18\"\n\nCommissioned clergy work would keep anyone out of the war whether they wanted to fight or not. In this case, Eric Gill was a lucky man. Years later of course these were the very carvings Catholic mothers demanded removal of following the MacCarthy biography. They remain there today.\n\n"
    },
    {
      "time": "21 May 2009 — 10:03pm",
      "content": "Hi Jonathan\n\n(IMHO the desecration and removal of many of Jacob Epstein's public sculptures in England far outweighs any controversy about Eric Gill's work in this field).\n\nI seem to remember that someone (was it Barry Deck?) in the early '90s created a typeface called _Canicopolous Script_ in response to the information in Fiona McCarthy's book – which at least was a creative response to the issue.\n\nSaying 'I won't use his typefaces' – when a customised Gill Sans Bold _is_ the corporate typeface of the BBC – is akin to cutting off your nose to spite your face, assuming you plan to continue working in broadcast graphics in the UK.\n\nThe title of your post is a misnomer; Gill may have been perfectly indecent in his personal life, but his contribution to 'modern day type usage' is indisputable, particularly in his serif designs and his writing.\n\nThere are better arguments for shunning Gill Sans [here in my article](http://web.archive.org/web/20150215061126/http:/www.typotheque.com/articles/re-evaluation_of_gill_sans) – which is just about the typography, not about the man.\n\n"
    },
    {
      "time": "22 May 2009 — 9:41am",
      "content": "I try to avoid anything by American designers because of the crimes by George W. Bush\n\n"
    },
    {
      "time": "22 May 2009 — 10:01am",
      "content": "Having already worked in broadcast TV here in the UK for nearly 18 years including various commissioned jobs for the BBC & BBC Alba i suspect i'm not planning departure anytime soon.\n\nAs for me cutting ANY part of myself off to spite matters; i'll be sticking to the decision to avoid any Gill typefaces unless they're completely necessary. Note the point i made about working for child abuse charity ads - you DON'T use Gill for those anymore do you?\n\nJacob Epstein wasn't hiding or flashing himself in some small English village throughout his condemned career. He sadly fell into disrepute due to the age and areas he worked within and because he was Jewish during a period of real anti-semitism here in the UK. Slightly at odds with the arguements relating  \nto Eric Gill.\n\nAll of that aside i appreciate the tone and intelligence of your response and in particular the link to your article which says alot about Johnston's contribution to a font best known as Gill's.\n\nMany thanks.\n\n"
    },
    {
      "time": "22 May 2009 — 12:14pm",
      "content": "I have to admit I completely understand Jonathan not wanting to use Gill’s typefaces after finding out that he took ‘man’s best friend’ a bit too literally. The singer of one of France’s best-known rock groups, Noir Désir, drunkenly beat his girlfriend to death a few years ago and I haven’t really wanted to listen to their music since.\n\n"
    },
    {
      "time": "22 May 2009 — 12:48pm",
      "content": "\"Des Visages des Figures\" (musically speaking) faded slightly at this end too.\n\n"
    }
  ]
}
