{
  "id": "58183",
  "title": "Mirabeau Grotesque (working name), with Latin, Greek, and Cyrillic",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This is my first serious attempt at designing a sans serif. It's a neo-grotesque with a low x-height. Here's a preview, though the anti-aliasing is a bit wonky:\n\n ![](http://web.archive.org/web/20150414172644im_/http:/typophile.com/files/mirabeau-preview_6098.gif)\n\nI would like this to be the seed of a versatile family, so I want the letter forms themselves to be quite neutral. The longer-than-usual extenders will give the letters plenty of character anyway. No kerning has been done.\n\nI need to do more about regularizing the stroke widths; so far, my optical corrections have been minimal. I deployed ink traps only on a number of Latin capitals.\n\nThere's a lot of room for improvement all across the board, so I'd love to hear your critiques.\n\n| Attachment | Size |\n| --- | --- |\n| [Mirabeau specimen.pdf](http://web.archive.org/web/20150414172644/http:/typophile.com/files/Mirabeau%20specimen.pdf) | 73.06 KB |\n\n",
  "author": "Jongseong",
  "time": "19 May 2009 — 4:22pm",
  "uid": "12009",
  "comments": [
    {
      "time": "19 May 2009 — 5:52pm",
      "content": "I loved it. Very clean design.\n\nAlthough I am not that experienced but personally I feel, your lowercase \\*w, \\*x, \\*y & \\*z need some work. \\*w need proper weight distribution, whereas \\*x and \\*z seems top heavy optically. Second joint is the letter \\*m seems a little weak.\n\n"
    },
    {
      "time": "20 May 2009 — 1:24am",
      "content": "Thanks, Satya. What would you suggest for the w? Since I don't have a well-developed eye for these things, it's not obvious to me how I should correct it. Right now, it has left-right mirror symmetry, the outer strokes thin somewhat, and the inner strokes are parallel and thinner than the outer strokes.\n\n ![](http://web.archive.org/web/20150414172644im_/http:/typophile.com/files/w-closeup_5218.gif)\n\nIn letters with similar top and bottom halves like s, x, and z, I tried to apply just enough optical correction so that the two halves look roughly equal in size whereas most typefaces make the top half visibly smaller. If some of the letters look top-heavy, then I'll have to adjust them. I'll have to try to get this balance uniform throughout the design, anyway. The capital S looks more top-heavy than the lowercase s, for instance.\n\nYou're right about the m. It has been modified, and it will be reflected in the next PDF update.\n\n ![](http://web.archive.org/web/20150414172644im_/http:/typophile.com/files/m-comparison_5423.gif)\n\n"
    },
    {
      "time": "20 May 2009 — 8:26am",
      "content": "I am telling based on what I have been taught. This could be totally wrong.  \nIn the \\*w, the first stroke(\\) should be thicker; second(/) thinner; third(\\), thicker than second; and fourth(/), should be thinner than the first. also it should match with the other letters in style and the grey value. It's exactly how you hold and draw this letter with a calligraphic pen. Same thing applies to all the other letters with diagonal strokes, such as \\*A, \\*V, \\*X, \\*Y, \\*K, \\*M, and so on. The rule remains same, just that the sans will have lesser contrast than that of Serif faces.\n\nSame thing goes to the circular letters as well. When you draw an \\*O with calligraphy pen, you get the maximum contrast at top right and bottom left (Ø). Even if your typeface has less contrast, you must apply this rule to make it look optically correct. Although all the sans-serif faces looks as if they have same stroke thickness all over, but it depends on the letter to letter. Eg, the vertical stem of the letter B should be thinner compared to the vertical stem of the letter \\*D since \\*B is more dense in nature than the \\*D.\n\nI don't know how many people follow all this, but I think a good typeface should take care of all this.\n\nBest\n\n"
    },
    {
      "time": "20 May 2009 — 9:27am",
      "content": "Thanks, Satya. I see what you are saying about the w. The thing is that I'm doing a neo-grotesque with strictly vertical stress. Modulation where the / diagonal is thinnest and the \\ diagonal the thickest applies to humanist sans serifs and even some grotesques, but not to this particular genre of constructed grotesques. Take a look at Univers or Helvetica for similar examples of vertical stress.\n\nI have not made the full optical corrections for the denser letters yet (B vs D, for example), because I'm not sure how much correction will be necessary. Such adjustments are very necessary in Korean typefaces because the density tends to vary more, but with a Greek/Latin/Cyrillic typeface you have to be more subtle. I have shaved off the stem weights in the densest letters, but I'm not convinced that B's density is such that it needs this type of adjustment. I am trying to keep the stroke widths as mathematically close as possible for the moment.\n\n"
    },
    {
      "time": "20 May 2009 — 1:04pm",
      "content": "You are probably right. It also depends of typeface to typeface.  \nBut btw, here is a scree grab of the letter \\*w from Univers LT Std 55 Roman, see it yourself.\n\n ![](http://web.archive.org/web/20150414172644im_/http:/typophile.com/files/w_Univers_4746.jpg)\n\nI hope you get some good feedback from experienced people, I am too amateurish to say anything.\n\nGood Luck!\n\n"
    },
    {
      "time": "20 May 2009 — 1:09pm",
      "content": "btw; v, w, and x are the most complicated letters for me. I never get them right at first draft.\n\n"
    },
    {
      "time": "20 May 2009 — 1:26pm",
      "content": "Thanks, Satya. That's a great picture!\n\nI did find that my mathematically symmetrical w appeared just the tiny bit asymmetric (the second diagonal looking a touch thicker than the third), but wondered if that's because I'm so used to the humanist stress axis. I'll try to learn from other fonts how they solved this.\n\nI also find v, w, and x very difficult, and they are often the last Latin lowercase letters I draw.\n\n"
    }
  ]
}
