{
  "id": "5820",
  "title": "Gaya",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "![gaya](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/messages/29/4162.gif)   \n   \ncomments are mostly appreciated,   \n   \nseg.\n\n",
  "author": "seg",
  "time": "8 Jan 2003 — 7:14am",
  "uid": "940",
  "comments": [
    {
      "time": "8 Jan 2003 — 7:41am",
      "content": "thats a beautifull \"Q\" you got there. i think that \"X\" is to wide in relation with the \"W\" (it looks with the same with even though the \"X\" is 2 pixel thiner)   \n   \nThe \"U\" and \"V\" are too similar between them, you should increase the angle in the \"V\".   \n   \nThe \"g\" needs another solution in the bottom, you should try to open it.   \n   \nBe carefull with the lower case \"L\" it could be interpretated as an \"\n\n"
    },
    {
      "time": "8 Jan 2003 — 7:44am",
      "content": "too narrow setting to be legible\n\n"
    },
    {
      "time": "8 Jan 2003 — 8:11am",
      "content": "I agree with everything cristian wrote, except maybe the \"g\" is OK (even though I favor the binocular form with the _open_ bottom). I'd add that if you're going to be funky with the lc \"el\", tilt it the other way (but that might throw off your spacing too much in a bitmap font).   \n   \nAlso: one can afford to be more flamboyant with the caps, and I think the UC \"G\" is cool (just maybe some \"tuck-in\" at the join), but I worry about the spacing of the UC \"Q\", since there really isn't any kerning in bitmap fonts (btw, the UC \"R\" is killer). Since you have two pixels of descender space, maybe bring down the tail lower and steeper, and cut the right sidebearing by a pixel. Lastly, I'd lose the last pixel on the tail of the UC \"J\" (you could bring that down another pixel too).   \n   \nAs for the letterspacing, do try 2-pixel gaps - it worked for Carter/MS: Verdana's biggest advantage over Tahoma is just that (although it uses up a lot more space).   \n   \nhhp\n\n"
    },
    {
      "time": "9 Jan 2003 — 4:02am",
      "content": "Not sure if the V is too similar than U. Maybe U is too square. Can you space the chars a little more?\n\n"
    },
    {
      "time": "9 Jan 2003 — 4:06am",
      "content": "Opps, Christian wrote about V/U before, sorry. Btw, I gont think that G needs that bottom.\n\n"
    },
    {
      "time": "9 Jan 2003 — 9:58am",
      "content": "Thank you very very much ,people. i took some of the helpfull advices and ill post a pic soon.\n\n"
    },
    {
      "time": "28 Mar 2003 — 10:25am",
      "content": "im back with a new version. this one is based on 3 colors (black and two greys). many changes were made; check out the sample:   \n[only lowercase was finished]   \n   \n ![gaya 3](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/messages/29/8103.gif)   \n   \ntell me what you think\n\n"
    },
    {
      "time": "28 Mar 2003 — 4:52pm",
      "content": "Hello Itay   \n   \n-This Gaya is Better than the first version   \n   \n-It will be interesting if you can compare this version with the older, in a paragraph text. If you taste it in the demo version of Bitfonter it will be easy then, to justify if Colorfonts will be better to read than the jaggie old bitmap fonts.   \n   \n-I am agree with the colors in 100%, and maybe on 200% but bigger... loose all the details.   \n   \nMH\n\n"
    },
    {
      "time": "28 Mar 2003 — 5:31pm",
      "content": "Stephen - did you see the type used on the buttons in Jeremy Tankard's site? its mindblowing. i was aiming to get gaya as slick as that.   \nand yeah, the looser letterspacing brought life to the design. i love that.   \n   \n\\> It will be interesting if you can compare   \n\\> this version with the older, in a paragraph   \n\\> text. If you taste it in the demo version   \n\\> of Bitfonter it will be easy then, to justify   \n\\> if Colorfonts will be better to read than the   \n\\> jaggie old bitmap fonts.   \n   \nwill do. but im using a PC, so unfortuntly for me i wont be able to test the font on bitfonter.   \n   \n\\> I am agree with the colors in 100%, and maybe   \n\\> on 200% but bigger... loose all the details.   \n   \ncould you please rephrase that? i didnt understand.\n\n"
    },
    {
      "time": "28 Mar 2003 — 5:54pm",
      "content": "Sorry for my bad english man!   \n\\>your font looks good on 100% size o screen, but in your big text samble, its looks diferent and worst, because the colors are not playing the role of antialiasing. I think that every size on screen needs a diferent antialiasing. I think i will gonna do it on Garadot, ITS A GOOD IDEA!!!!   \n   \nBTW   \ni am waiting for bitfonter for peecee too ![:-)](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nMiguel\n\n"
    },
    {
      "time": "29 Mar 2003 — 1:19am",
      "content": "yeah Miguel, seems like its taking them forever right?   \ni cant wait to see bitfonter allready.   \n   \n\\>Sorry for my bad english man!   \nthat makes two of us :D   \n   \ni just added an enlarged sample of the font, so people giving critique could see how exactly did i do the antialiasing. if i'll make more sizes for Gaya then ill make completely diffrent versions for the other sizes.   \n   \ni think manual antialiasing for Garadot is a fantastic idea. get it going, i say.\n\n"
    },
    {
      "time": "31 Mar 2003 — 11:50am",
      "content": "my oh my, maybe ill make it a photofont - [http://www.photofont.com](http://web.archive.org/web/20150414181134/http:/www.photofont.com/) .\n\n"
    },
    {
      "time": "31 Mar 2003 — 1:38pm",
      "content": "Itay, it's great to see work in hand-anti-aliasing: it's the ideal method for on-screen readability. Unfortunately, OSes don't support it well. It's a shame, but things like BitFonter are swimming against the current.   \n   \nI've been doing this stuff since '98, but there's still no good way to deliver them... Anyway, some ideas:   \n- The darker the font, the better you can apply the grays. With one-pixel bodies it's pretty hard.   \n- Resist the urge to place a lot of grays: it's better to use less grays than more, simply because blurriness is worse than aliasing. For example, those bits at the tops of ascenders are distracting.   \n- Keep the bodies of the letters as black as possible. For example, in the \"a\" the bottom-right gray is good, but the top-right gray is bad.   \n- Be careful how much you show your work in public: it takes a lot of work to get the grays _just right_, but it's very WYSIWYS: What You See Is What You Steal...   \n- Consider doing an outline font to match: give away the bitmap-only version, sell the full version.   \n   \nTake this to heart: you have to be extremely pragmatic. You have to make decisions that seem formally incorrect to arrive at good readability.   \n   \nGood luck!   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2003 — 1:39pm",
      "content": "thanks hrant. rethinking about this design over the last couple of days made me realise most of your points. and it sure helps to see someone holding your just-out-of-the-oven thesis and telling you its a good idea. ive allready noticing the destructive role of blurriness.   \n   \ncould you explain point 3 in detail please.   \n   \nare you planning to sell your screen font designs, or maybe you could share them with us?   \n   \nand ive got to admit, i dont have a clue on how to make an outline font of it. its seems very hard for my little technical knowledge.\n\n"
    },
    {
      "time": "1 Apr 2003 — 2:49pm",
      "content": "\\> point 3   \n   \nDon't try to use grays in a too-sophisticated manner (even though it's tempting). The low resolution of screens is still a very real limit. So for example in your lc \"a\" the gray pixel where the _top_ of the bowl connects to the stem is supposed to convey a gentle taper of the stroke (right?) but that sort of thing is too subtle\\* - it just creates more problems in terms of contrast against the background. On the other hand the gray pixel where the _bottom_ of the bowl meets the stem is good, because it helps reduce the clotting.   \n   \n\\* Note that you have more room for such subtlely in darker weights (and in greater bit-depths).   \n   \n\\> sell   \n   \nI think bitmap fonts are very hard to sell - they have to be cheap or free. And in my case since I don't make enough fonts during the year, I have to keep a high price bracket. Plus the limit on the number of bitmap fonts that can exist in the market is much smaller than for outline fonts (because of resolution - especially for aliased fonts).   \n   \nHere's a word set in Mana-16PPEM:   \n   \n ![mana_dog](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/messages/29/8249.gif)   \n   \nIf I can get my a-a bitmap fonts to actually work on Windows\\* then I will give them away, and sell the full (outline + bitmap) versions to people who get hooked.   \n   \n\\* MacOs would be great too, but it's secondary in terms of users - I want to enable the delivery of large quantities of text to/by \"the masses\", not pretty layouts.   \n   \n\\> outline font   \n   \nWell, making a good outline font is a lot of work (and the technical task of matching the bitmaps is a little bit of additional work), but it's not a mountain. The tricky part is embedding the bitmaps into the outlines so they work right - the beta version of BitFonter I was using couldn't get it to work. And now MacOS seems to hate bitmap fonts.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2003 — 6:06pm",
      "content": "The major market for bitmap fonts is not retail: it is for embedded fonts. If I had a one cent font royalty on every Nokia phone sold, I'd be pretty happy.\n\n"
    },
    {
      "time": "1 Apr 2003 — 6:21pm",
      "content": "Good point.   \nBTW, I didn't know you did that type of stuff too - cool.   \n   \nQuestion: are there any phone\\* display technologies that support grayscale?   \n   \n\\* Or any small device.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Apr 2003 — 6:52pm",
      "content": "Hello guys,   \n   \n I think that greyscale fonts are very promising, but the design problems actually still on the classic pixel fonts. More than 20 years and it seems that many good fonts are showing and growing on internet, as a real need for many designers.   \n   \nNintendo-like layout solved the resolution design problem 15 years before kiok layout style just start growing tasting all the posibilities of working dot by dot.   \n   \nNow bitmap fonts works well on flash, but many designers work on html for consider that flash is a waste of time, to boring to wait the loading time, now how much years have to pass to saw more than 50% of internet little Flash-pixel fonts working well? ...we can wait a long time for the color fonts as a real thing, btw is interesting to try add greys, but every size needs a diferent grey trheatment.   \n   \nItay; please finish your gaya version without greys, taste in a paragraph text, and think about   \ntoday. Your design is great and simple, so then you got a \"real usefull\" font taht many designers will want to use,   \n   \nMH.\n\n"
    },
    {
      "time": "1 Apr 2003 — 10:32pm",
      "content": "Laurence Penney seems to know a good deal about bitmap fonts, and may be able to identify some smaller devices with greyscale support. I'm pretty sure that some of the third party Palm OS devices, e.g. HandEra, might support greyscale font formats, certainly their resolution and depths of greys is adequate.\n\n"
    },
    {
      "time": "1 Apr 2003 — 10:35pm",
      "content": "Some graphing calculators (mid- to high-end TIs) have greyscale displays. Played my share of games on those suckers\n\n"
    },
    {
      "time": "2 Apr 2003 — 5:49am",
      "content": "I don't have a good handle the technical side of the way fonts are displayed, so this may come off as moronic. If you add greys to your bitmap, how does the font look when placed on a color backgroud or over an image? Are the greys transparent like a png?   \n   \nThanks.   \nRandy\n\n"
    },
    {
      "time": "2 Apr 2003 — 7:42am",
      "content": "A good renderer will use the gray values to interpolate between the background and foreground.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Apr 2003 — 8:26am",
      "content": "what a pity it is that photofont isnt capable of that (or can it?).   \n   \n\\>I think bitmap fonts are very hard to sell - they have to be cheap or free.   \ni tend to agree with you. plus (and this is a purely an opinion of some who does NOT make a living of fonts) i think that the average screen font is more useful to the world when its provided as freeware. its just that bitmap fonts dont sell so good. but if they're free of charge alot of people use them on the web, and its alot of fun to see the font used everywhere and people enjoying it.   \n   \n\\> So for example in your lc \"a\" the gray pixel   \n\\> where the top of the bowl connects to the   \n\\> stem is supposed to convey a gentle taper of   \n\\> the stroke (right?) [...] On the other hand   \n\\> the gray pixel where the bottom of the bowl   \n\\> meets the stem is good, because it helps   \n\\> reduce the clotting.   \n   \nactually, the dark grey pixel in the place where the bowl connects to the stem is to reduce clotting too. i did the same with the allmost all the other letters.   \n   \n ![lc a test](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/messages/29/8275.gif)\n\n"
    },
    {
      "time": "2 Apr 2003 — 8:32am",
      "content": "I think Photofont actually works, but it requires a smart browser, and the willingness to download a plug-in. But if it bypasses the OSes' dislike of bitmap fonts (especially a-a ones), then it's probably a great solution.   \n   \n\\> clotting   \n   \nI don't think a \"T-intersection\" clots very much, especially not in such a thin font. On the other hand, when you have a full crossing (like in the \"f\" and \"t\") putting a lighter gray right in the middle might be a good idea.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Apr 2003 — 11:53am",
      "content": "as far as i understood, Photofont uses and XML file and a bunch of PNG's (each containing a character). so i dont see how could one change the color of the text set in a photofont.   \nthe Photofont plugin, by the way, crashs my browser alot.   \n   \nthen it clots just a little. what im pondering about is if putting the grey pixel at the t-intersection hurts the character.   \ni think that looking excessivly on it will reveal the answer to me ![:-)](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n\\> On the other hand, when you have a full   \n\\> crossing (like in the \"f\" and \"t\") putting a   \n\\> lighter gray right in the middle might be a   \n\\> good idea.   \n   \nwell,i avoided full crossing. i was afraid it would hurt the letterspacing. uhm.. maybe i was just paranoid.\n\n"
    },
    {
      "time": "3 Apr 2003 — 2:51am",
      "content": "that their prices need to be lowered from an average font price to as low as 8$ to be sold.\n\n"
    },
    {
      "time": "3 Apr 2003 — 8:03am",
      "content": "Maybe because they can be ripped so easily. Just take a screenshot. Plus they are usually used in small quantites (imaged based applications, rather than generated text). Not often that you see scrolling pages set in mini 7, usually it's for buttons, subheads and icons etc.   \n   \nBack to Gaya. I say do both. Do an stright bmp version and an anti-aliased version. On the bmp version, keep that spacing a little looser (like the a-a version). It will up the legibility. Can't wait to see the a-a caps!   \n   \nThis is excellent.   \nRandy\n\n"
    },
    {
      "time": "4 Apr 2003 — 12:14am",
      "content": "Dear Itay K and people around here...   \n   \n-Internet is growing my friend, good webpages designs too, there are pixels fonts that rules but the better ones are growing here, or not designed yet..   \n   \n-You dont need greys to make a great pixel font, you need to believe that if your designs are well done and usefull(not only fonts, any thing in life)people will love and buy.   \n   \nAny doubt about it?   \n   \nYou have to back to the past and:   \n   \n-Ask to Emigre   \n-Email to Susan Kare,   \n-Check Matthews 2004 convertible Ford...   \n   \nNow back to the present and think twice   \n   \nAnd pay attention to the first graduate Typophiles students on the next years..   \n  \nConclusion:   \n-Typophile Rules ![:-)](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nMH\n\n"
    },
    {
      "time": "4 Apr 2003 — 4:18am",
      "content": "thanks guys. support is golden.   \nhere's a little thingie- sort the h's by the color of their joint, 1 being the the lightest; 5 being the darkest. this little test could answer some questions arising in designing a-a fonts.   \n   \nthe dark h's:   \n ![the dark h's](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/messages/29/8401.gif)   \n   \nmiguel, i agree that greys arent necessary for a good pixel font. but they sure bring pixel fonts to a whole new level. working on Gaya revealed the endless possibilities greys bring.   \nobviously ill have to settle for truetype technology to make Gaya in the simple B&W version. so the a-a version is a fantasy for now.\n\n"
    },
    {
      "time": "4 Apr 2003 — 8:16am",
      "content": "light-\\>dark   \nCEFBDA   \n   \nhhp\n\n"
    },
    {
      "time": "4 Apr 2003 — 8:59am",
      "content": "Note: I think it's important to say what type of monitor you're using at what resolution. This will vastly affect what you see.   \n   \n**CRT at 1280 x960**   \nThrough my eyes there are three groups. The difference between the these pairs is REALLY subtle, but I will try my best.   \n   \nlight ---\\> dark   \n[EC] [FB] [DA]   \n   \nThe only ones that are too obviously dark to my eyes are the DA pair. Both of the other pairs are fine, though I think that EC gets the nod for eveness when I get my nose 3 inches from the screen (scrambling my brain).   \n   \nMy vote: E   \n   \n**LCD 1152 x 768**   \nlight ---\\> dark   \n[EC] [FB] [DA] - same as CRT   \n   \nThe choices look way different on the LCD. Part of that is the lower resolution, but part is also the nature of the beast. The shapes were much more defined. It was obvious which branches curve to meet the vertical stem and which meet straight in. Still my choice is E on the LCD.   \n   \nI cheated afterwards with much interest.   \nThanks for the test.   \n   \nRandy\n\n"
    },
    {
      "time": "4 Apr 2003 — 9:09am",
      "content": "light ---\\> dark   \nC E F B D A   \n   \nThere I go agreeing with Hrant again; it must be an age of war and plague.   \n   \nThe difference between A B & D was _really subtle_ at 1600 x 1200, 133 ppi.\n\n"
    },
    {
      "time": "4 Apr 2003 — 9:14am",
      "content": "Randy, you're right on that the nature of the display will affect which looks best (although the gradation of darkness should be very similar - as you saw). And the OS has a large effect too - in fact a notable one on the gradation.   \n   \nI'm [currently] on a 1024x768 Compaq LCD, WinXP-Home.   \n   \nLCD screens tolerate less a-a, even though they actually need it more. They are in fact too crisp for optimal reading! Well, until resolutions go way up.   \n   \n\\> plague   \n   \nJust brush your teeth twice a day. Oh, wait, I misread that. Damn Latin alphabet. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "4 Apr 2003 — 4:51pm",
      "content": "how does the OS effect the font?   \n   \n ![idea](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/messages/29/8441.gif)   \nsomething i noticed about randy's pairs: disregarding the last pair, each pair has one h with a straight joint, and one with a curvy joint. and their darkness more or less evens when the the straight-joint h has the joint pixel lighter then the curvy-joint h. in such small pixel fonts, the curvy-joint is in itself a clotting-reducer, because it is surronded by two empty pixels which decrease the darkness in the joint.   \nsuch forces only exist in one-pixel-stem small fonts.\n\n"
    },
    {
      "time": "4 Apr 2003 — 4:57pm",
      "content": "heh hrant-   \nthere's a packing company in israel called 'Dr. Pack'. in hebrew without punctuation marks it reads 'Dr. '. its incredibly funny to see a gaint truck driving by with a gaint logo saying 'Dr.' ![:-)](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "4 Apr 2003 — 6:28pm",
      "content": "\\> how does the OS effect the font?   \n   \nMacOS has a much flatter gamma than Windows.   \n   \nhhp\n\n"
    },
    {
      "time": "9 May 2003 — 4:03pm",
      "content": "a question - how bad it is for a font not to have [europian] accented characters? i wasnt planning adding accented char and now that i tried to add them, it looks extremely strange. the whole font has the hieght of 10pixels, and adding accents would require at least 2 more pixels on the top. is there any way of doing this differntly?\n\n"
    },
    {
      "time": "15 May 2003 — 3:04pm",
      "content": "here's an update. check it out and freely throw comments. the uppercase is particularly bothersome to me, and i wonder what are other POVs on it.   \n ![Lian](http://web.archive.org/web/20150414181134im_/http:/www.typophile.com/forums/messages/29/10830.gif)\n\n"
    },
    {
      "time": "28 Mar 2003 — 10:31am",
      "content": "I think that selective antialiasing makes for beautiful screen   \ntype. Nice work, Itay. Notice how much clearer it is with   \nlooser letterspacing.   \n   \nUnderware did something similar with [Unibody](http://web.archive.org/web/20150414181134/http:/www.underware.nl/site/mailinglist/greyman-unibody/unibody.php3).\n\n"
    },
    {
      "time": "1 Apr 2003 — 4:26pm",
      "content": "_I think bitmap fonts are very hard to sell - they have to be cheap or free._   \n   \n [Matthew Bardram](http://web.archive.org/web/20150414181134/http:/atomicmedia.net/) and [Joe Gillespie](http://web.archive.org/web/20150414181134/http:/www.wpdfd.com/pixelfonts.htm) might disagree with   \nyou. If you market them right, they sell like hotcakes.   \nI think if Itay got Gaya in the right place, it could do well.\n\n"
    },
    {
      "time": "2 Apr 2003 — 2:53pm",
      "content": "_its just that bitmap fonts dont sell so good._   \n   \nWhat is your evidence of this?\n\n"
    }
  ]
}
