{
  "id": "5821",
  "title": "TurnKey",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Turnkey is a template website system for realtors   \n   \nTarget: Realtors in the US selling residential properties.   \n   \nDescription: Once a realtor has signed up with TurnKey, they have access to the administration area where they can customize their site, choosing from many graphic templates.   \n   \nUSP: The ease of use and focus on attracting home buyers from the search engines makes the Turnkey product a top of the line system for realtors   \n   \nAny opinons/input on the following logo concepts?   \n   \n   \n ![](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/messages/29/41619.gif)\n\n",
  "author": "sbarlow",
  "time": "28 Jul 2004 — 5:58pm",
  "uid": "4035",
  "comments": [
    {
      "time": "28 Jul 2004 — 11:52pm",
      "content": "How about omitting the horizontal stroke in the keyhole in version B?   \n   \nHow about not using Optima (looks dated, to me)   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "29 Jul 2004 — 12:15am",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>I wrote \"How about omitting the horizontal stroke in the keyhole in version B?\" ... but that make the keahole disappear, unless you did something else, I guess ...   \n   \nBut I still think the solution can be found somewhere near version B.   \n   \nTry to check the logo in [www.home.dk](http://web.archive.org/web/20131020193044/http:/www.home.dk/) ... top-right corner. This was made be my employer several years ago.   \n   \n--   \nSoren O   \n \\</font\\>\n\n"
    },
    {
      "time": "29 Jul 2004 — 5:48am",
      "content": "Optima doesn't look dated... it is dated.   \nKeyholes don't look like that anymore. Not that it is bad but they just don't. I wonder if you can incorperate aspect of the web into your logo.   \nOtherwise, when looking at this mark I feel like it doesn't connect me to the benefits of the product.\n\n"
    },
    {
      "time": "29 Jul 2004 — 1:37pm",
      "content": "David -- keyholes don't look like that anymore ... but the icon does.   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "29 Jul 2004 — 4:36pm",
      "content": "Top logo is best, second is too abstract, third is nice but would in my opinion look better bolder.   \nsince the brand has the word \"turn\" in its name, perhaps that ius something to use as a starting point for more design comps\n\n"
    },
    {
      "time": "30 Jul 2004 — 8:38am",
      "content": "\"Keyholes don't look like that anymore.\"   \n   \nTrue, but we all know that is a keyhole. And plenty of great older homes still have that trademark keyhole.   \n   \n#1 is too literal.   \n   \n#2 has potential. I agree with Soren. If not remove the bottom stroke, perhaps just shorten it to give it the 'hint' of a bottom strok.   \n   \n#3 I like for some reason. The keyhole is obviously horizontal, which doesn't make a lot of sense, but I do like the form.   \n   \nBut perhaps the concept of an actual 'key' is maybe just too literal. To be fair, 'TurnKey' is a pretty generic name to begin with, so you don't have a lot to work with.\n\n"
    },
    {
      "time": "30 Jul 2004 — 10:55am",
      "content": "What if the logo was designed at a 45 or 90 degree angle.   \n  \nI feel like the logos might not be emphasising the \"Turn\" enough.   \n   \nI am not against a keyhole, However using a plain keyhole is boring, It needs a \"TWIST\", or possibly a \"TURN\"\n\n"
    },
    {
      "time": "30 Jul 2004 — 11:45am",
      "content": "maybe you could make turnkey an ambigram. then it could turn on itself.   \n   \n   \n   \nAndrew\n\n"
    },
    {
      "time": "6 Aug 2004 — 8:30am",
      "content": "i think for an easy-to-use website business, it should be more easy-going, like, personal. i think lower-case letters would give the right feeling. the letters you're currently using tell me the company is strong and old and experienced and not NEW, when i think it should say to average inexperienced web-user, \"this site is easy to use, just sit back and we'll take care of everything.\"   \n   \nare we gonna see more ideas?\n\n"
    },
    {
      "time": "7 Aug 2004 — 10:18am",
      "content": "You need more spacing for it to work. Also you need a font that won't take away from the icon that is strong and not flimsy.   \n   \n ![](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/messages/29/42329.jpg)\n\n"
    },
    {
      "time": "8 Aug 2004 — 3:20pm",
      "content": "thanks for the suggestions everyone. here are a few modifications.   \n   \nthoughts?   \n   \n ![](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/messages/29/42375.gif)\n\n"
    },
    {
      "time": "9 Aug 2004 — 7:43am",
      "content": "Sally I personally like number three, its friendly and accessible, both assets that make a good website. And the colors are nice. My two Pennies worth.\n\n"
    },
    {
      "time": "10 Aug 2004 — 11:40am",
      "content": "Thanks, Daniel, for the feedback. The client wasn't a fan of #3 because he thought it gave the company a less professional feel.   \n   \nI am going to take #1, #2, and #6 and develop them further.\n\n"
    },
    {
      "time": "10 Aug 2004 — 1:25pm",
      "content": "Sally:   \n   \nI like the direction of concepts 2 and 5 the best, however, I think the two-tone type isn't necessary. The keyhole-R is the star of the logo\n\n"
    },
    {
      "time": "10 Aug 2004 — 1:34pm",
      "content": "hey scott. the main reason for the two-toned type is that the name at first glance looks like \"turkey\" without the words distinct from one another in some way.   \n   \n ![](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/messages/29/42568.gif)   \n   \nis it just me or does it remind you of the country or thankgiving at first glance? with the words separated, your eye is drawn to the \"key\" aspect which also is a subtle reference to real estate.\n\n"
    },
    {
      "time": "10 Aug 2004 — 1:47pm",
      "content": "1 I didn't see turkey, but that's just me.   \n   \n2 I didn't think Thanksgiving, but that's probably because I didn't see turkey, and that's just me. Actually, I think your color selection keeps you pretty safe from any Thanksgiving association.   \n   \n3 \"key\" might be a subtle reference to real estate, but \"turnkey\" is an obvious reference to real estate.   \n   \n4 Have you tried using a less compressed/narrow typeface? If you used a face that was a little less vertical, but left the keyhole-R, as is, then the attention given to the keyhole-R might overcome any other subtle associations (turnkey, Thanksgiving, etc.).   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "10 Aug 2004 — 1:54pm",
      "content": "maybe i am just crazy . . . of course i did come to the \"turkey\" conclusion when the R wasn't the keyhole. (with the name typset as in any of the other logo samples)   \n   \nso perhaps i will work with a monotone logo for a solution close to #2/#5 and also work on developing #1 more. The client wants to move in that direction. It is narrowed down to something in the direction of #1/#2/#5. Thanks for the input. ![:-)](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "10 Aug 2004 — 1:55pm",
      "content": "I am not really into the R being a key hole. The shape doesn't really lend itself to maximum legibility. It feels like you are forcing an insignifigant relationship between the R and a keyhole. I am not getting a reward out of this logo \"yet\". I was under the assumtion that the website was rewarding it's users if they were to \"Turn the Key\", turning the key I assume is a metaphor for the unlimited access to the real estate market the website provides. Write know the logo feels \"locked\". Hope that makes since!\n\n"
    },
    {
      "time": "10 Aug 2004 — 2:08pm",
      "content": "Think about making the viewer actually \"Turn\" it might add a whole new dimension.\n\n"
    },
    {
      "time": "10 Aug 2004 — 2:11pm",
      "content": "what do you mean by that, David?\n\n"
    },
    {
      "time": "10 Aug 2004 — 2:18pm",
      "content": "At times the partial r looks a bit like the Soviet sickle. I'd steer clear of sickles in general actually.\n\n"
    },
    {
      "time": "10 Aug 2004 — 2:39pm",
      "content": "What I mean is to make a logo that is read at 90 degrees from everything else on the page. So when the viewer engages in it he physically has to \"turn\" to read it. This will also enable you to make the key hole in the \"unlock\" position which will \"Reward\" the viewer. I have a sketch if you would like me to post it.\n\n"
    },
    {
      "time": "10 Aug 2004 — 4:45pm",
      "content": "i'd love to see your sketch, david.\n\n"
    },
    {
      "time": "11 Aug 2004 — 5:18am",
      "content": "![](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/messages/29/42625.jpg) It's just an idea\n\n"
    },
    {
      "time": "11 Aug 2004 — 5:19am",
      "content": "It's just rough idea\n\n"
    },
    {
      "time": "12 Aug 2004 — 12:46pm",
      "content": "David, I like very much that way of thinking - making the viewer actually perform the name - and if this works, you've got a very memorable logo.   \n   \nUnfortunately, I see some drawbacks   \n- vertical type is low legibility   \n- vertical type is unpleasant to look at (to me at least ... I always think of somebody jumping from a high building, when I see vertical type on street signs)   \n- real estate agents need a more flexible, less space-consuming system for their ads, right?   \n- you have made the type perform a 90 degree rotation ... in fact it should be at least 360 degree (what I mean: the pun is too subtle)   \n   \nI hate to sound negative ... because, again, it's the right way of thinking.   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "12 Aug 2004 — 1:02pm",
      "content": "I am wondering if in this case a slight sacrifice in legibility would aid signifigantly conceptually. It takes effort to turn a key why can't it take a slight effort to read a 90 degree logo. I am not proposing that all the type on the page be 90 degrees, only the logo. I also like the way the keyhole becomes a directional element potentially guiding the viewer to additional elements in a given composition.   \n   \nConsider it like opening a door.\n\n"
    },
    {
      "time": "12 Aug 2004 — 1:02pm",
      "content": "I am wondering if in this case a slight sacrifice in legibility would aid signifigantly conceptually. It takes effort to turn a key why can't it take a slight effort to read a 90 degree logo. I am not proposing that all the type on the page be 90 degrees, only the logo. I also like the way the keyhole becomes a directional element potentially guiding the viewer to additional elements in a given composition.   \n   \nConsider it like opening a door.\n\n"
    },
    {
      "time": "13 Aug 2004 — 12:10pm",
      "content": "thank you for the suggestions everyone. . . here is one more post taking your suggestions as well as the client's feedback into consideration. after this, i will be choosing a specific direction and getting this logo wrapped up.   \n   \n- this is the decided color scheme of the logo   \n   \n- does anyone have a font suggestion that is optimaish but not so dated. this font is not actually Optima, it is called Zapf Humanist, but when comparing the two they are identical . . .   \n   \n#2 represents a dynamic layout of the logo . . . the keyhole is the fulcrum around which the turnkey word rotates depending on the layout that is created   \n   \nI look forward to hearing any input/ideas/suggestions!   \n   \nThanks,   \n   \nSally   \n ![](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/messages/29/42764.gif)\n\n"
    },
    {
      "time": "13 Aug 2004 — 12:35pm",
      "content": "The R is still not resolved ![:-(](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/clipart/sad.gif)  \nThe Typeface in # 3 works the best.   \nAlthough I feel overall the type should be alot bolder. In this case the type should represent the resiliancy of a door or a vault. Right know using these typefaces makes me feel like I don't even need a key at all. There is not much contrast going on..........I wish I could write in words what runs through my head. Anyway, that key hole seems really weak and flimsy. Locks and Keys are strong and powerful things. You want a viewer to feel like they have gained something when they sign up for this site.   \n   \nThe metaphor is this:   \n   \nTurning a key is like opening a door, which is like gaining access to something inaccessible, which is like heaven and discoving something new. It's like opening a real estate treasure chest. It's like loosing your virginity, it's like being bar-mitzvahed, it's like having your first beer. It's like cracking the code. Anyway, you get the point.   \n   \nGood luck.\n\n"
    },
    {
      "time": "13 Aug 2004 — 12:53pm",
      "content": "the logo needs to communicate that with TurnKey, creating a website is easy and simple . . . the logo shouldn't communicate resilinacy.   \n   \nReal Estate agents in general are not techs and are a bit intimated by the website thing.   \n   \nThis logo should communicate that there is no need to be intimidated . . .TurnKey makes the process straight-forward, quick, and easy.   \n   \nComing from this point of view, how successful are these logos?\n\n"
    },
    {
      "time": "13 Aug 2004 — 1:06pm",
      "content": "I like them Sally, I agree simple is better. I bet that most of the people who come to the site wouldn't even remember what the logo looked like. They want access to information quickly and simply. What happens here is we think visually but not about the end user. I tend to like version 1 and the typeface doesn't bother me. Remember, Helvetica has become very popular again. Like fashion, typefaces come into vogue. Maybe you are a trend setter\n\n"
    },
    {
      "time": "13 Aug 2004 — 1:48pm",
      "content": "If there was no intimidation this company would not exist. I feel that the logos express the idea of a \"Key\" by having a key hole Yet they do not express the idea of \"turn\". I guess my biggest problem with this logo is that the keyhole is still in the locked position when the name says \"unlock\". The name isn't \"Key\" it's \"TurnKey\"\n\n"
    },
    {
      "time": "13 Aug 2004 — 1:56pm",
      "content": "Dan,   \nHelvetica will always be in vogue. It's the blue jeans of typefaces.\n\n"
    },
    {
      "time": "14 Aug 2004 — 4:40am",
      "content": "David, sadly but true, its about as interesting as library paste.\n\n"
    },
    {
      "time": "16 Aug 2004 — 5:17am",
      "content": "What is uninteresting about it, is what makes it interesting.\n\n"
    },
    {
      "time": "16 Aug 2004 — 8:37am",
      "content": "anyone of any other thoughts about the last logo modifications i posted?\n\n"
    },
    {
      "time": "16 Aug 2004 — 11:51am",
      "content": "\"the logo needs to communicate that with TurnKey, creating a website is easy and simple\"   \n   \nSally, I'm sorry but I don't think you've achieved the goal you set for yourself. The logos you've created thus far say 'real estate' but more in the sense of a real estate agency, not a service for realitors. Is Turnkey a software program? A template to download? How will the logo be used? on packaging? on-line? The fonts you've been using give the design a delicate look. Appropriate for an agency that specializes in million + estates, but is it appropriate for this client and their product? If simple is the main concept you wish to communicate I think the logo is still too complex. The two-tone key hole is distracting and personally I don't think the shadow 3-d effect adds anything to your icon, and I do like the key hole. I know you are planning on wrapping this up soon. I'm sorry if this sounds negative - it's not meant to be. Your designs look nice, and are leaning towards quite elegant. It's just that from your own description it seems like they aren't hitting the mark yet.\n\n"
    },
    {
      "time": "16 Aug 2004 — 12:08pm",
      "content": "Sally, for me the logo looks like one of those standard table game tokens. I don't now if anone of you knows \"Mensch\n\n"
    },
    {
      "time": "16 Aug 2004 — 12:24pm",
      "content": "Forget the last paragraph please. Flipping the Logo horizontally doesn't make any sense, since you open a door turning the key to the right, not to left, doh!   \n   \nSo take the third logo of your first post.   \n   \nI didn't read all the posts, so maybe this comment is obsolete.   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "16 Aug 2004 — 2:44pm",
      "content": "Turning the logo 45 degrees counterclockwise   \nwill solve the problem! It will sacrifice legibility for concept and vise versa. I agree 90 degrees clockwise is too much and is also unlocking in the wrong direction. I would base my entire design on a 45 degrees counterclockwise logo. But that's just my opinion of course. GOod luck\n\n"
    },
    {
      "time": "17 Aug 2004 — 2:13am",
      "content": "Hi everyone. This is my first post on this forum and I have an idea/suggestion to share. Here\n\n"
    },
    {
      "time": "17 Aug 2004 — 4:40am",
      "content": "Pat, there was a thread (a monitor could help) that expressed the view it was more useful to describe your thoughts in words rather than expressing them in your own creative ideas visually. It was a matter of having respective of the designer's work.\n\n"
    },
    {
      "time": "17 Aug 2004 — 5:05am",
      "content": "My intention wasn\n\n"
    },
    {
      "time": "10 Sep 2004 — 5:00pm",
      "content": "i never mind visual suggestions -- usually much easier to get the idea visually instead of descriptively.   \n   \nThank you everybody for your thoughts and ideas.   \n   \nThe client really wanted to go with an icon, which is why this final concept features the keyhole icon instead of the further development of the abstract keyhole R.   \n   \nThis logo focus more on the \"turn\" and portrays better the image of an easy, straight-forward, and professional way to create a real estate website.   \n   \nThis is the concept the client has chosen to go with. If anyone has any ideas or suggestions of ways to finalized this logo further, I welcome them.   \n   \nThanks,   \n   \nSally   \n   \n   \n ![](http://web.archive.org/web/20131020193044im_/http:/www.typophile.com/forums/messages/29/48758.gif)\n\n"
    },
    {
      "time": "10 Sep 2004 — 5:20pm",
      "content": "Tighten the spacing: T-U, U-R, N-icon, K-E-Y\n\n"
    }
  ]
}
