{
  "id": "58229",
  "title": "Can an eth have a ball terminal?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Most of the letters in my Magnolia typeface have ball terminals. But as I don't read Icelandic or Anglo-Saxon, I can't really tell if it's okay for an eth to have one.\n\nIs this an acceptable/good eth?\n\n ![](http://web.archive.org/web/20150101203922im_/http:/typophile.com/files/eth_5634.png)\n\n",
  "author": "mr",
  "time": "21 May 2009 — 2:56am",
  "uid": "19503",
  "comments": [
    {
      "time": "21 May 2009 — 4:55am",
      "content": "Sure, why not?  \nI would read it.\n\n"
    },
    {
      "time": "21 May 2009 — 7:35am",
      "content": "Looks great.\n\n"
    },
    {
      "time": "22 May 2009 — 5:54am",
      "content": "A [comment about Archer on Typographica](http://web.archive.org/web/20150101203922/http:/new.typographica.org/2009/typeface-reviews/archer/#comment-38015), presumably from a native Icelandic speaker, seems to argue that a ball-terminal on the eth might be overdoing it.\n\n"
    },
    {
      "time": "23 May 2009 — 1:37am",
      "content": "Thanks for the link, Kent, but I read that differently: not that an eth shouldn't have a ball terminal, but that the ball on the eth in Archer is too heavy. And in the heavier weights of Archer, the ball does seem heavier than the bar. I don't think that's the case here.\n\n"
    },
    {
      "time": "23 May 2009 — 6:39am",
      "content": "Yes, an equally valid interpretation, I suppose. You could try tracking down contact info for Mr. Magnússon and ask for his comment on your specific design. So far, you don't seem to be having any luck attracting any Icelandic Typophiles to comment on this thread ;-)\n\n"
    },
    {
      "time": "24 May 2009 — 1:17pm",
      "content": "FWIW, I recently looked at eths in quite a stack of Faroese books to see what kinds of eths they like to use. Granted this was mostly text type, but the main question there seems to be how curved (≈ more traditional) or straight (≈ more current) the ascender is, and how to incorporate the crossbar. There seems to be quite a strong custom of leaving the top of the ascender weak, without a terminal; [the approach proposed by Briem](http://web.archive.org/web/20150101203922/http:/briem.ismennt.is/2/2.11/2.1.4.eth.htm), i.e. deducing the ascender from the parenthesis, suggests this too – although he says you can also use the numeral 9 as a starting point.  \nSo, dunno, does your 9 have a ball?\n\n"
    },
    {
      "time": "25 May 2009 — 7:30am",
      "content": "I'm just happy to know that I'm not the only person having problems with this glyph.\n\nPersonally, I like the ball, but then I'm don't read the language....\n\n ![](http://web.archive.org/web/20150101203922im_/http:/typophile.com/files/eth_3529.jpg)\n  \n_eth from OverKill_\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150101203922/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "28 May 2009 — 7:08pm",
      "content": "I'm Icelandic. It's a very readable eth and looks fine. However, ball terminals not being usual on eths it could strike some natives as a bit \"foreign,\" i.e. it does give away the fact that the typeface wasn't designed by someone who uses the language.\n\nTaking a look at the typeface's 9 and going from there is a good idea. But really, Icelanders being used to finding nothing, a ligature or, at best, a striked d, in the eth spot, this is great.\n\nIf you leave the terminal on I would suggest slanting the crossbar just a tiny bit more, though.\n\nAnd that OverKill eth looks hideous.\n\n"
    },
    {
      "time": "28 May 2009 — 8:08pm",
      "content": "back to th drawing board...\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150101203922/http:/www.thefontry.com/)\n\n"
    }
  ]
}
