{
  "id": "58235",
  "title": "Left- and right-leaning diagonals weighted differently even in a monolinear, vertical-stress design?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The humanist axis of stress in Latin typefaces dictates that the diagonals leaning to the right (/) are thinner than the ones leaning to the left (\\). This stress axis also applies to circular shapes; the thinnest parts in the letter 'o' are in the upper-left and lower-right quadrants, and the thickest parts in the other two quadrants.\n\nThis is illustrated in typical humanist sans serif designs such as Lucida Sans.\n\n ![](http://web.archive.org/web/20131019123447im_/http:/typophile.com/files/lucida-w_5333.gif)\n\nHowever, there are geometric or constructed sans serif typefaces that, on first glance at least, do not follow this stress angle. Such designs could be considered to have vertical stress (few designs are perfectly monolinear). Unlike in the Lucida Sans example above, the 'w' will have apparent left-right mirror symmetry.\n\nSo in designing a highly constructed neo-grotesque, which I recently put up for critique ( [see thread here](http://web.archive.org/web/20131019123447/http:/typophile.com/node/58183)), I designed the 'v', 'w', and 'x' to have perfect mirror symmetry.\n\nBut then Satya showed that even in some designs with apparent vertical stress, the weights of diagonals varied subtly following the humanist axis. Here is his picture of the 'w' from Univers LT Std 55 Roman (I had suggested Univers as an example of a design employing vertical stress):\n\n ![](http://web.archive.org/web/20131019123447im_/http:/typophile.com/files/w_Univers_4746.jpg)\n\nI examined the letter 'w' from different fonts in my system, and found examples of both perfect symmetry and subtle humanist asymmetry. The 'w's in Corbel and Microsoft Sans Serif are symmetric, while those in Arial and IPA Proportional Gothic (a Japanese font with a grotesque Latin) are asymmetric. In the Thai font Cordia new, the right-leaning diagonals are just one unit (1/4096 of an em) thinner than the left-leaning ones.\n\nWhat I would like to know is the reason for the slight asymmetry.\n\nIs it a subtle nod to the humanist axis borne out of a desire not to make the design 100% mechanical?\n\nOr is it for optical correction? Are we so accustomed to the humanist axis that given a symmetric 'w', the right-leaning diagonals will look thicker even though there is no difference in the actual thickness?\n\nIf the latter is true, then it must surely be a culture-specific case of optical illusion, since many other writing systems have reversed angles of stress from the Latin humanist axis. Does that even make sense?\n\nOr to put it another way, if I wanted my 'w' to appear completely symmetric, would I make it mathematically symmetric or adjust for this possible optical illusion?\n\n",
  "author": "Jongseong",
  "time": "21 May 2009 — 6:56am",
  "uid": "12009",
  "comments": [
    {
      "time": "21 May 2009 — 8:19am",
      "content": "I think you should trust your eyes. I have the feeling that a real symmetry wouldn't look so good, that you would have to reduce the weight at least a little bit. Still, depending on what spirit of a font you want to create, the perfect symmetry could also create a strange unusual feeling that may lead to something interesting.  \nI just checked in a Futura book and in the w, the middle stems are not symmetric but the external ones are. To my eyes it looks like the right stem is a bit bolder than the left one.\n\n"
    },
    {
      "time": "21 May 2009 — 8:43am",
      "content": "There are some weird things going on with different cuts of digital Futura available. In Adobe Futura, the 'W' and 'w' look asymmetric in the bolder weights, but inconsistently; just look at the heavy weight, for example.\n\n ![](http://web.archive.org/web/20131019123447im_/http:/typophile.com/files/adobe-futura-heavy_4134.gif)\n  \nUnintentional sloppiness or not?\n\nIf a symmetric 'w' doesn't look good, is that because we want it to be asymmetric, or because it _appears_ asymmetric?\n\n"
    },
    {
      "time": "21 May 2009 — 8:51am",
      "content": "I think that a symmetric W, especially the majuscule, may require optical correction because I have noticed that the right-to-left slash sometimes looks heavier than the left-to-right. Oddly I only notice this phenomenon in print, which makes it a PITA to deal with.\n\n"
    },
    {
      "time": "21 May 2009 — 9:00am",
      "content": "I think in the end it's all about how it looks. And you should do it the way you want it to look good, or, better said, the way you think it looks good.  \nIn your example, the left W is humanist in the middle, symmetrical in the \"sides\", but i think the sides have to looks about the same to obtain balance, where you can \"play\" in the middle to get the needed optical corrections.  \nThe right W is more of a mistery because the middle is reversed to what it should be (isn't it?). At the same time, it doesn't look horrible, i wouldn't have noticed if we were not talking about that specifically. Also because the right one looks more monolinear.\n\nFor your question, i think the problem is more \"what does look good?\". Sometimes, things that look like mistakes in one letter create good effect in the end (text). Actually your question is a valable one, i just can't find an answer now... I think I can't discuss this theoretically, only with examples.\n\n"
    },
    {
      "time": "21 May 2009 — 9:32am",
      "content": "In my typeface sample I printed out, I do notice that the / diagonal looks the slightest bit heavier than the \\ diagonal in the middle parts of 'W', 'w', and capital 'M'. But it's something that doesn't jump out. I wouldn't notice if I weren't looking for it.\n\nTo check if this is an optical illusion, I turned the sheet over and looked at the see-through letter shapes. It's hard to tell, but it does seem like I might see the same effect. Since this happens in both the original shape and its mirror image, it sure does look like an optical illusion. It's just a bit baffling, that's all.\n\nOr I could be imagining all this. We are talking about the slightest of effects, after all.\n\n"
    },
    {
      "time": "21 May 2009 — 9:43am",
      "content": "_Or is it for optical correction? Are we so accustomed to the humanist axis that given a symmetric ’w’, the right-leaning diagonals will look thicker even though there is no difference in the actual thickness?_\n\nI find this to be the case, particularly with a symmetrical A for some reason. I ‘see’ the left stroke as being too heavy relative to the right stroke.\n\n"
    },
    {
      "time": "21 May 2009 — 10:35am",
      "content": "If this is indeed an optical illusion, then perhaps the effect will be the opposite for native readers of, say, Gujarati?\n\nIt is even conceivable that maybe only typographically attuned individuals are affected by this.\n\n"
    },
    {
      "time": "20 Jun 2011 — 10:36am",
      "content": "After working for many hours on an italic font, Romans look back slanted.\n\n\\*\\*\n\nI don't think the principle of pen-informed contrast will go away, given that readers are habituated to the effect by the predominance of contrasting-stroke type in text.\n\n"
    },
    {
      "time": "20 Jun 2011 — 9:10am",
      "content": "\\> After working for many hours on an italic font, Romans look back slanted.\n\nMore relevantly:  \n1) They also look backslanted in a body of Italic (which some typographers do).  \n2) Semi-serifs look backslanted (which is why Bloemsma put flares in Avance).\n\n\\> I don't think the principle of pen-informed contrast will go away\n\n1) That's entirely up to us.  \n2) Actually laymen sometimes complain about the asymmetry in the \"A\" for example.\n\nhhp\n\n"
    }
  ]
}
