{
  "id": "5824",
  "title": "Decision Sciences logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Our University department is changing its name from Quantitative Management to Decision Sciences. Our teaching and research focuses mainly on the mathematics underlying decision making and management processes.   \n   \nWe need a new logo to reflect the new name. It should also give some hint of the fact that mathematics is the focus. We played around with the Greek sigma and delta (often used in a mathematical context), roman s and d, and the integration sign. (We shy away from the capital Sigma or summation sign because it is overused.)   \n   \nWe (mathematicians, not typographers or designers) came up with the following concept. The idea is that it should alternate between a d and an S in the mind of the reader.   \n   \n ![ds](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/clipart/your_image.gif)   \n   \nAny advice will be appreciated!   \n   \nChris Swanepoel\n\n",
  "author": "swanecj",
  "time": "29 Jul 2004 — 1:45am",
  "uid": "4297",
  "comments": [
    {
      "time": "29 Jul 2004 — 1:50am",
      "content": "![ds](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/messages/29/41636.jpg)\n\n"
    },
    {
      "time": "29 Jul 2004 — 9:45am",
      "content": "The concept it good. With some refinement (curves, weight, etc.) this shape could work quite nicely. As a logo, I would lose the drop shadow and use a stronger color against the white\n\n"
    },
    {
      "time": "29 Jul 2004 — 11:54pm",
      "content": "Thanks for the comments, Scott. The first use of the logo would be as background design for a preprint cover -- hence the pale colours. (It will have to be even paler to prevent it from interfering too much with the black title that will be overprinted on the cover...) For other uses it makes sense to have it bolder. There are no colours with mathematical significance, as far as I know.   \n   \nWould it be better to frame the symbol when it is printed as say red or dark blue on white, to get a rectangular logo, or should it be used without a frame?   \n   \nNot being designers, we would appreciate any suggestions on refinements of the weight, curves, etc.   \n   \nThanks!   \nChris\n\n"
    },
    {
      "time": "30 Jul 2004 — 3:06am",
      "content": "C.J., in your latest comment, second paragraph, you ask about the following two options   \n   \n(a) Dark rectangular shape containing white logo   \n(b) Dark logo   \n   \nOften, (b) is to be preferred, as it will be the more memorable shape of the two.   \n   \nOn refinements ... well, drop the drop-shadow. No aestethic or functional reasons for keeping it. And regarding weight, curves ... yes, there are room for improvement ... but right now I can hardly find time to print, scan, draw and post. I will certainly check this thread and comment further.   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "30 Jul 2004 — 9:39am",
      "content": "I guess it depends on your target audience. As a non-math person, I'd have no idea what a sigma was or see it in the mark above. It's just an 'S' to me. And I wouldn't be sure what that had to do with 'decision sciences' other than perhaps \\*S\\*cience.\n\n"
    },
    {
      "time": "30 Jul 2004 — 10:10am",
      "content": "Like Soren, I don't have much time to give you a proper diagram illustrating corrections to make, but here's a quick sketch done in photoshop.   \n   \n ![delta sigma logo](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/messages/29/41745.jpg)   \n   \nThe squares mark the primary areas needing curve smoothing/refinement. The middle arrow indicates the area where I see the greatest need for consistency in weight/thickness relationship. The bottom arrow and lines indicate a curve relationship that I think can be improved by pushing the right side out a little.   \n   \nI also agree with Soren about using the graphic mark without framing it.   \n   \nAs far as the background image goes\n\n"
    },
    {
      "time": "30 Jul 2004 — 10:49am",
      "content": "It also looks like a lowercase d and capital S\n\n"
    },
    {
      "time": "30 Jul 2004 — 1:06pm",
      "content": "There is one straight line in the symbol. It joins the curves two places. The upper join is approx 90 degrees. The lower join is more 'sharp'.   \n   \nTo me, they should be more alike = I would make the lower joint less 'sharp'.   \n   \n(Gee, it's tough to describe these matters in a foreign language ... but I guess I get a lot of practise here)   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "31 Jul 2004 — 6:32pm",
      "content": "Current concept looks like arts and craft era.   \nI honestly don't like it at all. I do see the S and D but only because I read the post text first. It is too much of a jump for the imagination to see the D-S as quickly as a good design/logo should be interpreted. Besides I don't see how this shape expresses anything about the orginization.   \nI will post a different concept by sunday night.\n\n"
    },
    {
      "time": "31 Jul 2004 — 11:28pm",
      "content": "Contrary to Ole's critique, I remain confident in the direction of your concept. Considering the information you have provided\n\n"
    },
    {
      "time": "1 Aug 2004 — 1:53am",
      "content": "Ole's critique ... well, I had the same thoughts when I first saw the symbol.   \n   \nBut I think the problem could be a minor one.   \n   \nWill there be a name close to the symbol? How often? What name? What typography?   \nThese things will determine whether or not you see the 'd' and the 's'.   \n   \nHow about posting a design showing this?   \n   \n--   \nSoren O\n\n"
    },
    {
      "time": "1 Aug 2004 — 2:14pm",
      "content": "All your comments are much appreciated!   \n   \nThe symbol will (almost always) be accompanied by the words ``Decision Sciences'' or ``Department of Decision Sciences''. In most cases the University logo ![unisa](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/messages/29/41826.gif)  \nwill be on the same page. (In the department we do most of our typesetting (study material etc.) in Monotype Plantin.)   \n   \nApart from the above, we can still decide on the typography. Again, any suggestions will be welcome.   \n   \nChris\n\n"
    },
    {
      "time": "2 Aug 2004 — 11:31am",
      "content": "Well it is now monday, and I was just finishing the design/post I had expected to upload last night. Logo has s/d combined greek style. With this glyph it is also possible to extract some interesting patterns form the counters of the glyph (for ornamentation use, background patterns, borders, architecture, etc...) ![DS logo/pattern](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/messages/29/41875.jpg)\n\n"
    },
    {
      "time": "2 Aug 2004 — 1:12pm",
      "content": "Ole:   \n   \nPost smaller files.   \n   \nThis is a nice shape, but I no longer get a sense for the greek delta sigma. It is much less obvious than before.\n\n"
    },
    {
      "time": "2 Aug 2004 — 2:59pm",
      "content": "Again, who's the target audience for this?\n\n"
    },
    {
      "time": "2 Aug 2004 — 10:59pm",
      "content": "I very much like the fact that your shape can be adapted for backgrounds, etc., Ole.   \n   \nThe target audience would mainly be students already registered for courses in the Department of Decision Sciences, prospective students, and to some extent also colleagues from other universities. (The logo will be used on study material, brochures explaining what we teach, preprint covers and possibly business cards.)   \n   \nThanks!   \nChris\n\n"
    },
    {
      "time": "4 Aug 2004 — 6:36am",
      "content": "An attempt to incorporate some of your suggestions:   \n   \n ![01](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/messages/29/42017.jpg) ![02](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/messages/29/42018.jpg)   \n   \n ![03](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/messages/29/42019.jpg) ![04](http://web.archive.org/web/20131020052118im_/http:/www.typophile.com/forums/messages/29/42020.jpg)   \n   \nAny comments?   \nThank you!   \nChris\n\n"
    },
    {
      "time": "4 Aug 2004 — 9:20am",
      "content": "CJ:   \n   \nThe bottom two designs don't make any sense to me, but I like the improvements made in the top two designs. I like that you have created a heavier version, but it might be a little too heavy. If the heavier version is bold and the lighter version is regular, then you are looking for a medium. If you look at your bold version, it looks like it is going to fall over (to the right). To eliminate this unbalance, I have cut off the little returning curve from the end of the \"S\" and I have cut off a significant portion of the arm at the beginning of the \"S\".   \n   \nThis is rough, because your original JPEGs are very rough/pixelated, but hopefully it will give you an idea of what I mean. Also, the bottom probably needs to be a little thicker and the top arc might need to be rounded out a little more. I'm not positive about the arc, though, because it might only read as an \"S\"', whereas, right now, it looks unatural, like two shapes are melded together\n\n"
    }
  ]
}
