{
  "id": "58310",
  "title": "Google logo cleanup",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://googleblog.blogspot.com/2009/05/new-logo-look.html](http://web.archive.org/web/20150126052917/http:/googleblog.blogspot.com/2009/05/new-logo-look.html \"http://googleblog.blogspot.com/2009/05/new-logo-look.html\")\n\nWhat do you guys think ?  \nI really don't like it.\n\n ![](http://web.archive.org/web/20150126052917im_/http:/typophile.com/files/google_logos_6084.png)\n\n",
  "author": "apankrat",
  "time": "23 May 2009 — 8:51am",
  "uid": "39971",
  "comments": [
    {
      "time": "23 May 2009 — 9:30am",
      "content": "It's not great graphic design, but it's very Google and consistent, so I think it's a successful improvement.\n\n"
    },
    {
      "time": "23 May 2009 — 9:50am",
      "content": "I wouldn't say it's very Google, because, frankly, it _looks_ like a amateur job to me. Simple can be polished. And _this_ is not polished.\n\nTheir choice of Sans is really odd, there are easily two or three better matches for Catull, especially for the subset of 5 characters they are actually using. The height of new addition is also strange and it starts to visually dwarf the Google part.\n\n"
    },
    {
      "time": "23 May 2009 — 11:25am",
      "content": "From a graphic design standpoint, Google has always gone with that 'amateur' look.\n\n"
    },
    {
      "time": "23 May 2009 — 12:07pm",
      "content": "I feel like the simple sans type makes the Google logo lose its charm and look like an entry at cheapassedlogocontests.com. Trying to pair clean and simple with a Photochopped logo seems kind of absurd. I really just don’t know where Google is going with its brand. Didn’t they hire H&FJ to do a new sans that only shows up in some all-text magazine ads?\n\n"
    },
    {
      "time": "26 May 2009 — 9:42am",
      "content": "I've never liked google's branding. It has basically always looked like an amateur made it.\n\n"
    },
    {
      "time": "26 May 2009 — 10:10am",
      "content": "<cite>Didn’t they hire H&amp;FJ to do a new sans that only shows up in some all-text magazine ads?</cite>\n\nFrom the comments of [http://www.underconsideration.com/brandnew/archives/in\\_brief\\_google\\_lock...](http://web.archive.org/web/20150126052917/http:/www.underconsideration.com/brandnew/archives/in_brief_google_lockups.php: \"http://www.underconsideration.com/brandnew/archives/in\\_brief\\_google\\_lockups.php:\")\n\n<cite>Jonathan Hoefler’s comment is:<br>\nStumped the band, eh! This must be a first.<br>\nThe font is a beta of General, a family of typefaces that Kevin Dresser is developing with us. The above samples are a little embryonic; keep an eye on Google, and on <a href=\"http://web.archive.org/web/20150126052917/http:/www.typography.com/blog\" title=\"http://www.typography.com/blog\">http://www.typography.com/blog</a>, for more.<br>\n</cite>\n\n"
    },
    {
      "time": "26 May 2009 — 10:14am",
      "content": "<cite>I wouldn’t say it’s very Google, because, frankly, it looks like a amateur job to me. Simple can be polished. And this is not polished.</cite>\n\nIt's easy and incorrect to label Google's visual identity as amateur. Their look is not about being polished or simple.\n\n"
    },
    {
      "time": "26 May 2009 — 11:37am",
      "content": "Is it me or does the sans seem to be floating on a higher baseline than the wordmark?\n\n"
    },
    {
      "time": "26 May 2009 — 11:48am",
      "content": "I think it's centered on the middle of the x-height.\n\n"
    },
    {
      "time": "26 May 2009 — 11:51am",
      "content": "I wonder. It might be sitting on the same baseline as the wordmark –  \nminus the shade. :-\\\n\n"
    },
    {
      "time": "26 May 2009 — 9:55pm",
      "content": "\\> Their look is not about being polished or simple.\n\nIt has always been about being simple, stemming from their focus on simplicity of the user experience. Though whether it is/was polished is a matter of opinion.\n\n"
    },
    {
      "time": "27 May 2009 — 1:42am",
      "content": "Whatever the alignment, it looks off. Perhaps they should have put the words on two lines :( I don't think the two fonts complement each other very well.\n\n"
    },
    {
      "time": "27 May 2009 — 12:01pm",
      "content": "<cite>It has always been about being simple,</cite>\n\nGoogle is massively complex and powerful. I think you're mistaking simplicity with function.\n\n"
    },
    {
      "time": "27 May 2009 — 12:15pm",
      "content": "\\> I think you’re mistaking simplicity with function.\n\nHeheh .. sorry, but I have no idea what this ^ means. Highly complex and functional things can be simple to use.\n\n"
    },
    {
      "time": "13 May 2010 — 9:35pm",
      "content": "What do you like about this identity, Jackson?\n\n"
    },
    {
      "time": "14 May 2010 — 12:32pm",
      "content": "\\> Google is massively complex and powerful. I think you're mistaking simplicity with function.\n\nThat is one great reason to maintain a \"noobish\", \"simple\" and \"amateur\" look. They say \"don't be evil\", so they marketing team is probably aiming for \"don't look evil\" :P\n\nGreat identity in my opinion.\n\n"
    },
    {
      "time": "14 May 2010 — 12:41pm",
      "content": "Clean-up‽\n\nWhere?\n\nI agree with gotnov: Just another little Mom and Pop search engine company. Not one of those big slick search engine corporations like MS Bing.\n\n"
    }
  ]
}
