{
  "id": "58349",
  "title": "HELP! my new font crashes the character map (and everything else)",
  "forum": "Build",
  "tags": [

  ],
  "content": "I recently found an arabic font online for free (scheherezade), but some glyphs were not mapped (and so they didn't appear in the character map in Windows and I wasn't able to use them).\n\nTo fix this, I opened up FontLab and spent countless hours mapping each glyph to the appropriate unicode.\n\nI recreated the font, but now when I install it and try to open the character map, it crashes.\n\nSo does every other program when I try to use my new font.\n\nHow can I even BEGIN to figure out what is wrong?\n\nJamal\n\nPS - I no longer have fontlab, but I can provide anyone willing to help with the font files (.ttf, .vfb, .bak)\n\n",
  "author": "<a href=\"/web/20100203085247/http://typophile.com/user/10168\" title=\"View user profile.\">irf2k</a>",
  "time": "<br>",
  "uid": "10168",
  "comments": [
    {
      "time": "",
      "content": "Did fontlab throw any error message upon generating?  \nPut the generated font online so other typophiles can look inside. (but please be aware of copyright issues, although it's a free font)\n\n"
    },
    {
      "time": "",
      "content": "No, fontlab didn't generate any errors\n\nThe original arabic font can be found free with an Open Font License at:  \n [http://scripts.sil.org/cms/SCRIPTs/page.php?site\\_id=nrsi&item\\_id=ArabicF...](http://web.archive.org/web/20100203085247/http:/scripts.sil.org/cms/SCRIPTs/page.php?site_id=nrsi&item_id=ArabicFonts_Download#ofl \"http://scripts.sil.org/cms/SCRIPTs/page.php?site\\_id=nrsi&item\\_id=ArabicFonts\\_Download#ofl\")\n\nAlso, I created my new font as both TT and OT, available here with the .Bak and .VFB files:  \n [http://www.esentials.net/JamalsFont.rar](http://web.archive.org/web/20100203085247/http:/www.esentials.net/JamalsFont.rar \"http://www.esentials.net/JamalsFont.rar\")\n\nFinal bit of info:  \nWhen I open up the character map, it can load the first few glyphs, but when I try to scroll down, it crashes!\n\nThanks\n\n"
    }
  ]
}
