{
  "id": "58357",
  "title": "Making something out of nothing",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "I have recently been working on a project for a recycling company I would love to share with everyone and get their thoughts. Its still at the developmental stage at the but have been shooting some test shots seen below.\n\nThe shots which are for a corporate brochure are based on the idea of recycling in general. Making something out of nothing. There were lots of ideas floating round at the start…we liked the idea of the brochure being transformed into something else after it had been used. We rejected this on the grounds that we would rather people kept the brochure than ‘recycled’ it and also through print concern for a very small budget. We also considered every bit of text throughout the brochure being shown on packaging of various materials that the company may be recycled. However we felt that this would compromise the brand a little too much and also might effect legibility. In the end the client went for a concept that concentrated on almost utopian style shapes or illustrations being made using entirely recycled materials which may be recycled, or ‘rubbish’.\n\nSo for the past couple of weeks we have been sending out rather pushy emails insisting to everyone that we really did want to take their colourful rubbish off their hands and are very proud of our growing pile. We think the original test shots are looking really good. They are not too ‘pretty’ which is important when displaying recycled rubbish I think but have such depth that are really interesting. We liked the idea of keeping them all really simple shapes and not too detailed as this almost makes the reader of the brochure have to engage with both the pictures and the copy more. Anyway, we are expecting to shoot the final shots soon so I will hopefully show more in a couple of weeks. Feedback at this stage would be great!  \nAnyway we are doing the final shoot tomorrow so will post them and get some feedback.\n\nYou can read this article at [http://www.freddesign.co.uk/](http://web.archive.org/web/20130516063933/http:/www.freddesign.co.uk/ \"http://www.freddesign.co.uk/\")\n\nthanks again.\n\n ![](http://web.archive.org/web/20130516063933im_/http:/typophile.com/files/freddesign_production4_3816.jpg)\n\n ![](http://web.archive.org/web/20130516063933im_/http:/typophile.com/files/freddesign_production11_6122.jpg)\n\n ![](http://web.archive.org/web/20130516063933im_/http:/typophile.com/files/freddesign_production21_3492.jpg)\n\n",
  "author": "chasteauneuf",
  "time": "25 May 2009 — 4:05am",
  "uid": "29870",
  "comments": [

  ]
}
