{
  "id": "58375",
  "title": "Networks & It logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello guys. Can you give me some advice on the type, positioning and maybe color sugestions?  \nAny critique is welcome.\n\nI havnt studied color options yet and the logo’s for a friends it and networks solutions company.  \nIts more or less a restyling where the only element of relevance on the old logo was a perfect triangle.\n\nThanks in advance\n\n ![](http://web.archive.org/web/20090529112733im_/http:/typophile.com/files/fx_5507.jpg)\n\n",
  "author": "<a href=\"/web/20090529112733/http://typophile.com/user/14468\" title=\"View user profile.\">DavM</a>",
  "time": "<br>",
  "uid": "14468",
  "comments": [
    {
      "time": " 25.May.2009 5.55pm",
      "content": "my thoughts are that the symbol is taking the focus away from the text at this point ... might need to be scaled down a bit?\n\naside fromt he S looking a bit weird the US kerning could use some work too\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090529112733/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 25.May.2009 5.59pm",
      "content": "Thanks Paul.\n\nI’ll take a look into that tomorrow. Tho not sure if you noticed but theres 3 more options to the left where the symbol’s a lil bit scaled down and in different positions.\n\nThanks once again\n\n"
    },
    {
      "time": " 25.May.2009 6.10pm",
      "content": "That type treatment is HOT.\n\nSymbol is just ok.\n\nI like the 4th version.\n\n"
    },
    {
      "time": " 25.May.2009 6.18pm",
      "content": "In the 4th version the mark looks like a “play” button. Not sure if it’s intentional.\n\n"
    },
    {
      "time": " 25.May.2009 6.49pm",
      "content": "oh my bad. definitely smaller looks better in that lock up.\n\nI too like th reversed version ... it makes the type seem more robust.\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090529112733/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 25.May.2009 8.41pm",
      "content": "The dark-on-light version of #3 is my favourite. The only thing I’d say about it is that the icon seems a little too far out to the right and isn’t quite ’connected’ with the type. In the other 3, the icon seems to compete with and over-balance the type.\n\nThoughts on Type: [http://www.sthursby.com/blog](http://web.archive.org/web/20090529112733/http:/www.sthursby.com/blog \"http://www.sthursby.com/blog\")\n\n"
    },
    {
      "time": " 25.May.2009 11.34pm",
      "content": "By the way, #3 is somewhat similar to [Cision logo](http://web.archive.org/web/20090529112733/http:/www.identityworks.com/reviews/2007/Cision.gif).\n\n"
    },
    {
      "time": " 27.May.2009 3.54am",
      "content": "@epsilicon: not really... no.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 27.May.2009 4.52am",
      "content": "Sorry for not posting an update yesterday but Im full of work.  \nProlly won’t have the time until the weekend. However by then I’ll try to get it done since its a friend’s work.\n\nAnyway, I have few doubts / questions. I like the type direction I’m taking. Even less confortable with the S after Paul pointed out.  \nI’d appreciate if anyone who knows squarish fonts could post squarish S examples or tell me the font names so I can have an idea of what can be done for that matter.\n\nAbout the symbol, theres not much concept to support it besides the fact that the company works on networks (therefore the triangulation geometry/lines work well) and had a triangle on previous logo.  \nDo you think I should take another direction (I’ve had a few before but none as solid), tweak it, redraw it?\n\nSuggestions on the positioning. As it is with the 4 versions I have I like nº 2 the most. Less static, and with a nice scale. However its still not there, and Im kinda stuck at this point.\n\n"
    },
    {
      "time": " 27.May.2009 3.33pm",
      "content": "simply not good enough! we will have to find another thread to follow then. :-P\n\nalso, sorry for throwing doubt.\n\nI still think v3’s relative scale and positioning are more balanced ... but I’m also interested in hearing more thoughts on it.\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090529112733/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 27.May.2009 5.23pm",
      "content": "I’m stuck at the name. “Fix Us” seems like an awful name for any type of company.\n\n"
    },
    {
      "time": " 28.May.2009 1.30am",
      "content": "hahaha  \nWell its not an awesome name but theres nothing I can do about that.\n\n"
    }
  ]
}
