{
  "id": "58402",
  "title": "Hinting Advice ?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm looking for some advice, tutorial, or methods for hinting.\n\nI'm producing Post Script Opentype fonts and using this process at the moment to hint.\n\n1. Set the Alignment Zones - Not using auto zones which doesn't seem to do a great job.  \n2. Auto Hint the fonts with either FontLabs Auto Hinting or Adobe's AFDKO - I've tried both to compare results. I then adjust hints that don't seem to work.  \n3. Set the Standard Stems - Again not using auto stems but the method described [here](http://web.archive.org/web/20100203081048/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=NotesOnHintingWithFL)\n\nAfter using this process and changing lots of different parameters I'm still getting hints that don't seem to be working.\n\nThis image shows the Sub/Superscript, the Superscript on the right is jumping all over the place at small sizes.\n\nIs there anything else I can try to improve the hinting ?\n\n ![](http://web.archive.org/web/20100203081048im_/http:/typophile.com/files/sub_6709.png)\n\n",
  "author": "<a href=\"/web/20100203081048/http://typophile.com/user/16986\" title=\"View user profile.\">RachelR</a>",
  "time": "<br>",
  "uid": "16986",
  "comments": [
    {
      "time": "",
      "content": "Have you checked your bottom alignment zone for the superscripts? Remember that bottom alignment zones belong in 'Secondary zones'.\n\n"
    },
    {
      "time": "",
      "content": "Yes the bottom alignment zones where set correctly in the Secondary Zones field\n\n"
    },
    {
      "time": "",
      "content": "Screencap of your zones in glyph window?\n\n"
    },
    {
      "time": "",
      "content": "Rachel\n\nSome of your glyph hints maybe overlaping some blue zones (perhaps the x height blue zone?). I would be happy to look at your vfb file if you like.\n\nmalcolm\n\n"
    },
    {
      "time": "",
      "content": "Malcolm\n\nIt would be a great help if I could send you the vfb - do you have an email I can send them to ?\n\nRr.\n\n"
    },
    {
      "time": "",
      "content": "Rachel\n\nsend the file to malcolm(dot)wooden(at)sky(dot)com\n\nmalcolm\n\n"
    }
  ]
}
