{
  "id": "58416",
  "title": "FontJazz: Another sIFR Alternative",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I searched and searched and found nothing on Typophile about this yet, so please pardon any redundancy if this has been discussed already...\n\nI came across [FontJazz](http://web.archive.org/web/20131022202051/http:/fontjazz.com/) tonight (thanks @smashingmag via Twitter). Looks pretty good at first sight. Biggest advantages are its small size and that it runs client-side rather than server-side. Not sure about the licensing issue, and the biggest drawback I can see is that text is not actively selectable. What I mean is that you can't select letter-by-letter (as we tend to do), but if you select and copy text that includes the rendered heading, the heading _will_ paste from the clipboard (there's just no visual feedback that you selected the header).\n\nAnyway, they say it's only in beta and promises to deliver more soon. I wonder if that includes info on issues with fonts' EULAs. I'm looking forward to trying it, just not now — it's 2:30 and I'm so going to bed...\n\n",
  "author": "microspective",
  "time": "26 May 2009 — 11:38pm",
  "uid": "14473",
  "comments": [
    {
      "time": "27 May 2009 — 12:04am",
      "content": "Now, isn't that an interesting bit of javascript.\n\nEssentially it converts a font file into a large gif and a single size with a font color and background and then uses javascript to place the letters with (hopefully) proper kerning. While it doesn't have near the functionality of sIFR, cufon or any of those other methods (in fact, it is pretty limited in terms of usage), it does provide a method of putting a custom font online without making it easily available for someone to steal.\n\nIt may not fly given that you are, in essence, decompiling the font and reassembling it in a new form (I think a number of EULAs ban that sort of behaviour), but other than that, it does seem to address security issues. The only flaw is the limited usage.\n\nNow, if they made it output PNG-24 instead of gif, then it would be more handy, even if it loses some applicability in IE6.\n\n"
    },
    {
      "time": "27 May 2009 — 7:02am",
      "content": "PNG24: I so agree. My guess is that gif was chosen to keep it lightweight. (not that it would add much more to the size...)\n\n"
    },
    {
      "time": "27 May 2009 — 7:09am",
      "content": "Someone needs to tell the people who code all these type engines that they might want to announce them to the type world so we can look them over for licensing potential.\n\n"
    },
    {
      "time": "27 May 2009 — 9:39am",
      "content": "This looks interesting, and I don't get it. Where does the image go when one uploads a font: to their central server?\n\nI'd question the kerning BTW. Unless of course the font they use themselves is badly kerned to begin with… That \"Eleg ant\" on their \"Welcome\" page looks pretty bad.\n\n"
    },
    {
      "time": "27 May 2009 — 9:46am",
      "content": "I did a test using a generic computer font and the way it works is that once they have processed the font, it gives you a 2 javascript files, one for the action itself and another with the font specifics. It also gives you back the image. So you'd upload all three to your personal server and run it from there.\n\nAnd yeah, I would question the kerning too. It seems like they figured some way to do basic kerning (it is applying different margins depending on the letter), but I doubt it has the functionality to deal with kerning pairs or such.\n\n"
    },
    {
      "time": "27 May 2009 — 9:59am",
      "content": "Ah, that's reassuring – thanks.\n\nSo it kinda does spacing but not kerning? Hey, now that you mention it, wasn't there somebody asking about this a while ago – how to \"extract\"/determine the sidebearings from a font to generate \"spaced\" single-glyph images? Although maybe that was about some server-side stuff.\n\n"
    },
    {
      "time": "27 May 2009 — 3:51pm",
      "content": "The only thing that sounds good with the word \"jazz\" is jazz.\n\n"
    },
    {
      "time": "28 May 2009 — 12:42pm",
      "content": "Hi there,\n\nFontJazz developer here ... yes, the engine does support PNG with alpha-transparency (looks great with overlapping glyphs) and other fancy features, they're just not exposed in the UI yet - it's still in beta.\n\nNote that with IE, that feature will only work with IE 6 and newer, due to lacking PNG support in previous versions.\n\nKeep an eye out in the next couple of weeks, more features will be added/exposed.\n\n"
    },
    {
      "time": "28 May 2009 — 1:40pm",
      "content": "I don't see why there'd be any licensing issues what-so-ever. It's just using an image:\n\n[http://fontjazz.com/img/font.gif](http://web.archive.org/web/20131022202051/http:/fontjazz.com/img/font.gif \"http://fontjazz.com/img/font.gif\")\n\nIt's an automated image replacement script. Clever.\n\n"
    },
    {
      "time": "28 May 2009 — 1:49pm",
      "content": "This doesn't do kerning right? That's a big downside.\n\n"
    },
    {
      "time": "28 May 2009 — 2:00pm",
      "content": "I really doubt it kerns. Though it's still a very neat idea.\n\n"
    },
    {
      "time": "28 May 2009 — 4:37pm",
      "content": "@stewf not, 'smooth'?\n\n"
    },
    {
      "time": "29 May 2009 — 7:58am",
      "content": "Stephen Coles is spot on. I was going to say that myself. It's worse than FontGargler.\n\n"
    }
  ]
}
