{
  "id": "58430",
  "title": "Mid century Brazilian apartment block font...",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Random one this.\n\nJust went to Brazil for a holiday. Noticed a lot of the apartment blocks use this font or a similar one. The example is taken from the gorgeous [Edificio Copan](http://web.archive.org/web/20130106073710/http:/wikimapia.org/2134/Edif%C3%ADcio-Copan-Oscar-Niemeyer-s-Copan-Building)\n\nLooks like ITC Blair but is there something more authentic from the time (mid fifties) that this is based on? Only got a few characters in the image - sorry.\n\nThanks for your help.\n\n| Attachment | Size |\n| --- | --- |\n| [P1000869.JPG](http://web.archive.org/web/20130106073710/http:/typophile.com/files/P1000869.JPG) | 65.53 KB |\n\n",
  "author": "Uncle_Pinny",
  "time": "27 May 2009 — 6:24am",
  "uid": "22395",
  "comments": [
    {
      "time": "27 May 2009 — 6:50am",
      "content": "It's unfortunate that your photo has only those letters, as they are not generally useful for ID purposes. For future opportunities, try to get letters like A, E, G, J, K, M, R, S, and W, which tend to be more varying between typefaces.\n\nI could not find a writeup about the origin of the design for Blair, but it is possibly based on existing lettering that Jim Spiece saw elsewhere, as most of his work has been revivals of older designs.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 May 2009 — 6:55am",
      "content": "Hmm... thanks. Pity that's all there was in that particular sign.\n\nI have a feeling it's very common as I saw it everywhere on the condos of Sao Paulo.\n\nReminds me of the [Dorothy Perkins](http://web.archive.org/web/20130106073710/http:/www.dorothyperkins.com/) font 9which must be pretty obvious to you lot... ?\n\n"
    },
    {
      "time": "27 May 2009 — 7:11am",
      "content": "To follow up on the idea of older designs that might have been similar to the lettering you showed, I looked in the oldest of the Photo-Lettering Catalogs I had (from 1960), and there are a number of typeface families such as Hamilton Gothic, Darius Wide, Paramount Gothic, Amsterdam Card Grotesque and others that include variants that have wide geometric sans letters that look very much like ITC Blair. Almost any of them could have been models for it.\n\nMost of these were probably never digitized. Today you could pick from ITC Blair, ITC Flatiron, Akzidenz-Grotesk Extended, Trade Gothic Extended, Engravers Gothic and House Neutraface (1 and 2), and probably find something to replicate the lettering you saw.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 May 2009 — 7:26am",
      "content": "Great - thanks for that.\n\nIt's a real help. That Flatiron is interesting - not what I was looking forward but maybe useable for other things.\n\nThanks again\n\n"
    },
    {
      "time": "27 May 2009 — 8:48am",
      "content": "The face seems to be set in an old face called Standard Extended which has yet to be fully re-visioned . . .\n\nI created my own ultra-extended face called Turnpike which may suit your needs although it is a bit heavier . . . [http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=FODI-TURN](http://web.archive.org/web/20130106073710/http:/www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=FODI-TURN \"http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=FODI-TURN\")\n\nStuart :D\n\n"
    },
    {
      "time": "27 May 2009 — 8:59am",
      "content": "Thanks Diner.\n\nLove the name 'Standard Extended'\n\nWill check out Turnpike and see if that will do.\n\nThanks for the knowledge!\n\n"
    }
  ]
}
