{
  "id": "58448",
  "title": "Change a typeface name???",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello-\n\nI am working on setting up an online ordering program for a printing company.  \nClients will be able to typeset basic business cards (created by a designer) with the software provided by [www.nowtg.com](http://web.archive.org/web/20100203083306/http:/www.nowtg.com/ \"www.nowtg.com\")\n\nI am having an issue with providing the software company with the fonts to use.  \nThe software uses a microsoft word type editor to input the text for the business card.\n\nI have provided several fonts for nowtg to upload to the server for the editor, however we are running into several problems.\n\nWith the font Univers, there are several versions that I need uploaded.\n\nUnivers Condensed Bold Oblique, Univers Condensed Bold & Univers Condensed Oblique etc.  \nHowever, when I submit the fonts, the support staff is running into problems because of the \"typeface name.\"  \nAll of the typeface names say \"Univers\" and this causing the upload problems.  \n(see screen shots)\n\n[http://img.photobucket.com/albums/v346/edouble/Picture1.png](http://web.archive.org/web/20100203083306/http:/img.photobucket.com/albums/v346/edouble/Picture1.png \"http://img.photobucket.com/albums/v346/edouble/Picture1.png\")  \n [http://img.photobucket.com/albums/v346/edouble/Picture3.png](http://web.archive.org/web/20100203083306/http:/img.photobucket.com/albums/v346/edouble/Picture3.png \"http://img.photobucket.com/albums/v346/edouble/Picture3.png\")  \n [http://img.photobucket.com/albums/v346/edouble/Picture5.png](http://web.archive.org/web/20100203083306/http:/img.photobucket.com/albums/v346/edouble/Picture5.png \"http://img.photobucket.com/albums/v346/edouble/Picture5.png\")\n\nIs there any way to change the typeface name??\n\nI have tried TransTypePro, FontLab and FontRenamer but I have been unsuccessful.\n\nAny advice would be highly appreciated!\n\nthank you-  \nEric\n\n",
  "author": "<a href=\"/web/20100203083306/http://typophile.com/user/4758\" title=\"View user profile.\">ericw</a>",
  "time": "<br>",
  "uid": "4758",
  "comments": [
    {
      "time": "",
      "content": "You should probably first contact Adobe about a server license.\n\n"
    },
    {
      "time": "",
      "content": "At first sight it looks like the naming convention of the PostScript Type1 versions has been directly used for the (converted) TrueType fonts. One would expect that the deducted Font Subfamily names/style attributes ([TT/PS1] Full font name/FullName minus Font Family name/FamilyName) to work well with PS Type1 (if I recall well, from already Windows 3.1 on it is allowed for this format to go beyond the four styles Normal, Italic, Bold, BoldItalic) and probably also with TrueType fonts in the Adobe font engines, but not in other applications under Windows. But experts like Thomas Phinney or John Hudson should correct me if I am wrong.\n\nRenaming as such –if, of course, allowed by the copyright holder– should not be a problem and the current naming could perhaps be kept for the NameID's 1 and 2 of PlatformID 1 and for the NameID's 16 and 17 of PlatformID 3, I reckon.\n\n"
    },
    {
      "time": "",
      "content": "Thank you. I will contact Adobe this afternoon. :)\n\n"
    }
  ]
}
