{
  "id": "58463",
  "title": "Folk, sexy serifs",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20090607101728im_/http:/typophile.com/files/2461259628_36c70a040c_6019.jpg)\n\nA hairdressers logo with sexy serifs, i wonder if this is custom(ized) or not? Anyone got any ideas? Thanks!\n\n",
  "author": "<a href=\"/web/20090607101728/http://typophile.com/user/783\" title=\"View user profile.\">xencreative</a>",
  "time": "<br>",
  "uid": "783",
  "comments": [
    {
      "time": " 28.May.2009 3.53am",
      "content": "Looks like a modified version of Garromond Narrow Light\n\n[http://new.myfonts.com/fonts/adobe/itc-garamond/narrow-light/index.html](http://web.archive.org/web/20090607101728/http:/new.myfonts.com/fonts/adobe/itc-garamond/narrow-light/index.html \"http://new.myfonts.com/fonts/adobe/itc-garamond/narrow-light/index.html\")\n\n"
    },
    {
      "time": " 28.May.2009 6.39am",
      "content": "It may come from a Garamond, but I don’t think it’s ITC Garamond. The relative height of the l and k isn’t right, and even the k leg position is different, assuming you accept that the end of the k leg was modified. It seems that too much would have had to change, although I know anything is possible.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 28.May.2009 10.44am",
      "content": "Yes Mike, I agree that its not ITC garamond. The serifs are too rounded compared to this.. and yes I also think there could be some modification on the f and k, still most could/should still be derived from an original font I believe. More opinions more than welcome :)\n\n"
    },
    {
      "time": " 28.May.2009 12.08pm",
      "content": "I have been searching Garalde typefaces looking for similar k structure (ignoring the flip leg), and it seems that Zapf and Goudy have used similar leg placement in some of their typefaces. The lower leg of the k connects close to the stem, but on the upper leg. Zapf’s Aldus and Zapf Renaissance look pretty close to the k used in the logo.\n\nThe initial f looks very customized, and it surprises me that a hair salon would have a custom logo, unless this is a large chain of shops.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 28.May.2009 12.30pm",
      "content": "I guess my conclusion is that this is certainly a custom logo. If I had to pick a starting point, I would use [Zapf Renaissance Antiqua](http://web.archive.org/web/20090607101728/http:/new.myfonts.com/fonts/efscangraphic/zapf-renaissance-antiqua-sh/), and I would shorten the l so that the serifs on top of the l and k are stepped, such that the top edges of the serifs form a straight line. Then I would clip off the leg of the italic k and transplant it on the Roman k (and then probably tweak it a lot). The f would be a challenge for me, because I have no skill at this (obviously), but I know this would be relatively simple work for any one of the font designers who hang out here.\n\nYour original question was whether this was a font or custom, and I vote the latter.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 30.May.2009 8.49pm",
      "content": "Great insight Mike, thanks for looking into this. I hope it intrigued you as much as I did ;)\n\n"
    },
    {
      "time": " 31.May.2009 8.50am",
      "content": "It certainly did, because it had a professional look to it. Thinking that this must have been a franchise hair salon operation I looked for, but could not find, this hair salon on the web, so if this is a one-off shop I am really surprised they would have gone to the trouble (and presumed expense) of having a custom logo designed. Two things occurred to me: 1) It is cheaper than I think to have a logo made; or, 2) This lettering comes from a font I haven’t found yet.\n\nThe f has some attributes of an italic f, but it is vertical. I think if I see that f anywhere I hope I can remember this thread.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 31.May.2009 12.27pm",
      "content": "I did an extensive search for legible serif fonts yesterday and stumbled upon a few likely suspects that could have been used as a starting point. Although each one would need specific unlogical customisation to achieve the exact result (not considering the f), i think Valfieris by Insigne comes quite close.\n\n[http://www.myfonts.com/fonts/insigne/valfieris/regular/](http://web.archive.org/web/20090607101728/http:/www.myfonts.com/fonts/insigne/valfieris/regular/ \"http://www.myfonts.com/fonts/insigne/valfieris/regular/\")\n\nThe serif details would need to be straightened and skewed a little on the ascenders, and its not as condensed as the logo but still the k is remarkably similar.\n\nAs for the mystery of custom font logo, I think the answer lies in the fact that hairdressers may have friends who are doing graphic design, and therefor can have a nice logo done for cheap.\n\nI wish I could remember where i found this image though..could shed more light onto the whereabouts of the salon itself or the designers..\n\n"
    },
    {
      "time": " 6.Jun.2009 11.51am",
      "content": "Mike, I found the source: [http://subtype.org/modified/](http://web.archive.org/web/20090607101728/http:/subtype.org/modified/ \"http://subtype.org/modified/\")\n\nit’s in their modified section, so it’s definitely a customised font, not all original. Ive mailed Subtype asking to shed light onto this for us, but unfortunately they haven’t replied :(\n\n"
    }
  ]
}
