{
  "id": "58469",
  "title": "Type Battle 38 & ita",
  "forum": "Design",
  "tags": [

  ],
  "content": "While I’m still thinking about my entry to Type Battle 38, I thought I would mention an already-in-existence possibility that would screw up a computer pretty well — ita, the Initial Teaching Alphabet\\*\\*.\n\nFor those who don’t know, it was a 44 character language devised in the 1960s by a fellow named Sit James Pitman designed to help children learn the English language easier by standardizing the phonetic sound of each letter. It was supposed to help kids build confidence so when they had to switch back to the regular alphabet, they would be able to do so without despair. Of course, it had mostly died out by the 1970s because it was rather hard for most kids to make the switch back, even with the early gains.\n\nSo, how does it all work you may be asking. Well, check out the handy chart below:\n\n ![](http://web.archive.org/web/20090531124724im_/http:/typophile.com/files/pitman_ita_4108.jpg)\n\nReading the word below each character reveals the sound and every time you see that character, it will always have that sound. Seems simple enough, no? Well, try your hand at this page from a children’s book:\n\n ![](http://web.archive.org/web/20090531124724im_/http:/typophile.com/files/couboi-smaull-text_small_4157.jpg)\n\n(for those with their minds in less respectable places, you may laugh amusedly)\n\nNow, how many of you had to look at the chart to figure out some of those words or found themselves speaking the sounds out-loud? I know I did. Now this brings us to an interesting concept. What if you asked someone to figure out the proper English spelling based on a word written in ita? Sure, some words are easy, like “coffee”, but others are totally different, like “eats,” “noon,” and, “cowboy” (yes, “cowboy” IS what that one word is...). If you created a collection of particularly complicated words, a person would be able to sound them out (provided a cheat sheet perhaps), but I doubt a computer would be capable of it given the extra step involved.\n\nThis isn’t to say that using ita would be an effective CAPTCHA system due to the level of frustration more complicated words could cause someone who is not used to reading it, but it is a fascinating idea. Furthermore, it would be difficult for a spammer to program a computer to figure it out unless they personally went word for word to figure out the keyword and told the program how to identify that particular keyword.\n\nFor those who are interested in reading more, here are some links I found (including where I got the above images):  \n [Omniglot’s article on ita](http://web.archive.org/web/20090531124724/http:/www.omniglot.com/writing/ita.htm \"Omniglot\")  \n [Rare Frontier’s post about ita.](http://web.archive.org/web/20090531124724/http:/rarefrontier.wordpress.com/2008/12/19/the-initial-teaching-alphabet/ \"Rare Frontier\") Includes the book scan I provided above.  \n [ita Foundation website](http://web.archive.org/web/20090531124724/http:/www.itafoundation.org/index.htm \"ita Foundation\")  \n [Wikipedia’s article on ita](http://web.archive.org/web/20090531124724/http:/en.wikipedia.org/wiki/Initial_Teaching_Alphabet \"wikipedia's article\")\n\n\\*\\* I use the letters “ita” instead of “ITA” since “ita” was used at the time to avoid confusion with the Independent Television Authority, which used “ITA.”\n\n",
  "author": "<a href=\"/web/20090531124724/http://typophile.com/user/43561\" title=\"View user profile.\">aaronbell</a>",
  "time": "<br>",
  "uid": "43561",
  "comments": [
    {
      "time": " 28.May.2009 9.28am",
      "content": "Curiously enough, I have a friend who learned to read through the i.t.a. in the mid 90s (in South Africa). She hates it.\n\n"
    },
    {
      "time": " 29.May.2009 12.51pm",
      "content": "My seons are on the desert alphabet.  \n [http://www.omniglot.com/writing/deseret.htm](http://web.archive.org/web/20090531124724/http:/www.omniglot.com/writing/deseret.htm \"http://www.omniglot.com/writing/deseret.htm\")  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20090531124724/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    }
  ]
}
