{
  "id": "5847",
  "title": "Frutiger or Segoe",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Another Clone. While this article is written by the infamous Fred Nader it does raise some interesting issues.   \n   \n [http://www.hardcovermedia.com/lab/articles/fruseg.htm](http://web.archive.org/web/20141110021230/http:/www.hardcovermedia.com/lab/articles/fruseg.htm)\n\n",
  "author": "nigelh",
  "time": "30 Jul 2004 — 7:54am",
  "uid": "4071",
  "comments": [
    {
      "time": "30 Jul 2004 — 8:01am",
      "content": "They cloned the first three letters of my last name too!   \n [http://www.typophile.com/cgibin/show.pl?30/34598](http://web.archive.org/web/20141110021230/http:/www.typophile.com/cgibin/show.pl?30/34598)   \nAS\n\n"
    },
    {
      "time": "5 Aug 2004 — 9:30am",
      "content": "Is this really acceptable?   \n [http://www.designnavigator.daimlerchrysler.com/html/magazine/html/m3\\_4\\_0107\\_e.html](http://web.archive.org/web/20141110021230/http:/www.designnavigator.daimlerchrysler.com/html/magazine/html/m3_4_0107_e.html)   \n   \nAnd why does Microsoft, with all its money, resort to this?\n\n"
    },
    {
      "time": "5 Aug 2004 — 9:46am",
      "content": "Oh, I see: now you're mounting a campaign to restore the credit of your pet font house through the _dis_crediting of others. Sure, that'll work, yeah.   \n   \nBasically, you still don't get why people despise B, and why that makes total sense.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Aug 2004 — 9:54am",
      "content": "Hrant.   \n   \nYour posts are showing signs of schizophrenia.\n\n"
    },
    {
      "time": "5 Aug 2004 — 10:07am",
      "content": "they say there's a fine line between genius and insanity.   \ni wonder if hrant's flirting with this line sometimes. ;^)\n\n"
    },
    {
      "time": "5 Aug 2004 — 10:13am",
      "content": "I might be slightly insane, but I'm certainly not a genius. On the other hand, I do have the common sense to recognize a rat when I see one. I've personally caught over 20 of them, some as big as Nigel's head.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Aug 2004 — 10:17am",
      "content": "\"I might be slightly insane.\"   \n   \nHrant you have actually said something that I agree with you.\n\n"
    },
    {
      "time": "5 Aug 2004 — 11:56am",
      "content": "Microsoft, Agfa Monotype and Linotype are discussing the Segoe/Frutiger issue.   \n   \nI think MS commissioned the new types in good faith: they certainly didn't ask for a Frutiger clone (indeed, they already license Frutiger Linotype for the MS Reader, and have no need for a clone). Agfa Monotype deny that Segoe is an intentional Frutiger clone, but most people I've spoken to seem to agree that, whatever AM's intent, the result is too similar to Frutiger for comfort. In this respect, I don't think it matters much, certainly not to MS, whether it is an intentional copy or not: the possible PR damage from something that large numbers of people think looks like a copy is reason enough to be concerned.\n\n"
    },
    {
      "time": "5 Aug 2004 — 12:49pm",
      "content": "\\> the possible PR damage from something that large numbers of people think looks like a copy   \n   \n?   \nYou think the opinions of type designers really matter in the mainstream?   \n   \nhhp\n\n"
    },
    {
      "time": "5 Aug 2004 — 1:04pm",
      "content": "John   \n   \nYou raise some interesting issues but this is the third time this has happened with Arial, Book Antiqua and now Segoe. Do you really know that when Microsoft commissioned the new types in good faith that they did not realize what they would be getting?   \n   \nAlso from which sector(s) is the PR damage potentially coming from?\n\n"
    },
    {
      "time": "5 Aug 2004 — 2:36pm",
      "content": "\" Microsoft, Agfa Monotype and Linotype are discussing the Segoe/Frutiger issue.\"   \n   \nAnd that's IT!!!   \n   \nHrant is right - \"You think the opinions of type designers really matter in the mainstream?\"   \n   \n   \n\" the possible PR damage from something that large numbers of people think looks like a copy \"   \n   \nMaybe here. Typophile. But not the real world. (maybe - this is sad. But this is the true)   \n   \n   \n   \nThe Lord of The Ring\n\n"
    },
    {
      "time": "6 Aug 2004 — 8:46pm",
      "content": "Frutiger is a much beloved typeface known and used by lots of professional graphic designers, many more of whom are now Windows users than when Book Antiqua hit the personal computer. MS are justifiably concerned about what might written about them in a wide circulation design mag like Print or Communication Arts, especially since negative stories tend to travel. Even the utter stupidity of the claim that Wingdings contains hidden antisemitic messages made it to the New York Times.   \n   \nI happen to know for a fact that a lot of people at MS are very concerned about the Segoe/Frutiger issue, and are working to resolve it. I wouldn't be saying anything in this thread if all I had to offer was speculation. I work with these people.\n\n"
    },
    {
      "time": "6 Aug 2004 — 11:37pm",
      "content": "John - I'm glad to hear that. As a former news editor and reporter (huge network, and more than 15 years) - this is a story without a story.   \n   \nTry to clone a book/novel by Paul Auster. or a movie? - The next day you'll have a HUGE headline. But not with a typeface.   \n   \n   \n ![:-)](http://web.archive.org/web/20141110021230im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nThe Lord of The Ring\n\n"
    }
  ]
}
