{
  "id": "58475",
  "title": "Fractions with oldstyle figures",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So, the default figures in the font are oldstyle--but when it comes to fractions, superior figures, etc., they're all lining!\n\nWhat's with that? it's like two hundred years ago, when they only had roman figures in italic fonts! Surely in this day and age foundries could bother to get some consistency happening.\n\nJust saying.\n\n",
  "author": "<a href=\"/web/20111228153755/http://typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": "",
      "content": "Hmm, wouldnt it be rather strange? I mean, where would the horizontal visual 'baselines' (x-height and baseline) be aligned from when the numbers have different height? What rule would be applied?\n\n ![](http://web.archive.org/web/20111228153755im_/http:/typophile.com/files/fracc_4118.png)\n\n"
    },
    {
      "time": "",
      "content": "Goran, that's what I initially thought of as well, but when you think about it, letters can also be used in these same situations (especially for marking footnotes or scientific equations). We just have to define a baseline and we accept that a p versus an x and an l will just all have different eyes.\n\nSo maybe it's just tradition, though I know math books back in the day were known to be published in old-style numbers (and I think someone on here posted an example of it too).\n\n"
    },
    {
      "time": "",
      "content": "I consider oldstyle figures a solution to a problem. Like full capitals, lining figures ruin the color of the page by creating a blot of type that the eye is attracted to, causing the reader to jump back and forth between the blot and the words being read.\n\nWhile OS figs solve this problem, they do not contribute to the elimination of a blot of this type.\n\nNow, if you consider that OSF are only used because they are prettier, then it makes sense to use them in the fractions and superiors as well.\n\n"
    },
    {
      "time": "",
      "content": "In the Garamond style, different topography:\n\n ![](http://web.archive.org/web/20111228153755im_/http:/typophile.com/files/104_4635.jpg)\n\n"
    },
    {
      "time": "",
      "content": "More fuel for the biggest-character set arms race!\n\nThe idea of old-style fractions seems odd at first, but they do seem to be a better choice for text fonts. Perhaps the problem here is that OpenType needs to include and old-style fractions option—I’m not sure how one could make it work now without picking non-default fractions from the glyph palette.\n\n"
    },
    {
      "time": "",
      "content": "Actually, you could include a change in fraction and superior figure style, in the \"onum\" feature.\n\n"
    },
    {
      "time": "",
      "content": "Use decimal places.\n\n"
    },
    {
      "time": "",
      "content": "Ranging figures would clash uncomfortably in some fractions, which I will not attempt to create using proper Unicode here. Anything with a descender up top and an ascender below is a problem, like (3|4|5|7|9) over (6|8).\n\nNonnumeric characters can be used in fractions. g/6 would be tricky. Denominators using capitalized accented variables, like A bar or A hat (I’m using the spoken forms here), would be a problem.\n\nFractions, like many other realms of typography, are superficially simple and too often are given simplistic miracle solutions that don’t cover all the bases.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20111228153755/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "",
      "content": "Did they ever do standard fractions, with the slash, with old style figures? Why would anyone want to?\n\n"
    },
    {
      "time": "",
      "content": "It's not so much the lining vs extender issue that interests me, but the divergence of forms (as shown in Garamond, above).\n\n"
    },
    {
      "time": "",
      "content": "Oh, yes, that is nice: lining (as in same heights) but with an oldstyle-look? :)\n\nI would buy that, definately.\n\n"
    },
    {
      "time": "",
      "content": "i'm with James.\n\n"
    },
    {
      "time": "",
      "content": "The odd thing is that O.S. fractions look strange with O.S. figs; they seem to work better with lining numerals.\n\n ![](http://web.archive.org/web/20111228153755im_/http:/typophile.com/files/Fractions_3820.jpg)\n\n"
    },
    {
      "time": "",
      "content": "They just look like a jumble. I think the most harmonious form would be lining numbers in a fraction that was osf/sc height instead of cap height.\n\n"
    },
    {
      "time": "",
      "content": "Looking at Cameron's example, I feel that the fraction rule would need to extend between ascender and descender, not just ascender to baseline; then the denominators need go below baseline. Oh, what typophillic mess you got us into, Nick!\n\n"
    },
    {
      "time": "",
      "content": "In reply to Jackson: Like this? If so, I have to disagree.\n\n ![](http://web.archive.org/web/20111228153755im_/http:/typophile.com/files/Fractions2_3516.jpg)\n\n"
    },
    {
      "time": "",
      "content": "A friend just sent me a PDF of a chapter from his forthcoming book, which was set in Adobe Garamond with InDesign. I noticed that the numbers in the text and the footnote numbers were both set in oldstyle figures. My first thought was that the failure to set the footnote numbers in superscript figures was an oversight. Now I'm not so sure.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20111228153755im_/http:/typophile.com/files/Picture-1_6232.gif)\n\nSo (a) is the default.  \nOther people were talking about (b) being the solution.  \nI was suggesting (c) as a solution that harmonizes with osf and doesn't look jumbled.\n\nBtw, what are you lining that double prime up with?\n\n"
    },
    {
      "time": "",
      "content": "The small-cap ascender (I know, small caps theoretically don’t have ascenders—ask the foundry—Adobe) of the denominator, the InDesign CS3 default.\n\n"
    },
    {
      "time": "",
      "content": "I misunderstood your original suggestion; I sort of like example c.\n\n"
    },
    {
      "time": "",
      "content": "I looked at my copy of _Fantasia Mathematica_, published in 1958, because it was sure to show me what vulgar fractions next to oldstyle figures used to commonly look like in metal type. The answer differs from (a) in an important respect: the fraction ranges from the ascender line to the descender line. This centers it on the x and is big enough to read.\n\n"
    },
    {
      "time": "",
      "content": "That's what I said before.\n\n"
    },
    {
      "time": "",
      "content": "It seems to me that looking for ranging numerals within fractions misses the point of ranging numerals, which is to harmonise visually with lowercase letters. Within a fraction, it makes far more sense for the numerals to harmonise with each other, since the vertical and horizontal arrangement of elements in a fraction are already distinct from that of lowercase letters.\n\nI can see a benefit to harmonising the form and detail of numerals within fractions to harmonise with those of ‘oldstyle’ text numerals, e.g. omitting the serifs at the bottom of the 4 and making the 0 match the proportions and stroke model of the oldstyle numeral, but I think it a mistake to make the forms ranging: you want the numerator group and denominator group to be distinct and balanced, to form cohesive numbers.\n\n"
    },
    {
      "time": "",
      "content": "Nick wondered, at the very beginning:\n\n\"Surely in this day and age foundries could bother to get some consistency happening.\"\n\nWhich made me think of the poet-typesetter Walt Whitman, who wrote these [slightly amended] lines:\n\n\"Do I contradict myself?  \nVery well then I contradict myself,  \n(I am large, I contain multitudes, as well as both lining and oldstyle figures.)\"\n\nAND THEN, I just heard about this guy an hour ago on the TV: Henry Fountain Ashurst, one of Arizona's first senators, who was known as the \"Dean of Inconsistency.\" Ashurst was proud of the title; and once remarked that\n\n\"the clammy hand of consistency has never rested for long upon my shoulder.\"\n\nall that was apropos of nothing, I know. I actually have some thoughts about Nick's question, but they may have to wait until Tuesday when I get back to my desk and look at some stuff.\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "In the same vein of @ powers, let’s not omit Ralph Waldo Emerson:\n\n_“A foolish consistency is the hobgoblin of little minds”_\n\n"
    },
    {
      "time": "",
      "content": "\"Never trust anyone who only knows one way to spell a word.\" -- Mark Twain\n\n"
    },
    {
      "time": "",
      "content": "Isn't Mark Shields great? :-)\n\n"
    },
    {
      "time": "",
      "content": "An old Czech saying: _Order is for fools, bright people can handle chaos._\n\n"
    },
    {
      "time": "",
      "content": "@ Craig:\n\ngood for you. You were watching TPT at the same time?\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "Jackson, no way can you set fractions to x-height. Cap height or larger, please.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20111228153755/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "",
      "content": "I was just trying to find a solution that addressed Nick's desire for fractions that matched osfs. It just just a sketch of an idea. I never use fractions anyway.\n\n"
    }
  ]
}
