{
  "id": "58501",
  "title": "A question on typewiter type history",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "My question is on the old typewriters, before the electric typewriter, when typewriters had fixed type sizes. Those sizes, if I correctly recall, were \"pica\" and \"elite.\" One was 10 pts, and the the other was 12 pts. (I can't remember which was which).\n\nIf a form was printed, in those days, that was to be filled out using a typewriter, was the leading when using single spacing on the typewriter equivalent to the values used in modern software (12 pts. for 10 pt type and 14.4 pts. for 12 pt. type)?\n\nIf not, does anyone remember the old typewriter single space leading values for those two type sizes?\n\nI tried several searches on this forum, without success. Perhaps I did not use the correct search criteria.\n\nThank you.\n\n",
  "author": "twriterext",
  "time": "28 May 2009 — 1:25pm",
  "uid": "44967",
  "comments": [
    {
      "time": "28 May 2009 — 1:34pm",
      "content": "Pica is 10, elite is 12.\n\nThere was a time when I knew the linespacing value. You can find out yourself: Type a few lines and scan them.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20141006194506/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "28 May 2009 — 2:02pm",
      "content": "Joe, I believe that's backwards. Pica (12 points in a pica, right, so it wouldn't make any sense for it to be a 10 pt. equivalent) had 10 characters to the inch, Elite had 12 characters to the inch. I believe that both had the same leading (linespacing) value, 12 points.\n\n"
    },
    {
      "time": "28 May 2009 — 3:25pm",
      "content": "If I remember correctly (it's been a long time; but I did do a ton of research 'cause I was really curious about all this) - for my Chandler 42 fonts, I measured everything directly from the typewriter and used that for my 10 point master (I was actually trying to do an exact copy of that machine) and the measurements were not consistent with typographic standards.\n\nBuried in the back of my head there's a note that says, 'typewriters have different measurements, don't trust them.'\n\nSo measuring them directly would be your best approach, that is a good suggestion.\n\nWhat I am positive about is each manufacturer had their own standards for developing their 'fonts' - and this was entirely based on their machinery, even the design of the letters themselves were drawn (large, at a drafting table) as one thin stroke, whereas the weight of the metal - when cast - would provide the weight.\n\nCourier's release changed all that. Kinda. It was the first time a typewriter manufacturer decided that there should be a standard.\n\nIf memory serves.\n\nsteve mehallo  \ntinyurl.com/mehallofonts  \nmehallo.com\n\n"
    },
    {
      "time": "28 May 2009 — 3:33pm",
      "content": "All measures were based on inches: 10 pitch meant 10 characters per inch, 12 — 12 per inch.  \nLinespacing in the same measure: fractions of an inch. If I recall correctly double spacing meant 2 lines per inch. Single spacing ergo 4 and one-and-a-half = 3.\n\nPlease correct me.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "28 May 2009 — 6:52pm",
      "content": "Cameron, Joe is right. The pica typewriter vs pica typographical measure confusion was causing me hell in the old (teaching) days. Pica and Elite (as in typewriters) describe the width of a character, not character size: Pica is 7.2 pt wide (10 char/inch) and Elite is 6 pt wide (12 char/inch).\n\n"
    },
    {
      "time": "28 May 2009 — 7:40pm",
      "content": "Yes, I was definitely wrong to say he had it backwards, but right in my assertion of characters per inch. But I thought the original question pertained to equivalent _point sizes_, not pitch, and Joe’s short reply didn't make that clear. And wasn't the leading the same for both Pica and Elite, at least if we’re discussing post-Selectric typewriters?\n\n"
    },
    {
      "time": "29 May 2009 — 6:03am",
      "content": "\\> And wasn’t the leading the same for both Pica and Elite, at least if we’re discussing post-Selectric typewriters?\n\nAnd pre. The leading was called platen advance, and it was fixed, usually to six lines per inch. A few systems had the ability to advance a half line, but less than that meant the platen was not on a gear tooth, and was dangerous.\n\nI can't believe that something as common as the typewriter (my key tool when I was a journalist) is now an antique that people have to recall into memory as to its operation.\n\n"
    },
    {
      "time": "29 May 2009 — 10:19am",
      "content": "So are we, Don, so are we (antiques, that is—amd I’m only 53).\n\n"
    },
    {
      "time": "20 Jun 2009 — 10:46am",
      "content": "Cameron, I _said_ pica is 10 and elite is 12. Then you told me I got it backwards, but said the same thing.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20141006194506/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "14 Jul 2009 — 7:12pm",
      "content": "... I had a roommate once want to use one of my antique typewriters to type up a note.\n\nAnd I was quite amused when he asked me, 'where's the power button on this thing?'\n\nsteve mehallo  \ntinyurl.com/mehallofonts  \nmehallo.com\n\n"
    },
    {
      "time": "14 Jul 2009 — 9:23pm",
      "content": " ![](http://web.archive.org/web/20141006194506im_/http:/typophile.com/files/Underwood_4049.jpg)\n  \nI guess he thought it was a footrest. \n"
    },
    {
      "time": "15 Jul 2009 — 4:08am",
      "content": "Nick, is that a typewriter driving an early stitching machine?\n\nCheers!\n\n"
    },
    {
      "time": "16 Jul 2009 — 10:26am",
      "content": "Ha! That's not too far off - early typewriters were based on sewing machine design; and early on, the space bar was actually controlled by foot.\n\n:)\n\nsteve mehallo  \ntinyurl.com/mehallofonts  \nmehallo.com\n\n"
    },
    {
      "time": "16 Jul 2009 — 10:33am",
      "content": "Ya! I know but I recognize that sewing machine. It's a Windows 1.0 version.\n\nCheers!\n\n"
    },
    {
      "time": "14 Oct 2011 — 2:09pm",
      "content": "Late to the game here...\n\nI have an Smith Corona Coronet Automatic 12, and while trying to figure out whether it was pica or elite, I came across this neat document on typewriter forensics:\n\n**A Systematic Method for Identifying the Make and Age-Model of a Typewriter from Its Work**  \nOrdway Hilton  \n_Journal of Criminal Law and Criminology (1931-1951)_  \nVol. 41, No. 5 (Jan. - Feb., 1951), pp. 661-674\n\n[http://www.jstor.org/pss/1138796](http://web.archive.org/web/20141006194506/http:/www.jstor.org/pss/1138796 \"http://www.jstor.org/pss/1138796\")\n\nThe PDF isn't publicly available, but my institution has access -- grabbed a couple shots just to give you an idea of what it covers.\n\n ![](http://web.archive.org/web/20141006194506im_/http:/typophile.com/files/typewriters-g_4191.png)\n\n ![](http://web.archive.org/web/20141006194506im_/http:/typophile.com/files/typewriters-y-and-s_6223.png)\n\n"
    },
    {
      "time": "14 Oct 2011 — 10:28pm",
      "content": "10 pitch is 12 point and 12 pitch is 10 point. Pitch refers to characters per inch, points to 72 per inch.\n\n"
    },
    {
      "time": "15 Oct 2011 — 3:50pm",
      "content": "Normal typewriters in the English-speaking world indeed typed 6 lines to the inch (12 point) whether using pica (10 characters to the inch) or elite (12 characters to the inch) characters.\n\nSince single-spaced elite typewriting included, effectively, leading, though, one _can_, if one wishes, consider elite type to be 10 point type - but if one does so, one should be careful about asserting that as an intrinsic property of the type instead of simply a choice one has personally made, because otherwise it would confuse people (no typewriter advanced 10/72 of an inch after printing a line of elite type).\n\nAt least one Swiss company, Hermes, made typewriters that put characters on the page with metric dimensions - 2.5 mm wide characters instead of pica, 2.0 mm wide instead of elite, and 1.5 mm was available for a typestyle called \"Economic\".\n\nI've seen an office manual typewriter made especially for government work, I believe, that typed 16 characters per inch and 8 lines per inch. And daisywheel typewriters often allowed the use of small 15 character per inch typefaces, since that fit in with the 1/60 inch unit that supported both pica and elite (and which was also often used for proportional spacing).\n\n"
    },
    {
      "time": "16 Oct 2011 — 7:53am",
      "content": "\\>...(no typewriter advanced 10/72 of an inch after printing a line of elite type).\n\nExcept in single spaced lines or what do you mean? Mechanically: Single spaced 12 pitch is 10 on 12 or so, double spaced 12 pitch was 10 on 20. Digitally: monospaced fonts have all kinds of other measuring and making present to deal with, when the technical and international forces are loosed.\n\nI think \"'points in both dimensions'\" to measure monospaced fonts, as an old 'abbot to keep \"it\" together. ;)\n\nOtherwise, thanks for the additional mechanical info.\n\n"
    },
    {
      "time": "16 Oct 2011 — 8:02am",
      "content": "Mechanically, if single-spaced Pica is 12 points on a 12-point body, then 1 1/2 spaced is 12 points on an 18-point body, and double-spaced is 12 points on a 24-point body... and Elite is then 10 points, also on 12-point, 18-point, and 24-point bodies in those cases.\n\nIt is certainly true, on the other hand, that digital monospaced fonts come in only one version - and thus they can be in any point size, and their horizontal spacing will decrease proportionately as the point size is adjusted. So if you have a Pica typeface, then the 10-point version will have 12 characters per inch horizontal spacing - but things won't necessarily match up so well.\n\nIncidentally, the Pica version of Courier had basically the same character height as most Elite typefaces on the Selectric. If a digital version of Courier did not include the extra space, the 10 pitch version could therefore have a point size of 10 points instead of 12. But, as you've noted, with digital faces, spacing is often arbitrary. As well, digital faces seem to, at least by default, include considerable built-in leading.\n\n"
    }
  ]
}
