{
  "id": "58541",
  "title": "Redesigning a fancy dress and party store logo...",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello\n\nI am redesigning a logo for a fancy dress and party retailer, this is my first attempt, and also my first post here, so if my work is appalling and offends you, I do apologise!\n\nI really do need advice though and this is a great opportunity for me to share this logo with you, I really appreciate any feedback you may be able to give..\n\nMany thanks\n\n ![](http://web.archive.org/web/20090619091754im_/http:/typophile.com/files/full_size-b_4290.jpg)\n\n",
  "author": "<a href=\"/web/20090619091754/http://typophile.com/user/45003\" title=\"View user profile.\">joerichards</a>",
  "time": "<br>",
  "uid": "45003",
  "comments": [
    {
      "time": " 29.May.2009 4.18pm",
      "content": "PS. I can tell it looks amateur, I just really don’t know where, so that’s where any advice is gratefully received, thanks...\n\n"
    },
    {
      "time": " 29.May.2009 5.41pm",
      "content": "I’m guessing this is a store with kid’s stuff. But if it’s a “fancy dress” store I don’t understand the use of a kid with a baseball hat and wings. And what does the exclamation mark on the shirt stand for?\n\nThere’s a number of technical concerns, you have a lot of gradients, which may not reproduce well depending upon usage.\n\nI think you need to outline the project more. Does “fancy dress” mean elegant party/wedding/christening clothes for children? or is it more of a party supply store that sells balloons and party favors? How will the logo be used? on signs? on the web? on business cards? Will it ever need to be in one color?\n\nThere’s concerns regarding your type selection and kerning, but until the real nature of the store is better understood it’s not even something to delve into yet.\n\nI think you should go back to square one. Determine what is the image the store wants to convey. Then start by doing sketches on paper. Work on the concept and composition before diving in with the gradient tool. I hope I don’t sound harsh but it seems like you put the cart before the horse and need iron out the concept first.\n\n"
    },
    {
      "time": " 29.May.2009 6.34pm",
      "content": "Thanks for your comments.\n\nThe person in the logo was intended to be a member of staff.. someone who is a bit fun wearing the products and holding balloons. the logo originally was an exclamation mark, and therefore that on the shirt is the logo, and the cap part of the uniform (the concept is obviously lost here I can see).\n\nThe store is for adults as much as it is children, supplying to hen nights, new years eve, halloween, as well as kids dress up, and party decorations and balloons. Its very hard to come up with something that suggests all this.\n\nSo generally speaking, should I be designing a logo in black and white first? And only once this works add colour?\n\nIf I made it more obvious the character was a member of staff, does this idea sound good to anyone?\n\nThanks again for any comments...\n\n"
    },
    {
      "time": " 29.May.2009 7.00pm",
      "content": "The character is great, and unless you have another idea I think it should be the emphasis of the design. You may however want to make the smile stand out more and use more distinct colors for the various segments.\n\nThe “just for fun” font isn’t working IMO. (Kerning is bad, lowercase “s” looks weird) I suggest you try some other typefaces and choose a color that stands out more from the character. Purple?\n\n"
    },
    {
      "time": " 29.May.2009 7.19pm",
      "content": "(Kirsten: “fancy dress” is England English for “costume party”.)\n\nAssuming you’re going to keep working with what you have, I’d make the main letterspacing much tighter, and replace the secondary type with a typeface that matches or harmonizes in some way with the main type. The image is probably a bit too cluttered with stuff, and I realize it’s very hard to see “simplicity” and “wackiness” going hand in hand, but it’s something to try to keep in mind as you explore ideas.\n\n"
    },
    {
      "time": " 29.May.2009 7.33pm",
      "content": "Two ideas...\n\n ![](http://web.archive.org/web/20090619091754im_/http:/typophile.com/files/full_size-b_4290_3907.png)\n  \n\n ![](http://web.archive.org/web/20090619091754im_/http:/typophile.com/files/full_size-b_42902_4204.png)\n\n"
    },
    {
      "time": " 29.May.2009 8.15pm",
      "content": "That first one is better! For compositional balance, try moving the mark to the left side, maybe with an orange horizontal line all the way across that suggests a countertop (which would help the idea that this is one of the staff).\n\n"
    },
    {
      "time": " 30.May.2009 3.49am",
      "content": "Thank you!\n\nThis advice is great... I love the second typeface, can I ask what that is?\n\nI really like seeing different versions of the design, thank you for doing this. I also love the purple lettering. I am going to work on emphasising the ’employee’ theme and post some revisions here.\n\nThanks again, this is great for me.\n\n:)\n\n"
    },
    {
      "time": " 30.May.2009 6.51am",
      "content": "One question? What’s with that dust/scratch/enter-your-own-preferred-word on kid’s chest?\n\n(question is rethorical)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 30.May.2009 8.33am",
      "content": "Font in second example is [Chalet by House Industries](http://web.archive.org/web/20090619091754/http:/www.houseind.com/fonts/chalet)\n\nSpecifically:  \nNew York 1980 for “J”  \nNew York 1970 for “ust for fun”  \nLondon 1970 for “the party store”\n\n"
    },
    {
      "time": " 2.Jun.2009 2.28am",
      "content": "Thanks\n\nI am going to make some alterations and repost. I think I am going to stick with the ’employee’ concept, but I evidently need to make that clearer, and shy away from too ’kids’ or girly I think.\n\nI’m thinking of making the cap more ’service’ like, and perhaps using a small square to represent a name badge. I will also fiddle around with some counter top lines!\n\nAny other ideas to enhance the look of the character as a member of staff appreciated!\n\nThank you.\n\n"
    },
    {
      "time": " 2.Jun.2009 2.51pm",
      "content": "Hello\n\nHere is a slightly altered version.. I haven’t changed the typeface \\*yet\\* as I haven’t found a copy of that above or a suitable alternative.. anybody have any thoughts on the revised character?\n\n ![](http://web.archive.org/web/20090619091754im_/http:/typophile.com/files/full_size-c_5345.gif)\n\n"
    },
    {
      "time": " 2.Jun.2009 3.47pm",
      "content": "hmmm, what’s the target audience for the store? when i think fancy dress I think more mature people looking at having some fun. not kids.\n\nas for the new version I don’t think the ’cape’ - if that’s what it is - reads very well\n\nthat said, I do like the flexibility of the concept ... character in different outfits.\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090619091754/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 2.Jun.2009 4.33pm",
      "content": "I’m not convinced about this. The colours are fun but I think it should work in one colour too, so perhaps it’d be best to start with a solid concept in black and white before adding the sparkle.  \nA couple of ideas: have the letters of the text somehow suggesting fancy dress. You could put different kinds of costume on different letters...I’m thinking horns, antenna, flares, wigs and ra-ra skirts. That would be pretty hard to draw onto a font successfully but could look totally unique. Or use letters from different fonts, in different colours e.g. a horror font dripping red blood for one letter, a fuzzy bee in yellow and black for another letter, put them all together and you don’t need a separate icon.  \nOr, since it’s a place for party outfits, I’m thinking a set of people in silhouette having fun in different costumes, kids and adults, monsters and vampires, dancing or jumping. Then have the text below.  \nTo me, the one person in the logo looks a bit lonely...balloons and a smile don’t quite make a party.  \nSorry, I don’t like the type at all, I’d find something much more dynamic and properly spaced. I think you’re on the right track with the round terminals but there are plenty of better alternatives out there.  \nHope that’s helpful :)\n\n"
    },
    {
      "time": " 2.Jun.2009 8.41pm",
      "content": "I really prefer the original character. I realize I was the one that suggested more distinct colors but IMO the new colors do not harmonize as well with the text. Also I liked the the symmetry of the original character.\n\nRegarding the type. I haven’t found a proper alternative to Chalet but I’m sure you have a bunch of other fonts on your computer that would work. Otherwise there’s always [www.dafont.com](http://web.archive.org/web/20090619091754/http:/www.dafont.com/ \"www.dafont.com\")\n\n"
    },
    {
      "time": " 3.Jun.2009 1.14pm",
      "content": "Just want to add the “s” in “just” looks really bothersome. It looks like a “u” collapsed side way. I would also get rid of the smile...I can hardly tell it’s there & I don’t think it enhances the logo much.\n\n"
    },
    {
      "time": " 16.Jun.2009 1.13pm",
      "content": "I completely agree with jakes.\n\n—  \n\\\\ [FrozenAgain](http://web.archive.org/web/20090619091754/http:/frozenagain.com/) || [deviantART](http://web.archive.org/web/20090619091754/http:/frozenpandaman.deviantart.com/) //\n\n"
    }
  ]
}
