{
  "id": "58556",
  "title": "Letraset Puzzle",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I was down memory lane earlier looking at those old Letraset catalogues that showcased that company’s transfer lettering. What font were they using for their own logo? I suspect it’s maybe just a slightly customized Helvetica but would like to know for sure.\n\n| Attachment | Size |\n| --- | --- |\n| [Let\\_01.jpg](http://web.archive.org/web/20090606151104/http:/typophile.com/files/Let_01.jpg) | 396.77 KB |\n\n",
  "author": "<a href=\"/web/20090606151104/http://typophile.com/user/45022\" title=\"View user profile.\">chris_longley</a>",
  "time": "<br>",
  "uid": "45022",
  "comments": [
    {
      "time": " 31.May.2009 8.26am",
      "content": "Looking back an a 1985 film type catalog, this looks to me like Helvetica Bold. I admit others eyes are sharper for fine details, but I couldn’t tell the difference between their logo lettering and that typeface.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 31.May.2009 2.40pm",
      "content": "On a letter ’e’ in Helvetica the terminals are flat, on the Letraset ’e’ they’re at a slight angle, the same with the terminala on the letter ’a’ and ’s’.\n\nIt’s the same kind of small difference you see between some letters in Arial v Helvetica, but the logo isn’t Arial (that has a far different letter ’t’)\n\n"
    },
    {
      "time": " 31.May.2009 3.10pm",
      "content": "Arial wasn’t even born when this logo was made.\n\n"
    },
    {
      "time": " 31.May.2009 4.28pm",
      "content": "That’s also another reason I ruled Arial out. I hate Arial\n\n"
    },
    {
      "time": " 31.May.2009 4.29pm",
      "content": "That’s also another reason I ruled Arial out. I hate Arial\n\nOops excuse double post\n\n"
    },
    {
      "time": " 31.May.2009 4.36pm",
      "content": "This is the old display version of Helvetica, derived from the larger sizes of the original metal foundry type. Most digital Helveticas are descended from Linotype’s version, which was designed for 18-point and smaller (machine setting). URW’s Nimbus Sans Bold D (D=display) is about as close as you can get in a digital font.\n\n[http://www.urw.de/cgi-bin1/dalcgi/source/schnellsuche.htd?searchchar=nim...](http://web.archive.org/web/20090606151104/http:/www.urw.de/cgi-bin1/dalcgi/source/schnellsuche.htd?searchchar=nimbus+sans \"http://www.urw.de/cgi-bin1/dalcgi/source/schnellsuche.htd?searchchar=nimbus+sans\")\n\n"
    },
    {
      "time": " 1.Jun.2009 6.29am",
      "content": "Thanks Mark\n\n"
    },
    {
      "time": " 2.Jun.2009 7.47am",
      "content": "Mark, I had a good look at Nimbus and can’t see a case where the terminals of the ’s’, ’a’ and ’e’ match the Letraset logo. Earlier I asked over at WTF and was referred back to your answer. What I don’t want to do is make a big deal of this, because it isn’t. I just want to sate my curiosity\n\n"
    },
    {
      "time": " 2.Jun.2009 10.17am",
      "content": "I did say, “close as you can get in a digital font”. It’s quite possible that Letraset altered it somewhat when they did their “cut” of Helvetica for transfer lettering. However, they credit the source as Haas. Looking at an old Letraset catalog, the “e” in their Helvetica does have that slight tilt, whereas the “e” in the Helvetica shown in a metal foundry type catalog has it perfectly horizontal, or nearly so. While Nimbus Sans Bold D is an accurate digital version of the original Haas foundry cut, it looks like the Letraset “cut” of Helvetica may be a lost typeface.\n\n"
    },
    {
      "time": " 2.Jun.2009 11.39am",
      "content": "Looks that way, thanks Mark.\n\n"
    }
  ]
}
