{
  "id": "58554",
  "title": "Hinting service",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I don't have the time right now to TrueType hint my typeface, so I was thinking of a hinting service that can do this for me. I have found a few companies that offer TT hinting, but I have no idea what the normal fee for such a job is. So that's why I'd like to know which companies do you recommend and what do they normaly charge for let's say: a sans serif typeface that need TT hints from 9-24 points?\n\nI also like to know if they want the right to sell your font as it was their own after they did the hinting for me, cause I want to keep the right to whom I sell the font to.\n\nThanks in advance!\n\n",
  "author": "Peter van der Kamp",
  "time": "30 May 2009 — 11:47am",
  "uid": "44989",
  "comments": [
    {
      "time": "30 May 2009 — 9:50pm",
      "content": "I expect price also depends partly on what level of hinting you want, and whether for ClearType, GDI greyscale, or both. Character set (number of glyphs) is also a factor.\n\nIt sounds like you're talking about delta hints specifically when you mention 9-24 points. BTW, \"points\" are not the relevant unit as they are relative: pixels per em is the unit in question. 9 pt on Windows = 12 pt on Mac = 12 ppem.\n\nPaying somebody to do hinting for you is quite separate from them getting rights to sell your font(s). However, you might get a discount or even free hinting in exchange for non-exclusive resale rights or something....\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "31 May 2009 — 6:58am",
      "content": "I could have better said TT hinting plus 12-32 PPM delta hints, I just want to make an example, not go into to much details.  \nLet's just say I want TT hints for 256 glyps without anything fancy.  \nYou could also make your own example, I just want to know how high these job fees can be and which companies offer good deals.\n\n"
    },
    {
      "time": "31 May 2009 — 2:01pm",
      "content": "A quote i received 18 months ago for delta hinting an original typeface design which included Latin (western and Central Europe, no vietnamese), Cyrillic and Greek, so the type would function well in small sizes on screen was in the $6000-$8000 range. You've got to figure $100-$250 per hour for this sort of font engineering. Hobbyists beware!\n\n"
    },
    {
      "time": "31 May 2009 — 2:32pm",
      "content": "That must have been allot of glyphs ;)  \nSo Terminaldesign does TT hinting and delta hinting? How much would you estimate TT hint (plus delta hinting) a simple geometric sans serif typeface with 256 glyphs? Just a range, it don't have to be precise.\n\n"
    },
    {
      "time": "31 May 2009 — 5:03pm",
      "content": "If anybody thinks that TT hinting is overpriced then they don't really appreciate the work involved. I'm in the middle of hinting a Latin 1 + 2 sans with a single pixel weight up to 40ppm and it is painfully slow!\n\nMalcolm\n\n"
    },
    {
      "time": "31 May 2009 — 6:41pm",
      "content": "I do not generally do this work, the quote I received was from one of my colleagues. You can inquire at Monotype, and Ascender, they are two developers who do this sort of thing. There are many independent designers who do this as well, but I don't think many take on much outside work due to the fact that few want to pay for the service. The free Microsoft web fonts did a great deal of harm when it comes to pricing this sort of work.\n\nTo put it another way; TT hinting makes type design appear to be the most non-tedious work on the planet!\n\n"
    },
    {
      "time": "31 May 2009 — 6:44pm",
      "content": "To put it yet another way: 15-30 minutes per glyph @ (and I'm being generous here) $70-$250 per hour.\n\n"
    },
    {
      "time": "1 Jun 2009 — 2:01am",
      "content": "You could try Dalton Maag in London. I think they have done some good hinting work and have some ex-Microsoft engineers.\n\n"
    },
    {
      "time": "1 Jun 2009 — 2:55am",
      "content": "Yea I know how tedious it can be! I'm not a pro at it and I know there are plenty of people out there who can do it better and faster than me, that's why I want to outsource it, so I will have time to do what I like most: designing! ;)  \nBut considering the costs, this is not something I can do for every typeface.  \nMonotype and Ascender must do a good job I guess. Dalton Maag looks interesting too.  \nIf anyone else knows of companies who offer this service please post!\n\n"
    },
    {
      "time": "1 Jun 2009 — 7:09am",
      "content": "Hello Peter, I am part of the team here at Ascender who does the specifying and pricing of hinting work. I am glad to discuss this with you at your convenience. As Thomas specified above several factors come into play when quoting on work like this.\n\n"
    },
    {
      "time": "1 Jun 2009 — 1:08pm",
      "content": "Hi Brian, thanks for the offer. I'm still orientating though. It could take another year before I will actualy do this and have a budget set aside.  \nI will contact you when the time is their to discuss what the options are.\n\n"
    },
    {
      "time": "4 Jun 2009 — 5:51am",
      "content": "FontWerk is experienced in TT hinting for more than 8 years.\n\nI recommend to look not only on the price for TT hinting.\n\n(1) Look as well at the data formats you get after TT hinting.  \nAll the hinting stuff made by FontWerk is based on FontLab. You get not only a hinted ttf file, but also the FontLab-internal vfb-file for further work (additional characters in the future).\n\n(2) Look as well at the hinting level you really need.  \nGood hinting options in the font file may produce sufficient screen quality by autohinting a Sans Serif typeface.  \nA good screen quality you may get with a manually basic TT hinting with no deltas. So the price for basic hinting does not depend on the point sizes but on the number of glyphs in the font.  \nOnly if you need excellent screen quality delta hints are necessary. Delta hinting takes a lot of time because it is manually work on each glyph in each point size.  \nSo, depending on the quality level it takes me between 2 hours and 2 weeks working time to optimize screen quality for TTFs with full Latin character set.  \n(3) Look at price-performance ratio.\n\nIf you send sample font to [Monibart@fontwerk.de](mailto:Monibart@fontwerk.de) you will get a detailed TT hinting offer asap. Please be sure, that after finishing the hinting job all your font related data will be deleted from all FontWerk disks.\n\nRegards,\n\nDH\n\n"
    },
    {
      "time": "4 Jun 2009 — 6:53am",
      "content": "Yea I will definitely need the vfb-file. However they may keep the font files if we agree that they may sell the font against royalties.  \nDH, do you work at or own Fontwerk? I looked at the site [http://www.fontwerk.de](http://web.archive.org/web/20150313163735/http:/www.fontwerk.de/ \"http://www.fontwerk.de\") but I get allot of \"content/image not available\"(red x) on the site. Will the site be available in english?\n\nI will consider Fontwerk for TT hinting, Thanks DH.\n\n"
    },
    {
      "time": "11 Jun 2009 — 11:39am",
      "content": "FontWerk is a German company and I have been working with Monika Bartels - the owner of FontWerk on hinting stuff for several years and they did a great job.\n\nRegards,\n\nDH\n\n"
    }
  ]
}
