{
  "id": "58567",
  "title": "The oft-used square glyph at the end of articles?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been catching up on some typography, but one thing has eluded me; what is the glyph a lot of magazines tend to end their articles with?\n\nMost tend to use a square, while some spruce it up with their own inventions, but from a typographer's point of view, what exactly are they? A quirky idea or an ancient typographic convention?\n\n",
  "author": "Kiwi",
  "time": "31 May 2009 — 11:15am",
  "uid": "44941",
  "comments": [
    {
      "time": "31 May 2009 — 11:38am",
      "content": "FWIW, our publishing company calls them \"end bugs.\" We use everything from a simple square to a miniature version of the magazine's or client's logo.\n\n"
    },
    {
      "time": "31 May 2009 — 12:57pm",
      "content": "It seems as if they have been used at least since the late 1800's. I would guess that their origins go back much further ...\n\n[http://en.wiktionary.org/wiki/end\\_mark](http://web.archive.org/web/20150215224313/http:/en.wiktionary.org/wiki/end_mark \"http://en.wiktionary.org/wiki/end\\_mark\")\n\n"
    },
    {
      "time": "31 May 2009 — 1:56pm",
      "content": "- 30 -\n\n"
    },
    {
      "time": "1 Jun 2009 — 5:33am",
      "content": "James -- You're going to confuse the cubs with your terse, old-time copy desk lingo. ;-)\n\n"
    },
    {
      "time": "1 Jun 2009 — 6:49am",
      "content": "Wikipedia calls it a tombstone.\n\nIn mathematics, it's known as a QED symbol or halmos (after Paul Halmos, who popularised its use to mark the end of a proof). Some authors use a different mark for proofs by contadiction (I personally draw a lightning bolt, but a filled square is probably more common).\n\n"
    },
    {
      "time": "1 Jun 2009 — 7:09am",
      "content": "<cite>Wikipedia calls it a tombstone.</cite>\n\nI doubt Wikipedia ever worked in editorial design.\n\nI worked in magazines for years, and never heard it called a tombstone. End mark was the term most commonly heard, that and occasionally \"bug\"\n\nYes Kent, I think I have confused the cubs by using the copy editors mark that indicates \"the end\". But I always left it in the ms. when I sent the spec to the type shop, and they always knew to replace it with our end mark\n\n"
    },
    {
      "time": "2 Jun 2009 — 5:10am",
      "content": "Our typesetters just call it \"endbox\" apparently (a bit pedestrian, but I suspect this is more like coding than a name to get bandied about in the workplace...)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "6 Jul 2009 — 6:16am",
      "content": "Regarding the term \"tombstone\":\n\n\"Tombstone\" in letterpress news and magazine work was also used as a term for an advertisement that appeared regularly in issue after issue, with no changes. The form would be put away as each issue was killed, and hauled out for the next. After much repeated use the type might be re-set, but exactly as it looked earlier.\n\npowers\n\n"
    }
  ]
}
