{
  "id": "58579",
  "title": "Deco fonts?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I can't seem to find a good match for these deco fonts. In the \"NORD EXPRES\" graphic there are two separate typefaces (probably originally customized) and in the \"DREMIE\" graphic, that typeface is actually \"Dremie\" from Flat-It Foundry but I need a very similar one, and not Angie Black Open (too flare-serif). Of course, everyone's help is much appreciated :)\n\nsdaris\n\n ![](http://web.archive.org/web/20130820103134im_/http:/typophile.com/files/cassandre-nord-express_4372.gif)\n\n ![](http://web.archive.org/web/20130820103134im_/http:/typophile.com/files/dremie_4946.png)\n\n| Attachment | Size |\n| --- | --- |\n| [cassandre-nord-express.gif](http://web.archive.org/web/20130820103134/http:/typophile.com/files/cassandre-nord-express_0.gif) | 6.2 KB |\n\n",
  "author": "sdaris",
  "time": "31 May 2009 — 8:32pm",
  "uid": "45041",
  "comments": [
    {
      "time": "31 May 2009 — 9:11pm",
      "content": "Have you looked at Nick Curtis's fonts? -- he seems to specialize in the Deco era. See [Rialto](http://web.archive.org/web/20130820103134/http:/www.moorstation.org/typoasis/designers/curtis/pages/q_r.htm), which has serifs, and [Park Lane](http://web.archive.org/web/20130820103134/http:/www.moorstation.org/typoasis/designers/curtis/pages/p.htm), which doesn't. The collection at TypOasis are his early free fonts.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "1 Jun 2009 — 12:12am",
      "content": "Thanks for the Nick Curtis and TypOasis leads - very nice. I'm really curious about the \"Nord Expres\" fonts though - that big R is distinctive as well as the flat top/sharp bottom \"N\". And the last S in \"Expres\" is special too. I suppose I could customize Futura for the \"Expres\" type, but I'd really like to find the perfect typeface matching \"Nord\". Vonnes Black Extended is similar, but not enough. And WhatTheFont online NEVER finds matches! Any help appreciated.\n\n"
    },
    {
      "time": "1 Jun 2009 — 8:09am",
      "content": "That NORD EXPRES lettering looks hand-drawn (the E's in EXPRES don't even match).In NORD, the O is the smallest letter, and the N has an odd mix of flat and pointed vertices, and the R and D look as if they have been squashed. I can't think of any font with such features, but maybe someone else can.\n\n- Mike Yanega\n\n"
    }
  ]
}
