{
  "id": "58587",
  "title": "Textured type, stamp, letterpess photoshop tutorial",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "Hello all. I always love authentic letterpress type type. You can always tell when this has been achieved and quite often it displays a lovely texturised quality. So today, im gonna try and show how an effect like this can be achieved using photoshop. This tutorial is being done in Adobe Creative Suite CS as this is all I have at home, but all the tools are pretty much in the same place in CS3 and 4 I think.\n\nStep 1.  \nfirstly create the type you would like to texturise. I have created this in illustrator and then copied it across to photoshop. You will need to use a font with a lot of weight to it. It is also good to use quite a classic font. A heavy serif font is quite nice. I have used helvetica neue condensed black. Anyway - plonk it into photoshop and we’re ready to go! Make the document greyscale colour mode as well by going Image\\>Mode\\>Greyscale. This just suits the purpose for what we are doing and you can always add colour later if desired.\n\n ![](http://web.archive.org/web/20150311184238im_/http:/typophile.com/files/freddesign_1_3987.jpg)\n\nStep 2.  \nOK so we have our plain black text in photoshop. Now we want to start roughing it up a bit. We are going to use a set readymade photoshop tutorial to begin with to add some roughness to the edges. Go to Filter \\> Artistic \\> Paint Daubs. Set the brus size at 3, the sharpness at 3, and the brush type at simple. As you can see this has just taken some of the perfection from around the edges.\n\n ![](http://web.archive.org/web/20150311184238im_/http:/typophile.com/files/freddesign_2_4956.jpg)\n\nStep 3.  \nWe are now going to add some texture to the whole of the type, not just the edges. Firstly, create a new layer. Now go to filter \\> render \\> clouds. A grey kind of cloud effect should fill the screen as your top layer. This just offers us some different tones to start playing with.\n\n ![](http://web.archive.org/web/20150311184238im_/http:/typophile.com/files/freddesign_3_3927.jpg)\n\nIts still quite light though, so lets darken it up a bit. Go to image \\> adjust \\> brightness contrast. I have taken the brightness down to about 70 as I want wuite a strong black. Now lets add some grainy texture. Go to filter \\> noise \\> add noise. I have et my amount to 40 and kept the distribution set to 40. Press ok, and you will be able to see the cloudy effect now has a grainy dark quality to it. But...its still just filling the whole screen. On the layer palette, select the layer as screen and you will now see the effect is only visible over they type. Already we have a really nice textury stampy letter effect.\n\n ![](http://web.archive.org/web/20150311184238im_/http:/typophile.com/files/freddesign_4_5557.jpg)\n\nStep 4.  \nWith me so far? good. Don’t worry there is nt too much more now. Lets flatten our image before we go any further. On the layer pallette, click on the options arrow in the top right hand corner and select flatten image. Now we simply have to add some finishing touches. At this stage I always like to darken the image again and add some more contrast to suit my taste. To do this simply select, image \\> adjust \\> brightness contrast again but you might not need to. Finally, it is time t just go over the edges a bit more. This I do by hand, using a textured brush on the eraser tool. Set it to about 90% opacity and carefully do over some of the edges to add a bit more texture. This is most effective on the corners. Be careful not to overdo it though as subtelty is the key here.\n\n ![](http://web.archive.org/web/20150311184238im_/http:/typophile.com/files/freddesign_5_3550.jpg)\n\nAnd thats all there is to it! You have a nice textury effect. You can now add colour to it, place it over images, invert it etc. It can sometimes be that little bit of detail you need. Below you can see the finished version and also a version where I have inverted it to white and overlayed it on an image. I hope you found this tutorial useful. Any questions or feedback, I would love to hear!  \nall the best and please leave a comment. you can read the original article on this at [http://www.freddesign.co.uk/](http://web.archive.org/web/20150311184238/http:/www.freddesign.co.uk/ \"http://www.freddesign.co.uk/\")\n\n ![](http://web.archive.org/web/20150311184238im_/http:/typophile.com/files/freddesign_6_6097.jpg)\n\n ![](http://web.archive.org/web/20150311184238im_/http:/typophile.com/files/freddesign_7_3592.jpg)\n\n",
  "author": "chasteauneuf",
  "time": "1 Jun 2009 — 3:56am",
  "uid": "29870",
  "comments": [
    {
      "time": "1 Jun 2009 — 11:31am",
      "content": "Not bad for a digital facsimile. Thanks for sharing!\n\n"
    },
    {
      "time": "3 Jun 2009 — 1:13am",
      "content": "thanks aluminium.  \nnever beat the real deal tho right!\n\n"
    },
    {
      "time": "9 Mar 2011 — 10:16am",
      "content": "it's so simple techniques, but i think this textured type only suitable for black and white images\n\n"
    }
  ]
}
