{
  "id": "58607",
  "title": "Nara, \"Shall I compare thee to a Summer's day?\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There are times when you just cast away all reason, and knowledge and just leap with your heart.\n\nI just fell so madly in love with Nara at first sight that I can't begin to express it!\n\nChrisL\n\n",
  "author": "dezcom",
  "time": "1 Jun 2009 — 12:52pm",
  "uid": "3135",
  "comments": [
    {
      "time": "1 Jun 2009 — 12:54pm",
      "content": "I second that, Chris! Specially the italic versions.\n\n"
    },
    {
      "time": "1 Jun 2009 — 1:10pm",
      "content": "I forgot the link:\n\n[http://www.typotheque.com/fonts/nara](http://web.archive.org/web/20131018004529/http:/www.typotheque.com/fonts/nara \"http://www.typotheque.com/fonts/nara\")\n\nChrisL\n\n"
    },
    {
      "time": "1 Jun 2009 — 1:48pm",
      "content": "I should add that seeing Nara for the first time is like having Halle Berry smile at you :-)\n\nChrisL\n\n"
    },
    {
      "time": "1 Jun 2009 — 6:50pm",
      "content": "But, thankfully, unlike having to watch _Catwoman._\n\n"
    },
    {
      "time": "1 Jun 2009 — 9:01pm",
      "content": "I never saw it, John :-)\n\nChrisL\n\n"
    },
    {
      "time": "1 Jun 2009 — 11:25pm",
      "content": "All the beautiful, desirable, very fit women will smile at you now that you have a presence at MyFonts! :)\n\n"
    },
    {
      "time": "2 Jun 2009 — 5:24am",
      "content": "\\> There are times when you just cast away all reason, and knowledge and just leap with your heart.\n\nI'll bet you say that to all the cute fonts. Sure, you'll use her a few times, and then some other font will come along and you will forget all about poor Nara.\n\n"
    },
    {
      "time": "2 Jun 2009 — 7:30am",
      "content": "LOL!!! Both of you made my day!\n\nChrisL\n\n"
    },
    {
      "time": "2 Jun 2009 — 11:18am",
      "content": "No worries about Nara, she is no little teenager. She turned 20 this year.\n\nThis is a fact, and quite some story. Nara was designed as a student project of Andrej Krátky at the Prague Academy in the late 1980s. As you can imagine, it wasn't very easy to digitise fonts back than, certainly not in communist Czechoslovakia. Andrej drew all letters 20cm large, and all points coordinates had to be measured on a milimeter paper, and [typed into](http://web.archive.org/web/20131018004529/http:/www.typotheque.com/site/font_in_development.php?id=43) METAFONT which than generated the outlines. He abandoned the project before Fontographer became available.\n\nFor the past 2-3 years I worked closely with Andrej and Nikola Djurek to complete the typeface, and now more than 20 years after first sketches were completed, we can present it to public.\n\n"
    },
    {
      "time": "2 Jun 2009 — 2:06pm",
      "content": "Thank you, Peter Andrej and Nikola Djurek for the hard work and the final product!\n\nChrisL\n\n"
    },
    {
      "time": "2 Jun 2009 — 2:40pm",
      "content": "Thank you all for your kind words. I have just registered here to say I really appreciate your comments, ChrisL.  \nThank you again, Peter and Nikola, for the perfect collaboration.\n\nAndrej Krátky\n\n"
    },
    {
      "time": "2 Jun 2009 — 4:58pm",
      "content": "Andrej,  \nThanks for coming; stay and join us and tell us about your work. I hope you have plenty more to release!\n\nChrisL\n\n"
    }
  ]
}
