{
  "id": "58603",
  "title": "Portable Toilet Logo...",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Yup, I said it – Portable toilet logo. The name of the company is UPTOWN RESTROOMS and they specialize in clean, spacious and pleasantly smelling portable toilets for weddings and corporate events. The logo should appeal to women as the bathrooms are mostly for them (hey guys can go anywhere). I’m rebranding them and would love some feedback as I’ll be presenting the client in a couple of days. I’ve included 2 of my directions below. Thanks in advance.\n\nMy key words for the project are…\n\nhigh-end  \nexclusive  \nclean  \nfeminine\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Bv01_3475.jpg)\n  \n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Dv01_6384.jpg)\n\n",
  "author": "<a href=\"/web/20090728072125/http://typophile.com/user/45055\" title=\"View user profile.\">MrBulbous</a>",
  "time": "<br>",
  "uid": "45055",
  "comments": [
    {
      "time": " 1.Jun.2009 12.20pm",
      "content": "Not sure about appealing to women, but I’d go (hehehe) with second option.\n\n"
    },
    {
      "time": " 1.Jun.2009 12.53pm",
      "content": "I like the first one. Maybe if the word up was a little smaller, pushed up against the word town, and a different color.\n\nPerhaps the word restrooms should be smaller and a very, very simple font, as you already have two different fonts. Maybe a small serif?\n\n"
    },
    {
      "time": " 1.Jun.2009 1.23pm",
      "content": "Woman here :)  \nMy initial reaction was that the second one is trying too hard to be classy. And old-style: I personally always find it a bit humorous if establishments try to look like they’ve been around forever, use a font reminiscent of 2 centuries ago, & even put the “since whenever” line in their logo – and then they’ve been around for what, 3 years? Seriously.\n\nThat said, I think the first one has good potential. It looks a bit more unusual but pleasantly surprising/surprised, especially with that Baskervillian high “p” – so nicely matching a client’s reaction upon visiting/using a portable toilet that’s actually nice :-). “Fresh” is a good adjective.  \nHell, you might even try a heavy sans for the TOWN part. Or maybe not.  \nMost of all, I’m not sure about the “restrooms” either. It’s too close to the “up” but not quite the same. I might try a wide-ish sans (think Gotham, or maybe something more classicist) in tracked-out all caps, not too large, not too heavy.\n\n"
    },
    {
      "time": " 1.Jun.2009 2.00pm",
      "content": "First one is better\n\n"
    },
    {
      "time": " 1.Jun.2009 2.06pm",
      "content": "Upscale portapotties! That’s a rather brilliant concept.\n\nI like the layout of the first one.\n\nI also agree that one should avoid any ’since XX’ unless we’re talking at least 3 decades or so.\n\n"
    },
    {
      "time": " 1.Jun.2009 2.36pm",
      "content": "Thanks you all for your input. The challenge for me is making the logo “feminine” without excluding the masculine completely (if that makes any sense).\n\naltaira–thanks for your comments regarding the “Filosifia” direction. I’ve had moments when I’ve found it’s classic look appropriate and others where I’ve question it completely. I think you put words to my negative gut feelings.\n\nHere’s some revisions based on your comments. I’m not satisfied with it the way the u and the p are disconnected but look as though they should be connected. As a purist, modifying it to allow them to connect is painful. Any suggestions on how to resolve that issue? Is it even an issue?\n\nI’m also showing another variation of the same logo just because I think it might also work. Once again, thanks for your time and suggestions.\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Bv02_4361.jpg)\n\n"
    },
    {
      "time": " 1.Jun.2009 6.08pm",
      "content": "The sans is a little stark. Maybe a humanist sans?\n\n"
    },
    {
      "time": " 2.Jun.2009 1.48am",
      "content": "Reposition “RESTROOMS” to align with vertical stem of T. Right now it’s just somewhere an nowhere... Or align it to something else. But it’s definitely better with sans. At least “restrooms”. Not sure about “Town”. Could probably be better as serif. Maybe. Experiment.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": " 2.Jun.2009 1.59am",
      "content": "Try to align ’restrooms’.  \nI find it a bit awkward.  \nSeems to have no connection.\n\nOr strech it out more.  \nNow it wants to align with the ’T’ but just doesn’t.\n\n"
    },
    {
      "time": " 2.Jun.2009 6.57am",
      "content": "I’d keep the ’TOWN’ in the bold serif font, that first one in your recent post looks nicely balanced with ’up’. But I think the Restrooms should be sans and the alignment needs rethinking.  \nIt shouldn’t be too much work to connect u and p, but I don’t feel it’s necesary really.\n\n"
    },
    {
      "time": " 2.Jun.2009 10.59am",
      "content": "Thanks everyone for your comments. I made revisions based on all them. There’s little doubt in my mind which one is the better direction but I’m interested in hearing what others are thinking.\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Bv03-san-01_4648.jpg)\n  \n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Bv03-s-01_6067.jpg)\n\nOn a side note–do you guys when normally present the client 1 logo direction or do you provide 2 and let them choose a direction they like? Also do you present the logo(s) with color studies and applications (call card) all at once or do you show the logo then go back to do color study and applications after they’ve picked a direction?\n\nOnce again, thanks in advance for any and all input you have all been very helpful.\n\n"
    },
    {
      "time": " 2.Jun.2009 12.07pm",
      "content": "Like #2.\n\n"
    },
    {
      "time": " 2.Jun.2009 12.27pm",
      "content": "#2 definitely. I’d give RESTROOMS a bit more breathing space, bring it down to the descender of the p.\n\nI think it’s normally the case that the designer presents two or three concepts and maybe a couple of colourways and see what they like before finalising everything and producing stuff.\n\n"
    },
    {
      "time": " 2.Jun.2009 2.48pm",
      "content": "Ya #2 is the one I think is right too. Thank you both for your feedback.\n\nWith that out of the way I submit for your wonderful insight direction number 2…\n\nOne of the features of these luxury portable toilets is that they feature A/C. Here I’m playing with the a fan/floral symbol in place of the “o”. Does this read clearly? Thoughts? I can’t decide whether I need to be more literal (not my personal preference) with a fan or a flower. Any and all comments are welcome. Thanks once again in advance!\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Ev01-01_6531.jpg)\n\n"
    },
    {
      "time": " 2.Jun.2009 3.50pm",
      "content": "I’d suggest NOT including the A/C fan etc. It’s not necessary and just clouds the main message - classy loos.\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090728072125/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 2.Jun.2009 8.02pm",
      "content": "Negative on the symbol ’O’.\n\nI do like the lowercase “restrooms” though.\n\n"
    },
    {
      "time": " 2.Jun.2009 8.14pm",
      "content": "Thanks Rabbaggy for you input. I’m still undecided on whether I should include the “fan” or not in one of my directions. I had already worked up an alternate direction before reading your comments–I think it works better than the first. It definitely achieves a more even tone. Below is a version set in “The Mix Semi Light”. Hope I’m not being too big a nuisance with all these posting of revisions. I’m grateful for all the insight provided. Thanks!\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Ev01-alt-01_5877.jpg)\n  \n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Ev01-01_6567.jpg)\n\n"
    },
    {
      "time": " 2.Jun.2009 8.45pm",
      "content": "Still like the second version from your 2.Jun.2009 10.59am post.\n\nI understand the desire to add some sort of graphical element but unless you have a brilliant idea I think the text looks great on its own.\n\n"
    },
    {
      "time": " 2.Jun.2009 8.57pm",
      "content": "Actually, I’m set on that one. I actually really hope the client chooses it. In fact, I did a color study and started looking at it in context (posted below). I love that part of the process! I’m trying to flush out a second direction to give them options. I’m wondering though if I should even bother–why just present filler? Anyway, thanks again for your input.\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/trailer-combined-01_3766.jpg)\n\n"
    },
    {
      "time": " 2.Jun.2009 9.27pm",
      "content": "Sounds good.\n\nCan we get a closer look at the colorized version?\n\n"
    },
    {
      "time": " 2.Jun.2009 9.28pm",
      "content": "you mean why present shit?\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090728072125/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 2.Jun.2009 10.11pm",
      "content": "Ratbaggy—Come on, I didn’t think they were that bad :) Thanks anyway for your honesty.\n\nAs for the color version. This is by no means final, but the color combination shown above is this…\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Bv03-clr-01_4166.jpg)\n\n"
    },
    {
      "time": " 2.Jun.2009 11.07pm",
      "content": "oh snap! didn’t mean it like that at all.  \nno SMEAR intended.\n\n:)\n\nSeriously though ... I’d be wary about including brown in a restroom logo.\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090728072125/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 2.Jun.2009 11.26pm",
      "content": "Yeah, that up is looking a little poopy.\n\n"
    },
    {
      "time": " 2.Jun.2009 11.59pm",
      "content": "Maybe it’s just me, but I really don’t like the script in a given context. It just seems to give the wrong (artsy-fartsy if you pardon my French) impression. Perhaps a lighter, non-oblique weight of TOWN type for UP would be more fitting.\n\nAlso, I agree with other comments suggesting to align Restrooms to the left of T and the bottom of p’s descender.\n\n"
    },
    {
      "time": " 3.Jun.2009 6.29am",
      "content": "I like the latest one, but I’d drop the restroom a bit, align it with the p’s descender, as suggested previously. Also, should the up and restroom be a bit grayer, now they look a bit too brown for the context, like Paul Ducco wrote.\n\nIf you’re going to show the fan one and its friends, please change the restooms to restrooms ;^)\n\n"
    },
    {
      "time": " 3.Jun.2009 7.06am",
      "content": "The connection between u and p needs redrawing - it breaks too suddenly from curved to straight.\n\n"
    },
    {
      "time": " 3.Jun.2009 11.29am",
      "content": "\\*Ratbaggy – (delayed reaction-\\>) Nice One!\n\n\\*ToAll – Brown? What was I thinking? Might as well just work a roll of toilet paper in to the logo :)\n\nI’m attaching some versions with different placements of “RESTROOMS”. What do you think? I’ve also touched up the curve (very subtly) of the u + p connection. Thanks once again.\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Bv04-01_5469.jpg)\n\n"
    },
    {
      "time": " 3.Jun.2009 12.25pm",
      "content": "Definitely b. I think the weight of the sans could be heavier - maybe so it relates to the thins of the italic.\n\nu\\_p connection looks better!\n\n"
    },
    {
      "time": " 3.Jun.2009 2.25pm",
      "content": "Agree about the u-p connection. Much better now. Could they be slightly tighter?\n\nI tried setting ’town’ in Filosofia Unicase (since you mentioned it earlier). I won’t post it, but maybe you could have a look. I think the lowercase ’n’ looks interesting. Dare I say it might appeal to the female audience?\n\nCheers,  \nRoss\n\n"
    },
    {
      "time": " 3.Jun.2009 3.11pm",
      "content": "Thanks guys.\n\n\\*rlynch–wonderful suggestion about looking at Filosofia again. The top one is the original (with restrooms above the p descender (to me it feels more comfortable there) and the bottom two are variations using Filosofia.\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Dv01-01_4710.jpg)\n\nThese are a possible second direction. Thanks guys. You have all been so helpful.\n\n ![](http://web.archive.org/web/20090728072125im_/http:/typophile.com/files/UPTOWN-Dv01-02_6504.jpg)\n\n"
    },
    {
      "time": " 16.Jun.2009 4.23am",
      "content": "Maybe you can add a little more graphic on the logo. You can include there a silhouette of a lady.. It’s up to you. It should be appealing, but I know a portable toilet is important even without a beautiful logo. {link removed by moderator}\n\n"
    }
  ]
}
