{
  "id": "58619",
  "title": "Populist Demagoguery or Brilliant Branding?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "US congressman Mike Honda (D), whose constituents are largely Silicon Valley folks, is having his website designed through a crowdsourcing “contest” site — but the BEST part? He’s having his constituents vote to decide the winning entry...\n\n[http://www.crowdspring.com/projects/website\\_design/small\\_website\\_uncoded...](http://web.archive.org/web/20090605100601/http:/www.crowdspring.com/projects/website_design/small_website_uncoded/congressman_seeks_innovative_redesign_of_website/details \"http://www.crowdspring.com/projects/website\\_design/small\\_website\\_uncoded/congressman\\_seeks\\_innovative\\_redesign\\_of\\_website/details\")\n\nDesign demagoguery?\n\nA recipe for ensuring a craptastic mediocrity of a site?\n\nOr a clever way of creating authentic buy-in, social engagement, constituency-building, & innovating the “Mike Honda” brand? Can’t wait to see what bedazzles us from this...\n\n",
  "author": "<a href=\"/web/20090605100601/http://www.typophile.com/user/44851\" title=\"View user profile.\">designpuck</a>",
  "time": "<br>",
  "uid": "44851",
  "comments": [
    {
      "time": " 1.Jun.2009 5.45pm",
      "content": "All he needs is a Tribal council and then he can vote them off the island :-)\n\nChrisL\n\n"
    },
    {
      "time": " 1.Jun.2009 7.28pm",
      "content": "Crowd Spring is a great way to over pay for poor quality. But you get a lot of it. So, yea, it’s like Wal-Mart.\n\n"
    },
    {
      "time": " 1.Jun.2009 7.42pm",
      "content": "“Design demagoguery?”\n\nOf course not. It’s design socialism... nobody gets paid what they are worth, mediocrity rules and the fool gets reelected. Why doesn’t he just keep building lawn mower engines and motorcycles : )\n\nMichael\n\n"
    },
    {
      "time": " 1.Jun.2009 10.29pm",
      "content": "I think he’s just managed to tick off a huge swath of his constituents. How will he display his ignorance of the “working man” next? Visit a farmer’s market and declare Walmart is the only place he’ll shop? Perhaps he’ll go to a music festival and give out thousands of duplicated CDs of the musicians as they’re playing live?\n\n"
    },
    {
      "time": " 2.Jun.2009 8.14am",
      "content": "Now, about those “T” logos...\n\n"
    },
    {
      "time": " 2.Jun.2009 9.05am",
      "content": "“It’s design socialism... nobody gets paid what they are worth, mediocrity rules and the fool gets reelected.”\n\nLol! Looks a lot like democracy and capitalism to me...\n\n"
    },
    {
      "time": " 2.Jun.2009 10.39am",
      "content": "Wrong x-y! In capitalism everyone gets paid too much(and hides their wealth in a Swiss bank account : ) ), planned obsolescence rules and the fool gets thrown out after he gets caught in a scandal.\n\nMichael\n\n"
    },
    {
      "time": " 2.Jun.2009 11.00am",
      "content": "<cite>“How will he display his ignorance of the “working man” next?”</cite>  \nIndeed. I find it pretty scary how he (= his advisors, I guess) seems to see this move as a democratic one, in favor of “transparency” – hello?!  \nMaybe if that is so, he should crowdsource his own job first.\n\n\\*\n\n<cite>“In capitalism everyone gets paid too much”</cite>  \nWow, I must be living in Socialism then. Amazing – I never realized that.  \nNot to deny I have a Swiss bank account…\n\n"
    },
    {
      "time": " 2.Jun.2009 12.31pm",
      "content": "_...he should crowdsource his own job.._\n\nLOL.  \nActually, anyone (well, most citizens) can put their name on the ballot, but it helps to have a lot of money to spend on your campaign, and to represent a political party with a possibility of forming a government. So that severely reduces the size of the crowd to, well, not really a crowd at all.\n\n"
    },
    {
      "time": " 2.Jun.2009 12.34pm",
      "content": "“Wow, I must be living in Socialism then”\n\nNo. In socialism you at least get health care.\n\n"
    },
    {
      "time": " 2.Jun.2009 1.34pm",
      "content": "_Not to deny I have a Swiss bank account…_\n\nLOL\n\n"
    },
    {
      "time": " 2.Jun.2009 1.48pm",
      "content": "“In capitalism everyone gets paid too much”\n\nexcepting the majority of those who <cite>work</cite> for a living.\n\nOh - and it most certainly is not “brilliant branding”.\n\n-=®=-\n\n"
    },
    {
      "time": " 2.Jun.2009 2.11pm",
      "content": "“Not to deny I have a Swiss bank account…”\n\nBest post of the year :-)\n\nChrisL\n\n"
    },
    {
      "time": " 2.Jun.2009 2.24pm",
      "content": "Vee haf ower iz on u Nina undt ur bank acownt : )\n\nMichael\n\n"
    }
  ]
}
