{
  "id": "58613",
  "title": "Dover publications serif font",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Does anybody know the name of the serif font used by Dover Publications (not the font used on their front covers, the one for the main text of the book). It looks like something from the 1960’s, and has nice old style numerals and small caps. I’ve tried Identifont et al. and they suggest faces that are close, but not quite correct (Bodoni Condensed, Century Oldstyle etc.)\n\nI’ve attached a small excerpt from one of their books (sorry for the quality, it’s a scan).\n\n| Attachment | Size |\n| --- | --- |\n| [Screenshot-2.png](http://web.archive.org/web/20090607101825/http:/typophile.com/files/Screenshot-2.png) | 151.96 KB |\n\n",
  "author": "<a href=\"/web/20090607101825/http://typophile.com/user/45065\" title=\"View user profile.\">dpm</a>",
  "time": "<br>",
  "uid": "45065",
  "comments": [
    {
      "time": " 1.Jun.2009 3.30pm",
      "content": "In your sample the word CONTENTS at the top is a different font (the C has 2 serifs). The main text does look like one of the Century’s (there are many if you use Bitstream’s naming). I cannot see the details clearly enough to use the [Serif Font ID Guide](http://web.archive.org/web/20090607101825/http:/www.bowfinprintworks.com/SerifGuide/serifsearch.php), but with the original maybe you can try it and see what comes up.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 1.Jun.2009 3.46pm",
      "content": "It’s [Monotype Modern](http://web.archive.org/web/20090607101825/http:/new.myfonts.com/fonts/linotype/monotype-modern/), the favored font for math and math-heavy books at the time. It’s been largely supplanted by [Computer Modern](http://web.archive.org/web/20090607101825/http:/new.myfonts.com/fonts/linotype/monotype-modern/), the TeX adaptation of the font. Note that the official Monotype digitization is not optically scaled, but the Computer Modern version is.\n\nThis [book](http://web.archive.org/web/20090607101825/http:/books.google.com/books?id=6wSVuWH1PrsC) is about calculus of variations, which I reference extensively in my [thesis](http://web.archive.org/web/20090607101825/http:/levien.com/phd/phd.html) on interpolating splines. I looked at a bunch of references and decided on [Elsgolts](http://web.archive.org/web/20090607101825/http:/www.amazon.com/Differential-Equations-Calculus-Variations-Elsgolts/dp/1410210677) instead, largely because his presentation of the Euler-Poisson equation was much more direct than most. Note also that this is a republication of the original 1952 edition, and Dover, as is typical, reproduced page images rather than retypesetting the text.\n\n@bowfinpw: And yes, the “CONTENTS” is a different font, possibly Baskerville. Also note that the boldface is a not-quite matching font, I think it’s one of the numbered “Monotype Old Style” ones, but I’m not 100% sure.\n\n"
    },
    {
      "time": " 1.Jun.2009 4.20pm",
      "content": "Ah, cool. Thanks for that, Monotype Modern looks to be the correct font! I’m actually wanting to use this font in LaTeX to typeset my thesis in, as I prefer this font to CM. Is the lack of scaling in the Monotype official going to be a killer?\n\n"
    },
    {
      "time": " 1.Jun.2009 4.31pm",
      "content": "Heh, interesting. Yes, the Monotype digital will be impossibly high-contrast (hairline serifs way too thin) at normal text sizes. However, you may not be entirely out of luck. There’s a [second digitization](http://web.archive.org/web/20090607101825/http:/new.myfonts.com/fonts/urw/modern-extended/) that’s quite a bit more robust. You could use this for text and the Monotype for larger settings, and get fake scaling. However, if you have lots of subscripts or other small type mixed in with the main text, I’d personally find the lack of scaling to be disappointing. I expect it from Times, but not from this font.\n\nBest of luck!\n\n"
    },
    {
      "time": " 1.Jun.2009 5.41pm",
      "content": "[Other modern text serifs.](http://web.archive.org/web/20090607101825/http:/www.fontshop.com/fontcase/subclasses/serif_bracketed_modern_text/)\n\n"
    },
    {
      "time": " 2.Jun.2009 2.16am",
      "content": "raph, thanks for that. I will have a lot of subscripts and superscripts, so it looks like using MM is out (I’d rather stick with CM in that case).\n\nStephen Coles, thanks for the link. I’ll take a look at those!\n\n"
    }
  ]
}
