{
  "id": "58617",
  "title": "Confused about LOCL vs. other features",
  "forum": "Build",
  "tags": [

  ],
  "content": "So I have just made my first _locl_ feature (to substitute steeper acutes for Polish) and am very happy this works. However, when I select Polish as a paragraph's language in InDesign, this is also the only OT feature that works. All my existing –language UNspecific– features only work when I select any language _but_ Polish (or Hungarian, which also has a language specific feature). I can't even select a different figure style! I mean I can select it, but it doesn't work. It seems like the language thing obliterates/overrides all other options.\n\nWhat's the deal – am I supposed to specify in the \"general\" features that they are for any language, and not just the DFLT?  \n(Apologies – this does feel like it's probably a rather stupid question…)\n\n",
  "author": "<a href=\"/web/20100203094107/http://typophile.com/user/13487\" title=\"View user profile.\">altaira</a>",
  "time": "<br>",
  "uid": "13487",
  "comments": [
    {
      "time": "",
      "content": "As well as having your {locl} feature, You have to have your language declaration in the very bottom window on the feature section of the OT tab:\n\nlanguagesystem DFLT dflt;  \nlanguagesystem latn dflt;  \nlanguagesystem latn MOL;  \nlanguagesystem latn ROM;  \nlanguagesystem latn AZE;  \nlanguagesystem latn CRT;  \nlanguagesystem latn TRK;\n\n ![](http://web.archive.org/web/20100203094107im_/http:/typophile.com/files/loclfeature_5285.png)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Thank you, Chris! Two InDesign crashes later,\\* it now works just great.\n\n\\* I wish I had refreshed this and seen your image! ;-)\n\n"
    },
    {
      "time": "",
      "content": "I remember a few years ago when Typophile folks helped me through this very thing--and many others!  \nThanks, Karsten, Adam, Mark, John, Thomas, Paul, Randy. and all the others who helped me!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Sometimes I think there's too much to ever get my head round. Mental note to return to this useful thread when I understand a bit more about Opentype. Who would've thought there's so many possibilities?!\n\n"
    }
  ]
}
