{
  "id": "58639",
  "title": "My submission for Goal Logo contest",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm posting this now cos i just made the deadline for entries. Maybe it would have been a better idea to post it earlier so that any of you reading this could also participate in the competition (if you wanted to).\n\nBut oh well, it's too late to do anything about that.\n\nI at least thought it post my submission. What do you think? I kinda feel that the style of it doesn't really suit Goal.com, but i had this idea in my head and I wanted to complete that vision. Also it's kinda rushed because I'm currently hard at work on an essay for school which I probably should be working on instead of writing this!\n\nAny criticisms on what could be better would be much appreciated, for future reference. It's not really that complex but being a newbie it was pretty hard for me to get the G right.\n\n ![](http://web.archive.org/web/20150320002258im_/http:/typophile.com/files/Omar-Ajmal_goal-logo_final_4584.jpg)\n\nAnd I thought it would be nice to post my favourite of all the submissions that I've seen.\n\n ![](http://web.archive.org/web/20150320002258im_/http:/typophile.com/files/image_hjlmaar_s_goal_logo_1_zoom_3790.jpg)\n  \nMade by username: hjlmaar\n\nLink to contest site: [http://www.crowdspring.com/goal](http://web.archive.org/web/20150320002258/http:/www.crowdspring.com/goal \"http://www.crowdspring.com/goal\")\n\n",
  "author": "ormishen",
  "time": "2 Jun 2009 — 9:38am",
  "uid": "34411",
  "comments": [
    {
      "time": "2 Jun 2009 — 10:54am",
      "content": "hi ormishen,\n\nIf you'd like feedback on your design work, it would probably be best to post it without any mention of design contests.\n\nA large contingent of this site's users do not condone doing professional design work for free, and would rather their peers not do so either.\n\nPlease read this for some background: [AIGA stance on spec work.](http://web.archive.org/web/20150320002258/http:/www.aiga.org/content.cfm/position-spec-work)\n\njarrod\n\n"
    },
    {
      "time": "2 Jun 2009 — 12:36pm",
      "content": "Design contests are bad and usually impossible to critique as you're being asked to design sans any real business context.\n\nAvoid crowdspring. It does neither you nor the client any good.\n\n"
    },
    {
      "time": "3 Jun 2009 — 1:24am",
      "content": "I wholeheartedly agree with jarrod and aluminum. The sole purpose of my comment here is to ask you to withdraw your submission.\n\nDesign contests undermine the entire design profession. Companies that sponsor these contests are taking advantage of designers and disrespecting the amount of time, education, and expense it takes to produce quality design work.\n\nThe more designers that fall for this unscrupulous tactic to get them to work for free, the worse it is for all of us. On Crowdspring, you have a less than 2% chance of getting paid for your work. Please think about the viability of a career in design if all graphic designers worked for free?! We'd all be homeless - and still working 18 hour days!\n\nPlease don't go over to the dark side.\n\nPlease read about it in depth at:  \n [www.no-spec.com](http://web.archive.org/web/20150320002258/http:/www.no-spec.com/ \"www.no-spec.com\")\n\n"
    },
    {
      "time": "3 Jun 2009 — 1:38pm",
      "content": "This kind of contest only benefits you if you are a student that needs practice. Also good for resume if you win...which is slim.\n\n"
    },
    {
      "time": "3 Jun 2009 — 3:20pm",
      "content": "It's terrible for your resume if the hiring manager/art director Googles it and finds out you participated in a contest. Your resume will go straight into the trash.\n\nIf you're a student that needs practice, a contest is not the kind of experience that will help you in the real world. The fundamental, crucial element of effective design is knowing your client's business needs and developing a design solution based on market research. In a contest, you're just guessing! That's design malpractice.\n\n"
    },
    {
      "time": "3 Jun 2009 — 3:23pm",
      "content": "\\> Your resume will go straight into the trash.\n\nWhy ?\n\n"
    },
    {
      "time": "3 Jun 2009 — 3:56pm",
      "content": "\"This kind of contest only benefits you if you are a student that needs practice.\"\n\nNo, it doesn't. A logo contest rarely a has a real client with tangible business goals that the design needs to address. At best it's an aesthetic exercise.\n\n\"Also good for resume if you win...which is slim.\"\n\nI'd say mentioning design contests on a resume would do more harm than good in this industry.\n\n\"Why ?\"\n\nNot the best analogy, but it'd be like the union hiring a scab.\n\nTo be fair, there are firms that do, as a firm, participate in spec work. It's a much more rampant problem in the Architecture world.\n\n"
    },
    {
      "time": "3 Jun 2009 — 3:58pm",
      "content": "Nobody who's a career designer/art director will a) take you seriously or b) want anything to do with designers who participate in devaluing the whole profession by participating in contests.\n\n....in short, because of all the reasons already posted in this thread about why contests undermine the whole design profession. All the reasons are here: [www.no-spec.com](http://web.archive.org/web/20150320002258/http:/www.no-spec.com/ \"www.no-spec.com\")\n\nI learned this the hard way. There was this job I really wanted, so I submitted my portfolio and resume. They replied by asking me to do a spec job. I was young...so I eagerly began working on the project. I submitted the design work under deadline and waited for a reply.\n\nSilence.\n\nI kept pestering them.\n\nSilence.\n\nEventually I get a \"no thanks\" letter in the mail. Two months go by, and I'm at a holiday party with a friend. There's this 40-something woman telling a story about how they vet candidates to find out if they've got the confidence and experience to \"make the cut.\"\n\nHere's what they do: They offer all the applicants a spec job, and then they toss out all the resumes of the designers who actually do the spec job.\n\nYes, it's kinda mean. But I really get why it separates the confident, self-respecting designers from the wannabes. Think about it. Would ANY other professional accept this kind of offer? Would hundreds of accountants (in the hope of being paid) submit completed tax forms for a tax-doing contest? No.\n\nSo why do designers?\n\n"
    },
    {
      "time": "3 Jun 2009 — 10:21pm",
      "content": "\\> “Why ?”  \n_Not the best analogy, but it’d be like the union hiring a scab._\n\nThat was exactly my impression. A turf war.\n\n_Would hundreds of accountants (in the hope of being paid) submit completed tax forms for a tax-doing contest? No._\n\nSo why do designers?\n\nThis is a bit of an apple to oranges comparison. 10 accountants will produce 10 identical tax returns, while 10 logo designers will produce 10 different concepts. Any work that involves an element of creativity carries a risk that the deliverable will not be what the client wanted. For _some_ clients this is unacceptable (for $ or for timing reasons) and so the spec work presents a viable alternative.\n\nWhy would designers be willing to do their work for free ? Because it's a good exercise, because they really need money, because spec contests provide very low barrier of entry to the professional market. Just few reasons from the top of my head. I flipped through 99designs pages some time ago, and they had entries that were head and shoulders above non-spec sketches that are being posted here now and then. Professional and spot on matching the brief. So seeing the request for a critique denied and a person being (effectively) talked down because he mentioned it was for a spec contest is, frankly, off-putting. The only thing this sort of commentary achieves is it alienates the person asking for help. I really really doubt that it will cause him to withdraw his contest entry and stop participating in any future contests.\n\n"
    },
    {
      "time": "3 Jun 2009 — 11:00pm",
      "content": "Epsilicon, I gather from your comments that you didn't read the links provided here that examine this topic in depth? Is there any way I can persuade you to read further, or have you made up your mind that it's a \"turf war\"? (Which, by the way, couldn't be further from the truth.)\n\nOh, and...\n\nTen accountants will definitely produce ten VERY different tax returns!\n\nSpec work is not, nor ever has been, a way to earn money if a designer \"really needs money\". The chance is EXTREMELY high that your work will be stolen, replicated and/or built upon by the CEO's assistant or intern, however.\n\n_I flipped through 99designs pages some time ago, and they had entries that were head and shoulders above non-spec sketches that are being posted here now and then. Professional and spot on matching the brief._\n\nThe work produced by spec designers is not identifiable by the aesthetic or technical quality of the design entries themselves. And anyone who knows how to type can request a critique on Typophile, so I'm not quite sure how you justify this comparison.\n\n_Any work that involves an element of creativity carries a risk that the deliverable will not be what the client wanted._\n\nExactly. This is what separates a skilled, professional designer from the rest of the crowd. **It's precisely the job of a designer to visually communicate EXACTLY what the client wants; that is the essence of good design,** and it's not complete until the design is EXACTLY what the client wants to communicate. This relationship is missing in a spec or contest assignment, and there's no doubt that it cripples the design process.\n\nCreating effective design is not synonymous with creating beautiful graphics. Not even close. Design is not artistic expression, it's problem solving. In a design contest, designers are throwing logos against a wall hoping one sticks.\n\nIn a professional relationship, a designer identifies trends, researches competition, gets to know the company history, develops a profile of the target market, and then applies all this knowledge to create a design that becomes the voice and face of the company.\n\n"
    },
    {
      "time": "4 Jun 2009 — 7:47am",
      "content": "@epsilicon\n\nTen accountants will likely \\*not\\* produce ten identical tax returns, at least in the United States. Ten general contractors will not create identical home additions. Ten neurosurgeons will not experience the exact same conditions and outcome during a brain surgery.\n\nThese examples, like many others, require some combination of skill, talent and experience, just like professional design work. It would be unconscionable and impossible to ask - and get - any of these people to work for free on the CHANCE you might pay them.\n\nFurthermore, if you re-read my initial post, I simply stated that if feedback was desired on design work, it would be best to not mention that it's part of a contest. I also provided some context. No talking down to or critique denying.\n\njarrod\n\n"
    },
    {
      "time": "4 Jun 2009 — 8:24am",
      "content": "Depend on the company that you apply for...majority of them wouldn't know jack about art or design. They rely more on accomplishment more than anything. & if you have some kind of an award on your resume it will definitely WOW them.\n\nAs a student, it’s a good way to bulk up your portfolio & gets some exposure. Yes, it's not a real world experience, but it’s close. Not all contest but some have specific guideline that you have to follow. Yes you work for free but so does internship.\n\nAs a seasoned vet I wouldn't come close to enter this kind of contest but I can understand why some people do. I’m not saying its right…but hey, when you are newbie you have to do whatever it takes to get some experience under your belt & be notice.\n\n@Alaska, you are based it off one bad experience...I was in similar situation twice where I was tested before hiring & got hired one out of two.\n\n"
    },
    {
      "time": "4 Jun 2009 — 8:52am",
      "content": "I have no idea what kind of company you are applying for as a graphic designer that wouldn't know jack about art or design. Doesn't sound like a great place for a graphic designer to be working at ;o)\n\n\"As a student, it’s a good way to bulk up your portfolio & gets some exposure. Yes, it’s not a real world experience, but it’s close. Not\"\n\nNo, it's not. It's really not. As a student, do some pro bono work if you must. Do a logo for your parents business or your brothers or your dorm-mates. Come up with some of your own product concepts and brand them. There are so many better ways to build a portfolio than design contests.\n\nFor that matter, there are so many better ways to pay for a logo than design contests.\n\n"
    },
    {
      "time": "4 Jun 2009 — 9:27am",
      "content": "so you telling me all of your clients know a lot about art/design? How many time have you designed a logo with different variation & they picked out the one that you like least. Not every designer gets to work for a fancy ad agency or with an art director you know.\n\nas a student, of course you should do work for relative & friend...more practice the better. Hell even enter contest if it gets your creative juice flowing. ;p)\n\n"
    },
    {
      "time": "5 Jun 2009 — 2:26pm",
      "content": "Alaskan, I have read through the no-spec and AIGA sites. I have a bit of a crunch at work, so it may take me few days to type my thoughts on the subject. Bear with me, I have some good arguments and would be interested in your take on them.\n\n"
    },
    {
      "time": "5 Jun 2009 — 3:29pm",
      "content": "\"so you telling me all of your clients know a lot about art/design?\"\n\n'Clients' that use sites like Crowdspring certainly do not know the value of design that is focused on their actual business goals.\n\n\"How many time have you designed a logo with different variation & they picked out the one that you like least.\"\n\nThat is perhaps one of the better examples as to why sites like Crowdspring are ridiculous.\n\n"
    },
    {
      "time": "5 Jun 2009 — 7:14pm",
      "content": "_\"There’s this 40-something woman telling a story about how they vet candidates to find out if they’ve got the confidence and experience to 'make the cut.'\"_\n\nI applied for a job which was redirected through AQUENT (the design talent agency). Their assessment program, for this particular client, involves me coming in for at least two hours and designing a couple of direct mail pieces from scratch. I cannot do this assignment from home (which is almost two hours away) and they will not pay for me to park on-site, which is three dollars per hour.\n\nWhat are all of your thoughts on design talent agencies and the like?\n\n"
    },
    {
      "time": "5 Jun 2009 — 7:53pm",
      "content": "Posting in these forums must be terrifying.\n\nBtw, will anyone crit this poor guy's logo? Or has he been deemed unworthy?\n\n"
    },
    {
      "time": "6 Jun 2009 — 7:29am",
      "content": "<cite>What are all of your thoughts on design talent agencies and the like?</cite>\n\nI'd pass on that particular job. Personally, I don't do tests or speculative work. Either you like whats in my portfolio or you don't.\n\n"
    },
    {
      "time": "6 Jun 2009 — 8:54pm",
      "content": "First to be fair I'll comment on the logo. The letters are spaced much too close, at smaller sizes they will morph together. The soccer ball seems just stuck on and not really incorporated into the design. My first thought is too suggest that the ball become the dot of dot com but that is probably trite. Soft marshmallow letter forms aren't my cup of tea but they seem to work in this design. I would however like to see some font alternatives for the tag line, I think there can be a better pairing.\n\nAnd now to the contest situation. This hit home for me as I'm currently wrestling with this myself. A friend asked if I would submit pieces to a local design contest. At first I said I would and was excited about the project. I knew the prize would not be equal compensation for the work, but the majority of my portfolio is of a niche subject and so I welcomed the opportunity to show some additional facets. I looked at it more as a volunteer project and was ok with that. That is until I re-read the rules and there it was...\"All submissions and rights to their use become the property of the SO-and-so Association.\" So the winner gets a mediocre prize and the losers get nothing AND loose the rights to their designs? I like what I created and where I looked into the history of the organization, their goals and other criteria, the illustrative aspect of the design could have other uses (it's a local landmark) Why would they even want the losing designs? I don't think my friend is trying to cheat artists, probably just went online and copied someone else's form. If it was an online contest I just wouldn't submit but now I have to find a way to tactfully decline.\n\nI don't think this article was mentioned earlier: [http://www.fastcompany.com/node/641740](http://web.archive.org/web/20150320002258/http:/www.fastcompany.com/node/641740)  \nI found it helpful.\n\n"
    },
    {
      "time": "6 Jun 2009 — 10:05pm",
      "content": "You could always tell your friend you didn't have time to do an entry, unless you've told him you have already done one. Then you'll probably just have to say it would be unethical to participate under the current agreement.\n\n"
    },
    {
      "time": "18 Jun 2009 — 4:14pm",
      "content": "I wouldn't enter a graphic design contest. It's just some a-hole marketing director's way of stealing creative work. Fine art contests aren't as bad. A still life isn't going to be very valuable to a company trying to sell things. I don't do spec work for freelance. I have done it for my agency, but they can usually sell it.\n\n<cite>Here’s what they do: They offer all the applicants a spec job, and then they toss out all the resumes of the designers who actually do the spec job.<cite></cite></cite>\n\nI could see them doing this for a senior designer position, but it seems a bit overboard for an entry-level position. Entry-level designers aren't going to be in professional situations that would require them to make those kinds of decisions anyway. People coming right out of school are going to be overcompensating with extra enthusiasm and drive, especially if they think it will make or break their chances of landing a great job. I can't imagine any entry level candidate refusing to take part in some kind of design test during the interview process of a firm or agency they aspire to work for. By throwing all of those resumes out they could be missing out on some real talent and potential.\n\n"
    },
    {
      "time": "19 Jun 2009 — 3:22pm",
      "content": "<cite>.. I have a bit of a crunch at work, so it may take me few days to type my thoughts on the subject ..</cite>\n\nI have not forgotten about this thread, but I still severely lack time to write a comprehensive response.\n\nWhat I was going to ask though was simple. How come AIGA does not advice against using BrandStack (aka IncSpring) ?\n\nAs far as a well-being of the clients goes, the practice of conjuring brands out of thin air is no less \"damaging\" than letting them pick through a pile of (alleged) spec dung in a search of a pearl that matches their vision of branding. From the client's perspective it is exactly the same situation - they have a brand in mind and they go searching for its implementation, successfully or not.\n\nPoint being is that AIGA's concerns about spec work being damaging _to the clients_ looks very much artificial, borderline hypocritical to me. If they really do mean it, they should've condoned prepackaged brand sales with even more vigor.\n\nIf you take this specific concern out of the picture, what effectively remains is a concern for the damage that cheap competing labor causes to the established professional community. It is perfectly reasonable and there is absolutely nothing wrong with it. But \"the spec work is hurting unsuspecting clients\" is not a valid argument. Clients get what they want. For some it's Walmart, for some it's Nordstrom.\n\n"
    },
    {
      "time": "23 Jun 2009 — 5:29pm",
      "content": "This is a very interesting topic for me, since I too find the ease of participating in sites like crowdSPRING alluring. The arguments offered in this thread against contests and \"crowdsourcing\" don't support the categorical conclusions that it's always harmful. For instance, it's mentioned that \"on Crowdspring, you have a less than 2% chance of getting paid for your work.\" I can't imagine how you arrive at a probability like this, since the designs aren't picked randomly. It's also not like the clients don't provide input on crowdSOURCE: they rate the entries, comment on them and ask for specific improvements. I doubt describing it as 'spec work' is even accurate. Perhaps only if you submit your work at the last moment.\n\nRegarding guesswork: even if you're working with a \"real\" client, you can't read their mind, they might not even know what they want, and so on. You will always be guessing to some extent. It could be called \"design malpractice\" if all you were doing was shooting in the dark, but contests or crowdSPRING projects usually do provide requirements and some context to go on. It's a clear exaggeration to describe it as simply guessing.\n\nI do think that there are other better reasons against contests and crowdsourcing, but it's certainly not a black-and-white picture as some here present it.\n\n"
    },
    {
      "time": "23 Jun 2009 — 9:31pm",
      "content": "_I doubt describing it as ’spec work’ is even accurate. Perhaps only if you submit your work at the last moment._\n\nI realized I had the wrong definition in mind. It is spec work.\n\n"
    }
  ]
}
