{
  "id": "58663",
  "title": "Simplix Bold",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi All—\n\nI have this font loaded on my machine, originating from a disk that has been passed around my work forever. Now I have successfully pitched it on a huge logo rollout, only to discover I cannot find it anywhere to purchase and have a legitimate licensing agreement. On my machine, it is identified as Simplix Bold.\n\nI’ve been to whatthefont and identifont, and they both lead me to an Emigre font called Triplex, but there are significant differences, for example in the lowercase “a” and “e”.\n\nAny ideas? Thanks so much!\n\n ![](http://web.archive.org/web/20090607102012im_/http:/typophile.com/files/identify_5067.jpg)\n\n",
  "author": "<a href=\"/web/20090607102012/http://typophile.com/user/45104\" title=\"View user profile.\">pxlgirl</a>",
  "time": "<br>",
  "uid": "45104",
  "comments": [
    {
      "time": " 2.Jun.2009 8.32pm",
      "content": "Wow, this goes waaaay back. It was released by an LA-based typesetting company that dabbled in type design in the early days of Fontographer. I remember seeing an article in Step-by-Step Graphics (later Step: Inside Design, which folded recently) that detailed the design process. The designer was very open about his admiration of Triplex and his desire to make a similar face.\n\nMaybe this description will help jar the memories of other early-DTP vets. There’s a chance that I still have the type specimen, but it’ll be a week or two before I have time to check. Frankly, I’ll be surprised if the company that issued the font is still in business.\n\nThere’s not a lot of subtlety here, and you’d be within your legal rights (as I understand them) to redraw the characters for the logo. Then you can choose another, better-drawn, legally available face as a complement.\n\n"
    },
    {
      "time": " 2.Jun.2009 8.34pm",
      "content": "Also, have you tried using Get Info (assuming you’re on a Mac) to look at the file details? Sometimes copyright info can be found there.\n\n"
    },
    {
      "time": " 3.Jun.2009 7.20am",
      "content": "©1991 Diehl.Volk Typographics. Not on [this site](http://web.archive.org/web/20090607102012/http:/www.mikediehl.com/type/index.html), but not surprising, given its similarity to Triplex.\n\n"
    },
    {
      "time": " 3.Jun.2009 10.15am",
      "content": "Thank you all so much!\n\n"
    },
    {
      "time": " 3.Jun.2009 1.35pm",
      "content": "Well played, Dr. Coles.\n\n"
    }
  ]
}
