{
  "id": "58688",
  "title": "Font licenses that allow private modifications?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is it the general case that font licenses allow you to create a derivative font for your own specialized needs or desires, but only for your own use? Or is this an exception to the general case?\n\nI see that Adobe allow this, but I'm not sure what the overall situation is....\n\n",
  "author": "abattis",
  "time": "3 Jun 2009 — 11:44am",
  "uid": "16849",
  "comments": [
    {
      "time": "3 Jun 2009 — 11:50am",
      "content": "\\>I see that Adobe allow this\n\nIn their licensing FAQ, but not in the EULA as I recall.\n\n"
    },
    {
      "time": "3 Jun 2009 — 12:22pm",
      "content": "It's an exception.\n\n"
    },
    {
      "time": "3 Jun 2009 — 12:43pm",
      "content": "@sii: Interesting! Clearly the EULA overrules the FAQ, but curious they would have a mixed message on this.\n\n@ralf: Do you know of any others?\n\n"
    },
    {
      "time": "3 Jun 2009 — 12:56pm",
      "content": "We allow it: [http://www.fonts.info](http://web.archive.org/web/20131018121428/http:/www.fonts.info/ \"http://www.fonts.info\")\n\n"
    },
    {
      "time": "3 Jun 2009 — 2:18pm",
      "content": "\\>Clearly the EULA overrules the FAQ\n\nI'd vote that the FAQ trumps the EULA :-)\n\nEULA - [http://www.adobe.com/type/browser/legal/pdfs/EULA5seat\\_USEnglish02.03.04...](http://web.archive.org/web/20131018121428/http:/www.adobe.com/type/browser/legal/pdfs/EULA5seat_USEnglish02.03.04.html \"http://www.adobe.com/type/browser/legal/pdfs/EULA5seat\\_USEnglish02.03.04.html\")\n\nFAQ - [http://www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf](http://web.archive.org/web/20131018121428/http:/www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf \"http://www.adobe.com/type/browser/legal/pdfs/FontFAQ.pdf\")\n\n"
    },
    {
      "time": "4 Jun 2009 — 1:50am",
      "content": "@sii: Why on earth would you vote for that? :)\n\n"
    },
    {
      "time": "4 Jun 2009 — 5:52am",
      "content": "I suspect that the clause in the EULA following:\n\n14.7.4 You may convert and install the font software into another format for use in other environments, subject to the following conditions: A computer on which the converted font software is used or installed will be considered as one of your Permitted Number of Computers. Use of the font software you have converted will be pursuant to all the terms and conditions of this agreement. Such converted font software may be used only for your own customary internal business or personal use and may not be distributed or transferred for any purpose, except in accordance with Section 4.4 of this agreement.\n\nis the portion that the FAQ is clarifying when it allows you to modify fonts.\n\nMaybe Thomas will drop by and add a comment. He was in charge when that EULA and FAQ were generated (I think).\n\n"
    },
    {
      "time": "4 Jun 2009 — 7:52am",
      "content": "Looking at the FAQ with its references to “Pyrus FontLab” and “Macromedia Fontographer” my guess is the EULA was rev’d at some point but the FAQ was not updated. I’ve mentioned the disconnect here a few times before, and should probably have kept quiet when the statement around Adobe allowing modifications came up. Right now the ambiguity is somewhat useful to customers – if Adobe changes anything they’ll likely change the FAQ, rather than update and localize the font EULA, and that's probably not helpful.\n\n"
    },
    {
      "time": "5 Jun 2009 — 1:10am",
      "content": "@Don: That portion of the license only permits CONVERSION though, not MODIFICATION?\n\n"
    },
    {
      "time": "5 Jun 2009 — 5:30am",
      "content": "Thomas has responded on this matter, to the extent that the same lawyers who wrote the EULA also wrote (participated in) the FAQ.\n\nI have no information, but consider this: The \"lawyers\" are trying to protect the monetary value of the fonts. That is, they are trying to protect against both piracy and unpaid distribution.\n\nThere is another aspect of fonts though, that is, their usefulness. Sometime \"usefulness\" is global; that is, a blackletter font would be pretty useless for setting a book about romantic comedies. Just pick another font.\n\nOn the other hand, a text may, for example, have 1,000 occurrences of a schwa. While is is possible to rotate an \"e\" 1,000 times with a layout program, it is not practical. An example from the PS Type 1 days was when macrons were needed over vowels. Just not there, and impractical to use what was in a font to typeset them.\n\nTo allow the end users the opportunity to use that font, you also have to allow him/her the right to create those characters.\n\nNow a designer may have thoughts other than money; they want to protect their work from any modification, on the ground that they got it perfect & any subsequent modification would harm their reputation. That is their right, but from any end-user's point of view, (1) it limits the usefulness of the font, and BTW (2) you can modify it's appearance with whatever tools the layout program has.\n\nThere aren't many end users on Typophile. The prevailing perspective is that of type designers. The designers need to remember, when talking to their lawyers about EULA's, the needs of their customers -- Unless, of course, they view their work as art, where the usefulness of it is a secondary matter.\n\nTo me, Adobe's policy make perfect sense. Legally, they maximize the monetary returns for the distribution of their work, while increasing the usefulness of it by allowing the end user to modify as needed. Which, as it happens, should only increase sales.\n\nIf the type world ever gets as serious about enforcing EULA's as the music world got, issuing lawsuits over modifying fonts even when there was no illegal redistribution, the management of companies that use fonts (that is, every press director, and I suspect the boss of every art director) is going to solve the potential problem by simply prohibiting any the use of any font save the few known to be safe from action -- e.g., Adobe, as things currently stand.\n\n"
    },
    {
      "time": "5 Jun 2009 — 6:29am",
      "content": "Is regenerating the font with a flipped \"lowercase g\" and regenerating the font with added old style figures the same legally?\n\n"
    },
    {
      "time": "5 Jun 2009 — 7:54am",
      "content": "From the Adobe EULA quoted above... \"Such converted font software may be used only for your own customary internal business or personal use and **may not be distributed or transferred for any purpose** , except in accordance with Section 4.4 of this agreement.\"\n\nI hadn't noticed this before, but as section 4.4 does not allow document embedding a converted font cannot be legally embedded in a PDF or other document. So if somehow conversion = modification in Adobe's eyes, the modified font has to stay on your machine and can't be part of the customary PDF workflow.\n\n"
    },
    {
      "time": "5 Jun 2009 — 9:03am",
      "content": "A hypothetical:  \nIf you were using a font that you bought and paid for, and found that it had an obvious defect, would you consider it appropriate to simply open it up and fix the defect?  \nWould this be, in your eyes, \"derivative\" and a violation of the EULA?\n\n"
    },
    {
      "time": "5 Jun 2009 — 10:27am",
      "content": "I assumed Dave’s interest was primarily academic, or maybe looking for wording to insert into his own EULA? Reality on the ground is that the handful of non-typedesigner users that have invested in FontLab for production/workflow purposes, would have no second thoughts about violating the no-modification rules in order to get their work done. It’s kind of like the people who remove the labels from mattresses or who put compact florescent bulbs in the trash - i this case the EULA clause is easy for them to ignore, especially if there’s no 0% chance of getting into trouble.\n\n"
    },
    {
      "time": "5 Jun 2009 — 10:56am",
      "content": "Sorry about the perception of mixed messages. The EULA FAQ really is up to date. We'll take another look at tweaking either or both to make things more clear. It's a difficult balance to get wording that's unambiguous both to lawyers and end users! In the meantime, I hope this helps.\n\nIt's been Adobe's position - pretty much from Day 1 - that we can't be all things to all users. Therefor we permit our licensees to modify the fonts as/when necessary to meet their specific requirements. (As others have noted, this is not the case for many other companies' EULAs. That's largely because they want to do the modifications themselves, and charge for the service. Adobe fonts licensed from another company may not include modification permission.)\n\nThere are some obvious, and not-so-obvious constraints on the modified fonts. Obviously they're still subject to the terms of the end user license. That precludes selling or freely distributing the modified copies. What may be less obvious is that both the modified copies and the unmodified originals count toward the licensed total. (Our default license is for five seats/machines.)\n\n"
    },
    {
      "time": "5 Jun 2009 — 11:13am",
      "content": "@DavidL: Wonderful, thanks for the clarification! :-)\n\n@Sii: Yes, its academic, I'm converting my MATD dissertation into a book later this year and its something I didn't take time to really look into when I was submitting the thesis text.\n\n"
    },
    {
      "time": "5 Jun 2009 — 2:44pm",
      "content": "\\>We’ll take another look at tweaking either or both to make things more clear.\n\nGreat news. I don't feel so bad now for mentioning the issue.\n\n"
    },
    {
      "time": "11 Jun 2009 — 4:22am",
      "content": "Tiny, tiny foundry here. Our fonts tend far towards \"art\" than \"tool\", nevertheless, we allow personal mods. You have to, because one way or another, people will modify what they feel they own. I have even received modifications from a user, and put it into an update. Woot!\n\n[C](http://web.archive.org/web/20131018121428/http:/chozcunningham.com/) [!](http://web.archive.org/web/20131018121428/http:/www.exclamachine.com/) [.~](http://web.archive.org/web/20131018121428/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "11 Jun 2009 — 7:31am",
      "content": "I think a blanket grant is an exception to the general case, but if you contact the foundry directly, they will often allow it.\n\n"
    }
  ]
}
