{
  "id": "58684",
  "title": "Typekit: It’s already got competition",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Esteemed colleague Richard Rutter lets the cat out of the bag and [discloses](http://web.archive.org/web/20130822082853/http:/forabeautifulweb.com/blog/about/why_typekit_will_change_everything/#r1001 \"Via a comment chez Andy Clarke\") that his Web shop, Clearleft, is also working on a [Typekit](http://web.archive.org/web/20130822082853/http:/typophile.com/wiki/Typekit)-esque mechanism to use real fonts on Web sites without piracy.\n\n",
  "author": "joeclark",
  "time": "3 Jun 2009 — 10:15am",
  "uid": "7076",
  "comments": [
    {
      "time": "3 Jun 2009 — 10:36am",
      "content": "I think there are many approaches to web fonts. We have only just started to see the very beginnings of the solutions. Our web team is also working on this. who knows where it will wind up.\n\n"
    },
    {
      "time": "3 Jun 2009 — 11:40am",
      "content": "also:\n\n[http://www.kernest.com](http://web.archive.org/web/20130822082853/http:/www.kernest.com/ \"http://www.kernest.com\")\n\n"
    },
    {
      "time": "3 Jun 2009 — 11:44am",
      "content": "Any attempt to address the problem is good. Even if Typekit and Richard's project end up filed, ultimately, as noble experiments.  \nEveryone will learn from them.  \nKudos to anybody who tries to take this bull by the horns.\n\n"
    },
    {
      "time": "3 Jun 2009 — 12:01pm",
      "content": "There are just 2 ways to do it: You either give the customers the webfonts, or you give them a code and everything else is handled on the server of the webfonts provider. There is no other way to do it. So I was a little bit surprised about the hype around the \"revolutionary idea\" called Typekit. Richard and I (among others) are proposing this model for quite some time now.\n\nAbout the \"real fonts on Web sites without piracy\": It's just not possible! Sure, all these webfont services will use some sort of obfuscating, both for the download URLs and the font files itself, but in the end there is always a working font delivered to the browser. And any obfuscating can easily be bypassed or reversed. So as foundries we shouldn't fall for any promises about a \"secure webfont service\".  \nWe should either accept the risk, or not take part in this development. But we shouln't wait for a magical solution to secure the fonts. It's not gonna happen.\n\n"
    },
    {
      "time": "3 Jun 2009 — 1:12pm",
      "content": "ralf said:  \n\\> There is no other way to do it. So I was a little bit surprised  \n\\> about the hype around the “revolutionary idea” called Typekit.\n\nwell, typekit has gotten a lot of attention, that's for sure...\n\nveen usually does.\n\nbut i'm not sure even typekit describes itself as \"revolutionary\".\n\ni seem to remember them saying something that is more like  \n\"well, the browsers will support it now, so we're gonna try it.\"\n\n-bowerbird\n\n"
    },
    {
      "time": "3 Jun 2009 — 1:21pm",
      "content": "Seems the \"webfont\" story is getting some attention from Monotype Imaging. The company introduced a non-commercial end user license agreement, or EULA, that permits the use of fonts in the Embedded OpenType format on the Web. Intended to extend font choice for Web page design, the EULA requires no additional fee for use on a non-commercial Web site when licensing products from the company’s Monotype, Linotype, ITC and Image Club typeface collections from Monotype Imaging’s e-commerce sites: Fonts.com, Linotype.com, ITCFonts.com and Faces.co.uk. [http://www.communitype.co.uk/archives/category/webtype](http://web.archive.org/web/20130822082853/http:/www.communitype.co.uk/archives/category/webtype)\n\n"
    }
  ]
}
