{
  "id": "58694",
  "title": "What is the proper way to use extended/condensed versions of a font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am wondering what the proper way is to use different versions of a font (extended, condensed, etcetera). When should I use a condensed or extended font? Should I stick to just one version or is it sometimes ok to mix them?\n\nThanks for any input!\n\n",
  "author": "Eric Kelsey",
  "time": "3 Jun 2009 — 4:14pm",
  "uid": "45121",
  "comments": [
    {
      "time": "3 Jun 2009 — 4:34pm",
      "content": "If you're ever tempted to stretch or squish a font, use the extended or condensed version instead.\n\nBut the greater benefits of an expanded font family come into play when setting complicated documents, such as magazines that need various styles to distinguish photo credits, captions, pull quotes, footnotes, etc. without detracting from the body text, headlines, and subheads, etc. Each of those could be of a different size, weight, width, and even a different variant specialized for very small or large display. Maps have need of many varied type styles to distinguish different feature types too. Examine a copy of National Geographic, where you can see examples in both of these situations.\n\n"
    },
    {
      "time": "3 Jun 2009 — 4:37pm",
      "content": "Some of the grotesque and neo-grotesque fonts out there are really wider than they need to be when used as copy, so a condensed weight can save paper and look better. For example, its common for designers to use Univers Condensed for copy and save the regular width for headlines.\n\n"
    },
    {
      "time": "4 Jun 2009 — 1:07am",
      "content": "I totally agree James and cfish, but I also think that condensed and extended styles are pure evil and the inbreeds of comercial typography. There so many solutions with good typefaces that have small-caps, good italics/cursives and a bold style. Maybe extended and condensed type can serve a purpose in logo-design or posters, but some typefaces like Helvetica have so many styles that you can easily end up with a circus of unclear typography. We don't need 30 styles, just several good ones.\n\n"
    },
    {
      "time": "4 Jun 2009 — 4:34am",
      "content": "A lot to say and short of room? Use Condensed.  \nLess to say and a lot of space? Use Extended.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "4 Jun 2009 — 5:18am",
      "content": "I think Condensed is far more useful than extended, for example, in the Madrid Metro, there is a limitted amount of space to use to put the name of each station. Sadly they switch to Arial Condensed from the normal Helvetica or just squash it, but this is when a well-done condensed variant could be useful. In poetry, especially in translation, you might have a line that won't fit on one line. I personally think it's rather unsightly to use the open bracket + rest of the line combination right justified and a condensed font most of the time would help out a lot.\n\nThat said, designing the condensed to 50% makes it obviously out of place. Subtlety (as best possible, like the æ lig) is key.\n\n"
    },
    {
      "time": "4 Jun 2009 — 5:23am",
      "content": "... but I also think that condensed and extended styles are pure evil and the inbreeds of commercial typography\n\nStretching and shrinking typefaces is evil. Nothing wrong with using a well-designed face that may be wider or narrower than the norm. (What exactly is the norm? I haven't seen any specs as to exactly what each character width should be.)\n\n"
    },
    {
      "time": "4 Jun 2009 — 11:04am",
      "content": "Thanks for all the comments everyone!\n\n"
    },
    {
      "time": "4 Jun 2009 — 4:29pm",
      "content": "<cite> &gt; In poetry, especially in translation, you might have a line that won’t fit on one line. [. . .] a condensed font most of the time would help out a lot.</cite>\n\nIn fact, in the late 1700s, before any real concept of condensed or extended, a relatively narrow style of typefaces by Luce (and picked up also by Fournier le jeune) were known as _Types Poétiques_. (cf. Updike, Vol. I, figs 176 & 183.)\n\n"
    },
    {
      "time": "4 Jun 2009 — 6:33pm",
      "content": "I don't know if it matters, but condensed and narrow versions of fonts are very important in signage. When you first set up a directory of any kind you try to plan for every contengency, start out with the normal scale, but it doesn't work all of the time. You always run into a name that will not fit but can't be shortened or made smaller. This saves you from squashing the font, which I don't allow unless otherwised ordered.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20130105045641/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "9 Jun 2009 — 3:19am",
      "content": "phrostbyte64:\n\nYour right about the condensed type in signage. My only point was that all those condensed and extended styles are made for offering and selling more fonts by foundries. Because these styles are easy to make by interpolation you just need to extreme designs and interpolate everything in between. In my opinion if you need a condensed face for signage that gets a lot of readable characters on one line, design one that fits that purpose. An extended or condensed Helvetica is not what the initial idea was behind the typeface just some idea from the foundry to make more money out of it. But maybe I'm to traditionally biased.\n\n"
    },
    {
      "time": "9 Jun 2009 — 5:38am",
      "content": "<cite>My only point was that all those condensed and extended styles are made for offering and selling more fonts by foundries.</cite>\n\nThey wouldn’t make them if people didn’t buy them, and people wouldn’t buy them if they weren’t needed.\n\n"
    },
    {
      "time": "9 Jun 2009 — 6:15am",
      "content": "Sidney:\n\nTo some degree I agree with you. Some type designers don't do enough to design their condensed and extended fonts. They just throw them together to fill out a collection. That's almost as bad as stretching a font. Some fonts shouldn't have a condensed form. This doesn't stop people from buying and using them. I started a condensed version of a font I am working on and stopped when I realised that the only way to do it correctly was to start over.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20130105045641/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "9 Jun 2009 — 7:13am",
      "content": "James:\n\nI make things because I believe in them and not only because people want them. And people didn't study typefaces and the history of it to know what they need. Good type-designers and designers decide what is needed, but some are in it for the money I guess. (that's a good way to destroy 600 years of tradition)\n\n"
    },
    {
      "time": "9 Jun 2009 — 11:28am",
      "content": "Sidney:\n\nI've seen more than a few fonts that tried to pass off \"squashed\" glyphs as condensed. But, by no means are all type designers guilty of this.\n\nAs a type designer, I make things I like and generally will use. I don't take into consideration what might be profitable. Maybe if I did, my bottom line would be a lot healthier. Might not be as much fun though.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20130105045641/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "10 Jun 2009 — 1:10am",
      "content": "phrostbyte64:\n\nNo I know, I'm just taking in an extreme point of view to get the discussion going, but I still think the use of condensed and extended is limited. I am traditionally oriented and of course I'm not accusing anybody of the wrong use of type. I just want to make people realize that there are designers with opinions based on air and not knowledge and experience. We are working in a critical time of transition between techniques. From metal type to digital, it took almost 600 years for this to happen. The computer opened the world of design for the mass, which results in a lot of designers not being educated and capable. Keep tradition, history and most important quality alive.\n\nThanks for discussing this,  \nSee you around\n\n"
    }
  ]
}
