{
  "id": "58691",
  "title": "Fixing Search...",
  "forum": "Jared Benson's blog",
  "tags": [

  ],
  "content": "Some of you may notice a new link on the right hand side on the site, under your user name. While we're patching the disconnected pipes in Typophile's search engine, we're providing the \"Search Typophile\", which **actually works.**\n\n",
  "author": "<a href=\"/web/20111107072733/http://typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": "<br>",
  "uid": "3",
  "comments": [
    {
      "time": "",
      "content": "Great! Very good news.\n\n"
    },
    {
      "time": "",
      "content": "Yes! Thank you!\n\n"
    },
    {
      "time": "",
      "content": "It's not pretty, but hey, functional is nice too.\n\nPlease note it only searches against Forums. We'll work to get this to search against wiki, blogs, etc.\n\n//jared\n\n"
    },
    {
      "time": "",
      "content": "there's a missing Pangram thread ... which has been discussed in a few of the other pangram threads ...\n\nit produced this pangram: Boxer M. Tyson packs his bags with Jay-Z DVDs, Quik, Holyfield’s ear.\n\nwhich Paul added to the wiki.\n\nbut can't find it with the search.\n\nis there a text file of those somewhere ... or any idea how we could find that thread.\n\nnot a big deal at all; just more of an itch unscratched. :)\n\n"
    },
    {
      "time": "",
      "content": "Do you mean this one?\n\n[http://typophile.com/node/36610](http://web.archive.org/web/20111107072733/http:/typophile.com/node/36610 \"http://typophile.com/node/36610\")\n\n(I found it at the bottom of the first page of search results using the temp search feature.)\n\n"
    },
    {
      "time": "",
      "content": "Finaly! No more endless searching for the right topic. Well done! :-)\n\n"
    },
    {
      "time": "",
      "content": "Not that one. :(\n\nI did try the new search before I posted and didn't find it.\n\nbut i saw the one you linked.\n\nIn it, Stewf makes a mysterious reference to the grand thread:\n\n<cite>I’ve updated the wiki with working links, but yeah, couldn’t find the grand thread which was once here.</cite>\n\n"
    },
    {
      "time": "",
      "content": "Will choosing specific forums be part of the \"advanced search\" someday?\n\n"
    },
    {
      "time": "",
      "content": "@beejay: I'm dusting off the cobwebs of our deep archives - I'll see what I can find.\n\n@eliason: Yes, we expect that advanced search will allow more specificity. However this will likely be part of a bigger Typophile update, which we're simultaneously working to finalize.\n\n"
    },
    {
      "time": "",
      "content": "UPDATE: We've got the search field working again- so I've gone ahead and removed the redundant text link on right.\n\nSearch results are relevant but still pretty raw; we'll continue to look at what enhancements we can bring in the next big update.\n\nYou can always search Typophile at [http://typophile.com/search/](http://web.archive.org/web/20111107072733/http:/typophile.com/search/ \"http://typophile.com/search/\"), or search remotely by passing a text string to \"http://typophile.com/search/?keys={your text here}\"\n\nSpread the word!\n\n//jared\n\n"
    },
    {
      "time": "",
      "content": "I get more results from the typophile.com/search page than from searching in the box at the top of this page. For example, \"pangram\" yields no results from the box up top.\n\n"
    },
    {
      "time": "",
      "content": "^ Never mind that post, it's turning things up now.\n\n"
    },
    {
      "time": "",
      "content": "Oh very nice. I was really confused about the link on the right and the box up top turning up different things :-)  \nThanks guys, you rock!\n\n"
    }
  ]
}
