{
  "id": "58725",
  "title": "Phonetic font issues reloaded",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Continuation from:  \n [http://typophile.com/node/58118](http://web.archive.org/web/20131023063512/http:/typophile.com/node/58118 \"http://typophile.com/node/58118\")  \n [http://typophile.com/node/58195](http://web.archive.org/web/20131023063512/http:/typophile.com/node/58195 \"http://typophile.com/node/58195\")\n\nLet me draft some conclusion from the two recent discussions.\n\nAiming to meet [IPA](http://web.archive.org/web/20131023063512/http:/typophile.com/wiki/International%20Phonetic%20Alphabet) font requirements the designer faces a range of particular challenges in terms of character coverage and glyph shaping. A special difficulty lies in the need to solve some Regular/Italics issues simultaneously with some Latin/Greek issues. Discussions revealed that obviously no entirely satisfying IPA typeface is known so far but we want to put meditation upon IPA misconceptions aside here and try to be pragmatic.\n\nAlthough I still find this kind of ghettoism not really good I announce the forthcoming release of a special Andron-IPA. This is how the glyphs discussed may appear in the two fonts:\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/Andron_ipa_glyphs_5347.jpg)\n\n(the depicted sequence is: /a/\\_/ae/\\_\\0250\\0251\\0252/\\_/b\\03B2/p/\\_/f/\\_\\0192/\\_/g/\\_\\0261/\\_\\03B8/v/\\03BD\\028B\\03C5/\\_\\0278/phi1/phi/x\\03C7 ; /\\_ is just a small space for optical reasons)\n\nI plan to include the entire Latin char. repertoire (except Vietnamese) and the basic Greek lowercase alphabet, alongside with Spacing Mod. Letters, Comb. Diacritical Marks and the 1DC0-block.\n\nA few questions remain:  \n1. Do you think the UPA blocks should be covered too?  \n2. Is there a need for Bold, Bold Italics and Small capitals (in extra fonts)?  \n3. The changed glyph for a (0061) causes repercussion for a number of precomposed characters, such as ä, å, à and the like. Are users aware of this?  \n4. Any further suggestions?\n\n",
  "author": "Andreas Stötzner",
  "time": "4 Jun 2009 — 9:44am",
  "uid": "17347",
  "comments": [
    {
      "time": "4 Jun 2009 — 12:18pm",
      "content": "1. I do not know any practicing Uralicists, so I can't say. I have a healthy-sized overview of the Uralic language family written by various authors, and each seems to use a fairly ad-hoc system of notation. I could provide you an overview of each author's conventions, but I don't know how representative it is of the field and don't want to give you any wrong impressions.\n\n2a. Bold is the canonical way of emphasizing IPA text. Its inclusion is important.  \n2b. Bold Italic would be a nice thing to have; I have occasionally had use for it.  \n2c. There is no tradition of setting IPA in caps, and to do so would be extraordinarily challenging. This is probably best avoided.\n\n3. The remapping of italic characters will make an IPA-specific version of Andron useless for body text, so you would only need to worry about the IPA diacritics, and could safely ignore the extended Latin variants of the letter a.\n\n4. Some of your character shapes remain problematic. The right-facing serif on italic b is potentially confusable with ɓ. The bottom serif on ɑ should match d; likewise the top serif of ɒ should match p. I am still not sold on the shape your italic a - you mentioned that you found it in a medievalist scribal variation. Have you considered looking for double-story as in modern chancery hands?\n\n"
    },
    {
      "time": "4 Jun 2009 — 2:23pm",
      "content": "The problem with caps and small caps is the fact that some letters are used already in a small caps version. African languages already have a history of IPA or IPA-like caps, but they don't use small-cap I or L or R. How might you distinguish those?\n\nAlso, the discussion and design of IPA fonts has piqued the interest of a well-known professor of linguistics when I asked him about it. Unfortunately he hasn't had time to give a full response and set of advice (especially on click consonants) but when I hear back I'll see if he's okay with me posting snippets of what he says on here.\n\n"
    },
    {
      "time": "5 Jun 2009 — 2:50am",
      "content": "<cite>3. The remapping of italic characters will make an IPA-specific version of Andron useless for body text, so you would only need to worry about the IPA diacritics, and could safely ignore the extended Latin variants of the letter a.</cite>\n\nI don’t understand this, I’m afraid. My point was the demanded glyph alteration of italic a (0061) and the subsequent alteration to all(?) its precomposed brothers. Which combinations shall get affected by the change and which not? What is the logic of this?\n\n<cite>The right-facing serif on italic b is potentially confusable with ɓ</cite>  \nThis could be changed, no problem.\n\n<cite>The bottom serif on ɑ should match d </cite>  \nIs that really important? It could be changed too but it would not look good. There is \\*a reason\\* for this detail. Maybe you’re not used to it, but would it really do harm in this form?\n\n"
    },
    {
      "time": "5 Jun 2009 — 5:30am",
      "content": "Andreas, an IPA-specific font will only be used for IPA and orthographies based on the IPA. For the IPA, you don't need to worry about ä, å, à, etc. since they are not part of the IPA.\n\nThere are cases in African orthographies for example that distinguish a and ɑ, and it is conceivable that diacritics may be used for such purposes as marking tones. In that case, you would need separate a with acute accent, ɑ with acute accent, etc. I doubt that any orthography that distinguishes a and ɑ also needs the combining ring diacritic above for either of them, but who knows.\n\nThe point that Peter makes is that not counting these very specialist uses, no one will use an IPA-specific font for the body text in any language that normally prefers a single-storey a for the italic, so you don't normally have to worry about ä, å, à, etc.\n\n"
    },
    {
      "time": "5 Jun 2009 — 1:20pm",
      "content": "None of what follows is really a font designers problem, but those of us who set type are apt to run into all sorts of strange constructions, requiring \"accents\" in all sorts of places, and over all sorts of characters, including IPA characters.\n\nOne that comes to mind, dimly, and with pain, was an issue of <cite>Poetics Today</cite>, where authors were trying to analyze sounds, metrics, rhythm patters, perhaps in new ways, and all mixed together. Best I could tell, they borrowed from every font file they could think of, to come up with symbols & accents that 'sort of' represented what they were talking about.\n\nThis one became an exception to our policy that all issues of a journal are charged at the same rate. And a little flag to me that you can never have too many characters in a font . . .\n\n"
    },
    {
      "time": "5 Jun 2009 — 9:11pm",
      "content": "_Is that really important? It could be changed too but it would not look good. There is \\*a reason\\* for this detail. Maybe you’re not used to it, but would it really do harm in this form?_\n\nThere are basically two ways to look at this. As Charles said in the previous thread, the rotated characters were originally simply sorts that had been physically rotated 180°. As such, they would have the serif structure of the original glyphs from which they were derived. An approach faithful to the original use of metal type would probably do the same thing, but in this case I don't think that nostalgic verisimilitude would have any broad appeal.\n\nThe seemingly rotationally symmetric letters in our latin script (p/d, b/q, n/u, and to some extent f/j, s, x, z) are of course not actually symmetric - their serif structure changes to reflect their historically hand-drawn forms, and give a since of orientation and gravity to the face. Victor Gaultney applied these principles to the turned glyphs in Gentium to good effect. I think the same reasoning could be applied to a more traditional typeface like Andron. (Maybe Matthew will show you his take on the issue in Corunna.)\n\nRedrawing the glyphs would be a lot of work, the effort unlikely to be noticed by the average linguist, and would be largely without precedent among current IPA faces. Aesthetically, however, it's the right thing to do.\n\n"
    },
    {
      "time": "5 Jun 2009 — 10:00pm",
      "content": "Unfortunately, I don't own a copy, by it might also be interesting to see what choices the creators of [Fedra Serif IPA](http://web.archive.org/web/20131023063512/http:/www.typotheque.com/fonts/fedra_serif_phonetic/about/concept) made.\n\n"
    },
    {
      "time": "7 Jun 2009 — 7:46am",
      "content": "So far unmentioned, but I think your IPA chars are _beautifully_ drawn. There.\n\nI'm having some reservations on the italic 'a' -- I like it, but the authors I work with are a fussy lot.\n\n<cite>3. The changed glyph for a (0061) causes repercussion for a number of precomposed characters, such as ä, å, à and the like. Are users aware of this?</cite>\n\nProbably not. To differentiate unambiguously between regular 'a' and the script one ('alpha'), they simply expect a slanted 'a', even in combos such as 'æ'. A-ring is not an IPA character, but you should be prepared to have any amount (sane or insane) of diacritics attached.  \n(Extending up to the 'ɨ' -- the 'stroked i'. Create one without the dot.)\n\nI'm with Charles, I've never seen the IPA character set in use as small caps. It wouldn't work -- there is a number of IPA glyphs that are already used as small caps. Unfortunately, writers HAVE discovered the benefits of bold and bold italics.\n\nDo you have any insights on creating a glottal stop? It probably should use the '?' glyph as a base form, and it occurs both mirrored and vertically swapped -- all 4 orientations.\n\n"
    },
    {
      "time": "7 Jun 2009 — 2:50pm",
      "content": "One thing to remember about phonetic characters \"borrowed\" for other uses -- such as the written form for languages that historically never had a written form -- is that acute, grave, and macron are often used to signal tone, rising, falling, and the macron sometimes used for either no tone, or, perversely, a hard vowel. If you're going to do an IPA version, it might be well to include the accents, too.\n\n\\* \\* \\*\n\nI agree it is a beautiful font, and worth the money. Unfortunately, these days my customers (1) won't use a font they don't have on their computer, and (2) seemingly won't buy anything over US $39.95. For example, I bought Trinite to set some books for Richard Eckersley; unfortunately, while many current designers admire the font, none will buy it & it sits primarily unused, unless I do the design as well as the composition for a book.\n\n"
    },
    {
      "time": "7 Jun 2009 — 4:26pm",
      "content": "Here are the examples of the turned a (open central vowel) and the turned m (close back vowel) being optically corrected instead of simply turned. It doesn't seem like much but it really helps the harmony of the font as a whole.\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/ipa_samplea_3990.png)\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/ipa_sample_5929.png)\n\n"
    },
    {
      "time": "7 Jun 2009 — 7:20pm",
      "content": "Matthew, I agree completely that it is necessary to optically adjust turned and flipped letters, but I think you are over-compensating. Your turned a is too much like an e and no longer sufficiently a-like. And while I think the bottom of the turned m should be modelled on the u, I think the identity of the letter is better served by retaining the flat serifs at the top.\n\nHere are the same letters from my Brill typeface:\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/brilltturned_5959.gif)\n\n[I'll post a full showing of the Brill IPA characters when I have finalised them.]\n\nAndreas, I really like your IPA variant italic a, but I agree with Theunis that this form is probably too distinctive from the roman a for comfort.\n\n"
    },
    {
      "time": "8 Jun 2009 — 1:49am",
      "content": "That's spot on for the problem with a lot of the IPA set: although the turned 'm' technically is based on the 'u', it has historically been represented by ... a turned 'm'. No doubt for the simple reason that could be done pre-outlined-fonts with some cut-and-paste (or, in extremis, by re-inserting the paper upside down into your typewriter and typing an 'm').\n\n\"IPA symbol is a turned letter m, although given its relation to the sound represented by the letter u, it can be considered a u with an extra \"bowl\".\" ( [http://en.wikipedia.org/wiki/Close\\_back\\_unrounded\\_vowel](http://web.archive.org/web/20131023063512/http:/en.wikipedia.org/wiki/Close_back_unrounded_vowel))\n\nSo in a typographic and technical sense, Matt (Guifa) is right to draw a double 'u', but alas ... it looks weird, and the fussy lot I referred to earlier will surely _demand_ their usual 'm'.\n\n"
    },
    {
      "time": "8 Jun 2009 — 4:20am",
      "content": "I've tried a variety of different styles for the rotated letters (for example, finishing the rotate a with the same stroke as an e/c, or the rotate a, or more similar to the top of the c or r) before settling on that one. I don't really consider any solution perfect yet, obviously, these are characters that haven't gone through the millions of iterations that the rest of the alphabet has to \"fit\" in the alphabet, so I'm not trying to push my solution as \"the\" solution, just one of many. While Theunis finds the double-u form weird, I've generally found the rotated form weirder (though the flat top-left serifs on brill make it much less distracting)\n\nI'm somewhat of the opinion that the reason many of these rotated shapes have been canonized is in large part due to there not being a major linguist who is also greatly interested in typography who sat down and looked at things as in depth as, say, Knuth did with mathematics and essentially defined the standard. For that reason I think most linguists would be quite open to seeing different designs -- the problem is until very recently not many people have tried. Many will be willing to help out time-permitting, I've been consulting with a few including some who have been happily sending me pages of IPA text to test out newer versions.\n\n"
    },
    {
      "time": "8 Jun 2009 — 6:20am",
      "content": "Sorry, Matt -- my overly sour and critical authors must've made me overly sour and critical!\n\n<cite>..I’ve been consulting with a few..</cite>\n\nYes, that's the way to go. Best feedback you can get is right out of the linguistic field.\n\n(After all, the worst thing that can happen with a plethora of IPA fonts to choose between is a client's preference for a specific implementation. Like the one that requested \"Gill Sans but with a regular one\".)\n\n"
    },
    {
      "time": "8 Jun 2009 — 7:29am",
      "content": "Theunis, I didn't think you were too sour and critical, actually I thought I might have come off as too brazen.\n\nWhat I meant about finding what \"fits\" which will just take time and experimentation, the latter of which a lot of don't want or can't afford to do (the free fonts are the most guilty of this, though understandably). I'm not being critical, just pointing out how things are/have come to be.\n\n"
    },
    {
      "time": "8 Jun 2009 — 4:12pm",
      "content": "Hmm. I thought I'd made up my mind about the turned m, but now you have me thinking about it again I'm leaning toward the double-u form for the Brill font. Here's a comparison:\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/koripa_4976.gif)\n\nI don't think the double x-height serifs of the turned m form are a problem in themselves, since IPA already includes some smallcap forms that present the same feature. And I think this feature should be normative for other rotated letters such as r. But the phonetic relationship to the u makes the double-u shape more sensible for the ‘turned m’.\n\n"
    },
    {
      "time": "8 Jun 2009 — 4:18pm",
      "content": "Question: if the ‘turned m’ takes a double-u form on the basis of its relationship to the u vowel, what about the velar approximant consonant ‘turned m with right leg’ (U+0270)? My inclination is that this would _not_ follow the same form, but would retain the double serifs of the turned m form. In other words, the form would be determined by the phonetic value, not by similarity of shape.\n\n"
    },
    {
      "time": "8 Jun 2009 — 5:11pm",
      "content": "John, the 'turned m with right leg' should follow the same form as the 'turned m' in my opinion. It's because the sounds they represent are actually related, although that's hard to tell from the phonetic description alone.\n\nThe 'turned m with right leg' is the symbol frequently used for a semivowel in Korean, the first component of 의, that corresponds to the close vowel represented by the 'turned m', 으. This is like the relationship between 'j' and 'i', or between 'w' and 'u' in IPA. Technically, these 'semivowels' behave as consonants and are called approximants to distinguish from 'true' semivowels, hence the phonetic description that obscures the relationship to the vowel sound.\n\nI agree that the 'turned m' should use a double-u form, as that's exactly how I think of it. The Korean vowel that is represented by that symbol is most often romanized with a variation of 'u', such as 'ŭ' or 'eu'.\n\n"
    },
    {
      "time": "8 Jun 2009 — 5:22pm",
      "content": "Thanks, Brian: that is a very helpful analysis, and I agree with your reasoning.\n\n"
    },
    {
      "time": "8 Jun 2009 — 5:26pm",
      "content": "Similarly, I think the symbol for the labial-palatal approximant, which we can think of as the 'semivowel' corresponding to 'y', should be thought of as a 'u with a tail' rather than an 'upside-down h', and be designed accordingly.\n\nAll this is primarily because I think of these symbols as variations on 'u'. It's certainly not because I want to avoid flat-top serifs at x-height. Other symbols like the 'upside-down r' should retain their flat-top serifs, not to mention letters like 'x-height capital I'.\n\n"
    },
    {
      "time": "8 Jun 2009 — 5:29pm",
      "content": "When you think about it (or rather, pronounce it), it's still derived out of the u (in Spanish, interestingly, the w is often pronounced using one of those three options, ɡ, ɣ, or ɰ). The labialized velar approximants have the double-v form (and v\\>u) which make a more concrete connection. (though it might have been more visually logical to have the labialized ones use the u-form and the non-labialized the v-form, but I digress).\n\nThough the rs don't look that odd with the positionally-corrected serifs placed on them:\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/ipa_r_4516.png)\n\n"
    },
    {
      "time": "8 Jun 2009 — 5:44pm",
      "content": "I would never say never to 'upside-down r' and others adopting 'positionally-corrected serifs'. Gentium does this, for example. And arguably, it looks good that way.\n\nMy concern is that the change in detail might imperceptively hinder the identification of the symbol for those who think of it as an upside-down r. I know it bugs me a little bit because I'm expecting an upside-down r, but the details are different. Then there's the fact that with the number of 'small cap' symbols, flat-top serifs at x-height are used anyway for IPA.\n\n"
    },
    {
      "time": "8 Jun 2009 — 7:11pm",
      "content": "I think the turned r with ‘positionally correct’ serif is problematic. There is only one single-stroke x-height letter and that is i. Remember that we gain more information on Latin letter identity from the top half of the letters, so having the double-serif of the turned r is a useful cue that we're dealing with something other than a variant of i.\n\n"
    },
    {
      "time": "10 Jun 2009 — 3:45am",
      "content": "Matthew, you have convinced me about the 'm'/'u' issue. :-) Yes, it's subtle, but it _does_ look better in running text.\n\nTip o' the hat to those amongst you that create fonts from scratch. You would not believe the amount of time it took me to create this capital open e (as required in the orthography of a language called \"Kabiye\"), using pilferaged parts of another typeface ...\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/opene-cap_4103.PNG)\n\n"
    },
    {
      "time": "10 Jun 2009 — 5:22am",
      "content": "A trick for the open e. Take the c and redraw the curves so that there is no extrema on the left hand side (eg, you have points at 12o'clock and 6 o'clock, with the terminals at 1-2 o'clock and 4-5 o'clock). Now you can \"squash\" the c by simply moving the bottom part up and the curve will almost perfectly maintain its weight. Repeat and drop it and come up with a nice middle section. You'll need to tweak it a bit still probably, but it gets 95% of the work done quickly.\n\n"
    },
    {
      "time": "10 Jun 2009 — 6:30pm",
      "content": "Jongseong:\n\n_...the fussy lot I referred to earlier will surely demand their usual ’m’._\n\nMy concern is that the change in detail might imperceptively hinder the identification of the symbol for those who think of it as an upside-down r.\n\nReally, I wouldn't worry too much. It makes sense for an editor to be fussy about preserving meaningful contrasts in letter shape (like a vs. ɑ, and v vs. ʋ vs. u), and it makes sense for a typographer to worry about making the Greek characters harmonize with the Latin, but I don't think any editor is likely to be bothered by altering the serif structure, which is not by itself meaningful, and the harmonization of serif structure on the turned letters is generally pleasing.\n\nSo, I vote for the modified r series. The same goes especially for ɟ and ʄ, which should really be based on a stroked dotless j and not a turned f, and for ʌ, whose vertex ought to mirror capital A, not lowercase v. Not quite sure what to do about the ascender on ʎ, though, since nothing else in the lowercase alphabet has a diagonal ascender. Should it resemble the ascender on f? The ascender on ð? Should it keep its turned-y form?\n\nThe one exception is the small cap letters, as you point out. I had a long think about what the best way to deal with them is, and I fully agree that they must retain the serif structure of their uppercase counterparts. Various authors have substituted the Turkish undotted i (ı) or a latinized iota (which usually looks something like a short, uncrossed t) for IPA [ɪ]. Pullum and Ladusaw say that the latin iota is obsolete in the Phonetic Symbol Guide, and undotted i presents obvious problems for fonts which need fi ligatures which are frankly too irritating to deal with. (There is part of me that still wants to see what ʙ, ɢ, ʛ, ʜ, ɪ, ɴ, ɶ, ʀ, ʁ, and ʏ look like in a parallel universe where they lived as minuscules their whole lives. I do realize that this is a ridiculous premise, though. Their shapes look horrible sandwiched between the baseline and x-height. The International Phonetic Association is made of phoneticians, not typographers.)\n\n_On Open E_\n\nDoes anyone think that that stealing Cyrillic Small Letter Ze (з) for Latin Small Letter Reversed Open E (ɜ) is a reasonable course of action?\n\n[Edit: Apologies for posting weirdness: I edited my post and I think it became reordered with respect to Charles reply]\n\n"
    },
    {
      "time": "10 Jun 2009 — 6:22pm",
      "content": "<cite>Does anyone think that that stealing Cyrillic Small Letter Ze (з) for Latin Small Letter Reversed Open E (ɜ) is a reasonable course of action?</cite>\n\nThe (graphic) designer has chose Minion for the typeface. There is an instance or two, in 10-point \\*italic\\* type, of an \"Latin Small Letter Reversed Open E.\" First proof is due in three weeks; that includes everything, setting the text, laying out pages, dealing with the rotten images, etc. The comp has Fontlab, but can't really draw.\n\nSo yes.\n\nWhat would they do in the meal era? Maybe not only use that character, but probably from another font as well. (Neither would be Minion, of course.) Textual harmony . . . out the window.\n\n"
    },
    {
      "time": "10 Jun 2009 — 6:34pm",
      "content": "Charles: What, in principle, would be the difference between a Reversed Open E designed with the IPA in mind, and a Cyrillic lowercase Ze? I am asking sincerely, as I don't know much about Cyrillic other than that it appears to have several useful lettershapes with a ready-made glaze of Latinization. Please educate me!\n\n"
    },
    {
      "time": "10 Jun 2009 — 6:59pm",
      "content": "Ah, sorry. We need John or Brian for that. I'm only a practical sort.\n\n"
    },
    {
      "time": "10 Jun 2009 — 11:01pm",
      "content": "To address an as-yet unanswered question:  \n_Do you have any insights on creating a glottal stop? It probably should use the ’?’ glyph as a base form, and it occurs both mirrored and vertically swapped — all 4 orientations._\n\nPredictably, its not necessarily as simple as that. It depends on what language, what orthography, is being supported.\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/huronia_glottals_6594.png)\n\nHere are a few of the options. In this case, somewhat Americanist-centric (that is, these are glottals used for American orthographies) and may exclude some. There are a couple of major distinctions; glottalization of a base character, usually with a comma accent. Non-diacritic glottals are various and sundry. Of those shown, only the last two have no encoding, not withstanding potential smallcap forms. Of course, regional preferences may influence particular modifications, which may or may not mean using a differently encoded form, or stylistic alternate (eg. whether or not a lowercase glottal has a serif on the bottom or not in a otherwise seriffed font).\n\n"
    },
    {
      "time": "10 Jun 2009 — 11:31pm",
      "content": "gelded question: did it hurt?\n\n"
    },
    {
      "time": "11 Jun 2009 — 1:02am",
      "content": "I need to return to the a-problem. There are some statements about how to deal with the italic a-diacritics:\n\nJongseong: <cite>”an IPA-specific font will only be used for IPA and orthographies based on the IPA. For the IPA, you don’t need to worry about ä, å, à, etc. since they are not part of the IPA.“</cite>\n\nPeter Farago: <cite>”The remapping of italic characters will make an IPA-specific version of Andron useless for body text, so you would only need to worry about the IPA diacritics, and could safely ignore the extended Latin variants of the letter a.“</cite>\n\nTheunis de Jong: <cite>”A-ring is not an IPA character, but you should be prepared to have any amount […] of diacritics attached.“</cite>\n\nThere seem two concepts competing unconciously: a) an IPA-font has to be seen as an ”IPA-only-font“, ignore anything not IPA-specific. b) Provide as much characters as you can to add value to the font.\n\nIn my opinion it is reprehensible to dwell on the ”Splendid-isolation“ concept for IPA fonts. The IPA character set is genetically connected to Latin, some glyphs are related to Greek and Cyrillic, a selection is used in proprietary mixtures for certain orthographies … Following that scenario the font designer shall aim to accomodate any of the possible uses of the font, of which IPA use is \\*one only\\*.  \nSo, how to deal best with the italic a diacritics?\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/Andron_aaa_italic_5561.jpg)\n\n"
    },
    {
      "time": "11 Jun 2009 — 12:17pm",
      "content": "_did it hurt?_\n\nIt was given local anesthetic and told how handsome it was.  \nIt looks a bit detached now, but at least doesn't spray the furniture anymore.\n\n"
    },
    {
      "time": "11 Jun 2009 — 9:24pm",
      "content": "Peter: _What, in principle, would be the difference between a Reversed Open E designed with the IPA in mind, and a Cyrillic lowercase Ze?_\n\nI don't think there is a difference ‘in principle’, but there may be a difference in the context of specific typefaces. Since most of the typefaces I design include both Latin and Cyrillic support, my usual approach to the reversed open e is to make it a composite of the lowercase Cyrillic ze, and then to test it alongside the other extended Latin letters and look at it relative to the open e. In many designs, this approach will work fine, but not in all.\n\nThe treatment of terminals is such that the reversed open e is not, in fact, a flipped open e, even in a typeface with a vertical axis. The Cyrillic ze normatively has a serif terminal at the top in roman types (but not in italics) and a ball or similarly heavy terminal at the bottom _or a flourish terminal_ (the latter is definitely not a candidate for the IPA letter). The presence of the serif at the top is useful in the IPA letter, since it helps make the distinction between the reversed open e and the turned open e (U+1D08). Here are the three forms in the Brill type, in which the reversed open e is (currently) a direct composite of the Cyrillic ze:\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/bropene_5389.jpg)\n\n"
    },
    {
      "time": "14 Jun 2009 — 9:58am",
      "content": "The serifed upper terminal seems to be more characteristic of uppercase forms (compare latin C with c). Since most of the Cyrillic lowercase is just a scaled-down version of the uppercase, with the uppercase serif structure intact, and since the IPA is meant to harmonize with the latin lowercase (with the above-noted exception of the small cap letters), I really do wonder what the appropriate structure is. Should the upper terminal resemble the arm of a lowercase a? Should the lower terminal resemble the arm of the lowercase script g? Should the upper terminal be undecorated with a ball terminal on the bottom, to resemble a turned c? Or does the Cyrillic form just look right in the lowercase latin context?\n\n"
    },
    {
      "time": "14 Jun 2009 — 2:59pm",
      "content": "In roman type there are typically two kinds of termination to horizontal strokes or curves: a vertical serif terminal and some form of heavier terminal (lacrymal, ball, wedge, etc.). Both are used in lowercase letters, with the serif terminal typically found in the lowercase s _regardless of which terminal form is found elsewhere in a, c, etc.._ Hence, I don't find the vertical serif at the top of the reversed open e to be alien to the Latin lowercase.\n\n"
    },
    {
      "time": "14 Jun 2009 — 3:31pm",
      "content": "Thanks, John. That's well reasoned, and Open E and lowercase s do seem to have something in common in terms of curve structure. Is Brill an exclusive commission, or will it be available to the general public?\n\n"
    },
    {
      "time": "14 Jun 2009 — 7:46pm",
      "content": "The Brill typeface is a custom design for the Dutch academic publishers of the same name, but I believe their intention is to make it available for non-commercial use by scholars and students.\n\n"
    },
    {
      "time": "20 Aug 2009 — 2:05pm",
      "content": "@ Mr. Stötzner:  \nSir, you're a master of your craft, for sure! I feel honored having met you in Dublin.\n\nHaving said that, if the IPA version of Andron is álso to be used for copy text, I believe, that italic a won't work. Given, that quite often IPA is used quite interspersed in text (giving pronunciation of individual words) rather than whole passages (e.g. transcription of a recording), I believe something ought to be done about the a (but I might have missed arguments from previous discussions). — Not that I wouldn't love the outline of that italic a, it's beautiful — for some display or \"fancy\" font. [Yes, yes, IPA ís fancy..., I know].\n\nI actually reading about the back close approximant, I wanted to post a comment not to forget the connection between j and ɟ, however I see Peter picked up the issue already.\n\nI cannot share his view about the ɪ to be rather designed Turkish ı-like: his major concern is the ﬁ. However, an IPA specialist font should néver use glyph shapes for f, or for any character as a matter of fact, that need ligation. (Slight contextual shaping might be ok). The reason is clearly the abundance, alas, sprawling and spawning of diacritics in phonetic works. Best to use an f with a narrow ascender, as it has been already explored in 19th, 20th century metal type.\n\nSzabolcs\n\n"
    },
    {
      "time": "21 Aug 2009 — 1:22am",
      "content": "The regular 'f' (bottom) and my 'phonetic' f.alt :-)\n\n ![](http://web.archive.org/web/20131023063512im_/http:/typophile.com/files/f-alt_5469.PNG)\n\nI prefer to use the regular form (of course) but when the next character has a diacritic of some kind, I use the f.alt.\n\n"
    }
  ]
}
