{
  "id": "58732",
  "title": "¿Translation from English to Spanish... subtle details to look for?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Is your “industrial diet” pushing you towards  \ndisease?\n\n¿SU “DIETA INDUSTRIAL” LE ESTÁ EMPUJANDO HACIA LAS ENFERMEDADES?\n\nWhen I place the copy into inDesign, the ¿'s baseline drops(like above has it). I correct whenever I encounter it for a cleaner look (has it appears in the translation), but I'm curious if there are other subtle tweaks that the English language doesn't have to worry about, but the Spanish do. Treatment of accents and such. Does anyone have typical things they correct when going through their Spanish copy?\n\n",
  "author": "theplatypus",
  "time": "4 Jun 2009 — 11:41am",
  "uid": "35061",
  "comments": [
    {
      "time": "4 Jun 2009 — 2:17pm",
      "content": "There aren't aren't a whole lot of accents, so the only one would maybe be fí. In all caps raising the ¿ can be nice but isn't obligatory. A quick look at advertisements in and around Madrid will show it's not the norm.\n\nThe m-dash comes along a bit more in Spanish and has spacing rules that can differ from English styles. It spacing usage in Spanish is equivalent to a parenthesis. That is:\n\nFoo —bar— foo. But:  \nFoo —bar—, foo.\n\nIf it's done in a handwriting font, (this may or may not apply in South America), the capital i will frequently maintain its dot. And universally in the Spanish-speaking world, the tilde can transform into a macron both in handwriting and more geometric fonts.\n\n"
    },
    {
      "time": "4 Jun 2009 — 2:24pm",
      "content": "Brasíl: the accent hits the following serif in some typefaces.\n\n"
    },
    {
      "time": "4 Jun 2009 — 2:49pm",
      "content": "Nick: Brasil doesn't have an accent in Spanish, but it would hold true for í+stem (bhlk) although off the top of my head I can't think of many examples. íbamos, um, and that's it.\n\nOn second thought, a quick search through _El buscón_ (Ricardo López Aranda) lists the following í+stem combinations:\n\nÍL:  \nsacrílego (+derivatives)  \narrodíllase  \nperdíla (modern orthography: perdila)  \nvendíla (m.o.: vendíla)  \ndíle (m.o.: dile)\n\nÍB:  \níbanse (+derivatives)\n\nÍH: none  \nÍK: none\n\n"
    },
    {
      "time": "4 Jun 2009 — 3:18pm",
      "content": "Must have been thinking of Brasília...\n\n"
    },
    {
      "time": "5 Jun 2009 — 10:18am",
      "content": "Hey, thanks a lot! This is good stuff. :)\n\nbest regards,  \ndaniel\n\n"
    }
  ]
}
