{
  "id": "58738",
  "title": "Quick Question",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I ran across the word \"coterie\" in a body of type I am setting.\n\nI am not familiar with this word (and I'm not afraid to admit it :P), should I set it in italics or has it been Englishified enough to where I don't have to?\n\nex. vis a vis, voila\n\nmuch obliged!  \nRachel\n\n",
  "author": "Curiousity",
  "time": "4 Jun 2009 — 1:22pm",
  "uid": "25161",
  "comments": [
    {
      "time": "4 Jun 2009 — 1:34pm",
      "content": "It is a standard English word, do not make it italic.\n\nFrom the OED:\n\ncoterie |ˈkōtərē; ˌkōtəˈrē|  \nnoun ( pl. -ries)  \na small group of people with shared interests or tastes, esp. one that is exclusive of other people : a coterie of friends and advisers.  \nORIGIN early 18th cent.: from French, earlier denoting an association of tenants, based on Middle Low German kote ‘cote.’\n\n"
    },
    {
      "time": "4 Jun 2009 — 1:56pm",
      "content": "thanks for the quick reply!\n\nFor future reference, outside of asking someone, how is this distinguished?\n\nIs it the mere fact that it's listed in the OED? Because foreign words are listed in English dictionaries...\n\nOr, is the fact that it is of mixed origin, rather than just \"French\" as my dictionary lists for voila?\n\n"
    },
    {
      "time": "4 Jun 2009 — 4:52pm",
      "content": "English dictionaries mark words still considered foreign with something that specifically says \"foreign\". Look in the pronunciation guide to see if there is a symbol for it; usually it's a double dagger.\n\nThere is a certain amount of personal preference as to whether a term has been fully assimilated into English. For instance, my 1984 Webster's New World Dictionary marks \"voilà\" as foreign but not \"raison d'etre\", and your dictionary may differ. Going by the origin alone is not enough if you don't know the word, as then you could end up italicizing such English words as \"inaugural\".\n\n"
    },
    {
      "time": "5 Jun 2009 — 6:26pm",
      "content": "Maybe you should ask the person who wrote the text? ;)\n\nOr do you always decide yourself what to set in italic?\n\n"
    }
  ]
}
