{
  "id": "58774",
  "title": "Best Fonts for the Web",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What are the best fonts?  \nHere’s a list of the best loved fonts we all know and work fine. [http://www.inspirationbit.com/16-best-loved-font-bits-in-web-design/](http://web.archive.org/web/20090722104816/http:/www.inspirationbit.com/16-best-loved-font-bits-in-web-design/ \"http://www.inspirationbit.com/16-best-loved-font-bits-in-web-design/\")\n\nBut I’m looking for alternatives. Any suggestions?\n\n",
  "author": "<a href=\"/web/20090722104816/http://typophile.com/user/44914\" title=\"View user profile.\">theloneprince</a>",
  "time": "<br>",
  "uid": "44914",
  "comments": [
    {
      "time": " 6.Jun.2009 10.22am",
      "content": "The thing is the logo I designed uses House Gothic 23 Text. I want a secondary font to use on the website. But I want something different. Do you think this sample could work fine?  \n\\>\\>\n\n ![](http://web.archive.org/web/20090722104816im_/http:/typophile.com/files/01_5902.jpg)\n  \nAnd what font is this? Do you know similar fonts that could work fine with House Gothic 23 Text?\n"
    },
    {
      "time": " 7.Jun.2009 8.49am",
      "content": "Not the correct board of this forum? sorry.\n\n"
    },
    {
      "time": " 7.Jun.2009 7.10pm",
      "content": "Hi. This board is fine. Fonts on the web is really only limited to a few alternatives, as every person visiting your website must have the font installed to be able to see it. That is, unless you use techniques like Sifr (which is only really useful for headlines). While we’re waiting for the technology, I’d like to recommend a few rarely used css font stacks (a list of alternatives, in case the first isn’t present).\n\n**Transitional serif:**\n\n`font-family: Baskerville, Baskerville Old Face, MG Open\tCanonica, Times New Roman, serif;`\n\n_Baskerville_ come bundled with OSX on a Mac.  \n_Baskerville Old Face_ come bundled with MS Office 07 and 03 on a Windows PC and MS Office 04 on a Mac.  \n_MG Open Canonica_ is our Ubuntu fallback.\n\n**Modern serif:**\n\n`font-family: Didot, Bodoni MT, Modern No. 20, serif;`\n\n_Didot_ com bundled with OSX on a Mac.  \n_Bodoni_ come bundled with MS Office 07 and 03 on a Windows PC.  \nThe same goes for _Modern No. 20_, additionally MS Office 04 on a Mac.\n\nI’ll post some more another time. Cheers\n\n"
    },
    {
      "time": " 8.Jun.2009 12.34am",
      "content": "Great stuff, Frode. You should start a thread for sharing font stacks!\n\n"
    },
    {
      "time": " 8.Jun.2009 1.00am",
      "content": "_“And what font is this?”_\n\nI’m sure you can find that bitmap font on [DaFont](http://web.archive.org/web/20090722104816/http:/www.dafont.com/bitmap.php).\n\n"
    },
    {
      "time": " 8.Jun.2009 5.28am",
      "content": "The question makes as much sense as asking for the “best fonts for print”.\n\n"
    },
    {
      "time": " 8.Jun.2009 8.08am",
      "content": "I intend to write an article on the subject some day, but I’m still in the research process. Here’s another one:\n\n**Humanist sans serif**\n\n`font-family: Lucida Sans, Lucida Sans Unicode, Lucida Grande, sans-serif;`\n\n_Lucida Sans_ come bundled with MS Office 04 on a Mac, and the Regular weight is included in Win Vista and XP and Office 07 on a Windows PC. PS: Lucida Sans sport a beautiful calligraphic cursive.  \n_Lucida Sans Unicode_ come bundled with MS Office 08 on a Mac, and Win Vista and XP on a Windows PC. Additionally MS Office 07 on a Windows PC also bundle it.  \n_Lucida Grande_ come bundled with OSX on a Mac.\n\n"
    },
    {
      "time": " 8.Jun.2009 8.10am",
      "content": "Adding _DejaVu Sans_ or _Bitstream Vera Sans_ as an Ubuntu fallback might be an option.\n\n"
    },
    {
      "time": " 8.Jun.2009 8.13am",
      "content": "<cite>“I intend to write an article on the subject some day”</cite>\n\nWell hurry up to make it before @font-face :)\n\n"
    },
    {
      "time": " 10.Jun.2009 6.01pm",
      "content": "I am hurrying :)\n\n"
    },
    {
      "time": " 11.Jun.2009 10.30am",
      "content": "[http://typophile.com/node/58939](http://web.archive.org/web/20090722104816/http:/typophile.com/node/58939 \"http://typophile.com/node/58939\")\n\n"
    }
  ]
}
