{
  "id": "588",
  "title": "Cludged Cyrillic, Need Critique",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I need to add a single cyrillic word into a manuscript I'm working on, but alas, the typeface I'm using (ITC Quay Sans Book) has no cyrillic version. So, I'm forced to cludge. Can someone looks this over and let me know if I've bolloxed it up?   \n   \n ![Cyrillic](http://web.archive.org/web/20131019002122im_/http:/www.typophile.com/forums/messages/4100/12813.jpg)\n\n",
  "author": "seanglenn",
  "time": "11 Jul 2003 — 11:07am",
  "uid": "1256",
  "comments": [
    {
      "time": "11 Jul 2003 — 11:51am",
      "content": "For a kludge, this isn't too bad. You have not made the _el_ too rectangular, which is the usual beginner mistake. You could make the left, curved stem even more diagonal if you wanted to. To balance with the _a_ this form needs to be a little bit wider.   \n   \nThe width of the capital _Pe_ should be slightly narrower than the Latin _H_.   \n   \nThe _ya_ is the trickiest letter you need to deal with. The head must be larger, try to balance it optically with the counter of the _a_. Of course, this means that the whole letter needs to wider, and the leg shorter.\n\n"
    },
    {
      "time": "11 Jul 2003 — 12:28pm",
      "content": "Here's my updated version, incorpating those suggestions.   \n   \n ![Cyrillic Revision](http://web.archive.org/web/20131019002122im_/http:/www.typophile.com/forums/messages/4100/12816.jpg)\n\n"
    },
    {
      "time": "11 Jul 2003 — 12:47pm",
      "content": "John's the expert on the forms, but I'd point out that the spacing needs work too.   \n   \nPlus if you're willing to break from the Modernist doctrine of bland uniformity, you might make the \"a\" different than the original Latin one, perhaps by giving it more rigidity, like a straight middle join. That would be classy.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jul 2003 — 6:14pm",
      "content": "Sean, the updated version is much improved. I would very slightly shorted the foot of the _el_ and make the interior space just a little bit wider. You can still make the left left a bit more diagonal if you want.   \n   \nRegarding the spacing, can you provide some more context so we know how tightly spaced your Latin text is going to be?\n\n"
    },
    {
      "time": "14 Jul 2003 — 10:03am",
      "content": "This is totally tangential, but it hit me hard enough that I'd like to share it:   \n   \nIf Cyrillic is effectively more \"uppercase\" than Latin, maybe Cassandre wanted to reform Latin to regain its majuscule majesty (via Peignot) in large part because he was originally Russian?   \n   \nhhp\n\n"
    }
  ]
}
