{
  "id": "58842",
  "title": "Are .bak files really necessary?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I’m considering disabling the creation of .bak files in Fontlab to simplify my working directories. I’ve never run into any trouble with Fontlab corrupting my VFB files, and with Time Machine handle my backups reasonably well I feel safe doing this. But before I do, are there still any reasons to leave this feature enabled?\n\n",
  "author": "blank",
  "time": "8 Jun 2009 — 3:35pm",
  "uid": "14722",
  "comments": [
    {
      "time": "8 Jun 2009 — 4:33pm",
      "content": "It happens. This was just posted to the fontlab errors flickr pool: [http://www.flickr.com/photos/71509246@N00/3607278740/in/pool-fontlaberrors](http://web.archive.org/web/20131020093628/http:/www.flickr.com/photos/71509246@N00/3607278740/in/pool-fontlaberrors \"http://www.flickr.com/photos/71509246@N00/3607278740/in/pool-fontlaberrors\")  \nThat being said, I wish they were hidden.\n\n"
    },
    {
      "time": "9 Jun 2009 — 8:23am",
      "content": "Hard to say, unless it's a big storage issue, I say keep them. It's happened to me once and it was a day-wrecker for sure.\n\n"
    },
    {
      "time": "10 Jun 2009 — 4:24am",
      "content": "Every once in a while, FL seems to completely lose all the changes made during a work session despite numerous savings.\n\nAs the .bak file is completely useless in this one case where it might be useful, unless the user themselves accidentally tosses the .vfb I think ,bak is a placebo.\n\nCheers!\n\n"
    },
    {
      "time": "10 Jun 2009 — 7:21am",
      "content": "Did you ever use the menu at the bottom of the classes panel to switch from metric to kerning classes, thus wiping the others in the process? Well, I thought, no real harm done, open the .bak file: hey presto, no classes either! Bad luck that.\n\n"
    },
    {
      "time": "10 Jun 2009 — 7:41am",
      "content": "\"...menu at the bottom of the classes panel to switch from metric to kerning classes, thus wiping the others in the process?\"\n\nYES!!! A couple of years ago, and I sent in a bug report and told Adam about it online. Adam said it was a \"Known Bug\". Since it is so known and has been for 2 or more years, why have they not fixed it? Even if they just get rid of the button all together so a person does not accidentally use it, would be a BIG HELP!\n\nChrisL\n\n"
    },
    {
      "time": "10 Jun 2009 — 7:44am",
      "content": "I really dislike them, and I dont trust them at all – I rather save my own backups if I need to.\n\n"
    },
    {
      "time": "10 Jun 2009 — 8:01am",
      "content": "<cite>Since it is so known and has been for 2 or more years, why have they not fixed it?</cite>\n\nI’m pretty sure we could make a list of at least one known bug for every feature in Fontlab. We’re probably better off just waiting for that total rewrite we get with version 7.0. We can all live with the classes bug until 2013, right?\n\n"
    },
    {
      "time": "10 Jun 2009 — 8:36am",
      "content": "Total rewrites add bugs, not take them away. See what happens when there is no competitive product on the market? FontLab can sit on its aßs and ignore us--the glories of monopoly :-/\n\nChrisL\n\n"
    },
    {
      "time": "10 Jun 2009 — 8:43am",
      "content": "I started experimenting with [DropBox](http://web.archive.org/web/20131020093628/http:/getdropbox.com/) while in Reading. It stores remote copies of your files at every save. The first 2Gb are free, but you can add more if you need it. I keep my vfb and development otf files in there, so should my vfb go wrong I can revert to the last save.\n\n"
    },
    {
      "time": "10 Jun 2009 — 10:54am",
      "content": "_Did you ever use the menu at the bottom of the classes panel to switch from metric to kerning classes, thus wiping the others in the process?_\n\nI sure wish you had posted this two days ago instead of today. Yesterday sucked for me.\n\n"
    },
    {
      "time": "11 Jun 2009 — 4:56am",
      "content": "@ David Berlow\n\n_Every once in a while, FL seems to completely lose all the changes made during a work session despite numerous savings._\n\nYes, I had that and thought how illogical it was. It turned out that I have done a _Save as..._ (without really thinking) and because I had been working on a completely different font in a different location, the file was saved in that really weird and rather arbitrary location. Hence I now had two files with same name in different places. Open the original (which you are confident of having overwritten) and it's the same old, same old. The key is to find if you did a _Save as..._ and, if you did, where you saved the _Save as..._ version. It might not be as bad as you think.\n\nOf course, it might be as bad as you think, it might be a bug and I gather that FontLab has a few of those. Nevertheless not many people stick up for its virtues in this forum. I like it, especially when it behaves.\n\n"
    },
    {
      "time": "11 Jun 2009 — 9:12am",
      "content": "I disabled .bak files two years ago, but now I save my .vfb files with a different name if a significant change has been done: Fondo01, Fondo02, Fondo03, &c. It is better for me, but as a side effect I have a lot of files for the same font, so if you are trying to simplify your directories, maybe this solution is not for you. Time Machine is a very good choice, as well.\n\nOn the other hand, I recall a couple of times when I just hit Command + S and said: “Ouh! This is not supposed to be saved, it is just a test!” Those old days, .bak file saved my day.\n\n"
    },
    {
      "time": "11 Jun 2009 — 10:42am",
      "content": "instead of relying on .bak files, i have tried to condition myself to save after every important change to a .vfb file. sometimes that means saving before and after performing simple (yet risky within FontLab) maneuvers on glyphs.\n\n"
    },
    {
      "time": "11 Jun 2009 — 1:00pm",
      "content": "Isn't it pathetic that we have to try and outwit the bug monsters in FontLab? Wouldn't it be nice if they just put forth the effort to fix it themselves?\n\nChrisL\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:16pm",
      "content": "I've done it. I removed them all.\n\n ![](http://web.archive.org/web/20131020093628im_/http:/typophile.com/files/fnnt_5718.png)\n\n"
    },
    {
      "time": "13 Jun 2009 — 6:28am",
      "content": "\\>The key is to find if you did a Save as... and, if you did, where you saved the Save as...\n\nThis has never been the case with my lost font/FL crashes. I have searched my entire computer for files modified that day and that week, and neither the missing font, or any other appears anywhere. It is like Fl completely denies anything happened at all for one or more sessions. Poof!\n\nCheers!\n\n"
    },
    {
      "time": "13 Jun 2009 — 12:17pm",
      "content": "For the benefit of readers who might not be aware: the Windows version of FontLab is _much, much_ more stable than the Mac version and has far fewer bugs.\n\nChris, I hear rumours that FL have replaced their entire Mac developer team, so perhaps there is hope for improvement.\n\n"
    },
    {
      "time": "14 Jun 2009 — 11:43am",
      "content": "\"... I hear rumours that FL have replaced their entire Mac developer team,\"\n\nThanks, John! You mean they actually HAD a Mac developer team? Could have fooled me :-)\n\nChrisL\n\n"
    }
  ]
}
