{
  "id": "58859",
  "title": "Logo criticism (Eco/green/sustainable)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everybody!  \nI'd like to get some criticism about a logo I'm working on for a contest in my design school.\n\nCresco (in english it's GROW) is a project which deals with sustainable development. It helps companies to share their sustainable ''habits'' with citizens, and its main areas of activities are:  \n-energy saving  \n-recycling  \n-sustainable transport\n\nAs for my entry, I decided to approach the broader concept of ''sustainable development'' rather than focusing on one of the 3 areas (and hence leaving the other 2 out).  \nAfter some sketching I came out with this pictogram which symbolizes a human being ''growing'' from leaves (nature - the environment).  \nMy choice of lowercase letters tries to make the logo more friendly, and I chose these fonts (avant garde and futura) because their kind of ''circle based'' and it connects them to the pyctogram, which is round.  \nAlso, they're \"safe\" fonts.\n\nI'm not happy with it though, what do you think?\n\n| Attachment | Size |\n| --- | --- |\n| [CRESCO.jpg](http://web.archive.org/web/20131020082213/http:/typophile.com/files/CRESCO.jpg) | 117.12 KB |\n\n",
  "author": "AndreaC",
  "time": "9 Jun 2009 — 5:19am",
  "uid": "45258",
  "comments": [
    {
      "time": "9 Jun 2009 — 8:15am",
      "content": "My initial impressions; I couldn't tell that was a person in the background, a little too vague with just a circle on top of a box. Also, is there a reason for the green \"o\" at the end of \"cresco?\" Conceptually, is there a better symbol or group of symbols that will more effectively communicate these sustainable habits? I see soooo many leaves and the color green on all these eco-friendly, sustainable this-and-that logos that they all start to melt together. Green noise, if you will.\n\nAgain, just an initial impression, and I'm very interested to see if anyone has ideas regarding alternative ways to communicate the whole \"green\" concept.\n\n"
    },
    {
      "time": "9 Jun 2009 — 3:10pm",
      "content": "It's a start, and it shows you're thinking which is a great start.\n\nWhile I agree about the greenwashing/use of leaves is done to death, I'm going to leave that.\n\nWhat you've got just isn't friendly in any way. Sustainability (in this capacity) is about people making a difference, changing the way they behave, consume and ultimately their impact on the environment.\n\nThe mark you currently has feels totally sterile and clinical.\n\nSure lowercase letters can (in general) give the impression of a more relaxed and casual organisation ... but type choice still affects the response - so pay attention.\n\nWe say it over and over, but we can't say it enough. Sketch your ideas (with pen and paper) new avenues will pop up, they always do. Develop the idea and go from there.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20131020082213/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "9 Jun 2009 — 3:50pm",
      "content": "visually, the green \"o\" is receding a bit, and appearing to be smaller than the black \"cresc\". I think you may need to make it a bit bigger so that it visually appears to be the same size.\n\n"
    },
    {
      "time": "10 Jun 2009 — 7:44am",
      "content": "Recently I read that blue is the new green. And considering the Earth is mostly water there is a bit of sense to that. I do agree that the mark is sterile looking, I'd like to see it morph into something more organic. To me the person and leaves don't necessarily say -energy saving -recycling -sustainable transport, they could just as easily represent a landscaper. I'm with Paul get some paper and start sketching, and a good observation by Natalie, you may want to tweak the size of the \"o\"\n\n"
    },
    {
      "time": "10 Jun 2009 — 12:53pm",
      "content": "The Honda Insight logo comes to mind.\n\n ![](http://web.archive.org/web/20131020082213im_/http:/typophile.com/files/insightlogo_6100.jpg)\n\n"
    },
    {
      "time": "13 Jun 2009 — 3:57am",
      "content": "Thanks everybody for the suggestions :)  \nhere are some sketches I made before and after posting here.\n\n ![](http://web.archive.org/web/20131020082213im_/http:/typophile.com/files/sketches1_3823.jpg)\n \n ![](http://web.archive.org/web/20131020082213im_/http:/typophile.com/files/sketches2_3979.jpg)\n  \n(No scanner, have to take pics with my 50mm, sorry]\n\nI'm finding really hard to find an effective, and possibly ''unseen'' way to convey the idea of sustainable development .  \nAs Coe said, there's a lot of ''green noise'' around, and searching in books and on the internet for inspiration isn't really helpful, it just makes you think that EVERYTHING has been already thought of. Are there really so many green companies out there? :D\n\nThe concept of my icon isn't groundbreaking, but I can't focus just in one of the areas of the project (energy/transport/recycling). the job would be easier if I could concentrate in only one of them, but I would leave the other 2 out.\n\nAnyway I tried to fix it to make it look more like a person  \nSee here: [http://img291.imageshack.us/img291/6852/picture3qea.jpg](http://web.archive.org/web/20131020082213/http:/img291.imageshack.us/img291/6852/picture3qea.jpg \"http://img291.imageshack.us/img291/6852/picture3qea.jpg\")\n\nWould you suggest to walk away from it and pursue some other idea from the sketches?  \nMaybe something more typographic as a green O / O as a leave... etc?\n\n"
    },
    {
      "time": "13 Jun 2009 — 1:19pm",
      "content": "I think it might be worthwhile to try approaching this one from a different angle. For a less corporate, more natural feel, consider doing something less geometric/rigid. Take a look at the Legacy Timber logo on [Tungsten's](http://web.archive.org/web/20131020082213/http:/www.atomic74.com/work/corporate-identity) portfolio. I think there is potential in exploring this type of stylistic route.\n\n"
    },
    {
      "time": "15 Jun 2009 — 9:38am",
      "content": " ![](http://web.archive.org/web/20131020082213im_/http:/typophile.com/files/Picture_5113.jpg)\n\nThoughts? :\\\n\n"
    },
    {
      "time": "15 Jun 2009 — 10:17am",
      "content": "Hmm, you might want to avoid evoking this (or not):  \n [http://en.wikipedia.org/wiki/BDSM\\_Emblem](http://web.archive.org/web/20131020082213/http:/en.wikipedia.org/wiki/BDSM_Emblem \"http://en.wikipedia.org/wiki/BDSM\\_Emblem\")  \n:-\\>\n\n…apart from that though: I think it's quite interesting graphically,  \nbut I get a different \"motion\" impression from it than \"growing\" –  \nit seems to be rotating clockwise in a vortex kind of way.  \nNot sure that's good/intended.\n\n"
    },
    {
      "time": "15 Jun 2009 — 10:55am",
      "content": "I've never ever seen that symbol, I'm a good guy :)  \nI don't think the resemblance is a problem - since they have extremely different targets and deal with different matters :)\n\nI know it doesn't look like it's growing from the leaves, but also I don't think that it HAS to look like it is.  \nThat was my first idea, but then playing around with other sketches I came out with this, which shows man and nature as different beings, and also as a whole - a visual metaphore for sustainable development.\n\nMakes sense?\n\nI'm sorry for my bad english, I hope you understood what I'm trying to say :)\n\n"
    },
    {
      "time": "16 Jun 2009 — 12:34pm",
      "content": "I like the new logo-- but as altaira said, I see a rotating motion... I really do like how the three green 'parts' are leaves, though.\n\nIn your sketches, I also see you have arrows on the end of the 'e' ... that's a really appealing idea to me-- perhaps you could work those in on the 'e' like in the second sketch you posted, or even have them on the 's' instead of the 'e'.\n\n--  \n\\\\\\ [FrozenAgain](http://web.archive.org/web/20131020082213/http:/frozenagain.com/) || [deviantART](http://web.archive.org/web/20131020082213/http:/frozenpandaman.deviantart.com/) //\n\n"
    },
    {
      "time": "16 Jun 2009 — 9:12pm",
      "content": "I like the concept. Very cool.\n\nI'd like to see the leaves look a little more organic, but otherwise I like it.\n\n- Lex\n\n"
    },
    {
      "time": "19 Jun 2009 — 5:19pm",
      "content": "i totally agree with frozenpandaman, the e with arrows on your sketch is very powerfull, you should also look that way.  \nBut i like the new logo anyway. i like the motion make me think of life cycles.\n\n"
    },
    {
      "time": "19 Jun 2009 — 5:34pm",
      "content": "I really like the latest logo, I think a bit of tweaking is in order with the leaves but it's a strong concept and I don't think there's anything wrong with the rotating look...recycling. I think the type should be softer and more organic...currently it isn't doing much for me.\n\n"
    },
    {
      "time": "20 Jun 2009 — 11:21am",
      "content": "I'm glad most of you liked the new logo, but unfortunately I had to submit it before June 19th so that was my entry for the school-contest.  \nAlthough I recognize that both the leaves and the type might benefit with some tweaking, so, just for design's sake, HOW would you have achieved a more organic look with the leaves, and what font(s) would you have used for the text? :-)\n\nOh, about the e with arrows... it's a concept i didn't develop because that was something I saw between the sketches of a classmates of mine for another green logo (this time a school assignment) and I would have felt like an idea-thief ;)\n\n"
    },
    {
      "time": "15 Mar 2010 — 3:15pm",
      "content": "Hi Typophiles :)  \nMy logo was awarded the first prize in the school competition, and is currently used by the Cresco no profit organization.  \nI would like to thanks all the users which contributed in making my design progress with their criticism.\n\nThis is how it looks like at the end, after a direct confrontation with the client.  \n• [http://img175.imageshack.us/img175/7505/picture3q.jpg](http://web.archive.org/web/20131020082213/http:/img175.imageshack.us/img175/7505/picture3q.jpg \"http://img175.imageshack.us/img175/7505/picture3q.jpg\")  \nDo you think the type got (at least a little bit) better?\n\nAlso, I would like to hear some suggestions about another version of the logo they asked me to design for them.  \nThe text they require is \"isola cresco\" (cresco island) and it's like a ''medal'' they would give to cities which are parts of the project.  \nThey want to retain the same graphic symbol but they were thinking of having the text running around in a circle.  \nI don't think it would work, but I dont think either that having the same symbol and a different text would work.  \nI fear it would only create confusion with the main logo, especially because on its first period.  \nWhat do you think?\n\n"
    },
    {
      "time": "15 Mar 2010 — 4:15pm",
      "content": "Congrats on the reward.\n\n"
    },
    {
      "time": "15 Mar 2010 — 4:18pm",
      "content": "\"What do you think?\"\n\nI think clients that get something for free tend to be the pickiest clients. ;o)\n\n"
    },
    {
      "time": "15 Mar 2010 — 4:29pm",
      "content": "The words are too short in order to run around the symbol in a satisfying manner.\n\n"
    },
    {
      "time": "16 Mar 2010 — 2:55pm",
      "content": "Congratulations on 'winning'.\n\nMy thoughts are it will date quite quickly (requiring an update). But...hopefully that means you get the follow up work too.\n\n"
    },
    {
      "time": "17 Mar 2010 — 8:07am",
      "content": "\"I think clients that get something for free tend to be the pickiest clients. ;o)\"\n\nAmen.\n\n"
    }
  ]
}
