{
  "id": "5886",
  "title": "Just wondering too...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anybody here use small caps, oldstyle figures and ligatures   \nas you write by hand?\n\n [‹ Lowercase a,g opinions.](http://web.archive.org/web/20081121150558/http:/www.typophile.com/node/5900 \"Go to previous forum topic\") [Slogans ›](http://web.archive.org/web/20081121150558/http:/www.typophile.com/node/5906 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121150558/http://www.typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": " 2.Aug.2004 11.36pm",
      "content": "Or.....   \n   \nDoes anybody here use italic, bold face, display or caption - as you talk?   \n   \n   \nThe Lord of The Ring\n\n"
    },
    {
      "time": " 3.Aug.2004 12.29am",
      "content": "Oy Lord of da friggin' Rings! I was being serious! ![](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/clipart/bigsmile.gif)   \n   \nNo really, I mean it: does anybody here use typographical conventions   \nin their handwriting? (I know: ligatures actually stem from handwriting,   \nbut you know what I mean.)\n\n"
    },
    {
      "time": " 3.Aug.2004 12.30am",
      "content": "I use smallcaps and ligatures when I write, but not oldstyle figures.\n\n"
    },
    {
      "time": " 3.Aug.2004 1.45am",
      "content": "I use OSF as I write, and sometime small caps and ligatures, too. Sometimes, I like to add in swash caps or alternate figures for my amusement.   \n   \nNot that my handwriting is even _remotely_ legible, mind you...\n\n"
    },
    {
      "time": " 3.Aug.2004 2.06am",
      "content": "just realised, that's the same red marker as wot wrote the 4 in the pic (just changed the colour)\n\n"
    },
    {
      "time": " 3.Aug.2004 2.54am",
      "content": "Yes as a matter of fact I just noticed this yesterday when I was filling in a form by hand. To my surprise I used Small Caps. I guess I did it so people could actually read it. My lowercase handwriting seems to be a bit messy.   \n ![:-)](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 3.Aug.2004 7.14am",
      "content": "Yes, all three.   \nOSF and ligs (proper joining really, as in Caflisch OT) all the time. But lining figures for phone numbers.   \nCaps with Small caps mainly for subheadings.\n\n"
    },
    {
      "time": " 3.Aug.2004 7.18am",
      "content": "> * * *\n> **quote:**\n> \n> But lining figures for phone numbers.\n> \n> * * *\n\nTabular or proportional?. ![:-)](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 3.Aug.2004 9.00am",
      "content": "no small caps or osf, but all my letters tend to become ligated and i started using a double storey g the other day....\n\n"
    },
    {
      "time": " 3.Aug.2004 9.25am",
      "content": "Yves: tabular when stacked.\n\n"
    },
    {
      "time": " 3.Aug.2004 9.55am",
      "content": "Never smallcaps, always lining figures (proportional, duh :-), but heavily ligated (so generally illegible). And this last bit is related to the central question:   \n   \nExactly who reads your handwriting, and how much of it?   \n   \nhhp\n\n"
    },
    {
      "time": " 3.Aug.2004 10.03am",
      "content": "acutally i think i have two modes of handwriting - my own bastard script that i use most of the time and my own formal hand that i use when i actually want people to read it. but mostly i think my scribbling are meant only for me, so it becomes a real scrawl, no fine typographic features to speak of.\n\n"
    },
    {
      "time": " 3.Aug.2004 10.12am",
      "content": "my handwriting depends heavily upon ligatures. i write very slowly and without them i would still be in grade school.\n\n"
    },
    {
      "time": " 3.Aug.2004 10.14am",
      "content": "oh and my mood dictates the style of my figures.\n\n"
    },
    {
      "time": " 3.Aug.2004 10.46am",
      "content": "If I use caps in a row at all, they tend to be outsized, as it's usually me writing a note to myself that I need to catch later. Numerals are neither lining nor traditional OSF but somewhere in between, always proportional. And the only ligature I tend to use is the \"ing\" below:   \n   \n ![handwriting](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/messages/30/41970.jpg)\n\n"
    },
    {
      "time": " 3.Aug.2004 11.05am",
      "content": "i think we need a new thread: \"show us your John Hancock \" with a panagram and a signiature...\n\n"
    },
    {
      "time": " 3.Aug.2004 11.28am",
      "content": "I use old style figures when I write, as well as small caps (though extremely inconsistent) and ligatures.   \n   \nLately I have noticed my lowercase f has become more of a florian and my double story g is getting very interesting.\n\n"
    },
    {
      "time": " 3.Aug.2004 11.42am",
      "content": "sometimes my handwriting looks like a Moscoso poster, but I'd rather not go into detail why ![:-)](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 3.Aug.2004 12.08pm",
      "content": "I've written in small caps since I was but a young lad (much to the dismay of my teachers).   \n   \nAs a consequence, I never really perfected the art of fine cursive writing (sure, I know how to do it, but practice is another matter). And ligatures never come into the picture--when I actually write in lowercase, the result can only be described as an attempt at cursive with absolutely no connections between the letters.   \n   \nI like the signature sample and panagram idea, but it could get a bit cumbersome couldn't it?\n\n"
    },
    {
      "time": " 3.Aug.2004 12.26pm",
      "content": "_it could get a bit cumbersome couldn't it?_   \ni guess so, and i dunno if that'd go over too well with the webmasters.   \n   \nconcerning cursive: i can write Russian in a very nice cursive, better than i can write block letters, but for English it's the other way around, i can't write in English in cursive without a lot of hesitation, which defeats the purpose of writing in cursive in the first place.\n\n"
    },
    {
      "time": " 3.Aug.2004 12.36pm",
      "content": "Chesh, that's a serious \"ing\" ligature.   \n   \nhhp\n\n"
    },
    {
      "time": " 3.Aug.2004 12.39pm",
      "content": "chesh you are using an \"an\" lig there. ;^\\>\n\n"
    },
    {
      "time": " 3.Aug.2004 1.02pm",
      "content": "True, Tiff -- I hadn't thought about that.   \n   \nAlso, you might say that the \"ing\" ligature is actually a \"ting\" ligature where the t bar takes off the i dot, but then I'm really spotty with i dots to begin with. But that \"ing\" shows up almost all the time in my handwriting.\n\n"
    },
    {
      "time": " 3.Aug.2004 1.43pm",
      "content": "When I do calligraphy its swashes and ligatures, no small caps. All crossword puzzels are all caps\n\n"
    },
    {
      "time": " 3.Aug.2004 1.50pm",
      "content": "My handwriting communicates to others about as well as my grunting and pointing. I do have scribleatures and shlosh caps woven into the amalgum of somewhat glyph shaped regurgitations.   \n   \nChrisL\n\n"
    },
    {
      "time": " 3.Aug.2004 6.05pm",
      "content": "i try to always use proportional figures. The rest   \nis an unruly mess of sc and lc. I have a sans titling   \nstyle, a lovely cursive for readability, and a ink-vomit   \nfreakout for little love notes to myself. All for my own   \namusement, of course.\n\n"
    },
    {
      "time": " 4.Aug.2004 6.19am",
      "content": "![caps](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/messages/30/41946.gif)\n\n"
    },
    {
      "time": " 4.Aug.2004 6.19am",
      "content": "![](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/messages/30/42008.jpg)\n\n"
    },
    {
      "time": " 4.Aug.2004 7.14am",
      "content": "And, for contrast...   \n   \n ![handsample](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/messages/30/42024.gif)\n\n"
    },
    {
      "time": " 4.Aug.2004 7.35am",
      "content": "What does your ampersand look like? I changed mine something   \nlike 10 years ago, some years after I completely overhauled my   \nhandwriting.\n\n"
    },
    {
      "time": " 4.Aug.2004 7.44am",
      "content": "I'm afraid mine looks like the \"commercial\" variety, rather than the infinitely classier \"ligature\" variety.   \n   \nI hope there are no graphologists now nodding intently at our samples here!\n\n"
    },
    {
      "time": " 4.Aug.2004 7.46am",
      "content": "\\>detail why   \n   \nReminds me of the experiment where some (very serious) scientists gave spiders varying doses of LSD and examined what their webs looked like.   \n   \nSomething like that would have made a good calligraphy event for Type High.\n\n"
    },
    {
      "time": " 4.Aug.2004 7.51am",
      "content": "Yeah, and then P22 could make Baudelaire's handwriting font.   \n   \nWhat could be done nicely at TypeCon is lettering under the influence of sleep deprivation. I actually made a font like that once.   \n   \nhhp\n\n"
    },
    {
      "time": " 4.Aug.2004 1.25pm",
      "content": "What about pens? I am looking for something   \nthat has a nib of about 1.5-2mm wide, just   \nenough to get some stroke variation. I hate   \nballpoints. What's yours?\n\n"
    },
    {
      "time": " 4.Aug.2004 1.50pm",
      "content": "As I wrote above ![:-)](http://web.archive.org/web/20081121150558im_/http:/www.typophile.com/forums/clipart/happy.gif) I almost always write with a [Rotring 1.1 Art Pen](http://web.archive.org/web/20081121150558/http:/www.chartpak.com/kohinoor/7finearts/rotring_art_pens.html).   \nIt writes incredibly smoothly, but scratches those long descenders on   \nmy \"g\"s, \"y\"s and \"f\"s so nicely into the paper. I also have a 1.9 and 2.7   \nfor calligraphy and an EF for sketching.\n\n"
    },
    {
      "time": " 4.Aug.2004 1.58pm",
      "content": "Kris, I have a [Pilot Parallel](http://web.archive.org/web/20081121150558/http:/www.scribblers.co.uk/acatalog/Pilot_Parallel_Pens.html), the 2.4mm nib. It's a good pen, easy to use (but it's a limited tool).   \n   \nRyuichi Tateno recommended me the [William Mitchell](http://web.archive.org/web/20081121150558/http:/www.scribblers.co.uk/acatalog/William_Mitchell_Round_Square_Cut_Nibs.html) pens and nibs. He said it's a very good brand.\n\n"
    },
    {
      "time": " 4.Aug.2004 3.53pm",
      "content": "First and foremost, I write only with found objects, whatever I find first, I write with.   \n:-)\n\n"
    },
    {
      "time": " 4.Aug.2004 10.43pm",
      "content": "I too love double storey g's, and find them scattered throughout my writing.   \nIt's funny, I find that I do not doodle quite as much as I used to during lectures, but I am constantly changing my style of lettering, often several times on the same page. I use a lot of s.caps as well as the occasional double storey lc A along with a lot of other funky retro style lettering. I should really scan in my notes sometime too.....\n\n"
    }
  ]
}
