{
  "id": "58888",
  "title": "My First Attempt At Design",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "So I decided to finally try my hand at designing a typeface. I don't really know what I'm doing, but I've been reading and piecing together a technique based on what I see other people doing. My ultimate goal for this project is for it not to be awful. My initial plan was to design a multi-purpose sans serif typeface that is neutral enough to be used for virtually anything, but with enough personality to not be bland.\n\nI only have capital letters A-P drawn so far, but I would like to post what I have so I can correct any obvious blunders before I get too far into it. Be critical, but be nice!\n\nThanks!\n\n ![](http://web.archive.org/web/20150414190901im_/http:/typophile.com/files/Picture3_4505.jpg)\n\n",
  "author": "Ed_Aranda",
  "time": "9 Jun 2009 — 7:21pm",
  "uid": "45027",
  "comments": [
    {
      "time": "10 Jun 2009 — 4:22am",
      "content": "Interesting. Its distinctiveness comes from its square proportions, I think.\n\nThe curves of your B are going to need more work, as the weight is pretty weak in places.\n\nThe G is giving me a strangely strong \"that's from Helvetica\" vibe, and I think it might be because a G without a spur would fit the style better.\n\n"
    },
    {
      "time": "10 Jun 2009 — 2:47pm",
      "content": "Yes, the A, M, and O are all perfectly square – the remaining letters are varying degrees of rectangular.\n\nI can see that the B isn't quite right, but I'm not sure how to go about fixing it. Do you think it doesn't have enough weight where the bowls meet?\n\n<cite>The G is giving me a strangely strong “that’s from Helvetica” vibe, and I think it might be because a G without a spur would fit the style better.</cite>\n\nGood eye. I used Helvetica's G as a visual reference. I didn't take any actual parts from it (stealing is bad), but styled mine after it. I think you're right though; it might jive better without the spur.\n\n"
    },
    {
      "time": "10 Jun 2009 — 3:09pm",
      "content": "Crossbar of E need optically correcting (upwards)\n\n"
    },
    {
      "time": "10 Jun 2009 — 8:25pm",
      "content": "B: That, but more importantly, they don't flow equally into the crossbar. You ought to be able to imagine removing either bowl and seeing that the other is continuous with the horizontal on the outside. (It won't actually be so, but when the glyph is whole it should look that way.) The top almost is, but the bottom definitely is not.\n\n"
    },
    {
      "time": "16 Jun 2009 — 12:03pm",
      "content": "The curves on the uppercase \"D\" look a little clunky, it feels as though the character has been stretched horizontally. I would bring it in a tad and reconsider the curvature. Good luck with your project.\n\n"
    }
  ]
}
