{
  "id": "58887",
  "title": "A Non-profit Type Foundry",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I've put together a [survey to start gathering feedback about the idea for a Non-profit Type Foundry.](http://web.archive.org/web/20111020180224/http:/bit.ly/nonprofittype)\n\nI've love to hear some thoughts on the idea. Here's a quick explanation:  \nOur idea is to create a non-profit type foundry that runs on donations, sponsorships, and/or grants. We'd like to release typefaces to be used freely on the web or in print. It is important to us that type designers are paid for their work, so our idea is to raise the money required to commission custom typefaces from highly skilled and respected designers.\n\nOur first goal: increase the typographic diversity on the web by providing high quality fonts to web designers free of charge. We intend the fonts to be used through methods like @font-face, SiFR, Cufon, etc...\n\nThe big difference between this idea and other websites that give away free fonts (i.e. DaFont): we believe in quality over quantity. We'd only be commissioning typefaces from top type designers. We wouldn't just be posting user submitted fonts.\n\n[link to the survey](http://web.archive.org/web/20111020180224/http:/bit.ly/nonprofittype)\n\n",
  "author": "<a href=\"/web/20111020180224/http://typophile.com/user/27718\" title=\"View user profile.\">mattmc</a>",
  "time": "<br>",
  "uid": "27718",
  "comments": [
    {
      "time": "",
      "content": "Sorry, I think for-profit foundries owned by type designers is a better idea.  \nOngoing royalties for many, rather than one-time commission for a few.  \nSo, while I appreciate that you are considering \"fair pay for fair work\", I don't think it's really fair, because you are paying a small amount to freeze type designers out of a larger amount.\n\nWhy don't you think type designers should be entitled to royalties?\n\n"
    },
    {
      "time": "",
      "content": "\"A Non-profit Type Foundry\"\n\nI thought this was going to be a post about Bitstream.\n\nOh well. ;-)\n\n"
    },
    {
      "time": "",
      "content": "Serious answer. What value would the foundry provide? The model where a corporate donor commissions type and puts it into the public domain seems to work quite well - Gnome, Google, Red Hat etc., Unless the font is named \"Obama 2012\" I doubt many individuals would be willing to donate - case in point being the poor returns enjoyed by shareware fonts during the 90's.\n\n"
    },
    {
      "time": "",
      "content": "If your goal is really to increase the diversity of fonts on the web, you’re wasting your time. One can’t produce enough fonts this way to solve the web font dilemma. At best you can just create another Verdana for people to use until they’re sick of it. Lino/Mono/WeNeedToRebrando-type allow embedding with EOT. FontShop and Font Bureau have both said that they’re actively working toward web embedding in the near future. If you really want to increase the diversity of fonts on the web it would make more sense to raise funds to develop existing font-delivery systems.\n\n"
    },
    {
      "time": "",
      "content": "The costs would be astronomical to make it worthwhile for the font designer. That's like saying you're going to commission a new software package from Adobe for a one-time fee, to be released for unlimited public consumption. Not too realistic.\n\n"
    },
    {
      "time": "",
      "content": "Well, here's one vote for \"I like the idea\".\n\nCan it be pulled off? I have no idea.\n\n"
    },
    {
      "time": "",
      "content": "I've seen some free fonts and some others that can probably be licensed or acquired for the purpose that have much to recommend them but need fixing badly for screen use. Hinting, kerning, etc.  \nIs it easier to start out with something and then improve it, as opposed to starting from scratch?  \nI pose this question to those with the technical background and expertise to answer.  \nWhat has your experience been?\n\n"
    },
    {
      "time": "",
      "content": "There is a precedent: the Greek Font Society mutated into a non-profit organisation, and has been active for some years now in that form. Note, however:  \n- the members have \"real\" day jobs;  \n- the Society has produced publications where typeface design was one constituent of the project, but not the main deliverable (a complex publication was the final object);  \n- the fonts are in the greater part carry-ons from a previous, commercial phase of the organisation, or developed within larger, funded, projects (e.g. the publication referenced above).\n\nI am happy to be corrected, but I'd be surprised if any entity publishing fonts under the Open Font License (as the GFS do) have any income worth mentioning from fonts directly. In all such cases, typefaces are the means, not the objective of the activity. For example, the SIL and the SBL both have produced admirable typefaces under an OFL or similar status; but they're linguists or scholars who need good tools, for whom well-designed typefaces make their core work better; not typeface designers who see fonts as the end product of their activity.\n\nI would argue that the people who develop typefaces under a \"Free Software\" banner fall in the same category: typefaces are a service (and an argument point, I'd add); but I wouldn't discuss this unless we can include the \"who pays your mortgage?\" question in the discussion.\n\nAt the other end, entities like Microsoft and Adobe fall into the same wide group of developers for who fonts are enabling services: \"if you can read easily off the screen, you might make my business plan more likely\" or \"I'll give you free, extended typefaces that work reliably to make the prices of our software (and its inexcusable installer) easier to stomach\". In both cases, the wide briefs and substantial development resources with which their typefaces are being developed largely negates the need for general use OFL/Free typefaces.\n\nIn my mind the SIL, and the SBL have shown that there may be room for developing on a model where the fonts do not make a profit in specific niches, with well-defined needs, where a community of users will not be serviced by the brief of the OEM typefaces, but is willing to provide, however indirectly, funds for tool development.\n\nBut for typefaces \\*outside the font-as-service niches\\*, if your design is aimed at typographers or graphic designers, there's two options if you develop for free:  \n1: your design is not good, in which case whoever uses the fonts is a fool; and  \n2: your design is good, in which case by making it freely available you devalue your own, and by association the work of other designers. Who's the fool now?\n\n"
    },
    {
      "time": "",
      "content": "_...you devalue your own, and by association the work of other designers._\n\nThat doesn't stop type designers taking OEM commissions.  \nThe bait is big enough, financially, and there is kudos attached to achieving assured rapid wide distribution for a design, rather than waiting for incremental returns on a speculative investment.\n\n"
    },
    {
      "time": "",
      "content": "<cite>\"Sorry, I think for-profit foundries owned by type designers is a better idea.<br>\nOngoing royalties for many, rather than one-time commission for a few.<br>\nSo, while I appreciate that you are considering “fair pay for fair work”, I don’t think it’s really fair, because you are paying a small amount to freeze type designers out of a larger amount.<br>\nWhy don’t you think type designers should be entitled to royalties?\"</cite>\n\nThe idea for a non-profit type foundry isn't in opposition to for-profit foundries. I have no objections to royalties for designers. This is more about just starting **one** non-profit type foundry as a way to distribute high quality free typefaces for use on the web. There is obviously a problem with font licensing and distribution for use on the web at the moment, this is one step towards trying to solve that (obviously not the full solution though)\n\nThere are plenty of for-profit type foundries that put out great work. This is just a question about whether it would be possible to do it another way.\n\n"
    },
    {
      "time": "",
      "content": "\\>This is more about just starting one non-profit type foundry…\n\nI think—as some other comments have already pointed out—that there already at least two non-profit type foundries in the world… the Greek Font Society and SIL (perhaps there are even more). There certainly is the disparate Free font community, too.\n\nYou could start the another non-profit type foundry, one with the font(s) of the highest quality, and one which does performs other activities (i.e., book production or linguistic work). But it would not be the first, or only non-profit type foundry.\n\n"
    },
    {
      "time": "",
      "content": "_I have no objections to royalties for designers._\n\nSo long as somebody else pays them :-)\n\n_There is obviously a problem with font licensing and distribution for use on the web at the moment..._\n\nIf there is, it was a problem created by the massive distribution of \"high quality free typefaces for use on the web,\" in the first place, by Microsoft.\n\nSuch a strategy is counterproductive to developing a market that makes it worthwhile for type foundries to invest in developing web fonts.\n\nSo why are you proposing more of the same?\n\n"
    },
    {
      "time": "",
      "content": "@nick shinn\n\n\\> \"If there is, it was a problem created by the massive distribution of “high quality free typefaces for use on the web,” in the first place, by Microsoft.\"\n\n\\> \"Such a strategy is counterproductive to developing a market that makes it worthwhile for type foundries to invest in developing web fonts.\"\n\nEvery once in awhile I read a post that makes me gasp in disbelief. This is one of them. Is this actually a complaint?\n\nFirst, it's fair to say that this small group of free \"web safe\" typefaces - and Apple's subsequent licensing of them for inclusion in the Mac OS - is one of the cornerstones upon which the Internet was built. Everyone has benefited. Society, me, and Nick Shinn. In fact, these typefaces are out there working hard for you right now at shinntype.com and fontshop.com. And you are complaining about this? This has hurt you? (I'm still shaking my head.)\n\nThis is like a trucker who makes his living hauling road-building materials complaining about the Interstate Highway system because the government bought their materials from somebody else.\n\nThose free typefaces helped create the avenues of distribution from which you earn an income but yet because you, too, produce typefaces you have been, in some way hurt by it?\n\nI'm sorry that the Internet has ruined your business prospects, Nick. And, in protest, I suggest you immediately remove your products from any site that uses those despicable \"free\" fonts. Just stop cooperating!\n\n"
    },
    {
      "time": "",
      "content": "Matt, I give you big props for proposing something rather than just complaining. We need more of this. The money needed however to produce something of high quality (your phase) with the designer surrendering rights and the fonts actually properly hinted - is massive. Think in terms of a new house, not a new car if you know what I'm sayin.\n\n"
    },
    {
      "time": "",
      "content": "Nick (Shinn), there doesn't seem to me any inherent incompatibility between the notions of not-for-profit and ongoing revenue, of which royalties represent one model. Matt has suggested that the font development would be funded up-front, as a paid commission, and then the fonts made freely available, but presumably the organisation would continue to raise funds for future projects. So there is a model of ongoing revenue into which a type designer might insert himself if he were so inclined. This is the same gamble that one takes licensing a font for distribution through a for-profit foundry: will the foundry do a good enough job marketing the font to actually produce the ongoing revenue stream from royalties, or would you have been better off accepting a single up-front payment?\n\nWhat disintiguishes the not-for-profit from the for-profit foundry is not the potential revenue streams per se, but who has fingers in those streams. Profit is surplus income over expenses, and if paying designers is an expense -- whether as an up-front commission payment or an ongoing percentage of income -- then profit is simply money that someone other than the designer is getting. If there are people who want to do the work of fundraising, planning, administration, etc. to produce fonts -- and to do so in a way that enables the maximum amount of money to be dedicated to the design and production of the fonts, rather than to paying dividends to shareholders -- more power to them. If they are able to generate enough funding, on an ongoing basis, to make this a reality, then they should be able to offer flexible revenue models to designers.\n\nAll that said, obviously what will determine the success of such a venture -- and the likelihood of attracting the kind of design and production quality that Matt describes -- is the robustness of the fundraising model. I don't necessarily expect Matt to reveal here what kinds of fundraising strategies he envisions, who the potential donors are, etc., but this is the sine qua non of the whole idea.\n\nAs I've said numerous times: I don't care how fonts are distributed or what the license terms are so long as there is a viable business model that ensures an income for the designers that is commensurate with his skilled labour and creative contribution.\n\n"
    },
    {
      "time": "",
      "content": "_Is this actually a complaint?_\n\nNo. It's an economic argument--and could we do without the sarcasm?\n\nFirst desktop publishing, and then the Web, were predicated on the distribution of free fonts as items which were bundled with hardware and software applications.  \nTherefore there is no mass market for fonts, even though hundreds of millions of computer users require them in order for their computers to function.\n\nIf foundries could sell fonts by the million to the non-professional market, rather than by the hundred to professionals, that would reduce prices, and enable foundries to invest in developing all sorts of web fonts with delta (size-specific) hinting.\n\nThe absence of Georgia and Verdana would not have slowed the progress of Web by much (although no Comic Sans would have been problematic), but it might have provided more opportunity for foundries to develop the variety of high quality web fonts that web designers want.\n\n"
    },
    {
      "time": "",
      "content": "John Hudson makes a very compelling argument. As long as enough money can be brought in to pay the designers what they are worth, there's no reason this couldn't work. Start looking for a CFO and some very talented accountants.\n\n"
    },
    {
      "time": "",
      "content": "@Nick Shinn\n\nBut the big question ultimately lies in the fact that, if fonts were not bundled with computers, would the average consumer bother to purchase them? I would say no, they would not. Most people don't care about fonts and probably would be happy to have the same one or two fonts on their computer if those were the only fonts they were given. Therefore, I cannot say that there would be a \"mass market\" in which foundries could sell \"hundreds of millions\" of computer fonts. Frankly, the non-professional market _doesn't care._\n\nIn fact, we would end up with the same situation we have today, only with fewer, worse options. Instead of having the usual web safe fonts, there would be only a couple of \"safe\" fonts since no one would have any sort of consistency to their computer's font collection.\n\nFurthermore, I would disagree with your statement _\"the absence of Georgia and Verdana would not have slowed the progress of Web by much.\"_ Without decent fonts designed specifically for the screen and widely distributed, the web would have been far too insufferable for the majority of people to be interested in using. I have a hard enough time reading content on the web as it is, but reading block after block of monospace fonts? It is a terrible experience (I assume only the most basic computer font was provided). As web folk know, experience is what drives the success of a website, so without that, the web may not have succeeded at all or would have been delayed more significantly (in my opinion).\n\nFinally, the biggest issue facing us right now is that of licensing. It isn't a question of a lack of high quality fonts, but being able to use them while providing foundries the degree of security they want & need. This issue would not have been resolved by not distributing fonts, but by a radical shift in thought at a very early stage —&nbsp;something I don't think would have happened even without distribution of fonts by Microsoft, Apple, Adobe and others.\n\n"
    },
    {
      "time": "",
      "content": "Aaron, it's not logical to extrapolate from the fact that certain people don't buy fonts because they've always been provided, that they never would buy if fonts hadn't been provided. Surely the opposite would be more likely?\n\nAfter all, where did the ringtone market come from?  \nAccording to your theory, the \"average consumer\" shouldn't care about ringtones, and should be quite happy with a few basic sounds.\n\nMarkets don't just exist, they emerge, as much from the efforts of manufacturers and marketers as from the desire of consumers.\n\n_...reading block after block of monospace fonts?_\n\nNo, the option to the \"quality\" of Verdana/Georgia was Arial/Times.\n\n_...even without distribution of fonts by Microsoft, Apple, Adobe and others._\n\nThat's a moot point, as those corporations set the standards for font formats.\n\n"
    },
    {
      "time": "",
      "content": "_it’s not logical to extrapolate from the fact that certain people don’t buy fonts because they’ve always been provided, that they never would buy if fonts hadn’t been provided. Surely the opposite would be more likely?_\n\nIt may just be my opinion that people wouldn't buy fonts, but I don't think you can necessarily assume that people _would_ buy fonts if they weren't provided. In fact, I think more people care about fonts _because_ of the wide availability of fonts. With more sense of choice, more consideration is made into picking a font and those who are really into font choice will get inspired to investigate further, discovering the marketplace of different options.\n\n_According to your theory, the “average consumer” shouldn’t care about ringtones, and should be quite happy with a few basic sounds._\n\nYour analogy doesn't quite hold up. Ringtones serve a very different purpose and are used in a different way. For example, it would be as if I could change every font on my computer and on the web to a particular font that I like and want to use more often. That would end up being a nightmare for developers and designers of computer software and website. It doesn't matter if I have a different chosen ringtone from you because that choice of ringtone means nothing; it is personal preference. Fonts and ringtones are not similar in any regard.\n\n_No, the option to the “quality” of Verdana/Georgia was Arial/Times._\n\nFair enough, but I still feel that for the majority of users, Arial & Times are probably good enough. A typographer or graphic designer might look at Arial & Times and feel turned off, but most people don't understand that reaction nor do they care, continuing to use the fonts as per their personal preference, financial outlay and motivation.\n\n_That’s a moot point, as those corporations set the standards for font formats._\n\nYour argument was about distribution. The fact that those corporations set the font format is moot. I was talking specifically about their role in distributing the fonts. You don't see the W3C distributing html or css, but they create the spec for how it \"should\" work.\n\nWhen one goes to send an e-mail, very few people actually make an effort to choose a specific font for the text. Most are content with the base font, whatever it may be. There are some folk, like my mom, who actually does make an effort to pick a different font from the ones provided, but if she were to pick a custom font that I did not have on my computer, what would be the point? I would just see it in the base font that is set in the mail program and the whole point of picking a personal font would be lost.\n\n"
    },
    {
      "time": "",
      "content": "@ nick shinn  \n\\>\"The absence of Georgia and Verdana would not have slowed the progress of Web by much (although no Comic Sans would have been problematic), but it might have provided more opportunity for foundries to develop the variety of high quality web fonts that web designers want.\"\n\nYou're kidding me, right? If not, we truly are living in different worlds. You mean we were all supposed to wait around?  \nTo quote Barry Goldwater, \"Sarcasm in the face of absurdity is no vice.\" (He did say that right? I dunno, my politics are slightly to the left of Che Guévara.)\n\nHere's the bottom line: If this thread was the plot of a cable TV episode, it could be summed up as: \"Idealistic college design student butts heads with jaded professionals over idea for not-for-profit foundry.\"\n\nHere's lookin' at you, kid. And good luck.\n\n"
    },
    {
      "time": "",
      "content": "This sort of feels like arguing about the first person that suggestion putting airfares online to the detriment of the travel agent industry.\n\n"
    },
    {
      "time": "",
      "content": "Aaron, human nature says: why buy something when you don't have to?  \nSo most people, including most professionals, don't buy (m)any fonts because they already have most genres covered, for free.  \nProviding a class of product for free undermines the market for those who want to sell such products.  \nThis is one reason why there is a lot of retail activity in genres that are poorly represented in font bundles--e.g. grunge and scripts.\n\n_You’re kidding me, right?_\n\nI'm explaining how Big Silicon engineered the system we have, with its lack of diversity that Matt is frustrated by, and suggesting that more of the same, i.e. free distribution of a few quality fonts, might not be the best solution.\n\n@John _so long as there is a viable business model that ensures an income for the designers that is commensurate with his skilled labour and creative contribution._\n\nThat's OK if you're the designer being rewarded. But in the big picture what happens with bundling is that a sum is paid in commission in lieu of a larger sum in royalties. Now, individually, I may choose to take the commission, but for type culture as a whole, the effect of less money in play is restrictive. As Matt says, \"We’d only be commissioning typefaces from top type designers.\" I'd like to see more money, spread around. Not just because I'm a type designer, but because I think creatives deserve points, not just fees, and that would be a better stimulus package for typography in general.\n\n_If this thread was the plot of a cable TV episode..._\n\n...your snappy prose and wiseguy posturing would be more appropriate.\n\n"
    },
    {
      "time": "",
      "content": "_Aaron, human nature says: why buy something when you don’t have to?  \nSo most people, including most professionals, don’t buy (m)any fonts because they already have most genres covered, for free.  \nProviding a class of product for free undermines the market for those who want to sell such products._\n\nThat seems a bit of a reversal from your previous statement. I mean, why do people buy ringtones if they have a perfectly good set that covers most genres for free? That market hasn't been undermined by providing free options. But we've gone over why ringtones are a bad analogy, so I'll leave it there.\n\nFrankly, I would be surprised by designers who don't buy many or any fonts and use free ones instead because the free ones, while good, may not be appropriate to a given project. If someone is using a free font on a project because it is there rather than because it is appropriate to the project, then they aren't doing their job — they are being lazy.\n\nI mean, if it was the case that all genres are covered by the free fonts, why is there even a font industry at all? The answer is because those free fonts provided in bundles are a base set and work well enough for people who don't really care anyway. For anyone who does care, there are many, many options out there in the paid field.\n\nNow, I'm not arguing for or against Matt's idea in any regard (I've been looking at font bundles as provided by computer & software manufactures). The real issue in terms of variety of fonts online is not due to the few good fonts provided in font bundles. The real problem is licensing. When the browser makers and foundries can agree on a single system that makes both of them happy, we will have our solution. Until that point, we're all just flailing in the dark trying to find answers, but the licensing issue would have been prevalent no matter if it occurred now or back when the internet was just getting started.\n\n"
    },
    {
      "time": "",
      "content": "_But we’ve gone over why ringtones are a bad analogy,_\n\nNo analogy is perfect, but it seemed to me that ringtones were a good example of a digital product that was not massively bundled in the way that fonts are, and for which a mass consumer market has consequently developed, in a way that hasn't happened for fonts.\n\n_Frankly, I would be surprised by designers who don’t buy many or any fonts and use free ones instead because the free ones, while good, may not be appropriate to a given project._\n\nI'm afraid I don't have any surveys to back this up, but I think you're a bit out of touch.\n\n_When the browser makers and foundries can agree on a single system that makes both of them happy..._\n\nI don't think the powers that be are too concerned with what foundries think. Apparently, we should be thankful for whatever business we have.\n\n"
    },
    {
      "time": "",
      "content": "I don't have extensive surveys to back up my point of view either, but in all the work I've done with creative directors, I've never been told to use Verdana, Georgia, Tahoma or any of those free fonts for any situation except when we absolutely have to.\n\nThen there is this comment by CameronWilliams:  \n  \n_Thank you both, @aaron & @frode frank, that makes perfect sense. As a matter of fact, I disable all but the necessary system fonts on my Mac while working in InDesign, Illustrator or QuarkXPress so that I don’t mistakenly use system Helvetica or Palatino, for example, while designing for print; my font menus just show the fonts I’ve chosen, from the foundries I want to use. Then I activate the set “removed sys fonts” in Suitcase Fusion when I want to get on line. It takes a little bit more time, but I feel it’s worth it, though I’m sure most people don’t want or need a font manager._\n\nI'm not saying designers buy tons of expensive fonts. I'm saying designers should pick the best font for the job and that the free ones are rarely \"the best.\" So, unless it is one of those rare cases, picking the free font amounts to design laziness.\n\nI understand you're upset with the state of the industry and the reduced number of sales, but as I said, the issue is licensing — not free fonts. When that is solved, I expect the situation to change.\n\n"
    },
    {
      "time": "",
      "content": "_\"so long as there is a viable business model that ensures an income for the designers that is commensurate with his skilled labour and creative contribution.\"_\n\nI hope that some skilled designers (including JH) could you put some numbers on this? :-)\n\nSay a non-profit foundry had a large undisclosed sum, and approached you to quote on working for them full time for 6 months. What are the absolute minimum you'd do it for, the price you'd be happy with, and the maximum price you'd charge a fat cat client?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Say a non-profit foundry had a large undisclosed sum…</cite>\n\nAnswering that question in a forum like this could be construed as a violation of the antitrust laws of the US and the EU. Please don’t ask it again.\n\n"
    },
    {
      "time": "",
      "content": "Oh, you mean you can't solicit quotes publicly? Because that would be forming a cartel?\n\n"
    },
    {
      "time": "",
      "content": "Never mind, the post's changed\n\n"
    },
    {
      "time": "",
      "content": "\"Answering that question in a forum like this could be construed as a violation of the antitrust laws of the US and the EU. Please don’t ask it again.\"\n\nThat's not true. Discussing professional service rates is not the same as collusion.\n\n"
    },
    {
      "time": "",
      "content": "@paragraph: Sorry, I think I misunderstood James in my original post and edited my initial reply; I thought it might be because it was an imaginary scenario, and perhaps because of the 'undisclosed sum' phrase. But, since aluminum suggests its not true (which I would assume....) I'll write it again:\n\nHere is a real scenario: I have $1,000,000, cash, and I've decided to stop my playboy ways for the summer - instead I want to stay in, read some books, not spend too much money, and hire someone to work for me full time for 6 months to produce an original type design as an OpenType font, licensed with the Open Font License.\n\nWhat are:\n\n1. the absolute minimum you’d do it for,\n\n2. the price you’d be happy with,\n\n3. the maximum price you’d charge if you didn't like me? :-)\n\n"
    },
    {
      "time": "",
      "content": "I'm not sure of the point of this question. In general someone wanting a font made will develop a spec, and then get quotes from various reputable vendors. Those quotes will typically be based on an hourly rate, potential for churn, etc., other factors influencing the cost might be the level of exclusivity, profile of the project and customer. A vendor may charge less to a non-profit, than a big corporation, but I can't see that adding/removing more than 10% or 15%.\n\n"
    },
    {
      "time": "",
      "content": "I think the plan is interesting, although the fee question is important. How would the non-profit foundry plan cope with this? I mean, we're not talking about a few thousand dollars/euros here...\n\nIn other words, to quote an earlier post:\n\n\\> _The money needed however to produce something of high quality (your phase) with the designer surrendering rights and the fonts actually properly hinted - is massive. Think in terms of a new house, not a new car if you know what I’m sayin._\n\n"
    },
    {
      "time": "",
      "content": "<cite>Discussing professional service rates is not the same as collusion.</cite>\n\nIn a literal sense you are correct. But antitrust cases are not always subject to literal interpretation of law or fact. That’s why the Graphic Artists Guild publishes it’s book of pricing and ethical guidelines. Unfortunately type design pricing varies so much that the GAG no longer provides estimates for it.\n\n"
    },
    {
      "time": "",
      "content": "Dave, there are various ways that you could estimate the minimum of how much a designer might charge for a specific amount of time. While typeface design is really a separate field than graphic design, graphic designer fees might be an interesting starting point.\n\nSeveral countries have graphic design organizations. Some of these organizations suggest a minimum hourly rate that designers should work under. Of course, depending on the client, the project, and the designer's level of experience plus the number of people he employs might make this price go up. German graphic designers have these sorts of guidelines. Perhaps there is a UK organization, too. Canada has a national design organization, but I don't know if has pricing guidelines. In the US, there is the AIGA. As far as I know, they don't have pricing guidelines, but they do periodic annual salary surveys. Perhaps there is a freelance yearly salary average. To guess at a US-based designer's minimum 6-month fee, you could divide that average in half.\n\nI can't say whether these fees would be accurate, but they would certainly be a start if you were looking to put a budget together. I suspect that every designer would give you a different quote if you sent out an RFP. But hey, it helps to be prepared.\n\nNote that most western nations probably have different designer fee averages. And even within large countries, there can be local variation. Designers calculating their minimum fee have to figure in the cost of living where they live, the rent and utilities for their office space, hardware costs, software costs, taxes, as possibly the salaries of any other designers that they employ. Then there are licensing fees, usage rights, etc. which may be calculated into fees as well. A designer who often licenses his work to a client exclusively for a number of years might charge you a higher rate if you want to remove possible future streams of revenue for his or her work.\n\n"
    },
    {
      "time": "",
      "content": "_I understand you’re upset with the state of the industry and the reduced number of sales,_\n\nThen you misunderstand me!  \nI don't believe this is the best of all possible worlds, but it's pretty damn good.\n\nFees:  \nType design is not like graphic design, most of which is client-specific and ephemeral.  \nA typeface is a piece of intellectual property, with the potential to realize large sums of money over a long period of time.  \nThe worst thing a type designer could do would be to surrender the rights to a typeface, being paid what appears to be a very respectable hourly rate, and subsequently discover that the face is his/her best design and he/she doesn't own any piece of it, and it becomes a classic that would have earned far more incrementally, over decades.  \nBut you know, a nice commission up front can be better than the crap-shoot of investing in a retail face that pays back incrementally, and which may never do very well anyway. I have a few solid performers, and some which work out to a dollar an hour, but at the time I thought they were brilliant.\n\n"
    },
    {
      "time": "",
      "content": "Dan makes some very good points, but more importantly I’ll reiterate Dave Berlow’s point from the last big free/open-source type thread: you need a specification for the font or fonts you want to produce. Once you have that you can start getting reliable pricing and time estimates from type designers. Having a specification and estimates will go a long way toward getting funding and other forms of assistance.\n\n"
    },
    {
      "time": "",
      "content": "@sii: Yes, an hourly rate for type design \"spot work\" would be the same kind of information I'm suggesting is relevant to this thread. Let me try and rephrase:\n\nSay, for example, that Apple's version of Bitstream Vera due out in the next Mac OS X release doesn't have its stylistic changes applied to the massive glyph coverage of DejaVu, and I wanted to hire someone to work for 6 months on merging in the glyphs in DejaVu that are missing from the Apple font and applying the stylistic changes to them. Maybe it takes 3 months, if so then great, but maybe it takes 12 months, maybe there's a delay in funding the second stretch of work, but that's okay.\n\nNow say that I want to hire someone for 6 months to make an original type design for the basic ASCII 7-bit character set. Again, maybe it takes 3 months, great, if it takes 12 months, maybe there's a delay in funding the second stretch of work, but that's okay too.\n\nIs it reasonable to expect to pay the same rate for both jobs? Why, or, why not? :-)\n\n@james puckett: Can you explain why you asked me to not discuss this? I'm still not clear on that :-)\n\n@Dan: That's a great idea. I don't know of such a UK thing, but I'm curious if you know the German rates in euros? I'm also somewhat skeptical of how much these reflect the actual market; since I know some low-key provincial graphic designers who work for €20/hour and some designers in London who work the corporate consultancy angle at €400/hour. Both do branding and marketing, but clients selling nicknacks and sportscars are quite different clients :-)\n\nTo clarify, I am talking about work with full copyright/design right/design patent/etc assignment to me. I understand that this is the norm for type design commissions, although many type designers try to persuade their commissioners to not take assignment for a cheaper price. Again, if anyone would like to state here or post the link to their standard rates with and without assignment, I'd love to see these numbers.\n\nI literally have no idea if 6 months of the time of a type designer with say a dozen published typefaces that are recognised as useful is €10,000 or €100,000. It seems clear that some guys who have an established (ie, long) career as type designers have done commissions for huge corporations and governments and earned a shitload of cash, akin to a trial lawyer or a specialist doctor. But that's the top end of the market; I'm curious what the middle and lower bounds are too.\n\n"
    },
    {
      "time": "",
      "content": "@James: _\"you need a specification for the font or fonts you want to produce.\"_ Well, yes, as that's what I'm asking about - as Sii suggests, does anyone think of the pricing in terms of a generic hourly rate for type design activity (which as Nick and Dan point out, will not be the same rate as for typography activity, or general graphic design activity, even though its the same designer) which is then adjusted up or down depending on the specification?\n\n@Nick: That's a really informative post, thanks! As you say, it is entirely up to any freelance designer if they are willing to get paid for doing type design at an \"all in\" hourly rate, and balance the risk that the work may become a classic that would have earned far more incrementally against the risk that as a retail face it may never be popular and they'll earn €1/hour over 10 years, instead of €30/hour for 6 months (I am just throwing €30/hour out there, I am not suggesting that is good or bad, since I have no idea what the price ranges can be.) So then the question is, which type designers are willing to get paid for doing type design at an \"all in\" hourly rate? And how much is that rate? :-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>Can you explain why you asked me to not discuss this? I’m still not clear on that :-)</cite>\n\nBecause a very capable antitrust lawyer has advised me that for a group of designers to discuss their fees on a web forum might be illegal or provide clients with ammunition for a lawsuit. I could drone on about it, but if you really want to know the gory details there are endless criticisms of the fuzzy/stupid nature of antitrust enforcement and prosecution in business magazines and law journals.\n\n@abattis: I don’t know how many type designers out there are charging by the hour; but I do know a few who charge a fee negotiated up front based on the extent of the work. And even if you have an hourly rate, you still don’t know how many hours it will take any particular designer to design a typeface until you can show him/her a specification. As I noted above, the fees vary so much that the Graphic Artist Guild doesn’t even provide estimates anymore.\n\n"
    },
    {
      "time": "",
      "content": "This thread includes a price range on hinting... [http://typophile.com/node/58554](http://web.archive.org/web/20111020180224/http:/typophile.com/node/58554 \"http://typophile.com/node/58554\") ... $75 to $250 an hour. Read into that what you will.\n\n"
    },
    {
      "time": "",
      "content": "There is apparently already a [Free / Libre Font Fund](http://web.archive.org/web/20111020180224/http:/www.tug.org/fonts/librefontfund.html) designed to fund open source font projects, and there are of course sites like [The Open Font Library](http://web.archive.org/web/20111020180224/http:/www.openfontlibrary.org/) and [The League of Moveable Type](http://web.archive.org/web/20111020180224/http:/www.theleagueofmoveabletype.com/) set up to distribute Free & OpenSource fonts.\n\nOther free font projects like the [Tiresias](http://web.archive.org/web/20111020180224/http:/www.tiresias.org/fonts/fonts_download.htm)™ and [Liberation](http://web.archive.org/web/20111020180224/http:/www.redhat.com/promo/fonts/)™ fonts have been funded ~ are you proposing something for more projects like those?\n\nThere are a quite a number of good free and open source fonts for non-latin scripts available which could use some professional hinting so they work better on the web. It would certainly be a great service for users of those scripts if someone could fund such work.\n\n- C\n\n"
    },
    {
      "time": "",
      "content": "I was certainly aware of The League of Moveable Type and some other sites that are distributing open source and free fonts. The difference with my proposed non-profit foundry is that the site is not for open-source fonts or open to submissions. It'd be all about raising money and commissioning type. Once we have fonts to distribute, they would not be open sourced, just free so that they can be embedded in web pages without having to worry about licensing issues.\n\nThis proposed foundry is also by no means an attack on for profit foundries or the idea that type designers should we receive royalties. I'm completely open to the possibility that this idea may just not be worth pursuing and may not be a good idea for type designers, that's why I wanted to post it here to get feedback from those who are more experienced in the world of type than myself. It's just an attempt to come up with an idea that could help to solve the problem of a lack of great fonts being used on the web. Obviously this problem isn't due to the lack of great fonts being produced, just how they are being distributed. My thought was that by taking the royalties and licensing payments out of the equation, by paying type designers up front instead, would allow for the fonts produced to be distributed quickly and easily, without getting tangled in any legal or moral issues.\n\nRealistically if this foundry were to take shape, our goal would be to contribute another Georgia or Verdana to the world. It wouldn't solve the web font problem, and I don't think we'd be able commission huge numbers of typefaces due to the very high cost. But I am certainly of the opinion that Matthew Carter's work for Microsoft in the early 90s did great things for the web. I think an attempt to contribute more great fonts like this would be a step in the right direction and at least begin to increase the typographic diversity of the web while we all try to figure out the right way to create a market for fonts on the web and distribute them in a way that makes designers, foundries, and users happy.\n\n---------------------------------------  \n [Read Between the Leading podcast](http://web.archive.org/web/20111020180224/http:/rbtl.us/)\n\n"
    },
    {
      "time": "",
      "content": "Matt, I think part of your problem is that you’re talking to the wrong people. One way or another you’ll be able to get type designers involved if you can raise the funds. I think what you really need to do is address web designers, eBook publishers, and other potential users to see what they need and would be willing to fund. Verdana and Georgia are so great because they’re excellent solutions to a pretty big problem. I think if you want to succeed, you need to really nail down a new problem that needs fixing. Typographic diversity is probably the wrong problem for you, but something far more specific might not be.\n\n"
    },
    {
      "time": "",
      "content": "_...our goal would be to contribute another Georgia or Verdana to the world._\n\nThen you would have to find some way of making your font magically appear in Windows font menus.  \nJust because a font is free, and \"quality\" (whatever that means) is no assurance that it will be of much use to anyone, and there are numerous examples of that.  \nIf you don't get a hook-up with an OEM of any size, your work will be cut out promoting your foundry and font.  \nYou could also budget for a leading brand consultant to create the foundry identity, and ad agency to promote the faces.  \nBecause you will be running a business competing with commercial marketers, and won't be able to utilize commercial font distribution channels. In that case, being free might even work against getting the font distributed.  \nDon't let me discourage you, I'm just pointing out that there's a lot more work involved in your project than you anticipate.  \nMany people get started by diving into type culture/business pro bono, but it's hard to keep up that pace of philanthropy for longer than 18 months, and fundraising is in itself a business sector with its own competitive culture.\n\n_what you really need to do is address web designers, eBook publishers, and other potential users to see what they need and would be willing to fund._\n\nRight off the bat, there's a burden commercial foundries don't have. We just throw it on the market and see if it sells!\n\n"
    },
    {
      "time": "",
      "content": "@mattmc: _\"We’d like to release typefaces to be used freely on the web or in print.\" ... \"the site is not for open-source fonts\"_ So when you say \"to be used freely,\" you intend to say, \"to be redistributed freely but not modified.\" I'd like to suggest that the free and open source community has established \"to be used freely\" as meaning \"to be redistributed and modified\" - which is why people are assuming you mean raising funds to pay type designers to create fonts published under the the SIL Open Font License, like the GFS.\n\nThanks for clarifying that you weren't intending to publish libre fonts :-)\n\n"
    }
  ]
}
