{
  "id": "58912",
  "title": "Analog Source: Letterpress in an American Design Education",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20100103123354/http:/typophile.com/user/108 \"View user profile.\") : 10.Jun.2009 2.56pm \n\n\\* An illustrated talk at St Bride Library  \n\\* Tuesday 30 June 2009 at 7pm  \n\\* In the Bridewell Hall, St Bride Foundation  \n\\* Admission £7 · concessions £5 · Friends of St Bride £3  \n\\* Pay on the door\n\nMany examples of student work from the Visual Communications Program at the University of Delaware are intended to insight a lively conversation about the value of letterpress in contemporary design education. Ashley John Pigford and William Deering will speak about the Raven Press at the University of Delaware as a place of unbridled experimentation and phenomenological education.\n\nProfessor Ashley John Pigford is an artist, designer, musician and educator who works across a wide range of art and design media including video, sound, installation, performance, sculpture, micro-electronics and letterpress. His current employment as Assistant Professor of Visual Communications and Co-director of Raven Press at the University of Delaware is paired with an active art/design studio practice. Ashley received his MFA in Graphic Design from the Rhode Island School of Design in 2006 after a successful career as a proprietor of graphic design in Los Angeles, CA.\n\nProfessor William Deering is the coordinator of the Visual Communications program, teaches photographic design, Co-directs the letter press facility Raven Press and the London Study abroad program in the Department of Art, University of Delaware. His many awards over the past 30 years have included: The American Institute of Graphic Arts, The Art Directors Club of New York, Communication Arts, Print, The One Club, and the Society of Publication Designers.\n\n. . . . . . . .\n\nStay up to date with our events feed  \n [http://stbride.org/events/events.rss](http://web.archive.org/web/20100103123354/http:/stbride.org/events/events.rss \"http://stbride.org/events/events.rss\")\n\nView event photos  \n [http://www.flickr.com/photos/friendsofstbridelibrary](http://web.archive.org/web/20100103123354/http:/www.flickr.com/photos/friendsofstbridelibrary \"http://www.flickr.com/photos/friendsofstbridelibrary\")\n\nGet event reminder tweets  \n [http://twitter.com/stbridelibrary](http://web.archive.org/web/20100103123354/http:/twitter.com/stbridelibrary \"http://twitter.com/stbridelibrary\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103123354/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 10.Jun.2009 2.56pm",
  "uid": "108",
  "comments": [

  ]
}
