{
  "id": "58916",
  "title": "Grotesque Font listed as 'Ribbon'",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hey all,\n\nI was browsing some site for nice house numbering and stumbled upon this one font. It was listed among fonts like Avant Garde Gothic, Futura, etc for house numbering. All other fonts seemed real and this one was listed as \"Ribbon\". Does anyone know of the existence of this font or what it may really be called?\n\n| Attachment | Size |\n| --- | --- |\n| [ribbon-font.gif](http://web.archive.org/web/20150424023519/http:/typophile.com/files/ribbon-font.gif) | 15.27 KB |\n\n",
  "author": "tylor.reimer",
  "time": "10 Jun 2009 — 5:56pm",
  "uid": "25880",
  "comments": [
    {
      "time": "13 Jun 2009 — 6:16pm",
      "content": "Never heard of Ribbon. What your sample shows looks like Futura with a new G and R. Another font with a similar structure is [Foundry Sterling](http://web.archive.org/web/20150424023519/http:/www.foundrytypes.co.uk/foundry_sterling/sterling_book.html). Only the numerals are an obvious mismatch, although details of the font are not exact either, on closer inspection.\n\nI think in past discussions we had noted that there are times when an 'unimaginative' (to be polite) foundry has altered a few letters from a familiar design, thereby creating a 'new' typeface. In my opinion, \"Ribbon\" began life as Futura and had a few of its letters replaced.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "20 Dec 2013 — 3:09am",
      "content": "Actually...Remember that you were browsing sign making fonts—characters that exist in three dimensions. While it _is_ a bastardization of Futura, it's one that goes back to the 50s. Dimensional letters exist in, well, three dimensions—not in pixels or on paper—and so there is the X and the Y that graphic designers are used to, but there's also a Z. Most letters are relatively thin compared to the width of the stroke, but Ribbon is a thin stroke, so the _depth_ is actually greater than the width. The letter O is actually a cylinder, and the letter S looks like, well, a ribbon. This is exaggerated by the \"alternate\" of Deep Ribbon, where the width of the stroke may be .5\", but the depth may be 2\", vs. maybe 1.25\" in in regular Ribbon. These letters are produced by Gemini Signs & Letters, and were particularly popular with architects in the Mad Men days of yore.\n\n"
    }
  ]
}
