{
  "id": "58939",
  "title": "CSS font stacks article",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A bunch of years to late, but still: Here's my article on CSS font stacks.  \nI'd love your opinions on it. I'm not a native English speaker, so please correct my language.\n\n| Attachment | Size |\n| --- | --- |\n| [font\\_stack\\_article.pdf](http://web.archive.org/web/20131021000803/http:/typophile.com/files/font_stack_article_0.pdf) | 127.15 KB |\n\n",
  "author": "Frode Bo Helland",
  "time": "11 Jun 2009 — 9:49am",
  "uid": "17101",
  "comments": [
    {
      "time": "11 Jun 2009 — 10:23am",
      "content": "Good work! You're providing a really good summary of what fonts are available where and multiple different options for font-stacks. The one thing I would really like to see are examples of the fonts in titling and body copy, since some stacks sit better in one or the other.\n\nOne of the things that I have noticed with these font stacks are that the fonts often set wider or heavier than one another, even at the same font size, so being able to predict those differences would be useful. Here are some more sites that I've found useful:\n\n[http://www.sitepoint.com/article/eight-definitive-font-stacks/](http://web.archive.org/web/20131021000803/http:/www.sitepoint.com/article/eight-definitive-font-stacks/ \"http://www.sitepoint.com/article/eight-definitive-font-stacks/\")\n\n[http://unitinteractive.com/blog/2008/06/26/better-css-font-stacks/](http://web.archive.org/web/20131021000803/http:/unitinteractive.com/blog/2008/06/26/better-css-font-stacks/ \"http://unitinteractive.com/blog/2008/06/26/better-css-font-stacks/\")\n\n[http://unitinteractive.com/blog/blog-images/BetterFontStacks.pdf](http://web.archive.org/web/20131021000803/http:/unitinteractive.com/blog/blog-images/BetterFontStacks.pdf \"http://unitinteractive.com/blog/blog-images/BetterFontStacks.pdf\")\n\nBut overall, it looks good!\n\n"
    },
    {
      "time": "11 Jun 2009 — 10:30am",
      "content": "Oh, and also something fun. Apparently Firefox 3.5's implementation of @font-face also makes use of the idea of stacks to help save on page weight:\n\n[http://hacks.mozilla.org/2009/06/beautiful-fonts-with-font-face/](http://web.archive.org/web/20131021000803/http:/hacks.mozilla.org/2009/06/beautiful-fonts-with-font-face/ \"http://hacks.mozilla.org/2009/06/beautiful-fonts-with-font-face/\")\n\nInteresting to consider!\n\n"
    },
    {
      "time": "11 Jun 2009 — 10:32am",
      "content": "Hi Aaron. I intend something like that to be the follow-up. Hopefully a few different text sizes (9-12 px) with a display size (24px). It'll take a lot of work, especially with the Linux fonts.\n\n"
    },
    {
      "time": "11 Jun 2009 — 11:47am",
      "content": "Font names in CSS declarations must be enclosed in quotation marks if they include a space character, hence `font-family: Franklin Gothic` is illegal (though browsers quite likely would accept it and do what you intended).\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20131021000803/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "11 Jun 2009 — 1:19pm",
      "content": "Thank you Joe. I'll make sure to fix that up for the final version.\n\n"
    },
    {
      "time": "11 Jun 2009 — 2:19pm",
      "content": "Shouldn't that be inch marks, btw?\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:30pm",
      "content": "If you can spare a few minutes to help me out with some screen shots of the html files listed in the adress below, I will be very grateful. I need screen shots from different web browsers and platforms to see how the fonts appear. Fonts not installed on your system will display as a monospaced font.\n\n[http://www.frodehelland.com/css\\_font\\_stacks](http://web.archive.org/web/20131021000803/http:/www.frodehelland.com/css_font_stacks \"http://www.frodehelland.com/css\\_font\\_stacks\")\n\nMail me at: frodefrodefrode (at) gmail.com\n\nThanks!\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:52pm",
      "content": "I don't guess you need another OSX/Firefox user's screenshots…\n\nYou might want to use one of those screenshot factories, like browsershots.org. That way you can quickly get comprehensive coverage of a ton of OS/browser configurations. I use such sites quite extensively for testing web designs FWIW.\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:55pm",
      "content": "I need the screenshots from computers where the actual fonts are installed, doesn't I?\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:58pm",
      "content": "Oh, I thought you wanted to get a reasonably large sampling to see how likely all these fonts are to be installed on which browser/platform?\n\n"
    },
    {
      "time": "11 Jun 2009 — 6:05pm",
      "content": "I am getting a lot of Courier, probably because I run FEX and only activate the fonts I need ...\n\n"
    },
    {
      "time": "12 Jun 2009 — 5:17am",
      "content": "Maybe I didn't explain good enough. Doing a survey on typophile would never reflect the fonts available to the rest of the world :) I'm trying to get samples of the fonts (and how they look with different rendering) to accompany my article.\n\n"
    },
    {
      "time": "12 Jun 2009 — 6:15am",
      "content": "I'm guessing you don't want a bunch of screenshots in which nearly everything is displayed in Lucida Grande because I don't keep any, except the most essential or basic, of those system fonts loaded, right?\n\n"
    },
    {
      "time": "12 Jun 2009 — 6:24am",
      "content": "Have no use for those :) I have screenshots from Firefox and Safari running on OSX, I guess Windows won't be a big problem. Linux on the other hand.\n\n"
    },
    {
      "time": "12 Jun 2009 — 6:30am",
      "content": "Sorry Frode, then I did indeed misunderstand you.  \nI've only got OSX (and emulated Windows) :-\\\n\n"
    },
    {
      "time": "12 Jun 2009 — 8:15am",
      "content": "Just sent the shots from IE7, running on a real Windows XP machine.\n\nMy home system is a few years older, perhaps I can find a few minutes to check if they are the same over there.\n\n"
    },
    {
      "time": "12 Jun 2009 — 8:33am",
      "content": "Thanks a lot!\n\n"
    },
    {
      "time": "13 Jun 2009 — 11:49am",
      "content": "Great work! this is something i am too lazy to make on my own, but always have missed... The article is excellent.\n\nBra jobba!!\n\nAlex\n\n/////////////////////////  \n [www.alexanderfjelldal.net](http://web.archive.org/web/20131021000803/http:/www.alexanderfjelldal.net/ \"www.alexanderfjelldal.net\")\n\n"
    },
    {
      "time": "13 Jun 2009 — 12:03pm",
      "content": "Takk Alexander!\n\n"
    },
    {
      "time": "14 Jun 2009 — 3:19pm",
      "content": "Any of ye old crabs sport Microsoft Office 08 (OSX or Windows)?\n\n"
    },
    {
      "time": "15 Jun 2009 — 5:54am",
      "content": "Frode\n\nThere are some mistakes in your text. I have identified and corrected the following:\n\nWeb browsers depend on the users' own\n\na list of typefaces where one takes over where the previous failed\n\nsame way we use them in print is on its way\n\n"
    },
    {
      "time": "15 Jun 2009 — 6:36am",
      "content": "Thanks Don. I've already corrected the top two. I'll look into the last one.\n\n"
    },
    {
      "time": "17 Jun 2009 — 4:53pm",
      "content": "Hi guys. I've been able to get hold of samples from Safari/Firefox in OSX (including the Microsoft Office 08 fonts), Firefox in Windows (with Cleartype) and to some extent Firefox on a Linux machine (still missing some fonts).\n\nI'm still trying to get hold of these:\n\n• Samples from earlier Safari editions (on Windows). It uses it's own rendering engine. Does any of you have it running?\n\n• I also need samples from Windows (Firefox or IE) without Cleartype.\n\nThank you for all the help so far!\n\n"
    }
  ]
}
