{
  "id": "58935",
  "title": "Palm Pre Launches with System Fonts by Font Bureau",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "June 10, 2009 - Boston.\n\n_The Palm® Pre™ is already selling out — after great reviews. The revolutionary new user interface is enhanced by new fonts from the Font Bureau._\n\nThis past weekend’s notable release of the [Palm Pre](http://web.archive.org/web/20140714083750/http:/www.palm.com/us/products/phones/pre/index.html) also saw the debut of custom fonts developed especially for the Pre by the Font Bureau.\n\nTo build a unique visual experience for the Pre user, Palm commissioned a suite of fonts from the [Font Bureau](http://web.archive.org/web/20140714083750/http:/www.fontbureau.com/), a type foundry noted for its many custom designs for major publications and corporations. The fonts, named Prelude, were designed by Font Bureau co-founder [David Berlow](http://web.archive.org/web/20140714083750/http:/www.fontbureau.com/people/DavidBerlow), who has also developed fonts for Microsoft and Apple.\n\nPrelude is an original sans serif design of simple, generous letterforms which provide a clear, comfortable, and inviting experience for navigation and readability. A family of six fonts was developed for the Palm Pre. A related set of fonts, named Apres, which are tuned specifically for use in print and marketing, were also developed by Berlow and the Font Bureau.\n\nNoted publication designer and consultant [Roger Black](http://web.archive.org/web/20140714083750/http:/www.rogerblack.com/about/), of Roger Black Studio, Inc., consulted with [Matías Duarte](http://web.archive.org/web/20140714083750/http:/blog.palm.com/palm/2009/06/-mat%C3%ADas-duarte-that-design-hippie.html), Peter Skillman, and the Palm team on the project. When it came time to select typefaces for the Palm user interface, as well as the web and print branding, Black suggested developing custom solutions with Berlow, a long-time collaborator.\n\n“David Berlow has worked on the fonts for all kinds of screen and print uses,” said Black. “It makes sense that Palm turned to him for the fonts for their potentially revolutionary operating system, webOS™.\n\n“As the name suggests, the Palm’s webOS is based on web standards. With David’s unrivaled understanding of these standards, and Palm’s dedication to a high quality solution, the Pre is able to deliver an obvious improvement in readability — as well as bringing a consistent and stylish visual experience to the user.”\n\nIn his [review](http://web.archive.org/web/20140714083750/http:/www.engadget.com/2009/06/03/palm-pre-review-part-1-hardware-webos-user-interface/) for Engadget.com, Joshua Topolsky noted, “The selection of fonts and font styling, use of transparencies, unified look of all of the elements, smooth transitions, and detailed application icons tie together in a really elegant way.”\n\n&nbsp;\n\n ![](http://web.archive.org/web/20140714083750im_/http:/typophile.com/files/FBNews-PalmPre-screens_3697.gif)\n  \n\n ![](http://web.archive.org/web/20140714083750im_/http:/typophile.com/files/FBNews-Prelude-styles_3960.gif)\n\n&nbsp;  \n**About Font Bureau**  \nFont Bureau was founded in 1989 by noted publications designer and consultant Roger Black and type designer David Berlow to serve the emerging needs of microcomputer-based magazine and newspaper publishers seeking unique typographic identities. During the past 20 years, Font Bureau has designed more than 1,500 fonts for more than 300 publications, many of which have become part of Font Bureau’s [Retail Library](http://web.archive.org/web/20140714083750/http:/www.fontbureau.com/fonts/).\n\nContact:  \nMary Louise Marino, Marketing Coordinator  \n [mlmarino@fontbureau.com](mailto:mlmarino@fontbureau.com)\n\nThe Font Bureau, Inc.  \n50 Melcher Street, Suite #2  \nBoston, MA 02210\n\nPhone: (617) 423-8770  \nFax: (617) 423-8771  \n [http://www.fontbureau.com](http://web.archive.org/web/20140714083750/http:/www.fontbureau.com/)\n\n",
  "author": "kentlew",
  "time": "11 Jun 2009 — 7:28am",
  "uid": "1215",
  "comments": [

  ]
}
