{
  "id": "58945",
  "title": "Comic Sans... in 1978!?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This originally popped up on The Heads of State's [Twitter feed](http://web.archive.org/web/20140909110238/http:/twitter.com/theheadsofstate) yesterday.\n\nChristies is currently auctioning [this \"1978\" Sex Pistols flyer](http://web.archive.org/web/20140909110238/http:/www.christies.com/LotFinder/lot_details.aspx?pos=2&intObjectID=5215215&sid=). But a closer look reveals what looks an awful lot like Comic Sans, released in 1994.\n\n ![](http://web.archive.org/web/20140909110238im_/http:/typophile.com/files/screenshot_01_5604.jpg)\n\nSo, is the flyer a fake? Or was Comic Sans drawn from an older face? And not to get all \"Type I.D. Board\" or anything, but do any other letters here seem out of place for 1978?\n\n",
  "author": "M.A.S.",
  "time": "11 Jun 2009 — 10:40am",
  "uid": "30286",
  "comments": [
    {
      "time": "11 Jun 2009 — 10:55am",
      "content": "Comic sans was drawn from letting in Frank Miller comics from the 1980s. I’m guessing that Christies did a bad job authenticating the flyer, you might want to let them know.\n\n"
    },
    {
      "time": "11 Jun 2009 — 11:05am",
      "content": "[Here](http://web.archive.org/web/20140909110238/http:/www.youtube.com/watch?v=qefD5YHPeEM) Vincent Connare says he drew Comic Sans from the letters in D.C. Comics' Watchmen. Which, like you said, was lettered by Dave Gibbons in the 80's. Obviously too late to appear on this flyer.\n\nThough it looks exactly like Comic Sans, is it outside the realm of possibilities that the word \"land\" was snipped from from something Dave Gibbons lettered in the 70's? If another post-1978 typeface could be identified from the flyer, it'd be easier to call shenanigans.\n\n"
    },
    {
      "time": "11 Jun 2009 — 11:05am",
      "content": "It reminds me of when Phil Spector (pre-felon) successfully sued George Harrison (post-Beatle) for plagiarizing the melody of _He’s So Fine_ to write _My Sweet Lord_. Like Comic Sans, the creative work was so primitive, it was inevitable that two people would invent it independently.\n\n"
    },
    {
      "time": "11 Jun 2009 — 11:05am",
      "content": "[http://en.wikipedia.org/wiki/Algerian\\_(typeface)](http://web.archive.org/web/20140909110238/http:/en.wikipedia.org/wiki/Algerian_(typeface))\n\n"
    },
    {
      "time": "11 Jun 2009 — 11:39am",
      "content": "I don't have an ID but that rounded sans t in \"Pistols\" looks anachronistic to my eye, too.\n\n"
    },
    {
      "time": "11 Jun 2009 — 1:10pm",
      "content": "_is it outside the realm of possibilities that the word “land” was snipped from from something Dave Gibbons lettered in the 70’s?_\n\nI would say so. The text is exactly like Comic Sans, even down to metrics--spacing and alignment! If it were taken from lettering, even by the source artist of Comic Sans, it's unlikely that any four letters would correspond exactly to how they ended up in the font.\n\n"
    },
    {
      "time": "11 Jun 2009 — 1:20pm",
      "content": "it's also strange that \"LAND\" is the only part of the flier that isn't made of individual letters... hmm\n\n"
    },
    {
      "time": "11 Jun 2009 — 1:23pm",
      "content": "Good call, Michael!  \nYou deserve the Thomas Phinney Award for forensic typography.\n\n"
    },
    {
      "time": "11 Jun 2009 — 2:17pm",
      "content": "<cite>Good call, Michael!<br>\nYou deserve the Thomas Phinney Award for forensic typography.</cite>\n\nHaha. Please, full credit goes to [The Heads of State](http://web.archive.org/web/20140909110238/http:/www.typophile.com/wiki/https%3A/%252Fwww.theheadsofstate.com).\n\nMe, I'm going into typographically-correct document forgery. Beats looking for appearances of the word \"land\" in Gibbons' pre-1978 work:\n\n ![](http://web.archive.org/web/20140909110238im_/http:/typophile.com/files/CC-10_6039.jpg)\n\n"
    },
    {
      "time": "11 Jun 2009 — 2:18pm",
      "content": "Haha, nice. You might want to let them know about this. I guess someone is going to get embarrassed at Christies?\n\n"
    },
    {
      "time": "11 Jun 2009 — 3:47pm",
      "content": "I forwarded this thread to Christies and simply told them it might be worth investigating. The response came quickly; they agreed that Comic Sans is \"astonishingly similar\" to the typeface in the flyer and, for that reason, have decided to remove said flyer from the auction.\n\n"
    },
    {
      "time": "11 Jun 2009 — 4:10pm",
      "content": "They should also take a look at the \"E\" in \"England\" looks, as Eric pointed out, rather like the font Algerian, created in 1988.\n\nOops!\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:29pm",
      "content": "It's also got Americana Extra Bold (1965?) and Copperplate Gothic (1905?), but that doesn't help.\n\n"
    },
    {
      "time": "11 Jun 2009 — 5:45pm",
      "content": "While we're at it.\n\nWhen I was around ten, I was a serious University Roman geek. The E in Texas looks to me like it's University Roman regular of bold which has been emboldened by adding a stroke with square corners. The S in Sex Pistols looks like University Roman Bold but I think it's University Roman Regular slightly scaled with a fake bold effect . . . because it thickens in the wrong spots.\n\n"
    },
    {
      "time": "11 Jun 2009 — 7:19pm",
      "content": "Pick up a copy of Watchmen, guys. I can't believe you can look at Comic Sans and say it might be Dave Gibbons' lettering. Connare's story may be technically true, in that it served as inspiration for a rush job by someone who had never seriously examined comic-book lettering before, but to say it was actually \"based on\" or \"drawn from\" the lettering in Watchmen is just silly.\n\n"
    },
    {
      "time": "11 Jun 2009 — 8:22pm",
      "content": "<cite>to say it was actually “based on” or “drawn from” the lettering in Watchmen is just silly.</cite>\n\nIt may have been a rush job, but Connare (i.e. the creator of Comic Sans) says, \"I pretty much referenced the Watchman. And I was trying to copy the letter forms. And these are all hand drawn, so all the letters are different. I just drew them out very quickly.\" To me, that says \"Comic Sans is based on the lettering in Watchmen.\" It's a valid statement, regardless of whether or not he did a good job at making a digital version of Gibbons' handwriting.\n\nAnd maybe I'm just not a sufficiently discriminatory comic-book-lettering aficionado, but I looked at samples from Watchmen. I looked at Comic Sans. I believe the designer's story that he based Comic Sans on the lettering in Watchmen.\n\n_Edit:_ I think I may have misunderstood. It is absurd to say that the \"LAND\" in the flyer could be Dave Gibbons' lettering. It's a point-perfect specimen of Comic Sans. But I don't think it's absurd to say that Comic Sans is based on Dave Gibbons' lettering.\n\n"
    },
    {
      "time": "11 Jun 2009 — 10:04pm",
      "content": "Even if it weren't fake, it's a shite knock-off of Jamie Reid.\n\n"
    },
    {
      "time": "12 Jun 2009 — 12:32am",
      "content": "Mmmh... There is some idea here. Let's create the International Typographic Evidence Analysis Task Force.\n\ndr\n\n"
    },
    {
      "time": "12 Jun 2009 — 2:03am",
      "content": "Making type by EXACTLY copying is unethical and illegal in Europe. So Comic Sans was inspired by but not copied from Watchmen. It was made to be different and unique.\n\n"
    },
    {
      "time": "12 Jun 2009 — 2:13am",
      "content": "@Vince: Why is it illegal in \\_Europe\\_? :-)\n\n"
    },
    {
      "time": "12 Jun 2009 — 4:27am",
      "content": "@ abattis - Because type design (not just the bits but the actual shapes) can be copyrighted in Europe while here in the States the design can not (one can't copyright letters according to the law) but one can copyright the font file because it's a \"program\". Or something to that effect.\n\n"
    },
    {
      "time": "12 Jun 2009 — 4:30am",
      "content": "Because copying a type design is Illegal like copying a song, the original work is protected. Monotype had to go to court to show how Arial is not exactly the same, letter for letter, as Helvetica.\n\nUS law doesn't not protect the design only the name. American Cowboys can copy at will and they do, mostly.\n\n"
    },
    {
      "time": "12 Jun 2009 — 8:28am",
      "content": "\\> _It is absurd to say that the “LAND” in the flyer could be Dave Gibbons’ lettering. It’s a point-perfect specimen of Comic Sans. But I don’t think it’s absurd to say that Comic Sans is based on Dave Gibbons’ lettering._\n\nI agree, I've overlayed Comic Sans on that 'LAND' piece, and it's an exact match. You don't even need to adjust letterspacing or anything.\n\n"
    },
    {
      "time": "12 Jun 2009 — 10:06am",
      "content": "you guys are amazing... this is such a cool post and so awesome that type identification can be used this way.\n\n"
    },
    {
      "time": "14 Jun 2009 — 4:55am",
      "content": "I agree with Natalie. When I saw the title of this post I was afraid I had to reevaluate my appreciation for the sex pistols (because I simply can't stand Comic Sans). Luckily for me the blame goes to some schmuck at Christies ;-)  \nI also like the idea of a 'Type scene investigation' force!  \nInteresting facts about copyright laws in Europe & the USA as well. Great read!\n\n"
    },
    {
      "time": "15 Jun 2009 — 12:14am",
      "content": "Oh, cool. Sorry I missed this. Y'all don't need me to sort out these sorts o' things, though.\n\nI would have read this thread Thursday, but ironically I was busy that night looking at a (different) dubious document. Then travelling on the weekend. My case was much less interesting, though.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "25 Jun 2009 — 10:23am",
      "content": "I find it borderly idiotic to make comments about finding inspiration on actual good work (Gibbons lettering is great) to produce crappy mediocre work. Scratch that, not borderly idiotic, truly stupid.\n\n--  \n<cite>There must be some way out of here...</cite>\n\n"
    },
    {
      "time": "25 Jun 2009 — 10:52am",
      "content": "So only those things (such as fonts) deemed to be of a certain quality (by a panel of experts?) are allowed to cite their inspiration?\n\n"
    },
    {
      "time": "25 Jun 2009 — 12:10pm",
      "content": "Could it make it on the air?\n\n ![](http://web.archive.org/web/20140909110238im_/http:/typophile.com/files/00006342-047201_5022.jpg)\n\n"
    },
    {
      "time": "25 Jun 2009 — 12:27pm",
      "content": "Would probably need a hot graphologist.\n\n"
    },
    {
      "time": "25 Jun 2009 — 4:09pm",
      "content": "<cite>So only those things (such as fonts) deemed to be of a certain quality (by a panel of experts?) are allowed to cite their inspiration?</cite> **sii**\n\nNo, but don't tell me he doesn't sound like he's trying to validate his work citing it's inspiration.\n\nRight now, for me... sounds like that.\n\n--  \n<cite>There must be some way out of here...</cite>\n\n"
    },
    {
      "time": "25 Jun 2009 — 4:15pm",
      "content": "_No, but don’t tell me he doesn’t sound like he’s trying to validate his work citing it’s inspiration._\n\nAt least he's saying where he took his inspiration rather than just saying he created it from scratch or it being \"completely original\" or such. Whether or not the final piece is strong is irrelevant.\n\n"
    },
    {
      "time": "26 Jun 2009 — 9:28pm",
      "content": "The dials on my time machine are labeled in CS.\n\n-=®=-\n\n"
    },
    {
      "time": "7 Jul 2009 — 11:05pm",
      "content": "For the record, Tom Orzechowski is my all time favorite comic book lettering artist.\n\nI first saw his work back in 1977 - in the official Star Wars comic book - incredible use of nibs, caught my eye even back then. And I saw his work few years back, updating and drawing text/sound FX for English translations of manga comics (strangely enough, it was a Manga version of Star Wars where he made these incredible SCREAMS for the Tie Fighters).\n\nHis bio: [http://en.wikipedia.org/wiki/Tom\\_Orzechowski](http://web.archive.org/web/20140909110238/http:/en.wikipedia.org/wiki/Tom_Orzechowski \"http://en.wikipedia.org/wiki/Tom\\_Orzechowski\")  \nand  \nhis site: [http://serifsup.com](http://web.archive.org/web/20140909110238/http:/serifsup.com/ \"http://serifsup.com\")\n\nJust had to say so. (This is somewhat on topic, right?) ;)\n\nsteve mehallo  \ntinyurl.com/mehallofonts  \nmehallo.com\n\n"
    }
  ]
}
