{
  "id": "58969",
  "title": "Strobe",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "[Strobe PDF](http://web.archive.org/web/20150414192711/http:/www.syxra.cz/temp/Strobe-Sheet-2-5.pdf)\n\n| Attachment | Size |\n| --- | --- |\n| [strobe.jpg](http://web.archive.org/web/20150414192711/http:/typophile.com/files/strobe.jpg) | 991.67 KB |\n\n",
  "author": "suculent",
  "time": "12 Jun 2009 — 6:55am",
  "uid": "45355",
  "comments": [
    {
      "time": "12 Jun 2009 — 8:24am",
      "content": "I don't think the 'g' is working. Maybe go for a non-binocular 'g'?\n\n[edit]  \nWhy aren't the descenders equal in length?\n\n"
    },
    {
      "time": "12 Jun 2009 — 8:53am",
      "content": "Nice design. The tall numerals are a neat idea.\n\nI like the g, but I'm always the one who likes a distinctive g when nobody else does.\n\nThe s looks upside-down. I'd extend the lower left end some.\n\nThe way the N dips below the baseline works fine in the full capital but is too exaggerated in small caps.\n\nThe question mark doesn't really seem to fit the face.\n\n"
    },
    {
      "time": "15 Jun 2009 — 4:06am",
      "content": "[http://www.syxra.cz/temp/Strobe-Sheet.pdf](http://web.archive.org/web/20150414192711/http:/www.syxra.cz/temp/Strobe-Sheet.pdf)\n\nThanks for the comments, here is next version with mostly all of them incorporated. I was saving this g for cursive version .o)\n\n"
    },
    {
      "time": "20 Jun 2009 — 10:00am",
      "content": "Have you tried the new 'g' with the same top-right part as the 'q'? I mean with the little pointy-thingy. ;)\n\n"
    },
    {
      "time": "24 Jun 2009 — 2:18am",
      "content": "Not yet, but I will certainly do, as soon as I'll get back to this typeface. .o) It seems like wise idea...\n\n"
    },
    {
      "time": "26 Jun 2009 — 11:01am",
      "content": "Well. All the time, I'm surprised that nobody commented width of capitals. Are not they too narrow? I am starting to feel it like this, after couple days...\n\n"
    },
    {
      "time": "26 Jun 2009 — 1:01pm",
      "content": "Well, there are very few comments to begin with. The crit-boards are rather quiet lately.\n\n"
    },
    {
      "time": "27 Jun 2009 — 11:48am",
      "content": "V X Y are too narrow, and some like C D H could stand to be widened slightly, but no, I don't think the capitals in general are too narrow.\n\n"
    },
    {
      "time": "29 Jun 2009 — 1:09am",
      "content": "Thanks for your precious opinions, I will surely incorporate that. Although I'm working with typefaces over 15 years, it's still quite hard for me to come with constructive critique.\n\nThe floating descenders were rather an artist's wish than a typographer's choice. Clearly a mistake as well as the VXYCDH width..., however the biggest issue in sans serif for me is always S, paragraph, question mark, cedilla and & (Et) sign together with numbers. Arabic numbers in roman alphabet seem like from a different planet .o]\n\n"
    }
  ]
}
