{
  "id": "58966",
  "title": "Friendly Rounded Sans fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello Typophiles,\n\nWe’re having a new logo designed by a local agency and they’ve chosen to put our company name in a custom rounded sans. They said all the stuff you’d expect about a friendly, approachable, modern tone. I wasn’t immediately sold on the idea since many companies these days are opting for roundy sans serif fonts (like Xerox using FS Albert).\n\nSo I got to thinking well hey maybe they’re right to choose this kind of font, even if everyone else is trying to be personable and informal, why shouldn’t we too?\n\nAnyway my two questions are:\n\n1 What fonts would you recommend that are slightly rounded, with simple shapes and a one-storey a? The company name is IMA International and I think they’re going to set it with the ima in lowercase and the INTERNATIONAL in uppercase below it.\n\n2 Am I over-worrying about choosing a style that seems to be everywhere or should I be happy that this kind of font does in fact represent our company values?\n\nAs always, I look forward to anyone’s suggestions.\n\nThanks :)\n\nPS Can’t post an image of their home-made type currently but will try to get the pdf from them.\n\n",
  "author": "<a href=\"/web/20090619091815/http://typophile.com/user/20652\" title=\"View user profile.\">Bendy</a>",
  "time": "<br>",
  "uid": "20652",
  "comments": [
    {
      "time": " 12.Jun.2009 6.41am",
      "content": "An identity that is too trendy will probably look dated in a couple of years, maybe Bryant with the alternate a fits your bill?\n\n[http://www.processtypefoundry.com/typefaces/bryant2/index.html](http://web.archive.org/web/20090619091815/http:/www.processtypefoundry.com/typefaces/bryant2/index.html \"http://www.processtypefoundry.com/typefaces/bryant2/index.html\")\n\n"
    },
    {
      "time": " 12.Jun.2009 7.09am",
      "content": "Good lord, Bendy, why not try doing the letters yourself? Judging by Mint, you’ve got the right stuff :^\n\n"
    },
    {
      "time": " 12.Jun.2009 7.41am",
      "content": "(I thought that would be a bit presumptuous!)\n\n"
    },
    {
      "time": " 12.Jun.2009 8.30am",
      "content": "It’s OK, really, if you don’t fall to the temptation to use your own work when it’s obvious that something else would be better.  \nWhere in the rule book does it say that graphic designers shouldn’t do their own illustration, photography, typography, lettering, Flash or web programming, and throw in some beats and a few lines of copy for good measure? If you can find the time :-)\n\n"
    },
    {
      "time": " 12.Jun.2009 9.43am",
      "content": "I was thinking the same thing as Paragraph… Bendy, is your company aware that you know a thing or two about type?\n\n"
    },
    {
      "time": " 12.Jun.2009 10.11am",
      "content": "Thanks for the vote of support!\n\nYes my company knows I’m a font geek! Maybe that’s part of the difficulty because I don’t want to sound picky about something nobody else really notices. And if I was the designer I’d hate the client to jump into my territory.\n\nIllustration/logo stuff is not something I can do so I chose to get the agency involved. I really like their logo and the type is passable, I’m just not sold on the idea of the friendly rounded thing and the execution is slightly spotty (no optical correction).\n\nI suppose I could have a go, but there are nine or ten glyphs to create and I don’t know if I can do the right ’mood’ of font in the time given (a couple of weeks before our 2010 brochure gets finalised). I’ll have a go of course but I was really looking for a ready-made font or any opinions whether roundy ones are passé or appropriate. We are a whole lot more personal/organic/unique than Xerox!\n\n"
    },
    {
      "time": " 12.Jun.2009 10.20am",
      "content": "<cite>“the type is passable”</cite>  \n<cite>“(no optical correction)”</cite>  \nAw Ben… it sounds like you might be a bit too nice to these people.\n\nAnd for the record, I think your company should value having a specialist  \non board! (I know it’s not easy – but don’t try to pretend type doesn’t matter  \njust so they won’t think you’re a hopeless geek. ;-) )\n\n<cite>” We are a whole lot more personal/organic/unique than Xerox!”</cite>  \nAh, there’s a statement to work from!\n\nBTW, FF Cocon randomly popped into my mind, but that’s probably not what you want. It’s rounded but “different”. But maybe not fresh enough.\n\n"
    },
    {
      "time": " 12.Jun.2009 2.08pm",
      "content": "That’s interesting because Cocon also made a quick transit through my mind. It doesn’t quite have enough ’authority’ for my taste though. Thanks for the suggestion though.\n\n"
    },
    {
      "time": " 12.Jun.2009 3.02pm",
      "content": "<cite>Where in the rule book does it say that graphic designers shouldn’t do their own illustration, photography, typography, lettering, Flash or web programming, and throw in some beats and a few lines of copy for good measure? If you can find the time :-)</cite>\n\nNick, sometimes I wish I didn’t _have_ to do all of those things at my job ... well, except for the lettering in most cases. Though most of the time it’s nice to have the variety.\n\n@Bendy: How rounded are you thinking. I think Volkswagon is currently using VAG Rounded or something similar for their advertising, which I think works beautifully juxtaposed with the precision of their vehicles.\n\n"
    },
    {
      "time": " 16.Jun.2009 1.53am",
      "content": "I’ve browsed around on MyFonts and come up with a few nice possibilities which I’ll present to the design agency. I hope they don’t think I’m treading on their toes!\n\nMy shortlist is Heinemann Roman, Bryant Regular (with alternate a, thanks Frode!), Montag and VAG Rounded (thanks Ed!).\n\nIs it ok to post sample text from MyFonts for demonstration?\n\n"
    },
    {
      "time": " 16.Jun.2009 2.09am",
      "content": "I’d be surprised if THAT’s not OK, but what do I know…\n\nBTW, have you looked at [Foco](http://web.archive.org/web/20090619091815/http:/www.daltonmaag.com/browse/fonts/dama/foco)?\n\n"
    },
    {
      "time": " 16.Jun.2009 2.53am",
      "content": "OK, I’ll take down the pic if anyone thinks it’s bad practice.\n\n[Image removed by Moderator at the request of Bendy.]\n\nPlease bear in mind this is not properly kerned and is just to show how different fonts might work.  \nAnd yes, I submitted my own Mint for consideration too...rounded terminals and single-storey a...why not?!  \nI personally think Bryant and Montag work really nicely.\n\n"
    },
    {
      "time": " 16.Jun.2009 4.05am",
      "content": "Dude, I think Mint rocks the party. At least in the “ima” – I’m not quite as sure about the “INTERNATIONAL” where something more monoline might feel more “stable” (or maybe try using your bolder Mint in the subline?).\n\nI think Bryant works quite nicely too, it’s just a lot softer, less perky.  \nPersonally I think Montag’s too cute, and too wide.\n\nBut you know, salt and stuff, I mean it’s just my eye… plus I don’t know what your company is like!\n\n"
    },
    {
      "time": " 16.Jun.2009 4.21am",
      "content": "Thanks! I think the INTERNATIONAL needs less tracking...had to Photoshop that together from the pdf screengrab here as I haven’t installed Mint at work! But you’re right, perhaps Semibold would work better for the smaller text.\n\nThe agency had also removed the tittle from ima, to improve the visual structure I guess. We’ll see what they think works best.\n\nCheers!\n\n"
    },
    {
      "time": " 16.Jun.2009 4.55am",
      "content": "I’d go with Mint, I (personally) think all the round-corner ones will decay mightily in a couple of months/years. Also, I would scale to align the i–I and a–L strokes, and loose the dot, if you must. Good luck!\n\n"
    },
    {
      "time": " 16.Jun.2009 5.36am",
      "content": "Montag jars me. The bent bottom of the i, which may look fine in normal setting, does not balance with the verticals at the other side of the logo.\n\n"
    },
    {
      "time": " 16.Jun.2009 7.29am",
      "content": "OK, now I’m officially surprised. I’ve been alerted off-list that the terms and conditions of MyFonts.com prohibit posting “the content contained on this Site” to the web: [http://new.myfonts.com/info/terms-and-conditions/](http://web.archive.org/web/20090619091815/http:/new.myfonts.com/info/terms-and-conditions/ \"http://new.myfonts.com/info/terms-and-conditions/\")\n\nSeems a bit anal to me but that is what it sez. I guess I should have checked back before posting – apologies.\n\n"
    },
    {
      "time": " 16.Jun.2009 8.04am",
      "content": "Umm, there’s no edit button to remove the image...I’ll message an admin. Thanks for pointing that out Nina.\n\nI’m also quite surprised, I think posting the word images is very different to sharing the fonts, but I don’t want to get involved in a big discussion about that ;)\n\n"
    },
    {
      "time": " 16.Jun.2009 8.48am",
      "content": "I like Mint too. It is a good looking font and distinct. Of course I don’t know anything about the company either.  \nAnother rounded sans that I like though is [Router](http://web.archive.org/web/20090619091815/https:/www.vllg.com/Incubator/Router/mudTyper+Weights/)\n\n"
    },
    {
      "time": " 16.Jun.2009 9.25am",
      "content": "Ok, three designers voted for Mint, I’m feeling very good about that! Thanks :D\n\n"
    },
    {
      "time": " 17.Jun.2009 5.59am",
      "content": "Here’s Mint with the INTERNATIONAL in Semibold. It strikes me the diagonal of N is too bold but otherwise I like it.\n\n ![](http://web.archive.org/web/20090619091815im_/http:/typophile.com/files/IMAMINT_5918.jpg)\n\n"
    },
    {
      "time": " 17.Jun.2009 8.10am",
      "content": "_Ok, three designers voted for Mint_\n\nMake that three designers and one wannabe. Mint looks so fresh next to those others.\n\n"
    },
    {
      "time": " 17.Jun.2009 8.17am",
      "content": "Mint has nice stuff going for it. I think maybe your A is too wide compared to the other caps in INTERNATIONAL. Oh and the up stroke—left diagonal—should probably be thinner to relate well to the N and the horizontals. Try doing each alone and both, in context of course, and see what you like best...\n\n"
    },
    {
      "time": " 17.Jun.2009 8.42am",
      "content": "Thanks guys, I’m thinking we might tell the agency to use Mint, once I’ve sorted out the spacing and the A and N. There’s something weird going on in the R counter too I think.\n\nIn terms of process, would I license the font to my company or the design agency who my company is paying to do the logo? I haven’t released fonts before so this is exciting and a bit unknown.\n\n"
    }
  ]
}
