{
  "id": "58963",
  "title": "need Critique ( student typeface )",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hello Typophile,\n\nThis typeface is design for a class assignment.  \nI will really appreciate if you guys can please find some time to critique the typeface.  \ni want to work this typeface both in body text and display too.  \nThis is my first attempt to design a serif typeface.  \nYour comments are really valuable to me and will help me to improve in future.\n\nThank you in advance  \nRony\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 24.png](http://web.archive.org/web/20150417113655/http:/typophile.com/files/Picture%2024_2.png) | 44.67 KB |\n\n",
  "author": "mindlessworld",
  "time": "12 Jun 2009 — 12:16am",
  "uid": "31304",
  "comments": [
    {
      "time": "12 Jun 2009 — 1:45am",
      "content": "Hi Rony,\n\nI love teaching Letter Design in India.\n\nHere is some feed back:  \n\\* Very Iinteresting design style:  \n with typical pointed endings in a,c,e & s.  \n Visble heavy sress stokes especially vertical ones.  \n Clear capsule shape counter forms.  \n Condense character widths.\n\nFew corrections to be considered:  \n\\* y stand out with right side heavy sroke, normally it is left one.  \n\\* v,w,x & z do not reflect the style atall.  \n\\* z is bit wider in width and upper stoke goes out to left and creats balance problem.  \n\\* the conclave curve serifs at the baseline does not reflect on descenders, p, q, & y.\n\nRegrds,\n\n"
    },
    {
      "time": "12 Jun 2009 — 3:47am",
      "content": "This looks like an interesting start. Here are a couple of thoughts.\n\n- Most of your glyphs look quite \"constructed\", like you were fusing them up from different parts that you were copy-pasting between letters. That means that most of them will need a bit of optical correction. For example, in the bpdq (and others), there is a little bump where the curve \"becomes straight\". These things need to be optically tweaked, away from pure geometry, in order to look right. Also look at the overall proportions, like why is the \"e\" so much narrower than the \"o\"?  \nMind that if you really want to make it work for text, that's going to take even more optical correction, and lots of testing. It might be easier to first shoot for display, where it's more permissible to stick closer to geometry.\n\n- I like your curvy/tapering terminals on things like \"c\", \"s\", \"a\". In fact, I think the \"a\" is my favorite glyph. It's really quite nice.\n\n- The two-sided x-line serifs – on \"v\", \"w\", \"x\", \"y\" – are much thinner than the other ones. Actually, on the \"x\" the baseline serifs are also thin. I think I'd make them thicker to match all the other ones.\n\n- \"k\": the (upper) arm looks heavier than the leg. It should be the other way round.\n\n- \"o\" seems to have stronger contrast between thick and thin than the other letters.\n\n- The tail of the \"g\" has a similar problem. Best idea is probably to look at lots and lots of \"g\"s and figure out where the most weight should be. Also, that ear is too small.  \nOn the other hand, have you tried making a single-storey \"g\"? Kind of like the \"q\" with the descender curving over to the left. It could work quite well in this font I think.\n\nKeep going! :-)\n\n"
    },
    {
      "time": "15 Jun 2009 — 2:45am",
      "content": "Thank You for the valuable comments  \ni have made some changes  \nplease cheek the link.\n\nwill be waiting for your comment on it\n\nThanks  \nRony\n\n[http://1.bp.blogspot.com/\\_nVbM9akotx4/SjYXjfvrGyI/AAAAAAAAAJM/PIbic9BcLS...](http://web.archive.org/web/20150417113655/http:/1.bp.blogspot.com/_nVbM9akotx4/SjYXjfvrGyI/AAAAAAAAAJM/PIbic9BcLS8/s1600-h/Picture+1.jpg \"http://1.bp.blogspot.com/\\_nVbM9akotx4/SjYXjfvrGyI/AAAAAAAAAJM/PIbic9BcLS8/s1600-h/Picture+1.jpg\")\n\n"
    },
    {
      "time": "23 Jun 2009 — 2:19pm",
      "content": "Weights are much improved.  \nI'd chamfer the acute angles of z, and make g's ear bigger.\n\n"
    }
  ]
}
