{
  "id": "58971",
  "title": "Colophon Submission!",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Dear All,\n\nWe are currently looking for designers to submit some new, original and exciting typefaces for Colophon's autumn release schedule.\n\nWe accept submissions through e-mail at the following address:\n\n[abc@colophon-foundry.org](mailto:abc@colophon-foundry.org)\n\nYou may submit as many as you like, and in any form of completion (ideally, this would be at least all major characters completed). Not technically minded? If we feel that your typeface has true potential, we can take the project on further so it can be released.\n\nPlease keep e-mail submissions below 3mb, and in PDF/Jpg form is best.\n\nWarmest,\n\nColophon Foundry\n\n",
  "author": "Colophon-Foundry",
  "time": "12 Jun 2009 — 7:22am",
  "uid": "41485",
  "comments": [
    {
      "time": "12 Jun 2009 — 8:06am",
      "content": "Hi Edd, do you have a house style or particular market or can fonts be totally a random assortment? I'll send through a pdf anyways so you can see my latest work. :)\n\n"
    },
    {
      "time": "12 Jun 2009 — 9:05pm",
      "content": "It's always nice to learn that there is another foundry out there! Here's their website, Bendy:\n\n[http://www.colophon-foundry.org/](http://web.archive.org/web/20131014175243/http:/www.colophon-foundry.org/ \"http://www.colophon-foundry.org/\")\n\n"
    },
    {
      "time": "13 Jun 2009 — 1:07am",
      "content": "Hi Ricardo, yes I know them as I live in Brighton too and have met the guys there. I thought normally smaller foundries have fonts of a particular feel?\n\n"
    },
    {
      "time": "13 Jun 2009 — 7:03am",
      "content": "Hi Ben,\n\nThanks for getting in contact, I'll be dropping you a mail later on in the week if thats ok?  \nAt the moment we're looking for some exciting grotesques, display fonts, body faces etc. Anything that shows a real craftsmanship and attention to detail really!\n\nThanks\n\nColophon\n\n"
    }
  ]
}
