{
  "id": "58997",
  "title": "A clean elegant font for a chat application",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi everyone,\n\nI am writing an experimental chat application, focused on a clean user interface. It draws several ideas from various sources, but is mostly inspired by the [Gargoyle](http://web.archive.org/web/20131016034458/http:/ccxvii.net/gargoyle/) Interactive Fiction player:\n\n<cite>Gargoyle cares about typography! In this computer age of typographical poverty, where horrible fonts, dazzling colors, and inadequate white space is God, Gargoyle dares to rebel!</cite>\n\nAlthough I like Gargoyle's default font, Bitstream Charter, I found its Unicode coverage severely lacking (even in the commercial Pro version). For instance, it does not support cyrillics, or some eastern-european characters such as ş/ţ.\n\nHere is what I have so far:\n\n ![](http://web.archive.org/web/20131016034458im_/http:/typophile.com/files/0000038A_6330.png)\n  \n(also note how the base of the \"fi\" ligature is blurred)\n\nThus, I ask: which font could I use with better Unicode coverage that isn't too different from Charter, or perhaps better befitting my application in your opinion?\n\nEdit: never mind, I just used Georgia...\n\n",
  "author": "CyberShadow",
  "time": "12 Jun 2009 — 6:27pm",
  "uid": "45371",
  "comments": [
    {
      "time": "17 Jun 2009 — 11:30am",
      "content": "Although your edit makes it appear that this is no longer an issue, since you asked about something similar to Charter with better glyph coverage, including cyrillic, it seemed like you might be asking specifically for [Charis SIL](http://web.archive.org/web/20131016034458/http:/scripts.sil.org/CharisSILfont).\n\nst\n\n"
    },
    {
      "time": "17 Jun 2009 — 3:36pm",
      "content": "\\>Woah! Looking at that Gargoyle interface made me want to go back to IF!  \n\"Woah\" is not a word I recognize.  \n\\>  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131016034458/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    }
  ]
}
