{
  "id": "58992",
  "title": "First Font Feedback",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "So a few days ago I began work on my very first typeface. I am a graphic design student and I haven't built up a great sensitivity to type yet so i would like to get some feedback on the very early stages of my font.\n\nThese are the only letters that i have so far, I wouldn't say they are complete in any regards but they are the first to have form. I think that the next letters I will work on will be the lower case and uppercase E as well as the lower case and upper case C.\n\nI was hoping to get some feedback on multiple aspects of the font. First of all, I would like some feedback on the negative space. So far there hasn't been any work on actual letter spacing so I don't need feedback on that this early in the process but I would like to know about how well the counters work and the space around the letters. Secondly I would like some feedback on the stresses and on the stroke weight. Specifically I would love some feedback on the lowercase a. I have been having some trouble in getting it to match with the other characters. Also, as I don't even know what I don't know I would like any other feedback that may be offered.\n\nI thank you in advance for anyone willing to lend their experience and insight. The font is very early in its creation (i haven't even thought of what to call it when it's finished) and it will most likely change very very drastically before it is finished.\n\n[http://img521.imageshack.us/img521/3598/fontv.png](http://web.archive.org/web/20150417195801/http:/img521.imageshack.us/img521/3598/fontv.png)\n\n",
  "author": "Cody",
  "time": "12 Jun 2009 — 3:29pm",
  "uid": "35752",
  "comments": [
    {
      "time": "5 Oct 2009 — 4:49pm",
      "content": "I'd try shaping some more letters to see what overall direction and characteristics develop before thinking about spacing. Find out whether this will have stress, and if so how much. Set lines of letters to see whether the x-height pleases your eye. Find out what style of serif works. Learn about optical correction and how to harmonise the different glyphs. Start with the letters that spell 'Hamburgefontsiv' so you can get a variety of shapes with which to experiment. It's generally a good idea to think about what you want your font to do: text, display, large size, small size, screen use...\n\nThen go back and forth as many times as you can, tweaking and undoing, printing and refining, shaping and spacing. The process is what makes it work, and at this stage you don't have a whole lot of letters to play with.\n\n"
    }
  ]
}
