{
  "id": "59",
  "title": "Abacus",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Here's a recent project...   \n   \n ![ABACUS!](http://web.archive.org/web/20150416065706im_/http:/www.typophile.com/forums/messages/29/1040.jpg)   \n   \nAny thoughts, impressions?\n\n",
  "author": "glutton",
  "time": "31 Mar 2002 — 6:47am",
  "uid": "1204",
  "comments": [
    {
      "time": "1 Apr 2002 — 1:22pm",
      "content": "Hi John, I think I am seeing several designs within this one. I like the grouping of the 1,2,7,Z as they are all thin by the use of single   \nblock , the A,B,C,D,O,P,Q,0,8 work well together but the rest do not work smoothly together as a unit. the X is something else, my favorite character.   \n   \nhere is a few designs from around the world that use a similar design concept and in my opinion did a really nice job.   \n ![grid type.jpg](http://web.archive.org/web/20150416065706im_/http:/www.typophile.com/forums/messages/29/1047.jpg)\n\n"
    },
    {
      "time": "2 Apr 2002 — 5:50am",
      "content": "Thanks for the advice, guys!   \n   \nI've always loved Stadia although it turns out that it's a revival of a much older font created in the Bauhaus way back when... interesting story.   \n   \nHere's a partial redesign:   \n   \n ![abacus2](http://web.archive.org/web/20150416065706im_/http:/www.typophile.com/forums/messages/29/1056.jpg)   \n   \nDo you think that having some characters weighted on the top and some weighted at the bottom is a good thing? Or should it be more consistent?\n\n"
    },
    {
      "time": "2 Apr 2002 — 7:19am",
      "content": "I think the weight \"imbalance\" is a key feature.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Apr 2002 — 6:55pm",
      "content": "I think the Bauhaus font was slightly different perhaps something more like this one below . This one I believe was redone by Henrik Kuble (Danish) for fontyoufonts.com   \n ![fontyoufonts.com.jpg](http://web.archive.org/web/20150416065706im_/http:/www.typophile.com/forums/messages/29/1059.jpg)\n\n"
    },
    {
      "time": "31 Mar 2002 — 10:52am",
      "content": "Right now it's a big, lovable mess. There are lots of interesting individual characters, but they're not hanging together as a whole.   \n   \nI think the most successful characters are the ones with the greatest thick/thin contrast: F,G,S,T,L,3. I'd like to see that top- or bottom-heavy approach applied throughout.   \n   \nNot sure the pixel/stair-stepping technique works for the Z,2 or 7 either. You might consider applying the rounded corner approach of the K.   \n   \nThe double lump of the I and W is cool, too. More of that, maybe?\n\n"
    }
  ]
}
