{
  "id": "59008",
  "title": "A Mission Statement",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Anyone know of any good examples of a Mission Statement layout or any typeface suggestions? It's something I have never worked on or considered before and kind of need a push in the right direction.\n\nThanks!\n\n",
  "author": "Patrick Witmer",
  "time": "13 Jun 2009 — 12:12pm",
  "uid": "23336",
  "comments": [
    {
      "time": "13 Jun 2009 — 12:43pm",
      "content": "A photofont made of cow dung?\n\n"
    },
    {
      "time": "13 Jun 2009 — 12:44pm",
      "content": "What is a mission statement?\n\n"
    },
    {
      "time": "13 Jun 2009 — 1:16pm",
      "content": "\"Anyone know of any good examples of a Mission Statement \"\n\nNo.\n\n"
    },
    {
      "time": "13 Jun 2009 — 5:15pm",
      "content": "[Here](http://web.archive.org/web/20131018035234/http:/www.bfcog.org/Portals/0/graphics/10-commandments.jpg) is one :o)\n\n"
    },
    {
      "time": "13 Jun 2009 — 6:52pm",
      "content": "Sweet:) Give the guy a break, now! Are you thinking of something like a list of things an organization (church?) want to be like and/or achieve?\n\n"
    },
    {
      "time": "13 Jun 2009 — 10:16pm",
      "content": "_What is a mission statement?_\n\nA mission statement is a brief description of a company's main purpose. Here are some [examples of mission statements](http://web.archive.org/web/20131018035234/http:/business-resources.suite101.com/article.cfm/sample_mission_statements).\n\n"
    },
    {
      "time": "15 Jun 2009 — 8:36am",
      "content": "\\*sigh\\* I expected such responses he he. Anyway, Ricardo is right, it's for a law firm outlining their purpose and goals. They want to have it printed on a nice paper, framed, and hung in the office, and have given me the task of making it look \"pretty.\"\n\nIt's for my wife's company so wanting to make it look nice, but, as I first noted, kind of hit a wall on this one as it's not a project I am used to.\n\nSo once again any thoughts would be most appreciated.\n\nAlso, James, as much as I would love to throw some cow dung up on their wall, I think my wife would put me in the dog house for that one.\n\np@rick\n\n"
    },
    {
      "time": "15 Jun 2009 — 1:24pm",
      "content": "I know paragraph was just kidding with his Ten Commandments post, but I'm thinking that a two-column page, with a centered title and a bold face for title and text wouldn't be bad. Of course, a bold face might not feel right for a law firm. You could also take inspiration from Beatrice Warde's [\"This is a printing office\"](http://web.archive.org/web/20131018035234/http:/infoshare1.princeton.edu/rbsc2/ga/unseenhands/labels/wardePrintOffice.html): big type, subtle use of color, etc.\n\n"
    },
    {
      "time": "15 Jun 2009 — 2:45pm",
      "content": "Something like HF&J's [Requiem](http://web.archive.org/web/20131018035234/http:/www.typography.com/fonts/font_overview.php?productLineID=100020) might be up your alley? I could definitly picture it in a law firm. HF&J suggest Gotham as a pair too.\n\n"
    },
    {
      "time": "15 Jun 2009 — 4:01pm",
      "content": "<cite>\"Something like HF&amp;J’s Requiem might be up your alley\"</cite>  \nThat, or Matthew Carter's [Mantinia](http://web.archive.org/web/20131018035234/http:/www.fontbureau.com/fonts/Mantinia).\n\nDepending on how serious / celebratory they want this to get, this might even be a case for a (restrained) blackletter, at least for titling. Mmm.\n\n"
    },
    {
      "time": "15 Jun 2009 — 10:49pm",
      "content": "Oooh, Mantinia. Haven't seen that used in a while. Lots of nice ligatures there.\n\n"
    },
    {
      "time": "17 Jun 2009 — 4:21pm",
      "content": "You read my mind Frode.\n\n"
    },
    {
      "time": "17 Jun 2009 — 4:42pm",
      "content": "Sweet.\n\n"
    },
    {
      "time": "18 Jun 2009 — 3:30pm",
      "content": "Thanks to everyone for the helpful suggestions. I think I am liking Requiem, thanks Frode.\n\n_I know paragraph was just kidding with his Ten Commandments post..._\n\nI thought the same thing, at first was like, yeah yeah, funny guy. But really, for a set of rules/statements, it does give a lasting feel for authority and guidelines and I will be keeping it in the back of my mind as I lay this puppy out ;)\n\nAnyway, thanks again for the suggestions and examples, Cheers.\n\np@rick\n\n"
    },
    {
      "time": "18 Jun 2009 — 10:25pm",
      "content": "_it does give a lasting feel for authority_\n\nAnd then there's always...\n\n ![](http://web.archive.org/web/20131018035234im_/http:/typophile.com/files/God-monty-python_4946.jpg)\n\n;-)\n\n"
    }
  ]
}
