{
  "id": "59004",
  "title": "Ethos, a clean grotesque",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This started out as a quick contribution to the [Arial Type Battle](http://web.archive.org/web/20150414223809/http:/typophile.com/battle36). The typeface still shares the metrics of Helvetica and its impostor, and it is my first attempt at drawing a complete sans serif. That's a lot harder than drawing a serif, I think.\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/neutro_3995.jpg)\n\nI'd like to release this typeface from its Arial/Helvetica metric imprisonment, and make a light, a bold and a black, and italics for the three lighter weights. Do you think it will be worth the effort? I'm very unsure if Neutrogen is but an exercise, or if it deserves to be developed and used. Please tell me what you think.\n\n| Attachment | Size |\n| --- | --- |\n| [neutro.pdf](http://web.archive.org/web/20150414223809/http:/typophile.com/files/neutro.pdf) | 72.23 KB |\n| [neutro2.pdf](http://web.archive.org/web/20150414223809/http:/typophile.com/files/neutro2.pdf) | 192.54 KB |\n| [neutro4.pdf](http://web.archive.org/web/20150414223809/http:/typophile.com/files/neutro4.pdf) | 179.46 KB |\n| [neutro5.pdf](http://web.archive.org/web/20150414223809/http:/typophile.com/files/neutro5.pdf) | 169.36 KB |\n| [ethos\\_regular.pdf](http://web.archive.org/web/20150414223809/http:/typophile.com/files/ethos_regular.pdf) | 162.63 KB |\n\n",
  "author": "Sindre",
  "time": "13 Jun 2009 — 3:43am",
  "uid": "39515",
  "comments": [
    {
      "time": "13 Jun 2009 — 4:03am",
      "content": "Hi Sindre :)  \nThis is really cool. I like the DIN-like introduction of straight-sided rounds. I think you are right, this is crying out to be let out of the Arial/Helvetica cage. I find the widths, especially in the caps, a bit uneven.  \nAre the corners and terminals bevelled? I wonder if small curves might be cool.  \nI think there's a tiny amount of optical correction needed on some of the curves e.g. o looks darker on the top left and bottom right because it's symmetrical.  \nI love the almost unnoticeable trapping on the M and N for example. M looks a bit narrow perhaps.  \nI'd move the crossbar on e down slightly. a looks wide (as of course it would being based on the metrics of Arial). w could go wider.  \nBowls on 6 and 9 could be larger.  \nYou would know much better than me but doesn't the ring on aring look a bit light and close to the base glyph?  \nI'd put a slab on the bottom of £ to match the 7.\n\n"
    },
    {
      "time": "13 Jun 2009 — 4:51am",
      "content": "Thanks a lot for your input, Ben!  \nYou are absolutely right about the need for further optical correction, I've been fumbling in the dark about that, having no theoretical background at all. Type design is an infinite rabbit hole.  \nAnd yes, working on a set of given widths is a severe limitation. I'll rework every glyph.  \nI agree on everything else you say, and will make corrections. Those Å and å-rings (and the ø-slashes) follow Helvetica's thinness and placement. I'll fix it.  \nYes, every outer corner is bevelled. I've been thinking about making curves instead, but given the small size (5x5 units), I'm not sure if the difference will be noticable except in very large sizes. I'll give it a try, though.\n\n"
    },
    {
      "time": "13 Jun 2009 — 5:12am",
      "content": "[Mark Jamra's article here](http://web.archive.org/web/20150414223809/http:/www.typeculture.com/academic_resource/articles_essays/pdfs/tc_article_6.pdf) gives some ideas about optical correction, though the o thing isn't mentioned there. I don't have a theoretical background either, it was just my eye that was expecting a slight slight thinning on those portions. It has to be unnoticeable though.\n\n"
    },
    {
      "time": "13 Jun 2009 — 5:43am",
      "content": "Thank you! A great read. I've started redrawing, and I will post an update tonight, CET +1. Thanks again for your very helpful feedback.\n\n"
    },
    {
      "time": "13 Jun 2009 — 2:31pm",
      "content": "First revision, after Bendy's suggestions. This typeface no longer qualifies as a stand-in for Arial. The biggest differences are the widths of a, f, s, t, w, eszett, A, B, D, E, F, M, P, R, S and W, while several other glyphs have had som minor optical adjustments. And the spacing and basic kerning is completely redone, though roughly. New pdf attached to first post.\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/neutro2_6454.jpg)\n\n"
    },
    {
      "time": "13 Jun 2009 — 5:27pm",
      "content": "Er ... please ignore the faulty placement of the diacritics in the last sample. I mixed up two files, and didn't see it till I had uploaded the image.\n\n"
    },
    {
      "time": "13 Jun 2009 — 7:00pm",
      "content": "Why did you choose serifs on \"1\"? If you decide to use them, they should be slightly heavier. Compare them to the base of \"2\". Also, \"7\" is falling over.\n\nHypp på designsnakk og kaffe en dag, forresten?\n\n"
    },
    {
      "time": "13 Jun 2009 — 9:27pm",
      "content": "Looking nice. I admire your bowl-stem joins.\n\nS gets too horizontally flat at top and bottom.\n\nf's ascender strikes me as too wimpy - too narrow. Perhaps same for j descender.\n\nMaybe make the cutoff of t's ascender less steep (or I think I would opt for a horizontal shear there - follow Helvetica rather than Arial).\n\nSince you're not tied to the spacing of the source fonts anymore, you may want to narrow P.\n\n"
    },
    {
      "time": "14 Jun 2009 — 2:16am",
      "content": "Looking good!\n\nI think you could extend the right side of t, both on the crossbar and the foot, similar to what Craig suggested for the f. But I like the angular terminal on top.\n\nIf the P gets narrower, consider doing the same for B, c, D, G and to a lesser extent R.\n\nQuestion mark needs to be cut off higher to give enough space between the hook and dot.\n\nHave you tried other shapes for comma? And I wonder if an open-topped 4 would suit the font. I love 3.\n\nGOod work, keep it up :)\n\n"
    },
    {
      "time": "14 Jun 2009 — 9:48am",
      "content": "Thank you very much for your comments, everyone!  \nFrode, I chose the serifed numeral 1 to make it fit better in tabular settings. I think it is quite common for the the base serif in sans serif 1s to be slightly thinner than the base horizontal stroke. However, I've thickened and shortened it somewhat. The top is also altered. The 7 is stabilised. (Er litt agorafobisk for tida, sjukemeldt på grunn av ekstremt overarbeid og konstant migrene, så jeg er litt ute av drift. Men når jeg friskner til, kan vi gjerne møtes.)\n\nI've tried fixing the S (always a major headache), and worked out a better width relationship between B, C, D, G, O and P. I've also extended the capital overshoot slightly. Question mark fixed, open-topped 4 made, f and t fortified, comma slightly altered. I think its form suits the angularity, but I'll try some other solutions.\n\nYour input is invaluable, thanks again and keep them coming!\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/neutro3_4344.jpg)\n\n"
    },
    {
      "time": "14 Jun 2009 — 10:29am",
      "content": "Sindre, you're obviously playing a crowded field here, but I think this may well grow to be quite \"special\" enough to exist of its own right. I like how its \"angularity\" pulls it over a bit into the direction of DIN. I think the character of the face still needs a bit of refining though; not all glyphs pull equally strongly into the \"new\" direction.\n\nFor one thing, the angularity is not treated alike in all letters. I agree with Craig that the \"S\" is too flat on top and on the bottom. Conversely, the question mark might be too round. The \"m\" seems more roundy than I'd have expected, too; and maybe the \"n\"/\"h\"/\"u\" could also do with more \"tenseness\"? – also in terms of stroke modulation (that taper close to the joins looks a bit 1950s-grotesque-ish I think).\n\nThe other thing is that a few glyphs look closer to existing fonts than others (kinda hard to avoid I guess). \"g\" and \"t\" are somewhere between Arial and Univers; \"f\", \"k\"/\"K\", and \"R\" seem reminiscent of Helvetica. There might be room for different treatments… dunno, maybe a \"K\" with a horizontal crossbar could work? Or a differently-topped \"t\", a wider \"f\", …?\n\n\\*\n\nDetails: I think \"t\" might need more of a foot to stand on. Maybe also consider making its stem [more] off-vertical.\n\n\"z\" looks maybe a bit wide.\n\nMy biggest beef is the \"e\" – to my eye, its vertical proportions (and to a lesser degree, maybe also those of the \"G\") are off. I'd make the eye larger, but if you don't want to do that, I think you need to give it less of a \"jaw\" (i.e. close it less in the bottom-right) and fiddle with the curves; it just looks like the crossbar is too high. (It reminded me of that illustration that Frutiger did of the proportions of lettershapes vs. human faces, with the Mona Lisa – have you seen that? It's pretty funny.)  \nBTW, it might also be slightly wide.\n\nNumerals: I like them!  \nThey look a bit more Franklin-Gothic-esque than the letters though. The bowls of \"6\", \"8\", \"9\" are surprisingly un-square. And hmm, with a \"4\", a \"6\" and a \"9\" like that, I think I'd expect a \"R\" with a straight leg. But maybe that's just me.  \nI think \"3\" is too heavy in the bottom-left. The zero might be a bit \\*too\\* square, dunno.\n\nBTW, I dig the name, except that it keeps reminding me of hand cream. ;)\n\nI'll be curious to see where this goes – it's interesting!\n\n--  \nBen, thanks for posting the link to that Mark Jamra article! That's interesting stuff.\n\n"
    },
    {
      "time": "14 Jun 2009 — 10:30am",
      "content": "Those cap proportions look pretty good to me.  \nS still looks to \"Eurostile-y\" for this font to me.  \n6 (and presumably still 9) are too abrupt going from curve to straight I think.  \nRelationship of the question mark stroke and its dot is weird - align them better, and maybe the stroke can thicken at the bottom so the difference in width isn't so distinct?  \nRelationship of inner and outer contours needs refining in some curves - for example, southeast corner of D and B looks pinched.  \nThe open-topped four looks a little narrow.  \nI kinda like the comma!\n\n"
    },
    {
      "time": "15 Jun 2009 — 2:01pm",
      "content": "Hi, Nina, and thanks a bunch for your thorough critique. Very much appreciated, and very, very helpful.\n\nYes, I know there are already too many clean grotesques in the world, I guess I yet again have to hide behind the I'm-just-a-beginner-trying-to-learn-the-craft-moniker. Then again, my goal with this typeface is, if anything, to rid a grotesque of much of its grotesqueness, and use geometric solutions instead. I'm not so sure that I will succeed in this, but with all the great help I'm getting here on Typophile, it might just happen.\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/neutro4_6261.jpg)\n\nI've tried to make the glyphs more uniform, and have spent most of my free time since my last post fiddling with the curves of mnhu. It looks better now, I think, but I'm uncertain if it's good enough. Thanks for spotting the problem, those curves are probably the most defining of the lower case, I think.\n\nNew S made, question mark fixed, f, t, y and j altered, e fixed, c, a, s and z is also tweaked.\n\nB, C, D, G, H (wider) and Q are also tweaked, most of them following suggestions. Do you think I'm closer to solving the optical problems now, Craig?\n\nNina, I tried several other K's and k's, but I just can't make them work. I don't really like the style of the R, but since a straight legged version is the obvious route to follow, I've decided to stick with the unpopular solution. At least, it hasn't got that weird semi-serif of Helcetica.\n\nI'd really like to see that Frutiger on Mona Lisa and type proportions you mentioned. Which book should I be looking for? Or is it online somewhere? I think my e is much better now, by the way, thanks for pointing it out.\n\nThe numerals: I tried to make a softer transition into the straight line of 6 and 9, but wound up with a _very_ subtle difference. What do you think? I've softened the zero, but kept the roundness of 6, 8, 9. I'll try squaring them later. The 4 is extended, thanks, Craig.\n\nNew pdf attached.\n\nI swear I'd never heard of the Neutrogena cosmetic products before today, I don't think they're sold here. And I thought I was somewhat clever with that name ...\n\n"
    },
    {
      "time": "15 Jun 2009 — 3:46pm",
      "content": "Sindre, I'm glad if my input helps; to be honest, I'm probably learning just as much doing this as you are :-). I'm happy you know that I'm not all that \"advanced\" yet, either!\n\nThat said, to my eyes most of the stuff you did is totally spot on. The \"e\" feels \\*much\\* better now, as well as the \"n\" & Co. Nice!\n\n\"S\" looks a LOT better (how fast can you make \"S\"s?! I'm envious). You might try pulling its belly in a bit though ;-) – I mean the bottom-right.\n\nI'm still wondering about some of the proportions. The \"e\" still seems wide (especially next to that somewhat narrow \"d\"); actually, I'm wondering if the \"o\" isn't also a bit wide compared to the bpdq? In the uppercase the CGOQ also look a \\*hint\\* wider to me than most other glyphs; but maybe that's just me.  \nIn any case, the \"N\" needs to be (nominally) wider than the \"H\". It's now actually a bit narrower. Also, \"F\" might be a bit narrow compared to \"E\"?\n\nThe \"Y\" is hot!\n\nI wonder if the straights on \"6\" and \"9\" might be \\*too\\* straight. Especially on the \"6\" it almost looks like it's bending outwards. You might try just a hint of a curve?\n\nBTW, I dig those chamfered corners. They make it just a hint soft on the page, which seems quite pleasant.\n\n<cite>\"I’d really like to see that Frutiger on Mona Lisa and type proportions\"</cite>  \nI thought it was in the Frutiger monograph, but couldn't find it in there.  \nBut it is pictured in Tim Ahrens's book on optical sizes. Here's a quick snap:\\*\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/frutiger-monalisa_5472.jpg)\n\n(\\* I'm never sure if \"citing\" images is OK as per copyright laws [I know it is in Switzerland but hey]. If it isn't, I apologize – please let me know and I'll pull this down.)\n\n<cite>\"I swear I’d never heard of the Neutrogena cosmetic products before today, I don’t think they’re sold here\"</cite>  \nW00t, that fisherman's hand cream is marketed as Norwegian in the entire rest of the world (well at least around here): [\"Norwegian Formula\"](http://web.archive.org/web/20150414223809/http:/www.wusa9.com/news/columnist/blogs/uploaded_images/neutrogena-hand-cream-781989.jpg)… :-\\\n\n"
    },
    {
      "time": "16 Jun 2009 — 3:50pm",
      "content": "Wow, thanks again, Nina. You already deserve a mention in the font info-section.\n\nI've had very little time for type drawing today, but I've tinkered a bit with proportions, following your suggestions. It's incredible how easy it is to see your own faults when someone points them out. While I may be fast at drawing S'es, you really have a tremendous eye for type, of which I'm envious.\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/neutro5_5741.jpg)\n\nI've widened bdpq somewhat, made e slightly narrower, m a bit wider, s a little wider (with some additional tweaking), widened F quite a bit, tinkered a little with the S (it's a great trick turning difficult glyphs upside down, by the way, all bumps and faults suddenly stand out when you see it as an image instead of as a letter), narrowed the H considerably, widened the N just a hair, sliced a little off the X, and slimmed COGQ a tiny bit. To my eyes, the whole font looks much more harmonius and optically pleasing now, but I guess you'll find more faults. I hope you do!\n\nEr, the numerals. I haven't had time to work on them today. I really think I want to redraw them from scratch, as I feel they don't really match the rest of the typeface. Perhaps I'll make them cap height instead, and draw some kerned hybrid numerals as an alternative.\n\nThanks a lot for the Mona Lisa distortions! That's so true! Still, the hard part is probably understanding the different relationship of proportions in different type styles. A Barocque e would look slightly retarded if one were to interpret the crossbar as the eyes of a human face.\n\nIt seems \"Neutrogena\" is actually a Swiss brand, its formula supposedly invented by a Belgian. I found several Norwegian pages where female bloggers lamented the products' non-presence here. Obviously a case of \"foreign branding\", just like Häagen-Dazs, which name is supposed to look Scandinavian to American customers.\n\n"
    },
    {
      "time": "16 Jun 2009 — 4:59pm",
      "content": "\\>“Neutrogena” is actually a Swiss brand\n\nNina, that's totally hilarious!\n\nSindre, I'm really worried about critiquing this. I fear that anything I write will help you make it look exactly like Helvetica, sorry!\n\n"
    },
    {
      "time": "16 Jun 2009 — 5:35pm",
      "content": "\\> anything I write will help you make it look exactly like Helvetica\n\nWe wouldn't want that, would we? Actually, I fear it already does. But then again, it's been a great exercise and so far a pleasure drawing this, and I look forward to drawing additional weights. You've helped me a lot in making this rather hygienic grotesque better. Thanks!\n\n"
    },
    {
      "time": "16 Jun 2009 — 6:36pm",
      "content": "Yes, the \"cleanness\" of it makes me think of Univers even more.\n\nI think the refinements you're doing are working well.\n\nTop terminal of G looks to me like it hangs over a bit much or far.\n\ny gets thick at the intersection. K's arm may be a little too thin. Other than those, I'm envious of your diagonal weights and vertices.\n\nTake a look at the straight-into-curve of J. I think it has a similar problem that I was seeing in other curves: abrupt transitions and pinched strokes - maybe the inside curve needs to start higher? (If I myself knew more about curve drawing I could diagnose this more helpfully...)\n\n"
    },
    {
      "time": "17 Jun 2009 — 1:07am",
      "content": "Argh, I completely fell for the Neutrogena thing! :-|&nbsp;&nbsp;Sorry. Must be odd for you.  \nI tend to get annoyed when stuff is branded Swiss and isn't really.\n\nI think your refinements work quite well. Not too much time for details right now; but I'd agree with Craig that the \"J\" needs some fiddlin'. Also the \"e\" still looks a bit wide to my eye (try setting the word \"the\"), and so does the \"G\" actually (and I agree about not making the top hang down so far).  \nI'm not sure \"H\" isn't too narrow now – just if you (very slightly) widen it, make sure you take the \"N\" along.\n\nMona Lisa: I think it's less about \"absolute\" proportions (in terms of the eyes corresponding to the crossbar of \"e\", etc.) and more about appearing well-balanced, not stretched or squooshed, which also depends greatly on the visual balance / coherence of the entire glyph, and its historical model / structural context, as you say – just like two human faces from different cultural backgrounds can look very beautiful with very different proportions.  \nOtherwise a Venetian \"e\" (with the angled bar) would be pretty scary :-\\>\n\nBTW, please don't pick me out for the credits – why not put Typophile as a whole in? We're all contributing, and this environment is helping us all I think.\n\n"
    },
    {
      "time": "17 Jun 2009 — 11:04am",
      "content": "You're both right. Here's the result of some tweaking of G, J, K, N, H, y and e. That y was surprisingly difficult, but I think it looks better now.\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/neutro6_3836.jpg)\n\nNow the numerals need some attention, I think. Then I guess it's time for some text settings and print-outs, as this typeface hasn't left my laptop yet. I guess I'm in for some surprises (and more work).\n\nA female friend of mine just reported seeing Neutrogena soap in a shop in Oslo earlier today, by the way. Gee, I really have to dream up another name. Suggestions are very welcome!\n\n"
    },
    {
      "time": "17 Jun 2009 — 3:43pm",
      "content": "Det er ett eller annet med beinet på 'K' som skurrer. Mulig det er oppløsningen på bildene, men overgangen fra rett strek til kurve på 'O' og 'G' virker ikke helt naturlig. Hvis du sammenligner den indre kurven med den ytre skjønner du kanskje hva jeg mener.\n\nJeg er bare ungdommen, så ikke ta mine tips for seriøst :) Det blir spennende å se hvordan dette utvikler seg.\n\n"
    },
    {
      "time": "17 Jun 2009 — 4:06pm",
      "content": "Takk! Jo, jeg skjønner hva du mener. Jeg får ikke helt grepet om de overgangene, men det ser verre ut enn det egentlig er i jpg-versjon. Jeg lurer på om det ikke går an å lage en sånn overgang som ser helt glatt ut. Du er helt sikkert langt mer erfaren enn meg, jeg hadde knapt tegnet en bezierkurve i mitt liv før for et år siden. Mye å lære!\n\n"
    },
    {
      "time": "25 Jun 2009 — 3:02am",
      "content": "looking great, but here's some feedback from a prospective user.\n\nAFAIK this face started life as an arial improvement/redesign and, from my point of view, that's where the value of this face lies.\n\ni, like many other millions of people around the world, am forced to both read and spec arial almost every day of my life. i would love to have a redesign that i could safely substitute for arial, with the same basic charset and without risk of document reflow. seeing neurogena in place of arial every day would improve my quality of life. that, to me, would be worth more than another neo-grot, however well-designed, in an already-crowded market.\n\nof course, i'm talking about compromising a typeface you may feel has entirely transcended arial and acquired characteristics and an independence all of its own. so here's a suggestion. the main version would be spaced and kerned with complete freedom. but alongside it could be a retrograde 'arial-compatible' version could adopt the arial metrics so it could be substituted in the way i describe.\n\nwhat do you think?\n\nin any case, i've anjoyed seeing this design evolve.\n\ngeraint\n\n"
    },
    {
      "time": "9 Aug 2009 — 9:52am",
      "content": "No, I haven't given up on this. I just needed a little time off from it. (And I've made yet another half-finished serif in the meantime). See the enclosed pdf for a major update. Everything is redrawn at least twice since then, and as you can see from the enclosed pdf specimen, the typeface has grown considerably in several directions. It was obvious (see above) that the typeface needed a new name. What do you think of my new suggestion?\n\nGeraint, thanks for your post. I didn't see it till now. I'm afraid this typeface no longer has much to do with Arial or it's metrics. Your idea about a Arial/Helvetica-compatible version is indeed interesting. I'll think seriously about it when everything is more finished. And thanks a lot for your kind words!\n\n"
    },
    {
      "time": "9 Aug 2009 — 11:59am",
      "content": "Sindre, I can't see a new pdf. The last one is Neutro5.pdf made in June?\n\n"
    },
    {
      "time": "9 Aug 2009 — 12:04pm",
      "content": "Er, it was discarded because of a space in the file name, I think. Now it's there.\n\n"
    },
    {
      "time": "9 Aug 2009 — 12:36pm",
      "content": "Whoo! How exciting! I'll come back to this a bit later. You've done a lot of lovely work here! Greek, Cyrillic, bold and everything!! It all looks really nicely crafted, I'm really liking it.\n\nDoes it seem to fit in somewhere between Univers and Arial (but much nicer of course)?\n\nNeed to go back to my italic caps now but intend to give this a bit of a poke around later!\n\n:)\n\n"
    },
    {
      "time": "9 Aug 2009 — 1:12pm",
      "content": "Thanks a lot, Ben!  \nYes, your description is spot on. In really haven't looked at Univers at all when drawing this, though my goals with this typeface are probably rather similar to Adrian Frutiger's when he drew Univers. My typeface is squarer, narrower, tighter (but nowhere near Helvetica's tightness) and darker than Univers, and I think it's more the overall impression than the actual letter-shapes that makes them similar.  \nI'm looking forward to your critique. Please don't be nice.\n\n"
    },
    {
      "time": "10 Aug 2009 — 8:02am",
      "content": " ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/ethos_6402.png)\n\nNo changes, just a showing of the basic Latin Alphabet. For full character set and design notes, see the pdf attached to the first post.\n\n"
    },
    {
      "time": "10 Aug 2009 — 8:50am",
      "content": "Biggest problem I see in this is that your 'x' reads somewhat like a 'q'\n\n;-)\n\nMaybe spread the baseline vertices of 'w' apart a bit?\n\n'Ethos' is an appealing name but I'm not sure it's a match for this. For all its problems, \"Neutrogen\" sure fit well...\n\n"
    },
    {
      "time": "10 Aug 2009 — 9:31am",
      "content": "Aw, gee, that x might be a problem, yes. Don't ever catch insomnia, kids.\n\nI've tweaked the w and its neighbours. Better now?\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/vwxy_4125.png)\n\n"
    },
    {
      "time": "10 Aug 2009 — 11:51am",
      "content": "Spooky, I was just thinking about this a few days ago, and wondering if you were working on it…  \nSindre, this is becoming seriously nice. This PDF is, uh, impressive! I'll need to sleep before a full crit (insomnia? Welcome to the club!), but I'll be back.\n\n"
    },
    {
      "time": "10 Aug 2009 — 12:50pm",
      "content": "Thank you, Nina. I'm looking forward to your critique. Sleep tight.\n\n"
    },
    {
      "time": "10 Aug 2009 — 1:45pm",
      "content": "Perhaps bottom of w could be spread even further, but I'll wait to see it with more context to judge.\n\n"
    },
    {
      "time": "10 Aug 2009 — 1:51pm",
      "content": "Do you know what, I don't know how such a neutral face can be so appealing and unique!  \nOk, I'll take a break from chunking up Eternal roman into a text face and give your glyphs some attention...  \nAs I said before, this is looking \\*very\\* polished and useable, so I'll have to go into super picky-pokey mode to give a decent crit...remember I'm a type novice too so have salt at the ready.  \nMy favourite feature of this is the structure of the bowl and stick glyphs, which seem to have perfect rigour at a perfect midpoint between the grotesques and moderns. There's also a few hints of geometrics (ampersand, percentage and numerals) and humanists (J,K perhaps).\n\nOK...  \nC looks a notch too wide, perhaps also D and G (but I think G should be slightly wider than C because of the crossbar).  \nI find the crossbar of G a bit too low.  \nJ is quite narrow. I like that. Its overshoot is tremendous!  \nKnee of K may be slightly high.  \nI love the trapping on M and N.  \nV and Y may need the join moved a hair to the right.  \nZ is leaning left a bit.\n\nNumerals  \n5 looks slightly dark all over.  \n6 and 9 have quite small bowls, I presume that's intentional?  \nThat's a killer 7!  \nLovely.\n\nLowercase  \nabcd: wonderful. Well done.  \ne needs some work. Perhaps the terminal should be lower — the glyph looks a bit closed. The sides could be a hair heavier. The stress looks funny on the top half...think the BCPs on the top extrema need to go inward slightly?  \nf is narrow, reflecting the J, but I think here the hood needs to be longer.  \nHave you worked more on the lowercase? I'm struggling to find anything to say for the other letters except they're really well executed!?  \nz might be leaning left like its mother.\n\nAmpersand and £ may be a bit too geometric for the font. I'd like to see a £ with a hood like on f (horizontal with a vertical terminal)...also if you're sticking with its current form, I think the bar could be a bit lower.\n\nGrave accent on a needs to be more left. Acute on e should be more right. Check the ones on O/oacute and O/ograve too. Oslash and oslash are lovely!\n\nYogh and wynn look a bit wide and need to be tauter I think (but I am not very familiar with these characters). Lowercase schwa looks rotated anticlockwise a little.\n\nHave I been unkind enough?!\n\nLooking forward to seeing more of this, but do remember to sleep! ;)\n\n"
    },
    {
      "time": "10 Aug 2009 — 2:43pm",
      "content": "Wow, Ben, thanks a bunch. I have to get some sleep now, but I'll respond properly to your critique tomorrow, and make changes accordingly. I really, really appreciate your effort! Thanks again.\n\n"
    },
    {
      "time": "10 Aug 2009 — 2:54pm",
      "content": "Phew, yes, glad to help! It's funny how all this teaches you stuff. When I look back at the first drafts of Eternal I'm awfully embarrassed how bad my eye was. Hopefully I'm at a stage now where my judgment is better, but do feel free to discard any bits I've misjudged as I'm still making blunders and not seeing things in my own work.\n\n"
    },
    {
      "time": "11 Aug 2009 — 9:22am",
      "content": "Thanks again for picking some of the nits out of my work, Ben. I've addressed all the problems you pointed out. Aw, looks like I forgot about the K, but I think you're right about that one, too. I remember sweating over that glyph a couple of weeks ago, not understand why I never got it right.\n\nThe numerals are intentionally narrow and small-bowled, yes. That way they can have full height without looking to intrusive in text settings. At least that's my theory. I still haven't printed anything on paper, but to me it looks good on screen.\n\nI like the ampersand's shape, but I've made it slightly looser. The new £ is much better. The e was really screwed up, I don't know how I could have overlooked that. It's better now.\n\nAll those diacritics are hard to get right. Are their placement better now?\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/ethos_fix_4602.png)\n\nI promise to give you some feedback on your lovely Eternal Italic later today or tomorrow.\n\n"
    },
    {
      "time": "11 Aug 2009 — 9:42am",
      "content": "Ooh, sorry, I think I've messed up your £. It looks too modern this way to me, sorry! Otherwise very good stuff! I'd get a second opinion on the wynn and yogh.\n\nLook forward to your crit too ;)\n\n"
    },
    {
      "time": "11 Aug 2009 — 10:43am",
      "content": "The ampersand looks like it's leaning forward; look at the nodes of the top intersection - the top node is quite a bit right of the bottom and the left node is quite a bit higher than the right.\n\nZ is better though still maybe leans a touch left; and I wonder if its acute vertices (and z's) should be softened more.\n\n"
    },
    {
      "time": "11 Aug 2009 — 1:49pm",
      "content": "Better now?\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/Zetz_4164.png)\n\nWhen I drew that new £, I thought it was far better than the old one. But it may be a valid point that it is out of style with this typeface. I really don't know. Anybody?\n\n"
    },
    {
      "time": "11 Aug 2009 — 3:07pm",
      "content": "Ampersand looks fittingly stable now.  \nDid you consider chamfering the Zz (is that the right word?), like the N?\n\n"
    },
    {
      "time": "11 Aug 2009 — 3:24pm",
      "content": "Er, yes, but no. I've never liked those grotesque chamfered Z and z, and I really want to make my geometric/humanistic version work. (I just realised all my typefaces (so far) have oddball zeds, seems to be a compulsory thing for me.)\n\nDo you think they're really that bad?\n\n"
    },
    {
      "time": "11 Aug 2009 — 4:07pm",
      "content": "No, I don't! They're just unconventional so they jump out a bit, but if their inclusion is intentional I think it can work.\n\n(So if you're going to keep them, the latest ones have started to lean right! ;-P )\n\n"
    },
    {
      "time": "11 Aug 2009 — 4:14pm",
      "content": "On the 'head' of ampersand, it looks like the left extrema are higher than those on the right. Maybe you can bring them down a bit (they might need to move outwards to compensate?)\n\n"
    },
    {
      "time": "11 Aug 2009 — 4:52pm",
      "content": "The nodes were actually at the exact same vertical position, so we're seeing an optical illusion. Now I've tilted them slightly the other way, so they ought to look right.  \nZed diagonals skewed a bit back.  \nI think I'm starting to lose my visual judgement now, so I think I'll call it the night. (Boy! Almost two o'clock already.)\n\n ![](http://web.archive.org/web/20150414223809im_/http:/typophile.com/files/Zetz2_5926.png)\n\n"
    },
    {
      "time": "28 Nov 2010 — 3:19am",
      "content": "Just came back to this one to bookmark; it crossed my mind to mention Miles Newlyn's [Telenor](http://web.archive.org/web/20150414223809/http:/www.newlyn.com/fonts/custom/telenor) typeface, which has some similar DIN-like shapes. It's also reminding me of the lovely Graphik.\n\n"
    },
    {
      "time": "28 Nov 2010 — 4:33am",
      "content": "I always thought that was all Magnus Rakeng’s work.\n\n"
    },
    {
      "time": "28 Nov 2010 — 4:55am",
      "content": "Hm, I did look into that a while ago; it wasn't very clear to me but I gather Newlyn may have built on Rakeng's foundations, expanding glyph sets and drawing new weights.\n\n"
    }
  ]
}
