{
  "id": "59003",
  "title": "Lost in Translation?",
  "forum": "vinasoni's blog",
  "tags": [

  ],
  "content": "Have you ever wondered what happens when logos are translated to other languages?  \nAfter moving back to India, I have been noticing how the company names are translated in local languages on neon signboards. Bangalore requires that the sign boards be displayed in kannada along with English. While the sign boards in English are well thought and designed, when they are translated to Kannada or Hindi they forget to carry forward the visual, specifically the type treatment of the original logo. Very few signboards redesign the structure, form, proportion and font metrics of the local script to match the original.\n\n ![](http://web.archive.org/web/20090719133402im_/http:/typophile.com/files/barista_3786.jpg)\n\nEg: the below logo in Kannada just italicizes a common font in that language. It also misses the green leaf which is part of the logo. Ultimately, it is unable to visually translate the brand into the local language.\n\n ![](http://web.archive.org/web/20090719133402im_/http:/typophile.com/files/pizsign_4808.jpg)\n\nThis one forgets to carry the font weight of the original logo.\n\n ![](http://web.archive.org/web/20090719133402im_/http:/typophile.com/files/levisign_4094.jpg)\n\nMany times, the translated logo, either in Kannada or Hindi seem to exist only to please the law enforcing authorities. So they are predominantly smaller in size and placed in a corner.\n\nThere are few logos which translate their visual identity very well. Below is one of my favorite.\n\n ![](http://web.archive.org/web/20090719133402im_/http:/typophile.com/files/ranga_5166.jpg)\n\nSome may argue since the main logo is in Kananda, a lot of thought might have been put to carry the type characteristics to English.\n\nHowever, most of the companies can also invest in finding or even creating new type in local languages which match the type of the original logo. It ultimately helps carry the brand to the local consumers.\n\nBut why does translating the type treatment matter? Simply because logos are a visual depiction of the brand. And the brand carries the company’s vision and all that it stands for. Hence, it is imperative to have similar type treatments across various scripts.\n\n_p.s. The above comments are only limited to typography and have nothing against the company or brand_\n\nRead more articles on typography in my blog - [http://veenadesign.blogspot.com](http://web.archive.org/web/20090719133402/http:/veenadesign.blogspot.com/ \"http://veenadesign.blogspot.com\")\n\n",
  "author": "<a href=\"/web/20090719133402/http://typophile.com/user/43798\" title=\"View user profile.\">vinasoni</a>",
  "time": "<br>",
  "uid": "43798",
  "comments": [
    {
      "time": " 17.Jun.2009 6.39am",
      "content": "Similar things happen in Hebrew. The translation of the Coca-Cola logo isn’t bad at all, but compare it to the Sprite, Fanta, or Carlsburg. Ick!\n\n ![](http://web.archive.org/web/20090719133402im_/http:/typophile.com/files/Coca-Cola_logo3_6355.gif)\n\n ![](http://web.archive.org/web/20090719133402im_/http:/typophile.com/files/12_4430.jpg)\n  \n—Joel\n"
    },
    {
      "time": " 17.Jun.2009 11.05pm",
      "content": "Joel, thanks for sharing these images. It’s interesting to see logos in script which write from right to left!\n\nI like the way the font characterisitcs of the original Fanta logo have been carried in the translated logo. It doesn’t seem like it’s been written from right to left as the last ’a’ in Fanta seems very similar to the first character. Same with ’D’ in Diet.\n\n"
    },
    {
      "time": " 18.Jun.2009 6.38pm",
      "content": " The characteristics of the original have been kept, sure—but at the expense of readability; the ‘a’-like & ‘b’-like letters are hardly recognizable as the ‘pe’ and ‘tet’ that they’re supposed to be. Same with the Sprite logo: the ‘b’-like ‘tet’ and the reversed-r ‘resh’ are awful.  \n I suppose I was pointing out the complementary problem to your post: Sometimes the structure, form, proportion, _etc_. of the translated logo is much _too_ faithful to the original!\n\n—Joel\n\n"
    },
    {
      "time": " 19.Jun.2009 7.03pm",
      "content": "Yes, agree there should be a good balance between readability and retaining characteristics of the original logo. Being too faithful to the original at the cost of readability again will fail to translate the brand to the local customers.  \nI feel when companies define brand guidelines, they need to take this into consideration.\n\n"
    },
    {
      "time": " 25.Jun.2009 1.31am",
      "content": "I think most people, especially those from the government, are confused with the difference between “Logo mark” and “Logo type”.\n\n“Logo Marks” are basically graphic symbols which represent the identity of a brand or a company, while as “Logo types” consist of the names of the brand/companies. It becomes even more confusing where a brand doesn’t have any “Logo mark,” instead just “Logo type” as their “logo”. (example, Coca-cola and Levis, as we can see in the above images)\n\nIn many developing countries, people tend to think that since we recognize the name of a particular brand by “reading” it, therefore by just translating the name into a local language that is “readable” should be able to do the job. They have neglected, or just simply unaware of the importance of the visual representation of the brand.\n\nI find that in my country (Malaysia) it is very much so with most of the clients. It is then our job as designers to educate them. I find that often times by introducing some simple terms helps a lot. (meanwhile trying to avoid being over “jargonizing”) It certainly wouldn’t help if people go around using a generic term like “logo” to refer to both the “mark” and the “type”, and worse still when designers don’t even bother to take the effort to explain the terms to the clients.\n\nThe same goes with terms like “brand” or “branding”. People talk so much about them but have no clue at all what they are referring to. Some would even use the term “brand” to refer to a “logo”. You can imagine what happen when your client commissioned you to design a “brand” for them, while as what they actually mean is just a “logo”.\n\nIt is also the responsibility of any international brand to develop a well designed identity manual which cover the communication needs of whatever country where their brand exists, and see to it that the guidelines are being followed by the locals. The purpose of a identity manual is to provide guidelines, in order to protect and to control the integrity of the visual identity. Again, the designer has an important role to play here to educate and inform the client of the need. A manual doesn’t have to be complicated or expansive, but if a business is intended to expand to oversea, it’s extremely crucial to develop such manual so to avoid any miscommunication arises when they cross cultures.\n\nI am currently involved in an identity project with a local client whom over the years expanded their business to at least another 4 countries or so, without any awareness of the need of any visual guideline in these countries. You can imagine the mess they got themselves into. To help them to design a system to cover these needs would mean a lot of extra works for me and not necessarily extra money, but I realize the hard work is extremely crucial for educating and setting a benchmark for the corporate world in long run.\n\nweng\n\n"
    }
  ]
}
