{
  "id": "59022",
  "title": "el capitano: my first try, critique needed",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi all, I'm a graphic design student and this is my first try to design a font. This typeface is my school project that I've been working on now for a while. Since it's my first typeface I wanted it to be a display font. Here's a rough sample .pdf what I have now (i haven't done any capitals yet).\n\nApologies for the glyphs \"y\" \"x\" and \"z\", they look horrible. The question mark is also a bit weird and squarish...\n\n(Note: I haven't payed too much attention to the kerning yet.)\n\nAnyhow, all the critique is more than welcome, I really need it!\n\n| Attachment | Size |\n| --- | --- |\n| [test\\_140609\\_a.pdf](http://web.archive.org/web/20150417121616/http:/typophile.com/files/test_140609_a.pdf) | 36.79 KB |\n\n",
  "author": "Nordman",
  "time": "14 Jun 2009 — 12:35pm",
  "uid": "36067",
  "comments": [
    {
      "time": "14 Jun 2009 — 1:19pm",
      "content": "An excellent start! The 'v' looks too much like a 'u,' however.\n\n--  \nNick Hladek\n\n"
    },
    {
      "time": "14 Jun 2009 — 1:30pm",
      "content": "This looks very promising. The characters “y”, “x” and “z” need a lot of work, as you yourself point out. I also think that the style of the “k”, although it looks good by itself, looks too different to the other characters. It looks too narrow, somehow.\n\nAnd is it just me, or does the “o” look more upright than the other characters?\n\nBut all in all this is a lovely beginning, and I look forward to seeing the font with capitals.\n\n"
    },
    {
      "time": "14 Jun 2009 — 11:28pm",
      "content": "Good morning (or evening) and thank you for your good pointers!\n\nI should concentrate on my \"horrible glyphs\" (i do them last because they seem to be the most annoying and difficult ones to make, eh. Also as a native Finnish we don't really use letters \"z\" and \"x\" in our language so maybe my eye is not used to the shapes of those letters).\n\nIt's true Arild, that the \"k\" might be too different from the other characters, so I should do some modifications. I do like the style of it so maybe I should try to just fix the proportions to go more with the fellow characters. Now when I look at it, it might have bigger contrast than the other characters, have to check it... I'm also going to check the \"o\" and \"v\" too like you two pointed out that there's something to work on.\n\n––  \nI forgot to tell about the background of this font. This typeface is my final thesis of my studies (I'm not a student of typography so I've kind of had to figure out things on my own and because of that there might be some really elementary mistakes in my design). The first part of the project was to go to Spain (north part of Spain) to shoot and examine some street typography. I was inspired by the boat typography I found from the tiny fishing villages. In \"el capitano\", I'm trying to capture the spirit of the little wooden colorful boats and the custom hand painted names and numbers on them.  \n––\n\nThanks for your opinions, keep it coming because it really makes me see the things!\n\nI'm horrified about the capitals because they seem to be super hard to make and I have huge problems to make them fit to the kind of roundy style of the lowercase. Oh well, back to the work!\n\n"
    },
    {
      "time": "15 Jun 2009 — 8:40am",
      "content": "For inspiration to how you can solve the capitals, you can take a look at other fonts in the same style, like Dolly italic from Underware.\n\n"
    },
    {
      "time": "21 Jun 2009 — 7:30pm",
      "content": "I actually think the u and the v are okay, but I'm a fan of that style so...take my opinion as...opinion :)\n\nFor the y, try using the same stroke as in the v. Arild: the o also looks upright to me. I can't tell which yet but the pq looks a bit odd. Like the p droops too much or the q is suckin' its stomach in. But looking on their other side they seem to match up so, maybe look into that see if they connect to their stems where they really need to.\n\n"
    }
  ]
}
