{
  "id": "59058",
  "title": "Font changes coming to Mac OS X Snow Leopard",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[Font changes coming to Mac OS X Snow Leopard…](http://web.archive.org/web/20090618052817/http:/arstechnica.com/apple/news/2009/06/font-changes-coming-to-mac-os-x-snow-leopard.ars)\n\n",
  "author": "<a href=\"/web/20090618052817/http://typophile.com/user/15065\" title=\"View user profile.\">Christopher Dean</a>",
  "time": "<br>",
  "uid": "15065",
  "comments": [
    {
      "time": " 15.Jun.2009 2.04pm",
      "content": "Because he is going to lose Monaco, a lab-mate of mine is going to start using [Inconsolata](http://web.archive.org/web/20090618052817/http:/www.levien.com/type/myfonts/inconsolata.html).\n\n"
    },
    {
      "time": " 15.Jun.2009 2.09pm",
      "content": "[http://typophile.com/node/58625](http://web.archive.org/web/20090618052817/http:/typophile.com/node/58625 \"http://typophile.com/node/58625\")\n\n"
    },
    {
      "time": " 15.Jun.2009 2.58pm",
      "content": "I hope they have another mock funeral like they did with OS 9. The coffin could be filled with .dfonts. It’s not that they were that terrible, but they did inconvenience customers by causing a lot of confusion. My understanding was that at some point Apple needed a data-fork only version of TrueType and it was easier to shoehorn the resource fork in and make a .dfont than to support the Windows-style .ttf format. They were a true evolutionary dead-end, because they offered nothing but incompatibility.\n\n"
    },
    {
      "time": " 15.Jun.2009 3.09pm",
      "content": "...also over the objections of the Apple font group.\n\n"
    },
    {
      "time": " 15.Jun.2009 3.27pm",
      "content": "Inconsolata is a pretty awesome font. It is what I have been using in Textmate for my code work for a while. Definitely easier on the eyes and it feels lighter. I’m a fan!\n\n"
    },
    {
      "time": " 15.Jun.2009 6.37pm",
      "content": "According to [John Gruber](http://web.archive.org/web/20090618052817/http:/daringfireball.net/linked/2009/06/15/font-changes), there were some errors in the Ars Technica piece, including the part about Apple dropping Monaco. It will still be included, but Menlo will be the new default monospaced font in Apple’s development apps.\n\nSpeaking of errors, I think the Ars Technica author meant “venerable” and not “veritable” near the end of the first paragraph.\n\n"
    },
    {
      "time": " 15.Jun.2009 6.42pm",
      "content": "Actually, now that I look at it again, I see that the Ars Technica piece has been updated with the correct info about Monaco. It still says “veritable” in the first paragraph, though. :-)\n\n"
    },
    {
      "time": " 15.Jun.2009 9.22pm",
      "content": "This is more evidence of a massive Font conspiracy.\n\n"
    },
    {
      "time": " 15.Jun.2009 11.00pm",
      "content": "Those Ars-holes! They based a good bit of that article on what I wrote in the previous thread. Bit I did indeed use the adjective “venerable” which they terribly misquoted. I’m given to thinking they don’t know what that means.\n\n"
    },
    {
      "time": " 15.Jun.2009 11.14pm",
      "content": "True, the earlier thread joined all the dots. I tracked down the [http://blog.jjgod.org/](http://web.archive.org/web/20090618052817/http:/blog.jjgod.org/ \"http://blog.jjgod.org/\") the old fashioned way... using Bing.\n\nArs should have given TP more credit.\n\n"
    },
    {
      "time": " 16.Jun.2009 7.10am",
      "content": "You see? When even the venerable are veritably vulnerable, what’s next?\n\n"
    }
  ]
}
