{
  "id": "59086",
  "title": "Reference for Printing Guidelines",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Anybody know a good place to see easily-followed guidelines for printing formats?\n\nSpecifically, I’m thinking of a small saddle-stitched book, and I’ld like to know how much bleed and what the gutter dimensions should be.\n\n",
  "author": "<a href=\"/web/20090705092201/http://typophile.com/user/17763\" title=\"View user profile.\">evanbrog</a>",
  "time": "<br>",
  "uid": "17763",
  "comments": [
    {
      "time": " 16.Jun.2009 7.53am",
      "content": "The bleed and gutter are press dependent. You should talk to prospective printers to see what the requirements are on their equipment.\n\n"
    },
    {
      "time": " 16.Jun.2009 8.22am",
      "content": "second McCahill’s opinion. Printers deal with secretaries and ma & pa owners all the time. They have no problem letting you know their requirements.\n\nIf you are starting out or not too comfortable around print. I recommend picking up a book or two on this subject. Personally I got “getting it printed” by Eric Kenly. And “getting it right in print, digital prepress for graphic designers” by Mark Gatter.\n\n"
    },
    {
      "time": " 16.Jun.2009 8.39am",
      "content": "I agree with what was posted above. Every printer has different requirements, and sometimes different requirements for different equipment within the same shop. I am currently working for a printer, we require 1/8” bleeds and 1/4” gutters. How many pages is your book? You should also find out if you need to accommodate for creep at all.\n\n"
    },
    {
      "time": " 16.Jun.2009 11.01am",
      "content": "Ok thanks guys.\n\nActually they want an accordian fold brochure now. Is there anything to keep in mind when designing in this fashion? For instance—I’ve yet to hear of “creep.”\n\n"
    },
    {
      "time": " 16.Jun.2009 11.23am",
      "content": "In a saddle stitched book with a large number of pages, the thickness of the paper can make the pages near the center of the book shift away from the gutter (“creep”), so you may want to make a small compensating shift in your margins.  \nIf you are accordion folding, it sounds like you had a fairly low page count anyway.  \nAn accordion fold puts all your pages on one long strip of paper. Depending on how many pages there are, and how wide they are, you could bump your job up to a more expensive press. For instance, if you have 8 panels across, and each panel is 4 inches wide, you can’t run on a 29-inch press, so you’ll have to run on a more expensive 40-inch press. And you won’t fit most digital presses either (they typically max out around 20 inches).  \nAnother note about accordion folds: If this is a self mailer, you’ll have to [put 4 wafer seals](http://web.archive.org/web/20090705092201/http:/pe.usps.com/cpim/ftp/manuals/qsg300/q201b.pdf) on it.\n\n"
    },
    {
      "time": " 16.Jun.2009 11.30am",
      "content": "There used to be a great reference book called _Production for the Graphic Designer_ by James Craig, but a quick Google search tells me the most recent edition was published in 1990, so it will be comically out of date.  \nOne up-to-date reference I can recommend is International Paper’s _[Pocket Pal](http://web.archive.org/web/20090705092201/http:/www.ippocketpal2.com/index.cfm/MenuItemID/107.htm)_.\n\n"
    },
    {
      "time": " 16.Jun.2009 1.10pm",
      "content": "An accordion fold should be pretty straight-forward, the only other thing I can think of is to make sure you give yourself enough of a margin and don’t have any body text too close to the edge where it might get cut off.\n\n"
    },
    {
      "time": " 16.Jun.2009 4.31pm",
      "content": "[http://www.amazon.com/World-Print-Production-Claudia-McCue/dp/0321410181](http://web.archive.org/web/20090705092201/http:/www.amazon.com/World-Print-Production-Claudia-McCue/dp/0321410181 \"http://www.amazon.com/World-Print-Production-Claudia-McCue/dp/0321410181\")\n\n"
    },
    {
      "time": " 17.Jun.2009 5.20am",
      "content": "Again, with the accordion fold, talk to the printers. These are folded by machines, and they will have specific idiosyncrosies. The minimum panel to fold, maximum open length, etc. There may also be recommendations about layout for you to think about. Keep in mind that different printers will have different folding machines, so the maximum length at one place will be different from another.\n\nYou want to design something that can be printed (folded) at at least one place. (Don’t laugh. Graphic arts students continually design beautiful projects that cannot be printed).\n\n"
    },
    {
      "time": " 17.Jun.2009 2.17pm",
      "content": "Thanks people. I got the specs from the printer (1/8 bleeds was correct).\n\nAs I’m working on this, I’m curious if any issues arise from creating a spread that’s two of the pages of the accordian fold rather than just one. Will letting text flow from one page to the next cause any issues?\n\n"
    },
    {
      "time": " 17.Jun.2009 5.07pm",
      "content": "Running type across 2 panels won’t cause any problems at all for the printer. If you’re concerned about the reader, though, keep a couple of things in mind:\n\n- Paper is made of fibers. Fibers distort along folds, and letterforms printed on those fibers distort, too. This isn’t a problem if your type is larger than about 14 pt., but don’t print smaller sizes across a fold.\n- If you’re considering running text across 2 panels, remember that in full paragraphs, it’s hard for readers to follow text if the line length is more than about 60-70 characters. (I’m guessing here because I don’t know the trim size of your piece, or the width of the panels.)\n\n"
    },
    {
      "time": " 18.Jun.2009 9.38am",
      "content": "Re: compensating for creep. That’s another thing to ask your printer about, as a lot of the software we use to prep stuff for plating automatically compensates for creep.\n\n"
    }
  ]
}
