{
  "id": "5908",
  "title": "Display v. Text",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Ciao Alessandro!\n\n",
  "author": "piccic",
  "time": "13 Aug 2004 — 8:01am",
  "uid": "1316",
  "comments": [
    {
      "time": "13 Aug 2004 — 8:10am",
      "content": "Piacere di conoscerti qui su Typophile, Claudio Piccinini,   \nora sono a Piacenza, ma mi trasferir\n\n"
    },
    {
      "time": "13 Aug 2004 — 11:29am",
      "content": "I have to postpone doing the \"display to text \" challenge. I am crazy busy moving house and can't spare any time at all for a few weeks.   \n   \nSorry.\n\n"
    },
    {
      "time": "13 Aug 2004 — 4:41pm",
      "content": "\\> appropriate letter space is a function not only of absolute distance,   \n\\> but also of the ratio of the width of the counters to the letter space.   \n   \nYes, but for a given font you can just vary the letterspacing, leaving the individual letters unchanged\\*, thereby basically testing the degree to which proximity is conducive to readability. It's a superb test of which theory is better.   \n   \n\\* Unlike making the whole setting wider, which increases both the letterforms -with their internal spaces- and the letterspacing proportionally, thus maintaining the balance you speak of. And although testing readability changes affected by width/narrowness would be interesting, it's more complex (because of the need to normalize against apparent size, apparent leading and economy) and the results less directly relevant.   \n   \n\\> at text sizes ... the counters and letter spaces are more near the limits of vision.   \n   \nWell, I guess they're close than in display setting, but there's still so far from the resolution limits of human vision that I don't see that mattering.   \n   \n\\> The problem is that if you space a circular sans more widely then the words can 'fall apart'.   \n   \nThis is effectively bouma theory; loose spacing reduces the bonding between letters; and serifs help the bonding.   \n   \n\\> fatigue   \n   \nAs far as I know, Kevin sees a total correspondence between reading speed and reading comfort - and so do I. And as far the reader's consciousness is concerned the point is actually more often reading comfort (preventing a reader from aborting a reading effort), not how quickly a reader can finish a reading effort.   \n   \n\\> catch misspellings   \n   \nThe more immersed you are, the more you'll miss mistakes, because the \"assumptive\" mechanisms bypass superficial mistakes - although sometimes they also miss important distinctions - hence regressions.   \n   \n\\> Why would an author, or poet, care about \"read speed\".   \n   \nFirst of all an author wouldn't generally care about typographic reading performance (although he might very well care to make his writing easy to grasp - or not - it depends on the intentions). But anyway there are many more people than just authors and poets, fortunately. And one group of people are typographers, who should care about reading comfort/performance, not least because the work being read isn't the most important thing in the reader's life (much to the chagrin of the author/poet...) and to a great extent the reader wants to finish what he starts, and he doesn't want to suffer because the typographer doesn't get readability.   \n   \n\\> What about shorter movies, shorter symphonies?   \n   \nIf you use a font with low readability, yes, you better make your stuff shorter.   \n   \n\\> Speed is not the message.   \n   \nUsually. But it's very often the fuel. Most humans want to live and they want to live intensely = quickly. They want to do something, and then do something else. And those who don't, we can't help with more readable type anyway. Speed isn't for everybody, all of the time.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Aug 2004 — 5:31pm",
      "content": "My wife reads a chapter from a novel every night in bed before falling asleep. She has done this all her life. I don't think she is in a hurry to finish her chapter. She finds the act of reading relaxing and uses it as a way to segway into sleep. That is not to say that she is the model for the majority. I am just making a case for a broader spectrum of reading comfort than just imersive and non-imersive. If I am reading a text book or a software manual, I skim and skip until I find the little kernal I am interested in and then slow down and read intently.   \nI take much longer to read James Joyce than I do Hemingway--not because it is just more difficult reading but because there is a heck of a lot more content in a Joyce sentence. I think what designers and typographers need to study as well as just readability is motivation and a much larger set of reading categories to match them.   \n   \nChrisL\n\n"
    },
    {
      "time": "13 Aug 2004 — 7:11pm",
      "content": "Reduced lighting, tired state, desire to finish a chapter.   \nSounds like a primo typographic comfort issue to me.   \n   \nDon't get me wrong, I'm the first to say that high readability isn't always important, and there are indeed many other things to consider\\*. But sometimes it is pretty important, and the only negative of making fonts with high readability is the \"expense\" on the part of a type designer in simply grasping readability. It only takes knowledge to do a _better_ (never the ultimate) job, not any other resource.   \n   \n\\* Clearly each of us gets his kicks considering one thing or another. There's no point harping on somebody because he's interesting in pushing readability a few percent and only under certain conditions. At least it's useful to some people sometimes. For my part I see a problem with designers overly worried about the formalisms in their text fonts for example. Who does that benefit exactly?   \n   \nhhp\n\n"
    },
    {
      "time": "14 Aug 2004 — 1:03pm",
      "content": "Most of the history of text typefaces has been, in fact, the history of book typefaces. Prior to the 20th century, there seems to have been very little thought given to the design of text type that was not bibliocentric. This is a general and rather obvious observation, but I think it is useful to consider this as we talk about the experience of reading. In our information-rich age we are surrounded by all sorts of 'texts' that are informational rather than literary, and type design has adapted to this but largely by feeling its way out of the book and into new media. Only in the area of signage has there been much emphasis put on empirical testing of readability.   \n   \nRather that contrasting text and display faces, we might find it more useful to try to identify different kinds of text faces, and talk about suitability to different kinds of reading experiences.\n\n"
    },
    {
      "time": "14 Aug 2004 — 2:59pm",
      "content": "\\>Rather that contrasting text and display faces, we might find it more useful to try to identify different kinds of text faces, and talk about suitability to different kinds of reading experiences.\\<   \n   \nThat is exactly what I was trying to say in my previous post:   \n[. . . I think what designers and typographers need to study as well as just readability is motivation and a much larger set of reading categories to match them.]   \n   \nNot until the last half of the 20th Century did we see the explosion of types and quantities of printed pieces. We had, what I call, \"The Junkmail Revolution.\" Our mailboxes were filled daily with unrequested brochures attempting to sell us something. We also had the changes in magazines. I can still remember magazines with fairly few ads and those were not placed so prominently. Today ads make up the majority of magazine space and content is sandwiched and snaked bewilderingly through the ads in whatever \"nonprime\" space remains. (You can always tell when advertisers are abandoning a magazine, it gets decidedly lighter but the amount of actual articles remains the same.)   \nThe point I was trying to make here (as well as in the new thread I started last week\\<\\<what\\>\\>) was that their are MORE than 2 dimensions to readability, not just short and long text. How do we read for recreation (novels)? How do we read for knowledge (non-fiction books)? How do we read things we are compelled to read by others (memos for work)? How do we read things we hate thinking about (tax forms)? How do we read ads vs. poetry? How do we read tabular material vs. paragraphs? Beyond that, what about reading as opposed to communication? Does faster reading mean more communication or are we just skipping quickly over things that bore us? What is the effect of illustration and photography on reading? Do we\n\n"
    },
    {
      "time": "14 Aug 2004 — 3:04pm",
      "content": "Sorry, this part got dumped in my last post:   \n. . . as well as in the new thread I started last week\\<\\<what\\>\\>)\"What are we REALLY measuring in Legibility/readability studies?\"\n\n"
    },
    {
      "time": "14 Aug 2004 — 3:09pm",
      "content": "Hrant,   \n\\>Reduced lighting, tired state, desire to finish a chapter\\<   \n   \nYou must have missread my post. I said \"I don't think she is in a hurry to finish her chapter.\" I confirmed this with her, she is not in a hurry to finish.\n\n"
    },
    {
      "time": "15 Aug 2004 — 7:07am",
      "content": "Okay, what would you find apt to set in DIN and in Futura (I consider both \"borderline\" typefaces and I never used them for text, maybe Futura once)?   \n   \nMy question is motivated by what I should expect from the design I'm currently working on, which I'd like to be as much readable as possible.\n\n"
    },
    {
      "time": "15 Aug 2004 — 12:38pm",
      "content": "Claudio,   \nDin was initially done as a signage face (and perhaps for OCR?) but I quite like it as text. To me, it works quite well when setting modern technical documents since it feels very precise and self-assured. I know I am going to get a big batch of hate mail and ridicule for what I am about to say now but I will say it anyway. I think it is truly beautiful. To me, It captures the essence of today's technology and makes me feel quite comfortable with it. I also have set my resume in FF Din (waiting for the rain of bullets from other Typophilers). I often use it for tabular material, screen presentations, charts and graphs, even for my daughter's book cover.   \nFutura is a different story. I can't use it in text at all. The very round glyphs with the narrow verticals are too uneasy for me. That may be purely my own aesthetic sense at work though. I do use it frequently for display--mostly just the capitals though. I also think the capitals are quite beautiful and should be in a type hall of fame if there ever is such a thing. I don't have a certain genre of material to suggest for Futura since it lends itself to many things.   \n   \nChrisL\n\n"
    },
    {
      "time": "15 Aug 2004 — 12:51pm",
      "content": "I forgot to mention the most important thing, Din, to me, is extremely readable. Keep in mind that I am one of the misfits in typographic society who sees no difference in readability between sans serif and serif as groups. I only see differences from one face to another. Example: I hate reading Palatino but like reading Verdana. I like reading Garamond as text but not more than small quantities of Bodoni at 14pts or larger. I do feel Bodoni is aesthetically one of the most beautiful faces ever drawn.   \n   \nChrisL\n\n"
    },
    {
      "time": "16 Aug 2004 — 3:26am",
      "content": "Chris said: \"I think it is truly beautiful. To me, It captures the essence of today's technology and makes me feel quite comfortable with it.\"   \n   \nSaid this, I probably have a big hit in the making (who am I kidding), since while I always liked DIN, I've never find it completely satisfying, especially the numerals. But as I challenged myself in designing what may be called my re-version of it (although it's not just that), I realized how much interesting it was to work within premises totally different than my old ones. In the end, not only I like the result, but I realized what you say, seeing how DIN is used.   \nI realized that I could push the concept even further, e.g. using DIN for setting a bible. I don't know when, but I'll release the family with Thirstype.   \nIf you write me your email, I'll send you a beta as I have completed the basic weight. Mine is tht (at) nettuno.it   \n   \nBesides, since you used DIN a lot, can you explain me why I always felt the condensed version \"more readable\" (in the sense Hrant says)?\n\n"
    },
    {
      "time": "16 Aug 2004 — 3:36am",
      "content": "I forgot. You say \"I forgot to mention the most important thing, DIN, to me, is extremely readable. Keep in mind that I am one of the misfits in typographic society who sees no difference in readability between sans serif and serif as groups. I only see differences from one face to another.\"   \n   \nA friend of mine (she's an history and literature teacher), said the Greek version of the face I'm working on, was way more readable than the many Greek faces aping Garamonds/generic Romans et al in which we usually have books of Greek classic writers set with (at least in Italy, an many are UGLY).   \n   \nI'm sure the merit goes all to my friend Panos Haratzopoulos (which did 99% of it), but I see your point. I mean I'd never use Helvetica in text (I did when I was 19) but a good use of Gill Sans is not problematic, for example.\n\n"
    },
    {
      "time": "16 Aug 2004 — 6:49pm",
      "content": "Claudio,   \nI would love to see your font! I will email you as you requested.   \nRegarding the condensed--I think because the full width had a signage basis, it is more open and spaced wider than is best for text. To my eye, the open space in the counters and the loose fit can get a bit overshadowing and start to break up the wordshape. The FF version is better suited for text and the condensed version draws a better word shape. I feel to optimize Din for text, it would be best to draw a slightly condensed version of the FF Din full width, not as condensed as the actual condensed since this would not work as well at smaller sizes.   \n   \nRegarding the Greek--I find this a fasinating coincidense. All of my ancesters are from Greece. I am second generation American and spoke Greek as a child. I can't wait to see your Greek version. I also find the typical roman versions of Greek to be somehow un-Greek. They look like an English or American scholar's vision of what Greek ought to be. I feel that Greek makes much more sense as a sans. By the way, your friend Panos's last name sounds similar to my cousins. His name is Haralambopoulos. Yasou Panos!   \n   \nChrisL\n\n"
    },
    {
      "time": "16 Aug 2004 — 9:26pm",
      "content": "\\> Haralambopoulos   \n   \nInteresting - there's a guy by the name of Yannis Haralambous who is very active in type design.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Aug 2004 — 6:07pm",
      "content": "I've been doing some reading about reading speed the last few days. Some meta comments first. While some people may choose to read slower because they are particularly enjoying the content, this is a rare state when you are actually thinking about the process of reading while reading (analogous to thinking about breathing - you can do it, but most of the time it just happens). Studies by James Sheedy at OSU and others report positive correlations between reading speed and decreased visual fatigue. When people read similar content with either good or poor typographic quality, the good typographic quality text will be read faster and with less visual fatigue. Reading is a gating faster. We can think faster than we can read, but the mechanical process of moving our eyes and absorbing the text prevents us from reading faster.   \n   \nWhich leads us to speed reading classes. There are several groups (at least in the US) that will teach students to read faster. They typically promise to double or triple your reading speed. Students who complete these seminars are usually quite satisfied. Just, Carpenter, and Mason (1982) measured the reading speed, comprehension, and eye movements of a group of successful speed readers and a group or normal readers. They found that their normal readers read Scientific American articles at a rate of 250 wpm while the speed readers read at a rate of nearly 700 wpm. The eye movements for these two groups differed greatly. While both groups read in the typical left to right, top to bottom direction, the speed readers had shorter fixations on a word and longer saccades with greater numbers of skipped words.   \n   \nWhile this sounds good for the speed readers, the tradeoff is that their comprehension was much poorer. On comprehension questions that has to do with the gist or the article, both groups were successful, but on questions that were more details, only the normal readers could answer them. Further analysis showed that if an eye fixation was not made on the detail asked about, the reader would not know the answer.   \n   \nIn a second part of the study, the researchers asked the normal readers to skim to attempt to finish an article in the same time as the speed readers. The normal readers had not been trained in speed reading techniques, but showed remarkable similarity to the speed reading group. Their reading rate increased to 600 wpm, their fixation times decreased, the saccade length increased, and their comprehension decreased.   \n   \nWhile I believe there is a strong correlation between the amount of time you have spent reading in your life and your reading speed, the evidence is fairly conclusive that it is not possible to read faster than 400 wpm without surrendering comprehension.   \n   \nDifferent topic: I agree that the hypothesis that letter space should be proportional to counter space is an interesting one, and one that I will include in my research. I think the best way of doing this is to look at the optimal letterspacing over several fonts expecting to find that fonts with larger counters need larger letterspace?   \n   \nCheers, Kevin\n\n"
    },
    {
      "time": "18 Aug 2004 — 7:22pm",
      "content": "\\> Reading is a gating faster.   \n   \nThis sounds important, but I don't get it - is there a typo somewhere?   \n   \n\\> the evidence is fairly conclusive that it is not possible to read   \n\\> faster than 400 wpm without surrendering comprehension.   \n   \nEvidence collected through faulty stimuli and subjects? What were the exact testing conditions? The reading experience of the readers, the typography, and the testing environment? Also, explicitly asking people to perform much better than they're used to can often backfire.   \n   \nNow, I'm not saying that everybody can read in \"deep immersion\" all of the time - and some people maybe never. But what I am saying is that making fonts in a certain way will allow some people to read in deeper immersion more often. This is the category of reading that I believe has not been properly measured yet.   \n   \nBut I certainly agree that \"speed reading\" is bogus. They can even go much higher than 6-700 wpm. But I also think that pushing people who normally read a given type of material at 250 wpm to suddenly more than double their speed cannot work: they simply don't have the experience, the store of boumas and the \"firmware\" to use them at speed. They don't have the practice to guess well deep into the parafovea. I believe it takes many man-months of reading immersively (and good testing conditions) for a subject's ability to saccade deeply -while preserving comprehension- to register on the lab radar.   \n   \nSo how do you measure what I'm talking about?   \nChoose your subjects, and your stimuli, properly, and _then_ push.   \n   \n\\> look at the optimal letterspacing over several fonts expecting   \n\\> to find that fonts with larger counters need larger letterspace?   \n   \nThis seems like a distraction. The more useful thing to find out first is simply what the optimal letterspacing is for a good conventional text font, like maybe Adobe Minion\\*. When you show the results to typographers, that will immediately tell you to what extent the empirical and anecdotal worlds are misaligned. BUT the test will only be relevant if you push as deep as possible into true immersion, otherwise it will simply be a self-fulfilling prophesy, simply another illusional validation of the half-world of the letterwise model.   \n   \n\\* Noting that a multiple-master font (if you can still find Minion in that incarnation - it shouldn't be too hard though) can be very useful in readability testing. For example you can choose instances of different widths and weights, within the bounds of anecdotal beliefs concerning quality.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Aug 2004 — 7:54pm",
      "content": "\\>\\>\\> Reading is a gating faster.   \n   \n\\> This sounds important, but I don't get it - is there a typo somewhere?   \n   \nYes, a typo. It should be reading is a gating factor. But \"faster\" and \"factor\" have the same word shape, so please forgive my mistake. ;)   \n   \nHrant, I don't see how you can dismiss this data. This is a group of people who believe that they can read at a rate of 700 wpm, and they were even measured as such in a lab setting. I believe they are your immersive readers. The problem is that it is Not Possible to recognize letters very far outside of the fovea. These readers guessed at what was there, and they were guessing wrong. The only way to read all the words is to look at them all.   \n   \nI believe the onerous is on you to find a set of immersive readers who can read at a super fast speed and understand what they were reading. I don't think they exist, so any study I run will be seen as faulty.   \n   \nCheers, Kevin\n\n"
    },
    {
      "time": "18 Aug 2004 — 8:20pm",
      "content": "I'm not dismissing the data. I don't dismiss _any_ data, since data itself cannot lie. The trick is seeing how a given piece of data fits. Interpretation of data is always subjective and based on assumptions.   \n   \nI think the data that leads to the letterwise model is indeed revealing (especially about the parallelism in the fovea), but it's also half the story.   \n   \n\\> I believe they are your immersive readers.   \n   \nDo you have details of the subjects, and the stimuli?   \n   \n\\> it is Not Possible to recognize letters very far outside of the fovea.   \n   \nWell, exactly! And this is why boumas matter. I believe that -aided by the semantic context of the phrase- frequently ocurring clusters of letters with distinctive envelopes _can_ be recognized far from the fovea - and why would the brain pass up the opportunity to recognize them (if it's pushing performance)? Maybe the readers in that test lost comprehension simply because they need more practice and/or the typography was not conducive to deep immersion - is that crazy? Even assuming good typography, maybe they need to improve their guesswork - just like a race car driver can make increasingly better instantaneous decisions about how to pass a car the more he has experience doing it. He certainly doesn't do it through conscious analysis - he does it through the low-level instinctive \"firmware\" which has evolved in him over time.   \n   \nI don't know who the onus is on to do what -certainly I'm not getting paid by anybody- but I do believe that a researcher who is truly concerned should be open-minded, and simply try to find something that _might_ exist. You can't really falsify results by doing so - at most you will find nothing. And you shouldn't be looking for boumas because I said so, but because so much anecdotal evidence (such as the importance of tight letterspacing, and serifs, and proper x-heights, etc.) goes so clearly against the letterwise model. I didn't arrive at the bouma model only through empirical analysis, or thin air, but by reconciling everything I've encountered, not least the anecdotal evidence.   \n   \nIn terms of testing, maybe it seems like I've put you in a position where you can never prove you're right. But I think it's really not that hard to devise a test that would satisfy \"us\" typographers: bring together highly proficient readers (instead of desperate college freshmen), and give them really good typography (instead of Courier), and then just see what happens.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2004 — 2:49am",
      "content": "Too much talk. It's my problem as well, and I'm trying to limit it.   \n   \nWhy don't we try, as Chris thought, and then I suggested, to start from a few typefaces we find both very usable/pleasing and not good/culturally exalted for text, (but not among the Garaldes which the average reader knows as the average)?   \n   \nFrom a few typefaces we can try to look for actually printed examples, produce ones of our own, and show examples to people, pals, and relatives around us (like I always do) to test how they are \"read\", \"felt\", and then felt appropriate for what.   \n   \nMy personal suggestions (to select a batch, but maybe a new thread is in order since this is becoming huge) are still Futura and DIN. The most interesting thing would be to find as much examples as we can of faces used in books (both novels and essays) which do not fall in the usual cathegories (no Garaldes, no Transitionals, maybe some Slab Serifs...)   \n   \nBack to Juan Pablo & Hrant: in Italy, as I previously said, the two words \"legibility\" and \"readability\" are one: \"leggibilit\n\n"
    },
    {
      "time": "19 Aug 2004 — 2:56am",
      "content": "It seems to me that the obvious thing to do is for Hrant to pick a kind of text (not a specific text, because we don't want him to be familiar with it), specify exactly how it should be typeset and printed, what kind of chair he would like to sit in, what kind of lighting there should be, etc., and then Kevin should measure Hrant's 'deep immersion' saccades and reading spead, and then test his comprehension of the content.   \n   \nOf course, Hrant may still find that the test environment prevents him from getting in the groove, and we'd still be left trying to design typefaces for uber-readers who may or may not exist.\n\n"
    },
    {
      "time": "19 Aug 2004 — 3:24am",
      "content": "\\> in Italy, as I previously said, the two words   \n\\> \"legibility\" and \"readability\" are one: \"leggibilit\n\n"
    },
    {
      "time": "19 Aug 2004 — 3:28am",
      "content": "Sorry, \"Asphalt\", \"Asfalto.\"   \nBut \"Alphalt\" sounds cool!!   \nBest,   \nDoctor Typo\n\n"
    },
    {
      "time": "19 Aug 2004 — 10:13am",
      "content": "Claudio:   \n1) There are so many intertwined variables in typography that it's difficult to test them either individually or as a group! So I think a good approach is to simply figure out what the brain likes in the overall and design from there. For example, using a single, \"reputable\" text face and seeing how much letterspacing is ideal for readability is a great looking-glass into the brain.   \n2) You cannot get reliable results by asking for conscious opinions. This is a fact\\*, and I think it's due to the separation between the conscious and subconscious aspects of the brain - and the latter is where immersion lies - like Kevin said, it's a bit like breathing.   \n3) Don't let the difficiencies of certain languages in certain fields, or the necessarily non-typographic, weak-context focus of general dictionaries dictate your thoughts.   \n   \n\\* For example, readers consistently choose too-large fonts as being most readable.   \n   \nJohn,   \nIt's seems like you've again reverted to your tactic of trying to isolate me. It's not about me, it's about intellectual integrity. Kevin shouldn't worry about boumas because I said he should, he should do it because the letterwise model is deficient. It doesn't explain how:   \n- serifs help,   \n- tight letterspacing helps,   \n- an x-height can be too small or too large,   \n- short and frequent words well into the parafovea are often skipped,   \n- there can be a contradiction within Kevin's own references concerning the readability of all-caps versus random-case setting (I elaborated on this to him, and I can do it again here if anybody wants).   \n   \nIf Kevin, you, or anybody else doesn't believe all the anecdotal evidence (and chooses to ignore some aspects of the empirical data to boot) then it's time to stop fudging. Say \"serifs don't help readability\" and \"letterspacing needs to be much looser\" and \"rhythm between letters is bogus\", as the letterwise model _requires_ you to do. Please stop focusing merely on countering whatever I happen to be supporting! It's like when you failed to note that Kevin supports loose letterspacing: it seems like you don't want to actually hear clear anti-establishment statements by anybody, you're just happy to see me countered! :-/   \n   \nAnd did you also fail to note the palpable scepticism towards the letterwise model (and even Kevin's overall empiricism) among some notable names in the audience at Thessaloniki? When the letterspacing issue came up, and Kevin asked some cascading questions to some members of the audience, like Southall, what was his last question, and what was the reply? Kevin asked \"if tests show that loose letterspacing helps readability would you change your practices?\" The reply was No. Why? Because Southall is a narrow-minded luddite? Quite the contrary - he's both an intelligent scientist and a keen typographer. He's sceptical because readability testing to this day has _not been good enough_. It doesn't matter what you think you're proving - it has to _make sense_.   \n   \nWith my exposure to both of empiricism and anecdotal evidence, I think I can propose certain types of testing that can have some hope of resolving this, of satisfying the _practicioners_, which is the whole point as far as I'm concerned. You need:   \n- good readers,   \n- good typography,   \n- a good environment,   \n- to measure and analyze deep saccades and extended reading speed.   \n   \nAlso, there is no Uber-reader. It's a matter of helping as many people as possible by facilitating longer saccades, that's all. I think you do this by promoting boumas, but it should be tested. However, lacking valid empirical testing does not mean Southall and others can simply stop thinking, or rely on half-baked empiricism where the subjects and stimuli simply validate the known half of reading.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2004 — 12:41pm",
      "content": "\\>I agree that the hypothesis that letter space should be proportional to counter space is an interesting one, and one that I will include in my research. I think the best way of doing this is to look at the optimal letterspacing over several fonts expecting to find that fonts with larger counters need larger letterspace?   \n   \nKevin, thanks for your interest in the hypothesis. (I have been away from the internet for a few days.) If you test it, I'd appreciate a note of acknowledgement in your report, unless the idea is already out there in the literature.   \n   \nAs to testing I think that one way that would be more systematic is to take the same typeface, and vary first the counters keeping the interletter space the same, and then the other way around. Is this possible to do with 'multiple master' typefaces? My hypothesis is that there is in fact some ideal, though a third variable, stroke width, might also be important.   \n   \nYou might take a face generally held up as very readable, such as adobe Garamond, keep the stroke widths the same, and do the variations, and locate the extremes where the reading speed or comfort declines.   \n   \nIf you want to then test whether this goes across faces, you would go to test a sans, such as Gill or Helvetica, and see whether the breakdowns are at similar ranges.   \n   \nAnother hypothesis I have is that in serifed faced words hold together better with greater interletter space between stems. In other words, in good serifed faces, we can do the advance planning of what words to look at next, using the current parafovea information (as you describe in your paper). The serifs, according to this guess, enable you to get wider spaces, nearer to the ideal of absolute and relative to counter spacing, than do sans.   \n   \nWhether the guesses are right or wrong it seems to me it ought to be possible to vary the absolute spaces and relative spaces, and really learn something about the limits of a good text face.   \n   \nOh, as well as relative counter/interletter space, there is also the issue of thick/thin contrast, where again I suspect there are limits on how great the contrast can be at small, text sizes, at which reading starts to deterioriate.   \n   \nA final guess is that (sorry Hrant) the traditional most used old style serif faces - Garamond, Baskerville, Caslon - will be within the ideal range, and you can't really improve on it. Of course the results will be much more interesting if I'm wrong in this.\n\n"
    },
    {
      "time": "19 Aug 2004 — 12:44pm",
      "content": "Hi,   \n   \nI believe the parallel letter recognition model is the best model of word recognition that we have available today. My paper on the topic is now on the Microsoft Typography website. In some aspects the model is far more detailed then I have had opportunity to talk about. In particular, there are attentional models of eye movements that explain several interesting behaviors including skipping words, super-short fixations, and refixations. In other areas the model is clearly underspecified. Letter recognition is one area that has not been studied in great detail. To say that the parallel letter recognition doesn\n\n"
    },
    {
      "time": "19 Aug 2004 — 1:04pm",
      "content": "\\> in serifed faced words hold together better with greater interletter space between stems.   \n   \nWilliam, you do realize that this \"holding together\" business is strictly anti-letterwise and pro-bouma, right?   \n   \n\\>The parallel letter recognition says nothing at all about these factors.   \n   \nI don't agree.   \nWhen you say that letters don't need to \"meld\" you're implying a lot of things about serifs, extenders, spacing, etc. And everything you're implying counters the anecdotal evidence.   \n   \n\\> the research into serif and san serif fonts ... is one of the most empirically researched questions in typography   \n   \nThe fact that you say this in all confidence is clear indication that you don't see what typographers are seeing. Comparing things like Times and Helvetica and concluding things about the relevance of serifs is, pardon the language, idiotic. Even John would agree with this. There have been NO tests that compare serif and sans fonts _properly_, and any serious typographer knows this.   \n   \n\\> no one has found any conclusive evidence that serifs are better than san serifs.   \n   \nYes, not \"conclusive\" - but that just comes back to the problem of lousy testing.   \n   \n\\> 17 hours of classroom training combined with at least an hour of   \n\\> individual practice six days a week for a period of seven weeks.   \n   \nI don't think this is enough.   \n   \n\\> among the top 10% of readers in the US.   \n   \nCould you elaborate on this?   \n   \nQuestion: Were the students paid to participate? How much? If it's the typical low amount, don't you think this skews the results towards underperformers?   \n   \n\\> There is no mention of the typography used other than ....   \n   \nA really bad sign, that.   \nIt's basically implying that the fonts -and even the layout- don't matter.   \n   \n\\> among the top 10% of readers in the US.   \n   \nAnd that brings the relevance of the results to ZERO. Sorry, Kevin.   \nThere's no way to get deeply immersed onscreen, yet. And what did they use, Arial?!   \n   \nMeasuring reading onscreen is useful only to the extent that it shows how far behind it is compared to print. You really need to do this in print, with proper margins, the works. Otherwise you're in a sandbox.   \n   \n\\> Now what happens?   \n   \nYou improve your testing. Until the _practitioners_, not fellow psychologists, are satisfied.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2004 — 1:26pm",
      "content": "\\>William, you do realize that this \"holding together\" business is strictly anti-letterwise and pro-bouma, right?   \n   \nNo, I don't think we are talking about the same thing exactly. I am referring to the bit in Kevin's paper where he talks about us identifying words ahead of where we can see clearly, in order to plan our next eye jump - unconsciously of course. Here it seems to me important to be able to identify where the words are along the line, and that influences our plan of where to put our eye. The word shape is i am guessing not that important-- though I may of course be wrong. I think the serifs help distinguish what is the location of the coming words vs the word spaces.   \n   \nThis is a different matter, but I think serifs also help the eye identify the line of text more easily in shifting from line to line, so that serifed faces need less leading for a comfortable read.\n\n"
    },
    {
      "time": "19 Aug 2004 — 1:33pm",
      "content": "William,   \n   \n**Kevin**   \n\\>I agree that the hypothesis that letter space should be proportional to counter space is an interesting one, and one that I will include in my research. I think the best way of doing this is to look at the optimal letterspacing over several fonts expecting to find that fonts with larger counters need larger letterspace?   \n   \n**William**   \n_Kevin, thanks for your interest in the hypothesis. (I have been away from the internet for a few days.) If you test it, I'd appreciate a note of acknowledgement in your report, unless the idea is already out there in the literature.\"_   \n   \nThere were archival notations on this matter by Sol Hess, former Type Director of Lanston, [http://lanstontype.com/LanstonMonotypeMachine.html](http://web.archive.org/web/20150416035504/http:/lanstontype.com/LanstonMonotypeMachine.html) along with minor published comments by Walter Tracy.\n\n"
    },
    {
      "time": "19 Aug 2004 — 1:37pm",
      "content": "\\> I think the serifs help distinguish what is the location of the coming words vs the word spaces.   \n   \nBut extenders (in the parafovea) don't convey any useful information?   \n   \n\\> serifs also help the eye identify the line of text more easily   \n   \nYou don't think leading makes this moot?   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2004 — 1:41pm",
      "content": "\\>archival notations on this matter   \n   \nGerald G. your link doesn't refer to any notes on this issue, which I would be interested to read. Can you quote the notations with references?\n\n"
    },
    {
      "time": "19 Aug 2004 — 2:04pm",
      "content": "\\>extenders (in the parafovea) don't convey any useful information?   \n   \nWell, Kevin mentions that we tend to skip some specific short words like 'and', so here the word shape might have useful planning information while in the parafovial vision. I can't think of other uses for that info in parafovial vision, but there may be. I would suspect that extenders help quick letter recognition when we are looking with the fovia, with sharp vision.   \n   \n\\>You don't think leading makes this moot?   \nI have read guidelines which say that to make sans serif lines more readable, you should shorten the lines and give them more leading. You could also make them a larger size, and end up with equal readability. But here you end up losing a lot of space. Since we are talking about extended text, this is an important consideration.\n\n"
    },
    {
      "time": "19 Aug 2004 — 2:36pm",
      "content": "\\> There have been NO tests that compare serif and sans fonts properly, and any serious typographer knows this.   \n   \nHrant, you are a most avid reader. Dr. Lund's dissertation cites 72 studies comparing serif and sans serif fonts. I hadn't realized that you had read each article and dismissed each for their poor methodology. I myself have only read a few of these articles.   \n   \nCheers, Kevin\n\n"
    },
    {
      "time": "19 Aug 2004 — 3:59pm",
      "content": "William, by promoting any sort of \"bonding\" between letters (including your valid point about the relationship between counters and inter-letter spaces) you're in effect supporting boumas.   \n   \n\\> Kevin mentions that we tend to skip some specific short words like 'and',   \n\\> so here the word shape might have useful planning information while in   \n\\> the parafovial vision. I can't think of other uses for that info in parafovial vision   \n   \nTaylor & Taylor point out that about _sixty_ words are often skipped over\\*. In my mind these are simply the ones that have registered in legibilty studies so far (because of their extreme frequency and good distinctiveness) - they're the tip of the iceberg. I see no reason why \"and\" can be skipped over but \"read\" for example cannot. So the use of \"that info\" in parafoveal vision is obvious: to increasing reading speed/comfort! Why would there be a finite list of words that can be skipped over, while the rest can't? The brain wastes nothing, and its heuristic nature means that it _guesses_, with accuracy increasing with experience.   \n   \n\\* And when I see \"skipped\" I don't mean used to decide on a fixation point - I mean skipped as in not subjected to letterwise decipherment. How can this ever happen in the letterwise model? With no loss of comprehension, mind you.   \n   \n\\> to make sans serif lines more readable, you should   \n\\> shorten the lines and give them more leading.   \n   \nThe reason I can think of for this is to increase the ratio of leading to letterspace, since sans fonts don't \"bond\" as well - but it seems tenuous. I think this might only matter when leading is extremely tight.   \n   \n\\> You could also make them a larger size, and end up with equal readability.   \n   \nNo, size doesn't always translate to higher readability - this is proven.   \n   \n--   \n   \nKevin, obviously I haven't read -or even seen- all of those. But I've seen many over the past 6 years, and in discussing legibility studies with many people nobody I know has ever seen one that makes sense in terms of the serif-verus-sans issue (and really most anything else). This is a classic failing that most of \"us\" know about. But if you think there's been one that would come close to being an intelligent comparison (as opposed to the Times-versus-Helvetica delusion) please let me know - I'll spread the word.   \n   \nTo be fair though, part of the reason for this failing in empirical research has been the lack of proper fonts to test with. However, for the past decade or two there have been a number of superfamilies with very close serif and sans fonts - any one of those would be a decent choice. Arial at 16 PPEM is not.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2004 — 5:54pm",
      "content": "Why is comparing Times and Helvetica a delusion? One way to compare serif and sans serif fonts is to look at exemplars of each group. Of course it would be better to look at several of the best and most frequently used serif and sans serif fonts, but this tact has the advantage of being very practical. Usually when people say that serifs are better than sans serifs they are talking about these fonts they have experienced, and they want to know if they should be using Times or Helvetica. I agree that using a metafont is appealing because it does allow for a more controlled study\n\n"
    },
    {
      "time": "19 Aug 2004 — 6:23pm",
      "content": "\\> Why is comparing Times and Helvetica a delusion?   \n   \nBecause a dozen other variables are different between them (including letterspacing), so there's no way you can know what you're actually measuring. You say \"exemplar\", but I don't see what that could really mean here. Comparing Times and Helvetica might help in choosing between those two fonts (assuming the testing is sound, which it's rarely even been so far), but it really says nothing about serifs. The generalization simply does not hold - how could it? If it did, then basically nothing besides serifs could matter in type design! (John, why are you so quiet on this now?...)   \n   \nPeople who want to know whether to choose between Times and Helvetica are not worth much thought in the realm of readability testing, because they're necessarily at a level where they could never produce optimally readable layouts to begin with. But for the niche user who is truly in interested in a useful answer to the serif-vs-sans issue, the most we can do, and what we should do already, is give them _guidelines_, not hoaky canned conclusions.   \n   \n\\> The words that are skipped are short and close   \n\\> enough to the fovea to have their letter\n\n"
    },
    {
      "time": "19 Aug 2004 — 9:06pm",
      "content": "I forgot something:   \n\\> the traditional most used old style serif faces - Garamond, Baskerville,   \n\\> Caslon - will be within the ideal range, and you can't really improve on it.   \n   \nAlthough I think there's room for improvement, I have to admit that I think it would be small. However, I think that's only true of you stick to the \"conventional\" alphabetic structures - the ones the mainstream of type design teaches. An abiding interest of mine is trying to figure out how the Latin (or really any) alphabet can be \"bent\" to improve readability notably. This pisses off a lot of purists, but I think laymen would welcome it - actually, a central point is they wouldn't even notice it!   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2004 — 11:31pm",
      "content": "Hrant, I'm not trying to isolate you. If you know other people who read in a deep immersive state at very high speeds, bring them along. My point is that you are making claims -- solitary claims, as far as I can tell -- about being able to read in what is, by any standard, a very advanced way. And you have been very critical of any reading tests on the grounds that they fail to test the performance of people like you. My suggestions was a little tongue-in-cheek, but it is not meant belligerently. I'm interested to know just how you think your performance, and that of people who read like you -- or like you claim to read: I will admit being skeptical --, could be tested. You've identified what you think is wrong with previous tests, and from these comments I've concluded that the best thing to do is have your reading speed and comprehension tested.   \n   \nOne question: do you think you read equally fast and well in both English and Armenian?\n\n"
    },
    {
      "time": "20 Aug 2004 — 7:21am",
      "content": "When did I ever say anything about my own reading practices? The only -highly informal- thing I've tried on myself is the RSVP stuff, where I noticed that 400 wpm simply feels slow - and I think most decent readers would agree. And when did I say that only some people can attain deep immersion? I think any physiologically normal adult can do it, and _does_ do it. I certainly don't consider it \"very advanced\". What I do think is that:   \n1) The more practice you have the deeper you can go (if the typography allows it).   \n2) Faulty empirical testing has so far uncovered only a hint of it (eg the short & frequent skipped words).   \n   \nMy stance is only \"solitary\" in its elaboration - I believe many people who think about this deeply enough essentially agree with me. In fact I see the anecdotal stances (like that of Southall) as being validation of the bouma model. My stance is not a result of halucinations, but some pretty straightforward things like empirical testing (more the older foundational stuff like retina acuity, not the flawed contemporary high-level tests), logical thought (like why would the brain not use parafoveal information?) and anecdotal evidence (like serifs help readability).   \n   \nI don't believe the letterwise model simply because it doesn't make sense, on many levels.   \n   \n\\> do you think you read equally fast and well in both English and Armenian?   \n   \nSince I read English much more, I'm sure I read it faster.   \n   \nBut in terms of the inherent readability of the two scripts, Armenian is better (because the information is spread vertically more richly). English however is more harmonious in its shapes and enjoys greater legibility.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Aug 2004 — 2:13pm",
      "content": "Well, Hrant, you were talking about 'highly proficient readers', and you seem to be talking about 'deep immersion' reading at speeds of 700 WPM or greater without loss of comprehension (i.e. not skimming or 'speed reading'). Either _every_ empirical test of reading speed and comprehension is deeply flawed, or what you are talking about is well beyond average.   \n   \nWhen you say things like 'The more practice you have the deeper you can go', I have to wonder what you mean. 'Deeper' is a metaphoric adjective. I really don't know what this is supposed to mean in terms of reading.\n\n"
    },
    {
      "time": "20 Aug 2004 — 3:36pm",
      "content": "\\> you were talking about 'highly proficient readers'   \n   \nOnly in terms of testing. Because it is they who will most clearly indicate the presence of boumas. Boumas don't kick in beyond a certain magical number (certainly not something as high as 700 wpm), they're simply relied upon to increasing degrees, and at low speeds the ripples on the surface as easily dismissed. But as Kevin noted, even slow reading efforts can exhibit skipped words. So \"deep immersion\" is not an accurate, \"scientific\" term, and there's no qualitative difference between the different degrees of immersion - I guess it's just a matter of how obvious the presence of boumas becomes. So you could say that \"deep immersion\" is where nobody could really deny that boumas are present, which is why it's a good thing to test with.   \n   \nSo the purpose of testing with \"highly proficient readers\" isn't to gauge of how most people read (which seems to be the main intent of most field research, unfortunately), it's to figure out what can be done to make more people read more immersively.   \n   \n\\> Either every empirical test of reading speed and comprehension is deeply flawed   \n   \nI think some of them (like Patterson & Tinker's) have been decent. The biggest problem I have is with the recent ones that use inferior stimuli (like Arial onscreen) and hopeless \"shallow-immersive\" subjects; just because they use the processing power of computers they think they're hot stuff - but their whole foundation is off. There's a tendency to over-value newer research; I think the most recent stuff has been thrown off by the charms of raw processing power. Huey didn't need computers to come up with those amazing insights of his in 1908.   \n   \nDesigners who care (not the ones who don't [want to] give a hoot about readability in the first place) are justifiably turned off by empirical testing of readability. Why, because they're unreasonable? No, I think it's because the tests have been moot (like the Times vs Helvetica stuff), and most researchers don't pay attention to the complaints of the practitioners. But I have to say that I have a good feeling about Kevin - let's see what happens.   \n   \n\\> 'Deeper' is a metaphoric adjective.   \n   \nNot in this case - I just meant deeper into the parafovea.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Aug 2004 — 4:03pm",
      "content": "I wish I could read quicker so I would not have to admit skipping not only words but entire postings.   \n   \nIt's a snoozer.   \n   \nJohn\n\n"
    },
    {
      "time": "20 Aug 2004 — 5:00pm",
      "content": "Perhaps a good reading test would be to use DeGroot's Thesis--The Sans, The Mix, The Serif (using only the\"Regulars\"). This would eliminate a great deal of variables since it is basicially the same font with serifs added in different degrees. This was a designed family, not a \"Test Case\" so it will not suffer the \"This is just a wanna-be-font\" glances.   \n   \nChrisL\n\n"
    },
    {
      "time": "21 Aug 2004 — 4:49pm",
      "content": "BTW, here's a really good candidate for readability testing:   \n [https://listserv.heanet.ie/cgi-bin/wa?A2=ind0309&L=typo-l&D=0&I=-3&P=26040](http://web.archive.org/web/20150416035504/https:/listserv.heanet.ie/cgi-bin/wa?A2=ind0309&L=typo-l&D=0&I=-3&P=26040)   \nAlthough to a great extent she doesn't (or at least didn't, when she wrote that) really \"get it\" - for one thing note the clear contradiction in the middle of the first paragraph. But since a layman's conscious understanding of the mechanics of reading is irrelevant anyway, she might make a great test subject.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Aug 2004 — 4:13am",
      "content": "No, Hrant (oh, gosh ho mamy rivers of ink since I was at the sea!), you misunderstood me, probably because I mentioned \"printouts\" as well.   \nWhen I ask a friend, a relative or so about what they found more \"readable\" (leggibile) meaning they did not found hindrance and thet were not \"distracted\" to the point of even \\*noticing\\* the typeface, I ask about books or pages they have \\*already\\* read.   \n   \nFor example, the statement of my friend about my Greek, came from her, without me asking. Seeing a comp of it, she spontaneusly said: it reads a lot better than the usual Greek fonts they use in books. And she's a teacher, so she was exposed to a lot \"serifed\" or \"latinized\" Greeks. Thats simply zhat I meant.   \nNothing more.   \n   \nThe rest, I try to care about it as I design, depending on how much I want my face \"readable\", and how much I want it \"visually conveying\". The priority is oscillating among the extremes, for me. That's why I think you'll end up talking endlessly, since you despise so much the \"unreadability\" of display faces I fear you will continue to exclude them from the picture, maybe even unwillingly.   \n   \nAnd Alessandro, how the heck \"visibilit\n\n"
    },
    {
      "time": "22 Aug 2004 — 2:43pm",
      "content": "Have you never seen a text face used for signs?   \nAnyway, despite my passion to go off-topic,   \nthis was not the case, Mr. Claudio Piccinini,   \nI probably missed many of the posts of this thread   \nand I read \"Display v. Text\" in the topic.   \nAlso, are you sure that you can literally translate   \nthe same word in different languages, meaning the same?   \nDo you think that a text typeface has no visibility?   \nI would like to know what you think, no matter   \nif I am right or a knucklehead, grazie.   \n   \nAS\n\n"
    },
    {
      "time": "22 Aug 2004 — 3:01pm",
      "content": "By some cosmic coincidence, the day that Kevin mentioned Ole Lund in this thread, I got a package from Ole containing a copy of his PhD dissertation at Reading (almost 300 pages - very oldschool) and photocopies of other articles and reviews he's written.   \n   \nAlthough I have only an imprecise view of Ole's position in matters of readability, and I haven't read all the material yet, skimming through it does reveal some choice snippets:   \n   \n\"If we take the results of legibility research at face value ... then we are bound to conclude that a great deal of useful work has been done, and what we need is more of the same. If, on the other hand, we take a more critical look at the details of experimental design then maybe ... much of the effort put into empirical testing has simply been wasted.\"   \n- Macdonald-Ross   \n   \n\"The two Baskerville typefaces are, as is clearly shown in the book, two different typeface designs. It is thus difficult to say whether differences in reading speed are caused by the different x-heights or by other design differences.\"   \n- Ole Lund   \n{Times versus Helvetica? Puhleez.)   \n   \n\"I managed to track down 72 relevant experimental typeface legibility studies, and I then performed a detailed and critical review of 28 of these 72 studies - all published between 1896 and 1997 and based on a wide variety of rationales and operational methods.   \n .... nearly all of the 28 reviewed studies lacked internal validity.\"   \n- Ole Lund   \n   \n\" .... dubious and even seriously flawed legibility studies are frequently and indiscriminately cited in the fields of typography and information design.\"   \n- Ole Lund   \n   \n\"The irony is: whereas this unpretentious non-scholarly magazine\\* admirably treats Wheildon with tongue in cheek, two books on information design reveal difficulties in discrimating between seriousness and blatant outrageousness.\"   \n- Ole Lund   \n\\* x-height.   \n   \n{On the supposed advances in legibility research thanks to computers:}   \n\"The mistake [of cognitive science] is to suppose that in the sense in which computers are used to process information, brains also process information.\"   \n- John Searle   \n   \n\".... the translation of \"findings\" from experimental research to the practice of typographic design has to be done with great caution. And ... that translation is even less assured when experimental validity cannot be taken from granted in the first place.\"   \n- Ole Lund   \n   \n\"Such tests of lettering as these are therefore useful in disposing of pseudo-scientific arguments, but in cases where the results strongly favour a particular design they must, to be of any practical use to designers, be elaborated upon so that we can clearly understand why one design functions more effectively than another.\"   \n- Herbert Spencer   \n{Ergo: Ranking individual fonts as an end and not a means is moot.}   \n   \n--   \n   \nKevin, some type people are critical of empirical research -or simply don't want to know- out of what I consider to be anti-craft ideology. Ignore them. But some type people (like Ole, I think) are both interested and reasonable, they're just unhappy at the totally flawed foundation that continues to make virtually all empirical research in effect invalid, or at best misleading. I think you're in a unique position, because you have the empirical training and power of logic, you're mixing it up with us, and career-wise you're very well-placed. If you can bear to put up with the occasional confrontational person like me, I think you can be the first to draw the respect and attention of those among us who are genuinely concerned, but have some built-up scepticism.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Aug 2004 — 9:10am",
      "content": "Well, I am going to comment on this unimportant matter.   \n   \nSo we have these studies, we list typefaces that are speedy for the readers that do not know how to use a reference book. Or those that do not know that librarians can take care of their requirements while they are drinking fine Armenian tea which is a far more worthy pursuit.   \n   \nSo what? We have studies. Governments have studies, everybody has studies. No big deal. Studies are a big yawn.   \n   \nDo we all design for these kooks? Or do we continue to design type for people that enjoy reading and learning? Those that enjoy language, those learned enough to enjoy your type design, also perhaps, allow themselves the wonders of poetry such as our Italian friend Alessandro Segalini, or myself, a fellow Italian. I know, Italians are the great lovers.   \n   \nBut those that think heavy breathing over some information filled text which is out of date when written is better. Well what can I say. Women should give them wide berth.   \n   \nOr do we design for tecno nerds. The answer for me is very easy, but I can't speak for all of you. Some of you are pretty strange.   \n   \nI accept that there is a \"group\" very small, and rather of questionable dignity that enjoy horse racing. Others just enjoy horses.   \n   \nSo let us compare this to a wine glass. Do we design a wine glass with the smallest footprint, the most efficient glass, lightest weight?   \n   \nThat would be plastic cups.   \n   \nSo enjoy your next glass of wine with you horse racing typography.   \n   \nI'm betting the winners are the losers.\n\n"
    },
    {
      "time": "23 Aug 2004 — 9:18am",
      "content": "\\> Studies are a big yawn.   \n   \nYour Favorite Font Sucks.   \n   \nAnd don't apply for a job at Riedel.   \nThey actually believe that the human taste and olfactory systems have physical attributes.   \n   \nhhp\n\n"
    }
  ]
}
