{
  "id": "59093",
  "title": "Typophiles with a background in experimental psychology",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm trying to track down members from typophile who have at least the equivalent of an honours undergraduate degree in experimental psychology (most people's bio's aren't filled in).\n\nIf you like, you can email me directly:\n\ntypographer roundlittleatsymbol geemale kom\n\nThank you.\n\n",
  "author": "Chris Dean",
  "time": "16 Jun 2009 — 9:46am",
  "uid": "/web/20130820033726/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "16 Jun 2009 — 2:46pm",
      "content": "You must like testing Google's spam filters a lot! This is like the second time I've seen you post a naked email address!\n\n"
    },
    {
      "time": "16 Jun 2009 — 5:08pm",
      "content": "What is a naked email address? Is this a problem? How do I fix this?\n\n"
    },
    {
      "time": "16 Jun 2009 — 6:21pm",
      "content": "Oh not a problem per se - you just made it really easy for folks to scrape your email address and send your email account as much spam as they possibly can. I usually do something called obfuscation where I spell out the email address but in such a way that one has to manually put it together to send me an email - something like so: notmyemail [at] domain.com. It at least makes someone (or their script) have to do some work before getting a valid email address. As your post is right now, your email is available for Google to search and cache. Fortunately you are using an email provider with fairly excellent spam filters!\n\n"
    },
    {
      "time": "17 Jun 2009 — 7:56am",
      "content": "\\>Anyone?\n\n ![](http://web.archive.org/web/20130820033726im_/http:/typophile.com/files/venkman_5566.jpg)\n\nBzzzzzzz. Ah, so close, it's actually Frutiger _Next_. Only 67 more to go...\n\n"
    },
    {
      "time": "17 Jun 2009 — 8:52am",
      "content": "@ sii: I'm not sure I get that last one…\n\n"
    },
    {
      "time": "17 Jun 2009 — 3:19pm",
      "content": "Sorry, I guess I'm just too old. :-(\n\n"
    },
    {
      "time": "17 Jun 2009 — 4:38pm",
      "content": "Sii: I didn't know he was a Typophile! Say, Ghostbusters is out on Blu-Ray this week. :)\n\nChristopher: Well, there's me for one.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "17 Jun 2009 — 4:56pm",
      "content": "Oh man, Ghostbusters on Blu-Ray and I'm supposed to be cutting back on the discretionary spending.\n\n"
    },
    {
      "time": "17 Jun 2009 — 6:45pm",
      "content": "@ Phinney: Can you tell us about your background in psychology? Nothing there in your bio.\n\n@ Daniels: You're working with Dyson. Do you have any psychology under your belt? I assume you are learning a lot by working with her.\n\n"
    },
    {
      "time": "17 Jun 2009 — 8:12pm",
      "content": "_What is a naked email address? Is this a problem? How do I fix this?_\n\nChristopher, I believe I tried to warn you about this in an older post of yours. By naked e-mail address, Ben means that you are using the e-mail address, as is, on a website (this one), where it can be picked up by a [spambot](http://web.archive.org/web/20130820033726/http:/en.wikipedia.org/wiki/Spambot). A way of avoiding this is by typing it indirectly. For example, like this:\n\ntypographer [at] gmail [dot] com\n\nor like this:\n\ntypographer-at-gmail-dot-com\n\nThe idea behind this is that thinking humans will get it, but unthinking spambots won't. :-)\n\n[EDIT] Ack, I belatedly see that Ben already answered your question. Oh well...\n\n"
    },
    {
      "time": "17 Jun 2009 — 10:17pm",
      "content": "So we have [Phinney](http://web.archive.org/web/20130820033726/http:/typophile.com/user/909), [Larson](http://web.archive.org/web/20130820033726/http:/typophile.com/user/4431)…\n\n"
    },
    {
      "time": "17 Jun 2009 — 10:39pm",
      "content": "\\>@ Daniels: You’re working with Dyson. Do you have any psychology under your belt? I assume you are learning a lot by working with her.\n\nNot currently working with the good doctor. I do have a little bit of psychology in my past, which certainly helps with typophile. I was accepted into Reading to read psychology, but jumped ship over to HMS typography, and the rest, as they say is history.\n\n"
    },
    {
      "time": "19 Jun 2009 — 11:57am",
      "content": "Regarding my use of names, using last names is a convention in academia (science). Consistently using people's last names between disciplines (typography and psychology) assists me with my memory. As I have a neurological and seizure disorder, memory formation is a significant problem with me as a side effect of my seizures and the associated medications. I will most likely continue using this convention. No disrespect is intended.\n\n"
    },
    {
      "time": "22 Jun 2009 — 8:28pm",
      "content": "Christopher:\n\nMy undergraduate degree was in psychology, and I had a particular interest in legibility research, which admittedly was really in its infancy at the time.\n\nI didn't technically end up with an honors degree because I did my last year of the degree a couple years later at another school and transferred credits back, but I had been in the honors program for the previous years.\n\nOh, and I also don't talk about the semester I spent at Reed College when I had just turned 18, that's another whole story. :)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "23 Jun 2009 — 12:21am",
      "content": "_Regarding my use of names, using last names is a convention in academia (science)._\n\nNice. And the army, gaols, and domestic service. My paper, Jeeves!\n\n"
    },
    {
      "time": "23 Jun 2009 — 11:03am",
      "content": "Also most sports teams. Ichiro gets an exemption. And the Yankees and Red Sox players only get numbers.\n\n"
    },
    {
      "time": "23 Jun 2009 — 4:49pm",
      "content": "Good point, Daniels.\n\n"
    },
    {
      "time": "24 Jun 2009 — 2:48am",
      "content": "Oh, I'm so sorry! How could I have missed this?  \nGood thinking, 99!\n\n"
    },
    {
      "time": "24 Jun 2009 — 11:33am",
      "content": "Christopher - if you want me to remove your 'naked' email address' for you I can. Just let me know.\n\n"
    },
    {
      "time": "24 Nov 2009 — 12:53pm",
      "content": "Maybe?  \n [http://posterous.com/people/4bhqr2xXikQV](http://web.archive.org/web/20130820033726/http:/posterous.com/people/4bhqr2xXikQV \"http://posterous.com/people/4bhqr2xXikQV\")\n\nhhp\n\n"
    }
  ]
}
