{
  "id": "59111",
  "title": "New Microsoft Fonts Available from Ascender Corp",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [billdavis](http://web.archive.org/web/20100103130943/http:/typophile.com/user/3095 \"View user profile.\") : 16.Jun.2009 9.30pm \n\nElk Grove Village, IL — June 17, 2009 — Ascender Corporation, a leading provider of advanced font products, today announced the availability of an expanded selection of fonts licensed from Microsoft Corporation. The new offering includes many of the newest fonts included with Windows and Microsoft Office.\n\nMicrosoft fonts are renowned for their on-screen quality and extensive character sets. The new fonts available from Ascender comprise a diverse collection of Latin and multilingual fonts including Calibri™, Cambria™, Consolas™, Segoe™ Script, Segoe Print, Gisha™ (Hebrew) and Leelawadee™ (Thai). The Microsoft fonts are available in the OpenType font format.\n\nThe fonts distributed in Microsoft products come with a workstation license. If customers want to utilize the fonts on a server or distribute them in a hardware or software product, an additional license from Ascender Corporation is required. Ascender is also able to modify and adapt the Microsoft fonts to meet any specific needs of software developers and hardware manufacturers.\n\n“Microsoft’s fonts are renowned for their display quality and are often desired by hardware and software developers to enhance their products or address compatibility requirements,” said Ira Mirochnick, President of Ascender Corporation. “These newly available Microsoft fonts will enable developers to better address Windows and Microsoft Office compatibility issues and to enhance the overall experience of their users.”\n\nThe Microsoft fonts are all available immediately for end-user purchase and download from the AscenderFonts website: [http://www.ascenderfonts.com/category/microsoft.aspx](http://web.archive.org/web/20100103130943/http:/www.ascenderfonts.com/category/microsoft.aspx \"http://www.ascenderfonts.com/category/microsoft.aspx\").\n\nDevelopers can preview the Microsoft fonts and obtain licensing information from the AscenderCorp website: [http://www.ascendercorp.com/fonts/microsoft/](http://web.archive.org/web/20100103130943/http:/www.ascendercorp.com/fonts/microsoft/ \"http://www.ascendercorp.com/fonts/microsoft/\")\n\nAbout Ascender  \nAscender Corporation is a leading provider of advanced font products. Ascender’s founders are font industry experts and have been involved in developing many of the most important and influential fonts used in computers, mobile devices, consumer electronics and software products. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises, software developers and hardware manufacturers. Ascender also provides an extensive collection of TrueType & OpenType fonts for download to graphic designers and consumers through its font websites, including [www.AscenderFonts.com](http://web.archive.org/web/20100103130943/http:/www.ascenderfonts.com/ \"www.AscenderFonts.com\").\n\nContact: Bill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225, Elk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730  \nFax: (847) 357 0731  \nEnglish: [http://www.ascendercorp.com](http://web.archive.org/web/20100103130943/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com\")  \nGerman: [http://www.ascendercorp.de](http://web.archive.org/web/20100103130943/http:/www.ascendercorp.de/ \"http://www.ascendercorp.de\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103130943/http:/typophile.com/user/3095\" title=\"View user profile.\">billdavis</a>",
  "time": ": 16.Jun.2009 9.30pm",
  "uid": "3095",
  "comments": [

  ]
}
