{
  "id": "59133",
  "title": "Using small cap parentheses",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Please excuse the uninformed question (I'll gladly be pointed somewhere if this was discussed before): I think I've never worked with a font before that had small cap parentheses, and now that the wonderful Whitman has presented them to me, I'm both thrilled, and not quite sure if/how best to use them.\n\nThe book in question is a German sorta semi-scholarly nonfiction publication. I'm setting quoted researchers' names in SC, so together with OSFs the small cap parens seem to work quite nicely in situations like these:\n\n ![](http://web.archive.org/web/20150418223318im_/http:/typophile.com/files/parens1_3973.gif)\n  \n…but I'm uncertain for parentheses that have a cap-initialled small cap name and a year:  \n\n ![](http://web.archive.org/web/20150418223318im_/http:/typophile.com/files/parens2_6670.gif)\n  \nThe small ones look nicer to my eye in the overall texture; but I wonder if that small cap parenthesis doesn't look a bit silly in front of the cap?\n\nMostly I guess I'm worried I'll open up a can of worms because sometimes these \"short\" parentheses will be rather close to a parenthesis with more stuff in it that isn't in small caps, so I'll need the full-height ones there…\n\n ![](http://web.archive.org/web/20150418223318im_/http:/typophile.com/files/parens3_6143.gif)\n  \nStuff like this makes me think I'll run into far less trouble if I just stick to the full-height ones. But the small ones look better. And what would one use them for, if not for stuff like this?  \nCan you tell I'm confused? \n",
  "author": "nina",
  "time": "17 Jun 2009 — 1:26pm",
  "uid": "13487",
  "comments": [
    {
      "time": "17 Jun 2009 — 2:25pm",
      "content": "I agree that those small cap parentheses look very nice indeed, but I have a feeling they're intended for paragraphs or lines set only in small caps. To my eye, the short parenthesis looks worse next to a full cap than the full paranthesis does next to a small cap or text figure. And if the text has cascading parantheses, you may get into even more trouble.\n\nBut yes, they look absolutely wonderful. By the way, have you found examples of historical use of small cap parantheses? Or are they a new invention?\n\n"
    },
    {
      "time": "17 Jun 2009 — 2:51pm",
      "content": "<cite>\"I have a feeling they’re intended for paragraphs or lines set only in small caps\"</cite>  \nHm, that would make sense I guess. :-\\\n\n<cite>\"To my eye, the short parenthesis looks worse next to a full cap than the full paranthesis does next to a small cap or text figure.\"</cite>  \nYeh, I think I agree. But the short one next to small caps or OSFs is verrry sweet… now that I've found that, I'd hate to lose it again. On the other hand, mixing both styles seems like a bad/dangerous/tricky idea.\n\n<cite>\"have you found examples of historical use of small cap parantheses?\"</cite>  \nI haven't searched. :-)&nbsp;&nbsp;I was never aware of these, to be honest. My style guides don't mention them either. I did find a couple of mentions on them on Typophile, but more in terms of a couple of type designers saying these might make sense to make – but without an exploration of how exactly they might be used.\n\n"
    },
    {
      "time": "17 Jun 2009 — 3:00pm",
      "content": "I think the small parentheses are part of many of Slimbach's fonts. I know for sure Abobe Jenson. I think they look a lot nicer in situations like your first.\n\nIf you have the option, is it possible to do the reference names in all small caps? That would be one solution.\n\nOtherwise, I don't think there are any rules, so you get to decide what looks best, so long as you can get it by whoever has the final say.\n\n"
    },
    {
      "time": "17 Jun 2009 — 5:08pm",
      "content": "<cite>\"is it possible to do the reference names in all small caps?\"</cite>  \nI wonder. There are people referenced in there with names like _LeDoux_, so that might get hairy (plus it would look a bit more \"unusual\", so the editor might object – I'm already glad he lets me do the small caps for names to begin with, as that seems to count as old-fashioned now?).\n\nI'm glad to hear there don't seem to be any hard-and-fast rules. I'll gladly make some variants and look at them for a few days.\n\n"
    },
    {
      "time": "18 Jun 2009 — 5:23am",
      "content": "I'll definitely go with the author's reference set in all small caps - it reads much better:\n\n ![](http://web.archive.org/web/20150418223318im_/http:/typophile.com/files/smallcaps_quotation_4315.jpg)\n\n"
    },
    {
      "time": "18 Jun 2009 — 5:43am",
      "content": "Wow, Zeki is everywhere. :-)\n\nYou're right actually! Thank you. I was worried the all-small-caps treatment wouldn't work for names that appear in running text (especially in German, which has a lot of caps), but I was wrong:\n\n ![](http://web.archive.org/web/20150418223318im_/http:/typophile.com/files/parens5_4970.gif)\n  \nInteresting: It looks like it might be possible to differentiate between parentheses for pure references (short ones), and comments that belong to the text (full-height ones)! \n\nEdit, PS: I think, I see, I need more leading.\n\n"
    },
    {
      "time": "18 Jun 2009 — 5:56am",
      "content": "\"Interesting: It looks like it might be possible to differentiate between parentheses for pure references (short ones), and comments that belong to the text (full-height ones)!\"\n\nIn fact, in the example above I've set everything included between the two quotation-parentheses - zeki, 1978 etc. - all in small caps, commas and parentheses included. I'm sure Whitman, like other quality fonts, was designed with a very strong attention to the details in every glyph, so why don't use those features when you have it?\n\nAbout the leading: my example text was set in 11/13, but I feel Whitman, like Adobe Garamond, tends to work better with a little less leading, in general - so that the text block looks \"thicker\". But it also depends on the line lenght of your page. If it can help in any way, sometimes I tried to reduce the leading from 13 to, say, 12,8, gaining one line per page and a much more thicker text block.\n\nBy the way, Zeki rules. :-)\n\n"
    },
    {
      "time": "18 Jun 2009 — 6:12am",
      "content": "<cite>\"in the example above I’ve set everything included between the two quotation-parentheses - zeki, 1978 etc. - all in small caps, commas and parentheses included\"</cite>\n\nOh, absolutely! What I meant was that, as in the example I posted, my texts here also use parentheses for other purposes – so in those cases I'd use the full-height ones, and the \"short\" ones only for references, so that's a rule that seems to make sense. I was previously worried about mixing the parentheses styles/sizes in a somewhat arbitrary fashion. I'm too Swiss for arbitrariness. \\<:-)\n\nLeading: This is 11.25/13.6\\*, but my measure is a bit on the longish side  \n(69 characters); I'm not quite sure yet, but I think it could use a hair more.  \n(\\* I'm such a child of the digital age, I always arrive at these funky sizes.  \nJust fiddlin' around until it looks good.)\n\n<cite>\"Zeki rules. :-)\"</cite>  \nSeems like it! I'm always happy when I get to design/typeset interesting content, and this definitely qualifies (an anthology about art and neuroscience, mostly).  \nIt's great to learn about low frequency channel information in the Mona Lisa as a side effect to working. :-)\n\n"
    },
    {
      "time": "18 Jun 2009 — 12:40pm",
      "content": "I just don’t think there’s a need for these small-cap parens. Then again, I don’t think acronyms (not actually the case discussed here) need to be set in small caps, so I obviously hold contrarian views.\n\nI certainly think it’s open to dispute whether small-cap settings of proper names can actually go ahead without full caps where necessitated by the name. Hence, Semir Zeki, Ludwig van Beethoven, and Johnny iPhone need true-cap S, Z, L, B, J, and P. I’m not sure you can get away with using nothing but small caps (“all small caps” in OpenType jargon).\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20150418223318/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "18 Jun 2009 — 1:44pm",
      "content": "<cite>\"I just don’t think there’s a need for these small-cap parens\"</cite>  \nNot a dire need. But wouldn't you agree they are a subtle enhancement?  \nIf you're talking need/functionality and not \"looking nice\", I'd argue that's pretty much the same in this case: they stick out less, so there's less obstruction of the \"flow\" of the text, and less errant attraction of attention to details that don't carry that much (crucial) meaning. No?\n\nRe setting names in all small caps: Would you argue that in any circumstance/ application, proper names \\*need\\* (as in \"depend on\") the distinction between caps and lowercase? FWIW, my German I.D. card (of all things!) has my name in all caps. As do my credit card, my bank statement, etc. etc.… not to mention all the shop signs of this world that have the owners' names in all caps. & that seems to work. (Note that I'm not saying it's necessarily good practice; but it seems to work.)\n\nBTW, I don't generally believe in thusly bells-and-whistles-laden typography. Sometimes I just set text in the Roman, maybe some emphasis here and there and let it be, and that seems ideal. Some texts (or more precisely: some \\*readers\\* of some genres of texts) just seem to need more help than others… to my understanding.\n\n"
    },
    {
      "time": "19 Jun 2009 — 12:56pm",
      "content": "As I said, in the first example of Nina, I think the short parens are an advantage. Also I have set a situation with a lot of Biblical references, with the abbreviation in all small caps and the figures in text figures, and they definitely looked better that way rather than full parens. I think that in some situations they are a definite design plus.\n\nI was wondering if in Nina's case there were just a few references, much repeated, then all small caps for the names might work. But it is pushing it. Often, as Joe says, putting full names in all small caps is problematic, but I do think there are situations in which the short parens are very useful.\n\n"
    },
    {
      "time": "19 Jun 2009 — 1:21pm",
      "content": "<cite>\"I was wondering if in Nina’s case there were just a few references, much repeated, then all small caps for the names might work\"</cite>  \nHm, it differs from text to text. This is an anthology with, uh, 15 contributions, some of which are rather cluttered with references while others have only very few.\n\nStupid question of the day: Is it \"wrong\" if I set them in SC every time, not just the first time they appear?  \nRationale: If I set them in mixed case once they appear the second time, I lose the benefit of \"pulling them away\" from the running text (by means of small caps / short parens); I assume the reader will get used to the idea that small parens with all small caps contain references, and skip over them more easily if he (or she) isn't interested. So having all references, whether they appear for the first time or not, set in the same way seems logical to me, even if maybe it doesn't look so pretty… What do you think?\n\nI'm actually working on \"streamlining\" the small caps and parens right now.  \nWill be curious to do some test prints later and see if it's \"too much\".\n\n"
    },
    {
      "time": "19 Jun 2009 — 7:28pm",
      "content": "I'm not too fond of the short parentheses followed by -- or following -- full caps. I also don't like full cap + small caps in general and agree that ideally the names of all cited authors should be set in small caps only.\n\nIt seems to me that there's a parallel between capitalizing names such as \"da Silva\" and \"van Beethoven\" when starting sentences and setting names such as \"LeDoux\" in all small caps when citing them.\n\n"
    },
    {
      "time": "19 Jun 2009 — 9:38pm",
      "content": "Enter FF Atma. Perfect for situations when you need 7/16 caps and 9/13 caps in the same setting! Not sure if it has matching puct though.\n\n"
    },
    {
      "time": "20 Jun 2009 — 4:42am",
      "content": "Last night I dreamed I was on my way to a party and realized I wasn't wearing small caps; so I selected myself, assigned the stylesheet, my parentheses shrunk down, and all was good. Maybe I should go out more.\n\nI'm quite convinced about this version now, which I'll run by the editor and publisher shortly: All references to names in small caps without full caps, references in short parens, other content in full-height parens. I think it works:\n\n ![](http://web.archive.org/web/20150418223318im_/http:/typophile.com/files/parens_prefinal_5118.gif)\n\n…and it produced surprisingly few conflicts or awkward situations, too.  \n(The font looks nicer of course, this is a screenshot from InDesign.)\n\nThanks again for all the fish, er, input!  \n(Randy, thanks also for pointing out Atma. Now that's an impressive array of caps :-\\>)\n\n"
    },
    {
      "time": "22 Jun 2009 — 12:12pm",
      "content": "_All references to names in small caps without full caps, references in short parens, other content in full-height parens. I think it works_\n\nLooks like the best solution to me as well.\n\n"
    },
    {
      "time": "27 Jun 2009 — 1:11am",
      "content": "Just got word back from the editor that he's absolutely fine with the typography (\"super-fancy\" – I guess he's comparing this to MS Word layouts). So I'm glad to go ahead with this solution.  \nThanks again for your input everyone! Another nice thing learned.\n\n"
    },
    {
      "time": "27 Jun 2009 — 7:11am",
      "content": "Thanks for the thread, Nina.\n\n"
    }
  ]
}
