{
  "id": "59135",
  "title": "Just a heads on up Letterhead Fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello, I realize that this is my first post here ever, and it’s basically just a link to my blog, but I am by no means just fishing for hits or trying to gain some popularity. The simple fact of the matter is I don’t do a whole lot with exotic fonts, but I happened to fall into this situation, and thought others should be aware. Some (most) of you may feel LHF is in the right here, but I really can’t get around how unwilling they are to provide access to something I have proof I paid for.\n\nThe basic premise is I bought a font from Letterhead several years ago, before they maintained a user database that allows you to download purchased fonts whenever you need them. I lost the original download, and after contacting them to regain access to the font (a process they have described on their support page, specifically for orders placed before their user database was in place), they maintain that their policy is to only grant access to these “legacy” purchases if the customer purchases a new font. According to them, this is to compensate them for the time required (“about 20 minutes”, to quote a rep) to grant my new account access to the font. I have provided them both the original receipt and the credit card statement showing the purchase but they are persistent about the 20 minutes of customer service being equivalent in value to an entire typeface. They also closed my account for saying I wouldn’t be paying for a new font.\n\nGranted they are only looking for $35 or $40, but since I only need the one font that I have already purchased, that would be doubling the cost of the original product. Not to mention I don’t specifically need another font, and I have very little (read: zero) money to simply through around at the moment.\n\nLike I said, maybe I’m wrong here, but this whole thing really just smells like them trying to score one extra sale. I just can’t comprehend how something that’s probably four or five clicks of the mouse could demand $35, when that is the cost of their product.\n\nAnyway, I generally liked LHF before this happened, but this experience has left a bad taste in my mouth. Here’s the whole story:  \n [http://www.awholenother.com/2009/06/17/letterhead-fonts-bad-business/](http://web.archive.org/web/20090620070409/http:/www.awholenother.com/2009/06/17/letterhead-fonts-bad-business/ \"http://www.awholenother.com/2009/06/17/letterhead-fonts-bad-business/\")\n\n",
  "author": "<a href=\"/web/20090620070409/http://typophile.com/user/45479\" title=\"View user profile.\">farski</a>",
  "time": "<br>",
  "uid": "45479",
  "comments": [
    {
      "time": " 17.Jun.2009 3.57pm",
      "content": "This is really not a good example of customer service. At all. The squeaky wheel gets the grease, so to speak, I hope you get the help you deserve.\n\n"
    },
    {
      "time": " 17.Jun.2009 6.49pm",
      "content": "LHF seems to have a bit of a reputation around here for not necessarily being customer friendly. I doubt I’d ever purchase a face from them.\n\nGranted, I had the same runaround with Adobe as well (regarding Macromedia licenses)—though I kind of expect that kind of bad service from a behemoth like Adobe.\n\n"
    },
    {
      "time": " 17.Jun.2009 7.19pm",
      "content": "I just read the full blog post, and yeah, it’s pretty bad customer service. all the best getting it sorted.\n\n"
    },
    {
      "time": " 17.Jun.2009 8.12pm",
      "content": "Just to be clear: what if you copied the font from another source? Would that in your opinion be a violation?\n\n"
    },
    {
      "time": " 17.Jun.2009 9.13pm",
      "content": "EK, legally I don’t know for sure. It certainly would seem like I’m within my usage rights, as I have a license. I know they have a verbiage on their website that says their fonts are all visibly and invisibly digitally signed, and they can all be traced. I’ve also heard that they don’t distribute actual font files anymore, but rather an application that loads the font into the operating system during boot, but that’s not confirmed, and maybe not uncommon (like I said, I stick to pretty standard fonts being a web dev, not buying too many these days).\n\nAs far as my opinion, I wouldn’t be losing any sleep if I happened to find the font elsewhere :)\n\n"
    },
    {
      "time": " 17.Jun.2009 9.39pm",
      "content": "I would rarely link to a dafont listing, but there are alternatives to the LHF if you are just looking for something in that style. Dafont just happened to be the first google result:\n\n[http://www.dafont.com/ballpark-weiner.font](http://web.archive.org/web/20090620070409/http:/www.dafont.com/ballpark-weiner.font \"http://www.dafont.com/ballpark-weiner.font\")\n\n"
    }
  ]
}
