{
  "id": "59131",
  "title": "Optima Nova vs. Optima",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all!\n\nI'm working on a project for which I'm using Optima (I own Optima LT Std), but I would loooove to have the true italics that Optima Nova offers. However, my client doesn't really have the budget to buy new fonts, and I certainly cannot afford to buy all, or even a few weights, of Optima Nova. However, I'm thinking that I (or he) may be able to afford one or two italic weights. My concern is if the italic of Optima Nova will go well with Optima LT, or if the difference will be noticeable. It seems that, while there is SOME difference in the roman letterforms—the 'a', especially, they seem to be pretty consistent. And I understand Hermann Zapf himself was a designer of Nova, so I would expect the differences to be slight.\n\nIn short: do you think I could mix the roman of Optima LT Std with the italic of Optima Nova?\n\nThanks in advance, sorry for the longwinded explanation.\n\n",
  "author": "Cassie",
  "time": "17 Jun 2009 — 12:57pm",
  "uid": "20665",
  "comments": [
    {
      "time": "17 Jun 2009 — 2:26pm",
      "content": "I prefer the original oblique italics of faces such as Optima and Frutiger.\n\nIn fact, the originals are the true italics, and the revisions are somewhat pretentious, occasioned perhaps by the marketing requirement to provide an obvious visual difference, rather than in any merit this style of italic may have for the typeface in question.\n\nHowever, in the OpenType era it seems that stylistic alternates don't break the bounds of a typeface design.  \nSo perhaps both styles of italic could be included in such fonts, with one as default and the other as a Stylistic Set.\n\n"
    },
    {
      "time": "17 Jun 2009 — 5:06pm",
      "content": "You should contact Linotype and ask if the vertical metrics are compatible. It's entirely possible that they are not, which would make for a great deal of inconvenience in practice.\n\n"
    },
    {
      "time": "18 Jun 2009 — 12:53am",
      "content": "These should help you.\n\n ![](http://web.archive.org/web/20150218044157im_/http:/typophile.com/files/nova1_4637.jpg)\n\n ![](http://web.archive.org/web/20150218044157im_/http:/typophile.com/files/nova2_5159.jpg)\n\ndr\n\n"
    },
    {
      "time": "28 Jun 2009 — 7:59am",
      "content": "Thank you all so much. That definitely helps. Looks like they would, in fact, be compatible!\n\nNick: I understand that, especially with fonts like Optima, which were designed with an oblique. Without paying any disrespect to Zapf's original Optima, though, it comes down to aesthetics for me—I just personally prefer an italic to an oblique. Thanks, though, for the information! And that is an interesting idea, using roman, italic AND oblique...\n\n"
    },
    {
      "time": "28 Jun 2009 — 9:38am",
      "content": "The only thing I don't really care for in the Optima Nova italic is the tail on the lowercase l, which contravenes the general treatment of the type. Other than that, I disagree with Nick and think the new italic is in every respect an improvement on the awkward oblique. I do think italic types modelled on slanting the roman letterforms _can_ work, but digital Optima doesn't because a) it is too wide and b) the stroke contrast is distorted. With regard to this, I think it would be worthwhile to compare the digital oblique Optima italic with the original metal version. I am almost certain that someone cheated somewhere along the way -- either in the phototype manufacturing or the later conversion to Type 1 -- and mechanically obliqued the roman type.\n\n"
    },
    {
      "time": "28 Jun 2009 — 10:19am",
      "content": "There were real drawn obliques for Optima prior to Type 1 release. I used them in pre-PostScript digital formats, and you can find specimens.\n\nThey disappeared in the same period as the real Futura italics and drawn ITC Avant Garde obliques in the early Type 1 days.\n\n"
    },
    {
      "time": "28 Jun 2009 — 11:15am",
      "content": "Thanks, Peter. So the light, distorted Optima oblique is an artefact of the PS digital conversion. This doesn't surprise me. The Type 1 format includes a slant value that can be used to produce an oblique font from a set of upright outlines. This was done for a number of Adobe/Linotype fonts. Helvetica was another example.\n\nIt's always fun to watch the look on someone's face when they open e.g. the Type 1 version of Helvetica Italic in FontLab and realise that they're looking at a set of roman outlines.\n\n"
    },
    {
      "time": "28 Jun 2009 — 12:23pm",
      "content": "All of the digital Optima’s compare badly to the original letterset — too much of a compromise in the verticals (those subtle concaves!). One would have thought that high resolution output and better hinting would facilitate a more accurate representation… But looking at my early Optima letterproof, I have to conclude that the original is still eons ahead.\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
