{
  "id": "59143",
  "title": "New Exclusive Releases from Font Bros!",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "This month is exceptionally exciting for us because Font Bros is proud to release no less than ten BRAND NEW exclusive fonts not available any where else! From scripts to fun novelty faces to instant classics and fresh monograms, you're gonna LOVE these new fonts!\n\nFilmotype - Filmotype is thrilled to re-release Filmotype Modern! This bouncy sans serif was originally introduced in the early 1950s and was redigitized by Device Fonts own Rian Hughes! Check it out at: [http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=FILM-MODE](http://web.archive.org/web/20120717121749/http:/www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=FILM-MODE \"http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=FILM-MODE\")\n\nFontalicious - Ben Balvanz Fontalicious Font Foundry brings the typographical hotness with THREE amazing new releases! You're gonna love the tricked out OpenType stylings of Wonderkid as well as the playful Rascal and Bike! Check 'em out at: [http://www.fontbros.com/fontalicious\\_new.php](http://web.archive.org/web/20120717121749/http:/www.fontbros.com/fontalicious_new.php \"http://www.fontbros.com/fontalicious\\_new.php\")\n\nHarold's Fonts - Monograms anyone? Yes, your wishes have been answered! It's Harold's expanded College Monogram family Collo Monograms for 3-letter acedemic monogram styles! Check 'em out at: [http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=HAFO-COLM](http://web.archive.org/web/20120717121749/http:/www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=HAFO-COLM \"http://www.fontbros.com/cgi-bin/commerce.cgi?preadd=action&key=HAFO-COLM\")\n\nSideshow - That crazy Squid has been at it again! Meet two new instant classics you're gonna flip over! Beachcomber, a realistic driftwood plank font and Kitchenbats, a pantry full of dingbatty fun! Check 'em out at: [http://www.fontbros.com/sideshow\\_new.php](http://web.archive.org/web/20120717121749/http:/www.fontbros.com/sideshow_new.php \"http://www.fontbros.com/sideshow\\_new.php\")\n\n",
  "author": "Diner",
  "time": "17 Jun 2009 — 7:16pm",
  "uid": "1226",
  "comments": [
    {
      "time": "18 Jun 2009 — 6:39am",
      "content": "Hot off the presses, we're pleased to announce an Exclusive NEW release from Crystal Kluge of the Tart Workshop, Nelly Script and Nelly Script Flourish. . .\n\nNelly is a beautiful yet sensible romantic, clearly hand drawn but easy to read. She’s a bit formal but not stuffy and simply adores a lovely party. A perfect choice for invitations and announcements, especially those of the romantic nature. Nelly Script comes complete with a handful of alternate lowercase forms in OpenType format.\n\nSometimes you need to gild the lily, add a little drama, bling. With that in mind we’ve created a collection of flourishes & embellished letters to enhance Nelly Script’s romantic appeal. Nelly Script Flourish is the jewelry to a beautifully appointed lady, the icing to the wedding cake, the VaVoom! Nelly Script Flourish comes complete with a large variety of alternate upper and lowercase forms in OpenType format.\n\nYou can see both of these amazing new scripts at: [http://www.fontbros.com/tartworkshop\\_new.php](http://web.archive.org/web/20120717121749/http:/www.fontbros.com/tartworkshop_new.php \"http://www.fontbros.com/tartworkshop\\_new.php\")\n\n"
    },
    {
      "time": "23 Jun 2009 — 8:49am",
      "content": "Sure are allot of new fonts! I like Coffee Service and Cocktail Shaker, nicely done :)\n\n"
    },
    {
      "time": "24 Jun 2009 — 9:27am",
      "content": "Thanks Dirk! A nice batch will be ready to release just prior to Typecon!\n\n"
    }
  ]
}
