{
  "id": "59147",
  "title": "72 ppi image in PDF file",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I need to display some screenshots (72ppi) in a document. When I exported, the pdf displays the images blurry, even though I view the document at 100% size. Any ideas on how I can solve this issue?\n\n",
  "author": "Frode Bo Helland",
  "time": "17 Jun 2009 — 11:01pm",
  "uid": "17101",
  "comments": [
    {
      "time": "17 Jun 2009 — 11:05pm",
      "content": "I'm working in InDesign. I have tried setting image downsampling to 72 ppi when exporting, as well choosing \"Do not downsample\". Neither worked.\n\n"
    },
    {
      "time": "18 Jun 2009 — 1:02am",
      "content": "_...as well choosing “Do not downsample”..._\n\nIn addition, set \"Compression\" to \"None\" -- it's just below \"Do Not Downsample.\"\n\n ![](http://web.archive.org/web/20131022152408im_/http:/typophile.com/files/no_compression_4504.png)\n\n"
    },
    {
      "time": "18 Jun 2009 — 2:34am",
      "content": "I did and it didn't help. The pictures are of different fonts rendered in various browsers. The clarity is the whole point of it.\n\n"
    },
    {
      "time": "18 Jun 2009 — 2:39am",
      "content": "Wierd! Viewing the document at 73% size renders the type perfectly.\n\n"
    },
    {
      "time": "18 Jun 2009 — 2:50am",
      "content": "Check your display settings in Acrobat, especially ‘Image Smoothing' (?). I’m afraid this is a user setting, so you can’t really control it.\n\n"
    },
    {
      "time": "18 Jun 2009 — 3:07am",
      "content": "Ouch. That messes up my whole concept.\n\n"
    },
    {
      "time": "18 Jun 2009 — 3:09am",
      "content": "So the precentage in Acrobat Reader (or any other pdf viewer) aren't true? 100% isn't 100% in terms of pixels.\n\n"
    },
    {
      "time": "18 Jun 2009 — 3:34am",
      "content": "No, 100% at Acrobat’s (8, Mac) default ‘system resolution’ of 93 pixel per inch won’t look the same as 100% at a customized resolution of 72ppi. You might assume that most people (on a Mac, using this very piece of software, that is) haven’t changed the default and thus specify an initial zoom factor of ~77,419% in your document – but that neither looks good nor will solve your problem.  \nBetter include links to online images.  \nF\n\n"
    },
    {
      "time": "18 Jun 2009 — 1:42pm",
      "content": "In other words: your monitor at around 73% displays the pdf at the full 100%.\n\nAn idea: upsample your screenshots in PhotoShop to 4 times 73% using the bilinear setting and place these in your layout with a 25% reduction. Don’t use downsampling when PDF-ing.  \nCould be the way to go…\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "18 Jun 2009 — 2:59pm",
      "content": "It has to work on all computers, not just mine. The pictures need to be pixelperfect as well.\n\n"
    },
    {
      "time": "18 Jun 2009 — 4:20pm",
      "content": "Does it have to be a PDF? What about HTML?\n\n"
    }
  ]
}
