{
  "id": "5915",
  "title": "(x) Embroidered scripts - various {Mark S, Mike Y}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I am trying to identify some script faces used in embroidery, but they seem to come from a world of their own, with no basis in calligraphy or typography. Any help in finding a source would be appreciated. I've attached four of the ones I am trying to ID.   \n   \nalastair ![embroidery](http://web.archive.org/web/20050518125504im_/http:/www.typophile.com/forums/messages/83/42063.gif)\n\n",
  "author": "poltroon",
  "time": "Wed, 2004-08-04 14:58",
  "uid": "2173",
  "comments": [
    {
      "time": " Wed, 2004-08-04 15:32",
      "content": "The first one reminds me of Monotype Script. The second and third look similar and look a bit like French Script or Typo Upright or others in that vein. The third one looks more or less like Commercial Script.   \n   \nI doubt very much that you will find fonts that match these. They seem to be loose interpretations of common script styles.\n\n"
    },
    {
      "time": " Wed, 2004-08-04 20:00",
      "content": "I believe a lot of commercial embroidery is done with machines programmed (if that's the right term) with script styles that were developed independently of computer fonts. Think of how long embroidered lettering has been put on jackets and clothing -- much longer than digital computer fonts. I think in many cases the technology is not related, although I believe some new machines can somehow use fonts, but now I am in way over my head. (This last comment was based on someone who wrote to me saying that they had used fonts for machine embroidery. I may have misunderstood her.)   \n   \nCan you say why you want to identify them? As Mark suggested they are similar to some existing styles, but that doesn't mean they originated with 'fonts' as we usually mean the term now.\n\n"
    },
    {
      "time": " Thu, 2004-08-05 05:57",
      "content": "Embroidery technology uses both PostScript and TrueType font outlines. Using proprietary software, monograms are created using the font outlines which are programmed to create fills or outline with thread. Embroidery software is now available for MAC and WIN platforms at a cost of $6K to $12K. I'm currently using a app on my G4, designed by a company called Punto. Lots of fun creating hats and shirts for friends.\n\n"
    },
    {
      "time": " Thu, 2004-08-05 06:07",
      "content": "I would also note that embriodery fonts require a unique outline that relates directly to the size of the monogram, the thickness of the thread, and the material used. To toot my own horn I have several fonts available on MyFonts that were designed for embroidery technology.\n\n"
    },
    {
      "time": " Thu, 2004-08-05 10:52",
      "content": "Yes I know about Pfaff's computer programme that will embroider anything (on their high-end sewing machines). This is for a former student of mine who is trying to modernize a company that uses these styles and presumably is going digital. I've always enjoyed the parallel between cross-stitched samplers of the 18th & 19th century and late-20th century digital bit-mapped fonts.\n\n"
    }
  ]
}
