{
  "id": "59192",
  "title": "6 States Hitting Residents With Big Tax Hikes",
  "forum": "Delnoriscup's blog",
  "tags": [

  ],
  "content": "6 States Hitting Residents With Big Tax Hikes\n\n[  \n](http://web.archive.org/web/20090904133114/http:/washedit.com/wp-content/uploads/2009/06/tax.jpg)  \n State legislators faced with mammoth budget gaps and sharply lower revenue  \n are looking to residents to bail them out.  \n Right now, at least 47 states are facing significant shortfalls in their  \n 2009 and/or 2010 budgets, according to the Center on Budget and Policy  \n Priorities, a think tank in Washington, D.C. And many of those states are  \n looking to tax hikes to help fill the gaps.  \n “Pretty much everyone is doing poorly,” says Kim Rueben, senior research  \n associate at the Tax Policy Center. “It’s just a question of who’s hurting  \n more than others.”  \n The top honor goes to California, which is projecting that it will fall  \n about $25 billion short come fiscal 2010. Taking second place is New York  \n with a projected $17.6 billion deficit for fiscal 2010, according to the  \n National Conference of State Legislatures, a bipartisan policy research  \n organization in Washington, D.C.  \n How can these states miss the mark so badly? The recession has sapped the  \n two major sources of state revenue: income taxes (thanks to rising  \n unemployment, fewer people are getting paid) and sales taxes (quite simply,  \n consumers are spending less.) “Those two things together really, really lead  \n to a high loss of tax revenues, far in excess of loss of income,” says  \n Michael Hicks, director of Ball State University’s Center for Business and  \n Economic Research.  \n Even though raising taxes are typically a last resort, many states have  \n no choice but to do so. And, in some, lawmakers are leaving no stone  \n unturned when it comes to finding items or services to tax. New York, for  \n instance, has raised taxes on tobacco, wine and limo services. Meanwhile,  \n Massachusetts is proposing a tax on satellite television service and Georgia  \n lawmakers are proposing a “pole tax” that would charge gentlemen’s club  \n patrons $5 at the door.  \n To figure out which states are inflicting the biggest tax hikes on  \n residents, SmartMoney pored over reports from tax research groups and  \n contacted state budget offices. We looked at state budget deficits tracked  \n by the National Conference of State Legislatures and current sales tax rate  \n data from the Federation of Tax Administrators, a group that provides  \n services to state tax authorities. Finally, we turned to the Tax Foundation  \n — a nonpartisan tax research group — for figures on tax burden, the average  \n percentage of each state’s residents’ income that is paid in state and local  \n taxes (the figures we use are for 2008).  \n Here are six states where residents should prepare to pay up.  \n [  \n](http://web.archive.org/web/20090904133114/http:/online.wsj.com/article/SB124517776696719927.html)  \n Ads –\\> [Bonita Flooring](http://web.archive.org/web/20090904133114/http:/www.classicfloorsbonita.com/)  \n | [Naples Computers](http://web.archive.org/web/20090904133114/http:/www.byteshop.com/) |  \n [Bonita Condos](http://web.archive.org/web/20090904133114/http:/bonitaspringscondosforsale.com/)  \n California: Diminishing This Huge Deficit May Just Be a Dream  \n State deficit estimate for fiscal 2010: $24.7 billion  \n Percent of general fund budget: 22.3%  \n State and local tax burden: 10.5%; Rank: 6  \n California is facing the biggest budget deficit in the nation, yet  \n voters’ willingness to chip in is starting to wane. Last month, they voted  \n down five ballot measures that included sales and income tax increases. Who  \n could blame them? At 11%, California has one of the worst unemployment rates  \n in the country, the housing market has been decimated, and the state already  \n raised taxes on sales by 1% to 8.25% and income by 0.25% (both of which  \n expire in 2011). Gov. Arnold Schwarzenegger’s latest budget plan includes  \n steep spending cuts across the government and cutbacks in social services.  \n In a testament to California’s grim predicament, one assemblyman’s  \n proposal to legalize marijuana for personal use and allow counties to tax it  \n is gaining public support. It’s one of the “wacky things you might be able  \n to get away with now,” says Rueben.  \n New York: If It’s Bad for You, It Will Be Taxed  \n State deficit estimate for fiscal 2010: $17.6 billion  \n Percent of general fund budget: 31.9%  \n State and local tax burden: 11.7%; Rank: 2  \n New York State Gov. David Paterson may have been unsuccessful in levying  \n an 18% tax on soda and other sugary drinks in the name of combating obesity,  \n but he’s had a hand in raising taxes on plenty of other “sinful” items,  \n including tobacco (up to 46% from 37%) and wine (up 58% per gallon, or about  \n two cents more per bottle).  \n For those living in New York, all those tax hikes can really add up.  \n Second only to New Jersey, New Yorkers bear the second-highest tax burden  \n thanks to a high income-tax rate of 7.85% (for those earning more than  \n $200,000). And property and gas taxes are among the highest in the nation,  \n according to the Tax Foundation. Nevertheless, shoppers can rejoice: The  \n sales tax here remains relatively low at just 4%.  \n Florida: Driving and Smoking Will Cost You  \n State deficit estimate for fiscal 2010: $6 billion  \n Percent of general fund budget: 27%  \n State and local tax burden: 7.4%; Rank: 47  \n Florida passed its budget in May with a not-so-pleasant surprise for  \n smokers: a $1-per-pack hike (the first such increase in 19 years). Motorists  \n also got hit with higher fees to renew a license or register a vehicle. It  \n could have been worse, though. Senate lawmakers had proposed eliminating the  \n sales tax exemption on items like bottled water and tickets to sporting  \n events, both of which didn’t make the cut.  \n Still, residents here aren’t feeling as much tax pain as some of their  \n peers in other states. Overall, Florida’s tax burden is the third-lowest in  \n the nation and it’s one of eight states that imposes no individual income  \n tax, according to the Tax Foundation. But those perks may be outweighed by  \n the rest of Florida’s economic situation. Home values are among the nation’s  \n hardest hit and the state’s $6 billion budget deficit could mean more tax  \n hikes are on the horizon.  \n Massachusetts: Shoppers and Couch Potatoes, Prepare to Pay Up  \n State deficit estimate for fiscal 2010: $3 billion  \n Percent of general fund budget: 11.2%  \n State and local tax burden: 9.5%; Rank: 23  \n Just when Massachusetts was starting to shake its “Taxachusetts” nickname  \n (it’s ranked a middle-of-the-road 23rd in the Tax Foundation’s tax burden  \n assessment), the state is preparing to hike taxes on everything from alcohol  \n to satellite TV.  \n The most hard-hitting for residents is a proposed increase in the sales  \n tax to 6.25% from 5%. Both the House and Senate approved the measure and  \n it’s looking likely the increase will pass by the July 1 deadline, says Noah  \n Berger, executive director of the Massachusetts Budget and Policy Center, an  \n independent research group. Satellite TV subscribers may also get hit. The  \n state is proposing a 5% sales tax on satellite services. Providers, of  \n course, are fighting the tax.  \n Arizona: Proposed Sales-Tax Hike Could Hurt Already-Strapped Residents  \n State deficit estimate for fiscal 2010: $3 billion  \n Percent of general fund budget: 28.2%  \n State and local tax burden: 8.5%; Rank: 41  \n The recession has thumped Arizona harder than most other states, says Lee  \n McPheters, research professor of economics at Arizona State University’s W.P.  \n Carey business school. The housing slump is partially to blame: During the  \n boom, construction accounted for at least a quarter of new jobs created.  \n Since home prices have fallen 43% from their peak, the construction industry  \n has lost tens of thousands of jobs, says McPheters. Arizona’s unemployment  \n rate in April was 7.7%, shy of the 8.9% national average.  \n If Gov. Janice Brewer gets her way, residents will pay for the state’s  \n problems by shelling out an extra 1% at the cash register. The proposed  \n sales-tax hike, which would bring the rate to 6.6%, was omitted from the  \n budget the legislature passed this month, but the governor may veto the  \n budget until it’s put back in. (She could also place it on a November  \n special election ballot.)  \n Nevada: What Happens in Vegas Is Going to Cost You More  \n State deficit estimate for fiscal 2010: $1.2 billion  \n Percent of general fund budget: 32%  \n State and local tax burden: 6.6%; Rank: 49  \n Nevada’s freewheeling, low-tax past is coming back to haunt it like a bad  \n hangover. The state levies no personal income tax and imposes some of the  \n lowest taxes on businesses in the nation, says Bert Waisanen, a fiscal  \n analyst at the National Conference of State Legislatures.  \n Nevada used to be able to afford being so generous with its residents.  \n Revenue from tourism and gambling supported the state just fine. But now, as  \n consumers would rather put their coins in a bank account than a slot  \n machine, that revenue source is drying up. In fact, the state boasts the  \n dubious honor of having the largest deficit in the country as a percentage  \n of its budget – 32%. It’s hiked the sales tax by 0.35% to 6.85% and taxes on  \n hotel rooms are up 3%. It’s even gambling with its business-friendly climate  \n by raising taxes on businesses.\n\n",
  "author": "<a href=\"/web/20090904133114/http://typophile.com/user/45523\" title=\"View user profile.\">Delnoriscup</a>",
  "time": "<br>",
  "uid": "45523",
  "comments": [
    {
      "time": " 19.Jun.2009 11.31am",
      "content": "Spammer. Account blocked.\n\n"
    }
  ]
}
