{
  "id": "59209",
  "title": "And that's it.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Some advice for Linux users from [PC World/Washington Post](http://web.archive.org/web/20090626150252/http:/www.washingtonpost.com/wp-dyn/content/article/2009/06/19/AR2009061902549.html)...\n\n“If you want to import directly from a Windows installation, you’ll find the fonts in the C:\\windows\\fonts directory. Copy all the .ttf files to a USB stick, create a new folder in your/home directory called .fonts (note the period before the word fonts!), and place them there. And that’s it. The fonts will now be available in all your applications.”\n\nIt’s sad to see such ignorance around font licensing. If this chap had suggested skipping the middle man and downloading a pirate copy of Windows and the applications I’m sure the article would never have been published.\n\n",
  "author": "<a href=\"/web/20090626150252/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 19.Jun.2009 6.14pm",
      "content": "Heck, Si, it is only type, people don’t really have to pay for that stuff, do they?\n\nChrisL\n\n"
    },
    {
      "time": " 19.Jun.2009 6.30pm",
      "content": "Fonts are like water, man. Just open the faucet and it flows out!\n\n"
    },
    {
      "time": " 19.Jun.2009 9.51pm",
      "content": "sii said:  \n\\> It’s sad to see such ignorance around font licensing\n\nyes, and it must make you feel very sad to see exactly  \nhow easy it is for people out there to steal your work,  \nknowing that there isn’t one thing you can do about it.  \nnot a single thing...\n\n-bowerbird\n\n"
    },
    {
      "time": " 19.Jun.2009 10.19pm",
      "content": "\\> how easy it is for people out there to steal your work\n\nthe part of the problem though is that they don’t realize they are _stealing_\n\n"
    },
    {
      "time": " 19.Jun.2009 11.15pm",
      "content": "They aren’t stealing. They are infringing on copyrights. Though in the case of the web core fonts, I’m not entirely sure what the current status is on those in terms of being freely distributable:\n\n[http://en.wikipedia.org/wiki/Core\\_fonts\\_for\\_the\\_Web#Program\\_termination\\_...](http://web.archive.org/web/20090626150252/http:/en.wikipedia.org/wiki/Core_fonts_for_the_Web#Program_termination_and_software_licence_agreement_issues \"http://en.wikipedia.org/wiki/Core\\_fonts\\_for\\_the\\_Web#Program\\_termination\\_and\\_software\\_licence\\_agreement\\_issues\")\n\n(I assume Sii could clarify that for us?)\n\n"
    },
    {
      "time": " 20.Jun.2009 2.24am",
      "content": "aluminum said:  \n\\> They aren’t stealing. They are infringing on copyrights.\n\nit’s general lawlessness, don’t get caught up in semantics.\n\nthese young kids think that, just because they can copy a file,  \nthey own it, and just because there’s a lawn, they can play on it.\n\n-bowerbird\n\n"
    },
    {
      "time": " 20.Jun.2009 8.14am",
      "content": "\\>I assume Sii could clarify that for us?\n\nc. 1998 versions of some fonts are available in a package hosted on sourceforge. Pointing people to that package is a lot different from advising your readers to copy “all the fonts” from a friend’s Windows machine (which will likely contain 3rd party fonts along with Microsoft fonts not part of the package) onto your Linux box.\n\n"
    },
    {
      "time": " 20.Jun.2009 10.29am",
      "content": "@sii: Don’t worry, GNU/Linux users will soon have plenty of libre fonts. :-)\n\n"
    },
    {
      "time": " 20.Jun.2009 12.31pm",
      "content": "They already have plenty of free fonts, including those that have legally cloned the metrics of the core fonts. Sadly its a fact that for every free software advocate who says the right thing about respecting commercial software licenses there are thousands more like this chap.\n\n"
    },
    {
      "time": " 20.Jun.2009 12.52pm",
      "content": "<cite>GNU/Linux users will soon have plenty of libre fonts.</cite>\n\nNo! You intend to graduate from Reading not just with a family but with an entire library?\n\n"
    },
    {
      "time": " 20.Jun.2009 12.52pm",
      "content": "sii said:  \n\\> Sadly its a fact that\n\npay attention, folks, because this is a \\_fact\\_...\n\n\\> Sadly its a fact that  \n\\> for every free software advocate  \n\\> who says the right thing about  \n\\> respecting commercial software licenses  \n\\> there are thousands more like this chap.\n\n\\_thousands\\_ of \\_thieves\\_ for every one honest person  \nwho knows how to stand within the bounds of the law.\n\nand that’s a \\_fact\\_...\n\nhow can we succeed against such overwhelming odds?\n\nno wonder our society is in such bad shape...\n\nand these kids are so busy with the twittering and  \ntheir face-spaces they don’t even realize the scale  \nof the huge problem their lawlessness has created.\n\n\\> Sadly its a fact that\n\nlook, one of those thieves appears to have  \nstolen the apostrophe right out from the  \nmiddle of the word “it’s” in sii’s sentence.\n\nwho knows what they will steal next?\n\n-bowerbird\n\n"
    },
    {
      "time": " 20.Jun.2009 12.58pm",
      "content": "Sorry for the missing apostrophe. Note that I never called these folks thieves, I said they were ignorant of font licensing issues. I advocate education.\n\n"
    },
    {
      "time": " 20.Jun.2009 1.22pm",
      "content": "I didn’t read the original piece, but if you’re copying from your own Windows installation to a linux partition on the same computer, is that piracy?\n\n"
    },
    {
      "time": " 20.Jun.2009 1.25pm",
      "content": "I can’t see how that would be “piracy” - it might break the EULA, but that would vary from foundry to foundry. Note that the article was about running Windows apps on Linux - which would imply a different box.\n\n"
    },
    {
      "time": " 20.Jun.2009 1.32pm",
      "content": "\\> which would imply a different box\n\nOf course it wouldn’t beause of (a) dual boot (b) virtual machines\n\nBy the way, what’s the state of affairs in terms of font licensing for the use on virtualized hardware ?\n\n"
    },
    {
      "time": " 20.Jun.2009 1.45pm",
      "content": "\\>Of course it wouldn’t\n\nSorry, but if you have Windows on the box and want to run a Windows application you’d just boot Windows or run the app under virtualization. Neither of these require moving the fonts. The guy is clearly talking about moving the fonts to another box.\n\n"
    },
    {
      "time": " 20.Jun.2009 1.51pm",
      "content": "I read the article now, and it looks to me like the author instructs the Linux user who wishes to run licensed applications under Linux, for which the user might need the fonts.\n\nMost pirates are Windows users, not Linux users, and as was mentioned here, most Linux users are not “pirates”.\n\n"
    },
    {
      "time": " 20.Jun.2009 1.54pm",
      "content": "\\>Most pirates are Windows users, not Linux users, and as was mentioned here, most Linux users are not “pirates”.\n\nAh, so the author is trying to tip the balance - interesting theory.\n\n"
    },
    {
      "time": " 20.Jun.2009 2.04pm",
      "content": "It could be worse. If this was on that paper’s editorial page they’d call for the font designers to be tortured into handing over the files so that they can be converted to run on an operating system designed with freedom in mind.\n\n"
    },
    {
      "time": " 20.Jun.2009 2.11pm",
      "content": "So this newspaper would have Dave rename “Libre Fonts” to “Freedom Fonts”? I actually prefer that. Not got anything against the French, “Libre” just sounds a bit pretentious to moi, non?\n\n"
    },
    {
      "time": " 20.Jun.2009 7.15pm",
      "content": "sii said:  \n\\> Note that I never called these folks thieves,  \n\\> I said they were ignorant of font licensing issues.\n\nmore minimization of their flagrant abuse of the law.\n\nwhichever word someone might decide to describe it,  \nthese kids are using something that they do not have  \na legal right to use, in disobedience to the true owner.\n\nand if you tried to “educate” them, sii, why i do believe  \nthey’d just chuckle at you — if not laugh in your face —  \nand run off and make fun of the old legal fuddy-duddy.\n\n“hey old man, i suppose you drive the speed-limit too!”  \ni can just hear them taunting you. and it’s not pretty...\n\nheck, look at the very evidence you have mustered here:  \nbald piracy instructions listed right in an article that was  \nprinted in a glossy magazine with a large print-run and  \nalso in a big prestigious newspaper in the nation’s capital.\n\n-bowerbird\n\n"
    },
    {
      "time": " 20.Jun.2009 7.25pm",
      "content": "Simon, if you’re going to quote someone, quote fairly. If you don’t, someone might think you work for Microsoft.\n\n"
    },
    {
      "time": " 20.Jun.2009 10.26pm",
      "content": "You can split hairs with EULAs, and be technically correct, but if we’re talking about ethics, I don’t get it. I see little rationale in getting upset about this.\n\nI feel no guilt whatsoever in downloading a given album (let’s say the Clash’s London Calling) that I’ve bought on so many formats over the years (vinyl, CD, cassette). I would have to try really hard to feel guilt over using a Windows licensed fonts on a Linux install when there was zero effort on the creator/designers’ part in making that possible. (Assuming there are no added support costs, etc.)\n\nSo, I know I’m letting ethics trump the law in my choice to re-download music that I justify by feeling that I’m entitled. But, maybe you can help me see it from your perspective.\n\nAssuming someone has properly licensed the original fonts, what do font designers lose from this behavior in the article? What does Microsoft lose?\n\n(And Simon, this is a genuine question. I respect you too much to bait you with troll tactics.)\n\n"
    },
    {
      "time": " 21.Jun.2009 6.35am",
      "content": "Joe, if you interpret the article as someone transferring fonts from a licensed machine **they own** onto a unlicensed machine **they own** , then I see your point. It’s kind of like a studio licensing one copy of Photoshop and installing it on 20 Macs - at least they licensed one copy. Adobe got paid.\n\nHowever, the article doesn’t talk about this. It is advice for someone who is running Linux, and who has not paid for Windows or Mac OS (both OS’s include these fonts). People who legitimately licensed these OS’s have paid for the fonts.\n\nThe author could have suggested using fonts from an unused copy of Windows, ebay, or given the sourceforge URL. But he didn’t.\n\nDoes that make sense?\n\nAnd back to the point of my post. All I said was that it’s “sad” that the chap didn’t have a better grasp on font licensing, and that his ideas were published in a mainstream newspaper. Ethics discussions aside, I just can’t see how that it’s good for the font community.\n\nEK\\> Simon, if you’re going to quote someone, quote fairly.\n\nWell don’t make inflamatory stuff up then. Saying that people who use Open Source OS’s are less likely to pirate applications software is like saying the Pope wears a funny hat. Most Linux apps are Open Source making piracy impossible.\n\n"
    },
    {
      "time": " 21.Jun.2009 7.45am",
      "content": "Hold on, hold on. First, Sii, when you say “the article was about running Windows apps on Linux - which would imply a different box,” you seem to not quite understand what WINE does; WINE is precisely about running Windows apps that are sat on a local hard disk of a computer that booted GNU/Linux. WINE stands for “Wine Is Not an Emulator,” and so it does indeed require moving the fonts, because it allows running Windows apps without Windows.\n\nMoreover, the article also says “Fonts that are not supplied as part of [the core fonts] package, but which some applications might need, include Tahoma and MS Sans. You can find these around the web if you search.”\n\n(And, it does include the sourceforge URL, btw.)\n\n@kl: Sadly I haven’t even made a family at Reading...\n\n"
    },
    {
      "time": " 21.Jun.2009 8.00am",
      "content": "\\>Hold on, hold on.\n\nMaybe I’m just being dim, but why the talk of downloading fonts from the Web and USB sticks then? Surely Linux can read the Windows partition?\n\nAnd to be clear you think the advice provided in the article is completely kosher from an open source perspective?\n\n\\>Sadly I haven’t even made a family at Reading...\n\nI thought that was a course requirement, or is producing a single font enough?\n\n"
    },
    {
      "time": " 21.Jun.2009 9.40am",
      "content": "<cite> Well don’t make inflammatory stuff up then. Saying that people who use Open Source OS’s are less likely to pirate applications software is like saying the Pope wears a funny hat. Most Linux apps are Open Source making piracy impossible. </cite>\n\nI see the point as quite obvious. The article is open to two interpretations, one benign, and the other encouraging infringement. Given the preferences of the overwhelming majority of open source users, I prefer the benign interpretation.\n\nIf you find that inflammatory, take an Advil.\n\n"
    },
    {
      "time": " 21.Jun.2009 10.15am",
      "content": "In playing the OS-religion card I think you missed the entire point of my post. There is a third interpretation, that the author is ignorant of font licensing issues.\n\n"
    },
    {
      "time": " 21.Jun.2009 10.44am",
      "content": "The only cards I play are Taki.\n\nYour third interpretation is just another variation of “call to piracy”.\n\nAnd let’s not beat around the bush. The problem for Microsoft is not the ripping off of fonts; it’s that they want everybody to buy their products.\n\n"
    },
    {
      "time": " 21.Jun.2009 11.22am",
      "content": "Well, thanks at least for acknowledging your prejudices. Explains your reaction to my post.\n\n"
    },
    {
      "time": " 21.Jun.2009 12.10pm",
      "content": "<cite> thanks at least for acknowledging your prejudices. </cite>\n\nSaid the company man.\n\nIf you take off your corporate lenses for a minute and review the play-by-play, you’ll see that I simply mentioned an alternative, reasonable explanation in context. You on the other hand...\n\n"
    },
    {
      "time": " 21.Jun.2009 12.20pm",
      "content": "Before I posted the link I ran the article by a few folks, to make sure I wasn’t misinterpreting what the guy was saying. I then posted a link saying that it seemed as if the chap didn’t understand font licensing issues - throwing this up for discussion. Your response a “reasonable explanation in context” (said the academic) was that most pirates are Windows users. How is that a reasonable explanation?\n\n"
    },
    {
      "time": " 21.Jun.2009 12.46pm",
      "content": "I agree the article author is blissfully unaware about software licensing.\n\n“why the talk of downloading fonts from the Web and USB sticks then? Surely Linux can read the Windows partition?”\n\nGNU/Linux can read and write VFAT and NTFS, yes, but WINE isn’t designed to search the filesystem for Windows’ own files, it is designed to run without the presence of Windows at all. Thus the need to copy Windows fonts (other I think sometimes other files, like some hardware drivers) into places where WINE can make use of them.\n\n“And to be clear you think the advice provided in the article is completely kosher from an open source perspective?”\n\nI’m not an advocate for open source, I’m an advocate for software freedom, so I find the whole WINE project to be an own-goal - it promotes proprietary software. I’d rather than articles like this weren’t written and instead articles were written explaining what the free alternatives to proprietary applications are, or proposing the initiation of projects to develop them.\n\nSo I’ll join you in criticising the article for popping off into the web to find unlicensed copies of proprietary fonts, although I guess we part ways when I say that I’d rather the article said “we don’t have libre fonts that can replace Windows’ fonts, so please consider starting a project to develop them” :-)\n\nDeveloping a roman and an italic is the course requirement, but that isn’t a family IMO.\n\n"
    },
    {
      "time": " 21.Jun.2009 12.53pm",
      "content": "You are again quoting unfairly. What you are citing is not my first response, and it’s not even the relevant part of the argument.\n\nThe gist of it, again, is that the article might fairly be interpreted not to encourage willy-nilly copying of fonts, but as a way to run fully licensed applications (including the fonts they require) from an open source platform. I think it’s a fair interpretation (a more reasonable one in context) since few users who are pirates flock to open source: they stay with their illegal copies of windows and windows applications. Open source users tend to be people who want to be legit, but can’t or don’t want to pay for software, or strongly prefer free software. If a user is reluctant to switch to Linux because there’s a Windows application that they must run, the article tells them how to do it.\n\nI may be wrong about any of these matters, but it’s certainly no reason for you to get upset.\n\n"
    },
    {
      "time": " 21.Jun.2009 1.46pm",
      "content": "the r.i.a.a. got 1.92 million for 24 songs.  \nwhat would be a fair judgment for this?\n\n-bowerbird\n\n"
    },
    {
      "time": " 21.Jun.2009 2.08pm",
      "content": "<cite> the r.i.a.a. got 1.92 million for 24 songs.<br>\nwhat would be a fair judgment for this?</cite>\n\n-bowerbird\n\nfor sharing, not for downloading let alone copying from another computer.\n\n"
    },
    {
      "time": " 21.Jun.2009 4.17pm",
      "content": "microsoft doesn’t want you moving its fonts  \nonto a linux machine, i think it’s safe to say.\n\n-bowerbird\n\n"
    },
    {
      "time": " 21.Jun.2009 4.46pm",
      "content": "_It’s sad to see such ignorance around font licensing.  \nAnd that’s it._\n\n"
    },
    {
      "time": " 21.Jun.2009 5.42pm",
      "content": "Yes, such ignorance. And intolerance too.\n\n"
    },
    {
      "time": " 22.Jun.2009 7.45am",
      "content": "[http://www.codingforums.com/showthread.php?t=167303](http://web.archive.org/web/20090626150252/http:/www.codingforums.com/showthread.php?t=167303) seems like a ghost from the future.\n\n"
    },
    {
      "time": " 22.Jun.2009 10.04am",
      "content": "you know, there is a great opportunity — right now —  \nfor some font-house (or group of them) to step forward  \nand do a big favor to the world by releasing a dozen fonts  \n(or so) for free to take advantage of the new possibilities,  \na kind of favor that — if done correctly, and generously —  \nwill endear millions of future customers to their benefactor.\n\ni’m just sayin’...\n\n-bowerbird\n\n"
    },
    {
      "time": " 22.Jun.2009 1.19pm",
      "content": "How about bowerbird give said type foundry a working time machine and then, if done correctly and generously, will endear said type foundry with bowerbird and the future will be limitless!...just sayin’ :-)\n\nI’m just joking with you bowerbird but I will say I’m getting a bit tired of the “give it away free” arguments - it’s hard to make a living for “free”. How does “free” feed my kids? How does “free” keep a roof over my head? How does “free” fix my car? How does “free” do anything except raise my status among the anonymous crowds of the internet?\n\n"
    },
    {
      "time": " 22.Jun.2009 3.00pm",
      "content": "\\> _Thus the need to copy Windows fonts (other I think sometimes other files, like some hardware drivers) into places where WINE can make use of them._\n\nYou can always symlink (ln -s) the place WINE wants to look at to the place where the fonts actually are. No copying involved. Just saying.\n\n"
    },
    {
      "time": " 22.Jun.2009 3.05pm",
      "content": "@epsilicon: True, but perhaps symlinking is too much old UNIX beardy magic for the article’s intended audience? :)\n\n"
    },
    {
      "time": " 22.Jun.2009 4.02pm",
      "content": "Or if overwrites the windows partition with Linux, reserving the necessary files.\n\n"
    },
    {
      "time": " 22.Jun.2009 4.04pm",
      "content": "i love the time-machine thing! where do i sign up for one? :+)\n\ni thought i was perfectly clear. if you endear yourself to  \nmillions of customers, that is how you make your living,  \nand feed your kids, and keep a roof over your bald head.\n\nif you could buy from either of 2 vendors, would you buy from  \nthe one who gave you free samples, or the other who did not?\n\nit’s an opportunity, folks, not an obligation. nobody is forcing  \nanyone to do anything here. let’s make sure that’s understood.  \nif you don’t think the opportunity is in your interest, walk on by.\n\nbut make no mistake, i want one of those time-machine things...\n\n-bowerbird\n\n"
    },
    {
      "time": " 22.Jun.2009 5.04pm",
      "content": "Would’nt it be loverly. Bowerbird in the jurassic.\n\n"
    },
    {
      "time": " 22.Jun.2009 5.19pm",
      "content": "“i thought i was perfectly clear. if you endear yourself to  \nmillions of customers, that is how you make your living,”\n\nWhy don’t the millions of folks you call customers first endear themselves to type foundries by giving them money for free? After they feel sufficiently endeared, the foundries will gratefully sell them fonts?\n\nChrisL\n\n"
    },
    {
      "time": " 22.Jun.2009 9.29pm",
      "content": "dezcom said:  \n\\> Why don’t the millions of folks you call customers  \n\\> first endear themselves to type foundries by  \n\\> giving them money for free?\n\nwell, that would be another way of going about it, yes.  \nwhy don’t you suggest it to them, see what they say?\n\n-bowerbird\n\n"
    },
    {
      "time": " 23.Jun.2009 10.52am",
      "content": "Thanks everyone for the great feedback. Decided to take this off-line and contact the reporter directly. Although I should have probably done that to begin with, the feedback here is super-useful and I’ve incorporated into the mail.\n\nThanks again, Si\n\n"
    },
    {
      "time": " 23.Jun.2009 11.54am",
      "content": "sii said:  \n\\> Decided to take this off-line and contact the reporter directly.\n\noh, so you were serious, and not just kvetching. good for you.\n\nin related news, the r.i.a.a. wants to charge a.t.&.t. whenever  \nanyone’s phone rings... (or so the headlines would tell us.)\n\n-bowerbird\n\n"
    },
    {
      "time": " 23.Jun.2009 12.59pm",
      "content": "@bowerbird - That isn’t the RIAA - it’s ASCAP that’s suing, claiming ringtones should be viewed as a “performance”.\n\n"
    },
    {
      "time": " 23.Jun.2009 4.16pm",
      "content": "oh right, i always get those two identical twins mixed up. :+)\n\n-bowerbird\n\n"
    },
    {
      "time": " 23.Jun.2009 4.40pm",
      "content": "_I feel no guilt whatsoever in downloading a given album_\n\nWell, I bought London Calling on vinyl, and also as a CD.  \nI didn’t consider it as paying twice, because I got new functionality, in that I could now play the album on a bunch of digital devices, without any funny business from the stylus.\n\n"
    },
    {
      "time": " 23.Jun.2009 5.17pm",
      "content": "Yeah, telling the users to go and grab the fonts is like saying go and grab the DLLs. If Wine depends so much on “borrowing” Windows resources, it can’t really be an alternative to it.\n\n"
    },
    {
      "time": " 23.Jun.2009 5.21pm",
      "content": "nick said:  \n\\> Well, I bought London Calling on vinyl, and also as a CD.\n\ni wanted to. but i got lost in the supermarket.\n\n-bowerbird\n\n"
    },
    {
      "time": " 23.Jun.2009 7.18pm",
      "content": "Thanks for the clarity Sii. Good luck with your pursuit.\n\n"
    }
  ]
}
