{
  "id": "59248",
  "title": "Typefaces with large x-height and low contrast",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am looking for sans-serif typefaces with large x-height and low stroke contrast. Also, something which you think might be legible on a low-resolution device such as Television. I have read a couple of similar threads on \"Fonts for the Television\" but I want something new.\n\nAny recommendations?\n\nThanks!  \nSatya\n\n",
  "author": "satya",
  "time": "22 Jun 2009 — 3:08am",
  "uid": "14032",
  "comments": [
    {
      "time": "22 Jun 2009 — 3:29am",
      "content": "Hi Satya\n\nWell we all want something new... but all I can think of is er, Avant Garde Gothic?\n\n"
    },
    {
      "time": "22 Jun 2009 — 5:25am",
      "content": "ITC Kabel\n\n"
    },
    {
      "time": "22 Jun 2009 — 5:45am",
      "content": "Shameless plug, [Bentwood](http://web.archive.org/web/20150328232415/http:/new.myfonts.com/fonts/paragraph/bentwood/) :)\n\n"
    },
    {
      "time": "22 Jun 2009 — 9:02am",
      "content": "[Vectoras](http://web.archive.org/web/20150328232415/http:/www.linotype.com/1577/vectora-family.html) x-height should be large enough for anybody, and there's no contrast to write home about either. I have no idea about its on-screen behaviour, though.\n\n"
    },
    {
      "time": "22 Jun 2009 — 9:23am",
      "content": "The Zeitgeist is currently against high x-h, so there is not a lot of new material out there — maybe you should look into the lesserknown oldies around. Eg Century Gothic.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "22 Jun 2009 — 10:27am",
      "content": "I'm working on [something.](http://web.archive.org/web/20150328232415/http:/typophile.com/node/51081) It still needs some tweaks but might be along the lines of what you're looking for, if you can wait a few weeks-months.\n\n"
    },
    {
      "time": "22 Jun 2009 — 11:41am",
      "content": "See what I mean? Typedesigners are already hopping on the train: high x-h is becoming the next hot thing soon.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "22 Jun 2009 — 1:04pm",
      "content": "I'm a bit confused about the large x-height criterion. Something like [Fedra Sans](http://web.archive.org/web/20150328232415/http:/www.typotheque.com/fonts/fedra_sans) has a larger x-height, it seems on first glance, than Avant Garde Gothic or Kabel. But lots of contemporary sans serif designs have comparable x-heights, and even old standbys like Helvetica don't differ that much on x-height. Cuttlefish's Californian Grotesque, I'm sorry to say, has a tiny x-height relative to all the designs mentioned.\n\nSo does Fedra Sans fit the bill? Or should we look for even larger x-heights?\n\n"
    },
    {
      "time": "22 Jun 2009 — 1:46pm",
      "content": "FF Clan maybe. Or more subtle, FF Milo.\n\n"
    },
    {
      "time": "22 Jun 2009 — 2:49pm",
      "content": "Well, the plain weight x-height of CaliGrot is pretty average but the extra bold is getting up there, though it's kind of disguised by having tall ascenders too.\n\nOK, maybe it's not what we're looking for over here\n\n"
    },
    {
      "time": "22 Jun 2009 — 6:40pm",
      "content": "The x-height will always be relative to the ascenders/descenders length (and cap height).\n\n"
    },
    {
      "time": "22 Jun 2009 — 6:53pm",
      "content": "\"The x-height will always be relative to the ascenders/descenders length \"\n\nReally?\n\n ![](http://web.archive.org/web/20150328232415im_/http:/typophile.com/files/Picture1_6425.png)\n\nMichael\n\n"
    },
    {
      "time": "22 Jun 2009 — 7:34pm",
      "content": "yes, and cap-height too\n\n"
    },
    {
      "time": "22 Jun 2009 — 8:06pm",
      "content": "That's an extreme example, Michael. Would you say it has a large or small x-height?\n\nThe other way to define x-height would be something like: measure the letters width vs height. In other words, a condensed typeface would have a really large x-height.\n\n"
    },
    {
      "time": "22 Jun 2009 — 8:28pm",
      "content": "You said always... I just responded to that : )\n\nEdit: Scriptina and Zapfino, although I hate to use those in the same sentence.  \nAs to the x-height of Koch's face , it is pretty normal! Less than the 1:5 ratio but still normal.\n\nMichael\n\n"
    },
    {
      "time": "22 Jun 2009 — 8:50pm",
      "content": ":)\n\nWell, I still think my observation applies.\n\n"
    },
    {
      "time": "22 Jun 2009 — 9:09pm",
      "content": "Sorry Satya, did not mean to hijack the thread... just reacting to Frode's comment.\n\nFrode\n\nJust because a face is narrow does not mean it has a large x-height, it just means it is narrow. Koch's face is not extreme, it just has high ascenders.\n\nMichael\n\n"
    },
    {
      "time": "22 Jun 2009 — 9:30pm",
      "content": "\"In other words, a condensed typeface would have a really large x-height.\"\n\nI am trying to relate this calligraphically. If I were to cut the height of a normal ascender in any given lettered face then the x-height would go up... right? Condensing a style and keeping the as/descenders the same has no effect on the xh! To me a lot has to do with the height to weight ratio and the height of the as/descenders. You are testing my understanding so thank you Frode! I am wondering about the standard definitions now.\n\nWe need to question the dictionary on a regular basis.\n\nMichael\n\n"
    },
    {
      "time": "23 Jun 2009 — 12:14am",
      "content": "I always understood the x-height concept as a proportion of the type size or \"slug\" of the typeface. In other words not only related to the cap size or ascender but a whole _line_:\n\n ![](http://web.archive.org/web/20150328232415im_/http:/typophile.com/files/x-height_6445.png)\n\n"
    },
    {
      "time": "23 Jun 2009 — 3:10am",
      "content": "I don't think a narrow typeface has high x-height, I just used it as an example of how it could be understood if we didn't have the common understanding of x-height as the proportion of the whole \"slug\" (slug minus ascenders and descenders).\n\nI first stated that \"x-height will always be relative to the ascenders/descenders length (and cap height)\".\n\n"
    },
    {
      "time": "23 Jun 2009 — 5:26am",
      "content": "Yes, I agree.\n\n"
    },
    {
      "time": "23 Jun 2009 — 6:11am",
      "content": "Whoa, this thread is messing with my mind. I suddenly start envisioning a Multiple Masters kind of program, except that instead of just providing different weights, it would be able to control the x-height (by changing ascender and descender heights). Simple programming for largely vertical characters, but a lot of challenges for sloped strokes like on the y and g.\n\n"
    },
    {
      "time": "23 Jun 2009 — 6:12am",
      "content": "Satya:\n\nWhy don't you use Devanagari fonts? They always have large x-height. Look at the word \"satya\" written in Devanagari, and you'll see what I mean. If I were an Indian, I would use Devanagari instead of Latin.\n\n"
    },
    {
      "time": "23 Jun 2009 — 6:25am",
      "content": "Both Fedra and Lexicon (and probably many other) have versions with different x-height, Don. No automated workflow, though:)\n\n"
    },
    {
      "time": "23 Jun 2009 — 6:52am",
      "content": "Uli,\n\nI am looking for Latin typefaces – what do you mean by using Devanagari fonts instead?\n\nWe are working on a custom Devanagari typeface for a local Hindi news channel. They have asked us to first select a Latin typeface which could be used as companion with Devanagari. We did submitted a proposal for a custom Latin typeface as well, but they said they don't have enough budget for both the scripts.\n\n"
    },
    {
      "time": "23 Jun 2009 — 7:24am",
      "content": "I wonder how [Antique Olive](http://web.archive.org/web/20150328232415/http:/www.linotype.com/47/antiqueolivebyadobe-family.html) will work on screen. Crazy, perhaps, but still...\n\nJust digging through some MyFonts tags:\n\n[Noa](http://web.archive.org/web/20150328232415/http:/new.myfonts.com/fonts/linotype/noa-lt/)  \n [Sone](http://web.archive.org/web/20150328232415/http:/new.myfonts.com/fonts/soneri/sone/)  \n [Terfens](http://web.archive.org/web/20150328232415/http:/new.myfonts.com/fonts/insigne/terfens/)\n\n"
    },
    {
      "time": "23 Jun 2009 — 9:48am",
      "content": "Sorry Frode\n\nI was working waaaaaay too many hours straight and my mind turned to mush. Stare at a simple problem long enough, with glazed over eyes, and it gets complex.\n\nI was trying to say what Jan showed above and now realize that you were saying the same thing.\n\nWith apologies... Thread rerailed : )\n\nMichael\n\n"
    },
    {
      "time": "23 Jun 2009 — 7:23pm",
      "content": "\"I am trying to relate this calligraphically\"\n\n1. If a given script is 15 pens high from ascender to decender and the xheight is 5 pens high;  \n2. If a given script is 15 pens high from ascender to decender and the xheight is 10 pens high;\n\nWhich script has the large xheight?\n\nComsider the xheight as a ratio to cap height or body height.\n\nChrisL\n\n"
    },
    {
      "time": "23 Jun 2009 — 9:49pm",
      "content": "[Ronnia](http://web.archive.org/web/20150328232415/http:/www.type-together.com/Ronnia) has a large x-height and is about as new as they come.\n\n"
    },
    {
      "time": "24 Jun 2009 — 1:38am",
      "content": "Exactly what I was trying to say above Chris but lack o' sleep got in the way. I threw the Koch face in because I consider it an anomaly.\n\nMichael\n\n"
    },
    {
      "time": "26 Jun 2009 — 8:15am",
      "content": "Satya: I'm probably out of what you're asking for and of course it's a “selfpromotion” of my first ever typeface but I think you could consider Migration Sans to fit your needs. I draw it with that kind of feature your looking for. And it's new (last february). Apologies if I make something wrong with this selfpromotion.\n\n[http://www.fonts.com/FR/MondoSearchResults.htm?st=12&kid=migration&pg=1](http://web.archive.org/web/20150328232415/http:/www.fonts.com/FR/MondoSearchResults.htm?st=12&kid=migration&pg=1 \"http://www.fonts.com/FR/MondoSearchResults.htm?st=12&kid=migration&pg=1\")\n\nThanks.\n\n"
    },
    {
      "time": "26 Jun 2009 — 5:05pm",
      "content": "[Flama?](http://web.archive.org/web/20150328232415/http:/www.vllg.com/Feliciano/Flama/Example+About/) Maybe not exactly a <cite>large</cite> x-height, but prominent? I don't know. I just love Flama.\n\n"
    }
  ]
}
