{
  "id": "59264",
  "title": "logo and business card crit",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nHow is this working? This is for a wedding photographer that wants to appeal to the less traditional bride, but not alienate the more traditional bride. She selected the color.\n\nthanks for your advice!\n\n ![](http://web.archive.org/web/20130218100136im_/http:/typophile.com/files/weddingphotog_4128.jpg)\n\n",
  "author": "shielddesign",
  "time": "22 Jun 2009 — 8:35am",
  "uid": "25022",
  "comments": [
    {
      "time": "22 Jun 2009 — 9:24am",
      "content": "I like the card. The type doesn't fit within the space you gave it, though. I'd forgo using a font and hand write it.\n\n"
    },
    {
      "time": "22 Jun 2009 — 9:45am",
      "content": "You are right, I was just being lazy. Good call! Is the secondary type working okay however? Or should I handwrite that too?\n\n"
    },
    {
      "time": "23 Jun 2009 — 4:11am",
      "content": "Sorry, double post\n\n"
    },
    {
      "time": "23 Jun 2009 — 4:12am",
      "content": "I like it! Just simple as that.  \nI do have to place one comment: looking at the elements it doesn't become clear it is for a photographer. I would like to see a few reference points for that.  \nFurther, job wel done!\n\nO, one thing. I think the centrered text should be equaly placed. It is too perfect.\n\nWhat kind of material will it be presented on?\n\n"
    },
    {
      "time": "23 Jun 2009 — 10:21am",
      "content": "bobbybobo,\n\nthanks! I know that is my concern too...but I am not sure what to do to make it more obvious. To me it would work better for a cake decorator or an invite designer or a seamstress ...but what can I do to make it look more like a photographer that is not cheesy?\n\n"
    },
    {
      "time": "23 Jun 2009 — 2:51pm",
      "content": "Perhaps you can explore the artistic style currently being used, with an illustrated camera. OR perhaps more emphasis on your Name and Title. The latter should read \"Pictorialist\" for an added layer of fun. A pictorialist references the photography folks of the late 1800's and earily 1900's exploring various methodology to produce a \"painterly\" effect, and more over, to show the public that Photography IS an art. Your business card has a 1800's Victorian flare to it and I would advise that further exploration of that period will give you a unique look and feel your looking for.  \nbest regards,  \ndaniel\n\n"
    },
    {
      "time": "24 Jun 2009 — 7:26am",
      "content": "Note that at the moment you appear to have too many _r_s in the URL (\"photogrraphy\")  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "24 Jun 2009 — 7:55am",
      "content": "I personally would not worry about the photography or camera aspect of the card. As you said, this is about _wedding_ photography, so lenses and shutters are too literal. I think it's great for the purpose, perhaps handwrite the title as suggested and, perhaps, try a straight, no nonsense font for the details (for contrast).\n\n"
    },
    {
      "time": "24 Jun 2009 — 8:21am",
      "content": "My suggestions:  \n1. Make the secondary matter as large as possible (within the contsraints of the design) and the word PHOTOGRAPHER even more, so that it stands out.  \n2. How about losing one of the lines by combining the e-mail with the url, like (info@)loribaetcetera?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "25 Jun 2009 — 2:10am",
      "content": "How about placing PHOTOGRAPHER at the top?\n\n"
    },
    {
      "time": "25 Jun 2009 — 5:33am",
      "content": "This is a total design reversal, but if I recall my youth, Victorian pictures were often presented in oval frames that contained ornate bric-a-brac designs in the corner. So moving the decoration outside of the oval, and putting the information inside, where the photo (we called them tin-types back then) went might create an impression that is more photographic.\n\nJust an idea.\n\n"
    },
    {
      "time": "28 Jun 2009 — 2:05pm",
      "content": "Hello,\n\nHow about this? I did the hand drawn title and the client didn't like it.\n\nthanks!\n\n ![](http://web.archive.org/web/20130218100136im_/http:/typophile.com/files/Photog_3875.jpg)\n\n"
    },
    {
      "time": "29 Jun 2009 — 12:32am",
      "content": "Mmmmm.  \nIn a way an improvement, but I did like the look and feel of the first one.  \nBut it is more obvious that it is for a photographer.\n\n"
    },
    {
      "time": "29 Jun 2009 — 1:35am",
      "content": "My 2¢: Why the assymetry in the main oval when the whole card is centered?  \nlori barbelly should remain on the same line, or be done as draft one. The details below are now relatively smaller than before, why?\n\n"
    },
    {
      "time": "29 Jun 2009 — 1:46pm",
      "content": "I like the 2nd one. I think its more clean, professional. However, you can try positioning different way, like rotated it 90 degree counter clockwise, and use different typeface for the information, like gill sans or something clean and easy to read for larger audience. I like the hand-draw, very cute.\n\n"
    },
    {
      "time": "2 Jul 2009 — 6:53pm",
      "content": "As for the type inside the decoration, use your own hand writing. don't be afraid to combine a clean san-serif such as Helvetica or Avenir with the decorative design to you info at the bottom of the card. adding contrast between image and type sometimes work.\n\n"
    },
    {
      "time": "3 Jul 2009 — 10:27am",
      "content": "I like your first mock up better. I like the feel of the font you chose better than your handwritten attempt in #2. But i agree an original handwritten would look better, keep playing with it. I do not think you need to stress the photographer aspect at all. If you do maybe make it on the back of the card? Or with a tagline?\n\n\"making better pictures for beautiful people\"  \n\"from honeymoons to brides and grooms\"  \n\"Snap and Shoot for you? I do!\"\n\nlol just having fun :)\n\n"
    },
    {
      "time": "3 Jul 2009 — 2:45pm",
      "content": "Hi there,\n\nThe first one that you had took on this playful, victorian meets cute style, and I liked it. I think that the brown is a much darker value - I'm sure if you desaturate this thing, you'll see that the brown is a lot darker, and for some reason, it feels like too much contrast - like it's competing with the rest of the layout.\n\nI liked the victorian elements to the first mock up, and think you should push it further in that direction. A lot of cool stuff came out of that time period.\n\nALSO, this all depends on what kind of photographer this person is - let their style determine your concept! If they shoot kids a lot, then I think you're headed in a good direction.\n\nGood luck!  \ndaniel\n\n"
    },
    {
      "time": "6 Jul 2009 — 2:00am",
      "content": "Thanks everyone!!!\n\n"
    },
    {
      "time": "11 Jul 2009 — 4:48am",
      "content": "i am unable to get that what the relation of this image with bride?\n\nThanks & regards,\n\nMark Spenser,  \nMarketing Manager,  \nPlaveb Corporation - [Web Agency](http://web.archive.org/web/20130218100136/http:/www.plaveb.com/)  \nUSA\n\n"
    }
  ]
}
