{
  "id": "59276",
  "title": "More contemporary version of Lubalin Graph",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Looking for a more contemporary version of ITC Lubalin Graph...but not trendy. A wide range of weights, too.\n\nFor example: I think of FF Kievit as a contemporary version of Helvetica...a bit more geometric than Helvetica but similar in functionality and feel.\n\n",
  "author": "LoremIpsumLoremIpsum",
  "time": "22 Jun 2009 — 11:59am",
  "uid": "26100",
  "comments": [
    {
      "time": "22 Jun 2009 — 1:12pm",
      "content": "In my eyes, Kievit is quite far from Helvetica. I wouldn't say it's more geometric neither. Kievit is a _humanist_, Helvetica a _neo grotesque_.\n\nIf you're looking for another _geometric slab serif_ (like Lubalin Graph), maybe you'll like Rockwell or Register Serif BTN.\n\nIf you want a more humanist touch to your slab, take a look at Archer, Serifa and PNM Caecilia. Those are some of my favourites. Actually, Archer take cues from both geometric and humanist designs, and might be just what you're looking for.\n\n"
    },
    {
      "time": "22 Jun 2009 — 1:38pm",
      "content": "Take a look at [Lexia](http://web.archive.org/web/20140424070651/http:/www.fontshop.com/fontcase/families/lexia/?utm_source=NewsletterJune17&utm_medium=web&utm_content=Lexia&utm_term=em&utm_campaign=FreshAndRefreshedJune), I think its exactly what your looking for\n\nJeo.\n\n"
    },
    {
      "time": "22 Jun 2009 — 1:47pm",
      "content": "Rockwell is the timeless classic!\n\nBeton ain't bad either!\n\n ![](http://web.archive.org/web/20140424070651im_/http:/typophile.com/files/slabs_3479.gif)\n\n"
    },
    {
      "time": "23 Jun 2009 — 2:46pm",
      "content": "H&J’s [Archer](http://web.archive.org/web/20140424070651/http:/www.typography.com/fonts/font_overview.php?productLineID=100033)?  \nEdit: Oops: already mentioned… (This always happens when I am looking at ‘About Schmidt’.)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "23 Jun 2009 — 4:29pm",
      "content": "_...but not trendy..._\n\nWho are you kidding--slab serifs are trendy right now, isn't that why you want one?  \nJust something a little more recherché than Archer!\n\nAs Avant Garde is an update of Futura, so Lubalin Graph is an update of Memphis.  \nBut are there other \"pure\" geometric slab serif styles that have the single storey \"a\" and \"g\"?--if indeed that's your criterion for mentioning Lubalin Graph, or are you looking to cast the net wider?\n\nMy slab: [Bodoni Egyptian](http://web.archive.org/web/20140424070651/http:/www.shinntype.com/bodoni.html).\n\n"
    },
    {
      "time": "23 Jun 2009 — 8:37pm",
      "content": "I forgot Bodoni Egyptian. It's lovely!\n\n"
    },
    {
      "time": "24 Jun 2009 — 3:18am",
      "content": "As noöne else has mentioned it:  \nHouse Industries recently have released [Neutraface Slab](http://web.archive.org/web/20140424070651/http:/www.houseind.com/fonts/neutrafaceslab/viewfonts) (designed by [Susana Carvalho & Kai Bernau](http://web.archive.org/web/20140424070651/http:/carvalho-bernau.com/retailfonts/neutraface-slab/), Art Direction by [Christian Schwartz](http://web.archive.org/web/20140424070651/http:/www.christianschwartz.com/neutraslab.shtml) and Ken Barber)\n\n<cite>are there other “pure” geometric slab serif styles that have the single storey “a” and “g”?</cite>\n\nWell, Neutraface Slab has both: a single-storey and a double-storey ‘a' an ‘g'.\n\n"
    },
    {
      "time": "24 Jun 2009 — 5:41am",
      "content": "If it does not need italic, how about \\>\\>\\>shameless plug\\<\\<\\<: [Tertre](http://web.archive.org/web/20140424070651/http:/www.paragraph.com.au/images/fonts/tertre.pdf). Four weights tomorrow, two more coming soon (as they always say ;)\n\n"
    },
    {
      "time": "27 Jun 2009 — 3:35am",
      "content": "Watch you for Irma Slab from [Typotheque](http://web.archive.org/web/20140424070651/http:/www.typotheque.com/)!  \nThis caps-only typeface looks like it could fit your bill of a ‘contemporary version of Lubalin Graph’. Irma Slab comes in 9 weights and is the companion to Irma (Sans). The fonts sport a number of fancy display ligatures. Additionally, each letter has inverse and half-inverse alternates that allow creating rhythmic patterns.  \nF\n\n"
    },
    {
      "time": "27 Jun 2009 — 5:08am",
      "content": "There is a very interesting, long discussion of different slabs and the development of Archer, in [this talk](http://web.archive.org/web/20140424070651/http:/typography.com/ask/index.php) by Hoefler and Frere-Jones. The first half is Jonathan Hoefler arguing that revivals are dead, and then the second half has Frere-Jones talking about Archer and Escrow, their Wall Street Journal text face.\n\nFrere-Jones by the way really hates Lubalin Graph, and the strict geometric slabs in general, which he says \"just die on the page.\"\n\n[Here is a direct link to the audio.](http://web.archive.org/web/20140424070651/http:/designconference2007.aiga.org/resources/content/4/4/6/3/documents/aiga_next_affinity_typography.mp3)\n\n"
    },
    {
      "time": "27 Jun 2009 — 7:13am",
      "content": "Great link, William, thanks for posting it.  \nThe bit about the geometric slabs \"dying on the page\" is really funny!  \n\"They just sit there, staring at you, seemingly helpless with this… straightjacket that's been applied to them…\" (about 38 minutes in). Great stuff. Shame we can't see the images that went with this.\n\n"
    },
    {
      "time": "27 Jun 2009 — 8:31am",
      "content": "Nina, a collection of the images is on the H&F-J web site, my first link. They are small, and mashed into one graphic, and not labeled, but they are still better than nothing.\n\nThey are both wonderfully articulate. Frere-Jones's \"underpants on the head school of type design\" also made me laugh--applied to the mocking or satirical revivals of the '90s.\n\n"
    },
    {
      "time": "27 Jun 2009 — 9:06am",
      "content": "Ah, nice (if tiny). Thanks for the pointer. I was curious to see those inspirations behind Archer.\n\n"
    },
    {
      "time": "27 Jun 2009 — 11:36am",
      "content": "For all of H$FJ's disdain for these geometric styles, Archer seems to be more with'em than again'em.\n\n"
    },
    {
      "time": "27 Jun 2009 — 1:53pm",
      "content": "Check the H&FJ blog, they just linked to a 2007 lecture where they explain how all the styles behind Archer came together.\n\n"
    },
    {
      "time": "27 Jun 2009 — 2:36pm",
      "content": "…which is the link William posted above.\n\n"
    },
    {
      "time": "4 Jul 2009 — 7:30am",
      "content": "Very good thoughts. Egyptian Bodoni and Lexia are both quite good.\n\n"
    },
    {
      "time": "6 Jul 2009 — 3:09pm",
      "content": "Glypha from Adrian Frutiger could also be an option:  \n [http://new.myfonts.com/fonts/linotype/glypha](http://web.archive.org/web/20140424070651/http:/new.myfonts.com/fonts/linotype/glypha)\n\n"
    },
    {
      "time": "6 Jul 2009 — 6:53pm",
      "content": "Gylpha! I remember drawing all of these extra weights of Glyph for some magazine years ago.  \nWhat was that 70s expression: Gag me with a spoon?\n\n"
    }
  ]
}
