{
  "id": "59319",
  "title": "Rebus Script - a seriously fun OpenType font introduced by Ascender Corp",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Elk Grove Village, IL -- June 24, 2009 -- Ascender Corporation, a leading provider of advanced font products, today announced their newest OpenType font called Rebus Script to showcase the advanced features available in OpenType fonts for creative applications. **Rebus Script** is a handwriting style script font that includes a set of pictorial symbols that can automatically replace certain words and syllables. Rebus Script uses the Contextual Alternate feature that is available in many OpenType-savvy applications including Adobe InDesign, QuarkXPress and Mellel.\n\n ![](http://web.archive.org/web/20140828040152im_/http:/typophile.com/files/rebus-montage-02_4824.jpg)\n  \nRebus Script retails for $29.99, but is available for only $14.99 (a 50% introductory promotional discount). The font is available in both TrueType and OpenType formats for Windows and Mac OS X. It can be downloaded immediately from the AscenderFonts.com website at: **http://www.ascenderfonts.com/font/rebus-script.aspx**\n\nThe Rebus Script font was created by Ascender’s Terrance Weinzierl after much research into the art of rebuses – representations of words and phrases which are substituted with pictures. The Rebus Script font can be used to create messages, riddles and puzzles that inspire, amuse and challenge readers to decode the pictures and the words or syllables they represent.\n\n ![](http://web.archive.org/web/20140828040152im_/http:/typophile.com/files/Opentype-view_6210.jpg)\n  \nTo use Rebus Script you simply type a word like “sun” or “son” and those letters will automatically be replaced by a picture of the sun. There are over 70 pictorial symbols in Rebus Script that make up the “vocabulary” for automatic substitution based on over 300 different syllable/word combinations in the English language. The vocabulary was developed to offer a wide range of creative possibilities.\n\nTo create Rebus Script, Terrance started with the Louisville Script™ font designed by Ascender’s Steve Matteson. This informal handwriting-style script font was chosen because it offers a fun, energetic personality that matches the casual line drawing style which Terrance desired. Terrance then developed a vocabulary sheet consisting of common words, syllables and emoticons, and then drew the corresponding illustrations. Next, he programmed all the pictures using the Contextual Alternatives feature available in OpenType and TrueType fonts. Special attention was paid to various case variations to recognize letters written in all lower case, all upper case and titling case.\n\n ![](http://web.archive.org/web/20140828040152im_/http:/typophile.com/files/rebus-pr-01_6028.jpg)\n  \nOne of the sources of inspiration for Rebus Script was “Gramp ‘N Grams” – a product originally created by Philip Davis in the mid-1980’s. This set of rebus picture stickers and matching stationery was targeted at grandparents to write rebus-style letters to their grandchildren. Thanks to the advances in font technology and computer publishing software, Mr. Davis’ dream of a rebus font is finally a reality! Rebus Script is a fun, lively font that can provide a wide variety of entertaining uses. The result is a youthful expression of text which is entertaining to decipher. It is perfect for casual correspondence, advertising and web graphics and can be used to embellish greeting cards, scrapbooks, menus, flyers, presentations and advertisements.\n\nAbout Ascender  \nAscender Corporation is a leading provider of advanced font products. Ascender's founders are font industry experts and have been involved in developing many of the most important and influential fonts used in computers, mobile devices, consumer electronics and software products. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises, software developers and hardware manufacturers. Ascender also provides an extensive collection of TrueType & OpenType fonts for download to graphic designers and consumers through its font websites, including [www.AscenderFonts.com](http://web.archive.org/web/20140828040152/http:/www.ascenderfonts.com/ \"www.AscenderFonts.com\").\n\nContact: Bill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225, Elk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730  \nFax: (847) 357 0731  \nEnglish: [http://www.ascendercorp.com](http://web.archive.org/web/20140828040152/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com\")  \nGerman: [http://www.ascendercorp.de](http://web.archive.org/web/20140828040152/http:/www.ascendercorp.de/ \"http://www.ascendercorp.de\")\n\n",
  "author": "billdavis",
  "time": "23 Jun 2009 — 3:54pm",
  "uid": "3095",
  "comments": [

  ]
}
