{
  "id": "59318",
  "title": "\"Politic ExtraLight\"- PeGGO font",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Ex \"Politica ExtraLight\"\n\n ![](http://web.archive.org/web/20150414192148im_/http:/typophile.com/files/Politica%20Extra%20Light%20PNG%20Show_4556.png)\n\na WIP of a new weight for \"Politica\" family font. The \"Politics\" concept is based on a politician broke moment, called \"State strike\", playing with the oposite between curves and broken strokes, like a comparison between politicians forms, their formal words and acid messages always exchange between them.\n\nCritiques and Comments always welcomed.  \n=)  \nPedro (PeGGO)\n\n",
  "author": "peggo",
  "time": "23 Jun 2009 — 3:44pm",
  "uid": "30293",
  "comments": [
    {
      "time": "23 Jun 2009 — 5:15pm",
      "content": "Pedro  \ncheck Politica name used here [http://sudtipos.com/fonts/42](http://web.archive.org/web/20150414192148/http:/sudtipos.com/fonts/42 \"http://sudtipos.com/fonts/42\")\n\nbest  \nAle\n\n"
    },
    {
      "time": "30 Jun 2009 — 10:33am",
      "content": "Hi Pedro,\n\nIt's a very nice job, I like it's very subtle but still conserves its personality, the sharped serifs make me think on how poignants and mordacious can be the politics.  \nI suggest to make the upper counter of the \"S\" narrower for avoiding the slopped effect and making \"R\" wider. I wonder why is the ampersand so small.\n\nGreetings  \nSergio\n\n"
    },
    {
      "time": "31 Jul 2009 — 1:27pm",
      "content": "Hi Sarll,\n\nThanks for your visit and for your comments! =)\n\nBueno, muy buena observación lo del counter de la \"S\" no lo había notado claramente, respecto al ancho de la \"R\" trataré de recordar hacer una prueba para testear si queda mejor. Y lo del Ampersand, está basado en la altura de \"x\" aunque estoy esforzándome por aprender a programar lo del \"Sensitive case\" para que haya un cambio automático entre una alternativa del ampersand cuando aparezca entre mayúsculas.\n\nMuchas gracias por las observaciones..!!  \n=)  \n(please translate by self)\n\nPeGGO\n\n"
    }
  ]
}
