{
  "id": "59323",
  "title": "Internship question: Small vs Big companies?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi. What do you think is better:\n\n- Being an intern for a small film production company that knows nothing about Graphic Design but allows you to actually design their print materials and websites that you can add to your portfolio  \n- Being an intern for an ad agency where you will probably not be doing any designing (maybe just grunt work) but may learn more about the industry\n\nI've already been accepted to intern for the small company and it is up to me to decide if I want to go ahead. I have an interview tomorrow with the ad agency and I'm a little intimidated for that one.\n\n",
  "author": "<a href=\"/web/20110113125809/http://www.typophile.com/user/45625\" title=\"View user profile.\">November</a>",
  "time": "<br>",
  "uid": "45625",
  "comments": [
    {
      "time": "",
      "content": "You will get little or nothing to put in your portfolio from an internship if you aren’t working with other designers who can help you produce good work. People who tell you that you’ll get stuff for your portfolio by working for them are just trying to get free work. It’s a scam, and you shouldn’t fall for it, and your professors should have warned you. You’ll be much better served doing grunt work for people who will teach you about the design industry. You will also be making connections that might get you jobs in the future—maybe an advanced internship next summer that focuses on design work and might lead to a job with the firm.\n\n<cite>I have an interview tomorrow with the ad agency and I’m a little intimidated for that one.</cite>\n\nDon’t be. Creative types know how stressful having one’s work judged can be so they’re generally very good to interview with.\n\n"
    },
    {
      "time": "",
      "content": "@James Puckett: +1\n\nIt would be different if it were a choice between a smaller, high quality design agency and a large ad agency. As long as you are working with good designers, a smaller agency might give you the opportunity to dive right into some small creative projects, depending on how much you already know, where at a large agency, there’s a chance you would just be taking lunch orders and making clipping paths. But then again, if you are a quick learner and take some initiative to develop skills on your own, you’ll see there’s a lot you can pick up just by watching the right people. Don’t be afraid to speak up either. If you think you have a good idea for something, find a way to say it, even if you're not asked. Of course, use your judgment. These aren't rules, just things that have worked for me.\n\n"
    },
    {
      "time": "",
      "content": "Depends a bit on what YOU are looking for later. In most cases, you're resumé be a bit better off by interning at the larger ad agency.\n\nAt the ad agency, you are likely to learn important things such as production/prepress procedures that are often left out of design school curriculums. Not to mention the structure of an agency and how it functions. You might not come out of it with portfolio work, but most likely a year or two down the road, you won't even want to look at that work anyways.\n\nIt also depends a bit on what you do at each, but more likely you will meet more people within the advertising industry. Whereas with the film company, you may meet people outside of the industry that can be just as good if not more valuable. Maybe potential clients…at an ad agency, it could turn into a full-time job.\n\n"
    },
    {
      "time": "",
      "content": "It really depends on the company.\n\nMy concern with the small production firm is that since there isn't anyone there who knows graphic design, you also have no one to turn to, evaluate your work or catch your mistakes who has an eye for producing solid design and associated pre-press setup. So while you have total free reign to do the design work, you may not learn as much as you could elsewhere, or could learn by fire.\n\nOn the other hand, as you say, doing grunt work at a large ad agency can be really draining and depending on how the firm works, you may not learn that much. However, what you will do is get experience on bigger, probably more well known projects and, if you can perform in high pressure situations, impress folk who could be potential employers in your future (near or distant). Furthermore, depending on the situation, you might also get more of a free hand and then get feedback from the higher ups, which could be very valuable.\n\nIt also depends on the environment. If the folk are rather friendly and you feel more at home with them, you'll be happier than if you can learn, but are miserable or treated poorly every day.\n\nSo really, it depends on how each feels and what you feel you will be able to get out of working at each place. Both have their advantages & disadvantages and there may be unique elements to each that would make one better than the other — makes it rather hard to really provide a good recommendation! I'd say go through the interview, see how you feel, see how you connect with the folk and then decide.\n\nOf course, I haven't been out in the industry for too long and there are probably others who know more than I, but that's my take.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the advice. I was thinking the same thing about benefiting more from the ad agency. Of course, I don't even know if they would take me so as of now, it is a moot point. I guess it all depends on how the company feels to me tomorrow. As for the small company, I did feel very at home with them and it was a nice environment. Then again, there is nothing like a hard ass to push you to produce your best. We'll see..thanks again!\n\n"
    },
    {
      "time": "",
      "content": "Internships should be about learning, getting experience, and making connections. Portfolio considerations should be secondary.\n\n"
    },
    {
      "time": "",
      "content": "_It’s a scam, and you shouldn’t fall for it, and your professors should have warned you._\n\nSeems a bit drastic.  \nI don't think there is a situation in which you wouldn't learn anything. In the first job it sounds like you will have quite a lot of responsibility – this could be a good experience – as Aaron says, learn by fire. Weigh each up for their own merit, you might be able to compare the two directly.\n\nGood luck in your interview.\n\n"
    },
    {
      "time": "",
      "content": "_As for the small company, I did feel very at home with them and it was a nice environment._ As a general rule, you meet nicer people outside of advertising... that said, the ground floor of an ad agency is a good place to learn about the industry and where you might want to go in it. Good luck with your internship.\n\n"
    },
    {
      "time": "",
      "content": "It all depends on the Firm or Agency - but from my experience of supervising internships for twelve years - most of my students liked small and medium firms to big ones. It also depends on the number of interns at the place - fewer being better.\n\n"
    },
    {
      "time": "",
      "content": "Think of the larger agency as a boot camp. But then, you are starting out and want to learn?\n\nWhat would you learn at a small place where you _are_ the design guru? Is it not too early for you to be in such position? Good luck whatever you choose!\n\n"
    },
    {
      "time": "",
      "content": "\\> It’s a scam, and you shouldn’t fall for it,\n\nIf I can put forth a bit of information from the employer side (back when I wore those shoes): the scam is not all that one-sided. The benefits of low cost internship labor are quite low to a company, particularly if you plan to actual provide the intern with mentoring. Work done by the intern may often have to be redone, must always be monitored and checked closely to ensure it meets the standards of the company, and unpaid interns, in particular, are notorious no-shows when you really need an extra set of hands.\n\nIn Canada unpaid internships are rare, so you wind up paying at least minimum wage here (nearly, and soon to be $10 an hour in Ontario). Most companies would prefer not to do them, but do as a service to the industry (to get young workers into the field). About the only real benefit of interns is that it gives you a chance to scope out potential hires with low risk. The really excellent intern is often offered a job, sometimes before the end of the internship.\n\nSemi related note: The college I work at has a co-op work experience for some of our technical students. In the middle of their four years of schooling, they spend two six month periods working in the oil refineries. They get full union rates, probably $25 to $30 an hour during that time. Not bad money for someone prior to graduating.\n\n"
    },
    {
      "time": "",
      "content": "I interned in the corporate communications department of a government agency as a graphic/web designer. I pretty much had free reign over what I designed (mostly internal communications) as my superiors were all corporate-types who couldn't tell a pixel from a peanut. Their sole concern was probably the size of logos. (That was a peek into understanding the #1 client concern I guess :p)\n\nIt was fun and liberating at first, but after awhile I was really yearning for some solid critique from someone who knew their stuff.\n\nI think a rewarding internship experience depends largely on the culture of the company. Size might jump out like a big factor, but I don't think it is as important as it seems. The company's culture determines the kind of people who're attracted to work there - the people who'll be mentoring/challenging you as a designer, whether directly or indirectly.\n\nCheck out Andy Chen's posts about interning at Pentagram.  \n [http://www.andychendesign.com/blog/?p=530](http://web.archive.org/web/20110113125809/http:/www.andychendesign.com/blog/?p=530 \"http://www.andychendesign.com/blog/?p=530\") (via Design Observer)\n\n"
    },
    {
      "time": "",
      "content": "James wrote:  \n_doing grunt work for people who will teach you about the design industry. You will also be making connections that might get you jobs in the future—maybe an advanced internship next summer that focuses on design work and might lead to a job with the firm._\n\nAnd he's completely right. Go where the learning and the connections are, not the allure of a quick add to your portfolio.\n\n"
    }
  ]
}
