{
  "id": "59322",
  "title": "Fixing Futura",
  "forum": "Randy's blog",
  "tags": [

  ],
  "content": "I'm in the midst of a client project where I've been asked to tinker with Futura. Here is a sample that examine the bold and what is needed (IMO) to fix it. I think Lucas DeGroot has redone Futura for VW for many of the same reasons, but I haven't taken a close look at his results. Not sure what is so satisfying about shooting botox into an aging font, but it sure is fun! (and instructive)\n\nSpot the fixes:\n\n ![](http://web.archive.org/web/20150315072722im_/http:/typophile.com/files/fix_futura_4294.gif)\n\n",
  "author": "Randy",
  "time": "23 Jun 2009 — 5:07pm",
  "uid": "7783",
  "comments": [
    {
      "time": "23 Jun 2009 — 5:57pm",
      "content": "Nice. You've certainly made it more contemporary. When you say \"original\" [whose digitization](http://web.archive.org/web/20150315072722/http:/www.fontshop.com/fontcase/genres/futura/) do you mean?\n\n"
    },
    {
      "time": "23 Jun 2009 — 7:00pm",
      "content": "If you plan to take a look at Luc(as)' revision, you might want to also check out Frutiger's Alpha BP, in which he removed the optical compensations that Colin Forbes considered \"fiddly.\" There are three pages on it in the new Frutiger Typefaces book.\n\n"
    },
    {
      "time": "23 Jun 2009 — 9:16pm",
      "content": "The Neufville version. This was for a logo which explains the liberties taken with the a. Stephen your list confirms that if this ever did become a font, it would need more of the qualities of the a throughout to stand on it's own.\n\nauricfuzz: I've added the book to my wish list. I hadn't realized Frutiger did a version, but I do agree that the optical compensation is fiddly. Nowhere more evident than the a. Here you can physically see the designer battling the geometric formula to produce a workable letter. I chose a different compromise.\n\n"
    },
    {
      "time": "24 Jun 2009 — 12:20am",
      "content": "_...explains the liberties taken with the a._ You mean like Paul Renner did?\n\nThis is [Gert Wiescher's Futura Classic](http://web.archive.org/web/20150315072722/http:/new.myfonts.com/fonts/wiescherdesign/futura-classic/). For some reason it's not mentioned in the Fontshop typecase that Stephen gives.\n\n ![](http://web.archive.org/web/20150315072722im_/http:/typophile.com/files/Futura_ahoi_6356.jpg)\n\n"
    },
    {
      "time": "24 Jun 2009 — 10:46am",
      "content": "I know there are some fanciful alternates that Renner did, especially the chevron g. I've never read about the thinking behind them, but they always strike me as looking from a different font entirely. Interesting in a historical sense, but not practically IMO. Futura classic seems to solve some of the same issues I was noticing, though I wonder about the different counter heights on the h and o. Sometimes this can be distracting. Maybe not in this case.\n\n"
    },
    {
      "time": "24 Jun 2009 — 11:41am",
      "content": "The lower case of Futura was never as completely successful as the great, timeless upper case.\n\nIf you are redoing the whole thing I think a key challenge is making lower and upper case relate. The original long extenders on the lower case I think work, and help readability. The single story a, as you and others have noted, is problematic, though it does harmonize well with the upper case.\n\nOf course Frutiger's Avenir (\"future\" in French) is an effort--quite successful--to modernize Futura with short extenders and a double story a.\n\nTo me your \"a\" doesn't go so well with the look of the rest of the classic Futura, but you might rework the whole thing into something different and good.\n\n"
    },
    {
      "time": "26 Jun 2009 — 11:15am",
      "content": "Luc's Version is a favorite of mine, and it's such a shame it cannot be used, as it is owned by VW :-D. It is made a bit colder, more geometric - and certainly not always easier to typeset - but at the same time feels more modern.\n\nVery nice idea to twist Futura - someone really should do a modern version of that :-D.\n\nHD Schellnack\n\n"
    },
    {
      "time": "26 Jun 2009 — 11:20am",
      "content": "If my understanding is correct they weren’t alternates, they were the original letters. Futura as originally designed was more radical (and flawed), but Renner was amiable to the Bauer foundry taming/fixing the design and replacing some of the wilder lowercase characters as they proved unpopular in the first few years that the typeface was on the market.\n\n"
    },
    {
      "time": "26 Jun 2009 — 1:02pm",
      "content": "Randy, are you working your way through fixing all the well-known fonts?!\n\nThis sure looks nice! I really like the changes, the thin joins of Futura always made me a bit anxious.\n\nAre you doing a whole character set?\n\n"
    },
    {
      "time": "26 Jun 2009 — 3:58pm",
      "content": "Thanks for your comments everyone. I've not done a full lowercase, but I will probably do that in the near futura if this type is selected for the logo. Otherwise the distant futura.\n\n"
    },
    {
      "time": "29 Jun 2009 — 11:51am",
      "content": "Not a complete lowercase, but played a bit over the weekend.\n\nMy custom version of Futura:\n\n ![](http://web.archive.org/web/20150315072722im_/http:/typophile.com/files/futura_rev_5270.gif)\n\nNeufville Futura @ same x-height size:\n\n ![](http://web.archive.org/web/20150315072722im_/http:/typophile.com/files/futura_orig_5863.gif)\n\nSome spacing issues for me: some from the gif, some from no-kerning, some from actual issues! In general, a bit more compact and even IMO. Interesting trying to play in the narrow serif on the \"a\". Eg. In the n also? No, it looked too weak. Another area for question is the angle of the terminals on \"e\" and \"c\". Check the e though.. the neufville version looks like another weight. A challenge for sure. It would be interesting to see how this translates to cap and lighter weights.\n\nEdit:  \nWanted to say thanks to Miguel Sousa for his very helpful Adhesion Text tool: [http://www.adhesiontext.com/](http://web.archive.org/web/20150315072722/http:/www.adhesiontext.com/ \"http://www.adhesiontext.com/\") very useful for testing partial character sets.\n\n"
    },
    {
      "time": "29 Jun 2009 — 12:28pm",
      "content": "Wow, this is nice work indeed. Looking fresh and yummy!  \nI'm especially intrigued by what you did to the \"j\".\n\n"
    },
    {
      "time": "29 Jun 2009 — 12:56pm",
      "content": "This is cool. The shorter ascenders/descenders change the flavor a lot, I think.  \nDid you try a less-steep interior line on those thinner bits (abgq)?  \nI like the narrower k a lot. t and f are great too (though does t dip too low?)  \ne is a good solution, but c's terminals aren't working for me.\n\n"
    },
    {
      "time": "29 Jun 2009 — 3:12pm",
      "content": "Thanks!\n\nCraig: Yes, I did try them more triangular, if that's what you mean. It made it a little to \"Tarzana\" for my taste. Speaking of, I did try something like the Tarzana solution for the c -- flat on top angled on bottom. The trouble with c and e is that they are genetic brothers, but c needs a milkshake, and e needs a diet! And yes, t was suffering from gravitational pull. Good catch!\n\nI did also to a horizontal sheer on the c and e, but felt the e a little distracting. Though it's not bad, the quirky thin crossbar relates to the quirky thin serif. Here are a few permutations:\n\n ![](http://web.archive.org/web/20150315072722im_/http:/typophile.com/files/ce_fixtura_4839.gif)\n\n"
    },
    {
      "time": "29 Jun 2009 — 4:44pm",
      "content": "good lord you certainly fixed that 'e'.\n\n"
    },
    {
      "time": "29 Jun 2009 — 9:29pm",
      "content": "Ah but which fix?\n\n"
    },
    {
      "time": "29 Jun 2009 — 11:40pm",
      "content": "both\n\n"
    },
    {
      "time": "7 Jul 2009 — 6:06am",
      "content": "The shortened ascenders -- and thereby relatively increased x-height -- certainly make it much more in keeping with grotesque conventions, and correspondingly more distant from Renner's vision of Futura as a letter style appropriate for extended text settings.\n\nWhat really moves this away from the idea of a serif-less roman and into the grotesque camp are tail on the t -- well done -- and the oblique arm terminations on the lower case c -- less so. The need for the vertical cuts, which are shared with Gill Sans, is less obvious in English than in German where c is frequently followed by h or k. This issue was discussed about a year ago at:  \n [RE: ch & ck in German : please enlighten me!](http://web.archive.org/web/20150315072722/http:/typophile.com/wiki/RE%3A%20ch%20%2526%20ck%20in%20German%20%3A%20please%20enlighten%20me%21)\n\nI suspect Renner would have disliked your changes, but they would have been embraced by Tschichold.\n\n"
    },
    {
      "time": "7 Jul 2009 — 10:47am",
      "content": "There is a definite grotesquification going on here: the letter relationships of Helvetica or AG, applied to Futura. (See the c/e)\n\n_Renner’s vision of Futura as a letter style appropriate for extended text settings_  \nI've never been able to make Futura work for extended text. Not sure I've ever seen it done well either. Seems like the vertical stress and geometric/repeated forms create a problem no amount of ascender can surmount. Someone will no doubt say Futura in metal is much better for text than the anemic digital versions!\n\n_The need for the vertical cuts, which are shared with Gill Sans, is less obvious in English than in German where c is frequently followed by h or k. This issue was discussed about a year ago_  \nThanks for that thread ( [http://typophile.com/node/43911](http://web.archive.org/web/20150315072722/http:/typophile.com/node/43911 \"http://typophile.com/node/43911\")), I'd only seen reference to it in Bringhurst. Is this a need as much as an older convention? Else why not a similar solution for c\\_l? I will explore a solution for the c that is closer to Futura, but I tend to dislike a vertical sheer as the weight gets bold, and prefer the e and c to relate more closely as above. Perhaps there is a middle ground for an optional alternate.\n\nAs usual, Ive grown to appreciate Renner and Futura much more as a result of this experiment. Thanks for your thoughtful comments Charles!\n\n"
    },
    {
      "time": "7 Jul 2009 — 7:25pm",
      "content": "_Is this a need as much as an older convention? Else why not a similar solution for c\\_l?_  \nIt is really a linguistic artifact. Just for fun I picked a page at random from _Die Kunst der Typographie,_ Renner's most successful use of his own face. On the page, 95, there were roughly 40 pairs of ch or ck and not a single cl, and that's out of approx. 2400 characters.\n\nThe point I am making is that Futura has particular aspects of style that are historically and culturally contingent. We are not — or at least I am not German — and don't compose in the language, but Renner did, and at its heart Futura is a German face. Adaptive use, and modification of those contingent aspects produces a derivative of Futura, and in this case what appears to be a good one.\n\nOne more suggestion. In looking at your sample again the test word \"maim\" sort of jumped out at me. The addition of weight to the \"bactrian\" humps of the m throws the balance of that particular character too much to the right for my taste.  \nBon Chance.\n\n"
    },
    {
      "time": "7 Jul 2009 — 8:32pm",
      "content": "Thanks Charles. It is helpful to see what I considered a quirk in Futura (the c), to be Renner's solution to a specific problem. Dictionary in hand I will re-examine the \"bactrian\" humps!\n\nUpdate: client has chosen the futura lettering for their logo, so it looks like I'll need to press on. I'll show more when appropriate.\n\n"
    },
    {
      "time": "7 Jul 2009 — 10:39pm",
      "content": "Keep going!\n\nAs someone who was playing in a similar (though serify) pond recently, I'm liking your update and the contemporary elements you're playing with (something I've not had the nerve to do on anything yet).\n\n:)\n\nsteve mehallo  \ntinyurl.com/mehallofonts  \nmehallo.com\n\n"
    },
    {
      "time": "7 Jul 2009 — 11:16pm",
      "content": "[Futura Serie BQ](http://web.archive.org/web/20150315072722/http:/www.bertholdtypes.com/bq_library/090204000.html).\n\nFor the mix. Of note, this version has SC & OSF.\n\n"
    },
    {
      "time": "8 Jul 2009 — 1:18am",
      "content": "This is not fixing Futura, this is designing a geometric sans. The result starts looking like Gotham, because that was also a solution for the same issue that Renner faced: designing a sans that is as neutral as can be. Renner wisely chose the Roman caps for his caps, as can still be seen in the protruding tips on the diagonals up to the Medium weight.  \nBTW: when we did the Futura work for VW at MetaDesign in 1995, we worked from a Bauer letterpress specimen, so the VW version (called VW Headline as it was only intended for headlines, text was and is Utopia) is very close to large-size foundry Futura. Neufville, of course, worked from the same originals, seeing that they own the license to the Bauer library.\n\n"
    },
    {
      "time": "8 Jul 2009 — 9:47am",
      "content": " ![](http://web.archive.org/web/20150315072722im_/http:/typophile.com/files/hypatia-sans-bold_5251.png)\n\n"
    },
    {
      "time": "8 Jul 2009 — 10:40am",
      "content": "Is it just me or does that alt a in Hypatia look a little overinflated?\n\n"
    },
    {
      "time": "8 Jul 2009 — 3:07pm",
      "content": "Florian: this make me want to throw a aghilmnprty.\n\nErik: Thank you for your comments and the info about VW Headline. I'll have to find a pdf at the VW website and compare it to the Neufville version. Regarding \"fixing\" vs \"designing\" I agree with you. The word choice references a group of threads earlier about \"fixing\" Arial, and there is no disrespect intended to anyone on my part in either case. At first I was set to argue your Gotham reference, but after reviewing my H&FJ printed specimen I have to agree with you there too. It is amazing what a two-story vs single story a does to change the personality of a geometric alphabet. I wonder who would recognize the Gotham lowercase with a single story a.\n\nI expect the choices left to be made in the caps and lighter weights will greatly influence where this typeface ultimately ends up on the Futura--Gotham geometric scale. On my end, I quit looking at Futura after I drew \"ahoi\" and instead have been drawing something Futura-like. For example, I did not realize what a departure the t was until I posted here.\n\nClearly one of the drawbacks of using a compass is how it always seems to draw a circle!\n\n"
    },
    {
      "time": "8 Jul 2009 — 3:37pm",
      "content": "\\> It is amazing what a two-story vs single story a does to change the personality of a geometric alphabet\n\nYes! Interestingly it has the reverse affect in a [serif](http://web.archive.org/web/20150315072722/http:/bit.ly/sHilT), where a single story 'a' is more casual and friendly.\n\n"
    },
    {
      "time": "10 Aug 2009 — 6:24am",
      "content": "The biggest problem with such Futura revision is the how to draw terminals. Its clear that C, e, s, or G/g features special endings and it sound to me weird to try to make them suddenly exactly all the same. The point is perhaps not making them like the original one but trying to understand the philosophy behind them and improve.\n\nCan't wait the new \"s\": As its the key thing on such geometric font.\n\n"
    },
    {
      "time": "10 Aug 2009 — 8:57am",
      "content": "Hi JFP, yes definitely. The thing that is both great and difficult with such a reduced letter is the design considerations are so visible. For example the designer may choose to try to make the terminals of the c,e,s all match for ideological or style reasons, but the type may suffer in letter fit, or color, or legibility, or..\n\nNow, when I look at this genre of type, it is easier to see the compromises that were made, and which variables the designer felt were most important.\n\nTo answer your curiosity and solicit your further opinion, a complete lowercase. Oh, and my apologies. I did not notice the mangling of \"mont blanc\" to \"ont bslanc\" in the sample. So much for cultural sensitivity :-)\n\n ![](http://web.archive.org/web/20150315072722im_/http:/typophile.com/files/lowercase_4107.gif)\n\n"
    },
    {
      "time": "15 Aug 2009 — 5:23am",
      "content": "Can anybody point me to some images of the Volkswagen cut of Futura on the web? I keep seeing it fly by on busses etc but never get to see it properly. It looks really good compared to the versions that I have! I know that it's not available, I'd just like to study it!\n\nAlso I noticed that Lexus seems to have it's own geometric font, or at least I do not recognize it  \n [http://www.baumannmeyer.com.au/baumann\\_meyer/Lexus\\_%20Article.jpg](http://web.archive.org/web/20150315072722/http:/www.baumannmeyer.com.au/baumann_meyer/Lexus_%20Article.jpg \"http://www.baumannmeyer.com.au/baumann\\_meyer/Lexus\\_%20Article.jpg\")  \n [http://unbecominglevity.blogharbor.com/pix/lexus\\_ad\\_2.jpg](http://web.archive.org/web/20150315072722/http:/unbecominglevity.blogharbor.com/pix/lexus_ad_2.jpg \"http://unbecominglevity.blogharbor.com/pix/lexus\\_ad\\_2.jpg\")\n\n"
    },
    {
      "time": "15 Aug 2009 — 8:21am",
      "content": "Thanks for this new image Randy. Not easy to judge from this screen size.\n\nIn short I'm not convinced by the top a & g because it sound not natural and basic forms like futura should be in its \"philosophy.\" Also why q or p/d don't feature similar things? Be simple.\n\nk is also too 50's-80's like Frutiger did.\n\nThe came the c. Not easy to see what to do: Perhaps the best should be to try several variations in context to be able to judge. From the fully open futura-c to the one from your sample. In between, we can have similar open forms like in e and s. Ask yourself: I have a r, with horizontals terminals and c without at all. (I think that P Renner probably have designed is c like the r to avoid clashs and improve letter spacing?)\n\nThe s seems to identical top/bottom, a s should be designed like a pyramid. The middle of the s should be a bit heavier when top/bottom lighter a bit?\n\nhorizontal bar of e is too light.\n\n"
    },
    {
      "time": "15 Aug 2009 — 10:36am",
      "content": "1985: try searching google with... site:vw.com filetype:pdf it turned up lots of examples such as: [www.vw.com/downloads/pdf/VW\\_CareFree\\_Maintenance.pdf](http://web.archive.org/web/20150315072722/http:/www.vw.com/downloads/pdf/VW_CareFree_Maintenance.pdf \"www.vw.com/downloads/pdf/VW\\_CareFree\\_Maintenance.pdf\")\n\njfp: thank you for your feedback! Next time around, I will post a pdf or larger image.\n\nRegarding the small point on the a,g,q:  \nI was introducing a different formula to try and solve the problem where I feel Futura's formula breaks down. This problem is in the bolder weights where the round bowls join the straight stem. In futura, the optical correction for me is too extreme resulting in round counters that are not round, and an ugly pinched curve to let more air into the join. So I opted to allow the curve to flow further into the stem and introduced a thin \"element\" to the font. I had hoped this would also relate thematically to the thin crossbar on the e, to solve a different problem in the neufville futura. I chose not to use this element at the baseline p/d because it seemed too weak as a \"support\" for the letter, but seemed ok at the x-height/top of the letters (a/g/q). Also, I think this adds \"recognition\" to this geometric sans. People can say immediately: ah that is Randy's geo-sans with the little \"a\" thingy. :-)\n\nRegarding the c:  \nYes I should try something more like Futura. It seems the vertical sheer is good for spacing, but also the fully closed version (spacing similar to the \"o\"). It is the open version similar sheer to the e and s that is sometimes hard to space (for me). As it is, there are no other horizontal sheers, so my \"c\" solution may not be a good idea!\n\nRegarding the s/e:  \nThese are the two letters that cause the most problems in the alphabet when it gets bold, so you have to play games. One thing that has guided my thinking here, and elsewhere is to try and keep interior counters about the same height. If they are too different, then it's distracting (as in the neufville e). So I've tried to keep the interior counter of the e, n, o, c, etc ending at about the same height. It cannot be exactly the same, but I'm trying to keep it visually close. This means for the s/e that the black must come out of the middle to balance color. I wonder what you think of this idea counter height consistency? You're comments seem to say I'm following this \"rule\" to closely!\n\nThank you again for your comments! I appreciate you taking the time to lend your experienced eyes to my effort, and will try your suggestions.\n\n"
    },
    {
      "time": "15 Aug 2009 — 10:47am",
      "content": "_the designer may choose to try to make the terminals of the c,e,s all match for ideological or style reasons, but the type may suffer in letter fit, or color, or legibility_  \nBecause letters in this style are so very reduced, after basic proportional issues are settled, arm terminals of curved strokes remain one of the most important aspects of the resulting face. In your sample, the word \"necessary\" contains a nice sequence of letters by which to judge the effect of different angles -- birdcages would be another one.\n\nIn an aesthetic sense, the ideal shape of each should emerge without regard to possible orthographic or programmatic issues. In that light, I feel that the reduced \"heel\" of the b needs some work. I can see how it is derived from the a, which you indicated was a component of the original design brief. Although I can understand its origin, to my eye it introduces a disturbance of the line, like a chipped character on a proof.\n\n"
    },
    {
      "time": "15 Aug 2009 — 1:55pm",
      "content": "Hey thanks Randy, didn't think of that, great tip.\n\n"
    },
    {
      "time": "15 Aug 2009 — 6:47pm",
      "content": "\"necessary birdcages\" will get a look! I'd forgotten about the b in my note to jfp above. I agree that it is suffering from spindliness at the baseline. Thanks!\n\n"
    }
  ]
}
