{
  "id": "59354",
  "title": "Serif partner for Bryant",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi  \nWe are rebranding our (training) company and our logo uses Bryant font from Process. I’m wondering if anyone has paired Bryant with a serif font for immersive reading. So far the suggestions have been Officina Serif, Minion and Georgia. To me these don’t quite work and I’ve had a look at Meta Serif, Utopia, Melior and Fedra Serif B. I might licence the first two of these to see which looks nicest and post some samples for crit here, but first of all wondered if anyone had a combination they thought was really successful.\n\nUnfortunately I’m finding Bryant a bit difficult to use as there’s so much space between the letters and the wide rounded tone feels a bit too cartoony next to very sober fonts (it looked very strange next to Garamond, Minion and New Baskerville!)\n\n(Actually I thought that Myriad looked neat with Bryant, they do contrast quite well despite both being sans serif designs. Obviously there’s the tension between humanist and geometric, rounded and flat terminals, so maybe that explains it. But our creative director said they didn’t work too well together.)\n\n",
  "author": "<a href=\"/web/20090627024636/http://typophile.com/user/20652\" title=\"View user profile.\">Bendy</a>",
  "time": "<br>",
  "uid": "20652",
  "comments": [
    {
      "time": " 26.Jun.2009 6.23am",
      "content": "Here’s Bryant paired with Meta Serif and with Officina Serif. To me, it looks like Officina Serif is too busy (too many corners) and too narrow and too quirky for immersive reading. And it’s also been around a few years. Does anyone disagree that Meta Serif works well as a companion to Bryant?\n\n ![](http://web.archive.org/web/20090627024636im_/http:/typophile.com/files/Bryant-Companions_6007.gif)\n\n"
    },
    {
      "time": " 26.Jun.2009 6.47am",
      "content": "If you are matching characteristics, something wider than Meta Serif would be more of a match. But contrasts can work, as well as matches, so I think it is very hard answer such questions until you look at the intended layout.\n\n"
    },
    {
      "time": " 26.Jun.2009 7.09am",
      "content": "Hi, thanks William. I’m not exactly wanting to match characteristics because I think the wide proportions of Bryant won’t allow enough text on the page for extended body copy. I’m creating a brochure with Bryant for headings, subheadings and quotes, then need something to give details and descriptions of services. I need something space-efficient, readable and harmonising (so contrasting rather than matching I guess). I thought the square forms and terminals of Meta Serif would balance out the almost overpowering roundness of Bryant, whilst the vertical stress seems to relate to the geometric and monolinear structure of Bryant in a way that something like Garamond, Sabon or Minion didn’t. And it’s lower contrast than New Baskerville.\n\n"
    },
    {
      "time": " 26.Jun.2009 8.47am",
      "content": "\\< self promotion \\>\n\nWhat about something in-between the oldstyles and what you’ve tried above? Does [Whitman](http://web.archive.org/web/20090627024636/http:/www.fontbureau.com/fonts/Whitman) strike you at all as a suitable companion? Wider forms, simple structure, smallish x-height, modest contrast . . .\n\n ![](http://web.archive.org/web/20090627024636im_/http:/typophile.com/files/Bryant-Whitman_3491.png)\n\n\\< /self promotion \\>\n\n"
    },
    {
      "time": " 26.Jun.2009 9.16am",
      "content": "I like the friendliness of Whitman. Both Meta and Officina are a bit narrow to my taste.\n\nJust curious (this isn’t finished yet) how you feel about this:\n\n ![](http://web.archive.org/web/20090627024636im_/http:/typophile.com/files/Bryant-and_Calluna_5946.jpg)\n\n"
    },
    {
      "time": " 26.Jun.2009 12.54pm",
      "content": "Kent, that’s really interesting as I tried Bodoni and Joanna along the way. I think Modern serif fonts fit well with Bryant, so Whitman would be a good companion. It looks nice and elegant.\n\nFor my brochure though, I think I’m looking for something more humanist (meaning that Officina Sans and Meta Sans strike me as humanist, and their Serif siblings are built from the same bones). I worry that there’s a bit too much roundness in Bryant, so I’m after something where the curves and counters are a bit less round looking.\n\nJos, thanks for posting this; as you know I’m quite excited by Calluna, and especially the italic (vwxyz are enviable). I’m not sure if you’re looking for critique and this isn’t the right thread anyway. As for my brochure, I think it has the right tone but to me the oldstyle stress doesn’t sit very comfortably with Bryant’s unsophisticated geometry.\n\nIt’ll be interesting to see what others think of these combinations.\n\n"
    },
    {
      "time": " 26.Jun.2009 1.12pm",
      "content": "For some reason, every time I visit this thread and think about it, [Scala](http://web.archive.org/web/20090627024636/http:/www.fontshop.com/fonts/downloads/fontfont/ff_scala_1/) pops into my mind. Which is strange because I’ve never worked with Scala. But looking at samples, maybe it could work quite well.\n\nI think Whitman might be great too. A bit more “literary” than Scala maybe? It looks “harder” next to the utter roundness of Bryant than Scala does, too.  \nI think Calluna is not a bad match either, but next to Bryant it looks \\*very\\* old-style. Not sure if that’s the intended tone?\n\n"
    },
    {
      "time": " 26.Jun.2009 1.22pm",
      "content": "How about this?\n\n ![](http://web.archive.org/web/20090627024636im_/http:/typophile.com/files/Bryant-Emi_4542.gif)\n  \nJust kidding! I think Whitman is the happiest pairing of these by far.\n"
    },
    {
      "time": " 26.Jun.2009 1.23pm",
      "content": "\\>Whitman...literary  \nYes, that’s kind of what I was trying to mean. It’s certainly elegant but I’m not really after a literary look for a brochure. I’d agree with ’harder’ too.\n\nI fear Scala is a bit wild and out of control next to bubbly young Bryant. It’s an intersting font, I can’t say I really understand it.\n\nThis is difficult!\n\n"
    },
    {
      "time": " 26.Jun.2009 1.26pm",
      "content": "Craig, very good ;)\n\nWith Scala:\n\n ![](http://web.archive.org/web/20090627024636im_/http:/typophile.com/files/Scala_4874.gif)\n\n"
    },
    {
      "time": " 26.Jun.2009 1.28pm",
      "content": "Your comparisons are not much help.  \nShowing words and relative size difference would be better.\n\n\\*\\*\n\nIf the proportions don’t match, try horizontal scaling your text type to make the curves closer to the roundness of Bryant.\n\n"
    },
    {
      "time": " 26.Jun.2009 1.35pm",
      "content": "Nick, are you being ironic?\n\n"
    },
    {
      "time": " 26.Jun.2009 1.36pm",
      "content": "Difficult indeed ;) Ben, I wasn’t looking for crits. I was just playing around and (as you also noticed) liked the tone of it.\n\n"
    },
    {
      "time": " 26.Jun.2009 1.39pm",
      "content": "_“It’s certainly elegant but I’m not really after a literary look for a brochure.”_  \nBut this is impossible to say without knowing anything about the layout and typography. FWIW, exactly regarding Whitman, I’m currently preparing a brochure and typesetting a book with it, and at least to me it feels quite young and fresh (but still serious and intelligent) in one, and quite classical (if still fresh and witty) in the other. Different, is my point.\n\n_“try horizontal scaling your text type”_  \n?!\n\nRegarding Scala: Nobody typesets AaBbCc, so the font’s never going to look like that. This is what I was looking at:  \n[Edit, I just remembered I’ll be sued or something if I post samples off Myfonts, so just do one with “The quick brown fox” yourself. :-|]\n\n"
    },
    {
      "time": " 26.Jun.2009 1.41pm",
      "content": "_?!_\n\nDon’t knock it till you’ve tried it :-)\n\n"
    }
  ]
}
