{
  "id": "59382",
  "title": "compositional consistency vs. inconsistent text; drop caps",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Trying to find the best layout for a book of very short prose made me think again of the question of typography vs. textual content. Of course the layout should be consistent and shouldn't impose itself or even work against the text, but is compositional consistency still the priority when the text itself is inconsistent in its structure? Should one in such a case just stick to basics or allow for differences?\n\nMy particular problem concerns titles and possible drop caps. The text has titles, but sometimes they are also the beginning of the first sentence. In that case the first line after the title begins with a lower-case letter, so a drop cap would be impossible.\n\nFurther more, two or three pieces have only two lines (as two separate paragraphs), which makes the drop cap look awkward.\n\nI've enclosed two samples: one that works for the vast majority of the texts and one for the exceptions.\n\nWhat are your oppinions? Would you simplify the layout or allow for such inconsistencies?\n\nAny suggestions would be much appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [spread\\_sample\\_1.pdf](http://web.archive.org/web/20131020225754/http:/typophile.com/files/spread_sample_1.pdf) | 47.18 KB |\n| [spread\\_sample\\_2.pdf](http://web.archive.org/web/20131020225754/http:/typophile.com/files/spread_sample_2.pdf) | 41.22 KB |\n\n",
  "author": "omeld",
  "time": "25 Jun 2009 — 1:21pm",
  "uid": "41766",
  "comments": [
    {
      "time": "25 Jun 2009 — 2:37pm",
      "content": "If you've got 2-line items you probably want to forget about the drop cap. The drop cap won't look good, and that stick-up cap following the guillemet just looks silly. You have to be really careful with drop caps that have an opening quote or guillemet attached to them.\n\nYour drop cap example that starts with the word \"Ko\" is also a good reason to forget the drop caps. Two-letter words look really silly with the first letter as a drop cap unless the two letters are closely fitted together so they read as a single unit.\n\n& small caps [sometimes full caps] are better to follow drop caps rather than lower case. There's a better color transition.\n\nWhen faced with these sorts of quandaries, always simplify.\n\npowers\n\n"
    },
    {
      "time": "25 Jun 2009 — 8:02pm",
      "content": "I prefer consistency, and I think you can make a drop cap succeed if you are very confident and positive about its qualities and virtues. Therefore, I would suggest you use a proper \"titling\" intitial for the big letters, not just blowing up Scala, which just looks like Scala enlarged, and somewhat klunky. Also, in deference to the scale of the large intial letter, you can make quote marks and accents much much smaller. You can make the opening quote the same size as the closing quote.  \nSo if you put such subtle nuances into a drop cap/raised initial, then it can command a page without overpowering it, even one with very little else on it.\n\n"
    },
    {
      "time": "26 Jun 2009 — 5:14am",
      "content": "Thanks for the input. I've just had a meeting with the author and we've both decided to simplify the layout for his text, but I'll still use the above for others. Besides, it's going to work much better with longer texts where the titles won't get mistaken for running heads.\n\n"
    },
    {
      "time": "26 Jun 2009 — 6:44pm",
      "content": "In this particular case I'm with Will, but if you have the courage and skill, it really is a case-by-case issue.\n\nOn of the last talks Richard Eckersley gave -- Will was there BTW -- involved a book where where the best design solution involved using essentially a different design for each page of the front matter. I think he made his case, at least for the book shown. Richard would also abandon the grid at the drop of the hat if it improved the reading of a book -- though Richard's grids were often subtly complex enough to hold even when one or two elements were absent.\n\n\\* \\* \\*\n\nThere are ways to use a drop cap with a short first paragraph. For the new paragraph, start a new line, and indent enough to signal what's going on, all the while keeping the general wrap around the cap. But when you start to add in other complexities, as Will says, usually best to simplify.\n\n"
    }
  ]
}
