{
  "id": "59381",
  "title": "Analog Source: Letterpress in an American Design Education (St Bride Library)",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20100103131036/http:/typophile.com/user/108 \"View user profile.\") : 25.Jun.2009 12.07pm \n\n\\* An illustrated talk at St Bride Library  \n\\* Tuesday 30 June 2009 at 7pm  \n\\* In the Bridewell Hall, St Bride Foundation  \n\\* Admission £7; concessions £5; Friends of St Bride £3  \n\\* Pay on the door\n\nMany examples of student work from the Visual Communications Program at  \nthe University of Delaware are intended to insight a lively conversation  \nabout the value of letterpress in contemporary design education. Ashley  \nJohn Pigford and William Deering will speak about the Raven Press at the  \nUniversity of Delaware as a place of unbridled experimentation and  \nphenomenological education.\n\nProfessor Ashley John Pigford is an artist, designer, musician and  \neducator who works across a wide range of art and design media including  \nvideo, sound, installation, performance, sculpture, micro-electronics  \nand letterpress. His current employment as Assistant Professor of Visual  \nCommunications and Co-director of Raven Press at the University of  \nDelaware is paired with an active art/design studio practice. Ashley  \nreceived his MFA in Graphic Design from the Rhode Island School of  \nDesign in 2006 after a successful career as a proprietor of graphic  \ndesign in Los Angeles, CA.\n\nProfessor William Deering is the coordinator of the Visual  \nCommunications program, teaches photographic design, Co-directs the  \nletter press facility Raven Press and the London Study abroad program in  \nthe Department of Art, University of Delaware. His many awards over the  \npast 30 years have included: The American Institute of Graphic Arts, The  \nArt Directors Club of New York, Communication Arts, Print, The One Club,  \nand the Society of Publication Designers.\n\n[http://stbride.org/events/analogsource](http://web.archive.org/web/20100103131036/http:/stbride.org/events/analogsource \"http://stbride.org/events/analogsource\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103131036/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 25.Jun.2009 12.07pm",
  "uid": "108",
  "comments": [

  ]
}
