{
  "id": "59393",
  "title": "Pintura",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "this is a type i have been working for a while  \ncomment please\n\nsee ya\n\n ![](http://web.archive.org/web/20150416063541im_/http:/typophile.com/files/pintura_4091.gif)\n\n",
  "author": "manisalao",
  "time": "25 Jun 2009 — 7:35pm",
  "uid": "37767",
  "comments": [
    {
      "time": "26 Jun 2009 — 6:24pm",
      "content": "The \"g\" might be mistaken for a \"q\" at first glance, the \"f\" without a crossbar is interesting but may prove too distracting (notice the big gap that's apparent). The general feel is good although it seems like too many of the letters \"rest\" on a flat \"bottom\" which adds a noticeable mechanical/rule-bound force that detracts from the general dynamics of the whole. Or basically work a bit more on the bottoms of your letter-shapes in keeping with the general feeling of the design - right now a few of the shapes are too \"flat\" down there.\n\nHope this helps.\n\n"
    },
    {
      "time": "27 Jun 2009 — 2:58pm",
      "content": "the \"f\" without crossbar is because i dont know how to do it and the flat shapes is because with a rounded shape makes it seem like too tiptoe in the base.\n\nalso is very similar with this another font [http://www.flickr.com/photos/de\\_gregorio/2136657922/in/set-7215760374139...](http://web.archive.org/web/20150416063541/http:/www.flickr.com/photos/de_gregorio/2136657922/in/set-72157603741398142/ \"http://www.flickr.com/photos/de\\_gregorio/2136657922/in/set-72157603741398142/\")\n\n"
    },
    {
      "time": "12 Sep 2009 — 6:02am",
      "content": "I love the general feel of your letters; I think perhaps the bottom line of letters such as m, r, h, i, l, k, which are at the moment quite sharp and square, could do with a little more bounce (so to speak).\n\nI'm unsure about the upper case 'U', it seems a little lifeless and square, compared to your beautiful upper case 'C' and 'K'.\n\npersonally, I think the lower k is also beautiful. :)\n\n"
    }
  ]
}
