{
  "id": "59391",
  "title": "america logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": " ![](http://web.archive.org/web/20131021001032im_/http:/typophile.com/files/Imagen-7_6648.gif)\n  \n\n ![](http://web.archive.org/web/20131021001032im_/http:/typophile.com/files/am_4092.png)\n\na sketch for latin america brand contest\n\n",
  "author": "manisalao",
  "time": "25 Jun 2009 — 5:38pm",
  "uid": "37767",
  "comments": [
    {
      "time": "25 Jun 2009 — 6:51pm",
      "content": ".\n\n"
    },
    {
      "time": "25 Jun 2009 — 7:52pm",
      "content": "I agree with Ratbaggy.\n\n"
    },
    {
      "time": "26 Jun 2009 — 3:29am",
      "content": "looks interesting, but the first thing i thought of was 'olympics'\n\n"
    },
    {
      "time": "26 Jun 2009 — 5:04am",
      "content": "For one thing, what's with the poor image quality?\n\n"
    },
    {
      "time": "26 Jun 2009 — 6:18am",
      "content": "because is a gif and my internet connection is very slow.  \nso i save it with \"web option\" in Photoshop\n\nwhy olympics?\n\n"
    },
    {
      "time": "26 Jun 2009 — 7:17am",
      "content": "You could just have made it smaller.\n\n"
    },
    {
      "time": "26 Jun 2009 — 8:08am",
      "content": "I thought Olympics as well, mostly because of the colors or the \"ribbons,\" which are, if not identical, very similar to ones in the Olympic rings. People can't really give a very good critique unless they have more context, like what is this logo for? Where will it be used? Also, I think you'll find a lot of resistance here for no other reason than this is for a design contest. The vast majority of users here (myself included) do not approve of commercial design contests. Troll a bit and you're sure to find several threads which will explain that position more fully.\n\n"
    },
    {
      "time": "26 Jun 2009 — 9:34am",
      "content": "Haven't had my caffeine yet, I thought it was for a band contest like American Idol. Although the weaving bands made me think it was for a race. I'm curious what is a \"latin america brand\"? Brand of or for what? Is the product a contest or are you submitting to a contest?\n\n"
    },
    {
      "time": "26 Jun 2009 — 9:40am",
      "content": "It's really hard to critique a logo without context. Is this a business? An event? An organization? What are the objectives? Granted, if this is a contest, those things are usually missing and, as such, are one of many reasons why contests are usually a bad idea.\n\nAt the moment, we can only judge aesthetics.\n\nLooking at the letter forms, I'm seeing inconsistency in stroke weight. Compare your strokes in the 't' with the 'a'.\n\n"
    },
    {
      "time": "26 Jun 2009 — 10:13am",
      "content": "basically, is to send a logo to a design contest of Latin America, Palermo, Argentina. The main thing is to criticize the construction of the logo and not the rest.\n\ni think maybe the logotype can work alone and not with the isotype.  \nexcuse me the English, this is not my native language.\n\n"
    },
    {
      "time": "26 Jun 2009 — 10:40am",
      "content": " ![](http://web.archive.org/web/20131021001032im_/http:/typophile.com/files/latin080_3431.png)\n\nanother version without isotype.\n\n"
    },
    {
      "time": "26 Jun 2009 — 11:06am",
      "content": "You believe a logo can be criticized without context?  \nWell, that explains why you've been tricked into working for free under the guise of a contest. Sorry if that sounds harsh, but it's true.\n\n"
    },
    {
      "time": "26 Jun 2009 — 11:09am",
      "content": "_You believe a logo can be criticized without context?_\n\nOh, please. At the very least, as aluminum said, its overall composition and balance can be commented on and it is pretty darn easy to describe what feelings and associations it evokes. Tell me it's not a useful critique to have.\n\n"
    },
    {
      "time": "26 Jun 2009 — 11:13am",
      "content": "To me this looks like a close relative of the [Chicago typeface](http://web.archive.org/web/20131021001032/http:/en.wikipedia.org/wiki/Chicago_(typeface)) of Mac OS fame. Too computer-ish and perhaps scifi-ish.\n\n"
    },
    {
      "time": "26 Jun 2009 — 11:39am",
      "content": "thanks for all comments except the first. that i dont understand\n\n"
    },
    {
      "time": "26 Jun 2009 — 4:17pm",
      "content": "Hello manisalao, tell us what you have tried to achieve, and how you came to your conclusion!\n\n"
    },
    {
      "time": "27 Jun 2009 — 3:09pm",
      "content": "at first the idea with the Isotype was represent the colonization of Spain in LatinAmerica. the colors represent the variety of races and cultures. the \"logotype\" i dont know how to explain but i was inspired by the graphics of many Folkloric Bands in Chile like \"Quilapayun\" and \"inti Illimani\".\n\n[http://www.quilapayun.com/index2.html](http://web.archive.org/web/20131021001032/http:/www.quilapayun.com/index2.html \"http://www.quilapayun.com/index2.html\")\n\n"
    },
    {
      "time": "29 Jun 2009 — 11:24am",
      "content": "I think I understand where you are coming from with the reference but I'm not sure how much of it comes through in what you have posted! I agree with the others that the aesthetic seems more like Chicago.\n\nYou may have seen this [post](http://web.archive.org/web/20131021001032/http:/typophile.com/node/59082) which might point you in the direction of some more influences, Lance Wyman perhaps.\n\n"
    }
  ]
}
