{
  "id": "59400",
  "title": "For shame, Google",
  "forum": "dan\\_reynolds's blog",
  "tags": [

  ],
  "content": "This strikes me as typical of the whole \"culture should be free\" argument…\n\n[http://www.nytimes.com/2009/06/15/business/media/15illo.html](http://web.archive.org/web/20140913094955/http:/www.nytimes.com/2009/06/15/business/media/15illo.html \"http://www.nytimes.com/2009/06/15/business/media/15illo.html\")\n\nThe comparison between Google and traditional companies like Nickelodeon and Target (about halfway down the article) is good, I think.\n\nI have the feeling that, in the past, it used to be commonplace for large corporation to patronize the arts. By patronize, I mean pay artist, of course. Or, if not for big corporations, at least big, rich industrialists. But Google has more cash than all of these past institutions put together. They don't want to patronize the arts, but rather speak patronizingly to artists…\n\n",
  "author": "dan_reynolds",
  "time": "26 Jun 2009 — 4:00am",
  "uid": "1085",
  "comments": [
    {
      "time": "26 Jun 2009 — 8:05am",
      "content": "Goodness sake- Jeff Koons, Bob Dylan and Gucci are different breed. They have made tons while as many illustrators are still struggling to get the next jobs!\n\nI can identify with that because I used to do illustrations. In my country clients prefer stock photos than illustrations.\n\nIt's kind of similar with DRM. The big boys like Apple and Microsoft are applying DRM when they are already making billions. The font designers are the one who actually need DRM. People wrongly associate font design business (since it is kind of IT related) with these huge IT companies and they think that font designers are also making millions.\n\nWhen they protest against DRM, fonts designers become victims.\n\n"
    },
    {
      "time": "26 Jun 2009 — 8:37am",
      "content": "\"Mr. Taxali wrote, followed by his own drawing of a hand gesture popular with impatient motorists.\"\n\nArt Patron in this day and age is more Art Patronizor. Even the Medici paid.\n\nChrisL\n\n"
    },
    {
      "time": "26 Jun 2009 — 9:27am",
      "content": "Google is in America. We Americans hate the arts.\n\nThat and I can be somewhat forgiving as Chrome is open source.\n\n"
    },
    {
      "time": "26 Jun 2009 — 10:38am",
      "content": "Yes, but America is the home of free enterprise--I guess Free means you don't get paid for your enterprise if it is art or craft related?\n\nChrisL\n\n"
    },
    {
      "time": "26 Jun 2009 — 11:23am",
      "content": "\\> That and I can be somewhat forgiving as Chrome is open source.\n\nWell, I can't be so forgiving. They are one of the richest companies in the world, but it is OK for them to act like corporate a$$holes, because they make OpenSource products. It is a double standard.\n\n"
    },
    {
      "time": "26 Jun 2009 — 12:25pm",
      "content": "\"it is OK for them to act like corporate a$$holes\"\n\nThey were asking if people wanted to contribute visual designs to an open source software project.\n\nThe article didn't mention that and somewhat lessons the comparisons they were using to Nickelodeon and Target.\n\nBut yea, it would have been nice (and smart, IMHO) to have actually commissioned artists.\n\n"
    },
    {
      "time": "26 Jun 2009 — 12:41pm",
      "content": "\\> contribute visual designs to an open source software project\n\nWhich is totally OK, right? I mean it isn't like we should expect Google to make googles of more millions from this project?\n\nGoogle is saying, \"dear artists, you should work for free, so that our new cash cow can look even cooler on the market, and bring us even more eyeballs that we already get. We value the work we do, which is why we charge advertising fees to our clients, and why we pay our employees. But let's be honest, what you do isn't valuable, so just give us your stuff for free. I mean, it is open source, so you should be honored to be able to be so open about your work schedule and help us make more revenue!\"\n\n"
    },
    {
      "time": "7 Jul 2009 — 12:05pm",
      "content": "got it in one Dan - there's a whole industry built around ripping off creatives, using crowd sourcing etc. Just one of many examples: in the UK, a digital 'youf' TV channel invites viewers to send in 'e-stings' to put in front of shows; no money, just the chance to get your work on telly. Ho hum\n\n"
    },
    {
      "time": "7 Jul 2009 — 12:08pm",
      "content": "Starving artists are thereby invited to keep on starving while the media moguls keeping getting fatter.\n\nChrisL\n\n"
    },
    {
      "time": "13 Jul 2009 — 5:54am",
      "content": "There is this concept out there: music, fonts, art = information. Information = free. I don't want to mention any names because the person struck me as genuine (those of you who read every post will know what I mean). Since when is art of any sort a given, free for all commodity?\n\n"
    },
    {
      "time": "13 Jul 2009 — 9:45am",
      "content": "\"There is this concept out there: music, fonts, art = information. Information = free.\"\n\nTrue, though I wouldn't call it overly subscribed to concept and there's a bit of a jump there.\n\nShould Google have commissioned artists instead of asking for free work? Yes.\n\nWas the comparison to Nickelodeon and Target accurate? Not entirely.\n\nIs there room to support open source projects with pro-bono contributions? Sure.\n\nDo creatives still do a crap load of spec work for free? Yes.\n\n"
    }
  ]
}
