{
  "id": "5941",
  "title": "Illustartor -\\> Fontlab 4.5",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm new to Fontlab.   \nI'm curious about you're way to bring you're Illustrator design characters to Fontlab 4.5.   \n   \nThe only way I found is blowing the characters(corresponding to 12pt) at around 4000%.   \nPreviously, in FOG, I only have to cut/paste(yeah with alt down, of course!) with a maximum scale rectangle.   \n   \nAnd you?\n\n",
  "author": "salmonboy",
  "time": "9 January, 2003 - 12:42pm",
  "uid": "1278",
  "comments": [
    {
      "time": " 9 January, 2003 - 1:33pm",
      "content": "Nicolas -   \nYou might be out of luck on this one (for the time being anyway). Other mac users have related the same experience. Also of note: If you select a character to scale and hold shift to confine the proportions it doesn't confine them perfectly. Very very frustrating.\n\n"
    },
    {
      "time": " 11 January, 2003 - 9:39am",
      "content": "Normaly I use the Sketchmode to draw the Font into FontLab directly. I really like the use of the Sketchmode. Befor this I importet the chars from a EPS File.   \n   \nGreets Jens\n\n"
    },
    {
      "time": " 24 June, 2003 - 1:58pm",
      "content": "Another tip for pasting into FL4 from AI:   \nIn Illustrator, move the origin point to the place where you want the basepoint to be in FL. Then, when you paste in, it will be aligned to the basepoint properly.   \n   \nThis saves the time and effort of moving the characters into place. Also, since they are in place, you can then Transform them all at once, scaling them relative to the basepoint.   \n   \n(I also miss the way it worked in FOG, where I just used a vertical line to define the height.)\n\n"
    },
    {
      "time": " 26 June, 2003 - 9:30am",
      "content": "FontLab is a bit literal-minded when pasting in art from Illustrator.   \n   \nFontLab interprets points in Illustrator as em units. More importantly, it rounds off all measurements to the nearest point. Since coordinates in Illustrator can be specified with an accuracy of up to 1/1000th of a point, you will lose a certain amount of accuracy in the transition. This is okay and necessary since coordinates in fonts _must_ be whole numbers. But, if you create your art in Illustrator at an em square (in points) smaller than your em square (in em units) in FontLab, and you scale it up in FontLab, you will lose accuracy. The more scaling, the worse it gets.   \n   \n(If you uncheck \"Do not scale EPS files...\" in FontLab's preferences, it scales the artwork to 175% when pasting from Illustrator. This lets you, what, create your artwork at 57.142% in Illustrator? I don't get it.)   \n   \nConsequently, if you are using a 1000 unit em square in FontLab, you should scale your characters to fit a 1000 point em square in Illustrator _before_ moving them to FontLab.   \n   \nFontographer does this automatically when pasting from Illustrator, and it uses fractional em units internally (up to 1/1000th of an em) so, even if you scale artwork up after importing, there will be no noticeable loss in accuracy. Coordinates are rounded off in the generated font, however.   \n   \nThere is a certain logic and sensibleness to FontLab's strict adherence to whole coordinates, but it has definite drawbacks from a design perspective. For instance, if you scale a character up or down, and later try to restore it to its original size, it will not match the original due to distortions introduced by coordinate rounding in the intermediate stages. (The same thing happens in Fontographer, but the distortions are a thousand times less significant since it bases its calculations on 1/1000 of an em unit.)   \n   \nAs Jens suggests, it is probably better to learn to draw directly in FontLab, and, in fact, it's ill-suited to the Illustrator/Fontographer workflow many of us have been using for years. But for those of us \"spoiled\" by the ease and flexibility of working this way, it feels like a lot of extra and unnecessary work.\n\n"
    }
  ]
}
