{
  "id": "59429",
  "title": "Please help! My fonts have been turned into XML files!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello everybody —\n\nI went to my computer today to do some work and found that a substantial chunk of my typeface library — approximately 1,800 fonts — had been turned into .xml files and hidden in the “Jaws” folder of Quark XPress. I have no idea how or when or why this happened, and I have no idea how to fix it. Any and all advice is greatly appreciated.\n\n—Jim K.\n\nPS: Or possibly they had been deleted and the .xml files are left over from something else?? I really have no clue here. :(\n\n",
  "author": "<a href=\"/web/20090628115614/http://typophile.com/user/8114\" title=\"View user profile.\">jazzsammich</a>",
  "time": "<br>",
  "uid": "8114",
  "comments": [
    {
      "time": " 26.Jun.2009 5.58pm",
      "content": "System? Hardware? OS? hard to diagnose without the platform at least.\n\nDo you use a font manager (I assume you do, with that many fonts)? Do you have a recent backup?\n\nSounds like your file directory(ies) may be screwed up — bigger problem than just your fonts. Try disk utility(s) and see if that works, or at least finds a problem.\n\n"
    },
    {
      "time": " 26.Jun.2009 6.00pm",
      "content": "Not a lot of info to run off of (no system specs) - but can you think of anything that has recently changed on your computer system? Any new applications installed? Any recent updates? Font files don’t turn into XML without a reason. Can you open the XML files with a text-editor? Don’t save them after opening them but take a look and see if you can see anything of interest. Isn’t Jaws the not-officially-licensed-post-script-renderer? Maybe Jaws is converting the fonts - you might check your settings in Quark for that. Also use a web search to see if anybody else has run into something similar.\n\nAt any rate, good luck and I hope you can figure out what’s happening and how to recover from it.\n\n"
    },
    {
      "time": " 26.Jun.2009 6.43pm",
      "content": "I’m running Mac OS X v. 10.4.1. Disk Utility doesn’t spot any problems. Opening one of the xml files shows something like the following:\n\n/Gentium (%psfont%Gentium) (r) file \\<\\< /ResourceType /sfnt  \n \\>\\> /ResourceDecode filter  \n definesfntfontset 0 get definefont pop\n\n...which says to me that this wasn’t a conversion but that it was left over from some other processes, and the fonts have been deleted somehow.\n\n:(\n\nThanks for your help anyway,\n\n—Jim\n\n"
    }
  ]
}
