{
  "id": "59456",
  "title": "Non-appearing descenders",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi everybody,  \nI have a major problem with my (already quite short) descenders: they don't appear on screen! It seems to be a hinting problem, but I tried the auto-hinting in fontlab and a manual basic hinting (even worst), the alignement zones are set, and still I have nothing under the baseline (the commas do strange things as well... oh wait, the g is ok)  \nAnother typeface I am working on works fine on screen, without hinting and with completely screwed up zones, and I couldn't find any difference in the font infos.\n\nDoes someone have a idea?\n\n",
  "author": "Émilie Rigaud",
  "time": "28 Jun 2009 — 6:36am",
  "uid": "44262",
  "comments": [
    {
      "time": "28 Jun 2009 — 9:59am",
      "content": "PostScript or TrueType? Is the problem size-specific? What ppem sizes are affected?\n\nFeel free to send me a VFB to check: tiro[at]tiro[dot]com\n\n"
    },
    {
      "time": "28 Jun 2009 — 2:03pm",
      "content": "Thanks for answering!  \nIt is a TrueType and the problem is not size specific, I have to zoom in a lot to see the descenders appearing. The only solution I found is to copy-paste the whole font in a new empty file and re-import the classes & co, there must be a strange hidden value somewhere...\n\n"
    },
    {
      "time": "28 Jun 2009 — 3:47pm",
      "content": "Vertical metrics?\n\n"
    },
    {
      "time": "28 Jun 2009 — 4:13pm",
      "content": "Sounds like the descender values are not right...I'm no expert but check the values in the font info box.\n\n"
    },
    {
      "time": "28 Jun 2009 — 7:47pm",
      "content": "If the g is displaying correctly, that implies something other than vertical metrics. Puzzling, to say the least.\n\n"
    },
    {
      "time": "28 Jun 2009 — 7:59pm",
      "content": "I would check the alignment zones. I ran into a font once that had really strange values for these that displayed similar peculiarities, and that was the cause.\n\n"
    }
  ]
}
