{
  "id": "59454",
  "title": "Why is the closed/partially closed space called the 'counter'?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Why is the closed/partially closed space of a letterform called the ’counter’?\n\n",
  "author": "<a href=\"/web/20090703174101/http://typophile.com/user/42880\" title=\"View user profile.\">nick.moreno</a>",
  "time": "<br>",
  "uid": "42880",
  "comments": [
    {
      "time": " 27.Jun.2009 9.17pm",
      "content": "With metal type (working backwards), the type sort was made by pouring molten metal into a mold affixed to a matrix, which was the piece that had a hollowed out letter shape, let’s say a D.  \nThat matrix with the hollowed out D was made by the craftsperson carving a D onto the end of a long piece of metal called the punch, and then striking that hardened metal punch into the softer metal. So the carving that the cutter does is a positive version of the D. (punch is positive, matrix is negative, type is positive again).  \nNow imagine trying to cut a tiny D onto the end of a metal piece. With some skill it wouldn’t be so difficult to carve the letter in from the sides, but how do you create a hold in the middle?  \nThe solution is to create another punch for the punch - a “counterpunch.” That would be a long piece of metal carved with the shape of the hole in the D. It is then hardened and struck into the punch to create the negative shape, and then the rest of the carving from the outside can proceed.  \nThe holes and closed spaces are called counters because in metal type they were achieved by the punchcutter with a counterpunch.  \nIf I’m remembering right, I learned this all from [Fred Smeijers’ _Counterpunch_](http://web.archive.org/web/20090703174101/http:/www.hyphenpress.co.uk/books/978-0-907259-06-0).\n\n"
    },
    {
      "time": " 28.Jun.2009 4.26am",
      "content": "Interesting, thanks Craig!\n\n"
    },
    {
      "time": " 28.Jun.2009 5.18am",
      "content": "And (to take it even further) if you have a letter with a printed part between counters (say, an H), you might even make a counter-counterpunch. Carve an H crossbar on the counter-counterpunch, strike it into the counterpunch, carve the outside contours of the H counters on the counterpunch, strike it into the punch, carve the outside contours of the H, strike it into the matrix...\n\n"
    },
    {
      "time": " 29.Jun.2009 9.50am",
      "content": "Huh. I always assumed it was short for “counter form” or “counter shape”, which refers to the negative space in or around any form, whether it’s a letter or a shape. I further assumed that the word “counterpunch” was derived from that word.\n\nI claim no authority on the topic, of course. I bet my art background influenced my thinking when considering etymologies in type.\n\n"
    },
    {
      "time": " 29.Jun.2009 10.16am",
      "content": "In my understanding the “counter” refers not to the opposition of positive and negative space on the two dimensional plane of the printed letter, but rather the opposition of direction that the counterpunch pushes the metal in depth in the process of making type.\n\n"
    }
  ]
}
