{
  "id": "59467",
  "title": "take a crappy job in the meantime?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "ok, so I graduated last month, send some mailers, got my website published on blogs, got some good feedback.\n\nBUT, I haven’t had many interviews at all. No offers for jobs.\n\nI’m being supported by my parents for the meantime, but that won’t last very long. I freelannced for free.\n\nGiven that I think most of you have been in similar situations or at least gone through the post design school ordeal, can you offer advice? I’m not discouraged, but it would be great to have a paycheck thats better than retail.\n\nmy school has a job board with a bunch of jobs I don’t want?\n\nShould I hold out and look more, inquire about places I’m not interested in?\n\n",
  "author": "<a href=\"/web/20090703113036/http://www.typophile.com/user/17767\" title=\"View user profile.\">fredcastle</a>",
  "time": "<br>",
  "uid": "17767",
  "comments": [
    {
      "time": " 28.Jun.2009 8.24pm",
      "content": "Do whatever you can for now and just keep refining your portfolio and looking for freelance work. Holding out for your dream job is just going to leave you with a big gap on your resume.\n\n"
    },
    {
      "time": " 28.Jun.2009 8.57pm",
      "content": "_my school has a job board with a bunch of jobs I don’t want_\n\nWell, I hope you’re searching on other job boards, too. Have you gone to any temp agencies? They might get you some freelance gigs. Meanwhile, James’s advice is good.\n\nAlso, have you followed up on the people that gave you feedback for those mailers? How about the ones that didn’t respond? Maybe you should call them, too.\n\nYou could also expand the list of studios and designers you’d like to work for, and send the new ones your mailer.\n\nYou could also request a few [informational interviews](http://web.archive.org/web/20090703113036/http:/jobsearch.about.com/cs/infointerviews/a/infointerview.htm).\n\n"
    },
    {
      "time": " 28.Jun.2009 9.17pm",
      "content": "I have looked at other boards, but it seems that most of the listings aren’t for junior designers.\n\nIs there a list somewhere on this forum that might give me more bards that I might have missed?\n\n"
    },
    {
      "time": " 28.Jun.2009 9.18pm",
      "content": "So far, I had three people say they liked my work and they’d pass it around to people they knew, but I haven’t heard anything from that.\n\nSome of the places I’ve mailed are really small studios, that I really wouldn’t expect to have “jobs,” but you never know. I know calling can’t hurt, but if you send your resume, a booklet and a business card, and they don’t respond, do you think calling would do any good?\n\nI haven’t cold called anyone yet either.\n\n"
    },
    {
      "time": " 28.Jun.2009 9.49pm",
      "content": "<cite>Is there a list somewhere on this forum that might give me more bards that I might have missed?</cite>\n\nEven if you watch them all there really just aren’t many junior jobs right now, especially if you don’t have advanced web skills. Clients aren’t paying as much, mid-level people are working for lower salaries, and because there are so many unemployed young designers many studios are using unpaid interns instead of junior designers/production staff. This isn’t just confined to the design industry, it’s a trend that hits most industries during recessions and until things get better there’s not much you can do.\n\n<cite>I know calling can’t hurt, but if you send your resume, a booklet and a business card, and they don’t respond, do you think calling would do any good?</cite>\n\nIt probably won’t hurt, but don’t expect it to get you a job, and don’t try to badger or pester your way into an interview. It’s one thing to bug people for an interview doing good times, but right now some of those studios are probably having trouble staying solvent and don’t need the distraction. Also, don’t ever expect any kind of response from designers when you send a resume or apply for a job. Designers have a rather _different_ sense business etiquette and don’t respond to applicants in the ways that other businesses do.\n\n"
    },
    {
      "time": " 28.Jun.2009 10.13pm",
      "content": "Just get started.\n\nLive for the process.\n\npbc\n\n"
    },
    {
      "time": " 28.Jun.2009 10.30pm",
      "content": "Getting a first job has always been difficult for a designer, but in these days it’s even harder, as James stated. Be patient, but not so much: no matter what, you need to include some real stuff in your portfolio. Just don’t forget it is a temporary thing and you are doing it just to prove to other people that you can do this job. Then you can look for a better place.\n\nGood luck!\n\n"
    },
    {
      "time": " 29.Jun.2009 8.04am",
      "content": "thanks for the tips!\n\n"
    },
    {
      "time": " 29.Jun.2009 10.14am",
      "content": "if there’s a list of job boards out there, shout.\n\n"
    },
    {
      "time": " 29.Jun.2009 11.57am",
      "content": "I’ve hit that point for the first time in my life. I’ll likely be taking the first offer that comes along (alas, we need insurance more than anything).\n\nOf course, I’m also at the point in my career where I’m thinking this isn’t a career I particularity enjoy anymore, but that’s a different issue... ;)\n\nAnyways, to answer your question:\n\n- if you need money, in this market, yea, take what you can get\n\n- if you don’t need the money, then be at least a little picky. Try to find a gig that will either improve your technical skills or your portfolio.\n\n"
    },
    {
      "time": " 29.Jun.2009 11.58am",
      "content": "Trolling Craigslist under “Creative” and “Creative Gigs” might work, but I’ve found it to be a complete waste of time. Lots of garbage, lots of requests for ludicrously cheap or free work. Insulting, often. However, I may be skipping over a lot of jobs that you may be interested in as a Junior designer, just to get connected.\n\nOn that note, I will say that networking via AIGA events can be fruitful. Hand out business cards, make a good impression, follow up with an email. Tap into your old teachers. Friends of friends always seems to end up as the best resource for me.\n\nPlacement agencies: Creative Circle, Aquent, etc.  \nDepends on what city you live in. There will also be smaller talent agencies.\n\nJob lists: Craigslist, Coroflot, AIGA Design Jobs  \nThese are being applied to by the hundreds, no doubt. But worth keeping an eye on as you can network and apply specifically for junior positions.\n\nIt’s rough out there. Good luck!\n\n"
    },
    {
      "time": " 29.Jun.2009 12.28pm",
      "content": "Thanks again. I’m in NYC by the way.\n\n"
    },
    {
      "time": " 29.Jun.2009 12.49pm",
      "content": "NY placement agencies (in no particular order):\n\n[CNS](http://web.archive.org/web/20090703113036/http:/www.cnsny.com/)\n\n[Roz Goldfarb Associates](http://web.archive.org/web/20090703113036/http:/www.rgarecruiting.com/rga/)\n\n[Update Graphics](http://web.archive.org/web/20090703113036/http:/www.updategraphics.com/home.asp)\n\n[CTI Graphics](http://web.archive.org/web/20090703113036/http:/www.cti-group.com/graphics.htm)\n\n[Creative Circle](http://web.archive.org/web/20090703113036/http:/www.creativecircle.com/)\n\n...Just a few that I am able to remember off the top of my head.\n\nJob Boards: Creative Hotlist, Mediabistro.\n\nPut your résumé on Monster, and create a portfolio on Coroflot. Doing so won’t cost you any money! (Mediabistro and Creative Hotlist charge you for putting up a portfolio on their sites.)\n\nIt’s been said before, but looking for a job is a full-time job. Be proactive about it. These are tough times, so you might have to be less picky, as aluminum says. The important thing is to get some real-world work in your portfolio, and a list of clients or employers on your résumé. Best of luck!\n\n"
    },
    {
      "time": " 29.Jun.2009 2.07pm",
      "content": "From my personal experience. Do whatever job to keep you alive and stay survive. In the meantime, keep learning the new skill, dreamwaver, flash, flex, as3 ... etc ... build up your portfolio with better work, make yourself marketable.\n\nI know this is very depressing. At one point, I was thinking about change major to nursing, much better pay, and I could get a job right away after grad, in 2 years. But I thought, what the hell, I’ll work at a restaurant to keep me survive and keep doing what I love to do.\n\nhehehhehe. stay positive and creative ;)\n\n"
    },
    {
      "time": " 30.Jun.2009 5.31am",
      "content": "Some experience is never going to be bad experience. I remember that feeling of expecting the world coming out of college but it’s not realistic. Just try to get a design job, it doesn’t have to be your dream job right now.\n\n"
    },
    {
      "time": " 30.Jun.2009 12.53pm",
      "content": "“It was only a summer job” is one of the saddest things I hear from the greybeards around here (myself included). Somehow, some stuff happened and they’re still around twenty years later requesting Boys of Summer on the oldies station. If you do take an interim job, don’t give any hostages to fortune — marriage, children, real estate — or you might not be able to move on when you want to.\n\n"
    },
    {
      "time": " 30.Jun.2009 12.56pm",
      "content": "I think it was Wynton Marsalis whose father told him that if he wanted to make it in jazz, be sure had had nothing to fall back on, or he would fall back.\n\n"
    },
    {
      "time": " 30.Jun.2009 3.48pm",
      "content": "Fred,  \nMy advice to you is try something really different from what you’re trying. When I was in your shoes not so many years ago that meant emptying most of the contents of my portfolio, introducing several pieces of self-initiated work and spending an evening writing a cover letter that represented me. (e.g. Instead of saying I was fun to work with and smart, I said something funny, and smart.) Essentially all the initial interest I got from both places I’ve since worked was due to carefully-written cover letters.  \nBut you asked if you should take a crappy job in the meantime. Sure; but take a crappy design job and learn something there.\n\n"
    },
    {
      "time": " 30.Jun.2009 5.30pm",
      "content": "There are definitely things you can learn from a not-so-perfect job:  \n- Communicating with bosses and clients  \n- Presenting your ideas to an audience of non-designers  \n- Compromising (or NOT compromising, gracefully)  \n- Dealing with real-world deadlines and time management  \n- How a business runs, and how design relates to that business model (ideas you can steal when you run your own business or freelance practice)\n\nI learned the above at my first few “crappy” jobs; I did NOT learn these skills at school, despite everyone’s best intentions!  \nGood luck.\n\n"
    },
    {
      "time": " 30.Jun.2009 7.23pm",
      "content": "old jazz joke:\n\nWhat the difference between a jazz musician and a pizza?  \nA pizza can feed a family of four.\n\nBad. I know.\n\npbc\n\n"
    },
    {
      "time": " 1.Jul.2009 11.56am",
      "content": "Since it sounds like you don’t have the luxury of waiting out a perfect job, take the “crappy” one. There have been many good suggestions as to what to try to gain from the experience, also you never know what connections you may make there. The economy is tough and the competition is fierce right now. I’ve been looking for full-time work since my division closed around the holidays and I have gotten very little response to my resume and when I have gotten to the next step, I’ve been told that they received anywhere between 500-800 submissions. There just isn’t much out there and having the opportunity to choose between jobs is really rare. One person on Craig’s list is even offering $700 to whoever can help him/her land a graphic design job. I’m in the tri-state area, if I hear of anything entry level I’ll pass it along. Best of luck to you.\n\n"
    },
    {
      "time": " 1.Jul.2009 12.23pm",
      "content": "I recently got my first professional gig after graduation—well, 13 months after graduation. Now my first paychecks are going to the parents, since I didn’t get any sort of job over that whole time. I just painted the house and did lawn work—it was pretty much an allowance.\n\nNow i have a job that pays really well, in the 4th hardest hit town/city in America. Go figure. I think you DO need to mail, not email, and know who you’re sending to. You DO need to call at a time you stated in your cover letter. It shows you really are interested, and that you want a job, and aren’t just expecting one to land in your hands.\n\nHowever, for all the people I mailed, interviews I went to (that would have hired if it weren’t for current economic conditions), it was the fact that I was on monster.com that got me a job. GO FIGURE!\n\nAnd though I don’t want to say that such things will pan out, I can say that this particular employer wasn’t posting an open job, just browsing applicants at their leisure—so it may be worth setting yourself up on those things, and maybe that good job will come around.\n\nIn the meantime, take a crappy job so you can have yourself some kind of insurance, or at least money to make life seem worthwhile until that next job!\n\n"
    },
    {
      "time": " 1.Jul.2009 2.58pm",
      "content": "What ever you do, avoid the sign industry like the plague.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090703113036/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 2.Jul.2009 12.29pm",
      "content": "phrostbyte,\n\nI’m in a similar situation as fredcastle; looking for a design job, and willing to take work that is not the most glamorous. I was actually thinking about the sign industry because it seems like most signs these days need a little more typographic attention. Why avoid it like the plague?\n\n-Eric MacLeod\n\n"
    },
    {
      "time": " 2.Jul.2009 12.49pm",
      "content": "<cite>Why avoid it like the plague?</cite>\n\nBad pay, clients who don’t care what you think and just want their name in Arial at the largest size possible and won’t pay for anything else, and you end up spending a lot of time learning proprietary software skills that are useless outside of sign shops. Seriously, just read the job descriptions when sign shops are hiring and you’ll be scared off.\n\n"
    },
    {
      "time": " 2.Jul.2009 2.44pm",
      "content": "I spent my first 8 months after graduation working at Wilson’s Leather in the mall. When I decided I couldn’t take it anymore I spent a week brushing up on Dreamweaver and Fireworks and designing my online portfolio/resume. That website ended up being the difference in whether I got an interview. Just stay passionate about what you do and keep pushing yourself to learn more skills and refine the ones you have in the meantime.\n\n"
    },
    {
      "time": " 2.Jul.2009 3.11pm",
      "content": "Eric,\n\nWhat James says is largely true to a degree. The profit margin isn’t as good as other segments of the industry. The deadlines are shorter because production time isn’t usually properly factored in. And, signs are generally the last thing that a business considers, by which time the money is gone. That said, personally, I think every designer that might design a sign should work in a sign shop, at least for a few months. It would give them a better feel for the media and what is possible.\n\nBut, the biggest problem comes later when you are ready to move on in your career. Every other segment of the design industry looks at sign makers as just above dog catchers or garbage men. It doesn’t matter how good you are or what you have done, as soon as you say signs you are branded as incompetant. It may be different if you work for some of the few high end sign shops that get the national accounts.\n\nMy personal exerience, I have established sign standards for multi-million dollar organizations. I have overseen the designs and fabrication for one project with more pieces of art in three weeks than most design operations do in six months. I’ve gone head to head with people worth millions so that they would get good product even above their objections.\n\nI can’t even get an interview in an entry level position.\n\nI might not be the best person to listen to on the subject because I’m a little bitter...\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090703113036/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": " 2.Jul.2009 3.39pm",
      "content": "Now that I think about it, I’m starting to understand why I never seen signage and wayfinding design jobs advertised.\n\n"
    },
    {
      "time": " 2.Jul.2009 5.50pm",
      "content": "edited\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20090703113036/http:/www.thefontry.com/)\n\n"
    }
  ]
}
