{
  "id": "5949",
  "title": "Pitchfork logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Can you read this clearly or is it too abstract?   \n   \nHow is the concept working?   \n   \nIdea's on the ORK?   \n   \nThis is a fun project. There is no client. Just playing around.   \n   \n   \nAndrew   \n ![](http://web.archive.org/web/20131022062157im_/http:/www.typophile.com/forums/messages/29/42215.gif)\n\n",
  "author": "andrew_baker",
  "time": "6 Aug 2004 — 8:26am",
  "uid": "1864",
  "comments": [
    {
      "time": "6 Aug 2004 — 8:34am",
      "content": "i can read it, but not too clearly. the H could be a double T...   \nand the RK is a little hard to read.   \noverall, i think it looks 'off' because it slants further and further down, till it about falls off my screen. it starts out straight, and then just degrades.\n\n"
    },
    {
      "time": "6 Aug 2004 — 9:05am",
      "content": "I read, \"Pit ttFortz\". My confusion is caused by the following:   \n   \n1 The \"c\" curling up, rather than down makes it seem like a swashy arm to the \"tt\".   \n   \n2 Because of the LC/UC type, the \"H\" reads as \"tt\", or because of its positioning it reads as an UC \"H\" starting another word.   \n   \n3 The \"r-k\" reads as \"rtz\", especially as the positioning relates to the dropping \"tt\" in Pitch.   \n   \nI imagine the rightbound degradation of the letters that Loren referred to can be dealt with if there are any graphics to be associated with the type.   \n   \nPS: Thanks for the assistance on my So Cal Waves logo.\n\n"
    },
    {
      "time": "6 Aug 2004 — 10:07am",
      "content": "Thanks for the input!   \n   \nLoren: Yeah, I guess I'll try aligning the PITCH on one baseline, and the FORK on the other. That H really is in limbo. I'll simplify it too.   \n   \nScott: No problem, I hope I have been helpful to you. Your input is certainly helpful. The RTZ I will have to rework. I'll post again soon.   \n   \nThanks guys.   \n   \nAndrew\n\n"
    },
    {
      "time": "6 Aug 2004 — 12:18pm",
      "content": "Here is a rework based on your suggestions.   \n   \nAndrew ![](http://web.archive.org/web/20131022062157im_/http:/www.typophile.com/forums/messages/29/42245.gif)\n\n"
    },
    {
      "time": "6 Aug 2004 — 1:36pm",
      "content": "It looks a little like PitchFerk, and Im somewhat distracted by the Capital H . I love the k though.\n\n"
    },
    {
      "time": "6 Aug 2004 — 1:56pm",
      "content": "Yer right Hugh. I'm in between stages of development. I'll post a rework later.   \n   \nAndrew\n\n"
    },
    {
      "time": "6 Aug 2004 — 1:57pm",
      "content": "delete\n\n"
    }
  ]
}
