{
  "id": "5950",
  "title": "Kerning Help",
  "forum": "Design",
  "tags": [

  ],
  "content": "Howdy All,   \n   \nI am admitedly still learning the ins and outs of design principles and despite all the books I have bought and studied, kerning still escapes me. If any of you could help me with the kerning on this logo for my toughest client (myself), I would be in dept to you.   \n   \n-Jeff   \n   \n   \n   \n   \n   \n ![The Culprit](http://web.archive.org/web/20050518052508im_/http:/www.typophile.com/forums/messages/4100/42219.jpg)\n\n",
  "author": "lomaximus",
  "time": "Fri, 2004-08-06 10:14",
  "uid": "3602",
  "comments": [
    {
      "time": " Sun, 2004-08-08 01:35",
      "content": "Howdy Mr. Jefferson Lomax.   \n   \nDefinitions and samples of kerning are written in many books,   \nbut since the physical square of the letter is disappeared,   \nyou have to be able to read the white and imagine it.   \nKerning is about painting somehow.   \nA link for you: [http://www.owlsoup.com/foamtrain/glossary/](http://web.archive.org/web/20050518052508/http:/www.owlsoup.com/foamtrain/glossary/)   \nI played with your logo. Cool monogram.   \n   \nBest,   \nAS   \n ![](http://web.archive.org/web/20050518052508im_/http:/www.typophile.com/forums/messages/4100/42354.gif)\n\n"
    },
    {
      "time": " Sun, 2004-08-08 04:57",
      "content": "Just one of my pet pieves, could you put the dot back on the lowercase i? It looks like a mistake. Also try making the mark in the middle smaller, it seems to be overwhelming the type.\n\n"
    },
    {
      "time": " Sun, 2004-08-08 10:25",
      "content": "_Just one of my pet pieves, could you put the dot back on the lowercase i? It looks like a mistake._   \n   \nI thought it was Turkish!\n\n"
    },
    {
      "time": " Mon, 2004-08-09 10:54",
      "content": "Alessandro,   \nThanks for the links and the help. It looks a lot better. You are entered into my \"People I Owe\" folder on my desktop.   \n   \nDaniel,   \nThe original dot on the i seemed to stand out too much and therefore was removed. I have made some adjustments that hopefully will feel more like the other letters and will post them here with the original. Let me know what you think.   \n   \nTop= original i, Bottom= new version   \n   \n ![LDlogo2](http://web.archive.org/web/20050518052508im_/http:/www.typophile.com/forums/messages/4100/42440.jpg)\n\n"
    },
    {
      "time": " Mon, 2004-08-09 11:33",
      "content": "Jefferson,   \n   \nI think the kerning looks better and the words more even.   \n   \nFor what it's worth: I really have to say that the i should keep its original round dot. The combination of letters 'ig' make a nice vertical balance at that part of the word and the modified dot just makes the letter and word look somehow squashed or imparied.   \n   \nThe a in Lomax looks a little small like the bottom of the bowl isn't descending below the baseline as it should and the recessed crown on it make it look like it's timid.   \n   \nJon\n\n"
    },
    {
      "time": " Tue, 2004-08-10 13:59",
      "content": "Howdy John,   \n   \nI have replaced the dot on the \"i\" but haven't changed the \"a\" though. It is the original \"a\" from Friz Quadrata and in Illustrator it bottoms out at the same level as the other round letters used here. I wonder if the shortness your seeing may be due to conversion to raster format. When I am more confident, I'll just design all the lettering instead of \"adjusting\" someone elses design. ...gimme time.   \n   \nOn a sidenote, I am designing my first font that I'll post in the critique section soon. I've listened to this forum for a while now and am impressed by the professional critiques that are given.\n\n"
    }
  ]
}
