{
  "id": "59523",
  "title": "Article on ClearType in Windows 7",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Greg Hitchcock wrote [a rather lengthy piece](http://web.archive.org/web/20140122135618/http:/blogs.msdn.com/e7/archive/2009/06/23/engineering-changes-to-cleartype-in-windows-7.aspx \"Engineering Changes to ClearType in Windows 7\") (so difficult to read onscreen, especially with such lousy CSS) on ClearType in Windows 7. It told me a few new things, like the fact that print-preview screens would tend to use a different method of antialiasing. You’ll be able to turn more things off in Windows 7.\n\nThis is not the thing that interests me. What interests me is the reported results of “an informal and small-scale” survey at a community centre outside the Microsoft compound. Most people preferred ClearType to an identical screen with no antialiasing (“bi-level” in the confusing Microsoft jargon).\n\nNow, isn’t this like handing people two hardcover books, one typeset in Times (“New Roman”) and the other in Cooper Black, and asking them which one they prefer? I recall another experiment that made similar clearly nonsensical comparisons. Isn’t a more honest comparison between ClearType and what Microsoft calls “font smoothing/greyscale”?\n\nAdditionally, the piece admits that a substantial minority of people want ClearType turned off at all times. You can do that more easily in Win7. But Microsoft here blows another chance to pursue the likely link between colour deficiency (“colour blindness”) and hating ClearType. MS knows all about it, but they haven’t studied it yet. (Have they? They’ve got two paragraphs quite close together in the blog post that mention ClearType hatred and colour blindness, but 2 plus 2 continues not to equal 4 over in Redmond.)\n\nAs for why I think colour deficiency and anti-ClearType sentiment go hand in hand: MS has told me that it tends to be oldschool computer programmers who hate ClearType. They’ve got a lot of those in-house at Microsoft. Red-green colour deficiency chiefly affects males. Most programmers are male. So there are multiple selection biases at work that seem to suggest Microsoft has a large contingent of colourblind computer-programmer dudes on staff who cannot stand ClearType. There are probably good reasons for that; I suspect they are seeing much more antialiasing because red and green pixels have similar replacement colours. “Much more antialiasing” is another way of saying “too-blurry text.”\n\n",
  "author": "joeclark",
  "time": "30 Jun 2009 — 11:29am",
  "uid": "7076",
  "comments": [
    {
      "time": "30 Jun 2009 — 12:24pm",
      "content": "I'll have to think about this one. I have red-green colour deficiency (deuteranomaly, the most common form), and it has never occurred to me that colour perception could be a factor in how various forms of type antialiasing.\n\nEven now, I cannot see why colour deficiency would be a drawback for appreciating ClearType. Isn't the principle of subpixel rendering supposed to enhance the virtual resolution, while colour fringes are the unwelcome side effects? What does it matter that I would not be able to distinguish between the red and green fringes very well? Wouldn't it conceivably even have the opposite affect of lessening the 'noise' of the colour fringes, thereby enhancing the effectiveness of ClearType?\n\nI admit that I don't have a good understanding of ClearType, so I might be missing something obvious...\n\n"
    },
    {
      "time": "30 Jun 2009 — 3:51pm",
      "content": "I don't have color-blindness. And I haven't seen ClearType on Windows, but my impression of the screen-grabs in the article Joe references is that the ClearType effect distorts letter forms in an uneven manner. This is especially noticeable if one views one's screen just close enough to bring the pixel grid of pure white into focus.  \nMight not the anti-ClearType sentiment discussed be a similar aesthetic judgement?\n\n ![](http://web.archive.org/web/20140122135618im_/http:/typophile.com/files/clear1_4918.png)\n  \nAbove, Verdana, set in InDesign on an iMac.  \nBelow, screen grab of ClearType.  \nNote how ClearType adds a little hook-like \"serif\" to \"e\", and creates excessive white space between \"e\" and \"a\", sacrificing smooth spacing for sharpness.  \nAlso, there appears to be a little bright \"notch\" at the outside top left corner of \"C\".\n\n ![](http://web.archive.org/web/20140122135618im_/http:/typophile.com/files/Calibri_3501.png)\n  \nScreen grab of ClearType.  \nNote how the vertical stem widths vary drastically, an unsettling effect, to which less sharpness but more evenness of stroke width would be preferable.Is this really the way it's supposed to look?  \nIt is an axiom of ClearType that precise spacing of differently rendered vertical stems (by sub-pixel positioning) is better than irregular spacing of similarly rendered stems--but what if this premise is wrong? \n\nAs some letter forms are inherently sharper in pixels than others, so the ideal should be to design letters and rendering technology with that in mind.  \nIn comparison, arguably the most readable of text faces in print, Bembo, has letters designed with varying degrees of sharpness. When reading, there is no mistaking the sharp triangularity of the serifs at the top of its ascenders, but at the same time, the exact form of the terminal at the top left of \"a\" is impossible to determine unless closely examined. It seems to me that the terminal of the Bembo \"a\" is designed to be deliberately vague and unsharp, the better to combine with such different preceding shapes as the ear of \"r\" or the serif of \"y\".\n\nSo, the way that sharpness varies in screen display should reinforce typographic logic, not be arbitrary as is the case with that notch at the corner of \"C\".\n\n"
    },
    {
      "time": "30 Jun 2009 — 5:39pm",
      "content": "Hey Joe, There was a section in the original draft of that post covering new research on people who dislike ClearType, but it (and other sections) got cut to make the post a little shorter. Greg does point to other blog posts that talk about more rigorous, academic studies.\n\nThe section that got cut talks about research that suggests that people who dislike ClearType are more likely to both have _greater than average color sensitivity_ and poorer than average visual acuity. I suspect that ClearType should be a very good experience for colorblind users, though a rigorous study has not been conducted on that topic. ClearType leverages the fact that we are most visually sensitive in the luminance channel, less visually sensitive in the red-green channel, and least sensitive in the yellow-blue channel. ClearType tries to minimize the error in the luminance channel, while accepting more in the other two. With the two most common forms of colorblindness, it’s not possible to detect error in the red-green channel. It is these kinds of color artifacts that people with good color sensitivity can report that colorblind users will have a harder time detecting.\n\nIn the _future research_ section, Greg specifically calls out that we have plans of improving the ClearType rendering for different visual system characteristics including colorblindness. Knowing that a reader is red cone deficient or green cone deficient, we can improve the luminance contrast of the text with undetectable color error.\n\n"
    },
    {
      "time": "1 Jul 2009 — 10:02am",
      "content": "I understand what my esteemed colleague is saying.\n\nBut.\n\nIf we’re talking about preferences and not performance (the sections I was objecting to dealt with preferences), a red subpixel and a green subpixel are going to look beige (let’s say, and probably two shades of beige) to someone with protanopia or deuteranopia (strong or weak).\n\nThe effect is to have two beige subpixels, not a red and a green one. It is my hypothesis that this makes characters look too blurry for this group precisely because the perceptual advantage of one kind of subpixel plus another kind is overwhelmed by a mass of undifferentiable subpixels. I believe this remains exactly the opposite hypothesis from the one you have.\n\nElderly people with tritanopia (the rare yellow–blue or yellow–green colour deficiency) would exhibit this phenomenon the least according to both our hypotheses, assuming yellow–blue had the lowest error.\n\nNow, the interesting thing would be to test real-world performance, because, as we know, people sometimes complain about type they turn out to read quite well.\n\nAs I have explained to my various esteemed colleagues down in Redmond, hire Joel Pokorny to investigate this and you will arrive at definitive answers.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20140122135618/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "1 Jul 2009 — 10:39am",
      "content": "_It is my hypothesis that this makes characters look too blurry_\n\nThat may be true, but how much blurryness is too much?  \nIt's my hypothesis (for several reasons) that sharpness is overrated.  \nSo I would agree with your advice to, \"...test real-world performance, because, as we know, people sometimes complain about type they turn out to read quite well.\"  \nSurely, the best way to do that would be to pit ClearType against Quartz?  \nBut I doubt Kevin is in a position to undertake such research--what if Quartz turned out to trounce ClearType?\n\nActually, I don't think that's likely, because of the \"other things being equal\" factor.  \nAfter reading [this](http://web.archive.org/web/20140122135618/http:/www.macobserver.com/columns/devilsadvocate/2003/20030523.shtml) comparison, I came to the conclusion that like much in typography, results are probably document (and device) specific.  \nThat is to say, it may be possible to determine that ClearType outperforms Quartz in rendering Verdana at a particular size, but for a different typeface at a different size, the result could be reversed.\n\n"
    },
    {
      "time": "1 Jul 2009 — 2:57pm",
      "content": "Joe, you’re worrying about mapping a color blind reader’s perception of color onto a non-colorblind reader’s perception of color. I don’t think a red subpixel and green subpixel are going to look beige or two shades of beige.\n\nMost colorblind people are lacking either the M-cones (green) or the L-cones (red), and instead have twice the number of the other. These two cones are actually very similar to one another - their response pattern is nearly identical, only slightly offset from one another. Both cone types will respond to any light between 450nm and 650nm. Light from roughly 450nm-550nm will have a slightly higher response from the M-cones, and light from 550-650nm will have a slightly higher response from the L cones. If you’re missing one cone type you can still see light across the entire green-yellow-red range, it’s just harder to tell them apart. In the visual channels (a stage after the cone responses) light from both the red and green subpixels will be seen as brightness (white) in the luminance visual channel and yellow in the yellow/blue channel, but there is no red/green channel. This means that the detection of the contrast between the white of the background and the black of the text is fine, and there is less sensitivity to the color artifacts.\n\nIt’s almost a philosophical question about what color a red and green subpixel will appear, but it will be brighter than beige.\n\nI am unfamiliar with Joel Pokorny, but other experts in color vision and in optometry agree with my statements above. And informally, I haven’t heard of any colorblind people complaining about ClearType. The most vehement ClearType haters I’ve met do not have color blindness, and usually have very good color sensitivity.\n\n"
    },
    {
      "time": "1 Jul 2009 — 2:58pm",
      "content": "Nick, there are several apparent knockoffs of ClearType including Apple’s Quartz and Adobe’s CoolType. There is so much research comparing ClearType rendering to black & white rendering because it was a big deal to change the default rendering for millions of Windows users. Everyone wanted to make the right choice. No one is choosing between ClearType and other sub-pixel rendering algorithms, so there is little interest in investigating this.\n\n"
    },
    {
      "time": "1 Jul 2009 — 3:51pm",
      "content": "I realize it's a common misunderstanding, but most people with red-green colour blindness don't see red and green as the same colour.\n\nIt may be impossible to make people with normal colour vision fully understand what I see, but I see red as red and green as green. It's just that they are harder to distinguish. The difference between red and green is just not as marked as that between the difference I perceive between blue and yellow.\n\nImagine you are in a very dark room. You can still tell apart the colours of objects, but plainly not as well as during the day. For me, that's what telling apart red and green is like.\n\nFor small specks of colour, it becomes really difficult to tell apart reddish shades and greenish shades. So on the subpixel level, I see how I would be less bothered by the extraneous colour information than people who are more sensitive to colour differences, although I can't imagine the difference would be huge.\n\nIt may be interesting to see how the amount of colour fringing in type rendering affects user preference. This would of course compare different antialiasing methods with each other. As I understand it, there are trade-offs between colour fringing and resolution, so one may have to devise ways to control for these factors.\n\n"
    },
    {
      "time": "2 Jul 2009 — 4:18am",
      "content": "\\>No one is choosing between ClearType and other sub-pixel rendering algorithms, so there is little interest in investigating this.\n\nAll but one of our clients choosing between CT and Standard (sub-pixel rendering algorithms both!), chose Standard. I suggest there is little interest in investigating this for entirely other reasons than you suggest and have proved that since we started this discussion in 2004.\n\nThe 'minority' of CT haters, (now 17%) has risen from 4% Kevlar marginalized it to in 2004. My experience has found the number to be double what MS says now, or around 35%. Of our users switching from bitmaps, 5% to 10% cannot even look at CT text without becoming physically upset. They say \"Ahhhhhhhhhhhhhhhh, Thank You!\" when they switch to Standard rendering. :)\n\n\\>I suspect that ClearType should be a very good experience for colorblind users\n\nSince CT scaling and rendering was actually designed by a colorblind developer, I would tend to think it is _only_ good for color blind users.\n\n\\>So, the way that sharpness varies in screen display should reinforce typographic logic...\n\nRight Nick, but with the TT instructions being mostly ignored by CT in the critical x dimension, the typographic logic TT instructions contain is being ignored as well. And that is what's at the heart of all user's complaints, whether they know it, or not.\n\nCheers!\n\n"
    },
    {
      "time": "2 Jul 2009 — 11:47am",
      "content": "Hold on, Kevlar. Many colourblind males don’t know they have the condition, particularly for deuteranomaly. Some anonymous deutans can pass the Ishihara test.\n\nThe near-philosophical question at work here is the one applicable to everyone who can see: What _do_ they see? You don’t know and I don’t know. In addition, beige can be bright or dull, but at a certain point just becomes yellow.\n\n“I’ve never heard of Pokorny, but my friends say I’m right”&nbsp;is no substitute for an actual test, would you not agree?\n\nWe seem to have regressed from two competing untested hypotheses to a near-dismissal of the entire issue. The original article suggested MS was willing to work on the problem of smoothed fonts for colour-deficient people. I wouldn’t back away from that.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20140122135618/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "2 Jul 2009 — 11:52am",
      "content": "Jongseong, people with colour deficiency have an area of confusable colours on the standard CIE colourspace. Within this confusion zone, colour-deficient people (especially the rare ones with one good and one colourblind eye) report seeing some colour other than the ones colour-normal people see. These are the so-called substitute colours.\n\nHence, yes, it is of course true that protans and deutans can still see red and can still see green. It’s just that there are many shades of red, green, beige, dull yellow, etc. that may be difficult to distinguish, either in an artificial naming exercise (“What colour is this?”) or just in day-to-day life (your red tie is a bit much with your black shirt).\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20140122135618/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "2 Jul 2009 — 12:03pm",
      "content": "Hi David, I don’t really know what you are saying, so I’ll guess.\n\nI think you’re saying that people prefer font smoothing / grayscale setting, which I believe had the level of “standard” in Windows XP font smoothing dialog. Greg’s article explained that with Windows font smoothing, all of the core Windows fonts would display bi-level / black & white rendering at reading text sizes, and grayscale at smaller and larger sizes. All of the discussed studies compare rendering of reading text sizes, so there is no difference between bi-level and standard font smoothing.\n\nNeither bi-level nor Windows grayscale are sub-pixel rendering algorithms.\n\n"
    },
    {
      "time": "2 Jul 2009 — 12:55pm",
      "content": "\\> The original article suggested MS was willing to work on the problem of smoothed fonts for colour-deficient people\n\nJoe, I am heavily involved in a project where we are trying to develop rendering that is personalized for each person’s sight. Doing this involves modeling how vision works and optimizing for different capabilities. Once we can make text that we think is optimized for colorblind readers, I will certainly be testing this with colorblind readers. Above I’m arguing that 1) the people that strongly dislike ClearType are rarely if ever colorblind, and 2) the way to optimize rendering for colorblind readers is to allow more error in the red/green visual channel in order to reduce the error in the more important luminance channel.\n\n"
    },
    {
      "time": "2 Jul 2009 — 2:19pm",
      "content": "@Kevin: _Nick, there are several apparent knockoffs of ClearType including Apple’s Quartz and Adobe’s CoolType._\n\nI wasn't aware they were ClearType knockoffs.  \nBe that as it may, in the example shown above and again below, I compared type rendered in InDesign on an iMac, blurry and greyscale, with sharp and multicolor Cleartype.\n\n ![](http://web.archive.org/web/20140122135618im_/http:/typophile.com/files/Clear3_6634.png)\n\nYou say that \"there is little interest in investigating this\", but from a scientific point of view, if one wanted to assess the merit of ClearType, why ever would one not test its performance against so obvious a candidate?\n\n"
    },
    {
      "time": "2 Jul 2009 — 2:29pm",
      "content": "Just a simple question here, but doesn't the the degree to which a sub pixel is off or on just amount to an amount of light, regardless of the colour? The colours of sub pixels aren't readily visible to the unaided eye in any case.\n\n-=®=-\n\n"
    },
    {
      "time": "2 Jul 2009 — 2:43pm",
      "content": "That's correct. The general idea is that \\*correct\\* grey scales can only be displayed using three pixel parts (forming one \"whole\" pixel), but if it's known in advance in which order the physical RGB sub-pixels are ordered, one can use that to smooth the outline. The color fringes occur because adding more sub-pixels to the left and right (i.e., those of \"the other 2 colors\") would widen the subpixel, as Nicks image shows.\n\nThe very best explanation, with loads of examples, is on [http://www.grc.com/ctwhat.htm](http://web.archive.org/web/20140122135618/http:/www.grc.com/ctwhat.htm).\n\n"
    },
    {
      "time": "2 Jul 2009 — 3:09pm",
      "content": "The pixel blow-up is not an accurate representation of the screen, I should really take a photo through a loupe.\n\nHowever, to explain a bit, the phantom serif on the \"e\" in ClearType is a result of the Green and Blue sub-pixels at that point being \"turned off\", and the Red sub-pixel on either side being quite bright. So, high contrast between sub-pixels, therefore sharp image. In the greyscale \"e\", the relevant RGB sub-pixels are fairly evenly semi-illuminated, across two pixels, causing a smoother and softer effect.\n\nBut I could be talking nonsense here, as I haven't actually looked at ClearType on a PC, so I'll refrain from further comment until I do!\n\n"
    },
    {
      "time": "2 Jul 2009 — 3:44pm",
      "content": "Yeah, subpixel art!\n\n ![](http://web.archive.org/web/20140122135618im_/http:/typophile.com/files/typo-icon1_3493.png)\n  \nNotice how you see a white dot inside the small circle, but it really isn’t there. Just blue and red…\n\n(btw, it maybe helps that I have a little higher screen PPI)\n\n"
    },
    {
      "time": "2 Jul 2009 — 11:17pm",
      "content": "Nick: for the sake of clarity, note that the 'in InDesign on an iMac' rendering you show in your screenshot is not Apple Quartz; it is Adobe's InDesign rendering, which differs not only from the Apple system rendering but also from Adobe's Photoshop rendering and Adobe's Acrobat rendering (the latter employs CoolType, which is Adobe's subpixel rendering for LCD screens).\n\nThe variety of rendering engines and models in use today is large. And now we're beginning to see greater diversity of screen display models too, after a long period of relative stability around the RGB LCD devices for the past ten-to-fifteen years. I spent some of yesterday looking at a bewildering variety of display models, sizes and resolutions, and the design of these devices is being driven by a variety of factors, such as power consumption and battery life -- i.e. it is not all about attaining higher physical resolution --: diagonal pixels; chevron-shaped pixels; RGBW (white) pixels; organic fluorescent systems; 'eInk' systems; and more.\n\nThe resolution of small device screens -- notably telephones -- is going up considerably. The resolution of computer monitors is not (and having looked into the attrition rates in high-res display manufacture, I'm not as down on the monitor makers as I used to be). Subpixel rendering is primarily a technology for increasing apparent resolution (at least in one direction), and as such I see it mainly as a technology for what we might consider medium-resolution screen. It produces too much fuzz at lower resolutions (say, less than 110ppi) and it becomes steadily less necessary as resolutions increase upwards. There is a resolution at which I think good greyscale antialiasing becomes the best option, a resolution at which you don't need to use subpixel rendering any more because the full pixel is sufficient to render both shapes and positioning well. I'm not sure where that resolution is. 200ppi? 300ppi? It is going to depend on the reader, just as the resolution at which subpixel rendering becomes preferable to b/w rendering varies according to differing colour sensitivity and visual acuity ... and distance from the screen.\n\nThat last factor -- distance from the screen -- is hugely important. To save my back and shoulder I switched to a 30\" monitor a few months ago. The size allows me to sit further back, even when doing detailed work on font outlines. And of course sitting further from the screen increases the perceived resolution. So even though my 30\" monitor has a considerably lower physical resolution than my old 17\" 145ppi laptop screen, my eyes are on average about 10 inches further away than they used to be, so the perceived resolution is increased.\n\nI like ClearType, but then I've been using either medium-resolution screens or achieving medium perceived resolution through distance for some time. That is, I'm operating in the range of resolutions in which increasing apparent resolution in the x-direction through use of subpixels has benefit. I have high visual acuity but only medium colour sensitivity (yes, I went and got tested because I wanted to understand my response to ClearType); that's a good combination for ClearType, because I'm not bothered by the colour artefacts. Periodically, I turn off ClearType in order to remind myself that I prefer it: at the resolutions and distance-from-screen at which I work, the b/w rendering of text is spindly and the letter shapes are crude (which is what I get for having high visual acuity).\n\nNow, this is all highly personal. And that's the point. I should be able to tailor my reading experience to what works best for me, with the full expectation that it might not be what works best for you, either in terms of the hardware in front of you or the hardware in your head.  \n\\_\\_\\_\n\nThe only other thing I'll mention, vis a vis ClearType, is that it isn't a static technology so when making comparisons it can be important to identify the particular version or implementation of ClearType you are looking at or talking about. Shipped versions, that I know of, are the original MS Reader implementation, Windows XP, Windows Vista, and WPF/DWrite. I'm not sure how the Windows 7 implementation might differ from the Vista version.\n\nThe most interesting, I think, is the WPF/DWrite version, which employs ClearType subpixel rendering and colour filtering in the x-direction and (5-level?) greyscale antialiasing in the y-direction.\n\nHere's an image to add to your comparison of Verdana renderings.\n\n ![](http://web.archive.org/web/20140122135618im_/http:/typophile.com/files/verctwpf_4638.gif)\n\nAt this size, you're not seeing the y-direction greyscale that you would at larger sizes, but you are seeing the significant difference between these two versions of ClearType. Interestingly, in light of your comments about sharpness, the WPF version is less sharp (and hence has notably lower stroke density in some letters). Here's a close-up:\n\n ![](http://web.archive.org/web/20140122135618im_/http:/typophile.com/files/verctwpf2_5134.gif)\n\nYou wrote: _It is an axiom of ClearType that precise spacing of differently rendered vertical stems (by sub-pixel positioning) is better than irregular spacing of similarly rendered stems..._\n\nThis is not an axiom of ClearType per se: the majority of shipping ClearType implementations do not use subpixel positioning. The WPF implementation does.\n\n"
    },
    {
      "time": "3 Jul 2009 — 3:40am",
      "content": "@KevinLarson!?  \n\\>...there are several apparent knockoffs of ClearType including Apple’s Quartz and Adobe’s CoolType.\n\nIf you really mean knocked off, your history is completely sdrowkcab.\n\nI am going to assume that you are just parroting something that you heard wrong... you heard that MS got knocked-up? As in, Adobe's 1989 introduction of desktop anti-aliasing impregnated MS with the idea of anti-aliasing, and Apple's 1999 upcoming release of Quartz was MS's wake-up call for a 1998 announcement of what turned out to be ClearType's circa 1999-2007 multiple caesarean?\n\n\\>Hi David, I don’t really know what you are saying, so I’ll guess.\n\nYou don't I'm afraid, generally know what either of us are talking about but I appreciate how hard you try.\n\nJohn said someone else said:  \n\\>You wrote: It is an axiom of ClearType that precise spacing of differently rendered vertical stems (by sub-pixel positioning) is better than irregular spacing of similarly rendered stems...\n\nWho ever decided we have to choose... should be boiled.\n\nCheers!\n\n"
    },
    {
      "time": "3 Jul 2009 — 12:24pm",
      "content": "If I understand the objection to my hypothesis correctly, coloured subpixels are so small that almost nobody, including protans and deutans, perceives the colour.\n\nI could go either way on this. The fringing and blurriness of subpixel rendering is invisible to some people and visible and distracting to others. The question here is: Which of those categories do colourblind people fit into? Then the next question is: Do they have it worse than, the same as, or better than colour-normals? “Having it worse”&nbsp;can be defined in many ways, as by testing performance or asking their preferences.\n\nAlthough I know Microsoft prefers to compare aliased or “bi-level”&nbsp;letters against ClearType so that ClearType always wins (instead of testing other smoothing methods against ClearType), I will not unanxiously await publication of genuine research involving colour-deficient subjects. I think Kevlar is perhaps overaccustomed to having his predictions borne out by the research his company funds, but he should be prepared for a surprise. It could, you know, actually happen.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20140122135618/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "3 Jul 2009 — 9:21pm",
      "content": "Presumably the reason that MS prefers to compare aliased letters to ClearType is that at the sizes in question, for TrueType under GDI, the fonts typically turn off standard anti-aliasing anyway. So the \"smoothed\" (grey-scale anti-aliased) fonts are aliased at those size ranges anyway.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "11 Jul 2009 — 4:39am",
      "content": "Thomas, you must have an amazingly impressive Presumé. ;)\n\nCheers!\n\n"
    },
    {
      "time": "13 Jul 2009 — 12:55pm",
      "content": "Just wanted to point out this [Text Clarity in WPF](http://web.archive.org/web/20140122135618/http:/windowsclient.net/wpf/white-papers/wpftextclarity.aspx) article. (via [Windows Text Blog](http://web.archive.org/web/20140122135618/http:/blogs.msdn.com/text/archive/2008/08/18/wpf-text-clarity-doc.aspx))\n\n"
    },
    {
      "time": "13 Jul 2009 — 12:58pm",
      "content": "Tracking.\n\n"
    },
    {
      "time": "14 Jul 2009 — 9:50am",
      "content": "The 'font comparison' appendix to the article to which Miguel linked is painful. There's way more colour fringing than I ever see in ClearType on my own system.\n\n"
    },
    {
      "time": "15 Jul 2009 — 6:33am",
      "content": "\\>...way more colour fringing than I ever see in ClearType on my own system.\n\nGet bigger dots, Join the multitudes! ;)\n\nAnd Speaking of Dots, I was curious in skimming the article sited for this thread, at the illustrations. The samples marked as '10point' looked odd, and I also got a wisp of odd motive in the showing of 11point for another font.\n\nAs the article says though, the graphics may not look the same size on your screen, and as has been pointed out, this rendering may not look the same as the users' rendering of the same font in their versions of Windows.\n\nI count 13 pixels tall and given one more for clearance we have an em of 14 x 7.2 (number of 10 pt fonts per inch) = 100.8 dpi. So what it could say, to be as informative to the widest audience as it wishes to be authoritative, is that this 10 point is shown at a higher-than-average resolution or, alternatively that it is '12point', to the widest swath of the ClearType audience. The best thing overall for a 96 dpi audience, perhaps.\n\n ![](http://web.archive.org/web/20140122135618im_/http:/typophile.com/files/'scuzecrudegrap_5157.gif)\n  \n_(top is setting sizes on Mac, bottom is sample from article)_\n\n(this of course's piled on top of the fact that a screen font's rounded pixel size is never a whole-numbered point size, unless the resolution per inch is a multiple of 72, which only John has, as far as I know)\n\nIt all could take us to a discussion of 'size' we already had. (and I wish we had meta-Thread mongers in this forum of the quality of the meta-Font-ID mongers we have:-) But the point is, if one is to represent values in points alone, the disturbingly de-educational is not only possible, but likely.\n\nOverarching this minor issue, and as we all should know in general, is that judging individual sizes of type for excellence in screen font performance (and in particular for the one-size-fits-some use of type on the web), is not entirely dissimilar from judging automotive excellence by a car's performance on one kind of road at one speed. And judging ClearType against b&w fonts is like judging a suburban off-road vehicle against a 5th century apple cart, when a Hummer is standing by, looking for a race...\n\nCheers!\n\n ![](http://web.archive.org/web/20140122135618im_/http:/typophile.com/files/'scuzecrudegrap_5157.gif)\n\n"
    },
    {
      "time": "8 Aug 2009 — 7:54pm",
      "content": "Kudos on calling them out on shoddy research. Personally, I find any form of font smoothing to cause severe eye strain and headaches, but Microsoft doesn't seem to want to hear that sort of thing after spending so much on ClearType.\n\n"
    },
    {
      "time": "8 Aug 2009 — 8:07pm",
      "content": "David: _Get bigger dots, Join the multitudes!_\n\nI've got bigger dots now: I traded my 17inch 144 ppi screen for a 30inch 96ppi screen. But I'm sitting further away, so the dots are perceptually about the same size as they used to be. :)\n\nStill, the screenshots Miguel linked to have massively more colour-fringing than any ClearType rendering I've seen at any resolution.\n\n"
    },
    {
      "time": "9 Aug 2009 — 4:02am",
      "content": "\\> I find any form of font smoothing to cause severe eye strain and headaches....\n\nYou'll !ove Trixie!\n\n\\>But I’m sitting further away,..\n\nYou'll !ove a floor mat!\n\nCheers!\n\n"
    }
  ]
}
