{
  "id": "59570",
  "title": "Bilingue book",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone!  \nI'm starting a book for a commemoration of 100 years of a company. The book will have lots of images and a text in Portuguese and English.  \nI want to learn with the typophiles here what would be the best combination for \"the separation\" of text (Portuguese vs English).  \n1- Color of typeface?  \n2- Real color of typeface? I mean black vs gray?  \n3- Roman vs Italic? (the text will be set in minion)  \n4- None? Expect that the Portuguese identifies language and the English his...  \n5- Serif vs Sans?  \nAny good examples that someone care to share I would love to see them...\n\nThanks in advance for all comments.  \nAnt처nio\n\n",
  "author": "<a href=\"/web/20100213085546/http://typophile.com/user/22399\" title=\"View user profile.\">afonseca1974</a>",
  "time": "<br>",
  "uid": "22399",
  "comments": [
    {
      "time": "",
      "content": "If you can, try to find any of the number of books on grids or type that are written in English & German (and often French or another language) to see how they do it. Some examples that come to mind are Typographie or anything by M체ller-Brockmann. You might try poking around [You Work For Them's](http://web.archive.org/web/20100213085546/http:/www.youworkforthem.com/list.php?cat=40 \"You Work For Them\") book collection (with internal screen shots) if you can't get access to the books yourself.\n\nAs far as I have seen, simply being in different languages and a bit of spacing tends to be enough separation to differentiate different portions, but it depends on the project and particular style you are aiming for.\n\nPersonally, I would make both the English and Portuguese versions as clear and legible as possible in their own right, but separate from one another and de-marked in some way. How that actually applies really depends on the project itself.\n\n"
    },
    {
      "time": "",
      "content": "I am not in the business but it is my feeling that part of the choice may depend on practical constraints: for instance, we have bilingual French-English publications in canadian planes and trains that are set in a two column format, one column for French (usually a sans), the other for English (usually a serif). See for instance the [VIA destinations Magazine](http://web.archive.org/web/20100213085546/http:/www.viarail.ca/en/useful-info/onboard-train/via-destinations-magazine/june-2009-july-2009/). If you pay attention, you realize that the French side has more characters than the English side: on page 59 (for which the characters are embedded) I get as much as 14% more characters on the French side (including blanks); French just requires more characters. Choosing the same font on both sides would have caused problems. My guess is that choosing a serif and a sans somewhat hides the fact that the French side is more cramped than the English side. If someone knows of another reason, I'd like to be told.\n\nMichel\n\n"
    },
    {
      "time": "",
      "content": "I agree that the application depends on the project itself as well as practical constraints. Like Michel said, French for example is usually longer than English, so the text arrangement needs to work around this and make it work for the layout without either language looking out of place or more important. If one of your texts is noteably longer than the other, rather than forcing each to fit in the same amount of space, you might try putting them one after the other, for instance, and differentiating by a slight colour change (grey/black for instance).\n\nOn the other hand, I also like the idea of not separating at all; I wrote a English-French book and both languages are on the same page with the English simply running into the French, intriguing the reader as suddenly he doesn't understand anymore or vice versa. The point of this though was to reflect the way I speak easily mixing both, so it really does depend on the individual project.\n\nClaire\n\n[www.op45.com](http://web.archive.org/web/20100213085546/http:/www.op45.com/ \"www.op45.com\")\n\n"
    },
    {
      "time": "",
      "content": "Hi everyone!  \nThank you for the comments.\n\nI agree with Aaron Bell a bit of spacing tends to be enough separation to differentiate different portions...\n\nMichel Boyer  \nThanks for the links. We have the same issue about Portuguese: it needs more letters to say the same thing, but I dont know if I like the idea of changing for a diferent typeface (sans vs serif). I found very aceptable to have a 2 column and one ends first. Visualy I dont dislike...\n\nnew Op45  \nPutting them one after the other could work, but the differentiation by a slight colour change (your example: grey/black for) could result dificult to read, no?\n\nThanks again for all comments.  \nAnt처nio\n\n"
    },
    {
      "time": "",
      "content": "Why do the fonts need to be differentiated? I am in Canada, where we see bilingual everything from cereal boxes to instruction manuals, and generally the fonts are the same. (I did see Michael's example ... that is an exception to what I find the general rule).\n\nThere already is something major different about the two items ... the language. I would think that is enough for most people.\n\n"
    },
    {
      "time": "",
      "content": "Here in Belgium everything is also in two, sometimes three, languages and usually the fonts stay the same as Don mentioned. In some books you do often see different colours used as I mentioned; done well I think it's readable but obviously the colours have to be picked carefully. For instance, if you used two different shades of grey and make sure they're both readable, the lighter one could go first to make sure it doesn't come across like that language is less important than the other.\n\nI do agree though that the fact that it's two languages is enough a differentiation but it can be an interesting element to play around with.\n\nClaire\n\n[www.op45.com](http://web.archive.org/web/20100213085546/http:/www.op45.com/ \"www.op45.com\")\n\n"
    },
    {
      "time": "",
      "content": "I would also advise against differentiating the languages by typeface, size or colour, in short anything that might be mistaken for a preferential treatment or judgement of importance.\n\n"
    },
    {
      "time": "",
      "content": "I have done several bilingual and a couple trilingual books. I agree with the people who say the typefaces should be the same, the color the same, etc.\n\nToo often, graphic design seems to fall into the trap \"anything different must be signaled by a different graphic treatment.\" But that's not usually true. If the difference is apparent to a reader, that is sufficient. In this case, with a two-column treatment, the different languages will be readily apparent as you read.\n\nNow, if you enter the book in a \\*design\\* show, as opposed to a \\*book\\* show, you might get slammed. I have noticed that, depending on the jurors, books selected for a design show can be terribly hard to read.\n\n"
    },
    {
      "time": "",
      "content": "IN GENERAL I agree with those who say that type in bi- or multilingual books should be set the same face, size, color, etc. But I offer some suggestions.\n\n\\*\\* A book such as the one described by the originator of this thread could very well support the two languages being set in different faces and/or in different colors. This book seems to be a piece of corporate promotion, not a novel, not a philosophy text, not a history monograph. I imagine that \"design\" will have a much larger role in such a book than in most instances of books made by publishing houses for the general mass of readers. So long as the two languages are set so they have equal \"visual weight\" on the page, use of two colors and/or two faces (serif and sans) would be fine. If this even-ness in \"weight\" is achieved, I do not think there will be any imputation of preference or importance.\n\n\\*\\* There may be instances when one face is used for all languages in which very slight size differences may be needed. Ojibwe has very long words and many instances of doubled vowels. Within those vowel-heavy words there are relatively few descenders. Setting a bilingual Ojibwe/English book, I was not happy with the way page spreads were working. I ended up setting one of those two languages larger by .25-point. It made all the difference; the languages appeared to be in better balance. I am sure not a single reader noticed this. This was some years ago, the files are filed away, and I cannot recall which language got the boost in size.\n\npowers\n\n"
    },
    {
      "time": "",
      "content": "Will -- The Ojibwe example rang a bell for me, so I checked in your _New Types for New Faces_ booklet. Are you thinking of the Joe Auginaush book? If so, it looks like the Ojibwe got the boost (although, according to your annotation, only .15 pt larger -- 10.65/13 vs. 10.5/13 Legacy Serif).\n\n"
    },
    {
      "time": "",
      "content": "You are right, Kent. Thanks for doing my homework for me the morning after a long weekend. I should have looked for the details, but I don't have the \"New Types\" book here, either.\n\nwill\n\n"
    },
    {
      "time": "",
      "content": "I want to add some more info here:\n\nLike will powers said \"this book is a corporate promotion, not a novel...\".  \nIt will have lots of pictures and the text set two-column seems more apealing to me tham one after the other... I noticed in some books sometimes the text refers to an image on the page before and need to do a flip-back. I think that with two-column, and extra care ;), I can avoid that...\n\nAnt처nio\n\n"
    }
  ]
}
