{
  "id": "59602",
  "title": "Fontlab UI Destroyed",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I've contacted tech support, but am in a crunch so I'll post here to see if someone has seen and fixed this.\n\nTwo days ago, my copy of FL5 went berserk. It launches, but all the palettes are missing as well as the main menu at the top. The only main menu item is Fontlab Studio and there is no \"open\" \"save\" etc. Only the standard Show Hide Quit that comes with OSX. I access the app from another user on the same machine, and the menu is there, and it appears to work, but saving and generating fonts doesn't work (this is the full version of FL mind you).\n\nI've deleted the app. Downloaded a fresh copy, installed with my serial and still have the same problem.\n\nSo I'm thinking something might have happened with python. I didn't do anything strange to start this (eg. didn't install a new macro or something).\n\nAt the moment I'm limping along on a laptop from 2001 so any help would be much appreciated!\n\n",
  "author": "Randy",
  "time": "2 Jul 2009 — 11:31am",
  "uid": "7783",
  "comments": [
    {
      "time": "2 Jul 2009 — 11:34am",
      "content": "Ah, I see you said OSX.\n\nDid you really just delete the app, or did you try using some deinstaller app? It sounds like you might need to clear out stuff from your system that your uninstall didn't catch.\n\n"
    },
    {
      "time": "2 Jul 2009 — 12:33pm",
      "content": "I would try deleting some preferences files as well, seems to fix a lot of my problems like that.\n\np@rick\n\n"
    },
    {
      "time": "2 Jul 2009 — 1:53pm",
      "content": "Try removing your Workspace file, a lot of the settings for menus and palettes seem to be stored in there. I've had some similar trouble in the past and I believe this is what worked.\n\nYour workspace file is here:\n\n`Macintosh HD : Users : [your user name] : Library : Application Support : Studio 5 : Workspaces`\n\nHope that helps...  \nAndy\n\n"
    },
    {
      "time": "2 Jul 2009 — 4:37pm",
      "content": "Hmm wish I had tried just the workspaces idea before I killed all the app support. Oh well. Things are now fixed. Thanks all for your advice!\n\n"
    },
    {
      "time": "2 Jul 2009 — 5:57pm",
      "content": "I concur on the advice to delete the Workspace file. Deleting it has solved similar problems for me in the past.\n\n"
    },
    {
      "time": "3 Jul 2009 — 1:44am",
      "content": "In this context a tip for users of the Windows version of FontLab, but maybe there is a comparable way on the Mac:\n\n1. Install the app.  \n2. Install all macros, you need.  \n3. Reduce the three main directories, that FontLab uses, to the installation directory; put them together! (Correct the paths in the options dialog of FontLab.)  \n4. Export the registry keys, in which the paths are stored and create a reg file, that removes all the rest, FontLab has stored in your registry.  \n5. Make a backup of the FontLab installation directory.\n\nIf you have trouble next time, you have your backup and your reg file.\n\nAdditionally export your favorite options from the options dialog of FontLab. That’s likewise a reg file.\n\nI have two backups: One with and one without macros.\n\n"
    },
    {
      "time": "3 Jul 2009 — 3:46am",
      "content": "Sorry for the suboptimal advice, Randy. :-\\\n\n"
    },
    {
      "time": "3 Jul 2009 — 6:04am",
      "content": ":)\n\n"
    },
    {
      "time": "3 Jul 2009 — 7:46am",
      "content": "Nina, no worries, thank you for your advice which worked! I had backed up my macro and encoding folders before scrubbing so it was an easy fix. Sounds like it would make sense to optimize my workspace and then back that up too for the next berserkery. Thanks Y'all, case closed and back to work!\n\n"
    },
    {
      "time": "3 Jul 2009 — 5:44pm",
      "content": "Oops, my smiley was meant to mean that you need not apologise in my view, Nina.\n\n"
    },
    {
      "time": "4 Jul 2009 — 1:54pm",
      "content": "Randy, in cases where using a different user account solves a problem one has with an app, the culprit can be found in corrupt/damaged preferences.  \nAnother way to test this is dragging the preferencefile (.plist) to the desktop and restarting the app in question.  \nFor my main apps I routinely make backups of the preference files when everything functions well (because setting up these can be quite a hassle) — or, since the introduction of Time Machine, as a shortcut reinstating the oldest plist available. (The first method is better, of course)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "6 Jul 2009 — 7:36am",
      "content": "Kinda makes you wish FontLab would get around to fixing these bugs by now ;-\\<\n\nChrisL\n\n"
    }
  ]
}
