{
  "id": "5962",
  "title": "Misfit Psycles",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Not your typical concept but the client loves the evil feel surrounding the name. The skull thing has been done so many times I'm finding it a bit worn.   \nAnyway any help - constructive thoughts are much appreciated.   \nConcept is for a custom bike company which wants to convey the freedom of biking while incorporating a skull. They manufacture custom bikes - you pick the parts - they assemble it. It has to fit within that \"psycho\" biking market, cool, hip etc. Some constraints - a crest logo for the front (about 1.5\" wide) so it can't go horizontal. A wordmark only, no logo, will follow for the side frame (horizontal only). The concepts here are development stages from top to most recent. Fonts are not even a thought yet. So here it is skull w/riding mask, bike gear and pure evil! Thanks!   \n   \n ![](http://web.archive.org/web/20131019193738im_/http:/www.typophile.com/forums/messages/29/42260.jpg)\n\n",
  "author": "markm",
  "time": "6 Aug 2004 — 1:54pm",
  "uid": "4395",
  "comments": [
    {
      "time": "6 Aug 2004 — 2:01pm",
      "content": "Ghost Rider the comic book comes to mind.   \n   \nI gotta go. I'll post later.\n\n"
    },
    {
      "time": "6 Aug 2004 — 2:15pm",
      "content": "Mark, I'm a bicycle racer, what kind of bikes are they customising? There is a huge difference in the mentality between the types of riders. Road vs Mountain vs City vs BMX could you clarify the marketing as it won't work across all these kinds of groups.\n\n"
    },
    {
      "time": "6 Aug 2004 — 2:37pm",
      "content": "i think your \"Ghost Rider\", its good for downhill or freeride.   \nbut for road, or cyclocross, i dont know.   \n   \nmaybe can be good for bmx, freestyle, and trial riders, but will need more ornaments. ornaments of a bad boy.\n\n"
    },
    {
      "time": "6 Aug 2004 — 2:57pm",
      "content": "I am a friend of Mark's, he is out for the night, but just so the critique can continue I can clearify that it is for downhill/freeride and hardcore cross country type stuff. Full suspension required.   \n   \nThe bikes that are being put together are the same type and feature alot of hard to find parts, and really high end stuff. I think the owner plans to start a team as well, so the logo would be applied to that as well.   \n   \nI know one of the problems he is encountering is if it should be like some type or emblem or crest, like at the front of the car.\n\n"
    },
    {
      "time": "6 Aug 2004 — 2:57pm",
      "content": "Double post.\n\n"
    },
    {
      "time": "6 Aug 2004 — 3:21pm",
      "content": "woooooow... this is incredible.   \n   \nmy brother and i are thinking in create a amateur bike team in Curic\n\n"
    },
    {
      "time": "7 Aug 2004 — 5:00am",
      "content": "Juan, if you and your brother are road racers come visit NYC we have a huge cycling scene here. CRCA is the oldest and largest club in the country. Our best riders in the area are Dominicans.   \n   \nI degress, as for the logo it works for the off road crowd, but you also need to develope a down tube look, a hard horizontal.   \n   \nTime for me to go ride around Manhattan\n\n"
    },
    {
      "time": "9 Aug 2004 — 7:03am",
      "content": "Re: GhostRider   \n   \n ![](http://web.archive.org/web/20131019193738im_/http:/www.typophile.com/forums/messages/29/42409.jpg) ![](http://web.archive.org/web/20131019193738im_/http:/www.typophile.com/forums/messages/29/42410.jpg)\n\n"
    },
    {
      "time": "9 Aug 2004 — 12:39pm",
      "content": "I used to love Ghost Rider, I guess my question is I feel I havn't gone far enough, is the simplicity of the bottom concept good or do downhill/freeryde/crosscountry target audience require some more details. I'm still throwing around the idea of making it a crest, like a biker club logo with more elements. Comments??\n\n"
    },
    {
      "time": "9 Aug 2004 — 12:40pm",
      "content": "I used to love Ghost Rider, I guess my question is I feel I havn't gone far enough, is the simplicity of the bottom concept good or do downhill/freeryde/crosscountry target audience require some more details. I'm still throwing around the idea of making it a crest, like a biker club logo with more elements. Comments??\n\n"
    },
    {
      "time": "9 Aug 2004 — 12:50pm",
      "content": "Mark, keep it simple and cool. Remember this isn't art its idenity. The best downhill, crosscountry looks are rugged and simple\n\n"
    },
    {
      "time": "9 Aug 2004 — 1:06pm",
      "content": "I have a few ideas .... please check back, thanks\n\n"
    },
    {
      "time": "9 Aug 2004 — 1:06pm",
      "content": "I have a few ideas .... please check back, thanks\n\n"
    },
    {
      "time": "10 Aug 2004 — 7:09am",
      "content": "Mark   \n   \ni think your logo has a weight problem, maybe if you bold it a little bit it can look less fragile, right now i like it but it feels like with the first fall will be smashed down.   \n   \nCG\n\n"
    }
  ]
}
