{
  "id": "59639",
  "title": "What happened to the font \"Avil\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all! First post - likely not the last since I'm really super enjoying delving into this world!\n\nWas trying to find a font to match this typeset; seemingly no such luck. The name of the type was \"Avil\" and I found it in the \"American Specimen Book of Type Styles\" from 1912. See attached image. I'm doing research into older fonts to make myself a set of calling cards, and this one is a possibility.\n\nThis isn't the first type I came across in that book that has no modern font equivalent. That surprises me - I'd imagine they may not be patented and I'd think some enterprising soul would have created font sets based on all of them. Has someone done this and I've missed it?\n\nThanks so much for your help!\n\n--A\n\n| Attachment | Size |\n| --- | --- |\n| [AvilFont.jpg](http://web.archive.org/web/20130828152039/http:/typophile.com/files/AvilFont.jpg) | 49.17 KB |\n\n",
  "author": "alec4444",
  "time": "3 Jul 2009 — 8:21pm",
  "uid": "45880",
  "comments": [
    {
      "time": "4 Jul 2009 — 5:51am",
      "content": "Avil (Inland Type Foundry, 1904) was basically a version of Goudy's Pabst Oldstyle (ATF, 1902) but slightly narrower. Both were designs in a popular advertising vernacular of the time.\n\nInland eventually merged with ATF in 1912. I suspect that Pabst was the better seller at the time (Goudy being more \"name-brand\") and the two designs are so similar, ATF probably chose not to continue producing Inland's Avil. It doesn't show up in the 1923 specimen.\n\nBoth designs seem pretty anachronistic now.\n\nLanston Type Company (now a division of P22) offers a digital version of Goudy's [Pabst Oldstyle](http://web.archive.org/web/20130828152039/http:/www.p22.com/lanston/pabst.html).\n\n"
    },
    {
      "time": "4 Jul 2009 — 7:21am",
      "content": "In the book \"Rustic and Rough-Hewn Alphabets: 100 Complete Fonts\" by Dan X. Solo, you can find a complete specimen sheet of Avil under the name of Sheperd\n\n[http://www.biblio.com/isbn/9780486267166.html](http://web.archive.org/web/20130828152039/http:/www.biblio.com/isbn/9780486267166.html \"http://www.biblio.com/isbn/9780486267166.html\")\n\n"
    },
    {
      "time": "4 Jul 2009 — 5:53pm",
      "content": "Thanks guys! Kent, thanks for the link to P22 - they've got some great fonts there! What I liked about Avil over Pabst was the seemingly taller ascenders. I found \"Nicolas Cochin\" to fill that gap, though on the P22 site. Awesome!\n\nTipus, thanks for the book link. If I get crazy enough I might buy some font software, scan the characters, and reproduce it. I've been known to do stranger things - I picked up a NuArc Plate Burner a couple weeks ago! =) Fun stuff.\n\n--A\n\n"
    }
  ]
}
