{
  "id": "5963",
  "title": "Bloobseven CI",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi there! I've been lurking around here for quite some time but now I've finally registered..   \n   \nI'd love to get some comments and critique on the Corporate Identity for my Webpage.   \n   \nIt's called bloobseven.. the left symbol stands for an abstract b and the right one for an abstract 7..   \n   \nI rounded the edges to make it easier to look at it and added a bit perspective to make it look more interesting and recognizable.. what do you think?   \n   \nAlso I'm struggling with the Font Type   \nCurrently I'm using Microgramma which was modified a bit in the top left logo version   \n   \nc&c appreciated   \n   \nthx, mike   \n   \nEdit: somehow the html code doesn't work properly.. anyway here's the link:   \n   \nhttp://sile.dhcp.at/bloob\\_ci.jpg\n\n",
  "author": "mikeb7",
  "time": "6 Aug 2004 — 2:32pm",
  "uid": "4397",
  "comments": [
    {
      "time": "6 Aug 2004 — 3:45pm",
      "content": "![bloobseven CI](http://web.archive.org/web/20131020065104im_/http:/www.typophile.com/forums/messages/29/42274.jpg)\n\n"
    },
    {
      "time": "6 Aug 2004 — 5:15pm",
      "content": "I guess the biggest concern I would have on your behalf is in the mark. In the 50's \"squares\" (brainiacs, nerds, mamma's boys) were called \"L-7s\", and your mark distinctively looks more like an \"L-7\" than a \"b-7\". This might not have been such a big deal, but this \"L-7\" identity had somewhat of a revival in the 90's, as an abbreviated version \"L\" (Loser) was popularized to the masses by Smashmouth's #1 single. The mark is achieved by pointing up and extending the thumb outward to create the \"L\" shape, similar to how the youth of the 50's created an \"L\" with one hand and a \"7\" with the other to form a square. I guess my point is that I think too many people still recognize what \"L-7\" represents.   \n   \nAesthetically, it does make a nice shape\n\n"
    },
    {
      "time": "6 Aug 2004 — 6:25pm",
      "content": "What is the nature of your business? It looks like golf clubs to me. I am also trying to understand the significance of the word \"Bloob\" or is that your last name?   \nForgive me, I am old and not hip. I trust your business is aimed at a younger audience.   \n   \nChrisL\n\n"
    },
    {
      "time": "6 Aug 2004 — 9:33pm",
      "content": "Designing a logo for yourself is the hardest thing o do. Ask yourself what is more useful, a logo or a wordmark. I don't see what bloobseven is. I hate seeing a logo that needs a written explaination below it. I think the Micheal Nagy Design is the best path to explore\n\n"
    },
    {
      "time": "6 Aug 2004 — 9:34pm",
      "content": "Designing a logo for yourself is the hardest thing o do. Ask yourself what is more useful, a logo or a wordmark. I don't see what bloobseven is. I hate seeing a logo that needs a written explaination below it. I think the Micheal Nagy Design is the best path to explore\n\n"
    },
    {
      "time": "7 Aug 2004 — 1:41am",
      "content": "hi! thx for your replies!   \n   \nwell bloob7 doesn't necessarily mean anything.. It just popped into my head and I liked it, cause I think it's quite unusual and therefore pretty catchy   \n   \nBloobseven is my online portfolio , which is currently offline though, where I showcase my work such as CI,websites etc.   \n   \nI didn't go into the direction of calling it Michael Nagy Design on purpose, cause personally I think it sounds too serious   \n   \n@Mark: Personally I'd prefer a logo rather than a wordmark but in this case I think that the wordmark doesn't necessarily fit the logo   \n   \n@ Scott: I can see your concern but as far as I know the L7 stuff started in America and since I live in Europe, the concern shrinks a bit.   \n   \nKeep the comments and ideas coming please.. I'll then try to rework it\n\n"
    },
    {
      "time": "7 Aug 2004 — 7:48am",
      "content": "I agree with Scott, although I was not aware of the historical significance of L7. But that is what your logo looks like. A simple solution may be to fill up the negative space between the two characters with the bowl of the b. However that may throw off the balance and look cartoonish.   \n   \nWould you please post a link to your page, it will help the forum give a more informed critique. I tried bloobseven.com but got some kind of on-line coupons site, so the name is not so unique. Also tried bloob7 which linked back to bloobseven and was unsucessful searching on Google as well.   \n   \nlook back at other critiques \"Klim\", \"TY (self identity)\" and \"Munoz\" are especially good. I'd send you to mine but I haven't developed a sucessful solution yet.   \n   \n [http://www.typophile.com/forums/messages/29/33935.html?1091697787](http://web.archive.org/web/20131020065104/http:/www.typophile.com/forums/messages/29/33935.html?1091697787)   \n   \n [http://www.typophile.com/forums/messages/29/20969.html?1089339624](http://web.archive.org/web/20131020065104/http:/www.typophile.com/forums/messages/29/20969.html?1089339624)   \n   \n [http://www.typophile.com/forums/messages/29/27518.html?1083707071](http://web.archive.org/web/20131020065104/http:/www.typophile.com/forums/messages/29/27518.html?1083707071)\n\n"
    },
    {
      "time": "7 Aug 2004 — 8:44am",
      "content": "Michael,   \n   \nTry a few other fonts like Infinity ExtraBold from Thirstype:   \n [http://www.myfonts.com/fonts/thirstype/infinity/stextra-bold/testdrive.html?s=bloobseven&p=48](http://web.archive.org/web/20131020065104/http:/www.myfonts.com/fonts/thirstype/infinity/stextra-bold/testdrive.html?s=bloobseven&p=48)   \nInfinity isn't over-used like Microgamma and Eurostyle.   \n   \nI think if you used \"creative\" or \"design\" with bloobseven it would work better. There is nothing wrong with using a name that has no real meaning, but I would put a word that does have meaning with it. Try placing it under bloobseven small with about 1000 points of tracking:   \n [http://www.myfonts.com/fonts/thirstype/infinity/stextra-bold/testdrive.html?s=CREATIVE&p=16](http://web.archive.org/web/20131020065104/http:/www.myfonts.com/fonts/thirstype/infinity/stextra-bold/testdrive.html?s=CREATIVE&p=16)   \n   \nAlso experiment with possibly having rounded corners on your card. That would fit your design.   \n   \nOn the back of the card I would use a different font than what your logo is done with and separate your name from the icon.\n\n"
    },
    {
      "time": "8 Aug 2004 — 2:42pm",
      "content": "@Kirsten :   \n   \nI do agree that it looks a lot like L7 but I liked the shape and the fact that those two letters form a kind of circle.   \n   \nI'll try to work something out to make it look more like a b without losing the current felling and look of the logo though.   \n   \nThe reason for bloobseven.com and bloob7.com redirecting to a coupon/ad site is that I took my page offline last august and didn't pay the extension for the domain.. so some cheeky bloke simply nicked it.   \n   \nAnyway, if you want to see a few pieces of my artwork go to [http://sile.dhcp.at/bloobseven/reference.html](http://web.archive.org/web/20131020065104/http:/sile.dhcp.at/bloobseven/reference.html)   \n   \nthe first pic is a screenshot of bloobseven v1 which was online from 01.01.01 until august 02   \n   \nthe second pic is a screenshot of v2 which was online until august 03   \n   \n@ Tom:   \n   \nI actually don't intend to buy a font for my logo simply cause I don't want to afford it atm.   \n   \nForget the cards, they're just temporary.. I just wanted to show you something where the logo could be placed   \n   \nbtw. I like Bloob Creative.. do you think I should get rid of the 7?\n\n"
    },
    {
      "time": "8 Aug 2004 — 6:51pm",
      "content": "I like bloob7 creative.\n\n"
    },
    {
      "time": "22 Aug 2004 — 10:48am",
      "content": "hey! I've found some time to work a bit on the CI..   \nwhat do you think? any comments?   \nthe font and type treatment is just temporary so ignore that plz..   \n ![b7_id](http://web.archive.org/web/20131020065104im_/http:/www.typophile.com/forums/messages/29/47287.jpg)\n\n"
    },
    {
      "time": "22 Aug 2004 — 11:25am",
      "content": "now you need to find a font that fits the icon.\n\n"
    },
    {
      "time": "22 Aug 2004 — 2:30pm",
      "content": "yep.. you say it tom.. got any ideas?   \ndo you agree that the straight looking logo looks better than the one with perspective?\n\n"
    },
    {
      "time": "22 Aug 2004 — 4:05pm",
      "content": "I like the perspective version. I would beef it up some so it can look like a bloob ![:-)](http://web.archive.org/web/20131020065104im_/http:/www.typophile.com/forums/clipart/happy.gif) I am sorry for not suggesting any specific fonts for it. I will have to do research but don't do all caps. Also dont allign the creative so perfectly under it.\n\n"
    },
    {
      "time": "23 Aug 2004 — 7:55am",
      "content": "IMHO, 'bloob' is just way too gimmicky. It's like those 'ploids' or 'Flooz' and other childish made-up names during the height of the dot-com bubble.   \n   \nThere's also the childish humour of 'boob' that I can't help snickering at. ;o)   \n   \nAnd to add to scott's wonderful history of silly pop culture, L7 was also 90's era band:   \n   \n [http://www.mtv.com/news/articles/1431079/07301999/nulll\\_seven.jhtml](http://web.archive.org/web/20131020065104/http:/www.mtv.com/news/articles/1431079/07301999/nulll_seven.jhtml)\n\n"
    },
    {
      "time": "24 Aug 2004 — 3:06pm",
      "content": "update:   \nc&c?   \n   \n ![bloobseven id](http://web.archive.org/web/20131020065104im_/http:/www.typophile.com/forums/messages/29/47449.jpg)\n\n"
    },
    {
      "time": "24 Aug 2004 — 3:24pm",
      "content": "In small sizes Creative is unreadable. Most CI has ranges that you can use colors and even spacing. Sort of \"If less than 1\" tall then\n\n"
    },
    {
      "time": "24 Aug 2004 — 4:01pm",
      "content": "I still feel you should explore upper and lower case together and bolden it. Make creative the same color as seven (as well as the lighter part of the icon). Also try moving the icon 3/4 of the way to the left of the title above it just to see how that looks.\n\n"
    },
    {
      "time": "25 Aug 2004 — 2:23am",
      "content": "thanks a lot for your comments so far   \nI've now tried a few variations as far as type treatment is regarded   \n   \n ![variations](http://web.archive.org/web/20131020065104im_/http:/www.typophile.com/forums/messages/29/47497.jpg)\n\n"
    },
    {
      "time": "25 Aug 2004 — 4:47am",
      "content": "Is this an eye chart test? in small sizes Creative is unreadable. Why space creative the whole length of the name? Try just having it the length of Seven and get rid of the silly letter spacing. Take your b7 and flush it left the width of Bloob. Just suggestions, but the legibility is a problem in small sizes.\n\n"
    }
  ]
}
