{
  "id": "5968",
  "title": "Esperanto-like Universal Typeface Proyects?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Any information about universal language-typeface proyects?   \n   \nmh.\n\n",
  "author": "Miguel Hernandez",
  "time": "6 Aug 2004 — 8:49pm",
  "uid": "1109",
  "comments": [
    {
      "time": "6 Aug 2004 — 8:55pm",
      "content": "An interesting article about Esperanto:   \n   \n [http://paulm.com/esperanto/newsweek\\_international\\_esperanto\\_20030811.jpg](http://web.archive.org/web/20140525231614/http:/paulm.com/esperanto/newsweek_international_esperanto_20030811.jpg)   \n   \nmh.\n\n"
    },
    {
      "time": "6 Aug 2004 — 9:07pm",
      "content": "By this, do you mean a single typeface that covers all the world's languages?   \n   \nThere have been several attempts at this. Arial Unicode and Cyberbit come to mind. Lucida Grande I don't think covers quite as many languages.   \n   \nBut the really \"universal\" fonts typically suffer from several problems:   \n   \n1) The styles of the source glyphs often vary widely for the different language sections, so the different languages don't necessarily match all that well.   \n   \n2) The immense number of characters involved means that it's generally only practical to do a single font. One weight, one style. But to do even basic typography in most languages one needs at least two weights and/or italics. (Which leads to another problem, that italics are critical to some languages and meaningless to others.)   \n   \nSome people think of a universal typeface as covering all the codepoints in Unicode. Unfortunately, Unicode is a moving target. Arial Unicode does all of Unicode 2.1, but Unicode 4.1 has more than twice as many characters.   \n   \nEven if somebody wanted to do a single font that covered all of Unicode, they'd have the problem that no existing font format can handle more than 64K glyphs, while Unicode has about half again that many characters.   \n   \nSo, if that's what you were thinking about, it's an interesting idea, but sadly of limited utility, and impractical to make as well.   \n   \nThat being said, the main use of such a font is as a fallback to display characters that are not present in a given font. Here, it could be useful to have a universal font, even if it is of limited practicality in general. For this purpose, you only need one such font on a given operating system, and it doesn't have to be attractive or part of a full type family.   \n   \nMy two cents, for what it's worth.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "9 Aug 2004 — 8:15am",
      "content": "Can you elaborate on your question a bit more, Miguel? Do you mean what Thomas was speaking about, or do you simply mean \"a typeface that embodies the spirit of the Esperanto language and movement\"?   \n   \nEsperanto is an interesting phenomenon--with some substantial drawbacks...   \n   \n1) It claims to have no ties to any particular language or language family--but it is clearly a Romance language.   \n   \n2) Esperanto isn't as free from particular cultures as its speakers would have you think. The language is prone to dialectization, and adherents in Brazil, for example, have been known to have substantial difficulty communicating with Japanese Esperanto speakers.   \n   \nIt's a valiant cause, but Hamanity is just too culturally compartmentalized for the idea to ever really work. And world leaders just don't respect it or know enough about it at this point for anything to take hold.\n\n"
    },
    {
      "time": "9 Aug 2004 — 9:01am",
      "content": "\\>Unfortunately, Unicode is a moving target.   \n   \nIs this because languages keep evolving, with new characters constantly being invented, and new glyphs?   \n   \n(So only \"unfortunately\" in that it precludes against the Once-And-For-All-Megafont.)   \n   \n\\*\\*\\*   \n   \nMiguel -- the underlying principle of the Knuth Metafont suggests that a universal \"base\" typeface may be defined, one that can be adapted to accomodate any character in Unicode, past, present or future -- in a range of styles.   \n   \n\\*\\*\\*   \n   \nPerhaps the first universal typeface project, which catalogued all existing alphabets at the time, was Edmund Fry's \"Pantographia\" (1799).   \n   \n\\*\\*\\*   \n   \nWhere does shorthand (eg Pitman) fit into the scheme of things? Can it \"code\" all vocal sounds, and therefore any language?\n\n"
    },
    {
      "time": "9 Aug 2004 — 10:31am",
      "content": "Unicode is a moving target because there are still numerous writing systems that have yet to be encoded in the standard, so it is still increasing.\n\n"
    },
    {
      "time": "9 Aug 2004 — 10:53am",
      "content": "...And with the trend of inclusion of pictographs alongside pure writing systems it could go on indefinitely.\n\n"
    },
    {
      "time": "12 Aug 2004 — 12:09am",
      "content": "---By this, do you mean a single typeface that covers all the world's languages?   \n   \nYes, as a resume, in a simple way. Not a font with a hundred versions and gliphs for every language. Less is more is law in visual communication, or not?   \nI was thinking in the possibility of a tecnical advantage of this, an investigation from a the mind of a group of typographers.   \n   \n---It's a valiant cause, but Humanity is just too culturally compartmentalized for the idea to ever really work. And world leaders just don't respect it or know enough about it at this point for anything to take hold...   \n   \nI mean, a typeface proyect who covers the most used and common vocal sounds from the most functional languages, is not necesary connected with cultural democracy of languages.   \nI was thinking is a proyect of a universal typography in this way:   \n   \nAn alphabet as a universal tool, more in a cience way, more related to a traslation of the voice and body language.   \nIf one day we need to create a language with artificial intelligence, or with some unknown or extraterrestrial intelligence, as a non fiction example (Carl Sagan Setti proyects, human capsule thing), dont we need such a tool?   \n   \n   \nmh.\n\n"
    },
    {
      "time": "14 Aug 2004 — 12:54am",
      "content": "This is one of my favorite topics ever!   \n   \nHerbert Bayer designed a context-sensitive alphabet called the \"basic alfabet\", which can be found in the April 1964 issue of Print. Interestingly enough, there was an article called \"Towards an International Language\" that shared many of the same ideas in a Print from just a couple months earlier (also 1964), and these ideas were eventually formed into the IPA, or International Phonetic Alphabet (I think Hermann Zapf was involved in this).   \n   \nJan Tschichold (Universal), Herbert Bayer (universal), Bradbury Thompson (Alphabet 26), Brigham Young (Deseret alphabet), and many others developed single case \"universal\" alphabets that sought to further some purpose in their day, all of which are fascinating, but limited. Bayer went from advocating a limited-character system (universal) to a more complex, vocal-inflection oriented system (basic alfabet), and I think most of the old modernists (Tschichold most famously, in the same early-1964 issue of Print as \"Towards a Universal Language\") backed away from their earlier claims as being inconsistent with humanistic principles.   \n   \nThat said, there's a certain \"flattening effect\" with computers, where at the root of all programs are Roman characters (Jon Wozencroft wrote about this in a great article called \"It May Be Wrapped but Will It Warp?\" -- the line went something like \"We all use electronumeric US English now... Ours is a translation game\"), and of course all airports use English. If you really want a single alphabet, of the \"less is more variety\", working to crush all non-English (or at least, Roman-based) languages is probably your best bet, even if it is a distressing enterprise. Many countries - [like Azerbaijan](http://web.archive.org/web/20140525231614/http:/tinyurl.com/3vd6j) - are choosing to ditch their historical alphabets in favor of romans.\n\n"
    },
    {
      "time": "14 Aug 2004 — 9:22am",
      "content": "Technically, Deseret does have two cases - uppercase letters are rendered larger.   \n   \n\\> If you really want a single alphabet   \n   \nGod forbid such a sad thing. And if we were to have to choose a single writing system hopefully it wouldn't be the clunky, diacritic-infested, under-symboled Roman script. Hangul is ten times better.   \n   \nBTW, Azeris still speak Azeri, and they've switched their writing system many times to cater to the current powers that be, not as some sort of continuous refinement towards The Most Perfect Alphabet That Is English - what a farce.   \n   \nhhp\n\n"
    },
    {
      "time": "14 Aug 2004 — 12:27pm",
      "content": "Heya, Hrant --   \n   \nBelieve me, I think the trend towards English-and Roman-ization is a distressing one, but I wrote the post above because designers have been obsessed with the \"universal alphabet\" thing for generations -- and most seem to wind up embracing greater complexity later in their lives. I think it's pretty interesting to hear that it's still an engaging project for some. (And, I thought I was being tongue in cheek talking about \"crushing\" other languages...)   \n   \nThe article I linked supports what you say about the Azeri peoples' language, and it's an interesting choice... go back to the historical alphabet (Arabic, which doesn't particularly suit the phonetic range of the language), keep the recently-imposed one (Cyrillic, which fits well but reminds many of the \"powers that be\"), or switch to the Roman alphabet? You're right that it smacks a little of \"the powers that be\" (Be original! Rebel! Drink Pepsi!), but which would you have chosen?   \n   \nThe article also mentioned that UCLA was the first to teach Azeri in Romans.... do you have any sense of how that's worked?   \n   \nEdit: Peignot was a unicase with large and small letters, (mostly) just like Deseret... one set of forms, two sizes. Dag, that was the one I forgot!\n\n"
    },
    {
      "time": "14 Aug 2004 — 5:39pm",
      "content": "\\> most seem to wind up embracing greater complexity later in their lives.   \n   \nI haven't noticed that, but I certainly hope it's true - because to me the desire for universality is a Modernist trap - it's anti-human.   \n   \n\\> which would you have chosen?   \n   \nIf I wanted to pander to Turkey and the West, I would certainly choose Roman.   \nIf I wanted to be more Azeri, I might make a new writing system.   \n   \nUCLA: I worked there for about two years, four years ago, and in a totally different department, so I'm sorry to say I have no idea. But it makes sense that a college that has conformism at its core would love the idea.   \n   \nPeignot: Although the lc and UC are strongly related, it's not really as purely \"mirror-case\", shall we say, as Deseret. Also, because it's a font, people have trouble seeing its \"alphabet reform\" aspect.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Aug 2004 — 9:05am",
      "content": "I think we're severely hindered in this cause by the simple fact that many \"third-world\" cultures still don't have real access to computers, but typewriters.   \n   \nOf course, this is changing.\n\n"
    },
    {
      "time": "16 Aug 2004 — 1:09pm",
      "content": "The trend towards the Latin alphabet for Azeri and other Turkic languages, which began in the 1920s and was derailed during the 1930s and 40s when Stalin insisted that all Soviet languages be written in the Cyrillic script, is a function of pan-Turkism. So while it follows Ataturk's desire to move the Turks culturally and politically toward the West, it is not so simple as 'catering to the current powers that be'. It also represents the desire of disparate Turkic peoples spread through several nations to band together and seek strength in numbers.\n\n"
    },
    {
      "time": "16 Aug 2004 — 1:10pm",
      "content": "Double post.\n\n"
    },
    {
      "time": "16 Aug 2004 — 1:17pm",
      "content": "(disclaimer: this post does NOT advocate the elimination on non-latin writing systems!)   \n   \nWhile I think that Azerbaijan should probably hold on to its own culture, language, and writing system, the further extension of the (flawed) latin alphabet will probably not bring about the end of the world. The Azerbaijanis (do they call themselves that?) will most likely keep on speaking and writing the way they always have.   \n   \nAn interesting collarary to this is a series of letters that Goethe's mother wrote to him during the Napoleonic era (this was when the French were militarially and culturally the overlords of continental Europe). Many German authors and publishers took advantage of the \"Revolution\" to start printing more books in latinate letters, instead of fraktur. Goethe's mother was a proto-nationalist, and complained of this situation to her (already famous and renowned) son. She urged him never to publish a book in serif type (he already had\n\n"
    },
    {
      "time": "16 Aug 2004 — 3:03pm",
      "content": "As far as I know, Azeri has never had its own writing system. It seems to have been unwritten before conversion to Islam and adoption of the Arabic script. Later, when the Turks dropped the Arabic script and adopted the Latin alphabet, the majority of Turkic peoples followed suit. The Turkic peoples who found themselves in the Soviet Union used the Latin script for 10-15 years, and were then obliged to switch to a new Cyrillic orthography. Following the collapse of the Soviet Union, the Turkic successor states announced an official change to the Latin script, typically picking up where they left off in the 1930s. The changeover has been difficult, and in Azerbaijan many older people can only read the Cyrillic orthography. When Ataturk made the switch from Arabic to Latin in the 1920s he had the advantage of 80% of the Turkish population being illiterate. In Azerbaijan, literacy in the Cyrillic orthography was very high, and many people have objected to having to learn the new-old Latin orthography. Complete change will come only with the passing of the older generations.   \n   \nA similar situation persists in Mongolia, but unlike the Turkic peoples the Mongolians did have and are trying to restore their own, indigenous writing system. Interestingly, having rejected the Cyrillic script, and with still poor support for the Mongolian script in computer systems, the middle generation of educated Mongolians who grew up with the Cyrillic script, find it hard to learn the traditional script, and need to write e-mails, have adopted a Latin-transliteration that has become a kind of de facto third script option.\n\n"
    },
    {
      "time": "16 Aug 2004 — 3:32pm",
      "content": "\\> The trend towards the Latin alphabet ... is a function of pan-Turkism.   \n   \nThat doesn't make sense, because they could have just kept using Arabic. Switching to Latin, especially at different times, with no assurance that other Turkic countries would follow only weakens pan-Turkism.   \n   \nAs you say, illiteracy helped a lot, but the main reason the Turks switched, and continue to switch, to Latin is simply to make powerful friends. One day Georgia (a country already selling its soul to the god Money) might suffer the same fate.   \n   \n\\> It also represents the desire of disparate Turkic peoples spread through   \n\\> several nations to band together and seek strength in numbers.   \n   \nAnd of course \"cleanse\" the land of peoples who might happen to be in the middle... Which can only really take hold if you have the only remaining _super-power_ on your side, partly because you've adopted that power's alphabet. Don't underestimate the favors one can win through emulation. Why do you think the NBC commentators favor athletes from countries more similar (in whatever way) to the US?   \n   \n--   \n   \n\\> Hrant, you are going to refute my hypothesis with some witty anecdote about how   \n\\> some yet unnamed country has adopted the latin alphabet only to then forget its   \n\\> entire history, aren't you\n\n"
    },
    {
      "time": "16 Aug 2004 — 5:59pm",
      "content": "Well, if the forgetting comes _first,_ then there isn't anything inherently wrong with an ethnic group adapting to the Roman alphabet, is there? I mean, the tragedy is the forgetting of their culture\n\n"
    },
    {
      "time": "16 Aug 2004 — 9:19pm",
      "content": "_That doesn't make sense, because they could have just kept using Arabic. Switching to Latin, especially at different times, with no assurance that other Turkic countries would follow only weakens pan-Turkism._    \n   \nBut they didn't switch at different times. Ataturk's reform inspired an attempt to create a pan-Turkic Latin orthography in the 1920s. This was largely a success and widely implemented. It was initially accepted by the Soviet authorities, who doubtless approved of the secularism that helped make a break with the Arabic script desirable. There are dozens of Latin orthographies for southern Soviet minority languages from this period. Then, in the later 1930s and 1940s all Latin orthographies in the Soviet Union were supressed (probably on Stalin's personal order, since he had an interest in linguistics). Undermining pan-Turkism was doubtless one of the goals of this supression and the forced introduction of Cyrillic orthographies. Since the collapse of the Soviet Union, many of the Latin orthographies of the 1920s have been brought back. There tends to be only minor variation among them, and they constitute a pan-Turkic alphabet, much as was envisaged in the 1920s.\n\n"
    },
    {
      "time": "16 Aug 2004 — 10:53pm",
      "content": "Dan: the ideal balance between cultural exchange and cultural preservation for a given group depends on their long-term security. Arabs for example (even though they're currently threatened by the West) don't really have to worry much about assimilation; but Armenians very much do, especially since Turkish \"policies\" have resulted in more than half of us living outside Armenian land.   \n   \n\\> What about cultural groups that never had their own writing systems?   \n   \nI think there's much to be said for inventing a new script to serve a budding -or threatened- nation. In fact, the invention of the Armenian alphabet for example was in part a result of nationalism: it came at a time when Armenians were being assimilated both into the Byzantine and the Persian empires, and the desire for a new, _Armenian_ writing system to translate the bible is documented.   \n   \n\\> what is so bad about their ditching it several centuries later for Roman?   \n   \nCertainly, switching to Roman made sense in terms of linguistics (since Turkish, being an Altaic language relies on vowels - something not in tune with heavily consonantal Arabic), but the \"bad thing\" is simply an issue of intentions: when you switch to the writing system of the former enemy (Turkey was on the side of Germany in WWI), you weaken your national identity. The current turmoil of religion versus capitalism that's going on in Turkey can be said to be a result of Ataturk's reforms.   \n   \n--   \n   \n\\> they didn't switch at different times.   \n   \nDidn't you once mention that Azerbaijan actually switched to Latin before Turkey (only to later have Cyrillic imposed)? And anyway, there still can never be a guarantee that all Turkic nations would syncronize the switch (or make it at all), so simply keeping Arabic would have been more pan-Turkic. Plus don't forget that Turks are generally Muslim and Arabic is the script of Islam, so switching to Roman seems to be anti-Turkic on that front as well. Ataturk was a secularist, but I think his utopia of a single, large, but secular pan-Turkic state was too ambitious - and the cracks in just Turkey itself are showing more prominently with each passing day: Turkey's Islamism is increasingly straining its historic relationship both with the US and Israel.   \n   \nhhp\n\n"
    }
  ]
}
