{
  "id": "59708",
  "title": "Web H&J Recommendations",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm doing something, and I know there isn't much H&J on the web, but I have a question(s).\n\nFirst, if a type designer were giving recommendations for Justification of a particular font, do you all think that recommendation should be a binary decision, (i.e. Y/N)?\n\nSecond, if a type designer were giving recommendations for Hyphenation of a particular font, do you all think that recommendation should be a binary decision, (i.e. Y/N)?\n\nThanks in advance for any input.\n\nCheers!\n\n",
  "author": "<a href=\"/web/20100203103625/http://typophile.com/user/2969\" title=\"View user profile.\">dberlow</a>",
  "time": "<br>",
  "uid": "2969",
  "comments": [
    {
      "time": "",
      "content": "Justification without hyphenation on the Web tends to look pretty bad, so I would discourage it. As to the second question, I guess it depends on how the typeface stands fiddling with its spacing. But being that there’s no hyphenation on the Web – yet! – it’s another N for me.\n\n"
    },
    {
      "time": "",
      "content": "On the one hand, I would say that neither recommendation should be binary Y/N because you can't anticipate all the factors (different browsers, different H&J algorithms (or lack thereof), future-proofing, backwards compatibility, text size, etc.) that would influence the recommendation. On the other hand, I'd say that the recommendation has to be binary Y/N because you can't anticipate all the factors....\n\nPut it another way: the recommendation shouldn't have to be binary, but I don't see how you could make the recommendation more nuanced given that you can't know for certain what the reader will be seeing.\n\n"
    },
    {
      "time": "",
      "content": "So, if a Yes can have conditions, then we'd want justification's Yes to be dependent on the ability to say Yes to hyphenation too.\n\nJohn, I'm thinking more along the lines of recommendations that are not dependent on 'all the factors' but focus more on the font's design factors alone, e.g. Monospaced fonts, seriously contextualized designs, or connecting scripts where all the Justification answers are stark.\n\nAnd then, I'm also thinking of dedicated headline fonts, where H & J answers are also both fairly stark...\n\nDoes that make more sense?\n\nCheers!\n\n"
    }
  ]
}
