{
  "id": "59701",
  "title": "Bumper Sticker Font - Legability",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello all,\n\nRecently I've been commissioned to design a basic bumper sticker/decal. You've seen them before \"HOW'S MY DRIVING? 1-800-555-5555\". I'm looking for suggestions on typefaces to use. Legibility is essential, as the bumper sticker/decal has size limitations and will be read while in movement.\n\nI'm reaching out to the typography community for suggestions - You input would be most appreciated.\n\nSunny.\n\n",
  "author": "SunnyGosal",
  "time": "6 Jul 2009 — 11:31pm",
  "uid": "39646",
  "comments": [
    {
      "time": "11 Jul 2009 — 10:07am",
      "content": "Some of the most legible typefaces are the ones that designers hate, like Arial and Souvenir. Designers avoid them because they're bland and boring, but there's a reason folks keep using them: Their lack of subtle refinement makes them easy to read under less-than optimal conditions (e.g., driving past at 70 mph).\n\n"
    },
    {
      "time": "11 Jul 2009 — 3:01pm",
      "content": "[Clearview](http://web.archive.org/web/20150420002912/http:/www.clearviewhwy.com/) — American highway  \n [DIN Mittel](http://web.archive.org/web/20150420002912/http:/www.fontshop.com/fonts/downloads/elsner_flake/din_mittel_ot/) — German highway  \n [Interstate](http://web.archive.org/web/20150420002912/http:/www.fontshop.com/fonts/downloads/elsner_flake/din_mittel_ot/) — Canadian highway\n\nI think the \"invisible/boring/familiar\" approach should be strongly considered (Helvetica?). It _is_ somewhat ironic making an eye-catching bumper sticker, taking drivers attention away from the road, in the spirit of driving safety.\n\nWithout getting into a scientific debate, I would recommend upper and lowercase over caps (Bhouma, 1971) and opening up the tracking a bit (Pelli, 2008).\n\nIt may be worth finding out the predominant road-sign typeface in your clients region and select the same so it blends in with the typographic landscape.\n\nAdditionally, you may want to take the \"+ frequency of exposure = good\" approach. Following that logic you could rationalize using basterdized Airal caps. An interesting challenge. To counterbalance attention to the road with attention to the sticker while communicating a message.\n\n"
    },
    {
      "time": "11 Jul 2009 — 3:14pm",
      "content": "Some fonts that are designed to remain readable in very small print also work well at moderate sizes when viewed from considerable distance. Try Officina Sans or Bell Centennial, especially if the condensed widths will help fit your space constraints.\n\n"
    },
    {
      "time": "11 Jul 2009 — 5:02pm",
      "content": "Christopher Dean, _Interstate_ also links to DIN Mittel.\n\n"
    },
    {
      "time": "11 Jul 2009 — 5:27pm",
      "content": "Whoops. [Interstate](http://web.archive.org/web/20150420002912/http:/www.fontshop.com/search/?q=interstate&x=0&y=0). Nice catch.\n\n"
    },
    {
      "time": "11 Jul 2009 — 5:34pm",
      "content": "Transport by Kinneir and Calvert\n\nWill\n\n"
    },
    {
      "time": "11 Jul 2009 — 7:48pm",
      "content": "Interstate is not used on any highway system.\n\nYou may have been thinking of Standard Highway Alphabets Series B thru Emod, which is what Interstate is based on.\n\n"
    },
    {
      "time": "11 Jul 2009 — 8:11pm",
      "content": "For legibility, Clearview is better than Helvetica, and way better than Helvetica bold, IMHO.\n\n"
    },
    {
      "time": "12 Jul 2009 — 12:12am",
      "content": "SunnyGosal -\n\nConsider whether your bumper sticker will be appearing on a long-haul semi truck or a neighborhood delivery vehicle. The legibility of the DIN-Interstate-Clearview highway fonts is tested and scored in the context of headline display letters on stationary signs posted along state or federal highways, and I don't know if it's all that applicable in the context of a bumper sticker that's to be seen at local stop lights and businesss parking lots. A non-highway sans font might serve your purposes better.\n\n"
    },
    {
      "time": "12 Jul 2009 — 5:37am",
      "content": "<cite>A non-highway sans font might serve your purposes better.</cite>\n\nWHile I disagree with your argument regarding the applicability of the testing and research to this use, it is still probably a good idea to use a non-highway type of alphabet. Don't ever pass up an opportunity to instill your brand on the public. Your decision on what font to use on the bumper sticker should be coordinated with the entire identity process of the organization you are working for.\n\nHow did that old bumper sticker go? \"HOW IS MY DRIVING? Call 1-800-EAT SH\\*T\"\n\n"
    },
    {
      "time": "12 Jul 2009 — 5:48am",
      "content": "@ChristppherDean\n\nBoth Standard Highway Alphabet and Clearview are used in both the USA and Canada.\n\nIn fact, Canada embraced Clearview much faster than the US did. I believe that Canada does not have the federal equivalent of the FHWA, so these decisions were able be made on the municipal and provincial level without approval from the federal government.\n\nAt last count, Clearview was being used in Quebec, Ontario, Alberta, Manitoba, Saskatchewan, British Columbia.\n\n"
    }
  ]
}
