{
  "id": "5971",
  "title": "Font Design Cost",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm a graphic designer in New York City and I'm looking on the web for some information, I found this site so I thought I'd ask:   \n   \nI've been asked to design a font for a company to be used by them exclusively and I have no idea what to charge. I'm sure it depends on the company's size and income, it's a broadcast company with its own cable network so it's fairly sizable. I've been designing for over 15 years, logos, lettering etc. but haven't come across this yet...so I'm looking for some input   \n   \nI would also be hiring someone to finalize the art in Fontographer, so I suppose my question concerns what my design fee should be, and what production on Fontographer would cost   \n   \nany info ASAP would be most appreciated...   \n   \nthanks for your time,   \nEdwin\n\n",
  "author": "anonymous",
  "time": "9 Jan 2003 — 3:57pm",
  "uid": "1203",
  "comments": [
    {
      "time": "9 Jan 2003 — 5:39pm",
      "content": "I agree, generally, with Paul, with the inevitable caveat that the Pricing Guidelines book is always so broad.   \n   \nI'd estimate betwen $4k-$7k per font, per weight. That means the Roman would be one font, the bold a second, and the italic a third. This range, of course, can fluctuate based on the client's industry and size.   \n   \nOft times clients don't have a concept of what custom type creation costs, and can be scared away once they see cost. That's where you have a sales opportunity - Design the Roman, and then do the Italic later down the road when more revenue frees up.\n\n"
    },
    {
      "time": "9 Jan 2003 — 5:55pm",
      "content": "I think $4K/weight is generally too high, unless you're a big name. The lower end of Paul's numbers is more realistic these days.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Jan 2003 — 7:08pm",
      "content": "How about rights to exclusivity? Isn't it common for designers to charge a fee for each year of use? Or am I dreaming? I suppose it depends on the agreement and the clients intended use and more specifically, length of that use.\n\n"
    },
    {
      "time": "9 Jan 2003 — 8:43pm",
      "content": "If we're talking generally, pricing a font is determined by the following variables:   \n   \n1. Completeness of font character set   \n2. Term of exclusivity   \n3. Breadth of family weights   \n   \nFrom this information you can determine how to dial the price up or down. Let's say you decide to charge $2,500 for one weight of a font. Then you find out they want every character slot filled, add $1,000. Then they tell you that they want exclusive rights for 2 years, add $2,000. They want two weights of the font, so another $1,000 to $2,000 for each weight depending on the amount of work invovled.   \n   \nThere is a level of techincal completeness that is expected, like kerning, but beyond that realm are things like delta hinting if they want that stuff have your FOG buddy quote that stuff.   \n   \nWhen a font is commissioned, it always remains the property of its creator and the company who purchases it essentially owns the right to use the font for a period of time exclusively then it's assumed you may offer the font for sale publicly at the end of the terms of the agreement.   \n   \nThe only other exception to the rule is if they want the font for buyout which means you double the price.   \n   \nIn every case, make sure you attach SOME legal documentation with your completed font that states the terms of use as well as the proper license for your font. Check out a few license agreements from foundries to get the jist of it.   \n   \nIf you don't include that document, you basically lose protection of the face and allow them to do whatever they want to with it including selling copies of it without your permission.   \n   \nIf you have a client that will renew a license annually, great! otherwise, it's much easier to define the project at the beginning including terms of extending your agreement with them.   \n   \nHope this helps!   \nStuart :D\n\n"
    },
    {
      "time": "9 Jan 2003 — 4:21pm",
      "content": "Edwin,   \n   \nA quality custom typeface is obviously worth a lot more than just the time spent making it. A good source of pricing information is the Graphic Artists Guild Handbook. I have the 9th (1997) edition.   \n   \nIt suggests that typeface design (with exclusivity of use) is usually priced within the following ranges:   \n   \nIf client is a \"manufacturer\":   \none style & weight: $2500 - $10000   \n2 styles, 4 weights: $3750 - $15000   \n   \nIf client is a \"magazine\":   \none style & weight: $1250 - $5000   \n2 styles, 4 weights: $1900 - $7500   \n   \nThese are just guidelines, and it doesn't expound on exactly what it means by \"manufacturer\" and \"magazine\". Perhaps the former refers to companies that will get more secondary use out of the font.   \n   \nPaul\n\n"
    }
  ]
}
