{
  "id": "59711",
  "title": "first time charging for the commercial use of a font",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "So, I'm an amateur typographer with two freeware releases. So far both of my fonts have done very well, and I receive at least a few emails per week asking for permission to use one of them for something commercial (logo, website, etc). It gets a bit tedious and time-consuming to reply to each of these to explain that they can use it, especially as they're already marked as freeware.  \nSince I'm in the process of creating my third font, I'm toying with the possibility of making this new font free for personal use and charging a small fee for commercial use, simply to make it worth my time to respond to inquiries... However I don't really know where to start in terms of selling a font. Should I sell it through certain websites? Is there paperwork I need to do to protect the font from being used commercially without payment? What do I do if I see it being used commercially without payment? Since I definitely want personal use of the font to remain open, does my process of charging for its commercial use differ greatly from one that needs to be purchased for any use? Etc.  \nIf anyone has links to resources detailing font sale, or can simply brief me on the process, I'd be very grateful.  \nThank you!\n\n",
  "author": "limetree",
  "time": "7 Jul 2009 — 5:58am",
  "uid": "45652",
  "comments": [
    {
      "time": "7 Jul 2009 — 6:31am",
      "content": "[Myfonts is nice, simple, and gets lots of exposure](http://web.archive.org/web/20150124161657/http:/new.myfonts.com/info/prospectus/). Or, if you want to keep things small, you could approach a smaller foundry; I’ve been pretty happy with [TypeTrust](http://web.archive.org/web/20150124161657/http:/www.typetrust.com/).\n\n<cite>…I’m toying with the possibility of making this new font free for personal use and charging a small fee for commercial use…</cite>\n\nWhy should anybody get your font for free? Does your doctor treat you for free if you need treatment that isn’t a workplace injury? Does your plumber fix your house for free and only charge when he works at a business? Charge less for personal use if you want, but this notion of a free economy that helps the little guy is a load of crap. You worked hard, and you deserve to get paid for it.\n\n"
    },
    {
      "time": "7 Jul 2009 — 7:50am",
      "content": "Teaghan, I love your squiggle-field font, and I while I agree with James that a good way to start commercially would be MyFonts, I also think that for work of this quality, a foundry-distributor would be interested. And working with such an outfit would give you access to its experience and expertise, both business and technical, to answer all those questions you have.\n\n"
    },
    {
      "time": "7 Jul 2009 — 12:07pm",
      "content": "Hi Teagan\n\nI run a website/foundry specializing in reworking free fonts up to a commercial quality, and then selling them with a (very generous) commercial license. I work with a nice selection of the finest freefont designers, and would be happy to work with you, too :)\n\nMy concept is not a sensible option if you want to make serious income from your creations, but it does create some extra pocket-money for all participants. And you can then continue to create fonts for fun - with just a basic character set (and release them for free if you want to) - and let me polish them up to a commercial quality and handle the promotion, hosting, sales and support. I also publish through MyFonts.\n\nLook at my site, and contact me if this sound like an interesting option for you ;)  \nAnyways: keep up the good work whichever path you choose - your fonts are quite special, original and lovely.\n\nRoger  \n--  \n [http://www.CheapProFonts.com](http://web.archive.org/web/20150124161657/http:/www.cheapprofonts.com/ \"http://www.CheapProFonts.com\")  \nHigh quality multilingual fonts at a low price - for professional (non-english) designers with a small budget!\n\n"
    },
    {
      "time": "7 Jul 2009 — 5:08pm",
      "content": "<cite>Why should anybody get your font for free? Does your doctor treat you for free if you need treatment that isn’t a workplace injury? Does your plumber fix your house for free and only charge when he works at a business? Charge less for personal use if you want, but this notion of a free economy that helps the little guy is a load of crap. You worked hard, and you deserve to get paid for it.</cite>\n\nI release my fonts as freeware for several reasons... First because font development is a hobby for me, and not something that I am interested in taking to a high level commercially, as I prefer to focus my efforts on my illustration business. Second because I am an amateur and I don't consider my typographic work thus far to be professional enough to charge money for, though hopefully the quality of my work will increase in time. Thirdly because I am of the generation that does not believe in paying for information, be it music, movies, fonts, etc, and I don't expect other people to pay for something I would not pay for myself (no matter how unethical this seems, it is unfortunately the truth). And finally, my fonts are really just creative, aesthetic endeavors, and not terribly practical... When used in graphic design work I think they're really quite tacky, and honestly I'd prefer people to use them less, but if someone wants to use them I'm not about to stop them from doing so.\n\nSo, those are my (mostly awful) reasons, but you did ask. :]  \nThank you for the website recommendations, I will look into them!\n\n"
    },
    {
      "time": "15 Jul 2009 — 1:25pm",
      "content": "Looks like I joined Typophile right in time (this is my first post).\n\nTeagan, like you, I've just gotten into making fonts, and though I'm just getting into selling them, I've been making them off and on for the past few years so I still consider myself an amateur.\n\nIn any case, I would have to say that I like the method in which I've seen several people release fonts: the basic one free and the remaining styles as paid (Ray Larabie comes to mind with this method) or alternating free and paid fonts (Nate Piekos for this one). But I do agree that in the day and age when being an illustrator is harder and harder to live by (especially with Google's recent \"gimme free art\" stunt), charging for fonts is perfectly reasonable.\n\nAnd it goes without saying that I'm also looking at many of the suggestions made by others here as well, thanks.\n\n"
    },
    {
      "time": "16 Jul 2009 — 11:04am",
      "content": "<cite>Thirdly because I am of the generation that does not believe in paying for information, be it music, movies, fonts, etc, and I don’t expect other people to pay for something I would not pay for myself (no matter how unethical this seems, it is unfortunately the truth). </cite>\n\nI trust your illustration will be given away for free as well.\n\n"
    },
    {
      "time": "19 Jul 2009 — 5:19pm",
      "content": "<cite>I trust your illustration will be given away for free as well.</cite>\n\nActually, I am of the belief that people can use my illustrations for their personal enjoyment in any way that they like, as long as they are not profiting off of them or claiming them as their own. When people buy prints of my work they are doing it to support me, and in terms of commissions I get more business than I can take, so I guess I must be doing something right. I'd also like to mention that 90% of my clients find my work when they are browsing for freeware fonts, so I do not regret for a second having made them free.\n\nI'm sorry if the existence of freeware fonts pisses you guys off because it takes away your business, but seriously, I posted here asking HOW to start charging for my fonts, and everyone seems to prefer telling me I'm an idiot for not charging for fonts than to tell me HOW to.\n\n"
    },
    {
      "time": "11 Oct 2009 — 3:42pm",
      "content": "Wow, just looked at some of your work, limetree, and I really love it.\n\nThere is pretty cool [font designer](http://web.archive.org/web/20150124161657/http:/new.myfonts.com/newsletters/cc/200909.html) who used to give his fonts away for free because he felt the same (thought his font designing was merely hobby). Now, he [and others](http://web.archive.org/web/20150124161657/http:/fontfabric.com/) are doing something like this:\n\nThey design entire font families, usually with stylish variants or complete sets with various weights and italics, and make the most basic font within the family free. The idea, I think, is that sure, a lot of people will grab only the freebies and have fun with those, but then they also have the enticing variants/character sets to chose from for a fair price.\n\nA free font \"embedded\" within a commercial set of fonts seems to skyrocket the popularity of the whole font family, usually thanks to the blogosphere promoting and featuring free fonts. Also look into using networks like Behance to promote your work. When I start designing typefaces, I think I will follow this strategy.\n\nI also got to echo your statement about being a part of a generation that doesn't see a value on information/data/music and would rather get free stuff immediately over paid stuff. But that mindset gets adjusted as one matures and becomes professional, especially towards software and intellectual property—you're not so much paying for the fonts to use them for fun as you are to use them in a commercial environment, and to cover your ass so you don't end up like NBC.\n\nGood luck!\n\n"
    },
    {
      "time": "16 Nov 2009 — 8:36am",
      "content": "if say (Sue Zafarana) has adapted an monospace version of Prima Sans they will have an Pro version with the bold, italic and the bold italic variants...\n\n"
    }
  ]
}
