{
  "id": "59734",
  "title": "Logo critique - does this have potential?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi All\n\nI am trading services with a just-graduated event planner - she is helping out on the day of my wedding and I will design a logo and business card for her. Budget-friendly for both of us!\n\nI have been sketching out some ideas and one of them I really like but would appreciate some critique before I send all the ideas to her. I showed an earlier version to my fiancé and he said it didn't read well, so I worked on it some more. I really like it, but I know the name and have been staring at it. I am wondering if I am beating a dead horse or if I am on to something. I appreciate all your wisdom and input!\n\nThanks!  \nNatalie\n\nPS. The name of the company is Humble Olive. It's a bit odd, I know. My fiancé said the earlier version read Humb Le Olive.\n\n| Attachment | Size |\n| --- | --- |\n| [medallion.jpg](http://web.archive.org/web/20130607090532/http:/typophile.com/files/medallion.jpg) | 65.72 KB |\n\n",
  "author": "natalie_F",
  "time": "7 Jul 2009 — 1:26pm",
  "uid": "40552",
  "comments": [
    {
      "time": "7 Jul 2009 — 1:42pm",
      "content": "I personally like it, in a total subjective, gorgeous letterform kind of way.  \nMaybe thicken the circular border slightly--but I like the rough sketched circle that isn't perfect.\n\nThe only part that bothers me is there's a bit of dead space in the center. With some tweaking of the letters that negative space wouldn't draw as much attention.\n\n"
    },
    {
      "time": "7 Jul 2009 — 1:48pm",
      "content": "Thanks for your input! I should have added to my earlier post that potentially I see the oval as a solid shape behind the type representing an olive. But the outline idea could be an option too, thanks.\n\nYes, I am aware of the dead space in the middle. I will try and work that out later. :-)\n\nNatalie\n\n"
    },
    {
      "time": "7 Jul 2009 — 5:31pm",
      "content": "I like this very much however I am reading Humb Le Olive too.\n\n"
    },
    {
      "time": "8 Jul 2009 — 3:55pm",
      "content": "I think the main reason that it might read 'Humb Le Olive' is the 'e's are lowercase while all the other letters are uppercase. So right away, the brain organizes the information—capital 'L' followed by lowercase 'e' makes it look like a separate word. It also doesn't help that the 'L' is much lower than the 'B' further separating it. The direction you're going is great though. Stay with it.\n\npenn\n\n"
    },
    {
      "time": "8 Jul 2009 — 6:37pm",
      "content": "looking really great so far. well done.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20130607090532/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "9 Jul 2009 — 6:02am",
      "content": "Interesting.\n\n"
    },
    {
      "time": "14 Jul 2009 — 2:58pm",
      "content": "Thank you all for your comments! I have made revisions - changed the \"B\" and \"L\" to lowercase and adjusted the spacing - and now I think (and I hope you agree) that it is working a lot better.\n\n ![](http://web.archive.org/web/20130607090532im_/http:/typophile.com/files/medallion_R_6120.jpg)\n\nThanks again!  \nNatalie\n\n"
    },
    {
      "time": "14 Jul 2009 — 4:16pm",
      "content": "Your ells look like long esses.\n\n- Lex\n\n"
    },
    {
      "time": "15 Jul 2009 — 6:11am",
      "content": "<cite>Your ells look like long esses.</cite>\n\nDon't agree. This looks great.\n\npenn\n\n"
    },
    {
      "time": "15 Jul 2009 — 1:00pm",
      "content": "that is pretty damn nice! I really like the un-perfectness.\n\n"
    },
    {
      "time": "15 Jul 2009 — 1:13pm",
      "content": "Charming! Top left of H might look a touch cramped.\n\n"
    },
    {
      "time": "15 Jul 2009 — 3:51pm",
      "content": "I WANT A HUMBLE OLIVE!! One that stays on my pizza slice\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20130607090532/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "15 Jul 2009 — 4:12pm",
      "content": "very nicely done. i also love un-perfectness, it add a human side.\n\n"
    },
    {
      "time": "17 Jul 2009 — 8:32am",
      "content": "Thank you everyone for your comments!\n\nI have shown the logo to the client with a few other options. She was really happy with the choices I gave her. Not sure if she'll pick this one as she really like the another one as well.\n\nI appreciate SO MUCH having this forum available. The ability to get input, advice and critique is so valuable.\n\nthanks again!\n\nNatalie\n\n"
    },
    {
      "time": "19 Jul 2009 — 4:03pm",
      "content": "can we see the others too?\n\nI'm left wanting more of your work! MOOOOORE!\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20130607090532/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "27 Aug 2009 — 12:35pm",
      "content": "Hello!\n\nThe client loved my logo concept, so I have been working at digitizing it. Here it is... thoughts?\n\nThanks!\n\n ![](http://web.archive.org/web/20130607090532im_/http:/typophile.com/files/medallion_final_6710.jpg)\n\n"
    },
    {
      "time": "27 Aug 2009 — 12:44pm",
      "content": "Beautiful work.  \nI really like how the top swirl of the \"l\" in humble, begins to look like the dimple of an olive.  \nI wonder of the letterforms could start to take on the rest of the form of an olive—more specifically the roundness.  \nIf you did so, then you could loose the green shape and have the logotype take on \"olive-ness\"  \nDoes that make any sense?\n\nIt's really nice work. Olive it!\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:10pm",
      "content": "My only complaint is that it somewhat loses a bit of the charme of the sketched one.\n\n"
    },
    {
      "time": "27 Aug 2009 — 2:35pm",
      "content": "lovely!!!\n\nThis organicness of the first is lost\n\nThe M can read as a J\n\n"
    },
    {
      "time": "27 Aug 2009 — 2:57pm",
      "content": "Slightly rounding the corners will recover much of it, I think. (Top of M looks especially mechanical.)\n\n"
    },
    {
      "time": "28 Aug 2009 — 6:44am",
      "content": "It's absolutely gorgeous and very envy worthy. I wish I could draw type like this!\n\n"
    },
    {
      "time": "28 Aug 2009 — 7:59am",
      "content": "This is spectacular.\n\nSome ideas:\n\nI would go with marcdavid and eliason and take an even closer look at the roundings. I think that the 'O' is very important for the overall impression the artwork is communicating. To support the olive-shaped background it would be nice to see it a little rounder. I also highlighted the other areas where I would make it a bit rounder.\n\nNevertheless this looks awsome and I would like to get my events planned by someone who's represented by this piece of art.\n\n"
    },
    {
      "time": "28 Aug 2009 — 10:58am",
      "content": "to clarify my earlier thought— i really meant taking on the roundness of an olive as in volume.  \nI know it's a quite an investment to explore, but it may be very interesting. although the letterforms you've designed are quite interesting themselves.  \nMaybe shifting the cross bar down in the H could help with the balance of that letterform. following is an illustration of my earlier comment.\n\nit's a very nice mark. where will the event planner be located?\n\n ![](http://web.archive.org/web/20130607090532im_/http:/typophile.com/files/volume_6498.png)\n\n"
    },
    {
      "time": "28 Aug 2009 — 11:10am",
      "content": "here's a good piece that's similar.\n\n[http://www.apartmenttherapy.com/sf/artwork/home-sweet-home-091994](http://web.archive.org/web/20130607090532/http:/www.apartmenttherapy.com/sf/artwork/home-sweet-home-091994 \"http://www.apartmenttherapy.com/sf/artwork/home-sweet-home-091994\")\n\n"
    },
    {
      "time": "28 Aug 2009 — 12:29pm",
      "content": "Thank you everyone for your input. I agree that it has lost something from the sketch and I have worked a bit at rounding the edges. I want to work on it a bit more, but I won't have anything to show for a few weeks... as I said in my first post, the event planner is helping me with my wedding – which has arrived! I'll be off for the honeymoon until mid-September... and then I'll work on it again.\n\nThanks very very much for your lovely comments, it has boosted my confidence!!!\n\nNatalie\n\n"
    },
    {
      "time": "28 Aug 2009 — 5:49pm",
      "content": "oops ... i forgot to attach the screenshot in my previous post.\n\n ![](http://web.archive.org/web/20130607090532im_/http:/typophile.com/files/medallion_final_6710_3677.jpg)\n\n"
    }
  ]
}
