{
  "id": "59775",
  "title": "Cantarell",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I just published [Cantarell](http://web.archive.org/web/20150414163725/http:/abattis.org/cantarell), a free-as-in-freedom font.\n\nHarsh comments especially welcome :-)\n\n",
  "author": "abattis",
  "time": "8 Jul 2009 — 12:25pm",
  "uid": "16849",
  "comments": [
    {
      "time": "8 Jul 2009 — 12:56pm",
      "content": "Thank you!  \nit's very good.\n\n"
    },
    {
      "time": "17 Jul 2009 — 8:11am",
      "content": "Well Dave, you seem to have a good start with Cantarell. I like the character of this font. It seems very clean and easy to read.\n\nHowever (and you knew it was coming), many of the curves just seem wrong. It's not exactly your fault, either. It has to do with the lack of precision when working with FontForge's Spiro capabilities. I would recommend converting the curves back into cubic splines and then manually fine-tuning them. This will help with the color and evenness of the glyphs in the font, and it will make it easier to read. For example, the 'a' and 'e' caught my eye first because the curves seemed especially lumpy. At certain points each glyph appears either overly wide or overly skinny.\n\nWhen looking at the characters beyond Basic Latin, I noticed a few irregularities. I think that the small letter eth (ð) could benefit from some reworking. A good article to look at would be [this one](http://web.archive.org/web/20150414163725/http:/briem.ismennt.is/2/2.11/2.1.4.eth.htm). A few diacritics could use some touch-ups as well, such as `breve`, `hungarumlaut`, `macron`, and `ogonek`.\n\nOn a less-significant/purely-technical note: it would be more correct to rename your 'italic' faces as 'oblique' faces because the style of the font has not been changed to accommodate the standards of italic typefaces. If you want to make an italic version, more is needed than just slanting the regular face.\n\nI am not the most experienced typophile, and I'm sure someone else could chime in and provide more comments but I hope this helps.\n\n"
    },
    {
      "time": "17 Jul 2009 — 2:11pm",
      "content": "Wesley, thanks for your kind comments :) I'd dearly appreciate a diagram of where precisely you feel the curves are lumpy, wide or skinny. I fully acknowledge that the diacritics and family members need much more work (and you are quite right, really I should call the oblique members such, as just updated the site to refect this :-)\n\n"
    },
    {
      "time": "19 Jul 2009 — 6:42am",
      "content": "I second Wesley's advice about the different curve types. Each curve type lends itself to a certain curve \"flow\", and when converting twice (from Spiro → cubic → quadratic splines) without any corrections inbetween, you are sure to end up with uneven curves and too many points.\n\nAbout the wide and skinny parts: I think you've got the stroke contrast not quite right in many of the glyphs. Try writing your letters with a broad-nib pen to see where the thick and thin parts end up. This image shows the original letters on the left and my corrected versions on the right, with slightly increased stroke contrast to make it clearer:\n\n ![](http://web.archive.org/web/20150414163725im_/http:/typophile.com/files/cantarell_6081.png)\n\nThe red ellipse represents the broad nib. Of course you have to apply optical corrections to the stroke widths where needed later, but you get the idea ...\n\nHow important is hinting on the Google Android platform, which you target? On Windows, TT fonts without hinting look pretty bad. Especially for screen fonts, there should be good hinting. But that's something to care about later, first try to improve on the glyph designs.\n\n"
    }
  ]
}
