{
  "id": "59786",
  "title": "Type Design Graduate Programs?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm curious to know what schools folks feel have the strongest graduate programs in type design (primarily in the US but also the UK). I'm personally not looking to apply in the immediate future, just interested in learning about places to consider down the line.\n\nAlso, what are people's thoughts/arguments for the necessity of a concentrated masters in typography to practicing the profession? Are there shorter-term certificate programs out there you think would be as beneficial as a two-year graduate course?\n\n",
  "author": "Andy Babb",
  "time": "8 Jul 2009 — 7:09pm",
  "uid": "44822",
  "comments": [
    {
      "time": "8 Jul 2009 — 7:42pm",
      "content": "Again with this? Didn't you troll the archives?\n\nIf you wanna be a type designer, just start designing type. Go draw yourself 40 or 50 fonts and if there are still things you haven't figured out, either go to grad school or find another job.\n\n"
    },
    {
      "time": "8 Jul 2009 — 8:31pm",
      "content": "U o' Reading or KABK in Den Haag (they're both relatively short-term programs). I agree with James on both points too, you're going to have to be more resourceful and start making stuff now. Even the successful people who have attended those programs were already making somewhat decent stuff before.\n\n"
    },
    {
      "time": "8 Jul 2009 — 8:34pm",
      "content": "Read the archives. There isn't really a dedicated type design program in the US. The only program in the UK is the one at Reading. I believe it is a faster way to boost your skills than practicing on your own, but as you see from James' comments above, that is not a universal opinion.\n\nI agree that you need to have spent some noticeable time up front doing type design and studying before going to grad school. You'd probably need to have done so just to get in, anyway.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "8 Jul 2009 — 8:35pm",
      "content": "Don’t forget about TypeCon! I’ve learned oodles from attending the classes and lectures.\n\n"
    },
    {
      "time": "9 Jul 2009 — 2:09am",
      "content": "I think a MA in type design will significantly accelerate your learning of the craft, and both T&M and MATD are excellent courses that are quite different. But then, I'm just finishing the Reading MATD, and I think the course is AWESOME, so I'm a little biased :-)\n\n"
    },
    {
      "time": "9 Jul 2009 — 2:14pm",
      "content": "Thanks everyone for your comments and sorry for not searching prior threads more thoroughly before posting!\n\n"
    }
  ]
}
