{
  "id": "5982",
  "title": "Type 101",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi Typophiles,   \n   \nWhen you went to art/design school and had the opportunity to take typography classes, was there any type things you wished they had mentioned now that your doing the type/design thing for real?   \n   \nThanks,   \n   \nMichael\n\n",
  "author": "Michael Surtees",
  "time": "10 Jan 2003 — 10:50am",
  "uid": "735",
  "comments": [
    {
      "time": "10 Jan 2003 — 12:19pm",
      "content": "Sorry, I learned very little from those classes, only enough to affect how I used type in design and of course, the lost art of specing type for a typesetter - I went to school in '91 mind you . . .   \n   \nI wished they would have taught me about the color of type, an understanding of the source of glyph shapes (eg. how the lowercase r relates to the n , m and h), and how balanced weights and ink traps should be employed in glyph design for both on screen and printed applications.   \n   \nDo you teach a typography class?   \n   \nIf so, I also wish they would have mentioned with enough commitment and effort this is profession you can do full-time and earn a living at.   \n   \nStuart :D\n\n"
    },
    {
      "time": "12 Jan 2003 — 9:52am",
      "content": "my typography classes rocked with one Mrs. Janice Klassen. The school fliped her to another dept. after the 2 year, but her cirriculum and the schedules she organized were amazing. I don't think there was anything she missed. Every student loved her classes, cursed her project dealines, pop quizzes, and in class assignments scaling paragraphs of 8pt garamond to .17pt, by hand while she peeked over our shoulders pointing out spelling errors and suggesting the x-height was way off 30 minutes before class ended.   \n   \nNow 3rd year, the new profs ended up covering the same content Klassen had already taught, even though we had mentioned it over and over. Sneaking suspicion that they didn't know anything more.   \n   \nI had expected to learn how to implement everything we had learned. Technical aspects like whats Type 1, Type 3, TrueType, Postscript, Magnectic Pens and all that. What programs do you make typefaces with & how (Klassen taught us design, no computers). Legalities and sale/contracting info. Current affairs, hotbeds, trends could have been useful. Instead history, bowls, weight, and descenders were discussed while we all fell asleep.\n\n"
    }
  ]
}
