{
  "id": "5984",
  "title": "From pixels to Outline",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi,   \n   \nMost people seem to make pixels versions of fonts after they've made outline version - for me   \nit's the other way ... and i need some advise ..   \n   \nI've redrawn some of my old Amiga pixels fonts from the early 90's in Bitfonter - and now i want to make the outlines (in fontlab?)so people can use them on screen.   \n   \nI have Fontlab/bitfonter/scanfont - but the outlines that FL makes no fit at all - the lines only fit the bitmap shapes loosely ..   \n   \nhelp is need!\n\n",
  "author": "henrik",
  "time": "9 Aug 2004 — 1:42am",
  "uid": "4410",
  "comments": [
    {
      "time": "9 Aug 2004 — 11:20am",
      "content": "I fellow Amigan!   \n   \nSo you want to end up with an outline font that matches your pixelfont? If you want the outline font to be blocky, it shouldn't be too hard with the right settings in FL's autotrace. But if you want a \"smooth\" outline font to be the result, you'll have to do it by hand.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Aug 2004 — 4:16am",
      "content": "Actually I Would Like The pixels to be converted to outlines exactly like they are (square)- so the font remain the pixel look even as outlines - the settings in fontlab to convert so it fits prober i just can't seem to get right   \n   \n - help still needed!\n\n"
    },
    {
      "time": "10 Aug 2004 — 4:55am",
      "content": "Henrik,   \n   \nFontFlasher gives you the opportunity to create exact square outlines from pixels: [http://www.fontlab.com/html/fontflasher.html](http://web.archive.org/web/20131108074556/http:/www.fontlab.com/html/fontflasher.html)   \n   \nRegards,   \nAdam Twardoch   \nFontlab Ltd.\n\n"
    },
    {
      "time": "11 Aug 2004 — 10:55am",
      "content": "I've always drawn outlines from bitmap, (or from bitmap size ranges) first with a reverse-of-hinting approach, i.e. where can/should I place that outline so that hints CAN get to that bitmap (remembering e.g. that you have 63/64ths of a pixel variation for the body width of all but e.g. the i's), and then, what does the result look like and how do I get a decent outline font out of it, and finally if you need to, reconciling whatever you can't get in the outline with either the olde mental delta, or change the damn bitmap. At least that is how I would do it if I had to \"make the outlines so people can use them on screen.\" [presumably to look the same as the bitmaps].Hope that helps..\n\n"
    }
  ]
}
