{
  "id": "59878",
  "title": "Roddy Piper 'Hot Rod' Font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Does anyone know what font is used for the 'Hot Rod' writing in this picture?\n\n ![](http://web.archive.org/web/20141201055520im_/http:/typophile.com/files/rowdy-ruddy-piper_5338.jpg)\n\nMuch appreciated.\n\n",
  "author": "Welshy",
  "time": "12 Jul 2009 — 7:43am",
  "uid": "40444",
  "comments": [
    {
      "time": "12 Jul 2009 — 11:59am",
      "content": "This is not a font:  \n- The letters are in 3D design _and_ overlap. You can have either in a font but not both.  \n (Fonts are no 3D objects)  \n- The two O's are similar but different.\n\nMaybe the free font Xanax will do for you.\n\n"
    },
    {
      "time": "12 Jul 2009 — 1:13pm",
      "content": "Actually, while the two Os are different, one looks like the other one but squooshed. So, it COULD be a font (or based on a particular typeface).\n\nThe 3D effect is certainly something one can do in a font (it's not actually 3D) and the overlap could easily be achieved via negative letterspacing. Not saying it \\*is\\* a font, but those two things don't preclude it from being one.\n\n"
    },
    {
      "time": "13 Jul 2009 — 12:28am",
      "content": "Take a look at the thorn inside the bowl of the O - to me it looks larger in the \"condensed\" version. It should be smaller if it was simply condensed, shouldn't it?\n\nAs for 3D: Of course you can imitate 3D effects in a font, just like you can do perspective in a drawing on a flat piece of paper. But as soon as two such letters overlap the effect is gone. The rendering engine does not know which letters you mean to have \"on top\", so the outlines of your letters \"below\" will shine through. Which is obviously not the case in the image. (Remember, I wrote \"You can have either in a font but not both.\")\n\n"
    },
    {
      "time": "13 Jul 2009 — 11:16am",
      "content": "Cheers for the help guys. Wasn't sure if it was a font or not, it's just i've had no luck finding the above t-shirt so this was my last resort!\n\n"
    },
    {
      "time": "13 Jul 2009 — 12:54pm",
      "content": "\"It should be smaller if it was simply condensed, shouldn’t it?\"\n\nI can't really tell from the photo. Just a theory that it could be a modified O but you may certainly be correct as well.\n\n\"letters “below” will shine through. Which is obviously not the case in the image.\"\n\nA typeset line, no, but one could easy typeset the line, convert to outlines and fill and overlap as much as one would like.\n\n"
    },
    {
      "time": "13 Jul 2009 — 1:27pm",
      "content": "Based on the (assumed) age of the image, that would take way more work than just drawing it by hand.\n\n- Lex\n\n"
    },
    {
      "time": "13 Jul 2009 — 8:56pm",
      "content": "Gotta go to the source: [http://www.rowdyroddypiper.com/shop.php](http://web.archive.org/web/20141201055520/http:/www.rowdyroddypiper.com/shop.php \"http://www.rowdyroddypiper.com/shop.php\")\n\nStuart :D\n\n"
    }
  ]
}
