{
  "id": "59880",
  "title": "Comic Sans and Papyrus on the same poster - enjoy!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Yesterday I was strolling at a local summer festival with hundreds of vendors in their booths. I couldn't help observing graphics and pointing out many instances of the dreaded (to us) Comic Sans and Papyrus fonts (especially the latter) on logos and business cards, banners, adverts, etc.\n\nI spotted an advert with BOTH! - a first for me. I know y'all will appreciate this. Here it is:\n\n ![](http://web.archive.org/web/20140624024413im_/http:/typophile.com/files/comicsans-papyrus-8i_6036.JPG)\n\nMy husband has limited tolerance for my diatribes about unbearably overused fonts and says: \"So what? As long as it looks nice.\" etc.\n\nThat troubles me because it is fundamental to my identity as an artist to value creativity and originality over banality and mimicry.\n\nIt got me thinking that many people don't recognized \"overused\" as a pointed criticism.\n\nTo them, if something is used a lot, that means it's popular. Popular = good = accepted standards = something I should do too = a feeling of belonging.\n\nThat explains the blank looks I often get when pointing out that something, anything, is unbearably overused.\n\n",
  "author": "dinazina",
  "time": "12 Jul 2009 — 10:46am",
  "uid": "21120",
  "comments": [
    {
      "time": "12 Jul 2009 — 11:12am",
      "content": "\\> That explains the blank looks I often get  \n\\> when pointing out that something, anything,  \n\\> is unbearably overused.\n\nah yes, the lonely pain of the sensitive artist...\n\n-bowerbird\n\n"
    },
    {
      "time": "12 Jul 2009 — 1:09pm",
      "content": "It's too bad there wasn't some Arial on there to finish the overall effect.\n\n"
    },
    {
      "time": "12 Jul 2009 — 1:13pm",
      "content": "Overused is not a valid criticism, it’s a pretentious criticism leveled by people who like to think that their less popular preferences are better just for being less popular. If we applied that criticism to music most of what’s ever been written would be of no value because so much of it is built on the same simple foundations. Designers who gripe about typefaces being overused need to realize that they sound just like indie music fans who can’t shut up about how they liked a band _before_ they were cool.\n\nPoorly used, however, is a valid criticism. And this is an excellent example of how two fonts can be very poorly used. Neither is appropriate for this kind of signage, nor have they been typeset well. The images are uninspired, the color palette thoughtless, and the layout appears to be recycled from a bad take-out menu. And it’s probably an inkjet print that will fade quickly and look like hell when it does. That’s why this sign is so much worse that the myriad good signs in Helvetica that we don’t gripe about so much, not matter overused Helvetica is.\n\n"
    },
    {
      "time": "12 Jul 2009 — 2:01pm",
      "content": "James you are right, but when I say \"overused\" it also implies poorly used, since countless amateurs do their own graphics now.\n\nOveruse of Helvetica is not as annoying (to me) because it's not a \"novelty\" font and fits in quietly, without crying \"Why am I here? I don't belong here!\"\n\nI saw one business card recently which used Papyrus appropriately for the subject, and looked rather elegant. But I still winced at the sight. Considering there are hundreds of suitable fonts NOT done to death.\n\nI realize that inexpertise is fine with the majority. Most people do have a specialty or area of expertise in which they instantly recognize and disapprove of hack work, while most others are oblivious.\n\nThanks to my lurking on this site and others, I now recognize typographical hack work; at one time I wouldn't have noticed.\n\n"
    },
    {
      "time": "12 Jul 2009 — 4:12pm",
      "content": "This is the culmination of the naive typography typical of small, home-grown businesses that do all their own work. I am sure the fonts fall into the \"what-we-have-on-our-computer\" set. The street vendor is just trying to make a buck on the cheap.  \nActually, work this naive has a charm I can forgive from a mom&pop shop. I am not saying it is good design but that it is not criminal looking as it might be if it were done by a larger corporation with more budget and experience that should know better.\n\nIt reminds me of tiny family businesses across the land and it makes me smile. It brings back memories of my uncle Gus's homemade candy store and his self-made posters--badly hand painted signs but the hand dipped chocolates were to die for :-)\n\nYasou, Uncle Gus! May you rest in peace.\n\nChrisL\n\nThanks, Dina, for the memories!\n\n"
    },
    {
      "time": "12 Jul 2009 — 4:16pm",
      "content": "Computers have ruined diy posters!  \nI can really enjoy that mom & pop naitivity as well, but like dinazina I dread the sight of another Comic Sans.\n\n"
    },
    {
      "time": "12 Jul 2009 — 5:15pm",
      "content": "This one, to me, really is charmingly naive. No Comic Sans, no Papyrus, no computerized bad taste, just hand-lettered oddity.\n\n ![](http://web.archive.org/web/20140624024413im_/http:/typophile.com/files/sign-jewelrepair_3491.jpg)\n\n"
    },
    {
      "time": "12 Jul 2009 — 5:25pm",
      "content": "Exactly the kind of thing I meant!\n\n"
    },
    {
      "time": "13 Jul 2009 — 5:58pm",
      "content": "That's terrific. I wonder if the owner is Turkish and likes his [Is dotted](http://web.archive.org/web/20140624024413/http:/en.wikipedia.org/wiki/Dotted_and_dotless_I).\n\n"
    },
    {
      "time": "13 Jul 2009 — 6:33pm",
      "content": "_Overused is not a valid criticism._\n\nIn theory no, but in practice it's another matter.  \nIf everyone uses the same materials and tools without much imagination (and even the best of us can't hit a home run every time we come to the plate), then everything starts to look the same. Working with common materials, people fall into ruts.  \nBut working with little used typefaces, you're more likely to come up with something that looks different, not just because the typeface is different, but because there are less clichés to fall back on in the way that it's used.\n\n"
    },
    {
      "time": "14 Jul 2009 — 10:40am",
      "content": "In any event if you use a less-known typeface you probably stand a better chance of catching someone's eye.\n\n"
    },
    {
      "time": "14 Jul 2009 — 12:57pm",
      "content": "Overuse is not a poor trait in and of itself, but it makes poor use much easier. When a typeface like Arial, Comic Sans, or Papyrus enters ubiquity because of its accessibility, the vast majority of its applications are poor and cheap-looking. Thus, those typefaces can no longer escape the connection with unprofessional and cheap design that they carry, and it becomes increasingly difficult to use them well.\n\nThe reason that other typefaces that are probably overused (most notably Gotham and Helvetica) escape (mostly) this same criticism is because the majority of their applications are professional and well-done, because they are not accessible to just anyone who has a computer (although Helvetica comes bundled with Macs, the vast majority of computer users, and especially businesses, still use Windows boxes).\n\nI'd be interested to see what the type community thinks of Calibri ten or fifteen years from now. It certainly doesn't carry the same baggage as Arial, and it's certainly an attractive font now, but is it going to be so ubiquitous and so often poorly used that it will carry the same air of unprofessionalism as Arial?\n\n(Sorry to divert the conversation away from specifically Comic Sans and Papyrus, but I think that Arial is the greatest victim of poor use through overuse. I've gone so far as to tell people, \"There is no application of Arial where something else would not be more appropriate, unless you're trying to be intentionally unprofessional.\" I think there are still some viable uses of Comic Sans and Papyrus.)\n\n"
    },
    {
      "time": "14 Jul 2009 — 7:26pm",
      "content": "I'm still waiting for any of my fonts to appear on porn. Just like Comic Sans, Papyrus and Impact.\n\nImpact: not so bad for porn.\n\nsteve mehallo  \ntinyurl.com/mehallofonts  \nmehallo.com\n\n"
    },
    {
      "time": "14 Jul 2009 — 7:44pm",
      "content": "yeah. it could use some work. but it's clear and readable, and at the end of the day, i'd still buy a cone.\n\n"
    },
    {
      "time": "14 Jul 2009 — 7:54pm",
      "content": "<cite>I’m still waiting for any of my fonts to appear on porn.</cite>\n\nDon’t forget Mistral. It’s the official font of bad bukkake packaging. Or so I’ve heard.\n\n"
    },
    {
      "time": "15 Jul 2009 — 7:44am",
      "content": "I know this has been discussed to death here. But only recently did I realize that Papyrus is the only installed font that conveys \"elegance\" to the untrained eye. This elegant look, they believe, classes up everything: frozen yogurt, hemp sneakers, computer services. To their eye, it really is distinctive.\n\nAt business networking events, I frequently spy Papyrus-adorned cards. Like this: The website is very minimal, but there's the Papyrus on black: [**Jabez Productions**](http://web.archive.org/web/20140624024413/http:/www.jabezproductions.com/)\n\nSo, elegant = Papyrus. Friendly = Comic Sans. Official = Times Roman. Everything else = Arial. (Combining the first two: Elegant AND friendly??)\n\nI redesigned a website for a Bed & Breakfast with a calligraphic title, headers, and navbar that really were elegant in: [**Kallos**](http://web.archive.org/).  \nThen the owner insisted all text be in Comic Sans. I explained it clashed with the look of the headers. I told her \"friends don't let friends use Comic Sans.\" She insisted stubbornly - this was her \"signature font\". I wince when I view the pages, but she's very pleased\n\nFor her printed lit, I convinced her, after much persuasion, to let me use Maiandra for the text instead of Comic Sans.\n\n"
    },
    {
      "time": "15 Jul 2009 — 8:36am",
      "content": "Haha, what a nightmare! I'd love to see the site!\n\n"
    },
    {
      "time": "16 Jul 2009 — 1:24am",
      "content": "Even though this topic has been discussed to death I really enjoyed reading its discussions here. Today I came across a [construction site](http://web.archive.org/web/20140624024413/http:/www.beediegroup.ca/) that's \"Helping Build Your Future\" with Comic Sans, found it grossly amusing. ;)\n\n<cite>I told her “friends don’t let friends use Comic Sans.” She insisted stubbornly - this was her “signature font”. I wince when I view the pages, but she’s very pleased</cite>\n\nThis would actually be a very interesting topic to discuss: What to do with the clients like that? In my case, I have a client who's using Curlz MT as her 'signature font'. She used to have it everywhere, now after I finally re-designed her site, she just kept it in her logotype (used it for many years now). Any advice? How can I convince her to re-brand, and should I?\n\n"
    },
    {
      "time": "16 Jul 2009 — 2:38am",
      "content": "The best part is that the only flavor available is vanilla.\n\n"
    },
    {
      "time": "7 Mar 2013 — 3:36pm",
      "content": "Yeah the solo vanilla is certainly a little lonely up there, which makes the type selection and the entire design even more fitting. I can trust it, the owner of the business probably designed it over a couple of evenings and they were possibly even very happy with it. Sometimes the vibe is just good. This sign tells me I am going to get a good deal.\n\nEdit nearly 4 years later: I like that I can see my old posts, but the poor punctuation was killing me.\n\n"
    },
    {
      "time": "16 Jul 2009 — 10:56am",
      "content": "You know, the only approach is I know is to tell the client that it makes them appear unsophisticated and let them know that there are designers out there that spend their free time posting messages about how unsophisticated this client is and that we make fun of and laugh at them every any chance we get.\n\nWe tell our friends about them and come up with all kinds of insults about how dumb, inferior and juvenile they are and how their picks are the equivalent of serving Spam at a wedding banquet and is that how they really want to represent their company??\n\nAnd I mention how the fashion magazines they read wouldn't use those fonts, so obviously they are so out of touch, they should start buying things from the Franklin Mint, should own a velvet Elvis painting (without the irony) and ... Well, typically at that point, they stop talking to me and it's all moot.\n\nThen their resolve kicks in and they insist to do it just to be dumb and spite me.\n\nI have a former client that PAID me for a logo just so he could kill it - had a new one made by a student; the new one has a major kerning problem - and he's really proud of it.\n\nSo ... I've got nothing.\n\nsteve mehallo  \ntinyurl.com/mehallofonts  \nmehallo.com\n\n"
    },
    {
      "time": "16 Jul 2009 — 12:05pm",
      "content": "True, this is not by any means an attractive design. An epic fail in that respect. BUT, this design is successful! It has accomplished what it set out to do which is to get people to want to buy frozen yogurt.  \nSounds good to me.\n\nrachel ortiz  \n [www.rortizdesign.com](http://web.archive.org/web/20140624024413/http:/www.rortizdesign.com/ \"www.rortizdesign.com\")\n\n"
    },
    {
      "time": "16 Jul 2009 — 3:02pm",
      "content": "\\>\\>BUT, this design is successful! It has accomplished what it set out to do which is to get people to want to buy frozen yogurt.\\<\\<\n\nYes, because Papyrus reminds me of the wisdom revealed by ancient scrolls unearthed on remote archeological digs in the Ethiopian desert...\n\nand then I start feeling parched...\n\nand imagining how refreshing a frozen cone or a honey-ginger lemonade would be...\n\nYes...it worked.\n\n"
    },
    {
      "time": "16 Jul 2009 — 3:30pm",
      "content": "metalfoot:  \n_It’s too bad there wasn’t some Arial on there to finish the overall effect._\n\nOr Helvetica.\n\n"
    },
    {
      "time": "17 Jul 2009 — 9:08am",
      "content": "lula\\_ what's your avatar? I see a big doglike tongue and a hairy chin - ugh. I am imagining you as a werewolf, who doesn't dare show us the rest of your face!\n\n"
    },
    {
      "time": "17 Jul 2009 — 3:23pm",
      "content": "I once designed a logo for a client — sent the first proof, made some revisions, sent the second proof — weeks went by and we hadn't heard a thing. We figured they backed out and we were never going to heard from them again. Then, about 3 months later, I'm watching TV and I'm like, “Hey! That's my logo!”. Naturally, we immediately sent them an invoice for the logo design. Now get this — instead of _paying_ us, they stop using our logo and pull a new one out of thin air that featured no other but Papyrus in all of its faux classy exoticism.\n\nMoral of the story: Make sure you rasterize your vector art during the proofing process.\n\n"
    },
    {
      "time": "17 Jul 2009 — 6:11pm",
      "content": "Mehallo, you should write comedy!  \n'Spam at a wedding bouquet', that's classic!\n\n"
    },
    {
      "time": "26 Jul 2009 — 6:24am",
      "content": "_lula\\_ what’s your avatar? I see a big doglike tongue and a hairy chin - ugh. I am imagining you as a werewolf, who doesn’t dare show us the rest of your face!_\n\nIt's me liking my scanner. :P\n\n"
    },
    {
      "time": "10 Oct 2009 — 8:01am",
      "content": "This is a summer festival, probably like a farmers market. Would a different typeface really sell more yogurt?\n\n"
    }
  ]
}
