{
  "id": "59892",
  "title": "logo font help",
  "forum": "Design",
  "tags": [

  ],
  "content": "My sincere apologies if this is not the forum for such a request. Came here because you guys are the pros ...\n\nI've just set up new business and looking for ideas for logo font type for my company name (Great font = great logo) \"Tudor&Company\" promotes brands through equestrian lifestyle marketing. Tudor name is known in my biz so have been advised to use it. Guess Tudor goes with \"heritage\" of elite equestrian lifestyle. Sounds a bit like \"Town&Country\" or \"Tiffany&Co\" which will ring true to the elite horse biz. Suggestions appreciated!\n\n[kimtudor@aol.com](mailto:kimtudor@aol.com)\n\n",
  "author": "<a href=\"/web/20120103163009/http://typophile.com/user/46063\" title=\"View user profile.\">kimtudor</a>",
  "time": "<br>",
  "uid": "46063",
  "comments": [
    {
      "time": "",
      "content": "<cite>Great font = great logo</cite>\n\nYou need to hire a designer.\n\n"
    },
    {
      "time": "",
      "content": "Happy to do so! How to pick a great designer?\n\n"
    },
    {
      "time": "",
      "content": "Tou can find designers in the phonebook, with Google, or at AIGADesignjobs.com, Corolflot, and other sites where designers showcase their work. [You can start with my portfolio ;)](http://web.archive.org/web/20120103163009/http:/jpad.biz/index.php?/project/logos/)\n\n"
    },
    {
      "time": "",
      "content": "Yes James I looked at your portfolio ;) Great work! And you are right I need to hire someone to take care of logo etc. Your design fees for logo, stationary, yadda yadda. I can pretty much tell that you are out of my tiny little budget range but doesn't hurt to ask! Feel free to email me at [kimtudor@aol.com](mailto:kimtudor@aol.com)\n\n"
    },
    {
      "time": "",
      "content": "@kimtudor\n\nTiny budget range? 25 years in the business... How much do you pay your lawyer and accountant? Your designer should be equally compensated. How can you not afford a good designer?\n\n"
    },
    {
      "time": "",
      "content": "Kim,\n\nYou can hire a graphic design student who still in school, check around your area to see if there was any design school, they would do anything for experience, and for $50 or so, but it won't be that great.\n\nIf you are serious about the business, then you should be serious about the image of your company. Paula Scher designed citibank logo for half million in couple minutes. Do you think it worth it? I would suggest spend a little bit more on the budget range, not to mention there are also fee for trademark, copyright and all that too. :)\n\nBut i think it would help to shop around, see who you can afford.\n\n"
    }
  ]
}
