{
  "id": "59890",
  "title": "ATypI: Mexico City 2009 (programme)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Received a few minutes ago:\n\n_The first cut of the Mexico City programme is now online.  \n [http://www.atypi.org/04\\_Mexico/40\\_timetables](http://web.archive.org/web/20131017131516/http:/www.atypi.org/04_Mexico/40_timetables)  \nDetails and presentation will improve; registration should be available in the next week or so.  \nLooking interesting: the first three days (the 'main conference') are in a single track with often short presentations. The last two days, which combine TypeTech and a series of longer workshops, has several things going on at the same time and the opportunity to engage in depth.  \n--  \nMark Barratt  \nText Matters_\n\n",
  "author": "Cristobal Henestrosa",
  "time": "12 Jul 2009 — 4:04pm",
  "uid": "7508",
  "comments": [
    {
      "time": "13 Jul 2009 — 2:02pm",
      "content": "Some texts should be fixed or updated, but it gives a clear idea of it. Anyone comments?\n\n"
    },
    {
      "time": "13 Jul 2009 — 3:33pm",
      "content": "I think it will be a great conference. But I'm not sure what sort of comments you are hoping for. Are you just wondering who is going?\n\n"
    },
    {
      "time": "13 Jul 2009 — 4:08pm",
      "content": "Thanks for answering, Tiffany (I was beginning to believe that I was alone on this, ha). Well, I was hoping for any kind of comments: who is coming would be fine, but I’d like to hear what do you people think about speakers, themes, workshops…\n\nI don’t know, maybe I am the only guy who has waiting for this info and just wanted to share (though the info is incomplete by now, so it may be early to decide if you are going to attend).\n\n"
    },
    {
      "time": "14 Jul 2009 — 11:55am",
      "content": "I thought John Hudson had started a thread about ATypI Mexico. I can't seem to find it.\n\nWell, I think it looks like a great conference, as I said, and I know Roger Black and the rest of the board have been hard at work on this one for quite some time.\n\n"
    },
    {
      "time": "16 Jul 2009 — 2:56am",
      "content": "Hola Cristobal,\n\nIt looks like a fantastic conference! I really would like to be there.\n\nSpecially with You, Gonzalo, Paco, Gabriel and Quique. Enjoy it!\n\nun abrazo\n\np rovalo\n\n"
    },
    {
      "time": "16 Jul 2009 — 3:48am",
      "content": "Looks like a great conference, I'll be there! I am planning on wearing a huge embroidered sombrero and a red, green and white FB poncho if anyone's looking for me;=)\n\nCheers!\n\n"
    },
    {
      "time": "16 Jul 2009 — 10:45am",
      "content": "Hope to see those on sale at fonbureau soon!\n\n"
    },
    {
      "time": "24 Aug 2009 — 12:25pm",
      "content": "I shall be there with FontShop cohorts! Some good visitor info in this SF Chronicle story: [The savvy have little to fear in Mexico City](http://web.archive.org/web/20131017131516/http:/www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2009/08/21/TREF199PFD.DTL&type=travel)\n\n"
    },
    {
      "time": "24 Aug 2009 — 12:56pm",
      "content": "Also registration has now opened... [http://www.atypi.org/store/?section=2009](http://web.archive.org/web/20131017131516/http:/www.atypi.org/store/?section=2009 \"http://www.atypi.org/store/?section=2009\")\n\n"
    },
    {
      "time": "24 Aug 2009 — 6:22pm",
      "content": "And the [programme](http://web.archive.org/web/20131017131516/http:/www.atypi.org/04_Mexico/40_timetables/index_html?date=20091026) is updated, too.\n\nList of speakers [here](http://web.archive.org/web/20131017131516/http:/www.atypi.org/04_Mexico/20_speakers).\n\n@Stephen: great link, thank you. Good to know you are coming.\n\n"
    },
    {
      "time": "9 Sep 2009 — 6:50am",
      "content": "A map of important conference venues, interesting locations and nearby hotels is now available on [Google Maps](http://web.archive.org/web/20131017131516/http:/maps.google.com/maps/ms?ie=UTF8&hl=en&msa=0&msid=110818961748813485562.0004731b2e00124a3309e&z=13).\n\n"
    },
    {
      "time": "22 Sep 2009 — 10:57am",
      "content": "Tickets available and updated stuff.\n\nWaiting for the always–entertaining Erik Spiekermann to confirm/announce the subject of his talk and really looking forward to hearing yours Cristobal!\n\nSaludos,\n\n"
    },
    {
      "time": "22 Sep 2009 — 11:37am",
      "content": "Karen Parry and I just booked our hotel (Gillow) - I am so excited so see everyone! Arriving a couple of days early and of course staying a few days late.\n\nz\n\n"
    },
    {
      "time": "22 Sep 2009 — 12:46pm",
      "content": "I'm going to travel to this other side of the world too. Really looking forward – also to meeting some more of you guys/girls in person!\n\n"
    }
  ]
}
