{
  "id": "59906",
  "title": "Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello,\n\nI am designing a logo for a foodservice company(professional kitchen equipment, refrigerators, reception desks etc.) any critique is welcomed, these are some ideas that i refined I am thinking if I should go with more cursive lines?\n\n ![](http://web.archive.org/web/20121128170355im_/http:/typophile.com/files/Univerzal_logo_4735.jpg)\n\n ![](http://web.archive.org/web/20121128170355im_/http:/typophile.com/files/Univerzal_logo2_3564.jpg)\n\n ![](http://web.archive.org/web/20121128170355im_/http:/typophile.com/files/Univerzal_logo3_6676.jpg)\n\n",
  "author": "rzen",
  "time": "13 Jul 2009 — 7:22am",
  "uid": "28388",
  "comments": [
    {
      "time": "13 Jul 2009 — 8:31am",
      "content": "Subtle shading and hairlines will suffer when the mark is photocopied, faxed, printed lo-res etc.\n\n"
    },
    {
      "time": "13 Jul 2009 — 8:42am",
      "content": "Maybe a food-service professional would recognize what the picture is, but to me it's too abstract--just a corner with the four little round things.  \nThe color scheme and the typography say _clean_ and _high-tech_, but they don't say _food_. I get kind of a biotech or pharmaceutical vibe from this, although that's partly because the name _Univerzal_ sounds like a prescription drug. I realize they won't let you change the name of the company.\n\n ![](http://web.archive.org/web/20121128170355im_/http:/typophile.com/files/aramark_5373.jpg)\n  \nHere's the logo of one of the biggest food-service outfits in the US, Aramark (possibly somebody Univerzal would like as a client). They've been using this logo for 15 or 20 years, so it's not exactly on the cutting edge, but it manages to look modern and techie without looking cold and antiseptic. \n"
    },
    {
      "time": "13 Jul 2009 — 9:37am",
      "content": "I like the type/color combo in the first one. But the imagery just is the wrong style to go with the type. It's too light/subtle and likely (as stated) too literal.\n\n"
    },
    {
      "time": "13 Jul 2009 — 10:50am",
      "content": "I really like the way the corner looks but like others say, without knowing what the company does (even though it does say under the logo) it doesn't connect right away.\n\n"
    },
    {
      "time": "13 Jul 2009 — 11:20am",
      "content": "In addition to what others have said, the last two versions should probably have the type rendered in the same 3D perspective as the corner of the appliance. Otherwise it just looks odd.\n\n"
    },
    {
      "time": "14 Jul 2009 — 12:51am",
      "content": "Thank you all for the feedback.  \nI see that Univerzal sounds to pharmaceutical(antiseptic lol) but this firm is located in macedonia and Univerzal means - Universal. So the name implies something abstract and well- universal so it can have multiple meanings and many applications. This - [http://univerzal.com.mk/](http://web.archive.org/web/20121128170355/http:/univerzal.com.mk/) is the old website of this company, and these are some websites from the region that make similar products [http://frigosan.com.mk/pocetok\\_en.html](http://web.archive.org/web/20121128170355/http:/frigosan.com.mk/pocetok_en.html) [http://frigobox.com.mk/](http://web.archive.org/web/20121128170355/http:/frigobox.com.mk/), portionox [http://portinox.es/english/home.html](http://web.archive.org/web/20121128170355/http:/portinox.es/english/home.html) is an international brand in this kind of equipment, so as we can see the snowflake is the main symbol which represents the refrigerators. I wanted to go in another direction to symbolize all the different products this firm has (not just cooling equipment) so the angle should be representing the angle of some appliances (stove, refrigerator, whatever...).  \nI am also confused aluminium is saying it is to literal and unlejman is saying that it doesnt conect right away. I need some symbol to represent a lot of many equipments this firm makes. Anyway thank you all for the feedback I will post more ideas.\n\n"
    },
    {
      "time": "14 Jul 2009 — 9:40am",
      "content": "There's nothing wrong with a simple typographic logo.\n\n"
    },
    {
      "time": "18 Jul 2009 — 12:47am",
      "content": "Ok. Let's make something clear here. Your image of some sort of kitchen appliance isn't anything else but that. An image. It's an image beside your logo. It's definitely not part of your logo. And it shouldn't be. Not like this. It merely serves as an inappropriate logo background.\n\nYou will either have to create a proper logo symbol (should work in full colour as well as BW) or create a clean typographic one.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n_Robert Koritnik_\n\n"
    },
    {
      "time": "18 Jul 2009 — 12:59am",
      "content": "Same comments here, stick to the typo, an illustration like this have nothing to do with a logo. Maybe you could keep this illustration for corporate id like letterhead, brochure or whatever but it's not belonging to a your logo - wich color and typo are nice BTW.\n\n"
    },
    {
      "time": "18 Jul 2009 — 3:46am",
      "content": "Thanks for the comments, then I will remove the image and keep the typo.\n\n"
    }
  ]
}
