{
  "id": "59912",
  "title": "Be Somebody Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello, I’ve only recently begun to really get into logo design and this site has been very inspiring and helpful. Thanks to everyone.\n\nThat said I’m working on a logo for a political organization that I’m a part of called Be Somebody Mobile. Mobile, AL being the city in which the organization resides. Our purpose is to get people involved in their local and state politics when they may normally think they can’t do anything or it is too overwhelming. “Somebody needs to do something about the x problem” Well, be somebody.\n\nWe advocate limited government and individual liberty. I chose atlas as the logo mark because it represents responsibility and oppression, and as an added bonus can be a subtle acknowledgment of Ayn Rand’s book “Atlas Shrugged” which communicates a lot of ideas that we hold.\n\nThe problem I’m finding is that no one sees atlas in the mark until I tell them. I’ve gotten anything from a bird pooping to a cyborg kitty bent on world domination... So I guess I’m looking for ideas of how to keep the stylized look I have, yet convey the idea of Atlas without being too literal. Here is the logo and a few of the evolutions of the mark:\n\n[http://www.jreydesign.com/artwork/besomebody/atlas\\_evo.gif](http://web.archive.org/web/20090819101656/http:/www.jreydesign.com/artwork/besomebody/atlas_evo.gif)\n\n",
  "author": "<a href=\"/web/20090819101656/http://typophile.com/user/46080\" title=\"View user profile.\">unklejman</a>",
  "time": "<br>",
  "uid": "46080",
  "comments": [
    {
      "time": " 13.Jul.2009 10.37am",
      "content": "i see bull horns\n\ni think your problem is you’re too stylized at the moment. if you’re serious about the ’atlas’ theme i think you’ll have to make it more literal mainly because the link between the theme of the logo and the political organisation is a tenuous one.\n\nwhen people think of a political organisation they won’t immediately think of atlas, therefore stylizing your logo to the degree that you have weakens your design as they’re not expecting to see atlas, making it too difficult for the viewer to interpret the message you’re trying to communicate.\n\na more literal logo is a better route because although the viewer might not expect to see an atlas themed logo, their brains don’t have to work too hard at figuring out what they’re looking at.\n\nhope that helps\n\n"
    },
    {
      "time": " 13.Jul.2009 10.51am",
      "content": "Yeah I will try to think of some more ways to portray it without getting too literal and keeping some of the style. I may just think of some other ideas besides atlas as well. Thanks.\n\n"
    },
    {
      "time": " 13.Jul.2009 11.15am",
      "content": "Having the head of Atlas in white negative space separates it from the body and connects it with the space between the shoulders and the earth, creating a bull horns shape. Perhaps if all of the Atlas figure were in one color and all of the earth in the second color it would help differentiate between the two. And a more recognizable world would help to clarify your mark. Why did you choose blue and gray? Typically these are more corporate/business/tech colors. I’m guessing you want to stay away from red, white and blue, which many political organizations use. Everything about your mark looks slick for what sounds to be a grassroots organization, that’s not to say you have to swing the complete other direction and create something folksy but in it’s current state the design doesn’t suit your mission.\n\n"
    },
    {
      "time": " 13.Jul.2009 12.36pm",
      "content": "Yeah, I have been experimenting with handling the head differently. I will give that a try.\n\nAbout the color. You’re correct about avoiding red white and blue. I chose blue because it is still one of the national colors, but also sends a message of being current and not old-timey (or so I thought). I’m trying to balance being new and fresh with also having some legitimacy, if that is the right word. The grey? I thought it looked slick, but perhaps I can try some other combos.\n\nWe are definitely grass roots but we don’t want to send the message that it will be a lot of really tedious/hard work and we are trying to use technology to make contacting representatives and keeping track of legislation easier and modern.\n\n"
    },
    {
      "time": " 13.Jul.2009 3.13pm",
      "content": "Ok I made some changes. I put the Atlas figure in a t-shirt to represent the average joe and to help define the fact that it is a person. I also changed the grey to green to give it less of a colder feel and maybe to represent grass roots? Again I’m pretty new to logo design, am I headed in the right direction, or am I floundering with this?\n\n[http://www.jreydesign.com/artwork/besomebody/logo\\_draft3.gif](http://web.archive.org/web/20090819101656/http:/www.jreydesign.com/artwork/besomebody/logo_draft3.gif \"http://www.jreydesign.com/artwork/besomebody/logo\\_draft3.gif\")\n\n"
    },
    {
      "time": " 14.Jul.2009 2.32pm",
      "content": "I now see a figure holding something but I’m not sure what. Could be a logo for a fitness center as much as anything else. Initially I liked the Atlas concept, thought it was clever and seemed to convey your message but perhaps what the design is suffering from is being too clever. I may be in the minority but in envisioning Atlas I think of carrying the weight of the world on one’s shoulders. I’ve got enough on my plate, the thought of adding the weight of the world is not going to inspire me to join a grassroots program. It’s a difficult concept you are trying to illustrate with your design, and it’s obvious you’ve put a lot of time into it but, perhaps you should think of exploring other avenues. Also “Be Somebody Mobile” gives the initial impression it’s for a cell phone service, you might want to include the AL.\n\n"
    },
    {
      "time": " 14.Jul.2009 4.55pm",
      "content": "Yeah I see how it could look like a fitness center. I’ll keep thinking but I am close to my limit for a non paying job, and we need something sooner than later.\n\nBy the way, Atlas is holding up “the heavens” or what we see from the earth (space), not the earth.\n\n"
    },
    {
      "time": " 15.Jul.2009 1.04pm",
      "content": "A little research shows 2 primary options that he held the heavens, or both heaven and earth. Either way seems daunting.\n\nWhat kind of feedback are you getting from the organization? I understand you want to wrap this up, what about a clean word mark?\n\n"
    }
  ]
}
