{
  "id": "59967",
  "title": "Just playing",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "i was playing with my 3d app to make sort of looping baground for a client and i found this\n\n ![](http://web.archive.org/web/20150317224029im_/http:/typophile.com/files/oceanis_5455.gif)\n\nwhat do you think? Too much like Swisscom or different enough\n\n",
  "author": "Lefty",
  "time": "14 Jul 2009 — 7:18pm",
  "uid": "44690",
  "comments": [
    {
      "time": "14 Jul 2009 — 7:32pm",
      "content": "We're now expected to animate our logos? Oh crap, this is going to get really complicated. Don't let anyone I design for see that. Thank you.\n\n;)\n\n(and I think that was the name of the fake airline used in Airport 1975. I think.)\n\nsteve mehallo  \ntinyurl.com/mehallofonts  \nmehallo.com\n\n"
    },
    {
      "time": "14 Jul 2009 — 7:48pm",
      "content": "The Swisscom logo is alright when you see it animated.  \nBut I went home for a holiday last year and saw it  \nfor the first time on Phone-booth (beeth?), buildings etc  \nit just doesn't work for me. If you haven't seen it animated  \nit will be hard to get the connection to communication and/or  \nSwitzerland (ok there is half a swiss cross in the icon).\n\n"
    },
    {
      "time": "15 Jul 2009 — 9:37am",
      "content": "@mehallo: i promise i won't send this to any of your clients :))\n\n@agostini: i like the swisscom logo and i have the same problem, i cannot find a good way to make a static logo. But it's just experimental, not a client's job, so i don't have to hit my head on the walls to find a solution :)\n\n"
    },
    {
      "time": "2 Jul 2013 — 1:04pm",
      "content": "Its great..!!\n\n"
    },
    {
      "time": "17 Jul 2013 — 2:44am",
      "content": "Its different. I like this design- which 3D software did you use for the gif?\n\n"
    },
    {
      "time": "17 Mar 2014 — 12:27pm",
      "content": ":-) I had to laugh about mehallo’s comment :-)  \nYepp.  \nSwisscom Logo is fine. But the website is crap in my eyes…\n\n"
    },
    {
      "time": "2 Apr 2014 — 2:23am",
      "content": "It is really outstanding job\n\n"
    }
  ]
}
