{
  "id": "5998",
  "title": "Designing a font from a custom logo- how much do I charge?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I've been hired by a major advertising firm (thanks to my art director friend) to design a font from the logo of a multi-million dollar company. There is no existing font from which the logo was created.   \n   \nThis is my first time designing an entire typeface for a specific product/company. In the past, I've designed logos from my own font designs, but never in this scope.   \n   \nMy main question is- how much do I charge? And are there resources where I can find this information?   \n   \nThanks.\n\n",
  "author": "psychopomp",
  "time": "9 Aug 2004 — 5:51pm",
  "uid": "3527",
  "comments": [
    {
      "time": "11 Aug 2004 — 2:22pm",
      "content": "How much time do you expect it to take you?   \nHow much per hour do you charge for your design work?   \n   \nBased on 30 to 50 hours, which is in the ball park for such work.   \n   \n$100, $150 $200 per hour.   \n   \nSimple multiplication\n\n"
    },
    {
      "time": "11 Aug 2004 — 8:37pm",
      "content": "Just curious, James, as I've never done this kind of work before: Wouldn't you factor in some sort of multiplier on top of a simple hourly charge, since the type will presumably become part of this mega-corp's identity?   \n   \nSurely most corporate identity folks charge more for a logo, for example, than just the time it took to develop it.   \n   \n(Not that $10,000 [50 hrs. x $200] is anything to sneeze at.)\n\n"
    },
    {
      "time": "12 Aug 2004 — 5:14am",
      "content": "Every project is different. There was quite a discussion on this awhile back. Lots of factors could affect the final price. Size of the implementation (How many workstations and in how many locations?) and What level of exclusivity will be granted.\n\n"
    },
    {
      "time": "12 Aug 2004 — 8:27am",
      "content": "The single most important question in a job like this , (covered in a whole chapter of Von Clauswitz's book \"On Type\"), is \"how much have they got?\"\n\n"
    },
    {
      "time": "12 Aug 2004 — 12:11pm",
      "content": "\\> Von Clauswitz's book \"On Type\"   \n   \nI'm trying to track this down, but the only Von Clauswitz I'm finding is the war historian, and unless he was very interested in cartographic lettering I'm missing something. Help?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Aug 2004 — 12:18pm",
      "content": "I thought it was a joke, and in fact referred to \\*that\\* Von Clauswitz. At least, I laughed pretty hard, so I hope it was a joke. ![:-)](http://web.archive.org/web/20150414143843im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "12 Aug 2004 — 12:29pm",
      "content": "Considering the great imbalance of sense of humor   \nbetween David and me, that would make total sense... :-/   \n   \nhhp\n\n"
    },
    {
      "time": "12 Aug 2004 — 12:35pm",
      "content": "I was on the verge of looking it up when I got it. Come to think of it, Clauswitz should be recommended reading for client negotiations.   \nGeorge\n\n"
    },
    {
      "time": "12 Aug 2004 — 12:54pm",
      "content": "Sun Tzu as well.\n\n"
    }
  ]
}
